{
  "id": "d556-10",
  "text": "Mzovrm* for Research. oM Materials\nThe BAM has access to & vide range or rwmroes because of Its organ-\nisatieaal structure. As an institutional membership organisation, it has\ndirect contact with some 600 radio sod television stations and production\ncenters located to schools, colleges, and universities throughout the\ncountry. The effectiveness of these contacts is enhanced by the follow¬\ning mechanism used in the institutional membership structures\n1* The mm Radio Tape Network which cooperatively acquires,\nproduces, sad distributes sons SO hours of recorded radio programing\neach week.\n2* The Committee system under which the Program committee\nconstantly reviews progress from schools and colleges and lay sources,\nand selects the best available for the HAEB network service.\n3* The interchange of information ataoung the schools and col¬\nleges that are members of BAM regarding pertinent academic and technical\nproblems and procedures.\n4* The cooperative use of needier institution script and record¬\ning libraries.\nAs a professional organisation of individual educators and technics-\nIans, the BAEB acts as a clearing house of standards and talents. It\nmaintains a placement service that certifies and refers hundreds of\npeople in educational radio and television each year. It maintains a\nfile on educational and technical compenteneies *nd cm individual avail¬\nability. This file is now being enlarged and enhanced by a National\nSurvey of Ibrsonael in £&acatianal Television that will list in detail\nthe training, experience, and compenteneies of educational television\nprofessional personnel in every institution and installation in the\nUnited States. The data is processed fear eosgaater sorting and rapid retrieval.\nThis service Is possible for MAES to recruit and assign project person¬\nnel with an efficiency not generally available.\nAs a irofcssioaal association, the SAEB maintains a permanent admin¬\nistrative staff and a staff of educational and technical consultants.\nThe engineering department has available to it some of the outstanding\ndesign and system engineers in the bhited States. This service is head¬\ned by C*H* Jansky of the firm of Jansky and Bailey. The research and ref¬\nerence resources of ms greet technical organisation is a part of regular\nBAM service.\nThe research and development service of BAM has ccmqOeted two nation¬\nal studies during the past two years In cooperation with the United States\nOffice of Education and The Federal Communications Commission. It is now\nin the process of completing two additional national studies that will be\npublished early in 1$®3* This department has also made a study of the\nneeds of emerging countries fbr educational technology and written s import\nfor the Department of State."
}