{
  "id": "d1194-0",
  "text": "1346 Connecticut Avenue, N.W.\nWashington 6, D. C.\nPhone North 7-6000\nVol. II No. 9\nSeptember 19 63\nNAACP INTEREST IN FEDERAL ETV ASSISTANCE\nThrough the timely intervention of NAEB, the South Carolina application was\nkept alive and a possible disruption of the entire ETV Facilities Program averted.\nJust prior to the end of the thirty day comment period for the South Carolina\napplication for Federal assistance, HEW received a letter from NAACP requesting\nan additional thirty days to allow it to complete its investigation of certain issues\nit felt might be involved. These included: the record of participant educational\ninstitutions with reference to equal educational opportunity, possible use of TV\nfor furthering racial bias, denial of equal employment opportunities in the TV\nindustry, etc. HEW granted the thirty day extension.\nSince the South Carolina matching funds would lapse before the end of the\nextended period, this meant the State would be unable to comply with the terms of\nthe application to obtain Federal funds for the two TV stations it plans to build,\nand thus deny to several thousand school children the benefits of improved\ninstruction during this coming school year. Moreover, as soon as the situation\ncame to the attention of the S. C. Congressmen, there was strong reaction that\nmight well have developed into a situation with adverse consequences to the\nprogram for all the states. There was talk of a Congressional Investigation of the\nwhole HEW - ETV program, an action which would have frozen all grant activities\nfor several months, and there was likelihood of debate in the Senate aimed at the\nETV provision in the HEW budget request.\nNAEB called on the lawyer for NAACP’s Washington bureau. We explained the\nconsequences of this extension and its possible wider repercussions; we reviewed\nthe record of ETV and the immense benefits it had brought to the South in terms of\nbroadened educational opportunity for all children, as well as adults. The lawyer\nindicated that the NAACP action was not aimed at ETV per se, but that such\ninvestigation was a regular procedure in all cases of Federal assistance programs.\nThis one had not come to their attention till late; hence, the last-minute request\nfor extension. Under the circumstances, he felt they would probably be willing to\nwithdraw the request."
}