{
  "id": "d1194-1",
  "text": "-2-\nThree days later, the HEW budget was abruptly put on the calendar for Senate\nconsideration, and the word was, that in the absence of any action from NAACP,\nthere would unquestionably be a direct attack upon the $7 million ETV request.\nIt was not till 11:3 0 AM that we were able to reach the NAACP lawyer. He said\nhe had not yet written the letter but intended to. We explained the exigency of the\nsituation. He agreed to call the Under Secretary and verbally withdraw the request.\nThis he did and the Under Secretary cancelled the extension.\nThat afternoon the HEW budget was passed with the $7 million ETV provision\nintact.\nIn a follow-up letter, NAACP made it clear that this action did not lessen its\ninterest in clarifying certain policy questions involved in the ETV Facilities Program.\nIn addition to issues previously raised, concern was expressed with respect to the\nparticipation of colored teachers in the presentation of such programs. Denial of\nsuch participation, the letter said, would be “a violation of the constitutional\nrights of both colored teachers and students, when the programs are supported by\nboth State and Federal governments.”\nIt is clear that all future applications for ETV facilities will be reviewed by\nNAACP with respect to these issues, but any comments it may care to make will\nbe made within the normal thirty day period.\nIn the formulation of policies and procedures under which proposed new or\nexpanded facilities will operate, applicants may wish to take into consideration\nsuch points as the following:\n1. Opportunity for participation by qualified people (of any race) in the preparation\nand presentation of programs.\n2. Provision for equal acess to facilities that will insure ail students full\nparticipation in the benefits of ETV.\n3. Assurance that programs on controversial issues will be balanced and that there is\nprovision for expression of minority views.\n4. Adherence to national policies in reference to equality of employment opportunities\nin the staffing of the station.\n5. Provision for people representing a variety of interests and backgrounds in the\ncomposition of the Board and/or Commission, Advisory Council, Curriculum\nCommittee, etc.\n6. Provision for full community participation in “the activities” of the station\n(without discrimination etc.)"
}