{
  "id": "d563-38",
  "text": "Decade\nThe national enterprise known\nas educational television, or etv,\nemploys thousands of people, uses\nfacilities worth hundreds of mil¬\nlions of dollars, and reaches mil¬\nlions of men, women, and children.\nIts motivation is noncommercial.\nIt seeks to educate, although etv\nsometimes entertains in the sense\nthat learning may be a delight as\nwell as a discipline. It regards the\naudience not as a passive mass but\nas active viewers with diversified\ninterests and abilities, etv aims to\nprovide experiences that change\nthe viewer by either serving his\neducational, cultural, or vocational\ninterests, altering his prejudices or\nperspectives, or making him sensi¬\ntive to his place in society.\netv is of two principal kinds.\nOne, known by such terms as uin¬\nstructional television” or “in¬\nschool television,” consists of les-\ni\n2\nIt happens to be Thursday, March 31, 1960:\n2 p-m. in Lincoln, Nebraska. Hobart Hays puts\nthe finishing touches to a three-foot model of the\nGlobe Theatre of Shakespeare’s London. Hays, an\nartist for the Nebraska in-school television proj¬\nect, has detailed the model down to the galleries,\ninner stage, and cupola. In a few minutes, the tele¬\nvision camera lens will explore it at close range\nwhile Miss Esther Montgomery, who teaches a\nthree-day-a-week high-school English course on\ntelevision, lectures on Hamlet. She will also play\na record of actor John Gielgud reading parts of\nAct II as the screen shows photographs of him\nand other eminent actors playing Hamlet. Hun¬\ndreds of students in the Lincoln area will watch\nas a television teacher re-creates the mood of the\nElizabethan theater and times.\n10 a.m. Turning in the Bible to Kings II, chap¬\nter 2, verse 8, John Morris finds the passage:\n“And Elijah took his mantle, and wrapped it\ntogether, and smote the waters, and they were\ndivided hither and thither ...” Morris is pro¬\nduction manager of WCET, the ETV channel in\nCincinnati. Later the citation will be lettered on a\nplacard for a program titled, “The Jordan Rift.”\nThe program is part of “Archaeology and the\nBible,” a sixteen-week series telecast by WCET\nto Cincinnati and northern Kentucky and later\nby ETV stations throughout the country. The\nseries is conducted by Dr. Nelson Glueck, world-\nfamous Biblical scholar and archaeologist."
}