{
  "id": "d563-40",
  "text": "Decade\n4\nThe Learning Lens: I\nsons and courses regularly taught\nby television for credit in schools\nand colleges. The other, known as\n(<adult programming” or ucom¬\nmunity television ,” consists of pro¬\ngrams for the general public.\nFamiliarity with etv depends\non where one lives. Around Pitts¬\nburgh, for example, etv is a part of\neveryday life. Through Pitts¬\nburgh’s two etv channels, adult\nprogramming reaches an audience\ni l .\n£\nr\nof one million, and in 3,566 class¬\nrooms students are taught partly\nby television. In other communi¬\nties, etv exists for teaching but not\nfor general viewers, or vice versa.\nAnd in some places, etv is unheard\nof or regarded vaguely as an iso¬\nlated experiment; invariably, these\nare places where etv hardly exists\n—like New York and Los Angeles.\nAlready a major new cultural as¬\nset in the United States, etv owes\n6:30 a.m. With his first morning cup of coffee\nstill steaming, Ralph Bogertman sits in his living\nroom watching a television lecture on Faraday’s\nlaws and the chemical changes produced at the\nelectrodes of a cell. This is Number 121 in a 160-\nlesson course, “Modern Chemistry,” televised\nthroughout the United States on “Continental\nClassroom ’ ’ over the National Broadcasting Com¬\npany network. Bogertman is a Ridgewood, N. J.,\nhigh-school science teacher. He is taking the course\nfor credit toward a master’s degree at Montclair\nState College. On Saturday he will go to the cam¬\npus for a discussion period and laboratory work.\nHe is one of 3,000 teachers taking the course\ntoward advanced degrees in education. The aim:\nto improve the quality of science teaching in high\nschools. The way: to give teachers, and college\nstudents about to become teachers, an up-to-date\nchemistry course taught by a leading chemistry\nprofessor. That is Dr. John E Baxter. A few hours\nafter Lesson 121 goes off the air, Professor Baxter\nis in a New York television studio recording Les¬\nson 130 for telecasting two weeks hence."
}