{
  "id": "d563-41",
  "text": "3 p.m. In a darkened projection room in Chicago,\neducation officials and television specialists view\nrecorded television lessons. They are nearing the\nend of a talent search for teachers in the Mid¬\nwest Airborne Television Instruction experiment.\n1\nJ > si 1:\n1\n\\\nAt an aircraft plant in Burbank, California,\nmeanwhile, Grove Webster, of the project’s engi¬\nneering staff, arranges for delivery of one of two\nfour-engine aircraft that will be used in the ex¬\nperiment. Beginning early in 1961, the plane will\nbeam tape-recorded television courses to hundreds\nof thousands of students in a 400-mile-wide circle\nincluding parts of Illinois, Indiana, Kentucky,\nMichigan, Ohio, and Wisconsin.\n8 a.m. In classrooms and dormitories on the\nsprawling University of Illinois campus at Ur-\nbana, students watch Dr. Robert W. Janes, a\nsociology professor, discuss The Lonely Crowd,\nclassic study of the American character by David\nReisman. Three hundred and eighty students,\nfreshmen mostly, are enrolled in Dr. Janes’\ncourse, “Community and Society.” His twice-a-\nweek television lectures are supplemented by\nclassroom discussion periods on two other days.\nThis morning he shows symbols for some of the\nmain terms in The Lonely Crowd—for “inner-\ndirected man,” a gyroscope; for “tradition-\ndirected, ’ ’ ritual masks; and for ‘ ‘ other-directed, ’ ’\na radar screen. ‘ ‘ Television helps deal with such\nabstract concepts,” he says. “The moment a stu¬\ndent questions the use of a particular visual sym¬\nbol, a searching exploration of the meaning of the\nconcept is under way.”\n11:15 a.m. Snipping construction paper and\ntwisting pipe cleaners, Mrs. Ruth Abbott fashions\ntulips and jonquils. About 1,500 Oklahoma third-\ngrade school children are watching her televised\nart course. After Mrs. Abbott’s fifteen-minute les¬\nson on paper sculpture, children in 170 classrooms\nthroughout the state will go to work. Homeroom\nteachers, equipped with a work sheet prepared for\nthe course, supervise the classes. Before art les¬\nsons were televised, most art instruction in the\nstate lacked the ingenuity and experience that\ncomes only from teachers (like Mrs. Abbott) spe¬\ncialized in art education. Oklahoma City had only\nthree art teachers to cover eighty elementary\nschools."
}