{
  "id": "d563-58",
  "text": "22\nScope\nthe size of the audience. Even\nwhere in-school television is most\ndeveloped, no student receives\nmore than an hour and a half a day\nof televised instruction. Less than\nten per cent of the forty-five mil¬\nlion school and college students in\nthe United States take courses by\neducational television, etv cultural\nprograms, free of mass-audience\ncompulsion toward a lowest com¬\nmon denominator, seldom com¬\nmand the audiences of commercial-\nnetwork “spectaculars.” Still, mil¬\nlions of American men, women,\nand children regularly view etv,\nand the chances are that etv will\nat least double its audience in the\ndecade to come.\nThe Learning Lens: III\nanother viewed through ideas in books. . . . “ The\nArts Around Us, ’ ’ thirteen programs on the tech¬\nniques and principles of painting, using original\nworks from museums and private galleries....\nPresentations of such groups as the Fine Arts\nQuartet, the Boston Symphony Orchestra, and\nthe Martha Graham Dance Company.\nSince the NET Center was established in 1953, it\nhas been supported by Ford Foundation funds\ntotaling $21.2 million. The last general-support\ngrant was made in 1959 for a five-year period,\nduring which the Center hopes to develop major\nfinancial support from other sources—philan¬\nthropic and other nonprofit institutions, private\ncorporations, and individuals.\nIn the spring of 1955, when Pennsylvania State\nUniversity began instruction by television, resi¬\ndent enrollment was just short of 12,000. By the\nstart of the 1960-61 academic year it had climbed\nto over 14,500, and ETV had so proved itself as a\nmeans of coping with the increasing number of\ncollege students (while maintaining quality of\ninstruction) that it was accepted as a continuing\npart of the University’s instructional program.\nThe ETV project started with grants from the\nFund for the Advancement of Education and is\nnow supported entirely by the University.\nIt grew to the point where 5,800 student credit\nhours were being taught in eleven courses given\nfor full academic credit. Penn State’s is the most\nextensive college-level ETV system and the most\nheavily researched. At one time, five psychologists\nand educational researchers were devoting full\ntime to acquiring objective, statistical knowledge\nof ETV in four general areas: effectiveness com¬\npared to conventional teaching, appropriateness,\nacceptability, and feasibility. Within these areas,\nhundreds of detailed points were explored. Tests\nnot only calculated retention of facts taught by\ntelevision but also assessed students’ ability to\napply principles to the solution of problems and\nto interpret data and draw valid conclusions.\nResearchers also compiled data on ETV’s effect\non the attitudes and value judgments of students,\nthe cost of televised versus regular instruction,\nand faculty preference between teaching by tele¬\nvision and teaching to overcrowded classes face\nto face.\nBy the fall of 1959, Dr. G. R. Carpenter, director\nof academic research at Penn State, stood before\na national research symposium and, in effect,\npleaded for a halt to certain frequently traveled\navenues of research on educational television.\n‘ ‘ We do not need more demonstrations that con¬\nventional x, y, and z courses can be taught by tele¬\nvision,” he said. “Comparisons of results of teach¬\ning courses conventionally with teaching the same\ncourses... by television is a type of research which\nhas run its course. There have been enough demon¬\nstrations that television can be useful in many\nsupplementary ways in an extensive school sys¬\ntem, city, or region. ’ ’ Instead, he suggested basic\nETV research on the learning process, motiva¬\ntion, criteria for selecting television teachers, and\ncombination of ETV with other media."
}