{
  "id": "d563-66",
  "text": "Problems\nOne-fourth of the nation—some\nforty-five million youngsters and\nadults—are engaged in some pro¬\ngram of formal education. Teem¬\ning with problems, American edu¬\ncation is in a ferment of analysis,\nexperimentation, and innovation.\netv is a versatile instrument for\ngrappling with major problems:\nThe shortage of teachers — It\ncould be met either by a mass\nmovement to the teaching profes¬\nsion by the best college graduates\nor by relaxation of standards to\npermit less-able men and women to\nteach. The first way is virtually im¬\npossible, the second is undesirable.\nAnother way is to make better use\nof good teachers. Efforts are being\nmade to relieve teachers of non¬\nteaching chores by use of instruc¬\ntional secretaries and other non¬\nprofessional assistants. Teachers\ncan function in teams to reach\nThe Learning Lens: V\n30\nDr. Lester Beck, an experimental psychologist at\nPortland State College and a veteran of twenty-\nsix years’ teaching, was curious about the relation\nbetween a student’s ability and his reaction to\nETV. Since enrollment in the televised section of\nBeck’s general psychology course is voluntary,\none measure was the percentage of students re¬\nenrolling in the televised section after the first\nsemester. Beck found that the higher the student’s\ngrade, the more likely he was to re-enroll in the\ntelevised section —92 per cent in the case of “A”\nstudents; “B” students, 82; “C,” 58; “D,” 20;\nand “F,” 17 per cent.\nAbout 300 colleges and universities now give\ncredit for televised courses. This represents only\n15 per cent of the country’s institutions of higher\nlearning. But the number a year ago was 186, and\ntwo years ago, only eighty-seven.\nIf televised teaching is a revolution in many\nschool systems, on college campuses it is taking\nroot as a matter of evolution. Many college teach¬\ners greeted ETY with skepticism or open hos¬\ntility. According to Professor Glenn Starlin,\ndirector of Oregon’s interinstitutional ETV proj¬\nect, the chilly reaction is thawing.\nETV is particularly useful in handling the large\nnumber of students enrolled in general courses\nfor freshmen and sophomores. On many cam¬\npuses, conventionally taught lecture sections of\n150 students or more are not uncommon. Many\nstudents, at a time when their habits and atti¬\ntudes toward higher education are forming, are\nleft to the care of less-experienced younger fac¬\nulty members and graduate assistants. ETV en¬\nables more-experienced professors to reach these\nlarge undergraduate classes, and in experiment\nafter experiment students prefer televised teach¬\ning by seasoned teachers to face-to-face teaching\nby less-experienced teachers.\nIn the colleges as in the schools, moreover, there\nare some fields with no teachers or just a handful.\nProfessor E. G. Ebbighausen, for example, is the\nonly professional astronomer in the state of Ore¬\ngon. “I first turned down an offer to teach on\ntelevision,” he recalls. “I’m an informal lecturer.\nI thought, how do I interact with this inanimate\ncamera? It doesn’t laugh, it doesn’t grin, it\ndoesn’t look sour when a student misses the point.\nWell, I must say that I am enjoying myself, partly\nbecause I’m teaching students on campuses that\nsimply never had astronomy before.” Ebbig¬\nhausen, who teaches at the University of Oregon\nat Eugene, was referring to Oregon State College,\nat Corvallis, and the State College of Education,\nMonmouth. These, along with Portland State and\none private college, are joined in Oregon’s inter¬\ninstitutional television project, in which 3,000\nstudents have taken one or more televised courses\nfor credit.\nHere is how ETV widens the range of Lester\nBeck’s course in general psychology: “I’ve had\ncolleagues from all over the country appear;\nthey’re glad to do this for a single television lec-"
}