{
  "id": "d563-72",
  "text": "Problems\n36\nThe Learning Lens: V\ncall for additional apparatus, etv\nreduces the cost by making one\npurchase serve many classes. And\netv adds a new dimension to school,\ncollege, and university activities in\nadult education, ranging from\nreading and writing for illiterates\nto instruction for college credit.\nSlow and fast students—There is\nincreasing concern for the talent\nlost to society from two sources:\nthe slow student, who with more at¬\ntention and guidance might finish\nschool and go on to some form of\nhigher education; and the bright\nstudent chained to the average\npace of his age group, etv, com¬\nbined with team teaching, often\npermits more attention to the first\ngroup. For brighter students, etv\nprovides material beyond the cur¬\nriculum, offers work for advanced\nstanding in college, and aids inde¬\npendent learning.\nWhile this ubiquitous appeal was welcome, the\nspecific objective of the project was, and is, to\nraise the level of high-school teaching by expos¬\ning teachers to current developments and suggest¬\ning ways of teaching them to their classes. In\nphysics, the problem was particularly acute:\nMost of the nation’s physics teachers had never\ntaken more than elementary college physics and\nmany schools had no physics teachers at all.\n“Continental Classroom” has been watched by\nat least half of the country’s 70,000 high-school\nscience teachers. They report—and objective stud¬\nies confirm—that they are bringing new subject-\nmatter and teaching techniques to their class¬\nrooms. In its second year, “Continental Class¬\nroom” re-ran the physics course a half-hour ear¬\nlier, at 6 A.M., and in the 6:30 slot introduced a\ncourse in modern chemistry. In its third year,\nbeginning in September, 1960, chemistry was\nre-run at 6 A.M. and mathematics started at 6:30.\nPhysics was no longer telecast over the national\nnetwork but was being distributed by other means.\n“Continental Classroom” has involved close co¬\noperation among schools, colleges, universities,\nand specialists in education and the subject fields\nthemselves. The project, originally under the\nauspices of the American Association of Colleges\nfor Teacher Education, is now administered by\nLearning Resources Institute. Courses were plan¬\nned with the American Chemical Society, the\nConference Organizations of Mathematical Sci¬\nences, and other professional groups. The teachers\n—Dr. Harvey White and Dr. John L. Kelley of the\nUniversity of California, Berkeley; Dr. John E\nBaxter of the University of Florida; and Dr.\nFrederick Mosteller of Harvard University—are\nseasoned professors. To lecture on special as¬\npects, they have brought guest lecturers, includ¬\ning fourteen Nobel Prize winners, before the\ncameras. A special effort is made to disseminate\nnew teaching techniques twice a week in the math¬\nematics course by Dr. Julius H. Hlavaty, a high-\nschool teacher, and Professor Paul C. Clifford of\nMontclair State College. Procedures for granting\ncredit, examinations, supplementary discussion\nand laboratory work, and other details are under\nthe control of the colleges and universities that\ngrant credit for the courses. Between eight and\nten thousand students registered for credit. These\nincluded not only teachers but college students\nand gifted high-school students seeking advanced\nstanding in college. Seventy-four per cent of the\nstudents in the chemistry and physics courses\npassed, 5 per cent failed, and 21 per cent dropped\nout. Although most viewers watch “Continental\nClassroom” in their homes, groups also watch in\ndormitories, high-school and college classrooms,\nand engineering laboratories.\nAlthough the Ford Foundation and the Fund for\nthe Advancement of Education provided the larg¬\nest single contribution ($612,000) toward the first-\nyear costs of “Continental Classroom,” and the\nFoundation made grants totaling $1 million for\nthe second and third years, it is now supported\nprimarily by gifts from ten corporations."
}