{
  "id": "d563-79",
  "text": "We are accustomed to finding Alabama on the\nbottom step of the ladder in many education\nareas. . .. Therefore, when the state is a leader in\none area of education, it is worthy of some note.\nSuch is the case in the field of educational tele¬\nvision . . .—The Tuscaloosa News\nAlabama opened the nation’s first live ETV net¬\nwork in 1955, after the Legislature appropriated\n$500,000 to activate three YHF educational chan¬\nnels. Ford Foundation funds have been granted\nsince 1956 to assist production of televised in¬\nschool courses. Thoughtful educators and citizens\nin Alabama are first to acknowledge that the state\nhas an uphill struggle to improve its educational\nsystem. The shortage of qualified teachers is acute.\nMany good teachers are lured from the state by\nhigher salaries in neighboring Georgia and Flor¬\nida. In 1954-55, nearly 500,000 pupils took in¬\nstruction from teachers holding emergency teach¬\ning certificates.\n“We don’t pretend that ETY alone is going to\nsolve our educational problems,” says Edwin L.\nWilliams, Jr., a former teacher and Air Force\nhistorian who is ETV Coordinator for the Ala¬\nbama State Department of Education, “but it\nhas put us years ahead of where we would be\notherwise. ’ ’\nCovering over 30,000 square miles, the Alabama\nETY network consists of three stations linked by\nmicrowave relay stations: WAIQ, Andalusia;\nWBIQ, Birmingham; and WCIQ, Munford.\nCourses are fed to the network from studios op¬\nerated by the University of Alabama in Tusca¬\nloosa ; Auburn University, Auburn; and the\nGreater Birmingham Area Educational Televi¬\nsion Association, Birmingham. On the college\nlevel, the University of Alabama telecasts several\ncredit courses.\nMore than 300,000 pupils in more than 600 schools\nin four-fifths of the state are using ETY pro¬\ngrams. Alabama educators pin their hopes on two\naspects of ETV. One is the teaching of subjects\nfor which many schools have unqualified teachers\nor none at all—music, art, languages, and the\nsciences. (ETY returned Latin, which had been\ndropped a generation ago, to Alabama schools.)\nThe other is the upgrading of teachers by tele¬\ncasting in-service programs on teaching tech¬\nniques and guidance, and courses to help teachers\nattain regular teaching certificates or degrees.\nThe ETV network provides a range of opportuni¬\nties even in an educational system caught short in\nthe 1960s. For example, it enables 450 students in\nfifteen Alabama high schools to watch an up-to-\ndate televised course in Russian four days a week.\nAnd youngsters in schools that lack a single piano\nor record player are now dancing and singing to\nthe upper-elementary-grade televised course,\n“Music Time.”\nSometimes human resources go far in offsetting\nthe lack of funds. The consolidated school in rural\nMarbury, Alabama, has twelve grades, twelve"
}