{
  "id": "d563-82",
  "text": "Technology\n46\nThe Learning Lens: YI\nplacing a motion-picture camera\ndirectly in front of a television\nscreen, are not uniformly satisfac¬\ntory. A major technical revolution\noccurred with the development of\nvideotape, a system of high-quality\nrecording of the picture and sound\nof a telecast on magnetic tape. To\naccelerate the videotape revolution\nin etv, the Ford Foundation grant¬\ned $4,588,000.\nState and regional networks—Iw\n“live” etv networks, lessons or\nprograms are telecast simultane¬\nously over two or more etv stations.\nNetworks may also operate by\nbeaming a signal from one station\nto another for taping for broadcast\nat some later time. Or tapes them¬\nselves may be duplicated and ex¬\nchanged among stations. Assist¬\nance to state and regional networks\nis one of the latest aspects of the\nFoundation’s support for etv.\nAeronautically, the plane shown in the diagram\nopposite is uninteresting and in many ways obso¬\nlete. It will set no speed or altitude records. But\nit may make educational and electronic history in\nan experiment that, in the words of a New York\nTimes editorial, “staggers the imagination.” The\nplane is a “ flying classroom ’ ’ used by the Midwest\nProgram on Airborne Television Instruction\n(MPATI). It was scheduled to begin broadcasting\ntape-recorded courses to students in an area in¬\ncluding parts of Illinois, Indiana, Kentucky,\nMichigan, Ohio, and Wisconsin in the Spring of\n1961.\nEducationally, the experiment has the same basic\naim as other ETV projects: To bring a full, qual¬\nity curriculum, plus the talents of outstanding\nteachers, to more students. The novelty lies in its\nscope. The plane serves as a “flying antenna”\ncapable of reaching far more students, at a\nlower cost per student, than any existing ETV\narrangement. By flying four miles above a point\nin northeast Indiana, the plane will transmit\ncourses 150 to 200 miles in all directions to an\narea that includes five million students and 13,000\nschools and colleges. It can reach big-city schools\nand remote rural classrooms with the same ease\nand at the same cost.\nThe experiment also has the potential for over¬\ncoming what is perhaps the greatest obstacle to\nfull use of teaching by television — the limited\nnumber of courses a television system can broad¬\ncast simultaneously. The typical grade 1-through-\n12 school system has from 100 to 175 separate\ncourses, and the curriculum is even greater at\nthe college level. Yet the conventional open-cir¬\ncuit television system can broadcast only one\ncourse at a time — that is, one half-hour lesson at\neach grade level in a six-hour school day. (Closed-\ncircuit systems, like Hagerstown’s, can broadcast\nseveral courses simultaneously but are costly\nover appreciable distances.) The airborne experi¬\nment will begin by telecasting over two channels\nallocated to it by the E C.C. and may eventually\nbroadcast over as many as six, for a total of six\nlessons at each grade level during a school day.\nInitially financed with Ford Foundation grants\nof $5.5 million and funds from other foundations\nand industry, the project is designed to be self-\nsustaining ultimately with contributions from\nparticipating school systems.\nAfter a period of demonstration telecasts, a full\nacademic year of airborne telecasts will begin in\nSeptember, 1961. Educational preparations for\nthe opening of the experiment rivaled the in¬\ntricacies of the electronic research necessary to\nget the experiment off the ground. The project\nwas guided by a council of Midwest educators\nheaded by Dr. Samuel M. Brownell, former United\nStates Commissioner of Education and presently\nsuperintendent of schools in Detroit. Another\ngroup of educators selected the courses after con¬\nsulting school officials throughout the region. A\nthird committee conducted a talent search by\nviewing kinescoped recordings of about 300 teach-"
}