{
  "id": "d563-92",
  "text": "Offstage\n56\nThe Learning Lens: VIII\n“Early in the game,” recalls one\netv station manager, “many of us\nwere troubled by a hind of occupa¬\ntional schizophrenia: Were we bas¬\nically educators trying to be broad¬\ncasters or broadcasters trying to be\neducators f I think etv came of age\nwhen we stopped ashing that ques¬\ntion, not because it was answered\nbut because it became unreal, etv\nbecame a fusion of the highest pro¬\nfessional shills of both education\nand broadcasting.”\nThe offstage players include edu¬\ncational supervisors, curriculum\nspecialists, and psychologists on\nthe one hand, and producers, ar¬\ntists, cameramen, and other studio\npersonnel on the other. Many of the\nlatter have declined better-paying\njobs outside etv. Indeed, many are\nveterans of commercial television.\nTheir acute consciousness of etv's\ncentral educational purpose is re-\nAs a lighting director for the Columbia Broad¬\ncasting System, Greg Harney, Jr., had worked on\nthe commercial network’s top-rated musical and\ndramatic shows. The pay was good and the facili¬\nties unsurpassed, but after eight years at C.B.S.,\nhe could look forward to a lifetime professional\ncareer only in the specialized field of television\nlighting. For Harney, whose theatrical interests\ninclude acting in the community theater and\nplaying the folk guitar, that prospect was too\nconfining. In 1958, Harney participated in a Ford\nFoundation program designed to lend the talents\nof commercial-television specialists to ETV. He\nlater took a one-year leave of absence from C.B.S.\nto serve as production manager for WGBH, the\nETV channel in Boston. Harney found the kind of\nwide-ranging professional stimulus he had been\nlooking for. The job called forth his skills not\nonly in lighting but in direction and other aspects\nof production. He remained with WGBH.\nOne of the first ETV works Harney directed was\n“A Time to Dance.” The nine-week series was\nconceived and written by Martha Myers, associ¬\nate professor and teacher of dance at Smith Col¬\nlege. It was built around her discussion of the\nhistory and theory of the three basic forms of\ndance: ethnic, classical, and modern. The narra¬\ntion was vividly reinforced by the use of film\nclips, old ballet prints, sculpture, and perform¬\nances and demonstrations by such dancers as\nMaria Tallchief, Andre Eglevsky, Jose Limon,\nNora Kaye, Geoffrey Holder, Bambi Linn, and\nMelissa Hayden. “Although painstakingly re-"
}