{
  "id": "d563-94",
  "text": "Offstage\nfleeted by a spirit of self-criticism.\nInstead of relying only on the fa¬\nvorable newspaper criticism they\nenjoy, the creators of etv apply\ntougher measurements. For in¬\nstructional television, these include\nachievement by students, effective¬\nness of televised material in class¬\nroom follow-up, and the reaction\nof students and classroom teachers.\nFor general etv programs, the test\nis the degree of community support\n—as tangible as meeting the payroll.\nAn enterprise that spends money\ninstead of making money, etv is an\nendemically low-budget operation.\nSensitive to the possibility that\n“noncommercial” may be equated\nwith “amateur,” many etv station\nmanagers maintain rigid require¬\nments. They are often the envy of\ntheir commercial counterparts, be¬\ncause in most cities the etv station\ndoes far more live programming.\nVIII\n58\nConsciousness of educational purpose is keen\neven in ETV dealing with entertainment forms.\nThe series “Great Plays in Rehearsal,” for ex¬\nample, consists of the rehearsal of scenes from\ntheater classics, with frequent and deliberate in¬\nterruptions to permit explanations of key points\nor replayings of scenes. “Thus,” says Professor\nRaymond J. Stanley of the University of Wis¬\nconsin, executive director of the series, ‘ ‘ not only\nis the audience exposed to the content of great\nplays like Candida, The Master Builder, Lysis-\ntrata, and The Misanthrope, but its attention is\ncompelled by an effective teaching technique.”\nTapping a stiff sheet of corrugated fiber glass,\nHoward Hansen explains, “ It’s been lying around\nhere for months. We got it for a particular pur¬\npose, then found it wouldn’t work. Yet we can’t\ndo much else with it. It’s already formed. Your\nimagination can’t play on it.”\nHansen, an artist and set designer for KRMA-TV,\nthe educational-television station in Denver, is\nmore at home with common materials (burlap,\nwood, plaster, cardboard, paint, string), of which\nhis imagination makes uncommon use. The storage\nareas of KRMA’s studios display the crazy-quilt\nevidence of his inventiveness—a cardboard sub¬\nmarine conning tower, a replica of an adobe-and-\nlog church, a gaudy backdrop for a scene in a\ndance hall, a toy-house set for a children’s show.\nLow budgets, tight schedules, and limited staff\nchallenge an ETV artist’s ingenuity. In making"
}