{
  "id": "d563-98",
  "text": "Audience\nfull,it is in the voters’ hands. Some¬\ntimes, support comes directly from\nindividual viewers. In Boston, in¬\ndividuals contribute $10 a year to\nbecome subscribers to WGBH, and\nthis pays almost half of the sta¬\ntion’s annual $450,000 operating\nexpenses. In San Francisco and\nelsewhere, the public responds to\nspecial fund-raising drives for etv.\nIn other communities, financial aid\ncomes from civic groups, corpora¬\ntions, philanthropies, newspapers,\nand commercial broadcasters.\netv repays community support\nwith the hind of direct educational\nand cultural enrichment described\nin this report. It is powerful as an\ninstrument for teaching funda¬\nmentals; the etv channel in Mem¬\nphis has taught more than 1,000\nilliterates to read and write. And it\nis useful in more mundane ways.\nIn a series conducted over WGET,\nThe Learning Lens: IX\nAfter thirty-two years of teaching under a vari¬\nety of good, bad, and indifferent conditions,\nwhite-haired Marian V. Gittings might be ex¬\npected to be hardened to the realities of schooling\nand inhospitable to changes in the ways of the\nclassroom. Yet when ETV came to the pleasant,\nmodern elementary school in the middle-class\nHagerstown residential section where she now\nteaches, Miss Gittings reacted with neither indif¬\nference nor hostility. A classroom teacher, she\nsums up her reaction to ETV by the adage, “two\nheads are better than one.” Long experience has\nsharpened Miss Gittings’ sensitivity to pupils’\nproblems. Reading is one of them, one on which\nETV has made a major attack. “Remedial read¬\ning is an essential part of elementary education\nthese days,” she notes, “but all teachers know\nthat it carries with it a social drawback. Special\nreading classes sometimes stigmatize pupils. Poor\nreaders are singled out as ‘different.’ A child’s\nmind can magnify this deficiency into a major\npersonality defect. The remedial and develop¬\nmental reading courses given over television elim¬\ninate this kind of separation and possible stigma.\nWhat is equally important, they help increase the\nreading speed of pupils with average or good\nreading ability.\n“And take science in the grade school. I’ve had\nno special training in science, but I try to keep\nup enough so that I can teach some of the ele¬\nments. It isn’t easy. There’s never enough time,\nand to simplify without sugar-coating takes a lot\nof preparation. Once I was teaching my class"
}