{
  "id": "d1229-0",
  "text": "// £■ w S L FI TFV?\nOffice of Executive Secretary\nUrhana, Illinois\nJanuary 15, 1939\nWHAT ARE YOUR STANDARDS?\n3. Howard Evans, Secretary of t;he National Committee on Education by\nRadio, 1 Madison Avenue, New York City, is collecting dj ta on the\nstandards whic control selection of proprams to be broadoast by\nmember stations of NAEB. Will you please send direct to Mr. Evans\nany statement you mgty have on jour station policy In the selection\nof broaddast programs And also send a copy to your Executive\nSecretary. Pronto, PleaseS\nPCC REPORTS TO CONGRESS\nThe Federal Communications Oomnisslon has made \"substantial progress*3\nin increasing its effectiveness as a regulatory agency through chargee\nin practices, procedure and organization, Chairman Frank R. MpNlnch\nhas told the Congress In a letter of transmittal, accompanying the\nCommission11 s annual report to the Congress, Mr. McNlnch said that\nreforms already effected 'promise decidedly improved administration\nof the Communications Aot;«\"\nHis letter added: \"These reforms have two broad purposes: First,\ngreater efficiency, and second, the utmost protection attainable\nagain?* possible improper influence by those having business with\nthe commission.\"\n*pe accumulation of broadcasting oases and other work \"has been\nnandled and made practicably current\" through a speeding up of\nactivity and a great deal of overtime work, the Chairman said.\nHe noted also the abandonment of the divisional method or organ¬\nization, the abolishment of the Examining Division and other steps\nto reorganize the Comnisnlon*s administrative set-up.\nReorganization steps alone, however, \"cannot be a complete cure\"\nfor the Commission*s overload of work, Chairman McNinch said, pointing\nout that the administrative tasc throughout the range of the Commis¬\nsion8 s functions is large, varied and difficult. He continued:\n'♦Experience has demonstrated that the Commission is gravely under¬\nstaffed for its task and that this condition is largely responsible\nfor the accumulation of work and the Inability to keep a great part\nof this work current. Overtime work by the staff Is unavoidable, and\nexcessive."
}