{
  "id": "d1047-10",
  "text": "December 1, 1962\nDr. Burton Raulu, Director\nRadio and ^television\nRoom 1, Eddy Ball\nUniversity of Minnesota\nMinneapolis Ik, Minnesota\nDsar Burton:\nI*m sorry that X haven’t answered your letter of November 14,\nsooner, but I’ve been out of town quite a bit since the Conven¬\ntion.\nAt the final Convention business session, Appointed out that we\nwere having this problem with nominations for Individual Member\nDirector, and I said that the staff felt that the only plausible\nsolution would be to require a petition, with perhaps five to\nten signatures of other Individual Members, for nomination of\nsomeone for this position on the Board.\nSubsequently, at the Board meeting cm Thursday (apparently after\nyou had to leave), 1 brought this matter up. The Board then\nauthorized the staff to proceed with the preparation of suitable\nBy-law amendments which qould require a petition of some sort\nwith multiple signatures. This amendmont will be prepared and\nsubmitted to the membership in ample time to be in effect by\nthe time elections roll around again next fall. I believe this\nwill cut down greatly on the number of nominations we receive.\nIn addition, I suggested in the business meeting, and also at the\nBoard meeting, that in the future we will have a brief biographi¬\ncal sketch (including NAEB activities) of each candidate - for\nall Board positions - either in the Journal or on the ballot, in\nall future elections. Xhis will enable a rapidly growing member¬\nship to make a wiser choice, I believe.\nSo far as election of an Individual Member Director is concerned,\nwithout numerous ballots, the By-Laws call simply for a plurality\nof votes cast, which by deflnition( (so far as elections are\nconcerned) simply means the person who receives the most votes\n(not necessarily a majority) is elected.\nI hope this answers the thoughtful questions you raised, but if\nyou have others, please let me know and I’ll do my best.\nCordially j"
}