{
  "id": "d1047-24",
  "text": "TO: NAEB Board\nFROM: WGH\nDATE: November 13, 1960\nRE: 1961 Convention\nHow do you feel about changing the site of the 1961\nConvention from Milwaukee to Washington, D. C.?\nUnfortunately, this idea did not come up until after the\nSan Francisco meeting had adjourned. The Convention Sites\nCommittee was interested in coming to Washington in 1962, but\nfelt that since Philadelphia had been virtually assured of being\nchosen, that it would be disruptive to make such a switch; how¬\never, the Committee did urge Washington for *63.\nt/j\nTalking with Wisconsin people the last evening I got the feeling\nthat they were concerned about hosting 162 now that Paul Taff, the\nonly NAEB manager in Milwaukee, had departed. A call to Dr.\nParkinson, Paul's former boss and by default the man inheriting\nthe host responsibility, disclosed that Milwaukee would be willing\nto switch from *61 to '63. Martha Gable had no objection to a\nWashington convention preceding the Philadelphia one. McBride,\nChairman of the Sites Committee, assures me his colleagues would\nbe pleased at such a development.\nWith this encouragement, I got together a luncheon meeting of\nrepresentatives of the six universities in the area to assess\ntheir willingness to undertake host responsibilities. The\nbroadcasting officers for George Washington, Georgetown, Howard,\nMaryland, American and Catholic Universities pledged their\ncooperation and are obtaining letters from their presidents to\nthis effect. In addition, Gertrude Broderick attended to assure\nthe interest of the U.S.O.E. and, though GWETA was not represented,\nwe are assured of its help.\nRequest from our counsel indicates that if the Board decides to\nhold the convention in Washington in *61, a revision will need\nto be made of the By-laws, which stipulate that the convention\nbe held in the mid-west on uneven years. This would be done by\nmail vote of the membership.\nIt seems to me that there is much merit in the Washington pro¬\nposal. It would coincide with the establishment of our national\nheadquarters in the capital; give us visibility and prominence\nat a critical time in the development of ETV; provide opportun¬\nities to involve in our sessions members of the FCC, HEW, and the\nCongress. In addition to the obvious PR advantages, the attendees\nwould have the opportunity for special tours such as the color\nTV installation at Walter Reed and the White House, dining in the"
}