{
  "id": "d1047-37",
  "text": "An Investment in the People—Educational\nTelevision\nEXTENSION OF REMARKS\nOF\nNON. HARRIS B. McDQWElL, JR.\nof Delaware\nIN THE HOUSE OF REPRESENTATIVES\nWednesday, August 24, 1960\nMR. McDOWELL. Mr. Speaker, a significant study by the\nU.S. Chamber of Commerce, \"An Investment in the People\" con-\nCLUDES THAT THE COUNTRY OR THE STATE WITH THE HIGHEST PER\nCAPITA INCOME IS THE ONE WITH THE BEST EDUCATED PEOPLE.\nObviously, if a people are not educated, they cannot take\nADVANTAGE OF THE RESOURCES OF A COUNTRY NO MATTER HOW RICH\nIT POTENTIALLY MAY BE.\nIn EDUCATIONAL TELEVISION WE HAVE A NEW AND HIGHLY IM¬\nPORTANT TOOL FOR BRINGING AMERICA 98 EDUCATIONAL SYSTEM ABREAST\nOF THE TIMES.\nIT IS THE HOPE OF MANY DELAWAREANS THAT THE FEDERAL\nCommunications Commission will assign the now silent channel\n12 to Delaware for purposes of educational television broad¬\ncasting. This is a step which I have strongly supported\nIN THE PAST AND WILL WORK FOR IN THE FUTURE WITH ALL THE MEANS\nAT MY DISPOSAL. I HAVE, IN ADDITION, COSPONSORED WITH SENATORS\nMAONUSON AND SCHOEPPEL LEGISLATION ON THE SUBJECT OF EDU¬\nCATIONAL TELEVISION WHICH WOULD GIVE FINANCIAL ASSISTANCE TO\nGET THIS IMPORTANT PROGRAM OFF THE GROUND. Xn THIS CONNECTION\nIT IS IMPORTANT TO RECOGNIZE THE TREMENDOUS SUPPORT WHICH THE\nFederal Government has given to American railroads, to the\nAIRLINES, AND TO SHIPPING, AND HIGHWAY TRANSPORTATION. CER¬\nTAINLY, EDUCATIONAL TELEVISION IS EQUALLY DESERVING AND IS\nEQUALLY IMPORTANT TO THE WELFARE OF THE PEOPLE OF THIS GREAT\nNation.\nI INCLUDE HERE, AS PART OF MY REMARKS, THE TEXT OF MY\nWEEKLY RADIO BROADCAST TO THE PEOPLE OF DELAWARE THE WEEK OF\nAugust 25, 1960, over seven Delaware radio stations:\nMy subject for this week's report from Congress is one\nWHICH I KNOW IS OF GREAT INTEREST TO THE PEOPLE OF DELAWARE,\nAND ONE WHICH HAS OCCUPIED A GREAT DEAL OF MY TIME THESE\nPAST 2 YEARS AS A DELAWARE CONGRESSMAN. THIS SUBJECT IS\nEDUCATIONAL TELEVISION."
}