{
  "id": "d1047-4",
  "text": "1\nDecember 16, I960\nfi)\nu\nP\nJohn Fo White, Pres.\nMETRO\nMew Tork, M. T.\nDear Jackt\nI thought the meeting of the Affiliates1 Committee with you and\nJim — and Don — was a really useful meeting and that we made some\nreal progress down the road toward a better understanding of each\nothers problems and necessities*\nAnd I was particularly pleased with tne conversation you and I got\ninto over METRO - NAEB matters* I sincerely hope we can find a basis\nof really sitting down and ironing out any misunderstandings that\nmight continue to exist, for 1 am certain that any difficulties that\nap>ear to exist between the two groups can only be misunderstandings,\nfor X know that you and the Center staff have no other purpose than\nthat of building a strong educational broadcasting movement in this\ncountry — and that certainly can be NAEB: 8 only purpose and interest*\nAs you probably found out from Bill Harley, I did make it to Washington,\naltho there was a time when I didn't think I was going to make it thru\nthe bliszards* I found Bill most desirous of finding a basis of friendly\ncooperation with the Center* I hope you and he had a satisfactory\nmeeting at your Thursday evening dinner.\nIt hadn't really occured to me when you and I were discussing the\nproblem in New Tork Saturday, but I suppose if I can serve an# really\nuseful purpose as chairman of both the NAE$ TV Board and of tne\nCtenter A filiates' Committee, it would be to bring about the full\nunderstanding and cooperation that can and must exist between the\ntwo groups* I can't see any areas where there should be any sense\nof coupetition or conflict* The only possibilities of trouble ere\nwhen someone misunderstands another's motives, and'is going to have\nto be my job, and yours and Bill's to help people understand the\nother fellow's point of view.\nIf there is any way X can be of help in this matter, I hope you will\nlet me know* I would be glad to come to Washington a day early next\nmonth to meet with you and Bill if that will help us along the way\ntoward finding those areas of common interest in which we can fully\ncooperate with each other*\nBest personal regards.\nLoren B« Stone\ncci Bill Harley"
}