{
  "id": "d922-51",
  "text": "What -us© would be mad© of this material?\na. This material is not likely to be suitable for promotional purposes,\neither nationally or locally. In almost all cases it is anticipated\nthat educational stations will fall below the commercial stations\nin coverage achieved,\nb. The advantage to the Association and to individual members will be\nin the area of research,, planning,, and analysis of operations,\nc. In view of these facts9 it would be wise to notify NAEB Headquarters\nin advance of any public statements made involving this data.\nDo we need this kind of data?\na. The Research Committee recommends its purchase.\nb. I do not feel it necessary to point out to a group of station\nmanagers the value of data on station coverage, or to explain\nwhat station coverage data is.\nWhat stations are reported upon?\na. There ar© 24 NAEB member stations reportable in NCS #2, See attached\nlist,\nbB A reportable station is one reported listened to or viewed by at\nleast 10$ of all families in an entire county sometime within a month.\nWhere do w© get the money?\na0 This is properly a matter for consideration of the board. The Research\nCommittee feels this data is of value to the entire membership. For\nexample9 although WKAR^TV is not ’’reportable,\" (due to its THF channel\nin a VHF area) data about our coverage* area in HCS #2 would be of great\nhelp in a special survey operation we contemplate. Because of its\ngeneral value to all members it would be appropriate for the Association\nto purchase the study out of Association funds entirely.\nbo On the other hand, reportable stations can obviously make greater use\nof the data than non-reportable members. It would seem appropriate\nthat these favored stations might contribute toward a single purchase.\nc. By making this package deal the Association gets the data at less than\n25$ of the C09t to the smallest commercial advertising agency. Stations\nbuying separately would pay $150 each for local (not statewide) coverage\ndata only.\nIs this study reliable and valid?\na. The survey methods reported used in NCS #2 appear to me equal or\nbetter than any previous nationwide coverage study. Very good reliability.\nb. Certain statistics released to me on this study agree with known data\nobtained from other sources© She data appear valid.\nc. (Incidentally, this is also the only coverage study less than 5 years\nold.)"
}