{
  "id": "d922-73",
  "text": "NAEB Headquarters\nO U Gregory Hall\nUrbana, Illinois\nTOs Burton Paulu and Permanent Flnaneing Committee\nFROM* Harold\nDATE: March 21, 1957\nAs directed by the Permanent financing Committee herewith information pertaining to the\nservices now performed by the Headquarters staff and those which might still be performed\nif the Headquarters finds it necessary to operate under the minimum budget set forth in\nMiles9 letter of November 21, 1956 to then-President Prank Schooley.\nPRELIMINARY CONSIDERATIONS: This analysis does NOT include any of those projects fi¬\nnanced by the Ford foundation (Engineering Service, Placement Service, Management Consul¬\ntant, Consultant Teams, professional advancement activities, etc*) since their continuance\nis not dependent upon the funds to be raised for the Headquarters operation. However, it\nwould be well to keep in mind that having the Engineering and Placement Services at Head¬\nquarters has resulted in some saving of secretarial and office expense in that these two\nservices have provided some personnel for help in handling many more or less routine\nmatters. The feeling has been that a certain use of Engineering and Placement services\nand supplies is justified in view of the fact that these services are provided with office\n^ace, editorial help, etc. which they would not otherwise have enjoyed.\nNeither does this analysis take into consideration the Network operation vhioh is deemed\nto be self-supporting. However, it must be kept in mind that the Executive Director and\nthe Associate Director devote considerable time to the affairs of the Network. In addition,\nthe Headquarters secretarial staff does quite a bit of work for the Network. This of course\nis important in view of the fact that none of the Network income is diverted to the Head¬\nquarters operation even though, as a matter of fact, it is doubtful that the Network could\nsurvive as a separate entity. In connection with this, it should be pointed out that the\nNetwork income is not sufficient to allow for satisfactory amortisation of electronic\nequipment. Also, the office furniture used by the Netowrk has largely been purchased by\nthe Headquarters or has been loaned by the University of Illinois {School of Journalism and\nCommunications. It should be realized, therefore, that although the Network operation is\nnot herein considered, if the proposed minimum budget becomes operative, either the Head¬\nquarters services to the Network must be reduced (thus reducing the present efficiency of\nthe Network) or the other services of the Headquarters hereinafter discussed would have\nto be reduced still further to permit the reduced Headquarters staff to continue to serve\nthe Network at the present level.\nANALYSIS OF TOE PRESENT AND PROPOSED MINIMUM BUDGETS:\nHeadquarters staff: Tie proposed budget would eliminate the Associate Director and one\nsecretarial person, plus & $1,000 annual allowance for miscellaneous, part-time secretarial\nhelp, thus cutting the present staff by more than 5056, and leaving only the Executive\nDirector and one secretary."
}