{
  "id": "d922-77",
  "text": "Prepare monthly, quarterly and annual financial reports (detailing expendi¬\ntures and income by various classes) for Officers and Board\nAdvise Officers and Board on financial natters\nsale and distribution of albums and publications and billing for same\nBeoord and forward dues and ether pertinent monies to tbs treasurer\nClose liaison with the treasurer on preparation of lists for billing, con¬\nsultation, and all financial matters\nftnntottgn Mittmif\nA Meet and confer with foundation representatives\nA Prepare requests for funds\nB Prepare reports, both financial and activity\nOmni ahttwi tifth Kama ,irt Jtowfo.\nProvide reports, data, background information, advice\nHandle routine matters for Officers and Board and prepare reports for their\naignatures\nProvide continuity between administrations and over the years\nPrepare agendas for meetings\nMattaau.\nC Work kith Fulbright studanta - orientation, provide materials, references,\ninformation, answer requests for assistance, eto*\nC Work with foreign educational and broadeasting organisations for exchange of\ninformation and parsons,\nB Arrange detailed itineraries for ftarelgp visitors (both those specifically\nvisiting the NAEB and those brought over by the Institute for International\nEducation, UNESCO, etc*)\nBrnlmn-in Staff woric In conMoHloE ylthjWB-Jeadgwwrtwn OT9J«$tii (C)\nC Time devoted by Executive Director, Associate Director and secretarial staff\nto Network matters\nC Time and energies devoted to Workshops, Seminars, Scholarship programs. Con¬\nsultant Teams, Qranta-in-Aid, etc* (Planning meetings| preparation, duplication\nand distribution of announcements and reports} coordination of applications for\nselection committees; notification of selection; attendance at, and often manage-\nment of, workshops and seminars*)\nC Help oonanittees to plan for meetings, luncheons, etc; secure speakers; make\nhotel arrangements} invite distinguished guests; handle details while at meeting"
}