{
  "id": "d922-83",
  "text": "mtm & mmm\n82, 1957\nMro Harold So am\nAssssiste Direst*?\nnational Assooiaft&oa of\nZdiwrtloaal Broadcasters\nBnlvprsity ef niinoi*\n119 Gregory Hall\ntew Hr. HUli\nConfirming w tslopbara ooumrsaftlen I will outline tte Man ef temp\nAccident inewsns® m proposei fcy tto market who 1* offering tte tawadest\neawngi at tte lmrt prenim.\nThay will writ* a policy providing 9100,000 accidental death «s3 Uwtea»t£\naovmrlag U1 bminess team! an a twenty-four hew tesla outside tte eity at\nsmldaaM w saployaent ter awed people. la addition,, ter the son tew people\n1150.00 accident wmhTy iadasnity peyi&ls ter 58 weeks in tte meat of total\ndisability aai $50000.00 aswidsnt medical «ap«ne©o tte nml preatas ter all\nef this eewrage* la $338.00. In addition, as exploited, w wmld ham a rite\nVw attached prodding blanket accident ecwrstge ** «tter aaplcgwas ahil®\ntrawling on tte booteeas of tte Assoaia&iGa, providing $15,000 ter 58 mate\nand $1,000 medical expanse at a owy asaltel afldltie®«X prsaaizs of $18.00. This,\nwould bring tte total irate ter all tte eossrage laaoXiad to $393o00 annually.\nAll that we would mod to put this oomrage in term would te tte names of\ntte tew people, their teasoflelerlas and relationship with giwsa first bmbsso\nIf you do not tew group lite insurance, we would urn tte Bstate of tte Staff\nHenbsr as teasftsiaEy under tte fcXsitot portion.\nAlas in oonnsotion with yaw dlsonasien with tfc*. Sted regarding Seminars,\nomng* can te arranged prodding accidental death and dianaaterasBfe and a\nmodest amount of weekly intensity and aadloal eopenee. Us would mad a tew\ndays notioo to negotiate a pnate with undsawritaro, Us would use the ears\nmarket that we would place tte basis contract la, as wo would probably te able\nto assure a are attractive proposition ter you. Oanarally speaking, darpons'ing\non tte length ef tte Saadaars and tte mounts ef oomrage desired, this should\nnot run too high.\nIf after wrriawiag this you tew any questions, pteaso do not hesitate to\ncall cm us.\nTows wry truly\nu\nMARSH & MeLBHHAH, mXBPCRMim)\nSigned Cecrgo 1. MnOaff, A?.\nAsoideat and Health Department\nCopied HASB teaSqusrters H/Wm£a\n9"
}