{
  "id": "d1560-4",
  "text": "NAE8 NEWS LETTER.------.--,P*ae 5.......;..*,.....JULY lf *945\n*N THE MEANT I ME» THEREvS MUCH MORE THAT COULD BE TOLD ABOUT WHCU* ABOUT\nCornell* and about Ithaca. If you have questions* ask them* While\nWE8RE IN THE EAST* * SHALL ALSO PAY AN OFF IC 5 AL VISIT TO NA£8£R~KEN\nBartlett at Syracuse University* and if conditions permit to H„ J.\nWilliams in Troy* New York.\nAMENDED FCC RULE SIMPLIFIES RECOROING ANNOUNCEMENTS\nThe FCC has amended Section 3,407 or its Rules Governing Standard and\nHigh Frequency (FM) Broadcast Stations simplifying the handling of\nMECHANICAL RECORDINGS ON THE AIR,, . *T ELIMINATES THE NECESSITY OF\nIDENTIFYING EACH RECORDING AS SUCH BEFORE AND AFTER ITS PLAYING ON PRO*\nGRAMS INTERRUPTED BY LIVE TALENT PERFORMANCE OR COMMERCIAL ANNOUNCEMENTSo\nThe amendment also dispenses with the exact forms of IDENTIFYING an-\nNOUNCEMENTS PROVIDING MERELY THAT THE LANGUAGE SHALL NOT BE OF A TYPE\nWHICH ATTEMPTS AFFIRMATIVELY TO CREATE THE IMPRESSION THAT MECHANICAL\nREPRODUCTION PROGRAMS CONSIST OF LIVE TALENT* STUDY YOUR COPY OF THE\nRULE CAREFULLY *\nWNAD PRESENTS GATEWAY TO POETRY\nThis quarter hour program presents the original works of poets young and\nold of Oklahoma and the southwest* Maurice Ogden* a well known Oklahoma\nPOET* SELECTS AND READS EACH WEEK THE CONTRIBUTIONS TO GATEWAY TO POETRY *\nEach week* too* WNAD offers a prize of one dollar for the best poem useo\nON THE WE£K9S PROGRAM* The program 8S HEARD EVERY WEDNESDAY AT *0^30*\nSUMMER MUSIC APPRECIATION SERIES ON KSAC\nCharles Stratton* professor of piano at Kansas State College* is pre¬\nsenting ON KSAC A SERIES OF MUSIC APPRECIATION PROGRAMS THIS SUMMER AT\n4‘.30 p >m- on Mondays* Music of Johannes Brahms will be featured during\nthe FIRST SUMMER TERM * INCLUDED WILL BE SONGS* BETTINGS OF FOLK SONGS*\nPIANO AND T WO-P8 AND MUSIC* VIOLIN SONATAS* PIANO CONCERTOS* AND SYM¬\nPHONIES,, Professor Stratton is also heard on Thursdays and Saturdays at\n9t45 A>M >, ON the MUSJSL,£QJB—IH£-EJM program,\nWNYC CONCERT SERIES GO OUT OF DOORS\nAs GOES THE MUSIC SEASON IN THE NEW YORK CuTY AREA SO GO THE MICROPHONES\nof WNYCo With the summer concert season in full sway the City Station is*\nAGAIN CARRYING ITS FULL QUOTA OF THE OUTDOOR CONCERTS* The LEWISOHN\nStadium concerts of the New York Philharmonic Symphony are broadcast on\nFrioays over WNYC from 8 ?30 to 9 s 55 and over WNYC-FM from 8;30 till the\nEND OF THE CONCERT. The GOLDMAN BaND UNDER THE DIRECTION OF Dr. EqWIN\nFranko Goldman presents a regular eroaocast concert every Sunday* Mon¬\nday* and Thursday evenings from 8;30 to 9s30 PM, *n addition to these\nFINE FEATURES THERE ARE THE REGULAR BROADCASTS OF THE C|TY SyMPHONY\nOrchestra from the Central Park Mail* and the popular Oanqing_ under the\nSlARS programs from the same location,\nEVEN WIDER AM BAND SUGGESTED BY INDUSTRY REPRESENTATIVES\nWashington—A spokesman for the radio industry urged enlargement of the\nSTANDARD BROADCAST band to PROVIDE ADDITIONAL RADIO SERVICE,, ESPECIALLY"
}