{
  "id": "d1529-15",
  "text": "Left to right above are members of the Workshop at Station WOI.1^sJhey„Pre®e“+t0t^f\nChildren’s Playhouse production “Peter Pan.” Marj Carroll and Bill Merrill emotei asMartha\nSimons makes like a marching army with the marching machine, and Midge Xolfenbach gets\nready to slam a prop door. (Photo courtesy Country Gentlemen)\nPLAYHOUSE PRESENTS PETER PAN\nAt the present time, the Children’s Playhouse is presenting “Peter Pan” for the young\nlistening audience from 5:30 to 5:45. Rehearsals for the production start at 4:30 each\nday and from then on to the last word of the broadcast script, the clock limits the\nactions of the group. _ „ ..\nBecause of the popular acceptance of “Tom Sawyer,” “Alice in Wonderland, and the\n“Wizard of Oz” last spring, the Playhouse group plans to make an equally interesting\nspring listening session this year.\nIn charge of the entire Workshop is Ed Wegener, WOI production manager.\nMORE COMPLETE MARKETS\nWith the return of the free market, without the ceilings, WOI market editor Cap\nBentley has been receiving more and more requests for the WOI market schedule.\nThis is particularly true of poultry and egg dealers.\nThe complete wartime markets answered a need for these dealers, and now an even\nmore complete market report is available to them, and they are taking advantage of\nthe service offered by WOI and Bentley.\nNew additions to the market schedule include an over-all picture of the day’s markets\nfrom 6:12 to 6:15 Monday through Friday following the closing news of the day. This\nreport brings in the Chicago closing grain; New York closing cotton; Wall Street\nclosing stocks; New York closing bonds; midwest, interior and terminal hog reports;\nmidwest and terminal cattle reports; midwest, interior and terminal sheep reports and\nthe Chicago spot egg market report.\nAnother new service is the addition of two more Wall Street market reports. In the\npast, the opening Wall Street report was given at 9:45 a. m. Now, the mid-morning\nmarket is reported at 11:30 and the closing Wall Street report is given at 2:30 p. m."
}