{
  "id": "d1529-3",
  "text": "NEWS ON THE HOUR\nNews Editor Bob Mulhall and co-editor\nJim Schwartz will continue the big job\nof keeping WOI listeners up to the minute\nin world, national and state news through¬\nout the summer months.\nSince the end of the war, these two\neditors have had their hands full keep¬\ning abreast of the latest happenings both\non the foreign and domestic fronts and on\nthe military and political fronts. It hasn’t\nbeen an easy job with changes as rapid\nas they are at the present time.\nMaking use of the Associated Press wire\nservice to station WOI and the Depart¬\nment of Agriculture wire, the men have\nat their command sources of news all over\nthe world. Theirs is a job of evaluating\nthe news, cutting or backgrounding it and\ngiving WOI listeners a complete and fair\npicture of what is going on.\nEditor Mulhall, in addition to his news\nduties, assists Dale Williams with sports\nbackgrounding during Williams’ broad¬\ncasts. He also conducts the Organ Moods\nprogram every morning over Station WOI.\nSchwartz, a former Iowa newspaper edi¬\ntor and publisher, has fit into the news\npicture at WOI in fine style and has been\nfeatured on an increasing number of the\nnewscasts, including the early morning\nspot. He is also an instructor in the De¬\npartment of Technical Journalism at Iowa\nState College.\nBob Mulhall\nAs the news picture moves on this sum¬\nmer with all of its problems and records\nof changes, the WOI news staff will con¬\ntinue to bring news on the hour to every\nWOI listener—another service of WOI,\nthe educational station on the Iowa State\nCollege campus.\nOn the more human side of the ledger,\nMulhall is going through the process of\nbringing up 9-month-old son “Mike,” Gary\nMichael to the unacquainted, during his\noff hours. Schwartz will be faced with\na similar problem in the near future.\nWhether he has received any constructive\nadvice from Mulhall remains to be seen.\nFor the\nLATEST IN\nNEWS\n640 On Your\nRadio Dial\nNews On The Hour\nJim Schwartz"
}