{
  "id": "d1917-0",
  "text": "NATIONAL ASSOCIATION OF\nEDUCATIONAL BROADCASTERS\nN-A-E-B MS LETTER\nSEPTEMBER - OCTOBER 1952\nOFFICIAL NAEB DEVELOPMENTS\nNAEB AWARDS THIRTEEN RADIO-TV GRANTS - IN-AID\nThirteen grants-in-aid for radio and television projects proposed by member stations\nhave been made by the NAEB awards committee,, it was announced on October 15- The\ntotal amounts of the grants-in-aid comes to $78,500; divided as follows: $43,700 for\ntelevision projects, and $34,800 for radio projects.\nAwards for TV programs were made to: the Universities of Miami ($8,200); Minnesota\n($8,900); Oklahoma ($8,900); Stanford ($8,900); Syracuse ($6,700); and Wayne\n($2,100). For projects in radio broadcasting, awards were as follows: University of\nAlabama ($5,000); Boston University ($5,800); University of Chicago ($6,500);\nGrinnell College (Iowa) ($3,400); Indiana University ($3,100); University of Michigan\n($6,000); and the University of North Carolina ($5,000).\nProject Summaries\nA summary of each radio and television project is given below:\nGrinnell College (Iowa)--$3,400; \"Americana”; radio; Political Affairs and Humanities.\n13 fifteen-minute radio programs with \"intelligently patriotic” motifs plus scripts\nin book form (150-200 copies) for distribution to educational institutions. Produc¬\ntion by Grinnell College Radio Players.\nUniversity of North Carolina—$5,000; \"American Adventures\"; radio; Humanities.\nA series of 13 half-hour dramatic productions exploring the heritage of values of\nWestern civilization as these values affect the lives and strengthen the souls of\nindividuals in crisis. The content of the series will consist of studies of intel¬\nlectual, moral and cultural values significant in the development of American\nsociety. The form will be biographical drama.\nWayne University--$2,100; \"The Nationalities that Make America\"; television; Inter¬\nnational Understanding.\nEach program will take a different nationality and spotlight its collective way of\nlife. Faculty members will trace that nationality's anthropological, racial charac¬\nteristics and traits, its sociological trends and living habits, and language prob¬\nlems. This will present the background for an interview with a prominent member of\nthat race who has become a citizen. 13 half-hour shows.\nBE SURE TO ATTEND THE NAEB ANNUAL CONVENTION IN MINNEAPOLIS NOVEMBER 6-7-8\nPROGRAM DETAILS IN THE SPECIAL CONVENTION ANNOUNCEMENT\nBEING SENT TO ALL PERSONS ON THE NEWS-LETTER MAILING LIST\nThe N-A-E-B NEWS-LETTER, published monthly, is distributed from the national head¬\nquarters office at the University of Illinois. N-A-E-B members and associate members\nreceive the NEWS-LETTER as part of membership service. Non-members may obtain the\npublication at a subscription rate of $5.00 per year. All inquiries regarding sub¬\nscriptions and distribution should be addressed to: NAEB, 119 Gregory Hall, Univer¬\nsity of Illinois, Urbana, Illinois. Editorial copy and inquiries concerning editor¬\nial matters should be sent to the Editor, Burton Paulu, Station KUOM, University of\nMinnesota, Minneapolis 14, Minnesota."
}