{
  "id": "d1917-3",
  "text": "-% -\nOn the national level, full page advertisements were taken by the NAEB in Broad¬\ncasting, the Saturday Review, and the New York Times. The Times also printed\neditorials lauding the series.\nNAEB DELEGATION RETURNS FROM EUROPE\nAn NAEB delegation made up of President Seymour Siegel, George Probst of the Univer¬\nsity of Chicago Roundtable, and William Harley of WHA has recently returned from a\ntrip to Europe where it arranged for an exchange of cultural programs between NAEB\nand the broadcasting systems of Great Britain, France, Switzerland and Italy.\nPreviewing the report which the three will give at the November 8 (Saturday) after¬\nnoon session of the NAEB convention, Siegel reported that their 30-day trip operated\non such a tight schedule that \"out of 10 days in Britain we were allowed exactly 15\nminutes of free time.\" But the pace paid off, he said: the group succeeded in\narranging up to 8 or 10 hours a week of cultural programming from abroad.\nClassic French dramas presented by top French actors will give the several million\nFrench students in this country a rare opportunity to hear the language at its spoken\nbest, Siegel said. Opera broadcasts from Italy will provide good listening for music\nlovers. From BBC, NAEB will receive more full-length dramatic programs and a number\nof current event features including a new series on international affairs which is\nalready being produced in England for broadcast here beginning in October.\nNAEB to Produce for the BBC Too ' '\nNAEB.on its part is recording a series on American foreign policy for broadcast by\nthe BBC, as well as a new series entitled Talk Back in which average citizens record\ntheir comments on statements of prominent figures and topics of general concern.\nNAEB also is offering for use abroad The Jeffersonian Heritage series now being\nbroadcast here.\nThe group also arranged for BBC to produce a series of 13 half-hour TV films on\naspects of British Culture for telecast in the UfS., and in Italy, where they found\nfilm costs only about a quarter or a third the U.S. rate, they planned a series of\ndocumentary TV shows on Italian art and history, to be filmed by James Willard and\nDavid Kurland. These and other foreign programs will be ready for use by American\neducational TV stations by the time they are on the air, Siegel anticipates.\nTWO 'NAEB MEMBERS CONTRIBUTE TO QUARTERLY\nThe University of California^ Quarterly of Film, Radio and Television has published\nan article, \"Give the Television Code a Chance,\" by Robert Swezey, vice-president\nand director of the WDSU Broadcasting Corporation, New Orleans, who is chairman of\nthe television board of the NARTB‘, which administers the TV code. The article ex¬\nplains the origination of the code, and replies to criticisms of its structure and\noperations published in TV Magazine and other publications.\nThe fall issue of the Quarterly also contains \"The Challenge of the 2^2 Channels\" by\nBurton Paulu, NAEB Secretary, and \"What Television Programming Is Like\" by Dallas\nSmythe, NAEB studies director. Smythe supervised the New York, Chicago, and Los\nAngeles TV program studies of the National Association of Educational Broadcasters.\nThe issue is available ($1.25) from the University of California Press, Berkeley 4,\nCalifornia."
}