{
  "id": "d1917-6",
  "text": "- 7 -\nUNIVERSITY OF ALABAMA NAMES HARWOOD RADIO HEAD\nDr. Kenneth Harwood has been named head of the University of Alabama Department of\nRadio. He also was promoted to the rank of full professor.\nDuring the 1951-1952 academic year Dr. Harwood was acting head of the department and\nassociate professor of radio. He joined the University of Alabama faculty in 1950\ndirector of radio and television research with rank of assistant professor.\nThe department operates carrier-current station WABP and is an associate member of.\nNAEB.\nAlabama Documents Series Continued\nThe Radio Broadcasting Services of the University Extension Division will again pro¬\nduce the \"Alabama Documents\" series this fall. The series which won national recog¬\nnition last Spring will again be.directed by Walt Whitaker and written by LeRoy\nBannerman. In the past, Alabama’s natural resources have been the subject of the\nprogram. This fall* the \"Alabama Documents\" series will go.beyond the state and will\nanalyze the natural resources of the deep South as well. .\nFaculty Summer Activities\nTwo professors in the University of Alabama Department of Radio have completed summer\nstudy of radio-TV topics.\nAssistant professor W. Knox Hagood, who has been a radio-television combat corres¬\npondent in Korea, studied television at Ohio State University in the summer. He hold\na Northwestern University, master's degree in radio. As a part of his summer research\nProfessor Hagood designed a student-operated television station.\nDon C. Smith, veteran newscaster and assistant professor of radio, began a year’s\nleave of absence with summer study at Ohio State University. During his leave for\npre-doctoral work. Professor Smith is specializing in program research. His master's\ndegree in radio was earned at Ohio State.\nJOHN BACHMAN TAKES OVER AS SPEECH--AUDIO-VISUAL HEAD AT UNION THEOLOGICAL\nThe Rev. John Bachman, appointed recently Head of the Speech Department and Director\nof the Audio-Visual Program at Union Theological Seminary, began his work this fall.\nProfessor Bachman was formerly Chairman of the Radio Department at Baylor University.,\nWaco, Texas.\nProfessor JBachraan is a graduate of Capital University, Columbus, Ohio, where he later\nwas Chairman of the.Department of Speech.' He received a'master’s degree in speech\nand radio from Ohio State University. In April this year, Bachman was elected Vice-\nPresident of the University Association of Professional Radio Educators. He has\nserved on the Faculty of Workshops sponsored by the Radio and Film Commission of the\nNational Council of Churches and has represented the American Lutheran Church on the\nsame Commission. He is also a member of’the Educational Committee of\"the Broadcasting\nand Film Commission of the National Council of Churches, a member of the Board of\nTrustees of the Junior Town Meeting League of America, and an Associate Editor of\nPlayer's Magazine.\nErection of the Mills Memorial Audio-Visual Center of which Bachman will have charge\nwas made possible by a Davella Mills Foundation grant of •$165*000. It occupies\n68,000 cubic feet on the. ground floor of Auburn Hall, a five-story addition to the\nSeminary Administration Building dedicated a year ago.\nThe center includes a lecture room for choral practice and .lectures, a music studio\nfor recordings and reproductions, and a preaching studio for teaching and practice in\nall aspects of public worship. There Is also a radio control room, a music record\nlibrary, a film library, and two studios for individual practice and listening."
}