{
  "id": "d1917-7",
  "text": "- 8 -\nWKAR CELEBRATES THIRTY YEARS OF BROADCASTING\nAugust marked the thirtieth anniversary of radio broadcasting for WKAR, Michigan\nState College. The station was first licensed August 18, 1922. On the anniversary,\na special program was aired with congratulatory messages from the President of Michi¬\ngan State College, the Extension Director and the Director of the Experiment S-nation.\nNewspapers and magazines ran feature stories on the contributions of WKAR to the\nMichigan community it serves during the past thirty years.\nMINNESOTA’S KXJQM SETS RADIO-TV FALL PROGRAMMING\nA television series aired weekly over a local outlet, a radio lecture broadcast\nthrice weekly from a classroom on the campus, and a full schedule of children s pxo-\ngrams and adult education series make up KUOM’s fall program offerings.\nTime for the television series, which will run for 13 weeks, was offered by WCCO-TV\nto the University of Minnesota’s radio station KUOM, A previous 12-week television\nseries over the same commercial station a year ago received national lecognition in\nVARIETY magazine. This new series will he in the fields of World Affairs, Child\nDevelopment, and Conservation. University, Minnesota State Department, and World\nAffairs Center personnel will advise and appear on these programs.\nTwelve different series make up the offerings of the Minnesota School of the Air,\nbroadcast over KUOM for in-school listening. These series are also distributed via\ntape to schools in the five-state area of Minnesota, Wisconsin, North and South\nDakota and Iowa, through the services of the Minnesota State Department of Educa¬\ntion’s Tape exchange,\nKUOM’s adult education programming includes a series by Alistair Cooke, correspondent\nfor the Manchester Guardian. This program is a delayed transcription offered to KUOM\nby the local ABC outlet which cannot broadcast it due to other commitments for that\ntime.\n\"American Political Parties,\" the classroom lecture, and talks on law and^medicine\nare three discussion programs featured this quarter. \"The Legal Handbook\" is dis¬\ntributed by the Minnesota Bar Association to 20 commercial stations throughout the\nstate.\nCriticism and analysis of news, politics and the arts round out the news programming.\nTwo shows--\"Background of the News\" and \"Critically Speaking\"—are heard daily after\nthe afternoon newscast. \"Critically Speaking\" received an award at the IERT\nColumbus 1952 convention.\nU. OF WISCONSIN’S SCHOOL OF THE AIR OPENS 22ND YEAR\nThe University of Wisconsin’s \"School of the Air\" is. bringing 10 different radio\nprograms each week into Wisconsin schoolrooms to supplement the offerings of local\nteachers this year, H. B. McCarty, director of the State Radio Service, has\nannounced. The courses range from art to science, and individual courses are aimed\nat different grade-levels, from the first to the 10th.\nThe in-school listening programs are available for the first time this year to all\nschools in the state, since the last two stations in the State Radio Council FM\nnetwork have been completed. The programs this year are being broadcast over the.\nstate’s two AM stations, WHA, Madison and WLBL, Auburndale; and its eight FM stations\nat Madison, Delafield, Chilton, Rib Mountain* Colfax* West Salem, Highland and Brule."
}