{
  "id": "d1797-1",
  "text": "NAEB NiT’S LETTER. *. • 3JSPT 15, 1940. ...Page 2\nin the study and support of the /American form of government,\n5e To assist in the endowment of educational institutions.\nBurdette said that the Foundation rill be grateful for further\nsuggestions and comments regarding possible cooperation between\nthe Foundation and the educational broadcasting stations*\nNAEB rent on record as favoring cooperation \"with local civic groups\nand other agencies in promoting the general national defense.program,\nand in furthering the ideals and basic principles of our national\ndemocracy,M\nThe Executive Secretary was instructed to.“advise the National\nDefense Commission of the desire of the association to co-operate\nfully, and aid them in every ray possible.w\nThe Association voted to request the Federa! Communications Commission\nto change its rule regarding minimum hours of operation to permit\nthe non-commercial educations! stations to operate two—thirds of the\nhours assigned, except Sundays. The present rule requires operation\nof two-thirds of the hours between 6 a.m. and 6 p.m. and between\n6 p.m. and 12 midnight.\nChange in the required FCC announcement for use of records was\nrequested in a resolution offered by the FCC rules committee. Change\nin the rule would permit greater variety in continuity.\nThe Executive Secretary was instructed to convey the thanks of\nNASB stations to ASCAP for complimentary licenses enjoyed by the\nnon-commercial stations and to request lifting of the restricted\nlists for such stations,\nUnon motion of M. 3. Novik, WYNC, the association instructed the\nExecutive Secretary to request manfuacturers of F.M. receiving sets\nto psovide for the bands which will be used by the educational\ninstitutions in the ultra-high frequencies.\nAction regarding the securing of rights to use BMI music on the\neducational stations was referred to the executive Committee with\npower to act as it sees fit.\nThe Association went on record as favoring a reduction of line\ncharges for the educations! radio stations.\nA further exploration of oossibilities of rebroadcasting sustaining\nprograms of the International Short Tiave stations nas approved by\nNAEB and the executive secretary was instructed to seek permisoio\nof all such stations for rebroadcast of their programs.\nThe committee to consider a program for NAEB offered a number of\nsuggestions for consideration of the association- 1. holding of th\nannual convention in conjunction with the Midwest School Broadcast\nConference; 2, formation of a transcription library for use of the\neducational stations; 3, Increase dues and do some research and\ne"
}