{
  "id": "d1797-15",
  "text": "NAEB NEWS LETTER...,SEPT 15, 1940....Page 16\neducational institution has various obligations tc the community in\nwhich it carries on its work. Among these obligations is the function\nof transmitting to the community the best of the cultural and social\nlife of the campus with a view to the development of a richer and more\nrewarding life in the larger community of which the University is a\npart. There is on the campus of every strong university unusual talent\nin many fields of human endeavor, in music, art, literature, speech,\ndramatics, science, current events, world affairs. Through radio these\ntalents can be made conveniently accessible to all who can and will liste\nWith these Ideas in mind, Cornell University, on June 3rd9 1940, launched\nits present extensive radio program. It is the purpose of the University\nto provide the scores of thousands of radio listeners in the WHCU\nprimary area with the type of radio broadcasting provided by the best\nAmerican stations. The requisites of good radio broadcasting, such as\nproper balance in the field of news, entertainment, drama, education,\nfine music, social and religious programs, will b© constantly in the\nmind of the management of WHCU.\nThe station accepts commercial broadcasting as the moans through which\nthe cost of th© station’s operation will be mot, While the station will\nbe operated on a modern business basis, it is understood that the profit\nmotive is to be subordinated at all times to the educational function\nof the station. The University regards WHCU as a non-profit enterprise*\nUnder these conditions it will not be difficult for WHCU to avoid\nobjectionable advertising. The station proposes to accept only dignified,\ntruthful advertising from reputable commercial interests.\nTo insure the achievement of these ends, WHCU has been carefully staffed,,\nIts general manager9 Mr. Michael R. Hanna, comes to WHCU with a wealth\nof experience in both broadcasting and radio education. He has been a\npublic relations d director in radio, a director of education for eastern\nstations, and is, at present, a field representative in education for\nthe Columbia Broadcasting System. It was he who conceived and directed\nthe original Empire State Town Meeting of the Air, as well as hundreds\nof other radio forums. He has organized numerous adult civic education\nprojects and has been called by several universities and colleges as a\nconsultant in radio broadcasting. He is th© radio consultant to the\nNew York State Council of School Superintendents *\nWith MTa Hanna, in key positions, are men with extensive radio experience\nthrough work with numerous broadcasting stations and the networks. Mr.\nSidney Ten Eyck, program director, has been in radio almost thirteen\nyears. He comes to WHCU from WLW, of the National Broadcasting System,\nand was recently first vice-president and general manager of WSMK in\nDayton, Ohio, Mr. Lew Trenner, the sales manager, has a firm grasp on\nthe tenets of good commercial radio. His experience with several\nstations in the east in the commercial field has made him a valuable\naddition to the WHCU staff.\nNSW FREQUENCY FOR KFUO\nH. Ho Hohenstein, Director of KFUO, writesi\n\"Under God’s blessing KFUO is in the midst of an energetic program of\ndevelopment. Since July 1 we are broadcasting almost continuously\nthroughout the day on our new frequency of 830 koC„ Many new programs\nand features have been developed and we have made a determined effort"
}