{
  "id": "d1797-3",
  "text": "4-\nRADIO PLANNING COMMITTEE — *This committee, formed in 1959, was charged try\nthen-President William Harley with responsibilities in radio identical to\nthose set forth below for television. Here, again, this committee will new.\nwork closely with the Radio Board, but its general duties will remain much\nas originally outlined by former President Harley, with the additions added\nin the above description.\nRESEARCH COMMITTEE — This committee advises the President and Board on all\nmatters pertaining to research in the educational broadcasting field; provides\nleadership in defining research needs and in suggesting research programs for\nmeeting these needs; seeks to stimulate and encourage significant research\nactivities wherever they may be located; coordinates the research activities\nof the association and its committees; fosters research information exchange;\nconducts research seminars when feasible; and serves in a consultative capac¬\nity for research aspects of the projects of the association, its committees,\nor its members. (Revised February I960)\nTV PLANNING COMMITTEE — This committee, formed in 1959, was a consolidation\nof the former TV Development, TV Management and TV Programming Committees.\nIts responsibilities were outlined by then-President William Harley as follows:\n”This committee will have as its primary function advising the President and\nBoard of Directors on activities and projects the Association should undertake\nin the field of television and assign priorities and indicate emphases. The\ncommittee will work with the Finance Committee (Note - Functions now assumed\nby Development Committee) on long-range planning, purpose and develop new pro¬\njects in the television area, provide counsel on NASB's posture toward and\nrelationships with other organizations active in television, and, in general,\nco-ordinate the many varied activities of the Association in the field of edu¬\ncational television.” With the steady progress toward inter-connected live\nnetworks in TV, this committee will carry out appropriate studies and advise on\nsteps it believes the NAEB should take, with appropriate co-operation with other\norganizations In the field, when indicated* With the increased number of legis¬\nlative and FCC proposals and develcaments, this committee will, when possible,\nbe called upon to investigate and act vise the TV Board, the NAEB legal counsel,\nand the President on positions to be taken by the NAEB in various relationships\nand presentations. It will also, seek to ascertain, however possible (including\nconsultation with other TV committees) additional needed services in both closed\nand open circuit television, and recommend means of providing them. (This\ndefinition is subject for further revision and refinement by the NAEB TV Board,\nto which it serves as an advisory and idea-suggesting group. It has been sug¬\ngested that this committee should meet whenever possible in conjunction with.\nCenter affiliate meetings of Station lianagers, at the IERT, and NAEB Conventions.)\nUTILIZATION COMMITTEE — This committee, created in 1957, was in part in recog¬\nnition of a need which had already become increasingly evident in the NAEB, and.\nin part the result of the AERT-NAEB merger. This committee is divided into RadxO\nand Television Subcommittees. It is responsible for recommending to the Presi¬\ndent and the Board proposed activities in the area of utilization of radio and\ntelevision broadcasts for educational purposes and for suggesting ways of imple¬\nmenting those activities. When feasible the committee conducts service projects\nand arranges seminars and meetings designed to improve utilization practices.\nThis committee,s concern with utilization extends to the philosophy, means, tech¬\nniques and►procedures involved in the use of radio and television programs for\neducational purposes no!>.*>1 § o-alloge and wb-of-oohool, applications, (Revised\nFebruary 18, I960)"
}