{
  "id": "d1647-1",
  "text": "Reconciliation of Cash Account\nas of 12/31/54\nBook Balance per Statement 7/1/54 & 92 021.70\nReceipts Deposited 7/2/54 010,73\n$110 032.43\"\nLess Disbursements 7/12/54 96 061.84\nBook Balance per Statement 12/31/54 $ 13 970.59\nBalance—Bank Statement 12/31/54 $ 14 614.40\nLess checks outstanding 643-81\nCorrected Bank Balance $ 13 97Q*§2.\nChecks outstanding total $643-81\nAUDIT REPORT\nNational Association of Educational Broadcasters\nfor the six months ended December 31, 1954\nSCOPE OF AUDIT: All deposits and disbursements were checked in detail in verify¬\ning the cash position at beginning and end of period. The subsidiary ledgers\nwere examined in detail to verify the total income from membership dues and\nNewsletter subscriptions. Charges to various restricted funds were examined in\ndetail as to appropriateness and amount.\nGENERAL COMMENTS: Those accounts which, grouped together, represent the net\nworth as regards cash of NAEB are grouped at the top of the accompanying finan¬\ncial report. There were considerable sales of albums, largely from inventories\non hand July 1, so that there is a large net income in this category. This\nbeing the-Hoff” season” as to dues, receipts there are small, since theycome\nalmost entirely in the first half of any calendar year. This report is strictly\non a cash basis and does not reflect any amounts payable as of December 31,\n1954. Note is made on the report of the Social Security tax liability of NAEB\nin matching contributions of employees.\nTRANSFER OF CASH: The retiring treasurer, Mr. Schooley, already has transmitted\n$40,000.00 to his successor, Mr. Coleman, to enable him to set up his bank\naccount and continue fiscal operations of the association without interruption.\nTransfer of the audited balance as shown on the accompanying report should dis¬\ncharge the obligations of Mr. Schooley as treasurer. The books of the associa¬\ntion have been examined in detail and correctly reflect the cash position as\nof December 31, 1954.\nSigned//Paul McMichael"
}