{
  "id": "d1647-3",
  "text": "-Dr, Arthur G, Crane\nPage 4\ngetting the best over the radio that America can produce.\nWe believe that the proposal we make is in strict accord with American\nprinciples. We believe that this American government has depended very largely\nupon the interplay of controversy and of ideas between minority and majority,\nhas depended upon checks and balances, has depended upon the turmoil, if you\nplease, of democratic discussion, study, and information. We need the opportunity\nfor a man with ideas, even though he be in the minority, to get those ideas before\nthe people and in an orderly way through discussion and persuasion, finally to\nmake the ideas acceptable to the majority.\nIn this three-fold combination system, then, we do not have government monopoly\nTherefore, many of the arguments which have appealed to you as being sound objection\nto a government system, do not apply because this is not a monopoly system; this\nis a proposal, in fact, to change the present monopoly system into one that is\nnot a monopoly.\nIt is obvious that America must be assured that the sources of general informa¬\ntion shall be correct, that there shall not be suppression of vital facts, that\nthere shall not be vicious propagandizing, that the control shall be honest and\ncourageous and shall be animated with a desire for public welfare. It is not\nwise for America to permit any system of communications by any chance to come under\nthe too complete domination of any parties, however fine and commendable those\nparties may be.\nThe proposal that we are making is that the control shall be vested in a\nseries of boards; first, a national board to determine national policies; advising\nand cooperating with the national board, a series of regional broads, these\nregional boards to attend to questions of regional importance and value; under\nthe regional boards, state boards, one in each state in the bnion.\nNow, can America, frankly, depend with assurance upon the integrity and\n(MORE)"
}