{
  "id": "d1647-5",
  "text": "Dr. Arthur G. Crane\nPage 6\ncontroled by the same public that controls the schools, both public and private,\ncan very properly be permitted to enter those schools with school programs.\nIn the state of Wisconsin, where state broadcasts have been made to schools,\nit has been proven that classes given the advantage of the vitalized stimulating\neffect of frequent radio broadcasts progress twenty percent faster than control\ngroups. Education in the schools needs broadening, and here is a vitalizing in¬\nfluence that can come into the remotest rural school with its few pupils, out in\nsome of our mountain canyons just as it can into your metropolitan areas. There\nare 30,000,000 of American citizens this year in schools, public and private.\nHere is an essential service which alone is sufficient to justify a governmental\nsystem with all its attendant expense and any difficulties that it may encounter.\nThe nation’s health is of inestimable'value. Our medical friends are willing\nand anxious to present educational health facts, but I fear that there are times\nthat this would interfere with and perhaps make inevitable a.clash with the ad¬\nvertisers of particular remedies, a clash which is very likely to keep from the\npublic the facts and the truth regarding health. Health, then, is another field\nof service for our public chain.\nAll ot us realize the possibilities of service the governmental system could\nrender to public business. Our own college stations, particularly those in the\nland-grant colleges, have been of inestimable value in the last few years in ex¬\nplaining to people the various agencies which the Government was putting in opera¬\ntion for the relief of distress in those communities. The University of Wisconsin\npresents broadcasts each week by members of the state legislature who discuss the\nhappenings at their state capital.\nThe University of Wisconsin last year offered free the facilities of the state\nstation to all political parties and all political faiths, and gave them equal\nopportunity on the air, They claim it created and renewed a general interest in\n(MORE)"
}