{
  "id": "d1647-6",
  "text": "Dr. Arthur G. Crane\nP-.-.ge 7\npublic affairs, and that there were no difficulties connected with it.\nThere is no other possible justification for any broadcasting system except\nthe rights of the listener. He pays all the bills; his interest is paramount.\nNothing can be said that can, by any process, apply to the vested interests of\nany kind that will take precedence over the rights and values to the listener.\nWe find that there are millions of American citizens who desire the privilege,\nif you please, of turning the dials on their instruments to the programs that\nthey know are put out solely for public welfare, regarding which they know there\nis no suspicion v/hatsoever of advertising control or influence. Probably the\npeople to whom I refer are not in the majority in America, but at least they are\na large, substantial, and valuable minority.\nWe hear a good deal about listeners* choice. What is your choice if it is\na choice between tweedle-dum and tweedle-dee? What choice have you unless you\ncan select from a wide range of programs? Therefore, we believe that this three¬\nfold system of the private chains, the government chain, and the local stations\nwill, in all probability, afford the richest variety of program material.\nAmerica is trying an experiment. Other nations which have tried the experi¬\nment of popular government in the last decade have seemingly given up in despair\nand gone back to some autocratic form of government. America still persists in\nher effort and her loyalty to government of, for, and by the people, basing her\nfaith largely upon, first of all, free thinking, the right of each man to think\nthrough and make his own decisions on questions affecting himself and the public.\nHowever, free thought is of little value without the privilege of free speech,\nand what is radio but free speech, an instrument which makes vocal the voice of\na nation, and if that opportunity is not free than we have a restriction of the\nfreedom of speech. We have safeguarded it in our post office where it is merely\ncommunication by letter. We have kept control of it as a Government matter even\n(MORE)"
}