{
  "id": "d1099-0",
  "text": "1\nN\nA\nE\nE\n**\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXIII, NO. 7 URBANA, ILLINOIS JULY, 1958\nSCHOOLEY NAMED\nNAEB PRESIDENT\nFrank E. Schooley, Director of Broadcasting at the\nUniversity of Illinois, was named President of the\nAssociation by the Board of Directors at a special\nmeeting in Chicago June 25. Schooley will fill the un¬\nexpired term of Burton Paulu who resigned (see\nstory below).\nAccording to the NAEB by-laws, “Vacancies that\nmay occur on the Board of Directors and/or elected\nofficers by any cause shall be filled by the Board of\nDirectors for the unexpired term.” Schooley, who\nserved as NAEB President in 1944 and 1945 and\nagain in 1955 and 1956, will serve until January 1,\n1959. The President for 1959 will be elected at the\nconvention in Omaha this fall.\nOne of Schooley’s first official acts as President\nwas to name the nominating committee which will\npresent the slate of officers to be voted on at the\nconvention. Graydon Ausmus, WUOA, University of\nAlabama, was named chairman of the committee.\nServing with Ausmus will be Edward W. Rosenheim,\nJr., University of Chicago; Henry Chadeayne, KETC,\nSt. Louis; William Harley, WHA-TV, University of\nWisconsin; Edwin Adams, University of Washington;\nEarl Wynn, WUNC, University of North Carolina;\nand Mrs. Dorothy Klock, WNYE, New York.\nPRESIDENT PAULU RESIGNS\nTO STUDY ABROAD\nDr. Burton Paulu has announced his resignation from\nthe presidency of the NAEB in order to continue\nresearch in European broadcasting.\nA grant from the Fund for the Advancement of\nEducation makes possible a year’s study in the United\nKingdom and in Europe. Provided a sabbatical leave\nfrom the University of Minnesota where he is di¬\nrector of radio and television broadcasting, Dr. Paulu\nand his family will leave in September.\nA teaching obligation at the University of South¬\nern California this summer created circumstances\nnecessitating an immediate resignation, according to\nDr. Paulu, although he said that he will remain avail¬\nable to consult with his successor and help the as¬\nsociation in every way possible upon his return in\n1959.\nDr. Paulu has spent considerable time abroad,\nfirst with the Office of War Information in 1944 and\n1945 which led to his doctoral dissertation on the\nVoice of America. A Fulbright scholarship for the\nacademic year 1953-54 provided him with a year’s\nstudy in London during which time he gathered data\nfor his book, British Broadcasting. His present travel\ngrant will permit continued study in this area of in¬\nterest.\nDr. Paulu has served the NAEB in a variety of\ncapacities: he was elected as secretary three times,\nvice president twice, regional director once, and pres¬\nident twice. Although pleased with the study op¬\nportunities made available to him, Dr. Paulu ex¬\npressed his regret at leaving the presidency before his\nterm was completed.\nPARTICIPANTS SELECTED FOR\nCONFERENCE ON INSTRUCTIONAL TV\nTwenty-six participants have been selected from a list\nof eighty-three applicants to attend the NAEB con¬\nference on Instructional Uses of Television and Radio.\nMeetings will be held at Purdue Memorial Union,\nPurdue University, Lafayette, Ind.\nThis conference, is designed not only for broad¬\ncasting personnel, but also includes participation by\nfaculty members from schools of education concerned\nwith methods of instruction.\nThe list of participants includes:\nElaine Afton, consultant, station KETC, St. Louis,\n1"
}