{
  "id": "d1099-1",
  "text": "Mo.; Michael Ambrosino, station WGBH, Lowell Co¬\noperative Institute, Cambridge, Mass.; Harper Beaty,\nCollege of Education, University of Houston, Tex.;\nMrs. Marye Benjamin, University of Texas, Austin;\nHerbert Coon, University School, Ohio State Univer¬\nsity, Columbus; Jean Eicks, station WYNE, New\nYork Board of Education, Brooklyn; T. Ross Fink,\nCollege of William and Mary, Norfolk, Va.; Paul\nHansen, University of Utah, Salt Lake City; John\nHenderson, station WBAA, Purdue University, La¬\nfayette, Ind.; Dr. Margaret L. Hiatt, Oregon College\nof Education, Monmouth; Howard Holst, station\nWKNO-TV, Memphis, Tenn.; Dr. Helen Holt, Uni¬\nversity of Toledo, Ohio; and J. Allen Lamer, Central\nCalifornia ETV, Sacramento.\nOthers selected are: Lillian Lee, station WABE,\nBoard of Education, Atlanta, Ga.; Ronald Lowder-\nmilk, U. S. Office of Education, Washington, D. C.;\nHarry Lyle, Birmingham Area ETV, Alabama; Arlene\nMcKellar, station WHA, University of Wisconsin,\nMadison; Ted Milligan, station WCET, Cincinnati\nTV Foundation, Ohio; Lewis Rhodes, station KUON-\nTV, University of Nebraska, Lincoln; Donald Schein,\nMohawk-Hudson Council on ETV, Schenectady, N.\nY.; Raymond Schultz, Florida State University, Tal¬\nlahassee; William Spencer, New York University,\nNew York; Melvin Timmerman, University of New\nMexico, Albuquerque; Mrs. Elaine Tucker, Oklahoma\nCity Public Schools, Oklahoma City; Jay Van Trees,\nstation KRMA, Denver Public Schools, Colorado;\nand Harry Webb, College of St Thomas, St. Paul\nMinn.\nThe seminar, made possible by a Ford Founda¬\ntion grant, was planned, and is being conducted by\nthe NAEB Utilization committee, chaired by Gale\nR. Adkins, Director, Radio-TV Research, University\nof Kansas. The committee also selected the twenty-\nsix participants for whom expenses will be paid.\nIn keeping with other NAEB seminars, the con¬\nference program has been planned in the best way\npossible to benefit those in attendance. For this\nmeeting, sessions primarily will be concerned with\nthe classroom utilization of instructional broadcasts\nprepared specifically for in-school use. Conference\ngoals are to increase educators’ awareness of the real\npotential of radio and' television as instructional tools\nand to stimulate improved preparation and training\nof future teachers in the use of these tools.\nThe five-day seminar will give participants an op¬\nportunity to exchange ideas among themselves and\nalso to discuss problems under the advice and leader¬\nship of outstanding educators and broadcasters who\nwill act as consultants.\nConsultants named to date are:\nGale R. Adkins, director of Radio-TV Research,\nUniversity of Kansas, Lawrence, Kan., and chairman\nof the NAEB Utilization committee, which planned\nthe conference.\nArthur W. Foshay, executive officer, Institute of\nSchool Experimentation, Teachers College, Columbia\nUniversity, New York City.\nHelen Heffernan, head of the. Bureau of Element¬\nary Education, California State Department of Edu¬\ncation, Sacramento, Calif.\nClair R. Tettemer, director of school programs for\nstation KETC, St. Louis, Mo.\nCharles Hettinger, supervisor of Television Edu¬\ncation, Pittsburgh Public Schools, Pittsburgh, Pa.\nGeorge C. Johnson, director of Radio and TV Ed¬\nucation, Indiana University, Bloomington, Ind.\nElaine Afton, elementary school program con¬\nsultant for station KETC, St. Louis, Mo.\nRyland Crary, director of education, Educational\nTelevision and Radio Center, Ann Arbor, Mich.\nWilliam B. Levenson, deputy superintendent,\nCleveland Public Schools, Cleveland, Ohio.\nGerald Willsea, director of the Department of\nRadio-TV of the Denver Public Schools, Denver,\nColo.\nMEMO FROM THE EXECUTIVE DIRECTOR\n—Harry Skornia\nIn keeping with recent practice, essential news items\nare not included in this column. Therefore notice\nof the resignation of Burton Paulu as President of\nthe NAEB, the promised' report on our recent Wash¬\nington Conference, and other such items, will be found\nelsewhere in this issue.\nInstead, I should like to pursue with you several\nother problems about which I believe it is absolutely\nessential that we should be thinking, as an association.\nThe first of these was partly revealed in our\nWashington meeting. But I have found the same dis¬\nquietude beginning to appear as rumblings at many\nother meetings and in many conversations with people\nwho are equally as sincere as we are about the goals\nof American education, and ways in which we can\nbest achieve them.\nThis problem can probably best be stated in the\nform of a question: Is television, as an instrument or\ntool of education, to be used to do the same job of\neducation we are now doing, only more cheaply (and\nmore efficiently) or does it challenge us to use it to\ndo things, essential to education in our era, which\nprinted media and other tools and procedures can’t\nNAEB N ewsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 14 Gregory Hall,\nUrbana, III. $5 a year, edited by Jane Lombard.\n2\nNEWSLETTER"
}