{
  "id": "d1099-6",
  "text": "port plan for educational radio program development.\nThe NAEB has contributed its support in soliciting\nand evaluating Grants-in-Aid proposals, advising on\nprogram series to be commissioned, and supplying the\nprograms to educational radio stations serviced\nthrough the NAEB radio network.\nThe NAEB Grants-in-Aid Committee which\nselected the applicants for recommendation is com¬\nposed of Edward Rosenheim, Jr., University of\nChicago, chairman; Larry Frymire, stations WKAR-\nAM-FM, Michigan State University; R. Edwin\nBrowne, stations KFKU and KANU, University of\nKansas; Harry Lamb, station WTDS, Toledo Public\nSchools; and Mrs. Elizabeth Marshall, station WBEZ,\nChicago Board of Education.\nTWELVE RECEIVE\nNAEB SCHOLARSHIPS\nSummer scholarship grants totalling $1,975 have\nbeen awarded to twelve persons as part of the\nNAEB’s program to improve qualifications of edu¬\ncational broadcasting personnel.\nThis is the second group of recipients selected' for\n1958 summer NAEB scholarships. Nine other grants\nwere announced in the May Newsletter. Grants for\nboth groups were awarded primarily on the basis of\nthe contribution to educational broadcasting likely\nto result from attendance at the summer sessions.\nOf the recent group of scholarships, seven supply\nfunds for summer study in workshop or academic ses¬\nsions and the remaining five grants provide for a\nfour-week period of in-service training at commercial\ntelevision stations.\nRecipients of the scholarships are:\nMartin P. Busch, representing the State Univer¬\nsity of South Dakota, who will participate in the\nNorthwestern University-NBC Internship program.\nAlexander J. Buttice, of Hofstra College, N. Y., to\nattend New York University’s summer workshop in\ntelevision and radio.\nMarguerite Hare from the Teachers College,\nState University of New York, attending the summer\nworkshop in educational TV at Syracuse University.\nFrank Holston, representing Baltimore Junior\nCollege, to participate in the Northwestern-NBC In¬\nternship program.\nThomas Petry, from the University of New\nMexico, who will attend the New York University\nsummer workshop.\nThomas Quigley, representing the University of\nMinnesota Department of Broadcasting, to attend\na workshop on “Communication by Television”\nat Michigan State University.\nRobert L. Snyder, from Kansas State College, to\nattend the summer session at the State University\nof Iowa.\nThose grantees who receive funds for in-service\ntraining will spend one-week sessions at four Indi¬\nanapolis, Ind. commercial stations. All members of\nthe Purdue University Radio-TV Unit, they are:\nJohn Glade, James Potter, Jack Carroll, Keith Butz,\nand Raymond Wolf.\nMANAGEMENT SEMINAR\nPLANNED FOR AUGUST\nPlans are underway for the second NAEB Educa¬\ntional Television Station Management Seminar to be\nheld August 24 - 27 in Madison, Wis.\nA grant from the Ford Foundation provides the\nNAEB with funds to defray transportation and living\ncosts of all ETV station managers attending.\nThe seminar program is being arranged by the\nTV Management Committee headed by Richard L.\nRider, WILL-TV, University of Illinois.\nAlthough the program is still tentative, general\nareas that will be considered include,: financial mat¬\nters such as budgets, fund raising, and increasing ap¬\npropriations; implications of national legislation; the\nrole and future plans of national organizations such\nas the JCET, the NAEB, and the ETRC; relations\nwith faculty, teachers and other talent; and the re¬\nlationship between televised instruction and general\neducational programming.\nNBC BECOMES FIRST\nNAEB SUSTAINING MEMBER\nThe National Broadcasting Company is the first\nSustaining member of the NAEB. NBC had for many\nyears supported the Association for Education by\nRadio-Television with an annual contribution of $100.\nWith the merger of the AERT and the NAEB, the\nnetwork transferred its support to the NAEB, with\nwhom it has had a long and friendly relationship.\nSustaining membership is open to any individual,\norganization or corporation (not eligible for mem¬\nbership as an Industrial Associate) wishing to foster\neducational broadcasting through the NAEB.\nRADIO PIONEERS!\nHow many NAEB members or station staff mem¬\nbers have been in radio and/or television for\ntwenty years or more? With an idea in mind of\nforming a “Pioneers’ Club,” we’d appreciate your\nletting us know if you qualify.\nJULY, 1958\n7"
}