{
  "id": "d1812-0",
  "text": ",\nOffice of Executive Secretary\nUrbana, Illinois\nAugust I, 1941\nON TO PURDUES\nRemember the Fall convention of the National Association of Education-\nal Broadcasters will be held September 5 and 6 on the campus of Purdue\nUniversity, West Lafayette, Indiana, Plan to be there* Plan to bring\nas many members of your staff as you can spare*\nProgram plans will be issued in a special issue of the News Letter*\nPresident H* G„ Ingham has appointed a special committee to work\nout plans for the meeting* Chairman Gilbert Williams, WBAA, has\ncalled a meeting of the committee* Other members are H* B® McCarty\nand Schooley*\nMORE FROM OHIO STATE\nR* Co Higgy, Director of WOSU, writes on July IIs\n111 am glad to advise that we are now proceeding with the installation\nof our R0CoAc 5*000 Watt transmitter* The F*C*C® granted our construc¬\ntion permit on April 30, and has recently made changes of assignments\non 820 Kilocycles, removing almost all interference, so we decided\nto proceed with the change* The new transmitter is being installed\nnow and we hope to have it ready for tests in about a week,\n\"We are planning to broadcast on the new assignment about I0£ hours\ndaily, starting around August I* We plan to run from 9s00 a.m. to\n7s30 pom*, possibly later starting at 8s00 acm* as we work into the\nnew schedule* We are looking forward to extending many of our program\nservices, including the school broadcasts and Radio Junior College\nofferings® We plan to extend our Farm Service broadcast considerably,\nprobably presenting a noon Farm Hour dally, instead of the weekly\ntwo-hour Farm program that w© have carried for many years*\nTHE RADIO COUNCIL\nWork of the Radio Council of the Chicago Public Schools is recounted\nin the 1939-1940 annual report of the Chicago Superintendent of\nSchools Wm® H* Johnson® Reprints of the report are now available*\nTHE SCHOOL RADIO-SOUND SYSTEM\nThe Evaluation of School Broadcasts, a study eponsoredhythe FREC\nat Ohio State University, has J^t published a bulletin whioh will\naid teachers Interested In making 'the most of the c®ntf®^mllk9\nsound systems In their schools. Written by Dr. R. R. Lowdermns,"
}