{
  "id": "d1812-14",
  "text": "-15-\n2. FM is used less often than AM or TV. People who have FM use it on about\ntwo days of each week. Where an AM set or a TV set is available it is\nused on about five of every seven days* FM sets are used less than half\nas often as AM sets or TV sets are used.\n3. FM holds listeners’ interest for about as long as TV does but for less\ntime than AM does. On days when people listen to FM or on days when they\nwatch TV, the FM set or the TV set is turned on for one to two hours. On\ndays when the AM set is Used it is turned on for from two to three hours.\nU. Considering both how often it is used and how long it is kept on when\nused, the average FM set is used less then either the average TV set or\nthe average AM set. The TV set is used more than twice as much as the\nFM set and the AM set is used more than four times as much as the FM set.\n5* On an average day, FM is heard in about 765 homes or by about 2250\npeople in Tuscaloosa. The FM audience during an average hour is esti¬\nmated to be about seventy-seven homes or 225 people. (The population of\nTuscaloosa is about U6,U00.)\n6. People in FM homes are a select market. About nine out of ten FM sets in\nTuscaloosa are in the homes of white people, and about seven out of ten\nof these people are middle-class.\nALABAMA COLLEGE CAMPUS STATION\nTo provide experience and training in the commercial aspects of radio, WRSD, Alabama\nCollege’s campus station, has received College administration approval to accept a\nlimited amount of advertising. Commercial policies for the station were drawn up to\nprovide as wide experience as possible for the nearly 50 women who operate the sta¬\ntion.\nAccording to Ralph W. Sears, Director of Radio at Alabama College (an NAEB associate\nmember), the acceptance of advertising will provide training and experience in such\nfields as continuity writing, radio sales and salesmanship as well as general busi¬\nness experience in radio. Local sales will be obtained by a student staff, while the\nIntercollegiate Breadcasting System will act as agent for national advertising.\nWSRD, one of the two campus stations in Alabama is operated entirely by women, and\ncurrently is completing a ’’Hooper type** survey of its broadcast schedule. Other\ntypes of surveys to determine program and time preferences and a general audience\nanalysis are planned in cooperation with the station's commercial activities.\nWABP, University of Alabama Campus Station, Celebrates Anniversary\nThe other Alabama caucus station, WABP, at the University of Alabama celebrated its\nfourth birthday on Tuesday, November 20, with the presentation of Miss WABP, an\nannual feature of the anniversary celebration. Open house was held during the\nevening* Tapping ceremony of Alpha Epsilon Rho was another event of the evening."
}