{
  "id": "d1812-18",
  "text": "-39“\nMilwaukee Conference\nCivic and educational authorities in Milwaukee have been making an intensive study\nof educational television under the auspices of the Milwaukee Educators’ Committee\non Television. In furtherance of the inquiry, the Committee conducted a '’Conference\non the Needs, Potentialities and Means of Providing Education by Television in the\nMilwaukee Area\" on November Ik, 19£l. The State Radio Council was represented by\nH. B. McCarty, who was invited to review the development of educational radio and\nexplain the functioning of the state FM network.\nRESEARCH REPORT\nby\nDallas W. Smythe\nNAEB Director of Studies\nInstitute of Communications Research\nUniversity of Illinois—Urbana\nThe educational broadcaster has a characteristic advantage over his commercial broad¬\ncaster friends in that the former is located in an institution devoted to learning.\nHe has easy access to specialists in all fields of science. But this close proxim¬\nity to experts makes it desirable, if not necessary, for the educational broadcaster\nto be able to talk a little bit of the specialized language of each of the fields of\nscience. While it would be humanly impossible for him to be a universal expert-in\nall these fields, it is obviously desirable that he understand quite a bit about\nsome of the fields, and something about most of them. One function which this\ncolumn might perform is to call to the busy educational broadcaster's attention some\nof the outstanding books in some of the fields most closely connected with educa¬\ntional broadcast policy. Last month’s column dealt with some social science re¬\nsearch bearing on the meaning of imaginative material in programs listened to or\nviewed by children.\nThis month, I want to call to your attention another recent book dealing with a\ntopic which ought to interest all of you. It’s title is Childhood and Society.\nIt’s author: Erik H. Erickson. It’s publisher: W. W. Norton & Company, New York.\nIt’s price: &U.75.\nIf you are associated with an institution of higher education there may be in your\nminds the question: why should I be particularly interested in a book on childhood?\nThat’s o.k. for the school broadcaster, but I have different and perhaps bigger fish\nto fry than that. Erickson meets such a question head-on, for he says in his Fore¬\nward,\n’’This is a book on childhood. One may scan work after work on history, society,\nand morality and find little reference to the fact that all people start as\nchildren and that all peoples begin in their nurseries. It is human to have\na long childhood^ it is civilized to have ever longer childhood. Long child¬\nhood makes a technical and mental virtuoso out of man, but it also leaves a\nlife-long residue of emotional immaturity in him.”\nIn short, all adults once were children. And the anxieties common amcng adults to¬\nday in our society have their roots in the childhood of our culture. If we would\nstand off and get a perspective on these anxieties of adults, it will help to look"
}