{
  "id": "d1812-19",
  "text": "-20-\nfor their origins in childhood. And, further, to get a perspective on the problem,\nit will help to examine the differences between the child training practices and\npolicies of our culture and those of other cultures. For as Erickson says,\n\"While tribes and nations, in many intuitive ways, use child training to the\nend of gaining their particular form of mature human identity, their unique\nversion of integrity, they are, and remain beset by the irrational fears\nwhich stem from the very state of childhood which they exploited in their\nspecific way.\"\nThoughtful consideration of such a book as this, therefore, is relevant to such\nadult problems as what kind of broadcast series to plan on the subject of our\nforeign policy. A series on relations between the US and the USSR might be planned\ndifferently after than before reading Erickson. We take it as axiomatic that know¬\nledge leads to understanding; that understanding has a way of relieving irrational\nanxiety and tensions.\nThe author is a psychologist, and a psycholoanalyst (specializing in children’s dis¬\nturbances) and a cultural anthropologist. With this background it is refreshing to\nfind that he. rejects the easy and superficial concept that such cultural problems\nas war, racial discrimination, revolutionary movements, etc. are analogous to\nneuroses in the individual. Rather, as I have indicated above, he treats such prob¬\nlems as related to the values nurtured in the individual’s childhood by the customs\nof his society. As he puts it, \"In a sense, this is a psychoanalytic book on the\nrelation of the ego to society.\"\nThe book’s basic chapters are analyses of illustrative anxiety situations drawn from\nthe author’s own work: anxiety in young children in \"ordinary\" American homes;\napathy in two very different, tribes of American Indians; the Sioux and the Yurok;\ndisturbances in veterans of World War II; and the arrogance of young Nazis.\nThe core of the book comes in Chapter 7, \"The Eight Stages of Man.\" Here the author\noffers a systematic structure of the dynamic development in the individual of the\nego in relation to his society. Psychologically, the eight stages of human life\nare? (1) oral-sensory, (2) muscular-anal, (3) locomotor-genital, (it) latency, (5)\npuberty and adolescence, (6) young adulthood, (7) adulthood, and (8) maturity. As\nthe individual passes through these stages different ego qualities are formed. The\nparticular formation of the ego quality in the indivldual at each stage may have\nconnotations of health or illness. These qualities may be expressed in terms of\ntheir healthy-versus-illness meanings as follows: (1) trust vs. mistrust, (2)\nautonomy vs. shame and doubt, (3) initiative vs. guilt, (ir) industry vs. inferiority,\n(5) identity vs. role diffusion, (6) intimacy vs. isolation, (7) generativity vs.\nstagnation, and (8) integrity vs. disgust and despair.\nNo brief summary can do justice to his treatment of this unfolding process and the\nmere recital of the terms is more provocative than informative. Let me then quote\nbriefly from the conclusion of this chapter:\n\"Each individual, to become a mature adult, must to a sufficient degree de¬\nvelop (the healthy side of) all the ego qualities mentioned, so that a wise\nIndian, a true gentleman and a mature peasant share and recognize in one\nanother the final stage of integrity. But each cultural entity, to develop\nthe particular style of integrity suggested by its historical place,\nutilizes a particular combination of these conflicts, along with specific\nprovocations and prohibitions of infantile sexuality. Infantile conflicts\nbecome creative only if sustained by the firm support of cultural insti-"
}