{
  "id": "d1812-2",
  "text": "-3-\nNo Fine Arts or Dance Programs\nSome types of programs which had been observed in other monitoring studies did not\noccur at all during the test week. There were no programs dealing with the Fine\nArts or the Dance, There were no programs during the week produced by or identified\nwith an educational institution.\nFifty-eight per cent of all time during the so-called \"adult hours\" (seven to eleven\neach night) was devoted to Drama, Variety and Popular Music, Programs classified as\nInformation, Public Issues orpublic Events took approximately the same proportion\nof time during these hours as they did during the week as a whole.\nAbout three-fifths of the programming after eleven o’clock at night was given over\nto some form of Drama, Variety or Popular Music. During the test week, a fifth of\nthe time available during these late hours consisted of re-broadcasts from the\nscene of the Buena Park kidnapping. Among the late hours Drama programs, Crime\nDrama had a preferred place with 11 per cent of the total program time, a higher\nproportion than in any other period of the day.\nApproximately one-fifth of the so-called \"domestic-hour\" programming (week-days from\nsign-on to five p.m.) was devoted to Housewives’ Variety programs. Cooking programs\namounted to 11 per cent of the Domestic time. Shopping and Merchandising programs\naccounted for an additional three per cent.\nFifty-five per cent of all the program time devoted to children (five to seven p.m,\nweek-days and from sign-on to seven a.m. Saturday and Sunday) was occupied by Drama,\nhalf of which was Western Drama.\nEighteen Per Cent of Total Time Devoted to Advertising\nDuring the week monitored by the NAEB social scientists, one minute in six of Los\nAngeles television was devoted to advertising. Putting it another way, 18 per cent\nof the total time on the eight TV stations serving Los Angeles was taken up with\nadvertising in one form or another, over 19 per cent if the Buena kidnapping broad¬\ncasts are not considered. However, the different stations varied substantially in\nthis regard with one giving 26 per cent of its time to advertising as compared to\napproximately lU per cent for another.\nThe greatest proportion of time given to advertising was in the domestic-hours,\nclosely followed by the adult hours. Both of these periods devoted approximately\none-fifth of their time to advertising.\nFor the purposes of this study, all televised advertising was classified by the\nscientists as either primary or secondary. Primary advertising consisted either of\ndirect sales statenants which occurred at points within programs or of similar\nstatements less than three minutes in length during the station breaks between pro¬\ngrams. Secondary advertising consisted either of straight advertising programs\n(longer than three minutes), the content of which was primarily concerned with the\nsales message of the sponsor, or of so-called \"inter-mixed\" background advertising\namounting to more than 50 per cent of the total time of the program.\nThere was a total of $$1 hours and minutes of TV programming available to Los\nAngeles viewers in the study week from the 7 Los Angeles stations, as compared with\n56U hours and 35> minutes of programming available to New York viewers during the\ntest week of January Uth - 10th, 1951, from the same number of stations."
}