{
  "id": "d1812-25",
  "text": "-26-\norganizations as follows: The American Council on Education, The Association for,\nEducation by Radio-Television. The Association of Land-Grant Colleges and Universi¬\nties, The National Association of Educational Broadcasters, The National Association\nof State Universities, The National Council of Chief State School Officers, and The\nNational Education Association.\nThese organizations, prior to the formal organization of JCET in April 195l, were\ninstrumental in presenting testimony, beginning in November 1950, which led directly\nto the Federal Communications Commission’s proposal for educational television res¬\nervations .\nExecutive Director of JCET is Ralph Steetle, who is on leave from his permanent post\nas director of Louisiana State University’s FM station WLSU. The JCET mailing ad¬\ndress is 1785 Massachusetts Avenue, Washington 6, D. C.\nTV CONFERENCES AND INSTITUTES DEVEIGPING\nWord comes of several conferences about television education.\nIn Pittsburgh there was a recent conference with the Mayor, the Mayor’s Committee and\nsome smaller administrative groups. Emphasis was on (1) development of mechanism for\ncooperation; (2) financing; and (3) training personnel for educational television.\nMilwaukee had a TV Institute in the form of a Debate on the merits of educational\ntelevision on commercial stations vs. non-commercial educational television station\noperation. McCarty, Hull, Tyler, Rasche, and Steetle opposed Wilkes and De Grace\n(Hearst Radio).\nIn East Lansing, Michigan, a meeting of the Big Ten American College Public Relations\nAssociation devoted a full session to television. There was a good closed circuit\ndemonstration by Michigan State and talks by Hunter (Michigan State), Garrison\n(Michigan), Rickard (Wayne), Armsey (Illinois Tech.), and Steetle.\nIn Birmingham, Alabama, at a meeting called by Leslie Banks, local superintendent,\nthe superintendents of the area and representatives of Birmingham College discussed\nproblems of television operation including the financing of a station. They favored\ncorporate organization with all groups contributing.\nIn Memphis, Tennessee, there was a meeting with Julian Bondurant, President of the\nSchool Board, and a representative of Southwestern at Memphis, which discussed the\nrecent attempt of commercial interests in the area to persuade educators to relin¬\nquish the asterisked frequency.\nIn a meeting at Memphis State College the dean and some department heads attended.\nThis group agreed that the Memphis Board of Education would probably take the lead in\neducational television in that area, cooperation from the College.\nIn. St. Louis, Missouri, there was a meeting in the Office of the St. Louis Board of\nEducation. Present were Raymond Wittcoff, President, Adult Education Council of\nGreater St. Louis, and Chairman of Mayor’s Committee ori Educational Television; rep¬\nresentatives from Washington University and St. Louis University, school superinten¬\ndents of area and representative of commercial station. The group will report back\nto Mayor who will coordinate plans. Another meeting was held January 7 to discuss a\nnational television network."
}