{
  "id": "d1812-26",
  "text": "-27-\nNAEB PRESIDENT’S PAGE\nPrepared by\nSeymour N. Siegel\nWNYC, Municipal Broadcasting System ^\nNew York\nAmong the many plans advanced at the Biloxi Annual Meeting., f or the coming year,\nthose in attendance remember the. emphasis placed on the necessity for research and\npromotion by individual member stations.\nIn the improvement of management of any radio station . • . whether it be commercial\nor educational . . . certain basic facts must be available on a dependable, contin¬\nuous basis. All of the most wonderful programs in the world mean very little if the\naudience does not know of their availability*. Furthermore, in order to program\nproperly, management must have certain basic facts.\nIt is a matter of deep-seated curiosity to the officers and directors of NAEB as to\njust how many individual, meiriber stations have something as fundamental as a knowledge\nof their service area. In emphasizing the need for research and audience building,\nperhaps it might be advantageous to reduce the problem to simple terms. How many\nmember stations can answer the following questions*\nDoes your station have an engineering map or a mail-pull map?\nDoes it have any other index of the physical area covered by your signal?\nHow much of your listening area is urban and how much is rural?\nHow many radio homes are there in your area?\nDo you have certain quantitative information, such as the number of retail\nstores, sales value, per capita income, automobile registrations, bank depos¬\nits, etc., all of which might determine the economical pattern of your lis¬\nteners?\nWhat local or civic interests or problems are more or less peculiar to the\npeople in your listening area?\nAre they home owners or renters? Are they eater-inners or eater-outers? Do\nthey go for Cadillacs or Fords? Are they friendly or aloof? Do they stay at\nhome or do they entertain outside the home?\nWhat about local customs and mores?\nWhat about local civic pride?\nWhat are their program preferences?\nDoes your station have any high degree of loyalty among all the listeners in\nyour area?"
}