{
  "id": "d341-52",
  "text": "Xt@a ID\nOctober 17, 1957\nDear !*• Greens\nSacs© tins ago, order to facilitate ralstlooshlps with Corporation®,\nand enable thm to contribute to the deTOlnpacnt of educational tale*\nvision and radio nationally m educational inatriassnts, a nm NAEB\nmembership category, w created, designated as .a \"Sustaining' T^mberehip\"®\nHolders of such memberships work closely with ue m the national\nprofessional and educational trad® association* This new relationship\nmkBB possible increasingly close cooperation and -to mutual promotion\nof eduoe&toal and iadustrial interests and endeavors*\nAlttseu^ the annual .dues for such a mmbasrahip are set by the . ,l\nHIES Board is term- of the mtas of business, ability to pay, gpnsrosity\nand interest in contributing to the d@TOlopsm.it of educational television\nand radio, m feel that the contribution from larger corporation®, such\nas ymsrs, might b© of the order of §500*00*\nMs hep® that Thompson Products, Incorporated my wish to comltim? I\nsuch a membership or coiifcributto to our tax esaarapt assooiaito, —- ‘1\nm arrangement which haa bsen established to' replace' eubscrlptto rela¬\ntionships with such corporation® end crgsatotloo#®\nObviously such a membership would bring you all our materials,\nw cloes inrolTOmeat in the pluming and conducting of engineering,\npreduetto and other workshops which wo conduct regularly, 'and close\ncontact with ow consultation sarnie®®, in which we would ©aspect to\niavolTO such members toni®sing3y*\nI tberefege would ^pprociate your celling this to the attention\nof appropriate officials of your Gm^perstim, and hope that this\nrelationship may be found to offer premise of ccnsidarable advantage\nto you in the development of the grating meromiMt which educational\ntelevision is becoming*\nSiJMTOly,\nRrask E® Schodey, CHsairasm\nHJS/FES/dfc NAEB tfsmbership Committee\nMr* Robert E* Green, Director\nDepartment of Education\nThompson Products, las*\nWest 10th Street\nMichigan City, Indiana\nSimilar letter® sent?\nk_ RCA\nCentury Limiting\nSsrkes Tarsto\nOthers scheduled*\n3 M and other©"
}