{
  "id": "d341-6",
  "text": "3\nin understanding the new uses of the media which education implies. New stations\ngo an the air each month. Whan invited to membership in the NAEB, they ask what\nthe NAEB can do for them. The answer to this question not only determines whether\nthey will join but also how vigorously they can later justify to their administra¬\ntions an increase in NAEB dues* the gradual Introduction of charges for seminars,\nand tiie other contributions which each institution must assume in a newly-developing\nnational movement which most eventually support itself.\nScene funds ^or Seminars and Workshops, though more indirectly and slowly than\nsome of the other items discussed below, will greatly assist the NAEB to expedite\nthe achievement of self-supporting status through the continued growth of respect\nwhich will accrue both to the individuals concerned and to the NAEB itself as the\nusefulness of both to American education is increasingly recognized.\nIn the recognitions which have com to numerous individuals in the NAEB in\nonly the last two or three years we see evidence that recognition of our role is\nbeginning to develop. We believe that appointments to various national commissions,\nexecutive ccsnmittees and chairmanships of various national conferences, panels and\nmeetings constitute at least as much recognition for what the NAEB stands for as for\nthe individuals involved. This and other evidences give us confidence that the new\nrole we see for television and radio in America, based upon individuals with the\ntraining, devotion and inspiration which only seminars can provide, can be welded\ninto a profession which will someday enjoy the respect which we now envision it as\ndeserving.\nMaterials Distribution\nThe success of NAEB publications already is heart-warming in view of the meager\nresources so far available to support them. We note with pride the increasing\nnumber of quotations from the Newsletter, the Journal end other materials issued by\nthe Association, in foreign educational end broadcasting publications, as well a3\nmany in the U.S."
}