{
  "id": "d729-0",
  "text": "KPFA\n94.1 MEGACYCLES\nFM CHANNEL 231\nit a ViteA?\nFor several decades one has not been able to live many weeks without learning all\nover, from somebody who just thought of it, that “this is an age of specialization.” The\nnarrower the range of interests, the implication is, the better the chance for “success,”\nin teaching, engineering, science, the arts, or in just plain communication. One reason\nfor the imposition upon society by society of this cult of specialization is fairly obvious:\nit requires much less effort; it is more comfortable. Another: there’s too much to know\nnowadays, and as the man pursuing the horizon was told in Stephen Crane’s poem, “It is\nfutile; you can never—.” A third reason has become increasingly apparent with the\ntemper of these times: it’s safer.\nNow, it seems hardly portentous to insist that the importances in life are its truths.\nAnd the atomistic facts of the specialists can be no more than pieces of truths. Truths\nare never simple; they seem generally to incorporate within themselves many, many\npieces—usually, if there is controversy involved, from both sides. Advocates of the cult of\nthe rut achieve “success” in one sense at least; they diminish the possiblity of error. So,\nfor that matter, did the sorcerer-hunters of Salem.\nThe antithesis of specialization is scope. Scope is not only knowledge of a wide range\nof facts, it is also the ability to hold in mind the possible truth of a great many, probably\nconflicting hypotheses. It is the capacity for entertaining the possible truth even of those\nwhich conflict with the hypotheses to which oneself is committed. Scope is the potential\nfor synthesis, rather than compromise. It requires effort and, in these days particularly,\nvigilance. It is hard enough in any age to be whole, and exceptionally so in the age of\nanxiety. But when the effort to be whole is interfered with all around by denizens of the\nditch who would coerce one into lying there too, it’s time to protest. It always has been."
}