{
  "id": "d729-15",
  "text": "KPFA\n2207 Shattuck Ave.\nBerkeley 4, Calif.\nPostmaster: If addressee has re¬\nmoved, notify sender on Form 3547,\npostage for which is guaranteed.\nSec. 34.66, P. L. & R.\nU. S. POSTAGE\nPAID\nBERKELEY, CALIF.\nPermit No. 219\nSpecial 'Picpiant Hate*\nJU1LLIARD STRING QUARTET: From Monday, June 29, to Wednesday, July 8, the Juil-\nliard String Quartet will give a four-concert survey of contemporary chamber music at Wheeler\nAuditorium, University of California. The series will include all of the quartets by Bartok and\nworks by six other composers. The first two concerts-June 29 and July 1—will be broadcast\niwpr KPFA\nTHE WORLD AND THE WEST: Each year the BBC invites a speaker to broadcast a series\nof talks on a subject of the speaker’s choice. In 1952 the invitation to deliver the Reith Lectures\n- named after the BBC’s first director-general - was extended to Arnold Toynbee. He chose as\nhis subject The World and the West. The first four of the six talks are scheduled in this Folio\n- Tuesday and Friday nights; Saturday and Sunday mornings.\nSOME CHANGES: It might be worth noting that the day of broadcast for a few programs has\nbeen changed. If a particular favorite does not appear at its previous time, look carefully.\nVoices of Europe has moved to Fridays; Books to Thursdays; The Organ to Tuesdays; and\nYoung Artists Recital (although none are scheduled in this Folio) will move to Mondays.\nGALLERY NOTES: The present exhibition of paintings on display at the KPFA studios is\ndie work of the young painter, Guiomar de Angulo. This present, non-objective phase in Miss\nde Angulo’s work was begun in 1952. Prior to this she had exhibited paintings and drawings\nat the Raymond and Raymond gallery in San Francisco and at the Gallerie Lucien Gout in\nMontpellier, France. In a letter to KPFA, Guiomar de Angulo had the following comment to\nmake about her painting: “I like the drip and drool school, but I don’t feel myself a member\nof the West Coast Group, really, any more than the New York non-objective painters. I don’t\nknow very many painters anyway.” Somehow, we feel a certain kinship with Guiomar de\nAngulo’s individuality."
}