{
  "id": "d729-32",
  "text": "TO THE EXECUTIVE MEMBERS ABB COMMITTEE OF DIRECTORS OF PACIFICA FOUNDATION\nDuring the past three weeks there have been extraordinary irregularities in\nPacifica Foundation which place the KPFA project in extreme danger. At the\ncenter of this situation is part of the KPFA staff and Executive Membership\ninvolved in any effort to obtain control of the project. Throughout that ef¬\nfort there have been various illegal corporate acts and public mier©presentation¬\nal agencies heretofore cooperating with it, and aiaong increasing numbers of\nKPFA*8 audience. The same group, in physical possession of XPFA, has grimly\nrejected every effort to bring about an informal exploratory discussion among\nthe persons concerned. I have been endeavoring to solve these problems, thus\nfar without success. My personal readiness to continue this endeavor and, if\npossible, repair the damage, is undiminished, but I cannot pretend that the\noutlook is hopeful. The problems and events in question are so coa|>lex and\nof such catastrophic meaning to the KPFA project that, in any case, I want to\nshare them in detail with all of the Membership.\nThese calamities began shortly after the announcement of my resignation\nfrom the Foundation, when a minority of the Members in an emotional state\nover three staff dismissals repudiated the Foundation*s qualified leadership.\nThe meeting of July 9 at which this action occurred was not a valid meeting\nof the Foundation. Three Executive Members had neither received notices of\nmeeting nor signed waivers of notice. At the time, however, most of the par¬\nticipants were apparently unaware of the irregularity and regarded the meet¬\ning's action as official Foundation policy. So regarding it, three members\nresigned in protest immediately, while others contemplated early resignation.\nLearning of these events and of the proposed installation of a leadership of\nseriously doubtful qualification, I returned to Berkeley at once, on «mly 11.\nIn the last two weeks of this period, with the help of several disinterested\npersons, I have tried to find a solution that would save the project without\ninjuring the many egos exposed in the conflict.\n‘Two major proposals for a solution have been offered. One has aimed at\ncuring the illegalities committed during the past three weeks, thus restoring\nthe Foundation's competence to deal with other agencies. The other proposal\noffered a basic reorganization of the Foundation's Membership. It is impor¬\ntant that the Executive Membership be fully aware of these proposals and\ntheir fate.\nThe first-mentioned arose from a consultation of disinterested attorneys\nand supporters of the station. It proposed returning to a status in the Foun¬\ndation prior to the beginning of the various dismissal actions, resignations,\nillegal meetings and proclamations — to a point, in other words, approximately\nthree weeks ago, before any disputed action occurred in any quarter. Under\nthese circumstances a legally constituted Executive Membership meeting would\nestablish the legal representation of the Foundation under the By-laws. This\napproach would of course require, among other things, that the entire Member¬\nship acknowledge the legal misunderstanding which led to three resignations,\nand accept the withdrawal of those resignations. The part of the membership\nseeking control of the station, represented by Wallace Hamilton, has refused\nto cooperate in carrying out this curing action. An examination and informal\npoll of the Membership roster reveals that these persons are a minority of the\nauthentic Membership of July 9» By exclusion of the three disputed Memberships,\nthis group appears to hold a majority of one."
}