{
  "id": "d729-34",
  "text": "- 3 -\nIt was now no longer represented that the actions of %. Hamilton's group\nhad been legal, but rather that the persons Mr. Hamilton spoke for would under\nno circumstances be associated with me, regardless of the consequences. It\nwas stated that the two proposals and the various efforts to meet described\nabove had been rejected by Mr. Hamilton's group because each of these proposals\nand suggestions implied an association with me, which each person in that group\nabhorred, The primary aim repeatedly expressed by Mr. Hamilton was to make\ncertain that X have no further connection with KPFA, In response to Mr.\nPrael's query whether, in that case, Mr. Hamilton's group seeks no solution\nwhatever to the present disastrous state of the .oundation, a vague reply came\nfrom Mr. Schwarzer of which I can only give iqy impression, since it never be¬\ncame explicit. It was envisioned by Mr. Schwarzer that I might have a \"policy\nrole\" in Pacifica provided, first, that I was not an officer of the /oundation,\nand, second, that I had no connection with the management of XPFA. When fur¬\nther inquiry failed to bring out what was meant here by \"policy role\", I stated\nthat my understanding of the sense of the suggestion was as follows: that 1\nwould continue to represent the Foundation outside, mainly in fund-raising,\nand inside would have no association with the Foundation, or in any case no\nauthority inside remotely commensurate with my responsibility outside. I said\nthat if this was the meaning intended, I felt it was plain that no one with any'\nconception of executive responsibility would allow himself to be placed in such\na position in any organization; and also that the urgent need in Pacifica was\nfor unambiguous and effective administrative authority, while this notion\nspelled administrative choas. Mr. Hamilton and Mr. Schwarzer offered no com¬\nment. The conversation led further only to one additional justification b,\nMr. Hamilton, namely, that he and his group have actually been wholly respon¬\nsible for KPPA's operation for at least a year, while I have had nothing what¬\never to do with it, and Richard Moore very little. On this ground Mr. Hamilton\nclaimed that his group's control of the Foundation merely made a long-existing\nsituation official. These assertions are so absurd on their fact that I will\nnot deal with them.\nSince the conversation with Mr. Hamilton and his attorney, X have re¬\nceived (Cln July 23) a notice stating that the Committee of Directors has dis¬\nmissed me from the position of executive Director of XPFA, and a further no¬\ntice of a directors meeting called on July 29 for the purpose of dismissing\nme from the office of Chairman, and /leaner Moore from the office of Secretary.\nIf there has previously been any ambiguity in the purposes and intentions of\nMr. Hamilton's group, these latest actions have removed it.\nTo this summary account one thing should be added. I have been informed\nthat at the illegal meeting of July 9 which began this history a threat was\nmade, that a number of the .KP?A staff would desert the operation at once if\nEichard Moore’s proposal for a reduction of staff were adopted. In the con¬\nversation des^rib^d immediately above, Mr. Hamilton repeated this threat i«\nanother form, to wit, that the staff members he represented would desert the\noperation at once if I had any further connection with it. The point was\nheavily stressed and was taken up by Mr. Schwarzer in an argument that the\n\"continuity\" of KPFA’s operation would be destroyed by the desertion of these\npeople, and that the primary urgency before Pacifica was therefore to retain\nthese people on KPFA'a staff. % extension this argument implied that the\ncorporate behavior of Mr. Hamilton's group was valid because the people were\nindispensable. It appears likely that this same threat and argument will be\nwidely used as a justification, and I want therefore to clarify the facts of\nthe matter."
}