{
  "id": "d729-35",
  "text": "Any half-dozen or so of KFFA's staff members by withdrawing from the\noperation could impose a serious inconvenience on the station, of a degree\nwhich the station has had to overcome in the past. From long personal assoc¬\niation with most of the staff members I must say that I think it is doubtful\nwhether all of Mr. Hamilton's group in the final test would desert KPFA. But\nassuming the opposite, and imagining this inconvenience confronted the station,\nit is important to understand that the operation and continuity of £FFA do not\ndepend on this factor, while they are very greatly dependent on the project's\ninstitutional integrity. There are other highly qualified persons in both\nthe technical and the program fields, thoroughly familiar with KPFA's concepts\nand purposes in broadcasting, who are available for the staff if need should\narise. KFFA has so developed that many able people are available to it to\ncarry on its well-established daily operation. I make this point not to dero¬\ngate the fine work of many KPFA staff members, nor to suggest that their with¬\ndrawal is in any way desirable, but only to place the question in its proper\nperspective.\nThe tragic fact brought to light during these two weeks is a total un¬\nconsciousness in wr. Hamilton's group of the objective interests of the KPFA\nproject outside a narrow circle of personal motivation and in-group satisfac¬\ntion. The irresponsible corporate behavior of the group seeks justification in\npersonal motives; there seems to be genuine unawareness that such behavior has\ndrastically injured the project's corporate integrity in those many places\nwhere there is no interest in the personal lives, arguments or justifications\nof KPFA personnel. Every additional day of this ludicrous display of irrespon¬\nsibility adds to the destruction. X look with inexpressible sadness on the\nviolence done to a structure and tradition which it took seven hard years to\nbuild.\nI said at the outset that my willingness and desire to withdraw my resig¬\nnation and help find a constructive solution to this crisis remain firm. I\nwish that to be clear to the entire Membership. In the meantime, the unwilling¬\nness of Mr. Hamilton's group to join in search of a solution imposes a paralysis\non the Foundation in its external relations. I am myself in the position of\nholding official responsibility for the Foundation's actions, as its chief of-\nfieer, while in defiance of every instruction, proposal or entreaty Mr. Hamil¬\nton's group continue to perpetrate corporate acts which I cannot control ex¬\ncept by a totally destructive resort to the courts. This humiliation of\nPacifica Foundation is only protracted by my unavailing efforts to relieve it,\nand by the fact that 1 stand as a legal barrier between the actions of Mr.\nHamilton's group and an understanding of their consequences. X am therefore\nwith this communication entering my resignation from the Chairmanship of\nPacifica Foundation, and from its Committee of Directors, effective immediately.\nI am not, however, resigning from the Executive Membership of the Foundation,\nfor I wish to be available if in the near future Mr. Hamilton's group recon¬\nsiders and views the situation of the Foundation more objectively.\nJuly 24, 1953\nLewis Hill"
}