{
  "id": "d729-38",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF EXECUTIVE DIRECTOR\nUNIVERSITY OF ILLINOIS\n119 GREGORY HALL\nURBANA, ILLINOIS\nJuly 2B, 1953\nMr. Wallace Hamilton\nStation KPFA\nThe Pacifica Foundation\n2207 Shattuck Avenue\nBerkeley 4, California\nDear Mr, Hamilton;\nI would like to express my thanks for the courtesies extended me\nwhile I was in Berkeley looking over your installation and listening\nto the programs offered KAEB. In a subsequent conversation with\nMr, Griffiths, it appears that the feeling I had with regard to the\nMSB grant might not have been entirely clear, I was there only\nto look over your organisation and to listen to programs, I donft\nbelieve that the KAEB grant was made on the basis of any personalities\nand consequently if legal entities are recognised in a transfer,\nI see no reason why KAEB’a position should be any different from\nthe on© it took when the check was originally sent.\nOn the other hand, in view of the care with which KAEB insisted on\ngetting statements of the ownership and officials of KPFA and the\nway in which the organization was set up in order to insure some\nstability, 1 hope you agree that KAEB could not now deliver the\nfunds merely on the basis of an oral statement that new leadership\nis intending to proceed with the sort of delivery schedule that\nwas originally committed to. Therefore, I suggest that when\nwritten and documented evidence of the stability of KPFA is avail¬\nable again, inasmuch as the only correspondence we have ever had\nis from Mr. Moore and Mr. Hill, this new documentation be sent to\nKAEB,\nI’m sure that KAEB has had no intention of entering into any internal\nproblems at KPFA and if the programs as presented can be delivered\nas promised, there should be no difficulty with continuing as\noriginally agreed in the contract originally sent. It was In the\ninvestigation of whether or not an organization, newly constituted\nactually did legally exist that I felt that I should leave the matter\nto the FAE group and Mr, Frost, who I understood was looking at it."
}