{
  "id": "d729-90",
  "text": "Page 2\nMJSIO (float.)\nA program series, to be recorded in the KPFA studios,\nfeaturing performances of contemporary music by student performers of out-\nstoding ability - The Series will place particular emphasis upon premier\nperformances of contemporary music and will serve both as an outlet and an\nincentive for new work, particularly for younger composers. In most in¬\nstances the performer will have had the opportunity to study the score with\nthe composer. It Is expected that this series will number five or six half-\nhour programs.\nJlfflNO l One program only, approximately one hour in length, with\nmro Ajemlan, internationally knows, pianist, explaining and demonstrating\nJohn Gage’s music for the prepared piano. The program will include the\n®*®P ty step preparation of the instrument and the performance of works\nfor the prepared piano.\nA series of twelve twenty-^dnut© programs on American Folk Songs and\nTrS!' P5™3?09* ** cooperation with the folk song collectors Sam m±n\nand Sidney Robertson Cowell. The series will include new field recordings\nof many of the singers from whom modem scholars have derived the majority\nor the songs included in their collections. The personal collections,\nrecorded in the field on portable, high fidelity tape equipment, of sLa\nBsldn and Sidney Cowell are probably the most extensive folk song collections\n3jitrar7 of Congress Archive of American Folk Song\nAuthoritative commantaiy on the songs and ballads included in the program\nseries will be supplied by Mr. Eskin and Krs. Gcwell* This will he the\nnrst attempt, based cm field recordings, at a truly definitive series on\nAmerican folk songs.\nPPBIJC AFFAIRS\nMM2& A documentary series concerning the development of African\nmovements in various parts of the continent. Program material already\nassembled includes interviews with key persons in relation to the resistanoe\n«Mpl«ted S9flo° ^olud3aS mU3io» supplementary narration\nand editing will amount to six half-hour programs. The following is a list\nof participants in the eeriest\nAfrica\n°* ^ffltessador from South Africa to the United States and\nCSiief U. H. delegate flrom South Africa.\nffi(*ael Scott, International league for the Sights of Mm and a\nparticipant in South African Resistance movement.\nGeorge Houser, Executive Secretary, Americans for South African\nResistance.\nCentral Afylpa\nKirdao Japhet, spokesman before the United Hattons Trusteeship\nCouncil, Wa—Hem tribe, Tanganyika."
}