{
  "id": "d729-92",
  "text": "Page 4\nI2EWJSSJM8 A series of ten half-hour programs presenting readings from the\nnew- work of both well known and lesser known American writers. Emohasis\nin the series will be upon good program production, and the author5 s own\niroice will be used only in those instances where he is an exceptionally\ngood reader of his own work. Among the writers contributing to this series\nare the following*\nRobert Duncan\nWilliam Everson\nRobert Horan\nWeldon Sees\nJosephine Miles\nHenry Miller\nRosalie Moore\nKenneth Patchen\nKenneth Rexnoth\nFired Safier\nMgM^MRSE DRAM; A studio production of verse plays by the American poet,\nKsmaotb Rerroth. There are three plays In all—Phaedra. Inhigenla in AhUb.\nan^ Beyond the Mountains. The series will number tfe’ea programs of approx¬\nimately forty-five minutes each.\nCHIIPKEK'S PBOGMMS\nA.yBf|: A story series for children from six to sixty. A selection\nof twelve Irish folk and fairy tales as told from memory by Josephine\nGardner, easily the most outstanding traditional story teller living in\nthis country. Programs in the series vary in length from twelve to^twenty\nminutes each. Story titles include? The Wee Red Mm. The Twelra\nIhg-Hing of Ireland*a Son* Feather, of W\"Wirgf and others.\nKIDNAPPED ^ A dramatized reading in twenty or more episodes of the novel by\nRobert Louis Stevenson. Single episodes will vary between thirty and\nforty-five minutes in length. The production team headed by Charles Levy\nhas gained Valuable experience in its productions of HnaklftWty Firm\nand Robin Hood, and it is expected that the production of\nM-dnapped will mark an improvement over these previously successful pro¬\nductions.\nROBINSON CKUSOE* A dramatized reading in approximately twelve half-hour epi¬\nsodes by Charles Levy, similar in production technique, including sound\neffects, to the production of Treasure Island, which was included in the\nWinter 1952 offering of the NAEB Tape Network.\nPICTURE STORY* A program employing dramatized reading of stories selected for\ntheir particular suitability in evoking picture ideas. This program format\nhas proved uniquely successful in KPFAsa broadcasts for children. The pro¬\ngram is designed specifically for primary school children. The readings are\nbroadcast and the children send in pictures illustrating the story. On sub¬\nsequent programs the station announcer acknowledges receipt of the pictures.\nThirteen fifteen minute programs."
}