{
  "id": "d1009-136",
  "text": "30\nAdvertising: Primary advertising — what Professor Merton calls segregated\nadvertising — increased from 1952 to 1953 both in terms of number of advertise¬\nments and in total time devoted to them. There were 3,771 primary advertisements\nin the 1953 week, an increase of 21 per cent over the 3,104 in 1952. And there\nwere 235,404 seconds devoted to primary advertising, an increase of 27 per cent\nover the 185,482 seconds in the 1952 week.\nThe time devoted to primary advertising in 1953 was 10.0 per cent of total\ntime on the air, as compared with 8.2 per cent in 1952 and 10.0 per cent in 1951*\nReliability checks on previous studies indicate that monitors have missed between\n5 and 10 per cent of the actual amount of primary advertising.\nData on secondary advertising for the 1953 week have not been completely\nanalyzed as yet.\nTelevision sets for use in observing programs were generously provided by\nthe Zenith Corporation, while the New Yorker Hotel, through special arrangements\nfor rooms, and the Western Union Telegraph Company, which installed electric\nclocks, were extremely helpful.\nDuring the study week in 1953 a total of 56 monitors were used, divided\ninto two groups. One group, drawn from graduate students in communications, psy¬\nchology and sociology from Columbia University and New York University, followed\nprocedures similar to those used in the preceding studies. The other group, con¬\nsisting of 20 graduate students in Theatre Arts from Columbia University and\nQueens College were engaged in a special analysis of the methods of character\nportrayal in drama programs produced for television. Two days of intensive\ntraining were given all monitors.\nWIPR ANNOUNCES MUSIC COMPOSITION CONTEST\nWIPR, Department of Education of Puerto Rico, has announced a contest in\nmusical composition in which three prizes will be awarded. Prizes are: $1,000\nfor a chamber music work for three or more instruments, $700 for a sonata for\none or two instruments, and $300 for an art song cycle. Participants must be\nnative born of Puerto Rico or in residence for the past five years. The contest\nentry deadline is March 31*\nNEW M.A. IN RADIO AND TELEVISION AT STANFORD\nThe Speech and Drama Department of Stanford offers a new program in radio\nand television leading to the Master of Arts degree. The general requirements\nfor the degree are similar to those for the other M.A. programs in the depart¬\nment. As a part of the program, each graduate student admitted will spend one\nsummer in the Stanford Radio-Television Institute, where he will get intensive\nwork in the areas of radio and television. Part of this work is taught in the\nradio studios of KNBC and in the television studios of KPIX in San Francisco.\nWhen the student has completed the academic requirements for the degree, he\nwill spend a final quarter as an interne in a radio or television station. He\nwill do this work without academic credit and without pay, but he will get prac¬\ntical experience in the industry by moving from department to department in a\ncooperating station.\nORDER NOW\nCHICAGO SUMMER TELEVISION\n$1.00 TO NAEB MEMBERS"
}