{
  "id": "d1009-156",
  "text": "BIBLIOGRAPHY FOR THE QUARTER 421\nIn Three Years of New York Television (Monitoring Study\nNumber 6, National Association of Educational Broadcasters,\nGregory Hall, Urbana, Illinois, 1953, no price quoted), Dallas\nSmythe reports the results of monitoring for the third successive\nyear all the TV programs broadcast in New York City for one\nweek. Previous monitoring studies reported results from Chicago\nand Los Angeles, but the present monograph is confined to the\nresults from the 1953 New York study as compared with the 1951\nand 1952 studies in the same city. As the author notes in the\npreface:\nWhile three years is scant time for trends to appear, television pro¬\ngramming has changed so rapidly in style and content that at least\nthe beginnings of significant trends are discernible within the span of\ntime covered by these reports.\nThe making of comparisons is possible since the studies were\nconducted in the same calendar week and since the concepts,\ndefinitions of categories, and training and recruitment of moni¬\ntors were the same for all three New York studies. The only\nadditional data obtained in the 1953 study were concerned with\nwhat Mr. Smythe calls “stereotyping.” Under this category he\nhas attempted to monitor the types of character portrayals in the\nTV-drama programs. It is possible here to present only a few of\nthe more important results of these comparisons:\n1. Entertainment-type programs continued to dominate TV fare,\nrising in 1953 to 78 per cent of all time. The drama category repre¬\nsented the sharpest increase—47 per cent of all TV time was devoted\nto this type in 1953 as compared with 33 per cent in 1951 and 42 per\ncent in 1952. Crime was the subclass of drama which stood first in\n*953-\n2. In 1953, there were twelve programs identified with recognized\neducational institutions as contrasted with thirteen in 1952 and one\nin 1951.\n3. The number of acts and threats of violence increased substan¬\ntially from 1952 to 1953. In 1953, there was an increase of 15 per cent\nwith 3,421 acts and threats of violence monitored. The “saturation\nrate” rose from 6.8 per hour in 1952 to 7.1 in 1953."
}