{
  "id": "d1009-158",
  "text": "BIBLIOGRAPHY FOR THE QUARTER 423\ndominantly white American. The villians, on the other hand, are\ntypically not American and are in the labor force, especially in\nsuch capacities as managers, officials, and proprietors. Among\nthe professional groups depicted, journalists are shown as closest\nto community ideals in character attributes; and scientists, as\nmost distant. The prevailing ambivalence of American culture\ntoward teachers (including professors) is shown as this group is\ntypically portrayed as the weakest, softest, slowest, cleanest (!),\nkindest, and fairest of the professional groups. Scientists are the\nleast kind, least honest, and most unfair.\nThese studies continue to furnish the most reliable picture of\nwhat appears on the TV screens in the United States. No discus¬\nsion of TV as a social force—its future prospects or its educational\npotential—is complete if it fails to take these studies into account.\nAlthough the present study is in many ways the most interesting\nand significant one to date, this reviewer is not altogether happy\nwith Mr. Smythe’s venture into the characterology of the TV\nworld. The use of the term “stereotyping” is unfortunate since\nit implies more than the data, strictly speaking, show. As used in\nthis study it is synonymous with typical (in the statistical sense).\nFor most social psychologists (Mr. Smythe’s strictures regarding\ntheir vagueness in using the term scarcely seem warranted),\n“stereotyping” refers to characteristics presumably possessed by\nall members of a particular group (an ethnic group, for example)\nas these are perceived by members of the larger culture or sub¬\nculture. These perceptions, of course, may be wholly or partially\nat variance with the characteristics actually possessed by the\ngroup. Further, this usage implies that the “stereotyping” of a\ngroup occurs because it justifies certain kinds of behavior—\nusually unfriendly or hostile—toward the group stereotyped.\nGordon Allport states this in succinct form in his recent study\nof prejudice: “Whether favorable or unfavorable, a stereotype is\nan exaggerated belief associated with a category. Its function is to"
}