{
  "id": "d1009-162",
  "text": "BIBLIOGRAPHY FOR THE QUARTER 427\nprints remain; and, after considerable experimentation, methods\nhave been perfected for reconverting these paper prints to 16-mm.\nfilm. The importance of this material not only for the historian\nof motion pictures, but especially for the social historian, cannot\nbe overestimated. Completion of the reconversion project will\nrequire funds from outside sources. The Academy of Motion\nPicture Arts and Sciences is cooperating in this venture. Requests\nfor information regarding the reconverted films should be ad¬\ndressed to the Chief of the Stack and Reader Division, Library of\nCongress, Washington 25, D.C.\n■o o o\nMass Media and Education (Fifty-Third Yearbook of the Na¬\ntional Society for the Study of Education, Part II, 5835 Kimbark\nAve., Chicago 37, Illinois, no price quoted) is a 300-page mono¬\ngraph prepared by a special committee of educators consisting\nof Edgar Dale (chairman), Wilbur Schramm, I. Keith Tyler, and\nPaul A. Witty. The eleven contributors to this volume are not\nconcerned with educational films, radio, or TV as such, but with\nthe mass media of communication as influences arising in the\nout-of-school life of the child or youth and in the normal experi¬\nences of the adult. Professor Dale states the purposes specifically:\n1. To give background on ownership, control, regulation, and pur¬\nposes of mass media so as to be able to appraise their place in modern\nAmerican society.\n2. To examine the content and influence of communication by mass\nmedia in so far as these are relevant to the educational activities of\nteachers, parents, and public-opinion leaders.\n3. To theorize on broad philosophical and educational grounds about\nthe influence of the mass media and to present specific research data\non such influence.\n4. To offer suggestions to parents and teachers on how to use the mass\nmedia fruitfully.\n5. To discuss the obligations of the citizen in relation to the mass\nmedia."
}