{
  "id": "d1009-2",
  "text": "- 2 -\nweek in 1952 than in 1951. In the 1952 week a total of 627 hours, 25 minutes was\nclocked*\nProgramming By Class of Program:\nAll Drama programs in 1951 were 33.2 percent of total program time. In\n1952 the comparable figure had risen to 42.4 percent.\nDrama programs for the general audience in 1951 were 25*4 percent of total\n1952, 35-7\ntime; in percent.\nDrama programs for the child audience in 1951 were 7.8 percent; in 1952,\n6.7 percent. The classification of children's programs does not include\nall programs available to children. In order to qualify as a children's\nprogram, a program has to be manifestly intended for the child audience\n(by specific program content or advertising content, or by format).\nThe largest sub-class of Drama, Crime Drama, totaled in 1951 10.0 percent\nof total program time; in 1952 it was 14.8 percent. In 1952 Crime Drama\n(general) was 14*6 percent, Crime Drama (children) was 0.2 percent#\nThe second largest sub-class of Drama programs, Western, totalled 7,8\npercent in 1951, and 8.3 percent in 1952. In the present study, Western\nDrama (general) was 4.2 percent, and Western Drama (children) was 4.1\npercent.\nOf the general classes, Variety programs were quantitatively second to\nDrama. The total of Variety programs in 1951 was 18.4 percent. This year the\ncomparable total was 10.9 percent.\nThe Variety (general) class in 1951 was 13*6 percent; in 1952, it\nwas 6.2 percent.\nChildren Variety in 1951 totalled 2,1 percent; in 1952 it amounted\nto 2,4 percent.\nDomestic Variety in 1951 totalled 2,7 percent; in 1952 it was 2.3 percent.\nThe Drama and Variety programs together accounted for 51,6 percent of all\nprogram time in 1251; in 1952 these types of programs aggregated 53,3 percent.\nChildren's programs in 1951 were 12,5 percent of total program time; in\n1952 the comparable figure was 11,0 percent#\nDomestic programs in 1951 were 10,2 percent; in 1952 they totalled 10.8\npercent.\nSports programs were 10.1 percent of total program time in 1951; in 1952,\nthey were 8.4 percent.\nThe group of program classes characterized by their relation to informa¬\ntion amounted in total to 12.5 percent in 1951, and to 13.4 percent in 1952,\nThis group includes\nInformation (total) 1951 * 4,3 percent\n1952 s 3,8 \""
}