{
  "id": "d1009-35",
  "text": "^r. Graydon Ausmus,\nBox 2002,\nUniversity, Alabama.\nDear Graydon:\nMICHIGAN STATE CO\nEAST LANSING\nThanks for your letter of November 7 giving confirmation of\nthe grant from F.A.E. for the New York TV study, I am now\ngetting out letters and a proposal to six agencies which\nmight be interested in conducting the study. This is in line\nwith our plan as discussed with you in Norman. Copies of\na letter and the proposal are enclosed for your information.\nI have discussed this proposal with our Social Research\nService here. I doubt whether our group will be able to do\nthe study because they are too busy with other projects at\nthe moment. But I did get some suggestions which I have\ntried to incorporate in the letter. A letter this morning\nfrom Ken Harwood strongly suggests that Remmers do the work.\nI have writted to Dallas Smythe, on last Monday, asking him\nwhether he is interested.\nAs you will note we have started negotiations and I hope that\nwe will have some replies back by next week. I will keep in\nclose touch with you and with Headquarters on this. The final\ndecision as to wh does the job will be yours or the executive\nCommittee, I will only furnish the contact information.\nAs to additions to the Research Committee, I believe that we\nhave a good committee and, at the moment, do not have any\nsuggestion for additions. I do know that Ken Wright at\nTenneessee is not on any committee and would be willing to\nwork on one. Whether he has research qualifications or not\nI do not know.\nI would like to request that expense be allowed for travel\nand maintenance for a two day meeting of the Research Committee\nto enable us to lay out the plan for a long range research\nprogram and to take care of our work. Unless this is possible\nI do not see any action of concrete nature before the Columbus\nmeeting in April. If we could meet now I feel that we could\nactivate a program and not lose these valuable winter months.\nIt is impossible to make a long time plan toy mail I am sure.\nWill you give this some consideration. Perhaps the most"
}