{
  "id": "d1009-60",
  "text": "J*jr U, 1954\nDp# H# H. Brawn\nPurdus Opinion Poll\nFurdus University\nLafayette, Indiana\nDoor Dr# Bejsasrst\nSohooley, Rill and I are of the opinion, sine* funds ware gotten for\nthii monitor study to study tbs h***^*^ of pwiWio ^ ff that\nChapter VI will hardly suffice or enable us to keep our promise# Us’d send\nthis chapter back, but assume you have a copy# Could you see what could be done\nto cake it look as adequate as possible, at least, since this is the raison\nd’etre of this entire study?\nAlso feel that us could not publish the introduction in its peasant\nfem because of reflections on laethodology used in our earlier studies#\n#U vere tUSB onus, ragardOew of teo old thorn, I fool teat rotarenoo to earlier\n<»i yyyi ff methods fflff ''lengthy unwieldy1* or ff^yw’y^ts ss are listed\non pege 2 under paragraph 2 should be redone to eqphaaise the positive, saying\nwhat changes wars aids whan necessary, but net necessarily being quite so\ncondemnatory of tsohniques used on earlisr ones. The remarks you asks are prbb»\nably valid, and would be good in an article for research aen, X feel# But I\ndoubt if It's so good here# l&at is your reaction to thla suggestion?\nI & think s report to us for fils might make these and other observa¬\ntions, but I do feel that what the HASS publishes should show as such respect as\npossible on tbs pert of one survey supervisor for earlier ones, otherwise we are\nlikely to be paying to publish criticisms of our own earlier products# This\neight well someday he dons, but I doubt if this is the tiae.\nGraphs and other data look fine# Sorry ay remarks have had to be based\non only a few minutes' perusal# Lets of projects popping around hers just now#\nWould be grateful to hear t*m you on this (and Harold's card of yesterday) ae\nsoon as poseibls#\nWith these few changes (sod possibly others which say later be uncovered\nwhen we're able to really read it dear through) this should be a fine study#\nSincerely,\nHJSiwe\neet Sohooley, Hill,\nBariy «T# Skomia\nExecutive Director"
}