{
  "id": "d1009-62",
  "text": "Jfcy 11, 1954\n&r. H. E. assuror*\nPurdue Opinion Poll\nPurdue University\nLafayette, Indiana\nSear Dr. Reamers«\nSchooley, B1U and I are of the opinion, since funds were gotten far\nthis Monitor study specifically to study the handling of public issues on TV that\nChapter VI will hardly suffice or enable us to keep our prcoise. We'd send\nthis chapter book, but assume you have a copy. Could you sae whet could ha dona\nto aako It look aa adequate aa poaalbla, at least, sines this is the raison\nd'etre of this entire study*\nAlso feel that us could net publish the introduction in its present\nfern because of reflections on nsthodology used in cur earlier studies. Sines\nall were H«a ones, regardless of *0 did then, I fasl that rsfarenos to earlier\nclassification esthode as \"lengthy and unwieldy* or such oesments aa are listed\non page 2 under paragraph 2 should be redone to eaphaalao the positive, saying\nwhat change1 were nede when necessary, but not necessarily being quits so\noendsanatory of techniques used on earlier once. The roaarka you sake are prob¬\nably valid, and would be good in an article for reaearoh non, I feel. But I\ndoubt if it's so good boro. What la your reaction to this suggestion?\nI §SL tblnk • report to us for file night nakn these and other observa¬\ntions, but I do fool that what the MSB publishes should show aa nosh respeot as\npossible on the pert of one surrey supervisor for earlier once, otherwise we ere\nlikely to bo paying to publish criticises of our own earlier products. This\nnight wall someday ha done, but I doubt if this is the tine.\nGraphs and other data look fine. Sorry ay renarks have had to be based\ncn only a few einutes' perusal. Lota of projects popping around hare Just now.\nMould bo grateful to hoar from you on this (and Harold's card of yesterday) as\naoon as poaalbla.\nWith these few changes (and possibly others which nay later be uncovered\nwhen we're able to really read it clear through) this should be a fine study.\nSlnoerely,\nBJSiwe\neat Sohooley, Bill, and\nHany i. Skcrnla\nExecutive 'director"
}