{
  "id": "d1009-73",
  "text": "- a -\nnetwork stations and the reduced schedules of some independents in the metropol¬\nitan area* Since network stations carry different types of programs than the\nindependents (e.g,, more nlive* programs and fewer old movies), changes Av\\ their\nbroadcasting activity will affect the overall composition of New York*s T/ material»\nSince 1952, the NAEB studies have included a tabulation of the amount of\nviolence found in TV programs during the study weeks, In 1954, 7065 acts or\nthreats of violence were counted at the rate of almost eleven acts or threats per\nhour. This quantity of violence is more than twice that noted in previous years.\nThe study directors warn that at least part of this increase may be due to changes\nin monitoring techniques, but at least some of this gain seems to be a result of\na trend toward the increased use of violence in TV,\nHuman agents were found to be responsible for 81 per cent of the violence„\nThe frequency of violence was found to be highest during the hours of 5 to 7 p.m.,\nwhen the child audience is largest, but a large part of this violence occured in\ncartoons and comedies, and frequently was in a sham or humorous context. Tension\nproducing devices — lighting effects, special music, startling sound or action,\nand the like — accompanied 21,4 per cent of the acts or threats of violence,\nwhile 31-6 per cent was in a humorous or sham context.\nThe proportion of broadcast time devoted to all forms of advertising was\nfound to be still at 1953”s level of 18 per cent, but the analysts found trends\namong the several kinds of advertising they have defined. Primary advertisements\n~~ the kind that interrupt the flow of program material — were found to have\nincreased from 10 per cent of total broadcasting time in 1953 to 13 per cent in\n1954. On the other hand, secondary advertising in the form of background plugs\nfor products has decreased from 8 per cent in 1953 to 5 per cent of total program\ntime in 1954- Advertising reached a maximum during the daytime hours when house¬\nwives predominate in the audience. Up to 16 per cent of program time in the\ndomestic hours was riven to primary advertising alone.\nThe average commercial during 1954 lasted 54 seconds, but commercials wer<<\nfound which lasted as little as a few seconds and as long as several minutes.\nActually, commercials within programs last considerably longer than the average\nfigure given above; but brief messages during station breaks tend to pull the\naverage down Considerable variation in length of average commercials was found\nfrom station to station„ Some of New York’s network stations use an average of\n42 seconds for commercials, while one independent averages two minutes for its\nsponsors11 messages\nNew York - s commercial stations devoted 1.8 per cent of their total broadcast\ntime to public issues programs during the study week. The discussants in half\nof these programs relied mostly upon rational argumentation or factual presentation;\ndiscussants on the remainder of the programs used ’’emotional” appeals in varying\ndegrees On 55.3 per cent of the public issues programs, only one viewpoint was\nrepresented, and seme selling of views was found in 53.6 per cent of the public\nissues discussions.\nNAEB Headquarters\n6/4/54mr"
}