{
  "id": "d1134-0",
  "text": "■\nN\nA\nE\n3\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL URBAN A, ILLINOIS\nPRIX ITALIA RULES ANNOUNCED\n—Seymour N. Siegel, Chairman\nNAEB International Relations Committee\nThis year, the NAEB will be represented on the Radio\nJury for Documentaries in the Prix Italia competition,\nand consequently the United States may submit two\nmusical compositions with words and two literary or\ndramatic works with or without music.\nIn addition, the Prix Italia will be administering\na special prize amounting to $1,000, in accordance with\nan offer made by UNESCO to commemorate the 10th\nAnniversary of the Declaration of Human Rights. We\nare, therefore, in a position to send an entry to the\ncompetition for the UNESCO Prize. This prize is to\nbe awarded to a literary or dramatic production, with\nor without music, which in the opinion of the jury\nbest exemplifies or illustrates man’s impelling desire\nfor freedom, mutual understanding and peace.\nIn addition to the above radio entries, we may also\nsubmit an entry of Television Documentaries.\nAll entries and respective literature must be sub¬\nmitted to Room 2500, Municipal Building, New York\n7, N. Y., no later than June 1, 1958. This will give\nthe NAEB International Relations Committee ap¬\nproximately a month to make the necessary transla¬\ntions, copies, etc., as well as to permit the American\nJuries to make their choices for the competition.\nIn the case of the radio entries, these must not\nhave been put on the air more than two years prior\nto the awarding of the prize. The entry submitted\nmust have been specially created for broadcast and\nmust be in a form best fitted to be presented through\nthe medium of radio.\nEntries submitted must have a minimum duration\nof 25 minutes and must not exceed 85 minutes. A\nwritten statement must accompany each entry, signed\nby the composer or writer, granting the rights to pro-\nNAEB Newsletter\nVol. XXIII, No. 3\nMarch, 1958\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14 Gregory\nHall, Urbana, III. $5 a year, edited by Hans J. Massaquoi.\nceed with the necessary translations and adaptations\nof the work. Two copies of a tape recording of the\nwork and two copies of the score and script must also\nbe submitted. The writer or composer must also agree\nto permit a broadcast by the member broadcasting or¬\nganizations of the Prix Italia at a price no greater\nthan that which would be paid had' the entry not\nwon a prize. The writer must also certify that he is\nthe sole owner of the rights of adaptation, reproduc¬\ntion and broadcasting, or must indicate the owner of\neither or all of these rights. In the latter case, there\nmust be a submission on the part of the copyright\nowner granting the rights abovementioned.\nInsofar as the Television Documentary is con¬\ncerned, the prize is to be awarded to a documentary\nproduced especially for television, inspired by facts\nand illustrating events of an artistic, literary, scienti¬\nfic or social character, or by a news item. The docu¬\nmentary may be submitted in the form of a film pro¬\nduction or as a telerecording. Entries of a publicity\ncharacter will be rejected, and all entries must have a\nminimum duration of 13 minutes, and must not ex¬\nceed 60 minutes.\nThe University of Florida, Gainesville, has petitioned\nthe FCC for permission to construct a new, non-com¬\nmercial educational TV station on channel 5.\n1"
}