{
  "id": "d1134-5",
  "text": "some 50 per cent “B,” 25 per cent “C” and 5 per cent\n“D.” Approximately 10 per cent failed. A “C” grade\nindicates “average” work.\nDr. Zulli compiled the marks on the basis of the\nstudents’ performance in home quizzes, term papers\nand a comprehensive final examination.\nThe NYU professor said his TV students dis¬\nplayed a maturity in their work often lacking in that\nof other undergraduates. However, he also observed\n“an understandable lack of practice” in taking col¬\nlege-level examinations among many of his video stu¬\ndents.\nPROPOSED EDUCATION BILL\nDIRECTS MEDIA RESEARCH\nTwo identical “national defense bills,” which include\nprovisions for extensive research and experimentation\nin new educational media, have been introduced in the\nU. S. Senate and House by Sen. Lister Hill (D-Ala.)\nand Rep. Carl Elliott (D-Ala.), respectively.\nThe newly proposed legislation directs the crea¬\ntion of an institute within the U. S. Office of Educa¬\ntion for research and experimentation to “develop\nand evaluate projects involving TV, radio, motion\npictures and other auditory and visual aids which may\nprove of value in state and local agencies and institu¬\ntions of higher education.” This program also pro¬\nvides for grants-in-aid to be made to public or non¬\nprofit private agencies for the above-mentioned type\nof research.\nA second program provided by the bills would re¬\nquire the commissioner of education to acquire motion\npictures, kinescopes, video tapes, film strips, slides,\nrecordings, magnetic tapes, radio and TV scripts, etc.\nfor adaptation, to be made available upon request to\nstate and local educational agencies.\nBoth programs would be financed by $5 million\nduring the first year and $10 million during the suc¬\nceeding four years.\nALABAMA RESUMES\nCREDIT TV COURSES\nThe University of Alabama has announced its inten¬\ntion to resume college credit TV instruction through\nthe University Broadcasting Services Extension Di¬\nvision over the Alabama ETV Network. Such courses\nhad been suspended on the network for the past year\nand a half. Also offered will be credit courses toward\na high school diploma.\nIn addition, the network will offer for the first\ntime courses in shorthand and typing for full business\nschool credit. Courses in these fields offered by the\nnetwork earlier did not lead to a certificate.\nThe certificate which is now available to partici¬\npants upon successful completion of the courses will\nbe issued by the Birmingham Board of Education, in¬\ndicating its holder’s qualification to seek employment\nas typist or stenographer.\nThe New York Times, in a recent issue, gives rec¬\nognition to Alabama’s tireless forging ahead in ETV\nwith a write-up titled “Industry’s Use of TV in Ala¬\nbama.” The short feature lists the various benefits\nto Alabama’s industry which have resulted from the\noperation of the state’s ETV network.\nWMCR-FM'S DIRECTOR DIES\nWord reaches us at press time of the death of Mr.\nWallace Garneau, director of WMCR at Western\nMichigan College of Education, Kalamazoo. With\nhim, the NAEB loses one of its staunchest sup¬\nporters and long-time members.\nPROFESSOR DENOUNCES\nCOMMERCIAL TV FARE\nBecause challenging and controversial themes are\navoided in most commercial TV programming, our\nviewing fare tends to be reduced' to “colorless, in¬\nnocuous pap,” according to Prof. Edgar E. Willis of\nthe University of Michigan Department of Speech.\nDeploring that “the advertiser’s sensitivity re¬\ngarding program content does not apply equally to\nthe commercials they condone,” Willis claims that\nthe requirement of equal time for opposing views and\nthe advertiser’s fear of controversy, “tend to diminish\nthe kind of attention to public issues that democracy\nneeds.”\nAs a remedy in the areas of news and editorial\nviews Willis suggests that networks should follow\nABC and Mutual which broadcast opinions by com¬\nmentators whose beliefs range from right to left.\nTo eliminate what he terms “the absurd and some¬\ntimes damaging restrictions” on programming, Willis\nproposes the adoption of British commercial TV prac¬\ntices. In England, he explained advertisers are re¬\nstricted to writing commercials. Programs are offered\nto them on a “take-it-or-leave-it” basis.\nCommenting on a third restraining influence on\nTV programming—audience reaction—Willis says:\n“A concern for the sensitivities of minorities is\nNEWSLETTER"
}