{
  "id": "d1134-5",
  "text": "ETRC SURVEY INDICATES\nSCIENTIFIC TREND IN ETV\nReflecting the increased concern over science educa¬\ntion everywhere since the development of Jupiter and\nSputnik, the country’s ETV stations have nearly\ndoubled production of programs in science and tech¬\nnology, according to a survey made by the ETRC.\nDuring a recent sample week, the 27 stations\nsurveyed broadcast a total of about 89 hours of\nprograms on scientific subjects, ranging from tele¬\ncourses in mathematics to discussions of nuclear\nenergy and to consideration of the International Geo¬\nphysical Year study. This compares with 47 hours\nfor a similar period during 1957.\nThe Center also found that the stations had\nincreased programming by about 100 hours this\nyear over last, which may be accounted for in part\nby the establishment of six new stations since the\nspring of 1958. Still, the survey indicated that a\nmajority of the stations are now broadcasting for\nlonger daily periods.\nAccording to the survey, the most outstanding\nchange in ETV programming this year is reflected\nin the large increase in programs designed to teach\ncourse material to classroom students; in-school pro¬\ngramming amounted to 18.8 per cent of total program\nhours as compared to 5.3 per cent last year. Seven¬\nteen stations, as compared to ten last year, offered\ntelecourses for credit.\nThe summer, 1958 issue of Wisconsin’s Magazine\nof History is devoted entirely to mass communica¬\ntions with outstanding communications experts con¬\ntributing their articles. Well worth your reading,\nit may be obtained for $1.25 from the Mass Communi¬\ncations History Center, State Historical Society of\nWisconsin, 816 State Street, Madison 6, Wis.\nIN-SCHOOL TV PROGRESSES:\nREPORTS FROM PA. AND S. C.\nAccording to the Philadelphia Evening Bulletin, the\nfirst year of that city’s public school system experi¬\nment of teaching-by-TV evidently achieved its ob¬\njective: proving that classroom groups four and five\ntimes standard 30-to-40 can be successfully taught by\ntelevision.\nA definite plus was reported’ in releasing teachers\nfor sorely-needed special instruction for slow and ad¬\nvanced pupils. In the nine schools participating, the\nequivalent of 12 extra full-time teachers was made\navailable for this special work as a direct result of\nthe televised lessons. In addition to the special work\nthey were freed to supervise, the average pupil\nload per regular class was reduced. As a result, six\nmore schools are to be added to the experiment this\nmonth.\nThe project, assisted by funds from the Fund for\nthe Advancement of Education, was supervised by\nMiss Martha A. Gable in co-operation with WHYY-\nTV, Philadelphia.\n—N A E B—\nThe South Carolina Experiment in Closed-Circuit\nEducational Television, starts on a two-year project\nthis month, with installation of equipment at Col¬\numbia’s Dreher High School.\nWith funds from an appropriation by the state’s\nGeneral Assembly, a television studio within the\nschool will provide courses in Plane Geometry and\nFrench to the 300 students who will take part in the\ninitial experiment.\nThe project is a direct result of the recommenda¬\ntions of a special legislative-governor’s committee\nunder the chairmanship of Sen. James P. Mozingo,\nIII. The program is under the direction of C. Dewey\nGentry, Jr., co-ordinator.\n—N A E B—\nNEWS OF MEMBERS\nGENERAL\nThe Broadcasters Club, with 250 members from radio\nand TV, recently opened its new headquarters at\n1737 ae Sales St., in Washington, D. C., according to\nthe July 21 Washington Post. NAEB’s legal counsel,\nLeonard Marks, is president and founder of the club.\n^ Foundation of a World Literacy Center was\nstarted last month in Memphis, Tenn. with the\nunanimous backing of 250 delegates to the World\nLiteracy Conference. Named as chairman of a board\nof 100 trustees for the center was Dr. Frank C. Lau-\nbach, who inspired the institution.\nDr. Laubach was also instrumental in suggesting\na plan to combat illiteracy which has been used ex¬\ntensively by station WKNO-TV in Memphis. The\nstation was cited at the conference for demonstra¬\nting “that television is a potent weapon to combat\nilliteracy.”\n^ Educational TV received another gift from com¬\nmercial TV last month when WBRC-TV presented\nthe Alabama ETV Commission with technical produc¬\ntion equipment valued at $2,000. The commercial\nstation donated a rear screen motion picture projector\nand studio backdrop screen. Earlier this year, WABT\npresented the ETV network a 16mm motion picture\n6\nNEWSLETTER"
}