{
  "id": "d1134-7",
  "text": "bama and North Carolina.\n—N A E B—\nIn another action adopted July 30, the FCC pro¬\nposed rule making in Docket No. 12567 to permit\ntelevision translator stations to operate with a maxi¬\nmum power of 100 watts whereas the present maxi¬\nmum power output of these translators is 10 watts.\nAround 125 translators are now in operation,\nhaving been authorized by the Commission in May\n1956. At that time, power output was limited to 10\nwatts until data upon actual operation could be\nobtained. In the two years which have elapsed since\nthis authorization, the FCC has received no reports\nof interference between translators or other services.\nSince numerous requests have been received to in¬\ncrease power output, the Commission believes that\nconsideration should be given to permit this increase\nsince the additional power will improve the service\nnow being provided as well as bringing service to\nnew areas where there is little or no TV reception.\nTranslators retransmit the signals of another tele¬\nvision broadcasting station or another translator by\ndirect frequency conversion to the top 14 channels\n(70 to 83) of the UHF television band.\n—N A E B—\nA note from Hartford Gunn of WGBH, Boston,\nstates that their Ampex Videotape Recorder is now\ninstalled and in operation. He reports that their\nbiggest problem to date is how to keep down traffic\non the machine.\n—N A E B—\nWILL-TV is looking for a used GPL image orthi-\ncon camera chain as well as an iconoscope film chain.\nThey have some large screen RCA television projec¬\ntion equipment to trade for the above. If you are\ninterested in making a swap, contact Rob R. Beldon,\nchief engineer, WILL-AM-FM-TV, University of\nIllinois, Urbana, Ill.\n—N A E B—\nIn answer to the rising need for standardization\nof video tape recording practices in the television\nindustries, Mr. Axel G. Jensen, Bell Telephone Labs,\nEngineering Vice-President of the Society of Motion\nPicture and Television Engineers has announced the\nformation of a Video Tape Recording Engineering\nCommittee, by the Society.\nThe official scope of the committee, which will be\nchaired by Mr. Howard A. Chinn, CBS Television,\nwill be “To propose standards and good engineering\npractices for the construction, operation and measure¬\nment of video tape recording and reproducing equip¬\nment and for those video tape or other characteristics\nwhich affect performance and interchangeability.”\nInitially, the committee plans to consider stand¬\nardization in the following areas: tape (dimensions\nand identification), tape reels (hub and flange), tape\ntracks (locations, video-, audio-, control-, and cue-\ntracks) , recorded signal electrical characteristics\n(video, audio, control and cue), tape leaders, methods\nof measurement, terminology and tape splicing.\nThe committee will be composed of engineers\nexperienced in the areas of tape manufacturing, equip¬\nment manufacturing and broadcasting. It will also\nhave liaison with other organizations in the television\nand related fields. The committee has already\nstarted preliminary investigation into all the areas\ntentatively established within the scope of its\nactivities.\nPLAN AHEad\nFOR NAEB CONVENTION\nOCTOBER 14-17, 1958\nOMAHA, NEBRASKA\nNEWSLETTER"
}