{
  "id": "d643-10",
  "text": "February 22, 1957\nDr. Burton Paulu\nK U 0 K, One Eddy Hall\nUniversity of Minnesota\nMinneapolis, Minnesota\nDear Burton:\nI have read and re-read recent letters from Miles (2), the\none transmitting from Paulu, and the Coleman comments. I now\ncomment for whatever my views are worth.\nIt seems to me I can best help, if any, by stating some\nphilosophy (not intended to be high-toned) on NaER and the future.\nPersonally, I find the Miles* Committee considerations helpful,\nalthough I may disagree in my details.\nTo me, NSB should keep on building slowly, if so doing means\nthat it is also and always in a safe position regarding the future.\nI don’t think we should so expand ourselves that we fall of our\nown weight if some rugs are pulled or yanked from under us.\nTherefore, I believe the NAEB Hadio Network should carry Its\nown operations, and stations should pay what is needed to keep up\nservices.\nAlso, I believe NAEB organizational-operational activities\n(primarily headquarters) should also pay for themselves. This\nprospect Isn’t so likely within forseeable future.\nI believe we can increase income from building on professional\nbasis and on building up category of individual memberships I\nbelieve this will come slowly. It should be done on solid basis.\nI don’t believe it should be done on a basis that could or would\nalienate the old-typers of Institutional memberships. My own\nopinion, however, is that if we build solidly the old interests\nwill not die, or be harmed, that actually we will gain more support\nfor them, and the old-time, long-range interests of NAEB stations\nwill be sustained.\nOn some particulars suggested one place or another:\n— I think that 13.25 from each individual member and from\neach subscription should be allocated to Journal. It must get\nbetter, not worse. We are getting by this year because of special\ncircumstances. If we make money at 43.25, I see no harm. I don’t\nthink we should count on less."
}