{
  "id": "d643-108",
  "text": "-2-\nself-appraisal of the organization as it exists\ntoday. After taking into account earlier discussions»\nthe Allerton Station Managers Seminar, and the\nTelevision Operations and Development Committee\nreport, consensus was that NAEB is wanting in at\nleast six major areas:\n*•(1) relations and responsibilities, etc., to\ntelevision members;\n\"(2) relations, responsibilities, etc., to\neducators;\n\"(3) FCC representation;\n\" (4) Headquarters* problems;\nw(5) status and roll — professional membership/\ntrade organization;\n\"(6) general public relations.\n\"Consensus was that a critical self-appraisal\nis urgently needed, that we must take a detailed\nlook at the entire operation, that we must establish\nour purposes, define our objectives and our\ndirections.\n\"Bronson moved that recognizing the above\nproblems facing NAEB, the Board empower its officers\nto set up, as soon as feasible, a meeting of the\nentire Board of Directors and major committee\nchairmen for a detailed work session in which\nsystematic study be given to the restructure of the\nAssociation in order to try to arrive at possible\nsolutions. Vogl seconded and unanimous approval\ngiven. It was the consensus of the Board that a\nlong weekend in early December should be considered.\nConsensus further that such a meeting can be of\ntremendous benefit to NAEB, its future and the\nfuture of educational broadcasting. The Board\npointed out, however, that such a meeting can only\nbe a success if all necessary participants devote\ntheir total energies and be in complete attendance.”\n* # • # *\n\"The forthcoming December meeting of the Board\nof Directors and selected committee chairmen was\nagain discussed at length. Schooley moved in lieu\nof the previously authorized joint meeting of the\nPermanent Financing Committee and the Foundations\nCommittee that these two committees be invited to\nthis special meeting. Schooley further moved that\nthe new Association secretary be invited to attend."
}