{
  "id": "d643-114",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nStation KUOM\nUniversity of Minnesota\nMinneapolis 14, Minnesota\nDecember 10, 1957\nMr. Ralph Steetle\nJoint Council on Educational Television\n1785 Massachusetts Avenue N. W.\nWashington 6, D. C.\nDear Ralph:\nI have received the draft of your proposed letter to Mr.\nJoseph M. McDaniel requesting funds to continue the operations\nof the JCET during 1958 and 1959. This I have read carefully.\nI also have submitted it, together with the text of this\nreply, to some of my associates on the NAEB Board of Directors.\nWe of NAEB believe that channels for educational\ntelevision stations must be reserved by the FCC; that once\nallocated, they need protection; and that technical and legal\nassistance should be provided for educational groups prepared\nto construct stations on these channels. We, therefore,\nsupport the proposed request for funds to continue the work\nof the Joint Council for a period not to exceed two years.\nNAEB, nevertheless, attaches to this the condition that\nthe several groups and Interests Involved with the work of\nthe JCET should periodically appraise the Joint Council’s\nfunctions and performance in the context of the total\neducational'television movement. Since such a study probably\nwould require a series of conferences over a period of some\nmonths, it should be initiated very shortly.\nI should emphasize that this suggestion does not indicate\nany lack of appreciation by the NAEB of the Importance of the\nwork done by the JCET, nor does it imply criticism of the\nJoint Council’s standard of performance. Surely it does not\nmean that the JCET should be subject to any different\nappraisal than should the NAEB. As you may know, a meeting\nof the NAEB Board of Directors was held in Chicago on\nDecember 6, 7 and 8, for the express purpose of re-examining\nour role in educational broadcasting, and of exploring ways\nand means in which our basic philosophy might be altered or\nour operations improved."
}