{
  "id": "d643-124",
  "text": "KTCA-TV CHANNEL 2\nSt* Paul 1. Minn.\nNovember l£, 1957\nDr. Burton Paulu\nPresident\nNational Association of Educational Broadcasters\nICUCM\nUniversity of Minnesota\nMinneapolis 1h, Minn®sota\nDear Dr. Paulu:\nlour lengthy, single-spaced protestation of innocence has been received and\nnoted* X realize the effort you must have put into this essay and regret that\nI find it obscure in some places and contrary to fact in others. The uncon¬\nscious humor of your statement that Harold Hand’s talk contained a significant\nanalysis of educational broadcasting in the face of the man's correct state¬\nment that he knew little or nothing about that subject* is a case in point*\nGan you seriously deny that in terns of numbers involved, work performed end\ntrouble taken, the Follies was \"the major effort” of the convention? If you\ncan, you will need better arguments than Hand’s significant analysis. % re¬\nmarks were much closer to understatement than to hyperbole*\nSimilarly no one with any basic parliamentary experience will be convinced\nthat tabling a recommendation is a simple matter of delaying consideration.\nX am now stirs that the recommendations will be considered but you mil pardon\nme if I feel this happy result stems largely from efforts of rains subsequent\nto the Convention. Incidentally the preliminary minutes arc in error in re¬\nferring to the \"Schwarzwalder proposals*” As I understand it th© proposals\nwere adopted and recommended by the TV Operations and Development Committee0\nI am proud to hav® suggested th© proposals but they are no longer mine (except\nin the eyes of those who want to defeat them).\nAnother small point full of unconscious humor was your citation of the Aller-\nhon House Conference as sn NAEB aid to ETV in th© same letter in which you ad¬\nmitted the Board of th® NAEB had tabled the two ETV proposals which came out\nof th© Conference.\nAs to the domination of MAEB by Midwestern Radio Stations I fail to see how you\ncan deny it. As long as WTTW, with an $800,000.00 budget, serving 6,000,000\npsopl© has th© ssuno voting power as, say)KST£ (FM) in Emporia, Kansas, this\ndomination will contimis. I am not blaming you, personally, for tills situation.\nI simply object to your saying it is not a fact tod I feel you are not entirely\ncandid when you fail to admit th© truth of my contention, lb© \"Midwestern\nsocial club” remark is equally true. For th© phrase I am indebted to Dick Hull\nwho used it at th© convention and said the NAEB was that and a lot of other\nthings as trail. I agree fully with his statement but not, I think, with what\nhe meant.\nYour reference^ to \"other communications” of mine is obscure. I believe I know\nyou too well to suppose you would exhibit the extremely poor taste to use an\nNAEB letterhead and your office in the MEB to refer to non-NAEB differences we\nhave had. In any case may'I assure you that I am not aware of any \"communica¬\ntions” from which I should like to withdraw a single line."
}