{
  "id": "d643-135",
  "text": "- 6 -\n• expiration date® for foundation grant®\n- possible need for ETV stations to have stronger vote In NAEB*\nbecause of larger investments, larger staffs, and larger\naudience potentials*\nThe Board adjourned for the night at 9*45 to c onvene at 9*00\na.m, the following morning.\n20. President Paulu called the Board to order at 9*15 &.m. Satur¬\nday, December 7, and reviewed discussion of the previous day*\nIn reviewing the four ETV station needs as listed by Robertson,\nSchenkkan pointed out that the SREB TV Committee has been active for\nsome time In the area of station activation.\n21. Upon invitation by Paulu, Hull reviewed the general areas of\nresponsibility md functions of each of the major organizations active\nin the ETV movement. The Board made mention of the possibility of a\nreduced budget causing reduced JCET operation over the next two-year\nperiod. The Board also noted the cessation of national ETV publicity/\npromotion by the ETRC (originally an HCCET function) as the grant for\nthis activity expires.\nThe possibilities for an interim foundation grant to provide this\nservice were discussed*\n22. Talk then centered once again about the problem of additional\nstation activation. McBride re-read the Television Operations and\nDevelopment Committee recommendation. Pointing out the station activa¬\ntion need unanimously expressed by the ETV station managers, Schenkkan\nmoved that the President appoint a committee to prepare a proposal (by\nwEISK station activation can be brought about) at this meeting to be\npresented by the proper persons to th© Ford or other foundations at the\nearliest opportunity*. Coleman offered an amendment to the motion which\nplaced the following immediately prior to the above motion* The NAEB\naccepts the responsibility for activation and promotion of new ETV sta¬\ntions and fundsfor this will be incorporated in the next foundation re¬\nquest.\nSchenkkan seconded the amended motion. After discussion it was\nwithdrawn. It was pointed out that such responsibility should be in¬\nherent in NAEB* Adams then seconded the original Schenkkan motion and\nvote was unanimous*\nPresident paulu appointed a 6-man committee to meet during the\nnoon break to begin preparation of such a proposal* Robertson, McBride,\nSchenkkan, Hull, Marks, and Harley, Chairman.\n23. In discussion of the first ;fV station need, improvement of\nnational program service, consensus of the Board was that the category\ndoes not lie within the Jurisdiction ger so of NAEB.\n24.. There was further consensus that the NAEB Advisory Committee\nto the ETRC President should be enlarged in scope, become stronger, and\nembrace all areas affecting NAEB members including radio and other non¬\ntelevision members."
}