{
  "id": "d643-136",
  "text": "7\n25* The Board returned to the problem of the unification of\neffort of all organisation© in the tW movement* Harks raised the\nquestion: who represents ETVt Th© need for such unification of\neffort bee© as increasing!-’ oritidal after additional discussion*\nHull read a document outlining both a shortand long range proposal\nACTION for the future of the BTV movement. (Headquarters to get copy from\n“\"HqJ Hull and dlstrlbue to Board*) McBride moved, with a second by\nBronson, that the president be instructc^To^proceed immediately In\nterms of the Hull short and long range proposals to explore and take\naction toward such unity of effort with all appropriate agencies and\norganisations in the field of educational broadcasting* Vote was\nunanimous •\n26* Brodorlci: suggested the possibility of a top level meeting\nin the near future* Hull pointed out a precedent for such a su- ©ting\nhas already been set by the ad hoc Committee, U* 3, Office of Education\nmeeting# He further pointed out that th© pending Magnuaon bill\nmakes such a zneetl g all the rore purposeful*\n27* Mark® than briefed th Board o the progress and present\nstems of the Magnuson Bill and suggested the advisability of an\nIIAEB popresentative meeting with Senator Magnuson*s office staff\nby the 15th of January next to explore methods by Which NAEB can\nbest represent its members in this matter at the forthcoming\nCommittee hearing* It was the unanimous recommendation of the\nACTION Board that the Cimlmsn Schenkken of the NAEB ad hoc Magnuaon\nSeHenlckanBi 11 study Committee meet representatives of the Senate Committee,\n0* S. office of Education representative® tid NAEB legal consel\nACTION by January 15th next* rresident Paulu is to re-examine th© com-\np'aulu position of the ad hoc Magnuson Bill study Committee in the light\nof tills Board action and revise If and where necessary#\nSchooley moved thafcthe treasurer b© authorised to defray expenses up\nto #5»000 Incur©d in providing testimony before the appropriate\nCommittees of Congress in th© event such testimony is requested of\nNAEB* Second by Schenkkan and vote was unanimous*\n3 * The Board adjourned at 12:30 p*m* and reconvened at 2:15\np*m# The problem of commercial implication in BTV programming\nwas discussed* It was the consensus of th;; Board that this problem\nshould be one of th© first it’esas \"on 'the agenda of the new NAEB\nTelevision Management Committee! That the matter is potentially\nvery dmgei*oua to the environment and will affect everyone* The\nBoard suggests that the Committee conduct an. inquiry of all EfV\nstation managers, quoting the pertinent sections of FCC rules,\nand asking for the experiences, legal opinion, FCC opinion, etc,\ngathered by such manager* It was pointed o t that this is a fit¬\nting example of NAEB serving its TV members*\n29* Broadcast inis Foundation of America. The Executive Director\n?re s ent ©d tlilT'd ac kgrou'. cl to ~$road casting Toundation of America*\nhis led to a discussion 4 so of the Voice of /merica and th©\nState Department* It ms th© consensus of the *x>ard that NAEB\nsupports the concept of BFA, doe® noi surrender NAEB obligation"
}