{
  "id": "d643-140",
  "text": "- n -\nL{.« he principle of regional and local recruitment of consultants\nshall be followed since it permits not only us© of knowLedge of area\nend familiarity with local problems, but will enable simultaneous, devel¬\nopment and activation of stations In a short time# Another consideration\nin the recruitment of consultants shall be the type of station to be\nactivated.\n5m There be launched immediately consultative support for Richmond\nand Nashville (contact through KTV Pro loot SEES) and such other areas\nas the committee believes to be in need. This Immediate effort should\nuse all existing KALB resources.\n6. The officers and Foundation Committee should seek funds In the\namount of #150,000 for this operation (at least $150,000) imedlately\nfrom *£iat©v r sources they may be obtained.\nJames Robertson\nRobert Schenkkan\nRichard Hull\nLeonard Harks\nJack McBride\nWilliam Harley, Chairman\nSchenkkan moved, with second by Bronson, that the Board accept the\nACTION Committee1 s report and Instruct the offlcerato carry out recoil end ati ons\n\"Taulu contained therein. Approval was unanimous. It was the unanimous agree¬\nment of the Board that Mr. Henry ^ hade syne be approached and urged to\naccept the chid manship of the BABB Television Development Committee.\nSchenkkan moved, with second by Schooley, that the President appoint\na committee to accompany him to St, Louie to meet with Hr. Chadeayne\nas soon as possible. Approval was unanimous. It was the consensus\nof the hoard that this? committee then meet personally with 'fche President\nof the ..TRC followed by the rjceoutlvo Director an,.- Chairman of the\nBoard of JCET to discuss the planned action end enlist their com-\nACTIQN plet© cooperation and support. Accordingly and with their advice\niPauJu\"' and consent of th- Board, President Puulu appointed Schooley and McBride\nichooley to go with him to St. Louis and Ann Arbor; Paulu and Hull to go to\nMcBride Washington, D.C. It was further the consensus that press releases, etc.,\nHull be withheld pending these several trips, and that McBride should call\nMTIfN Schwarswtlder as soon as possible giving a general stannary of Board\nKcSrlde action taken at the Chicago meeting.\n39, Was him ton, D.C. Meeting. The Board returned to the dis¬\ncussion of fch* need for\"'unification of effort end the possibility\nand feasibility of such a Joint meeting. Schenkkan moved the fol¬\nlowing!\nIn Washington just prior to the PCC hearings which resulted\nin the reservation of television channels for education, NAAS and the\nU.S. Office of Education called an open meetinf of educational admin¬\nistrators and broadcasters to explore and define problems which threat¬\nened their efforts to secure LTV channels and to achieve a concensus and\na mechanism which could effectively represent am forward the common\nobjectives of all. From this meeting emerged the ad hoc Joint Committee\non Educational Television*"
}