{
  "id": "d643-141",
  "text": "- 12 *\nHow seven years later, educational television, developed beyond\nall realistic expectations of its original planners, and achieving\naspects of a new social Institution, faces aseries of financial,\nphilisophical, and political crises (within its own ranks and within\nthe government), compounded by the ae Ivities of many agencies, who\nseeking essentially the sane objectives, nonetheless by their duplication\nof function, their unilateral activity, and. fiscal insecurity, are lead\nto work at cross purposes which presently threaten to undermine the\nsuccess of the whole structure* therefore I move, in the spirit and under\nthe precedent of 1950 and beneath© the shadow \"of * sputnik” and all it\nimplies that the President of JIAEB in cooperation with the b*S* Office\nof .Education invite those interested and conerned with the future of\nb#S. educational broadcasting and liberal and scientific education\nof the present and future genoration in the U#S* be called together\nin the nation** capital a® a national committee of the whole to study\nam devise ways and means whereby the resourced of educational com*\nmunlc&tlona throughout the country (whether AK-Pfc-TV or closed circuit)\ncan be mobilised in a common end better effort toward a successful real*\nisatlon of those educational* spiritual, scientific, and democratic\ngoals which all of us mutually seek in the name of our common -American\nheritage,\nAC i ION Second by Adams and approval was unanimous# It was the cor, sen a us\nFauTu ~ of the Board that this meeting be called if at all possible early in rVeese.\n1958* The Board then considered ways and means of implement in/ the fttic w\nabove, including invitation, of .foundation heads .LFordL, Kellogg, OntWcpelf.**'\nDominion, Carr arskAdlad?, disability of invi ; In; the c .nrplete '\nACTION membership of the. Boards of Jk: T and BTBC, etc# It was Board\nFaul’u\" consensus that the President appoint a steering committee as soon as\nposiTble\"\"to plan the approach, set up the meeting, and prepare and\nimplement an agenda} that the plans for this meeting be sent in advance\nto each HA,3 Board member; and that the Hull-PauLu trip to Washington\nto meet with J#KT could also begin action on the above meeting#\n40# The Board discussed reporting results of the v hie ago met-ting to\nthe general membership# Consensus was for the President to give a\nsummary in his newsletttr column#\nla. Schenkkan raised the advisability of hiring a qualified steno¬\ngrapher or stenotype operator to taka minutes of future Board Keatings#\nSuch a person would report to the Secretary* Such an action would\nenable the Secretary' to participate more fully in the meetings and\nwould give the Board members daily summaries of action* Consensus\nAC i ION was that a uch action should b© taken and for hea&qu art era \"to investigate\nHq# costs, etc.\nij2. The Board than considered those probing still nee ing dis¬\ncussion, among them\n- possible Vice-President for T eleviaion\n- further re-structuring of NAT,„>\n- additional service to membership\n* further correecion of actual and potential weaknesses\n- association financing"
}