{
  "id": "d643-148",
  "text": "Since no NAEB Newsletter should consist exclusively of a message\nfrom the president, I must summarize more briefly some of the other\ndecisions made at these meetings* In both St. Louis and Chicago,\nmuch attention was given to liaison between educational broadcasters\non the one hand, and educators and educational administrators on\nthe other.\nThis problem was thoroughly discussed with reference to both\nlocal and national situations, inside and outside of NAEB. Consideration\nalso was given to educational broadcasting and the PCC; to public\nrelations problems in general; and to the ever-important problem of\nlongterm financial support for educational broadcasting. Ten major\nareas of need were identified* programs; professional advancement;\nservices to members; teacher and educational development; technical\nservices; research activities; publicity and public relations; station\nactivation; policy guidance; and financial support.\nThe various interests involved in educational broadcasting, and\nthe organizations set up\" to serve them, were Identified. Those\nwhose orientation is broadcasting include such groups as the NAEB,\nthe STRC, and the JCET. Associations of educators and educational\ninstitutions range from groups of kindergarten teachers to foreign\nlanguage specialists, and from public school administrators to\nuniversities and land grant college administrators. These groups\nhave worked toward somewhat the same goals in educational broadcasting\nfor years, but it was felt that recent changes in educational needs and\ndevelopments in broadcasting practices might justify reappraisal of\ntheir efforts. Therefore, It was the consensus of the Board that the\nseveral groups and Interests Involved in educational broadcasting\nshould re-evaluate their functions and performance in the context of\nthe total educational broadcasting movement. Such a process might\ninvolve not only leaders in education and educational broadcasting."
}