{
  "id": "d643-158",
  "text": "MEMORANDUM\n4 °,f) 5 r4 Uo,r January 7 , 1953\nTo: ParticipantSpecial NAEB Board Meetings Chicago,\nDecember 6, 7 and 8 1 W 657\nFrom: Burton Paulu & u.,\n^Rs,rY0FILLlf\nSubject: Progress Report oh Station Activation Plan\nAt the conclusion of our Chicago meeting* it was resolved\nthat the President, the Executive Committee, and such other\ncommittees as he might appoint should carry out the station\nactivation proposals, first by meeting with Henry Chadeayne\nin St, Louis, then by calling upon Harry Newbura in Ann Arbor,\nand finally by meeting with representatives of the JCET in\nWashington, This memorandum is a brief report on developments\nto date, I regret that the pressure of other NAEB business,\ntogether with the holidays, has Interfered with my reportings\nit did not, however, delay our proceeding with the assignments\nof the Board,\n1, On Monday morning;, December 9th, Jack McBride, Frank\nSchooley and 1 met with Henry chadeayne in' 'i^b, Louis* We\nsketched the background of events leading up to resolution of\nthe Board, which we then gave him to read, Chadeayne reacted\nvery favorably to the entire suggestion. He agreed as to the\nneed for the kind of action we outlined, and, when the\nproposal was first made. Indicated willingness to accept\nappointment as chairman of the Station Activation and\nDevelopment Committee, subject, however, to the approval of\nRaymond Wittcoff, the chairman of the St, Louis station Board\nof Directors,\nOn Monday afternoon, December 9th, therefore, the NAEB\ncommittee and Chadeayne met with Ray Wittcoff, Wittcoff too\nagreed as to the necessity for such a plan, and said he had\nno objection to Chadeayne accepting the appointment if he\nwanted to do so. But Wittcoff went on to say that he believed\nthis task was basically one that should be done under the\naegis of the ETRC, not the NAEB, although its development\nwould undoubtedly involve NAEB, as an organization as well as\nits local station representatives.\nThis matter was discussed at considerable length, and in\na very friendly manner. Nevertheless, Wittcoff held his\nground. After this; discussion, Chadeayne then decided to\nwithhold his final \"yes\" until he saw the course of events,\nmentioning specifically a desire to find out what would be\nthe reactions of/the ETRC and the JCET, and also the amount\nof money which could be obtained (with its consequent indication\nof the magnitude of the operation)."
}