{
  "id": "d643-159",
  "text": "-2-\n2. On December 12th, the committee of McBride. Schooley\nand Paulu called upon Harry Newburn In Ann Arbor* Again the\nbackground of the plan was reviewed, and Dr. Newburn was given\nthe text of the proposal. After an hour’s rather pleasant\ndiscussion, X asked Newburn to review his reactions. If I\nsummarize them correctly, they were somewhat as follows?\na. Newburn pointed out the operational problems involved\nin any local station activation campaign. Relations with\nlocal groups must be good, and the timing right. The NCCET\nsometimes proceeded incorrectly here, for which reason there\nwas all the more necessity that our plan, if put into effect,\nshould be organized with reference to all local needs and\nproblems.\nb. Newburn indicated that he considered such an activity\nmuch closer to the area of major Interest of JCET than of the\nETBC. The problem of cooperation and relationships with the\nJCET might be difficult to solve; he did not, however,\nanticipate any problems as far as the ETBC was concerned.\nc. Dr. Newburn pointed out that he did not speak\nofficially for his Board of Directors, and he did not think\nIt desirable or necessary to present the matter to the Board.\nHowever, it was his feeling that such an activity would not\nInfringe upon the sphere of the Center at all. We told him,\nof course, of the reactions of Ray Wittcoff (who is a member\nof the ETBC Board of Directors), but Dr. Newburn nevertheless\nindicated that he did not consider this a problem.\nd. But, in order to avoid misunderstanding, he suggested\nthat there be liaison with the Center as well as with the JCET\nshould such a plan be put into operation.\nThe entire discussion was very friendly and forthright.\nIt seems unlikely that the Center will offer any particular\nproblem in activating the proposal.\n3. A meeting was set up in Washington on December 20 at\nwhich Dick Hull and 1 were to meet with £res iden't Albert\nJorgensen, chairman of the JCET, and Balph Steetle, executive\ndirector. At the last minute, however, Hull was unable to\nattend because of reservation problems, with the result that\nonly I met with Jorgensen and Steetle. Because of bad weather\nand very heavy demands for travel space. President Jorgensen\nhad an extremely tight schedule that day, so that the meeting\nof the three of us was held during the luncheon period, and\nhad to move somewhat rapidly. Thereafter, however, Steetle\nand I discussed the matter at some length."
}