{
  "id": "d643-169",
  "text": "MEMORANDUM\nTOs\nreceived\nRADIO STATION\nNAEB Board of Directors\nJack McBride\nHaskell Boyter\nHobert Coleman\nSo A0 Hungerford\nVernon Bronson\nWilliam Harley\nRichard Vogl\nRobert Schenkkan\nEdwin Adams\nFEH 28 ... ps ./id fey\nWILL. & WitiC\nUNIVEfiSlTY.OF ILLINOIS '\nFrank E® Schooley ,\nOertrud© Broderick\necs Richard Hull\nLeonard Marks\nFROM? Burton Paulu\nFebruary 26, 1958\nHere are progress reports on several of our current\nactivities?\nI. ^Plans for Washington Meeting,, When I was in Washington\non December 20th to present the outlines of the station actuation\nplan to Ralph Steetle and Albert Jorgensen,, X managed to get\n*a ?Kf°S?leM?fv?0Ufs wltE Gertrude Broderiok to begin discussion\nof the big Washington meeting. Since then there have been two\nmeetings in Washington to further review these plans, the first\non January 22 and 23, and the second on February 19 and 20.\nBoth of these were attended by Gertrude Broderick, Franklin\nDunham, Diok Hull, Harry Skornia, Leonard Harks and me.\nAnother meeting of the same group is scheduled for March 3 and !j,„\nAlthough considerable progress has been made, we find that\nsetting up a meeting as elaborate and important as this one\ninvolves a great deal of discussion, and that problems tend to\nbecome more compounded the longer we discuss them® For this\n^?n°“/o?tLSlan3^Ve not b!?a l8ld» and 30 X ask you to keep\nthis xn strict confidence until more things have been determined®\n9 1 an£?,^J2^? aessfon» w® sat this meeting for April\nioe and llp but at the session of February 19 and 200 we\ndecided to move it back to May 26, 2?, and 28, It was the feeling\nparticularly of the U, S, Office of Education that the later date\ntel ^tfMafda?e £s ^ t0 ** lald“\n. Franklin Dunham has discussed this with some of his superiors\n®nd lt aP?ea-s almost certain\nteat tee Office will officially sponsor this Jointly with UAEB,\n,fvno)f Rafting a letter on which I will base a formal request\nto the Commissioner of Education for the Office to Join with us\nin sponsoring such a meeting. We are virtually certain of hia\naccepting this suggestion,."
}