{
  "id": "d643-170",
  "text": "-2-.\nThe basic purposes of the meeting t-fill be to ©xehazige\ninformation on current status and trends In educational\nbroadcasting* and to determine directions for future educational\nbroadcasting, The participants will embrace not only such\noperational agencies as NAEB* ETRC* and JCET* but also such\neducational groups as the constituents of the Joint Council and\nother organizations whose primary concern is with the educational\nrather than the broadcasting process, \"\nTo this end* we are thinking of a meeting which would\ninclude sessions on the following subjects? general educational\norientation; relationships of the oonmmications media to\neducational problems? status and trezxds in educational broadcasting?\nproblems and potentials of educational broadcasting (analyzed\nfor elementary* secondary* higher and adult education)? and\nfuture directions in educational broadcasting.\nLet me say again that the plans* as far as we have been\nable to fomulate them* are by no means complete* for which reason\nX have not attempted to detail them above. However* at our next\nmeeting we hope to go Into this at considerably greater length\nand should have something more complete to report.\nWe have not completed our thinking about the participants.\nObviously* such groups as ETRC and JCET will be included. So\nwould many* if not all* of the major JCET constituents (National\nAssociation of State Universities* American Association of Land®\nGrant Colleges and State Universities* American Council on\nEducation* national Education Association* etc,)? various administrative*\ncurricular and content groups? representatives of foundations?\nsome others.\nOur problem of building both the agenda and drawing up the\nlist of participants is somewhat that of the chicken and the egg?\nwhich comes first? The participants necessarily depend upon the\nagenda* while the agenda depends on the participants!\nOn Wednesday afternoon* February 19* Hull* Skornla and Faulu\ncalled on Arthur Adams* President of the American Council on\nEducation* and outlined our plans. He seemed much pleased* and\npledged the wholehearted support of the American Council, The above\nthree* together with Gertrude Broderick* Franklin Dunham and\nLeonard Marks* also discussed these with Ralph Steetle, While\npledging his support* he was leas enthusiastic, and I believe\nwould be happier if the Joint Council were invited as an active\nsponsor of tho meeting© By telephone* on February 21* I informed\nHarry Newborn of our plans. He did not react to them one way or\nthe other* merely thanking me for the information, and saying he\nwould await further developments®\nThis is clearly a major enterprise. It could well be the\nmost important educational broadcasting meeting of the year* for\nwhich reason its potentials for accomplishment or disaster are\nconsiderable! It is for this reason that the committee is giving\nthe matter such groat thought* and will meet again in Washington\non March 3 and Ij. with the hop© of then firming up details as to\nagenda and the participants."
}