{
  "id": "d643-177",
  "text": "copy\nSent for the information of\nFrank Schooley\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL\nURBANA, ILLINOIS\nStation KUOM\nUniversity of Minnesota\nMinneapolis 14, Minnesota\nMarch 2?, 1958\nMr* Richard B. Hull\nStation WOSU\nThe Ohio State University\nColumbus 10, Ohio\nDear Dick*\nThank you for the carbon of your March 20 letter to\nFrank Schooley* Here, you*11 recall, you commented on the\nletter from the publisher of the Film AV News* You also\nreported that Graydon Ausmua told you \"that our friend John\nS. at Minnesota finally admitted that with one exception,\nhe had never asked for any services from MASS, yet he was\nprotesting against their absence.” You then go on to point\nout that the very people who benefit from some of our meetings\nseem not able to recognize that they are NAEB meetings.\nIn regard to the letter from Mr. Keegan, he probably Is\nvery honest in what he says* Isn’t it true that practically\nall of us are quite uninformed about a large share of the\nwork that takes place in our own areas? I am forever being\ntripped up on something about educational broadcasting which\nI ought to know and don’t; the number of things I don’t know\nabout the rest of the world—even that part of it which\nimpinges upon my field—constantly embarrasses met Mr*\nKeegan, together with a couple of million other guys,\nprobably shares my faults in this respect!\nI think John Schwarzwalder•s problem is partly on© of\nbelieving what he wants to believe. I drew up a draft of a\nletter to send to him commenting on his letter of January 14\nin which he said that \"KTCA-TV will not continue membership\nin NASB until they were satisfied that NAEB was doing all in\nits power to further the ETV movement.\"\nMy reply was & documentation of the things that we had\ndone for educational television* However, I was in doubt\nabout whether it would really help things, or Just start\nanother round of letter writing. I showed the draft to Harry,\nand he confirmed my doubts, so I decided not to send it.\nHowever, in the course of reporting on the many things\nthat NAEB had done for educational television, I pointed out(^\nthat a number of University of Minnesota employees had gone\nto NAEB workshops and seminars and were now contributing to"
}