{
  "id": "d643-20",
  "text": "-2-\nFor the most part I go along with the recommendations of\nHansen and Peterson on page 1 of their memorandum, though I don*t\nagree entirely with their suggestion that reports of the travels\nof headquarters personnel should be ”held to a bare minimum* I\nagree, though, that it should emphasize the services which the\nheadquarters personnel perform. Insofar as there is a distinction\nbetween this and the foregoing; perhaps the matter is one of emphasis.\nWith the various suggestions of the report on the Journal,\nI am in general agreement; at least I see nothing to take particular\nexception to#. However, I am in great doubt as to what area the\nJournal should stake out for itself. I am rattier familiar with the\nQuarterly of Film, Radio and Television, the Journalism Quarterly,\nthe Public Opinion Quarterly, and some of the other learned journals\nwhich cover our field. Exactly where will we differ from them if\nwe follow the line of development which Hansen and Peterson propose?\nIs it realistic to suppose that another learned journal could attract\nvery much support, in the form of free articles, serious consideration\nfrom readers, or advertisers^^ the other long established journals\nin the field?\nproblems too, of course, some of which are\ntt'br which Frank wrote me following his meeting\nThere are othe\ntouched upon in a let\nwith you in Ann Arbor recently. I am enclosing a copy. (I am sure\nhe won* t mind). Recommendations on the charges to be made for the\nJournal are certainly also within the competence of your committee,\nas is the matter of advertising rates. In another letter to me on\nthe same date, Frank says that he discussed with you the possibility\nof a half day session of your committee at Columbus with each member\nto receive #25 from the Publications Study Fund as a contribution\ntowards his expenses. This I approve, with the suggestion that this\nmoney be made available only if necessary; that is, those people\nwho are able to come on other funds than NAEB should do so, since\nwe always run short before the end of the year.\nSooner or later we shall have to definitely settle the question\nof what to make the Journal title, and when we change it. I should\ncertainly go along with changing the title to NAEB Journal effective\nnext fall with the beginning of a new volume number. This may or\nmay not require board action, but I think a formal recommendation\nfrom the committee following your Columbus meeting would be a guide\nhere."
}