{
  "id": "d643-204",
  "text": "-2-\nWednesday morning's committee imports were on a surprisingly\nhigh level (I say \"surprisingly\" because I don't think committee\nreports always are of high level?)© after which Bob Anderson gave\na stimulating interpretation of the two previous days* Some people\ntook exception to his conclusions as being his interpretations\nrather than those which necessarily would follow from what had been\nsaid during the previous two days, but they too had their \"day in\ncourt,\" and, I think, were satisfied* Bob, incidentally, emphasized\n—and this apparently was entirely his own idea—the importance of\nthe NAEB, ETBC and JCET getting together to make plans cooperatively\nrather than competitively.\nThe wind-up by John Ivey of New York University was superb; he\ngave us one of the best overviews of broadcasting against a back¬\nground of education I have yet heard* He pointed out the desirability\nof some sort of national ETV network on the order of that being\nplanned for the South by the SHEB. Whether or not one goes along\nwith this, there can be no doubt that he provided an excellent\nwind-up.\nAs an added feature, Franklin Dunham arranged a tour of the\nexcellent closed-circuit television facilities at the Walter Heed\nArmy Medical Center in Washington. This color closed-circuit\nInstallation is certainly among the best of its type in the world,\nand was well worth seeing*\nPress coverage of the conference was good* We made the New\nYork Times twice (copies are enclosed for your information)*\nI think this meeting achieved its main objectives, among which\nI would include the following?\nTo outline America's basic educational problems* To review\nthe status of educational broadcasting today. To bring together\npeople of different backgrounds to get acquainted and to exchange\nideas. To point the way for future developments in educational\nbroadcasting* To advance the status and prestige of NAEB*\nImmediately after the Wednesday morning session, the NAEB\nexecutive committee, together with the other NAEBers present, met\nto ask, \"Where do we go from here?\" We agreed that this was not\nthe kind of meeting which could write a call to action or pass\nformal resolutions. In fact, the U* S. Office of Education\nexpressly forbade any such resolutions if they were to sponsor the\naffair. However, certain conclusions stated or Implied by many of\nthe speakers agree with NAEB objectives* Dick Hull has accepted\nthe assignment of writing these up, and is now at work* When I\nreceive copies, I will send them to you,\n(2) Foundation News\nWhen Messrs* Chadeayne, Hull, Skornia and I left Lester Nelson’s\noffice in New York on Kay 21, we felt very encouraged* But we\nshouldn't have been?"
}