{
  "id": "d643-214",
  "text": "Drafted April 30, 1959\nStockholm\nTranscribed May 5* 1959\nDepartment of Radio and\nTelevision Broadcasting\nUniversity of Minnesota\nTos Keith Engar\nWilliam Harleyv/\nHarry Skornia\nFroms Burton Paulu\nThis time I report from Stockholm.\nThe EBU meeting went very well. I had a chance to see\nthese people at work, and to appreciate how similar are the\nproblems of broadcasters the world over. Payments to sports\npromoters who fear television competition; the division of\ncosts for network lines among Eurovision members; the clearing\nof time for simultaneous broadcasts on a dozen national\nsystems; all these and other problems, though not usually of\nimmediate concern to me, developed in such a way as to\nindicate a community of problems.\nX have already written about the ETRC admission question,\nand so shall not repeat that here. But I should add that\nsince last writing, I have seen some films from Swedish\ntelevision, and was no more impressed than with the French,\nItalian and Australian films I saw in Paris. Surely these\nshould be carefully screened before anyone decides to\ntelevise them.\nBritish shows are another matter, though. I am now\ncorresponding with ITV*s Associated Rediffusion Company\nrelative to a series of art talks by Sir Kenneth Clark which\nI thought excellent. We have become too BBC-oriented when\nthinking of British television programsi ITV has some\nsuperb shows too.\nBut to get back to the Swedish situation. X met\nyesterday and today with Mr. Roland Poalsson, head of Swedish\nShort Wave and Overseas Services; Mrs. Karin Bergman, bead\nof External Liaison; Mr. Goran Dehlin, also of this department;\nand the WUOM girl, Marjorie Lundin. From all this comes the\nfollowing.\nMiss Lundin is here for a short period under the auspices\nof some Swedish American foundation to do mainly musical\nshows based on upcoming summer festivals in Sweden, as well\nas on material in the tape files of Radio Sweden. She appears\nnot too experienced in this field, and is not fully aware of\nmusicians* union and related problems. We discussed some of"
}