{
  "id": "d643-229",
  "text": "Drafted June 9* 1959\nBramley Cottage\nLinks Road\nBramley, Surrey\nTranscribed June 15* 1959\nDepartment of Radio and\nTelevision Broadcasting\nUniversity of Minnesota\nTot Keith Engar X\nWilliam Harley K\nHarry J. Skomia\nPromi Burton Paulu\nBack again in Bramley, after a few days in Geneva, five\ndays in Rome, plus short sightseeing stops in Florence, Pisa,\nVenice and Milan (with a visit to television headquarters in\nMilan),\nIn Geneva I called at the EBU headquarters, Mrs. Strashnov,\nwho edits the EBU bulletin, says she relies on our Newsletter\nfor much of her information about American radio and television.\nThey have a nice library, not much used, though. I also found\nout about a publication by the Soviet satellite broadcasting\nunion (OIR) whioh is worth Investigating as a source of\ninformation about behind-'the-curtain broadcasting.\nThe Rome EBU meeting was devoted to radio*s adaption to\ntelevision. Here I participated far more actively than at any\nprevious EBU session* I am getting acquainted, and we Americans\nhave more to say here, since the cycle has gone further with us\nthan anywhere else. I attended every luncheon, dinner, cocktail\nparty, banquet, studio tour, and outing, and talked on every\npossible occasion with the representatives of all countries.\nThey are setting up a committee to draft an elaborate questionnaire\non the current development of radio In all EBU countries, and I\nmay be appointed to It; that is not certain, although the Swiss\nrepresentative who moved setting up the committee specifically\nso suggested.\nIn Rome I spoke at length with Messrs. Formosa and Pardl of\nRAI about programs for NAEB. Pardi said that union complications\nmake music difficult, but that he personally was willing to do a\nperiodic press review—say alternate weeks—for us. He now does\none for Australia among other countries. I*m not sure whether\nhe wants payment for these or not. If NAEB is interested, someone\nat headquarters (or I will, if you so request) should write to\nnail down these and other details (Dr. Maurizlo Pardi, RAI,\nVia Babuino 9* Home).\nI have noted Harry*s memorandum to the NAEB president. Board,\nand International Relations committee about membership In EBU.\nI realize the considerations of expense and manpower which led to\nhis proposals; yet I*d like to make a few comments on the other\nside."
}