{
  "id": "d643-23",
  "text": "-2-\nyour experience in working on the convention the last two years.\nThis, I feel she both needs and is very anxious to get.\nI note your comments on the meeting with Heffernan relative\nto the exemption of all-channel receivers from excise taxes.\nHeffernan had written a short cryptic note to me a couple of weeks\nago indicating merely that he would like to talk to me, although\nI had no idea at all of what he wanted to discuss until Harry\nSkornia gave me your letter in Ann Arbor. I suggested to Ralph\nin Boston that this might well be an item on the next meeting of\nthe JCET. There are apparently divided councils here: you report\nthat Lennie Marks opposes our testifying against the tax, but\nI find that both Ralph and Dick feel that we should. I should\nlike to hear all points of view represented before I make up my\nown mind. In any event, representation of the Association at a\ncongressional hearing should, if possible, take place only after\nthe full board has had a chance to discuss the matter and determine\nthe policy to be followed.\nThe Voice of America situation seems to bog down increasinglyl\nIn Washington I invited Rainey to send a man out to Urbana to\nmonitor tapes, later repeating this invitation in a letter to\nGeorge Halsey, former WOI man who is now with the Voice. I further\nrepeated the invitation to a Voice of America luncheon companion\nat the Boston Conference, Richard Ernstein. Eventually they may\nget around to visiting usl\nIncidentally, I am a little bit puzzled by a couple of sentences\nin your February 27 letter in which you are discussing your conver¬\nsation with Maurice Seaj: \"I offered to go along as valet, and he\nwanted to know how mu clef money I had. When I suggested Foundation\npay, he said, >youTve just been turned down.1 I told him I was used\nto that and he had a good laugh.” I am afraid you are too subtle\nfor mel\nFinally - and most important - congratulations on your 5lst\nbirthday! We shall expect you to be just as active at 101 as at\n51.\nWith best personal regards to you and the whole family.\nYours sincerely.\nBurton Paulu\nPresident\nBPjkls"
}