{
  "id": "d643-230",
  "text": "-2-\nI think the big point here is, how completely is NAEB\nwilling to abdicate to BPA and ETBC its claim to represent\nAmerican educational broadcasting abroad. As I have gone around\nEurope this year, I have tried quietly but steadily to counteract\nthe misimpressions which have developed. I have gotten\nacquainted with more EBU and European broadcasting people than\nany other American educational broadcaster to date, except\nperhaps Si Siegel, whose influence is now exerted elsewhere than\nfor NAEB! All this has given us a bit more \"in,\" at least\nrelatively speaking.\nPatiently I have explained over and over again, to broad¬\ncasters from Prance, Switzerland, Italy, Sweden, Belgium, the\nUnited Kingdom, and elsewhere, that NAEB has not formally handed\nover its overseas commitments to BFAj that we still run a tape\nnetwork; that BPA cannot speak for us; and that we are still the\nmain American educational broadcasting association. Xt*s my\nfeeling that I've made some impression.\nIf you want to continue membership, 1*11 be glad to take on\nNAEB-EBU relations (subject, of course, to general administrative\nand International Relations Committee direction). That would\ntake some weight off of Harry*s surely over-burdened shoulders;\nit would not, of course, meet the financial aspects of membership.\nI do hope that, when the decision on EBU membership is made,\nthis matter of NAEB status abroad will be taken into consideration.\nIn addition, I think our whole relationship to BFA needs to be\ndefined. This probably was gone over at the International\nRelations Committee meeting in Columbus. We should decide on\nwhat we want, discuss it with Si and company, and then either work\nwith them or openly against them! I*d appreciate learning about\nthe current policy in this respect.\nOne more thing. I have written about the Salzburg Congress\non Opera and Ballet in Television and Film. Although Keith's\nletter of May 28 implies approval of ray attending (\". . . you in\nthe field are better able to judge what might be of value.\"), no\none has specifically okayed this. So, I hereby propose to attend\nthis meeting (program details enclosed) from August 23 to August\n29, with perhaps a couple of days at the Bayreuth Festival enroute\nor returning, this to be entirely at NAEB expense. (I*m now\nbroke personally, but some 1^50 remains of my original $1,000\ntravelling allocation from NAEB.) This might provide some Interesting\nmaterial; the Bayreuth Festival, on which I have written some\nletters (see copies Paulu to Freundorfer, March 5» sent you\npreviously) and am writing more, would be a nice musical feature\nfor NAEB. Or does BFA have it sewed up? If these proposals are\ndisapproved, please let me know immediately, since I should make\nray reservations very soon.\nBPids"
}