{
  "id": "d643-241",
  "text": "227 Gregory flail\nUrbana, Illinois\nOctober 20, 1958\nLinks Road\nBramley, Surrey\nEngland\nDear Burtons\nMighty glad you sent a carbon to Omaha, From it comes\nthe following suggestion, on which I’m sure you*11 agree,\nWe’ll make $1000 available to Burton Paulu. Of this\namount, MAKE will furnish $500. And, $500 will com© from ETRC\nfunds provided NAEB for Current Opportunities in the programming\narea.\nOn exact useage, we’d like to leave that to you. But,\nI would like to indicate our feelings so you can use them for\nguidelines.\nYou might elect to use the entire $1000 for the Russian\ntrip, but we’d prefer not to use it all for that purpose. We’d be\nhappy to have part of It spent on this trip, but we’d also like to\nlook forward to Paulu attending some other meetings on behalf of\nNATO, or representing NAEB. In the rough, we’d hope half would be\nconsidered Mprogramming” and the other half as NAEB representation.\nWe don’t care whose monies you spend at what times, so long as spirit\nis carried out.\nBy a carbon of this letter, I am asking Treasurer Bob\nColeman to transmit money to you pronto. However, I point out that\nBob may elect to send it to you in two payments. We have only\n$100 currently available in Current Opportunities. It is re¬\nimbursable, so depends on how he feels. I’d assume draft you\nreceive will be in amount of $1000, or $600,with$400 later. That’s\nup to Bob,\nJust so you’ll have the background, your letter was read,\nand action here related by all Board members except Adams (absent\nbecaxise of wife’s critical Illness), Bronson (absent because of own\nIllness), and Broderick (with whom I had no chance to discuss). I’m\nsure Gertrude would approve. The rest of the deal I ran concurrently\nwith NAEB dance after the annual dinner. I just never found\nappropriate time to interfere with Gertrude’s social evening. She\nwas there and always busy. I guess I was more reluctant to bother\nthe lady than the gentlemen."
}