{
  "id": "d643-247",
  "text": "PATENT.,APPLIED FOR PATENT APPLIED FOR ’ PAYf.NT APPLIED f(\nI. PROJECTION OF IRQGRAMS TO BE PRODUCED AT KPFA AND\nMADS AVAILABLE TO THE TAPE NETWORK OF THE NAEB\nMUSIC\nMEET THE COMPOSER: A series of six approximately one-hour programs with out¬\nstanding contemporary composers. These programs are prepared under the\ngeneral direction of Americo Ghiarito, KPFA*s Music Director, and include\ninformal interviewrs with composers analyzing and commenting on their own\nand their contemporaries* work; performances, both live and recorded, of\nthe composer*s work with explanatory and critical program notes by the com¬\nposer himself. Present plans call for a series of six programs with the\nfollowing composers:\nDarius Milhaud\nRoger Sessions\nErnst Krenek\nJohn Edmunds\nAndrew Imbrie\nEllis Kohs\nTOWARD A CREATIVE MUSIC: A series of nine programs, ranging from twelve to\ntwenty-five minutes each, in which the experimentalist, Harry Partch, explains\nthe basis of a musical philosophy that led to his construction of a new\nscale and the invention of radically new musical instruments. This series\nrepresents a summary of thirty years of musical research by Harry Partch\nwho is one of the most controversial figures in the contemporary music\nworld. The three concluding programs in the series contain examples of Mr.\nPartch*s compositions using the forty-three tone scale. The following\nis a listing of program titles and the times for each programs\nCreativity in Music - 16*\nEducation and the New Instruments - 17*\nEducation and the Record Repertory - 12*\nEducation and Acoustics - 16*\nThe Writers on Music - 13*\nMusical Perspectives - 16*\n% Instruments - 21*\nCastor and Pollus (music) - 24*\nThe Oedipus Dance Music - 25*\nCHORAL CONCERTS: A series of thirteen one-half hour programs of choral music\ninvolving the Berkeley Chamber Singers and choral groups from Stanford\nUniversity, San Jose State College, Modesto Junior Collegp, University of\nCalifornia, College of the Pacific and Dominical College. ' The programs\nwill include both traditional and contemporary works for chorus.\nSTRING QUARTET REHEARSALS; Through an arrangement with members of the Quartet\nand the University of galiforaia, KirFA has been given permission to record\nthe open rehearsals held by the Griller String Quartet. These are \"unstaged”\nrehearsals and contain all of the exchanges, humorous and otherwise, between\nmembers of the Quartet. There will be between four and five program hours\nin the entire rehearsal series."
}