{
  "id": "d643-248",
  "text": "PATENT APPLIED. FOR\nPATENT. APPLIED FOR\nPage 2\nMUSIC (Cont.)\nCONTEMPORARY MUSIC: A program series, to be recorded in the KPFA studios,\nfeaturing performances of contemporary music by student performers of out¬\nstanding ability. The series will place particular emphasis upon premier\nperformances of contemporary music and will serve both as an outlet and an\nincentive for new work, particularly for younger composers. In most in¬\nstances the performer will have had the opportunity to study the score with\nthe composer. It is expected that this series will number five or six half-\nhour programs.\nTHE PREPARED PIANO: One program only, approximately one hour in length, with\nMaro Ajemian, internationally known pianist, explaining and demonstrating\nJohn Cage,s music for the prepared piano. The program will include the\nstep by step preparation of the instrument and the performance of works\nfor the prepared piano.\nSONG ALIVE: A series of twelve twenty-minute programs on American Folk Songs and\nBallads, produced in cooperation with the folk song collectors Sam Eskin\nand Sidney Robertson Cowell. The series will include new field recordings\nof many of the singers from whom modem scholars have derived the majority\nof the songs included in their collections. The personal collections,\nrecorded in the field on portable, high fidelity tape equipment, of Sam\nEskin and Sidney Cowell are probably the most extensive folk song collections\navailable outside of the Library of Congress Archive of American Folk Song.\nAuthoritative commentary on the songs and ballads included in the program\nseries will be supplied by Mr. Eskin and Mrs. Cowell. This will be the\nfirst attempt, based on field recordings, at a truly definitive series on\nAmerican folk songs.\nPUBLIC AFFAIRS\nAFRICA; A documentary series concerning the development of African independence\nmovements in various parts of the continent. Program material already\nassembled includes interviews with key persons in relation to the resistance\nmovements. The completed series including music, supplementary narration\nand editing will amount to six half-hour programs. The following is a list\nof participants in the series;\nSouth Africa\nG. P. Jooste, Ambassador from South Africa to the United States and\nChief U. N. delegate from South Africa.\nMichael Scott, International League for the Rights of Man and a\nparticipant in South African Resistance movement.\nGeorge Houser, Executive Secretary, Americans for South African\nResistance.\nCentral Africa\nKirilo Japhet, spokesman before the United Nations Trusteeship\nCouncil, Wa-Meru tribe, Tanganyika."
}