{
  "id": "d643-250",
  "text": "PATENT. APPLIED FOR\nTENT\nAPPLIED FOR\nPage 4\nUTBBATUEE AMD DRAMA\nNEW WRITING? A series of ten half-hour Programs presenting readings from the\nnew work of both well known and lesser known American writers. Emphasis\nin the series will be upon good program production, and the author*s own\nvoice will be used only in those instances where he is an exceptionally\ngood reader of his own work. Among the writers contributing to this series\nare the following:\nRobert Duncan\nWilliam Everson\nRobert Horan\nWeldon Kees\nJosephine Miles\nHenry Miller\nRosalie Moore\nKenneth Patchen\nKenneth Rexroth\nFred Safier\nMODERN VERSE DRAM: A studio production of verse plays by the American poet,\nKenneth Rexrotfr. There are three plays in all—Phaedra. Iphigenia in Aulis.\nand Beyond the Mountains. The series will number three programs of approx¬\nimately forty-five minutes each.\nCHILDREN»S PROGRAMS\nONCE UPON A TIME: A story series for children from six to sixty. A selection\nof twelve Irish folk and fairy tales as told from memory by Josephine\nGardner, easily the most outstanding traditional story teller living in\nthis country. Programs in the series vary in length from twelve to twenty\nminutes each. Story titles include: The Wee Red Man. The Twelve Magic\nWindows. The King of Ireland*s Son. Feather of My Wing, and others.\nKIDNAPPED: A dramatized reading in twenty or more episodes of the novel by\nRobert Louis Stevenson. Single episodes -will vary between thirty and\nforty-five minutes in length. The production team headed by Charles Levy\nhas gained valuable experience in its productions of Huckleberry Finn.\nTreasure Island, and Robin Hood, and it is expected that the production of\nKidnapped will mark an improvement over these previously successful pro¬\nductions .\nROBINSON CRUSOE: A dramatized reading in approximately twelve half-hour epi¬\nsodes by Charles Levy, similar in production technique, including sound\neffects, to the production of Treasure Island, which was included in the\nWinter 1952 offering of the NAEB Tape Network.\nPICTURE STCDKY: A program employing dramatized reading of stories selected for\ntheir particular suitability in evoking picture ideas. This program format\nhas proved uniquely successful in KPFA*s broadcasts for children. The pro¬\ngram is designed specifically for primary school children. The readings are\nbroadcast and the children send in pictures illustrating the story. On sub¬\nsequent programs the station announcer acknowledges receipt of the pictures.\nThirteen fifteen minute programs."
}