{
  "id": "d643-252",
  "text": "Page 6\nTENT.,,\nIL SPECIAL PROGRAM PROJECTS ( Cont* )\nceedings of a two-d£y public Conference exploring and documenting the\nbarriers to effective communication between nations and peoples of radically\ndifferent cultural and ethical backgrounds will be recorded and edited\ninto a series of radio programs* The Conference, to be sponsored by KPFA,\nwill include four papers to be presented by particularly qualified persons\nfrom both the East and the West, a number of panel 4iscussions and excerpts\n^ from a series of Conference seminars* Upon final feiting there will be\nfrom six to eight program hours reporting the proceedings of the Conference.\nLITERARY PROJECT: This project contemplates an extensive expansion and addition\nto KPFA's current New Writing series. Bi-weekly broadcasts of the work of\nAmerican and English writers, principally poetry, verse drama, and apecu-\nlative writing, will be produced from material solicited from both well-\nknown and lesser-known writers, dramatists and poets in this country and\nin England. On a quarterly basis selections from the broadcasts will be\nissued in a supplement to the KPFA program Folio. Reasonable literary fees\nwill be paid to the authors whose work is used in the broadcasts and in the\nFolio supplement. It is expected that this combination of a broadcast series\nand a literary journal will become a predominant outlet and influence in\nvtlie contemporary literary world. The(fbSoadcasts^ numbering thirteen program\nhours per year, and copies of the Folio will be made available to NAEB\nmember stations.\nPOINT FOUR: A series of dramatized documentary programs, with lectures inter¬\nspersed, studying the Point Four program in the perspective of the various\nforeign populations receiving aid, and summarizing its history and economic\nprinciples. The project is planned with the Hoover Institute and Library,\nv Si-t-.anifford University, as the research center, and will involve a committee\nof highly qualified advisors as well as special research, administration\nand production staffs. It is expected that six documentary dramas will be\nproduced in the series, each half an hour, and about twice as many lectures\nrelated to the dramatic material*\nIII. SUMMARY OF PROGRAM HOURS AND PRODUCTION COSTS\nB\nBased on predictable program sources as noted above, approximately seventy-five\nprogram hours can be made available to the Tape Network of the National Association\nof Educational Broadcasters during 19^3® The following is a breakdown of pro¬\ngram hours in relation to the four primary program categories within KPFA's\nbroadcast schedule;\nPROGRAM CATEGORY\nMUSIC\nPUBLIC AFFAIRS\nLITERATURE AND DRAMA\nCHILDREN'S PROGRAMS\nNUMBER OF PROGRAM SERIES\n$\n7 or more\n2\nh\nTOTAL APPROXIMATE HOURS\n21\n7\nTOTAL SERIES\n20 or more\nTOTAL HRS\n22_\n7£"
}