{
  "id": "d643-26",
  "text": "March 75 1957\nTO: NAEB BOARD OF DIRECTORS\nFROM: Burton Paulu\nA seminar on \"Radio in A Television Age\" has been scheduled for\nAllerton House at the University of Illinois from April 22 to April 21*.\nThis project, which will be supported by $3,000 of available\nKellogg Funds, will be concerned with the over-all nroblem of educational\nradio station programming in a television age. It is hoped that the money\navailable will make it possible to pay a good share of the expenses of\nsome 30 participants. Problems of program resources, audience research,\nand related matters will be considered.\nTo discuss details of this seminar there will be a meeting in\nChicago on March 1}+ of Richard Vogl, Chairman of the Program Acceptance\nCommittee, Ned Rosenheim, Chairman of the Grants-in-Aid Committee, Lee\nDreyfus, some headquarters personnel, and me.\nWe had originally expected to schedule this seminar sometime during\nthe latter part of May or first part of June; in other words, after the\nColumbus Institute but before the end of the fiscal year. However, it\nhappened that Harry Newburn asked a few of us (Vogl, Rosenheim, Skornia,\nPaulu) to come to Ann Arbor on February 25 and 26 to discuss a plan of\nthe Center to allocate $100,000.00 a year for each of the next three\nyears for the development of radio programs. (Grants-in-aid and special\ncontract shows; it will be done!) We decided at that meeting, therefore,\nto move up the date of our seminar to a time previous to the submission\nof applications for the grants-in-aid so there might be some coordinated\nplanning. We also decided, for the sake of coordination, to have it\norganized mainly by the same people who had previously met with the STRC\nin Ann Arbor. I wish we had funds and time so that a larger group could\nattend the planning session, but being somewhat short of both, we have\nhad to hold down the size of the group and have it meet at the most\ncentral point possible.\nFor this very reason, however, the comments and suggestions of all\nmembers of the association are especially welcome, and I particularly\ninvite all of you on the Board of Directors who would like to contribute\nto the planning of this conference to write to me Immediately so that I\nmay report your suggestions to the planning group.\nBP: It"
}