{
  "id": "d643-5",
  "text": "February 22, 1957\nDr* Burton Paulu\nK U 0 M, One Eddy Hall\nUniversity of Minnesota\nMinneapolis, Minnesota\nDear Burton:\nBe: No. 3 - JCET Executive Committee Meeting.\nThe Committee met as scheduled, 10 a.m*, Monday morning, and\nadjourned after lunch at Pierre's*\nApproved proposed reduced budget of 125#000 ($140,000 asked)\nbut understanding that if Ford approved balance from 195& operations\nmight also be used* The Committee was not given definite figures\non 1956, rather 13-months operation figures. Unusual, but we got\nclose to approx im-ate figures.\nMuch of the discussion of meeting centered around paragraph in\ngrant which said that future grant considerations by Ford would be\nbased upon JCET acting in advisory capacity to total movement.\nJorgensen and Steetle were to see Dr. Faust later, and report meaning.\nThen JCET could determine its course or courses.\nJorgensen and Steetle seemed to feel that meaning wasn't what\nparagraph said, or that if it was could be changed. I can tell you that\nit means wh t it said, and it never would have been signed without\napproval of President Heald. It's full meaning will become known\nonly in time, I guess.\nNewbum tried to get group to commit itself as to its intent, but\nthis was not forthcoming. In other words, Steetle was not now (as\nof that date) willing to say what he had said previously, namely that\nJCET was anything but permanent. If JCET takes the position it is\npermanent, and I feel that it will, then the future with Ford is dim.\nWhether JCET can get funds from another foundation is questionable, but\nI believe they will decide to move along these lines after they get\nmore interpretation on the paragraph in question, and after they\nhave had time for conferences.\nI told them of the Senate Majority leader's (Lyndon Johnson)\nintent to have introduced into the hopper a bill to get monies for\nETV within education bill or bills, and offered to h_ve Lenny Marks\nmeet to tell the story to the group. It was 12:20 when they finally"
}