{
  "id": "d643-72",
  "text": "June 13, 195?\n' v memorandum\n,,\nV*-'1\n^ ^ .,\nTO: NAEB Board Officers, Directors\nFROM: Burton Paulu, President\nCC: Harry J. Skornia, Harold Hill, Leonard Marks\nSUBJECT: Round up of reactions to my memorandum of May 28\non various FCC and legal problems.\nIn my memorandum of May 28, I outlined some FCC and legal\nproblems facing NAEB, and, requested your reactions. Herewith\nis a summary of your comments, together with a report of the\naction taken.\n1. Television Allocations Table. All those members replying\n(Adams, Broderick, Coleman, Hiller, McBride, Paulu, Schenkkan,\nSchooley, Weld) fevoted to oppose the FCC°s proposed abandonment\nof the table. (Due to absence from the city, Bronson1s reply\ncame after I had requested Marks to proceed; however, he too\nvoted to oppose the deletion of the allocations table.)\nACTION: Accordingly, our legal counsel, Leonard Marks,\nhas filed a brief in opposition. Copies have already been\nsent to all of you. (The JCET also filed in opposition; I\nshould be glad to forward a copy of their brief to any of you\nrequesting it.)\n2. The Eberharter Bill. All those members replying (Adams,\nBroderick, Bronson, Coleman, Hiller, McBride, Paulu, Schenkkan,\nSchooley, Weld) favored our supporting the bill, with the\namendments proposed in my May 2o memorandum.\nACTION: I have requested Leonard Marks for advice as to\nhow best to bring our views to the attention of the Congressional\nCommittee in charge of the bill. I also have exchanged letters\nwith Ken Yourd of the ETRC, and have forwarded his suggestions\non the phraseology of the bill to Marks for inclusion in our\nrecommendations, if possible. (The ETRC’s suggestions would\nbroaden it to apply to community stations and the ETRC as well.)\n3. The Magnuson Bill. Your comments are quoted below:\na) GERTRUDE BRODERICK \"The Magnuson Bill, even though\nit involves the U. S. Commissioner of Education, landed in\nthis office without previous notice or consultation, so we are\nstill in the process of trying to determine just how we feel\nabout it. We are, Informally, inclined to approve the\ndesirability of such legislation and to justify the need, if"
}