{
  "id": "d643-73",
  "text": "and when we might be called upon to do so, but the tendency is\nto move cautiously until the entire matter can be analyzed in\ndetail. I shan t be surprised if your president and vice\n^residents react in somewhat this same manner.\nkike yourselj., I doubt that any legislation which is\nintroduced as late in the session as this has been will ?et\nt0 At the sam® time* 1 think it is incumbent\nupon NAB,B to keep itself informed of what may be happening to\nthe bill, and if it seems advisable, to have it scrutinized\nby such legal minds as Tel Taylov and/or Sy Krieger, in addition\nt° °ur own attorney. This, of course, could be done through\nJCST as a natural procedureo 6\n- t? little doubt here that the opponents\nor I'ederal-aid-tor-educafclon have ones more been able to defeat\nthis year s bill, and it would be my guess that this same\nopposition would wield a big stick against any other bill\nwhich would presume to federalize education through television.\"\n, VERNON BRONSON; \"Full suppoit, Federal control only\nbugaboo* J\n* t COLEMAN: ”1 do not favor the Magnuson bill and\nreel that no recommendation should be mace at this time. I do\nnot favor for several reasons. I read in the bill that\ncontrol of operation would be the responsibility of the 'State\nagency of office Primarily responsible for the State supervision\nof public elementary and secondary school*:'. This would not\nbe good except for a state network sponsorel by the state\ndepartment of Public Instruction* I do not feel that television\nis such a vital educational force that it needs federal\nsubsidation. I am certain that Federal money vsually costs\nthe state more than if it expended its own funco. in the first\nplace*\"\nd) JACK MCBRIDE: \"...my chancellor has beei following\nthe Magnuson bill as well. He indicates that sine, the bill\nhas so little chance of success at this session, an.* action as\nto the University of Nebraska be postponed for the resent.\nI would welcome any statements or comments your pres*dent or\nvice-presidents at the University of Minnesota might’have in\nthis regard, or if you should receive any important remarks\nfrom other university administrators, we would like to see\nthose as well* In this regard and because the Magnuson 'ill\ncarries such possible import, could not Headquarters collie\nany and all replies and make them available?\"\ne) R. F. SCHENKKAN: \"I need to take this matter up witi.\nmy administration, because it does raise the question you have\nsuggested of Federal-state relationships. I may say that I am"
}