{
  "id": "d643-74",
  "text": "personally very much in favor of this move and, while I\nregard its enactment possibilities as extremely dim, I plan\npersonally to plug for it wherever possible. I do not think,\nhowever, that I can make a recommendation that NAEB do so\nuntil I have consulted the administration.”\nf) BURTON *>AULU: ”1 have referred this to my adminis¬\ntration for comment, and shall withhold my reaction until I\nhear from them.”\nG) ART V/ELDs \"Cannot yet comment on Magnuson Bill.”\nACTION: I have received seven comments on the Magnuson\nBill, of which only two (Bronson and Schenkkan) strongly\nsupport. I shall delay action until more Board members have\nreplied «\n4. Legislation £2 Pro^Mg T32 Relief UHF.\nYour comments are below:\na) GERTRUDE BRODERICK: \"Agree that this is not the time\nfor action. The proposed legislation goes back to the Frieda\nHennock crusade and never seems to have gotten very far.\nIf and when something positive develops, I believe that NAEB\nshould move aggressively to support the legislation if legal\ncounsel so advises.\"\nb) VERNON BRONSON: \"Wait and see.”\nc) Ro J. COLEMAN: \"I agree that tax relief for UHF is\ndesirable. I think the bill could well include FM reception\non audio as well. (I mean the Inclusion of the FM tuning for\nthe FM radio band). As I understand this the manufacturers\ncan include the FM radio tuning for a small amount. Such\nwould help our many FM stations. I suggest that we do not make\nany proposal now but be ready to support vigorously if and\nwhen a bill is submitted.\"\nd) JACK MCBRIDE: \"As to point number four, I recommend\nthat we follow Marks8, of the JCET, suggestions of taking it\neasy until something develops to force us to report a more\ndefinite position.\"\ne) R. F. SCHENKXAN: ”1 am of the opinion that this is\nan area in which v/e should express some more dynamic leadership\nthan the JCET position allows. It seems to me that a sound\ncase can be made for the tax relief proposal both from\neducation and industry points of view, and I believe that it\nwould be sound for NAEB to take the position that television\nmay ultimately be expected to grow as radio recently has and\nthat this tax relief step provides a concrete expression of\nfaith in this future* Obviously this is a boiled down one\nreason argument, but I think that short of a full powdered\ndiscussion of pros and cons which would occupy Pages, this is\nthe best I can do in a letter which would get to you before\nAugust.\""
}