{
  "id": "d643-76",
  "text": "policy be taken out only for the August management seminar\nwith the remainder to wait Board discussion. Since I do not\nknow the extent of the coverage offered by the University of\nIllinois for the Executive Director, and the Television\nEngineer, I recommend that this decision be tabled until the\nBoard meeting. If the University of Illinois insurance is\nsufficient, then additional coverage would not be necessary.\"\ne) BURTON PAULU: \"In view of absence of legal liability\nI opDOse insurance on seminars and workshops.\"\nf) R. P. SCHENKKaN: \"It was clear to me that our sense\nat the meeting was that Dick8s motion that we take out a\nblanket liability protection policy for our workshop and\nseminars would take effect only if we were liable. I would\nnot have seconded it except under this impression. It is\nalso clear to me, as I have written McBride, that Hull8s\nmotion was not that we obtain the $25,000 limited travel\npolicy but that we investigate obtaining such a policy. In\nview of v/hat we now know, I am opposed to taking out such a\npolicy.\"\ng) ART WELD: \"Recommend retain insurance Allerton\nSeminar, but review insurance future seminars officers and\nothers.\"\nACTIONS Where do we stand?\n1) On the August television seminars in Columbus, we\nvoted to insure participants. The reactions quoted above\nares five, rescind this action (Broderick, Bronson, Coleman,\nPaulu, Shenkkan.)$ sustain it, two (McBride, Weld.)\nNow, seven is a quorum; Article VI, Section IIII of our\nBy-laws states that a majority of our Board members must be\npresent in order to constitute a quorum for a Board meeting,\nand I shall assume that that many (seven that is) may vote\nby mail to make action binding* Therefore, our Columbus\naction is reversed, unless I hear from more of you on this\npoint and quick!\n2) As to other insurance matters: Skornia is still\nauthorized to insure Bidlack and the other non-University of\nIllinois employees. I suggest we hold over other insurance\ndecisions until mail replies are more complete, and/or until\nwe can discuss them at the St. Louis Board Meeting."
}