{
  "id": "d643-92",
  "text": "V-/\nTWIN (TIV\nHutMtiig TSA--Ri»nni ill)\nI mversity of Minnesota\nSt. Paul 1, Minnesota\nKTCA TV\nAREA KDUCA\nREC\nmiK’Wa\nMAL TKI™\nOW* ST ,.M ,\nISfON CORPORATION\nMINNESOTA\nNOV 14 2 » Hi '&'/\nNovember 6, 1957\nWILL A WiUC\nuniversity of ilmm\nTelephone\nMr, Richard F* Vogl\nDirector, Region IV NAEB ■*\nWai-OM\nIowa State College\nAmes, Iowa\nDear Mr. Vogl:\nPursuant to our conversation of November 1st, may x officially inform\nyou of my intention not to recommend to tne Board of Trustees of the\nTwin City Area ETV Corporation (KTCA-TV) that the corporation should\nrenew its membership in NAEb. >y reasons for this decision ar* as\nfollows:\n1# The NAEb tabled a recommendation presented by its appro¬\npriate committee to aid in the establishment of new ETV\nstations. This resolution was endorsed by a tremendous\nmajority of the station managers assembled at Alle rten\nHouse in August and by the committee itself. Yet, with\nexceedingly brief consideration, it was denied. No sub¬\nstitute to help ETV was even proposed. This was done in\nthe face of a clear warning by Commissioner Mack that re¬\nserved channels woula not be held for ETV stations if\naction was not forthcoming to activate such channels,\n2. Another reconmendation to provide help for ETV stations\ndesiring to raise money nationally was likewise summarily\ndeclined, This was desired also by the majority of the\nETV station managers ana was approved by the committee\nwith but one dissenting vote. Again, no substitute to\nhelp the ETV stations was proposed.\n3. Since NAEB is dominated by a group of Midwestern Radio\nStations having little interest in ETV and apparently\nno interest in the Community ETV stations, I cannot con¬\nceive it to be in the interest of such stations to con¬\ntinue to support NAEB. As you know, KTCA-TV is not the\nfirst community station to leave NAEB. In n$r opinion,\nit will not be the last.\nIn I can never again recommend to my Board that they pay\ntravel expenses for me to a convention like that* held\nat St.Iouis where the major effort of the convention was\ndevoted to the production of «n amateur theatrical, and\nwhere the lack of constructive action detailed in 1 «id\n2 above apparent)y caused no misgivings whatever on the\npart of the Ot «srs and Board of Directors®"
}