{
  "id": "d1298-0",
  "text": "N-A-E-B NEWS-LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nEdited by Harold A. Engel, President\nStation WHA, University of Wisconsin, Madison, Wisconsin\nJune 25 1947\nCI-EAR CKANMEL HEARINGS JULY 7\nThe FCC has announced the postponement of the clear channel hearings from\nJune 2 to July 7*\nNAEB, in behalf of member stations operating with limited power on clear\nchannel frequencies had asked for additional tme for testimony by these members.\nPUBLIC SERVICE RADIO INSTITUTE\nH.B. IfcCarty wants to issue a very special invitation to all NAEBers to come\nto liadison for the University of ’''isconsin’s Public Service Radio Institutes July 28-\nAugust 6. He has lined up an impressive list of top-notch specialists and assures\n.us that they will get down to practical cases.\nThe 10-day session will provide opportunities for recreation as well as study.\nLiving accommodations are available at nominal cost in lake-shore campus houses.\nInstitute fee $10.00. If you didn't get a detailed schedule, write to Kac.\nSCHOOL RECEIVERS PROITSED\n. George Jennings, v/ho has been struggling with the school-receiver problem in\norder to enable his FM station to be listened to in Chicago class-rooms, reports a\ndevelopment which gives what he calls \"a ray of hope\".\nZenith expects by fall to be in production with a school table model FI'-A!:\nreceiver in the $60.00 class. These v/ill not be sold through dealers, but v/ill go\ndirectly to school systems (to hold down the cost).\n; George is making a survey of expected needs so a production schedule can be\n; set up. linyone knowing of school systems ¥/ishing to get such receivers should get\n! in ti^uch with him at once. (228 N. LaSalle 3t., Chicago).\n' K^'^SC TESTS TAPE RECORDER\nI Chief Engineer George Fr.ese of KITSC is working with a German-type tape recorder\ni. manufactured in this country along lines of a model he used in Germany v/hile serving\ni with \"Radio Berlin\" follov/ing the cessation of hostilities. He says the quality\n: of reproduction is superior to that of the usual tape-recorders.\n: - \"The tape\", says Frese,'*is simply paper v/ith an extrem-ely fine ferrous coating,\n■ A definite advantage is its excellent v/earing quality. It can be spliced, edited\n[ easily, and erased for re-use several thousand times\".\n[ ITS HICHIGAN\n? '\"aldo Abbot, after a year of negotiating, has secured call letters to sub¬\nstitute for the '.7ATX previously assigned to the University of i:ichigan’s FM station,\nis the new call. The station is now being built on Peach Mountain near\nVice-President\nTreasurer\nExecutive Secretary\nExecutive Committee\ni Robert J. Coleman\nW. I. Griffith\nM. S. Novik\nWaldo Abbot, Michigan\nMilford C. Jensen, WCAL. St. Olaf\n: WKAR\nWOI\n30 Rockefeller Plaza\nJohn W. Dunn, WNAD, Oklahoma\nJames S. Miles. WBAA, Purdue\n^ East Lansing, Mich.\n1-\nAmes, Iowa\nNew York, N. Y.\nRichard B. Hull. WOI, Iowa Stale\nRussell Potter, Columbia"
}