{
  "id": "d1298-3",
  "text": "can to foster the best interests of educational broad'\ncasting, regardless of its possible impact on the as¬\nsociation. The NAEB is a self-help organization in\nwhich we “associate ourselves to promote, by united\neffort and mutual cooperation, the dissemination of\nknowledge, information and education to the end\nthat . . . benefits of broadcasting may be extended\nto all.” If others are better able and more competent\nto carry out certain aspects of this purpose, more\npower to them. The NAEB role in organizing the\nJCET and creating the Center testifies to this con¬\nsistent attitude. Moreover, the present officers of the\nNAEB believe the needs of our nation transcend\nthe association and personal considerations.\nIn our view, the time has come to forget petty\njealousies and old wounds and get on with the job—\nmobilizing our efforts toward common goals by de¬\nveloping a unified, coordinated, mutually supporting\nmodus vivendi within the general frame of a network\nand trade association relationship. As Loren Stone\nexpressed it, it is time to stop thinking in terms of\n“us” and “them” and think instead of “we.” What\nare we going to do?\nThe Center people agreed fully and it was in\nthis mood of mutuality that the discussion was car¬\nried on. The results: a much better understanding\nof our respective purposes, agreements on coordinat¬\ning activities, and a shared determination to make a\nreal effort toward not mere peaceful coexistence, but\npurposeful co-effort.\nNow, let me reassure some. I am fully aware of\nthe risks of riding a tiger or lifting the tent flap for\na camel. And NAEB, despite its willingness to co¬\noperate, is equally determined to adhere to certain\nprinciples and have care for certain concerns. The\nPLACEMENT SUPPLEMENT\nFebruary I — Oxford University (England) M. A. in modern\nlanguages, 34, unmarried, seeking post as director in\nETV in eastern U. S. Ten years of teaching experience,\n21/2 years associate director in TV in Canada. $6500.\nFebruary 2 — -Married, 21, good music announcer with B. A.\nin radio and TV, seeking full-time employment in edu¬\ncational radio. Experienced in commercial and educa¬\ntional broadcasting. Knowledge of music and current\nevents. Tape available on request. $5000.\nFebruary 3 — Male, married, 29, Korean veteran with B. S.\nin radio and TV production, desires position as pro¬\nducer-director. $5000, any location.\nFebruary 4 — Ten years of diversified experience in radio and\nTV with teaching background. B. S. degree, working\ntoward M. S. Married male, 40, seeking return to edu¬\ncational field of broadcasting and/or teaching. Any\nlocation; $5200 minimum.\nFebruary 5 — Creative educator, with college background. \"A\"\nstudent in production and writing, working on Ph.D. in\nETV. Seven years of teaching experience on all levels. In¬\nterested in summer or full-time position. Knows studio\nprocedures in direction-production. Prefers Northeast,\n$7500.\nFebruary 6 — Male, 27, single, MA (speech-dramatic art),\ndesires position with progressive educational radio, film,\nor TV activity. Slight preference for Southwest. $6200\nminimum. Presently program director of educational\nradio, TV, and film facility. Competent in all three\nareas.\nNAEB, whose principal resource is people, has a re¬\nsponsibility to see to it that the mobilization of effort\nin use of the new media in the service of education\nremains subject to democratic control. As Harry\nSkornia has often said, there is a deep feeling in our\nassociation that these instruments in careless or un¬\nskilled hands or controlled by thpse who would\nexploit them can be most dangerous. It will always\nbe our obligation as a grass-roots bastion to see to\nit that these devices are responsibly used as power¬\nful forces for enlightenment.\nHowever, we would be derelict if we did not\nexplore all reasonable possibilities for organizational\ncooperation. No one group can do the job alone.\nA diversity of organizations is needed. But so\nis recognition of the necessity for all to yield some\nsovereignty to the common effort. The NAEB reaf¬\nfirms its offer to cooperate with all groups who are\nresolved that these tools are to be used for the bene¬\nfit of humanity and who are resolved that individual\ndifferences must yield to these higher needs.\nThese needs, of our country and the world, are\nof such compelling concern as to deserve an uncom¬\nmon degree of mutual understanding, trust, and co¬\noperation by diverse interests. We must have faith\nthat rational persons, having confidence in the dignity\nof each other, will work things out together for the\ngood of all.\nIf the tandem harness with NETRC does not\nwork out, another Lincoln story may be appropriate:\nA letter from General McClellan telling him how to\nrun the country reminded him, Lincoln said, of the\nIrishman whose horse kicked up and caught a foot\nin the stirrup. “Arrah!” said the Irishman, “If you’re\ngoing to get on, I’ll get off.”\n—Bill Harley\nPago Pago Needs Tapes\nA request has been received for NAEB stations to\nsend educational tapes for experimental use in the\nschools of American Samoa. These would be used\nin in-service classes for supervisors, the teacher-train¬\ning college, the demonstration school, the dependents’\nschool, and the high school. Especially needed are\nmusic tapes, both monophonic and stereophonic, and\ndiscussion programs on current national and inter¬\nnational events which would serve as an introduction\nto the outside world for Samoan students and teachers.\nContact M. T. Hollingsworth, superintendent of ele¬\nmentary education, Government of American Samoa,\nPago Pago, Samoa.\nNew NAEBers\nLast month brought a new Active member (and Ra¬\ndio Network member) — Ripon College, Ripon, Wis¬\nconsin — and a new Associate member — Mendocino\nState Hospital, Talmage, California. Among the new\nIndividual members are twelve students signed up\nby Donald W. Hansen, manager, KSTE-FM, Kan¬\nsas State Teachers College, Emporia.\n4\nNEWSLETTER"
}