{
  "id": "d575-1",
  "text": "Kay 17, 1962\nMr* J. Daniel Logan\nstation Manager\nStation WDET\nV?'ayne State University\nDetroit 2, Michigan\nDear Mr* Logans\nLee Dreyfus has told me of your interest in becoming active in MEB cor^dttee vork,\nand he has high praise for your energies and abilities#\n*e are delighted, of course, because it is only through the very fine support we\nget from members such as yourself that we are able to do the tasks the Association\nfinds necessary in order to properly serve the educational broadcasting field*\nka you perhaps know, committee assigruaents are aaoe shortly after the first of each\nyear, with appointments running for three year®, re have found that this lends\ncontinuity to committee activity ami at the same time provides enough turnover to\ninvolve more members in committee work and permit the insertion of new ideas* In\nthe last two years we have endeavored to eliminate all dual assignments so that\nnow only a small number of our 206 committee member® serve on more than one committee,\nand these, too, will be eliminated a® dual terms expire. Also, in order to have\ncommittees of a siae to permit work to be done expeditiously, we have limited com¬\nmittees to ten members each.\nAll of the above is merely to explain that while we can't add you officially to a\ncommittee at this time, we will certainly add you when new committees are appointed\nin January, and, in the meantime, by a copy of this letter 1 am informing Mr* £>• G.\nBurrows, Manager, Station WOK, University of Michigan, Ann Arbor, Michigan, chair¬\nman of the NAKB Network Program committee, that he may feel free to call upon you\nfor help — Lee Dreyfus had indicated that he thought you would be extremely help¬\nful to this committee.\nAgain, thanks for your interest in helping with the work of the Association, and\nyou can be sure that we will be calling on you in the important month® ahead.\nSincerely,\nHarold E. hill\nVice President\nHEHsabfc\nccs Lee Dreyfus\nE* G* Burrows"
}