{
  "id": "d144-114",
  "text": "ALABAMA EDUCATIONAL TELEVISION COMMISSION\n2151 highland AVENUE BIRMINGHAM. ALABAMA 35205\nWAIQ, CHANNEL 2Q WBIQ, CHANNEL 10 WCIQ, CHANNEL 7 WDIQ, CHANNEL 2\nCOMMISSIONERS OCtObST li|., 19&4-\nROBERT L. HARPER\nABBEVILLE\nCLELL L. HOBSON\nCENTREVILLE\nVINCENT F. KILBORN\nMOBILE\nMRS. BERTHA S. ROBERTS\nGADSDEN\nJAMES R. SWEDENBURG\nREFORM\nMrs* Marion Corwell\nAssociate Director\nDearborn Public Schools\n5757 Neckel Road\nDearborn, Michigan\nTELEPHONE 322-4625\nWEIQ, CHANNEL 42\nPROGRAM BOARD\nD. P. CULP\nMONTEVALLO\nRALPH DRAUGHON\nAUBURN\nAUSTIN R. MEADOWS\nMONTGOMERY\nFRANK A. ROSE\nUNIVERSITY\nTHEO WRIGHT\nBIRMINGHAM\nSTAFF\nRAYMOND D. HURLBERT\nGENERAL MANAGER\nAL RENFRO\nCHIEF ENGINEER\nLOUIS PENEGUY\nDIRECTOR\nCOORDINATION & INFORMATION\nMRS. MADGE LAW\nOFFICE MANAGER\nDear Marion:\nI *m back raring up my head with another\nNAEB PR suggestion.\nTwo jears ago you may recall that I\nsuggested that NAEB join with NET in the develop¬\nment of a static New York World!s Fair exposition\ndisplay* At that time, Mr. Harold Hill said that\nNAEB had previously thought of this idea, and\nhad investigated it, only to find it too expen¬\nsive a venture.\nI'm back suggesting it be thought of again.\nIf you attended the Fair this summer, you\nwill agree that the Hall of Education contained\nvery little dealing with education. It is my\nunderstanding that the Fair Authority had many\nof those who originally planned to exhibit in\nit fall through. As a result, it is basically a\nvendor-house which includes a cafeteria and a\nkosher delicatessen. I believe an investigation\nwould find the Fair Authority permitting TV\neducators exhibit in this Hall for little or\nno rental. I believe, also, the Fair will have\nas large an audience as it had this year.\nAm always eager to see ETV promoted.\nLou Peneguy, Director\nCoordination and Information\nLP/nc\ncc: Mr. Harold Hill\nMr. Jack White\nThe nation’s first educational television network telecasts programs simultaneously over four channels, which are originated by Auburn\nUniversity, the Birmingham Area Educational Television Association, and the University of Alabama. National Educational Television\n(NET) programs are provided to the network by the University of Alabama. Independently operated WEIQ-TV is also a NET affiliate."
}