{
  "id": "d144-12",
  "text": "Television Information Office\nOF THE NATIONAL ASSOCIATION OF BROADCASTERS\n666 FIFTH AVENUE, NEW YORK 19, NEW YORK, PLAZA 7-4600\nLAWRENCE CRESHKOFF\nExecutive Editor\nApril 11, 1963\nMiss Marion Corwell\nDearborn Public Schools\n5757 Neckel\nDearborn, Michigan\nDear Marion:\nIn response to your letter of April 5, may I offer a few comments about\nthe possibility of publishing an NAEB speakers directory?\nHaving examined the NAB version, I have some reservations about the\nusefulness and practicality of this particular approach. For one thing,\nit is fairly inflexible unless NAEB were to undertake to revise and redis¬\ntribute it at least annually. This could become a fairly costly project.\nSecondly, it seems to me that some provision should be made for more\nspecific breakdowns of areas of competence, i.e., production, programming,\netv-the big picture, technical aspects, and so on.\nI wonder if it might not be more effective to organize the speakers bureau\non a regional basis, using the various regional headquarters as clearing\nhouses for speakers. Thus, a questionnaire could be sent to all members,\nthe information transferred to file cards, cross-referenced by subjects,\nwith twft.^Pit„s of files set up — a national master file at Washington or\nUrbana, and a regional file at each of the regions.\nBy publishing a brochure listing the availability of speakers and distributing\nthis through appropriate channels, inquiries could be invited to the regional\nheadquarters, where some degree of control could be maintained over how\nmany invitations go to which people. Among other things, this would give\nthe regions something constructive to do.\nI am enclosing for your interest, a copy of the Speakers Bureau Volunteer\nForm sent out by the Academy of Television Arts and Sciences. The\naspect that I remember from the original form, however, seems to be missing:\nChairman: Clair R.McCollough Stemman Stations, Lancaster, Pennsylvania. Lester Bernstein National Broadcasting Company, New York, New York. Roger W.Clipp Triangle Publications, Inc. Philadelphia,\nPennsylvania. John P. Cowden CBS Television Network, New York,New York. Joseph C. Drilling WJW-TV, Cleveland,Ohio. Michael J. Foster American Broadcasting Company, New York.\nNew York. C. Wrede Petersmeyer Corinthian Broadcasting Corp.,New York, New York. J, S. Sinclair WJAR-TV, Providence, Rhode Island. Willard E, Walbridge KTRK-TV, Houston, Texas"
}