{
  "id": "d144-15",
  "text": "OFFICERS\nSTATE OF ARKANSAS\nMEMBERS\nT. E. “TOM” TYLER\nPRESIDENT\nC. C. GIBSON, JR.\nVICE-PRESIDENT\nMRS. O. P. HAMMONS\nSECRETARY\nT. E. “TOM” TYLER, LITTLE ROCK\nC. C. GIBSON, JR., JEROME\nMRS. O. P. HAMMONS, FORREST CITY\nMRS. J. R. SINK, NEWPORT\nMRS. WARREN M. DOUGLAS, JONESBORO\nCLARENCE HIGGINS, FORT SMITH\nARKANSAS EDUCATIONAL TELEVISION COMMISSION\n1010 West Third Street\nLITTLE ROCK, ARKANSAS\nApril 16/ 1963\nMr. Marion Corwell\nAssociate Director\nDearborn Public Schools\n5757 Neckel\nDearborn/ Michigan\nDear Mr. Corwell:\nI was somewhat surprised when I read your letter of\nApril 9. I knew that I had been appointed to the ETV Com¬\nmittee, but I did not know that I was also appointed to the\nPublic Relations Committee. However, I am happy to do what¬\never I can to make whatever contribution possible. As to\nAudio-Visual Directories, I do not have them in my files nor\ndo I recall receiving them unless my former secretary has\nfiled them in “file 13.\" Therefore, I will leave the pattern\nof composition to you and others on the Committee.\nAs to locating competent speakers and the procedure,\nI definitely would recommend questionnaire type inquiry. As\nto subject matters to speak on, I would say something within\nthe scope of ETV. Of course, we all know that utilization,\ncoordination, and quality instead of quantity should be stressed.\nIn fact in my observance of other states in their operation,\nthese three items seem to be the key to a successful and accept¬\nable utilization of this new media. Of course, you must realize\nthat we in Arkansas have worked hard since 1957 to bring ETV\nto Arkansas, but until this Session we had made very little\nprogress except for the creation of a commission. I did not\nmake a definite statement other than from observation. I do\nbelieve that one of the main inferences should be on financing\nthe different methods used by the various states to be analyzed\nfrom these inquiries, then utilized to the extent of stressing\nstate support* along with Federal funds.\nAs you know, I have been a strong supporter of Federal\ngrants to ETV. I am firmly convinced that if the President\ndesires to give assistance to improve education, this new media\ncan make a great contribution. I am hopeful that I will see the\nday that matching funds will also be made available."
}