{
  "id": "d144-28",
  "text": "NAEB HEADQUARTERS\n1346 Connecticut Avenue, N.W,\nWashington 36, D.C.\nMEMORANDUM\nTO: NAEB Public Relations Committee\nBetty McKenzie\nFROM: Harold E. Hill\nDATE: June 21, 1963\nThe staff recently discussed the possibility and feasibility of some sort\nof special observance \"day\" or \"week\" for educational broadcasting. As\nan initial step, recalling the great interest of Lee Dreyfus in such a\nproject a few years ago, we wrote him for any suggestions and ideas he\nmight have. Lee returned some excellent ideas, which are reproduced\nbelow, and the staff discussed the whole idea with the Board of Directors\nat the time of its meeting in Columbus last week. The Board directed\nus to refer this matter to your committee for consideration and recom¬\nmendations.\nSuggestions by Lee Dreyfus:\n”. . .In terms of an educational broadcasting week or day, I would sug¬\ngest the following: first, I think it should be a week rather than a\nday in order to implement the involvement of commercial broadcasters.\nIf you attempted in a large city to involve all the commercial broad¬\ncasters in the same day, you would find a great deal of reluctance on\ntheir part, I am sure. They need some flexibility in terms of giving\naway public service time. I would suggest that every commercial station\nbe enlisted through the networks, through local arrangements and through\nthe NAB, to do a program saluting their local educational broadcasters,\nto air a \"sampler\" which would be produced by the local broadcaster,\nand to provide top management talent to appear on the local broad¬\ncasting station for purposes of discussion concerning the role to be\nplayed in the community as it relates to the commercial field.\n\"I think that this can be further implemented by the direct establish¬\nment of this week in terms of a proclamation by the president. This,\nI feel, can be obtained through the concerted effort of members of\nCongress who would be prompted by the entire educational broadcasting\nfield. It could also be implemented through the HEW and through the\ngood offices of the NAEB. It would seem reasonable to me to request\nthis kind of proclamation from the governors of state as well. It\nmay even beliabetter move to work on 50 governors at one time rather\nthan to make this a national thing.\n\"In terms of special programing, I would suggest that some program be\ndeveloped involving national personalities for distribution on the NAEB\nnetwork and for television distribution. This could be done by the\nNAEB, though I do not wish to get into that fight at the moment, or\nsimply to coordinate with NETRC on the matter. In this way, both\naudio and video tapes could and would be available. I think it would"
}