{
  "id": "d144-38",
  "text": "NAEB HEADQUARTERS\n1346 Connecticut Avenue, N.W\nWashington, D.C. 20036\nMEMORANDUM\nTO: All NAEB Committee Chairmen\nFROM: Harold E. Hill\nDATE: August 15, 1963\nWith the rapid developments in our field, it is important that\nour membership be informed of those matters which concern\nthem. Cursory mention in the Newsletter or Washington Report\ndoes not give sufficent information in depth to keep members\nwell informed. What is needed is some sort of series of reports\nwhich could Me sent to the membership as the situation warrants.\nThese reports might cover such topics as the 2000 me ETV system,\nFM allocations in the educational band, copyright, professional\nrights, and so on.\nThe staff is not large enough to permit the preparation of\nsuch reports with any degree of regularity. However, if the\nvarious committees were to prepare such reports (to be duplicated\nand distributed by Headquarters), the burden for any one\ncommittee would not be too great, since reports would be\nassigned to whichever committees were concerned with the par¬\nticular matter under consideration.\nThe staff recognizes the fact that we have not been availing\nourselves of the expertise, experience, and knowledge of the\nmembers throughout the country. We need a mechanism which\nwill bring to bear these capabilities on the many important\nmatters facing educational broadcasters, and which will make\nthe results available to the entire membership. We believe\nthe proposed series of reports may provide such a mechanism.\nAs matters of importance and concern came up, Headquarters\nwould ask a particular committee to prepare a brief report.\nWhen sent to Headquarters, the reports would be duplicated\n(on a standard report masthead, with some such title as \"NAEB\nSpecial Report\") and distributed to the membership. Naturally,\nthe committee would be given credit for the preparation of\nthe report. The reports would be numbered and would, collec¬\ntively, provide valuable reference material.\nNaturally, we would hope that each committee would be on the\nlookout for suitable report subjects in addition to those\nreferred by Headquarters."
}