{
  "id": "d144-44",
  "text": "DEARBORN PUBLIC SCHOOLS\n575*7 NECKELf DEARBORN, MICHIGAN\nLUzon 1-2Q18\nSchool Relations\nSeptember 25, 1963\nMr. Lou Peneguy, Director\nCoordination and Information\nAlabama Educational Television Commission\n2151 Highland Avenue\nBirmingham 5» Alabama\nDear Lou:\nThank you very much for your letter of September 23.\nYour idea to tape our NAEB PR session is excellent. Would-you\nplease make the arrangements? I'd be most grateful to you, since\nmy talents are non-technical. I'd appreciate your bringing audiotape\n^enough for a full hour and possibly a few minutes more of discussion).\nWouldn't we need two recorders to keep the tape in continuous motion....\nOr would you record an hour on one tape at 3-J-?\nSince you will be relieved of recording the session, would you\nparticipate as a panel member? I'd like very much for you to present\na blueprint for television stations to follow in promoting their stations,\nas well as in establishing more effective community relations.\nLeontine Keane, Director of Radio-TV Publicity for Wayne State\nUniversity's WDET, will cover radio relations, you'll cover TV, and\nEd Pfister, Chief of Information Services at NET, will, talk in general\nabout ways in which educational outlets can promote their program offerings *\nThere will undoubtedly be some overlap of ideas, but I thought we could\nhave lunch together that day and discuss our presentations. I also hope\nto have the results of a survey conducted by a Master's candidate from\nMichigan State University to determine PR practices in our ETV Stations\nthroughout the U.S.\nkave se\"k our PR Committee meeting for Wednesday (November 20) noon,\ne 11 have lunch together, then continue the sessions until about 2 p.m..\nThat should make it easier for all of us.\nPlease send me some biographical data about yourself for use in my\nintroducing you as well as for preconvention publicity.\nAll the best,\n-✓\nMarion Corwell\nMC/ejh Associate Director\ncc: Harold Hill"
}