{
  "id": "d144-58",
  "text": "Gregory, Robert L., Principal, Jersted-Agerholm Elementary, Racine Unified,\n3535 LaSalle Street, Racine, Wisconsin.\nHafier, Arthur C., Chief Engineer, WTHS-TV, WSEC-TV, Miami, Florida.\nHansen, Burrell F., Chairman, Radio-Television, Utah State University, KUSU-FM,\nLogan, Utah.\nHayden, J. Roger, Manager, Tower Sales, Dresser IDECO Company, Columbus 9» Ohio.\nHoban, Charles F., Professor, Annenberg School of Communications, University of\nPennsylvania, Philadelphia 4, Pennsylvania,\nHumphrey, William G., Principal, Howell School, 1734 Washington Avenue,\nHunsader, Roland, Director of Instruction, Public Schools, Fort Atkinson, Wisconsin.\nIckes, Donald W., NNTH-FM, New Trier Township High School, Winnetka, Illinois.\nKaiser, Lloyd, LTV Consultant, Rochester City District, 410 Alexander Street,\nRochester, New York.\nKamerer, John, Manager, TV Division, Central School Supply, 315 W. Main, Louisville,\nKentucky.\nKanen, George C., Marketing Manager, Lntron, Inc., Silver Spring, Maryland.\nLeGrand, Roger, General Manager, WITI-TV, 5445 North 27th, Milwaukee, Wisconsin..\nLian, F.S., Head, Audio-Visual Unit, Teachers' Training College, Paterson Road,\nSingapore 9.\nLois, Sister M., O.S.F., Supervisor-Consultant, Catholic School Board, 205 W.\nWacker Drive, Chicago, Illinois.\nLouis, Brother, F.S.C., Senior Principal, St. Patrick High School, 5900 W. Belmont,\nChicago, Illinois.\nLynch, Rev. C.E., S.J., Audiovisual-ETV, University of San Francisco, San\nFrancisco 17, California.\nMcBride, Jack, Director of Television, Station KUON-TV, University of Nebraska,\nLincoln 8, Nebraska.\nMaciolek, Jeanne, Public Information Assistant, WHA Radio-TV, Madison, Wisconsin.\nManske, Richard G., Superintendent, Oostburg Area Schools, 110 North 9th Street,\nOostburg, Wisconsin.\nMark, Sister, S.P., Principal, Catholic Schools of Chicago, 2514 Ashland Avenue,\nEvanston, Illinois.\nMary Jogues, Sister, O.P., Coordinator, TV Programs in Catholic Schools, Archdiocese\nof Milwaukee, Catholic Office of Education, 437 West Galena Street, Milwaukee.\nMavrides, Bill, Director of Television, University of Akron, Akron, Ohio.\nMigacz, E. A., Instructor (Radio-TV), UWM, University of Wisconsin-Milwaukee,\nNorth Downer Avenue, Milwaukee.\nMikula, B.E., Head, A-V Education and CCTV, Morton Schools and Junior College,\nCicero-Berwyn, Illinois.\nMohamed, Omer Mohamed, Programme Assistant, Radio Somali, Hargeisa, Box 14,\nSomalia.\nMorrill, H.J., Photographer, Milwaukee Public Schools, 5225 W. Vliet, Milwaukee.\nNelson, jiarl, Elementary Principal, Unified School District #1, Racine, Wisconsin.\nNelson, Phillip C., Student Assistant, KUON-TV, Lincoln, Nebraska.\nNesbitt, Prudence, TV Director, Associated Rediffusion London, 1235 Chesterfield,\nBirmingham, Michigan.\nNeustadt, Stanley J., Attorney, Cohn & Marks, 317 Cafritz Building, Washington 6, D.C.\nNicholas, Sr. M., C.S.J., Supervisor-Consultant, Chicago Catholic School Board,\n205 W. Wacker Drive, Chicago 6, Illinois.\nNichols, Herbert L., Chief Engineer, English Language Service, 800 18th Street,\nN.W., Washington, D.C.\nPaltridge, J.G., Statewide Coordinator, ETV, University of California, Berkeley."
}