{
  "id": "d144-64",
  "text": "ALPHA KAPPA PSI\nProfessional Business Fraternity\nMarch 16, 1964\nDear Brother A, K. Psi:\nThe Alpha Kappa Ps i Foundation is to present its 1963 award for distinguish¬\ned service and accomplishment in accounting to Mr * Andrew Barr, C.P.A. and chief\naccountant for the Securities and Exchange Commission.\nMr. Barr received his B.S. from the University of Illinois in 1923, his M.S.\nin 1924, and then took graduate work in economics at Yale. After two years in\npublic accounting, he taught accounting at Yale. In 1938, he became a staff\naccountant for the SEC and became chief accountant in 1956. Mr. Barr received\nthe career service award of the National Civil Service League in 1955 and the\nU.S. award for distinguished federal civilian service in 1960. He has served as\npresident of the Federal Government Accountants Association, vice-president of\nthe American Accounting Association, and as president, vice-president and direc¬\ntor of the Washington Chapter of the National Association of Accountants.\nMr. Barr is to receive the A, K. Ps i Foundation’s award at a banquet to be\nheld in his honor in the Hunt Room of the Continental Hotel, North Capitol St.,\nN.W., between D and E Streets, at 7:00 P.M. on Saturday. April 11. 1964. Joint\nhosts for the banquet are Beta Mu Chapter at George Washington University and\nthe Washington Alumni Chapter of Washington, D.C.\nAll members of Alpha Kappa Psi in the greater Washington area are invited\nto attend the banquet honoring Mr, Barr, In addition to providing the two host\nchapters the opportunity to honor an outstanding' accountant in the service of the\nFederal Government, it is hoped that the occaslon. wi11 enable Washington area\nmembers of A. K. Psi to get together in a spirit of fraternal fellowship. The\nWashington Alumni Chapter is especially desirous of meeting and welcoming A. K.\nPsi alumni now living in the Washington area who are not members of the local\nalumni group.\nThe ladies are also invited, so bring your wife or girl friend if you desire.\nReservations for the banquet are necessary so that the Continental Hotel can make\ni proper arrangements. Cost of the banquet is $4.50 per person. Please send check\n' for reservations in advance to:\nRussel A. Arlotta\n1309 Dilston Road"
}