{
  "id": "d144-80",
  "text": "National Association of Educational Broadcasters\n134 6 CONNECTICUT AVENUE\nWASHINGTON 36, D. C.\nWILLIAM G. HARLEY\nPRESIDENT\nSeptember 23, 19 64\nDear Member:\nEnclosed you will find, in addition to a copy of the existing Articles of\nIncorporation of NAEB, copies (1) of proposed amendments to such Articles\nand (2) of proposed new Constitution and By-laws, both of which the Board\nwill submit to the membership for approval at the annual meeting in Austin.\nThese new Constitution and By-laws have been prepared notwithstanding the\nfact that our existing Constitution and By-laws were adopted only last year\nat our meeting in Milwaukee. I want to explain to you why we think it\nnecessary that they be revised so soon again.\nOur existing Constitution and By-laws were prepared, under considerable\npressures of time, to provide an immediate framework within which the\nDivisions of NAEB could operate as functionally independent departments\nwithin an effective common organization. They have served this purpose\nwell and we are now on our way towards developing NAEB as a vital organi¬\nzation representing the mutual interests of its entire membership while at\nthe same time placing maximum authority in the individual Divisions to\nhandle their own affairs and solve their own problems.\nDuring the past year, we have examined our existing By-laws to determine\nhow successfully they spell out this reconciliation of purpose between our\ncommon interest in educational broadcasting and the more specific interests\nof our Divisions. We wanted to make certain that the By-laws are in all\nrespects absolutely clear and unambiguous by their own terms and that, at\nthe same time, they fully comply with the legal requirements of the Illinois\nNot-for-Profit Corporation Law (under which NAEB is organized) which requires\nthat the ultimate authority for the affairs of a corporation be placed in the\nfull Board of Directors. Counsel feels that the present By-laws are not clear\non this point and questions might be raised as to their legality. We have\nalso been aware of many recent developments in Federal law affecting the\nstatus of tax-exempt, non-profit organizations and particularly of changes\nin the organizational requirements promulgated (since the NAEB was first\nincorporated as a tax-exempt organization in 1952) by the Commissioner of\nInternal Revenue.\nAccordingly, we employed outside counsel to evaluate the activities and\norganizational structure of NAEB with a view to assuring us that NAEB is in\nall respects organized and operated as a tax-exempt educational organization\nand that its Articles of Incorporation, Constitution and By-laws are both"
}