{
  "id": "d144-81",
  "text": "-2-\nclear and complete and fully in accord with the requirements of Illinois law.\nI am happy to report that we have received a clean bill of health with respect\nto the activities of our organization; but in order to assure that our organi¬\nzational set-up complies in all respects with the current requirements of\nFederal and Illinois law, counsel has recommended the adoption of the\nenclosed amendments to our Articles of Incorporation and the proposed\nConstitution and By-laws.\nI wish to emphasize that the proposed By-laws are not intended to make any\nsignificant substantive changes from the existing Constitution and By-laws,\nparticularly insofar as the relations of the NAEB Board and the Division Boards\nare concerned. Our purpose has been entirely to define and clearify this\nrelationship, continuing to place maximum independence in the Division Boards\nconsistent with the requirements of Illinois law.\nI am sure that, once the enclosed proposed Articles of Incorporation and\nConstitution and By-laws are adopted, we will have a permanent structure\nwhich will only require change in particulars, from time to time, as experience\nwarrants. They should provide a stable framework within which educational\nbroadcasting can develop, promoting simultaneously both the common and\ndiverse interests of its members.\nUnder the present By-laws, proposed amendments must be submitted to the\nmembership by the Board of Directors prior to membership vote. The Board\nof Directors has approved the submission of these proposed Constitution\nand By-laws. May I urge you to read these carefully, and if you have any\nsuggestions to make, forward them to the chairman of your Division Board\nin advance of the Convention. A general discussion of the proposals will\nbe held at the first business session on Monday, October 2 6. There will\nbe sufficient time allotted for you to ask questions. No action on the\nproposal will be taken until the final business session on Wednesday,\nOctober 2 8. This will provide ample opportunity for the members to discuss\nthe matter with others at the Convention. At the final business session,\nthere will be another opportunity for questions and discussion before the\nvote is taken.\nIf approved, the new Constitution and By-laws will take effect on\nJanuary 1, 19 65. PLEASE BRING THIS COPY WITH YOU TO THE CONVENTION.\nSincerely\nWilliam G. Harley\nWGH;mab"
}