{
  "id": "d144-85",
  "text": "(Proposed - 8/25/64)\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nConstitution\nand\nBy-laws\nPreamble\nBelieving that radio and television broadcasting are most important factors\nand influences in the national and international welfare, we, the representatives of\neducational, cultural and public service non-profit institutions engaged in educa¬\ntional and cultural broadcasting, and individuals interested in the furtherance of\neducational broadcasting, do associate ourselves as The National Association of\nEducational Broadcasters to advance, by united effort and mutual cooperation, the\ndissemination of knowledge, information and education by and concerning radio\nand television broadcasting to the end that the educational, cultural and technical\nbenefits of broadcasting may be extended to all; to produce and distribute educa¬\ntional programs for non-profit educational purposes; to further the study and in¬\nvestigation of problems in education by radio and television; to further research\nin the educational uses of radio and television and their employment for the im¬\nprovement of instruction at all levels of public learning; and to coordinate efforts\nof educational institutions in all areas of broadcasting and television. The state¬\nment of purposes contained in this Constitution and By-laws are intended to imple¬\nment (but not to state purposes or authorize powers different from or in addition\nto) those purposes for which the National Association of Educational Broadcasters\nwas organized as set forth in its Articles of Incorporation.\nARTICLE I\nOffices\nSection 1.01. Registered Office. The registered office of National Broad¬\ncasters (hereinafter called NAEB) shall be in Urbana, Illinois.\nSection 1. 02. Other Offices. NAEB may also have offices at such other\nplaces, either within or without the State of Illinois, as the Board of Directors may\nfrom time to time authorize. The principal office shall be in the District of\nColumbia.\nARTICLE II\nMembers and Associates\nSection 2. 01. Classes of Members. NAEB shall be composed of the follow¬\ning members:\n(a) Institutional Members\n(b) Institutional Affiliate Members\n(c) Individual Members\n(d) Honorary Members\n-4-"
}