{
  "id": "d144-86",
  "text": "Section 2. 02. Eligibility.\n(a) Institutional Members. Any university, college or school which is an\nagency or instrumentality of any government or any political subdivision thereof,\nor which is owned or operated by any government or any political subdivision\nthereof or by an agency or instrumentality of one or more states or political sub¬\ndivisions, or which normally maintains a regular faculty and curriculum and nor¬\nmally has a regularly enrolled body of students in attendance at the place where\nits educational activities are regularly carried on, or any other educational, cul¬\ntural or public service organization of recognized standing which is engaged in\neducational, cultural or public service non-commercial broadcasting from a radio\nor television station which is recognized as being under the control of such organ¬\nization by the Federal Communications Commission, or which is engaged in the .\nproduction or broadcasting of radio or television instructional or cultural programs,\nor which operates closed circuit television equipment for direct instruction pur¬\nposes, may be elected to Institutional Membership, provided, however, that any\nsuch institutional member shall be organized and operated exclusively for educa¬\ntional purposes, or for any other purpose described in Section 501(c)(3) of the In¬\nternal Revenue Code of 1954, as amended, or any successor provision thereto,\nand that no part of its net earnings shall inure to the benefit of any private share¬\nholder or individual.\n(b) Institutional Affiliate Members. Any university, college or school, or\nother educational, cultural or public service organization that would qualify as an\nInstitutional Member but for the fact that it does not operate a radio or television\nstation or closed circuit television transmission equipment may be elected to\nInstitutional Affiliate Membership.\n(c) Individual Members. Any individual engaged in educational broadcasting\nor in teaching broadcasting courses, or any individual seeking to advance educational\ncultural or public service broadcasting may be elected to Individual Membership.\n(d) Honorary Members. Any individual who shall have made a significant\npersonal contribution to educational, cultural or public service broadcasting may\nbe elected to Honorary Membership.\nSection 2.03. Associates. Any organization, association, firm or broad¬\ncasting system (other than an individual) desiring to cooperate with NAEB in fur¬\nthering the development of educational, cultural or public service broadcasting\nmay be elected an Associate.\nSection 2. 04. Rules Affecting Members and Associates.\n(a) Voting. Each member shall be entitled to one vote on each matter sub¬\nmitted to a vote of the members by the Board of Directors, or otherwise in ac¬\ncordance with this Constitution and By-laws, except that each Institutional Member\nshall have one vote for each Divisional Membership held by it. No member may\nvote by proxy.\n(b) Institutional Members.\n(i) Institutional Members shall be divided into the following three divi¬\nsions of NAEB; the Radio Stations Division, which is restricted to members\noperating a non-commercial, educational radio station; the Television Stations\nDivision, which is restricted to members operating a non-commercial, educational\n-5-"
}