{
  "id": "d144-87",
  "text": "television station; the Instructional Division, which is restricted to members reg¬\nularly producing instructional or cultural radio or television programs or oper¬\nating closed circuit equipment for direct instruction purposes. A qualified\nInstitutional Member may elect to join more than one division.\n(ii) Each Institutional Member shall designate in writing an author¬\nized representative for each divisional membership held, which representative\nshall be entitled to vote and act for such member.\n(c) Institutional Affiliate Members. Institutional Affiliate Members shall\nnot be members of any Division of NAEB. Each Institutional Affiliate Member\nshall designate in writing an authorized representative who shall be entitled to\nvote and act for such member.\n(d) Individual Members. Individual Members shall be members of the In¬\ndividual Member Division.\n(e) Honorary Members. Honorary Members shall not be entitled to vote\nbut may otherwise participate fully in the activities of, and receive the publications\nand other services of, NAEB. An Honorary Member shall not be required to pay\ndues.\n(f) Associates. Associates shall not be entitled to vote but may receive the\npublications and other services of NAEB.\n(g) Applications for Membership. All applications for membership in NAEB\nshall be submitted in writing to the Secretary for approval by the Board of Direc¬\ntors, provided that procedures for processing applications for Divisional Member¬\nship may be established by each respective Division Board. The Board of Direc¬\ntors may, by appropriate resolution, delegate this authority to approve applications\nto a committee of the Board or to the President. All members as of the date of\nadoption of this Constitution and By-laws shall remain members without further\naction by the Board.\nSection 2. 05. Termination and Reclassification of Membership. The Board\nof Directors shall, on thirty days’ notice, terminate the membership of any mem¬\nber who becomes ineligible for membership or reclassify the membership status\nof any member no longer meeting the requirements of a particular category of\nmembership as set forth in ARTICLE II of this Constitution and By-laws. The\nBoard of Directors shall suspend or expel any member who may be substantially\nin default with respect to the payment of dues, fees or other assessments as may\nbe determined under ARTICLE X of this Constitution and By-laws.\nSection 2. 06. Resignation. Any member may resign by filing a written re¬\nsignation with the Secretary, but such resignation shall not relieve the member so\nresigning of the obligation to pay any dues, fees and other assessments theretofore\naccrued and unpaid.\nSection 2. 07. Transfer of Membership. Membership in NAEB is not trans¬\nferable or assignable.\n-6-"
}