{
  "id": "d144-89",
  "text": "(c) State or Area Chapters. Within each Region, the Board of Directors\nmay charter state or other area chapters of NAEB. Membership in each such\nchapter shall be restricted to Institutional Members, Institutional Affiliate Mem¬\nbers, Individual Members and Honorary Members residing or located within such\nstate or area. State or area chapters are empowered to design their own programs\nof activity in order to advance the purposes of NAEB within such state or area and\nto assess such dues or other assessments as may be necessary, subject to the ap¬\nproval of the Board of Directors.\n(d) Limitations. No Regional Council or state or area chapter shall con¬\nduct any activities in a manner or for purposes inconsistent with the Articles of\nIncorporation and this Constitution and By-laws of NAEB; nor shall any such Coun¬\ncil or chapter have the authority to enter into any contracts or other binding ar¬\nrangements in the name of, or on behalf of, NAEB or to commit it financially.\nARTICLE V\nBoard of Directors of NAEB\nSection 5. 01. Number and Composition. There shall be thirty directors,\nsix of whom shall be elected by the members of the Radio Stations Division; six of\nwhom shall be elected by the members of the Television Stations Division; six of\nwhom shall be elected by the members of the Instructional Member Division; six\nof whom shall be elected by the members of the Individual Member Division; one\nof whom shall be elected by Institutional Affiliate Members; four of whom shall be\nelected by the Board of Directors as representatives of the public at large (and\nshall be known as Public Directors); and one of whom shall be the President of\nNAEB ex officio.\nSection 5.02. General Powers. The property, affairs and business of NAEB\nshall be managed by the Board of Directors. Except as otherwise provided in this\nConstitution and By-laws, all matters of policy affecting NAEB and its members\nshall be determined solely by the Board of Directors.\nSection 5.03. Terms of Directors.\n(a) Directors Elected by Divisions. In the case of directors elected by a\nDivision of NAEB, two directors shall be elected annually for three calendar year\nterms, except that directors elected by each Division serving as of the date of a-\ndoption of this Constitution and By-laws shall continue their respective terms until\ntheir successors shall be duly elected and shall have qualified.\n(b) Other Directors. The director elected by the Institutional Affiliate Mem¬\nbers shall be elected for a three calendar year term, except that the Director-at-\nLarge elected by such members serving as of the date of adoption of this Constitu¬\ntion and By-laws shall continue his term until his successor shall be duly elected\nand shall have qualified. Each of the Public Members of the Board shall be elec¬\nted annually for a four calendar year term except that the Director-at-Large not\nelected by the Institutional Affiliate Members serving as of the date of adoption of\nthis Constitution and By-laws shall be deemed a Public Director and shall continue\nhis term until his successor shall be duly elected and shall have qualified. Elec¬\ntions to terms other than three or four calendar years, as the case may be, as may\nbe necessary to constitute the Board of Directors as specified herein as of the date\nof adoption of this Constitution and By-laws shall be held."
}