{
  "id": "d144-90",
  "text": "Section 5. 04. Qualifications for Institutional and Institutional Affiliate Di¬\nrectors . Each director elected by the members of an Institutional Division shall\nbe the authorized representative of a member of such division and the director e-\nlected by Institutional Affiliate Members shall be the authorized representative of\nan Institutional Affiliate Member.\nSection 5. 05. Limitations on Terms of Service. Directors shall hold office\nuntil their successors shall be duly elected and shall have qualified. The director\nelected by the Institutional Affiliate Members and the Public Directors shall not\nbe eligible to succeed themselves after serving one full three or four-year term,\nas the case may be, but shall be eligible for election thereafter.\nSection 5. 06. Time and Method of Election. Directors (other than the Pub¬\nlic Directors and the ex officio member) shall be elected by mail ballot following\neach annual membership meeting, provided that such ballot shall be completed at\nsuch time to permit elected directors to take office at the beginning of the suc¬\nceeding calendar year. Subject to the provisions of the preceding sentence, the\nprocedures for the election of the director elected by Institutional Affiliate Mem¬\nbers shall be determined by the Board of Directors and procedures for the elec¬\ntion of Divisional Directors shall be determined by each respective Division Board.\nPublic Directors shall be elected at the annual meeting of the Board of Directors.\nSection 5. 07. Resignation. Any director may resign at any time by giving\nwritten notice to the Secretary of NAEB or to the Board of Directors. Such resig¬\nnation shall take effect at the time specified therein; and unless otherwise specified\ntherein, the acceptance of such resignation shall not be necessary to make it\neffective.\nSection 5. 08. Existence of Vacancy. A vacancy shall be deemed to exist in\nthe case of the death or resignation of any director and, in the case of any direc¬\ntor elected by the members of an Institutional Division or by the Institutional Af¬\nfiliate Members, if the membership of the institution of which such director is the\nauthorized representative shall have been terminated or reclassified.\nSection 5. 09. Filling of Vacancies. Vacancies in the Board of Directors\nshall be filled as follows: If a vacancy occurs with respect to any director elected\nby the members of a Division of NAEB, the remaining directors elected by the\nmembers of such Division shall elect a successor. If the vacancy occurs with re¬\nspect to the Public Directors or to the director elected by the Institutional Affiliate\nMembers, such vacancy may be filled by a vote of the majority of the remaining\ndirectors though less than a quorum. Each director so elected shall hold office\nfor the unexpired term of his predecessor and until his successor shall be duly\nelected and shall have qualified.\nSection 5. 10. Place of Meetings. Meetings of the directors shall be held at\nthe principal office of NAEB, or at any other-place designated from time to time\nby resolution of the Board or by written consent of all directors.\nSection 5. 11. Annual, Other Regular and Special Meetings of Directors.\nThe annual meeting of the Board of Directors shall be held in the autumn of each\nyear at such place, at such date and at such hour as may be fixed at the last pre¬\nceding meeting of the Board of Directors, and if not so fixed, as fixed by the Pre¬\nsident, or, if he is absent or is unable or refuses to act, by the Chairman or any\ntwo directors. At least two regular meetings shall be held each year. One of such\nmeeting shall be held immediately preceding or immediately following the annual\nmeeting of members of NAEB. A special meeting of the Board of Directors may\n-9-"
}