{
  "id": "d144-92",
  "text": "directors elected by the members of each Division of NAEB to act as a committee\nof the Board. Each such committee shall be known as a Division Board and, to the\nextent provided in such resolution and subject to the provisions of Section 6. 03 of\nthis Constitution and By-laws, shall have and exercise the authority of the Board\nof Directors in the management of NAEB with respect to matters pertaining to its\nrespective Division, provided that no such Division Board shall possess any au¬\nthority of the Board of Directors, the delegation of which is specifically prohibited\nby the General Not for Profit Corporation Act of the State of Illinois and provided,\nfurthermore, that this delegation of authority shall not operate to release the\nBoard of Directors, or any individual director, of any responsibility imposed upon\nit or him by law.\nSection 6. 02. Division Board Officers. Each Division Board may elect its\nchairman and such other officers as it may desire, including an Executive Direc¬\ntor who shall be responsible for the activities of such Division. Each such Board\nmay, subject to the approval of the Board of Directors, establish its own By-laws\nfor the conduct and timing of its meetings. The minutes of each such Board shall\nbecome a part of the corporate records of NAEB and shall be promptly prepared\nand filed with the Secretary.\nSection 6. 03. Limitation on Authority of Division Boards. No Division\nBoard, Division Board Chairman, or other Division Officer shall have the author¬\nity to enter into any contracts or other binding arrangements in the name of, or on\nbehalf of, NAEB or to commit it financially. Any dispute between Division Boards\nshall be referred to and decided by the Board of Directors. Any action taken by a\nDivision Board with respect to matters pertaining to its own Division shall be re¬\ngarded as the action of the Board of Directors unless such action is referred by\nthe President to the Executive Committee within thirty days after the minutes of\nthe meeting at which such action is taken are filed with the Secretary. Any dis¬\nagreement that may arise at a regular or special meeting of the Board of Directors\nbetween a majority of the Board and a Division Board with respect to matters per¬\ntaining to such Division shall also be referred to the Executive Committee. In the\nevent any such action or disagreement is so referred to the Executive Committee,\nsuch committee shall, at a special meeting held not less than 10 days or more than\n3 0 days after such referral, consider such action or disagreement and make re¬\ncommendations to the Board of Directors with respect to the approval, reversal,\nmodification, or resolution thereof by the Board.\nARTICLE VII\nOfficers\nSection 7. 01. Officers. The officers of NAEB shall be a Chairman, a Vice-\nChairman, a President, who shall be the Chief Executive Officer, such Vice-\nPresidents as may from time to time be elected by the Board of Directors, a\nSecretary, and a Treasurer, and such other officers as shall be elected in accord¬\nance with the provisions of Section 7. 03 of this Constitution and By-laws. The\nChairman and the Vice-Chairman shall be elected from among the Directors. The\nChairman and Vice-Chairman shall not be directors from the same Division.\nSection 7. 02. Election, Term of Office and Qualifications. The officers of\nNAEB shall be elected by vote of a majority of the whole Board of Directors. Each\nofficer shall hold his office until the next regular annual meeting of the Board of\nDirectors and until his successor shall be duly elected and shall have qualified or\n-11-"
}