{
  "id": "d144-93",
  "text": "until he shall die, resign or shall have been removed in the manner hereinafter\nprovided. Any two or more offices may be held by the same person except the\noffices of Chairman or Vice-Chairman and President and the offices of President\nand Secretary.\nSection 7. 03. Additional Officers. The Board of Directors may elect such\nother officers as it may deem necessary, including one or more Assistant Secre¬\ntaries and one or more Assistant Treasurers, each of whom shall have such au¬\nthority and perform such duties as are provided in this Constitution and By-laws\nand shall have such additional authority and perform such additional duties as the\nBoard of Directors may from time to time prescribe.\nSection 7. 04. Removal. Any officer elected by the Board of Directors may\nbe removed by vote of a majority of the whole Board of Directors whenever in its\njudgment the best interest of NAEB will be served thereby, but such removal shall\nbe without prejudice to the contract rights, if any, of the person so removed.\nSection 7. 05. Resignation. Any officer of NAEB may resign at any time by\ngiving written notice of his resignation to the President, or to the Secretary, or to\nthe Board of Directors. Any such resignation shall take effect at the time speci¬\nfied therein and unless otherwise specified therein, the acceptance thereof shall\nnot be necessary to make it effective.\nSection 7. 06. Vacancies. Any vacancy in any office because of death, res¬\nignation or removal, or any other cause may be filled by the Board of Directors\nat any regular or special meeting thereof.\nSection 7. 07. The Chairman and Vice-Chairman of the Board. The Chair¬\nman and the Vice-Chairman of the Board of Directors shall be elected at each\nannual meeting of the Board, by a vote of the majority of the whole Board of Di¬\nrectors and each shall serve in such capacity at the pleasure of the Board. The\nChairman shall, if present, preside at all meetings of the members and at all\nmeetings of the Board of Directors. He shall perform such other duties as from\ntime to time may be assigned to him by the Board of Directors. The Vice-Chair¬\nman of the Board in the absence of the Chairman of the Board shall in all respects\nact in the stead of the Chairman of the Board during such absence.\nSection 7. 08. The President. The President shall be the Chief Executive\nOfficer of NAEB and shall have, subject to the direction and control of the Board\nof Directors and the Executive Committee, general and active supervision over the\nbusiness and affairs of NAEB and over its several officers. The President shall\nappoint all members of the staff of NAEB (other than those specifically named in\nthis Constitution and By-laws) and assign them appropriate titles, duties and fix\ntheir compensation. The President is authorized, subject to the approval of the\nBoard of Directors, to accept grants to NAEB and to enter into contracts with the\nFederal Government and other appropriate agencies to pursue research and per¬\nform services consistent with the purposes and powers of this corporation as set\nforth in the Articles of Incorporation. In general, he shall perform all the duties\nincident to the office of President and such other duties as from time to time may\nbe assigned to him by the Board of Directors. He shall be ex officio a member of\nall committees of the Board of NAEB (including Division Boards) with the right of\nvote. The President shall be a full-time, paid employee.\nSection 7. 09. The Vice-President. Each Vice-President shall have such\npowers and perform such duties as the Board of Directors may from time to time\nprescribe. In the case of the absence or inability to act of the President, a Vice-\n-12-"
}