{
  "id": "d144-95",
  "text": "Executive Committee shall have and may exercise the authority of the Board of\nDirectors in the management of the property, affairs and business of, and in es¬\ntablishing the policies of, NAEB, and may authorize the seal of NAEB to be affixed\nto all papers which require it. The Chairman of the Board of Directors, or, in his\nabsence, the Vice-Chairman, shall act as its chairman, or, in the absence of both\nof them, the remaining members may elect a chairman of the meeting.\nSection 8. 02. Committees in General. The Board of Directors may appoint\nsuch other committees, and the chairmen thereof, as it may deem appropriate to\nperform such functions as it may designate.\nSection 8. 03. Committee Procedure. Each member of any committee other\nthan a Division Board shall continue to be a member of that committee only during\nthe pleasure of the Board of Directors. Except in the case of Division Boards or\nas otherwise provided by the Board of Directors, a majority of a committee shall\nconstitute a quorum thereof, and the act of a majority of those present at a meeting\nat which a quorum is present shall be the act of the committee. Meetings of each\nsuch committee shall be called by the President of NAEB at the request of the\nchairman of the committee or any two members of the committee. Each such com¬\nmittee shall render such reports, at such times, as the President or Board of Di¬\nrectors may request.\nARTICLE IX\nContracts, Drafts, Bank Accounts, Etc.\nSection 9.01. Contracts and Appointments of Agents in Connection There-\nwith. To the extent specifically authorized by the Board of Directors, the Chair¬\nman, the President or any Vice-President, or the Secretary, or the Treasurer may\nin the name of NAEB and on its behalf execute and deliver contracts between NAEB\nand any individual, corporation or partnership.\nSection 9. 02. Loans. To the extent specifically authorized by the Board of\nDirectors, any two of the following officers, to wit, the Chairman, the Vice-\nChairman, the President, a Vice-President, the Treasurer and the Secretary,\nacting together, may effect loans and advances at any time for NAEB from any\nbank, trust company or other institution or from any firm or individual and for\nsuch loans and advances may make, execute and deliver promissory notes or other\nevidences of indebtedness of NAEB, but no officer or officers, shall for purposes\nof giving security for any such loan or advance, mortgage, pledge, hypothecate or\ntransfer any property whatsoever owned or held by NAEB, except when authorized\nby resolution of the Board of Directors.\nSection 9. 03. Checks, Drafts, etc. All checks, drafts, orders for the pay¬\nment of money, obligations, bills of exchange and insurance certificates shall be\nsigned by such officer or officers of NAEB and in such manner as shall from time\nto time be determined by resolution of the Board of Directors.\nSection 9. 04. Deposits and Accounts. All funds of NAEB, not otherwise\nemployed, shall be deposited from time to time in general or special accounts in\nsuch banks, trust companies or other depositories as the Board of Directors may\nselect, or as may be selected by any officer or officers of NAEB to whom such\npower may from time to time be delegated by the Board of Directors. For the\npurposes of deposit and for the purpose of collection for the account of NAEB,\nchecks, drafts and other orders for the payment of money which are payable to\n-14-"
}