{
  "id": "d144-97",
  "text": "ARTICLE XV\nIndemnification\nSection 15.01. Indemnification of Officers and Directors. NAEB shall in¬\ndemnify any and all of its officers and directors or former officers and directors\nagainst expenses actually and necessarily incurred by them in connection with the\ndefense of any action, suit or proceeding in which they, or any of them, are made\nparties, or a party, by reason of being or having been officers or directors or an\nofficer or director of NAEB, except in relation to matters as to which any such\nofficer or director or former officer or director shall be adjudged in such action,\nsuit or proceeding to be liable for negligence or misconduct in the performance of\nduty. Such indemnification shall not be deemed exclusive of any other rights to\nwhich those indemnified may be entitled under any agreement, vote of the Board of\nDirectors, or otherwise.\nARTICLE XVI\nAmendments\nSection 16. 01. Amendments. Any part of this Constitution and By-laws may\nbe altered, amended or repealed, and a new Constitution and By-laws may be\nadopted, by a majority of the directors present at any regular meeting or at any\nspecial meeting, provided that at least thirty days written notice is given of inten¬\ntion to alter, amend or repeal or to adopt new Constitution and By-laws at such\nmeeting; except that any proposed alteration, amendment or repeal relating to any\nprovision contained in these Constitution and By-laws with respect to the number,\ncomposition and election of directors shall be submitted to the voting members of\nNAEB in such manner as the Board of Directors shall prescribe, provided that at\nleast thirty days advance notice is given in writing to qualified members before the\ndate of the meeting at which any such proposed alteration, amendment or repeal\nis to be considered. At an annual meeting of members, any alterations, amend¬\nment or repeal of this Constitution and By-laws may be effectuated by consent of\ntwo-thirds of the voting members present. Any alteration, amendment or repeal\nshall become effective at such time as is provided in the resolution approving any\nsuch alteration, amendment or repeal.\n-16-"
}