{
  "id": "d1235-3",
  "text": "-4-\nAccording to our estimates, there is about $20 million in state legislative appro¬\npriations ready now for matching. There is ample evidence regarding intention and\nfiscal ability of many states to move ahead at once—ample justification for the\nbudget requests.\nIf a considerable amount of stir is made at the grass roots, there will be respon¬\nsive action here in Washington.\nInstitutional Broadcasters Meet\nAt my invitation, a small group of NAEB people involved in the instructional uses\nof television met in Washington (at their own expense) January 2bth for the purpose\nof discussing with the NAEB the ways in which this rapidly developing area within\neducational communications might be more fully represented in the decisions and\nactivities of the Association. The group consisted of: Leslie P.Greenhill, Penn\nState; Roy J. Johnston, University of Miami; Charles J. McIntyre, University of Illinois;\nRobert F. Lesher, Hagerstown; Dr. Bart Griffith, University of Missouri; Lt. Col.\nRobert E. Wood, Air University, Maxwell AFB; Dr. Stephen C. Hathaway, Miami of\nOhio; Lynn Kalmback, ETV Center, South Carolina, William Ewing, Ohio State.\nThree main points came out of the day-long session:\n1. The definition of this field should relate to purpose , not the hardware.\nInstructional broadcasting (including radio as well as TV) is distinguished from edu¬\ncational broadcasting by a concern for systematic formal courses, usually credit-\nrelated .\n2. The suggested approach to NAEB reorganization based upon a group of semi-\nautonomous councils representing special interest areas appeared to be promising\nand would give the instructional communications people the fuller voice and degree\nof participation they deserve. They advocated that council members be elected half\non a regional basis, half on a national basis.\n3. It would be useful to hold a national conference on instructional radio and\ntelevision to (1) get a broader representation in helping to organize the field and\nintegrate it into the NAEB structure and (2) participate in some first-rate discussion\nand demonstrations related to various production, curriculum, and utilization aspects\nof ITV. The week of May 13th was chosen as a tentative date; two institutions\n(Stephens, Illinois) have already offered dining and meeting facilities. It was agreed\nthat even if outside funds were not forthcoming to underwrite such a conference, a\nsufficient number of people would attend to warrant holding it.\nI was particularly pleased by the response to my invitation and by the zeal and\ninterest of the group thinking constructively about how to organize and promote ITV\nwithin the NAEB framework,"
}