{
  "id": "d951-40",
  "text": "- 6 -\nGlass III Stations - Here there was even less assurance on revision\nmethods than Class I and II stations. One\nrespondent reports, \"Only continuously adding at\npresent.\" Two methods of revision were mentioned:\nReturns on slips sent to mailing list - 1\nSubscription renewals and terminations - 1\nGlass III mailing lists are revised weekly, annually,\nand spasmodically.\nClass IV Stations - One of the two stations in this class reported—\nAutomatic failure to renew subscription - 1\nPositioning the Responsibility for the Program Schedule\nAs may be noted by Table HI, no one type of staff member is generally\ngiven the responsibility of editing the program schedule. In many cases, the\npublication is a joint effort of two or more staff employees. In the Class\nI and II stations, the chores most often seem to devolve on the Station\nDirector or the Program Director. It is significant that the Class HI\nstations, alone, which are the Community and State Systems, generally aHocate\nthis function to an employee with the status of Public Relations Director*\nPerhaps the fact that all of these stations have perfected their organizations\nwithin more recent times than the others has enabled them to set up from\nscratch an organization more in keeping with current business practices.\nTABLE III\n? _\nDELEGATION OF RESPONSIBILITY FOR THE EDITING OF PROGRAM SCHEDULES\n(In terms of number of respondents reporting)\nStaff Position\nI\nII\nIII\nIV\nStation Director or Manager\n6\n6\n0\n0\nProgram Director or Assistant\n9\n7\n2\n0\nAssistant Director\n2\n1\n0\n0\nJoint effort of several staff members (2 or more)\n6\n3\n3\n1\nPublic Relations, promotion, or publicity person\n3\n1\n5\n1\nNews Director\n2\n0\n0\n0\nStudent Staff Member\n2\nl\n0\n0\nEmployee of Board of Education\n0\nl\n0\n0\nTraffic Director\n2\n0\n0\n0\nSupervising Secretary\n1\n0\nG\n0\nFaculty Moderator\n1\n0\n0\n0\nScript Writer\n1\n0\n0\n0\nClass of Stations\nA few of the positions contained in the above table are filled by\nstudents, but were not included in the \"Student Staff Member\" category\nmore specific titles were supplied.\nif"
}