{
  "id": "d951-45",
  "text": "- 11 -\n\"Through regular staff meetings*\"\n\"Limited*\"\n\"All our staff is indoctrinated with the great importance of constant\ncordial relationships with the public. Teachers, supervisors, in\nshort, Everyone who crosses our path!\"\n\"Very little. Some are advised when they are speaking at teacher or\nother group meetings.\"\n\"What staff????\"\n\"Considerably. Each staff member is expected to promote good relations\nI with schools and the public in every way he can.\"\n^ \"Only in individual discussion. No program of PR indocrination as such.\"\n\"All members are alerted to the importance of maintaining good p/rr«L-\nAll get it — depth of penetration sometimes in question.\"\n\"None.\"\nAs might be expected, the Class HI (community stations) show more activity\nin this area, proportionately speaking, than the other groups. Whether this\nis of immediate necessity for survival or not, this \"awareness\" is very\nmarked for this group.\n——\n£\nA\n\"Through regular contact with our public relations operations.\"\n“\"All staff members urged to carry favorable image of station.\"\n\"Memo on receiving phone calls, what to say and what information to\nget has been given all staff members.\"\n\"Since this is the network office, we have little viewer contacts:\notherwise we speak at PTA, etc...meetings with national-international\nvisitors, etc.\"\n\"Not enough.\"\nJ'Several staff members have spoken to groups.\"\nXT All have some responsibility in handling phone queries re programs,\nconversion, and general information.\"\n\"Weekly staff meetings—2 other staff are available for public\nappearances.\"\ntWe try a great deal of this.\"\n\"Most staff members relate to program participants and public which\nenters premises.\"\n\"Informally, I’d say (station) total staff is well informed and\nrepresent the station well at all times.\"\nThe two Class IV (municipal) stations report—\n\"In the in-service training program in the (department) of which the\nstations are a part, the staff member is instructed in the policies\nand responsibilities of a city-operated station.\"\n^Regularly.\"\nThe Integration of the PR Work of the College Stations with the\nInstitution’s News Bureau\nApplying to the Class I station is the matter of the help in public\nrelations given the station by the institution’s News Bureau or Public\nRelations Department. The specialized requirements of the average college"
}