{
  "id": "d951-47",
  "text": "- 13 -\nLocal paper does not choose to promote radio* We will increase\npower shortly, will make effort to hit area papers*\"\n\"None. (We haven*t sought it.)\"\n\"At rare moments they assist by sending stories to state papers. .\nOur news editor (an older newspaperman) is convinced the papers\nare not receptive to radio stories.\"\n\"It sends out stories which we want distributed on a state-wide basis.\"\n\"Very little.\"\n\"Entire burden of P.R, is carried by college's Pub. Info. Office,\"\n\"Little (at present).\"\n\"Only token help.\"\n\"None in the regular course of events, but they will do anything we ask\nthem to do for us.\"\n\"A fair amount.\"\n\"Regular news from the publicity dept.\"\n\"University's Department of Information Services edits our releases,\narranges for photographs of outstanding events, and distributes\nboth the stories and the photographs to local, state, and\nnational publications through established channels.\"\n\"They write up and mail releases on events that come to their\nattention.\"\n\"Advice as needed, special stories.\"\n\"Good.\"\n\"Copy of all news stories pertaining to school activities or happenings.\n\"General publicity via routine college news releases. Especially\nsuccessful in hometown papers when students' names are included.\"\n\"The News Bureau issues news releases originated at station. All\nuniversity news is supposed to be channeled through Bureau.\"\nPart IH - The General Scope of Station Public Relations Activities\nAll of the stations were requested to complete a check list indicating their\nrelative use of various public relations methods and media. The responses from\nthe Class I stations are summarized in Table V.\nTABLE V\nTHE RELATIVE USE OF VARIOUS PUBLIC RELATIONS MEDIA AND METHODS\nBY CLASS I STATIONS\n(Percentages based on 42 responses)\nMethods and/or Media\nRegularly and/\nor Often\nOccasionally\nOnly\nNever\nStories and pictures to newspapers\n50\n50\n00\nStories and pictures to the trade\n5+\n52+\n43-\npress\n43-\nStories to JOURNAL OF BROADCASTING\n7+\n50\nand NAEB JOURNAL\nStories to NAEB NEWSLETTER\n12—\n45+\n43-\nExhibits\n10-\n64+\n26+\nPrinted Program Schedules\n78+\n10-\n12-\nOther printed mail promotion\n36-\n33+\n31-\nPromotional talks by staff\n19+\n67-\n14+\nPromotional spots on station\n90+\n7+\n3-\nPromotional remotes of various\ntypes\n14+\n38+\n48-"
}