{
  "id": "d951-91",
  "text": "NEW YORK HEADQUARTERS\nPETER GOELET, President\nDALE CLARK, New York Coordinator\n152 East End Avenue, New York 28, N. Y.\nTelephone TRafalgar 9-6070\nJuly 5, I960\nCALIFORNIA HEADQUARTERS\nBERNARD F. KAMINS, Executive Vice-President\nVERA SERVI, Public Service Director\nCANON-AT-CLIFTON\n190 North Canon Drive\nBeverly Hills, California\nTelephone CRestview 1-8141\nHarry J. Skornia, President\nNational Association of Educational Broadcasters\n14 Gregory Hall\nUrbana, Illinois\nDear Harry (or Harold Hill):\nFor what they are worth, as a member of your Public Re¬\nlations Committee, may I make three comments in regard\nto the June 23 letter sent to you by Leslie F. Harcus\nof Michigan State University, relating to his idea for\na National Educational Radio and Television Week*\nFirst, treating this idea constructively (that is, with¬\nout stressing negatives), the October date is too near.\nIf a plan like this were executed, the preparation would\nbe all-important. At least six months in advance would\nbe needed for developing a plan of attack.\nSecondly, you would need a minimum of $25,000 as a\nstarting budget, even if the very first step were to\ntry to get the educational stations themselves to raise\nthe funds.\nThirdly, the determination for such a week would fall\nin the province of the United States Chamber of Commerce.\nTo discuss the time element and the preparation, a full\ntime professional promoter, an experienced man, perhaps\nwith some auxiliary help, would have to be engaged to\nmake such an effort a continuous one.\nA finance committee would have to be appointed to examine\nthe situation as far as the funds for such a project were\nconcerned. U. S. Government, state government, local\ngovernment, citizens1 groups, etc., would all have to be\nbrought into the play to pay for the effort.\nNational weeks are set by the U. S. Chamber. This organi¬\nzation puts out a calendar of such weeks and days and\nmonths. It is not difficult to have the date set but it\nmust be set far in advance so that word of it can be\nspread by the United States Chamber of Commerce. Word\nof it is spread by the Chamber so that professional\npublic relations and advertising agencies can have a\nchance well in advance to tie on to the promotion."
}