{
  "id": "d951-96",
  "text": "Dr. Harry J. Skomia .\nMr, John F. White\nJune 23, I960\nPage 2\nI feel a symbolic type of theme should be picked to transmit and carry\nthe importance of the week*\nThere are a great variety of ways to present National Educational Radio and\nTelevision Week to the public.\n1* Newspapers:\na. Publicize the local station (s) with articles, personality\nsketches featuring outstanding persons who have contributed\nso much to the cause of education over the airways, and\npictures of studios and broadcasts-in-progress.\nb. Publicize the week in trade magazines and journals.\nc. Publicize Network programs and programs from national\ndistributors with pictures and publicity releases.\n2. Publicize the week in trade magazines and journals.\n3. Make pamphlets, window display cards, and attachments for station\nmailing lists available.\nUm Slides and announcements for station break promotions. Possibly\nhaving educational stations, ie*, radio and television in the same\narea, compliment each other through cross-promotion.\n5. Hold open house at the various radio and television stations,\npossibly even in the local schools, to invite the public inside to\nreceive first hand ideas of what educational facilities look like\nand have to offer that they can take advantage of.\n6. Radio and television stations would put their collective best foot\nforward, programming outstanding features carrying through the pro¬\nfessional attitude of the high calibre of educational programming.\nThere are many additional promotional ideas that can be incorporated. These\nabove mentioned are but a few.\nWith all stations actively participating the spirit and enthusiasm of such a\nventure should instill continued high standards and outstanding productions to\nattract and increase our audience for educational radio and television.\nI feel the idea has merit and thus submit it for your reaction and whatever\npossible action might be taken.\nLeslie F. Harcus\nProducer-Director"
}