{
  "id": "d1757-3",
  "text": "FROM DANIEL E. NOBLE, RADIO DEPARTMENT, CONNECTICUT AGRICULTURAL COLLEGE, STORRSt\nCONNk Mlpre are trying to organize an active group of players here at the College, and\nour chief difficulty seems to be the lack of material prepared for broadcasting. Miss\nJenkins, of WEAO, has assisted us by sending through several manuscripts, but no new\nmanuscripts are ready for use, and we fear that it will be impossible to broadcast\nplays on a regular weekly schedule,\n\"We feel that if the Association could organize a system for the distribution of\nsuitable radio manuscripts, the work of maintaining an active group of players would\nbe greatly simplified. Perhaps each station could contribute prepared plays occasional¬\nly, and the general distribution would keep an ample supply available for weekly broad¬\ncasts ,\n\"Enclosed you will find a copy of a radio sketch written by Richard Attridge, the\ndirector of our newly organized players. We should be glad to have members make use\nof the sketch, if it is found to be at all suitable,”\n(Note—Mr. Noble furnished this office the sketch mentioned in his letter• We plan\nto try same with our dramatic group at Station WNAD. I will be pleased to submit ad¬\nditional copies of this to any station interested.)\nFROM JOE F. WRIGHT, DIRECTOR OF UNIVERSITY PUBLICITY AND STATION WILL, UNIVERSITY OF\nILLINOIS, URBANAt ”Your note in the recent bulletin which referred to Higgy’s offer\nto send several plays to your office for the purpose of mimeographing them and sending\nthem to other stations, brought to my mind the fact that some charge might easily be\nmade for these mimeographs. I am sure most of the stations would be willing to send\nfifty cents or a dollar to help cover the cost of mimeographing. The simplest way to\ndo would be to send the amount in stamps.\n\"This brings up the fact that a year or two ago I sent a hundred two cent stamps on a\ncouple of different occasions to H.ggy to help meet postage costs. If we would all\ndo that every month or two, I am sure it would help out on the finances.\n\"Why don't you make such a suggestion in the next bulletin and see what luck you have.\nI am enclosing my stamps herewith for a copy of the mimeographed material.\"\nA portion of a letter from PROFESSOR W. I, GRIFFITH, DIRECTOR STATION WOI, IOWA STATE\nCOLLEGE, AMESj IOWA. \"I have just read your last bulletin with a great deal of interest.\nThis is certainly a fine thing for you to do for the member stations. I want to write\nmore fully about this when I have time to comment on the various points of interest.\n\"One place in the bulletin I understood you were enclosing a mimeograph copy of a radio\nplay that was released by Miss Jenkins. If you intended to enclose it I want to tell\nyou that I did not receive it, but shall be glad to receive this material and pay our\nshare in having it mimeographed whenever it is available.”\n(Note—A portion of the letter from Mr. Griffith has been omitted. He has a young\nman on his staff who desires to establish a connection as announcer with an education¬\nal station. Any member of the Association who expects to have an opening in this field\nor who has an opening at the present time kindly get in touch with Professor Griffith\nof WOI.)\nFROM MR. CHARLES A. TAYLOR, IN CHARGE OF AGRICULTURAL RADIO PROGRAMS, NEW YORK STATE\nCOLLEGE OF AGRICULTURE AND HONE ECONOMICS, ITHACA, COMES THE FOLLOWING LETTERj \"I wish\nto compliment you on the fine work you are doing in preparing the bulletin for the\nmembers of the Association. I read them with a great deal of interest and benefit. I\nam especially interested in the last one which has to do with dramatic presentation\nby radio.\n\"Whenever the plays from WEAO are available, or those from any other station, we will\nbe mighty glad to have them. We have not done much in the way of dramatic s onWEAI, but\nhave” presented two or three dozen plays, all of which, however, carry copyright costs."
}