{
  "id": "d1152-1",
  "text": "PENNSYLVANIA PETITION FILED BY DEPT. OF PUBLIC INSTRUCTION\nIt was erroneously reported in the Washington Report for March 15 (Vol IV,\nNo. 5) that a petition seeking the addition of 1 VHP and 4 UKF channels for ETV use\nin Pennsylvania had been filed by the Pennsylvania ETV Network Study. Actually, this\npetition was filed at the request of, and on behalf of, the Pennsylvania Dept, of\nPublic Instruction.\nThe state ETV plan for Penn., framed by the Dept, of Public Instruction, is\nthe result of ten years of local initiative, careful engineering, and educational\nsurveys and studies. The Ford Fdn. supported, one-year ETV Network Study was of\nconsiderable help in formulating the overall state plan, but was not the sole force\nas the earlier story in the Washington Report might have indicated.\nTIME FOR FILING EXTENDED IN KANSAS DOCKET\nDie FCC has granted a petition by the State of Kansas Com. on Education of\nthe Legislative Council, and extended from April 22 to June 24, time to file opposition\nto petition by Tulsa B/cg. Co., for reconsideration of Nov. 8, 1962 Report & Order\nin Docket 13860 which assigned Ch. *8 to Hutchinson, Kans.\nFCC PROPOSES NEW UHF ETV CHANNELS FOR PUERTO RICO & VIRGIN ISLANDS\nFCC has announced proposed rule making to add following reserved UHF channels:\nPuerto Rico - Aquadila *33, Caguas *59, Fajardo *4l, Ponce *27, San Juan *75, Utuado *71;\nVirgin Islands - Charlotte Amalie *24, Christiansted *22. In the same action, the\nCommission proposes the addition of 19 non-reserved channels in Puerto Rico (deleting\nthree already assigned) and four in the Virgin Islands.\nVINCENNES MV. ENTERS CATV FIELD\nVincennes (Indiana) Univ. will construct and operate two community antenna\nsystems (in Vincennes and Washington, Ind.) as a means of financing an ETV station.\nA consulting firm retained by the University two years ago to explore the economic\nfeasibility oT operating a commercial UHF station (with a substantial portion of\nprogramming in ETV), recommended that while operation of a UHF station would be\nuneconomical, the University could enter the CATV field, since Vincennes area was\nsuitable for such a development. The Uhiv. has petitioned FCC to reallocate Ch. 52\nto Vincennes and reserve it for ETV. Ch. 52 was formerly assigned to Princeton, Ind.,\noperated commercially for less than a year, and is now inoperative, and its equipment\nhas been donated to the University.\nMISCELLANEOUS FCC ACTIONS\nGranted (May l) CP to WCDR-FM, Cedarville (Ohio) College to change frequency\nto 90«1 hic*\nGranted (May 6) CP to the Univ. of Maine for a new non-commercial ETV station\non Ch. 10j ERP 299 kw visual and 149.5 kw aural; antenna height 1090 ft.\nGranted (May 6) CP to WNTH(FM), V&nnetka (ill.) Bd. of Ed., CP to install a\nnew antenna.\nOn May 6 waived Sec. 3*613 °f ^e rules and granted mod. of CP to KLRN (TV),\nSouthwest Texas ETV Council, to change studio location to Univ. of Texas campus,\nAustin, Texas.\nGranted (May 7) CP to Central Michigan Univ., Mt. Pleasant, for a new\nnon-commercial ETV station on Ch. *14; ERP l4.8 kw visual and 8.5 kw aural; antenna\nheight 530 ft.\nGranted (my 9) CP to WMBI-FM, Moody Bible Inst, of Chicago, to install new\nantenna and increase ERP to 50 kw."
}