{
  "id": "d1387-0",
  "text": "Volume V, Number 1 \nFILING DATE EXTENDED FOR COMMENTS ON NAEB ASSIGNMENT TABLE\nJanuary 10,\nThe FCC has extended the time to file comments from Jan. 3 to Feb. 3, 1964,\nand from Feb. 3 to April 3, 1964 for replies, in the matter of the Expanded Use of\nUHF Television Channels (Docket 14229)- The time is being extended, the FCC states,\n\"to provide sufficient time for study and submission of comments on an alternative\nassignment plan proposed by the National Association of Educational Broadcasters.\"\nAn analysis of the NAEB plan was presented in the Nov. 8 Washington Report\n(Vol. IV, No. IT) and was compared with the FCC table in Washington Report, Dec. l6\n(Vol. IV, No. 19).\nNEW BOARD ELECTED\nAt the NAEB Convention in Milwaukee in late November, the membership approved\nthe amendments to the Constitution and By-Laws which provided for the election of\nfour new Division Boards. As dictated by the reorganization, elections were held\nduring December, and a new twenty-four person Board elected.\nRadio Division Board - The radio members elected six Directors, one from\neach NAEB Region. In order to constitute the new Board (which will have regular terns\nof three years), provision was made for initial terms of different lengths, as\nfollows: Regions II and V, One year terms; Regions III and VI, Two year terns; and\nRegions I and IV, Three year terns. Elected to the Radio Board were:\nRegion I - Jack Summerfield, General Manager, WRVR, New York, New York\nRegion II - Mrs. Marjorie Newman, WFSU-FM, Florida State University\nRegion III - E.G. Burrows, Station Manager, WUOM, The University of Michigan\nRegion IV - Martin Busch, General Manager, KUSD, University of South Dakota\nRegion V - Jack Burke, Manager, KSAC(AM), Kansas State University\nRegion VI - John P. Witherspoon, Program Director, KEBS, San Diego State College\nTelevision Division Board - The six-man Television Board was elected at large,\nrather than from regions. Staggered term lengths for this Board were determined by\nthe number of votes received by each candidate. Elected to three year terms were:\nGerard L. Appy, Director, Georgia Center for Continuing Education\nRichard B. Hull, Director, Radio and TV Broadcasting, The Ohio State University\nTwo year terms:\nHartford N. Gunn, Jr., General Manager, WGBH Educational Foundation, Boston\nJohn Schwarzwalder. General Manager, KTCA-TV, St. Paul, Minnesota\nOne year terms:\nKeith Engar, KUED, University of Utah\nRobert Schenkkan, KLRN, University of Texas"
}