{
  "id": "d1387-12",
  "text": "-13-\nNIELSEN RADIO INDEX LARKS IYSTERIES\nJuly Nielsen Radio Index report lists ten radio mystery shows among the top twenty\nshows in total audience. Thursday night schedule on CBS and Friday night schedule\non CBS made high ratings. Six shows, three on each network wore among the first\nten in both total and average audience lists. (Nielsen, incidentally is reported\nto bo revamping its survey schedule to include TV).\nSPECIAL HOUSE CONI ITTEB INVESTIGATES FCC 'ATHEISM* POLICY\nA committee investigating the. FCC. chair manned by Forest.Ilarncj^\ninquiry into the FCC’s so-called Scott decision of 1946. In,this^mlin^_theJg£\nturned the nlea of an atheist that the licenses of three California, radio, stations\nbe revoked because they refused to allow him to discuss, .atheistic, doctilnps^ggyer\nthcTradioV The\" FCC.' however. indicating the situation as !:contrpvepsigln_ said\nradio stations should make it a policy to allow all side^l'adjs^ug^Jj^jyj^ jio j?ro-\nsont their views.\nAt the hearings atheism.was presented by Charles Smith., prpsldeg^^_lli^.Mli±c-^\nAssociatiorr for\" the Advancement of Atheism, Inc,.. Religion\nIgnatius Smith of'Catholic University; Rev.. BdmundJ IfMk..\ntown University;' Dr.\" Herbert.Calhoun,of J^lvinij^\nRichman of Washington. fl.Cj\nOther scheduled witnesses included Don Petty, NAB general counsel; CBS commentator,\nEarl Godwin; and Frank Roberson, Washington attorney.\nRELIGIOUS. RADIO ORGANISATION SNEH3 ATHEIST \"ANSWER\" FROM FCC\nThe.Religious Radio Assocation. composed of various Protestant,,,£atholic^_and\nJewish groups has asked the FCC whether radio stations have,. to__iLiy^\nchance\"~to reply \"every tir o they broadcast a religious, program.\nThe president of the association, Edward Hefffon, asked the FCC to clarify the.\nstand it took on atheist radio programs two years age, expressing the association’d\nfear that the ruling might be interpreted in a way dctrimcnal to religious programs.\nIn the 1946 decision the FCC held that not every, organize\nto tire on the air, blit it said that nan organization or MGAJnagr_boj?rojected\ninto the realm of controversy by. virtue.of being attacked... _jrh§_hplders,jo£jo. belief\nshould not be\"'denied the right to answer ^ their bollef^ple].^\nbecause they arc few in number.t;\nHeffron said members of the association fear that broadcasters might intepret this\nlanguage to mean they must give atheists an opportunity to reply to every single\nchurch program. Such a move, he felt, might make broadcasters shy away from\nreligious programs altogether.\nNBC TO\" FORK SIGNAL CORPS RADIO COMPANY\nChief Signal Officer, Major General Spencer B. Akin, U. 3. Army announced that\nthe National Broadcasting Company has accepted sponsorship of a Signal Corps\nreserve unit under the Department of the Army affiliation program. Tho or¬\nganization is to bo a mobile radio broadcasting company to be.organized in Now\nYork City as a part of RCA participation in 'this phase of national defense."
}