{
  "id": "d1387-13",
  "text": "-14-\nULTRAFAX—A HU-1,ION WORDS A i ilNUTE—TELEVISION PLUS\nRCA* g now Ultrafax system, demonstrated October 21 at the Library of Congress, is\nanother of the new 20th century technological devices, creating new problems and\nnew opportunities,\nUsing ultra—high frequencies, combining television principles with radio relay\nand high-speed'photograph, the device will transmit printed messages and documents\nat the rate of a million words a minute.\nPossible developments dependent on proper relay facilities in new service include\nthe following0.\n1, International exchange of TV programs on a transoceanic,basis..\n2. Household reception of books, magazines andjiews^^ inter¬\nruption of aural program.\n3• Horl?-wide military communications, scrambled for, secrpcy^.wlij^h with\n10 transmitters could carry in 60 seconds, peak load, of mossages..sent\nfrom Pentagon in 24 hours during height of war_ emergency*\n4• Transmission of oneJfull—length motion picture. simu3,jicgiqo^\nof theaters throughout the country, ...\n5. A new radio—mail system, combine with vast pJLcle-jyiP^fpiCilitics^.of_j^ne\nPostoffice Department,\nRumor has it. because of military,\nbe put under wraps by bar Department,\nNSW TELEVISION RAREST SEEN FOR I-EDICAL ^ACHING\nHew and rich market with television as a highly' important educational aid^in\nsurgery were forecast after a two-day October meeting at the University of\nPennsylvania School of 1 cdicine.\nSponsored jointly by RCA and Smith, Kline, and French, pharmaceutical house,\ndemonstrations hrd camera suspended directly above an operator table. Images\ncarried by coaxial cables furnished close-up views of procedures to an audience\nof more than 5000 members of the state medical society and students and nurses\nlocated in university halls and in Convention Hall where the pictures were re¬\nlayed by micro-wave and projected on a large screen.\nNOVELTY FACTOR IN TELEVISION VIEWING SI ALL SAYS RSSFARClgR\nDr. Peter Langhoff, research director of Young & Rubican speaking to the AAAA\nPacific Council in October revealed an analysis made available by Hooper, Inc.,\nwhich he said gave a preliminary answer to the question \"How well docs televisior\nwear?\"\nLevel of sot useage by three groups of owners—each containing 500«600 TV homos—\nwas tested by Hooper’s phone survey between 8;30 and 9:15 P*m. during September\n8-14. Cf those who owned sets throe months or less, 60 percent were viewing\nwhen the chocks were made. Same level of useage was recorded for socone, group,\nowning receivers 4 to 12 months, ^\nSignificant fact, Langhoff stated, was that 54 percent cf -year or more owners\"\nwere viewing, only six points below new owners."
}