{
  "id": "d1387-14",
  "text": "-15-\nAGRICUITURE GEARS FOR TELEVISION\nDana D. Reynolds, In Charge of Operations\nRadio Service, U. S. Department of Agriculture\n(This is a special guest article revealing sore of the plans and policies for the\nimportant new television study project now being conducted by the USDA)\nTelevision Accepted\nTelevision has been accpeted in the Department of Agriculture's thinking and planning\nas a new major informational medium to reach both farm and urban people.\nRural Coverage Still Limited\nWith rural television station coverage still limited, present emphasis is^on pro¬\ngrams for the general audience in urban-suburban areas. This emphasis coincides\nwith greater attention to the consumer-general audience field in all informational\nactivities. It reflects increased activity in that direction through Federal-\nState Intension's embryonic urban Extension program, through directives under the\nResearch and Marketing Act, and otherwise. So we hope that the ground-work we lay\nin television programming for the general audience now will carry over into the\nperiod when we get into extensive general farm television. In other words, this\ntemporary delimiting of our television activities has some aavantages.\nUSDA Foresees Full TV Rhral Service\nThe Department, however, is gearing for full-scale farm television service. Al¬\nready, nearly all of Few Jersey is under television signals. ’TTA1-TV s trans¬\nmitter is midway between Cleveland and Akron, with many farms m its coverage area.\nWhether it comes through piece-meal extensions such as those, or wide-scale exten¬\nsion of coaxial cable, ground-located micro-wave relay, or airborne relay service,\nwe assume that that general farm television service is just a matter of time.\nLarge, Audience Expected\nAs urban and rural television expands, the Department expects to be able to carry\nfarm and homemaking information into millions of homes reached inadequately . _\nthrough meetings, demonstrations, and other media. Also, in some ways, television\nmay do a better job than previously done with families actually reached m other\nways,\nAll of the foregoing is said with full appreciation of problems and unpredictables\nahead•\nSerious Factors — Cost and Production\nAlon-’ with those optimistic views about television, a good many Department people\nare recognizing two sobering facts: l) Television programs will be much more\ncostly than radio, at best; and 2) we will need much higher program standards\nthan wo have had in much of our radio work to hold an audience anc. station time.\nMeeting those conditions calls for the closest cooperation betireen agricultural\nagencies and television stations, whether they be commercial or educational. It\nalso presumes greater financial support for television service oy agricultural\nagencies, commensurate with the big informational and educational responsibility\nto be placed upon this new medium."
}