{
  "id": "d1387-16",
  "text": "-17-\nPEPORT: El PRY UNIVERSITY WORKSHOP\n(This special report covers initial activities of a new NAEB member station WABB)\nStation WABE, the new Board of Education FM station, owned and operated jointly\nby the Atlanta and Fulton County Public Schools, prepared for its opening this\nfall by holding a radio workshop in connection with the General educational\nWorkshop at Emory University for six weeks, beginning June 14.\nUnder the guidance of Dr. I* Keith Tyler, radio consultant for the Atlanta and\nFulton County Schools, about forty teachers from the area met with various ex¬\nperts in urogram planning, production, script writing, school radio worksnops,.\nand radio program utilisation. 1 any of the teachers will take an active par m\nthe operation of the station which is under the direction of hr. .alter Bell,\nassistedhy hr. Alvin K. Gaines.\nThe workshop brought in as instructors Miss Ola Hiller, Pontiac, i ichi_an, to.\ndirect groups in production; hr. Elmo Ellis, Station WSB, Atlanta, as scrip. in¬\nstructor; Miss I arguerite Fleming, St. Louis, and 1 r. Edwin . Holman, Station\nWBOE, Cleveland, to take charge of groups in program planning ana.radio workshop.\nDr. Tvlon end Mr. Gaines initiated teachers in radio program utilization. A.\ndaily orientation session, handled by hr* Floyd h. Baskette of Emory University,\nbrought speakers on various phases of radio from Atlanta’s At. and FI. commercial\nstations. The entire six weeks radio workshop was set up under the administra¬\ntive direction of Dr. John A. Dotson, dean of the School of Education ct, .rory.\nMr. Gcorgo Broad of Corpus Christi, Texas, was director of the General education\nTho great majority of the educational series lor ciemenuary ana nagu\nes with which WABE opens up its first year broadcasting were planned by\nworkshop and scripted in part during the months of July and August.\n— by Edwin F. Holman\nF Director of Radio\nCleveland Board of Education\nWESTINGHOUSE STRATOVISION PLAN SUPPORTED BEFORE FCC BX NATIONAL BUREAU CF STANDARDS\nand Cowels Broadcasting Company who also urge hasty development of UHF and opening\nof bands by FCC\nFREUQUENCY MODULATION ASSOCIATION HOLDS SECOND ANNUAL MEETING IN CHICAGO with Wayne\nCoy, FCC Chairman as headline speaker before more than 400 broadcasters, agency\nmen, and manufacturers. \"FM”, says Coy, \"is in broadcasters hands and holds great\npotentialities for regional and local service. Storecasting and Transit Radio got\na big pitch from FM broadcasters. Dues are raised. Meeting ends on high note.\nFEDERAL COi I UNICATIONS ORDER PUTS \"FREE&I\" ON TELEVISION CONSTRUCTION, while\nannouncing studies of UHF, further studies of present TV performance.with back¬\nground of effort to provide sufficient TV channels, protect and service mobile\nand special service needs, and generally look the situation over before moving on."
}