{
  "id": "d1387-21",
  "text": "-22-\nph-a-s-b 'business paST*}\nREGIONAL DIRECTORS ATTENTION»\nPlease re-check each member station in your area and secure all of the following\ndata available for both Fix and AM station coverage and response.\nA. Either the official engineering map or a copy showing the 0.5 mv primary\ncoverage circle or the primary area of coverage served by the station.\nThis is highly important to any further planning byNAEB headquarters.\n1) Every FK station has this data as a license requirement by the FCC\n2) Every AM station should have this data, but may not, if it has not\nbeen required to prepare such data for hearings, etc.\na) In the event an AM station does not have an official 0.5 mv map\nits chief engineer should calculate the area and send you the\ndata on a good state-county map.\nB. Broadcast Kasuremcnt Bureau maps and supplements for country-wide study\nmade in 1946.\nl) In the event a station does not have this data, it should by all means\nsecure it. Price for this data lias been reduced to a nominal figure,\nand no NAEB station can operate realistically or intelligently without\nit. Write to Broadcast Measurement Bureau, 270 Park Avenue, New York.\nC. Any data similar to BIB such as Conlan, Hooper, etc., or copies of the\nstation’s own audience and utilization surveys if any have been conducted.\nl) Mail response maps will also be useful In this connection.\nIt is requested a doadline of December 31, 1943 be set for collecting this data.\nSeveral follow-up letters may be required in some cases. A double set of data\nshould be requested from each station—one copy for regional director files\nand one copy for NAEB headquarters files.\nSWAP AND EXCHANGE REQUESTS\nMany NAEB members have equipment acquired from War Assets or surplus equipment\nacquired from other sources. Some NAEB members have equipment they wish to\nbuy or sell or exchange.\nCase in point Is Bowling Green State Unim?Ai^ ^Hadio.^i^c^r^^dgey\nStone is “studying\" construction . of_a norm-oommereaal_cpduc.ationcE station HeJja|\nacquired • Jar\" Assets radio equipment including aJiipfn-jqopMQf.^ *\nA complete inventory of all the\" component, hasJqeeiQj^J^sllB^\netc.7 which w.bo_ofugo^^ ,\nnot of use in the particular situation at Bowling, Grp.cn.—jfetorial cq.n.,.]^j)A^JeunE2a\nfor other equipment but not.soldj.\nNAEB headquarters will bo glad to route such requests and to serve as a central\npoint for exchange and trade to member stations. Anyone interested m the\nBowling Green equipment should write directly to Sidney Stone for an inventory\nlist.______._____——--*—-—““\n]"
}