{
  "id": "d1387-22",
  "text": "-23-\nFEDERAL C011 UNICATIONS COl MISSION\nSeptember 15 194S NETTS~APPLICATIONS—ACTIONS October 30, 1948\nEDUCATIONAL\nFCC CLARIFIES TV APPLICATION PROCEDURE\nDenials of three petitions that action be withheld on all pending television appli¬\ncations for a single city until action could be taken on all such applications\nsimultaneously were handed down by the FCC in a Memorandum Opinion and Order\nOctober 21*\nIn denying the petitions, the Commission said the suggested procedure would result\nin unnecessary delay in acting upon applications. In the established procedure for\nthe processing of TV and FK applications, the Order stated, they are considered to\nbe mutually exclusive only?\n,,TJhere two or more applications request the same channel in the same area,\n\"Where the total number of applications for an area exceed the number of channels\navailable for assignment,\"\nFurther clarifying procedure, the Commission said that the processing applications\nis effected according to their file numbers and upon completion they are presented\nto the Commission for action. They are then acted upon without regard to other\napplications for the same city.\nPROPOSE FCC ENGINEERING STANDARDS CHANGES\nNotice of proposed rule making to amend the FCC’s Standards of Good Engineering\nPractice dealing with methods of computing groundwave field intensity contours,\nwhere the radiated signal from a transmitter traverses a path having more than\none ground conductivity, was.given October 1 by the Commission.\nThe FCC notice said that it was believed that the use of the new method would pro¬\nduce results \"more in keeping with the facts as determined by actual field measure¬\nments than either the so-called ’two—thirds’ rule or the ’decibel’ method described\nin the present Standards,\"\nAUTHORITY DELEGATION ORDER\nThe FCC has amended Section 1,142, Part 1 of the Rules and Regulations, by deletion\nof 1,142 (a) (6), and has amended Section 1.144 by the addition of a new section\n(k) to read as follows: -\n\"(k) Applications for remote pickup, ST, and experirental TV relay\nbroadcast stations.\"\nThe order in effect delegates to the Secretary of the Commission authority to pro¬\ncess such applications after approval of both the Engineering and Law departments.\nORAL ARGUMENT RE FIT RULES\nThe Commission scheduled for October 15, 1948, at 3:00 p,m., in Room 6121, New\nPost Office Building, 12th and Pennsylvania Avenue, Washington, D.C., the oral\nargument previously scheduled for October 11 in the Latter of Promulgation of\nRules and Regulations concerning the origination point of programs by standard\nand FM broadcast stations, (Docket 8747)"
}