{
  "id": "d1387-3",
  "text": "STATION KFUO HAS SEDCIAL DEDICATION FOR OCTI1TG OF N5U RADIO, AJEX\nNon-commercial station KFUO, owned and operated by the Missouri Synod of the\nLutheran Church at Concordia College in St. Louis, No., broadcast special dedica¬\ntion ceremonies on completion of the first of five major projects under way.\nKFUO is now operating two transmitters AM and FM and broadcasting the FI program\nfrom 6:00 a.m. to 12:00 midnight. Completion of radio annex ends first phe.se of\nstrtions \">500,000 expension program. Other phases include development of 1000 watt\nFI' outlet into 10,000 watts; removal of AN plant from Concordia Seminary campus\nto new location; power increase for AN station from 5000 to 10,000 watts, increase\nof broadcasting AN station from daytime to unlimited tire; and erection of a\nlarge auditorium studio.\nRADIO TELESCOPE AT CORNELL UNIVERSITY\nCornell University, home of NAEB member station WHCU, is installing an C-ton\n\"radio telescope\" 17 feet in diameter with a saucer shaped antenna, similar in\ndesign to conventional radar antenna. Designed to capture radio signals from\nouter space, the equipment is equipped to record and scan high frequency wave for\nastronomical study'and analysis* Equipment can penetrate cloud layers and is not\naffected by atmospheric conditions as are contention optical telescopes.\nRADIO SERVICE AT LOUISIANA STATE UNIVERSITY SKONS .GAIN\nLouisiana State University, home of WLSU, NAEB outlet in Baton Rouge, can point\nwith pride to results of a radio survey just completed by extension radio editor\nGilbert Durbin and Dr. Hitt, professor of rural sociology at the University. Only\nqualified graduate students were permitted to participate in survey, so entire\nquestioning was on higher professional level than most national polls. Final\nresults of survey will be released shortly. Initial results indicate large listen-\nership to university material now carried by almost every station in the state.\nOf special interest is WLSU. NAEB outlet on the., Lou^^^^\nion of Ralph Steetle. also director . of NAEB Region JN*:—\ndaily for farm and home broadcasts^.,, radiatesJromjixi. antenna .4 2j>. feet highA., which\nputs\" a strong signal, into* New .Qrleans..60 miles amy_._\nanother FM station and rebroadcast to. embrace a still larger ££®Aa\nXJI.SU, now a\nmicro-wave relay points, like the New Orleans..NNaI.JULJ'ALRURR\nout the state, to provide, blanket coverage similar._tcM:he^ •\nNew Orleans is one of the leading Ft. cities in the U_._S,.„wtth more^fchaiLi^QOO^e-\nceiversand enthusiastic FI listening•\n1 FORI: ER~~W3UI FROGRAIf DIRECTOR HONORED UITII MEMORIAL\n: The late Pearl Bennet Broxam, former program director of USUI, NAEB outlet at\nj -the University of Iowa, has been honored by the creation of a special memorial\nfund under the auspicies of the Iowa Federation of Uomen’s Clubs. The Broxam\nMemorial Fund will provide annual prizes to outstanding students of radio at\nthe University of Iowa. lrs*. Broxam was a staff member at the university sta¬\ntion for 12 years."
}