{
  "id": "d1387-4",
  "text": "“r 5“\n1UNITED NATIONS TODAY1 CARRIED BY 100 STATIONS\nOno hundred stations in tho U.S, and Canada are carrying a 15-minute daily report\nfrom the United Nations at Lake Success, N.Y. California leads the list of states\nwith 19 stations taking t!U.N. Today;” the state of Washington is second with 9\nstations carrying tho feature. (Station WCAL, Northfield, Minnesota. St, Cuai\nCollege, is the only N-A-E*B station currently carrying the feature).\n«FM SCHOOL OF THO AIR\" LAUNCHED IN NEW YORK\nTho program, nFM^o^°So Air” is now broadcast in 50 New York state counties and\nthe city of New York via the 14-station Empire State FK network and tho facilities\nof the Rural Radio Network. Developed by public school educational leaders, the\nseries now fifteen years old, last year gave instruction to more than 30,000 ele¬\nmentary school pupils in the area.\nNEW BRITIAN TEACHERS COLLEGE ON NDRC\nHerbert D. Welte, president of Teachers College of Now Britian(Conn.) opened a now\nseries of weekly talks on WDRC, Hartford, with a talk on the “Crisis in Teaching.”\nProgram is heard each Saturday at 6:16 p.m.\nSUPRSIE COURT UPHOLDS FCC IN PROGRAM POLICY DECISION\ndown\nTho U. S. Supreme Court on October 10 upheld tho FCC’s right\nwho\"'proposed to offer\" 10)g__netT7ork programming, no local..tepadcastSj>_Stgiti^JfADC\nnow operating' in Akroni, Ohio on\" 5~ kilow^^^ A power. JWP.. M JSUQQQ\nwatts on a Cleveland frequency now used by_ UGAR.__ECO. held 1QQ/& notwork^rogi^mig^\nignored local need and by-passed station responsibility, Grant instead.went^to\nWC-AR which is now, permitted to up its power to 50,000 watts..\nFCC’S HENNOCK DESCRIBES TV POTENTIAL,\nFrieda 3. Hennock, FCC Commissioner, addressing a luncheon meeting of the New York\nLeague, of Business and Professional Women’s Clubs, October 10, expressed great\ninterest in sociological impact of television on the American family.\nConvinced television will produce vital changes in U. 3. way of life. Miss Hennock\nsaid, ”It is particularly important to women for it will broaden their perspective\nright in the home. News, culture, amusement and education will be as readily\navailable to tho home as the outside. Unlike many, other modern inventions which\nprovide opportunities or incentives to loavc the home for greater fields, it will\nhave the effect of bringing tho family together.\"\nN-A-S-B * 3 HANNA 7iND LARDIE TC PARIS AS IJmSCO CONSULTANTS\nMike Hanna, station WHCU (Cornell University) and Kathleen Lardie (station WDTR,\nDetroit Board of Education) left for Paris in late October to participate.in\nUNESCO meetings at Paris. Lardie will represent educational broadcasters in\ndiscussing problems of creating international understanding through school\nbroadcas t outlets and Hanna will appear as a special radio consultant for UNESCO\ni-fanna, \"originally named to represent American broadcasters at the Paris meeting\nof a special mass communications group of UNESCO was elevated to the post of\nconsultant at a meeting with Julian Hurley, UNESCO director-general and State\nDeportment officials. Ho will advise IS member nations oi the group in their\nplanning for a m'orId-wide, free flow of information as a basis for poaco."
}