{
  "id": "d1387-7",
  "text": "-8-\nUMW NAPPING NEW SCHOOL ROQI SERIES\nX'JITHiTJ, New York, is cooperating with WNYE-FI., New York Board of Education outlet\nin mapping a new schoolroom series in building a program of kindergarten and first\ngrade appeal for more than 1000 classrooms. Ted Cott, WHEW vice-president is build\ning a series for Sunday airing on TJNEW and rebi’oad.cast to schoolrooms weekdays#\nCalled 11 Sing a Song” program will be participation built around folksong themes.\nStudio program will omit key words in stanzas, and children will chime in as pro¬\ngram hits classroom receivers.\nMUTANT SOAP OPERA CRITICS LASH WEST COAST STATIONS\nProtest action is expected to be taken by social service, religious, PTA, and other\ngroups, members of the \"Soap Opera Committee of the Radio Listeners of mortnern\nCalifornia.u\nIn a report just issued, the committee indicts Nest Coast station for \"overloading”\nschedules with serial drama, pointing out a San Francisco station broadcasts lo\nsuch programs daily.\nCommittee's report pointed out survey showed only 7 percent of available listening\nauddence was tuned in on soap operas, and accused stations of mercenary motives in\ncontinuing to serve so small an audience segment, and maintained \"there is no ex¬\ncuse for any station to accept 18 soap operas from a network.\"\nCommittee then criticized prevalence of morbid and negative themes in soap opera\noffering and objected to use of murder, insanity, infidelity, and neurotic mal¬\nadjustment as major story materials.\nEDUCATORS INVITED TO NEWS DIRECTOR'S CONVENTION\nInvitations have been sent to deans and directors of major journalism schools in\nthe U.S. to attend the annual convention of the National Association of Radio\nNews Directors meeting in St. Louis on November 12, 13, and 14.\nNoting this is the first time such invitations have been issued, John Hogan, NARND\npresident, ex-plained it is the feeling of the organization that the NARND must\nwork closely with the schools of journalism which serve as a manpower pool for\ntraining radio nous personnel.\nNARND officials are expecting some 200 radio news directors in addition to journal¬\nism school personnel and network and management representatives.\nThe meeting is expected to devote special attention to the problems and opportuni¬\nties presented by television news broadcasting.\nRCA PLACES NEW CNTLDRJ'N'S DISC SERIES ON 150.STATIONS\nRCA has announced a new plan whereby free discs are supplied to cooperating\nstations who release a five times per week children's show in 15.and 30-\nminute segments. Broadcasters using the scries agree to use script material\nprepared by RCA and are provided with a basic library of 4& sots of children's\nrecords. Shows may be sold to local sponsors afterJanuary 1."
}