{
  "id": "d1170-0",
  "text": "NEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 29, NO. 12 DECEMBER, 1964\nJournal Seeks New Cover Design\nAt the suggestion of the NAEB Publications Committee,\nmeeting in Austin during the recent convention, the editors\nof the NAEB Journal are holding a contest for a new cover\ndesign. Artists should submit roughs or finished art to the\nPublications Office, 119 Gregory Hall, Urbana, Illinois, by\nFebruary 15, 1965.\nThe only restrictions are that the design should be based\non the present Journal size and should be set up for one-color\nprinting only.\nMembers of the Publications Committee will select the\nnew cover design from entries submitted, and the winner will\nreceive a year’s Individual Membership in the NAEB . . .\nand of course he will be credited as the designer.\nn\nr\nBoard Nominees Named\nFollowing are the nominees for terms beginning January 1,\n1965, on the NAEB Board of Directors. Ballots have been\nmailed to eligible voters.\nINDIVIDUAL MEMBER DIVISION\nRegion I: Albert P. Fredette,* Manager, WAMC; A1 Hulsen,\nManager, WFCR; Lloyd Kaiser, General Manager, South\nCentral Educational Broadcasting Council, Hershey, Penn¬\nsylvania; James Keeler, Program Manager, WGBH.\nRegion IV: Wilbur D. Donaldson,* Assistant General Man¬\nager, KTCA; W. Ferron Halvorson, NITL Analyst, Dick¬\ninson, North Dakota; Ernest E. Phelps, Operations Director,\nKUSD-TV; Rev. R. C. Williams, Director of Communica¬\ntions Arts, Creighton University.\nINSTRUCTIONAL DIVISION\nRegion III: William Ewing, Associate Director, Telecommu¬\nnications Center, The Ohio State University; Colby Lewis,\nActing Station Manager and Coordinator CCTV, WMSB;\nCharles McIntyre,* Director of Instructional Resources, Uni¬\nversity of Illinois; James Miles, Director of Radio-TV, Pur¬\ndue University.\nRegion VI: Richard B. Lewis,* Director, A-V Services, San\nJose State College; George E. Steiner, Coordinator, ETV,\nSan Francisco State College.\nRADIO DIVISION\nRegion II: Stuart W. Hallock, Chairman, Radio-TV-Films,\nUniversity of Kentucky; Marjorie Newman,* Program Di¬\nrector, WFSU-FM; Kenneth Wright, Director of Broadcast¬\ning, University of Tennessee.\nRegion V: Jack M. Burke,* Manager, KSAC. Elected.\nTELEVISION DIVISION\nHaskell Boyter, WETV; George Dooley, WTHS-TV; John\nDunlop, WMEB-TV, WMEM-TV, WMED-TV; Edward\nHerp, WFSU-TV; Howard Holst, WKNO-TV; Lynn Kalrn-\nbach, WNTV; Luke Lamb, KOAC-TV, KOAP-TV; Jack\nMcBride, KUON-TV; William McCarter, WETA-TV; H.\nB. McCarty, WHA-TV; Robert Mott, KWSC-TV; James\nRobertson, KCET-TV; Donald Schein, WMHT-TV; Robert\nSchenkkan,* KLRN-TV; Frank Schooley, WILL-TV; Otto\nSchlaak, WMVT-TV, WMVS-TV; Robert Slingland, KTPS-\nTV; Donald Taverner,* WQED-TV; John Taylor, WTTW-\nTV; Clair Tettemer, KFME-TV; John Young, WUNC-TV.\nNAEB-ETS Names New Executive Director\nChalmers H. Marquis, Jr., Director of Programing for Chi¬\ncago’s ETV station WTTW, has been named Executive Di¬\nrector of ETS, the Television Stations Division of NAEB,\neffective January 1, 1965. Marquis takes over the duties of\nGerard L. Appy who leaves January 1 to take over as Di¬\nrector of Field Services at NET in New York City.\nMarquis has been a member of the WTTW staff since\n1955, serving as producer-director and later as Director of\nProgram Development. He was a local network television di¬\nrector for WBBM and WGN and prior to that a radio an¬\nnouncer at WILL and WKID, Urbana, Illinois. He holds de¬\ngrees from the University of Chicago and University of Il¬\nlinois. He has served as Chairman of the NET Affiliates\nCommittee, as consultant to MPATI and the Toronto ETV\nCouncil; he is an NAEB Research Fellow.\nConvention Highlights\n• The Board of Directors and the membership voted on and\npassed the new Constitution and By-Laws, copies of which\nwere previously distributed by mail to all NAEB members.\nThese changes make clearer the divisional structure approved\na year before. One major additional change approved in Aus¬\ntin was the stipulation that all members of the Board and\nstanding committees must hold NAEB Individual Membership\nin order to be eligible to serve.\n• The amendment to the Articles of Incorporation was ap¬\nproved unanimously by the Board of Directors and the Mem¬\nbers. This change is designed to insure our continued status\nas a tax exempt organization under tighter regulations.\n• Kansas City was announced as the convention site for the\n1966 convention. The 1967 convention site will be either Den¬\nver or Portland, as announced at the final business session by\nthe Permanent Convention Committee. The final determina¬\ntion of the 1967 site will be based on staff visits to the cities\ninvolved.\n* Incumbent\n1"
}