{
  "id": "d605-26",
  "text": "H. J> Skorniat Biographical date\nSKORHIA, HARRY JAY\nT xscutivs Director, Rational association of Educational Broadcasters,\nDirector of KeUogg-ltAEB SadMT Project end Lecturer in Journalism\n( adio-TV), University of Illinois (since June 1, 19^3),\nBorn April 2, 1910, Charlevoix County, i^ichigani son of Charles and Joseohine\n( Schluttanhofsr) Skomla.\nEducation -MlA* B. (1932), University of MlAlgw, A.M.\nHarried Helen Olivia Barry, September 3, 1936, daughter of Dr. Lee W, and\n(Peacock) Barry} children - Haiy Margaret, Lee Charles.\nBroadcasting iixperience: Program Director, MBC-Hadto Station WIHK. Indiana-\npolia. Indicia, 19lO-li2j Weekly Radio Comjontaiy, Stations WSUA, WTGM and\nWTTS Bloomington, Indiana, October 19lj6 - June, 191$} Visiting Expert,\nOffice of Military Government, West German Radio Stations and BIAS Berlin\n(organisation, programing, production), Berlin and American Occupation\n,,om$ June - October, l9kB; Visiting impart. Office of Military Govern-\nrsont and consultant to 11 Voice of America” for Austria, USFA, Austria,\nand OMQUS md HICOG, Gom&ny summer I9ii9l Radio Officer and Radio Attache\nTom±^1 Serylo®B State Department and U.S. Information Agency\n1951-53t °Perating Oartian-langoagp radio stations along Iron Certain *\n(Vienna, Lina, Salaburg) in Austria (leaving this position to report to\npresent one, June 1, 1953).\nFormer Director and Vice-President'of ffAEBs former NationA\nuirector, stats P*s«ia©nt, and C&aiwtaa of Nominating Committee of\nAssociation for Education by Radio and Television (AFRT)j number Falbright\n(Ifetloral Conferene® Board) Advisory Selection Committee for Radio aid \"\n'icle vision; Member of School Broadcast Conference and Institute for\nducation ty Radio and 'television planning ©ojrcaitt&esf member mo Broad¬\ncasting Committee and number of Executive Committee; member (195 -56)\nMA ^legate JkmmMj (at large), I Development Cowdttea(1956-59)1\nHAEB representative (constituent member, representing TV and r;\nAmericoi Council on Kducationf number American Acadoay of Political and\noocial Science, Rational Acsdery of Economics and Political Science,\nAssociation for Education in Journalism and others: (Rockefeller) Fellow.\nSecond Nf-KB Allerton Seminar (1950); MAKB Fellow, Lincoln Lodge Lxinpr on\n./Jttcational Television (1953); formerly Director, Indiana UN Voluntary\nCotrespondents Speakers Unit| (three summers) number of Wisconsin Radis\nInstitute staff."
}