{
  "id": "d605-38",
  "text": "\"THE CARE AND FEEDING OF IDEAS\" - RADIO\nChairmans GORDON DAVIS* General Manager* KYW* Cleveland* is a veteran of\n18 years in the broadcasting business, Since June* 19k7 he had been\nassociated with KYW* Philadelphia* where had had been General Manager since\nDecember 1* 1955. Prior to that* he had been Program Manager since July*\n195>1. Mr, Davis has a varied background which includes radio announcing\nand production* short story writing* a radio director for an advertising\nagency.\nHALF BRENT* Vice President* WIP* Philadelphia* has a rich background in\nradioo In 19h7 he became a salesman for WVNJ* Newark* N. J* He resigned\nin I9I4.8 to join WBBM* CBS Chicago* as Sales Promotion Manager. In 19U9\nhe was appointed Sales Manager WBBM. He resigned this post in 1951 to\njoin WIP as Director of Sales, He was appointed Vice President and member\nof the Board of Directors in 1952.\nCAL BOLLWINKEL* Program Manager, WOWO* ^ort Wayne, was appointed to this\nposition in 1957® He joined the station in 1952 as an announcer. Before\nassuming his present duties* he was the station's Director of News and\nSpecial Events, He has also been News Editor and disc-jockey. A member of\nSigma Delta Chi* professional journalism fraternity* at Michigan State* he\nalso was president of Delta Sigma Phi* social fraternity.\nGORDON A. MIKKELSON* Director of Public Relations and Program Promotion,\nWCCO, Minneapolis-St, Paul, has been a newsman most of his working life.\nHe has worked for Associated Press in St, Paul and New York City. In\n19i|6 he joined the Minneapolis Star. There he won awards for reports\non regional economic development* exposes of local government and was\nfeatured as the paper's investigative reporter. He joined WCCO in the\nfall of 1957 with his present title.\nFRED WALKER* General Manager of Radio Station WTTM* Trenton* N. J.* came\nto this station in 1952 after working with Radio Station WBUD* Morrisville*\nPa.* as Production Manager. While at WBUD* he conducted the first \"Courtesy\nDriving Campaign\" which won the national Alfred P. Sloan Foundation Award\nfor Safety in 1952. His first position with WTTM was Director of Education\nand Public Affairs."
}