{
  "id": "d605-46",
  "text": "DISC JOCKEYS AND PUBLIC SERVICE\nChairman? STEPHEN Bo 1ABUNSKI, Director of Radio Operations for The\nCrowell-Collier Publishing Company, New York City, will head the company’s\nexpansion in the broadcast fieldo Labunski is a veteran broadcaster,\nhaving served with stations KCMO, KUDL, WHB (all Kansas City, Missouri)\nand as Vice President andGeneral Manager of WDGY, Minneapolis-St, Paul,\nMost recently he was Vice President for programming of the American\nBroadcasting Company networko\nDEE FINCH, WNEW, New York City, states that he never wanted to be anything\nelse other than a radio announder. He spent four years with a Binghamton,\nNo Yo radio station as an announder. Wanting to get into ”big time” he\nheaded for New York City and was hired by WNEW on the first day. He has\nbeen there ever since as half of the Klavan and Finch early morning\npopular radio show.\nGENE KLAVAN, WNEW, New York City, didn’t arrive at the door of success\nquite so easily as his team mate Finch0 From law student at Johns\nHopkins to radar engineer, to assistant editor of Coronet Magazine,\nthen back to the University of Maryland, was his roundabout route to\nWNEWo In 19 U9* he landed Arthur Godfrey’s old spot on a Washington, DoC*\nstation and started causing a stir that ended with him coining to WNEWo\nART PALLAN, KDKA, Pittsburgh, is rated by Billboard magazine as one of\nthe top ten disc jockeys in the United States,, His public service achieve¬\nments have played a major role in earning him the high position he holds in\nthe KDKA listening areac In December, 1956, he went to Austria for first¬\nhand reporting of the Hungarian refugee situation. He also was national\ndisc jockey co-chairman of the Heart Fund drive and was given the honor\nof crowning Perry Como and Dinah Shore ’’King and Queen of Hearts” over\na national television show*\nBEN SANDERS, General Manager, KICD, Spencer, Iowa, joined this station in\n19i;5o Prior to this he held positions of salesman and manager for the\nfollowing radio stations? WNOX, Knoxville, Term,,; WTAD, Quincy, Illinois;\nand KQW, San Jose, California* He is former President of the Iowa Tall\nCorn Network and Iowa Broadcasters Association,, He is District Director\nof the Tenth District of the National Association of Broadcasters*\nWALT TEAS, Disc Jockey, WFBR, Baltimore, Md0, is currently handling the\nMorning Deejay program over the Baltimore station,. His wide experience\nat such stations as? KMAC, San Antonio, Texas; KRLD, Dallas, Texas;\nKVOO, Tulsa Oklahoma; included jobs of straight and ad lib announcing,\nnews, disc jockey, emcee and quiz shows, and straight actingo"
}