{
  "id": "d605-49",
  "text": "RELIGIOUS PROGRAMMING IN RADIO AND TELEVISION\nChairmans JOHN L. McCLAY, Assistant to the VP, KYW and KYW-TV, Cleveland,\nOhio, joined the Westinghouse Broadcasting Company on March 26, 1956, and\nwas immediately assigned to his present post* Prior to joining WBC, he\nwas Assistant Manager of WCAU-TV, Philadelphia. In the course of his\nfourteen years of broadcast experience, Mr. McClay has been Program\nManager for both independent and network-affiliate radio stations and\nOperations Manager for a New York TV station.\nELMO ELLIS, Manager, Programming and Production, WSB, Atlanta, joined\nthis station in 19U0 as publicity and promotion director and later served\nas script manager. With the opening of WSB-TV in 19U8, he became assistant\nproduction manager. He established a reputation for such programming\nprocedures as, Removing the Rust from Radio,\" which won a George Foster\nPeabody Award>\nJACK KUNEY, Producer, \"Look Up and Live,** CBS-TV, has been with CBS since\n195U<> His \"Look Up and Live\" was recently awarded a Sylvania Award as the\n\"outstanding religious program in television.\" For five years, he was\nProducer-Director of \"So Proudly We Hail.\" He has also been Program\nDirector of radio station WLIB, New York City, and Production Manager\nof radio station, WNEW, New York City.\nDR. JAMES ALFRED MARTIN, JR., Crosby Prof, of Religion, Amherst College,\nMass., received his A. B. from Wake Forest College, 1937, and his M. A.\nfrom Duke University in 1938* He has contributed articles to: \"Review\nof Religion,\" \"Journal of Religion,\"\"Theology Today,\" and \"Encyclopedia\nAmericana.\" He is a member of Phi Beta Kappa, Omicron Delta Kappa,\nPi Kappa Alpha and is a Fellow, National Council on Religion In Higher\nEducation.\nIRVE TUNICK, \"Light of the World,\" has contributed greatly to radio and\ntelevision. In radio, he received 5 Peabody Awards, 10 Ohio State First\nAwards, a Special Citation, National Conference of Christians and Jews,\nand a Special Award from the Disabled American Veterans. He is well-known\nin television for his work on such shows as \"Studio One,\" \"Armstrong Theatre,\n\"Omnibus\" and special programs for? American Jewish Committee, Jewish\nTheological Seminary, and CBS, NBC, and ABC.\nComments byg FR. WILLIAM KAILER DUNN, Chaplain, Notre Dame of Maryland\nDR. FREDERICK HELFER, Christian Temple, Baltimore\nRABBI ABRAHAM SHUSTERMAN, Har Sinai Congregation, Baltimore"
}