{
  "id": "d605-51",
  "text": "RADIO AND TELEVISION IN THE SPACE AGE — »BROADCASTING'S APPROACH TO SCIENCE11\nChairman: JONATHAN KARAS, Prof, of Physics, University of New Hampshire,\nhas many television and radio shows to his credit, such as: '‘Science Sketches,M\n\"Mobile,\" \"The Menace,\" \"Science in Review,\" and \"Sounds of Things.\" In\naddition to these shows, he has found time for many projects with the U. S.\nAir Force and the U. S. Army Engineers. He is affiliated with the American\nPhysical Society, American Museum of Natural History, and the American\nAssociation for the Advancement of Science,\nJOSEPH CONNOLLY, VP in charge of Radio, WCAU, Philadelphia, began his business\ncareer as Assistant to the Director of Advertising and Publicity for Fox\nTheatres in Philadelphia. His association with radio began in 1935 when he\njoined radio station WFIL as Assistant News Editor. He came to WCAU in 19i|0\nas Director of Advertising, Sales, Promotion and Special Events. In 1956\nhe was named Vice President of WCAU.\nKENNETH CHRISTIANSEN, Program Manager, Educational Radio and Television Center,\nAnn Arbor, Michigan, played a major role in the development of educational\ntelevision in the South before joining the Center in July, 1956. Working\nwith Robert B. Hudson, head of the program department, he now expedites program\nacquisition and procurement for the 30 non-commercial stations affiliated with\nthe Center. He served as project director of the ETV for the Education Board\nsince 1953*\nBENJAMIN DRAPER, Executive Producer, California Acadeny of Sciences, San\nFrancisco, California, has been Executive Producer of San Francisco's\n\"Science in Action\" since its inception in 1950. In 1956, he also became\nexecutive producer of \"Explorers of Tomorrow.\" In recognition of these two\nprograms, KRON-TV in 1956 was presented with the Edison Foundation Award\nas the television station that best served youth.\nDON HERBERT, Prism Productions, in his role as \"Mr. Wizard,\" has drawn on his\nexperience as teacher, actor and scientist. The show began in 1951 on a small\nnetwork of XU stations. In addition to the prized Peabody Award for outstand¬\ning programs for youth and children, the program is the only four-time winner\nof the Ohio State Award for the best children's program on TV, The latest\naward was the Thomas Alva Edison Foundation Award. He handles all aspects of\nthe program.\nRICHARD PACK, Vice President-Programming, Westinghouse Broadcasting Company,\nNew York City. (Note: For Biography See \"Welcome\")\nLYNN POOLE, creator, producer, and host on the Johns Hopkins \"File 7\"\nnetwork television program, will celebrate his 10th Anniversary on television\nthis month. Mr. Poole is Director of Public Relations for The Johns Hopkins\nUniversity, and created the Hopkins television projects in 19^8. He has been\nactive in educational broadcasting on radio since 1938 when he was Director\nof Education for the Walters Art Gallery in Baltimore,. His Hopkins television\nprograms have garnered 2k national and international awards.\nComments: DR. J. ALLEN HYNEK, Astrophysicist, Ohio State University,"
}