{
  "id": "d605-54",
  "text": "“THE CAUSE, THE CAMPAIGN AND THE BROADCASTER”\nChairman: FRANK TOOKE, General Manager, WBZ-TV, Boston, is a veteran broadcaster\nwho has spent nearly all of his 20 years in the industry with the Westinghouse\nBroadcasting Company, Inc. stations. Before coming to Boston, he had been\nGeneral Manager of KYW, Philadelphia. After three years in the Navy, Mr. Tooke\nreturned to his program post at KDKA, Pittsburgh, where he stayed until 1950\nwhen he was transferred to a similar post at KYW. A year later he was named\nGeneral Manager of WOWO.\nVIRGINIA BENTON, Public Relations Chairman, Tuberculosis Society, Columbus, Ohio,\nis also Assistant Executive Director of the Society, being responsible for\ngeneral public relations, publicity and campaign. Following the death of\nher husband in 191*8, she wrote radio copy for WLYN, Iynn, Mass, and became\ncampaign and publicity director fbr the Red Cross, Iynn, Mass.\nHAL DAVIS, Vice President, Radio and TV, Grey Advertising.\nJIM FERGUSON, Program Manager, WSAZ-TV, Huntington, West Virginia, has been\nactively engaged in radio and television work since college days. He started\nin radio as an announcer-engineer while attending Ohio State University in\nColumbus, Ohio. He has worked for the Crosley Broadcasting Corp. station WLW-T\nas producer-director. He joined WSAZ-TV on December 1, 191*9, where he was TV\nSales Manager for two years and has been program director for the last seven.\nJOHN GROGAN, Program Manager, WABD, New York City, held the same position at\nWNEW for two years. Prior to this he had been Program Director at WRCAj\nProduction Manager WRCA-TV; Production-Director “Camel Caravan,“ William\nEsty Agency; and TV Account Supervisor at N. W. Ayer and Sons, Inc.\nWALLACE KENDALL, Chairman, Committee on Education by Television and Radio of\nthe National Social Welfare Assembly, New York City, in the last eight years\nhas planned and supervised the production of many transcribed radio programs,\nfilms for theatrical and television use, other materials for use on radio and\ntelevision, materials for use with t he other media, and booklets for distribu¬\ntion to the public. He is active in the Committee on Education by Television\nof the National Social Welfare Assembly, of which he was recently made\nchairman.\nRICHARD KROLIK, Radio-TV Consultant, National Education Association, has just\nwritten, produced and directed a half-hour public service film, “Satellites,\nSchools and SurvivalJ“, starring Charles Van Doren. Prior to this he has\nworked on “Wide, Wide World” as associate producer and writer; associate\nproducer on “Today”; Director of television activities for “Life”; and\nproducer-director for “March of Time.”"
}