{
  "id": "d605-57",
  "text": "samBzmnm, jam c.\nGeneral Manager, Twin City Area Educational Television Corporation, St. Paul 8, Minnesota\nB.A., Ohio State University, 1937; M. Mrs., Ubivemity of Michigan, 1939; M.A., University\nof Michigan, 29kO} BSL.Dy University of Houston \\ x\nHxperience: \\;\\ - \"\\^\\\n1945-1948 Co-founder and Associate Director of Wall School of Music, Hollywood, Founded\nand Directed the Americab GI Chorus, which toured, m&e appearances, and motion pictures.\nAssociate Music Director ,for Republic Studios 1947-1948\n1948-1956 University of Houston. Professor, Chairma of ffedio-Televisian Department.\nFounded and was Manager of KUHF-FM (1950) and KUHT-TV (1953) the nation's first Educa¬\ntional ^television station. Founded University of Houston Film Unit.\n1956 -w General Manager of KTCA-TV which went an the air September 1957* Founded KTCA-TV\nfilm unit which has produced extensively here aM abroad.\nConcurrent Employment: Established \"University Forum\", worked for KJERH-AM & FM for\nfour years as news analyst. Served as E0V consultant to Detroit ETV, State of Louisiana,\nHAEB (Six-State Network Survey), State of Kansas (State Network) and numerous smaller\nentities.\nSpecial Abilities and Qualifications:\nSpeaks French fluently and both German and Italian well\nIntimate knowledge of North Africa and Western Europe\nReading knowledge of Spanish\nCompetent in both music and drama\nHas extensive experience: in business and accounting methods\nIs an experienced teacher\nHas msnerofus friends in Western Europe, Africa and Southeast Asia\nAuthor of numerous articles, one book and editor of several other works\nHonors:\nMember of K^k (Education), jtm (Music), AER (Broadcasting) and /SHE (Scholastic) fraternities.\nMember of Board of Directors of Minnesota Foreign Policy Association; Minneapolis Symphony\nOrchestra; National Association of Educational Broadcasters; National Association for\nBetter Radio and Television; Minnesota Heart Association; Awarded (1955) the Order of\nthe Quissam Alaauite by the Sultan of Morocco.\nMilitary Experience:\nFebruary 194l to December 1945, Private to Jfajor, Army of the U.S.; 35 months overseas\nservice in North Africa, Italy, France, Belgium, and Gennady; Nine campaign stars;\n5 amphibious landings; Combat and counterintelligence work\nTravel:\nNAEB Delegate to Conference of the European Broadcaster^ Union in Amsterdam in i960\nExtensive travel in Western Europe and Asia Minor in 1943-45, 1955 and again in i960,\nthirteen different trips into Mexico and Caribbean countries between 1945 and 1957.\nFour separate Canadian trips and one to Iceland.\nCopied at HAEB Headquarters\n6-9-60"
}