{
  "id": "d605-70",
  "text": "H. J„ Skornia: Biographical date\nSKORNIA, HARRY JAY\nT xecutiva director, National .Association of ducation&l Broadcasters.\nDirector of Kellogg-NAFB Radio-TV Project and Lecturer in Journalism\n( 'adio-TV), University of Illinois (since June 1, 1953),\n8orn April 2, 1910, Charlevoix County, Michigan; son of Charles and Josephine\n(Schluttenhofer) Skornia,\nEducation - Michigan State College, A. B. (1932), University of Michigan, A.M.\n(1933) and Ph.D. (1937);\nMarried Helen Olivia Barry, September 3, 1933, daughter of Dr. Lee W. and\nMay (Peacock) Barry; children - Maiy Margaret, Lee Charles.\nBroadcasting experience: Program Director, NBC-Radio Station WIRE, Indiana¬\npolis, Indiana, 191*0-1*2 j Meekly Radio Commentary, Stations WSUA, WTCK and\n® Bloomington, Indiana, October 191*6 - June, 1913; Visiting Expert,\nOffice of Military Government, Rest German Radio Stations and RIAS Berlin\n(organization, programming, production), Berlin and American Occupation\nZone, June - October, 1910;Visiting Expert, Office of Military Govern-\n■■snt and Consultant to ‘’Voice of America* for Austria, USFA, Austria,\nand 0NGU3 and HICOG, Germany summer 1919; Uadio Officer and Radio Attache\n(FSS-2), Foreign Service, State Department md U.S, Information Agency\nI9H-53, operating German-language radio stations along Iron Curtain *\n(Vienna., Linz, Salzburg) in Austria (leaving this position to report to\npresent one, June 1, 1953)#\nFormer Director and Vice-President of NAEB; former Nations!\nDirector, State President, and Chairman of Nominating Committee of\nAssociation for Education by Radio and Television (ATIRT); member Fulbright\n(National Conference Board) Advisory Selection Committee for Radio and ’’\nTelevision; .number of School Broadcast Conference and Institute for\nEducation by Radio and Television planning committees; member CNO Broad¬\ncasting Committee mid member of Executive Committee; member (1955-56)\nAEA Delegate Assembly (at large); AEA Field Development Committee(1956-59);\nKAEB representative (constituent member, representing TV and radio)\nAmerican Council on Education; member American Academy of Political and\nSocial Science, National Acsde y of Economics and Political Science,\nAssociation for Education in Journalism and others; (Rockefeller) Fellow.\ncond NAEB Allerton Seminar (1950); MAEB Fellow, Lincoln Lodge Seminar m\nEducational Television (1953); formerly Director, Indiana UN Voluntary\nCorrespondsnts Speakers Unit; (three summers) member of Wisconsin Radio\nInstitute staff."
}