{
  "id": "d605-80",
  "text": "Communications Commission\n36270\nADVANCE RELEASE - 0\n. r FOR RELEASE SUNDAY\nJUNE 2, 1963\nBIOGRAPHICAL SKETCH OF E. WILLIAM HENRY,\nCHAIRMAN, FEDERAL COMMUNICATIONS COMMISSION\nCommissioner E. William Henry today became Chairman of the Federal\nCommunications Commission, succeeding Chairman Newton N. Minow, who resigned.\nChairman Henry became a Commissioner on October 2, 1962. On May l4,\n1963, President Kennedy announced his intention to designate Commissioner\nHenry as the Commission's next Chairman.\nAged 34, Chairman Henry is the youngest person yet to head the Federal\nCommunications Commission.\nBorn in Memphis, Tenn., on March 4, 1929* he received his elementary\neducation in the local public schools. After graduating (cum laude) from\nThe Hill School, Pottstown, Pa., in 1947, he attended Yale University where\nhe obtained a B.A. degree in 1951- Following service in the Korean campaign,\nhe received his LL.B. degree from Vanderbilt School of Law, Nashville, Tenn.,\nin 1957.\nWhile at Yale he was a member of the student organization which operates\nWYBC, the \"indoor\" broadcasting system wired to each dormitory. He served in\nits continuity department and also was an announcer. At Vanderbilt he was\nassociate editor of that university's Law Review and was elected to the Order'\nof the Coif, the national honor society of the legal profession.\nChairman Henry interrupted his education to enter the Navy. Upon\ncompleting that service's officer candidate school in 1951, he was commissioned\nan ensign in the United States Naval Reserve. He saw active duty for three\nyears aboard the U.S.S. Bausell (DD-845), a destroyer with the Pacific fleet\nduring the Korean campaign. He was discharged in 1954 as a lieutenant (junior\ngrade) while serving as that ship's gunnery officer.\nAdmitted to the Tennessee state bar in 1957, he practiced in both state I\nand federal courts. He was made a member of the bar of the Supreme Court of\nthe United States three years later. Chairman Henry was a member of the Memphis\nand Shelby County Bar Association, the Tennessee Bar Association and the American\nBar Association, and has served as a member of various comnittees of those organi¬\nzations. '\nFederal\nWASHINGTON 25,\n(over)"
}