{
  "id": "d1138-0",
  "text": "N A £ 8 NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL 8R0A0CASTERS\nFrank E. Schooley, Editor, Station WILL, Urbana, III.\nFebruary I, 1944\nWHA STARTS NEW COLLEGE SERIES\nMadison, Wis., Jan„26 - Three stellar broadcasters have been makinq their\nDEBUTS AS MEMBERS OF THE FACULTY OF THE WISCONSIN COLLEGE OF THE A|R THIS\nWEEK, WITH THE START OF THE Un8VERSITY*S SECOND SEMESTER.\nProf. Myles Dillon, Irish scholar, native of Dublin, has begun his once-a-\nWEEK COURSE ESPECIALLY FOR THE WCA, ON \"IRISH POETS.\"\nAn INNOVATION FOR THE WCA 13 PROF. NORMAN CAMERON'S UNIVERSITY COURSE IN\nIntroductory Psychology. The WCA is fortunate that the head of the depart-\nMENT HAS A POPULARLY-APPEALfiNG LECTURE STYLE. HjS INITIAL BROADCAST HAD\nHIS LARGE CLASS AND THE STAFF OF WHA LAUGHING A DOZEN TH&ES DURING THE\n50 MINUTE LECTURE. H|S SUBJECT IS MORE INDIVIDUALLY APPEALING THAN SOME OF\nTHE WCA PREVIOUS COURSES AND SHOULD PROVE A FAVORITE WITH LISTENERS. Me\nIS BROADCAST DIRECT FROM THE THEATER OF BaSCOM HALL, MONDAY, WEDNESDAY AND\nFriday at 11 a.m.\nA SURE-FIRE FAVORITE OCCUPIES THE II A.M. HOUR TUESDAY AND THURSDAY. He\nis Prof. Philo M. Buck, chairman of the Comparative Literature department,\nBROADCASTING HIS UNIVERSITY COURSE IN LITERATURE OF OUR ALLIES.\nAnother special course for the WCA is broadcast Thursday at 2 p.m. by Prof,\nCharles Bunn of the Law school, on The United Nations. He has been an\nADVOCATE OF THE LEAGUE OF NATIONS FOR MANY YEARS AND SINCE THE WAR HAS\nSPENT A YEAR AND A HALF AS A SPECIAL ASSISTANT TO SUMNER WELLES IN THE\nState department.\nOther College of the Air courses continue as during the first semester.\nThey are Best in Books, Over At Our House, and Following Congress, drama¬\ntized by the WHA Players, the French program, by the French Department Play¬\ners, AND THE UNIQUE COURSE, QUARTETS OF MOZART AND BEETHOVEN, ILLUSTRATED\nBY THE FAMOUS PRO ARTE QUARTET, AT 3?30 P.M. THURSDAY.\nWalter Krulevitch, WHA*s program director, is director of the College of\nTHE Air, in THE ABSENCE OF Lt. HaRQLD E„ EnGEL.—Mrs. P. H0 FLEMING\nKOAC HOLOS STAFF SCHOOL\nA plan to give the Home Economics staff members of Oregon State College a\nbrush-up course on radio writing and presentation is bearing fruit in THE\nWAY OF SMOOTHER PROGRAMS OVER STATION KOAC, CORVALLIS.\nProgram Manager Allen Miller, formerly of the University of Chicago and\nWashington State College, arranged ano taught a special radio course during\nTHE FALL SEMESTER WHICH WAS DESIGNED TO \"GlVE THE PEOPLE WHO HAVE SOMETHING\nTO SAY SPECIALIZED TRAINING SO THAT THEY ARE CAPABLE OF USING RADIO AS THEIR\nMEDIUM OF EXPRESSION.M"
}