{
  "id": "d1607-10",
  "text": "Frequency:\n1,250 kilocycles shared with eight other sta¬\ntions: WAAM, WGCP, WNEW, WODA,\nWDSU, WLB, WTCN, WCOL, KFOX\nTime:\nDivided with WLB and WTCN\nPower:\nDaytime: 2,500 watts Night: 1,000 watts\nFounded:\n1921\nValue of Plant:\n$25,000\nPrograms per Year:\n1,300\nAudience :\nAudience response can be measured by the\nfact that the free-will contributions to the\nstation amount to an average of $100 weekly.\nWCAL\nST. OLAF COLLEGE\nNORTHFIELD, MINNESOTA\n^ I THE station broadcasts about nine hours a\nweek, a total of 468 hours per year. . . . Staff\nconsists of ten members: one full-time, five part-\ntime and four student workers. . . . Station pro¬\nduces twenty-five programs each week. It devotes\n83 per cent of its time to education and the re¬\nmainder to entertainment. Programs may be\nclassified into the following groups: Music, 39 per\ncent; speaking, 55 per cent; religious services,\ntime and weather reports, etc., 6 per cent. . . .\nSome outstanding programs of WCAL are: Divine\nServices, Vespers, Time Signals from Goodsell\nObservatory, Choral Hour, Book Talks, Political\nScience Series, and “A Pause with the Poets”. . . .\nWCAL has made its facilities available to political\nparties, Legion Auxiliary, Boy and Girl Scouts,\nAmerican Legion, Northfield Chamber of Com¬\nmerce and the Public Schools of Minnesota. . . .\nAnnual appropriation is $2,500. The station is\nsupported also by free-will contributions from\nlisteners. . . . Dependent upon the change of the\nstation’s wave-length by the Commission, WCAL\nis planning for extensive improvements. The\napplication of WCAL for increase of power and\nchange of frequency was granted on October 21.\nLATEST NEWS FROM WCAL\n“A Radio Guild is being organized. It is hoped that\nthis Guild will contribute effectively to educational\nradio, and I shall be glad to let you know a little later\nwhat the Guild is actually doing. As you know, the\nformation of a Radio Guild was one of the projects\nwhich I worked on in the New York University Work¬\nshop, and I am intensely interested in seeing how\nthings work out practically.”\n—Miss Ruth Willard in a letter to the\nU. S. Office of Education.\n44A Window for the College”\nWCAL has become a window through which\nthe fathers and mothers can look and see how\ntheir sons and daughters live at college.\nThe Sunday morning services in the Norwegian\nlanguage have found a distinct place in the reli¬\ngious life of the Minnesota people. Many letters\nof appreciation have been received, especially\nfrom the old, the sick and the shut-ins. This, in\nthe opinion of the directors, is one of the greatest\nservices the station is rendering today.\nWCAL Staff\nMartin Hegland, Director; A. O. Lee, Business\nManager; H. R. Skifter, Operator; Gerhard Ras¬\nmussen, Vesper Services; J. Arndt Bergh, Di¬\nrector, WCAL Orchestra; George W. Spohn, Book\nTalks; P. M. Glasoe, Choral Hour."
}