{
  "id": "d1607-16",
  "text": "He said: “In WLBL and WHA stations, Wiscon¬\nsin is perfecting agencies through which her de¬\npartments of state can maintain intimate contact\nwith and seek to serve the people of Wisconsin.”\nWisconsin School of the Air\nThe Wisconsin School of the Air is recognized\nas an outstanding example of the use of radio by a\nstate to give additional educational opportunities\nto its schools. These supplementary programs\nare used in the classroom under the direction of\nthe teacher. They enrich the experience of the\nchildren by making available to all schools talents\nwhich might otherwise be denied them.\nWisconsin School of the Air began its broad¬\ncasting in 1931 with ten weekly programs for\ngrade-school use, under the supervision of H. B.\nMcCarty, who organized the project.\nEducators have been quick to see the advan¬\ntages of using these supplementary broadcasts in\nthe schoolrooms. Teachers in the WHA area re¬\nported more than 23,000 student listeners each\nweek to the programs of the Wisconsin School of\nthe Air (first semester, 1932-33). In 1934-35 the\nnumber was in excess of 40,000 known listeners.\nWisconsin College of the Air\nThe Wisconsin College of the Air is an immedi¬\nate step in providing educational opportunities\nfor the vast numbers of boys and girls of high\nschool age (14-20) who are out of school and un¬\nable to find employment. Hundreds of adults\nand many high school classes listen also. Ten\ncarefully organized courses are offered weekly in\nagriculture, general science, social science, home\neconomics and the cultural subjects of art, music\nand literature. This project started in the fall of\n1933 greatly enlarges the scope of several educa¬\ntional agencies of Wisconsin. It was organized\nby Harold A. Engel.\nH. B. McCarty, WHA program director\nFor Farmers\nAgricultural interests are served in several\nways by WHA. The daily farm programs ar¬\nranged by the College of Agriculture are timely\nand meet the particular needs of Wisconsin farm¬\ners. Agricultural institutes are conducted by\nradio, and important conferences are broadcast\nfor those who cannot attend in person. Youth\norganizations hold regular radio rallies.\nFor many years the farm programs were the\nbackbone of the State’s radio activities. It may\nsafely be said that agricultural workers sensed the\npotentialities of radio and used them effectively\nbefore any other department in the University\nthrough the years since 1920.\nFields in which courses of instruction have been\ngiven over the air for adults are letter writing,\ntypewriting, public speaking, Spanish, music com¬\npositions, music appreciation, American litera¬\nture, economics and aeronautics. Public accep¬\ntance and reaction has warranted the extension of\neducational features on the adult level. This has\nbeen hampered by the inability of the stations to\noperate during evening hours.\nLounge in Radio Hall, home of WHA. Frieze at top depicts\noldest evidence of communications in the State—petroglyphs\nreproduced from cave-walls and left by prehistoric dwellers in\nthe area."
}