{
  "id": "d1607-33",
  "text": "WIXAL\n‘’’Dedicated to Enlighlenmoni’*\nBOSTON, MASSACHUSETTS\nFrequency:\n6.04 Me. 11.79 Me. 15.25 Me. 21.46 Me.\nPower :\nDaytime: 10,000 watts Night: 10,000 watts\nFounded:\n1928\nAudience :\nBoston Transcript says: (August 10, 1936) :\n“The ‘fan’ mail has grown enormously. Let¬\nters are received from South Africa, Syria,\nPalestine, India and a great many from west¬\nern Europe, particularly the British Isles.”\n/~\\NE hundred per cent of the station’s broad-\ncast time is devoted directly or indirectly to\neducation. There are regular programs on music,\nlanguages, art, literature, drama, sciences, world\naffairs, peace. . . . Staff consists of 18 members.\nSix of these are full-time workers; eight are part-\ntime workers; four are student workers. . . . Some\noutstanding programs of WIXAL are: (1) Mod¬\nern Radio, (2) Basic English, (3) The World’s\nWeek in Review, (4) Better English, (5) Science-\ncasts, (6) The Musical Review.\nPlan for Extension\nContinuous expansion of special services to\neach country of the world is the goal of W1XAL.\n. . . Has increased power from 5,000 watts in\n1931 to 10,000 watts.\nStation wixal is a short wave station with\na world-wide range. It is operated only for the\neducation and entertainment of its listeners on a\nnon-profit basis.\nWhen Walter S. Lemmon, inventor and present\npresident of the Foundation, conceived the idea\nof a non-commercial station, he interested the\nhumanity division of the Rockefeller Foundation\nto assist in the Program work, but otherwise the\nbroadcasting and maintenance of the station de¬\npends upon donations from its friends. A nominal\nservice fee is charged for mailing out programs\nwhich are arranged a month in advance.\nThe station, now in its second year, occupies\nthree rooms on the fifth floor of the University\nClub, Trinity Place, Boston. During the month\nof August, 1936, its generating equipment was im¬\nproved and its power stepped up. Four wave\nlengths are available to the station.\nDuring the Harvard tercentenary celebration,\ndaily broadcasts were heard over WIXAL in\nwhich one of the greatest arrays of intellectual\ntalent ever assembled from all parts of the world\ntook part. Such distinguished names as Sir\nArthur Eddington, who came from England for\nthe purpose, Dr. Albert Einstein, Dr. Niels Bohr,\nand Dr. Robert A. Milliken represented the\nscience group.\nWIXAL does more than present educational\nprograms to five continents. It fosters interna¬\ntional good-will.\nElizabeth L. Calhoun (left)\nmusical consultant to WIXAL\nconferring on plans for musical\ninstruction courses with Walter\nS. Lemmon, radio engineer, who\nis founder and president of the\nWorld Wide Broadcasting Foun¬\ndation."
}