{
  "id": "d1607-40",
  "text": "Frequency:\n580 kilocycles, shared with 5 other stations:\nKMJ, WCHS, WDBO, WIBW, WTAG\nTime:\nDivided with WIBW\nPower:\nDaytime: 1,000 watts Night: 500 watts\nFounded:\nFebruary 11, 1924\nValue of Plant:\n$15,795.63\nPrograms per Year:\n2,184\nAudience:\nKSAC receives an average of 50 fan letters\nmonthly. According to a survey of the radio\naudience made in August, 1935, there were\n95,630 families in farms and towns listening\nregularly or fairly regularly to the various\nprograms sponsored by the station, and 203,-\n370 families listening occasionally or infre¬\nquently.\nKSAC\nCOLLEGE OF AGRICULTURE\nAND APPLIED SCIENCES\nMANHATTAN, KANSAS\n^TATION KSAC is on the air 3]/2 hours per\n^ day, 5 days weekly, and 3 hours on Saturday.\nIncluding special broadcasts, this station is on the\nair 1,170 hours per year. . . . Originates forty-\ntwo programs each week. It devotes 95 per cent\nof its time to education and 5 per cent to enter¬\ntainment. . . . Programs can be classified as fol¬\nlows: Music, 15 per cent; speaking, 70 per cent;\ndramatics, 10 per cent; miscellaneous, 5 per cent.\n. . . Annual appropriation: $3,500. . . . Increase\nin power has been as follows: December 1, 1924\n—500 watts; November 15, 1929—1,000 watts\n(daytime), 500 watts (night).\nSome Outstanding Programs of KSAC Are\nFrom KSAC Bulletins, October, 1936\nRadio Station KSAC frequently deviates from its\nprearranged schedule to bring to you special, worth¬\nwhile features from the campus.\nThe educational work of Station KSAC is widely\nrecognized in one way and another. A former pro¬\ngram director of the station is vice-president of the\nColumbia Broadcasting System; a former assistant an¬\nnouncer is with the Radio Service, United States De¬\npartment of Agriculture; students who have taken the\nradio courses and participated in the broadcasting are\nworking for commercial stations; KSAC broadcasters\nare frequently heard from other stations; the station\nstaff will assist with a program in October which will\nbe broadcast by the National Broadcasting Company;\nand last but not least, mail received at the station indi¬\ncates that the people of Kansas appreciate these “dif¬\nferent” programs.\nHealth Period\nCollege News and Sports Service\nHousewives’ Half Hour\nFarm Hour\nFarm Business Half-Hour\nCollege of the Air\nWeekly 4-H Club Hour\nThis Week in History\nMusic Appreciation\nInternational and National Affairs\nPart of the KSAC staff in ac¬\ntion. Left to right: Edward\nHayes, student assistant, M. L.\nDuMars, Pauline Compton and\nJ. N. Scheel, assistant an¬\nnouncers.\nNew features listed in these printed program bulle¬\ntins this year are “Your College Speaks,” a program\ndirected by the vice-president of Kansas State College,\nDr. S. A. Nock; “Home Town News,” which is pre¬\nsented by the journalism department class in radio\nwriting; the special talks by L. E. Call, dean of the\ndivision of agriculture, the first Friday of each month\non the Farm Hour; broadcasts by the Kansas State\nCollege band during the second semester, and others."
}