{
  "id": "d1118-0",
  "text": "OWNED AND OPERATED BY THE STATE COLLEGE OF WASHINGTON\nNEWSLETTER Nov. 10, 19*1-8\nELECTION NIGHT\nKWSC managed the most complete local election coverage in the state of Washington. Start¬\ning at 8 p0m. election night with national returns from the east as carried by the UP\nand AP wire services the station remained on the air all night giving returns for half\nan hour on the hour. When Whitman county returns began rolling in at midnight it was\nwith the help of 30 journalism students who were assigned to the precincts of the county\nand watched the counting as it progressed.\nIn addition News Chief John Di Meo had arranged with the County Auditors of the 19\nWashington and Idaho counties in KWSC's listener area to phone results at stated intervals.\nThree incoming phones manned by journalism students were at work through the night in the\nCollege News Bureau. These were kept in touch with the stations--own news room by field\nphone. In all more than 50 Students were involved with John Di Meo and Bob Concie carrying\nthe brunt of the half hour broadcasts. Before returns were complete they had done an eight\nhour talkathon.\nFOOTBALL. .. .FOOTBALL... .FOOTBALL\nThe season for WSC at home has been as successful as the season away from home has been\ndisastrous. Three wins and a tie at home against one win and two defeats on the road.\nBut it hasn’t discouraged KWSC sportscasters Bill Denton and LeRoy Desilet. Every game\nplayed this season in Pullman has been aired. The WSC frosh, the varsity, and the games\nplayed by the Pullman High School all got a hearing. In addition their half time resumes\nhave been brightened by interviews with nationally known sports figures.\nThe 623O p.m. Sports Final, a daily feature, has included interviews with Dixie Howell,\nUniversity of Idaho coach; Doug Fessenden, Montana; Reggie Root, Washington; Marchie\nSchwartz, Stanford; Cliff Chambers, Chicago Cubs; and George Varnell, sportswriter of\nthe Seattle TIMES.\nAnd as the season draws to a close engineers are checking the remote lines to the J. Fred\nBohler gym and the cry will soon be BASKETBALL... .BASKETBALL... .BASKETBALL\nDRAMA WITH A BROAD \"A”\nScheduled for a first airing November 15 is ’’World Theatre'' a new series of shows trans¬\ncribed by BBC in London. The series features famous players of the British stage in the\ngreat dramas of the ages. First in the series is Rostand's L'AIGLON, to be followed on\nsucceeding Mondays by Ibsen's HEDDA GABLER, Euripides' THE TROJAN WOMEN, Marlowe's DOCTOR\nFAUSTUS, and Shaw's MAN OF DESTINY. The shows, because of the British disregard for time,\nvary between hltkj and 1:27:30* making necessary the scheduling of the following music\nprogram to vary in length each week. The student head of programming and traffic is a\ndrama major.„..'nuff said.\nNATIONAL COLLEGIATE RADIO GUILD\n’’Campus Showcase,\" regular bi-weekly variety show sponsored by NCRG is branching out.\nAlready in rehearsal is a radio version of MACBETH and being planned for Christmas is a\nmusical story for children."
}