{
  "id": "d1118-3",
  "text": "polled favor on-the-spot broadcasts of court\ntrials.\nMedical complexes in California, Georgia,\nand Michigan recently applied to the FCC\nfor construction permits to establish closed-\ncircuit ITV networks.\nAVAILABLE\nPUBLICATIONS\n. Sigma Delta Chi’s professional journalism\nmonthly, The Quill, devotes the November\nissue to “New Careers in Journalism.” Sub¬\njects covered include salaries and job out¬\nlook, continuing education, what the busi¬\nness press offers, opportunities in broadcast\njournalism. A single copy is 40c; 10 copies\nor more, 25c each. Also, these two pamphlets\nare available free to high school students\nand advisers: Newspaper Journalism, the\nIdealists’ Profession and Mike and Camera:\nA Broadcasting Career for You? Write\nSigma Delta Chi, 35 E. Wacker Drive, Chi¬\ncago, Illinois 60601.\nFrom the University of Washington\nPress, Seattle, Washington 98105: Folk\nTheater of India, $8.95 • Anton Von\nWebern, $6.95 • Strindberg and the His¬\ntorical Drama, $6.95 • Children’s Thea¬\nter, $6.00 • Open Letters to the Intimate\nTheater, $6.95 PAPERBACKS Of Men\nand Galaxies, $1.45 • Theories of Scien¬\ntific Method, $2.95 • Mao’s China, $2.95\n• On the Poet and His Craft, $1.95 •\nGolden Age of Zoology, $2.45 • Writers\nof the Modern South, $2.45.\nFILMS\n“Make a Mighty Reach,” color, 45 min¬\nutes. Covers a variety of educational inno¬\nvations, introduction by HEW Secretary\nGardner. Produced by the Institute for the\nDevelopment of Educational Activities, a di¬\nvision of the Kettering Foundation. Free.\nWrite IDEA, P. O. Box 446, Melbourne,\nFlorida.\nGRANTS\nAwarded by HEW under the Educational\nTelevision Facilities Act:\n$836,598, to the Board of Governors of\nWest Virginia University, Morgantown,\nWest Virginia, to establish a new station\non Channel 24, Morgantown.\n$229,806, to Milwaukee Board of Voca¬\ntional and Adult Education, Milwaukee,\nto improve WMVS, Channel 10, Mil¬\nwaukee.\nFrom the Public Health Service, $53,765,\nappropriated to the Southwest Texas Edu¬\ncational Television Council (KLRN, Chan¬\nnel 9, Austin-San Antonio) and the San\nAntonio District Dental Society to produce\na series dealing with dental health.\n$5,000 from the Advertising Fund of the\nCity Commission to KFME, Channel 13,\nFargo-Moorhead, North Dakota, to pro¬\nmote the area through its services to ETV\nthroughout the U. S.\nNAEB Personnel Service\nPOSITIONS AVAILABLE.NOVEMBER 1966\n(For information, write Miss Carol A. Whitcomb, Personnel Service,\nat the NAEB in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the NAEB with\ncredentials on file with the NAEB Personnel Service. Non-members can\nsave time by sending the $15 annual dues and $15 placement registra¬\ntion fee at the time of inquiry.)\nNov I Position for ETV Coordinator with Communications Office for Research &\nTraining of a leading west coast university's medical center. Ph.D. desired,\nbut M.A. given consideration. A background in educational broadcasting\nadministration essential. Salary $ 10,000-$ 12,000.\nNov 2 Television Writers (2) for training school of military installation in the south.\nLarge TV operation serving other military schools across the country. Seek\ncreative, no-n-technical writers with broad experience in film documentaries,\nradio, and/or TV. Experience more important than educational background.\nSalary $9,000+ to start.\nNov 3 Assistant Director to serve on production staff of same TV installation as\nabove. Seek resourceful, imaginative candidates to handle detail work, lan¬\nguage translations, voicing, etc. Excellent opportunity for advancement. Salary\n$7,500+ to start.\n(The following three positions with large university in southern region. Salary\nfor all positions commensurate with educational and professional backgrounds.)\nNov 4 Academic appointment for a Ph.D. in education, communications, or related\nfield. Will plan and direct media workshops for public school teachers in use\nof ETV in addition to regular ETV teaching duties in School of Communica¬\ntions.\nNov 5 Manager for Communications Services Division/School of Communications.\nDivision is responsible for operation of present radio station, film unit and\nwill direct planned television facilities. Seek skilled administrator with exten¬\nsive background in broadcasting for rapidly expanding operation.\nNov 6 Academic appointment as Chairman of Radio-TV-Films Dept. Seek candidates\nwith appropriate academic qualifications having the interest and energy to\nbuild a department. Position provides opportunity to assist in planning de¬\npartmental objectives and program.\nNov 7 Announcer/Producer for university-affiliated radio station in the northwest.\nSeek candidates having sincere belief in and respect for radio with basic in¬\nterests in all areas of programing. Opportunity to specialize in a particular\nprogram area. Position grants academic appointment and accompanying\nprivileges. Salary $7,000+ to start.\nNov 8 Chief Engineer for planned UHF facility in the northeast. Seek candidates\nwith good supervisory capabilities. Broad responsibilities for both construc¬\ntion and operation of station. Salary $10,000 to start.\nNov 9 Radio-TV Editor for a southern university's Department of University Rela¬\ntions. Dept, provides regular feature items of current and special interest to\nboth radio and TV. Seek candidates experienced in camera work, radio an¬\nnouncing. Position opens Dec. I. Salary to $8,000+ for well-qualified person.\nNov 10 Academic appointment (ll-month basis) for artist with fast-growing mid-\nwestern university. Opportunity for qualified person with broad educational\ninterests to assume teaching assignment in General Studies in addition to art\nduties with the Broadcasting Dept. Seek M.A. experienced in publication de¬\nsign work and TV medium. Salary $7,000 to start.\nNov I I Chief Engineer ETV with midwestern university. Rapidly expanding ETV De¬\npartment with closed circuit and production facilities is seeking licensed en¬\ngineer to take charge of technical operations. Starting salary commensurate\nwith experience and background.\nNov 12 Producer-Director for state ETV network in Northeast. Experienced candidates\npreferred, but will consider recent graduates with degree in field. Seek out¬\nstanding, creative person for ITV and network productions. Starting salary\n$6,000-$7,000.\nNov 13 TV Producer-Director for state university Radio-TV Center in western region.\nSeek young, aspiring person with background relating to production in the\nareas of performing arts. BA or BS plus some directing experience required.\nOpportunity to work toward MA. Approximate salary $6,500 to start.\nNov 14 Director of Audio-Visual Services for a university television center in Scot¬\nland. Will have responsibility for operation of expanding A-V Services and\nfor research developments. A two year appointment. Travel expenses paid.\nNov 15 A sales position with distributors of A-V and CCTV systems for education,\nconference, and training facilities. Seek candidates familiar with systems, hav¬\ning ability to work effectively with specialists in field. Eastern metropolitan\nlocation. Liberal commission.\nNov 16 Assistant Director of Public Relations & Development with ETV station in\nnortheast metropolitan area. Bachelor's degree plus some background in edu¬\ncational broadcasting desired. Salary $6,000 to start.\nNov 17 School Coordinator for 'ETV station in northeast metropolitan area. Candi¬\ndates with teaching certification and MA desired, but qualified persons with\nBachelor's given consideration. A background in both teaching and education¬\nal broadcasting essential. Approximate salary $10,000.\n4\nNEWSLETTER"
}