{
  "id": "d295-105",
  "text": "4\nopening of the Anne Prank House,«,.\n(PLASH ANNE PRANK HOUSE)\nLife pursues its course and has its demands. After\nthe war the most urgent demand as far as our country was\nconcerned was for reconstruction; the reclamation of drowned\npolders; the rebuilding of shattered towns and industries. A\nnew generation sought new possibilities for expansion., in\nscience, in engineering, and in our ancient international\nfield of commerce. We try to keep our foreign listeners\nacquainted with Dutch science and culture, but also with our\neconomy. And directly connected with this is our aim to\nfurther Holland's foreign trade. Agrarian and industrial\ncoverages form a very effective vehicle in this respect.\nInformative items such as these are passed on by the Spanish\nSection in the form of a series of sound-pictures entitled\n\"Olanda Exporta\". The series covers everything from agricult¬\nural machinery to plywood, from oil-refineries to mammoth\ntankers. A sound-picture of a shipyard, complete with the\nclang of hammers and the chatter of riveters gives the distant\nlistener a complete idea of the job in hand.\n(PLASH SHIPYARD)\nNext to our direct transmissions we have a second\n\"weapon\", namely our transcription programmes. These\nprogrammes, consisting of music by Dutch composers, coverages,\npress —reviews, educational items, etc., etc., are recorded\non tape or disc and sent abroad to be broadcast locally by\nhundreds of foreign radio stations.\nNaturally in compiling the material we are required\nto adapt ourselves to the fields of interest and the mental¬\nities of the peoples for whom the programmes are intended.\nBut the great advantage of our Transcription Department is\nits tremendous flexibility. Last year we sent more than 28000\nprogrammes, in 37 different languages, to 122 countries. Even\nmore important than the number of programmes (28000), which\nincludes some rather lengthy series, is the number of\nprogramme items ■which we send to foreign stations. This\nnumber was 2500 in I960, a production of some 8 different\nprogrammes a day. Our strength will come to lie in greater"
}