{
  "id": "d295-107",
  "text": "- 6 -\nWith that I have tried to give you a condensed\npicture of the work we do from day to day in our direct trans¬\nmissions and in our transcriptions. I come now to the new\nfield of activity upon which Radio Nederland enters today,\nand to which I referred somewhat obscurely earlier on.\nActually this is what we might call our third\nweapon - though like the others it is a weapon of peace. This\nnew weapon has \"been carefully forged and whetted during the\npast year, so that it could he presented as a symbolic gift on\nthis festive day of the opening of our new building. We hope\nit will give even more purport to this new studio-complex.\nAs you may know, foreign stations include exception¬\nally important Radio Nederland transmissions, for instance\ncoverages of major events, in their programmes. These so-called\nrelays - direct re-transmission of our programmes by overseas\nstations - vastly extend our circle of listeners. So the reach\nand effect of our programmes are multiplied at one stroke and\nwithout any cost. The regrettable thing about these relays is\nthat they are few and far between.\nThis set us thinking whether we could not, in some\nway, find a means of setting up a permanent relay service. By\nthis means, and by interesting the home services of other\ncountries, we would be able to permanently multiply our\naudiences. The question was, how could it be done? It was\nfinally decided that the solution would lie in an internation¬\nal European actuality programme. By internationalizing the\ncontents we hoped to be able to stimulate -enough .interest\nabroad. The strict objectivity of this programme - the basic\nprinciple of which must be to give the ''news behind the news\" -\nand the high standard of its analytical reports, would have to\nform the hallmark of this radio-journalistic product. Then\nscouts had to be sent out to reconnoitre; to investigate and\nstimulate the \"market\". The Propagation Department of our\nEngineering Service went to work with subtle ingenuity to\nsolve the problems of obtaining the best possible direct\ntransmission conditions. And all this, as you will understand,\nhad to be done behind the scenes.\nNow that the toil of months has been crowned with"
}