{
  "id": "d295-15",
  "text": "u\nTHE UNIVERSITY OP MICHIGAN, ANN ARBOR, MICHIGAN\nJune 4 1962\nMr* J.W. Aeda\nHead Central Programme Svc,\nRadio Nederland\nHilversum.\nBear Mr, Acda,\nMany thanks for your communications noting the frequencies and\nchanges in the past several months. My lack of writing has, I\nhope, indicated to you that we are continuing to receive a good\nsignal and that programs have been going out regularly to the\nmember stations of the National Association of Educational\nBroadcasters, There are at present 45 stations carrying European\nReview and there is hope that more will soon join. The interest\nin hearing news from abroad by commentators in the various\ncountries seems to be getting stronger here in the United States,\nThe European Review on the European Common Market was especially\ngood and your comments on the stock market plunge were especially\ntimely, I might add, too, thqt Radio Nederland*s news from Spain\nand Portugal and even Italy is good. We have little of this sort\nof thing in this country from those three Southern European\nnations.\nIn addition to the network coverage given to European Review we\nhave had a request from a commercial-classical music station in\nBetroit to record the program and use it on their station. We\ngave permission stating that they must give all credits to Radio\nNederland for origination and to NAEB, for whom the program is\nespecially prepared. The reason permission was asked is that WQSR-\nPM Betroit is in our listening area, I am of the opinion that a\ngood many other radio stations in this country have also.discovered\nthe program but since they are out of range of some NAEB stations,\nthey have gone ahead and used the program via their own tape\nrecording. I*am sure that this doesn*t bother Radio Nederland* the\nmore coverage the better!\nWe find that the afternoon broadcasts are the better of the two as\nfar as reception goes. We have not had much success with the 11950\nfrequency at 1530 GMT, The best is 15445 both AM amd PM EST.\nYour regular transmission directed to North America at 2130 GMT is\nand has been excellent for some time and the 0130 GMT is now improving\nMany thanks\nSincerely\nFrederic M. Hindley Jr,"
}