{
  "id": "d295-58",
  "text": "first Director-General, the late Mr. H. J. van den Broek. From\nthe outset he identified himself fully with its aims, and under\nhis eminent leadership the organization grew from a handful of men\nand a few hours of transmitting time daily to its present stature,\n— a station with a staff of 225 and a transmission schedule going\npractically twice round the clock. Mr. van den Broek, who sprang\ninto national prominence during the war as “the Rotterdammer”\nof Radio Oranje, died at the age of 58 on June 15th 1959. He\nwill ever be gratefully remembered by those who carry on the\nwork of which he was the founder and architect.\nOne of the most striking features of the organization from the\nhistorical point of view is its steady growth, both in size and\nscope. As the audiences in the various parts of the world increased\nin size, and in Holland itself the value of the national short-wave\nstation gained greater recognition, its activities had to be extended.\nSections and departments became necessary to handle the “one-\nman” jobs of the initial period, and these, in turn, were later\nfitted into larger units. The extent of this growth is best demon¬\nstrated by the transmission schedule for the current year, 1961,\nwhich totals 9.600 hours of broadcasting.\nThe station’s tenth anniversary, on October 13th 1955, was an\nimportant occasion, for on that date His Royal Highness Prince\nBernhard of the Netherlands became Patron of Radio Nederland.\nBy doing so the Prince, who has often been called Holland’s royal\nambassador, linked his name with the institution whose task it\nis to project the Netherlands abroad through the medium of\nradio. Four and a half years later, on May 2nd 1960, Prince Bern-\nhard performed the opening ceremony at the inauguration of\nRadio Nederland’s new transmitter station at IJsselstein, near\nUtrecht. This too was an occasion for great rejoicing, for this\nmodern acquisition has raised the technical quality of the trans¬\nmissions to a level in keeping with the demands of the times.\nProjecting the Netherlands abroad\nArticle 3 of Radio Nederland’s regulations runs as follows:\nThe aim of the Foundation is to prepare and provide radio\nprogrammes in the widest sense of the word, for reception\nbeyond the national borders, either in the form of direct\n6"
}