{
  "id": "d295-75",
  "text": "Dutch and English-speaking announcers have signed off in Canada\nand the United States, and our Spanish announcer has wished his\nlisteners in Mexico and the rest of Central America good-night,\nRadio Nederland, with the exception of the newsroom, comes to\nrest. But only very briefly, for it is almost time to greet our\nlisteners in Australia and New Zealand again, and the daily trek\naround the earth must start anew.\nThe duration of the transmissions varies from 20 minutes to several\nhours. It is not feasible for Radio Nederland to provide its\nlisteners with a weekly programme journal, like the domestic ser¬\nvices do. They are too widely scattered and too far away for that.\nBut our listeners can obtain monthly — in the case of the Dutch\nService half-yearly — programme schedules free of charge on\napplication. By means of these schedules the recipients can plan\ntheir short-wave listening well ahead. Moreover, at the end of\neach transmission a brief summary is given of the programme items\nwhich can be heard the following day.\nIonospheric bat and ball\nThe ingredients of sound, narration and music which go into the\nmaking of a radio programme travel devious ways before reaching\nthe ears of Radio Nederland’s listeners. The technical trans¬\nformation of these ingredients, from sound-vibration via electro¬\nmagnetic waves back to sound-vibration, is the same as in the\ncase of the home broadcasting services. But because Radio Neder¬\nland’s transmissions are beamed to areas spread all over the earth,\ntheir propagation is a much more complicated affair. The home\nservices need only cover the home territory, and so Radio Neder¬\nland’s transmitters, which must reach the ends of the earth, are\nof a very special kind.\nFor the sake of clarity we must follow the course taken by a\nprogramme from the studio-building to the transmitter. This goes\nvia cables to the so-called Audio Switch Centre, which is run by\nthe Postal and Telegraph Service in Hilversum. From there it\ngoes — again by cable — to the transmitter.\nIn former years Radio Nederland’s transmitters were of very\nlimited power, and were moreover scattered in different places,\nnamely Lopik, Kootwijk and Huizen. Nowadays the entire trans¬\nmitter potential is centred in IJsselstein, near Utrecht.\n24\nAir-cooled transmitting valve"
}