{
  "id": "d295-82",
  "text": "to be beamed to specific areas. The opposite effect is desired\nwhen broadcasting to Europe, for then the transmission must go\nout from IJsselstein in all directions. This effect is obtained by\nusing an omnidirectional antenna. It is by means of this trans¬\nmitter, which is operated on 49 metres, that it is possible at certain\ntimes to pick up Radio Nederland’s transmissions in Holland\nitself.\nThe new, up-to-date transmitters and antennas, housed in and\naround the modern transmitter-station in Central Holland, have\nhelped to give Radio Nederland its place in the front row of\nworld broadcasting.\nFrom makeshift to shipshape\nThe magic attraction which our radio city of Hilversum has for\nthe visitor is still very great. Hardly a day goes by without its\nbevy of motor-coaches, full of craning necks, filing slowly past\nthe studio buildings, where the stream of words and music\noriginates which is heard daily in the homes of Holland. The\nguides also point out Radio Nederland to the sightseers, but there\nare few who give sign of recognition. This is logical, because\nour short-wave transmissions are not in the first place intended\nto be picked up in Holland, but in regions far beyond. They cover\nthe globe, from Australia to Alaska, from Capetown to Siberia,\nfrom Terra del Fuego to Japan. And many a tourist in the past,\ngazing from his motor-coach window at the four former villas\nwhich housed Radio Nederland, must have had a mild sense of\nwonder at the thought that radio programmes were broadcast\nall over the world from those modest buildings.\nIt was in one of these private houses, until then a fashionable\ngirls’ school, that Radio Nederland commenced its work in October\n1945. The studio was a converted garage. A second, and smaller\nvilla was acquired at the beginning of 1947, and more space was\nadded by erecting a wooden extension in the back garden. Real\nprogress — measured, that is, by the yardstick of those days —\nwas made by the acquisition of the much larger villa which became\nour administrative centre. Yet a fourth building was acquired\nin 1952.\nIn these four premises, which lay a few hundred yards away from\n31\nA Spanish programme in the make"
}