{
  "id": "d295-86",
  "text": "length of the fuselage are both about 275 feet. Deep down in\nthe fuselage, under the ground, are the “engines”, the central¬\nheating and ventilation apparatus, the water-pumps, the cooling-\nmachines, the emergency power-station — for if the electricity fails\nthe transmissions must go on — and the telephone exchange for\nthe 180 extensions in the building.\nThe flat hexagonal box-like structure at the nose of the Radio\nNederland aircraft, and the similar but larger one under the\nfuselage are the studios. These two studio “boxes”, which are of\ncourse completely soundproof and free from vibration, are,\ntechnically speaking, separate from the rest of the building and\nrest on their own foundations. They are built half underground\nand half above, and despite their entirely independent status they\nare in complete harmony with the rest of the design. The “box”\nat the nose contains one studio only, and it is the largest of all.\nNot that it can contain a couple of hundred people, but it is\nlarge enough to accommodate those taking part in family-greetings\nprogrammes, and for cabaret performances, radio plays and other\nprogrammes of this nature. The other “box” under the fuselage\nhouses seven studios and three recording rooms, equipped with\nthe most modern technical apparatus. This is the domain of the\nannouncers, news readers, producers, studio managers, engineers\nand all concerned with the transmissions and recordings. The\naccommodation is spacious, with mostly light timbered walls,\nthough some of them have been given a warm, red colour. The\ncontrol-rooms are full of intricate apparatus, knobs, lamps and\nswitches. It is a never ending source of wonder to the uninitiated\nto see how much wire is needed for transmitting sound by wire¬\nless!\nThe main entrance to our aircraft is at the tip of the port wing.\nIt gives access to a large reception-hall. Big grey flagstones cover\nthe floor-space between the walls of glass. Here the blue pillars\nspring into prominence, just a few of the 68 which support the\nbuilding. Their surfaces are covered with plain mosaic-work, the\nminiature tiles used on them and elsewhere in the building —\nmost of them blue and some grey — number more than three\nmillion. The entrance-hall also accommodates the telephone\noperator, the porter, the Accommodation and House Service, and\nthe visitors’ cloakroom.\nMore inside, against the white wall to the right, a bronze plaque\n35\nThis way up, please!"
}