{
  "id": "d295-88",
  "text": "commemorates Radio Nederland’s first Director-General, the late\nMr. H. J. van den Broek, who did not live to see the realization\nof the studio building. The plaque, by the Hague sculptor Etienne,\nwas donated by the staff.\nAt the intersection of the wing and fuselage is the well of the\nstaircase and, opposite to it, the lift shaft. The steps of the stair¬\ncase, which are of plain varnished wood, lead in seven “loops”\nto the topmost point of the building, some fifty feet above the\nground.\nThe ground floor of the opposite wing houses a number of work¬\nshops and storerooms. Here also is the disc and tape library, and\nunderneath more storage accommodation and a row of play-back\ncells. At the extreme end of the wing there is a kind of loading\nand unloading station for the mobile recording units.\nThe entrance-hall projects itself into the body of the building\nto emerge upon the hexagonal space bordered by the studios.\nThe first floor above the main entrance is the management’s\nwing. This is a representative part of the building, and here again\nit is characterized by the light timbered walls. It contains the\noffices of the Director and Deputy Director and their staff, the\nBoard Room, a waiting-room and all the necessary appurtenances.\nThe cockpit of Radio Nederland’s aircraft contains a number\nof offices and a broad staircase, leading to the large studio at the\nnose. The first floor of the starboard wing contains the ad¬\nministrative departments and, at the far end, the canteen with\nits roof, or balcony terrace. Behind this is the sleeping accom¬\nmodation for the announcing-staff who are on night transmissions.\nThe five cubicles each have a private shower.\nBack to the fuselage, where we find on the first upper deck\nthe Engineering Department, the News Service with the newsroom,\nthe Spoken Word and Outside Coverage Department, the tele¬\nprinters and the Documentation Department.\nThe second floor is the domain of the Central Programme Service\nand the Dutch Service, whilst the top floor, or “deck” of the\nfuselage houses the International Service — the English, Spanish,\nArabic, Indonesian and Afrikaans Sections - the Happy Station\nand the Propagation Department.\nThe entire building contains 140 rooms of varying size, with a\nfloor space of 9000 square yards and a capacity of 47000 cubic\nyards. It stands on a site of some 83/* acres, so there is ample\n37\nThe canteen —\n“a nice cup of coffee”"
}