{
  "id": "d295-98",
  "text": "The single dipole (see fig. 2)\nLike the folded dipole, this type of aerial also displays directional\nsensitivity and is intended for reception on one waveband. The results\nobtained on a normal receiver are, however, less favourable than with\nthe folded dipole. If your receiver has an aerial input impedance of only\n75 ohms, better results will be obtained by the use of a 75 ohm lead-in.\nEven when using ordinary household-type twin electric flex, the single\ndipole works better than any of the types described below.\nThe dimensions and erection details are the same for the single dipole as\nfor the folded type.\nNote: The use of dipole aerials at sea is of very little value in view of\nthe constant changes of direction of vessels.\nThe “L” aerial (see fig. 3)\nThis type is known throughout the world of radio. Variations of it are\nthe “T” aerial and the “Windom” aerial. All these are omni-directional\nand their construction is relatively simple. We would advise you to\nrestrict the total length of the aerial to about 45 feet (15 metres).\nTo obtain the best results, the horizontal part should be at least 20 feet\n(6.50 metres) long. The (vertical) lead-in should be connected directly\nto the aerial socket on the receiver. Should it prove necessary to exceed\nthe recommended length, the aerial may be “shortened” electrically by\ninserting a small condensor (200 to 400 pF) in the lead-in.\nThe question of an aerial filter must also be mentioned. This is a match¬\ning device that will give maximum results of your “L” aerial at a low cost.\nWe shall be pleased to advise you personally on this point if you will\nwrite to us.\nThe “Windom” aerial (see fig. 4)\nThis is a special type of aerial, the properties of which actually lie\nbetween those of the dipole and the “L” aerials. Here, too, the length of\nthe horizontal section is equal to half the wavelength, and the vertical\nwire should be connected to it at a spot 0,36 of the length from either end.\nIn this way the connecting point on a horizontal aerial stretch of 52 feet 5\ninches (16 metres) is located at 18 feet 9 inches (5,7 metres) from either\none of the extremities. In that case the aerial has its greatest sensitivity in\nthe 31 and 16 metre bands. Consequently, the “Windom” aerial is a\nmulti-band aerial. However, it has no or hardly any directional sensi¬\ntivity at all.\nThe Rod aerial (see fig. 5)\nIn crowded towns it is often impossible to erect any of the aerials de¬\nscribed so far. In such cases, one must be satisfied with an indoor,\nframe-aerial or rod type aerial. Indoor and frame types are virtually\nuseless for shortwave reception, however the rod type does provide a\nsolution.\nIt should be erected outside a high window. The length of the rod should\nbe about 9 feet (3 metres), but that of the lead-in must be restricted to a\nminimum. The rod aerial is better purchased complete from your local\nradio dealer. When making your choice, make certain that the insulator is\nof good quality (ceramic or glass is better than plastic). The better types\nof rod aerial have a knob or cap at the top which limits the effect of\n“atmospherics” on reception.\n6"
}