{
  "id": "d1116-0",
  "text": "educaTiVe newsletter\nA Plan for Bringing Your School\nthe Full Advantages of\nEducational Television . . .\nPUBLISHED BY MOTOROLA INC. EDUCATIONAL DEPARTMENT, 4545 W. AUGUSTA BLVD., CHICAGO 51, ILLINOIS\nThe wise reservation of 245 channels for educational television sta¬\ntions should in no way deter schools from taking the plunge into\ntelevision until these non-commercial stations are on the air.\nActually, greater impetus should result since the need for trained\npersonnel and staff to operate and program these mass media trans¬\nmitters are nowhere to be found at the present time.\nAlthough television is a relative newcomer to the field of communi¬\ncations, much has already been determined to make it worth the\nwhile of any school to capitalize on the current possibilities.\nFor the Curriculum\nIn the elementary schools and in the high schools it is beneficial to\ninclude instruction leading to discriminating choice of programs for\nteleviewing. Much of this can be accomplished by integrating activi¬\nties, so some mention of implementation techniques maybe helpful.\nDuplicate blank forms, designed to be used as viewing logs by each\npupil for a week or two, can be analyzed for proper balance and con¬\ntent in class. Criteria can then be established in a joint pupil-\nteacher project to test the appropriateness of program selection. A\ntuning clinic, set up so that each youngster learns the proper way to\nadjust the television receiver, will prevent using excessive bright¬\nness and contrast and reduce the possibility of eyestrain. Duplicate\ncopies of TV program listings recommended by youngsters at each\ngrade level can be distributed to the school as a whole, or can be\nincluded in the school newspaper (see EducaTiVe Newsletter No. 43\nfor additional applications).\nYoungsters, for the most part, are natural actors before the TV\ncamera and therefore are in great demand by the broadcasters. In\nkeeping with the policies established by the local board of education,\nit may be an excellent device to organize a talent file of the pupils in\nExtra-curricular a given school. This may be done by circulating a questionnaire ask¬\ning for such information as ability to play musical instruments,\ndramatic training and experience, and special talents. From this\npoint, auditions can be held at which judging committees of pupils,\nor pupils and teachers, can rate the efforts. This is usually a big\njob and should be carried out over an extended period of time. Final¬\nists can be used to put on all-school assemblies and similar presen¬\ntations.\nWith this talent backlog, the next step is to organize a local television\nworkshop which might be an extension of the local dramatic group or\ntheater workshop. With such an organization, and through the use of"
}