{
  "id": "d1116-2",
  "text": "works to permit electronic distribution of TV programs picked up\nfrom outside stations, as well as from inside closed-circuit cam¬\neras.\nThese developments are not remote, impossibly expensive installa¬\ntions out of reach of most schools. Actually, the increase in pro¬\nduction of TV cameras, the development of more efficient pickup\ntubes, and the accumulated know-how, have resulted in price reduc¬\ntions that make it possible to recommend closed-circuit setups for\nthe school with moderate resources.\nIt is possible to start in-school televiewing with a single receiver.\nAdditional sets can be added as financial resources permit. At the\nsame time, a coaxial cable distribution system can be initiated.\nSince this type of wiring requires no conduit, or special sheaths, it\nis inexpensive and can be installed locally without violation of elec¬\ntrical and building codes in most areas. As utilization builds up,\nother receivers can be added, and the cable network increased to tie\nin all of the rooms in a given school. Ultimately, a television cam¬\nera is provided to permit intra-tele from the principal's office to any\nselected number of classrooms, between the swimming pool and the\nauditorium, to relay shop demonstrations or exhibits to selected\naudiences, or to disseminate information or instruction to any de¬\nsired area.\nThe temptation to predict television developments for the future is\njustified. Stimulating investigation and experimentation on equip¬\nment and procedures, already being utilized in industrial and com¬\nmercial situations, are being reported constantly.\nThe Electronic Blackboard\nWhile the chalkboard, as we know it, now may never be eliminated,\nit does have certain inherent limitations. If the classroom of the\nfuture is equipped with a large television screen to supplement this\nteaching device, usual instructional functions can be carried on\nmore effectively. A television screen connected to a flying-spot\nscanner (an elementary type TV camera) can be used to magnify\nelectronically and reproduce any writing or drawing done under its\nsensitive eye. This makes it unnecessary for the teacher to dart\nA TV Classroom of the Future\nA TV CLASSROOM OF THE FUTURE\nCONTROL ROOM\n□□□□□□□□□□□□□□□□DO\n□□□□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□□□a\n□□□□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□□□□\n□□□□□□□□□□□□□□□□□a\n□□□□□□□□□□□□□□□□□a\n□□□□□□□□□□□□□□□□□a\n1ELECTRONIC SCANNER"
}