{
  "id": "d1912-0",
  "text": "■\nA E B\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXIII NO. 12 URBANA, ILLINOIS DECEMBER 1958\nHIGHLIGHTS OF SOME\nCONVENTION SPEECHES\nA Columbia Broadcasting System executive reported\nthat the public is accepting an increasing number of\nserious television programs. As a result, said Merle\nJones, there is optimism over prospects for gradual\nimprovement in the TV audience’s taste.\nJones, the president of CBS television stations,\nspoke before the annual convention of the NAEB\nin Omaha in October.\nRichard Vogl, manager of WOI (Iowa State Col¬\nlege at Ames), told the broadcasters that with stereo¬\nphonic broadcasting just around the corner, many\nradio stations are taking a wait-and-see attitude.\nThey want to find out what Federal Communications\nCommission regulations on equipment will be, he\nsaid. Although stereophonic programming thus far\nhas concentrated on music, the new technique can be\nused impressively for drama as well. He encouraged\nbroadcasters to try stereophonic techniques.\nEugene Thomas, vice president and general man¬\nager of KETV (Omaha), suggested educational\nbroadcasters tackle the problem of teaching Ameri¬\ncans a second language. He said there is a great need\nfor language ability. “Europeans, and especially\nRussians, have it all over us in their ability to con¬\nverse with people in their own language,” he said.\n“This job is ideally suited to the talents of educa¬\ntional broadcasters, and can be a great contribution\nto the good of the country.”\nINTERNATIONAL EXCHANGE OF\nMATERIALS PROPOSED\nThe idea of promoting international understanding\nand goodwill through a “person to person” approach\nhas gained wide recognition in recent times. In con¬\nnection with this theory of contact between countries\nand their citizens the NAEB, in association with\nUSIA, is seeking to foster friendly relations between\neducational institutions and groups in this country\nand their counterparts overseas.\nIt is felt that the use of audio-visual devices will\nassist in making this project a success, and we seek\nhere to determine how many institutions would be\ninterested in participating in such a program. If you\nare interested please write to R. E. Underwood, Jr.,\n14 Gregory Hall, Urbana, Illinois.\nWhen writing please keep in mind the type of\ninformation we desire:\n1. What your institution would have available\nfor use in foreign schools:\na. What subjects are available?\nb. At what levels are they aimed?\nc. In what languages would they be available?\n2. What your institution would desire, ideally, to\nreceive from foreign schools:\na. What subjects?\nb. What levels?\nc. In what languages?\n3. Are there any particular foreign schools with\nwhich your institution would like to exchange\nmaterials?\nWe feel that the potential for such an exchange is\nlimited only by the degree of imagination on the part\nof the schools here and abroad.\nOur aim now is to get this project off the ground;\nthis can be done only if you investigate the pos¬\nsibilities at your institution or in your school system\nand then contact us regarding the items listed above.\nWe certainly hope you will assist us in this pro¬\ngram.\nNEW PUBLICATIONS AVAILABLE\n“Three Years of Stereophonic Broadcasting at\nWOI”—a paper presented by Richard F. Vogl, man¬\nager, WOI, Iowa State College, at the recent NAEB\nConvention. Now available in mimeographed form,\nin single copies, upon request to NAEB Head¬\nquarters. (This paper has already been distributed\nto the chief engineers of member stations.)\n“Tape Recorder Directory”—Each year Audio\nDevices, Inc. publishes a tape recorder directory as\none of the issues of their magazine “Audio Record.”\n1"
}