{
  "id": "d1912-5",
  "text": "The most readily apparent trend in ETV is the\nincrease in activity, he said. The number of ETV\nstations went from 27 to 33 during the past year, with\ntwo more going on the air in November and five more\nfairly sure to begin broadcasting by Christmas. An¬\nother development he noted was that two stations\neach will be using two channels, one on UHF and one\non VHF, to accommodate both general and school¬\nroom audiences.\nMost ETV stations have increased broadcast\nhours, with some on the air seven days a week for\ntotals of 60 ana 70 hours. Other forms of non-com¬\nmercial television which have been growing in sig¬\nnificance include closed circuit television with 119\ninstitutions now using some form of non-broadcast\nTV for teaching purposes.\n“Simultaneously, the great increase in systematic\ninstruction, whether received in the classroom or in\nthe home, whether broadcast over open channels or\nsent out over closed circuit lines, has brought a new\nphrase to the vocabulary—instructional television,”\nStasheff added.\nDevelopments of particular interest to teachers\nof speech are courses such as oral interpretation, par¬\nliamentary procedure, and the increase in production\nof dramatic and operatic programs.\nKQED INAUGURATES LARGE-SCALE\nTV TEACHING PROJECT\nThe most ambitious TV teaching project ever un¬\ndertaken, encompassing elementary, secondary and\nin-service education involving 140,000 students,\n4500 teachers and 40 public school districts of the\nSan Francisco Bay Area began early in November,\nas KQED initiated the first systematic TV instruc¬\ntion in California schools. The project is open\ncircuit and runs Monday through Friday.\nTo help meet expenses incurred during the first\nyear of the project, San Francisco’s community\nsponsored station is the recipient of a grant of\n$25,000 from the Fund for the Advancement of Ed¬\nucation, an independent agency of the Ford Founda¬\ntion. This additional gift brings the total financial\nsupport raised for the TV teaching project to $80,000\nwith $55,000 resulting from contracts for this service\nfrom the 40 school districts and three independent\ninstitutions that have subscribed. An extra capital\noutlay in schools for TV sets and other costs more\nthan equals the amount of money allocated to con¬\ntract for the TV service.\nRaymond L. Smith is KQED’s director of school\nbroadcasting. He will supervise fourteen hours of\nteleclasses a week, which amounts to an increase\nof nine hours of programming per week of the sta¬\ntion. This also marks the first time KQED has taken\nto the airways in the morning.\nEighteen new Bay area instructors are making\ntheir TV debut by teaching seven individual tele-\nclasses. All live programs are being viewed once or\ntwice a week. Six courses are on film, repeated two\nor more times a week.\nKQED’s new service allows parents their first\nopportunity to share in their children’s classroom in¬\nstruction. In order to evaluate the effectiveness of\nChannel Nine’s teleclasses for students, teachers and\nparents, the California Teachers Association and the\nEducational Television Research Association are\ncooperating on a follow-up project.\nBOX\nSCORE\nTotal\nAM\nStations\n3290\n(includes 39\nnon-commercial)\nTotal\nFM\nStations\n71 1\n(includes 164\nnon-commercial)\nTotal\nTV\nStations\n590\n(includes 35\nnon-commercial)\n—N A E B—\nThe 1959 National Convention of the NAEB will be\nheld October 27-30 at the Sheraton-Cadillac Hotel in\nDetroit, Michigan.\n—N A E B—\nCURRENT INFORMATION FOR\nTHE NEW DIRECTORY\nAs you know, we are planning to publish a new\nDirectory of Members shortly after the first of\nthe year. In order to facilitate this and to make\nsure that your listing is accurate and up-to-date,\nplease fill in the blanks and return this to us as\nsoon as possible. The deadline is January 1, 1959.\nI am an . Active, . Associate,\n. Affiliate member.\nFor Actives only: Call letters .\nChannel or\nFrequency .\nRated Trans¬\nmitter power .\nInstitution .\nLicensee\nContact Person\nTitle .\nAddress .\nPhone Number\n6\nNEWSLETTER"
}