{
  "id": "d1807-2",
  "text": "-3-\nNATIONAL ASSOCIATION OF BROADCASTERS\nThe National Association of Broadcasters, under the aggressive\nleadership of President Neville Miller, is continuing its work on code of stand- .\nards and its campaign for more freedom in the use of copyright material*\nINSTITUTES AND CONFERENCES ON EDUCATION BY RADIO\nDuring the past year, the number of institutes and conferences on ed¬\nucation by radio has definitely increased* In addition to the Twelfth Annual\nInstitute for Education by Radio held at Ohio State University, the Fourth Annual\nSchool Broadcast Conference held in Chicago, the Fourth Annual KSTP Conference on\nEducational Broadcasting held at Minneapolis, a Conference on Applied Radio was\ninaugurated at the State University of Iowa, a similar conference was set up at\nthe University of Texas, and others, regional or statewide in scope, were held\nor have been planned* In addition, at various national and state meetings of\nschool administrators, of teachers of speech, of teachers of journalism and of\nEnglish teachers, radio sections have been added to the program*\nULTRA-HIGH FREQUENCIES AND FREQUENCY MODULATION\nThese two subjects were covered so thoroughly in chairman Keller's re¬\nport of last year that it is unnecessary to comment further here.\nThe Education by Radio bulletin of the National Committee on Education\nby Radio, the Service Bulletin of the F.R.E*C., and the News Letter on radio,\nthe press, and motion pictures published at Ohio State University have kept ed¬\nucators informed about applications for these frequencies and their use by schools*\nNew York City, Cleveland, and Kentucky are, of course, outstanding examples of\nthe development in this area of radio*\nROLL CALL OF N.U.E.A. STATES\nALABAMA - Programs of educational and entertainment value, classes in radio\nscript writing, and the development of a curriculum in training for the various\nfields of radio are outstanding features of the past year at the University of\nAlabama* Radio operation is in the Extension Division, the radio arts curriculum\nis in a department of the College of Arts and Sciences. The three major state\nsupported institutions in Alabama - the University of Alabama, Alabama Poly¬\ntechnic Institute, and Alabama College - own radio station WPI, Birmingham, but\nfor many years have operated it under a lease* Broadcasting has been by wire\nthrough this station or through a commercial station WJRD, located at Tuscaloosa*\nA modern studio suite has been built in the Alabama Union.\nARIZONA - The University has a radio studio on the campus but does not own a\nbroadcasting station* NBC and CBS networks have stations in Tucson and they al¬\nlow from fifteen minutes to an hour per day. Radio service is a part of the\ngeneral University Extension service. A Radio Council consists of representa¬\ntives from each of seven undergraduate colleges*\nARKANSAS - The University does not own or operate a radio station* The class in\nradio speech dramatized incidents in history of Arkansas for presentation over\ncommercial station* Agricultural editor sends daily manuscript to all radio"
}