{
  "id": "d1807-3",
  "text": "-4-\nstations in the state* County and Home Demonstration agents make scheduled ap¬\npearances over radio stations* Special broadcasts are presented for 4H Achieve¬\nment Day and Better Homes Week*\nCALIFORNIA - The University of California has continued its series of radio\nbroadcasts by \"The University Explorer\", and its daily agricultural program in\nvarious localities of the state* During the past year, at the request of NBC,\nPresident Sproul made an effort to organize a California Radio Council with the\nBerkeley and Los Angeles campuses of the University of California, Stanford\nUniversity, California Institute of Technology, and the University of Southern\nCalifornia as charter members* These institutions and NBC were to contribute com¬\nparable sums to the budget of the council for a trial period of four years. The\ntrustees of Stanford, California Institute of Technology,, and the University of\nSouthern California, however, did not see their way clear to contribute the\nnecessary funds at present for the council plan*\nCOLORADO - The University formerly had its own broadcasting station, but for the\npast ten or twelve years has broadcast over Denver stations. A Radio Committee\nof approximately ten members,.representing various departments of the University,\nplans the programs on subjects which will be of interest and value to people\nof the state. During the past year the University has cooperated extensively\nwith the Rocky Mountain Radio Council and has produced several excellent series\nof programs*.\nFLORIDA - The University of Florida station, WRUF, under the direction of Major\nGarland Powell, continues to make its influence felt both in educational and\ncommercial radio circles.\nGEORGIA - The School of Journalism offers one course in radio., Journalism stu¬\ndents write, prepare and broadcast programs from the studios of WGAU, local com¬\nmercial station. A studio-laboratory has been constructed, equipment for which\nwas donated by newspapers* Regents of the University System have set up a re¬\nward known as the Georgia Foster Peabody Radio Award*. Broadcasts will now\noriginate in the studio-laboratory as projects of the radio class and of the\nstudent radio club*\nHAWAII - The University of Hawaii has continued to use local commercial stations\nfor its broadcasts* The departments which contribute to its radio program are\nAdult Education, Agricultural Extension, and the Agricultural Experiment Station*\nILLINOIS - Station WILL,.owned and operated by the University of Illinois, re¬\nports the most successful year of its history, averaging 10 hours daily of\noperation during week days. Thirty-seven courses were broadcast direct from the\nclassroom. Programs of panel-discussion or round-table type were continued.\nSpecial programs were arranged in the field of education.. A noon-day farm pro¬\ngram was presented by the College of Agriculture every week-day, supplemented by\nspecial broadcasts* Special events and sports events were broadcast, profes¬\nsional colleges participated in the program, and more than 1500 editorials were\nread in \"The Illinois Editorial Review\". Additional personnel is needed as well\nas office and studio space* Professor R* B. Browne is chairman of the Radio\nAdvisory Committee and Mr. Josef F* Wright is Director of the Station.\nINDIANA - During the past year,.three weekly programs have been carried over\nWIRE, Indianapolis, entitled \"The Editorial of the Air\", a round-table discussion."
}