{
  "id": "d1807-4",
  "text": "-5-\nand a half-hour variety program consisting of drama, music and interviews. The\nIndiana University ensemble, consisting of classical and semi-classical music,\nhas been used by the Mutual Broadcasting System as a regular weekly chain pro¬\ngram, The Ninth Central Radio Conference, designed to secure constructive\ncriticism of’educational programs and to determine how mutual cooperation could\nbe developed, was held on the campus last June, Courses are conducted in radio\nbroadcasting, script writing, radio in education and research in radio. New\nheadquarters with the most modern type of equipment, studios, and radio facili¬\nties have recently been secured, Mr, Robert E, Allen is director of radio pro¬\ngrams, and Professor Lee Norvelle is responsible for administrative details,\nIOWA - Radio Station WSUI, at the State University of Iowa, Iowa City, has, dur¬\ning the past year, completed the installation of new transmitting equipment and\ndirectional antennae with a power of 5000 watts day and 1000 watts night. An ap¬\nplication is on file with the F.C.C. to increase the night-time power to 5000\nwatts, A new three story building devoted entirely to broadcasting has been\nerected with new equipment following the latest engineering practice. Total ex¬\npenditure for the project has been approximately f>137,000. In connection with\nthe dedication of the new WSUI studios and transmitter last October, outstanding\nfigures in radio throughout the nation attended a three day Conference on Applied\nRadio at Iowa City, The Station broadcasts approximately thirteen and a quarter\nhours daily. Professor Bruce E. Mahan is Chairman of the Radio Board and Carl\nMenzer is Director of the Station,\nStation WOI at Iowa State College occupies new quarters in a new build¬\ning on the campus at Ames and uses a new 5KW, RCA transmitter and 400 foot verti¬\ncal antenna. Under the direction of W. I. Griffith, station WOI continues its\nhigh rank among educational broadcasting stations, WSUI and WOI cooperate on\nthe radio child study program and other broadcasts of mutual interest.\nKANSAS - The University of Kansas owns and operates its own station, KFKU, which\nshares time with WREN, a regional station affiliated with the NBC Blue Network,\nKFKU is on the air an average of six hours per week during the school year. Dur¬\ning the past year the station broadcast 585 different programs, involving 35 dif¬\nferent departments and eight colleges of the University. Faculty members pre¬\nsented approximately seventy per cent of the total number of programs,\nKansas State College owns and operates station KSAC which shares time\nwith station WIBW at Topeka. Dean H. G. Umberger, Director of Extension at Kansas\nState College is Vice Chairman of the National Committee on Education by Radio\nand Chairman of the Radio Committee of Land Grant Colleges, Under his direction,\nstation KSAC continues to do a good job of educational broadcasting,\nKENTUCKY - University of Kentucky programs are broadcast regularly over the\nMutual Broadcasting System, six carried from coast-to-coast; the Southern Network;\nWHAS, Louisville; WLW, Cincinnati; and WLAP, Lexington. The School of the Air is\npresented five days a week. Five fifteen minute agricultural programs are pre¬\nsented weekly, and many special features originating in the University of Kentucky\nstudios. In order to make the University and its radio features available to\npeople living in the more remote regions of Kentucky, the University has set up\nand equipped 38 listening centers with funds donated by public spirited organ¬\nizations and individuals. As an experiment in testing the value of a controlled\neducational and cultural radio system in the Kentucky mountains, the University\nof Kentucky has established a 100 watt station, WBKY, at Beattyville, to be"
}