{
  "id": "d962-71",
  "text": "- J •\nDean W. Wa Wright\nDecember 18, 1?58\nI think this gives the background* Hoar to the questions on which we need inforrsd\nguidance of the sort which your experience and training can provide* Although\nI know of your enthusiasm for new ideas, and m think this approach has sa element\nof newness in it (which I hops might arouse your enthusiasm tool), m also need to\nse© what \"bugs\" there rosy be in itj and wo rSe^to bo sure we are on the right\ntrack* Therefore your reactions are earnestly invited*\n1) As a first step, what would b© your reaction to our convening (or would\nit be better to suggest that the Foundation itself convene?) a mooting\nof a few Education Deans, and perhaps communication specialists, to plan\nfuture steps?\n2) Who would be good advisors (as a sort of advisoxy or steering committee),\neither institutionally or personally? W©*d not want \"TV enthusiasts\"\nor \" radicals\" $ but we would want people who might entertain the prospect\nof a new area of needed emphasis in teschor training*\n3) Do you think the idea is workable?\nh) We*ve run workshops and seminars already for teachers, representatives of\nteacher-training institutions, and others* Do you think, once the insti¬\ntutions are selected, or themselves volunteer, that they*d find a work¬\nshop for the teachers they select to teach such courses practical?\n£) Would a school of education (like Indiana, for instance) require any\noutside subsidy to undertake this, or would it consider the materials,\nconsultants sad other help wo could give, \"in a central coordinating\ncapacity\" as the Foundation ropyosontative—himself a former respected\nEducationist—puts it, be adequate incentive to such schools to undoav\ntake this?\n6) Does combining the staff of educational stations and closed circuit in¬\nstallations, with teachers (principally those who will plan and appear\non programs, but to a certain extent those who use the programs) look\nlike an impossibly wide straddle? We realise tESE teachers groups and\nprofessional, groups like teachers c£ languages, English, Speech, Science\netc* will undoubtedly develop their am W md radio \"sections,\" We*11\nwant to encourage this. But we see the K&EB as a group of different\nkinds of specialists who, within the organisation, can benefit from\ncrose-polleni^aticm aroong subject area groups as well as between teachers\nsrJ producers or program planners, etc. We feci it essential to keep all\nwho are responsibl® for the supervision of facilities educstica&all^orisntad.\nand feel we oust fasm this cros^fertms«tra^T& good of American\neducation as such* We already hmm well ever 300 individual msbam, both"
}