{
  "id": "d962-72",
  "text": "Deaa W. w. WWLght\nBooenfcsr IB, 1<#8\nteachers end etafT nes&ors* But ?&*?$ net too for along in setting\nup categoric a of noriborshipc Does this Idea moke eenae to you m a\nlarge scale?\n?) Where would tte A^«0,T*£. at isto teitit Hew shout tee A.S.C.D.,\nthe A«A,5»A, end the A.C.E? At what stage, if ever, ahrmi.d tbsy also\nbe involved? uhat otter greupa should ta Sonahlted? W\nw°^f.the AjA»C.3f»E* ho willing to cooperate with the HAHB in a project\nof this sort? Or would it insist on °Joint epoRsarteip\"?\n2“* lM®B PKjeet, with a Director (educator acre\nthan broads ester) red a budget of tea aider of 035,000 to 650,000\nper ye tar, slaae consultants (os we aew see a) would he mede available\nto cooporating institutions, end sons abort courses red/or seninare\nfor people to teach sad* courses would perhaps ba indicated, ss per\nay question above. '\n9) Should there he only regular sessions (training principally itature\n«“®?p *» »«* «*■» licensed aaTS^Bonood\nto actors on an ia-eervice basis?\n10)\nHw mch fear of HAEB, or \"radio-TV &cF dotation would there be?\nIdonU believe those who know the HAEB would have this fere—but\nthere ia msm suspicion, sane of it. justified, of “ operators. •> How\ndoes this relate to how explicit we esn be ia ths of courees\nweere suggest? hfe*re thinking of letting different institutions\ndevelop largely tboir own patterns (whether at tee graduate re under,\n{graduate level* uhothor radio and TV stood be together or separates\nwhether to hare asperate courses for those who teach on TV as ■\nr*.*!1””0*” toochere idw never aspect to gerfora, etcT) Is\nieocwsalp m esemasss too loom?\nn) ?? JElna tte points made ia the €tiaoh©d, dittoed (licLahan) ©tcteasfcist\n^grdfScyt enough to make older the dlfftme botssoea tbs eounseo\npropose (based m a fairly eonsSdBMbao endfy&is of tbs aatoxe of tbs\nvizetess nsdla before m start to l&am hot? to wSald tfesmTSsc? tbs\nr^wsarsssr\n12) Cot&d pnstiool ts(M|S8 bo def©Xepod to\npUM pretest*, «TTl^3of tte\nof tbs ‘ ‘ '"
}