{
  "id": "d1140-1",
  "text": "NAEB NEWS LETTER\nPage 2\nDecember 1, 1943\nSOME WEEKS AGO --ALLEN M|LLER WILL MISS HIS ENCOURAGEMENT IN RADIO WORK\nAT KQAC,...Fred PULLER, WHA MUSIC DIRECTOR, 18 SOMEWHERE »N THE SOUTH\nPact ft c«». *Oavid Johnson, class or *38 or St* Olaf, has succeeded M0 C*\nJensen at WCAL in Northfield. Jensen is in the East*...attending NAEB\nMEETING AND ScrtOOL BROADCAST CONFERENCE WERE THE FOLLOWING, NOT TO\nexclusion of others: Major Harold W. Kent, Joe Wright, WILL; Mac McCarty,\nWHA; David Johnson, WCAL; Carl Menzer, WSUI; Kay Laroic, Detroit; Oave\ns^ Walter Krulevitch, WHA; George Jennings; Mike Hannah,\n#HCU; Pearl Broxam, WSUI; Kenneth Yeeno, KlRO; Bob Miller, WSEZ, Joe Maddy,\nMichigan; and Schooley. Seen about the Conference were: Bob Hudson,\nClarence Brown, Luke Roberts, Chet Ouncan, Willard Cgoff, Leon Levine,\nDuffy Schwartz, Blanche Young, Judith Waller, Sam Lynch, Harriet Hester,\nSherm Lawton, Jules Flanigan, Mark Haas, Jim Hanlon, and others I may have\nneglected to mention at the moment.\nWHA ART EXHIBIT ON TOUR\nMadison, Wis. Nov* 9 — Today h, 8. McCarty, director and chief shipping\nclerk of WHA, Wisconsin State station, shipped out what the station believes\nTO BE THE BIGGE8T TRAVELING EXHIBIT OF ART WORKS IN THE FIELD.\nThere were 23 specially-built cases, designed by H. B,, enclosing nine\nPANELS, EACH WITH TWO PICTURES. EACH EXHI8IT WILL BE SHOWN AT ABOUT 15\nSCHOOLS, AS THERE ARE 328 WISCONSIN SCHOOLS AND TWO IN NORTHERN ILLINOIS\nON THE ROUND ROBIN EXHIBIT LISTS.\nSHT.WM£T 18 ™e SOURCE OF THE PICTURES? TmE 33,739 YOUNGSTERS WHO FOLLOW\nWHA's hisoonjiin School of the Air art course, \"Let's Draw.\" In 1,850\nSCHOOL ROOMS LAST YEAR, THE YOUNG ARTISTS LISTENED TO WEEKLY BROADCASTS,\nPLANNED BY James Schwalbach (recently made principal of the high SCHOOL\nat Whitewater State Teachers College, Whitewater, Wis.), to teach the use\nOF VARIOUS MEDIA, SO THAT PICTURES ARE IN CHALK, WATERCOLGR, AND CRAYON*\nThe course is now in its seventh year under Schwalbach^ direction. It is\nDESIGNED FOR GRADES 6 TO 8, BUT OTHER GRADES 00 USE THE COURSE, AND EVERY\nONCE IN A WHILE A TMIRD OR FOURTH GRADE PUPIL TURNS UP ON THE WEEKLY HONOR\nROLL. THE HONOR ROLL IS CHOSEN FROM THE SEVERAL BEST PICTURES FROM EACH\nBROADCAST, CHOSEN BY THE TEACHER AND SENT TO lilt, ScHWALSACH FOR EVALUCAT I ON\nAND CRITICISM.\nIncluded with each exhibit is a panel describing the exhibit, which bays\nThe Wisconsin School of the Air Presents...An exhibit of drawings and\nPAINTINGS INSPIRED BY MUSIC, DRAMATIZATION AND NARRATION, PLANNED BY JAMES\nSchwalbach of Whitewater Teachers College.w\nIndicative of the fine results of the course, and Mr. Schwalbach's firm\nBELIEF IN ITS VALUE IS HIS REFUSAL TO RELINQUISH HIS *108 OF WRITING SCRIPTS,\nFUDGING ANO CORRESPONDtNG, EVEN THOUGH HE HAS RECENTLY SEEN MADE PRINCIPAL\nOF THE HIGH SCHOOL OF WHITEWATER TEACHERS COLLEGE, WHITEWATER, WISCONSIN,\nWHERE HE HAD FORMERLY BEEN AN ART TEACHER,\nPRO ARTE QUARTET PICTURES OFFERED WHA LISTENERS\nA STRIKING PICTURE OF THE CHAMBER MUSIC GROUP, THE PRO ARTE QUARTET, IS BEING\nOFFCREO FREE TO LISTENERS OF WHA, THE W0 SCONSIN STATE 8TAT ION. PqR THE"
}