{
  "id": "d1140-2",
  "text": "-3-\nMR. APPLEGATE CONTINUESj ”I think your suggestion of a record exchange is a very ex¬\ncellent one and if we are able to build up any kind of library we shall be glad to do\nsome sort of exchanging.”\nFROM DIRECTOR HAROLD G. INGHA]^1, STATION KPKU, IRflVERSITY OF KANSAS, LAVjRENCE; ”As you\nperhaps know, our broadcasting station has not purchased any collection of musical\nrecords, using instead the records which are loaned us by the leading music dealer in\nthis city. The only records which we have purchased are those of the University Glee\nClub, which have been used as a signatory song in introducing and closing our programs.\nThis record was discontinued last year and since we hove used ’.Speak-o-Phone’records\n(aluminum'disks) made by the Glee Club.last year.\n”I feel that I have nothing unique to suggest in our plans for programs this year. It\nmay be as we get into the work for the first semester I will discover that we have\nmade some development which may be of interest to other stations and will be glad to\nforward the information to you.”\nFROM RADIO DIRECTOR ALLEN MILLER, THE UNIVERSITY OF CHICAGO; ”A number of years ago\nthe Victor Phonograph Company inade a record of the University of Chicago songs. The\nconditions, however, were not conducive to the best reproductions so that the finished\nresult is of inferior quality.\nare in no position to make use of records in our program since, as you may know,\nthe Chicago Federation of Musicians has an iron-clad ruling that only union musicians\nat the rate of $17.00 per day may be used for playing records over the air. Obviously,\nthis fee is exorbit^t in viow of the meagre budget available for our educational\nprogram.\n”I will keep you informed regarding any unusual developments in our program during the\nyear.\"\nI am passing the details of these various communications on to the membership think¬\ning that they may be of interest to you as they certainly have been of interest to me.\nIt seems that my former communication relative to the Famous Song Series now being\ncompleted by Miss Miriam Dearth of Station University of Oklahoma, was misunder¬\nstood by some of our members. This is not a recorded musical series. It is designed\nfor an individual soloist to present the work regularly at the station. More details\nrelative to this feature will be given in the very near future.\nThere are many projects that may be developed by the members of the Association of Col¬\nlege and University Broadcasting Stations from i/diich directors throughout the country\nwho hold membership in the Association may profit in presenting their programs. In my\nopinion, we can make this exchange of ideas a valuable part of the work of the Associa¬\ntion. I want to especially urge that of-f^icials of our member stations send at once\nany suggestions that you may have th«t other stations may use on nrovon projects you\nhave used in your programs or projects contemplated for the future. Below are some\nquestions T«hich may stimulate thought in this\" line and which may be a \"life saver\" for\nmany of our directors in introducing new features in their programs;\n(1) Do you have radio debates? If so, by what organizations? How do\nyou conduct them? ITJhat is the response? Yiihat suggestions have\nyou for improving same?\n(2) Do you sponsor programs for \"outside” organizations, such as civic\nclubs, the American Legion, women’s clubs, etc.? If so, how do you\nconduct them? 1/Vhat has been the result? How may other stations use\nthem and thereby improve their programs?"
}