{
  "id": "d1003-143",
  "text": "Mouseketeers\nin Action\nMickey Mouse\nBook Club\nMeet Sooty\nWhat I Want to Be\nSeries\nSpin and Marty\n“The Mouseketeers” is the official name for a group of carefully selected boys\nand girls who possess considerable talent. On each day’s program one 15-minute\nsegment will be devoted to these very capable young people.\nEach day the Mouseketeers will vary their type of contribution to the program.\nToday they may be staging a musical number. Yesterday perhaps they participated\nin “Circus Day.” Tomorrow they may invite\nsome especially talented youngster from outside\nof their group to be their “Guest of the Day.”\nLater a talented adult may be invited to perform.\nStill again, it may be a contest between popular\nmusic and classical music with all musicians —\nMouseketeers.\nWe believe young people are interested in many\nthings—including other young people. We\nbelieve, too, that talent in people can sometimes\nbe stimulated by seeing talent exhibited\nby others.\nA visual “Book Review” would only be possible\nthrough television, and this approach will be\nused from time to time on the program. Joel\nChandler Harris’ immortal UNCLE REMUS\nTALES, the deep love of a boy for a horse as\ntold in “The Littlest Outlaw”—these are typical\nof real books, presented as books on the\nMICKEY MOUSE BOOK CLUB.\nWhen we meet Sooty, we meet not only the\nNumber 1 television star of England and the\nContinent, but we also meet a pretty rare\nperson —a puppet who doesn’t talk. We’re very\nproud that Sooty, already a favorite across the\nocean, officially joins the MICKEY MOUSE\nCLUB. Disney photographers in England have\nprovided the opportunity to introduce this\nunique performer to American audiences.\nNUMBER 1. THE AIRLINE\nPILOT AND HOSTESS\nOur pilot and hostess are a boy and girl, each\n12 years old, who have the rare opportunity to\nexperience every phase in the operation of\na modern airline. The girl goes through a “host¬\ness training” school —the boy learns the many\nresponsibilities of being a pilot. Ten episodes,\neach filling a- 15-minute period, are used to tell\nall aspects of this story. It represents the first\nin a series of “CAREER” stories we call\n“WHAT I WANT TO BE,”\nMARTY MARKHAM, a lonely, pampered boy\nfrom Boston, finds himself attending a Western\nranch school. Here for the first time MARTY\nis on his own. The lessons he rather painfully\nlearns about people and animals, his successful\nefforts to adjust to robust friends and teachers,\nthe gradual maturing of his emotions—these\nare the elements in this heart-warming, exten¬\nsive series of 15-minute episodes (24) which\nwe call SPIN AND MARTY"
}