{
  "id": "d1003-151",
  "text": "The Ear:\nProgram Digest: Your ear does two jobs —it hears and it helps keep your balance. All through\nhistory man’s ears have been one of his chief sources of progress because they brought him\ninformation which gave him ideas.\nLet’s take a tune on a trip through the ear. To get started we need two things, sound and\nsomeone with ears to hear. The tune floats on sound waves in the air. It enters the ear which\nhas three parts; the outer, middle and inner ear. The tune is gathered in by the outer ear and\nsent into the auditory canal. Our tune strikes the eardrum, reverberates through the drum-skin\nand goes into the middle ear. Now, the tune is picked up by the auditory ossicles (the hammer,\nanvil and stirrup, the smallest bones in the body). They pass the tune into the inner ear. Here\nit travels through the cochlea which is a spiral filled with fluids and contains the organ of corti.\nThe corti organ carries the tune to the auditory nerve which sends it to the brain in its full harmony.\nThe ear’s second job, to help you keep yoUr balance, is done by the semicircular canals which\nare filled with fluid. When you tilt your head, the liquid presses harder against some nerve cells\nthan others and sends the message to your brain. They tell you the different speeds you travel, too.\nYour ears are wonderfully constructed. Take care of them.\nThe Eye:\nProgram Digest: Man’s sense of sight is one of the strongest in the animal world. Through\nintelligence he has invented instruments to increase his natural sight.\nThe human eye works much like a camera. When the eye sees an object, reflected light rays\npass through the eye lens and cross. The rays from the bottom of the object strike the top of the\nlens and vice versa. The image is projected on the retina which is the back of the eye. The\nretina receives the image upside down. In the millionth of a second, the brain reverses the\nimage and you SEE IT right-side up.\nThe eye has two kinds of sight receptors in the iris, cones and rods. The cones are in the\ncenter of the eye and see bright light, colors and sharp details. The rods surround the center\nand see dim light, dark tones and greys. So, you can see by day or night.\nTake care of your eyes. Get enough sleep. Have correct light when you work or\nread. Keep sharp, pointed objects away from your eyes.\nSmell and Taste:\nProgram Digest: Life would be pretty dull without your sense of taste and smell. Usually,\nthese two senses work together. In man’s nasal cavity his smelling area is about the size of a\nfingernail, but he has the most developed taste of all the animals. He likes a great variety of\ntasty dishes, but without his sense of smell his taste buds, which are the taste receptors on the\ntongue, would have only four taste sensations; sweet, sour, salty and bitter. It takes both the\nsense of smell and taste to enjoy flavor."
}