{
  "id": "d1003-153",
  "text": "FIRE:\nProgram Digest:\n1. Early man learned that fire gave him light, cooked his food, protected him from wild\nanimals, hardened his weapons, fired his pottery. By the use and control of fire man built\na new world for himself.\n2. Y-O-U have to be your own fireman. A fireman must know WHAT IS FIRE? Fire —some¬\nthing to burn plus heat plus air.\n3. Fire Safety in the Home—avoid hazards such as un¬\nscreened fireplaces, overloaded circuits, oily rags, care¬\nless handling of matches, flammable liquids not properly\nstored. Keep the number of your fire dept, posted by\nyour telephone.\nFire Safety in the Forest: Put water and sand on\ncampfires.\n4. JIMINY has a fire prevention contest between Y-O-U\nand a COMMON ORDINARY FOOL.\nTHE PEDESTRIAN\nProgram Digest:\n1. From the dawn of history the pedestrian has had his problems. Little has ever been done\nfor his safety until recently. For instance, the first sidewalks appeared in Paris in 1781. The\ninvention of the automobile added to the pedestrian’s problems.\n2. Y-O-U are the pedestrian. Y-O-U need to know: How to Walk Properly—good posture\nhelps keep you alert — Where to Walk — cross streets at intersections, keep on sidewalks\nwhenever possible, walk on left side of street against traffic when there are no sidewalks.\nWhen to Walk — \\oo\\. both ways before you cross the street, don’t dart out suddenly, obey\ntraffic signals and stop signs, make sure cars stop before you cross the street.\n3. JIMINY CRICKET plays his game.\nI’M NO FOOL IN WATER\nProgram Digest:\n1. Man is primarily a land creature. He had to learn how to survive in water; not to fear\nwater; how to swim in it. Today swimming has become a healthful, popular sport and a pos¬\nsible means of saving one’s life.\n2. Y-O-U need to know how to be safe in water. Swim at supervised areas, wait at least two\nhrs. after eating, swim with others —never alone, dive only where you know the water is\ndeep enough, enjoy yourself but don’t overdo.\n3. JIMINY plays a water safety game with Y-O-U and a COMMON ORDINARY FOOL.\nI’M NO FOOL WHEN I RELAX\nProgram Digest:\n1. Today man has more time for relaxation than ever before. He needs relaxation. He enjoys it.\n2. Y-O-U can learn to relax safely. Remember, the body can relax but the mind should always\nbe alert. Know the basic safety rules —play in safe places, don’t show-off, don’t overdo, hike\non well-marked trails, swim where there’s a lifeguard, never skate in the street, don’t over¬\nload a boat. Use good judgment—Your safety depends on it.\n3. JIMINY CRICKET plays a safety game.\nTHE FIRE TRIANGLE: Remove one\nelement and there is no fire."
}