{
  "id": "d1003-22",
  "text": "BOARD OF EDUCATION\nOF THE\nCITY OF ST. LOUIS\nOFFICE OF L, 1955\nDivision of Audio-Visual Education\n1517 SOUTH THERESA AVENUE (4)\nDr# Walter Witticsh\nvmmmt o* Wisconsin\nMadison, Wisconsin\nDear Kelts\nfa have just discovered that the Educator^ %Lde to Free Tapes, eripts\nand Transcriptions, compiled and edited by you and lertie L. Hanson,\nincludes fourteen science programs of our mn LETfS FXWD OUT radio series,\ndistributed by the Division of University Extension, Boston, Massachusetts.\nThese are listed on pages 65-66#\ny\nThese programs represent a series done by the St# Louis Board of Education\nradio station KSiH# Through the National Association of Educational\nBroadcasters Tape Network, these programs have been made available to\nits member stations, including, as you probably know, your own *HA# These\nhave been released for distribution through no other source#\nAn essential part of this series Is the teacher*s handbook, giving in¬\nformation about the preparation nece sary for each program# We regard\nsuch instructions as the note at the top of page 65 as inadequate and\nsuperficial#\n0\nKelsey Sweatt is using these programs without our permission because he\nhas never contacted us# For hi* to list them In a national publication\nas available fro® his Division with the inference that they originated\nthere is hard for us to understand. In addition, it is our flra belief\nthat the LF?f.-» FTW0 DDT ser5.es cannot be used successfully vithout the\nhandbook which was written to accompany it#\nYW# know that neither you. «i»s Hanson, nor the Educators Progress Servics,\nwero aware of the situation regarding this LST*S ?TiD GOT Hating# *•\nfool that it is important that a correction be inserted immediately In\nall catalogs of this edition, withdrawing the series, and that all\npurchasers prior to this time be notified of the change. W# are, of\ncourse, writinr Kelsey $«eatt#\nMy concern, Walt, goes beyond the thing that has happens*! in terms of\nthe s&s-listing of L£T*S FIND OUT# I do not want, nor do you, to have\nthe chairman of the BAVI tape recordings committee, through his enthusiasm\nand over-eagerness distribute any unauthorised tapes whatever the source#\nTape recordings are much too i»ortant in the whole audio-visual field\nto be issued too fast for the oarefal planning and selection that they\ndeserve#\nSincerely yours.\nair\nELIZABETH GOLTSmiAM, Directsr\nDivision of Audio-Visual Education"
}