{
  "id": "d1003-41",
  "text": "u\ninclude selection, acquisition, and production of such materials as pictures,\ngraphs, filmstrips, motion pictures, maps, and many other kinds of instruc¬\ntional materials.\nIt is prepared to furnish and assist in the use of radio, television, disc\nand tape recorders, and numerous other devices useful in improving teaching.\nAt times it mil also produce materials and equipment peculiarly suited to the\nneeds of special instructional efforts on the campus. Such productions may\nrange from glass slides for science teaching to motion pictures for the humani¬\nties course, from disc recordings for the music department to tapes for speech\ninstruction, from dry mounts of pictures for art classes to handmade lantern\nslides for teacher education. Indeed the range of resources in an audio¬\nvisual center is as wide as the multisensory experiences of life itself.\nCollege instruction frequently reflects the mistaken idea that audio¬\nvisual materials are fine for the elementary and secondary schools but unneces¬\nsary at the college level. This concept neglects the fact that many word-\ncentered ideas in chemistry or in art may be as abstract to the college student\nas the word \"transportation\" is to the primary pupil. It is true, but frequent¬\nly overlooked in our verbal traditional school, that there is little or no\nintrinsic meaning in a word or in a whole book of words. The meaning is in the\nbackground of experience which the individual brings to the word. If words\nhappen to symbolize something in an individuals past e^erience and if they\nhappen to stimulate the recall of that experience, the words then and only then\ncan be used \"meaningfully\" by that individual. By helping to supply or recall\nthis experience, audio-visual instruction seeks to provide experiences that will\ngive meaning to the words that represent them.\nMany educators have been aware of the value of multisensory teaching mate¬\nrials for a long time. Even Mark Hopkins used more than a log. In l8Ul\nPresident Hopkins of Williams College purchased a \"new-fangled device - a model"
}