{
  "id": "d1003-44",
  "text": "7\nSelection and Circulation of Materials and Equipment\nFaculty members and others to use the center frequently suggest materials\nfor purchase or rental* Others want to know what is available both in the\ncenter and from other sources* Extensive reference files must be maintained,\nso that materials of all kinds can be located easily and appropriate informa¬\ntion given about them®\nMaterials to be purchased must be previewed, auditioned, or examined ( ,\n)» Staff members of the center, specialists in the subject area, and frequent¬\nly students are involved* Once the materials are purchased, they must then be\nclassified, accessioned, and cataloged (_, _, _)* Prospective users must\nbe regularly notified of the new materials and equipment.\nMaterials must be stored where they are readily available for use. This\nrequires accessible storage facilities of marry kinds; e, g,, designed to ac¬\ncommodate equipment, motion pictures, filmstrips, recordings, tapes, maps,\nflat pictures, charts, publications, slides, exhibits, and numerous other things.\nThe center must be ready and able to assist the faculty, students, and\ncommunity groups in the selection of materials and equipment for their specific\neducational purposes* It must be ready to provide such aid on a momenta\nnotice from personal calls, by telephone, or by mail. In many colleges and\nuniversities this is a big responsibility, involving not only the campus service\narea but the entire state or even several states, A centralized audio-visual\nprogram facilitates such service*\n\"When a faculty member calls the center or sends in a request for the use\nof some materials, a chain of activities is touched off. First, a staff member\nrecords the request and checks to be sure the material is available when re¬\nquested* He then books or reserves the material for the requested time and\nplace. If equipment is needed, this must be scheduled and possibly an equip¬\nment operator assigned. Materials and equipment must be delivered together to"
}