{
  "id": "d1003-46",
  "text": "9\nwhich are familiar and for which there is a felt need and then to expand as\ninterest and vision of the faculty increase.\nFor example, a basic need is the mounting of pictures and other illustra-\ntive materials. The skill and equipment needed to provide this service are\nsimple. Lettering technics, combined with the mounted pictures, will enlarge\nthe scope of teaching materials which can be prepared. Likewise, by introducing\ncoloring materials, such as slide crayons5 colored inks; water colors; colored\nadhesive; stencils; and spray painting with the airbrush, materials produced can\nbe enlivened and made more effective.\nMaterials for projection can be produced by very simple photographic tech¬\nnics. Large transparencies for use with overhead projectors are simple to make\nand inexpensive. Negatives can be bound as slides and 2x2 color slides produced.\n\"When combined with lettered captions, photographic slide stories can be prepared.\nFrom this stage, it is only a step to filmstrip production.\nMaking tape recordings is usually introduced early in a production program.\nTape recording is inexpensive and has a wide range of usefulness*\nAn initial outlay of $10,000 to $l£,000 will provide adequate minimum equip¬\nment for graphic, photographic, and motion picture production in a college cen¬\nter. A suggested basic list of minimum production equipment is included in\nAppendix C.\nThe production function of the center may also assist economically and\neffectively in the important job of explaining the purpose and program of the\ncollege to the students, the faculty, the alumni, and the community. This\nfunction includes the production of wpublic relations” materials; photograph¬\ning of athletic events; preparation of motion pictures, filmstrips, TV programs,\nkinescopes, and other visual materials for limited distribution. Such produc¬\ntion should be viewed as only a concomitant advantage of maintaining production\nfacilities at the center* The emphasis and major attention in the operation of\nsuch facilities should at all times be on providing materials to assist in"
}