{
  "id": "d1003-64",
  "text": "27\nwork desk or table; shipping cases, bags, boxes, cartons; addressing devices;\ntape, rope, string, and dispensers; stools; hand tools; wrapping paper; labels;\na nonsplash sink; first-aid materials.\nObviously, not all the facilities are necessary when services are confined\nto one campus. However, even then rental materials and preview materials must\nbe shipped*\nRecommended space allocation for shipping and receiving: 200 - I4OO sq. ft.\nSpace needs are directly related to quantity and type of materials circulated\nand to percentage of off-campus shipments.\nSome have found a MUM shaped or modified nUw shaped shipping area advanta¬\ngeous. One side can be used for receiving, one side for shipping, and the control\ndesk can be between the two.\ne. Inspection and Repair of Materials - Inspection and repair of used ma¬\nterials is a vital link in the chain of audio-visual materials service. Naturally,\nthe size of the area needed for this activity is closely related to the volume of\ncirculation. The inspection of films may consume the majority of attention in\nthis area because films are circulated from a centralized source in larger num¬\nbers than other less expensive materials. Nevertheless, it is important to\nprovide space and facilities also for the repair of slides, maps, exhibits, and\nall other materials which are circulated. Maintenance records should be kept\non the condition, repair, and replacement parts added for each item circulated.\nAn average inspector can inspect and repair $0 to 80 - I4.OO foot reels per\nday. Librarians with large film circulations may find it more economical to\ninstall mechanical film inspectors.\nTable viewers for inspecting slides and filmstrips and large flat surfaces\nfor inspecting recordings, maps, charts, and other pictorial materials are\nessential. The spaces below the flat surfaces may be used for storage cabinets.\nThe inspection area should be well lighted and should have convenient elec¬\ntrical outlets. This area must be well ventilated and should have special fans"
}