{
  "id": "d1003-69",
  "text": "32\nLarger programs will require more extensive facilities*\ne. Motion Picture Production - Minimum space for production of motion pic¬\ntures should provide office-work areas for the production staff; clean, dry,\ntemperature controlled storage space for film stock; and equipment storage space.\nIt is desirable to have access to a well equipped studio, an editing room, a\npreview area, and a narration booth. The production area should, whenever\npossible, be near the still photographic and graphic arts areas.\nMinimum equipment includes: a collapsible free head tripod; a collapsible\nT; one 16mm camera, variable speeds; a set of three lenses; a light meter; rack-\nover plate; set of filters; one colortran; six gator grips with 15>0 watt reflec¬\ntor bulbs; one 1000 watt spot; 100 foot heavy duty, extension cord; editing\nbench; pair of professional rewinds; pair of I4OO foot rewinds; negative film\nsplicer, not diagonal; film viewer with at least U” screen; high quality, rever¬\nsible, sound projector.\nThe University Film Producers Association lists equipment needed to produce\nmotion pictures in black and white or color with sound recorded by an outside\nsource and equipment required for making sound tracks and for engaging in more\nambitious production (_).\nRecommended space allocation for motion picture productions Minimum for\noffice and storage, 200 sq. ft. Studio, minimum 201 x 301 with height of 10*,\nEditing room, 9’ x 12!.\nf. Television Production - Television space and facilities will range all\nthe way from simple closed-circuit systems to elaborate studios and transmitters.\nEven when commercial or educational TV is available to a campus, closed-circuit\nis needed.\nRecently immature, but highly sensitive, camera tubes haveQjeen developed\nwhich make possible the production of relative small but complete TV cameras.\nTo effect a closed-circuit camera chain, all that is necessary is to connect\nthe camera to a television receiver or receivers by means of a coaxial cable."
}