{
  "id": "d1003-76",
  "text": "39\nnew materials* such as posters* slides* picture files* and filmstrips\\ to\nlisten to new recordings5 or to see examples of methods of classroom light con¬\ntrol* It is here that students learn to operate equipment and to prepare dis¬\nplays for classroom discussion* a series of slides integrated with a unit of\nstudy* or select materials to be used in their student teaching*\nIn colleges having graduate programs to prepare audio-visual supervisors*\nthe teaching materials center offers an opportunity for internship experience\nwhich should be a required part of their professional education.\nAt the present time* many different titles are used for what is referred\nto here as the teaching materials center; for example* curriculum materials\ncenter or laboratory* instructional materials center or laboratory* audio¬\nvisual laboratory or workshop* and audio-visual demonstration centers. Often\nthe more general terms indicate that the laboratory contains all kinds of\nteaching materials rather than audio-visual materials alone.\nSpace and Facilities\nIn institutions with a small enrollment in teacher education* the teaching\nmaterials center may be an integral part of the audio-visual center. In larger\nteacher education institutions, the teaching materials center is more apt to\nbe an integral part of the school or college of education* Often the center\nis administered by the same people who teach the audio-visual courses.\nIn its simplest form* the teaching materials center is a flexible, expanded*\ndemonstration classroom unit, equipped with the latest teaching materials and\nequipment and with a professional library. It should be capable of being re¬\nvised, and if necessary* remodeled as new needs* theories* and devices appear.\nA suggested list of materials and equipment for A? demonstration centers with\n$1000, $£000, and $10*000 budgets is given in Appendix D.\nIllustrations and brief statements of purposes* spaces* and facilities\nare given for five sample teaching materials centers. Additional information\ncan be gained from references given in the bibliography."
}