{
  "id": "d1189-2",
  "text": "- 3 -\nOklahoma - Broadcasting Service is an independent unit answerable to\nthe President,\nOhio State - This isn’t going to be so easy, Mrs. Tyler says that\nstation operation is very democratic; that all programs are decided\nupon by a staff meeting of the entire staff in which about 9\ndifferent directors (see page 2) participate. The supervising\nofficer is a Station Director of Radio who is primarily interested\nin hiring help. Above him or equal to him is a Director of Radio\ninterested in tho various course in radio taught in the University\nas well as planning radio programs, in fact, in all radio planning*\nThere is a Radio Committee in each school and college of the\nUniversity which submits to him and to the committee, plans for\nprograms from each school or college, X don’t know to whom the\nDirector of Radio is responsible, but it seems that he can be over¬\nruled on broadcasts by the station Director. Sounds a little like\nNew Deal Democratic. Dramatic programs are presented by the \\70SU\nPlayers, which is an independent organization, not a Speech Depart¬\nment class.\nMinnesota - Director of Radio is a member of the Speech Department faculty\nand yet the radio workshop is not connected with any department, al¬\nthough its faculty advisor is the director of the University Theatre\nwho devotes h time to radio. This radio Guild is a very strong\norganization. So strong that the membership has been limited to\n100. The neophytes do such routine work as dittoing scripts* When\nthey have learned to do a good Job, they are given auditions, and\nare possibly used on programs with the approval of the station\ndirector. The technical operation of the station is entirely sep¬\narate from the Engineering College*\nIllinois - Their radio station se^ms to be under Joe Wright, who as nearly\nas I can judge, is director of Public Relations for the University*\nHe has an advisory committee appointed by the President. However,\nbroadcasting is said to be an independent unit which reports to\nthe President.\nState University of Iowa - Radio course3 are taught in various departments\nsuch as Speech, Journalism, etc. One studio is used for a class\nbroadcast, but not for classroom teaching. Has a Radio Guild and\nissues certificates to students who do high grade of work. Members\nmust have high scholarship rating*\nPurdue - Has 3 directors of the Station, all of whom report directly to\nthe President which should be a little confusing. Purdue has an\narrangement whereby students who work in broadcasting get scholastic\ncredit for work done on the air, Such students are permitted such\nwork only with the approval of ';he station’s Broadcasting Director\nand get one, two or three hours credit.\nMichigan State - The director is responsible only to the President of the\nCollege, but has an advisory committee which he can fall back on*\nThe station is entirely separate from various departments."
}