{
  "id": "d1848-2",
  "text": "-3-\nSERVICE\nPullman, Wash., March ^ — John Blake, KWSC Production Manager was cited by local\nnewspaper editors and citizens for exceptional help as producer and radio director\nof the Pullman Hospital Association's drive for a building in that city. Blake was\nnamed as one of the leaders in getting the drive over its 4200,000 top.\n♦ * *\nCOURSES\nPullman, Wash., March -- KWSC has added a course for college students on \"Radio\nFundamentals.\" Taught by Chief Engineer George Frese, classes limited to thirty-\nfive qualified students are held at the KWSC transmitter and in the Department of\nElectrical Engineering buildings at the State College of Washington. Course has\nbeen accredited as \"E.E.t13\" and was established upon recognition of the industry's\nneed for trained combination announcer-engineersj course will lead to examination\nfor first-class phone license.\nPullman, Wash., March __ -- KWSC has added a course at college undergraduate and\ngraduate level on \"Home Economics Broadcasting.\" Course is conducted by Ellen\nRoberts, KWSC's new Women's Program Editor, long in radio, who emphasizes the methods\nof building homemakers' programs and the participation of women in radio broadcasts.\n* * *\nPERSONNEL\nPullman, Wash., March -- Arthur MacKelvie, KWSC staff announcer, to announcing\nstaff of KHQ, Spokane,\nPullman, Wash., March — John McCallum, KW$C sportscaster-editor, first individual\ntalent offered (February) to commercial stations, snapped up by The Daily Oregonian,\nowners of KGW, Portland, Oregon.\nPullman, Wash., March ^ -- Helen Flint, KWSC Special Events Department, has taken\na similar position with KEI0, Pocatello, Idaho.\nPullman, Wash,, March -- George Mooney, former KWSC announcer and recently sports-\ncasting for the Ruzorback Network, is now Station Manager of new KWEM, West Memphis,\nArkansas.\nPullman, Wash,, March __ — Dick Weeks, second individual new talent for radio, to\nbe offered to comercial stations next month, is airing \"Personal Choice\" on KWSC.\nWeeks has an appealing style of writing and M.C.-ing the show for women. Mail,\npoetry requests, arcusing comments about him, and choices of music are coming in\nfrom the area of the Idaho-Oregon-Washington corner. Third individual youthful\nperformer, available in June, was announced recently as Bill Powell. Powell took\nthe lead part in the first KWSC Radio ‘Workshop production, March 3, as \"the talk¬\ning cat who runs for governor,\" Multi-voiced Powell also has a new show Saturday\nafternoons on KWSC tagged \"The Character's Record Shop.\" All seven voices on the\nshow are Powell's.\nA new personality is teamed with Bob Curtis, Associated Oil Corporation's west coast\nsportscaster, on the \"Sports Final\" over KWSC, Pullman, Washington. Fellow staff\nannouncers refer to him simply as \"Uncle Jim.\" Jim Rue comes from a long line of\nsportsmen. His uncle is the famous \"Chubby\" Rue of the International League. Then\nthere's Jim's dad, Joe Rue, starting his ninth year as umpire for the American\nLeague. Past year Jim schooled at NBC in Hollywood under John Swayzze, News and\nSports Director of the NBC Western Division.\nEldon Barr, KWSC Program Director, was asked recently how he knew so much about\nprogramming what appealed to women, as witness his new back-to-back homemakers'\nshows every morning, Barr has long been enigmatic concerning sources of his know¬\nledge of what goes with the gals in aprons. Some suspected the Program Director\ngot the inside track from his wife. But Barr let a surprising cat out of the bag\nwhen he admitted that his uncanny know-how about such shows was due not to informa¬\ntion from his wife, nor even some other homemaking woman specialist, but from one\nof his best male acquaintances, John Dint, Dint, Barr explained, is the issue of a\nbanker and a Junior Leaguer, but has overcome this handicap by hard work and clean\nhobbies such as horses. Now Barr even thinks v/ell of him in the radio programming"
}