{
  "id": "d1848-3",
  "text": "-4-\nfield. Non-Active ChieJ* Male Advisor On Aomen’s Programs is what Barr calls him,\nin the language of the flowers. All day, it develops. Dint delivers fearless\nopinions on women’s conversations and interests, and for a long time he couldn’t\nunderstand why KWSC’s Frogram Director should cower behind the record files or\npull a blanket over his head when a woman commentator asked, \"What do you think\nof my program, Mr. Barr?\" As Mr. Dink often said, generously, why not give a woman\nthe benefit of a man’s good taste and knowledge of daytime programs. Seems to have\nworked, from the mail and popularity of the morning schedule.\n* * *\nNBAS\nProgram Director Eldon Barr, KWSC, Pullman, Washington has had a special news manual\nprepared for utilization by his news department, now headed by Robert Seaman,\nManual outlines policy, emergencies, operation of teletype, editing, and general\nhints on newswriting; The edition was ’written by ex-News Editor of KWSC, Bob\nSwa rtz •\nPullman, 'Wash., March — KWSC will take a different step in news programming\nabout mid-March, according to Program Director Eldon Barr. News bulletins arriv¬\ning during the night will get a five-minute airing at 7:00 a.m., and again at\n8:00 a.m. but with added commentary on them in the second 10-minute slot. At\n10:00 a.m. the station will give 15-minutes news of the world from the previous\n12 hours since the station’s day-before signoff. A 3:00 p.m. daily news broadcast\nwill include items notably for women. Also new will be the 9:00-9:30 p.m. round¬\nup of all evening news from every field, employing six newscastersj and a full\nhour at 12:00 noon of news bulletins and music designed for regional and local,\nrural and home audiences.\n* * *\n\"Y\" RADIO SERIES\nPullman, Wash., March ^ — First guest speaker on a new YMCA-sponsored radio pro¬\ngram for KWSC was Dr, Wilson Compton, President of the State College of ’Washington.\nOther speakers booked for future programs at the 6:50 a,m. daily time include Dr,\nElwin H. Scheyer, executive secretary of pacific Northwest Conference of the\nMethodist Board of Education; Alfred Butler, expert in the field of physics; William\nK. Genne, National Student YMCA Secretary of the Fhcific Northwest; Lloyd Elian,\nExtension Rural Sociologist; Dr. Harold V, Jensen, pastor of the First Baptist\nChurch of Seattle; and Dr. John L. Anderson, Dean of the College of Idaho.\n* * *\nNOTES\nAttention of men who are not fathers to the KWSC, Pullman, 'Washington \"Story Lady\"\nprogram for small children may be attributed to circulation of photographs of the\nlady herself, Pat Martin. Miss Martin is a gorgeous 18-year-old redhead.\nThough the favored team lost. Production Manager John Blake, KWSC, Pullman, Wash¬\nington was delighted with performance of his sports announcers on broadcasts of\nUniversity of Minnesota-Washington State College boxing meet at Pullman, and the\nWashington State College-University of ’Washington basketball game in Seattle,\n* ♦ ♦\nCONCERT\nPullman, Wash., March — The public interest station KW$C is now presenting two\nbroadcasts daily of topnotch concert and symphonic works on new recordings —\n\"Masterworks\" at 3:30 p.m. and \"Concert Hall Hour\" at 8:00 p.m. The latter has\nan unusual production format which pleases the audience. The program opens with\nthe ticking, slow and soft, of a metronome which fades as announcer states simple\nintroduction to the performance. Ihere is no adenoidally rapturous description of\ncomposer, symphony, artists; audience to which the program-content appeals has been\nfound as knowledgeful of classical music as the Continuity Department. After the\nmajor selection, which fills better than a half-hour, there is a repeated statement\nof the information given at the start and a mention of the recording company which"
}