{
  "id": "d500-103",
  "text": "NAEB HEADQUARTERS\n/\n</\n4\nTO;\nMembers of the NAEB RADIO NETWORK\nJuly 20* 1954\nFROM; Harry J„\nSkomieii ^ ^ '\nSUBJECT; Postage for Network Tape Shipments from Headquarters to youe\nAs you may recall a questionnaire went out to all of you on April 30\nrequesting your reaction to paying postage charges on NAEB Network tapes from\nHeadquarters to you* as well as the present postage charges which you are already\nhearingo At that time the reasons for needing to consider this step were explained «\nOn June 23 a tabulation of all replies wae made* The results were as\nfollows;\n\"Ies» votes (33)\n28 stations answered simply nTesw\n4 stations said nIes?w but it will be tough\n(1 station has answered wXesM since the above tabulation)\n*Now votes (15)\n8 stations voted simply nNon\n1 station indicated it would perhaps have to drop out\n1 station indicated it would need time to make budgetary\nprovision\n3 stations voted ^No52 in principle* but will conform\n1 station voted ^o* to paying all, but could pay partial costs\n1 station voted **Nofw but stated it was forced to drop Network\nservice anyway\nUndecided or indefinite (3)\n3 stations indicated that it would be very difficulty but\ndid not specifically vote either \"No11 or wYesn.\nThis tabulation was submitted to the Board of Directors on June 23, the\nday it was completed«, A partial vote by them indicated that a majority favored\nproceeding with billing for postage, in view of the increasing need of the Network\nto take over more and more of its own expenses. Feeling that this was an extremely\nimportant vote, however* the Executive Director wired each member of the Board who\nhad not yet voted* The last vote has just now been received. With every member\nvoting* the Board has supported the membership2® vote that we proceed with billing\nmembers for the postage shipment charges from Headquarters to the respective stations.\nIn the matter of how to handle these billings* various opinions were\nexpressed. The system which seems to be acceptable is the submission of a quarterly"
}