{
  "id": "d500-32",
  "text": "-2-\nAt the beginning of 1952 organizational plans had been set, with\nthree writers assigned to five shows each. Ultimately, one of the writers\nwas not able to continue; the total number of shows was reduced from fif¬\nteen to thirteen; and two of the subjects were assigned to other writers,\ntwo to Mr. Sinclair. One script subject was dropped by Peterson.\nProduction was organised early in the year. The Director visited\nToronto in March to secure the services of Mr. Andrew Allan of the Canadian\nBroadcasting Corporation as Producer, and of Mr. E.W. Hallman, also of CBC,\nas Assistant to the Producer. Mr. Allan brought with him the cooperation\nof Mr. Lucio Agostini as composer and conductor. . An arrangement was\nmade by Mr. William Harley where by the CBC generously made available to\nthe project its facilities, including studios, operators and sound tech¬\nnicians^\nIn May the Director returned to Toronto to produce the first three\nshows. At this time he mad© further writing assignments* Technology to\nMr. 2.S. Hallman and Groups to Mr. George Salverson. The Director spent\nmost of June and July in Toronto, during which time six shows were produced,\nand detailed plans for the remaining scripts were discussed with the writers.\nDuring August and early September, the Director consulted with\nanthropologists and others in various parte of the United States for three\npurposes? (1) to get critical evaluations of the completed shows, (2) to\nobtain suggestions and advice for further shows and future plans, and (3) to\nexplore the possibilities of finding a suitable story to demonstrate the\napplication of anthropological knowledge in a modern situation. In the\nprocess of getting such critical evaluation programs were reviewed at the\nfollowing places for the persons indicated*\nPlace\nJ2ais\nTechnical & Radio Personnel Present\nPrograms Revic\nBoston\n3A\nParker Wheatley, Benjamin Paul, Katherine\nSpencer\nLanguage, Ethics\nChicago\n8/7-8\nGeorge Probst, Robert Redfield, George\nQuimby, Francis Hsu, Lia Feattie, William\nHarley\nSociety,Langoag;\nAuthor! ty,Ethlc;\nFamily, Arts\nLos Angeles\nto\nHarry Hoijer, Ralph Beals, Abraham\nHelpera\nSociety, Arts,\nEducation, Ethi\nNew York\n8/21\nHarry Tschopik, Gordon Eckholm; (later\nTschopik played whole group of programs\nfor members of Museum staff)\nEducation, Soci\nWashington\nto\nCora Du Bois, E.T.Hall, Ed Kennard,\nPhilip Drucker, Henry Lee Smith (linguist)\nKopler Lewis, Kalervo Obort, George\nTrseger (linguist)\nLanguage, Educ:.\nValues"
}