{
  "id": "d500-34",
  "text": "at the time of fesslgnment. Demands of this kind of writing are extremely\ngreat, but the extra burden has consistently been treated by the authors\nas a challenge rather than as a block* Again, the fine sensitivity of the\nProducer to the subtleties of the material has mad© it possible not only\nto render the material with essential fidelity both to art and to science,\nbut also to communicate more precisely the intellectual content*\nMany others deserve special mention for their assistance* In\nmany instances the actors have contributed in important ways to the end\nproduct beyond the routine performance of their roles* The composer has\nsuccessfully and consistently captured the spirit of the culture and of\nthe story, and thereby not only served artistic ends but aided in con¬\nveying the intellectual purpose through the use of music* Special con¬\nsultation was secured tVcm Professor A* L. Kroeber for the script about the\nYurok$ from Professor Francis Hsu for the family show (which includes a\nChinese setting) and from Professor Harry Holler for the language script*\nIn addition to these formalised consultative activities, a number of\ncolleagues, and particularly Ruth Oraek, the assistant, have guided the\nDirector by the critical reading of manuscripts* Expressions of appre¬\nciation should also be given to Professor Felix Keesing of Stanford\nUniversity and to Miss Ida Halpern of the University of British Columbia,\nwho provided music from their files for the religion and culture shows,\nrespectively*\nCertain guiding principles have been developed* Sac© of the more\nimportant a ret People who have been used as a subject for* the various\nshows have at all times been treated with dignity as human beings in their\nown cultural standards, and have never been treated as nnoble,” \"quaint,”\nor \"bad.\" There has been a consistent effort to make the drama inherent\nin the intellectual content the center of a dramatic situation, rather\nthan to \"sugar coat\" a message with extraneous drama or humor* The\nintellectual content has been presented in terms of modern scientific\nunderstanding and consistently treated as a subject of education and not\nin a propagandists or hortative manner.\nPlans\nA grant from the Fund for Adult Education has made possible a second\nseries of thirteen half-hour broadcasts* Mr. George Probst of The University\nof Chicago has succeeded Mr* William Harley as coordinator*\nGeneral plans for the second series were formulated at a meeting\nwith Harley, Probst, Dr. Robert Redfield, and others at Chicago in August*\nDiscussions individually with each member of the Board of Consultants, with\nother anthropologists, and with radio personnel have brought the plans into\nmore specific form."
}