{
  "id": "d500-68",
  "text": "\"TO LIVE IN PEACE\nThis story (which has some basis in fact) is simple,\ncharming, and touching. Here in a little Italian mountain\nvillage - in the time of the Napoleonic wars - lives the\npriest Don (Jeronimo. The village is a kind of Arcadia, a\nlittle Eden before, the serpent came.. The villagers till the\nfields, they make the wine; and the Doctor has.had to re¬\ntire to the towns, for in the village no one falls ill of\nany complaint that a few herbs will not cure. (Even when Don\n(Jeronimo falls down the steps of his beloved cellar and breaks\nhis leg, the leg mends by itself.) The priest says good¬\nbye to the doctor:\n\"Believe me, doctor, you've been treated well up here - but\nhas any quack ever managed to stay in Certaldo even for an\nhour? Oh, if they came with a monkey or a bear or a Punch\nand Judy show, I allowed them to take a turn round to amuse,\nthe children, but if they came to sell their powders and\nsecrets for love or happiness, I made them feel the weight\nof my stick on their heads. As for lawyers, the quacks of\njustice, if any dares to show his face here, we set the dogs\non to him. Nobody goes to law in Certaldo. I settle all\ndisputes..-and without charging a lira* But I must say it's\nseldom necessary, for we always live in peace**.. .Really\nDoctor, what would you want to stay up here for? In Certaldo\nthere is one. death in four or five years. People don't die\nhere, they are born. ....Illness? Who dares to talk of ill—,\nness in Certaldo! We make our wine from our grapes, our oil\nfrom our olives and our bread from our wheat, and we think\nonly of tilling our soil. We don't bother about the outside\nworld; we put up with the cold in winter and the heat in\nsummer as nature demands and love the G-ood God**....\"\nOh, a little Eden! But there comes the inevitable serpent*\nThe French army arrives, with a General travelling on a mis¬\nsion to the priest. And,'with the coming of the French, greed\nand ambition come into the little village. Lawyers and\nnoblemen descend for the pickings.\nAnd in the end? Well, there is nothing cynical about\nthis play. Simplicity triumphs* But it is a true, rather\nthan a sentimental, simplicity; and the play goes swiftly\nand entertainingly forward throughout.\nT.ionel Hale in the \"Radio Times.,\""
}