{
  "id": "d500-98",
  "text": "TO : officers and iioard of Directors, NAJ2B\nFHOK: John W« fXmn 5/19/54\nweeks^iStUrbed ^ * number of thin&s which have developed within tti\n®tatement fchat they intend to bow out of the Network, ibis, I an\n:*?™ , f hay® repercussions .among the smaller stations in the network. If\niv'®rsitj' system can't afford, how can we? that will be their line of\nresonant, ,ie Knew, for instance, back in 1951 that FH was a dead duck so far as\nw*s concernedo *et at some considerable expense to us (which we can ill\nafford) we ve kept WNAD-FM going simply because of whatever moral effect it night\nhave on smaller institutions whose ONLY hope in radio was FI,. It seems to me fhat\n^1,shf1ake another look at his hole card (and that’s not trying to tell Lrl\nhow he should run his show). This thing can be SBRIOUS.\n?‘l ?“ disturbed that Ragion X cannot come up with a Regional Conference. What I\nntil tTy \"J?4 be Plea3ant for y°u> Jij> but believe me it's said in all kind¬\nness. All of us have busy and up to our necks in our own operation. But the tre-\nwell°worthPtht^af regi°nal oonrerences have had on the r^nk anu file of NA£3 is\n!!U,! rth bbat ®xtra 3Ure® necessary to get the job done. Frankly, I don’t see\nbe+in ttew. r°rk Cifcy or Brooklyn. And if Jin feels that he\ncan t pull the thing together, then delegate that responsibility to someone else\nLr^ainst\"^ HUiHt0 40 a.Job that the regio/itself should betSpylo do.\n\\ i this one day meeting which would take the punch out of the purposes\nor Pittsburgh31 Sainn£thl,Sell’iH1liiB meetint> ooul‘I be scheduled at Amherst? Ithaca\nfora meeting\" ** * this would be a tragedy if Region X fails to get together\nattest I'S fheEKbfinfc hik!f and increased postage, X don't think it's wise to\n* putting the blte on stations for BBC dramas in spite of the fact that\nfe won^erful0 Make the Pit(Ch for all or none to &TRC. You’re using\nyour head, Harry, in cases such as this. K\n?qj aJV\"ost disturbed by the report of the Network Acceptance Committee of Kay 5,\n\"reiectS tblS report there ls a statement of programs \"accepted\" and those\n0f the slx Programs accepted, there are, in my opinion and Judging from\nr^ MKBd8tt°i1rrS’ ?rf?aefliia'v. 0f the remaining three, only too programs Je from\nreal BABB stations. 1 thinx member stations should know why programs are reiected\nStages 3 r3ther detailed rep°rt S° that °thCr 3tati°“ 4T,ot m^the ^.e\nh fw°5 th° thf the Network is based on a wily-nily concept anyway. It never\nwhat i^ tSybeeoSdP f *! ^ brings...that is planning in advance of\nPeriod in w^th fh . \"etw°yk brings should be planned months ahead of the\nperiod in which they are to be offered and should be well balanced — the same as amr\nother director does in the programming of his station. The needs of the Network should\nthen be made known to stations so that several stations might get to work in building\nprograms that fill that need, utilizing all of their best talent and ^othow methoSf\nMember stations would then know what to shoot at, meunods.\nThe network serves three classes of stations: (1) those who depend on it for vir¬\ntually all ol their programming; (k) those who use the Network to supplement their\ntheir^rh^l1”?^ ^ sch?01 stations who can use only a portion of the offerings for\ntheir school audiences since aault audiences are not their main worry. To the best\nof my knowledge these facts have never been taken into consideration'!!"
}