{
  "id": "d1386-11",
  "text": "-12-\nFMA ENDS SECOND ANNUAL NESTING ON OPTII.ISTIC NOTE\nIn tho faco of froo predictions by,the trade press that Chicago would be.the, scene.\nof FI:*~s\" official funeral\" more than 500 FI broadcasters, engineers, manufacturers, .^\nand agency pcrsonno1 ended a three—day session in Hotel Sheraton on a noto_of\nconfidence*\"and dogged determination to continue FI 's expansion, prove it the best\nfacility,\nAlthough frankly admitting FI' was a red ink operation to date, FI'_A. ,^i^_ors_.doclgTQd\nno lack \"of'confidence the tide would* change, and pointed to transit radio^Jlstoree-\ncasting\" , and other'\"tie-in devices” now successfully ope rating, aAi-insurejicc'1\ncover for otherwise non-profit or losing FM operations•\nFI loaders pointed out FI had encountered and survived several major catastrophes\nincluding FCC \"spectrum- change\", TV \"publicity paralysis’,' and had continued to\ngrow at rate of 1 now FM station per day over past year.\nHimhlv touted was new emphasis on national and regional, FM. promotion^ and_ap_parcnt-\nly confirmed was rumor one ma.ior manufacturer was changing advertising emphasis\nadvertising emphasis from TV to FI #.\n.mnr.i.q Wnvnn nnv. mnior sneaker of meet, indicated his sympathies lay with FI A in\nmatter of returned CP's and lengthy oral programming byTV stations T_Coy., also said.\n\"until we have FM sets in auantitv and quality we're not giving FI a square deal#\nn\nFIA executive board asked for FCC rule to prohibit granting FI construction\nporr.it for two-year period to anyone who turns in FM construction permit#\nLeonard 1 arks, FMA counsel, recently petitioned FCC officially to this effect,\nClarification of FCC rules was asked with respect to whether TV stations can\nbroadcast extensive aural programs while merely beaming test patterns#\nFear of TV smothering FI obviously underlies feeling FCC should clarify TV\nsound rules. Sound programming by TV, FI A feels is \"offside play,\"\nMany broadcasters, FI A fools, have simply asked for CP on \"hedge basis” and\nnot for honest broadcast intent, thus turn back of CP’s cloud and confuse\npicture#\nNew Officers for FI A include: William E# Ware, president (KFMX, Council Bluffs,la.);\nE. Z# Jones, vice president (WBBB-FM Burlington, N.C.); Emil J. Hodcl, secretary,\n(WCFC, Bcckley, W# Va#)j Thomas F. McNulty, treasurer, (Boston). Directors for\nthree years: Matthew H. Bonebrako (KOCY-FK Oklahoma City),* Robert F. Wolfe,\n(WFRO-FK Fremont, Ohio); Edward A. Wheeler, (WEAW, Evanston, Ill#); Lee NeCanne,\n(Vice president of Stromberg-Carlson Co#, Rochester, N#Y#)j Frank Gunther,(Vico\npresident of REL). Directors for one year: Marion Claire (WGNB, Chicago) and\nMorris Novik, (Unity Broadcasting Corp,, New York)."
}