{
  "id": "d1386-5",
  "text": "-6-\nC MAD IAN BROADCASTING CORPORATION STUDYING. TEL\nCBS, which to date has authorized no TV stations, has 6 applications under study,\nall requesting TV facilities in Montreal and Toronto. A. Davidson Dunston, chair¬\nman of \"the CBS Board of Governors promises an early decisibn.\nCBS GETS ROSEBOUL TV EXCLUSIVE\nUnder a contract signed, with the. Tour name nt_of^ Hoses.„Assocj.aM\ncasting System has_ exclusive television rights for all .corososiQHL..-533SL\nplay-by-play for the next 3 years.\nNAB SAYS nGIVBAUAYSn NOT ILLEGAL\nIn a brief filed with the FCC in late September, the National Association of\nBroadcasters, challenged authority of the FCC to regulate speciiic programs or\nto say what broadcasting violates criminal law,\nNBC'S CODE OF PRACTICE BMS \"GIVEAWAYS\"\nAt the Sun Valley meeting of National Broadcasting\ncode was announced. Covering all provisions of the,.rocpnt..iNAB__stpndardSj8—thf.\ncode bans any give-away programs after January 1, I949a..^\ndecided the case.\n1.33 PREDICTS \"GIVEAWAYS\" TIILL DISAPPEAR FR01~THE AIR\nEdgar Kobak, president of JAitual Broadcasting Company, predicts most \"giveaway”\nprograms will soon disappear from the air. At an Atlanta conference he told^\nnewsmen many of these programs aro already beginning to lose their appeal, ^obak\ncentered his criticisms on shows which, as he put it, \"buy an audience.”\nJUSTIN KELLER SINGS AN OLD SONG AT SEATTLE.\nSpeaking to a group of„Seattle businessmen in early September,,, Justin ijller,\npresident of thrNatTo^l A^7ciation of Broadcasters, says., the. FCC,.e^rcisog^a\ndangerous\"control over the broadctasting industry. Hg_.stated.tjie. verx.\nthc^FCC was a dangerous step toward government encroachment .of^hg^Congtitution1^\nbasic rights of freedom.\nFIRST CHICAGO TV NETUORK PROGBAI'. AIRB£\nSeptember saw first airing of commercial TV network shows from Chicago, Hook-up\nincludes stations in Chicago, Milwaukee, Buffalo and Cleveland.\nTV RESEARCH DIRECTOR SAYS. CQ1 F3TITIVE NATIONAL TV SERVICE POSSIBLE\nDr. Thomas Goldsmith of the Dumont Laboratories told the FCC that use of the\nso-called UFH band (475-390 megacycles) would provide almost 70 new tele¬\nvision changes, a.nd urged the FCC to open those channels for commercial tele¬\nvision.\nIf this wore done, Goldsmith said, TV stations would become available to\nmany now cities, smaller communities cou3.d receive service for the first\ntime, and TV networks would become economically practical.\nTestimony was part of FCC’s current study to see if present 12 TV channels\nare adequate."
}