{
  "id": "d1386-8",
  "text": "-9-*\nWOULD SERIES FIiT:J, SEEN ON STRATOVISIQN\nFinal game of the 1948 World Series in Boston was soon in the home city of tho\nvictorious Cleveland Indians via Stratovision relay of the television pick-up\nfrom Braves Field, marking tho first time a major Bast Coast event was seen on\nTV in the Lid-west.\nOriginal elans to feed the signal from the Stratovision planc_to_ . thcjttwegtprn\ncoaxial network via WEWS was abandoned because tho picture was not _of__suffic^ienjr\nquality_to justify the relay. Reception was ’’grainy” and sometimes out of synchron¬\nization, reports from Cleveland said•\nWestinghousc equipment, aboard a B-29 bomber.,., flying_oj:...al^u^^Qj.0Q0_X29.!k.^B.S£\nPittsburgh7 •picked up~ Baltimore’s Wi AR-TV signal andr c la/ye d Jt^^^\nover a radius of approximately 250 miles*\nHI.A DISCI 03BS ETECTRQFICS WAR I OBILIZATION PLAIT\nRadio Ifc.nuf acturcr ’ s Association in a Washington, D.C., announcement^on October 15\nmade public its overall war mobilization plan for the electronics industry.\nThis was the first such industry plan to bo presented by^an^jrropp^ipco^the^^^lpso\nof tho last warTObjectives say HI A Industry Mobilization Policy Committoo.^rcjbo\nspread \"the military preparedness production load broadlyg th^pughput^tho. radio\nindustry.\nThe plan has been presented to tho munitions board and discussed with various\nrepresentatives of the military services.\nTho report pointed out only a minority of radio^g'-nd^^leGtronix^^cra^aptAirors^ arc\ncurroutly engaged in government work despite the sharp incrcase.\nrequirements.\nPlan’s objective, committee said, is to create as many prime contractors as possible\nand to got tho industry as a whole back into government business.\nHI A pointed out government is presently placing milljpnpf_„doll„fAR.\non basis of competitive bids with all of speculative, o^ds_fo^Jbotji., jlhp Ag.BAf.H-\nrn^nt and tho contractors. Committee believes tho radio ind.u3jbry^ani^t„bc^in—\nduced to participate wholeheartedly in current procuror^^^\nFI TO GAIL BY TV FREEZE\nWilliam Bailey, director of Frequency Modulation Association (FMA) believes the\ncurrent TV ’’freeze5’ will be beneficial to the future oi FI, Reports from many\nradio manufacturers indicate plans to soft-pedal television receiver production\npending clarification of TV status b'r the FCC.\nHIjCHI ILIER'TO ‘HEAD COLLEGIATE FETWORK SATES\nJoyce Rischmiller is tho new scales manager for Intercollegiate Broadcasting\nSystem, according to George Abra.ha.rn, IBS president, A now dramatic script\nlibrary was opened recently for use of 30 full-member stations of tho network,\nIBS is composed of ’’gaspipc” or ’’wired-wireless” stations which comprise a\ntranscription network student-operated radio laboratories, serving campus\naudiences."
}