{
  "id": "d1751-0",
  "text": "rn\n■\nA E B\nw\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL URBANA, ILLINOIS\nPRESIDENT PAULU RE-ELECTED\nAmong the many accomplishments of the St. Louis\nConvention was the election of new NAEB officers\nfor 1958.\nDr. Burton Paulu, director of radio and television\n• broadcasting at the University of Minnesota, was\nre-elected to a second term as president. Former\nNAEB Secretary Jack McBride, director of educa¬\ntional television at the University of Nebraska, be¬\ncame the new vice-president. Haskell Boy ter, direc¬\ntor of radio and television education, Atlanta Board\nof Education, Georgia, was elected as secretary.\nRe-elected for a third term as treasurer was Robert\nColeman, director of WKI radio at Michigan State\nUniversity.\nAt this point, balloting for NAEB directors of\nRegions I, III and V is still in progress. The ballot¬\ning is done by mail in accordance with the by-laws of\nthe NAEB. Results of the election will be announced\nin the January Newsletter and Journal.\nThe following are the nominees for the director¬\nship of the three Regions:\nRegion I\nSeymour Siegel, dir., WNYC, Municipal Broadcast¬\ning System, New York City; Miss Marie Scanlon,\nsupervisor, WBGO, Board of Education, Newark,\nN. J.; E. A. Hungerford, Jr., dir. of operations,\nMetropolitan ETV Assn., N. Y., N. Y.; Hartford\nN. Gunn, Jr. gen. mgr., WGBH-FM-TV, Boston,\nMass.; (Rev. R. F. Grady, WUSV, and James Mac-\nandrew, WNYE, withdrew as nominees).\nRegion III\nF. G. Macomber, assoc, provost, Miami University,\nOxford, Ohio; Elmer Sulzer, dir. radio-TV, WFIU,\nIndiana University, Bloomington, Ind.; Edward J.\nRosenheim, Jr., University of Chicago, Chicago,\nIll.; William Harley, WHA-TV, University of\nWisconsin, Madison, Wise.; (Miss Ola Hiller,\nWFBE; Armand Hunter, WKAR-TV and George\nJohnson, WFIU, Indiana University, withdrew as\nnominees)\nNAEB Newsletter\nVol. XXII, No. 12\nDecember, 1957\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14 Gregory\nHall, Urbana, III. $5 a year, edited by Hans J. Massaquoi.\nRegion V\nRobert Schenkkan, dir., radio-TV, University of\nTexas, Austin, Texas; Gerald Willsea, dir., radio-\nTV, Denver Public Schools, Denver, Colo.; Miss\nMarguerite Fleming, mgr., KSLH, Board of Edu¬\ncation, St. Louis, Mo.; Duff Browne, gen. mgr.,\nWYES, Greater New Orleans ETV Foundation,\nNew Orleans, La.; (Roy Barhtold, KUHT, with¬\ndrew as a nominee).\nNAEB RESOLUTIONS\nThe following eight resolutions presented to the con¬\nvention body by Chairman George Arms of the\nResolution Committee, were accepted by unanimous\nvote:\n1. WHEREAS, the 1957 NAEB Convention Com¬\nmittee, which comprises the staffs of KSLH and\nKETC-TV, with Miss Marguerite Fleming as\nChairman, has graciously and efficiently pro¬\nvided for our needs and pleasures during our\nvisit to St. Louis, and whereas the program\nfeatures have been stimulating and inspiring,\nthe entertainment most cordial and generous,\nTHEREFORE, BE IT RESOLVED that the\nNational Association of Educational Broad¬\ncasters express sincere appreciation to Miss\nFleming and every member of the committee\nfor one of the best NAEB conventions in the\nhistory of the organization.\n1"
}