{
  "id": "d1751-1",
  "text": "• The USOE has announced the probable availability this\nspring of “Audiovisual Materials in Public Schools and Fac¬\ntors Influencing Their Use,” the report of a national survey\nconducted under contract by the Bureau of Social Science\nResearch.\n• Tips on the use of splicing tape and marking pens are\ngiven in the second issue of “Video Tape Playback,” a 3M\nquarterly informational bulletin. Free single copies from\nDept. E2-540, 3M Company, 2501 Hudson Road, St. Paul\n19, Minnesota.\nO Chases’ Calendar of Annual Events is available at $1 each\nfrom the Apple Tree Press, 2322 Mallery St., Flint 4, Mich¬\nigan. Listed is the name, purpose and inclusive dates of each\nof over 1,000 special events.\nNew NAEBers\nASSOCIATE\nUniversity of Denver, Denver, Colorado.\nINDIVIDUALS\nStephen A. All, Flint, Michigan; Edward S. A. Altiere, Prov¬\nidence, Rhode Island; Hayes L. Anderson, East Lansing,\nMichigan; Vicki Anderson, Fort Worth; Furman S. Baldwin,\nKenmore, New York; John Ba'lmer, West Hartford, Connec¬\nticut; Dr. V. Faustim Bazilauskas, Verona, New Jersey; Gene\nBruck, New York; Wendell P. Butler, Frankfort, Kentucky;\nLee E. Campion, Albany, New York; Jay B. Dansie, Layton,\nUtah; Marvin N. Diskin, Ann Arbor; Mary L. Duncan, Fort\nWorth; Walter Eakins, Fort Worth; Barto Farrar, Fort\nWorth; Ralph L. Feather, Wichita Falls, Texas; Laurence\nS. Flaum, Madison, South Dakota; Wendell C. Ford, Tempe,\nArizona; H. Bruce Fowler, Milwaukee; Boris Frank, New\nYork; W. T. Gillman, Atlanta; David E. Hennessy, Bloom¬\nington, Indiana; Milton Horowitz, Brooklyn; Saundra Hy-\nbels, Philadelphia; Ray M. John, Fort Worth; Frank K.\nKelly, Santa Barbara, California; Sue A. Kempfer, Carbon-\ndale, Illinois; John Paul Kimzey, Fort Worth; Philip J.\nLane, Jr., Lawrence, Kansas; Jon Lawson, Fort Worth;\nBarcine Lester, Fort Worth; Craig Libby, Fort Worth; Mrs.\nEdith M. McNabb, Decatur, Illinois; Hugh W. McNeese,\nLaHabra, California; Lionel J. Monagas, Philadelphia; Scran¬\nton A. Mouton, Jr., New Orleans; Kenneth P. Murr, State\nCollege, Pennsylvania; Dr. Chandos Reid, Pontiac, Michigan;\nCharles F. Riley, Washington; Rosalind Roulston, Green¬\nville, North Carolina; James Russell Rueff, Richmond, Ken¬\ntucky; Paul E. Salisbury, Northeast Harbor, Maine; Harold\nC. Shaver, Syracuse; Walter Skolnik, New York; Lawrence\nM. C. Smith, Philadelphia; Terry R. Spearen, Bangor, Maine;\nAlton R. Stine, Holt, Michigan; Russell I. Thackrey, Wash¬\nington; Diane Tomlinson, Fort Worth; Esther Waldman,\nChicago; Mrs. Charlotte A. Woodside, Pittsburgh.\nFirst Peace Corps ETV to Be Aired in Fall\nFinal shape of Peace Corps’ ETV project for Colombia\n(see July 1962 NAEB Newsletter) includes a new element any\nlocal manager would envy: a staff of 50 Peace Corps volun¬\nteers, teamed up with as many picked Colombians, to serve as\nfield liaison between Bogota studios and the 1500 urban and\nrural schools joined in the program. Field personnel will\nguide teachers in classroom use of programs, distribute ma¬\nterials in advance of broadcasts, observe reception, and share\nin planning and evaluation.\nDevised as a pilot project for the country’s ETV plans,\nPeace Corps effort is aimed at limited educational objectives,\nwith concentration on training Colombians to take over an ex¬\npanded ETV system in future years.\nTen volunteers, sharing programing duties with ten Colom¬\nbians, will comprise the production staff, backed up by regu¬\nlars at Colombia’s big Radio-televisora Nacional, largest net¬\nwork in Latin America and the medium for the project.\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W., Washington 6, D. C. Phone 667-6000 Area Code 202.\nExperimental and teacher training broadcasts are anticipated\nfor the late fall familiarization phase. Regular schedule of\nprimary grade, in-school curriculum service will begin with\nthe new school year in February, 1964. With first service\nunder way, programers will turn to industrial skills, adult\nliteracy.\nColombian side will include complete responsibility for con¬\ntent and decision-making. Network and education and com¬\nmunications ministries are delegating representatives to special\ncommittee able to make plans and decisions.\nFinal selection of volunteers is now under way. Qualified\nvolunteers with background in TV production have responded\nwell to earlier calls, and Peace Corps officials will welcome\nmore for this and future projects in ETV. Writers, produc¬\ntion assistants, art staffers and audio-visual materials men,\ncamera and film men, and ETV-trained utilization workers\nare wanted.\nFinal decision has not been made on the project director.\nHe will be salaried, must be Spanish-fluent, thoroughly fa¬\nmiliar with and seasoned in ETV production, planning, and\nmanagement.\nInterested NAEBers should write to Jules Pagano, Chief,\nProfessional and Technical Division, Office of Public Af¬\nfairs, Peace Corps, Washington 25, D. C. Anyone over 18\nand without dependents under 18 may be eligible for service\nas a volunteer. At the higher level (for director) the volunteer\ncan take his family along.\nNews of Members\nPERSONNEL\n^ Arnold L. Zucker, radio-TV coordinator of Rutgers Uni¬\nversity, has been named executive director of the New Jersey\nBroadcasters Association.\n^ James M. Ward, formerly of radio-TV, University of Colo¬\nrado, has been named to a three-year post as executive secre¬\ntary of the new Colorado ETV Commission.\n^ Dr. and Mrs. I. Keith Tyler, of Ohio State University, are\nspending six months in Cairo, Egypt, to assist in establishing\neducational broadcasting for the United Arab Republic. On\nleave from the university, the Tylers will work as a team\nunder a grant from the Office of Cultural Exchange of the\nU. S. Department of State.\n^ Paul Blanshard, Jr., former radio-TV director at the Uni¬\nversity of Pennsylvania, is now general manager of commer¬\ncial station WFMZ-FM, Allentown. He and his family re¬\nturned last August from two years in Nigeria where he was\nresident representative of the American Friends Service Com¬\nmittee.\n^ Don Mills has been named PR director for KQED (TV),\nSan Francisco, replacing Marianne Goldman, who resigned.\n^ William E. Coletti has been named production manager for\nWEDU-TV, Tampa.\n^ Robert L. Hilliard, of the department of radio, television\nand motion pictures of the University of North Carolina, is\non leave to serve as consultant on TV in higher education for\nthe New York department of education.\nGENERAL\n^ The City of Philadelphia has pledged $250,000 in the cur¬\nrent million-plus drive to launch WHYY-TV on VHF Chan¬\nnel 12.\n^ Ohio University’s WOUB-TV began programing the night\nof January 3, with a film documentary covering the con¬\nstruction of the station, including President Vernon Alden\npushing the button to put the station on the air. Another pro¬\ngram featured E. H. Gillis, Jr., executive secretary of the\nOhio ETV Network Commission, explaining the plan which\ninvolves all five ETV stations currently on the air in the\nstate, as well as others scheduled to go on soon.\n^ The Chicago Sunday Tribune last month carried a five-\ncolumn article about the Chicago school system’s experiments\nwith teaching machines. The article was largely a report of\nFEBRUARY 1963\n3"
}