{
  "id": "d1751-2",
  "text": "an interview with Dr. Philip Lewis, director of the bureau of\ninstructional materials for the Chicago schools.\n^ Joseph Sagmaster, director of broadcasting for the Univer¬\nsity of Cincinnati, writes that NAEB Radio Network use of\nprograms of the Cincinnati Symphony Orchestra has made\nbig radio news in Cincinnati. The publicity has included a\ncongratulatory editorial in a Sunday Cincinnati Enquirer.\nSome 60 NAEB stations have ordered the series for which\nUniversity of Cincinnati’s WGUC was awarded an NAEB\ngrant-in-aid last year.\ny WHA-TV, University of Wisconsin, aired 21 live programs\nin five days during the Christmas season. Bruce Westley is\nconducting a research project in connection with the Christ¬\nmas programing.\n^ KQED, San Francisco, last month sent out announcements\nto its viewers that it would be able to carry the East-West\nNBA All-Star game January 16 only if every interested sports\nfan sent the station $1 to offset costs of the telecast.\n^ Chicago’s WBEZ was recently awarded a “special citation\nfor outstanding service to education and the community\nthrough the radio medium” by the American College of Radio\nArts, Crafts and Sciences. The award was based on the over¬\nall scope and quality of the station’s program schedule for\n1962.\n^ Indiana State College’s new FM station, WVIS, is being\nconstructed this winter and will be on the air starting with the\nfirst semester of 1963-64. Transmitter power will be 250 watts\nwith ERP 310 watts; frequency 89.7 meg.; antenna height\n172.5 feet.\n^ The University of Minnesota reports more than 3,000 stu¬\ndents enrolled in nine courses conducted via CCTV. CCTV\ninstruction has been greatly increased this year in a vigorous\nprogram of experimentation and appraisal, states the Staff\nBulletin in the December 1 issue, one-fourth of which was\ndevoted to the CCTV program.\n^ Coverage of 85% of the state is anticipated by the end of\n1963 by the Alabama ETV Commission. Montgomery’s Chan¬\nnel 26 became the fourth link in the state network in Decem¬\nber.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Mrs. Jacqueline Swain, Placement Serv¬\nice, at the NAEB office in Washington.)\nFebruary I—Ambitious and dedicated broadcaster with over\nsix years experience in the communications field seeks\nchallenging and rewarding position in ETV. B.A., com¬\nmunications; experience and education in all phases of\nTV broadcasting with special emphasis in production and\ndirecting; commercial and noncommercial experience;\ncurrently \"assigned to the Far East as production man¬\nager in radio-TV. Age 28, single. Location open.\nFebruary 2—Director or coordinator of ETV with university or\nstate network. M.A.; extensive experience in planning,\nestablishing and directing ETV systems. Age 44, mar¬\nried. No preference as to area; salary range $10,000 to\n$|5,000.\nFebruary 3—Position as writer-producer with ETV station de¬\nsired; will also direct and consider administrative posi¬\ntion. Would like opportunity to teach radio-TV classes\nas well as other related speech areas on college level.\nPh.D. in radio-TV expected mid-1963. Age 29, married.\nNot limited by geographic restriction.\nFebruary 4—Ph.D., speech-broadcasting, seeks position as sta¬\ntion manager or program, production or music director\nin educational radio-TV, possibly combined with teach¬\ning. Commercial, educational, and military broadcasting\nexperience since 1947; college teaching experience since\n1958. Age 32, married. Location open; available late\nAugust; salary $9,500/12 months.\nFebruary 5—Hard-working male with M.A., guidance, certifi¬\ncate in TV (NYU), desires production staff position with\nETV or ER station. New in field, but 4 years teaching\nexperience. Age 28, married. Prefers North, Midwest, or\nFar West; available June I; salary open.\nFebruary 6—Teaching, producing-directing, or administrative\nposition at university, ETV station, or CCTV situation.\nPh.D., TV, by summer 1963; extensive production train¬\ning; several years ETV administrative experience with\nNETRC and MPATI; high school and college teaching\nexperience. Age 28, male, married. Location open (South¬\nwest looks attractive); minimum salary, $7,500.\nFebruary 7—Desires position as ETV PR director, program di¬\nrector, executive producer ETV. M.A., radio-TV; I I years\nexperience as producer, director, writer, talent, class¬\nroom teacher at all levels; also film producer, director,\nand writer. Male, 37, single. Location, anywhere; salary\n$9,000-$ 10,000.\nFebruary 8—Production supervisor-producer director must re¬\nlocate as employer closing center January 31. Desires\nprogram or production management position with ag¬\ngressive college or community ETV center. B.A., speech;\ncomplete background in all phases of production includ¬\ning film and remotes; 5 years commercial TV and 4 years\nETV experience with 2/2 years in management. Male, 32,\nmarried. Location open; salary $8,000 minimum.\nFebruary 9—Desires position that would combine teaching and\ntelevision production. M.A., communications; ER ex¬\nperience and limited commercial TV network experience\nin writing, research and production. Age 24, single,\nfemale. Location open; salary minimum $6,000.\nFebruary 10—College instructor's position in TV-radio depart¬\nment sought by a 38-year-old married man who has\nearned an M.A. in TV; 10 years experience in commer¬\ncial radio-TV; 7 years \"on camera\" news reporting and\nsportscasting. Licensed and presently employed as a\nteacher; some teaching experience on high school and\ncollege levels, including teaching basic skills and intro¬\nductory TV courses to both undergraduate and gradu¬\nate students. Location preference dependent on pros¬\npective position; starting salary $6,000 range.\nFebruary 11—College graduate now completing work on mas¬\nter's degree desires position in CCTV or ETV as pro¬\nducer, director, writer, or production. B.S., radio-TV;\nconducted radio tape network for college; 3 years ex¬\nperience in commercial TV, cameraman, switcher, audio,\nfilm, and studio. Married, male. Location and salary\nopen.\nFebruary 12—Male, age 26, seeks position in ETV; producing\nand directing preferred. M.A., radio-TV-film expected\nJune 1963; college teaching experience. Prefers West\nCoast or East Coast; salary about $5,000.\nPOSITIONS AVAILABLE\n(In order to be considered by these institutions, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nF-l—ETV producer-director. Position requires someone with\nimagination, creativity, and the ability to transfer ideas\nto film or TV; must be able to write a script, an article,\nletters, and promotional materials. Person, man or woman,\nmust have the capacity of enthusiasm, a willingness to\nwork under pressure. B.A. required; if degree is not in TV,\nexperience in TV and/or film production required. North-\ncentral university; salary dependent upon qualifications,\nminimum $6500.\nF-2—Continuity and traffic position in radio-TV station, woman\npreferred. Midwest public school system; immediate open¬\ning, salary commensurate with experience.\nF-3—Production and teaching position in radio-TV department,\nman or woman under 45. Ph.D. required; college experience\nand educational and/or commercial broadcasting experi¬\nence desired. Midwest university.\nF-4—Broadcasting faculty opening, in any one of three special¬\nties: (1) motion picture concentration, (2) radio produc¬\ntion concentration, or (3) television production concen¬\ntration. Person will teach one course in his specialty and\nwill be assigned as producer-director of one instructional\ntelevision course in instructional television program. Ph.D.\nrequired, or at least course work must be completed; I to\n2 years faculty experience, college level; I to 2 years\ncommercial and/or educational radio-TV experience. West¬\nern university; avai lable September 1963.\n4\nNEWSLETTER"
}