{
  "id": "d1751-5",
  "text": "tions can do the job.\n“Why,” he asked, “should not the appropriate\ngovernmental agencies have power to exercise the\nright of eminent domain over broadcast time seg¬\nments, taking over, if purchase is not easily pos¬\nsible, prime time spots on commercial stations and\nnetworks so as to provide program outlets?”\nNEWS OF MEMBERS\nGENERAL\nOhio University at Athens, operator of WOUI-FM,\nhas now established a 100 watt AM station with call\nletters WOUB, according to Archie Greer, the Univer¬\nsity’s supervisor of broadcasting.\nWOUB’s operation differs from most other edu¬\ncational radio stations in that it is completely student\nstaffed and operated with faculty members acting\nmerely in a supervisory and advisory capacity.\nIn describing the success of this arrangement\nGreer said, “ . . . students have jumped into this\nthing with both feet and are doing an extremely good\njob with it. So far they have shown that they are\nmature enough and talented enough to operate this\nas a high quality educational radio station.”\n^ A summertime internship program in Hoosier\nradio and TV stations for Indiana University students\nwas recently announced by the I.U. Radio and Tele¬\nvision Service and the Indiana Broadcasters Assn.\nIn a joint announcement, Prof. E. G. Sulzer, head\nof the I.U. department, and Les Spencer, general\nmanager of WKVB, Richmond, and president of the\nIBA, said the internship program will start this\nsummer. Students will be placed in summertime\njobs in Indiana stations to match their special in¬\nterests. Participants are those students who will be\ngraduated the following year.\nPROGRAMS\nThe Brookfield (Ill.) Zoo and the ETRC have com¬\npleted arrangements for the production of a new TV\nseries of 13 programs titled “Discovery at Brookfield\nZoo.” The series, to be produced at WTTW, Chica¬\ngo, is expected to take millions of viewers in the 26\ncities making up the educational TV network on a\nnew kind of safari through the animal kingdom by\nthe summer of 1958.\nWriter and producer of the series is Mary L.\nGrimes, whose two preceding “Discovery” series that\noriginated at WGBH-TV, Boston, have made her\nwell known to educational TV circuits.\n\"Discovery at Brookfield Zoo” will be partially\nfinanced by a grant from the Chicago Zoological\nSociety.\n► In a special program, “The 21 Inch Classroom,”\non Nov. 4, WGBH-TV, Boston, informed viewers of\nthe latest developments in school TV and plans for\nits use in eastern Massachusetts.\nThe hour-long program opened with the back¬\nground of developments of in-school TV and an ex¬\nplanation of its local use, followed by an outline of\nhow each city and town can play an important part\nin bringing in-school television about. Then excerpts\nof films demonstrating how in-school TV is used in\nother communities across the nation were shown.\nDuring the last 20 minutes of the program a panel\nof local experts in education and in classroom TV\nanswered questions and considered suggestions of¬\nfered by viewers. Interested viewers were en¬\ncouraged to send in questions in advance of the\ntelecast.\nThe program was shown in anticipation that be¬\nginning next spring or fall many elementary schools\nin eastern Massachusetts will use TV in their class¬\nrooms. So far, P-TA groups in that area have shown\ngreat interest in in-school TV.\n^ In honor of the seventh anniversary of the Univer¬\nsity of Houston’s educational FM radio station\nKUHF, an hour-long stereophonic broadcast was\ncarried simultaneously on KUHF and KUHT, the\nUniversity’s TV station, Nov. 6.\nUnlike most stereophonic broadcasts, which use\nan AM radio station for one channel, this program\nreportedly was a pure-fidelity broadcast, since only\nTV and FM sound systems — the only systems cap¬\nable of transmitting true high-fidelity — were used.\nThe program, which featured primarily light\nmusic, opened with a stereophonic demonstration to\nfamiliarize TV viewers with this modern method of\nsound reproduction.\nAnother seventh anniversary was observed Nov.\n15 by the University’s weekly broadcast “University\nForum,” Houston’s only local program devoted\nentirely to discussions of world affairs.\nAppearing on the program regularly are profes¬\nsors from the University of Houston and the Rice\nInstitute, consuls and delegates to the United States\nfrom foreign nations, world travelers and political\nscientists and many famous personalities from gov¬\nernment and allied fields.\nOriginating each Friday as a telecast in the\nUniversity studios, the program is seen on KUHT\nand heard on FM radio over KUHF simultaneously\nat 7 p.m. (CST). A rebroadcast for AM listeners is\ncarried Tuesdays at 8:30 p.m. on KTRH, a CBS\naffiliate.\n^ META, New York, reports the broadcasting of\nits 50th program since the opening of its production\n6\nNEWSLETTER"
}