{
  "id": "d1751-7",
  "text": "BOX SCORE\nTotal\nAM\nstations\n3157\n(includes\n38\nnon-commercial)\nTotal\nFM\nstations -\n674\n(includes\n141\nnon-commercial)\nT ota 1\nTV\nstations -\n564\n(includes\n28\nnon-commercial)\nAWRT SCHOLARSHIP INCREASES TO $750\nThe American Women in Radio and Television,\nInc., has announced the opening of its fourth annual\ncompetition. The scholarship has been increased\nfrom the previous $500 to $750 in order to meet\nrising tuition costs.\nThe deadline for entries is Feb. 1, 1958. The winner\nwill be announced at the annual spring convention\nfor the national professional women’s organization,\naccording to Betty Ross West, NBC, Chicago, chair¬\nman of the Scholarship Committee.\nEstablished to encourage outstanding young wo¬\nmen to enter the broadcasting field, the AWRT\nScholarship Competition is open to all women stu¬\ndents in their junior year at an accredited American\ncollege or university who study toward a degree in\nradio or TV. Applicants will be judged on scholar¬\nship, character, personality, stability, cooperation\nand adaptability.\nIn addition to the scholarship, the winner will be\nhonor guest at the national AWRT convention,\nApril 23 through 27, 1958 at the Fairmont Hotel,\nSan Francisco, with all expenses paid.\nFor detailed information contact the American\nWomen in Radio and Television, Inc., 501 Madison\nAvenue, New York 22, N. Y.\nPLACEMENT SUPPLEMENT\nDecember I - Single man, 30, BM, seeks job with progressive,\nexpanding educational TV outlet. Worked 3 years\nwith CBS in various phases of radio/TV administration\nand production (staff director, program director of\nmobile color TV unit). Wide experience with all\ntypes of visual aid development and construction,\nfilm production and editing. Experienced in all\ntypes of script and promotion writing. Location,\nWest or East Co^st, Texas, Denver (Colo). Salary\nopen.\nDecember 2 - Broadcasting and speech instructor in junior\ncollege seeks ETV or teaching position for Sept. 1958.\nA.B., M.A. in TV and speech, 3 years with major\nmetropolitan daily, 5 years in commercial broadcast¬\ning, one year in ETV. Also experienced in dramatic\nscript writing, production for TV and film. Prefers\nmetropolitan location. Salary open.\nDecember 3 - Single man, 28, B.A. in communications, graduate\nwork in public relations, journalism and government,\nseeks educational broadcasting position that can utilize\nhis background. Location and salary open.\nTV TECHNICAL TIPS\n—Cecil S. Bidlack\nEngineers at the University of Illinois have been busy\nthis past month trying to beat the arrival of Old Man\nWinter. They’ve been making field strength mea¬\nsurements of both WILL-TV and WILL-FM. Their\nmeasurement method is patterned after TASO tech¬\nniques which call for a 100-foot mobile run every two\nmiles along the radial at an antenna height of 30 feet.\nOur pictures this month show the unique and inexpen¬\nsive way in which the measuring dipole is raised to\nthe 30 foot height.\nAn RCA BW-7A VHF Field Intensity Meter and\nTest Set was used. The mast used is the same sec¬\ntional 1^4\" seamless tubing used for TV antennas.\nThe measuring dipole is mounted normally on the\ninsulating mast section which is furnished\nwith the meter. This insulating rod is inserted in\nthe mast tubing and clamped so as to place the an¬\ntenna 30 feet above ground. A 4\" channel is bolted\non the back of the truck and the mast pivoted (as\nshown) at the top of this channel.\nFor normal travel, the mast is tied down horizon¬\ntally at the front end of the panel van. When a\nmeasurement is to be made, these ropes are untied\nand the mast is raised by pulling down on the section\nextending beyond the rear of the truck. This end\nfits into the channel bolted to the rear of the truck\nand is fastened in the channel with wire or rope. A\nNEWSLETTER"
}