{
  "id": "d1097-10",
  "text": "-11-\nW01-TV DISCUSSION SERIES CONCLUDED MAY 1\nWith the program of May 1, The Whole Town's Talking, the adult education discussion\nseries produced at WOI-TV in Ames in cooperation with the Fund for Adult Education,\nconcluded its current series. A total of fifteen programs have been produced since\nJanuary 3.\nThere seems to be no question of the program’s effectiveness and adaptability to al¬\nmost any locality. People who have been asked to appear on the programs have been\noverwhelmingly cooperative and genuinely grateful for the opportunity to express\ntheir opinions.\nA recent program was centered around the problems of the Sac and Fox Indians who live\nin the Indian Settlement near Tama, Iowa. The Indians brought to the studios for the\nprogram responded eloquently to the questions posed by one of their tribal council\nleaders who moderated the program.\nExamples of the effectiveness of the programs are appearing throughout the state. In\nHardin County, where the county school board had been commissioned in 19^6 to draw up\na school reorganization map, and had not done so prior to the program, a map now has\nbeen drawn up, approved by groups throughout the county, and is now before state\nauthorities for final ratification.\nIn Toledo, Exira and Eldora, recreation boards have been set up to outline an effec¬\ntive teen-age recreation program. WOI-TV's program on recreation was centered in\nToledo, but the other communities were stimulated to action by watching the program.\nExira was considered for a similar program, but after a mass meeting set up to\narrange the show, the people went ahead to form the recreation council before the\nprogram could be scheduled. All the people of Exira needed was the glamour of a\ntelevision camera at a meeting to stimulate them to act towards the solution of\ntheir problemI\nVIDEO COURSES BROADCAST IN OMAHA AND SALT LAKE CITY\nA series of six-week college courses, the first to begin in May, has been announced\nby the University of Omaha and station KMTV. Wilfred Payne, professor of philosophy\nand chairman of the university humanities department broadcast the first program on\nApril 28.\nThe TV classroom occupies a morning quarter-hour time sement, Monday through Friday.\nThe University is preparing an enrollment plan whereby KMTV viewers may receive col¬\nlege credit for taking the courses, which will include special examination. The sta¬\ntion is donating production, time promotion, and set-building costs.\nCredit Courses in Utah\nThe University Club of Utah, only western college to offer credit classes by tele¬\nvision, began its fifth TV course on KSL-TV on March 16.\nThe new Sunday class, \"The History of Utah,” is conducted by Leland H. Creer, head\nof the university's history department. Special handbooks are being sent to students\nin the 11-week course. Certificated students, who enroll for $1.00, submit 10 brief\nassignments based on the TV lectures and handbook.\nThose who wish college credit will submit 15 lessons, complete text assignments, and\nwrite a final examination. Tuition for credit students is $12.00."
}