{
  "id": "d1097-13",
  "text": "-14-\nTHE EDUCATIONAL TELEVISION PROGRAMS INSTITUTE\nA Report by\nTrac-y F. Tyler\nUniversity of Minnesota^rMinneapolis\nTHE PENN STATE MEETING\nCollege and university presidents, superintendents of schools, and state department\nof education administrators (or their representatives) numbering nearly 100 individ¬\nuals spent four work-packed days at State College, Pennsylvania, April 20-24, 1952,\nplanning a television policy for education.\nA report of this significant institute, the basic elements of which were agreed upon\nprior to adjournment, will be issued soon by the American Council on Education, the\nsponsoring agency. Briefly, this forthcoming report will commend the Federal Com¬\nmunications Commission for its April 14, 1952, allocation of 242 TV channels for non¬\ncommercial educational use, point out the major uses of TV and its educationally\nsignificant by-products, and stress the essential next steps in the development of\neducational TV. These steps consist of uniting the educational and cultural re¬\nsources of each area to which has been assigned an educational TV channel; creating\na responsible legal entity to serve as the licensee; developing plans for construc¬\ntion, operation, and programming; applying for a construction permit; and, finally,\nconstructing and operating the station.\nThe educational leaders also urged the establishment of one or more well-equipped\nproduction centers planned to provide a minimum of two hours per day of high quality\nprograms for distribution to all educational TV stations. These programs, intended\nfor use during the choice evening hours, would be supplemented by presently available\npackaged programs, by informational and \"great events\" programs secured from the com¬\nmercial TV networks, and by programs utilizing the educational and cultural resources-\nof the local community.\nThe institute program provided even the novice with sufficient background to convince\nhim that TV's potential value to education made the FCC educational allocation one\nof the.most significant acts since the invention of printing. Participants saw\nkinescopes and sound motion pictures of marked educational significance, witnessed\nthe production of actual TV shows, listened to well-informed speakers discuss \"The\nChallenge of Educational Television\" - Penn State President M. S. Eisenhower, ACE\nPresident A. S. Adams, DuMont Laboratories President Allen B. DuMont, and JCET's\nExecutive Director Ralph Steetle. They met in groups of 20 to 25, reshuffled and\nprovided with different leaders and consultants for each discussion, to give care¬\nful consideration to each of these three topics: The Significance of Television for\nthe Education; Basic Planning for Educational Television; and Next Steps in Order to\nFurther the Development of Educational Television.\nThe final session was devoted to a consideration of the basic ideas and recommenda¬\ntions, resulting from the group discussions, to which members of the institute could\nagree.\nThe potential educational importance of television places the entire profession under\nobligation to The Fund for Adult Education, The Payne Fund, and the Alfred ]P. Sloan\nFoundation for the grants of funds which financed the institute; to the Radio Cor¬\nporation of America for the provision of equipment which made possible the television\ndemonstrations; and to all of the experts, commercial and educational, who contribut¬\ned so much to the institute members in furthering their knowledge of this new educa¬\ntional tool."
}