{
  "id": "d1097-21",
  "text": "-22'\nVariety Second Most Abundant\nNext to Drama comes Variety programs. They provided almost one-fifth of total pro¬\ngram time in both of the 1951 studies. This year, however, New Yorkers receive only\nabout half as much Variety as they did a year ago; it is down to 11 percent. Most of\nthe decline is in Variety for the General audience; Domestic and Children's Variety\nprograms still are about 5 percent of the total time.\nThe third most abundant form of entertainment is Sports in New York, and Music\n(mostly Popular Music) in Los Angeles, with between 7 and 9 percent of total time.\nThese three types of entertainment programs — Drama, Variety, and Sports in New\nYork, and Drama, Variety and Music in Los Angeles together account for almost two-\nthirds (60 percent) of all program time.\nInformation and News\nNow we come to Information-type programs, which range from 19 to 24 percent. We\nfound more information programs in Los Angeles than in New York. This is because\nin Los Angeles, Special News Features amounted to 9 percent (extensive remote pick¬\nups of the search for a kidnapped child, the discovery of her body, and the arraign¬\nment of the suspected murderer); such special features were negligible in New York.\nGeneral News broadcasts were 6 percent in both New York studies, and 3 percent in\nLos Angeles. More extensive presentations of Information (as in the case of Trav¬\nelogue and similar programs) amounted to 3 percent in all three studies. Domestic\ninformation being mostly cooking, shopping and merchandising programs, aimed at\nhousewives, was about 8 percent in all three studies. Information programs for\nchildren, and Sports News were about 1 percent, while Weather programs were less\nthan 1 percent in each study.\nLastly we come to the Orientation-type programs. These totalled 4 to 7 percent,\nand included Public Events, Public Issues, Public Institutional, and Religious\nprograms. Orientation programs were more numerous in New York than in Los Angeles\nand increased in New York within the past year, although the proportions were very\nsmall. The largest single class of these in the most recent New York study was 2\npercent for Public Issues Programs. Religion got only 1 percent. Since educational\ninstitutions are more likely to be identified with Orientation-type programs than\nthe other two groups, this is an appropriate place to note that in 1951 there was\nonly one program identified with an educational institution in New York, and there\nwas none in Los Angeles. In 1952, however, we found 13 such programs in New York,\nof which 9 were on non-network stations and 6 were on WATV alone.\nAdvertising Statistics\nSo much for the highlights of the program portions of our studies. Now, what of the\nadvertising? In all three studies we tried, but were unable to determine from the\nposition of a television viewer just which programs were sponsored, and which were\nsustaining programs. The FCC has rules requiring the identification of sponsored\nprograms. Of course, some programs are identified. But for many programs, the\nviewer simply could not know this fact.\nWe found that primary advertisements (analogous to the \"commercial announcements\"\non aural radio) occupied more time in Los Angeles (13 percent) than in New York (with\n10 percent in 1951)* and that this year in New York the figure had dropped to 8 per¬\ncent. New York's primary advertisements this year were shorter than last year.\nThis way the New York stations used less total air time on them while increasing\nthe average number per station for the week from 3^9 to 443. Dos Angeles TV stations\nin 1951 averaged 519 per week."
}