{
  "id": "d1097-9",
  "text": "UNIVERSITY' OF MINNESOTA INSTALLS CLOSED CIRCUIT TV EQUIPMENT\nThe University ..of Minnesota recently purchased closed circuit television equipment,\nThe equipment includes a two-camera chain together with apparatus for picture monitor¬\ning and blending, television sound pick-up and reproduction of film. .Studio lights,\nrepair parts and test equipment were also purchased.\nIn developing the television project KUOM will work jointly with the University’s\nAudio Visual Education Service, Institute of Technology, School of Journalism, and\nDepartment of Speech and Theatre Arts. The newly*purchased equipment will be used\nby personnel of the five departments to develop TV production and technical skills.\nIt will also be used for rehearsals of University television programs produced from\ntime to time over Twin City TV stations. In addition, the University plans to offer\ncourses in television production and engineering.\nThe equipment is housed in the audio-visual motion picture studio at the University\narmory.\nADULT EDUCATION (LOWELL) PROJECT REPORT\nWilliam Harley, coordinator of the Adult Education Project, has prepared the progress\nreport on the project which is quoted below:\nJeffersonian Heritage: Four programs have been produced on tape, starring Claude\nRaines in the title role. Production will be resumed after Raines returns from\nLondon; in the interim, four scripts are being written by Milton Geiger so that\nthey can be produced immediately upon Raines’ return.\n■People Under Communism is the title selected for the five full-hour programs on\nthe U.S.S.R. Four of the five scripts in this series are finished and two of the\nprograms are currently in production. It is hoped that all will be completed by\nMay 15.\nWays of Mankind: Four scripts have been completed in this series written by\nLister Sinclair and Len Peterson of the CBC. Production has been held up pend¬\ning the availability of Andrew Allen, chief of production for CBC, who has just\nreturned from England. Three shows were scheduled for production in Toronto the\nweek of May 5th.\nDiscussion of Public Affairs: Four pilot series are being developed in this\narea:\n1. International Discussion Series - based upon a plan by Neil Morrison, Direc¬\ntor of Talks for the CBC. Morrison, along with Harmon Grieswood, Director of the\nThird Programme, whom we are bringing over from London, met with us in New York\nApril 28 - 30 to discuss plans. Helen Hyatt Weller, conductor of the Herald\nTribune Forum, has been hired by NAEB to administer this series.\n2. \"Talk Back\" - Series of programs utilizing expert opinion integrated with\ncitizens' responses will be under the direction of Ralph Tangney,. Lowell Insti¬\ntute Cooperative Broadcasting Council.\n3. A series of interviews from Europe will be taped by Milton Mayer, Journalist\nand writer, currently teaching at the University of Frankfurt.\n4. A series of 52 quarter hour talks on communications and public opinion with\nparticular emphasis on the role of radio and television."
}