{
  "id": "d170-15",
  "text": "t * - COPY\nThis is a true copy of a personnel evaluation prepared by Rohrer,\nHibler & Replogle, 1103 Midland Building, Cleveland 15, Ohio, for\nthe Farm Bureau Insurance Companies, Columbus, Ohio.\nCertified by\n/s/ George A. Bernstein\nGeorge A. Bernstein\nPERSONNEL EVALUATION\nThis report contains the results of a psychological examination which\nhas been made to determine the nature and extent of the personal\nqualifications of the individual under consideration.\nPositions Assistant to the General Report onS George A.\nManager Peoples Broadcasting Bernstein\nCorporation, Farm Bureau Insurance Ages 37\nCompanies, Columbus, Ohio\n1. He reads and comprehends very rapidly. His oral and\nwritten verbal ability is superior. He is a creative\nperson who finds it easy to deal with the theoretical\nand the abstract and who is used to approaching\nproblems broadly and comprehensively. While his mental\nprocesses utilize both inductive and deductive methods,\nthe inductive predominates. He remains in touch with\npractical reality while being aware of the broader and\nmore general implications.\n2. He is very superior in mental ability ranking in the\nupper two per cent of the general population. While his\nmathematical ability is good, his verbal facility is\nexceptional. He is an int&Lectual adventurer who is\nsensitive and alert to many facets of the culture —\nhis interests are many and diversified, but they tend\nto cluster In social and aesthetic areas with a drive\nto relate these categories to business life. He has\ninner poise and a quiet self~confIdence.\n3. He is a very sensitive and emotionally broad person who\nkeeps his feelings under strong control. He leads a\nconservative and cautious emotional life by force of will.\nAn imaginative and easily stimulated person, he holds\nthese tendencies back and seldom allows them to step out\nof the boundaries of practical reality.\n4. He Is a complicated personality with many ambivalences. For\nexamjfe, he is at once the dreamer and on the other hand,\nan active doer. He is aggressive and assertive, but he\nfrequently puts a damper on these proclivities and becomes\ncontemplative. And he has stated that he is ideologically\nliberal while personally conservative."
}