{
  "id": "d170-40",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPERSONNEL POLICY STATEMENT\nPromotions and Salary Increases\nVacancies occurring, for any reason, shall, where practicable, he filled by\npromoting a person already employed by the NAEB; provided, that such person\nshall be fully qualified to fill the position vacated.\nSalary increases normally will be given at the start of the fiscal year\n(July l), except that increases may be awarded at other times when deemed\nadvisable. Based on merit, and length of service, salary increases normally\nwill be given to each employee each year, and such increases normally shall\nbe between % and 10$ of the employee's current salary. However, financial\nconsiderations, ability and attitude of the employee, or other considerations\nmay limit the amount and frequency of salary increases, and nothing in this\nsection should be construed as a guarantee that such increases will be forth¬\ncoming.\nInsurance\nEach employee is covered for Workmen's Compensation by a policy carried by\nthe Association, except those NAEB employees employed through the University\nof Illinois who are covered by the University.\nAll employees in the Urbana office, whether actually employed through the\nUniversity of Illinois or not, are eligible to buy health insurance under\nthe University's group policy.\nThe president of the Association is covered by a travel accident policy\nwith the Association named as beneficiary. Other employees and Directors\nare to purchase travel accident policies for each trip taken on Association\nbusiness, with the premium to be paid for by the Association.\nRetirement Benefits\nEach employee employed through the University of Illinois becomes a parti¬\ncipant in the University Retirement System. For such employees the Associa¬\ntion shall contribute to the Retirement System such amounts as are required\nby the System; each such employee shall likewise contribute the amount\nspecified by the Retirement System.\nEmployees not employed through the University of Illinois are covered by\nSocial Security, with the Association and the employee making such contribu¬\ntions as are required by law."
}