{
  "id": "d170-60",
  "text": "HAEB Headquarters\n3li Gregory Hall\nUrbana, Illinois\nco^mmsm.'mm to boabd only.\nTO;\nTHOM?\nDATE;\nSUBJECT;\nHerewith a brief suwnsaiy of the flying trip 1 made last week with Cecil\nBidlsck. In 5. general way it provided the occardon to visit for the f irst\ntijm the ETEC at Ann Arbor, and Kellogg in Battle Creek. It also was based\nc-r a meeting scheduled with Stanley Andrews of NPAC and Newburn in Jackson,\nmd informal discussions with G> H, Griffiths in Chicago on' September 23.\nHere briefly is the listing of stops and of the highlights which I feel\nmay be recorded. 1911 ’be glad to supplement orally in Haw York as needed.\n!•) I0;-.: Hera X found the situation less encouraging as far as the\npropo sed~ecf I optional television station is concerned than I found it a year\nago. The present Chairman of the Television Committee is not sold on ETT.\nProgress looks slow'and painful.\nOn the other band, progress marie by Wiilys Electronics, which non has'\na complete psc.xaga ready for UHF stations does show considerable progress.\nThey will have an exhibition at the Hew York Convention at which it will\nbe possible for you to draw your own conclusions more adequately than I can\nrecord them here. Suffice it to say that Bidlack aid X found this © encour¬\naging new element in both the UHF and ETV picture.\n2) jjfitroi-t: Here, where I had also paid a visit last summer, I found\nthat educational television plans had had to be somewhat compromised in view\nof the inability to secure as broad financial support as was* anticipated-.\nSince Paul Rickard can more adequately report on this than I, I shall not go\ninto any great detail on this point at this tine.\nAlthough it is obviously only a personal reaction, I do feel that it\nio generally essential .that in'such organisations a coordinator be 'provided^'\nrather than having the schools involved administer their portions of the sta¬\ntion tilt© index&iidently, as if they were diared-tivas stations. TMs was w\nprincipal concern regarding the Detroit. ETV setup, as reported to Paul.\n'/Jiiile there Paul took me- in to see President CX-arenoe Bilberry, with Vice\nPresident Bill Stirtbn. Both the President and Vice President Stirton believe\nin the need for the proposed meeting.of presidents at the Hew York Convention,\nsent stives of the presidents of other institutions could make it. ThisTs^a\npa2\"tl)Y~We reason for the hasty -canvas instituted on this matter.\nBoard\nSkomi.\n.ft ft\n1\nSeptember 29, 19$b\nRecent trip (September 20-23)"
}