{
  "id": "d170-65",
  "text": "CONFIDENTIAL\nTentative Minutes from Skornia Notes on Urbana Meeting, October 5, 1\nIn attendance were President GRAYDON AUSMUS, Treasurer FRANK SCH00IEY, former\nPresident and present Director RICHARD Bc HULL, WILBUR SCHRAMM, and HARRY SKORNIA*\npie discussion revolved around an organized presentation on behalf of the NAEB\nin which its objectives would be clearly stated as & part of a request for funds\nfor continuance of present services and the as,sumption of JCET and NCCET services\n(if these organizations should be discontinued) which wou.ld be included in the\nWashington office which the NAEB also proposes to set up* This proposal will\ninvolve evaluation (including measuring the success of the JCET and the NCCET)\nin getting EOT established in the United States, in comparison with the budget\nexpended for this purpose* It should also involve measurement of success to\ndate in getting EOT recognized as a legitimate, built-in, core curriculum part\nof education, to be financed in a regular, rather than a special, way.\nAt the outset, as Wilbur Schramm pointed out, certain assumptions must be\nmade. In these assumptions we must define what we think will be the role of edu¬\ncational television and radio. We must then go on to assume that if this role\nis to be played in America certain services will be needed (without regard to\nwho performs each)o<>0*We then should base our proposal on a picture in which we\npropose certain financing, and a recommended administrative setup,\nIo Assumptions;\nAmong the assumptions vie must make is that the NAEB has a long-range future,\nthat- it has a broad fiscal base which rests on the services it can provide its\nmember stations partly defrayable through service chargesc It therefore has a\ntax base which emphasizes the need for both television and radio to be built into\nthe budget of regular educational, stations. At this point Dick Hull quoted Harold\nLasswelPs statement that in the twentieth century there is no still small voice\nwithout the resonance of twentieth century mass communicationsa\nAnother assunption that must be made is that radio is here to stay for the\nfor see able future. In this assumption we must also visualize funds needed for\nat least five years, indicating what we think will be the status of EOT, educa¬\ntional radio, and the various projects at the end of these five yearso This will\nbe covered in greater detail under financial and administrative structure below*\nlie Jobs To Do;\nAmong the jobs which must be done and functions performed are notably the\nfollowing:\n1) Ways of meeting the fiscal, crisis, both for education as well as the com¬\nmunications media, need discovering* In this respect the analogy of\nGerman community stations which are as independent as community EOT sta¬\ntions in the U* S0 are to be* Hoever the German stations have a regular\nbase of fiscal support in the form of the taxes paid by each set owner\nwhich gives them an adequate and regular budget*\n2) Another job to be done involves the exchange of ideas, exchange of mate¬\nrials, and doing whatever is necessary to be sure that better programs are\nsecured* We need a center to distribute programs, as well as sources of\nprograms for both television and radio* We need reports for EOT and radio\nbefore Gongress, and throughout the nation, as we3.1 as abroad*"
}