{
  "id": "d170-66",
  "text": "-2-\n3) We need to develop fellow areas in a Point Four Program approach in many\nparts or the Ua So where coimaunications are backward, c\nh) We need what Wilbur Schramm calls a continuing source of aid and comfort\nin criseso\n5) We need all the cooperation and interchange we can get with other educa¬\ntional communications»\n6) We need increased nationwide coverage, to fill in the many white spaces\non the NAEB map0 ^\n^ ©valuation (either under a separate organization or under the\nKALB) and research, possibly as a national research office, carrying on\ncontinuous studies in production, writing, and utilisationo\n6) We need continuous training and up-grading programs for personnel,,\n9) We need a certain amount of \"mad money” for experimentation with new ideas,\nfor innovation. Probably a hundred thousand dollars or so is needed for\nthis sort of development.\n10) We need to extend and intensify the usefulness of schools to society. We\neducation8^ increasing demand for tetter school education and adult\n11) We need to help meet the crisis which is imminent in this area within\nten years. Educational institutions are finding it harder and harder\nto meet the growing crisis of increased enrolments of all kinds* fcf,\nPenn State option of taking courses by television as well as in person).\nIn some cases W-oaught courses seam better than classroom courses in ?\nthose areas where demonstration (as for science or medicine) are involved,\n12) We need get across to educators the need to involve the total educa¬\ntional institutions in educational radio and T?0 ™“\n13) We need to involve legislative leaders in our activities0\nli;) We need a device for looking and seeing ahead, perhaps an annual \"think\"\nsession, a senior council of a half dozen experts in as many fields,„\nsome means of keeping ahead of developments, of visualising and calling\nattention to \"the growing edge\" in society and education*\nHI * Financial Structure Needed:\nfir»i ^likT8Siigat:i?f a *as® °£ fin8noia:L support for the services needed, sev¬\neral practical considerations must be taken into account. There ere non-profit\norv^frmrfh ^ W0I_W* , Tp;eve ia ®smbership supports the flAEB now derives nearly\none-fourth of its supporp from member dues and assessments; the ETRC probably\nmot 1^1 It would seem that for the sort of one-time oro-\n5 ^ict? th® NCCET now fE °ailed upon to do, an advertising agency\noht wexl be enpleyed as needed if fiscal considerations are to be taken into"
}