{
  "id": "d170-87",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPERSONNEL POLICY STATEMENT\n11-A\nPromotions and Salary Increases\nVacancies occurring, for any reason, shall, where practicable, be\nfilled by promoting a person already employed by the NAEB; provided,\nthat such person shall be fully qualified to fill the position\nvacated.\nAlthough salary increases, based on merit, length of service, and\nother considerations, normally will be given to each employee each\nyear, financial considerations, ability and attitude of the employee,\nor other considerations may limit the amount and frequency of salary\nincreases, and nothing in this section should be construed as a\nguarantee that such increases will be forthcoming.\nInsurance\nEach employee is covered for Workmen’s Compensation by a policy\ncarried by the Association, except those NAEB employees employed\nthrough the University of Illinois who are covered by the University.\nAll employees in the Urbana office, whether actually employed through\nthe University of Illinois, are eligible to buy health insurance\nunder the University's group policy.\nGroup health - Lincoln National Life Insurance Company\nWho is eligible: All permanent employees of the NAEB regularly\nworking a minimum of 30 hours per week. Dependent coverage is\navailable to all members of the staff. An employee with dependents\nwho does not insure them at the time he takes out his personal\ninsurance, but decides to include them 30 days or more after his\npersonal insurance is in effect, must furnish evidence of insurability\nfor each member of his family to the insurance company at no cost to\nthe company.\nWaiting period: An employee is eligible for group health insurance\non the first day of the month following a thirty day waiting period.\nFor example, if an employee’s thirty day waiting period was up on\nthe second day of the month, he would be eligible for health insurance\nthe first of the following month.\nPremium: The Association pays the premium for employee coverage and\nthe employee pays the premium for his dependents’ coverage.\nConversion privilege: Upon leaving the NAEB, an employee shall be\nentitled to have issued to him by the Insurance Company, without\nevidence of insurability, a policy of hospital and surgical insurance"
}