{
  "id": "d170-93",
  "text": "TRAVEL & BUSINESS EXPENSE REGULATIONS\nAdvance Authorization\nNo expenditures are to be made or committed for out-of-town\ntravel by Washington and Urbana based personnel unless a Travel\nAuthorization Form has been completed and approved by the appropriate\nDivision or Project Director, the President, and the Vice President.\nThe President’s approval is required for travel by the Vice President,\nand vice versa.\nReporting Out-of-Town Expenses\nExpenses incurred in connection with business trips shall be\nreported, within 30 days following completion of the trip, in\ncomplete detail on a regular NAEB Travel Voucher. All Travel Vouchers\nshall be filled out in compliance with the regulations printed on the\nback thereof as well as the following regulations:\n1 - All expenses must be handled as cash expenditures except\nfor air, rail, rental car, or bus transportation, which may be\ncharged. Such transportation charged will be paid by miscellaneous\nvoucher when billed, with cross-reference to the pertinent travel\nvoucher(s).\n2 - Guest meals must be reported on a Business Entertainment\nVoucher. Miscellaneous items and taxi fares must be explained in\nfootnotes accompanying the Travel Voucher.\n3 - No personal expenses, including telephone, should appear\non the Travel Voucher.\n4 - Payment of tax on public transportation will be disallowed,\nand a tax exempt slip should be used at all times when paying for or\ncharging transportation.\n5 - When rental cars are used, a copy of the charge sheet must\nbe attached to the Travel Voucher.\n6 - Transportation charged must be indicated on the Travel Voucher,\nwith the amount indicated in parentheses (not carried to the Totals\ncolumn) and the vendor named,\n7 - When personal cars are used for transportation only actual\nmileage, at 10£ per mile, or air fare, whichever is less, will be\npaid. However, when two or more persons, for whom NAEB is paying\nexpenses, travel together, mileage may be charged if it does not\nexceed the aggregate air fare for all those travelling together in\nthe car. When a personal car is used, in addition to mileage, reim¬\nbursement for tolls and storage is authorized. Under any of the\nforegoing circumstances, complete details will be provided on the\nTravel Voucher.\n8 - Economy and coach accommodations are to be used for air\ntravel except when first-class fare is necessary.\n9 - No exceptions to these travel regulations will be made unless\nspecifically approved in advance on the Travel Authorization Form."
}