{
  "id": "d1550-1",
  "text": "to the lower three commercial channels (221, 222 & 223).\nFCC RESERVES HEW CHANNELS FOR ETV\nOn July 30, the FCC reserved 10 new channels for ETV, proposed 10 additional\nreservations, and deferred action on two others. Those reserved were: Atlanta,\nGa. - moved Ch. 57 from Marietta and reserved it; Ogden, Utah - removed reservation\nfrom Ch. 24, and reserved Ch. 9 (KOET, Ogden City Bd. of Ed. already in operation);\nPuerto Rico & Virgin Islands - reserved eight channels as listed in Washington\nReport, Vol. IV, No. 8, at time of request*\nThe Commission proposed reservation of the following: San Francisco -\nOkaland - reserved Ch. 38; Chattanooga - reserved Ch. lb; Athens, Tenn. - added\n& reserved Ch. 47; Sacramento - proposed two alternatives in response to petition,\nallocated Ch. 19 and reserved either Ch. 19 or Ch. k6; Atlantic City - reserved\nCh. 52; Watsonville, Calif. - reserved Ch. 22; Santa Barbara - reserved Ch. 20;\nKeene, N.H. - reserved Ch. 45; Littleton, N.H. - reserved Ch. 2b; Waycros?, Ga. -\nreserved Ch. 8 (WXGA, Ga. State Bd. of Ed., Atlanta, already in operation).\nThe Commission also announced that the proposals for reservations at\nMontclair and Trenton, N.J., were not in harmony with Docket #14229, and action on\nthese will take place later.\nPreviously, on July 10, the FCC reserved Ch. 17 as second ETV channel in\nMinneapolis-St • Paul, upon petition hy Twin City Area ETV Corp. (KTCA-TV).\nADDITIONAL APPLICATIONS FOR ETV GRANTS\nHEW reports that six more applications for matching-fund grants under the\nETV Facilities Act have been received (as of July 13 - the first six were reported in\nWashington Report, Vol. IV, No. 9): School Dist. #1, City & County of Denver, to\nexpand facilities of KRMA-TV - $78,251; Greater Washington ETV Assoc., to expand\nfacilities of WETA-TV - $200,485; Utah State U. (Logan), for new ETV station operating\non Ch. 12 - $143,908; Milwaukee Bd. of Adult and Voc. Ed., to expand facilities of\nWMVT-TV - $223,300; Regents of U. of N. M. and Bd. of Ed. of Albuquerque, to expand\nfacilities of KNME-TV - $431,848; Duluth-Superior Area ETV Corp., for new ETV\nstation operating on Ch. 8 - $482,450.\nEMERGENCY BROADCAST SYSTEM REVISED\nA revised plan for broadcast station operation during emergency conditions\nbecomes effective August 5. AM, FM and TV(Aural) facilities holding National Defense\nEmergency Authorizations will continue on the air, after notification of an\nemergency, on their regularly assigned frequencies, since the CONELRAD plan for using\n640 and 1240 kc is no longer deemed necessary by the military. Immediate upon the\nreceipt of a national alert, all AM, FM and TV stations will discontinue normal\nprogram transmission and make certain prescribed announcements. Those not in the\nEmergency Broadcast System will advise listeners or viewers to tune in area AM stations\nin the system, then go silent.\nLOGGING AND OPERATOR RULES AMENDED\nOn July 10, the FCC amended its technical logging and operator rules to\nexempt noncommercial educational FM stations operating with transmitter power of\n10 w or less from the requirement for a five-day-per-week inspection of transmitting\nequipment. The rules were further changed, effective Aug. 19, to permit AM stations\nwith power of 10 kw or less (& nondirectional antenna) and FM stations with power\noutput of 25 kw or less to employ under certain conditions a supervisory engineer\nholding a 1st class license on a contract basis (rather than full-time)."
}