{
  "id": "d1550-14",
  "text": "Although it is very hard to evaluate the precise effects that an aperture corrector\nmay have on kinescope recording, our observations have shown that it enchances the\nover-all sharpness of almost all types of live pictures and the final kinescope,\nwhether it be positive or negative, has a considerably higher degree of sharpness\nthan those kinescopes made without the use of an aperture corrector. As you all\nknow, the resolution practically obtainable on 16mm kinescope recording at the\nbest is very poor, and through the use of the aperture corrector, one can help\nthe situation along, but, of course, not completely kill this particular ill.\n*****\nHere's a letter from ’’Bud\" Phillips, Chief Engineer, of the Television Center at\nthe State University of Iowa at Iowa City, which should be of interest to our\nkinescope recorder operators.\nnWe have tried something out here which may be worth passing on to others. We\nhave secured very good results from the new Eastman 7374 film stock which we have\nbeen using for negative video recordings. As you know, most of our prints are\nprojected on screens far more than they are used on television film chains. For\nthis reason I believe that we have been trying for a little more contrast than\nmost kine operators. We find that we can get a flat print from a contrasty neg¬\native by changing printer lights but of course it is difficult to go the other way.\n’’After making a projection print on our standard 7302 print stock, we recently\nprinted the same show on master positive stock Eastman 7365. The results were\nvery gratifying. It has terrific resolution and squeezes everything out of the\nnegative that is there. In addition it is flatter. It never goes to black or\nwhite but the gray rendition in between is excellent. I think it makes an ex¬\ncellent television print. Cost wise it is not prohibitive. It costs us about\ntwo-tenths of a cent more per foot. I think it is worth it.”\nMerlyn Rawson, Chief. Engineer, Department of Telecommunications of the University\nof Southern California at Los Angeles sends a note I’m sure will be of interest\nto vidicon camera operators who have been using 3RP-1 (green) Viewfinder Tubes.\n”1 have found that it is now possible to obtain 3RP-4 (white medium phosphor)\ntubes to replace the 3RP-1 by special order to the Vacuum Tube Products Company,\nInc., 506 South Cleveland Street, Ocean Side, California.”\nHis letter aroused my curiosity and I looked them up in an RCA Tube Manual and\nfound both of these tubes listed there too. A local distributor gave me a price\nof $17.30 on the 3RP-1 and'$18.50 on the 3RP-4. I’m sure that the tube with the\nwhite phosphor.would be well worth the additional cost.\n#*###\nWe have available a mimeographed paper describing the W0I-TV Composite Gray Scale\nGenerator complete with schematic. These have been sent to all TV stations and\nproduction studios with kinescope recorders. If we missed you we'll be happy to\nsend you a copy upon request."
}