{
  "id": "d1550-15",
  "text": "-15-\nAttention operators of small AH or FM stations 1 You will be interested to know that\nthe NAEB Engineering Committee has recommended that funds be allocated for a Seminar\nor Workshop for AM and FM station engineers and technicians. The NAEB Board now has\nthis request under consideration.\nIf funds are allocated for this purpose, it is proposed to hold such a seminar in\nJune. All, or the major portion, of the participants* expenses would be paid. The\nseminar would be of three to five days duration and in general would cover AM and FM\ntransmitters, audio equipment, tape recording equipment ard possibly test equipment.\nThe aim of the seminar would be the upgrading of technical personnel by demonstrating\nhow they might maintain and improve the quality of their studio and transmitting\nequipment.\nThe NAEB Engineering Committee believes that this seminar should be limited to those\npersons actually operating and maintaining the equipment. Much has been done for\nthe upgrading of television personnel. The Committee believes such a meeting would\nfill a great need by supplying wanted technical information as well as boosting\nmorale of those from member radio stations who form such a large group in NAEB\nmembership.\nIf you are interested in attending such a seminar, we*d be glad to have your comments\nand suggestions for the program.\n•shbbh;-\nOn the following page you will find a sample kinescope Recorder Log suggested by\nMr. Joseph Richer of the General Precision Laboratory. No doubt most kinescope\noperators are using a log similar to this. However if youtre not, we strongly ad¬\nvise that you keep some type of log. Let me quote what Joe says about this log:\n\"I think it is self-explanatory and that you can see why I included certain items.\nOn the whole, a continuous record of these sheets gives you an excellent background\nof data from which to work as well as providing day to day checks to ascertain the\nconsistency maintained by the operator and the processing lab.\n\"The roll number and emulsion number are important for recording data and will often\nindicate the reason for density changes when all other data is consistent,\n\"If sound is magnetic no other comment is required, otherwise the test density read¬\nings are a double barreled check on the operators. First you can see if they are\nconsistent, second, by noting changes in lamp current to hold the density, you can\npredict changes in advance based on experience.\n\"The information on picture size, high voltage, bias, beam current, brightness and\ndensity for both black and white are self-checking features as well as controls for\nconsistency; i.e., if high voltage, bias and beam current are the same as past\nrecords show to be correct and brightness is different, the operator can recheck\npicture size. If he doesn*t, you will catch the error in the density checks. The\nequivalent bias (white) checks the operator*s calibration and testing techniques.\""
}