{
  "id": "d1550-9",
  "text": "-9-\nJoint-Management Engineering meeting will be held Tuesday, April 17.\nWe*d advise you to watch for the program in the trade magazines,.and if\nthere*s any chance of getting to attend for only a day, we*d advise you\nto go. You*11 find it well worth your while.\nn\nWe spent February 1^, 16 arid 17 in Detroit at the invitation of Dr.\nPaul Rickard of Wayne University. We were there to help.alleviate some of\nthe growing pains they were suffering with the installation of a second cam¬\nera chain and switching equipment. We were working with Keith Kossuth, Wayne1s\nChief TV Engineer, and were frequently interrupted by the production staff\nwanting to know when they could incorporate the second camera into their pro¬\nductions.\nWe had to leave with the intermittent operation still a problem, but\napparently we were closing in on its location as Dr. Rickard reports the\nsecond camera went into service on February 21 so we anxiously await word\nfrom Keith whether the suspected peaking coil was the source of the diffi¬\nculty.\nIf you*ve had to finish out a show on one live camera, without film\nfacilities you can appreciate some of the problems of the operation at Wayne\nUniversity where they*ve been operating on one camera since October. This,\ntype of operation is also normal at the Public Schools Studio and at Detroit\nUniversity. However at the Schools Studio they have a film chain with slide\nand film projectors which provide some needed relief. Detroit U. was given\ntwo used DuMont chains, one of which has been completely rebuilt so that\nnow they have two live chains in operation.\nWe viewed some kinescopes of Wayne U. programs. I offer my sincere con¬\ngratulations to their production staff and their student crews for the results\nproduced. With an ingenious mirror arrangement attached to their single live\ncamera, they were producing horizontal wipes from a speaker to close-ups of\nsmall objects. They projected slides through the control room window into\na shadow box with a minimum of black between live talent on camera and slides.\nAnd now with two live cameras their producers will really go.wild. It all\ngoes to prove that seemingly impossible things are possible if there is the\ndetermination to do them.\nWe had a meeting Friday afternoon (17) with technical personnel.of the\nDetroit Educational Television Foundation at the Public Schools Studio and\nthe Foundation transmitter. They were all on hand to discuss their opera¬\ntional problems - Dean Cook and his studio crew, Gordon Ward, Clem Grzywacz;\nJoe Jankowski, Jr., and Irving Laing, who operate the transmitter,.Bill\nGrover, the kinescope recorder technician; Roland Renaud and Joe Kiss of\nthe University of Detroit; Keith Kossuth of Wayne U. and the writer. I\ncame away with the impression that educational TV is going places in Detroit."
}