{
  "id": "d1220-2",
  "text": "If the colleges and universities of the nation miss this \"second chance\"\nMost of the failures of the past have \"been due (and In thie order) to\nseveral vital factors*\n(a) Misunderstanding of the medlna* its psychology and its audience\n(h) Poor sanagcnsnt\n(c) Poor financing\nThe Proaleo\nThe successes that lie within our grasp man an about-face plus realisation\nof the fact that \"in union there is strength\" and even snore iaportant fact\nthat we haw© for these many years been indulging ourselves in an inferiority\ncomplex that borders oa a psychosis.\nTHE FACT IS THE COLLIES ARB THE UNIVERSITIES ARE THE SOURCE AND THE FOUNTAIN\nHEAD OF RESEARCH. TEACH I NO. AMR INFORMATION IN THIS COUNTRY. THE RESOURCES OF\nARY LAND CHANT UNIVKRSOT—THE PHYSICAL RESOURCES ALONE—COMPARE FAVORABLY WITH\nMANY CORPORATIONS. BY DEFINITION WE HAVE AUTHORITY AND THAT AUTHORITY IS SOUGHT\nAFTER BY THE TOY BUSINESS MM WITH WHOM IT IS SAID WE CANNOT COMPOTE.\nIS IT CREDIBLE THAT THE BRAINS WHICH PERFECTED THE MEANS OF UNLOCKING THE ATOM\nCANNOT LEARN THE FEW PSYCHOLOGICAL DEVICES WHICH RADIO DEMANDS WHEN A SELLER OF\nSOAP CAN MASTER THE TRICKS IN A FEW WEEKS?\nDOES XT MAKE SENSE THAT COLLIDES AND UNIVERSITIES WHICH GUARD AND ADD TO THE\nSTOREHOUSE OF MEN3 S KNOWLEDGE CANNOT ADOPT FOR THEMSELVES THE SAME KNOWLEDGE\nOF COMMUNICATION TECHNIQUES MICH ADVERTISING AGENCIES SEEK FROM THEIRS\n(THE UNIVERSITY**) DEPARTMENTS OF PSYCHOLOGY?\nGOOD MANAGEJOTT AND UNDERSTM7OTG OF THE MEDIUM ARE MORS IMPORTANT THAN\nLARGE BUDGETS* AT LEAST TWO STATIONS ARE ABLE TO PRESENT UNIQUE\nAND SPECIAL PUBLIC SERVICE MATERIAL IN SUCH A WAY THEY ARE SERIOUS COM¬\nPETITION TO COMMERCIAL STATIONS IN THEIR AREAS*\nThe Urg^gg\nW© live in a time of criele—mr& acute in tanas of irarvivalr~thaa moat of\nub ar© willing to eteit. The situation 1b indeed, as Mr. H. G„ Welle once\nsaid* \"A race between education and catastrophe.\"\nWe live, as Barbara Ward said at last year4s Institute, at what aay be the\nturning point in a 500 year experiment in democracy.\nW© aunt then realise, in an age of mass conauaication and of aaas publics,\nthat the teletype, the virel©®©* the movie, the prose, the radio are after\nall ONLY TOOLS. They are devices? they are means. THEY ARE NOT ORGANISMS\nINTI TIES IN TK^SSaLVES. THEY ARE NO BETTER NOR WORSE THAN THOSE WHO USE\nTHEM. RADIO IN ITSELF IS NEITHER GOOD NOR BAD."
}