{
  "id": "d1220-4",
  "text": "*\nMonday, May 3 OHIO INSTITUTE 2§00 B«\n* (Discussion jointly sponsored by NASB and AER)\n1, \"SERIOUS RADIO IN AMERICA^~THE ROLE OP THE COLLBBK. TOE UNIVERSITY. AND THE CITIZM\"\n’\nTALK (Suggested speakers George Stoddard, President, University of Illinois.\n30 Bln, choose one for 30# Robert Hutchins, President, Chicago University,\nas \"kgynoter\") Major Armstrong, Columbia University,\nWalter Lemmofc, World Wide Broadcasting System.\nJohn Studebaker, Office of Education*\n2.\nPANEL To cover such topics as$ college and university resources, an educational\n30 min. network (transcription or 5M), radio research, program and promotion,\nobjectives, radio for special audiences, (school system stations, campus\nstations, regional and general audience stations, rural audience and urban\naudience stations, production centers)-«all pointed to bringing out gglsgl*\noperating, jmd successful projects now In exiatgR6&>.\nWilbur Schramm. University of Illinois might well preside.\nSpeakers could be selected from the following roster in terms of their\nspecialities (Siegel and/or Armstrong on network for instance).\nParker Wheatley, Lowell Institute\nHarry Skornia, University of Indiana\nSeymour Siegel, N0 Y. Municipal Broadcasting System\nWilliam Sener, University of Southern California\nAllen Miller, Hockey Mountain Radio Council\nGeorge Jennings, Chicago Radio Council\nM. 3. Novik, Radio Consultant\nHarold McCarty, University of Wisconsin\nMajor Armstrong, Columbia University\n(Speakers should be selected for speaking skill as well as knowledge)\n3. 30 min. Discussion and questions from the floor\n4. 10 min. \"Work of the ASH Implementing Serious Radio in America**\n5, 10 min. •Work of the NAEB in Implementing Serious Radio in America\"\nNOT®?? (a) (The session could then end with members of both ASR and NAEB ready to\nenlist members and working plans for the coming year and be prepared\nto give positive suggestions and advice to prospective stations operators\nor producers).\n(b) I would favor Stoddard over Hutchins as the keynoter.\n(c) The meeting is jointly \"sponsored\" by AER and NAEB. We should make\nclear our business meetings, etc. will be separate. I would, however,\nlike to see one joint luncheon or dinner In addition to whatever we have\nseparately. Will appreciate reactions on this."
}