{
  "id": "d1259-0",
  "text": "o\nmm,\nof the NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 30, NO. 1 WASHINGTON, D.C. JANUARY, 1965\nNAEB Gets $600,000 from Ford\nThe NAEB has received a three-year grant of $600,000 from\nthe Ford Foundation to improve instructional TV quality.\nFunds will be used for regional seminars and a national pro¬\ngram of consulting services. Staff appointments will be an¬\nnounced soon.\nIERT To Be June 2-4\nThis year’s Institute for Education by Radio-Television (the\n35th) will be June 2, 3, and 4, in Columbus, Ohio. Radio and\nTV program entries for Ohio State Awards must be post¬\nmarked not later than January 15.\nPlan NAEB '65 Convention\nMiss Mary Lynn Moody, NAEB convention coordinator, has\nannounced that plans are under way for the 1965 national\nconvention. Dates: October 31-November 3. Location: Shera-\nton-Park Hotel, Washington, D.C.\nWisconsin to House NAEB Archives\nThe Mass Communications History Center of the Wisconsin\nState Historical Society has been named as the repository for\nNAEB historical materials. The designation was made by the\nNAEB Board on recommendation of the History and Archives\nCommittee.\nRegion II to Meet in March\nRegion II NAEBers will meet March 19-21, 1965, at Colonial\nWilliamsburg, Virginia. John Young, director of television,\nWUNC-TV, University System of North Carolina, will serve\nas general chairman of the conference, with Colonial Williams¬\nburg and the College of William and Mary, as rrvhnstft.----\nJames Etheridge, Jr., executive director, Florida ETV\nCommission, Tallahassee, and the region’s Individual Member\nrepresentative on the NAEB Board of Directors, said that he\nand other national directors in the region will assist Young and\nhis conference committees. Speaking of the meeting, Eth¬\neridge said, “I hope the first business session of the Williams¬\nburg conference will consider broadening the leadership of,\nand participation in, Region II activities—enlisting repre¬\nsentatives of all divisions of NAEB and of special fields of\ninterest, perhaps as a Region II executive committee which\nwould elect the Region II chairman.”\nHe added, “I earnestly hope that increased participation\nby engineers and all technical personnel, by producer-direc¬\ntors, and by TV teachers—both studio teachers AND class¬\nroom teachers—can be vigorously promoted.”\nNAEB Board Members Elected\nFollowing are the names of those elected to the NAEB Board\nof Directors for terms beginning January 1, 1965.\nIndividual Member Division. Region I: Albert P. Fredette,\nmanager, WAMC. Region IV: Wilbur D. Donaldson, assist¬\nant general manager, KTCA.\nInstructional Division. Region III: Charles McIntyre, director\nof instructional resources, University of Illinois. Region VI:\nGeorge E. Steiner, coordinator, ETV, San Francisco State\nCollege.\nRadio Division. Region II: Marjorie Newman, program direc¬\ntor, WFSU-FM. Region V: Jack M. Burke, manager, KSAC.\nTelevision Division. Run-off in progress as we go to press.\nThose in run-off (to be completed December 30) : Jack Mc¬\nBride, KUON-TV; Robert Schenkkan, KLRN-TV; Otto\nSchlaak, WMVT-TV; and Donald Taverner, WQED-TV.\nNAEBers Joining in Austin, Please Note\nMembership information has been lost for several persons who\njoined or renewed as NAEB Individual Members in Austin\non either October 25 or 26. These applications were among\nmaterials lost when a staff member’s suitcase was stolen.\nAnyone who joined or renewed at that time and who has\nnot yet received a new membership card should write to Mrs.\nDorothy Templeton at the NAEB Urbana office.\n250 Attend NAEB-ETS Meeting\nRepresentatives of 90 of the nation’s 99 ETV stations met in\nWashington December 7-8 to kick off a 7-month study of\nlong-range ETV financing. FCC Chairman E. William Henry\nand U. S. Commissioner of Education Francis Keppel ad¬\ndressed the group.\nBoth the conference and the study are being financed by\na USOE grant to the NAEB. Frederick Breitenfeld, who\njoined the NAEB staff in the fall, is directing the project.\nIn his address, Chairman Henry announced that the Inter¬\nnational Radio and Television Society has established a spe¬\ncial committee, chaired by John Cunningham, of Cunningham\nments can be met. He read a letter in which Mr. Cunningham\nhoped for the early achievement of sufficient ETV funds for\ngreater substance and interest, a continuous campaign on com¬\nmercial TV urging people to contribute to ETV, and a cam¬\npaign urging people to use ETV to improve themselves, cul¬\nturally and economically. Some NAEBers may remember a\nspeech delivered by Mr. Cunningham at the IERT in 1959\n(printed in the November 1959 NAEB Journal) in which he\noutlined some of advertising’s responsibilities to ETV.\nScriptwriters Wanted\n• Playwrights submitting one-hour TV dramas or comedies\nto WQED before March 1, 1965, may win $1,000 per script.\nWQED and the Aluminum Company of America are spon¬\nsoring the contest in an effort to improve the quality of script\nwriting in TV.\nThere is no definite limit to the number of possible win¬\nners. The author of each script accepted for production will\nreceive $1,000. Judging will be based upon originality of\ntheme, quality of writing, and adaptability to the TV medium.\n1"
}