{
  "id": "d1259-0",
  "text": "April, 195^\nPresidents Page\n- I ? i l\nLast .month.th i s page was written while on tour, in Columbus,\nOhio*..This timI, I!m home* But That’s misleading. I*ve been hop¬\nping, AND’ I HAVE SOME MORE HOfS TO MAKE. HOPE BUSINESS SLACKENS\nafter Keith Tylerf s IInstituTe in Columbus. i 5 i ./ ‘ '\nI 1M NOT BRAGGING ABOUT RUNisij'NG AROUND. tilFE WOULD BE EASIER IF\nI COULD BE HOME MORE, ‘BUT THERE SEEMS TO BE LOTS AND LOTS OF WORK TO\nBE QONE ON BEHALF OF NAEB, AND\"AS YOUR PRESIDENT, I TRY TO SERVE YOU\nTO THE BEST OF MY ABILITIES.\nv-j ' -L • ' / _ \\‘ 1 ■'\nDuring March, I found myself in a number of spots.' There Was\ntrip to New York to check on possibilities of securing funds from'the\nFord Foundation. There was a trip to the CENtER At Ann Arbor‘to dis¬\ncuss business with the Center president and many members of the ETRCt\nstaff. There was a tripto Washington for meeting of JCET, and for\nA DINNER WltH THE FCC AS GUESTS OF THE CeNtIR. ANOTHER FLYER ( L ITER-\nally) to Chicago to check further on a possible request T9 the Foro\nF OUNDATION.\nO. . \\\nApril activities of your president will include meeting with the\nNAEBe'rS IN ATLANTA TO START REAL PLANNING AND WORK * ON THE ^^CONVEN¬\nTION. That*ll be April 1 and 2. April 13-15, I*Cl be attending Music\nEducators National Conference in St. Louis. Your president is. a mem*\nBER OF THE GOLDEN ANNlVERSARY COMMISSION OF THE MENC.' On MONDAY MORN-\nINGV'THE PREXY WILL ADDRESS THE FM SESSION AT THE NARTB NATIONAL.CONVE\ntion in Chicago. Later that day, he!ll attend meeting and luncheon of\nthe Association for Professional Broadcasting Education in Chicago.\nStill later, he!ll be meeting with the NAEB Board of Directors in\nColumbus•\nThe Board is scheduled to meet Monday night, Tuesday morning and\nAFTERNOON. EVERY OFFICER AND EVERY NAEB COMMITTEE CHAIRMAN HAS BEEN\nasked to forward items of business for Board consideration. So, you\nCAN GUESS THERE WILL BE LOTS OF ITEMS.\nFor example, the Board will be asked to give formal approval to\nTHE 8&B PLAN FOR NETWORK OPERATIONS. On THE REGULAR NETWORK PROGRAM¬\nMING SIDE, THIS WILL PROBABLY MEAN ABOUT 60% BASIC, AND 20% BONUS.\nHandling of the problem on the School programs will call for a differ¬\nent FORMULA, BUT l*M SURE THE B&B OUGHT TO IMPROVE SERVICE FOR ALL.\nDetails later.\nWe * R E NOT OVERLOOKING QUALITY PROGRAMMING FOR RADIO THESE DAYS\neither. Based upon Ken Wr|ght!s Programming Planning committee work,\nNAEB HAS NOW FORWARDED TO THE CENTER A RECOMMENDATION THAT A CONSIDER¬\nABLE AMOUNT OF MONEY AND EFFORT BE PUT INTO A SPECIAL SERIES FOR THE\nNetwork. You»ll get more on this as our efforts and plans develop*\nJohn Henderson of Purdue was over the other day, and your presi¬\ndent agreed to meeting with the School committee while in Columbus.\nAS FAR AS THE MIND AND BODY WILL GO, 1!M AT YOUR SERVICE, EVEN IF I\nAM SERVING AS CHAIRMAN OF ONE OF KEITH * S WORKSHOPS, TOO•"
}