{
  "id": "d1259-2",
  "text": "(MIL). The present manager, L. Clinton West, is joining a\ngroup of 32 Wisconsin educators for two years of work in\nNorthern Nigeria.\n^ Donald V. Taverner, WQED-WQEX, has been elected\npresident of the Eastern Educational Network. He succeeds\nHartford Gunn, WGBH, who has become EEN chairman, a\nnewly created post.\n^ The University of Texas Committee on Arts and Letters\nhas chosen Robert W. Sarnoff, chairman of the board and\nchief executive officer of the National Broadcasting Com¬\npany, as winner of the committee’s 1964 Award for Distin¬\nguished Service in the field of communication.\n^ Seymour Siegel’s years of work at New York City’s\nWNYC were described in the August 30, 1964, New York\nHerald Tribune.\n^ Bert Neely, WCET-TV, spoke on “The New Age in Edu¬\ncation” at the Sisters of Notre Dame de Namur’s Communica¬\ntion Arts Day last month in Cincinnati.\n^ Alan R. Stephenson has become director of educational\nservices for Cleveland’s new ETV station, WVIZ. He leaves\nthe 21 Inch Classroom, Boston’s school television association,\nwhere he was director. His wife, Marg, who was staff asso¬\nciate for the Northeastern Instructional Television Library,\nhas become WVIZ’s office manager. Miss Louise Greep, as¬\nsistant director of the 21 Indh Classroom, has been appointed\nacting director.\nSTATE AND REGIONAL\n^ In dedicating the Alabama ETV network’s fifth station\n(WEIQ, Mobile) in November, the governor announced the\naim of his administration to double the size of the network in\nthe two remaining years of his term. On the occasion, Gover¬\nnor Wallace also presented Raymond Hurlbert with a cer¬\ntificate of recognition for his 10 years of work in developing\nthe state network.\n^ December 15 was the scheduled date for the start of regu¬\nlar broadcasting service to northeastern Wisconsin from the\nnew educational FM station at Marinette. Kicking off the\nevent was a special broadcast salute and luncheon for school\nadministrators, community leaders, public officials, and radio-\nTV representatives of the area—planned by WMAM Station\nManager Howard Emich.\n^ In accepting a West Virginia University petition for a new\nVHF ETV channel, the FCC also reserved the channel for\nnoncommercial purposes. When activated, it will potentially\nserve 11 southeastern West Virginia counties.\nINTERNATIONAL\n^ A South American priest, a pioneer in the use of radio for\nteaching reading and writing to illiterate peasants, recently\nvisited Boston University to explain his techniques to students\nof--broadcasting. Monsignor Jose-juaqirirr Salcedo ofTBogota,\nColombia, described the home radio method of inexpensively\nreaching a large “student body.” The voice of one professor\nis broadcast all over the country and is picked up on Japan¬\nese-manufactured radio receivers placed in peasant homes. The\nradio broadcast instructs an auxiliary teacher and her class at\nthe same time, providing different levels of material over\nfour channels. Radio teaching is supplemented by “El Cam-\npesino,” a newspaper designed for a semi-literate population.\nThe project has drawn inquiries from 43 countries.\n^ Glasgow, Scotland, plans an ETV network similar to that\nof South Carolina. Glasgow’s CCTV network will serve 180,-\n000 students on all grade levels in 392 schools.\nINSTRUCTION AND TRAINING\n^ On-duty firemen in San Bernardino County (Calif.) are\npicking up firefighting tips on the San Bernardino Valley Col¬\nlege station, KVCR-TV. The series of 15 programs features\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN.W., Washington, D.C., 20036. Phone 667-6000. Area Code 202.\na captain from the Los Angeles County Fire Department, and\nis produced in cooperation with the California Fire Chiefs\nAssociation.\n^ More than 4,000 University of Illinois students are re¬\nceiving a part of their instruction through TV this semester—\nin a variety of subject areas, such as mechanics, psychology,\nsociology, economics, education, physical education, and others.\nFILMS\n^ “Focus on a Century of Communications” is a new 271/a-\nminute 16 mm color film on the past hundred years of history\nand communications, covering the period from Lincoln’s Get¬\ntysburg Address to a modern rocket launch. The film points\nup the direct relationship of man’s progress to his increased\nability to preserve and communicate thoughts and ideas to\nothers. The film is being distributed on a free-loan basis to\nschools, clubs, and other groups as well as TV stations. Write\nto P. H. Glatfelter Co. Film Library, Creativision Incorpor¬\nated, 1780 Broadway, New York, New York 10019.\n^ A new film outlining contemporary work in the field of\nabsorption spectroscopy and produced especially for high school\nand university level physics, chemistry, and general science\nclasses has been released- Gilbert Aberg wrote and directed\nthe 20-minute film, produced with a team of specialists from\nPenn State University. The film is available to ETV with\nwritten permission. For information on “Dark Lines to the\nPlanets,” write to Cenco Educational Pllms, 1800 W. Foster\nAvenue, Chicago, Illinois 60640.\nCORRECTION RE FILMS AVAILABLE\n“We Could Keep the Wheels Turning,” a Canadian film, is\nnot available free as announced in the December Newsletter.\nThe program, which deals with the subject of automation, is\navailable to TV stations, but there is a cost involved. Direct\nquestions to A. H. Partridge, International Exchange Officer,\nCBC, 354 Jarvis St., Toronto.\nPROGRAMS\n^ Journeys Into the Past is a new series being produced by\nthe Central Michigan ETV Council. William J. Grigaliunas,\nproducer-director for the Council, directs the series, which\nexplores ancient Egypt and the Holy Land, and examines the\nrecently found Dead Sea Scrolls.\n^ The drama surrounding Hollywood movie-making in a\nsmall Texas town provided the basis for an award-winning\ndocumentary, “A Shooting in Town,” produced by a commit¬\ntee of the local chapter of the University of Houston’s radio-\nTV fraternity, Alpha Epsilon Rho. The film won first place\nin an AER national contest as the best TV production by stu¬\ndent members, and it is being distributed world-wide by the\nUSIA.\n^ Listeners to the_University--of Wisconsin's -WHAwvere\nrecently treated to a two-hour guided tour of the campus,\nalong with a group of editors attending a newspaper confer¬\nence. As the editors moved around the campus by bus, they\nlistened to the program on transistor radios, thus hearing the\ncommentary as they viewed the points of interest. The pro¬\ngram consisted of seven live pick-ups from various points on\ncampus, integrated with recorded inserts.\n^ KQED, San Francisco, last month presented the entire\nBeethoven Sonata Cycle for piano and violin in a series of\nfour hour-long concerts by Maro and Anahid Ajemian.\n► WTTW, Chicago, has been awarded $145,000 by HEW\nto develop a TV series to call attention to and stimulate com¬\nmunity action for the restoration of alcoholics to a useful\nlife. WTTW and the Illinois mental health department re¬\nceived a grant last May to produce a pilot program, “Tuesdays\nat 3,” illustrating the psychotherapeutic approach to the prob¬\nlems of an alcoholic.\n^ KOET, a local newspaper, and a commercial radio station\ncombined efforts last November to quickly communicate in¬\ncoming election results to the Ogden, Utah, area. KOET\ntelecasted the results gathered, assembled, and tabulated at\nthe newspaper offices. For verbal coverage, viewers tuned in\nJANUARY 1965\n3"
}