{
  "id": "d1259-3",
  "text": "the radio station. This was the first time northern Utah resi¬\ndents have received on-the-spot local election coverage over\nTV.\n^ WEDU, St. Petersburg, is broadcasting live its second\nseason of St. Petersburg J.C. home basketball games. The\ncollege is presenting a variety of half-time shows.\n^ “On the Outside Looking In” is a full-length review by\nteen-age boys from neighborhood gangs and aired on KQED,\nSan Francisco. The review consisted of spontaneous skits and\ndances satirizing situations and people within and outside the\nboys’ own experiences. A year and a half ago, when three\nteen-age boys approached Gloria Unti, dance director at Tele¬\ngraph Hill Neighborhood Center, asking for Karate lessons\nso they could fight better, she taught them yoga. This gave\nway to modern dance and the fighting to satire.\nGENERAL\nk Two more organizations have joined the Educational Media\nCouncil—the National Society for Programmed Instruction\nand the Society of Motion Picture and Television Engineers.\nThis brings EMC membership to a total of 14 national non¬\nprofit organizations, of which the NAEB is one.\nL The 97th semiannual conference and exhibit of the Society\nof Motion Picture and Television Engineers is set for March\n28 to April 2, 1965, at the Ambassador Hotel, Los Angeles.\nK KWSC Radio, Washington State University, Pullman, be¬\ngan its 44th year of regular broadcasting on December 10.\n^ WQED, Pittsburgh, has increased its power to the maxi¬\nmum 316,000 watts.\nW The new Nebraska ETV Network was dedicated on\nKUON-TV’s tenth anniversary, December 13. Nebraska’s\nGovernor Frank B. Morrison proclaimed the week of Decem¬\nber 13 through 19 Educational Television Week,\nk Baltimore is installing top-secret electronic burglar alarms\nthroughout the city school system, following tests in selected\nschools during the past two years. The alarm operates by\nPLACEMENT\nPOSITIONS AVAILABLE\n(For information, write Miss Bonnie Decker, Placement Sarvice,\nat the NAEB office in Washington. In order to be considered\nthrough these channels, the reader must be an Individual Mem¬\nber of the NAEB, with credentials on file with the NAEB\nPlacement Service. Non-members can save time by sending\nthe $10 annual dues and $5 Placement registration fee at the\ntime of inquiry.)\nJ-l New staff member needed within 12 to 18 months for\none of nation's largest providers of direct college-level\ninstruction by TV. PhD in communications (radio-TV)\npreferred, with strong academic background and re¬\nsearch orientation. Exciting prospect for man interested\nin exploring new dimensions in education. Duties include\nproducing college series, devising and evaluating special\nprojects and experimental designs. No teaching. Start¬\ning salary for 12-month year $9,000 to $10,000, depend¬\ning on experience.\nJ-2 Cameraman with at least 3 years experience for ETV\nstation in Washington, D.C. Must have experience in\nlighting, mike boom operation, and set erection. Open\nimmediately.\nJ-3 Chief engineer for a Rocky Mountain university with pro¬\nfessional CCTV equipment, microwave links to other\ncampuses, imminent activation of an ETV station, and\nplans for a state-wide ETV system. Position entails super¬\nvising all technical TV operations; administering techni¬\ncal crew of three full-time professional engineers and 5\nto 9 students; training students; maintaining equipment;\nand recommending purchase of equipment. BS in elec¬\ntronics or engineering, First Class Radio-Telephone oper¬\nator's license, minimum of 3 years experience as radio-\nTV engineer desired. Salary range $8,000 to $9,000.\ndialing the police and telling them through a voice recording\nthe location of the school and the place of entry. Called an\nelectronic watchman, it can also warn of fires, floods, tem¬\nperature changes, and power failures.\nI Contained in the 1964 annual report of the Sigma Delta\nChi Freedom of Information Committee are the charges that\ninformation policies of the Defense Department continue to be\ntroublesome and that committees of Congress conduct too\nmuch business in secret sessions and bar photographers and\nbroadcasters from many meetings to which newspaper re¬\nporters are admitted. The report supported a bill by Sen. Ed¬\nward Long of Missouri which would require federal agencies\nto open up more of their records to public inspection.\n^ Dickinson College has instituted a new teacher-training pro¬\ngram called the “Education Semester,” in which the student\nspends only one semester in methodology and practice-teach¬\ning—usually in the senior year—and years in academic\nstudy.\n^ The 1965 ACEI Study Conference, “The Child, His World\nand His Potential,” to be in New York, April 18-23, will fea¬\nture tour-discussion visits to community organizations anP\neducational and cultural centers in the New York area.\n^ The fourth International Broadcast Seminar, attended by\nnineteen broadcasters from 16 foreign countries, ended in mid-\nDecember. Administered by Syracuse University and spon¬\nsored by the U. S. State Department, the three-month study\nincluded a month tour of major TV and radio stations through¬\nout the U. S.\n^ The South Carolina ETV Network is applying to the FCC\nfor permission to construct a TV station in Columbia to pro¬\nvide reception to a number of schools in the area, as well as\nmake the network’s approximately 12 hours per day program¬\ning available to the public.\n^ KQED, San Francisco, has gone over its fund drive goal\nthis year with contributions totaling $305,000, in addition to\n$137,000 raised by its annual auction. KQED dues-paying mem¬\nbership has reached 16,500.\nJ-4 Producer-director for VHF station operated by large\nSouthwestern university, twin major markets. Experience:\nITV necessary; minimum I year actual directing in ETV\nstation; public affairs and MA degree desirable. Salary\nopen.\nJ-5 Instructional coordinator for large VHF station serving\nsome 50 school systems and 250,000 pupils in metro¬\npolitan area on large university campus. Must be able\nto relate to elementary and secondary school people and\nunderstand ITV production on a high-quality level. Ad¬\nministrative and public relations responsibilities. Salary\nopen.\nJ-6 Two immediate openings in large Midwestern broadcast¬\ning commission for experienced broadcasters.\nJ-7 Part-time writer-producer for new TV series based on\nJewish history, and a host for this series. Writer-pro¬\nducer must have previous experience in writing docu¬\nmentaries for TV or film. Host must show evidence of\nprevious experience in TV and/or professional theater.\nWill consider a combination of the two posts. Salaries\nopen.\nCCTV PERSON NEEDED FOR YEAR IN GLASGOW\nThe University of Strathclyde, Glasgow, Scotland, needs\nsomeone to spend a year there developing a permanent Scot¬\ntish staff for the university’s CCTV operation. The position\nwill be open on or before June 1, 1965.\nThere is considerable faculty interest generally, and\nmathematics instruction is ready to be put into production. The\nuniversity has just completed a studio, purchased originating\nequipment, and wired several classrooms—a very fine installa¬\ntion valued at $120,000.\nTime is important; so anyone interested should write via\nair mail to: C. C. Bartlett, Esq., Lecturer, Department of\nMathematics, University of Strathclyde, Glasgow, Scotland.\ni\nNEWSLETTER"
}