{
  "id": "d1793-14",
  "text": "FCC ACTIONS\nJuly 3. 1962\nAlabama Educational Television Commission (Mobile, Alabama) - Waived Section 3*685 of\nthe rules and granted CP for a new noncommercial educational TV station to operate on\nChannel #42; ERP 17*8 lew visual and 8.9 kw aural; antenna height 600 ft.; condition\n(BPET-II3). It proposed to interconnect the Mobile station by microwave with stationsx5«£B£^\nWBIQ, WCIQ and WDIQ.\nBy Notice of Further Proposed Rule Making in Docket 14364 concerning assignment of a\nlower UHF TV channel in Erie, Ba., comments are invited to a Commission proposal which\nwould change Erie’s UHF assignments from Channels 35, #4l (educational) and 66 to\nChannels 20, 26, 43 and #52 (educational); Channel 39 would be substituted for Channel\n64 in Oil City; Channel 39 deleted from Sharon and Channel 43 from Butler; offset\ncarrier on Channel 26 in Williamsport would be changed from plus to even; and Channel\n37 deleted from Clymer, N.Y., and Channel 58 from Jamestown, N.l.\nJuly 5, 1962\nThe Commission invites comments by August 13 to Notice of Proposed Rule Making looking\ntoward assigning Channel 10 to Midland, Texas, as petitioned for by Midland telecasting\nCo., permittee of station KDCD-TV on Channel 18 in Midland, and reserving latter channel\nfor noncommercial educational use.\nMARKS TO HEAD STUDY\nLeonard Nferks, of Cohn & Marks, long-time general counsel for the NAEB, has\nbeen named head of a high-level committee of the Federal Communications Bar Assn, to\nstudy need for a new communications law. The committee will consider whether new\nlegislation is needed or whether the 1934 law should be amended.\nCOMMISSION JOB STILL OPEN\nSpeculation is rife as to implications of President Kennedy’s delay in naming\na successor to FCC Commissioner John Cross, following expiration of his term June 30.\nSome feel Cross, strongly backed by powerful fellow Arkansan Oren Harris, Chairman\nof the House Commerce Committee, will yet be reappointed; others are certain post\nwill go to Ken Cox, Chief of Broadcast Bureau, backed by powerful fellow Washingtonian\nMagnuson. Chairman of the Senate Commerce Committee. Resulting stalemate might result\nin a dark horse appointment."
}