{
  "id": "d1793-8",
  "text": "NAEB mUSEK FILES AGAINST LICENSING FEES\nThe NAEB filed comments with the FCC opposing license fees for\n\"non-commercial educational services conducted by tax exempt organizations•'\nThe comments 9 based on a decision^ojf the NAEB Board of Directors at its\nmeeting in Columbus, May 29 ^a^^^~-J!Bo41i~~pubLi-a-~pe-licy and—pr ucttcari'\neons i dera t innsr e autrethat.the -Commission's- services’ for non- commercia 1\neonsidera-t tons' Yequire.tkat—the Commissi on 's ser vicgs^ar^ non-. wwrrgrcta\naLsj^rnbedam that such exemption should be accorded a 11 non-commercial\neducational stations operated by tax exempt or ganizat ions whether th&m or not/\nstation is operated on a reserved channel.\nth\nALL-CHANNEL RECEIVER LEGISLATION\nThe Senate Interstate and Foreign Commerce committee approved (14-2)\nHR-8031, providing for the inclusion of both UHF and VHF in all television\nreceivers manufactured or sold interstate trade• The bill9 previously\napproved by the House9 will soon be considered by the Senate where the\nchances of''passage appear moderately good, although many Senators have\nexpressed reluctance to approve legislation which will require their\nconstituent s to pap more for a set vjhen there is little or no UHF service\nin their areas. ^t has been pointed out to these Senators that\ngrowth and expansion of ETV are largely dependent upon UHF9 and this\nlegislation is needed to insure^UHF uti lizat ion^^.A 3*\nHARLEY NAMED TO JOINT NAB-JCEB COMMITTEE\nNAEB President William Harley has been named lay to a joint com¬\nmittee \"to promote cooperation between educational and commercial broad¬\ncasting.\" Five commercial broadcasters v)ere named by NAB President LeRoy\nCollins9 and JCEB Chairman Robert C. Anderson designated the five mem¬\nbers to r epresen t ed,uca t i ona 1 br oadca sting. »jr? .4t^—Ha;Tleg9 these\ncry terry-\"\nare~r~ „ _ _\nand'U. of Ne™K rrn» rf-r» - The committee held\nits first meeting in Washington June 4.*^—JL\n3\"^ A tjl tt i 14 J nr*\n0\nVJ /"
}