{
  "id": "d1156-2",
  "text": "NAEB NEV.S LETTER\nPage 3\nTHE PROGRAMS ARE KNOWN AS “THE DEMOCRACIES WILL WIN” (THURSDAYS), AND\n“The Role of Science in War11 (Saturdays)*\nSpeaker on the first program of the series was Or* Harry n. Wright,\nNEWLY-APPOINTED HEAD OF THE COLLEGE. The TOPIC Of HIS FIRST TALK WAS\n“The Meaning of Total War\". The Saturday morning program was inaugurated\nby Professor Richard B. Mop.ris of the Department of History and head of\nthe Civilian Defense Council recently bet up at the College to coor¬\ndinate Defense Work.\nLater talks in the series will feature other prominent members of the\nCity College faculty, including Professor Walter R. Sharp and Pro¬\nfessor Benjamin Harrow.\nMiCHI CAN 1S DEFENSE PROGRAM\nThe University of Michigan, through station WJR, is in the. midst of\npresenting a series of weekly broadcasts on the general subject “United\nfor Defense”. One program which has already appeared on the air may\ninterest educational radio people; it is a talk by Leo Fitzpatrick,\nvice-president of Station WJR, on the subject of “Radio and Defense.“\nCopies of this program may be obtained by writing station WJR, Detroit,\nMichigan. For the complete schedule, it is suggested that you write\nthe University of Michigan Broadcasting Service, Ann Arbor, Michigan.\n€OLL€G£ STATION COURSES\nA LETTER TO THE RADIO BRANCH OF THE WAR DEPARTMENT’S BUREAU OF PUBLIC\nRelations from KWSC is quoted sn full: “The State College of 'Washing¬\nton WILL OFFER A NON—CRED J T COURSE IN CODE AND ELEMENTARY PRINCIPLES\nOF RADIO COMMUNICATION* THE CLASS WILL MEET FOR THREE OR FOUR HOURS\nWEEKLY DURING THE EVENINGS. BOTH BOYS AND GIRLS HAVE BEEN ENCOURAGED\nTO ENROLL.\nIT IS EXPECTED THAT MANY OF THE STUDENTS ENROLLED WILL BECOME SUFFI¬\nCIENTLY INTERESTED TO CONTINUE THEIR STUDIES UNTIL THEY CAN QUALIFY\nAS LICENSEO OPERATORS. THE TRAINING RECEIVED IN THE COURSE WILljpRE-\nPARE MEN STUOENTS FOR CERTAIN COMMUNICATION DUTIES IN THE &RMED\nSERVICES.\nTHE KWSC TRANSMITTER AND FACILITIES WILL BE USED ONLY FOR OCCASIONAL\nDEMONSTRATIONS. A FEW MEMBERS OF THE KWSC STAFF WILL ASSIST IN THE\nADMINISTRATION OF THE COURSE.“\nSays Ed Kirby: “There is a very real need of personnel trained for\nCOMMUNITY DUCIES IN THE ARMED FORCES, AND THERE IS NO QUESTION BUT\nTHAT the college stations offer a remarkable opportunity for coor¬\ndinating TRAINING OF THE TYPE DESIRED. FOR FURTHER INFORMATION ON\nTHIS, YOU MIGHT WRITE TO THE NATIONAL ASSOCIATION OF BROADCASTERS SINCE\nTHAT ORGANIZATION IS KEEPING IN TOUCH WITH METHOOS AND TECHNIQUES OF\nORGANIZING THESE COURSES.**"
}