{
  "id": "d1856-0",
  "text": "N A. £8. NEWS LETTER.\nOffice of Executive Secretary\nUniversity of Illinois\nUrbana, Illinois\nMarch 1, 1938\nTHIS COPYRIGHT SITUATION\nIn this issue of the News Letter will be found two articles which\nshould be of interest to every NAEB member. H. B. McCartv of WHA has\nsecured an opinion from the Wisconsin Attorney G-eneral regarding the\nuse of phonograph records. Read it, then let us know what legal ad¬\nvice you have secured. Have you secured one, or will you secure one,\nthat we can pass along to other NAEB members?\nThe other article on the copyright question relates to reading of\nnovels over educational stations. This is the first of a series of.\nsuch articles which Dr. Fredrick 8. Siebert of the University of Illi-\nnoise School of Journalism will contribute to the News Letter. Sieberi\nhas studied in the United States and in England and is a recognized au¬\nthority on law of the press. Those who attended the NAEB convention\nlast September will be glad to see some of his opinions in print, so\nsave your News Letters for your future reference.\nOPINION ON USE OF PHONOGRAPH R^CORDo\nAfter receiving from RCA-Victor Mfg. Company a letter restricting\nthe use of phonograph records on the air, WHA asked the Wisconsin At¬\ntorney Ueneral for an opinion on the matter. Here are excerpts from\nthe official report:\nFebruary 84, 1938\nAttention: H. B. McCarty, Program Director, WHA\nDear Sir:\nYou have inquired as to the rights of phonograph record manufac¬\nturers, recording artists, and copyright owners in phonograph records\nused for broadcasting after such records have been sold and are on the\nmarket.\nThis question arises by virtue of a notice printed on each record\nwhich reads: nnot licensed for Radio Broadcast .?i\nThe common law rule is that the manufacturer of an article cannot\nimpose restrictions on its use in the hands of a purchaser.\nWe are therefore of the opinion that the phonograph record manu¬\nfacturer has no interest in its phonograph records which will enable\nit by the device of restricted use notice to control its use in the\nhands of the ultimate purchasers* +*•;■**"
}