{
  "id": "d1856-3",
  "text": "4.\nAmerican countries and granted W1XAL the frequencies of 11,730 and\n15,130 with 20,000 watts power* These frequencies, along with two\nothers assigned General Electric by the Commission-, are to^ be used in\nthe interests of Inter-American affairs, in accordance with an agree¬\nment made at the Montevideo Pan American Conference in 1933. But let\nLoring Andrews tell the s,tory. He says,\nMFor some few years the Government had been in possession of four\nshort wave frequencies which it had been reserving for projected use\nby a government operated station. Such a use had not come to pass so\nit was decided to assign them to other broadcasting institutions for\ntheir use. They have been known as Pan-American frequencies. Two of\nthem, 15.13 megacycles (19.8m.) and 11.73 megacycles (25.6m.) were as¬\nsigned to the World Wide Broadcasting Corporation which operates the\ntransmitter through which our programs are broadcast. These two fre¬\nquencies we're going to use for transmitting special programs in Span¬\nish, Portuguese and French to South and Central America and the out¬\nlying islands. Later they may also be used to relay some of our regu¬\nlar broadcasts in English in the same direction. The use of these\nfrequencies for Pan-American transmissions is in a rather close way a\ncontinuation of President Roosevelt’s good neighbor policy, so well\nset forth at the conference in South America a. year and a half ago.\nSo far as we are concerned the use of these frequencies means only an\nextension of our Pan-American service, since we have regularly on\nFriday evenings since last November been broadcasting special programs\nto Latin-America in cooperation with the Pan-American Union, and since\nJanuary 1 on Monday evenings as well.\"\nThe present operating schedule of W1XAL is:\nFreq.\n15.25 Me.\n15.13 Me.\n11.79 Me.\n6.04 Me.\n11.73 Me.\nMondays thru Fridays\n1:30 to 3:00 pm. E#S.T.\n3:15 to 3:45 pm. E.S.T.\n4:45 to 6:30 pm. E.S.T.\n7:00 to 8:45 pm. E.S.T.\n9:00 to 10:00 pm. E.S.T.\nSaturdays Sundays\n11:00-12 M.\n6:-00-6:»30 pm. 1:00-6:30 pm.\n8:00-9:00 pm.\nPICKUPS, February, 1938, published by Western Electric, quotes\nHarold Hough, general manager of WBAP, Fort Worth, as saying radio\nstations need more personality.\nIf there is anything wrong with radio today, according to Hough,\nit is the lack of individuality in programs and stations.\nMfWe are too imitative today1, he says, ’The people we like.best\nare those who have distinct individual personalities. Radio stations\nshould have personalities, too, and be different from other stations.\nNo two areas are the same. People in any one are© have a distinct\ngroup personality. They have their own customs and traditions. The\nradio stations that serve them should reflect this personality.\n\"'Instead of this, stations are too apt to copy others. We. have\nvogues which sweep broadcasting. Once it was sopranos, and we had.\nsopranos until listeners were sick of them. Then we had hill billies,\nnext amateurs, and now we have Hollywood!\n\"There is much material and talent right at home if stations woul\njust go to the trouble to develop it, Hough thinks. ’Why, we have kid"
}