{
  "id": "d1856-4",
  "text": "5*\nright here in our Port Worth High Schools and colleges who can do more\nthan many of the people in Hollywood. You should hear the talent on\nour school program every Saturday morning.’\njfwpAP is particularly proud of this WBAP-City High School half -.\nhour feature and so are its listeners, The series.has been on the air\nevery Saturday morning at 9:30 for about 20 weeks, now and^ is fast be¬\ncoming one of the station’s most popular programs. The show is broad¬\ncast from the auditorium of the William P. McLean Junior High School,\nand a different school puts on the program each week/ The students\nhandle everything, selecting their own personnel and performers. A\nCollegiate program, similar in nature, and composed of college students\nis likewise broadcast each Saturday, just prior to the high school ser¬\nies, It, too, is proving extremely popular*51\nTwo members of NAEB find themselves recipients of publicity in\nthe current issue of PICKUPS--Garland Powell, WRUF, Gainesville, Flor¬\nida, and Luke Roberts, KOAC, Corvallis, Oregon, but read for yourself:\n5iA program similar in its state-wide appeal is the Florida Inphgs-\ntrial and Agricultural Series presented by WRUF (Gainesville, Florida).\n’The idea came to me,’ explains Garland Powell, Director, ’after tra¬\nveling around Florida and finding to my surprise that Florida people\nknow very little about the diversified industries and agricultural ad¬\nvantages of their state. ’ The series started with the Wilson Cypress\nCompany, largest tide-water cypress company in the world. By remote\ncontrol the station gave an eye description of lumber floating down ^\nthe river, being picked up at the mill, passing through the mill and\nloaded on cars. Another broadcast came from the Hav-A-Tampa Cigar\nCompany and followed the manufacturing process from bales to boxes* ^\n’Response has been tremendous,' Powell says, 'Public schools and li¬\nbraries in the state want WRUF to transcribe the programs into a sort\nof textbook for the use of students and the general public.’\n\"Florida Farm Hour and Florida Facts are other WRUF outstanding^\nhits. The former, composed of daily talks, music and dramatic sketches\nis broadcast in cooperation with the College of Agriculture and the\nAgricultural Extension Division. On the air for the past eight years,\nthe program, Powell claims, has saved millions of dollars for Florida\nfarmers and growers. Florida Facts is a daily broadcast to inform\nnatives as well as tourists of what is going on in the State.\n\"Utilizing a wealth of little known stories concerning forest\nservice adventures in the Pacific Northwest, KOAC (Corvallis,.Oregon)\nin 1936 inaugurated a weekly series known as Foresters.in Action. The\nfirst few programs consisted of straight talks, describing the Fernhop-\npers. Members of the Oregon State . College forestry club, who were\nfurnishing story material for the features, soon became interested in\nactive participation in the program. Style of presentation was changec\nto include a cast of characters to relate true stories through dia¬\nlogue and dramatized flashbacks. While most of the tales have defin¬\nitely constructive themes, they are occasionally interspersed with\namusing \"whoppers\"’ of the Paul Bunyan type. KOAC finds that this\nmethod of presenting educational material on forest conservation has\na distinct advantage over the conventional radio lecture.“"
}