{
  "id": "d1869-1",
  "text": "VI, no ballots will be distributed, as in each case\nthere is only one nominee, who will be automatically\nelected. They are: Region II. Raymond D. Hurlbert,\ngeneral manager, Alabama ETV Commission; Re¬\ngion IV, John C. Schwarzwalder, general manager,\nKTCA-TV, Minneapolis-St. Paul; Region VI, Loren\nB. Stone, manager, KCTS-TV, Seattle. (Keith En-\ngar, KUED, withdrew.)\nFollowing is a list of nominees, all of whom have\naccepted, except as noted.\nNOMINEES\n• Region I, Radio Director: Albert P. Fredette, sta¬\ntion manager, WAMC, Albany Medical College;\nRuane B. Hill, general manager, WAER, Syracuse\nUniversity; and Harold E. Nelson, general manager,\nWDFM, Penn State University.\n• Region III, Radio Director: E. G. Burrows, as¬\nsistant director of broadcasting, WUOM, University\nof Michigan; Lawrence Frymire, manager, WKAR,\nMichigan State University; Archie M. Greer, man¬\nager, WOUB, Ohio University; James S. Miles, di¬\nrector, WBAA radio-TV unit, Purdue University;\nand Buren C. Robbins, director, radio-TV (WSRV-\nEM), Southern Illinois University. (Withdrawals:\nLee Dreyfus, WDET; Arlene McKellar, WHA; and\nFrank Schooley, WILL.)\n• Region V, Radio Director: R. Edwin Browne, di¬\nrector, KFKU-KANU, University of Kansas, and\nRobert F. Schenkkan, director, radio-TV, University\nof Texas.\n• Region VI, Radio Director (one-year term only):\nCatherine Cory, manager, KPFK, Pacifica Founda¬\ntion, Los Angeles; Burt Harrison, manager, KWSC,\nWashington State University; and Ken Kager, oper¬\nations Manager, KUOW, University of Washington.\n(Withdrawals: George D. Goodrich, KHSC, and Pa¬\ntricia Green Swenson, KBPS.\n• Director-at-Large (representing Associate mem¬\nbers) : Neal Balanoff, chairman, TV, radio and film\ndepartment, Stephens College; Paul Borge, director\nof TV-radio, University of Omaha; Kenneth A.\nChristiansen, director of television, University\nof Florida; Martha Gable, director, radio-TV, Phil¬\nadelphia Public Schools; Bart Griffith, supervisor,\ninstructional TV, University of Missouri; E. A.\nHungerford, Jr., New York University; Colby Lewis,\nprofessor of TV, radio and film, Michigan State\nUniversity; Wanda Mitchell, TV department, Evan¬\nston Township High School; E. G. Sherburne, Jr.,\nstatewide coordinator of ETV, University of Cali¬\nfornia; and Arthur Weld, Jr., department of TV and\nradio, Michigan State University. (Thomas J. Brophy,\nNYU, withdrew.)\n• Individual Member Director: Gale R. Adkins,\nUniversity of Kansas; Graydon Ausmus, University\nof Alabama; Rudy Bretz, University of California;\nVernon Bronson, ETV consultant; Chris Donaldson,\nKTCA-TV; Lee Dreyfus, Wayne State University;\nFlorence B. Freedman, Hunter College; Herbert V.\nHake, Iowa State Teachers College; Halas L. Jackim,\nCorning (N. Y.) City School District; Vincent Jukes,\nOhio University; Bill Mavrides, University of Ak¬\nron ; Lewis V. Peterson, University of Illinois; Elmer\nF. Pflieger, Detroit Public Schools; Edward W.\nRosenheim, Jr., University of Chicago; Harry J.\nSkornia, University of Illinois; Edward Stasheff,\nUniversity of Michigan; and Gertrude E. Stein,\nSpringfield, Ohio.\n(Withdrawals: Gertrude Broderick, U. S. Office\nof Education; Kenneth Christiansen, University of\nFlorida; Edgar Dale, Ohio State University; Keith\nEngar, University of Utah; Marguerite Fleming, St.\nLouis Public Schools; Ken Harwood, University of\nSouthern California; and E. A. Hungerford, Jr., New\nYork University.)\nFCC\nThe commission is considering a request by the Mil¬\nwaukee Board of Vocational and Adult Education\nwhich would add UHF Channel 36 to the city s as¬\nsignment. The Board now operates WMVS-TV.\nThe FCC has refused to reconsider its order making\nFresno, California, an all-UHF city. (Channel 30\nwas substituted for Channel 12.) Reconsideration\nhad been asked by the city and county of Fresno, and\nthe County Unified School District.\nNews of Members\nGENERAL\ny Albany Medical College has begun its sixth season\nof the two-way radio medical conference network. A\nrecord number of thirty hospitals in four northeastern\nstates is taking part.\ny The University of Michigan and the public schools\nof Ann Arbor have established a TV-equipped dem¬\nonstration school to evaluate the use of airborne TV\nprograms. Edward Stasheff, professor of speech at\nthe university, is coordinating the project.\ny Noting its second birthday, WEDU, Tampa,\nclaims 2,500 public school classrooms receiving its\ntele-lessons, an increase of more than 200 per cent\nover the first year. The station also claims to be the\nonly ETV station presenting four foreign language\nprograms to its audience.\ny WGBH-FM, Boston, has been awarded the first\nannual Mass Media Citation of the World Affairs\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. $5.00 a year, edited by Betty McKenzie.\n2\nNEWSLETTER"
}