{
  "id": "d1869-2",
  "text": "NAEB NEWS LETTER... .IoAY 1, 1940.... Page 3\nINTERPRETATION STRICT ON F00 RULE SECTION 3,93\nOn February 29 the FCC amended section 3.93 of the standard broadcast\nrules, which pertains to announcements of mechanical records. While\nit is permissible to use transcribed, electrical transcription, etcog\nbut where a phonograph record is used Mit shall be announced as\n9a record.1 * Believing this ruling unreasonable for NAEB members\nyour executive secretary undertook to get an exception made. The\nreply from Secretary T0 J. Slowie of the FOC follows;\n19This will reply to your letter of March 28, 1940, expressing approval\nof the action taken by the Commission in recently amending section 3°93\n(e) of the Standard Broadcast Rules and requesting further consideration\nof the provision of this rule as to the use of the word record.\n\"You may rest assured that the effects of the provision now in force\nwith respect to the operation of non-commercial, educational, an\nmunicipal radio stations was given very eyeful , d\nShortly after the adoption of the amendment, the Commission received\nreauests for reconsideration of the \"reoord\" provision and after\ndeliberation, determined to adhere to the rule as amended 7\n29 1940. Your letter does not suggest any basis for modification ^\nof the requirements not already fully considered by t e omm\nDo you wish further attempts made? v/hft action do you su est?\nREBROADCA3TINO OF NON-PROFIT INTERNATIONAL PRQORAIA3 AUTHORIZED\nThe Feoeral Communications Commission on April 13\nand regulations to permit standard and non-comi. ' comrercial\nbroadcast stations to pick up and rebroadcast the non-com-ercial\nprograms of international broadcast stations. ^ ^a^s^cifie\nhowever, that such rebroadcasting snail on a\nBriefly, this means that any gt^y°nu^na^uthorityeof 1the\np?oSrOTeof°^nyhintlrnatlonal broadcast station, whether it is locatec.\nwithin or outside of the United States.\nThis action was taken on thet?^lsv^greepog3ible^i^mestic listeners\nehould'enjoy tit benef«s°of noncommercial international broadcasts.\nThe Commission, upon 00\"^df,?renueating1 amendment of\nDocket No. 5450, and as a result of study\nmade \"of” the general problems involved and after °f\nrecord made during the hearing in this natter, and. £he the\nthe Committee of the Commission submitted on April i »\nfollowing changes in Parts 3 and 4 of its Rules and Regulations,\neffective April 20a"
}