{
  "id": "d1869-3",
  "text": "► The Alabama ETV network is telecasting a series\nof thirty-five programs on life in Alabama during\nthe Civil War.\n► WEDU, Tampa, says its new program, “House\nParty,” is “unlike anything yet presented to our\nviewing audience.” A full staff of home economists\nwill take the viewer around the home, pointing out\nthe newest features in electrical equipment . . . how\nto select proper detergents and other cleaning aids\n. . . flower arrangements . . . color coordination in\ndecorating.\n► KQED, San Francisco, is presenting a series of\nprograms on the rise and growth of American musical\nmovies. Excerpts from thirty-two different musical\nhits of the past will illustrate the story of the Amer¬\nican musical films.\nPERSONNEL\n► Ted Nielsen has joined the staff of WHA-TV,\nUniversity of Wisconsin, as producer-director. He\nhas worked at WTTW, Chicago, as producer-director,\nand at WQED, Pittsburgh, as director.\n► Douglas O. Ward well has joined the University\nof Connecticut staff as the radio-TV specialist. He\nhas had four years of commercial broadcasting ex¬\nperience and three years in educational radio.\n► Three appointments to the broadcasting service\nat the University of Michigan have been announced.\nHarry Welliver has replaced Marjorie Lundin as\nmusic director of WUOM, and Robert Debrodt and\nFred Steingold have positions on the TV production\nstaff. Welliver previously was dean of the Millikin\nUniversity school of music.\n► Miss Marguerite Fleming, manager, KSLH, St.\nLouis, is on the professional advisory committee of\nthe Better Radio and TV Committee of the Metro¬\npolitan Youth Commission of St. Louis. This is a\nnew committee set up to study programing, the FCC,\nlicense renewals, misleading advertising, and a pro¬\nposed White House commission on broadcasting.\n► Donald R. Quayle has been named assistant gen¬\neral manager of WGBH-FM, Boston. Formerly he\nwas program director at WOSU, Ohio State Uni¬\nversity.\n► Andrew McMaster has been hired as chief engi¬\nneer by the Nashville ETV Foundation to work with\nEdward Wegener in getting Channel 2 activated as\nNashville’s community ETV station. McMaster has\nbeen at WJHL-TV, Johnson City, Tennessee, for six\nyears. Wegener is on leave from Auburn University,\nAlabama.\n► Charles Callaci, production manager, Anaheim\nCity School District CCTV project, discusses the need\nfor showmanship in ETV in the September issue of\nFilm World and A-V News Magazine.\n► William H. Tomlinson, of the TV department at\nMichigan State College, will serve as visiting instruc¬\ntor in the radio, TV and film department at Stephens\nCollege this year. He will also assist in planning new\nuses of CCTV for instruction.\n► Raymond Cheydleur, Manatee Junior College com¬\nmunications division chairman, is lecturing at the\nUniversity of Damascus this year on a Fulbright\naward. He-plans to return to Manatee at the end of\nthe academic year.\n► The 1960 Year Book of Education, Communica¬\ntion Media. and the School, carried two articles by\nNAEBers. Dr. Harry J. Skornia wrote on the im¬\npact of radio and TV on U. S. education. Clifford\nG. Erickson wrote on closed-circuit and open-circuit\nTV courses for college students.\nHere and There\nAt the organizational meeting of the New York State\nEducational Radio & Television Association, Donald\nE. Schein, director of the Mohawk-Hudson Council\non ETV, was elected president. Purpose of the new\norganization is to extend benefits of educational radio\nand TV throughout New York, and to foster de¬\nvelopment, utilization, and acceptance of these media.\n• Tulane University, New Orleans, won one of\nfour TV awards from the American Bar Association\nrecently. Tulane’s award was for the program “With\nJustice for All,” which explains the functions of\nlegal aid in helping indigent persons.\n• A new competition for exceptional plans for TV\nresearch has been announced. The competition is\nconcerned with problems of human behavior and TV,\neither TV by itself or in relation to other communica¬\ntion means. For booklets explaining the specifications,\nawards, etc., write to Mark A. May, chairman,\nCompetition on Plans for Television Research, 1\nRockefeller Plaza, New York 20, New York.\n• WFSU-TV, Tallahassee, Florida, has begun pro¬\ngram tests. The station is headed by Roy Flynn, di¬\nrector of broadcasting services for Florida State\nUniversity, who also heads WFSU-FM.\n• A visiting professor at the University of Texas\nfrom Stuttgart says that radio is a more important\nsource of entertainment in Europe than in America.\nDr. Hans Beyer has been associated with Radio Stutt¬\ngart since 1946, and he recalls that following World\nWar II radio was the only source of entertainment\nin Germany.\n• A program is under way at the University of\nNevada to study just how effective teaching machines\nare. The research will last three semesters and is\nbeing conducted by the psychology department.\nPublications\n• “ETV Starts with a CECO RF Distribution\nSystem,” free from CECO, P. O. Box 824, State\nCollege, Pa.\n• “Educators Guide to Free Science Materials,”\n$6.25, and “Educators Guide to Free Tapes, Scripts,\nand Transcriptions,” $5.75, Educators Progress Serv¬\nice, Randolph, Wisconsin.\n• “World Affairs Film Guide,” single copies free,\nAudio-Visual Extension Service, 115 TSMa, Min¬\nneapolis 14, Minnesota.\n4\nNEWSLETTER"
}