{
  "id": "d1024-137",
  "text": "TO: NAEB Board of Directors\nReport ft5\n12-10-54\nFrom: Frank E\nSchoole;\nRe: Transfer of treasurers funds and duties*\n1. Barring major emergency, treasurer transactions and most duties\ntvill be suspended, December 24-319 1954? inclusive. This\nperiod will be used to clear the books, the bank, etc.\n2. Effective January 1, 1955? all deposits and all disbursements\nwill be handled by Bob Coleman.\n3. The moratorium will be used to close out of the books, check\naccounts, and make necessary statements as of December 31o You’ll\nreceive a report.\n4® On or about December 209 I shall transmit to Bob Coleman a\nsum with which to start his account. It probably will be in the\namount of $409000. The balance, I’ll transmit to him earliest\npossible moment, probably on December 31 or January 2.\n5o Practically all statements for dues and News Letter subscriptions\nfor 1955 have already been prepared and will be mailed from this\noffice.\n6o Practically* if not all transactions will go through headquarters\nso Skornia, Hill* Bidlack, Underwood can check, as well as\nassign accounts to which to be charged. This way Bob will have\nadvice before he has to act as treasurer.\n7» Employee checks (Engineering Service and Placement) must always\nbe written as of the first of the month. This makes it imperative\nthat Coleman have funds to cover first checks he’ll write, as of\nJanuary 1 for December services. To write earlier would complicate\nthe income tax records of the individuals involved.\nBo Schooley will prepare and file the income tax and the social security\ntax report for Internal Revenue.\n9* My bond will expire as of December 31« It will not be renewed.\nColeman will have bond, approved by Board, in same amount as\ncarried by me—$40,000.\n10. As of December I returned to FAE the sum of $Sf704ol6P balances\nin six projects now completed. These items: Monitoring, ’51-T52g\n(2) *53? (3) *54? (4) Lincoln Lodge seminar, (5) TV Production\nWorkshop ’53? and (6) Grants-In-Aid ’52-9 53®\nlie The Chicago Radio Project has been closed out with no balance*\nThe New York Educational Institute by Radio will be closed out shortly."
}