{
  "id": "d1024-139",
  "text": "Inquiry f2\n12-12-54\nTO:\nFrom:\nNAEB BOARD OF DIRECTORS\nFrank E. Schooley\nRe: Some more Committee appointmentsc\nBefore Christmas I propose to appoint three more committees*\nYour reactions to my proposals will be appreciated0 For your\nconvenience I’m enclosing two copies. You may indicate your\nfeelings on one copy and return. Please identify yourself,.\nCommittee to Select 1956 Convention Site:\nBurton Paulu, KUOM, chairman\nB. Kendall Crane, V’DUQ\nHaskell Boyter, WABE\nElmer Sulzer, WFIU\nGale R* Adkins, University of Texas\nRichard P. Marsh, KCSM\nNBo This committee is to recommend three sites, no more, to\nthe Board of Directors, in order of committee preference. This\ncommittee should complete its work via mail probably by February 1,\nToo, each region represented, as well as actives and associatesy\ncolleges and schools.\nAwards and Citations Committee\nH. B. McCarty, WHA, chairman\nCarl H. Menzer, WSUI\nOla Hiller, WFBE\nAllen Miller, KWSC\nMartha Gable, Philadelphia Public Schools\nNB: This committee could have special work two seasons of the\nyear, (1) At Columbus in April; (2) at national convention in fallo\nRecommendations will be asked of committee, for possible action\nby Board of Directors„ Committee may wish to elicit recommendations\nfrom total membership0\nGrants-In-Aid, 1955\nRichard Vogl, WOI, chairman\nJack Westbrook, WOT\nLucile Ruby, WLSU\nWilliam Harley, WHA\nLee Eitzen, WSUI\nNB: This committee to be activated only if we secure an additional\ngrant from ETRC for grants-in-aid radio0 We willc\nYa ho, and a bottle of rum*\ncc:\nDunn from Oklahoma ( and I'm not a cowboy or an\nIndian) wishes to congratulate the honorable presl\ndent and confirm his excellent idea of additional\ncommittees and their personnel. However, in defer¬\nence to the sober intent of our great organization\nI think I shall propose an investigation of our President’s sobriety. Best of\nthe season to you and a doff of my hat to your dear wife who, I hope, is in\ngood health even though—-—J\nH. J. Skornia\nCohn & Marks"
}