{
  "id": "d1024-23",
  "text": "■ ^\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOffice of the\nRegional Director\nq ,0 Itfi February 9, 1954\nPc5 U 0 '' ' .\nMEMORANDUM\nTO: Members of the Board\nFROM: Allen Miller\nIn accordance with the Board9s wishes, I have talked with\nMaurice Mitchell of Encyclopaedia Britannic^. Films to clarify a\nfew points of fact in the proposed arrangement Tor EBF to under-\ntake the sale of NAEB albums® Let me then summarize the elements\nof my conversation and of George Probst3s letter which appear to\nme to he most pertinent to our reaching of a decision. Briefly,\nit seems to me that our choice is that of accepting a small flow\nof orders which may be expected to come in to NAEB without any\nparticular effort with the returns of negligible magnitude or of\nattempting to secure returns that might become substantial through\nreally vigorous exploitation by EBF. Our gamble hinges on the\nsize of the market in the public schools and colleges for a product\nwe know to be excellent and usable*\nThese appear to me to be the salient points but without\nregard for order of importance*\n1) Exclusivity\nEBF feels that a two year agreement with the right\nto renew is fair. The effort of the salesman which\ndoes not result in a sale the first year often pro-\nduces an order the second year.\nThe principle of exclusivity is so common in business\nthat I feel no elaboration in its defense is needed.\nIn my opinion EBF would be foolish indeed to print\npromotional literature, to supply 40 salesmen with\nkits and sales arguments without a clearcut under-\nstanding that all sales, both directly and indirectly\nresulting from their effort, should bring a return\nto the company.\n2) Stockpile Investment\nAt the Ames meeting I was given the impression that\nNAEB would have to invest a substantial sum to assure\nan adequate supply before EBF undertook its sales\neffort. I no longer believe this to be true.\na) No specific inventory required—>EBF will need 40\ncomplete sets of alBums* for use as demonstrators\nwhich they will expect to receive at cost. Of\ncourse, this will reduce the supply on hand but\nEBF does not expect NAEB to have any stated in¬\nventory.\nThey would expect delivery on orders within a\nmonth."
}