{
  "id": "d1024-30",
  "text": "flora raEWTTAL\nTO* HAEB Officers\nJR CM is Skcrnia ^ \"\nSUBJECT s For Intensive Discussion at Columbus*\nBATE 3 Jfcrch 11, 1954\nA few hard questions growing out of informal discussion with\nGriffiths of FAB yesterdays\nlo Hhat do m feel are the steps which need taking to shape\nthe destiny of educational TV in the B«S» involving and\nutilising the best thinkers, scholars and subject matter\nspecialists available?\n2» Assuming the definition of a working conceptions dees the\nNaEB feel itsolf in a primary or secondary position and/sr\nstatus to handle this problem? (The MSB often protests\nbeing called a group of operators*\" let whenever it needs\nto do hard-thinking it seems to need to call on philosophers,\nsocial scientists and others its group of official\nrepresentatives of member institutions * Bees this mean that\nthe NAEB should jjgfc claim to represent educational TV (and/or\nradio for that matter) at tbs social responsibility and\nphilosophy level?)\nI at this point indicated that our Mhola institutions were\nmembers and it was natural to call on ggg philosophers for\nphilosophy, etc* X do feel, though, an urgency to get to¬\ngether ooilogG and university presidents, etc* (the group\ndiscussed at Oklahoma) as soon as possible to plot the\nBAEB's role, while a significant one is still possible (the\nHovde^armichael-MleiN'Allen Miller activities and discussion\narea, to mention only a few \"cue* words)« Even if Headquarters\nfunds must be used, X believe we should consider (at Columbus)*\n3* Boes a \"Penn State Two fears Later* conference not need\nholding? It should this time be one of stations instead of\nonly dreams and plans and stations should moan the HAEB*\nBut has the MSB enough to handle or coordinate this?\nIf notwho should?\n4« 1 believe we5 re at a crossroads at which some haste and decisive*\nness must be shown in the next few weeks in waking definitive\nour statement (finalised) of NAEB aims and purposes, with fairly\ncogent schedule of assuming the various functions now scattered\namong numerous groups. The \"think Session\" proposed at Oklahoma\n(with top people in limited numbers) also appears to be a pressing\nneed*\n(OR BEHALF CF GRAXDGN ATJSMJS (NHO IS MOMENTARILY COVERED UP) AS HELL*)"
}