{
  "id": "d1024-80",
  "text": "NAEB BOARD\n>2<\nKay 13, 19$k\nho PROPOSED MEETING OF REPRESENT AT IVES OF THE FIVE TV GROUPS. The F/E has\ndecided' agalniFTalllBg^a meeting of ikeeu groups\"1 and Dr.* Arthur Adams,\nsubject to the washes of all Evolved, has agreed to call such a meeting®\nI am writing him today indicating our interest in such a locating. As\nI interpreted the intent of the Board at our Columbus meeting* it doesn*t\nmake any difference to us who calls such a meeting so long as it is brought\nabout and we have equal representation®\n*>o KELLOGG. Since my meeting with VanDuyn in Chicago on Kay 2, I have talked\nto him~once. He suggested that I stand by for further comment from the\nFoundation®\n6® OCTOBER 26 MEETING WITH CUR PRESIDENTS AND SUPERINTENBENTS® Siegel in\nhis usuaT*elTTcxent manner has moved Torwardl on our Incoming with our\npresidents and superintendents orior to the fail convention and we are\nnow assured that these gentlemen and the NAEB Board id 11 receive an\ninvitation from Mr* Arthur Sulzberger* Publisher cf the New York Times,\nfor dinner at the Publishers Dining Room of the Times, Tuesday evening,\nOctober 26® He will give us more facts cn the luncheon to be given on\nthat same day by Mrs. Reid, the publisher of the Now York Herald Tribune®\nThis will provide us with a good two and one-half hour session to discuss\nthe problems of educational broadcasting with our presidents and super**\nintendents at a meeting which I think should be strictly ®n familic®\nPlease send me immediately the names, titles, and addresses of your\npresident, supeFIHtim^n^ or mayor. I will extend to them an invitation\nto meet with the NAEB Board in the afternoon, mentioning the fact that\nMrs. Reid and Mr. Sulzberger have arranged a luncheon and s dinner for\nthem and will personally invite them to attend these two functions® I\nwill forward the list to Si sc he may provide Mrs. Reid and Mr. Sulzberger\nwith the listo I will forward my invitation on cue from 31 so it will\narrive at approximately the same time as the other two®\nMeanwhile I suggest that you talk to your president immediately and rc-\nquesFTHat he put October 26 on his calendar. The early fall is a busy\ntime ana we will have to book these people far in advance. I suggest\nthat you point out that NAEB is interested in securing the advice of\nour presidents and superintendents on important questions concerning the\ntotal development of educational radio and television and believe this\nis of sufficient Importance to warrant their taking the afternoon and\nevening from their schedules. You probably should inform them also of\nthe plans for the luncheon and the dinner. So rail details will be\ndeveloped carefully, I should like to appoint Dick Hull, Allen Killer,\nand Seymour Siegel a special committee charged with the planning for the\nluncheon, afternoon session, arid dinner. I am asking Hull to serve as\nchairman. As member ex-official of the committee, I should like to be\nkept nested on all details®"
}