{
  "id": "d1024-86",
  "text": "Mr, Qraydoa Auamus\nJuly 22, 1954\n+\nIt appe&ra that everyone la aura that everyone ale® beta more time than ha has for\n®u©h matters. Ralph promised to join m in taking up with the AERX again the\npossibilities of evaluating projects as X had earlier disoussed with Gertruda\nIroderiok.\nReturning to the HQGET nailing lists, it was pointed out that these\nlists are developed and ©heokftd through field mm, lists of preachers, and other\ntypes of opinion leaders are generally Xipts of people to wbm someone in W€SS£\nhas actually talked•\nSome upcoming publication fey the NDGET were outlined. A four-panel job,\nin its first printing, was passed around. A broohure for business non only is\nin the works. Over a thousand speakexaMts have been distributed. Their film,\nNEW VISION, hm had over 150 showings so far. The advisory ©ounoil of the NXET\nnow contains 103 organisations* Raymond WLtteoff6s article in a mmnt issue,\nJuly 17,.of the SATURDAY REVIEW GBP LITERATURE was pointed out. It is an excellent\narticle. Beginning with the September 1mm, the NXET NEWSLETTER Is being con¬\nsiderably increased. Qm of the nosk important statements made was that the NBGET\nkeeps helping stations (like KTHE) after} they go on the air, whenever danger\narises. The statement of responsibility of the JGET and the TOET in this area\nwas put in these words by Ralph Sbeotlesi fl0Tbe HDGET and the XET are as mu@h\nconcerned with station problems as with problems before they are on the air.90\nThe USG situation was briefly {outlined again. The USG has agreed to keep\nEIRE on the air for a year. NSSBT station men are in Los Angeles to try to make\nthis into a community station. State law in California prevents the sort of\ncontributions which Sic Louis and Pittsburgh, for example, have been able to use.\nThey seem to have $163,000, or sobs such modest figure, as a result. During the\nlast year they mm to have spent over $400*000 on operations alone. Their\npayroll had ©limbed to over IDO people. This situation is having to b® radically\naltered.\ni\n* Mullen pointed out that most of the stations are still in ©rials,\nand ©onsequently are being nursed by the N8GET. Pittsburgh, for example, is in\nsons difficulty. The NSGEX has a full tine man there helping with the situation.\n3c Agfe»T¥p Eunice Parker briefly outlined her problems and responst®\nbill ties. There are 2,500 on the miling list of the AGE and 1,000 on the\nmailing list of the TV Coomitte©. The Newsletter is issued only on an irregular\nbasis. Most contacts are/a1diroot correspondence basis. Over half the people on\nthe AGE lists are faculty.\nThe A0E is undertaking the securing of funds for a proposed meeting of\na PEHN STATE TWO TEARS AFTER nature« This meeting will review the status of\nETV and will involve most faculty people. It is hoped that this meeting might\nbe held at a member station institution."
}