{
  "id": "d1024-87",
  "text": "Mr* Graydon /msma\n-*■\nJuly 22, 1954\n4<> The JQET , Blanche Crippin outlined the mailing list and services of\nJSBTo Thar® are about 6,000 names ©n the mailing list for the ^Roundup of the\nRation0a for example? both JBET and I©GET have full tima people devoted\nexclusively to mailing lists.\nBlanche distributed outlines showing their publications and mailing lists\nwhich were gone over and explained in considerately more detail than is required\nhere. Che interesting development was that the JGET has set a price of $4°®0 per\nset on extra sets of material,\n5* The MSB. I outlined the various functions of the KAEB in the\npublication® area and explained oar rather modest mailing lists Vfe also wsra able,\nto compete successfully for the top honors fer else of staff £ot editorial £§fi@y\n1 believe sy summary of NA2B areas of responsibility 'ym@ adequate-: . ijhad previously\nmnt everyone represented copies of our publications, together with a jlist of\neverything m distributed with the newsletter, etc., so that there wodld be a®\nquestion of its area of operations. I expressed the hppe ^hat promotion of ETV\nviould not necessarily always assume that radio was a •fl&ad* duck® a® sens BHQBT\narticles seemed to indicate. In reply to the proposal.! of the HQOET that it\nhandle, all mv* releases for all organisations, I pointed out that the MEB\ntraditionally handled its own releases on publications and operations. Wa\ntherefore would be an exception to this relationship. |\nI wa invited by Bob to write a 1,000 word statement of the * interrela¬\ntionships of the media, and tbs possibility of the survival of radio, for their\nNewsletter o ' It was a rather shocking experience to fipd myself surrounded by\npeople idie believed that radio was now just the tail ojf the snake, which has been\ncut off but ®will scon stop wiggling,® as Bob Mullen so graphically put it.\nDeadlines for publications mm announced as, far a® possible.\nFor the HBGET, the first and fifteenth of each month, backing up\nfive or six days for submission of material.\nFor the «&2ET report®, the first of each month. Ifeeded five days\nin advance. Other material® throughout the month.\nThe MEB material needed by the 25th of each month.\nIn the final discussion, no satisfactory solution wap .found to the\nproblem of who sh@uldLj|s@lusively handle the large volume of sail reaching\nm 1 -da y 1 e MSI Uludents | a ta <k. g khese® and 1 things of a\nscholarly nature, and other random inquiries about where to find or secure various\nkinds of material, where to go to school to get good radio and television ©curses,\netc. Since no adequate solution to this could be found, the best we can do is for\neach organisation to provide each other with more carbon copies of its output."
}