{
  "id": "d1848-1",
  "text": "-2-\nribbon with the expertness of a home economist graduate, editing the interviews\nand homemaking demonstrations for air use in her new and popular show. ’’Never\nwas a magnetic-paper recorder in such artistic hands,” says John Blake, KWSC\nProduction Manager.\n* * *\nLIBRARY\nKWSC, Pullman, Washington subscribes April 1 to the Associated Program Service,\nadding 4500 selections to its basic music library, preparatory to increasing broad¬\ncast hours. The station continues use of NBC-Thesaurus and World libraries*\n* * *\nF.C.C.\nAlvin E. Nelson's application for 1030 kc with 50,000 watts new station at San\nFrancisco has been withdrawn. KWSC, Pullman, Washington public interest station\nhas application before FCC for 1030 kc.\n* * *\nPICKUPS\nKWSC, Pullman, 'Washington is installing new Fairchild turntables with pairs of\nWestern Electric 9-A and 9-B pickups for transcriptions on each and special record\npickups. According to the Station Manager, this set-up will permit the right pick¬\nup to be used for the speed and the groove of whatever disc is played, thereby\nvirtually removing undue wear, and the dynamic noise suppressor that is under tests\nwill eliminate all remaining surface noise.\n* * *\nPUBLIC INTEREST\nPullman, Wash., March — During fifteen broadcasting days in the last part of\nFebruary KWSC was engaged in the following activity: six high school basketball\ngames done remote from two different communities; three college conference-finals\nbasketball games (one from Seattle, 400 miles distant); two collegiate boxing\nchampionships with cut-in remotes from training quarters,; four special convocations;\nfive morning broadcasts featuring national religious leaders gathered at the\nState College; the debut of a Radio Workshop experimental production series; regular\nbroadcasts of the KWSC Campus Showcase - a variety musical-comedy; two programs’\ndramatizing and interpreting the G.I.'s college life; thirteen special remote pro¬\ngrams on behalf of the local hospital drive (town never had a hospital till now);\nand its normal amount of regularly scheduled out-of-studio live programs* \"KWSC\nis putting on a barrage of broadcasts important to the town,\" is the way the\nPullman Herald expressed it. Many Washington, Oregon, Idaho village and city papers\ncarried comment.\n* * *\nPRODUCTION\nPullman, Wash., March -- \"The Lamplighters\", which was offered last month to\nregional and local commercial stations has been optioned by KFIO, Spokane, Washing¬\nton and KTBI, Tacoma, Washington. The program series is the first of KWSC's\nproposed \"developmental productions,\" \"The Lamplighters\" is a long-tested KWSC\ntranscribed series featuring 20 mixed voices and string orchestra in music from\nboogie-woogie to the classics. Unusual angle is that the performers have never been\non the air before and suddenly are heard on at least three stations in various\nparts of the State of Washington. All talent on the series are Washington young\npeople. Frederic Hayward, Station Manager, proposed that the public-interest station,\nKWSC at Pullman, prepare and train new regional and local talent which proved to\nhave real but unheard ability for radio performance. Other stations are negotiat¬\ning presently for the series which is designed to aid outlets lacking time and\nstaff to produce such local shows, or help bring new regional performers into radio.\n* * *"
}