{
  "id": "d134-106",
  "text": "Myth and Mass Media\nMarshall McLuhan\nWhen an attempt is made to bring the relatively articulated concept\nof “myth” into the area of “media”—a concept to which surprisingly\nlittle attention has been given in the past—it is necessary to reconsider\nboth “myth” and “media” in order to get at relevant data. For exam¬\nple, English is itself a mass medium, as is any language employed by\nany society. But the general use of the phrase “mass media” would\nseem to record an unfavorable valuation of new media, especially\nsince the advent of the telegraph, the telephone, moving pictures,\nradio, and television. These media have had the same kind of drastic\neffect on language and culture that print had in Europe in the\nsixteenth century, or that it is now having in other parts of the world.\nIt might even be well to avoid so highly charged a phrase as “mass\nmedia” until a little more thought can be given to the problem.\nLanguages as human artifacts, collective products of human skill and\nneed, can easily be regarded as “mass media,” but many find it\ndifficult to consider the newer media deriving from these languages\nas new “languages.” Writing, in its several modes, can be regarded\ntechnologically as the development of new languages. For to trans¬\nlate the audible into the visible by phonetic means is to institute a\ndynamic process that reshapes every aspect of thought, language, and\nsociety. To record the extended operation of such a process in a\nGorgon or Cadmus myth is to reduce a complex historical affair to\nan inclusive timeless image. Can we, perhaps, say that in the case\nof a single word, myth is present as a single snapshot of a complex\nprocess, and that in the case of a narrative myth with its peripety,\na complex process is recorded in a single inclusive image? The\nmultilayered montage or “transparency,” with its abridgement of\nlogical relationships, is as familiar in the cave painting as in cubism.\nOral cultures are simultaneous in their modes of awareness. Today\nwe come to the oral condition again via the electronic media, which\nabridge space and time and single-plane relationships, returning us\nto the confrontation of multiple relationships at the same moment\nIf a language contrived and used by many people is a mass medium,\nany one of our new media is in a sense a new language, a new codifica-"
}