{
  "id": "d134-108",
  "text": "341\nMyth and Mass Media\nsocial. So that whereas a myth might appear as the record of such\nextended metamorphosis, an advertisement proceeds by anticipation\nof change, simultaneously anticipating causes with effects and effects\nwith causes. In myth tiffs fusion and telescoping of phases of process\nbecomes a kind of explanation or mode of intelligibility.\nWhat are the myths by which men have recorded the action of\nnew media on their lives? Is there significance in the fact that the\nOedipus myth has so far not been found among the preliterate? Is\nthe action of literacy in the shaping of individualism and nationalism\nalso severe on kinship structures? Is the Gorgon myth an account\nof the effects of literacy in arresting the modes of knowledge? Cer¬\ntainly the Cadmus myth about letters as the dragons teeth that sprang\nup armed men is an image of the dynamics of literacy in creating\nempires. H. A. Innis in his Empire and Communications has given\nus a full exegesis of the Cadmus myth. But the Gorgon myth is in\nmuch greater need of exegesis, since it concerns the role of media in\nlearning and knowing. Today, when by means of a computer it is\neasy to translate a mere blueprint of an unbuilt plane into a wind-\ntunnel test flight, we find it natural to take all flat data into the domain\nof depth interpretation. Electronic culture accepts the simultaneous\nas a reconquest of auditory space. Since the ear picks up sound from\nall directions at once, thus creating a spherical field of experience,\nit is natural that electronically moved information should also assume\nthis spherelike pattern. Since the telegraph, then, the forms of\nWestern culture have been strongly shaped by the spherelike pattern\nthat belongs to a field of awareness in which all the elements are\npractically simultaneous.\nIt is this instantaneous character of the information field today,\ninseparable from electronic media, that confers the formal auditory\ncharacter on the new culture. That is to say, for example, that the\nnewspaper page, since the introduction of the telegraph, has had a\nformally auditory character and only incidentally a lineal, literary\nform. Each item makes its own world, unrelated to any other item\nsave by date line. And the assembly of items constitutes a kind of\nglobal image in which there is much overlay and montage but little\npictorial space or perspective. For electronically moved information,\nin being simultaneous, assumes the total-field pattern, as in auditory\nspace. And preliterate societies likewise live largely in the auditory\nor simultaneous mode with an inclusiveness of awareness that\nincreasingly characterizes our electronic age. The traumatic shock"
}