{
  "id": "d134-110",
  "text": "343\nMyth and Mass Media\nextract the various levels of meaning it held for the awareness,\nbecause of the very slow reading necessary, print is itself commentary\nor explanation. The form of print is single-leveled. And the print-\nreader is greatly disposed to feel that he is sharing the movements\nof another mind. Print drove people like Montaigne to explore the\nmedium as a new art form providing an elaborate means of self¬\ninvestigation in the act of learning, as well as self-portraiture and\nself-expression.\nBy contrast, today we live in a postliterate and electronic world,\nin which we seek images of collective postures of mind, even when\nstudying the individual. In some respects, myth was the means of\naccess to such collective postures in the past But our new technology\ngives us many new means of access to group-dynamic patterns.\nBehind us are five centuries during which we have had unexampled\naccess to aspects of private consciousness by means of the printed\npage. But now anthropology and archaeology give us equal ease\nof access to group postures and patterns of many cultures, including\nour own.\nElectronic tape permits access to the structure and group dynamics\nof entire languages. My suggestion that we might regard languages on\none hand as mass media and on the other hand as macromyths seems\nobvious to the point of triteness to the structural linguists to whom\nI have mentioned these approaches. But it may be useful to point\nto some of the many nonverbal postures, both individual and public,\nthat accompany changes in the media. That is to say, a new form is\nusually a cluster of items. For example, in the very first decades of\nprinting at the end of the fifteenth century, people became vividly\naware of the camera obscura. The relation of this interest to the new\nprinting process was not noted at the time. Yet printing is itself just\nsuch a camera obscura, yielding a private vision of the movements\nof others. While sitting in the dark, one has in the camera obscura\na cinematic presentation of the outside world. And in reading print,\nthe reader acts as a kind of projector of the still shots or printed\nwords, which he can read fast enough to have the feeling of\nre-creating the movements of another mind. Manuscripts could not\nbe read at a speed sufficient to create the sense of a mind actively\nengaged in learning and in self-expression. But here, centuries before\nthe movie, is the ultimate magic and myth of the movie in the camera\nobscura. Perhaps as the camera obscura was the first, the movie is\nthe last phase of print technology."
}