{
  "id": "d134-113",
  "text": "346\nMarshall McLuhan\ntaught as if it were heraldry or some quaint codification of reality.\nThe assumptions about reading and writing that accompanied the\nmonarchy of print and the related rise of industrial forms are no\nlonger valid for, or acceptable to, those being re-formed in their\nsensibilities in the electronic age. To ask whether this is a good or\na bad thing is to express the bias of efficient causality, which is natu¬\nrally that of the man of the printed word. But it is also a futile gesture\nof inadequacy to the real situation. The values of the Gutenberg era\ncannot be salvaged by those who are as unaware of how they came\ninto existence as they are of why they are now in the process of\nliquidation.\nPhilosophic agreement is not necessary among those who are\nagreed that the insistent operation of media-forms on human sensi¬\nbility and awareness is an observable, intelligible, and controllable\nsituation. Today, when ordinary consciousness is exposed to the\npattemmaldng of several media at once, we are becoming more atten¬\ntive to the unique properties of each of the media. We can see both\nthat media are mythic “images” and that they have the power of\nimposing subliminally, as it were, their own assumptions. They can\nbe viewed at the same time as intelligible explanations of great tracts\nof time and of the experience of many processes, and they can be\nused as a means of perpetuating such bias and preference as they\ncodify in their structure.\nIt is not strange that we should long have been obsessed with the\nliterary and “content” aspect of myth and media. The “form” and\n“content” dichotomy is as native to the abstract, written, and printed\nforms of codification as is the “producer” and “consumer” dichotomy.\nUnfortunately for the direction and control of education, such a\nliterary bias is quite unable to cope with the new “images” of the\npostliterate age. As a result of our using literary lenses, the relevant\nnew data have escaped our scrutiny. My book, The Mechanical\nBride: Folklore of Industrial Man, is a case in point. Turning literary\nguns on the new iconology of the Madison Avenue world is easy.\nIt is easy to reveal mechanism in a postmechanical era. But I failed\nat that time to see that we had already passed out of the mechanistic\nage into the electronic, and that it was this fact that made mechanism\nboth obtrusive and repugnant.\nOne of the great novelties effected by printing was the creation\nof a new sense of inner and outer space. We refer to it as the discovery\nof perspective and the rise of representation in the arts. The space"
}