{
  "id": "d134-114",
  "text": "347\nMyth and Mass Media\nof “perspective” conditioned by an artificially fixed stance for the\nviewer leads to the enclosing of objects in a pictorial space. Yet so\nrevolutionary and abstract was this new space that poets avoided it in\ntheir language for two centuries after painters had accepted it. It is\na kind of space very uncongenial to the media of speech and of\nwords. One can gain some idea of the psychic pressures exerted by\nprint in the work of William Blake, who sought new strategies of\nculture to reintegrate the segmented and fractured human spirit.\nIn fact, the explicit mythmaking of Blake is the greatest monument\nand antidote to the mythic pressures of the printing press, to “single\nvision and Newtons sleep.” For the matrix of movable type contains\nthe totality of industrialism as well as the means of global conquest,\nwhich, by peripety, brought the preliterate world once more into\nthe heart of the industrial metropolis.\nThe prevalent concept that the mass media exert a baneful influence\non the human spirit has strange roots. As Marjorie Nicolson has\nshown in Newton Demands the Muse, it was Newtons Opticks that\ntaught poets the correspondence between the inner and outer\nworlds, between the structure of seeing and the structure of the\nscene. This notion planted in poets the ambition to gain control\nover the inner life by a calculus of landscape composition. The idea\nof verbally constituted landscape, as a lever upon the psychic eye of\nman, was a dichotomy quite congenial to the culture of the printed\nword. And whereas external landscape has been abandoned for inner\nlandscape since Rimbaud, Madison Avenue clings to the earlier\nRomantic concept of consumer control by means of externally\narranged scenes. The recent flutter about “subliminal” advertising\nindicates the delayed shift of attention from outer to inner landscape\nthat occurred in many of the arts in the later nineteenth century. And\nit is this same shift that today focuses attention on myth in all its\nmodes. For myth is always a montage or transparency comprising\nseveral external spaces and times in a single image or situation. Such\ncompression or multilayering is an inescapable mode of the electronic\nand simultaneous movement of information, whether in popular\nmedia or esoteric speculation. It is, therefore, an everyday occurrence\nfor academic entertainment to stress “content,” while displaying com¬\nplete illiteracy with regard to media old and new. For we have now\nto possess many cultural languages for even the most ordinary daily\npurposes.\nThe newspaper will serve as an example of the Babel of myths or"
}