{
  "id": "d134-115",
  "text": "348\nMarshall McLuhan\nlanguages. When information from every quarter arrived at the\nsame time, the paper became a daily snapshot of the globe, and\n“perspective” in news became meaningless. Editorials could still\ntry to tie some items together into a chain or sequence with a special\npoint of view or vanishing point. But such views were really capsules\nfor passive readers, while, paradoxically, the unprocessed, uninter¬\npreted, raw news offered far more challenge to the reader to find his\nown meanings. Today it is easy to see how Edgar Allen Poe, both\nin his symbolist poems and in his detective stories, had anticipated\nthis new mythic dimension of producer orientation by taking the\naudience into the creative process itself. Likewise, it is easy to see\nhow the spot news of the telegraph press really acts like the yes-no,\nblack-white dots of the wirephoto in creating an inclusive world\nimage. Yet even now the sponsors of pre-electronic media continue\nto overlay the new myth by injections of earlier myth, creating\nhybrids of the “horseless carriage” variety in the interests of superior\nculture.\nThe same type of confusion exists in education in the concept\nof “audio-visual aids.” It would seem that we must do in education\nwhat the poets, painters, and composers have done, namely, to\npurge our media and test and define their unique powers before\nattempting Wagnerian concerts. The Gutenberg myth was not\na means of modifying the Cadmus myth, any more than the Henry\nFord myth modified the horse and buggy. Obliteration occurred, as\nit will with the movie under the impact of television, unless we choose\nto restrain the operation of form on form by due study and strategy.\nWe now stand at that point with regard to all myth and media. We\ncan, perhaps we must, become the masters of cultural and historical\nalchemy. And to this end we can, I suggest, find means in the study\nof media as languages and languages as myths. For our experience\nwith the grammar and syntax of languages can be made available\nfor the direction and control of media old and new."
}