{
  "id": "d134-122",
  "text": "-5-\nA first step in the development of such grammars of the media -- through\nuhe painstaking experimentation and testing which an undertaking of such\nmagnitude and implications requires, is what is proposed in this document.\nVj6 propose .herewith that education today embark on a new ventures universal\neducation in the languages and values of media themselves, so that each of\nthe new, and old, media may find its proper role, and so the best contri¬\nbutions of each may be preserved and realized in concert with all the others.\nThis proposal is made because of the fear that an accumulation of\nprojects, based essentially on media as tools, if they ignore these deeper\nconsiderations, may only be contributing to a dissolution and revolution which\nwill sweep away some of the finest values in our present great educational\nsystem, at the same time that they contribute new uses and values.\nOther Related Rage arch: Various efforts have been made in recent years\nto reveal and codify the unique powers and patterns of the various media\nof human expression. That print, photography, movie, radio, and television\nhave their own biases of statement and presentation was recognized by H. A,\nInnis in his book The Bias of Communication (1951)• Mr. Innis was a pioneer\nin showing how the bias natural to any medium affects and structures all\nhuman institutions. Wyndham Lewis, in The Art of Being Ruled (1926), and\nin Time and Western Man (1927), had earlier adopted the approach of artistic\nstructural analysis to science and also to commercial entertainment*\nMarshall Mcluhan, in The Mechanical Bridef carried the Lewis and Innis\nmethods of analysis into the world of advertising and into the study of the\ncomics, the press, magazines, the popular book, and their relation to the\nhigher arts of our time. In numerous shorter studies E. C. Carpenter and\nMarshall McLuhan have analyzed the technological media as new ^languages”,\neach with its own grammar and syntax.\nWith the coming of educational television and with increased classroom"
}