{
  "id": "d134-124",
  "text": "-7-\nnew media courses in .American education.\nThe end product of this project is seen as a syllabus or Mgrammer of\nthe media11 (which is not now available for basic training in media perception\nand judgment in the schools) with emphasis on television, radio and the\nother new media* This product will be developed in and by this project, on\nthe basis of controlled experimentation. This will begin to make it\npossible also to develop the capabilities and discrimination necessary to\nmake the entire world of out-of-school media an educational resource rather\nthan the distraction and obstacle it now so often is,\nIV* Procedure. A great deal of actual demonstration with children will be\ninvolved: to test what TV, radio and each of the other media, in comparative\nsituations, do to the viewer and listener in specific affective areasj to\nidentify and measure differences in reactions in the consuming of materials\ntransmitted by the teacher in person, the book, the film, radio and television,\nand through other channels, with emphasis always on identifying and maximizing\nthe usefulness and peculiarities of the new media, against a background of,\nand integrated with, the older media. Reactions to cues transmitted through\nvarious media will be measured and recorded as a basis for the teachable\napproaches to media which this project undertakes to develop.\nUsing as test sites various locations in the U. S* and Canada,\nvarious existing projects, as mentioned below, the consultant suggested will\ntest reactions to a variety of prepared materials in various media forms*\nTeachers will be previously briefed, and this project itself will be\npartially one of teacher education as well as media education of the children\nthemselves in the projects concerned. In some instances the same group of\nstudents will be exposed to different and identical messages, as transmitted\nthrough the various media (lecture, dialogue, discussion, film, print, audio\ntape, video tape, kinescope, etc,)"
}