{
  "id": "d134-13",
  "text": "L\nI was in New York a few days ago and called you first thing* and discov¬\nered that you had left the day before* This was a great disappointment*\nI stopped off en route to New York* and talked with some friends at\nGeneral Electric management center in Crotonvllle* and raised the quest¬\nion of the project for understanding media with their educational depart¬\nment* Their education division Is just in process of completing for their\nexecutives a project for economic training to raise the general level of\ntheir operations* I was interested in the form they had provided for this\ncourse* which had been prepared by numerous well-known economists* and it\nconsisted of twelve envelopes* each of which contained a complete kit for\ntraining group by panel discussions* by readings contained in the folder\nand not to be reached by outside means* Questions were provided which\nwould serve to guide panels, and especially they felt questions which\nwould serve to bring the thinking of the various individuals into close\nrelation to the events of the community. They were eager to avoid any\nsort of economic bias* and to provide a multiperspective approach to all\nthese questions* Their overall objective* as they expressed it* is\nsimply to raise the general level* and that is why they hope to Introduce\nthis same batch of materials into secondary schools* if possible* Their\neducation department expressed great eagerness to cooperate with us on\nthis project for understanding media* In any way we decided they could\nhelp* they would help.\nI then went on to New York* and I talked to a friend at HHD&O* and to\nanother at BfeCann-Erickson, about the possible Madison Avenue attitude\ntoward such a project* and they were quite confident that I would get\nall the cooperation I could ask for from their research division and\ntheir media analysts* They were sure that they would be delighted to\ndevise with me ways of testing media impact, media configuration, sub¬\nliminal and otherwise* as it is registered in the youthful or adult\nmind*\nI then talked to some people at Life and Time, who were just as keen in\nexpressing eagerness to assist this project* on the ground that anything\nthat raised the general level was to their advantage as well* This was\nalso the attitude expressed at NBC by Martin Hoade* and his friend and\nassociate Andrl Girard* the painter and experimenter. Girard showed me\nat that time an experimental film he'd just completed of Poe's Raven\nand his Annabel Lee* using what he calls cinematic diction* It was\namassing* the effeois he gets from these familiar poems by simply writing\nthe words on film strip* transparent paper actually, with accompanying\nillustrations like an old medieval manuscript* By putting the individ¬\nual words into movement* the poem comes to you in a surprising ways as\nIf some precocious child were doing a top level exegesis of same. You"
}