{
  "id": "d134-136",
  "text": "print, pictures. For example, television can use textual\ncriticism and variants to illuminate swiftly the process by\nwhich novel, play, or poem came into existence. The opacities\nof the scholarly edition translated^into this medium become\nsheer translucency. So that it is^to decide at what point\na new medium should or should not ape the effects of another\nmedium. Thus the co-existence and inter-action of media bofck\nboth in the past and especially today offers the richest and\nmost natural procedure of study and evaluation of the powers\nand biasof each of the media. The quite natural book bias\nis for \"content* and continuity in all other media as well.\nThis assumption in turn mostly conceals the character of other\nmedia from the merely book-trained person. Today, the co¬\nexistence of all medi®. easily reveals their quite unique\nproperties and also calls for a new kind of many-levelled\ntraining in perception forthe young. The saber-tooth//\nprogram is really a necessity in the luxuriant new jungle of\nmedia-data springing up oh all hands, and presented in many\nforms at once.\nAided by a variety of kinescopes and the audience research\ndivision of the CBC, it will be possible to do media simulcasts\nwith school audiences and the general public, though it will\n///// probably prove best in the long run to prepare/ the text\nof Understanding Media for^junior year of High School, which\nat present is considered a^year of generalized interests. It\nwill be helpful to have definite data about the relative accept¬\nability and usefulness of such a text in earlier years as well.\nThe briefing of teachers themselves may prove the major problem,\nsince their awareness of m edia characteristics,as opposed to\nprogram content , is minimal at present. That’s why it would\nseem necessary to devise a means of making Understanding Media\nan occasion of two-way discovery via dialogue and discussion.\nFew teachers know anything about the subliminal effects of\nprint which they could teach to a class. But both teacher and\nclass can discover, explicate, and verbalize a great deal about\nthe nature of print, photography, movies, telephone, television,\nradio, and typewriter.\nf®ith a prepared group of kinescopes, films, audio tapes, video\n^ tapes, lectures and printedm aterials, the various media\n^ qualities and results will be tested on the same groups in\nsome instances. Perception of differences and comparable\neffectiveness of various media will be measured in a variety\nof ways, written and oral tests and interviews of various types\nperhaps the use of infra-red movie photography as developed\nby the BBC and other types of candid observation, and other\npsychological test techniques. From the results so achieved\nit will be possible to recast , reprogram, and retest the\nmedia materials so used. It happens that the CBC is keen to\nlearn about these very matters itself , and so is read y to\nco-operate on a large scale/ in this venture. Bruce Attridge\nand Fred Rainsbury, heads of the children’s entertainment"
}