{
  "id": "d134-160",
  "text": "of enabling teacher and student alike to share their day-by-day awareness of many media in\na meaningful pattern of shared exploration and discovery. It also would develop the capabil¬\nities and discrimination necessary to make the entire world of out-of-school media an educa¬\ntional ie source instead of an educational obstacle.\nIV. Other Related Research: A great deal has been done in recent decades to reveal and codify\nthe unique powers and patterns of the various media of human expression. Most recently,\nfor example, the whole field of linguistic anthropology and that of structural linguistics have\nmade us aware of the spoken languages of men as mass media. The work of E. C. Carpenter\nand Marshall McLuhanhavein turn looked to the technological media as new “languages”,\neach with its own grammar and syntax. These new languages, which we know as print, photo¬\ngraphy, movie, radio, and television, have their own ways of statement and presentation which\n.4\nH. A. Innis calls in his book title The Bias of Communication (1951). Innis was a pioneer\nin showing how the bias natural to any medium, affects and structures human institutions.\nWyndham Lewis, in The Art of Being Ruled (1926), and in Time and Western Man (1927),\nadopted the approach qf artistic structural analysis to science and also to commercial enter¬\ntainment. Marshall Mcluhan, in The Mechanical Bride, carried the Lewis and Innis methods\nof analysis into the world of advertising and into the study of the comics, the press, magazines,\nthe popular book, and their relation to the higher arts of our time.\nMore recently with the coming of STV and with the classroom use of audio-visual aids, a\ngreat deal has been written to show the powers and limitations of various media in education.\nBut apart from the work of the Explorations magazine group, little has been done to relate the\nnew media problems educationally to the centuries-old print medium. Our huge stake in the\nmedium of print as it has shaped our language, on society, and our educational establish¬\nment is now being modified throughout by electronic forms. Some believe our stake in the\nprinted work may be lost completely. But this is not inevitable unless we continue to accept"
}