{
  "id": "d134-161",
  "text": "5\nprint subliminally, as it were, and fail to discern and to codify those of its unique powers and\nadvantages which should be retained in spite of the pressure of newer media.\nThat is the reason why a book for school text use is needed which will explain and demon-\nihe unique powers of each medium without taking any one medium for granted. Such a book\nwould be a nucleus of all the best that has been done in media to date, at a time when the new\nmedia need putting in perspective against a background of the old.\nAppended is a small bibliography representative of the rich and varied materials now avail¬\nable for understanding and using the media in the classroom.\nBibliography\nRudolph Arnheim, Art and Visual Perception; Berkeley, 1954;\nFilm as Art; University of California Press, 1957\nSergei Eisenstein, Film Form; Harcourt Brace, New York, 1949\nGyorgy Kepes, The Language of Vision; Paul Theobold, Chicago, 1949\nErwin Panofsky, Meaning in the Visual Arts, Doubleday, N.Y., 1955\nH. J. Chaytor, From Script to Print; Heffer, Cambridge, 1945\nDenys Thompson, Between the Lines or How to Read a Newspaper;\nLondon, 1939\nGeorge Bluestone, Novels into Film; Johns Hopkins Press, Baltimore, 1957\nRichard Hoggart, The Uses of Literacy; Chatto and Windus, London, 1957\nW. M. Ivins, Prints and Visual Communication, Routledge Kegan and Paul,\nLondon, 1953\nErik Bamouw, Mass Communication; Rinehart, New York, 1956\nS. H. Steinberg, Five Hundred Years of Printing; Pelican Books, London,\n1955\nDavid Diringer, The Alphabet. A Key to the History of Mankind; London, n.d.\nThe Hand-Produced Book; Hutchinson’s Scientific and Tech¬\nnical Publications, London, 1953\nMaurice Gorham, Broadcasting and Television Since 1900, London, 1952\nH. A. Innis, The Bias of Communication; Toronto University Press, 1951\nMark A. May and Arthur A. Lumsdaine, Learning from Films, Yale Univer- ,\nsity Press, New Haven, 1958\nRene Clair, Reflections of the Cinema; William Kimber, London, 1953\nJames J. Brunstein, *aTen Uses for Commercial Television in the English\nClassroom/* The English Journal, December 1988\nvol. xlvii, no. 9, pp. 566-569"
}