{
  "id": "d134-162",
  "text": "6\nV. Procedure: In approaching the teaching of the TV medium, it would be essential to show\n. -\nhow the telegraph, for example, altered the press format and the nature of reporting: for with\nthe telegraph we first enter the world of electronic media, At first a new medium is used as if\nit were an old one, as we see today with TV being used as if it were movies. Print at first\ntried to be merely a cheaper manuscript. A test for schools on understanding media would,\nin its background sections, reproduce samples of the pre-telegraph press with topics of dis¬\ncussion that would lead to perception of the basic differences of story-writing and of lay-out\n*\nof the page before and after the advent of the telegraph.\nThe pre-telegraph paper tied the news together by editorial perspectives, historical back¬\nground and analytic interpretation. With the telegraph the speed of coverage of globe made\nit impossible and even undesirable to unify the news by editorial means. Each item becomes\na world of its own with the reader in the creative role of editor and interpreter.\nThis pattern of 3 ‘do-it-yourself®0 characterizes all electronic media from the telegraph to\ntelevision. The poets and artists were the first to understand this trend, and they turned,\nas did Poe, to the creation of new art forms in which the reader or viewer is obliged to act as\nco-author. Such is the detective story and the symbolist poem. The pre-electric media favor\nthe completed consumer package, as it were. Hence many of the laments from the li terary\nworld about the \"new** media are natural enough. But they ignore the greater degree of creative\n''^anticipation demanded of radio and television audiences as compared with the consumer-\norientation of the bookman.\n✓\nAs Andre Girrard, the painter (now experimenting with word and image on television at\nCBS and NBC,) has shown, television images are created by light through, not light on. The\nviewer is the screen. And the world of space that he experiences via television is profoundly\ndifferent from that of the photo and movie space and image. And thi s results'in1 deep adapta¬\ntion (on the part of the young especially), creating new sensitivity to forgotten aspects of art\na«d language. The text would in this connection invite student and teacher to explore the"
}