{
  "id": "d134-164",
  "text": "8\nadvertising executives, which indicated how eager they were to put their work on a more\nresponsible social basis. The great store of insight and skill in the use and development\nof the media which the commercial world has on tap, as it were, can be made directly\navailable for classroom study and educational use •\nA text of this sort in understanding television and radio will work with the physicist, the\nstation engineer, studio personnel the sponsor, &nd the audience altogether. A medium like\ntelevision, while being created by modem physios, on one hand, yet itself creates new inter¬\npersonal and inter-social patterns, on the other hand. And these new patterns co-exist with\nall the patterns earlier created by book and press and magazine. One object of such a\ntext would be to eliminate the wasteful quarrels between cultures and between disciplines\narising from jinconscious media has, and general media illiteracy.\nNow that the ancient absolute monarchy of print has yielded to the new oligarchy of print,\nphoto, movie, radio and television, we are compelled to developed literacy in several media\nrather than in any one alone. Our attempt to defend the monarchy of print can only lead to\neducational disaster. The medieval schoolmen, whose huge oral and disputational form of\neducational knew no rival, were wiped out by print in fifty years. Today we must have\nmulti-media literacy in order to avoid similar strife and waste of past achievement. Print\nbegan as a visual aid. It is not necessary that it should end with the coming of audio-visual\naids.\nVI. Personnel: As consultant: We propose Dr. Herbert Marshall McLuhan, Professor of English\nat the University of Toronto, co-editor of JSxploratlons magazine and distinguished media\nspecialist, lecturer, and author who has done much work in the field of relating media study\nto educational procedures. He is prepared to undertake this project and to finalize it into\nbook and syllabus form. Experiments in inter-media values have already been conducted and\nreported on in Explorations, published by the University of Toronto. These articles, and the\ninterest they have aroused among specialists and educators provide examples of Dr. McLuhan"
}