{
  "id": "d134-196",
  "text": "(2\npromised than can be delivered within this short time, especially\nwith this amount of money. For example, the discussion - or mention\nof research in depth and experimental evaluation on page 2. I do\nnot see how the working out of the teaching materials and text plus\nresearch in depth, etc. can be done in two years. Also, it is not\nclear to me whether this refers to research and evaluation on these\nteaching materials (which is mentioned latbr) or whether this refers\nto basic research on the media. It sounds as though it means this\nlatter. If so, this is definitely promising too much. Also, is the\nproduction and testing of the text by the CBC part of the package?\nIf so, won’t, a pretty good draft of the text need to be written almost\nimmediately instead of by the end of the 2pi ; ' r since it will take\n^5 mos to a year t6 prudUTO 'Th& programs, “some months to evaluate\n‘them, and then more months to rewrite the text as you indicate you plan\nto do??? Anyway, perhaps this can be clarified so that it is clear\nwhat is not being promised.\nA very minor point, I kept wondering at what level the text would\nbe aimed — high school, junior high, or elementary.\nI think that this draft is most improved in the concrete illustrations ■\nthough there are still a few places where they would be helpful. If\nI was doling out the dough, I would want a concrete illustration for\neach of these groups for whom he said the text would be helpful.\nHow will the text work with the physicist (this text aimed for the\nschools)? With the engineer? Studio personnel? Audience? Etc.\nThere are many additional references which could have been used.\nMost of them are in the very fine annotated bibliography which\nJojan Kuiper did for the Journal of the University Film Producers,\n\"An Annotated Bibliography on Composition in the Cinema,\" published\nsome time in '58. Kracauer's From Calagari to Hitler is one that\nshould be useful to McLuhan. Most of all, however, is Ruesch and\nKeys' Non-Verbal Communication, Berkeley, 1957 • Much of the basic\nwork for this text can be found there. If any member of the committee\nin Washington is at all familiar with this field, $he/ will wonder\nat its being left out.\nJohn Kuiper, who is my film man at Iowa and a very fine budding\nscholar on film (He was doing some work at the Museum of Modern Art\nfor a study he is doing on Eisenstein's early films. They have a\ngood collection of the early Russian documents on and by Eisenstein.)\nAnyway, I took the liberty of showing him the proposal and you might\nbe interested in some of his reactions.\np. 6 - \"is TV really used as if it were the movies? What does\nhe mean? Dramatic TV? Certainly ETV isn't like the\nmovies - the movies are never that dull 1\np. 7 - The discussion of the photo and its relation to the\nexternal world (i.e., \"reality”) might be considerably\nsharpened by some illustrations drawn from Reusch\nand Keys. (I agree here.) I strongly suspect that\nMcLuhan is not acquainted with this work. He should be '.\np. 8 - In strongly suspect that McLuhan has never had a movie\ncamera in his hands. This, I think, is the reason\nhe is so vague at this point. I recommend he get one.\nLet him try to shoot and edit one small film on any\nsubject. He will then have plenty of illustrations,\np. 10- The paragraph \"a great deal of actual demonstration...\"\nseems to call into question the basic assumption that\nwe already know enough about \"the differences in relations\nin the consuming of materials transmitted by the teacher"
}