{
  "id": "d134-20",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nDr. Harry Skornia\nExecutive Director\nNAEB\n14 Gregory Hall\nUrbana, Illinois\n14 GREGORY HALL\nURBANA, ILLINOIS\nJune 19, 1959\nDear Harry:\nBelow is a copy of a letter which I received from a man who\nknows McLuhan quite well. I belive that he makes good sense and\nthat his suggestion is one which should receive serious consideration.\nMI hope you and NAEB know Mac well. He's an authentic genius,\nI'm sure. He is also a poet in temperament, giv^fto insight as a\ntechnique of research, and on him it fits well. He sometimes leaves\nout all middle steps in stating conclusions, offering only outrageous\n(at first) generalizations, which anger many people. Remember always\nthat he cares almost only about the intrinsic form of the various media\n(as an artist) and has only superficial patience (or understanding) of\nthe likes of statistics, financial structure and even content analysis.\nHe believes that form of the media is greater than anything, that print\nis not film is not radio is not television, etc. But only half a dozen\npeople I know sense the urgency of this idea with him. They speak of\nthe role of the advertiser, Mac says in effect, 'the nature of the\nmedium as an art form, makes the role of the advertiser nearly inci¬\ndental, and, besides, the advertiser is, in a sense, a contemporary\nartist.1 And he means it, no nonesense.\nI unite in this vie|^ because I have seen people tire of Mac after\nan initial love affair, lose faith and conclude that he is an opportunist.\nHe isn't. He may well be the most important asset the media have, be¬\ncause he believes with a profundity which most of us only mouth that\nthey are the most important factors in the modern world, not because\nthey are propagandists but because they determine perceptual processes\n(not merely content) of people. Print, by its form, creates a way of\nthinking, not only a stoye of content; so do all other media. Few\npeople really understand this message."
}