{
  "id": "d134-202",
  "text": "- 5 -\nand interests of the community© Unlike a magazine* it does\nnot have a circulation strong among people on some economic\nor social or educational level and weak among otherso Net¬\nwork broadcasting has to have something for the children and\nsomething for the adults| something for men and something for\nwomen} something for the intellectually curious} something\nfor the recreation seekers? sorasthing for those who love\nsports* for those who love mysteries® for those who love\nsongs* for those who love comedy® and for those who love\nparsonalities or just other people like thems elves© Some-*\nthing for everybody©\n“For tbs fact is that broadcasting is a truly mass medium?\nit has to be© Unless it can enlist and held the interest of\nmost of the peopTeT^a good partToFTKiT^meT'^^\nexpensive a mediua^to^survlveo \"TFliui^g in its specCrim b'F\nprogramming;A 'liaW^ometSing'r«-» even the great majority of its\nmaterial — that will appeal to^otTj ustJTEbusari(ls^^rhundreds\northousands“but^^ a'nS J/‘\nAmng the effects of the policy of cultural industry (and of the mass\nmadia) is the tendency toward standardization of taste0 It is not necessary\nto the present analysis to contend that the effect of the policy of cultural\nindustry is to lower standards of taste (this may be or it may not be true} to\ntest the contention would require better comparative analyses of taste levels\nbefore cultural industry came along than we have at present)© All that is here\ncontended is that the effect of cultural industry is to standardise taste and to\ngive it a commodity orientation© This standardisation affects not only the\ntaste of the raoderate-incorae family which is the prototype consumer of the\nproduct of cultural industry? it also affects the taste for “high culture”\nby pre-empting artistie talent from that area® or by driving \"high culture\" into\nnihilistic and cynical alternatives to mass culture© And* inevitably® the\nstandardization of cultural industry picks up and homogenizes such remnants or\ninnovations of folk culture as are available to it (cf© the current fad for\nCalypso music)© Historically® it seems that the \"melting-pot\" period of assimi¬\nlating American immigrants was precisely the period which marked the rase of\n2/ Talk t0 the Rotary Club® St© Louis® Mo©* June 26* 1956©\nlast paragraph©\nEmphasis added in"
}