{
  "id": "d134-33",
  "text": "DEPARTMENT OF HEALTH, EDUCATION, AND WELFARE\nOffice of Education\nWashington 25, D. C.\nJune 15, 1959\nTITLE VII - NATIONAL DEFENSE EDUCATION ACT OF 1958\nPolicies, Procedures, and Guidelines\nfor\nGrants for Research and Experimentation in More Effective\nUtilization of Television, Radio, Motion Pictures,\nand Related Media for Educational Purposes\nBudget and Financing\nProposals submitted for research projects under Title VII must include\na budget showing the total estimated cost of the project* The information\nshould indicate the amount of funds to be provided by the grantee and other\nnon-Federal sources, and the amount of funds requested from the Office of\nEducation* A breakdown by fiscal year of the total amount should also be\nprovided*\nRepresentatives of the Office of Education will discuss the proposed\nresearch project and budget with the grantee, and before a grant is made\nthe research project and the budget therefor must be agreeable to both\nparties. The approved budget will show the total estimated cost of the\nproject by fiscal year, the total amount proposed to be provided by the\ngrantee and other non-Federal sources, and the amount to be provided by\nthe Office of Education*\nA copy of the approved budget will be provided the grantee. Adjust¬\nments may be made among the amounts for the various items in the budget,\nso long as such adjustments do not result in a significant increase in any\nparticular item and the total grant is not exceeded. Prior approval of\nthe Office of Education must be obtained before any major adjustment is\nmade.\nGrant Document\nGrantees will be notified of approved grants by letter from the\nOffice of Education* The grant letter will be addressed to the institu¬\ntion to which the grant is made. Copies will be sent to the principal\ninvestigator and the business officer of the institution*\nEach grant will be assigned a number which will be indicated in the\ngrant letter. All subsequent communications concerning the grant should\nmake reference to the assigned grant number."
}