{
  "id": "d134-35",
  "text": "Fiscal Reports\nA report of the expenditures under this grant will be required as of\nthe end of each fiscal quarter — September 30, December 31, March 31, and\nJune 30 — and a final fiscal report will be required within 30 days after\nthe end of the project* No report is required when less than 30 days have\nexpired between the date of the grant award and the first required report¬\ning date* Fiscal report forms and instructions will be provided by the\nOffice of Education*\nTechnical Reports\nProgress Reports\nPeriodic progress reports will be required for all research projects\nwhich require more than nine months for completion. These reports shall\nbe submitted as of the end of the second and fourth fiscal quarters —\nDecember 31 and June 30. No report is required when less than 90 days\nhave expired between the date of the grant award and the first required\nreporting date.\nReports of progress afford the researcher an opportunity for a\nperiodic evaluation of his accomplishments, his problems, and the develop¬\ning course of his research effort. In addition, they may serve as a\nvaluable reference in connection with requests for support of other pro¬\njects in the future.\nTo the Office of Education, these progress reports are of the utmost\nimportance in preparing justifications of its budget requests and in pre¬\nsenting detailed and convincing evidence of the value of such research to\nCongressional and other interested groups* The reports permit members of\nthe staff of the Office of Education to plan their own work more effectively\nand to furnish assistance or advice as problems arise. In addition, the\nreports enable the Office to answer numerous inquiries received from pro¬\nfessional research and administrative workers regarding projects currently\nunder way.\nIn brief, the purpose of the progress report is to afford you the\nopportunity to take stock of what you have done and to keep the Office of\nEducation properly informed. This may be accomplished in a report of\napproximately two pages in length, xtfhich should be submitted in four\ncopies. The following outline is suggested:\n1. Identification:\nName of institution or agency\nName of project director\nTitle of project\nPeriod covered by the report (inclusive dates)\nOE grant number (upper right hand comer)"
}