{
  "id": "d134-39",
  "text": "7\nTravel - The actual cost of travel or an allowance for travel,\nin accordance with the established policy of the grantee, is allowable*\nSuch travel costs or an allowance, not to exceed the rate of 1st class\nfare, may be paid to consultants from place of residence or employment\nto the place where services are to be performed and return, as well as\nto staff members when travel is necessary for the effective conduct of\nthe research* An explanation of how the estimated travel cost was de¬\ntermined should be included in the budget submission.\nSupplies and Materials - This item includes the cost of research\nsupplies and'materials and office supplies and materials actually used or\nexpended in connection with the research project. Details of the esti¬\nmated amount for supplies and materials should be provided, by listing the\ntypes of supplies and materials; the quantity, where appropriate; and the\nestimated amount for each type.\nServices - This iten includes services of a specialized nature\nwhich must be secured from other sources, such as statistical analysis*\nThe particular types of services for which funds will be needed should\nbe listed, showing the estimated amount for each.\nEquipnent - An allowance for the use of equipment may be per¬\nmitted to help defray the rental or depreciation costs of new equipment\nitems that are not essential to the current operations of the grantee,\nbut are necessary to conduct the research. Such an allowance may not\nexceed 20 per cent per annum af the undepreciated value of the equipment\nfor each year of the research project* Example: On an item of equipment\ncosting <j>!?,000 required for a 3 year project, the use allowance would bes\n1st year: 20$ of purchase price ($f>,000) $>1,000\n2nd year: 20$ of undepreciated value ($4,000) 800\n3rd year: 20$ of undepreciated value ($>3,200) 6U0\nAn allowance may not be made for permanent installations such as structural\nmodifications, transmitters, towers, cable installations, etc*\nCommunications - This item includes long distance telephone calls,\ntelegrams, radiograms, and postage which are directly attributable to and\nare necessary for the conduct of the research project.\nPrinting - This item includes the costs for printing, including\nduplicating, which are specifically incurred in connection with the re¬\nsearch project. It does not include the cost of publishing the research\nresults.\nOther - Any other items of direct costs which are specifically\nrequired for the conduct of the research project should be listed, showing\nthe estimated amount for each. If items are not self-explanatory, an\nexplanation or supplementary details of cost should be provided."
}