{
  "id": "d134-56",
  "text": "|V W\"29 Wells Hill Avenue\nKbToronto 10,Ontario,Canada\n^ » c'\\ rsororonto iu , u:\nJune 7' 1959\n0* .L&\nDear Harry, '\nThings are beginning to roll.\nAs soon as I began to get down to cases with CBC,various\nissues clarified. You can realize,in the first place ,\nthat free of many nagging affairs I could not turn\nfull attention to this project. Also, the fact of its\nuncertainty made if harder to give it the full attention\nit really deserved from the first. That foggy phase\nis past.\nWhat I’ve been offering mainly up1til now is th^generalized\ntheory of thedynamic-model stage. This pre-experimental\napproach of general theory is a kind of \"tool* within\nwhich new tests are initiated. For example, John Dewey’s\nequation between learning and doing initiated alLSorts of\nteaching experiments for bringing the methods of the\nphysical sciences into education,Experimental!sm could\nbecome a teachingm ethod.\nMy own \"medium is the message\" approach permits us to\nequate learning with abil* ty and to begin bests accordingly.\nI would suggest, that is, that with respect to perception,\nthe patterns and limits of ability may occur at a very\nearly age. \"Adult education\"may be An sense completeoat\nthree or four years of age. And just as present TV program¬\nming ignores the cultural factors which prescribe what\nahail be learned at what age (with pespect to content) ,so\nthe patterns ofm^edia asAn^edia configure human attention\nfrom earliest years in forms that persist throughout life.\nThis ,of course, is most obvious in the case of the greatest\nof all mass media, one’s mother tongue.\nBruce Attridge, associateo f Fred Rainsberry in the children’s\ndivision of the CBC, explains how at the CBC the producer of\na show is the camera director in all cases. This began\n\"strictly from hunger\" but continues for other reasons.\nThe advantage of the producer knowing the medium as camera\nman has been found to pay off in many ways. In the case\nof Attridge, who was a psychological tester withthe government\nduring the second war, then a Phd. in English and modern lit¬\nerature, it has meant that he has made a whole batch of\nkinescopes already in which he has varied the degrees of use"
}