{
  "id": "d134-57",
  "text": "2-\nof the medium with regard to the similar contents. He\ndid this just to find out how thegeneral audience would\nreact. We can have thfs^for testing on control groups any\ntime. They have not^been tested.\nHere, I suspect, is an area for testing that would challenge\nCBS and NBC and Andrd Girrard. Here is certainly an area\nfor testing that would interest the transactional perception\npsychologists of Princeton, Cantril, Ames, and Ittelson.\nI don’t know whether I’ve got this across ,Harry, but I\nthink that so far as area and pattern of testing go, there\nis here a most exciting field, one which need not cause\nany delay in getting into action.\nMy basic concept of grammar of a medium means mostly, Ithink,\nthe engineer’s knowledge of the structure of the images\ninvolved. E.g., in radio it would be the natureof auditory\nspace relations between mike and speaker, set and listener.\n(And Attridge says there is a great backlog of experimental\nmaterial here at the CBC that was made years ago and never\ntested. Shall look into this.) But the effect of the\nimage is, perhaps, rhetoric rather than grammar. Kenneth\nBurke plays much with these distinctions in the arts of\nexpression.\nAlso, with regard to experiment, Harry,! i/iwnot easy to\ndevise thsts for my general theory thatTT:medium is best\nrevealed when translated into another medium. So that,|*or\nwxample, we are today in the electronic age suddenly aware\nof the subliminal side of many things that were hidden in\nthe mechanical age behind us. Print ,for one. The\nGutenberg^tle was the subliminal age of print. Surely\nwe can getAmany people testing such a simple perception\ntheory as this:\n(a) the telephone as medium of human experience\nreveals its character better on the stage\nor in a movie than in actual home or business use.\n(b) the form cf the novel came into sharpest focus\nafter it had been translated into many movies\nby Hollywood, etc.\n(c) The movie as a unique form appears most stsrrkly\nwhen it meets the TV med ium.\nBut embracing this approach is my general theory that the\nperennial task of the artist has been to translate new\ntechnology into new art forms in order that it be humanly"
}