{
  "id": "d1782-2",
  "text": "given or used, and the amount and nature of that portion of the cost of the project\nor undertaking supplied by other sources, and such other records as will facilitate\nan effective audit.\n(b) The Secretary and the Comptroller General of the United States, or any\nof their duly authorized representatives, shall have access for the purpose of\naudit and examination to any books, documents, papers, and records of the recipient\nthat are pertinent to assistance received under this part.\nSEC. 394. For the purposes of this part -\n(1) The term \"State\" includes the District of Columbia and the Commonwealth\nof Puerto Rico.\n(2) The term \"construction,\" as applied to educational television broad¬\ncasting facilities, means the acquisition and installation of transmission apparatus\n(including towers, microwave equipment, boosters, translators, repeaters, mobile\nequipment, and video-recording equipment) necessary for television broadcasting,\nincluding apparatus which may incidentally be used for transmitting closed circuit\ntelevision programs, but does not include the construction or repair of structures\nto house such apparatus.\n(3) The term \"Secretary\" means the Secretary of Health, Education, and\nWelfare.\n(4) The term \"State educational television agency\" means (a) a board or\ncommission established by State law for the purpose of promoting educational tele¬\nvision within a State, (B) a board or commission appointed by the Governor of a\nState for such purpose if such appointment is not inconsistent with State law, or\n(C) a State officer or agency responsible for the supervision of public elementary\nor secondary education or public higher education within the State which has been\ndesignated by the Governor to assume responsibility for the promotion of educational\ntelevision; and, in the case of the District of Columbia, the term \"Governor\" means\nthe Board of Commissioners of the District of Columbia.\n(5) The term \"nonprofit\" as applied to any foundation, corporation, or\nassociation, means a foundation, corporation, or association, no part of the net\nearnings of which inures, or may lawfully inure, to the benefit of any private\nshareholder or individual.\nSEC. 395. The Federal Communications Commission is authorized to provide\nsuch assistance in carrying out the provisions of this part as may be requested by\nthe Secretary. The Secretary shall provide for consultation and close cooperation\nwith the Federal Communications Commission in the administration of his functions\nunder this part which are of interest to or affect the functions of the Commission.\nSEC. 396* The Secretary is authorized to make such rules and regulations\nas may be necessary to carry out this part, including regulations relating to the\norder of priority in approving applications for projects under section 392 or to\ndetermining the amounts of grants for such projects.\nSEC. 397* Nothing contained in this part shall be deemed (l) to amend any\nother provision of, or requirement under this Act; or (2) to authorize any department,\nagency, officer, or employee of the United States to exercise any direction, super¬\nvision, or control over educational television broadcasting or over the curriculum,\nprogram of instruction, or personnel of any educational institution, school system,\nor educational broadcasting station or system.\nNAEB WILL FILE RE LICENSING FEES\nKie deadline for filing comments re the FCC proposal to institute licensing\nfees has been extended by the Commission from April 16 to May 16. As announced in\nthe Washington Report for March 8 (Vol. Ill, No. 3), the NAEB Radio and TV Planning\ncommittees were asked to express their views on this matter. The majority favored"
}