{
  "id": "d1686-1",
  "text": "NAE8 NEWS LETTER\n...o?age 2\nJune I» !944\nCOPIES FOR ALL MEMBERS, TO FORWARD THEM TO THE FCC AND TRADE PU9LICAT IONS•\nOn suggestion of Wib Pettegrew of WOSU, NAEB voted TO transcribe and\nLOAN TO MEMBERS SOME OF THE OUTSTAND ING PROGRAMS AVAILABLE THROUGH THE\nAmerican Exhibition of Educational Radio Programs* On motion of Menzer,\nSECONDED BY SkORN1 A OF 5 NO I ANA, THE ASSOCIATION VOTED TO HAVE A80UT A DOZEN\nTRANSCRIBED AND SHIPPED ABOUT. IT WAS AGREED THAT STATIONS RECE 5 V IMG THEM\nSHOULO NOT KEEP THEM LONGER THAN ONE WEEK* Y0U8LL BE ADVISED ROUTE AND\nSHIPPING DATE SOON.\nNOW, THOSE ARE THE HIGHLIGHTS, WITHOUT CONVENTION SPEECHES. Of COURSE,\nTHERE WERE REMARKS BY NOVIK, BY OOLEMAN, BY MeNZER, IN FACT 8Y MOST\nEVERYONE PRESENT. I NC I DENT ALLY, AMONG THOSE PRESENT —VIRGINIA HaWK, WNADl\nMildred Seaman, KFKU; Boa Higgy and Wib Pettegrew, WOSU; Carl ^enzer and\nPearl Broxsam, WSUI; W. I0 Griffith, WOI; Allen Miller, KOAC; E, V\\i.\nZiebarth, WLB; Wallace Garneau, Kalamazoo; Mike Hanna, WHCU, Morris\nNovik, WNYC; Oave Owen and Waldo Abbot, Michigan; Harry Skornia, Indiana;\nGeorge Jennings, WBEZ; Elmer Sulzer, Kentucky; Sob Coleman, Michigan\nState; Ed Barrett, Drake; Max Krone, USC; Schooley, and no doubt others.\nOh, yes; my, my. Treasurer W. Ic Griffith reported that the organization\nWAS STILL IN THE BLACK, ALTHOUGH THERE WERE A FEW OUTSTANDING BILLS AND\none or two institutions who hadn’t paid their 1944 dues. Otherwise, the\nBOOKS WERE IN GOOD SHAPE AND THE TREASURER WAS COMPLIMENTED ON HIS FINE\nREPORT IN A RESOLUTION PASSED ON THE FLOOR.\nPRES 1DENT WILLIAMS RES SONS\nIn A LETTER RECEIVED ON THE LAST DAY OF May, THE EXECUTIVE SECRETARY HAS\nword from President Gilbert D, Williams of Purdue, stating that he is\nLEAVING RADIO TO LOOK AFTER HIS CRAN8ERRY FARM IN W | SCONS IN. G|B3S HAS\nOWNED THE FARM FOR FIVE YEARS AND NOW FEELS HE MUST GIVE IT HIS FULLTIME\nATTENTION. GOOD LUCK TO YOU GlBBS, AND SEND US A BOX OF THOSE GOLD\nNUGGETS ABOUT CHRISTMAS TIME.\nPending the election of a successor at the Fall meeting, Allen Miller\nWILL SERVE AS NAE8 HEAD.\nNAEBers WIN Ohio institute awards\nSome of the NAEB stations entered the annual American Exhibit of\nEducational Radio Programs and came out with prizes.\nWHA, University of Wisconsin, shared top honors with CBC,. each winning\nTWO FIRST AWARDS. WINNING PROGRAMS WERE ’’BEGINNING THE DaY,” NON-SECTARIAN\nRELIGIOUS PROGRAM OF SONGS AND READING BY B« LL PFEIFFER AND THE 'ASA SCIENCE\ncourse, ’’Young Experimenters.”\nWOSU, WL8, and WNYC came through, too. WOSU received honorable mention\nfor MThe Poultry School of tme Air11 in agriculture programs. Also, WOSU\nTOOK FIRST AWARD IN PROGRAMS FOR PRIMARY SCHOOL CHILDREN WITH ’’STORY •\nTime.” In the same class, WLB, Minnesota, received honorable mention for\nits \"Old Tales and New.” WOSU also took first award with \"News of the\nWeek” in the classification of programs for elementary schools. WNYC,\nnew York City, took first award with \"Plays for Americans” in the\nclassification of programs for junior and senior high schools."
}