{
  "id": "d1686-3",
  "text": "NAEB NEWS LETTER\nPage 4\nJune I, 1944\nThe secretary of the Chamber of Commerce Employment Research Committee,\nJohn Williams, estimates that business and industry will provide 117\nTHOUSAND JOBS WITHIN A YEAR AFTER THE END OF THE WAR. THAT IS ABOUT\nTEN THOUSAND MORE JOBS THAN WERE AVAILABLE IN 8942.\nAnd AN OFFICIAL OF THE SYRACUSE HOUSING AUTHORITY, JOHN OfTTMAN, SAYS\nTEN THOUSAND NEW DWELLING UNITS WILL BE BUILT BY THE FIRST FIVE YEARS\nAFTER THE WAR.\nSTORIES TOLD IN MUSIC ON KFKU\n“Stories Told in Music” is hearo over KFKU at 2:30 o'clock each Tuesday\nAFTERNOON IN PLACE OF THE “Art BY RADIO” PROGRAM. THIS NEW SERIES HAS\nBEEN PLANNED ESPECIALLY FOR THE CHILDREN WHO FOLLOWED THE ART LESSON\nBROADCASTS THROUGHOUT THE SCHOOL YEAR.\nAs THE TITLE SUGGESTS, THE MUSIC PLAYES ON THE PROGRAM TELLS A STORY.\nThe NARRATOR FIRST TELLS A STORY OF THE MUSIC THAT IS TO BE PLAYED AND\nTHEN POINTS OUT THE THINGS THAT WILL HELP THE LISTENER HEAR THE STORY\nWHEN IT IS RETOLD IN MUSIC.\nThe STORIES CHOSEN FOR THE SERIES ARE THOSE MOST FAMILIAR TO CHILDREN.\nThere will be a number of fairy tales, such as \"Alice in Wonderland,”\n“Peter and the Wolf,” and “Hansel and Gretel” and stories especially for\nboys—“Mark Twain” and cowboy music. The recordings used on the program\nare made by the country’s outstanding orchestras.\nREFRESHER SERIES FOR DIETITIANS ON HI AD\nOn Apfhl 14, WNAD, in co-operation with the 0. U. Department of Home\nEconomics began a series of eight broadcasts comprising a refresher cours\nIN NUTRITION.\nDr, Helen Burton, chairman of the department of home economics, and Miss\nUaura a„ Miller, associate professor of home economics, is presenting\nTHESE TALKS WHICH WILL BE PARTICULARLY HELPFUL TO THOSE PERSONS TRAINING\nfor Red Cross certificates as dietitians.\nThe following topics will be incluoed in the series: April 14, Energy\nNeeds; April 2l, Protein Needs; April 28, Minerals Needed for Building\nTissues; May 5, Further Minerals Needed by the Body; May 12, Water\nSoluable Vitamins; May 19, Pat Soluble Vitamins; May 26, Uses of Some\nof the newer Fooos; June 2, Menu Plsnning.\nHIGHLIGHTS ON WNYC\nOnce again this Summer, music lovers in New York City will be able to\nlisten to the broadcasts of the outstanding concerts by the New York\nPhilharmonic Symphony Orchestra from Lewisohn Stadium, and the Goldman\nBand Concerts from the Mall in Central Park which will be carried over\nNew York City's Own Station WNYC and WNYC-FM.\nBeginning Wednesday, June 21, and continuing each Wednesday and Sunday\nevening thereafter at 8:30 P.M. WNYC and static-free WNYC-FM will\nbroadcast the Stadium Philharmonic concerts. And WNYC and WNYC-r.v will"
}