{
  "id": "d1686-5",
  "text": "NAEB NEWS LETTER\nPage 6....\no * June 1»1944\nCommissioner Craven would have completed 30 years in Government service\nin August of this year. Except for a period of five years between 1930\nAND 1936, THIS SERVICE HAS BEEN CONTINUOUS. He HAS BEEN WITH THE FEDERAL\nCommunications Commission nearly nine years, including two years as its\nChief Engineer.\nCommissioner Craven stated that he plans to become associated in a\ntechnical capacity with the Cowles interests. The Cowles are publishers\nOF NEWSPAPERS IN DES MOINES ANO MINNEAPOLIS AND LOOK MAGA?IN£, AS WELL\nAS LICENSEES OF RADIO BROADCASTING STATIONS.\nFORygR COMMISSIONER JOINS FINCH\nGeorge Hl Payne, former Federal Communications Commissioner, has been\nELECTED A VICE PRESIDENT AND DIRECTOR OF THE F|NCH TELECOMMUNICATIONS\nCompany of New York.\nF C C ACTIONS\nThe RESUBMITTED APPLICATION OF THE UnIVEPSITY OF NORTH DAKOTA FOR A\nCONSTRUCTION PERMIT FOR A NEW NON-COMMERCIAL EDUCATIONAL BROADCAST STATION\nWAS RETURNED BECAUSE OF INCOMPLETENESS. (5/31/44)\nThe Board of Education, Detroit, Michigan, applied for a construction\nPERMIT FOR A NEW HIGH FREQUENCY FM BROADCAST STATION ON 46,100 KILOCYCLES.\n(5/26/44)\nThe application of WNYC-FM, New York City, for renewal of license was\nRESUBMITTED. (5/26/44)\nThe High School District of San Bernardino, California, applied for a\nCONSTRUCTION PERMIT FOR a NON-COMMERCIAL EDUCATIONAL BROADCAST STATION\nON 42,900 KILOCYCLES. (5/25/44)\nWSUl, University of Iowa, applied for license renewal. (5/25/44)\nWILL, University of Illinois, was granted authority to determine operating\npower by direct measurement of antenna. (5/25/44)\nVMLL, University ©f Illinois, was granted renewal of license to May I,\n1946. (5/16/44)\nThe University of Iowa was granted construction permit for a new non¬\ncommercial educational broadcast station to operate on 42,700 kilocycles.\n(5/16/44)\nWHCU, Cornell University, was granted renewal of license to November I,\n1946. (5/9/44)\nKWSC, State College of Washington, was given authority to determine\nOPERATING POWER BY DIRECT MEASUREMENT OF ANTENNA POWER. (5/4/44)\nThe application of Indiana University for a construction permit for a\nNEW NON-COMMERCIAL EDUCATIONAL BROADCAST STATION WAS PLACED IN THE\nPENDING FILE. (5/4/44)"
}