{
  "id": "d1697-0",
  "text": "THE NEWS\nLETTER\nBRINGING INFORMATION TO THE\nTEACHER ABOUT THE RADIO, THE\nPRESS, AND THE MOTION PICTURE\nAPRIL, 1936 • Volume I • Number 6\nTHE RADIO WORKSHOP\n\\t a quarter after two on Tuesday, February 18, a hun-\n/\\dred thousand schoolboys in classrooms from the Al¬\nleghenies to Colorado, from the Lakes to the Gulf, gathered\naround the radios in several thousand classrooms. They\nwere scheduled to hear another lesson in American history.\nWhat they actually listened to was a radio drama, written\nespecially for-them, .produced,with professional skill, acted\nby a competent cast, accompanied by music appropriately\nselected and cued. The broadcast series was entitled “Men\nWho Made History.” That day’s dramatization was en¬\ntitled “Mightier Than the Sword.” It concerned a man of\nwhom probably not one student in a thousand had heard.\nThe locale of the drama was accurately set by a fifteen-\npiece orchestra playing “Sidewalks of New York.” The\ndramatic action followed the one-man crusade of Thomas\nNast, an obscure cartoonist, against the notorious Tweed\nring. The audience heard Nast plead with the New York\nTimes for editorial support, heard an ignorant ward poli¬\ntician order all Harper-published textbooks thrown out of\nthe schools of New York to discipline the publishers for\nprinting Nast’s cartoons. They listened as Tweed withdrew\nhis support from Tilden, whom he had promised to support\nfor the presidency. Similarly, they heard Tilden turn\nagainst the ring as he delivered transcripts of fraudulent en¬\ntries in the city treasury’s books to the editor of the Times.\nThey sat in with the Times's editor as he dictated the\nstory that exploded a bombshell in Tammany Hall, heard\nthe presses turn and extras called in the street; they shared\nthe joy with which Nast read the news and the alarm with\nwhich it was received in Tammany Hall. Vicariously, they\nfelt a righteous thrill as Tweed and his henchmen were\nplaced under arrest to stand trial for the iniquities that Nast\nand the Times had exposed. This was no ordinary history\nlesson. It was history as seen by an eyewitnessj more vividly\npresented than the most able teacher could hope to.\nWhat does it mean to a grade-school student to relive\nwith Thomas Nast the heartbreaking days when he crusaded\nalone, or to follow the little-known Mark Carlton^—another\nman who made history—through days of privation and un¬\ncertainty as he watched the first crop of Durum wheat ma-\nTHE NEWS LETTER\nIS PUBLISHED MONTHLY EXCEPT DURING\nJULY, AUGUST, SEPTEMBER, AND OCTOBER\nBY THE BUREAU OF EDUCATIONAL RE¬\nSEARCH, OHIO STATE UNIVERSITY, COLUM¬\nBUS, OHIO. ENTERED AS SECOND-CLASS\nMATTER ON OCTOBER 3O, 1935, AT THE\nPOST-OFFICE AT .COLUMBUS, OHIO, UNDER\nTHE ACT OF AUGUST 23, I9I2. ACCEPTED\nFOR MAILING AT SPECIFIED RATES OF POST¬\nAGE WHICH ARE PROVIDED FOR IN PARA¬\nGRAPH 4, SECTION 538, P. L. AND R.\nEDITORIAL AND BUSINESS OFFICE, ROOM 212,\nCOLLEGE OF EDUCATION, OHIO STATE\nUNIVERSITY, COLUMBUS, OHIO.\nEditors—\nEdgar Dale\nI. Keith Tyler\nSTUDENTS from four high schools in Trum¬\nbull County, Ohio, selected after careful tests for\ncorrect speech, enunciation, pronunciation, and\nof voice quality, are broadcasting historical and\nliterary plays twice a week from station WKBN at\nYoungstown. The county superintendent, John\nC. Berg, reports that “wonderful interest is being\ndeveloped and a great deal of educational value\nis being derived” from these radio presentations.\n•\nTHE Cleveland public schools use more than five\nthousand classroom films each month. Some films\nhave been shown as many as two hundred times\nbut, thanks to care, are still in first-rate condition.\nCARRIER pigeons for the transmission of news\nmay, to the American, seem a primitive device,”\nwrites Marlen Pew in the Editor and Publisher\nfor February 8, “but I recently marveled at the\nservice leading Japanese newspapers are getting\nfrom these faithful feathered creatures. . . .\nIn Japanese cities one need only look skyward\nfrom any central point to locate a newspaper\noffice, for scores of pigeons will be seen wheeling\nover the roof, returning from assignments, or\nstretching wings in preparation for a flight.\n“Up to five hundred birds are owned and op¬\nerated by each publishing house. They are the\ntypical gray-green birds commonly owned by car¬\nrier fanciers in the United States, and are capable\nof flights of from 50 to 150 miles, carrying a news\ndispatch of photographic films. A seasoned bird"
}