{
  "id": "d1697-1",
  "text": "will ordinarily beat an airplane to the office. The\npigeon has the distinct advantage of flying right\ninto the editorial rooms, whereas the plane must\nland on the outskirts of the city, automobile or\nmotorcycle completing the transmission through\ncrowded streets.”\n•\nA STUDY of thirty-one courses of study by a\ncommittee of the National Council of Teachers of\nEnglish revealed that twelve of the courses made\nno provision for study of magazines in the class¬\nroom. Nine courses showed definite provision for\nmagazine work, and ten partial provision.\n•\nTHE cheapest locations for motion-picture work\nare at military reservations. The cheapest that is for\nthe producer. The taxpayer eventually foots the\nbill. Several alert organizations are now awake to\nthis fact. The magazine Variety reports that the\nJunior Screen Actors’ Guild, the Los Angeles Cen¬\ntral Labor Council, and the American Federation\nof Labor have complained to Secretary Woodring\nof the War Department and Secretary Swanson of\nthe Navy Department about the Government’s\nfree granting of equipment, military bases, and\npersonnel to private motion-picture companies for\nthe production of features such as Annapolis Fare¬\nwell, and West Point of the Air. Protests em¬\nphasized that studios saved tremendous amounts\nby getting the Government to pay—at public ex¬\npense—not only for talent, but also for gasoline,\nsets, costumes, and equipment. Another not un¬\nimportant point is that with such production-value\nproperties available to producers for the asking,\nit becomes all but imperative that the service be\nmade glamorous.\n•\nTHOSE interested in radio education who live\nnear Columbus should save May 4, 5, and 6, the\ndates on which the Seventh Annual Institute for\nEducation by Radio will be held on the campus\nof Ohio State University. Both educators and\nbroadcasters are invited to attend. The emphasis\nthroughout the meetings will be on techniques—\nthe “how” of radio education. Administration\nof programs, script-writing, broadcasting, class¬\nroom radio use, and adult listening groups will\nbe selected for clinical demonstration and analysis.\nAdvance copies of the detailed program may be\nobtained by writing the Institute for Education\nby Radio, Ohio State University, Columbus.\n•\nFILMS that tend to cause distrust between na¬\ntions were roundly condemned recently by Mrs.\nFranklin D. Roosevelt. Speaking before the Na¬\ntional Conference on the Cause and Cure of\nWar, held at Washington, Mrs. Roosevelt told of\nreceiving a letter from a person who wanted the\nGovernment to “do something” about such films.\n[2]\nture? If radio can inspire one schoolboy to a career one-\nhalf as fruitful as that of Nast, or Carlton, or any of our\nother biographical subjects, the experiment of Ohio State\nUniversity in educational broadcasting will have paid for\nitself many times over.\nHistory and biography are not the only fields of in¬\nstruction that the Radio Workshop of the University is ex¬\nploring for broadcasts to schoolrooms. Two discussion\ngroups have been organized. One group composed entirely\nof high-school students, under the leadership of I. Keith\nTyler, is appearing in a program series entitled “The High-\nSchool Student Talks It Over.” Four students take part\nin a panel discussion on various subjects of interest to young\npeople and about which they should be informed. . Dis¬\ncussion topics have included “Leisure-Time Activities,”\n“The Movies,” “War,” and “The High School.”\nOn alternating weeks the Workshop presents a series\nknown as “The High-School Student Looks at the World.”\nHere specialists discuss current problems. In order, how¬\never, to keep the discussion on the proper level and to re¬\nlate it particularly to the classroom and to the age-group,\nthe panel includes a high-school student who states his own\nquestions in his own language. Neutrality, freedom of speech,\nand social security have been considered in this series.\nThe Workshop has in preparation similar programs for\nnext year in history, vocational guidance, geography, and\na course in letter-writing and business English. This new\nseries is being written under Workshop direction by Uni¬\nversity students, chosen with an eye to their interests and\nfor their ability to present the material effectively. Thus\nthe Workshop gives training in script-writing while building\nits own programs for schoolroom audiences. Under con¬\nsideration for the fall, also, are plans for broadcasting open¬\ning exercises in which the school will participate, and weekly\nstate-wide teachers’ meetings to be scheduled at a time when\nsuperintendents can conveniently call their teachers together.\nIn ways such as these the Radio Workshop is endeavoring\nto serve the elementary and high schools of the state. That\nit is succeeding is indicated by the fact that twenty-five\nstations, from Pennsylvania to points^asdar wesTas Denver,\nare picking up the programs and rebroadcasting them.\nThese activities of the Radio Workshop accord with the\npolicy of its sponsors, the Bureau of Educational Research,\nthe State Department of Education, the Ohio Radio Edu¬\ncation Association, and the Payne Fund. The Workshop\nwas set up for the purpose of demonstrating what can be\ndone to promote education by radio over a state-wide area.\nIt is but one of several activities in radio which are being\ncarried on in Ohio by the co-operative endeavor of these\norganizations.\nIn promoting education, the Workshop does not restrict\nThe News Letter"
}