{
  "id": "d1239-3",
  "text": "radio programs for in-school use, 13 TV and 9 radio pro¬\ngrams for public relations, and 76 TV programs for adult\neducation. These programs were presented during the 1962-63\nschool year over local commercial stations.\n^ The University of Hawaii and the East-West Center co¬\nsponsored a festival of music and art of this century in May.\n^ The Indiana University radio and TV service announces\nthat 31 of its ETV shows are currently being shown over the\nABC station in New York City. The four series are being\naired over commercial WTTV, Indianapolis, also. Titles are:\n“The Way of the Woman,” “America—Great Issues, Great\nSpeeches,” “The Sense of Sight,” and “A Matter in Doubt.”\n^ February, 1964, is the date by which Santa Clara County\n(Calif.) hopes to be on the air on Channel 54. Plans are to\nstart out with kinescopes, filmed series, and slides with local\nlive announcements. Then in the second phase, plans call for\nmicrowave links between the transmitter site and the produc¬\ntion facilities of San Jose State College and other ETV pro¬\nducers, and also for installation of a videotape recorder. Dur¬\ning the third phase, addition of a mobile TV camera truck is\ncalled for. Organization plans name the county superintendent\nof schools as station manager, with a director of programing,\ndirector of utilization, and chief engineer directly responsible\nto him. The county board of supervisors has approved an\noutlay of $210,000 to finance the project. Now the county is\nawaiting approval from the FCC to use Channel 54.\n^ Beginning next fall, Boston University’s two radio stations,\nWBUR-FM and the closed-circuit WTBU-AM, will utilize\ncommon facilities and a single student management staff will\ncoordinate the programing and personnel of both stations.\n^ The University of Southern California’s School of Jour¬\nnalism and Department of Telecommunications will jointly\noffer “Introduction to Mass Communication” as a required\ncourse in their respective curricula. Teachers of the new\ncourse will be Dr. John M. Kittross, associate professor of\ntelecommunications, and Dr. William S. Caldwell, assistant\nprofessor of journalism.\n^ According to a survey, the New York University professor\nwho faces a WCBS-TV camera to deliver a Sunrise Semester\nlecture is addressing this composite viewer: a mature woman\nwho rises early in the morning in her suburban home, who\nowns and reads many books (her preference: non-fiction),\nwhose education and income considerably exceed the average,\nand who has owned a TV set for at least six years. The pro¬\nfile is based on 1,134 replies to a questionnaire mailed to\n3,200 persons.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Mrs. Gail Wilson, Placement Service,\nat the NAEB office in Washington.)\nAUGUST I—Young man, 22, desires position with educational\nTV or radio station as writer. B.A.; three years experi¬\nence in radio and TV. Location, except for Northeast,\nopen.\nAUGUST 2—Available for work in educational television sta¬\ntion. I '/2 years teaching experience. M.S. in radio-TV.\nFemale, 23 years old, single. Prefers metropolitan area\non East or West Coast. Salary open.\nAUGUST 3—Male, age 32, single, B.S. (radio-TV), M.S. (com¬\nmunication-film production). Desires interesting and chal¬\nlenging opportunity in educational broadcasting (radio-\nTV) or film which would utilize extensive training and\nexperience in these fields as well as public secondary\nand university extension education. Background includes\nboth educational and commercial teaching and admin¬\nistrative experience as AV specialist for state educa¬\ntion department. Currently holds valid secondary and\njunior college teaching credentials. Prefers California;\nsalary, $7,000 or higher.\nAUGUST 4—Single female desires position as ETV coordinator\nand/or teaching-directing. Work beyond M.A. Experi¬\nence at public school and college levels in speech edu¬\ncation. Graduate work in communications.\nAUGUST 5—Experienced ETV producer-director. B.S. in tele¬\nvision production. Married. Location open.\nAUGUST 6—News and public affairs addict, age 23, male,\nmarried, A.B. Dartmouth, M.S. (radio-TV) Syracuse. Vast\namount of part-time radio and television experience, very\ncreative in N&PA area. Will relocate. $100 minimum.\nAUGUST 7—Young man, 28, seeks position as producer/direc¬\ntor, producer/writer or promotion/continuity. Experience\nin both television and radio. Master's candidate. No\nlocation preference.\nAUGUST 7—Ambitious young man seeks position as program,\noperations, or station manager. B.A., about 8 years ex¬\nperience in television. Available immediately; salary\n$8,000-$10,000. Desires area with seasonal climate.\nAUGUST 8—Ten years experience as a television producer-\ndirector plus three years as executive producer. Thor¬\noughly familiar with live and film productions as well as\nover-all station operations. Married, 45, with a B.A. in\nEnglish literature. Would prefer job as program man¬\nager anywhere in the world starting at $8,500 per year.\nPOSITIONS AVAILABLE\n[In order to be considered by these institutions, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nAU-I Chief engineer to plan, install, and operate UHF edu¬\ncational television station now under construction by\nlarge public school system in the South. Transmitter,\nmicrowave and studio experience essential. Immediate\nopening.\nAU-2 Television artist for university station with daytime de¬\nvoted to in-school, instructional programing, and a\nnighttime operation devoted to adult education and cul¬\ntural programing. Station has approved activation of 5\nmore VHF channels to form statewide network. Candi¬\ndate must be experienced in all phases of television\nart. Salary $5,500 to $6,500 per year. Open September\nI.\nAU-3 Art director for large university station. Ample experi¬\nence necessary. Salary $6,600. Open September I.\nAU-4 Producer-director for university station with about 6\nyears experience. Salary $7,000. Position available Au¬\ngust I or September I.\nAU-5 Electronic engineer (general) for military television fa¬\ncility. Must be graduate of a recognized technical school\nor college in an electronics, communications, or tele¬\nvision engineering curriculum. Civil Service; salary $8,000.\nOpen immediately.\nAU-6 Art director for state ETV station. Four years of experi¬\nence in commercial art; however, will consider candidates\nwith less commercial experience if background training\nis sufficient.\nAU-7 Midwestern university seeks experienced film writer-\ndirector for social-problem TV documentaries super¬\nvised by prize-winning producer and aired by commer¬\ncial station in major market. Skill in interviewing im¬\nportant. Social science background helpful. Starting\nsalary, $6,000 to $8,000 per year depending upon ex¬\nperience.\nAU-8 ETV-AV director for city's highly successful educational\nTV system which consists of a complete ETV center. Valid\nteaching certificate preferred. Salary range depending\non education and experience $7,000 to $10,000. Im¬\nmediate opening.\nAU 9 Midwestern university is offering a Ph.D. fellowship in\nthe television area. Position is half-time in TV produc¬\ntion. 'Fellow may qualify for an additional waiver of tui¬\ntion for the summer of 1964 with the possibility of an\nadditional $500. Experience is required in either TV\nbroadcasting or closed-circuit TV production and direc¬\ntion. Salary for 10 months $2,300 (September 1963-June\n1964).\n4\nNEWSLETTER"
}