{
  "id": "d637-15",
  "text": "SECTION IV\nMUSIC KESOUHCES\nBelieving that many fine musical programs are available from\nresources at member institutions we recently embarked on such a series*\nIt now appears that the effort was somewhat premature. It is essential\nthat we first learn what is available at various schools*\nWe were unable to design formal questions that would secure as\nmuch information as we desired. Thus, we are asking you to prepare a\nmemorandum on the musical resources of your institution and community that\nmight conceivably be used for Network distribution* In this regard atten¬\ntion is invited to the Purdue report of the program committees.\nWhen this information has been assembled it is planned to work it\nover with a competent musical consultant and to plan, in long range terms,\nthe utilization of our own musical resources.\nIn preparing your memorandum you might want to keep in mind the\nfollowing points:\n1. Availability of these resources: dates, quantities, etc.\n2. What artists-in-residence are available at your institution?\n3. What musical resources are available in your community?\nU* Types of music available. (Remembering that consensus\nseems to be that we do not want to duplicate standard works\nin standard performances—which are available in commercial\nrecordings and transcriptions.)\n5. Can you append a list of recordings available in your\nlibrary?\n6. What kind of equipment and facilities do you have for ob¬\ntaining high-quality recordings of available groups?\n7* Consider all types of music, orchestral, chamber, solo\nperformances, folk music, etc.\n8. Take sufficient time to make this memorandum as complete,\nand as specific as possible. We are most hopeful that we\ncan plan some significant musical programs after the data\nhave been compiled.\n9• Indicate whether or not the items you mention could be\navailable for audition by the person planning the series.\n10. Make whatever comments you care to in regard to music pro¬\ngrams distributed by the Network, or that should be dis¬\ntributed.\n»"
}