{
  "id": "d637-33",
  "text": "-3-\nIthaca\n9/6 John Adair, Alan Holmberg\nValues, Education\nBoulder\n9A0 0» Stewart, G. Howes\nEducation, Arts\nSalt Lake\n9/12 E. A. Hoebel, J. Jennings, Henry\nFrost (sociologist), Charles\nDibble (linguist)\nLanguage, Values,\nArts, Education,\nFamily, Authority\nIn October, the Director went to Berkeley to consult with Dr. A. L» Kroeber,\nand he played shows for Dr. Kroeber and for the anthropology faculty and\ngraduate students at the University of California„\nThese sessions afforded valuable guides for developing plans for a second\nseries. Though specific criticisms were from time to time voiced, the\ngeneral evaluation of the shows as entertainment and education was en¬\ncouraging. Conferences were also held with personnel of the State Deparisient,\nof the United Nations, the Department of Interior, and others. No adequate\napplied anthropology case was available for purposes of a script, and this\nplan has been laid aside.\nThe Director met also with publishers in an effort to get the scripts\ninto print, and with Drs. Robert Merton and Charles Clock of the Bureau of\nApplied Social Research at Columbia University to explore the possibilities\nof research in the educational effectiveness of the programs. The former\nend was accomplished in the offices of the NAEB with The Beacon Press,\nas indicated. The research plan was abandoned.\nIn November, the Director went to Toronto for the production of\ntwo additional show's and again on December 30 for the final two shows,\nand to discuss detailed plans for the second series with Sinclair, who\ncontinues as writer, and with the Producer.\nSome delays have been encountered. Failure of equipment has required\nthe recutting of the Arts show, which is scheduled for mid-January. Two\nscripts have had to be rejected, but in both instances the same author\ndeveloped scripts on the same subject, using a different story line. The\nmost besetting difficulty is an old one: the problem of maintaining\ndeadlines. The natural delays in writing have perhaps been increased by\nthe distance between Los Angeles and Toronto. The fact that scripts were\nusually received in the last week before scheduled production often made\nit impossible to submit scripts to the consultants for prior evaluation\nThe most satisfactory aspect of the year* s work — aside from the\nmerit of the final product — has been the establishment of an excellent\nworking arrangement among the various partners to the undertaking. The\nwriters have had a sustained interest in the project, and they have\nconsistently fulfilled the academic demands without abandoning their own\nhigh standards of artistic excellence. Repeatedly the finished script\ncontained both intellectually and artistically more than was anticipated"
}