{
  "id": "d637-35",
  "text": "-5-\nTh© second series will depart from the earlier plans and v3.ll\nendeavor to accomplish two separate purposes- The first is to deal\ncomparatively with a single subject; the second is to communicate the\nfeeling tone of lifb in two particular cultures.\nThe subject of the first part is the nature of law and justice.\nFrom fiVB to seven shows will be devoted to this purposeEach script\nwill be based upon a real or synthetic legal case from a different tribe\nor people. The show will try to communicate the understanding of right\nand wrong, the machinery for the adjudication of justice, the allocation\nof juridical authority, and the sanctions which support the maintenance\nof law. The comparative plan should indicate the virtues and faults in\nvarious legal techniques; it should also indicate the broadening of the\nscope of law with the general progression of culture from the relatively\nsimple to the more complex. Examples will be taken from the following\n(and possibly others): Eskimo, Muragin (Australia), Samoa, Ifugao\n(Philippine Islands), Cheyenne, Tswana (South Africa), and Ashanti\n(West Africa). Professor E. Adamson Hoebel of the University of Utah\nis serving as special consultant. Mr. Sinclair will write all items\nin this series.\nThe second part will try to communicate the nature of life in\nexotic cultures; to offer the audience a vicarious ethnographic experience.\nBetween throe and five separate dramas will be developed on each of two\ncultures: Turok and Bali. Individual shows themselves will be built\nupon native stories — insofar as possible native texts — and will try\nto communicate the emotional content and the dramatic conflict inherent in\nthe cultures themselves, and to follow the logic and assumptions of the\nrespective cultures. Mr. Charles Israel of Log Angeles lias been assigned\nto write the series on the Yurok, and has been in consultation with Professor\nKroeber, The plan to use Bali was developed in consultation with Dr. Margaret\nMead. This phase of the program is not didactic in the usual sense, but\nratter an effort to communicate the feeling of life among these two selected\npeoples. Various criteria determined selection, of which the availability\nof data and special consultants and the contrasting character of the two\ncultures were most important.\n’ Every effort will be made to complete this second series of thirteen\nprograms tyy early sumer to conclude the Wavs of Mankind radio project."
}