{
  "id": "d637-41",
  "text": "February 6, 1953\nPrime Minister Pandit Nehru\ngovernment House\nNew Delhi, India\nMy dear Mr, Nehru:\nYou may recall our very pleasant luncheon and afternoon discussion\nat Government House in New Delhi one day late in July, two summers ago. I was then\ntraveling as a representative of Colonial Williamsburg, and John D. Rockefeller III\nand you were good enough to give me invaluable counsel.\nAt the time, I remember that we talked at length about Thomas\nJefferson, and about the type-script of yet unpublished Jefferson manuscripts which\nJulian Boyd presented to you at Princeton. I promised you then that I would send\nalong any special Jefferson material which seemed worth your time. Frankly, I had\nhoped that we at Colonial Williamsburg would produce a film or a publication in\nthis or a similar category, but we have not done so, although several promising\nprojects are in work.\nHowever, I hove meanwhile patched with great interest the efforts\nof a group in this country known as the National Association of Educational Broadcasters,\nwho - with the aid of a substantial grant from the Ford Foundation - have been building\na series of radio programs around the life and ideas of Jefferson. This series is\ncompleted and has just been released in album form. The work has been supervised\nat all stages by Dumas Malone, and Claude Rains takes the part of Jefferson. It seems\nto me a provocative, authentic, and exciting job, and I am sending you an album from\nus here at Colonial Williamsburg. I hope you will enjoy chem, and perhaps they will\nbe of interest also to members of your family or some of ycur colleagues. In any case,\nthe album is today on its way to you. I suppose you have rarely had such a belated\ngift from a visitor!\nWe sincerely hope that our good fortune may someday bring us a\nvisit from you to Williamsburg. We believe we have in this city h project which is\ndedicated to the same ideals of self-government and freedom which you and your\nGovernment hold important.\nWe have had many visitors from India here in recent months, as\nfriends and as participants in forums and discussion groups, and as unannounced sight¬\nseers. We were also proud to have India prominently represented in a special display\nwe assembled last year around the theme of individual liberties^ Our exhibit stressed\nthe right to vote freely, and the remarkable record of India in the last general\nelections was dramatized by a ballot box sent us from New Delhi. Your representatives\nwere so anxious to be democratic that they sent us the ballot box used by one of the\nparties opposing the Government!\nWith kindest personal regards, and vith the hope that you will\nenjoy the delayed remembrance, I am\nSincerely yours,\nJohn C. Goodbody\nCOPY\nCOPY\nCOPY"
}