{
  "id": "d637-58",
  "text": "mm ms betwqek\n4-30-53\nPROGRAM OFFERING PROGRAM OFFERING\nTO t ALL MSB STATIONS\nFROM: NAEB HDQ,\nHE t SCHOOL PROGRAMS: KNOW YOUR NEIGHBOR\nTHEN AND NOW\nI This memo constitutes an offering of two more In-School series for Pall broadcast*\nA® 853-2 Know Your Neighbor (Or* 7-10) KBPS, Bss Moines 13 prog*\nB0 S53-3 Then and Now (Gr. 7-10) Indiana University 14 prog.\nII These two aeries are offered in the following manners\nA« Ion will receive together with Issue #19 —\n1. On one reel* a recording of programs #3 and #4 from the series\nKnow Your Neighbor (S53-2)\n2® On one reel* a recording of programs #3 and #4 from tha series\nThan and Now (853-3)\n3* Manuals for the two series are included with this offering. If you do not\nwish to receive either series* we would eppreciate the manual*s returns\nG® Deadline: If your station wishes to receive either or both of these two\nsorios* it roust send its acceptance to Network Hdq. by 5 P»m» OPT*.. June !*\nThis is the deadline for acceptances of Know Your Neighbor and Then and Now.\nB« If your station wishes to receive either or both of these two series*\nkeep the tape (or tapes) with urograms n'3 and #4 or dab them. Hdq. will\nsend you the remaining tapes of the series as soon as possible*\nE* Important: Nhsther or not you wish 'bo receive these series* pleas© return\nthese two tapes or two exchange tapes within seven days.after you receive\nthem,\nWhether you wish to receive the so series or not—we roust have a return cf\ntwo tapes within 7 days. Thanks for your cooperation.\nIII If yon accept either or 'both series:\nHdq. will send you the remaining tapes from each scries as soon as poss¬\nible. Late this spring to. those stations still open5 late summer to those\nstations who have closed down for vacation.\nB. ^itfain 7 days after you receive these tapes completing the series* please\nreturn them to Hdq* or send tapes in exchange. Report: Return or exchange.\nIV If you are not Interested in any in-school broadcasts* please let us know im¬\nmediately. Me will not send you any further in-school program offering. Ahis\nwill save you bother and us tape* Thanks.\n“T«\"' Please remember.\nA. “he deadline is 5 p.n» GDT. June 1.\nB. Return or Exchange within 7 dyas.\nG® Notify us if you are not interested in In-School broadcasting."
}