{
  "id": "d637-72",
  "text": "COPY\nCOMMITTEE FOE FREE ASIA, INC,\n105 Market Street San Francisco 5, California\nAugust 10, 1953\nMr* Harry J* Skoraia, Executive Director\nNational Association of Educational\nBroadcasters\nUniversity of Illinois\n119 Gregory Hall\nUrbana, IlXo\nDear Mr* Skomia;\nWe have just received two audition tapes from Mr* Goralski and we are\nsending both of them under separate cover* Both were recorded in Japan*\nIn both, Mr, Goralski used ttAsia Today” as the series title but\nthis can easily be changed to nVoices of Asia1** We agree with you that\nttVoices of Asia” is a more appealing title and have notified Mr* Goralski\nto use this title in his introductions and closings ir. the future.\nWe listened to both auditions and found the one dealing with economics\na sound program but somewhat dragging* Ahe other one, dealing with Japan¬\nese culture, had much more sparkle, although the levels here end there were\nnot what Mr, Goralski desired.\nWe are anxious to learn of your evaluation of the two audition tapes,\nELease let us have your comments and any suggestions that you can think of\nin order to guide Mr* Goralski and help him ccaaa through with interesting\nshows. Wo are sure that you fully realize the problems that must crop tap\nwhen recordings are made in Asia, especially when most of the engineers\ndoing the recording do not have a knowledge of English and thus have con¬\nsiderable difficulty in maintaining the correct levels®\nThe tapes were recorded at 7|- ips as the Japanese were unable to\nrecord at 15 ips. It seems that in the other areas we are likely to run\ninto the same problem*\nMr* Goralski is due to depart from Jap/ n at the end of this month and\nthus we would appreciate hearing from you at an early date, especially if\nyou desire some changes*\nWe will shortly complete work on publicity releases and will sand\nyou the drafts after which we can make arrangement for joint releases®\nWe have told Mr, Goralski to record a xr&nimma of 39 half-hour (SIC)\nbat have also suggested that if he could record up to 52 programs without\ntoo much difficulty, he should do so®\nYours,\n// signed //\nMilton Chase, Deputy Director\nProgram Services"
}