{
  "id": "d637-86",
  "text": "TOs Officers and Directors\nNovember 39 1953\nFROM: Harry Skornla Xk-\nIn trying to pull loose ends together at headquarters, following absence for Oklahoma\nConvention, herewith Statement of Status of French (RTF) programs prepared^\nfor HAEB, as seen from here, and pulled together by John Holt and me. This will help\ncomplete the report from Sy of October 19 which we have found on our return.\nFrench\n^ All programs listed in the promotion brochure (Comedie Francaise #1-13):\nContemporary French Music 13 programs? Great Writers of France (Hugo, ?\nBalzac, Stendhal, Vigny and Musset) have all been distributed.\n2) We are currently distributing the second 13 programs from the Comedie Francaise\nWe have distributed the first throe (Comedie Francaise #14, 15, and 16, which\nare your new numbers 3a, 4a and 6n). 9\n3) We have distributed the first 7 of 13 French Music Festival Programs and the\nrest are going out regularly as snheduled. K\n4) French programs have been distributed in a steady stream since late last spring.\nThey are released as soon as we have full series at Headquarters, sometimes before:\n™dl»™q»wikty W! CaJ.flt the\": 11140 our production schedule. In some eases\na Sa4her oareffLly to see when we had a whole series since\nsome have consisted of 7 or so rather than the 13 usually offered.\n^ foll°WinS ProSrams are a-t Keadqvarters but have not been released as vet.\nThese programs have almost all been leceived within the last two or three weeks.\nA) Comedie Francaise #17-26 (to complete the second series)\nB) Modern French Theatre #1-4 only (of a series of 13)\n0) Ancient and Modem French Music #1-5 only (of a series of 7)\nD) The French Academy #1-6 only (of a series of 7)\n6) Great'Fr^oh^t^!61' reC®iV'J<i for two serle,Sj Great Composers of France and\n7) One program not listed in any series on tie dittoed sheets has been received-\nFrench Concert, \"Le Mysore des Saints IMnocents\", by Henri Barraud (Time:56l40)\nItalian\n1} ElSsS!17 #1\"* “d #9 10 ynl7 ***teen r9oeived'as 1165\nOthers\n^ received something called* \"New York Fro i^cica Antiqua,\" 13 programs\n(What is this, Sy? We have no advance material to ter» u8#)\ncc* George Probst\nRobert Van Duyn\nLarry Creshkoff"
}