{
  "id": "d952-169",
  "text": "c o p y\n(8) FUNDAMENTAL ASSUMPTIONS UNDERLYING NAEB BOARD OF DIRECTORS OPERATIOl\n1* The Board is responsible for policy and program.\n2. The President is responsible for the administration of the\nBoard*s policy and program, except as to responsibilities\nspecifically vested in other elected officers by the\nConstitution and By-laws.\n3. Under the President’s general direction and supervision\nthe Executive Director and other appointive officers shall\nadhere to the policy and program laid down by the Board.\n4. All the elected and appointed officers shall keep each\nofcher informed as to those of their actions affecting the\nduties of any other officers.\n(l) Except as noted in footnotes below the Board adopted\nwithout change the Executive Committee's statement of:\n(2) RELATIONSHIP BETWEEN THE BOARD OF DIRECTORS AND THE NAEB\nEXECUTIVE DIRECTOR\nThe relationship between the Board of Directors and the\nExecutive Director is that of a policy forming board and a\ndirector of operations. The duties and responsibilities of\neach may be further defined as follows:\n(1) The organization's budget (including the Kellogg budget)\nshall be set by the Board. Money is to be expended only\nwith the prior authorization of the Board of Directors.\n(2) Acting in accordance with Board of Directors general\npolicies and specific directives, the Executive Director\nshall report to and consult currently with the President\nas to his progress in carrying out the directives of the\nBoard. In the event interpretation is necessary, the\nPresident shall provide insturctions to the Executive Director\nas to his duties. The President and Board shall from\ntime to time review the work of the Executive Director. 1\n(3) The Board adopted without content change the Executive\nCommittee's statement of:\n(4) ABSIGNMENTS GIVEN TO EXECUTIVE DIRECTOR\n1. Headquarters Functions\na. The Executive Director shall supervise the\norganization's headquarters, including the operations\nof the tape network.\nb. He shall prepare a headquarters operational manual.\nc. He shall organize the files of the organization,\ncompile and maintain a membership facilities list, and col¬\nlect membership data."
}