{
  "id": "d952-170",
  "text": "a. The Executive Director shall facilitate the exchange of\ninformation about educational radio and television among\nthe members. He shall distribute NAEB publications\nand other radio-television materials to the membership\nIT The Executive Committee*s draft of this paragraph read as\nfollows: \"Acting in accordance with the Board of Directors\ngeneral policies and specific directives and others as\noccasion demands. He shall prepare a monthly News-Letter\ncolumn and in other ways report to the membership on radio¬\ntelevision developments. He also shall disseminate information\nabout employment opportunities and requirements to the\nmembership.\n2. When he deems it necessary or when so requested by the President\nthe Executive Director shall attend NAEB committee meetings.\n3. The Executive Director shall share responsibility with the\nRegional Directors for obtaining new members.\nA. The Executive Director, in consultation with the Treasurer,\nshall prepare an annual budget for the consideration and approval\nof the Board of Directors. This budget will be administered\nby the Executive Director with the advice and counsel of the\nExecutive Committee. The Executive Director shall submit to\nthe Board of Directors periodic reports of expenditures,\ntogether with projections of estimated future expenditures,\nthese being subject to the approval of the Board. * 1\nthe President shall provide instructions to the Executive\nDirector as to his duties. The Executive Director shall\ncarry out these instructions informing the President currently\nabout his activities. The President and the Board shall\nfrom time to time review the work of the Executive Director.\"\n1. The Board of Directors, by unanimous vote, removed from this\nstatement of assignments the following paragraph from the\nExecutive Committee^ original. (This did not indicate\ndisagreement with the instruction, however, but rather the\nfeeling that the Board*s attitude about this could better\nbe expressed informally than through a formal statement:)\n\"The Executive Committee recommends that the Executive\nDirector visit member institutions only in the course of\nbusiness trips taken primarily for other authorized purposed,\nand that he assign to such trips a lower priority of\nimportance than the performance of the headquarters function\noutlined elsewhere in this statement. When he does take such\ntrips he shall make reports to the Board of Directors as to\nhis itineraries and observations.\""
}