{
  "id": "d952-18",
  "text": "SERVICES\nPROFESSIONAL ADVANCEMENT\nSince 1951 NAEB has conducted over 20 educational program production and broadcasting\nworkshops and seminars to provide intensive professional training for members. These conferences have\nconcerned themselves with such diversified subject areas as: TELEVISION production, program planning,\nstation management, staging and lighting, engineering, and children's tv programs .... RADIO pro¬\ngram planning . . . audio and video recording . . . in-school program planning . . . in-school writing\n. . . educational broadcasting philosophy and research . . . and instructional uses of radio-tv.\nSince 1954 NAEB has awarded 94 scholarships to educational broadcasters to permit advanced\nstudy through regular academic courses or through attendance at summer workshops-in radio and\ntv conducted by recognized institutions of higher learning. Approximately 500 educational broadcasters\nhave advanced themselves professionally through these scholarships and the above mentioned workshops\nand seminars.\nSince 1956 NAEB has awarded 25 workshop grants-in-aid to educational institutions to p'ermit\nthem to bring in outstanding consultants or faculty members in order to upgrade the caliber of their\nworkshops. This assistance (together with scholarships) has enabled some institutions to develop new\nprograms or to expand their summer workshops by providing truly professional training.\nCOMMITTEE ACTIVITIES\nThe basic strength of the NAEB is in volunteer\nwork of more than one hundred committee mem¬\nbers who devote time and energy to the Associa¬\ntion. Committees conduct surveys, prepare and edit\nworkshop and seminar reports, screen program and\nresearch grants-in-aid applications, publish program\nand technical reports and bulletins, audition and\nselect NAEB Radio Network programs, assist in\nfinancial planning, serve special interest group\nneeds within the membership, plan, conduct and\nselect those to attend workshops and seminars,\nadvise on publication and public relations, and assist\nthe Headquarters staff with day-to-day operations.\nTypical NAEB tv workshop where members engage in\nactual production activities. A report on this Michigan\nState University — WKAR-TV workshop is available on\ninquiry to NAEB headquarters.\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS"
}