{
  "id": "d952-46",
  "text": "- 12 -\nstation are such that often the time available to the News Bureau does\nnot permit it to do everything the station would like. On the other hand,\nmost News 3ureaus give the stations solid assistance in certain areas.\nThe comments by the Class I respondents are valuable in this respect,\nif only to illustrate the contrasts in the help received from the most\naggressive (and perhaps better manned) News Bureaus with the situations\nwhere practically no liaison between the stations and News Bureaus is\nevident.\nThe question — \"What help do you receive from your institutions\nNews Bureau?\n-^^We have cordial relationship, but not too much real help.\nThey feel they have many other responsibilities. If we\nhad larger coverage, it might be different.\"\n\"Part of P.R. salary, picture expenses, advice.\"\n\"Regular new stories concerning programs — very helpful.\"\n\"Excellent cooperation—almost weekly articles in University\npaper—Public Relations Office News Releases and releases\nthrough Athletic Public Relations.\"\n\"Fine cooperation.\"\n\"Use of their mailing lists for specific stories, and help in\nfiling stories in all media,\"\n\"Mechanical aid in duplicating and distributing stories; also\nphotographic assistance.\"\n\"Occasional photographic aid.\"\n\"We usually prepare our own copy and release it locally (radio),\nor through state office (TV); but special radio stories,\nfeatures, pictures, etc. generously given by News Bureau,\nwhich also provides news and personnel for two weekly shows.\"\n\"Yes.\"\n\"None.\"\n\"Very cooperative when called upon.\"\n\"We work closely with them—they handle many of our news releases\n, —we use much of their material.\"\n\" \"We have to convince them that papers will publish. We get\nreleases when we have a really important story, are permitted\nno release on our own, must be through them. We are not happy\nwith the arrangement.\"\n\"Regular help. Announcements of special features, new programs, etc.\"\n\"Substantial, whenever other than TV editors are involved.\"\n\"They circulate all stories on new program series, special features,\nand staff members* personals.\"\n\"They are very cooperative. We publish a daily ’capsule news\nsummary' with their help.\"\n\"Under immediate common management and housed in adjacent space.\"\n\"Complete cooperation iH distribution. Some editing.\"\n\"Very great help if we ask.\"\n\"No out-and-out help, but excellent cooperation in whatever we\nneed. Bureau handles stories with definite University\nimplications.\"\n\"All off-campus publicity and promotion is cleared through Info\nService Bureau. Most stories are created by station's staff.\"\n\"The (college) News Bureau prints anything describing new major\nw programs.\"\nw\"Very little. We have been low-power. Audience is very local."
}