{
  "id": "d952-5",
  "text": "services\nmembership\nTo its “individual” members, the National Association of Educational Broad¬\ncasters offers front-row participation in a twentieth-century phenomenon—the\nunion of education and broadcasting. To help keep up with developments in\nthe field, members receive a monthly Newsletter ... a bimonthly Journal . . .\ndigests of research . . . and other periodic publications. There are workshops . . .\nseminars . . . regional meetings . . . the annual national convention . . . pro¬\ngramming and research grants-in-aid . . use of the placement service ... re¬\nsearch, surveys, and reports in all phases of educational broadcasting.\nindividual membership of the NAEB has grown from 300 in March, 1959, to\n529 as of December, 1959—an average growth of 25 per month. Individual\nmembers are individuals seeking to promote educational, cultural, and public\nservice broadcasting. Many are engaged in educational broadcasting, in teaching\nbroadcasting courses, or in utilizing broadcasting in the classroom. Regular\nindividual memberships are $7.50 per year. Bona fide graduate or undergrad¬\nuate students may join for $5 (with the student’s advisor signing for him). If\nstudent applications are sent in groups of ten or more at one time, each student\nmay join for $4, and the instructor will receive a free membership.\norganizational memberships include, educational institutions and organizations\nwhich own and operate educational radio and/or television stations (actives) ;\nsuch educational groups which produce educational programs independently or\nwhich operate closed-circuit television installations (associates) ; and other\norganizations interested in general educational broadcasting development\n(affiliates, sustaining members, industrial associates, and international\nassociates) .\nThe NAEB began 35 years ago, as a loosely knit organization of a few pioneers\nin educational broadcasting. As the only professional or trade association in\nthe field, throughout the years it has worked to improve the professional status\nof the educational broadcaster—and the quality of educational programming.\nNine years ago, members established a tape distribution network for educational\nradio. This self-supporting network today supplies over a hundred educational\nradio stations with ten hours of programming a week. You can help further\nthe national effectiveness and development of educational broadcasting by\njoining the NAEB.\nbackground"
}