{
  "id": "d1691-25",
  "text": "24\n1 lo\nBloomington Survey\nAo Procedures*\nBecause all Bloomington residents with telephones, and many without\ntelephones*have had frequent contact with radio and other University\nsurveys before, and have developed considerable tolerance for such\nsurveys the questions asked in this part of the survey series were\nmore numerous than for the home town survey 2056 of the approxi¬\nmately 6000 residence telephone homes in the Bloomington directory\nwere called by the coincidental method this year as compared to last\nyear's 5481 completed calls. The questions asked were\n1 Do you live in town or in the country?\n2 What is your occupation, please? (Or that of Mr„; Mrs., Miss.\nname of person listed,)\n3, How many radios do you have in your home?\n4 Do you have a car radio?\n5, Do you have an FM receiver, capable of reception now: please?\n6C Do you think radio is getting better or worse?\n7. What is your principal objection to radio?\n8= What do you like best about it?\n9 is your radio on now?\n10, (If on) What station and program is it tuned to. please?\n11- What do you think of it (the program you are listening to)?\n12 How many are listening to it, please?\nThe cal lee was then cordially thanked,, and the.1nformation received\nwas recorded on typed cards for detailed checking and alphabetseal\nfiling, to prevent having the same persons.called again for other\ntypes of radio surveys contemplated later in the year, and charts\nwere prepared as for the home town survey.\nIt should be pointed out that Bloomington, with a population of\nsome 3O.OOO and two years ago without a radio station, now has in\noperation two commercial stations, both non-network, plus an\nexperimental, high-frequency AM station receivable on either special\nadaptors or FM receivers.: and CPs for another AM stat.on,, two FM\nstations and a television station In comparing the 1 stenership\nof the two operating AM stations it should of course be remembered\nthat WSUA is a 1,000 watt, daytime station, whereas WT0M is a 100\nwatt full -time stat ion\nAs to out-of-town stations, reception is fairly good for NBC.and\nCBS stations fair for MBS, and relatively undependable at night\nparticularly, for ABC Several FM.stations are beginning to be\nheard in this area although the first Bloomington FM station\nscheduled WSUA FM is not yet on the air or even under constr¬\nuction This plus rather active promotion earlier of the experi\nmental station intended to show the superiority of high-frequency\nAM over FM makes for a rather special FM situation in the area\nsurveyed\nOccupational classifications are the same as for the first\nportions of this survey\nB Results!\nThe specific numbers of calls for'each of the periods and occupa¬\ntions involved, are listed in the following tables eliminating the"
}