{
  "id": "d1691-8",
  "text": "7\nIHOIAKA UNIVERSITY SECOND ANNUAL RADIO LISTENER SURVEY\nThis year, for the second time, members of certain Radio classes at\ni Indiana University were assigned to conduct.e telephone survey of radio\nlistening, j It Is our belief and hope that such surveys have a number of\nvaluesi\n, A, To the student, in acquainting him with a cross-section of the\naudience he hopes to broadcast to some dayr and in demonstrating\nsome of the problems confronting commercial broadcasters, and\nreasons back of present operations. Students maintain they learn\na great deal from these surveys. Their understanding of the\nmeaning of 5!the people* and of radio operation is. greatly increased\nby them, by talking first-hand to a cross-section of unknown\nlisteners,\nB. To the community in that being asked about radio causes listeners\nto think about it and reminds them that they are the ones who\ndetermine radio's offerings,\nC, To the Industry in that, on the basis of our experience, these\nsurveys represent the answers to a number of questions not evident\nin the usual quantitative or telephone survey, without pretending\nto be the final authority on listening habits anywhere.\nWe believe that this survey Is considerably improved over the first,\nexperimental survey of last year, and it is our hope that it may be of more\nvalue to all the interests it seeks to serve.\nBriefly, this year’s survey involved three separate sections;\nA survey of his home town listening by each of 64 selected\nstudents during vacation periods, from December 19, 1947 through\nJanuary 4, 1948, The results of this survey, given fsrstP are\npresented as briefly as possible, since it covers only a few^\nselected periods of the day and week, and was not as carefully\nsupervised as part two, below.\nFrom the point of view of the students, it taught them Impartial\nsurvey procedures, techniques and problems, and prepared them to\ndo, more accurately and completely, the later sections of this\nsurvey series. Consequently^ although interesting and as accurate,\nas such a b-^-Ief survey can probably be. this section is a far less\nstatistically valid or cross-sectional study than the Bloomington\nsurvey, It does provide a basis of interesting comparisons for\ndifferent geographical areas.\n2- A more detailed survey of Bloomington listening by a considerably\nenlarged and carefully supervised group of students, enrolled on\nthe Bloomington campus, from January 6 through 16 1948,\n3. This same survey as for Bloomington was also run for!Indianapolis\nand surrounding communities in its coverage area at the same dates\nby a smaller group ofrmore mature students enrolled on the\nIndianapolis campus-\ni Home Town Survey\nA Procedures!\nBecause a large portion of these calls were to be made during\nthe holiday season and also because we believed this would be\nthe first such survey taken in many of these areas, fewer questions\nwere asked than for the two later portions of this series of\nsurveys- The persons called by the coincidental method from the\ncurrent telephone directory were asked\n1. Do you live In the city or in the country? (To ascertain\nrural vs. urban listening. This question was not asked In\ncompletely metropolitan areas, like Brooklyn, for example,)\n2o What is your occupation (or that of Mr,_„ Miss.__0\nMrs._(name of person listed)) please?"
}