{
  "id": "d732-101",
  "text": "at present. These stations will \"be located in Albuquerque\n(Channel 5 presently broadcasting), Las Cruces, (we are\nnow investigating an assignment of a VHF channel to that\narea for New Mexico State University and the New Mexico\nState Department of Education), Portales (where we will\nalso request a VHF channel assignment), and Gallup (where\nChannel 8 is now reserved for education). The station\nat Gallup will be owned and operated by the State\nDepartment of Education and the Indian Agencies. (The\nchannel will be concerned with television for educational\npurposes for the Navahoe, the Zuni, and the Hopi Indian\nReservations.) Roswell has an assignment of Channel 3\nfor educational purposes and will be the last of the VHF\nchannels to be activated. It is planned that the Roswell\nchannel will be activated in about five to six years.\n2. UHF low-power service. Each of the institutions of higher\nlearning will need from two to four UHF channels assigned\nfor institutional use. Albuquerque will request eight\nUHF channels, four each for the Albuquerque public schools\nand the University of New Mexico; Las Vegas with Highlands\nUniversity will need two to four UHF channels; Portales,\nwith Eastern New Mexico University will need two to four\nchannels. Roswell, with the New Mexico Military Institute,\nwill need two UHF channels; Las Cruces with New Mexico\nState University will need four UHF channels; and Silver\nCity with New Mexico State Teachers College will need four\nUHF channels. All of these channels will be operated on\nlow-power for specific local broadcasting.\n3. Translator networks for the VHF outlets. We will have\n20-24 translators not including those necessary for the\nIndian Reservations.\n\"These three systems will afford New Mexico 95$ coverage with\na guaranteed signal strength above 1,000 microvolts to each\nreceiving antenna. In summary the state of New Mexico will\nneed in addition to its present station, three VHF outlets,\n20-24 UHF outlets and 20-30 translators to adequately serve\nthe state with television for educational purposes,”\nWith such a detailed plan, and with organized support from the\ngovernor, the state legislature, and the combined educational community\nin New Mexico, that such a plan makes full provision for the future\ngrowth of the state.\nNEW YORK\nNew York is the largest state in population. It has seven large\npopulation centers and, with the exception of the New York city area, the\nlarge population centers lie in a line east to west through the north-\ncentral portion of the state. Approximately 85$ of its people live in"
}