{
  "id": "d732-102",
  "text": "- 95 -\nmetropolitan areas* But, significantly, while the state in the past ten\nyears, was increasing in population by 13$, its major population centers\nwere losing about 2$ of their population. Suburban areas surrounding\nthe central cities of the metropolitan areas during the same period\nincreased in population by 68$. These figures are particularly pertinent\nto the distribution of educational opportunities and instructional facili-\nNew York has 125 four-year colleges and universities with a total\nenrollment of 360,000 and 22 two-year colleges with an enrollment of\napproximately 26,000. Its public school enrollment is approximately\n2,700,000. J\nas a s^te and through its university system, made the\nirst large effort to take advantage of the educational television reser¬\nvations and tried to activate the channels reserved there. Many different\norces have moved to prevent the wide-spread development of educational\ntelevision until this time.\nThe Regents of the University of New York have urged the development\nof educational television since 1950. They believed then and are more\nconvinced now, that television presents an unusually effective means of\nextending an improvement of educational opportunity.\nIn 1952 the Regents requested and received, from the Federal\nCommunications Commission, construction permits for 10 UHF stations\nstrategically located throughout the state. These stations were intended\no serve as a nucleus of a state-wide educational network, that would\nserve both the classrooms of the schools, as well as the homes of the\nstate. However, state funds were not forthcoming and the 10 construction\nAt Cortland, New York, the Regents were able to establish a closed-\ncircuit television system in which the schools of the city and certain\noutlying areas are connected by coaxial cable. A special feature of this\nparticular experimental project is a talkback system. Similar projects,\nused in ^he gaming of teachers, were also initiated by the Regents in\ntwo of the State Colleges of education. Through the efforts of the\nDivision of Educational Communications of the State Education Department,\nseveral other locally financed projects have been started, or are in\nvarying stages of development.\nThe Regents are convinced that only through a systematic plan of\nstate support can this medium reach the level of use in education it\ntoSstIm,n«+ a^al?‘ hav® proposed that the stat® Proceed immediately\nto stimulate the further development and use of educational television in\n1. Providing financial assistance to school districts for\nthis purpose;\n2. Contracting to assist state-approved local area educa¬\ntional television councils;"
}