{
  "id": "d732-109",
  "text": "In February i960, the Governor appointed a nine-member commission\nto make this study and report back to the Legislature in 1961.\nThe study brought out that 10 universities in the state were using\ntelevision facilities, of one kind or another, and that four of these\ninstitutions had access to educational broadcast stations. The study\nfound that a number of organizations had been formed among communities\nand school systems that were planning early development of educational\nfacilities. In addition to the four stations on the air, the study\nlearned that four additional stations were in the advanced stages of\nplanning.\nThe study discovered that 97$ of the residents of Ohio are within\na 25-mile radius of a college or university, and that the total colleges\nand universities are servicing well over 160,000 students, a number\nexpected to double during the decade ahead,.\nThe Interim Study Commission recommended to the 1961 Legislature\nthat legislation be enacted to create an Ohio Educational Television\nNetwork Commission, and to invest it with the authority and the funds\nto proceed with the establishment of a state-wide educational television\nnetwork. It further recommended that the Educational Television\nCommission have the authority to own and operate educational transmission\nand interconnection facilities, or to contract for interconnection facili¬\nties, for an educational television network; and to establish standards\nfor such facilities, whether owned or leased; to execute contracts, and\nto determine the programs to be distributed on the network, with the\nadvice of an advisory program board composed of educational representa¬\ntives in the state as well as educational broadcasters.\nThe Commission further recommended that sufficient funds be appro¬\npriated at this time to the Ohio Educational Television Network\nCommission, and implementation and operation of the first phase of the\nproposed network be undertaken during the next two years.\nAfter a thorough engineering study, the interim commission report\nrecommended in summary a plan for a single basic service for the state:\n\"SUMMARY\n\"A plan has been developed, in four phases, illustrating one\nmethod of providing a state-wide educational television\nbroadcast system for the state of Ohio. The examples of studio\nproduction center development have been outlined and integra¬\ntion with the existing broadcasting facilities has been dis¬\ncussed.\n\"A total of 29 UHF stations, including six low-power\ntranslator-type stations has been envisioned. In order\nto implement the plan fully it also would be necessary to\nrequest the addition of certain other UHF channels to the\ntable of assignments of the Federal Communications Commission."
}