{
  "id": "d732-114",
  "text": "- 107 -\nVw\nL,\naxis of educational television facilities would be\nestablished at the center of the state. Branch links\nand stations could be built for other densely populated\nparts of Pennsylvania as these facilities become\nfeasibleo This would, in time, serve as a major edu¬\ncational communication link between the cultural centers\nof the northeast and those of the midwest, in bringing\nabout a reciprocal exchange of programs of incalculable\nand mutual benefit.\n\"Moreover, the telecast area adjacent to Pennsylvania\nState University is the home of one million people.\nWithin a radius of 25 miles of the University there live\nabout 155,000 people, of whom 35,000 are children of\nschool age. The enrollment figures here at the University\nin 1959-60 were 20,377 under-graduates and graduates.\nMost of these students are in residence for the greater\npart of four years. The educational lives of most of these\npeople could be enriched by judicious supplementary use\nof Channel 3.\"\nThe Federal Communications Commission in a report and order effect¬\ning short-spaced VHF assignment issued in the summer of 1961 dismissed\nthe petition of Pennsylvania State University as being inconsistent with\nthe policy of promoting greater use of the UHF band of frequencies which\nit established at this time.\nIn further extension of broadcast television in Pennsylvania,\nPhiladelphia has applied to the Federal Communications Commission for\nuse of Channel 12, assigned to Wilmington, for general broadcast of\neducational and instructional programs, in addition to Channel 35 which\nit now has on the air. This application is in hearing and the decision\nof the Federal Communications Commission is pending as of this writing.\nSix Pennsylvania colleges and universities indicated in the general\nsurvey that they are now using instructional television in some from,\n11 colleges and universities indicated that they plan to use it, and 20\nindicated that they were recognizing future need for the use of broad¬\ncast television in their planning. Twenty school systems indicated that\nthey now use instructional television and seven of the respondents indi¬\ncated that they plan to use it.\nDr. Marcus Konick of the Pennsylvania Department of Education sees\na continuing need for the use of educational television for the in-\nservice training of teachers, the sharing of college and university\nfacilities, the up-grading of curriculum in many areas where there are\nshortages of teachers, the teaching of home-bound students, and adult\nand special education.\nDr. Konick believes that the need for broadcast television will\nincrease because of the exploding population, the necessity of increasing\nskills and restraining the technologically unemployed in the community,\nthe general and continuing teacher shortage, and the general increase in\nthe length of our mean education."
}