{
  "id": "d732-124",
  "text": "- 117 -\nIn projecting a minimum number of additional channels potentially\nneeded in Texas, serious consideration must be given the great distances\nto be covered and the sparse population in certain areas of the state,\nand to demonstrated local needs.\nIn Alpine, Texas, for instance, the state teacher training insti¬\ntution indicated it has a real and serious problem in providing in-service\nteacher training for its very widely scattered school systems in that\narea of west Texas. A channel needs to be provided for the Alpine area\nfor the future3 Odessa and Midland are in somewhat similar situation.\nSan Angelo does not now use its reserved channel, but if the needs of\nthe area are served, it will be used in the future, and an additional\nchannel needed. Abilene has no reservation, yet both the Abilene and\nSweet Water areas have particular problems of scattered population.\nIf the presently developing, cooperatively interlocked, educational\ntelevision system in Texas prevails; if the reserved channels in north\nand west Texas and the Panhandle are activated as anticipated; then in\nthe light of the State University and University of Houston indications,\nall of these channels will have to be at least doubled for in-school\nservice and the collateral services which will be demanded. On this\nbasis, a minimum of 52 additional channels for future use in Texas is a\nconservative projection.\nUTAH\n* *.uUtax !?aS three large Population centers in the north-central portion\nof the state, practically adjoining one another, and very little popula¬\ntion elsewhere. It has four four-year colleges and universities and three\ntwo-yeer colleges with a combined enrollment of approximately 31,000. Its\npublic school enrollment is approximately 215,000. At present Utah has\nfour reserved channels. They are Channel 46 in Logan, Channel 18 in\nOgden (now operated by the Weaver County Schools), Channel 29 in Provo,\nand Channel 7 in Salt Lake City (now operated by the University of Utah).\nUtah State University in Logan has purchased from commercial interests\nthe construction permit for Channel 12 in Logan and intends to activate it.\nBrigham Young University in Provo has indicated that it will probably try\nthatatLC^el U **ovo changed to a reserved channel. This indicates\nthat the four communities with reservations in Utah soon will be served.\nHowever, vast areas of the state remain unserved. Unfortunately, popula-\n^°n +S+Sparm? and scattered throughout the eastern and southern part of\nthe state. These people need educational television coverage more than\n-in lh*Se in di®t^icts* A combination of microwave and translators\nin the communities of Sprice, Roosevelt, Vernal, Richfield, Cedar City\nSt. George, Moab, Landing, Panguitch, Delta, and Fillmore would provide\nthem the best coverage.\nThe survey found great interest in a state-wide dual channel facilitv\nauthori^fl e” U*Sh that they should broaden the number of channels\nauthorized for translators in the UHF band. There is also great interest"
}