{
  "id": "d732-125",
  "text": "- 118 -\nin the multiple channel operation at the University of Utah where Channels\n71 and 74 are to he operated as standard broadcast stations even though\nthey are only operating on 10 watts of power. Experience has been that\nwhere the low-power channels have been operated by competent engineers,\nthe units have put out an excellent quality signal.\nEnlarging the block now reserved for translators with a special\ngroup set aside for educational use would meet much of the state-wide\nproblem. Operational costs could be sustained by the counties.\nDr. H. Grant Vest, Director of the Utah Coordinating Council of\nHigher Education, writes:\n\"The Coordination Council of Higher Education anticipates an\nincreased need for channel space and for extensive state-wide\nplanning for educational television in Utah. In discussion\nof this matter in connection with budget requests via the\ninstitutions of higher learning, prior to the meeting of the\n34th Legislature in January, 1961, the Council noted that\nthe system of higher education in Utah will have to establish\nmany innovations in order to bring high quality, low cost,\ncollege level training in the volume and diversity antici¬\npated years ahead. The Council regards educational televi¬\nsion as one practical innovation that may help achieve these\ngoals of higher education. Educational television is also\na vital means through which the higher institutions may\nserve the elementary and secondary schools and the people\nof the state. No doubt, it will take a considerable time\nto develop plans for looking toward the establishment of a\nstate-wide educational television network linking all the\neducational television units into a common program. There\nought to be state level coordination, within a program of\nstate regulations and continuous planning. The institutions\nof higher education, and certain strategically located\nschool districts can operate their separate systems on a\ncooperative basis.\"\nDr. Daryl Chase, President of Utah State University at Logan,\nwrites:\n\"At present we have the construction permit for VHF\nChannel 12. UHF Channel 46 also is, at presemt assigned\nas an educational reservation for our area. These two\nchannels, it appears, should meet our immediate needs, so\nfar as channel allocations are concerned. In future planning\nIt would seem that we here at Utah State University must look\nin two directions: 1. The increasing use of television in\ninstruction and teaching, and 2. .The utilization of tele¬\nvision for extending our adult extension education programs.\n\"In regard to the first mentioned, expanding enrollments\nsuggest that the most serious consideration must be given\nto the possibilities of television meeting the problems of"
}