{
  "id": "d732-131",
  "text": "- 125 -\nChannel 9 looks forward to the extension of its services by way of\ntranslators, cable, and community antenna systems, to towns in the west-\ncentral part of the state, and perhaps even into the western part of the\nstate.\nThe Washington Educational Television Association has no clearly\ndefined pattern for extending educational television throughout the state.\nOne sentiment that survey consultants discovered commonly among people\nengaged in education in the community was that two low-power UHF channels\nshould be reserved for each college, junior college, and major school\ndistrict.\nThe areas of population not now provided for in the educational\nreservations that need to be included in any new system of allocations\nare: Bellingham, Olympia, Aberdeen, Odessa-Moses Lake Ephrate,\nCentralia-Chahalis, Longview-Kelso, Everett, Mt. Vernon and Port Angeles.\nFour institutions of higher learning, aside from the University of\nSeattle, expect soon to initiate educational television service. They\nare Washington State University at Pullman, Western Washington College\nat Bellingham, Central Washington at Ellensburg, and Eastern Washington\nCollege at Cheney. Establishment of a number of new junior colleges at\nlocations not yet designated is expected in the years immediately ahead.\nChannel 62 in the Tacoma area is expected to go on the air shortly\nand will duplicate in-school broadcasts and community coverage in this\narea.\nDr. Lewis Bruno, State Superintendent of Public Instruction of\nWashington, writes:\nWe see educational television as providing a major resource\nin nearly all curriculum areas and up-grading the instruc¬\ntional program. It is especially valuable in science, the\nsocial studies, literature, music and art, as well as the\nforeign languages. Another valuable contribution is in the\nfield of in-service training of teachers. In our opinion,\ntelevision will continue to play an increasing role in educa¬\ntion. Our rapidly accelerating technology continues to\nresult in changes, both in the content and in the organization\nof content. Television can effectively bring these new mate¬\nrials and new structures of disciplines into our classrooms.\nBroadcast television is being rapidly extended in our state\nto stations which are being planned, and translators are\nbeing installed with cable hook-ups. As the contributions\nof the areas are becoming better understood, the demands\nfor facilities are increasing, and we feel that it would be\na mistake not to reserve sufficient channels to meet the\neducational needs of the future.\"\nW"
}