{
  "id": "d732-134",
  "text": "- 128 -\nThe survey evidenced that much thinking hut little action concerning\neducational and instructional television has taken place in West Virginia.\nIt would be difficult, on the basis of a declining population and economic\nsituation alone to make any projection of the state's future needs. But\nin examining the relationship of the present reservations to the popu¬\nlation and to the general geographical area of the state, some projecting\ncan be accomplished.\nThere are two reservations in the extreme northern part of the state,\nincluding the one in conjunction with Steubenville, Ohio. The other two\nare in the extreme southeastern part of the state. In view of the fact\nthat 75 per cent of the population lives elsewhere there will need to be\nprovided many additional UHF channels that could be used as low-power\ntranslators or satellite stations, if these people are to have the bene¬\nfits of educational and instructional television.\nMore than a dozen such areas in the state would ordinarily be handi¬\ncapped in receiving any long-range broadcasts but could use fairly low-\npower local stations, probably interconnected with either cable or\nmicro-wave links.\nIt is difficult also to project into multiple use of channels. It\ncan be said that a state-wide service of low-power stations, if made\navailable, will need more than one channel.\nThe best projection is one based on needs observed during the survey\nand on an engineering survey. Cn this basis West Virginia will require\nat least 24 additional channels for its future educational television\nrequirements.\nWISCONSIN\nIn the southeastern part of Wisconsin there are seven large population\ncenters of 100,000, and seven small centers of over 50,000. Scattered\nthrough the center part of the state are four additional small centers with\npopulation over 50,000.\nWisconsin has 34 four-year colleges and universities and three two-\nyear colleges with a combined enrollment of approximately 69,000. Its\npublic school enrollment is approximately 680,000. Wisconsin has two\neducational television channels on the air—Channel 10 in Milwaukee and\nChannel 21 at the University of Madison. It has 11 more channels reserved\nfor education, but not yet activated. All these are in the UHF band.\nChannel 36 in Milwaukee has been added to the reserved list as a second\nat the request of the Milwaukee schools. Survey consultants were\ntold this channel will soon be activated.\nJf1 °“s^> *he past’ has taken the lead in educational broadcasting,\nand through the state council an effort was made in the early days of tele¬\nvision to duplicate its radio network with an educational television net¬\nwork. Up to now legislative support needed to provide funds and authority"
}