{
  "id": "d732-21",
  "text": "Twenty-two educational television stations now have construction per¬\nmits, or are in the advanced stage of planning and ready to apply for con¬\nstruction permits. Also, approximately 2b additional channels are in an\nearly planning stage. This activity is well distributed about the coun¬\ntry.\nThere are, as of this writing, four state networks of educational\ntelevision, and 10 more states are actively planning state-wide networks.\nTwo regional networks are being actively organized, the New England or\nEastern States network and the Upper Mid-west Six-States network. The\nSouthern Regional Education Board also has done extensive planning directed\ntoward the establishment of a Southern States network of educational tele¬\nvision stations.\nSome 25 states have developed state plans, or have a central state\nagency responsible for educational television planning and development.\nIn considering the \"status of the art,\" it is necessary to remember\nthe important part closed-circuit television has played in this develop¬\nment. It has been particularly important in making large group instruc¬\ntion possible on campuses and in schools where broadcast television was\nnot available; in developing methods and techniques of television instruc¬\ntion, and in serving as a superior kind of audio-visual facility to en¬\nhance classroom teaching.\nIn the continental United States there are more than 300 significant\nclosed-circuit television installations. This does not include small ex¬\nperimental installations of industrial-type, sub-standard equipment in\nmany individual schools. It is in addition to the CC-TV installations in\nmilitary training centers.\nProbably the largest closed-circuit network is in South Carolina.\nThis system has a production center in Columbia and extends in three direc¬\ntions to 11 counties and 31 high schools. Only one channel is now avail¬\nable on this system but the state anticipates increasing transmission\nfacilities to several channels, and extending the service to some 1,250\nschools throughout the state. The existing system is augmented by the\nuse of two commercial stations to broadcast taped programs to schools\nthat are not yet inter-connected.\nOther large systems interconnecting an entire school district or\nseveral schools are located in Washington County, Maryland; Anaheim,\nCalifornia; Corning, New York; Cortland, New York; Pocatello, Idaho;\nGalveston, Texas; and State College, Pennsylvania. Radiating from Austin,\nTexas, is a CC-TV system which will link 11 colleges and universities in\nthat area. As in South Carolina, the long-distance transmission in the\nAustin system is accomplished by microwave relay.\nOne of the most significant factors in the development and use of\neducational television has been the widespread and encouraging legislative\nsupport received in the various states. Thirty-five states have now\nenacted legislation and appropriated funds for the development of educa¬\ntional television."
}