{
  "id": "d732-26",
  "text": "NEEDS OF THE FUTURE REFLECTED NATIONALLY\nI. COMMUNITIES\nOne phase of this study was concerned with needs of the American\ncommunities for informal and out-of-school education and information, and\nfor cultural development. Official state reports and legislative actions\nwere studied, and the collective actions and opinions of civic and\norganizational leaders obtained* Program schedules of the active educa¬\ntional stations have been weighed against indicated need for broadcast\ntime for community programming.\nThe Advisory Committee and the staff of consultants recommended, when\nthis survey was initiated, that it not be confined to formal education\nalone, but that it look broadly at the educational needs of the community.\nThe President's Commission on National Goals said in its report,\ncommenting on education outside the formal system:\n\"If we really believe in individual fulfillment, our concern for\neducation will reach far beyond the formal system. We shall\nexpect people to continue to learn and grow in and out of school,\nin every possible circumstance, and at every stage of their lives,\"\nA i960 report, on educational television for Maine, pointed out:\n\"The general public wants and uses an alternative broadcast\nservice — informational, educational, and cultural pro¬\ngramming which complements commercial broadcasting fare, is\navailable for out-of-school and evening viewing, and is\ntailored to specialized and minority interests. Here exists\nan excellent opportunity for continuing adult education. No\none can doubt the necessity for an informed and intelligent\npublic in today's world. Educational television through its\nvariety of offerings, can provide this service.\"\nIn a report to the legislature in February 1961, the Kentucky Legis¬\nlative Research Commission stated:\n\"An investment in educating adults to the value of education may\nbe more productive at times than increasing school efforts in\neducating the children.\"\nIn this frame of reference the several communities were polled. No¬\nwhere was there found any significant disagreement with these ideas. Civic\nleaders, educators, and broadcasters all reflected the needs of the com¬\nmunities for opportunities for general adult education and a resource for\ncultural development. All sources emphasized the present and continuing\nneeds in these areas. They agreed generally that educational television\noffers the major means of bringing the opportunities and resources of the\ncommunity to the complexity of individuals within the community."
}