{
  "id": "d732-65",
  "text": "Over half the Georgia school population is in small towns or rural\ndistricts and in many instances television instructional services are more\nneeded there than in the larger metropolitan areas*\nThe State Department of Education is now constructing production\nstudios in Atlanta, It has applied for construction permits and has re¬\nceived them for two stations for instructional services - one in Waycross\nand one in Savannah, It anticipates the addition of another major channel\nfor the northern part of the state, to he located on Mount Oglethorpe.\nThis will give the Georgia state educational system three major out¬\nlets with VHF channels to provide for its small towns and rural systems.\nIn March 1961 the State Board of Education voted to go into partner¬\nship with the Muscogee County School Board to build a tower in western\nGeorgia to serve the metropolitan area of Columbus and rural and surround¬\ning areas. This will be a UHF channel already assigned to Columbus. When\nerected, it will serve an area having more than 300,000 population.\nThe report of the local Education Commission of Atlanta and Fulton\nCounty on increased excellence and efficiency in the 1960*s says:\n\"Approaches spelled out in this program require major changes\nin the instructional and learning processes and in the adminis¬\ntration of the Atlanta and Fulton County systems. Implementing\nthese recommendations will necessitate requiring a new percep¬\ntion of how students, teachers, and administrators go about\ntheir respective roles in achieving educational excellence. The\nresearch and development program under the guidance of the MEC\nwill test and prove the best ways of using the educational means\nherein recommended. Currently the career development program\nwill have to assist teachers and administrators in developing a\ncomparatively new professional environment. Obviously no price\ntag can be put on the research and development required. To\nbegin with it would seem prudent to expect that for at least one\npercent of the annual operating budget of the two school systems,\nor about $350,000 to be the annual rate of expenditure. The\nMetropolitan Education Commission when established should be\nasked to draw up a budget for research and development sufficient\nto sustain the broad scale of action contemplated. This should\nbe viewed as money to create the shape of the future for the\nAtlanta and Fulton County s3rstems. The suggested program is\nnot a blueprint to be put into action; rather it is a set of\nplans and policies set forth in the proceedings sections of this\nreport. The exact form that these might take at a given time\nwill and should change as the realities around the schools change.\n\"The means for setting directions, scientifically testing these\nmeans for their movement toward these directions, and providing\nthe highest professional growth for instructional and adminis¬\ntrative staffs in the competence to use the means proved in the\nresearch and development activities — these will be the mission\nof the Metropolitan Education Commission with this research and\ndevelopment program."
}