{
  "id": "d732-75",
  "text": "- 68 -\nDr. William J. McKeefery, President of Washburn University in Topeka,\nwrites:\n\"With the rapidly expanding spectrum of knowledge, it becomes\nincreasingly important that education use the best tools pos¬\nsible to accomplish its objectives in reasonable time and at\nmoderate costs. Educational television holds considerable\npromise of extending the efforts of the best teachers in a wide\nvariety of special topics to a greater number than ever before.\nWe believe in America in educational opportunities for all who\ncan profit from them. This means reaching people where they\nare and at the times they are available. Television in the\nhome, and in the public schools can do a flexible job through\nsufficient stations and channels. A nation that has entered\nthe Space Age certainly should use one of the important space\nmedia for its educational program.\"\nEducators in Kansas, the Legislative Council, and the legislature\nitself have recognized the need for using television for instructional pur¬\nposes, Their plans, and their concern with such use in the future, are\nindicative of the number of channels that will eventually be needed in\nKansas. If the proposed six-channel network, or any reasonable variation\nof it, is put into operation, this network will have to be double-channeled\nvery shortly to provide the multiple schedules necessary at the various\nlevels of education. The number of channels requested in the proposed plan\nwould have to be doubled and redoubled by the 1970's if education were to\nbe adequately served. In simple projection this means that a minimum of\nsixteen additional channels is needed in Kansas.\nKENTUCKY\nKentucky is a state with many, and unique, problems in education. In\nterms of population, it is one of the slower growing states. It had an\naggregate increase from 1950 to i960 of only 2.5$. There was an increase\nin the school census of approximately 3$. But this affected only the\nlarger and more industrialized areas; 84 counties lost more than 1$ of\npopulation during the last decade. An apparent correlation has been found\nbetween the loss of population in rural and mountainous areas and the\nquality of education that can be offered.\nIn one county, which lost over 25$ of its population in the I95O-I960\nperiod, the schools were subjected to intensive study. One discovery was\nthat, on the basis of mental-ability tests, students there were signifi¬\ncantly low in ability to do school work successfully. Another study obtained\nsimilar findings in a county which had lost approximately 17,(f> of population\nin the last decade.\nReports of the Legislative Research Commission in Kentucky show that\nthe rural schools, particularly, need educational facilities and opportu¬\nnities not now available. The Commission has intensively studied the\nsituation and believes that educational television could help remove some"
}