{
  "id": "d732-80",
  "text": "- 73 -\nV,\nMAINE\nMaine has two major population centers in excess of 100,000. The rest\nof the state is composed of large areas of sparsely populated country or\nsmall town and rural communities. Its eighteen colleges and universities,\nmost of them located in the southern half of the state, have a total enroll¬\nment of approximately 14,000. Public school enrollment is approximately\n200,000.\nThere are now five channels reserved for education in Maine. This\nincludes the addition of the two channels during this past year by the\nFederal Communications Commission. A report on education and television\nwas issued in i960 by the University of Maine in cooperation with the State\nDepartment of Education. Among other things, the report said:\n\"Maine is a rural state. In this modern day, 44$ of the land\narea of the state is still unorganized territory without muni¬\ncipal government, and scattered through this unorganized terri¬\ntory are 1,600 school children who do not have the benefits of\nschool district organization. Both children and parents look\nto the State Department of Education for help. But distances\nare great and travel inefficient. Television can reach these\nunorganized territories. Television can assist in coordinating\nthe educational program. Television can improve the instruction.\nMaine's 492 organized communities operate many small schools;\n34 communities are too small to maintain schools; 139 communi¬\nties have a total school population of less than 100. The\nquality of instruction ranges from good to poor. Television\ninstruction can upgrade local effort without the loss of local\ncontrol. There are 1,022 elementary schools in Maine, yet\nonly 35 of the 458 communities operating public schools have a\nformal art program, and only 207 a formal music program. Edu¬\ncational television can enrich the curriculum of these small\nschools. Educational television can bring science, Maine\nhistory, art, and modern language in these schools. Economi¬\ncally and practically educational television can bring to\nthese schools certain courses which otherwise would be almost\ntotally unavailable. 121 out of 178 public secondary schools,\nand 54 of 62 private schools, have fewer than 300 students.\nOnly 29 of these Maine high schools and academies received the\naccredited rating during i960. In this age of increased oppor¬\ntunity, this era where knowledge is essential to survival, should\nnot the rural student be afforded equal opportunity of his urban\ncousin? Can Maine squander these human resources? Educational\ntelevision can act as an equalizer. Educational television can\nbring to sparsely settled areas many of the educational opportu¬\nnities of the urban area - opportunities presently non-existent\nor only partially available.\"\nAn educational television system has been recommended for Maine\neducators of the state are now organizing to develop such a system.\nand"
}