{
  "id": "d732-86",
  "text": "- 79 -\nin television in this state in the next ten years. At\nthe present time we are constantly expanding our television\ncurriculum through Channel 2 in Boston, and will continue\nto do so. Also, we are contemplating producing an educa¬\ntional television signal for the western half of Massachusetts\nwhich is not now covered by us. We certainly feel that tele¬\nvision channels should be reserved for education in sufficient\nnumbers to provide for the future needs\nHartford N. Gunn, General Manager of WGBH-TV, Channel 2 in Boston,\nwhich provides all of the educational television now available to\nMassachusetts, speaking of the needs of the next ten years, says:\n'We see the services extended to more groups within the\ncommunity, plus multiple transmitters to serve a number\nof areas within the coverage of the high-powered trans¬\nmitter; with unique local services that would not be justi¬\nfied for high-power wide area distribution. Eventual need\nwill be for two complete state-wide systems, as well as the\nabove mentioned.\"\nOn the basis of the reports of need, and of the development pattern\nevidenced in Massachusetts, at least six more UHF channels will be needed\nin the Boston area, and at least five additional channels for the locali¬\nties in the state.\nMICHIGAN\nMichigan is a state with many problems, not the least of which is the\nproblem of equal distribution of educational opportunities and facilities\nto all of the people in the state.\nThe major population centers are all located in the southern third of\nthe state. These are seven, with a population of 150,000 to 2,000,000.\nThere are also nine small centers with populations ranging from 50,000 to\n100,000. Michigan has over 7,900,000 people and 78$ of them live in the\nsouthern third of the state. Fewer than two million people are scattered\nin the rural areas. This in itself presents some unique problems of\ndistribution of educational opportunities and facilities.\nMichigan has 26 four-year colleges and universities with a total\nenrollment of approximately 145,000, and most of these institutions are\nlocated in the southern third of the state. In fact, most of them are\nlocated in the extreme southern part of the state. There are eighteen\njunior colleges with an enrollment of approximately 20,000 students.\nThree-fourths of the junior colleges are situated in the southern third\nof the state.\nWhat is true of higher education is true also of the public schools.\nMichigan's public school enrollment is over 1,500,000, the major portion\nof which is concentrated in the southern third of the state. The north-\ncentral area and the northern peninsula areas have a school population\ndistributed in very small towns and rural schools."
}