{
  "id": "d732-90",
  "text": "- 83 -\nWith the comprehensive job being done by Channel 2 in St. Paul-Minneapolis\nthere is already need for an additional channel. As the increased demands\nfor scheduling are met in the years ahead there will be additional needs\nin this area.\nDr. Dean M. Schweick, the Commissioner of Education, writes: \"Our\nChannel 2 in St. Paul-Minneapolis is now broadcasting instructional tele¬\nvision 45 hours per week and plans to increase that time.\"\nHe said that several translator stations have been set up on the\nfringe areas of Channel 2, and notes that the interest for college credit\nby broadcast television is increasing. \"We anticipate a greater demand\nfor educational programming. Channels should be reserved for education in\nsufficient numbers to provide for future needs,\" Dr. Schweick added.\nOn the basis of the information provided by the various educational\ninterests in Minnesota and the projection of needs in increased usage of\ntelevision instruction, at least 18 additional channels are needed in this\nstate to serve the future needs for television instruction, and for general\neducation.\nMISSOURI\nMissouri is one of the slower growing states. During the past decade\nits population, about evenly divided between the large communities and the\nrural areas, has increased less than 10$. There are four large centers of\npopulation in excess of 100,000 and three small areas with population in\nexcess of 50,000.\nMissouri has 44 four-year colleges and 14 two-year colleges, with a\ncombined enrollment of approximately 85,000 students. The public school\nenrollment is approximately 790,000.\nMissouri has four television channels reserved for education -- three\nUHF and one VHF. Two of the reserved channels have been activated _ Channel\n9 in St. Louis, and Channel 19 in Kansas City. Channel 9 is owned by a non¬\nprofit community foundation, but extends services to area colleges and\nschool systems, as well as to the general public.\nThe Kansas City UHF station now on the air is owned by the public\nschool system. It is used primarily for instructional television. There\nis no state plan or organized state effort to provide educational or\ninstructional television service to the people or the schools of Missouri.\nHowever, Dr. H. P. Wardlow, Assistant Commissioner of Education, says that\nthe Department of Education feels many areas of adult education have need\nof television instruction at the present time, and that there is a need to\nbroaden the secondary education program in Missouri. He predicts that the\ndemands for both in-school education and adult education by television will\nincrease considerably in the ten years ahead."
}