{
  "id": "d732-94",
  "text": "- 87 -\n\"w-\nThis entails construction of nine broadcasting stations at the most\ntechnically and geographically feasible points about the state, and con¬\nstruction of 18 low-power translators to supplement the nine broadcast\nstations. On the basis of the projected coverage of each of the speci¬\nfied transmitters and translators the Committee estimates that 76$ of\nthe people in the state would have good reception from this system.\nMontana now has six channels reserved for education -- five in the\nVHF band, and one in the UHF band* In the plan which has been developed\nby the Committee, all of the five presently reserved VHF channels at\nMissoula, Butte, Bozeman, Billings, and Miles City would be used. The\nCommittee seeks in addition to have Channel 23 in Great Falls deleted.\nIt asks that Channel 10 in Helena be deleted and that Channel 7 be\nadded to Helena and reserved. It requests that in Butte Channel 7, which\nis now reserved, continue to be reserved, and that Channel 2 be added.\nThe basic network would also need the necessary frequencies for the\nconnecting links, and for the translators, of which some could be UHF\nand some VHF, To this basic network, the Committee proposes to add a\nminimum of one channel as soon as finances and usage make such addition\nfeasible.\nWhat this means in the terms of television channel needs for\nMontana is: Channels 9, 2, and 10 to be added to the VHF band, and 10\nU®1 channels to be added to the reserved lists at the particular points\nof the primary broadcast stations. This is 13 additional channels for\nMontana, plus some rearrangement of the presently reserved channels.\nNEBRASKA\nNebraska, a rural state, has two large areas of population in the\nextreme eastern part. The remainder of the state is composed of very\nsmall towns and rural areas. But Nebraska has 18 four-year colleges and\nuniversities and three two-year colleges, with a combined enrollment of\n32,000 and its total public school enrollment is approximately 270,000.\nNebraska has only two channels reserved for education. One,\nChannel 12, at the University of Nebraska, in Lincoln, has been on the\nair for seven years and has taken leadership in the development of\ninstructional television in the schools as well as in the community.\nFive additional channels have been requested in compliance with a state\nplan.\nDr. Adam C. Breckenridge, Dean of Faculties at the University of\nNebraska, has had considerable experience with the use of broadcast tele¬\nvision and has devoted much thought and study to the needs of the state\nin this area, responded:\n\"Nebraska’s primary needs are resources to provide a state¬\nwide network, and establish an organization of all educational\ninstitutions in the state, both pre-college and college, for\njoint educational television undertaking -- both in organiza¬\ntion and distribution.\""
}