{
  "id": "d732-97",
  "text": "- 90 -\nL\nparticular situation at the present time. However, consideration of the\npotentials presented, with double-channel facility in the prime areas,\nand with the out-areas receiving a minimum service, coupled with the\nengineering portion of the study, shows need for seven additional channels.\nVw\nL\nHEW HAMPSHIRE\n^New Hampshire is a relatively small state with a small population,\nlocated mainly in small towns and rural areas. It has only six large\ncentral areas with populations exceeding 50,000. New Hampshire has 11\ncolleges and universities, with a total enrollment of approximately 13,000\nand a public school enrollment of approximately 100,000.\nNew Hampshire has two television channels reserved for education - one\nUHF at Hanover, not yet activated; and Channel 11 in Durham, operated by\nthe University of New Hampshire and the Educational Television Foundation.\nThis station serves both the needs of the University of Durham of the sur¬\nrounding school districts and communities.\nDr. Alice A. D. Baumgarner, of the New Hampshire Department of\nEducation says:\n\"Elementary and secondary schools have curriculum needs which\ncan be served effectively through educational television, by\nbringing outstanding teachers, demonstrations, equipment, and\nmaterials, not normally available to our New Hampshire class¬\nrooms. Education through graduate courses for credit, and\neducational workshops to upgrade the teachers in those areas\nin the curriculum where few specialists exist, or where\nmodern technological advances are rapidly changing the cur¬\nriculum, is another important service which can be performed\nby television. Increasing numbers of children, competition\nfor qualified teachers, low supply of well-trained teachers,\nwill increase and perhaps double the need in the next ten\nyears.\n\"We need to extend our in-school service in Hew Hampshire to\ninclude services to primary grades, junior and senior high\nschools, and in-service teacher education. Although our\npresent New Hampshire instructional television service to\nthe intermediate grades is adequate, we have only begun to\ntap the rich resources in our state, regions and nation.\nOne of the greatest needs is to extend our service to cover\nall of the school population. Our present station covers\nonly 507o of the school population. We need a VHF channel\nreserved for educational purposes in the northern section\nof New Hampshire. The majority of schools not presently\nserved by educational television are those small, understaffed,\nlimited local-financed school systems.\""
}