{
  "id": "d1193-1",
  "text": "• 2 *\nKUSP University of South Dakota 920 500W\n(Kenneth Christensen)\nIndiana. University - Depends on commercial radio facilities.\nhas pending FU CP application before FCC (II. J* okornia)\nUniversity of Michigan - Depends on commercial radio facilities.\nHas FM CP for station from FCC (Waldo Abbot;\nWestern State Teachers College - Depends on commercial radio facilities,\n(Wallace Garneau)\nSTAFF\n(FT - Full Time; FT - Part Time; $T - one half time, etc.)\nOhio State University - Station Director (FT), Director of Radio 0^)*\nDirectors of U of Air (&T), School of Air <JT), Foreign Broad¬\ncasts (|T), Horae Economics (&T), Forums (£T), approximately 20\non staff.\nUniversity of Oklahoma - 7 full time; 10 part time\nIowa State College - 12 or 15 on staff. Some are part time in allied\nDepartments• '\nPublic Relations ,, % ^\nUniversity of Illinois - ^ c (vT), Radio Director(sT),\nMusic Director(5/4T), Announcer (FT), Writer (FT), Steno (la).\nChief Engineer (FT), Announcer not paid. Operator (FT), 12 part\ntime technicians. (Asking for 12 faculty broadcasters on itime\nbasis. Full time Director, 3 Full Time writers, 4 Administrative\nfellowships at $80 a month.)\nUniversity of Minnesota - 15 people on staff. Has Administrative fellow¬\nship paying $80 a month for assistants.\nState University of Iowa - 5 full time, 20 part time (12 of the part time\nare students) Production Directors are teachers and are paid from\ntheir Departmental budgets. (Has five studios.)\nPurdue University - Announcer (FT), 5 Graduate Students on Fellowships*\n$95 a month, Steno (2ftT), 10 Technicians, 3 Directors all a time.\nUniversity of Wisconsin - 22 (FT) (2 are seasonal - average 20 FT, of\nwhom 8 are Civil Service.)\nMichigan State College - 9(FT), 8(PT) .tudtot., Ull paid), X\nEngineer (FT), 5 Technicians (FT), Director (FT), Production\nDirector (FT), 6 Announcers (PT), and 3 writers (PT)\nADMINISTRATIVE SETUP\nSouth Dakota - The station is run by the Speech Department."
}