{
  "id": "d1193-4",
  "text": "~ 5 -\nState University of Iowa - Broadcasts 50 minute class periods. However,\nthese are broadcast from a station studio rather than from a\nclassroom*\nFACULTY PARTICIPATION\nMichigan State College - As I understand it, there is a clause in all\nfaculty teaching contracts that members of the faculty will pre¬\npare 4 scripts and will be willing to present radio programs.\nState University of Iowa - Suggests a good idea that the annual requests\nby a University for a Bib1iography of “books and articles written\nby members of the faculty include a section on radio programs pre¬\npared and presented by the faculty. Such a plan would £ive credit\nto the faculty members who write radio talks and would be filed\nIn the Administrative Office. They do not give credit to a faculty\nman whose class participates, presuming that there Is no additional\nv/ork involved.\nOklahoma - Gives credit on the teaching load to a Professor offering a\nseries fcf programs. While it does not pay faculty members to\nparticipate In series of programs. It does provide them with Re¬\nsearch Assistants.\nIllinois - Picks up 50 minute classroom lectures from the regular class¬\nroom.\nFREQUENCY MODULATION PLANS\nWisconsin - Is planning 7 FM stations to serve regions not served by AM\nand is asking $400,000. It has a State Radio Council consisting\nof the Governor of the State, the Director of Public Instruction,\nSecretary of the State Normal Colleges, Directors of Adult and\nVocational Education, Director of Agriculture, and 4 representatives\nof the University, namely: Dean of the School of Education, Director\nof Public Service, and the Director of Agriculture Extension* and\nDirector of the Extension Service*\nIllinois - Is asking for fund to move its existing transmitter to build\na new transmitter building, and for a new FI.! transmitter and\nantenna.\nIndiana - Plans to spend approximately $50,000 on a new 10KW station.\nIowa - Plans to use concurrent programs on Its FM and AM facilities.\nPlans on 1KW FM. Is also planning for television.\nPurdue - Has application in for both FM and Television.\nMichigan State - FM application probably will be filed within the next\n2 weeks.\nUniversity of Michigan - Has a construction permit for 50KW frequency\n42,100 KO. Call letters WTAX"
}