{
  "id": "d1193-5",
  "text": "- 6 -\nSkonia says the best Layman*s explanation of PM is in a book \"Radio From\nStart to Finish\" by Franklin M. Reck. Publisher Crowley.\nMISCELLANEOUS IDEAS\nMinnesota - Uses quite a number of transcribed programs from the BBC and\nsuch programs as General Electric \"Excursions in Science and\nWestinghouse \"Adventures in Research.\"\nState University of Iowa - Has a transcription library of 3000 records.\nUses Press Association News. Iowa pays $75 a month for Series\nB Standard Transcription, $100 a month for NBC Thesaurus and con¬\nsiders the latter the more valuable.\nMinnesota - Takes programs from other State Institutions.\nMichigan State College - The Station is kept entirely separate from college\ndepartments. Objects to the announcement in the bulletin that\nstudents in any course will have an opportunity to broadcast, claim¬\ning that such a statement guarantees opportunity to both good and\nbad.\nOklahoma — Presents programs on the basis of 35^ music, talk. Also\nfeels that an educational station should plug itself by advertising\nits own programs*\nWisconsin - Has a separate recording room (not control room). Uses 2\npermanent recorders and 1 portable. Has mode its’ ladies lavatory\nInto a listening room. Only McCarty would think up an idea like\nthat.\nA number of stations retain a Washington Attorney. Illinois has a travel\nbudget, and pays about $1500 a year in telephone tolls.\nUniversity of Iowa - Has radio courses in French, Spanish and Portuguese.\nNovik of V.NYC kept insisting that Educational Stations should apply for\nthe new 540 position on the dial. He says it*s good, It*s free.\nAll members were again urged to send copies of their annual reports to\nother members Please mi (Dorft forget the U of M)\nFINANCIAL MATTERS\nIndiana expects to spend $50,000 on FM\nSouth Dakota has $40,000 earmarked for radio\nOklahoma has a separate budget for radios is asking $400,000 from Legis¬\nlature for Improvements and FM.\nIllinois now has annual budget of $30,000 and is asking for a material\nIncrease, Schooley says the faculty claims that the Broadcasting"
}