{
  "id": "d1247-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPRESIDENT’S\nMEMO\n1346 Connecticut Avenue, N.W.\nWashington 6, D. C.\nPhone North 7-6000\nVol. II No. 11\nNovember 1963\n•SPECIAL TO TV STATIONS\nThis is a follow-up to the summary which Jerry Appy prepared concerning the meeting\nof himself and Hartford Gunn, representing the NET Affiliates group, with the President\nand Chairman of the Board of NAEB.\nAs Appy reported, there was a good deal of general agreement at this meeting and only\na few items created difficulty. This meeting was an attempt to discover areas of\naccord and to identify whatever issues remained to be ironed out as a preliminary to\npreparing for the consideration of the NAEB Board changes in the proposed amendments\nto the Constitution and By-Laws. As an intermediate step, the Executive Committee of\nthe Board has reviewed the Appy report and has recommended modifications on some of\nthe points discussed. These recommendations will be made to the Board at its meet¬\ning on Sunday, November 17. whatever changes in the original amendments the Board\nadopts will be read to the Convention at the Monday morning business session and\nconsent will be asked for from the necessary two-thirds of the voting members present\nto accept these further amendments for consideration so that they may be voted upon\nalong with the amendments previously distributed.\nSince these recommendations include some differences from the Appy memo, as well\nas points that need clarification, I wanted you to be aware of the proposals which the\nExecutive Committee will bring to the Board. These considerations follow the points\nas listed in the Appy memo.\n1. “Membership (in the new organization) would be limited to non-commercial ETV\nbroadcast stations.”\nRegarding the need for specific language to insure a distinction between regular TV\nstations and the 2500 me stations - we find in checking the FCC nomenclature that\nthe regular station serving a community-wide audience is termed a “television\nbroadcast station.” There is no need to add the word “standard”, a term which the\nFCC employs to distinguish AM radio from other types of radio service. The new low-\npower UHF systems is designated as ITFS (Instructional Television Fixed Service).\nITFS stations clearly belong in the Instructional Division along with other point-to-\npoint services distributed by cable or microwave."
}