{
  "id": "d1247-2",
  "text": "-3-\nindependence of action for itself, it might not be happy about the possibility of - say\nthe Instructional Division taking a totally unilateral action that could cause\nirretrievable harm to TV station interests. And the Association, devoted to fostering\nthe growth and long-range interests of the total educational broadcasting movement,\nmust be concerned with any particular action in relation to its impact upon the\ngeneral welfare of educational communications development.\nAccordingly, the Committee suggests a combination of the proposal in the Appy report\nwith an additional proviso:\nThe Board of Directors of NAEB shall be responsible for the establishment of policies\nto facilitate cooperative relationships among the Divisions and with the Association.\nThe various Division Boards shall be autonomous within their areas of concern.\nHowever, proposals made by them in the name of the Association shall be brought to\nthe NAEB Board of Directors for ratification. A two-thirds vote shall be required to\nsecure Association endorsement of any Divisional proposal, whenever, in the\njudgment of the President, actions. „ or proposals of a Division may adversely affect\nthe general interests of the Association, the President can have the matter reviewed\nby the NAEB Board. The NAEB Board may then require the Division concerned to\nconduct a poll of its entire membership and receive majority sanction for continuance\nof said ..action's. ; or position.\nUnder such an arrangement. Divisions would be free to act in their areas of concern.\nIf they wish to secure the backing of the Association for a proposed action, they\nmay make such a request. Lacking a two-thirds affirmative vote from the NAEB\nBoard, the Division is still free to take action in the name of the Division. If, in\nthe judgment of the President, a proposed Divisional action holds the potential for\nadversely affecting the welfare of educational broadcasting generally, he would\nhave authority to refer the matter to the NAEB Board for review. If, upon review, the\nNAEB Board agrees, and if no satisfactory compromise can be worked out, it can\nby majority vote order the Division to take a poll of its members to be certain that\nthey are fully appraised of the situation and, in the face of official Association\ndisapproval, wish their Division to continue the activity or maintain the position.\nThis proviso provides a “braking system\" which will probably be rarely, if ever,\nused; but the fact that it is in the By-Laws will afford an important safeguard for\nboth the Divisions as well as the Association in the event that an extreme situation\nshould ever arise requiring the exercise of such constraints.\n6. “The TV Stations Division Board meetings could be called at anytime and at any\n.place selected by it.\" Internal matter\n7. “The Chairman of the TV Stations Division Board shall be elected by the Board\nfrom those with at least a year of current Board experience.\" Internal matter."
}