{
  "id": "d1646-0",
  "text": "/\nGAN RADIO BROADCASTING BE IMPROVED?\nDr. Arthur G. Crane\nPresident, University of Wyoming\nOn behalf of the National Committee on Education by Radio, I wish to present\na proposal which will capture the interest of everyone within the listening area\nof this station. My remarks deserve more than passing consideration because they\nhave the unanimous approval of the nine great educational associations which\nconstitute the Committee’s membership. The organizations, national in scope, are:\nThe National Association of State Universities, The National Catholic Educational\nAssociation, The National Association of Educational Broadcasters, The National Uni¬\nversity Extension Association, The National Education Association, The Jesuit\nEducational Association, The National Council of State Superintendents, The National\nAssociation of Land-Grant Colleges and Universities, and The American Council on\nEducation. Back of them there are millions of American citizens interested in\nthis thing we call radio.\nThis Committee was called into being at the suggestion of the United States\nCommissioner of Education. The members of the Committee have long seen the\nimplications and possibilities of talk at the nation’s fireside which reaches\nyoung and old, literate and illiterate, reaches them all alike instantaneously\nand in very intimate fashion in their homes. We have seen in this an opportunity\nfor great service to America and particularly to America as a nation that is\ndependent upon the accuracy of the general information received by the public,\nupon the attitudes of the public, upon the judgment made by the voters.\nWe have seen, I believe, that whatever the program, whoever directs it, there\nis inevitably education. The programs which come to my home, which my children\nlisten to, exert an educational influence. I sometimes tremble as I listen to\nsome of the programs, and yet, in order to make a proper discriminating selection\nof programs for those children, I have to, in the parlance of the west, \"ride herd\"\n(MORE)"
}