{
  "id": "d1646-5",
  "text": "from the cable, comb out the shielding, then cut it off\nso that it extends about %\" from the inside of the\nouter jacket. After folding the combed shielding back\nover the outer jacket, force the cable into the reduc¬\ning adapter. Next strip the inner polyethylene jacket\nfrom the inner conductor, insert inner conductor in\nthe center pin of PL259 plug, and screw adapter into\nplug. Solder inner conductor.”\nMr. Lewis states that he has used this method for\nyears and has never experienced a mechanical or elec¬\ntrical failure. It facilitates the re-use of coax con¬\nnectors since it is a simple matter to unsolder and\nclean the solder only from the center pin of the plug.\n* * * *\nThe New Castle, Henry Township School Cor¬\nporation of New Castle, Indiana, has a 10 watt Gen¬\neral Electric FM transmitter for sale. If you are in¬\nterested in its purchase, contact Mr. Bernard T. Han¬\nley, A-V Director.\nNEWS OF MEMBERS\nGENERAL\nWestern Michigan University’s radio station, WMCR,\nreports the extension of its services to include the\nformerly “silent period” of August and the first two\nweeks of September.\n^ The St. Louis Board of Education Station, KSLH,\ncan be picked up within a 90-mile radius, a recent\nfield check revealed.\nTwo radio specialists, Ernest H. Vogel, station\nengineer, and Hilliard Mueller, Jr., from the Board’s\nElectronic Shops, set up test equipment in various\nMissouri and Illinois towns. They found the KSLH\nbeam strong in every direction from the city, but ad¬\nvised that beyond 40 miles an outdoor antenna might\nbe needed to obtain a satisfactory signal.\nThe NAEB recently chose four KSLH program\nseries from among the nation’s best educational pro¬\nductions for national distribution next year.\n^ To keep from operation “in the red,” WCAL radio\nstation of St. Olaf College, Northfield, Minn., has ap¬\npealed to its listeners for financial support. WCAL\nhas been on the air as a noncommercial station for 38\nyears.\nPERSONNEL\n► Two faculty members of the University of South¬\nern California’s Department of Telecommunications\nreceived promotions. Kenneth Harwood, chairman\nof the department, advanced to the rank of professor,\nwhile Robert Summers, editor of the Journal of Broad¬\ncasting, became an associate professor.\n\\ Former Deputy Asst. Secy, of Defense Philip K.\nAllen of Massachussetts, has been named assistant\n6\ngeneral manager for finance of Boston’s noncom¬\nmercial educational stations WGBH-TV and WGBH-\nFM, according to an announcement by Ralph Lowell,\npresident of the WGBH Educational Foundation and\nTrustee of the Lowell Institute.\nPrior to his resignation from the Defense Depart¬\nment on July 1, Allen served as chief clerk for the\nArmed Services Committee of the U. S. House of\nRepresentatives.\n\\ Phil Melone, former transmitter supervisor of the\ncommercial station WHTN-TV, has been added to\nthe staff of the Alabama Educational Television Net¬\nwork as studio chief engineer. He is a native of Des\nMoines, Iowa.\n^ Lawrence Creshkoff, former assistant director of\nprograms at Boston’s educational stations WGBH-TV\nand WGBH-FM, has been appointed as director of\nthe Chelsea Closed Circuit Television Project, New\nYork City’s pioneer experiment in school-community\nTV education.\nStarting in the fall, the project will bring ETV to\n608 families into the Lovejoy Elliot Houses, West\n26th St., and to Public School 33.\n^ Prof. James E. Lynch, program supervisor of the\nIndiana University Radio and Television Service, will\nbe given a one-year leave of absence starting in Sept¬\nember to replace Prof. Edward Stasheff of the Uni¬\nversity of Michigan Speech Department.\nProf. Stasheff recently accepted an appointment as\nprogram associate with the Educational Radio and\nTelevision Center.\n^ Dr. Keith M. Engar, who represented the NAEB\nin France during 1956-57 while a Fulbright research\nscholar, has been appointed as program director for\nETV Station KUED, University of Utah.\nDr. Engar began his broadcasting career at Radio\nStation KSL in 1939. Eventually he rose to produc¬\ntion manager of KDYL-TV. He also directed and\nproduced ETV programs for several years on Salt\nLake City commercial stations. Presently Dr. Engar\nis an associate professor of speech and theater arts\nat the University of Utah.\n^ Dr. Marvin Alisky, who recently accepted a posi¬\ntion at Arizona State College, will be replaced as news\ndirector of the Indiana University Radio and Tele¬\nvision Services by Richard D. Yoakam.\nYoakam’s additional duties at the IU will be those\nof an assistant professor of journalism in the area of\nbroadcasting.\nPROGRAMS\n► A series of 13 recorded radio programs on in¬\ndustrial research in Indiana, recently prepared by a\nmobile unit from the Indiana University Radio and\nTelevision Service, will be available to any state radio\nstation for use as a public service, according to Prof.\nNEWSLETTER"
}