{
  "id": "d1646-6",
  "text": "E. G. Sulzer, head of the department.\nThe recordings, which were made at 13 major in¬\ndustrial plants throughout the Hoosier state, include\nresearch in piston rings, refining, automotive engi¬\nneering, farm feeds, kitchen equipment, meat pro¬\ncessing, laboratory synthesis, nitro-paraffin and petro¬\nchemicals, musical instruments, stone utilization, rail¬\nroads, diesel engines and pharmaceuticals.\n► The municipally-owned WNYC-FM station in\nNew York has embarked on a marathon 24-hour\nbroadcasting schedule, believed to be the first NAEB-\nmember station’s around-the-clock operation.\nUnder the new arrangement, nocturnal listeners\nwill receive hi-fi music. The extended schedule will\nbe useful also for “off-hour” emergency broadcasts,\naccording to Seymour N. Siegel, director of radio\ncommunications for the city.\nTV LITERATURE\nA NAEB-financed study of the extent to which par¬\nents supervise their children’s TV viewing was re¬\ncently completed by John R. Thayer, a graduate\nstudent in radio and TV at the Ohio State University.\nData in the study derived from 1,452 question¬\nnaires which were distributed among parents of 5 to\n13-year-old children. The Thayer report is one of a\ncontinuing series of radio and TV audience studies\nconducted by graduate students under the super¬\nvision of Harrison B. Summers of the OSU Depart¬\nment of Speech.\n^ Thousands of copies of a newly-published book¬\nlet, entitled Television for Children, are currently\nmade available by the NARTB and the U. S. Office of\nEducation to networks, educational organizations,\nchildren program sponsors, governmental agencies and\nspecial libraries throughout the country.\nThe 60-page illustrated booklet gives insight into\nthe child’s world. It can be used by producers and\nparents as a guide for preparing and selecting suitable\nchild programs.\nTelevision for Children was prepared by the\nFoundation for Character Education, Boston, in\ncooperation with Boston University’s school of ed¬\nucation. It contains the pooled knowledge of 10\nauthorities in the fields of broadcasting, education and\npsychology. The project was headed by Dr. Ralph J.\nGarry, associate professor of education at Boston\nUniversity.\nCHINA CORRESPONDENT BAN\nTo aid the U. S. Department of State in determining\nhow many reporters want to go to China should the\nban be lifted, the NARTB has sent memoranda to\nradio and TV stations throughout the nation asking\nfor reports from those stations which presently have\nnews representation in foreign countries.\nThe NARTB’s action followed Secretary of State\nFoster Dulles’ recent proposal of allowing a limited\nnumber of correspondents to enter China for a 6-\nmonth trial period. Five representatives of U. S. news\nmedia opposed the proposal, maintaining that the ban\nshould be completely removed.\nThere also were differing opinions on how many\nnewsmen would take advantage of a lifted ban. The\nState Department said it would investigate the mat¬\nter before making its final decision.\nPLACEMENT SUPPLEMENT\nAugust I - Male, 35, single, M.A. with wide teaching and\ncommercial TV background; seeks ETV position with op¬\nportunity for creative work; can write dramatic or in¬\nstructional scripts. South, Southwest or West. $3,800-\n5,000.\nAugust 2 - Male, 27, married, B.A. education psychology\nand practical radio experience; wants position in pro¬\ngramming with radio or TV; interested in development\nof closed circuit programs and evaluation of same. Pre¬\nfers Midwest or West. $5,000 up.\nAugust 3 - Male, 26, single, B.A., varied background in¬\ncluding administration, accounting, clerical functions,\nspeech, performing (radio-TV-theater); is interested in\nETV position which will utilize his administrative and\ncreative abilities. Denver, North Carolina, Canada or\nMaine preferred. $5,000.\nAugust 4 - Woman, 27, single, M.A., speech major with con¬\ncentration on TV; has supervised entire operation of TV\nstation as production manager; wants position in ETV or\nradio, preferably in West or Midwest. $350 - 450/month.\nAugust 5 - Woman, single, 30, B.A., radio-TV-speech major; ex¬\nperience in adapting stories for radio and TV; has worked\nas script writer for college radio station; also acted in\ndramatic production in college; some experience in radio\nproduction; is interested in TV and/or radio writing posi¬\ntion. West or Southwest [not California) preferred.\n$3,000.\nZENITH WANTS SUBSCRIPTION TV\nIn an effort to forestall the replacement of broad¬\ncasting TV by closed circuit TV systems, the Zenith\nRadio Corporation, Chicago, has filed reply comments\nwith the FCC asking for an immediate opportunity\nto demonstrate “what subscription TV can do.”\nAny further delay in authorizing subscription TV\nfor broadcast, the comments state, will permit closed-\ncircuit operators to pre-empt the field. TV wire ser¬\nvice, Zenith holds, is less efficient and more costly\nthan broadcast TV, resulting in a “needless burden on\nthe public.” Its establishment, Zenith warns, could\nwell “destroy television as we now know it.”\nWe have omitted our usual notice of DIRECTORY CHANGES,\nas we are preparing a printed Directory to replace earlier\nmimeographed ones.\nThe new Directory will be mailed to all institutional members\nshortly after September I.\nAUGUST, 1957\n7,;"
}