{
  "id": "d1301-2",
  "text": "-3-\nWe are currently tabulating the results of a survey conducted by our Television\nAdvisory Committee, which will result in publication of a report on various financial\naspects of ETV station operation.\nIn cooperation with the Radio and Television Advisory Committee, we recently\nmailed a questionnaire to all institutional members asking for reactions to current\nNAEB services, suggestions for possible new or expanded services, and asking questions\nabout financing NAEB services.\nThese two committees are now working on plans for a series of NAEB \"Primers’*—\nsimple booklets which answer basic questions on how to get a radio or TV station on\nthe air. One idea is to have a series of articles run in the Journal and then have\nreprints made up for package distribution.\nConvention\nThe 1965 NAEB Convention will be held in Milwaukee, November 17-20, at the\nSchroeder Hotel. We realize that this is a month later than usual, but it was impos¬\nsible to arrange for hotel space in October. The staff and permanent Convention\nCommittee are already deep in the program planning aspects, and the Milwaukee Com¬\nmittee is working out the arrangements for hospitality, meeting rooms, etc. I think\nyou can look forward in Milwaukee to a stimulating session and plenty of gemutlichkeit.\nNew Journal Format\nWe are constantly striving to improve our publications, which we realize are not\nwhat they might be if we had more money to put into them. But the January-February\nissue of the Journal reflects some of the steps now being undertaken by the staff and\nthe Publications Committee to make as many improvements as possible within the means\navailable. We feel that the new format gives the Journal a more professional appear¬\nance, and we hope you agree. We are also considering an arrangement whereby four\nissues of the Journal would be highly \"professional” in nature, with the other two\nserving a broader purpose, because we realize that the lack of a general magazine\nforces us occasionally to include items in the present Journal which do not properly\nbelong in a truly profession journal.\nInternational Activities\nThree months ago the NAEB entered into a contract with the Government of Ameri¬\ncan Samoa to supervise the installation of a television system for the Samoan schools.\nWe will be responsible for plans for transmitters, studios, all design engineering,\nand the employment of station and teaching personnel. The exciting aspect of this\nproject is that this will be the only case anywhere in the world where an entire\nnational school system is planned to utilize TV as the core of the instructional pro¬\ncess. It will become an international showcase--a sort of \"Hagerstown of the South\nPacific.\"\nOur two-year contract with AID to provide assistance to the Republic of the\nSudan in radio was originally scheduled to terminate next month, but AID has extended\nit until June, 1964. We believe this is a good indication of the value of the project\nto the Sudanese government."
}