{
  "id": "d1020-107",
  "text": "CONFIDENTS\n,6) I^JSE2E3 Sines Wallace Garnsau, in charge of the Western State\nteachers College5 i?M station, had. earlier told ms of their acquisition of a\nmore powerful ^tranen&iter, which they were able to purchase from a Battle\nCreek comprcial F$! station which had discontinued operations, m stopped\nhers at his request to give him technical advice, provided Cecil Bidl&ck.\nme^problem as essentially one of what to do to avoid interference with tele-\np.sion as they go to the higher power, I believe this problem need not be\nfurther outlined her© since it is a technical cue,\n., ^23® Most inportani aspects of the acquisition of the new trans-\nmitver^ is to fact that it was made possible by a grant, from to ¥. K\nKellogg Foundation,\nGarneau had earlier called me on this to see if 1 thought this would\nin endanger the MEDte relations or nbatus with Kellogg. Since it\n^ Battle Creek station that was involved, and since this was the first\nbroadcast problem in which Di\\ Seuy (in the absence of Bob FanDuyn), parson-\nany oecam© interested, 1 % old Wallace that tern sure we wouldnst want' to hold\nhim' up.\nIn my meeting with Dr, Sesy, I expressod our pleasure at their support\nto the extent of some |7g00, of tills MAEB lumber station,\n7) Q^gjjgy atop cn to four-dey trip was the Conrad-Hilton Hotel\nwhere, by previous appointment, I spent a low hours with G„ H. Griffiths of 5\nthe FAE. A number of the recent notes of which you have been receiving copies\nare -one outgrowta of this discussion. Also discussed with him were the meet-\n:mgs^ ceing held in Washington, the re suite of which the FAE will probably\nmiU.ht before making way fundamental long-range comraitraents to anyone, and an\ninformal discussion of what sort of support would be adequate for the ?MB ‘in\ncase of possible discontinuance of to Kellogg grant and assumption of Wash-\ningfton office and public relations possibilities commensurate with our re^on^\nsibilities. “\n1x1 ‘fchis context, I think it is essential that we not delay unduly getting\nan answer out of Kellogg on the Washington office. For Mr, Griffiths indicated\nto^me the fact that they would like to take a look at a complete oropossl for\nf total fiAEB operation in cose we believe that we could assure all or a por¬\ntion of the tasks and duties now carried on by other FAE financed organiza¬\ntions. This ig_ strictly confidantiaL and strictly conjectural and indefinite.\nneedless vo say, we noth Kept the discussion in this regard on an extram*!?\ngeneral and inconclusive level. However, the desirability of a statement of\ni-he long term fiscal needs and plans of the MAEB combining in a single picture\nour entire budget, regardless of source, appears important. 1 hot?, with the\nhelp of Frank Schooley and Harold Hill, to have this reaqy for you at the time\nof the Directors9 Meetings in lew York,\nIn general way, 1 reiterated the general sort of statements I had ear-\nte-er made in the comments on the Galkins questions which you earlier received.\n1 should like to state that’I have never left a meeting with Mr. Griffiths\nwithout feeling that a warm rapport exists. I believe he is convinced of the\nfac-G that we can and do, more economically than anyone else, perform maay of"
}