{
  "id": "d1020-119",
  "text": "NATIONAL ASSOCIATION\" OF EDUCATIONAL BROADCASTERS\nOFFICE OF THE PRESIDENT\nio-n-54\nDear Prank,\na\nI am enclosing jo# copy of the notes on our meeting last\nweek* Wish we could have tiken time to into further\nsteps in implementing the outline and financing it*\nIf you have any time on your hands, put your fertile\nmind to work and see what you can come up id. th*\nOne of the things I am most eager to have your ideas\non the Question of location of headquarters and the\nopening of a Washington office* You have never spoken\nfrankly about our moving from the U* of I* Do you\nthfnk it is necessary and inevitable? I cannot get a\npositive statement from any one on this. You know that\nI have always been strong for keeping the office there—\ndid perhaps more talking than anyone elde in getting\nit located there in the first place— and have always\nresisted suggestions that it be moved; hoivjever, in the\npast year, I get more and more the impression that you\nand Schramm believe it should be moved and must be moved—\nless from you than from Wilbur* I think you know that\nI prefer to see the office remain there. On the other\nhand, if you and Wilbur feel that it should be moved,\nwe need to be planning toward that move. How about an\nhonest evaluation of this?\nIt seems unlikely that we could afford to move the whole\noperation to Washington, though I think there is much to\nbe said for keeping the entire force together, because of\nthe high rental we should have to pay. On the other hand,\nI am convinced, as I have been for two years, that we must\nhave a Washington office. If we must move from Illinois,\nhow about Ann Arbor or East Lansing. I am sure they would\nlike to have the operation at Michigan State and the space\nand services for the Agriculture project get free sailing\ntSaS?0* ¥e could assume that the same would kapply to\nNAEB.\nThink it over and let me know.\nThe dinner at the Schooley Showspot was wonderful* I\nalways enjoy seeing your very lovely 'wife and those\nmarvelous youngsters of yours. Please thank Eleanor for\nme .\nLook forward to seeing you in New York,"
}