{
  "id": "d1020-76",
  "text": "Report on attendance at CNO TV Workshop\nI would like to mention that Harry Lamb also represented the\nMSB at this meeting, but at his own expense. Ho was also a member of\nthe Hoet Committee for the workshop.\nAll in all, I felt that this workshop was very worthwhile for\nall of the participants. I(m sure they all left Toledo with a keener\nawareness of the potentialities of television as a tool for furthering\ntheir educational and informational program, and a better insight and\nknowledge of how to plan television programs.\nSo far as the value of my presence is concerned, I feel that\nthe comments that I mad© in meetings acquainted the participants with\nthe work of the HAEB, and I mad© every effort to explain how our organ¬\nization could b© of help in one way or another. I feel that my meeting\nwith the CNO TV Committee was very valuable, because a lot of these\npeople were not at all familiar with our organization or what we ax1©\ndoing. I had many conversations with individuals who were interested\nin learning more about the NAJKB. I repeatedly suggested that our\nmembers, in different communities, would be more than glad to help the\nrepresentatives of national organizations do a better job through\ntelevision, and radio, I might add.\nDuring one of our evening sessions w© heard from representa¬\ntives of the JCET (Walter Etay), NCGET (Betty Colclough), ETRG (Hunter\ntalked for them, since they were unable to sond anyone down), and other\ngroups. I later pointed out to Malcolm Knowles, Workshop Director,\nand Lois McCarthy, Executive Secretary of GKO, that I felt that the\nMSB should have been represented on this panel, since w© are really\nin a better position to help these people at the Bgraas roots® level\nthan are any of the other organisations mentioned.. Both of them said\nthat they realised too late that this was probably true. However, I\nthink that I had ample opportunity to expound the merits of NAEB in the\nmaty group discussions, and this I did on what I consider a very sound\nbasis.\nIncidentally, the Willys camera chain was quite interesting.\nIt will sell for about 17,000-8,000, uses a vldicon, rather than an\niffiago-orthicon tube, usee 16am lenses, and, after some of the bugs have\nbeen worked out, may be vary useful to low budget educational stations\njust getting started. This workshop was used as a sort of ^shakedown\ncruise® for the equipment. I could probably supply more detailed\ninformation, not too technical, if you want it. (The technical data on\nthe Willys TV package was distributed with the August 1953 Newsletter.)\nI have attached a list of those attending the workshop for\nyour information.\nThis is a rather brief report of say activities and of the GKO\nWorkshop, but I have more detailed information in say files which can bs\nmad© readily available."
}