{
  "id": "d1651-1",
  "text": "-2-\nIn 1963, NEA-DAVI initiated a conference of 47 institutions and organizations\n(including NAEB) to discuss the proposed revisions of the copyright law and to\ndetermine what steps education should take. The first step was to establish a\nwidely-representative Ad hoc Committee on Copyright Law Revisions (including\nNAEB). ~ ~\nThis committee held a number of meetings and, in addition, attorneys for NEA, NET,\nand NAEB held many drafting sessions. The outcome was the formulation of a\ncommon position for the education profession.\nA statement on behalf of education, endorsed by 25 educational organizations\n(including NAEB and NET) was presented at the Copyright Panel Meeting at the\nLibrary of Congress, January 18, 1964. Because education has been slow in\nparticipating in the various hearings the Register of Copyrights has been conducting,\nthis presentation representing a marshalling of such widespread representational\nstrength took many by surprise and created a considerable impression.\nOne of the first reactions was an approach by the textbook publishers to talk over\ndifferences with the Ad Roc Committee. This session was held February 11 with\npresidents of several publishing firms and representatives of the Book Publisher’s\nCouncil and the American Textbook Publishers Institute. Similar discussions may\nbe held in the near future with representatives of magazine publishers and other\ngroups having views differing from the position education has taken. Such confer¬\nences will be part of a continuing activity of the Ad Hoc Committee as it seeks to\nshape and refine its position statement in preparation for the Congressional hearings\non Copyright Law Revisions.\nAmendment or a New Copyright Law?\nAnalysis of the present copyright law and of current proposals for its revision led\nthe Ad Hoc Committee to the conclusion that the copyright law has clearly failed\nto keep up with technological developments of the present and is quite inadequate\nto the developments which can be predicted. In fact, the matter is so complex and\ncomplicated that many feel that the best solution would be to start from scratch with\na whole new approach, rather than try to patch up the present outmoded law. The\nCommittee was finally convinced, however, that there was no likelihood that this\ncould be done and that the only possible way to obtain any improvement in the\npresent requirements was through amendment of the existing copyright law.\n(3) Many more are expected to add their endorsement when there is time to follow\nconstituted procedures.\n(4) Fcr example: AAUW, AASA, AACT, ACE, Council of Chief State School Officers,\nand the National School Boards Association."
}