{
  "id": "d1651-2",
  "text": "-3-\nEducation's Objectives\nEducation needs to be allowed to perform its vital role in our society and to do this,\nnon-profit educational institutions must have maximum availability of teaching\nmaterials and resources. Congress has said that the national interest requires\nspecial recognition for education under the Copyright Law; this recognition, however,\nhas not been heretofore fully achieved and is now threatened with virtual extinction.\nSeveral revisions proposed would seriously restrict the use of new media in\neducation and tend to reverse the trend toward increased use of the electronic\nmedia for instruction. Education needs:\n1. a more effective and more inclusive special recognition for education than\nthe one already written into the copyright law by the “for profit” limitation;\n2. clarification of “fair use” in the law so that educators may readily know\nwhat they can legally use in the educational process; and\n3. a logical and reasonable extension of present rights accorded education.\nProposed Changes in Copyright Law\nThe present copyright law does not afford copyright owners proper protection; at the\nsame time the clearly expressed Congressional policy to protect education's interest\nunder the copyright law has been partially thwarted by its failure to keep up with\ntechnology.\nThe proposed changes, however, not only fail to improve the situation for “bona fide”\neducational uses of copyrighted materials, but threaten to diminish or eliminate the\npresent inadequate protections. In particular, education is concerned about these\ncopyright revisions:\n1. Elimination of “for profit” provision\nThe present law states a basic public policy that education shall have certain prior\nrights of full and complete access to specific types of copyrighted materials, i.e.,\ncopyrighted historical, political, and musical material so long as it is not dramatized\nand is not performed “for profit.”\nThe Register's draft bill of 1963 suggests an alternative to the “for profit”\nprovision which would radically change the present situation by depriving education\nin general and educational broadcasting in particular of its present legal permission\nto perform non-dramatic literary and musical copyrighted materials i (Such a\nprovision would prevent the use on educational radio or television of non-dramatic\ncopyrighted materials without first obtaining permission or paying royalties.)\n2. Elimination of “fair use” doctrine\nUnder the present law, the hinderances placed upon education have been alleviated\nto some extent by the judicially-developed doctrine of “fair use”, i.e., the\nreproduction of a small part of a work to illustrate a classroom lesson or the broad¬\ncast of a portion of a piece of music or televising a section of a map in which the\nuse is limited and in circumstances where there is a reasonable purpose which is\nnon-competitive with the copyright owner's market. However, there is no statute"
}