{
  "id": "d1651-4",
  "text": "-5-\n“Anything to the contrary in this title notwithstanding, no protection or exclusive\nright granted or provided under this title shall include the right to prevent use by\nrecognized non-profit educational institutions or organizations --\n(a) of non-dramatic copyrighted works for non-commercial purposes, provided\nthat such use shall not permit more than a single copy or recording of\nsuch copyrighted works (5)\n(b) of dramatic copyrighted works for performance within non-profit educational\ninstitutions or organizations, which performance is limited to or directed at\nthe students or faculty thereof and is available without an admission fee\nbeing charged to such students and faculty, provided that such use shall\nnot permit more than a single copy or recording and only of a performance\nin which the performers are limited to such students and faculty,\n(c) of excerpts or portions of non-dramatic or dramatic copyrighted works for\nillustrative, critical or similar educational purposes, provided that such\nexcerpts are clearly identified as to sources and copyright holders,\n--where no commercial advertising is included, nor other private financial gain is\ninvolved.\nWhat use would the Ad Hoc Committee’s proposals authorize education to make of\ncopyrighted works? Where no commercial advertising is included nor other private\nfinancial gain is involved, the following use by education would be allowed with¬\nout royalty payments or prior clearances:\nI. As to an entire copyrighted work:\nA. For non-dramatic works\n1* performance (i.e., “live” use) would be permitted for all non¬\ncommercial educational purposes (i.e., classroom use, educational\nclosed circuit TV, educational TV stations, and other educational\nuses except on commercial TV stations) and\n2* a single copy or recording would be permitted of each such use. (5)\nB. For dramatic works:\n1* performance would be permitted within non-profit educational\ninstitutions or organizations under specific circumstances; and\n2* a single copy or recording would be permitted of each such use\nonly where the performers were limited to such students and faculty.\nII. As to excerpts or portions of either a dramatic or non-dramatic works,\n“live performance” as well as multiple copies would be permitted only\nfor illustrative, critical or similar educational purposes and only where there\nis clear identification as to sources and copyright holders. The present draft\n~.fiLo.es. n.ot. specify any definition of excerpts or portions.”\n(5) This point is not satisfactory to NET and NAEB. It is scheduled for further\ndiscussion by the Committee."
}