{
  "id": "d1651-5",
  "text": "-6-\nCopyright and the Constitution - Public Interest Considerations\nSome argue that copyright is a constitutional right and consequently Congress has\nno authority to limit this property right. Actually, the Constitution grants no rights\nto authors; it merely grants power to Congress to enact copyright legislation. Since\ncopyright protection is solely a matter of statute, the author’s privilege may be\nlimited or withheld by Congress at its discretion. This view has been supported by\nboth the legislature and the judiciary.\nThe House Report on the present copyright law stated that such rights were to be\ngiven '“not primarily for the benefit of the author, but primarily for the benefit of\nthe public.” In a unanimous opinion of the Supreme Court, Chief Justice Hughes .\nwrote: “The sole interest of the United States and the primary object in conferring\nthe monopoly lie in the general benefit derived by the public from the labors of\nauthors.”\nA report to Congress by the Register of Copyrights also reflects this view: “Within\nlimits the author’s interests coincide with those of the public, when they conflict,\nthe public interest must prevail ... And the interests of authors must yield to the\npublic welfare when they conflict ... The needs of all groups must be taken into\naccount. But these needs must also be weighed in the light of the paramount\npublic interest.”\nEducation is of paramount public interest and education is the most universal\nexpression of public interest in the United States.\nProbable Time Table\nThe Copyright Office is now completing the preliminary drafting of an actual bill\nand hopes to have it completed for presentation to Congress in 1964 - possibly in\nlate spring. Extensive hearings will then be held before the Judiciary Committees\nfo the House and Senate, though it is not expected that such hearings will be\nscheduled before fall.\nWhen such hearings are held, everyone concerned will have an opportunity to\nexpress his views via written and/or oral testimony. The statement in behalf of the\neducational organizations group will be presented and NAEB (and possibly several\nof its Divisions) will testify or file statements.\nIt is likely that these hearings will extend over a considerable period and that there\nwill be no enactment in 1964. In that case, the bill will need to be re-introduced\nin the new Congress, together with possible revisions suggested by the 19 64\nhearings.\nHowever long the revision of the Copyright Law may take, it is evident that\nrepresentations to the Register right now, during the period when he is casting the\nbill, are apt to have more effect than at any subsequent point in the course of this\nlegislation. Anyone wishing to endorse the recommendations and proposals of the\nAd Hoc Committee or express any other view should make his wishes known to\nschool board officials, educational administrators, and others in their state and in"
}