{
  "id": "d1651-6",
  "text": "-7-\nWashington who may have responsibility for dealing with this matter. The Register\nof Copyrights is Mr* Abraham L. Kaminstein, Library of Congress, Washington, D. C.\nSome Personal Observations\nAs has been pointed out, the present concept of copyright is outmoded, but how the\nlaw is to be altered so as to accommodate technological changes and still preserve\na fair balance between the rights of the author and the public interest is a far from\nsimple matter, and despite the built-in biases of educational people, far from black\nand white.\nTo begin, educators are both users and producers of copyrighted materials; faculty\npeople write books as well as use them; educational stations copyright programs as\nwell as broadcast them, staff writers copyright scripts as well as utilize copyrighted\nmaterials in their own scripts, etc. Consequently, the educational community has a\nstake in both reasonable access to copyrighted materials but also in reasonable\nprotection under the law for the intellectual products it creates.\nMoreover, education, which readily asserts its need for access to copyrighted\nmaterials for effective teaching uses, would be shortsighted, indeed, to be so\ninsistent upon privilege as to dry up the wells of creativity upon which it depends.\nThere is a Russian fable about a pig who, after eating his fill of acorns, began\nrooting around under the oak tree. A crow remarks, “If you lay bare the roots, the\ntree will wither and die.\" “Let it die,” replied the pig, “whocares as long as there\nare acorns?”\nUnderstandably, educational broadcasters will have a passionate addiction to\nadvancing legislation in ways which enhance their opportunities for more likely\nachievement of their goals and responsibilities, but we would be derelict in our\nprofessional and civic responsibilities if we did not make a sincere effort, while\nhaving a proper concern for our special interests, to work for a law which would\nprevent unethical, unrestrained, and flagrant abuse of the legal rights of authors\nwith respect to the form of use of their work. The publishing industry would seem\nto have a stake in educational broadcasting because of the promotion it can provide\nfor published materials and the stimulation of reading interest. Film producers have\na stake in educational broadcasting because of the increased demand for their films\nwhich result from their viewing on ETV. The trick is to write a law which will\nencourage the fullest use by educators of copyrighted materials for educational\npurposes that are consistent with a reasonable protection of author’s rights. Hope¬\nfully, we can develop a law which will eliminate confusion and manifest inequities\nand benefit the broadcaster, the author, the publisher - and the public.\nThis will require some educational statesmanship to bring about a synthesis of\nprivate interests and the general public interest (which we equate with that of\neducation.) Furthermore, though there might be temptations for broadcasters to\nmake special “deals” outside fo the educational community, this would ultimately\nbe aginst our best interests. There is substantial unity among commercial interests\nin sponsoring amendments antithetical to educator’s interests. Cohesion and joint\norganizational action are needed to make education persuasive where needed."
}