{
  "id": "d1064-1",
  "text": "-2-\nQ. Are sectarian groups excluded?'\nA. No, if they meet all other qualifications.\nQ,. How will the Health, Education and Welfare Department determine who will\nreceive grants?\nA. The Act provides in Section 392(d) that criteria will be established by\nregulations designed to achieve (l) prompt and effective use of all educational tele¬\nvision channels remaining available, (2) equitable geographical distribution of edu¬\ncational television broadcasting facilities throughout the States, and (3) provision\nof educational television broadcasting facilities which will serve the greatest num¬\nber of persons and serve them in as many areas as possible, and which are adaptable\nto the broadest educational uses.\nQ. How will the matching funds provision work?\nA. The intent of the Act is to provide Federal assistance for the construc¬\ntion of educational television stations, and that a grant shall not ordinarily ex¬\nceed 50% of the cost of the project proposed. The remaining 50% is to be advanced\nby the applicant. In addition, the applicant must furnish assurance that the neces¬\nsary funds to operate and maintain the station will be available when needed (Sec.\n392(a)(3)).\nQ. Can the station receiving a grant carry a limited amount of non-\neducational programming to assist in raising operating revenue?\nA. No — there is an absolute prohibition against using the station for any¬\nthing but educational purposes.\nQ. When can an applicant secure more than 50% of the proposed cost of the\nproject?\nA. When the applicant has constructed one or more educational TV stations,\nan extra credit will be given, not to exceed 25% of the reasonable cost of the existing\nfacilities. If this extra allowance is made, the total award made by the Health, Edu¬\ncation and Welfare Department cannot exceed 75% of the new project. (Sec. 392(e)).\nQ. What can be purchased with the Federal funds?\nA. Section 394(2) provides that: The term \"construction\", as applied to\neducational television broadcasting facilities, means the acquisition and installa¬\ntion of transmission apparatus (including towers, microwave equipment, boosters,\ntranslators, repeaters, mobile equipment, and video-recording equipment) necessary\nfor television broadcasting, including apparatus which may incidentally be used for\ntransmitting closed circuit television programs, but does not include the construc¬\ntion or repair of structures to house such apparatus.\nQ. Are cameras included in the list of eligible items?\nA. This is questionable, since they are not specifically enumerated.\nQ. Does this provision — Section 394(2) — mean that only eligible items\ncan be bought with the matching funds of the applicant?\nA. No, it is the clear intent of the legislation that the applicant submit\nhis project — showing the total cost of eligible and non-eligible items. The Fed¬\neral grant can cover the eligible ones, and the matching funds can cover non-eligible\nor eligible items whether equipment, building or other construction."
}