{
  "id": "d1829-0",
  "text": "1\nN\nA\nE\n[\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL URBAN A, ILLINOIS\nNAEB and the OHIO STATE AWARDS\nNAEB member’s radio programs walked off with\nmany of the Ohio State Radio Awards this year.\nThe University of Chicago won a first award in\nthe special interest group of programs heard na¬\ntionally for “The Sacred Note,” a program of religious\nmusic. “To Make Men Free,” produced by WUOM,\nUniversity of Michigan, won first in the special in¬\nterest programs heard regionally. “America On\nStage,” produced by WHA, University of Wisconsin,\nwon honorable mention in the cultural category.\nNAEB members almost made a clean sweep in the\nfield of in-school programs. First award for primary\nprograms went to WYNE, New York’s Board of Ed-\nucation Station for “Tales from the Four Winds.”\nTwo honorable mentions in the same class went to\n“Story Time,” by WOSU, Ohio State, and “Old\nTales and New” by Minnesota’s School of the Air\nand KUOM, University of Minnesota. The latter also\nwon a first award for in-school intermediate programs\nwith “Let’s Take a Look at Our Minnesota and It’s\nPeople.”\nFor local stations, first award in the special in¬\nterest category went to “In Spirit and In Truth” by\nWAER, Syracuse University. Honorable mention in\ncultural programs was given to “Behind the Scenes\nin Music” by WNYC, New York, and the National\nOrchestral Association, Inc.\nWinning first in the children’s out-of-school pro¬\ngrams was the University of Michigan’s Department\nof Speech and WWJ, Detroit, for “Down Story Book\nLane.” Honorable mention in the same class went to\n“Little Orchestra Society Children’s Concerts” by\nWNYC and the Little Orchestra Society.\nFor locally aired in-school programs for primary\ngrades, “Just Why Stories,” KSLH of the St. Louis\nBoard of Education, and “Fun and Fancy - Listen\nAwhile,” by the Stanislaus County Schools in Mo¬\ndesto, California, and KBEE, won honorable men¬\ntions.\nNAEB Newsletter\nVol. XXII, No. 6\nJune, 1957\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14 Gregory\nHall, Urbana, III., $5 a year, edited by Mrs. Judith Stevens.\nApplication for 2nd class mail privileges pending at Urbana,\nIllinois.\nFirst award in the intermediate grade category\nwent to “What’s News” produced by the School Dis¬\ntrict of Philadelphia and WFIL. Honorable mention\nwent to “Music for You,” by the South Dakota\nSchool of the Air and KUSD, University of South\nDakota.\n“Out of the Past - Listen Awhile,” produced by\nthe aforementioned Stanislaus County Schools, won\nfirst award for in-school programs for junior and\nsenior high level. Honorable mention went to “Tales\nfrom Medicine Lodge and Kiva” by the Indiana\nSchool of the Sky, Indiana University. Many of these\nfine programs can be heard now over the NAEB\nRadio Network.\nWe were also pleased to note the many awards\nwon by NAEB members in TV. Leading all stations\nas top winner was KQED, San Francisco, for “Hop,\nSkip and Dance,” “The American Economy,” and\n“Personal and Social Adjustment.”\nThe University of Wisconsin’s “Friendly Giant”\nwon its third first place award. Other NAEB TV\nstations winning Ohio State Awards were: WOI-TV,\nWGBH-TV, WQED, WKNO-TV, WTTW, and\nKETC.\n—NAEB—\nThe Fund for Adult Education has announced the\n1958-59 fellowship and scholarship program for the\nmass media. Applicants write for further information\nto: Leadership Training Awards (Mass Media), The\nFund for Adult Education, 320 Westchester Avenue,\nWhite Plains, New York.\n1"
}