{
  "id": "d1480-0",
  "text": "NAEB NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nA. James Ebel, Editor, Station WILL, Urbana, III,\nFebruary 1946,\nEDUCATIONAL INTERESTS WELL REF RESENTED AT CLEAR CHANNEL HEARINGS,\nThe first section of the Clear Channel Hearings, held January I4-»I7, before\nTHE FCC BROUGHT FORTH THE FOLLOWING?\n1, Educational stations are doing an outstanding job of public ser¬\nvice, Everyone who testified during the first three days of the hearings\nindicated satisfaction with the farm and public service programs of these\nstations, and not once was there any evidence offered to the contrary.\nEducational stations are urging that the Clear Channels be broken down in\nfavor of more educational facilities wwmE more overall broadcast service\nCAN BE shown BY SUCH A CHANGE,\n2, Regional broadcasters and farm organizations are urging breakdown\nOF THE Clear Channels on the charge that clear stations fail to provide\nsatisfactory SEf'^VICE TO RURAL AREAS,\n3, The USDA recommends that FCC require broadcasters to provide\nADEQUATE AND SUITABLE TIME FOR FARM PROGRAMS—NOT ONLY EARLY MORNING HOURS,\nFurthermore they critize farm programs on clear channel stations as being\nOF NECESSITY TOO GENERAL AND NOT DIRECTED TO THE NEEDS OF THE LOCAL SITU¬\nATION,\n4, Technical reports indicate that changes will be made in the engineer¬\ning REGULATIONS INVOLVING INTERFERENCE, COVERAGE, AND ALLOCATIONS IN GEN¬\nERAL, More time is necessary to collect all the needed data,\n5, Clear channel stations had very little chance to present their,\nCASE but indications ARE THAT THEY WILL SHOW THAT RATES FOR CLEAR CHANNEL\nTIME AHEN'T always GREATER THAN FOR OTHER CLASSES OF STATIONS, AND THAT\nCLEAR channel service CAMNQT BE DUPLICATED OR REPLACED BY OTHER CLASSES\nOF^OPERAT I ON , T\nReporting directly for educational institutions were Bob Coleman of\nWKAR, President Bevis of Ohio State University, and your editor for the\nNAEB, Bob made a fine presentation of the operation of a typical individual\neducationally owned and operated station. He was able to point out numerous\ninstances of public service which stood under Mr. Caldwells cross examin¬\nation, He also showed the severe limitation of their operations due to\nTHE FACT that THEY OPERATED AS A SECONDARY STATION ON A CLEAR CHANNEL AND\nWERE NOT AUTHORIZED FOR NIGHT OPERATION AT ALL,\nHoward L. Bevis, chairman of the radio committee for the Association\nOF Land Grant Colleges and Universities urged that (a) the present system\nOF CLEAR channels BE MODIFIED, (b) THAT THE SYSTEM BE NOT COMPLETELY\nABANDONED (c) CLEAR CHANNEL STATIONS GIVING EXCLUSIVE COVERAGE TO REMOTE\nRURAL AREAS BE PROTECTED, ( 0) THAT CLEAR CHANNEL STATIONS SERVING AREAS"
}