{
  "id": "d1480-22",
  "text": "PROGRAM POOLING\nFor the day which the great networks * anxious to maintain their virtual\nmonopoly over *he conduits for radio talent, have for so long sought to defer\nid here. One of radio's greatest needs can now be met, Through transcription#\nan independent outlet for creative writer# is available, unfettered by the\nadvertisers9 fear of giving anyone offense or their narrow preconceptions of\n\"what goes.\" Quality programs of enduring interest (for repeated use), or\ntailor-made for special occasions or particular localities, can be made avail¬\nable to all.\nPRODUCTION CENTER\nBut who is going to write them, produce and act. them? Educator* and\nothers Interested in radioes public service need to establish rapidly (oih a\nwill soon be in the field) a radio production center, to undertake the sped} :\n<;ask of building up the market for public service program# by quality produc\nThis may yet prove to be a revolution in broadcasting, and, consequently, in t\nadvancement of our culture and the perfection of democracy Some of the r.cU\naspects of the center's establishment are worth sketching in The prise ty r\nfor the center's output would be public service FM and AM stations A\n(and ultimately lucrative) market will be local commercial stations as \\.ho mcr : t\nof the center's products is orogresaively demonstrated There will be r ru\nsscope for exports to countries abroad.\nRADIO CENTER STAFF\nThe staff of the center need not be large. Ever half a doren writer *\nreal talent could work miracles, supported by an eouivalent team of producer-\nconcerned to heave radio out of its artistic nit They will need adequate\nremuneration, more than a pittance But the salaries offered to a few top- o to,\nwriters and producers in commercial radio are not necessary Artists are no\ngold diggers. Many writers and producers in commercial radio today would fl\nsacrifice a fortune for artistic freedom There will be those who , return!u,-\nfrom the war, will feel nauseated by the commercialism that has been sup a\non the integrity of self-expression. They will go to great lengths to aw\na return to the old humiliating bondage Many will have new thoughts, frerh\nvision to communicate, tempered and refined in the fire of war*s experience\nPublic service broadcasting and the production center will attract the\nProduction costs will not be high. Stars and their astronomical re*\nare not necessary to good casting. This is a fetish and a fiction imposed or\nus by commercial radio. There are already rumer as in -tanc^s of programs by\nunknown writers and producers presented with unknown casta which have won\naudiences than competing programs in the big-money category"
}