{
  "id": "d1290-3",
  "text": "NAEB NEWS LETTER......._\nA t N 8 T ELECTRONICS WONDERFUL\nPage 4\nJune I , 1945\nThe General Electric Company in Schenectady, New York, has announced the\nDEVELOPMENT OF A SO-CALLED ELECTRONIC \"SMELLER.H It IS DESIGNED TO DETECT\nTHE PRESENCE OF HARMFUL MERCURY VAPORS WHICH MIGHT BE INJURIOUS TO THE\nHEALTH 'OF WORKERS.\nThis is nothing new to our transmitter staff. They claim they have been\nLISTENING TO AND LOGGING ELECTRONIC SMELLERS FOR THE LAST SEVEN YEARS.\nH1GGY ENTERTAINS YOUR EDITOR AT WOSU\nLate last February your editor found himself in Columbus with an Illinois\nBASKETBALL TEAM WHICH LATER THAT EVENING WAS GOING TO TAKE A TERRIFIC\nDRUBBING. Said unfortunate incident not having yet happened, your eoitor\nin high spirits called upon and was royally entertained by one Robert\nHlGGY— DIRECTOR OF WCSU, PROF. OF ELECTRICAL ENGINEERING, AND A DARNED\nGOOD ENGINEER NO MATTER HOW YOU FIGURE IT.\nHe SHOWED ME a STUDIO LAYOUT WHICH HAD BEEN OUTGROWN BY THE TREMENDOUS\nEXPANSION OF WOSU BROADCASTING ACTIVITIES AND THEN MADE MY MOUTH WATER BY\nPOINTING OUT THAT THEY HAD VERY HIGH PRIORITY ON THE CAMPUS POST WAR\nBUILDING PROGRAM FOR A $<50,000 STUDIO BUILDING. As IF THAT WEREN * T\nSUFFICIENT HE POINTED PROUDLY TO A PROGRAM SCHEDULE THAT WAS FULL OF FINE\nLOCAL FEATURES PLUS NETWORK AUGMENTATION FROM C8S, MUTUAL, AND BLUE. I\nSAW THE FARM HOUR IN PROGRESS, AND MUCH TO MY SURPRISE FOUND THE LEADING\nMALE SOLOIST TO 8E NONE OTHER THAN SCHMIDT, POLE VAULT CHAMPION OF THE\nBig Ten. I saw a record library of 600 albums and 1000 single records\nDONATEO TO THE STATION BY Dean VlVIAN, HEAD OF THE COLLEGE OF AGRICULTURE\nBEFORE HIS DEATH. THIS WAS IN ADDITION TO THE REGULAR WOSU LIBRARY OF\nMUSIC ON RECORD AND TRANSCRIPTION.\nSuch an institution as WOSU «s bound to have an interesting history.\nIt was on March 23, 1920, that the university received its first experi¬\nmental LICENSE AUTHORIZING IT TO OPERATE FOR ONE YEAR ON EITHER 200 OR\n375 METERS WITH A POWER OF 1.8 KILOWATTS AND THE CALL LETTERS OF 8 XIe\nThe FIRST BROADCAST WAS ON April 20.\nToday WOSU is on the air an average of 72 hours a week, with a wide\nVARIETY OF BROADCASTS—MUSIC, DRAMA, NEWS, FARM INFORMATION, LECTURES\nFROM UNIVERSITY CLASSROOMS, A REGULAR SUNDAY AFTERNOON FORUM.\nTWO MAJOR ACTIVITIES OF THE UNIVERSITY STATION ARE THE \"OHIO SCHOOL OF THE\nA|R% BROADCASTING PROGRAMS FOR CLASSROOM USE IN THE SCHOOLS OF THE STATE,\nand the “Radio College*', broadcasting courses in languages, social sciences\nMUSIC APPRFCIAT I ON, AND OTHER SUBJECTS FOR ADULTS.\nOhio State's electrical engineering department began to experiment in\nWIRELESS TELEGRAPHY AROUND THE TURN OF THE CENTURY. By l9<3 THE UNIVERSITY\nHAD A GOOD STATION WHICH, DURING THE FLOOD OF THAT YEAR, WAS ONE OF THE\nfew ways Columbus had of keeping in touch with the outside world.\nThe Ohio State broadcast of April 20, 1920, was the first to be made from\ncentral Ohio, and it was heard over a radius of 120 miles—exceeoing all\nEXPECTAT » ONS."
}