{
  "id": "d1566-0",
  "text": "NAEB BUSINESS MEETING HELD AT COLUMBUS\nRepresentatives of nine member stations met in a \"work session\" on May 4,\nduring the Annual Institute on Education by Radio, and discussed numerous questions\nwhich can most effectively be handled by such a group. Members represented were\nWOSU, WSUI, WHA, MAD, WCAL, KFKU, W1XAL, WILL, and WBAA. President H. B.\nMcCarty presided and directed discussion on these pointer\nDefinition of Objectives of Association? Members expressed the desire to maintain\nthe objective of improving facilities controlled by institutions, and to en¬\ncourage wider radio activities in institutions having acess to private\nstations.\nRecording Equipment: The Associations transcription equipment has been circulating\namong members. It is available to any who wish to use it. The hope is to\nhave this machine demonstrate what can be done, and to encourage stations\nto secure their own equipment. Several member stations already own their\nrecorders. Difficulties of operation were discussed, and Mr. Menzer ex¬\nplained the need for intelligent handling to get uniformly good results.\nRadio Dramatic Guild? The plan and proposal for a national organization of student\nradio dramatics activities devised by the University of Florida, and sub¬\nmitted by Major Garland Powell was considered. Sponsorship by the NAEB was\nsuggested.\nWhile representatives agreed upon the desirability of local radio\ndramatics groups, there was no general enthusiasm for a national linking\nbecause of the formal organization entailed. Several opposed it on the\nbasis of a loss of control over the activities by the stations. Most had\nworked out local plans which are functioning satisfactorily and hesitated\nto disturb them.\nThe majority opinion was that, as an organization, the Association\nshould not foster such a national organization but that members wishing to\nhave their players groups enter such a venture should be free to do so.\nIt was believed that with such definite plans and details as Major Powell\nhad ready, it would be possible to find a nucleus of groups to affiliate\nthemselves in a larger body.\n1957 Convention Plans: Three member stations invited the Association to hold\nits 1957 national convention with them. They were WESG, Cornell, represented\nby Mr. Chas. A. Taylor,* WBAA, Purdue, by Mr. Clarence Dammon; and WILL,\nIllinois, by Mr. Jos. F. Wright. It was decided to select a meeting place\nand a date by letter survey. The reply sheet is being sent to all members.\nThe President will appoint a committee on arrangements.\nMcCARTY ADDRESSES INSTITUTE\nspoke in behalf of the Association on\nIt was a concise, vivid picture of\nthe radio field. In analyzing the\nsituation he dug to the roots of a sore-spot which socially minded people declare\nneeds attention. A copy of the complete talk will be included with the June\nNews-Letter.\nH. B. McCarty, president of the NAEB,\nthe subject \"Why tne Educational Station\",\nthe place of the institutional station in\nN\nl-A-l\nEH\nB 1\nN EW S !\nh~\n1—\ni_l!\n_i\nE!\nNational Association of Educational Broadcasters\nMadison, Wisconsin — May 19, 1957"
}