{
  "id": "d196-1",
  "text": "Hovey — 2.\nSome strollers turn left at this end of the Cobso and walk through a public park\nbehind the government palace. There they may pause to watch the kids, darting around the\nbase of a huge st' tue of the great master, Perugino, or under an arcaded passage of the\npalazzo, playing hide-and-seek, or Mafia and carabiniere, or even cowboy and Indian.\nOther strollers reach the great square at the opposite end of the Corso. There they\ncircle the 13th century fountain masterpiece of the illustrious Tuscan father and son,\ni iccolo and Giovanni Pisano. Or they cross the squsre and turn around for an always-\nrewarding look at the noble Palazzo Comunale, one of the finest Gothic palaces in Italy,\ninside and in front of which so much of Perugia’s history was enacted. *\nBut mostly the Peruginians stroll to and fro on the Corso, stopping to greet friends,\nor perhaps to take at one of the sidewalk cafes an aperitif or a tiny cup of that black\ncoffee with authority that Italians call espresso.\nIf you prefer late afternoon to early evening strolling, and wish to see more of the\ncity, you oan hardly go wrong in exploring some of the viooli — those narrow streets and\nlanes that fork off the Corso and the crest. Some of them end in steps. A few end unex¬\npectedly against a wall, from which hill abruptly becomes oliff.\nBut many of the viooli twist and wind under graceful arches and tiny bridges; and\nalongside ancient walls and palaces and ohurches; and through market-places, as first they\ndip gradually, then plunge steeply, toward the Umbrian valleys below the oity.\nOne such vioolo will take you under the arch of Augustus and through an Etruscan town\ngate and bring you out in front of the orange Gallenga palace, which houses an unusual\ninstitution! the Italian University for Foreigners.\nAnd that, finally, brings me around to the subject of this Letter from Italy. For\nthis is not intended to be a profile of the city of Perugia; not exactly, anyhow. It is\nintended to be part of the story of an annual^ invasion of this setting I have tried to\nconstruct in words; an invasion of Americans, more than a hundred strong.\nThey are the students, professors and research scholars who have oome to Italy from\nall parts of America to study or teaoh for the aoademio year under scholarships provided by\nthe so—called Fulbright program. .And they have invaded Perugia for a month of intensive\norientation and language study at the University for Foreigners.\nIn truth, it is unlike any orientation any of them ever got as matriculating freshmen\nat Old Siwash or the state university or one of the Ivy league colleges.\nThey are assigned rooms in Italian homes, rarely more than three or four of them to\none house. And they take their meals with the families in whose homes they live. For\nmost, this means that the day after they have left ship at Kaplos they must start to speak\nthe Italian language, for purposes of ordinary, every-day living.\nThis is pleasant and helpful practice for Americans well advanced in their study of\nItalian. It is a rugged and, at times, exasperating workout for others, who were picked\nfor Fulbright scholarships for demonstrated competence in their special fields, and in\nspite of a deficiency in the language.\nBut generally these latter Fulbrighters speedily pick up useful tools of the Italian\nlanguage as the result of the seemingly constant drilling that starts for them at the\nUniversity for Foreigners the day after their arrival.\nSeveral Italian universities offer special summer courses for foreigners in the lang^-\nuage and the culture, but Perugia’s lovely Gallenga palace houses the only university\ndevoted entirely to the needs of visitors from beyond Italy’s borders."
}