{
  "id": "d196-100",
  "text": "The Italian parliamentary chambers are considerably larger than their\nAmerican congressional counterparts• That’s not surprising when you recall\nthat the Italian Senate has 243 members, compared with our 96, said the Chamber\nof Deputies has 590, compared with 435 in our House of Representatives.\nThe Italian chambers are also much more ornate — more elaborately put\ntogether — than ours. To me they seem much brighter and more attractive than\nour Senate and House chambers, but some would say they are too lavish} over¬\ndone for the chambers of an elected parliament in a democratic country.\nGet’s concentrate on uontecitorio and the Chamber of Deputies, generally\nregarded as the more Important of the two houses. The chamber is a huge hall\nwith woodwork and leather mostly of a rich brown color. It has an intricate,\nexpansive and attractive skylight, much like that in a great church, and It\nalso has stained glass windows.\nThere are 11 different sections of seats for the deputies, banked toward\nthe rear of the chamber at a 30-degree angle. Sach deputy has an individual,\nred-leather seat and a small. Individual desk, Microphones are posted at\nintervals throughout the bank of seats.\nOn a rostrum considerably higher than the one from which Speaker Martin\nholds forth in Washington sits the President of the Chamber, Giovanni Gronchi.\nHe’s a handsome man of 66, with strong, bronzed face and a full head of gray¬\ning hair combed straight back* He wears thick, black-rimmed glasses.\nGronchi heads his own small left-wing faction of the Christian Democratic\nparty, off the rostrum and outside the Chamber, he often speaks out sharply\nagainst party policy. Hia name invariably figures in speculation about a new\npremier in time of cabinet crisis. During the early January crisis that follow\ned the resignation of Premier Pella, Gronchi was the choice of Gool&l Demo¬\ncratic leader Giuseppe Saragat to head a left-center coalition government.\nMany observers believe that if the time comes when the Christian Democrats are\nforced to try a coalition with the left-wing Socialists and perhaps the\nCommunists, Gronchi will become premier.\nHowever that may be, Gronchi is an effective presiding officer, as he\nsits on his throne, flanked by a battery of vice presidents and secretaries,\nworking at desks on progressively lower levels. Gronchi is definitely in\ncharge andhe never allows the deputies to forget it.\nHe does not rap for order with a gavel* He shakes a small but loud hand¬\nbell vigorously. His voice is not mellow, but it carries stem, school-\nmasterlsh authority.\nWhen someone heckles a deputy who is addressing the chamber, Gronchi\nquickly and sharply calls the offender by name, and that generally is all it\ntakes. When Communist labor leader Giuseppe di Vittorio started to heckle\nMonarchist Deputy Alfredo Covelli during the Fanfani government debate in late\nJanuary, Gronchi pointed at him and called; \"L’onorevole Di Vittorio, si\nprega* — Hon. Di Vittorio, please. Di Vittorio promptly shut up.\nIf the Chamber has conducted its business with greater decorum and less\nviolence than the ienate in these UMStf* eventful postwar years, it must be\nin great part because of the presiding ability of Giovanni Gronchi. He seems\nfar more effective than his counterpart. Sen# Cesare Merzagora, who presides\nat Madama palace.\nI saw Communist senators come up roaring and disrupt the proceedings for\n10 minutes, shouting *,duce,duoetf at Premier Fanfani when he blasted the\nCommunist ideology in presenting his program January 26. Nothing like that\nhappened in the Chamber under Gronchl’s rule."
}