{
  "id": "d196-108",
  "text": "Hovey — 2\nIf you had all that, you still wouldn’t have the Itallna parliamentary\nsystem, hut you would have a reasonable facsimile.\nThis business of having the prime minister and his cabinet sit there on\nthe ministerial bench, facing the legislators, for day after day of weary and\noften acrimonious debate is apt to strike an user lean as unnecessarily cruel,\nBut In Italy It•a protocol? all a part of the parliamentary system, and\nno one thinks very much about it, I have heard of no proposals that the ore-\nmier and cabinet be spared this ordeal,\nAfter serving as Italy’s premier for eight eventful years. Ale id* de\nGasperl had to alt at that bench in the Chamber of Deputies for several days\nlast July to hear himself lashed and denounced — and finally voted out of\noffice. And actually, he had known almost from the start of the debate what the\ndismal result would be.\nDuring the last week in January, Premier Amintore Fanfanl and his minis¬\nters had to sit through four straight days of bitter debate although they knew\nafter the first session that they had no chance to survive the onslaught.\nApparently the Italians just believe that this is a necessary part of\nthe high price one must expect to pay for holding high office. They are amused\nthat anyone should think it unnecessarily cruel.\nIf ,4minter© Fanfanl objected to the ordeal he did a very successful Job\nof concealing It, H© la a short, alight man, almost entirely bald at 46, with\nonly a fringe of sandy hair and brief mustache.\nHis appearance is pleasant. If not distinguished, for he smiles often\nand well. He kept smiling most of the time as he sat at the ministerial bench\nin the Chamber of Deputies and heard himself denounced as a corporativism\nex-fascist, integrallst, pateranlist, transforralst, and the would-be Italian\ncounterpart of Galasar, Dollfuss and Gil Kobles,\nHe kept smiling, but don’t get the idea that Fanfanl took these attacks\nlying down, or that he failed to give as good as he received,\nAS a matter of fact, he deliberately provoked the vigorous attacks from\nthe far political left in his program speech of January 26, He referred sar¬\ncastically to ‘'the bolshevik serenade.“ And he blasted Communism as “an ex¬\nasperated ideology,* foreign to Italian traditions, guided by the example of a\nforeign power.\nSo Fanfanl undoubtedly expected the assaults from the Communists and their\nleft Socialist allies. What was harder to take was the vigorous opposition of\nthe Social Democrats and the milder objections of the Monarchists and Liberals.\nFor, once the Social Democrats and monarchists had decided to vote against him\nand the Liberals had decided to abstain, his chance of obtaining the necessary\nvote of confidence was gone.\nWith the issue no longer in doubt. Fanfanl paid his bitter respects to\nthese groups, too — and ©specially to the Social Democrats — when he made\nthe formal reply to criticisms for his government just before the fatal vote\non January 30.\nHow all of this is relatively ancient history and you may wonder why I\nam giving it such detailed attention, My reasons are both general and specific#"
}