{
  "id": "d196-114",
  "text": "Hovey —\n*The Christian Democratic party is still Christian enough to reject, now\nand forever, such bigamy*11\nBut let*a get back for a moment to Signor Baragat and hia Social Democra¬\ntic party* Xt was obvious that Saragat felt keenly the charge made by the\nChristian Democrats and pro-government newspapers that by casting his party1®\n19 votes against Fanfanl he was playing Into the hands of the Communists* I\nmight inerpolate that this charge was not made alone by Italians* The New\nfork Times said editorially that Baragat, as usual, was * putting narrow, per¬\nsonal, party considerations above his patriotism*\nObviously that was not the way Signer Sorugat siaed up the situation* He\ncharged that It was really the Christian Democrats who were frittering away the\nItalian democracy by trying to please both the political right and left with\nfine words but no concrete program for solving Italy1 a pressing; problems* He\nwas especially bitter at what ho regarded as Premier Fanfanl #s simultaneous bid\nfor support from the Honarehlsts on the right and his own Social Democrats on\nthe left*\nAnd Barsgat had a word with historic overtones to throw at Fmxfml and the\nChristian Democrats to describe such a maneuver* Trasfomismo* Professor\nGaorielli, whom I cited a few minutes ago, says trasforralamo means, in practice,\nthe virtual obliteration of political distinctions among parties* A man forma\na government as best he can* he constructs hia parliamentary majority by per¬\nsonal deals with individual politicians across party lines, but has no fixed\nprinciples or policies*\nTr&aformXmo came into Italian politics when, Agostino repretie and the\nhistoric Italian left came to power in 1876•\nIn his excellent book. The Upited Ctfljbftg, and, Italy* -Professor H* Stuart\nHughes describes the Depretls technique for staying \"ia\"power at any cost* He\nsay a * ‘'Casting aside any unnecessary scruples about political principles,\nDepretis sitauly picked up hia majority where he could find it* He made bar¬\ngains with one and all, whether from the left ox* from the right* Any deputy\nwilling to support the government could thereby acquire a claim to a suitable\nshare of official, patronage* * • • The result was trasformismo — the •trans¬\nformation* of deputies from supposedly reliable members of the opposition to\nstalwarts-of the government majority*\nThe real master of trasforiaismo was .ovanni Giolltti, who held the pre¬\nmiership most of the time from 1901 to about 1915* As Professor Hughes points\nout, historians are now having second thoughts about Glolittl and concluding\nthat he made some major contributions to Italy's political development. But\nhe stayed in office by manipulating majorities - through agreements wherever he\ncould find them. When the Socialists first began to rise In Italy, Giolltti\ncooperated with them, too, and helped them launch their program by organising\n4,000 cooperatives.\nAt times during his eight years as premier. Ale id© d© Gasper! was compared\nto Giolltti because of his ability at maneuvering and compromising within hie\nown faction-ridden Christian Democratic party and his oo&lltion government*\nBut many political observers believe the Italian politician most capable of\npracticing, tra&foHuismo in the present situation is Giuseppe Pella. Pella la\na believer in the adage about the soft answer\nthat turneth away wrath.\nJust before his resignation an premier on January 5, Pella told newsmen\nIt was important for a politician to outer the premiership on tiptoe and exit\nthe same way — and that he would know how to do both."
}