{
  "id": "d196-115",
  "text": "Hovey — 4.\nHe quietly swung the Christian Democrats Into a temporary alliance with\nthe monarchists, hut there were indications that he would as willingly have\nreconstructed the old Be Gasperi four-party coalition if prospects had hem\nmore promising*\nBut it must have surprised the controversial Amintore Fanfani to hear\nhimself charged with attempting a policy of trasformtamo* Saragat, however,\nwas in dead earnest* He called the Christian Democratic efforts to gain a\nmajority for Fanfani \"a play in which true policy gives way to trasformisiao\nand to the maneuver.\"\nIn such a way did the term which Hughes calls \"an Italianism rich in\ninnuendo*\" a term with rich historic overtones enter the January debate in the\nChamber of Deputies*\nAs a footnote, I might add that about three months ago — long before\nGiuseppe Saragat used the historic term at Honteeltorlo, and at a time when\nit seemed that Pella would remain in power for a considerable period —\nProfessor Gabrlelli said. In a lecture*\n\"Trasformisiao has been a constant threat to the Italian democracy! It\nremains a threat today*\"\nSaragat1 a Social Democratic colleague, Giuseppe Komita, added another\nexpressive tern to the January debate which seems to fit in well with traa-\nfomismo* He said that the Christian Democrats actually had followed, in the\ngovernment, a policy of \" 11 ia*a.obil 1 smoplinamlco\" — dynamic immobiliaau\nKomita also charged the Christian Democrats with attempting a \"Catholic\nimperialism,\" a charge to which De Gasperi replied *\n\"Ho, H0n. Komita, our imperialism is the mandate of 11 million voters.\"\nIt was a pointed reference to the size of the Christian Democratic vote in the\n1953 elections contrasted with the 1,200,0QG votes polled by the Social Demo¬\ncratic forces of Komita and Saragat.\nKomita#s appeal in this instance had been to the historic and still\ndeeply-felt Italian anti-clericalism* the feeling against church involvement\nin politics. It is a feeling that has to do with the way in which Italy was\nunified in the 1860s. me Vatican, with the support of Napoleon III, was able\nto hold Kome until 1870, nearly 10 years after the unification of most of the\nrest of the Italian peninsula under the rule of Piedmont*\nIt is a feeling that some observers believe had much to do with the re¬\nlative setback of the Christian Democrats in the 1953 elections, where they\npolled 11 million votes, as De Gasperi reminded Komita, but failed, in coali¬\ntion with their allies, to get an absolute majority of all votes oast.\nIt*s argued that an electoral law passed by the Christian Democrats,\nwhich would have given them and their allies 64 per cent of the seats in the\nChamber if they had gotten more than 50 per cent of the tM total vote, aroused\nthe old anti-clericalism. It was felt that If the Christian Democrats got that\nkind of majority they would try to impose what their enemies call \"a confess¬\nional state or regime*\nBut Komita1* anti-clerical thrusts in the January debate were mild com¬\npared with those of Pietro Henni, often called the most anti-clerical of\nItalian politicians*\nIt was Msnnl who thundered against \"Catholic Integrallsm,\" which he said"
}