{
  "id": "d196-122",
  "text": "Graham Hovey — Letter from Italy lio. m M\nRecorded In Rome, March 5, 1954\nTap. runsi 13*5 RFCFSVFD\nnaeb’ headquarters\n(second of two broadcasts on Italian attitudes toward AmericanswbA Russians, as\nreflected in public opinion polls}. am pm\n7l?j?1li0lli,121l121B|4|51p\nThis is Graham Hovey in Rome, send ins another radio ^Letter from Italy, pro¬\nduced for the Natljnal Association of Kducational Broadcasters with the cooper¬\nation of Radiotelevisions Italians.\nIn a previous letter, I told you something about the Italian public opinion\npolling agency — the organization called DOXA — and how it discloses the results\nof its polling in a popular Italian illustrated weekly called Giomo. meaning the\nday.\nLike the pollsters in America, DORA explains to the readers of Glorno that a\nscientific polling sample is the spoonful of soup which tells the cook whether the\nwhole bowl of soup has been salted sufficiently, or, as DOXA put it recently, the\nsample Is \"the heap of coal which makes known the quality of the entire load. *\nAnd like Dr. George Gallup, the man who directs the Italian poll — Dr. P.\nLuzzatto regia, professor of statistics at the University of Trieste — makes a\nconsiderable effort to explain to readers the margin of error in such polling.\nProfessor Feglz believes DOXAfa margin of error Is no greater than six per cent.\nHe reports, for example that 41 per cent of Italian adults questioned by DOXA\nknew that Glare Boothe Luce is United States ambassador to Italy. And he says\nthat means that the percentage of &li Italian adults who know the name of the\nAmerican ambassador is between 35 and 4? per cent.\nLike the American polling agencies, PQXA encounters much Ignorance and much\nindifference to many public questions on the part of ordinary Italian citizens.\nOne manifestation of this Indifference uncovered by DQXA in a recent poll on\nthe attitudes of Italians toward the United States and the Soviet Union surprised\nme very much. As a Journalist, I have been Interested in the great number of\ndaily newspapers available on the newstands here in Rome. I have also been Im¬\npressed with the fact that at certain times of the day it is difficult to get\nclose enough to one of these stands to buy a paper because of the large crowds\npushing up to the counters. I know of 16 different dally newspapers published\nright here in Home. And all newstands also carry at least the two great non-\nRoman dailies — jjl Gorrlere della Gera, of Milan, and L& itamaa. of Turin.\nBut Judging by DOXA poll results, something must be wrong with this picture,\nout of 100 Italians polled In these recent surveys, 25 said they did not read\nnewspapers at all and another 20 said they read a daily paper only now and then.\nBut in any event, as I reported previously, the magazine Glorno seems con¬\nvinced that the Italian public is much interested in the results of the DQXA polls\nand it advertises strenuously the fact that it carries these results. Glorno\nespecially advertised its two recent articles, complete with charts, onthe re¬\nsults of the DOXA samplings with regard to Italian attitudes toward America and\nRussia.\nAs X reported in that previous letter, the DGXA poll on America and Americans\ndisclosed these two basic facts* First, Italians have much sympathy and affection\nfor Americans; 56 per cent of those polled said they were more sympathetic to\nAmericans than to Germans, French and British. And second, Americans as indivi¬\nduals are considerably more popular with Italians than are some aspects of Ameri¬\ncan foreign policy; 29 per cent of the Italians polled said it was true that"
}