{
  "id": "d196-128",
  "text": "Graham liovey — Letter from Italy No. 21\nRecorded In Rome, March 6, 1954 NAEB HEADQUARTERS\nTape runs: 14*06\nMAR 15 1954\n, am P n\n?i?|?|ipill[12ri121B14151c;\nThis ia Graham Hovey, recording In Rome another Letter from Italy for the\nNational Association of Educational Broadcasters — the MAES Network.\nSeveral bookstores In downtown Rome are currently displaying In their show\nwindows a hook in Italian by James Blaine Walker caller, rtLa Storia della\nIndustrie miericana (The history — or the story — of American industry).H\n£ haven * t had the chance to read that book or even to get an indication of\nthe scope of its contents or the point of view of the author. But the promin¬\nence of its display in the show windows of leading Roman bookstores is indica¬\ntive of something that an oaerlcan residing in Europe is apt to find interesting\n— and perhaps significant.\nI happen ta\\now that in at least three of those bookstores currently dis¬\nplaying Walker's * Story of American Industry** you could find copies — in\ntranslation — of the book, \"U.S.A., The Permanent Revolution.\" That's the\nbook that grew out of a special issue of Fortune magazinej the special issue\nedited by Russell W. Davenport some two or three years ago. Italians can buy\nthat book — \"U.3.A., The Permanent Revolution\" — translated into their own\nlanguage, in at least three Roman bookstores and perhaps more.\nnow, European fascination with certain aspects of the American economic\nand industrial system is not a new thing, any more than European interest in\ncertain aspects of the American political system is new.\nBut it seems to this reporter that European interest in how our economic\nmachine functions, and what the social and cultural ramifications are, has\nreached some kind of peak. I wouldn't know when this oeak was reached $ and\nperhaps itJa a plateau, rather than a peak. Anyhow, the interest is certainly\nvery high — at least here in Italy. The prominent show window display dis¬\nplays of a book on the history of American industry is one indication. The\npresence on bookstore shelves of an Italian translation of ’U.3.A., The Per¬\nmanent Revolution,\" is another.\nStill other Indications are the frequent serious articles in Italian\ndailies and weeklies which attempt to dig beneath, the surface and tell their\nreaders how our system actually functions. I would like to examine a couple\nof these articles in a few moments.\nThis interest in the American economic and industrial system ia not sur¬\nprising, at a time when the prosperity — or even the economic survival — of\nwestern Europe depends to such a great extent on what happens in .America.\nThis interest is not surprising at a time when European newspapers, like their\nAmerican counterparts, are carrying frequent articles from New lork and Wash¬\nington on the possibilities of an economic setback in the United utatea.\nThis Interest is not surprising, but — if I may be permitted an apparent\nredundancy — it ±s interesting. And the printed results of this interest\nare particularly interesting to an American working abroad. Take those two\nnewspaper articles to which l referred a moment ago, for example.\nThe headline over on© of them aaya that we Americans have completed our\nsocial revolution — and I quote* \"Mot with barricades, but with fiscal\npolicy.\" The writer, Ermarmo Oontini, believes we have actually brought off a\npeaceful social revolution In America by use of the government taxing power —\nand iignor Oontini seems to be all for that kind of revolution."
}