{
  "id": "d196-129",
  "text": "Hovey — 2\nThe man who wrote the headline over the second newspaper article actually\nborrowed the title of Hussell Davenport1s book, with only the slightest change.\nHe referred to 11 the permanent revolution in the U.3.A.\" But the writer of that\narticle, Aldo Canonic!, had a name for the system under which that permanent\nrevolution was achieved that would startle most Americans. Signor Oanoniel\ncalled It, \"white communism,\" and 1*11 tell you how he picked up that tile in\na few momente.\nSrmanno Contini wrote his long article on the American industrial and eco¬\nnomic system in the Home morning daily, J1 ^essaftero. which is officially inde¬\npendent, but almost Invariably supports the Italiangovernment• Aldo Canonic!\nwrote his article on \"White Communism\" for the stimulating Italian weekly, II\nt,opdo. which is edited by a group of Liberals. Both IJl rieaeogaero and II Londo\nare strongly anti-Communist. In the Italian political 3 >ectrum, I would place\nII ftesoaftflero a little to the right of center and II mondo a little to the left\nof center* I cite these points only as background for judging the Contini and\nOanoniel articles.\nI might say that I did not decide to review these two articles on Letter\nfrom Italy because £ agreed with the conclusions of the writers about America.\nBut I believe the viewpoints are those of two intelligent Italian journalists,\neach of whom tried seriously and objectively to find out what makes the Ameri¬\ncan system tick.\nI almost always find the views of such foreign observers interesting.\n.And I believe that some — not all, but some — of the viewpoints of Signori\nContini and Canonic! would coincide with those of rmssell Davenport and his co¬\nworkers, who wrote, \"U.3.A., The Permanent devolution.\" Some are reminiscent\nof the conclusions of the late Frederick Lewis Allen in his book on the first\n50 years of this century in America! the volume called \"The Big Change.\"\n3lgnor Contini wrote his article after a tour of the Chicago stockyards.\nHe duly describes how, in the beef slaughter houses, a live animal can be\ntransformed into pieces of meat, ready to be sold, in 39 minutes. He calls the\nconducted tour of the Chicago stockyards \"a symptomatic manifestation of that\nnational pride which replaces the monuments of history with the marvels of in¬\ndustry, of mechanics andof produoation.\"\nSignor Contini describes vividly the city of Chicago — the unattractive,\nalong with the beautiful. And he marvels at what he calls \"the exciting sense\nof dynamic exuberance, of progressing alacrity, of prophetic anticipation.\"\nHe wonders if the world has found, in this America, a new young generator. He\nsays that in merles \"all is in transformation and progress, even the soolal\nstructure.\"\nThen comes the ahooker. iignor Contini saya that the Swift packing plant\nin Chicago ia the symbol of what ho calls \"the discovery of the new order in\nwhich unconscious socialism la spreading through American society.\"\nHe hastens to tell his readers that one cannot apeak of socialism in Ameri¬\nca without ocandalising people, but he adds that there is no doubt that Ameri¬\ncans have realized many of the \"applications\" of socialism with non-socialist\nmethods.\nAnd Signor aontini says that by this process Americans have made of their\ncountry \"one of the moat socially advanced that exists today.\" H© uses the\nSwift plant as a symbol of tills process. He says that as the Swift slaughter\nhouses quickly break an animal into pieces for distribution to meat buyers, so\nare the riches which the company produces broken into pieces and distributed\nto employers and stockholders."
}