{
  "id": "d196-133",
  "text": "Graham Hovey — letter from Italy Ho* 22\nRecorded in Rome, March 28, 2954\nTape runs* 23*40\n(First of three broadcasts on background and prospects of the Seelbe government)\nThis is Graham Hovey, recording another Letter from Italy for the National Association\nof Educational Broadcasters — the BAHB network*\nlow may be as good a time as any to catch up with the Italian political situation.\nAfter more than two months of drift and crisis, this country now has a fully-constituted\ngovernment for the first time since Giuseppe Fella resided as premier January 5* The dust\nhas settled a bit on moat of the major events of that two-month period end it should be\npossible to put them in perspective.\nThe new government, headed by Mario Seelba, was fully constituted on March 10 when it\nwon a vote of confidence in the Chamber of Deputies by a narrow, 13-vote margin. Three\nhundred deputies from the democratic parties of the center end moderate left voted in favor\nof the Soelba cabinet. Two hundred ©ighty-three deputies voted no. They were of the\nCommunist and left-wing Socialist parties on the far left, and the Monarchists and nee-\nFascist Italian Social Movement on the far right.\nSoelba's margin of victory in the Chamber thus was exactly the seme as it had been in\nthe Senate, where he was confirmed by 123 votes to 110 on February 26.\nWhat the Soelba government will be able to accomplish of its ambitious program with\nsuch a narrow parliamentary margin to work with is, of course, a matter of wide speculation\nhere in Italy, even as it is in the United States. I hope to examine the prospects for the\nnew government in subsequent Letters from Italy.\nPerhaps the first things to be said about Soelba as premier are that he sincerely\ndidn *t went th© job, and that the reasons why he got it were not ones that might seem obvious\nto foreign observers.\nSignor Soelba was minister of the interior in the cabinets of former Premier Mold© d©\nGasper! for more th*n six years. In that job, he rebuilt the national polio© force, and\nre-established public order in a country where riots had been almost the order of the day in\nindustrial centers after the war. His jeep-equipped flying squads cracked down hard on the\nCommunists and Fascists when they went beyond the law in their political demonstrations, and\nhe thereby incurred their bitter anmity. Soelba was th© nominal author of th© highly con¬\ntroversial 1953 electoral law enacted after violent debate in both houses of parliament.\nThat law would have given 64 per cent of the seats in the Chamber of Deputies to any coali¬\ntion of parties polling more than 50 per cent of the total vote*\nIt is generally conceded that this law wee a major factor in the relative setback\nsuffered by Soelba•© Christian Democratic party in those ©lections of June, 1953. Because of\nballots whose validity was challenged, the Christian Democrats and their allies — the\nSocial Democrats, Liberals and Republicans — barely failed to get that 50 per cent plus of\nthe total vote. Thus they do not have a comfortable working majority in parliament.\nSix years of strenuous work a* interior minister and the beating he took because of the\nelectoral law that bore his name caused Soelba to conclude that he had had enough of cabinet\nservice after the June ©lection. He declined reappointment as interior minister, and during\nth© eight months that followed he concentrated on his duties as s member of th© Chamber from\nhis native Sicily and a member of th© directorate of the Christian Democratic party. And\nduring that time he was often called on for speeches at regional party meetings and rallies."
}