{
  "id": "d196-138",
  "text": "4*60\nGraham Hovey — Letter from Italy Ho* 19\nFAS8 Hetwoxte\nRecorded in Rome# March 2, 1935\nTap© runs t 14 tOO\n(Interview with the young Italian painter, Francesco Bel Bra go | first of two on\nso-called \"Third Force** painters in Italy)*\nThis is Graham Hovoy, recording a Letter from Italy for the network of the National\nAssociation of Educational Broadcasters* These programs are produced with the cooperation\nof Radi ©television© Italians.\nI have never been a diligent student of art, and if you asked me to summarise recent\ndevelopments in Italian painting I could not reply in detail* But in recent weeks, some¬\nwhat by acei lent, I have become interested in on© artistic development in Italy that a\nReman critic has called a \"Third \"orce*\"\nA friend enticed me into a Soman gallery exhibiting recent works of the young Italian\npainter, Francesco Bel Brag©, An I immediately got interest© - in both painter and paint¬\nings.\nHis subject matter alono would have attracted me. Like most Americans who have obser¬\nve- it, I am fascinated by Italian peasant life, with its shsrplyMrawn illustrations of the\nage-old basic relationship between man and nature*\nAs I stood before Bel Drag©1* canvases and water colors, I couldnlt have told you how\nmuch he had been influenced by the Abstractionists or what he owed to the Impressionists*\nAll I knew was that Bel Brago9s peasants seemed as genuine as the ones I had aeon in\nAbrusso or alabria or Sicily*\nIn those peasant faces I found the? inevitable lines of labor an hardship and fatigue.\nBut I foun t also the patience and dignity — that unbelievable dignity — which anyone who\nhas observed peso ants closely will knot? is there*\nAnd their activities — the picking of the olives, the threshing of the grain, the\nlunching an A renting under an oak tree during harvest — these activities painted by Bel\nBrago had that character of rhythm and ageless ritual which sensitive observers have always\nnoted* Bel Brago#s landscapes seemed natural and well-managed*\nNo grist here for th© political propaganda mill* lor anything that would please ex¬\ntremists of neo-realism or abstraction*\n•\nA critic ones said that as a mnn, Francesco Bel Brago is **a® open as a large window*»\nHe is tall and rugged, with black hair that is combed back but rarely stays there* I found\nhim at the gallery in a tweed jacket and slacks, with a Scotch plai \" shirt open at th© neck*\nthe way, he is the Prince Bel Brago, scion of a prominent Roman family, but this\nyou mi^rt never find cut from him* He prefers to be Francesco Bel ftrago, painter, and he\nlooks like a man of the people who doesnH work ostentatiously at being one.\nA man of great energies and enthusiasm, this Bel Brago — a forceful, extrovert person¬\nality in n rugged physique! a man who can wear you down either talking about art or hiking\nthe rough countryside around the village of FilAcciano, where he lives and works, ^bar you\ndown but never bore you*\nHe was bom on Washington's birthday, 1920, and painted from the time he was seven*\nHe was an officer in the Italian army in World Tar II an invalided home. Then he took part\nin the anti-fascist underground and when Filacoiano as free h© was installed as mayor by\nthe Committee of National Liberation*"
}