{
  "id": "d196-139",
  "text": "Hovcy — 2.\n,:*it ha quickly got b k at bis easel, an’ in 1950, he took his iploma from tome*s\nAcademy of Fin© Arts, He since has staled in France an Holland, but has always returned\nto Filaociano to work,\nFilacoiano is a tiny hill village overlooking the fiber valley north of Feme, between\nMount Sor tte and the Sabine Hills — a. country-si 'e famous in antiquity. The Del Drag©\nfamily cacti® is built into the wall from which the village was defended in former times,\nol Drago#s modest stu io probably is much like that of other painters — whitewashed\nwalls, plenty of li^t, scores of jars with brushes, ©reels with finished and half-finished\nwork, lots of books, one inscribed by Pablo Picasso,\nIn this setting, we talked painting and painters, I wanted you to get the impact of\nTel Hr go*s personality, so we recorded part of his answers to my questions. But his friend,\nthe young American painter, David Chapin *— who also might be classed in this so-called\n\"Third Force*1 in painting — translated those answers for you.\nSignor Del drag©, in reviewing the recent exhibition of your painting in Porno, the\nItalian critic, Luciano Budigna, used an expression which I never had hear?’ previously out-\noi e political iscussions. He professed to see in the artistic worl ■ the development of a\n\"Third Force,\" And he cited you as a gifted exponent of this \"Third Force,\" In your judg¬\nment, what doe# Signor 3u ligna mean in using that expression?\nDHL DRAGOi I think that when Luciano Bu ligna usee the political expression, a \"Third\nForce,\" he means a position between abstraction an neo-roalism. He oes not mean a com¬\npromise, but a pointing based upon nature and availing itself of the most recent conquests\nattained by others an' by ourselves. That postion is not a new one. It in the only one\nthat painting has over had when it has been an art. From the Egyptians all the way down to\nPicasso and Matisse, this has always bean true.\nThe esthetic of neo-realism is wrong, because it takes a stand in blind opposition to\nany kin ■ of formalism or international abstraction. An1 thereby it re bices painting to a\nsort of provincial illustration. At the present momont, however, both in Italy and France,\nthat neo-realist movement is undergoing a crisis.\nOn the other hand, pure abstraction in its most extreme form may be very interesting\nas an experiment in evoloping a new pictorial grammar. But a grammar is vs lid only if it\nserves to make a work of art, and that is, if it serves to express something. In the case\nof the painter, that means to express an internal or external world, as the case may be.\nHOVmr# Signor Budi^ia, the critic, believes the bend of artists that he would put in\nthis category — this \"Third Force\" — artists between the extremes of realism and abstrac¬\ntion _ that this band is steadily gro ing larger an more effective. I won -or if you\nwould agree with that, and, if so, what factors you believe may be responsible for this\ndevelopment?\nPEL DRAOOi As I believe I have indicated in my previous answer, I o not believe the\n\"Third Force\" exists, as a movement. I believe that when many persons think of a aewement,\nthey think of a fairly compact group of painters — perhaps a group that gathers at some\ncafe for long discussions of their work and i eels. The \"Third ^orce,\" in the meaning I\nattach to that expression, is not a movement. The factors which lead a painter to travel\nthis road between abstraction an neo-realism exist insi e that painter. And the best\npainters of our time are on this road, either consciously or unconsciously.\nPicasso, Matisse, Leger, and, among the younger, Pignon — all these are on this road\nconsciously*\nOn the other hand w© have the Italian painter, Guttuso. He is the most valid represen¬\ntative of neo-roalism, perhaps because he is a self-made artist. But, when he paints a"
}