{
  "id": "d196-14",
  "text": "Graham Hovey — letter from Italy Bo* 4\nMSB Network 5^- (l - 'fs\"\nBe corded In Borne, October 29, 1954\nTape runs* 13*40\n(Second in a aeries on the current Italian political scene)*\nThis is Graham Hovey, recording in Borne a radio Letter from Italy for the National\nAssociation of Educational Broadcasters — the NAJ2B Network.\nThere is an unoccupied desk in the center of the last row of the hemicyole in the\nItalian chamber of deputies these days. And as he sits at the ministerial bench in the well\nof the chamber, amid a rising political storm, Italy’s premier probably ponders the signifi¬\ncance of that empty desk for the fate of his government.\nIt was the desk of Italy’s leading statesman of post-World v/ar II years, Alcide de\nGasperi. Its location seemed symbolic of the middle-road course whloh Be Gasperi charted\nfor the young Italian republic during ei^rt yesrs as premier.\n■Hxat course was ever a rooky one, even for Be Gasperi. It had become increasingly\nrocky for his successors since the 1953 elections failed to return a clear-out majority for\nthe middle-road democratic parties.\nSince Be Gasperi’s unexpected death last August 19# that course has become rockier than\never for Italy’s present premier, Mario Soelba.\nFew of Soelba’s present difficulties stem directly from the absence of Be Gasperi.\nMost of Soelbafs problems would still be with him, even if the tall, gaunt man were still\nthere at his desk in the center of the last row.\nFor example. Be Gasperi hardly could have eased the impact of the celebrated -ilma\nMontesi case on the Scelbs government. It had figured in newspaper headlines and political\ngossip for months before he died.\nHis counsel mi^it have aided Premier Soelba when Attilio Piooioni resigned as foreign\nminister to defend his son, who since has boon arrested on a manslaughter charge in the\nMontesi death. But it is doubtful that Be Gasperi oould have helped the situ tion, beyond\nadding his own respeoted voice to those pointing out that no evidence had implicated Soelba,\nPiooioni, or any other government minister.\nOn the foreign policy front, the death of the European Defense community treaty in the\nFrench assembly had been a blow to the Soelba government. Perhaps more than any other\nnation involved, Italy had directed its foreign policy efforts toward an integrated Europe,\nlet. Be Gasperi oould not have saved the BBC treaty. The fact is that on the day he died\nhe was in a state of despair because he oould see JBDC going down the political drain.\nStill, as Premier Soelba sits there in the chamber, absorbing verbal blows from left\nand right _ and some from the sector of his own Christian Democratic party — he undoubt¬\nedly wishes often that he oould look back and see that familiar lean figure with the hawk\nnose at the now-vacant desk*\nThere would be strong personal reasons for such wishes, of course. Although Soelba\nwas 20 ye*rs younger than Be Gasperi, the two men entered the Italian political picture at\nabout the same time in the ranks of the Popular party, the forerunner of today’s Christian\nDemocracy. In the e rly 1920s, they worked together as lieutenants of the founder of the\nPopular party, the Sicilian priest. Bon Luigi Stursso. Both were active in the anti¬\nfascist underground. Both helped build the new Christian Democratic party during and after\nWorld War II. And Scelba had served as interior minister in Be Gasperi cabinets for six\nyears."
}