{
  "id": "d196-142",
  "text": "Graham Hovoy — Letter from Italy Ho* 20 )A t\nHAKB Network\nRecorded in Rome, Maroh 2, 1955\nTap© runes 14«00\n(interview with the young American painter, Levi 1 Chapin5 second of two on so-called\n\"Third Force\" painter© in Italy).\nThis is Graham Hovey, recording a Letter from Italy for the network of the national\nAssociation of Educational Broadcasters. These programs are produced with the cooperation\nof Bv,&iotelevisione Italiana.\nOne nilt late-winter morning, I rove out of Home on the Via Cassia, then cut straight\nnorth through rugged oou try to the village of Soriano nel Cimino. If you are a classicist\ncr Roman historian you may have heard of the place. If not, you probably haven*t. The\ntown gets the latter part of its name from the fact that it rests on one of the series of\nmountain peaks known as the Cimini.\nI was going to Soriano to chat with a young American painter, David Chapin, who has\nbeen working there in relative isolation for more than three years. I had met Chapin\nthrough his friend, the Italian painter, Francesco Del Drago — and those of you who heard\nthe previous Letter from Italy will know that it was Chapin* s voice that recorded Del\nPrago*s sue .era to ay questions about painters and painting on that program#\nThis serious, highly intelligent American wcul • be interesting in any event. I was\nparticularly eager to know him better because I was sure that he, like Del Brag©, would\nfit into the category of young artists which the eminent ^ome critic, Luciano Budigna, had\ncalled a \"Thirl Force.\"\nI shoul not give the impression that the paintings of David Chapin are similar to\nthose of Francesco Del Brago — as paintings. Actually, their methods of work are very\ndissimilar. Yet, the two young painters have some things in common.\nFor one thing, each was attracted by abstract painting at one stage, but rebelled\nagainst it. I3aoh consi .rs himself a realist, but un erscores that he is not a neo-realist.\nYou can see how Budigna originated \"Third Force\" as a tern for painters between the extremes\nof abstraction an neo-realism#\nBoth Chapin and Del Drag© turned their backs on the salons and artist colonics of Rome\nto work in isolation in primitive country not far from one another. Both have concentrated\non the country life that surrounds them, pointing the peasants themselves* the harvests,\nthe threshing, the gat e-ring of olives and chestnuts* an* the landscapes, then Chapin had\nan exhibition at Rome in 1953, Bel Drag© wrote on the program* ’’Your pictures from afar\nhave tho arose tone a© the song of tile peasants* the seme miraculous sincerity.\"\nDavid Chapin was bom at Springfield, Mass., December 13, 1919* about two months before\nFrancesco Bel Brago was bom at Home. Chapin studied architecture, then attended art school\nin New York. Ho taught art at Illinois Wesleyan university before com ng to Italy.\nI found V™ in a small house that is part of a villa, on a hill above the town of\nSoriano. We chatted in the living room that also serves as one of his t?*> studios on\noccasion.\nDavid, whenever I meet an liMSli MU artist or writer or musician living m working in\nthir country I always like to ask him* thy Italy? Perhaps I*ve juot road too many articles\nsaying that Romo hat; become for these Americans what Paris was between the two World wars.\nI*o not sure this is entirely true. But I would still like to ask why you — at this\nparticular stage in your career as an artist — chose Italy as a place to live and work?"
}