{
  "id": "d196-144",
  "text": "streets — ox-cnrtc, oakeys, automobiles, trucks, busses an 1 motor scooters* At the top\nof the heap, lominating the town* is a 12th-century castle, which is now used as a prison.\nIn the country oil© that surrounds this mountain and this hill town, in ©very season, the\npeasants work virtually as they have always worked down through the centuries.\nYou can go out, day after $f9 with pencil and paper, and find the same actions re¬\npeated in the same way. $hen you have dram them enough times they become part of your —\nan part of your work. In other words, I have found at Soriano a subject matter that is\nwell defined and significant. By significant, I mean that it shows the relationship that\nman has always had with nature. But shows it in a very simple form.\nHG7KY* I take it this is what you mean when you say you thought that in Italy it\nmight be easier to get close to the basic facts of human existence.\nHAPINj Yes, that#s what I mean. American civilisation is young. It is a sivilira¬\ntion in transition. And therefore it is more difficult for an artist with my interests,\nand at my stag® of development, to find in America a subject matter as well defined as that\nwhioh I have founl in Italy. You need something older — something simpler, something\nunchanging. I have foun that something at Soriano.\nBut I have also found something else, and that is seclusion, and a relative degree of\nisolation from other artists.\nHOVSYt That point about relative Isolation surprises me a bit. I suppose! that\ncontact with other artists was necessary — was even essential — for artistic stimulation.\nHAPINj Bell, this may sound strange, but I think that today artists, as a group, are\nsuffering from over-stimulation. First of all, they have their own discussions '>mong them¬\nselves. Then there is the treatment of art by the newspapers, radio, television, public\nlectures an!, especially, what w© might call the art press, with its criticism and scholarly\nresearch. In the form of reproductions, we have at our finger tips the art of all ages.\nI felt that I needed seclusion on order to do my own work — far more than I needed\nincessant contact with fellow artists. When you verbalise too much about art, it becomes a\ntheory — and theories eventually prevent an artist from seeing. The artistfs first job is\nto see. Then, afterward, comes the long, hard work which leads to the final realisation of\nthe artistic image. In order to realise this image in a forceful way, the artist must\nutilise the abstract language that has been developed by the best painters of his time.\nThe beat ay to learn this language is by visiting museums and looking at reproductions,\nand pot in endless liscussions with other painters. I am reminded that Pierre Bonnard once\nsaid that when an artist paints by a theory he winds up with only a caricature of what he\nget out to do. And it was sai of Bonnar that when his friends discussed art, he remained\nsilent — and observed.\nHOVKY* I see* Bell, David, earlier you were talking about a particular stage in your\ndevelopment as an artist. Is Soriano a part of that stage? And if so, what comes after\nSoriano?\nCHAPINi Soriano is definitely a stage in my development. And I want to make it clear\nthat when I sai! I had foun scan©thing in Italy that wouli be more difficult to find in\nAmerican I was referring only to this particular stage. I do not wish to be an expatriate\npainter.\nBut Soriano — or something like Soriano — was essential to me at this point. I feel\nthat the Soriano period — whioh has lasted about three and a half years — is nm about\nover. In fact, I no have {©finite plans to move to England this summer — to begin the\nnext stage. And specifically, 1 plan to move from this primitive Italian countryside right\ninto th© heart of Lon' on."
}