{
  "id": "d196-15",
  "text": "Hovey — 2,\nSo much for the personal ties between the two men. There would be equally strong\npolitical reasons why Scelba would miss De Gasperi. And these political factor© would be\nfar more important for the fate of the Italian democracy than any personal ones.\nThese political factors are related to the kind of party the Christian Democracy is and\nthe kind of leadership necessary to hold it together. This is a subject to which a political\nreporter in Italy must return again and again. It goes far toward explaining the pattern of\ngovernmental behavior in Italy in these years since World War II. And it goes far toward\nexplaining the uneasiness and confusion in the current political picture — uneasiness and\nconfusion that menace not only the Scelba government, but the existence of the Italian\ndemocracy itself.\nFor it cannot be said too often that the Christian Democracy is a heterogeneous party of\nseveral sharply-divided factions. It mi$it be more accurate to say that the Christian Demo¬\ncracy is really several parties grouped together under one banner. An outsider concludes\nthat the chief ingredients of the oeoent that has held this remarkable party together have\nbeen three* first, not so much a common religion as a common religious-political attitude;\nsecond, effective leadership; and third, its striking early success at the polls, in postwar\nelections.\nBut in the weeks *nd months after its relative setback in the 1953 election, it seemed\nto this reporter that the Christian Democracy was held together mostly by the patience and\nprestige and political power of Aloido de Gesperi.\nEot even De Gesperi oould dictate to such a conglomerate party — a fact some of his\ncritios often forgot. But he oould prod and pacify, coax and cajole, soothe and scold. 381\n81X88 And on occasion, he oould threaten some wayward faction with graphic reminders of the\nhigh cost to party and country of genuine defection.\nHere was a measure of the man's deep concern for party and oountry# at the ago of 72,\nin the wake of his humiliating defeat in an attempt to form a government after the 1953\nelection, De Gesperi took on the onerous job of party secretary. It was not immodesty that\nled him to tell friends privately that he might be the only man who oould hold the party\ntogether.\nIt was De Gesperi who backed Scelba's contention last January that the way to resolve\nItaly's festering political crisis was by reconstructing the old De Gasper! coalition of the\nfour middle-road democratic parties. This c me after the fall of the government of Giuseppe\nPella, based on cooperation with the Anarchist party, and the abortive attempt of Amintore\nFanfani to form a cabinet composed solely of Christian Democrats.\nThere was a vivid illustration at that time of the fissures in the ranks of the Christian\nCemooraoy. For in spite of De Gasperi's strenuous efforts, the party's directorate approved\nthis policy of democratic ooalition government by a margin of only seven votes. There were\n122 favorable votes to 115 opposed, wnd with four abstentions.\nScelba had to pay a substantial price for the participation in his cabinet of Liberals\nand Social Demoomto, and for the 38 votes these two parties plus the Hepublicans oould give\nhim in the Chamber of Deputies.\nIt was only with the strong support of De Oasperi that Scelba oould win grudging consent\nfrom his own party to give his minor partners key cabinet portfolios! public instruction and\nindustry and commerce for the Liberals* finance, public works, labor and social welfare to\nthe Social Democrats.\nIt was particularly galling to the Christian Democrats to surrender the public instruc¬\ntion ministry to a representative of the historically anti-clerical Liberd parjy. That was a\nconcession most political observers doubted that the great Catholic party would ever make."
}