{
  "id": "d196-150",
  "text": "Sahara Hovey — Letter frora Italy No# 22\nNAKB Network ^ V- J\nRecorded in Rome, March 14, 1955\nTape runs* 13*30\n(Aria d*Italia — the Air of Italy)\nThis is Graham Rovey, recording in Rome a Letter frora Italy for the network of the\nNational Association of Educational Broadcasters. These programs are produced with the\ncooperation of Radio television© Italians.\nA reporter trying to do s werious job of covering the Italian scene occasionally\nneeds a change of pace. For some time now I have intended to do a program to he called,\nsimply, \"The Air of Italy.\" The weekly newspaper, II Mondo. often carries columns in its\nlast few pages under the headline, \"Aria di Napoli,\" or \"Aria di Rome,\" or perhaps \"Aria\ndi Washington.\" The objective of such columns is to try to report the atmosphere of\nNaples or Rome or Washington at that particular moment — something that individual news\nstories from those cities rarely do.\nThis is an ambitious undertaking, hut it can he a lot of fun, so long as it is not\ntaken too seriously. No one should take what follows on this Letter from Italy too\nseriously. It is the Hovey version of \"Aria d’Italia,\" the air of Italy. It is an\nattempt to capture a part of the atmosphere —— the mood — of this country at this parti¬\ncular moment*\nPerhaps it is not news to report that the state-appointed and self-appointed guardians\nof the public morals are at least as busy here in Italy as they are in America.\nThe difference would seem to he that in America we really don’t have state-appointed\nguardians of the public morals and, in any event, such matters rarely burden the President\nof the United States.\nHere in Italy, the prime minister, Mr. Scelba, had to take time out frora preparations\nfor his state visit to America to ponder the merits or demerits of a motion picture called,\n\"The Adventures of Jacques Casanova.\" Mr. Scelba seems destined to be bothered with such\nthings.\nSome years ago, while he was minister of the interior in the cabinet of Alcide Be\nGasperi, Scelba’s national police started to enforce a ban on the two-piece bathing suit\nat Italy’s beaches. The pandemonium was at least as gr at as that raised by the Coramunists\nagainst the European Uni bn treaty in the recent parliamentary debate. One Rome newspaper\nsuggested that these policemen mi^bt better be employed trying to track down Mr. Scelba’s\nfellow Sicilian, the bandit Giuliano, who then was still at large and defying the authori¬\nties.\nGiuliano was finally disposed of, and no doubt Casanova will be too, in time. At the\nmoment, the situation regarding the film is this*\nIt was produced last year by a joint Italian-French company, and its original title\nwas, \"The Adventures and Loves of Jacques Casanova.\" The producers obtained the necessary\nadvance approval of the responsible Italian government agency last June, after agreeing\nto eliminate certain scenes and dialogue and to strike the word \"loves\" from the title.\nThen they spent about * 640,000 to make the film.\nThe government’s censorship commission approved the Casanova picture last November,\nwith the stipulation that theaters showing it refuse admission to minors of 16 or under.\nBut Italy’s film industry has its equivalent of our Johnston office — with a so-called\nCommission of Self-Censorship, composed of distinguished writers and critics. To be on\nthe safe side, the producers also submitted the Casanova film to this commission and got\nits unanimous approval."
}