{
  "id": "d196-151",
  "text": "vey — 2,\nX\nSubsequently, the picture was projected in first-run movie houses throughout Italy.\nBy about March 1, it reportedly had shown in every large Italian city except Trieste and\nCagliari.\nThen, on March 2, the government censorship office ordered the film withdrawn from\ncirculation on grounds that it was offensive to public decency, morals and good taste.\nThe authority for such recall was contained in a law enacted in 1923 — one of many laws\nof the fascist era which the Italian republic has not repealed nor revised.\nNaturally, the producers of the Casanova film raised a vigorous pretest. They got\nassitanee from other film companies, who feared it rai^t sometime happen to them. They\nalso got support from individuals and groups that objected to such arbitrary censorship\nas a matter of principle.\nThe government agency stood its ground. The Hon. Oscar Scalfaro, Christian Democratic\nmember of the chamber of deputies, who holds the title, under-secretary to the prime\nminister for theatrical performances, went on the radio to defend the censorship order.\nScalfaro said protests had come to his agency from 14 different Italian cities. He said\nthat because of the general nature of the protest, he was only doing his duty when he\nordered the film reviewed by an appeal commission, whioh ruled against it.\nBut a newspaper replied that all the protests emanated from the powerful lay organi¬\nzation known as Catholic Action, and that they contained a total of only about 600 signa¬\ntures. The producers of the film said, caustically, that they doubted if these 600 con¬\nstituted any vast stratum of public opinion.\nNow, under the Italian governments table of organization, the agency that reviews\nand censors films and other theatrical productions is directly responsible to the prime\nminister himself. So there was no cabinet minister standing between Mr. Scelba and this\ntempest about the Casanova movie.\nAt this time, Scelba was spending long hours at the government bench in the senate,\nworking for ratification of the European Union military treaty. He had painstakingly\nworked out a compromise on farm tenancy contracts that had temporarily averted a split in\nhis government coalition. He was preparing for his official visits to Canada and the\nUnited States.\nIn the middle of all this, he had to concern himself with a movie about the adventures\nof Casanova. At the moment, Scelba has received a delegation of the protesting groups and\npromised sympathetic consideration of their case. The report is that he will order a new\nexamination of the film and the censorship regulations.\nThe last.comparable ruckus in Rome that I can recall concerned not a film itself, but\nthe advertising for a film.\nShortly before last Christmas, workmen began to construct a rather large stage at one\nside of Rome's famous square, the Piaxza del Popolo. An’ moot passers-by said, \"Aha, how\nnice, a scene of the nativity.\"\nBut instead of the virgin Mary and the Christ child, the scene turned out to be Gina\nLollobrigida — or rather a life-sized doll image of Gina — riding, barefoot and bareback,\non a little donkey. It was an advertisement for Gina's new film, \"Pane, Amore e Gelosia\"\n(Bread, Love and Jealousy), whioh was to have its premier in Rome.\nThe howl of protest was considerable. But mostly it was directed not against the fact\nthat such an effort had been made to publicize a movie rather than the Christmas. It was\ndirected against Gina's low-cut blouse. Eventually, Miss Lollobrigida herself joined in\nthe protest. The affair quieted down when the s onsors agreed to drape a shawl across the\ndoll image of Gina."
}