{
  "id": "d196-156",
  "text": "pvey — 2,\nblouses of the type that first mad® its appearance at the funeral of the old Fascist\nmarshal, Rodolfo Graziani, a couple of months ago*\nThis was a vastly different kind of mob from the gangs of schoolboys who tied up\ntraffic on Pome's Via del Corso to demonstrate for the return of Trieste to Italy a year\nand a half ago. Those youngsters were loosely organized, even if they were ordered\naround rather effectively — and some of them were just along for the ride*\nThese uniformed young men of the recent incident sepg \"To Arms, m Are Fascists,\"\nand other songs of the Mussolini era. They were well-organized* They had arrived at\ntheir jump-off point in two huge tourist busses. They knew exactly what they intended to\ndo.\nThey hurled rocks through the windows of the Communist bock store just below party\nheadcu rters on Horae's Via Bottegfae Gseure — the “Street of the Park Shops.\" They ex¬\nploded their crude bombs, made fro® chimney pipe and tin cans — and one of them, a 24-\nyear-old by the name of Mario Giunfrida, blew off hie left forearm in the process•\nThey put a wooden hammer and sickle and a red flag up in one of the shattered windows\nof the bookstore, soaked them with gasoline, and set fire to them* Then they scattered\nleaflets of the MSI — the neo-Fascist party — over the street in a literal shower, and\nran off about the time the police were arriving. All ran off, that is, except young\nGiunfrida, who was rushed to a hospital in a police ambulance and remained in critical\ncondition for many hours.\nNow the neo-Fascist party — the MSI — is nothing if not obvious. Its almost com¬\nplete lack of subtlety and political sophistication is one of the reasons why even\nItalians who fear fascism greatly do not take the MSI itself too seriously*\nThus, the Fascist newspaper, II Secplo* openly exulted over the incident. It said\nth t “no one who wishes to call himsel? Italian has the right to be astonished or, worse,\nscandalized,\" by the mob action* These were simply reactions, it said, of patriotic\nyoung Italians to the provocations of the Communists and the inertia of the democratic\ngovernment*\nAnd the director of the party propaganda apparatus, Ernesto Pe Mareio, said the\nepisode demonstrated that the country \"has reacquired the capacity of reaction*\"\nII Seoolo complained bitterly in a front-page editorial because th© Italian radio\nand the Italian press association, in their news reports on the affair, had referred to\nthe instigators as \"terrorists*\"\nThere are newspapers in Rome that list themselves as independent and have no truck\nwith the MSI, as such, while still following in substantial measure the Fascist line*\nThese papers were too clever to take an open stand in favor of the violence committed by\nthe young Gascists* They deplored the violence, while accepting the line that the Commu¬\nnists were really to blame because of their provocative acts over a long period, and\nespecially in the senate during recent debate on the European Union military treaty*\nNow the Communist provocation, in parliament and in the party press and propaganda,\nwas certainly very gre t — no doubt about that* The Conraunists work practically every\nhour of every session of both senate and chamber of deputies to discredit the whole in¬\nstitution of parliament and parliamentary democracy* In that respect, they behave exactly\nas the Fascists do, and th© end goal of the two extreme groups is identical* There is\nnothing whatever to distinguish the behavior in parliament of th© Communists from th©\nFascists, and any objective observer would have to agree with this statement* s’ach group\nis doing its utmost to create in the country the impression that democratic parliamentary\ngovernment cannot cope with the situation in Italy — and their unofficial, unholy\nalliance for this purpose probably is having some effect on the citizenry."
}