{
  "id": "d196-158",
  "text": ".ovey — 4.\nKow, some of you may be saying, in effect* why not let the Fascists re™*\nthey are fighting the Communists, aren’t they? And it is necessary to renort\nleaflets showered on the Street of the Bark Shoes by the young Fascist terrorists d-M\nLlhlh ln PTt f°T their opposition to the ^repoan Union treaty, whfth\nboth the Italian government and our government support* y* n cn\nIkit the question, why not let the Fascists go, so long as zu\nhas a familiar find ominous ring for anyone familiar with the rise\n1920s. And the answer to that question can be found partly in the ais\nand partly in the rather obvious desires of the Communists themselves.\nCommunists\n.r.ciem in the\nt period\nFirst of all, perhaps, it should be said that tki© attitude is exactly what the F**-.\ncists are trying to cultivate. They are out to prove not only that they are more militant-\nly anti-communist t*ian anyone else, but that actually they are the only really effective\ncounterforce against the Reds. And here again, we find that the Fascist end Communist\nobjectives coincide.\nOn the record it seems obvious that the Communists, too, would like very much to create\nthe feeling that their only real opponents ore Fascists. That is because the Communists ar*\nquite convinced that they can win any longrange fight against the Italia* Fascists — by\nwhatever means it becomes necessary to employ.\nKnturally, the Communists hint or charge outright that anyone who really opposes them\nis a Fascist. But their behavior always suggests one thing above all else* Tfca Communists\nare convinced that their real enemy — the enemy who has the capacity to deal with them\neffectively and decisively — is not the Fascists at all, but an effective democratic”\nx5Cve.rnr.3ntf a government capable of carrying out the moderate economic and social reforms\nto which it is pledged; a government capable of enforcing the income tax law** & averment\nready and willing to maintain law and order against any transgressors. This, above every¬\nthing else, is what th© Communists cannot tolerate; what they cannot compete against*\nAs for the Fascists, as I said earlier, they are nothing if not obvious. The battle\nagainst communism is, for them, only the first step; the initial pretext, adopted as much\nas anything else for tactical reasons — to win support from people rightly concerned about\ncommunism. But their target is actually much broader, and they proclaim this openly in\nadvertisements for their party paper, II acolo. They shout that their objective is two¬\nfold 1 to defeat communism and to bring down the quadripartito. That tens refers to the\nfour middle—road democratic parties who make up the present government; the only four\nparties that stand foursquare for democracy in Italy.\nMost political observers I know believe the Communist assessment is correct; that the\nCommunists would win any longrange fight in which their principal opponents were the\nFascists. Sit even if they wore wrong, and the Fascists took over Italy, it is necessary\nto ask ourselves this* Fould a strutting, boasting, bullying Fascist regime in Italy really\nconstitute an effective and reliable ally for America and the free world in the struggle\nagainst Communism?\nThe threat to th© things .America stands for in Italy comes from two directions. The\nrecent Fascist-inspired events in Rome prove that all over again. But it seems to this\nreporter that in this year, 1955 — which marks the tenth anniversary of the liberation of\nItaly from 20 years of Fascism — we can hardly remind ourselves of this stark fact often\nenough. And so, perhaps you can understand why I have gotten the feeling in recent months\nthat much of the political reporting out of Italy for America was more than slightly out of\nfoous.\nGraham Hovey, signing another Letter from Ita y* This program was recorded in Rome\nstudios of Radiotelevision© Italiana for the National Association of Educational Broad-\ncastors — and this is the NABB Network."
}