{
  "id": "d196-167",
  "text": "Reactions to UTTER FROM IT ALT\nPage B\n*1 personally think that \"Letter from Italy\" series has veil interpreted\nseme important phases of economic and political problems in Italy* Graham Horsy\nhas done a scry creditable job in providing ns timely programs from mid-Europe*\n\"I should like to have a series concerning Italian customs* traditions,\navery day Ufa—similar to the BBC series \"London Column*, which I think would\nhelp onr listeners better understand the background to current issues in that\ncountry* Such documentaries might take considerably more time, yet they umildfte\nof wider interest perhaps.\n\"Please let me know if we can be of further help*\"\nSincerely,\n/a/ halt Whitaker\nWalt Whitaker\nProgram Director\nno. 1? - wm\n\"Program series, such as LETTER FROM HALT, give a station1# radio audience\na kind of listening experience which Is not provided by any other broadcasting\nservice. The broadcasts form a friendly link with the Italian people, making\ntheir problems and their progress mere Interesting end important to American\nlisteners.\n\"We hope HAH can continue to haring this and similar series from other nations\nthat cur people may grow in understanding and appreciation of other cultures.\"\nSincerely yours,\n/s/ Ola B* Hiller\n(Hiss) Ola B. Hiller, Manager\nHo. IB - WOI\n\"Regarding we broadcast it rigularly up to the week of\nJuly 5, when the summer package began* I dropped it at that time because the\nsummer offering list indicated there may not be a full 13 week aeries. During\nthe time we did broadcast it, however, mail response wee nil*\n■la view of the present urgency, I have arranged to incorporate the aeries\ncovering Hovcy's trip through southern Italy in our afternoon \"Women*s Forum\"\nprogram. World affaire frequently fern the basis for the material presented on\nthe \"Woman*s Forum\", so the Hovey Commentaries should roach a receptive audience\nthere.\n\"I will pass on to you immediately any listener reactions! I am only sorry\n1 cannot offer you something more concrete at the moment.\"\nBest regards,\n/a/ Dick\ntit"
}