{
  "id": "d196-17",
  "text": "Uhlees something totally unforeseen happens, Fanfani one day aw**,\nItaly*a premier. But it has been understood that he would not make his move until the\nelection of a new president of the republic next April. In the meantime, he was expected to\ndevote his efforts to strengthening the party organization and supporting the Soelba\ncoalition.\nHow political observers are not so sure Fanfani will wait. Some of Fanfani*s followers\nhave told newsmen that he is not impressed with Scelba*s record to date and is critical of\nthe government*s handling of the Wilma Montesl affair. Fanfani*s stock speech these days is\na call for the democratic forces in Italy to regain the initiative. He has given it so\noften end with such emphasis as to suggest to some that he blames the Soelba government for\nlosing the initiative.\nWhether Fanfani himself holds this view or not, it iis held strongly by prominent\nChristian Democrats who agree on little else. Thus, Premier Soelba finds himself being\nattacked openly and with increasing vigor by the right wing of his own party for not orack¬\ning down hard enough on the Commuriists, whose strength in the country seems still to be\nrising. And h® finds himself assailed by a left wing faction of the party for not pushing\nahead rapidly enough with social and eoonomio reforms.\nOne of the leaders of the Christian Democracy *o right wing bloc is a 50-year-old deputy\nfrom Tusc ny, Giuseppe Tognl, He is making it ole r that he would welcome the assistance of\nthe Monarchists and the neo-Fascist Italian Social Movement in an all-out effort against the\nCommunists. It was Togni who provoked the Communists to start the disgraceful riot in the\nohamber of deputies October 19. Ih the excitement over the riot it was often overlooked\nthat the real objective of Togni *s spseoh was to attack the Soelba government for not dealing\nvigorously enough with the Beds.\nA few days after Togni*0 attack from the right, Soelba heard new thunder from the left\nsector of the Christian Democracy. Giulio Pastors, leader of the Christian Democratic labor\nunion, charged that the government’s slow progress on economic and social reforms was endan¬\ngering the democratic system. Pastor# said the Soelba ministry still had not proved that\n\"the country was right in looking upon them as men capable of stopping a dangerous decline\nin the public’s confidence in democracy.\"\nThe question is* Can Amintore Fanfani hold such rebellious — and opposed — factions\nas those led by Togni end Pastore in line behind the Soelba government? And a corollary\nquestion 1st Does Fanfani actually wish to hold the party behind Soelba? Or does he share\nthe dissatisfaction with 5Jeelba to such an extent that he might risk bringing the government\ndown} ending the demoor: tie coalition; and trying to replace it with some other combination?\nFor the moment, Fanfani is still supporting the democratic coalition and Mario Scelba.\nAc for Soelba, he must be pondering once again the fickle aspects of political life.\nHis government will be remembered as the one that negotiated the return of ooveted Trieste\nto Italy. His foreign minister participated in the momentous decisions at London and Paris\nfor bolstering the defenses of w®3tem Surope* He has been proved right in his oontentlon\nthat his partners of the other democratic parties would remain steadfast to the coalition\ncabinet which he he?~ds. His eight months in office have witnessed a gradual upturn in the\nItalian economy. He has Just won four consecutive votes of confidence in parliament by\nmargins greater than the party lineups in senate and chamber would indioate are possible.\nHe must wonder, now and then, what political life in Italy might have been like this\nautumn had it not been for two things over which he had no control#\n1. The death in Tyrhennian sea waters south of Home of an obscure young woman named\nWilma Montesi."
}