{
  "id": "d196-3",
  "text": "Hovey — 4\nHOVEY* \"Well done,\" says the tall man with the Roman nose. \"Very good.\" And Ida\nHaubold relaxes a hit while Professor Romano Guamieri moves along to another Fulbright\nstud ent in the beginning course.\nI wonder how many teachers around the world have retained their enthusiasm for drilling\nthe fundamentals of a language into students over as long a period as Romano Guamieri has. ^\nHis teaching career spans half a century. Many of those years he spent in Holland, serving\nas director of the Italian Cultural Institute at The Hague, as well as professor of Italian\nlanguage and literature at Hutch universities.\nBut Romano Guamieri1 s dashing figure is a fixture of the summer and autumn landscape\nat Perugia. For at least part of each of those 33 years the University for Foreigners has\nfunctioned, Professor Guamieri has functioned, too, in that orange palace outside the\nEtruscan town gate. And he has direotod the special intensive courses for the American\nFulbrighters since their inception.\nUnder the Guamieri method, nothing but Italian is spoken in the classroom. The em¬\nphasis is on the practical and one of the chief instruments is repetitionl After the first\nsession, you can usually hear one of the Fulbright students sayings \"Well, if I can’t get\nit this way it’s a cinch 1*11 never get it at all.\"\nAlmost any evening you can see Professor Guamieri striding along the Corso, going\n\"a spasso\" with some of his studentss A remarkable man of 7G-odd years, who looks more\nlike 50; a man whose great zest for life and teaching seems almost matched by his passion\nfor colorful sport shirts and casual tweed suits. At a dance in the student center of the\nUniversity for Foreigners this fall, the Fulbrighters cleared the floor and applauded\nwildly while Guamieri jitterbugged madly with one of their number.\nAs the reference to that dance indicates, there is a lighter side to the orientation.\nIt is not all work at Perugia. And inevitably shomething of what Perugia is and something\nof what Perugia has been down the ages rubs off on the newly-arrived Americans. It would\nbe difficult to get a consensus of Fulbrighter attitudes toward the whole thing, so I didn’t\ntry. I just asked one of them for his impressions.\nMarshall Bialosky is a native of Cleveland, Ohio, who holds a master of music degree\nfrom Northwestern university. He is on leave from the musio faculty of Milton college in\nWisconsin, and under his Fulbright grant he will study composition in Florence with the\nItalian composer, Luigi dalla Piccolos\n(COMINCIA IL NASTRO NUKBRO HUB)i\nBIALOSKYs At this moment, the word \"Perugia\" for me represents sharp contrast. On *he\none hand, Perugia means a cluster on an Umbrian hillside of ancient churches and walls and\npalaces. There they stand — patient, imperturbable, lovely. On the other hand, Perugia\nat the rnoamUt means a kind of controlled frenzy in which we newly-arrived Americans are\ncaught up.\nInevitably, we try to see it all at oncej to absorb in an hour the culture of the ages.\nAnd we imagine ourselves as medieval men — as a renaissance painter, for example.\nBut we also must fulfill strenuous commitments here at the University for Foreigners,\nand limber up for a year of work in our special fields. And these processes bring us back\nto reality again — citizens of MX a modem world, paradoxically profiled, for a brief\ntime, against this ancient setting.\nThis contrast of the ancient and the modem makes Perugia for me a fascinating, and\nexciting, and significant place.\n(FINISCE IL NASTRO NUMERO HUE)t"
}