{
  "id": "d196-58",
  "text": "araham Kovey — Letter from Italy No. 5\nRecorded In Rome December 19, 1953\nTap© runs 13*30\nThis Is Graham Hovey, reporting from Rome with another radio\ntatter from Italy. These programs are produced for the National Associ¬\nation of Educational Broadcasters with the cooperation of Radio Italians.\nAn American living abroad Is apt to find his nationalism aroused\nIn strange ways. A couple of days ago I could hardly wait to get to the\nneighborhood news stand and buy a copy of Italy's best-known newspaper,\nII Corrlere della sera of Milan. I wanted to read the review of the pre¬\nvious night's performance of Giuseppe Verdi's \"Rigoletto,\" at the famous\nLa Soala opera house. An American baritone, Leonard Warren, had played\nthe Rigoletto.\nNow, I have never met Leonard Warren. But here I was, \"sweating\nout1' his performance at La Scala. And I'm sure I was not alone among the\nAmerican colony in Italy in that respect, what was behind this concern\nfor the singing and acting of a man I had never met?\nThe professional critics of America — and Italy has some —\nwould says American provincialism; a demonstration of the American cul¬\ntural inferiority complex. But I don't think that's it. I think this\nhope that Leonard Warren would do well at Scala was related to something X\nmentioned briefly in a previous tatters the thing X called the second\nAmerican invasion of Italy.\nThe first invasion was our military invasion of ten years ago.\nBy the second American Invasion I meant such things as the flood of American\ntourists and economic experts and congressional committees — and what I\ncalled a kind of cultural invasion that included everything from American\nmovies and soft drinks and sewing machines to artists and writers and\nvisiting professors.\nSome aspects of that cultural invasion have done the United States\nharm with the Italians. Instead of helping to give Italians a full and fair\npicture of American life, they have given aid to those who deliberately dis¬\ntort that picture. Americans residing in Italy should be — and, I believe,\nare — more aware of the effects of such things than the folks back home.\nLeonard Warren playing Rigoletto at La Scala represented an\nopportunity to chalk up a substantial figure on the credit side of the\nAmerican cultural invasion ledger. In coming to Italy to play Rigoletto,\nMr. Warren was bringing coals to Newcastle. Italians like their own fine\nbaritone, Tito Gobbi, in that role. And the Scala audience is surely one\nof the most critical in the world.\nFor the record, I am glad to add that the critic of Corrlere della\nsera liked Mr. Warren, and so did the crowd at La Scala.\nThe critic praised Mr. Warren's \"excellent Italian diction,\" and\nhis \"accentuation of profound intelligence.\" He said Mr. Warren's voice\nwas \"warm and moving\" more than it was powerful and wrathful, as Italian\nstylistic tradition demands of Rigoletto. But he said the values of this\nvoice permitted Mr. Warren to add depth to the character of Rigoletto \"with\nan intelligence that did not escape the public.\""
}