{
  "id": "d196-59",
  "text": "fiovey — 2\nAnd the critic concluded; \"He was, among all, the interpreter\nthat won the heat acceptance and the moat spontaneous applause*\nIt was definitely a big mark on the credit side of that American\ncultural invasion ledger, Just as an all-Mozart concert at Rome*a Argentina\ntheater two weeks earlier had been. In that concert the young American,\nLeonard Bernstein, directed the Santa Cecilia symphony orchestra and was\npiano soloist for Mozart’s Concerto in G.\nThe Italian critics prviously had blasted Bernstein for the way in\nwhich he conducted Beethoven's Ninth symphony with the same orchestra* But\nthis time they came around. The critic for the Rome newspaper, II Measaggero,\ncalled Bernstein a pianist \"of poetic feeling and rich suggestions.1’ He\nadded; \"Enthusiastic applause sanctioned a clear verdict. Another entry\non the credit side of the American cultural Invasion ledger.\nSome would say there is nothing new in such an invasion. They\nwould point out that American students and classicists and artists and\nwriters have been coming here for a long time. Just as Italians in these and\nother categories have come to America.\nWell, perhaps the difference simply one of considerable degree,\nrather than one of kind. At any rate, I am fascinated with this thing I\ncall the second American invasion of Italy. And I honestly believe that few\nAmericans realize how far it has gone and the impact it has had — for better\nor worse — on the way Italians think about America and Americans.\nIt has often been said that Rome and Italy have become for American\nwriters what Paris was after the first World war. No one seems to know for\nsure why this is so, but certainly the writers have come* The names of John\nHome Bums, Alfred Hayes, Paul Hyde Bonner and Eleanor Clark come to mind.\nBorne think John Hersey started it all during the war with his first\nnovel, \"a Bell for A&ano.\" But not only young American writers have come to\nItaly. Ernest Hemingway has been here several times since the war and it was\nhere that he wrote \"Across the River and Into the Trees.\" There is a\nHemingway prize for Italian novel writing, awarded by his Italian publisher,\nMondadori of Milan. Robert Penn Warren has worked here. Sinclair Lewis\nwrote his last novel in Italy and died in Rome. In the postwar period,\nItalian publishers have poured out American books of all periods.\nAs I say, many Americans are aware of this influx of American\nwriters and this rash of American books in translation. Many of us are\naware, too, of the influx of both American motion pictures and the people\nwho make them. No need to call the roll of American stars who have made\npictures since the war at Rome's reconstructed Cinecitta. And sometimes\nRomans have a hard time finding an Italian picture at neighborhood theaters.\nTwo of the three movie houses in the Rome neighborhood where I live are\nshowing American films at this moment. And speaking of Leonard Warren\ncarrying coals to Newcastle by playing Rlgoletto at La Sc ala, one of these\npictures ie the Mario Lanza version of \"The Great Caruso.\"\nAll this, of course, is part of that second American invasion, but\nnot the part that fascinates mej not the part that prompts me to say that\nmost Americans have no idea how far this cultural Invasion has gone.\nLet’s look for a moment at one of the most primitive and remote\nparts of Italy; the island of Sardinia. Its capital, Cagliari, is only a"
}