{
  "id": "d196-60",
  "text": "Hovey — 3\ncouple of hours from Home by air, but you would be surprised how many main¬\nland Italians have never been to Sardinia and have only the foggiest notion\nof what Is going on there*\nWell, here are just a couple of examples of things that have gone\non in Sardinia since the war?\nWith the assistance of the Rockefeller foundation, malaria has\nbeen virtually wiped out in Sardinia* As a result of this three-year cam¬\npaign against the malaria-bearing anopheles mosquito, nearly 9#000 acres of\nfarm land have been reclaimed and more than 60,000 acres Improved through\nswamp drainage. But that’s part of the social and economic phase of this\nsecond American invasion and we're really concerned here with the cultural\nphase*\nIn Cagliari there is a very active cultural group called “The\nFriends of the Book*\" But it Is concerned with more than books* Uhder the\nleadership of Professor Marcello Serra it has organised an experimental\ntheater. And this little theater in remote Sardinia lists on Its program\nfor the current season the \"Blass Menagerie\" of Tennessee Williams; three\none-act plays of the late Eugene O'Neill, and Thornton Wilder's \"Queen of\nFrance.\"\nDoes this give you a better understanding of what I mean by the\nextent of this postwar American cultural invasion of Italy?\nI spent an interesting autumn month in the mountain city of\nPerugia, capital of the Umbrian region. And one night I went to a city\nsquare to hear a concert by the police band, up from Rome.\nOne number was listed as \"Uh Americano in Parlgi.\" If you need a\ntranslation, that's Geroge Gershwin's \"An American in Paris.\" While the\nRome cops were huffing and puffing out a respectable version of the Gershwin\nnumber I happened to turn and look across the square. A movie house over\nthere was advertising Danny Kaye In the Hans Christian Andersen picture,\nbilled over here as *11 Favoloso Andersen\" — the Fabulous Andersen. Perugia\nseamed to be getting this American cultural Invasion from all sides that\nnight.\nA young Peruglnian doctor cam© to visit our house one evening and\nbrought along two volumes of phonograph records. Most of them turned out to\nbe New Orleans Jazz of the Louis Armstrong-Johnny Dodds-Kid Ory era. Some¬\nwhere this young doctor had acquired some old jazz classics that would in¬\ncrease the blood pressure of many a collector back home.\nOn a little street behind our house in Perugia one day I watched\ntwo little girls doing something that looked like the Charleston and singing\nall the while that moth-eaten, long-forgotten American tune, \"*es sir, she's\nmy baby.\" I heard young boys on Perugia streets singing \"La Donna e Mobile\nfrom Rigoletto — but I also heard them whistling \"From the Halls of Monte¬\nzuma,\" though I had not been aware that the united~States marines ever\nscaled the Etruscan walls of Perugia.\nA moment ago I spoke of the American Jazz record collection of an\nItalian doctor. It might interest you to know that last Sunday, Radio\nItaliana carried a long program called, \"La Cltta del Jazz — the city of\nJazz, the city being, of course. New Orleans. And please note that this\nwas carried on Radio Italiana*s Third program. That's the cultural program;\nthe highbrow quality program that corresponds to the Third program of the"
}