{
  "id": "d196-61",
  "text": "Hovey — 4\nBritish Broadcasting corporation# Another recent Third program feature was\na translation of James Thurber* s \"The Women.M\nAnd a regular feature of Radio Italiana* a national program each\nThursday afternoon is \"Vita Musicals in America* — musical life in America.\nThe program this week included works of Virgil Thomson, Russell Bennett and\nDouglas Moore, played by the orchestra of the Eastman School of Music at\nRochester, H. X#, under the direction of Howard Hanson#\nIt Italian listeners didn't feel in the mood for this music at\nthis particular time they could turn their dials from the Rational program\nto Radio Italiana's lighter Second program# And there, this week, at the\nsame time the American music was being transmitted on the Rational program,\nthey would have heard, in translation, a three-act play of Maxwell Anderson*\nSotto i Ponti di Mew York* — under the bridges of Mew York# In other\nwords, at a particular moment on Thursday afternoon the choice for Italian\nradio listeners was that of American music or American drama# You can see\nwhat I mean when I refer to the American cultural invasion of Italy.\nRadio Italiana carries no commercials on its third program and far\nfewer advertisements overall than an American commercial network. But it\ndoes have some sponsored programs# And here again that cultural Invasion\nenters the picture in a way# The sponsor of the broadcasts of the excellent\nRadio Italiana symphony orchestra of Turin this season is the Italian branch\nof an American oil company. The sponsors of three programs on the Second\nprogram one night this week were, in order, an American toothpaste, an Ameri¬\ncan chest rub and an American soap#\nIn addition to hearing American music and drama on their radios; in\naddition to seeing Hollywood's version of American life in their movie\nhouses, the Italians are surely reading more in their newspapers and periodi¬\ncals about America today than they ever did previously#\nI'm not speaking here of the coverage of American government and\npolitics and American foreign policy, but of other aspects of American life.\nI would guess that the major daily newspapers of Italy gave as much space to\nthe wedding of Rita Hayworth and Dick Haymes as most American metropolitan\npapers did# And the Italian press covered thoroughly all the gory details\nof the Bobby Greenlease murder case, too#\nAlong different lines, 1^ Kesaa««ero of Rome recently carried a\nlong article by a journalist rather appropriately named Amerigo Ruggiero\nunder the headline; \"Washington, capital of a thousand aspects• \" And\nAmerigo was astonished and mostly pleased at what he saw in our capital city#\nHe told his Italian readers that the avenues of Washington were\nthe \"most spacious\" in the world) that the Pentagon is the biggest building\nin the world devoted to offices) and that the Smithsonian Institute is called\n\"Uhcle Sam's Attic.\" And Amerigo warned his readers not to miss the\nRational art gallery if they got the opportunity to visit Washington# For\nthere, among other masterworks, he was delighted to find four paintings of\nRaphael which, he told his fellow countrymen, the late Andrew Mellon bought\nfrom Russia at the price of a million dollars.\nI suppose you might say that these articles about various aspects\nof American life In Italian newspapers are a kind of reverse process of that\nAmerican cultural invasion of Italy I have been talking about. But I be¬\nlieve one stems from the other# Undoubtedly both the first and second Ameri¬\ncan invasions of Italy have had a part in prompting Italian newspapers to\nprint more articles for Italians about America#"
}