{
  "id": "d196-65",
  "text": "riovsy — 3\nI think it la reasonable to assume that the workers feel that way\nin part because of the sheer energy and industry of the Communists. The\nCommunist newspaper, L'Unlt^ does not writs on© editorial saying, Mtoo bad\nwhat is happening in Temi. It literally shouts in black headlines for day\nafter day that these workers and their families are suffering and that the\ngovernment and the industry had better do something about it.\nIt is this energy that has allowed the Communists unblushingly to\ntake credit for economic and social reforms actually carried out by the\nItalian government! reforms carried out in the face of relentless obstruc¬\ntion by the Communists.\nJournalists who have visited the areas of the poverty-stricken\nsouth of Italy, where the government's land distribution and reform project\nis underway, report that some peasants benefitted actually give credit to\nthe Communists. With a deep-seated distrust of the Home government, dating\nall the way back to the time of the unification of Italy, some of these\npeasants say they got their land only because of Communist pressures on that\ngovernment.\nHow this is more than just a discouraging situation. It is an\nalarming and critical one. It is critical because the Communist vote seems\nto inch forward with each succeeding Italian election. It is critical for\nItalian democracy because, in the face of these Communist gains and the ever-\nlouder thunder from the neo-Fasolats at the other extreme, the Italian\ndemocratic parties seem more confused and divided than ever* This Communist\nstrength is critical for Italian democracy in any case because it means that\nmany Industrial workers feel they are completely outside the political life\nof the nation! that they have no stake in the present government and no\nstake in the survival of the present democratic system.\nLet's get down to some specifics with r eg surd to these points i\nIn the crucial Italian postwar election of April 18, 1948, the\nCommunists and their left Socialist allies polled eight million votes, or\n31 per cent of the total, and won 183 seats in the Chamber of Deputies.\nLast June 7, the Communists and their allies polled 9*5 million\nvotes, or 55 per cent of the total, and won 218 seats in the Chamber of\nDeputies, for an overall gain of 35 seats.\nIt is always dangerous to read too much significance into local\nelections. But those held since last June indicate that the far left is\ncontinuing to gain. The one that had the most political impact was the\ncomunal election in Vercelli, in the heart of the relatively prosperous\nPiedmont textile Industry.\nIn the Vercelli comune, the Christian Democrats and their allies\nwon office with a total of 13,911 votes over the Communists and left\nSocialists, who polled 13,315* In short, the winning margin was exactly\n596 ballots. But it was the voting pattern that caused the concern.\nThe Communists and left Socialists had gained 294 votes in that\ncomune since the national elections in June. These cam© mostly from the\nSocial Democrats, who had lost 283 votes in the same period."
}