{
  "id": "d196-66",
  "text": "Hovey — 4\nThe governing Christian Democrats scored even a bigger gain than\nthe Communists — 656 votes• But these were scored at the expense of the\nfar political right? the Monarchists, who lost 585 votes and the neo-\nFascists, who lost 253* But these switches from the right did not repre¬\nsent conversion to the democratic faith* Instead, the rightists probably\nfelt that the Christian Democrats since June had moved to the right* Or,\nperhaps they only reflected the post-election bickering within the ranks of\nboth the Monarchists and the neo-Fascist MSI.\nThere was no attempt on the part of the Christian Democratic\ngovernment to claim the Vercelli result as a victory. The Home newspaper,\n11 Messaftftero. which nearly always reflects the government*a viewpoint, said\n\"just the opposite. Jjl Messaggero declared:\nH* . ♦ the truth is that one element prevails over all the others,\nwith a force of persuasion that denies all the objections. . . . It is the\ngrowth of the Communist power.M\nThe newspaper used the Vercelli results as the point of departure\nfor a scathing attack on \"all those who, for months and years, have insisted\non the disappearance of the Communist peril*w\nI referred a few minutes ago to the increased confusions and\ndivisions among Italian democratic parties* And I cited the fact that the\nCommunist gains in Vercelli came from one of these parties, the Social\nDemocrats*\nJi .iessaggero had something to say about this with which even some\nof the leatfers' of these parties would privately agree. With regard to the\nso-called \"lay\" democratic parties — the Social Democrats, Liberals and\nRepublicans — the newspaper asked*\n**What have they done since the elections? Wh&t proof of good\nwill, of firmness and of political vision have they offered?** and JJ.\nMeasaggero added:\n**The electorate — the supreme judge — does not seem to appre¬\nciate the clash of currents, the contrasts of ideas, that disturb the minor\nparties. They (meaning the voters) turn toward the clear-cut positions.rt\nNow it Is easy to point the finger of scorn at parties that have\nsuffered defeat atthe polls. The fact is that these three parties —\nSocial Democrats, Liberals and Republicans — contain some of the most in¬\ntelligent and most devoted men in Italian public life. The struggling\nItalian democracy needs these men and these parties{ needs them today as it\nnever has before in the eight years of its existence. And it should be said,\ntoo, that under the surface they are no more divided nor confused than the\ngoverning party, the Christian Democrats, for which II Messaggero had only\npraise.\nBut the fact remains that all the Italian democratic parties —\nthe Christian Democracy along with the other three — have provided little\nfirmness and political vision since the shock of the elections last June*\nThe fact is that they have provided mostly the \"clash of currents,\nthe contrasts of Ideas,** that XI Messagggga rightly said do not seem to be\nappreciated by the electorate*"
}