{
  "id": "d196-68",
  "text": "Graham Hovey — Letter from Italy Ho. 7\ni Recorded in Rome, December 22, 1953\nTape runs 14 minutes\nThis is Graham Hovey, reporting from Rome with another radio\nLetter from Italy, produced for the National Association of Educational\nBroadcasters with the cooperation of Radio Italians.\nItalian democrats know of only three methods by which to fight\nthe spread of communism in Italy and cut down Communist strength at the polls\nThe first is one that I suggested in a previous Letter from Italy:\nThe democrats must be willing to work as hard as the Communists work at the\ntedious Job of party building. The democratic parties do not appear to be\nworking at anything like the Communist pace at the moment.\nThe second method is the longrange Job of attacking and alleviating\nthe social and economic conditions in which Communism can make its maximum\nappeal. This means, first of all, creating Jobs for as many of those two\nmillion Italian unemployed as possible. It means, literally, bringing off\na peaceful social and economic revolution in order to forestall a violent\none. No one has yet suggested a better longrange method of fighting commun¬\nism. But note the emphasis on the words, long-range. This method will work\nin Italy only if there is time — perhaps 15 to 20 years. And it will work\nonly if the democratic parties have determination enough to compose their\ndifferences on such complicated questions as land reform and courage enough\nto follow through on a common program in the face of bitter and determined\nopposition. I hope to review the Italian government1 s efforts on this front\nin later Letters from Italy*\nThe third method is closely related to the other two and probably\nwill succeed only as the other two succeed:\nIt is the attempt, by persuasion and education and propaganda, to\ndetach major groups — important sectors — from the great mass following\nthe Communists now have; to do this by furnishing solid evidence (a) that\nthe Communists really are serving the Soviet Union, rather than Italy; and\n(b) that genuine progress toward desirable economic and social goals can be\nmad© within the present democratic framework.\nYou can see how closely this third method is tied to, or over¬\nlaps, the others.\nThis third method would be aimed primarily at two major groups:\nOn the political level, it would be aimed first at the three and a half\nmillion Italians who voted for the fellow-traveling left-wing Socialists in\nthe national elections last June; it would be aimed at them and perhaps even\nat their leader, Pietro Nenni. And on the level of the industrial workers\nof Italy it would be aimed at groups within the CGIL — the Communist-led\nItalian General Confederation of Labor, which has claimed as many as six\nmillion members.\nLet's take a look at the current state of these detachment efforts\nin order:\nIn many respects, Pietro Nenni is one of the most interesting\nfigures on the Italian political scene. He is also one of the most impor¬\ntant. And since the ©lections of last June 7, he has been more important\nthan ever, for his left-wing Socialists boosted their representation in the\nChamber of Deputies from 50 to 75 seats."
}