{
  "id": "d196-69",
  "text": "Hovejr — 2\nHope seems to be eternal In many Italian breasts that Nenni one\nday will break his tl© with the Communists and Join the left-of-center\ndemocratic forces.\nIt is hard for an American to understand why this hop© should\nexist. Although Nenni is by all odds the moat prominent member of his\nparty, there is good reason to believe he does not control the party\nmachinery. Most observers outside the Socialist party believe its appara¬\ntus Is In the hands of three younger man — Rodolfo Morandi, Create Hazard1\nand Giusto ToHoy. And Italian democrats regard these three as Communist\nagents within the ranks of the Socialist party.\nIt would take tremendous courage and determination for Nenni to\nmake the break when his party machinery is in the hands of such men. And\nif he were so inclined, he has before him the example of other prominent\nItalian politicians who have broken with his party in the last six years,\nbut who have failed to lure more than a substantial minority of the party\nfollowers.\nThe moat serious break of this kind occurred in 19^7, when\nGiuseppe S&ra&at and his supporters cut their ties because they claimed\nNenni was making the party simply an appendage of the CJcmmunists. But last\nJune 7, the lara&at Socialists polled only a million, 20C thousand votes.\nThey lost 600,000 from their 1948 total, and their representation In the\nChamber of Deputies was cut from 33 to 19*\nSome who know him say that Nenni lacks the courage to make the\nbreak and that he fears it would mean his political ruin If he did.\nOthers think Nenni sincerely believes that no genuine social and\neconomic reforms can be carried out in Italy without Cosnunist support and\nthat a Conuavinlst-Socialist break would doom the hopes for such measures.\nSome observers believe Nenni*6 determination to break with the\nCommunists will increase in direct proportion to Communist chances of coming\nto power in Italy* These observers say Nenni above all is not stupid and\nthat he knows well what has happened to Socialists of his kind after the\nCommunists have taken over in other countries.\nWhatever the truth about the Innermost thoughts of Pietro Nenni\nthere is a substantial group of Italian democratic Socialist© that waits\nfor him to break and believes that someday he will.\nNenni in the past showed himself capable of various kinds of\npolitical evolutions* He once was a Republican. And he was a Fascist and\na co-worker of Benito Mussolini for a brief period.\nHopeful democratic Socialist® also watch for Nenni bids to the\ndemocratic parties for a restoration of the old Popular Front, of pre-world\nWar II vintage. There have been such tentative bids from Nenni since the\nJune elections and one of them, Issued during the long summer cabinet crisis,\nhad a fairly reasonable sound. Nenni said that although hie party had\nbitterly fov^ght the Atlantic treaty, Italy had ratified that pact and, of\ncourse, could not go back on its solemn commitment. He said his party would\nfeel Justified only in demanding that Italy not join any European Defense\ncommunity which would include as one objective the rearming of Ger<n&ns."
}