{
  "id": "d196-7",
  "text": "Hovey — 3,\nIt would be impractical and uneconomical to organize special intensive language\ncourses in several different Italian cities. And it would be out of the question to ask\ndistinguished Italian cultural leaders to make several appearances before Fulbright\ngrantees in several different cities.\nThese were practical reasons why the Commission settled on a single site for the\norientation program. In addition, we felt that inevitable hardships involved in a first\nexperience on a foreign continent are better overcome in a group. Members of the Commission\nstaff can become acquainted with all the grantee35 assist them with their problemsj and\nadvise them on arrangements for their study after the orientation. Grantees meet each\nother and learn about each other’s fields of interest.\nWhy Perugia? Perugia is a relatively small city. Grantees can come into closer con¬\ntact with the local population. They can learn Italian ways more easily and have a more\nrealistic idea of Italian life than they oould obtain in a big city. Among smaller Italian\ncities, Perugi* ic one of the moot beautiful and characteristic. It is a medieval town in\na lovely landscape? yet, it is bustling with modern activities.\nFinally, Perugia has its excellent University for Foreigners, unique in Italy. Its\n2X5IM223PL facilities, resources and faculty are available for this special orientation\nprogram. And this university’s enthusiastic and efficient cooperation has turned what\nmight have boen a complicated venture into a smooth-running operation.\n(FINI3CE IL NASTRO MJMERO THE).\nHGVKTf By having all Fulbrighters together in one place, the Commission has been able\nto provide orientation lectures and panel discussions of a high order, as well as special\nintensive language ooursee. Last year, the Americans heard, a discussion on the intellec¬\ntual in Italian society which had, among its participants, the writer and painter, Carlo\nLevi, author of Christ Stopped at Fboli. This year, that panel included Italy’s best-known\ntheater critic, Silvio d'Amico? the novelist and movie director, Mario Soldati? and Miss\nPalma Bucarelli, director of Italy’s National Gallery of Modem Art.\nDr. Lamberto Borghi, professor of education at the University of Palermo, gave a frank,\nrevealing lecture on Italian education. .An economist from the same university, Professor\nGabriele Morello, gave two lectures on the Italian economic and social structure.\nA highlight this year, as last, was the se*ie3 of five lectures on the modem history\nand politics of Italy, by a young historian, Vittorio Gabrieli. Many Fulbri^iters thought\nProfessor Gabrieli hit his peak with the lecturo devoted to the anti-fascist underground in\nItaly during World War II. And some guessed, correctly, that Vittorio Gabrieli himself had\nplayed a eonsistent role in that underground, having served time in Mussolini's jails as\nearly as 1940. If you had been in the claaroom at Perugia -that day, you would have heard\nProfessor Gabrieli sayi\n(COMINCIA IL NASTRO NUMERO QUATTR0)|\nGABRIELIs The resistance movement against the Fascist dictatorship culminated in the\nguerilla warfare of Italian patriots against the Nasi occupiers of the country and their\nRepublican Fascist satellites. .After the September 8, 1943, armistice with the Allies, the\nItalian regular army, betrayed and abandoned by the King, Marshal Badoglio and most of their\ncommanding officers, did not put any resistance to the Germans and either went home or were\ntaken prisoner.\nThe anti-fascist parties then assumed the leadership of the spontaneous end predomin-\nXXXXX antly civilian movement in the war of national liberation. This was fought by bands\nof patriots or partisans which rose throughout Italy and, helped by Allied arms, engaged the\nGermans and the Fascists in frequent and bloody battles."
}