{
  "id": "d196-71",
  "text": "Hovey — 4.\nIf the Social democrats trying to win converts from the Communists\nand the Nenni Socialists think theirs is a formidable assignment they should\nstop to consider the Job of Giulio Pastore. Signor Pastor© is the head of\nthe CISL, the trade union sponsored by the Christian Democratic party. His\nJob is to build up his union by enticing workers away from the Communist-\nled CGIL, or Italian General Confederation of Labor.\nPastore was once a member of the executive committee of the CGIL,\nwhich was formed even before the end of World War II as an independent labor\nunion. Christian Democrats, Socialists and Communists all participated in\norganizing the CGIL, but the internal politics of the union followed a pat¬\ntern dismally familiar, even in the United States. The Communists gradually\ncaptured control of CGIL machinery and used the big union to call political\nstrikes and otherwise advance their cause. Finally, in August, 1948, Chris¬\ntian Democratic members of the CGIL executive council resigned from the\nunion and set up what has become the CISL under Pastore*s leadership.\nThe CISL has claimed as many as a million and a half members at\ntimes. The CGIL, ably directed by Communist leader Giuseppe dl Vittorio,\nhas claimed as many as six million, though some Italian observers believe\nthe number of dues-paying members may be two million less than that. In\n1949, a third union, known as the UIL, was started by men who originally\nhad been Left Socialist members of the CGIL. The UIL has the support of\nSocial Democrats, Republicans and some Liberals, but its membership is\nthought to be only around half a million.\nConsider, for a moment, the current plight of Signor Pastore,\nleader of the Christian Democratic CISL. Giuseppe dl Vittorio of the CGIL\nhas been oalllng a series of 24-hour strikes to enforce wage demands that\nmany Italians think are perfectly reasonable. Signor Pastor© has been try¬\ning to convince workers that the CISL is just as solicitous for their wel¬\nfare as the CGIL is — or even more so. Pastore has denounced Italian\nindustrialists in stronger language than Di Vittorio. Both to demonstrate\nhis militancy and because he thought CGIL demands were Just, Signor Pastore\nhas teamed his CISL with the Communist-led union several times In recent\nmonths on those 24-hour strikes.\nThis has brought him under fir© from conservative elements in his\nown Christian Democratic party. That criticism hit a peak last week, when\nPastore*s union Joined the CGIL in calling a 24-hour strike of the statall.\nthe workers in Industries operated by the state. For in effect, this was a\nstrike against the government. And the government Is run by Pastore*s own\nChristian Democratic party. That government of Premier Giuseppe Pella made\nit very clear that it disapproved of the strike and questioned its legality.\nIt also made motions in the direction of preparing a law to prevent it from\nhappening again.\nWhat would you have done in Giulio Pastore*s position, given his\nmission of building a great labor union that will compete for members on\nsomething like even terms with the Communist-led CGIL?\nPastore was pilloried for his action by Giovanni Guareschl, author\nof the Don Camilla books and editor of the weekly magazine, CandIdo.\nGuareschl drew a hug# cartoon, showing the Communist, Di Vittorio, about to\npost a Christmas greeting addressed to \"Malenkov, Moscow, USSR.\" It Is\nsigned by Tagil at ti and Di Vittorio. But Pastor© la rushing up, pen in hand,\nsaying* \"Wait before you post it. I wish to sign it, too."
}