{
  "id": "d196-76",
  "text": "Hovoy — 4\nSo far as the dwindling Republican party was concerned, It could\nnot participate In any government dependent on Monarchist support*\nIt Is doubtful that any of three parties would serve In a govern¬\nment headed by Pella In any case. Most of their leaders seem to regard\nPella as definitely a man of the political right* They feel he would have\nswung to the right even If he had not been dependent on those 40 Monarchist\nvotes. And all three parties are severely critical of the manner In which\nPella has handled the Trieste question*\nSo much, then, for the question of why the three parties are not\nsupporting Pella and serving in his government.\nAs for the second question, my brief review of Social Democratic\npolicy and Liberal Internal troubles since the election have already indi¬\ncated some difficulties In the path of union, or even alliance, of the three\nparties.\nNevertheless, alliance, or at least agreement on a common program\nof political action, has been seriously proposed recently by Ugo La Haifa,\nRepublican deputy and former minister of foreign trade In the D© Casperl\ngovernment* Significantly, La Haifa made his proposal for a get-together of\nthe three party secretaries not in the Republican party newspaper, but in\nthe weekly, II nondo, which is edited by the left-wing Liberals*\nAlthough the proposal la not new it has aroused, much interest and\nlively debate In Italian political and Journalistic circles. All three\nparty secretaries — Saragat for the Social Democrats; Villabruna for the\nLiberals, and Qronzo Re ale for La Half a1 s own Republicans — have now re¬\nplied in the columns of II Hondo*\nXou could summarize these three responses with the old American\npolitical expression, rtyes, but.\" All three agree on desirability of common\naction, but they also see the obvious difficulties.\nSaragat now is going all-out in his opposition to the Christian\nDemocrats. He has discovered things about the Christian Democracy that\napparently escaped him during the years in which he collaborated with it.\nHe says that agreements among the three parties can be useful, but what is\nindispensable is that each, on its own ground, recover what Saragat calls\n’’that democratic initiative that through an error of perspective was dele¬\ngated to a coalition whose major exponent managed it for its own use and\nconsumption. * . *,#\nSaragat insists that the Social Democratic program must be a genu¬\nine Hopening to the left.\" He believes that such a policy, coupled with\nall-out assault on the Christian Democrats, will win recruits from the ranks\nof the Nennl Socialists.\nSaragat fears too close a tie-up with the Liberals would hamper\nhis efforts to win working-class support away from Nenni. It is also ob¬\nvious that Villabruna cannot speak up decisively for the Liberals on the\nLa A^lalfa proposal. He must keep ever in mind those 43 blank ballots and 19\nabstentions at the time of his re-election as party secretary.\nI have talked with Signor La Haifa about his proposal. It seems\nto me that his hopes for it are quite realistic. He believes that the two\nsuccessful demonstrations of left-center democratic governments in our time\nhave been the Roosevelt New Deal in America and the Labor government s"
}