{
  "id": "d196-78",
  "text": "Graham Hovey — Letter from Italy No. 9\nRecorded in Rome, January 6, 1954\nTape runs 13?55\nThis is Graham Hovey, reporting from Rom© with a special Letter from\nItaly, produced for the Rational Association of Educational Broadcasters\nwith the cooperation of Radio Italians.\nBy the time you hear this broadcast Italy may have a new prime minister*\nThese lines are necessarily being recorded less than 48 hours after the fall\nof the government of Giuseppe Pella.\nAt this moment, one can only speculate about the turn Italy*s politics\nwill take in the next few days and weeks. The only sure thing in the pic¬\nture Is that they will be difficult days and weeks for the eight-year-old\nItalian democracy and for the man who takes up the burden cast down by Pella\non January 5.\nBut I believe it is possible at this point to answer some of the ques¬\ntions Americans may be asking about this new Italian political crisis. By\ntaking a look at Pella*s tactics in office and a closer look at Italy*s\nbiggest party — the Christian Democrats — it is possible to understand why\nthis thing happened. And It is also possible to understand some of the\ndifficulties that will confront Pella*s successor.\nPella*s dramatic resignation was as much of a shock in Rome as it must\nhave been In Washington. No one had predicted his exit at this time. No\none, with the exceptions of the Communists and Fascists, wanted to precipi¬\ntate his exit at this time.\nIt had been apparent that Pella was heading into serious political\nstorms, particularly with his own Christian Democratic party. But he had\nbeen in the process of reshuffling his cabinet, partly to meet party objec¬\ntions. And everyone seemed to think that with his revamped cabinet, Pella\nwould go on doing business into the spring, and perhaps longer.\nAll evidence supported the idea that Pella was still in a strong posi¬\ntion with the country-at-large.\nThe issue on which he fell was &o& Trieste, though his handling of that\nquestion may have been a long-range factor In the weakening of his political\nposition. And I might interpolate that if the United States and Britain had\nbeen able to make good their October pledge to return Zone a of the Trieste\nFree Territory to Italy. Pella might have been strong enough to ride out this\nJanuary crisis. Still it was not Trieste that caused Pella*s fall.\nIndeed, the immediate factor must have seemed a superficial one to many\nItalians: Pella fell because his own party — the Christian Democrats —\nwould not accept the man he proposed to make hia minister of agriculture.\nThe party would not accept this man although he is a member of the party and\na Christian Democratic member of the Chamber of Deputies.\nPella proposed to nominate Salvatore Aldisio as minister of agriculture.\nThe party wanted Pella to retain Senator Rocco Salomone in that Job. But\nfiaally the party told Pella to name anyone who would be clearly recognized\nas a supporter of the agricultural policy which the government has been\ncarrying out and which the party charted."
}