{
  "id": "d196-79",
  "text": "Hovey — 2\nInstead, Pella said the party's stand was an \"inadmissable\" interfer¬\nence with the freedom of the premier to choose his own cabinet. And on\nthat issue, Pella quit#\nThose are the bar© bones of the story# You can understand why I say\nthat to many Italians this issue must have seemed superficial, brought on\nby petty behavior on the part of both premier and party.\nThe explanation is that there was much more to this situation than met\nthe eye; much more than simply the fate of one cabinet portfolio or the\npolitical fortunes of Signor Aldisio. A crisis between Pella and his party\nprobably was inevitable and the Aldisio affair was Just one symptom. And\nthe fall of Pella, in turn, was Just a symptom of a deeper and broader poli¬\ntical crisis which today grips all Italian democratic parties, but especial¬\nly the Christian Democrats.\nHaving said that, I should add that the Aldisio case by itself was not\nunimportant, and deserves examination. To understand why the party found\nSignor Aldisio completely unacceptable as minister of agriculture it is\nnecessary to recall how forcefully the issue of agricultural reform and land\ntenure has been projected into Italian politics since World War II.\nUnder prodding from the political left, the Christian Democratic party\npledged Itself to a drastic agricultural reform program, including the break¬\ning up of big estates and the distributing of land to the peasants. Partly\non the basis of this pledge, the party won its sweeping victory over the\nCommunists and Left Socialists in the crucial election of April 18, 1948.\nThe government of former Premier Alclde De Gasperi was slow in getting\nstarted on this complicated reform, but work is now well underway and it is\nliterally changing the face of the Italian landscape in the areas involved.\nBy the end of 1952 decrees for transfer of more than 290,000 acres had been\nIssued. By about a year ago more than 160,000 acres had actually been par¬\nceled out to more than 70,000 peasant families, and distribution has been\naccelerated since then.\nBut the whole long-range land reform program will continue for years.\nIt involves home-building, road building, reclamation. Irrigation, flood\ncontrol and modernization of agricultural methods. In addition to land dis¬\ntribution. Many Italians believe land reform is the most important issue\nchallenging the country. Many believe that if carried to a reasonably succ¬\nessful! conclusion it will deal a major blow against communism, particularly\nin the poverty-stricken south of the country, which may be decisive political\nbattleground.\nWell, what has all this to do with Signor Aldisio, whom Premier Pella\nproposed to make minister of agriculture? Signor Aldisio la a member of the\nultra-conservative Right wing of the Christian Democratic party. And as a\nmember of the De Gasperi cabinet, he bitterly opposed the land reform law.\nThe Rome daily, Ii Messag&ero. recalls that Aldisio protested vigorously wher\nthe cabinet approved the law at a meeting from which he was absent.\nYou can understand, then, why supporters of the land reform were so\naroused at the prospect of Signor Aldisio becoming minister of agriculture.\nThey were unwilling to permit a man who had opposed the land reform from\nassuming a position where he could influence government agricultural policy.\nThey knew such an appointment would be exploited by the Communists as proof\nthat the Christian Democratic land reform was dead. They feared Pella was\nappointing Aldisio to appease the Monarchists, who are strongly opposed to\nland reform and whose support Pella has needed to insure a parliamentary\nmajority."
}