{
  "id": "d196-85",
  "text": "Hovey — 3\nD© Gasper! was struck down In th© Chamber of Deputies when he presented\na new and wholly Christian Democratic cabinet for approval the month after\nthe elections, mother Christian Democratic leader, Attillo Plccloni, tried\nto form a government but failed even to reach the point of asking the approval\nof parliament.\nfinally, as a stopgap measure, th© parliament accepted a cabinet headed\nby Giuseppe Pella, mad© up of Christian Democrats and two independents. But,\nas I have indicated, th© party was never very happy with Pella. It was Chris¬\ntian Democratic dissatisfaction with Pella and party prodding of the premier\nto make his cabinet more of a party government that brought on the showdown\nand led to his resignation.\nIt is no exaggeration to say that at some periods since that election of\nlast June the various factions of the Christian Democracy have seemed more\ninterested in fighting one another than in fighting their enemies of the far\npolitical left and right.\nOne of the Italians most alarmed at this deteriorating situation was\nAle id e de Gasperi. He had not taken his parliamentary defeat In July In what\nmany Italians regarded as a gracious manner and after that all the grievances\nthat inevitably pile up against a political leader long in office were heaped\non him. Many of his friends urged De Gasper! to remain on the political side¬\nlines, aside from serving quietly in the Chamber of Deputies. They pointed\nout that the Italian parliament must choose a successor to President Kinaudi\nin 1955 and that he would be in an excellent position for serious consideration\nif he behaved in th© Interim in as non-political a manner as possible.\nInstead, De Gasper I, at 72 years of age and after eight year® of back¬\nbreaking work as head of the Italian government, undertook th© onerous, rarely-\nrewarding job of party secretary* when he announced hie candidacy for that\nJob, he told friends privately i *1 may be th© only one who can keep the oarty\ntogether. *lany Italian politicians outside the Christian Democracy agree\nwith De G asperi* & assessment.\nIt may not be generally known outside Italy that De Oasperi had to sustain\none more humiliation before taking up this thankless Job* Although there was\nno other candidate, 25 members of the national council of the Christian Demo¬\ncracy cast blank ballots on the Issue of electing De Gasoarl party secretary,\nas aginet the 40-odd who voted for him*\nIt is generally agreed among Christian Democratic politicians that those\n25 blank votes were not cast by one faction, but by representative© of several\ndifferent party groupings. The incident may be Important as a revelation of\nhow serious the party split is.\nThis Job of trying to hold the Christian Democracy together and to drive\nit down the middle of th© road, where he believes its only hope of survival\nand success lie, may be th© toughest job De Gasperi has ever undertaken.\nOne thing is certain! He will be blamed if things go wrong; he will get\nlittle credit if they go right. It 1a significant that all through th® Pella\ntenure the Communists and Left Socialists concentrated their fire not on Pella\nbut on De Gasperi. It is significant that the Monarchists, who gave their\nsupport to Pella, have no use for De Gasperi, nor he for thorn. Both extremes\nin the Italian political spectrum seem to know very well which political man\nis their real enemy and the effective foe of the doctrines and dogma© they\nrepresent."
}