{
  "id": "d196-89",
  "text": "aovey — 2\nWe could start, I think, right hack there at the Quirinal Palace with\nPresident Luigi Elnaudi. If you have visited Home you almost certainly have\nseen the Palazzo guirinale. It’s on high ground not far from the center of\ndowntown Rome and it stretches for a good many city blocks along Rome's Via\nVenti Settembre. The palace is a massive structure that was begun about 1574\nby Pope Gregory XIII, on the ruins of the Baths of Constantine* It served for\nmany years as the summer residence of the Popes*\nAfter the unification of Italy late in the 19th century, however, the\nPalazzo Quirinale became the residence of Italy's kings. Its last royal\noccupant was king Umberto II, who held the throne for relatively few months\nafter World War II. And when Italy voted out the monarchy in 1946 and became\na republic, it seemed logical that the Palazzo Quirinal© should become the\nresidence of the President of the Republic* That seemed logical because the\npresident was taking over some of the ministerial functions formerly exercised\nby the king*\nLuigi Elnaudi is actually the first president of the Italian republic*\nBut he was not elected until 1948, some two years after the republic had been\nestablished* In that Interim, Senator Enrico de Nicola served as acting\npresident*\nAs on® historical fact of some importance, we might remind ourselves that\nthe nation of Italy — the unified nation — is only a very few years older\nthan President Elnaudi, who is 78. It's always well to keep that fact of a\nvery late unification in mind when assessing Italy's history and its present\ndemocratic system*\nI would venture a guess that President Elnaudi is the most respected man\nin Italy. That's as it should be, for the president of the Republic is suppos¬\ned to be above the political battle. He is the symbol of the unity of the\nwhole nation; the man whose job it is to hold the country together. Talk to\nan Italian politician of whatever color — from a Communist on the far Left to\na neo-Fascist on the far Right — and chances are he will voice respect for\nPresident Elnaudi*\nDuring the four and a half-month tenure of Giuseppe Pella as premier I\nfound It interesting that Pella's supporters always liked to link his name\nwith that of President Elnaudi — and that Pella's critics like to cite what\nthey believed were the basic differences between the two men from Piedmont*\nI suppose the word \"integrity* explains the respect Italians have for\ntheir President. Luigi Elnaudi, the university economics professor and Liberal\nparty politician, never compromised with Fascism and he was important enough\nand respected enough so the Fascists let him alone*\nThe Italians are apt to have about as difficult a time electing a succes¬\nsor to Elnaudi, when his term expires in 1955, as the French did in choosing\na successor to President Auriol last year*\nIt's the common thing for an American to take a quick look at the Italian\nparliamentary system and say that the president of the Republic has no power*\nThat Is not quite accurate. It is true that the President cannot interfere\nvery much with the executive work of the premier and his cabinet or the law¬\nmaking powers of the parliament* But under certain circumstances, the presi¬\ndent can dissolve either or both houses of parliament, and call new elections*\nAnd, as a matter of fact. President Elnaudi did dissolve the Italian\nsenate last spring after a series of brawls during the debate over the law\nunder which the June elections were to be held. That meant Italy also elected\na new senate, instead of merely a new Chamber of Deputies, as had been stoe-"
}