{
  "id": "d196-91",
  "text": "Hovey — 4\nexpressed his conviction that the higher interests of the country and the\nrelated exigency of insuring and strengthening the unity of his party make\npreferable the commission of the task to another person. The President of\nthe Republic in appreciation of these motives, has accepted the refusal and\nhas thanked the Hon. Pella for his work in the service of the country.”\nPella himself repeated much of what Carbone had already told the journa¬\nlists when he left Einaudi's office a few minutes later.\nMost observers felt that Einaudi's offer to Pella was in the nature of\na courtesy. During cabinet crises when Alcide de Gasperi was premier, Einaudi\nfollowed the procedure of always asking the resigned prime minister to make\nthe first new attempt at forming a government. It was obvious that Pella did\nnot have the support of his own party — the Christian Democrats — and there¬\nfore could not form a new government at that time.\nBut with the courtesy to Pella out of the way, Einaudi could get on with\nhis job*\nAmintore Fanfani, minister of the interior in Pella* s cabinet and a man\ninstrumental in bringing aoubt Pella* a resignation, was summoned to the\nQuirinal palace.\nShortly before noon. Secretary General Carbone came out to meet the news¬\nmen once again and here is what he said:\nCARBONE (fourth tape begins)! ”11 Presidents della Repubblica ha affldato\nall*on. Amintore Fanfani i1Inoarioo dl formare il nuovo Governo. L*Onorevole\nFanfani si e riservato di accettare.”\nHQ VEX (translating)! rtThe President of the Republic has entrusted to the\nHon. Amintore Fanfani the task of forming a new government. The Hon. Fanfani\nhas accepted with reserve.”\nAnd a few minutes later Amintore Fanfani himself cam© out of the Presi¬\ndent^ study to say the same thing at somewhat greater length. Here, then,\nis the premier-designate of Italy, as recorded at that historic moment in his\ncareer by Radio Itallana:\nFANFANI (fifth tape begins): ”Vi e gia stato dato il comunicato relatlvo\nal colloquio ch© 11 signor President© della Repubblic si e degnato di accor-\ndarmi. Il signor President© mi ha invltato ad assumere 1*lncarico della for¬\nmas lone del nuovo Governo. Secondo la# formula tradizionale ho accett&to con\nreserva.”\nHU VEX (interrupting to translate): ”Xou have already been given the\ncommunication relative to the conversation that the President of the Republic\nhas accorded me. Mr. President has invited me to assume the task of the\nformation of a new Government. According to the traditional formula, I have\naccepted with reserve.”\nBy accepting \"with reserve,” Fanfani meant that he would undertake a\nseries of conferences with political leaders not unlike that completed by\nPresident Einaudi, but with the purpose of finding out if he could command\nenough support to form a government. To form a government, that is, that\ncould command a majority in both houses of parliament.\nThus, with Fanfani*s announcement, the ball passed to him from President\nEinaudi and another phase of the crisis hade**IWIfc ,"
}