{
  "id": "d196-99",
  "text": "/©y ~ 3.\nI couldn’t get close enough to hear what he said, but I was sure X knew2\nfor him this \"dlsgrazia\" was only the latest In a long series of Insults suffer¬\ned by the \"real Italians\" — those from Naples south — at the hands of the\nnorth ever since the unification of Italy under the aegis of Piedmont 80-odd\nyears ago* After all, imintore Fanfanl was a native Tuscan, wasn’t he? And\nhe had been a university professor in gilan and Venice? Scco, Signor lieutenant\nof the Carabinieri, it is all very clear and it is certainly a \"diagrazla,\" and\nhow long do they think the Neapolitans will tolerate this state of affairs?\nThen there was the pleasant, well-informed, well—dressod elderly lady who\nstood on my right in the line and conversed with the men around her about the\nparty lineup and the mathematical breakdown of the Chamber. If she had gotten\ninto the gallery she was one spectator who obviously could have told the players\nwithout a scorecard and Gould have given thumbnail biographies of many of* them.\nShe didn’t think Signor Fanfani’a chances were very good, and she was\nspeculating ea whom President ^inaudl might summon to make the next try at form¬\ning a government if Fanfanl should fail. Someone thought It might be De '.Pa a perl\nand the lady said si, but it should not be forgotten that De o&sper 1 now has\n72 years.\nThere was the latecomer who Insisted that his ticket had come right from\nthe Presidency of the Council of illnlspters in the Palazzo Viainale and there¬\nfore must be honored.\nBut when he passed it up for inspection It turned out to be series L§\nlike all the rest, end the patient carabiniere explained the situation once more.\nThen, as the ticket wat* passed back through the crowd, the last man on the\nchain got a big laugh when he turned it over to its embarrassed owner with a\nflourish and shouted 1 *Arrivederel, Bignorel* Arrivedere1 generally translates\nas goodby for now, or >©rh&pc, wsolong, but in this instance it really meant,\n\"better luck next time.\"\nThe crowd gradually thinned as it became apparent that the situation was\ntruly hopeless, but I would guess that com© of those good folk, drenched and\ncold* were still waiting at that west entrance when Fanfanl left iiontecitorio\nfor the Senate.\nAnd when I sloshed through the rain to the Medma palace, I found cluster¬\ned at one of the entrances to th© Senate the same kind of crowd I had Just left\nat iontecitorlo, huddled under umbrellas and newspapers and coats. If I had\nstopped for a moment, I’m sure I could have picked out the a me types and heard\nsome of the same conversations I had heard outside the Chamber.\nThis reporter will not soon forget those crowds of cheerful Italians,\nhuddled in the rain outside aontecltorlo and the hadama palace that last week\nin January, hoping for the chance to watch their parliamentary system function\nin time of political crisis. And despite the considerable discomfort Involved,\nI found that I was glad I had waited for an hour and a half with that friendly\ncrowd outside the Chamber of Deputies that January 26. ‘/hen you are living\namong them, it is hard to avoid the conclusion that the Italians somehow des¬\nerve better than they have received from history.\nAs the result of my contac© with those crowds, I know that I felt a bit\nbetter about the staying power of the Italian democracy as I entered Madama\npalace to hear Signor Fanfanl present his program to the senate of the Republic.\n*####**#"
}