{
  "id": "d1488-0",
  "text": "NEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 29, NO. 3 MARCH, 1964\nRadio Station Division Gets Up Steam\nSome 50 radio leaders met at the NAEB seminar iti Chicago\nJanuary 29-31 to consider educational radio’s future. The\ngroup was unanimous in its support of a plan for the NAEB\nRadio Station Division to establish its own full-time execu¬\ntive in W ashington.\nThose in attendance also endorsed the proposed Educa¬\ntional Communications System, a plan for which has been\nsubmitted to the USOE for NDEA funds for a feasibility\nstudy. Jerrold Sandler, production manager of the University\nof Michigan’s WUOM, has been tentatively named coordina¬\ntor of the study.\nColby Lewis to Edit Journal\nWalter Emery has resigned from his post as editor of the\nNAEB Journal, because he expects to be out of the country\nmuch of the time during the next academic year, on sabbati¬\ncal leave from Michigan State University. Effective April\n15, Colby Lewis, coordinator of CCTV at MSU, will become\nthe Journal editor.\nCorrection on Samoa\nIn the January Newsletter, which carried an item on person¬\nnel going to Samoa to work on the NAEB project there, H.\nEugene Larson was listed as being from KVIE, Sacramento.\nActually, though he worked for the station at one time, for\nthe three years prior to his leaving for Samoa he had been\nTV engineer for Sacramento State College.\nPenn State Offers ITV Story on Film\nPennsylvania State University offers for loan a 38-minute\n16mm film, “Instructional Television at The Pennsylvania\nState University: 1954-1963.” A print is available without\ncharge except for return postage from: Audio-Visual Aids\nLibrary, Pattee Library, Pennsylvania State University, Uni¬\nversity Park.\nNew Institutional Members\nRADIO DIVISION AND NETWORK\nBoston University, Station WBUR (FM) ; Cousino High\nSchool, Station WPHS (FM), Warren, Michigan.\nINSTRUCTIONAL DIVISION\nUniversity of Akron (Ohio); University of Cincinnati; De¬\ntroit Board of Education; University of Illinois; Kent State\nUniversity (Ohio); University of Minnesota; New York City\nBoard of Education, Brooklyn; University of Oregon; San\nDiego State College (California); South Carolina Educational\nTelevision Commission; Southern Illinois University; Uni¬\nversity of Tennessee; University of Texas; Twin City Area\nEducational Television Corporation, St. Paul; Wayne State\nUniversity, Detroit; WGBH Educational Foundation, Cam¬\nbridge, Massachusetts.\nINDIVIDUAL MEMBERS\nDuring the last three months, 92 new Individual Members\nhave joined the NAEB.\nIndiana to Host Region III\nNAEB Region Illers will meet at Indiana University March\n22, 23, and 24. Among the attractions will be tours of I.U.’s\nnew $2.5 million radio-TV building featuring eight studios,\none of which is said to be one of the largest between New\nYork and Los Angeles.\nTours of the building and registration for the conference\nare scheduled to begin Sunday afternoon about 3 o’clock. The\nconference will 0lose shortly after noon on Tuesday.\nAmong sessions in the proposed schedule are those deal¬\ning with: what the TV producer needs to know about educa¬\ntional methods; visual effects in relation to production equip¬\nment ; planning CCTV facilities; ITV and the school ad¬\nministrator; programing the small radio station; ITV and\nschool design; what the educational broadcaster needs to know\nabout law; the ETV station and public controversy; and new\ndevelopments in equipment.\nProgram details and registration material will be mailed\nfrom I.U. to Region III NAEBers.\nFree Films for TV Stations\nA new series of five 271/£-minute films, “Painting and Finish¬\ning Tips,” produced especially for TV has been released for\nfree use by TV stations. Write: National Paint, Varnish and\nLacquer Association, 1500 Rhode Island Avenue, N.W., Wash¬\nington, D.C., 20005.\nCompetition Opens for Cinema Awards\nThe Society of Cinematologists announces two $1,000 awards\nin creative cinema, one for the best original shooting script,\nand the other for the best film. Competition is limited to\nAmerican citizens under 25. Further information from: Prof.\nRobert Gessner, New York University, Washington Square,\nNew York City, 10003.\nWisconsin Announces Kaltenborn Scholarship\nBroadcasting graduate or upperclass undergraduate students\nmay apply for the Kaltenborn $1200 scholarship for the 1964-\n65 school year at the University of Wisconsin. Selection of\nthe student is on the basis of: scholarship, special aptitudes\nand interest in some phase of broadcasting, evidences of plan¬\nning for a career involving the use of radio-TV media, and\nfinancial need. Application deadline is April 1. Applicants\nshould furnish: transcript of all college-level credits; letter of\napplication, presenting his interests, experience, and ambitions;\nand three supporting letters. Write to Prof. H. B. McCarty,\nRadio Hall, University of Wisconsin, Madison.\nAnne Bradley Leaves NAEB\nMrs. Anne Bradley resigned from the NAEB staff last month.\nShe was coordinator of the NAEB Sudan Project and for\nthe past two years had served as coordinator for the national\nconvention. She is now working in the banquet sales depart¬\nment of the Marriott Motor Hotels.\n1"
}