{
  "id": "d1386-17",
  "text": "-18-\nr EDUCATIONAL RADIO—3SPTEMBER-0CT0BER~”\nUNIVERSITY OF CHICAGO MISS AWARDS TO SEVEN CHURCH GROUPS for best religious pro¬\ngrams in second annual religious radio workshop. First awards went to Troy, N.Y.\nCouncil of Churches, Tri-City Radio Commission, and Station WTRY, Troy for the\nprogram, \"Roligiqn-S View the News” •\nHAEB STATION, WHCU, CORNELL UNIVERSITY PRESENTED PRESS AWARDS TO SIX N.Y. news\npapers in second annual Press Leadership Awards at a Cornell Press-Radio Dinner.\nMike Hanna, WHCU director presented awards to editors for outstanding leadership.\nMUTUTAL BROADCASTING SYSTEM BEGINS USE OF POPULAR PROGRAM FORMATS, \"designed to\nentertain as they educate\" in a new four—part information scries, \"The ..tom and\nYou.\" Under direction of MBS's Elsie Dick, shows will be produced by Sherman Dryer.\nSECRETARY\nNAEB EXECUTIVE/REPRESENTED THE LATE MAYOR LAGUARDIA’S FAMILY in the \"One World\nAward\"tour which took him to five European capitals.\nSIX GERMAN BROADCASTERS COMPLETE AMERICAN TOUR AFTER STUDYING U.S. radio for the\npast 5 months on an extended tour of American educational and commercial stations.\nTour was jointly sponsored by Rockefeller Foundation, Columbia University, and\nNational Association of Educational Broadcasters.\nVOICE OF AMERICA TAKEN OVER BY STATE DEPARTMENT concluding arrangements whereby\ndepartment depended on \"farming out\" scripts and production to foreign departments\nof commercial networks. Latin American shows will be cut; European.'schedule will\nremain intact and given greater impetus by addition of BBC relay facilities.. Far\nEastern programs will continue in Chinese, Korean:, Russian and English but will\neliminate Maylay, Siamese and Annamesc transmissions.\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS HOLD ANNUAL MEETING AT URBANA\non University of Illinois campus where resolutions were adopted for strong rep¬\nresentation to FCC to reserve certain TV channels for educational and non-profit\npurposes. Plans for an FI-AM transcription network, linking educational outlets\nin major cities wore approved, and Dallas Smytho, former FCC economist, appointed\nto direct study of facilities for proposed net.\nMORRIS S. NOVIK, N.Y., RADIO CONSULTANT WAS REAPPOINTED executive secretary for\nthe group. Re-elected as officers and directors wore Richard B. Hull, president\n(WOI, Iowa State College); John Dunn, vice president (WNAD, University of Oklahoma);\nW. I. Griffith,secretary-treasurer (WOI, Iowa State College); and directors:-\nSeymour Siegel (WNYC, City of New York), Graydon Ausmus (University of Alabama),\n■Ralph Stcetle (Louisiana State University), Harry Sknrnia (Indiana University),\nIrving R. Merrill (University of South Dakota), and James Morris (KOuC, Oregon\nState College.\nKIKE HANNA (WHCU,. CORNELL UNIVERSITY) AND KAY LARD IE (WDTR, DETROIT BOARD OF\nEDUCATION) represented U.S. radio at UNESCO mootings in Paris"
}