{
  "id": "d1386-23",
  "text": "ORDER DELAY ON NETT FORI IS\nThe Commission adopted an Order extending to December 1, 1948 the required date of\nuse of FCC Forms 301, 302, 303, 313, 314, 315, 321 and 701 (Docket 8978), as\nrevised June 16, 1948, as it appears these forms cannot be distributee to tne\nin time to begin their use by the prescribed date of October 1, 3.948.\npublic^\nPART I of COUilSEION*S RULES ARE AMENDED\nAmendment of Part I of the Commission’s Rules and Regulations was announced.October\n21. The changes aie organizational or editorial in nature and designed to improve\nthe internal administration of the Commission.\nThe amendments reflect \"changes of nomeclature with respect to organizational units\nwithin the Commission to make the names of these units consistent with suggestions\nof the Senate Committee on Expenditures in the Executive Departments, and cnanges\nin organization of the Engineering staff of the Commission,\" the order stated.\nThe principal units of the Commission’s organization will be Bureau^of the Secretary,\nBureau of Accounting, Bureau of Law, Bureau of Administration, Hearing Division\nand Office of Information.\n-X-tt ##\nFCC PROTESTS MEXICO’S USE OF 540 KC\nVigorous protests against the proposed assignment of 540 kilocycles to a 150-kilo-\nwatt station to be located at San Luis Potosi, Mexico, were announced by the FCC.\n\"The frequency 540 kilocycles is not presently a part of the standard broadcast\nband under existing international agreements and the Commission's Rules_and Regula¬\ntions. However, under agreements reached at the International Radio Comerence in\nAtlantic City in 1947, the frequency was made available for such use, subject to\nagreement among the interested countries. The subject of its utilization is.expected\nto be one of the major items to be considered at the next Forth American Regional\nBroadcasting Conference, to be held in Canada in September 1949.\nORAL ARGUMENT FCC LOTTERY RUT\nT,S UPCOMING\nA proposed order of appearance at the oral argument in the matter of promulgation\nof rules governing the broadcast of lottery information was announced by the *CC\nTuesday, October 12.\nThe argument which was•scheduled for October 19 at 9:30 a.m., was limited to thirty\nminutes each, unless prior arrangements were made with the Commission.\nThe following have expressed a desire to appear and will be heard in the order\nnamed: American Broadcasting Company; National Association or Broadcasters, .aT~\nland Broadcasting Company; Radio Features, Inc.; Radio Council of lational Adver¬\ntisers; Columbia Broadcasting System; National Broadcasting Company; ,. Theodore\nPierson; Arthur Scharfeld; Symons Broadcasting Company; Associated Activities,\nInc.; Louis G. Cowan, Inc.; and Premium Advertising Association, Inc."
}