{
  "id": "d1386-23",
  "text": "National Broadcast Reporter\nPage 22\nSymposium of Views of Agencies On Radio Advertising\n(Continued, from page 8)\nsufficiently to prevent him from tuning\nout that particular program.\nTherefore, radio today is not a ques¬\ntion of government supervision or con¬\ntrol. It is doing a job and has been\nable to do this job in a comparatively\nshort number of years; and it will con¬\ntinue to increase, adding thousands each\nyear to the number of listeners because\nof only one thing: the building of bet¬\nter, more interesting, and more appeal¬\ning radio programs by national adver¬\ntisers.\nBy John L. Butler\nJohn L. Butler Company\nIn our opinion it would not be prac¬\nticable and satisfactory from the stand¬\npoint of the advertiser, who in the last\nanalysis makes possible the sponsored\nradio program and a great deal of the\nfine entertainment which is provided on\nthe air.\nWe do agree, however, that there is\nconsiderable abuse made of commercial\nannouncements, and it would be a fine\nthing if some method could be devised\nof adjusting them so that the listening\npublic would accept them more readily\nand the advertiser get some value from\nthem.\nIn our opinion it is the smaller type\nof station—not a member of a chain—\nthat is struggling against competition\nfor local advertising which is the worst\noffender in this particular respect. To\nget business, they promise anything,\nand there are always a number of adver¬\ntisers who insist on announcements\nwhich go beyond the bounds of good\ntaste and good business. We feel that\nthese are the types of stations and com¬\nmercial announcements which should be\nregulated.\nIn our own experience over several\nyears of broadcasting over a large num¬\nber of stations, we have paid a great\ndeal of attention to the matter of com¬\nmercial announcements. In fact, our\ntendency has been to cut them down in\nlength all the time, yet on the other\nhand if they were eliminated entirely,\nwe doubt very much if we could recom¬\nmend radio advertising to our clients. If\nthe advertiser did not see some value\nin radio, he certainly would not want\nto take it up. Furthermore, the novelty\nof just having a sponsored program on\nthe air has disappeared, so that there\nwould be no particular value from this\npoint of view.\nThe important point in the whole\ncontroversy, in our opinion, is not so\nmuch the length of the commercial talk,\nor whether there is a commercial talk—\nrather it is how it is done and put over.\nWe know of a great many programs\nwhere the sales talk is so subtly handled\nand woven into the fabric of the enter¬\ntainment that it is not even noticed.\nWe are in favor of the more intel¬\nligent handling of commercial an¬\nnouncements—of properly educating or\neven compelling the advertiser to adopt\na broader point of view on commercial\nannouncements. And, particularly, the\nelimination of a lot of small and dis¬\nrupting stations where the open door\npolicy of taking anything that is pre¬\nsented does real damage to the con¬\nscientious station which exercises some\ncontrol over this important phase of\nradio broadcasting.\nWe feel that much of the sales talk\nin many radio programs is due to igno¬\nrance on the part of the advertiser or a\ndesire to \"get his money’s worth,” and\nif he can be made to appreciate that an¬\nother policy would be more beneficial, a\ngreat deal of the difficulty would be\neliminated.\nFinally, it seems to us that it is a\nserious mistake to permit only the an¬\nnouncement of sponsorship of programs,\nbecause this would drive the advertiser\noff the air and then our broadcasting\nwould be infinitely less interesting and\nmore along the lines of the English\nbroadcasts, which we do not think would\nbe satisfactory in this country.\nBy W. Vincent Leahy\nHanak, Klein and Leahy\nFor some five years our clients have\nused radio broadcasting as an advertis¬\ning medium and throughout this period\nwe have always advocated brevity in\ncommercial announcements.\nWe believe that lengthy copy and\nexaggerated claims are harmful. Far-\nseeing advertising executives realize that\nill will rather than good follows un¬\ndesirable sales propaganda.\nUnless an advertiser can afford to use\nseveral forms of publicity, it is impos¬\nsible for him to profit by radio unless\nhe is free to give some description of\nhis wares.\nWe do not believe it would be prac¬\ntical or satisfactory to limit announce¬\nments to name mention only. In most\ncases, the description of a commodity\nor an explanation of its uses is neces¬\nsary to distinguish the product.\nFew, if any, advertisers would use\nnewspapers or magazines or outdoor\nadvertising if they were compelled to\nconfine their publicity to the mentioning\nof their trade name, and we think radio\nis now in much the same category as\nother forms of advertising.\nGenerally speaking, we believe an in¬\ntelligent message can be conveyed in\ntwenty-five to fifty words. We question\nvery much whether those who are now\nusing radio would find it profitable to\nspend large sums of money for mere\nsponsorship mention.\nIll-advised advertisers are responsible\nfor excessive and exaggerated sales talk.\nOften they count only the immediate\ncost of a program.\nA t h i r t y-minute trans-continental\nbroadcast represents a rather large ex¬\npenditure. When the total price of a\nprogram is considered in relation to the\nactual time given to the commercial an¬\nnouncement, the advertiser is somewhat\nappalled at the cost. Consequently, he\nfeels that he must crowd in all the\nsales talk possible.\nOur sales propaganda on any pro¬\ngram is limited to not more than fifteen\nper cent regardless of the length of the\nproduction. More often than not it is\nten per cent.\nAside from our interest in radio as\nan advertising medium, we would re¬\ngret very much to see hard and fast\nrules made regarding sales talks for we\nare sure that few advertisers could afford\nto spend vast sums of money for name\nmention, and there is no one else, so far\nas we know, who will assume the cost\nof broadcasting.\nBy E. Brisacher\nEmil Brisacher and Staff\nI believe that the limitation of radio\nsponsorship to a mere announcement of\nthe firm name would ultimately result in\nthe withdrawal of fully 90 per cent of\nthose firms which are now using radio\nbroadcasting.\nThe mere building of good-will\nthrough the sponsorship of a program\nis too expensive a luxury to be enjoyed\nby most corporations, and the small\nvalue that the mention of a product\nmade would have without the inclusion\nof a selling talk would hardly justify the\nexpense of broadcasting.\nI believe that such a policy would\nresult in the eventual lowering of the\npresent quality of radio programs, until\nultimately the public would be com¬\nplaining. While it is true that some\nprograms are overdoing the advertising,\nmost of the programs have a good bal¬\nance, and when you consider the vast\namount of entertainment that is sup¬\nplied and the small amount of adver¬\ntising that is injected, the public is more\nthan getting its money’s worth.\nTo place radio advertising in the\ncategory of mere announcement of\nsponsorship, to our minds, would be a\nblow that radio could not withstand."
}