{
  "id": "d1386-28",
  "text": "-29-\nT/JEAT IS TUB NATIONAL .ASSOCIATION OF EDUCATIONAL BROADCASTERS?\nHOW DOSS IT SERVE EDUCATIONAL RADIO?\nThe National Association of Educational Broadcasters during the past three years\nhas steadily increased its number of active and associate institutions and\nindividuals to a total of more than 95 members in 32 states, Hawaii, and the\nDistrict of Columbia.\nN-A-H-B represents the non-commercial educational AN and FI' radio stations,.\nworkshops, and production centers owned and operated by colleges, universities\nand public service agencies.\nF-A-S-B represented 9 member stations in Clear Channel hearings before the Feaeral\nCommunications Commission in 1947-48s appeared before the Senate Interstate and\nForeign Commerce Committee hearings on the Johnson Bill in 1948, and has had\nobservers and participants in the FCC Nayflower hearings, the newly-j.ormed Univer¬\nsity Association for Professional Radio Education, the FCC television near mgs,\nand numerous conferences and radio meetings.\nN-A-E-B sponsored a special session at the Ohio Institute for Education by Radio\nand maintain liaison relationships with the School Broadcast Conference, the\nAssociation for Education by Radio, the Federal Radio Education Committee of\nthe Office of Education, the Canadian Broadcasting Corporation, the British\nBroadcasting Corporation and the North American Service of Radio Diffusion.\nN-A-B-B, acting through its central office ana regional directors has.supplied\nthrough correspondence and by special consultant trips a free-consulting service\nto members and\" to colleges and universities establishing or planning to estaolish\nfor the first time their own broadcast outlets.\nComplete detail on membership in the N-A-B-B may be\nobtained by contacting U. I. Griffith, oecreoary -\nTreasurer, Station TJ0I,Iowa State College, Ames, Iowa.\nThe H-a-E-B has regional directors who are ready and willing to extend information\nand advice to prospective educational broadcasters or to answer questions on\nmembership and policy. Their names and locations:\nREGION I\nREGION II\nREGidi in\nREGION IV\nI^GTON V\nREGION VI\n- Seymour Siegel, Station HNYC, City of Now York\n- Graydon Ausrnus, Station IIUOA, Alabama University\n- Harry Skornia, Station ITFIU, Indiana University\n- Irving Merrill, Station HUSD, South Dakota University^\n- Ralph Steetle, Station T7LSU, Louisiana State University\n- James Morris, Station KOAC, Oregon State College\n— Cohn & Marks, Attorneys, Evans Bldg.\nmil YORK CITY REPRESENTAT.r/B — N:. S.,.Novik, Room 370, 630 Fifth Ave."
}