{
  "id": "d1386-9",
  "text": "-10-\nIS THERE A DOCTOR IN THE MICROWAVES?\nThe Federal Communications Commission has approved an experiment in paging doctors\nby radio. A How York firm, Tclanscrphonc, Inc., was authorized to build a radio\nstation for broad casting code numbers assigned to doctors. Physicians would\ncarry smc.ll radio receivers. Code number wouldbc repeated until doctor answered\nthe telephone.\nCBS TRY3 IT11W TYPE OF FOOTBALL COVERAGE\nWnvnmbo-p 1T found CBS trying..ajthroozhfflaiose^^\ncalled the \"F^otbn.11 Roundup11. T^monty-nine^-Jor,,,football games.iiilL^IQF2T.^\ncither bv~dirqct~ pick-up,\nassociation‘wire reports. Show!s idea is to., omphashighlj^^^\ntop games, ins toed of single game\nBOSTON UNIVERSITY OFFERS ON-JOB TRAINING\nField work with stations in and around Boston will augment classwork thiu fai an\nwinter for radio students at Boston University. ArrangoTOrts have boon completed\nwith 7 stations. Professor Should, radio division director stated, ,.nd yPPro^\nmatoly 45 senior and graduate students will spend a two-week training period with\nthese stations.\nCovering all phases of station operations, procedures will vary in separate stations,\nBasically students will apprenticeship in various depart! onts. S^tions will\nreport on each station’s work.\nnntj nnnPNN/.TIWi STATION IN WASHINGTON^ D^C.\nA new FN station. WCFIi\nthe air in the nation’\nwhich win invite \"bad: talk” fror li3tcncrs_tes_takcrtto\n. \" Cinidod bv a listener's council. Qiq30..ct.gi_ to guide\nend criticize ^tT^~^icvT station'will vet reaTtions_.f^jUL°mffiMations\nnhllanthr'opiB oducatipnal^yeterans^,labor and religious groups.\nAmong them are associations which 3 yoSES.JiffiL£te^\nrind’ of them arc cooperativcs_in_tho_J:io,ld ,of .foodjjTSalth ins;gan^o_^^e3-.5gi-1;—>\ng^^iTarNrcdirNiTons ar'd own\nsent about AO.000 persons, in.\n1 embers of the same cooperatives hold r.&irt^0jeM£on^^\nout standing shares of preferred stock•\nStation win not bo onoratod for nr of itJ_othor_than_a. .Ijcrccnt cumnlr.tlyo.diyi-\nearnings will bo^low20a°jllnto station operation.\nStation\"-president is C. Edward Bohroi_station manager .isjujl. hern.\nHAB AMD \"VOICE 07 DBTOCRACY\" DISKS\nThe National Association of Broadcasters announced it has distributed five\nminute- discs on democracy as models for high school students competing m\nsecond annual \"Voice of Democracy\" contest during National Radio cole,\nNovember 14 to 20. Film star James Stewart, NAB president Justin filler,\nJunior Chamber of Commerce president Paul Bagwell, and former Commissioner\nof Education, John Studobakcr will appear in the now discs.\n^3"
}