{
  "id": "d1146-0",
  "text": "Office of Executive secretary\nUrbana, Illinois\nNovember 1, 1940\nNEv, :VJ1 AUDIOS DEDICATED\nOne hundred eighteen educational broadcasters and representatives\nof educational institutions and civic groups attended the First\nAnnual Conference on Applied Radio at the University of Iowa on\nOctober 17-19. Highlights of the Conference were the dedicatory\nservices for the new WSUI studios and the emphasis placed upon\nradio’s role in educating and informing people in the democratic\nway of life.\nDemocracy must recognize free radio as a major instrument for\nmeeting the revolutionary change? facing America today. Dr* James\nRowland Angell, educational counselor for NBC, pointed out in hie\naddress on f,The Place and Function of Radio in a Democracy, ”\nf,The business of education is to make people free,” said Dr.\nC. a. Siepmann of Harvard University, former program director\nfor BBC, at the educational directors * session of the conference.\n\"The magnificent function of the broadcaster is to put up sign¬\nposts, give direction to peopled thoughts and hopes. Radio\nmust get across to a mass audience the feeling of belonging, of\nbeingrut alone, but part of a great nation. This must be done\nby utiU.ring the immense resources of the radio industry, adapted\nto the longings, ex eriences, and limitations of that great\naudience. The educator should not be ashamed to use the techniques\nof radio which already are successfully exploited by the enter-\ntudio dedication ceremonies on October 18 included a special\ndrar.atic oresentaticm. B0n Tnaves of Sound,* directed by Dr. H. Clay\nHarshbai fSUI production director, an: Idress by Dr. Angell.\n\"LOCAL COOPERATIVE BROADCASTING.\" i.. j\nCopies of the booklet with the title, H\"tOCAL OOOPlRATlil BROAD¬\nCAST! 1 .> - A Summary and Appraisal,* by Leonard Power and )\npfub:. ished by the Federal Radio Education Comm It tree* With the\ncoopera tion of the U. S. Office of Education, are now obtainable\nthrough the FREC at 25 cents ‘each."
}