{
  "id": "d1608-12",
  "text": "orchestra and band broadcasts. An announcer’s\nbooth, a transmission room, and a control room\nwill be located on the second floor of the Audi¬\ntorium. The wall construction of these rooms is\nof transite with rock wool, as required for acousti¬\ncal correction. Leading off studio A is an obser¬\nvation and reception room equipped with sev¬\neral lounge chairs. WCAT expects to be on the\nair with new equipment January 1, 1937.\nTwo very popular programs have been added\nthis year. These programs, consisting of talks on\nstamp-collecting and a ground course in aviation,\nhave definite educational value.\nBACKGROUND\nThe South Dakota School of Mines was estab¬\nlished by Territorial Legislature of Dakota, March\n7, 1885. The enabling act providing for the divi¬\nsion of Dakota Territory and admitting South Da¬\nkota and North Dakota to statehood in 1889, gave\nto the School of Mines 40,000 acres of South Da¬\nkota land. The lands furnish some funds for the\nwork of the institution, but the chief income, out¬\nside of the student fees, is provided through bien¬\nnial appropriation by the State Legislature.\nThe second building, the mining and metallur¬\ngical laboratory completed early in 1888, the front\nportion of the third building known as the admin¬\nistration building was erected in 1901, and to this\nin 1902 a rear wing was added. At the close of\nthe World War, two frame buildings, erected in\nconnection with the training of soldiers, were\nretained for temporary use. An engineering\nbuilding to house the departments of Civil Engi¬\nneering, Electrical Engineering, Physics and\nMathematics was completed during the school\nyear 1921-22. A new central heating plant was\ncompleted during 1921. A gymnasium-audi¬\ntorium building constructed during the early\npart of the year 1928 is the last addition to the\nCampus.\nThe School of Mines is under the direction of\nthe Regents of Education. The Regents, five in\nnumber, appointed by the Governor and con¬\nfirmed by the Senate, have a control of the vari¬\nous public institutions of learning maintained\nwholly or in part by the State as State Institutions.\n11"
}