{
  "id": "d1608-22",
  "text": "“Good Will99\nWKAR is now rendering a service creating good\nwill and cooperation between the College and the\npeople of Michigan.\nThe broadcasting facilities have steadily im¬\nproved, making possible service for larger areas.\nCooperation with departments of State Govern¬\nment and other agencies has resulted in a widen¬\ning field of influence.\nFollowing the national trend in educational\nbroadcasting, WKAR began to offer courses of\nstudy by radio in the fall of 1935. The total of\nstudents in radio courses for the fall and spring\nterms was 907. Fourteen courses are offered in\nall. In the Michigan State College of the Air\nthere was no attempt to give examinations or to\nrecord grades. The radio student was considered\nas an auditor to derive such benefits as he would\nwork for at home.\nNew Equipment\nLast year a complete Presto recording equip¬\nment was purchased for the radio station by the\nAgricultural Extension Division. This equipment\nhas already proved of great value in checking the\nwork of announcers and speakers. Recordings\nhave also been made of the band and other organ¬\nizations. It is hoped that this equipment will pro¬\nvide an opportunity to record talks by members\nof the Agricultural staff to be sent to other broad¬\ncasting stations for their use, thus enlarging the\nscope of this phase of extension work.\nTime Signals\nBy special permission of the Naval Observatory\nBroadcasting Station at Arlington, Virginia,\nWKAR is now presenting the Arlington time\nsignals as a regular feature each day. The signals,\nwhich are the most authentic available, are re¬\nceived at WKAR by means of short wave radio\nand are rebroadcast over the station transmitter.\nStaff\nRobert Coleman, Director of WKAR; Jack\nParker, Assistant Production Manager; Robert\nRitter, Announcer; Donald Hittle, Announcer;\nWilliam Gladden, Announcer; Russell Lyon, An¬\nnouncer; Harry Wisner, Sports Announcer;\nNorris Grover, Technician; Linn Towsley, Oper¬\nator; John Blakeslee, Operator; John Isatala,\nOperator.\nChief announcer, Jack D. Parker (right) interviewing a visitor\nat Home Coming Football game.\nMichigan State College of the Air\nThe splendid reception accorded the courses\npresented in the Michigan State College of the\nAir last season indicated that such broadcasts have\na distinct place on the programs of WKAR. Ac¬\ncordingly, six courses are being offered for the\nfall term for those listeners who wish to continue\ntheir interest in education.\n“Understanding the Child99\nOf special interest to mothers is the series\n“Understanding the Child,” which is presented on\nthe first Monday of each month at 3:00 p.m. This\nseries is arranged for listening groups in the Home\nEconomics Extension Division.\n—From WKAR Bulletin for October, 1936.\nRobert J. Coleman, director of WKAR"
}