{
  "id": "d1608-25",
  "text": "WOI\nSTATE COLLEGE\nOF\nA. & M. ARTS\nAMES, IOWA\nFrequency:\n640 kilocycles, shared with KFI, WHKC, and\nXFG in Mexico City.\nPower:\nDaytime: 5,000 watts Night: none\nFounded:\n1921 as 9Y1. Licensed in 1922 as WOI\nValue of Plant:\n$75,000\nPrograms per Year:\n6,650\nSTATION WOI is on the air from 8 to 12 hours\na day, a total of 2,949 hours during 1935.\n. . . Produces 133 programs per week. It de¬\nvotes 50 per cent of its time to education and the\nremainder to entertainment. The programs may\nbe classified as follows: Music, 30 per cent; speak¬\ning, 35 per cent; dramatics, 2 per cent; news and\nreports, 33 per cent. . . . Annual appropriation:\n$18,500. . . . Plans for extension include air\nconditioning of studio and erection of vertical\nantenna.\nNews\nWOI is now presenting a complete news service\nto its listeners throughout Iowa and neighboring\nStates. It has the service of the United Press News\nwire with a printer which furnishes the station\nnews service from 7:00 a.m. to 3:00 p.m. In ad¬\ndition to three periods of news summaries about\n10 or 15 minutes in length, the station flashes\n“news of the hour on the hour” in a brief period\nwhich corresponds to headlines in a newspaper.\nW01 finds this valuable service not only furnishes\nthe listeners with news but serves as an audience\nbuilder for the program that immediately follows\nthese brief news flashes.\nService\nAlmost immediately upon its inception, the sta¬\ntion inaugurated a schedule of service reports con¬\nsisting of weather forecasts and livestock market\nnews.\nThe importance of the station’s market news\nservice was recognized and augmented when, in\n1926, the United States Department of Agricul¬\nture installed a leased wire office to supply a com¬\nprehensive service of livestock market informa¬\ntion. This service, together with a program of\nmusic, dramatics, talks, athletics,\nand the like, has given the station\na distinctive program which is ap¬\npealing to an ever-increasing group\nof listeners.\nOutstanding Programs\nMusic Appreciation\nMarket Service\nThe Viking Accordion Band\nHomemaker’s Half-Hour\nMasterwork Series (Opera)\nBook Reading Program\nAthletic Events\nMatins Service (Religious)\nGrinnell Hour (Music)\nLibrary Service\nMiss Ruth Galvin, whose radio book reviews\nenjoy a wide popularity among listeners."
}