{
  "id": "d1608-31",
  "text": "wsri\nSTATE UNIVERSITY OF IOWA\nIOWA CITY, IOWA\nFrequency:\n880 kilocycles\nPower :\nDaytime: 1,000 watts Night: 500 watts\nFounded:\n1919\nValue of Plant:\n$94,000\nPrograms per Year:\n8,592\nAudience :\nListeners in the State of Iowa and in station\nservice area with special programs for child\nstudy clubs, high school students, and organ¬\nized listening groups. Mail response indicates\nan increase in audience\nSTATION WSUI is on the air twelve hours each\nday, with a total of 3,536 hours per year. It\nbroadcasts 138 programs per week and uses on an\naverage of 398 persons to participate in these\nprograms. . . . Staff consists of twenty-two mem¬\nbers. They include four full-time workers, ap¬\nproximately ten part-time workers and eight stu¬\ndent workers. . . . Broadcast time is divided as\nfollows: Education, 62.5 per cent; the remainder\nto entertainment. The types of programs and\npercentages of time devoted to each are: Music,\n37.1 per cent; speaking, 59.4 per cent; and dra¬\nmatics, 3.5 per cent. . . . Annual appropriation:\n$10,000. . . . WSUI power was increased as fol¬\nlows: 1922—100 watts, 1923—500 watts, 1935—\n1,000 Watts. . . . Plan for extension of service\nduring the coming year includes “increase of\npower, improved equipment and improved pro¬\ngram.”\nThe University of Iowa broadcast its first radio\nprogram during the year 1919 under the call\nletters 9YA. Call letters WSUI were assigned\nwhen broadcasting stations were licensed. Im¬\nprovements have been made in equipment until\nthe present transmitter follows the latest engi¬\nneering practice, incorporating direct crystal\ncontrol of frequency with high percentage modu¬\nlation and a power output of 500 watts. The new¬\nest type of condenser microphones is used in both\nstudio and remote control broadcasting.\nThe transmitting equipment and the Old Gold\nStudio occupy a suite of rooms on the third floor\nof the Engineering Building, one of the most im¬\nposing on the campus. The aerial towers which\nsupport the antenna two hundred feet above\nground are also located on the Engineering Build¬\ning. The Memorial Union Studio and station\noffices occupy a suite of rooms on the main floor\nof the Iowa Memorial Union, and from this studio\nthe majority of musical programs are broadcast.\nAll university buildings as well as local hotels and\ntheaters are equipped for broadcasting, also the\nIowa Stadium and the Field House, where all im¬\nportant athletic events are held.\nWSUI Staff\nDr. Bruce E. Mahan, Chairman Radio Board;\nCarl Menzer, Director-Announcer; Pearl Bennett\nBroxam, Program Director; Prof. H. Clay Harsh-\nbarger, Production Manager; Vergil Tacy, Staff\nAnnouncer; Ralph Deal, Assistant Announcer;\nElla Ethel Jewell, Studio Hostess; Berneice Lang-\ndon. Secretary; John Ebert, Chief Operator;\nRalph Schuessler, Assistant Operator; Robert\nMitchell, Assistant Operator.\nPortion of transmitting equip¬\nment of Station WSUI."
}