{
  "id": "d1608-36",
  "text": "Ten Outstanding Programs of KFDY Are\nWeekly Soil Conservation Broadcasts\n“Agricultural Question Box”\n4-H Club Weekly Broadcast\nHome Management Specialist\nHome Extension Agent Leader\n“Play Awhile”\nNutrition Specialist\n“In the Day’s News”\nWeekly Organ Broadcasts\n“Vocational Problems”\nThe Director of KFDY Writes—\nKFDY, the South Dakota State College radio\nstation, has kept pace with other radio stations in\nSouth Dakota in improving both programs and\nfacilities. It is ranked today as one of the three\nbest equipped stations in South Dakota from a\ntechnical standpoint. Its programs are a daily\nfeature in thousands of homes over the State.\nEven though the station is on the air only from\n12:30 to 2 p.m. each day, people of the State have\nacquired the habit of tuning to KFDY every day\nat 12:30 to get the latest markets, agricultural and\nhome information, and news of South Dakota\nState College.\nFrom its small beginning in a “hole-in-the-wall”\nstudio “sound-proofed” with green burlap drapes,\nand with its transmitter on a small balcony in one\ncorner of an engineering laboratory, KFDY, in\nthirteen years has grown to the point where its\nstill-new studios on the top floor of the new Lin¬\ncoln Memorial Library will probably soon have to\nbe abandoned for larger quarters. A more con¬\nvenient location with studios large enough to\nbroadcast bands, glee clubs and dramatics, with¬\nout having to pick them up by remote control\nfrom some auditorium is an objective KFDY is\nplanning. The transmitter is now housed in a\nlarge separate room in the engineering building\non the State College campus and is a source of\npride for the institution. KFDY picks up pro¬\ngrams from seven different “remote” points on\nthe State College campus.\nNew equipment planned for KFDY includes a\nrecording outfit to make electrical transcriptions\nof some of KFDY’s best programs for use by\nother stations in the State.\nD. B. Doner, South Dakota\nState College registrar, broad¬\ncasting his weekly “Vocational\nProblems” feature over KFDY.\nJ. G. Hutton, associate profes¬\nsor of astronomy at South Da¬\nkota State College, broadcasting\nhis weekly “Soil Science” pro¬\ngram.\nH. S. Hepner, instructor in jour¬\nnalism, is on the air with his\n“In the Day’s News” program.\n35"
}