{
  "id": "d1608-9",
  "text": "Frequency:\n1,220 kilocycles\nPower:\nDaytime: 500 watts\nWCAD\nValue of Plant:\n$30,000\nST. LAWRENCE UNIVERSITY\nCANTON, NEW YORK\nPrograms per Year:\n500\nAudience :\nOne hundred fifteen requests for booklet re¬\nceived as a result of a ten-minute broadcast.\nSTATION WCAD is on the air at an average of\ntwo hours each day. It broadcasts from nine to\nten programs each week and has an average of 500\nprograms a year. . . . Broadcast time is divided\nas follows: Education, 40 per cent; entertainment,\n50 per cent; service, 10 per cent. The types of\nprograms and percentages of time devoted to each\nare: Music, 50 per cent; speaking, 45 per cent;\ndramatics, 5 per cent. . . . Outstanding programs\nare: (1) Canadian American Conference, June\n17-22, 1935; (2) Annual Commencement Exer¬\ncises; (3) Charter Day Exercises; (4) Dedication\nof Chemistry Building by Madam Curie. . . . An¬\nnual appropriation: $5,000. . . . Plans for exten-\ntion: “Under a new plan adopted this fall we are\nencouraging students to take part as much as pos¬\nsible/’\nCooperating Agencies\nClarkson College of Technology\nState Normal School\nCrane Institute of Music\nNew York State School of Agriculture\nCounty Home Bureau\nVarious 4H Clubs\nFarm Bureau\nGirl Scouts of America\nAmerican Association of University Women\nTHE RADIO’S TECHNIQUE TAUGHT\n(From New York Times, December 22, 1935)\nAt St. Lawrence University students participate in\nevery phase of radio broadcasting. The University’s\nown radio station is used as a classroom to train stu¬\ndents and develop radio technique.\nRadio at St. Lawrence is not listed as a regular\ncourse of study. But it does provide an outlet for\nlatent talents, and students, aside from a natural inter¬\nest in radio as a pure feature of entertainment, are\nencouraged to try their hands—and voices—at the\nmicrophone under the direction of Harold Bergman,\nwho has been in charge of the station for several years.\n“Students, of course, are carefully selected for our\nuniversity radio work,” Mr. Bergman explains. “They\nmust have the knack of meeting people and be able\nto talk with them about topics of wide public interest.\nThey should be reasonably conversant with politics,\nscience, and foreign affairs.”\nThe matter of diction and speech, while essential\nin commercial radio, is not looked upon as a para¬\nmount requirement at St. Lawrence. “When we find\na student who possesses the other qualifications, we\nare satisfied that we can instill the feeling and ability\nfor correct speech,” says Mr. Bergman.\nOne of the original 250-watt transmitters of the sta¬\ntion is now being used in the physics laboratory for\nexperimental and educational purposes. It is one item\nin a great mass of technical equipment being used to\nfamiliarize St. Lawrence students with the multiple\nproblems and perplexities of a modern broadcasting\nstudio."
}