{
  "id": "d1739-3",
  "text": "-12-\nadyertisernfontrol1of1progra^dng„0fIn'!,thrco”id^ed01ud5tatt0nfath n*tWOrk '’Potion. and\nAmerica these are some of those weaknesses whirh «.h dgme\"t of the Speech Association of\nthe Federal Communications Commission* °Uld receive the most careful scrutiny of\n'• is s :„sr\"Ue*°r “• br“a”**1 “ «-».»™.\n2. Too much reliance upon ratings,,\n3. Too much advertiser control of program content.\n4. Too little balance between entertainment and effective public service programming.\n5. Too mart, advertisements reflect poor taste and questionable ethics,\n6‘ j^ri^s!1* *dUCation*1 and ^ural programming in prime listening or viewing\n7. Too little experimentation with new ideas, talent, and production technique,.\n8* ^°tiontstl:p:»gtlfi0ant 10081 Pr°grammi^ ^e communities in which\n10.\nToo little leadership displayed by the networks in\nfor their owned or affiliated stations. 8 pr°gram 5tandird3\nlicense issuancegandarenewalVpowergofrtheCFederal^C°V^^*iS P°9itlV* “ol: the\nthe proper trustees of the channel, and rrequencles^TThe ^ Commission- ^ electing\nthat they operate in the public interest the th sPectruin» and by making certain\nserve the public to which they be^^ ' Comission can insure that the air wavs\nprogra^J^^ ^ * «-\nmission can exert and influence upon their T7 that the Co,n-\nstations and, indirectly, through the stations affiH»+ * natwork owned and operated\nnetworks are for all indents and' pj^oaes free agfnts free In Sh°rt’ the\nown interests. * P agents, free to operate exclusively in their\ngradually*been°forced*to ^ the network, have\nlops his influence through a^^iddleLn! ?h. ^ adv*rtiaor, and he deve-\nadvertisers there is no check or relation ™ g®n°y- F°r the »g«ncies and\nmi, si on which deal, only with mattersof false soyoe- Mv* the Federal Trade Corn-\nprogram content. matters of false and fraudulent advertising, and not with\no» rirsr^i *na ™-“i «■\nrenewal of license, need revision and strTnvthl?! / S*leCtion of licensee, and\ninterstate networks needs to be incorporated into the^ addttlonal p0“*r to lioen.e\nurge consideration of the following recommendations om,Iunioati°ns Act. Specifically we"
}