{
  "id": "d426-166",
  "text": "International House\n500 Riverside Drive\nNew York 27, N.Y.\nJune 30, 1963\nMr* James A* Fellows\nNational Association of\nEducational Broadcasters\n1346 Connecticut Avenue, N.W.\nWashington 36, D.C.\nProgress Report: June 1963\nDear Jim;\nThis letter constitutes the monthly progress report\nwhich is, as I understand it, required under the provi¬\nsions of the agreement between the VOA and the NAEB*\n1# 39-scrint series. Drafts of the first 13 scripts\nhave been completed. However, the typist has not finished\ntyping them, so I am not able to include them with this\nreport. I expect to be able to mail them to you by Wednes¬\nday. These drafts are subject to very extensive revision,\nand we do not consider them in their present state to be\nsuitable for review by consultants. There must be more\nprovision for regular review in the materials than we have\nso far included; all the scripts must be smoothed out, and\nsome of the less important patterns must be deleted so as\nto permit adequate coverage of the more important patterns.\nFurther, the scripts must be adjusted to the proper length.\nA tentative list of the problems currently scheduled for\neach lesson is included as an appendix to this report.\n2. 65-script series. Because of the earlier deadline\non the 39-script series, relatively little work has been\ndone on the 65-script series. I have completed a detailed\nanalysis of the NOTE textbook, English for Today, volume 1,\nand I am now working on the analysis of volume 2. I have\nreceived a draft of volume 3, and I expect to complete my\nanalyses of both volume 2 and volume 3 in July* I will\nthen prepare a tentative syllabus for the first 65 lessons,\nas stipulated in the agreement.\n3. Poetry series. We have not yet been provided with\nany material for this series, so we have been unable to do\nany work on it.\n4. Other activities. I have thus far made two trips\nto Washington for discussions concerning this project. The\nfirst trip was on May 23, and the second June 11-13. On\nthe latter trip I was accompanied by Margery Morris. I\nhave also had several discussions with Dr. Croodell, the\nmost recent of which were here in New York on June 24 and"
}