{
  "id": "d426-192",
  "text": "in aucfc a -variety of way® a® to make adequate zoz®&rlmm Impossible,\nPossible age range® and occupation group® should have been specified\non the original questlonimire.\nQuestion 6: What broadcast duration, 10, 15, 20 sdn. and 30 rain, for\neaciT lesson, would be most desirable from the station*# point of\nview, and how often per week would stations probably be willing\nto broadcast the lessons? (Sbe agency feels that QaamaH ot the\nbroadcast is wry i^ortent—if possible, once or -twice a day,\nfive day® a week. Infrequent broadcasts are likely to be counter¬\nproductive. )\n3M# question doe® sot make clear the mealing of \"daily\". '3am$\nanswers may man, 5, 6, or 7 days per week. Further the statement\nof agency policy in relationship to a question hardly encourage®\nan objective, independent response. A checklist arrangement should\nhave been used.\nQuestion 7; Would the post prefer to write and produce its own radio\n' ’courses vising the projected syllabus? If so, does the post have\navailable, nor or in prospect, the required people and facilities?\nAt least four separate questions have been asked in this one, and\nanalysis of the response® is difficult#\nQuestion 6s Do you consider that predorainantly American cultural\nmtSikl in the lessons would, if carefully selected, become\nInteresting and iwsaningful to listeners?\nF asoimbly clear and answerable. Hbwewr, wh&t \"carefully selected\nmam is anybody’s guess.\nQuestion 9? Have any Badio^Fnglish lessons been broadcast in your area\nor are such lessons now being broadcast? that is your estimate as\nto the popularity end effectiveness of such local broadcast© and of\nshort wave broadcast® of English lessons?\n5&o mmy questions have again been included In one and the result\nis serious difficulty in completing a satisfactory analysis and\ninterpretation. Definitions needed for \"popularity5 and\n\"effectiveness\".\nQuestion IQs Would the introduction of a IBIA Radio course on local\nadr be welconEjd by British representatives in the area?\nReasonably clear and answerable. However, in this case, as in most\nother question® involving \"yes’1 and \"no\" response® or degrees of\ndifference in attitudes. It would, probably have, been useful to\ndevelop include on the original questionnaire a suitable scale\nwhich asi#rfc be cheeked."
}