{
  "id": "d426-210",
  "text": "- 3\nXXX* ABOUT THE POET\nBait Crane Bora 1899\nmed 1932\nBart Crane lived a brief, tragic life. After an unhappy childhood, he\nleft high school and wandered restlessly until he reached Hew York City, He\nseemed to find there an agreeable atmosphere in which to write. A collection\nof his poems--White Buil&Lngs--appeared in 1926. But it was not until 1930\nwith the publication of his poem \"Brooklyn 3gx± Bridge\" that his reputation\nas a brilliant poet was made.\nAcute depression, feelings of failure and other personal problems\nplagued Crane throughout his life, and ultimately affected his work. In 1932,\nhe traveled to Mexico, hoping that the change in environment would give him\nnew inspiration. It was during the return vopage that he drowned himself at\nthe age of thirty-three.\nCrane wrote in blank verse and his work seerafid to have the immediacy of\nactual experience. He suggested his themes rather than stated them outright,\nand his poems embody the kind of artistic shorthand that is characteristic of\nmuch modern painting and music. His skilled use of lmageiy--reminiBcerit of\nthe Symbolist school of poetry—and his selection of evocative words give his\nwork great emotional appeal.\nIV. VOCABUIAHY NOTES\nshucks, fragments, baked wed, bleached shells and sticks:\nThese are lifeless remnants of sea week and shellfish which once thrived\nin the sea. All the words refer to the children's playthings which—\nunrealized by the boys—are things which have once been living but are now\nlarked by death.\ncordage\nShis word has the denotations of ropes used on a ship. Thus it is\nspecific in meaning and is infrequently used in other contexts. The\nconnotation is strength, easy movement, slimness, suppleness—characteristics\nwhich the bodies of the children have also.\nfrisk\nOhis verb is frequently employed in describing the movements of young\nanimals. A lamb or colt (young horse) may frisk in a meadow. It suggests\nplayfulness and light-heartedness. Frisky (adj.) is commonly used."
}