{
  "id": "d426-232",
  "text": "2\nHer martied in IB95 and for many years made a living for his family by\nteaching school and farming, until finally hie determination to be a poet caused\nhim to go to England where he remained for three years in what he felt was a\nmore creative environment. His first work, \"A Boy’s Will\" (1913) was published\nthere when he was thirty-nine years old.\nHe returned to America and continued to write about the people who lived\nand worked on the farm. He took for his subject the relationship of man to his\nsurroundings (\"Two Look at Two\", \"Stopping By Woods on a Snowy Evening”, and\n\"Birches\"). The theme of loneliness is evident in \"The Runaway\", \"The Sound of\nTrees\" and \"Desert Places\"*\nFrost received the Bilitzer Prize in 1924, 1931, 1$37, and 19^3. In i960,\nthe late President John F. Kennedy asked the poet to compose and read a poem\nfor the presidential inauguration ceremony, which he did.\nRobert Frost was greatly cherished by his readers, and is regarded by many\nas America’s finest poet*\nIV. VOCABULARY NOTES\nfetch, shan’t?\nThese words are rather unusual in modem American English. They can still\nbe heard in certain geographical areas of the United States, chiefly in th«\nrural, northeastern areas of the country. This use of colloquial terms\nadds a special flavor of actual rural speech to this poem about the\npleasure of doing simple farm chores.\nclear?\nThis word is also used in an abstract sensei \"The situation will clear\nif we think rationally about the problem.\" Frequently, clear up is used\nas a two-word verb with the same meaning as clear* Up in this position\nmeans \"completely\" (\"% headache cleared up after I rested\"). Other\nexamples of this use of up ares He raked up the leaves# The calf drank\nup the milk. She cleaned up the room before she left#\nSUGGESTIONS FOR FIRTHER STUDY\n(1) SELECTIONS FROM THE BOET’s WORK\nIn the Clearing. New York? Holt, Rinehaafc and Winston, 1962*\nThe Poems of Robert Frost (Modern Library Edition), New York, 1946.\n(2) CRITICISM AND BIOGRAPHY\nRobert Frost, A Collection of Critical Essays. Englewood Cliffs,\ni&w r^ie£iyf 1962/\nRobert. Frosts_She Trial by, J&igteuise» Elizabeth s. Sergeant. New\nYorks Holt, Rinehart and Winston, i960."
}