{
  "id": "d426-47",
  "text": "Hastings House,\nlO, Norfolk Street Strand.\nLondon.W C 2\n3rd April, 1964.\nThe Society of Authors,\n84 Drayton Gardens,\nS.W.10.\nTelephone Temple Bar 2225\nTelegrams Longevity, E st ranrLLondon\nCables: Longevity, London. ,WC.2\nLs4l*\nA.P Watt A Son\nAPPWatt.\nMlHomiman\nDear oirs,\nThe enclosed letter from the National\nAssociation of Educational Broadcasters, Washington D.C.\nexplains itself. While their request is basically for\nbroadcasting there is also the question of reprin ing\n\"FOR ANNE GREGORY\" and/or \"POLITICS\" in oamphlets to\naccompany the broadcasts. So far as Mrs. Teats and\nMessrs. Macmillan are concerned, there would be no\nobjection to this, and in the circumstances neither of\nthem would object to publication in English throughout\nthe world outside the U.^.A. free of charge. However,\nI don't think that they can publish translations - they\nmay not want to - as it would involve too many foreign\npublishers rights.\nAny pamphlet or booklet would have to bear\nan acknowledgment to Mrs. Tests and Messrs. Macmillan and\nthat the poems are taken from \"COLLECTED POEMS OF W.B. YEATS\".\nTh*b poem* must be printed exactly as they appear in this book.\nWould you be kind enough either to tell them\nthe foregoing, or to send my letter to them when you send your\ndecision about broadcasting?\nThis permission is valid of course only for\nuse in association with the broadcasts of The Voice of America\nand covers pamphlets or booklets distributed free bf radio\nlisteners, or at cost. For anything else they must get in\ntouch with us again.\nenc •\nYours faithfully,\nPermissions & lights\nIMPORTANT AmUi m kindly requested to note that Meson. A P Watt & Son accept mss for nefMMOon omky ou the\niiniiirosontiitu dtat tWy (hell not be held reeponeible for their accidental loaa from ftre or any other enuoe whtk ia their efftots m\ntransit or on oihr to Pubitahera or Editors to whom they may have been submitted in the ordinary course of bauacsi."
}