{
  "id": "d426-70",
  "text": "rnrch 26, 1964\nCharles Scribner's Sons\n597 Fifth Avenue\nSew York *7, Sew tank\nAttn: Permissions Department\nDear Sir*\nWe are requesting authorization from Charles Scribner's Sons to use a\npom by E. A* Robinson, \"Richard Cory\", for which we understand you hold\nthe copyright.\nPermission to use these materials is being sought by the H.A.E.B. in\nconnection with an arrangement we have with the Voice of America to develop\nan English through Poetry series. The 13 ccaumentaries for those programs\nare being written by Professor M. L. Rosenthal of New York University. She\nVoice of America, in turn, working closely with Professor Rosenthal, will\nproduce 13 quarter-hour radio scripts on the basis of these commentaries.\nThe radio programs themselves are intended for broadcast to listeners\noverseas, and are being designed to appeal to the listeners interest in\npoetry in the English language*\nIn each script the poem win be xadd in its entirety, and the listeners\nwill also be invited to read the lines aloud in appropriate units after\nthe radio speaker.\nPermission is sought both for the broadcast by the Voice at America to over¬\nseas countries and for broadcast in countries where local radio stations\nmay receive the taped programs through the United States Information Agency.\nPermission is also sought for publication of the poems that might be\npublished in any given country (with the aid or supervision of U.S.I.A.),\nand distributed free or at cost to radio listeners. Permission is also\nsought for eventual publication of the materials in a similar study booklet\nto be produced by U.S.I.A. for gratis distribution to overseas listeners\nwho request such booklets.\nWe hope we will hear from you shortly and that authorization to use this\npoem in the manner which we have outlined will be forthcoming. If you would\nlike to have additional information about the use to which these poems will\nbe put, may I suggest that you contact Bp. Robert Goodell, Chief, Radio\nBnglish~!Teaching Branch, Voice of America, Washington, D.C., Phone WO 3-6378.\nSincerely,\nJAP:sc\nJames A. Fellows\nAssistant Director"
}