{
  "id": "d426-97",
  "text": "NEW PUBLICATIONS\n6\nKnit to Fit\nA Comprehensive Guide to Hand and Machine Knitting\nBY IDA RILEY DUNCAN\nForemost Authority and Consultant on Construction and Style in Knitting,\nAss’t Prof., Home Economics, Wayne State University.\nIncludes the complete 49-lesson course of Mrs. Duncan’s Progressive School of\nKnitting Design, covering every phase of scientific knitting—hand and machine\n—clearly outlined, diagrammed and illustrated, a truly scientific, exclusive for¬\nmula-method for perfect fit for any type of knitwear.\n“Mrs. Duncan’s book offers a good basic course in designing knits for\neither hand-knitting or machine work. This is a good basic work for\nneedlework collections.”\nLIBRARY JOURNAL,—Nadine Harkins, Southern Oregon College.\n“A discussion of color suitability and changing colors will help those\nwho lack an awareness of color as a factor in the becomingness of cloth¬\ning .. . Instructions for knitting with ribbon are also given. —Rosa\nJean Tannahill, Head of the Dept, of Home Economics, Lamar State\nCollege of Technology.\n$3.95\n$4.95\n$4.95\nAlso Available:\nThe American Woman’s Complete Sewing Book (11lusl-<0\nThe Complete Book of Needlecraft } USVU\nThe Complete Book of Progressive Knitting (lllust dj\nThomas Jefferson Apostle of Liberty\nBY MARGUERITE E. WILBUR\nAuthor of: John Sutter, Journal of Madame Giovanni (Trans.), etc.\nDiscloses the more intimate, personal aspects of Jefferson’s life his joys and\nsorrows, ambitions, ideals, theories, his inner thoughts from whose dynamic roots\ngrew the greatness of America. Interwoven with the political pageant of his age\nare the leading men with whom he was closely associated—Patrick Henry, George\nWashington, Henry Adams, Alexander Hamilton, Lafayette, and many more.\n“There is a cumulative radiance in the book that makes this biography\nfar out of the ordinary. Thomas Jefferson was indeed Ae Apostle ot\nLiberty — now I am sure of it.” — Dr. Daniel A. Poling, Editor\nTHE CHRISTIAN HERALD.\n“Marguerite Wilbur’s THOMAS JEFFERSON is a swift-paced sympa¬\nthetic portrait, which should enjoy a wide readership -Richard B.\nMorris; Gouverneur Morris Prof, of History, Columbia University, N.Y.\n“Her first purpose is to make him a human being. The author credits\nJefferson with having laid the foundation for the free public sch°o1\nsvstem.”—St. Louis Post Dispatch"
}