{
  "id": "d1598-1",
  "text": "representative. Added to the group were: the secre¬\ntary-elect (Haskell Boyter); two members from the\npermanent finance committee (William Harley and\nEdward Rosenheim); one member from the com¬\nmittee set up by the ETRC affiliates to represent\nthem to the, Center (Janies Robertson); NAEB’s\nlegal counsel (Leonard Marks); and the Executive\nand Associate Directors of NAEB (Harry J. Skornia\nand Harold Hill.)\nOne of the principal items discussed at both\nmeetings was educational television. NAEB was a\nleader in the battle for the reservation of channels;\nwe helped set up the original Joint Committee (now\nCouncil) on Educational Television (JCET); and\nwe were involved in the early planning for the Edu¬\ncational Television and Radio Center (ETRC).\nThe subsequent growth of educational television\nstations, production units, and closed circuit installa¬\ntions, created new problems. Appropriately, some of\nthese are now being referred to us for solution. For\nexample, at our Allerton House Television Manage¬\nment Seminar in August 1957, the NAEB Television\nOperations and Development Committee recommend¬\ned that we encourage the activation of new education¬\nal television stations. Later the Educational Televi¬\nsion Project of the Southern Regional Education\nBoard made a similar request. Proposals to ac¬\ncomplish this were among the major items of business\nheld over from the St. Louis to the Chicago meeting.\nOne of the principal actions at Chicago, there¬\nfore, was the unanimous adoption of a resolution on\neducational station activation drawn up by a special\nad hoc committee (William Harley, chairman; Rich¬\nard Hull, Leonard Marks, Jack McBride, James Ro¬\nbertson and Robert Schenkkan). Its preamble de¬\nclared that the reserved television channels might be\nlost if not activated soon; that the utilization of\nmore channels was necessary if the majority of the\nnation’s population was to be served by educational\ntelevision; that an increase in the number of stations\nwould improve the resources for program exchange;\nthat “no present efforts toward this end seem to\noffer an immediate practical solution, or, indeed a\nlong-term one;” and, that there now are a number of\ncommunities “ripe” for station activation.\nAccordingly, the Board voted to set up a national\nchairman and eight regional coordinators, who would\nconstitute the new NAEB Television Development\nCommittee. Using funds already in hand, they would\nprovide consultants immediately to those areas re¬\nquesting them. These experts would be recruited lo¬\ncally to expedite action, and to guarantee familiarity\nwith local conditions. It not only resolved that work\nshould begin at once with present resources, but also\nthat NAEB's officers and Foundation Committee\nshould seek additional funds with which to carry out\nthis work on an expanded scale in 1958.\nThe Board and its advisors recognized, of course,\nthat other organizations besides NAEB are interested\nin station activation. Therefore, it was decided that\nthese plans should be discussed with representatives\nof the ETRC and the JCET at once, as well as with\ngroups in due course. Accordingly, on December 12,\na committee composed of Vice-President-elect Mc¬\nBride, Past President Schooley, and President Paulu\nwent to Ann Arbor to meet with Dr. Harry Newburn,\nPresident of the ETRC. On December 20, President\nPaulu met with JCET Chairman Albert Jorgensen\nand Executive Director Ralph Steetle in Washington.\nAlthough it is early to forecast the eventual out¬\ncome of this project, it seems certain that in one way\nor another NAEB’s leadership will stimulate and\nhasten local-level station work. In any event, the\nofficers and Foundation Committee will press on with\nthe mandate of the Board of Directors as rapidly as\npossible.\nSince no NAEB Newsletter should consist ex¬\nclusively of a message from the president, I shall\nsummarize more briefly the other actions taken at\nthese meetings. Ten major areas of need in education¬\nal radio and television broadcasting were defined:\nprograms; professional advancement of broadcasting\npersonnel; services to educational stations and broad¬\ncasters; teacher training and utilization activities;\ntechnical services; research activities; publicity and\npublic relations; station activation; long-range policy\nguidance; and financial support.\nIn both St. Louis and Chicago, particular atten¬\ntion was given to the ever-present problem of liaison\nbetween educational broadcasters on the one hand,\nand teachers and educational administrators on the\nother. Special consideration also was given to edu¬\ncational broadcasting and the FCC; to public rela¬\ntions problems; and to the ever-important question of\nlong-term financial support for educational broad¬\ncasting.\nThe various interests involved in educational\nbroadcasting, and the organizations set up to serve\nthem, were identified. Those whose orientation is\nbroadcasting were recognized as including such groups\nas the NAEB, the ETRC, and the JCET. Groups\nless directly involved in broadcasting, although still\nvitally concerned with its results, were seen to be\nas varied as associations of teachers and organizations\nof educational institutions. All these groups, it was\nrealized, have worked towards somewhat the same\n2\nNEWSLETTER"
}