{
  "id": "d469-1",
  "text": "Authorizations and Appropriations\nFunds authorized by P.L. 90-129 are as follows:\nFY 1968 — $10,500,000\nFY 1969 — 12,500,000\nFY 1970 — 15,000,000\nNo funds were appropriated for Fiscal Year 1968. The Fiscal 1969\nappropriation is $4,375,000, of which $4,000,000 is available for\nbroadcasting facilities grants.\nState Maximum Limitation\nSection 392(b) of P.L. 90-129 provides that the total grants made\nfrom the appropriation for any fiscal year in any State may not exceed\n8 1/2 percentum of such appropriation.\nThus, the maximum amount which may be awarded in any one State under\nthe Fiscal Year 1969 appropriation is $340,000 (8 1/2 percent of $4 million).\nThis is not an allotment nor an \"entitlement\" but rather a limitation.\nThe amount of the limitation for a given fiscal year will vary depending\nupon the amount appropriated by Congress for this program.\ner\nlion).\nH\nIssuance of Regulations and Application Forms\nIt is anticipated that approval, printing and publication of Regulations\nand Application Forms for the Educational Broadcasting Facilities Program\nwill require 60 to 90 days from the date of this bulletin.\nWhen available, copies of Regulations, Application Forms, the Instructional\nManual and other relevant materials may be secured by written request to\nThe Director, Educational Broadcasting Facilities Program, at the above-\nindicated address.\nAddressees of this Program Bulletin will receive these materials without\nfurther request.\nPending ETV Applications\nThere remain pending more than 70 ETV station applications, timely filed\nunder P.L. 87-447, requesting more than $33,000,000 in Federal funds.\nThe grant amounts requested among pending applications range from $35,326\nto $1,264,900, The average is approximately $600,000. Furthermore, many States\nare represented by two or more applications exceeding funds available\nunder the 1969 State maximum limitation.\nIt is evident, therefore, that many pending applications cannot be ^\nconsidered for funding in FY 1969 under the dual limitations,"
}