{
  "id": "d469-12",
  "text": "3\nb. Financial capability to operate station to provide\nprogram services;\nc. Staffing patterns adequate to the proposed operation.\n3. Recommendations of state educational radio/television'\nagencies should be a strongly weighted factor in determining\napprovability of competing applications from within a state.\nEvery possible effort should be made to develop strong\nstate agencies which have responsibility for both radio and\nETV planning and development.\n(NOTE: As was pointed our during discussions, \"criteria11\nenumerated above are consistent with past operational\npolicy, and are embraced in Section 60.17 of the\nRegulations as proposed. We interpret the emphasis\ngiven these points as panel suggestion to give added\nweight to these particular factors in 1969.)\nIII. Educational Radio Projects\nA. High priority should be given to radio facilities projects\nwhich have good promise of being \"exemplary\" in demonstrating\neffectiveness and impact of educational radio as an instrument\nof education and \"public\" broadcasting. Under this general\nobjective:\n1. Activation of new educational radio stations, proposing a\nbroadscale, comprehensive program service to substantial\naudiences presently without such services should have\npriority emphasis, particularly in geographic areas of no\nservice or limited service - but not to the exclusion of\n\"expansion\" projects. Second (or \"third\") stations should\nhave relatively low priority.\n2. Among \"expansion\" projects, priority consideration should\nbe given to equipment proposals which hold promise of\ndemonstrating exemplary and innovative uses of radio\nprogramming services. Examples would include:\na. Proposals to serve important minority or professional\naudiences through sub-carrier services (multiplexing);\nb. Proposals to integrate radio broadcast services with\nexisting ETV services;\nc. Proposals to expand small (10-watt) stations to maximum\npower and maximum community service programming.\nB. Fiscal policy for Radio in 1969"
}