{
  "id": "d469-13",
  "text": "4\n1. A ’’reservation\" of not more than 10% of appropriated funds\n($400,000) should be made, in order to encourage submission\nof applications and assure some grant actions for radio in\n1969.\na. This amount would not be \"guaranteed\" for radio\nprojects. If, on review of all applications to be\nconsidered for 1969 funding, the total of funds\nrequested in \"approvable\" exemplary radio projects were\nless than $400,000, the difference would become\navailable for additional ETV grant action.\n2. The state limitation of $340,000 applicable to FY 1969\nwill cover both radio and ETV projects (i.e. no attempt\nwould be made to set a state maximum limitation especially\napplicable to radio).\nIV. PROCEDURAL RECOMMENDATIONS\nA. \"Cut-off\" (or \"deadline\") dates should be established for\nsubmission of applications, to permit consideration of batches\nof applications by a review panel of consultants.\n1. Cut-off date for pending ETV application revisions (or\nrequests for deferral) should be 30 days from publication\nof materials necessary to applicant.\n2. Cut-off date for new applicants (both radio and ETV) should\nbe 60 days from publication of such materials.\n(NOTE: In our discussions we used the \"date of publication\nof Regulations\" as the beginning of a 30-day or\n60-day period. In fact, to be fair, such periods\nwould have to begin from the dates on which Application\nForms and Instructional Manuals became available to\napplicants. We expect that availability of such\nmaterials will actually occur shortly after the\nRegulations are published in the Federal Register.\n3. Cut-off dates would apply to processing of applications\nunder consideration for current fiscal year funding, and\nwould not foreclose filing or acceptance of applications\nsubmitted subsequent to a cut-off date. Such applications,\nhowever, would be \"deferred\" for grant consideration until\nthe following cut-off date.\nB. Grant awards, to a few projects with unusually clear high priority,\nmight be made subsequent to cut-off dates but prior to review\nof \"approvable\" applications by consultants."
}