{
  "id": "d469-2",
  "text": "All applicants with ETV applications pending will be given an opportunity\nto reconsider requests for Federal funds in the light of the fiscal limita¬\ntions for FY 1969. Such applicants may take one of the following courses of\naction:\n1) State that they wish their applications to remain as submitted,\nto be considered for funding in Fiscal Year 1969. (This option\nis available only to applicants whose requests for Federal funds\ndo not exceed the State maximum limitation.)\n2) Amend projects proposed in their applications so that revised\ntotal costs and Federal shares requested will become feasible\nwithin the financial limitations of the appropriation and State\nmaximum.\n3) Request deferral of consideration of their applications until\nthe subsequent fiscal year, without loss of status as an applica¬\ntion on file. In such case, any amendments to such applications\nwhich may be necessary may be deferred until the subsequent year.\nIn many cases such reconsideration of pending applications will require\nconsultation with official State educational radio or television agencies to\ndetermine the status of given applications within the framework of State\nplanning and priorities.\nThe date by which responses will be due from applicants with pending\napplications will be announced concurrently with the publication of regula¬\ntions in the Federal Register.\nRadio Applications\nApplications for Federal matching funds to assist educational radio\nstation projects cannot be received until regulations have been published\nin the Federal Register. In the meantime, potential applicants who have\nnot already done so should ensure their inclusion on a mailing list by\nwritten request as indicated above. Necessary application forms and instruc¬\ntional materials will be mailed as soon as they are available.\nA portion of the appropriated funds will be temporarily reserved to\nprovide for funding of eligible radio station projects. Any \"deadlines\"\nor due dates which may be established for filing of radio station applications\nwill be announced in the Federal Register at the time the regulations are\npublished and will allow ample time for the preparation of applications.\nGrant Awards\nBecause of the circumstances described in the foregoing paragraphs,\ndeterminations cannot be made immediately as to which projects will have\nhighest priority for support with the limited funds available for FY 1969.\nNo grant awards will be made until:\n1) Regulations and required forms have been published and distributed.\n2) Applicants with ETV applications pending have advised USOE of the\nresults of their review of such applications under the limitations\nof the State maximum of $340,000 which will be in effect for FY 1969."
}