{
  "id": "d469-7",
  "text": "(4)\n(b) The Secretary and the Comptroller General of the United States, or\nany of their duly authorized representatives, shall have access for the\npurpose of audit and examination to any books, documents, papers, and\nrecords of the recipient that are pertinent to assistance received under\nthis subpart.\nRULES AND REGULATIONS\nSEC. 394. The Secretary is authorized to make such rules and regulations\nas may be necessary to carry out this subpart, including regulations\nrelating to the order of priority in approving applications for projects\nunder section 392 or to determining the amounts of grants for such projects.\nPROVISION OF ASSISTANCE BY FEDERAL COMMUNICATIONS COMMISSION\nSEC. 395. The Federal Communications Commission is authorized to provide\nsuch assistance in carrying out the provisions of this subpart as may be\nrequested by the Secretary. The Secretary shall provide for consultation\nand close cooperation with the Federal Communications Commission in the\nadministration of his functions under this subpart which are of interest to\nor affect the functions of the Commission.\n(SECTION 396, WHICH ESTABLISHES AND\nAUTHORIZES FUNDING FOR THE CORPORATION\nFOR PUBLIC BROADCASTING, IS OMITTED\nFOR THE PURPOSES OF THIS WORKSHEET)\nSUBPART C - GENERAL\nDEFINITIONS\nSEC. 397. For the purposes of this part -\n(1) The term \"State\" includes the District of Columbia, the Commonwealth\nof Puerto Rico, the Virgin Islands, Guam, American Samoa, and the Trust\nTerritory of the Pacific Islands.\n(2) The term \"construction\", as applied to educational television\nbroadcasting facilities or educational radio broadcasting facilities, means\nthe acquisition and installation of transmission apparatus (including\ntowers, microwave equipment, boosters, translators, repeaters, mobile\nequipment, and video-recording equipment) necessary for television\nbroadcasting, or radio broadcasting, as the case may be, including apparatus\nwhich may incidentally be used for transmitting closed circuit television\nprograms, but does not include the construction or repair of structures to\nhouse such apparatus. In the case of apparatus the acquisition and instal¬\nlation of which is so included, such term also includes planning therefor."
}