{
  "id": "d469-85",
  "text": "3\nTelevision Priorities\n1. Highest priority will continue to be accorded projects proposing\nto activate new noncommercial educational television broadcast\nstations. To the extent consistent with qualified applications\nreceived, priority will be accorded States which have no ETV service\nor which have an ETV service available to less than 25% of the\npopulation of the State. Proposals to activate second or third\nchannels in areas already served by an ETV station will have\nrelatively low priority.\n2. Second priority will be accorded proposals to expand facilities\nof existing ETV stations in ways which will better serve the\npopulation of proposed service areas through increase in station\ncoverage, increase in hours of operation and/or improvement in\nprogram services.\nExamples of proposals in this category include transmitter and\nantenna improvements, necessary additions to film or videotape\nreproduction capabilities, and improvement of live local program\nproduction capability - in approximately that order.\nNo distinction is made between monochrome or color capability in\ntransmission apparatus for purposes of determining project\npriorities. It is recognized that in many locations, the\nachievement of color capability by ETV stations is highly desirable.\nHowever, in consideration of comparative costs and limitations on\nFederal funds currently available, applicants are urged to give\nfull consideration to phasing of project components.\nRadio Priorities\n1. To the extent consistent with qualified applications submitted,\nhighest priority will be accorded to proposals to establish new\nnoncommercial educational radio stations which will provide\ncomprehensive program services to substantial audiences which are\nnot now served by such radio stations. Activation of radio stations\nin areas which are already served by one or more educational radio\nstations will have relatively low priority.\n2. Second priority will be accorded to applications which propose to\nexpand the transmission facilities of existing noncommercial\neducational radio stations which are presently providing a\nbroadscale comprehensive program service, or which hold promise of\ndemonstrating exemplary and innovative uses of radio programming\nservices.\nExamples of projects in this category would Include proposals to\nexpand low-power stations to maximum power and maximum community\nservice programming, proposals to serve important minority,\nprofessional or other special audiences through development of\nsub-carrier services (multiplexing), or proposals to integrate\nradio broadcast services with ETV services in ways in which the two\nmedia will serve to augment and supplement each other."
}