{
  "id": "d469-9",
  "text": "DEPARTMENT OF HEALTH, EDUCATION. AND WELFARE\nOFFICE OF EDUCATION\nWASHINGTON. D.C. 20202\nDecember 24, 1963\nTO\nConsultants to the Educational\nBroadcasting Facilities Program\nFROM : Ray J. StatfLfey, Director, Educational\nBroadcasting Facilities Program\nSUBJECT: Attached summary of consultant's meeting, December 12-13, 1968\nI hope you will have the opportunity to review the attached summary of\nthe positions outlined during our recent meeting on implementational\npolicies for Title I of the Public Broadcasting Act (P.L. 90-129).\nWe have not attempted to report the meeting in terms of \"minutes\" - nor\nin any sense to make a verbatim report of the discussions. We have\ndeliberately not attributed statements or quotations to any consultants.\nRather, this is intended to be a summary of propositions, ideas or policy\npositions on which there seemed, to the staff, to be concensus and there¬\nfore might be considered to be \"recommendations\" of the consultants.\nThey are sent to you, so that you may:\na) Concur, if you wish - or demur on certain points.\nb) Add comments you feel may be significant.\nc) Call our attention to any omissions you feel should be\ncorrected.\nI'm sure you will note that several topics which engendered some lively\n(and profitable) discussion are not reported in the summary, among them\nsome excellent suggestions for substantive changes which might be made in\nfuture amendments to Title I, such as expansion of eligible projects to\ninclude uses of the spectrum beyond broadcast frequencies, and the need\nto provide a source of funding for planning for educational telecommunica¬\ntions needs. These are not included among \"recommendations\" because they\nwere not related to immediate implementation needs, or because they\nrequire further insight and discussion to arrive at conclusions. The\n.staff is grateful for such suggestions, however, and feel they laid the\ngroundwork for future consideration. They join me in saying \"thank you\"\nfor your participation, and look forward to our next opportunity to confer\nwith you."
}