{
  "id": "d1120-5",
  "text": "^ WQED, Pittsburgh, has a new series\ncalled Sport of the Week, in which sports\nmatches i‘n tennis, lacrosse, polo, and track\nwill be shown.\n^ During the spring, WRVR, Riverside\nChurch station in New York City, inaug¬\nurated a series on poetry and one on drama.\nTwo plays by a young “off-Off-Broadway”\nplaywright, Sam Shepard, comprised the\nfirst full-length production on Riverside\nRadio Theater, with which the station at¬\ntempted to demonstrate its intentions: to\nre-kindle an interest in radio as a basic\nmedium for drama, and to provide a forum\nfor some of the newest and most energetic\nforces in the American theater today.\nPoetry Discovered presented poets reading\ntheir own and other poets’ work, discuss¬\ning influences, problems, goals, and infor¬\nmally communicating their ideas.\n^ The University of Texas TV staff will\nproduce a series on principles of “good\nbuying” for low-income groups, under a\ngrant from the Sears Foundation.\n^ What Is a Teacher? is a three-part se¬\nries produced by Clyde Martin, professor\nof curriculum and instruction at the Uni¬\nversity of Texas, and broadcast on KLRN-\nTV. The film documents the actual prog¬\nress of 12 student teachers from the uni¬\nversity as they worked with children in an\nelementary school.\n^WPSX-TV, Pennsylvania State Univer¬\nsity, now presents a review of Pennsylvania\nnewspaper, radio and TV editorial com¬\nment. Reviewer John M. Harrison picks\nprincipal issues confronting state and pub¬\nlic officials and points out what is being\nsaid editorially about them.\n^ Montana State University’s film and TV\ncenter will produce this year a number of\nfilms under contract with state and com¬\nmercial organizations. These include a 16mm\ncolor production for Union Oil, “Lewis\nand Clark in Montana,” and a historical\ndocumentary on the growth of the state’s\nmining industry for Anaconda Copper Com¬\npany.\n^ WTTW, Chicago, recently presented a\n13-week series of conversational Italian,\nshowing how to order meals, shop, arrange\nfor accommodations and entertainment when\ntraveling in Italy. When in Rome was\ntaught by Vittore Bocchetta, former pro¬\nfessor of humanities in Verona, Italy, and\nwho has taught Italian at the University of\nChicago. Karen Prindle directed the series.\n^ WNYC-FM recently broadcast Sounds\nof the Past, a series devoted to the actual\nrecorded sounds of performers, personali¬\nties, and music of the past. Archie Roth¬\nman hosted the series.\n^ WTHI-TV, CBS affiliate in Terre\nHaute, Ind., sent a news team to Viet Nam\nthis spring to film and interview service¬\nmen whose homes are in the station’s view¬\ning area. Upon their return, Harry Frey,\nnews director, and Paul Denehie, produc¬\ntion director, put together five-minute pro¬\ngrams of interviews for broadcasting. Then\nthere was a special hour-long recap pro¬\ngram in color televised a month later.\nDENVER OFFERS\nCHILDREN'S PROGRAMS\nIn addition to Tomfoolery, described in\nthe February Newsletter, KRMA-TV, Den¬\nver, has been offering several other chil¬\ndren’s programs. On a children’s strip from\n4:30 to 5 o’clock, a different kind of pro¬\ngram is shown each day, with original\nadaptations of beloved fairy tales and\nclassics once a month.\nOn Gene's Junction, Gene and his friend\nScotty invite their audience to meet new\nand interesting people who have fascinating\njobs, and to learn how easy it is to make\n“fun things” from materials they can find\naround the house. There’s a sing-along time,\nand a poetry corner where Gene and Scot¬\nty go to read poems and stories, many of\nthem acted out by professional actors and\ndancers.\nThe Wizard of Earl and his apprentice,\nChris Mouse, a hand puppet, have a magic\ngold cape, and there’s magic powder and\nsneeze powder and yawn powder, and a gi¬\ngantic book that tells how to make extra\nspecial magic.\nOn The Magical House, Hostess Betsy\nMills uses a different kind of magic—a\nwishing magic that can take young people\nthrough the magic window and up the\ngolden stairs. Betsy tells children’s stories,\nmostly original, and accompanies herself\non the harp with music she has written.\nIn addition to these locally produced pro¬\ngrams, KRMA also uses The Wonderful\nWorld of Brother Buzz, a film produced\nby the American Humane Association which\ntells youngsters about all sorts of interest¬\ning creatures and how to care for them.\nNAEB Personnel Service\nPOSITIONS AVAILABLE\n(For information, write Miss Yasmine Mirza, Personnel Service, at\nthe NAEB in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the NAEB,\nwith credentials on file with the NAEB Personnel Service. Non-mem¬\nbers can save time by sending the $15 annual dues and $15 place¬\nment registration fee at the time of inquiry.)\nJuly I TV producer-director capable of producing wide range of instructional pro¬\ngrams for portions of courses for use in a computerized dial access audio¬\nvideo, on-campus information retrieval system. New university, Christian set¬\nting. Up to $10,000 depending on qualifications and experience.\nJuly 2 Expanding TV station in large southeastern university needs a program direc¬\ntor (master's necessary) and a producer/director (master's preferred). Both\npositions require previous TV experience. Salaries open. July I.\nJuly 3 Experienced producer-director strong in directing, lighting, with some film and\nwriting, for new broadcast/closed-circuit ETV operation at rapidly^ expanding\ncollege in Rocky Mountain area. B.A. or M.A. with several years academic\nand professional background required. Maturity, imagination, ability to work\nwith others essential. $7,000-$7,500 with excellent benefits, climate, advance¬\nment potential. July I.\nJuly 4 Maintenance engineer with inventive knack for new broadcast/closed-circuit\nETV operation at Rocky Mountain area college. First phone, five years ex¬\nperience required. Some college desired. Ideal climate, recreational oppor¬\ntunities; excellent fringe benfits. $7,200. July I.\nJuly 5 University opening for coordinator in one of largest CCTV installations in Mid¬\nwest. Experience with instructional television theories, techniques and pro¬\ncedures necessary. College or university graduate minimum requirement; M.A.\nor Ph.D. desirable. Salary $10,500. More information upon request.\nJuly 6 Instructor for southern state university. To teach course in radio production,\nradio-TV announcing, basic speech. M.A. in radio-TV or speech desirable. Two\nor three years experience in educational or commercial station, preferably\nuniversity. Salary for 9 months $7,000, plus additional $800 for one six-week\nsummer session.\nJuly 7 Chief television technician to plan future developments with coordinator of\nETV and the architects and engineers department, to supervise technicians in\noperation and maintenance of all television facilities and a language labora¬\ntory, and, at first, to assist in operation of the studio unit. College degree,\nclosed circuit instructional television experience, experience with quadrature\nhead video tape recorders and with color television, and supervisory experi¬\nence, preferred. First Class Radio-Telephone license required. Salary $9,000 up,\ndepending on qualifications.\nJuly 8 Producer-director to work directly with faculty members to develop effective\nuse of television in instruction, presently used in surgery, radiology, anatomy,\nand physiology. Some work in closed-circuit studios. College graduation re¬\nquired. M.A. degree, experience in closed-circuit instructional television pre¬\nferred. Salary depends on qualifications.\nJuly 9 Television technician to work under supervision. Two years technical college\nplus closed-circuit instructional television experience preferred. Much of work\nwill be with a remote truck. Salary $6432.\nJuly 10 Radio-TV production man to take charge of news and programing for grow¬\ning New England university department. Should have announcing ability; pro¬\nfessional experience required. Bright future. $8,000 rartge for right person.\nImmediate opening.\n6\nNEWSLETTER"
}