{
  "id": "d825-19",
  "text": "Progress Report - Contract ^OE-3~ 16-007\npage two\nTo further promote the library service and its forthcoming materials the Project Director\nand Assistant Project Director attended the NAEB Conference held in Urbana, Illinois\non May 13 -15, 1963. At this conference presentations were made and several hundred\nTeaching Materials Library brochures were distributed. Also at this meeting several\npeople were contacted about the possibility of carrying out the production of the kits.\nIt was the intent to establish what facilities might be available to undertake the pro¬\nduction of these kits.\nOn May 17 and 18, 1963 the Advisory Committee, Project Director and Assistant Pro¬\nject Director met with the writer in Chicago, Illinois to review the script treatments\nshe had completed. In the absence of Miss Arlene McKeflar, Mr. Lee Campion of\nAlbany, New York was asked to join the committee for this meeting. In reviewing\nthe treatment for Kit No. 1 the committee felt that although the length of the pro¬\ngram exceeded the specified canounf of time it did contain the necessary content and\nthe foimat was excellent. To achieve the proper length of the film to be contained\nin the kit the committee discussed with the writer the parts in the script treatment\nwhich they felt could be delingategband would not be detrimental to the final product.\nFollowing the evaluation of the first treatment the committee began the review of the\nscript treatment for Kit No. 2. It was felt that after seme modifications in this treat¬\nment to facilitate continuity, and the addition of some content ideas the treatment\nwould be acceptable. The writer agreed and would do some rewriting to incoiporate\nthe committee's ideas and suggestions and resubmit the script treatment for final\napproval.\nHaving established a definite format in the first two kits the committee than worked\nwith the writer on the definite content to be contained in the remaining four kits.\nSince these four kits would contain several types of examples suggestions were made\nas to thelocafion of filmstrip, clips, etc. which would best present the examples.\nThe four remaining script treatments will be completed by July 28, 1963 and mailed\nto Hie committee for review. The committee will meet in August 1963 to further\nreview the script treatments and make final approval.\nDuring the past two months the Teaching Materials Library brochure has been mailed\nto educational television, audiovisual and curriculum personnel throughout the country.\nPresentations were made by the Project Director at the IERT in Columbus, Ohio.\nThe revised script treatment for Kit No. 1 has been submitted to several agencies and\nthey have been asked to submit formal bids for the production of the kit. The script\ntreatment for Kit No. 2 is now in the hands of the Advisory Committee for review\nand following their approval will be sent to production agencies for bids. Copies of\nthe revised treatments for Kits No. 1 and 2 are attached."
}