{
  "id": "d825-26",
  "text": "APPENDIX A\nPLAN OF OPERATION DATED MAY 15, 1962, FOR A PILOT SERIES\nOF SIX KITS OF FILMED AND PUBLISHED MATERIALS ILLUSTRATING\nPROPER TEACHER UTILIZATION OF BROADCAST MATERIALS\nSection 731 of Port B of Title VII of Public Low 85-864 direct! the Office of\nEducation 'to disseminate Information concerning new educational media to\nState or local educational agencies for use in their public elementary or sec¬\nondary schools, and to Institutions of higher education. The Commissioner\nof Education recognizes this responsibility and wishes to provide advice,\ncounsel, technical assistance, and demonstrations to State or local educa¬\ntional agencies and institutions of higher education undertaking to utilize\nsuch modi a of communication to increase the quality or depth or broaden the\nscope of their ecbcational programs, as authorized in Section 731 (3) of\nPublic Law 85-864.\nTo this end, the Office of Education wishet to hove prepared six each of six\ndemonstration kits for use by school and college administrators, teachers and\npotential teachers, and designed to Illustrate, on film and In published ma¬\nterials, teacher utilization of broadcast materials in the achievement of sound\neducational purposes and goals. Pursuant to Section 731 (5) of Public Law\n&5-864, the Office of Education believes that such kit preparation should be\nconducted under the auspcies of a professional organization and proposes that\na contract be awarded to an appropriate organization to prepare such kits.\nI he National Association of Educational Broadcasters has evidenced its inter¬\nest and qualifications for performing this service, and has submitted a plan of\noperation dated May 15, 1962. This plan is essentially as follows*\nObjectives\nIhe Office of Education, in the absence of existing materials to meet this\nurgent need, wishes to prepare a series of six demonstration kits to assist\nteacher groups to make better classroom use of educational broadcasts. These\nkits wlli then be made available over a period of time and the use and bene¬\nfit derived from this service will be evaluated.\nProcedures\nThe project will be carried out In three steps, as follows:\nStsmh This step will Include the planning and production of the materials\nto be Included In these kits. Writers will be employed to draft a preliminary"
}