{
  "id": "d825-28",
  "text": "17\nFollowing review and approval of •crip*, out 11 not, and proposed subcontracts\nby the Office of Education, the National Association of Educational Broad-\ncotters will procead with production of tha kits.\nPoseriptlon of Kits\nIn general, each kit will consist of a 30-minute, 16mm sound film, and the\nnecessary supplementary materials and directions to facilitate Its use. Some\nkits will contain printed materials which may be retained by the i*ers. The\nsix kits will be organized so as to be suitable for use sequentially or separately\naccording to content. Following Is o brief description of each:\nKit No. 1 - Educational Broadcarflng. This kit will trace the history of\neducational broadcasting from the eerly days of radio to the present day uses\nJf 0f television. It will show the action of Government to protect the Interests\nof education through the reservation of FM radio channels end television\nchannels for noncommercial educational use, and their current status.\nIntended primarily for orientation of teacher trainees, or as refresher materials\nfor administrators, curriculum specialists, and classroom teachers, it will\nillustrate ways in which radio and television can be used to achieve certain\neducational purposes.\nKit No. 2 - Good Teaching and Communication. This kit will be bceed on\nthe principle that # teaching can be fltdftly Improved by the use of educa-\ntional broadcasts and other media because, when used effectively, they can\npromote effective types of learning experiences In adults at well as In chil¬\ndren in college as well In grade ex high school. Through Illustrations, it will\nshow how many teaching problems can be solved, partly or wholly, by the\nproper utilization of well-planned programs.\n. . ft* Kit Ho. 3 - Preparing the EducotlanolI ftogam. What are the ementlal ele-\ntf/^ments of a useful educational programY Hwi they differ in planning and\ny* \" presentation? Television, like roeflo, Is broadcast under rigid limitations of\ntime. The purpose of this kit is to develop, for the classroom teacher or for\nV1 the beginning camera teacher, an understanding of program planning and pto-\nAction to achieve variety and appeal to the many groups who use it.\ncH\ny/M\ntilt Mo. 4 - Selecting and Utlllring the Program. This kit will deal with the\nmechanic* of utilization, preparation of a class prior to the broadcrat, the\npresentation, and post-broadcast follow-up. It will also Include Inhumation\non the physical environment, set placement, lighting control, antenna adjust-\nmeat, and set tuning.\nKit No. 5 - Motivating the Elemental Gtode Useoer. The determining\nfactor far classroom uee of a Uoodeatt Het In the teacher's purpose. Whet e\nteacher does with a program depends upon the objectives she has In mind."
}