{
  "id": "d825-32",
  "text": "2\ntreatment of the subject matter which has been prepared by a professional\nwriter. The Committee has supported the original concept of the project,\nbut after close examination of the materials which was possible only after\nthe Advisory Committee became involved in the project, it was felt that\nsome of the technical matters relating to production of the kits could be sub¬\nstantially improved by preparing the material directly on film rather than on\nkinescope recording.\nAlthough the technical quality of kinescope recording is much improved,\neven this improvement does not meet the standards which the Committee feels\nare essential to broad acceptance and use of these materials. Since the kits\nare being designed primarily for lecture hall or school presentation, it is not\npractical to consider videotape either as a satisfactory recording and distri¬\nbution vehicle.\nTo produce these kits directly on film will require an increase in the budget\nfor the contract. This is due to the fact that film production costs are con¬\nsiderably higher than producing kinescopes, but the Contractor and staff of\nthe Office of Education consider that the ultimate importance of the films\njustifies producing films of high quality. The project is now at the point\nwhere production of the first kits can be initiated, and a decision concerning\nmethod by which these materials will be produced must be made. The major\npart of the increase will cover the higher costs involved in a direct film oper¬\nation over a cheaper and inferior kinescope recording. Other increases in\ncost will relate to additional administrative planning and review details\nwhich film production will necessitate. Specifically, this will require funds\nfor additional staff work, two additional meetings of the Advisory Committee,\nan increase in project staff travel, script writing fees, postage, and telephone\ncharges.\nThere are five points in the film production process at which review and\napproval will be sought from the Office of Education, as follows: (1) Story\nboard or film treatment; (2) shooting script; (3) rough-cut sequence with\nreading of commentary to the screen; (4) approval of sound recording of com¬\nmentary and interlock screening of picture and sound; and (5) answer print.\nThe Contractor will submit to the Office of Education six copies of the film\ntreatment and shooting script for review purposes. Following completion of\nthe evaluation phase of this project, and at the discretion of the Office of\nEducation, two negatives of each film will be deposited in a laboratory to\nbe specified by the Office of Education.\nAmend the budget to show overhead @ 15% of total direct costs exclusive of\nscript writing and film production and duplication. Change the amount for\noverhead to $2,9 63 and the total to $44, 918."
}