{
  "id": "d825-58",
  "text": "APPENDIX C (two)\nProgram ft-104 \"On Loans Power\"\nThis fifteen minute program Is from the series When Men\nAre Free produced by the Wisconsin School of the Air. This\nseries is designed to help boys and girls understand and\nappreciate the underlying principles upon which our partic¬\nular form of demoncracy developed and continues to grow.\n\"On Loan: Power\" makes vivid the basic principle of repre¬\nsentation of the people. Elected representatives are loaned\npower to work for the people during their term of office. The\nlesson Is intended for grades 5-8, but it has been used as low\nas 4 and In high school. This series is an example of the\ntype of program which Is best used to stimulate thinking and\ndiscussion.\nProgram R-105 \"Design for Listening\"\nThis fifteen minute program is from the series Music Time\nproduced by the Wisconsin School of the Air. The purpose of\nthe series is to acquaint children with a wide variety of the\nworld's fine music, and to develop creative listening habits.\nEach broadcast is planned to illustrate some phase of the\nlanguage of music. Selections range from the great composers\nof the past to the works of the living musicians. This pro¬\ngram demonstrates that all musical sound is planned sound.\nIt is intended for children In grades 1-4.\nProgram R-106 \"Water That Flows Uphill\"\nThis fifteen minute program Is from the series Young\nExperimenters produced by the Wisconsin School of the Air.\nThis radio program in science is designed for the classroom\nwhich is limited in laboratory equipment and for the teacher\nwho needs assistance in a subject area which still Is limited\nin teacher-training. The lessons give children an opportunity\nto experiment, to find the answers to basic scientific ques¬\ntions. Any class using the programs can collect the equip¬\nment and materials needed for the experiments from homes,\njunk yards, and dime stores. The basic concept of this lesson\nIs; water can be made to work for us through the regulation\nof air pressure."
}