{
  "id": "d825-62",
  "text": "APPENDIX D (three)\nProgram T-107 \"Exploring the News\"\nThis Is a series of twenty-five minute television pro¬\ngrams produced by WHA-TV, Madison, Wisconsin designed to\nbring significant current topics in depth to grades 5-9.\nBackgrounds and relationships are emphasized for one topic\non each^program. This program is not regularly recorded,\nbut WHA-TV would record a special program for Inclusion\nIn the service.\nProgram T-108 \"Superstition or Science\"\nThis Is a fifteen minute television program from the\nseries Elementary, Science For Intermediate Grades produced\nby WQED, Pittsburgh, Pennsylvania. This Is an example of\ndirect teaching of science for students in grades 5-6.\nThe programs are structured in two ways: a survey lesson\nintroducing broad areas and a problem-solving lesson with\none specific problem which is critically analyzed and de¬\nveloped. The series was made for use primarily In smaller\nschools where there is a shortage of trained science teachers.\nProgram T-109 \"Parlons Francais\"\nThis series Is produced by the Modern language Project\nof the Massachusetts Council for Public Schools. The course\nconsists of two fifteen minute television lessons each week,\nand has as its objective the teaching of French to elementary\nschool children. The television lessons are supported by\nteacher's guides and a television program for the using class¬\nroom teachers. A specific lesson has not been selected from\nthis series, but a typical lesson would be used In the service.\nProgram T-110 \"Life In a Drop\"\nThis thirty minute television program Is from the series\n.Exploring Nature produced by the 21\" Classroom and the Mass¬\nachusetts Audubon Society. One major aim of the programs Is\nto arouse interest In science, particularly but not exclusively,\nbiological science. The series Is presented to enable the\nteacher to bring to the classroom material that would not\nordinarily be available. The programs are aimed at the upper\nelementary and Junior high school audience."
}