{
  "id": "d825-71",
  "text": "APPENDIX F\nABSTRACTS OF CORRESPONDENCE SUPPORTING THE PROJECT\nl1sDur*ng 6 year Per*od as chairman of the NAEB\nUtilization Committee, I have had an unusual opportunity\nto observe problems In broadcast utilization. I have seen\nample evidence of a growing need for demonstration materials\nIn the area of classroom utilization of radio and television.\nAn ever-increasing number of educators are becoming\nInterested In the use of Instructional broadcasts, but In¬\nsights as to how such resources would be used are not spread¬\ning proportionately. Teachers and administrators who are\nconsidering the use of broadcast materials would like to\nknow exactly how subject matter Is presented and utilized in\nspecific situations. Convention talks and articles In edu¬\ncation journals cannot provide this kind of see-for-yourself\ninformation. Kits of demonstration materials would be one\nof the most effective and practical means of showing how\nInstructional broadcasts actually work In the classroom.\nDuring the past year I have had a unique experience\nwhich has revealed further evidence of the need for utili¬\nzation demonstration materials.\nAs a consultant to a national survey of the use and\ndistribution of recorded television instruction, f was\nassigned to cover college level institutions In a nine\nstate area. My interviews and observations indicated that\nInformation concerning the details and variations of class¬\nroom use of Instructional broadcasts is not widespread. Few\ncolleges and universities have had much variety of experience\nin using Instructional radio or television. The inability to\nvisuajlze exactly how broadcasts would be used as instructional\nmaterials Is clearly responsible for some of the reluctance\nto allocate funds for equipment and to commit to any broad\ninvolvement in teaching by television.\nMost educators are open-minded and optimistic about the\nservice that can eventually be performed by educational broad-\ncasting. However, before extensive classroom use of broadcast\nmaterial will be undertaken there must be a feeling of con¬\nfidence that these materials and procedures will be effective.\nThis confidence can come from a realization that systematic,\nsoundiy-based teaching procedures are normally an Integral part\nof the TV teaching experience. v"
}