{
  "id": "d825-74",
  "text": "APPENDIX F (four)\nThere are being produced In our country today many\nexcellent educational broadcasts* In the classrooms of our\nschools there are many excellent teachers* What remains Is\nfor each to profit from the highest potential of the other *\nfor the good teacher to use the good educational broadcast\nin such a way that the classroom reaps the optimum benefit\nfrom an effective tool wisely and creatively used*\nDr, T, P„ Baker, Director of Curriculum and Instruction\nAustin Public Schools, Austin, Texas\nJune 19, 1961\n* is * *\nIn my recent travels as Educational Television Con¬\nsultant for the National Education Association I have found\nthe lack of material to demonstrate effective utilization\nof instructional television to be a tremendous handicap*\nIn my present position as Associate Investigator of the\nTechnological Development Project this shortcoming has also\nbecome apparent*\nTo fill this gap 8 have worked with the Division of\nAudio-Visual instructional Service in editing the booklet\nentitled, AND TV! T001 and have produced a film entitled,\n“The Second Classroom*\" Both of these materials are in\nconstant demand* Although they are helpful, they far from\nfill the gap of the kind of material teachers must see to\nfully understand their role in employing television as an\neffective classroom tool,\nI am inquiring as to the state of your proposed project\nto develop demonstration materials of classroom utilization*\nAs I see more and more TV workshops springing up across the\ncountry and see more inservice conferences, I am reminded\nof the need for the kind of material you proposed for your\ndemonstration kits* Hay I state how positive I am as to the\nneed for the kits and express my wish to cooperate with you\nin any way possible to develop them.\nHr* Lee E* Campion, Associate Investigator, Technological\nDevelopment Projept, National Education Association\nWashington, D* C.\nLetter - June 29, 1961\n* # # *"
}