{
  "id": "d533-21",
  "text": "January 29, 195>1\nMr* Seymour Siegel\nRadio Station WNYC\nNew York City, New jfork\nDear Sij\nl\nI an enclosing a copy of a letter waich X received from Senator Lister Hill\nin support of our TV requests# I have had further communications from Sparkman\nand from Carl Elliott,both pledging continued support of our TV fight#\nI shall be looking forward to receiving the SnsytherHorton study from Stuart\nHaydon. I have written Hennock, Tyler, and Frank Dunham to try to secure copies\nof the testimony so I can be a little more intelligent about the whole subj ,ct but\nhave not received an answer from any of them#\nYour sugg stionsof getting Soard approval of the $[*,000 Smythe-Horton study\nstrikes me as being strictly o.k. and my approval is hereby granted and! am sure\nthe other members of the Board will go along with it# They approved it in prin¬\nciple at the Washington meeting, or course# Along with your request for their\napproval of this specific expenditure, you might bring us all up-to-date on the\nstatus o NAEB, financially as well as giving us a running summary of our\nposition with the l^CC as you see it at this time* I know the entire Board shares\nwith me a great deal of pride in the work you are doing and the wonderful things\nyou are accomplishing# You know, of course, hat you have the complete confidence\nof us all. It would bo well, however, to keep all of the Board posted as things\npop#\nI expect to get a mimeographed letter off to Miss x altar at the Buena\nVista toaay or tomorrow to accompany her color map of the Gulf area—the first\nannouncement of the Fall convention# If you have any suggestions for additions\nto our mailing list, let me have the© right away*\nThank you for the cop,, of the Direetoiy of College Courses in Radio and\nTelevision# 1 think we can all use it to advantage to swell membership in NAEB.\nThanks for the suggestion concerning the Fall convention program. I think\nyour idea of getting the Trade Press in is an excellent one# I shall pass the\nsuggestion along to Ralph# I hope you will continue to pass along any suggestions\nyou have for the Fall meeting# You might plan to devote a portion of our next\nBoard meeting to this subject.\nThe idea of invitations to membership in NAEB formalizes and gives dignity\nr,o membership in NAEB# I think it is a good suggestion. I hope to come up with\nsnm"
}