{
  "id": "d533-60",
  "text": "March 26, 1951\nTo: NAEB Officers and Board Members\nProm: Burton Paulu, Secretary and News-Letter Editor\nSubject: Correct Membership and News-Letter Mailing List\nRecently I have received requests from several of you for\nup-to-date membership lists« Others of you have sent me correc¬\ntions for News-Letter mailing addresses* In the course of this\nI realized that my $ews~Letter list leaves a good deal to be\ndesired* So, when I recently had addressograph plates made I\nran off a list for each of you* Yours is enclosed*\nNote that this is the NAEB News-Letter mailing list, and\nnot just a membership list: it therefore contains the names of\nsome people who are not NAEB members*\nOfficers and Board members are all listed on one sheet and\nare not repeated in their respective regions* If a person gets\nmore than one copy of the News-Letter, his address plate is\nmarked with the number of copies he~Ts to receive* (The names\nof Siegel, Ausrans, and Griffith are given twice because each of\nthem receives ten copies, for the mailing of which two envelopes\nare required.)\nCounsel and NAEB Committee members (not already NAEB members\nor News-Letter subscribers) are on the free list.\nWill you all carefully check the active and associate mem¬\nber lists for your regions to see if there are any omissions;\nif any names are being carried that should be dropped; and if\nall names and addresses are properly given?\nAny comments on the PCC and other government personnel\n(all free)? Ulin is there as a result of his request to me* By\nthe way, why is Ho R. Gross on the list?\nI hope Mr* Griffiths will check this whole list carefully,\nespecially the subscriber list. Are all subscribers paid up,\nMr* Griffiths? (I have yet to see any subscriber’s list—and I\nspeak with the practical background of having been a newspaper\ncarrier boy some years ago--which didn’t include a lot of folks\nwhose subscriptions had expired!) I would suggest Mr* Griffiths\nwrite to those subscribers who are not paid up to suggest they\npay; if they do not, he can then let me know and I’ll cut them off0\nThe Exchange list is short, and I think well under control.\nYou might all look over the Press list though. Do you think\nthe folks at Harpers, etc* use or look at our stuff? What about\nBoth at th© DesMoTnes Register and Tribune? And Childs, Pearson,\nFleeson, Lawrence Brecher, Sfcorck, and Boutwell? Miss Gordon is\nthere by her (recent) request."
}