{
  "id": "d1784-7",
  "text": "NAEB NEWSLETTER SUPPLEMENT\nLOW POWER TELEVISION\nTECHNICAL CONSIDERATIONS\nSeveral manufacturers of television equipment\nmarket low power television station packages which\nsell for around $50,000. This price includes all equip¬\nment necessary for live and film pick up, audio and\nlighting equipment as well as the transmitter and an¬\ntenna. Some packages also include the cost of a 200\nfoot tower and its installation. Obviously such a\npackage contains only essential items, although with\nthe equipment provided it is possible to program a\ntelevision station.\nThere are a number of technical considerations\nwhich should be pointed out lest you think this is thf\nultimate answer for educational television. For cer\ntain situations this type of installation is entirely ad\nequate; for others it cannot hope to do an adequate\njob.\nOne of the first technical considerations is\ncoverage. The area covered is dependent upon ef¬\nfective radiated power (ERP). This is dependent\nupon the power output of the transmitter, loss in the\ntransmission line to the antenna and the gain (or loss)\nin the antenna. Coverage is also dependent upon an¬\ntenna height and, hence, it is very important that the\ntransmitting antenna be placed as high as economical¬\nly possible in order to insure maximum radiation from\nit. Tall buildings are an advantageous location for the\nantenna of a low power TV station since they or¬\ndinarily are near the center of population to be\ncovered, save the cost of a high tower and permit the\ntransmitter to be. located closer to the antenna, and\nthus save the cost and power loss of a long trans¬\nmission line.\nMost low power packages are offered with trans¬\nmitters of 100 to 200 watts power output. The FCC\nrequires at least 100 watts ERP regardless of the size\nof the city and also requires that a certain minimum\nsignal strength be maintained over the city limits of\nthe principal city served. This limitation will deter¬\nmine whether low power equipment may be used. The\nfollowing table will give an idea of the coverage pro¬\nvided in the various TV bands with 100 watts ERP\nand various antenna heights above average terrain.\nThe radii shown have been predicted by FCC\nmethods.\nAntenna\nVHF 2-6\nVHF 7-13\nUHF 14-83\nHeight\nCity\nA\nMiles —\nB\nCity A B\n— Miles—\nCity A\nMiles —\nB\n100'\n1.7\n2.3\n8\n1.6 2.0 5.0\nl.l 1.7\n2.8\n200'\n2.3\n3.3\n10\n2.2 3.0 7.3\n1.6 2.3\n4.2\n500'\n3.7\n5.3\n17\n3.4 5.0 12.0\n2.5 3.6\n6.5\nAnother technical consideration involved is that\nof vidicon cameras versus image orthicon cameras.\nThe low power package uses vidicon cameras while\nthe standard television broadcaster uses an image or-\nFEBRUARY, 1957\nthicon as a live pick up tube. The cost of a vidicon\ncamera chain is approximately $5,000 while an image\northicon chain will cost three times this amount or in\nthe vicinity of $15,000. The vidicon equipment pro¬\nduces very acceptable pictures. However, it requires\nmuch higher light levels than image orthicons which\nmay necessitate studio air conditioning. Excellent\npicture quality may be obtained with image orthicon\ncameras with 75 foot candles of incident light while\nvidicon cameras will require double this amount or\nmore. Consequently this additional requirement of\nlight will restrict the area which can be covered by a\nvidicon camera unless a high capacity air conditioning\nunit is employed for studio cooling. In general it may\nbe said that lenses, camera tripods and other accessory\nequipment for image orthicon equipment is larger, of\nbetter quality and thus more expensive. However,\nskilled handling is required and it is more costly to\nmaintain and operate.\nSpace requirements for a low power television\nstation are not severe. The transmitter itself requires\nvery little space. Studio space will be dependent upon\nthe type and extent of the live programming con¬\ntemplated. Large class rooms may be converted into\nTV studios. Adequate ceiling height is a prime re¬\nquirement. Since most television flats used as back\ndrops are 10 feet high the preferred ceiling height\nshould be 14 feet to allow for lights and the grid from\nwhich they are hung. This height also contributes to\nlower room temperatures and comfort of performers\nand permits proper back lighting.\nAnother consideration for studio space is sound\nisolation. Since it is not customary to show micro¬\nphones on television they must necessarily be operated\nfarther from performers. Studio noise thus becomes a\nproblem; however inexpensive sound treatment may\nbe applied to walls and ceiling. As a result TV studios\nare usually less live than radio studios. Extraneous\nnoise filters in through walls, floors, windows and\nother openings. Consequently a relatively quiet studio\nlocation should be selected or sound isolation may be\nnecessary.\nFloors should be smooth and solid so that\ncameras can be dollied smoothly while on the air.\nAccessibility is important, thus ground floor studios\nhave many advantages.\nClosed circuit television requires no FCC con¬\nstruction permit. However the communications Act\nThis material was presented by Cecil S. Bidlack, NAEB\nTV Engineer, at the low power television session of the Region\nIII meeting held January 24-25 at Lafayette, Indiana. It\nis based in part on a pamphlet prepared by Cyril M. Braum\nof the Joint Committee on Educational TV, Washington, D. C.\nSimilar information to the above has been prepared on\n\"Establishing a 10-watt FM Educational Broadcasting Station.\"\nIt will be mailed to you free upon request to NAEB, 14 Greg¬\nory Hall, Urbana, Illinois."
}