{
  "id": "d1226-0",
  "text": "Vol. IV, No* 5 DuPont Circle Building, 'Washington 6, D.C. March 15, 19^3\nCOMMITTEE FOR FULL DEVELOPMENT OF UHF FORMED\nr\nSome 300 industry and government leaders met in Vfeshington, March 12, to take\npreliminary steps toward formation of the newly authorized Committee for Full\nDevelopment of UHF Broadcasting (CUB). FCC Commissioner Robert E. I^e, who will\nchair the committee (with Commissioner E. William Henry as vice chairman) presided\nat the meeting. In addition to general background information by Lee, there were\nreports on the NYC UHF experiment and comments by Rep. Younger and Sen. McGee of the\nHouse and Senate Interstate and Foreign Commerce Committees, respectively. Lee\npointed out that the committee will be governed by a Board of 20 and will operate\nthrough several subcommittees. The general goal is to help implement increased\nutilization of UHF which is expected as a result of the all-channel legislation passed\nby the last Congress. Lee stated that the number of all-channel receivers manufactured\nhad increased steadily: 6$ in Jan., 1961; 8$ in Jan., 1962; and 12$ in Jan., 1983* He\nestimated that 30-35$ of sets manufactured will be all-channel by Jan., 1964. The\nNAEB was represented at the meeting by VP Harold Hill and Ass't.Dir. of Research &\nDevelopment, Jim Fellows.\nNIAC TO STUDY BROADCAST ALERT DURING NATIONAL EMERGENCIES\nThe National Industry Advisory Committee (NIAC) of the FCC has been asked\nby the Emergency Communications Committee of the Dept, of Defense to \"obtain, evaluate,\nand recommend to the Office of Civil Defense techniques whereby standard, FM, and\nTV broadcast stations could be utilized to provide a civil defense emergency alerting\ncapability for the general public under the following criteria: l) Instantaneous\nreceiver alarm activation, 2) 24-hour coverage, & 3) 98$ population coverage. The\nNIAC has set up a special working group, chaired by NAB VP John Meagher, to study\nthis problem and make recommendations. (The NAEB is represented on the NIAC by Pres.\nHarley and VP Hill.)\nTRAVEL & ENTERTAINMENT EXPENSES\nThe new, and more stringent, tax regulations which went into effect Jan. 1,\nwill not prevent your deducting bona fide expenses of attending the NAEB convention\nand other similar meetings. Such items as transportation, registration, meals, and\nlodging are deductible. Valet, barber, sightseeing and side trips, and commuting\nexpenses between hotel and restaurant and meeting place, are examples of NON-deductible\nexpenses. Of course, adequate records must be kept and maintained. The new rules\nare somewhat complicated and if you have any doubts or questions, we'd suggest that\nyou write to the Supt. of Documents, U.S. Gov't. Printing Office, Washington 25, D.C.,\nfor the special issue of Internal Revenue Bulletin (1963-4, January 28). It should\nalso be pointed out that your dues for Individual Membership in the NAEB are deductible\nc on your personal tax return."
}