{
  "id": "d1226-0",
  "text": "Testimony before the FCC Clear Channel Hearing for the National\nAssociation of Educational Broadcasters\nPresented by A0 James Ebel, Executive Secretary of NAEB, Chief\nEngineer of WILL~WIUC, Assistant Professor of Electrical Engineer¬\ning, University of Illinois, and Consulting Engineer\nThe National Association of Educational Broadcasters submits the\nfollowing presentation to assist the Federal Communications Com¬\nmission In its determination on issues 2, 5, 7* 3, 10 and 11, This\nassociation represents 24 active AM and F*M educational broadcast\nstations. These are the stations that weathered the mass deletions\nof the twenties and the difficult days of the thirties which saw\nmany fall by the wayside. Educational institutions pioneered in the\ntechnical development of radio broadcasting when it was in its in¬\nfancy, and are now pioneering in the field of educational programs\nfor the betterment of the people of the United States, Therefore,\nthis association of active educational broadcasters feels qualified\nto submit the following resolution and discussion thereof for the\nconsideration of the Federal Communications Commission,\nRESOLUTION-»The National Association of Educational Broadcasters,\nassembled at Chicago September 17-1S, 1945* resolved to submit to\nthe Federal Communications Commission its position with relation\nto the pending Clear Channel Hearing,\n1, In its review of the evidence submitted at this hearing, the\nCommission is urged to consider the unique publio services\nrendered by the educational and non-profit radio stations of\nthe country,\nA study of the record of these stations must reveal the type\nof service which is not duplicated by any other group of sta¬\ntions in the United States, Their operation Is truly in th©\npublic Interest, convenience and necessity,\n2, The Association urges that the Commission seriously consider\nthe contention that the principle of publio service must pre¬\nvail over the traditional yardstick of the protection of un¬\nreasonable coverage."
}