{
  "id": "d841-32",
  "text": "Program 9\nProgram Title: \"A SUMMARY\"\nRecord Title: \"MUSEUM OF MAN\"\nFor the past eight weeks we have discussed the ways of mankind. We have tried\nto show you parts of the world as it is seen by anthropologists.\nOnce the popular notion about anthropology was that it was the study of the\nbones of ancient man. Some people knew pretty much about archeology — digging up\nremains of old cultures. Anthropologists did both of these things (and still do)\nbut their main interest today is to try to understand why people behave in the way\nthey do. You might say anthropology is interested chiefly in \"human nature.\"\nNow \"human nature\" is a phrase that many people use, but it is a very hard\nthing to define. It is even harder to know what you mean by it after you know some\nanthropology -- because you learn that different peoples have different ways, and\nwonder if anything is left that is true of all human beings. You also learn that\nthese different ways are not caused by different racial traits, because people can\nchange these ways. We know that American Indians have become Americanized; we know\nthat the \"melting pot\", as we used to call the United States, made people from all\nover the world into Americans in about two generations.\nRange of Behavior\nWe can understand \"human nature\" only if we think of it as a range of possible\nways of behaving, and not as any special or particular ways. All peoples share cer¬\ntain general needs and have certain general forms of behavior, but they work out\ntheir own special ways of meeting these needs and doing these things.\nFor instance, all people must eat things that are digestible. But whether they\nlike rare steak: or rotten ptarmigan depends upon the circumstances in which they\nlive and the culture they are heir to. We know also that all peoples must procreate\nand rear children, and therefore have systems of marriage and family life. But the\nExperimental Discussion Program Subject to Revision\n37"
}