{
  "id": "d841-6",
  "text": "continually being changed, as new things are invented, as new circumstances arise,\nand new needs are felt.\nNext, let's be clear about some of the things that culture is not. First, it\nis not a matter of race or blood type. The way of life that we have is different\nfrom the Tlingit Indians, or from other people, and this difference is due to the\ndifferent ways we have learned. No anthropologist today believes that any important\ndifferences in group behavior are caused by differences in race. Another thing:\nculture is not merely habits or customs. To be sure, customs are a part of culture,\nbut culture is the integration and the unity of these customs and habits.\nSet Apart\nThe fact that we humans live according to culture sets us apart from all the\nworld's other creatures. Since culture is learned behavior, culture can be changed\nto meet and to master new situations. It makes it possible for us to live in the\nArctic and in the tropics, in the forest and on deserts. We have conquered these\ndifferent environments because we can learn new ways of doing things and then pass\nthis knowledge from generation to generation.\nEverywhere the mastery of these environments came about through the accumu¬\nlation of knowledge by storing it in thought and language (and later in writing).\nThis accumulating process has given us the power to advance in technical knowledge,\nwhile others who migrated into the world's byways did not learn until recently\nabout some of the most important inventions such as farming, herding, the use of\nmetals and of writing. The cultures without these technical developments have re¬\nmained relatively primitive,but they still have great accomplishments and a variety\nand detail of learning.\nEach culture, therefore, is unique. Each has worked out its own technical so¬\nlution, has its own architecture, its own art, its own system of education, as well\nas the specific content of that education. Values and goal differ from one culture\nto another, and the rules of conduct vary also.\nNot Hodge-Podge\nCulture is not a mere hodge-podge of details. It is not a cloak of rags and\n8"
}