{
  "id": "d357-135",
  "text": "Ruisselle conte un reve. — Kis, le heros, remonte le cours d’un reve, a la recherche\nde 1’image qui en est la source. Cette image, fluide, insaisissable comme le cours\nd’une riviere et lumineuse comme elle, c’est Ruisselle, creature sans chair, chef-\nd’oeuvre de la reine des reves, Cacta la Yerte, gardienne inexorable d’un royaume\ninterdit.\nA la fin d’une fulgurante course, Kis trouve Ruisselle et l’image qui ensorcelait\nle poete a son tour est ensorcelee.\nAinsi le poete — veritable reveur — cherche a posseder son reve et essaye, avec\nla force de l’enfant qui balbutie, le pouvoir des mots. Le reveur exorcise son reve.\nKis charme Ruisselle.\nMais Cacta, s’arrachant a son impassibility vegetale, eclate et condamne Kis\na vivre comme un cauchemar parmi les cauchemars qui hantent le royaume des\nreves. Kis, a qui desormais seule importe Ruisselle et d’en etre aime, accepte d’etre\nun reve parmi les reves, et maudit dans ce monde ou Ruisselle existe, presence\net non plus desir. Cacta decide alors de chasser Kis.\nElle dirige les pas de Kis vers la crypte ou vegetent Keralio et Gelseneur, anciens\nreves devenus reveurs et reduits par elle a l’etat de larves. Ceux-ci, comme des\ngriffes, cement Kis qui contemple avec horreur ces etres machant des lambeaux\nde phrases, debris informes d’anciens souvenirs, eclairs incoherents agitant leur\ntenebre. Quand, cessant d’entendre la voix de Ruisselle, Kis voit se dresser devant\nlui un troisieme spectre en qui il se reconnait, son epouvante n’a plus de bornes.\nII s’enfuit.\nCacta l’arrete, brise son elan, et feint de lui abandonner Ruisselle et de les\nlaisser fibres de partir ou bon leur semble.\nKis part, croyant tenir dans sa main la main de Ruisselle. A la frontiere des\ndeux royaumes, il s’apergoit qu’il a traine un fantome, l’illusion d’une illusion.\nII meurt, n’ayant d’autre main a etreindre que celle du vide.\nPas plus que le reveur n’a pu vivre dans le monde de son reve, n’a resiste le\nreve a la naissance de l’aube.\nTel est le theme de Ruisselle, poeme pour voix, musique et microphones.\nS’il fallait qualifier l’ceuvre realisee, c’est peut-etre, faute d’une expression fran-\ngaise adequate, « Dichtung fur Radio » qu’il faudrait dire. C’est-a-dire une oeuvre"
}