{
  "id": "d357-147",
  "text": "Decembre a ete congu dans l’intention de fondre en un seul ouvrage les nom-\nbreuses possibilites expressives offertes par le moyen radiophonique et en particular:\n1) la parole aussi bien que le chant, les voix comme solo et comme masse;\n2) des textes qui ont une signification specifique et aussi des voyelles ou des\nsyllabes qui ont pour but de souligner l’importance de certaines inflexions parti-\nculieres des voix qui chantent;\n3) la disposition des executants a une distance variable du micro pour obtenir\ndes effets variables eux-memes, de presence ou bien de distance.\nDans la cantate Decembre, le groupe le plus important (chceur, cuivres, bois,\ntimbales) est place pres du micro principal. Les acteurs qui parlent, les flutes et les\nautres instruments a percussion sont distribues aussi de maniere a donner l’im-\npression d’une presence directe, mais a travers un autre micro. Un troisieme groupe\n(cuivres en sourdine, sonnerie de cloches et les deux solistes de chant) est place\na une certaine distance du micro principal. Tous les artistes de ce dernier groupe,\nneanmoins, se servent d’une pleine projection en « forte », et les solistes tenor et\nsoprano chantent a pleine voix. Le son de l’orgue, a cause de la position des groupes\ndivers de tuyaux, est destine a etre recueilli par les deux micros dans leurs diffe-\nrentes positions.\nDecembre a ete execute pour la premiere fois par le « Collegiate Chorale » de\nNew York, sous la direction de Ralph Hunter, au cours d’un programme mis en\nonde par le Municipal Broadcasting System.\nLe texte de Decembre examine la signification originale de Noel et ses relations\navec un monde obsede par l’idee de la destruction, massive aussi bien qu’individuelle,\nou physique, active ou passive. Comme il arrive dans la vie, et en relation avec le\ntexte complexe de la musique, cette partition fait alterner une confusion de senti¬\nments: le cynisme, le desespoir et la satire qui se melent a l’idealisme, a la ten-\ndresse et a l’espoir. Personnages, scenes et siecles glissent d’une maniere qui repro-\nduit l’eparpillement des images evoquees par l’instabilite de la vie contemporaine.\nAinsi, en meme temps que les Rois commencent leurs recherches et que les anges\net les pasteurs sont en adoration, le destin de l’Enfant de la Paix est suggere par\nles diseurs de bonne aventure et par les horribles oiseaux, au corps bouffi, qui han-\ntent le toit de l’etable de Bethleem. Les Rois sont aussi le symbole des hommes\ncourageux qui, en depit de tous les dangers, et contre les esprits du mal dont le reve\nest d’asservir l’ideal d’autrui et de le convertir a leurs fins, s’efforcent d’atteindre\nla lumiere de la verite."
}