{
  "id": "d357-148",
  "text": "Les gardiens de l’Enfant (de tous les enfants de tous les siecles) sont impuissants,\ninattentifs ou, comme la nourrice irresponsable, ils se font les complices du mal.\nL’oeuvre suggere que c’est seulement par une acceptation totale et une iden¬\ntification avec les ideals de l’Enfant que nous pourrons bannir l’ombre monstrueuse\nde la guerre loin des jardins paisibles de la terre. Alors seulement nous pourrons\nempecher notre monde de devenir un desert ravage de fleurs mourantes et de\ncceurs humains tombant en poussiere.\nCette oeuvre en sus d’avoir ete composee de fagon a exploiter des combinaisons\ninusitees d’instruments et de voix, se sert d’une distribution antiphonale et ste-\nreophonique des groupes executants distribues en differentes positions tout autour\nde la salle. Dans cette oeuvre le compositeur developpe aussi les nouvelles appli¬\ncations rythmiques de la « polyphonie des tempo » et de « l’exploitation des retards\ndes tempo » qui rendent la partition aussi complexe que possible, tout en evitant\nau maximum les difficultes d’execution.\n« Exploitation des retards de tempo » est une expression pour decrire les dif¬\nferences des instants d’attaque, differences qui se verifient lorsque deux ou plu-\nsieurs groupes executants sont en positions separees dans la salle. Ces disaccords\nsont tenus en consideration et exploites en tant qu’expedients rythmiques, dans\ncertaines parmi mes recentes compositions.\nHENRY BRANT\nHENRY BRANT naquit a Montreal, Canada, de parents originates des Etats-Unis, en 1913.\nDepuis 1930 il vit a New-York City.\nII a remporte une bourse a l’« Institute of Musical Art » (1930-34) ou il regut aussi les Prix Loeb,\nSeligman et Coolidge de composition; il frequenta la « Juilliard Graduate Scool », grace a une autre\nbourse (1932-34). Plus tard il etudia la composition avec Aaron Copland et Wallinford Riegger.\nEn 1946 et en 195a lui fut decerne le « Guggenheim Fellowship » pour la composition musicale\net, toujours en 1955, il obtint un prix de l’« Institute of Arts and Letters ». Il a travaille comme\nauteur, comme chef d’orchestre pourvoyant aussi a Porchestration pour la radio, le cinema, les bal¬\nlets et le theatre. Il passa plusieurs annees a etudier le cote pratique de la vie et des oeuvres d’un\ncompositeur, avant d’entrer a la « Columbia University» (1943-50) et a la «Juillard School»\n(de 1947 a aujourd’hui) comme professeur de composition.\nParmi ses recents ouvrages plusieurs ont ete composes sur la demande d’organisations telles\nque « Yaddo Festival », « Collegiate Chorale », « Columbia University », « Cincinnati Symphony\nOrchestra », « Ballet Theatre », « Columbia Broadcasting System », « Broadcast Music Incorporated »\net « Juilliard School of Music ».\nHenry Brant est aussi P auteur de Millenium 2, Ceremony, Encephalogram, Galaxies, Labyrinth\net Ice Age.\nHenry Brant et Maeve Olen (Patricia Brant) ont aussi collabore dans les ceuvres suivantes:\nFlute Symphony, Admonition et Behold the Earth.\nDes disques LP de ses compositions ont ete edites par la Columbia, Remington, MGM et\nAmerican Recording Society."
}