{
  "id": "d357-151",
  "text": "Au cours dc son elaboration, le jeu radiophonique Le retour avait pour titre\nL hommage. D’unc part, en effet, mu par la reconnaissance et lc deuil, je voulais\nparler de la Silesie, et d’autre part je desirais prouver, aussi loyalement que pos¬\nsible, la presence universelle et Fimpossibilite de la perte de la Grace.\nJ avais une raison tout a fait concrete qui necessitait cette demonstration: l’ap-\npartement ou j habitais alors avec ma femme, comme sous-locataire, avait pour\npatronne une femme aussi laide que mechante et aussi mechante que malheureuse.\nSon existence poussait le prochain a se demander s’il etait concevable que quelqu’un\nfut exclu de la Grace.\nEt un beau jour les deux themes « perte de la patrie » et « perte de la Grace »\nse rcncontrerent. II est vrai que dans la fable qui se developpa au fur et a mesure,\nle personnage de la logeuse ne jouait plus le role principal; l’interrogation que son\nexistence me posait, est posee actuellement par Ruth. En tant que chretienne,\nRuth nc doute pas de la Grace en soi, mais elle craint de l’avoir gaspillee. Ceci me\nparait etre le pire des doutes, car il meconnait le sens de la Grace: elle qui embrasse\ntout ct ne peut etre perdue.\nForme: J avais d’abord l’intention d’utiliser la fable qui se presentait a moi\npour une piece de theatre, mais je sus me rendre compte qu’elle ne pouvait pas\netre portee sur la scene: c’etait plutot dans un roman que la complexity des rela¬\ntions et des rapports aurait pu etre representee. Mais le jeu radiophonique s’offrait\ncomme la forme la plus concise. II permettait, comme c’etait le cas ici, de changer\nsans difficulty le lieu et le temps, d’alterner des scenes reelles avec des scenes irreelles\nsans grandes exigences, et de creer des repetitions dans lesquelles le sens etait\nmodifie prudemment (ce qui de cette fagon-la — une fa<;on pour ainsi dire musicaie\n— serait impossible sur la scene: la presence du facteur optique aurait rendu la\ntransposition du sens ou imprecise ou plus grossiere). Mais, tout en tenant compte\nde la hberte qu’offrait le jeu radiophonique, il etait possible, si l’on tient a s’exprimer\nainsi, de satisfaire les exigences classiques du drame: effectivement Faction se\nderoulait dans le delai d’une heure et dans l’espace le plus restreint que l’on puisse\nimaginer: dans la sensitivite de Fame."
}