{
  "id": "d357-153",
  "text": "Emission presentee avec la distribution suivante:\nLe medecin\nErwin Linder\nUinfirmiere\nRuth\nAnna Blask\nGisela von Collande\nPere\nEduard Marks\nMere\nIda Ehre\nBasta\nIngeborg Beek-Schubert\nAlfred BalthofF\nKruppka\nManfred\nKlaus Kammer\nMusique: Johannes Aschenbrenner\nMise en ondes: Fritz Schroder-Jahn\nJe suis ne le 2 janvier 1923 a Gorlitz, en Silesie. La famille de mes parents y demeurait depuis\nquatre siecles.\nGorlitz est situee sur les deux rives de la Neisse, aussi la ville a-t-elle ete separee en deux\napres la guerre. Le cote occidental est actuellement occupe par les Russes et le cote oriental est\ndevenu polonais. Quant a moi, j’ai ete eleve sur I’autre cote, ou se trouve aussi la maison de mes\nancetres; on peut la voir a travers la riviere (lorsque apres la guerre je me trouvais encore a\nGorlitz, debout sur le quai occidental, je trouvais beaucoup moins douloureux qu’idiot le fait qu’il\netait defendu de passer le pont).\nAu xveme siecle, mes ancetres etaient des forgerons, au xvneme siecle des tisserands et au\nxixeme des pasteurs. Mon pere n’est parvenu qu’a etre employe dans une agence d’assurance.\nMoi-meme, aussi loin que remontent mes souvenirs, je desirais devenir ce que je suis a peu pres\ndevenu: un dramaturge. A onze ans, en effet, dans la bibliotheque de mes parents je faisais la ren¬\ncontre des « oeuvres completes » d’lbsen, le seul dramaturge qui s’y trouvat. Je lus les quatre volumes\ndu commencement a la fin. Naturellement je n’y comprenais goutte, mais je n’en etais pas moins\nbouleverse. (Dans mes bons moments, aujourd’hui encore il m’advient, en lisant Ibsen, d’eprouver,\nfut-ce par reflet, l’enchantement d’alors).\nJ’ecrivis mon premier drame a treize ans. Le milieu etait constitue par la guerre des Boers\n(il faudrait une etude psychanalytique pour en dire la raison). Imitant le vieil Ibsen, au troisieme\nacte tous les personnages s’evanouissaient en symboles pour autant qu’ils ne s’etaient pas suicides\nauparavant."
}