{
  "id": "d357-157",
  "text": "J’ai commence a m’interesser aux possibility d’enregistrement des voix de la Nature quand\nj'ai fait la connaissance du Directeur de la « Delta Waterfowl Research Station » dans le Manitoba,\nune province occidentale du Canada. J’ai prepare un ou deux programmes d’actualites a ce poste\npeu apres la fin de la guerre, puis en 1952 j’ai pu obtenir l’aide d’un technicien de la C B C pour\nune periode de six semaines; nous avons fait alors de la Research Station une base d’operation dcstinee\naux enregistrements des chants d’amour et des voix des oiscaux palustres. Nous avons obtenu assez\nde materiel pour l’etablissement d’un programme d’une heure environ.\nEn vue de faciliter la tackc et de reduire la periode de temps necessaire a l’claboration de ces\nprogrammes qui m’obligeaient a m’absenter de ma base a Toronto, je me suis mis en quete du\nspecialiste a qui pouvaient etre confies les appareils propres a l’enregistrement du chant des oiseaux.\nJ’ai eu la rare fortune de 1? decouvrir dans la personne du Dr. William Gunn qui avait deja fait des\nexperiences en cette matiere. Le fruit de notre collaboration a ete Birds of the Forest, programme\nqui a remporte le Prix Italia cette annee, ainsi qu’un autre documentaire traitant des oiseaux\nde Point-Pele, la region la plus meridionale du Canada.\nTout ce qui concerne la Nature m’interesse profondement. Aujoura’hui mon attention sc porte\nsur les bruits des insectes et des animaux a fourrure. C’est un travail tres lent et extenuant, mais\nje pense que les resultats en vaudront la peine.\nJe m’interesse aussi beaucoup au cote scientifique — j’ai prepare un documentaire dc la duree\nd’une heure sur l’installation de l’energie atomique au Canad\", qui a remporte le premier prix de la\nCanadian Radio en 1952 et de meme aux Etats-Unis en 1953.\nAu cours des dernieres annees j’ai contribue, avec 24 documentaires d’une demi-heure chacun,\na la serie connue sous le titre Canadian Scene. Ces documentaires vont de l’art de fabriquer un\nviol on a l’exploitation d’une mine d’uranium.\nPour enregistrer les oiseaux dans leur habitat naturel, le micro est place dans le feu d’un reflecteur\nparabolique et de cette facon nous pouvons viser, avec le reflecteur, notre sujet et recueillir sa voix,\nmeme a une distance de trente metres. Naturellement il y a l’inconvenisnt de prendre meme le\nbruit des feuilles qui tombent, le bruit des insectes, du moindre mouvement de Pair, d’un avion tres\neloigne et aussi des autres ciseaux. La patience et la Constance sont des qualites extremement\nnecessaires pour pouvoir enregistrer a la perfection un oiseau isole dans tout l’epanouissement naturel\nde son chant.\nJ’espere achever pour le mois de mai un programme sur les bruits du printemps au Canada,\ndont le litre sera Les Voix de VAvril. Ce documentaire contiendra tous les bruits qui nous\ncharment a la saison des fleurs. Un de ces bruits sera celui des crocus qui eclosent, telle est du\nmoins mon intention. Toute la question est de voir s’il sera possible de construire un equipement\ncapable d’enregistrer des sons que l’oreille humaine n’arrive pas a percevoir.\nTHOM BENSON"
}