{
  "id": "d357-211",
  "text": "Le texte de Job a ete tire de la Bible et a ete choisi par l’auteur pour sa beaute\nlitteraire et pour l’emouvante personnalite de Job, telle qu’elle nous est transmise\npar l’Ecriture Sainte. II est, en definitive, Fexpression de tous les sentiments que la\ndesolation peut susciter dans Fame humaine. En ce sens il represente une valeur\nuniverselle reconnue de tous temps.\nLa reaction des amis de Job forme un contraste surprenant par l’esprit pharisaique\nde leurs propos. Raison pour laquelle ces amis sont presentes — contrairement au\ntexte biblique original — non comme des individus pris a part, mais comme un\ngroupe unitairement congu. Pared contraste~est souligne, du point de vue musical,\nmoyennant l’opposition de la voix en solo de Job au chceur. Elie, le quatrieme ami\nde Job, est presente comme intermediaire entre Job et Dieu (il comprend, en effet,\nmieux que les autres, la signification des malheurs de Job et lui indique la voie qu’il\ndoit suivre).\nDieu souligne a travers les questions qu’il pose — questions auxquelles les\nhommes ne peuvent donner de reponse — sa grandeur et le mystere de ses actions.\nIl pose une limite precise aux possibility de la raison humaine. Musicalement Dieu\nest represente par le Chceur.\nLe commencement et la fin de l’ceuvre suivent l’ordre chronologique du texte\nbiblique. La Pastorale decrit la felicite de Job; puis les Messagers annoncent les\nmalheurs qui approchent. Dans la suite, apres Fintervention de Dieu, Job se retrouve\nfinalement dans son etat primitif de felicite. L’ceuvre se termine ainsi par le retour\ndu theme de la Pastorale, sur lequel elle avait commence.\nTon de Leeuw a exploite dans la partition de son opera les ressources d’ecriture\net toutes les possibility techniques offertes par la radiophonie, de maniere a atteindre\nla plus grande unite d’expression. L’orchestre habituel a ete augmente d’un groupe\nd’instruments propres a enrichir la variete de ses timbres: vibraphone, marimba,\npianoforte, celeste, clavecin, harpe.\nDifferentes perspectives acoustiques ont ete employees pour varier les positions\ndes micros et par consequent les plans sonores. On a recouru frequemment aux\nenregistrementes de consecutifs et superposes, soit pour resoudre certaines difficulty\nmusicales (intonation, etc) soit pour donner le maximum de relief aux effets sonores\nde perspective, soit encore pour obtenir des structures rythmiques plus complexes\n(la Pastorale par laquelle commence l’Opera et le chceur des Messagers qui vient\nensuite se composent de rien moins que sept enregistrements superposes).\nLes variations de niveau ont ete employees avec frequence pour obtenir des\neffets dynamiques et des fondus croises; en outre on a eu soin d’utiliser les systemes\nde changement de vitesse, les reverberations naturelles et artificielles."
}