{
  "id": "d357-216",
  "text": "JACQUES PERRET — Ne le 8 septembre 1901 a Trappes (Seine et Oise), ecrivain et journaliste.\nGrand reporter au journal « Le Journal», de 1932 a 1939, il a publie de nombreux reportages,\nnotamment sur La Guerre d'Espagne, la Catalogne, la Tchecoslovaquie. 11 a fait paraitre avant la guerre\nles romans: Roucou, Ernest le Rebelle. Prisonnier de guerre, evade en 1942, Perret a rapporte de capti-\nvite un de ses plus grands succes Le Caporal Epingle. II publie ensuite: Objets Perdus, et (en 1950)\nBande a part, qui lui a valu le Prix Interallie. Paraissent ensuite Le Vent dans les voiles. La bete mousse,\nL'Oiseau rare. Baton dans les roues, Le Machin.\nDe nombreux ouvrages de Perret ont ete adaptes pour la Radio. Ernest le Rebelle (qui a ete\negalement porte a l’ecran), Le Machin, donne a l’antenne sous le titre Une rentree dans le monde.\nJacques Perret a d’autre part ecrit directement pour la radio un Maximilien, et prepare actuel-\nlement en collaboration avec Paul Morand L>assassinat de la rue d'Orleans, qui sera diffuse au cours\nde la saison 1956-57 par la RTF.\nOn tournera prochainement Le Caporal Epingle avec Robert Lamoureux.\nLa nouvelle La Composition de calcul, qui a ete publiee d’abord dans la « Revue de Paris »,\nen 1947, est parue en librairie dans le recueil intitule Objets Perdus.\nJEAN FOREST — Sa vie est si intimement liee au cinema jusqu’a la guerre del 1939 qu’il est\ndifficile de les dissocier.\nC’est Feyder qui le fait debuter au cinema, tout a fait par hasard, dans Crainquebille en 1921.\nII tourna ensuite, toujours avec Jacques Feyder, Visages d'enfants et Gribiche. Ces films sont\naujourd’hui des classiques du cinema.\nJusqu’a la guerre il tournera regulierement et la guerre achevee il a le desir de devenir assistant\npour aborder la mise en scene. Il recoit alors les conseils de Jacques Feyder qui l’a toujours considere\ncomme un fils, mais la disparition prematuree de Feyder en 1948 ne lui perrnet pas d’atteindre le but\nqu’il s’etait fixe au cinema.\nC’est justement par un hommage a Feyder Le cinema mon metier (1948) qu’il debute comme\nauteur d’emission. Depuis il travaille regulierement pour la RTF et parmi ses productions plus\nimportantes se trouve Une larme du Diable qui, realisee sous la direction artistique de Rene Clair, a\nobtenu le Prix Italia 1951.\nParallelement a son activite d’auteur et de production, Jean Forest appartient aux cadres de la\nRTF depuis la guerre (Service de 1’Exploitation Technique)."
}