{
  "id": "d357-218",
  "text": "La parole est aux voix\nLa radio va disparaitre devant la television; c’est un peu facile a dire, un peu simple\na penser. La vitesse acceleree du progres gacheur nous montre, il est vrai, qu’une inven¬\ntion chasse I’autre avant quelle ait accompli sa carriere. Une machine a laver moderne\nest deja demodee quand sa premiere lessive est a peine seche. Et mille fois plus demodee\nmeme quun battoir a linge. Pourtant je ne crois pas que la radio disparaisse devant\nla television comme le fouet a mayonnaise Va cede au mixeur ou meme comme le bee\nde gaz a du s’eteindre devant Vampoule electrique. La radio a encore des choses a dire,\net si on sait les lui faire dire elle doit les dire beaucoup mieux que la television qui a\nplus de choses a montrer qua dire.\nL’eloquence n’est quun des aspects souvent rudimentaire de cet art de la parole\ndont nous attendons que la radio nous decouvre un peu plus les mysteres, les prestiges\net les prodiges. C’est elle qui nous jouera les drames de la voix essentielle, de la voix\nreduite a elle meme, de la voix seule, qui n’est pas rien que Vart par excellence mais le\npremier moteur car si le Verbe etait au commencement, encore lui fallait-il une into¬\nnation reellement creatrice et Dieu n’a sans doute pas dit que la lumiere fut, d’une voix\nquelconque, comme nous dirions: passe-moi la lampe.\nD’ailleurs il n’y a pas de voix quelconque, les plus maladroites ont leur genie, les\nplus insignifiantes ont quelque chose a trahir. Et les plus douees, les plus habiles, les\nplus inspirees, les plus subtiles, les plus genereuses, les plus magiques n’ont encore donne\na la radio que de rares chefs-d’oeuvre, parce que la radio se mefie du monologue. Elle ne\nveut pas croire que le recit de Theramene a ete fait pour le micro bien plus que pour la\nscene. On demande des auditions de paroles seules, executees par des artistes qui ne\nsoient pas forcemeat des acteurs habitues aux expedients de la mimique, au soutien du\ndecor et au secours de leur personae a trois dimensions, mais des artistes qui ne soient\nque des voix. La plupart des drames radiophoniques s’encombrent encore de prejuges\ngrossierement theatraux, sans parler de ces bruits evocateurs et rumeurs expressives\naussi opportunes parfois que des belements de brebis entremeles a la Pastorale. Pour\ns’en tenir aux adaptations d’ouvrages litteraires, il est encore une routine qui veut\nmultiplier les temps de dialogue sous pretexte de tenir en haleine un auditeur juge\ninfantile au point de ne pouvoir tolerer le ton narratif plus de quinze secondes. Au dela,\ne’est ce que les techniciens appellent un tunnel. Ce sont ces tunnels qu’on voudrait voir\nprolonges, creuses, ramifies, explores par des voix intelligentes et lumineuses. J’ai entendu\na Rimini « Tim, pecheur de truites », une emission de langue italienne couronnee par\nun des Prix Italia. Bruitage des plus discrets, rares dialogues, interminable recitatif.\nJe n’y ai pas compris un mot car je ne sais pas I’italien, mais la voix m’a emporte"
}