{
  "id": "d357-222",
  "text": "VALENTINO BUCCHI — Ne a Florence le 29 novembre 1916. II obtint le diplome de\ncomposition au Conservatoire Cherubini (ou il enseigne actuellement) a 1’ecole de Vito Frazzi, en\nmeme temps que sa licence en Philosophic a l’Universite de Florence avec une these d’esthetique\nmusicale. Artiste sensible aux instances de la societe actuelle, Bucchi a toujours senti d’une faqon\nparticuliere la necessite de s’adresser a des moyens d’expression susceptibles d’etre le plus largement\npartages. Nombreuses en effet sont les compositions de cet auteur ou la parole est mise essentiellement\nen relief. Rappelons-nous la cantate sur texte ombrien Lamentation des Creatures pour voix accompa-\ngnees par l’orchestre; les Choeurs de la Piete morte sur des vers de Fortini, qui obtinrent en 1951 le\nPrix Montparnasse; le mystere des Laudes Evangelii, pour la choregraphie de Massine; l’opera lyrique\nLa Contrebasse, d’apres la nouvelle d’Anton Tchekhov.\nDans le domaine de la musique instruinentale et de la musique de chambre, outre de nombreuses\noeuvres «lyriques » pour chant et piano, les ouvrages les plus remarques de Bucchi sont La ballade\ndu silence pour orchestre et un recent Quartetto pour instruments a cordes.\nValentino Bucchi en outre s’est toujours beaucoup interesse aux problemes techniques et\nexpressifs de la musique pour la radio et pour le cinema. Vainqueur en 1955 du Ruban d’Argent pour\nle commentaire musical du film La Febbre di vivere (La Fievre de vivre), parmi ses nombreuses colla¬\nborations radiophoniques nous citerons celle qui a trait au Faust de Goethe.\nALESSANDRO PARRONCHI — Ne a Florence le 26 novembre 1914. Laureat d’Histoire\nde l’Art a l’Universite de Florence, il enseigne a l’lnstitut d’Art de Porta Romana, dans cette ville.\nII a collabore activement aux revues « Campo di Marte » et « Letteratura », et actuellement il deploie\nune intense activite critique dans la revue « Paragone », et en d’autres periodiques importants.\nLa production poetique d’Alessandro Parronchi revele une personnalite et une sensibilite d’artiste\nnettement distincte. Les recueils de vers publies par lui sont:\nI giorni felici. - poesies - Florence, 1941\nI visi - poesies - Florence, 1943\nUn’attesa - poesies - Modene, 1949\nIncertezza amorosa - poesie - Milan, 1952\nParronchi s’est consacre de meme a la critique d’art dont il a assure la rubrique dans un important\njournal italien, et il a publie les ouvrages suivants:\nOttone Rosai - Milan, 1945\nMario Martucci - Florence, 1942\nNomi della pittura contemporanea - Florence, 1944\nVan Gogh - Florence, 1945\nRosai - Florence, 1949\nOn doit enfin a Parronchi des traductions dignes d’estime de Mallarme, de Gerard de Nerval et\nde Maurice de Guerin."
}