{
  "id": "d357-223",
  "text": "Le Jeu du Baron est un ancien jeu populaire toscan, analogue au Jeu de l’Oie.\nLes des, naturellement, font tout, suscitant avec la sortie des numeros une chaine\nimaginaire d’aventures.\nAu fond, il n’y a qu’un seul personnage, le « Baron », heros et victime, engage\npar le sort dans une serie d’aventures sentimentales, mystiques et heroiques, au\nrythme d’un minuscule orchestre, piafFant et populaire, de trompettes, de fifres et\nde tambours.\nCe petit opera est divise en neuf episodes ou coups de des, qui presentent les\nneuf figures principales du jeu. C’est ainsi que dans la premiere figure (la « Bohe-\nmienne ») le Baron nous est presente dans une experience pathetique: econduit avec\nindifference, d’abord il enrage et perd la tete, puis il se calme et reprend ses chime-\nriques reveries qui lui sont interdites. Au deuxieme coup de des, apres un « petit\nmadrigal » plein de fraicheur du choeur des Pazzarelli (les timbres) sur lequel vole\nen arabesques bizarres une voix de soprano, le Baron est deconseille de proceder\nplus avant. On pressent dans Fair un presage sinistre... toutefois le Baron qui,\ncomme tous les timides, possede le courage du desespoir, continue. Mais au troisieme\ncoup de des l’esprit de notre heros en revient au songe de son amour perdu, tandis\nque resonne le glas funebre de la mort et de la folie. Et ainsi de suite, pour cinq\nautres coups (la « Bataille », les « Buveurs », les « Pelerins », la « Prison », le « Necro-\nmancien ».).\nD«es aventures capricieuses, variees et vraiment etonnantes, arrivent a notre\nBaron toujours aveuglement a la merci du sort indique par les figures du jeu, jusqu’a\nla derniere qui lui surviendra quand, suivant l’exhortation du « Tiratutti » — le\n« deus ex machina » de toute l’histoire — s’abandonnant dorenavant a la vie, il\nrealisera a la perfection sa destinee, en se pla^ant dans le easier final de la « Victoire ».\nDans le Jeu du Baron, outre le protagoniste (baryton) il y a deux solistes: un\nsoprano (la « Bohemienne ») et une basse (le « Necromancien»). Le choeur prend\npart aux peripeties en les commentant ou se personnifiant lui-meme par les figures,\ntandis que la narration repose sur un ensemble de voix de rec tants qui representent\nle personnage du « Tiratutti »."
}