{
  "id": "d357-224",
  "text": "Valentino Bucchi et Alessandro Parronchi exposent leurs idees sur 1’oeuvre\nradiophonique\nDeux solutions se presentent aux auteurs d'oeuvres radiophoniques: celle qui bene-\nficie des ressources techniques les plus perfectionnees dans la faqon de traiter le « ruban »,\net celle qui considere le moyen radiophonique du point de vue d'une « nouvelle dimension\nd'ecoute ». Les auteurs du Jeu du Baron ont choisi carrement la seconde, misant par\nconsequent sur les valeurs poetico-musicales en general, et en particulier moyennant\nun rythme elementaire dans la facture des vers, qui sollicite pour la sonorite une\neconomie de timbres adequate.\nV. Bucchi avait offert, avec les musiques pour Vedition radiophonique du Faust\nde Goethe, etablie par Corrado Pavolini, un exemple-limite quant a Vexploitation formelle\ndes ressources de ce qu'on appelle la « colonne sonore ». Le cas du Jeu du Baron est,\nau contraire, different. Id le minuscule orchestre de « trompettes, fifres et tambours »,\ns'il cree ce type de sonorite appropriee aux exigences de nettete de Vecoute radiophonique,\napparait toutefois conditionne surtout par les necessites intrinseques de la composition\nmusicale.\nPour ce qui regarde le texte poetique de Parronchi, il est bien loin de la ligne du\n« livret » traditionnel, non point tant pour les interruptions du choeur parle que parce\nqu'il substitue a la fixite des « scenes traditionnelles » le fil conducteur d'une action\nininterrompue, telle que seule peut Voffrir la radio, transjigurant la mecanique du\n«jeu» en element de contrastes passionnels et grotesques.\nII semble possible que la « nouvelle dimension d^ecoute » de la radio acquiere, pour\nla musique, la meme fonction que le cinema est en train de revetir par rapport au\ntheatre (d regard duquel il introduit un moyen plus analytique, en satisfaisant toutes\nles exigences de celui-ci, meme sHl ote au spectateur Vimpression de la presence physique\nde Vacteur). Le cinema, certes, a donne en outre des ouvrages articules sur sa technique\nexclusive, et dont certains peuvent etre consideres comme des chefs-d'oeuvre du genre.\nMais pour la radio egalement, toute une forme nouvelle de langage semble desormais\nconditionnee par les nouvelles possibilites d'ecoute quelle offre, et qui se fondent sur\nVaspect « qualitatif» du fait sonore (la puissance de sonorite, en effet, ne depend pas,\na la radio, de la quantite des instrument employes) et sur la dynamique du « montage »\n(element poetique et non technique).\nLes application et les developpements de cette faqon de concevoir, alors qu'ils peuvent\netre innombrables, ne semblent proposer au langage musical aucune deviation de sa\npropre nature, mais Vinvitent plutot a la recherche de ce qui est essentiel, a la synthese."
}