{
  "id": "d357-232",
  "text": "Que d'heureuses rubriques, et combien de radiodrames sont nes presque involontairement\nd'un effet sonore entendu en discotheque, des surprises d'un «filtre », d'un echo, d'une\nsuperposition de voix, du changement de vitesse imprime a une plaque de grammophone,\ndes ressources infinies du « montage ».\nA ce sujet il ne sera pas difficile d'objecter que la validite d'un ouvrage de radio ne\nse mesure pas au nombre et a la fortune de ses trouvailles plus ou moins grandes ou\npetites, qu'il ne saurait etre estime d'apres le nombre et la fonction des musiques\ninserees, ou par la «forme » et par la technique dont on s'est servi.\nUn instant, tout cela avait acquis une importance a vrai dire exageree, qui eut pour\nresultats de brouiller les idees (et Vecoute), aboutissant a des exces qui finirent par\nreduire la parole a des fonctions d'importance secondaire, pour laisser a reffet sonore,\nau bruit, le soin d'etre I'element conducteur et Vanimateur de la composition.\nLa radio a voulu et veut, il est vrai, passer aussi par cette phase experimentale:\nchaque art a ses exces et ses experiences propres a le feconder. Mais la parole, le\n« verbe », est et sera en definitive ce qui compte, ce qui fait le drame, la comedie ou la\nsatire au micro. Et en dehors du micro.\nEt nous void ramenes, comme dans un jeu d'enfant, a notre point de depart. Ecrire\npour la radio est chose difficile.\nCar, ne nous faisons pas d'illusions, id plus qu'ailleurs il faut ecrire pour les autres.\nPour les autres qui ne sont pas le public familier fidele au roman, a la nouvelle, a la\npoesie, et ne represented pas une certaine categorie de societe de culture. C'est tout un\nmonde inconnu et incalculable, peut-etre cent auditeurs un soir, peut-etre un million un\nautre soir. Et notre parole s'adresse en meme temps a Vhumble et au puissant, a I'homme\ninstruit et a Villettre, au savant et au naif, a Vinnocent et a celui qui connait la vie.\nEt tous en sont les juges sans appel.\nNotre parole s'adresse au royaume de Vincertain et de Vhypothetique; elle est ecoutee\npar les indulgents, bien sur, mais aussi par des gens qui n'auraient jamais achete un\nseul de nos livres; par ceux qui se moquent de nous et par ceux qui nous adorent...\nJe n'apprends rien a personne et ces quelques considerations courent les rues. On en\npourrait faire d'autres, naturellement, a Vinfini...\nEcrire pour le micro est difficile, et il est difficile pour ne pas dire impossible\nd'expliquer comment on doit s'y prendre; ce nest qu'une fois le travail fait, et transmis,\nque nous pourrons peut-etre nous rendre compte de certaines petites choses.\nSi Von me demandait un decalogue pour le debutant qui se prepare a composer un\ntravail pour la radio, je lui exposerais Vaventure de la faqon suivante:\nMettre une chemise lavee et repassee.\nEntrer sur la pointe des pieds.\nNe pas ennuyer."
}