{
  "id": "d357-238",
  "text": "Technique de l’enregistrement\nSons de ma Ville a ete prepare comme radio-programme pour etre presente a la\nStation Radio WNYC (the Municipal Station of New York City) et comme documentaire\nen vue de prendre part au Concours pour oeuvres radiophoniques du Prix Italia. Chaque\nminute de ce programme est documentaire, y compris la narration. Tous les enregistre-\nments de celui-ci ont ete consideres comme echantillons de sons et de meme le langage\nparle et la musique. J’ai voulu que ce programme repondit a la question: « Que peut\nentendre une personne qui vit a New York ou visite cette ville?». Le moindre detail,\ndans sa presentation, a done ete conqu pour repondre a cette demande dans une autre\ndimension. J’ai espere que ceux qui ne parlent pas anglais pourraient entendre et\ngouter ce programme. Meme ceux qui ne parviendraient pas a discerner les mots anglais\nd'un petit enfant ou d’une vieille dame, pourraient dire toutefois que les enfants et les\npersonnes agees entrent dans la composition des rumeurs de ma ville. Le materiel de ce\nprogramme a ete enregistre durant les neuf dernieres annees et a requis un peu plus de\ndeux mois pour etre rassemble et realise.\nJe voudrais dire en quelques mots comment Videe m’est venue de proceder a cet\nenregistrement.\nJe me suis vivement interesse a enregistrer Vexpression acoustique de la vie qui nous\nentoure. L’ensemble des materiaux reunis pourrait etre appele folklore, mais la definition\nque le dictionnaire donne de ce mot en tant que « mceurs et coutumes traditionnels,\ncroyances, proverbes ou recits inconsciemment gardes par une population» n’em-\nbrasse pas exactement ce que fai enregistre, etant donne que je m’interesse aussi aux\ndonnees qui proviennent de la vie de tous les jours. Ma curiosite s'est portee princi-\npalement vers la recherche du materiel susceptibile d'exprimer la population et sa\nmaniere de vivre.\nDans le passe, les outils indispensables a Vexercice de ce metier, aussi bien dans le\ndomaine de la parole que dans celui du son, etaient la plume et la machine a ecrire.\nJe suis venu a une epoque ou se perfectionnait un nouvel instrument: Venregistreur\nmagnetique. Cet instrument nouveau m’a permis de songer a un autre moyen d’expres¬\nsion tout different.\nL’enregistrement magnetique (ruban effagable et enregistreur a fil) permet a la classe\nmoyenne d'entreprendre des projets qui n’etaient jadis accessibles qua des particuliers\npourvus d^une large aisance ou a des bibliotheques. Au cours de mon existence, j^ai\nrencontre de nombreux sujets dignes d’etre etudies et presentes sous une forme perceptible\na route. Beaucoup de ces etudes coincident avec les interets de fondations organisees,\nde societes productrices de disques ou avec Vindustrie radiophonique. D'autres zones"
}