{
  "id": "d357-239",
  "text": "de ce materiel (pour diverses raisons) nJnteressent pas les groupes susdits ou ne peuvent\netre traitees par eux. Je considere que des gens comme moi peuvent s'enfoncer dans ces\nregions inexplorees. M’est avis aussi, que puisque des personnes appartenant a la\nclasse moyenne peuvent se permettre ce genre de travail, il ny a plus lieu de se soumettre\naux dijferentes formes de restriction et de censure imposees, le cas echeant, par les\ninstitutions et par Vindustrie. Parlant de censure je ne fais nullement allusion d celle\nde VEtat. Je me ref ere au contraire a ce genre de censure impliquant des considerations\nde cet ordre: « Quelle sera la valeur commerciale? » ou bien: « Quelquun mettra-t-il des\nbatons dans les roues en soulevant des objections?», etc... Les seules restrictions aux-\nquelles je dois me soumettre sont celles qu'imposent les limitations de mon intelligence,\nde mon savoir faire et de mon outillage. Pour me permettre cette liberte, je dois etre\ncapable de gagner ma vie a Vaide d'une autre profession. Pour Vinstant, seule une partie\nde mes gains provient de mon travail d’enregistrement, et cela est du au fait que je choisis\ndes travaux oil coincident mon interet pour le sujet et la valeur commerciale que le sujet\nrepresente. Le restant de mes gains provient de Vexercice de ma profession dans le domaine\ncommercial de la pubblicite artistique.\nLa radio et Venregistrement ont toujours ojfert, dans Vensemble, un champ d'activite\nculturelle a ceux qui ont choisi ce moyen d'expression et qui cherchent a Vexploiter dans\nle monde de Vindustrie. Les per sonnes et le materiel propres a etre enregistres ou transmis\nont toujours ete attires vers le microphone ou dans ses parages. Les choses qui m'inte-\nressent davantage sont celles qui arrivent habituellement au cours de la journee, et ces\nchoses-la ne peuvent etre recreees d'une fagon effective. Je sentais le besoin de travailler\npour le perfectionnement de Voutillage, de la technique, de maniere a pouvoir porter le\nmicrophone dans la vie et y enregistrer ce qui s’j trouve. Je desirais aussi que mon\noutillage et moi-meme figurent le moins possible dans les episodes. Pour moi, Vacous-\ntique ne constitue pas un probleme. Que quelqu’un parle dans une petite chambre\nou en plein air, cela rfa aucune importance: je fais seulement de mon mieux pour\nenregistrer ce que Von dit. Je n’ai jamais trouve personne qui ait des objections a\nfaire sur le lieu oil les enregistrements ont ete ejfectues; je dirai meme, au contraire, que\nVon prefere en general entendre des gens qui se trouvent en des situations acous-\ntiques variees.\nMes enregistrements, je les fais en menant mon existence habituelle. Je porte toujours\navec moi un petit enregistreur portatif. J'en ai perfectionne Voutillage a tel point que\npour chaque episode je peux ejfectuer des enregistrements qui vont d’un degre moyen\nde fidelite au maximum, et celui-ci a partir de quinze secondes apres le commencement\nde Vepisode lui-meme ou apres le moment que j’en ai pris connaissance. Mon travail\npeut me conduire dans une imprimerie. Les bruits, les peripeties, le jargon d'un metier\npeuvent etre enregistres en quelques minutes en dehors du temps requis par ma profes-"
}