{
  "id": "d357-24",
  "text": "Expenses relating to members called by the Secretariat as mentioned\nby Art. 15, shall be defrayed by the Secretariat.\n18\nIn performing its duties each Jury applies the following rules:\na) at its first meeting the Jury shall appoint its Chairman. The\nSecretariat shall submit a report in order to enable the Jury to identify the\nentries submitted. The Jury shall then satisfy itself that the rules of the\nStatute have been applied in submitting the entries;\nb) votes are secret. Decisions shall be taken by a simple majority\nof voters. The Chairman shall vote, but his vote shall not be preponderant;\nc) the order of performance of the entries submitted shall be determined\nby ballot;\nd) when all the entries have been heard a discussion shall follow\nwith the object of ascertaining whether any of them do not meet the spirit\nor the letter of the Statute and, in this case, to decide, by vote or otherwise,\non their elimination;\ne) after this first elimination the Jury shall proceed to another\ndiscussion regarding the aesthetic and broadcasting standards of the entries;\nf) the Jury shall then award the prize by a secret vote;\ng) within the limits of the general rules listed above, the Jury will\noperate in the manner it considers most appropriate.\nThe Chairmen of the Juries, and they alone, are entitled to give information\nto the General Assembly regarding the results of the votings, the conclusions\nand the remarks of the respective Juries. Before proceeding to give this infor¬\nmation the Chairmen shall meet in order to coordinate their remarks.\nThe members of the Juries are bound to secrecy regarding the discussions.\n19\nThe Italia Prize has a permanent Secretariat. This office is entrusted\nto the Radio Italiana, promoter of the Italia Prize, at its own expense.\n20\nEntries submitted by the Organizations participating in the Italia Prize,\nmust reach the Secretariat at least six weeks before the meeting of the Juries.\n26"
}