{
  "id": "d357-36",
  "text": "b) alia registrazione delVopera mediante strumenti che servono alia\nriproduzione meccanica del suoni, in vista delle trasmissioni elencate alia\nletter a c) in appresso;\nc) a due trasmissioni delVopera, sia dal vivo, sia in relais, sia\nmediante gli strumenti che servono alia riproduzione meccanica, entramhe\nle trasmissioni dando luogo, a profitto delVautore, al compenso usuale accor-\ndato alle opere dello stesso genere dalVOrganismo che effettua la trasmissione,\nsenza che un qualsiasi supplemento di compenso sia dovuto per il fatto\nche si tratta di un'opera premiata.\nNel documento sopra indicato, Vautore deve inoltre o dichiarare di\nessere, per guanto riguarda V opera present at a, il solo titolare del diritto\ndi traduzione, d? adattamento, di riproduzione e di radiodiffusione, o indicare\nil ovvero i titolari delVuno o delValtro di questi diritti. In quesV ultimo caso,\nVOrganismo di Radiodiffusione interessato alia presentazione delVopera, pud\nesigere dalVautore, come condizione della presentazione di questa alia Giuria,\nlei documenti analoghi a quelli specificati negli alinea precedenti, da rila-\nsciarsi dai suddetti titolari.\n8\nie Giurie non esaminano le opere contenenti una parte musicale qua-\nlora non siano accompagnate da una delle quattro dichiarazioni in appresso\nelencate:\na) se Vopera non e ancora stata oggetto d^una edizione o di un\ncontratto d'edizione, Vautore deve accompagnarla con una dichiarazione\nscritta mediante la quale autorizza tutti gli Organismi aderenti al Premio\nItalia — per il caso in cui Vopera sia premiata — a effettuare le copie\nnecessarie, strettamente riservate, salvo stipulazione contrattuale contraria,\nalle due trasmissioni di cui alVarticolo precedente;\nb) se Vopera, senza essere edita, e gia stata oggetto dVun contratto\ndVedizione, Vautore deve accompagnarla con la dichiarazione indicata alia\nsuddetta lettera a), redatta pero dal titolare del diritto dVedizione;\nc) se Vopera e gia stata oggetto dVuna edizione da parte di un terzo\nsenza che se ne trovino in vendita degli esemplari a condizioni correnti,\nVautore deve accompagnarla con una dichiarazione scritta delVeditore, con\n39"
}