{
  "id": "d357-64",
  "text": "16. Dans les episodes d'egarement, les images du passe sont deformees par modi¬\nfication progressive de la vitesse des tours.\nHENK BADINGS\nLa legende antique nous conte le retour victorieux en son foyer apres dix ans\nd’absence d’Agamemnon de Myc6ne, le chef des Grecs. Sa femme Clytemnestre le\nconduit solennellement a son palais. II y penetre sans mefiance, couronne de\nlauriers et couvert de fleurs, telle la victime qui gravit lentement les degres de\nl’autel pour y etre immole. En effet quelques instants apres, alors qu il s est\nretire dans son bain pour s’y laver de la poussiere du voyage, Clytemnestre le tue\nd’un coup de poignard. Elle avail sans aucun doute de bonnes raisons: tout\nd’abord un amant, Egisthe, et le desir de venger sa fille Iphigeme, sacrifice a 1 m-\nteret politique de son mari. Mais, quoi qu’il en soit, selon la loi et le droit, c est\ndesormais a Oreste, le jeune fils d’Agamemnon, qu’incombe le devoir sacre de venger\nson pere. Le roi Strophios, qui l’a garde a sa cour et a fait son education, jour apres\njour Fa mis en face de ce devoir. Oreste a a peine atteint l’age d’homme qu’il rentre\nchez lui avec Pylade, un ami de jeunesse, et chatie la mere et l’amant qui tombent\nsous ses coups. Mais ce qui lui semblait dans son reve d’adolescent une froide\nsentence lui apparait, apres F execution, comme un meurtre affreux. Les deesses\nde la vengeance, attachees a ses pas, ne cessent d’infliger a sa conscience la torture\nd’affreux remords. Reculant d’une horreur toute politique devant ce parricide,\nMenelas, roi d’Argos, retire la promesse qu’il a faite de donner sa fille Hermione\nen manage a Oreste; il force celle-ci a epouser le fils d’Achille: Neoptoleme.\nRepousse et solitaire, Oreste se rend k Athenes, bien decide a trouver, dans une\nsentence d’acquittement ou de condamnation, la paix interieure. Les deesses de\nla vengeance soutiennent l’accusation. Apollon plaide en sa faveur, en montrant\nqu’il n’a fait que suivre la loi et le devoir; au moment du verdict, les voix etant\npartagees, Athenes qui preside, prononce Facquirement. Mais le jeune homme"
}