{
  "id": "d357-68",
  "text": "Le compositeur a ecarte Vensemble symphonique traditionnel, moyen trop riche selon\nlui pour feter le « Poverello ». II a choisi un seul instrumentiste par pupitre comme\npour deleguer a la gloire de Saint-Franqois un seul representant de chacune des sono-\nrites de Vorchestre. II y a done un seul premier violon, un seul deuxieme, un alto, un\nvioloncelle, une contrebasse. Une flute, un hautbois, un cor anglais, une clarinette, un\nsaxophone et un basson representent la famille des bois. Pour les cuivres: une trom-\npette, un trombone et, par exception, deux cors. La harpe et le piano qui est utilise\ncomme sonorite percutee — le celesta et la batterie, competent cette formation de\nvingt solistes.\nLe style musical suit le style des poemes assez dijferents les uns des autres, mais\ntous inspires, quils soient graves ou allegres, par la confiance et la joie franciscames.\nA cause du caractere intime et personnel de la plupart des poemes, le compositeur\na confie une part tres importante de la partition au baryton solo qui mcarne le role a\nla fois du Pelerin d\\Assise et de Saint-Franqois. Le Chceur ne se contente pas d'inter¬\nventions massives exprimant des conclusions, comme dans le chceur antique. II est pre¬\nsent partout: tantot il accompagne le poeme, tantot il en est le diseur. Quant au recitant,\npar de breves interventions, il situe les divers moments de Voeuvre: la voix parlee con-\ntraste avec la musique lyrique et Vauditeur de la radio, aveugle et sans programme a\nlire, peut vivre plus aisement Vaction.\nQuoique le sujet soit nettement religieux, ni le poete ni le musicien n'ont voulu en\nfaire une oeuvre de musique sacree. Cest une cantate et non un oratorio. Alors que tres\nsouvent la musique profane — la plus belle d'ailleurs — penetre aujourd'hui au\nsanctuaire, par Messire Francois, Fest Vevangile qui veut descendre sur la place pubhque.\nPourrait-il en etre autrement d'une oeuvre destinee d toucher non seulement une\nelite, mais aussi le peuple innombrable des auditeurs de la radio?\nLes onze poemes qui constituent le texte de Messire Franqois out ete ecrits par\nLeon Chancerel a son retour d’Assise. Il relatent en trois chants le choc de lumiere\net de force qui fondit sur lui au contact de Saint-Fran^ois."
}