{
  "id": "d357-81",
  "text": "Au cours de la production, on passe alternativement d’une grande intensite de\nsentiments a la vie de tous les jours, de 1’humour au pathetique; la forme de pro¬\nduction reflete ainsi sa signification. II n’y a pas de musique specialement ecrite\npour orchestre, mais uniquement un accordeon et un accompagnement vocal; et\nla encore, les airs tres simples et familiers ont ete choisis a dessein; c’est ainsi que\nla chanson d’enfant « I had a little nut tree » (J’avais un petit noyer) evoque des\nassociations de sexe et de sterilite. Les poemes que le heros et l’herome se disent,\ncomme s’ils se livraient a un jeu de salon, refletent de meme leur propre situation.\nSelon l’opinion de 1’auteur, cette production doit etre un de ses plus grands succes\nradiophoniques, car elle se deroule tout entiere sur deux plans, sans aucune note\ndiscordante et reflete, sous la forme d’une simple histoire, toute la complexity du\nmonde dans lequel nous vivons — «une machine detraquee» come le heros le\ndecrit, mais une machine dont la complexite peut neanmoins etre depassee et defiee\n— et parfois meme mise en echec par la complexite des individus pris dans son\nengrenage.\nLOUIS MAC NEICE, est ne en 1907, a Belfast, de parents irlandais. II est sorti de l’Universite\nd’Oxford Licencie es Lettres et Philosophic. En 1930, il devint professeur de Lettres a l’Universite\nde Londres. II a egalement occupe plusieurs chaires dans des universites americaines et ete pendant\nun an et demi Directeur de l’lnstitut Britannique d’Athenes. II a sejourne dans des pays aussi dif-\nferents l’un de l’autre que l’lnde et l’lslande, et en a rapporte des ouvrages. En 1941, il entrait a\nla BBC comme metteur en ondes et script-writer. Depuis cette date, il a ecrit plus d’une centaine\nde pieces, d’adaptations et de montages radiophoniques. Deux de ses pieces ont ete portees a la scene.\nSes oeuvres comprennent: Poemes (1935) — L’Agamemnon d’Eschyle (traduction en vers - 1936)\n- Lettres d’lslande (en collaboration avec W. H. Auden - 1937) - Les Contraintes de la Terre\n(poemes - 1938) - Poesie moderne (critique - 1938) — Journal d'Amomne (poeme - 1939) - La\nPoesie de W. B. Yeats (critique - 1941) - Plante et Fantome (poeme - 1941) - Christophe Colomb\n(piece radiophonique en vers - 1944) - Le Tremplin (poemes - 1944) - La Tour Noire - et autres\npieces radiophoniques (1946) - Trouees dans le Ciel (poemes - 1948) - Oeuvres poetiques (1949) -\nLe « Faust» de Goethe (traduction en vers - 1951) - Dix Holocaustes (poemes - 1952) - Suite\nautomnale (poeme - 1954)."
}