{
  "id": "d357-84",
  "text": "Paul Louyet, commentateur aux Emissions Flamandes de 1’INR, a ete charge\npar la Commission Coloniale Scolaire du Ministere des Colonies de Belgique et par\nla Radio Scolaire de l’Institut National Beige de Radiodiffusion d’une mission de\nreportage a travers les territoires beiges d’Afrique centrale.\nDans Le Soleil se leve sur un monde le reporter a voulu depeindre une com-\nmunaute totalement et vraiment differente de la sienne, infmiment difference et\nfragmentee en elle-meme, et qui pourtant, partout et en meme temps, revele un\nvisage ou se retrouve l’image complete de l’evolution de ce remarquable pays.\nD’un cote il s’agit de l’effritement d’un communaute, de Yautre d’un devenir\nque le « blanc » ne peut qu’evaluer approximativement parce qu’il n’a plus prise\ncomplete sur cette grande inconnue dont il fut le createur, sinon l’apprenti-sorcier:\nle dynamisme africain.\nLe reporter a tache de rendre et de fixer cette atmosphere, cette evolution totale,\nce dynamisme en quelques images, qu’il voudrait elever a I’etat de symboles, de\ncategories, et peut-etre plus exactement de close-ups de details typiques, de com-\nposantes d’une grande fresque.\nChaque detail est illustre par une image enregistree sur place. Certaines d’entre\nelles, entr’autres celle des Pygmees, sont considerees par les experts comme un exem-\nplaire unique d’enregistrement de musique ethnique. Yoici le schema de ce montage\nradiophonique.\nUn tableau de la vie des Bakuba. — L’epopee de la grandeur passee de leur tribu\nque chantent les femmes Bakuba est la chanson de beaucoup d’autres petites com-\nmunautes qui restent hermetiquement fermees au monde environnant (que celui-ci\nsoit europeen ou africain) et qui n’ont pas encore etc attaches a leurs traditions\nancestrales sous la pression du monde modeme.\nOn trouve ces petites unites fermees dans les regions les plus dloignees, vivant\nencore en marge d’un monde moderne qui se saisit rapidement de tout ce qui\nl’entoure ou dans des tribus comme celles des Bakuba qui sont les heritieres d’une"
}