{
  "id": "d357-85",
  "text": "ancienne, profonde civilisation et qui continuent de vivre de leurs acquis; tribus qui\nvolontairement se tiennent a l’ecart de ce monde nouveau qui pourtant porte en\nlui 1 avenir et qui dans son evolution ebranle la base, l’ordre social sur lequel\nreposent ces civilisations indigenes. Tout en ne laissant a celles-ci que le choix entre\n1 adaptation et 1 abandon de Fheritage ancestral ou le conservatisme et la petri¬\nfication lente dans un combat a mort dont la fin — si ce n’est le moment — n’est\npas douteuse.\nLa ville. L image de Leopoldville donnee dans ce montage est, en fait, un\nessai de synthese de toutes les villes de l’Afrique centrale. Aucune d’entre elles n’a\nun caractere original parce que toutes sont nees de circonstances identiques. Toutes\nsont marquees au coin de la civilisation moderne, standardisante.\nMais ce qui rend toutes ces villes fascinantes, meme les plus petites, c’est la\ncommunaute qu’elles representent. Chaque ville est un creuset dans lequel se fusion-\nnent en elements homogenes les differentes races de la colonie, qui oblige les tribus\nles plus differentes, et les plus opposees, sinon antagonistes, a rechercher un com-\npromis entre elles dans le cadre d’espaces limites: la ville, l’entreprise.\nChose neuve en Afrique, si neuve meme que chaque jour les formes tradition-\nnelles s insurgent contre les formes modernes, que chaque reunion d’indigenes donne\nau spectateur Fimage bigarree de l’ancien et du moderne, du passe et du present,\nun meli-melo dont sortira un jour un milieu nouveau, specifique et different de\ntout le reste.\nCe n’est plus l’occident. Ce n’est pas encore l’Afrique. C’est le present qui passe.\nLa terre. — Si les villes sont l’illustration saisissante d’une evolution, elles n’en\nsont pas moins la cause directe d’un probleme social tres brulant, qui semble etre\ninseparable de toute industrialisation, et que nous, au xix«me siecle, nous avons\nconnue aussi apre qu’en Afrique, sans en avoir recherche la solution selon des lignes\npar alleles.\nC’est le probleme de l’exode rural."
}