{
  "id": "d357-86",
  "text": "Le reporter a visite au fin fond de la foret d’lturi un village pygmee, ou\nhabitent les gens qui sont consideres comme les plus primitifs, les plus farouches\nde toute l’Afrique. Ils ne connaissent meme pas les premiers principes d’une agri¬\nculture primitive, de sorte qu’ils n’ont d’autre moyen d’existence que la vie nomade\ndans la foret oii ils vivent de la chasse, de la peche et de la recolte des fruits\nsauvages.\nJadis, tout contact avec les Pygmees etait excessivement difficile par suite de\nleur vie errante, sevree de tous les biens de la terre.\nMaintenant cela aussi est le passe, car meme les Pygmees ont ete attires\nvers la ville et ils quittent en nombre croissant leurs refuges traditionnels dans la\nforet pour se fixer autour des comptoirs europeens, oil ils trouvent protection contre\nla nature hostile et la possibility d’une existence plus stable qui les integrera demain\ndans l’Afrique nouvelle.\nII en est ainsi des Pygmees et aussi des deux millions et demi d’indigenes du\nCongo Beige qui ont quitte la terre et ont cherche refuge dans les villes.\nCet exode rural massif a cree des difficultes presque incalculables dans tous les\ndomaines de l’activite sociale. Des regions entieres se sont videes et ne pouvaient plus\netre gerees comme il convient, faute de personnel. Des generations d'administrateurs\nont scrute le probleme, jusqu’a ce qu’ils aient trouve la solution: dans le paysannat\nindigene, ou l’agriculture repose sur des bases industrielles et ou simultanement s’as-\nsure la transition du systeme du collectivisme agricole primitif a l’economie moderne.\nAinsi a ete allege le fardeau trop lourd qui pesait sur la population rurale et\nqui F oblige ait a produire plus qu’autrefois avec 25% de main d’oeuvre en moins.\nLa physionomie de la terre en a ete fondamentalement changee.\nCe tableau comporte la musique de chasse des Pygmees et un interview avec\nun agent territorial.\nL'industrie. — Enfin, voici trois images, l’une de la fonderie de Lubumbashi,\nFautre de la centrale electrique de Nzilo, et une troisieme de 1 atelier central de\nreparation de l’Union Miniere de Jadotville. Trois images dans lesquelles on tache"
}