{
  "id": "d357-97",
  "text": "ITALIE\nPeines, joies et chansons de l’auteur de Bertoldo\nevocation litteraire et musicale\nde\nMASSIMO DURSI\nmusique de\nADONE ZECCHI\nduree 66' 30\"\nLe villageois Bertoldo est certainement un des personnages les plus connus de\nla litterature populaire italienne. Ses farces, les spirituelles saillies dont il les assaisonne,\nles aventures risquees auxquelles il s’expose, dans lesquelles une connaissance avertie\nde fame humaine et une tenacite qui ne s’embarrasse pas de scrupules finissent\ntoujours par triompher de la coquinerie des puissants, sont devenues proverbiales.\nC’est a un poete de l’Emilie, Giulio Cesare Croce (1550-1609), que revient la gloire\nd’avoir donne le jour a Bertoldo, pour avoir publie dans sa maturite Les tres\nsubtiles ruses de Bertoldo. Tout comme son heros, Giulio Cesare Croce etait d’humble\norigine; il mena une existence tourmentee et fut contraint a sejourner en des con¬\nditions humiliantes aupres des cours seigneuriales. Apres s’etre transfere tres jeune\nBologne, il dut y passer toute sa vie, ecrivant des vers et composant des chansons\nqu’il executait souvent lui-meme en les accompagnant d’une faqon rudimentaire sur\nla viole ou le violon. De sa vie on ne sait pas grand’chose; toutefois, il existe encore\n— principalement a la bibliotheque de PArchigymnase de Bologne — une grande\nquantite de petites compositions et d’opuscules de lui, pour la plupart assez mal\nimprimes. Ce sont des morceaux en langue italienne et en dialecte qui nous four-\nnissent la chronique en menue monnaie, mais tres aigiie et si franche, d’un peuple\net d’une ville pris sur le vif a chaque instant de la journee, avec ses joies et ses\npeines, sur les places publiques ou au sein de la famille. L’idee d’une emission sur\nla vie de ce chansonnier, qui a juste raison fait aujourd’hui partie de la litterature\nitalienne, est due a la possibilite de fondre en un tout l’abondant materiel poetique\nlegue par Croce lui-meme, qui n’est plus edite depuis des siecles, et du materiel"
}