{
  "id": "d357-98",
  "text": "musical present aussi, dont Croce, comme on le presume, dut sans doute se servir\npour accompagner les chansons parvenues jusqu’a nous. II en est resulte un veri¬\ntable «programme a sujet», c’est-a-dire une de ces libres compositions radio-\nphoniques vers lesquelles, depuis plusieurs annees, s’oriente en grande partie la pro¬\nduction originale du Troisieme Programme de la Radiotelevision Italienne.\nPilate\ndrame radiophoniquc\nde\nANTONIO SANTONI RUGIU\net\nGIUSEPPE DI MARTINO\nduree 49'\nD’apres les temoignages concordant des Evangiles, Ponce Pilate etait le Pro-\ncurateur romain qui fut amene, par sa veulerie, a condamner a mort Jesus. On ne\nsait rien ou a peu pres rien de lui avant son arrivee en Palestine, et rien apres la\nCrucifixion du Christ. C’est ainsi que Pilate est reste immortalise par le geste de\nse laver les mains, symbole de lachete et de manque de courage moral. Le present\ndrame radiophonique est fonde sur le personnage de Pilate. Exterieurement, les\nfaits sont ceux que la tradition nous a legues, mais c’est a dessein qu’ils ont ete\nconsideres en dehors du cadre grandiose qui les entoure et les eclaire. Ils sont observes\ndu point de vue de Pilate. Pilate etait un homme commun, un fonctionnaire sou-\ncieux de sa carriere, un homme prive du sentiment du divin qui eleve meme les\nhumbles. Un homme qui tenta de faire son petit machiavel en se cramponnant deses-\nperement aux principes du droit romain — de sa Rome — incapables de le guider\net de le soutenir en l’occurence. Et c’est pourquoi, bien loin de vivre les grands eve-\nnements auxquels il prit une part si importante, il fut emporte par eux sans y\nrien comprendre. Pilate, en somme, anticipe 1’incomprehension et le drame de tout\nle monde romain en presence de la nouvelle civilisation chretienne qui allait changer\nfame des hommes et leur histoire. Il etait en effet trop tot pour que Pilate put\ncomprendre ce qui arrivait alors. Il se trouvait dans la zone d’ombre, la parole d’amour\napportee par le Christ a l’humanite n’avait pas encore touche son cceur. «Je ne\npossedais pas — dit-il — la memoire du futur ». Il n’a rien compris parce que ses\ncalculs etaient des calculs trop humains; toutefois, l’intuition de quelque chose qui\nle depasse a effleure son ame, et c’est precisement a partir de ce jour qu’il a cesse\nde vivre en paix."
}