{
  "id": "d1402-0",
  "text": "September H. I9?j9\nTO:\nAll NAF.B Members\nFROM:\nRichard B. Hull, President\nJib:\nNAI.E Testimony end Membership\nAllocation Hearings Before th©\nParticipation in Forthcoming Television\nFederal Communications Commission\nInclosed is a copy of «x statement prepared for the Y.ALB and filed August 26,\nX9h9* by our attorney, Marcus Cohn of the Washington, D- 0legal fim Gf\nCohn and Marks*\nIn essence HAbB is asking ten UHF television channels h© set aside for educa¬\ntion just as they ware in the FK band* Hearing data for discussion of this\nand othor statements in regard to the VHF end UHF television allocation plan\nof the FCC is scheduled for 10:00 AM Monday, September 26, at Washington,\nD. C*, at & piece to be la.ter designated by the FCC*\nDue to the large number of statements already filed, it is likely that the\nappearance of the National Association of Educational Broadcasters in this\nhearing -will be later than September 26, 19i$*\nThirty different institutions replied in response to th® first NAKB letter\nsignifying their support of some action to reserve television channels for*\nfuture educational use* Many presidents wrote directly to Wayne Coy* FUC\nChairman*\nIt is unfortunate that educational institutions both in and out of the NAEB\ndid not clearly understand what was involved in the forthcoming hearings/\nFrequently to appear before a federal commission in hearing it is sufficient\nmerely to file notice of \"intention to appear*\" In this television proceed¬\ning, however, it was necessary to simultaneously file both \"intentioh tn\nappear and the \"text of the int®nded\"'arg'ument*'fr\nThus many national educational organizations wrote directly to Mr* Coy or\nsometime during the past year approved a resolution and sent it to the FCC\nunder the illusion they were on record in the television matter* Techni¬\ncally this had the ©ffet ; only of en informal opinions and officially their\nstatements, if so filed, are without validity in the current action unless\nthey formally filed August 36 »\nTo my knowledge only thro© major groups have officially filed for an appear¬\nance ; ' rjr\n1* The National Association of Educational broadcasters\n2. Th© Association of lend Grant Colleges\nThe National Association of State Universities\nBoth of the latter agencies simply filed in support of the NAKB statement,\nbut did by virtue of meeting the August 26 deadline have the force of ind©«\npendant; tiling* The National University Extension Association is appearing\nas an NAEB witness and co-testifier.»"
}