{
  "id": "d264-12",
  "text": "June 10, 19>3\nTOs Board of Director® and Officers\nFROM: Graydon Ammus, President* HAE3\nSUBJECT* lo Headquarters Business\n2. Review of the past week\n3. Miscellaneous\nFirst, may X ask your okay on a plan which I have worked out\n•with Frank Schoolsy? Vfa hall agreed that it would not be desirable\nfor Harry to assume the full responsibility of Headquarter® operation\niiaaedi&tely upon Ms return, so Frank has agreed to stay on in hi®\npresent status for Headquarter® operation through June and July while\nHarry gets ecf^pXataly reoriented® n0ur Treasurer\" esys the IWB budget\ncan stand this small additional expense* (life or® paying Frenk a little\nthan |200*00 a itmfch). be hanno secured a traveling fellowship for\nHarry so It® my visit more' widely during this period than he would be\nable to do on HAEB funds. In any ©rent, it is highly desirable that he\nnot bo tied down the first two months*\nEEFXHW OF THE PAST WEEK. On .Monday of last week, Frank School®/,\nWilbur Sctemm and I mt with Bob VsnDuyn in Chicago for preliminary\ndiscussion® ©a neat year1® budget* This was largely an exploratory meet¬\ning followed up by a memorandum from Frank and me on specific budget items.\nThese included, above a continuation of the present budget, funds for*\nA zm tap® duplicator and a supplementary supply of tapes*\n2© Three new top level people at Ksadsuarters and one operation®\nlevel sian - (This includes money to establish an educational broadcasting\nmagazine and fund® for publication* )*\n3U An ospanded program in inierneships, scholarships, and exchange\nof personnel here and abroad*\n1*0 Establishment of a Washington office with funds for securing\nprogram® and regular reports on the Washington scene*\n\" 5* Additional grants-in-aid* . ^\n6* Major productions (either in agricultur© or education) for distri¬\nbution on the taps network*\n7« Additional committee meeting®* v\n8. Report® and publication®*\n9* Establishment of a W program and station problem® consultation\nservice*\n10* An extensive research Job to detonnin© os accurately m possible\nthe cost of operating an educational television network*\nMa &> not expect a cosplete underwriting of this proposed program\nfyaBk this one source, but m h&v® been given reason to hope that a signifi¬\ncant increase will bo forthcoming. We may expect to have to request funds\nfor seme of these projects from other sources*\nWhile in Chicago X spent soma time with Gaorgs Overton discussing\ngeneral KAEB-FAE-Center relationships and talked to Georgs FTobst briefly\nabout the \"Big Four\" shows. He informed m that that project would bo\ncompleted by the 1st of August. Since returning hons X have received soma\nadditional smaer,ies from George on these shows."
}