{
  "id": "d264-2",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n/\nJanuary 16, 1953\nBom Wilbur Schramm\nDivision of Copcmloatlopfl\nBnXvmalty of Illinois\nUrbana, Illinois\nBear m«\nX havo boon tardy In doing what I was instructed to do last week, bat it has\nrathor constantly' been on ny mind* In vim of the fact that Greydon has csto**\ngcwissad the training assess, I think I will comment an his Ideas.\nFirst, regarding ib© Allerton Hoorn type sesalnar® It sooms to m that tho first\nquestion to mwmr hero is whether television will cause education to r©«evalu&t@\nits instructions! techniques. If our answer to the above is yes* then what is the\nhost way* to discover these nm techniques «** that is, should we (1) promote a meet®\ning of top educators to talk about TV’s or should w© (2) have a siting of HAEB plus\neducational TV people to investigate education and see how the madiun can host\nchange educational techniques^\nI an proceeding on the basis that th® latter alternative of working with educa¬\ntional TV people is the proper smmv for MBS. I will bo working the next few\nweeks on a definite proposal for an AXXarton seminar to bo held around Juno 1.\nWhether you should think in terms of an educators® seminar to investigate perhaps\nnot only television but ell zseons of eoassanieation and their relation to education\nis something else again*\nRegarding the second Amsm proposal cm the of television personnel,\nI am tom between two fires. Lot*© sake it the el^iWaonth visit versus th© two®\nweek visit. I can see xasrit on both sides. For an ©ight^aonth visit, 1 would\nwant a person to bee®® thoroughly integrated into an operation like WOMT assd\ngiven ®om status and respcosiSllity. TJnloas can ham mm respcmsibiXity\nand stature with his fellow workers, the training wouM bo wnated*\nI can ses merit in having a group or groups of four or five people make the <to»\nemit of ©sdsMng educational television, operations for twcMieak visits. This\nwould requires\n(1) A person, assigned ftdLL«tte as the host at each institution\nvisited.\n(2) The designation of one of this group as a group leader to\ncarry on inftQS«*gemip discussions on both a formal and infernal\nbasis."
}