{
  "id": "d264-28",
  "text": "sr. lcxtis educational msyisicN comssicr\nCHANNEL NINE\n303 BOARD CF EDUCATION BZDG* 911 LOCUST ST.\nST. LOUIS I, MISSOURI CEntral 8085\nCHANNEL NINE STUDIOS\nWASHINGTON UNIVERSITY\nSt. Louis 5, Mo.\nVolunteer >8722\nOctober 20, 1953\nMro Harry J. Skornia, Executive Director\nNational Association of Educational Broadcasters\nUniversity of Illinois\n119 Gregory Hall Urbana, Illinois\nDear Mr. Skornias\nHe have several questions here at KETC for t&ieh we would like your\nanswers based upon past N.A.E.B. experience in radio as well as television.\nIn setting up our operating and capital investment budgets, we were\ndiscussing the matter of amortisation and depreciation of capital equipment.\nOur accountants inform us that tbs general practice in no^-profit educational\ninstitutions is not to depreciate equipment. Is this a standard procedure\nin educational radio stations around the country? In the cost figures that\nhave been submitted to you by educational institutions producing programs under\nan N.A.B.B. grant, has depreciation been Included?\nThe next item is that of engineering azxd musicians* unions. Has there\never been any agreement made on a national scale with unions in either of these\ncategories? I am more specifically concerned with the engineering unions be-*\ncause it poses a mere liaaedlate and continuing problem. In the September meet*\ning at Ann Arbor of the Program Center, the station managers who were in\nattendance all indicated that they did not plan to have any contract or work¬\ning agreement with engineering unions but intended to have a completely non¬\nunion engineering staff. This is mere agreeably achieved in the small\nccnmonities than in the larger cities like St. Louis where even the Board of\nEducation FM Station has been unionised. George Overton, legal attorney far\nthe Center, has, I believe, been checking into the matter of the national\nagreement with the musicians* unions, but I have heard nothing further about this*\nCan the N.A.E.B. furnish ms with any information regarding libel and slander\nprecedents pertinent to educational broadcasting? Our insurance counselor is\nrecocsoending that we have some coverage in this line but before we decide I felt\nI would like to investigate the matter further with N.A.E.Bo In a commercial\nsituation I know that stations generally cover themselves with insurance, but\nI am wondering about the necessity far educational stations to do so."
}