{
  "id": "d264-38",
  "text": "TO: Officers and Directors\nNovember 3* 1953\nFROM: Harry Skornia\nIn trying to pull loose ends together at headouarters, following absence for Oklahoma\n®ati“J Convention, herewith Statement of Status of French (RTF) programs prepared\nfor HAEB, as seen from here, and pulled together hy John Holt and me. This willhelp\ncomplete the report from Sy of October 19 which we have found on our return.\nAll programs listed in the promotion brochure (Comedie Francaise #1-13)•\nContemporary French Music 13 programs? Great Writers of France (Hugo, ’\nBalzac, Stendhal, Vigny and Musset) have all been distributed.\n2)\nWe are cm-rently distributing the second 13 programs from the Comedie Francaise.\nWe have distributed the first three (Comedie Francaise #14, 15, and 16, which\nare your new numbers 3a, 4a and 6n).\n3)\nWe have distributed the first 7 of 13 French\nrest are going out regularly as scheduled-\nMusic Festival Programs and the\n4)\n5)\nIVench programs have been distributed in a steady stream since late last spring.\nThey are released as soon as we huve full series at Headquarters, sometimes before;\nand as quickly as we can fit them into our production schedule. In some eases\nwe have had to check rather carefilly to see when we had a whole series since\nsome have consisted of 7 or so rather than the 13 usually offered.\nThe following programs are at Headquarters but have not been released as yet.\nThese programs have almost all been leceived within the last two or three weeks.\nA) Comedie Francaise #17-26 (to complete the second series)\nB) Modern French Theatre #1-4 only (of a series of 13)\n0) Ancient and Modem French Music #1-5 only (of a series of 7)\nD) The French Academy #1-6 only (of a series of 7)\n6) No programs have been received for two series; Great Composers of France and\nGreat French Poets.\n7) °“e Program not listed to any series on tie dittoed sheets has been received;\nFrench Concert, \"Le Mystera des Saints lunocents\", by Henri Barraud (Time;56;40)\nItalian\n1)\nMusic from Italy #1-6 and #9 and 10 only hare been received.\nWith Columbus. ’\nas has\nOthers\n1)\nWe have received something called: \"New York P/a i^eica Antiqua,\" 13\n(What is this, Sy? We have no advance material to ten u8-) *\nprograms.\ncc: George Probst\nRobert Van Duyn\nLarry Creshkoff"
}