{
  "id": "d264-54",
  "text": "t\n2,\nwhich will require the completion of the series in order to receive the final payment\nunder the g rant*\n4) Wynnes proposal regarding top level educators meeting! The Committee agrv-jfi\nthat NAEB reports of important developments in educational radio and television shoulU\nbe cent to the Presidents of member institutions (active, associate, construction\npermit holders, etc.)* This process will be handled by the new man proposed to serve\nas Assistant to the Executive Director. Plans should be set up for an Initial ex¬\nploratory meeting of the Presidents of educational associations and institutions for\nthe purpose of discussing the problems and uses of educational station operation and\nprogram development (this group of educational leaders should include the JCET* and\nNAEB plus a representative President of a state supported college or university, a\nprivate college or university. State Superintendent of Schools, a Teacher^ College\nPresident and a representative of the school administrators* President Ausmus and Jim\nMiles are to discuss the names and recommendations for these representatives with their\nrespective University Presidents. A special Board meeting should be set up to be held\nin Sto Louis in January.\n5) The NAEg Convention Committee will be the cawolttee already set up by Sy\nSiegel for the New York Convention. President Ausmus will confirm this agreement.\n6) The Auditing Committee is to be removed from tb,\\ Newsletter at the earliest\npossible convenience. President Ausmus is to revise and set up new committee assignments\nas soon as possible.\n7) President Ausmus is to appoint a Constitutional Connaittee to work out the\nproblems of membership for multiple radio, television, and production center, stations\nand operations. The whole problem of membership and representation is to be studied by\nthe committee and a report made to the Executive Director and Executive Committee on\nfinds and recommendations.\n8) Question of funds for meetings:\na. Funds for research committee and needs approved upon receipt of founda¬\ntion funds.\nb. Funds for meeting of the i»-sehool program acceptance committee approved.\nc. Engineers trip to European meeting inaApril already approved providing\nthe funds become available from the FAE for the proposed full-time NAEB\nengineering position.\nd. Funds for meeting of the network acceptance committee approved.\ne. Funds for a meeting of the Program Development Committee approved,\nf. No funds available for travel by the Fulbright scholars. Skornia is to\nwork out the details on the Fulbright scholar exchanges and to contact\nHull, Miles and Wheatley on the status of current negotiations. Skornlx\nalso to inform them of President Ausmus5 trip to Washington in order to\nnegotiate for new and additional Fulbright scholarships. Skornia also to\nexpedite Fulbright exchange assignments if he can obtain the necessary\ndata and information."
}