{
  "id": "d264-56",
  "text": "4<\nj. (Page 16F) Scholarships and Internships: Include a statement\nspecifying the purposes of developing promising new talent. Revise\nthe expenses of the scholarships to more fully coincide with the\ntime involved* Eliminate 1 examples under facilities and staff on\nPage 19 in order to avoid impression of institutional designation\nor pre-evaluation. On Page 21 Include the overseas and nine months\nscholarships and fellowships available through the BBC and the CBB.\nThe NAEB will serve as the agency to screen and select candidates.\nThese scholarships provide 16000. plus travel for the BBC\nopportunities and $5000 plus travel for the Canadian opportunities.\nFour scholarships should be available for each, /his section also\nshould include the material from the Standard Oil request and the\nFulbright request.\nk. (Page 21G) Revise this section on the study of Communication Pub¬\nlication needs to point up the study and research angles. Requests\nfor cjaaraunication research should be added to this section. These\nrequests should include the following communication research projects.\n1. Basic research and analysis of educationalmdio and television\nprograms over the past five years in order to determine the role\nand place of educationalbroadcasting within the framework of\neducational institutions as seen by school administrators and\neducational leaders.\n2. Large scale investigation o f the role and purposes which might\nbe served by an educational broadcasting station as revealed\nthrough a sizable and significant sampling of consumer or\naudience needs or preferences in two or three typical and rep¬\nresentative areas or ccmniunities.\n3. Detailed analysis of the most effective methods of coordinating\na regular university faculty and staff into television programming\nand broadcasting activities. This analysis and study would be\ndone in cooperation with the recognized accrediting agencies and\nassociation such as the North Central Association and the Adult\nEducation Association. Additional problems for study and analysis\nwould be those of credit allocation, credit transfer, teaching\ncredit, staff compensation, etc.\n4. A Sociological study of a pre-educational station community and\npost educational station developments.\n10. Educational Television and Radio Center Request:\na. Request funds for NAEB member stations to cooperatively produce\na series on great literature or living literary works. Almost all"
}