{
  "id": "d264-74",
  "text": "December 31# 1953\nMr. C« C* Williamson\n20 Church Street\nGreenwich, Connecticut\nBeer Mr. l&lllaaeant\nYour letter to Dallas &ytho, end a copy of his reply, ware forwarded\nto do just before I loft for Dew York where I was am of the speakers\non a panel, at tho Speech Association Convention, entitled A RE«£7ALB»\nATIQK OF RADIO.\nWithout identifying you, I took the liberty of quoting from your letter,\nsince it was tho boat statement I had found of the problem of tho future\nof educational radio, and television. I hope you d©n*t mind. How back,\nI9ve had a rough outline of this talk dittoed in the hope that some of\nthe remarks night bo of value to you. I am also sending a copy of it,\nplus a copy of this letter, to both the «JCDT and the UCCET, in tho be**\nlief that the suggestion you raise nay find recognition. I believe it\nwould be a great tragedy if educational and oconunity groups did not\ntake into account tho need for integrated and coordinated planning\nusing both radio and television, and all other media, for that matter*\nIn may eosasunlties as late ae 1953# radio, sosaotimss ovaa Hi, was\nfound to be not only a definite step towards television but also a\nvaluable end in itself, for not all can (yet) afford TV*\nThe attached outline is the one I used for ay talk. Tbs fact that\ntli© remarks of other participants are reported more briefly doesnH\nmean that their remarks weren’t as good, or as long as min©, but\nrather that their talks were so interesting I became too engrossed to\ntako adequate notes, and only Jotted down th© one thought or so which\nparticularly struck me, or I hadnH known about before;\nI hope aH this nay be of does© value to you* In all reports of the\nHABB we have stressed tho need to consider and study all wireless\nmadia rather than putting aH eggs in one basket. This view is being\nconfirmed as time goes on, even though recant IIAEB emphasis in publications,\nworkshops, seminars and services has had to be heavily on television for tho\nlast year or two, and will be so for souse time."
}