{
  "id": "d559-125",
  "text": "- 2 -\nRepresentation at Meetings\nIt has come to the attention of various members of the P.R. Committee\nthat there is a lackof NAEB representation at many meetings of learned\ngroups. Since the membership of the Committee encompasses most of the\nareas of the United States, the chairman of the committee has offered\nto provide as far as possible such representation from the membership\nof the committee, in each case selecting a member sufficiently near the\nplace of meeting to free the NAEB of all expense.\nPromotion Slides for NAEB ET Stations\nAt the request of Headquarters, suggested copy for TV slides promoting\nNAEB (and the member station) as well as quotations have been prepared\nhave h©cn submitted to the Board for approval.\nLapel Pin Proposal\nA proposal has been made that NAEB adopt an official lapel pin.\nSeveral designs have: been made and circulated to Committee members.\nAs of now, those of the Committee who have commented are perfectly\ndivided on the idea. Those favoring the idea of a pin have each\nfavored a different design; one member does not like the idea of a\npin. On this point the Committee earnestly requests the comments of\nits constituents.\nUp-Grading the P.R. Manual\nDuring the course of the year your Chairman solicited and received\nfrom various members of the Committee numerous suggestions and ideas that\nmight be incorporated into future editions of the Manual.\nP.R, Article\nAn authoritative illustrated article entitled \"Personalized Public\nRelations was prepared by Committee Member Marion Corwell for publication\nin the NAEB magazine.\nj^,.cellaneous Ideas and Suggestions for Further Consideration\numbus\nthose\nFULL TIME NAEB P.R. PERSON- initially approved by Committee at Col-\nmeeting—later objected to by some absentee members as well as by\nvoting for proposal—currently impossible for budgetary reason.\nWIDER USE OF NAEB OFFICIAL LOGOTYPE - self-explanatory.\nADOPTION OF AN NAEB MUSICAL SIGNATURE - never discussed."
}