{
  "id": "d559-128",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPublic Halations Committee ? -eeting\nMarriott Motor Hotel, Washington* D* G»\nOctober 23, 1961\nThe meeting of, the\" t]AEH Public ° 1n11 s Q\"\\ irf to order\nat 11:10 A.M. by\nMembers present were: Lillian Brown\nFrances Butler\nMarion Corwell\nHarold Engel\nRoy Flynn\nHenry Memet\nLou Peneguy\nT. M* Williams\nBetty McKenzie represented the HAEB Staff\nMembership Pin\nChairman Sulzer opened the meeting with some general remarks concerning\nthe objectives of the committee* First item of business was discussion concerning\nthe proposed NAEE membership pin* The committee agreed to recommend to the\nBoard that a membership pin is not needed*\nSpeaker's Guide and Public Relations Kit\nA Speaker's Guide supplying topics for NAEB members to utilize in preparing\nlectures, and a Public Relations Kit were discussed* Betty McKenzie reported\nthe MSB Board concurs in the desirability of the Speaker's Guide, ae long as costs\nare limited to $100, and mimeographing rather than printing is employed in pro¬\nduction of the materials* The committee agreed the Public Relations Kit and Speaker*\nGuide should be prepared but felt that an attractive lay-out should not be sacrificed\nto keep the cost at $100a Chairman Sulzer assigned Henry Mamet to investigate cover\ndesigns and determine contents for the PR Kit, and.Marion Corwell to select subjects\nfor speeches to be included in the Guide. Chairman Sulzer will assign speech writers\nRoy i'lynn suggested the advisability of including choice quotations in the Speaker8s\nGuide which could be incorporated into speeches. Ha was assigned the responsibility\nof compiling a list of quotes for use in the Guide*\nPromotion Slides\n»\nChairman Sulzer reported that Indiana University could produce the television\npromotion slides for $10.«60 a dozen* Lou Peneguy recommended that this source be\nutilized in producing the slides. The committee agreed to recommend to the Board\nthat a slid© be given to every NAEB T? member. Any additional slides would be\nsold forUTOO eacru ---"
}