{
  "id": "d1780-1",
  "text": "Jlitwn&l\nThe 'training of men for war has focused attention\non technical fields, many of which are included in the\nLiberal Arts curriculum. Other academic studies,\ntemporarily obscured, remain as the foundation of\nour culture and will be the stabilizing influence in the\npost-war period when our people return to normal\nliving. To provide an informational background for\npresent conditions and to foster continued interest in\ncultural subjects, the Liberal Arts Division is present¬\ning a program each Wednesday at 5:30 P. M.\nParticipating on the broadcasts will be representa¬\ntives from the Departments of Art, Economics, Edu¬\ncation, English, Foreign Languages, History and Po¬\nlitical Science, Journalism, Mathematics, Music, Psy¬\nchology, Sociology and Speech. The programs ar¬\nranged by Dean L. C. Emmons of the Liberal Arts\nDivision, will include many interesting and unusual\nfeatures.\n2.um&Ua*i £&&\nThe successful production of food, so vital in this\nyear of war, involves much more than just the plant¬\ning of crops or a numerical increase in young animals.\nMany questions of management, feeding, insect con¬\ntrol, cultivation and harvesting must be answered\nbefore the crop becomes food. To answer these ques¬\ntions from listeners, the Farm Question Box returns\nto the air each Monday and Friday at 5:30 P. M.\nDesigned as a clearing house of information for\nthose who have special problems, the panel is drawn\nfrom the specialists in the Agricultural Extension Di¬\nvision who are called upon to solve similar problems\nin their daily work. The chairman for the broadcasts\nwill again be J. G. Hays, Extension Specialist in\nDairy Husbandry, who is known throughout the state.\nQuestions may be sent in by listeners for answer on\nthis program, in fact it is these questions which pro¬\nvide the material for the broadcasts. Questions may\nbe mailed to J. G. Hays, Farm Question Box, WKAR,\nEast Lansing.\n9nj/a^*naUa*t\nTo assist in the successful achievement of food pro¬\nduction goals, two new programs have been sched¬\nuled which will be of interest to all farmers. The\nproblem of adequate labor to plant and harvest crops\nis extremely important. Each Saturday at 1:05 P. M.\nA. B. Love, State Supervisor of Emergency Farm\nLabor, will describe conditions and the plans being\nmade to alleviate the situation. Mr. Love is in charge\nof organizing and coordinating all the agencies work¬\ning to provide necessary farm labor.\nLosses in farm animals and poultry due to disease\ncan greatly reduce the meat supply. Much of this\nloss can be prevented through wise management or\nearly control. The Animal Pathology Department\nwill discuss the control and prevention of disease in\nfarm animals in a weekly program each Tuesday at\n1:30 P. M. The programs are arranged by B. J. Kill-\nham, Extension Specialist in Animal Pathology.\n3>*a*natic W&JzdJwfL\nProducing plays by some of the leading writers for\nradio, the Dramatic Workshop of the Air broadcasts\neach Thursday at 4:30 p. m. By special permission\nof the author, this group of student actors is currently\npresenting a series of plays by Norman Corwin, one\nof the most prominent radio playwrights. Mr. Corwin\nis best known as the author of “Bill of Rights,” which\nwas produced on all networks about a year ago, and\nfor the series, “This Is War.”\nThe Dramatic Workshop is directed by Joe Callo¬\nway, instructor of radio in the Department of Speech.\nSummed Sckedidmi,\nThis is the final issue of the WKAR printed pro¬\ngram bulletin until October. As has been the custom,\nno advance programs will be mailed out during the\nsummer but a full schedule of broadcasting will be\nmaintained. The station will be heard each day from\n7:00 A. M. to 7:00 P. M., Eastern War Time and many\nof the favorite features will be continued throughout\nthe summer months. For detailed review of the days’\nprograms, hear the Calendar for the Day each morn¬\ning at eight o’clock.\n*7<4e Stall\nDirector of WKAR Robert J. Coleman\nChief Engineer.. .Norris E. Grover\nProduction Director Walter J. McGraw\nAnnouncers.Phil. Molloy, Lawrence Frymire, Richard Schubel,\nCharles Sutton, John Hays, Jack Osgood\nNews. .. .Dick Murray, Carlisle Carver\nOperators John Isatala, Raymond Wilson, Joe Archambault,\nWilliam Winters, Robert Parkhurst, Robert McKay,\nHugh Murray, Carl Osburn"
}