{
  "id": "d1619-0",
  "text": "Office of Executive Secretary\nUrbana, Illinois\nJanuary>1* 1941\nURGE CRaNE FOR FCO VACAKC Y\nThe Executive Committee of NaEB and the association in Convention\nat Chicago not only endorsed Or, Arthur G. Crane for the appointment\nto fill the present vacancy on the FCC, hut also have urged active\nassistance by the NaEB members, Many have already responded. To\nNaEB, President Crane writes: “Please express my appreciation to\nNAEB for its help.” Don11 let the campaign lag, hoiTever.\nSTATEMENT fro:.! aSCAP\nOn December 23rd, Mr. Gene Buck, President of ASCAP, issued the\nfollowing statement:\n“ASCAP has always given a completely free license for use of the\nworks copyrighted by its members on all non-sponsored, non¬\ncommercial programs broadcast by religious, educational and\nfederal agencies. It has no intention whatever of tieparting\nfrom that'policy. Our members have always bean, and are still,\nglad to contribute the entirely free use of all of their copy¬\nrighted musical compositions to the purpose of religion, education\nand the government. Not only this, but we have in mind that\nnothing should interfere with the primary requisite of broad¬\ncasting franchises, and that is that stations shall be operated\n•in the public interest, convenience and necessity,* Therefore,\nit may be stated as our official position that any religious,\neducational or federal entity, broadcasting non-commercial\nprograms over stations which have contributed the free use of\ntheir time for that purpose will, upon application to our Society,\nreceive an absolutely free license granting the use of all of the\nmusic of all of ouf members on such programs.“\nBMI CLAIMS 95% OF INDUSTRY\nOn the same day as the statement regarding use of music for educ¬\national purposes was issued by Mr, Buck, BI..I claimed more than\n95 per cent of the radio broadcasting industry, including more\nthan two-thirds of the independent stations in the United States.\nDEPARTMENT OF JUSTICE ORDERS PROCEEDINGS\nThree days after the ASCAP and BMI statements, Attorney ueneral"
}