{
  "id": "d754-20",
  "text": "MEMO\nTO:\nFROM:\nSUBJECT:\nRegion II NAEB Friends\nJim Etheridge, Iird&viduad^toember Director,\nRegion II, NAEB -\nPlanning-Conferences for Region II Meeting,\nWilliamsburg\nI am deeply grateful to all of you who attended the first\nplanning session in Washington -- and to those of you who very much\nwanted to attend but were unable to rearrange your commitments on\nthe short notice I had to give.\nI am sure that you join in my gratitude, also, to John\nYoung for accepting the General Chairmanship of the Region II\nConference to be held at Colonial Williamsburg, Virginia, March\n19-21, 1965. I have asked him to appoint whatever Conference\ncommittees that he and our Virginia hosts deem necessary for plan¬\nning, promoting, and programming and conducting the Conference.\nIn addition to my geographical remoteness from the intri¬\nguing site of the Conference, my personal plans are so uncertain\nthat I could be of only limited help to our good Virginia hosts --\nwho, by the way, are arranging unusual events which will be ex¬\ntremely attractive to Region II members, colleagues and families.\nWhile I plan to submit to the Williamsburg Conference\ncertain recommendations relating to Region II organizational\nstructure, it is necessary now that a SITE SELECTION COMMITTEE\nfor the 1966 Conference begin considering -- or seeking, if\nnecessary -- invitations for the site of the 1966 Conference.\nI earnestly hope that the following will accept appointment to\nthis SITE SELECTION COMMITTEE:\nName\nHr7~Howard Holst, CHAIRMAN\nMr. L. 0. Press, VICE-CHAIRMAN\nMr. Duff Browne\nMiss Dona Lee Davenport\nMr. James Petersen\nAddress\nTOTTV, Memphis, Tennessee\n2580 Millbrook Drive\nLexington, Kentucky\n130 Sixth Street, N. W.\nAtlanta, Georgia\n1510 Exeter Road\nCharlotte, North Carolina\nFlorida Atlantic University\nBoca Raton, Florida\nWe will look forward to a specific recommendation from\nthem for Region II members to vote on at the Williamsburg Conference.\nMy deepest thanks to all of you.\nPS--It would be nice if each of us could sign up two or three new\nindividual Members of NAEB, wouldn’t it? Three blanks enclosed!!"
}