{
  "id": "d754-26",
  "text": "3\nMelvin E. Knight, P. 0. Box X, University, Alabama (Broadcasting Services of the\nUniversity of Alabama)\nW. R. Knight, Jr., 1718 Hurt Building Box 2211, Atlanta 1, Georgia\nRoger W. Koonce, WUNC-TV, Chapel Hill, North Carolina (University of North Carolina)\nH. L. Lackey, 801 Owen Building, Columbia? S. C. (Southern Bell Tel. & Tel. Co.)\nC. Wesley Lambert, 234 Stadium, Univ. of Florida, Gainesville, Florida (WUFT-TV)\nEmmett Langley, 447 Bull Street, Savannah, Georgia ( WVAN-TV)\nR. LeRoy Lastinger, WEDU, 908 S. 20th St., Tanipa, Fla.. 33 605 (Fla. West Coast ETV, Inc.)\nOwen M. Lee, Jr. 908 S. 20th Street, Tampa, Fla., 33 605 (Fla. West Coast ETV, Inc.)\nE. R. Lowder, 1900 Barnwell St., Columbia, S. C. ( Dixie Radio Supply Co.)\nMarion Lowry, 712 SW 13th Street, Ft. Lauderdale, Fla. (Broward County Board of Public\nInstruction)\nMr- Alan B. MacIntyre, WUNC-TV, Chapel Hill, North Carolina 27515, Consplidated\nEngineering Office (WUNC-TV & N. C. ETV Network)\nJohn D. Mandelbaum, 4313 Knox Road, College Park, Maryland 20740 (Graduate student\nUniversity of Maryland)\nDavid W. Marxer, P. 0. Box 1101, University, Alabama (Broadcasting Services, University\nof Alabama ( Ala. ETV Network)\nWilliam G. Mitchell, 704 Seagle Bldg., Gainesville, Florida (Asst. Dean, Division.of\nRadio & Television, Florida Institute for Continuing University\nStudies)\nRon Mullanix, Box X, University, Alabama (Broadcasting Services, University of Alabama)\nAndrew R. McMaster, P. 0, Box 6188 - Acklen Station, Nashville, Tennessee 37212 (WDCN-TV)\nMrs. Marjorie Newman, 116 Music Building, Florida State University, Tallahassee, Fla.\n(WFSU-FM - Program Director)\nA. Edward Ooghe, Jr., 809 East. Marshall Street, Richmond 19, Virginia.(Richmond Public\nSchools)\nLaura E. Owens, 723 N. Atlantic Ave., Daytona Beach, Florida (East Williston (Long\nIsland) N. Y. Schools)\nMiss Iola Parker, Television Education, Room 482, Education Building, Raleigh, N. C.\n(North Carolina State Department of Public Instruction)\nJ. Edward Penn, Rt. 1, Box 35A, Auburn, Alabama (Educational Television Department,\nAuburn University)\nJohn S. Peterson, Box 642, Memphis State University, Memphis, Tennessee (WKNQ-TV,\nProduction Manager)\nDavid E. Platts, 6605 Fifth Ave., North, St. Petersburg, Florida 33710 (Radio-\nTelevision Department, St. Petersburg Junior College)\nA. Gordon Reel, P. 0. Box 6188-Acklen Station, Nashville, Tennessee 37212 (WDCN-TV\nProducer-Director)\nHarrison H. Riddleberger, 908 S. 20th Street, Tampa, Fla. 33605, WEDU ( Florida\nWest Coast ETV, Inc,)\nMr. Jim Rogers, WVAN, Pembroke, Georgia\nMrs. Mary Rogers, 480 Ridge Road, Birmingham, Alabama 35206 (Birmingham Area ETV)"
}