{
  "id": "d754-39",
  "text": "Rogr J • Johnston\nFtbnuiy 18, 1961*\n, ■ _ ***•»■ «*«4nac • up and th» totm Airlino flight aebedulaa.\nIt looka Ilka w would hart aararal food poaalbllltlMi\nAtlanta la tha aoat atally roaahad of tha largo eltloa in tha\nrogion. It haa tha advantage of having tbroo aehool arataaa. Atlanta\n2iS* “d ®,wb cM«Uw, wing ITT throogh tha faellltlao of\n«y- ^ ** ■+>**\"&* m «*two*k. Tha SBD\nOff ion is thorn and oould bo hilffil 1b tbs planning sad dovolopaoit\nof tbs aootinf*\nTsllahsasss is also ooolOy is Mind bp tbrss flights tram\nAtlanta aa Bottom oath dagr. Slnoo HD, and tha Florida m CowOwioa\noffioo ara thoro. and thaw la a lot of good bslng dans la tha state as\na part af tha nataork afforta, thU wold ba a good i—\n, 11 •••11/ roacbod, hat aatfallj far daw In tha atata\nwd that about aa far roaovod frao tha raat of tha roglon aa w oould\ngat. Thorn la a lot af good bolng daw than, and plant/ of rnurliwad\npaoplo (including Mr. Bronaon) wait/ aha would ho valuable partiolnanto\nat o wotlag of thin t/po. BatTaUU qwatlw tha dliSaaST^\nthil* obant tha laaatian and who know, nqrbo\n~ will bo lntorootod onoagh to nwt to ‘ \"\nfor tfala at OnlaWla (g.C.).\nHa oaght to bo tMaklag too dkant aha w ahaald aak to ba on\ntha progrwa. I havw't hawd uyuna yot who ww w in tha-owrlnt wd\ninaplrational aa Oharlaa Slapaaw. Ba la aspawlwa, though, and iota\nonough paagla havw board bin la tha wot that ha would haawai\nold-hat. feavo *i|ttag wwgr for thla aort of thing? if aa,\n!* «\" *» P^»Pl* ftwn out of tha raglaa, frw tha Watt an\nUfca Bag* rat aw, ota. Thaga wet ha lata af goad pooola. tad tha\nlaadaraUp la Bashlagtw aw hnlp w In tha laaatian af tha right\nTs« buss, ustbsr thought* • • vs Bight mt hsld tbs —11m\nrMht.ln Hwhlngtw, and than paapls frw tha whole eastern waboard\naowld attend. Cortoinl/ w would pcwflt frw a aharlng with tha TaWowl\nBa w want a largo now netting, or a wall aaafaranwf hhldi would ha\nwat affadttw and nwt bawflalal far OUT Wm you «w atthewWiw\nla Missouri, ahgr don't pou nates sons asatil astss sbsat tbs pgablatf,\nmSE^oT.S £££ ~f~* • • <*• ha a gwd poUt\nMl, thla in ah\nto gat It aff Wlla it wo\nto tho Jonr Apnr atogo af\nww gala who wara wordy l\nfar tna. . . hat ;\n1* w Mad. Lot'a bopa I\npa«Mt tahl takl And I'\nIt\niNUMtaUr, thanha far asking w to load «__ „\nlastiwtlan. I appiShftaM tha.aosgUwnt wd if I fait It waa really\nwttlgl wU dm I woald. Bat, w S*Sd\nJ* VS hsrdlj la a pasltlaa right ass to bs tsllixig\n•wmv bsv, md utgr, «sd to do If? la sshssla* That vsnld bs tbs"
}