{
  "id": "d754-62",
  "text": "£<? So\nbe:\n/r\nMr. Harold Hill\nOctober $, 1962\nMr. Raymond Hurlbert\nGeneral Manager\nAlabama Educational Television Commission\n2151 Highland Avenue\nBirmingham 5, Alabama\nDear Raymond;\nIn response to your letter of October 3 concerning my serving as\na consultant to the radio section of the RAEB Region II Conference\nnext March, I am sure you know that I am more than pleased to make\nany contribution I can to this or any other section of the meeting.\nI trust you or Len will let me know more specifically what I may\nbe expected to do as you develop the plans in greater detail.\nMay I raise a question concerning scheduling of the radio sessions\nprior to the TV sessions. If I am not mistaken, this same plan\nhas fallen through two or three times in the past. In many cases\nthe radio people are traveling with the TV people and the group as\na whole could not arrive until the actual kick off of the entire\nconference. I have not made an acourate count of the number of\nactive and associate members in Region II who are involved pri¬\nmarily in radio as opposed to TV, but I think a careful check\nmight show that the numbers are about equal. In any event, there\nis a sizable membership interested in radio. My impression of the\nlast three or four regional meetings is that, for one reason or\nanother, comparatively little time has been devoted to radio; the\nbig emphasis being on TV.\nI do not Intend this comment as a criticism of what has been done\nand I may be entirely inaccurate; but I strongly urge that radio\nbe given more emphasis at the next meeting, even to the extent of\ndevoting some of the major sessions to radio. My reasons for this\nsuggestion are two fold. In the first place we have a significant\nnumber of radio-involved people in Region II and their interests\nand problems should be served in these meetings. Secondly, educa¬\ntional radio is at a precarious point nationally. Many institu¬\ntions, Including my own, are now questioning the value of contin¬\nuing the radio station operation as television becomes increasingly\ndynamic. I am told by the NAEB national office that a wave of\nnegativism toward educational radio Is sweeping the country and\nthere is much concern that we will see the demise of a number or\neducational radio stations before the trend turns. This is es¬\npecially true in the case of PM stations."
}