{
  "id": "d400-11",
  "text": "- 2 -\nconnection with their other proposed programming”. The FCC went\non to point out that non-commercial educational television stations\non an experimental basis have been on a number of occasions permitted\nto transmit ”scrambled” signals which could be viewed \"unscrambled”\non specially adapted equipment. The FCC went on to point out that\nKCET in Los Angeles has filed with the Commission a petition for\nrulemaking to permit the encoded transmission of medical and police\ninstructional programming by non-commercial educational television\nbroadcast stations on a regular rather than on an application by\napplication basis. The Commission pointed out that the petition\nfor rulemaking is presently pending and could lead to the building\nof a record on which to base decisions concerning STV over edu¬\ncations stations. I concur in your advice therefore, that there\nis little need for NAEB to comment in docket 11279 for the carriage\nof subscription television signals by CATV systems, unless we were\nsimply to file comments referring to the KCET petition for rule-\nmaking and to our intention to file extensive comments in that\nproceeding if it is made the subject of rulemaking, and to request\ntherefore that the petition be granted. It seems clear that the\nlatter matter is the appropriate platform for ETV comments. I will\nseek staff concurrence or disagreement with this proposal and will\nreport to you within the next week.\n4. Docket No. 18433 is a Notice of Proposed Rulemaking to\nrequire comparable ease of tuning for UHF and VHF stations on TV\nreceivers. Although the points on which comments are specifically\nrequested are generally technical in nature, it seems logical that\nNAEB should file a simple statement concurring in the importance\nof requiring sets at the earliest practicable date to be equipped\nwith tuning devices which will insure equality in the ease of\ntuning VHF and UHF television channels and will insure parity in\nthe quality of such tuners. Comments are due March 21st,Reply\nComments by April 4th. I will ask NAEB staff to react to this\nrecommendation.\n5. NAEB Executive Staff agrees that the NAEB should file\ntestimony supporting the proposed rulemaking to permit the operation\nof low power FM broadcast translators and booster stations and\nrelaxation of the operator requirement. It is not contemplated\nthat we will offer any engineering support in this filing but that\nthe statement be general in nature. In speaking with you I under¬\nstand that you will contact Bob Mott who presently has my FCC\nfile on the docket and who will be prepared to discuss NER/NAEBTs\nattitude with you at more length.\n6. I called Bob Mott’s attention to the FCC’s denial of the\npetition by Bower Broadcast Products Division of Granger Associates\nfor amendment of the rules to increase the permissable transmitter\noutput power for non-commercial educational FM class D stations\n(RM 1273). I think if I understood correctly that you had indicated\nthat the language of the denial might prompt NER to file some kind\nof supplementary comment in docket 14185 (FM Table of Allocations).\nI have a memo from Bob Mott which says:”I see no need for any\naction at this time. What is needed is speed on the part of the\nr*.\n' v\\C"
}