{
  "id": "d400-12",
  "text": "- 3 -\nCommission to complete the Table of Allocations. Until then I\nsee no need for NAEB/NER to involve itself - unless information\nof which ITm presently unaware is called to our attention.”\nThat decision satisfies me, certainly, if it satisfies you. If\nyou think this needs further discussion, it might be well to\nhave it directly with Bob when he calls you in the matter of\ndocket 17159.\n7. The opinion letter on the subject of the Fairness\nDoctrine as it applies to pro and anti smoking spots and com¬\nmercials has been transmitted to ETS/PS. It has not yet b^en\nput into a memo to stations, pending Bob Hutchins (Public Health\nService) reaction. He has been the administrator of the smoking\nand health project and asked ETS/PS to hold off for a few days\nuntil he could react thereto. He is expected to call Dave Leonard\nin the next few days at which time the material which you so kindly\ndeveloped for us will be in all probability transmitted as recom¬\nmended.\n8. A reminder as much to myself as to you that Comments are\ndue to\"be filed on February 10th in docket 18179 a Proposed Rule-\nmaking to Amend Part 73 of the Rules with respect to television\nprograms produced by non-network suppliers and not made available\nto certain television stations. We have already determined not\nto file Comments but to search the docket after comments have\nbeen filed in the event that it becomes appropriate for us to\nfile Reply Comments which are due on March 10th.\n9. I will poll the Staff at the next opportunity to inquire\nwhether NAEB wishes to comment on the proposed rule amendments to\npermit remote control of VHF television stations. My impression\nis that we will wish to file supportive comments although I doubt\nthat we will want to go into deep engineering justification for\nour position. Comments are due March 28th with Reply Comments\ndue on April 11th. IT11 be back to you on this one shortly.\n10. Finally a paragraph of miscellany:\na) After conferences with the appropriate members of\nthe staff we decided not to file in the rules pro¬\nposal in docket 18426 governing the implementation\nof the 1968 law on devices interferring with radio.\nThere seemed to be no area in which we were intimately\nconcerned - we therefore determined not to file.\nb) On advice of Lou Schwartz we have taken no public\nposition in docket 18430 with reference to amendment\nof the Table of Assignments for television broadcast\nstations at Annapolis, Maryland and Seaford, Del.\nc) We have been in touch with David Chapman of the Va.\nCouncil on Educational Television with reference to\nthe substitution of the Channel 54 for Channel 33\nat Lynchburg, Va. (both reserved channels). Va.\nhas advised that they will probably not file any\nrequest for reconsideration in this matter but\nappreciates being alerted. They will advise us\nif there is any change in this decision,\nv * x n ' ’"
}