{
  "id": "d400-15",
  "text": "NAEB STATEMENT\nDuring Cral Presentations on February 3, 1969\nBefore the\nFEDERAL COMMUNICATIONS COMMISSION\nOn Proposed Rulemaking for CATV (Docket 18397)\nRead By\nNorman Jorgensen of Kreiger & Jorgensen, NAEB Counsel\nMr. Chairman, members of the Commission: I appear here today\non behalf of the National Association of Educational Broadcasters, an organiza¬\ntion, well-known to the Commission through its participation in Commission\nproceedings concerning educational radio and television. The NAEB interest\nin today's docket is not perhaps as wide-reaching as the interests of others\nyou will hear from this week but our concern in CATV matters is profound\nand already a matter of record with the Commission. In order that I might\nput one aspect of the NAEB's comments today in focus, let me go back to the\nCommission’s Docket 17597, the Notice of which was released by the Com¬\nmission on July 14, 1967. This Docket proposed a rule change that would\nexclude distant educational television signals from the hearing requirements\nof Section 74. 1107. The proposed change would have shifted the burden of\nproceeding and persuasion in such signal importation cases to the local\neducational authorities.\nNAEB filed an opposition to the proposed rule change; it could find\nno sound or valid reason why this burden of proceeding and persuasion should\nbe changed. I will not repeat our arguments made in Docket 17597 here. For\nthe moment it is sufficient to note that this rulemaking proceeding has not been\nofficially resolved.\nAlthough Docket 17597 has never been finally disposed of by the\nCommission in any Memorandum Opinion and Order, a reading of the pro¬\nposed Sections 74. 1107(b)(c) and (d) of Docket 18397 read as though the\nCommission had already aopted its proposal of that July 1967 Notice. All\nof these sections of the proposed rules place the burden of proceeding upon\nthe educational authorities to come forward under the provisions of Section\n74.1109. NAEB on behalf of educational broadcast interests vigorously\nopposes these proposals.\nWhy this burden should be placed upon ETV interests has never been\narticulated by the Commission. These non-profit, non-commercial educational\nstations have neither the funds nor the personnel to maintain constant vigilance\nin these matters. Nor do they have the funds to initiate proceedings of this\nkind before the Commission. In Docket 17597 the Commission claimed the pro¬\nposal was aimed at Administrative convenience. However, as Commissioner\nCox pointed out in his dissent there, that, if the Commission had not received\n•a significant number of objections in this sector of CATV regulation, a rule\nshifting the burden for proceeding cannot add to Administrative Convenience.\nAs a matter of practical fact, the contrary is distinctly possible."
}