{
  "id": "d400-16",
  "text": "-2-\nIn past situations ETV stations have persuaded CATV operators not\nto carry conflicting distant signals. And, this has occurred in early stages of\nCATV system planning. The very existence of the existing rule which places\nthe burden of justification for carrying the distant JTTV signal on the shoulders\nof the CATV system operator has been the catalyst for negotiations between\nCATV and ETV interests. Thus, without this catalyst Administrative burdens\nmay be increased, not lessened for the ETV interest without the aid of the\nrule would have to seek Section 74. 1109 relief.\nIn this proceeding the Commission has said \"The unfair competition\naspect (of CATV signal importation) must be eliminated\" (541). This is said in\na straight-away commercial context. But it is true also in ETV. These educa¬\ntional stations draw their financial support from their viewers and that support\ncannot be fragmented. Sucn a station has deep ties with its community -- it\nplans, prepares and schedules programming closely geared to the community's\nschool needs and its social and cultural needs. As the Commission said in its\nSecond Report and Order on CATV, 6 RR 2d 1717 at 1762, \"CATV cannot\neffectively provide this carefully planned and prepared service by indiscrimin¬\nately ini porting signals from distant educational stations. . . \" And, the Com¬\nmission added in this same Report, \"It would be plainly inconsistent with (the\nnational policy of encouraging the full development and expansion of educational\ntelevision) to accord educational stations less protection than commercial\nstations. . . Considering the continuous financial struggle of ETV and its\ndependence upon local financial support and interest, we think that the possi¬\nbility of adverse effect is sufficiently strong to warrant some special pro¬\ntection for ETV.\" Ibid., at 1763.\nToday NAEB is not asking for \"special protection. \" Rather we are\nasking for the \"same\" protection. Continued healthy maintenance of educational\ntelevision operations, and continued development of these facilities across the\ncpuntry, require that the non-commercial educational television station should\nnot have less than the same protection offered to commercial television stations\nin preserving local television broadcast service.\nBecause the rules proposed in this Docket are to govern CATV\noperations for some period of time to come as interim measures, it is essential\nthat Sections 74. 1107(b)(c) and (d) be revised at once. NAEB suggests that the\nwording of the rules be changed as follows:\n1. In 74. 1107(b) substitute the word !’any\" for \"commercial\" and\ndelete the two \"provided\" clauses.\n2. Likewise in 74, 1107(c) substitute the word \"any\" for \"commercial\"\nand delete the \"provided, however\" clause.\n3. The language of 74. 1107(d)(4) should read \"The system may carry\nthe distant signal of one non-commercial educational television station obtained\nfrom the nearest community with an operating non-commercial educational"
}