{
  "id": "d400-23",
  "text": "26509\nReport No. 7805 BROADCAST ACTION January 10, 1969 - B\nCOMMISSION PROPOSES FM TRANSLATOR, BOOSTER RULES\nSteps toward establishment of new FM translator and booster\nservices have been taken by the FCC in a Notice of Proposed Rule Making.\nThe idea, first suggested in a Notice of Inquiry in Docket 17159, February 1,\n1967, is to extend FM to areas with uneven terrain and to poorly served areas.\nVirtually all comments in response to the inquiry favored an FM service\npatterned on TV translators.\nTo its rule making proposal, the Commission attached a set of\nsuggested rules for FM translators and it said that it also proposed counter¬\npart rules authorizing FM boosters. Although translators are in regular\nuse to extend TV coverage, the only such operations authorized for FM have\nbeen on an experimental basis. Translators retransmit an originating\nstation's signal on a different frequency. Boosters are repeating devices that\namplify and retransmit a signal on the same channel as the originating station*\nDescribing the need for such ■ services, the Commission said that\nlocal reception sometimes is unsatisfactory because of mountains or hills\nblocking line-of-signt transmissions. Some comments in the inquiry also\nclaimed a need for service beyond the regular coverage areas of FM stations,\nand the proposed rules provide for this. \"We do not find it desirable to re¬\nstrict FM translators to gap-filling within predicted service contours of\nregular FM stations, provided that in individual cases a need is shown for\nFM translator service farther out,\" the rule making notice said. However,\nstations would not be allowed to place translators outside their own\nareas and within the areas of other stations. \"This would permit FM\nstation licensees, in effect, to increase their audiences and service\nareas in places where they would compete unfairly with one or more regular\nFM stations without having the burden of providing local program origina¬\ntions,\" the Commission said.\nGenerally translators or boosters would be licensed either to local\nFM stations or organizations representing local inhabitants under the\nrules proposed*\n(Over)"
}