{
  "id": "d400-24",
  "text": "2\nAlthough FM translators would have the sole function of rebroad¬\ncasting the signals of stations or other translators, a translator could be\nused incidentally to relay signals to other translators provided it is ful¬\nfilling its basic function of service to its vicinity.\nLimited translator originations would be permitted. They would be\n\"confined to no more than 20 seconds per hour of matter seeking or acknowledging\nfinancial support for the translator. Such announcements may include adver¬\ntising messages of contributors.\" .\nInitially translators would be authorized only on the 20 Class A\n(small-community) FM channels for commercial-station rebroadcast and the 20\neducational FM channels for noncommercial rebroadcast. Operation would be\non condition that they cause no interference to regular radio reception.\nPower would be limited to one watt. Although some parties responding to\nthe inquiry wanted more power, the Commission said, \"...We do not envisage\nthe translator as an instrument for providing wide area coverage but rather\nas a device for supplying service to concentrated clusters of population\nwho are, generally, without service.\" It did say it expected that some high\ngain transmitting antennas would be used to provide effective radiated power\nof 10 to 20 watts for greater coverage in given directions.\nFM translators would have to be staffed by licensed operators because\nthe Communications Act requires this, with a single exception for TV trans¬\nlators, \"The Commission will seek an amendment broadening the exception to\ninclude FM translators,\" the notice said. \"Meanwhile, we shall have to re¬\nquire that FM translator operation be by an operator holding a restrictive\nradiotelephone operators permit’.\" Holders of such permits are not required\nto have technical qualifications®\nFM translators or boosters would not be authorised within 10 miles\nof the U*S.-Canadian border until the two governments agree on arrangements\nfor interference protection and notification*\nInterested parties have been invited to comment on the proposals\nby February 17* Reply comments will be due March 3e\nAction by the Comission January 9» 1969 s by Notice of Proposed Rule\nMaking (Docket 17159)* Commissioners Hyde (Chairman)* Bartley* Robert £« Lee*\nCox* Wadsworth* Johnson and H. Rex Lee*\n- FCC -"
}