{
  "id": "d400-29",
  "text": "JANSKY & BAILEY BROADCAST-TELEVISION DEPARTMENT\nheight measuring techniques which sample fields over a 100-500 foot interval.\nFrom these data a calibration factor can be derived for 10-foot mobile\nmeasurements within appropriate sectors. The sectors necessary may be\nseveral miles long in smooth terrain and perhaps as short as two miles in\nrough terrain. Any appropriate number of sectors may be established con¬\nsistent with the methods discussed extensively in TASO documentation depend¬\ning upon whether one is determining field strength distribution along a\nradial or in a town or city. This measurements proposal can therefore be\ndescribed as incorporating the TASO method using data taken where specified or\npractical at the 30-foot height correlated with mobile data between such\npoints taken at the 10-foot height adjusted by a sector height-gain\nfactor uniquely determined for that sector.\n3. The Federal Communications Commission can establish procedures for\nthe particular type of field strength situation requiring analysis which will\npromote comparable results when employed by independent observers or when\nused at different times by the same observer. In this connection the analysis\nof time fading factors and location probability functions as elucidated by\nthe Federal Communications Commission Engineering Department in its Third TV\n\"Freeze\" Report of March 24, 1951 represents a true benchmark for these con¬\nsiderations. One does not deal with contours as in the Standard Broadcast\nsense but rather with \"Service Limits\" which are statistical in nature.\nFurthermore, Grades of Service are based upon employment of receiving antennas\nof specified gain and other specific system characteristics. Terrain factors\nand time fading factors are included in the definitions of Grade A and Grade\nB Service. For example, in establishing these service probabilities for the\nGrade B case the Commission assumed antennas with a 6 db gain for Channels 2\nto 13 and antennas with a gain of 13 db for Channels 14 to 83.\n4. The reference to field intensity contours in Rule 73.683 is by\ndefinition based upon the F(50,50) nomographs which are adjusted in accordance\nwith the table contained in Rule 73.683. This results in dbu (db above one\nmicrovolt) definitions of service grade. Thus, the \"Grade B contour\" springs\nfrom a Grade B \"Service Limit.\" As defined by the Third TV Report, the\n- 2 -\nATLANTIC RESEARCH CORPORATKDN\nA Division of The Susquehanna Corporation"
}