{
  "id": "d400-31",
  "text": "JANSKY & BAILEY BROADCAST-TELEVISION DEPARTMENT\nThe foregoing table makes clear the fact that an antenna at 30 feet above\nthe ground is almost 2 wavelengths high for Channel 2, but is about 30\nwavelengths above the ground for Channel 83. In the transmission propagation\nmedium electrical obstacles to the radio wave of short length (1 foot)\nbecome much less severe for a radio wave eighteen times as great in length.\nTherefore, what may be characterized as \"fairly smooth\" terrain for Channel\n2 transmissions may well be \"rough\" for Channel 83 transmissions. Yet,\nmeasurements made at 30 feet on both are believed to be useful and comparable\nsince receiving antennas are often installed at that height. This man-\nselected height which logically fits many typical outdoor antenna circum¬\nstances bears no particular scientific relationship to the electrical\ndimensions (wavelength) of the wide range of frequencies utilized in FM and\nTV broadcasting.\n7. In a recent statistical survey along a several mile path within\none major market it was determined that only about 50% of the homes along\nthe route had outdoor TV antennas. This would indicate that in some instances\nthere is a great tendency to use indoor antennas. For this part of the popu¬\nlation, measurements at a height 10 feet above the street will be about as\nfair a measure of effective field strength for TV coverage as the chimney\nheight typical of outdoor antenna utilization. The combination method as\nsuggested will provide field strength information having the best correspon¬\ndence with general public reception conditions at both typical heights.\n8. In summary, Jansky & Bailey suggests continuing to build upon the\nstatistically sound concepts for defining FM and TV propagation and coverage\nfactors cooperatively developed by the Federal Communications Commission\nwith Industry assistance since the first experimental FM stations were licensed\nalmost 30 years ago in 1939. Rule 73.686 should be supplemented to define the\ncategories of concern under the Rules in which field strength measurements^\nwould be helpful to the regulatory process. Depending upon the nature of ..the\ncategory, i.e., propagation, coverage, duopoly, etc., procedures should _be_\nstated for the taking of field strength measurements appropriate to the\nregulatory, management, and engineering needs to be met. Mobile, measurements\n- 4 -\nATLANTIC. RESEARCH CORPORATION\nA Division of The Susquehanna Corporation"
}