{
  "id": "d400-35",
  "text": "- 3\nb) Activities by others:\nNAB, AMST, ACTS, Land-mobile interests.\nc) Assignment of responsibility for position development.\nd) Timetable.\nOther FCC matters:\nDocket 18390\nBPET-317\nProposal for rulemaking to permit\nWYES (ED) Channel 8 in New Orleans\nto \"swap” frequency with Channel 13\nin the same city for certain con¬\nsiderations .\nWYES has not req.\nwe take a position.\nNo action by NAEB\nproposed.\nKentuckiana ETV Council request for\nwaiver to permit modification of\nthe facilities of WFPK-TV Channel\n15, Louisville, Kentucky (short¬\nspacing with Channel 15, WTIU,\nBloomington, Indiana, which does\nnot object.)\nOriginally req.\nto support; now\nrequested to table\naction until further\nnotice.\nMiscellaneous\na) I have talked with new members of the Executive Staff and with\nBob Woods as to the desirability of summarizing in list form a record\nof FCC proposals, inquiries, etc. in which NAEB has filed statments and\nwhich are still outstanding in so far as FCC action is concerned. Staff\nand Mri Woods agree that this would be a desirable undertaking. Mr.\nWoods fhels that one of his secretarial staff can with little effort\nreview the K & J files and bring such a summary up-to-date in the near\nfuture. To the extent practicable, it will be broken down by areas of\nconcern: e.g. CATV, Radio, TV general, etc. IT11 supply copies to each\npertinent staff member and will try to keep such summary up-to-date as\ntime goes on.\nb) ETS, with the approval of the NAEB Executive Board has recently\nincluded in its revised 1968-69 budget a small sum for use in obtaining\nengineering consulting help for the Division. We have interviewed a\nnumber of engineering consulting firms in Washington and I hope that a\ndecision will be made this week. The matter will be discussed with the\nExecutive Staff in detail by Mr. Marquis in a later meeting. Any\narrangement which ETS makes will be on a short trial term basis. We\nare hopeful that it may prove of specific immediate use with respect\nto dockets 18261 and 18262 (UHF - land-mobile) described above.\nc) It is expected that the President’s Task Force on Telecommunications\nreport will be filed shortly - certainly, before the change in the ad¬\nministration in January, since the Task Force is under instructions from\nPresident Johnson. There are conflicting reports as to the extent with\nwhich the document will deal with domestic broadcast matters. Some say\nthat it will do so extensively; others that influential broadcast inter¬\nests have persuaded the Task Force to delete most of the broadcasting\ncommentary. There is no question but that President Johnson’s refusal\nto run and Mr. Humphrey’s defeat have reduced the impact of whatever"
}