{
  "id": "d400-43",
  "text": "c\nFCC 68-909\n20107\nBefore the\nFEDERAL COMMUNICATIONS COMMISSION\nWashington, D. C. 20554\nIn the Matter of\nFREE OR REDUCED RATE INTERCONNECTION SERVICE\nFOR NONCOMMERCIAL EDUCATIONAL BROADCASTERS\nNOTICE OF PROPOSED RULE MAKING\nAdopted September 5, 1968; Released September\n)\n) DOCKET NO. 18316\n)\n)\n6, 1968\nBy the Commission: Commissioner Bartley concurring but reserving opinion on\nthe question of whether it is in the public interest for carriers to grant\nfree or reduced rates to noncommercial educational broadcast stations\nuntil comments have been received and considered in the rule making\nproceeding; Commissioner Johnson concurring in the result.\n1. Notice of proposed rule making in the above-entitled matter is\nhereby given.\n2. The purpose of this proposal is to prescribe rules deemed essential\nat this time to implement the provisions of the new Section 396(h) of the Com¬\nmunications Act of 1934. This section of the Act is a portion of the amendments\nto the Act embodied in the Public Broadcasting Act of 1967 (P. L. 90-129; 81\nStat 365). The text of Section 396(h) is as follows:\nAuthorization for free or reduced rate interconnection service\nNothing in the Communications Act of 1934, as amended, or in any\nother provisions of law shall be construed to prevent United States\ncommunications common carriers from rendering free or reduced\nrate communications interconnection services for noncommercial\neducational television or radio services, subject to such rules and\nregulations as the Federal Communications Commission may prescribe.\n3. In its report to the Senate on the Public Broadcasting Act of 1967,\nthe Senate Commerce Committee referred to Section 396(h) and stated: nYour\ncommittee is confident that the communications common carriers will recognize\nthe great public service potential that noncommercial educational broadcasting\nhas and the importance of interconnection facilities to the system. \" (Senate\nReport No. 222, page 11) Thus, it appears that requests will be made of\ncommon carriers to provide free or reduced service pursuant to Section 396(h)\nof the Act and that such service will be provided by the carriers. We believe\nthat it is in the public interest for the carriers to do so, subject to appropriate\nrules and regulations as may be prescribed by the Commission. Accordingly,"
}