{
  "id": "d400-57",
  "text": "CCs Marquis, Rlddlebergcr,\nClark; Mott\nSeptember 22, 1968\nEE: Curreot Status of ?CC Hatter*\n\\\noo iollwiRg\nI met with Sob Woods Thursday, September 19, sod be\nreport end reccwaoadations as current FCC docket*: !!\n1. Land Mobile. Comments doe December 2. The fCC t* holding, »t Ut\nrequest, mobile docket, #11997 <«U W volumes of it). That record\nshould be researched for evidence that the land mobile interest* are using the\nsame arguments this time as they did before (i.e. \"the higher frequency spectrum\nspace proposed se an alternative ie no good—no equipment exists for it—will prove\nunsatisfactory and go ua-uaed\") and that the argument has bean proven false by\nexperience since them. Hoods suggests SAKS might not want to pay counsel to do\nthat research, would prefer to send someone from staff instead. He needs to know\nas soon as possible In order not to keep Docket Room hanging firs.\n2.\nit, and Clark.\nHood* believes Hatt\nerford was working •\nUnder control.\nConsents doe\nthe first official\n5. Talnac. Woods recommends we not file reply consents: (1) docket is too far\nalong, (2) gutter is of interest only to s f*w MASS members, and 0) those few are\nso deeply interested that they ere probably looking out for themstlvee.\n6. CATV Pfaar-a” ftr: ^nation. Comments due September 20. Hoods reccmeended\nwe not file comments now; wait to reed the other psrtlos' comments, file reply\nconsents in Hoveobsr, after further consideration of our own.\n C£c2£nK*g\nFCC has taken la this regard.\nRulemaking?*0Mo need for action now; can w*it*for^rul«aaklog stage.\n8. A matter of general Interest: the 10X1 petition for reservation of a second\nchannel for Rochester has been peppasg by the local Urban League. UL argue#:\n(1) channel should be available for the minorities to use and apply for, not taken\nout of circulation for use by the intellectual sod cultural elite, which already\nhas s channel; (2) ETV station is lily-white, should not be rewarded with a second\nCbSWHoods believes WXXI will have no difficulty at all in overcoming these arguments,\nam basis of its record; but points to mere fact opposition mi filed and arguments\nmade as systematic of an attitude sod an image that may cause agjre stations problems\nin the future."
}