{
  "id": "d400-68",
  "text": "May 2?,, 1968\nOr. Robert Hilliard, Chief\niSducational Broadcasting Branch\nFederal Cam&mi cat ions Conai salon\nWashington, B.C. 20bi4\nDear Bob,\nHalloclt sent ma his copy of your April 19 speech. As he said, 'This is\na good one.**\nIn it you reference several it«»as I*d like to know mors about. On page 19\nyou mention 8 Bullion dollar# for a Children’s Television Workshop. T7hcra\ndo we send propoe&l® for radio funds/ One thing kids are learning not to\ndo:listen--to get new ideas through their ears, frasent use of media is\ntraining them to become expert in tuning us out.\nHave you ever heard of Harold Inals? Well, he was the intellectual godfather\nof Marshal KcLuhan. In a book called The Bias of Time he warned Canadians\nabout the media users to the South--their dependency on circulation, he said,\nis destroying the Americans* \"ability to think long thoughts.\" Couple that\nwith the timely line ’...and the thoughts of youth arc long, long thoughts.\"\nMow, link these with your imge of the child with the transistor radio\nagainst his ear. We used a Radio Workshop for Children. Pacifica ha® been\ndoing it for years; we’d like to do it better. Tell us where the money\nia, won’t you?\nOn page 17 you laanticm Twmdax data. Gan you share it with ue’ Or maybe\ntell us where to askI\nAllow me a few conceptual comments on your paper. Bob, first your appeal\nto the young people. You invite them to Join the rank® in broadcasting\nand lift it to new heights* You suggest there is a need fo th • . Surely\nthere is a need for change ia our use of media, but can wo hope that they\nwill effect it? Bow? How can they even find jots? Sven the met competent\nhave great difficulty. And the gap between what is learned in the schools\nof cosauunication and the real demands of the industry, cotumercial and\neducational, is enormous, practically unbridgable. I kncm, I was a grad¬\nuate of one of the beet and taught there as well. That’s where th^y need\nhelp.\nWhich brings me to your appeal for a Communication University. There was\na time, Bob, when 1 would have thought that to be essential. But several\nyears of studying models and media for learning have raised many new doubts\nin my mind. Let me share one or two with you."
}