{
  "id": "d400-69",
  "text": "COONEY TO HILLIARD 3/23/68\nRage 2\nFor some time now I've been quite impressed with the notion that the\nUniversity as a model for discovery is a modern anachronism. It's obsolete,\nexcept perhaps in its research function, and even there the methods in use\nare crippling. And the libraries as a means for accessing research results?\nOr a resource in learning? And lectures? Medieval.\nThe media are giving us the new model as you so well pointed out in the first\npart of your paper. Bob. And the only one who has attempted to tell us how\nand why is McLuhan. And his insights have been warped into a fad with his\nenthusiastic consent—part of involvement, somehow. Couple the media with a\ncomputer with massive memory and multiple input-output, control these from\nthe home, and you have a means for individually managed discovery* learning,\nthat is breathtaking. That’s the University of ths future.\nBut permit me one more brief comment on the concept of e specialised University,\nintended to facilitate progress in communication. Here, as In the largely\naccepted idea of a large production centers financed by even larger resources\nof funds, is a centralist tendency that can only be restrictive in the long\nrun, the long search.\nAs you know, Pacifica takes just the other view. We aspire to multiplicity,\nvariety, with great emphasis on the exchange of ideas, close scrutiny of some\nfew models of excellence (which we even duplicate for Board members1 private\nstudy) to provide means for understanding the next possible improvement (not\nimitation); this is what we should strive for. We must set up conditions for\nmany solutions and for these to effect each other as they are shaped. Otherwise\nlearning is memory, not discovery.\n80, not one University of Communication, Bob, but many facilitation centers\nto provide direct access to the media by the many who have something to say.\nAl Partridge, our Berkeley manager, hires content specialists and helps them\nto learn communication by encouraging them to do it. A center for the study\nof communication may be useful for scholarship and research, but not for\ntraining and certainly not tor education, except perhaps in the most fundamental\nand pragmatic introduction, something to open vistas. The relevant techniques\nThat's a lot for me to say,\nother end of the tube. And\nFor now.\ncan best be learned in use, they’re so simple,\nhaving spent some twelve years looking down the\nZ may be wrong. I have lots yat to discover.\nStuart Cooney\nExecutive Vice President\nSCih.\ncc: Hal lock Hoffman\nAl Fartridge"
}