{
  "id": "d400-77",
  "text": "-2-\n3. The present hearing is probably not the best place\nfor us to review the basic issues in the proceeding. To the\nextent that we wish to address ourselves to this matter, it\nmight be appropriate to seek special Rule-Making dealing with\nissues in comparative applications for educational stations.\nThis is a substantial step which would require a full staff\ndiscussion and possibly even Board concurrence. Such a Rule-\nMaking request would of necessity require an analysis of the\npositive criteria which the Commission should employ in such\ncontests between educational applicants. At the present time\nI have no evidence to indicate that we have available, or are\nlikely to be able to develop such positive criteria which\nwould assist the Commission in making decisions, not only\nbetween two applicants but between two locations.\nAt your request I have also reviewed this matter with\nanother attorney where there is no possible consideration of\nconflict of interest. Krieger and Jorgensen have encouraged\nthis additional solicitation of legal counsel from a dis¬\ninterested attorney.\nThe analysis provided by this further consultation is\nas follows:\n1. It is likely that any position which NAEB might\ntake regarding the issues set forth by the Commission in the\ninstant proceeding would place the weight of the NAEB in favor\nof assigning an FM license either to Teaneck, New Jersey or\nNew York City. (In the event that it is not clear the decision\nwhich the Commission will make is based not only on the applica¬\ntions themselves, but on the appropriateness of assigning to\none location versus another.)\n2. The matter of our standing is clear. We have no\nautomatic legal right to intervene except as we seek it and\nare granted it by the Hearing Examiner.\n3. While it is likely that we would be granted permission\nto intervene in this proceeding and that such intervention could\nin theory be helpful to the Hearing Examiner and to the Com¬\nmission in reaching its decision, this would only be true if"
}