{
  "id": "d400-79",
  "text": "Remarks by\nJERRGLD SANDLER\nExecutive Director\nNational Educational Radio Division of NAEB\nFor FCC Interconnection Meeting\nMay 28, 1968\nIt is ironic that after half a century educational radio can only\nboast of one state with an interconnected network capable of\nserving all its citizens. The state in question Is Wisconsin, and\ntheir network of 11 stations stands as a model of excellence —\nfor through this economical, flexible and imaginative medium, the\nWisconsin State Radio Network has met many important needs:\ndirect instruction, adult education and encichment, professional\neducation, and filling the cultural gap for many of Its citizens.\nWhy then, if the experience in Wisconsin has proven so successful,\nhaven’t the other states emulated their Great Lakes neighborV The\nanswer, of course, is primarily a financial one* While it is an\naccepted fact that radio costs — of all kinds — are considerably\nlower than its younger electronic sibling 'TV, it is also a fact\nof the industry that far fewer total dollars are available for\nradio stations to use. Thus, while interconnection costs for\neducational radio (when compared with ETV) might not seem terribly\nhigh to the casual observer, they are in fact prohibitive for\nmost users, given the present state of the art — and the economic\nfacts of life.\nThe situation becomes more acute when it is realized that more than\nhalf the states have statewide plans — or are currently developing\nthem — for educational radio. But again, until the financial\nsituation proves tenable, they may remain blueprints on the shelf,\nnever to become a reality. This finding was part of the recent\ncomprehensive status report of educational radio in the United\nStates which NER published with the help of a Ford Foundation grant.\nBut nothing could be more dramatic than the simple — if stultifing\n_ fact that it would cost considerably more to interconnect ap¬\nproximately one third of the existing educational radio licensees\n_ roughly 120 out of more than 365 — throughout the country on\na regular daily basis than the total of a major grant just announced\nlast month by the Ford Foundation. Stated in hard dollar terms. If\nFord’s committed $500,000 — the largest single grant to be avail¬\nable for educational radio programming — were to be utilized for\nlive interconnection, there would be little or no money available\nfor programming and production. I am currently undertaking a\nfeasibility study for the Ford Foundation on this very challenge:\nCan we design a public radio network project within the $500,000\nlimitation that will really do a first rate job that will reach\nmillions? Is such a plan really feasible? While the study is not\nyet completed, one thing is clear: We can forget about inter¬\nconnecting the entire country given these facts. It may be possible"
}