{
  "id": "d400-8",
  "text": "27109\nO\nReport No. 3311 NONBROADCAST AND GENERAL ACTION January 30, 1969 - C\nUPPER PENINSULA MICROWAVE AUTHORIZED TO RELAY AUDIO SIGNALS TO BROADCASTERS\nApplications by Upper Peninsula Microwave Inc. (4094-C1-ML-67 and\n4096-4103-Cl-ML-67) to relay netx^ork and educational radio signals to\nMichigan radio stations on existing common carrier TV facilities have\nbeen granted by the Commission over objections by telephone companies.\nAt the same time UPM was warned that the Commission will deal severely\nwith any repetition of earlier unauthorized service.\nUPM applied to carry NBC and ABC radio network audio signals ‘and an\neducational audio signal over existing microwave facilities that are licensed\nonly for transmission of video (?nd associated audio) signals. NBC and\nABC are received off the air at Harmony, Wis., with the NBC signal delivered\nto Michigan stations WIKB, Iron River; WJPD, Ishpeming, and WHDF, Hancock,\nand ABC to WDMJ, Marquette; WMIQ, Iron Mountain, and WLST Escanaba. The\neducational signal is to be obtained by direct interconnection with\nNorthern Michigan University near Marquette and relayed to the communities\nof Ishpeming, Houghton, Hancock, Ironwood, Iron River, Iron Mountain,\nEscanaba, Manistique, Saul^t Ste. Marie, Newberry and Munising.\nMichigan Bell Telephone Co. and American Telephone and Telegraph Co„\njointly petitioned to deny the applications.\nIn connection with a charge they made of unauthorised service the\nCommission cited correspondence with UPM counsel and James A. Klungness,\nthe company president. Although UPM said in 1967 it was unaware of any\nlanguage in its authorisations that would rule out audio service, earlier\ncorrespondence showed that in 1965 the Commission had told UPM to terminate\nany such service. In a letter January 15, 1968, Klungness said that failure\nto recall this was an inadvertence, but there was no intent to violate the\nRules or mislead the Commission.\nThe Commission said it was inclined to believe this even though it\ncould not find UPM’s misunderstanding of the video limitation on its\nlicenses excusable. “Nevertheless, we do not consider a single incident\nsuch as this sufficient, in itself, to call into serious question the\nqualification of UPM to be a radio licensee. However, further license or\nrule violations by UPM will be considered in connection with this matter\nand may well lead to another‘conclusion.\ni\n!\n(over)\nl^iA:aO"
}