{
  "id": "d400-89",
  "text": "Dr. Robert Hilliard\nChief of Educational Broadcasting Branch\nFederal Communications Commission\nWashington, D.C.\nDear Dr. Hilliard:\n1 am writing you at the suggestion of Jerrold Sandler of N.E.A.,\nrelating to the plans being made by Massachusetts State College at\nLowell to attempt to start a non-commercial, educational FM radio\nstation with a Class A license.\nThe firm of Jansky & Bailey has conducted a frequency search for\nus and they find only one educational channel available for the Lowell\narea. The channel - 213 • could be rendered unusable If there is any\nsignificant increase in the facilities of stations with neighboring\nchannels. Because of thi$ William Weakley of Jansky & Bailey, and\nMr. Sandler have both recommended that we act promptly to apply for\na construction permit. We are presently preparing the program,\ntechnical, financial, and legal aspects of the application.\nThe major problem is that the studios would be housed In a new\nbuilding which won*t be open until September of 1969. Money for\nequipment, maintenance, etc., must come from the equipment fund for\nthis building. So If we were to act promptly In applying for Channel\n213, it is conceivable that we would be awarded a construction permit\nbefore we are prepared to undertake that construction; therefore, we\nmight violate the regulation that the station must go on the air with-\nin six or eight months after the license is granted. » would like to\nkiu>w your reaction to this and whether or not it is allowable to submit\nthe application when It is prepared (February or March of 1968).\nEnclosed are two items - one is a brief statement of our Intentions,\nas released to the student newspaper, the other, a proposed program\nschedule which is, by no means, representative of our final plans, but\nserves to give a general idea of our intentions.\n1 would appreciate receiving your reply as soon as possible so we\ncan proceed with our plans.\nThank you for your assistance.\nVery truly yours.\nPG:ew\nPaul Gay\nAsst. Prof, of Music"
}