{
  "id": "d1699-0",
  "text": "The National Association of Educational Broadcasters\nVol. II No. 3 DuPont Circle Bldg., Washington 6, D. C. March,, lgfcl\nMAGNUSON BILL HEARINGS\nOn Mhrch 1 and 2 a varied group of witnesses drawn from commercial broadcast¬\ning, educational broadcasting, formal education, and the general public appeared\nbefore the Senate Interstate and Foreign Commerce Committee to testify in support\nof the Magnuson Bill. Since identical legislation had been given hearings at pre¬\nvious sessions, effort was made to add to this record by bringing in those who\ncould testify from first-hand knowledge of the difference federal funds for capital\noutlay would make as to whether channels in their areas became activated or con¬\ntinued to lie fallow.—\nWitnesses expected to testify on behalf of the legislation included:\nJohn Bums, President of RCA\nMrs. Edmund Campbell, President, Greater 1'fe.shington ETV Association\nDonald McGannon, President, Westinghouse Broadcasting Co., Inc.\nMrs. Robert Hornung, President, Greater Cleveland TV Education Association\nGeorge Brain, Superintendent, Baltimore City Schools\nBernard Everett, Assistant Superintendent of Schools, Newton, Massachusetts\nLoren Stone, Manager, Station KCTS-TV, Seattle, Washington\nJohn Schwarzwalder, Manager, Station KTCA-T7, St. Faul-Minneapolis\nErling Jorgenson, Director, Montana ETV Project\nFCC ITEMS\nBy the time you read this, the FCC may, at long last, have done something about\nthe clear channel issue which has been an'issue for 15 years. A decision is expect¬\ned shortly on duplicating 12 of 24 clear channels or providing for selective break¬\ndown of all 24. Several educational radio station operators are interested in the\noutcome as possibilities for improving their AM services. NAEB has repeatedly ad¬\nmonished the FCC that if a breakdown is made, two frequencies - one in the east, one\nin the west - should be set aside for educational use. This would permit addition\nof at least 50 or more educational outlets.\nTITLE III\nAs a follow-up to the item last month re the MPATI-NAEB request for broadened\ninterpretation of admissable TV receiving equipment, the USOE has added to the re¬\nceiver and antenna used primarily to strengthen instruction in science, mathematics,\nor modem foreign language. \"In those receiving areas and installations where con¬\nnectors, amplifiers, and inter-connecting co-axial cables are required, we will in¬\nterpret these as extensions of the classroom receivers when acquired under approved\nprojects.In those cases where separate receivers are required for other instruc¬\ntional areas along with science, mathematics or modem foreign language, the cost of\nsuch accessories...(including their installation) should be pro-rated in terms of\nthe number of sets contemplated for purchase under approved projects.”\nAntenna towers and masts are not considered to come within the authorization\nfor federal financial participation.\nFCC APPLICATIONS AND ACTIONS\nRecent filings before the FCC indicate a tendency on the part of the commercial\ninterests to improve their technical positions by moving to lower channels, frequent¬\nly at the expense of the educational reservations. As a result of petitions by"
}