{
  "id": "d152-8",
  "text": "BBC SKfilBS Off 11 TEE KATQKE OF TEE mirmsw WITH FliEB MOYLE,\nmathematical k&*mmwm$ cmmimE mirmmti\nI \"The Solar System: The Earth and the fleets11. In hi®\nopening talk, Mr. Hoyle gives the broad outline of the\nMew Cosmology and a short history of astronomy* Me ends\nwith a description of the planetary system of the sun\nand it® place in the universe*\nII *fhe'Solar System: The Sun11. Mr. Moyle describe® the\norigin of the sun1® heat and the dependence of the\ninhabitants of the earth on this heat, not only for\ntheir life but for all their industrial energy. This\nlead® him to speculation about the destiny\nof the sun and its final state once it has completed\nthe fission of the material which is the source of it®\nsupply of heat* Me end® this lecture by putting atomic\npower and the atomic bomb into perspective, refuting the\ntheory that the hydrogen bomb might set up a chain re¬\naction which would destroy the world*\nIII \"The Starss Their Origin\"* In this talk. Mr. Hoyl©\ndescribes the galaxy of which the earth is part—the\nformation of star® and their development* the interstellar\ngases, he say®, are a vital part of the galaxy, and\nthe relative speed with which the stellar bodies pass\nthrough these gases influences their formation and, in\nthe case of the sun, the heat it radiate®. Mr* Hoyle\npasse® to an absorbing explanation of the climatic\nvariations to which the earth has b; m subject through\nthe ages and to a prophecy of its future state.\nXV \"The Stars: Their Future and their Fate\". In this talk,\nin which he describe® the eventual fate of the star®,\nMr* Hoyle gives a vivid picture of the most gigantic and\nviolent processes in nature* He also discusses the age\nof our Galaxy, and. the method® by which astrophysicist®\nhave calculated this to be in the region of five thousand\nmillion years* Having come to the half-way point in his\nseries, Mr. Ho. le ends with an outline of his programme for\nthe second half, in which he will deal with the origin\nof the Earth and our planet® f the position of our Galaxy\na® a member of a cello®sal swarm in a state of organised\nmotion; and the origin of the Universe itself.\nV \"The Origin of the Earth and the Planets\"* Professor Moyle\nbegins the second half of this series with an explanation\nof the way in which the earth and the planets were born;\nwhy older theories have been dropped; and what evidence\nis available to uphold the currant theory that they had\ntheir origin in the condensation of a wisp of gm blown\ninto space when one of the stars moving around the sun"
}