{
  "id": "d267-126",
  "text": "Supplement #4. 1st quarter, 1957 offering\nVoices of Europe (continued)\n3\nProgram\n12\n13\nIssue Topic and Speakers\n12 the famous raconteur, the Baron von Munchausf\nwho raised the level of lying to the art of\nliterature, has lived in Florence almost as\nmuch as he has in Germany. He joined the\nCommunists when he was 20 and left them for\nthe Nazis when he was 22. At the age of 24\nhe deserted the Nazis and returned to Flor¬\nence with his wife after the war.\n13 A. \"Weather” - Professor Doctor Friederich\nDefant, authority on the Alps and world\nfamous meteorologist , has worked for the\nU. S. Navy on weather and atmosphere\nresearch. He has experimented and taught\nat the University of Chicago, the University\nof California at Los Angeles, and the\nUniversity of Innsbruck in Austria.\nB. \"Swiss Films\" - Herr Lazar Wechsler,\nSwiss film producer, was originally an\nengineer. Originated multilingual film in\n\"The Last Chance,\" and has produced \"The\nSearch,\" \"Four in A Jeep,\" \"Marie Louise,\"\n\"He?di,\" and other fine films.\n* x x x * x * ** x xxx x x x * x\nWindow on the World (56-54)\nProgram 13 (issue 4) - nAs I Saw the U.S.A.\" - James Morris, correspondent for the\nLondon Times came to the United States to gather information\nfor his book \"As I Saw the U.S.A.\" published in 1956. In\nthis talk he describes some of the things that impressed\nand interested him in America.\nProgram 14 (issue 5) - \"Challenge of the English Theatre\" - Peter Ustinov, actor,\ndirector, producer and playwright at 35 is well known for\nhis movie and theatre roles.\nProgram 15 (issue 6) - \"Britain Puts the Atom to Work\" - An interview with Sir\nEdwin Plowden, Chairman of Britain's Atomic Energy Authority\nconcerning Calder Hall, the first atomic power station to\nproduce electricity commercially.\nProgram 16 (issue 7) - \"What’s Best in American and British Movies\" - Dilys Powell,\none of Britain’s most popular critics, writes about movies\nfor London’s Sunday Times. Newly arrived in the United\nStates she is off to Hollywood.\nXXX XX*#* ***** X XXXX ***** XX"
}