{
  "id": "d267-171",
  "text": "NAEB RADIO NETWORK\n23\nPROGRAM OFFERING PROGRAM OFFERING\nTitle: YOUR RIGHTS ARE ON TRIAL\nType: D ocument ary\nTime: 29:30\nNo.: 13 programs\nOrigin: KUOM (Grant-in-Aid)\nAudience: General\nSerial Number: 57-18\nRelease Date: Issue lU (April 7)\nA series of 13 half-hour radio programs of authoritative discussions and\nauthentic dramatizations of recent high court opinions on constitutional\nrights* produced by the University of Minnesota Radio Station KUOM* under\na grant from the Educational Television and Radio Center* in cooperation\nwith the National Association of Educational Broadcasters and the Univer¬\nsity of Minnesota Law School. Consultant-commentators for the series\nwere Professors of Law Monrad Paulsen (Columbia University) and Charles\nAlan Wright (University of Texas),- writer-producer, Fhillip Gelb (Univer¬\nsity of Minnesota).\nProgram No. 1 - \"The Case of the Stomach Pump Evidence\" - Due Process\nof Law.\nProgram No. 2 - \"The Case of the Wireless Wiretap\" - Wiretapping.\nProgram No. 3 - \"The Case of the Psychiatrist's Questions\" - Reasonable\ninterrogation.\nProgram No. I4 — \"The Case of the California Bookie\" — Legal search and\nseizure.\nProgram No. 5 - “United States versus Often Lattimore\" - Right to definite\ncharge.\nProgram No. 6 - \"The Case of the Communists' Bail\" - Fair bail.\nProgram No. 7 — u The Case of the Baltimore Radio Show\" - Fair trial versus\nfree press.\nProgram No, 8 - \"The Case of the Korean Killing\" - Right to trial in\ncivilian court.\nProgram No. 9 - \"The Case of Dr. Peters' Loyalty\" - Right to face accusers.\nProgram No. 10 - \"The Case of the Missing Lawyers\" - Right to counsel.\nProgram No, 11 - \"Eugene Dennis versus the United States\" - Impartial jury.\nProgram No. 12 - \"The Slochower Case\" - Right to avoid self-incrimination.\nProgram No. 13 - \"National Security versus Individual Rights\".\nJustice of the Supreme Court William 0. Douglas: Federal Judge Jerome\nFrank, author of \"Courts on Trial\"; Gen. Telford Taylor* Chief Counsel"
}