{
  "id": "d267-185",
  "text": "NAEB RADIO NETWORK\n37\nPROGRAM OFFERING PROGRAM OFFERING\nTitles LITTLE ORCHESTRA SOCIETY\nCONCERTS, 1956-57 SEASON\nType; Music with commentary\nTime: Varied from 90:00 to 120:00\nNo.: 8 programs\nOrigin: Little Orchestra Society-WNYC\nAudience: General\nSerial Number: 57-23\nRelease Date: Issue 14 (April 7)\nIMPORTANT: As in past years, the Little Orchestra Society has had to honor demands\nof various unions and artists involved in presenting these concerts\nregarding a date of expiry for the rights governing the broadcast of\nthis series or any programs from it. This year the date of expiry is\nOctober 1, 1957. No program from this series may be broadcast after\nthat date.\nThis gives each station about six months to schedule and air a series\nlasting eight weeks. Therefore, we strongly urge that all stations\nhonor this request.\nThese are the same concerts given by the Little Orchestra Society in Town Hall\nwith two differences: the introduction of young artists as some of the soloists,\nand brief talks on the unfamiliar music by David Randolph, Music Commentator for\nRadio Station WNYC, New York. The conductor for all concerts is Thomas Scherman.\nProgram 1 - Issue 14\nThe first concert will be devoted to a \"glowingly Spanish\" opera, Goyescas, by\nGranados, based upon famous paintings of Goya. It was last produced in the United\nStates by the Mstropolitan Opera forty years ago. Heading the cast will be a young\nSpanish soprano, Pilar Lorengar, who has had sensational receptions in every music\ncapital of Europe. This concert will be her bow in the United States, and to\nsupport her three well known artists have been employed: Martial Singher, MLgnon\nDunn and Davis Cunningham. The New York Concert Choir will serve as chorus.\nProgram 2 - Issue 15\nThis concert will be a good example of one of the important aspects of these Dress\nRehearsals: it will serve to introduce a young baritone, Jonathan Kinsler, to a\nperceptive audience that can help give him the wider reputation his gifts deserve.\nHe will sing \"a fervent religious miniature,\" the best known solo cantata of J. S.\nBach, \"Ich will den ICreuzstab gerne tragen.\" Schubert’s gay Viennese Symphony No. 6\nwill round out the program, together with the \"neglected\" Scherzo Fantastique by\nJosef Suk, a Czechoslovakian composer who was a pupil of Antonin Dvorak. This\nmarks the first performance of the Suk work in the United States.\nProgram 3 - Issue 16\nAn all-French program, also introducing a young artist, Lorin Hollander, the\nremarkable 12-year-old pianist who appeared last year in the Society’s Children’s\nConcerts. He will play Ravel’s Piano Concerto in G major. There will also be the\ncourtly 18th century Air de Ballet of Rameau and a symphony by Bizet."
}