{
  "id": "d267-186",
  "text": "LITTLE ORCHESTRA SOCIETY CONCERTS (continued)\nProgram 4 - Issue 17\n38\nThis concert will open with Richard Strauss’s incomparable Le Bourgeois Genii'! homme.\nThe remainder of the program is indefinite at this time, but all stations will be\ninformed as to its content before its distribution.\nProgram 5 - Issue 18\nThe outstanding features of this concert will be two double-violin concertos: the\nConcerto in D minor by J. S. Bach, and the Concertante for Two Violins by Spohr,\nwritten about 100 yoars ago. The latter, so far as Mr. Scherman can discover, has\nnever been done publicly in the United States. The soloists will be the American\ntwin brothers, Gerald and Wilfred Beal. Another first performance will be William\nMayer’s Music for Strings and Trumpet Obbligato with Robert Nagel, the Society’s\nfirst trumpeter as soloist. The program will be rounded out by Beethoven’s Fourth\nSymphony.\nProgram 6 - Issue 19\nThe appearance of Pierre Monteux as guest conductor is particularly appropriate:\nthat is, to have one of the elder statesmen in his craft present works that in his\nopinion should not be neglected. Mr. Monteux was delighted with the idea, and the\nentire program (as well as the soloist) is of his choosing. There will be a striking\nsymphony for brass, a first performance anywhere, by a young American, Gunther\nSchuller; an overture by Mehul; a piano concerto by Paisiello; and the overture to\nHindemith’s satiric opera, News of the Day. The soloist, Vera Franceschi, is a\nyoung American pianist whose extraordinary talent, in Mr. Monteux’s opinion, has\nnot yet been widely enough recognized.\nProgram 7 - Issue 20\nPeggy Wood, distinguished actress and singer is an artist ideal for the main feature,\nthe first performance in this country of the incidental music to Peer Gynt. written\nby Norway’s leading composer, Harold Saeverud. The Ibsen text will be presented in\na new English adaptation, and Miss Wood will be assisted by an outstanding actor.\nThe concert will include the Haydn Violin Concerto No. 1. with Jan Tomasow, concert-\nmaster of the orchestra, as soloist; also a Serenade for Orchestra, by Reger.\nProgram 8 - Issue 21\nGluck’s opera Orfeo ed Euridice was the first to be done in concert form by the\nSociety, and was the top preference for a repeat performance. Elena Nikolaidi,\nMetropolitan Opera artist who sang the role of Orfeo under Toscanini, was a natural\nfor this revival. Teresa Stich-Randall will sing as Euridice. Miss Stich-Randall\nhas been in Europe for the past six years where she has been widely acclaimed in\nboth opera and concert appearances. Pierrette Alarie, who will sing Eros, is one\nof the favorite artists of the Paris Opera."
}