{
  "id": "d267-83",
  "text": "34\nNAEB RADIO NETWORK\nPROGRAM OFFERING PROGRAM OFFERING\nTitle: THE PERKINS LECTURES\nType: Lecture\nTime: 1;5:00\nNo,: 3 programs\nOrigin: Fund for Adult Education\nAudience: Adult\nSerial Number: £7-17\nRelease Date: March 17, 1957\nThe single theme of these lectures is: \"Popular Government and Foreign .\nPolicy/’ and the separate programs are devoted to the following topics:\nProgram Issue\nTopic\n1.\n11\nThe First Great Testings, 191U-29\n2.\n12\nMeeting the Totalitarian Challenge,1930-55\n3, 13\nThe Road to Success\nSome notes about the speaker: Dexter Perkins is the John L. Senior Pro¬\nfessor of American Civilization at Cornell University, with a distinguished\nreputation as diplomatic historian and university teacher in many countries.\nHe went to Cornell in 1952 from the University of Rochester, where he had\nbeen Professor of History since 1915 and Chairman of the Department of His-\nsory since 1925. He was the first American to occupy the Pitt Chair at\nCambridge University, in 19ii5-lt6, and lectured at the University of.Uppsala,\nSweden, in 19h9; the University of London; the Defence College in Kingston,\nOntario, Canada; Johns Hopkins and Harvard Universities; the National War\nCollege; and the Naval War College. He is Chairman of the Harvard Founda¬\ntion for Advanced Study and Research, is on the Board of Overseers of Har¬\nvard University, and is President of the Salzburg (Austria) Seminar on\nAmerican Studies, The Salzburg Seminar was opened in 19^7 to help make\nAmericans known to Europeans; its professors are American, its participants\nare European. Professor Perkins went to Salzburg in 19U9 and has been\nPresident of the Seminar since 1950.\nProfessor Perkins has engaged in numerous other civic and learned activities.\nHe was city historian of Rochester, New York, from 1936 to 1953. He was of¬\nficial Historian for the Overseas Branch of the Office of War Information at\nthe United Nations Conference in San Francisco in 19145. Among his other\nactivities, he is a moderator of the Unitarian Churches of the United States\nand Canada, a member of the Association of University Professors, and a\nmember and President for 1956 of the American Historical Association.\nBoro in Boston in 1889, Professor Perkins received his A,B. in 1909 and\nPh.D in I91I4, both from Harvard University. He is a member of Phi Beta Kappa,\nand received a Litt.D, from Harvard in 1953 and a Ll.D from Union College ?"
}