{
  "id": "d611-109",
  "text": "3\n^v.n°^eS B*y that Stela and ielntosh also have programs which\nfoportadmore fully than I oan (since I loft the main\nto Balp!h *ott 1 'ia8htn86oB' 80 Pl«*s« do ao In separata memo*\n5o MB?— f—SIS. - Da Safcnlck. «flth the cooperation of the I8KW\nunion a studenfc (part-time) can work 2f> hours per week at WtfDT\nas a kind of apprentice @ $ 2,75 P®*1 hour or $ 55 per week for\n°_'iI\"a^no® will then be conaldered for an opening\n8‘TY^lJm& If and when hired gets $ 127.50 per week to start\nThis la ^r«eth«»*a2Jn \"88k 88 8P88*1‘I®d by the union contract.\nThis la more than S 10,000 per year. (I can't think of any other\nplace In our society where one oan progress more rapidly than that)\n6. Brooklyn College - Gene Poster. He will give broadcasting\nto scents recruited under the SKWt program; students 8\nSwoT!.?? JjUl bBt up-grading before they can compete\nfairly with other eollego level students. In this way he will\nleaven thetr academic diet and also attract potentially good\nstudents Into broadcasting. He hopes to offer these students\nall of the broadcasting courses over the next three veara\nA commercial radio station In NYC Is talking to him about*\n’^5: ssi^Wf'»ss,3,.K'^rss\n... ,7;H ■ Gary Indiana This Is a high school station (V*d/'.s)\na tethnlonlTfch0 b£ %8rS*1''? pattern. It will be -oved to' * '\na technical high school* Now it is in an essentiality whit*\nsohool. The technical high school will draw from all over the\nt present 35 students are In the radio broadcasting\nHlcan ^tudenJr Jnoluding several lexloan and Pwrto\nHlcan studenta. The point In Including this Is that educational\narron»!menf /ork 7ith 8electe<1 high schoola and work out an 1\narrangement of provide facilities for schools which wanted t «\n«» ■« >»* °\n«».y .iiiS\nscreened by Youth Opoortunity Corns* All. win «anTla„ *. . .\n%■fim“1’-\nTOna0?^*1^^1?? bu8JjJf88#8 “ not hy the sohool district which\nrun the st tlon. This provides staff to the station they\nsss.;!?„-r ' *\"°rt ,na h,i“.\n*'Ty -?.f» ?'**3ft Stone* Has created a special\nposition - equipment technician - and hire minority oeonle fnr* u"
}