{
  "id": "d611-112",
  "text": "August 30, 1968\nMr. Raymond Shirley\nDirector\nDepartment of Radio Services\nthe University of Tennessee\n14 Ayres Hall\nKnoxville, Tennessee 37916\nDear Mr. Shirley:\nI received your letter of the 28th this morning and want to\nanswer immediately. I am sure I do not have all the solutions to\nyour questions, but let me try.\nFirst, let me say that you are surely not alone in your con¬\ncerns about doing anything dramatic in the way of changing an image\nthat has been intelligently and carefully built over a period of\nyears. Marjorie Newman, Manager of WFSU-FM in Tallahassee wrote\nto me recently and expressed the identical thought. X think her\nanswer, which I quote in part, is similar to your own:\n\"As is probably the case with many educational radio\nstations, we have on the basis of past programming\nbuilt up an audience that is sophisticated, well-\neducated and in middle to higher income brackets.\nThis has been a barrier to our broadcasting programs\nintended directly for the disadvantaged. I feel that\nunless we devote a sizable portion of our broadcast\nday to this group we could not interest it in listening\nto FM even if sets were available. We have therefore\naimed our productions at the audience we know listens,\nhoping to promote action on its part since many of\nthese listeners are in positions in the community in\nwhich it is possible to do so.\"\n\"Success\" is a relative term and neither you nor I will ever\nreally know the full extent to which other FM stations are achieving\nit in their programs by, for or about the Disadvantaged. I can say\nthat some of these stations report positive reception to their pro¬\ngrams (word-of-mouth, letter, telephone and press coverage); but\nnone of these stations can afford much formal audience research and\nare obliged to rely on these admittedly old-fashioned methods. It\nis fair to at least say that their communities are responding (and\nit isn't all positive) in several ways; the stations are enthusiastic"
}