{
  "id": "d611-113",
  "text": "Page 2\nAugust 30, 1968\nTo: Mr. Raymond Shirley\nFrom: Kenneth R. Clark\nabout what they are attempting; they seem to be accomplishing\nsome good things in giving voice to people long neglected (be\nthe recipients Negro, Puerto Rican, Mexican American, migrant\nworkers, American Indians, or poor Whites) . In several cases\nthere appears to be a direct link between station programs and\npositive community action. I do know these stations are com¬\nmitted to make a definite effort in this area with or without\ncost to themselves. Sensitive issues have been raised an aired\npublicly; official toes have been stepped upon; there has been\ncriticism against the stations. However, I do think it is also\nfair to report that none of these stations are considered \"radical”.\nNone have been in \"hot water\" very long and all ultimately see\ntheir program judgements vindicated.\nI can also report that all of these stations shut down their\ntransmitters at night with a clear conscience (and that includes\nstations in Tennessee, Missouri, Florida and Louisiana). I think\nthe point is that our country is locked in a domestic crisis of\nenormous dimensions. The problem will not go away by itself. On\nthe contrary, I am of the personal belief that the worst is still\nahead of us. The NAEB feels that non-commercial broadcasting has\nan obligation to get into the mainstream of this crisis and make\na valid contribution.\nThere is no question of \"pressure.\" We both know this asso¬\nciation is In no position to pressure its member stations, nor would\nthere be any value in trying. However a clear philosophical position\nis emerging within the NAEB that is In tune with the realities of\n1968. I think it will stand any test, withstand any contrary opin¬\nions. Why? Because there is scant choice to do anything else in\nlight of what is happening in America. This, of course, is one\nreason for my reports to both radio and television stations. The\nNAEB wants to stimulate a national dialogue on the issue, but I\nthink there is also real advantage in letting stations know they\nare not alone in this, that sister stations are already fighting\nthese battles and are winning them every day.\nNow, having said all that, let me come back to the specifics\nof WUOT. Who is to say that your station is not already doing\neverything it can do? You are producing your own materials in\nthe human relations category. You do carry HER and other materials\non these subjects. But I note that you say you have offended some\nand \"they have remained loyal to us.\" It seems to me you already\nare finding your own answers. Whether you should do more or less\nis entirely up to you. WUOT must perform its unique broadcasting\nservices within the context of the Knoxville listenership, against\nthe framework of your own special circumstances. Only you can\nbest determine how much effort your station can reasonably make\nand in what manner."
}