{
  "id": "d611-120",
  "text": "NO NEWS ISN’T GOOD NEWS is a one time program that studies the\nrelationship between the news media and their coverage of the cause\nand effects of violence. Combining footage shot in disadvantaged\nneighborhoods with discussions between news personnel, civic leaders\nand members of the Black community, NO NEWS ISN’T GOOD NEWS will try\nto suggest how a better informed society of both Whites and Blacks\ncan cooperate in the avoidance of violence.\nCONTACT: Clayton A. Roehl, Program Manager\n*****\nI want to call your attention to two peripheral ideas that may\nor may not make sense to your station:\n1. a do-it-yoursel kit originally distributed by WYES, New\nOrleans, and\n2. a project called DROPOUTS ANONYMOUS originated by com¬\nmercial stations KFRE and KFRE-TV, Fresno, California.\nThe Kit, enclosed for your information, was mailed to 5000 com¬\nmunity-minded residents of New Orleans. A much larger mailing is now\nbeing readied. The specifics of some of the elements are clearly\nlocalized, but with some changes the Kit could be utilized in any\nmarket. The sample is strictly FYI; it is an interesting, and rela¬\ntively inexpensive peripheral contribution any station, large or small,\ncan make to bettering human relations.\n*\nDROPOUTS ANONYMOUS was launched in February, 1966 by KFRE and\nKFRE-TV to help young people stay in school. The initial project\nlasted one full year and was also adopted by the other Fresno, Cal.\nstations in a city-wide effort involving all broadcast outlets.\nAllow me to quote from the forward to a brochure prepared by\nthe stations which best explains the purpose:\n\"DROPOUTS ANONYMOUS is a continuing campaign, in announcement\nform, offering aid and moral support to high school students\nabout to drop out and to older youths and even adults who never\ncompleted high school.\nIt brings the potential dropout together with one who has\nalready faced - and solved - a similar problem.\nDROPOUTS ANONYMOUS will elicit response of a depth and\nintensity that is hard to predict. Late at night, the\nfourteen-year-old who is pregnant and terrified, the\nhandicapped enrolled in courses he can’t handle, the\n\"A\" student whose uneducated parents want her to quit\nschool and bring home her weekly paycheck, the listless,\nthe forgotten, the lonely, to whom the invitation to call"
}