{
  "id": "d611-121",
  "text": "6 -\nDROPOUTS ANONYMOUS is a beacon light of help, a ray of hope,\na sign that there is .someone who will listen and help.”\nAn organizing committee was formed under the Fresno Community\nCouncil representing schools, hospitals, Armed Forces recruiting\noffices, fraternal and civic clubs and community service organi¬\nzations .\nThat group in turn was and is supported by a much larger number\nof people on standby call. Some of these volunteers man telephones\non regular shifts. Many are simply available for referral calls.\nThese volunteers were deliberately chosen for their religious,\nracial, ethnic, economic and educational backgrounds. When the \"key\nreceptionist” decides that a particular committee member could com¬\nmunicate more effectively, that volunteer is asked to make the con¬\ntact.\nIt should be noted that because the cooperation is so broad-\nbased in the community, support of local newspapers as well as\ncompeting radio and television stations in the market is willingly\ngiven.\nThe KFRE and KFRE-TV role was one of initiating the project and\nof providing the publicity to keep it moving. Once started, the pro¬\ngram was turned over to local citizens1 groups to administer. But\nthe broadcast facilities remain and integral element of the project\nthrough announcements and attendant publicity.\nThe major appeal is to listeners and viewers who are contemplating\ndropping out of school or who have already left school. The suggestion\nis made repeatedly that they telephone for assistance \"now\" to a num¬\nber in service 24 hours a day.\nThe answering service has a roster of nine outstanding civic\nleaders especially trained to counsel in this area of social problems.\nThe answering service is given the personal schedule and availability\nof each of the nine leaders every day. More than one is easily reach¬\nable at any given moment.\nEach counselor is asked first to determine the motivation causing\nthe problem of the telphone caller - family maladjustment, need for\na job, military service and so on. The counselor then encourages the\ncaller to get in touch with the appropriate social agency, referring\nto a specific person and offering to set up an exact appointment time.\nA detailed brochure, which explains the entire DROPOUTS ANONYMOUS\nproject with specifics of how to start and implement the program in\nyour area, is available free of charge. I highly recommend that you\nwrite for it to: Guy Farnsworth, Community Relations Director, KFRE-TV,\nP. 0. Box 144, Fresno, California, telephone 209-268-6441."
}