{
  "id": "d611-124",
  "text": "THE UNIVERSITY OF TENNESSEE\nDIVISION OF UNIVERSITY EXTENSION\n14 AYRES HALL\nKNOXVILLE. TENNESSEE 37916\nDEPARTMENT OF RADIO SERVICES\nRADIO STATION WUOT\nSTATE RADIO TAPE NETWORK\nTENNESSEE HIGH SCHOOL SPEECH AND DRAMA LEAGUE\nPHONE: 615-974-5376 AugUSt 28, 1968\nMr. Ken Clark\nProject Director\nPrograms for the Disadvantaged\nNAEB\n1346 Connecticut Avenue, N.W.\nWashington, D. C. 20036\nDear Mr. Clark:\nI write this letter with much hesitancy for fear that my motives will be mis¬\nunderstood. I realize that the popular thing today is to jump on the bandwagon and\njoin in the joyous parade that is supposec* to please the great white father in Wash¬\nington and lead to that fountain to heal all our wounds, federal funds. (By the way,\nI notice that neither political party convention seems disposed to nominate a'dis-\nadvantaged person1 as the vice-presidential candidate. Shouldn’t they go out and\nrecruit one, whether qualified or not? )\nI have carefully read all of your reports and noted with interest the tremendous\n.success many sister educational FM stations have experienced' in programming for\nthe disadvantaged. I am curious to know the M~radio saturation lnlhese disadvantaged\nareas. Are the stations doing this programming also doing research to determine if\nanyone is listening or even has the capability to receive the station’s programs? Do\nany of them have utilization people in the field to set up listening groups or do prepa¬\nration and followup for the programs? What has been the reaction of regular listeners\nwhen the station started to program ’soul music’, or did they have any regular listeners\nYou see, my problem is this. We have spent over twenty years building up a\nparticular image for WUOT and programming a certain type and quality of program.\nWe have managed to survive and even to grow because of the loyal support of an ever\nincreasing number of people. Suddenly we are expected to turn our backs upon these\nloyal listeners and program for a small segment of the community who can’t even\nreceive the station. We have never programed popular or rock and roll music on this\nstation but it seems we are remiss in our duty if we do not now program ’soul music’.\nAs soon as we did this, there would be an anguished cry from our following and that\nwould be the last we would ever hear from them."
}