{
  "id": "d611-139",
  "text": "page two\nPrograms for the Disadvantaged\nAugust 27, 1968\n7o Puerto Rican music in New York „ „ o a discussion\n80 Puerto Rican music in performance\n9. A discussion of Hispanic community relations\n10o A recital of Spanish poetry by several poets\n11- A solo recital of Puerto Rican poetry based in African\nsources coupled with a discussion of racial relations\nin Latin America\n12o Giants among folk and popular singers of Hispanic America\n13 „ Hispanic theater in New York\nWRVR recognized that solving the black end of the spectrum of\nracial understanding is only one answer: NEW YORK: HISPANIC CITY\nis anotherc\nCONTACT: Walter Shepard, Station Manager\nKUOW, Seattle has an enviable history in the field., I'll quote\nexcerpts from a recent report by Ken Kager, KUOW Manager who believes\nthat \"to do a respectable programming job during and beyond our crisis\nperiod, an educational radio station must draw upon all four potential\nsources of material available to it-\" Those sources are: (a) Non-\nLocal; (b) Local Public Events; (c) Hard News; and (d) Station-\nOriginated Series. The following definitions are Ken Kager's:\n\"Non-Local: This category, of course, represents the best\nbeing done elsewhere around the nation that has been made available\nfor local broadcasting. When we consider that the local station\nmanager is, in fact, the \"gatekeeper\" who determines which programs,\nof all those available to him, are to be offered in his local com¬\nmunity, it is apparent that his decisions on such series as TRAFCO's\n\"Night Call,\" NER's \"Seeds of Discontent,\" and CBC's 1968 \"Massey\nLectures\" have great significance to his overall planning of his race\nrelations effort-\nWe do not shuffle our feet, stammer, or blush in listing these\nprograms as contributions.of KUOW, even though we had no hand in\ntheir production» Each, in its own way, is a fine series contri¬\nbuting to mutual understandingo And none would be available to the\nup-tight 1 black and white society of Puget Sound if it were not\ncarried on KU0W»\n-■Qca^ Events: This category includes such public events\nas speeches, lectures, panels, seminars, group meetings, and conference."
}