{
  "id": "d611-140",
  "text": "page three\nPrograms for the Disadvantaged\nAugust 27, 1968\nKUOW covers campus and non-campus events, sending crews as far afield\nas Portland, Oregon,, In the past year, more than 500 such special\nevents have been presented exclusively in this area on KUOW. Of\nthese, 75 programs, running more than 82 hours, were on the subject\nof race relations.\nI believe educational stations have a specific and special\nobligation to broadcast such programs to their local communities. We\ncannot expect the commercial stations to do this job, except for the\noccasional \"spectacular.\" We can, and we should — for there can\nbe no doubt that a single broadcast, almost regardless of the day\nor the time of day, will reach a great many more people than were\npresent at the actual event.\nAs a matter of policy, we report all of the racial news,\nnationally and locally, of which we are aware.. This includes the good 5\nthe hopeful, and the progressive news — and the bad, the pessimistic,\nand the regressive. There is a great deal of both kinds — daily..\nWe don't editorialize, dramatize, or play down. We simply try to tell\nit like it is; but tell it.\nStation-Oriqinated Series: We believe it is entirely possible\nfor a station to perform well in all of the first three categories\nof material without doing a really good job on the racial crisis.\nEach station wishing to excel and to make progress in this area\nsimply must get into the field and originate some of its own unique\nprogramming. And it should be highly localized programming.\"\nPart of the scope of KUOW's race relations activities is seen\nin the program titles listed below (which I offer in full because it\nis a source of rich ideas):\nPROGRAMS PRODUCED BY KUOW\nBEARING DIRECTLY ON RACE RELATIONS\nSOUL SEARCH A program co-sponsored by AMS-AWS, the Central Area\nMotivation program and the Anthropology department. Its aim\nwas to inform students about racial conditions in society and\nto make them aware of their own attitudes on and off campus.\nFive programs.\nTHE URBAN CRISIS: EFFECTS ON THE VIETNAM WAR: GUIDELINES FOR\nDEMOCRATIC DOMESTIC POLICIES The speaker was Norman Hill,\nAssociate Director, A. Philip Randolph Institute. One program.\nSEMINAR ON ^ EQUAL OPPORTUNITIES AND RACIAL HARMONY Seattle City\nCouncil sponsored seminar. One program, two hours in length."
}