{
  "id": "d611-147",
  "text": "N A E B\nNational Educational Radio\nA DIVISION OF THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue N.W. Washington D. C. 20036 Telephone 667-6000\nEXECUTIVE DIRECTOR\nROBERT A. MOTT\nAugust 20, 1968\nFourth Radio Report, Programs for the Disadvantaged\nKen Clark, Project Director\nHave any of you found that some of your programming for, by or\nabout minority interests has prompted attacks on you or your station?\nDonTt ever feel you are alone if that has been the case. It is\ncommon. And will probably become more so as this kind of work con¬\ntinues.\nJohn F. White, President of NET not so long ago discussed this\nissue in regard to public television. Substitute the word \"radio\"\nand what he says is just as applicable to you:\n\"If public television is ever to become a major force\nin our national life — if it is to achieve stature,\npublic respect, and public support — it will do so\nnot because we were quiet and balanced, but because\nwe spoke truth and spoke it boldly and performed a\nvaluable public service not available in any other\nplace. DonTt tell me there are those who would\ndrive you out of town if you did this. I know\nthere are those who will try.\nBut the simple question is: Will we do what we\nbelieve is right or will we do only what we know\nwe can do without ruffling feathers? If we do what\nwe believe is right, and do it well, I donTt think\nthey can drive us out of town. Now is the time for\nconscience to rule our actions; it is not the time\nfor expediency or even for compromise. You cannot\ncompromise with prejudice or ignorance or apathy.\"\nKFJC, Los Altos Hills (Foothill College) is not about to com¬\npromise. Far from it. Two weekly series are now in the hard plan¬\nning stage and when implemented promise to introduce not only a\nbright new image for the station, but provide a solid public ser¬\nvice as well. Untitled at the moment, both series are being sup¬\nported by the local minority groups for whom they are intended.\nAll daylight hours during each weekend will be devoted to the two\nseries, one with a premise based in. legal aid, the other in the\narea of consumer education."
}