{
  "id": "d611-148",
  "text": "2\nProgram #1, now scheduled as a Saturday entry will aim toward\nthe black community, particularly the East Palo Alto sector. Recog¬\nnizing that so many black listeners are in ignorance about their\nlegal rights, KFJC proposes to offer a series of legal aid experts,\ninvited to sit in at the station and take phone-in and write-in\nquestions from the listeners. The format will, however, be loose.\nTalks, discussions, occasional interviews and considerable soul\nmusic will make Saturday daytime listening something new just for\nthe communityTs Blacks. Not only will they have their \"own” service,\nbut they can take pride in knowing they have a genuine voice on a\nstation that enjoys considerable listenership.\nProgram #2, the other half of this program adventure hits for\nthe Spanish-American population. Again, an all day series on Sundays,\nconsumer education will be the significant element. Again, there\nwill be experts to handle the letter and phone-in questions. Spanish-\nMexican music will be emphasized. And all talk, be it interview, dis¬\ncussion or question-answer or announcements will be heard in Spanish.\nThe above listed series are already being talked up in black and\nSpanish-American communities and when they hit the air should have\nloyal followings.\nKFJC, always an imaginative outfit, also is now piecing together\nthe superstructure for an \"open community forum\". In this series,\nthe Disadvantaged will become \"active participants\" in a group set¬\nting in airing the problems of poverty and in discussing with recog¬\nnized community leadership the methods and the programs through which\nthey can overcome their problems. Not only will the Disadvantaged\ngive voice to their feelings, but hopefully will also find some\nstimulus that, if sustained, can really affect their lives.\nSome topics now under consideration for this series include:\n\"What can we do about inadequate housing in our\ncommunity?\"\n\"What can we do about the lack of adequate medical\nfacilities?\"\n\"What can we do about up-grading education and\nimproving our schools?\"\nKFJC isoperating on the premise that where the availability for\ndialogue exists, there often is an avoidance of violence, a feeling\nof helplessness and a tacit acceptance of worthlessness.\nCONTACT: Stuart Roe, Station Manager\n* * * * *.v"
}