{
  "id": "d611-150",
  "text": "- 4 -\nThe Host makes a point of visiting with his guests well before\nair time, preferably at their place of work. This not only gives the\nHost confidence, it unearths a richer vein of information.\nReaction from the estimated six thousand junior (and a few senior)\nhigh students who regularly listen to the series has been encouraging.\nMost of them didnTt know the Black guests prior to the series, and\nit is a revelation to them to realize there are that many successful\nBlacks in their own city.\nWhat kind of positions do the guests hold? Well, for example,\nsome of those who have appeared are a Minister, Hat Maker, an Attorney,\na Judge, a Policeman, a Mason, an owner of a Paint and Wallpaper com¬\npany, the Assistant Fire Chief, an Assistant to the Governor, a Car\nDealer, the Supervisor of the Department of Music for the Columbus\nSchools, the Assistant Director of Public Affairs at a local commer¬\ncial television station, a Senior Secretary, a Dentist and a Grocer.\nThe series discusses the qualifications required for various\ntypes of work and gives hints and tips to students in school today\nas to possible future opportunities in those areas.\nLocal teachers are high on the series; they are given a brief\nin advance to prepare the students for the interview. In many cases,\nthe radio guest subsequently has been invited to various school class¬\nrooms to meet personally with the students and expand his background\nfor them.\nMany local civic groups are helpful to WCBE in finding guests\nfor the series (e.g. the Urban League, the Ministerial Association,\nlocal BusinessmenTs Association, etc.) .\nRemember the statistics of this series: two guests each week\nfor a period of three years ... and the series shows no signs of\nlagging.\nWCBE is reluctant to take much credit for lowering the Columbus\nschools drop-out rate. But the rate has dropped noticeably since the\nseries went on the air.\nFor you station managers who canTt afford to get into the move¬\nment just now in an expensive way, consider PROJECT AIM. It is a\nremarkable little series that has the cooperation and interest of\nstudents, teachers, parents, school administrators and local civic\nbusiness and profession leaders. With that kind of backing for the\npast three years, the series has to be accomplishing something worth¬\nwhile.\nCONTACT: John H. Sittig, Director Radio, Television and\nAudio Visual Education\n* * * * *"
}