{
  "id": "d611-153",
  "text": "-2-\nThe program then turns to students from colleges in the\nGreater Boston Area who tell of their work in the ghetto and\nexpress fear that they may be contributing to the black backlash\nby imposing white middle-class values on the very people they\nare trying to help.\nITEM: The big gun at WGBH at the moment is \"Say, Brother. \"\nHarlem native Jim Boyd who produces, sees the show as a sort\nof TV newspaper where the positive constructive events and ideas\nof Boston's black community can be reported with accuracy and\nhonesty.\nThe program has twin thrusts: (1) to make the Boston blacks aware of\nthemselves in a positive way and (2) to make the Boston whites focus more clearly\non a people and a part of their own city they know so little about.\nTelevised in color, the hour-long program offers news of the black\ncommunity, a billboard of cultural and social events in the area, Afro-American\nhistory, and entertainment.\nBryant Rollins, a former Boston Globe reporter and Bay State Banner\neditor who is now with the Urban League handles the news. Sarah Ann Shaw,\nwho trains VISTA volunteers, reports on political events and activities in the\ncommunity and chats with community personalities, reaching for the real views,\nthe real attitudes. And 17 year-old Stewart Thomas covers the Roxbury and\nenvirons beat from the teenager's point of view.\nThe Afro-American history and culture segments are prepared by\nRoosevelt Weaver of Hilltop House, Marcus Mitchell, Director of the Negro\nHistory Museum in Boston, Dr. Adelaide Hill who heads Boston University's\nAfrican Studies Program plus a variety of guest experts.\nIs it working?\nYes, if calls and letters from the white community and a vocal awareness\nin the black community mean anything. The audience is growing, there is no\nquestion of that. It's the kind of show on which anything can happen. In color,\nviewers find 50 to 75% of the features going live.\nNews and comment, entertainment (mostly local but including outside\nprofessionals such as James Brown) and discussions by representatives of black\ncommunity organizations make the weekly hour slot a thing to reckon with.\nStaffing is Black for film cameramen, the audio engineer, production\nassistants, the associate director and three associate producers. . . all whom are\npa id. Of course it's controversial. For Boston. . .white and black, it's a whole\nnew world. SAY, BROTHER is important to all of us who, in our own halting\nway, still believe in the dream.\nCONTACT: Hartford N. Gunn, General Manager"
}