{
  "id": "d611-154",
  "text": "-3-\nWNDT, New York is about to launch a pioneering effort that someone\nshould have thought of doing years ago. The series, funded by a Ford Foundation\ngrant, is titled SOUL! Based freely on the \"Tonight\" concept of provocative\ndiscussion and swinging entertainment, the program will be by Blacks for the\ntwo million plus Blacks who live in New York City.\nCo-Producers of the series are Ellis Haizlip, a Black who has been\nco-producing American shows in Europe for the past five-years, including\n\"Black Nativity, \" \"Trumpets of the Lord, \" and \"The Amen Corner. \" His\nwhite counterpart: Michael Landwehr who comes to WNDT from WNEW-TV\nwhere he spent four years as special projects producer.\nAnyone familiar with the New York scene will recognize the name of\nReuben Phillips, former Music Director of the famed Apollo Theater. Mr.\nPhillips is putting together a combo for the series made up of some of the jazz\nand rock guests of the city (and they will be mainly black).\nAuditions are underway to find a host and talent. Singers, dancers,\ndrama groups, comedians. . . .the full spectrum of entertainment will be recruited\nfor what has to be one of the most exciting and ambitious experiments of this\nor any other season. If I may hazard a personal guess, it won't be long before\nthe commercial networks imitate this idea in one form or another. But WNDT\nwas there first. We can be proud that \"one of ours\" had the courage and the\nimagination to try this.\nWNDT has had an integrated staff for years. Blacks there function as\nproducers, production assistants, cameramen, associate directors, secretaries\nand in development.\nA fair number of telephone contacts and letters tell the station programming\nfor the Disadvantaged does reach the inner city. TALKING BLACK, discussed\nin an earlier program report, helped turn the station on. Viewer response\nindicated that an intelligent, sensitive and professional effort at digging into the\nblack community was needed, applauded and appreciated. More in this direction\nseemed obvious. SOUL! is WND'l's response. Watch for more on this series.\nIt could be a milestone.\nCONTACT: Christopher Lukas, Director of Cultural Programs\n# * * #\nWCNY, Syracuse is a relatively young station that was determined to be\ninvolved from the beginning. The Syracuse \"inner city\" comprises approximately\n20, 000 Blacks and it is within the context of that potential viewership that the\nstation has made its programming moves for the Disadvantaged.\nOver a year ago WCNY worked out a pilot project with the city schools\nto take on a group of students teetering on the dropout precipice. Over an eight"
}