{
  "id": "d611-155",
  "text": "-4-\nweek period, the youngsters were trained to be Audio-Visual Aids. They learned\nabout graphics, the use of tape recorders, film projectors and television receivers.\nThis was strictly a voluntary thing after school. The participating schools reported\nthat the trainees, after returning to school, not only performed well with their\nnew technical skills but in general improved in their academic work. WCNY\nhopes to start a new similar cycle of training soon.\nThe station is also investigating the feasibility of an internship program\nfor high school students. This would be an on-going activity in which a selected\ngroup of promising students would be trained in communications skills through a\ncombined program of instruction and on-the-job training.\nOne of WCNY's most interesting projects to date was THE VISUAL\nGENERATION, a 90 minute special funded by the Carnegie Corporation of New\nYork in a grant to the Eastern Educational Network. The Executive Producer\nwas Art Irons of the Syracuse station staff.\nThe program gave disadvantaged kids in various parts of the country an\nopportunity to look at their own lives and times. Projects in six cities were\nundertaken, then the films put together by WCNY.\n1. In Orono, Maine, the youngsters filmed an essay showing\nthe differences between urban and rural life for the poor.\n2. In San Francisco, the Performing Arts Workshop, a\ntheatrical group working with the Disadvantaged was examined.\n3. Pittsburgh stressed the performance of a high school jazz\ngroup.\n4. Syracuse filmed a play written by a 16 year old girl.\n5. New York City took up life in a ghetto.\n6. Hershey, Pennsylvania offered a slide study (with voice over)\nof one young man's family.\nThe resulting production told a great deal about not only the young film\nmakers themselves but about their own unique view toward life.\nBLACK ON BLACK is a production in the planning stage. Geared for\nthe black community of Syracuse, the hour special once each month will feature\ntwo hosts: (1) Ellwood Berry, a former teacher who currently published a black\nnewspaper \"The Liberated Voice\"; and (2) Miss Eleanor Russell, a 17 year old\nhigh school senior who has been active in Youth Opportunity Unlimited theatrical\nproductions.\nUtilizing entertainment, the series will follow a loose format to include\nintensive discussions on local issues. Job opportunities plus local and national"
}