{
  "id": "d611-156",
  "text": "-5-\nnews of Blacks will be pushed.\nWCNY reports problems undoubtedly shared by stations in comparable\nsituations: (1) It is a U in a V market; (2) Motivation of the inner city viewers\nis difficult to stimulate; and (3) Getting the \"word\" to the viewers about the\nstation programming is not simple. However, viewer response already tapped,\nsuggests WCNY is clearing the hurdles and probably has the most effective\nstation-inner city relationship in Syracuse.\nCONTACT: Arthur Paul, Assistant General Manager for Program\nOperations\n* * * *\nWYES, New Orleans explains the use to which it expects to put a recent\nFord Foundation grant in terms of what it calls CRT (Community Related\nTelevision).\nCRT is an approach toward solid integration of community activity and\ninterest with the best resources of the public television station. With the funds,\nWYES has planned four new series to go in the Fall. Here is how it looks at\nthe moment:\n1. EQUALTIME stresses a human relations view of the news.\nOne hour in length, to be aired once each week, EQUALTIME\nfilm cameras will select an issue or event that will probably\nnot receive intensive coverage by any other station. On the\nprogram, the film insert will visualize the news, then a panel\nof experts will make the thing come alive.\nEOUALTIME's first topic: the opening of the New Orleans\ncity school system. What is the progress toward an integrated\nschool system fourteen years after the landmark Supreme\nCourt ruling? That is the issue and WYES hopes to take it\napart and see what makes it run in an instructive,, informative\nway.\nOn EQUALTIME and the other two new weekly series, a panel\nof experts will be augmented by a studio audience that will be\nurged to ask questions. In addition, a viewer phone-in will\nbe a permanent feature. Through the three avenues of\nexamination, the topics treated should get a pretty fair shake-\ndown.\n2. THE NEIGHBORHOOD SHOW, another weekly, is planned for\na two hour format. This will be live. It will be remote, with\nan emphasis on ghetto visits. The show will be relatively\nunstructured letting the place tell its own story in terms of"
}