{
  "id": "d611-159",
  "text": "National Educational Radio\nA DIVISION OF THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue N.W. Washington D.C. 20036 Telephone 667-6000\nROBERT A. MOTT\nAugust 12, 1968\nThird Report, Radio Programs for the Disadvantaged\nKen Clark, Project Director\nWilliam A. Emerson, Editor of the Saturday Evening Post, exam¬\nined the issue that relates to your work and mine in the August 10,\n1968 issue.\n\"The ghetto is a container—fx>r\" the condensing and\nstoring of undesirable human beings» We are put¬\nting these people in vertical filing cabinets cal¬\nled tenements, and we are literally filing them away,\nstacking them up as high as we can make them climb.\nAround Harlem and all of the other ghettos, we have\ndug a cultural moat so deep and treacherous, we have\nbuilt a wall of deprivation so slippery and high,\nand we have strung around them a barbed-wire thicket\nof prejudice so forbidding that even those who keep\nthe will to escape need a terrible bit of luck to\nmanage it.\"\n\"People-filing\"o0oa pretty appalling concept. But does the\ntruth of it apply to your community? And what are you as a broad¬\ncaster committed to the public interest doing about it?\nWPLN, Nashville may surprise you. Caring, and acting on that\nconcern since 1962, the station operates with a fully integrated staff\n— not token — fully integrated. With one exception all black employee\ncome from the ranks of the \"disadvantaged.\" Some were trained on the\njob under the Youth Corp Project and then employed. The exception is\nan announcer who had ten years experience in commercial broadcasting\nbefore joining WPLN. All were employed because they had something to\ncontribute — not because they were black.\nWPLN points to NASHVILLE FORUM as its most notable series.\nOriented toward local attitudes and actions, the series has dealt\nwith police-community relations, race relations, housing and the\npoverty program. Whenever possible, leaders of both sides of an\nissue were faced with each other across the WPLN microphone. Often\nfor the first time. That wasn’t a solution in itself, but WPLN had\nstarted the dialogue. That in itself was accomplishment.\nA shorter series, \"1-40\" told of the human displacement problem\ncaused by the proposed routing of new Highway Interstate 40 on the\nperiphery of Nashville. Actual location of the highway is being fought"
}