{
  "id": "d611-160",
  "text": "page two\nProgram for the Disadvantaged\nAugust 12, 1968\nin the courts, but in the meantime, a number of low income people who\nhave lived in the area most of their lives have been bumped» What\ndoes this uprooting do to people socially, economically and psycho¬\nlogically? That’s what the series was all abouto A Fisk University\nprofessor, Dr- F» Coles, Director of the Race and Poverty Research\nProject at the school moderated.\nCurrently, the station is into replays of a twenty-six part\nseries titled \"Books in Black Print,\" a discussion-commentary format\nabout books by Negro authors= (The series was originally produced by\ncommercial outlet WBOL with some background help from WPLNo)\nCONTACT: Alvin L* Bolt, Station Manager\nKBPS, an arm of the Portland, Oregon Public School System has\nconcentrated, appropriately enough, on young people.\nITEM: The station took a soft sell approach and produced a phone\nin for teenagers in the 7th and 8th grades from nine separate schools\nin disadvantaged areas of the cityu Called \"Teen Line,\" the tele¬\nphoned questions were answered by a rotating panel of other teens.\nLow Key? Yes» But remember this was the first time these youngsters\nwere given a public voice., It could be that in the long run, that\nfact alone will prove more valuable than half a dozen adult-oriented\nprograms „\nITEM: A series was put together using books written by well-\nknown authors about individuals who had been challenged in life with\nall kinds of handicaps•„.and who overcame theim The stories were\nadapted by Oregon's leading juvenile writers and dramatized by casts\nof professionals who volunteered to do the job* The stories, geared\nto juveniles in language that made sense to them, is reported to have\nscored heavily with listeners.\nITEM: KBPS was the only station in the city to tape a two-hour\n\"Soul Assembly\" from a nearly all Negro high school„ Again, the kids\nfound a communication outlet for the ideas and the music that was\nmeaningful to them*\nITEM: Then the station tried an experiment on an in-school basis\nletting disadvantaged kids broadcast their own creative writing. Pat¬\nricia Swenson, KBPS Manager says the series really was popular with\nthe nine-school hookup. The inner city language was not always intel¬\nligible to other listeners, but for the youngsters an incredible\nthought started to occur.. . „ someone cared.\nCONTACT: Patricia L« Swenson, Station Manager"
}