{
  "id": "d611-179",
  "text": "-12-\nproblem solving. The people selected the topics, participated in editing\ndecisions, and determined the extent of distribution. Some of the goals\ninclude developing insights into community problems and a desire by the\ncommunity to act on them, the fostering of more effective community-education-\ngovernment cooperation, and the promoting of greater understanding and a\ndesire for action in communities with similar problems by showing the films there.\nThe basic approach, used in this country, might be of great value in\nachieving government-industry-education-community cooperative efforts, each\ndoing that which it can do best, to establish important communication links\namong the disadvantaged minorities, and between these people and majority groups,*\nFinally, I want to mention just one more effort within our own government.\nMany of our government agencies have been making strong efforts to meet the needs\nof the inner-cities. Last month, the Federal Interagency Broadcast Committee,\nconsisting of representatives of thirty-tv;'o federal departments and agencies\nwith communication responsibilities, recommended the establishment of a\nCommunications Liaison Office on Minority Group Matters. This office, if\nestablished, would*among other things, cooperate with■industry and other\npublic and private organizations in facilitating the development, distribution\nand use of materials oriented toward minority group needs, specifically\nincluding the needs of the urban ghettos. The agencies would be encouraged and\nassisted in diversifying materials, not only for informing minority groups\nof services available to them, but materials which would assist intra-minority\ngroup communications, and materials which would be aimed toward educating the\nmajority society on the special problems and needs of minority groups. The\nOffice would also develop a broadcasting skills bank of minority group\npersonnel so that agencies, through employment of more minority group members,"
}