{
  "id": "d611-184",
  "text": "-2-\nnumber of Senators have linked the riots to educational deprivation.\nSenator Robert Kennedy said: \"We pass bills and appropriate money and\nassuage our consciences, and local school systems keep right on doing\nthings the way they've done them for decades.\" Senator Jacob Javits sees\neducation as part of the solution to offset the \"frustration, despair and\nanger\" that \"create the conditions which bring on the riots.\" Senator\nWayne Morse stated that the racial unrest in urban areas was also due,\nin part, to \"the educational starvation which the Negroes have suffered.\"\nNew York Mayor John Lindsay, following the disorders here a few weeks\nago, noted that the appropriate agencies have not been able to \"make con¬\ntact\" with the teenagers who made up most of the disorderly mobs. In\nPhiladelphia a while ago--just before the sweep of riots—a high official\nof the school system told me of the threat of a riot, an attack upon a\nschool in a so-called white neighborhood. The white people were the\nincipient rioters, objecting to the fact that a number of non-white\nchildren came into their area to attend that school. The white children\nof the community were part of the threatening mob. The difficulty, said\nthe school official, was communication--to reach these white people with\ninformation and understanding to \"cool them,\" and to help them learn\nresponsibility.\nIn the domestic crisis of our time we come back, then, again and again,\nto these two interacting areas: education and communications. We come back\nto the need for some people to learn about the special problems and needs of\nother people, even in the same community. In an article in INTERCOM in\nJanuary, 1967* Dr. Seymour Fersh stated: \"The best way—though certainly\nnot an infallible one—to learn about other peoples and cultures is by\ndirect experience. The least effective way is by words because words\nthemselves are a man-made product of one's own culture.\" This experience\nI think I may interpret as including communication of visual and aural\nexperiences that are not verbal alone and, most important, including the\npsychological impact at the same time of the media in themselves, aside\nfrom content.\nWe have so much to do in so many formal education areas, those of us\nwho are dedicated to the communications-transportation-energy revolution,\nthat it may seem unfair to say that it is further incumbent upon us to use\nthose means of communications in which we are expert to meet the needs and\nproblems of those people who cry out verbally in despair and who act out\nphysically in desperation; to meet the needs and problems of those who ciy\nout in dismay and uncomprehension when they view the desperate reactions of\nmany of their fellow citizens; in other words, to communicate between and\namong all the peoples of our country. Is there any reasonable alternative?\nRecently I had the privilege of providing consultation in the planning\nof a program for one of our large city ghetto areas.\n(I might, as an aside for a moment, comment on that word \"ghetto.\"\nIt is significant, I think, that it is the term \"ghetto\" that is being\nused more and more in newspapers and on radio and television. We used to\ncall those areas slums. Now we use a term, that refers to a group"
}