{
  "id": "d611-186",
  "text": "-4-\nWe must use the mass media to provide a socializing situation for\nthe child, to make the real world a part of the classroom, to provide the\nproblems of the real world as the learning problem; the solutions learned—\nor at least the understanding obtained--is what constitutes education,\n/information regurgitated on examinations is not education. And we must\nrecognize, too, that print is only a small part of the child's (and adult's)\ntotal daily communications existence.7\nThe visual and aural input into the classroom must turn the classroom\naway from the classroom, must remove the four walls. We must bring in those\nexperiences that are meaningful and those people who are meaningful. The\n•terror of being put in a classroom surrounded by tasks that he cannot do\nand that have little meaning to his real world, being surrounded by white\nfaces in suits and ties that drive out of the ghetto in cars every afternoon\nto another world--these are conditions that are unreal, that have no meaning,\nand it is incredible that anybody can be expected to learn anything under\nthem.\nWhat is true for the child in the classroom is, by projection, true for\nthe adult in the apartment house or on the block. We have learned that the\nold ways do not work. The traditional methods of communicating with adults\nhave failed again and again, in Detroit, in Newark, in Milwaukee.\nThe first task is not to organize a group to discuss housing problems,\nor to set up an unemployment opportunity office, or to create sidewalk\ncolleges, or to bring in a task force of expert teachers to help children\nlearn how to read.\nThe first task is to make a dent in the curtain of hopelessness that\nhas been pulled down over every Negro child and adult, every Negro family,\nevery Negro community that has been ghettoized into economic and cultural\npoverty.\nTo try to bring some bit of reality, as opposed to the oft-broken\npromises, to the dream--not deferred for these people, but -shattered—that\nthere is some hope for their children, if not for themselves.\nEadio and television are the primary means of communication these\npeople have with the outside world and therefore must be given a primary\nemphasis in any inner-city plan.\nIn my own mind I have no doubt that the daily and nightly electronic\nvisions about all those families with pleasant homes and nice cars and well-\ndressed and well-fed kids makes a man very uncheerful about the two rooms\nhis family shares with the rats.\nIf television has shown the ghetto man, woman and child the suburban\npromised land, does it not seem logical that television should go on from\nthere and show them how to reach that land?"
}