{
  "id": "d611-19",
  "text": "-2-\n” something” is not always clearly defined or neatly executed. But the effort\nis unmistakable. This is action NOW.\nProgram approaches are many and varied. * It might be useful to\nbriefly highlight a few station efforts. WBUR-FM, Boston made contact\nwith simmering Roxbury, set up a citizens' committee from the black\ncommunity, hired three black anchor-men and went on the air with \"The\nDrum” - ninety minutes nightly. The black Bostonians have a voice.\nWHA-TV and FM devoted one week of saturation day and night broad¬\ncasting to investigate the plight of Milwaukee’s inner city poor. That's a\nlot of air time. The commitment paid off in exciting public service. What\ndoes that mean to the blacks of Milwaukee? They credit the series for the\npassage of Milwaukee's first open housing ordinance.\nKLRN, San Antonio-Austin is tackling the Mexican-American's de¬\nprivation with \"Periobico”, a series done in Spanish, primarily on remote\nin the barrio, by barrio residents - expressing their ideas, their hopes,\ntheir demands. KLRN is the catalytic agent giving thousands of people their\nown medium - for the first time.\nWCVE, Richmond is taping a thrity part series of half-hour programs\ntitled \"Americans from Africa: A History”. It's long overdue.\nTen-watts can make a big sound too. KFJC-FM, Los Altos Hills plans\nto make day-time weekend programming a minority right. Saturday is for\nthe black community, Sunday for Spanish-speaking Americans,\nWBFO, Buffalo has a store front satellite station in operation - in\nspite of a lack of foundation funds. KBPS, Portland has the city's only phone-in\nseries for black students. WMHT-TV, Schenectady hits hard with a phone-in\nfor adults.\nWTHS, Miami shares it's television series' audio track with a local\nFM outlet. WETA-TV, Washington, D. C. emphasizes jobs as does the\nSouth Carolina ETV Center. The Alabama ETV Network programs for the\nrural Appalachia housewife while WHYY, Philadelphia carries meetings of\nthe School Board live and in angry session.\nSmall stations, large stations, state and regional networks and the\ntape networks of NER and ETS/PS, NET and PBL - a variety of program\nsources and program carriers and program organizations - each with a role\nto play, each a part of the social action fabric in public broadcasting today.\n* See Appendix A\nNOTE: The initial television report and the addenda were prepared by\nDr. Richard J. Meyer with Mr. Chalmers H. Marquis. The\nthird report was prepared by Michael Hobbs."
}