{
  "id": "d611-195",
  "text": "-2-\nthe station. How the funding will be defined has not been settled (i, e. scholar¬\nships vs. salaries), but the ultimate solution will be something from which the\nparticipants can take a sense of personal pride.\nFor one full year, KSPS will work with these trainees.,,. and they will\nput in a 40 hour work week plus attend and participate in a weekly three hour\ncommunications seminar held at the station.\nThese kids will make up the crew of KSPS. They will train and function\nas camermen, floor managers, boom operators, back up personnel in the Art\nDepartment etc.\nThe station had a black camerman on its paid staff all last year and was\nrewarded with the talents of a gifted employee. Now KSPS is going for big\ncasino with an all-ghetto-kids approach (most will be dropouts). That takes\npits. I think we owe KSPS our moral support for their pioneering plunge. The\nidea suggests a whole new bag in the station-community-Disadvantaged troika.\nStudents will receive at the end of the year’s work a certificate from the\nSpokane Public Schools noting certain numbers of credit hours achieved toward\na high school diploma as a result of the KSPS experience.\nClearly a station that runs ahead of the crowd, KSPS is readying\na new series of six half-hour programs called \"Live In My Skin\" which tries\nin a very different way to pull apart the hangups blacks and whites have about\neach other. ... and perhaps to reconstruct a little uptight thinking in the\ncommunity.\nThe series will tackle a different problem or issue each time and role-\nplay with a Black acting out a situation as he thinks Whites would live it.\nConversely, a White will act the part of the Black in the situation. Each will\nhave an opposite race counterpart who will only interupt the dialogue if the\nroles are not being played with accuracy and understanding.\nSuch situations as making a job application, and school enrollment (or\ndropout) will get the \"Live In My Skin\" treatment. Sounds wild, if it’s kept\nhonest. I believe it will be. KSPS deserves the confidence of the Spokane\nblack community by being honest from the start_by saying, \"Look, isn't\nthere a basis for some kind of friendship between us?\" Now the station is\ntrusted. Mike Pengra sums it up by looking forward to the day when \"we can\nall finally personally get there. \" I've a hunch KSPS may get \"there\" before a\ngood many others.\nCONTACT: Mike Pengra, Program Operation Manager\n* ❖ * sfe\nThe Eastern Educational Network expending one grant and receiving\nanother is very much involved in minority issues. In January, EEN received"
}