{
  "id": "d611-197",
  "text": "-4-\nProgram #2 will be a follow-up with blacks, having viewed and heard\nthe first siiow, opening up their thoughts to the problem. What has been done?\nWhat is accurate about the program? What is inaccurate and why? Can the\nwhite man ever tell it like it is? And so on. The two-parter doesn't expect to\nfinalize answers. But maybe it will stir up questions that won't go away. And\nthat's a start.\nThe stations do not have any blacks on their full time staffs, however\nmany black students participate in the operations and programming on a part\ntime basis.\nAnd speaking of students, WUSF is active in the Upward Bound program\nfor a second year. Disadvantaged kids (Puerto Rican, White and Black) spend\ntime on the University of Southern Florida campus in a variety of summer projects.\nWUSF invites 10 to 20 down three nights a week to participate in a communications\nskills project designed just for them. Use of the equipment, writing, directing,\nannouncing and producing are all tapght and the students are urged to try them¬\nselves out on camera and mike.\nThe Upward Bound project at WUSF last 1 1/2 months. Hopefully, some\nof these kids will join WUSF staffs in the future; some are already showing real\ntalent. The industry needs trained people, WUSF is sure some of the youngsters\nwill find their niche in broadcasting as careers. That's the name of the game\nand educational broadcasting in Tampa is playing square.\nCONTACT: William M. Brady, Radio Coordinator and Program Manager\n* sjc * *\nWETA, Washington, D. C. has been working on a jobs-oriented series\nsince November. It's an interesting story to watch unfold because the format\nhas changed as the station discovered it was over reaching its Intended audience.\nIn the original series, a Moderator (black) handled a discussion format\nwith various employers ranging across the job spectrum who would talk with\nviewers on a seven telephone hookup arrangement. The Moderator had a solid\nbackground in employment field. People with jobs to offer appeared and described\nthe work. The program urged viewers to telephone for more information and to\ndescribe their own qualifications. r]\nSounds good so far. What happened? The particular jobs turned out to\nbe primarily marked for skilled labor and for blue collar-white collar positions,\nin other words for people who already had a fair shake.\nWETA wanted to get to the hard core, to reach the inner city residents\nwho had not found their own \"out\", who felt they never would have a chance at\ndecent employment."
}