{
  "id": "d611-198",
  "text": "-5-\nThe station was granted funds by the Ford Foundation to continue the\njob series under a new format. Titled \"Jobs 26\" (Channel 26), the series\nexpanded to four 1/2 hour programs each week and will go for a total of 208\nin the current project.\nIn the new version, there are two hosts; Petey Green, a Soul Brother\nwho knows the ghettos first hand, who has a prison record, who has struggled\nhimself to go straight in the White Man’s world; and Dick McCormack, a White\nwho has been in the movement for some time, doing a variety of things which\ninclude a stint with Sargent Shriver and the Office of Economic Opportunity.\nGreen and McCormack work well together, complimenting each other in a\nlively, entertaining way.\nA \"Blackboard Girl\" (black) urges viewers to phone in throughout the\nprogram. Her pitch is credited with really getting the calls in. Green, some¬\nwhat of an instant celebrity in the Washington inner city, talks the language\nof the ghettos. His sincerity can't be denied. He's been there. And back.\nGuests who know the job scene are invited on the program. They come\nprepared to talk honestly, without reservation, to anyone who calls in.\n. y ?\nA battery of phones are manned by volunteers who handle the calls that\nofferi light up the switchboard. Phoners are given the information requested,\nor urged to phone the appropriate number at their convenience. . . .then encouraged\nto join in the job talk with Green and McCormack, sharing their own view and\nexperiences.\nIts not all serious. Humor finds its way into the series as the hosts\nspark each other, their guests and the phoners toward very human exchanges\non job-hunting. ... an experience we can all relate to.\nA part of the JOBS 26 project will be a follow-up study to be conducted\nby a research unit at George Washington University. Green and McCormack\nare still flexible with the format and are exploring the possibility of any change\nthat further opens up the series to the inner city audience.\nWETA is into re-runs of a successful series called ROUNDABOUT, a\n15 minute program twice each week with a Negro host who chats with a bi-racial\ngroup of pre-schoolers.\nThe station does more than talk about jobs for Blacks. On the staff; an\nAssociate Producer, an Engineering Supervisor and a Secretary. The JOBS 26\nstaff is primarily black. In addition, three students from Howard University\nare part time employees.\nWETA is also interested in training and has set up an exchange program\nwith Howard. Two staff members teach various aspects of television on the\ncampus. In return, a TV production class meets spends four hours each week"
}