{
  "id": "d611-204",
  "text": "Martin Gal\n-2-\nAugust 2, 1968\nHow about a sample script? Semi-scripted.... o. k. But don't\npotential backers need something more concrete to put their money on?\n(I'm sure you know more about this than I do, but that's the way it seems\nto me).\nAnd^here is the budget breakdown. I think if I was Joe Founfiation,\nI'd be willing to give my attention to this project once... and I'd be irritated\nif it didn't tell me quite clearly what it would cost me.\nWatch your wording and remember your readers. On* A-3 you\nsuggest the shows can be previewed by social agencies who will then be\nbetter equipped to \"handle their clients on a new basis. \" Something tells\nme the social agency types won't look at it that way at all. If anything, I'd\nsuspect they'd be anti-series to begin with.. .but even more so if you tell\nthem you're going to equip them to do their jobs better.\nDo you really have to pay a social scientist to analyze the series?\nIn this case would it be inappropriate to get the MSU Department of Sociology\n(or some more appropriate department) to co-sponsor the series and provide\nthis kind of expertese free of charge? (They might even welcome such an\narrangement... and end up using the series as a teaching tool for their own\nstudents).\nIf I read you correctly, you would plan on five shows each week.\nAn incredible undertaking if done with amateurs. What is the value of trying\nfor so much all at once? I think you are building in an insurrmountable\nproblem for yourself, the station and the participants.\nWhat makes you so sure members of the \"other community\" will likely\ncome forth to help the cause after viewing the series? I'm sorry, but what's\nin it for them? Assuming they watch the shows (and that is a big if) are you\nthat confident of their reaction that you'd include your prognostication in a\nproposal such as this?\nDo I understand you correctly that part of the shows expenses will\ncover the coffee hours in various neighborhoods. Perhaps I misread. But\nif that is your intention, is it likely any foundation or sponsor would accept\nthat? I think paying for the series and paying for the coffee are two very\ndifferent things and should be handled separately. Getting free cups and\ncoffee shouldn't be difficult... but don't ask the series backer to do it.. .\nunless he happens to be a coffee maker.\nI suggest you keep yourself off the Advisory Panel.\na. You are probably not an expert in the field of social welfare."
}