{
  "id": "d611-205",
  "text": "Martin Gal\n-3-\nAugust 2, 1968\nb. WMSB will offer its own expertise (through you) and\nfacilities. .. and promotion. .. and that's enough, isn't\nit? Also, by staying out of the Advisory Group, you\nkeep the station off the hook in terms of a certain kind\nof criticism.\nThis doesn't mean you aren't involved. You can^he,\nreally, in all phases. But why be obvious where it\ncannot help and might even be damaging.\nNot even knowing the members of the Advisory Group, I find I am\nnot very impressed. I don't know who else should be there. .. but the group\nsuggests a tight knit collection of activists who have been heard from many\ntimes before and who, without less obvious members in their group, could\nantagonize by their very non-objective personal persuasion.\nOn approaching possible local sponsors for a \"public service grant\",\nI think the idea should be gotten across that they are helping fellow citizens\nto help themselves.. . to get off the welfare roles,.. and ultimately to campaign\nthemselves for themselves.\nOf course, these are all small, nit-picking observations. You asked\nfor comments and there they are. The important thing, however is that the\nidea itself is so strong. Watch the program reports.,. others are getting into\nthe welfared recipient angle too. No one is handling it like WMSB, though. I\nthink your approach is iresh, obviously dedicated, and calculated to do\ntremendous good. How great it must be for the ADC women to be treated like\nhuman beings. Your attitude alone has to be making a contribution. I hope\nyour series goes. I think you've plugged into something important.\nThere are no funds available through NAEB sources at this time. What\nmany stations have already done is get their proposals ready and submitted\nagainst the day when Congress will authorize expenditures for the Corporation\nfor Public Broadcasting. You might want to consider that approach for this or\nfuture ideas. If interested, the following address could be useful; Mr. Frank\nPace, President, International Executive Service Corporation, 545 Madison\nAvenue, New York, New York.\nFrank Pace is the Chairman of the Corporation for Public Broadcasting\nand will be involved in the allocation of program funds when they finally become\navailable. His office could give you any information you need along these lines.\nIncidentally, I hope you can get to the convention this year as some\nsessions will be devoted to how stations can apply for funding; Should be useful."
}