{
  "id": "d611-207",
  "text": "National Educational Radio\nA DIVISION OF THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue N.W. Washington D.C. 20036 Telephone 667-6000\nEXECUTIVE DIRECTOR\nROBERT A. MOTT\nAugust 1, 1968\nSecond Report, Radio Programs for the Disadvantaged\nKen Clark, Project Director\nAFTER 100 YEARS OF SHOUTING THROUGH EMPTY CORRIDORS..-.LISTENERS!\nThat's what this second report is mainly about.\nWBUR, WAMU, and WKAR decidedly on the train.\nBoston University’s WBUR has plugged into an idea that\ndominates the station's activities seven days a week. The project:\nTHE DRUM, a nightly program across the board from 8:00 - 9:30 PM.\nHere is a little history. Recognizing that many good intentions\nof many stations have strayed toward failure because of lack of es¬\nsential contacts in the black community, WBUR restructured its\nown traditional thought. Again and again, residents of Roxbury,\nthe \"inner city\" of Boston have heard talk, talk, talk about them¬\nselves and about what turned out to be imaginary ideas for improve¬\nment of their situation.\nWBUR was determined to go beyond the-talk stage. The station\nconnected with William Gibson, Negro attorney on the Law Faculty of\nBoston University who agreed to try to help make meaningful con¬\ntacts in Roxbury. A steering committee of black leaders was formed.\nWhat was the gap WBUR was trying to filll1 Local commercial\nstation WILD, primarily oriented to black listeners signs off in\nthe early evening. WBUR was concerned that radio communication for\nRoxbury community had to have a continuous channel of instantaneous\ncommunications, \"not only for black people to communicate with each\nother, but also with the white establishment.\"\nWBUR offered station time, facilities and its own expertise\nto get something going. The steering committee came back with a\nprogram concept that included a telephone talk segment (with guest\nexperts in the studio), broadcasts and reviews of concerts and other\ncommunity cultural events; interviews, live and taped with com¬\nmunity leaders; record shows, and information on job and housing\nopportunities.\nTwo of WILD's black D.J.'s, Jimmy Byrd and Chuck Core, along\nwith Negro newsman Bill Slater of Group W's WBZ were signed on for\nP..ay to serve as anchor men of the new series. (Please note: these"
}