{
  "id": "d611-208",
  "text": "page two\nRadio Programs for the Disadvantaged\nAugust 1, 1968\ngentlemen work for WBUR after their regular jobs are finished\neach day-. Note further that WBUR insists on paying for these\nservices««.it isn't much, but the station doesn't subscribe to\nthe old idea of conning talent into free labor \"for the good of\nthe cause\"* * * a notion that has too long degraded both educational\nradio and television)-,\nWILD promotes THE DRUM frequently and with real impact for.\nits own listeners, who then change frequency on their home receivers\nuoo reports indicate that the switch-over is effortless and not\nthe least bit confusing. (Does this give any of the rest of you\nideas? It should.,)\nThe series has been described as \"a station within a station*\"\nAnd that concept suggests an out for those of you who are trying\nto set up a ghetto satellite but can't find funds. Maybe the\nanswer is too easy, perhaps it doesn't solve the complete problem*\nBut it is a start, and if THE DRUM is any sort of criterion, it's\na pretty good start*\nI asked Will Lewis, Station Manager, and Russ Raycroft, back-\nstage guiding hand for the series, if they were moving toward a\nwholly black production unit* The Steering Committee is all\nblack; the anchor men are black; two communications trainees as¬\nsigned to the series are black* The answer is \"NO.\" The com¬\nmittee itself prefers an integrated team, although the emphasis\nin assigning producers, reporters and writers will be black*\nWhat about feedback? Does the Roxbury community care? Does\nit bother to listen? Affirmative* Letters, telephone calls, com¬\nments from the street indicate THE DRUM is hitting home because the\nblack listeners recognize it as their own thing* One woman, a\nblack resident of Roxbury and owner of a beauty shop says THE DRUM\nis mentioned again and again by her customers* They're listening\nall right*\nWBUR decided that to get at the roots of the ghetto commun¬\nications had to be firmly hooked up and maintained (intellectual,\npsychological and social communications lines)* Who should do\nthat kind of work? WBUR thought it was elementary that the burden\nfalls to the communicators themselves*\nTHE DRUM is only a small part of WBUR*s swinging move into\nthe urban mainstream* You'll hear more*\nCONTACT: Will Lewis, General Manager"
}