{
  "id": "d611-209",
  "text": "page three\nRadio Programs for the Disadvantaged\nAugust 1, 1968\nWAMU, Washington Do C.: Once in awhile a series comes along\nthat soars; by content, format, and production such a series is set\naparto THE VOICES OF POVERTY, produced each week evening by WAMU,\nand in continuous production since May of this year is that kind\nof show..\nThe producers and reporters have gone to the inner city of\nWashington, Do Co to talk with poor Americans who live every day\nwith problems of low income, inadequate housing, unemployment and\nfrustrationo They also talked to community leaders who are trying\nto do something about those problems«\nWhat the series does best is allow a channel of open expres¬\nsion for ghetto residents. One of the most awful things about\nbeing poor is the helpless feeling that you've been left behind by\nsociety... discarded... shut out...no one wants to hear your voice.\nAnd that’s low. When your urgent thoughts are considered so ir¬\nrelevant by everyone else. THE VOICES OF POVERTY roars through\nthe night, attacking man's inhumanity to man with the broadcaster’s\nbest tool: honesty.\nInterviews with and addresses by Carl Stokes, Mayor of Cleve¬\nland; Reies Tijerina, spokesman for Mexican Americans; Rev. Ralph\nAbernathy; Hosea Williams and Sterling Tucker underscore the poor\npeoples' plight with predictable articulateness. It is good stuff.\nBut then listen to the \"nobodies\" talk about growing up in\nD. Co, working there, being on welfare there; trying to live like\na man there when the system has historically said that was impos¬\nsible for a black man.\nTHE VOICES OF POVERTY tells a straight story as viewed by\nits four producers, three black, one white. The series is avail¬\nable to other Eastern and HERN radio stations.\nWAMU, not so incidentally, has two black production assistants\nand two black engineers on its staff. Roger Penn, General Manager\nof the station believes in radio broadcasters getting into this\nthing because they have the resources to make a rich and informed\ncontribution...if only they will...and because they aren't doing\ntheir job if access to the public air waves is denied that public\nwhich is poor.\nBeyond the station's policy of programming for the Disadvantaged,\nconsider the Urban Broadcasting Workshop. This is a joint university-\nindustry project sparked and supported by WAMU of the American\nUniversity, and also supported by WGMS-AM-FM, RKO General Inc.;\nWRC-AM-FM-TV, National Broadcasting Co.; WTOP-AM-FM-TV, Post-News-\nweek Stations; WTTG-TV, Metromedia Inc.; and WWDC-AM-FM, AVCO\nBroadcasting Corp."
}