{
  "id": "d611-21",
  "text": "-4-\nacceptance: William Grier, M. D. , co-author of \"Black Rage”; Dr. Nathan\nWright, Chairman of the International Conferences of Black Power and author\nof many books; and The Rev. Jesse Jackson, National Director of SCLC's\n\"Operation Breadbasket\". The communication hang-up and what to do about\nit will be scrutinized. Following the general session, the convention will\ndivide into television and radio special interest workshops to view and listen\nto extraordinary examples of programs for the disadvantaged, followed by\nexplanations by representatives of the particular producing stations. It is\npossible that this one morning may be one of the most significant meetings\nof this or any previous NAEB gathering. It will indicate the social conscience\nof our industry past and present and, hopefully, will point to the various\navenues of programming and employment we intend to explore in the immediate\nfuture.\nItem: For the first time, the NAEB is hunting funds to provide fifty\ntravel grants to minority peoples who are educational broadcasters - hosts,\nproducers, writers, directors, cameramen, etc. - men and women who might\nnot otherwise come from all over the nation to participate in this convention.\nThey will represent a variety of jobs and the full spectrum of radio and tele¬\nvision stations organizational types. We expect the grant-recipients to help\ncontinue the dialogue started this summer based on various backgrounds of\nentry and experience into the industry.\nItem: For the future, I would like to propose several specifics that\nrelate to the present project. They are offered in the twin hopes that the\nindividualized work relating to race and poverty will be continued and expanded,\nand that the general idea of sharing program information can be extended to\nencompass other areas that are relevant to public broadcasting's side of the\nelectronic fence.\nPROPOSAL\nI. Organization\nA Personnel\n1. Project Director\n2. Associate Director\n3. Secretary\nII. Implementation\nA Duties of the Project Director\n1. Research and write program reports (explore relevance of\ncombining radio and television information into a single\nweekly report)."
}