{
  "id": "d611-210",
  "text": "page four\nRadio Programs for the Disadvantaged\nAugust 1, 1968\nThis year, the month long program provides instruction five\ndays each week for twenty students, most of them blacko These kids\nwere carefully screened first by their high schools and then by\nthe Workshop administrators. They are all high school students\nwho have just finished their Junior year. Those who show real\npromise in communications skills, and who in turn show a sincere\ninterest in our industry, are encouraged and followed up through\ntheir Senior Year. Summer jobs are found when possible. Guidance\nand counselling personnel help chart a university or technical\ntraining program and look for scholarships. And when it finally\ncomes to job hiring.--there will be help enough.\nThe Broadcasting Workshop is a new idea in that it was con¬\nceived as a way of finding bright kids from black neighborhoods\nwho can work their own way toward careers in broadcasting with\nsomeone from the \"Establishment.who is concerned...in their\ncorner. Little things count. Last year, it was discovered several\nof the students weren't eating lunch. Why? They didn't have the\nmoney. Any money. At least none they dared spend on such a\nluxury as mid-day meal. The Workshop thereafter bought lunches.\nTransportation is another stickler. No funds this year, but it is\nbeing looked into because a couple of drop-out experiences proved\nthat some good people couldn't make it because of bus fare. In¬\ncentives to learn. The Workshop approach is one of deep concern,\nfor the individual student, his education, his future employment.\nIf bus fares and lunches are part of the bag...then that's what's\nhappening at WAMU.\nThe D. C. SCHOOLS EMERGENCY INFORMATION NETWORK is also a\nWAMU project. It provides a temporary, inexpensive, rapid means\nof communication between school authorities in urban Washington.\nDuring the riots last April, the Superintendent of Schools\nfor the District found that in some cases he had to wait several\nhours to make telephone contact with certain schools. How to solve\nthe problem? A permanent, open line was installed between WAMU-FM\nand the Superintendent's office. All schools already had radio\nreceivers which were reassigned to an administrative office for\npurposes of the system.\nWAMU is ready to interrupt its own schedule at any time in\norder to activate an emergency announcement by the Superintendant.\nDetailed explanations of how the system works, plus regular, periodic\ntesting, makes the plan a viable and valuable system of communications.\nAny of you managers or program personnel who are sitting around\nidly wondering how on earth your station can relate to the Disad¬\nvantaged, might consider WAMU’s self-definition of \"public service.\"\nCONTACT: Roger Penn, General Manager"
}