{
  "id": "d611-211",
  "text": "page five\nPrograms for the Disadvantaged\nAugust 1, 1968\nWKAR-AM-FM, East Lansing: The stations discovered an inter¬\nesting thing a couple of months ago* Conventional news outlets\nin Lansing-East Lansing and surrounding areas were not covering\nthe efforts of the Michigan poor to campaign locally and nationally\nto raise money for legislative petitions or to facilitate commun¬\nication between the poor of the community and the remainder of the\ncommunityo\nThat seemed serious enough. But then they learned that\nneither newspapers nor the broadcast stations in the mid—Michigan\narea covered any news or efforts of the Disadvantaged. Crazy;\nOf Course, but there it was« Stifled voices of the weak and\nhelpless...its an old story. To the poor who want to be heard\nit doesn't much matter whether it is malicious stifling, apathetic\nstifling or even benevolent stifling. At least WKAR thought so*\nThen they set out to do something about it.\nContacts were made with spokesmen for the Disadvantaged to\ndetermine just which way programming ought to go to do the most\ngoodc Poor housing, unemployment, incentive, health, welfare...\nthese were all useful topics to go after.\nWKAR decided on the Mexican-American community as the prime\nlistening targeto One-half hour per week is devoted to a variety\nof discussions, interviews, and talks with spokesmen for the poor\nand the poor themselves. Among other subjects treated by the series\nso far are (1) Health, including frank talks about VD and the\ninfant mortality rate; (2) the Welfare Department's decision to\nmove out of the poverty pocket to the edge of Lansing into a new\nand beautiful complex of government buildings. . . neglecting the fact\nthat those on the Welfare rolls don’t have time or money to take\nthe two hour bus trip each week; (3) a two-part examination of\nthree labor camps in the area with the Mexican-American migrants\ntelling their own story.\nThe series, produced by Steve Meuche, is low key; it is not\nintended to be sensational. But the audience is coming alive. As\none man recently said, \"For the first time we have the opportunity\nto say something with the knowledge that we’ll be heard!\" No big\ndeal for those of us who have had no trouble communicating. But\nfor those listeners of WKAR who have never had a \"voice\" the series\nis opening up a world.\nIn the mill is a proposal, now under foundation consideration,\nto do a year long series designed for and produced by the Spanish¬\nspeaking Americans in the WKAR listening area.\nWKAR has found a common meeting ground with the Spanish¬\nspeaking in the Cristo Rey Community Center, a program of the"
}