{
  "id": "d611-23",
  "text": "-6-\nstudy this year. Programming for children, \"actualities\",\nremotes, satellite stations and foreign language broadcast\nand student unrest, could clearly be included in an expanded\nproject.\nD. Experimentation\nThe success of the National Educational Radio Network public\naffairs dial-in service suggests the telephone tape concept should\nbe more fully explored to enrich the basic idea-sharing concept\nof the project.\n1. Telephone-tape reports in synopsis could augment the written\nreports. Any member station should be able to dial a number\nin Washington, D. C. any time to get a capsule pre-recorded\nversion of the longer written report in print.\n2. Telephone-tapes could be used for hard programs as well.\n\"Hot\" interviews, special mini-essays, conference-call\ndiscussions on topical items should be provided the dial service.\n3. Periodic conference calls should be initiated to alert stations\nto timely information not appropriate to inclusion in the written\nor dial-in telephone-tape services. For example: News of\nnew HEW fund developments.\nE. Budget*\n* * * *\nIn conclusion I point out that we public broadcasters face a numbing,\ncomplex communications obstacle course. The historical non-dialogue\nbetween majority-minority interests has been sufficiently labored. We must\nbe concerned now with action, with forward movement, with positivism of\nunique dimensions. We must inform ourselves through every possible means.\nThe black community is speaking if we'll only listen. We must read \"Black\nRage\" by Dr. William Grier and Dr. Price Cobbs, Dr. Nathan Wright's\n\"Let's Work Together\", Eldredge Cleaver's \"Soul on Ice\", Dr. Kenneth Clark*s\n\"Dark Ghetto\", the \"Autobiography of Malcolm X\" - and other work by black\nwriters - read and understand the powerful ideas searing their pages. We\nmust talk to the rural and urban ghettos and help them talk back to us. We\nmust catch up with America 1968, identify her weaknesses and use her strengths\nto apply the electronic media to immediate solutions.\nThe way ahead is dark. It is uncertain. It may prove frightening.\nBut we must try the untried, dare the impossible, chart ourselves into the\nknown and the unknown with a conviction that what we are doing is right and\n* See Appendix C"
}