{
  "id": "d611-27",
  "text": "page tw-o\nPrograms for the Disadvantaged\nOctober 11, 1968\nMeanwhile, Denton took on those students designated as engineer-\ntrainees o\nConstruction was begun. A studio began to take shape, and out of\na variety of materials, including some used TV sets, a console\nand all the companion equipment was assembled and made operational»\nWRHS went on the air with an output of between five and ten watts\n(depending on the atmosphere and humidity),. The signal, broadcast\nover power lines, could go as far as 7^ miles, using a satellite\ntransmitter.\nStudent-produced programs, combine with NER offerings to provide\na variety of listening experiences„\nlo For the elementary grades who listen in their\nclassrooms, programs in languages, art, social\nstudies, science and music have opened new\nhorizons„\n2. On the high school level, Henry Lamb suggests:\n\"programs are directed at the prospective college\nstudent, and at the four-out-of-five high school\nstudents (including dropouts) who do not plan to\ngo to college. Through WRHS, these students\nlisten to representatives of varying vocations\ndiscuss the educational requirements, advantages\nand' limitations of their respective fields, or\nto programs dramatizing the correct way to apply\nfor a job, how to keep it, or how to gain ad¬\nvancement. -\n3. Educationally deprived adults too are serviced\nby the small, ambitious station that brings to\nthose who cannot read an increasing number of\nprograms presented in a variety of ways - pro¬\ngrams that offer cultural and vocational enrich¬\nment historically denied these people before\n- - WRHS went on the airc\nIn the first year of operation, nearly 300 (out of the school’s\n400 student enrollment) participated one way or another in program\nproductiono\nThe experiment in Robbinsville has been an unqualified success, so\nmuch so, in fact, that the station responded to continuing requests\nfor information from other schools by forming Delta Engineering, a"
}