{
  "id": "d611-35",
  "text": "- 2\nproscribes any such discrimination by federal contractors and sub¬\ncontractors and recipients of federal financial assistance involving\nconstruction contracts. These broad national policies provide firm\nsupport for the Commission’s statement concerning non-discrimination\nin the broadcast industry. Moreover, the requirements of the Communi¬\ncations Act, that grants may be made only upon a finding that the\n\"public interest, convenience and necessity\" would be served thereby,\nlend further strength to the Commission’s determination that it may\nnot properly ignore patterns of discrimination by broadcast licensees.\n2. Therefore, the NAEB believes that it is fitting and\nproper for the Commission to exhort licensees to avoid discrimination\nin all aspects of their operations, and to provide appropriate policy\nguidelines for handling complaints of discriminatory practices. The\nCommission in its decision has announced that it will handle complaints\nwith respect to employment discrimination where referral to the Equal\nEmployment Opportunities Commission or State and local authorities\nis not appropriate. Discrimination in licensee programming efforts\nwould be handled directly by the Commission on a case-by-case basis.\nThe NAEB agrees that these are reasonable procedures which are designed\nto avoid duplication of efforts by agencies with differing functions,\nto prevent unnecessary burdens on broadcast licensees, and to provide\navenues of relief against established discriminatory practices.\n3. Included in the Commission’s decision is a Notice of\nProposed Rule Making to provide for the posting of notices by broad¬\ncast employers not covered by the Civil Rights Act, informing job\napplicants of the equal employment laws and of their rights to seek\nredress for discriminatory practices. Such a notice would be posted\nin a prominent place in the employment office. As a matter of principle,\nit seems difficult to argue that broadcasters not under the Civil Rights"
}