{
  "id": "d611-5",
  "text": "wcny-tv\nSYRACUSE\nNEWS RELEASE\nOLD LIVERPOOL ROAD / LIVERPOOL, NEW YORK 13088 / 315 / 457-0440\nBLACK ON BLACK TV SERIES For Immediate Release\nANNOUNCED BY WCNY-TV, SYRACUSE Sent November 12, 1968\nWCNY-TV, Syracuse, the public television station serving\nCentral New York, announced plans to broadcast a new locally-produced\nbi-monthly series designed to serve as a vehicle for expression by and\nfor the black community in Syracuse.\nBlack on Black; Afro-American Television Magazine, was intro¬\nduced to the community at a special screening for the ETV Council*s\nBoard of Trustees Community Programming Committee and an invited aud¬\nience of community leaders. The previous program was also previewed\nover Channel 24 to the community at large this week. (Week of Nov. 11,\n1968).\nThe premiere program in the series which has been almost two\nyears in the planning and development stages, will be broadcast\nDecember 6 at 7:30 P.M. and will be seen every other Friday at 7:30 P.M.\nand repeated for in-school audiences on Tuesday at 12 noon and Thurs¬\ndays at 12:30 P.M.\nArthur Paul, Assistant General Manager for Program Operations,\nsaid the objectives of the series are: to reach all Negroes in the\nSyracuse metropolitan area, but especially the youth and those in the\nlow income brackets; to rely upon the Negro community, local and\nnational, as a talent resource; to provide a platform for Negroes to\nspeak directly to other Negroes and indirectly to the community at\nlarge, via television, about prime concerns of the Negro citizens,\nwith maximum freedom from restraint, other than those of good taste\nand responsible comment.\nBlack on Black, by providing information and methods for self-\nimprovement and assertion, is also designed to confront and improve the\nrealities of life within the Negro neighborhoods as well as examining\nrelationships between the Negro and White community. The series will\nprovide an opportunity for lower-income Negroes to relate constructively\nto Negro leaders, and will strive to give the youth especially, strong,\npositive figures to admire and emulate\n-MORE-"
}