{
  "id": "d611-51",
  "text": "^page four\nPrograms for the Disadvantaged\nSeptember 27, 1968\nWBGO-FM, Newark, makes a continuing commitment to black Amer¬\nicans „ The school population of Newark Schools is well over 70%\nblack, As a.result, WBGO has black people in mind no matter what\nits programming is. Some of the most interesting work done recently\nis reported here,\nlo WHAT IS AHEAD FOR NEWARK? was a series of interviews con¬\nducted between.high school students and municipal and state auth¬\norities on topics relating to the sensitive issues in everyone's\nmind since the summer riots of 1967, Free to ask any question,\nthe students levelled with the officials in frank and revealing\nsessionso As a result of this series, another was suggested by a\nblack student who asked for a forum between students and police\nauthorities.\n2o THE POLICE, THE PEOPLE, THE PROBLEMS stood as another pene¬\ntrating dialogue between students and adults, WBGO reports one\nstudent, unjustly treated by police, having his complete \"say\" to\nthe police on the series; the police were open-minded and co-operative,\n3° JACKIE ROBINSON INTERVIEW was just what the name implies *\nHigh school students asked the hard questions about their lives of\none man who has \"made it,\" A one time only, live program, the\ninterview was held on the stage of a Newark high school auditorium\nand was SRO, Robinson not only provided an articulate and inspired\nexpertise for the program, but lingered long after the broadcast\nand continued to tell it straight to the kids*\nD D0C5'0^ JACQUELINE BEYER, an expert on African Affairs and\nAcr?SrS VnlversitY was interviewed in depth on WBGO's\nFOCUS. AFRO-ASIA series. A highlight of the program was the\nquestions put to Dr. Beyer by members of the Afro-American Culture\nClub from one Newark high school,\n. 5o ^ALES FROM THE TALK-TALK HUT is a dramatized series on\nAfrican Folklore now in production. Designed to meet the need for\nwffbY^°i°gYM v ? back9r°und, for a feeling of identification\nwith history asked for by the disadvantaged youngsters, the series\nis a good take-off point for blacks and whites at the start of the\neducation process. For the very young,\nProTbTfbiYi-0ne °f the most effective, and dramatically movinq\nchallenges WBGO has come up with is SPEAKOUT, Started two years 9’\n*11* th^Juries continues to be broadcast today because of obvious\nneed. This is how it works, A WBGO staff writer constructs vig¬\nnettes one or two minutes long dramatizing the personal problem of\nsome student. The problems are selected by a city-wide committee\nsuch as \"Being Ashamed of One's Home,\" \"Always Moving,\" \"Stealing,\""
}