{
  "id": "d611-61",
  "text": "-4-\nAuburn Television hopes the series can become a year round affair;\nthe need is obvious. But to do the series on a continuing basis will take\nresources not available beyond the initial thirty programs.\nEach program will be aired twice, now scheduled for 2:45 and 5:00 PM.\nKATIE'S HOUSE will be seen five days each week.\nHow to manage money, how to fix food for more nutrition, how to do\nsimple dressmaking or home decorating - these are only a few of the topics\nthe series will treat. KATIE'S HOUSE is being set up to be much more than\na \"how-to-do-it\" kind of thing, however. The series will spark a philosophic\napproach to rural homemakers that urges them to believe in themselves, to\nbelieve that they can do better with what they already have with a little work\nand imagination.\nIt is too soon to editorialize, but KATIE'S HOUSE just may turn out to\nbe a prototype other stations may find attractive. If the \"easy does it\" approach\nto igniting enthusiasm and implementation can work for homemakers, how about\na series for children, or for the elderly, or for men. The more you think about\nit, the more infinite become the possibilities.\nCONTACT: Ed Wegener, Director, Auburn University Production Center\n* * * % *\nKUHT, Houston is prepping for a November 4th debut on its blockbuster\nfor low-income residents of the city titled THE WAY IT IS.\nExecutive Producer of the twelve part series, James Bauer reports\nthat the material will be divided into two distinct approaches. Nine one-half\nhour documentaries are being made. Those will be complimented by three two\nhour live programs.\nThe series squares off to take a hard look at what the \"little guy\" faces\nwhen he comes up against the facts of life in Houston - the facts about housing,\nshopping, loans etc. In many cases the picture isn't very pretty and it seems\nthat the poorer one is, the less chance one has of ever getting off the treadmill.\nWho are these little guys? They are Mexican-Americans; they are Blacks; they\nare poor Whites. And they haven't had anyone in their lonely corner to date with\nthe gumption Of KUHT. Maybe things can change now.\nThe programs will run on Mondays and Wednesdays over a six-weeks\nperiod, with repeats of everything on the following Sundays.\nThe documentaries, shot in the disadvantaged neighborhoods of Austin\nare set to cover the following topics: Food Purchasing, Furniture and Appliance"
}