{
  "id": "d611-62",
  "text": "-5-\nBuying, Auto Purchase, Home Remodeling, Home Buying, Appliance Rental, *\nClothing Purchasing and Credit and Loans.\nTwo co-hosts will move in and out of all programs in the role of reporters.\nOne, a Black is Jacqueline Toilet; her White male counterpart is Kent Demeret.\nThe filmed documentaries are being handled by Crown Films, a creative\narm of predominantly Black Texas Southern University. Another Black, Ben\nWaddell is contributing research talents to the programs.\nThe three two-hour live programs present a producer's nightmare and\nwe can only wish Jim Bauer and KUHT well in the undertaking. What the station\nplans is possibly the most ambitious live TV venture ever attempted in Houston.\nWith an eminent panel in the studio, three mobile units will fan out through the\ncity to three different disadvantaged neighborhoods for the live pickups of inter¬\nviews with the people whose story THE WAY IT IS will tell.\nMore specifics? Well, the loan program, for example, will present the\nproblem of many people, not knowing better, letting themselves fall into the\nclutches of loan sharks and having enormous financial, not to mention psychological\nproblems in disengaging themselves from their debts. THE WAY IT IS will talk\nto these people, will hear their stories of how they have been harassed by loan\ncompanies. The program will discuss in detail the two kinds of loan companies\noperating in Houston (we're not talking about banks who are traditionally loathe\nto make small loans in that city anyway). Rate fixing will be a part of the topic.\nCaution signs will be waved to show the loan applicant what to watch for - how\nto read a contract etc. Finally, there will be full explanation of what a Com¬\nmunity Credit Union is-what its makeup is - and what it can do to help solve the\nlittle guy's money woes - legally, honestly and at a very low rate of interest.\nKUHT is working with the Harris County Economic Opportunity office to\nreach into the ghettos for authenticated information. The liaison has worked\nwell so far.\nOn promotion, all persons interviewed are automatically photographed -\nthose prints to be used on posters soon to cover the city. It is also planned to\nuse other media to promote the series, one of the most interesting outlets being\nblack radio in Houston: KVOK and KIKK.\nKUHT has tied onto a tiger with this one. The abysses are already evident;\nbut the station is determined to light candles, to illumine those parts of the city\nwhere knowledge, even elementary knowledge, rarely shines.\nCONTACT: Roy Barthold, Station Manager\n* Tentatively scheduled"
}