{
  "id": "d611-63",
  "text": "-6-\nKLRN, Austin-San Antonio debuts this week with PERIOBICO, a onfe-\nhalf hour, thirty nine segment series oriented to the very large Spanish-speaking\npopulation of that area (over 300, 000 in the San Antonio \"barrio\" alone).\nKLRN has wanted to tackle this important group of citizens, unique in\ntheir traditions and attitudes and needs, for some time. A recent Ford Foundation\ngrant made the attempt possible in terms of doing the job right.\nA search was mounted, without SUcCess, to find a Mexican-American\nproducer to head up PERIOBICA. However, an all Mexican-American crew has\nbeen assembled lead by Gil Murillo, Associate Producer and Director Rolando\nMorales. Mr. Morales brings a strong history of experience in Mexican tele¬\nvision to. the job. It is of interest to' note that all crew members live in the San\nAntonio barrio themselves; they will be telling the story Of their own people in\nthat sense; : L\n\"Periobico\" means \"magazine, \" or \"newspaper, \" or \"current events. \"\nThat's exactly the1 name of the game. A combination of discussion, music, inter¬\nviews, and a great deal of film footage shot on location in the barrio is intended.\nA number of distinguished Mexican-American citizens will take part in\nthe series, highlighting their, particular areas of expertese: Education, Poverty,\nHousing etc. In addition, all talent will be Mexican-American, some already\nwell known in the area. One man in particular is a familiar figure to the barrio\nhaving built a reputation as a D. J. on a local commercial station and as an active\nparticipant in community youth work.\nKLRN is pioneering an especially exciting concept in its language approach\nto the series. Within the barrio the language changes with the subject at hand.\nAbout 70% of ordinary conversation is in Spanish, but when the talk turns to\ntelevision, schooling etc, the transition is automatically made to English. So it\nwill be on PERIOBICO. The language will not be directed; rather, it will flow\nfrom Spanish to English to Spanish as the topics and the speakers wish.\nPERIOBICO is for, by and about Mexican-Americans. It is their \"voice. \"\nIt is their opportunity to publically address each 6ther on current problems\naffecting their daily lives. KLRN earns our applause for this effort. It will set\na standard and open a door that has been too long shut.\nKLRN also reports that Charles Akins, Dean of Men at local Johnston\n£Jigh School is getting very favorable reactions to his daily sports reporting on\nthe station's hard news program. Mr. Akins is black. Harvey Herbst, Station\nManager, offers the constructive thought that it isn't always necessary to find\na black broadcaster to do the job; it may be more relevant to find the man and\ntrain him. The education field is rich with black men and women who are knowl¬\nedgeable, articulate and imaginative. Those of you who report difficulty in"
}