{
  "id": "d611-65",
  "text": "National Educational Radio\nA DIVISION OF THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue N.W. Washington D.C. 20036 Telephone 667-6000\nROBERT A. MOTT\nSeptember 10, 1968\nSixth Report, Programs for the Disadvantaged\nKen Clark, Project Director\nRobert Conot, Author of the Watts riot report. Rivers of Blood,\nYears of Darkness, quoted a Watts resident as saying.\nAll we wants is that we get our story told and get it\ntold rightI What we do last night, maybe it wasnTt\nright. But ainTt nobody come down here and listen to\nus before.\nAnd from the Kerner Commission Report:\nT,Far too often, the press acts and talks about Negroes\nas if Negroes do not read the newspapers or watch tele¬\nvision, give birth, die and go to P.-T.-A. meetings.n\nFCC Commissioner Nicholas Johnson recently used these two quotations\nin a speech to the Annual Convention of the National Association of Tele¬\nvision and Radio Announcers in Miami. Commissioner Johnson continued:\n\"The white media are beginning to get the message. Edu¬\ncational radio stations ... are producing shows like\nWAMUTs \"Voices of Poverty\". Are you? Do you go down\nand listen?\nIt is tragic irony, I think, that many radio and tele¬\nvision stations choose to do their local public service\nthe way any other business — like an electric utility —\nmight. They stage picnics, and parades, and work for the\nUnited Fund and Red Cross. They referee basketball games.\nThey send boys to camp and set up scholarship funds.\nCertainly such efforts are not to be ridiculed. But\nthe greatest local service that can be rendered by some¬\none in the broadcasting business is the broadcasting\nbusiness.\"\nThe White Establishment is uptight. That isnTt going to change\nuntil permanent answers are found to the predicament we have helped\ncreate. As educational broadcasters we have the power to motivate,\nand move our audiences into a more positive arena of thought and action.\nItTs our time. ItTs our move.\n*****"
}