{
  "id": "d611-67",
  "text": "3\nis repeatedly aired that they telephone for assistance \"now” to a number\nwhich is in service 24 hours each day.\nThe answering service has a roster of nine outstanding civic leaders\nespecially trained to counsel in this area of social problems. The\nanswering service is given the personal schedule and availability of\neach of the nine leaders every day. More than one is easily reachable\nat any given moment.\nEach counselor is asked first to determine the motivation causing\nthe problem of the telephone caller - family maladjustment, need for a\njob, military service and so on. The counselor then encourages the\ncaller to get in touch with the appropriate social agency, referring to\na specific person and offering to set up an exact appointment time.\nLiterally hundreds of people in the Fresno area have called DROP¬\nOUTS ANONYMOUS for help. The project has had such great success, the\ntwo stations will continue and no end date is in sight at the moment.\nA detailed brochure which explains the entire DROPOUTS ANONYMOUS\nproject with specific details and how you can start and implement such\na program in your own area at your own station is available free of\ncharge. I highly recommend that you write for it to: Guy Farnsworth,\nCommunity Relations Director, KFRE-TV, P. 0. Box 144, Fresno, California,\ntelephone 209-268-6441.\nA similar technical facility has been made available since July of\nthis year whereby anyone can call a number in 24 hours service and be\ndirected to a trained person, knowledgeable about drugs, their abuse,\ntheir use and where to get help. As a public service, this \"drug-call-\nin” idea is catching on in the KFRE, KFRE-TV coverage area. Most of\nthose receiving calls are adults, but the list also includes some young\npeople who have gone the nroute” with drugs themselves and can answer .the\nphone with personal knowledge of the problem.\nBoth Dropout and Drug ideas appeal to other kinds of disadvantaged\npersons than those these reports have ordinarily treated. But both pro¬\njects are front line action programs performing useful services to their\ncommunities - services that could be duplicated in your station.\n*****\nKSLH, St. Louis, heavily orients its efforts in human relations\ntoward in-school services. Believing that habits and beliefs formed\nearly in life tend to stick, the station is doing what it can to offer\npositive, useful information for elementary school children. Anyone\nis invited to listen and many St. Louis listeners at home do just that,\nbut the main thrust is for in-school student ears.\n\"Project U” is going into its fourth year of programs (fifteen\nminutes each week). Designed by a committee of teachers in one of St.\nLouisT six school districts (a disadvantaged one), the series attempts\nto teach the children basic awareness of their life. Approximately one-\nthird of the series is produced for the primary grades; one-third for"
}