{
  "id": "d611-7",
  "text": "WCNY-TV, Black on Black Page 3.\nWhile emphasizing the need for this special series, Petry\nadded that Channel 24 would continue to build on its continuing\nintegrated” attention to urban problems and human relations. \"WCNY-TV\nis not suddenly ’going black.* We have always had black hosts, panel¬\nists, audience participants, and guest personalities on local produc¬\ntions such as Mohammed Ali, author John H. Williams, Jet magazine\neditor Robert Johnson, Justice Department*s Ben Holman, State Human\nRights Commissioner Robert J. Mangum, and many others.” When you add\nin NET'S Black Journal and the many other EEN and NET documentaries\nand information programs that Channel 24 has presented together with\nits local productions, the station has already established a record of\ncontinuing prime time exposure to the black dilemma facing our society\nand to black talent and opinion. ’’Nevertheless, ” Petry added, \"we hope\nthis series is in fact, going to be something more personal, less\ndidactic, and more productive for the local black community. It will\nbe their program and not our idea of what may be good for them.”\nPaul introduced the closed circuit screening by citing the\nKoerner Commission’s recommendations to the media and by referring to\nBen Holman’s (Assistant Director for Media Relations, Community Rela¬\ntions Service, U.S. Department of Justice) specific recommendations:\n\"the problems of the ghetto are past the point of occasional special\nprogramming, they demand probing week in and week out by all broad¬\ncasters as ’routine* programming.\"\nRepresentatives from area public and private schools requested\nthat the series also be scheduled for in-school use by teachers and\nhigh school pupils. \"This is exactly the kind of program that our\nteachers are begging for, the kind of information and concept that the\nwhite teacher just can’t provide,\" said Dr. Franklyn S. Barry, Super¬\nintendent of Syracuse City Schools.\nPetry explained that the special group sessions would be\norganized in neighborhood schools, centers, churches, or libraries.\n\"We’ve literally got to build an audience from nothing; special promo¬\ntional techniques will be needed; every black organization and group\nwill be asked to help spread the word.\"\nSome of the dominant themes discussed for the series are\nblack dignity; constructive black economic and political power; black\neducation, business and jobs, culture and aspirations.\nFoundation and other underwriting for the series has not been\nsecured and the series is being produced through the use of limited\ngeneral production funds with the production assistance of the\nSyracuse Urban League.\n-MORE-"
}