{
  "id": "d611-72",
  "text": "SS.3-FM\nBOARD OF EDUCATION STATION 622-6700 EXT. 288\n345 HIGH STREET\nNEWARK, NEW JERSEY 07102\nFRANKLYN TITUS\nSUPERINTENDENT OF SCHOOLS\nSeptember 10, 1968\nEDWARD T. SCHOFIELD\nDIRECTOR\nMARIE C. SCANLON\nSUPERVISOR OK RADIO AND TELEVISION\nMr. Ken Clark\nProject Director\nNational Educational Radio\n13^6 Connecticut Avenue N.W.\nWashington, D.C. 20036\nDear Mr. Clark:\nWhen i returned from my long summer vacation, I found your reports about Radio\nProg rams for the Disadvantaged on my desk. I read these reports with extreme\nINTEREST AND SAW TO IT THAT ALL OF MY STAFF DIO LIKEWISE. Is YOUR PROJECT COM-\nPLETE OR WOULD YOU LIKE TO HEAR SOMETHING OF WHAT THIS SCHOOL STATION HAS BEEN\nDOING IN THE AREA?\n1. WHAT IS AHEAD FOR NEWARK? This was a series of radio interviews, in\nWHICH-CONSECUTIVELY-MUNICIPAL ANO STATE AUTHORITIES WERE QUESTIONED ON THE AIR\nBY HIGH SCHOOL STUDENTS CONCERNING THE SENSITIVE PROBLEMS UPPERMOST IN EVERY¬\nONE * S mind DURING THE SCHOOL YEAR WHICH FOLLOWED THE SUMMER RIOTS OF 1967.\nThere were no holds barred. 'After the radio broadcasts, in each case, the\nYOUNGSTERS REMAINEO ANO CONTINUED THEIR DIALOGUE WITH THE OFFICIALS. OuT OF THIS\nINTERCHANGE CAME A SUGGESTION FROM A NEGRO HIGH SCHOOL BOY THAT THIS STATION\nSHOULO PROVIOE A FORUM FOR A MEETING BETWEEN TEEN-AGERS AND THE POLICE. We\nacted upon the suggestion and were able to present:\n2. The series, THE POLICE, THE PEOPLE, THE PR08LEMS. The same penetrating\nEXCHANGE OF IDEAS, IDEALS, AND COMPLAINTS CHARACTERIZED THIS SERIES, BUT PERHAPS\nTO A GREATER DEGREE. I KNOW OF AT LEAST ONE CASE WHERE A YOUNGSTER WHO HAO BEEN\nUNJUSTLY TREATED BENEFITED IN A PRACTICAL WAY FROM THE DISCUSSION. ThE POLICE\nAUTHORITIES WERE EXTREMELY OPEN MINDED ANO CO-OPERATIVE AND THE YOUNGSTER TOLD\n\"all.\"\n3. JACKIE ROBINSON INTERVIEW. IT took some coax.no, sot we succeeded in\nbringing Jackie Robinson to our microphones which we placed on the stage of the\nHIGH SCHOOL IN WHICH WE ARE HOUSED. NATURALLY, WE HAO A LIVE AS WELL AS RADIO\naudience. This project was really an inspirer. Again, our guest answered ques¬\ntions PUT to him by high school students. The program attracted a large repre¬\nsentation of municipal authorities who joined us on the stage. After the broad¬\ncast, Jackie Robinson — who had protested that he must dash off immediately_\nREMAINEO TO TALK AT GREAT LENGTH.\n4. DOCTOR JAuQUELINE BEYER, expert on African affairs and professor at\nRutger3 University, filled in an interview spot in a previously taped series\ncalleo FOCUS: AFRO-ASIS. An interesting aspect of this was her questioning by\nmembers of the Afro-American Culture Club in one of our high schools. The pro¬\ngram WAS OF COURSE, POSITIVE IN TONE."
}