{
  "id": "d1416-1",
  "text": "PERSONNEL\n^ Bernarr Cooper will be consultant on two workshops this\nyear, at Hofstra University and at New York State Univer¬\nsity College at Brockport, and on a symposium on problems\nin educational television at the University of North Carolina\nat Chapel Hill. Cooper is chief of the Bureau of Mass Com¬\nmunications, University of the State of New York.\n^ Karl Haas, director of fine arts for commercial WJR, De¬\ntroit, has been awarded the Officers’ Cross of the Order of\nMerit of the Federal Republic of Germany for his contribu¬\ntions in deepening cultural relations between the U. S. and\nGermany, where Haas has been serving the Ford Foundation\nas Consultant for the Arts.\n^ William G. Harley, NAEB president, addressed a special\n80th anniversary “problems in education” convocation at New\nYork’s Wagner College on May 2, along with Senator Ken¬\nneth Keating.\n^ The American Jewish Committee recently presented a spe¬\ncial award to Henry H. Mamet, executive director of the\nBroadcasting Commission of the Chicago Board of Rabbis,\nfor his work in broadcasting. Mamet has been similarly cited\nby such organizations as the National Conference of Chris¬\ntians and Jews and the Academy of Television Arts and Sci¬\nences.\nINSTRUCTION\n^ J. G. Paltridge, coordinator of ETV for the University of\nCalifornia, reports that most colleges use ITV. Out of 22 in¬\nstitutions he queried, 20 were so engaged; 16 of the 17 col¬\nleges with over 20,000 enrollment and three out of five with\nenrollment between 10,000 and 20,000 use ITV.\n^ In response to a state education department survey, the\nAlabama ETV Network has scheduled elementary telecourses\nfor 1964-65 to begin at a quarter past and a quarter to the\nhour, rather than on the half hour as in the previous sched¬\nule. The network distributed 7,000 handbooks describing next\nyear’s telecourses at the state teachers’ convention.\nWEDU-TV, Tampa, is distributing two teacher-training 10-\nminute videotapes. “Through the TV Tube” acquaints the\nprospective studio teacher with TV’s limitations, advantages,\nand basic techniques. Its sequel, “Teaching by TV,” alerts\nthe classroom teacher as to how ETV can effectively be used\nas an aid.\n^ National School Telecasts of the Canadian Broadcasting\nSystem has begun a series of four 20-minute French programs\ndesigned to help students develop aural comprehension by\nshowing French as a language spoken in everyday life.\n^ Radiovision, a unique method of teaching art to primary\nschool children developed in the U. S. by the Wisconsin School\nof the Air, will be depicted in a documentary film on inno¬\nvations in education to be presented on TV in Great Britain\nand Canada next fall. The documentary, produced and directed\nby Theodore Conant, prize-winning filmmaker, will demon¬\nstrate how radiovision combines radio broadcasts and film\nclips for classroom use.\n^ Elementary school pupils who study Spanish by television\nexcel in other subjects, according to a study made in the St.\nPaul public schools by Dr. Walter B. Leino, supervisor of\ntests and measurements. Copies of a summary of this study\ncan be obtained from KTCA-TV, 1640 Como Avenue, St.\nPaul, Minnesota, 55108.\n^ An average of almost 90 per cent of the 2500 central Texas\nelementary school teachers responding to a KLRN question¬\nnaire have voted approval of course content and teaching\nmethods for the in-school programing they receive in science,\nart, music, and Spanish. KLRN transmits to 43 school sys¬\ntems with an average daily attendance of 200,000 children.\nGENERAL\n^ Forty-five Indiana college student broadcasters met recently\nat Indiana University for a conference on college station pro¬\ngraming, sponsored by the Indiana Collegiate Broadcasters.\nI Rabbis from a seven-state area recently attended a regional\nworkshop on effective use of television presented by the Chi¬\ncago Board of Rabbis with the cooperation of the American\nJewish Committee at the NBC studios in Chicago’s Merchan¬\ndise Mart. Purpose of the workshop was “to develop and pro¬\nmote a better knowledge of television as a force in society,\nand to prepare the rabbinate for using the medium, as well\nas influencing its use for the betterment of mankind.”\n^ A grant of $10,000 to Midwest Educational Television, Inc.,\nhas been made by the Johnson Foundation of Racine, Wiscon¬\nsin, to permit exchange of television programs on a regional\nbasis. Part of the grant will be used to purchase additional\nvideotapes to be used in the program exchange, the remaining\nshare will be used to produce new programs. Member stations\nof MET are KTCA-TV, Minnesota; KDPS-TV, Des Moines;\nKUON-TV, Lincoln, Nebraska; WHA-TV, Madison, Wis¬\nconsin; KUSD-TV, Vermillion, South Dakota; KFME-TV,\nFargo, North Dakota; and WMVS-TV, Milwaukee.\n^ The Oscar won by WGBH’s documentary feature film,\n“Robert Frost: A Lover’s Quarrel with the World,” is be¬\nlieved to be the first ever captured by an educational television\nstation. The film was shot during the last eighteen months of\nFrost’s life and is described as a “kind of summing up by the\npoet himself.” It was written by Robert Hughes and Char¬\nlotte Zwerin. Hughes also produced it. The film was sug¬\ngested by Secretary of the Interior Stewart Udall before\nFrost’s death in January 1963. WGBH, Boston, was recom¬\nmended as the producer by Pare Lorentz, a documentary film¬\nmaker, because the poet had appeared on WGBH often, dis¬\ncussing various subjects.\n^ One way Alabama is working on its illiteracy (250,000 adult\nnonreaders in 1960) is through the joint action of its ETV\nnetwork, women’s clubs, Alabama Literacy Council, the U. S.\nOffice of Education, and a trained group of lay teachers. The\nsix-year-old project, coordinated by the ALC, hopes to teach\nover 300 adults to read this summer.\n^ A $200,000 grant from the Harris Foundation of St. Paul\nwill provide the necessary funds to begin construction of a\nnew home for Chicago’s WTTW and its new sister UHF\nETV station. The total project will require $1.2 million.\n^ KOAC-AM and KOAP-FM, Corvallis, Oregon, last month\nsent out a questionnaire to Oregon newspapers asking how the\nstations could improve their information services to the papers.\n^ After ten years of service, the University of Wichita’s en¬\ntire educational television department will be disbanded when\nthe U. of W. becomes a state university on July 1.\n^ Last month WNED-TV, Buffalo, presented its first In¬\nternational Television Festival. Outstanding TV programs\nfrom countries around the globe were broadcast. About two-\nthirds of the 34 countries asked to participate did so, some\nof them producing programs especially for the festival. Among\nthe presentations were a performance of Beethoven’s Ninth\nSymphony in St. Peter’s Basilica; a pair of programs in\ndance and music from Thailand; the training of a ballet\ndancer in Poland; a documentary on falconry from Japan; a\nconsideration of ballet and modern art from Denmark; the\nhistory of the tango from. Argentina. Programs varied in\nlength from 8 to 75 minutes.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Editorial assistant: Skip Robinson.\nPhonie 333-0580. Area Code 217.\nReporters:\nRegion I —Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\nRegion || —Shirley Ford, WUOT, University of Tennessee, Knox-\nviHe.\n—Lou Peneguy, AETC, 2151 Highland Ave., Birming¬\nham, Ala.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}