{
  "id": "d1883-2",
  "text": "SPECIAL PUBLICATION OFFER\nEach month the NAEB offers a special sale on a partic¬\nular NAEB publication, at less than one-half the normal price.\nThis month's special:\nNAEB RESEARCH SEMINAR\nFOR EDUCATIONAL TELEVISION AND RADIO — 49c\nA report of a research seminar at Ohio State University,\nDecember 9-13, 1957. Edited by I. Keith Tyler.\nPayment must accompany order. Send to: Special Publi¬\ncation, NAEB, I 19 Gregory Hall, Urbana, Illinois. THIS\nOFFER EXPIRES JULY 15, 1961.\nProgram Bulletins and Promotion Pieces Wanted\nMany visitors to NAEB Headquarters in Wash¬\nington ask about activities of the constituent mem¬\nbers of NAEB. A display of program bulletins and\npromotional brochures is planned, to help answer such\ninquiries.\nNAEBers are therefore asked to send to Wash¬\nington single copies of your latest program bulletin\nand such explanatory brochures regarding your de¬\npartment, station and/or plans as you would like\nto have on view.\nNews of Members\nGENERAL\ny NAEBers receiving IERT radio awards were\nKRFK, Los Angeles; KSLH, St. Louis; and WBGO-\nEM, Newark—each with two awards—and KPFA,\nBerkeley; KUT-FM, University of Texas; and\nWGBH-FM, Boston—with one award each.\nThose receiving television awards were WGBH-\nTV, Boston, with six awards; KQED, San Fran¬\ncisco, with two; and the following, with one each:\nIndiana University; WMVS-TV, Milwaukee; KVIE,\nSacramento; New York City and Regents ETV\nproject; KNME, Albuquerque; KETC, St. Louis;\nUniversity of Texas; and WUFT-TV, University\nof Florida.\ny Wayne State University will host an invitational\nconference on televised instruction June 19-22, in\ncooperation with RCA.\n► Construction is expected to begin within the\ni}ext few weeks on the transmitter tower for KLRN-\nTV, for the Southwest Texas ETV Council. Offices\nand studios will be located at the University of Texas\nin Austin.\ny Included in the educational “master plan” an¬\nnounced recently by the University of Southern\nCalifornia is a Center for the Arts, which would in¬\nclude the tele-communications department, as well\nas the school of music and the departments of drama\nand cinema. This building is among those given\nhighest priority.\ny Purdue University will host an international semi¬\nnar on instructional TV October 8-18, in cooperation\nwith UNESCO.\ny The KUON-TV bulletin announces that Nebraska\nnow has a state-wide advisory committee on ETV.\n► Dedicatory exercises for Georgetown University’s\nWGTB-FM were held April 29. This is the first\neducational radio station in Washington, D. C. The\nwell-known Georgetown University Forum is a regu¬\nlar feature on the NAEB Radio Network.\n► With a $5400 grant from the Ford Foundation,\nMontana’s ETV committee sent twenty-five educa¬\ntors to visit ETV stations and installations in Cali¬\nfornia, Oregon, Utah, and Washington.\n► On a USOE grant, the NETRC is conducting\naudience surveys to try to determine the size and\ntype of the national ETV audience. Six areas will\nbe studied in the survey, which is to be conducted by\nDr. Wilbur Schramm. Participants will be Alabama’s\nETV network, Denver, the University of Nebraska,\nOhio State University, Pittsburgh, and San Fran¬\ncisco. Typical questions will be: “Do you think people\nwho watch ETV are: intellectual, snobbish, insecure,\n‘eggheads,’ dull, youthful?” “How many books have\nyou read since last summer?”\nPERSONNEL\ny NAEB President Harley presented a paper at the\nInternational Television Symposium of the world’s\nfirst International Festival of Television Arts and\nSciences in Montreux, Switzerland, May 17-20. Har¬\nley presented his paper, “The Techniques of Televi¬\nsion in the Educational Process,” at the request of\nthe State Department.\nWith NAEB Legal Counsel Leonard Marks,\nHarley also will attend the European Broadcasting\nUnion’s meeting in Copenhagen June 2-5. Between\nthe two meetings, he planned to discuss U. S. educa¬\ntional broadcasting with RAI officials in Rome and\nRDTF officials in Paris . . . and also to visit Khar¬\ntoum, Sudan, in connection with the NAEB’s proj¬\nect there.\n► Wells Chapin, formerly with Dage Division of\nThompson-Ramo-Wooldridge, has been appointed\nmanager of marketing for communications, Elec¬\ntronics and Ordnance Division, Avco Corporation,\nCincinnati.\nY Kenneth L. Yourd has resigned as business and\nlegal affairs vice-president for NETRC.\n► Joseph Sagmaster, director of WGUC-FM, Uni¬\nversity of Cincinnati, recently received the Rosa F.\nand Samuel B. Sachs Prize, which is awarded annual¬\nly to a Cincinnatian contributing the most in art,\nmusic, science, literature, education, medicine, sculp¬\nture, architecture, or research. Sagmaster was honored\n“for his . . . personal sacrifice in leaving an executive\npost in the newspaper world in order to become direc¬\ntor of broadcasting ... so that the community might\nreceive additional radio programs of high musical\nand educational value . . .” Sagmaster established the\nuniversity’s FM station.\ny Charles Vaughan, assistant general manager,\nWCET, Cincinnati, will leave that post to direct the\nproduction of science programs for the NETRC.\nJUNE 1961\n3"
}