{
  "id": "d1537-0",
  "text": "May, 1956\nPresidents Page\nGood to have seen so many of you at Columbus recently. If you weren’t there,\nsorry I missed you. If you were there, sorry I didn t have more time to spend with\nyou. For the ol’ man, those were hectic days, only because I had agreed to be so\nmany places within such short periods of time.\nNot to belabor, but just to indicate and to advise of whereabouts let's run\nthrough briefly. Thursday evening, April 12, I flew to St. Louis for the Music\nEducators Golden Anniversary Conference. I was introduced at opening session 10 a.m.\nfollowing day. Then I flew to Oklahoma City and was with Vice President John W.\nDunn that night when he put first program on KETA-TV at Oklahoma City. Back o\nSt. Louis Saturday morning and to hear Charles Siepmann at MENC meeting, and to have\ndinner with Haskell Boyter while we talked about 1956 Atlanta convention. Sund®y\nmorning. 8:30 to 12:20 it was MENC Golden breakfast, with NAEB s president as guest.\nHome Sunday evening where I talked to Illio (yearbook) staff meeting. Monday\nmorning to Chicago, where I addressed NARTB-FM session and attended APBE luncheon.\nThen to Columbus for Board meeting at 8 that night, and 9 and 2 the next day. There\nwas the ABET luncheon and the dinner with ETEC president. There was receiption late\nafternoon. Later, I presided at three discussion groups, one plenary session, and\nNAEB luncheon. Oh, stop it Schooley, Okay, but Waldo Abbot asked how I got about.\nA number of important business matters were considered by the Board.\nFor example, the legal counsel, along with the president, was directed to pro¬\ntect FM interests before the FCC, to protect and improve if possible the daytimers\nsituation, and to help fight any inroads on educational TV reservations.\nThe Board also authorized the NAEB Radio Network manager to inaugurate the\nB&B plan for the Net. Basic and Bonus for both the regular and school program sides\nof the Net will be started as soon as possible. The B&B plan is to be tried for\none year, then evaluated. Also, the Network manager was authorized to implement\nprogram with such rules and operational procedures, as are necessary to carry out\nthe spirit of the plan.\nWhile at Columbus, the Board also decided on holding of four regional meetings\nbefore July 1, and scheduled two meetings for 1956-57. Consideration was also given\nto possible changes in any of the regions. In view of upcoming regional meetings,\ndirectors were asked to discuss with all the members, and where possible come back\nwith specific recommendations. All have been supplied with about four different\nproposals so that they may be made basis of discussion.\nAlso, Board authorized procedure for electing regional directors in future.\nSimplified (I hope I state it simply), nominations will be made by members within\neach region at least 30 days prior to national convention. Voting by mail lor\nregional directors will take place within 30 days after convention. It was thought\nbetter to vote after the convention so that anyone placed m national office could\nbe eliminated from voting procedure within region. Incidentally, each res1*?11\nnominates and elects its own regional director under the new procedure. Under this\nplan, it seems obvious, and definite proposals will be forthcoming, that officers\nand directors will serve the calendar year after election. This is the present\nstatus of the treasurer."
}