{
  "id": "d109-50",
  "text": "-2-\nIn most cases these are of the informal type, which are difficult to\ncompile: letters, frequently marked \"personal** which simply request advice\nor guidance; or emergency phone calls, telegrams or special delivery letters\nrequesting data needed by NAEB representatives and members for their admin¬\nistrations, board meetings, or speeches or articles. These are the most\nreassuring type, for they reflect confidence, on the part of the membership,\nin \"their own\" association, which they know will always make every effort\nto give them, or arrange to secure for them the help, data or materials they\nneed.\nMany such requests are of a specific or technical nature. Some have\nto be referred to specialists, as in the case of legal, technical, union, copy¬\nright or talent rights problems • Some require us to conduct and tabulate\nstudies or questionnaires. Some can be referred to other organizations,\nrepresented on our Organizational Liaison Committee; to the JCET, ETRC\nor the American Council on Education’s Television Committee; or to other\norganizations listed under ORGANIZATIONAL RELATIONS. A large number\nare referred to appropriate NAEB committees, the Executive Committee or\nBoard, or the various consultants or legal counsel we have available.\nMany requests and inquiries appear frequently enough to make possi¬\nble the development of \"form\" replies, in which specified materials on file\ncan be sent promptly both to members and in answer to inquiries from students\nor the thousands of other people who write us each year.\nThose services which are most in demand become the regular services\nof the NAEB a steady flow of publications, seminars, workshops and other\nneeded activities and forms of assistance in technical, legal, production,\nprogramming, promotional, research, placement, management, copyright\nand clearance, utilization and other fields. Some of the outstanding of\nthese Member Services are listed below.\nTHE NAEB RADIO NETWORK\nOne of the important factors contributing to this year of progress is\nan encouraging increase in network membership. After holding steady at 74\nfor two years, membership grew to 80 this year, and there is every indication\nthat it will continue to rise in the year ahead. Plans for next year include\nan intensive promotion campaign designed to enlist the membership of all\nNAEB member-owned radio stations and, eventually, all noncommercial,\neducational radio stations in the country.\nIn order to gain a perspective on network membership, the membership\nfigures for each year of its operation are presented herewith:"
}