{
  "id": "d109-58",
  "text": "10-\nThe Engineering Committee\nThis committee has been one of the most active in the Association,\nand works very closely with the NAEB Engineer. This committee met in\nconnection with the NAEB Convention last fall and held one special meeting\nin Chicago. During the year the committee prepared a comprehensive letter,\nwhich went to all technical personnel of member stations and production center\nexplaining the various activities of the NAEB. This was done in an effort to in¬\nvolve technical personnel more thoroughly in the affairs of the Association\nand to make them feel that they are an integral part of the NAEB. There has\nalways been a feeling on the part of technical personnel that the NAEB was\nmore an association for program and management personnel and this has been\na growing concern of both the Engineering Committee and the Professional\nAdvancement Committee. The letter also went into considerable detail about\nthe activities of the Engineering Committee and attempted to involve more\ntechnical personnel in committee work.\nThe Research Committee\nThis committee has been responsible for the selection of grantees of\nResearch Grant s-in-Aid, made available by the NAEB for the first time this\nyear to encourage institutional research in the field of educational broad¬\ncasting. In addition, this committee is currently planning a Research Seminar\nto be held in the fall of 1957.\nThe TV Program Committee\nWhile this committee has not had an opportunity to meet, it has issued\non a non-regular basis as information becomes available, several reports on\nthe availability of films for use by ETV stations. Entitled \"Academic Leader,\"\nthese reports indicate what films are available, including subject matter,\nproducing agency, etc., plus a brief report on suitability for use by ETV\nstations. Since all ETV stations have a great need for films of this sort,\nthis service has proved very valuable.\nPUBLICATIONS ISSUED DURING THE 1956-57 FISCAL YEAR\nThe NAEB Newsletter, monthly periodical: During the past year the NAEB\nNewsletter has evolved to semi-professional status from an unwieldy, diffi¬\ncult to read, mimeographed magazine. The merger of the AERT and NAEB in\nOctober, 1956, added about 500 persons to the Newsletter mailing list, and\nbrought the total number to approximately 1,300. With this increased distri¬\nbution, it was much more economical to print than mimeograph; and in January,\n1957 (when the AERT-NAEB merger was officially confirmed), the Newsletter\ncame out in print. Photos of persons, places, maps and equipment are now\neasily incorporated in the format."
}