{
  "id": "d109-72",
  "text": "-24-\nThe Executive Director has been increasingly called upon for contri¬\nbutions to the conferences and publications of numerous organizations. Prin¬\ncipal examples are the U, S. Office of Education's Conference on Elementary\nEducation, ACE Constituent Member Conferences and Workshops, and confer¬\nences and publications of the American Association of School Administrators\n(AASA), the Department of Audio-Visual Instruction (DAVI) of the NEA, the\nAmerican College Public Relations Association (ACPRA), the Institute for\nEducation by Radio-TV, the American Council for Better Broadcasts, the Speech\nAssociation of America, the Modem Language Association of America, and the\nAdult Education Association (AEA) and its Council of National Organizations\n(CNO). He has been a member of the AEA Delegate Assembly (the legislative\nbody of the AEA) and is at present a member of its Field Development Committee .\nHe is a member of the CNO Broadcasting Committee and of the CNO Executive\nCommittee. He has been named recently to the U. S. National Commission to\nUNESCO, to whose Paris office he has also served as an advisor in various\nprojects for the past several years, beginning while he was in the U. S. Foreign\nService. Other memberships held by him, some in behalf of the NAEB, include\nthe Association for Education in Journalism, the Fulbright Advisory Committee\nin Broadcasting, the American Academy of Political and Social Science, the\nNational Academy of Economics and Political Science, the Speech Association\nof America, and other similar groups.\nHe has been called upon for addresses to a Canadian Adult Educators\nConference, is scheduled as a consultant to religious broadcasting stations in\nAlaska in August, and has been forced to decline a large number of invitations\nfor other addresses because of the pressure of time and association member\nbusiness.\nHe was also pleased, during the past year, at the number of times he\nand other NAEB leaders were quoted in such national publications as the\nReporter Magazine's special issue of May 30 on ETV, Alexander Stoddard's\nSchools for Tomorrow, the Wall Street Journal, and other general publications\nas well as in numerous dissertations znd articles in the more professional\nareas.\nThe Associate Director also found himself called upon increasingly\nto provide NAEB representation in various capacities. As in past years, he\nhas represented the NAEB in relations with the National Project in Agricultural\nCommunications. This year, when the NPAC and the AAACE were planning\na series of regional radio workshops for persons engaged in agricultural and\nhome economics activities, the Associate Director met with the committee as\na consultant and served later in assisting the NPAC to secure proper staff and\nassistance.\nHe has met periodically with the Council of National Organizations\nEditors' group from the Chicago area and is serving on the CNO committee\nwhich is planning the 1957 CNO Conference in New York in December.\nHe has represented the NAEB in meetings of the Audio-Vi sual Commission\non Public Relations, which is concerned with wider and improved use of all"
}