{
  "id": "d1921-1",
  "text": "- 2 -\nUniversity of Michigan Grant\nUniversity of Michigan--$6,000; \"Freedom to Learn\"; radio; Humanities.\nThirteen half-hour dramatic sketches of men who'ee lives and' actions \"under fire\" made\nsignificant impacts on the development of modern education, academic freedom, and the\nfreedom'of men to know and learn. Among those included in the series are: Socrates,\nAbelard, Bacon, Galileo, Scopes, Hutchins, Elliott, Schaefer, Mann.\nUniversity of Alabama--$5>000J \"Document Deep South\"; radio; Economics\nAn assessment of the economic resources of the southern states and the significance\nof this area in the national economy. The South is now one of the frontier areas of\nthe nation and is playing an increasingly significant role. Eighteen half-hour tapes.\nBoston University—$5,800; \"New England Renaissance\"; radio; Humanities.\nThirteen half-hour tapes. A \"’radio pilgrimage’ of the favorite spots of the Tran-\nscendentalists, recreating as much as possible the situations and sounds the Tran¬\nscendent alists knew. Into this ’tour’ will be woven some of their writings and inter¬\nesting background about them. We will attempt to locate their descendents and inter¬\nview them as to family memories. We intend to use also the familiar techniques of\nthe documentary: the montage, the third dimensional, the dramatic narration, to help\ntell the story. As much of this as possible will be recorded in the field.\"\nThe University of Miami—$8,200; \"The Sea\"; television; Economics.\nTen fifteen-minute films on the economics of the sea; to inform adults of the eco¬\nnomic effects of the sea on individuals, the nation and the world.\nStanford University—$8,900; \"People, Places and Politics\"; television; International\nUnderstanding.\n\"’The United States has moved into a position of world leadership, and has assumed\nlarge responsibilities for cooperation with other nations. Dependable facts and bet¬\nter understanding of all this implies are widely needed. . . . The method of treat¬\nment specifically proposed is one in which a series of speakers on fields wioh which\nthey are thoroughly familiar shall make an interesting and informative approach to\nthe various subtopics, using an informal approach. . . .’\"13 half-hour kinescopes.\nIndiana University--$3,100; \"Folklore of Indiana\"; radio; Humanities.\nThirteen 15-minute tapes, \"in which the music, legends, and customs of the various\nethnic centers of Indiana would be studied, and definitive programs based on these\nstudies will be produced.\" Material to be considered in series includes: Swiss,\nFrench, Rappites, Dunkards, Lithuan, Negro and \"mountain\" Anglo-Saxon groups in\nvarious Indiana centers.\nSyracuse University—$6,700; \"Footnotes to America\"; television; international\nunderstanding.\nThirteen half-hour telecasts over WSYR-TV, to \"show the cultural origins of our\ncivilization and the adaptation we Americans have made of these origins. The ulti¬\nmate goal is to help the viewer-listener understand our cultural dependence on the\nvery nations with whom we are working in the United Nations; and, in this way, .to\nestablish a feeling as well as a knowledge of our debt to others.\""
}