{
  "id": "d1921-14",
  "text": "- 15 -\nILLINOIS U’S PROF. GOBLE WRITES ON 'TV--AN EDUCATIONAL FUNCTION’\nGeorge W. Goble, Professor of Lay at’the-'University'or 'Illinois, wrote a letter to\nthe editor of the Champaign-Urbana News-Gazette Commenting on the propriety of an\neducational institution’s operating an educational television station* Because of\nits application to situations which may arise elsewhere in the country, Goble’s let¬\nter—originally, published on April 10, 1952--is reproduced here for Newg-Letter\nreaders who may,have missed it When it recently was circulated by the . JC-sT.\nLetter Makes Four Points\n\"Much has appeared recently in the: public prints on the relative claims of the\nUniversity of Illinois and private business to a license to operate a television\nstation in this locality*..: As against the University’s claim it has been urged\nthat the operation of a station by the University would be an interference with\nfreedom of enterprise, that it Is not an educational function* that it would in¬\nvolve an unjustifiable expenditure of public funds, and that the people do not\nwant educational programs. Hence, it is asserted private business has a clear\npriority over the .University for obtaining a license from the federal communica¬\ntions commission. I would like to make some observations on each of these points\n\"(1) It is difficult to see upon what theory a commercial agency has a priority\nover a public institution to the free use. of air space which is a part of the\npublic domain. Private business does not own the space through which it must\npropel electrical waves in order,to. transmit its services to the people. This\nspace is at the disposal of the. government for the public good, and the Univer¬\nsity being a public agency ought to have.a claim to its use fpt educational pur¬\nposes superior or at least equal to the, claim of a private institution.\nUniversity TV Not Unfair Competition\n\"Moreover if the University enters the telecasting field it will not come into un¬\njustifiable competition with business;, as some critics have charged. The prin¬\ncipal objective of the University, in operating a television station will be to\nprovide the people1 with.educational and cultural programs. In doing this' it wilj\nnot engage in private business. It will not compete in selling the air as an\nadvertising medium, nor as an agent for the purchase or sale of goods or services\nof any kind. The primary purpose for whiqh private enterprise proposes to use\nthe air is advertising. It will sell time on the air at so much per minute, dur¬\ning which the merits of various commodities and services will be repeatedly ex¬\ntolled and proclaimed. Between commercials, programs of a type primarily calcu¬\nlated to attract other and bigger commercials will be planned and staged. This\nis not said disparagingly. The procedure must‘necessarily be of this type becaus\nof the nature of the enterprise. In no other way can the business be conducted\nprofitably. In no other way can many..costly and valuable programs be placed on\nthe air. But these considerations serve to point'up'the'fundamental'differences\nin the objectives of a University and a commercial television station. There is\nan overlap. There are conflicts. But each has its place. There-is no unjusti¬\nfiable invasion of the freedom of'enterprise by the University. It. must not be\n• overlooked that public education is as deeply rooted in the American tradition\nas private enterprise.\nTV Station Operation Within Education's Orbit\n\"(2) Is operating a television station a University function? The function of a\nuniversity is education, and education consists at least partly in the dissemina¬\ntion of ..information and ideas by means of lectures, demonstrations, books, movies..\n• radio and other methods of communication. Television is one of the most effec¬\ntive forms of communication yet contrived 'by man. Its educational potentialities\nare still beyond the reaches of the imagination* It has the power to place\nhitherto unavailable educational opportunities.within the homes of thousands of\npeople, young and old. Should this valuable educational device be denied to the\nUniversity because private business desires it for use as an advertising medium?"
}