{
  "id": "d1921-16",
  "text": "- 17 -\nCOMMISSIONER WALKER ADDRESSES' WO I '-TV WORKSHOP :Vi\nThe TV Workshop held in August at WOI-TV,. Ames, Iowa, under tha sponsorship of the\nHAEB and WOI-TV, was addressed by. FCO Chairman Paul A. Walker oh'\"The Job Ahead for\nEducational TV.\" Following are some of Commissioner Walker's remarks:\nMeet Here to learn How to Build and Operate Stations\n\"For the first time in the history, of television, we have here a national meeting\nof educators called not to consider whether they should build educational tele¬\nvision stations or if. they can build stations, but to study how to build and how\nto operate educational television stations. ... :\nNeed to Do Careful Job With Form 301\n\"The novice in these matters may find it hard to believe, but I assure you there\nis a very good reason for all’the questions on Form 301* Our experience is that\nwhen a school,files an application, it is anxious to get action from the Commis¬\nsion forthwith. I offer you this earnest suggestion: I)o.not do'a superficial\n■ job. The better job you do on your application form, the more complete your in¬\nformation is, the less corresponding Ve have to do, the faster you can expect\naction* ... . ..\n\"Please keep these three basic ..inquiries in mind: The Commission must know exactly\nwho is asking for'the” Construction permit . Sometimes two or more educational in¬\nstitutions apply jointly but unless they have, banded together to form a corpora¬\ntion or some other form of single.organization, how can the FCC look to any one\nunit as the .responsible party?\n\"Then, even if there is some kind of organization, you must make it clear just how\nthe several schools, colleges or other units have the authority to join and\npledge funds. \" \"r....I.../.\n\"The third basic point is to inform the Commission as to the source of the funds\nfor your station and how they will be obtained. . . .\nImpact on Both Commercial and Educational TV\n\"I do not minimize your responsibilities. You are being entrusted with much-\nsought-after channels in one of the..nation,' a .mostvaluable resources—the radio\nspectrum. This whole movement is a bold experiment. The whole nation, and\nindeed, nations beyond the seas, are watching your progress.\n,.\"X have commented on the influence you can :have on educational television. But\nI believe that you are destined also,.to. have a significant impact on commercial\ntelevision. ^ I am sure that you are going to develop many'ideas which commercial\nbroadcasters may find worthy of adoption. And thus, the creative work that you\n>\" are soon to be launched on will enrich the whole fabric of American television\nbroadcasting. ... ,\n\"You are preparing to use the mighty power of;television to help correct weak¬\nnesses in our educational system--weaknesses which are among.the most glaring\nin our society. •\n\"You are stepping up your attack on these problems through television under the\npressure of the world crisis which demands immediate strengthening of our\ndemocracy. ■'\n\"First, there is the: insistent challenge .of illiteracy. . . ."
}