{
  "id": "d1921-2",
  "text": "- 3 -\nUniversity of Oklahoma--$8,900; \"Camp Fires and War Drums”; television; Humanities.\nNine films in color each ten minutes in length. Four groups of films on the dances\nand ceremonials of the Plains Indians: Children's Dances; Social Dances; War Dances\nCeremonial Dances. Filmed in color and with multi-channel sound recording*. With th<\nassistance of the Sequoyah Indian Club and 36 Plains Indian tribes in Oklahoma.\nUniversity of Minnesota--$8,900; \"A Great Symphony Orchestra and the Region It\nServeslf; television; Humanities.\nTen hour-long telecasts in cooperation with WCCO-TV and the Minneapolis Symphony\nOrchestra. The telecasts would consist of performances by the orchestra together\nwith a series of intermission features which would review the contributions of the\norchestra to the musical life of that section of the United States. The series is\nintended to show how television might be used in other sections of the country in\ndeveloping popular support for the Humanities.\nUniversity of Chicago--$6,500; several series on political, economic and cultural\nproblems; radio; Humanities.\n\"We propose to record on the University of Chicago campus, and present on WFMT, com¬\nmentaries on outstanding classical drama; talks on political, economic, social, and\ncultural problems; readings from great poetry and essays; interviews with scholars\nfrom all over the world who regularly visit the University of Chicago; specially\nedited versions of important symposiums and lectures which occur regularly on the\nUniversity campus. .- .\nJEFFERSONIAN HERITAGE RECEIVES NATIONAL ACCLAIM\nFavorable reviews in VARIETY, BILLBOARD and in countless local newspapers have greet¬\ned the airing of the first several programs in \"The Jeffersonian Heritage,\" the 13-\nweek series produced by the NAEB.\nMember stations of the NAEB which have been broadcasting \"The Jeffersonian Heritage\"\nhave been extremely successful in publicizing the series through their local news¬\npapers. News releases, both those issued by NAEB headquarters and by the various\nstations, have brought the series to public attention throughout the country.\nFollowing are only a few typical examples of what NAEB member stations have been\ndoing across the country to publicize the series.\nAt the University of Alabama, news bureau releases on the series have been printed i:\na large number of dailies and weeklies throughout the WUQA(FM) listening area. WNYC,\nin New York, sends out its releases to the New York papers each week.\nIn Wisconsin, in announcing the new series to the newspapers WHA’s director, H. B.\nMcCarty, pointed out for feature coverage that the programs began the same day that\ninaugural broadcasts marked the completion of the final two stations in Wisconsin's\nstate-owned FM network. Michigan's WUOM's bulletin, mailed to thousands of Michigan\nlisteners, carried a full page announcement of \"The Jeffersonian Heritage\" in addi¬\ntion to its regular program schedules. KUSD, at the University of South Dakota,\nprefaced its regular weekly news releases on the series with a story on the Ford\nFoundation grant to the NAEB which made possible the production of \"The Jeffersonian\nHeritage.\"\nNewspaper columnists from the Minneapolis-St. Paul newspapers were invited to a\nspecial preview and luncheon by KUOM, at the University of Minnesota, to hear the\nfirst three of the series before they were broadcast. Each of the columnists de¬\nvoted at least one column to praise for the series along with recommendations to\ntheir readers to make every effort to hear the program."
}