{
  "id": "d1921-25",
  "text": "- 26 -\nRESEARCH REPORT\nby Dallas W. Smythe\nNAEB Director of Studies\n_ University of Illinois, Urbana _■ -\nIt is a rare pleasure to be able to review an audience study conducted by an NAEB\nmember station. This month we have that pleasure because WBAA (Purdue University,\nLafayette, Indiana) has published in mimeographed form a report on its 1952 study of\nurban audience -groups. The present study covered seven towns in addition to Lafay¬\nette. Two earlier studies oreceded this one: the first was a study of winter radio\nlistening in 1951-a graduate thesis by R. Horton. The second was a summer radio\nstudy in 1951 by R. Lanman. Both of these studies concentrated on the rural audienc\nOne-third of the individuals in the eight towns studied had a TV set. Radio station?\nthus face much greater TV competition in these .Indiana towns than in the rural areas\npreviously studied where TV sets were less frequently owned. Almost all of the indi¬\nviduals in these towns (90 percent) had at some time listened to WBAA. More than\nhalf of these (56 percent) heard the station \"last week.” The kind of program most\noften thought of when WBAA was mentioned was Sports (23 percent of the listeners),\nfollowed by Popular Music (.18 percent) and Classical Music (17 percent,. About one-\nninth, of the listeners reported no kind of program associated with the name, while\nonly 2 /percent think of Farm Programs and another 2 percent think of Talks and\nLectures.\n’WBAA regular listeners are more likely to lack TV sets than to have them (two-thirds\nof non-TV owners listened in the \"past week\" as compared with 40 percent of TV\nowners), The station's-most faithful listeners tend to be drawn from among those ^\nwith advanced education (64 percent of college graduates listened in the past week\nas compared with.53 percent of grade and high school graduates). People who belong\nto one or two clubs are more likely to be listeners to WBAA than those who belong to\nrone or to three or more (the percentages respectively listening to WBAA in the\n\"past week\" were 6?, 46.and 55). The most faithful listeners were 'business owners\nand top managerial\" (75 percent, of these listened in the \"past week’), while un¬\nskilled laborers are least, attached to WBAA (exactly 50 percent listened in the\n\"past week\") . Housewives, smaH businessmen, white collar employees and skilled\nlabor occupied .a middle position* Individuals with children and those without chil¬\ndren are equally likely to listen regularly to the station. And lastly the men in\nthe WBAA audience are more constant listeners than the women. .The published data,\nhowever, do not support the report's conclusion that men constitute a larger part of\nthe audience than women.\nThe report provides information on the attitudes of the audience toward the full\nrange of radio programs on all commercial as well as non-commercial stations. Music\nprograms were most Often mentioned as \"favorite programs\" (17 percent), followed by\nVariety shows (l4 percent), with third place-being taken by Situation and Family\nCOm.edv. (9 percent) and' fourth place showing a tie between Soap Operas^and Quiz shows\n(7.8 percent). -Asked which type-of programs the respondent thinks a \"waste of time\nto put on,\" the most commonly named classes were Soap Operas (30 percent). Crime\nshows (25 percent), and Music (12 percent).\nOf special interest %o the NAEB will be .the information obtained on audience reac¬\ntions to KAEB Tape Network programs. All. respondents were asked the following ques¬\ntion: \"WBAA has been putting on a series of evening programs by the NAEB Tape Net¬\nwork. They have been at 7:00 o'clock and at other odd times during weekday even¬\nings. Have you heard any of these programs?\" The answer \"yes\" was given by 12.3\npercent. These were then.asked if they remembered the names of any that they had\nheard.,;. In answer to. this unaided recall question, 5.2 percent recalled the name of\none program or more. The proportions, of all these, program mentions were as follows:"
}