{
  "id": "d1921-4",
  "text": "- 5\nj: NEWS OFNAEB RADIO_\nBOSTON SYMPHONY, ORCHESTRA—YEAR'S REVIEW—MARK WGBH ANNIVERSARY\nThe opening Saturday night performance of the new season of the Boston Symphony\nOrchestra and a review of the past year's programs marked the first anniversary Of\nBoston's educational FM station, WGBH, operated with the advice and cooperation of .\nthe Lowell Institute Cooperative Broadcasting Council.\nThe year's review of WGBH programs included the presidents and head's of the Council\nmembers as they inaugurated the station a year ago. The Coordinators of the Council,\nappointees of the presidents and directors of the Council members, discussed the\noperations and accomplishments of the station's first year.\nContinuing the year's review after the officials of the Council, WGBH presented\nselections from the seven college and extension courses in drama, history, psychology\npolitics and modern literature, which were broadcast for women listeners afternoons\nthrough the year. These were followed by: highlights from the late afternoon music\ncourses in the symphony, ballet, madrigal and musid of the baroque period. Profes¬\nsor G. Wallace Woodworth of Harvard spoke in a selection from Tomorrow's Symphony, ‘\ntwice weekly preparation for the Friday and Saturday symphony concerts.\nReview of Prograrls\nNancy Harper, of the Nursery Training School, a Tufts affiliate, presented a special\nChildren's Circle broadcast, and Louis M. Lyons, Curator of the Nieman Fellowships at\nHarvard, recreated his eulogy of the late Harold Ross, editor of the New Yorker\nmagazine. • ••• • ••\nLeading college and university specialists who interpreted important issues and\nevents nightly were heard in a review of Faculty Report. An excerpt from John\nGielgud's performance in the British Broadcasting Corporation production of. Hamlet\nwas included in a review of international broadcasts of the year. Hamlet has been\nbroadcast three times, by WGBH, according to station policy of repeating exceptional\nprograms. Another international highlight was Mclnantv's Reel played by the Radio\nEireann Orchestra, under the direction of Francesco Manda and selected from a broad¬\ncast prepared especially for WGBH by Radio Eireann.\nWGBH feature broadcasts were also reviewed with selections from Old Books: Old\nFriends, New England Conservatory recitals, Lowell Institute lectures. Say It In\nFrench, a radio course in spoken French, and other series produced, by the.Council\nstaff,., '\nSymphony Broadcast Includes Silent Intermission\nDuring the Anniversary broadcast performance of the Boston Symphony Orchestra, WGBH\nobserved its nationally known \"intermission silence.\" This innovation in symphony\nbroadcasting was initiated to give listeners ah opportunity to enjoy the intermission\nas they would if they were in Symphony Hall actually attending the performance. ...\nFollowing the concert, the Honorable Paul A. Walker, Chairman of the Federal Com¬\nmunications Commission, delivered a special message to conclude the Anniversary .\nprogram."
}