{
  "id": "d1650-2",
  "text": "of groups with which we work; the extent of our sem¬\ninar and training programs; the merit of our publica¬\ntions; and the extent of our international activities.\nYou also will be impressed with the amount of money\nwe have collected and disbursed during the past few\nyears. Our total resources are still small in terms of\nour assignments; but the grand total nevertheless is\nimpressive.\nIf you want to feel proud of NAEB read the new\nAnnual Report!\n* * * *\nFor a few days in the middle of July I took part\nin a conference arranged by the Department of Speech\nat the University of Michigan. At this annual session\nthe University invites specialists in various speech re¬\nsearch areas to talk to its graduate students. Speech\ntherapy, theatre, interpretation, debate, public ad¬\ndress and television were among the subjects exam¬\nined. My contribution was a review of the factors\nwhich brought Britain’s new Independent Television\nAuthority into being.\nAll in all, this was an interesting experience. The\nUniversity proved an excellent host (Garnet Garri¬\nson, Ed Stasheff, and Edgar Willis were among those\nto whom I was assigned); and the obviously superior\nstudents provided some lively question periods.\n* * * *\nHere are a few reading suggestions, based on books\nI’ve gone through during the last six months, at home,\nin the office, and on airplanes in flight. Not all of\nthese are what might be considered “summer read¬\ning,” although if you’re as hard pressed' for time as I\nam, you may have to do your heavy reading while\non vacation.\nI was much impressed with Four Theories of the\nPress, by Fred Siebert, Theodore Peterson and Wilbur\nSchramm. (Many of the authors in this list, you’ll\nnotice, have had long NAEB connections.) Not only\ndo these three authors deal in an interesting way with\npast and present press theories (including broadcast¬\ning) , but they also provide excellent reviews of the\nbasic governmental concepts of the related countries.\nSchramm’s essay on the Soviet Communist system\nis particularly illuminating. (What is more, this book\nspurred me to re-read Milton’s Areopagitica, and John\nStuart Mill’s On Liberty, two of the basic treatments\nof the subject.)\nErik Barnouw’s Mass Communication: Tele¬\nvision, Radio, Film, Press is a simplified summary of\nthese media, which relates them to each other. Syd¬\nney Head’s Broadcasting in America impressed me as\nan excellent overview of the basic theories and prac¬\ntices of our system. Those of you who share my in¬\nterest in Britain might like to look into a book by my\nUniversity of Minnesota colleague, J. Edward Gerald,\nThe British Press under Government Economic Con¬\ntrols. If you want a “reader in the methodology of\nsocial research,” you might go through The Language\nof Social Research, by Paul Lazarsfeld and Morris\nRosenberg.\nFinally, I want to recommend highly The Age of\nTelevision, by Leo Bogart. Here is a careful summary\nof much of the recent research on the effects of tele¬\nvision on radio listening, reading, motion pictures,\nspectator sports, and advertising. Bogart’s volume\nprovides documented answers to a lot of the questions\nwe are asked about the effects of television on its\nlarge viewing audience.\n* * * *\nBy the time you read this I shall be enjoying a\nlong, pleasant and cool holiday with my family on an\nOregon ranch. May you too have a good vacation.\nWe can compare notes when we meet at the NAEB\nconvention in St. Louis on October 30, 31, and' Nov¬\nember 1.\nSo long till then.\nBecause our Executive Director Dr. Harry J.\nSkornia, is still on vacation while this Newsletter\ngoes to print, his monthly column had to be omit¬\nted. It will be resumed in the September issue.\nNETWORK NEWS\n—Bob Underwood\nBy this time most of you have received the offering\nfor the fourth quarter. (If you haven’t, please let me\nknow immediately.) This offering contains four new\ngrant-in-aid series covering the areas of civil rights,\natomic power, contemporary American life and the\nIndian problem. In addition, there are series on\nRussia (interviews made inside Russia), J. S. Bach,\ncerebral palsy, and the United Nations; also, this\nquarter marks the beginning of Roman Forum, a\nseries made by WNYC’s Bernie Buck during his stay\nin Rome as a Fulbright scholar. I think you will find\nmuch of use in this offering, including the full-length\ncollege level course in beginning German.\nMay I again urge all members to place their orders\nfor this offering as soon as such a decision can be\nreached. Our ability to get ahead in our production\nschedule has increased, and late orders serve to tie\nup our operations. Remember, for each reel you order\nlate, one of our machines is tied up for fifteen minutes;\nand please consider that we have 800 to 1000 tapes\nto distribute each week for the regular offering plus\nin-school tapes (another 200-400 tapes) plus special\norders from members and non-members. It may in¬\nterest you to know that at this time our production\nstaff has more than 400 special order tapes to dub.\nThis should indicate the need for prompt ordering.\nAUGUST, 1957\n3"
}