{
  "id": "d1650-3",
  "text": "At this time I wish to welcome two new member\nstations to the network: WFUV, Fordham University,\nNew York City, and WPSR, School City of Evans¬\nville, Ind. The contact persons at these stations are\nthe Rev. John A. St. George, S. J., and Dr. Claude B.\nSmith, respectively.\nDuring the summer “slack” season the network\nproduction staff has had an opportunity to examine\nand patch up (or discard when necessary) quite a few\nof our old tapes. The tape returns this summer have\nbeen plentiful, and we wish to thank all concerned.\nFrankly, it appears that the strict tape return policy\nis paying off in better tapes for use over your stations.\nHowever, some poor tapes are still in circulation, but\nwith your assistance I think we can catch and retire\nthem. NAEB “UNUSABLE” stickers are available.\nIf your engineer finds a poor NAEB tape, have him\nmark it accordingly before returning it to us. The\ntape in question will be inspected carefully when it\narrives here. Thanks for your help.\nMOVE TO ELIMINATE EXCISE TAX\nON UHF SETS\nSenator Warren G. Magnuson (D-Wash) of the Com¬\nmittee on Interstate and Foreign Commerce, has\ncome out in support of a proposal to eliminate the\nFederal excise tax from ultra-high frequency re¬\nceivers.\nWhile addressing his colleagues on July 17, he\nstated that the findings of his Committee indicate\nthat one of the chief causes of UHF’s problem is the\nfact that only 7 million of the 40 million TV sets in\nuse are capable of UHF reception. To overcome this\ndisparity, Magnuson said, the Committee has strongly\nrecommended the elimination of the Federal excise\ntax in anticipation that this would lead to the general\nproduction of such sets.\nThe Senator also referred to an article by Jack\nGould in the New York Times July 14 issue which, he\nsaid, forcibly demonstrates the importance of develop¬\ning UHF-TV channels and the facilitating effect the\nremoval of the tax will have on this development.\n—N A E B—\nAn experimental 13-week music appreciation course\nfor credit is presently offered by the University of\nSouth Carolina’s Extension Division over WIS-TV,\nColumbia, S. C. The course is conducted by Edwin\nF. Jones, USC music professor and former concert\nmaster of the Indianapolis Symphony Orchestra.\n—NAEB—\nTo meet the increasing demand for higher education\nin TV, two West Coast schools, the University of\nCalifornia in Los Angeles, and the University of\nSouthern California, will add TV major programs to\ntheir curricula starting next fall.\nTV TECHNICAL TIPS\n—Cecil S. Bidlack\nA timely letter from Glen Southworth, staff engineer,\nat KWSC, Pullman, Washington, arrived to give us a\nlead’ item for this column. He writes of three recent\nTV developments for KWSC. These have proved\nuseful in practice, and he is preparing articles des¬\ncribing them to be submitted to technical publica¬\ntions. He has given advance information with per¬\nmission to use it in the Newsletter.\nPerhaps the most interesting of these devices is an\nelectronic pointer or framing device which can be used\nto locate significant material in slides, film clips or\npick-ups. The pointer circuitry generates the white\noutline of a rectangle of any size and dimensional re¬\nlationships, which may be located at any place on the\nraster. In addition, any or all the sides of the rec¬\ntangle may be removed. If desired, the vertical sides\nmay be “flexed” to attract attention; or a solid rect¬\nangle may be derived from the equipment which can\nbe used to key a montage amplifier or for other special\neffects. (See photo).\nA second device has been derived from the elec¬\ntronic pointer circuitry. This two-tube circuit per¬\nmits reproduction of oscilloscope traces over the TV\nsystem without need for any auxiliary equipment\nother than the signal source. The technique used is\nessentially limited to a 60 cps sweep rate, and re¬\nverses the X and Y scope axes on the TV screen. Mr.\nSouthworth thinks it should prove a very useful\ndevice in some applications. For instance, it is pos¬\nsible to convert a normal TV set into an oscilloscope\nthrough the use of this technique. By the use of an¬\nother tube in the circuit, it is possible to display two\ntraces simultaneously. In fact, he believes it is pos¬\nsible to display N traces by adding one tube per\ntrace. It is a very simple matter to super these traces\n4\nNEWSLETTER"
}