{
  "id": "d1289-12",
  "text": "time fit the 12 out of our total of 18 program\nclasses which have not previously been men¬\ntioned. Three distinctively entertainment\ntypes of program dispose of 14 of these per¬\ncentage points. These are Quiz, Stunts and\nContests, with 38 hours, 45 minutes, or 6 per¬\ncent of total time; Sports programs, 34 hours,\n1 minute, or 5 percent of total time; and\nPersonalities programs, 12 hours, 25 minutes\nor 2 percent of all TV time. The nine broad\nclasses of programs already mentioned, have\naccounted for 94 percent of all the program\ntime.\nThe remaining 6 percent of all program\ntime was devoted to Information (General) (16\nhours, 2 minutes, or a total of less than 3 per¬\ncent of all program time), Public Institutional\n(9 hours, 57 minutes, or less than 2 percent),\nPublic Issues (6 hours, 33 minutes or 1 per¬\ncent). Three classes of programs were pres¬\nent in quantities which were less than 1 per¬\ncent of total time. These were Religion (3)\nhours, 42 minutes or 0.6 percent), Public\nEvents (30 minutes, or 0.1 percent), and\nWeather (24 minutes or 0.1 percent).\nIn the study week there were no programs\nthe production of which was in any way identi¬\nfied with an educational institution. Nor were\nthere any programs in the classes of Fine\nArts or the Dance.\nTable 2 presents the weekly totals for each\nsub-class of program, as well as the broad\nclass totals. If one looks to sub-classes of\nprograms where there are sub-classes, and to\nthe broad classes where there is no further\nsub-division, then it appears that the largest\nsingle kind of program on Los Angeles TV is\nWestern Drama with a total of 65 hours , 9 min¬\nutes , or 10.4 percent of total program time.\nThis is comprised of 38 hours, 16 minutes\n(6.1 percent) ofWesterns apparently program¬\nmed for adults, and 26 hours, 53 minutes (4.3\npercent) of Western drama, apparently pro¬\ngrammed for children.\nThe second largest kind of program was\nVariety, with 9.7 percent of total time. Third\nlargest quantity of programming was provided\nin the form of Crime Drama1 with a total of\n51 hours, 9 minutes, or 8.2 percent of all time\non the air. This total for Crime Drama is\ncomprised of 17 hours, 38 minutes (7.6 per¬\ncent) of Crime Drama apparently programmed\nfor adults, and of 3 hours , 31 minutes (0.6 per¬\ncent) apparently programmed for children.\n1. In this analysis, the unusual Buena Park programs\nwhich raise the Special Events and Features to 9-4 per¬\ncent are ignored.\nHousewives’ Variety, a special form of\nVariety program classed with Domestic pro¬\ngrams (and not included in the Variety total\ngiven above), is the fourth largest kind of Los\nAngeles TV program fare. It consisted of 44\nhours, 10 minutes, or a total of 7.1 percent.\nPopular Music, which provided 36 out of\nthe 38 hours of Music monitored during the\nweek, ranked fifth, with 5.8 percent of the pro¬\ngram time.\nSpectator Sports ranked sixth with 26\nhours and 43 minutes, a total of 4.3 percent of\nthe week’s total TV time.\nComedy Drama, with 4.2 percent of total\nTV program time, stood seventh in magnitude\nwith 25 hours, 58 minutes. Of this total 20\nhours was programmed presumably for the\nadult audience and almost 6 hours for the child\naudience.\nThese seven kinds of programs received\n49.7 percent of all the TV program time and\nrepresented some 310 hours and 14 minutes.\nFor comparative purposes there follows\nsimilar information about seven kinds of pro¬\ngrams which received the least time. Excluded\nfrom these seven are the two program classes\nfor which no program time was observed.\nAs previously seen, Weather programs\ntotalled 24 minutes and Public Events received\njust 30 minutes in the week. Thirty minutes\nwas also devoted to Serious Music. Light\nMusic programs totalled 89 minutes. Per¬\nsonal Relations programs occupied 60 minutes.\nScience programs received 1 hour, 32 minutes.\nLastly, Public Issues programs in which dif¬\nferent points of view found expression totalled\n3 hours, 5 minutes. Altogether these seven\nprogram classes received 510 minutes ofpro-\ngram time (8 hours and 30 minutes) and\namounted to 1 percentofall TV program time.\nContents of Small Program Classes\nSpace does not permit lengthy listings of\nactual program descriptions. However, be¬\ncause of the interest in certain of the smaller\nprogram classes, itis in order to review their\ncontents;\nPublic Events: The sole program was 30\nMinutes of film of United Nations proceedings,\ntelecast over KLAC on a weekday between 7\nand 11 p.m.\nPublic Issues (Individual views): The 208\nminutes consisted of four programs of advo¬\ncacy, pro or con, on issues shortly to be voted\non in local elections, and one program each on\nIranian oil, the Korean war, exemption of\n7"
}