{
  "id": "d1289-13",
  "text": "college men from the draft, Los Angeles hous¬\ning problems, sex degeneracy, and two 15-\nminute segments of the Kate Smith show deal¬\ning with New York’s civic problems.\nPublic Issues (Discussion and Debate):\nThe 185 minutes consisted of four programs:\na panel on ways to prevent and control sex of¬\nfenses, one on whether price control should be\nextended, one where Senator Douglas met the\npress to discuss the administration’s foreign\nand domestic policy, and one in which the “2 3rd\nAmendment\" was discussed.1\nPublic Institutional (Expository): Of the 30\nprograms which comprised the 533 minutes of\nthis sub-class of program time, 11 programs\nconcerned various aspects of the Armed F orces\n(their equipment, their exploits in Korea and\nelsewhere, their personnel recruitment, etc.),\n8 programs were “criminals wanted” pro¬\ngrams presented in cooperation with law en¬\nforcement bodies, 2 programs each related to\nCivilian Defense, the Red Cross, the Marshall\nplan, and activities of United Nations agencies,\nand one program was devoted to therapy for\nspastic children, the importance of Los Angeles\nharbor, and a report by the Mayor of Los\nAngeles.\nPublic Institutional (Dramatization): The\n64 minutes of these programs consisted of two\nprograms, one on the Marines in action, the\nother on medical volunteers for an experiment\nin cancer.\nInformation (General) - Science: The 92\nminutes of these programs fell into three pro¬\ngrams: one, “Know your Child\" on the pre¬\nschool social and psychological development\nof the child from KTSL, a second, “Facts we\nFace’’ on the functions of Congress and Con¬\ngressmen, from KTSL. and a third, a March\nof Time film on child development from birth\nto puberty on KECA.\nInformation (General) - Travelogue: Four¬\nteen programs with atotalof 301 minutes pre¬\nsented travelogues on: Holland, Guatemala,\nCosta Rica, Southern Rhodesia, Midway and\nWake Islands, London, Scotland, Cornwall,\nSwitzerland, Nova Scotia, Australia, Alaska,\nSan Diego, Missouri, Massachusetts, and New\nHampshire.\nInformation (General) - Other: Twenty -\n1. The sense of which appears to be that \"govern¬\nment\" should be prohibited from changing the \"free\nenterprise\" system.\neight programs provided 589 minutes of mis¬\ncellany including seven programs about parti¬\ncular industries. The remainder dealt with\nsuchtopics as: development of community re¬\ncreation, how to avoid and fight fire, the dis¬\nappearing New York City “el,” the training of\nfemale Egyptian physical education teachers,\nhow to combat malaria, atomic energy and the\ninternational problems which it presents, Fin¬\nnish folk dances, Chinese poetry, reenactment\nof Portola’s trek from San Diego to San Fran¬\ncisco, Hindu rice customs, salmon fishing in\nthe Northwest, ultra-high frequencies and\ntelevision transmission, and others.\nChildren’s Information and Instruction:\nThe 204 minutes of program time in this cate¬\ngory included 7 programs. They included one\non Indian tribes and their customs, one on\nmuzzle velocities of guns, and some chemical\nreactions, one on the importance of vitamins\nto the body, and the effects of a vacuum, one\non rock climbing and knots, one on the Future\nFarmers of America, the grading of eggs, the\nbranding of animals, and one on how female\nanimals care for their offspring.\nDrama-Classics: Two programs com¬\nprised the 137 minutes of program time de¬\nvoted to classical drama. One was an English\nfilm based on Charles Dickens’ novel, “Nicho¬\nlas Nickleby,” on KECA-TV. The other was a\nplay (“Out of the Night\") based on writing by\nBalzac, also on KECA.\nMusic - Serious: The Voice of Firestone\nprogram on KNBH was the sole program clas¬\nsified under this heading, with a total of 30\nminutes.\nMusic - Light: The 89 minutes classified\nin this program category consisted of 59 min¬\nutes of one KTLA organ and piano program\n(“Indian Love Call,\" “The Swan,” “When Irish\nEyes are Smiling,” etc.), and five short pro¬\ngram fragments, all of which were on KNBH.\nChildren’s Pre-school Entertainment: The\n32 minutes under this heading consisted of one\nsegment in the Kate Smith program, with the\n“Anabelle Story\" and some songs for young\nchildren. This segment was monitored twice,\non KNBH and KFMB.\nDomestic-Personal Relations: Two pro¬\ngrams comprised the 60 minutes in this cate¬\ngory. “The American Institute of Family Re¬\nlations,\" with Dr. Paul Popenoe as moderator,\nconsidered two problems in family relations\n8"
}