{
  "id": "d1289-15",
  "text": "Chapter III\nLos Angeles TV Programming; a Closer Look\nThe preceding analysis has all dealt with\naggregates °f station time devoted to particular\nclasses of programs. While such an approach\nfairly reflects what is available to the veiwer\non the scarce public TV channels.it necessar¬\nily obscures differences between the program\nstructures of particular stations. The weekly\ntotal program structure for each station may\nbe studied from the columns on Table 4.\nDifferences Between Stations\nWithout attempting to present all possible\nanalyses of this material, it will be sufficient\nto indicate the large differences between sta¬\ntions, if the same leading categories which\nhave been considered in connection withthe ag¬\ngregative analysis are selected for station\nanalysis. In order to achieve comparability\nbetween stations, it seems desirable here to\nexclude the extra time devoted by stations\nKTLA and KTTV to the Buena Park “special\nfeature” telecasts.\nThe viewer randomly tuning in Los Angeles\nTV stations had the highest chance of finding\nsome form of Drama (for adults or for child¬\nren) on KFI-TV and KTLA where the chances\nwere three out of five of finding this sort of\nprogram. Even on the station with the least\nemphasis on Drama, KNBH, the chance of find¬\ning some of it was one in four. The stations\nranked as follows in this respect:\nDrama Total\nKFI-TV\n59.7\nKTLA\n59.1\nKECA-TV\n39.1\nKTSL\n33.6\nKFMB\n31.1\nKLAC-TV\n30.5\nKNBH\n24.6\nKTTV\n24.5\n(Total\n32.9)\nIf the viewer did randomly tune in any of these\nstations while they were telecasting some\nform of Drama, as was noted earlier, the\nchances were 94 out of 100 that he would find\nsome form of recorded program material (for\nall stations combined). On the individual sta¬\ntions, the probability of finding recorded\nDrama were 100 out of 100 on three stations\n(KLAC, KTTV and KFI-TV), while they were\nsmallest on KTSL where they were 88 out of\n100. For the remaining four stations the pro¬\nportions were as follows: KECA-TV (89 per¬\ncent), KNBH (89 percent), KFMB (91 percent),\nand KTLA (94 percent).\nIf the random viewer were concerned only\nwithDrama apparently aimed at the adult audi¬\nence, his chances of finding it on some station\nwere one in four. If he tuned in KFI-TV, his\nchances were three out of five, whereas if he\ntuned in on KTTV, they were a little less than\none out of seven. Having tuned in his station,\nthe probability of finding that his drama was\nrecorded was highest on KFI-TV, KTTV, and\nKLAC where it was 100 percent. It was least\non KTSL where it was 90 percent. On KNBH\nit was 91 percent; on KFMB, 95 percent; on\nKECA-TV, 95 percent; on KTLA, 97 percent.\nIf, however, the random viewer were inter-\ninterested only in Children’s Drama, his\nchances of finding it on any of the stations\nwere one out of 14. They were highest if he\ntuned in KTLA where they were one in four,\nand lowest if he tuned in KFI-TV or KLAC-TV\nwhere they were little more than one in 100.\nBut having tuned in his station, the probability\nthat he found recorded Children’s Drama was\n100 percent for stations KTTV,KLAC-TV, and\nKFI-TV. His chances of finding that his Child¬\nren’s Drama was recorded were least on\nKECA-TV where they were 26 out of 100. On\nKFMB they were 73 percent; on KTSL, 84 per¬\ncent; on KNBH, 85 percent, and on KTLA, 90\npercent. The actual ratios of these forms of\n10"
}