{
  "id": "d1289-25",
  "text": "rising, however, on Sunday to 9-0 percent.\nOther classes of programs appeared in about\nthe same proportions in these periods of the\nweek.\nDifferences Between Time Segments\nThe public is concerned with the kind of TV\nprogramming which is available when certain\naudiences could view or are viewing their sets.\nA significant analysis could thus be made of\nthe amounts of various kinds of programming\navailable when adults of both sexes are pre¬\nsumably accessible to their sets. The hours\n7-11 p.m. for all seven days of the week\ncould be termed the “adult-hours.” Similarly,\nthe hours from the time the stations sign on\nuntil 5 p.m. on Monday through Friday might\nwell be designated the ’’domestic-hours,” for\nin them it may be presumed that the core of\npotential audience consists of housewives and\npre-school age children. For school-age\nchildren, their special “children-hours\" on\nTV might be considered to be the hours 5 to 7\non weekdays, plus the daytime hours (from\nsign-on) to 7 p.m. on Saturday and on Sunday.\nThese three time segments --the adults, the\ndomestic, and the children-hours--account for\nall TV program time except for telecasting\nafter 11 p.m. which we may call the late-hours\nand which amounted to only 7 percent of all\ntime on the air. The remaining 93 percent of\ntotal TV broadcast time breaks down as be-\ntweenthe three principal segments as follows:\nadult-hours, 34 percent; domestic-hours, 33\npercent; and children-hours, 26 percent. The\nfollowing analysis is based on Tables 5 (a),\n(b) and (c).\nThe adult-hour programming.1 Ifthetele-\nvision-user tuned in at random between 7 and\n11 p.m., any day of the week, the probability\nwould be one out of three that he would en¬\ncounter Drama. Drama (General) provides\n34.5 percent of programming in these hours,\nwith an additional 1.7 percent in Children’s\nDrama. Crime Drama alone amounted to 13.3\npercent; Westerns were the second most com¬\nmon form of Drama, with 6.0 percent of which\n4.9 percent was aimed at adults and the re¬\nmainder at children. The second largest\n1. In the discussion of particular audience program\nfare we are dealing with all 8 stations' programs in¬\ncluding Buena Park programs.\ncomponent of adult-hour TV fare was Variety\nprograms, which amounted to 16.3 percent.\nDrama and Variety thus dominate the entire\nprogram structure with 52.5 percent of the\ntotal time. The addition of Popular Music\nbrings the total for the three types to 58.3 per¬\ncent, which ranks the adult-hours as second\nheaviest with these programs. The third\nlargest class of programs was Quiz, Stunts\nand Contests, with 11.3 percent, fairly evenly\ndivided between the four sub-classes. And\nthe fourth biggest class was Sports, with 10.8\npercent, of which Spectator Sports events alone\nprovided 8.3 percent. These five classes of\nprograms constituted 80.4 percent of all adult-\nhour program time.\nAdult-hour programs were low on Public\nIssues (1.9 percent), Public Events (30 minutes\nor 0.3 percent), and News Reports (3.7 per¬\ncent). Information was even more scarce in\nthese hours than for the week as a whole, with\nonly 1.6 percent of the adult-hour program\ntime in the form of General Information, and\n0.3 percent in Children’s Information and In¬\nstruction. In spite of the predominance of\nDrama in the adult-hours, there was exactly\n2 hours, 17 minutes of Classical Drama, or\n1.1 percent of total time programs were tele¬\ncast in these hours. Religion occupied 39\nminutes or 0.3 percent. Personal Relations\nprograms amounted to 30 minutes or 0.2 per¬\ncent.\nDomestic-hour programming. As might be\nexpected, a random tune-in on Los Angeles\nTV before 5 p.m. on weekdays had two out of\nfive chances of finding what have been classed\nas Domestic programs, which constituted 42.4\npercent of all such program time. By far the\nlargest portion of these Domestic programs,\nhowever, were in the sub-class designated\nHousewives’ Variety, which alone amounted to\n19.4 percent of all time on the air. An addi¬\ntional amount of Variety (General) programs\nequal to 7.0 percent were also telecast in\nthese hours. As a result, Variety of all kinds\nprovided 26.4 percent, or about one out of\nevery four hours of programming. Despite\nthe strength of this program element, however,\nthe total of all Drama, Variety and Popular\nMusic programs in the domestic-hours was\nlower than in either of the other two principal\ntime segments. Even so, these types of pro¬\ngrams amounted to 51.4 percent of the total,\n20"
}