{
  "id": "d1289-26",
  "text": "or better than one out of every two hours of\nprogram time.\nThe remaining forms of Domestic programs\n(other than Housewives’ Variety and House¬\nwives’ Music) were led by Cooking programs\nwhich were 10.7 percent of total program time.\nThe next largest sub-class of Domestic pro¬\ngrams was Shopping and Merchandising pro¬\ngrams (display of merchandise and services),\nwhich amounted to 2.6 percent of all the time.\nThe domestic-hours received the bulk of\nthe Buena Park telecasts; it is not surprising\ntherefore to note that Special Events ranks\nsecond after Domestic programs in these hours\nwith 20.2 percent of the total air time.\nScarce among the domestic-hours were\nprograms on News Reports (1.1 per cent), Pub¬\nlic Events (zero), and Public Issues (15 min¬\nutes, or 0.1 percent). Information programs\n(General) amounted to 2.3 percent, while\nChildren’s Information and Instruction pro¬\ngrams were entirely lacking. In view of the\nfact that it would be in these hours that enter¬\ntainment and instruction for the pre-school\nage child would find its most specialized audi¬\nence, it is of interest to observe that in them\nthere were a total of 15 minutes of such pro¬\ngrams, or 0.1 percent. Likewise there were\nno Serious Music programs, nor even any\nLight Music programs. Religion, Fine Arts,\nand the Dance were also absent in these hours.\nThere was a total of 30 minutes each (0.2\npercent) of both programs on Personal Care\nand Personal Relations.\nChildren-hour programming. The chances\nof tuning in at random on a Children’s Pro¬\ngram during the children-hours were one out\nof three; that is to say, these programs\namounted to 34.6 percent of total programming\nin those hours. The general class, Drama,\nstood second in size with 29.3 percent. It\nwould be very misleading, however, to stop at\nthis point in the analysis. Indeed, five-sev¬\nenths of the time classed as “Children’s\nPrograms” consisted of Drama (Children).\nThe total of drama therefore in the children -\nhours was 54.9 percent of all program time.\nIn these hours, Western Drama programmed\nfor children amounted to 14.9 percent of total\ntime, while Western Drama programmed for\nadults made up another 13.3 percent, so that\nWestern Drama as a whole was 28.2 percent\nof all program time. Crime Drama as a\nwhole amounted to 5.2 percent (2'.2 percent\nfor children and 3.1 percent for adults). Ac¬\ntion Drama as a whole constituted 4.3 percent\n(3.2 percent for adults and 1.1 percent for\nchildren). Drama of these three sub-classes\n(Western, Crime, and Action) therefore sup¬\nplied 37.7 percent of total program time in the\nchildren-hours. There were no programs\nof Classical Drama, aimed either at children\nor adults in these hours. Nor were there any\nFairy Tales for children.\nThe three types of programs--Drama,\nVariety, and Popular Music--are even more\nplentiful in the children-hours than in either\nof the other two principal time segments.\nThey add up to 71.9 percent of all program\ntime in these hours.\nIn view of the heavy saturation of the child¬\nren-hours with these kinds of programs, it is\nobvious that many other classes in addition to\nthe Classical drama, and Fairy Tales could\nonly appear in small quantities. Thus, there\nwere no Public Events programs, Public Is¬\nsues programs were 0.9 percent, and News\nReports were 2.8 percent. Information (Gen¬\neral) amounted to 4.7 percent, while Informa¬\ntion and Instruction (Children) were but 1.8\npercent. There was no Science Information,\nand only 17 minutes (0.2 percent) of Pre¬\nschool entertainment. Despite the fact that\nthe children-hours include all of Sunday up to\n7 p.m., there was only 1.3 percent of the time\n(or 2 hours, 4 minutes) devoted to Religion.\nThere were no programs on Personal Care,\non Personal Relations, on Fine Arts, or on the\nDance. Among the Domestic programs tele¬\ncast in these hours (which in total amounted to\nonly 5.6 percent of the children-hours), Shop¬\nping programs devoted to the display of mer¬\nchandise and services outnumbered Cooking\nprograms by a ratio of four to one (1.2 per¬\ncent as against 0.3 percent).\nThe late-hour programming. The hours\nafter 11 p.m. revealed remarkable similarity\nin programming to what had gone before. Like\nthe domestic-hours, the late-hours had a high\nproportion of time devoted to the Special\nEvents telecasts. The 19.3 percent ofthe late-\nhours given over to this kind of programming\nconsisted mostly of Buena Park rebroadcasts\nby film. It also included almost three hours\nof a special fund-raising program for St.\nJoseph’s hospital. Like the adult-hours, the\n21"
}