{
  "id": "d1289-27",
  "text": "late-hours programs are dominated by Drama,\nVariety, and Popular Music. Drama (General)\nalone supplied 33.4 percent of all the time on\nthe air. Variety amounted to 17.6 percent.\nPopular Music was 6.9 percent. Together these\nthree types added up to 57.9 percent of the\ntotal time. If to them be added the Special\nEvents telecasts, the great bulk of the late-\nhours, or 77.3 percent of them, have been ac¬\ncounted for.\nOf all the Drama presented in the late-\nhours, Crime Drama stands in first place with\n10.7 percent of the program time, followed by\nComedy Drama, with 7.7 percent, and Action\nDrama, with 4.6 percent.\nAs in the case of both the adult-hours and\nthe domestic-hours, the amount of time in the\nlate-hours given over to certain types of pro¬\ngrams was quite small. Informationprograms\n(General) amounted to 1.2 percent of the late-\nhours; Public Issues were 1.8 percent; there\nwere no Public Event telecasts; and Public\nInstitutional programs were 1.2 percent.\nNews Reports were 6.1 percent. There was\n2.1 percent of Religion. But there were no\nSerious or Light Music programs, no Classi¬\ncal Drama, no Personal Relations, no Fine\nArts, no Dance. The reader may pursue this\nand other kinds of analysis in terms of indi¬\nvidual station data by referring to Appendix\nA, Tables 2-9.\nSports Programs\nBefore leaving the analysis of the program\nfare available to Los Angeles TV-viewers, a\nbrief description will be offered of one type\nof program which is the subject of considerable\npublic discussion, namely, Sports. Over the\nfull week, Sports programs aggregated 34\nhours, 1 minute, which amounted to 5.4 per¬\ncent of all the program time of the eight sta¬\ntions. Of the total of Sports programs, Sports\nNews programs consisted of 4 hours, 49 min¬\nutes of news and interviews about sports of\nall kinds. The great bulk of the Sports pro¬\ngram time - -or 26 hours, 43 minutes, being\nmore than 4 percent of all program time--was\ndevoted to Spectator Sports. This time was\nallocated as in Table 6. All of the partici¬\npant sports combined received only 149 min¬\nutes of program time.\nThe heaviest emphasis on Sports programs\nwas in the adult-hours, when they received\nTable 6.\nLos Angeles TV Programming: Spectator Sports\nSpectator Sports\n(minute s)\nWrestling (total) 719\nWrestling, by men 516\nWrestling, by women 98\nWrestling, workouts by men 105\nBaseball 427\nBoxing *98\nAuto racing *98\nHorse racing 31\nRoller Derby 30\nTotal 1,603\n10.8 percent of total program time. The child -\nren-hours, with 4.9 percent, and the late-\nhours with 3.4 percent follow in that order.\nThe least Sports were in the domestic-hours\n(0.8 percent).\nOverthe full week, KTTV offered 16.6 per¬\ncent of its program time in the form of Sports\nprograms, heading the list. At the other ex¬\ntreme, KECA-TV, with 0.6 percent, telecast\nthe smallest proportion. The proportions for\neach station of their total time (excluding\nBuena Park telecasts) are as follows:\nSports\nKTTV\n16.6\nKLAC-TV\n10.6\nKTLA\n6.9\nKNBH\n5.7\nKFMB\n2.2\nKTSL\n1.7\nKFI-TV\n1.4\nKECA-TV\n0.6\nAnalysis of Effect of Disintegrating\nMixed Types of Programs\nUp to this point, the analysis of the kinds of\nTV programs has proceeded on the assump¬\ntion that all programs per se are the subject\nof the analysis, and that it is significant to\nfind out how large bulk such mixed types of\nprograms as Quiz, Stunt, Contest, Variety,\nand Popular Music programs. It is also of\ninterest, however, to inquire as to the kinds\nof programming which are mixed up within\nthese heterogeneous program types. Thus,\none could ascertain how much popular music,\ndrama, etc. is covered by the time assigned\n22"
}