{
  "id": "d1289-28",
  "text": "to Variety programs. Similarly one may re¬\ndistribute the time assigned to Popular Music\nprograms to allocate to Variety the occasional\nvariety acts to be found in a Popular Music\nprogram. After each of the mixed types of\nprograms has thus been disintegrated, the\nwhole program structure may be re -assembled.\nThis operation was performed for all the Va¬\nriety programs, children’s as well as adults’,\nfor the Popular Music programs, and for the\nQuiz, Stunt and Contest programs, children’s\nas well as adults’. In this way some 11,620\nminutes were re-distributed, representing 31\npercent of all of the program time during the\nweek. Of this amount of time one third (being\n3,993 minutes or 34 percent of the reassigned\ntime) was in fact unas signable, being the intro¬\nductory remarks of masters of ceremonies,\nand similar interstitial matter. The effect of\nthis dis-integrative analysis is shown in Table\n7 and Appendix A, Tables 10 A, 10 B, 10 C.\nIn summary, the results of the dis-integra¬\ntion of the mixed categories were as follows:\nThe program class which showed the largest\nadditional amount of time was Drama (General)\nwhich received 10 percent of the re-distri¬\nbuted time. The largest gainer among the sub¬\nclasses of Drama (General) was Comedy\nDrama which had an addition of 687 minutes,\nor 6 percent ofthe re-distributed time. Popu¬\nlar Music gained more than it lost from the\nre-distribution, coming out at the end with 644\nminutes more than had originally been as¬\nsigned to it, or 5 per cent ofthe re-distributed\ntime. Musical Drama (8 (g) ) also grew in\nsize by 339 minutes, or 3 percent of the reas¬\nsigned time. Religion gained 107 minutes, or\n1 percent of the time re-allocated.\nAll of the dis-integrated classes other\nthan Popular Music sustained net losses in\ntheir total time. The largest losing class was\nVariety (General) which lost 2,797 minutes\nor 24 percent ofthe redistributed time. House¬\nwives’ Variety lost the next largest share of\nthe reallocated time, losing 2,436 minutes or\n21 percent of the total. The remaining losses\nfell in the following order: Quiz, Stunts and\nContests (General), Other Children’s Variety,\nTeen-Age Variety, and Children’s Quiz,\nStunts and Contests.\nIt is now in order to raise the question\nwhether as a result ofthe disintegration of the\nmixed program categories, the over-all picture\nof Los Angeles TV programming as drawn\nfrom the earlier analysis is substantially\nchanged. Do the categories (some of them\nvery large mixed categories such as Variety,\nQuiz, Stunts and Contests, and Popular Music)\nwhich formerly appeared to dominate the TV\nprograms recede to a less important position?\nDo the Information, and Public Issues types of\nprograms assume larger proportions? Do\nSerious Music, Fine Arts, the Dance, and\nClassical Drama appear in significant quan¬\ntities ?\nEven after the redistribution of the mixed\ncategories Serious Music amounts to only 105\nminutes, or 0.3 percent of total program\ntime.1 The Fine Arts class is still quite\nempty. The Dance is now represented by 2\nminutes of an “Arabian ballet,\" being a num¬\nber for four women and one man from the\nshow “Lost in a Harem.\" Classical Drama\neither for adults or for children has not in¬\ncreased; the former standing at 137 minutes,\nthe latter at zero.\nPublic Events programs remained un¬\nchanged by the distribution of the mixed pro¬\ngram time; they still have 30 minutes for the\nweek. Information (General) programs gain\n41 minutes, but they still are only 2.7 percent\nof total time. The increase was in the cate¬\ngory termed Other-Information with a demon ¬\nstration of fire fighting in the armed forces\n(8 minutes), medical advice on asthma and\nnightmares (15 minutes), a representative of\nthe Sheriff’s office explaining the function of a\nhandwriting expert in law enforcement (16\nminutes) and an explanation of how TV shows\nare produced (2 minutes). Public Institutional\nprograms increased by 36 minutes, but still\nstand at 1.7 percent of the total time. En¬\nlarged by 63 minutes were Public Issues pro¬\ngrams, all in class (3) (a). The total for these\nfour classes was 5.3 percent before the re¬\ndistribution; it is 5.6 percent afterwards. In¬\nformation in the sense of News Reports\n1. The additional 75 minutes include 3 minutes of\nJascha Heifetz doing a staccato number; 3 minutes of an\naria from an opera; 5 minutes of a Rachmaninoff piano\nselection; James Melton singing 3 minutes of \"Pagli-\nacci;\" 3 minutes of a song from \"The Barber of Seville;\"\n3 minutes of a Chopin -waltz on the piano; 6 minutes of\nanother Chopin selection on the piano; a 3 minute ex¬\ncerpt from \"Tales of the Vienna Woods;\" 3 minutes of\na Chopin scherzo; a 4-minute aria from \"The Barber\nof Seville;\" and similar small units.\n23"
}