{
  "id": "d1289-4",
  "text": "Preface\nThis study of the Los Angeles television programming during the period of May 23 to 29, 1951\nis Study #2 in the television monitor ing studies being made by the National Association of Edu¬\ncational Broadcasters. The NAEB is making these studies because of its interest in serving\nthe entire broadcasting industry, the Federal Communications Commission, and the public by\nincreasing the knowledge of current television programming.\nStudy #1 by the NAEB was made in New York City January 4-10, 1951. This study is briefly\nsummarized in Appendix A.\nThe Los Angeles monitoring study, along with the previous New York study and other projected\ntelevision monitoring studies, should be useful in identifying trends in television broadcasting\nand should provide a basis for more intelligent planning by commercial and educational broad¬\ncasters alike.\nThe Los Angeles monitoring study has been financed with the assistance of a grant from the\nFund for Adult Education established by the Ford Foundation* The committee of the National\nAssociation of Educational Broadcasters which is supervising the monitoring studies has been\nfortunate in securing the services of Professor Dallas W. Smythe, of the Institute of Communi¬\ncations Research, University of Illinois, and Professor Angus Campbell, director of the Survey\nResearch Center, University of Michigan. Mr* Smythe and Mr. Campbell are jointly responsi¬\nble for the general research policies practiced in the Los Angeles study and for this report on\nstudy results.\nThe Committee believes that only through the intensive research work of such competent spe¬\ncialists as have made this study can the industry secure the necessary facts for an identifica¬\ntion of the answers to such questions as: Has the pattern of American television programming\nalready been molded? What is this pattern? What are the changes in American television\nprogramming? How does the American television programming relate to and reflect the needs\nof the community?\nIt is often said that television is a window on the world. The purpose of these studies is to\nshow the shape of the world that is there revealed.\nCommittee of the NAEB to Supervise Monitoring Studies:\nGeorge E. Probst, Chairman\nRichard Hull\nHarold McCarty\nSeymour Siegel\nParker Wheatley\niii"
}