{
  "id": "d1289-42",
  "text": "Chapter V\nProcedure and Concepts in Monitoring Los Angeles TV\nThe purpose of this study was to inventory\nLos Angeles television in a typical week in the\nwinter season, 1950-51. To inventory Los\nAngeles television meant: (1) to obtain infor¬\nmation adequate for classifying all program\nmaterial telecast in the week; and (2) to identify\nand time all announcements made by the Los\nAngeles stations on behalf of other persons.\nTo accomplish these objects required the col¬\nlection of a vast quantity of detailed informa¬\ntion and its processing. The collection of the\ninformation was performed by the two study-\ndirectors, assisted by a corps of monitors.\nThis operation was performed by viewing all\nthe TV programs broadcast from the seven\nLos Angeles TV stations and the one San Diego\nstation in the week of May 23-29, 1951. While\nviewing these programs pre-determined kinds\nof information were recorded concerning the\nuse by the stations of this program time. After\nthe viewing phase was completed the informa¬\ntion was processed. This in brief was the\nmethodology of the study. It will be presented\nin more detail under three captions: adminis¬\ntrative aspects of the monitoring; procedure\nand concepts in monitoring; and editing and\ntabulating.\nMonitoring - Administrative Aspects\nThe study was organized and administered\njointly by its two directors. The viewing phase\nof the study was located at the Chateau Elysee,\n5930 Franklin Avenue, Hollywood where there\nwas a suite rented. In addition to a large liv-\ningroom, the suite provided sleeping quarters\nfor the directors so that they could be present\nat all times while programs were being viewed.\nThe facilities were selected in the light of\noptimum TV signal reception, being located on\nthe side of the building facing the Los Angeles\nTV antennas on Mt. Wilson, and where air-line\nreception from station KFMB in San Diego\nwould be possible.\nNine TV sets were rented--to be tuned to\neach of the eight stations and one extra to be\nused by the study directors as a roving monitor\nand as a standby in the event of equipment fail¬\nure. (In fact there were no difficulties with the\nsets.) A roof-top antenna was installed and\noriented to KFMB in order to provide optimum\nreception conditions for this San Diego station.\nThe remaining sets operated satisfactorily with\nindoor antennas. The eight sets to be used by\nthe monitors were equipped with headphones.\nAn electric clock with a large face and sweep-\nsecond hand was rented from the Western\nUnion Telegraph Company and installed in the\nlivingroom where the sets were located, in\nplain view of the monitors. Stop-watches were\nsupplied for all eight monitoring sets. The\nremaining physical preparations included the\nprinting or mimeographing of supplies of the\nmaster cards, the special report forms to be\nused for certain classes of programs, and the\nmonitors’ instructions.\nThe selection of monitors received careful\nattention. Using a detailed personnel applica¬\ntion form, approximately 90 candidates were\ninterviewed from the ranks of graduate and\nadvanced undergraduates at both the University\nof California at Los Angeles and the University\nof Southern California. Those from UCLA\nwere graduate students in the Psychology of\nCommunications course, and in the Theatre\nArts Department, plus a small number of\nundergraduate Psychology and Theatre Arts\nmajors. Interviews were also conducted with\nsome eight professional interviewers recom¬\nmended by a commercial research agency,\nwhich in turn was endorsed by psychologists\nat USC and Claremont Men’s College. The\npurpose of recruiting these interviewers was\nto leaven the ranks of the student monitors\nwith mature, experienced interviewers. At\nthis point, the study directors selected as a\nsupervisor Mr. Marvin Spiegelman, candidate\n37"
}