{
  "id": "d1289-43",
  "text": "for the Ph.D in the Psychology of Communica¬\ntions at UCLA, then in the last stages of his\ndoctoral work. Mr. Spiegelman has been spe¬\ncially trained in content analysis. With his\nassistance the candidates for the monitoring\nwork were screened into three groups of which\nthe best qualified group consisted of candidates\nwho had, either by advanced education or ex¬\nperience or both, acquired competence in re¬\nsearch in the field of radio, television or mo¬\ntion pictures. All of the monitors who were\nemployed were drawn from this group.\nWhen the selected candidates were notified\nof their appointments as monitors, they were\ncalled in for training. Meanwhile assignment\nschedules were prepared for the monitors’\ntours of duty. In preparing this schedule and\nin subsequently supervising the actual opera¬\ntion, care was exercised to provide a safety\nmargin of available monitors over and above\nthe number sitting before the sets. Most of\nthe time during the study there was a sub¬\nstantial surplus of monitors so that frequent\nreliefs could be given to those actually per¬\nforming the monitoring on the sets.\nFour training sessions were conducted. All\nmonitors attended at least one of these ses¬\nsions, depending on their availability when the\ntraining sessions were held. At each of the\nsessions, both directors were present. In each\nsession, the purpose and procedure of the\nstudy was explained in detail. Emphasis was\nplaced on the directors’ desire to obtain objec-\ntive, scientific information of the kinds pre¬\nscribed in the instructions, and of the unde-\nsirabilityof allowing per sonal opinions to color\nthe reporting of the information. The instruc¬\ntions were distributed and read aloud. The\nmaster cards were distributed and explained.\nThe special report forms and the tentative\nprogram classification schedules were dis¬\ntributed, explained and read aloud. After¬\nwards, the monitors were put to work, moni¬\ntoring programs using the forms, the stop\nwatches and the electric clock. Their per¬\nformances were checked and criticized. At\nthis point three or four of the monitors were\nweeded out because of indications that their\nperformance might be unsatisfactory. Alto¬\ngether a total of 40 monitors actually con¬\ntributed to the monitoring.\nIn planning the administrative aspects of\nthe study, provision was made for monitors to\noperate in duplicate fashion in viewing the pro¬\ngrams as a method of checking the reliability\nof the monitoring work. Two whole days of\nprogramming were thus monitored independ¬\nently for two stations.\nHaving completed the preparatory work, the\nviewing was begun on the morning of Wednes¬\nday, May 23, when the first station went on the\nair. Monitoring continued without interruption\nfrom the receiving end until the last station\nwent off the air on the night of May 29-30.\nDuring this period allprogram time was moni¬\ntored under the personal, on-the-spot, super¬\nvision of the two directors. Figure 1 (p. 39 )\nis a photograph of the study in progress, show¬\ning six of the sets in operation, the electric\nclock on the wall, and the two study directors\nstanding beneath it, while Mr. Spiegelman\nstands beside a TV set. Figure 2 (p. 39) shows\nthe monitoring room from the other end.\nMonitoring - Concepts and Procedure\nTime is the essence of television. The key\nconcepts in this study relate to time. One of\nthem is this: all time when the station is on\nthe air (not counting test-pattern broadcasts)\nmust be credited to some program. In staking\nout this concept, the study directors were fol¬\nlowing the tradition of radio and television\nafter it that the ostensible purpose of the ser¬\nvice is toproduce programs. For convenience\nthe verbal fiction that a program has an open¬\ning “curtain\" and a closing “curtain” is useful\nin understanding the methodology of the study.\nAs far as program classification was con¬\ncerned, the time between the program’s two\ncurtains must be counted, but so also must the\ntime between the closing curtain of one pro¬\ngram and the opening curtain of the next pro¬\ngram. This period of time, termed a “station\nbreak,” may have advertisements for commer -\ncial sponsors in it. It may also have “station\nplugs’’--i.e. announcements and advertise¬\nments for future programs. It will very likely\nhave the announcement of the station call let¬\nters. Whatever its content, the policy of this\nstudy was to credit such station break time to\nthe program which preceded it. In doing so, of\ncourse, the time occupied by all spot announce¬\nments and station promotion in station breaks\nwas added to the actual time when program\n38"
}