{
  "id": "d1289-45",
  "text": "content was being telecast. This results in\nover-stating the amount of all kinds of pro¬\ngramming.\nThe second key concept in the study relates\nto time used for advertising. “Advertising”\nmeant the time used by a station on behalf of\ncommercial purposes other than its own. That\nis to say, the promotion of the station or its\nprograms was not considered to be advertis¬\ning; it was simply counted as programming\ntime. A related concept to advertising was\nthat of the “public agency announcement.\" This\nterm refers to the time used by a station on\nbehalf of noncommercial purposes other than\nits own. Typically, announcements in connec¬\ntion with the Armed Forces, the Heart Fund,\nCancer Drives, etc. represent public agency\nannouncements. The second key concept, then,\nwas that all time used for advertising (or\npublic agency announcements) must be counted,\nwhether it be inside a program or outside (in a\nstation break).\nAs far as the viewing and monitoring were\nconcerned, these concepts were quite feasible,\nadministratively. However, in the editing\nphase of the study, a seeming paradox pre¬\nsented itself when it was found that some “sales\npitches\" ran for as long as 28, 30, and even\n37 minutes. These were in no sense “pro¬\ngrams.” Yet to credit their time to preceding\nbona fide programs would result in gross dis¬\ntortion. They had no content other than that of\nthe pitchman displaying and hawking his wares.\nSometimes they had no title other than the\nname of the product being hawked. The rule\nadopted was to count them as “Shopping and\nMerchandising,” Class 16(c), a program class\ncreated originally for style shows, etc. This\nsolved one problem but created another: when\nis a sales pitch a spot announcement and when\nis it a Shopping Program? This one was\nsolved arbitrarily by determining that any\nsales message shorter than 3 minutes in length\nwas a spot announcement and its time and that\nof other matter preceding it in the same station\nbreak should be credited to the preceding pro¬\ngram. Where the sales message outside the\nprogram curtains was three minutes or longer,\nit was termed a Shopping program, and its\ntime and that of subsequent spot announce¬\nments was credited to it as a program. For\nfurther explanation of the treatment of the\nadvertising content of such programs, see\n“secondary advertising,” below.\nThe third key concept relates to the prin¬\nciple on which the entire program classifica¬\ntion rests: namely that a program may be\nclassified in accordance with the nature *of its\npredominant elements. This means that where,\nas is often the case, a program contains two\nor more characteristics each of which would\nsuggest placing it in different classifications,\nthe decision in this study was made on the\nbasis of the predominant element. And pre¬\ndominance in this sense refers to the propor¬\ntion of time within the program occupied by\nthe various elements and the emphasis given\neach. The same principle has governed the\ndevelopment of the structure of program\nclassification. Where a program class ap¬\npeared to contain heterogeneous kinds of pro¬\ngrams, the directors have consistently sought\nto revise the classification scheme sufficiently\nso that like things could be placed together.\nThe function of the monitor was to do the\nfollowing things, under supervision:\n(1) To time the program matter, to the\nminute, by the clock, and to record this and\nother aspects of the program in accordance\nwith his instructions. The Monitor’s Instruc¬\ntions are reproduced as Appendix B. These\nInstructions told him to fill in a master card\nfor each program segment viewed. The Master\nCard is reproduced as Appendix C. As far as\nprogram content was concerned, the master\ncard called for the following items, on its face:\nthe time the program began and ended; the title\nof the program; an indication whether the pro¬\ngram was film or live; and a recommendation\nas to a proper program classification for the\nprogram. The purpose of the latter require¬\nment was less to obtain probative judgments\nthan to direct the monitor’s attention to the\nobjective aspects of the program as to which\nthe study directors desired information. The\ninstructions directed the monitors to record\non the back of the master card a full descrip¬\ntion of the form and content of the program.\nMonitors were supplied with a Tentative Pro¬\ngram Classification (reproduced in Appen¬\ndix D), and were asked to watch for and to re¬\ncord on the back of their master cards’’...the\npresence or absence of elements in the pro¬\ngram which would tend to place it in one rather\nthan another of the classifications.” They\nwere advised that “where a program naturally\n40"
}