{
  "id": "d1289-46",
  "text": "concerning the determination that an advertise -\nment more than 3 minutes long, and outside of\na program should be considered a Shopping\nProgram.\nAt the conclusion of this phase of the editing\nprocess, the classifications assigned by the\ndirectors to every program were again re¬\nviewed, this time in the light of classifications\nassigned to similar kinds of programs, and to\nother telecasts of the same program (where\nthe program was on a several-times-a-week\nbasis). The purpose of this review was to\nforce a justification for every program classi¬\nfication. In the course of this review different\nclassifications were determined for different\ntelecasts of the same program in some in¬\nstances, while uniformity between classifica¬\ntions was achieved as between other compar¬\nable programs. Differences in classification\nwere as desirable as uniformity, if justified;\nthe function of this review was to make the\nclassifications as rational as possible.\nProgram classification is a tender opera¬\ntion; and reasonable men may differ on certain\ndecisions made in the course of it. The direc¬\ntors of this study believe, however, that their\nclassification practice as embodied in the de¬\ncisions made on the programs under review\nwould be agreed to without question in all but\na very few borderline cases, about which they\ntoo have some doubts.\nIn the course of these two reviews of the\nprogram classifications to be accorded the\nLos Angeles television programs a number of\nchanges were made in the classification scheme\nwhich had been tentatively adopted at the be¬\nginning of the study. The final classification\nsystem is presented in Table 23. The changes\nwere as follows:\nClass 1--News. In New York there had\nbeen no “special event” telecasts. In Los\nAngeles, there were substantial quantities of\ntime devoted to programs which did not fit into\nany of the tentative classifications. The many\nhours of remote-pick-up telecasts on the\nsearch for the Hull girl in Buena Park pre¬\nsented the problems sharply. Then too there\nwere several hours of a fund-raising program\nfor the benefit of a local hospital which could\nnot properly be fitted into existing classifica¬\ntions. By analogy to the special feature stories\nof the newspapers, the decision was made to\nsubdivide the News class into “News Reports,”\nand “Special events and features,\" and to\nclassify these special event programs under\nthe latter heading.\nClass 7--Religion. Although very little re¬\nligious programming was observed in Los\nAngeles, the definition of this class was\nbroadened to include “hymns.”\nClass 8--Drama.\n8 (b)--Crime. Spy stories, of which a\nnumber were observed, were added to this\ncategory, being closely akin in detective, crime\nmelodrama, mystery and horror stories.\n8 (d)--Action. A new sub-class with\nthis title was created to fit a substantial num¬\nber of movie programs which emphasize ac¬\ntion and adventure, but lack the “western” plot\nand setting, and in which other interests (the\n“love” interest, the mystery interest, etc.)\nare subordinate.\nClass 10- -Music. A species of popular\nmusic program aimed at the housewife and\ntelecast during the daytime hours caused the\ncreation of a new sub-class, “Housewives’\nMusic,” which was placed under the general\nheading “Domestic” and became class 16 (g).\nBut for this decision, this type of program\nwould have been classed as 10 (c) Popular\nMusic.\nClass 12--Variety. The distinction between\nvaudeville (or “formal variety”) and informal\nvariety, which had been evident in New York\nTV programming, did not appear applicable to\nLos Angeles television. These two sub-classes\nwere therefore abolished and a more general\ndefinition for the broad class supplied.\nClass 14--Quiz, Stunts and Contests.\n14 (d)--Talent. This name was substi¬\ntuted for “amateur\" in order to accommodate\nprograms essentially similar to amateur con¬\ntests but where the contestants do not profess\nto be amateurs and probably are not.\nClass 15--Sports.\n15 (b) --Spectator Sports. The definition\nwas expanded to include such synthetic sports\nas “roller derbies” and “jalopy races.”\nClass l6--Domestic. Though the name is\nchanged, the class is quite similar to the\n“Homemaking” class employed in the New York\nstudy. The change was the result of putting\nunder 16(b), “Arts, Crafts, and Hobbies\" some\nprograms whose appeal is primarily not to\nhousewives as such, and by the inclusion in\n16 (c) of many shopping programs aimed at\n42"
}