{
  "id": "d1289-47",
  "text": "Table 23.\nClass\n1\n1 (a)\n1 (b)\n3\n3(a)\n3(b)\n5(a)\n5(b)\n6\n6(a)\n6(b)\n6(c)\n8(a)\n8(b)\n8(c)\n8(d)\n8(e)\n8(f)\n8(g)\n8(h)\n8 (i)\n10\n10(a)\n10(b)\n10(c)\n12\nLos Angeles Television: Program Classes\nTitle\nNews\nNews reports\nSpecial events and features\nWeather\nPublic issues\nIndividual views\nDiscussion and debate\nPublic events\nPublic institutional programs\nExpository\nDramatization\nInformation (General)\nScience\nT ravelogue\nOther\nReligion\nDomestic\nWestern\nAction\nComedy\nRomance\nMusical\nClassics\nOthe r\nDescription\nGeneral news programs including all news reports except sports news.\nSpecialized and extensive treatment of background of current news;\nother “feature\" programs. These programs employ extensive remote\nor actuality film coverage.\nReports and forecasts.\nExpressions of opinions in formal or informal talk or interview, with\nabsence of debate.\nExpression of different opinion and points of view.\nPublic ceremonies, assemblies, parades; sessions of official bodies,\netc., reported extensively, not as part of a news program.\nPrograms demonstrating some aspect of the organization or activities,\nof such institutions as the Army, Navy, Cerebral Palsy drive, etc.\nFactual description.\nDramatic re-enactment of some phase of the activity.\nMust include some reference to or discussion of scientific principles.\n“Nature\" film shorts are not included here.\nThe standard film short.\nMiscellaneous documentary material on nature, industry, technology,\nhealth, etc. Includes “institutional\" advertising films produced by com¬\nmercial organizations. Also instructional programs not specifically in¬\ntended for women (class 16) or children (class 17).\nReligious services, talks, dramatizations, hymns.\nFictional dramatization. Includes usually a complete story (or a seg¬\nment of a continuing story). Dramatizations which are minor portions\nof programs which have predominantly other interests are excluded No\ndistinction is made between film and live productions.\nIncludes drama concerned primarily with family relations and problems\nand television soap operas.\nCrime melodrama, murder, spy, detective, mystery and horror stories.\nThe standard cowboy melodrama.\nAdventure and action stories (lacking the western plot and setting) in\nwhich other interests than action are subordinate.\nDramatic programs emphasizing comedy, including some serial pro¬\ngrams closely related to the domestic drama class butwith greater em¬\nphasis on comedy situations.\nthemf118 hiSt°riCal and °ther stories with a Predominantly romantic\nMusical comedies and light opera.\nDramatic works that have become part of the permanent literature of\nthe theatre; or films and plays based on classic novels or stories.\nMusic\nSerious\nLight\nPopular\nFine arts\nVariety\nPresentation of dance as an independent art, as in theatre production of\nclassical ballet, etc., where the predominant part of the program con¬\nsists of dance. Dancing as a component in variety shows is included in\nMusical program included here are those in which njusic is the dominant\nelement of the program other than Housewives’ Music (class 16 (g)).\n“Classical\" music; the permanent literature of the concert hall.\n“Semi-classical,\" \"dinner” music.\nCurrent songs, dance music, “hillbilly\" music.\nPainting, sculpture, graphic arts, etc.\ny comP°slte singing, dancing, instrumental music, comedy skits,\nimpersonations, magical tricks, acrobatics, etc.,whether it be “formal\"\n*eatrlCal Vanety' °r special television forms of variety lacking some\n° hC C^racterlstlcs of theatre presentations. It is distinguished from\nmusic (10 (c)) in that variety acts rather than music predominate, and\nfrom Housewives’ programs (16 (f) and 16 (g)) in that special house¬\nwives interests are lacking or subordinate.\n43"
}