{
  "id": "d1289-48",
  "text": "Table 23. (cont.)\nClass\nTitle\n13\nPersonalities\n14\nQuiz, stunts, contests\n14(a)\nExperts, guests\n14(b)\nStudio audience\n14(c)\nTelephone\n14(d)\nTalent\n15\nSports\n15(a)\nNews, interviews\n15(b)\nSpectator sports\n15(c)\nParticipant sports and recreations\n16\nDomestic\n16(a)\nCooking\n16(b)\nArts and crafts and hobbies\n16(c)\nShopping and merchandising\n16(d)\n16(e)\n16(f)\nPersonal care\nPersonal relations\nHousewives’ variety\n16(g)\nHousewives’ music\n16(h)\n17\nOther\nChildren’s programs\n17(a)\nInformation and instruction\n17(b)\n17(c)\nPre-school entertainment\nDrama\n17(c)(1)\n17(c)(2)\n17(c)(3)\n17(c)(4)\n17(c)(5)\nCrime\nWestern\nComedy\nAdventure and historical\nChildren’s action\n17(c)(6)\n17(c)(7)\nFairy tales\nClassics\n17(c)(8)\nOther children’s drama\n44\nDescription\nInterviews of or conversations with or about celebrities, people “in the\nnews,” unusual occupations, etc. Also includes dramatizations of an in¬\ndividual’s life problems in an ostensibly realistic manner and in con¬\njunction with the appearance of the individual. The emphasis is on dis¬\nplaying the subject rather than on serious discussion.\nAny program in which the basic activity is a social game or contest of\nwits or other talents or chance, with prizes or penalties for the perfor¬\nmance (excluding sports).\nThe contest or stunt occurs among a panel of “experts ” or a group of in¬\nvited guests.\nThe participants obviously are drawn from among the casual studio au¬\ndience.\nThe contestants are members of the home audience, reached by telephone.\nShows in which professional or nonprofessional entertainers compete for\napplause and/or assistance in their professional career.\nIncludes the major competitive team sports, field sports, and individual\nathletic skills and recreations.\nNews of the sports world; interviews or discussions on the subject of\nsports where these are not minor parts of another program. May in¬\nclude brief excerpts from films of sporting events.\nThe major competitive sports; basketball, boxing, wrestling, track events ,\netc. Also includes such synthetic sports as “roller derbies,\" “jalopy\nraces.\"\nIncluding hunting, fishing, mountain climbing, etc.\nPrograms intended primarily for women; addressed to their interests as\nhousewives. Includes all “merchandising\" programs.\nCooking demonstrations, recipes, foods and their qualities, etc.\nNon-fictional programs having to do primarily with the household and its\nactivities, including household hints, interior decoration, hobbies, pets\nand handicrafts.\nPrograms displaying or hawking merchandise or services, dis :ussing\nfashions, the merits and uses of various products or services, giving\nadvice on buying, etc. Includes “commercial pitches\" longer than 3 min¬\nutes outside of titled programs. All advertising messages inside titled\nprograms and all advertising messages three minutes or less in length\noutside titled programs are ignored in the program classification and\nthe time devoted to such messages is counted in the classification given\nto the text of the program.\nBeauty, hairdressing, physical fitness, etc.\nDiscussion of marital problems, child care, manners, and etiquette, etc.\nA special form of the variety show produced for housewives; with mis¬\ncellaneous shopping information, cooking and style hints, personality\ninterviews, etc!, intermingled with variety acts.\nMusic programs aimed at housewiv.es. Programs placed in this class\nbecause of the context (behavior of the Master of Ceremonies, for ex¬\nample) or of a content including some cooking, recipes, etc., but with\nmusic the predominant interest.\nAll programs in any of the preceding classes, intended primarily for\nchildren, as indicated by specific content, advertisements, title or con¬\ntext. Time of broadcast was not relied on in classifying in this category.\nPrograms intended to provide information and/or instruction in fields\nand activities of special interest to children.\nPrograms at the nursery-school level for the youngest children.\nIncludes usually a complete story (or a segment of a continuing story).\nDramatizations which are minor portions of programs which have pre¬\ndominantly other interests are excluded.\nCrime melodrama, murder, spy, detective, mystery and horror stories.\nStandard westerns, with or without live studio setting.\nIncludes programs with emphasis on comedy situations.\nFantastic adventure and “historical\" thrillers.\nAdventure and action stories in which other interests are not predomi¬\nnant.\nTales and stories from folklore.\nDramatic works that have become part of the permanent literature of\nthe theatre; or films and plays based on classic movies or stories."
}