{
  "id": "d1289-49",
  "text": "Table 23. (cont.)\nage %\nOther variety\nQuiz, stunts and contests\nOther children’s programs\nDescription\nVariety shows by or for teen-age children. Commonly contain sports\ninterviews, deportment and clothing advice, music, dance, or amateur\ncontests.\nVariety shows for children, especially younger children. Sometimes\nthe children participate. Includes circus, clowns , acrobatics , vaudeville.\nAs in class 14, but with children as participants and intended for child\naudiences.\nClass\n17(d)\n17(e)\n17(f)\n17(g)\nmale or child members of the domestic estab¬\nlishment.\n16 (b) - -Arts, Crafts and Hobbies. This\ntitle was substituted for the closely similar\nsubclass in the tentative classification, “Deco¬\nrating, handicrafts and hobbies” to better ex¬\npress the content of the category as it was\nmonitored in Los Angeles.\n16 (c) - -Shopping and Merchandising. The\ntitle now reflects the greater degree of aggres¬\nsiveness in this type of program in Los Ange¬\nles TV than had been experienced in New York.\n16 (g) --Housewives' Music. This new\nsubclass was explained above under 10 (c).\nClass 17- -Children’s Programs. One of the\nlarger changes made in the New York classi¬\nfication practice appears at this point. In the\nNew York study specific content, title, form of\nintroduction, and time of broadcast were all\nconsidered in determining whether to place a\nprogram in this class or not. In Los Angeles\na substantial amount of programming would\nhave fallen into this category on the strength\nof the last of these elements--time of broad¬\ncast-alone, since these programs lacked the\nother elements. The decision was therefore\ntaken to tighten up the definition by excluding\ntime of broadcast as an element in determining\na program to fall in class 17. It was at this\npoint that some of the most trouble some border -\nline cases presented themselves. To illustrate\nthe policy which was followed, a program\ncalled “Cartoon Theatre” was classed as\n17 (c)(3) because it contained cartoons (“Felix\nthe Cat,” “Aesop’s fables,” etc.) which pre¬\nsumably were intended for children at 7:45 to\n8:00 p.m., while some westerns and “Old Tyme\nComedie” (with Mabel Normand and the Key¬\nstone Hops) telecast between 5 and 7 p.m. were\nplaced in Drama, General (Class 8) because of\nthe apparent absence of direct child appeal.\nIn following this practice the directors hoped\nto achieve a conservative total for Children’s\nPrograms, especially Westerns. In the sub¬\nclasses of Children’s Programs, the thorough\nrevision of the New York categories which was\nembodied in the tentative Los Angeles classi¬\nfication scheme was intended to accomplish\ntwo major objectives. One was to reduce the\nemphasis on formal categories. In New York\nthere had been categories for “Puppets, and\nMarionettes,” and “Cartoons.\" In the tentative\nLos Angeles scheme, such formal categories\nwere taken out of the classifications which\nwere left in more substantive terms. Informa¬\ntion on the method of presentation (cartoons,\netc.) was collected, however, in Los Angeles\non the specialform usedfor children’s as well\nas adults’ Drama. The other major objective\nof the revision was to bring the Children’s\nProgram categories more closely in line with\nthose for adults. For this reason, the sub¬\nclasses of children’s drama programs (17) (c))\nare for the most part parallel to the adult\nclassifications. And as with the adult Drama,\nso in children’s drama, the post-viewing re¬\nview resulted in adding a new subclass, “Chil¬\ndren’s Action\" drama, class 17 (c)(5).\nSecondary Advertising\nThe directors” review of the monitors\"\ncards flagging programs as possibly contain¬\ning “secondary advertising” raised new prob¬\nlems. That this may be true for station oper¬\nators as well is indicated by press reports of\nthe National Broadcasting’s new program\nstandards in which considerable pains are\nexercised to set forth the limits to which that\ncompany will permit sponsors to go in inter¬\nmixing visual advertising matter with the en¬\ntertainment or information content of the pro¬\ngrams. The procedure followed in analyzing\nthe “secondary” advertising programs in this\nstudy has been explained in some detail in\nChapter IV. The directors overruledthe moni¬\ntors’ judgments as to which were “secondary\"\nadvertising programs in more than half of the\nprogram time involved. The basis of this\n45"
}