{
  "id": "d1289-50",
  "text": "decision was, again, the principle of the pre¬\ndominant element. Where less than half of the\ntime was occupied by secondary advertising\nmatter, the programs were not so classed.\nThe result of the decision is that there is an\nappreciable amount of “secondary” advertising\nin 7.1 percent of the total program time which\nis not reflected in the analysis of secondary\nadvertising given in Chapter IV. In the course\nof the study of the secondary advertising pro¬\ngrams, two new concepts were introduced.\nThese were the concepts of secondary adver¬\ntising programs being either “straight second¬\nary” or “intermixed.” Since these concepts\nverge on the program classification area, a\nword of further explanation is in order.\nThe “straight secondary” program is one\nwhere the central idea of the program is the\nsales message of the sponsor. It includes the\n“program” in which the pitchman spends up¬\nwards of 25 minutes advising the listener of\nthe baleful consequences of failing to include\nin his diet a certain brand of vitamin. It also\nincludes a program where for 31 minutes, by\npictures, and by explanation, the viewer is told\nof the perils of termites, and the means for\ntheir extermination, with frequent mentions of\nthe sponsor’s products and service both by\ninnuendo and explicit reference. It may also\nbe a program which displays nothing but prod¬\nucts , signs, etc. for a group of sponsors, and\nverbally extolls their merits and the attrac¬\ntiveness of their prices.\nThe “intermixed secondary” program is\none where there are two central ideas: on the\none hand some form of entertainment or in¬\nformation, and on the other hand, the merits\nof the sponsor’s products or services.\nLive vs. Recorded Programs\nThe editing for live versus recorded pro¬\ngramming was restricted initially to drama\nprograms: both Drama (General), and Drama\n(Children’s). It will be recalled that by in¬\nstructions, and by entries on the master cards\nand special report forms, the monitors had\nbeen asked to record this information. The\ndirectors then reviewed each of these program\ncards and determined whether to classify it as\nlive or recorded. The distinction between\nmotion picture film and kinescope film could\nprobably have been made with a fair degree of\nreliability. Its significance as far as the viewer\nwas concerned, however, seemed nominal: in\neither event the program was not produced\nsimultaneously by live actors, and its techni¬\ncal quality was inferior in either case to that\nof live programs. For this reason no effort\nwas made to present a further breakdown of\nrecorded film into kinescopings, and “film.’’\nDisintegration of Mixed Programs\nSome interest was expressed in connection\nwith the New York study regarding the break¬\ndown ofthe heterogeneous program categories\ninto their constituent elements. The analysis\nof these programs is presented in Chapter III\nwhere it is referred to as the dis-integration\nofthe “mixed” program categories. The cate¬\ngories selected for “dis-integration were\nPopular Music (10(c)), Variety (General, (12),\nQuiz, Stunts and Contests (General) (14), the\nsubclass , “Housewives’ Variety\" (16(c)), Teen-\nAge Variety (1 7(d)), Other Children’s Variety\n(17(e)), and Children’s Quiz, Stunts and Con¬\ntests (1 7(f)). All ofthe cards in these program\nclasses were reanalyzed, and the time repre¬\nsented by them was redistributed among the\nvarious existing program classes as if each\nelement (or “act,” or “stunt\") in each of these\nprograms were a separate program. When\nthis had been done the time thus distributed to\nthe several program classes was added to the\ntime already in them (except of course for the\nclasses being disintegrated), and the resulting\ntabulation, Table 7, was prepared. There re¬\nmained in the disintegrated classes the resid¬\nual amounts of time which dould be classified\nstrictly in no other categories. The new cate¬\ngory “Other” appearing atthebottom of Table 7\ncontains the interstitial time consisting of the\nmiscellaneous chit-chat by the Master of Cere¬\nmonies, his introductions of performers, and\nsimilar interludes between the acts, stunts,\netc.\nSustaining vs. Sponsored Programs\nHere, as in the case of the New York study,\nan effort was made to ascertain the extent of\nsponsored as against sustaining programming.\nBut as in the case ofthe New York study, it\nwas found that viewers in the position of the\ntelevision public can hardly make such deter¬\nminations. The profusion of advertisements\nusually presented at the end of one program\nand the beginning of another leaves doubt in\n46"
}