{
  "id": "d1289-6",
  "text": "Chapter I\nSummary\nDuring the week of May 23 to 29, 1951,\neight television stations were serving the Los\nAngeles area. During this seven-day period\nthe entire programming of these eight stations\nwas monitored, with especial attention to the\nextent and content of the different types of pro¬\ngrams. A record was also taken of the fre¬\nquency and duration of all televised advertis¬\ning during this period. The major findings of\nthe study are presented in the following pages.\nDrama Programs Took the Largest\nPiece of the Available TV Time\nApproximately one-fourth (26 percent) of\nthe total TV program time during the test week\nwas devoted to general adultDrama programs.\nThis was largely motion pictures. Domestic\nprograms, including programs on cooking,\nshopping, and personal care, variety programs\nfor housewives, and similar presentations,\ntook the next largest single parcel of the\nweek's time, 16 percent.\nNewsreports contributed 12 percent of the\ntotal, a proportion considerably inflated by the\nunusual circumstance of a \"special events\"\ntelecast over two of the Los Angeles stations\nin connection with a kidnapping in Southern\nCalifornia which shortly preceded the test\nweek and amounted to approximately eight per¬\ncent of total time on the air. Children's pro¬\ngrams of all kinds took 10 percent of the total\ntime, variety programs for general audiences\ntook an equal amount, and Music of all types\n(although largely popular) took six percent of\nthe total programming. Eighty percent of the\ntotal television time during the week of moni¬\ntoring was taken up with these types of pro¬\ngrams.\nIf one considers program types without re¬\nspect to their intended audiences, combining\nall Drama programs (adult and children's),\nall Variety (general, housewives', and child¬\nren's), and all Popular Music (general and\nhousewives'), these three categories account\nfor 60 percent of all the program time. If the\ntime of Quiz, Stunt and Contest programs,\nPersonality shows, and Sports programs is\nadded to this, nearly three-quarters (73 per¬\ncent) of the total time is accounted for.\nInformational, Religious and Discussion Programs\nPlayed a Minor Role in the Week’s Presentation\nThe time not taken up by the types of pro¬\ngram listed above was divided among a va¬\nriety of program clas sifications , none of which\ncommanded more than a small amount of the\ntotal program time. Information programs,\nincluding travelogues, scientific presentations,\ninformation programs for children, and the\nlike, took approximately three percent of the\ntime available. Programs dealing with Public\nInstitutions, i.e., the Police Department, Los\nAngeles Harbor Authority, etc., took almost\ntwo percent. Religion as a program class\nhad less than one percent of the total time.\nPublic Events and Weather each amounted to\nless than one percent of the total.\nSome types of programs which had been\nobserved in other monitoring studies did not\noccur at all during the test week. There were\nno programs dealing with the Fine Arts or the\nDance. There were no programs during the\nweek the production of which was in any way\nidentified with an educational institution.\n“Westerns” Led the List\nof Drama Programs\nWithin the broad class of Drama,the West¬\nern Drama led all sub-classes of programs\nwith slightly more than ten percent of the total\nprogram time of the test week. Together with\nCrime Drama, which amounted to nearly nine\npercent of the total, these two forms of Drama\ncontributed approximately one-fifth of all TV"
}