{
  "id": "d1289-7",
  "text": "programming. By way of contrast, Classical\nDrama contributed less than one percent, all\nfor adults.\nThe great bulk of all Drama was film and\nkinescoped programming; six percent of Drama\nwas live. The proportion of live programming\nwas larger in Drama aimed at children’s audi¬\nences (16 percent) than in Drama aimed at\nadults (3 percent). However, 97 percent of the\nWestern and Crime Drama (for both adults\nand children) was recorded material.\nThe eight stations of the Los Angeles area\nvaried cons ide rably in the extent to which their\ntotal programming included this type of pres¬\nentation. The viewer who randomly tuned in\nhad the highest likelihood of finding some form\nof Drama of KFI-TV where the chances were\nthree out of five, while on KTTV his chances\nwould have been nearer one in five.\nDrama, Variety, and Popular Music\nDominated the Evening Hours\nDuring the adult-hours (seven to eleven\neach night), the saturation of all program\ntime with all forms of Drama, Variety, and\nPopular Music was higher than for the week\nas a whole. Fifty-eight percent of all time\nduring this period consisted of one or another\nof these programs. Programs classified as\nInformation, Public Issues, or Public Events\ntook approximately the same proportion of\ntime during these hours as they did during the\nweek as a whole.\nThe distribution of programs during the\nlater hours (after 11:00 every night) resembled\nthat of the adult-hours. About three-fifths of\nthe programs during this period presented\nsome form of Drama, Variety, or Popular\nMusic. During the test week a fifth of the time\navailable during these hours consisted of re¬\nbroadcasts of the telecasts from the Buena\nPark kidnapping. Among the late-hours Drama\nprograms, Crime Drama had a preferred\nplace with 11 percent of the total program\ntime, a higher proportion than in any other\nperiod of the day.\nPrograms for Housewives, Especially Variety,\nFeatured the Domestic Hours\nThe domestic-hour programming (week¬\ndays from a sign-on to five p.m.) were char¬\nacterized by the Domestic class of program.\nHousewives’ Variety programs took a heavy\nshare of this time, approximately one-fifth,\nand if other Variety programs presented dur¬\ning this period though not specifically ad¬\ndressed to housewives are added, the total\nproportion going to Variety was 26 percent.\nCooking programs amounted to 11 percent of\nthe Domestic time; Shopping and Merchandis¬\ning programs accountedfor an additional three\npercent. Domestic time carried what is prob¬\nably an unusually high proportion of Special\nEvents programs during the week monitored\nbecause of the telecasts from the scene of the\nBuena Park kidnapping. This class of pro¬\ngram took approximately a fifth of the total\nDomestic time.\nDrama Took Over Half of the\nChildren-Hours Programming\nFifty-five percent of all the program time\nduring the children-hours (five to seven week¬\ndays and from sign-on to seven Saturday and\nSunday) was devoted to Drama. Of this pro¬\nportion, half was Western Drama. Two-thirds\nof the total Drama programming during this\nperiod was either Western, Crime, or Action\nDrama. If all forms of Drama, Variety, and\nPopular Music are combined, nearly three-\nfourths of the total children-hours time is ac¬\ncounted for. These three types of program\ntake a larger proportion of the children-hours\nperiod than they do of any of the other time\nsegments.\nRedistribution of Segments of Mixed Programs\nDoes not Change the Total Program Picture\nIt is possible from the monitored records\nto analyze the content of the program classes\nwhich contain mixtures of program elements\n(Variety, Popular Music, Quiz, Stunts and\nContests) and to credit each of the individual\nelements to one or another of the basic pro¬\ngram classes. In general, this “dis-integra¬\ntive” analysis of the mixed program left un¬\nchanged the relative proportions of total pro¬\ngram time supplied by the several kinds of\nprograms. After the reassignment of these\nelements, Drama, Variety, Popular Music,\nQuiz, Stunt and Contest programs, Sports,\nPersonalities and Special Features still ac¬\ncount for 81 percent of total time as compared\n2"
}