{
  "id": "d1289-82",
  "text": "Appendix B\nNational Association of Educational Broadcasters\nMonitors' Instructions \" The Orange Study\nA. Cards.\n1. Fill out one card for each program segment. A segment may cover as much as several\nhours, or as little as one minute. Time each program to the minute, by the electric clock and\nenter the starting and finish times on the card.\n2. Make a separate card for each station break where there are announcements betwe_eg\nthe programs. (By “announcements\" we mean announcements on behalf of some commercial\nor non-commercial interest other than the station itself. Do not consider announcements to\ninclude the broadcast of station call letters, or promotional plugs for later shows.) A station\nbreak begins when one program ends; it ends when the succeeding program begins. Jo save\nyour ti^Td^ not bother recording the time when the station break begins (it will already be on\nthe preceding program card), nor when the station break ends (it will appear on the following\nprogram card). But be very careful to record and time all commercial and other “announce -\nments” (as defined above) in the station break.\n3. Number cards consecutively each day for each station. Begin the first day with 1 , the\nsecond day at “101”, and so on.\nB. Program information desired.\n1 Fill out each card completely. It is especially important to write an objective descrip¬\ntion of the content of the program on the back of the card. This means a complete report on\nthe material which constitutes the program. It also means a careful description of the form o\nthe program. Special instructions for certain program classes are given below, and special\nforms are provided for certain program classes. For all programs, however, give a complete\nreport on the program. In doing so, please avoid words like “bad”, “good”, “poor , etc. We\ndo not want you to write down your evaluation of the program. We do want objective informa¬\ntion about the program.\n2. Study the program classification definitions carefully. Do the same with the special in¬\nstructions given below. Study the special report forms provided for certain classes of pro¬\ngrams. When you monitor a program watch especially for the presence or absence of elements\nin the program which would tend to place it on one rather than another of the classifications,\naccording to these instructions and forms.\n3. Where a program naturally falls into several sub-divisions, each of which is completely\nself-contained and perhaps different in some important respect from the others, please report\neach subdivision on the back of the program card. Treat each of these subdivisions as if it\nwere a separate program, as far as all instructions are concerned. Use extra cards and spe-\ncial report forms freely, numbering them so that they may be associated (clipped) to the proper\n“master card”. .. , t ..\n4 Unless specifically provided for on the special report form, indicate on the face of the\nmaster card whether the program is all live or all film. Where the program is a mixture of\nboth kinds of material, please note the time when each was presented on the back of the master\ncard, or on the special report forms (as applicable).\n80"
}