{
  "id": "d1289-83",
  "text": "5. Special instructions for certain classes of programs:\nClass (1) NEWS\nUse special report form A. Clip it to the\nmaster card when filled out.\nClass (3) PUBLIC ISSUES\nUse special report form B. Clip it to the\nmaster card when filled out.\nClass (5) PUBLIC INSTITUTIONAL\nUse special report form C. Clip it as usual.\nClass (6) GENERAL INFORMATION\nUse special report form D. Clip it as usual.\nClass (8) DRAMA\nUse special report form E. Clip it as usual.\nIf you think it is “historical” we need evidence\nthat the intention is to give a serious treat¬\nment of historical events, for example, credits\nto professionalhistorians as advisers, refer¬\nences to source material, etc. or other indi¬\ncations of an attempt at authenticity. The re¬\nenactment of significant historical events or\nprominence given to known historical per sons\nare also significant in differentiating histori¬\ncal drama from mere “costume” romance\nthat happens to be dressed in the clothes of a\ncertain historical epoch.\nIf you think it is “romance”: since almost all\nmovies contain a “love interest” we need to\nhave evidence that the love intere st is primary.\nClass (9) DANCE\nGive names of dancers, titles of dance s; ilames\nof choreographers and composers. If there\nis more than one dance episode, record and\ntime each episode separately on the back of\nthe master card.\nClass (10) MUSIC\nNote the titles of musical works, the names of\ncomposers, and the names of the performers.\nWhere program presents a mixture of “seri¬\nous\", “light\", and “popular” music, time each\nselection and record the time on the back of\nthe master card, along with the other informa¬\ntion concerning this selection.\nClass (11) FINE ARTS\nRecord the names of artists and describe the\nartistics works fully which are presented.\nClass (12) VARIETY\nUse special report form F, Clip it as usual.\nIn timing episodes, you will be concerned with\nthe usual amount of business between the\n“numbers” or the acts.\nWe adopt the convention of beginning the epi¬\nsode with the first moment of actualperform-\nance and ending with the termination of the\nactual performance. Use some such designa-\ntion as “business” for the intervening periods\n81"
}