{
  "id": "d1289-84",
  "text": "of applause, comments by the MC, introduc¬\ntions, taking of bows, etc. This convention\nwill cause trouble only in the kind of informal\nshow in which there may be conversation, jok¬\ning, or even something like an interview pre¬\nceding or following the actual performance.\nWe will treat these simply as “business” un¬\nless they become a prominent feature of the\nprogram. Then they will be treated as epi¬\nsodes in their own right. Report only the num¬\nbers or acts with their times on Form F.\n“Business\" will be considered as taking up the\nremaining time.\nClass (13) PERSONALITIES\nIndicate full details as to the name of person\nconducting the interview( s), the name(s) of the\none(s) interviewed, and the topics discussed.\nIndicate the character and frequency of auto¬\nbiographical or other self-reference by par¬\nticipants. Indicate any emphasis on the per¬\nsonality, talents, preferences, and tastes, etc.\nof the participants. Give samples of dialogue.\nWhat is the nature of the audience aimed at\ninsofar as this may be inferred from the con¬\ntent of the program. Time each interview\n(where there is more than one) and enter all\nof this information on the back of the card.\nClass (14) QUIZ, STUNTS &\nCONTESTS\nIndicate the extent to which contests use (a)\nexperts and invited guests; (b) studio audi¬\nence; (c) the home audience via telephone.\nIndicate also the extent of the “amateur” ele¬\nment where this enters into program. Please\nespecially note the extent to which the pro¬\ngram contains elements similar to those in\nHOMEMAKING programs, such as instruc¬\ntional material (for cooking, decorating, etc.),\nshopping material (demonstration of products\nand services).\nClass (15) SPORTS\nMake plain on the back of master card the\nextent to which the program is broadcast of a\nsports event, as distinct from news about\nsports events. Please list topics covered in\nSPORTS NEWS programs so that time devoted\nto spectator sports news may be distinguished\nfrom that devoted to participant sports. Con¬\nsider whether films on fishing or yachting\nshould not be classed as programs on par¬\nticipant sports.\nClass (16) DOMESTIC\nAmong Domestic programs give special at¬\ntention to those in which there is a mixture of"
}