{
  "id": "d1289-85",
  "text": "entertainment (variety acts, quiz, stunts and\ncontests, personalities), news, instructional\nprograms specifically aimed at housewives\n(cooking, decorating, etc.) and shopping pro¬\ngrams (display of merchandise and services),\nPLEASE IDENTIFY each of these elements\nas it appears and record the time devoted to\neach element.\nClass (17) CHILDREN’S PROGRAMS\n(17\n(a))\nCHILDREN’S INFOR¬\nMATION AND IN¬\nSTRUCTION\nUse special report form D.\n(17\n(c))\nDRAMA\nUse special report form E.\n(17\n(d))\nTEEN-AGE VARIETY\nUse special report form F.\n(17\n(e))\nOTHER CHILDREN’S\nVARIETY\nUse special report form F.\n(17\n(*))\nQUIZ, STUNTS &\nCONTESTS\nIndicate the extent to which contests use (a)\nexperts and invited guests; (b) studio audi¬\nence; (c) the home audience via telephone.\nIndicate also the extent of the “amateur\" ele¬\nment where this enters into the program.\nIndicate the reasons why you class this as a\nchildren’s program.\n6. One fundamental rule: EVERY MINUTE OF PROGRAMMING ON EVERY STATION\nMUST BE WATCHED DURING THE SEVEN DAYS OF THE STUDY.\n7. Another fundamental rule: STRICT SCIENTIFIC OBJECTIVITY IS DESIRED AT EVERY\nSTEP OF THE STUDY. MONITORS WILL PLEASE PARK ALL PREJUDICES AND FAVORI¬\nTISM (if they have any) OUTSIDE THE MONITORING ROOM.\nC. Advertising material.\n1. Time all “announcements” and record the time in terms of minutes and seconds. Use\nthe stop watches and electric clock for this purpose. Do not guess. Record the nature of the\nannouncement, giving especially the name of the beneficiary (i.e. sponsor, product name, or\n“cause”--such as announcements on “Freedom is Everybody’s Business”).\n2. Note the presence of “inescapable” advertising matter in the form of products or signs\ndisplayed before the camera while the program material itself is being presented. Record on\nthe back ofthe master card this information, including the time when such matter is before the\ncamera.\n3. Make every effort to time all commercial advertisements, or displays of merchandise.\nWhere such material is so closely interspersed with the program material as to defeat your\nefforts, call the supervisor’s attention at once to this fact and record your experience on the\nback of the card. Mark the front of the master card in large letters “U. T.” (untimable).\nD. General. Use your supervisor as much as you feel like for advice or help. Call for relief\nfrequently--do not stay at one set for more than two hours, as a general rule. And thank you\nin advance for your cooperation and conscientiousness.\n83"
}