{
  "id": "d1289-9",
  "text": "Chapter II\nLos Angeles TV Programming as a Whole\nAnalysis of Los Angeles TV programming\nfalls into two sections: (a) A statement of the\namount of time devoted to programming; (b)\nExamination of the amount of each kind of pro¬\ngramming. This chapter therefore begins\nwith the question,\nHow Much TV Programming is Available\nto Los Angeles Viewers?\nThere was a total of 551 hours, 49 minutes\nof TV programming made available to Los\nAngeles Viewers in the study week from the\nseven Los Angeles stations. The signal from\nthe San Diego Station KFMB was not always\nintelligible at the study location; nevertheless\nthis station was monitored for a total of 73\nhours and 12 minutes. Therefore if one is\nconcerned with programs regardless of the\ncommunity of origination, the inclusion of\nKFMB raises the total program time to a total\nof 625 hours, 1 minute for eight stations.\nThis is an average of almost 80 hours per\nweek per station, or the equivalent of about\n11 hours per day per station.\nDuring the study week two of the seven Los\nAngeles stations (KTLA and KTTV) broad¬\ncast an abnormal schedule because of “spe¬\ncial event” telecasts of the search for a child\nkidnapped in Buena Park, a Los Angeles sub¬\nurb. There was a total of 52 hours, 11 min¬\nutes of “special event” telecasts on this sub¬\nject. To approximate the usual weekly sched¬\nule for TV programs available to Los Angeles\nviewers, this amount of time might be sub¬\ntracted from the totals summarized above. If\nthis be done, it appears that the seven Los\nAngeles stations, ex Buena Park, telecast 499\nhours, 38 minutes, and the eight stations, in¬\ncluding KFMB, telecast 572 hours, 50 minutes.\nThe daily average, ex Buena Park, therefore,\nis about 10 hours.\nFor all stations combined, the amount of\nTV programming on the days Monday through\nFriday is substantially heavier than on Satur¬\nday and Sunday, though the opposite is true\nfor two stations (KTLA and KFMB) and two\nother stations maintain about the same num¬\nber of hours throughout the week. One sta¬\ntion, KFI-TV, operated a five-day schedule\nbecause of a protracted strike. Table 1 pre¬\nsents this information in detail. Further de¬\ntail on the amount of time on the air is pre¬\nsented in Appendix A, Table 1. But for the\ngeneral reader it is now in order to raise the\nsecond question.\nHow Much of Each Kind of TV Programming\nis Available to Los Angeles Viewers?\nThe answer to this question may be pre¬\nsented in various ways. First, we may con¬\nsider the results of the monitoring study when\nthe tabulation is of programs per se. In this\nstyle the most general summary will deal\nwith the week as a whole for all stations com¬\nbined. Chapter III presents a more specific\nanalysis in terms of parts of the week, seg¬\nments of the day, and particular stations.\nSecondly, we may observe the results of anal¬\nysis which reflects the distribution of the\ncomponent elements in heterogeneous pro¬\ngram types such as Variety and Quiz, Stunt\nand Contest programs. This too appears in\nChapter III.\nIn its most general terms, the primary\nanalysis covers all programs monitored in¬\ncluding those from KFMB, San Diego, and the\n“special event” telecasts concerning the Buena\nPark case.1 Such a view is offered in Table\n2. The largest single class of programs was\n1. Exclusion of the Buena Park telecasts would\nraise the percentage of totalprogram time of all classes\nof programs (other than Special Events and Features)\nproportionately. Thus Drama would be 27.9 instead of\n25.6 percent, Information, 2.9 instead of 2.6 percent, etc.\n4"
}