{
  "id": "d298-113",
  "text": "The Management Conference program as tentatively-\napproved by the committee is now being organized\nand effort is being made to secure top level talent to\nmake up the various panels. It will be a fast running\nprogram consisting for the most part of panel dis¬\ncussions. Ample opportunity for discussion by the\nmembers follows the panels. The two luncheon speak¬\ners will be men who have a real message for broad¬\ncasters.\nIt is hoped that within the next two or three weeks\na final announcement can be made respecting the\nprograms and the names of those who will participate.\nThe program for the Engineering Conference is\nbeing arranged under the direction of Royal V. How¬\nard, NAB engineering director, and Neal McNaughton,\nassistant director of engineering, with the assistance\nof the Engineering Executive Committee. Already they\nhave received commitments from outstanding figures\nin the electronics field and a program of interest to\nengineers of member stations is assured.\nBoard Fixes Registration Fee. The Board fixed the\nregistration fee for the Management Conference at\n$30.00 per person, to include two luncheons and the\nbanquet; and the Engineering Conference at $15.00\nper person to include two luncheons.\nThe banquet show gives promise this year of being\nthe highest quality presentation yet to be given at\nany NAB Convention. An announcement regarding\nthis will be forthcoming as plans are perfected.\nPre-registration and Hotel Reservation. The pre¬\nregistration and hotel reservation forms are now in\nthe hands of the printer and will be mailed the latter\npart of this week. The hotel reservation forms will\nindicate the hotels in which NAB has optioned rooms\nand will give a complete list of other hotels in Los\nAngeles where arrangements for accommodations may\nbe made direct by any who desires to do so.\nAs in previous years, registration will be limited\nstrictly to the personnel of NAB active and associate\nmembers and to organizations which are not eligible\nto NAB membership, such as advertisers, agencies, etc.\nPre-registration is this year a prerequisite to a hotel\nreservation. In other words, the request for a hotel\nreservation must be accompanied by the registration\nfee, except for wives and members of the family and\nfor necessary exhibit attendants. The cancellation of\nthe registration will carry with it the cancellation\nof the hotel reservation.\nIn future issues of the REPORTS and Special Bulle¬\ntins further detailed information with reference to the\nplans will be given.\nExhibitors Active. Indicating an interesting and\nattractive display of equipment and service materials,\ntwenty-nine NAB Associate Members have already\nsigned up for exhibit space at the convention. Addi¬\ntionally, many inquiries are on hand. A list of those\nwho already have signed up follows:\nTranscription Companies\nAssociated Program Service, Inc.\nCommodore Productions and Artists\nHarry S. Goodman Radio Productions\nLang-Worth Feature Programs, Inc.\nC. P. MacGregor\nStandard Radio Transcription Services, Inc.\nIN THE OFFING\n14th District Meeting\nMar. 22-23\nBrown Palace Hotel\nDenver, Colo.\n26th Annual Convention\nManagement Conference\nMay 17, 18\nBiltmore Hotel\nEngineering Conference\nMay 20, 21\nLos Angeles, Calif.\nWorld Broadcasting System, Inc.\nFrederic W. Ziv Company\nEquipment Manufacturers\nAmperex Electronic Corporation\nAndrew Company\nFairchild Camera and Instrument Corp.\nMagnecord, Incorporated\nPresto Recording Corporation\nRangertone, Inc.\nHermon Hosmer Scott, Inc.\nWincharger Corporation\nHeavy Equipment Manufacturers\nCollins Radio Company\nFederal Telephone & Radio Corporation\nGates Radio Company\nGeneral Electric Company\nGraybar Electric Company, Inc.\nRadio Corporation of America\nRaytheon Manufacturing Company\nWestern Electric Company, Inc.\nWestinghouse Electric Corporation\nFCC Service\nBroadcast Service Bureau, Inc.\nOthers\nBroadcast Music, Inc.\nBroadcast Measurement Bureau, Inc.\nTrade Paper\nThe Advertiser\nBroadcasters Asked to Criticize New\nForms Proposed by Commission\nThe Broadcasting Committee of the Advisory Coun¬\ncil on Federal Reports last week invited broadcasters\nto criticize new FCC application forms promulgated\nlast fall and used since then on a trial basis, which\nare about to go to press.\nThe invitation came to the broadcasting industry by\nway of the U. S. Bureau of the Budget, which super¬\nvises issuance of forms by Federal agencies, and the\nBroadcasting Committee of the Advisory Council on\nFederal Reports. This committee, of which Ben\nStrouse, manager of WWDC, Washington, is chairman,\nhas provided the Bureau of the Budget with tech¬\nnical assistance in the review of the forms proposed\nto be used by FCC. As chairman of the Committee,\nMr. Strouse recently succeeded Wayne Coy who is now\nchairman of the FCC.\nIt was the belief of the Committee at its most recent\nmeeting that while its membership is generally rep¬\nresentative of the industry, there is no substitute for\nactual experience in having filled out these application\n(Continued on next page)\nMARCH 8, 1948-183"
}