{
  "id": "d298-115",
  "text": "be a part of the Public Relations Department of the\nAssociation in Washington.\nWidely known as a broadcaster before joining the\nManila Evening News Washington staff, Miss Griffith\nhas written and produced programs on Washington\nradio stations since the war. She produced a series\nof television programs for WNBW, a 12-weeks series\non WARL, Arlington, and a commentary program on\nWINX for a year.\nDuring the war, Miss Griffith served in the Women’s '\nArmy Corps, enlisting as a private in 1942 and leaving\nactive duty as a captain in 1946. Stationed at the\nPentagon, she worked in public relations on the staff\nof Col. Oveta Culp Hobby before going overseas as\nReport on Internships Is Mailed\nRadio News Internships for 1948, a booklet con¬\ntaining the third report on the internships project\nof the Council on Radio Journalism, Inc., has been\nmailed to NAB members. Accompanied by a letter\nfrom NAB President Justin Miller, the booklet\ncontains reports from the internes and the sta¬\ntions in which they served.\nchief of the women’s section, public relations office, in\nGen. Douglas MacArthur’s headquarters.\nShe was awarded the Bronze Star for her work in\nestablishing this section, and for service in Australia,\nNew Guinea, the Netherlands East Indies, the Philip¬\npines, and Japan. After the war, she was selected as\none of the officers making the round-the-world tour of\nthe War Department Special Mission.\nPrior to the war, Miss Griffith had served as assist¬\nant to the manager of the Community Service depart¬\nment of WLS, Chicago, for four years. She was em¬\nployed by WHO, Des Moines, Iowa, in the same ca¬\npacity, for another four-year period.\nA graduate of DePauw University, Greencastle, Ind.,\nshe makes her home at 3446 Connecticut Avenue in\nWashington.\nLong-Term “Voice of America”\nPlans to Be Studied\nLong-range policies for international broadcasting\nwill be studied by a special sub-committee of the State\nDepartment’s Radio Advisory Committee, it was de¬\ncided Friday (5) at a meeting of the full committee\nin New York. Judge Justin Miller, NAB president,\nwill serve as chairman of the sub-committee.\nThe advisory group recommended that the “Voice of\nAmerica” be strengthened so that it will equal the in¬\nternational broadcasting efforts of any other country.\nTwo-Way Line Licks Bad Weather\nThe Minneapolis Advertising Club refused to be\ndaunted by bad weather last week. When NAB Re¬\nsearch Director Kenneth Baker was grounded by a\nzero ceiling enroute to address the group, the club’s\nradio members quickly applied tricks of their trade.\nNot only did Dr. Baker address the group by direct\nline from Washington; he carried on discussion with\nclub members after his talk via a two-way circuit.\n► Broadcast Advertising_ _reports\nFree Time Deals Scored by NAB\nThe radio industry has recently received many re¬\nquests for free time by commercial organizations.\nOne of them, The Washington State Fruit Commis¬\nsion, was reported by NAB member stations to be a\n“well organized, well financed organization that has\nspent hundreds of thousands of dollars in every media\nexcept radio, yet has always taken the position that as\na matter of public service, the stations in the North¬\nwest should throw their doors open to market their\nsurplus crops.”\nThe fruit commission representatives sent stations\n100-word commercial announcements to publicize a cash\nprize contest about their fruit. Announcements were\nmarked for the attention of station news editors.\nNAB Small Market Stations Division sent the fol¬\nlowing letter to Washington State Fruit Commission,\nYakima, Washington:\n“NAB member stations have forwarded to us\ncopies of 100-word commercial announcements, in\nbehalf of Washington State Fruit Commission, which\nwere requested to be broadcast FREE.\n“As perhaps you know, the radio stations of Wash¬\nington State, and throughout the nation, broadcast\nhundreds of thousands of announcements (about\n2,600,000 annually) and approximately 34% of the\ndaily program time free, in behalf of such charitable\npurposes and organizations as the American Red\nCross, U. S. Savings Bonds, Our American Heritage,\nFight Tuberculosis, The Crisis in Our Schools, Anti-\nGroup Prejudice, Hospital Nurses, World Fpod\nEmergency, National Safety Campaign, Community\nChest, U. S. Army, Navy, Marine Recruiting, and\nmany other national, regional, and community cam¬\npaigns.\n“In one campaign alone, Veterans Administration,\nradio donated $7,500,000 worth of free time and\ntalent. A total of 8,500,000,000 (8y2 billion) listener\nimpressions was tabulated by Veterans Administra¬\ntion for their radio programs, during the fiscal year\n1947. Today, we have more than 2,000 AM and FM\nstations throughout the nation. Most of them are\nbroadcasting the VA series, ‘Here’s to Veterans.’\n“The broadcasting industry has given (and will\ncontinue to give) enormously of its time, talent and\nfacilities. However, the broadcasting industry is\nopposed to any efforts to obtain free use of station\nfacilities for commercial advantage.\n“An NAB resolution, unanimously adopted, reads\nas follows:\n‘The maintenance and protection of the American\nsystem of broadcasting is predicated on the observ¬\nance of sound business practices and high standards\nof ethics—both on the part of the stations and of\nthose who would use its facilities.\n‘The NAB regards any effort on the part of any\norganization or interest which seeks commercial ad¬\nvantage through the free use of a station’s facilities\n(Continued on next page)\nMARCH 8, 1948-185"
}