{
  "id": "d298-116",
  "text": "as being unsound, unwarranted and contrary to the\nbest interest of the industry.\n‘It is the will of this association, therefore, that\nall such requests should be denied by its members\nand discouraged by every other means at their dis¬\nposal.’\n“We invite you to use the medium of radio on the\nbasis of stations’ quoted card rates. In that event,\nwe are sure you will find that stations are willing\nto cooperate 100 per cent, and that the results of\nradio advertising, wisely and efficiently applied, will\nmore than justify the expenditure.\n“Your local radio stations’ representatives will\ngladly discuss your advertising plans and methods\nfor using radio effectively.”\nA similar letter was sent to National Association\nof Margarine Manufacturers (anti-margarine legisla¬\ntion), The Petroleum Industry (shortage of fuel oil\nwhere commercial angles are involved*) and others.\n* Not to be confused, with Advertising Council material.\n► Programming_ _reports\nContinued Radio Aid for Freedom Train\nAssured As FCC Head Praises Efforts\nCongratulations to American broadcasters on the\n“major role” they have played in making the Freedom\nTrain’s tour a success, and assurance of continued co¬\noperation by the broadcasting industry, were contained\nin a recent exchange of letters between FCC Chairman\nWayne Coy and NAB President Justin Miller.\n“American broadcasters may well be proud of the\nmajor role they have played in welcoming the Freedom\nTrain and assuring that the arrival of this Nation’s\nmost treasured documents would be known to all their\nlisteners,” Mr. Coy wrote.\nJudge Miller had written to the FCC Chairman:\n“The broadcasters of America, during the past year,\nhave given willingly of their time and talent to spread\nthe good work of the American Heritage Foundation\nand the Freedom Train far beyond the necessarily\nlimited stops of the Train itself. In this work, the\ninstantaneous character of radio has added -wings to\nthe Freedom Train, taking its message into com¬\nmunities not being visited, and encouraging Rededi¬\ncation Weeks in these communities as well. . . .\n“Broadcasters throughout the nation will continue\nto bring this message to all Americans, in the effort\nto arouse them to renewed consciousness of their\ngreat heritage and their rights, as well as their duties\nas active and intelligent citizens.”\nThe American Heritage Foundation, which sponsors\nthe tour of the Freedom Train, has asked all radio\nstations to join in a good citizenship campaign for\ntheir communities as part of the national observance\nof 1948 as a Year of Rededication by all Americans to\ntheir heritage of freedom.\nA radio fact sheet and broadcast material on the\nGOOD CITIZENSHIP point—“Taxation WITH Rep¬\nresentation”—has been mailed to all radio stations by\nthe Foundation’s radio committee for use during the\nmonth of March.\nThis is the second of the nine basic points of GOOD\nCITIZENSHIP. Material on the first point—“The\nHome and the Family”—was supplied to stations dur¬\ning the mohth of February. Succeeding months’ ma¬\nterial will be:\nApril—Tolerance.\nMay—The Duty to Bear Arms.\nJune—Respect for Law\nJuly—Community Responsibility.\nAugust—Public Education.\nSeptember—Our Courts and Jury Duty.\nOctober—The Right and Duty to Vote.\nThe American Heritage Foundation is an non¬\npartisan, non-political citizens’ organization headed\nby Winthrop W. Aldrich, chairman; William Green,\nPhilip Murray and Robert G. Sproul, vice chairmen;\nand Thomas D’A Brophy, president.\nGardeners Asked to Help Food Production\nAmerica’s home gardeners are being asked by the\nGovernment to help make 1948 another year of record\nfood production—20 million Freedom Gardens is the\ngoal for this year. With so much of the world suffer¬\ning from hunger and malnutrition, and with the pro¬\nductive facilities of war-ravished lands only partially\nrestored,'Americans are being asked to share their\nrelative abundance of, food with less fortunate peoples\nabroad. Grain is the principal food needed for relief\npurposes, and although home gardeners do not grow\nwheat, rice or other cereals, they can produce food\nwhich will take the pressure off items needed for ex¬\nport and make them more readily available.\nDuring the war years, “Victory Gardeners” growing\nover 18 million gardens each year supplemented our\nnational food supplies to the extent of millions of tons.\nIn addition to augmenting the world’s supply of food,\ngarden produce can greatly improve the American diet,\nespecially this year when we are asked to eat less\nwheat products and less meat. Gardening also pro¬\nvides helpful recreation for every member of the family\nand cuts down the family’s food budget.\nThis year’s Freedom Garden program, therefore,\nadds up to the following: Plan and/or plant a Freedom\nGarden now to (1) increase, the national food supply,\ntaking pressure off food needed for export; (2) raise\nour nutritional standards by prpviding more fresh and\npreserved foods for daily consumption; (3) promote\nfamily health and recreation through gardening;\n(4) help reduce cost of living.\nIn general, the -action program outlined above will\napply to most parts of the country at this time. How¬\never, station managers interested in prompting Free¬\ndom Gardens will want to take into account regional\nvariations in the program. For the most accurate and\nup-to-date information regarding the Freedom Garden\nproject ip their communities, station managers are\nurged to contact their local garden committee or\nCounty Agricultural Agents.\nAiring of Income Tax Reminder Requested\nSeveral million new tax-payers who have never filed\na tax return before will have to do so for the first\n(Continued on next page)\nMARCH 8, 1948-186"
}