{
  "id": "d298-124",
  "text": "1450 KC.\nNEW—Radio Corporation of Arizona, Inc., Phoenix, Ariz.\n(P. O. Box 1056, Phoenix, Ariz.) —Construction permit for\na new standard broadcast station to be operated on 1450 kc.,\npower of 250 watts and unlimited hours of operation.\nKYOU—Merbco Broadcasting Co., Greeley, Colo.—Modi¬\nfication of construction permit (B5-P-5196, which authorized\na new standard broadcast station) to change type of trans¬\nmitter, for approval of antenna, transmitter and studio loca¬\ntions as Off 25th St., between 5th and 6th Avenues, Greeley,\nColo.\nCharles Wilbur Lamar, Jr., Morgan City, La.—Construc¬\ntion permit for a new standard broadcast station to be\noperated on 980 kc., power of 250 watts and unlimited hours\nof Operation. AMENDED to change frequency from 980\nto 1450 kc. and power from 250 watts to 100 watts.\nWBUY—Davidson County Broadcasting Co., Lexington,\nN. C. (Ohiaf G. Hilton and Greeley N. Hilton)—License to\nedver construction permit (BP-5715) which authorized\nchange frequency, change hours of operation, increase power\nand make changes in transmitting equipment.\n1460 KC.\nChanute Broadcasting Co,, Chanute, Kans. (Galen O. Gil¬\nbert, H. Edward Walker, Phil Crenshaw, and George\nRountree, a partnership) —Construction permit for a new\nstandard broadcast station to be operated on 940 kc., power\nof 250 watts and daytime hours of operation. AMENDED\nto change frequency from 940 to 1460 kc., change type trans¬\nmitter and change transmitter location from “to be deter¬\nmined” Chanute, Kans., to East 14th St., .6 mile, east of\nintersection with Malcolm St., Chanute, Kans., and change\nstudio location from To be determined Chanute, Kans., to\n104^-106% West Main, Chanute, Kans.\n1490 KC.\nWHOC—William Howard Cole, Philadelphia, Miss.—Modi¬\nfication of construction permit (BP-6299, which authorized\na new standard broadcast station) to make changes in\ntransmitting equipment, for approval of antenna, trans¬\nmitter and studio locations at Highways 15 and 16, exten¬\nsion of Beacon Street, Philadelphia, Miss.\nWHAV—The Haverhill Gazette Co., Haverhill, Mass.—\nAuthority to determine operating power by direct measure¬\nment of antenna power.\nWSAP—Portsmouth Radio Corp., Portsmouth, Va.—Modi¬\nfication of construction permit (B2-P-4357, as modified,\nwhich authorized to make changes in vertical antenna) for\nextension of completion date.\nAM—Application Returned\nKentucky Mountain Broadcasting Co., Prestonsburg, Ky.\n(E. P. Hill, Jr., and D. C. Stephens, a partnership) ( P. O.\nD. C. Stephens, Big Sandy Dental Laboratory, Prestonsburg,\nKy.) —Construction permit for a new standard broadcast\nstation to be operated on 900 kc, power of 1 KW and daytime\nhours of operation. RETURNED February 20, 1948, Incom¬\nplete,\nAM—Applications Dismissed\nKPBX—KPBX Broadcasting Co., Beaumont, Tex.—Modi¬\nfication of license to change hours of operation from daytime\nto unlimited, with power of 250 watts night, 1 KW day.\nDISMISSED February 20, 1948,\nKFXO—Spokane Broadcasting Corp., Spokane, Wash.—\nRelinquishment of control of licensee corporation by Arthur\nL. Smith thru increase of capital stock to 300,000 shares.\n(1230 k&A—DISMISSED February 27, 1948.\nAM—Applications Tendered for Filing\n550 KC.\nKCRS—Clarence Jr. and Ruth Scharbauer, Midland, Texas\n(Ruth Scharbauer and Clarence Scharbauer, Jr.)—Modifica-\nMARCH 8, 1948-194\ntion of construction permit to modify) the directional antenna\nsystem.\n570 KC.\nWFAA—A. H. Belo Corp., Dallas, Texas—Construction\npermit to install a new transmitter, change transmitter\nlocation and antenna system of 570 kc. operation, install\ndirectional antenna for daytime use and make changes in\nthe nighttime directional antenna using 5 KW power and\nSharing time with WBAP.\nWBAP—Carter Publications, Inc., Ft. Worth, Texas—\nConstruction permit - to install a new transmitter, change\nthe transmitter location and antenna system of 570 kc.\noperation, and install a directional antenna for daytime\nuse, using 5 KW power and sharing time with WFAA.\n580 KC.\nKSWS—McEvoy Broadcasting Co., Roswell, N. Mex.—\nConstruction permit to change frequency from 1230 to 580\nkc., power from 250 watts to 1 KW night, 5 KW day; install\na new transmitter and directional antenna for night use and\nchange the transmitter location.\n670 KC.\nNEW—Suburban Broadcasting Co., Pacific Palisades,\nCalif. (Howard Blake)—Construction permit for a new\nstandard broadcast station to be operated on 670 kc., power\nof 1 KW, and daytime hours of operation.\n800 KC.\nWMBM—Biscayne Broadcasting Cm, Inc., Miami Beach,\nFla.—Consent to transfer of stock owned by Kenneth S.\nKeyes in licensee corporation, to Julius Martinus Vroon,\nLucile T. Keyes, Kenneth S. Keyes, Jr., Lela Roberta Rymer\nKeyes, Lonnie Allen Morris, Ida Akers Morris, Herman John\nLeader, Brahan Lamar Mitchell and Dr. Augustin Batista.\n900 KC.\nNEW—Rollins Broadcasting, Inc., Georgetown, Dela.—\nConstruction permit for a new standard broadcast station\nto be operated on 900 kc„ power of 1 KW, and daytime\nhours of pperation with directional antenna.\nNEW—Essie Binkley West, Riverside, Calif.—Construc¬\ntion permit for a new standard broadcast station to be\noperated on 900 kc., power of 1 KW, and daytime hours\nof operation with directional antenna.\n930 KC.\nWEOL—Elyria-Lorain Broadcasting Co., Elyria, Ohio—\nModification of construction permit to make changes in\ndirectional antenna, to accommodate FM antenna on tower\n#2, and change the proposed transmitter location, using\npower of 1 KW, and directional antenna day and night.\nNEW—Valley Broadcasting Corp., Holyoke, Mass.—Con¬\nstruction permit for a new standard broadcast station to be\noperated On 930 kc., power of 500 watts, and daytime hours\nof operation-,\n970 KC.\nKNEB—Platte Valley Broadcasting Corp., Scottsbluff,\nNebr.—Modification of license to increase power from 500\nwatts day to 1 KW daytime hours.\nWEBR, Inc., Buffalo, N. Y.—Modification of construction\npermit to make changes in the directional antenna.\n980 KC.\nWHWL—Radio Anthracite, Inc., Nanticoke, Pa.—Con¬\nstruction permit to change hours of operation from daytime\nto unlimited, frequency from 730 kc. to 980 kc., power from\n1 KW day to 500 watts night, 1 KW day; install a new\ntransmitter and change the transmitter location and install\ndirectional antenna for night use.\n1050 KC.\nNEW—The Oil City Broadcasting Co., Electra, Texas (a\npartnership composed of C. C. Elkins, Jr., and Bill Frank\n(Continued on next page)"
}