{
  "id": "d298-13",
  "text": "ADDITIONAL VIEWS OF COMMISSIONER E. M* WEBSTER\nCorr_c-£t£d\nI adopt the majority opinion and file the following additional\nviews. In my opinion, the report and attached separate views of Com¬\nmissioner Jones still leaves a licensee in a-quandary and a state of con¬\nfusion in that he must follow with his own interpretation of an involved\nacademic legal treatise to determine what he can or cannot do in his day-\nto-day operation. He is entitled to know from the Commission just that—\n\"what he can or cannot do\"—in as concise and unequivocal language as\npossible*\nThe issue is simply stated: \"Can a licensee of a broadcasting\nstation be an advocate over his own station?\"\nAt the risk of oversimplification, but in the interest of the\nlicensee, I consider the answer to this question to be as follows:\n1. ' Freedom of speech over the radio is not at issue.\nThe right or privilege of access to the radio microphone is\nan issue.\n2, No individual has the right of access to a radio micro¬\nphone (except for such rights as may be conferred1 by Section\n315 of the Communications Act - \"Facilities For Candidates For\nPublic Office\"). Each individual licensee has the privilege\nof and responsibility for determining the particular persons\nor groups to be granted access to the microphone, which in¬\ncludes denial of access, and the specific program material to\nbe broadcast over his facilities.\n3o This privilege and responsibility is not unrestricted,\nhowever, but represents a sacred trust which must be exercised\nin a manner consistent with the basic policy of the Communi¬\ncations Act that broadcasting stations be licensed to serve\nthe interests of the public at large rather than the personal\nor private interests of the licensee,\n4* The public interest requires that the listening public\nsecure a reasonable opportunity to hear differing and opposing\npositions on the controversial public issues of interest and\nimportance in the community. Where a licensee affords time\nover his facilities for the expression of any one opinion on\nsuch issues, he is under an obligation to insure that opposing\npoints of view will also be presented or at least that a\nreasonable opportunity be afforded for the presentation of\nsuch views*\n5. The licensee is free to exercise his privilege of\nselection of persons to be given access to the microphone to\npresent his own views of controversial public issues or to\nselect persons to broadcast over his facilities whom he knows"
}