{
  "id": "d298-135",
  "text": "EDUCATION ON THE AIR\n98\nthe conception of public interest set up by the Communications\nAct as the criterion of regulation.” (8 F.C.C. 339-340)\nThe American Civil Liberties Union is in whole-hearted\nagreement with this position. In other words, to answer the\nquestion which is our topic, radio should not have an editorial\npolicy in controversial areas. What is to be avoided is the\nbroadcaster’s using his facilities to take one-sided attitudes to¬\nward controversial issues, without giving comparable time to\nother points of view.\nIt is important to keep in mind, however, that the May¬\nflower policy should be related to situations substantially similar\nto the facts and practices that faced the Commission in that\nparticular case, and, like good lawyers, we should be careful\nnot to stretch this statement to cover factual situations unrelated\nto the facts which gave them birth.\nThis attitude, however, neither prevents radio from playing\nan integral and important part in the public discussion of con¬\ntroversial issues, nor from assuming non-controversial civic\nresponsibilities of sizeable importance.\nThe distinction between “controversial” and “non-contro¬\nversial” programming is, of course, sometimes quite blurred.\nAs in many distinctions, basic to various fields of law, the dis¬\ntinction does not center over a sharp dividing line, with given\nfacts clearly on one side or the other. Instead, the dividing\npoint is a “twilight zone” where a classification in either direc¬\ntion is arguable.\nA beer advertisement is “controversial” to a prohibitionist,\nthough most of us would probably place it in the category of\n“non-controversial.” Similarly, a religious service strikes an\natheist as “controversial” though most of us would think other¬\nwise. On the other hand, I’m certain we could readily imagine\nnews commentaries which would strike us as being quite one¬\nsided on what we felt was a controversial issue but which the\ncommentator might feel was almost the gospel truth, and hence,\nnot controversial. Here, we cannot hope to spell out definitions\nor standards which will automatically fix the classifications for us.\nWhat we can hope for, however—and demand—is that the\nbroadcaster be constantly aware that he has no right to ignore\nany point of view while promoting a contrary one held by\nsubstantial elements of the public. If he is willing to operate\non that principle, I think he will be able to follow the May¬\nflower decision without too much trouble."
}