{
  "id": "d298-136",
  "text": "SOCIAL RESPONSIBILITY OF RADIO 99\nIt appears that some broadcasters have taken shelter under\nthe supposed meaning of the Mayflower decision to avoid pub¬\nlic responsibility. The mere fact that in the middle, between\nthe one extreme of the charitable enterprise and the promotion\nof a political candidacy, there is a twilight zone is no excuse for\nshirking public responsibility. There are many such twilight\nzones j e.g., in due process of law, interstate commerce, unreas¬\nonable restraint of trade, negligence. The responsibility to the\ncharitable undertaking, to civic, educational and social better¬\nment is clear. The broadcaster may join in the demand for\nbetter health facilities, for pure water, for sanitation. In any\nevent, the worst that can happen in case the broadcaster unwit¬\ntingly steps into a basically controversial issue is that he will\nhave to afford equal facilities for the opposing point of view.\nThe American Civil Liberties Union believes that broad¬\ncasters should—and it urges that they do—participate actively\nin community affairs, both by making their facilities available\nto the impartial presentation of opposing points of view on con¬\ntroversial issues and by lending their support, as a public ser¬\nvice, to non-controversial matters of public importance, such as\nsupport of community civic, educational, and charitable activities.\nEven though we say radio should not have an editorial\npolicy as regards “controversial” matters, we insist that jt should\noperate on the widest scope possible in non-controversial areas.\nRadio will not be “editorializing” or violating the law if it takes\non added social responsibilities, and shows willingness to lend\nits whole-hearted support to the civic and educational problems\nthat beset almost every American community. I know each of\nyou could readily think of specific ways in which radio could\nhelp out in this respect. The Union has always urged that radio\nseize this opportunity and make the most of it. Nothing in the\nMayflower principle conflicts with this urging.\nThe important governing principle is that the role of radio\nbe impartial j not that it be inactive or unconcerned. Here,\npublic reliance for a balanced presentation of ideas must largely\nrest on the broadcaster’s awareness of his public trust and his\nwillingness to execute it in high good faith.\nThus construing the Mayflower decision, the broadcaster\ncan avoid use of his public trust as a mouth-organ for his own\npolitical views, or its use by any dominant economic source, can\noffer a full and impartial presentation of controversial issues\nand can stand actively in the ranks of the forces for public"
}