{
  "id": "d298-138",
  "text": "SOCIAL RESPONSIBILITY OF RADIO IOI\nThe Communications Act requires that equal opportunity\nbe afforded all qualified candidates for a public office. In other\nwords, if a station offers its facilities to one candidate without\ncharge, it must extend the same courtesy to his opponent. If\ntime is sold, then equal conditions as to price, available time,\netc., must prevail. Of course, the broadcaster has a perfect right\nto refuse all candidates, if he so desires. This, too, would com¬\nprise equal treatment. The station involved in the before-\nmentioned case allegedly endorsed a political candidate and\nbroadcast editorials on his behalf, but failed to offer equal\nopportunity to his opponent.\nUnfortunately, few people remember the actual circum¬\nstances of the Mayflower case. There has been a widespread\nmisunderstanding as a result of the inference that can be drawn\nfrom one of the conclusions in the FCC’s decision in this case.\nThat is the statement to the effect that “the broadcaster cannot\nbe an advocate.”\nSome broadcasters and many members of the public have\ninterpreted this statement to mean that stations cannot advocate\nanything. Thus, some broadcasters are loathe to take part in\nthe promotion of vital community projects, and certain minority\ngroups use the Mayflower inference in the spirit of sophistry!\nPersonally, I have never felt that the Commission intended\nto thwart judicious use of their own facilities by public-spirited\nbroadcasters. However, I believe the Commission would do\nbroadcasting a great service by clarifying this point. Last Feb¬\nruary, the broadcasters of the 14th District, in convention at\nSalt Lake City, unanimously endorsed a resolution asking that\nsuch clarification be made. The resolution closed as follows:\n“That the broadcasters . .. petition ... to bring about a revision\nof the said inference in the Mayflower case and establish the\nrights of broadcasters to present views under their own spon¬\nsorship in keeping with the Constitutional guarantees of free¬\ndom of speech.”\nI think some of the people who fear exercise of the broad¬\ncaster’s prerogative to editorialize do so because they confuse\nthe term to mean “assume a biased political attitude.” Webster\ndefines editorial as “an article given featured position and sanc¬\ntioned by the owner of the publication.” There are hundreds\nof individual community needs that can be met by a well\ndefined editorial policy on the part of the local station. I think"
}