{
  "id": "d298-141",
  "text": "i04\nEDUCATION ON THE AIR\nthat right are in violation of the first amendment to the\nConstitution.\nRadio as an industry has been in the hands of people who\nhave earned public trust by the exemplary fashion in which\nthey have served the public. Hence, broadcasters are qualified\nI to assume the responsibilities inherent to editorial use of radio.\nWhile it is, of course, not mandatory that broadcasters pre¬\nsent editorials, they should be encouraged to do so in the inter¬\nest of the broader field of public service.\nBroadcasters should fashion a code of ethics, covering the\nI use of their facilities for editorials, that will assure high stand-\n| ards of service. This should be preferably on a voluntary basis;\nI not by federal mandate.\nIn its own interest as well as that of the broadcasters and the\npublic, the FCC should rescind its statement in the Mayflower\n1 case that “radio must not be an advocate.”\nROBERT D. LEIGH3\nDuring its nearly three years of existence, the Com¬\nmission on Freedom of the Press has concerned itself directly\nwith this particular problem in its more general aspect: that is,\nthe present machinery and policy for handling controversial\ndiscussion in the five major mass media. I shall attempt to\nsummarize the Commission’s conclusions by stating four or\nfive propositions basic to an analysis of the problem.\nThe propositions are greatly condensed from the Commis¬\nsion’s general report, “A Free and Responsible Press.” This\nreport, in turn, is a summary or condensation of six longer and\nmore detailed reports, only three of which have yet appeared\nin published form. One of the three is a report to the Com¬\nmission on the American radio, specifically that by Llewellyn\nWhite of the Commission staff. Two of the reports not yet\noff the press form an equally important background for the\nCommission’s conclusions in this area. They are Dr. Hocking’s\nreport on the background of principle and theory for freedom of\nthe press, and Zechariah Chafee’s two-volume analysis of the\nrelation of government to mass communication. My condensed\nstatement draws from these three special reports as well as\nfrom the summary report. Behind each one of the propositions,\ntherefore, there are many pages of exposition in the Commis-\n8 Commission on Freedom of the Press, New York."
}