{
  "id": "d298-145",
  "text": "108 EDUCATION ON THE AIR\npublic controversy is difficult—very difficult. It requires per¬\nsons of great sophistication and of judicial temperament. They\nare rare. They must be trained after they are found. It is\nthese people that I should like to see gravitating to the top in\nradio station management. This would be my high ambition\nfor the policy of broadcast management in our society.\nALLEN SAYLER4\nThis question of editorial policy in radio has to do\nwith freedom of expression, a subject of primary interest for\neducators and broadcasters. Freedom of expression is inter¬\ntwined with other fundamental principles of our democratic\nsociety, with political democracy, social equality, and competi¬\ntion in the economic sphere.\nIf there is some truth in the idea that free expression and\ntolerance of opposing views thrives in a period of prosperity,\ntoday, at first glance, here in the United States we should be\nwitnessing the widest latitude of expression, the greatest com¬\npetition in ideas we have ever seen.\nBusiness is booming. We are close to full production and\nhigh employment. Labor and management have reached agree¬\nment on wages and other conditions in the key industries of the\ncountry. Our land and our people have not been ravaged by\nforeign invasion. Economically we are in a position where\nwe are able to proceed with the business of building democracy.\nInstead, today we are engaged in a struggle over whether\nor not we shall maintain the democratic institution of free trade\nunions and the democratic principles of freedom of thought and\nfree expression. Why is this so? \\\nA second glance at our economic picture reveals some facts\nthat bear on our difficulties.\nAmerican industry’s profits are the highest in their history.\nBut these abnormally high profits are coupled with an all-time\nhigh in price levels, with a cost of living that means reduced\nliving standards for the great bulk of the people of the country.\nPurchasing power is declining, the consumption of goods is\ndeclining. In recent weeks, the forecast of a slump or reces¬\nsion has moved from the financial page to the first pages of\nthe newspapers.\nOf equal importance has been the narrowing or restriction\n4 Radio Representative, UAW-CIO, Washington."
}