{
  "id": "d298-153",
  "text": "ii 6\nEDUCATION ON THE AIR\nbe sworn to before it would renew a license, and this amounted to\nnothing less than censorship. The applicant was told in advance what\nhe could not do, and he should not have been told any such thing.\nIn addition to that, the record in the Mayflower case would not\nsupport a lot of these generalities about editorializing. The cold fact\nis that the Mayflower case shows, in many instances, that my client,\nJohn Shepherd, was but one voice crying in the wilderness against a lot\nof things that are similar to the things that Mr. Howell mentioned.\nI don’t think the Mayflower case relates to the things Mr. Howell\ncited. I think he is to be commended for them. But, I don’t think\nthey are editorials in the strict sense of the word. I think he is just\ndoing a good public service job in carrying out enterprises which are\ngood by their own self evidence.\nBut about this Mayflower decision. I think it ought to be thrown\nin the ashcan. That’s where it should have gone in the first place.\nMr. Leigh :\nI don’t find many differences between the five people who have\nspoken. A definition would help to resolve some of the differences, but\nthe definition is certain to leave a “twilight zone,” as Mr. Fly pointed\nout in his paper.\nMr. Howell talked about editorial advocacy. There are a great\nmany public problems in which a radio station, with an interest in the\ncommunity, can render notable service. Broadly speaking, these are\nnon-controversial things and I should say that the Mayflower decision\nprobably never was intended to prohibit such discussion. We might all\nagree they are legitimate.\nOn the question of “partisan advocacy,” as some of the speakers\nhave phrased it, I join in the point of view that an owner of a station\nmay engage in it if he so chooses, provided he maintains the balance\nof argument on his own station. I go further than that, however, and\nif I were a station manager I would choose the extremely difficult task\nof trying to be an umpire and an interpreter, which is at direct variance\nto being a partisan advocate.\nMr. Sayler:\nI have a question for Mr. Spearman. In the absence of the May¬\nflower decision, what is a group to do that has views opposed to those\nexpressed over its community radio station, when the radio station re¬\nfuses to grant time?\nMr. Spearman:\nI think that radio broadcasters ought to afford equal opportunity for\nthe presentation of any question of importance in the community. Nat¬\nurally they have to exercise some discrimination; there would not be"
}