{
  "id": "d298-180",
  "text": "LIMIT POWER OF RADIO STATIONS\n92X\nearly morning farm audience., KFX, Incidentally, based its protest on this 6 a0 m*,\nservice fey WOI to Iowa farmers on the contention that Iowa State College interfered\nwith KFIE s early morning transmission in California* I will only remark that 6\na* vlo Iowa time is 4 a* m« California time*\nWOI is required fey present rules and regulations of the Federal Communications\nCommission to cease operation at locals or Iowa, sunset, and Is not permitted to\nbroadcast full time night because of alleged interference with KFI? Los Angeles*\nSenator Johnson* Bid you hear KFFs testimony, Mr. Hull, before this committee?\nMr* Hull* I did not have that opportunity*\nSenator Johnson* How they bled for the farmer5 how they lived for himg It\nwas really quite touching *\nMr* Hull* It always has been & matter of interest to us* As a matter of\nfact,, In the Federal Coasmnications hearings one time Mr* Caldwell asked us, in\nwhat to me seemed to be rhetoric, if Iowa State College, that great agricultural\ninstitution, wanted to penalise the California farmer by providing interference\nbetween the two stations* At the same tine he had been testifying previously\nabout the highly useful frost-warning service which KFI extends to its California\nfarmers, which no one will quarrel with* let the examination of the California\nmap shows that the citrus-^growing areas in California, which are the primary\nusers of KFI service, are all on the western side of the mountains in an area\nwhere interference would in all probability not occur, if it did exist, and even\nat the most remote and extended definition of interference*\nI will put it this way* We found that a little unpalatable*\nSenator Johnson* If you do not rnind^, I would like to put Into the record\nat this point a telegram signed by 21 operators of rural area radio stations in\nsouthern California, located outside of Los Angeles and San Diego Counties, in\nwhich they says\nThe undersigned owners and operators of 21 rural«area radio stations of\nsouthern California located outside of Los Angeles and San Dijgo Counties resent\nand protest the erroneous and misleading testimony presented to your committee\nby Floyd D* loupg^ of United States Weather Servicej Eugene Jarvis, Roy McLain,\nand certain employees, of radio station KFI* Their testimony shows entire lack\nof knowledge of the service now available in this agricultural area as rendered\nfey these 21 stations*\nIf the frost-warning service should be suspended fey KFI these 21 stations\nwould continue to give in their agricultural areas a more superior frost-warning\nand agricultural service than is now given by KFI, providing the weather infor¬\nmation Is made available by Mr* lousgo\nWe urge passage of the Johnson billo\nThen the 21 radio stations signed as follows?\nSouthern California Rural Areas Broadcasters Association, by W. L* Gleason^"
}