{
  "id": "d298-2",
  "text": "- 3 -\ncasting Company. 4 Pike & Fischer, R.R. 21; The Northern Corporation (UM3X) ,\n4 Pike & Fischer, R.R, 333', 338. And both the Commission and the Courts\nhave, stressed that this, responsibility devolves-upon the individual licensees,\nand. can. neither he delegated hy the licensee to any network or other person\nor group, or he unduly fettered hy contractual arrangements restricting the.\nlicensee in his free exercise of his independent judgments. National Broad¬\ncasting .Company v. United States, 319 U.S. 190 (upholding the Commission’s\nChain Broadcasting Regulations, Sections 3.101-3.108, .3.231-3.238, 3,631-\n3,638), Qhurchhill Tabernacle v* Federal Communications Commission 160 P.\n2d. .244, (See, Rules and Regulations, Sections, 3.109, 3.239, 3.639); Allen\nT. Simmons v. Federal Communications. Commission. 169 P. 2d 670, certiorari •\ndenied 335 U.S. 846.\n5. But the inevitability that there must he some choosing.between\nvarious claimants for access, to a licensee’s microphone, does not mean that\nthe licensee is free to utilize his facilities as he sees fit or in his own\nparticular interests as contrasted with the interest's of the general public.\nThe Communications Act of 1934, as amended, makes clear th-t licenses are\nto be issued only where .the public interest, convenience or. necessity would\nbe served thereby. And wo think, it is equally 'clear- that one of the. basic\nelements of any such operation is the maintenance of radio and television\nas a medium of freedom of speech and freedom of expression for the people\nof the,nation as a • who Be. Se ction 30\\ of the Communications Act provides\nthat it is the purpose of the Acf tc maintain the control of the United\nStates over all channels of interstate and foreign commerce. Section 326\nof the Act‘provides that this control of the United States shall not re¬\nsult in any impairment of the right of free speech..by means of such radio . •\ncommunications. It would, be inconsistent with these express provisions of\nthe Act to assert that, while it is the purpose of the Act to. maintain the\ncontrol of the United States over radio channels, but free from any regu¬\nlation or condition which interferes with the right cf free speech, never¬\ntheless persons' who are granted limited rights to be' licensees of radio\nstations, upon a finding under Sections 307(a) and 309 of the Act that the\npublic interest, convenience, or necessity would be served thereby, may\nthemselves make radio unavailable as a. medium of free speech, . The legislative\nhistory of the Communications Act and its predecessor, the ‘Radio Act of 1927\nshows, on the contrary, that Congress intended -that radio, stations should\nnot be used for the private interest, whims, or' caprices of the particular\npersons who have been granted licenses,, but, in manner which will serve the\ncommunity generally and the. various groups which make up the community.—/\n17 Thus in the Congressional debates leading to the enactment of the .Radio\nAct of 1927 Congressman (later Senator) Uhite stated (67 Cong. Rec. 5479,\nMarch 12, 1926);\n\" Ue have reached the definite' conclusion that the A\nright of all our people .to enjoy this means*of communi¬\ncation can be preserved only, by the. repudiation of the\nidea underlying the 1912 law that anyone who will, may\ntransmit and by the _ assertion- in.its stead of the doc-\n.trine that•the right of the public to service is‘superior\nto the right of any individual to use the other * * *"
}