{
  "id": "d298-21",
  "text": "proeoduro. of .this, commission in handling 'similar problems on the basis, of adjudi¬\ncatory proceeding arising;out of.individual factual.situations* In’this oqnV\nnoction the'statement of the Supreme Court’of the United. States in Securities and\nExchange Coitmi s s i on v, Chene r y C o rp or at 1 'on1, 332 US 194, 202-203 is pertinent • .\n\"Not eyer'y principle essential to the ’effective 'administration' of a \",\nstatute can or should be cast immediately' into the mold of a general\"\nrule* Some principles must await their own development,- while ’ others’\nmust bo adjusted.to meet particular unforeseeablo .situations* In\nperforming its' important functions in those respects, therefore, an\nadministrative agency must be- equipped to act .either'by, general,r.ulo\nor by individual order* To insist upon one form of.action to the\nexclusion of the other ;is to- exalt form over necessity* .\n\"in other words., problems may-arise in a case which .the administrative\nagency could not reasonably, foresee, problems which must be solved\ndespite the absence. of a relevant general rule* Or thy; agency may n'ot\nhave had sufficient experience with1 a- particular problem to warrant\nrigidifying its tentative judgment into a hard' and fast rule* Or the\nproblems may bo so specialized and varying in nature as, to be impossi¬\nble of capture within tho boundaries of a general rule, -In those\nsituations, the agency must retain power to deal with the•problems on\na case to case basis if .the administrative process is to bo effective-*\"\n16, But oven if tho Commission's approach to the problems hero, presented is\ncorrect, the form in which the Commissionfs decision is cast is entirely im¬\nproper* Neither the general policy croatod nor the qualifications on' the right\nto editorialize aro mado cloar in terms free from ambiguity*_ Background, policy,\nexample, qualification arc all commingled*: indeed, it is/l’believe, fair to\nstate that it takes more than merely a careful reading of the report to ascertain\nthe Commission’s disposition of the issues pro-son.ted*. IJnder, those circumstances\nI believe the Commission should speak more clearly* Sound administrative policy,\npursuant to the mandate of Congress requires tho formulation of the standards 1\nhere created in tho form of clear and-separately stated rules and regulations\nwhich con servo as a clear guide to licensees as to the conduct-which the Com- ’?\nmission dooms it nocos.sary for them-to follow* Clearly the uncertainty with ro-\nspoct to the matters hero presented should bo removed and not augmented by a.\nformless policy statement issued in tho mold'of a report* • '-\n17, Whatever may be our personal preferences with respect to the final form\nthe Commission’s decision hone should take., V boliovc that Congress has “by statute\noomanded, whero a general polioy is created independently of adjudication; . that\ne orm o in a separately stated and currently published ioodified rule. \" •'\nSection-3 (a) (3) of the Administrative Proeoduro Act expressly requires oach\ngoncy to separately state and currently publish in tho Federal Register \"sub- .\n* “ld stat0“°nts of g°hcral policy or, interpretations formu-\nlatod ana adopted by.th.o agency for tho guidance of the.public.\" If the report-\ntenoral ^SS1°+ d*°S- °naot a substaijtivo>ulo jt at least constitutes a'\ng n ral statemont of policy formulated and adopted for tho guidance of tho"
}