{
  "id": "d298-22",
  "text": "_ a _\npublic. It is to avoid just the type oi procedure here followed that the\nAdministrative Procedure Act confined requirements as to the publication of\npolicy statements in rule form,\n18* Hot only has Congress- provided in the Administrative Procedure Act for\npublication in* such form but the Rules and Regulations of the Administrativc\n' .Committee; of the Federal Register, issued pursuant to the Federal Register Act\n(44 U.S.C. Subchapter 8 B) clearly require policy statements such as that\nadopted here to be published in the Federal Register in codified form. See\nFederal Register, October 12, 1948, pp,. 5929 et,. soq,. Rule 1,32 of the Federal\nRegister Regulations provides* \"\n\"Documents having general applicability and legal effect. Every .\ndocument, issued under proper authority proscribing a penalty or\na course of conduct, conferring a right, privilege,, authority or\nimmunity, or imposing an obligation, and relevant or applicable\nto the general public, the members of a class or the persons of\na locality, as distinguished from named individuals or organi¬\nzations, is hereby determined to have general applicability and\nlegal effect. Such documents shall 'bo filed in the office of the\nDirector and published in the Federal Register. (Applies sec, .\n5(a), 49 Stat. S01j 44 U,S,C. 305(a)(2)),\"\nAnd Section 1,10 of the Federal Register Regulations provides:\n\"Document subject to codification,. Document subject to codifica¬\ntion means any regulatory document which has general applicability\nand legal effect and which is in force and effect and relied upon\nby the issuing agency as authority'for, or invoked or used in the\ndischarge of, any of its functions or activities,\".\nThe style of preparation of documents■subject to, codification is provided for\nin subpart H of these Rules, This style is the same as the form of the rules\nand regulations of the Commission,.\n19f, Accordingly, there is no question that the policy statement here\nadopted in the form of a report .should be separately stated and published in\ncodified form in the Federal Register., The report, in its present form'may\nconstitute a sufficient statement of the reasons or grounds for such a codified\nrule, but it cannot under any circumstances be s.aid to comply with the pro¬\ncedural provisions relating to publication provided for in the Administrative\nProcedure Act and the Federal Register Rules issued pursuant to the Federal\nRegister Act, As such the failure to comply with these statutes and rules\nraises serious questions as to the validity of any substantive programming re¬\nquirements now created by the .Commission, , And further, this doubt only in¬\ncreases the uncertainty of licensees with respect to the matters here presented*\n‘Accordingly, I believe that if .the Commission is to announce prospective stand¬\nards, it should proceed to issue.codified rules in proper form for the benefit\nand guidance not only of licensees but the public at large,\n20, it seems to me that the Commission is gaggihg* at a gnat when its\nopinion• is-confined, to the licensee’s personal, use of his own microphone\nto advocate causes of the licensee, „ .Since the adoption of the Mayflower"
}