{
  "id": "d298-25",
  "text": "- 11 -\n25* The Commission has full power to review charges of continued irre¬\nsponsibility by specific commentators in broadcasts over the facilities of\nindividual stations. Licensees are completely responsible for the selection\nof those who regularly use their facilities and therefore when commentators\nare continually irresponsible, their programs reflect thu conscious permission\nof the licensee to permit such irresponsibility to be a part of the station’s\nprogramming. Clearly placing the treatment of news commentaries in the hands\nof persons who continually in an irresponsible fashion prosent their commentary\nies cannot be considered consistent with the public interest* Commentators\nwho regularly make statements unsupported bar fact and who regularly attack\npublic figures by innuendo, without support in fact, are offering false news\nto the public* There is no constitutional right to broadcast false news and\nthe broadcast of false news, just as the broadcast of false advertising, is\ncontrary to thu public interest. Accordingly, the irresponsibility of broad¬\ncasts by commentators of necessity reflects upon the qualifications of the,\nlicensee who permits such commentators to regularly use his facilities# —\nAnd it is unfortunate that the more shocking the technique of the commentator\nthe more valuable he becomes to the station or network and the less the desire\nof the network or licensee to rid their programs of the irresponsibility*\n26. The Commission*s power to take action 'with respect to the past use of\nradio facilities for purposes of irresponsibility is clear enough. The Com¬\nmission is not required to renew licenses of persons who permit irresponsible\nprofessional editorialists to broadcast false news and to make continued at¬\ntacks upon person after person without foundation in fact. Trinity methodist\nChurch, South v* Federal Radio Commission, 62 F* 2d 850, cert, den* 288 US 599.\nIt should bo pointed out that the more fact that many of the commentators broad¬\ncast over the facilities of networks does not place the irresponsibility out¬\nside the powers of the Commission. It should bo remembered that networks are\nalso licensees* In fact, ono of the main arguments networks advance as to the\nneed for network-owned stations in key cities is that such stations constitute\na nocessary originating source for network programs. Accordingly, to the\nextent that networks are licensees they are subject to the regular licensing\npowers of the Commission* Where a network permits the continued use of its\nfacilities by irresponsible commentators, this fact should be considered by the\nCommission as evidence of the network’s lack of qualification to hold a radio\nstation lioonso. Further, licensees affiliated with such networks must bo\nhold strictly accountable for irresponsibility broadcast over their facilities\neven though such irresponsibility is of network origin. Licensees cannot ab¬\ndicate their responsibility for determinations with respect to the continued\nuse of their facilities by irresponsible commentators whoso irresponsibility\nbecomes a valuable commercial* asset of the stations involved. Accordingly,\nthe Commission should consider irresponsibility on the part of both the net¬\nwork and the individual licensee with network affiliation in placing responsi¬\nbility for the reckless statements that are frequently broadcast over the air*\n•In this connection it should be pointed out that in the KFKB Broadcasting\nAssociation case, supra, the court approved the action of theCommission in\nrefusing to fortew the license of KFKB even though it was found that much of\ntie station’s programs were entertaining and unobjectionable in character*\n47 F. 2d at 672*\n7/ While I recognize that' frequently the views expressed in commentary pro¬\ngrams are not those of the licensee, I do not believe that a mere disclaimer\nby the licensee that the views expressed during a progrojn are the views solely\nof the commentator and not the licensee constitutes a sufficient solution to\nthe problem* For such a disclaimer does not dispel the effect of the seloction\nof that commentator as a person fit to broadcast over a station or network."
}