{
  "id": "d298-31",
  "text": "-5-\nThe NAEB does not take the position that clear channel assignments* as\nsuch, are not in the public interest* They may be necessary in order to insure\na satisfactory signal in some rural areas which must depend largely upon dis¬\ntant stations for radio service* NAEB, however, is of the conviction that the\nclear channel rule should be administered in accordance with the purpose for\nwhich it was established —* to insure adequate program service to rural audi¬\nences. Each clear channel should be examined to determine the extent to which\nduplicate nighttime operation would result in loss of existing service to pri¬\nmary and secondary areas. The nature of the program service offered by the\ndominant station to these areas should be examined to determine the extent —\nif any — to which it serves the needs of the areas hundreds of miles away from\nthe station and this should be compared to the availability of other signals\nand program sources available to the areas affected (R<, 6019=^020). In fact\nthere have been no complaints of interference by the operation, under a special\nservice authorization (R. 6110), of one of these daytime only stations at night*\nIn determining the extent of interference from another station on the chan¬\nnel, the interfering signal should be based on the present location of all NAEB\nstations now operating daytime or part-time only (R* 6028). This class of sta¬\ntions, more than any other, is in need of additional hours of operation in order\nto present its unique type of program service, particularly to rural listeners*\nInsofar as it is feasible from an engineering standpoint, these stations should\nbe permitted to meet the local and rural needs of their radio audiences at night\njust as they now do during the day (R. 6019) * The program service offered by\neach particular NAEB station on the channel should then be compared to the ef¬\nfect its nighttime operation would have on the areas where there may be audi¬\nences now receiving service from, the dominant station, so that on a comparative"
}