{
  "id": "d298-48",
  "text": "Mayflower Hearings\n1* Tke problem is monopoly. If this is the problem then the FCC should continue\nthe controls*\n2. There is little real competition from educational stations* Perhaps the\nstrongest competition in t£e world to commercial stations from educational\nstations exists 3CKMIX in Iowa from WOI.\n3. The National Association of Broadcasters in theft \"defense\" of free speech\nhave set up a straw man*\n4. The existing rules(re. the Mayflower & editorializing)some feel are alright*\n5* Stations as a whole raise hellft??\n6. In general in mass media the liberals are shut-up and the reactionaries\nare loud*\n( ,\n7* So long, says our reporter, as near monopoly or monopoly exists then rule\nis good.\n3* Actually educational stations are controlled by the same attidues as those\nwhich control commercial stations(look at the source of money and the neeessity\n—perhaps to a lesser extent—not to offend the public)\n10. One distinguishing factor (radio from press)is time factor. Not only the\nduration of the message, and the fact it is not repeated, but the time of\nexposure from a scheduled day which is available to the listener.\na)This creates a responsibility a newspaper doesnot have*\nZZX b)the factor of voice and the conviction it carries imposex a fnnther\nresponsibility.\n11. The Hset-upM with the printed page makes for lack of freedom of speech.\nLook at the liberal voices which have been stilled—the Nations, the New\nRepublic, PM, etc.\n12. We can argue freedom of(printed )speech is hindered by the limitation\nof liberal «$>eech. The job is to get all significant points of view out\nand diffused.\n13. The limitation of cost is a serious limit in factor to freedom in both\nradio and print.\n14. ^he conclusions of self-cleansing or government control are inescapble,\nY/e do not want a movie zar type of censorship either.\n15. Fallacy of licensing of the press\n16. The important thing now is for all people to be reached. Real freedom\nconsists of keeping open the avenues of information.\n17. Moapology has come under the guise of freedom of speech."
}