{
  "id": "d298-63",
  "text": "-5-\nAn understanding and rereading of the original discussion when the Communications\nAct was in Committee, and a rereading of the Congressional Record when the issue\nwas discussed on the floor of Congress, would help clarify the issues and aid\nin the solution of the problems of this hearing. And if I may add another sug¬\ngestion, why wouldn’t it be a good idea for the Commission to prepare a digest\nof these fundamental and basic records and then make it available to the thou.-\nsands who are now engaged in the operation of radio stations and who, when the\nAct was passed, were either in high school studying algebra and American history\nor were making a living in other businesses. I, for one, have not thoroughly\nstudied these records. Most of my information comes from a former member of\nCongress who was active in the discussions in Committee and on the floor —\nP. H. LaGuardia. We all know how former President Hoover felt about radio as\na vehicle for public service. But some don’t know that the majority of the Com¬\nmittee of the House and many members of Congress were inclined to write into\nthe law a provision that every station allocate a certain percentage of its time\nfor public service. Some don’t know that it was only after long debate that\nCongress finally compromised on the phrase \"public interest, convenience and\nnecessity\", and that, only after Congress specifically wrote Section 315 into\nthe Act, the political provision, making it absolutely mandatory upon the station\noperator to treat every candidate for political office alike. If this is true,\nit is important that broadcasters know it. They ought to know it for the sake\nof the industry; they ought to know it for the sake of the community which they\nserve.\nCertainly no one can deny the benefits of the discussions that followed\nthe publication of the Blue Book. Certainly no one will deny the general im¬\nprovement in local programs since March 19^6. Certainly it made the task of"
}