{
  "id": "d298-9",
  "text": "19 -\ncussion must take place in a climate of false or misleading information\nconcerning the \"basic facts of the controversy,\n18. During the course of the hearings* fears have been expressed\nthat any effort on the part of the Commission to enforce a2©«&oiiable\nstandard of fairness and. impartiality would inevitably require the Coo-\nmission to take a stand on the merits of the particular issues considered\nin the programs broadcast by the several licensees, as well as exposing\nthe licensees to the risk of loss of- licensee be cause of \"hexasst mistakes’*\nwhich they may make in the exercise of their judgment with r spect to the\nbroadcasts of programs of a controversial nature. We believe that these\nfears are wholly without justification, and are based on either on assump¬\ntion of abuse of power by the Commission or a lack of proper understanding\nof the role of the Commission, under the Communications Act, in considering\nthe program service of broadcast licensees in passing upon applications\nfor renewal of license- While this Commission and its predecessor-, the\nFederal Ea&io Commission„ have, from the-beginning of effective radio reg-\nuMion in 1927, properly considered thMt a licensee’s overall program\nservice is one of the primary inbv,in of fcls ability to serve/ the public in¬\nterest , actual consideration of such, service has always been limited to\na determination as to whether the licensee’s programming, taken as a Whole,\ndemonstartes that the licensee is aware of his listening public arid is wi 11-\n:ng. and able to make an honest and reasonable effort to live up to such\nobligations- The action of the station in carrying or refusing to carry any\nparticular program is of relevance only as the station’s actions with respect\nto such programs fits into its overall pattern:, of broadcast service, and\nmust be considered in the light of its'other program activities* This does\nnot mean, of course, that stations may, with impunityt engage in a partisan\neditorial campaign on a- particular issue or series of issues nrovi&ed only\nthat the remainder-of its program schedule conforms to the statutory norm\nof fairness; a licenses may not utilise the portion of its broadcast ser¬\nvice which conforms to the statutory requirements as.a cover or shield for\nother programming which fails to meet the minimum standards of operation in\nthe public interest. But is is clear that the standard of public interest\nis not so rigid that an. honest mistake or error, in judgment on the part of\na licensee will be. or should be.condemned where his overall record demon¬\nstrates a reasonable effort to provide a balanced presentation of comment\nand opinion on such issues. The cuostion is necessarily one of the reason¬\nableness of the station's actions, not whether any absolute standard of\nfairness has been achieved. It does not require any appraisal of the merits\nof the particular issue to determine whether reasonable efforts have been\nmade to present both sides of the question. Thus, in -appraising the record\nofstation in presenting programs concerning a controversial bill pending\nbefore the Congress of the United States, if the record disclosed that the\nlicensoe had permitted only advocates of the bill's enactment to utilize\nits facilities to the exclusion of its opponents, it is clear that no in¬\ndependent appraisal of the bill*:- merit's by the Commission would bo cequired\nto reach a determination that the licensee had, misconstrued its duties and\nobligations as a person licensed to serve the public interest- The Com-*\nmission has observed, in considering this general problem that Mthe duty to\noperate in the public interest is no esoteric mystery, but is essentially\na duty to operate a radio station with good judgment and good faith guided\nby a reasonable regard for theheterests of the community to be served*”"
}