{
  "id": "d298-93",
  "text": "“THE OLDEST STATIC]N IN THE NATIDN'\n%\nUNIVERSITY OF WISCONSIN\nMADISON\nJanuary l4, 1948\nMr. Richard B. Hull\nRadio WOI\nIowa State College\nAmes, Iowa\nDear Dick:\nOur letters must have crossed in the mails because I have\njust received your letter in which you ask for some of the information\nwhich I sent you.\nGoing back to that \"Mayflower\" business, we'll do whatever\nyou say on it. As I said beiore I don't think we have enough of the\nbackground to make a really profound report on it. Wp'll be glad to\ntalk it over and sent our opinions along for what they are worth.\nWhat do you think? The green sheet which I'm enclosing : ives the\napproximate locations of the FM transmitters which are anticipated.\nAll of these, will be 10 kilowatt jobs with the exception of the one\nhere in Madison and the one at La Crosse. These are to be 3 kilowatts.\nKeep it in mind that these are tentative plans and that some changes\nmay be evolving on the basis of experience we have with the trans¬\nmitters as they are put into operation. FM is getting out farther\nthan we anticipated. We expected to get about 50 miles on this\ntransmitter and are getting from 60 to 70 quite consistently. The\nsame holds true for the 10 kilowatt job planned for Milwaukee. That\nwill reach way over this way whereas we had expected it not quite to\ncome to Madison. It's most encouraging.\nAt the Chicago meeting Waldo Abbott and I talked over the\nFM network possibilities with a view of boosting the programs from\nour Delafield station across the lake to Grand Rapids where one of\nhis students has a station. From there he would pick it up and boost\nit from Ann Arbor down to Indiana and Ohio, thus making a loop which\nmight extend across Indiana and over to Illinois and possibly thus\nit could reach over into Iowa and off to the stations in the west.\nI'd like to see something like this worked out because I think it\nis through these channels that we're ultimately going to get a\nnetwork. It will be up to each state, I believe, to set up its\nown local network first and then hitch on to a nation-wide hookup\nwhich will be evolving.\nThe Stevens Point station whl ch you asked about, is operated\nby the State Department of Agriculture and is licensed in the name\nof the State of V/isc’onsin, Department of Agriculture, ve have no\ncontrol over that station but do supply several hours a day of\nprograms to them. They take largely the service programs such as"
}