{
  "id": "d996-44",
  "text": "N A E B\nRADIO PROGRAM REPORT\nNO. 4 DEC, 195b\n}iJ-P C. Q J'Wyi I;.,;,:\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 Gregory Hall\nUrbana, Illinois\nPhone 7-6611, Ext. 3394\nWORLD TOUR\nAS THE EYES OF THE WORLD TURN TOWARD AFRICA AND ASIA, TEACHERS ARE\nSEARCHING FOR AUTHENTIC MATERIAL ABOUT THESE STRANGE AND DISTANT\nLANDS, TO HELP SATISFY THIS NEED IN St. LOUIS, KSLH HAS PRODUCED\nA NEW RADIO SERIES CALLED WORLD TOUR WHICH BRINGS SCHOOL CHILDREN\nTHE VOICE OF A NATIVE OF THE PUNJAB, INDIA, A MEMBER OF A NATURAL\nSCIENCE EXPEDITION TO KENYA, OR A PROFESSOR IN JOHANNESBURG, SOUTH\nAfrica,\nPreliminary to the actual writing of the programs, members of the\nElementary Social Studies Radio Planning Committee and a group of\nsixth grade teachers met after school hours to outline the series\nAND DO SOME OF THE NECESSARY RESEARCH. It WAS DECIDED TO USE A\nDOCUMENTARY FORMAT.\nThree sources of material made such a format possible: one, tapes\nWHICH HAVE COME TO KSLH THROUGH THE NAEB NETWORK* TWO, BACKLOG OF\nRECORDINGS MADE IN KSLH STUDIOS* AND THREE, LIVE RECORDINGS OF LO¬\nCAL TRAVELERS OR FOREIGN VISITORS TAPED IN St. LOUIS DURING THE\nCONTENT OF WORLD TOUR. THE EXCERPTS SELECTED WERE THOSE WHICH BEST\nFITTED THE DEMANDS OF THE SERIES AND WHICH MOST EFFECTIVELY SUPPLE¬\nMENTED THE SIXTH GRADE COURSE OF STUDY.\nThe KDKA \"African Adventure\" series proved to be very helpful, Vicki\nCorey’s recordings of native music, brief conversations with local\nPERSONALITIES SUCH AS GRIFFITH DAVIS, TECHNICAL ADVISER ON THE POINT\nprogram in Liberia, and a firsthand description of her descent\ninto a Capetown gold mine fitted into the series nicely.\nSome of the recordings which KSLH had on hand were interviews with\nVISITORS MADE AT THE STATION. THESE INCLUDED MICHAEL PENNINGTON,\nAN INSTRUCTOR AT $T. JOHN’S SCHOOL IN JOHANNESBURG, Dr. PlNAR, A\nPROFESSOR AT THE UNIVERSITY OF JOHANNESBURG, AND MlSS EAST, A TEACHER\nat Sueing Mission in the interior of Liberia."
}