{
  "id": "d1121-4",
  "text": "r\ninstruments, the station is carrying an Eng¬\nlish composition credit course for the Uni¬\nversity of Omaha, and also programs for\npre-schoolers and for kindergarteners.\ny KRMA-TV, Denver, has scheduled for\nthe summer six senior high school credit\ntelecourses—three in science, two in his¬\ntory, and one in notehand, a form of sten¬\nography.\nPROGRAMS\ny “Whatever Happened to Childhood?” is\nan hour-long program produced by WHYY-\nTV, Philadelphia, in cooperation with the\nlocal Junior League. The program explores\nthe strain of being a child in the mid¬\ntwentieth century, comments on the press¬\nures of conformity and the competition for\nexcellence, and offers insight into the prob¬\nlem of vanishing childhood and the ap¬\npearance of a new breed of “little adults.”\nThe program was produced and directed by\nEd Fryers, with Ken Strange as camera¬\nman. Lib Rutan wrote the program.\n^ In a Canadian Broadcasting Corpora¬\ntion radio series, Myth and National Cul¬\nture, Mrs. Jill Conway, social historian at\nthe University of Toronto, traces myths\nfrom their beginnings to their implications\nfor the wtorld today, including conscious\nmanipulation of ancient myth for political\npurposes in the 20th century.\n-— ^ Living for the Sixties is an ETV series\nproduced by the State University of New\nYork to meet needs of older Americans. It\nconsiders subjects such as improving health,\nlegislation in favor of the aging, cooking\nfor yourself, physical exercise, and Social\nSecurity benefits. Kitty Carlisle is hostess\nfor the first half of the series, followed by\nBetty Furness. In late summer, tapes and\nfilms will be available to ETV stations.\n^ WFCR, Amherst, Mass., received spe¬\ncial permission from Eugene Ionesco to\npresent over the Eastern Educational Radio\nNetwork the American premiere of his one-\nact play, “Le Roi se Meurt” (The King is\nDying). The play was broadcast over\nWFCR May 8 in the original French, and\nwas carried simultaneously by WGBH,\nBoston, and WAMC, Albany.\ny Lurlean Hunter and Carmen McRae\nperformed together on WTTW’s series\nFacet recently when Miss McRae was in\nChicago. WTTW producer Robert Kaiser\nbrought her and her friend Miss Hunter,\nwho lives in Chicago, together for a half-\nhour of song and old-friend-type patter,\ncalled “Take Two.” It was produced by\nKaiser assisted by Peter Kuttner.\ny WOUB-TV, Ohio University, recently\npresented, for the first time on American\nTV, the work of French poet-playwright\nPaul Claudel, in “A Poet, The World and\nGod: Readings from C'laudel.” Rick Hauser\nw*rote and directed the dramatic presenta¬\ntion. He had translated a number of Clau¬\ndel’s works while a student in Paris, when\nhe became acquainted with the family.\nMetamorphosis of a TV Program\n—by Marvel Lunn\nTo help environmentally deprived students\nadjust educationally, socially, and physically\ninto the mainstream of life, Oklahoma City\nstarted an after-school program during the\n1964-65 school year. This involved high\nschool students from several of the second¬\nary schools who were willing to give up\ntwo afternoons a week, Monday and Thurs¬\nday, to work with the students in grades\nfour, five, and six in the twenty-one elemen¬\ntary schools in the section of the city that\nis generally classified as poverty-bound.\nProviding an activity program with re¬\nfreshments kept the children off the streets\nor from unsupervised homes. Some of the\nactivities were games, crafts, dramatics,\nstunts, and music. Between the time the ele¬\nmentary students were dismissed at 3:15\nand the time the secondary students arrived\nat 3 :45, a teacher watched the students. If\nthe teacher kept order with the large group,\nit was necessary for her to have a strict\ndiscipline situation which was not always\nconducive to enjoyment.\nWe at the broadcasting center of the\nschool system were asked to provide a\ntwenty-minute program for this period\nthat would provide entertainment. As talent\non the telecast, “Fun Time,” we primarily\nused studio personnel and high school stu¬\ndents. Each week guests from elementary\nschools in the after-school program served\nas the audience for telecasts. They were\ninterviewed on videotape so they could see\nthemselves on television with their peers.\nThe purpose of the program is changing,\nis expanding in its scope. The entertainment\nis to be merely the vehicle through which it\nis hoped that students who are the audience\nwill develop a sense of being and that their\nlevel of aspiration will be raised. It is hoped\nthat the program will not be didactic but\ntherapeutic in nature. The success of chil¬\ndren’s programs is action and variety. This\nmakes it necessary to have several four- to\nsix-minute segments brought together for\ncontinuity with a recurring theme or per¬\nsonality.\nBasically the activities or parts of the\nprogram can be classified as follows:\n• Individuals or groups from the ele¬\nmentary schools who have done something\nunusual or have developed a talent in the\nafter-school program that can bring them\nearned recognition, such as a hobby or a\nskit written and produced by the students.\n• Cultural entertainment that will ex¬\npose them to activities that their environ¬\nment would not normally provide, such as\npuppet shows by the Junior League and\nbooks which will be narrated by high school\nspeech classes and visualized by studio staff.\n• Community resources, such as the\nplanetarium, the zoo, and the fair, will be\nfilmed and introduced on the program in\nsuch a manner as to make a field trip by the\nentire class something desirable.\n• Talent whose purpose is merely to en¬\ntertain will be used, such as high school in¬\ndividuals and groups, to maintain interest\nby the elementary students and to provide\nthe entertainers an opportunity to perform.\nTelevision has and will play a major role\nin the after-school program for the environ¬\nmentally deprived. The role will change\nfrom an entertainment program to a pro¬\ngram that has for its goal the development\nof character, culture, and worth in the in¬\ndividual.\nJULY, 1966\n5"
}