{
  "id": "d1045-1",
  "text": "II. Constitutional Amendment: Discussion on amendment previously submitted\n\"by letter. Voted change as follows:\nThe following changes are now proposed for your consideration:\n(1) ARTICLE I - Section A (Revision in)\nThe word \"ACTIVE\" shall he inserted as indicated in\ntwo places.\nMEMBERSHIP S\n(A) Any university, college, or other educational\nor public service agency of recognized standing engaged\nin educational, non-commercial broadcasting over a radio\nstation owned and/or operated by it or any such agency\nholding a construction permit for such a station, may be\nelected to active membership in this organization by\napproval of the Executive Committee, and a two-thirds\naffirmative vote of all active members of the association.\nEach active member institution or agency shall be entitled\nto one vote.\n(2) ARTICLE II - Section B (new)\n\"a\". Pirst paragraph shall be designated, with the letter ’’a11.\n1TB\". The dues of associate members shall be $5.00 per year.\nHanna (WHCU) raised the question about the word \"non-commercialn\nin the eligibility statement. Wanted to be sure that his station\nqualified, though it sold some time to support its activity. Concensus\nof opinion was that wording should not be changed, but that each case\nshould be considered on its own merits. The real objective of the\nstation (profit or education) should be the determining factor.\nIt was moved by Schooley (WILL) that the Executive Committee\nstudy the matter and make a formal recommendation as to what shall\nconstitute the basis of membership qualification.\nIII. NAEB Clear-Channel hearing representation. Moved, seconded and passed that\nMarcus Cohn (1420 New York Ave., N.W. Washington, D.C.) be authorized to\nspeak in behalf of NAEB at the hearings.\nPresident Hull asked to be excused so he might catch a train to Washington,\nHe appointed Ex-President Engel to preside at the meeting.\nIV. Membership Business\nA membership review indicated the following:\nDec. 1, 1946 Oct, 25, 1947\nActive\n23\nIn\nApplications\nAssociate\n_8\nActive\n33\n4\n37\nTotal\n31\nAssociate\n18\n10\n28\n51\n14 Total\n65\nThis indicates more than 100% increase in one year.\n- 2 -"
}