{
  "id": "d1045-1",
  "text": "James Fellows\nFebruary 17» 1966\nPage two\nThe vasic problem is the script but Earl doesn't help much since he never had\ntime to even look at the script until he was ready to shoot. Probably this\nis the most important of the six films and yet it is so far the worst film.\nAgain Marye’^s excuse is that she tried to do what she was told by everyone.\nKit Number 1\nI talked on the phone with Gertrude and she gave me verbal approval on the\nscript February 8, 1966. She said she would send a written approval to you,\nbut since I haven't had a copy I'm sure she hasn't. I'll write her a letter\nconfirming her approval.\nOn February 9» 1966, Earl, Marye and I went over the script for number 1 scene-\nby-scene. There were several minor changes agreed upon but all in all Earl\nthought it was workable. Production is supposed to start on March 1, 1966.\nKit Number 6\nThe script for this is the next one on Marye's list. She and I spent a day and\na half working out a treatment for this film. ¥e were at a loss to figure out\nhow to do what we wanted to do and still come up with something Earl could\nunderstand and do, I think our treatment is great, I'll be anxious to see the\nscript. ¥e are using the inquiry method of teaching and putting the audience\nin a role-playing situation, ¥ith the right person cast or the teacher it\ncould be great.\nP.R. Brochure\n¥e are designing and printing a brochure to announce the availability of Kit\nNumber 5* This will be sent to our mailing list but I would like to have it\nincluded in the next mailing of the Newsletter. If this is possible I need\nto know the following.\n1. Prom whom do we request permission to have this included in the\nmailing?\n2. Number of brochures needed?\n5* ¥hen will they be sent?\n4. To whom do I send these?\nTimetable\nI tried to talk to Earl about this and all he would say is that since they were\na month and a half late getting their check they were going to be a month and\na half late. I fear that they will just fall further and further behind. Earl\nsays that the best he can do on starting Number 2 is March 1, and the earliest\non Number 1 will be most likely April 1. I frankly do not believe him. He\nalso says that even with these he will make the release dates for both films.\nMarye will be late on the script for number 6, since she had nothing started\nuntil I got there. ¥e need some examples of outstanding High School lessons to\ncopy. I am attempting to get these but so far have not received any ideas or"
}