{
  "id": "d1045-66",
  "text": "RADIO TELEVISION\nT]n.e XJni'V'ersity of Texas - -A.TJLStin 12\n^ iCLI^lSr (©) • KXJT-FIM: • TEnVEF\nROBERT F. SCHENKKAM\nDIRECTOR\nJuly 4, 1964\nMr* James Fellows\nNational Association of Educational\nBroadcasters\n1546 Connecticut Avenue\nWashington, D* C*\nDear Jim:\nNo...I am not Neptune^s daughter...rising up from the\nwatery depths of the Marianas Trench. (And what would she\nbe doing down there, anyway, I*d like to knowl) This is,\nin truth, merely ol* Chub... eddying up through the mists\ninduced by the humidity of Austin dog days...hair hanging\nin damp tendrils...glasses streaming (or steaming)...brow\nglistening. Beautiful! And so reminiscent of Dorian Gray.\n(Or is it Dorien Gray? Or Dorien Grey? Or Dorian Grey?)\nYou seem to be gone from my life, except as a name\nwhich slips here and there from the lips of friends. I\nassume you’re getting your share of ’’The Long Snow” of\nscripts, memos, comments, carbon copies, family letters,\netc. which swirl and shift about the Utilization Project.\nI am coming to think of scripts and their ensuing amended\nforms in rather Biblical terms...as wise and foolish versions.\n(Except that, of course, the order is reversed.)\nI’ve been very happy about the comments on the first two\nscripts.. .w^h the ones I’ve seen or heard at least. There\nmay be thos^who are off muttering down drain pipes to relieve\ntheir psyches. And I got the helpless honks over Lew Rhodes’s\nstatement to Clair that some of these children talked as if\nMarye Benjamin were their teacher,..or, even more probably,\ntheir mother.\nIn No, 3 I’ve tried to take into account all the suggestions\nwhich you and Clair made, as reflected in his letter of June 5.\nIn the reference to the scientific method, I neglected in the\nrewriting to clarify that, but have written Earl a memo to insert\nthe word ’’reflecting” before”the scientific method.” Believe\nthat will do it, ’’The scientific method” is hamm.ered so at\nteachers who have anything to do with science, and in turn is\nhammered so at their pupils, not only by books on educational\nand teaching techniques but by the textbooks themselves (the\nones I’ve seen),..that I believe they won’t have any difficulty\nwith this reference."
}