{
  "id": "d382-137",
  "text": "REdSVSb\nNAEB HEADQUARTERS\nJUN 9 1958\nAM P M\n?!?l?l1P|ll|12|l|2|8|4|5|f\nl\nOn behalf of the Committee, I want to acknowledge your hay 28th letter\nresponding to the “Request of the National Association of Educational\nbroadcasters to the Ford Foundation,** the five-year $3,000,000 proposal\ndesigned to deal with fundamentals in the continuing application of radio\nand television to the problems of U. S. education.\nWe understand that neither the Fund nor the Foundation is now prepared to\nprovide support for the $3,000,000 proposal which we discussed with you\ninformally on Hay 21st. We also understand that you—in your dual capacity\nas member of the Foundations Education Division and Treasurer for the Fund-\nare speaking definitively on behalf of both In your letter of Hay 28.\nNaturally, we view this decision with some disappointment because of our\nconcern about the basic problems and needs in educational telecommunications\nand our belief in the necessity of a structured, not a random attack upon\nthem. At the same time, we understand there are many considerations which\nthe Foundation must observe in the making of such a decision. We do ap¬\npreciate the thorough and careful attention you gave to our proposal, and we\nare particularly grateful for your efforts In securing a reply quickly enough\nto permit us to proceed with our immediate interim financial problem. This\nissue, of course, had been “tabled** pending a response on our major proposal.\nIn our Hay 21 discussion, we noted that the present Foundation grant to NAEB\nwould expire June 30. We identifled—but did not then pursue—the subject\nof a short-time continuing grant which could materialize in either of two\nways, e.g., on one basis should the $3,000,000 project be approved and on\nanother should It be rejected. John Weiss had discussed this last contingency\nwith the Committee (and I believe with you) and—recognizing the problem of\npersonnel presently employed under the grant as well as other considerations—\nhad stated his belief a solution of some sort could be found. It is on this\nproblem of short-term interim financing after June 30 that i now seek your\ncounsel.\nA. Conti nuance and Termination of Fresent Foundation-Supported Series—$16ft.OOQ\nThe Committee proposed to submit a request for a two-year grant on a tapering-\noff and terminal basis during 1958-59 in total amount of $16&,O0O with $91,000\nbudgeted the first year and $75,000 in the second.\nHr. Ledter Nelson, Treasurer\nThe Fund for the Advancement of Education\n477 Hadison Avenue\nNew York 22, New York\nDear Mr. Nelson:"
}