{
  "id": "d382-166",
  "text": "->\nI — Tactics: The Pre-Show\nThe basic idea of The Whole Town8s Talking is to bring together representatives\nof an Iowa corasunity to discuss a serious local problem, to look at the alternatives,,\nweigh the costs, and arrive at a decision on a course of action.\nAfter talking with Iowa State College experts in various fields and referring\nto the community section of the project outline completed in Sejfceniber, it was decided\nto begin the series with a problem which is local in importance, yet national in scope:\nschool district reorganization®\nThere are in Iowa over 1*700 independent and consolidated school districts. Of\nthese, 833 support high schools. The median high school has an enrollment of about 75.\nThis means the average high school in Iowa has a rather limited curriculum at a rather\nhigh per pupil cost.\nIt has been suggested by various experts that more efficient use of educational\nfacilities could be made by the formation of larger administrative units. Thus two\nor more small districts would join together to elect a single school board which would\norganize the pooled educational facilities as it saw fit. This process of reorganization\ncould mean a better all around education at a lower per pupil cost. In order to receive\nthe fullest benefits from such a process, at least some of the presently operating\nhigh schools would — eventually — have to close.\nThere are many rural citizens in Iowa who feel that the closing of the small\ntown high schools would be a calamity of the first order. A student transferring\nfrom one of these schools to a larger school in another town would be forced to travel\nlong distances on poor highways, would lose out on social and athletic activities,\nwould no longer have the values of individual attention and \"home\" environment.\nThen, too, there are many rural people who insist that the economic life of the\nsmall community is directly dependent on the presence of the high school and its associated\nactivities. There is much factual data to show this statement to be not altogether\ntrue. The fight, however, has gone on in Iowa over a period of years — with \"experts”\npointing out the many advantages of the larger school and many of the townspeople\ninsisting on the intangible benefits of the small school and the value of local control\nof the small district.\nThe town selected for the first program was Cambridge, Iowa. It was chosen because\nit has the problem of declining high school enrollment and high per pupil costs, because\nthe future of the town seems closely tied to the future of the school, and because we\nhad been told that this Story County town of 600, thirteen miles south and east of\nAmes, represented the worst type of community apathy.\nOur first step was to organize a general meeting of the town. Working through\nProfessor Glenn Holmes, our chief advisor from the Iowa State College Department of\nVocational Education, the school superintendent at Cambridge was contacted. He went to\nhis school board, explaining to them that W0I-TV wanted the town of Cambridge to go\non television and discuss its school problem. The following day our production team\nwent to Cambridge to hear the school board*g answer."
}