{
  "id": "d382-169",
  "text": "V\n-6-\nto do his own researching, or at least make him more receptive to those in the field\nwho are trying to give him the results of their research. There is probably no real\nalternative to the printed word as a conveyer of ideas. We do, however, realize our\nresponsibility to present some of the more crucial issues of the subjects of our dis¬\ncussions. This presentation calls for the use of expert knowledge.\nIt would be possible for subject matter everts to appear on the program itself.\nIndeed, it is possible to make a whole program out of a discussion by experts. Since\nit is our feeling that the key value of the program lies in the discussion of com¬\nmunity problems by people who are personally involved, it seems to us that The Whole\nTown’s Talking can make the most effective use of expert knowledge off, rather than\non, stage.\nAt our first town meeting in Cambridge, £Lem Holmes was introduced to the audience\nas an expert in problems of the rural high school who was present not to represent a\npoint of view or give a lecture, but merely to answer any questions of fact. During\nthe course of the evening, in response to questions from the group, he gave short\nexplanations of the meaning of school district reorganization and consolidation, as well\nas interpretations of the limits of local school boards under recent actions of the\nstate legislature.\nAt the conclusion of our first meeting. Bob Shayon explained to the people\nthat we would have the film of the discussion processed and then we would come back\nand give them a chance to see themselves on the screen. Ten days later our second\nCambridge meeting was held in the high school room of the school. Over a hundred people\nwere present. When the film began, there was a chorus of nervous lau^iter* But after\na few minutes, the group became quite attentive — more attentive, I should say, than\nat the last Hollywood production they had witnessed at the local movie house.\nWhen the film had ended, the group were asked for their impressions® There were\none or two embarrassed remarks by individuals x*ho had used excessive gestures in their\nspeeches, and one man who had monopolized much of the early discussion said that he\nwas \"going to keep his mouth shut\" in the future. After this the mayor of Cambridge\nstood up and said that some of his ideas on school reorganization had changed since\nhe had seen the film. This led into a general discussion of the school problem which\nseemed to be somewhat more tfaou$itful than the first discussion ten days befere. The\nquestions brought up were quite specific and showed that the first discussion and the\nfilm had made a real impact on the thinking of the people. Now they wished to know\nsomething about the curriculum at a larger high school, and just what did it cost to send\ntheir children to the school in Canibridge. Glenn Homes answered some questions, but\nas we had hoped, many more questions were brought up than answered.\nA few days after this second meeting, twelve people from Cambridge were\nchosen to appear on our first television program. These twelve are above the average\nin their ability to express themselves and in their positive attitudes toward the prob¬\nlem. But on the whole they represent a fair cross-section of the thinking of the town.\nTwelve others were chosen to take part in a closed circuit broadcast on November l£«\nThe purpose of this \"dry-run” was to help us work out certain technical problems as well\nas to teach us something of the correct psychological handling of our participants®\nThe main problem, of course, is to keep the values of freshness and spontaneity and at\nthe same time present a fair amount of/factual information — all in the compressed\nspace of a single half hour."
}