{
  "id": "d382-175",
  "text": "•12*\nA number of specific criticisms were made. In general, they were as follows:\n1) Film introduction seemed too long®*\n2) Too many guests.\n3) Not enough information on the particulars of the Cambridge problem.\nk) Not enough discussion.\nWe have shown the kinescope of the Cambridge show to a number of groups. The\ncriticisms follow the pattern of the above statements. We feel these criticisms to be\nvalid, and therefore we are in the process of changing and reshaping a number of\nelements in the format of the program.\n1) The film introduction will be cut down. The number of guests will be decreased.\nThe time allotted to free discussion will be increased.\n2) The discussion will begin with statements by two individuals who have sharply\nconflicting points of view. No individual will be asked to give ”the pros-and-cons.n\nEach statement will be positive* We are not, therefore, removing other positions from\nthe field of discussion. Nor are we removing the concept of the whole group working\ntogether toward a solution. But by an original polarization of attitudes we hope to\nspeed up discussion, to focus immediately on crucial issues and to bring in more con¬\ncrete facts about the problem hand.\n3) A number of smaller changes, technical in nature, will be made with a view to\ncreating a more pointed, more dramatic \"envelope” within vhich our free discussion\nwill operate.\nThese changes in presentation will call for alterations in our pre-show process.\nWhile we will^on tinue to have the whole group of twelve participants meet to discuss\ntheir community problem with various experts, the two people picked to start the\nprogram will receive special coaching from men who will supply them with the best\nfacts, arguments and visual aids to support their respective positions.\nAn addition we are making to our pre-show process is the appointment in each\nparticipating community of a \"local producer.\" This person will be our contact with\nthe town, will work with the community organizations to publicize the program, will\nmake sure that every individual in the town has^ccess to a tela vision set on the night\nof the show• We are also working out a method whereby a number of television sets can\nbe set up in four or five rooms of the local school house, so that groups of 20 or 30\ncan watch the show together and afterwards hold a discussion on the issues raised.\nIt should be relatively easy to form such groups in towns which are actually\nparticipating in a program. The difficult, the important job is to keep such groups\nwatching and discussing the issues brought up by the appearance of other towns on\nother programs. Already in Story County, the very able county agent, Carlyle Gouger,\nis forming discussion groups in several communities which are not directly partici¬\npating in any of the chows. These \"town-talk” groups will consider the issues brou^it\nupon the series of programs as they relate to their own communities. Training sessions\nfor the leaders of such groups are being organized. Printed outlines will be prepared\nfor pre-program distribution."
}