{
  "id": "d382-197",
  "text": "ho Harley moved that Fast President Schooley be elected to serve\nout the uneapired term of President PaulUe Adams seconded.\nThe motion was carried* Schooley accepted and indicated his\ndesire to do all he could in behalf of MAEB* The Board recessed\nfor lunch at 32:00 noon*\n5o The MSB Board of Directors re-eonvensd at 1:30 p.ra. The matter\nof approval for mayorship into HAEB of San Jose College and San\nDiego State College was presented* Coleman moved that these\ninstitutions be approved* McBride seconded,? Unanimous approval*\n6« President Schooley appointed a nominating committee to select\nnominees for NAEB offices to be filled at our next annual meeting\nat Omaha* The committee is as follows:\nGraydon Ausmus, Chairman.\nEdwin Adams\nHenry Chade&yne\nWilliam Harley\nMrs* Dorothy Kiock\nNed Rosenheim\nEarl \\iyxm\n?« The consensus of the Board was that it is the intent of the\npresident and the Board members to review all actions and in¬\ntentions and any unfinished business in future Board meetings«\n8* President Schooley appointed himself to replace Paulu in all\nBIAE8 anointments and indicated that all other Paula appointments*\nof committee chairmen and ms&srs would stand*\n9* Our constitution and by-laws do not provide for automatic succession\nto the presidency* It was the consensus of the Board that certain\nchanges needed to be made in the constitution*\n1* To provide for the vice-president to serve until new\npresident is appointed®\n20 To provide for three vice-presidents in place of oa©0\n3* To clarify position of isaaodieto past president by\nindicating one who had finished serving his fully\ntorn os pro aidant.\nThe Chair referred these matters to thSvconstituUoa committee*\n10* Item 3 of the agenda had to do with fiscal problems and personnel\ncommitments raised by Fund withdrawal* Schenkkan moved that the\nPresident and the Executive Director be authorised to take care\nof moral obligations and other business in accordance with funds\navailable* It was seconded by McBride and passed unanimously*"
}