{
  "id": "d382-201",
  "text": "July 25, 1958\nCONFIDENTIAL\nF.E.S.:\nThere’s some clarification of Ford position versus TV in letters from Heald,\nfollowing meetings of Heald, Armsey and Faust with Calkins, now serving as\nETRC Board Chairman.\nSeems Center may get up to U or 5 million more. But not for public information,\nor in-school. They seem to feel much of in-school stuff can be done by commercial\ninterests (I).\nWant to urge strenthening local roots, and now seem again to favor some adult\ned.\nThe three areas of support seem to be, for a while:\n1) closed circuit. , . n „\n2) Development of ETV stations, still, for exchanges and including general\nas well as school programs.\n3) Increased concentration of Center, solely as exchange of pgms. center.\nThis last is somewhat of shock to them.\nThis from Hull, confidentially, by phone. As we finished, he agreed.to my\npassing on to you, and will send some parts of letters, with salutations,\nletterheads, etc. cut off—as a policy statement only. This will I hope\nclarify my hasty phone notes.\nHull feels he’ll be forced to react to suggestions (Wednesday ETRC Board or\nExecutive Committee meeting, July 30) growing out of Witteoff long-range\nplan draft, for possible consolidations. He wanted help and guidance.\nReminded horni of Network as income-producing, and that we’d need quid-pro-quo\nneed if we gave up. Concern exists about unecomical use of radio funds.\nHe’s*inclined to think stationing of an NAEB man at the Center to.handle,\nthis* on their staff,might improve it, if he’s full-time. Told him he might\nJfRheir. reaction, or see if the $100,000.00 could be turned over again to us\nto handle—if there’s such concern. I doubt if the ETRC could do this.\nFor the rest, he’ll remind ETRC Board that only the NAEB Board, not he, could\nagree to consolidation, on a specific plan basis, worked out jointly by the\ntwo Boards as equals.\nThis was the best I could do. You might want to call b±m. to discuss.\nHope you had a good vacation. See you.\nHarry J. Skomia\nHJS:cmc"
}