{
  "id": "d382-206",
  "text": "!*. Sheldon Williams\nManaging Director\nBlender-Tongue Foundation\n9 Ailing Street\nNewark 2, New Jersey\nDear Hr. Williamst\nlour letter of July IB was awaiting my return from vacation, and I hasten\nto reply*\nI think a scholar ship program would be extremely timely* For several\nyears we have offered scholarships far advanced study for ETV (production,\nengineering, staging and lighting, teacher training, writing, management,\netc*) and have an established program to which people naturally turn for\nsuch grants* We also have a professional adnuiw«snt committee experienced\nin administerjjig tr&se grants. The reason I mention these is that our\nagreement with the Ford Foundation is currently expiring, and we would be\nglad to cooperate with you in administering comparable programs* Ford\nhas always been given full credit as the source of funds for this program\nand in all publicity, of course. If we can be of any help to you in such\na national progrma, please feel ftee to call on us*\nCourses in teaching techniques by TV began to develop this summer. We\nare this week rtasnlng a national seminar at Purdue Iteivarsity in utilisation\n(for teachers, broadcasters, and teacher trainers) because no fully national\neffort of adequate proportions has developed. I could not mention any\ncolleges which have a fully developed program in this yet, with the possible\nexception of Peabody College in Tennessee* In this area too we should be\nglad to work with you.\nAlthough this next suggestion may not be wholly interpreted by you as\nassistance, I might mention the availability to you of an Xadfcfctrlal Affiliate\ncategory (only recently created) in the HAEB. This provides several copies\nof our Newsletter. Journal and other publications as they are issued* At\nour upcoming convention in Ckaaha in October, at the Sheraton Pcntenelle Hotel,\nwe are pleased to pay the rental for industrial associates, such as Motorola\nand RCA. Each such exhibit is plainly labeled with an NAEB Industrial Associate\nsign, which, without constituting positive NAES endorsement, certainly shows\nour several hundred members where our appreciation lies, mod does affect the\npurchase habits of our sons 130 member radio and TV stations and schools."
}