{
  "id": "d382-3",
  "text": "Page 2\nviia second challenge was more pointed* .Addressing the NA3SB as the established\nassociation to which the world has com to look for leadership* in genuinely\neducational uses of radio and television* he said* \"I wish to suggest as a special\ntask for you (in the face of an educational crisis that is world-wide)---* that you\ngo all out to prove how well the challenge can be met, by undertaking acre and\nmore courageous experimentation, by systematic expansion of your established\npractices and, particularly, by offering exchange reports on the technical and\npodagogioal problems solved by your efforts* You have the means to do this and\nif you ever wish to give a lead to the world in the enlightened use of mass media,\nthis is the place to do it, and thia is the tima.\"\nSr* Ojeadal pointed out, however, that much of what must be done in tbs\nworld in tills area in the next ton years must be done/by radio* In rations\nwhich most need our materials, television Is at least ten years away* \"For\nfinancial and technical reasons, sound radio is bound to dominate the field in\nthese parts of the world for years to cam, even if television could give more\neffective help* The challenge of today is in radio — (although) sooner or\nlater television will also come to these countries, and one should be prepared\nfor its full employment for educational purposes*11\nSpeaking still to the NAEB, Dr* Ojesdal urged: \"I would really hope that\nyou will undertake a series of truly international seminars on the uses of\nradio and television for higher education in all countries. **you will certainly\nhave our full support far such systematic efforts as you may decide to launch*H\nfie called for our help in the World Radio Conference being called by the\nInternational Union of Teleccaaiunications. \"We hope to define, to some extent,\nthe position of radio (and eventually television) broadcasting in contemporary\ninternational society —— as UNESCO has previously dono in the field of the\npress.n\nHe called on us as the \"enlightened professionals\" to stimulate and direct\nmore mass media research* \"National groups frequently lag behind — to the great\ndisadvantage of National Commissions which may then have to deal with our issues\nwithout the benefit of the best professional advice •\"\nUNESCO’S appeal to the NAEB to rise to the needs of our time have been\nechoed by the Voice of America, and by the appeals of educators in many nations\nto provide them guidance, consultants, materials, and other assistance* Our\ninability to do this,; because of financial and staff inadequacies, is one of\nthe most frustrating experiences the NAEB has had to face during the past five\nyears*\nThe NAEB believes, as it has always believed, that radio as well as television\nmust be developed as an educational tool if each medium is to be used for what it\ncan best do; and if the practical interests of economic and eventual frequency\npressures are to be met. It believes that closed-circuit TV, open-circuit TV,\nFM, radio, UHF and all types of educational stations are part of a movement\nwhich must remain inseparable if America® s best interests in education are to\nbe served. We believe that the many studies already available, in which radio\nend television can be used together, or in which one medium is far better than\nthe other, demand this inseparability* We believe it well so to state, for the\nrecord, at this critical time."
}