{
  "id": "d382-5",
  "text": "The NAEB therefore requeB\nfor the following purposes®\nThis\nbuilding.\nfive-year grant in the amount of $3*229^050.00.\n<h\nSUe^T\nCapital (non-recurring) ^50,000.00\nwill be need for acquisition of land and cons traction of a Headquarters\nPreaant space, in the sububasoeeat of Gregory Hall, on the campus of the\nUniversity of ZUinoia, was assigned seven years ago at the tire the NAEB\nstaff was composed of earns five people* All Headquarters personnel, the\ntelevision engineer, placement service, and secretarial personnel and equip,\nrentiers now housed in a single snail room in which efficient operation and\napace for adequate files or the preservation of program tapes of past programs,\nare impossible. The entire Radio Network is operated out of a second small\nroom adjacent to the Headquarters office. The inability to hold conferences\nor even conduct telephone conversations in a satisfactory manner under such\nconditions make it imperative that the space problem be met before any\nadditional expansion is contemplated* Now thirty-throe years old, the NAEB,\nas the professional and trade association in educational broadcasting, must\nhave its own permanent home if it has any ambitions to be nationally and\ninternationally adequate in its role. Specific location of the proposed\nNAEB building will be decided on the basis of Policy Council and Board\ninvestigations*\n2. Administration\n£\n/\nr*\n$65,000 per year\nTotal $260,000*00 for 4 years\nThis la essentially a continuation of the present Headquarters operation\nstaff* Since this will be continued through June 30, 1959, under our present\ngrant (for the eighth year) of the V. K. Kellogg Foundation, this Item only\nIs requested for only four years, beginning July 1, 1959, and extending\nthrough June 30, 1963,\"!Sr a total of $260,000.00* The breakdown for this is\n$44,000,00\n% 6,500.00\na and Expenses $ '3,000.00\nBuilding Maintenance\nEquipment\n$7,500.00\n$1,000.00\n$3,000.00\nDirectors, plus four\n_are those of the Executive and „ .\nsecretarial and receptionist personnel, including retirement and workman^\nocpe^Uon.\nTechnical and Engineering t 35,000.00 per year\n175.000*00 5 year total\nThis, too, isfa jxmtimiation. wltn'\nof present NAEB\n“if.\nM\nengineering s&vjces. It includes the salary oftha Coardinator of Technical\nServices (now TV Etaginaeriat $14.000 per gear, plus secretarial assistance,\n~~ i andT\nand necessary travel,\nfollowst\nsuppliesfimae^pessai, and printing previsions, as\nHf\nSalaries\nTravel of Coordinator\nTravel (Committee, Seminars)*\nSupplies and Expenses\nPrinting, Publications\n*to be supplemented, for larger seminars!\n$22,000.00\n4,000*00\n4,000.00\n2,000.00\n3,000.00\nfrom item 8, page 8* “Professional\n.)\n7VttT"
}