{
  "id": "d382-86",
  "text": "Main Section of Request to Ford Foundation\n(from original by FES dated U/1&/5G)\n1. Gontixmation of the Engineering Consultant Services.\nEngineering services would be provided stations, primarily tele¬\nvision, to help them solve special technical problems arising\nin operation of studios and transmitters. These services would\nbe provided primarily for the operating station or for one\nabout to go on the sir. This program would be operated to\nhandle such requests whether cooing directly to KAE3 or through\nthe Center or through the JCET office.\nIn the past two years this service has been supported by grants in\nin the amounts of f30,00 each for one year, by the Fund for\nAdult Education. Its services are available to the 20 educational\nTV stations now on the air. It is anticipated that NAEJ3 will sup-\nany engineering consultant services after January 1, 1957, that\nhave previously been supplied by the Center. These services can\nbe supplied without an increase in the amounts previously avail¬\nable to NAEB for engineering services.\n2. Continuation of the Management Consultant Service.\nThis service is available to all educational television and\nradio stations, but is used primarily by television stations.\nMost such problems have been solved by the educational radio\nstations during the past 30 years. The sum requested is\nf2,000 less than that made available by FAE during the past\nyear. An equally good service can be performed for less money.\n3* Continuation* of two Educational Television Seminarsorkshops,\nbut concerned with program production problems other than those\nconsidered ati the production workshops which have been held the\nlast three years on grants from the Fund. The seminars-workshops\nwould be held in two of the following three areas: (a) A Seminar\nfor Program Planning, including the planning, writing, and direct¬\ning problems. , In this seminar it is proposed to bring together\nstation personnel now doing these types of work to exchange in¬\nformation, and also have resource personnel available for con¬\nsultation. It is planned to work cooperatively with the Center\nstaff in order to have the most productive seminar possible.\n(b) A seminar-workshop on special problems of staging and\nlighting. Or, (c) a seminar-workshop on Art and Graphics for\neducational television programming.\nIt is planned, in consultation with the Center, to hold those\nseminars or workshops that will give the greatest impetus to im¬\nproved programming and for the professional advancement of person¬\nnel in all the educational television stations and program pro¬\nduction centers. At one of the seminars, at least, an effort\nwill be made to bring in the younger staff members of educational\ntelevision stations and production centers in order that future\ntalent can be started on the upgrade at a faster pace.\n£30,000\n£ 5,000\nfl6,000"
}