{
  "id": "d382-9",
  "text": "Toaoher and Bdacational Develops* and TAj>4fffTiT\nPage 8\n$ 41 ? 500.00 per year\n8l(X^&0f6€ for 5 . -sara\nDuring the present period of frantic trial and error and sometimes what might\nalmost, be termed \"etopedotr on the? part of administrators, TV teachers, and\nteachers in systems using TV, the absence of a central notional office which\nmight assist them in any significant my is particifLarly regrettable. Much\nenergy is being wasted, arch effort is being duplicated or contradicted, and\nmany aesomsay adsauderatandinga, claims and counter-cl alas result from the\npresent confusion. Ci eu h e s os i rlcsc foc&tian .ft . r: C h\\\niesear^h Pacc.urtsaLatjgaax>eod. & useful asrvise could be\np* and Seadbsire^Sa needed fornmhainistrausrs, tVIS\nmd teacher-users, alike.\nTeachers Colleges and Universities and Colleges should be ercooragsd and\nassisted to provide the type of courses and training necessary to meet wholly\nnew problem of education end curriculum revision in an electronic age, Adult\neducation,now too often patterned on seheaL-rcoBi practices designed for children,\nneeds desperately to learn to use these new tools.\nAll these groups currently beg the MSB each month for assistance. Unfortu¬\nnately the present staff and resources of the Association are inadequate to\nprovide this needed assistance.\nWe therefore request funds for the estabilistont of a Teacher and Educational\nDevelopment Department, staffed and budgeted as follows*\nSalaries\nCoordinator\n$13,000,00\nStenographic Assistance * *\nRetirement end U. C.—\n4,000,00\n1,300.00\nTravel\n3,000,00\n•\n12,000.00\nSupplies end Exphnsas\n5,000,00\n3,000.00\nTotal\nmzmzn\nThis Department will ba able to provide teachers associations and conventions,\nthe ACE, the NEA, Audio-Visual groups and individual teachers and school\nadministrators the type of materials, consultations, training sessions and\nother assistance which soseone should ba providing if ifesricsn education's\npresent fleuader&ag* efforts jaro to be given organization and order, Bar this\npost, as for others requested, a recognised specialist, not necessarily a\nbroadcaster, is needed —/one who will earn and command the respect of\neducators, U^f\\/4\nProfessional Advanoeeaent Department\n$109,000,00 per year\n$545,000,00 for 5 years\nEducational broadcasting is becoming,, but is-not jpe^, a profession. Each year\nthe HAEB Professional Advancement Gaeaaitteo has called for the appointment of\na Director of Professional Advancsinant to coordinate the many training activi¬\nties (Scholarships, Seminars, Workshops, etc,} the need for which the NAEB\nseefc3 to fill,\n4uo In-\nm n t?U. q) &>,\nIaHU /nuut j <0\nWi d-tc , Ao Z^o suL*uy^uj AceJu+bJ?) Zj /\n<U*2JfL*LcC-k brejz /facyfat cA"
}