{
  "id": "d382-90",
  "text": "-2-\nAAACE: The American Association of Agricultural College Editors\nWe exchange publications, studies and correspondence with this\ngroup, and cooperate in every way possible, usually through channels of\nthe NPAC.\nAAAS: The American Association for the Advancement of Science\nWe have cooperated with this group in a project (outlined in the\nACTIVITIES AND RECOGNITION section) investigating the uses of the wire¬\nless media for science instruction. This involved attending one meeting,\nconducting a survey of member station programs, and considerable corres¬\npondence .\nAACTE: The American Association of Colleges for Teacher Education\nRelations with the AACTE began only during the year. They have\ngrown out of the increased interest of these groups in the role which new\nteaching aids such as educational television should play in teacher education.\nThe need and desirability of our providing all possible materials and assist¬\nance to them are obvious.\nAAPSS: The American Academy of Political and Social Science\nThe Executive Director is a member of the Academy, has participated\nin several of its meetings and has served in various informal consultative\ncapacities in areas related to radio and TV.\nAASA: The American Association of School Administrators\nWe were this year unable to attend the annual convention of this\ngroup. However, we did provide materials and assistance in setting upior it,\nspecial sessions on ETV for the administrators interested. We have also\nassisted the AASA in numerous other ways and studies throughout the year.\nAAUP: The American Association of University Professors\nThe Executive Director is a member of this group, as are various\nofficers. Former NAEB President Schooley is a former president of the Univer¬\nsity of Illinois Chapter of this Association.\nABC. CBS. NBC\nThe three national commercial networks, with all of which we have\nexcellent relations, have all at some time or another carried NAEB network\nproductions. We have also taken for broadcast on the NAEE Radio Network\ncertain of their productions, the most notable being an NBC Children*s litera¬\nture series carried during 1956-57, Representatives of the networks, as well\nas of such organizations as the Westinghouse group, have been frequent guests\nand speakers at NAEB conventions and seminars during the past year."
}