{
  "id": "d732-105",
  "text": "NORTH CAROLINA\nNorth Carolina is largely a state of small towns and rural commu¬\nnities. However, in the central part of the state is the so-called\nPiedmont Crescent, a highly urbanized area stretching from Charlotte on\nthe southwest to Winston-Salem and Greensboro on the north and Durham\nand Raleigh on the east. There are eight centers in North Carolina with\npopulations of over 100,000 and 26 areas with population of over 50,000.\nThe bulk of this population lies in the central part of the state.\nNorth Carolina has 38 four-year colleges and universities and 16\ntwo-year colleges with a combined enrollment of approximately 66,000\nand a public school enrollment of over 1,900,000.\nThere are eight television channels reserved for educational tele¬\nvision in North Carolina, but only VHF Channel 4 at Chapel Hill has\nbeen activated. The Consolidated University of North Carolina (which is\ncomposed of the University of North Carolina at Chapel Hill, North\nCarolina State College in Raleigh, and the Women’s College at Greensboro)\nowns and operates Channel 4, with microwave interconnected studios on\neach campus in these three cities.\nThese production centers which feed the Channel 4 transmitter in\nChapel Hill service the in-school television instruction of the surround¬\ning North Carolina communities. The programs are fed also to six commer¬\ncial stations which voluntarily carry the broadcasting during certain\nhours of the day. This one transmitter with its three interconnected\nstudios has done a very effective job on both the school and college level\nin North Carolina, but there is a demonstrated need for additional service\nand several plans have been put forward to accomplish this.\nOne proposal was for the establishment of 10 translator stations\nin the western part of the state extending from Albemarle in the west-\ncentral portion through Charlotte; Gastonia and Shelby on the south and\nthrough Canapolis, Statesville, Morgantown, and Hickory; and on the north\nto Asheville and Hendersonville at the focal point in the extreme western\npart of the state.\nSurvey consultants learned that the Consolidated University of North\nCarolina and the State Board of Education had done some exploring of the\npossibility of joining forces with a common state commission for educa¬\ntional television, in order to get done the collective job they estimate\nneeds to be done. Indications from these sources are that to properly\nservice North Carolina at least two VHF channels will be needed in the\neastern part of the state, and approximately 15 UHF channels to the west\nof the present operation. These would be channels of varying power.\nMany would be of low power. This would provide only for the single basic\nservice to the various communities in the rough mountainous terrain of\nthe northwestern part of the state. To provide for complete in-school\ninstructional services at the various grade levels, in the future, as\nwell as for higher education, it would be necessary to at least duplicate\nor parallel the basic system."
}