{
  "id": "d732-110",
  "text": "Other UHF channels in certain areas would have to he\nchanged hy similar requests from non-reserved status\nto educational use.\n\"In all probability the minimum of one year would be\nnecessary following any enabling action to establish\nthe required pattern of channels through the rule making\nprocess of the Federal Communications Commission. In\nsuch cases where channels have already been reserved for\neducational use activation through construction of\nfacilities would typically require a period of about one\nyear. Experience gained in connection with the program\nas it develops should be put to use with such modifica¬\ntions of this broad study as may be required. In par¬\nticular the coverage areas of the stations predicted\ntoday may in a few years prove to have been too conser¬\nvative. This would be true if the expected sensitivity\nimprovements, which seem possible in UHF receivers, become\neconomically practical. Such developments may nullify\nthe need for certain of the intermediate and lower-power\nstations. Other developments, however, may lead to the\nestablishment of additional program centers and trans¬\nmitters to meet the local needs in additional communities.\"\nThe proposals in Ohio would require the addition of at least 20\nchannels to the state in order to provide this basic single channel net¬\nwork system. But these 20 and 9 channels that would then be available\nto the state would provide only the single system. Extended use of\ntelevision instruction at the various levels in the schools and colleges\nwould require more than one channel for adequate servicing. In some\ninstances it would require three or four channels. Therefore, it is\nevident that the 29 channels initially proposed on the basis of present\nuse in Columbus, Cincinnati, and Toledo, and the proposed use in such\nplaces as Cleveland and Akron, would be inadequate; more must be provided\nfor the future use of educational and instructional service. A minimum\nof 58 additional channels is needed for future educational purposes in\nOhio,\nOKLAHOMA\nOklahoma has two large population centers in excess of 100,000 and\nseven small centers. Approximately two-thirds of the people: live in\nsmall communities and rural areas, which presents specific problems in\nthe equal distribution of educational opportunities and facilities.\nOklahoma has 18 four-year colleges and universities and 13 two-\nyear colleges with a combined enrollment of approximately 50,000. Public\nschool system enrollment is approximately 514,000.\nChannels 13 and 25 in Oklahoma City and Channel 11 in Tulsa have\nbeen activated for educational instruction. These stations are part of\nan educational television network which is eventually expected to cover"
}