{
  "id": "d732-115",
  "text": "- 108 -\nDr, Konick says Pennsylvania is currently developing a plan for\nfull utilization of the potential of television through development of\na state-wide network and by maximum use of the presently available\nfacilities now on the air. He says that for this reason sufficient\nchannels need to be reserved for educational use in Pennsylvania and\nsuggests at least 14 additional UHF channels for the use of the State\nColleges alone,\nPennsylvania responses to the survey provide adequate justification\nfor a general VHP station in Philadelphia or in the Philadelphia vicinity,\na VHF station in the vicinity of Erie in the northwestern part of the\nstate, and a VHF station in the central part of the state at University\nPark, and a VHF station in the northwest in the vicinity of Scranton,\nIn all these areas there are large numbers of institutions of\nhigher learning, in addition to the public school systems which, accord¬\ning to the State Department of Education and local school administrators,\nneed additional assistance in strengthening their curricula.\nDevelopment of these needed stations, provision of the additional\nchannels for the State Colleges as suggested, dual channeling on the\nmajor stations for in-school purposes, and provision of at least primary\nconsideration of smaller population centers such as Harrisburg and\nLancaster, Chambersburg and Altoona, and Oil City would require an addi¬\ntion to the allocations for education in Pennsylvania of four VHF chan¬\nnels and 2k UHF channels.\nRHODE ISLAND\nRhode Island, the smallest state, has a large educational problem.\nIt has nine four-year colleges and universities, and one two-year\ncollege, with a combined enrollment of approximately 18,000. Its public\nschool enrollment is approximately 125,000. Rhode Island is a part of\nthe densely populated area from New York to Massachusetts,\nThe one television channel reserved for education in Rhode Island\nhas been assigned to Providence. This is UHF and not compatible with\nmost of the receiving equipment.\nRhode Island colleges responding to the survey indicated need for\na VHF channel for the use of education in the state. They indicated,\nalso, a readiness to cooperate with one another in the development and\nuse of such a channel.\nThe Governor of Rhode Island recently established an educational\ntelevision advisory committee to study the problems incidental to the\nestablishment of an educational television service for Rhode Island,\nDr. Michael S. Walsh, Commissioner of Education for Rhode Island, says\ninstructional needs exist in the public schools for elementary science\nand teaching of foreign languages, both of which could be helped by the\nuse of television. He adds that adult education needs could be met, to"
}