{
  "id": "d732-119",
  "text": "- 112 -\nthe public school systems of Rapid City as well as the\nUniversity of South Dakota, Augustana College, Northern\nState Teachers College, and Dakota Wesylan University\nare cooperating in an effort to develop educational\ntelevision. In the past ten years, the cost of education\nin the public school systems of South Dakota has doubled,\nand the anticipation is that this will happen again in\nthe next decade. Means are going to have to be found to\nprovide the best education possible. This is not due to\nprimarily an increase in enrollment but in rising costs\nof living.”\nCoupling the newly evinced interest in the legislature with the\nefforts being made in the State Department of Education and in the insti¬\ntutions of higher learning, it can reasonably be inferred that educa¬\ntional television will be developed on a state-wide system within the\nnext few years.\nThe survey reflected need for a VHF channel in the western part of\nthe state in the vicinity of Rapid City, with some low-power UHF stations\nto take care of repeats in places like Mitchell and other small centers.\nOn this basis there is justification for at least 10 additional channels\nfor South Dakota’s future educational needs.\nTENNESSEE\nTennessee has four areas of over 100,000 population and five of\n50,000 or more distributed evenly across the state. It has 33 institu¬\ntions of higher learning with an enrollment of approximately 54,000.\nTen of the institutions are located in Nashville and seven in Memphis.\nThe large state university is at Knoxville. The public school enroll¬\nment is nearly 800,000.\nExtension teaching by television is carried on and one station,\nWKN0-TV is in operation at Memphis. A state commission for the explora-\nP°ss:^ble uses of television also administers a state appro¬\npriation of $50,000 annual operating funds for each community that has\nan educational television station. Up to now only Channel 10 in Memphis\nhas used the fund, but the Nashville and the Davidson County schools\nreport progress toward activating Channel 2 in Nashville.\nChattanooga, Nashville, Knoxville, and Memphis all have regularly\nscheduled classroom lessons by television, utilizing the commercial\nstations in all cities except Memphis,\nThe State Commission had an engineering survey made in 1953 which\nresulted in the reservation of eight channels for education in the state.\nFour are VHF and four are UHF channels, but two of the VHF reservations\nare in isolated areas and could be used only as satellite or relay\nstations."
}