{
  "id": "d732-123",
  "text": "- 116 -\nDr, L, D. Haskew, Vice Chancellor of the University of Texas, in\nreferring to the need for potential multiple channels, writes:\n\"The expansion of in-school and in-college broadcasts is\ndependent upon the development of proven materials. Mate¬\nrials may be video-tapes; they may be teachers who have\nproduced an effective format and technique for presenta¬\ntion of a given subject. When such ’material* appears it\nis rapidly used either by reproduction, or imitation or\nadaptation# Witness the rapid increase in the number of\neducational television stations carrying instruction in\nforeign language, in chemistry, etc.\n\"Wow, every time a subject is developed to the point\nwhere telecast seems profitable, a thirty minute or one;\nhour slice of a channel is tied up for that one subject.\nIn effect, then, when fourth grades of a broadcast area\nare receiving arithmetic, no one else in the area can\nreceive anything else. As ’materials* increase in number\nand variety, the pressure for simultaneous channels will\nmount and mount. In fact, unless they can mount, the\nschool systems and colleges will be increasingly reluctant\nto stake much of their success on televised instruction.\nCertainly, we have a parallel in closed-circuit use at the\ncollege level. At our main University, for example, we\nalready need triple channels. At our dental branch, twin\nchannels are hardly enough to carry what we have already,\nand other subjects are standing in line to get on the net¬\nwork. \"\nR. F. Schenkkan, Director of Television at the University of Texas,\nwrites: '\n\"We believe that by the use of broadcast television, which\nwill be available to use in January 1962, we may serve a\nvery useful purpose in providing better preparation in such\nareas as English and Mathematics for students about to\nenter the University. However, we feel that broadcast tele¬\nvision may serve the community more usefully in the areas\nof elementary, secondary and general education. We feel\nthat television channel space should be preserved for the\nfuture use of the educational institutions in our area.\nIndeed, it is our conviction that the single VHF channel\nnow available to the San Antonio-Austin area will not be\nadequate in the years to come for all needs. UHF reserva¬\ntions need to be continued.\"\n.. . ^,the Seneral survey, the school systems in Texas responding indicated\nthat 'Jy/o of them were either using broadcast television, or planning to\nuse it, to meet instructional needs. In the area of higher education,\nof 27 colleges and universities responding, three indicated that they were\nnow using broadcast television, nine that they plan to use it, and 25 said\nthat they could see future needs for television in their institutions."
}