{
  "id": "d732-129",
  "text": "- 122\nalternative educational television systems; to employ tele¬\nvision teachers; to assist state institutions in planning\nand teacher training for the utilization of the medium; to\naccept, expend, and allocate funds and equipment from\npublic and private sources for use in an educational tele¬\nvision network for the state*\"\nThe commission’s work was successful to the extent that its recom¬\nmendations were approved by the State Senate unanimously and by the House\nof Delegates, with only four dissenting votes. The educational television\nbill was not approved by the governor because of legislative action which\nresulted in the demise of a 3$ sales tax from which the educational tele¬\nvision appropriations were to be derived. The term of the commission\nexpired with the failure of approval of the legislation by the governor.\nAt the present time in Virginia there is no central state authority.\nThere are groups representing a large potential for the future:\n1* In Richmond, Superintendent W. I. Willis, of the Richmond public\nschools, is spearheading an effort to establish a station in that area.\nSuperintendents in the surrounding counties have agreed to a $1 per pupil\nfunding system. Some funds are reported on hand and other capital funds\nin prospect, apparently sufficient to lend promise of success for the\nstart of a station in Richmond, survey consultants were told.\n2. The College of William and Mary (which includes the College of\nWilliam and Mary in Williamsburg, Richmond Professional Institute in\nRichmond, and Norfolk Division, and two new junior colleges) is developing\na video-tape exchange system with closed-circuit television installations\non each campus. The video-tape recorder and central production studios\nwill be on the Williamsburg campus. The College of William and Mary,\nwith five campuses distributed through the Tidewater area of Virginia\nfrom Richmond to Norfolk, has the potential to serve as a pilot network\nfor the state.\n3. Virginia Polytechnic Institute is interested in network arrange¬\nments for the southwest Virginia and for a means of interconneting its\njunior colleges and extension center, and reaching into mountain communi¬\nties.\n4. Norfolk Public Schools in cooperation with adjacent county and\ncity school systems in the Hampton Roads-Chesapeake Bay area have acti¬\nvated a station on Channel 15 to serve the schools and communities of\nthat area.\n5. Virginia Educational Television, Inc., a lay-group of interested\ncivic leaders, legislators, and educators, while lacking the authority of\nan appointed commission, has potential strength to guide action.\nInformation derived from these sources reflects the great interest\nVirginia has in educational television. The University of Virginia during\nthe summer of 1961 had a workshop in the Hampton Roads area to orient"
}