{
  "id": "d732-132",
  "text": "- 126 -\nMr. Marvin J. Schroeder, Superintendent of the Ellensburg Public\nSchools, said:\n\"Our system is most interested in the possibilities of\nclassroom television to enrich teaching programs. I see\nthe use of television as a means of putting into practice\nthe concept of team teaching. To fail to anticipate the\nuse of television and to make those provisions now which\nwill permit us development in the years ahead would be a\ngross error.\"\nThe above expressions are typical of those which were received from\nWashington school superintendents. There was no dissent on the useful¬\nness, and the need for instructional television in their systems, and\nparticularly in the years immediately ahead. Some of the smaller school\ndistricts indicated that, lacking any experience with television and\nlacking time to investigate it thoroughly, they had done little toward\npromoting it. This attitude generally was confined to those areas which\nhave had no contact with either general educational or instructional\ntelevision.\nSurvey data from the schools, the universities, and the Washington\nEducational Television Association indicate that the development of\nstate-wide television which will serve all of these school districts and\nall of the institutions of higher learning in Washington will not be\nrapid. The first development will follow those already established on\nthe east coast. The extension of the university program, by microwave\nand cable to translator systems, into the central and eastern parts of\nthe state could come before further extension of the broadcast channels.\nBut equally indications are that however slow, the development is inevi¬\ntable, and the general sentiment expressed by respondents was that the\nstate should be prepared to meet the demand when it arises.\nOn the basis of the information received in the survey from various\nsources, and compiling the needs indicated by the schools, the colleges,\nthe communities, and the Washington Educational Television Association,\nWashington will need a minimum of 36 additional channels for educational\nand instructional television service within the next 10 to 15 years.\nWEST VIRGINIA\nA number of problems in relation to educational television as well\nas in relation to education occur in West Virginia.\nWest Virginia is one of the few states which has lost a significant\nshare, more than 7$, of its population during the last 10 years. It has\ntwo centers of population of over 100,000, but 75# of its population\nlives in small towns and rural areas.\n^ West Virginia has 17 colleges and universities with a total enroll¬\nment of approximately 26,000. Its public school enrollment is approxi¬\nmately 450,000. It has four television channels reserved for education,"
}