{
  "id": "d732-135",
  "text": "- 129 -\nLj\nVw\nfor such an educational television network has not been forthcoming. In\nthe meantime, the development and experiment action on all levels of edu¬\ncation are continuing.\nThe University of Wisconsin at Madison reports:\n\"The University of Wisconsin operates WHA-TV (Channel 21) for\nthe purpose of experimentation, research, and program develop¬\nment. We broadcast 20 hours per week, approximately, with a\nschedule that includes both in-school and general adult edu¬\ncation. At the present time experimentation with formal\nUniversity course instruction is conducted on a closed-circuit\nbasis. In the past, however, credit instruction has been\noffered through broadcast television and will be again in the\nfuture.\n\"The University proposes during the next biennium to:\n1. Increase the coverage of Channel 21 through the relo¬\ncation of the tower and increasing power.\n2. Establish a microwave link with educational television\nChannel 10 in Milwaukee.\n\"We foresee the need in the future for the allocation of addi¬\ntional educational television channels to provide for the inter¬\nlinking and reception between the Madison campus and the\nUniversity of Wisconsin at Milwaukee, and extension centers and\nstate colleges throughout the state. In view of increasing\nschedule pressures on existing television channels in Wisconsin,\nit appears necessary in the long range to provide for educa¬\ntional channels in addition to those already in operation or\nreserved.\"\nThe Coordinating Committee for Higher Education in Wisconson is\nresponsible for development of a long-range plan for higher education in\nthe state. A subcommittee of that group includes in its deliberations\nnoLU^f+hDetSTS-°f t^eV^3l0n ln long-ranse planning. Dr. L. H. Adolf son.\nDean of the University Extension Division and Chairman of the Joint Staff\nCommittee on Educational Television for the coordinating committee for\nhigher education in Wisconsin, says:\nThrough the experience of channels in Madison and Milwaukee\nit has already been established that television has served '\nwell the instructional purposes of educational agencies in\na variety of ways and at all instructional levels. With the\nincreasing demand for educational opportunity manifest in\nmounting enrollments and a growing interest in adult educa¬\ntion, we feel certain that television will continue to have\ncontinuing utility as an instrument of education."
}