{
  "id": "d732-143",
  "text": "- 138 -\nENGINEERING REPORT\nThe Federal Communications Commission in its Sixth Report and Order\nissued in April, 1952, reserved a number of television channels for educa¬\ntional use. At present the Table of Assignments contains 275 channels in\nthis category. Educators have been urged to define their needs for a\nnation-wide system which would require the addition of a number of channels\nto this reservation category. A state-by-state study has been made of such\nneeds by the Rational Association of Educational Broadcasters and the\nlocations in which channels are necessary for this purpose have been defined\nfor engineering allocation study. The existing Table of Assignments has\nbeen used as a source of channel locations. Maps and tables have been pre¬\npared to show how educational needs could be met in part from the existing\ntable.\nThe National Association of Educational Broadcasters has supplied 48\nstate maps defining locations of major school districts, universities, and\ncommunities of 50*000 population and above. First priority in the engi¬\nneering portion of the study was given to supplementing the existing 275\nreservations with additional channels to provide a nation-wide single\nservice on an over-all area basis. Secondly, channels were recommended\nfor major school districts in communities of 50*000 population and above,\nwhere such concentrations were not centers of attention under the area\nplanning stage• In the third phase, attention was given to multiple ser¬\nvice needs and major schools and universities not covered tinder the first\ntwo priorities. In all cases, where feasible under the existing Rules of\nthe Federal Communications Commission, VHF channels have been requested.\nGENERAL ALLOCATION CONSIDERATIONS\nAt the present time there are about 2,200 assignments in the Table\nof Assignments contained in the Rules of the Federal Communications Com¬\nmission. About 720 of these channels are in use or have been applied for\nas commercial outlets. Another 275 have been reserved for educational\ntelevision use and 60 of these have been activated to date. Forty of\nthese are VHF outlets and 20 are in the UHF portion of the spectrum.\nFundamental to a determination of the necessary number of additional\nchannels to meet the educational needs as defined by NAEB is the coverage\nwhich may reasonably be expected on the various types of channels. National"
}