{
  "id": "d732-16",
  "text": "ORGANIZATION AND PROCEDURES\nThe survey organization consisted of a director, a corps of regional\nconsultants working in the field, an advisory committee of outstanding edu¬\ncators, the consulting engineers, and the various staff members of the\nNational Association of Educational Broadcasters.\nAn initial meeting of the Advisory Committee and several individual\nconferences with its members crystallized some of the major problems of the\nsurvey and indicated the procedures.\nIt was determined that data should derive from several sources:\n!• Local college and school administrators in the various\nstates\n2. State Departments of Education\n3* Controlling agencies for higher education in the various\nstates\n4. Controlling state agencies for educational television\n5* Administrators of active educational television stations\n6. Informed community leaders, and representative community\ninterests\n7* Representative national educational agencies\nThese data sources were then provided with background information to\nhelp them establish mental latitudes within which they might relate their\ncontemplated educational needs with television needs. The significance of\nthe survey was explained to them in an individual letter or in a general\ninformation sheet. All sources contacted were requested to furnish infor¬\nmation, opinion, and projection solely on the basis of need and not to\nweigh their responses with the factor of budget.\nIt was emphasized that this survey sought simply to determine the\npotential need of education for spectrum space. In many instances a sug¬\ngested list of criteria for evaluating educational needs and relating them\nto television needs was offered. Principal criteria offered were:\n1. Expected increase in enrollment during the next 10 to 15 years,\nand the impact of increase on the potential supply of instructors and\nphysical facilities and financial resources.\n2. Possibility and effect of combining use of instructional resources\n(human and physical) with other institutions or school systems, through the\nextended and cooperative use of broadcast television."
}