{
  "id": "d732-22",
  "text": "Some of this legislation actually provided for state support of edu¬\ncational television construction and operation. Some of it provided\nmatching funds and guidance to the localities, and some of it consisted\nof enabling acts which made it possible for school systems and colleges\nto participate in cooperative efforts. The educational television legis¬\nlation in each state is as varied as is the pattern of development and\nuse. One thing evident in the study of most state legislative support of\neducational television is that this support has derived from the efforts\nof the lay public as well as from the educational community.\nThe following indication of station ownership reflects the variety\nand diversity of support for educational television:\nNon-profit community organizations . 21\nColleges and universities.  17\nLocal public school systems ......... 13\nState boards of education.3\nState ETV authorities...6\nPractically all these stations, regardlessof ownership, serve nearly all\nlevels of education. This has been one of the happy by-products of co¬\noperative ownership or cooperative use of educational television stations;\nthe schools, colleges, and state agencies have achieved some new under¬\nstandings of each other’s problems.\nThe closed-circuit television systems ordinarily are owned by the\nschool systems or institutions in which they are located. There are some\nexceptions. The South Carolina system is owned and operated by the state\non transmission lines leased on an annual rental basis from the telephone\ncompany. The Hagerstown, Maryland, system is owned and operated by the\nWashington County Schools. The Austin, Texas, CC-TV is owned and operated\nby the state university system. Whatever the base of ownership, each\nCC-TV system, like the broadcast stations, operates to some extent as an\nexercise in cooperative effort to improve instruction.\nDuring the past year almost 1,1*00 school systems, colleges, and\nuniversities used television in some form as an instrument of instruction.\nThe unusual cooperation in educational effort between schools and\ncolleges, and among school systems — and the collateral legislative sup¬\nport — is reflected in comments from the various state studies made re¬\ncently of educational television.\nA 1961 report made to the 104th Ohio General Assembly by the Ohio\nEducational Television Study Commission stated:\n\"The medium will have wide application in this state...It is evident\nOhio has made a good start in educational television. There are\n4 educational television stations on the air, and 4 additional sta¬\ntions are in advanced stages of planning. Eight institutions"
}