{
  "id": "d732-32",
  "text": "THE MEEDS OF THE FUTURE REFLECTED NATIONALLY\nII. INSTITUTIONS OF HIGHER LEARNING\nThere was an over-all national response from the institutions of\nhigher learning concerning their present and future needs, as indicated\n\"by their chief executive officers or their designated representatives.\nSlightly over 1,000 colleges and universities in the United States,\nor approximately 50$ of all existing institutions of higher learning,\nwere contacted in an effort to develop a clear picture of the needs at\nthis level of formal education during the next decade. Of the institu¬\ntions contacted by personal interview, phone, or mail, 601 representative\ncolleges and universities responded significantly. This is a sampling\nof approximately 30$ of the colleges and universities in the country,\nand a response of 60$ of those contacted. In this number, all of the\nstate university systems were represented, with one exception.\nThe approach to this phase of the survey was guided and tempered by\nother studies recently made and reported. For example, the President’s\nCommission on National Goals said:\n\"Enrollments in higher education will double by 1970. To pro¬\nvide a staff commensurate to this growth, and to replace all\nwho resign and retire, we shall need 468,000 recruits in the\n1960’s. The bill for higher education is going to be very,\nvery large in the years ahead. It is reasonable to expect more\ndiscussion of how the money is spent.\"\nIb Prospect for America, the Rockefeller Reports enlarged upon this\nby saying:\n\"One may take any of several views of the usefulness of tele¬\nvision in teaching. It is important to recognize that present\npatterns of utilization are simply not going to work, except\nin a few institutions that are sufficiently prosperous to pre¬\nserve them. It is important to accept the desirability of a\nrigorous re-appraisal of present patterns and a courageous ex¬\nperimentation with new patterns. This must include a candid\nweighing of essentials and non-essentials in the curriculum;\nmore flexible and imaginative approaches to the problem of\nclass size; and -- at the level of higher education — the\ntrying out of approaches that place more responsibility on\nthe student for his own education.\"\nThese ideas and predictions were corroborated by the survey statisti¬\ncally, and by the projections of informed opinion by leading college admin¬\nistrators. A small number of the institutions were hesitant to project\nincreases in enrollment into the next decade, but the majority were willing\nto make conservative estimates based upon their present trends. The esti¬\nmates ranged from 5 - 10$ a year, for the next ten to fifteen years, as a\nminimum. In many instances the sources considered them extremely conserva¬\ntive estimates. Readings and interpretations of the enrollment trends in"
}