{
  "id": "d732-41",
  "text": "- 34 -\nindicated that they expected an extremely large increase in enrollment\neach year during the next ten years. This expected increase varied ac¬\ncording to the kind of institution and its location, but the range of\nexpected increase within the next decade was from 50-100$, as a con¬\nservative estimate.\nPresent use in some measure of broadcast television was reported\nby 106 institutions. Plans to use broadcast television to some extent\nwere reported by 172 colleges and universities. So, of the 601 colleges\nand universities cooperating with the survey, 278 (or 45$) of those\nreporting are now using broadcast television, or they are actively\nplanning to use broadcast television soon.\nThis does not tell the whole story. Some of these institutions\nnow operate their own broadcast stations and some cooperate with other\ninstitutions or with community educational television stations. Others\nare using either donated or purchased time on commercial stations in\norder to achieve their immediate objectives. In most instances, the\ninstitutions not now operating their own stations are cooperating with\na school or community educational station. This indicates a need exists\nand that additional channels will soon be needed to meet the demands of\nthe curricula and instructional schedules. The same is true of many of\nthose institutions now in the planning stage of instructional television.\nThose in this stage of development feel it extremely important to get\ntheir additional programs under way, to master the medium, and to learn\nhow best to use it. In most instances recorded in the survey, those\nwith serious plans for use of the medium for instructional purposes, in¬\ndicated that effective service of the needs of the university in both\non-campus and extension work, would require more than one channel in\nthe future.\nSome institutions that use broadcast televison also have a closed-\ncircuit installation, or have plans for closed-circuit television in¬\nstallation. Many institutions which have not been able on their own\ninitiative to plan for broadcast television, smaller institutions which\nmust wait until some sort of cooperative arrangement or community\nestablishment can be effected, have already installed closed-circuit\ntelevision for on-campus instructional purposes. Many other institu¬\ntions of this kind - both large and small- have planned closed-circuit\ntelevision installations.\nA number of institutions reporting such installations in use or\nplanned for the future indicated that this was only a part of their\ntotal television picture, and that such installation did not replace or\nsupersede the use of broadcast television. There was some indication\nthat for on-campus instructional purposes, low-power broadcast tele¬\nvision might be used instead of cable distributed closed-circuit tele¬\nvision. Agreement was general that within the next 10 years a combina¬\ntion of all types of transmission systems would have to be employed to\nmeet the demands of higher education and their collateral agencies.\nPresent use of closed-circuit television was reported by 96\ncolleges and universities within this survey, and 162 institutions re¬\nported plans underway to install closed-circuit television, for"
}