{
  "id": "d732-50",
  "text": "- ^3 -\nKEEPS OF THE FUTURE REFLECTED NATIONALLY\nIV. STATE DEPARTMENTS OF EDUCATION\nThe State Departments of Education in all 50 states were questioned\nconcerning the present and future needs of education in their respective\nstates, and their attitudes toward and plans for using broadcast tele¬\nvision to meet those needs. In most instances the state superintendents,\nthemselves, framed the answers to the various questions. Generally they\nwere very forthright and definite. They were indefinite only in those\nareas in which it was evident that their powers and authority were limited\nby law. Quotations of some of the representative statements will establish\na clearer background for the statistical tabulation of the responses re¬\nceived.\nDr. William H. Durr, Deputy Superintendent of Public Instruction for\nHawaii, said:\n\"Television can be used for direct classroom instruction in\nscience, foreign languages, mathematics, and other subject\nareas. Television can be used for adult instruction, in\nlanguage, basic reading, and all cultural subjects, and tele¬\nvision can be used in in-service education of teachers. It is\nexpected that with increasing school enrollments, and with\ngeneral population increases as more people move to the Islands\nthat the needs which television can help to meet will increase.\"\nDr. Charles F. Carroll, Superintendent of Public Instruction in\nNorth Carolina, said:\n\"As is true throughout the country. North Carolina is faced\nwith an exploding school population. Numerous steps are\nbeing taken to provide quality education for this tremendous\nincrease in students. Instructional television has proved\nitself in North Carolina as a teaching tool. Increased use\nof it is necessary to help meet the increasing needs of edu¬\ncation. Because television is the most powerful communication\nmedium yet devised by man, it follows that substantial pro¬\ntection must be provided for its use in and by education.\"\nDr. Alfred L. Villa, of the Connecticut State Department of Education,\nwrote:\n\"As population increases and the complexity of subject matter\nincreases there will be more need for effective, authoritative\nand updated instruction. Broadcast television can make a\ngreat contribution in meeting this need. The present 10$\nreservation can in no way meet the impending needs of educa¬\ntion. Large population centers, in fact, may well make ex¬\ncellent use of two or more broadcast sources.\""
}