{
  "id": "d732-56",
  "text": "- 49 -\nDr. Theo J. Norvy, Commissioner of Education in Alaska, writes:\nIt is unfortunate that television broadcasting is very limited\nin this state, primarily due to sparsity of population, as well\nas broadcasting problem. As you know, Alaska is a very mountain¬\nous state which poses special problems when it comes to deliver¬\ning a picture. It may be that the technical difficulties will\nbe overcome — then educational television would be a most welcome\nasset. If at any time there is information which we may furnish\nyou, please do not hesitate to get in touch with us. If there\nare developments in television broadcasting which would assist us,\nwe would appreciate being kept informed.\"\nThese responses indicate there will be future needs in Alaska for\neducational channels. Those needs cannot be projected at this time,\nbecause of the problems peculiar to this new state.\nARIZONA\nv>\nArizona now has on the air two VHF educational television stations,\nowned and operated by the state universities. The school systems and\neducational services generally in the state are exploring ways to meet\ntheir needs by additional use of these stations. While relatively small\nArizona is the sixth largest state in area. Because of\nthis it is vitally interested in extending its educational television\nduring the next ten years.\nGovernor of Arizone Paul Fannin writes:\nEducational television in Arizona is gaining expanded interest\nfor the use of television as a medium to augment our present\neducational system. We already have activated Channel 6, oper¬\nated by the University of Arizona in Tucson, and Channel 8,\noperated by Arizona State University in Phoenix-Tempe. These\ntwo stations have created a growing interest on the part of\nmany officials of our public schools in the use of television\nfor classroom courses. In the future, consideration of tele¬\nvision allocations, I hope that this present use and future\nneeds for additional low-power facilities will be taken into\nconsideration by the Federal Communications Commission.\"\nRichard B. Rawls, vice president, commercial Channel 5 in Phoenix\nwritesi *\nI feel very strongly that education by television is not only\nan efficient and desirable way to teach those desiring educa¬\ntion but unable to attend an institution personally, but I\nfeel emphatically that the development of television education\ntechniques will be absolutely necessary to accommodate the\nstudent growth of the future. The exploding population and\nthe greater trend toward self improvement which is apparent\nto all of us will in the immediate future create a demand for"
}