{
  "id": "d732-60",
  "text": "This survey contacted directly representatives of the major school\ndistricts and private and state colleges in California. Responses\nshowed conclusively that educators on all levels in the state consider\ntelevision an extremely important element in their planning for providing\neducational facilities to meet the demands of the future.\nCOLORADO\nColorado has two major and three minor populations centers, with the\nmajority of the population concentrated in the east-central portion of\nthe state and fairly well within the range of present educational tele¬\nvision assignments. There are four channels reserved for education:\nChannel 12 at Boulder, which is expected to he activated shortly by the\nUniversity of Colorado; Channel 17 at Colorado Springs; Channel 6, oper¬\nated by the Denver Public Schools; and Channel 8 at Pueblo.\nThe major population center in the sparsely settled western part of\nthe state, the Grand Junction area, has no educational television allo¬\ncation at present. Dr. I. K. Boltz, of the Mesa County Valley Schools,\nreports that the people of this area have a strong desire to correct this\nsituation.\nThere are seventeen 4-year colleges and universities in Colorado\nwith a total enrollment of approximately 40,000. There are also seven\n2-year colleges with a total enrollment of approximately 3,500. The\npublic school enrollment is approximately 370,000, with the bulk of it\nconcentrated in the large population areas in the east-central part of\nthe state.\nAt present writing, there are no documented state plans for educa¬\ntion television in Colorado. The only example of activity resembling\nstate action is a committee formed by the State Department of Education\nto examine the possibilities of educational television.\nLack of official state action to institute a program of educational\ntelevision use does not reflect a lack of recognition by the various\ncomponents of the state of an existing need, or a lack of action to pre¬\nserve and utilize this facility.\nThe University of Colorado reports that it is installing production\nfacilities and closed-circuit television, expected to lead to an early\nactivation in Boulder of Channel 12, which is now reserved for educational\nuse. The university looks forward to a state-wide network that will\neventually have a production center and closed- and open-circuit trans¬\nmission facilities on the campuses of each of the seven state supported\ninstitutions of higher learning.\nA further indication of recognition of need is found in the action\nduring the i960 session by the state legislature of passing Section 4 of\n114-11, Colorado Revised Statute, to read:\n\"Any county, city and county, city, town, village, school\ndistrict, or recreational district may receive funds from"
}