{
  "id": "d732-61",
  "text": "any private or public source for the purpose of constructing\nand operating such television transmission and relay booster\nfacilities.\n\"Section 5, (Tax limitations not to apply,)\nAny tax levy for the purpose of this act shall not be within\nthe limitations prescribed for any county, city, city and\ncounty, town, village, or county, or school district, or\nrecreational district.\"\nThe inference, plainly, is that there is a planned future use of\ntelevision channels for education in Colorado. The inference is further\nsubstantiated by the very effective school and community operation of\nChannel 6, in Denver. This potential demand for educational channels\nmust be given prime consideration.\nBasing the projection on the general information received in the\nsurvey, and on an examination of the state’s special problems and its\npotential need for translators in remote valley regions, there will be\nneed within the next 10 years for at least sixteen additional channels to\nserve the educational requirements of Colorado.\nCONNECTICUT\nConnecticut, one of our smaller states, is densely populated. It\nhas 26 four-year colleges and universities and three two-year colleges,\nwith a combined enrollment of approximately 49,000. Connecticut schools,\nwell distributed throughout the state, have a total enrollment of approx¬\nimately 437,000.\nThe Connecticut State Department of Education says:\n\"As population increases and the complexity of subject matter\nincreases there will be more need for effective, authorita¬\ntive, and updated instruction. Broadcast television can make\nthis great contribution in meeting this need. The present\nreservations can in no way meet the impending needs of educa¬\ntion. Large population centers, in fact, may well make excel¬\nlent use of several broadcast sources.\n\"The Connecticut Educational Television Corporation plans to\nbroadcast in the near future. In addition, several cities\nare conducting feasibility studies in the use of broadcast\ntelevision in connection with the Connecticut Educational\nTelevision Corporation's plans,\"\nThe Connecticut Educational Television Corporation is a non-profit\ncorporation composed of colleges, school systems, and interested citizens\nof Connecticut. The Corporation announced in the spring of 1961 that\nTrinity College in Hartford had agreed to provide space on its campus for\nthe facilities of the Corporation."
}