{
  "id": "d732-62",
  "text": "- 55 -\nIn a working agreement approved by the respective trustees of the\nCorporation and Trinity College, the college will provide office and\nstudio space and will have representation on the Corporation’s executive\nv A1 Hudelson> general manager, said the Corporation hopes to\negin broadcasting in the fall of 1961, on Channel 2k in Hartford. This\nis one of the three channels now reserved for education in Connecticut.\nPresent program plans are to provide in-school instruction in the\nelementary and secondary schools, and in-service training for teachers:\ncoilege level courses in cooperation with the constituent members; and,\nat other times, general education and cultural programming for community\nAil colleges, universities, and school systems in Connecticut respond¬\ning to the survey (except Yale University) indicated that they are\nplanning to cooperate with the Connecticut Educational Television Corpora¬\ntion in the use of broadcast television. If their cooperative efforts\nare successful and meet the observed and potential needs, Connecticut, on\n1S+ imUm schedulinS> wil1 squire at least six channels in\naddition to those now reserved in the state.\nDELAWARE\nTr, “elaware if one of our smaller states, both in area and in population.\n“2 circumstances it has the peculiar problem of having to depend to\nome degree upon its neighbors for the development of such facilities as\ninstructional broadcasting. As an example. Dr. George R. Miner, Jr? ot\nthe State Department of Education, says that Delaware is considering co-\nrSSJSS 'ff”“ “ c^Sl\n\"We believed; fLdlef> Superintendent of Wilmington Public Schools, says:\naI soou al n = L? f °“ h3S unliffiited Potential in sound education.\nAs soon as possible we hope to make use of it in the Wilmington schools.\"\nDr. John A. Perkins, President of the University of Delaware save\nthe university is willing to carry its share in any cooperative arrant\nment that may be developed in the state. cooperative arrange-\nDistrict Wsav?r X^Z<, .SuPeflntecdent °f Schools in the Newark School\nuis-cnct, says. Television looks to me to be a must in the future in\nthatch0 pr£vi!*e <luality education for the tremendous numbers of children\nthat the schools will have to provide for in the 70’s.” “"
}