{
  "id": "d732-73",
  "text": "- 66 -\n\"Be it further resolved, that the General Aseembly of the State\nof Iowa pledges its support in the planning of an educational\ntelevision network which will adequately serve the State of\nIowa and in cooperation with the proposed Upper Midwest Six-\nState Educational Television Network,\"\nIn addition to the reserved channels and the educational station oper-\nating in Des Moines, there is WOI-TV, owned and operated by the Iowa State\nUniversity at Ames as a commercial station, but with programming that is\npredominantly educational, WOI-TV greatly assists the present educational\nstation both in originating and in recording programs that would be dif¬\nficult and probably impossible without the facilities at the state univer¬\nsity. It also produces programs for school and adult education that are\ndistributed throughout the state. The Iowa State University and the State\nBoard of Education now are planning to use the state university facilities\nin future instructional programs for in-school use.\nWhile the State University at Iowa City and State College at Cedar\nRapids have not yet activated a station, both are involved in production\nand planning for the future. Understanding of the value and use of tele¬\nvision for instructional purposes at all levels is well developed in all\nareas of education in the state.\nReports from the various educational institutions in Iowa indicate\nthat there will soon be a considerable development in the use of broadcast\nfacilities. The action of the state legislature in its last session\napproving both a state network and a tie-in with the Upper Midwest Network\nwill spur such development.\nIt is difficult to anticipate the kind of multiple channel needs that\nwill be evident in Iowa in the next few years. But, on the basis of present\nplanning from the center of the state in the Ames-Des Moines area, in the\nnortheastern part of the state, in the Waterloo and Cedar Rapids areas, and\npossible development in the western part of the state in the area of Sioux\nCity, there should be a minimum need within the next ten years for at least\nten additional television channels.\nThis is supported by the survey of the individual school systems in\nthe state. Fourteen individual school systems reported they are now using\ninstructional television in the classroom and are planning to continue and\nextend such use. Six systems reported they are planning to use it. These\nprograms are developed mostly through the state university. But, if this\nkind of experience continues, it could be a basis for continued expansion\nof educational television facilities in Iowa.\nKANSAS\nA report by the Kansas State Legislative Council in i960 on the needs\nof educational facilities in Kansas stated, in part:\n\"There are approximately 2,800 school districts in Kansas. Over\n1,900 of these districts operate nothing but elementary schools."
}