{
  "id": "d732-88",
  "text": "There were five universities which indicated that they were now using\neducational television. Six indicated that they planned to use television\nin the near future, and seven said they recognized that they had a very\ndefinite need for television in their future plans.\nAll of the state universities responding to the survey indicated that\nthey expect to be a part of the Michigan Educational Television Network\nwhen it is established, and are willing to cooperate in any way possible\nto get such a network established.\nConsidering the long term needs of this tremendous population cluster\nin the southern third of Michigan, Channel 2, should be moved if possible,\nfrom Alpena, into the central area as previously indicated. There should\nbe, in addition to retaining all the present reservations, an additional\nbasic reservation in East Lansing and in Battle Creek, to serve the insti¬\ntutions now lacking an outlet for their services. The network resulting\nfrom the present assignments, plus the suggested additions, would make\npossible an interconnected basic educational service in Michigan. But, if\nthe schools and junior colleges are to be adequately served, as well as the\ngeneral public and higher education in these areas, this system will have\nto be at least a double system, and, in some areas, a triple and quadruple\nsystem.\nIf Channel 2 is moved, it should be replaced in the northern part of\nthe state with a UHF channel. Present reservations there, with that addi¬\ntion, could handle the basic service for education. This would be particu¬\nlarly true with the help of an interconnecting system, which some officials\nnow believe can be provided at reasonable cost by the common carrier. But\nwithin the next 10 to 15 years the peninsula and the northern part of the\nstate would need to be at least double channeled to provide the necessary\nscheduling. On this basis it is evident that a minimum of 27 additional\nreservations, distributed as indicated, is needed to protect the future\neducational and instructional television services in Michigan.\nDr. Lynn M. Bartlett, Superintendent of Public Instruction of\nMichigan, supports the basis of these needs, and the basis upon which the\nprojections for the future are made. He says that Michigan’s major needs\nare the utilization of educational opportunities throughout the state;\nand immediate and extended dissemination of new knowledge of instructional\nfacilities and materials throughout the state.\nDr. Bartlett believes that some of these problems may be halped by\nthe reorganization of school districts, and other provisions for equalizing\neducational opportunity. But he warns that large population increases, the\navailability of new knowledge and information, and increased financial\nsupport now in prospect will create increased demands and need for such\nfacilities as television instruction.\nDr. Bartlett says that Michigan is now conducting a state-wide study\nto establish a basis for a state plan of television development and utili¬\nzation. He predicts strong recommendations for broadcast television expan¬\nsion will result, whatever else the final plan may embody. He suggests\nthat it would be extremely effective to have a VHF service for educational"
}