{
  "id": "d732-89",
  "text": "- 82 -\ntelevision covering the major population areas of the state, but that UHF\nservice backing up an basic network and reinforcing instructional facili¬\nties throughout the state is essential.\nMINNESOTA\nThere are 3 large population centers in Minnesota, The two largest\nare in the east-central and north-east, facing on Lake Superior. The third\ncenter is in the vicinity of St. Cloud, which is also in the east-central\npart of the state. Over half of the population of Minnesota lives outside\nof the urban centers, in small towns and rural areas. During the past\ndecade, the population increase in Minnesota was approximately 14$. The\nmajor portion of this increase was in the metropolitan areas.\nMinnesota has 30 four-year colleges and universities and seven two-\nyear colleges, with an enrollment of approximately 71,000. Public school\nenrollment is approximately 640,000. The enrollment follows the state\npopulation pattern, with over half the pupils in small towns and rural com¬\nmunities.\nThere are three educational television reservations in Minnesota - two\nin the eastern part of the state, in Duluth and St. Paul-Minneapolis; and\none in the western part of the state at Appleton. The only channel acti¬\nvated at this time is Channel 2 in St. Paul-Minneapolis. This is owned and\noperated by a non-profit educational foundation, but services the colleges\nand universities and school systems of the entire area.\nChannel 8, in Duluth, is expected to be activated soon; and Dr. Dean\nM. Schweickhard, Commissioner of Education, says that plans are being made\nto activate the station at Appleton. Various educational interests are\nconsidering the establishment of a series of translators or repeaters to\nextend the utilization of the service of Channel 2 in St. Paul-Minneapolis.\nMinnesota, however, is a large state and the central and western areas\nof the state have certain demands which will have to be recognized and met\nin the future, if the needs of education are to be properly served.\nDr. John J, Neumaier is president of Moorehead State College, which\nis located in the western extreme of the state. He is hopeful that when\nChannel 13 (educational) in Fargo, North Dakota, is activated it will give\nthe other institutions of higher learning, and education generally, an\nopportunity to have a television service. He points out the unique cluster¬\ning in the Moorehead-Fargo community of a private liberal arts college, a\nland-grant university, and Moorehead State College. All of these are\ncapable of making distinctive contributions to the curriculum, which comple¬\nment rather than duplicate offerings. Dr. Neumaier notes that as his insti¬\ntution is growing rapidly the demands upon a limited faculty are increasing\nto the point where some sort of relief must be offered. He feels that a\ntelevision service would add immeasurably to the college facilities.\nFrom the experience in the eastern part of the state, and in other\nstates, one station or one channel cannot provide all of the services needed."
}