{
  "id": "d732-9",
  "text": "- 2\n5« Greater need for systematic extension education and in-service\nteacher training.\n6. Growing demand, especially among state institutions and small\ncolleges, for cooperative use of certain facilities and instructional\nresources.\n7* The fear that the limited space in the television spectrum will\nbe filled before the schools can develop the necessary facilities and\ntechniques for television instruction.\nMany of the problems that beset the colleges and universities were\nreflected in the school systems, though frequently intensified and\nmultiplied. The degree of need, and the use of television to solve their\nproblems, differed by area and community; but the significant fact is\nthat differences were only in degree.\nThe projected need for television channels by the total educational\ncommunity in the country were based on information received from five\nmajor groups:\n1. Colleges and universities\n2. Local public school systems\n3* State departments of education\nLocal civic and political leaders\n£• Active educational television stations.\nExtended reports from three or more of these sources were received from\nall the states and, with few exceptions, each group largely corroborated\nthe others.\nThe survey included all the large school systems in the country with\nenrollments of 12,000 or more, a significant number of the smaller sys¬\ntems, and all the state departments of education.\nThe first part of the survey determined the existing needs in educa¬\ntion that could be satisfied or materially helped by the use of broadcast\ntelevision. This portion of the survey was also concerned with the number\nand distribution of television channels which would be required to meet\nthese needs.\nThe second part of the survey focused: 1, on the adequacy of pres¬\nently reserved channels for handling established educational need; 2,\nchannels available under present rules that could be added to the re¬\nserved list for a primary, nation-wide service; 3, additional channels\navailable to provide multi-channel service.\nThere are some 200 metropolitan areas in the United States with\npopulations in excess of 100,000, and 270 smaller centers with more than"
}