{
  "id": "d732-91",
  "text": "- 84 -\n-L/\nVw\nThe Assistant to the President at the University of Missouri empha¬\nsized not enough broadcast channels were available to education in Missouri\nto plan development of broadcast television there. He said that the state\ngovernment is interested in such development if channels could be made\navailable; but it is presently involved in tax problems which prohibit any\ngreat amounts of financial help for such development. He said he feels\nthat Federal funds are essential to the development of this facility in the\nnear future, and he feels strongly that it should be developed.\nThe general survey showed that eight colleges and universities in\nMissouri are now using television in some form for instructional purposes.\nSix other colleges and universities indicated that they saw a very definite\nneed in the future for broadcast television. Seven school systems indi¬\ncated that they were now using broadcast television for instruction, and\nten indicated that they were planning to use it.\nDr. Irwin L. Peters, Dean of Administration at Central Missouri State\nCollege, said:\n''The dissemination of education is largely limited to those\nindividuals who are able to be physically present in the\nclassroom. This is a limitation which has no relationship\nto intellectual talent, or community needs. Educational\ntelevision can provide instruction wherever there is a tele¬\nvision signal of sufficient strength to produce a picture on\na receiver.\nAlthough the enrollment of higher education is exceeding the\nsupply of qualified instructors — and educational television\ncan help to distribute better the talents of effective\nteachers — an even more important problem is likely to be\nthe increasing specialization of instruction and instructional\nequipment. There will be a few institutions which can main¬\ntain several different kinds of data processing equipment, and\nfew institutions will have full-scale nuclear reactors. As\ninstruction becomes increasingly dependent upon expensive and\nrare equipment television can provide one form of access to\nthis equipment by a network or tape exchange which effectively\ninterconnects several institutions.\"\nDr* Peters telieves that educational television channels, at least in\nthe basic service, must be compatible with the receiving facilities of the\ncommunity. He also feels that a state-wide network serving the public,\nthe schools, and the interconnected institutions of higher learning is the\nmost practical approach to the problem.\nOn the basis of information and reports obtained in the survey from\nthe state of Missouri, there need to be in addition to the present reser¬\nvations, additional reservations for the basic system in the vicinity of\nColumbia. Some need is evidenced also in the southeast, central, western\nand northern parts of the state. If these were added, and the state net¬\nwork or the state system developed to the extent that it has been developed,"
}