{
  "id": "d732-93",
  "text": "In a system composed of small scattered units a central educational tele¬\nvision facility could conceivably eliminate unnecessary duplication and\nproliferation of courses and improve general instruction*\nThe Department of Education does not believe that the population\npattern in Montana will show a marked increase in the next decade* But\nit emphasized that the problems now existing in the distribution of\neducational opportunities and facilities will remain both in the school\nsystem and in higher education, and urged that television facilities be\nprovided to help solve some of these problems.\nThe Montana Educational Television Committee, composed of educators\nand lay citizens is now conducting a survey and making plans for a state\nsystem of educational television* Dr* Thomas Moriarty, Dean of Education\nat Eastern Montana College of Education, is chairman and Dr. Erling S»\nJorgensen, of the University of Montana, director of the committee.\nThe Committee believes that broadcast instructional television will\nbe of great importance to the educational system of Montana and that the\nplanning for its use must provide for its reception by every school in\nthe state.\nBasically, the reservation of channels for educational television\nin Montana should provide for dual service to all parts of the state*\nThe Committee thinks primarily in terms of one channel for public school\neducation and one channel for higher education* They do not envision\nseparating the functions of these channels in such distinct use, but\nsee at least two separate channels available in which each branch of\neducation would have a particular advantage at a particular time, and in\nwhich each would be well served at all times.\nMontana has nine four-year colleges and universities and two two-\nyear colleges, with a combined enrollment of approximately 12,000. The\npuolic school system has an enrollment of approximately 146,000* The\nstate Superintendent does not believe there will be any great increase\nin the overall population of Montana in the next ten years, but the\nUniversity has projected an increase in public school enrollment of\napproximately 16$ and an increase in enrollment in higher education of\napproximately 50#.\nThe Montana Educational Television Committee has drafted a tentative\nplan for a state network to provide the kind of basic system they feel\nneeds to be initiated and which they plan to follow-up with dual channel¬\ning. It calls for a combination of high-power and low-power broadcast\nstations supplemented by a number of station translators to take care of\nthe small isolated areas and valleys which cannot ordinarily be well\nreached by standard broadcast. The plan calls also for linking the state\ncolleges and universities at Missoula, Bozeman, Billings, Butte, Haver,\nand Dillon, and the state capitol and the private colleges in the state\nalong with the two important junior colleges."
}