{
  "id": "d1888-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nFrank £. Schooley, Editor, Station WILL, Urbana, III.\nSeptember 1, 1943\nWELCOME BACK, WTAW AND 'AOOLKET\nNAEB WELCOMES THE RETURN OF WTAW, TEXAS A. & Mo, TO ITS RANKS* U •\nWoolket, Program Director, for the station has indicated his desire to\nAGAIN HAVE WTAW BACK IN OUR ORGANIZATION* We HOPE THAT VE MAY BE OF\nSERVICE TO THE STATION AND INSTITUTION WHICH IT REPRESENTSo INCIDENTALLY,\nWE NOTE SINCE W00LKET*S JOINING OF OUR RANKS, THAT HIS PRESIDENT, 0ro\nThomas Walton, has resigneo because of ill health. Dr0 Walton has been\nPRESIDENT OF TEXAS A. & M. SINCE 1925*\nYEEND LEAVES KWSC FOR KIRO\nAfter nine years of service to KWSC, Director Kenneth E. Yeend has become\nDIRECTOR OF EDUCATION AND FARM PROGRAMS OF KIRO, 50,000 WATT COLUMBIA\nAFFILIATE IN SEATTLE«\nHe has been KWSC, the pioneering educational station of the Northwest,\nEXPAND IN POWER FROM 2,000 TO 5,000 WATTS, IN TIME ON THE AIR (NOW\nBROADCASTING 89 HOURS PER WEEK), IN NUMBER OF WORKERS (HUNDREDS OF STUDENTS\nAND FACULTY SHARE IN TURNING OUT THE PROGRAMS), IN NUMBER OF TRAINED\nGRADUATES ADVANCING TO SUCCESS IN COMMERCIAL RADIO, AND IN GENERAL\nPOPULARITY OF STATION PROGRAMS, WHICH INCLUDE SIX DIRECT WIRE UNITED\nPress newscasts daily.\nYeend took an A, B. from W. S. C« in 1934 and an M. A, from the University\nof Southern California in 841. He is a member of National Collegiate\nRadio Guild, National Collegiate Players, Sigma Delta Chi, Psi Chi, and\nKI WANIS.\nHe STARTED WORK AS A STUDENT HALF-TIME IN 1934, BECOMING ASSISTANT PROGRAM\nDIRECTOR IN THE FALL. In THE SUMMER OF 1937 HE WROTE CONTINUITY FOR KVI,\nTacoma, but returned in the fall to become acting director and then director\n(Editor’s notes Sorry Yeend is leaving KWSC, but glad to note he maintains\nHIS INTEREST in EDUCATIONAL RAOIO AND IN NAEB. He IS TAKING OUT AN\nASSOCIATE MEMBERSHIP IN NAEB. GOOD LUCK, YEEND, IN YOUR NEW WORK.)\nTYLER HEADS RADIO PROGRAM AT OHIO. STATE\nIN A MOVE TO COORDINATE ALL OF OHIO STATE UnI VERS ITY8S RADIO RESOURCES\nAND ACTIVITIES INTO A MORE EFFECTIVE PROGRAM, PRESIDENT HOWARD L. 8EVIS\non August 14 announced the assignment of Dr. I. Keith Tyler to be acting\nDIRECTOR OF RADIO EDUCATION FOR THE UNIVERSITY.\nDr. Tyler, director of the radio division in Ohio State Un*versity9s Bureau\nof Educational Research, has been loaned by the bureau for the coming\nYEAR TO GET THE NEW UNIVERSITY-WIDE PROGRAM UNDER WAY."
}