{
  "id": "d1340-0",
  "text": "■\nN\nA\nE\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 29, NO. 1 JANUARY, 1964\n1966 NAEB Convention Bids Wanted\nBids are being accepted for the 1966 NAEB national conven¬\ntion, which will be in the Midwest. The deadline for bids to\nbe received in the NAEB Washington office is February 5,\n1964. Kansas City and Cincinnati have already issued invi¬\ntations.\nThis is a new procedure, approved by the Board of Direc¬\ntors at the Milwaukee convention, to allow selection of con¬\nvention sites three years in advance. This should result in less\ndifficulty arranging hotel space at the time desired. Members\nof the NAEB National Convention Committee will choose two\nfinalists from among the bids and, after Board approval of\nthe two, the NAEB staff wi)ll select the final site—based on\nrespective facilities, prices, and help. Announcement of the\nsite will be made April 1.\nBidders are asked to include the following information:\n1. Invitations from hotels, with information about space for\nmeetings, space for exhibits, and rates.\n2. Invitation from the Chamber of Commerce or convention\nbureau, with an indication of the help this group is willing\nto provide.\n3. Specific information from the NAEBers extending the\ninvitation as to what help they can provide.\n4. An indication as to whether or not arrangements can be\nmade locally to underwrite the expenses of a visit by an\nNAEB staff member if the city is one of the two finalists.\nMore Go to Samoa\nDuring the last two months several persons have gone to\nSamoa to work on the NAEB ETV project there. They are:\nGary Bergland, producer-director from Auburn University,\nAlabama; Jim Hodgins, film specialist and photographer,\nWEDU-TV, Tampa; Marjorie Igguldden, artist, WJCT,\nJacksonville, Florida; H. Eugene Larson, engineer, KVIE,\nSacramento; and Lorin Swazey, WEDU-TV, Tampa.\nVernon Bronson, NAEB director of research and develop¬\nment, recently said that three others are to go in February, to\njoin the above and the engineering team which went to Samoa\nlast summer. Scheduled to leave next month are: Robert\nCostello, technician, KTPS-TV, Tacoma, Washington; Lyn¬\ndon Fisher, a recent graduate of Ohio University, Athens;\nand Norman Tyler, ETV teacher, KTPS-TV, Tacoma.\nBronson said he is currently negotiating with teachers from\nsix cities across the nation, to obtain persons with TV teach¬\ning experience to work with the new Samoan ETV system. In\nmaking the announcements, Bronson stressed that personnel\ngoing to Samoa must have not only the professional capabili¬\nties required, but also families who are psychologically ad¬\njusted to living in an island community away from home.\nNAEBers May Obtain Group Insurance\nNAEB Individual members may obtain accident insurance at\nconsiderable savings under a new plan sponsored by the\nNAEB. Detailed announcements were mailed to all Individ¬\nual members during December.\nUpcoming NAEB Meetings\nJanuary 29-31. Educational radio conference, University of\nChicago Center for Continuing Education.\nFebruary 26-29. Region VI meeting in conjunction with 17th\nAnnual Western Radio and Television Conference, Jack\nTar Hotel, San Francisco.\nMarch 1-4. Conference on improvement of television teaching, .\nUniversity of Missouri.\nMarch 22-24. Region III meeting, Indiana University.\nApril 9-11. Region II meeting, Columbia, South Carolina.\nOctober 6-7. Music directors conference, University of Wis¬\nconsin.\nOctober 25-28. National convention, Austin, Texas.\nCorrection of IERT Dates\nDates for the 1964 IERT were listed incorrectly in the De¬\ncember Newsletter. Correct dates are May 26-28.\nOhio State Awards Entry Deadline\nDeadline for entry in the 1964 Ohio State Awards is January\n15, 1964. For entry forms and further information, write:\nIERT, 2470 North Star Road, Columbus, Ohio 43221.\nInstructional Division Sponsors Conference\nThe NAEB Instructional Division will sponsor a national\nconference March 1-4, 1964, at the University of Missouri,\nColumbia. The division will also have its organizational meet¬\ning at this time.\nTopics to be considered are: Teaching and Utilization, Ad¬\nministrator’s Viewpoint, Current Research and Experimenta¬\ntion, Graphics and Instructional Aids, Sharing Instructional\nResources Through Television, and Role of the Director. The\nconference planners are developing the program to interest in¬\nstructional broadcasting personnel, school administrators,\nteachers, and audiovisual people responsible for TV planning\nand utilization. “Improvement of Teaching by Television and\nRadio” is the conference theme.\nMembers of the planning committee are: Barton Griffith,\nchairman, University of Missouri; Robert Boston, St. Louis\nschools; Leslie Greenhill, Pennsylvania State University;\nCharles McIntyre, University of Illinois; Rhea Sikes, Pitts¬\nburgh schools; and ex-officio members Ed Lambert, Univer¬\nsity of Missouri, and Harold Hill, NAEB.\nFour Receive Citations\nOne institution and three individuals were awarded citations\nat the NAEB national convention in Milwaukee for their ef¬\nforts in educational broadcasting. Albert P. Fredette, station\nmanager of WAMC (FM), accepted the citation for his sta¬\ntion and the Albany Medical College. The three honored in¬\ndividuals were Mrs. Gertrude G. Broderick, U. S. Office of\nEducation; Marguerite Fleming, station manager, KSLH\n(FM), St. Louis; and Mrs. Kathleen N. Lardie, station man¬\nager, WDTR (FM), Detroit.\n1"
}