{
  "id": "d1340-1",
  "text": "^ Community Television of Southern California announces\nthat it hopes to move into its new quarters in Hoh> ,,'ocd early\nthis month. The schedule calls for a test patt'.rn on the air for\nthe Los Angeles ETV station by May 15 and full programing\nin September. Early in December, Ray Stanley, director, ETV\nFacilities Program, and John Brugger, of HEW, visited\nCTSC for an inspection prior to the granting of federal match¬\ning funds for construction and equipment.\n^ WBKY, University of Kentucky FM station, installed a new\ntransmitter during the Christmas holidays. The transmitter,\na lOOOw Collins 830D-1A, will maintain the station’s 3000w\nERP service to central Kentucky. It is push-button controlled\nand capable of stereo broadcasts, which WBKY plans to in¬\nstitute in the near future.\nINSTRUCTION\n^ In Bogota, a six-month, two-station pilot ETV project now\nbeing conducted by Peace Corpsmen and Colombian students\nis to be expanded in August, 1964, into a regular schedule of\nin-school programing that will immediately reach 1500 schools\nthroughout Colombia. Last August, KUON-TV, University\nof Nebraska, and KNME-TV in Albuquerque, New Mexico,\ngave corpsmen their intensive training.\n^ Daniel Turner, professor at Northwestern, looks past an\n“ITV obsession” in his article, “Television and Learning,” in\nthe December, 1963, Teachers College Record. He says that\nour use of ITV has been obsessed with the notion of reach¬\ning more students with fewer teachers. He suggests that we\nhave been both short-sighted on this score and insensitive to\nthe potentiality of the medium to “bring the world into the\nschoolroom.” The same issue has a 27-page section, “Creativ¬\nity Appraised,” written by Richard de Mille of USC, Eliza¬\nbeth Drews of MSU, and Minnesota’s E. Paul Torrance. The\nRecord’s address is Columbia University, 525 West 120th\nStreet, New York 27.\nState and Regional\n^ Ohio’s ETV Network announces that two new ETV sta¬\ntions will be on the air during 1964 in the state. Bowling\nGreen’s WBGU-TV is scheduled to begin programing early\nthis year, while Cleveland’s Channel 25 will be activated later\nin the year. The state’s ETV stations plan an early exchange\nof programs via tape prior to actual interconnection by micro-\nwave.\n^ The Arkansas ETV Commission expects to have its first\nstation on the air this spring, in Hot Springs.\n^ Maryland has under way an engineering survey for a\nstate-wide ETV network.\n^ In Illinois, the office of the superintendent of public instruc¬\ntion and the Illinois School Problems Commission are co¬\nsponsoring nine conferences in various parts of the state on\nETV this spring. The governor has designated the superin¬\ntendent of public instruction as the state’s ETV agency.\n^ The Wisconsin legislature adjourned in November without\nacting on the governor’s special appeal for ETV. The proposal\nwould have appropriated $570,000 in state funds, to be matched\nby a smaller amount in federal aid, to establish a station in the\nGreen Bay area, another in the Eau Claire-Colfax area, a pro¬\nduction studio at Stout State College, and the necessary link¬\nage between those points and also Milwaukee. ETV pro¬\nponents are hopeful of action at a proposed April session of\nthe legislature.\nGraduate Assistantship for 1964-65\nWestern Michigan University is offering a graduate assistant-\nship in mass communications for 1964-65. Applications must\nbe in by March 1. The stipend is $1,000 for ten months andi\nremission of local fees. Obtain forms and more information\nfrom Robert Paul Dye, Director of Broadcasting, Western\nMichigan University, Kalamazoo, Michigan, 49001.\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W„ Washington, D. C., 20036. Phone 667-6000. Area Code 202.\nNew Institutional Members\nRADIO STATION DIVISION\nC. W. Post College, Station WCWP (FM), Greenvale, Long\nIsland, New York.\nNETWORK\nStation WKSU, Kent State University, Kent, Ohio.\nIndiana College Radio Stations Elect\nMembers of the Indiana Collegiate Broadcasting Conference\nelected officers and advisers at their second meeting at Butler\nUniversity October 26, 1963. The group of college radio sta¬\ntions organized at a meeting at DePauw University last May.\nIts purpose is “to better acquaint the personnel of Indiana\ncollege broadcasting stations with each other, to discuss prob¬\nlems of common interest, and to explore the possibilities for\nan Indiana College Network or similar organization.”\nOfficers are: President—Jerry M. Douglas, WAJC, Butler\nUniversity; vice president—Ray M. Williamson, WGRE, De¬\nPauw University; secretary—David A. Rent, WBST, Ball\nState Teachers College; treasurer—Kathy Hegg, St. Mary-\nof-the-Woods. Advisers are: R. LeRoy Bannerman, Indiana\nUniversity; Joseph T. Duncan, Indiana State College; and\nIrwin Starr, Earlham College.\nMember colleges are: Indiana State Teachers College, St.\nMary-of-the-Woods, Evansville College, Notre Dame, De¬\nPauw University, North Manchester, Indiana University, Pur¬\ndue University, Ball State Teachers College, Indiana Central\nCollege, Franklin Central, Butler University, Earlham Col¬\nlege, Valparaiso College, and Wabash College.\nTHE PRESIDENT\nThe December Newsletter went to press on the grim day\nfollowing the President’s funeral, and I could think of no\ncomment that seemed appropriate for this type of publi¬\ncation. Now, a month later, I still feel a need to say some¬\nthing here in acknowledgement of the national tragedy.\nPerhaps other NAEBers found themselves remembering,\nduring the days following the assassination, the NAEB\nconvention a year ago—when the Cuban crisis broke . . .\nwhen many of us gathered in one of the hotel meeting\nrooms to see and hear the President’s speech on the large\nscreen. I remember feeling at that time a great pride\nwelling up inside me—pride in country, in the Presidency,\nand in the man filling the job. It was a silent, sober crowd\nthat left the room that evening.\nLittle did we know then of the sillent, sober, and sad\ncrowds to be filing through the Capitol Rotunda and lining\nthe streets of Washington little more than a year later.\nYet this sad time had its elements of solemn pride, too—\nin the continuity of the office of President ... in the\nbrave dignity of Mrs. Kennedy ... in the unity of our\npeople ... in the broadcast industry which alone could\nhave sustained such unity as our nation watched and\nlistened . . . and in a small boy’s salute, more expressive\nthan any words.\n—BMcK.\n* * *\nAmong the expressions of sympathy from other nations\nwere two addressed to William Harley and the NAEB—\ncablegrams from the European Broadcasting Union and\nfrom Radiodiffusion-Television Francaise.\nThe Congressional Record for December 3 commends the\nbroadcast media for their coverage of the events, which,\nto quote the insert, “was particularly memorable because\nof the dedication, accuracy, and good taste of those from\nthe broadcasting industry who worked long and often under\ndifficult circumstances.”\nJANUARY 1964\n3"
}