{
  "id": "d837-126",
  "text": "Reproduced by special permission from MENTAL HYGIENE, Vol. XXIX, No* 1, Jan¬\nuary 19559 pp* 18-25\nTBS ROLE Of.NATIONAL ASSOCIATIONS*\nVice President, The\nALanJlregg, M* D,\n'he Rockefeller foundation, New York City\nPick up the New York telephone hook and turn to the letter “N,“ After the\nword “National” you can find the following twenty-one different words that\nindicate some form of human association-national association—for one pur¬\npose or another* As you hear this list, please note the flavor and the con¬\nnotation that each of these words conveys* Before each comes the word,\n“National\"? Academy, Alliance, Association, Authority, Board, Bureau, Club,\nCommittee, Conference, Council, federation, foundation, Guild, Institute,\nLeague, Legion, Organization, Registry, Service, Society, and System,, Will\nRogers once observed that an American was willing to join almost anything\nbut his family. But these names are not the names of anything. They are\nnot even synonyms. They are not equivalent* Each has a special flavor of\nmeaning to each of us, and probably no one of these words means exactly the\nsame to all of us* Such a formidable choice of names poses my subject in\nthe form of a question: What is the role of a national association?\nIn the first place comes the fact that these names all share the adjective,\n“National, “ I suppose that this offers but another instance of the fact\nthat we live in an era of intense nationalism, so the word, “National,\" re¬\nassures us all, suggesting unity, loyalty, safety and power, scope and in¬\nfluence, largeness if not grandeur. In other countries and other centuries\nsome other adjective than “National\" has held similar sway—“Royal,“ “Imper¬\nial,\" “Holy,\" or “Roman*“ But today the word is “National,\" and in that\nmagniloquent word I think I am right in suspecting the chance of a trace of\nself-deception, precisely because we like the flavor of what is called na^\ntional, for few of us are free from the human frailty so neatly ticketed in\nthe French phrase, “II se nave en mots\"—“He rewards himself in words*\"\nSleight of hand hides little to compare with what sleight of tongue conceals.\nEdmund Burke said that when you find a concealment, you make a discovery.\nIn any event, this momentary pause over the word, “National,\" leads to the\nrecognition of two types of national organization. These types are not mu¬\ntually exclusive? they usually march on each other and at times overlap or\nblend. So perhaps it would be better to say that national organizations\npresent a graded scale or gradual spectrum, whose two extremes have the\nfollowing characteristics:\nAt one end are those national associations whose purposes and interests are\nso specialized, and whose protagonists and champions so few, that only by\ndrawing upon the whole nation can they hope to assemble an effective band of\nenthusiasts. Hence the word, \"National,\" Their purpose is to stimulate a\nnationwide interest in their programs, to advertise, to evangelize and make\n♦Presented at the annual banquet of the National Association for Mental\nHealth, New York City, October 24, 195^*"
}