{
  "id": "d837-127",
  "text": "The Role of National Associations\n- 2 -\nAlan Gregg, M.D,\nconverts. Their leaders are usually self-appointed and sometimes even self-\nanointed, for almost no electorate exists, since followers are still to he\nfound or even made. Local chapters do not exist; the need for them exists,\nhut they are not yet in being. Such pioneering national organizations seek\nabove all to stimulate and create.\nAt the other end of the scale there are national organizations with a quite\ndifferent major task. Their major function and purpose is to coordinate a\ngroup of already existing agencies, local chapters, or constituent societies.\nThey take such names as federation, alliance or league. Their purpose is to\nserve their constituent members, reconciling internal differences, protect¬\ning their collective interests, and providing a forum or mouthpiece to ex¬\npress the consensus of their members' views.\nEach of these extreme types shows the defects of its qualities. On the one\nhand the lonely pioneering zealots are likely to suffer from the limitations\nof extreme individualism and the vagaries and vicissitudes of unreflecting\nindependence. Their contributions to their cause, though daring and some¬\ntimes noble, remain all but unorganizable, so personal are they, so emotion¬\nal, fitful, unpredictable, and radical. They improvise because they are in\na passionate hurry, for all toe often they cannot survive the death of their\nfounders. In contrast, the other type—the federations—tend to conservatism\nand compromise, subservient at once to their electorate and to the past.\nTheir leaders resemble cautious moderators more closely than intrepid pio¬\nneers. Obviously these extremes have each great merits; we can express no\npreference.\nBut beneath both these characteristic forms of behavior, what is the raison\nd^etre, the ultimate and common justification, the essential vitality of\nnational associations? it is this: in a democratic society we citizens as\nmere laymen can exerciset individually and by association, the eternal vig¬\nilance that is the price of liberty. We do not have to leave what interests\nus to the experts or to a government bureaucracy. We do it ourselves-—ama¬\nteurishly perhaps, but by ourselves. That is both the privilege and the\nI price tag.of living in a democracy, It has been neatly observed that he\nwho knows how will always find employment and he who knows why; will be his\nemployer. In a democracy we rely upon the citizens to know why—to be the\nemployer. As a result our national associations by their mere existence\naccomplish an act of faith—one might say the superlative act of democratic\nfaith. They exemplify the belief that leadership depends on the followers,\nnot on the divine right of kings, or dictators, or specialists, or adminis¬\ntrators, or anything as narrowly logical as efficiency. In essence a na^*\ntional association disputes the finality of any control from above downward.\nThe strength of a national organization lies in well-informed participation\nthat is steady, but imaginative, Napoleon held that if you want some public\nipervice done well, get experts to do it, and then get intelligent laymen to\nsay whether or not it has been well done. This same layman's judgment I\nlook to be supplied first by national organizations and*—often at long last\nif at all—by the electorate at the polls, for a conviction widely enough\nspread may well find utterance in legislation.\nIf the justification for such efforts as national leagues, associations, bur¬\neaus, conferences, and so on, relates to the preservation of your liberty,\nwhat considerations may best decide which of so many organizations you will"
}