{
  "id": "d837-128",
  "text": "The Eole of National Associations\n- 3 ~\nAlan Gregg, M.D.\nchoose to work in or belong to? The deepest need of any organization is to\nhe needed. Perhaps, therefore, you may well select those societies that txy\nto meet the needs you feel most deeply.\nThe depth of feeling regarding mental health, the conviction that infuses\nthe membership of your organization—The National Association for Mental\nHealth—distinguishes you. Most other people who have had close contact\nwith mental disorder react to it with panicky aversion. And most of those\nwho have had no such contact avoid or evade or ignore the subject entirely.\nYour realism and courage do you honor. I know that some of you, and I\ncould hope that all of you, have enough historical perspective to realize\nthat mental diseases afflicted the human race long before cures were found\ngnd long before the nature of the disease ms understood. Put you show cour¬\nage in facing the fact that a similar distressing ignorance will continue\nunchanged unless those of us who feel the call do something about it. \"Hope\ndeferred maketh the heart sick1*; it may be a long road to follow, and there\nwill be those who will fall out, discouraged or even angered by frustration.\nThe task is really hard—so heroic that I cannot find it in my heart to\nblame those <dio do not always match their hopes with patience and tenacity.\nSometimes I wonder whether membership in national associations of the pio¬\nneering type might not wisely be limited to three years, in acknowledgement\nof the usual duration of human enthusiasm for truly difficult undertakings.\nAnd then, after this probationary novitiate, could come the opportunity for\nrednlistmenu, as senior members, for our more tenacious characters, our more\ndistinguished and devoted citizens.\nIn any event, national organizations that have really difficult and discour¬\naging tanks must see to it that their members get a sense of significant\nparticlpafion as individuals in something great. Indeed some serious, but\nprobably productive study might be devoted to the question, \"Whence comes\nreal satisfaction to our membership?\" With radio, TV, movies, ball parks,\nstadiums, congressional investigations, and spectacles supported by adver¬\ntising or government, we have become a nation of spectators with, hardly bet¬\nter than a 15-minute span of attention, hypercritical and hard to please,\nattentive only to superlatives, to horror or amusement.\nIf we seek to know whence comes real satisfaction to our membership, let us\nlook at ten kinds of activity characteristic of national associations. Some¬\nwhere in the list nearly every one of you could fit in, contributing your\ntalents and experience, not as mere onlookers, or passive stockholders in\naffairs run by \"the management,\" but as participating members.\nA national association can do the following:\n1. Inform the public and focus attention upon the present state and the po¬\ntentialities of the association’s chosen field. It can give advice on re¬\nquest, In George Stevenson’s skill and wisdom as an adviser you have an eiz-\n^rellent record and example of this advisory function.\n2, Stimulate the creation, and aid in the formation, of local chapters—\nstate, county, and city—of the national association."
}