{
  "id": "d837-17",
  "text": "LEWIS HILL\nFOR INFORMATION OF\nDuncans Mills, Calif.\nAugust 7, 1954\nDear Mr. Schooley:\nI have received copies of letters of August 3 from Gravdon\nAusmus to officers of the Rockefeller Foundation, regarding the\ngrant of $9,970.00 for experiments in poetry broadcasting under\nmy direction. Some aspects of these letters affect the content\nof my letter of August 4 to you, and perhaps it would be well\nto start all over again in settling procedure.\nIt is relieving to note in Ausmus1s letter to Miss Flora M.\nRhind that the Rockefeller Foundation desigiated its grant for\na period of six months commencing on July 13, 1954, any balance\nof unexpended funds to be returned To\" Elie Foundation on that\ndate. Early in July I had beeiya^k^Lsed informally that the\ngrant period would begin on the 15tflL and on Eke strength of\nthat l\" began to spend quite arbit of)time on the preliminary\nplanning at mid-July. In ary recent/Letter to you I was not\naware that the July* 15 da& had been formally attached to the\ngrant, but made the suggestlon,y^s you will recall, that Aug¬\nust 1 be taken as the>e#^miiW^date. My suggestion of August\n1 is, of course, rea^indedjNanosJE will commence the accounting\nof my own services/and the pnpjefc^s activity in general as\nof July 15.\nOn the other hand A the initial advance of $2,500.00, which my\nAugust 4 le>fc«^rec\\ested, will stand for the present. I note\n(also something of Mi^h^-i^was unaware) that the $1,000.00\nwhich was being forwarded to me is evidently out of NAEB*s\npocket, 7t he Rockefeller check not yet having been delivered\nwhen Ausmus wrote tfiese letters of August 3. As soon as the\ngrant iA actually y\\ hand I suggest that the $2,500 (or the\nadditiona1! $1,500^bove your first advance, as the case may\nbe) shouldT1^-^w!f^ile^ out. No funds have yet been received\nhere. I would also appreciate some of your voucher forms, so\nthat we can begin an orderly recording and accounting to your\noffice of the expenditures made against your advance.\nIt is mentioned in one of Ausmus*s letters that the equipment\npurchased for this project will revert to NAEB. That is also\nmy understanding. On investigation I have found the Ampex 600\ntape recorder unsuitable for this purpose as well as considera¬\nbly over-priced. I am acquiring instead a Magnecord M33 port¬\nable. I have also found it necessary to purchase a typewriter\nfor use in the project. At the conclusion of the six-month"
}