{
  "id": "d837-64",
  "text": "Box 2002\nUniversity, Alabama\nOctober lU, 195h\nMr. Lewis Hill\nP.0. Box 16\nDuncans Mills, California\nDear Lewis:\nThanks for your note of October 8 in reply to my letter*of September\n2?, though it was not at all necessary to go into such detail.\nI am aware of and in complete accord with the conditions of the grant\nand the purposes of your project. I suggested the possibility of\nbroadcast materials growing out of the project, first; because I think\nyou will develop some programs which will be good materials for broad¬\ncast and, secondly, because I gathered from an earlier note from you\nand from conversations with Si that there was such a possibility. I\nam aware that that is not the purpose of the grant.\nI hope you understand the reason for the request that Skornia be kept\ninformed of progress and that you send him copies of reports, etc.\nThe grant is to the organization and the Foundation will expect NAEB\nto keep records. The NAEB Board of Directors will also expect to\nhave some idea of what is being done. Furthermore, and I*m sure you\nwill agree, it is good organizational procedure to have fairly complete\nrecords on any project which is being carried on in the organizations\nname. I hope you will not let this be a bother or get in the way of\nyour work.\nI have nothing in my file on this subject concerning who will serve as\nNAEB's “representative” for the project; however, I indicated to Si that\nhe and George should continue to work with you on it in whatever way\nthey could be helpful. If that is satisfactory with you, then we can\nclear it for the record.\nJust go on with your work and don11 let the details of the deal bother\nyou. It is sufficiently within the realm of good operational procedure\nas it is if you will just keep Skornia informed. I am interested only in\nyour turning out one of the finest short-term projects which we have\never undertaken and am confident that it will be just that.\nSincerely yours.\nGAtap\nGraydon Ausmus\nPresident"
}