{
  "id": "d837-94",
  "text": "%\ndifferent presentations of Mi work* To facilitate ike gMpsvntiwo evaluat-\nIon© which were regarded as mi integral part of the experiment, each of flee\ngeneral type* of oreeentation wee designated at a series* with e&eh series to\ncomprehend four theoretically similar recordings* one for each poet. In this\nmanner a ©rate-comparison was to he obtained* on the one hand* the same method®\nof presentation applied to four different po#»ts; on the other hand, the same\npoetic material subjected to fire different methods of presentation. The five\nseries were established on the following principles!\nSeries 1\nA half-hour reading from the poet1* works, with\nonly enough comment interspersed to Identify\nthe poet and the poems read. This presentation\nwas to be a rouidi equivalent of the formal\nreadings commonly heard in lecture halls, and\nwas conceived partly as a •control• method for\nsubsequent comparison of different formats.\nSeries II\nA reading of four or five of the poems used in\nSeries 1, with more comment. The style was to\nbe discursive, with an interpretation of the\npoems read leading to a general view of the\npoetIs work and consciousness.\nSeries III\n'Dealing with only a single poem from those in¬\ncluded in Series 11, this was to be a half-hour\nlecture, with most of the discussion interposed\nbetween two readings of the poem. The series\nwas to provide ramayy examples of the formal,\nobjective, discursive approach normally associated\nwith claesrooms, but ranging here from relatively\ntechnical discussion of the poem to colloquial\ncomment on the problems of the •average reader*•\nSeries IT\nPresentation of the same single poem dealt with\nin Series III, but from a wholly subjective view¬\npoint, employing ouasi-dramatic techniques,\nBasic tensions or perceptions implied in the poem\nwere to be extrapolated to the experience of an\nimaginary reader and developed as the •precon¬\nditions* from which the poem itself emerged.\nSeries T\nThe single poem of aeries III and IT, presented\nagain in a format which explored the mingling of"
}