{
  "id": "d837-95",
  "text": "k\ndlimlft and theatrical methods. Certain functions\nof the <lMuntvi method were to he transposed to a\nformat of characterisation and dialogue, and the ore-\nson tat ion m a whole, in its ova ttructure, was to\natt©rapt a more complex analogy of the poet1* mental\nset*\nIt will be understood, of course, that method® of pres eating poetry on radio\nare scarcely leee numerous than those of writing poetry, Ths eerie® designed\nfor this very limited experiment were intended by their 1 mediate contrast to\nsuggest la principle the potential range of methods, bat not at all to re¬\npresent any hypothetical limit of format, conception, treatment, etc. Although\nthe experiment's design was meant to accomodate a direct comparison of different\nmethods applied to the same material, considerable thought was given also to\ndeveloping presentations (Series X-T) on a single poet as an actual sequence of\nfive broadcasts* evolving a view of the poet's work increasingly complex as ths\nsequence progressed from pure reading to pure interpretation. Both as a series\nof oroas-coraparisone and as four different sequences for broadcast, the material\nwae assumed to have Its principal object In devising a gross proof of something\nheld in doubt — that new and effective ways of employing radio for the communi¬\ncation of -poetry are possible, But again, and emphatically, the purpose of ths\ndesign was merely to adumbrate that possibility in general, its actual varieties\nbeing oo-extsnsive with those of it* subject matter, and with the imaginations\nof those who test It*\nla Sections XIX and X? of this report it will be found that the experiment's\ndesign, coupled with the administrative development of a consultants group, out¬\nran considerably the amount of scripting and recording which could be completed\nwithin the allotted time and budget, A further aspect of the project which the\nmm problem has affected is the exposition of its theoretical basis. It was\npart of the original clan that the director's final report would account in"
}