{
  "id": "d837-98",
  "text": "T\nmppott tho thnor atatoi of Infomaticm which nuot Ho ooaroyod on this\n••put of tho pono bofoto any Ola#* dnton has groat ifgrtflMon* la tho pro-\nmnt pvajoot 1% was aooumod, ia th* firat piano. that tho principal concent of\ntho audience It not to loam imiiodiatoly (m It flHf 40 at loiouro, giro® an\ninitial imtoro t) tho toehaical dotsilo of tho pom mo **dot tat io rathor\nto reeoiwo 00390 oxplanatlon of %^3L ^ **• *«4o* tho ltotonor1# first problom\nlo to rooogaioo, and to aoooyt no an intonigihlo am of onporlom*#, tho hama\nnecessity ia which tho wholo pom ha* Ho origin a* a unions eonfrcatatioa aad\nroopoaoo. Thao, for pmrpoooo of dowloing contort, whether ftioowroioo or thoat-\nrioal, a dooloioa at tho ontaot wai nooootary to oneludo, with nogUgiblo o*~\ncaptions, tho data of tho Bow, aad to eonosntrato on tho philosophical,\nhistorical, or othor oaroriontlal origin* of tho pom doing to tho gaostlea, why.\nk wagtto dichotomy hetwoon ©reft aad content io iapUod in this choice, and\nIt oaot ho no tod that any wolMatogmtod pom cut to transcends onalyttoal dis¬\ntinction* of thio sort* 1® dlwisibl© point oxlst* in such o pom vhoro •craft1\nnay ho oaid to and and •content* begin. S»*iy critic taew* «• wch. By tho\nsane token, a comprehension critique mot owaoiao owery monoiit of tho f0oo*0 tort\nand structure ao a ramification of otory othor moment of Its nooning — a task\nwhich exceeds in extension and oonpioxity any possible dimension of broadcasting*\nho see again thorofhro how tho hroadoaotor lo required to choose dollhoratoly\nonly that aspect of a critical mdorotandlng of tho pom which eon hoot ho inter¬\npreted no an inducement to tho study of tho whole*\nfho #why* of tho pom nay of course ho tho topin of a lecture* It may aloo\nho expressed no tho inference from a quasi-dranatie presentation* do has already\nkeen noted, tho present oxporinont aimed to explore both possibilities ao woll no\nthoir mingling, whoa tho experiential genesis ©f a poo* — wiewed in tamo of tho\npeso1* tension* or attitude* — to to ho extrapolated to oom theatrical com-\nooptlon of Its •preconditions • , a problem of personification arlooo. It io"
}