{
  "id": "d1457-4",
  "text": "page 5\nN.IEB NEWS LETTER.Jan. 1, 1940\nOKLAHOMA ROUNDTABLE. Q&_gTATE\nmmm\n&\nThe University of Oklahoma roundtable, a discussion on timely\nevents by faculty members, went on the air in December over the\nOklahoma network originating from the studios of MAD in the\nUnion Tower on the University campus.\nThis program which was conducted throughout last year over WftAD\nbecame so popular that it was placed on the network over seven\nstations reaching every vicinity of Oklahoma. Henderson Leake,\nproduction manager of'the Univarsity station, announces all\nroundtable broadcasts.\n\"MlSfs BjmiSLo^U^\nStriking off the beaten path away from both symphony and swing,\nWfO blazes new trails by exploring the musically exotic and unique\nwith *Adventures in Music*1. a caries devoted to the native folk\nmu5ieT of BatI7~Triaiif ad, oV ina, and other colorful parts of Call.\n(Thua-sday, 4:30-Sa00 P,H.)\nThe program is intended as a kind of musical tour of the world,\ndesigned to emphasise unusual type a of music and to familiarise\nlisteners with musical concept# and oat terns other than the con¬\nvent i anal forms of the theatre and concert hall.,\nThe VooDoo chant® of Brasil, the curiously pleasant bell music of\nBali, the throbbing rhythms of Hindu dance music, the quaint rhumba\nballads of West Indian Calypso, the ancient folk epics of China,\nthe primitive drum ^language\" music of Libssri »theee will be\nsome of the features of* 81 Adyentur e,s_in.„Music.«\nNoted musicologists, -iach a major authority in his field, will\nserv© as commentator $ fox the program®. Their commentary will\nbe illustrated by various Bpooiallats In native folk melodies,\nand by rare -/©cording 3 borrowed from private - colleotioRi#\nColin McPhee, m American composer, who recently spent four\nyears studying music in 11, launches \"Adventures in Music6* on\nJanuary fourth with a session on the music of that glamorous\ncountry, mils in Bali, loFhee- beeei&t friends with the leading\nmusicians and dances of tho Island and even learned how to play\nsome of the native Instruments himself."
}