{
  "id": "d1587-0",
  "text": "tt£R\nOffice of Executive Secretary\nUniversity of Illinois\nUrbana, Illinois\nJuly 1, 1938\nHERE*S SOMETHING FOR YOU TO DO.\nThis is a request for help from seme of the NAEB members and a reminder for others.\n1. Have you voted yet? Remember the fall meeting will be held with Sulzer at the\nUniversity of Kentucky or with Williams at Purdue University. Also send in your\nsuggestion for dates in keeping with questionnaire mailed you recently.\n2. If you have not already sent me a list of names of those persons who have gone\ninto commercial radio through your station, please do so at once. The list is\nneeded by July 15. Also, because your secretary will be on vacation, please send a\ncarbon copy of the list to S. Howard Evans, Secretary, National Committee on Educa¬\ntion by Radio, One Madison Avenue, New York. Howard and President Crane want such\na list pronto. Those names already sent to me, have been forwarded.\n3. What suggestions do you have for fall meeting? What topics should be discussed?\nWhat speakers would you like to hear? How much formal talking? How much group dis¬\ncussion of NAEB problems? Let’s have them at once.\nk. What is yovir station doing now? What are your plans for fall? Why haven’t you\nsent me dope for the News Letter? Why haven’t you sent me dope for the NAEB packet?\nWhy?\n5. The next issue will be as of August 1.\nATTEND MIDWEST SCHOOL-BROADCAST CONFERENCE\nNAEB President Carl Menzer and Professor Bruce Mahan of WSUI and Joe Wright of WILL\nattended the Midwest School-Broadcast Conference which was held in Chicago June 18\nand 19 under the auspices of the Chicago Schools Radio Council.\nWASHINGTON DOPE IN A NUTSHELL\nThe situation in Washington ended with the adjournment of Congress about as follows:\nThe White Resolution in the Senate was brought up for discussion in the closing\ndays of the session. Two senators objected to its consideration. The evidence\nwas that long debate would be required before the vote could have been had and so\nthe entire resolution was allowed to die.\nIn the House, hearings were held by the Rules Committee to decide whether or not to\nlet the House vote on the question of an investigation. The hearings were extended\nand considerable personal bitterness developed. However, the Rules Committee voted\nfor the bill and brought it up in the House, It was defeated by a vote of more\nthan two to one. The interesting thing is that every conceivable pressure from the\nWhite House was brought to bear to defeat the resolution. The pressure was so"
}