{
  "id": "d1587-1",
  "text": "2\nstrong that MacFarlane, on© of the three advocates of the measure, found himself in\na position, where to secure the presidential support which he felt essential to hie\nre-election to Congress, he had to vote against the measure.\nThe situation then is clear in certain respects. There will not be any congression¬\nal investigation so long as the present administration is in power. There is, of\ncourse, to be the investigation of monopoly by the FCC itself and supposedly the\ncongressional committee investigation of the subject of monopoly in all industries\nwill .pay some attention to radio. However, none of these is apt to be thorough\nenough to propose any constructive changes in the present broadcasting setup.\nNAEB members surely are aware that the Havana Treaty has been accepted by the Senate\nand that in accordance with its provisions the reallocations of facilities within thf\nregular broadcast band is certain to take place,perhaps not immediately, but within\nthe next year or so. This means that educational stations who are going to make ap¬\nplication for a better position ought to get those applications in Just as soon as\npossible.\nLEGAL PROTECTION FOR RADIO PROGRAMS\nBy Professor Fredrick S. Siebert, J. D.\nUniversity of Illinois School of Journalism\nThe author, sponsor, or other interested party frequently has occasion to attempt to\nprotect a particular program from piracy by other sponsors or radio stations. How\ncan such protection be acquired under the existing statutes? The Federal copyright\nstatute does not list radio programs or continuity as one of the types of material\nwhich are copyrightable. However, there is a sufficient similarity between a radio\nprogram and certain of the classifications listed in the statute to make it possible\nto obtain copyright protection. The two applicable classifications are 31 dramatic\nwork\" and \"musical compositions.\" A radio program presents elements of similarity\nto both of these and the protection sought is the same in each case. What the radio\nwriter wishes to protect is the unauthorized presentation of his program. The play¬\nwright and composer seek the same protection.\nTo obtain copyright protection the author of a radio program or continuity should\nhave it typewritten in the form in which it is to be presented over the air. Two\ntypescripts should then be mailed to the Register of Copyrights, Washington, D.C.\nThis registration establishes the writer's ownership of the program and affords\nhim a basis for contesting any other claims.\nSuch copyrighting of a continuity, however, does not prohibit a competitor from\nduplicating the central idea of the program. Neither the actual phraseology nor the\norganization can be duplicated by another writer, but the central idea is not pro¬\ntected by copyright. The only protection for such an idea would be on the ground\nof unfair competition where one radio writer so duplicated the form of continuity as\nto confuse the listeners as to the authorship. The title of a program, although\nnot copyrightable under the Federal act, can be protected by registration as a\ntrademark. This registration establishes the registrant's prior ownership.\nKFUO ENCOURAGES LEAGUE MEMBERS\nIn the GOSPEL VOICE of KFUO for July announcement is made of coin banks which hold\n$5, namely 10 nickels, 15 dimes, and 12 quarters, which will be sent listeners upon\nrequest. Filled and sent in, they create memberships in the KFUO League for one\nyear."
}