{
  "id": "d1587-16",
  "text": "-17*\n- The investigation was not directed towards avowed fascists but rather to the general\npopulation. Its purpose was to discover the traits in the \"potentially fascistic\nindividual11 which render him particularly susceptible to anti-democratic propaganda\nFor this reason the study was concerned not with overt behaviour but first of all\nwith the attitudes, opinions, and values. Psychologically, opinions, attitudes, and\nvalues are \"on the surface\"; yet the emotional charge in questions concerning minor¬\nity groups is so great that “the degree of openness with which a person speaks will\ndepend upon the situation in which he finds himself.'* One might therefore distin¬\nguish between the open, and the partly submerged attitudes. Both of these can be\nmeasured by the use of the appropriate techniques without too much difficulty. Still\na third level, however, consists of the deeper layer which is even more out of sight.\n\"The individual may have 'secret* thoughts which he will under no circumstances\nreveal to anyone else if he can help it; he may have thoughts which he cannot admit\nto himself, and he may have thoughts which he does not express because they are so\nvague and ill-formed that he cannot put them into words.\" It is at this level that\nthe authors concentrate their search for the factors making for the potentially\nfascist personality. As they put it,\n\"What people say, and to a lesser degree, what they really think depends very\nlargely upon the climate of opinion in which they are living; but when that\nclimate changes, some individuals adapt themselves much more quickly than\nothers. If there should be a marked increase in antidemocratic propaganda, we\nshould expect some people to accept and repeat it at once, others when it\nseemed that 'everybody believed it** and still others not at all.\"\nThey were also concerned with the relation between this \"ideology-in-readiness and\n- the person's capacity for expressing it in words and action..\nViewing the personality as \"a more or less enduring organization of forces within the\nindividual,\" they perceive these forces as \"readinesses for response.\" They see\nthese forcbs as \"primarily needs (drives, wishes, emotional impulses)'Which vary from\none individual to another in their quality, their intensity, their mode of gratifica¬\ntion, and the objects of their attachment, and which interact with other needs in\nharmonious or conflicting patterns.\" This basically Freudian theory is however\nplaced in a. social context. While the authors view the personality forces as deter¬\nmining ideological preferences, they recognize that the personality forces are them¬\nselves the product of environment. Denying the existence of \"innate\" or \"racial\"\npersonality forces, they see the individual's personality as conditioned by his\nsocial, religious, and economic environment, and give great weight to the nature of\nthe child training in the family life setting.\nThe Authoritarian Personality is a monumental work, conducted by a team of competent\npsychologists over a period of years, and as a joint project of the Berkeley Public\nOpinion Study and the Institute for Social Research, at the University of California.\nIt reports over a span of almost 1,000 pages on the use of every pertinent tool of\nanalysis in the investigation of the problem. Chapters are devoted to the develop¬\nment of questionnaires for measuring the kind and amount of anti-semitism, political-\neconomic ideology, ethno-centrism (hostility to outgroups). An extremely interesting\nchapter (VII) explains why and how a test was constructed to measure \"implicit anti¬\ndemocratic trends\" — called the F (for Fascist) test. What makes this test partic¬\nularly useful is the fact that its items are all neutral; that is, not directly re¬\nlated to prejudice. Persons taking it therefore reveal their underlying attitudes\nwithout realizing the fact. Scores on it correlate *75> with the test for ethno-\ncentrism and .57 with the test on political-economic ideology. Your reviewer is\ncurrently using the F scale test experimently with subjects at the University of\nIllinois. You too might consider piling around with it in your work."
}