{
  "id": "d1587-4",
  "text": "-5-\nUNIVERSITI OF MIAMI TV NEWSREEL ON WTVJ\n(-\nUniversity of Miami (Fla.) Radio and Television Department's weekly television news¬\nreel is receiving praises from University officials and station executives as a co¬\noperative project.\nPossibly the first TV newsreel regularly produced by a university, this five-minute\nvideo summary of the week's events on the campus has high public relations value for\nthe institution while offering unique training opportunities for television students.\nAfter carrying the program in choice newstime since last October, WTVJ executives\nrequested it be continued as a regular cooperative contribution to the station’s\npublic service programming. \"Campus Newsreel\" is carried at 5>;ij.5> p.m. Saturdays,\nbetween a sports show and the station's local news program.\nThe four minutes of footage averages four subjects a week. Besides praise for the\nselection of events, Lee Ruwitch, WTVJ vice president and manager, emphasized that\nexcellent use of theme and background music gave the reel professional finish and\nexceptional viewer appeal.\nStudent Project Under Faculty Direction\nThe reel runs approximately l£0 feet on the air. Careful planning cuts down total\nshooting to about 300 feet a week. The project is under the direction of Prof.O.P.\nKidder, Jr., (formerly of WRGB, Schenectady), chairman, of tie Radio and Television\nDepartment. Studentsof the department's motion picture workshop course are organ¬\nized into three teams of three men each for shooting assignments. John Murphy, sen¬\nior radio-TV major, of Evanston, Illinois, is student supervisor. Team chiefs take\nassignments from him and class edits film under his direction.\nDeadline for delivering footage for processing is 2 p.m., Friday, except for late\nspecial events. WTVJ processes the film in its laboratories. Students edit the\nreel Friday evening and Saturday morning in the campus cutting room. Commentary for\nlive student announcer is written Saturday and special music is pulled from depart-\nnent’s sizable library.\nMusic is dubbed via presto recorder on two alternating discs at 78 r.p.m., each\nsequence being spaced separately on disc, so that audio operator seques manually on\nque from Student Murphy who sits with him in control room.\nReel is photographed on Eastman blue-base negative with Bell and Howell 70—H l6mm.\ncamera, using three—lense turret and extra lense. Lenses 0.7*S 1% 2\", and 2\".\nProfession Junior tripod is used.\nFor frequent interiors a bank of four $-2 reflector photofloods is attached to camera\nor tripod. Special situations are lighted by #h photofloods in large reflectors on\nstands.\nKidder Says: \"Ideal\" for Training Students\nFrom the student-training point of view, prof. Kidder states; \"The weekly newsreel\nproduced for actual on-the-air programming is ideal for training motion picture and\ntelevison students. Meeting the deadline weekly gives the .oject zest for the\nstudents. A campus provides a wide variety of newsreel subjects, ranging from^\nsymphony concerts and art gallery openings to swift-action sports and student fun.\nBesides acquiring technical skill and judgement, the student camera teams, editors,\nwriters, announcers, and music personnel learn effective cooperation.\""
}