{
  "id": "d1587-6",
  "text": "^ TWENTIETH CENTURY FUND TV SERIES DEVELOPED7AT SYRACUSE\nExperimentation in developing formats for television programs dealing with economics\nwill begin shortly at the Radio Television Center, Syracuse University, under sponsor¬\nship of the Twentieth Century Fund*\nThe research project was approved by the Twentieth Century Fund on March 21st as a\nresult of a presentation made by the University last December# The purpose of the\nproject is to determine the most effective methods of presenting economic information\nvia television to the lay public.\nAll research and experimentation will be conducted in the city of Syracuse with Ed¬\nward C. Jones in charge of coordinating the project, Don Iyon in charge of scripts\nand production, and Lawrence Myers in charge of research. Arthur Weld will direct\nthe series. All are staff members of the Radio Television Center. Coordinator of\nthe project at Twentieth Century Fund is Thomas Carskadon, Chief of the Education\nDepartment.\nBriefly the research and experimentation will consist of the presentation of programs\nbroadcast from the University’s television studios on campus over WSYR-TV. Three\nprograms in all, each using an experimental format, and based on economic research\ninformation supplied by the Fund, will be broadcast on succeeding weeks in April.\nEach program will employ a format different from the other two in the manner of pres¬\nentation. Audience reaction tests and interviews with listeners will be conducted\nto determine the relative impact of each particular format. The experimental pro¬\ngrams have been scheduled over WSYR-TV for 6*30 - 7:00 April 5th, 12th, and 26th.\nIn early correspondence regarding the proposed experimentation, Mr. Carskadon said*\n\"Our aim in this whole project is to explore television as a medium for carrying to\nthe public the results of the Twentieth Century Fund research surveys.\n\"Mare specifically we are interested to see if the educational television stations\noffer a fruitful line of cooperation for us in their ability to handle our type of\nmaterial and bring it before an interested and sympathetic audience.\"\nJones emphasized that the University is extremely anxious to take part in such \"ex¬\nplorations into television's unknown.\" \"Certainly,\" he said, \"efforts like these are\nessential in determining more about television's vast potential and in assuring that\nit will become a mature and respohsible medium.\"\nWBKY PREPARES \"TRANSPORTATION KENTUCKY\"\nThe University of Kentucky's VfflKI is now producing a series of nine on-the-spot 30\nPrograms to.be ent^tled \"Transportation Kentucky.\" These programs deal re-\na V trunk llr!e railroad, a short line railroad, a terminal railroad,\na national air line, a feeder air line, a highway truck line, a highway bus line, a\nnver carrier and a captive barge line. J ’ a\nElrter G. Sulzer, Head of the Department of Radio Arts at the University of Kentucky\n—--- itas?\nUNIVERSITY OF MICHIGAN OFFERS TV SERIES\nM^Vvf7 iE^ttleViSing a l5-week telecourse on political parties on its University of\nMichigan Television Hour. The series began Sunday, February 17.\nWil1 ^S° °ffer tW° 7\"Week courses on understanding numbers and the\nsoiar system during the new semester. Registrations for the course are handled bv\nthe University's extension division office. nancuea Dy"
}