{
  "id": "d884-23",
  "text": "ENTRY CLOSING DATE\nAll records must be shipped prepaid to the Institute for Education by\nRadio, Ohio State University, Columbus, Ohio, to arrive on or before\nMarch 15, 1939. All programs entered must have been broadcast later\nthan March 15, 1938, and previous to March 15, 1939.\nPHYSICAL SPECIFICATIONS FOR RECORDS\nAll programs must be recorded in entirety for the full time the program\nis broadcast. The programs need not be recorded directly from the air,\nhowever, but may be specially staged for recording purposes. Any type\nof recording will be acceptable, and the jury will endeavor to consider\nonly the character of the program and not the quality of the recording.\nRecords must be on disks laterally cut at 33 RPM or 78 RPM.\nAWARDS AND HONORABLE MENTIONS\nThe Institute for Education by Radio, upon recommendation from the jury,\nwill make “First Awards” and “Honorable Mentions” on the basis of the\nseven classes of programs in each of the two major classifications. In\ngeneral, this provides for fourteen “First Awards” and fourteen “Honorable\nMentions.” However the judges may, at their discretion, withhold awards\nand honorable mentions in those classes in which no programs appear\nworthy of this recognition. Similarly they may, in unusual circumstances,\ngive more than one “First Award” or “Honorable Mention” in a single\nclass when the programs entered seem to justify such recognition. Pro¬\ngrams and organizations receiving awards or honorable mention will be\ngiven special notice in Education on the Air, the proceedings of the Insti¬\ntute for Education by Radio, which will be published by the Ohio State\nUniversity in the fall of 1939. The awards will be announced at the 1939\nmeeting of the Institute, and the programs given awards will be played,\nso far as time permits, at a special session.\nJUDGING COMMITTEE\nThe final jury on awards will consist of prominent persons selected because\nof their ability to judge program production, educational objectives, and\naudience interest.\n« 5 »"
}