{
  "id": "d1155-1",
  "text": "NAE8 NEWS LETTER\nPage 2\nOther programs included on the new Sunday ft HA schedule are \"Varsity C\nWisconsin alumni;- Program *of the Week, repeat on the week’s best\nbroadcast; and a number of Ft me musical offerings such as Vesper\nJnion music Hour, Urgan Reverie, ano The Sunday Noon Lus^cale.\nTEACHERS PLAN PnOGRAfuS rOK SCHOOLS\nMoods for travel, moods for finding out—mooos ©f all kinds—escape,\nSPORTS, LAUGHS, MAKING FRIENDS—FIND EXPRESSION IN THE SERIES OF BROAD¬\nCASTS FOR HIGH-SCHOOL YOUTH KNOWN AS \"INVITATION TO READING.\" THE PRO¬\nGRAMS ENCOURAGE LEISURE TIME READING BY GIVING SAMPLES OF RECOMMENDED\nWRITINGS.\nTeachers of English, through their radio committee in the Wisconsin\nEducation Association, have arranged the broadcasts f.or school-room\nLISTENING AND PREPARED A HANDBOOK TO SUPPLEMENT THE PROGRAMS.\n\"Invitation to Reading\" is broadcast by wha, Madison and WL8L, Stevens\nPoint, at 1:30 each Monday afternoon. In addition to the school groups\nTHE PROGRAMS ARE HEARO BY MANY ADULT LISTENERS. THE WISCONSIN SCHOOL\nOF THE A|R PROVIDES SPECIAL EDUCATIONAL FEATURES EACH SCHOOL-DAY AT\n9:30 a.m. ano I:30 p.m.\nKftSC SCHOOL OF THE AIR\nThe KWSC School of the Air, a group of educational programs presented\nBY THE RADIO SERVICE OF THE STATE COLLEGE OF WASHINGTON, OFFERS ONE\nHUNDRED AND FORTY-EIGHT EDUCATIONAL PROGRAMS EACH WEEK IN ADDITION\nTO OTHER KWSC BROADCASTS FOR PUBLIC SERVICE AND ENTERTAINMENT. FlFTY-\nSIX OF THE PROGRAMS ARE LISTED AS CURRENT EVENT FEATURES, TWENTY SIX\nAS EOUCATIONAL MUSIC PROGRAMS, TWENTY AS AGRICULTURAL PROGRAMS AND\nSIXTEEN PERTAINING TO LITERATURE. THERE ARE TWELVE HOME ECONOMICS\nPROGRAMS AND SIX FEATURES ABOUT SCIENCE.\nSeven thousand students, faculty members, and visitors filled the Len s\nGymnasium at the State College of Washington when Alumnus Edward R.\nMUR ROW, ACE C.8.S.- CORRESPONDENT, SPOKE ON JANUARY 29.\nMURROY/ APPEARED BEFORE THE MICROPHONE OF THE STATION AT WHICH HE RE¬\nCEIVED HIS FI RSTr RADIO EXPERIENCE. KWSC, OWNED AND OPERATED BY THE\nState College of Washington, now broadcasts eighty hours a week with\n5000 WATTS PO'\"Eft. NOTED for its training in engineering *no operating,\nAS WELL AS IN RADIO SPEECH, WRITING, AND MANAGEMENT, THE ^ T A T E COLLEGE\nof Washington has placed at least 89 graduates in professional radio\npositions.\nWNYC ADDS TWO DEFENSE' PROGE-V.Lv\nWNYC, New York City, added two more defense programs to its schedule:\non Thursday, January 22. Presented in cooperation with City College,"
}