{
  "id": "d201-111",
  "text": "-7-\nRICHTER: There is much that cculd still be said about employee\nAND EMPLOYER ATTITUDES TOWARD MATTERS OF DISCRIMINA¬\nTION. NOW LET US LOOK AT A MEANS OF COPING WITH THE\nDISCRIMINATION PROBLEM THAT HAS GROWN UP SINCE ABOUT\nTHE TIME OF THE BEG INN I NG OF iORLD ^AR II... AND THAT\nMEANS IS THE FEPC’S—THE FAIR EMPLOYMENT PRACTICE\nCommissions. These constitute a phenomenon of the\n1940*5 and 50’s. The first state to pass Fair\nEmployment Practice legislation was New York. In the\nfollowing, Mr. Elmer Carter, Commissioner of the New\nYork State Commission against discrimination gives\nus a vivid idea of how the New York FEPC functions,\nin a statement he made to us in New York City in the\nfall of 1958.\nC\\RTER: The law provides that in the event a person applies\nfor a job and he feels he’s rejected because of his\nrace, or color, or creed, or national 0rigin, he may\nfile a complaint with the commission which has been\ncreated in order to secure redress and a remedy for\nDENIAL OF HIS CIVIL RIGHTS. THE LAW ALSO PROVIDES\nTHAT IT’S AN UNLAWFUL EMPLOYMENT PRACTICE TO DIS¬\nCRIMINATE IN THE TERMS AND CONDITIONS AND PRIVILEGES\nOF EMPLOYMENT EVEN WHEN YOU’RE EMPL0YED--THAT IS, TH\nYOU CANNOT, IF YOU EMPLOY A PERSON WHO IS A NEGRO,\nor Italian, or Jewish person, or a Puerto Rican, you\nMAY NOT HAVE A DIFFERENTIAL WAGE OR DIFFERENT CONDI¬\nTIONS OF EMPLOYMENT FOR THEM BECAUSE OF THEIR RACE O'\nCOLOR. /«ND THE, BASES OF PROMOTION IN THE ECHELON\nOF PROGRESSION IN EMPLOYMENT SHALL NOT BE DENIED,\nRESTRICTED, OR OBSTRUCTED BECAUSE OF RACE, OR CREED.\nOR COLOR, OR NATIONAL ORIGIN. So THAT A PERSON WHO\nNOT ONLY FEELS T H., T HE’S BEEi REJECTED FOR EMPLOYMEN\nBECAUSE OF HIS RACE, CREED, COLOR OR NATIONAL ORIGIN\nBUT WHO FAILS TO SECURE PROMOTION, OR WHO FEELS THER\nA DIFFERENTIAL WAGE, OR AN ASSIGNMENT OF DUTIES WHlq\nARE BASED UPON RACE, CREED, COLOR OR NATION ORIGIN,\nMAY FILE A COMPLAINT WITH THIS COMMISSION. On THE\nFILING OF THE COMPLAINT, THE CHAIRMAN OF THE COMMISS\nWHICH IS COMPOSED OF FIVE MEMBERS APPOINTED BY THE\nGovernor of commissioners and direct him to initiate\nAN INVESTIGATION. The INVESTIGATING COMMISSIONER,\nWITH A MEMBER OF THE STAFF, INVESTIGATES THE CHARGES\nOF THE COMPLAINT—THE CHARGES WHICH HAVE BEEN MADE\nALLEGING DISCRIMINATION. ■ j H E N THE INVESTIGATION IS\nCOMPLETED, THE INVESTIGATING COMMISSIONER MUST ATTEM\nTO ELIMINATE THE UNLAWFUL EMPLOYMENT PRACTICE COM¬\nPLAINED OF, WHETHER IT’S THE REJECTION OF THE PERSON\nBECAUSE OF HIS COLOR, DISCHARGE, A FAILURE TO PROMOT\nBY CONFERENCE, CONCILIATION, AND PERSUASION IF HE\nMAKES A FINDING OF PROBABLE CAUSE TO CREDIT THE\nALLEGATION IN THE COMPLAINT."
}