{
  "id": "d201-112",
  "text": "C'.RTER:\nSCHNEIDER :\nRICHTER:\nMUSIC:\n\\NNCR:\n*T HAS BEEN DEMONSTRATED BEYOND THE SHADOW OF A\nDOUBT THAT LEGISLATION IS ONE OF THE GREAT DETERRENT\nOF DISCRIMINATION IN EMPLOYMENT, AND LEGISLATION CAN\nACHIEVE A WIDENING OF OPPORTUNITY, THE LESSENING OF\nDISCRIMINATION ON BASIS OF RACE, COLOR, CREED, OR\nNATIONAL ORIGIN, AND MORE THAN THAT—THAT LEGISLATIOI\nSERVES TO AROUSE THE CONSCIENCE.\nThirteen years of the experience of the Commis¬\nsion of the State of New York dissipated forever\nCERTAIN LEGENDS OR MYTHS OR CONCEPTS WHICH WERE PRE¬\nVALENT DURING THE DISCUSSION AS TO THE EFFICACY OF\nSUCH A LAW. The idea advanced in the early days of\nTHE DISCUSSION OF THE LAW AGAINST DISCRIMINATION\nPRIOR TO ITS PASSAGE, THAT THE INTRODUCTION OF A\nCOLORED PERSON INTO THE WORK FORCE OF AN ORGANIZATION\nWHERE NO COLORED PERSON HAD EVER BEEN EMPLOYED OEFOR-\nIN A JOB CATEGORY ABOVE THE LEVEL OF THE MENIAL,\nWOULD CAUSE A STIMULATION OF RACIAL ANTIPATHIES AND\nANTAGONISMS, HAS BEEN PROVEN TO BE ABSOLUTELY WITHOUT\nVALIDITY.\nMr. Carterts statement is a strong one in favor of ti-\nVIEW THAT LEGISLATION CAN MAKE A CONTRIBUTION TOWARD\nELIMINATING DISCRIMINATION. IN OUR LAST PROGRAM, IN\nTHE COURSE OF DISCUSSING THE NEGRO'S MIGRATION AND\nURBANIZATION, WE REMARKED THAT MANY OF THE PROBLEMS\nINCIDENT TO THAT MIGRATION AND URBANIZATION NEEDED\nAN APPROACH AT THE LEVEL OF PUBLIC PLANNING. THERE\nSEEMS TO BE WARRANT FOR A SIMILAR CONTENTION IN THIS\ncase. Intervention, at crucial points and on crucia\nPROBLEMS, BY PUBLIC AGENCIES IS, I WOULD SUGGEST, AN\nIMPORTANT PART OF AN OVERALL STRATEGY DESIGNED TO\nWORK TOWARD THE ? S 0 L U T I 0 N !? 0 F OUR RACIAL PROBLEMS.\nIN CONCLUSION THEN WE MAY SAY THIS! ISSUES EXIST IN\nTHE SPHERE OF SUCH THINGS AS MIGRATION, URBANIZATION\nAND THE DISCRIMINATION. *E HAVE'D1SCUSSED TODAY THE\nOVERALL APPROACH TO STRUCTURES CF RELATIONSHIPS.\nHence the need for the sort of thing Mr. Carter\nstresses. In our discussion of Negro employment, we\nHAD AS OUR GUESTS TODAY, VIA TAPE RECORDING, Or.\nRayford Logan, Professor of History at Howard Univer\nity; Or. Irwin Sobel, economist at Washington Univer\nity in St. Louis; ans Mr. Elmer Carter, Commissioner\nof the New York State Commission Against Discrimin¬\nation. Next week we take up the topic of housing,\nAS WE CONTINUE TO DISCUSS \"THE LAST CITIZEN,\" The\nNegro in America,\nTHEME UP AND UNDER\nYou HAVE BEEN LISTENING TO Or. LOUIS ScHNEIDER,\nProfessor of Sociology at Purdue University and the"
}