{
  "id": "d201-116",
  "text": "-3-\nSCHNEIOER:\nRICHTER:\nSCHNEIDER:\nAREAS, If we contrast that with communities from\nwhich Negroes a re effectively excluded by a great\nVARIETY OF DEVICES, WE DISCOVER THAT DURING THE SAME\nPERIOD OF TIME THE RATIO OF HOMES TO INCREASED POPU¬\nLATION WOULD BE, IN ONE COMMUNITY, 1.4 HOMES FOR EVER\nADDITIONAL PERSON. IN ANOTHER THE RATIO WAS I TO 2;\nANOTHER I TO 1.5, AND SO FORTH. I MIGHT POINT OUT\nALSO THAT IN THESE AREAS OF HIGH MINORITY GROUP CON¬\nCENTRATION IN WHICH WE SEE CONCENTRATION AND OVER¬\nCROWDING CONTINUING , > T A RAPID RATE, THESE WERE A L R E\nTHE MOST OVERCROWDED AREAS IN THE CITY OF LoS > N G E L E’\nSo WHAT WE SEE DEVELOPING HERE IS SOMETHING THAT WE’v\nNEVER HAD BEFORE IN LOS > NG E L ES ClTY AND THAT IS THE\nDEVELOPMENT OF AN OVERCROWDED SITUATION WHICH WILL\nRESULT IN SLUMS THE LIKE OF WHICH WE HAVEN’T HAD IN\nthe West, which the East has been crying about for sc\nMANY YEARS. THIS INEVITABLY, IT SEEMS TO ME, WILL\nRESULT IN INCREASED CRIME AND DELINQUENCY, WHICH WILL\nOF COURSE CALL FOR INCREASED SOCIAL SERVICES, POLICE\nPROTECTION, PROBATION SERVICES AND AN I N C R E \\ S E IN\nTAXES .\nIt’s evident, then, that there is, for the Negro, a\nSHEER PROBLEM CF FINDING SPACE AND HOUSING FACILITIES\nLos Angeles merely ILLUSTRATES THE PROBLEM; IN FACT,\nTHE PROBLEM IS COUNTRY-WIDE. AND, OF COURSE, THERE\nIS THE FAMILIAR ASSOCIATED PROBLEM OF NEGRO PRESSURE\nTO MOVE OUTSIDE DELIMITED AREAS INTO PORTIONS OF A\nCITY HITHERTO MORE OR LESS EXCLUSIVELY INHABITED BY\nWhites,\nVell, Lou, a question many people might ask is why\nNegroes wish to move into white neighborhoods.\nThe Negrq_s»mply needs space. \\lso, he shares in\nAmerican culture and aspirations and wishes to reali\nTHE SAME IDEALS AND ENJOY MUCH THE SAME GOODS AS HIS\n»HITE NEIGHBOR. HlS BEST CHANCE OF DOING THESE THIN:\nIS TO ESCAPE THE RESTRICTIONS AND HANDICAPS THAT DEF¬\nINITELY TEND TO BE IMPOSED UPON DENSE, ALL-NEGRO\nSETTLEMENTS IN OUR CITIES. BUT, OF COURSE, THE NegRl\nDOES NOT HAVE AN EASY EXIT, AND IF ANYTHING AT ALL I\nWELL KNOWN ABOUT THE MINORITY HOUSING SITUATION IT I\nTHE CIRCUMSTANCE THAT THE NEGRO VERY FREQUENTLY FACE C\nFIRM OPPOSITION WHEN HE TRIES TO MOVE OUT. He’s\nPRESSURED BY LACK OF SPACE; HE’S MOTIVATED BY THE\nDESIRE TO HAVEA SO-CALLED DECENT STANDARD OF LIVING.\n..INCREASINGLY, NEGROES ARE SO MOTIVATED; HE?S\nPROMPTED BY THE REALI ST I C CONS IDERATI ON THAT ALL-\n|NlEGRO COMMUN I T IES-—UNLESS THERE PREVAIL SPECIAL\nCIRCUMSTANCES TIED UP WITH NEGRO VOTING POWER AND\nPOLITICAL INFLUENCE-—ARE GIVEN INFERIOR SERVICE. S0\nPUSHED AND IMPELLED, THE NEGRO YET CONFRONTS FAMILIA\nOPPOSITION AND HOSTILITY THAT HE DOES.'"
}