{
  "id": "d201-119",
  "text": "-6-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nnon-Ahite families. It is a situation of the Vhite\nresidents’ own making, and has nothing to do with the\nCULTURAL, MORAL, OR SOCIAL CHARACTERISTICS OF ONE OR\nTWO MINORITY GROUP FAMILIES THAT HAVE MOVED INTO THE\nNEI GHB ORHOOD.\nDon’t I detect in this our old friend, or perhaps I\nSHOULD SAY OUR OLD ENEMY, THE SELF-FULFILLING PROPHEC\nI THINK YOU DO.\n,,Ll right. Showing that white residents of a communi\nPRODUCE A P ANI C ALL BY THEMSELVES, AT TIME, IS ALL VE\nWELL. DUT, ISN’T THERE ONE QUESTION WHICH IS BOUND T:\nCOME UP - WHICH HAS TO ANSWERED? THAT IS, DON’T\nMEMBERS OF MINORITY GROUPS, LIKE THE NEGRO, OFTEN SH\nTENDENCIES TO SPOIL AND DIRTY GOOD FACILITIES, AND TO\nBRING CIVICLY AND SOCIALLY UNDESIRABLE TRAITS AND\nBEHAVIOR INTO A NEIGHBORHOOD?\nLet me suggest, for one thing, in answer to this\nQUESTION THAT THERE IS OBVIOUSLY A GREAT DEAL OF\nSTEREOTYPING - A STEREOTYPY THAT HAS TO BE CLOSELY\nSCRUTINIZED. |N H|s STUDY OF FORBIDDEN NEIGHBORHOODS\nthe housing expert, Charles Abrams, notes that when\nthe Chinese fif<oT came to the United States and were\nNEEDED, THEY WERE REGARDED AS CLEAN, WERE HIRED AS\nCOOKS,’AND WERE CONSIDERED TO KEEP FINE RESTAURANTS.\nBut in time, for reasons having little or nothing t\ndo with the actual habits of personal cleanliness OF\nthe Chinese, many came to regard them as notably\nunclean. Abrams also makes this obvious enough, but\nNECESSARY, COMMENT ABOUT THE NEGRO, <f/HS LONG AS THE\nNegro is the servant or cook, he or she could cook\nour food, make our beds, bundle our children, sleep\nin the same room with them. The picture of \\unt\nJemima mixing pancakes does not hurt the sale of\npancake flour. .*nd the portrayal of the Negro Full-\nman Porter tidying up our berths is acceptable and\nEVEN REASSURING. SuT SINCE THE NEGRO HAS MOVED TO\nTHE CROWDED CITIES HE HAS STEPPED INTO THE OLD IMMI¬\nGRANT’S image. The SLUMSARE HIS FAULT, THE FAILURE\nOF THE CITY TO COLLECT GARBAGE IS TRANSLATED INTO\nA VISION OF THE NEGRO LIVING IN A HOUSEFUL OF FILTH,\nTHE FAILURE OF THE LANDLORD TO MAKE REPAIRS OR TO\nSUPPLY EXTERMINATION SERVICES, CAUSING THE ACCUMULA¬\nTION OF RATS AND VERMIN IN HALLS AND CELLARS^ IS\nAUTOMATICALLY IMPUTED TO THE NEGRO’S HABITS.” SUREL\nTHERE IS GREAT MERIT IN THIS STATEMENT BY IVlR . > B R A M S\n3uT THE RACIAL FACTOR IS STILL COMPLICATED BY CLASS\nFACTORS. As WE VERY WELL KNOW, IT IS STILL THE CASE\nthat the Negro class structure is, so to put-it,\npitched low. Levels of income and education, are\nSTILL NOTABLY DEPRESSED IN THE NEGRO, BY COMPARISON"
}