{
  "id": "d201-12",
  "text": "-2-\nSCHNEIDER:\nRICHTER:\nHOWDEN:\nprejudice: Voltaire wrote that prejudice is opinion\nWITHOUT JUDGEMENT. W|LLlAM HAZLITT DEFINED PREJUDICE\nAS THE CHILD OF IGNORANCE. AND THE AMERICAN AUTHOR,\nAmbrose Bierce called prejudice a vagrant opinion\nWITHOUT VISIBLE MEANS OF SUPPORT. I THEN TURNED TO\n.EBSTER’S COLLEGIATE DICTIONARVWHICH DEFINES PREJUDICE\nAS PRECONCEIVED JUDGEMENT OR OPINION; UNREASONABLE\nPREDILECTION OR OBJECTION; ESPECIALLY, AN OPINION OR\nLEANING ADVERSE TO ANYTHING WITHOUT JUST GROUNDS OR\nBEFORE SUFFICIENT KNOWLEDGE. IN ALL OF THESE DEFINI¬\nTIONS THERE IS AN EMPHASIS ON LACK OF KNOWLEDGE. YET,\nON THE BASIS OF MY OWN EXPERIENCE, THEY’RE INCOMPLETE.\nTHEY FAILED TO TAKE INTO ACCOUNT THE EMOTIONAL FACTORS\nOF PREJUDICE. ./HAT DO YOU SAY ABOUT IT, LOU?\nAS ONE PSYCHOLOGIST PUT IT, PREJUDICE INVOLVES AN ATT¬\nITUDE OF FAVOR OR DI SFA V0R . . .AND IT INCORPORATES AN\nOVERGENERALIZED BELIEF. THUS PREJUDICE BECOMES A\nCOMBINATION OF THINGS: THE 0VERGENERALIZED BELIEF\nSUGGESTS THE FACTOR OF IGNORANCE. AND THE ATTITUDE OF\nfavor or disfavor brings in the emotional disposition.\nWHICH IS CERTAINLY ALSO A PART OF PREJUDICE. NOW,\nMANY PROPLE FEEL THAT PREJUDICE AND DISCRIMINATION ARE\nTHE SAME THING. TrEY ARE RELATED, TO BE SURE, BUT,\nTHEY’RE DISTINCT PHENOMENA.\nWell, I had the pleasure, some time ago, Lou, of\nspeaking with a man who discussed this very point.\nEd Howden, Executive Director of the San Francisco\nCommission of Equal Employment Opportunities...a man\nWHO HAS SPENT MANY YEARS WORKING IN THE AREA OF INTER-\nGROUP relations:\nThere’s a common and widespread assumption that dis¬\ncrimination FLOWS FROM PREJUDICE. <ELL, IN THE TERMS\nOF THE POPULAR SONG ?lT Ain’t NECESSARILY So1’. YOU\nCAN HAVE, LET US ASSUME A COMPLETE FREEDOM FROM PER¬\nSONAL PREJUDICE. YOU ARE AN INFORMED INDIVIDUAL.\nYou KNOW THE FACTS OF MODERN ANTHROPOLOGY.No IN¬\nNATE DIFFERENCES BETWEEN RACES...NO INNATE DIFFERENCES\nIN INHERENT MENTAL CAPACITY, ETCETERA, ETCETERA. So\nTHAT YOU DON’T HOLD ANY OF THESE MYTHOLOGICAL TRIBAL\nnotions. And yet, you.;.and of course I’m uaiNG this\nHIGHLY IMPERSONALLY, M R. RI CHTER . . .MAY BE A HOMEOWNER\nON A BLOCK WHO HAS BEEN TOLD, PRESUMABLY ON VERY GOOD\nAUTHORITY, WHAT HAPPENS TO PROPERTY VALUES AND A LOT\nOF THINGS OF THAT SORT. AND THEREFORE, IN A GIVEN\nSITUATION YOU MAY BE UNCERTAIN AS TO HOW TO ACT TOWARD\nWHAT SOME PEOPLE IN THE BLOCK SEEM TO FEEL IS QUITE\nA THREAT TO THE NEIGHBORHOOD IF THIS NON-WHITE FAMILY"
}