{
  "id": "d201-13",
  "text": "-3-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nIS ABOUT TO BUY OR MOVE IN....SuPP0SE YOU’RE ABOUT TO\nSELL YOUR HOME, AND YOU’D LIKE TO SELL IT ON A NON-\nDISCRIMINATORY BASIS, AND SUDDENLY YOU FIND YOURSELF\nDELUGED WITH PRESSURE FROM NEIGHBORS OF PERSONAL PRE¬\nJUDICE. Your views on the subject haven’t changed.\nYet, your behavior might change under pressure...\nConversely, a person may be deeply prejudiced, and yet\nHE MAY BE FUNCTIONING, LET US SAY, IN AN EMPOLYMENT\nSITUATION IN WHICH THE TOP MANAGEMENT SAYS, ;’WE’RE NOT\nGOING TO HAVE ANY OF THIS STUPIDITY OF EMPLOYMENT\nDISCRIMINATION IN THIS FIRM, AND ALL OF OUR SUPER¬\nVISORS AND FORMENT, AND DEPARTMENT HEADS ARE GOING TO\nCOMPLY WITH THE POLICY OF MERIT EMPLOYMENT1’. We’R'E\nGONNA HIRE PEOPLE ACCORDING TO WHAT THEY CAN DO, NOT\nACCORDING TO WHAT THEY LOOK LIKE, OR WHAT THEIR AN¬\nCESTORS WERE CHARACTERIZED AS, AND SO ON. AND SO YOU\nMAY RETAIN AND CHERISH YOUR PRIVATE PREJUDICIAL NO-.\nTIONS TO WHICH YOU HAVE A PERFECT RIGHT. BuT IN YOUR\nFUNCTIONING AS A, LET’S SAY, A DEPARTMENT HEAD IN THIS\nPARTICULAR FIRM YOU’D BETTER CONFORM TO THAT POLICY I\nYOUR BEHAVIOR, OR PRESUMABLY YOU WON’T BE WITH THE\nFIRM VERY LONG. ..SO THAT IT CAN WORK IN ALL KINDS OF\nCOMBINATIONS ACROSS THE SCALE.\nThe primary difference, then, as Mr. Howden explains\nit, between prejudice and discrimination is that dis¬\ncrimination INVOLVES ACTION, WHEREAS PREJUDICE IS AN\nINTERNAL, PERSONAL ATTITUDE OR STATE OF MIND. BjT\nWHY IS IT THAT SO MANY PEOPLE ARE PREJUDICED, LOU9\nNice people. In fact, I’d say that most of us are in\nSOME WAY PREJUDICED.\nI THINK YOU’VE SUGGESTED AN IMPORTANT POINT, WALT. A\nPOINT THAT SOME ’’VERY NICE1’ PEOPLE ARE PREJUDICED...\nAND IT’S IMPORTANT TO UNDERSTAND THIS. YOU SEE, PRE¬\nJUDICE IS NOT NECESSARILY AN ATTRIBUTE OF WHAT WE\nMIGHT CONSIDER AN ’EVIL*’ OR '’BAD'’ PERSON. ByT IT IS\nOFTEN AN ATTRIBUTE OF ’’NICE” PEOPLE.. .IN GIVEN SIT¬\nUATIONS THEY ARE PREJUDICED BECAUSE THEY ARE NICE.\nI’M AFRAID I DON’T QUITE FOLLOW YOU, LOU.\nAll right...You may remember that Gunnar IViyrdal, in\nHIS STUDY OF THE AMERICAN NEGRO ENTITLED ThE AmERI CAN\n0 I LEMMA . MAKES A GREAT DEAL OF WHAT HE CALLS ’’THE\nAmerican Creed’...that creed which emphasizes justice,\nAND EQUALITY UNDER THE LAW, AND DEMOCRACY.\nThe eternal verities of life in America as we’re\nTAUGHT THEM."
}