{
  "id": "d201-133",
  "text": "RICHTER:\nFR\\ZIER :\nRICHTER:\nSCHNEIDER:\n_ Q _\nWHICH HE ENGAGED. I THINK, CF COURSE, THAT IT WAS\nAS FAR AS POSSIBLE FROM RrIGHT’s MIND TO CONDONE\nMURDER. BUT I DO BELIEVE THE ARTIST’S INTENTION WAS\nTO MAKE MURDER UNDERSTANDABLE TO US. -\\ND, ONE MIGHT\nAPO , THAT HE WAS, ALLOW ME TO PUT IT THIS WAY, RATHER\ngruesomely successful.\nYou EMPHASIZE MAKING CRIMINAL CTICNS UNDERSTANDABLE.\nRight now, however, I can’t help thinking that we’ve\nSAID NOTHING ABOUT NEGRO FAMILY BACKGROUND. RECOGNIZ¬\nING THAT WE STILL DON’T KNOW WITH THE PRECISION WE’D\nLIKE JUST WHAT THE CAUSAL FACTORS IN CRIME AND DELIN¬\nQUENCY ARE, I’M STILL VERY MUCH AWARE TH AT MANY AUTHOR\nITIES REGARD FAMILY BACKGROUND AS, IN ONE WAY OR\nANOTHER, AND IN VARYING DEGRESS, QUITE IMPORTANT IN\nRELATION TO CRIME ANO DELINQUENCY. HENCE, I’D LIKE\nUS, AT THIS POINT, TO LISTEN BRIEFLY TO ONE OF THE\ncountry’s authorities on the Negro family, Dr. E.\nFranklin Franklin Frazier.\n•t may sound startling to someone to realize that in\nMOST OF CUR CITIES, LARGE CITIES ESPECIALLY, ABOUT 30\nof Negro families have a female head. Now this female\nhead isn’t due TO widowhood, because that would imply\na terrific death rate among Negro husbands. It’s due\nto a number of factors: it’s due to the fact that\nI LLI GETIMACY IS STILL HIGH AMONG NEGROES AND THEREFORE\nTHE WOMAN BEARS THE RESPONSIBILITY FOR HER CHILDREN;\nIT’S ALSO DUE TO THE FACT THAT NEGRO HUSBANDS DESERT -\nIN FAIRLY LARGE NUMBER, IT’S HARD TO GET ANY EXACT\nMEASURE OF THAT BUT I WOULD SAY THAT DESERTION CAUSES\nA LARGE NUMBER OF NEGRO WOMEN TO BE RESPONSIBLE FOR\nTHEIR FAMILIES. So THAT WE HAVE THIS PHENOMENON OF\nabout 30%> of Negro families in many of our large citie\nWITH A FEMALE HEAD. Now, ANYONE REALIZES THAT THAT\nIS AN EXTREMELY ABNORMAL’. CONDITION, IT’S ABNORMAL IN\nTHE SENSE THAT IT MUST HAVE TREMENDOUS CONSEQUENOES F\nTHE REARING OF CHILDREN, NOT ONLY THE BREAKDOWN OF\nFAMILY DISCIPLINE WHERE THERE’S NO MAN PRESENT, IT..,,\nNOT ONLY THAT THE CHILD IS NEGLECTED BECAUSE THE MOTHE\nMUST WORK, BUT ALSO IN THE PERSONALITY DEVELOPMENT OF\nNegro children. There is no male model in the home tc\nHELP IN MOLDING THIS CHILD’S PERSONALITY, AND PROBABLY\nSOME DAY SOME SOCIAL PSYCHOLOGIST WILL MAKE A STUDY T\nSHOW THE INFLUENCE OF FEMALE DOMINANCE IN NEGRO FAMILi\nUPON THE PERSONALITY DEVELOPMENT OF NEGROES, ESPECIALL\nNegro males.\n-VcULD YOU' LIKE TO COMMENT N THIS, LoU? DOES WHAT Or .\nFrazier says bear on Negro crime and delinquency?\nvVELL, AS you’ve SUGGESTED YOURSELF, VVaLT, WE MIGHT\nCERTAINLY HAVE MORE EXACT, UNAMBIGUOUS KNOW LEDGE OF"
}