{
  "id": "d201-136",
  "text": "THE L - ST CITIZEN\nProgram #13\n\"The Negro, Organized\nReligion and the Churc:\nOEMS:\nSome people have argued that the Negroes have a\ngenius for religion. I’m not quite sure at all that\nNeGR ES ARE MORE EMOTIONAL DY NATURE, ARE MORE\nRELIGIOUS BY ATURE. But THEY’VE CERTAINLY, IN THIS\nC UNTRY, BEEN MUCH M CR E RESTRICTED IN THEIR OPPOR¬\nTUNITIES, AND THIS RESTRICTION MEANS THAT IN THE\nCHANNELS THAT ARE OPEN TO THEM THEY HAVE MADE FULL\nUSE OF THESE CHANNELS.\nMUSIC:\nSTINGER\nNNCR :\nThat was Dr. Paul De.mTS of the Boston University\nSchool of The^l.-<gy from whom we shall hear more\nAS WE Take up the subject of religion IN DISCUSSING\nthe Negro in .-u-e* i ca , \"The Last Citizen.'\nMUSIC:\nSTINGER\nmCR :\nThe Last Citizen: The Negro in America. ' series\nof PROGRAMS DEVOTED TO THE EXTENSION F CUR KNOWLEDO\nOF THE LARGEST MINORITY GROUP IN THE UNITED STATES,\nITS PROBLEMS, :AND THE PROBLEMS IT’POBES TO ALL AMER¬\nICANS. The.Last Citizen is produced by Radio Static\n■ Purdue . Uni vers( ty , under a grant fr *m the\"’Educ\national Television-and Radio .Center, in cooperation\nwitn the National : ■ sscciatlow f Educational Broadca\nThe discussants are the producer of the series, E.\nRichter, and Dr. Louis Schneider, Professor of Soci¬\nology at Purdue University. Today’s program: The\nNegro, Organized Religion, and the Church. Here nov\n1 s MR. R1 CHTER .\nRICHTER:\nThe American Negro has by criteria of church member¬\nship BEEN CERTAINLY AS DEVOUT A CHRISTIAN AS THE\nAMERICAN WHITE MAN. But THE HOUSE OF CHRISTIANITY\nITSELF IS NOTORIOUSLY SPLIT ON COLOR LINES. In HIS\nCLASSIC STUDY ON THE SOCIAL SOURCES OF DENCM 1 NATION¬\nAL 1 SM , THE THEOLOGIAN H. RlCHARD N|EBUHR MADE A\nREMARK TO THE EFFECT THAT THE VARIOUS CHURCHES OF\nChristendom have been unable to weave a single * .\nGARMENT OF CHRIST TO FIT THE SEAMLESS VESTURE OF HI\nspirit. Surely, if this comment applies anywhere r\nAPPLIES TO THE CASE OF THE HE.VILY SEGREGATED NeGRC\nchurches. Today, we wish to ex,mine some of the\nBACKGROUNDS OF THIS SEGREGATION AND IN GENERAL TO\nACHIEVE AN OVERVIEW OF THE RELIGIOUS SITUATION OF\nthe Negro in the United States. 1 think we might\nBEGIN WITH A BIT OF HISTORY ON THE MATTER OF THE\nRELATION OF THE NEGRO TO CHRISTIANITY."
}