{
  "id": "d201-140",
  "text": "-5-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nPREACHERS MINISTERING TC LOWER CLASS PEOPLE HAVE\nSHOWN SOME F THE TRAITS I HAVE JUST DESCRIBED STILL\nCNCE MORE THE NEGRO PREACHER MAY BE SAID TO HAVE\nSHOWN THESE TRAITS IN EXAGGERATED FORM. ...PLEASE NOT\nTHAT I AM GENERALIZING. THERE HAVE CF COURSE BEEN\nEXCEPTIONS TO THE THINGS I’VE SAID, AND CERTAINLY\nSOME OF THESE TRAITS, CHARACTERISTICS, TENDENCIES I*\nBEEN OVER ARE RECEIVING VERY STRINGENT CRITICISM FRO\nNUMBERS CF NEGROES TODAY.\n.'E GET THEN A GENERAL HISTORICAL PICTURE OF THE NeGR\nPREACHER AS UNEDUCATED, AS FREQUENTLY POINTED AWAY\nFROM THE HARD PROBLEMS OF NEGROES ON THIS EARTH, AND\nAS ACCOMMODATING HIMSELF, CONSCIOUSLY CR UNCONSCIOUS\nTO THE BIAS OF WHITES THAT HE S H C U L D LET THIS WORLD\nALONE. YOU WCULD SAY, I TAKE IT, THAT THIS PICTURE,\nHOWEVER GENERALLY TRUE HISTORICALLY, IS NOW CHANGING\nYes, I WOULD SAY there are definitely signs OF CHANG\nLet’s defer those signs for just now, and get a\nLITTLE BALANCE INTO THE PICTURE WE’VE THUS FAR GIVFf\n\\S I UNDERSTAND THE MATTER, THE SO-CALLED OLD-TIME\nNegro preacher had certain qualities.at least\nSOME OLD-TIME NEGRO PREACHERS DID, THAT NUMBERS OF\nRELIGIOUS PEOPLE WOULD REGARD AS REDEEMING.\n• THINK THIS IS TRUE.\nCan we document it?\nOne way I can think of to document it is to turn to\nA LITTLE VOLUME BY JAMES WELDON JOHNSON, ENTITLED\nGod’s Trombones. This is a volume of seven Negro\nSERMONS IN VERSE WHICH JOHNSON WROTE. He HAS AN\nINFORMATIVE PREFACE IN WHICH HE SAYS, AMONG OTHER\nTHINGS, THE FOLLOWING: ”ThE OLD TIME NEGRO PREACHER\nOF PARTS WAS ABOVE ALL AN 0 RAT OR, AND IN GOOD M E A S U R\nAN ACTOR. HE KNEW THE SECRET OF ORATORY, THAT AT\nBOTTOM IT IS A PROGRESSION OF RHYTHMIC WORDS MORE TH\nIT IS ANYTHING ELSE. INDEED, I HAVE WITNESSED CONGR\nGATIONS MOVED TO ECSTASY BY THE RHYTHMIC INTONING OF\nSHEER INCOHERENCIES. He WAS A MASTER OF ALL THE\nMODES OF ELOQUENCE. He OFTEN POSSESSED A VOICE THAT\nWAS A MARVELLOUS INSTRUMENT, A VOICE HE COULD MODU¬\nLATE FROM A SEPULCHRAL WHISPER TO A CRASHING THUNDER\nclap. His discourse was generally k ept at a high\nPITCH OF FERVENCY, BUT OCCASIONALLY HE DROPPED INTO\nCOLLOQUIALISMS, AND, LESS OFTEN, INTO HUMOR. He\nPREACHED A PERSONAL AND ANTHROPOMORPHIC GOD, A SURE\nENOUGH HEAVEN AND A RED HOT HELL. HIS IMAGINATION W\nBOLD ,,ND UNFETTERED. He HAD THE POWER TO SWEEP HIS\nHEARERS BEFORE HIM, AND SO HIMSELF WAS OFTEN SWEPT\nAWAY. >T SUCH TIMES HIS LANGUAGE WAS NOT PROSE BUT\nPOETRY ."
}