{
  "id": "d201-142",
  "text": "-7-\nDE \\TS:\nRICHTER:\nTHAT THERE ARE SIGNS OF CHANGE IN THE OLD-TIME IMAGE\nLet’s turn now to some of these signs of change. On*\nAGAIN I SUGGEST WE LISTEN BRIEFLY TO Or. Paul BEATS:\nRrobaoly one of the most interesting things that\nHAPPENED IN THE NEGRO CHURCH HAS BEEN. ...THE WAY THA\\\nit’s moved out of the center of the Negro community\nOVER A PERIOD OF YEARS. ThIS HAPPENED, IT SEEMED TO\nme, as Negro young people more and more have access\nTO EDUCATION, AS THEY FOUND THE REVIVALISM, THE EMO¬\nTIONAL EXPRESSION OF THE NEGRO CHURCHES, THE LACK OF\nTRAINING OF THE NEGRO PREACHERS, UNAPPEALING TO THEM\nAND THEY ALSO INDENTIFIED RELIGION WITH THEIR LOWER\nCLASS STATUS. So ONE WAY THEY C ULD REBEL A G A INST\nTHEIR FEELINGS OF THEIR INFERIORITY AS NEGROES, ONE\nWAY THAT THEY COULD REBEL AGAINST THEIR I DENT I Fl CATK\nAS MEMBERS OF A LOWER SOCIO-ECONOMIC CLASS, WAS TO\nREBEL AGAINST THE CHURCH, AND TO REJECT THE CHURCH.\n\\ND A LOT OF YOUNGER NEGROES, PARTICULARLY DURING THE\nLATE THIRTIES AND THE FORTIES, DID THIS. ONE OF THE\nTHINGS THAT’S HAPPENED IN THE LATE FIFTIES HAS BEEN\nTHE REEMERGENCE OF THE NEGRO CHURCH AND OF THE NEGRO\nMINISTER TO A POSITION OF SOCIAL LEADERSHIP AND SOCI\nRESPONSIBILITY IN THE NeGRO COMMUNITY. PROBABLY THE\nMOST VIVID SYMBOL OF THIS IS MARTIN LUTHER KlNG IN\nMontgomery. Out over the South, the Negro minister\nWHO IS NOW NO LONGER THE F00T-SHUFFLING, OBEDIENT\nSERVANT OF THE WHITE COMMUNITY AND THE WHITE CHURCH,\nKEEPING HIS PEOPLE QUIET, IN ORDER. SuT HE IS VERY\nOFTEN THE AGGRESSIVE LEADER OF A MINORITY MOVEMENT\nSEEKING RIGHTS FOR ITS OWN MEMBERS. THIS GIVES THE\nMINISTER AND THE CHURCH NEW RELEVANCE AND IT MAKES A\nREAL APPEAL PARTICULARLY TO THE YOUNGER AND THE\nBETTER EDUCATED NEGRO. JUST AFTER THE HEIGHT OF THE\ncrisis in Montgomery, Alabama, with the bus boycott\nTHAT WAS PARTICIPATED IN THERE, BY THE MONTGOMERY\nImprovement association, I happened to be at Fisk\nUniversity with Martin Luther King. Here was a very\nsophisticated Negro campus with very sophisticated\nNegro sociologists. >nd they sat with real attentic>\nAND LISTENED WHILE A NeGRO MINISTER TALKED TO THEM\nABOUT ACHIEVING CHANGE IN RACIAL ATTITUDES IN THE\nSouth. They had a new respect—doth for the church\nAND FOR THE MINISTRY BECAUSE OF A NEW ROLE THAT Mr.\nSHUTTLEWCRTH, THAT MARTIN LUTHER KlNG AND HIS ASSOC¬\nIATES, WERE PLAYING DOTH IN MONTGOMERY AND OTHER\nCITIES ACROSS THE COUNTRY...\nNqW I WOULD LIKE TO RE-ENFORCE THE FACT OF CERTAIN\nCHANGES WHICH MR. OEATS HAS BEEN OVER BY WORDS SPOKE\nby the Reverend Willi.m Borders, of the Wheat Street\nBaptist Church in .tlanta, Georgia, at the Prayer\nPilgrimage for Freedom meeting on the steps of the"
}