{
  "id": "d201-143",
  "text": "-8-\nLincoln memorial in Washington, D,C., on may 17, 195\nHere we have an illustration of the comdtnation * of\nRELIGIOUS FERVENCY WITH A MILITANT STAND C/N THE MATT\nof Negro rights,\nBORDERS: Is there any man from the top of heaven to the dotto\nOF HELL WHO SHOULD GET JUSTICE FOR HIMSELF WITHOUT\nEXTENDING THAT SAME JUSTICE TO HIS DRCTHER? Go DOWN\nMoses.go down, Moses, wa-ay down in Egypt land\nAND TELL OLD PHAROAH TO LET MY PEOPLE GO, I AM THE\nLord Thy God,and to prove that I’m going to de with\nYOU EVERY STEP OF THE WAY, l*M GIVING YOU A ROUND\nTRIP TICKET. Go DOWN, IVIOSES. THERE IS NO MILE POST\nTHERE ARE NO ROAD W ■, Y S ; YOU WILL GET HUNGRY, YOU WIL\nGET THIRSTY, THERE WILL RE THE RED SEA BEFORE YOU,\nPHAROAH WILL BE AGAINST YOU, BUT GO DOWN, MOSES. Go\nWAY DOWN IN THE LAND OF EGYPT AND TELL OLD PHAROAH\nTO LET MY PEOPLE GO, 'NO I DECLARE UNTO YOU THIS DA\nMay 17, 1957, celebrating this Supreme Court decisic\nIN THE PRESENCE OF THE LINCOLN MONUMENT, I DECLARE\nUNTO YOU THIS DAY THAT IVIOSES WENT DOWN INTO THE LAND\nof Egypt, led the people out, and came back, went to\nTHE TOP OF A MOUNTAIN AND GOT A PROCLAMATION FROM\nGod which began by saying, t? I am the Lord Thy God, a'1\nHAVE BROUGHT THEE OUT OF THE LAND OF EgYPT AND OUT 0\nTHE HOUSE OF BONDAGE. THOU SHALT HAVE NO OTHER GODS\nBEFORE ME. FqR ThY LORD ThY GoD AM A JEALOUS God\nVISITING INIQUITIES OF THE FATHERS ON THE THIRD AND\nTHE FOURTH GENERATION OF THEM THAT HATE ME; AND SHOW\nLOVING KINDNESS UNTO THOUSANDS OF THEM THAT LOVE ME\nAND KEEP MY COMMANDMENTS. LET US MARCH....LET US\nMARCH. ...LET US MARCH. HIGHER’. -AND HIGHER1. AND\nHIGHER’. AND HIGHER’.\nRICHTER: To get Reverend Borders’ outlook on the function of\nthe Negro Church and the Negro minister we later\nVISITED HIM IN > T L A N T A IN THE SUMMER OF 1958, AND\nHE SAID TO US.\nBORDERS: Aell, in the first place in the Negro church there i\nA FREEDOM WHICH DOES NOT OBTAIN IN ANY OTHER ORGAN¬\nIZATION in the South among us. There is a supreme\nRESPECT ON THE PART OF WHITES FOR THE NEGRO CHURCH\nAND IT IS A RECOGNIZED ORGANIZATION OF GOOD. It IS\nGROUP OF PEOPLE WHO HAVE ALREADY SELECTED THEIR LEAD\nMoreover, religion at its highest and best carries\nPROFOUND RESPECT IN THE HEART OF EVEN AN INFIDEL.\nRELIGION OUGHT TO BE PRACTICAL. IT OUGHT TO BE INSP\nATIONAL AND TALK ABOUT 0THER-W0RLDLINESS AND ADOUT\nIMMORTALITY. >T ONE AND THE SAME TIME IT OUGHT TO\nIMPLEMENT THE TENETS WHICH IT PROFESSES—BROTHERHOOD\nFatherhood, Goodness and Practical Kindness in behal\nOF EVERYBODY—sc that that having been said as a"
}