{
  "id": "d201-144",
  "text": "SCHNEIDER:\nRICHTER:\nSCHNEIDER:\nBACKGROUND, YOU CAN SEE THAT WHATEVER PROBLEM ARISES\nthe Church has a responsibility. A definite respons¬\nibility. ^nd since the Negro, as a person in the\nSouth, has been violated because of segregation it\nBECOMES THE DUTY IN THE NATURE OF THE CASE FOR THE\nChurch as an organization to make itself felt with\nREFERENCE TO TH..T PROBLEM. . N D SINCE THE NEGRO\nPREACHER IS THE LEADER OF THE CHURCH, IT BECOMES HIS\nDUTY, TO THE SAME EXTENT, TO LE,\\D THE PEOPLE IN THE\nSOLUTION OF THAT PROBLEM.\nA/HAT A CONTRAST THIS MAKES WITH SOME OF THE OLDER\nATTITUDES. LET ME TRY TO MAKE THE CONTRAST VIVID BY\nQUOTING A FEW LINES FROM AN EXPERIENCE THAT iVi Y R D A L\nREPOR TS. He SAYS, ’STERNER AND I ONCE ATTENDED A\nSunday evening service in a Negro Baptist church in\nONE OF THE CAPITALS OF THE UPPER SOUTH. THE PREACHEF\nDEVELOPED THE THEME THAT NOTHING IN THIS WORLD WAS OF\nANY GREAT IMPORTANCE: REAL ESTATE, AUTOMOBILES, FINE\nCLOTHES, LEARNED NESS, PRESTIGE, MONEY, ALL THIS IS\nnothing. It is not worth striving for. But an humbi\nPEACEFUL HEART WILL BE REMUNERATED IN HEAVEN. ' FTE R\nTHE SERVICE WE WENT UP TO THE PREACHER FOR A TALK.\na'e ASKED HIM IF HE SHOULD NOT INSTEAD TRY TO INSTILL\nMORE WORLDLY AMBITION IN HIS POOR AND DISADVANTAGED\ngroup. The preacher began to explain to us, as for\nFOREIGNERS, THAT THIS WOULD NOT DO AT ALL IN THE\nSouth. The role of the Negro church, he told us, was\nTO MAKE THE POOR NEGROES SATISFIED WITH THEIR LOWLY\nSTATUS. He FINISHED BY EXCLAIMING, ’Be ARE THE\nPOLICEMEN OF THE NEGROES. If WE DID NOT KEEP DOWN\nTHEIR AMBITIONS AND DIVERT THEM INTO RELIGION, THERE\nWOULD BE UPHEAVAL IN THE SOUTH.T THIS PREACHER IS\nNOT TYPICAL IN HIS PHILOSOPHY OF EXTREME ACCOMMODATE\nOR IN HIS INTELLECTUAL CLARITY, BUT IT IS SlGNlFlCAN*\nTHAT HE EXISTS.'1\nI THINK WE’VE PRETTY WELL MADE THE POINT OF THE\nCHANGING FUNCTION OF THE NEGRO CHURCH AND CHURCH\nLEADERSHIP. But LET’SRETURN NOW TO THE BACKGROUND OF\nRELIGIOUS SEGREGATION.\n/E HAVE TO KEEP IN MIND THAT THE BASIC THING IN THAT\nBACKGROUND IS THE SIMPLE FACT THAT VERY, VERY OFTEN\nthe Negro was not wanted in the white church, and knf\nthat. The founding of the > f r i c a n Methodist Episcop/\nChurch around the end of the 18th Century was accom¬\nplished by a Negro who had experienced discriminate\nIN THE WHITE CHURCH HE HAD BEEN ATTENDING. So IT HAS\nGONE GENERALLY, MORE OR LESS IN THIS FASHION. TODAY\nTHERE IS SOME FERMENT GOING CN IN THE WHITE CHURCHES,\nThere seems to be an increasing wonder about the\nCOMPATABILITY OF SEGREGATION POLICY AND ADHERENCE TO\nChristianity. The Catholic Church has been taking a"
}