{
  "id": "d201-149",
  "text": "-2-\nRICHTER;.\nPR-MTIS:\nTO THE MATTER OF SEGREGATION. THIS, IT SEEMS TO ME,\nIS ABSOLUTELY FUNDAMENTAL IN UNDERSTANDING BOTH THe’\nGENERAL FORM OF NEGRO JOURNAL I SM AND THE CONTENT OF\nTHAT JOURNALISM.\nIf THAT IS THE THEME..WHICH WE MAY M0 ST■ PR0FITA0LY\nPURSUE, I CAN THINK OF NOTHING BETTE. FOR US TO'\nBEGIN WITH THAN SOME EXTRACTS FR M A SPEECH MADE BY\nP* L. Prattis, Editor of the Pittsburgh Courier, one\nOF THE LEADING NEGRO NEWSPAPERS OF THE NATION. Mr.\nPrattis made this speech, from which we will hear sou\nPASSAGES IN A M M ENT, AT F|SK UNIVERSITY IN THE SUMMf\nOF 1958, AT THE ANNUAL RACE RELATIONS INSTITUTE. Le~\nME SAY THAT iViR. PRATTISTS SPEECH HITS SO DIRECTLY AN\nCOGENTLY ON THE THEME OF SEGREGATION THAT WE THINK I\nWORTHWHILE TO ALLOW HIM RATHER MORE TIME THAN WE HAVF\nUSUALLY ALLOWED OUTSIDE COMMENTARIES. HERE THEN, IS\nMr. Prattis, addressing himself forthrightly tc the\nWAYS IN WHICH SEGREGATION AFFECTS NEGRO JOURNALISM.\nVHAT ABOUT THE PROSPECTIVE COLORED STUDENT OF JOURNAL\nism? Before anything else he must consider economic:\nCan his parents afford to send him to a school of\nJOURNALISM? Then when he looks cver the last of the\nschools, he finds it much more restricted for him tm\nfor the white boy. Shall he attend a Negro school o--\njournalism? Tell, maybe. Perhaps it will cost less\nBUT CAN HE OBTAIN AS MUCH IN RELATION TO THE WHOLE\nFIELD OF JOURNALISM? THERE’S ROOM FOR DOUBT. SEGRE\nGATION DEPRIVES NEGROES OF A DEVELOPING LIFE EXPERI¬\nENCE. The journalist and Negroes in most profession;\nREQUI . ING THE SKILL AND KNOWLEDGE THAT COME FROM EX¬\nPERIENCE AND ASSOCIATION, SUFFERS FROM THIS SEGREGA¬\nTION. The Negro journalist starts off with the odds\nWEIGHTED AGAINST HIM. He CAN GO SO FAR AND NO FARTH!\n•HEN SEGREGATION CUTS HIM OFF FROM NORMAL ASSIMILATI\nOF THE DOMINANT CULTURE, IN HIS OWN FIELD HE R E A C H Er\nA STATE OF EXPERIENTIAL PARALYSIS. You MAY : E A S 0 N A B'\nASK, ?T .V HY DOESN’T THE NEGRO GO AHEAD AND SET HIS OWN\nSTANDARDS AND PAR? If, AS YOU SAY, HE HAS AGILITY\nEQUAL TO THAT OF THE WHITE MAN, WHY, WITHIN THE LIMI\nOF SEGREGATION, DOES HE NOT P RFECT HIS OWN NOTIONS?1\nThe answer is that the dominant culture will not per!'\nhim. The dominant culture is bound, for better or\nWORSE, TO BE THE CHIEF AND DECISIVE INFLUENCE IN THE\nNegro’s life. It tells him in devious, but very cer\nTAIN,WAYS TH .T ALMOST EVERYTHING HE DOES IS WRONG.\nMAK-S HIM HESITANT, UNCERTAIN. It TURNS HIM UPON\nHIMSELF WHEN HE WOULD CARVE OUT A WAY FOR HIMSELF.\nLike a small plant trying to grow beside a larger on\nHE IS CROWNDED OUT FROM THE LIFE-GIVING SUNLIGHT.\nImagine, the sturdy larger plant bending cve : and\nBLAMING THE SMALLER PLANT FOR BEING PALE AND WANE."
}