{
  "id": "d201-151",
  "text": "-4-\nF is CM THE BEGINNING, WOULD INCLINE TO AGREE WITH WHIT\nFew Negroes or whites would think through the basic\nfact that segregation deprived this ambitious Negro\nOF THE CHANCE TO GROW THROUGH EXPERIENCE AND Ti'F\nOPPORTUNITY TO OBTAIN SUFFICIENT GOING CAPITAL,\nFOREGO ING ,WH I CH WOULD BE TRAGICALLY TRUE WITH A DAI L\nNEWSPAPER, IS SADLY TRUE OF WEEKLIES ALSO. MOST NeG1\nWEEKLIES, EVEN THE LARGEST, HAVE BEEN STARTED WITH\nVERY SMALL CAPITAL INVESTMENT. IN FACT, ITiS GREATL'\nTO -BE D QUOTED IF SUFFICIENT CAP-1 TA L C ULD B E O'BTAJNE\namong Negroes today to start and maintain a weekly\nNEWSPAPER OF THE SIZE OF EITHER OF OUR THREE BIG WEEl\nlies. Lack of capital is amajor deterrent to the\nEXPANSION OF SO-CALLED NEGRO JOURNALISM. THIS IS\nTRUE NOT ONLY IN RESPECT TO CAPITAL INVESTMENT, BUT\nALSO IN TERMS OF INCOME REVENUE.\nRICHTER: At this point in his speech, Mr. Pratt is turns to th:\nQUESTION OF INCOME. It IS PERHAPS WELL TO REMIND\nOURSELVES IN UNDERSTANDING: HIS FURTHER COMMENTS THAT\nTHE BULK OF INCOME OF NEWSPAPERS SUCH AS MOST OF US\nARE ACQUAINTED WITH — ,tWHITE\" NEWSPAPERS SO-CALLED —\nIS INC'ME DERIVED FROM ADVERTISING* BUT THIS IS NOT\nthe case with Negro newspapers. Mr. Pratt*.; *-\nSAYS THIS, BUT I MENTION IT, TOO BECAUSE IT IS V E R\nIMPORTANT TO BEAR IN MIND. NOW Mr . PRATTIS CONTINUE\nPRMTIS: , V H Y IS IT NECESSARY TO PAY THE SAME PRICE FOR A 24\npage Negro newspaper as you do for a 96 page New Yq;\nTimes9 Vhy does the Negro newspape cost more than\nTHE WHITE NEWSPAPER? THE ANSWERS TO THESE QUESTIONS\nLIE IN THE FACT THAT NEGROES AND WHITES LIVE IN\nSEPARATE WORLDS. W HITE NEWSPAPERS OBTAIN MOST OF\nTHEIR INCOME FROM ADVERTISING THAT COMES FROM WHITE\n3USINESS. IN THE PAST, WHITE PUBLISHERS HAVE DEFINI\nLY CHOSEN TO MAKE ADVERTISING CARRY MOST OF THE BURD\nAND TO KEEP THE PRICE OF THE PAPER CHEAP, EVEN BELOW\nCOST. .'HITE NEWSPAPERS ARE ONE OF THE FEW CCMMODITi\nin Western civilization which are sold for less than\nIT COSTS TO PRODUCE THEM. ADVERTISING IS MADE TO\nBEAR THE BURDEN OF COST WHICH NORMALLY THE PURCHASER\nWOULD PAY. But the doors to the ADVERTISING WHICH\nTHE VhITE NEWSPAPERS RECEIVE ARE LARGELY CLOSED TO\nNegro publishers. The white advertisers, living in\nANOTHER WORLD, SEE NO NEED OF ADVERTISING IN MEDIA\nPUBLISHED FOR THE BENEFIT OF A SET-OFF, SEGREGATED,\nPOOR, AND INFERIOR SEGMENT OF THE POPULATION. THF-RE\nFORE, THE CHIEF SOURCE OF REVENUE FOR THE WHITE\nNEWSPAPER IS ALMOST NON-EX I STANT FOR THE NEGRO NEWS¬\nPAPER. aS A CONSEQUENCE, THE NEGRO NEWSPAPER MUST\nOBTAIN ITS INCOME FROM CIRCULATION AND FROM SUCH\nADVERTISING AS IT CAN GET. THE NEGRO PUBLISHER IS\nFORCED TO START BY CHARGING A PRICE FOR HIS PRODUCT"
}