{
  "id": "d201-152",
  "text": "-5-\nrtlCHTE; R:\nPR TTIS:\nSCHNEIDER:\nRICHTER:\nWHICH IS MORE NEARLY IN LINE WITH ITS ACTUAL COST.\nThe white publisher, decause cf his larger income fr\nadvertising, can charge much less. The Negro pub-\nLISHER, BECAUSE CF THE PAUCITY OF ADVERTISING INCOME\nIS COMPELLED TO CHARGE THE PURCHASER NOT AN EXCESS I Vr\n'PRICE, BUT NE MORE NEARLY IN LINE WITH WHAT IT COST\nNow Mr. Pratt is goes on to point cut that, insofar At\nthe Negro newspaper can get advertising at all, it\nMUST RELY HEAVILY CN NEGRO BUSINESS . . . Or BUSINESS\nCONDUCTED BY WHITES THAT ESPECIALLY CATER TO NEGROES\n'' NO HERE, THE NEGRO NEWSPAPER FREQUENTLY MUST CARRY\nADVERTISING MATTER WHICH ITS OWN PERSONNEL MAY NOT\napprove. 3ut Mr. Pratt is puts the matter very well\nIN A FEW FINAL WORDS.\nHis first resort must de Negro businesses or dusines\nconducted dy whites which cater particularly to Negr\nNegroes. Here he collides with the segregated cultu\npattern with a Vengeance. Many so-called Negro\nDUSINESSES WHICH PROSPER IN A THIRD-RATE SORT OF WAY\nARE TOOTED IN THE PREJUDICES RESPONSIBLE FOR SEGRE¬\nGATION. The Negro has been made to suffer so much\nBECAUSE OF A DIFFERENCE OF SKIN COLOR AND HAIR TEXTU\nDY MEMBERS OF THE DOMINANT CLASS, THAT MANY NEGRCES\nHAVE ADOPTED THE UNDERSTANDABLE COURSE CF TRYING TO\nESCAPE RIDICULE AND PROSCRIPTION BY IDENTIFYING THEM¬\nSELVES WITH THE MASS CF THEIR WHITE TORMENTORS. ThE\nUNHOLY PRESSURE FROM THE OUTSIDE WHITE WORLD HAS MAD;\nmany Negroes want to change their skin color and the\nTEXTURE OF THEIR HAIR. VV HAT GlLDER T FrERE IMPLIES IS\nMOST CLEARLY SEEN IN THIS TENDENCY. You WOULD EX PEC\nANY PEOPLE TO BE PROUD OF THE PHYSICAL CHARACTER I ST If\nGod HAS GIVEN THEM, BUT JUST AS A SET-OFF GROUP LOSE\nROOTAGE AND A SENSE OF CULTURAL DIRECTION, SC DOES I\nLOSE A SENSE OF VALUES IN RESPECT TO ITS CHARACTER¬\nISTICS. Dangling in a sort of cultural vacuity, it\nFUTILELY ASPIRES TO TIE IN WITH THE STRONGER DOM I NAN'\nGROUP WHICH SPURNS IT.\n''HEN WE BEGAN TODAY, I MADE THE COMMENT THAT SEGRE¬\nGATION IS FUNDAMENTAL IN UNDERSTANDING BOTH THE\nGENERAL FORM OF NEGRO JOURNALISM AND ITS CONTENT. IV;\nPRATTIS HAS SAID A GOOD DEAL THAT I THINK 3EAAS L A A G;\nLY ON THE FORM OR STRUCTURE OF NEGRO JOURNALISM. N0\nLET US TURN TO CONTENT, HERE ONE MUST HAVE THE EX¬\nPECTATION THAT SEGREGATION WILL BE DIRECTLY AND POWE\nFULLY INFLUENTIAL. . « . S E GREGATION ALONG WITH DISCRIMI\nATI ON AND PREJUDICE. INEVITABLY THESE THINGS WILL\nBE THEMES FOR THE NEGRO NEWSMAN, EDITOR, COLUMNIST,\nAND CARTOONIST.\n*N MY EXPERIENCE, THE FRONT PAGE OF A MAJOR NEGRO\nNEWSPAPER USUALLY GIVES ONE THE IMPRESSION OF A KIND"
}