{
  "id": "d201-153",
  "text": "SCHNEIDER:\nRICHTER:\nSCHNEIDE :\nRICHTER:\nOF SENSATIONALIST 1C JOURNALISM WHICH COMBINES AN\nEFFORT AT VIVID APPEAL WITH STORIES SPECIFICALLY\nSLANTED TO NEGRO INTERESTS, OFTEN WITH ESPECIAL EMPH\nEMPHASIS ON INJUSTICES VISITED UPON NEGROES.\n‘VIY OWN IMPRESSION WOULD HE MUCH THE SAME.\nBut now, can we learn something about specific contei;\nILLUSTRATING PREOCCUPATION WITH SEGREGATION, DISCRI¬\nMINATION, AND PREJUDICE?\nYes. Let me begin with a few cartoons from one of\nTHE LEADING NEGRO NEWSPAPERS, THE ChICAGC DEFENDER.\nOn December 20, 1958, a Southern white sits in a\nCHAIR WATCHING ElSENHOWER ON TV, AND SAYS TO HIS DOG\n:E DON1 T CARE WHAT THAT CONSTITUTION S A Y S . . . . TH E R E\nAIN’T GONNA BE NONE OF THEM N I GRAS VOTIN’ ’ROUND HERE\nHere’s a slightly more subtle item, about three week\nlater; Uncle Sam is shown hard at work, and dressed\nAN APRON. He IS SEEKING TO MAKE A GROWTH FORMULA\nWHILE A BABY, SYMBOLIZING THE 1954 SCHOOL DECISION,\nsits in a highchair. On ,*pril 4, J959, a Negro man\nIS REPRESENTED AS OPENING AN EMPTY BOX LABELLED\n’’Civil Pights,” while a chortling white man,labelled\n'’Congress” cries '’April Fool’,” from an open window.\nIncidentally, I haven’t made a systematic analysis of\nTHE CARTOON CONTENT OF THE DEFENDER OR OF OTHER LEAD¬\nING Negro newspapers. Tut it might be of interest to\nGIVE TWO OR THREE IMPRESSIONS I’VE DERIVED, WHICH I\nTHINK ARE RELEVANT TO THE WHOLE MATTER OF SEGREGATION\nFor one thing, Uncle Sam seems never to be depicted,\nVIRTUALLY NEVER TO BE DEPICTED, AS BEING DIRECTLY\nRESPONSIBLE FOR RACIAL TROUBLE. ON THE CONTRARY, HE\nIS REPRESENTED AS TRYING HARD TO IMPROVE MATTERS AND\nas suffering difficulties in the process. The best\nHOPE FOR A BRIGHTER FUTURE FOR NEGROES TENDS TO BE\nSHOWN AS SYING WITHIN THE PROVINCE OF THE AMERICAN\nGOVERNMENT. FlSENHCWER IS REPRESENTED AS DOING HIS\nTO HELP IN THE FIELD OF RACIAL RELATIONS WITH SUCH\nTOOLS AS EXIST, HOWEVER IMPERFECT THEY MAY BE. ThIS\nIS OF SPECIAL INTEREST SINCE MUCH REPORTAGE BY THE\nWHITE PRESS, AND BY HIGHLY CAPABLE CONTEMPORARY WHITF\nJOURNALISTS, DEPICTS ElSENHOWER AS REMAINING ALOOF\nFROM, AND RATHER UNINTERESTED IN, RACIAL ISSUES. I_E'\nME ADD THAT THERE MIGHT BE A VARIETY OF EXPLANATIONS\nFOR THIS. A PLAUSIBLE ONE IS THAT THERE IS SO MUCH\nNegro hope invested in the Federal government and its\nAGENCIES, THAT ANY MAJOR GOVERNMENTAL FIGURE SUCH AS\nthe President is likely, if it is at all possible, tc\nBE PRESNETED IN, WHAT IS FROM THE NEGRO STANDPOINT,\nA FAVORABLE LIGHT.\nThis does seem like rather interesting material, Louc\nCan you give us some more on these lines? ^side from\nCARTOONS?"
}