{
  "id": "d201-158",
  "text": "THE L -ST CITIZEN\nCOURTS:\nMUSIC:\n.NNCR :\nIviUS I C :\nNNCR :\nRICHTER:\nProgram 15\n” I NT I M I DAT I ON1’\n'We’re goin’ to tell you this: You Negroes in Humphreys\nCounty: The N', .CP is not going to operate here, and\nYOU ARE NOT GOING TO VOTE IN HUMPHREYS COUNTY, SO\nYOU’D JUST AS 'ELL GO AND GET YOUR NAME OFF. If YOU\nDON’T, YOU’RE GOING TO DE PUT CUT OF DUS I NESS,”\nSTINGER\nThe story of the intimidation of the Negro is a long\nAND VARIED ONE. HARRASSMENT DY MODS, ANONYMOUS TELE¬\nPHONE CALLS, DEATINGS, KILLINGS, AND 30M3INGS..,.\nTHREATS OF ECONOMIC AND OTHER REPRISALS HAVE ALL\nPLAYED A PART IN THIS STORY. LISTEN AS WE TELL PART\nOF THIS STORY TODAY AS WE CONTINUE TO EXPLORE THE\nWORLD OF THE NEGRO IN AMERICA, ’’THE LAST CITIZEN.”\nSTINGER\nThe Last Citizen: The Negro in America, series of\nPROGRAMS DEVOTED TO THE EXTENSION OF OUR KNOWLEDGE OF\nTHE LARGEST MINORITY GROUP IN THE UNITED STATES, ITS\nPRODLEMS, AND THE PROBLEMS IT POSES TO ALL ' M E R I CANS.\nThe Last Citizen is produced dy Radio Station WB-Vv,\nPurdue University, under a grant from the uducaticnal\nTelevision and Radio Center, in cooperation with the\nNational association of Educational Broadcasters. The.\nDISCUSSANTS ARE THE PRODUCER OF THE SERIES, E. W.\nRichter, and Dr. Louis Schneider, Professor of Soci¬\nology at Purdue University. Today’s program: Intimi\nation. Here now, is Mr. Richter.\nToday we begin the first of a series of three program\ndevoted to what we are terming ’’Intimidation, Protest\nand Defense.1’ Re understand by intimidation, roughly\nANY ACTIVITY INVOLVING VIOLENCE OR A THREAT OF VIOLEN\nTHAT WILL TEND TO PREVENT THE NEGRO FROM ASSERTING\nRIGHTS OR EXERCISING PRIVILEGES TO WHICH HE IS IN\nSOME SENSE ENTITLED — FOR INSTANCE BY LAW, THE INTI¬\nMIDATION MAY BE CONSCIOUSLY UNDERTAKEN DY WHITES WHO\nDELIBERATELY ACT TO PREVENT THE NEGRO FROM. . . .0DTA I N-\nING SOMETHING. The SOMETHING MIGHT BE UNSEGREGATED\nEDUCATION, EQUAL STATUS IN A COURT OF LAW, THE VOTING\nRIGHT, AND SO ON. ON THE OTHER HAND, INTIMIDATION M,\nDE DIRECTED TO NO SPECIAL PURPOSE THAT THOSE D.OING\nTHE INTIMIDATING HAVE IN MIND. VoULD GO ALONG WITH\nTHIS, LOU?"
}