{
  "id": "d201-159",
  "text": "-2-\nSCHNEIOER: I think so. .hen you say that intimidation need not\nnE DIRECTED TO ANY SPECIAL PURPOSE, I AM REMINDED OF\nthis: a certain pattern of relations detween Negroes\nand whites in various communities has been noted dy a\nNUM3ER OF INVESTIGATORS. I THINK, FOR INSTANCE, OF\nTHE STUDY OF DEEP SOUTH, DONE DY aLLISON DaVIS AND\nOTHERS 'E FIND ACCORDING TO THIS WORK, THE NEGRO-\ni/HITE RELATIONS CAN TAKE ON A CERTAIN CYCLICAL FORM.\nSpecifically, in a Southern community let’s say\nNegroes, over time, decowe gradually less deferential\nto whites. They degin to mumble ’’sir1' in addressing\nwhite men. Perhaps they even experiment now and then\nwith leaving out the ’sir\" altogether. They refuse\nTO GIVE WAY ON SIDEWALKS. THEY AREN’T SUFFICIENTLY\nSELF-EFFACING WHEN THEY AWAIT SERVICE IN STORES ALONG\nWITH WHITE CUSTOMERS, AND SO ON. BuT ONE DAY SOME\nWHITE CUSTOMERS, AND SO ON. But ONE DAY SOME WHITE\nPERSON DECIDES, IN A DOILING UP OF TEMPER, THAT\n'’THINGS HAVE GONE FAR ENOUGH1’ AND A0MINISTERS A PUCLI\nDEATING TO AN ’’UPPITY” NEGRO. THEN THERE MAY w ELL\nDEVELOP A RENEWED TENDENCY FOR NEGROES TO DECOME\nDEFERENTIAL. PERHAPS THE 4,SIr” COMES DACK PLAIN AND\nEMPHATIC. »N D THERE ARE CORRESPONDING CHANGES ON THE\nSIDEWALKS, IN THE STORES, AND SO ON. * CERTAIN ’’eQU!\nL I DR I UM ’’ HAS SEEN RESTORED. Now, I SUPPOSE ONE COUL:\nTHINK OF THIS KIND OF THING AS INVOLVING INTIMIDATION\nFOR ITS OWN SAKE, AND YET THERE COULD WELL BE IN IT—\nE LEME NTS OF CONSCIOUS THOUGHT ON THE LINE THAT A\nGENERAL S U D 0 R D I N A T I 0 N OF THE NegRO COMMUNITY MUST DE\nRESTORED. I SUPPOSE, TOO, THAT EVEN WHEN THERE ARE\nCONSCIOUS ELEMENTS LIKE THIS, YOU MIGHT STILL WANT\nTO CALL THIS GENERAL PURPOSE INTIMIDATION.\nI THINK, TOO, WE SHOULD NOTE THAT INTIMIDATION IS IN\nA WAY A DIFFUSE AFFAIR. L3 Y THIS • MEAN, SIMPLY, THAT\nTHERE ARE MANY ANTI-NeGRO ACTIVITIES IN WHICH INTIMID\nATION IS A MORE OR LESS INCIDENTAL, OR AT ANY RATE,\nINSTRUMENTAL THING. It’s ONE KIND OF ACTIVITY UNDER¬\nTAKEN, AMONG OTHERS, TO ACHIEVE CERTAIN RESULTS. Yo\nMAY, FOR EXAMPLE, WANT TO PREVENT NEGROES FROM GOING\nTO WHITE SCHOOLS, AND LET’S SAY THIS IS YOUR PRIMARY\npurpose. Then, virtually any usable tactic that coml\nTO HAND MAY DE VALUED. >ND YOU MAY TURN TO INTIMIDA¬\nTION WHEN PROMISES, PERSUASION, RIDICULE, AND THE LlK\nHAVE FAILED. So ALSO, INTIMIDATION MAY BE PART OF TH\nARMAMENTARIUM OF THOSE WHO WISH TO PREVENT THE NEGRO\nFROM VOTING, OR DOING ANY OF A NUMBER OF OTHER THING:\nRICHTER: Now, I might like for us to go on in this vein, gut\nOUR PRIMARY OBJECT TODAY IS TO ACHIEVE A VERY CONCRE:\nUNDERSTANDING OF HOW INTIMIDATION WORKS. MOST OF US\nARE AWARE THAT THE NEGRO IN THE SOUTH IS FREQUENTLY\nINTIMIDATED WHEN IT COMES TO EXERCISING HIS VOTING\nRIGHTS. But HOW MANY OF US REALLY KNOW WHAT INTIMID-"
}