{
  "id": "d201-160",
  "text": "-3-\nCOMG :\nATION MEANS IN THE CONCRETE--! F I MAY SO PUT |T— IN TH i\nFLESH? .J HAT EXACTLY DOES IT INVOLVE? It IS, I THING,\nILLUMINATING FOR US, AT LEAST AT TIMES, TO GET INVOLVED\nIN DETAIL. 'ND THIS IS, AGAIN, W HAT WE WANT TO LOOK\nFOR TODAY, THE IMPACT OF THESE ABSTRACTIONS UPON\nINDIVIDUALS. -J H A T 1 NT IMI DATI ON MEANS TO THIS AND THAT\nPARTICULAR NEGRO. 'ND ALSO HOW INTIMIDATION WORKS IN\nVARIOUS PARTICULAR AREAS IN W HI C H THE NEGRO SEEKS TO\nASSERT THE RIGHTS, OR EXERCISE THE PRIVILEGES MENTIONED\nin our initial defintion....therefore, let’s TURN TO A\nSTATEMENT THAT IS PERTINENT TO THE VERY IMPORTANT AREA\nof the Negro vote. The statement perhaps brings out\nMORE THAN THE SHEER MATTER OF INTIMIDATION IN CONNECT If.\nWITH VOTING IN THE ^OUTH, BUT INTIMIDATION IS A CEN¬\nTRALLY IMPORTANT PART OF IT. HERE THEN IS Dr. HERMAN\nLong, Oirector of the Race Relations Oepa tment of the\nAmerican missionary Association at Fisk University,\n1 SUSPECT, I RATHER STRONGLY BELIEVE, THAT THE MAJOR\nFACTOR WHICH REDUCES THE NUMQE: OF NEGROES WHO ARE\nREGISTERED \\ ND WHO CAN VOTE, IS THE FACT THAT PRESSURE;\nOPERATE DIRECTLY UPON HIM IN THE ACT OF SEEKING TO GET\nREGISTERED. LET ME TRY TO DESCRIBE WHAT I MEAN.\nRegistration in the aver.--.ge Southern community takes\nPLACE IN THE COURTHOUSE. If THIS COURTHOUSE IS IN A\nSMALL TOWN, IT HAS ABOUT IT, AN AVERAGE NUMBER OF\nHANGERS ON, OF SMALL POLITICIANS, OF POLICE, OF SHER¬\nIFFS, OF DEPUTIES, OF PEOPLE WHO IN SOME MEASURE ARE\nASSOCIATED WITH THE POWER STRUCTURE OF THAT COMMUNITY.\n-'ND, OF COURSE, MANY WHITES IN THE SoUTH WHO BELIEVE\nTHAT THEY ARE THEMSELVES THE LAW BY THE VERY FACT THAT\nTHEY HAPPEN TO BE WHITE PERSONS. THEN A NEGRO GOES\nINTO THIS UNWELCOME ATMOSPHERE OF THE COUNTY COURT¬\nHOUSE TO REGISTER, HE*S NOT ONLY MET WITH THIS SITUA¬\nTION WHICH IS AWE INSPIRING TO HIM, BUT HE IS MET AT\nTHE DESK OF THE REGISTRAR 'M TH A PERSON WHOSE ATTITUDE\nIS AGAINST HIS ACTUAL REGISTERING, AND WHO PROCEEDS\nIN THE CONVERSATION WHICH WOULD ENSUE, TO PLACE ALL\nSORTS OF HURDLES;IN THE WAY OF THE NEGRO SEEKING TO\nGET BLANKS TO FILL OUT, OR EVEN IN THE WAY THAT HE\nWOULD INTERPRET THE QUESTIONS ON A BLANK, AND SO ON,\n'ND THEN IN MANYCASES HE*S MET WITH AN OUT-AND-OUT\nATTITUDE OF REFUSAL. BOARDS OF REGISTRARS HAVE\nEXPRESSED THEMSELVES, OR INDIVIDUAL REGISTRARS, AS\nSAYING THAT 7 I WILL NOT REGISTER A SINGLE NEGRO IN\nTHIS COUNTY.ELL, THIS IS A THREAT. THIS IS A\nVEILED THREAT, IN SOME CASES, IT’S A DIRECT THREAT.\n•ND SO THE PROCESS IS JUST BLOCKED BY THIS KIND OF\nINFORMAL, BUT NEVERTHELESS AWFULLY POWERFUL, EFFORT ON\nTHE PART OF THE WHITE PUBLIC TO PUT EVERY STUMBLING\nBLOCK IN THE WAY OF THE NEGRO. Now, IF THE NEGRO STILL\nPERSISTS IN HIS EFFORT IN THE SMALL TOWN AND FREQUENTLY\nIN THE LARGE COMMUNITY TO VOTE AND MAKES A DEMAND\nTO DO SO, THEN HE FREQUENTLY, IF HE SEEKS TO RALLY"
}