{
  "id": "d201-164",
  "text": "-7-\nRICHTER:\nDACK BEFORE THEM, AND THEY WOULD GO DOWN AND GET ME\nAND BRING ME HACK BEFORE THEM, AND THEY COULDJUST BUY\nME IN, AND THAT WOULD STOP THE WHOLE THING. -'ELL, HE\nCAME DOWN AND TOLD ME, HE SAID, ”-«ELL, THE CITIZENS1\nCouncil wants you back before the committee.1’ I said,\n'’For what9’’ He said, \"^ell, they’ll tell You.‘f So I\nGOT IN THE CAR WITH HIM AND WE WENT ON BACK. ^E GOT\nC. \\ C K UP THERE, THEY SAT DOWN AND OUTLINED, AND TOLD ME\nWHAT THEY WANTED TO DO, THEY SAID, ”NoW, YOU WANT TO\nMAKE SOME MONEY?'’ AND SAID, '’YOU...YOU JUST DROP THE\nN.'WCP, YOU GO UP THERE AND TAKE YOUR NAME OFF IN GOOD\nFAITH AND IF YOU TAKE YOUR NAME OFF, THE REST OF THE\nN|GRAS WILL TAKE THEIR NAME OFF. I SAID. ...AND SAID,\n” I f YOU DO THAT, WE WILL ASSURE YOU YOU WILL GET ALL\nTHE MONEY YOU WANT.’’ • SAID, ”^ELL, I DON’T WANT IT,”\nI said, '’If that’s the way I’ve got to get it,” I said,\n”1 JUST DON’T WANT IT.” H E said, ”jell, you don’t mean\nTO TELL ME THAT YOU WOULD REFUSE MONEY9” 'ND I SAY, i\nREFUSE MONEY. I Sm NOT GOING TO SELL MY RIGHTS OUT FOR\nMONEY.” So AFTER THEY COULDN’T GET ME TO DO IT THEY\nSAID, ”WELL, ALL RIGHT, THEN, WE GOING TO CLOSE YOU\nOUT.” I SAID, ”v*ELL, CLOSE ME OUT.” So THE NEXT DAY\nTHE SAME REPRESENTATIVE CAME DOWN, THIS WAS JUST THREE\nMONTHS ... .THREE DAYS BEFORE I WAS TO PAY MY RENT, HE\nSAYS, ”n/ELL,” HE SAYS, ”Y0U STILL HOLDING OUT.” I SAY:\n‘•’I’M STILL HOLDING OUT.” HE S YS, ”^ELL, THE CITIZENS*\nCouncil says that if you don’t go up and take your naml\nOFF THE REGISTRATION BOOK, THEY’RE GOING TO CLOSE YOU\nOUT, YOU’RE GOING TO HAVE TO GET OUT OF THIS STORE.”\nThat made me angry, you know, and 1 spoke a little too\nFAST I RECKON, BUT I OPENED THE DOOR AND GOT OUT OF T H t\nCAR, AND TOLD HIM, I SAYS, ”Y0U GO BACK AND TELL THE\nCitizens Council to go to hell’.,t\nThe TALE THUS FAR GIVES US A PORTRAYAL OF UNMISTAKABLE\nINTIMIDATION, AND ONE NEGRO’S COURAGE IN FACING UP TO\nIT. 3UT THE TALE ISN’T QUITE OVER. LET ME SUMMARIZE\nHOW IT CONTINUES. ONE OF THE OTHER LEADERS IN THE\nEFFORT TO GET THE NEGROES TO VOTE IN THIS MISSISSIPPI\nCounty was a Reverend Lee who got a threatening note\nABOUT HIS ACTIVITY AND WAS SUBSEQUENTLY KILLED. MR.\nCourts was told that he would be ’’next', ^s the\nCitizens Council had threatened, mr, Courts lost his\nstore. He was told that the store would have to be\nused for other purposes than those for which he was\nusing it. mr. Courts made the point that up until\nTHIS TIME HE HAD HAD GOOD RELATIONS WITH THE MAN FROM\nWHOM HE WAS LEASING THE STORE, BUT THERE WAS NOTHING\nFOR IT. ...HE HAD TO FIND ANOTHER BUILDING, WHICH HE\nDID. ACCORDING TO HIS STORY, THEN, ’’THEY FIXED IT\nWITH THE WHOLESALE HOUSES THAT I COULDN’T BUY ANYTHING,\nTHAT. I COULDN’T BUY ANYTHING FROM THE WHOLESALERS\nI HAD BEEN BUYING FROM. 1 WAS SITTING UP THERE IN THE"
}