{
  "id": "d201-166",
  "text": "RICHTER:\nM ,N :\nRICHTER:\nJORDAN :\nFor two long dlocks in front of the school the mod\nPURSUED HER. 1T LAST, FRIGHTENED AND FORLORN SHE SAT\nDOWN ON A DENCH TO WAIT FOR A BUS TO TAKE HER HOME.”\nAgain, from the same source, DmVID J. Brittain, Jr.,\nprincipal of Clinton High school in Clinton, Tennessee.\nIS QUOTED AS SAYING THE FOLLOWING IN THE COURSE OF\nClinton’s integration endeavor.\nf’I T LOOKS QUIET, BUT ITrS JUST LIKE SITTING ON A POWDER\nKEG. AS FAR AS ITS BEING AN INTEGRATED SITUATION, ITf\nNOT AN INTEGRATED SITUATION. WHEN THE NeGRO KIDS CAME\nIN, THE OTHERS WERE REAL NICE AND FRIENDLY UNTIL THE\nWhite Youth Council was formed. Then any student even\nwalking down the hall with a Negro, they called him\n’Nigger lover.’\nNow the Negro kids don’t dare be a part of school life.\nThey’re the most humble kids we got in school, because\nTHEY KNOW THEY’VE GOT TO BE. If WE HADN’T HAD ANY\nTROUBLE, SOME OF THEM WOULD HAVE BEEN ACCEPTED AND\nOTHERS NOT, JUST LIKE WITH ALL STUDENTS. BUT THE WAY\nIT IS NOW, NOBODY EVEN TALKS TO THEM.\nThat Jhite Youth Council was the most damnable thing i\nTHIS WHOLE BUSINESS. ThEY TOOK THOSE YOUNG KIDS, NINT\nGRADE LEVEL, GAVE THEM AND TOLD THEM TO JUMP THE NEGRO\nKIDS. V E’ VE HAD MORE JUVENILE DELINQUENCY THIS YEAR\nTHAN IN THE WHOLE HISTORY OF THE COMMUNITY.”\nWe COULD GO ON INDEFINITELY DOCUMENTING AND ILLUSTRAT¬\nING INTIMIDATION IN THE POLITICAL SPHERE, IN THE\neducational sphere, in housing, and elsewhere. Jut as\nA KIND OF CONCLUSION TO OUR ILLUSTRATIVE MATERIAL WE\nWOULD L»KE TO HEAR 0R . CLARENCE JORDAN, WHO PARTICI¬\nPATED IN THE FOUNDING OF A LITTLE KNOWN RELIGIOUS\nCOMMUNITY IN -MERICUS, GEORGIA. * COMMUNITY CALLED\nKoingnia Farm, which was started in 1942, and which\nULTIMATELY BACA.iE IN INTERDENOMINATIONAL, INTERRACIAL\nSETTLEMENT, BASED ON Dr . JORDAN’S INTERPRETATION OF\nChristian principles and adhering to ownership in\nCOMMON. The following is a small portion of the story\nWE ELICITED FROM Dr . JORDAN IN THE SUMMER OF 1958.\nBut BECAUSE WE DID, IN a SENSE, HOLD ALL THINGS COMMON\nAS THE EARLY CHURCH DID, WE WERE IMMEDIATELY ACCUSED Ci\nbeing Communists, -*nd for people who could not distin¬\nguish BETWEEN THE TEACHINGS OF KARL MARX AND THE\nTEACHINGS OF JESUS CHRIST, WE WERE ONE IN THE SAME.\nAnd WE HAD A LOT OF BITTER OPPOSITION BECAUSE OF THAT\nBUT NEVER DID THE OPPOSITION DUE TO OUR N0N-PART I C I PA-\nTION IN WAR AND OUR COMMON OWNERSHIP, NEVER DID THAT\nOPPOSITION BREAK OUT INTO VIOLENCE LIKE THE OPPOSITION\nFROM, ON THE RACE VIEWPOINT HAS.\nRICHTER:\nThis opposition is of relatively recent origin?"
}