{
  "id": "d201-167",
  "text": "-10-\nJ0R0 \\N :\nRICHTER:\nJORDAN :\nRICHTER:\nSCHNEIDER:\nYes, well, all along there was a little bit out nothin'\nNEARLY AS SEVERE AS IT HAS BEEN DURING THE PAST TWO\nYEARS. I MIGHT GO ON AND SAY THAT AFTER THE MORE OR\nLESS, AFTER THE COMMUNIST SCARE SUDSIDED, THEN CAME THE\nSupreme Court decision ruling against segregation in\nTHE PUBLIC SCHOOLS. JELL, A YEAR LATER THE VHITE\nCitizens Councils were formed all over the South as a\nRESISTANCE MOVE TO THAT DECISION. AND QUITE NATURALLY,\nKoinonia came in for its share of attack and in, in the\nspring of 1956, THE opposition became so severe that\nIT ERUPTED INTO THE VIOLENCE OF WHICH WE’ VE DEEN SPEAK-\nI NG .\nWhat adout the children? I notice there are many\nCHILDREN HERE ON KOINONIA FaRM. HAS THE SITUATION\nHERE AFFECTED THEM IN ANY WAY?\nYes, it has quite naturally...it has affected them.\nThey have been shot at on one night while they were ou;\nPLAYING. TWO CARS CAME DOWN THE RAD AND 12 BLASTS OF\nSHOTGUN PELLETS WERE DIRECTED TOWARD THE COMMUNITY\nAND MANY OF THEM FELL ON THE CHILDREN; WELL, QUITE\nNATURALLY THAT FRIGHTENED THEM.. A ND THEN AT SCHOOL THf.\nHAVE BEEN CALLED ALL KINDS OF NAMES, AND HAVE SUFFERED\nACTUAL PHYSICAL VIOLENCE WHILE THERE AND IT BECAME\nNECESSARY FOR US TO TAKE OUT OF SCHOOL THE CHILDREN TH\nWERE IN HIGH SCHOOL AND TO SEND THEM AWAY. For THE PA\nTWO YEARS WE HAVE D<5NE THAT, GUT NOW, WE WANT TO MAKE\nANOTHER ATTEMPT TO SEND OUR CHILDREN TO THE LOCAL\nSCHOOLS. /aND WE’RE PLANNING TO DO THAT THIS FALL.\nTime, unfortunately, makes it impossible for us to\nPRESENT MORE ILLUSTRATIVE MATERIAL. OUR OBJECT TODAY,\nAS WE’VE INDICATED, HAS BEEN TO BRING HOME THE CONCRET\nVIVID, HUMAN MEANING OF INTIMIDATION. If WE HAVE\nSUCCEEDED AT ALL IN DOING THIS, THE POINT OF THESE\nSEVERAL STORIES HAS SURELY BEEN MADE. Is THERE ANY\nOVERALL COMMENT YOU’D LIKE TO ADD, l_OU9\nOnly a few necessarily rather general things. Inti¬\nmidation IS, TO BE SURE, A BASIC WEAPON AGAINST THE\nNegro. In a way it’s an ultimate weapon. vhen all el\nFAILS, VIOLENCE, OR THE THREAT THEREOF, CAN 3E CALLED\nINTO PLAY. IT’S PRETTY CLEAR, ALSO, THAT INTIMIDATION\nFREQUENTLY HAS TO SPREAD ITSELF. THAT IS, IN ORDER TO\nBE REALLY EFFECTIVE IT MUST OFTEN 3E APPLIED TO WHITES\nas well as Negroes. The school desegregation crises,\nTO CITE JUST ONE GERMANE THING, HWE ILLUSTRATED THIS\nVERY NEATLY. I MIGHT ALSO COMMENT THAT THE USE OF\nINTIMIDATION TENDS TO REAFFIRM AND RE-ENFORCE THE\nHISTORIC TENDENCY, MORE PARTICULARLY MARKED IN THE\nSouth, to employ violence, to override the law, and to\nREDUCE RESPECT FOR THE LAW. A POINT WE MIGHT KEEP IN"
}