{
  "id": "d201-17",
  "text": "-7-\nRICHTER:\nSCHNEIDER:\nfeel that nothing of value or importance was to be\nfound in a racialistic theory. The great cat, re¬\nmember, WAS COMPLETELY UNINTERESTED IN THE MAN’S\nPHILOSOPHIC THEORY. ..HIS ONLY INTEREST WAS IN FOOD\nAND SPORT. BUT, A RACIALISTIC THEORY IS LIKELY TO\nBE EXTREMELY ATTRACTIVE TO THE MEMBERS OF OUR THIRD\nCATEGORY OF PERSONS. 'Al H Y? BECAUSE TO AN APPREC I ABLE\nDEGREE THEY ARE NICE PEOPLE - PEOPLE WITH CONSCIENCES,\nPEOPLE WHO HAVE SOME DEGREE OF FAITH IN THE /AMERICAN\ncreed. They need, and can definitely use, such the-\nORIES AND PHILOSOPHIES TO VINDICATE THEIR WAYS AND TO\nSMOOTH THEIR RUFFLED CONSCIENCES. HENCE, I MIGHT ADD,\nthe Negro not only finds that people like these are\nmaking gains at his expense, but in addition that\nTHEY GRASP AT VIEWS AND THEORIES WHICH SUPPOSEDLY\nSHOW HIS, THE NEGRO’S, INFERIORITY. INSTEAD OF MAK¬\nING GAINS AND THEN LEAVING THE NEGRO ALONE, THESE\nPEOPLE, AS IT WERE, PILE INSULT ON INJURY BY ESPOUSIN'\".\nVIEWS AND THEORIES WHICH GIVE EASEMENT TO THEIR CON-\nSC I ENCES.\nWOULD YOU MIND GIVING US A CASE IN POINT?\nTake the Southern planters, who in the past, and even\nTODAY, HAVE BEEN AND ARE, TAKING ADVANTAGE OF NEGRO\nSHARE-CROPPERS - Or EVEN WHITE SHARE CROPPERS, WHEN\nPOSSIBLE. The cropper’s SHARE IS, IN THE FIRST place\nLIKELY ENOUGH TO BE A RATHER MEAGER ONE. THEN, THE\nPLANTER ALSO ACTS AS STORE-KEEPER AND BANKER FOR HIS\nCROPPERS. HE ADVANCES MONEY AND GOODS THROUGHOUT THE\nYEAR TO KEEP THEM CLOTHED AND FED. At THE TIME OF\nRECKONING, IN MANY CASES THE PLANTER WILL DELIBERATE¬\nLY FALSIFY HIS ACCOUNTS IN ORDER TO KEEP THE CROPPER\nINDEBTED TO HIM AND ON THE LAND. NOW, OUR PLANTER\nHAS BEEN TO SCHOOL, HE’S PERHAPS A MEMBER IN GOOD\nSTANDING IN HIS CHURCH, HE HAS A FAMILY TO WHICH HE’S\nDEVOTED, AND HE IS RECOGNIZED AS AN OUTSTANDING CITI¬\nZEN BY HIS NEIGHBORS. HOW CAN WE RECONCILE WITH THE C\nTHINGS THE DISHONESTY IN KEEPING FROM THE SHARE-CROP¬\nPER HIS DUE? OUR MAN CAN’T SIMPLY EXPLOIT THE CROP¬\nPERS AND LET IT GO AT THAT. HIS WHOLE TRAINING, HIS\nBACKGROUND IN CHURCH AND SCHOOL DEMAND THAT HE JUST¬\nIFY HIS BEHAVIOR. AND SO HE DOES. He MAY INSIST THA\nHIS ACTIONS ARE SOLELY FOR THE ,rGOOD:? OF THE SHARE¬\nCROPPER. He’ll point out that the cropper is ignor¬\nant...the ONLY WORK he’s FIT FOR IS WORK ON THE SOIL,\nHe’ll tell you that the cropper is improv i dent .. . he\nDOESN’T know WHAT TO DO WITH MONEY, EVEN WHEN HE HAS\nIT; THAT, IN FACT, HE, THE PLANTER, IS BEING PROTECT¬\nIVE of the Negro or poor-white, by seeing to it that\nHE ALWAYS HAS A ROOF OVER HIS HEAD AND FOOD ON THE\nTABLE - THINGS THAT THE IMPROVIDENT FELLOW WOULD BE"
}