{
  "id": "d201-170",
  "text": "-2-\nRICHTER:\nSCHNEIDER:\nTO AFRICA DWINDLED AND THE CAPTAIN’S FEARS GAVE PLACE TO\nCONFIDENCE.” ACCORDING TO MELVILLE J. HERSKOVITS, AN\nANTHROPOLOGIST WHO HAS DEVOTED MUCH RESEARCH TO THE\nNegro and his backgrounds, !t I t is not generally known\nHOW EARLY IN THE HISTORY OF NEGRO SLAVING REVOLTS DID\noccur. The Negro slave trade began with shipments of\nslaves to Haiti in 1510; the first slave uprising in\nHaiti, in 1522, thus took place only 12 years after the\ncommencement of the traffic. In the ^ew World posses¬\nsions of Spain, eleven other rebellions are recorded\nBETWEEN THE YEARS 1522 AND 1553, OF WHICH THOSE OF 1533,\n1537, and 1548 occurred in Santo Domingo. During the\nFOLLOWING CENTURY TWO REVOLTS TOOK PLACE AT HAITI, ONE\nat Port-de-Paix in 1679, and another in 1691.\"\nThis indicates the merest beginning of revolts outside\nthe United States. The history of the Vest Indies is\nRICH, IF RICH IS THE RIGHT WORD, WITH REVOLTS. ToUSSAIN\nL’Ouverture, and the Negro revolution in Haiti were well\nremembered in the South for decades after Toussaint was\ndead, w i th. in the United States slave revolts were also\nPLENTIFUL. We GET REPORT AFTER REPORT ON SUCH LINES AS\nthese: \"The constant fear of slave rebellion made life\nin the South a nightmare;\" again, \"Fresh.in (the memory\nof Southerners) were the horrors of the Negro revolution\nin Haiti;\" once more \"The tendency to revolt was unrem-\nITTANT, COVERING ALL THE SOUTHERN STATES, AND (the)\nNorthern ones as well during the period they sanctioned\nSLAVERY. |T It IS TRUE THAT MOST OF THE REVOLTS WERE\nSMALL-SCALE, BUT THEY WERE PRETTY CHRONIC THINGS,\nAPPARENTLY, AND THEIR CHRONICITY AND SHEER PERSISTENCE\nUNTIL THE TIME OF THE ClVlL War, EVIDENTLY OCCASIONED\nMORE THAN A LITTLE FEAR AMONG SouTHERNERS....STARTED\nRUMORS.WILD RUMORS AMONG THEM, AND AT TIMES SEEM TO\nHAVE BROUGHT ABOUT SOMETHING LIKE PANIC. I MIGHT ADD\nTHAT THE REVOLTS OF GABRIEL, OR GABRIEL PROSSER AS HETS\nCALLED WHEN NAMED AFTER HIS MASTER, IN VIRGINIA IN 1800;\nof Denmark Vesey in South Carolina in 1822, and of Nat\nTurner, again in Virginia in *831, are the ones most\nFREQUENTLY REFERRED TO IN THE LITERATURE OF SLAVE REVOLT\n....AND IF THESE REVOLTS HAVE OFTEN BEEN REMARKED BY THE\nHISTORIANS WE MAY BE SURE THAT THEY WERE NEVER FORGOTTE;\nin the South .\nThe story of the slave revolts, if we could tell it in\nDETAIL, WOULD BE A MOST DRAMATIC THING. HOWEVER, DRAM¬\nATIC OR NOT, I TAKE IT THAT THIS WAS NOT THE ONLY FORM\nof Negro protest?\nNo, CERTAINLY NOT. ThE SLAVE COULD, OF COURSE, MALINGE:\nHE COULD RUN AWAY; HE COULD PRACTICE SABOTAGE IN ONE OR\nANOTHER FORM. INDEED, WHEN THE H I ST 0 R I AN S iG 0 TO WORK ON\nTHESE THEMES OF PROTEST THROUGH MALINGERING, ABSCOND I N G .\nAND SABOTAGING, ONE IS ALMOST PROMPTED TO WONDER HOW THE.\nSLAVE SYSTEM COULD HAVE BEEN PROFITABLE. l3uT OUR SUB-"
}