{
  "id": "d201-171",
  "text": "-3-\nRICHTER:\nHUGHES:\nSCHNEIDER:\nRICHTER:\nJECT ISN’T THE PROF I TAD I LI TV OF SLAVERY. ALSO, THERE\nWAS THE FAMOUS PROTEST CONDUCTED BY NEGRO FIGHTERS IN\nthe Northern abolition movement. There were many of\nTHESE. \\mONG THE BEST KNOWN NAMES ARE THOSE OF FREDER¬\nICK Douglass, Sojourner Truth, and Harriet Tubman.\nalthough Douglass.is recognized as probably 'the eminent\nNegro leader in the period to which you are pointing,\nI’d like to have us capture, if we can, something of\nTHE SPIRIT OF ONE OF THE NEGRO ABOLITIONISTS YOU’VE\nMENTIONED, NAMELY SoJOURNER TRUTH, BY LISTENING TO\nSOME WORDS ABOUT HER BY LANGSTON nUGHES. In HER OWN\nway, Sojourner Truth could be as eloquent as the more\nOUTSTANDING AND MORE VERBALLY AND GRAMMATICALLY IMPRESS\nive Frederick Douglass. The following is an excerpt\nfrom the Folkways recording of The Glory of Negro ' .\nHistory, with the author, Langston Hughes, narrating*\nOne who had been a slave, but went away to freedom, was\nA WOMAN NAMED ISABELLA. IN NeW YORK ClTY SHE HAD A\nVISION, SO SHE CHANGED HER NAME TO SOJOURNER TrUTH, AND\nSHE BEGAN TO MAKE SPEECHES ALL OVER THE NORTH AGAINST\nSLA VERY :\n'’NOW ABOUT MY NAME, THE LORD GAVE ME SoJOURNER,\nBECAUSE I WAS TO TR VE L UP AND DOWN THE LAND SHOW IN* T H\nPEOPLE THEIR SINS AND BEIN’ A SIGN UNTO THEM. <H F T E RW A R\nI TOLD THE Lord I WANTED ANOTHER NAME, ’CAUSE EVERYBODY\nELSE HAD TWO NAMES. ^ ND THE LORD GAVE ME TRUTH, BECAUS\nI WAS TO DECLARE THE TRUTH TO THE PEOPLE. I’VE HAD\nFIVE CHILDREN, AND I’VE SEEN ’EM MOST ALL SOLD OFF INTO\nSLAVERY. mND WHEN I CRY WITH A MOTHER’S GRIEF,NONE BUT\nJesus hears, where they be, I don’t know-and my\nCHILDREN DON’T KNOW WHERE I BE. JUT I LOOK AT THE\nSTARS, AND THEY LOOK AT THE STARS, AND SOMEHOW I FEELS\nBETTER. NOW I WALKS THE WORLD LOOKIN’ FOR TRUTH. I\nTHINK OF THE GREAT THINGS OF GoO, NOT THE LITTLE THINGS\nI’S A SOJOURNER LOOKIN’ FOR TRUTH’.\nTruth to her was freedom-not just for herself,\nBUT FOR ALL.\nPersons like these already point us forward, away from\nTHE VIOLENCE REPRESENTED BY THE OLD NEGRO SLAVE REVOLTS\nAND TOWARD A NEW KIND OF PROTEST, WHICH APPEALED TO\nDEMOCRATIC AND RELIGIOUS PRINCIPLES, AND WHICH, IN MANY\nWAYS CONSTITUTES THE FOUNDATIONS OF PROTEST AS WE\nENCOUNTER IT TODAY.\nBUT WE AREN’T YET READY TO GO INTO THE PRESENT-DAY\nPROTEST. T THE LEAST, I THINK WE SHOULD PAY SOME\nATTENTION TO MARCUS GARVEY AND HIS ’’UNIVERSAL NEGRO\nImprovement -ssoc i at i on .iT"
}