{
  "id": "d201-18",
  "text": "-8-\nRICHTER:\nSCHNEIDER:\nunlikely to ensure for themselves. In other words,\nour kindly, religious, well brought up Southern plant¬\ner must prove td himself the inferiority of his crop¬\npers. Thus, not only does he take advantage of them,\nBUT HE ALSO FEELS COMPELLED TO DEGRADE THEM. Of\nCOURSE, I DON’T ARGUE THAT ALL PLANTERS WILL BE THIS\nWAY.ONLY THE RELATIVELY ,?NICE:’ ONES.\n'/ELL, ACCORDING TO YOUR ARGUMENT, LOU, IF PEOPLE WERE\nNICE ENOUGH, THEY WOULDN’T TOLERATE PREJUDICE IN THEM\nSELVES, IF THEY WERE NOT ’’NICE'7 AT ALL, THEY WOULD BE\nPREDATORY RATHER THAT THAN PREJUDICED. B‘UT SINCE SO\nMANY FALL IN BETWEEN, THE ORDINARY nNICE ' PERSON TEND\nTO BE PREJUDICED...TO PRESENT HIS VICTIM IN AN UNFAVC\nABLE LIGHT AT THE SAME TIME THAT HE DOES HIM INJURY*\nB UT ONE THING BOTHERS ME, LOU. YOUR EXAMPLES HAVE\nALL BEEN EXTREME EXAMPLES!. 0F PREJUDICED PEOPLE. ..BUT\nWHAT ABOUT THE ORDINARY PERSON WHO MAY RARELY, IF EVE\nCOME INTO CONTACT WITH A NEGRO IN A SITUATION FROM\nWHICH HE GAINS? VJHAT ABOUT THOSE OF US WHO ARE PRE¬\nJUDICED SIMPLY BECAUSE WE WERE BROUGHT UP. ..TAUGHT TC\nBE PREJUDICED?\nI DON’T MEAN SAY, WALT, THAT PREJUDICE INVARIABLY HAS\nTHE KIND OF BACKGROUND I’VE INDICATED. I AM SUGGEST¬\nING, HOWEVER, THAT THE BACKGROUND WHICH I’VE BEEN\nDEVELOPING IS A CRUCIALLY IMPORTANT ONE...MORE IMPORT¬\nANT THAN ANY OTHER, I FEEL, PARTLY BECAUSE PREJUDICE\nTHAT LACKS THE SPRINGS OR BACKGROUNDS OF VARIOUS KlNi\nOF GAIN IS RELATIVELY EASILY COMBATTED, AND WITHOUT\nSUCH SPRINGS WOULD MORE READILY DISAPPEAR. PREJUDICE\nNOT ONLY HAS A CERTAIN PLACE WITHIN THE FRAMEWORK OF\nOUR THINKING, BUT WE MUST LEARN TO LOOK UPON IT AS\nPPEFORMING CERTAIN SOCIAL FUNCTIONS. PREJUDICED ATTi\nTUDES GIVE CRUCIALLY SIGNIFICANT JUSTIFICATIONS TO\nDISCRIMINATORY BEHAVIOR. SUPPOSE WE DO ’’SIMPLY LEAR;\nPREJUDICE FROM CONTACT WITH OTHERS, AND THERE WERE\nNOWHERE IN THE UNITED STATES EVEN A HINT OF THESE\nGAINS MADE AT THE EXPENSE OF THE NEGRO TO WHICH I’VE\nBEEN REFERRING...SEXUAL, PRESTIGE, ECONOMIC. I THINK\nWE CAN SEE THAT PREJUDICE WOULD THEN BE A MUCH E AS I Er\nTHING TO ATTACK AND REDUCE TO VIRTUALLY NOTHING. BE¬\nCAUSE OF THE EXISTENCE OF DI SCR IMI N AT ION, WHICH IS Ti\nPROCESS OF GAINING IN THE WAYS I’VE INDICATED, PREJUD¬\nICE GETS A MUCH MORE POWERFUL LEASE ON LIFE. I MIGHT\nEVEN SAY THAT THERE ARE NOW REASONS’7 FOR IT. It PRE¬\nFORMS THE FUNCTION OF SHOWING DISCRIMINATION TO '’RIGHT\nAPPROPRIATE, JUSTIFIED."
}