{
  "id": "d201-180",
  "text": "-2-\nCOMMITTEES ON HUMAN RELATIONS, TO MENTION ONLY A FEW„\nToday, we*re going to take a verbal journey around\nTHE COUNTRY AND FIND OUT WHAT SOME OF THESE LATTER\nORGANIZATIONS ARE, HOW THEY HAPPENED TO COME INTO\nEXISTENCE, AND WHAT THEY ARE DOING, THEIR METHODS OF\nOPERATION, / E OURSELVES WILL INTERJECT SOME COMMENTS\nBUT WE FEEL THAT THE STORY SHOULD BE TOLD IN CONSIDER¬\nABLE PART BY THE MEN WHO MAN THE IMPORTANT POSTS IN\nTHE ORGANIZATIONS, AND WE SHALL PROCEED ACCORDINGLY.\nSCHNEIDER: I think we should make clear at the beginning, 'alt,\nTHAT THE OBJECT OF THIS PROGRAM IS PRIMARILY A DESCR!\nTIVE ONE. '/E THINK THAT THERE* S RATHER LITTLE PUBLIC\nKNOWLEDGE ABOUT SUCH ORGANIZATIONS AS YOU’VE MENTIONE\nAND PERHAPS A GOOD BIT OF MISINFORMATION. OUR DESIG:\nIS TO INCREASE THE KNOWLEDGE AND LESSEN THE MISIN¬\nFORMATION. Since you mentioned the Urban League fir:\nlet’s begin with it. The urban league was initiated\nIN THE EARLY YEARS OF THIS CENTURY. The FIRST TENTA¬\nTIVE activities that led to its formation began 50\nODD YEARS AGO, AN) THE ORGANIZATION ITSELF CAME INTO\nformal existence in the years 1910 to 1911. The\nFIRST PRESIDENT OF THE LEAGUE WAS A COLUMBIA PROFESSG\nof Economics, the late Edwin R. A. Seligman. A good\nPART OF THE MOTIVATION IN THE ESTABLISHMENT OF THE\nLeague stemmed from the desire to aid Negroes coming\nfrom the South to adapt to the industrialized cities\nof THE North and East. The League is primarily an\nINTERRACIAL SOCIAL SERVICE AGENCY. iviYRDAL COMMENTED\nim 1944 that '’the Activity of the local Urban League\nIS AS WIDE IN SCOPE AS,MODERN SOCIAL WORK WHEN APPLI.\nTO THE VARIEGATED NEEDS OF THE POVERTY-STRICKEN NEGRC\nCOMMUNITIES,1’ AND IV! R . LESTER GRANGER, EXECUTIVE\nSecretary of the Urban League, states today that\n'’Our principal emphasis points are better jobs,\nBETTER HOUSING, BETTER HEALTH AND RECREATION, -\\ND\nEQUAL ACCESS TO THE PUBLIC WELFARE FACILITIES A V A l Lr\nABLE TO OTHER CITIZENS OF THE COMMUNITY.’’\nRICHTER: .e spoke with Ivir. Granger in the summer of 19 58, at\nTHE HEADQUARTERS OF THE NATIONAL URBAN LEAGUE IN\nNew York City. He indicated some important features\nOF THE WORK OF THE LEAGUE IN ANSWER TO OUR QUESTIONS\nGRANGER: The National Urban League depends entirely upon\nPROFESSIONAL STAFF AND UPON A REGULAR BUDGET WHICH\nCOMES FROM THE COMMUNITY CHEST, IF THERE IS A COMMUN¬\nITY Chest, and until recently we were members of the\nChest wherever we were, and consists of an inter¬\nracial board which is elected according to certain\nRULES, WITH A MEMBERSHIP WHICH IS SMALL IN COMPARI¬\nSON WITH THE NA CP OR OTHER 0RGAN I ZAT I 0NS. . . .AND THE\nUrban League gets its strength from the fact that it"
}