{
  "id": "d201-182",
  "text": "RICHTER:\nGRANGER :\nRICHTER:\n3RAZIE* :\nPortland proper, -At that point, things began to .\nhappen-a.no an Urban League was organizedsin Portland\nin 1946. And with the organization of the Urban\nLeague for the first time the Negro leadership had\nsomething to hang onto, and there vjas a means of\nCOMMUNICATION BETWEEN WHITE AND NEGRO LEADERSHIP.\nThe Urban League became the driving force in a move¬\nment for racial reformation, reformation of racial\npractices. Today, Portland is very close to being a\nMODEL CITY IN COMPARISON WITH WHAT IT WAS IN 1943 OR\n1944 or 1945.\nDo YOU ATTRIBUTE THIS PRIMARILY TO THE EFFORTS OF THE\nUrban League?\nI.| attribute it principally to the Urban League.\nBut!. ,.to the League'as an . isnftrument of- a rising\nPUBLIC INTEREST. AND THAT’S THE LEAGUE’S FUN CTI 0 N —-\nTO BE THE INSTRUMENT OF SOCIAL INTEREST AND OF COURSE\nTHE INTIATOR OF SOCIAL INTEREST AS WELL. I WOULD SAY\nTHAT A GREAT MAJORITY OF PORTLANDERS WOULD ALSO GIVE\nthe Urban League credit for this change.\nStill getting down to cases, and crossing the contin¬\nent TO DO SO, WE SPOKE WITH MR . W'ESLEY BRAZIER,\nExecutive Director of the Los Angeles Urban League,\nAmong the things we asked him was whether there were\nany accomplishments in Los Angeles on the part of\nthe Urban League in which he took particul.r pride.\nYes, I would say that there are quite a number that\nWE LIKE TO POINT TO WITH PRIDE. I CAN’T ENUMERATE AL\nOF THEM, BUT ONE TH T....HITS ME IMMEDIATELY WOULD\nBE OUR REQUEST TO THE FEDERAL HOUSING ADMINISTRATION\nTO CHANGE ITS REGULATION^ ITS RULE, IN TERMS OF MEET¬\nING THE REQUIREMENT FOR GETTING AN FHA INSURED LOAN.\nYou’ll recall that the financial stipulation was so\nGREAT, TH J THE AVERAGE CITIZEN COULD NOT MEET IT. I\nWOULD SAY THEY WANTED ONLY THE HEAD OF THE HOUSE, HIS\nINCOME TO BE CONSIDERED, \\ N D IT MUST HAVE RANGED\nAROUND $550.00 TO $600.00 a MONTH. The Urban League,\nSENSING THAT IT WASN’T THE INTENT NOR THE PURPOSE OF\nTHIS FHA RULING TO MAKE THIS PROVISION JUST FOR A\nCERTAIN CLASS OF PEOPLE. THEREFORE, WE RECOMMENDED T\nFHA THROUGH OUR NATIONAL OFFICE THAT THEY HAVE*..\nGIVESOME CONSIDERATION TO SUPPLlMENTAL INCOME, OF A\nWIFE, OF THE CHILDREN, OF THE AUNTS, THE RELATIVES,\nAND THAT THIS BE COUNTED ALSO. THIS WOULD NOT HELP\njust the Negro, but would help all citizens. As a\nRESULT OF OUR PROPOSAL, WE’RE HAPPY TO SAY THAT THIS\nWAS FOUND FEASIBLE BY FH\\ AND TODAY, THROUGHOUT THE\nUnited States, people are now able to meet the re¬\nquirements AND TO GET FHA INSURED LOANS. THERE IS"
}