{
  "id": "d201-185",
  "text": "-7-\nFLE.vi ING :\nRICHTER :\nFLEMING :\nRICHTER:\nThe first thing I think that might be pointed out is\nTHAT THE SOUTHERN REGIONAL COUNCIL IS AN ORGANIZATION\nOF SOME HISTORY AND ANTEDATES THE RECENT CONCERN AND\nATTENTION THAT HAS CENTERED ON RACE RELATIONS IN THE\nSouth. In fact, it goes back, through its parent orga\nI Z A T ION, TO A/oRLD VV A R I, OR JUST ,FTER RoRLD R A R I\nWHEN THERE WAS AN INCREASE IN RACIAL TENSION, DIFFI¬\nCULTIES in the South, and the Commission on Interracial\nCooperation came into existence. This organization\nPERFORMED VERY VALUABLY OVER THE YEARS UP THROUGH THE\nTWENTIES AND THE THIRTIES INTO THE EARLY FORT I E S-\nPLAYED A MAJOR ROLE, FOR EXAMPLE, IN COMBATTING\nLYNCHINGS AND OTHER FORMS OF VIOLENCE IN THE SOUTH.\nDuring a/orld jar II, some fresh impulses were felt in\nthis field in the South and out of a series of confer¬\nences AND MAJOR CONSIDERATIONS BY SOUTHERN WHITE AND\nNegro leaders, the Southern Regional Council was born,\nThe Council’s role has necessariiy changed over the\nyears as the situation has changed. From those days\nwhen Negroes were pretty generally disfranchised,\nWITHOUT POLITICAL OR MUCH ECONOMIC POWER, IN THE EARLY\nTWENTIES. iE’VE NOW COME TO THE POINT WHEN A SERIES\nOF SUCCESSFUL COURT DECISIONS HAVE DEFINED, OR R E D E FI '\nTHE RIGHTS THAT NEGROES ALONG WITH OTHER CITIZENS ARE\nENTITLED, UNDER LAW, TO ENJOY. And THE SOUTHERN\nRegional Council, through its field work, its informa¬\ntion PROGRAM, THROUGH CONFERENCES, THROUGH WORK WITH\nthe Press and the other mass media, through, in short,\nA VARIETY OF TECHNIQUES, STAFF METHODS, HAS TRIED TO\nKEEP UP WITH THESE RAPID CHANGES AND TO CONTRIBUTE TO\nTHE MAJOR TRANSITION THAT THE SOUTH IS UNDERGOING IN\nREDEFINING EQUALLY THE RIGHTS OF ALL CITIZENS.\nj H A T DO YOU FIND THE LARGEST OBSTACLE IN FULFILLING\nTHE AIMS OF YOUR ORGANIZATION?\n-ELL, THE OBSTACLES, DESPITE ALL THE TENSION AND\nDIFFICULTY OF THE LAST FEW YEARS, THE OBSTACLES, IN A\nWAY, ARE FEWER AND LESS FORMIDABLE THAN THEY USED TO\nBE BECAUSE WE HAVE HAD A LEGAL REDEFINITION OF WHAT\nEQUAL RIGHTS MEAN. ^HICH MEANS THAT A MORE DEMOCRATIC\nSOCIETY IN THE SOUTH IN WHICH NEGRO CITIZENS PARTICI¬\nPATE AND FROM WHICH THEY BENEFIT LIKE OTHER G IT I ZE'NS ,\nIS NOW UNDERWRITTEN IN LAW. The DIFFICULTIES NOW A R I I,\nOF COURSE IN TRYING TO TRANSLATE THESE LEGAL R E A LITI E 3\nINTO THE PRACTICAL, EVERYDAY REALITIES IN SOUTHERN\nCOMMUNITIES. THERE’S A GOOD DEAL OF TENSION, A GOOD\nDEAL OF VERY VOCAL RESISTANCE TO THESE CHANGES, IN THE\nMAIN, I THINK, STIMULATED AND LED BY POLITICAL FIGURES\nin the South.\nHaving asked Mr. Fleming about obstacles to working\nOUT THE AIMS OF HIS ORGANIZATION, WE ASKED HIM ALSO"
}