{
  "id": "d201-19",
  "text": "-9-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nPerhaps our most important points, thus far, are that\nNICE PEOPLE ARE IN CERTAIN WAVS PARTICULARLY SUSCEPT¬\nIBLE TO PREJUD I CE . . .AND THAT PREJUDICE TIES IN IMPORT\nANT WAYS WITH CERTAIN GAINS MADE BY AT LEAST SOME\nMEMBERS OF THE SOCIETY IN WHICH THE PREJUDICE OCCURS «\nBut WHAT ABOUT THE STRUCTURE OF PREJUDICE ITSELF? IN\nWHAT WAYS AND WITH WHAT BACKGROUNDS ARE PEOPLE PRE-\nJUDICED9\nThat’s a large question, • ialt...and I can hope to\nANSWER IT ONLY PARTIALLY. I MIGHT BEGIN BY NOTING\nTHAT THERE IS EVIDENCE THAT THE EDUCATED ARE RELA¬\nTIVELY LESS PREJUDICED THAN THE UNEDUCATED. ONE CAN\nSPEAK OF IGNORANT PREJUDICE...PREJUDICE THAT IS SUS¬\nTAINED ON A FOUNDATION OF MISINFORMATION, OR LACK OF\nINFORMATION. APPROPRIATE INFORMATION CAN ...WHERE\nPREJUDICE IS GROUNDED SOLELY, OR NEARLY SO, IN IGNOR¬\nANCE, BE ENORMOUSLY ENLIGHTENING AND EMASIPATING.\nBut matters are by no means always so simple. For\nEXAMPLE, WE HAVE TO RECOGNIZE THAT THERE IS ALSO SUCH\nA THING AS EXPEDIENT PREJUDICE. WE ASSOCIATE WITH\nOTHERS WHOM WE LIKE AND WHOSE OPINIONS WE VALUE.\nNeighbors, for example. Now they, it happens, are\nPREJUDICED. In ORDER NOT TO ANTAGONIZE THEM. ..IN\nORDER NOT TO BE EXCLUDED BY THEM...WE PROFESS A PRE¬\nJUDICE OF EXPEDI ENCY . . . PREJUDI CE WE DO NOT FEEL OUR¬\nSELVES. I'Ve give an imitation, or make a show of PRE¬\nJUDICE. VE OFTEN DO THIS IN A CONCILIATORY WAY...\nA WAY WHICH WE FEEL COULDN’T POSSIBLY HARM THE NEGRO\nFor example...a liberal northerner associating with\nGENERALLY CONGENIAL SOUTHERNERS MAY FIND HIMSELF\nACQUIESCING IN OPINIONS AND ATTITUDES RELATING TO TH “\nNegro which he doesn’t really believe at all. He\ndoesn’t wish to wound his relations with pleasant\nassociates. He may be very self-critical later. Or\nWHEN HIS CONTACTS WITH THE PARTICULAR GROUP HAVE\nLAPSED HE MAY RETURN TO HIS ORIGINAL N0N-EXPRESS I 0N\nOF PREJUDICE HE DOES NOT FEEL.\nBut what about the person who resists to his utmost\nALL REASONING RELATING TO HIS PREJUD ICE. . .TENACl OUSL\nIN FACT, CLINGS TO HIS PREJUDICED BELIEFS?\nELL, THIS IS A MOST INTERESTING FORM OF PREJUDICE..\nOFTEN, NO DOUBT, PEOPLE LIKE THIS MAY HAVE WHAT WE\nCALL PSYCHODYNAMICALLY MOTIVATED PREJUDICES. ONE\nMAY CLING TO A PREJUDICE WITH SPECIAL TENACITY DES¬\nPITE all Rational arguments in the world because, let\nUS SAY, SCAPEGOATING IS VIRTUALLY A NECESSITY OF\none’s being. Thus the southern poor white seeks an"
}