{
  "id": "d201-191",
  "text": "-2-\nRICHTER:\nSCHNEIDER:\nline with the Negro’s interests and values. There\nARE THESE CONSIDERABLE PROBLEMS OF PREJUDICE, OF\nDISCRIMINATION, OF SEGREGATION. THERE ARE THE THOU'-\nSAND AND ONE PROBLEMS THAT CENTER ON HOUSING, MIGRA¬\nTION, RACE RELATIONS IN THE LARGE METROPOLITAN CENTE;\nCRIME, DELINQUENCY, AND SO ON AND ON. THE GROUND OF\nOPTIMISM I AM THINKING OF IS ONLY THE PRINCIPLE OF\nHITTING A BALANCE OF FO R CES I N S T R ATE GI C FASHION. . . .\nThat some old principle which Myrdal emphasized so\nmuch. Let me venture some repetit ions...The Negro’s\nHOUSING, FOR AN ARBITRARY STARTING POINT, AFFECTS HI;\nHEALTH; his health, in turn, is likely to AFFECT HIS\neconomic welfare; his economic welfare, his status;\nAND HIS STATUS IN ITS TURN, HIS CHANCES FOR DECENT\nHOUSING. One CAN work out a variety of such chains\nor circles. Let’s say, again arbitrarily, and using\nAN EXTREMELY CRUDE ECONOMIC NOTION, THAT IT WOULD\nTAKE ONE HUNDRED BILLION DOLLARS TO ''’SOLVE'’, IN SOME\nsense, Negro problems on the frontiers of housing,\nHEALTH, STATUS, AND SO ON, IF THOSE PROBLEMS WERE\nATTACKED ONE BY ONE, AND IF ON EACH FRONTIER THE\nENDEAVOR WERE TO MAKE MAXIMUM POSSIBLE GAINS FOR THE\nNegro. \\V e might soon discover that a piecemeal\nAPPROACH LIKE THIS WAS R EALLY UNNECESSARY OR IN A P P LI¬\nABLE UNNECE8SAR Y OR INAPPLICABLE BECAUSE OF THE\nCHAIN, OR CIRCLE, OR FACTOR-INTERACTION PHENOMENON.\nOne FACTOR, SUCH as housing, inaset of interrelated\nFACTORS, WHEN PROPERLY ’’PUSHED'’, COULD WELL START AN\nENTIRE UPWARD MOVEMENT, ON THE SAME PRINCIPLE ON\nWHICH A RELATIVELY SMALL ROCK, WHEN STRATEGICALLY\nDISPLACED, MAY CAUSE AN AVALANCHE. StILL PURSUING\nTHE CRUDE ECONOMIC NOTION WE MIGHT THEN DISCOVER THA\nTHE COST WOULD REDUCE FROM ONE HUNDRED BILLION TO ON.\nBILLION DOLLARS*. Of COURSE, THESE PARTICULAR FIGURE\nARE NOT TO BE TAKEN SERIOUSLY.\nI GATHER THAT YOU THINK THAT THIS GENERAL PRINCIPLE\nOF STRATEGIC HITTING OF FACTORS THAT CAN START RAMI¬\nFYING ACTION IS A VERY IMPORTANT ONE AND ONE THAT\nGIVES SOME GENUINE GROUND FOR OPTIMISM. But WOULD\nYOU MIND MAKING THE MATTER PERHAPS A LITTLE CLEARER\nFOR US BY EXPLAINING FURTHER, OR QUALIFYING, YOUR\nCOMMENTS?\nI’ll try, short of making an excessively lengthy\nSPEECH. I DO THINK THE PRINCIPLE EXTREMELY 1MP 0 R TA N'\nONE THAT DOES GIVE WARRANT FOR SOME OPTIMISM. But •\nWILL QUALIFY. FIRST, IT’S A GENERAL. ONE MAY EVEN\nCALL IT A FORMAL, PRINCIPLE. It DOES NOT, FOR EXAMPi\nTELL US HOW WE MAY GO TO WORK IN A PARTICULAR COMMUN\nITY WITH ITS PARTICULAR CONSTELLATION OF RACE PROBLE\nAND HIT WITH THE HIGHEST ECONOMY OF EFFORT AND ENERG\nON THE STRATEGIC FACTORS IN GENERAL DOES NOT TELL US"
}