{
  "id": "d201-193",
  "text": "-4-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nOF THEIR OWN INTERESTS THAT WILL ALWAYS CONSTITUTE A\nKIND OF SEED BED FOR THE EMERGENCE OF PLANTS LIKE\nPREJUDICE. I’D LIKE TO DEVELOP THESE QUALIFICATIONS\nBUT LET ME COME BACK TO MY GENERAL ASSERTION. PRE¬\nJUDICE AND DISCRIMINATION ARE AT LEAST SO MUCH A i\nMATTER OF LEARNED, CULTURALLY TRANSMITTED, BEHAVIOR.\nTHAT ANY PRACTICALLY ORIENTED ATTACKS ON THEM CAN\nPROFIT GREATLY FROM TAKING THIS INTO ACCOUNT.\nOf course, in the South certain antipathetic attitud\nTOWARD THE NEGRO ARE CULTURALLY TRANSMITTED FROM ONE\nGENERATION TO THE NEXT, AND I KNOW YOU ARE AWARE THA\nTHIS CAN HAPPEN IN THE NORTH TOO, BUT YOU CAN’T MEAN\nTHAT THIS GIVES YOU GROUND FOR OPTIMISM9\nHardly. But my stress is just on the cultural side\nOF THE MATTER. CULTURES DO CHANGE. GRANTED, IN THE\nLIGHT OF CERTAIN VALUES, THEY MAY CHANGE FOR THE\nWORSE, BUT IT’S THEIR SHEER CHANGEABILITY THAT I’M\nNOW EMPHASIZING. I.N OTHER WORDS, SIMPLE AND ELEMENT\nARY THOUGH IT BE, IT’S AN EXTREMELY VALUABLE BIT OF\nKNOWLEDGE THAT WE SHOW WE HAVE WHEN WE SAY, QUITE\ncorrectly: this Southern Negro-white situation jjb\nSUBJECT TO CHANGE. It CAN BE CHANGED. It MAY EVEN\nBE CHANGED VERY RADICALLY.AT LEAST IN THE C0UR3\nof time. Please note that I am indeed trying to be\nCAUTIOUS IN THE OPTIMISM THAT I mM EXPRESSING. It\nMAY WELL BE THAT THE MORE OR LESS EFFECTIVE ELIMINA¬\nTION OR SOLUTION OF THE SO-CALLED RACE PROBLEM IN\nthe United States may bring new and serious problems\nIN ITS TRAIN. But this is a large subject by itself\nAND it’s NOT OUR CONCERN TODAY. AGAIN, THE CULTURAL\nELEMENT IN PREJUDICE DOES MAKE US SEE THE SHEER P OS c.\nBILITY OF CONSIDERABLE CHANGE.\nNOW WHERE WOULD YOU GO FROM HERE? WoLLD YOU, FOR\nEXAMPLE, ALSO SEE AS GROUND FOR OPTIMISM THE DEMO¬\nCRATIC HERITAGE OF THIS COUNTRY? a'VoULD YOU AGREE\nWITH NiYRDAL THAT THE AMERICAN CREED IS A REALLY\nPOWERFUL THING?\nI THINK THE CREED DOES HAVE POWER, CONSIDERABLE\nPOWER. At THE SAME TIME THERE HAVE BEEN AND THERE\nARE FORCES THAT WORK AGAINST IT. If THE CREED HAD\nTHE FIELD TO ITSELF WE WOU L D GET A CERTAIN SIMPLICIT\nTHAT WE OBVIOUSLY DON’T FIND. BUT AS FAR AS THE\nNegro ip concerned, very definitely the existence of\nTHE CREED IS BOTH A MAJOR HOPE AND A MAJOR RESOURCE,\nIt SEEMS TO .E PRETTY CLE,* A THAT THE ACTIVITY OF TH\nPROTEST AND DEFENSE ORGANIZATIONS, WHICH WE’VE\nREVIEWED, IS BASED ON THE PREMI SE — AND THE HOPE —\nthat Americans '-ill he ultimately responsive to the"
}