{
  "id": "d201-194",
  "text": "-5-\nSCHNEIOER:\nRICHTER:\nMURRAY:\nNegro’s appeal to American principles of Democracy,\nJUSTICE, ANO SO ON, I RECALL ALSO, THAT WE MADE THE\nPOINT IN DISCUSSING PROTEST AS A WHOLE AND IN HISTOR¬\nICAL PERSPECTIVE, THAT THERE HAS BEEN A LONG-TIME\nSHIFT FROM A PRINCIPLE OF NO EXPECTATIONS FROM THE\nWHITE MAN AND HIS CULTURAL HERITAGE, TO A PRINCIPLE\nOF MORAL APPEAL AND RELIANCE ON THE NOTION THAT THE\nWHITE MAN’S POLITICAL AND RELIGIOUS PRINCIPLES CAN\nBE MADE TO WORK FOR THE NEGRO’S CAUSE.\nYes. Yet, again, we have to be cautious. Historical\nEXPERIENCE MUST INDUCE CAUTION. POLITICAL PRINCIPLES\nARE SUBJECT TO A REMARKABLE DEGREE OF TWISTING AND\nTURNING. From the SAME general political doctrine me\nARE CAPABLE OF DEDUCING THAT ALL SHOULD BE FREE, OUT\nALSO OF DEDUCING THAT A GREAT NUMBER SHOULD BE SLAVES\nReligion, too, can be used as for example it has been\nused in South Africa, to justify a very subordinate\nstatus for a colored population. In fact, as we knov\nthings like these have happened in the United States,\nVe are, nevertheless, currently in a phase in which,\nas far as the Negro is concerned, there is an obvious\nD I SPOSI T I.ON--DESP I TE A CERTAIN AMOUNT OF RESISTANCE\nTO IT—AN OBVIOUS DISPOSITION TO CONSTRUE POLITICAL\nAND RELIGIOUS DOCTRINES IN SUCH FASHION AS TO FORWARD\nthe Negro’s interests. That Negroes themselves\nCURRENTLY THINK CONSTANTLY IN TERMS OF DEMOCRATIC\nPOLITICAL PRINCIPLES. It MAY BE THAT DESPITE THE\nPOPULARITY AND IMPORTANCE OF FIGURES LIKE Or. MARTIN\nLuther King, the Negro professional leadership is\nSHIFTING AWAY FROM THE MINISTRY AS SUCH, AT THE\nSAME TIME, ONE GETS THE IMPRESSION THAT THE APPEAL\nTO AND BELIEF IN RELIGIOUS NOTIONS THAT ARE MADE TO\nBEAR ON THE NEGRO’S SITUATION ARE STILL VERY PEASUASI\nAND VERY IMPORTANT IN THE OUTLOOK OF MANY NEGROES.\nVhAT YOU’RE SAYING REMINDS ME VERY MUCH OF A BRIEF\nSTATEMENT WHICH WE ELICITED FROM IVHSS PAULI MURRAY,\nNegro author and attorney, to whom we have listened\nBEFORE IN THESE PROGRAMS. WE ASKED MISS MURRAY HOW\nSHE THOUGHT THE NATION MAY HAVE BENEFITTED FROM THE\nPRESENCE WITHIN IT OF THE NEGRO PEOPLE, AND IN HER\nANSWER SHE TOUCHES IN HER OWN WAY THE VERY THINGS\nYOU’ VE MENT I ON ED .\nI THINK THE NATION HAS BENEFITED IN MANY WAYS BUT\nI THINK TWO WAYS STAND OUT AS DRAMATICALLY SIGNIFICA!\nThe presence of the Negro in this country has provide\nthe United States with a test tube for democracy. Th\npolitical theory of democracy is one of the most diff\nICULT TO CARRY OUT IN PRACTICE, BECAUSE IT RESTS UPO?\nTHE ASSENT OF FREE PEOPLE AND RESTS UPON THE DISCI¬\nPLINE OF THE INDIVIDUAL TO ACCORD EVERY OTHER I NO I —"
}