{
  "id": "d201-2",
  "text": "-3-\nRICHTER :\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nCOUNTRY AND IN MANY FIELDS OF SOCIAL LIFE, THE NEGRO\nCANNOT BE WELL KNOWN TO THE WHITE, JUST AS THE WHITE\nCANNOT BE WELL KNOWN TO THE NEGRO.\nThe Negro is the mythical man. Even though we may\nNOT KNOW HIM WELL, WE READ ABOUT HIM, HEAR ABOUT HIM,\nTELL STORIES ABOUT HIM. GENERALLY SPEAKING, WE SEEM\nTO HAVE CONSIDERABLE CURIOSITY ABOUT HIM. AND, THE\nRESULTING COMBINATION OF IGNORANCE AND CURIOSITY, IS\nLIKELY TO GIVE RISE TO MYTH, LEGEND, AND PHANTASY.\nThe Negro is the various man. There exist very differ¬\ning IMAGES OF HIM. To THE SO-CALLED LIBERAL OF THE\nSouth as well as the North, he may appear as the un¬\nfortunate MEMBER OF AN OPPRESSED GROUP. To THOSE WHO\nFEEL ANTAGONISTIC TO HIM, OR THREATENED BY HIM. ..FOR\nWHATEVER REASONS. ..HE MAY APPEAR AS A MENACING FIGURE\nWHO WISHES TO SUBVERT PROMISING HOUSING DEVELOPMENTS,\nSTANDARDS OF EDUCATION, CHERISHED TRADITIONS, OR EVEN\nTHE VERY FOUNDATIONS OF AMERICAN LIFE. EMBATTLED WITH\nPARADOXICAL PEACEFULNESS UNDER THE LEADERSHIP OF A\nMartin Luther King in a large southern city, he present.\nONE ASPECT TO THE WORLD. IN VIRTUAL BONDAGE TO A WHITE\nlandowner in the rural South, he presnets another. in\nMILITANT COMBAT FOR RECOGNITION AS A SKILLED WORKER IN\nthe Northern industrial centers, he wears still a diff¬\nerent COUNTENANCE. OTHERS ARE VARIOUS, TOO, BUT PERHAPS\nFEW ARE AS VARIOUS, OR AS VARI 0USLY JUDGED IN AMERICA,\nas the Negro.\nThe Negro is the controversial man. There is much\nDISAGREEMENT ABOUT HIM. THIS IS HARDLY SURPRISING IN\nVIEW OF WHAT WE HAVE ALREADY SAID. E ARE INTERESTED\nIN THE Negro, although many of us know little about\nHIM. i E HAVE MUCH CURIOSITY ABOUT HIM. He SEEMS TO\nBE VARIOUS AND ELUSIVE. GlVEN A SITUATION LIKE THIS, I\nIS QUITE TO EXPECTED THAT THERE SHOULD BE CONTROVERSY.\nNortherners who have stood side-by-side with able and\nefficient Negro workers may well be inclined to call The\nNegro intelligent. Southerners, who have witnessed the\nVERY DIFFERENT BEHAVIOR OF THE NEGRO IN SOUTHERN FACTOR¬\nIES 7 FRESH FROM THE FARM'’, ARE LIKELY TO HAVE A VERY\nDIFFERENT VIEW OF HIS CAPACITIES. AND CONTROVERSY ABOU\nHIM EXTENDS INTO MANY OTHER FIELDS*. IS HE LIKELY TO 3 E\nPOLITICALLY RESPONSIBLE AND ALERT*? OR POLITICALLY MORE\napathetic and inept than the general run OF WHITES*? AND\nSO THE CONTROVERSY GOES ON INDEFINITELY.\nThe Negro is the minority man. The negro is eminently\nTHE MINORITY MAN IN THE UNITED STATES. He IS THE’ MOST"
}