{
  "id": "d201-20",
  "text": "-10-\nRICH TER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nANSWER TO WHY hE ’ S NEVER BEEN Gl VEN AN ,!EVEN BREAKVlf\nBY THE HIGHER ECHELONS OF WHITE SOCIETY ABOVE HIM,\nHe BECOMES BITTER, RESENTFUL, BUT THE RESENTMENT\nMAY, FOR VERY GOOD REASONS, HAVE VERY LIMITED OUTLETS\nIn many cases the POOR white...THE SHARE-CROPPER IF\nYOU WISH...MIGHT EXPRESS HIS RESENTMENT AGAINST MORE\nPOWERFUL, MORE INFLUENTIAL, AND RICHER WHITES. BUT\nBECAUSE OF THE HARD FACT THAT THESE OTHERS ARE MORE\nPOWERFUL, THE EXPRESSION OF RESENTMENT AGAINST THEM\nBECOMES UNWISE, AND IS LIKELY TO BE VERY UNCOMFORTABL\n|N ITS CONSEQUENCES. ON THE OTHER HAND, THE NEGRO\nMAY REPRESENT A CONVENIENT TARGET FOR THE RESENTMENT.\nVE GET HERE THE PHENOMENON OF DISPLACED AGRESSION.\nIn OTHER WO R D S, HOSTILITIES, RESENTMENTS, ANIMOSOTIEB\nARE DEFLECTED FROM THEIR ORIGINAL OBJECTS BECAUSE THE\noriginal Objects are dangerous. But the hostilities\nSTILL EXIST AND FIND A CONVENIENT OUTLET ELSEWHERE.\nScapegoats are obviously convenient.\nAnd one can’t attack such a powerfully motivated feel¬\ning OF RESENTMENT, OR SENSE OF BEING CHEATED, MERELY\nBY GIVING CORRECT INFORMATION.\nRight. The sense of being cheated and the resentment\nPERSIST DESPITE ALL THE CORRECT INFORMATION IN THE\nWORLD. ..AND CORRECT INFORMATION MAY NOT EVEN GET A\nCHANCE FOR A HEARING BECAUSE PEOPLE’S SHEER REQUIRE¬\nMENT OF SOMETHING OR SOMEBODY TO HIT AT IS SO POWER¬\nFUL IN THE FIRST PLACE .\nAnd I suppose it’s possible for people to be prejud-\nICEDNOT ONLY IN ONE OF THE THREE WAYS MENTIONED, BUT\nIN MANY COMBINATIONS OF IGNORANT, EXPEDIENT, OR PSY¬\nCHODYNAMIC MOTIVATION.\nThat’s right.\nSo NOW WE HAVE SOME UNDERSTANDING OF THE TYPES OF\nPREJUDICE* AND THE WAYS IN WHICH PEOPLE ARE PREJU¬\nDICED. But what about prejudice itself?...how does\nPREJUDICE WORK. ..HOW DOES IT WORK BY ITSELF? HoW\nDOES IT WORK IN COMBINATION WITH DISCRIMINATION?\nThat are some of the things that build up and sustain\nPREJUD1CE, Lou?\nOne of the most evident sustaining factors, or even\nEVOKING FACT FACTORS IN PREJUDICE IS THE *’B A D SAMPLE..\nSAYING, ;’l REALIZE THAT MY EXPERIENCE WITH NEGROES IS\nVERY LIMITED. ..BUT THIS TIME I WAS DOWN IN BIRMINGHAM-\n...” H ER THE PERSON IS IN EFFECT- T:E L L I N;G US • T‘H ATE H E\nREALIZES THAT HIS SAMPLING IS ALL OFF, YET HE HAS AN\nUNDERLYING PERSUASION THAT THE CASE HE’S CITING OR\nTHE STORY HE’S TELLING IS IN SOME WAY REPRESENTATIVE\nOR TYPICAL."
}