{
  "id": "d201-22",
  "text": "-12-\nown SHARE IN MAKING THE INDIAN WHAT HE FINALLY APP¬\nEARS TO DE. The MECHANISM ts A very widely OPERATIVt\nONE. .'E CALL JEWS EXCLUSIVE, PROCEED TO SHUN THEM\nON THE GROUND THAT THEY WILL HAVE NOTHING TO DO WITH\nUS, AND THEN DISCOVER THAT THEY SEEM TO BE RELUCTANT\nTO ASSOCIATE WITH NON-JEWS. AND INDEED, THEY MAY\nWELL HAVE REACTED DEFENSIVELY AGAINST THE EXCLUSION\nBY US BY WITHDRAWING INTO THEIR OWN GROUPS AND NOT\nMAKING THEMSELVES SUSCEPTIBLE TO WHAT THEY PRECEIVE\nAS REBUFFS.\nRICHTER: Or by the same token, i suppose, the white man employ¬\ning N EGROES STARTS WITH THE PRESUMPTION THAT NEGROE\nARE LAZY AND WILL NOT RETURN A GOOD DAYTS WORK FOR A\ngood day’s pay. Hence he may treat the Negro differ\nENTLY FROM HIS OTHER EMPLOYEES, THEREBY DESTROYING\nINCENTIVES TO DO HIGH-LEVEL WORK. THE FINAL RESULT\nTHEN IS THAT THE NEGRO DOES APPEAR TO BE LAZY AND\nWON’T DO GOOD WORK ON THE JOB.\nSCHNEIDER: There is no reason to suppose that the Indian is in¬\nherently MURDEROUS, OR THE JEW IS INHERENTLY EXCLUS-\n■ ive, or the Negro inherently lazy. These traits\nWHEN THEY EXIST CAN BE AS MUCH THE PRODUCTS OF THE\nPREJUDICED AND DISCRIMINATORY PERSON, AS OF THE IND¬\nIAN or Jew or Negro. Indeed, the traits are the\nPRO-DUCTS OF INTER-ACTION. UNDER DIFFERENT CIRCUM¬\nSTANCES WITH DIFFERENT TREATMENT, WITH DIFFERENT\nPREMISES IN THE APPROACH MADE TO THEM, INDIAN OR JEW\nor Negro may show very different traits.\nRICHTER: Well, if the self-fulfilling prophesy works in one\ndirection can it also work in the opposite direction\nWould confidence in the Negro employed - on - the\npart of white employer-help promote faithful and con\nSCIENTIOUS WORK ON THE PART OF THE NEGRO?\nSCHNEIDER: I should think so. Of course, a single so called\nGOOD-EXPERIENCE MAY NOT BE ENOUGH IN PARTICULAR CASE\nTO WIPE OUT THE EFFECT OF MANY PAST EXPERIENCES OF A\nDIFFERENT NATURE. BUT IT IS WORTH NOTING THAT IF TH‘\nSELF-FULFILLING PROPHESY PRODUCES SOME GRIM THINGS\nIN OUR RELATIONS WITH THE NEGRO THE PROCESS ITSELF\nIS SUCH THAT IT MAY GENERATE QUITE DIFFERENT KINDS\nOF TH I NGS . . .WHI CH SOME OF US, AT LEAST, MIGHT LIKE\nMUCH BETTER. I DON’T THINK THIS NEEDS ANY ELABORA'\nT | ON ."
}