{
  "id": "d201-25",
  "text": "-2-\nRICHTER:\nMURRAY:\nSCHNEIDER:\nTH»,;§ '■ WEEK IS A OftO'AD UNDERTAND I N G;.. 0;F A L L THESE fORM\n-- ARE JUD-I ;C)E;, D. I S C:R I Ml NAT I .ON AND SEGREGAT I Q.N I Nr, THE\nEFFECTS OH •THjE PrEjR-3.0N A L I TY NegR-O, OR WH tvTE.; e ; -\n. .; =; i ■: £ o N0 . H i T' „\nTo HELP US WITH OUR PROGRAM TODAY WE HAVE PORTIONS\nOF RECORDED CONVERSATIONS WITH JACKIE ROBINSON, BUS\nINESSMAN AND BASEBALL GREAT; Dr . KENNETH CLARK, EDU\nCATOR AND PROFESSOR OF PSYCHOLOGY; MR. E. FREDERICK\nMorrow, assistant to President Eisenhower, miss\nLillian Smith, and Miss Pauli Murray, lawyer and au¬\nthor. In our chat with Miss Murray, she gave us wha\nMIGHT WELL BE USED AS AN INTRODUCTION TO TODAY’S\nPROGRAM DEALING WITH THE EFFECTS OF PREJUDICE ATTI¬\nTUDES.\nBY AND, LARGE, I WOULD SAY THAT SOME OF THE NEGATIVE\nCONSEQUENCES OF THESE ATTITUDES ON THE PART OF THE\nLARGER COMMUNITY ARE THAT THE SELF-IMAGE WHICH THE\nNegro has is constantly something which he must ove\nCOME IN HIMSELR. THE CONTINUAL POUNDING AWAY FROM\nLET US SAY, SEGREGATIONISTS, PEOPLE WHO ARE FULL 01\nBIGOTRY AND PREJUDICE, ON THE THEME THAT THE NEGRO\nINFERlOR...THAT HE HAS NOT YET DEVELOPED TO THE POI\nWHERE HE SHOULD, AS A MATTER OF RIGHT RECEIVE ALL 0\nTHE OPPORTUNITIES WHICH OTHER PEOPLE DO...HAS MEANT\nthat the Negro has constantly had to overcome this\nfeeling of inferiority. Sometimes he himself is al\nMOST APT TO BELIEVE IT. THIS HAS CREATED CERTAIN\nUNDESIREABLE ATTITUDES WITHIN THE NEGRO COMMUNITY\nself. Sometimes based upon color...the belief that\nTHE MORE ONE APPROACHES IN PHYSICAL ASPECTS THE CA«\nCASIAN GROUP, THE MORE FAVORED ONE IS...OR THE MORl\nsuperior one is. And so there have been actually\nDISADVANTAGES WITHIN THE NEGRO GROUP ITSELF, BASED\nUPON GRADATIONS OF COLOR. NOW l DON’T THINK THIS I\nANY MORE THAN A SECONDARY REACTION TO THE TOTAL COi'\nUNITY’S JUDGEMENT AND EVALUATION OF THE NEGRO. But\nNEVERTHELESS, THIS Ha S BEEN ONE OF THE REACTIONS,\nHAS, i THINK, CREATED A GREAT DEAL OF DISADVANTAGE\nWITHIN THE GROUP ITSELF.\nMiss Murray sharpens our awareness of this very si\nCONCEPT OF SELF-IMAGE. IttS A COMMON PLACE OF SOCI\nPSYCHOLOGISTS THAT SELF-IMAGES...GROUNDED THE WAY\nWHICH PEOPLE VIEW T H E M S E L V E S . . . A R E PROFOUNDLY I NFL'\nENCED BY THE ATTITUDES THAT OTHERS HAVE TOWARDS THE\nAs Miss Murray has pointed out, in general it is cf\nTAINLY DIFFICULT TO MAINTAIN A FLATTERING IMAGE OF\nONESELF WHEN THERE IS CONSTANT AND INSISTENT PRESS\nFROM OTHERS WHICH ENFORCES A DEFINITELY UNFAVORABL"
}