{
  "id": "d201-27",
  "text": "-4-\nRICHTER:\nROBINSON :\nSCHNEIDER:\n| ;4 a CONVERSATION WITH JACKIE ROBINSON THIS PROBLEM\nOF SELF-IMAGE WAS TAKEN OUT OF THE CLINIC OR LABOR¬\nATORY, AND WE LEARNED HOW ONE YOUNGSTER HAD TO FACE\nTHIS NEGATIVE EVALUATION, AND HOW HIS PARENTS COPED\nWITH THE PROBLEM.\nI THINK THE THING THAT AWAKENED ME MORE THAN ANY¬\nTHING WAS WHEN WE FIRST MOVED UP TO STANFORD, CONN¬\nECTICUT. There wasn’t anything vicious about this\nINCIDENT, BUT MY LITTLE BOY, MY YOUNGEST ONE, CAME\nHOME ONE DAY FROM SCHOOL, AND HE SEEMED EXTRAORDIN¬\nARILY QUIET, AND SOMETHING HAPPENED AT SCHOOL WHERE\nSOMEBODY HAD KIDDED HIM ABOUT THE COLORING OF HIS\nSKIN...CALLED HIM DIRTY, OR SOMETHING, AND HE WAS\nDEEPLY HURT BY IT. AND WHEN WE FOUND OUT WHAT IT\nWAS, IT CERTAINLY MADE US THINK, AND WE STOPPED AN\nTALKED TO HIM AND EXPLAINED THAT IF HE LOOKED AT\nTHE COLORING OF HIS MOTHER AND HIS FATHER, AND IF\nHAD THE SAME KIND OF PRIDE THAT WE HAVE IN THE FACi\nTHAT WE ARE MADE AS WE ARE. ..THAT GOD HAD GIVEN US\nTHIS SKIN BECAUSE THIS WAS WHAT HE WANTED US TO HA\\\nTHEN HE SHOULDN’T FEEL BADLY ABOUT IT, AND REGARD¬\nLESS OF WHAT PEOPLE SAY OR DO, FOR HIM NOT TO EVER\nWORRY ABOUT IT BECAUSE NAMES CANNOT HURT HIM. ^ND\nHE HAD SIMILAR EXPERIENCES LATER ON, AND HE HAS\nREALLY COME THROUGH FINE WITH FLYING COLORS.\nIn his story, ivir, Robinson suggests to us the posss\nBILITY OF A CONFLICT IN SELF-IMAGES. THE 30Y WAS\nGIVEN ONE IMAGE AT SCHOOL AND ABOTHER BY HIS PAREN'\nThis conflictis actually more than a possibility.\nIt represents something very real. Let’s take a\nCLOSE LOOK AT CONFLICT IN SELF-IMAGES, AND NOTE Wh\nIT DOES TO THE INDIVIDUAL. 'J E MIGHT BEGIN BY ASSU\n|NG A SOCIETY IN WHICH THE FACT OF COLOR DIFFERENCE\nWAS ABSOLUTELY MEANINGLESS TO PEOPLE. AND IN WHIG\nTHEREFORE, YOUNG ROBINSONS WOULD NEVER BE TOLD AT\nSCHOOL THAT THEY WERE DIRTY BECAUSE THEY WERE COL¬\nORED. In such a case the self-image of the Negro\nCHILD WOULD NOT DIFFER, BECAUSE HE WAS NEGRO* FROM\nTHAT OF A WHITE CHILD. THIS IS A SITUATION WHICH,\nTO PUT IT CONSERVATIVELY, WE HAVE HARDLY REACHED.\n:} £ MIGHT ALSO CONCEIVE A VERY DIFFERENT SITUATION\nIN WHICH ALL WHITE JUDGEMENTS OF ALL NEGROES WERE\nDISTINCTLY UNFAVORABLE. INEVITABLY, NEGROES WOULD\nINCORPORATE MUCH OF THE UNFAVORABLY TINGED ATTITUD\nTOWARD THEMSELVES OF THE WHITES. If THERE WERE, I\nTHIS CASE, ANY FAVORABLE ELEMENTS IN THE SELF-IMAC\nof the Negro they would somehow have to be generat\nED WITHIN THE NEGRO GROUP ITSELF, WITH OUT ANY AID\nFROM WHITES."
}