{
  "id": "d201-28",
  "text": "-5-\nRICHTER: And since neither of these situations exists the\nNegro is then given a much more complex, even a\nCONFUSING IMAGE OF HIMSELF.\nSCHNEIDER: You are quite right. I described these two hypo¬\nthetical SITUATIONS MERELY IN ORDER THAT WE MIGHT\n'APPREHEND MORE CLEARLY JUST WHAT THE ACTUAL SITU¬\nATION is. There is a stream of criticism from mem¬\nbers OF THE LARGER WHITE SOCIETY. THIS IS BOUND T\nINFLUENCE THE NEGRO AND TO MAKE THE CONTENT OF HIS\nSELF-IMAGE UNFLATTERING TO HIMSELF. AND WE REMEM¬\nBER ALSO THAT IT IS CRITICISM ON MANY FRONTS...\nCRITICISM THAT COMES TO THE NEGRO IN MANY WAYS.\nSome of it comes by way of verbal matter. The\nNegro learns that he is d i rty ...considered dirty,\nINADEQUATE, LOW, ANIMAL-LIKE...GENERALLY INFERIOR.\nBut the criticism is more than verbal. It is, one\nMIGHT SAY BUILT INTO THE PHYSICAL STRUCTURES OF SO\nIETY. The differentiation of lavatories for white\nand Negroes is more than, or beyond, a verbal cri¬\nticism. It is a ’rigging1’ of the environment in s\nSUCH FASHION that evenwhen there is no white man\naround to remind the Negro that he isn’t supposed\nTO BE UP TO SNUFF, THE ENVIRONMENT ITSELF WILL RE¬\nMIND him. This gives us but the barest notion of\nTHEMANI FOLDNESS OF THE THINGS THAT CONSTRAIN THE\nNegro toward having an unflattering view of himsel\nBut it is also true that the whites do not repre¬\nsent A UNITED FRONT. SOME OF THEM INSIST THAT TH:\nNegro is as good as the white man. And this is\nBOUND TO INFLUENCE THE NEGROES SELF-JUDGEMENTS.\nvV E may RECALL THE AMERICAN CREED TO WHICH WE\nREFERRED IN THE LAST PROGRAM. THAT CREED WHICH IS\nBASED UPON EQUALITY UNDER THE LAW, OPPORTUNITY, o-\nJUSTICE, DEMOCRACY .... THE PERVASIVE VALUATIONS IN\nTHE CREED CERTAINLY WOULD NOT UPHOLD THE NOTION OF\nTHE INTRINSIC INFERIORITY OR LESSER WORTH OF MI N 0 ^\nITY GROUPS. What kind of PSYCHOLOGICAL PICTURE DC\nWE GET THEN9\nRICHTER: As I said, I believe the Negro must have a complec\nIMAGE OF HIMSELF.\nSCHNEIDER: The word ’’complex’ certainly seems justified to mc\nUndoubtedly many Negroes are involved in hard inn\nSTRUGGLES CENTERING ON THIS MATTER OF A 'SELF-IMAG\nSome seem to come out pretty well and have a soli\nSENSE OF INNER WORTH. OTHERS SEEM TO COME OFF LE\nWELL. It MAY EVEN BE THAT THIS KIND OF COMPLEXIT'"
}