{
  "id": "d201-33",
  "text": "-10-\nand Negroes, but a rather dramatic one. Let me say\nTHAT I DON’T CLAIM THAT THESE VIEWS REPRESENT ABSO¬\nLUTE TRUTH - BUT ON THE OTHER HAND, THEY DO MAKE A\nGOOD DEAL OF SENSE OUT OF VARIOUS STRIKING THINGS\nTHAT HAVE APPEARED IN THE COMPLEX RELATIONSHIPS OF\nwhite men, Negro women, and white women. I should\nALSO MENTION THAT THE VIEWS WERE NOT ENTIRELY NEW\nWITH IVlYRDAL, BUT WERE AT LEAST PARTLY SUGGESTED TO\nhim by a Southerner, L. F. Cash, by way of Cash’s\nbook on The Mind of the South. iViyrdal contends th;\nGUILT FEELINGS RESULT FOR THE SOUTHERN WHITE MAN\nFROM HIS TREATMENT OF NEGRO WOMEN. AND FURTHER,\nTHAT THESE GUILT FEELINGS LIE BEHIND CERTAIN OF THE\nATTITUDES TOWARD WHITE WOMEN FOUND AMONG SOUTHERN\nWHITE MEN. LET ME TRY TO CLARIFY THE MATTER. -Vh I \"\nWOMEN WERE CERTAINLY OFTEN AWARE OF THEIR MEN’S SE\nUAL ADVENTURES WITH NEGRO WOMEN AND WERE DISTURBED\nBY THEM. (YOU NOTE, BY THE WAY, I USE THE PAST\nTENSE - THIS WHOLE INTERPRETATION OF MYRDAL’S, I\nBELIEVE, HAD STRONGER FORCE SOME YEARS AGO THAN IT\nWOULD TODAY, ALTHOUGH IT’S STILL PERTINENT ENOUGH ~\nREFER TO NOW.) THE W4 »*• 1C E. M E1^ , FO R THEIR PART, FELT\nGUILTY BECAUSE OF THESE ADVENTURES. AFTER ALL, THE\nWERE THE INHERITORS OF A CULTURE THAT STRESSED THE\nAmerican Creed, that contained puritanical elementc\nTHAT DID NOT ALLOW OF EASY AND UNDISTURBED ADULTER\nOR FORNICATION. It IS,. THEREFORE, UNDERSTANDABLE\nTHAT THEY FELT GUILTY. AND FEELING GUILTY THEY SO\nSOUGHT TO ABSOLVE THEMSELVES OF GUILT. To EXPLAIN^\nOR MAKE CLEAR TO THEMSELVES WHY THEY HAD BEEN SUCH\nSINNERS THEY SOMETIMES INVOKED THE IRRESISTABLE AN¬\nIMALITY of the Negro woman. Also, they glorified\nTHE VIRTUES OF THEIR OWN WHITE WOMEN. FEELING THAT\nTHEY WERE THEREBY COMPENSATING THEM FOR THE WRONG\nTHAT THEY HAD DONE THEM, THE HURT THAT THEY HAD IN¬\nFLICTED UPON THEM BY THESE ”SINFULiT RELATIONS WITH\nNegro women. At least one way to respong to the\nFEELING THAT ONE HAD BEEN VERY WICKED AND HURT THE\nWHITE WOMAN WAS TO SAY TO HER, ’’DARLING YOU’RE SO\nVERY WONDERFUL'’, AND TO AFFIRM HER W 0 N D E R F U L N E S S\nWITH A GLARE IN THE EYE AS IF TO DEFY ANYONE TO D E!\nit. Perhaps the unquiet conscience could be eased\nBY PUTTING THE SOUTHERN WHITE WOMEN ON A PEDESTAL\nAND ASSERTING THAT SHE WAS THE MOST MARVELOUS WOMAi\nTHAT EVER WAS. AND THIS MUST NOT BE CHALLENGED LEC\nthe Southerner feel that he had not given adeq.ua.te\nCOMPENSATION TO HIS OWN WHITE WOMEN FOR THE TERRIBL\nTHINGS THAT HE HAD DONE. ..FOR SUCH HE FELT THEM TO\nBE, HE BEING THE RELATIVELY NICE, DECENT, RESPECT¬\nABLE FELLOW THAT HE WAS.."
}