{
  "id": "d201-38",
  "text": "-3-\nRICHT -R :\nLOGAN :\nRICHTER:\nLOGAN :\nSCHNIEDER:\nthat in Europe at the same time.\nwould you like to develop that a little bit further?\nYes. For example, they had an ordered system of\ngovernment, usually with king and a council of notabl\nThey had extensive trade across the Sahara desert\nwith North Africa and with Southwestern Europe, many\nOF THEIR RULERS MADE THE PILGRIMAGE TO MECCA, AN IND¬\nICATION OF THE FACT THAT THEY WERE MUSLIMS, BUT THEY\nWERE NONETHELESS WHAT WOULD BE CALLED NEGROES TODAY..\nTHEY HAD UNIVERSITIES, AND THERE COMES TO MIND IN STAN\nLY THE FAMOUS CITY OF Timbuctu, ON THE BIG BEND OF TH\nNiger River. Fortunately, a French Explorer by the\nname of Felix Du Sois visited Timbuctu in the early\nPART OF THE CENTURY, AND FOUND EXTANT EVIDENCES OF TH\nHIGH DEGREE OF CIVILIZATION AS MANIFESTED BY EXTREMEL\nFORTUNATE THAT iviESSIEU Du B 0 < S MADE THAT TRIP, 8ECAU S'\nACCORDING TO RECENT TRAVELLERS, PRACTICALLY NOTHING !\nleft. Moreover, one disastrous effect of the slave\nTRADE WAS THAT IN THE BEGINNING IT WAS CONFINED LARGE\nLY TO THE WEST COAST OF AFRICA. By THE TIME EuROPEA■\nPENETRATED INTO THE INTERIOR, ARABS COMING DOWN FROM\nthe North had conquered the indiginous rulers, and\nTHEIR PEOPLE, AND HAD DESTROYED MANY OF THE PHYSICAL\nEVIDENCES OF THEIR CIVILIZATION, SO THAT THE WRITING:\nOF VISITORS FROM THE EIGHTEENTH CENTURY ON WERE BASED\nRATHER ON WHAT THEY SAW AFTER THE OVERTHROW OF THOSE\nKINGDOMS THAN ON THE TYPE OF CIVILIZATION WHICH HAD\nEXISTED FROM 700 DOWN TO ABOUT 1591 WHEN THE ARABS\nOVERTHREW SoNGHAY, THE LAST OF THOSE GREAT MEDIEVAL\nAFRI CAN D I NGDOMS.\nWAS SLAVERY IN existence: in Africa ouhimc the course\nOF THESE K (NGDOMS?\nSlavery waq, existed in Africa, specifically in West\nAfrica, many years, going back, of course, as fai\nAS RECORDED EVIDENCE IS AVAILABLE, TO THE TIME OF THE\nRomans. And during this period from 700 to the end O'\nTHE 16th CENTURY SLAVERY UNDENIABLE EXISTED. ThE DIF\nERENCE IS, HOWEVER, THAT SLAVERY WAS A KIND OF DOMES\nTIC SLAVERY. IT INVOLVED, UNDOUBTEDLY, INTERTRIBAL\nWARFARE TO SOME DEGREE, BUT OBVIOUSLY THERE WAS LlTTi\nSLAVE TRADING TO THE WESTERN WORLD,\nAt this point we might explore the reasons for the\nIMPORTATION INTO THE N E W WORLD OF SLAVES FROM AFRICA\nAttempts had been made by North America settlers to\nenslave Indians. However, the Indians were highly\nSUSCEPTIBLE TO DISEASES BROUGHT BY THE WHITES, TO\nWHICH THEY HAD ACQUIRED NO IMMUNITY,, BESIDES, THEY\nDIDN’T SEEM TO MAKE EFFICIENT WORKERS UNDER A PLANT-"
}