{
  "id": "d201-39",
  "text": "RICHTER:\nFRANKOiN:\n-4-\nATION REGIME, A DEFICIENCY RELATED, NO DOUBT, TO THE\nRELATIVE SIMPLICITY OF THE ECONOMIC BACKGROUND FROM\n'WHICH THEY HAD COME. INDIANS ALSO KNEW THEIR OWN\nTRAILS AND FORESTS IN A FASHION THAT LATER NEGRO\nSLAVES DID NOT. AND IT WAS NOT ALWAYS WISE TO EN¬\nSLAVE Indians whose kinsmen might visit reprisals on\nTHE WHITES. THE WHITES ALSO TRIED WHITE INDENTURED\nSERVANTS, WHO WOULD GO THROUGH A PERIOD OF SERVITUDE\nDURING WHI H THEY DID HEAVY LABOR IN FOREST AND FIELD\nBut white servants could go to law for their rights\nTHEY RAN AWAY, THEY HAD TO BE REPLACED WHEN THEIR\nPERIOD OF SERVITUDE ENDED, AND THEN THEY MIGHT WELL\nBUY LAND AND START COMPETING WITH THEIR FORMER MASTEi\nThe TREMENDOUS DEMANDS OF THE NEW WORLD FOR LABOR\nCOULD NOT, IN ANY CASE, BE SATISFIED BY WHITE SERVANT\nSo WE BEGIN TO SEE WHY THE WHITE MAN BEGAN TO LOOK Oi\nthe Negro with a n w and special interest. More\nINTERESTING SIDELIGHTS ON THIS SUBJECT WERE FURNISHE.\nus by Or. John Hope Franklin, Historian, Author, and\nChariman of the Department of History at Brooklyn\nCollege, New York:\ni THINK IT OUGHT TO BE REMEMBERED THAT THE FIRST\nNegroes that came to fc. n g l ish America were not slaves,\nBUT WERE INDENTURED SERVANTS. It WAS THE EXPERIENCE\nthat English America had with Negroes that convinced\nthe English-Americans that Negroes were quite suit¬\nable for enslavement. One factor, of course, was\nTHAT OF COLOR. THE FACT THAT THE NEGRO WAS QUITE\nDIFFERENT FROM THE WHITE MAN IN COLOR AND IN PHYSIOG¬\nNOMY, GENERALLY, AMD E IT POSSIBLE FOR HIM TO BE SET\nASIDE AND THEN BE PRESUMED TO BE A SLAVE. THIS WOULI\nOF COURSE, OBVIATE ANY CONFUSION WITH RESPECT TO RUN¬\nAWAYS. For if persons of the skin of a Negro and th\nTEXTURE OF HAIR OF THE NegRO, ETCETERA, WERE FOUND,\nTHEY WERE PRESUMED TO BE SLAVES AND COULD BE RETURNEL\nTO THEIR MASTERS. ANOTHER CONSIDERATION WAS THE RE¬\nMARKABLE CAPACITY FOR ADJUSTMENT THAT THE NEGRO DEMO?\nSTRATED. . .BOTH IN EUROPE, AND PARTICULARLY IN THE Ne\nWorld, I have said, in writing, that this capacity,\nOR ONE MIGHT TERM IT A RESILIENCY UNDER ADVERSE CIR¬\nCUMSTANCES, EMERGES IN PART FROM THE KIND OF CULTURE\nOUT OF WHICH HE CAME...WHICH WAS, BY THE WAY, NOT A\nBACKWARD AND UNDERDEVELOPED CULTURE SO MUCH AS IT WAS\nA RATHER WELL DEVELOPED CULTURE IN WHICH LOYALTY AND\nOBEDIENCE AND ADJUSTMENT WERE IMPORTANT CONSIDERATIO\nSo THAT WHEN THE NEGRO CAME TO THE CARRIBBEAN, AND\nLATER TO MAINLAND AMERICA, HE REFLECTED THESE QUALI¬\nTIES OF ADJUSTMENT. AND ALTHOUGH IT WAS A THOROUGHL\nUNDESIRABLE AND REPREHENSIBLE STATE IN WHICH HE FOUNi\nHIMSELF...THAT CAN BE PROVED, OF COURSE, EASILY BY"
}