{
  "id": "d201-41",
  "text": "-6-\nRICHTER :\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nPROTESTING AGAINST THE INSTITUTION OF SLAVERY IN THE\nSEVENTEENTH CENTURY, NOT TOO LONG AFTER THE FIRST\nSLAVES HAD MADE THEIR APPEARANCE ON AMERICAN SOIL.\nIn 1776, in fact, the friends in Philadelphia finall\nDISOWNED MEMBERS WHO REFUSED TO EMANCIPATE THEIR\nslaves. However, the interesting point about this it\nNOT SO MUCH THAT MANY QUAKERS, WITH THEIR IDEALS, FEL\nAS THEY DID ABOUT SLAVERY AjM. ONG THEMSELVES, BUT THAT\nEVEN THEY TENDED TO TOLERATE AND PRACTICE SLAVERY FO^\nA HUNDRED YEARS OR MORE.\nAnd yet this was only one American religious group’s\nATTITUDE IN THE BEGINNl'NG.\n;E CAN SAVE FULLER DISCUSSION OF THE REALTIONSHIP OF\nRELIGION TO THE NEGRO FOR A FUTURE PROGRAM. At THIS\nPOINT I BELIEVE THAT IT SUFFICES TO NOTE THAT EVEN\nIN THIS EARLY PERIOD OF THE HISTORY OF THE NEGRO IN\nAmerica there were conflicting images of him, and th\nTHE ARGUMENT THAT CONVERSION WOULD NOT IN ANY WAY\nCHALLENGE SLAVE STATUS WAS ULTIMATELY PRETTY WIDELY\nACCEPTED.\nAnd it would seem that this conflict of images, in\nTHIS CASE RELIGIOUS IMAGES,HAS ENDURED EVEN TO THE\nPRESENT DAY. But WHAT OF OTHER IMAGE CONFLICTS H A V I f\nTHEIR ORIGIN IN COLONIAL AMERICA, LOU?\nThere were arguments from natural law which sometim:\nBECAME DECIDEDLY COMPLICATED. MANY PHILOSOPHICALLY\ninclined thinkers, both in Colonial America and in\nTHE NEW IND!PENDENT AMERICA, ARGUED THAT SLAVERY WAS\n?I NIT S NATURE FIT AND PROPER, JUST AND RIGHT*’ IF IT\nMADE FOR THE HAPPINESS OF THE ENTIRE COMMUNITY. THE\nTO BE SURE, THEY PROCEEDED TO ARGUE THAT ON THE WHOL/\nIT DID MAKE FOR HAPPINESS OF THE COMMUNITY. ANOTHEf\nLINE OF ARGUMENT WAS THAT \\1 WAS PERFECTLY RIGHT FOR\nGod to govern the universe in virtue of his perfect!\nAND THE IMPERFECTION OF MAN, JUST AS PARENTS HAD THE\nRIGHT TO GOVERN THEIR CHILDREN BECAUSE THEY ,?KNEW\nBETTER1* THAN THEIR CHILDREN. So SOME MEN COULD EXEP\nCISE AUTHORITY OVER OTHERS BECAUSE OF INEQUALITIES\nAMONG THEM. BECAUSE OF THE SUPERIOR WISDOM AND EX¬\nCELLENCE OF THE WHITE MAN, THEREFORE, HE VALIDLY HEL\nTHE AUTHORITY HE DID OVER THE NEGRO. Now, IT IS TRU\nTHAT SOME THINKERS ARGUED ABOUT NATURAL LAW, OR THE\nLAW OF NATURE, IN SUCH A way AS TO MAKE IT COME OUT\nAGAINST SLAVERY, BUT OTHER NATURAL LAW ARGUMENTS HAD\nTHE PRO-SLAVERY CHARACTER I’vE JUST INDICATED. ThE\nIMAGE OF THE NEGRO THAT EMERGES FROM THESE ARGUMEN\nINEVITABLY IS ONE THAT EMPHASIZES THAT HE IS LESS\nGIFTED THAN THE WHITE MAN, LESS FIT TO EXERCISE AU-"
}