{
  "id": "d201-43",
  "text": "IMAGE OF THE NEGRO AS A TREACHEROUS, FEARSOME INDI¬\nVIDUAL NO DOUBT HAD SOMETHING TO DO WITH BLOODY UP¬\nRISINGS AGAINST THE WHITES WHICH OCCURRED FROM TIME\nto time. The idea, or image, of the Negro as a petty\nTHIEF AGAIN STEMMED HISTORICALLY FROM THE SLAVE INSTs\nTUT I ON IN WHICH IT WAS, FOR EXAMPLE, MORE OR LESS EX¬\nPECTED THAT HOUSE SERVANTS WOULD FILCH FOOD AND GOODS\nFROM THE WHITE MAN’S LARDER. IN FACT, '7 TO T I N Gn , WHIG\nIS THE NAME FOR SUCH PETTY THIEVERY, IS STILL SOME¬\nTHING OF AN INSTITUTION IN THE SOUTH. I REMEMBER\nHEARING A STORY NOT LONG AGO OF A PRESENT DAY SOUTHER\nwhite woman who berated a servant for not stealing...\nAFTER ALL IT WAS EXPECTED OF HER, AND WHO DID SHE\nTHINK SHE WAS, ANYWAY? THE IMPLICATION IS THAT HON¬\nESTY IS A CHARACTERISTIC UNBECOMING TO NEGROES.\nRICHTER: In other words, it was made just about impossible for\nthe Negro to learn, and he was laughed at for his ig¬\nnorance. He was given no real motivation to work,\nAND WAS CALLED LAZY AND SHIFTLESS FOR NOT PERFORMING\nwell. Genuine marriage, with the safeguards and gua^\nANTEES THAT GO ALONG ITH IT, WAS PLACED BEYOND HIS\nREACH, AND THEN HE WA8 CRITICIZED FOR TRYING NOT TO\nv’CARE'’TOO MUCH, AND SO ON.\nSCHNEIDER: Yes. And the general point here is extremely import\nant. v'/e see the Negro kept illiterate under slavery\nAND THEN MOCKED FOR HIS IGNORANCE. ' E SEE THAT WHITS\nHAD SOME EXPECTATION THAT THE NEGRO WOULD LIVE UP TO\nCERTAIN STANDARDS OF BEHAVIOR IN SEXUAL AND MARITAL\nMATTERS, AND THEN THOSE SAME WHITES EFFECTIVELY MADE\nIT DIFFICULT OR IMPOSSIBLE FOR HIM TO DO SO 3Y GIVIN\nMINIMUM RECOGNITION TO HIS MARRIAGE BONDS AND FAMILY\nLIFE. ..TURNING, AFTER THAT, UPON HIM AND CALLING HIM\nIMMORAL AND CALLOUS. TlME AND AGAIN THE NEGRO WAS\nVIRTUALLY FORCED INTO CERTAIN MODES OF BEHAVIOR THAT\nTHE WHITES COULD EASILY CRITICIZE...BUT BEHAVIOR THA\nWAS ONLY TO BE EXPECTED UNDER THE CIRCUMSTANCES. YE\nHAVE, IN ALL THIS, CERTAINLY, THE FAMILIAR TACTIC OF\nkicking for bleeding. The Negro, having his veins\nOPENED, BLEEDS,. .WHEREUPON THE WHITE WHO OPENED THEM\nPUNISHES HIM FURTHER... iE CAN ALSO CERTAINLY SEE THA\nfavorable images of the Negro were not encouraged by\nWHAT HAS BEEN REFERRED TO AS THE '’PECULIAR INSTITUTI\nRICHTER: 'ell...given this set of images it would seem that\nTHE JUSTIFICATION OF SLAVERY WOULD NOT HAVE BEEN TOO\nDIFFICULT FOR THOSE WHO WISHED TO JUSTIFY IT. CoULD\nWE GO ON FROM HERE, LOU, AND FOLLOW THE DEVELOPMENT\nOF THE SOUTHERN VIEW OF SLAVERY AND ITS IMPACT ON TH\nIMAGE OF THE NEGRO?\nSCHNEIDER: In general, of course, southern opinion was in favor"
}