{
  "id": "d201-45",
  "text": "-10-\nR I CHTER:\nSCHNEIDER:\nRICHTER:\nAnd while these ideas were building in the South,\nTHE ABOLITIONISTS IN THE NORTH WERE BUILDING UP A\nCOUNTER PRESSURE BASED ON OPPOSING POINTS OF VIEW?\nNot just in North. For example, Hinton Rowan Helper,\na South Carolinian, launched an unreserved attack on\nthe Institution of slavery in his book The Impending\nCrisis of the South published in 1857. Helper is\nWELL KNOWN, AT LEAST AMONG SCHOLARS. WHILE HIS BOOK\nWON HIM PROFOUND ANTAGONISM IN THE SOUTH, IT HAD A\nDECIDED IMPACT ON THE NORTH. HELPER ATTEMPTED TO\nDEMONSTRATE THE GREAT SUPERIORITY OF FREE OVER SLAVE\nINSTITUTIONS IN A WIDE-RANGING ARGUMENT. IN MANY WAY\nThe Impending Crisis of the South still makes a power\nFUL IMPACT, EVEN ON THE READER OF TODAY, A HUNDRED\nYEARS AFTER IT WAS PUBLISHED. ONE OF THE OUTSTANDING\nFEATURES OF THE BOOK WAS THE UTTERLY UNCOMPROMISING\nATTITUDE TOWARD SLAVERY THAT HELPER SHOWED. He WAS\nALSO CONCERNED WITH THE N0N-SLA VEH0LDI NG WHITES WHO\nWERE IN THE GREAT MAJORITY IN THE SOUTH BEFORE THE\nCivil Var...only about a fourth, at the most, of sout\nERN WHITES WERE SLA VEH0LDERS. . .AND EVEN A MUCH SMALLE\nPROPORTION OWNED MORE THAN A FEW SLAVES, HELPER WAS\nBITTER AGAINST THE SL^VE-HOLDERS WHO, HE FELT, /> D\nDEGRADED THE NON-SLAVEHOLDING WHITES THROUGH THE\nWORKINGS OF SLAVERY. To QUOTE HIM, \"THE. LORDS OF THE\nLash are not only absolute masters of the blacks, whc\nARE BOUGHT AND SOLD, AND DRIVEN ABOUT LIKE SO MANY\nCATTLE, BUT THEY ARE ALSO THE OR,, CLES AND ARBITERS 0 r\nALL NON-SLAVEHOLDING WHITES, WHOSE FREEDOM IS MERELY\nNOMINAL, AND WHOSE UNPARALLELED ILLITERACY AND DE¬\nGRADATION IS PURPOSELY AND FIENDISHLY PER Pt T U A T E D . I? .\nBut IN ORDER TO HEAR THE REAL ELOQUENCE WITH WHICH\nHelper attacked slavery. Why don’t you read this\nPASSAGE FROM HIS BOOK, /ALT?\nAll right, let’s. \"In our opinion ...the causes which\nHAVE IMPEDED THE PROGRESS AND PROSPERITY OF THE SOUTH\nWHICH HAVE DWINDLED OUR COMMERCE, AND OTHER SIMILAR\nPURSUITS, INTO THE MOST CONTEMPTIBLE INSI GNI FI GANCE ;\nSUNK A LARGE MAJORITY OF OUR PEOPLE IN CALLING POVER'\nAND IGNORANCE, RENDERED A SMALL MINORITY CONCEITED\nAND TYRANNICAL, AND DRIVEN THE REST AWAY FROM THEIR\nHOMES; ENTAILED UPON US A HUMILIATING DEPENDENCE ON\nthe Free States; disgraced us in the recesses of our\nown SOULS, AND BROUGHT US UNDER REPROACH IN THE EYES\nOF ALL CIVILIZED AND ENLIGHTENED NATIONS - MAY ALL\nBE TRACED TO ONE COMMON SOURCE, AND THERE FIND SOLU¬\nTION IN THE MOST HATEFUL AND WORD, THAT WAS EVER\nINCORPORATED INTO THE VOCABULARY OF HUMAN ECONOMY -\n’’Slavery’, That is pretty strong stuff."
}