{
  "id": "d201-51",
  "text": "-5-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nIs THERE ANY EVIDENCE THAT WOULD INDICATE THAT THE\nBEHAVIOR OF THE NEWLY FREED SLAVES R E —ENFORCED THE\nTYPE OF THINKING WHICH WE’VE BEEN REVIEWING'7?\n.'ITHOUT DOUBT, AFTER THE ClVIL ?AR THERE WERE NEGROE\nWHO WERE AT TIMES CONSPICUOUSLY DISORDERLY, ENGAGED\nIN CRIMINAL BEHAVIOR, WERE KNOWN TO BE IMPROVIDENT,\nCOULD SHOW OBSTINACY IN REFUSING TO WORK, WERE SPEND\nTHRIFT, AND COULD GIVE THEMSELVES AIRS THAT WOULD\nHAVE BEEN RIDICULOUS IN ANYONE. BEHAVIOR OF THIS\nKIND RE-ENFORCED NEGATIVE IMAGES OF THE NEGRO...EVEN\nTHOUGH VHITES COULD AND DID ALSO WITNESS VERY DIFF¬\nERENT KINDS OF BEHAVIOR. ..BEHAVIOR WHICH HARDLY ANYO\nCOULD CRITICIZE.\nVHAT WE MIGHT CALL ,?SELECTIVE P E R C E P T I 0 N i? . . . S E E I N G\nWHAT WE WANT AND NEED TO SEE, OVERLOOKING OTHER THIN\nThis would, no doubt, have helped to eliminate from\nTHE PICTURE, THE, SHALL WE SAY, MORE COMMENDABLE\nKINDS OF BEHA V I OR.\nAnd I would add that Negroes, in any case, were fre¬\nquently ENOUGH MISLED BY UNSCRUPULOUS WHITES, AND TH\nwhite Southerners h\\d, under the slave system, scarc\nly prepared Negroes for the responsibilities of\nfreedom. Moreover, not many thought to check the\nways of Negroes against the ways say, of VhLtetssoff\nnearly similar levels of education and similar back¬\nground; and the South had a heritage of thought\nABOUT THE NEGRO THAT MADE IT ALL TOO READY NOT TO\nGIVE HIM THE BENEFIT OF ANY DOUBTS WHEN IT CAME TO\nASSESSING HIS MORAL WORTH OR HIS ABILITY. ThERE WAS\nAN ANCIENT AND POWERFUL INCLINATION TO ATTRIBUTE\nSHORTCOMINGS, NOT TO CIRCUMSTANCES, BUT TO NATIVE\nVICIOUSNESS OR INCAPACITY.\nThis would seem to indicate that the Jhite Southerne\nNEVER GAVE UP THE BELIEFS ABOUT THE NEGRO, THE IMAGE\nOF HIM, HELD PRIOR TO EMANCIPATION, AND THAT HE WOUL\nIN TIME TRY TO REPLACE SLAVERY WITH SOME OTHER FORM\nOF INSTITUTIONALIZED DISCRIMINATION.\nAnd that is exactly what happened. Vi thin about a\nDOZEN YEARS OF THE END OF RECONSTRUCTION IN 1877,\nthe South had begun to launch itself on a Jim Crow\nPROGRAM .\nThis brings us, then, to the second period we want\nTO DISCUSS TODAY - THE PERIOD BETWEEN RECONSTRUCTION\nAND THE TURN OF THE CENTURY.THE PERIOD WHICH\nProfessor Rayford Logan described as the Nadir....\nTHE LOW POINT, IN HIS BOOK, ThE NEGRO IN AMERICAN L'\nand Thought. Professor Logan speaks about the reacts\nOF HIMSELF AND HIS STUDENTS TO THE PORTRAYALS OF THE\nNegro they found in leading national magazines in\nTHE POST RECONSTRUCTION PERIOD."
}