{
  "id": "d201-55",
  "text": "RICHTER:\nSCHNEIDER:\nDEFINITE AFFINITIES WITH NAZI RACIALIST THEORIES. But\nNOW LET ME GIVE ANOTHER EXAMPLE OF A PIECE OF WORK\nPURPORTING TO SHOW NEGRO I NFER I 0R ITY. . . IN THIS CASE\nUSING MATERIALS FROM 'iORLD / AR ONE ARMY INTELLIGENCE\ntests. The work I have in mind is by Carl C. Brigham,\nAND IS ENTITLED, A STUDY OF AMERICAN INTELLIGENCE. It\nAPPEARED A FEW YEARS AFTER ORLD JAR ONE. The OPINION\nthat Brigham held of the Negro is suggested by this\nSENTENCE, WHICH I PICK OUT FROM HIS CONCLUDING STATE¬\nMENTS, -,,WE MUST FACE A POSSIBILITY OF RACIAL ADMIXTURE,\nHARE, that IS INFINITELY WORSE THAN THAT FACED BY ANY\nEuropean country today, for we are incorporating the\nNegro into our racial stock, hile all of Europe is\ncomparatively free of this taint1’. It’s only fair for\nME TO ADD THAT BRIGHAM COMPLETELY REPUDIATED HIS STUDY\nSome years later:. Nevertheless, .works like those\nBY GRANT AND BRIGHAM HAD A CERTAIN DEFINITE VOGUE\nAROUND THE TIME OF VoRLD VAR ONE AND ITS IMMEDIATE\nAFTERMATH, AND UNQUESTIONABLY HELPED TO SHAPE THE IMAG\nof the Negro.\nThis certainly gives us an idea of racist theory of\nTHIS PERIOD UP TO THE END OF / ORLD VAR 0NE...AND EVEN\nTO A FEW YEARS BEYOND THAT. But WHAT EVENTS OF THIS\nPERIOD COULD WE DESCRIBE WHICH WOULD BEAR ON THE IMAGE\nof the Negro?\nIt’s a very eventful period, as we all know. Precisely\nWHAT EVENTS TO CHOOSE AS BEARING ON IMAGES OF THE\nNegro I’m not entirely sure. Let me take a stab at\nit however. Historians emphasize the bloody aftermath\nof ‘V orld vVar One for the Negroes. The year 1919 is\nESPECIALLY HIGHLIGHTED. It WAS APPARENTLY QUITE A\nGRUESOME YEAR, ONE IN WHICH SOMETHING ON THE ORDER OF\n25 RACE RIOTS TOOK PLACE. THERE WERE RIOTS IN WASHING¬\nTON, D.C.; in Chicago, Illinois; in Omaha, Nebraska; i\nLongview, Texas; in Knoxville, Tennessee; in Elaine,’\nArkansas; and in other places. One historian remarks\n'’from June, 1919, to the end of the year, racial\nFRICTION WAS MORE VIRULENT THAN IT HAD BEEN AT ANY\nTIME SINCE RECONSTRUCTION'’. JUST WHAT THE CAUSES OF\nTHIS MAY HAVE BEEN. ...OF THESE RACE RIOTS IN THIS\nTERRIBLE YEAR OF 1919, IT’S CERTAINLY NOT ENTIRELY\nEASY TO SAY. PERHAPS NEGROES SERVED AS TARGETS OF\nTHE ACCUMULATED DISCOMFORT, WORRY, AND ANXIETY THAT\nHAD BEEN ABUILDING IN NUMEROUS WHITES BECAUSE OF THE\nWAR ITSELF. BUT IT IS THE CASE ALSO THAT VoRLD A R\nOne had for the first time, brought Negroes to the\nNorth as well as to urban areas in the South in Large\nnumbers, Negroes were making, one might say, their\nfirst real threat OF ENTIRE1 into modern industrial\nenterprise, and into the great cities that are the"
}