{
  "id": "d201-6",
  "text": "-7-\nTHE ISSUE OF BATTLE? EVEN ASSUMING THAT NEGROES WOULD\nAND COULD SUMMON THE UNITY AND THE AGRESSIVE RESOLUTION\nTO CARRY ON WAR AGAINST WHITE AMERICANS, THE PROSPECTS\nOF SUCCESS WOULD EVIDENTLY NOT BE LARGE. MOREOVER, WHY\nLUMP TOGETHER WITH ”THE ENEMY” MILLIONS OF WHITES WHO\nWOULD BE SUBSTANTIALLY IN SYMPATHY WITH THE NEGROES,AND\nMILLIONS OF OTHERS WHO WOULD BE INTERNALLY TORN—HALF\nDESIROUS OF MAKING LARGE CONCESSIONS TO THE NEGRO PEOPLE\nBut shall the Negro really offer no resistance? Increas¬\ningly, Negroes have small regard for the subservient or\nSELF-SUPPRESSING, OR SELF-REPRESSING NEGRO WHO IS CALLED\nan ”Uncle Tom”. There is an apprec iable determination\namong Negroes in the United States today to fight, to\nRESIST, TO WIN THE BATTLES OF COURT, SCHOOL, JOB, AND\nHOUSING.\nRICHTER: Martin Luther King, Jr. became famous almost overnight\nBECAUSE OF HIS ATTEMPTED STRATEGIC COMBINA-TION OF RESIS¬\nTANCE AND NON-VIOLENCE. AND, THIS IS INTERESTING IN\nTHE LIGHT OF WHAT YOU’VE JUST SAID, LOU, REVEREND KING\nIS AS FIRM ON THE POINT OF RESISTANCE AS HE IS ON NoN-\nV I OLENCE.\nSCHNEIDER: Moreover, his Ghandian tactics unquestionably helped him\nWIN A NOTABLE VICTORY IN MONTGOMERY. HOWEVER, THE STAB¬\nILITY AND EFFECTIVENESS OF THE COMBINATION OF RESISTANCE\nAND NON-VIOLENCE ARE STILL SOMEWHAT PROBLEMATIC. NegROE;\nIN OTHER PARTS OF THE UNITED STATES MAY HAVE TO MAKE DO\nWITH LESS INSPIRING LEADERSHIP AND MAY HAVE TO FACE LESS\nCLEARCUT ISSUES. ..AND LESS FORTUNATE COMBINATIONS OF\nCIRCUMSTANCES. FUTURE EFFORTS TO COMBINE RESISTANCE WIT1\nNON-VIOLENCE MAY MEET WITH LESS SUCCESS. A DELICATE\nBALANCE IS BEING DEALT WITH HERE—WITH THE BEST WILL IN\nTHE WORLD, VIOLENCE MAY STILL ERUPT WHEN LEADERS ARE\nDOING ALL THAT THEY CAN TO PREVENT IT. THIS, AS Dr.\nKing recognizes, can re-create old vicious circles on\nTHE PRINCIPLE, ” A L L THEY THAT TAKE THE SWORD SHALL PERISH\nBY THE SWORD”, AS VIOLENCE IS AGAIN COUNTERED BY VIOLENCE\nOn the other hand, this delicate balance may tip the\nOTHER WAY AND, IN THEIR FERVOR FOR NON-VIOLENCE, NEGROES\nMIGHT WELL FALL INTO NON-RESISTANCE—WHICH IN TURN COULD\nMEAN INEFFECTIVENESS OF THEIR PROTESTS OR CONTEMPT ON\nTHE PART OF THE WHITES, OR EVEN THE EVOCATION OF A CER¬\nTAIN SADISM ON THE PART OF WHITE. WE ARGUE SOMEWHAT AB¬\nSTRACTLY HERE, ADMITTEDLY, BUT IT SHOULD BE CLEAR ENOUGH\nTHAT HERE, TOO, IN THE DISCUSSION OF AN OSTENSIBLY SIMPLr\nQUESTION, THE NEGRO’S RESISTANCE TO BEING TAGGED AS SE¬\nCOND-CLASS CITIZENS, WE HAVE COMPLEXITIES THAT REQUIRE\nOUR REALLY CAREFUL CONSIDERATION."
}