{
  "id": "d201-62",
  "text": "-3-\nMEMORY OF THE PERSON OF COLOR AS A HUMAN BEING OF\nHIGH STATUS AND ATTAINMENT, RATHER THAN AS A SO-\nCALLED SAVAGE, REMAINED WITH THE PORTUGUESE.\nRICHTER:\n.'ELL, THIS IN DIRECT CONTRAST TO THE ASSUMPTION OF\nthe English speaking population of North America that\nCOLOR IMPLIES INFERIORITY.\nSCHNEIDER:\nPrecisely. It’s worth adding, also, that Portugal\nWAS A SMALL COUNTRY WHICH COULD NOT SEND MANY PEOPLE\nOF ITS OWN TO THE NEW COLONY OF BRAZIL. THOSE WHO DIO\nCOME INTERMINGLED FREELY WITH PERSONS OF COLOR....\nnamely Negroes and Indians. Also Catholic priests\nENCOURAGED MARRIAGE WHERE INTERRACIAL UNIONS PREVAILED\nV|TH THE LACK OF ANTIPATHY TO PEOPLE OF COLOR AND THE\nEARLY PREVALENCE OF UNIONS WITH THEM, THE GROUND WAS\nLAID FOR A DISTINCTIVELY DIFFERENT VIEW OF THE NEGRO\nFROM THAT PREVAILING IN UNITED STATES\nRICHTER:\nBut, do you mean to say that no color distinctions\nexist today in Brazil?\nSCHNEIDER:\nBrazilians do use terms referring to color such as\nB ranco, Pardo, and Preto. Branco, of course, meaning\n’’white1’, and Pardo and Preto being roughly equivalent\nto our Mulatto and dark. But we know from research\nDONE BY SUCH MEN AS UoNALD PlERSON THAT WHEN BraZILIA'\nsay Branco or white, they intend such a term to refer\nprimarily to the color appearance of a person. In\nother words, no fine, supposedly racial, D1 SCRIM 1 NAT 1\nOF ’’negro” AS WE INTEND IT, IS INTEN&&DBY THEM.\nRICHTER:\nYou MEAN THAT IF A PERSON LOOKS WHITE, HE IS WHITE IN\nBRAZ1 L... REGARD LESS OF HIS ANCESTRY?\nSCHNEIDER:\nYes, that’s the point exactly. Now, of course ,cgcots\nDOES HAVE -'AN ASSOCIATION WITH STATUS O’R INCOME IN' ,\nB.razil.. Historically, the Negro :in Brazil, as. L.i;sewhe\nSUFFERED UNDER CERTAIN DISADVANTAGES, SOME OF WHICH\nPREVAIL UNTIL THE PRESENT DAY. t>UT THE PECULIAR\nSITUATION OF THE NEGRO IN BRAZIL TODAY, DESPITE\nVARIATIONS, IS INDICATED BY THE SAYING, ”A RICH NEGRO\nIS A WHITE MAN AND A POOR WHITE MAN IS A NEGRO'’.\nRICHTER:\nVELL, THUS, IT WOULD SEEM THAT THESE TERMS NO LONGER\nIMPLY RACE IN BRAZIL, BUT RATHER THE SOCIAL ECONOMIC\nLEVEL OR SOCIAL STRATIFICATION.\nSCHNEIDER:\nThis is the case. And now we come a little closer to\nTHE QUESTION THAT WAS RAISED A WHILE AGO ABOUT THE\nDEFINITION OF THE TERM j’NEGRO'?. FOR THE BRAZILIANS,"
}