{
  "id": "d201-66",
  "text": "BURDICK:\nRICHTER:\nBURDICK:\n-7-\nSO FORTH - MIGHT RESULT IN DIFFERENCES.\nyes. Natural selection acted in different ways in\nMongolia than it did in the tropical forests of Afri:-\nFOR INSTANCE, AND WAS RESPONSIBLE FOR SELECTING DIFF¬\nERENT GENOTYPES - THAT IS DIFFERENT BIOTYPES - IN\nMongolia than it selected in Africa. So at the time\nI THINK THESE MAY HAVE BEEN RELATIVELY CLEARLY DIS¬\nTINCTLY DIFFERENT RACIAL GROUPS. BEYOND THIS, HOWEVE\nIF WE TAKE THE PERIOD FROM, SAY, 15,000 YEARS BEFORE\nTHE BIRTH OF CHRIST UNTIL NOW, THE PREDOMINANT FORCE\nIN HUMAN DEVELOPMENT AND EVOLUTION HAS BEEN A MIXING\nOF THESE PREVIOUSLY ISOLATED GEOGRAPHICAL GROUPS...\nRACIAL MIXING, IF YOU WISH. So THAT AT THE PRESENT\nTIME IT?S MUCH MORE DIFFICULT THAN IT PROBABLY WAS AT\nSOME DISTANT PAST TIME TO DISTINGUISH iVIOGOLOIDS FROM\nCaucasoids, absolutely, or to distinguish Negroids\nFROM ALL OTHER GROUPS.\nYOU MEAN TH.T THERE HAS BEEN A SHIFTING OF POPULATIO;\nHERE AND THERE, AND INTERCOURSE AMONG THESE GROUPS\nWHICH HAS LED TO MATING, MIXED OFFSPRING, AND SO\nFORTH. And that, in other words, you would go as fat\nAS TO SAY THERE IS NO SUCH THING AS PURE RACIAL\nSTRAIN ANY MORE?\nYes, I would. The forces of migration and mixing of\nRACES GO ON CONCOMITANTLY WITH! THE FORCES OF DIFFER¬\nENTIATION AND SEPARATION OF RA.CES. ThERE ARE BOTH\nINFLUENCES EXISTING AT THE PRESENT AND ALWAYS HAVE\nEXISTED. For instance, you can see the influence\nin Scandinavians - of the Mongoloid influence. Ther:\nis a characteristic of the Mongolians that almost\nDISTINGUISHES THEM FROM ALL OTHERS TO A LOT OF PEOPL.\nANYWAY - THIS IS THE MONGOLIAN FOLD OF THE EYELID -\nThat is where the eyelid falls and touches the eyela?\nThere’s a fold in the eyelid. Well, the genetic sys¬\ntem THAT CONTROLS THIS ALSO EXISTS AT THE PRESENT\ntime in Scandinavians - approximately 20-25$ of all\nScandinavians have this Mongoloid fold. Other groups\nin Europe also have it to a lesser extent. THey hav\nNONE OF THE OTHER ATTUIBUTES OF MONGOLOID GROUP, BUT\nTHEY DO HAVE THIS - ATTESTING TO SOME ADMIXTURE OF\nGENES FROM THE MONGOLIAN GROUP. VE CAN SEE INSTANCES\nall over Europe and throughout the rest of the world\nFor instance, for the Negro it has been said fatrly\nRELIABLE STATED THAT FEWER THAN 10$ OF THE AMERICAN\nNegroes can trace their ancestry exclusively to Afri\n8ources. Contemporary American Negroes are the resu\nOF A CERTAIN AMOUNT OF WHITE AND INDIAN, AND OTHER\nMIXTURES."
}