{
  "id": "d201-7",
  "text": "-8-\nRICHTER:\nFRANKLIN :\nRICHTER:\nMCGILL:\nRICHTER:\nNIXON:\nAnd so we come to the understanding that what, on the\nSURFACE SEEMS LIKE A VERY SIMPLE THING..A GROUP OF CITI¬\nZENS DESIRING THEIR RIGHTS UNDER THE LAWS OF DEMOCRACY..\nIS IN REALITY A MAZE OF C0MPLI CATI 0NS . . COMPLI CATI 0NS\nBASED ON THE TURNINGS AND TWISTINGS OF THE HUMAN MIND ANL\nON THE CURIOUS WAYS OF HUMAN SOCIAL RELATI 0NSH I PS. . . . . THt\nMOST COMPLEX AND LEAST UNDERSTOOD FACETS OF HUMAN EXIST¬\nENCE. In the weeks to come we’ll be TALKING about the\nQUESTIONS RAISED BY Dr . ScHNE'DER. We SHALL TRY TO COME\nTO A FULLER UNDERSTANDING OF THE NATURE OF RACE RELATION;\nin the United States..of the causal factors in the Negro7\nPLIGHT..OF THE NATURE AND ESSENCE OF PREJUDICE. To HELP\nIN DOING THIS, WE WILL TURN TO THE RECORDED INTERVIEWS\nMENTIONED EARLIER IN THIS PROGRAM. FOR AN UNDERSTANDING\nOF THE BACKGROUND OF TODAY’S RELATIONSHIPS BETWEEN NEGRO\nAND WHITE WE WILL TURN TO SOME OF THE NATION’S WELL KNOWh\nhistorians. For example, to Or. John Hope Franklin,\nChairman of the Department of History, Brooklyn College:\nI THINK IT OUGHT TO BE REMEMBERED THAT THE FIRST NEGROES\n'WHO CAME TO ENGLISH AMERICA WERE NOT SLAVES, BUT WERE IN¬\nDENTURED SERVANTS. IT WAS THE EXPERIENCE THAT ENGLISH\nAmerica had with Negroes that convinced the English Amer\nICANS THAT NEGROES WERE QUITE SUITABLE FOR ENSLAVEMENT.\nOne factor, of course, was that of color. The fact that\nthe Negro was quite different from the white man in color\nAND PHYSIOGNOMY GENERALLY, MA.de IT POSSIBLE FOR HIM TO B!\nSET ASIDE AND TO BE PRESUMED TO BE A SLAVE. THIS WOULD\nOF COURSE, OBVIATE ANY CONFUSION WITH RESPECT TO RUNAWAY\nF$K IF PERSONS OF THE SKIN OF THE NEGRO AND THE TEXTURE\nHAIR OF THE N EGRO, ETCETERA, WERE FOUND THEY WERE PRE¬\nSUMED TO BE SLAVES AND COULD BE RETURNED TO THEIR MASTER\nTo FIND OUT HOW THE NEGRO IN THE SOUTH FARES TODAY WE’LL\nTURN TO SUCH PEOPLE AS THE EDITOR OF THE ATLANTA CONSTI¬\nTUTION, Mr. Ralph McGill:\nIn the North, the law doesn’t discriminate against him,\nBUT I THINK THAT HIS POSITION AS A HUMAN BEING IS PERHAP\nNOT AS GOOD THERE AS IT IS HERE...IN MANY RESPECTS, AT\nLEAST. 3UT THE GREAT ADVANTAGE HE HAS IN THE NoRTH IS\nTHAT UNDER THE LAW, AT LEAST, HE IS AS MUCH A CITIZEN AS\nanyone else. In the deep Southhe is not. He is second-\nclass CITIZEN.\nTo Mr. E.0. Nixon, Negro leader in Montgomery, Alabama:\nThe only way a Negro can get a job around the State\nCapitol, he got to commit a crime, be convicted, put on\nprisoner garbs, and be sent up to the Capitol as a trust\nNot a single Negro has anything to do with nothin’ goin’\non in the Capitol, not even as a janitor."
}