{
  "id": "d201-78",
  "text": "-7-\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nI THINK WE CAN /sPD. , AT LEAST, ONE MORE T H I N G . . . . N AM E L Y ,\nTHAT THE WHITES SIMPLY, IN MANY CASES, WANTED TO MAIN¬\nTAIN FEELINGS OF SUPERIORITY OVER THE NEGROES AND\nTHEREBY HAD A KIND OF VESTED INTEREST IN KEEPING THEM\nILLITERATE AND IGNORANT SO THAT THE WHITE EGO COULD BE\nENHANCED AND THE WHITE SOUTHERNER CONTINUE TO BE AMUSED\nat Negroes who mangled the English language abd were\nABYSMALLY IGNORANT OF RUDIMENTARY FACTS.\nThat seems to give us a fairly good outline of motiva¬\ntions. Aside from motivations we*ve mentioned the laws\nPerhaps it wouldn’t hurt to be a bit more detailed\nABOUT THEM.\nFrom a standard source on the education of the Negro\nin America I take a few pertinent facts. In Georgia,\nWHICH WE’VE ALREADY MENTIONED, A LAW OF 1770 PROHIBITED\nTEACHING THE SLAVES READING AND WRITING UNDER A PENALTY\nOF TWENTY POUNDS STERLING FOR VIOLATION. TWO GENERA¬\nTIONS LATER, ANOTHER LAW OF THE SAME STATE PROVIDED A\nFINE OR A WHIPPING FOR TEACHING SLAVES READING OR\nwriting; and in 1853, a third law repeated the stipu¬\nlations OF THE PREVIOUS ONES. Th£ CoOE OF VIRGINIA,\nIN 1849, MADE EVERY GATHERING OF NEGROES WITH THE\nOBJECT OF INSTRUCTION IN READING OR WRITING AN UNLAWFUL\nASSEMBLY. PUNISHMENT IN CASE OF VIOLATIONS WAS WHIP¬\nPING for Negroes, and a jail sentence and a fine of\nFIVE HUNDRED DOLLARS FOR WHITES, IN NORTH CAROLINA\nTHERE WERE SIMILAR PROVISIONS FOR WHITE AND NEGROES\nWHO MIGHT COLLABORATE IN SEEKING TO MAKE THE NEGRO\nLITERATE. SOUTH CAROLINA HAD A LAW ON THE MATTER PASSF\nin 1740: Fines, imprisonment and whipping were the\nPUNISHMENTS FOR ACTIVITY THAT ASSEMBLED SLAVES, FREE\nNegroes, and persons of color, for the object of\nINSTRUCTION. ”lN A CONFINED OR SECRET PLACE.” 3 | M I LA\nLAWS WERE ON THE BOOKS OF THE STATES OF LOUISIANA AND\nAlabama. Horace iviann Bond makes the inevitable comment\nTHAT ”It IS CLEAR THAT THESE laws WERE INTENDED TO\nKEEP THE SOCIAL ORDER IN A STATE OF REST,” AND HE ADDS\n’’Jefferson Davis reflected clearly the attitude of the\nante-bellum period toward the education of Negroes\nwhen he said that there was no objection to teaching\nTHEM ANYTHING THAT DID NOT COME IN CONFLICT WITH THE\nCHERISHED INSTITUTIONS OF THE OLD SOUTH.”\nSo WE CAN SAY THAT THE SOUTH WAS ’’BUYING” SOME OF ITS\nOWN LATER PROBLEMS. HAD THERE BEEN LESS ILLITERACY\namong Negroes, the Reconstruction Period might have\nBEEN A LOT EASIER IN A NUMBER OF WAYS FOR BOTH WHITES\nand Negroes. A bit ironic, isn’t it?\nYes, and, once the Civil War was over, the education of\nthe Negro even when it was forthrightly accepted as\ndesirable in principle, presented numerous problems."
}