{
  "id": "d201-80",
  "text": "-9-\nRICHTER:\nSCHNEIDER:\nPROBLEM THAT WAS JUST THE OBVERSE OF Du Bois’s. I\nTHINK THE MATTER IS MORE INTELLIGENTLY DISCUSSED IN\nTERMS OF EDUCATING \" WH 0 WHAT PERSON. THERE ARE\nsome Negroes who can make their most creative contri¬\nbution TO SOCIETY BY VOCATIONAL EDUCATION-BECOMING\nSKILLED IN CERTAIN TRADES. THERE ARE OTHER WHO CAN\nMAKE A MORE CONSTRUCTIVE CONTRIBUTION TO SOCIETY BY TH\nHIGHEST TYPE OF ACADEMIC EDUCATION. I DON’T THINK\nTHAT THIS IS AN EI THER-OR , AND TO DISCUSS IT IN TERMS\n^EITHER-OR*’ FOR NEGROES IN GENERAL IS TO FALL INTO THE\nTRAP OF THINKING OF INDIVIDUALS IN TERMS OF THEIR RACE\nRather than in terms of each individual’s own parti¬\ncular TALENT OR ABILITY OR INTELLIGENCE LEVEL. Now,\nIT MAY BE THAT THIS IS A LITTLE UNFAIR ABOUT Du BoiS.\nProbably Du Do is was not talking about Negroes in\nGENERAL. He WAS TALKING ABOUT WHAT HE CALLED THE\nTALENTED tenth. He has been criticezed in terms of\nSNOBBERY. If I WERE TO BE REQUIRED TO TAKE MY CHOICE,\nI WOULD CERTAINLY IDENTIFY MYSELF MORE WITH THE Du B()i\nTYPE OF THINKING THAN THE DOOKER T. WASHINGTON TYPE\nOF THINKING WHICH I THOUGHT WAS A SERIOUS SOCIAL\nMISTAKE, BECAUSE HE MADE SEGREGATION PALATABLE AND\nACCEPTABLE. He SALVED THE CONSCIENCE OF THE WHITE\nSouth. *nd my personal feeling is that the Du 3ois...\nthe Booker T. Washington type of thinking set back the\nprogress of the Negro considerably. And we’re just\nNOW ATTEMPTING TOUNDO THE HARM WHICH I 3ELIEVE HIS TYP\nOF THINKING AND THOSE WHO THINK LIKE HIM HAVE DONE.\nThat was Dr. Kenneth Clark, psychologist at City C0lle\nof New york. 'We’ve covered a certain number of thing\nREGARDING THE HISTORY OF NEGRO EDUCATION IN AMERICA,\nAND WE’VE BRIEFLY REVIEWED SOME PERTINENT ATTITUDES IN\nTHE FIELD. 'VE HAVEN’T BEEN EXHAUSTIVE, BECAUSE, WELL,\nTHAT’S ALWAYS IMPOSSIBLE. HOWEVER, LoU, AREN’T SOME\nOF THE SOCIAL PROCESSES TO WHICH WE’VE CALLED ATTENTIC\nBEFORE HEAVILY INVOLVED IN THIS FIELD OF EDUCATION?\nI WOULD SURELY SAY SO, WALT. By WAY OF EXAMPLE, WE’VE\nSPODEN ABOUT THE SELF-FULFILLING PROPHECY, AND THIS\nWORKS IN THE FIELD OF EDUCATION AS IN OTHERS. G|VE\nthe Negro an inferior education, such as he still so\nFREQUENTLY GETS, AND OF COURSE, YOU GET A NOT PARTI¬\nCULARLY well-educated man. The whole process often\nSHAPES UP IN THIS WAY: YOU MAY START WITH THE PRECISE\nTHAT THE NEGRO CAN’T DO MUCH OF ANYTHING REQUIRING REA\nABILITY. Then you give him a low level education that\nYOU FEEL CORRESPONDS WITH HIS LaCK OF GENUINE TALENT.\nHe ends up a poorly educated man who in fact does not\nshow high level attainments, and then you say, ’’You se"
}