{
  "id": "d201-92",
  "text": "-10-\nAMONG CRAFTSMEN, AND FOREMEN. 3uT WHEN YOU COME TO\nTHE BUSINESS OF BEING A SERVICE WORKER OR A LABORER_\nTHERE, OF COURSE, THE NEGRO IS VERY ’WELL’ REPRESENTED\nHe still has considerable GROUNDS TO COVER BEFORE\nEQUALITY WITH ViHITES IS ACHIEVED. AND EDUCATION IS A\nTREMENDOUSLY POTENT ELEMENT IN ALL THESE THINGS,\nRICHTER:\n*T1S PRETTY CLEAR, THEREFORE, THAT THE FIGHT FOR AN\nEDUCATION AS GOOD AS THAT OBTAINED BY VhI TES IS 1NDE —\nSPENSIBLE STRATEGY FOR THE NEGRO, \\‘Je MIGHT JUST END\nON THE NOTE THAT THIS IS AN EVIDENT ENOUGH THING, BUT\nAN EXTREMELY IMPORTANT ONE. In OUR PROGRAM TODAY, WE\nHEARD REPORTS ON THE STATE OF NEGRO EDUCATION | N * THE\nSouth before and after the Supreme Court decision from\nJudge J. Waites Waring, retired Federal District Judge\nfrom South Carolina, and Mr. Frederick D. Patterson,\nPresident of the Phelps-Stodes Fund, Miss Pauli Murray\na lawyer, author, and expert on legislation affecting\nNegroes, briefed us on the legal background to the\nSupreme Court decision. Reverend William Borders of\nthe Wheat Street 3aptist Church in Atlanta Georgia,\nSPOKE OF THE PSYCHOLOGICAL EFFECTS OF THE SUPREME ’\nCourt’s decision on Negroes in general. And Mr. Fred\nRouth, Assistant Director of the Southern Regional\nCouncil, discussed Southern attitudes towards, and\nDEGREE OF COMPLIANCE WITH, THE SUPREME COURT’S DECISIG':\nJe invite you to join us again next week at this time\nWHEN WE TAKE UP THE QUESTION OF THE NEGRO AND\n’The City.'?: Migration and Urbanization, as we continue\nto discuss \"The Last Citizen\", The Negro in America.\nMUSIC\nTHEME UP \\ND UNDER\nANN CR :\nYou have been listening to Dr. Louis Schneider, Pro¬\nfessor of Sociology at Purdue University and the\nprogram’s producer-director E. J. Richter as they dis¬\ncuss \"The Last Citizen\". This program was produced\nAND RECORDED BY WB.\\A , PURDUE UNIVERSITY, UNDER A GRANT\nfrom the Educational Television and Radio Center and k\nBEING DISTRIBUTED BY THE NATIONAL ASSOCIATION OF\nEducational Broadcasters.\nMUSIC\nTHEME UP TO FINISH\nANNCR:\nThis is the N\\E3 Radio Network."
}