{
  "id": "d201-94",
  "text": "-2-\nSCHNEIOER: ^e’.re all well aware that migration has been of\nTREMENDOUS CONSEQUENCE IN THE HISTORY OF THE UNITED\nStates. Prior to 1890 we had what historians and soc¬\niologists SOMETIMES CALL THE OLD MIGRATION--MIGRATION\nfrom the Northern and ■ iestern parts of Europe....\nMIGRATION REPRESENTED BY GERMANS, SCANDINAVIANS,\nEnglishmen, and so on. This kind of migration repre¬\nsented AN INFLOW INTO THE UNITED STATES CF PEOPLE OF\nCULTURAL BACKGROUNDS NOT VERY DIFFERENT FROM THOSE OF\nAmericans. Differences there were, yes. But at the\nSAME TIME THE CULTURES OF SCANDINAVIA, ENGLAND, AND\nGermany were appreciable close to the culture of the\nUnited States. After about 1890, as is well known, th\nCURRENT OF MIGRATION-OR THE SOURCE OF MIGRANTS-BEGAN\nto shift. Migrants began to come from the southern\nAND EASTERN PARTS OF EUROPE. PEOPLE OF ITALIAN ORIGIN\nGreek origin, Slavic origin, composed this newer migra\ntion. Cultural differences between these people and\nAmericans were greater than they had been between\nrepresentatives of the older migration and Americans.\nIn the 1920’s we revised our immigration laws to meet\nWHAT WE THOUGHT CF AS A DISTINCTIVELY NEW SITUATION.\nIn any case, cur laws became restrictive. They were\nDESIGNED TO FAVOR THE OLD TYPE MIGRANTS OVER THE NEW.\nAlso, our quota system restricted sharply the numbers\nOF IMMIGRANTS WE WOULD ALLOW ENTRANCE ANNUALLY. HERE¬\nAFTER, IF WE NEEDED REALLY LARGE SUPPLIES OF LABOR,\nWE COULD NO LONGER DRAW SO HEAVILY ON Old EUROPE.\nAnd, indeed, beginning only a few years before our\nRESTRICTIVE IMMIGRATION LEGISLATION, IMPORTANT MOVEMEN\nof Negro workers toward the North got underway. Aroun\nTHE TIME OF i/ORLD a/AR I, WITH THE DEMAND FOR SKILLED\nAND UNSKILLED LABOR COMING FROM NORTHERN INDUSTRIES,\nNegroes started to move up to cities like New York,\nPhiladelphia, Detroit and Chicago in considerable\nNUMBERS .\nRICHTER: .'ell, let me interrupt here for a moment to make the\nPOINT THAT WHEN INDUSTRY BEGINS TO CALL UP NEGROES FR■\nthe South to the Northern Centers, the process becomes\nONE THAT IS CALLED INTERNAL MIGRATION.\nSCHNEIDER: Yes. The Negro migration, to be sure, is internal •\nMIGRATION....MIGRATION WITHIN THE COUNTRY ITSELF. Sot\nINTERNAL MIGRATION ANY COUNTRY IS LIKELY TO HAVE. And\nESPECIALLY IN A COUNTRY THAT’S HIGHLY INDUSTRIALIZED\nAND URBANIZED, YOU’LL HAVE A GOOD DEAL OF IT. THERE\nARE PARTS OF THE WORLD STILL IN WHICH THERE IS A\nCERTAIN LIKELIHOOD THAT AMAN WILL PASS ALL HIS LIFE\nWITHIN TWENTY MILES OR SO OF THE SPOT WHERE HE WAS\nBORN. But this is GETTING rawer and rarer, AND PERHAP\nSCON WILL BE JUST ABOUT NON-EXISTENT. IN A COUNTRY"
}