{
  "id": "d201-96",
  "text": "-4-\nAND YOUR LIFE WILL JUST BE FIGHTING FROM SUN TO SUN TO\nMAINTAIN YOURSELF AND KEEP ALIVE. The PEOPLE MOVE IN\nA COMMUNITY SORT OF WAY. A FEW VENTURESOME SOULS GO\nFORTH, SOME OF THEM MAKE GOOD. THEY NEVER PICK UP AND\nMOVE ALL IN ONE SWITCH. ThEY ALMOST NEVER DO. 'HEY\ngo up North and look around and see the situation and\nCOME BACK HOME AND REPORT ABOUT IT. OR MAYBE THEY GO\nUP NvRTH AND GET A JOB AND WRITE BACK AND SEND BACK FC\nTHE FAMILY. Vi CRD GOES FROM COUSIN TO COUS'N, BROTHER\nTO BROTHER, THAT THE INDUSTRIAL OPPORTUNITY IS GOOD\nIN A CERTAIN AREA AND THEN WHOLE FAMILIES BEGIN TO PIC\nUP AND MOVE TOWARD THE NORTH.\nIT HAS OFTEN BEEN POINTED CUT THAT THE NEGRO MAY\nBE WORSE OFF IN THE NORTH THAN IN THE SOUTH BECAUSE HE\nNEVER KNOWS WHERE HE STANDS, WHERE HE WILL BE ACCEPTED\nOR REJECTED IN PUBLIC ACCOMMODATIONS, JOBS, IN FORMAL\ngroups. This may be true; but the fact of not having\nLAWS TO PROMOTE SEGREGATION IS A COMFORTING ONE. ^ND\nTHE FACT THAT YOU MAY HAVE ABOUT SEVENTEEN STATES IN\nthe North that have laws against discrimination is\nlikewise comforting. The fact that if a person discri\nminates against you, he is usually acting against the\nLAW, WILL HELP YOU. ThE FREEDOM THAT YOU CAN FEEL IN\nthe North is something that rs_ almost indescribable.\nHave seen many people and the way they sigh just from\nTHE BUSINESS OF CROSSING THE Ohl0 RlVER WHICH SIGNIFlE\nthat they are no longer in the South.\nMIGRATION HAS MANY CAUSES BUT YOU?LL USUALLY FIND\nTHAT IT IS A WORD OF MOUTH THING, BROTHER TO BROTHER,\nCOUSIN TO COUSIN. PASTOR OF THE CHURCH SOMETIMES WOUL\ngo up North to take a look at situations find out wher\nTHE WELFARE FACILITIES ARE AND WHERE PEOPLE CAN OBTAIN\nHOUSING. A NO THEN, SO M E T I ME S ,H E ’ D SEND FOR HIS WHOLE\nCONGREGATION AND MOST OF THEM, OF COURSE, WOULD STAY.\nThen certain cities become tradition. It’s a good\nQUESTION WHY THE NEGRO PEOPLE GO TO SOME CITIES AND NC\nothers. Like in the case of the Puerto Rican where ti\nINDUSTRIAL OPPORTUNITIES ARE MUCH BETTER IN CHICAGO Ah\nMilwaukee than it is in New York, and yet there are\nonly 25,000Puerto Ricans in Chicago and there are 5 of\n600,000 in New York. Part of this is just a pattern.\nA few people did it and did it successfully so someone\nELSE DOES IT. YOU HAVE TO HAVE A TRADITION OF SUCCESS\nIN EVERY GROUP IN ORDER TO FIND THE PATTERN FOR THE\nREST OF YOUR GROUP: AND IF A GUY GOES TO CHICAGO AND\nMAKES GOOD, THEN WHY SHOULDN’T TEN OTHERS? THERE ARE\nMANY SMALLER TOWNS WHERE IT WOULD NEVER OCCUR TO PEOPO\nTO MIGRATE, EVEN THOUGH THE INDUSTRIAL OPPORTUNITY IS\nGREAT, AND 1 KNOW FOR NEGRO IN NASHVILLE, CHICAGO AND\nDetroit and Cleveland are Mecca, because you are free\nTHERE, THERE ARE JOBS FOR YOU, THERE ARE UNIONS THAT\nMIGHT PROTECT YOUR JOB SECURITY, THERE IS HOUSING THA¬\nIS BAD, BUT IT AT LEAST IS BETTER THAN WHAT YOU HAD."
}