{
  "id": "d201-97",
  "text": "-5-\nSCHNEIOER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nGRANGER:\nAnd keep in mind that it’s always a matter of relative\nDEPRIVATION, A PERSON CAN ALWAYS SAY TO HIMSELF. WELL\nTHIS MAY NOT DE SO HOT OUT RELATIVE TO WHAT I HAD DOWN\nSouth this looks very good.\nDr. Johnson speaks of the push and pull of migration.\nHowever, the particular factors involved in migration\nof the Negro have worked out, there is no doubt that\nTHE EFFECT UPON OUR CITIES HAS BEEN VERY, VERY CONSIDE\nable. According to one carefully done study of New\nYork in the years from 1950 to 1957, the numbers of\nnon-whites in New York in those years....and the non¬\nwhites ARE OVERWHELMINGLY NEGROES . . . . 1NCREASED BY 26.5\nLos Angeles increased its non-white population by over\n47$ IN THE COURSE OF THE SAME FEW YEARS. GARY, INDIAN\nBY MORE THAN 55$; AND SaN DlEGO, CALIFORNIA, BY MORE\nthan 82$. In New York City there were about three\nQUARTERS OF A MILLION NCN-WHITES IN 1950. By 1957\nTHERE WERE ABOUT A MILLION, AND A VERY GREAT MAJORITY\nOF THESE MILLION NON-WHITES WERE NEGROES. If WE TAKE\nOUR LARGEST METROPOLITAN AREAS AS A WHOLE, THE NeGRO\nPOPULATION HAS BEEN INCREASING IN THEM AT A MUCH GREAT\nRATE THAN THE WHITE POPULATION IN RECENT YEARS.\nBut what are the effects that such a rapid increase in\nthe Negro population has on these cities? Fcr example\nWE KNOW THAT OF RECENT YEARS THERE HAS BEEN AN EVER\nINCREASING EXODUS OF WHITE FAMILIES FROM URBAN CENTERS\nOUT TO THE SUBURBS. W HAT EFFECT DOES THIS HAVE ON THE\ngrowing Negro minority? Does the presence of an ever\nGROWING NON-WHITE POPULATION IN URBAN CENTERS BREED\nRACIAL FRICTION? CAN WE DIFFERENTIATE AMONG CITIES\nWITH REGARD TO HOW THEY FACE UP TO RACIAL PROBLEMS?\nLet ME ANSWER YOUR LAST QUESTION FIRST, I ALT. 'ALTHOUG\nYOU CAN LUMP, CR GROUP, THE LARGER CITIES FOR SOME\nANALYTICAL PURPOSES, STILL FOR THE PURPOSE OF CERTAIN\nKINDS OF ANALYSIS ONE MUST MAKE DIFFERENTIATIONS.\nFor EXAMPLE, IN THE MATTER OF RACE RELATIONS IN VARI¬\nOUS CITIES—COMPARED WITH CHICAGO, PLACES LIKE SaN\nFrancisco and New York h\\VE a relatively good reputa¬\ntion in this area.\nWell, let me inject a statement at this point, Lou,\nWHICH HAS A .EARING ON YOUR COMMENTS. A STATEMENT MAD\nby Lester Granger, Executive Secretary of the National\nUrban League when we spoke with him some time ago in\nhis New York office.\nI’d like to say, first of all, that the existence of a\narea of HEAVY Negro residence does not necessarily\nproduce a concomitant of bad race relations. There a,"
}