{
  "id": "d201-98",
  "text": "-6-\nSCHNEIDER:\nCITIES WHERE THERE ARE AREAS OF NEGRO CONCENTRATION,\nWHERE RELATIONSHIPS, ON THE SURFACE AT LEAST, ARE\nFAIRLY AMICABLE. It TAKES SOMETHING MORE THAN THAT;\nIT TAKES A FEELING OF DEEP AGRlEVEMENT ON THE PART OF\nNegroes, and an exploitation of racial prejudice on th\nPART OF*WHITES. The REASON THAT CHICAGO IS A BAD TOWN\nIN TERMS OF RACE RELATIONS, AT THE PRESENT TIME, IS\nbecause IN Chicago there are elements which are very\nACTIVE IN ENCOURAGING ANTI-NEGRO FEELING. THERE ARE\nTHE PROFESSIONAL RACE BAITERS, THE RACKETEERS IN RACE\nHATRED WHO MAKE A LIVING OUT OF IT IN CHICAGO. Now,\nNew York City, on the other hand, is a town where ther\nIS ALMOST AS MUCH SEGREGATION OF NEGROES RESIDENTIALLY\nas in Chicago. Chicago is actually described as the\nMOST HIGHLY SEGREGATED CITY IN THE COUNTRY. But NEW\nYork City in many ways approaches Chicago. But there\nHAS NEVER BEEN THE INTENSITY OF RACIAL ACRIMONY IN\nNew York City that exists in, has existed in, Chicago\nINTERMITTENTLY EVER SINCE 1915. The REASON, OF COURSE\nIS THE DIFFERENT CLIMATE IN NEW YoRK ClTY. NEW YORK\nNATURALLY A MORE COSMOPOLITAN CITY AND NEW YORK CITY\nHAS NOT BEEN THE TERMINAL POINT FOR SO MANY OF THE\nRACKETEERS IN RACE HATRED COMING DIRECT FROM MlSSlSSIP\nFROM ALABAMA. THOSE BOYS GO UP THE MlSSIS8iPPI.AND\nTHEY END UP IN St. LOU I S, OR CHICAGO, OR THE MIDDLE\nVest, Detroit. New York City gets the East Coast mi¬\ngration AND FEELINGS IN THE EAST COAST HAVE NEVER BEE!\nAS RAW AS NAKEDLY VIRULENT AMONG THE SOUTHERN WHITES A\nTHEY HAVE BEEN AMONG SOUTHERN WHITES IN THE DEEP CENTA\nSouth.\nOne could go on fairly indefinitely making distinctioi\nOf the kind Mr. Granger suggests. 3ut, recognizing\nthat refinements and elaborations of various kinds arf\nPOSSIBLE, LET ME, STILL IN ANSWER TO YOUR QUESTION,\nCITE A CASE OF A SOMEWHAT SPECIAL ORDER. . . .THE CASE\nof Los Angeles on the Vest Coast. Negro migration-to\nthe West Coast Cities is a very recent thing. And,\nIN THE CASE OF A CITY LIKE LOS ANGELES, YOU DO HAVE\nSOME RATHER SPECIAL DEVELOPMENTS. THE NEGRO ON THE\nWest Coast is not alone in being new. Other people\nARE NEW ALSO. MANY \\ NGELENOS ARE INDIVIDUALS OF RECE\nmigration. You might almost say that everybody;is a\nFOREIGNER, AND THERE HAS NOT BEEN THE KIND OF PRECIPI\nTATION OF ATTITUDES THAT YOU HAVE IN OLDER COMMUNITIE\nOF THE COUNTRY. THE SITUATION IS, THEREFORE, A\nSOMEWHAT UNIQUE ONE FOR THE NEGRO. At THE SAME TIME\nTHIS DOESN’T MEAN THAT THE NEGRO HAS HAD AN ESPECIALLY\nEASY TIME OF IT IN LOS ANGELES. If LOS ANGELES IS\nSOMEWHAT SPECIAL, ITS CASE NEVERTHELESS REVEALS FEATU,\nTHAT ARE QUITE GENERAL. THUS, WE GET DIFFICULTIES\nDEVELOPING IN SITUATIONS WHEREIN NEGROES MOVE INTO\nPREVIOUSLY RESTRICTED AREAS, IN THE SUBURBS AS WELL A\nIN THE CITY PROPER „"
}