{
  "id": "d1708-6",
  "text": "RADIO PROGRAMS\n7\nthis radio instruction Dr. Maddy will be aided by a studio chorus\nwhich will sing familiar songs, phrase by phrase, so that listeners\nmay learn both the tunes and the words. After such instruction\nlisteners are urged to join in with the studio chorus in singing the\nselections. The Golden Boo\\ of Songs, which is used rather gen'\nerally in the schools of the State, will contain all the selections\nto be sung in this radio course. Those adults who have no copies\nof the Golden Boo\\ of Songs may obtain copies by sending twenty\ncents to the Extension Service, University of Michigan, Ann Arbor.\nChoral groups from the schools of the State are urged to\ncome to the Morris Hall Studio in Ann Arbor to act as demon'\nstration groups for the broadcast.\nBOOKS TO FIT YOUR POCKETBOOK\nAND MOOD\nMondays, 3:45-4:00 p.m.\n(Over WMBC, Detroit)\nBook reviews of fiction, travel, and biography listed in the\ndollar editions. The reviews and readings will be prepared and\npresented by graduate students enrolled in the University Broad'\ncasting courses.\nMUSIC MAKERS\nTuesdays, 12:45-1:15 p.m.\nThis weekly program will be presented over the Red Network\nof the National Broadcasting Company.\nDr. Joseph E. Maddy, Professor of Radio Music Instruction\nin the University Extension Service, will offer instruction in the\nplaying of all musical instruments for orchestra and band, as well\nas for piano, the guitars, banjo, mandolin, ukelele, and accordion.\nSeparate instruction books for each instrument are designed to\nenable the beginner to obtain the maximum benefit from the broad'\ncast lessons. Each book contains definite directions and fingering\nfor playing the particular instrument, pictures showing the correct\nplaying position, diagrams of the instrument, and instructions re-\ngarding its care.\nInstruction books may be obtained by sending twenty'five\ncents, naming the type of instrument for which instruction is de'\nsired, and the student’s name and address to Joseph E. Maddy,\nin care of the Broadcasting Service, University of Michigan, Ann\nArbor, Michigan."
}