{
  "id": "d1407-20",
  "text": "t «1-:TI«3s STH-Tal y OF 1946 ■ 01 FuHr SW.VOb .\nIn June, 1945, four thousand seven hundred twenty-six cu.\nthese ouestionaires were sent to farmers at Iowa. Tb®y\nwere sent to farmers operating ten or more acres. The\nmailing list was obtained from a random sampling made by\nemployees of Wallace’s Farmer iMaSiSS °f th^t magazine s\nIowa subscribers*. Of the one thousand four hundred and\nfifty-nine qucstlonaires returned, nine hundred and seventy\nfour or twenty and six-tenths percent of the total number\nsent were tabulated *\nThe distribution by farm size in the tabulated responses\nfollows very closely the distribution by size of Iowa\nfarmers with some slight shewing in the tabulated questionaires\ntoward the larger acreages. Eeturns were made from aii\nninety-nine counties in Iowa.\nThe most significant responses showing rOI«s status among\nmid-west radio stations carrying agriculture inflation\nare those given to question three of the survey which asked,\n(a) what station was favored for listening to farJ‘\nand (b) which was the most popular market information station.\nIn the general farm information part oi the question, the\nfollowing results were made. ?\"0I received three hunorecn\nfifty-six or twenty-five and six tenths percent oi the\nthousand three hundred and ninety-two first, second, and thir\nplace votes cast for favorite farm information station. This\nplaced V'OI in second '*?ace among Iowa stations, h0 being the\nonly station showing a larger return. Tne ^^i^wing table list\nthe number of responses and percentages of the fxve reading\nstations in this question.\nWHO\n544\n39*1#\nwox\n356\n25.6\nV?KT\n134\n9*6\nKM\n139\n9.9\nKXEL\n47\n3*4\nIn the part of the question devotee to favorite\nmarket information. W0I was again in second place with twenty\npercent of the two thousand one huridred and forty-four responses,\nIhO was the only station which surpassed VOI here having thirty\npercent responses. The following table lists the six leading\nstations in this portion of question one.\n30*1$\n20.1\n9*5\n8.7\n3.6\n3*3\nThe remaining votes\nWHO\n666\nWOI\n431\nnn\n203\nKM\n186\nwow\n77\nWNAX\n72\nin each\npart\nThus it is seen\nover 111 ween or nwe -- — . . „\nthat WOI is a strong second in both categories receivlng more^^\nthan half as many votes as WHO in both brackets (farm\nand more than twice as many as the next preferred station.\nSTxvtteiT"
}