{
  "id": "d1407-23",
  "text": "« 17 -\nOn account of the serious interruption, to the HOI service to farmers in\nstimulating of the maximum production of ”food to via the war*-* every effoit\njaade to have the service resumed. Seventeen months later, July 10 1943, the\nIowa State College of Agriculture and Mechanic Arts filed an application for a\nSpecial Service Authorisation (B»207 Docket #6£j&l» Fils ^Bd^SSI^T-G) undos\nSection 1,366 FCO redes and Regulations,\nDr,on examination# the Federal Communications Commission, on August 3* 1943*\ngranted the application to the extent of authorising operation of WOI under a\nschedule beginning at 6:00 AM. CW9 with power reduced to one kilowatt before\nlocal sunrise*\nNotice of this action was received August 11# 1943* and program service\nbeginning at 6?00 AM was resumed August 16# 1943* and continued for eight days\nuntil August 29, 1943« when the use of morning time before sunrise by ”01 was\nprotested by Earle' C. Anthony# Inc,* licensee of Station KFX* (640 kilocycles\n50 kilowatts, unlimited time)# and on order of Secretary T„ J, Slovie, service\nwas discontinued. Hearings were held on the application October 26 and 27„ 1943,\nand proposed findings were latar submitted by legal council for the applicant and\nby the petitioner. On March 29, 1944, the petition was granted effective December\n9, 1944„ and service wag resumed on that data# and has continued in operation\nexcept th'ta since 2?00 AM, September 30# 1945, when time changed from ”ar Time\nto Standard Time, It has had the affect of limiting the day by one hour to conform\nto the hour of sunsetc but has made it unneceseary .for VDI to sign off between\n8 00 and 8*45 W in January# between 8*00 and 8:15 AM in February, and between\n8•oo and 8:30 AM in December, The use of morning time has certainly been appro\nelated by the TfOI listeners;\nAs a result of service satisfactorily performed during morning hours. many.\nlisteners have requested that DOI continue its broadcast of public service program,s\nuntil at least 10:00 PM, In accordance with this request for additional broadcasts\ndaring evening hours. Iowa State College of Agriculture and Mechanic Arts did\nfile, on November 21, 1945s an application for a construction permit to install"
}