{
  "id": "d1407-26",
  "text": "- 20 ~\n9s 10 - Monday through Satur iy AUD y'*&THBR minute foreeast and\nexplanation of weather conditions in Iowa and\nadjoining states,, More than a mere weather forecast„\nthis is designed as a continuing education in an\nexplanation of factors in climatology. It will be\nphrased in terns for farm and livestock operations.\nPresented in cooperation with the Departments of\nClimatology and Meteorology«, Ioi/a State College^\nand related Departments in the United States\nDepartment of Agriculture, Presented under the\nSpecial auspices of the United States leather Bureau,,\nBes Moines Office,\n9* 15 * Monday through Saturday SCHOOL FOR CITIZENS A 25-minute adult \"school of the\nairs? involving the cooperation of all departments of the\nIowa State College.., the Iowa Agricultural Extension\nService* the Iowa Industrial Commission* the Iowa State\nDepartment of Education, and interested civic groups-\nTechniques will range from lecture to drama, from\nforum presentations to interviews. Objeotlto* will\nnot he the ^classroom\" or the disciplinary approach\ncommonly attempted* but a broad attack on social\nproblems ranging from concerns of marriage,, the family\n.and mental hygiene, to current problems in economics,\nlabor and Iowa farm <*m& public life* One night each\nweek will be devoted to material presented in such\na way it v/ill afford correspondent students of Iowa\nState College to maintain continuing llason with their\ncourses t study,\nSi46 * Monday through Friday «* HYMSTXMS « a 15-minute program of sacred music*\ntranscribed* recorded, and live* telling the histories\nof hymns, offering a different type of sacred music\nat a different time than any other station in ths ares...\n' Presented under the auspices of the Department of Music\nand Religious Education at the Iowa State College,\n10;: 00 « Monday through Friday « SIGt^OTF\nTo render their maximum service* educational radio stations need to enjoy radio\nfacilities during 'evening hours vrith sufficient power to cover their normal listen¬\ning territory* which in the case of ta ^supported institutions is the state or area\nin which taxes are paid for the support of the institution.\nRadio channels belong to the people* and they should be used in the public\ninterest,. He contend that the public interest is better served by allowing better\nfacilities* including evening hours and more power on clear channel for assignments\nto educational stations where it can be demonstrated that programs of educational\nmaterial and cultural entertainment may be broadcast by the educational stations with¬\nout causing serious interference to the signal of the dominant stations in areas"
}