{
  "id": "d1208-3",
  "text": "From LEO T. CRGLLEY, CHAIRMAN, FEDERAL DEPOSIT INSURANCE CORPORATION:\n\"The Secretary of the Interior ha 3 called ny attention to the fact that the\nAssociation of College and University Broadcasting Stations, through its\ninterest in broadcasting transcriptions of activities and achievenents within\nthe Federal Government, nay desire further information with regard to tho Federal\nDeposit Insurance Corporation.\n\"I wish to take this opportunity of informing you that we should be very\nhappy to cooperate in every way possible, and that if you have any requests for\ninformation you may address then to this office.\"\nFrom LEONA B. GRAHAM, EXECUTIVE ASSISTANT, FEDERAL EMERGENCY ADMINISTRATION OF\nPUBLIC WORKS:\n\"The Commissioner of Education, Department of the Interior, advises this\noffice that some 38 college and university broadcasting stations throughout the\ncountry are interested in disseminating information about activities and achieve*\nments within the Federal Government,\n\"In this connection the Public Works Administration would appreciate\nreceiving details concerning your organization, with a view to participating in\nyour program. Suggested topics might be: (1) The place of the Public Works\nAdministration in the general recovery program; (2) tho character of the organi¬\nzation set up; (3) certain difficulties encountered in carrying out the purposes\nof the Public Works Administration; and (4) the accomplishments of Public Works,\n\"We shall be glad to cooperate with you in the preparation of material on\nthe above or related topics.\"\nFrom JOHN H. FAHEY, CHAIRMAN, FEDERAL HOME LOAN BANK BOARD:\n\"The Secretary of Interior has written us concerning your desire to obtain\ndetailed and authentic information in regard to the activities and achievements of\ncertain of the Departments and Agencies of the Federal Gove mm oat, in prepara¬\ntion for broadcasting information to the public# Ho has suggested that our\nDepartment cooperate by supplying material of the character you desire#\n\"I am enclosing several descriptive pamphlets and excerpts from speeches\nmade by various officials of our organization indicating the nature, scope and\nactivities of our four Departments - the Federal Home Loan Bank System, the Home\nOwnersf Loan Corporation, Federal Savings and Loan Associations, and the Federal\nSavings and Loan Insurance Corporation. You will find the pamphlet entitled\n\"The Three Agencies,\" describing tho first three of these units, particularly\ninstructive.\n\"If, after examining these and considering the extent to which you desire\nto use broadcasting material concerning our organization, you will let me know\nin detail any additional information and help you my wish to have, I shall be\nglad to cooperate by extending further assistance.\"\nFrom G. D. MONGER, COMMERCIAL MANAGER, ELECTRIC HOME AND FARM AUTHORITY, BTC.:\n\"Your letter directed to tho U. S, Commissioner of Education rolating to use\nof governmental infomation by university broadcasting stations has been brought\nto my attention.\n\"The Electric Homo and Farm Authority is an agency of the federal government,\nassociated with the Tennessee Valley Authority in an electrification program\nin the area of the Tennessee River Basin. Its three directors are the directors\nof the Tennessee Valley Authority. I an sending you a booklet which describes\nits manner of operation in a program designed to make cheap electricity available\nto all Tennessee Valley residents.\n\"Wo should be glad to supply you with a more comprehensive report on tho\nactivities of this agency if you have use for this information in the college and\nuniversity broadcasts. Wc are placing your office on our nailing list so that\nyou will receive such literature as we distribute fron tine to time.\""
}