{
  "id": "d1208-3",
  "text": "well gladly send' you one. There’s no reason why\nsuch funds cannot be granted to technical personnel\nand we invite you to apply if you’re interested in\nfurthering your technical knowledge through a course\nof study.\n* * * * *\nWe don’t have complete details but RCA has\nannounced a new vidicon camera tube, type 7038.\nIt is a one-inch diameter tube, capable of 600 line\nresolution and can be used for color, monochrome,\nlive or film cameras in broadcast or industrial ser¬\nvice. It is more sensitive than previous types, de¬\nlivering broadcast picture quality with as little as\none foot-candle illumination on the face plate.\n*****\nWRFK-FM at the Union Theological Seminary is\nincreasing power and will soon have a Gates 10-watt\nFM transmitter tuned to 91.1 me. for sale. If you’re\ninterested contact Robert White Kirkpatrick, Di¬\nrector, WRFK-FM, Union Theological Seminary,\nRichmond 27, Va.\n*****\nWe hope you saw the article in Radio and TV\nNews for April by Glen Southworth of KWSC, Pull¬\nman, Wash. It gives the constructional details on how\nto “Use Your TV Set as a Oscilloscope,” which we\ndescribed briefly in the August, 1957 Newsletter and\nthe subsequent September Engineering Newsletter.\nCongratulations, Glen! We hope this will inspire\nothers at educational stations to follow your example.\nWe’d like to see more of our technical personnel\nparticipating in the activities of professional engineer¬\ning societies, presenting papers at their meetings and\ncontributing to their journals.\nTV TECHNICAL TIPS (June)\nJudging from the comments received to date from\ntwo-thirds of the participants, the NAEB Video\nRecording Workshop was an unqualified success. It\nwas held May 5 - 9 in the studios of WTTW, the\nChicago Educational Television Assn, station. From\nthe get-acquainted session Sunday evening to the\nclose of the workshop Friday noon, the exchange of\nideas and experiences was an almost continuous\nprocess. We did provide a few hours each night for\nsleeping, however many of the evening sessions con¬\ntinued over a glass of brew at the Cottage Bar of the\nShoreland until a late hour.\nMost participants mentioned how much the pres¬\nence of Rodger Ross and Harold Wright of the\nCanadian Broadcasting Corporation added to the\nprogram of the Workshop. I was more than pleased\nwhen they accepted the invitation to attend and\nespecially happy that they could be with us for the\nentire period. We are not only indebted to CBC for\nmaking it possible for us to have the benefit of their\nknowledge and experience, but as well to all organiza¬\ntions from the broadcasting and film industries whose\nrepresentatives contributed much to the success of\nthe workshop program.\nIn addition to providing much practical informa¬\ntion which the participants can incorporate in their\nown operations, the workshop highlighted three areas\nof work for the NAEB Engineering Committee:\n1) Investigation leading to a standard film repro¬\nduction characteristic\n2) Densitometer standardization\n3) Utilization of EIA grayscales to establish studio\nexposure practices.\nAt the completion of the first item, it is then believed\nthat we shall be in a position to re-evaluate the print\ndensity requirements for kinescope recordings as\nestablished by ETRC and perhaps to establish nega¬\ntive density requirements to produce these prints\nwith standard laboratory exposure and development\nprocedures.\n*****\nThe past month has been one of almost continuous\ntravel for the writer. Such a schedule isn’t the most\nconducive for the production of a column like this,\nnot because of the lack of new experiences or ideas\nbut simply because deadline dates seem so close to¬\ngether.\nRegardless of the present implementation of the\nvideo tape recording process for television program¬\nming, three papers were presented at the SMPTE\nmeeting in Los Angeles on kinescope recording. These\nalong with the seven presented on video tape record¬\ning should appear soon in the SMPTE Journal. A\ntotal of 82 papers were presented during the\nweek with the program somewhat heavier on the\nmotion picture side, as is usual for the west coast con¬\nvention.\nAt the NAB meeting the following week, broad¬\ncasting again came into its own with many new or\nimproved items being shown. Ampex was demonstra¬\nting both monochrome and color video tape recorders;\nGates was showing a new 1 kw AM and a 1 kw FM\ntransmitter with Multiplex. General Electric had its\nnew 3-image orthicon color camera in operation, as\nwell as a new monochrome image orthicon camera and\nlive and film vidicon cameras. They were also show¬\ning a transistorized (except for output tubes) sync\ngenerator and a newly designed audio console.\nRCA displayed, for the first time, AM and TV\nautomation equipment, a new TV switcher in which\nthe switching is done by transistors (relays incorpor-\n4\nENGINEERING NEWSLETTER"
}