{
  "id": "d465-16",
  "text": "KTCA-TV\nTWIN CITY AREA EDUCATIONAL TELEVISION CORPORATION\nCHANNEL 2\nMINNEAPOLIS • ST. PAUL\nMINNESOTA\nSt. Paul 8, Minnesota\nOFFICERS\nLoring M. Staples\nPresident\nJohn deLaittre\nFirst Vice President\nWendell T. Burns\nVice President\nRonald M. Hubbs\nVice President\nPhilip H. Nason\nVice President\nGeorge D. Dayton II\nSecretary\nA. A. Heckman\nTreasurer\nTRUSTEES\nDouglas K. Baldwin\nWendell T. Burns\nJohn E. Carroll\nForrest E. Conner\nGeorge D. Dayton II\nJohn deLaittre\nMiss Adelaide M. Enright\nSamuel C. Gale\nSander D. Genis\nClemens Granskou\nA. A. Heckman\nLeonard H. Heller\nRonald M. Hubbs\nMrs. Charles Hymes\nWilliam H. Lang\nWilliam G. Law\nSamuel H. Maslon\nThomas Moore, Sr.\nGerald T. Mullin\nJohn H. Myers\nPhilip H. Nason\nWilliam L. Nunn\nRev. Walter H. Peters\nJohn S. Pillsbury, Jr.\nRufus A. Putnam\nJohn C. Savage\nJohn W. Seeger\nNeil Sherburne\nLoring M. Staples\nHarold E. Wood\nTelephone\nMidway 5-5565\nJanuary 5, I960\nMr. Harold Hill, Associate Director JAN 9 I960\nNational Association of Educational Broadcasters\nlU Gregory Hall\nUrbana, Illinois\nDear Harold:\ni\nSorry to have delayed answering your December 16 letter.\nThere were a few things I needed to talk to John about\nbefore laying out the program. I certainly agree with you and\nHarry; the only way to get anything started is to buckle\ndown and do it. I do think that the project should be\ndeveloped in several phases. The enclosed proposal shows\nhow these phases might line up.\nI think it is optimistic to expect much in the way of actual\nexchangeable material out of the first phase. The big\nhold up will be in finding stations with facilities, money,\nand people to invest in the project. However, the Ford\nconsultation money can be spent advantageously to take care\nof getting it into a starting position. I feel there is\na great potential for these Utilization Kits but they are\nnot lying around ready to be picked up. From our preliminary\ncommittee meetings, it was evident that everyone needed\nthe material and knew the kind of thing that was needed,\nbut had no source.\nIf there were some place (and as of now I know of none) willing\nto invest money in the production of these kits, or if there\nwere some producing money available, then I could see how\nwe might get at least one Kit in the works•\nIncidentally, we have submitted a Project Proposal on utili¬\nzation to the Title VII Office. If it is approved, we will\nhave a film report on utilization available. We suggested\nin the Proposal that this be distributed through NAEB channels.\nWe commented that this might become a part of the Utilization\nKits file. Perhaps, some similar material can be obtained"
}