{
  "id": "d465-56",
  "text": "3\n- Film reports illustrating findings from research. This could\nbe a documentary treatment of a complete research project with\nemphasis on how to carry out a project or a summation of several\nrelated research projects.\n- Capsulized dramatization on film or tape following a program\nidea from planning to utilization.\n- Filmstrips or slide collections with synchronized tape commen¬\ntary illustrating utilization procedures and results. An alter¬\nnate suggestion would be to supply a script with the slides or\nfilmstrips for local presentation.\n- Film documentary showing a variety of class activities which\ndeveloped from one educational broadcast. This would start by\nshowing or playing a part or all of the film or tape of the pro¬\ngram stimulating this utilization.\n- Collections of class work resulting from educational broadcasts.\nThis could include art* literature, science, music and similar\nprojects.\n- Complete utilization workshop outlines (short or long) includ¬\ning suggested handouts, sample scripts, time tables, program ex¬\namples, etc.\n- Tape recordings of the discussion within a class following an\neducational broadcast.\n- Reprints or recordings on film or tape of selected speeches,\narticles in quantity for use with committees and discussion groups.\nIII. Objectives and Proceduress The principal objective of\nthis project is to develop and make available information and material\nrelative to the improvement or development of classroom utilization of\neducational broadcasts. The project is proposed to be carried out in\nfour phases. Each of these are considered below.\nPHASE 1 - Exploratory\nThis phase would serve three purposes. The first of these would\nbe to locate and evaluate educational broadcast utilization materials\nnow in existence. The second purpose would be to locate places and peo¬\nple who are working with teachers in the development of utilization and\nare able to develop new utilization materials, and third to develop spe¬\ncific plans for the production of materials not now available."
}