{
  "id": "d465-99",
  "text": "fm 3\niswwdiate need for these materials.\nTh« slides trim th© $%• Louis kit «w» also shown to members\nof the Titl® m Advisory Committee by Hiss nisabeth Oolter-\n»on« This kit will be completed and shown as an interim\nreport at tho October westing of th® Titl® VXX Advisory Cm*\nIttee.\n3* Liason has b®©n established between stwal organisations who\nare also interested in the problem of classroom utilisation\nof educational broadcasts.\nAACTE- The Television SttbeOSmmittee of the Amorican Association\nof Colleges of Teacher Education is preparing an outline to be\nneed as s basis for organising workshops and courses to achieve\neffective utilisation of instructional television. Several\nmeetings have been held with mmkmm of this organisation. A\nrepresentative from HAH has met with this sub-committee and\nassisted In developing the outline.\ngAVX - Tho Department of Audio Visual Instruction of the National\nMs cation Association is planning a special film report to show\nexcerpts of outstanding Instruction television programs. Arrange¬\nments have been made with DAVX to distribute this film through\nthe mm Utilisation Kit Service.\nDCT - The Department of Classroom Teachers of the National Ed¬\nucation Association and DftVI are planning a Joint utilisation\nseminar this fall. The purpose of this seminar is to prepare\na special publication on utilisation of instructional television.\nA mm representative is a member of the ^tearing Committee\nplanning this seminar.\n*TIP5 TO COUPLETS PHASE I\nTha following state are necessary to complete the developmental\nphase of this proposal. A revised time table and budget is included\nat tha of this section.\n1* Those people who responded to mr previous correspondence with\nsuggestions for material they could produce will be asked to\nsubmit a specific production proposal, including an outline of\nthe material to be produced, a suggested time table and an\nestimate of the cost. This information will be needed to develop\nspecific production plans and to evaluate these plans by the\nscreening committee,\n2. People who are known to be working with classroom utilisation\nof educational broadcasts and who were not previously contacted\nwill bo invitod to submit a kit developmental outline.\n3* A special eight person screening committee will be set up. This\ncommittee will include people active in the utilisation field."
}