{
  "id": "d1902-1",
  "text": "NAEB NEWS LETTERS',\n‘\nSYRACUSE AIRS SIX SERIES\nThe Syracuse Radio Workshop, or which Ken Bartley< •- : .zc r, is nc ?\nAIRING SIX SERIES OVER TWO SYRACUSE STATIONS. THE SERIES A RE J\nAsk the Scientist-Designed to stimulate interest in science. The Science\nBoard, composed of experts representing the natural and general sciences,\nANSWERS THE QUESTIONS SUBMITTED EACH WEEK SY THE RADIO AUDIENCE,\nPerspective For War-A series by members of the faculty of the Maxwell\nSchool of Citizenship that aims to provide a background and meaning to\nWorld War II and to interpret trends in world events.\nForestry Forum—Designed to show the importance of forests and of forest\nRESOURCES ANO PROOUCTS IN THE COUNTRY*S SOCIAL AND ECONOMIC STRUCTURE,\nThe University Singers—A Mixed chorus of thirty trained student voices\ndirected by Dr. Jacob Kwalwasser. Dean F. G. Crawford of the College\nof Liberal Arts reports on the Univertiy*s part in America’s war effort.\nThe Syracuse Front—A report to the community on the war morale of its\ncitizens. Based on a continuous poll conducted by Dr* Herman C. Beyle,\nIT TELLS HOW SYRACUSANS ARE REACTING TO DEVELOPMENTS !N THE WAR.\nYouth Faces War—Representative students of both sexes from the colleges\nof New York State discuss what they are thinking and doing in response\nTO THE CHALLENGE OF THE WAR.\nNAEB PACKET\nMay we POINT OUR RIGHT here that this is a service of NAEB IN WHICH\nMORE MEMBERS COULD AND SHOULD PARTICIPATE. W|TH THE NAEB NEWS LETTER ON\nTHE FIRST OF EACH MONTH, WE*LL MAIL OUT(WHEN WE HAVE MATERIAL) PRINTED\nAND MIMEOGRAPHED MATERIAL ON HAT NAEB MEMBERS AND ASSOCIATES ARE DOING.\nRead the material and secure apon ideas which may be adaptable to your\nNEEDS.\nEnclosures this month;\nAround the Radio Circuit, telling about the radio program for Chicago\nschools.\nWar-Defense - Victory, telling what v;ha is doing.\nA Comprehensive Workshop in Radio, telling of the six weeks Course to\nBE OFFERED IN CHICAGO THIS SUMMER,\nKentucky Radio Programs, telling what the University of Kentucky is\nBROADCAST ING** (AND HERE WE ” ANT TO COMPLIMENT ELMER. LULZER FOR REGULAR! V\nFURNISHING THE PACKET WITH MATERIAL.)\n“PROFESSORS ARE HUMAN\"\nThat University professors .f human beings, will be the point to be\nESTABLISHED BY THE UNIVERSITY OF KENTUCKY IN A NEW FEATURE ENTITLED"
}