{
  "id": "d1902-12",
  "text": "RADIO RAGES AND NUMBERS\nThe FCC reported full-time radio workers in October last year totalled 34,720 for\nseven networks and 12,260 stations. Average salary for staff employees was 672.40\nweekly while non-supervisory employees received 662.60.\nWHITE BILL LIKELY TO DIE IN COMMITTEE\nReports from Washington indicate the White Radio Bill is likely to die in Senate\nInterstate Commerce Committee. Advices indicate that committee opinion is split\non the measures mean-hile Senator Wallace White (Republican. Maine) is too ill to\nattend meetings and may be away from the capital the rest of the session.\nNBC RINGS THE CASH REGISTER\nGross income of the National Broadcasting Company for 1947 was 665,690,001,greatest\nin net's history, and 7,6 percent ahead of 1946 (1946 income was 661,067,034.\nFigures were disclosed in the annual statement of Radio Corporation of America.\nOIL PLUS ELECTRONICS\nMillionaire oilman Edwin Pauley, wants to go into the television broadcasting busi¬\nness, A three-man partnership asked the FCC for authority to construct a new tele¬\nvision station in San Francisco. Capitalized at $400,000 the development is known\nas \"Television California”.\nSIGHT TO REPLACE SOUND\nNBC Executive vice-president Frank Mullen predicted that television ultimately will\ncompletely replace sound broadcasting. However, he stated it may be 10 or 12 years\nbefore this happens.\nCUBA CHROMIUM PLATES\nThe Republic of Cuba officially opened a new three-million dollar headquarters for\nC-M-Q, the Cuban network. Ceremonies were attended by U.S. radio and advertising\nexecutives. C.M.Q with 7 affiliates has made a tie-up with NBC and now begin an\nall-out effort to up its monthly billing from American advertisers, already at\nthe $100,000 mark.\nU.S. HIGH FREQUENCIES CAUSING TEMPEST\nEfforts of certain communications interests to obtain a change in the table of fre¬\nquency allocations agreed upon at the Atlantic City communications conference last\nyear, may have ma.jor repercussions at Geneva and Mexico City communications meetings.\nSome sources indicate ultimate disposition of U.S. High frequencies may be in the\nbalance. A letter from Senators Tobey and McFarland was reported as having been\nsent to the State Department with the admonition that changing the Atlantic City\nagreement might play into the hands of other countries and that governmental and\ngeneral U.S. commercial requirements will be better served by preserving the\nagreements reached last year.\nThe Geneva conference is empowered to recommend a plan of sharing frequency hours\namong various nations._This wi^l determine whether U.S. stations get wider shortwave\nuseage of whether the advantage will go tp point- to point users, maritime, services.\netc."
}