{
  "id": "d1902-17",
  "text": "Membership Lists and New Members\n-13-\nA new and corrected list of N-A-E-B members (now number 31 in 26 states) is being\nsent to all members and directors and will be in the mail in the very near future.\nAll present members are urged to study these lists and also the roster of FCC educa¬\ntional actions in the Newsletter, and to encourage every new aspirant to educational\nradio to join N-A-E-B,\nThis is a particular responsibility of regional directors—and the way this has been\nfulfilled by many of them to date is very gratifying.\nIt is highly important that every broadcasting or producing agency be affiliated\nwith N-A-E-B, not only to strengthen the common cause, but for self-help. In\nthe last three months N-A-E-B headquarters has been able to offer helpful engineer¬\ning advice to two stations in Texas, a station in South Dakota, a station in Kansas,\nand to offer policy advice with respect to the FCC and other matters to stations\nin six other states.\nStation . Costs and Staff\nHarry Skornia, director of radio at Indiana University now reports the study con¬\nducted by George Willeford on educational radio stations is ready for release in\nfinal form. If the cooperating stations voice no objection to its release (and they\nshould not since a variable code conceals individual station identify)we should have\nthe basis for a set of standards on salaries, equipment, and other items for those\nof us now operating stations and those who plan to get into educational broadcasting.\nMembership Processing?????\nEach regional director (regions 1-2-3-4-5-6) should now have in his hands, the appli¬\ncation form for new members. (If any director is without this supply he should con¬\ntact the president’s office immediately). It is suggested the regional director\nshould approach the prospective member with this form, have it filled out, keep\nduplicate records for the regional office, and then forward the original to T. I,\nGriffith, N-A-E-B treasurer, WOI, Ames, Iowa, Griffith will then write the new mem¬\nber, arrange the billing, file the master copy, send copies of his correpondence to\nthe regional director so everyone is informed all around, (Individual members as\nwell as regional directors are urged to write for a supply of these blanks if they\ndo not have them),\nSTATION MANAGERS: PLEASE NOTE AND RESPOND’’’\nN-A-E-B headquarters is compiling complete- sets of data on stations and station cov¬\nerage in two master files—one of which will follow the president’s office from\nlocation to location each year—and the other which will remain in the treasurer’s\nhand s,\nA major aspect of this file is STATION COVERAGE. Fill each of you please furnish\nN-A-E-B headquarters the following information in the form suggestion?\n1, An outline of your primary, secondary, and tertiary, area in millivolts\non a Rand McNally County Outline Map, 8 x 11 size (obtainable at any\nbookstore). Please send two copies of these coverage circles. In case\nyou are directional, please be precise about the contour,\n2, Any data on actual audience you may have in the form of mail-count\nmaps, BMB reports (1946) or any other survey information.\n3, Please also furnish an accurate listing of your call letters, your\npower (day and night), and—if FM—both your rated and effective power,\nand location.\nA ROUGH PRELIMINARY CHECK--THIGH FE RANT TO CONFIRM—FOULD INDICATE N-A-E-B STATIONS\nPOTENTIALLY COULD REACH 16 MILLION PEOPLE WITH PRESENT FACILITIES."
}