{
  "id": "d1902-18",
  "text": "-19-\nN5::s FROM T-EGION I — Regional Director - Seymour Siegel, WNYC. New York City\n(Maine, New York, Connecticut, New Hampshire, Massachusetts, Vermont, Rhode Island,\nPennsylvania, New Jersey, Delaware and Maryland)\nConnecticut\nUniversity of Connecticut’s Ft. Trumbull campus has started a new campus station,\nWRUM (the state’s fifth campus station). It broadcasts nightly Monday through\nThursday. Station manager is Henry Morgan of Stamford.\nMassachusetts\nWorld Wide Broadcasting Foundation, Boston, is applying to FCC for power increase\nof N-A-E-B station, WRUL, for increase to 250,000 watts. Outlet is used by State\nDepartment and United Nations as well as by Foundation.\nNew York\nSyracuse University, N-A-E-B member in Syracuse is operating a new-lower power\nexperimental FM station (VEAR-FM) in connection with radio instruction offered\nat the University, and is instrumental in planning and developing Empire State\n(FM) Network. (Full details to be available in next issue of Newsletter)•\nNew York\nVeteran's Vocational School of the New York State Education Department at Troy is\nconstructing a new FM radio station, operating under a non-commercial, educational\nlicense with 1000 watts. Station manager is William P. Saunders and director is\nGeorge E. Holliday.\nNew Jersey\nN-A-E-B member Rutgers University, acting as ’’home team\" have set up a series of\ndebates with NYU, Columbia University and Hunter College over NUN on Sundays at\n2*.20. Series began March 7.\nNew York\nIn cooperation with N-A-E-B member WNYC the American Book Publishers Council is\npreparing a series of programs about books and authors to be made available to\ninterested stations. Council undertook project to increase circulation via free\nair plugs. Shows are being tape-recorded for WNYC airing.\nMassachusetts\nJunior League of Holyoke has arranged program series concerned with problems-\"\nencountered by parents and pre-school children, titled \"Education Begins in the\nNursery.\" Broadcasts to be aired over WHYN.\nNew York\n\"Americans Town Meeting of the Air\" celebrated its 500th broadcast on March 16\nwhen George V. Denny, moderator, presented Raymond Moley, Norman Thomas, Dr. Leon\nM. Birkhead, and Martin Ebon in a broadcast on \"Which Way America—Facism,\nCommunism, Socialism or Democracy?\""
}