{
  "id": "d1902-20",
  "text": "-21-\nNEWS FROM REGION III - Regional Director - Frank E. Schooley, vlLLt Urbana, Illinois\nTohio, Michigan, Indiana, Illinois and VdsconsinT\nMichigan\nWKAR also reports Michigan State held its Third annual radio conference sponsored\nby the departments of speech, dramatics and radio on March 5. An excellent\nattendance Fas reported with such speakers as Robert Saudek, ABC public service\ndirector jKenBartlett, Dean of Adult Education, Syracuse University (WEAR-FM) ana\nMark Haas, Education director, WJR, Detroit,\nIndiana\nFranklin College, Columbus, Indiana, has completed arrangements with the staff' of\nWCSI-FM for a weekly half-hour segment on Sundays in which they may program any\nmaterial they desire,\nMichigan\nN-A-E-B member station WKAR, Michigan State College, reports construction is pro¬\nceeding on W'KAE-FM. Some delays have ensued because of tardy arrival of equipment\nfrom manufacturers. Michigan State expects its FM station to be in operation by\nlate March, Plan is to run duplicate programs until WKAR (daylight station) goes\noff the air at sunset and then to continue until 10;00 p.m, --ith FM\nWKAR reports increase in requests for mail copies of WKAR program has increased'\nsince October from 9,300 to 16,000 with postcards still coming in. Distribution\nhas ranged from East Lansing, Michigan (WKAR home) as far south as Columbus, Ohio\nand Bloomington, Indiana.\nWisconsin\nN-A-E-B station WHA reports through the State Radio Council of Wisconsin has filed\nwith the FCC an application for its fourth educational FM station. All four\nstations are expected.to be on the air by fall of 1943. VHA-FM went on the air\nMarch 1947. Y.EIAD-FM( Milwaukee) is expected to go on the air March 30. Initially\ndirect-off-the-air-pickup will be used between WHA-FM, University of Wisconsin,\nMadison and*WHAD-FM, Milwaukee,\nOhio\nN-A-E-B member station WOSU, Ohio State University, is producing an unusual series\nof Easter season broadcasts including the complete presentation of the 3-hour long\n\"Passion According to St, Matthew” by Bach, Couperin's Third Tenbrae Service” for\nWednesday of Holy Week, Wagner’s \"Parsifal” and other similar works,\nWOSU, is cutting out an unusually attractive program bulletin from which all RAEB\nmembers could well take hints and suggestions. Station is directed by Robert C,\nHiggy, bulletin edited by William Rounds, and program arranged by William Ewing.\nDr. I, Keith Tyler reports plans for the Ohio Institute for Education by Radio are\nreaching final form. The complete printed programs will soon be available. He.\nurges all interested parties to make room reservation immediately.\nIndiana\nN-A-E-B member,Indiana State Teachers College, at Terre Haute, reports some new\ndevelopments under the able direction of Dr, Clarence M. Morgan, Hoosier School¬\nmaster of the Air”, They are now producing' the seventh in a series of special\nbroadcasts on instrumental appreciation for elementary children. These programs"
}