{
  "id": "d1902-26",
  "text": "-27-\ndirector in place of Dr. W. B. Riley, deceased, the resignation of H. B. Prince\nfrom Board of Directors and the election of Frank Clawson thereto, and add biographi¬\ncal information with respect thereto; accepted said amendment.\nFHA- State of Wisconsin. Madison, rise. - Granted authority to take depositions at\nOregon, Ill., on February 21, in re application in Docket 8043? et al.\nFMPC - The Liberty Street Gospel Church of Lapeer, Lapeer. Mich. - Granted petition\nfor leave to .amend its application (bML-1271; Docket 8632) to specify as hours of\noperation 9 h.m. to 10:30 p.m., daily except Saturday, instead of unlimited time,\nexcept Saturday.\n830 KC - Special Service Authorization\nFNYC - City of Mew York, Municipal Broadcasting System New York City - Granted\nspecial service authorization to operate from 6 a„m. to 10 p.m., EST, for a period\nof 6 months from March 2, subject to same terms and conditions as previous grants.\n(BSSA-1S1)\n640 KC - Temporary Authorization\nFQI - Iowa State College. Ames. Iowa - Granted temporary authority to broadcast\nNinetieth Anniversary Ceremonies of the College and address b? Senator Bourke B.\nHickenlooper, March 20 and High School Basketball Tournament, March 17-18-19-20\n(7:15-10:00 p.m.)\nACTIONS (FREQUENCY MODPLATION) COLLEGE AND UNIVERSITY\nI'M Construction Permits\nKAMT - Agricultural and Mechanical College of Texas. College Station Texas, Clas s. A;\n98.3 me., (Channel 252); 210 watts; 270”feet. IbMPH-1206)\nGranted License\nY.TIA-FM - State of Wisconsin. State Radio Council. Madison. Wisconsin - Granted\nlicense for new non-commercial educational station (BLFS-2o77\nGranted CP Modification\nKOKH - The Board of Education of the City of Oklahoma City. Okla. - Granted modifi¬\ncation of CP to change studio and transmitter sites and changes in antenna system,\nand completion date to be 7-21-46 (BMPED-108),\nGranted Cp Modification\nHALF - San i rancisco. Calif..- Granted modification of CP for extension of comple¬\ntion date to 5-10-48'. IbMPED-91) .\nGranted Further Hearing\nFriday, March 5 — Further Hearing, 10:00 a.m. - NEF - School of Radio Arts,\nBeverly Hills. Calif. - For FM facilities,\nNET - Veterans Vocational School, Troy. N.Y. (P.O., Corner of Seventh Avenue and\nBroadway)' - Construction permit for a new FM broadcast station, non-commercial\neducational to be operated on Channel #211, 90.1 me,, with operating power of 1 KW."
}