{
  "id": "d1902-27",
  "text": "Granted Continuance of Hearing\nNorthwestern Theological Seminary and Bible Training School, Minneapolis, Jligiu -\nGranted petition for continuance of hearing now scheduled for Feb. 25 to April 28\nin re its applications and FM stations (Dockets 7922 and 7923).\nTELEVISION APPLICATIONS\nKEY' - The State University of Iowa, Iowa City (P.Q.. Iowa Cityl - Construction\npermit for a new commercial television broadcast station to be operated on\nChannel #11, 198-204 me., ERP of visual 32,26 W, aural 16.13 KIV, and unlimited\nhours of operation.\nREINSTATEMENT - Y.rQXBV - Kansas College of Agriculture and Applied Science,..Mqnr\nhattan - License to cover construction permit (BFVB-227) which authorized rein¬\nstatement of construction permit.\n*** **#\nRADIO IN SCHOOLS\nThe increased use of radio in Iowa schools raises the question of how much of the\nteacher’s job it will take over. Four frequency modulation stations are broad¬\ncasting in Iowa and construction permits have been approved by the Federal Communi¬\ncations Commission for 23 more. Counting the 33 standard stations now operating,\na total of about 56 radio stations may be operating in Iowa in the near future.\nVirginia Peterson, Y/riting in the Iowa State Education Association magazine, says\na recent survey at Iov/a State College showed that 27 of the 34 schools in towns\nover five-thousand have radio receivers for class use. The survey showed a con¬\nsiderable difference as to the use of the radio. But it indicated that music,\nsocial science, speech and vocational guidance classes are being aired over the\nradio.\nIn the same article. Richard Hull. The Director of N-A-E-B JftatiqnJOI, atjowa\nState College, said most radio people and educators agree that radio_dqe_s_not_dq\nan effective job of direct teaching. However, they vouch_j^J:ts^acQ^s^jteach-\ning aid. Thev also believe that as a potent social force in forming .public-^opinion,\nradio has no \"equal. Hull concludes that radio, like other teaching aids,,..places\ngreater responsibility on teachers for fitting programs effectively. intq_^e^eaching\nurogram.\n\"The ether is a public medium and its use must be for the public\nbenefit. The use of radio channels is justified only if there\nis public benefit. The dominant element for consideration in\nthe radio field is, and always will be, the great body of the\nlistening public, millions in number, countrywide in distribution”\n— Herbert Hoover^As Secretary of\nCommerce)"
}