{
  "id": "d779-112",
  "text": "NAEB RADIO NETWORK\nCh£\n14 Gregory Hall\nUrbana, Illinois\nTO: ALL NETWORK MEMBERS\nFROM: NETWORK MANAGER\nRE: PROPOSAL TO END TAPE INVENTORY PROBLEMS\nThe Network policies governing tape returns will provide an effective\nmethod of bookkeeping on future tape returns. However, it is necessary\nthat the Network and each member station arrive at a mutually satisfactory\nfigure of tapes owed upon which to base all future records.\nTherefore, the Network proposes that the following steps be taken to\nalleviate the vexing problem of tapes owed:\n1. Each station will have its traffic department forward\nto the Network a listing of the tapes it still has from\nthe regular Network offerings of Issue #I, 1956 through\nIssue #50, 1956 inclusive as of 11:59 P.M. Saturday,\nDecember 8, 1956.\n2. Each station will have its traffic department forward\nto the Network a listing of the tapes it still has from\nthe 1956 In-School offering and the 1957 In-School of¬\nfering as of 11:59 P.M. Saturday, December 8, 1956.\n3. The total of these two figures will be used as the basis\nfor all Network shipment records (both in and out) begin¬\nning with Issue #51, 1956. Thus both the Network and each\nstation will have the same tape inventory figure as of\nDecember 8, 1956, and all future questions on this matter\ncan be traced quickly.\nSince the release date of Issue #50 is December 9, all stations should\nhave the tapes for that release on December 8. Therefore, when you\nmake your listing include the tapes that you have received for Issue\n#50. Do not include the tapes you may have received for Issue #51.\nDo list all other tapes retained from Issue #1 through Issue #50, 1956.\nAlso, and this is important, send with your listings the number of tapes\nyou have mailed to the Network during the two (2) weeks prior to December\n8 and the date of each jailing. All tapes mailed to the Network on or\nbefore December 8 will be considered as returned when they arrive here;"
}