{
  "id": "d779-2",
  "text": "(NAEB Network Int&rin Report 4*3-54)\n~3~**\nthat formal submission procedures be followed, and we believe that soon all\n* submitters will recognise the use of these forms as necessary and standard.\nThe In-School Subcommittee and Network Ebadquarters have collaborated in the\ndevising of a Submission Form specially suited to the In-Scshool Program\nCommittee* s needs.\n8. Copies of a Program Evaluation Forms were distributed to all stations early\nin January. Copies ware to be returned to be routed to the In-School Pro¬\ngram and Network Acceptance Caanittses, to the originating stations, and to\nNetwork Beoord files. The return of these forms has been disappointingly\nlight. More disappointing were the •evaluations.® With a few exceptions,\nthe completed forms offered nothing constructive, merely offering such one-\nword cccments as: \"Good,* •Poor,” or •Fine.® We are not sure this project\nis worth continuing.\n9. An Engineering Committee report .designed to help improve the quality of\nmasters of Network tapes was requested and received by the Network. Pre¬\npared by Carl Manser, it will be distributed, if possible, with the next\nNewsletter as Engineering Committee Report No. 6.\n10. Several brands of magnetic tape have been sent to the Engineering Committee\nfor testing with a view to their future use by the Network.\n11. Procedures involving relations with the Program Acceptance and In-School Pro¬\ngram Committees have, as implied above, been fairly well worked out, though\nby no means all questions have been answered; nor should any answer be re¬\ngarded as final and absolute. But perhaps this aspect of the operation can\nmere properly be discussed in Coranittee reports. From the Headquarters point\nof view, the important points ares that advances have been made, and much\ncredit should go to active committeemen who have worked hard to collaborate\nwith Headquarters; that more effective institutionalisation of procedures\ndeveloped remains to be made.\n12. The officers and board have been sent copies of correspondence regarding a\npossible arrangement with the NPAC-Kellogg Project. The negotiations are\nbeing continued at present."
}