{
  "id": "d779-93",
  "text": "227 Gregory Hall\nUrbana, Illinois\nNovember 1, 1954\nDear NAEBers:\nThis is the speech I would have presented had I been in New York last Saturday.\n(Actually I wouldn’t have because I’m no good at speeches).\nYou make me most humble. There is nothing that I have ever done for the NAEB\nwhich deserves the hono? you have bestowed upon me. There are others who could serve\nbetter, I’m sure. However, now as always, I’m most willing to do what I am called\nupon to do for the good of NAEB, and I consider that for the good of all educational\nbroadcasting. I’m most grateful to you for expressing such confidence in me.\nBut enough of the present. Let’s look and work toward the future.\nOrganizationally, I recognize that we have many problems that we must solve.\nThis we will work toward during the year. And, when solutions are reached, they’ll\nbe with your help, and they'll be your decisions.\nThere are problems in the total educational broadcasting area, too. NAEB must\nwork toward the common goal in providing leadership, in giving help where help is\nneeded, and make of eduoational radio and television the instrument in the education\nof men and women, boys and girls in our modern society. We must always remember\nthat radio and television are only tools which have a great potential for good in\nthe educational process. How we use them, and if we are to use them effectively,\nis our responsibility. We must not shirk.\nMay I say one thing or two about my philosophy of radio and television in the\nUnited States. I'd like to say it so that there can be no misunderstanding of my\nthoughts on such matters. I am a firm believer in the American system of broad¬\ncasting. I believe in the system we have, with commercial radio and television\nproviding a program fare that is supported by the advertising revenues. Many have\nmade great contributions in educational and public service programming. I have\nmany, many friends in commercial broadcasting. But when I say I believe in the\nAmerican system, I believe in the educational radio and television stations too.\nWe’ve had radio stations in operation since the early twenties. We have now educa¬\ntional television stations on the air. More will come. These have a unique service\nto perform. These can perform a supplementary service that commercial radio and\ntelevision cannot, and does not perform. We must utilize our intelligence and\nefforts to make our service significant in the educational process within our\ninstitutions.\nSo, I say again. I accept your wishes with humility, with deep gratitude.\nWith your help, with the other officers elected, I shall give you my greatest\nenergies to serve you — in NAEB.\nSincerely,\nFES s jy Pre sident"
}