{
  "id": "d779-98",
  "text": "NAEB NETWORK\n14 Gregory Hall\nUrbana, Illinois\nNovember 22, 1954\nMemo:\nTO: Active and Associate Members\nFROM: Network Headquarters\nRE: 1. Return of NAEB Alignment Tapes\n2. Sources of Alignment Tapes\n1. A number of NAEB-owned alignment tapes have been sent to NAEB members and have\nnot yet been returned. Therefore NAEB Network Headquarters cannot honor requests\nfor the use of these tapes. If you have one of these tapes, will you please return\nit to Headquarters at your very earliest convenience. For purposes of identification,\nmay we remind you that the tapes were packaged in circular tin cans, about 5 l/4,f\nin diameter, bearing the blue-on-white label of the L. S. Toogood Recording Company\nof Chicago, Illinois.\n2. As most of you know, an alignment tape is essential to the best use of a tape\nrecorder. Its cost is but the merest fraction of the cost of any recorder, yet its\nuse, especially after returning a machine from a demote11 recording job, is almost\nmandatory for producing good recordings. Actually, an alignment tape should be\nregarded as basic equipment for any person or organization producing professional-\nquality recordings.\nNevertheless, many of us seem to have overlooked this necessary piece of equip¬\nment, and the NAEB Network Headquarters urges and advises you to see that you have\none. You will find it very helpful in producing good recordings, especially if the\nrecordings are played on any other machine than that on which they are made. With\nsuch a tape you can be sure that the heads on both machines have the same proper\nalignment.\nThis matter of proper alignment is, of course, especially important in a tape\nnetwork operation. Every tape which is received for duplication at the NAEB Network\nHeadquarters is checked for alignment, and, in so far as possible, compensation is\nmade for mis-alignment when the duplication master is made from the original. But\nthere is no substitute for correct alignment on the original recording.\nFor your convenience, there are listed below four firms which make these tapes.\nThe listing is alphabetical and the descriptive material is quoted from the manu¬\nfacturers. No endorsement of any particular tape by the NAEB is implied."
}