{
  "id": "d1574-10",
  "text": "CHICAGO TELEVISION SERIES PROVIDES .HEWF SCHOOLHSOIMJNITY LINK\nInaugurated on Maiy it, the new public school television program* ’’This Week in Our\nPublic Schools*” puts Chicago area televiewers in touch with student and faculty\nactivities throughout the system*\nThe program was carried by Station WBKB Sunday afternoons from 2jl£ to 2:30* It was\nproduced by the Division of Radio and Television in the Department of Instruction and\nGuidance of the Chicago Public Schools*\nWide School Coverage\nRecent programs covered the Annual Bird House Building Competition* sponsored by the\nDivision of Industrial Arts5 the dedication of the Burbank School for Crippled\nChildren; the awarding of scholarships at the Civic Asseirbly during Youth Week; the\nScience Fair, staged by the Chicago Public High School Physics Teachers* Association\nat the Chicago Museum of Science and Industry; and many other events such as activi¬\nties in the divisions of art, music, physical education and ROTC*\nIn addition to keeping the public informed about current school events and develop¬\nments, the program also ssrved a useful function in releasing publicity related **>\nschool needs, such as the drive for teacher recruitment, and to special study oppor¬\ntunities, such as the practical nurse training program and the Jones Commercial High\nSchool business training courses*\nMany Steps in Production\nUsing a newsreel technique, motion pictures of school events were shot, if possible,\non Mondays, Tuesdays and Wednesdays* The film wasprocessed on Thursdays* The first\nscreening of the cut and edited film took place Frida/ mornings*\nAt the first screening a rough commentary was written, students’ and teachers* names\nattached to the correct sequence, and essential facts made into a story* On Friday\nafternoon the film was again projected on screen, and the continuity or commentary\nspoken along with it for timing* f\nOn Sunday, the program was part ”live” and part film* The narrator watched the film\non a monitor, and spoke the prepared continutiy before a microphone. This made for\na flexible type of program* Music and sound effects could also be added during the\ntelecasting of the film*\nThe audience saw and heard the telecast as a unified whole, scarcely realizing that\nfilm and speech or sound were being synchronized as the film unrolled.\nChicago Vocational School Radio\nChicago Vocational School students constructed their own amateur short-wave radio\nstation W9LBB from discarded FM equipment from the Board of Education radio station\nWBEZ. The station is operated fcy the radio club and by students in radio shop*\nW9LBB is a link in the Medical Unit of Communication Network of the Civil Defense\nProgram, and its voice has even been heard by the Occupation Forces in Tokyo. It is\non the air from seven to nine-thirty, Monday and Wednesday evenings, and various times\nduring the day* ‘\n’’The station broadens student interest in national and world affairs, provides ex¬\ncellent technical training (eleven students have become licensed short-wave station\noperators), and has brought a general improvement in student habits of speech,” re¬\nports James W* Crowe, Director."
}