{
  "id": "d1574-12",
  "text": "-\nSURVEY REVEALS TV IMPACT ON YOUNGSTERS ... ^.., 1\nTelevision programming is contributing materially to the nervousness or ’'restlessness1\n— of children in Los Angeles, according to a study of 2,000 six-year-olds conducted by\nProfessor Hal Evry for Woodbury .College* 'The survey, released in April, indicates\nthat television is also a direct influence on the eating, sleeping, and playing\nhabits of the youngsters#\nMore than half of child .viewers reported that they dreamed about the programs they\nwatched# Twenty-five per cent of these said their dreams were \"bad#” Seven out of\nten youngsters in TV homes said they watched television while eating# 'Two out of\nthree said they would rather watch TV than play outside.\nThe purpose of Professor Evry’s study, which was based on personal interviews of\nchildren by teachers in Los Angeles County public and parochial schools, was to\ndetermine the effects of radio and television on six-year-olds.\nSurvey. Percentage Breakdown\nThe results showed that in TV homes: (1) 82.1*$ watch TV every day; (2) 30.0$ watch\nat least six programs daily; (3) 62$ would rather watch TV than play outside; (10\n67.3$ ask their mothers to buy things advertised on TV; (5) U7.2$ sing advertising\nsongs they hear on television; (6) El$ never read any books except schoolbooks;\n(7) 62$ talk to their playmates about TV programs; (8) are in bed by eight\no'clock; (9) 33#3$ are considered restless by their teachers#\nThe study showed that television has a much greater impact than radio on child\naudiences. For example, while 33*3$ of the children in TV homes were considered to\nbe restless by their teachers, only 17*2$ of radio-home children had this character¬\nistic# Only 28$ of the radio-home children ask their parents to buy advertised pro¬\nducts. (67.3$ for TV).\nTV Affects Play\nPlaying habits showed the most difference between the influence of the two media: 88$\nof all radio-home children would rather play outside than listen to radio; only one\nof three TV home children would rather play outside than watch TV programs# Ninety\nper cent of radio home children are in bed by eight p. m* (15% for TV)#\nThe study reveals that 59.3$ of the TV-home children are sometimes scared by the\nprograms they watch; only one in four of the radio-home children are frightened by\nradio programs. The children listed murders, shootings, nysteries and ghosts as\nthe causes of their fright.\nThe survey is the latest in the series of studies of TV's influence on the public\nwhich Professor Evry has directed for Woodbury College.\nUNIVERSITY OF OMAHA BEGINS TV COURSE SERIES\nThe University of Omaha has inaugurated a series of six-week televised courses over\nStation KMTV. Quarter-hour classes are offered Mbnday through Friday in which two\nhours credit may be earned through the School of Adult Education. First course of¬\nfered will be \"Six Views of Life,\" covering the peak eras in Western Civilization,\nby Dr. Wilfred Payne, Chairman of the Humanities Department. Owen Saddler, Station\nManager said the station has reserved a minimum of 52.weeks for the series#\nLIKE SMDRGASBORBS? THERE'LL BE ONE AT THE NAEB CONVENTION IN MINNESOTA"
}