{
  "id": "d1574-15",
  "text": "• 16 -\nWSB-TV AND WABE COOPERATE TO TELEVISE ATLANTA CLASSROOMS• OF WABE\n\"Candid Classroom,\" a ten-program series of telecasts, was conpleted in May over\nWSB-TV in Atlanta with the cooperation of WABE, the Atlanta Board of Education radio\nstation. Haskell Boyter and Alvin M. Gaines, director arid program director respect¬\nively of WABE, acted as consultants for the Atlanta Board of Education.\nThe pro grans were televised from different schools each week and they attempted to\nshow citizens in the community exactly what happens in the classrooms from kinder¬\ngarten through the seventh grade* Only three of the programs showed assembly or\nculminating activities; the other seven were concerned with actual classroom work.\nArt, science, reading, human relations, utilization of a radio program and literature\nwere the focal points of the latter. The contribution of the Negro to American life\nwas the subject of a program from a Negro elementaiy school. ‘\nThe programs were successful enough to warrant consideration of a second series next\nfaii. „\nILLINOIS TO FILE APPLICATION\nThe Board of Trustees of the University of Illinois recently authorized its corporate\nofficers to file an application with the FCC for station operation on Channel 12.\nChannel 12 is assigned to the Urbana-Champaign area for educational use.\nIN-SCHOOL CONFERENCE AT WO I-TV\nRecognizing that educational television can be further utilized as a supplement to\nregular academic work, school superintendents from throughout the State of Iowa net\nJune 9 at the WOI-TV studios in Ames to consider methods of further coordinating\ntelevision and school activities.\nThe conference was sponsored jointly by the Iowa State Department of Public Instruc¬\ntion and WOI-TV, the Iowa State College television station.\nSpeakers at the meeting, at which 100 superintendents were registered, included\nFranklin Dunham, Chief of Radio-Television for the U. S. Office of Education$ Martha\nGable, Assistant School Relations Director for the Philadelphia Public Schools; and\nRichard B. Hull, Radio-TV Director at Iowa State College*\nThe superintendents and representatives from the three Iowa schools of higher educa¬\ntion — Iowa State Teachers College, the University of Iowa; and Iowa State College\n— formed panels for the afternoon discussion. During the meeting they pledged their\nsupport for an in-school viewing program plan, and agreed to appoint a working com¬\nmittee to investigate program possibilities immediately.\nQuestionnaires were distributed by the Department of Public Instruction which will\nenable that department to tabulate the anticipated needs of educators in educational\nfields* Results are being recorded in the Department's office, and will be made\navailable in the near future.\nHull, in outlining WOI-TV's part in serving the schools of the state, offered the\neducators the complete cooperation of the station, the facilities and the special\ntime needed to organize a well-rounded, in-school viewing television operation.\nANY QUESTIONS ABOUT GETTING INTO TV?\nASK THE EXTORTS AT THE CONVENTION"
}