{
  "id": "d1574-16",
  "text": "RESEARCH REPORT\nby Dallas Smythe\nNAEB Director of Studies\nUniversity of Illinois, Urbana\nA nunfoer of months ago there was made available to you a panphlet, \"Building Audi¬\nences for Educational Radio Programs,\" by Professor; Charles H. Sandage, University\nof Illinois. Quite possibly in the rush of subsequent events this report may have\nslipped into your \"hold\" basket, Vfy purpose this month is to review this report and\nrefresh your memory about it.\nProfessor Sandage's report deals with an experiment. The purpose of the experiment\nwas (1) to determine whether listenership to educational radio programs can be in¬\ncreased by means of promotion, and (2) to measure the relative effectiveness of dif¬\nferent kinds of promotion.\nThe procedure was to use a fixed panel of persons in Champaign County, Illinois, and\nthe facilities of station WILL. The sample was selected on a modified random basis,\nwith separate strata for urban, village, and farm listeners. Area sampling was used\nin selection of respondents. On the initial interview respondents who agreed to co¬\noperate were supplied with diary forms for each member of the family, and a personal\ndata sheet was filled in concerning each member of the family. The diary form called\nfor recording the times (by 15 minute intervals) when the individual respondent lis¬\ntened to radio programs, with the call letters of the stations being written down\nagainst the tirre period. Respondents were instructed that the survey was being con¬\nducted by the Institute of Communications Research, University of Illinois, that the\nsponsors of the study were not interested in any particular station, and that faith¬\nful reporting of non-listening w ould be equally as useful as reports on listening.\nOne week's diaries were collected before promotion of Will programs began. After\nthese diaries had been returned, selected WILL programs were promoted in the county.\nAdditional promotion took place between the second and third diary-keeping periods so\nthat a measure was obtained of sustained effects from the earlier promotion. The\nsanple used in the tabulations included 359 families all members of which filled in\nall four diaries, out of a total of 678 families which kept the first diary. Sandage\nstates that while \"this sanple is not sufficiently large to be highly s ensitive to\ngeneral mass promotional efforts where such promotion does not penetrate the great\nmajority of homes,\" it is however \"adequate to measure the influence of promotion\nknown to have penetrated the home.\"\nThe programs selected for promotional effort were regarded as \"strictly educational\nor ‘highbrow1They were:\n\"FOR YOU AT HOME\" — a homemaker's program, 9:00 to 9:30 a. m., five days a week,\ncontaining news, information of direct interest to homemakers and occasional music.\n\"POPS CONCERT\" - Serai-classical and light ops ratio music by Romberg, Herbert, and\nGershwin, etc., from 10:30 to 11:00 a. ra. seven days a week.\n\"THE CHAMBER MUSIC HOUR\" - \"Heavy music\" by Haydn, Bach, Brahms, Beethoven, Mozart,\nand Debussy, from 11:00 to 11:1:5 a. m. four days a week, Monday, Wednesday, Friday\nand Saturday.\n\"COMPARATIVE LITERATURE\" - A classroom lecture and discussion in comparative litera¬\nture from 11:00 to lltU5 a. m. Tuesday and Thursday."
}