{
  "id": "d1574-18",
  "text": "19\nr\nIt would be inpossible to reproduce here all the significant findings in this report*\nThese, however, will illustrate the magnitude of the observed results of promotion.\nProfessor Sandage concludes that careful and systematic promotion of educational\nprograms can substantially increase both the number of listeners and the amount of\nlistening. Moreover, he finds that detailed and specific promotion is more effective\nthan general promotion; direct mail was more effective than distribution through\nother channels.\nWe recommend that you read the report carefully and consider whe ther you would achieve\nsimilar results from similar promotional efforts in your station. The quantitative\nevidence which Professor. Sandage presents is most impressive. I would want, however,\nto have much more evidence of different kinds than here presented before accepting\nall of his first three conclusions, (see p* 38).\nTHE NAEB TAPE NETWORK\nPrepared by Richard Rider\nNAEB Tape Network Manager\nUniversity of Illinois, Urbana\nBY WAY OF GOOD BYE\nAs this is being read your network manager for the past eighteen months will be mov¬\ning on to a new job. Effective July 1, I will be leaving the network to help in the\ndevelopment of television at the University of Illinois.\nMay I say that this has been a most interesting and stimulating experience. The co¬\noperation I have received from all of you has been wonderful. I know that you will\ncontinue your fine help in working with my successor, John Holt, and the rest of the\nnetwork staff.\nWhile the past months have been hectic and filled with crises, they constitute a\nperiod of real achievement. Let me quote from the last page of the report just sub¬\nmitted to the Kellogg Foundation.\n«The NAEB Tape Network has achieved a position of eminence in the field of educational\nbroadcasting. It is now enjoying a national, and even an international reputation.\nIt is supplying a significant program service to the vast majority of non-commercial\neducational stations in the United States. It is providing the residents of the\nmajor population centers with a truly alternative radio service. Program resources\nare maturing and developing at a most encouraging rate. National organizations,\ngovernmental agencies, foreign governments, international organizations, and private\npublic service groups are now exercising the initiative in providing programs for the\nnetwork. In the fall of 1952 the network will begin the distribution of programs\nproduced under a grant from the Fund for Adult Education. Plans are developing for\nextensive cooperative program production by member stations. In view of all of this,\nit is inpossible to look upon the future of the tape network with anything but en¬\nthusiastic optimism. *'\nIt is genuinely satisfying to be able to make such a statement with sincerity. The\nfuture of the network is indeed bright. I look forward to the day when I can be a\npart of a similar service for educational television stations.\nBest wishes, and I will be seeing youi\nYOUR NAEB FRIENDS WILL ALL BE AT THE CONVENTION IN NOVEMBER"
}