{
  "id": "d1574-20",
  "text": "- 21 -\nThe following are professional people! Performers, Transmitter engineer. Director,\nTechnical director#\nAll of which proves not much of anything. Except this one thing....that a lot of\npeople are involved in getting a television program on the air. Many °* folks\nlisted in the second category above could be college students with experience and\nsome special training#\nTV Shows Take Time\nThe second point X wish to make in this short report is that when the ^i result is\nseen on the television screen one wonders how and why the whole thing took so muc\ntime. A case in point. At WOI-TV we are doing thirteen programs about the state\ninstitutions under the Board of Control. These are penal, corrective, children s\nand mental. The prelindnaiy conversations with the chairman of that board took place\nlast fall. The show got on the road the first week in May. In between fall and\nspring these things took place:\na# A script writer was hired by the Board.\nb. A producer was assigned by the station. / ..\nc# The puipose and philosophy of the series was settled (not a light\nmatter, one that took much talk)# # .\nd. The producer spent three months, almost full time, xilming\nsequences inside the institutions#\nThe staffing we gave the show was a bare minimum! a writer and producer. When the\nprograms were ready for the air a director was assigned, sets were made, and bli the\nusual details of production were taken care of. The point here, however, is that it\nwas a long way from idea to image on the screen.\nOne final remark about the Magic Window. Last fall I made a careful survey of the\nman hours spent in getting that show on the air. Taking into account planning, re\nhearsal and performance, I found this simple, three-a-week chiMren's program ate up\na total of 133 man hours each week. If you wish to divide this figure by the stand\nard college work week of UU hours you find three full time people giving their whole\nweek to one show. But let's get back to the really slgmficant.number....Ig peffllg.\nneeded to put a local show on the air. There is nothing magic in the nunber, but\nneither can you get a TV program on the air by magic.\nThere it is, brothers in the faith. Keep your lenses uncapped but don't get a raster\nbum. We shall all die young...but think what beautiful corpses we will make.\nIN THIS ISSUE\nFoundation Grants and Special Projects#...\nNAEB Radio Developments...........\nEducational Television Developments.*..\nResearch Report — Dallas Smythe#.••••»••••••••••#•••<\nNAEB Tape Network — Richard Rider#...-\nLive Show TV Personnel Requirements — Edward Wegener,\n1 - h\n$ - 9\n,9-16\n,17 - 19\n19\n,20 - 21"
}