{
  "id": "d1574-8",
  "text": "- 9\nU» OF UTAH PRODUCING 9 SHOWS FOE STATEWIDE AIRING ,\nThe University of Utah is now presenting nine cultural and educational programs — _\nsome already well-known,son© new — to the radio listeners and television viewers of\nthe state. Broadcast through the facilities of cooperative radio and television sta¬\ntions throughout Utah, these programs produced by Uiiversity faculty menbers and\nstudents are making the knowledge and facilities of the University more widely avail¬\nable to the public* *\nThe purposes in the development of University of Utah radio and television activities\nare* (1) to prorate a type of public service programs which would not ordinarily orig-\ninate in local Commercial stations and which the University is uniquely qualified to\nproduce5 (2) to present educational programs useful in the home, school and community;\nand (3) to bring the University and the community into closer relationship*\nSeveral programs, such as the television class which offers viewers college credit,\nchange in subject matter from time to time* Many of the presentations, though of\ngeneral interest, ^provide school teachers with valuable supplementary material for\nstudent assignments*\nEDUCATIONAL TELEVISION DEVELOPMENTS\nWALKER URGES \"PROMPT ACTION\" FOR EDUCATIONAL TV APPLICATIONS\nSpeaking before a two day conference on educational television held recently at the\nUniversity of North Carolina, FCC Chairman, Paul A. Walker warned educational insti¬\ntutions that channel reservations will not be reserved indefinitely. He pointed out\nthat after June 2nd, 1S£3> the FCC can reassign educational channels to commercial\ninterests*\n\"By the first of July,\" said Walker, \"when the Commission starts processing applica¬\ntions, we expect to have 1000 applications on hand. This demand for assignments has,\nin fact, been so intense that the Commission deemed it proper to attach a most inpor-\ntant limitation,to its reservation of educational channels* That lirltation is that\nif the circunptances warrant it, the Commission may, at the end of one year, or there¬\nafter, change a non-commercial educational assignment to a commercial assignment, iqx\neducators must understand that these precious television assignments cannot be re¬\nserved for you indefinitely.\"\n20 Groups Ready Application Plans\nWalker also reported on the progress made by educational groups. He said that some\n20 schools or groups have already made plans to file applications# These includes\nOhio State University, University of Illinois, University of Michigan, Michigan\nState College, University of Wisconsin, University of Iowa, University of Kansas,\n* Kansas State College, University of Connecticut, Rugers, University of Houston, and\neducational groups in Los Angeles, Detroit, Chicago, St. Louis, Pittsburgh, Mil-*\nwaukee, San Francisco, and Wichita.\nWalker also stated* \"In these days of rising costs in education, television can come\nto your rescue as the most economical teaching tool ever devised. ..raasuring your\nexpenditures in terms of educational results, you cannot find a more economical\ninvestment than television*\nA state-wide network of educational channels for North Carolina (where 8 educational\nchannels have been reserved by the FCC) with kinescope links between this network and\nother state networks, was envisioned by Walker in his address."
}