{
  "id": "d1574-9",
  "text": "-10 -\nWISCONSIN MAKES STRIDES TOWARD STATE TV NET\nThe Board of Regents of the University of Wisconsin voted recently to ask the 1953\nlegislature for $100,000 to construct a closed circuit educational TV laboratory on\nthe Madison campus*\nGovernor Walter Kohler designated the State Radio Council as the agency to handle all\nstate TV interests*\nA newly formed Wisconsin Citizens Committee for Educational Television recently\nvoted to request the FCC to reconsider its allocations plan and assign VHF instead\nof UHF channels to Madison, LaCrosse, Eau Claire, Wausau and Green Bay*\n/Ed, note: Commercial TV interests (WISC) in Madison also favor VHF for the educa¬\ntional station in Madison, thus leaving UHF in Madison completely commercial*/\nThe television laboratory requested by the Board of Regents would permit the Uni¬\nversity to experiment with TV techniques, record programs via kinescope and telecast\nthem over commercial TV stations*\nMcCarty Cites Costs\nProf, Harold B. JfcCarty, director of the State Radio Council, presented cost data to\nthe regents at their meeting* He said that it would cost approximately $200,000 to\nset up a station in Madison; a state-wide educational TV net with 12 stations would\ncost about $3,000,000* The stations would be connected by micro-wave relays* Be¬\ncause of the one year limit on reservations, McCarty suggested that stations at Jfedi-\nson and Milwaukee be constructed to show the FCC that the state means to go ahead\nwith future plans for the state-wide network* The network, according to Professor\nMcCarty, should operate from four to six hours daily* While he admitted that costs\nare high in TV, he pointed out that TV is still \"one of the most economical teaching\ntools\" available*\nCitizens Committee\nIn its unanimous vote to request the FCC to reconsider its allocation of UHF channels\nfor non-commercial educational use in 5 cities, the Wisconsin State Citizens Commit¬\ntee for Educational Television was backed up by the State Radio Council* The latter\npointed out that VHF would give greater coverage, for one thing, and that the use of\nVHF for the state-wide network would result in a reduction in the number of trans¬\nmitters needed to cover the state*\nMs re than twenty-five well established and well-known organizations, including farm\ngroups, cooperatives, business and labor organizations, and better government and ■\neducational groups are represented in the Citizens Committee.\nWESTERN RESERVE SURVEYS TELECOURSES\nA report Recently made ty Dr. Eleroy L. Stromberg, Chairman of the Department of\nPsychology at Western Reserve University, conparesthe educational results of credit\ncourses given by television to those of the regular campus courses. Basing his study\nupon the results of a course in introductory psychology which he offered last fall\nover Station WEWS in Cleveland, Dr. Stromberg found that students enrolled for home\nstudy by television who couple ted the course work were superior as a group to the\ncampus students. He discovered too that a high percentage of* the telecourse students\ncouple ted the course. The same final examination was given to telecourse students\nand to campus students* The median score for 1200 students who had previously taken\nthe examination after completing campus classes was the median for the telecourse\nstudents was 67."
}