{
  "id": "d1750-2",
  "text": "be among its features in coming months? There\nshould be at least 2,000 members. We’re not up to\nthat yet, but let’s try. It’s your NAEB.\nThis brings me to another development. Many\nserious concerns about what we are doing, and should\nbe doing, were expressed in the NAEB Board meet¬\nings. How to become more responsive to the needs\nof community TV stations, for example, was one\nquestion. With so many demands for service, far\nbeyond the staff’s ability to meet, what long-range\nchanges are necessary in the organization? These\nand many other things are on the agenda for a\nspecial meeting of Board members, officers and sever¬\nal committee chairmen. This meeting will undoubt¬\nedly be in session when you receive this.\nWe are, to be frank about it, engaging in frank\nself-appraisal. We need to remain dynamic. We need\nto meet the demands made on us by changing times.\nSuch is the situation as we approach the new year.\nI think this is encouraging. And remember, as I’ve\nsaid many times, we can use every good idea any\none of you has to contribute — however blunt —\nhowever much you have hesitated to mention it be¬\nfore. So, if you have ideas on how to make the NAEB\nbetter, stronger and more useful, not only to you\nbut to the nation generally, please send them along.\nNow, I come to something fairly controversial. It\nhas been suggested that your President and I, in\nour columns, devote less time to our travels. I wish\nto remain responsive to this suggestion and remain\nresponsive also to even more people who say they\nthink I should “share ideas” picked up on such\ntravels.\nTherefore, I shall restrict myself to saying that\nafter the Convention while at the Conference of the\nNational Commission for UNESCO at San Francisco;\nand while at the annual Convention of the Adult\nEducation Assn, combined with the meeting of the\nNational Assn, of Public School Adult Educators\n(to which I spoke) in San Diego, I picked up several\nideas that I give you as thought starters:\n\"It's disciplined ferment that gives life to grape juice.\" One\nspeaker was referred to as \"a meritorious hell-raiser.\" Mrs.\nRoosevelt was quoted as saying educators must \"comfort the\ndisturbed and disturb the comfortable.\" What is our role in the\nface of growing public affairs apathy? How can we meet the\nfears and reservations of our boards and yet assume that re¬\nsponsibility which sometimes gets us into controversy? (I was\nrecently moved to write Jack Gould of the New York Times to\napplaud his column on educational TV's responsibility to face\nup to this need). \"Conflict is the stuff of progress. It causes\nproblem solving. We need to train people how to meet,\nhandle and capitalize on controversy within democratic frame-\n. works.\" \"We must use (and help shape) our cultural system, not\nmerely \"adjust\" to it.\"\n\"More education is needed even by the factory worker —\nHe has to be highly adjustable, learning new skills to meet\nrapid changes in machines, technological developments and\nresidence.\"\n\"Mass media are causing people to dress alike, have homes\nalike, talk alike, and think alike.\" How do we help counteract the\nstereotypes in people's heads?\nThe individual is called on to make decisions about hundreds\nof things he doesn't even understand\" — What is our re¬\nsponsibility to help explain, simplify and clarify the issues on\nwhich responsible citizens must have informed attitudes and\ntake action? If they don't take such action, we may lose our\nliberties to \"those who know about\" such things.\nSeveral speakers (rion-NAEB, non broadcasters) severely\ntook to task many of our great educational institutions for their\nneglect of the mass media. Are we, professionally, qualified and\nready for the demands being made on us, and about to be\nmade — in responsible, educational fashion?\nA mobile society may mean an unstable society.\" In view\nof the well-known growing mobility of our population, how can\nwe help? Can we provide in the mass media roots and se¬\ncurity which individuals used to find in the community? How\ncan we help reduce the wear and tear that people undergo as\nthey move from place to piace (and children move from school\nto school) ?\n\"Thanks to our insistence, as a people, on new and bigger\ncars, etc., America, in our lifetime, has become a \"have-not\"\nnation in many resources at an alarming rate: in iron, copper,\nwater, etc. What can we do, and what must we do, regardless\nof pressures, in such a critical area?\n\"We have become a \"power-happy\" people.\" We are waste¬\nful of power: in electricity, automobiles, etc. Educator's re¬\nsponsibilities in this regard are obvious.\n\"We should be less smug about our system, and stop imposing\nit on others. When we were a young nation we were as sensi¬\ntive (about French, British or other attempts to interfere, or\npressure us out of a position of \"neutrality\") as India and\nmany other new, still forming nations are today.\" The lessons\nof history are soon forgotten, or too often never learned. How\ndo we balance this need with the demand for increased train¬\ning in science?\n\"We need to reestablish respect for the individual with rare¬\nfied knowledge.\" Our scientists (and other intellectuals) are\ntoo flippantly designated as eggheads, communist tools, or\ngiven other false labels. A San Francisco newspaper of only\n10 years ago was quoted regarding some \"crazy scientist and\nphilosopher who dreamed of sending satellites around the\nworld. Yet it was our colleges and universities which gave\nstudents the concept of the \"egghead.\" What it created, it\nnow deplores.. A new attitude is indicated, to which the mass\nmedia can contribute.\n\"Man is a creator as well as a creature.\" Let us dare, as edu¬\ncators, to believe that we can be masters of the human and\ncultural process, not its slaves.\n\"We are inclined to think of the good (or strong) machine\nand the bad (or weak) I. Man created machines. We can only\nintimidate ourselves or each other — machines should not.\"\n\"Many people need to distort complex problems into terms\nthey can handle. They then handle only the distortion, not\nthe situation.\" We have responsibilities for simplifications\nwithout distortion.\nProblems can be solved. Predicaments (like too large classes,\ntoo few teachers or classrooms) can only be resolved.\"\n\"Schools for years have suffered from public apathy. They\nare now suffering from public interest.\"\nDECEMBER, 1957"
}