{
  "id": "d1446-0",
  "text": "Offlo© of Executive Secretary\nUrbana, Illinois\nJanuary 15 r 1940\nOHIO STATE INSTITUTE APRIL 39. £0 and 'AT 1\nThe 11th annual Institute for Education by Radio will'be held at\nOhio State University on April 29, 30., and bay 1, according to\nword received from Columbus. A special meeting of NAEB will b©\nheld In conjunction with the Institute, so be sure to save these\ndates and plan on attending,\nMEXICO RATIFIES BROADCAST AGREEMENT\nThe Federal Communications Commission has been notified officially\nthat the North American Regional Broadcast Agreement was ratified\nby the Mexican Senate on December 28th,\nThis agreement which was promulgated at the First Inter-American\nRadio Conference held at Havana in 1937 has now beer ratified by\nfive countries — Canada, Cuba, Haiti, Mexico and the United States ■»\nand with the ratification by Mexico it can now be made effective*\nMany interference problems which have developed between stations\nin the North American countries will be eliminated by the allo¬\ncation provided In the Treaty,,\nDATA SUPPLIED BY RCA\nRo Ee Rawlins, Jr., Director of KUSD, University of South Dakota,\nwrites that the information supplied by the radio recording division\nof RCA on the new orthoacoustic recording system was quite hexpful\nto him. He suggests that every engineer should know the data whioh\nRCA supplied and if you do not have them, you should get a oopy*.\nRCA will g-ladly send you complete information and probably also a\ntone test record to aid you in making adjustments in your equipment\nso you may properly reproduce the orthoacoustio recording.\nITEMS IN FREC SERVICE BUDIETIN\nThe Service Bulletin of the FREC for December has a number of\ninteresting items. One story tells about the work being done by\nthe Cleveland eohools. Another tells about the program of radio\nbeing produced'at the University of Michigan under the direction\nof Waldo Abbot. Still another item tells about the series »The\nFamily Life Radio Forum1' which is being carried by MAD* Harold\nEngel, WHA, also draws comments on page 1."
}