{
  "id": "d1740-0",
  "text": "Vol. IV, No. 10 ' DuPont Circle Building, Washington 36, D.C. July 10, I963\nADDITIONAL ETV CHANNELS FOR PENNSYLVANIA\nOn July 3, by Report and Order, the FCC finalized rule making in Docket\n14981 and added 1 VHF and 4 UHF channels for educational use in Pennsylvania, as\npetitioned for by that state's Department of Public Instruction. The FCC reserved\nCh. *39 (formerly commercial), Allentown, and assigned educational channels *^£—\nto Altoona, *3 to Clearfield, *65 to Harrisburg, and *68 to Scranton. This neces¬\nsitated substituting commercial Ch. 71 for Ch. 65 in Shamokin. The required con¬\ncurrence of the assignments was obtained from Canadian authorities.\nREGIONAL MEETINGS TO BE HELD RE ETV GRANT PROCEDURES\nNine regional meetings to provide information to those interested in\napplying for grants under the terms of the ETV Facilities Act have been scheduled\nby HEW. Presentations will be made explaining procedures for grant applications\nz'— to HEW and for broadcast authorization applications to the FCC. Speakers will\ninclude Dr. John W. Bystrom, Assistant to the Under-Secretary of HEW; Charles\nZellers, Executive Officer, Bureau of Ed. Assistance Progs., USOE; Dr. Hyman H.\nGoldin, Assistant Chief, Broadcast Bureau, FCC; and Dr. Lawrence T. Frymire, Chief,\nEducational Branch, FCC.\nThe meetings scheduled: July l6 - Boston; July 17 - New York; July 18 -\nAtlanta; July 19 - Charlottesville, Va.; July 26 - San Francisco; July 29 - Denver;\nJuly 31 - Dallas; August 1 - Kansas City; and August 2 - Chicago. Representatives\nof agencies planning to apply during fiscal 1964 may wish to arrange for individual\nconferences with the speakers to discuss particular problems. Conference appoint¬\nments should be made in advance directly with HEW regional offices.\nUHF CHANNEL RESERVED IN BELLINGHAM, WASH.\nBy Report and Order, the FCC finalized rule making (June 19) in Docket\n14993 and reserved Ch. 18 (formerly commercial) for ETV use in Bellingham, Wash.\nWestern Washington State College had sought the reservation.\nTIME FOR FILING AGAIN EXTENDED IN KANSAS DOCKET\nThe FCC has granted a petition to extend from June 24 to Sept. 24, time\nfor filing oppositions to petition by Tulsa Broadcasting Company, for reconsideration\nof Nov. 8, 1962 Report and Order in Docket 13860 which assigned Ch. *8 to Hutchinson,\nKansas. The petition was based on the fact that a proposal to establish a permanent\nETV authority for Kansas was recently rejected by the Legislature 59-58, and there¬\nfore the Com. on Ed. of the State Legislative Council no longer has authority to\nr continue to function before the FCC in this proceeding. It is expected, however,\nthat an authorized successor committee will be established within the additional\n90 days to represent ETV interests in Kansas."
}