{
  "id": "d1740-1",
  "text": "NORTH CAROLINA GETS FUNDS FOR ETV EXPANSION\nThe North Carolina General Assembly has approved a hill to appropriate\nto the University of North Carolina $1,250,000 for the construction of additional\nETV transmitters and connecting microwave equipment, and $250,000 for the operation\nof the system during the 1963-65 \"biennium. The Consolidated University now operates\nWUNC on Ch. *4, with studios at the Univ. of N.C., Chapel Hill, N.C. State College,\nRaleigh, and The Woman's College, Greensboro.\nMISCELLANEOUS FCC ACTIONS\nGranted (June 20) to San Fernando Valley State College, Northridge,\nCalif., CP for new Class D noncommercial educational FM station to operate on\n88.5 me, 10 w.\nGranted (June 20) to WCBB, Colhy-Bates-Bowdoin ETV Corp., Augusta, Me.,\nlicense for noncommercial ETV station and redescribed transmitter and studio\nlocations as near Lewiston, Me.: ERP: V - 310 kw, A - 155 kw.\nGranted (June 20) to St. Bernardine of Siena College, Loudonville, N.Y.,\nlicense for new noncommercial educational FM station, WVCR-FM.\nOn June 20, Chief Hearing Examiner Cunningham granted motion by Redding-\nChico TV, Inc. for dismissal without prejudice of its application for a new TV\nstation to operate on Ch. 9> Redding, Calif., and retained in hearing station\napplication of Northern Calif. ETV Assn., Inc. to operate noncommercially on\nthat channel in Redding.\nGranted (June 26) to Central Michigan U., Mt. Pleasant, CP for new non¬\ncommercial educational FM station to operate on 90*1 me, 10 w.\nOn June 26, Hearing Examiner Frederick, on petition by Wisconsin Citizens’\nCom. for ETV, Inc., extended time from July 1 to July 11 to file proposed findings\nand from July 15 to July 26 for replies in the Wausau, Wisconsin, TV Ch. 9 pro¬\nceedings .\nNEW EDUCATIONAL STATIONS PLANNED\nSt. Lawrence University, Canton, N.Y., applied July 1, for a CP for a\nnew noncommercial educational FM station to operate on 89.5 me, ERP - 8 kw,\nTrans. Output - 2.56 kw. Antenna - 76* above average terrain.\nAlso on July 1, C.W. Post College of Long Island University, Brookville,\nN.Y., applied for CP for new noncommercial educational FM station to operate on\n88.1 me, ERP - 125 w, Trans. Output - 46.82 w. Antenna - 187’ above average terrain.\nOn July 3, Lafayette College, Easton, Pa., applied for CP for new non¬\ncommercial educational FM station to operate on 90*5 me, 10 w."
}