{
  "id": "d264-0",
  "text": "MSB HEADQUABTEES\nJanuary 13, 1953\nTO* Eugene Foster, Syracuse; Harry Lamb, Toledo; Kay Lardie, Detroit; Paul\nRickard, Detroit; John Henderson, Lafayette; Frank Schooled Hrbana;\nGeorge Jennings, Chicago; Richard Hull, Asses; Carl Manzer, leva City;\nMarguerite Fleming, St, Louis; H. E. Salley, Louisville; Robert Wallace,\nOxford; I* Keith Tyler, (kxhmbus; B. Kendall Crane, Pittsburgh; Martha\nGable, Philadelphia; Mrs, Ludwig, Institute of International Education.\nFROM* Jim *files, Executive Director\nBecause of other commitments, Mr. Nizami can only visit with MEB stations\nfor six weeks. I have, therefore, re-drawn the schedule. It is my firm\nthat this will be the final draft of it. This re-draft will necessi¬\ntate seme changes. However, I have only eliminated two spots from the\nprevious schedule — namely, Cleveland and Madison.\nI am reliably informed that Mr. Nizami is a very high level personage in\nhis own country. He speaks English fluently. He is very dark skinned.\nHence, where color barriers are a problem, due caution should be observed.\nThe travel schedule for Mr. Nizami will bo mad© by the Institute of\nInternational Education. They will inform each of you as to his exact\narrival time in your city. He will also have your name and address with\nphone number. Arrangements have been made for him to travel during the\ndaytime hours and, bonce, he should arrive in each location at a fairly\nreasonable hour. Anywhere that it is possible, X would suggest that yon\nattempt to meet him in front of the information or ticket window at the\nlocal station.\nEach person is responsible for arranging for accommodations for Mr. Nizami,\non the nights ho is in your car©. Mr. Nizami does have travel funds to pay\nfor these acccamodations.\nI trust that each of you will give him a #25 tour of your operation and that\nyou will discuss matters of international, exchange of programs and ideas on\na two-way basis with him.\nIf for any reason the revised schedule is not agreeable to you, I trust you\nwill communicate with me at once so that we can make further modifications."
}