{
  "id": "d264-14",
  "text": "TO* Board of Directors and Officers page 3 — tec 10, 1553\n3F 2QU AHE STILL WOT I® AT THIS POXETi on© of the greatest weak¬\nnesses of HAE3 is recognition of eta? accoEplishmonts, our significance, and\noar potentialities by educators across the country. By educators, I mean\ncollege presidents, deans, and department heads, high school principals and\nsupervisors. W© know we are important, wo know m are doing significant\nwork, and we know m are important in the total field of education. Our\nnest big project should toe one of interpreting our role in the education\npicture to school administrators. Perhaps this can be a major project for\nSkomia. How w© can accomplish this (and it must be done) is a job I would\nlike to toss at our Promotion and Publicity Cosmittee for some heavy thinking\nprior to the Wisconsin meeting.\nI will not apologise for the length of this comunication. There\nmust be others still longer forthcoming if HAEB is to retain its position\nof leadership in educational breadcasting in America. I insist that\nyou as Members of the Beard must spend soe© heavy time on our various prob¬\nlems and plans. I do not object to making decisions but sm a firm believer\nin the democratic process wherein the decisions and the plans are the result\nof the careful, consideration of a number of people.\nAnd just in case you would like to participate in some loag-rang®\nplanning, you might give m© a s&mo outlining a course for K&EB for the nort\nfive years. The Executive Committee and the Advicory Committee will attempt\nsomething like that at a Ejecting set up for the first week in August.\nI look forward to seeing you in Madison the 21st of June.\nGrsydon Augesssb\nP.So We recently mad© a request of th© FAS for funds for a TV Production\nWorkshop, & TV Management Scisdnar, TV Workshop Fellowships, and TV Engi¬\nneering Scholarships. Fuads have been ajprovcd for the first two of these\nrequests. However, no public announeaaonfc of than can bo mds at tM&\ntimo Details will be provided after negotiations ar© completed. I trust\nyou will consider this as well aa other matters discussed in this letter\nas a confidential report.\nQA/jah"
}