{
  "id": "d250-20",
  "text": "Hr. -alter B. ^nwry\n437 >>■■—if Avenue\nm Lansing, Michigan\nDear <aUari\nthanks for agreeing to do the articles on Haxlean kmadcaating. i look\nBernard to ceding tbs®. Probably the first issue l could gat one of them\nla would be Jamisry-Sfebruary, tdiieh msans l would need the firat one by\nnwmkwf 15.\nX agree that it would be good if you* Pres, and X could got together some-\nt!m soon—but X doubt if either Una or money would allow it before the\nconvention, Ft** has already moved to Athena, and I Imagine le pretty busy\ngetting settled...and l have a thousand things to get In Hand before the\nconvention* flowewer, Vll send a carbon of this to Harold, and If he\nthinks the MSB could afford the three of m meting at some central point\n(a quick glance at the map looks as if fh»*t ^ayae, lad., talghfc be meat cen¬\ntral to all), t*m mm we*U hear from him. Otherwise, X suspect we*d\nbest plan to get together during the convention.\nPres has tots of good ideas and we*we had bushels of correspondence back\nand forth, which you* lucky man, Hawe escaped. Briefly, present plans call\nfor Pres to taka complete charge of the ffcct Sheet section as of Janu¬\nary l—so that all I will do will be to get the digests into the production\nhopper and Into tint magasine. (X% already sheeting everything to his that\nremotely looks libs ’•research,* without even any attempt to evaluate it.)\nthen a couple of times a year—or whenever it seems wise to his, and ha\nhas the time to do it—ha will write an analytical swaaary of the research\nstudies in a specific area. Sene of the minor things which we feel we\nshould acknowledge the existence of—but which aren’t worth anything more-\nlie will probably list In the annua1 index (ha's currently working on the\nindex which will appear In the Jaauary-mbruary Isaua.\nThen I have asked him for help in looking for end evaluating articles in¬\nvolving research for the regular white section of the Journal, too. Bruce\nHatley, a* efuatean of the fteseanrit Committee, is supposed to work direct¬\nly with Pres on getting research studies and articles* Also, I have sug¬\ngested that members of the Publications Comnifctee and others will probably\nbe willing to halo hin writs the digests if he feels he dees't wad to do\nthem all himself*\nAnd, as you\nt\nwith you that his appointment \"Is\nill*"
}