{
  "id": "d250-27",
  "text": "/\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nMrs. Betty McKenzie\nNAEB Publications Editor\n119 Gregory Hall\nUrbana, Illinois\nDear Betty:\nJust as sort of a check on our thinking in regard to my earlier letter about the\ntype of articles we should be trying to get for the Journal (i.e., more \"scholarly\"\nones), I have gone through the May-June Journal, and have listed below nrf inter¬\npretation of article types. As we have both agreed, there are certain Tlhow-to-\ndo-it\" articles which we would hope to put in a \"slick” magazine if we can get\none started, but which now must go in the Journal because there is no other vehicle\nfor them. In my analysis below, I have indicated this type of article by HTDI,\nand have indicated scholarly-types by SCH. In some cases, I have made more detailed\ncomments - and obviously, there are some that might fit in either of the two cate¬\ngories I have arbitrarily set up for this purpose, and some that fit into neither.\nI do not intend this as any sort of \"judgement,\" nor do I hold any brief for my\ninterpretation. I am sure that there will be many instances where you and/or\nWhiter (to whom I'm sending a copy of this letter) will disagree with me - and\nwith one another. However, I felt that this might be worthwhile, if only to help\nus understand what each of us is talking about when we discuss the content we think\nthe Journal should have. And none of it is intended to be a reflection on your\neditorial judgement - as you know I think you do a fine job, and there are many\ntimes in all publications where two people, as editors, would do something entirely\ndifferently - and that is one of the penalties you must pay for working with a\nguy who has had journalistic training of sorts.\n\"The FCC's New Educational Broadcasting Branch\" - Actually falls into neither of\nthe categories I have set up (and hereafter in this list, I will simply refer to\nsuch as \"neither\"), but could fit into either the Journal or the magazine, but\nperhaps more properly in the latter.\n\"More TV Criticism, Please\" - SCH\n\"Newton Minow: Champion of Educational Broadcasting\" - same analysis as first\narticle, above.\n\"Preparing TV Teachers\" - HTDI\n\"Col. Glenn and ETV\" - HTDI\n\"TV Workshop\" - HTDI"
}