{
  "id": "d657-10",
  "text": "Fourth Avenue, New York 16, New York. Recordings of this program are also\navailable and are listed under \"Recordings.\"\nInterfaith Scripts\n1. UNFINISHED BUSINESS - U.S.A. - This thirty-minute dramatization by Morton\nWishengrad is an original American Jewish Committee presentation at its 42nd\nAnnual Meeting. Melvyn Douglas starred in this performance. It is a docu¬\nmentary review of civil rights for the year 1948. Full-scale production and\na cast of about 24 are required. This copyrighted script is available only\nfor stage presentations at meetings, schools, etc., and cannot be used for\nradio or television. If a non-profit presentation is given, a fee of fifteen\ndollars should be sent directly to Morton Wishengrad, 10 Sterling Avenue,\nWhite Plains, New York. Free copies of the script may be secured from the\nRadio Department of the American Jewish Committee, 386 Fourth Avenue, New\nYork 16, New York.\n2. REPORT ON BROTHERHOOD - The ’’New World A*Coming” series includes this\nthirty-minute dramatization written by Philip Sterling and originally pre¬\nsented on Station WMCA, New York, New York. This Christmas fantasy is based\non the famous pamphlet, \"The Races of Mankind.” An angel takes a trip to\nthe earth to prepare a report on the information recently received that there\nis a growing contradiction between the theory and practice of the universal\nbrotherhood of man. Full-scale production and a cast of about twenty-four\nare required. The script may be rebroadcast on independent local stations.\nFree copies of the script may be secured from the Radio Department of the\nAmerican Jewish Committee, 386 Fourth Avenue, New York 16, New York.\n3. A GUY NAMED JAKE - The \"New World A’Coming\" series includes this thirty-\nminute dramatization written by Jack Bentkover and originally presented on\nStation WMCA, New York, New York. This play presents an unusual treatment\nof the problem of anti-Semitism in employment. A man who has been exercising\nhis prejudices rather than his mind, causes discontent among his co-workers,\nonly to realize after the damage is done his fallacious reasoning and actions.\nFull-scale production and a cast of about seven are required. The script may\nbe rebroadcast on independent local stations. For free copies of the script,\nwrite to the Radio Department of the American Jewish Committee, 386 Fourth\nAvenue, New York 16, New York.\n4. THE DIPLOMA - The \"New World A'Coming\" series includes this thirty-minute\ndramatization, written by Peter Martin and originally presented on Station\nWMCA, New York, New York. It tells the story of the effect on an Italian-\nAmerican boy of the racial and religious quota systems in some of the\nAmerican universities. Full-scale production and a cast of about six are\nrequired. For permission to rebroadcast the script on independent local\nstations, write to Peter Martin, American Broadcasting Company, 30 Rocke¬\nfeller Plaza, New York 20, New York. Free copies of the script may be\nsecured from the Radio Department of the American Jewish Committee, 386\nFourth Avenue, New York 16, New York.\n5. A MONUMENT FOR ROOSEVELT WILSON - The \"New World A’Coming\" series in¬\ncludes this thirty-minute dramatization, written by B. Edgar Marvin from an\narticle by William Bradford Huie, and originally presented on Station WMCA,\nNew York, New York. A Southern Negro is framed for murder in the interest\nof white supremacy. Full-scale production and a cast of about fourteen are"
}