{
  "id": "d657-11",
  "text": "- 9 -\nrequired. The script may be rebroadcast on independent local stations. For\nfree copies of the script write to the Radio Department of the American\nJewish Committee, 386 Fourth Avenue, New York 16, New York.\n6. A SKY OF TOMORROWS - The \"New World A’Coming\" series includes this\nthirty-minute dramatization, written by Carl Abrams, and originally pre¬\nsented on Station WMCA, New York, New York. Violence breaks out in a small\ntown when a white woman voluntarily takes a position teaching in a Negro\nschool. The problems the teacher has to face because of a prejudiced com¬\nmunity are dramatized. These stretch all the way from gossip to murder.\nFull-scale production and a cast of about ten are required. The script may\nbe rebroadcast on independent local stations. To secure copies of the script\nwithout charge write to the Radio Department of the American Jewish Committee,\n386 Fourth Avenue, New York 16, New York.\n7. DOWN TO EARTH - The \"New World A'Coming\" series includes this thirty-\nminute dramatization written by B. Edgar Marvin, and originally presented\non Station WMCA, New York, New York. This is a radio fantasy about a man\nfrom the planet Saturn who comes down to earth and finds our racial and\nreligious prejudices strange and distasteful. Full-scale production and a\ncast of about ten are required. The script may be rebroadcast on independ¬\nent local stations. For free copies of the script write to the Radio Depart¬\nment of the American Jewish Committee, 386 Fourth Avenue, New York 16,\nNew York.\n8. THE OTHER ROOM - The \"New World A’Coming\" series includes this thirty-\nminute dramatization written by Worth Tuttle Hedden, adapted by Ethel\nDeckleman, and originally presented on Station WMCA, New York, New York.\nThis is the story of a white Southern girl who accepts a teaching position\nin a New Orleans college, not knowing its students are Negroes. Her first\nreaction is to return to her home, but her father urges her to stay. In a\nfew months she conquers her prejudices. Full-scale production and a cast of\nabout twelve are required. The script may be rebroadcast on independent\nlocal stations. For free copies of the script write to the Radio Department\nof the American Jewish Committee, 386 Fourth Avenue, New York 16, New York.\n9. THE PEOPLE NEXT DOOR - The \"New World A’Coming\" series includes this\nthirty-minute dramatization written by Alfred Hayes, and originally presented\non Station WMCA, New York, New York. The story is told of how a returned\nveteran helps his mother, as well as the janitor of his building, and his\nbutcher overcome their prejudice about a family of Austrian refugees who\nhave moved into the neighborhood. Full-scale production and a cast of about\nseven are required. The script may be rebroadcast on independent local\nstations. For free copies of the script write to the Radio Department of\nthe American Jewish Committee, 386 Fourth Avenue, New York 16, New York.\n10. A SALUTE TO OUR FELLOW-CITIZENS OF JEWISH FAITH - A fifteen-minute\nspecial New Year dramatization, written by Joseph Roos, and originally pre¬\nsented on Station KFWB, Hollywood, California. The story is told of an Irish\nveteran who attends New Year services of all faiths because of his greatful-\nness to the four chaplains who gave up their lifebelts on the S.S. Dorchester\nso that others might live. Simple production and a cast of about four are\nrequired. The script may be rebroadcast on independent .local stations.\nFree copies of the script may be obtained by writing to the Radio Department\nof the American Jewish Committee, 386 Fourth Avenue, New York 16, New York."
}