{
  "id": "d657-12",
  "text": "10 -\n11. THE PLIGHT OF A BIGOT BUG - A fifteen-minute dramatization written by-\nJerome Bayer, originally presented by the National Conference of Christians\nand Jews in celebration of- Brotherhood Week. This is the story of how a\n\"bigot bug\" operates, and his plight when people in the \"places of operation\"\nin which he has been working finally become immunized against him. Simple\nproduction and a cast of about fifteen are required. The script may be re¬\nbroadcast on independent local stations. For a copy of the script write to\nthe National Conference of Christians and Jews, 381 Fourth Avenue, New York\n16, New York. Extra copies may be reproduced or received at a charge of ten\ncents each.\n12. THE UNERRING INSTINCT - A fifteen-minute dramatization written by\nThornton Wilder, originally presented by the National Conference of Christians\nand Jews in celebration of Brotherhood Week. Belinda Watson, who has always\nbeen full of fears about people, and full of sweeping judgments about those\nshe wants to meet and those she doesn't want to meet, loses her prejudices\nwhen shown how susceptible she is to nonsensical talk. Simple production and\na cast of about three are required. This script may be produced without\npermission except that no radio performance may be given. Credit must be\ngiven to the National Conference of Christians and Jews and to Hr. Wilder.\nFor a copy of the script write to the National Conference of Christians and\nJews, 381 Fourth Avenue, New York 16, New York. Extra copies may be repro¬\nduced or received at a charge of ten cents each..\n13. FREEDOM IS A HOME-MADE THING - The \"Living 1948\" series includes this\nthirty-minute dramatization written by Lou Hazam and originally presented on\nthe National Broadcasting Company network. This is a dramatization about the\nFreedom Train which is presented in commemoration of Memorial Day. Full-scale\nproduction and a cast of about nine are required. The script may be rebroad¬\ncast on member stations of the National Broadcasting Company network only.\nFor free copies of* the script write to the Radio Department of the American\nJewish Committee, 386 Fourth Avenue, New York 16, New York.\n14. THE UNITED NATIONS - THE PEOPLE'S HOPE - A fifteen-minute documentary\nwritten by Joseph Roos and originally presented by the Council for Civic\nUnity, on Station KFWB, Hollywood, California. This story about the United\nNations, deals specifically with the United Nations Commission on Human\nRights. Simple production and a cast of about two are required. The script\nmay be rebroadcast on independent local stations. For copies of the script\nwithout charge write to the Radio Department of the American Jewish Committee,\n386 Fourth Avenue, New York 16, New York.\n15. FREEDOM TRAIN BROADCAST - The \"Deadline\" series includes this fifteen-\nminute dramatization by Joseph Roos, originally presented on Station KFWB,\nHollywood, California. A reporter who has to write up the arrival of the\nFreedom Train in his town, engages in conversation with one of the guards\naboard the train. This man tells him how serving in the army during the war\ntaught him the value of tolerance and understanding of his fellow man, and\nthe importance of appreciating our Bill of Rights and what it stands for.\nFairly simple production and a cast of about five are required. The script\nmay be rebroadcast on independent local stations. For free copies of the\nscript write to the Radio Department of the American Jewish Committee, 386\nFourth Avenue, New York 16, New York.\n16. BROTHERHOOD WEEK - The \"Deadline\" series includes this fifteen-minute\ndramatization by Joseph Roos, originally presented on Station KFWB, Hollywood,"
}