{
  "id": "d657-13",
  "text": "11\nCalifornia, as a public service feature. It is the story of one, John Peters,\nwho, after having dreamed about the imperfections of the actions of people\ntoward each other, vows to dedicate himself to helping his fellow men, re¬\ngardless of race, color or creed. Fairly simple production and a cast of\nabout four are required. The script may be rebroadcast on independent local\nstations. For copies of the script without charge, write to the Radio De¬\npartment of the American Jewish Committee, 386 Fourth Avenue, New York 16,\nNew York.'\n17. COMMUNISM - U.S. BRAND - A sixty-minute dramatization by Morton Wishen-\ngrad, originally presented on the American Broadcasting Company network. It\nis an educational and human-interest expose about communism. Full-scale\nproduction and a cast of about twenty are required. For permission to re¬\nbroadcast this script write to the American Broadcasting Company, 30 Rocke¬\nfeller Plaza, New York 20, N.Y. The script may be presented at schools and\nat educational meetings. A limited number of copies of this script are\navailable at the American Broadcasting Company.\n18. THE LONELIEST BOY IN TOWN - This is a fifteen-minute dramatization, in\nthe form of a ballad, written and directed by Ben Kagan, and presented by\nthe Jewish Welfare Board. Lehman Engel is the original music composer for\nthis production, and Samuel Kligfeld the singer. The script presents the\ngeneral picture of the Jewish Community Center program and how it servioes\nthe community. A youngster, a newcomer to a community, who is made to feel\nas an outsider, is helped to find his place in the community by joining the\nlocal Jewish Community Center. Simple production and a cast of about four,\nincluding a singer, are required. The program may be rebroadcast on inde¬\npendent local stations. Free copies of the script may be secured from the\nJewish Welfare Board, 145 East 32nd Street, New York 16, New York. Recordings\nof this program are also available, and are listed under \"Recordings.\"\n19. THE NEW ROAD - FORWARD WITH SONG AND COURAGE - A thirty-minute program\nwritten by Robert Adler and presented by the Jewish Welfare Board. This is\na musical dramatization of Jewish songs in Hebrew, Yiddish and English. Full-\nscale production and a cast of about four, including a singer are required.\nThe script may be rebroadcast on independent local stations. For free copies\nof the script, write to the Jewish Welfare Board, 145 East 32nd Street, New\nYork 16, New York. Recordings of this program are also available and are\nlisted under \"Recordings.\"\n20. THE EXPERIMENT THAT FAILED - The \"One World Or None\" series includes\nthis thirty-minute dramatization written by Dexter Masters and originally\npresented on Station WMCA, New York, New York. It is the story of the\nscientist. Dr. Louis Slotin, who dies while working on the atom bomb. His\nhope is some day to use atomic power for peace. Full-scale production and\na cast of about eight are required. The script may be rebroadcast on inde¬\npendent local stations. Station WMCA would like to be advised if script is\nrebroadcast. Copies of the script can be secured without charge from the\nRadio Department of the American Jewish Committee, 386 Fourth Avenue, New\nYork 16, New York.\n21. MEMO TO THE PEOPLE - Sol Panitz is the script-writer of this \"World\nSecurity Workshop\" thirty-minute dramatization originally presented on the\nAmerican Broadcasting Company network. It is a prize-winning radio play\nwritten to help Americans understand the way to lasting peacej and to offer\nevidence that all peoples can in truth become citizens of the universe. This\nplay may be reproduced on local American Broadcasting Company network stations"
}