{
  "id": "d657-15",
  "text": "13\n27. THE WALL BETWEEN - This thirty-minute dramatization presented by \"The\nStory Theater\" and written by Paul Milton is an original Mutual Broadcasting\nSystem network broadcast. Jim Ameche starred. The story is told of Fran\nDavid and the \"wall\" of which she is conscious between herself and people of\ndifferent faiths. With understanding comes cooperation and knowing that each\ngroup contributes to our great single purpose — universal brotherhood that\nmeans security. This script may be rebroadcast on member stations of the\nMutual Broadcasting System network. Full-scale production and a cast of\nabout seven are required. Write to the Radio Department of the American\nJewish Committee, 386 Fourth Avenue, New York 16, New York, for a free copy\nof the script.\n28. LET'S GET RID OF PREJUDICE - One of the thirty-minute \"The Baxter's\"\ndramatizations by Ruth Moore originally presented by the National Congress\nof Parents and Teachers in cooperation with the National Broadcasting\nCompany network. The story is about two boys who shun a third because of\nhis religion until they realize what makes the foreigner \"tick.\" This script\nmay be rebroadcast on member stations of the National Broadcasting System\nnetwork. Full-scale production and a cast of about five are required. Write\nto the Radio Department of the American Jewish Committee, 386 Fourth Avenue,\nNew York 16, New York, for free copies of the script.\n29. THE EARTH AGAIN - This thirty-minute dramatization presented by the\n\"Where Do We Go From Here\" radio series and written by John Farlby is an\noriginal Station WMCA broadcast. It tells the story of war veteran Lou\nStein, who finds a career in farming after overcoming many obstacles. Full-\nscale production and a cast of about seven are required. The script may not\nbe rebroadcast on the air. Copies of the script without charge may be secured\nfrom the Radio Department of the American Jewish Committee, 386 Fourth Avenue,\nNew York 16, New York\n30. LIGHTS OUT - A thirty-minute adaptation of Baynard Kendrick's \"Lights\nOut\" written for radio by Arnold Perl. It is an original Station WNEW\nbroadcast. The story is told of a blinded soldier who discovers the meaning\nof real insight and perception, and in doing so finds himself and a new world.\nFull-scale production and a cast of about nine are required. For permission\nto rebroadcast this script write to the Radio Department of the American\nJewish Committee, 386 Fourth Avenue, New York 16, New York. Free copies of\nthe script can be secured from the Radio Department of the American Jewish\nCommittee. Recordings of this program are also available and are listed\nunder \"Recordings.\"\n31. MRS. CAMPBELL'S ONE WORLD - The \"World Security Workshop\" radio series\nincludes this thirty-minute dramatization written by Irve Tunick and originally\npresented on the American Broadcasting Company network. It is a story of a\nbigoted and narrow-minded Mrs. Campbell who is shown the error of her ways.\nThis play, as a \"World Security Workshop\" script, may be reproduced on local\nAmerican Broadcasting Company network stations provided nobody connected\nwith the production of the broadcast is paid. It may also be produced on in¬\ndependent local stations provided the \"World Security Workshop\" is not men¬\ntioned. Full-scale production and a cast of about eight are required. For\ncopies of the script without charge write to the Radio Department of the\nAmerican Jewish Committee, 386 Fourth Avenue, New York 16, New York. Re¬\ncordings of this program are also available and are listed under \"Recordings.\"\n32. BEDTIME STORY, FOR ADULTS ONLY - A special thirty-minute Brotherhood\nWeek program written by Arch Oboler and presented by the National Conference"
}