{
  "id": "d657-16",
  "text": "- 14 -\nof Christians and Jews, over the Mutual Broadcasting System network. Peter\nLorre starred as narrator on this broadcast. Three bedtime stories are told\nshowing the racial intolerance in the post-war world. Hope is expressed\nthat people will remember the war recently fought by men of different faiths\nin an effort to bring about harmony and unity of all. This script may be\nrebroadcast on member stations of The Mutual Broadcasting System network.\nFull-scale production and a cast of about twelve are required. A copy of the\nscript can be secured without charge from the National Conference of Christians\nand Jews, 381 Fourth Avenue, New York 16, New York. Extra copies may be re¬\nproduced or secured at a charge of ten cents each.\n33. CASE OF THE PEDDLERS OF PREJUDICE - This \"Mr. District Attorney\" half-\nhour dramatization, by Jerry Devine, originally presented on the National\nBroadcasting Company network, is written in an effort to make people under¬\nstand the nature and effect of racial intolerance. This is brought home to\ntwo school boys, who cause a riot because of their un-American activities.\nFull-scale production and a cast of about eight are required. This script\nmay not be rebroadcast on the air. For a copy of the script write to the\nRadio Department of the American Jewish Committee, 386 Fourth Avenue, New\nYork 16, New York.\n34. BEACHHEAD ON THE CAMPUS - This is an original thirty-minute \"Reunion\nU. S. A.\" radio program by Milton Geiger presented on the American Broad¬\ncasting Company network in cooperation with the Hollywood Writers\" Mobiliza¬\ntion. Garry Wilson, an ex-marine, returns to college, only to be harassed\nby the bigotry he finds existing there. He decides to continue his studies\nand to work for democracy and understanding. Full-scale production and a\ncast of about thirteen are required. This script may not be rebroadcast.\nScripts are distributed without charge by the Radio Department of the American\nJewish Committee, 386 Fourth Avenue, New York 16, New York.\n35. AMERICAN NAMES - A five-minute dramatization by Maxwell Nurnberg, orig¬\ninally presented on the \"What’s the Good Word?\" radio series, dealing with\nthe derivations of names. The thought expressed is that it is not one’s name\nthat makes him what he is but rather his individual character. Therefore,\none should not be judged by his name. Simple production and a cast of about\nten are required. This script may be broadcast on any independent local\nstations. Free scripts can be secured from the Radio Department of the\nAmerican Jewish Committee, 386 Fourth Avenue, New York 16. New York.\n36. MY LITTLE BOY - A thirty-minute dramatization written by Carl Ewald and\npresented on the Columbia Broadcasting System network by the Textron Theatre\nradio series, with Helen Hayes as narrator. It is a moving story of a mother who\nhelps her young son understand the world, and teaches him tolerance of his\nneighbors. The cast consists of about five characters, and the script is fairly\neasy to produce. Permission is not granted to rebroadcast this script on the air.\nA limited number of scripts without charge may be secured from Textron, Inc.,\nEmpire State Building, Fifth Avenue, New York 1, New York. Recordings of this\nprogram are also available and are listed under \"Recordings.\"\n37. DIVIDE AND CONQUER - A fifteen-minute dramatization by Allan Sloane and\nBob Russell emphasizing the importance of unity in fighting the enemy. The\ncast consists of five men, one woman, and one boy. Production is easy. Per¬\nmission is granted to broadcast this script on independent local stations.\nWrite to the Radio Department of the American Jewish Committee, 386 Fourth\nAvenue, New York 16, New York, for copies of this script without charge."
}