{
  "id": "d657-17",
  "text": "- 15\n38. I HAVE NO PRAYER - A fifteen-minute dramatization by Arch Oboler broad¬\ncast during Brotherhood Week, which tells about five men of different faiths\nall fighting for the same cause. This is an original Blue Network broadcast,\nwhich is now the American Broadcasting Company network. The cast consists\nof six men. Production is simple. For permission to rebroadcast this script,\nwrite to the Radio Department, American Jewish Committee, 386 Fourth Avenue,\nNew York 16, New York. A free script can be secured from the Radio Department\nof the American Jewish Committee, 386 Fourth Avenue, New York 16, New York.\n39. A FRIEND IN DEED - This fifteen-minute script tells the true-life story\nof Judge Theodore Rosen, who gives unselfishly to others. It is an original\nColumbia Broadcasting System broadcast. The cast consists of one voice to\nact the leading role and several minor voices. Production is fairly simple.\nThis script may be rebroadcast on member stations of the Columbia Broadcasting\nSystem network. The script can be secured without charge from the Radio\nDepartment, American Jewish Committee, 386 Fourth Avenue, New York 16, New\nYork.\n40. A CHANGE OF HEART - This fifteen-minute script, written by Shirley Robin,\nhas been prepared by the American Association for the United Nations, Inc.,\nin celebration of United Nations Week. It is the story of one, Ed Tobin,\nwho refuses to move from his apartment so that a United Nations site may be\nbuilt there. He is brought to his senses when due to his own scheming, his\nson is beaten up by some local children because he is in favor of the United\nNations. Simple production and a cast of about eleven are required. The script\nmay be presented at schools, meetings,and on the air. Free copies of the script\nmay be secured from the Radio Department of the American Jewish Committee,\n386 Fourth Avenue, New York 16, New York.\nYouth Scripts\n1. THE ABC’s of BROTHERHOOD - A fifteen-minute dramatization written by\nSidney Z. Vincent, originally presented by the National Conference of\nChristians and Jews in celebration of Brotherhood Week. The script rededicates\nitself to the American dream of respect for all men regardless of racial and\nreligious affiliations. Each letter of the alphabet and the affiliation with\nbrotherhood of a word beginning with that letter is presented. The script\nends on the note, \"Together we shall determine whether Brotherhood Week is\nonly an empty gesture or the annual celebration of a continuous growth of\nunderstanding and cooperation among all the peoples of the United States.\"\nSimple production and a oast of about forty-eight are suggested - one person\nto represent each letter of the alphabet, plus the other members of the cast.\nThis, however, is not at all necessary because each of the parts is very short\nand one person might handle many parts. The script may be rebroadcast on\nindependent local stations. For a copy of the script without charge write to\nthe National Conference of Christians and Jews, 381 Fourth Avenue, New York\n16, New York. Extra copies may be reproduced or received at a charge of ten\ncents each.\n2. THE COACH PLAYS THE GAME - A fifteen-minute dramatization written by\nSidney Z. Vincent, originally presented by the National Conference of Christians\nand Jews in celebration of Brotherhood Week. This is a story about a champion¬\nship high school basketball team which, when divided by prejudice, began losing\nits games. The wise coach straightens them out in time. Simple production and\na cast of about seven are required. The script may be rebroadcast on inde¬\npendent local stations. To secure a copy of the script without charge write\nto the National Conference of Christians and Jews, 381 Fourth Avenue, New York"
}