{
  "id": "d657-18",
  "text": "16\n16, New York. Extra copies may be reproduced or received at a charge of ten\ncents each.\n3. IN PLACE OF THE MELTING POT - A fifteen-minute dramatization written by\nSidney Z. Vincent, originally presented by the National Conference of Chris¬\ntians and Jews in celebration of Brotherhood Week. This is the story of a\nhigh school lad who tells his friends how he has conquered his shame of being\ndescended from other than third generation Americans. He tells how when he\nrealizes that this is America, a melting pot of all peoples, he even learns\nto read and sing in his grandfather’s language. Simple production and a cast\nof about eight are required. The script may be rebroadcast on independent\nlocal stations. For a free copy of the script write to the National Conference\nof1 Christians and Jews, 381 Fourth Avenue, New York 16, New York. Extra copies\nmay be reproduced or received at a charge of ten cents each.\n4. FIGHTING IRISH - A fifteen-minute dramatization written by Gretta Baker,\noriginally presented by the National Conference of Christians and Jews in\ncelebration of Brotherhood Week. This is a dramatization of two rival high\nschool football teams and their two starring players who hate each other from\nchildhood. Before the last game of the season, one of the players plans to\nambush the other in order to have him taken from the game. When the coach\nlearns of this, he takes the plotter out of the game. He reinstalls him,\nhowever, at the request of the other star, when they realize that their hatred\nof each other is based on prejudice. Simple production and a cast of about\nseven are required. The script may be rebroadcast on independent local\nstations. To secure a free copy of the script write to the National Confer¬\nence of Christians and Jews, 381 Fourth Avenue, New York 16, New York. Extra\ncopies may be reproduced or received at a charge of ten cents each.\n5<> CAMPAIGN SPEECH - A fifteen-minute dramatization written by George and\nJacquelyn Hatvary, originally presented by the National Conference of\nChristians and Jews in celebration of Brotherhood Week. This is the story\nof Floyd, a high school student who runs for president of the Student Council.\nWhen referring to his opponents in his campaign speech, he plays up hate and\nprejudice. Following events and talks with his friends prove to him how wrong\nhe is. Simple production and a cast of about twelve are required. The script\nmay be rebroadcast on independent local stations. For a free copy of the\nscript write to the National Conference of Christians and Jews, 381 Fourth\nAvenue, New York 16, New York. Extra copies may be reproduced or received at\na charge of ten cents each.\n6. WATCH WHAT YOU SAY - A dramatization, about eight minutes long, written\nby Doris I. Boyd, and originally presented by the National Conference of\nChristians and Jews in celebration of Brotherhood Week. Two youngsters who\nvoice the opinion that all foreigners should be removed from the country,\nawaken to the important contributions made by their so-called \"foreigners”\nand to how they form ai integral and important part of this country. Simple\nproduction and a cast of about five are required. The script may be rebroad¬\ncast on independent local stations. To secure a free copy of the script write\nto the National Conference of Christians and Jews, 381 Fourth Avenue, New York\n16, New York. Extra copies may be reproduced or received at a charge of ten\ncents each.\n7. BROTHER SAM - A dramatization, about eight minutes long, written by\nM. Jean Herman, originally presented by the National Conference of Christians\nand Jews in celebration of Brotherhood Week. The disturbances in the world\ncaused by children of various racial and religious backgrounds who are not"
}