{
  "id": "d657-19",
  "text": "- 17\ntolerant of their neighbors is shown, and the idea is stressed that all\nchildren regardless of their heredity are \"brothers.\" Simple production\nand a cast of about seven are required. The script may be rebroadcast on\nindependent local*stations. A free copy of the script may be secured by\nwriting to the National Conference of Christians and Jews, 381 Fourth Avenue,\nNew York 16, New York. Extra copies may be reproduced or received at a\ncharge of ten cents each.\n8. THE TOWN THAT WHISPERS - An original \"It’s Up To Youth\" fifteen-minute\ndramatization written by Ira Marion, and originally presented on the Mutual\nBroadcasting System network. This is a meaningful \"Merry Christmas\" play\nin which the prejudiced whispering which goes on in a town is conquered\nwhen the students of the local high school put their \"all\" into a campaign\nfor brotherhood and better understanding among the people. Their wish is\ngranted - peace and good will grow from understanding. Simple production\nand a cast of about eight are required. The script may not be rebroadcast\non the air, but may be used at schools or for meetings. For free copies\nof the script write to the Radio Department of the American Jewish Committee,\n386 Fourth Avenue, New York 16, New York.\n9o AS ONE STAR DIFFERETH - This is a fifteen-minute dramatization by Helen\nR. Fish originally presented by the National Conference of Christians and\nJews in celebration of American Brotherhood Week. The play shows that\nAmerica is made up of people who, though they have their differences, all\nmake their contributions to the country. Simple production and a cast of\nabout eleven are required. This script may be rebroadcast on local inde¬\npendent stations. A free copy of the script can be secured by writing to\nthe National Conference of Christians and Jews, 381 Fourth Avenue, New York\n16, New York. Extra copies may be reproduced or secured at a charge of ten\ncents each.\n10. WHILE EARTH ENDURES - A fifteen-minute dramatization by Ira Marion,\noriginally presented by the National Conference of Christians and Jews on\nthe American Broadcasting Company network. It is a legend about a young\nlad who can not see true democracy in America. Abraham Lincoln, while\ntouring the country with the youngster, gives him hope and faith in future\nbrotherhood of man. The play may not be reproduced or performed in any manner\nexcept for non-commercial performance in schools or at meetings. Full-scale\nproduction and a cast of about thirteen are required. It may be rebroadcast on\nlocal American Broadcasting Company network stations provided nobody connected\nwith the production of the broadcast is paid. A copy of the script may be\nsecured without charge from the National Conference of Christians and Jews,\n381 Fourth Avenue, New York 16, New York. Extra copies may be reproduced or\nreceived at a charge of ten cents each.\n11. THE WORST BOY IN SCHOOL - The \"Let’s Play Fair\" radio series by Gretta\nBaker includes this fifteen-minute radio script originally presented by the\nNational Conference of Christians and Jews. Johnny is not liked because of\nhis background. His teacher makes him understand he must act above reproach-\nment in order to gain his schoolmates’ favor. Simple production and a cast\nof seven are required. This script may be rebroadcast on local independent\nstations. For free copies of the script write to the Radio Department of\nthe American Jewish Committee, 386 Fourth Avenue, New York 16, New York.\n12. THE BOMBS THAT MISSED - The \"Let’s Play Fair\" radio series by Gretta\nBaker includes this fifteen-minute script originally presented by the National\nConference of Christians and Jews. It is a story about the glory and signifi-"
}