{
  "id": "d657-21",
  "text": "- 19\nChristmas, philosophize about the war. They discover they are fighting for\nthe same thing - unity and brotherhood of man. The point is brought out that\nthe Jews celebrate Hanukkah about the same time, and that everybody, regard¬\nless of faith or religion, worships the same God. Production of this script\nis simple, and a cast of about eight is required. This script may be re¬\nbroadcast on independent local stations. A copy of this script can be secured\nwithout charge by writing to the National Conference of Christians and Jews,\n381 Fourth Avenue, New York 16, New York. Extra copies may be reproduced or\nreceived at a charge of ten cents each.\n19. NO MONKEYSHINES - A ten-minute dramatization by Barbara Gair about two\ngirls of different faiths who are close friends until one of the parents ob¬\njects to this friendship because of difference of'religion. Through the in¬\ntervention of their son, a veteran, they are made to realize the folly of\ntheir way of thinking. It is a simple production with a cast of about five\ncharacters. The script may be rebroadcast on independent local stations.\nCopies of this script can be secured without charge by writing to the Radio\nDepartment, American Jewish Committee, 386 Fourth Avenue, New York 16, New\nYork.\n20. SCAPEGOAT - The \"Blue Playhouse\" series includes this half-hour broad¬\ncast written by Ira Marion and originally presented on the Blue Network, now\nthe American Broadcasting Company network. Hitler's policy of choosing a\ngroup of people as scapegoats to acquire his end is dramatized. There is a\nlarge cast of about seventeen. However, many voices are just brought in, in\nmontage and each person can act more than one part. Full-scale production\nis required. Permission is not granted for the use of this script on the\nradio. This script is being sent out free by the Radio Department of the\nAmerican Jewish Committee, at 386 Fourth Avenue, New York 16, New York.\n21. THE MELTING POT BOILS - The \"Here's to Youth\" series originally presented\non the National Broadcasting Company network includes this half-hour drama¬\ntization presented by the Girl Scouts and Boy Scouts of America and other\norganizations. The poisoning of the minds of youth by enemy propaganda is\nthe theme of this story. This script may be rebroadcast on member stations\nof the National Broadcasting Company network. There is a cast of about fifteen\nand full-scale production is necessary. Write to the Radio Department of the\nAmerican Jewish Committee, 386 Fourth Avenue, New York 16, New York, for free\ncopies.\n22. ALL MEN ARE EQUAL - The \"Blue Playhouse\" series includes this half-hour\ndramatization written by Ira Marion and originally presented on the Blue\nNetwork, now the American Broadcasting Company network. The story is told\nof the Springfield Plan, an educational experiment in making a whole city\ninto a laboratory of human relations. A committee is appointed to study the\nproblems involved in launching a program for teaching democracy. This script\nrequires full-scale production. A large cast is needed, but softie parts are\nvery small and one person can act more than one part. Permission is not\ngranted for the use of this script on radio. The Radio Department of the\nAmerican Jewish Committee, 386 Fourth Avenue, New York 16, New York is dis¬\ntributing these scripts without charge.\n23. TRAIL TO LIGHT - The series \"Blue Playhouse\" includes this half-hour\ndramatization by Ira Marion on the life of Dr. Joseph Goldberger, discoverer\nof the cure for pellagra. This is an original Blue Network script, now the\nAmerican Broadcasting Company network. The cast consists of about thirteen"
}