{
  "id": "d657-22",
  "text": "20 -\nand requires rather full-scale production. Permission is not granted for\nthe use of this script on the radio. Write to the Radio Department of the\nAmerican Jewish Committee, 386 Fourth Avenue, New York 16, New York for a\nfree copy of this script.\n24. HAYM SOLOMON - An original thirty-minute \"American School of the Air\"\ndramatization presented on the Columbia Broadcasting System network. This\nis the story of the life of Haym Solomon and his humanitarian acts. This\nscript may be rebroadcast on member stations of the Columbia Broadcasting\nSystem network. Full-scale production and a cast of about ten are required.\nScripts can be secured without charge from the Radio Department, American\nJewish Committee, 386 Fourth Avenue, New York 16, New York.\n25. ADVENTURE IN FRIENDSHIP - This fifteen-minute dramatization was written\nby Jean Dupont Miller (based on her novel \"A Wish For Tomorrow\" published\nby Dodd, Mead) for the Girl Scouts of the United States of America. It is\na fictional report of an international Girl Scout encampment and shows how\ngirls of different nationalities and races live together at camp and become\nfriends, conscious of the importance of maintaining that friendship in all\nnations as they grow older. Simple production and a cast of about seven are\nrequired. The program may be rebroadcast on independent local stations.\nCopies of the script may be secured from the National Equipment Service,\nGirl Scouts of the United States of America, 155 East 44th Street, New York\n17, New York, at twenty-five cents each.\nStories About Displaced Persons\n1. EXODUS ’47 - A thirty-minute dramatization by Michael Sklar, originally\npresented on Station WMCA, New York, New York. It is a dramatized account\nof the treatment accorded Jewish DPs who attempt to reach Palestine but\nare returned to German internment camps by the British. Full-scale production\nand a cast of about eight are required. The script may be rebroadcast on\nindependent local stations. For free copies of the script write to the\nRadio Department of the American Jewish Committee, 386 Fourth Avenue, New\nYork 16, New York.\n2. NIGHTMARE - CHAPTER TWO - A thirty-minute dramatization written by Allan\nE. Sloane, originally presented by the United Jewish Appeal on the American\nBroadcasting Company network, starring A1 Jolson. This is a story of the\nsuffering and heartbreak endured by European DPs. There are certain figures\nand statistics in this script which would have to be brought up to date.\nBefore making any changes, the United Jewish Appeal would have to be consulted\nFull-scale production and a cast of about seventeen are required. The script\nmay be rebroadcast on member stations of the American Broadcasting Company\nnetwork only. For free copies of the script write to the United Jewish Appeal\n165 West 46th Street, New York 19, New York.\n3. THE BAXTERS ADOPT A FAMILY - This thirty-minute dramatization, presented\nby \"The Baxters\" and written by Ruth Moore, is an original National Broad¬\ncasting Company network broadcast. Realizing how fortunate they are to be\nin America, the Baxters decide to \"adopt\" a family in Warsaw by sending them\nfood and clothing periodically. This script may be rebroadcast on member\nstations of the National Broadcasting Company network. Full-scale production\nand a cast of about four are required. For free copies of the script write"
}