{
  "id": "d657-23",
  "text": "- 21\nto the Radio Department of the American Jewish Committee, 386 Fourth Avenue,\nNew York 16, New York.\n4. GATEWAY TO A LAND OF FREEDOM - This thirty-minute dramatization presented\nby the \"National Hour\" and written by Roy de Groot is an original National\nBroadcasting Company network broadcast. It is a story about the immigration\nproblems of today -- a tragic story of patience and hope, with a dream of\nAmerica always on the horizon. The contributions made by immigrants are\nstressed. This script may be rebroadcast on member stations of the National\nBroadcasting Company network. Full-scale production and a cast of about\nsixteen are required. Free copies of the script can be secured from the\nRadio Department of the American Jewish Committee, 386 Fourth Avenue, New\nYork 16, New York.\n5. CHILDREN OF BABEL - A fifteen-minute dramatization by Max Ehrlich origi¬\nnally presented by the Young Men’s Christian Association. The story is about\na recently returned veteran who recalls the poor displaced children he saw.\nIt is a plea to help the unfortunate displaced persons. Full-scale production\nand a cast of about eight are required. The script may be rebroadcast on\nlocal independent stations. For copies of the script without charge write\nto the Radio Department of the American Jewish Committee, 386 Fourth Avenue,\nNew York 16, New York. Recordings of this program are also available and\nare listed under \"Recordings.\"\n6. CAN IMMIGRATION NOW HELP AMERICA - A thirty-minute interview about immi¬\ngration by the Citizens' Committee on Displaced Persons. The script requires\nonly a narrator and a guest speaker. It may be rebroadcast on local inde¬\npendent stations. Free copies of the script can be secured from Ted Hudes\nof the Citizens’ Committee on Displaced Persons, 39 East 36th Street, New\nYork 16, New York.\n7o THE SIXTH RESOLUTION - A thirty-minute dramatization by George Magee\nfeaturing Raymond Edward Johnson and originally presented by the United\nJewish Appeal on Station WMCA, New York, New York. The drama deals with an\nex-GI concerned about the fulfillment of the Sixth Resolution of the Atlantic\nCharter which says \"That all men, in all lands, may live out their lives in\nfreedom...\" Full-scale production and a cast of about five are required.\nThis script may be rebroadcast on independent local stations. Copies without\ncharge can be secured from the Radio Department of the American Jewish Com¬\nmittee, 386 Fourth Avenue, New York 16, New York. Recordings of this program\nare also available and are listed under \"Recordings.\"\nForum Scripts\n1. HOW TO COMBAT PREJUDICE IN CHILDREN - A thirty-minute script of a round¬\ntable discussion on how to combat prejudice in children. It is an original\nMutual Broadcasting System network broadcast. The participants on the origi¬\nnal broadcast were Ezra Stone, Dr. Lawrence Frank, Miss Ethel Alpenfels, Bill\nBrandt and Carl Van Doren. This script may be rebroadcast on member stations\nof the Mutual Broadcasting System network. Copies of the script without\ncharge can be secured from the Radio Department of the American Jewish Committee,\n386 Fourth Avenue, New York 16, New York. Recordings of this program are also\navailable and are listed under \"Recordings.\""
}