{
  "id": "d657-24",
  "text": "- 22 -\nInterfaith War Stories\n1. EXODUS - A thirty-minute dramatization written by Sol Panitz and originally\npresented on Station WINX and WINX-FM, Washington, D.C. This story tells.of\nan incident in Palestine in which a small group of Arabian and Jewish people\ngo into the desert to live together in order to prove to the outside world\nthat they can live harmoniously. They are led by an Arabian and his Jewish\nwife. A former British army major accompanies them. Full-scale production\nand a cast of about seven are required. This script is not to be used for any\npurpose without prior permission from the author, Sol Panitz, c/o Kal, Ehrlich\nand Merrick, Star Building, Washington, D.C. In order to secure copies of the\nscript without charge write to the Radio Department of the American Jewish\nCommittee, 386 Fourth Avenue, New York 16, New York.\n2. THE BID WAS FOUR HEARTS - A thirty-minute dramatization written by Reverend\nTimothy Mulvey, originally presented on the National Broadcasting Company net¬\nwork. This is a story of the four chaplains, one Catholic, two Protestants,\nand one Jewish, who gave up their life belts on the S.S. Dorchester to the\npassengers on the ship so that they could continue to fight for their country.\nFull-scale production and a cast of about nineteen are required. This script\nis the property of the National Broadcasting Company and may not be used in any\nmanner without special permission of NBC. However, NBC is disposed to permit\nany meritorious public service performance on specific request to the Manager\nof the Script Division, National Broadcasting Company, 30 Rockefeller Plaza,\nNew York 20, New York. To obtain free copies of the script write to the Radio\nDepartment of the American Jewish Committee, 386 Fourth Avenue, New York 16,\nNew York.\n3. THE TRIPLE \"K\" - This thirty-minute dramatization presented by the \"Bright\nTomorrow\" radio series and written by Sol Panitz is an original Station WINX,\nWashington, D. C. broadcast. The story of a married veteran who returns to\nAtlanta, Georgia, to find that the Ku Klux Klan is still rampant is told in\nsimple, straight and unvarnished style. Full-scale production and a cast of\nabout six are required. This script is not to be used for broadcast purposes,\nbut is to be limited to meetings and school use. Copies of the script may be\nsecured without charge from the Radio Department of the American Jewish Com¬\nmittee, 386 Fourth Avenue, New York 16, New York.\n4. THE SOLOMONS AND THE SMITHS - A fifteen-minute dramatization by Jerome\nBayer originally presented by the National Conference of Christians and Jews.\nIt is a story about Mr. Smith, who is awakened from his false prejudices to\nreality of the shamefulness of his actions and thoughts. Fairly simple pro¬\nduction and a cast of about seven are required. The script may be rebroadcast\non independent local stations. Copies without charge may be secured from the\nNational Conference of Christians and Jews, 381 Fourth Avenue, New York 16,\nNew York.\n5. ON A NOTE OF TRIUMPH - An hour's dramatization written by Norman Corwin\nand originally presented on the Columbia Broadcasting System network. This\nscript, hailing victory in Europe, is a kind of questionnaire asking and\nanswering the sharpest questions of the day. Full-scale production and a\ncast of about twenty-five are required. Permission to publicly perform this\nplay for any purpose whatsoever must be applied for well in advance of the\nprogram to Henry Holt and Company, 257 Fourth Avenue, New York 10, New York.\nThis script, with other Norman Corwin scripts, are being made available in\nbook form titled \"Untitled, and Other Radio Dramas\" at $3.00 by Henry Holt and"
}