{
  "id": "d657-25",
  "text": "- 23\nCompany. Credit should reads \"From ’Untitled and Other Radio Dramas’ by\nNorman Corwin, published by Henry Holt and Company. Reprinted by permission\nof the publishers.\"\n6. NINE SEPTEMBER - A thirty-minute dramatization by Philip A. Young. This\nis an original American Broadcasting Company network broadcast. A service¬\nman, glorying in his return to America, relates a war story which points up\nthe thoughtlessness of discrimination because of color or creed. Full-scale\nproduction and a cast of about five are required. This script may be re¬\nbroadcast on member stations of the American Broadcasting Company network.\nCopies of the script are distributed without charge by the Radio Department\nof the American Jewish Committee, 386 Fourth Avenue, New York 16, New York.\nRecordings of this program are also available and are listed under \"Recordings.\"\n70 STORY OF THREE PALS - A fifteen-minute story written and presented by\nRobert St. John on the National Broadcasting Company network. The story\nis of \"three pals,\" a Protestant, Catholic and a Jew, who are part of a\nwinning football team in high school. Each \"pal\" meets his death in the\nwar after making the supreme sacrifice. A straight narration which only\nrequires a narrator. Due credit should be given if used. This script may\nbe rebroadcast on member stations of the National Broadcasting Company net¬\nwork. Free copies of this script may be secured from the Radio Department,\nAmerican Jewish Committee, 386 Fourth Avenue, New York 16, New York.\n8. UNTITLED - The series \"Columbia Presents Corwin\" includes this half-hour\nstory by Norman Corwin originally presented on the Columbia Broadcasting\nSystem network. It tells about a dead American soldier, a typical American\nG. I. Joe, and the family and friends he left behind. The cast consists of\nabout nine people, and full-scale production is required. Permission is not\ngranted for the use of this script on the radio. The script can be secured\nfree from the Radio Department of the American Jewish Committee, 386 Fourth\nAvenue, New York 16, New York.\n9. SCAPEGOATS OF HISTORY - This is an original National Broadcasting Company\nnetwork half-hour dramatization by Ben Kagan presented on the \"Words at War\"\nseries. The script is based on the \"They Got the Blame\" pamphlet and the\nbook \"History of Bigotry in the United States\" which tell the story of scape¬\ngoats and bigotry in history. There are about thirteen in the cast, but\nsince some of the parts are short, actors can double in other roles. Full-\nscale production is required. Permission is not granted for the use of this\nscript on radio. The Radio Department of the American Jewish Committee, 386\nFourth Avenue, New York 16, New York is distributing the script free of charge.\n10. ISTANBUL - The \"Dateline\" radio series originally presented on the\nColumbia Broadcasting System network includes this fifteen-minute dramatization\nby Margaret Miller. It points up Nazi ruthlessness and the necessity of trans¬\nporting the persecuted Jewish people to havens of refuge. There are about ten\nin the cast, and full-scale production is required. This script may be re¬\nbroadcast on member stations of the Columbia Broadcasting System network.\nFor this script without charge write to the Radio Department of the American\nJewish Committee, 386 Fourth Avenue, New York 16, New York."
}