{
  "id": "d657-27",
  "text": "25 -\nRADIO RECORDINGS\nListed hereunder are recordings available for rebroadcast on local\nstations affiliated with the network on which the broadcast was originally\npresented. Please note network designations in description of programs to be\nrebroadcast. Some of the recordings, if so indicated in the description, may\nbe rebroadcast on independent local stations. Clearance for rebroadcasting\nthese recordings has been granted by the American Federation of Musicians and\nthe American Federation of Radio Artists. If presentation of a recording is\nnot permitted on the air, it will be noted in the description of that particu¬\nlar recording.\nRecordings of broadcasts which were presented under the auspices of the\nAmerican Jewish Committee can be secured from the Radio Department of the\nAmerican Jewish Committee. Sponsorship of these programs by the American Jewish\nCommittee is mentioned in the opening and closing announcements of the programs.\nThe half-hour recordings are obtainable at about $10.40 each, in two\ndifferent sizes. There are 16-inch, 33 l/3-revolutions-per-minute recordings,\nwhich must be played on a special playback machine. This machine can usually\nbe secured from local stations or radio stores. The recordings are to be used\nonly for non-commercial purposes. Recordings can also be secured in the 12-inch,\n78-revolutions-per-minute size, which can be played on a regular phonograph.\nFifteen-minute recordings are obtainable for about $5.20, in the two above-\nmentioned sizes.\nThe advantage of the 33 l/3-revolutions-per-minute recording is that\neach recording plays for fifteen minutes before it has to be changed. The 78's\nmust be changed about every four minutes, thereby losing some effectiveness.\nThese recordings are not to be played for profit or under commercial\nsponsorship. For description of these programs, look under ’’Scripts.” Most\nof these recordings are available in script form.\nSERIES\nInterfaith Recordings\n1. ALL ABOARD FOR ADVENTURE (SERIES IV) - A set of twelve fifteen-minute\nrecordings produced by the Joint Religious Radio Committee. They are on\nthe field of intercultural education. Leaders’ guides have been prepared,\nas well as a picture book, which is advertised in the recordings. The\ndiscs come in 16-inch, 33 l/3-revolutions-per-minute size at $35.00 and\n12-inch, 78-revolutions-per-minute size for home use at $25.00 a set.\nThey may be rebroadcast on independent local stations. For further in¬\nformation contact Reverend Everett Parker, care of the Joint Religious\nRadio Committee, 287 Fourth Avenue, New York 10, New York. The following\nis a list of the dramatizations:"
}