{
  "id": "d657-28",
  "text": "26 -\n1. SENSE AND NONSENSE: A dramatization of the book by the same\nname by Ethel Alpenfels. The script deals with facts about\nthe races. Miss Alpenfels appears in the program to discuss\nanthropology with two junior aged children.\n2. PUDDIN’ HEAD’S DREAM: Puddin' Head Brown, a one hundred per\ncent American boy, learns how deeply indebted he is to \"foreigners”\nfor the everyday items of living.\n3. CHINA AROUND THE CORNER: The story of a little Chinese girl\nwho is unable to attend school or church in the town in which\nshe lives. She is befriended by a white girl chum and the church.\n4. PROMISED LAND: The story of a Jewish father and mother and their\ntwo children who came as refugees to Rhode Island in colonial\ntimes, and how Roger Williams taught them Christians believe that\nall men are brothers. Rabbi David de Sola Pool leads the dis¬\ncussion section of this program.\n5. CALLING DR. BLAKE: Tells of a seriously ill white child whose\nmother objected to the assignment of a Negro specialist to treat\nher daughter; and how the doctor and the girl won out in their\nstruggle to put friendship above race prejudices.\n6. SECOND CLASS CITIZENS: A Navajo Indian boy returns from the war\nto convince his people that they need education and closer ties\nwith their white neighbors.\n7. OKAY, GUISEPPE: The adventures of an Italian orphan in an\nAmerican school and how the American sense of fair play can win\nout over prejudices against a foreigner.\n8. NO PLACE IS HOME: The struggles of a Mexican migrant child to\nobtain an education and find a permanent home.\n9. KOKI COMES HOME: The story of a Japanese family which returns\nfrom a relocation center to find its home burned down, and how\nwhite friends in the church helped out.\n10. BROTHERS UNDER THE SKIN: A tale of tension between national\ngroups. A Christian settlement house worker shows a Ukranian\nand a Polish boy how to live together in friendship.\n11. BOY WHO GOT THERE BY HIMSELF-PART I: The story of Dr. George\nWashington Carver’s boyhood and his struggle to get an education.\n12. BOY WHO GOT THERE BY HIMSELF-PART II: The story of Dr. Carver’s\ncollege days and his career as a scientist working for Christian\nbrotherhood and good will.\n2. ALL ABOARD FOR ADVENTURE (SERIES VI) - This series is |50 for the 16-inch,\n33 l/3-revolutions-per-minute size recordings. They may be rebroadcast on\nindependent local stations. For further information contact Reverend Everett\nParker, Joint Religious Radio Committee, 287 Fourth Avenue, New York 10, New\nYork. The following is a list of the dramatizations:"
}