{
  "id": "d657-29",
  "text": "- 27 -\n1. THE MYSTERIOUS STRANGER: Robbie Flint, a boy with a\nbig imagination, discovers that \"the stranger in our\nmidst\" is a person very much like ourselves.\n2. LET FREEDOM RING: There is a chaos in the Tuckertown\nGrammar School when Class Six A experiments with self-\ngovernment and abolishes all rules.\n3. THE LUCKIEST GIRL IN TOWN: Patricia Tucker, the\nrichest girl in town, makes friends with Anna Provosky\nfrom Railroad Row, and learns that owning \"things\" is\nonly a small part of happiness.\n4. WHO’S TO BLAME?: When Joey Provosky, a latchkey child,\nis run over, the more fortunate ones discover their\nsocial responsibility to their neighbors.\n5. TEAM WORK: With the help of Mr. Ferguson, the minister,\nthe children of Tuckertown try to start a day nursery\nfor Joey.\n6. RACHEL'S HOLIDAY: From Rachel, a Jewish playmate,\nMolly Malone learns of the ancient festival of Sukkos,\nand religious tolerance.\n7. FALSE FACES: Robbie Flint has had a grudge against\nold Mr. Crump for a long time. At Hallowe'en he hides\nbehind a mask to get even, with exciting consequences.\n8o PANTY-WAIST: The boys of Tuckertown are scornful of\nPeter Paine who would rather write poetry than play\nbasketball, but in the end they find a new respect\nfor mental achievement.\n9. THE COLOR OF SANTA CLAUS: A Christmas story that\nhits at the timely problem of racial prejudice.\n10. WHAT MONEY CAN'T BUY: The jack-knife in Mr. Gosling's\nhardware store seems the most desirable thing in the\nworld to Robbie Flint until he learns that it comes\nat too high a price.\n11. PARENTS ARE PEOPLE: An amusing fantasy in which Terry\nMalone changes places with his parents and learns of\nsome of the problems involved in child-rearing.\n12. THE UNINVITED GUESTS: At a picnic on Turtle Creek,\nMr. Ferguson tells Tuckertown children what is\nhappening to the children of Europe.\n3. ALL ABOARD FOR ADVENTURE (SERIES VII) - This series is $35 for the\n16-inch, 33 l/3-revolutions-per-minute size recordings. It may be obtained\nfor $15 if Series VI has already been purchased at $50. The series may be\nrebroadcast on independent local stations. For further information contact\nReverend Everett Parker, Joint Religious Radio Committee, 287 Fourth Avenue,\nNew York 10, New York. The following is a list of the dramatizations:"
}