{
  "id": "d657-30",
  "text": "28 -\n1. MOLLY MALONE DISCOVERS HERSELF: The story of a girl\napproaching adolescence and how she finds a balanced\nrelationship to the standards of beauty.\n2. FOLLOW THE LEADER: A sensitive boy finds that sticking\nto his convictions and not submitting to group pressure\nis a more wholesome way of living.\n3. WAR AND PEACE COME TO THE MALONES: A story of how\ndemocracy works in the family illustrated by the\nfunctioning of a family council.\n4. THE SCAPEGOAT: A presentation of the cultural idea of\nthe scapegoat with a modern application.\n5. THE WORST BOY IN TOWN: A tough teen-aged boy finds\nout for himself that he has social responsibility as\nwell as privileges.\n6. THE OTHER BUTCH DOOLITTLE: A continuation of the\nprevious story giving a specific account of how social\nresponsibility can be met by children.\n7. ROBBIE’S GOLDMINE: Two boys learn that there are other\nvalues in life in addition to money.\n8. ROBBIE FLINT DISCOVERS AMERICA: Children from Grade 6A\nof the Tuckertown School learn to appreciate the inter¬\nmingling of various cultures in America, especially the\nvalues contributed by displaced persons.\n4. ALL ABOARD FOR ADVENTURE ALBUM - The Joint Religious Radio Committee\nhas permitted the American Jewish Committee to prepare a special album of\nfour 16-inch, 33 l/3-revolutions-per-minute size \"All Aboard For Adventure\"\nprograms, titled:\n1. RACHEL’S HOLIDAY: From Rachel, a Jewish playmate, Molly\nMalone learns of the ancient festival of Sukkos, and\nreligious tolerance.\n2. THE COLOR OF SANTA CLAUS: A Christmas story that hits\nat the timely problem of racial prejudice.\n3. THE SCAPEGOAT: A presentation of the cultural idea of\nthe scapegoat with a modern application.\n4. MY LITTLE BROTHER: The story of a little Harlem boy,\nwho all his life has been afraid. He goes to Vermont\nto spend the summer with a white family and learns that\nall men are brothers.\nThe programs may be presented on independent local stations and the album may\nbe secured from the Radio Department of the American Jewish Committee, 386\nFourth Avenue, New York 16, New York, at $10."
}