{
  "id": "d657-31",
  "text": "- 29 -\n5. LEST WE FORGET - THESE GREAT AMERICANS - A set of thirteen, 16-inch,\n33 l/3-revolutions-per-minute, fifteen-minute dramatic recordings are avail¬\nable to radio stations free of charge as a public service broadcast; to\nschools for $15 per complete set and a discussion guide handbook for teachers;\nalso to community organizations, from the Institute for Democratic Education,\n415 Lexington Avenue, New York 17, New York. For a full description of the\nprograms see ’’Scripts.\"\n6. LEST WE FORGET - THE AMERICAN DREAM - A set of thirteen, 16-inch 33 1/3-\nre volutions -per-minute , fifteen-minute dramatic recordings, are available\nto radio stations free of charge as a public service broadcast, from the\nInstitute for Democratic Education, 415 Lexington Avenue, New York 17, New\nYork. For a full description of the programs, see \"Scripts.\" A Manual for\nthe Development of Radio Panel Discussions for this series includes an ad¬\nditional fifteen-minute live broadcast following the playing of the tran^\nscribed program. The Manual offers outlines which can be used as discussion\nguides for each program in the \"American Dream\" series. This type of dis¬\ncussion relates the problems presented by this series to the local community\nscene.\n7. LEST WE FORGET - STORIES TO REMEMBER - A series of thirteen, 16-inch,\n33 l/3-revolutions-per-minute, fifteen-minute transcribed adaptations. These\nprograms may be presented on radio networks or independent local stations.\nFor a full description of the programs, see \"Scripts.\" The discs may be\nsecured without charge from the Institute for Democratic Education, 415\nLexington Avenue, New York 17, New York.\n8. RADIO EDITION OF THE BIBLE - This recorded series of thirteen, 16-inch,\n33 l/3-revolutions-per-minute discs of Bible stories, each fifteen minutes\nlong, has been produced by the Joint Religious Radio Committee. Distinguished\nactors of stage and screen play the leading roles. The set is available for\n$15.00 and may be rebroadcast on independent local stations. For further\ninformation about the series write to: Reverend Everett C. Parker, Direotor\nof Radio, care of Joint Religious Radio Committee, 287 Fourth Avenue, New\nYork 10, New York.\n9. WITHIN OUR GATES - Sixteen-inch, 33 l/3-revolutions-per-minute recordings\nare available and may be used for meetings in Philadelphia only. They may\nbe secured from the Philadelphia Fellowship Commission, 260 South 15th Street,\nPhiladelphia 2, Pennsylvania. For special permission to present these pro¬\ngrams on the air, write to the Radio Department of the American Jewish Com¬\nmittee, 386 Fourth Avenue, New York 16, New York. These programs are also\navailable in script form, and are listed under \"Scripts.\"\n10. HATE, INCORPORATED - Sixteen-inch, 33 l/3-revolutions-per-minute re¬\ncordings are available and may be used for meetings in Philadelphia only.\nThey may be secured from the Philadelphia Fellowship Commission, 260 South\n15th Street, Philadelphia 2, Pennsylvania. For special permission to present\nthese programs on the air, write to the Radio Department of the American\nJewish Committee, 386 Fourth Avenue, New York 16, New York. These programs\nare also available in soript form, and are listed under \"Scripts.\""
}