{
  "id": "d657-32",
  "text": "- 30 -\nStories About Displaced Persons\n1. TO YOU IN AMERICA - A series of six 16-inch, 33 l/3-revolutions-per-\nminute, fifteen-minute documentary dramatizations for radio use, produced\nby Frank Papp in behalf of Church World Service through the cooperation of\nthe National Broadcasting Company and the Joint Religious Radio Committee.\nThe series brings the American listening public into direct contact with\nthe voices of the displaced people of Europe - voices telling not only of\nhunger, frustration and despair, but also of hope and confidence in the\nfuture. The programs may be presented on local independent stations. For\ncopies of the recordings gratis, write to Radio Department, Church World\nService, Inc., 214 East 21 Street, New York 21, New York, or Radio Depart¬\nment, Church World Service, Inc., 3330 West Adams Boulevard, Los Angeles\n16, California.\nSpot Announcements\n1. KEEP FAITH WITH AMERICA - A series of four one-minute spot announcements,\nconceived and produced by Station WNEW, New York, New York, in cooperation\nwith the Institute for Democratic Education, designed to counteract group\nprejudice. It features Jay Jostyn, as narrator, and a section of the\n\"Ballad For Americans.\" Sixteen-inch, 33 l/3-revolutions-per-minute record¬\nings are being distributed without charge for local station use by the\nInstitute for Democratic Education, 415 Lexington Avenue, New York 17,\nNew York.\n2. FOREIGN LANGUAGE SPOT ANNOUNCEMENTS - Sixteen-inch, 33 l/3-revolutions-\nper-minute transcribed one-minute spot announcements in Polish, Italian and\nSpanish, designed to improve intergroup relations. They are available with¬\nout charge as a public service feature for foreign language broadcasts from\nthe Institute for Democratic Education, 415 Lexington Avenue, New York 17,\nNew York. Scripts of the spot announcements are also available and are\nlisted under \"Scripts.\"\n3. SPOT ANNOUNCEMENTS ON DISPLACED PERSONS - Eight one-minute spot announce¬\nments are available for use by local stations throughout the country. The\nannouncements, prepared under the auspices of the Citizens’ Committee on\nDisplaced Persons, are made by such outstanding personalities as: General\nWilliam J. Donovan, Walter White, Governor Herbert H. Lehman, Edward Corsi,\nLeon Henderson, Justice Owen J. Roberts, Marshall Field, and James Farley.\nSixteen-inch, 33 l/3-revolutions-per-minute recordings are available without\ncharge. For copies of the recordings, write to Mr. Ted Hudes, Citizens'\nCommittee on Displaced Persons, 39 East 36 Street, New York 16, New York.\n4. LITTLE SONGS ON BIG SUBJECTS - A series of ten one-minute spot jingles\nwritten by Hy Zaret and Lou Singer and produced by Station WNEW, New York,\nNew York. These are singable tunes designed to promote better inter-group\nunderstanding. Twelve-inch, 33 l/3-revolutions-per-minute recordings are\nbeing distributed without charge for broadcast purposes on local stations\nonly by the Institute for Democratic Education, 415 Lexington Avenue, New\nYork 17, New York. There are two kits also available on the \"Little Songs\nOn Big Subjects,\" one for $8, the other for $2Q. The $8 kit contains three\nsong books, one record album of unbreakable recordings, one film strip with"
}