{
  "id": "d657-33",
  "text": "- 31 -\nthe lyrics of all songs and illustrations by Soglow, plus one hundred illus¬\ntrated pamphlets with all the lyrios. The difference between the two kits\nis that the $20 one contains one thousand illustrated pamphlets. If bought\nindividually, the record album is $2, the sheet music 75^, the film strip\n$3.50, and one hundred pamphlets $2.\nForeign Language Recordings\n1. FOREIGN LANGUAGE SKETCHES - Sixteen-inch, 33 l/3-revolutions-per-minute\ndiscs containing four, five-fifteen-minute sketches in Italian designed to\nimprove intergroup relations. They are available free as a public service\nfeature for foreign language broadcasts, from the Institute for Democratic\nEducation, 415 Lexington Avenue, New York 17, New York.\nSPECIAL ONE-TIME BROADCASTS\nReligious Recordings\n1. BEHOLD THE JEW - (Rosh Hashanah - New Year) - Sixteen-inch, 33 l/3-revolu-\ntions-per-minute recordings of this program are available and may be rebroad¬\ncast on local National Broadcasting Company network stations and independent\nlocal stations. They may be purchased through the Radio Department, American\nJewish Committee, 386 Fourth Avenue, New York 16, New York at about $10.40.\nThis program is also available in script form, and is listed under \"Scripts.\"\n2. THE SEALED TUNNEL - (Yom Kippur - Day of Atonement) - Sixteen-inch,\n33 l/3-revolutions-per-minute recordings of this program are available and\nmay be purchased through the Radio Department of the American Jewish Committee,\n386 Fourth Avenue, New York 16, New York, at about $10.40. In order to re¬\nbroadcast this recording, the regular American Federation of Radio Artists\ntranscription rates will have to be paid to all performers involved. This\nprogram is also available in script form and is listed under \"Scripts.\"\n3. DAY OF ATONEMENT BROADCAST - Sixteen-inch, 33 l/3-revolutions-per-minute\nrecordings of this program are available and may be rebroadcast on local\nColumbia Broadcasting System network stations and independent local stations.\nThey may be purchased through the Radio Department of the American Jewish Com¬\nmittee, 386 Fourth Avenue, New York 16, New York, at about $10.40. This pro¬\ngram is also available in script form, and is listed under \"Scripts.\"\n4. BATTLE OF THE WARSAW GHETTO-(Hanukkah - Feast of Dedication) - Sixteen-\ninch, 33 l/3 revolutions-per-minute recordings of the program are available\nand may be rebroadcast on local National Broadcasting Company network stations\nand independent local stations. They may be purchased through the Radio De¬\npartment, American Jewish Committee, 386 Fourth Avenue, New York 16, New York\nat about $10.40. This program is also available in script form, and is listed\nunder \"Scripts.\"\n5. COURAGE IS THEIR BADGE-(Purim - Feast of Lots) - Sixteen-inch 33 1/3-\nrevolutions -per-minute recordings of this program are available and may be\nrebroadcast on local National Broadcasting Company network stations and inde¬\npendent local stations. They may be purchased from the Radio Department,"
}