{
  "id": "d657-34",
  "text": "- 32 -\nAmerican Jewish Committee, 386 Fourth Avenue, New York 16, New York at about\n$10.40. This program is also available in script form, and is listed under\n\"Scripts.\"\n6. THE FORGOTTEN LETTER - (Pesach - Passover) - Sixteen-inch, 33 l/3-revolu-\ntions-per-minute recordings of this program are available. They may be\npurchased through the Radio Department of the American Jewish Committee,\n386 Fourth Avenue, New York 16, New York, at about $10.40. In order to re¬\nbroadcast this recording, the regular American Federation of Radio Artists\ntranscription rates will have to be paid to all performers involved. This\nprogram is also available in script form and is listed under \"Scripts.\"\n7. PASSOVER PROGRAM - (Pesach - Passover) - Sixteen-inch, 33 1/3-revolutions-\nper minute recordings of this program are available. They may be purchased\nthrough the Radio Department of the American Jewish Committee, 386 Fourth\nAvenue, New York 16, New York, at about $10.40. In order to rebroadcast this\nrecording, the regular American Federation of Radio Artists transcription rates\nwill have to be paid to all performers involved. This program is also avail¬\nable in script form, and is listed under \"Scripts.\"\n8. THE BITTER HERB - (Pesach - Passover) - Sixteen-inch, 33 l/3-revolutions-\nper-minute recordings of this program are available and may be rebroadcast\non local Mutual Broadcasting System network stations and independent local\nstations. They may be purchased through the Radio Department of the American\nJewish Committee, 386 Fourth Avenue, New York 16, New York, at about $10.40.\nThis program is also available in script form, and is listed under \"Scripts.\"\n9. THE FOUR QUESTIONS - (Pesach - Passover) - Sixteen-inch, 33 l/3-revolutions-\nper-minute recordings of this program are available and may be rebroadcast on\nlocal Mutual Broadcasting System network stations and independent local stations\nThey may be purchased through the Radio Department, American Jewish Committee,\n386 Fourth Avenue, New York 16, New York, at about $10.40. This program is\nalso available in script form, and is listed under \"Scripts.\"\n10. THE THIRD COMMANDMENT - THE STORY OF A MODERN EXODUS - (Pesach - Passover)\nSixteen-inch, 33 l/3-revolutions-per-minute recordings of this program are\navailable and may be rebroadcast on local Mutual Broadcasting System network\nstations and independent local stations. They may be purchased through the\nRadio Department of the American Jewish Committee, 386 Fourth Avenue, New\nYork 16, New York at about $10.40. This program is also available in script\nform, and is listed under \"Scripts.\"\n11. THE GOLDEN CALF - (Shevuoth - Tabernacles) - Sixteen-inch, 33 1/3-revolu¬\ntions -per -minute recordings of this program are available and may be rebroad¬\ncast on local National Broadcasting Company network stations and independent\nlocal stations, and purchased through the Radio Department, American Jewish\nCommittee, 386 Fourth Avenue, New York 16, New York at about $10.40. This\nprogram is also available in script form, and is listed under \"Scripts.\"\nInterfaith Recordings\n1. LIGHTS OUT - For permission to broadcast, write to the Radio Department\nof the American Jewish Committee. It may be used at meetings and in schools.\nThe 16-inch, 33 l/3-revolutions-per-minute recording can be purchased through\nthe Radio Department of the American Jewish Committee, 386 Fourth Avenue,"
}