{
  "id": "d657-35",
  "text": "33\nNew York 16, New York, at about $10.40. This program is also available in\nscript form, and is listed under \"Scripts.*1\n2. MRS. CAMPBELL’S ONE WORLD - This 16-inch, 33 l/3-revolutions-per-minute\n\"World Security Workshop\" recording may be rebroadcast on local American\nBroadcasting Company network stations and purchased through the Radio Depart¬\nment of the American Jewish Committee, 386 Fourth Avenue, New York 16, New\nYork, at about $10.40. This program is also available in script form, and\nis listed under \"Scripts.,\"\n3. MY LITTLE BOY - This recording may not be rebroadcast on the air, but\nmay be used at schools and for meetings. It is available in both the 12-inch,\n78-revolutions-per-minute and 16-inch, 33 l/3-revolutions-per-minute size.\nThe 12-inch recording is $5.25; the 16-inch recording $4.25. For copies of\nthe recording write to the Bureau for Intercultural Education, 157 West 13th\nStreet, New York 11, New York. The program is also available in script form\nand is listed under \"Scripts.\"\n4. THE LONELIEST BOY IN TOWN - Sixteen-inch, 33 l/3-revolutions-per-minute\nrecordings of this program are available at $10 a set. Twelve-inch, 78-\nrevolutions-per-minute recordings may also be secured at $5 a set. Both the\n16-inch and the 12-inch recordings may be secured at $12. They may be re¬\nbroadcast on independent local stations. For copies of the recording write\nto the Jewish Welfare Board, 145 East 32nd Street, New York 16, New York.\nThis program is also available in script form and is listed under \"Scripts.\"\n5. THE NEW ROAD - FORWARD WITH SONG AND COURAGE - Twelve-inch, 78-revolutions-\nper-minute recordings of this program are available at $10 each. It may be\nrebroadcast on independent local stations. For copies of the recording\nwrite to the Jewish Welfare Board, 145 East 32nd Street, New York 16, New\nYork. This program is also available in script form and is listed under\n\"Scripts.\"\nYouth Recordings\n1. ONE GOD - Sixteen-inch, 33 l/3-revolutions-per-minute recordings of this\nprogram originally produced by Station WNEW, New York, New York, may be re¬\nbroadcast on local radio stations and secured from the Radio Department,\nAmerican Jewish Committee, 386 Fourth Avenue, New York 16, New York. A\nlimited number of these recordings in the 16-inch, 33 l/3-revolutions-per-\nminute size has been specially prepared and may be ordered from the Radio\nDepartment of the American Jewish Committee, at $3.50 each. When this supply"
}