{
  "id": "d657-36",
  "text": "- 34 -\nis used up, special recordings will have to be ordered at about $10.40\neach. This program is also available in script form, and is listed under\n\"Scripts.\"\nStories About Displaced Persons\n1. THESE THY BRETHREN - A fifteen-minute dramatization featuring Everett\nSloane and produced by the Citizens Committee on Displaced Persons. It is\na story about displaced persons, who, though liberated, have no home to which\nto go. Recordings without cost can be obtained by writing to Ted Hudes, of\nthe Citizens Committee on Displaced Persons, 39 East 36th Street, New York 16,\nNew York, and may be rebroadcast on independent local stations.\n2. THE SIXTH RESOLUTION - This recording mav be rebroadcast on local stations\nthroughout the country. Sixteen-inch, 33 1/3-revolutions-per-minute size\nrecordings can be secured at about $10.40 through the Radio Department of\nthe American Jewish Committee, 386 Fourth Avenue, New York 16, New York.\nThis program is also available in script form, and is listed under \"Scripts.\"\n3. CHILDREN OF BABEL - This 16-inch, 33 l/3-revolutions-per-minute recording\nmay be broadcast on local stations throughout the country and purchased\nthrough the Radio Department of the Young Men’s Christian Associations, 347\nMadison Avenue, New York 17, New York, at $5. This program is also available\nin script form, and is listed under \"Scripts.\"\nForum Recordings\n1. HOW TO COMBAT PREJUDICE IN CHILDREN - Sixteen-inch, 33 l/3-revolutions-\nper-minute recordings of the program may be rebroadcast on local Mutual\nBroadcasting System network stations and purchased through the Radio Depart¬\nment of the American Jewish Committee, 386 Fourth Avenue, New York 16, New\nYork, at about $10.40. This program is also available in script form, and\nis listed under \"Scripts.\"\n2. IS FAIR EMPLOYMENT LEGISLATION GOOD FOR BUSINESS? - A 16-inch, 33 1/3-\nrevolutions -per-minute recording of a thirteen minute-seventeen seconds\nforum about fair employment legislation, presented by the National Citizens’\nCouncil on Civil Rights. These are open-end recordings, allowing time for\nlocal announcements. The participants are Judge Robert P. Patterson, former\nSecretary of War; William L. Batt, President of S.K.F. Industries, Phila¬\ndelphia; Oren Root, prominent New York attorney; Leo M. Cherne, Executive\nSecretary of the Research Institute of America, who also acts as moderator.\nThe recording may be broadcast on independent local stations, and may be\nobtained for $2 from the National Citizens’ Council on Civil Rights, 20 West\n40fch Street, New York 18, New York.\n3. RELIGION AND FAIR EMPLOYMENT PRACTICES - A 16-inch, 33 l/3-revolutions-\nper-minute recording of a thirteen minute-fifty seconds forum about religion\nand fair employment practices, presented by the National Citizens’ Council\non Civil Rights. These are open-end recordings, allowing time for local\nannouncements. The participants are Dr. Henry P. Van Dusen, President of the\nUnion Theological Seminary; Father Charles Keenan, Managing Editor of the\nCatholic publication \"America;\" Dr. Robert W. Searle, Executive Secretary of"
}