{
  "id": "d657-4",
  "text": "Religious Scripts\n- 2 -\nSERIES\n1. THE ETERNAL LIGHT - A weekly series of half-hour dramatizations by Morton\nWishengrad and other radio writers now being presented by the Jewish Theo¬\nlogical Seminary of America on the National Broadcasting Company network,\nSundays, 12:30-1:00 P.M. This series dramatizes stories of Jewish heritage\nembracing Jewish history, culture and literature. Full-scale production and\na rather large cast are required for each program. For permission to rebroad¬\ncast these programs, write to the Jewish Theological Seminary of America,\n3080 Broadway, New York 27, New York. Scripts are now being distributed with¬\nout charge by the Jewish Theological Seminary of America. A collection of\ntwenty-six selected \"Eternal Light\" scripts written by Morton Wishengrad is\navailable for |3 from Crown Publishers, 419 Fourth Avenue, New York 16, New\nYork.\n2. RELIGIOUS NEWS REPORTER - A weekly fifteen-minute script on current re¬\nligious events of interest to Catholic, Protestant and Jewish faiths, produced\nunder the auspices of the Religious News Service. These scripts may be broad¬\ncast on independent local stations. Interfaith groups, round-table meetings,\nchurch associations, and others will be interested in producing this series.\nBecause these programs call for only a commentator, they are easily produced.\nRates are available upon inquiry and the scripts are obtainable from the\nReligious News Service, 381 Fourth Avenue, New York 16, New York.\nInterfaith Scripts\n1. TO SECURE THESE RIGHTS - A series of three half-hour dramatizations by\nRaphael Hayes which were originally presented on Station WMCA, New York, New\nYork. Part One is titled \"To Secure These Rights,\" Part Two, \"The Montclair\nExperiment,\" Part Three, \"A Program For Action.\" Each of these dramatiza¬\ntions refers to the Report of the President's Committee on Civil Rights, and\nshows how effective its recommendations can be. Full-scale production and\na cast of about ten are required for each. The scripts may be rebroadcast\non independent local stations. Free copies of the scripts may be secured\nfrom the Radio Department of the American Jewish Committee, 386 Fourth Avenue,\nNew York 16, New York.\n2. NEITHER FREE NOR EQUAL - This series of six fifteen-minute dramatizations\noriginally presented on Station WCCO, Minneapolis-St. Paul, Minnesota, in\ncooperation with the National Conference of Christians and Jews, the Minnesota\nJewish Council and other social agencies, tells the story of prejudice, bigo¬\ntry and racial discrimination - the story of those Americans who are \"neither\nfree nor equal.\" The causes of this situation are traced. The scripts refer\nspecifically to the Minneapolis-St. Paul scene, but may be adapted to other\nlocalities. Full-scale production and a cast of about twenty are required\nfor each script. They may be rebroadcast on independent local stations. Free\ncopies of the script may be secured from Station WCCO, 625 Second Avenue,\nSouth Minneapolis 2, Minnesota.\n3. INSIDE STORY - A series of twelve fifteen-minute dramatizations originally\npresented on Station WGAR, Cleveland, Ohio, in cooperation with the Community"
}