{
  "id": "d657-5",
  "text": "5\nRelations Board of the City of Cleveland. The scripts are analyses of what\ngoes on inside a city — inside a neighborhood — inside people. Fairly\nsimple production and mostly small casts are required. The scripts may be\nrebroadcast on independent local stations. For copies of the scripts with¬\nout charge write to the Radio Department of the American Jewish Committee,\n586 Fourth Avenue, New York 16, New York.\n4. WITHIN OUR GATES - A weekly series of half-hour dramatizations now being\npresented by the Philadelphia Fellowship Commission on Station WFIL, Phila¬\ndelphia, Sundays, 11:30-12:00 Noon. This series dramatizes the lives of\nbenefactors of mankind. Included in this series are contributions by\nscientists, musicians, educators and others in various walks of life. Each\nscript has a cast of about nine and requires full-scale production. Scripts\nare being distributed for meetings and rebroadcast on independent local sta¬\ntions without charge by the Philadelphia Fellowship Commission, 260 South\n15th Street, Philadelphia 2, Pennsylvania. Recordings of this series are\nalso available and are listed under \"Recordings.”\n5. HATE, INCORPORATED - A weekly series of half-hour programs originally\npresented by the Philadelphia Fellowship Commission on Station WIP, Phila¬\ndelphia, Pennsylvania. This series, based on actual facts but using fic¬\ntitious names and places, exposes the hate movements in America. Each\nscript requires full-scale production and has a cast of about nine characters.\nThe scripts may be rebroadcast on independent local stations, and can be\nsecured free of charge from the Philadelphia Fellowship Commission, 260 South\nFifteenth Street, Philadelphia 2, Pennsylvania. Recordings of this series\nare also available and are listed under \"Recordings.\"\n6. LEST WE FORGET - THESE GREAT AMERICANS - A set of thirteen, fifteen-minute\ndramatizations produced by the Institute for Democratic Education. They tell\nthe story of men and women who dedicate their lives to the American principle\nthat all men are created equal. Dramatized are the lives of Wendell Willkie,\nJoseph Goldberger , Jane Addams, Holmes-Brandeis, George Washington Carver,\nA1 Smith, Samuel Rompers, George W. Norris, Franz Boas, Joseph Pulitzer,\nWoodrow Wilson, Franklin D. Roosevelt. Full-scale production is required.\nThe scripts are available to radio stations free of charge as a public service\nbroadcast; to schools for $2 a set of thirteen and a discussion guide handbook\nfor teachers; also to community organizations, from the Institute for Demo¬\ncratic Education, 415 Lexington Avenue, New York 17, Few York. Recordings of\nthese programs are also available and are listed under \"Recordings.\"\n7. LEST WE FORGET - THE AMERICAN DREAM - A set of thirteen, fifteen-minute\ndramatizations produced by the Institute for Democratic Education. These\nstories are based on actual incidents and tell about people who succeed in\novercoming the problems of prejudice and discrimination: Helen Hayes as a\nschool teacher, Paul Lukas as a store keeper, Canada Lee as a prizefighter,\nFredrio March as a university professor, Sam Levene as a cab driver, Ralph\nBellamy as a sheriff, etc. Full-scale production is required. The scripts\nare available to radio stations free of charge as a public service broadcast,\nfrom the Institute for Democratic Education, 415 Lexington Avenue, New York\n17, New York. Recordings of these programs are also available and are listed\nunder \"Recordings.\"\n8. LEST WE FORGET - STORIES TO REMEMBER - A series of thirteen, fifteen-\nminute adaptations, produced by the Institute for Democratic Education.\nStories by well-known authors such as MacKinlay Kantor, Irwin Shaw, Carl Glick,"
}