{
  "id": "d657-8",
  "text": "- 6 -\n4. BATTLE OF THE WARSAW GHETTO - (Hanukkah - Feast of Dedication) - This\nis a thirty-minute script in celebration of Hanukkah written by Morton\nWishengrad and sponsored by the American Jewish Committee. It is an\noriginal National Broadcasting Company network program. A modern parallel\nis drawn of the Maccabean Revolt. The story is told of the heroic struggle\nof the people of the Warsaw Ghetto. Raymond Massey starred as narrator in\nthis program. Full-scale production and a cast of about eleven are required.\nThe script may be rebroadcast on member National Broadcasting Company net¬\nwork stations and on local independent stations. The script can be secured\nfree of charge from the Radio Department of the American Jewish Committee,\n386 Fourth Avenue, New York 16, New York. Recordings of this program are\nalso available and are listed under \"Recordings.”\n5. COURAGE IS THEIR BADGE - (Purim - Feast of Lots) - A thirty-minute\ndramatic story in celebration of Purim written by Lisa Barrett Drew and\npresented by the American Jewish Committee on the National Broadcasting\nCompany network. It tells of the Danes’ courageous defiance of a modern\ntyrant in the liberation of their Jewish brethren. Fredric March starred\nas narrator on this broadcast. The cast numbers some twelve characters and\nrequires full-scale production. The script may be rebroadcast on member\nstations of the National Broadcasting Company network and independent local\nstations. Scripts are being distributed free by the Radio Department of the\nAmerican Jewish Committee, 386 Fourth Avenue, New York 16, New York.\nRecordings of this program are also available and are listed under\n\"Recordings.\"\n6. QUEEN ESTHER - (Purim - Feast of Lots) - A thirty-minute original\n\"Columbia Workshop\" biblical story of Queen Esther written by Norman Corwin,\nand presented on the Columbia Broadcasting System network. The cast consists\nof five men and one woman. This script requires full-scale production. For\npermission to rebroadcast the script, write to the Radio Department of the\nAmerican Jewish Committee, 386 Fourth Avenue, New York 16, New York. Free\nscripts can be secured from the American Jewish Committee.\n7. THE FORGOTTEN LETTER - (Pesach - Passover) - A half-hour dramatization\nwritten by Ben Kagan and sponsored by the American Jewish Committee. It is\nan original Mutual Broadcasting System network broadcast in commemoration of\nPassover, starring Sam Wanamaker and Kim Hunter, which tells a story of the\nfirst Passover celebration in America in 1655. The drama is based on one\nof the earliest documents establishing freedom for all in the New World, the\nhistoric letter of the Dutch West India Company granting equal rights to all\nminorities in the colony which later became New York. Full-scale production\nand a oast of about ten are required. The script may be rebroadcast on\nmember stations of the Mutual Broadcasting System network and independent\nlocal stations. Copies of the script may be secured without charge from\nthe Radio Department of the American Jewish Committee, 386 Fourth Avenue,\nNew York 16, New York. Recordings of this program are also available and\nare listed under \"Recordings.\"\n8. PASSOVER PROGRAM - (Pesach - Passover) - A fifteen-minute religious\nservice program originally presented over the Columbia Broadcasting System\nnetwork by the American Jewish Committee. It is an explanation of the\nPassover Seder which answers the four questions asked by the youngest child\nof the home. The script may be rebroadcast on member stations of the Columbia\nBroadcasting System network and independent local stations. It requires\nsimple production and a rabbi, cantor and choir. Free copies of the script"
}