{
  "id": "d1914-1",
  "text": "NAEB NEftS LETTER\nPage\n.2*,.\n.,. .June I» 1942\nNj»_U»£.«A, RADIO COMMITTEE REPORTS\nThe report of the National University Extension Association Committee\non Radio, of. which Bruce Mahon, University of Iowa, was chairman, and\nWaldo Abbot, University of Michigan, a member, contains some information\nWHICH WILL OF INTEREST TO YOU, PERHAPS, YOU8LL LIKE TO READ THE ENTIRE\nreport, If so, see your extension division head. Otherwise, here are\nTHREE EXCERPTS FROM THE REPORTS\nPROGRESS:\nIo A DEFINITE ADJUSTMENT IN PROGRAMS TO AID THE WAR EFFORT AND\nCIVILIAN MORALE.\n2* A STEADY IMPROVEMENT IN THE QUALITY OF RADIO PROGRAMS.\n3. -Expansion of courses in various aspects of radio.\n4. Closer cooperation between commercial and eduqational broad¬\ncasting stations,\n5. Improved publicizing of programs,\n6. Expansion of radio workshops and laboratories for training\nstudents,\n7o Expansion of radio councils or statewide networks,\n8. Increased recognition of the value of radio as a tool in ed¬\nucation.\n9, Expansion of conferences and institutes dealing with various\naspects of radio in education,\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS: This organiza¬\ntion of educational institutions engaged in broadcasting through\nthe facilities of their own transmitters or using the facilities\nOF OTHERS HAS BEEN VERY ACTIVE DURING THE PAST YEAR, THE ANNUAL\nmeeting was held at Purdue University in September, 1941. Other\nMEETINGS WERE HELD AT CHICAGO IN DECEMBER AND AT COLUMBUS fN MAY.\nThe next annual meeting will be held at Madison in September,\nThis association was originally organized with a view to protecting\nTHE INTERESTS AND FACILITIES OF EDUCATIONAL BROADCASTING STATIONS\nAND WHI.LE IT STILL FUNCTIONS IN THI S CAPACITY, STS ACT! VtTTES HAVE\nEXPANDED TO INCLUDE DISCUSSION AND ACTION ON ALL PROBLEMS THAT MAY\nBESET THE EDUCATIONAL BROADCASTERS, An EXECUTIVE SECRETARY IS\nEMPLOYED WHO PUBLISHES A BI-MONTHLY NAEB NEWS BULLETIN DESIGNED\nTO KEEP MEMBERS INFORMED OF ALL DEVELOPMENTS IN THE FIELD OF EDUCA¬\nTIONAL BROADCASTING, \"^HIS SERVICE HAS RECENTLY BEEN AUGMENTED 8Y\nTHE ORGANIZATION OF A SCRIPT EXCHANGE,\nCOMM ITTEE RECGMMENOATiONS:\n1. The continued development of broadcasting facilities in member\nINSTITUTIONS,\n2. The promotion of cooperative broadcasting councils,\n3. The encouragement of educational agencies to make application\nFOR ULTRA-HIGH FREQUENCIES NOW SEtf ASIDE FOR EDUCATION,\nPAN-AMERICAN PROGRAMS ON KWSC\nExciting imaginative trips to South America Afte the privilege of KWSC"
}