{
  "id": "d1914-2",
  "text": "NAES NEWS LETTER\nPage 3\nJune I, 1942\nPAN-AMERICAN PROGRAMS ON KWSC (contIdI\nLISTENERS VERY TUESDAY AND WEDNESDAY AFTERNOONo TWO GEOGRAPHY PRO-\nGRAMS WHICH EMPHASISE POINTS OF INTEREST ABOUT INDUSTRIAL, SOCIAL\nAND HISTORIAL LATIN AMERICA ARE OFFERED BY THE STATION OF THE STATE\nCollege of Washington, according to Director Kenneth Yeend.\na Salute to Our Utin American il£jjmaa&a» Tuesday at 2s45, and OyR.\nNeighbors to the South* Wednesday at 2s00, are offered to create a\nMORE GENEROUS MtM UNDERSTANDING OF THE PEOPLE AND GOVERNMENTS OF\nthe South American nations to the end that good Pan-American re¬\nlations CAN BE PROMOTED TO THE UTMOST a\nMUSICAL PROGRAMS OF WNYS\nClassical music played by the New York Philharmonic in L^wisohn\nStadium, popular march tunes played by the Goldman Sand on the Mall in\nCentral Park, and the best in dance and swing tunes played by the\nTOP-NOTCH NAME BANDS FEATURE THE SUMMER SCHEDULE OF MUNICIPAL STATION\nWNYC AS ANNOUNCED BY DIRECTOR S. NOV8K0\nThe Goldman Band-headed by Eowin Franke Goldman, begins its Silver\nJubilee season later this month, with the initial WNYC broadcast\ncoming on Monday, June 22, at 8s30 to 9s45 p.m. This famous organi¬\nzation WILL THEN BE HEARO IN WNYC BROADCASTS EACH MONDAY AT THAT\nhour through August 10th.\nThe Sunday series of broadcasts by the New York Philharmonic Symphony\nOrchestra over WNYC begins, as already announced, on Sunday evening,\nJune 28th with 8s00 to IQsOO plm. as broadcast time. It is now re¬\nvealed THAT WNYC WILL ALSO CARRY A GROUP OF Friday EVENING PROGRAMS\nby the Philharmonic from Lewsbqhn Stadium, beginning on Frioay June 19,\nAND CONTINUING THROUGH FRIDAY, JULY\nBOUTWELL PRAISES RADIO\nRadio during the past twenty years has outstripped print in effective¬\nness, William D* Boutwell, chief of the Division of Radio, Publication\nand Exhibits, Uc S. Office of Education, told more than 100 delegates\nof the National University Extension Association meeting at the\nPennsylvania State College here yesterday morning. He stressed radio s\nimportance in building better hemisphere relations, as did Sterling\nFisher, assistant public service counsellor of NBv, New York.\nIn describing radioes superiority over the printed medium in effective¬\nness, Boutwell quoted research statistics that the average radio is\non five hours a day.\nCOMMISSION FURTHER RELAXES OPERATOR RULES.\nResponding to war-time shortages of technical personnel for broadcast\nstations, especially critical in cases of smal^ stations, the Federal\nCommunications Commission, today, through the Order No. 9UB, further"
}