{
  "id": "d537-0",
  "text": "NAEB NETWORK REPORT\n11-13-53\nNAEB Annual Convention\nOct, 30, 1953\nThe following report will attempt to answer such questions as are most\noften asked about the Network operation, to show something of the conditions un¬\nder which its Headquarters works, to show both progress and current problems, and\nto express recommendations for the improvement of Network service,\n1) NETWORK OPERATION AND EQUIPMENT. The Network Headquarters manner of operation\nand its equipment are substantially the same as at this time last year. The Net¬\nwork has aquired a little more shelving, a few more tapes (we have almost 7,000\nreels), and some minor equipment replacement. It has had two tape inspection de¬\nvices built in an attempt to reduce the number of bad tapes being circulated. The\nNetwork employs the same number of workers, and for a time during the summer of\n1953 it employed fewer,\n2) NETWORK OUTPUT. Since the installation of the Network’s mass duplicator and\nthe commencement of the individual distribution system (as opposed to the old\n\"leg system”) last year, the Network output has increased considerably. As many\nas twenty-two master tapes are duplicated and distributed each week, and as many\nas 1,250 tape recordings are dispatched. Not all of these recordings are mass\nduplicated: a greatly varying number of individual dubbings are done each week.\nThe number of series distributed (counting a series as consisting of up to thirteen\nprograms, twenty-six programs as two series) has increased thirty per cent. The\nnumber of stations to which the Network sends recordings (as distinguished from the\nnumber of transmitters or call letters using the recordings: 102) has dropped from\n85 to 79, but the number using in-school programs has increased from 30 to 47.\nTen in-school program series were distributed during the school year of\n1952-53; 17 series are being distributed during the present school year.\nLast winter NAEB and Network Headquarters made a count of its outgoing mail. The\nresult: 2,000 envelopes and 1,000 packages a month. The envelopes included letters,\ncue sheets, special announcements, Newsletters, etc.; the packages were mostly tape\nrecordings. This quantity has been increased an estimated thirty per cent, and\nHeadquarters predicts a continued sharp increase.\n3) IN-SCH00L AND GENERAL pR0GRAMMTNG. Because the problem of satisfactorily hand¬\nling the in-school program project is quite different from that of the week-to-\nweek distribution of general programs, the Network at one time regarded the two\nprojects as quite separate and as running more or less parallel in the same office.\nThis proved quite impractical. Neither project can be regarded simply as something\ndone ’’over and above” or even ’’along with” the other—especially since the great\nexpansion of the Network operation. There is only one Network organization in\none office, and every job must be coordinated with every other and the whole inte¬\ngrated into one project. Since last fall, progress has been made toward such an\nintegration but no perfect system has been developed because of the pressures re¬\nquiring maximum effort to keep on top of daily output. Unlike the general week-\nto-week series, in-school programs are mailed in complete series; that is, 14 pro¬\ngrams of a series go to a station at one time. Also stations receive an audition\ntape for a series before they definitely order it. During the offering and distri¬\nbution of these in-school programs, the week-to-week distribution must lessen in\nquantity to allow time and tape for this vrork. Or, to put it positively, between"
}