{
  "id": "d537-101",
  "text": "TEE NAEB (TAPE' NETWORK\nA STATEMENT OF ITS\nSERVICE AND FINANCIAL BASIS\nThe NAEB (Tape' Network Services educational, non-commercial AM and PM\nstations who arp members of the National Association of Educational Broadcasters*\nSince Network service is supplied only to those member stations who order it,\nonly 78 out of a possible 104 stations are currently being serviced.\nThe Network* during the Winter season of 1954, is supplying its member\nstations with weekly programs totalling seven hours of programming. In addition*\n14 series specifically designed for in-schcol broadcasting are being distributed\nto those stations who wish thorn.\nThe Network service is designed to supplement the programming don© by tha\neducational stations on a local level. It glvrs its stations an opportunity to\nbroadcast outstanding programs from other educational institutions—pregrams\nthat laake us© of resource personnel and material available only on that campus.\nThus, the resources of campuses all over the country are available to any NAEB\nNetwork station no natter how small or how limited its own resources, provided\nthat it can pay the small network fee. This potential, however thinly supported,,\nis on a of the most hopeful signs in American education today, in an age of in¬\ncreasing shortages of space and instructional staffs.\nAttached are the Network Offerings for the past four seasons. As can be\nseen, an effort has keen made to give Network stations a variety of program tyres:\nTalk, Drama, Documentary, Mucic, and Children’s Shows. The Network is not trying\nto usurp the initiative or stifle the producing departments of the member stations,\nso Network Off©*• ings are confined to such material as has national significance\nand wlose quality of content, and production values, merit national distribution.\nThe NAEB Network is financed in part by funds from the W. K. Kellogg\nFoundation, (who8^ support is being fazed out on a gradual basis, intended to\nmake the Network self-supporting by 1956) and in part by monies collected from"
}