{
  "id": "d537-104",
  "text": "The Educational Tape Network\nIt was recognized by the directors and program man of more than a score\nof educational radio stations assembled in the Allerton House seminar\nat the University of Illinois that the single most important factor\ncontributing to the slow growth and development of educational broad¬\ncasting over the years has been the unfavorable ratio of program staff\nresources to the number of hours in the broadcast day* It is obvious\nthat a simple exchange of the better programs produced by each educational\nstation or university program producing center would relieve not only the\npressure cm each staff but upgrade the program output as well* A central\nprogram producing service would supplement this exchange and bring excit¬\ning new resources and production skills to bear all along the line*\nA post-sendnar committee which included in its membership Richard B. Hull,\ndirector of the Iowa State College station WOI (AM-FU-TV), Cteorge Probst,\ndirector of the university o£ Chicago Roundtable, and Harold McCarty,\ndirector of the University of Wisconsin station WHA and the Wisconsin\nState FH Network, went immediately to the task of formulating the long\nrange plan for organizing a network of educational stations, developing\na central program-producing service and exploring possible sources of\nfinancial support for the enterprise* Concurrently, Seymour Siegel,\nthe director of the New York City stations WNXC and N1OT-FM, took the\ninitiative in implementing the program exchange proposal of the seminar*\nMr* Siegel and his staff inaugurated the \"bicycle network\" in the fall\nof 9. Its operation involved the routing of tape recordings of high\nquality educational programs from station to station around the country.\nThis practical demonstration of self-help caught on quickly and within\nthe short space of one year the \"bicycle network\" is providing approxi¬\nmately four hours of programs per week to twenty-eight, and limited\nservice to twelve other, educational stations from Boston to Los Angeles,\nand from Minneapolis to Baton Rouge.\n/ Since the educational network is operated without a budget, its develop¬\nment has been on a strictly \"self-help\" basis. Several organizations,\nincluding the Cooper Union and the New York Herald-Tribune, have made\navailable to the network limited quantities of i^etic tape in return\nV for the network broadcasting their forums. The stations themselves\nsupplied most of the additional reels of tape required in the operation.\nBecause of these limits on supply of tape and on the facilities for\nX duplicating programs, the network presently operates on a \"bicycle\"\nprinciple with tapes being shipped from station to station. The\nV physical hazards to a magnetized piece of tape in this sort of handling\nare obvious, but the problems of scheduling, simultaneous audience impact\nin different parts of the country, audience promotion, and dated material\nare of even greater importance. Some of the earlier programs broadcast\non the bicycle network required more than six months to make the round\nof stations. Following the removal of the network from New York to\nUrbana in January 1251, the bicycle network operates on a four leg"
}