{
  "id": "d537-107",
  "text": "In the late fall of 1950, the University of Illinois and the National\nAssociation of Educational Broadcasters, acting jointly, requested a\ngrant from the Kellogg Foundation for the facilities and staff to meet\nneed No. I and to supply the project with a program of fellowships and\ninternships for the personnel of educational radio stations. This\nproposal will be acted on by the Board of Directors of the Kellogg\nFoundation on or about March 15, 1951*\nIf these funds, basic to the effective operation of the network, are\nforthcoming then the network is tooled out but stands in great need of\nboth direction and content in its program offerings.\nAccordingly, we proposed to the Ford Foundation that five program area\nconferences be held in 1951* In general, these conferences would\nassemble for two days a group of twelve peoples six: subject area\nexperts and six educational broadcasters. The latter group would\ninclude station directors, a writer, a producer, etc. These confer¬\nences would go far beyond the mere suggestion of subjects of broadcasts|\nthey would spell out in detail material to be presented in programs,\nthe frame or reference in which it should be presented, ways and means\nby which listener involvement can be attained, etc. In other words,\nthe conferences would focus on the questions what is it that the\nAmerican people ought to know about a given area and how can that\nknowledge be communicated to them in such a way as to promote their\nunderstanding of the problem?\nTentative priorities for the subject area conferences are as followsi\n1. America and Russia\n2. Problems in American Foreign Policy\n3# America and India and Southeast Asia\nU. America and China\n5. Foundations of the American Commonwealth\nThe cost of these live conferences is estimated to be $6,000 each—\na total of $30,000. This amount is budgeted as follows!\nHonoraria\nThirty subject area experts at $100 •••••••••$ 3,000\nThirty media experts at $100 •••••••««*.. 3,000\nStenotypist reports of conferences at $300 • • • • . 1,500\nHotel accommodations at $500 • ««»••»»••*• 2,500\nPublishing and scripting at $2,000# «•••••.•• 10,000\nTravel at $2,000. . . . ••••• 10,000"
}