{
  "id": "d537-42",
  "text": "Network Report— 4\nA\ni\nV\n1 half-time worker , desk worker, (A full-time worker devoting approximate¬\nly half of her time to Network, half to MSB work)\n1 full-time worker devoting approximately half-time to desk work, half\nto physical processing#\nIn short. Network Headquarters (as distinguished from NAEB National Headquarters)\nhas five full-time workers, the equivalent of one of whom does the desk work in¬\nvolved. Obviously, this is inadequate bo the present still-expanding operation#\nThe Network Headquarters therefore recommends that additional help be made avail-\nable as needed# In the meantime, one half-time worker will be moved from physical\nto clerical work, and Network Headquarters will attempt to make use of NAEB Head¬\nquarters3 clerical personnel#\nBut the most helpful advance that could be made—and we consider this the main\n***? ffparJrW0Uld h® a car8ful® realistic redefinition of station-Network-\ncommittee relationships and responsibilities and an insistence on orderly standard¬\nized procedure by all parties# This redefinition should be complete down to \"who\nwrites what letters.’ Standard procedure cannot comprehend every conceivable sit-\nthem°n5 °* COUrse* bub ^ can and should be made to comprehend the greater part of\nS the Networlc submits the following suggestions, which iiXl\nbe considered activated unless countermanded?\nSTATIONS must submit an adequate number of Program Submission Forms for each pro¬\ngram or series they wish the NAEB to consider for possible distribution over the\nNetwork# (Six copies for programs submitted for the Network Acceptance Committee-\neight copies for programs submitted for the In-School Program committee#) Stations\nresponsible for the complete editing of programs for general distribution and\nwill have eoited programs at Network Headquarters at least five weeks before they\nar^tlb!rS!®S0d ,the air° (The ^-School Program Committee has in the past\nsaid that editing of their programs for Network distribution was unnecessary be-\ncause stations would edit them in adapting them to their own use#) See Appendix B\nfor Program Format Requirements. ^\n3SB ■ ^TWQ^..AC^PT41ICE>tCQM-ETTTEE and THj_,INgSCHOOL PROGRAM COMMITTEE will decide\nthe acceptance and rejection of all programs except those which are in any way so\n?i° r0n^er Qosm&ttee action impossible or those to which the Network is\ncommitted through other authorized agents# In the former cases the decision must\nb~ left t0 lJhe Executive Director of NAEB and /or the Network Manager#\n7!£SV50,d? S* submitted to the respective ckair^n who will forward the\nresuits to the Network Manager. Whether letters of acceptance or rejection should\nbe handled by the committee chairman, the Network manager, or the Executive Direc-\ntor is debatable# It is the opinion of the Network manager that these letters\nchairraen* can write them as impersonal commi-\ntG be Sent fr°m Hea^«a^rs, the chairmen should\nrender explicit coimaituee decisions and any evaluations should be advanced as im¬\npersonal, quotable committee reports#\n!$0L!U^SSvOn3 3Uch large quantities of tapes as to render the submission\n^nwatfnUld>S« °f d“Pliofted forms and tap® recordings for individual oonsmittee\n“to^SsSonf6 0haiMan °f °«tee “V * nesting to\nBjOffl„HEADQUABIERS will confine itself to its function as a distribution center"
}