{
  "id": "d537-96",
  "text": "Network Report — 3\ntunately, the recording quality of the Interlochen material (the original tapes\nsent NAEB) dropped considerably from the previous year,\n10) DUPLICATION AND MUSIC, The most difficult sounds to reproduce satisfactorily\nare those of music. Such duplication is especially difficult on a mass-duplica¬\ntion basis. The Network machine has had a year of hard work, and at present will\nnot do a satisfactory job on musical material. It is in a condition equivalent to\nthat of a car that has gone 50,000 miles, wide open.\nFor this reason we feel that until uhe mass-duplicator is thoroughly overhauled\nor another machine is acquired, the Network should not distribute music. The\namount of music distributed lately has been low, excepting for the Interlochen\nprograms which were duplicated not at Headquarters but on a new machine by WBAA,\nbut it would be best to temporarily avoid this area of programming altogether.\nThis is a pity, because we have some good music coming up; but if the Network can¬\nnot do justice to them, there is no good reason to tie up tapes on them when Net¬\nwork stations can do better by playing their own records. The Network Headquarters\nHopes to be able to release its duplicator for rebuilding, or at least for exten¬\nsive repairs, for the two weeks required in about one month. Possibly a new mach¬\nine will be acquired by that time. In either case the Network will again be able\nto distribute decentmusical recordings at that time.\n11) COSTS AND ’’SPECIAL WORK”. As mentioned above, the Network mails out not only\nmass-duplications, but a number of individual ”dub”. Every week the Network re¬\nceives more requests for ’’special” recordings than it has time to fill without\nslightly other work. Stations would like to have programs from past series, a cur¬\nrent program has been accidentally erased, etc. An increasing number of man-hours\nis being put into this kind of work, and the fee charged is only $1.00 a reel—\nhardly more than a token payment. The Network Headquarters therefore comtemplates\nencouraging stations to accept and save, if possible, copies of all series which\nthey may use in the future, thus enlarging their recording libraries; discouraging\nstations from regarding the Network as an Association Tape Library, which at pre¬\nsent it is not and cannot be; raising the charge for special recording jobs from\n$1.00 to at least $2.00 a reel in order to narrow the gap between expense and\npayment. (Note: The raise in fee to $2.00 has now been approved.)\n12) SUBMISSION FORMS. Special forms have been distributed to all stations and\nother possible contributors to the Network. These forms were devised to aid Net¬\nwork Headquarters and the two program committees—Network Acceptance and In-School\nProgram—in determining the disposition of programs. They were devised to hasten\naction on acceptance and rejection, and we are certain that they will be a great\nhelp in the Network operation—if they are used. nfortunately, as we anticipated\nat Headquarters, the use of these forms has been slighted. The contributor should\nsubmit not-., one copy, nor four copies of the form, but one copy for Headquarters\nand one copy for each member of the committee to which the program is to be referred.\nOtherwise the forms are of little help.\n13) CONCLUSION. The output of the Network has increased considerably.during the\npast year—just as it has brown from its very beginning as Radio Station WNYC, New\nYork City. The staff of its Headquarters has remained minimal because it has been\nthe belief of the Association and Network Headquarters that a young and rapidly\ngrowing operation should attempt to get the most from the least rather than fall\ninto the evils of early over-staffing.\nNetwork Headquarters staff consists of:\n3 full-time and 1 half-time worker concerned exclusively with the physical\nprocessing of tapes, record albums, books, and the records immed¬\niately attending this processing."
}