{
  "id": "d537-97",
  "text": "Network Report— 4\n1 half-time worker , desk worker (A full-time worker devoting approximate¬\nly half of her time to Network, half to NAEB work)\n1 full-time worker devoting approximately half-time to desk work, half\nto physical processing.\nIn short. Network Headquarters (as distinguished from NAEB National Headquarters)\nhas five full-time workers, the equivalent of one of whom does the desk work in¬\nvolved. Obviously, this is inadequate bo the present still-expanding operation.\nThe Network Headquarters therefore recommends that additional help be made avail¬\nable as needed. In the meantime, one half-time worker will be moved from physical\nto clerical work, and Network Headquarters will attempt to make use of NAEB Head¬\nquarters1 clerical personnel.\nthe most helpful advance that could be made—and we consider this the main\npoint of this report--would be a careful, realistic redefinition of Station-Network*\ncommitoee relationships and responsibilities and an insistance on orderly standard¬\nized procedure by all parties. This redefinition should be complete down to \"who\nwrites what letters.\" Standard procedure cannot comprehend every conceivable sit¬\nuation, of course, but it can and should be made to comprehend the greater part of\nTo help this redefinition, the Network submits the following suggestions, which will\nbe considered activated unless countermanded:\nNATIONS must submit an adequate number of Program Submission Forms for each pro¬\ngram or series they wish the NAEB to consider for possible distribution over the\nNetwork. .(Six copies for programs submitted for the Network Acceptance Committee;\neight copies for programs submitted for the In-£chool Program committee.) Stations\nare responsible for the complete editing of programs for general distribution and\nwiH have edited programs at Network Headquarters at least five weeks before they\nar<^+t.bf r ®d®ased °n th? air* ^The ^“School Program Committee has in the past\nsaid that editing of their programs for Network distribution was unnecessary be¬\ncause stations would edit them in adapting them to their own use.) See Appendix B\nfor Program Format Requirements. w\nggg. NETWORK, ACCEPTANCE COMMITTEE and THE IN-SCHOOL PROGRAM COMMITTEE will decide\n,tblfCeptre “?d rejecbion of 811 programs except those which are in any way so\nrenuer^1C0Mnittee action impossible or those to which the Network is\ncommitted through other authorized agents. In the former cases the decision must\nbe left to the Executive Director of NAEB and /or the Network Manager.\nbe submitted t0 the respective chairmen who will forward the\nbe bhe^Ietvork.^nage^ Whether letters of acceptance or rejection should\n+ywhe c°™-ttee chairraan, the Network manager, or the Executive Direc-\n* H debatabla* ^is the opinion of the Network manager that these letters\ntee^orrrenort1 he committee chairmen, who can write them as impersonal commi-\nrendfr ^ Jt0 be Sent fr°m Headquarters, the chairmen should\nexpllc^ committee decisions and any evaluations should be advanced as im¬\npersonal, quotable committee reports.\nWhen submissi°ns involve such large quantities of tapes as to render the submission\nmp, LJnu“bef? °f duPli<=ated for; 3 and tape recordings for individual committee\nreviewSthePsubSsSon! Cha“ °f **\" Pr°Per 00mmittee call • “^ting to\nHTWORK HEADQUARTERS will confine itself to its function as a distribution center"
}