{
  "id": "d489-10",
  "text": "-3-\nApart from the superficiality of such an answer, one is left\nwith the usually untended question of audience background,\nconcern, and point of view. A convenient illustration is\nfound in the usual argument for long range and widespread use\nof certain instructional television lessons, particularly if\nthey deal with technical or scientific subjects: \" the subject\nnever changes;\" \"physics on the east coast is the same as physics\non the west coast;\" \"the new math is the new math wherever it\nis taught,\" etc. Perhaps this is true in some instances; the\nsubject i£ constant, but the students may differ. And if they\ndo, then the uniform presentation of a body of knowledge will\nrange from offensive to meaningless for numbers of students\nwho might receive it.\nThe same conditions exist for programming outside the instruc¬\ntional sphere. Arguments about the importance of a program or\nthe validity of a presentation that are not attached to the\naudience for whom they are intended are no more than assertions\nthat the perceptions of a few will be shared by the many.\nThe reference to the audience is a critical one, for it is not\nlikely that controversial programs can be slipped into the\nschedule and broadcast without anyone noticing. And it is\nfear of audience reprisal or expectation of audience applause\nwhich motivates many who program stations; it could hardly be\notherwise. The station is no less subject to the local power\nstructure than are most other community institutions - the\nschools, the civic groups, the churches, the industries. So,\nwhile we may expect that educational stations can be a signifi¬\ncant force for change in a community, there is every reason to\nexpect that flagrant disregard for the local views on virtue\nwill result in employee dismissal, reduced funds, or power\nfailure at the transmitter. And then, what has been accomplished?\nClearly, the educational station must use all the resources\nit can to operate effectively in the interests of the many\ncommunities it can serve. But it is an error to think that\nit operates in a vacuum and can redress quickly those indi¬\nvidual and social inequities which other institutions in the\nsame community have not only left untended but may have per¬\npetuated. The station alone can accomplish only so much; and\na full schedule of nationally prepared programs on racial matters\nmay do no more to advance local civil rights than re-runs of\na Peggy Lee special will do to convince the resident chamber\nmusic society that it should change its repertoire."
}