{
  "id": "d489-17",
  "text": "-9-\nfive-minute programs, a number of which appear in\nthe offerings. Others cannot accommodate fifteen-\nminute programs, several of which are also included\neach quarter. Block programming causes problems\nfor some stations, as evidenced by the following\ncomment: \"...because of our program blocks, we\nare usually unable to carry programs that run more\nthan half-an-hour(with the exception of specials).\nThat eliminates most NER music programs and many\nlecture series.\" - KSAC, Manhattan, Kan. Reports\nfrom school stations indicate that \"the main reason\nfor not selecting more series of programs is lack\nof scheduling time. We have little time on the air\nbeyond our in-school hours.\" - KSLH-FM, St. Louis, Mo.\nA scheduling problem related not to the length of\neach program but rather to the duration of program\nseries elicited the following comments from station\nmanagers: \"Another major problem for the programme?\nis the program which runs for six or seven weeks\nout of a quarter and then ends. If this could be\navoided, it would be helpful.\" - WBGU-FM, Bowling\nGreen, 0. \"The major comment I would make is in\nreference to the number of programs in a series.\nWhile the commercial ’magic figure' is 13, many\neducational stations need 15 or more programs to have\na sufficient number for one full term. I actually\nneed 30 for a full broadcast year.\" - WDTR-FM,\nDetroit, Mich.\nIII. Program Balance Problems\nThis is a rather broad category, which depends\nheavily for interpretation on individual station\nmanagers' subjective evaluations of what consti¬\ntutes \"balanced\" programming. In some cases,\nprograms are rejected because they are too similar\nto other current NERN offerings. Obvious examples\ninclude Germany Today, BBC World Report, and\nEuropean Review. In other cases, program offerings\nduplicate locally produced series, causing one\nstation executive to complain that \" Some programs\nI would have liked to broadcast had to be eliminated\nbecause we did not know far enough in advance that\nthey would be available. As a result, local produc¬\ntions often covered the same general subject area\n--particularly race relations and social problems--\nand at the same time.\" - WFSU-FM, Tallahassee, Fla."
}