{
  "id": "d489-18",
  "text": "-10-\nMany stations also produce local programs on\ntopics of national or regional interest, often\ndropping NER shows dealing with the same topics\nfrom their schedules.\nThe most serious general complaint concerning pro¬\ngram balance is that there are too many lengthy\n\"talk\" shows. A representative comment: \"Frankly,\nwe’re overburdened with talk shows per se. We\nsimply are not on the air long enough to take more\nthan we do now.\" - WUSF-FM, Tampa, Fla.\nPrograms which deal with certain controversial\ntopics are sometimes rejected by stations, al¬\nthough the nature of their subject matter is\nnot always the determining factor in their elim¬\nination. For example, one station manager comments,\n\"Generally, we omit programs when we feel the topic\nis being overemphasized, run-into-the-ground commer¬\ncially, etc. Program series, one after another, of\nproblems in big city ghettos do not appeal to our\nlisteners. Now we do carry enough to let our people\nknow of the problems - we just don’t want to saturate\nthem.\" - KENW-FM, Portales, N.M. Stations are,\nhowever, subject to varying amounts of pressure\nboth from the listening public and from special\ninterest groups. For example, Georgetown Forum\nwas dropped from one station’s schedule not only\nbecause \"listeners thought the stilted introduction\nshould be changed,\" but also because the station\nhad received \"much criticism for lack of opposing\nviews on panels.\" - WHA, Madison, Wis. Another\nstation, reporting on the series, The Smoking\nDilemma, comments, \"We'd rather stay out of this.\nWe had one request from Tobacco industry for equal\ntime if we used anti-tobacco shows. It could snow¬\nball.\" - WUSF-FM, Tampa, Fla.\nOne of the most enlightening comments concerning\nselection of programs to maintain balance is the\nfollowing: \"The major reason for not choosing many\nof the NERN offerings is the matter of the role we\nhave chosen to play in broadcasting in Atlanta(and\nI hope that this is a major reason in every station).\"\nBecause of the absence of classical music from stations\nin a metropolitan area of 1.5 million people, \"we have\nfelt that much of our time should be devoted to this\nfield. At present, we are devoting about 75-80% of\nour afternoon-evening adult broadcasts to classical"
}