{
  "id": "d489-19",
  "text": "-11-\nmusic of varying sorts....In the past, Atlanta has\nhad an excellent FM music station,and perhaps will\nagain in the future. At such time, we would probably\ncut back on some of our music, and give more time to\npublic affairs, etc.\" - WABE-FM, Atlanta, Ga.\nIV. Limited Audience Appeal\nThis category is similar to the preceding one, but\nit pertains more directly to the choices of individual\nprograms for syndication than to the repetition of\ngeneral program types. Many factors affect the rejec¬\ntion of specific programs for lack of audience appeal;\namong the more significant are geographical location,\nthe limitations of radio as a medium of communication,\nthe presence or absence of a primary audience, the\nquality of the production, and, of course, the subject\nmatter or topic to be broadcast. The following\ncomments are representative of remarks made by sta¬\ntion managers throughout the country with regard to\nspecific NERN offerings;\nBelgium Today: \"NOBODY out here gives a damn about\nBelgium today or tomorrow and we're not sure that they\nshould. However, if we had a show called Iceland\nToday, I suspect that Belgium Today would beat it\nin audience appeal.\"- WOI-AM/FM, Ames, Iowa.\nWorld of the Rockhound: \"I feel that the doings of\namateur geologists is a bit specialized(26 half-hour\nprograms? Come now).\" - KUT-FM, Austin, Tex. \"Didn't\nknow any rockhounds in the area.\" - WBAA, Lafayette, Ind.\n\"The program content is so specialized that it would\nhave limited appeal. I can't afford program time for\nsuch a series in our program schedule.\" - WDTR-FM,\nDetroit, Mich. \"Seems to demand, television.\" - WGUC-FM,\nCincinnati, 0.\nThe London Echo: \"Arts are not as important in a\nsmall town with an engineering school.\" - WBAA, Lafayette,\nInd.\nNew Dimensions in Academic Freedom: \"Ranchers don't\ndig this. Faculty would rather talk about it than\nlisten.\" - KCWS, Ellensburg, Wash.\nOver the Back Fence: \"Rejected because of very\nlimited appeal in our area. Canada is a relatively\nminor power in world affairs. We feel that the only\npeople vitally interested in Canadian editorial opinion\nare those on the Canada desk at the State Department.\" -\nWOI-AM/FM, Ames, Iowa. \"Press reviews are rather\npasse.\" - WRVR-FM, New York, N.Y. \"Didn't like the show.\"\nWKSU-FM, Kent, 0."
}