{
  "id": "d489-20",
  "text": "-12-\nMany stations have made general critical remarks\nabout programs with limited audience appeal rather\nthan listing specific programs. Representative\nsamples appear below:\n\"Most of those not selected are either not of suffi¬\ncient interest to the WBEZ audience, or ’too far\nabove the level of our average listeners.'(We serve\nelementary and. high schools largely.)\" - WBEZ-FM,\nChicago, Ill.\n\"KCBL feels that over 80% of NAEB's offerings do not\nappeal to the type of audience we are trying to reach.\nWe are also in an area where 14 other commercial FM\nstations can be received and a countless number of AM\nstations, including three in our own city. Whether\nwe want to face the fact or not, we are in direct com¬\npetition for a listening audience....Another valid\npoint is that a student who sits in class all day and\nlistens to lectures does not particularly want to come\nhome, turn on the radio, and listen to more lectures.\nThis is not to mean, however, that educational ’talk*\nprograms need to be eliminated. KCBL does emphasize\nlocally produced educational programs that appeal in\na direct way to our local audience. We try to keep\nour local programs short, and we utilize a great deal\nof creative production. (One of the shortcomings of\nmany of NAEB’s programs is that creative production\nis lacking.)....\" - KCBL-FM, Greeley, Colo.\nV. Poor Technical Quality\nMost station managers, in one way or another, have\ncriticized either the poor production quality of\nNERN offerings or the terrible reproduction quality\nof NERN tapes. Judging from the vehemence of many of\nthe comments, this has been a major problem in the\npast. Perhaps, the addition of more sophisticated\ntape equipment, coupled with the move from Urbana to\nnew quarters in Washington will help remedy this problem.\nComments about the production values of various\nNERN offerings include the following: \"Some of\nthe series are poorly produced and should not be made\navailable for broadcasting.\" - KUNR-FM, Reno, Nev.\n\"Unfortunately, the network is often faced with the\nprospect of choosing among a few really good series\nand many not-so-hot items... Simply omit from considera¬\ntion series which were not up to standards of high\ntechnical and. content excellence.\" - KUT-FM, Austin,\nTex."
}