{
  "id": "d489-21",
  "text": "-13-\nNumerous comments concerning the technical quality\nof NERN musical offerings have been received.\nPrinted below are several which indicate quite\nclearly the reactions of most stations;\n\"Generally, in the past, we have shied away from\nNER music programs because of inferior dubbings -\nPerhaps, this will not be the case in the future.\"\nWHA, Madison, Wis. \"Poor technical quality, especially\ntrue of classical music recordings, some of which\nwe would like to program but are not acceptable to\nour Music Director, Don Glass.\" - WFIU-FM, Bloomington,\nInd.\nAnother frequently cited reason for the rejection of\nNERN offerings is the unavailability of NERN tapes\nin stereo. Although many affiliates are incapable\nof programming in stereo, those which are consider\nnetwork programming unacceptable for their audiences.\nReactions to this situation include the following:\n\"Stereo is one gigantic factor. We are a stereo\nstation and many programs here listed are available\ndirect from source in stereo.\" - KBYU-FM, Provo, Utah.\n\"Quality of NER music tapes has not been up to our\nstandards. Also, we are now stereo - performance\nnot particularly.good, etc.\" - WBKY-FM, Lexington, Ky.\nVI. Availability of Offerings from Other Sources\nIt should, be noted that many NERN affiliates\nreceive NERN offerings from other sources. For\nexample, Georgetown Forum and Periscope may be\nordered directly from their sources. BFA distributes\nforeign press reports comparable to those available\nthrough the network. Individual stations also offer\ntheir productions to affiliates before network syndi¬\ncation. Mary Jane in Perspective and The Inner Core,\nfor example, have been broadcast by many stations\nwhich received them directly from their sources.\nNumerous complaints about the duplication of tapes\navailable from other sources appear in the comments,\nalong with some suggestions for eliminating the\nproblem, e.g., \"We do not order Georgetown Forum\nfrom you because we can get it free from Georgetown -\ndirect - i.e. - why not advertise the show is avail¬\nable from them: put the time, effort and money into\nsomething not available.\" - KUAC-FM, College, Alaska."
}