{
  "id": "d489-67",
  "text": "RESOLUTION OF THE NAEB PROGRAMMING PRACTICES COMMITTEE\nSUBMITTED TO NAEB BOARD OF DIRECTORS FOR ADOPTION\nAT THE 1968 NATIONAL CONVENTION\nIt is clear that all noncommercial broadcasters must be con¬\ncerned with the development of programming responsive to the\nbroad needs of the large segments of our population which are\nculturally different and to a large extent black. These\nneeds are urgent and immediate.\nTherefore, be it resolved that: NAEB individual members,\ninstitutional members, and stations proceed immediately to\ninitiate action leading to additional programming that will\nsignificantly meet the needs of Black Americans, An essential\nfirst step will be to establish a true dialogue at all levels.\nBe it further resolved that: Additional steps be taken to\nascertain how the needs of all poor people in our society\nmight be served programmatically with appropriate action to\nbe taken as soon as these needs can be identified.\nBe it further resolved that: Each member station of the NAEB\nbe urged to adopt as official policy the above resolution and\ntake all necessary steps to implement this commitment. It is\nurged, therefore, that stations develop positive sensitivity\namong all levels of station personnel toward the target\naudiences and that the minimum implementation consist of\nthe appointing of one person whose major responsibilities\nshall be: 1) to serve as liaison between the station and the\ntarget audiences; 2) to conduct internal training which will\nassist staff members in establishing ties with the target\naudiences; 3) to lend special expertise for programming in\nthis area.\nBe it further resolved that: The NAEB will demonstrate its\nactive commiTment^to a philosophy encouraging social program¬\nming by member stations by the continuance of the office of\na national director concerned with this area. It is recom¬\nmended that the director shall have at least the following\nminimal responsibilities which are: 1) to provide frequent\ndetailed reports to member stations and individuals on pro¬\ngramming, training activities, and employment of program\npersonnel. He shall explore all flexible, imaginative means\nof disseminating this information; 2) to develop a compre¬\nhensive knowledge of potential funding and procedures relevant\nto all public and private sources; 3) to be available for\nconsultations, organization of workshops, and to assist local\nstations in their specialized program development; 4) to\nwork with the NAEB Personnel Service to develop a program\npersonnel information bank which can readily assist local\nstations in their desires to hire qualified, creative staff\nfrom minority groups."
}