{
  "id": "d489-79",
  "text": "I 'SJ EDUCATIONAL TELEVISION STATIONS\nA division of\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPHONE: 667-6000 • 1346 CONNECTICUT AVENUE • WASHINGTON, D.C. 20036\nOffice of the Executive Director\nMEMORANDUM\nTo: Bill Harley\nFrom: Ken Clark\nSeptember 19, 1968\nYou will shortly hear from Richie Meyer, Chairman of the\nProgram PracfcL£g£_Xgmmittee. But to sum up, in synopsis form\nonly wnat actions the Uommittee took, let me report a three¬\npronged resolution was prepared urging a national policy\nstating:\nItem #1: ...that the NAEB assert an official policy of\nconviction that every effort be made to program\nfor, by and about Negroes and other disadvantaged\npeoples. A priority is given to black America.\nItem #2: ...that the NAEB urge member stations to explore\nall avenues of communication with disadvantaged\npeoples, an effort that would include restructuring\ntraditional staff thought on social action and its\nrecipients.\nItem #3: ...that the NAEB continue gathering and disseminating\nprogram, employment, training and funding information\nthrough a national Project Director (whose minimal\nduties are then spelled out).\nRichie’s letter of transmittal explains the Committee’s position\nin more detail and will accompany the official resolution. Copies\nof the resolution are simultaneously being mailed to all members of\nthe Executive Board and the Executive Staff.\nThe Committee expressed an earnest desire to appear before the\nExecutive Board when it meets to consider the resolution prior to\npresentation to the Convention, to support the ideas expressed and\nto personally answer any requests for supportive information.\nA personal note: I found the Committee enthusiastic, hard¬\nworking and very committed to this project. - There was agreement\nthat the NAEB has now assumed a posture of national leadership in\na critical domestic crisis, a posture that is applauded by many\nmember stations, a posture from which retreat is unthinkable.\nKRC/cdl"
}