{
  "id": "d489-81",
  "text": "-2-\nMotivation for jobs begins in the secondary schools and\nearlier. Contacts are made with relatives and leadership\nfigures in many areas. If we want Negroes in educational\nbroadcasting jobs we are going to have to seek them from\nwhere they now exist in and out of schools. Then we will\nneed to train them. This means training for educational\nbroadcasting at a number of levels which are probably not\nexistent even today. Most of the employees, engaged in\neducational broadcasting, are not college graduates and\nnever will be. Thus our training needs are going to be\nrelated to secondary and post-secondary educational\ninstitutions. Both recruiting and training at this level\ntakes lots of money. Possible sources: the Corporation for\nPublic Broadcasting, as well as other public funds including\nVocational Education, Manpower Training and Redevelopment,\nand Office of Economic Opportunity.\n2. Programming: The average ETV station, for example,\nacquires three quarters of its programs from other than\nits own city and thus cannot control either the subject\nor the participants in the programs. Program selections\nare made from available sources. If the intent is to\nincrease the number of programs dealing with matters\nproductive to bettering of ghetto populations, we must\nhave more programs created which will be available for\nregional and national distribution as well as interest\nmore ETV stations in making such programs locally which\nin turn feed into regional and national distribution as\nwell as serving their own local populations.\nThe Vice President has asked us to report findings of programs\neither planned or completed; we are in the final stages of\nso doing. We have found some five major programs and program\nseries which have been produced by local stations for their\nown use dealing fundamentally with the improvement of the\nghetto populations. Another five series by others are in\nthe process of development. Unfortunately, the information\nagain is scant despite the fact that we know a good many\nmore programs are in existence. We have issued a number of\nappeals but without success to get full information. One\nkey problem: funds to develop this kind of programming.\nIn most instances, stations have seen these program needs\nonly recently after long standing program commitments have\nbeen made. A station frequently reports that it is unable"
}