{
  "id": "d489-9",
  "text": "-2-\nas practical. The promotional advantages and operational\nefficiencies connected to interconnection, for example,\nmake it logical for the network to seek as much uniformity\nas possible in scheduling of programs from station to station.\nConforming to such scheduling is often in the interest of the\nstation, as well, if it wishes to benefit from nationwide\npromotion of certain programs. But it is the station, not the\nnetwork, which legally must decide what programs can be broad¬\ncast to its audience usefully.\nWhat is the best possible relationship? From the network's\npoint of view, its performance is considered successful when\nthe affiliates take as many programs as possible from the\nbasic service; from the station's point of view, it may prefer\nto take as many programs as possible, but it would prefer to\nscreen each in advance and certify its suitability for broad¬\ncast. Those whose confidence lies with the network feel that\nthe station is censoring the network; those who prefer to rely\non the station's judgment note that it has a legal responsi¬\nbility to know what it is broadcasting. However meritorious\nthe arguments on either side, the alternative would have the\nstation programmed by the network, thereby precluding bad\njudgment by the station, and good judgment, as well. The\npresent system may allow for malpractice, but it does not en¬\ncourage exploitation. An arrangement which might please those\nwho find station decisions unacceptable might soon be substan¬\ntially more intolerable than the present flaws.\nWhatever operating procedures are considered effective for\ngeneral programs will receive their most severe test where\ncontroversial programs are at issue. Even when the program\nis not controversial, but the issue is, it is likely that\nspecial dispensations or procedures will be suggested, on\nthe one hand, to assure that the program will be carried by\nall stations or, on the other, to assure that the decision\nto carry will not be an automatic one.\nThe examination of programming is quite naturally based upon\na concern, perhaps a preoccupation, with the \"input\" of educa¬\ntional broadcasting, rather than the outcomes. A schedule of\n\"desirable\" programs watched by people who already share the\nposition espoused or understand the topic articulated may have\nimportant reinforcing effects on some, but may also be ineffectual\nor unwatched by others. To this the casual answer is, \"Then\nbroadcast the controversial program; it can't do any harm.\""
}