{
  "id": "d703-121",
  "text": "REPORT ON COMMITTEE ACTIVITIES\n(3I4 committee’s)\nI® Project Committees\nArchives - Maurice T® Iverson, Chairman; William F. Kruse, Archivist\nExpires at the 1957 DAVI Convention\nContinued program on accumulating material, cataloging and storing it in the head¬\nquarters at Iowa State University® Obtained taped interviews of historical value\nfrom the following persons! B. A® Aughiribaugh, Alexander T. Victor, Rita Hochheimer,\nF® Dean McClusky, and Carl E® Milliken*\nAV Instructional Materials - T. W® Roberts, Chairman; Robert LeAnderson, Assistant\nChairman\nExpires at the 1958 DAVI Convention\nAttempting to complete four current projects; (1) a flat picture publication,\n(2) a brochure on the Use of Community Resources, (3) a booklet on \"How-To-Do-It\"\nideas, (I|) a booklet on the preparation and use of overhead transparencies...Consider¬\ning the initiation of two ne^r projects; (1) a resource booklet on \"Do-It-Yourself11\nideas, and (2) a resource booklet on bulletin board techniques*\nBuilding Coordinators: Requirements of Training and Experience - Mendel Sherman, Chair-\n- - ■“ man\n(Sub-committee of Professional Education Committee) Appointed January 1957\n(ad hoc)\nTo report at 1958 Convention.\nBuildings and Equipment — A® J. Foy Cross, Chairman; Donald Ely, Assistant Chairman\n“ Expires at the 1958 DAVI Convention\nPrepared revised copy for third edition of the first brochure in the DAVI series\nPlanning Schools for Use of Audio-Visual Materials. Served as on-the-spot consultants\nand \"consulted\" by correspondence with local school planning committees. Reconstructed\nscale model of classroom planned for maximum AV use. Promoted use of full scale de¬\nmonstration room for meetings of boards and committees on buildings. Prepared articles\nfor national journals. Cooperated in initiating and promoting state and regional meet¬\nings on AV in school house planning.\nCounty and Cooperative Programs — Henry McCarty, Chairman; Lee Campion, Assistant Chair-\n— man\nExpires at the 1957 DAVI Convention\nThree of six chapters have been prepared on the brochure entitled \"The County and\nCooperative AV Instructional Materials Centers.\" This brochure is.based on data\ncollected from lh9 cooperative AV centers throughout the United States. In the process\nof preparing a resource kit for people seeking information on how to start or operate\na county or cooperative program® Sample data of all kinds will be put together ior\nreference©\nDAVI Participation in UEA Centennial Year - J. J. McPherson, Chairman #\n- Appointed January 1957 (ad hoc)"
}