{
  "id": "d703-124",
  "text": "-u-\nCollego and University Programs - Harry M. Kauffman, Chairman,* Ernest Tiemann,\nAssistant Chairman\nDuring this current year an effort was made to survey carefully the entire higher\neducation picture to determine which areas provide the most desirable ground for\naudio-visual study and research* Several studies on which committees had been\nworking for some time were culminated several months ago. Included among these\nwere the portfolio, roster, and bulletin projects. Foremost among the studies\nengaged in presently is the one dealing with the evaluation of college and univer¬\nsity audio-visual programs. It is hoped that several now and significant projects\nmay be launched at the forthcoming national meeting.\nIII. Liaison and Joint Committees and Commissions\nAV Commission on Public Information — Charles Schuller, Chairman\nThis organization is composed of nine organizations who send representatives to meet\ntogether for the purpose of interpreting to the public information about the audio¬\nvisual field. DAVI is one of the participating organizations. To date the Commission\nhas widely publicized a basic minimum equipment list and a statement that \"one percent\nof a school’s instructional budget be allocated for audio-visual instructional mater¬\nials and equipment.w Also a booklet entitled \"Telling Your AV Story\" is now being\ndistributed. Numerous other projects are underway.\nCoordinating Committee of AACTE (American Association of Colleges for Teacher Education)\nDAVI has two representatives, William Fulton and Anna Hyer, on the Coordinating\nCommittee of the American Association of Colleges for Teacher Education. This\nCommittee is made up of special interest groups in the teacner education field, pi\naddition to exchanging information, the group has been active in obtaining attention\nto the soecial interest fields in the evaluative criteria being developed for teacher\neducation accreditation. The Committee also plans the Saturday morning program at\nthe AACTE Convention each year.\nDAVI-AAHPER (American Association for Health, Physical Education and Recreation) -\nCharles Norford, Chairman\nThis joint committee has published a brochure entitled \"Audio-Visual Materials for\nPhysical Education.\" This brochure sells for $1.50. Its work completed, this\nCommittee is now being dissolved.\nDAVI-ACSSAVO (Association of Chief State School Audio-Visual Officers)\n— Chairman to be elected by the committee\nAppointed January 1957 (ad hoc)\nThis Committee is to investigate and make recommendations concerning methods of\naccounting and financing AV programs. This has specific reference to the work of a\nnational committee working with the U. S. Office of Education in the development of\nuniform methods of accounting financial accounting for local and state school systems.\nThis volume was issued in March 1957 and will be open for revision sometme during\nthe next few years. In the meantime work has begun on personnel accounting practices\nin state and local school systems."
}