{
  "id": "d703-159",
  "text": "Mr, Burton Paulu\n■2-\nAugust 8, 1957\nFrequently the people concerned have dispersed; many\ntimes the records are hard to find; and sometimes it means\nasking for an additional right which was not obtainable in\nthe first instance; etc. Therefore, I suggest that any fur¬\nther discussion with Kent State be only on the basis of pro¬\ngrams to be made in the future and that we forget about all\nprograms which have been done in the past and which are\nbeing done currently.\nb. Since ETRC is not the producer of any of the radio programs\nand does not itself directly undertake to obtain any clear¬\nances to any of the elements involved in any programs, it\ncannot make any guarantees to Kent State. However, ETRC\nand HA KB can tell Kent State they will not have any objec¬\ntion to nohbroadeast distribution of programs.\nc. ETRC does not wish to get involved in obtaining and shipping\nmaster tapes or paying costs of duplication for nonbroadcast\npurposes. We now obtain two tapes for each program series.\nOne is the master tape which is sent directly to NAEB, and\nthe other we retain (and must continue to retain) for our own\nrecord purposes. Arrangements regarding tapes should be\nmade directly between Kent State and NAEB or the producing\norganization, whichever is the most feasible.\nd. ETRC can encourage all future producers of grant-in-aid radio\nprograms to clear such programs for noncommercial, non¬\nbroadcast use and to send an extra tape of their program se¬\nries to Kent State for archive and distribution purposes. ETRC\ncan also furnish Kent State with a list of the program producing\norganizations, the names of series and program titles, etc.,\nfor each group of grants-in-aid at the time the grants are made\neach year in the future. Kent State by correspondence directly\nwith each organization which produces a radio series should\nthen assure itself that the rights clearances are sufficient for\nits purposes. As to each series which it is satisfied are cleared\nand for which it has the authorization from the producing agency,\nKent State can proceed with itz distribution in appropriate co¬\noperation and collaboration with NAEB.\nI am attaching a copy of the Kent State letter to Harry Skornia in\norder that you can compare these comments of mine with the original\nproposals from Ralph Hall. I suspect that, if Kent State deals directly\nwith each producing organization, they will find most of them reluctant to"
}