{
  "id": "d703-28",
  "text": "Aur. 10-VISUAL COMMISSION ON PUBLIC INFORMATION\nReport of meeting in Washington on February 16 and 17, 1956\nThose present: Don G. Williams, Syracuse University, representing University\nFilm Producers Association\nGodfrey Elliott, Young America Films, representing National Audio-\nVisual Association\nW, H. Durr, Virginia State Department of Education, representing\nAssociation of Chief State School Audio-Visual Officers\nLee Cochran, Iowa State University, representing National\nUniversity Extension Association\nDon White, Executive Vice-President, National .Audio-Visual Assoc,\nEmily S. Jones, Executive Secretary, Educational Film Library Asso--\nNora E, Beust, USOE, representing Aissociation of School Librarians\nCharles Schuller, Michigan State University, representing DAVI\nWalter Emery, Joint Committee on Educational Television (Feb.16 only\nHarry Skornia, Urbana, Illinois, representing National Association\nof Educational Broadcasters (Feb. 16 only)\nWilliam King, New Jersey State Department of Education, represent¬\ning Association of Chief State School Audio-Visual Officers\nFloyde E. Brooker, Acting Executive Secretary, DAYl\nMary C. Welch, DAVI (Feb. 17 only)\nDon Williams, acting as Temporary Chairman, sketched in the background of the\nmeeting and its origin in a discussion last summer. He outlined the need for public\ninformation on audio-visual methods of instruction and their importance in order\nto enlist support of those voting on school appropriations, equipment, and build¬\nings. The problems to be discussed by the group would include: the desirability\nof a joint effort; who is the primary target?; what are the immediate steps to be\ntaken?; what are the long range steps to be considered?; how is the program to be\norganized and carried out?.\nThere was general agreement on the desirability of a joint effort, with the pro¬\nviso that wherever possible, the projects should be undertaken by existing organ¬\nizations with the help of the group. The possibility of including the joint effort\nunder the auspices of COOP was considered, with the feeling that there was no\ndifficulty in doing so, but that such affiliation would be largely a formality^\nsince the work would still be done by members of the joint committee.\nAfter some discussion as to what should be included in the term \"audio-visual\"\nfrom the point of view of the work of this group, it was generally agreed to in¬\nclude films, filmstrips, radio, TV, slides, recordings, maps, charts, globes,\npictures, and in fact all types of materials except text books. School libraries\nwere included, but it was generally felt that the AJLA standards and efforts would\ndetermine the action in that connection. The overall aim is improvement of\ninstruction, by whatever means seem most effective.\nThe lack of discussion of audio-visual materials at the White House Conference was\nfelt to point up the need for informing both school people and the general public\nas to what an adequate audio-visual program is. Misunderstandings about the role\nof a-v, particularly by those who still regard it as a frill and a form of gadgetry.\nmust be overcome."
}