{
  "id": "d703-30",
  "text": "3\n6. Visual presentation (continued)\nAdrian Terlouw or John Flory of Eastman Kodak will be asked to prepare the\npresentation. The talk may be worked out with suggestions from Bruce Findlay\nor Bob de Kieffer. This will depend on what Terlouw or Flory can undertake,\n7. Production of a film, possibly an edited combination of several existing films\non the use of a-v materials,\nDon Williams will investigate and try to make a rough cut from materials now\navailable. Permission would have to be obtained later from the original\nproducers to obtain access to negatives, new prints, etc.\n8. Find out what existing films could be Used for promotion, and arrange to have\nthem available free from film libraries.\nW. H. Durr and Emily Jones will work on this, and get together to discuss\nprogress at the DAVI meeting in Detroit.\n9. Organization of a speakers' bureau.\nIt was agreed that this would be helpful, but too much to undertake at\npresent* Classified as a long range project/\n10. Investigate what mailing lists are in existence and conditions under which\nthey can be used for promotion of a-v aimsi\nEFLA will work on this.\n11. A series of releases pointing up capabilities and potentialities of a-v.\nNo special action was taken on this, but news releases will be sent out\nwhenever there is a good opportunity.\n12. Get magazine articles dealing with uses of a-v materials planted in national\nmagazines.\nThis was classified long range, but to be kept in mind. A1 McNay of\nStandard Oil of California was suggested as a source of advice in this area.\n13. Establishment of a picture file of photographs showing a-v materials and\nmethods in operation, available for publicity use.\nBob Wagner will be asked to undertake this, with help from Clyde Miller.\n14. A compilation of research in the field, presented in simplified popular form,\nWalt Wittich has much of the information and will be asked about this.\n15. Arrange for interviews and discussion of a-v on commercial radio and TV.\nLong range,\n16. An audio-visual handbook for administrators\nBill King will work on this in New Jersey, and submit to the group for review\nto keep it from being too localized. If kept to 16 pages, NAVA will print it\nThe name AUDIO-VISUAL COMMISSION ON PUBLIC INFORMATION was decided on. The Commis\nsion will not have a formal set-up, but will operate informally within the present\nsystem of representation from any interested organizations. Don Williams was\nelected Chairman, Charles Schuller was made Vice-Chairman, An Executive Committee\nwas elected to handle business between meetings of the Commission. Its members"
}