{
  "id": "d703-68",
  "text": "August 8, 1956\nMss Arlene Me Keller* Assistant Director\nWisconsin School of the Air, Station WHA\nMadison, Wisconsin\nDear Miss McKellar*\nI am certain that you have heard of the BAVI-AERT Dane Recording\nCatalog and Re-Recording Service. I am enclosing a copy of the\nSupplement to the Tape Recording Catalog for your further\ninformation* the service is intended primarily to provide educa¬\ntional programs on taps for use in school and college classrooms.\nThe Committee tries to select tape recorded programs which are of\nhigh educational and technical quality and of general and lasting\nvalue. The tape recording service has been well received by the\nschools.\nthe national committee is now collecting information on new,\nsuitable and available program® from which it will select the\nprograms to be added to the tape services this fall. This year,\nMAE' has agreed for us to make use of some titles now being carried\nby their network if the original producers agree. We are of course\ninterested in programs that are of continued educational interest\nto schools* Tfe would appreciat it if you would bare this in mind\nas you consider the idea of releasing some of your programs for\nuse in the National Tap® Recording library.\nFrom the NAEB Tape Network Headquarters, we have learned that the\nfollowing program produced by you might be made available for our\nuse i\nRADIO ALMANAC\nWould you be willing to have the above program considered for\ninclusion in the National Tape Recording Library offerings?\nIf so, we would appreciate it if you will forward a catalog\ndescribing each program or aeries of programs. This would help\nus to select those which seem best to meet our needs.\nIf you have otter programs to suggest, please be assured that we\nwould welcome the opportunity to learn about them*\nSincerely,\nGertrude Broderick\nRadio Education Specialist\nU. S. Office of Education\nAnna L. ffyer\nAssociate Executive Secretary\nDA?I\nfor the\nDAVI-AERT RATIONAL RADIO & ]\nRECORDING COMMITTEE"
}