{
  "id": "d971-20",
  "text": "- 3 -\nEXECUTIVE DIRECTOR\nMr* Schein stated that it was not possible at the present time to secure the\nservices of an Executive Director for N,Y.S.E.R*T*A, but that an attempt\nwould be made to hire a part-time Executive Secretary. A proposal is to be\npresented by the N.Y.S.E.R.T.A. President to the Steering Committee of the\nEmpire State PM School of the Air on Monday, April 15, seeking their support\nand cooperation in allowing Coy Ludwig, Acting Executive Secretary of the\nSchool of the Air, to serve as part-time Executive Secretary for N.Y.S.E.R.T.A.\nIf this proposal is approved by the School of the Air Steering Committee, a\npermanent N.Y.S.E.R.T.A. office will be set up at the School of the Air\nheadquarters at Syracuse University,\nThe meeting was adjourned at 4:45 p.m.\nThe meeting was called to order at 9:45 a.®, on Saturday, April 6, by\nPresident Schein.\nCOMMITTEE REPORTS\nSee Attached\nRESOLUTIONS AND RECOMMENDATIONS\nAs an outgrowth of the Committee Reports several resolutions and recommendations\nwere proposed.\nThe Television Station Activation Committee recommended the following\ntwo resolutions which were passed by the members present:\nA* \"RESOLVED, that the President of the New York State Educational Radio\nand Television Association, in cooperation with the Commissioner of\nEducation of New York State, invite community leaders, legislators\nand other interested people from key areas in New York State to attend\nan informational meeting, at which time the State plans for educational\ntelevision and other aspects of educational television might be explained\nby a high level representative from the New York State Government,\"\nThe President allocated to Les Martin, Jr., Chairman of the Legislative\nCommittee, the responsibility of executing Resolution \"A\".\nB* \"RESOLVED, that NYSERTA begin a survey of various councils and\ninstitutions regarding personnel, budget, legal composition,\nprograming, and any other information which might prove to be of\nvalue to individual members of the association and those\nindividuals or groups making plans to begin work in educational\ntelevision broadcasting.\""
}