{
  "id": "d971-60",
  "text": "BYLAWS OF THE NYSERTA (Continued)\n2\nSECTION B: Associate Membership: Any university, college, school system,\nor other non-commercial organization seeking to promote non-commercial\neducational radio or television may be an ASSOCIATE member and shall\nbe entitled to one vote on all matters of business brought before the\nmembership.\nSECTION C: Individual Membership: Any individual engaged in educational\nradio or television, in teaching radio or television courses, or any\nindividual seeking to promote educational radio or television may be\nan INDIVIDUAL member and shall be entitled to one vote for a Trustee-\nat-Large and on all other matters of business excluding votes for\nadditional Trustees.\nARTICLE IV\nMEETINGS\nSECTION A: Regular Meetings: There shall be two meetings of the Association\neach year at a time and place to be determined by the Steering Committee.\nOne of these meetings shall be scheduled for Spring. Notification of\nsuch meeting shall be given to all members not less than thirty days\nprior to the date of the meeting.\nSECTION B: Special Meetings: Special meetings of the Association may be\nheld at the discretion of the Steering Committee upon fifteen (15>)\ndays written notice to members.\nSECTION C: Quorum: The membership present shall constitute a quorum.\nARTICLE V\nTRUSTEES\nThe governing body of the Association shall be a board of trustees,\ncomposed of not more than twenty-five (25) nor less than five (5) persons,\nthe specific number to be determined by a three-fourths vote of the\ntrustee s.\nSECTION A: Method of Election: Each member of the Association shall be\nentitled to vote for Trustees, except in the case of Individual\nMembers who may vote only for the position of Trustee-at-Large. The\nfirst board will be assigned terms by random choice. In subsequent\nelections, the candidate receiving the highest number of votes shall\nbe elected to serve a 3-year term. One-third of the Board shall have\ntheir terms expire each year. Vacancies on the Board may be filled\nby the Board to extend to the next meeting of the Association at which\ntime the membership present will elect Trustees to fill any unexpired\nterm. The Trustee-at-Large, always a 3-year term, will be voted upon\nonly by the Individual Membership."
}