{
  "id": "d971-62",
  "text": "BYLAWS OF THE NISERTA (Continued)\nk\nARTICLE VIII\nOFFICERS OF THE ASSOCIATION\nSECTION A: Number and Method of Election: The membership shall elect\nfrom the members of the Association a president, vice-president,\nsecretary, and treasurer. These officers shall serve as the officers\nof the Board of Trustees and of the Steering Committee, The election\nshall be held at the Spring meeting of the Association, Officers are\nto hold office until new officers are elected.\nSECTION B: Duties of the Officers of the Association:\n1. The President shall preside at all meetings of the Association\nand of the Board and Steering Committee. Upon approval of the\nSteering Committee he shall appoint such committees of the Association\nas he shall deem appropriate or necessary. The president of the\nAssociation shall be a member of the Steering Committee and of the\nBoard of Trustees,\n2. The Vice-President shall, in the absence of the president, perform\nthe duties and exercise the power of the president and shall perform\nsuch other duties as the Board may prescribe. The vice-president of\nthe Association shall be a member of the Steering Committee and of the\nBoard of Trustees,\n3. The Secretary shall attend all meetings of the Board, the Steering\nCommittee, and the members of the Association and shall record all\nvotes taken in any such meeting and the minutes of all proceedings.\nHe shall give notice of all meetings of members of the Association,\nthe Board, and the Steering Committee. He shall perform such other\nduties as may be prescribed by the Board. He shall keep in safe\ncustody the seal of the organization and shall affix it to any\ninstrument when authorized by the Board, The secretary of the Associa¬\ntion shall be a member of the Steering Committee and of the Board of\nTrustees.\nk. The Treasurer shall have the custody of the corporate funds and\nsecurities and shall keep full and accurate accounts of receipts and\ndisbursements in books belonging to the Association, The treasurer\nshall deposit all monies and other valuable effects in the name and\nto the credit of the Association in such depositories as may be\ndesignated by the Board. At the expiration of his term of office,\nhe shall deliver to his successor all books, monies, and other prop-\n' erty of the Association. The treasurer of the Association shall be\na member of the Steering Committee and of the Board of Trustees.\n5. In the absence of the President and Vice-President, the Secretary\nshall preside."
}