{
  "id": "d1501-0",
  "text": "v°l. 'ill. Mo.'12\" DuPont Circle Building, \"ifeshington &T D.C. August , 19&2\nFCC RESERVES ADDITIONAL CHANNELS FOR ETV\n( /2-}, (\nFollowing the pattern contained in NAEB’s national plan for l JjjrflTll channel\nreservations, the FCC last week added 27 new channels for ETV in Florida}* Georgia/, and\nKentucky?* The action was a follow-up to decision (Afepwfigr) to consider\nand approve state ETV network plans, wherever feasible, without regard to the overall\nproceedings affecting reallocation of channels. In so doing, the Commission said*,., it\nplacing ^educators on notice that any TV assignments are subject to change by\nCommission decision in Docket 1^229 with respect to ETV needs on a national basis in\nwhich the National Association of Educational Broadcasters has filed a survey.”\nNHF . channels .made.. pas s ible,, by. .drQp--in^^ -aseignme nt\na-go—di Rt.r-ibnt.ed follows-:—.\nIn addition, FCC, in response to request of the Board of Regents of New Mexico\nUniversity, proposed a new VHF educational channel in Hatch, New Mexico, by shifting\nChannel 12 from Silver City.\nFCC PROPOSES NEW SERVICE FOR ETV\nThe FCC*(July 25) proposed a new class of service to promote ETV by using chan¬\nnels in the 1990-2110 m or 2500-2690 Me band to transmit instructional programs to\nschools and other selected points. The new service, in effect, a multiple-addressed\nsystem to supplement ETV broadcast service, would enablea ^c^ntral transmitter to\nserve scattered schools or other locations which would the transmissions for\nviewing on conventional receivers. Sufficient channels would be available to permit\nsending different subjects simultaneously to different classrooms.\nCenXi <*sjl n ^,\na.rp^xuvt,\nclosed-circuit and microwave relay systems. FCC estimated that a single-channel system\nserving 25 schools would cost from one-fifth to one-third of the cost of a moderately-\npowered broadcasting station doing the same job.\nIn areas where it would fee impossible to provide needed service from a salagXp\n•hrancorn f-.~ho-r; transmitters could be licensed as repeaters .to servo localit-a^*.aot™ ..reached\n-w ?| Rules would also permit use of transmitters as relay stations\nto interconnect systems or to bring in programs from educational or commercial stations^\nBliffpm-**--y * wnnl ^gana,aafci.on,s engaged\n(j Comments due September /7 • 0\nFCC OVERHAULS FM BAND\nOn July 26 the FCC revised its FM rules to set up new coverage classes\nand tightened mileage separations. Subsequently it will issue a table of channel alio-"
}