{
  "id": "d1702-1",
  "text": "oA,£o.E^ Fews Letter April 1, 1939 Page 2\nIMPROVEMENTS AT KWSC\nKenneth E. Yeend, Director of KWSO, State Oc?,.loge of Washington, reoorts\nthat a new Steinway grarfl piano now adorns the KWSC studios. Completing\nthe renovation of the studios is a new rug and renovation of the wood¬\nwork o\nSCRIPTS AT KFJM\nVirgil Banning, Program Director of KFJM, University of North D*kot*,\nreports that he has a large number of dramatic scripts on file whlol\nhave been produced by the KJFM staff. They will be*mads available to\nNAEB members on request.\nKWLC LICENSE SET FOR HE ARING\nBecause KGLQ, Mason City Globe Gazette Company, is requesting the faci*\nlitles of KWLC, Luther College, Decorah, Iowa, and of KGCA, also of\nDecorah, the application for renewal of their licenses has been granted\non a temporary basis only by the FCC and the whole matter set for\nhearing before the commission.\nMORE FCC REORGANIZATION\nThe Federal Communications Commission has authorized the establishment of\na permanent Office of Information, to bo responsible for the collection\nand dissemination of Information for the press and the public regarding\nthe Commission0 a decisions and other matters and to have such other\nfunctions as the Sommission may determine.\nThe Office of Information will be headed by a Dlreotor of Information and\nSpecial Assistant to the Chairmen* with an Assistant Director of Informa¬\ntion, and will embraoe the work of the Information Office, the Information\nReference Room, the Press Room, and related activities. Provision was\nmade for it .to function under and be responsible directly to the Commis¬\nsion, replacing the Press Section, a unit in the administrative branch.\nThe new setup will make permanent and extend the present information\narrangements, set up by M. L. Ramsay, who was borrowed from the Rural\nElectrification Administration to study informational needs as well as\nconduct the information service temporarily. It is in line with recom¬\nmendations made In Mr. Ramsay0s final report. Mr. Ramsay*s detail\nended March 31.\nWYNC AMENDED PETITION FILED\nMayor Florello H. LaGuardl*:, on behalf of the City of New York, licensee\nof Station WNYC, has amended the petition filed on August 24, 1938, re¬\nquesting the amendment nf 17^ 321, 1.012(a) and 1052(a), which\nrelate to high frequency and International broadcast programs. Since no\ndate has been set for hearing, *>n this Petition under its rules the Com¬\nmission has illy av^Lpted tv.i amendment to the Petition."
}