{
  "id": "d1748-1",
  "text": "FIRST STATE-WIDE EDUCATIONAL TRANSLATOR SYSTEM AUTHORIZED BY FCC\nThe first state-wide educational translator system employing matching Federal\nfunds for construction was authorized June 10 \"by the FCC in granting applications \"by\nthe University of Utah for l8 new UHF translator stations to rebroadcast programs of\nstation KUED (Channel *7), Salt lake City. The grants cover translator channel\noperation and services as follows:\nThree stations on Channel 70 to serve, respectively: Torrey; Circleville,\nKingston and Junction; Washington and rural Vfcishington County;\nTwo stations on Channel 71 to serve, respectively: Milford and rural Beaver\nCounty; Escalante;\nThree stations on Channel 72 to serve, respectively: Richfield and Monroe;\nMonticello and Blanding; Ivfyton;\nOne on Channel 75 to serve Eskdale, Gandy and rural Millard County;\nTwo on Channel 76 to serve, respectively: Enoch and rural Iron County; rural\nWhyne County;\nTwo on Channel 80 to serve, respectively: rural Iron, Kane, Garfield and\n\"Washington Counties; Orangeville and rural Emery County;\nOne on Channel 8l to serve Beaver City;\nOne on Channel 82 to serve rural Juab and San Pete Counties;\nThree on Channel 83 to serve, respectively: Columbia and rural Duchesne,\nCarbon and Emery Counties; Virgin; Marysvale.\nFIFTH VHF CHANNEL FOR SOUTH DAKOTA EDUCATIONAL NETWORK!\nThe Commission adopted a counter proposal in Docket 15377 and assigned Channel\n*2 for educational noncommercial use in Seneca, South Dakota, instead of in Roscoe as\noriginally proposed. By assigning the channel to Seneca, which is about 25 miles south\nof Roscoe, the same general area would be served, and short-spacing with the site\nproposed by the North Dakota Board of Higher Education for a new station on Channel *2\nin Grand Forks, North Dakota, would be obviated. This makes the fifth VHF channel\nassigned to South Dakota for its statewide educational television network.\nFCC BROADCAST ACTIONS\nGranted CP for a new educational noncommercial FM station to operate on Channel\n209 (89.7 Me); ERP 860 watts; antenna height 380 feet; remote control permitted, at the\nUniversity of Wisconsin-Milwaukee, Milwaukee, Wisconsin.\nGranted CP for a new Class D educational noncommercial FM station to operate on\nChannel 205 (88.9 Me); with 10 watts, for the State of California Sacramento State\nCollege, Sacramento, California.\nGranted CP for a new Class D educational noncommercial FM station to operate on\nChannel 213 (90-5 Me), with 10 watts; remote control peimitted; at Bucknell University,\nLewisburg, Pennsylvania.\nCORRECTION\nIn an item concerning procedures for filing for reduced aural power, the April\n30 Washington Report (Volume V Number 7) indicated that applications must be filed on\nForm 361. The FCC has recently notified NAEB that Form 3^0 should be used for this\npurpose."
}