{
  "id": "d1748-5",
  "text": "pas® 6\nThe magnesium requirement in the dietary is low, being not more than\n0.01 oz per day, and this is present in foods in such a degree of\nabundance that magnesium has not been demonstrated to be a 1 iml\ning factor in human nutrition* Kxpermental animals deprived of\nmagnesium in the dietary develop© 4 severe reddening of the skin,\nincreased irritability of the nervous system, heart disturbances and\nconvulsions* Gross excess in dietary magnesium results in disablement\nof calcium from the body, but no serious pathological changes except\nkidney stones*\niron in the dietary is required fox^he formationof hemoglobin in\nthe blood, and on iron poor dietaries, anemia develops* The daily requ¬\nirement for iron is 1/3,000 oz. This may be supplied in the form of\nfood iron* The richest sources are the organ meats (liver, heart,\nkidney, spleen) .meat, ess yolf, wiiole wheat, fish, nuts, dates,beans,\nspinach, and oatmeai. Milk, is a very poor source of iron and if an an-\nimal^diet is restricted to milk for much longer than its normal lactation\nperiod, anemia may result. Raisins are a better monument to the eff¬\niciency of our advertising agencies than a source of dietary iron* To\nfulfil the daily requirement of iron would require 1 and one half lbs.\nof raisins, tf* The iron requirement may also be met by inoraaxiic iron\nsalts. This question was cleared up by Hart and Steen bock at the\nUniversity of Wisconsin in 1928, who snowed that the apparent inefficiency\nof inorganic iron as a blood building element was due to the shortage\nof copper in the purifidd experimental dietaries. Oily traces of copper\nare necessary in the dietary, but this small amount of copper is re¬\nquired in order that the body may form hemoglobin from the iron.\nThis interesting relationship between iron and copper carries us\nback again to the evolutionary development of the race. Back 400,000,000\nyears in the Cretaceous Sea, some of the primitive forms carried a copper\ncompound."
}