{
  "id": "d297-30",
  "text": "If not delivered, return to\nWISCONSIN STATE BROADCASTING SERVICE\nRadio Hall, University of Wisconsin\nMadison 6, Wisconsin\nRETURN POSTAGE GUARANTEED\nMAY-JUNE 1958\nYOUR\nState Stations\nAM STATIONS\nFM STATIONS\nWHA (Madison)\nWLBL (Auburndale)\n970 kc.\n930 ke.\nWHRM (Rib Mountain)\n91.9 me.\nFM STATIONS\nWHA-FM (Madison) 88.7 me.\nWHAD (Delafield) 90.7 me.\nWHWC (Colfax) 88.3 me.\nWHLA (West Salem) 90.3 me.\nWHHI (Highland) 91.3 me.\nWHKW (Chilton)\n89.3 me.\nWHS A (Brule) 89.9 me.\nAnd the World Listened\n1:30 P.M. Sunday\nRepeated 7:30 P.M. Monday\nThese programs focus attention on some of the\ncelebrated orators of history whose thoughts and\nutterances have helped to shape some of the ideas and\ninstitutions which constitute Western Civilization.\nConsultant for the series is Professor Frederick W.\nHaberman, chairman of the speech department at the\nUniversity of Wisconsin. The series was produced by\nStation WHA for broadcast throughout the U. S. by\naffiliated stations of the National Association of Edu¬\ncational Broadcasters. The programs were directed by\nKarl Schmidt.\nMay 4, 5\nWilliam Pitt, Earl of Chatham (1708-1778)—The\nAttempt to Subjugate America. Chatham’s speeches\non America concern liberty, government by con¬\nstitution, and the misery of war. This speech con¬\ntains the famous passage: \"If I were an American,\nas I am an Englishman, while a foreign troop was\nlanded in my country, I never would lay down my\narms—never—never—never!”\nMay 11, 12\nEdmund Burke (1730-1797)—Conciliation With\nAmerica. A master of metaphor, of coherent de¬\nsign, and of political philosophy, Burke was at his\nbest in the Conciliation speech. The theme of the\nspeech is that \"taxation and representation are in¬\nseparably conjoined,” and that magnanimity in\npolitics is needful in holding a great empire\ntogether.\nMay 18, 1S>\nDaniel O’Connell (1775-1847)—Irish Independ¬\nence. Over a million people were said to have\ngathered at Tara in Ireland on August 15, 1843\nto hear Daniel O’Connell speak for Irish Inde¬\npendence. Called The Liberator, it is not an ex¬\naggeration to say that O’Connell spoke to and for\nall of Ireland.\nMay 25, 26\nDaniel Webster (1782-1852)—The Knapp Mur¬\nder Trial. Among Daniel Webster’s forensic ad¬\ndresses the speeches delivered on the trial of Frank\nKnapp for the murder of Captain White of Salem\nare the most famous. The reconstructed summation\nspeech is well known for its narrative passages. Not\nso well known is the fact that it goes beyond the\nevidence in obtaining the conviction.\nJune 1, 2\nAbraham Lincoln (1809-1865)—Lincoln-Douglas\nDebates. These debates have drama because of the\nprotagonists themselves, as well as because of the\nhistoric importance of the subject which was, ulti¬\nmately, the survival of slavery in the United States.\nJune 8, 9\nBooker T. Washington (1858-1915)—Atlanta In¬\nternational Exposition. Booker T. Washington was a\npowerful speaker, one of the most accomplished of\nhis day. For over thirty years he was in constant\ndemand until his death in 1915. He was an\nacknowledged leader of the Negro race in America\nand one of the outstanding men of our country.\nJune 15, 16\nElizabeth Cady Stanton (1815-1915)—The Right\nto Hold Property. First president of the National\nAmerican Woman Suffrage Association, Elizabeth\nCady Stanton was an eloquent spokesman of wom¬\nen’s rights. In the legislature of her native state\nof New York, she began the fight for the right of\nwomen to hold property after marriage.\nJune 22, 23\nWinston Churchill (1871-——)—The Battle of\nBritain. Replete with celebrated passages, this\nspeech has as its general theme the protection of\nthe home land and the survival of freedom. The\nstirring words reveal much about the orator, his\nsense of history, his imaginative grasp of the fearful\nstruggle, and his awe-inspiring courage.\nJune 29, 30\nFranklin Delano Roosevelt (1882-1945)—The\nFour Freedoms. The message to Congress contain¬\ning the philosophy and the description of the four\nfreedoms is one of Roosevelt’s most eloquent and\nmost influential speeches. Its themes have become\nideals for this century.\nOf Many Things\n4:00 P.M. Monday\nRepeated 7:45 P.M. Tuesday\nBergan Evans, professor of English at Northwestern\nUniversity continues his series of \"essays for radio.”\nMay 5, 6\nFunction of the Critic\nMay 12, 13\nWit, Humor and\nComedy\nMay 19, 20\nMark Twain\nMay 26, 27\nThe Art of Being\nNasty\nJune 2, 3\nSome Aspects of\nShakespeare’s Art\nJune 9, 10\n\"Mass Produced”\nSuburbs\nJune 16, 17\n\"Old Nick” Machia-\nvelli\nJune 23, 24\nMen and Their Myths\nJune 30\nDon’t Monkey With\nthe Platypus\nContemporary Trends\n2:00 P. M. Tuesdays\nA series of selected lectures from an all-University\ncourse for senior students, broadcast from a class¬\nroom on the Madison campus of the University of\nWisconsin. The course presents a non-technical con¬\nsideration of the physical and social sciences, em¬\nphasizing national and international problems.\nMay 6\nUnmanned MtsstTes, Ragnar Rollefson, Professor of\nPhysics.\nThe Words We Use\n10:30 A.M. Tuesday\nRepeated 9:00 A.M. Saturday\nProfessor Frederick Cassidy\nof the department of English at\nthe University of Wisconsin\npresents weekly discussions on\nwords, phrases, sayings, usage,\nand pronunciation. Professor\nCassidy is a well known scholar\nand researcher. For many years\nhe has been conducting the\nWisconsin English Language\nSurvey which seeks to study\nall the characteristics of Ameri¬\ncan English as it is used in this state. As a part of\nthis survey he conducted the radio program Wiscon¬\nsin Words a few years ago on the state stations. It\nis expected that the book based on these studies, to\nbe entitled Wisconsin Words, will be published by\n1959- Professor Cassidy is now engaged in a study\nof the English language as it is spoken in Jamaica.\nThe Words We Use is an entertaining and in¬\nstructive program and has attracted a wide audience\nthis semester.\nMay 13\nGovernment and Science, Ragnar Rollefson.\nMay 20\nEducation and Manpower, Virgil E. Herrick, Pro¬\nfessor of Education.\nMay 27\nThe Competing Economies: Mixed Economy, Com¬\nmunism and Socialism, Theodore Morgan, Profes¬\nsor of Economics.\nJune 3\nRussian Foreign Policy, John A. Armstrong, Asso¬\nciate Professor, Political Science.\nJune 10\nWestern Europe: A Half Century of Economic and\nSocial Change, Rondo E. Cameron, Associate Pro¬\nfessor, Economics and History.\nJune 17\nBritain’s New Status, Leon D. Epstein, Professor\nof Political Science.\nJune 24\nThe Undeveloped Regions of the World, Theodore\nMorgan, Professor of Economics."
}