{
  "id": "d1530-0",
  "text": "June, 1956\nThe President’s Page\nDear NAEBers:\nAfter reading many of the comments of NAEBers, respondents to\nTHE QUESTIONNAIRE SENT OUT BY OUR RESEARCH COMMITTEE, l*M SOMEWHAT\nRELUCTANT TO PLACE THE FINGERS AT THE KEYBOARD. SOME DION’T WANT TO\nKNOW WHERE I’D BEEN, WHAT lfD BEEN DOING. OTHERS DID. SOME WANTEO\nTO KNOW WHERE I WAS GOING. OTHERS DIDN’T.\nWell, frankly, ! don’t always know where I’m going, and I might\nADD, NOT ALWAYS WITHOUT CAUSE. SOMETIMES I MAKE VERY IMPORTANT TRIPS\nON BEHALF OF NAEB ONf SHORT NOTICE. SKORNIA AND HlLL OFTEN DO THE\nSAME. AS I WRITE, HAROLD HlLL IS AT THE CENTER IN ANN AR80R WORKING\non a project. Harold had exactly 3 hours and l6 minutes notice be¬\nfore HE LEFT TOWN YESTERDAY AFTERNOON.\nNow, WHEN I WENT TO HOUSTON FOR THE COMMEMORATION OF KUHT-TV\nTHIRD BIRTHDAY ANNIVERSARY I HAD MORE NOTICE. JOHN SCHWAR2WALDER\nAND I WERE ABLE TO SET THAT MEETING UP EARLIER. BUT THERE’LL BE\nTHREE NAEB REGIONAL MEETINGS IN JUNE. WHETHER SCHOOLEY OR SKORNIA\nATTENDS DEPENDS A GREAT DEAL UPON OTHER THINGS THAT HAVE TO BE DONE\nAT NAEB HEADQUARTERS, AND I MIGHT ADD AT THE UNIVERSITY OF ILLINOIS.\nI STILL HAVE MY FULL RESPONSIBILITIES TO THE UNIVERSITY.\nSO, FOR THOSE OF YOU WHO WISH TO KNOW WHERE I * M GOING TO BE IN\nJune, please let me say that either Skornia or i, or VP John Dunn,\nOR ONE OF US, WILL BE AT EACH REGIONAL MEETING. DEPENDS ON THE\nMEETING DATES.\nFor sure, we know that Schooley will have met with the Radio\nNetwork School Committee at the end of May and first of June, and\nWILL HAVE ADDRESSED THE ENGINEERS’ SEMINAR DURING THE LATTER PART\nof May.\nThat takes care of both groups, I believe. I have also agreed\nTO GIVE UP SOME OF MY VACATION TIME THIS YEAR ON BEHALF OF EDUCA¬\nTIONAL BROADCASTING. YOU WON’T MIND IF I TAKE A FEW DAYS VACATION,\nWILL YOU?\nSome of my obligations, too, are with commercial broadcasters.\nDuring May I met with Illinois-Iowa news broadcasters, with the Illi-\nNOIES BROADCASTERS, AND ATTENDED A BMI PROGRAM CLINIC,\nLest you’ve forgotten, let me say that I also teach, and have\n22 FINAL EXAMS AND 22 TERM REPORTS FAC ING ME AT THE END OF THE MONTH\nDURING WHICH I PREPARE COPY FOR THE JUNE ISSUE OF THE NEWSLETTER.\nForty students have spent 30 to 60 minutes each with me during this\nWEEK PLANNING THEIR ACADEMIC PROGRAMS FOR NEXT FALL.\nPerhaps I should also mention that I held a conference with\nOUR LEGAL COUNSEL, LEONARD MARKS OF COHN AND MARKS. I MENTION THIS\nTO SHOW YOU THAT WE TRY TO KEEP ON TOP OF ALL THE PROBLEMS THAT HAVE"
}