{
  "id": "d1693-1",
  "text": "who directed the study under authorization of the Nebraska\nState Committee on ETV. His report recommends that the\nnetwork be constructed in a series of eight stages at a total\ncapital cost of $3,100,000.\nSchwarzwalder reported that in talking with literally hun¬\ndreds of Nebraskans, there was little doubt in most minds\nthat “(1) the quality of education in many schools can be\nimproved by the use of ETV, (2) economies can be effected\nby its use, (3) subjects for which qualified teachers are not\navailable can be taught by the use of an ETV network, and\n(4) in-service training of teachers, both formally and infor¬\nmally can be effected by ETV.”\nThe Nebraskans recommended that an unpaid, non-partisan\nETV commission be established to authorize policy and su¬\npervise control, with the University of Nebraska being asked\nto undertake operation of the network. Production studios in\naddition to those already in existence at the Universities of\nNebraska and Omaha could be considered after the network\nreaches maturity. Meanwhile, the report proposes that those\ntwo production centers feed programs to all six stations.\nNew Jersey Pushes Ahead on ETV\nOn January 17, Governor Richard B. Hughes signed into\nlaw a bill which permits local boards of education in New\nJersey to contribute up to $2 per pupil yearly to construct,\noperate, and maintain ETV facilities. According to Orville\nJ. Sather, president of the New Jersey ETV Corporation\n(nonprofit, founded by educators throughout the state), the\ncorporation may now move forward with its plans for a net¬\nwork of four ETV stations, the first of which is to begin\nbroadcasting this fall from Glen Ridge. Sather said that the\nimportance of the new law lies in the fact that it sanctions\nthe efforts of New Jersey school boards to create and direct\ntheir own nonprofit ETV network as well as to participate in\nthe ETV projects of neighboring states.\nHere and There\n• The EIA has formed a new educational section made up\nof manufacturers interested in development of electronic\nproducts for educational use. Stanley P. Lapin, director of the\nindustrial products division for Adler Electronics, has been\nappointed chairman of the new section.\n• The Israeli Government has accepted an offer of the\nRothschild Foundation to establish a pilot ETV station. Op¬\nerations are expected to begin in 1964 for an experimental\nperiod of two or three years.\n• Within the year Boston’s Catholic Archdiocese plans to\nbegin operating a UHF educational and religious TV station.\nThe station is said to be the first in the world operated by a\nCatholic diocese.\n• A new corporation “designed to make the weight of en¬\nlightened public opinion affect television programing has\nbeen organized in California. Cultronics, Inc. is located at\n2116 Atlantic Avenue, Long Beach 6.\nNews Notes\nGENERAL\n^ The National Audience Board, NAEB sustaining member,\nis to be reactivated under a new name. Peter Goelet recently\ndiscontinued the NAB because costs were too great.\n^ According to a telephone survey, 20% of TV viewers in the\nSacramento area regularly watch KVIE, the educational\nchannel. John Crabbe, general manager, told members of the\nCentral California ETV board of directors, “This places\nKVIE among the top educational channels in the nation in\nterms of viewers.” More than 2,000 telephone calls were\nplaced by 29 members of the Mass Media Committee of the\nSacramento chapter of the AAUW; slightly more than 70%\nof the calls were completed. The survey showed that KVIE’s\ntop-rated subject areas are music, foreign language, science,\ntravel, and art.\n^ The Chicago Board of Education’s TV College has an¬\nnounced that over 800 in-service and prospective teachers are\ncurrently enrolled in teacher-training courses. WTTW is\ntelecasting the sixteen-week courses in art, philosophy of edu¬\ncation, educational testing, and the teaching of economics.\n^ Purdue University’s WBAA was featured in the Winter,\n1963, issue of the publication by Sesac Music. The article was\nhistorical in nature, due to WBAA’s 41st anniversary coming\nup on April 4, 1963.\n^ During the winter quarter, approximately 3,500 University\nof Minnesota students are attending one or more classes in\nwhich CCTV is used, says Burton Paulu, director of radio\nand TV. Fifteen professors are using the CCTV cameras to\nteach students in 25 classrooms and one auditorium courses in\naeronautical engineering, biology, chemistry, dentistry (in\nwhich CCTV was introduced to the campus in 1958), educa¬\ntion, French, geography, history, laboratory medicine, and\npsychology. In addition, the recent installation of a videotape\nrecorder has made it possible to televise a World War II his¬\ntory course to additional classes besides the one hearing the\nlectures live this quarter. Some of these recordings will be\nused again in the spring for general extension division classes.\nThis will be the first regular use of videotape recordings in\nteaching at the University of Minnesota.\n^ Clarence Morgan, director of radio-TV at Indiana State\nCollege, reports that the CCTV system on that campus now\nconnects 77 classrooms to the radio-TV center. He also writes\nthat the radio tape network of WVIS is providing programs\nto 18 commercial and educational stations in Indiana, with,\none station in Texas carrying the programs.\n^ KQED-TV, San Francisco, will continue to air Open End\nbecause a national advertising agency is providing funds to\nkeep the program on the air. When the previous donor did\nnot renew the grant, Guild, Bascom and Bonfigli, Inc., stepped\ninto the breach because, to quote David Bascom, the agency’s\nboard chairman, “We feel an advertising agency today has a\nmoral responsibility to contribute to betterment of communi¬\ncations and encouragement of the free expression of ideas and\nopinions. . . . Over and beyond this particular program, we\nfeel it behooves the advertising profession to support non¬\ncommercial TV. Brushing any noble motivations aside, we\nought to do it strictly in our own selfish interests, to per¬\npetuate a breeding ground for unfettered new ideas. . .\n^ San Francisco State College initiated CCTV instruction on\nFebruary 11. Some 400 students, in various monitoring rooms\nthroughout the school, will take “Atoms and the Universe,” a\nphysical science required course. During the pre-planning\nphase, all the daily course materials and demonstrations were\ntransposed into complete daily TV script outlines. A limited\nnumber of these are available upon request. Write to Dr.\nGeorge E. Steiner, ETV Coordinator, San Francisco State\nCollege, 1600 Holloway Avenue, San Francisco 27.\n^ WTTW’s sixth annual fund campaign will be conducted\nMarch 9-17. Goal for the campaign will be $250,000, less than\na fourth of the 1963-64 budget for the Chicago station. The\nremainder of the $1,100,000 will come from funds from\nNETRC for program series; from the Chicago Board of\nEducation for TV College courses; from the Tri-County ETV\nCouncil for airborne lessons rebroadcast to more than a hun¬\ndred Chicago-area school districts; from courses of study re¬\ncorded for MPATI; and from recording work for many othet\norganizations.\n^ Iowa State University’s WOI was selected as winner of\nthe Radio Award of Merit by the Iowa Association for Men¬\ntal Health. Production Manager Michael Collins accepted\nthe award in behalf of WOI at a ceremony attended by Gov¬\nernor Harold E. Hughes and members of the state’s Sixtieth\nGeneral Assembly.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. $5.00 a year, $7.50 including Washington Report.\nEditor: Betty McKenzie. Phone 333-0580. Area Code 217. Report¬\ners: Region I—Michael Ambrosino, Ruane Hill; Region II—Shirley\nFord, Lou Peneguy; Region III—McCabe Day; Region IV—Richard\nVogl.\n2\nNEWSLETTER"
}