{
  "id": "d1763-3",
  "text": "-4-\nnWe cannot understand, Mr. Baldwin, why you—for the Federal Radio Commission—\npersist in calling for a mew arrangement on the time-sharing agreement between\nStation KGGF and Station WNAD. For years the business relationship between these\ntwo stations has been most pleasant in every respect. KGGF, as you are aware, is\nowned and operated by the Coffeyville Journal of Coffeyville, Kansas. Their\nmanager, Mr. Powell, has on numerous occasions in the past years made many con¬\ncessions in order to accommodate special broadcasts requested by the University of\nOklahoma on special hours. In fact, our numerous requests for special time have\nalways been granted except on two occasions. They would have been granted then\nhad we pressed the matter, but Mr. Powell informed us that he had certain contract\nprograms on the hours we desired and due to the splendid cooperation he had always\ngiven this institution we were very happy to cancel our request for special hours.\nOn two occasions, as I recall, Mr. Powell has requested a portion of our time due\nto some special programs in Coffeyville and the vicinity of KGGF. MAD gladly\ngranted these requests.\nT,A11 these facts are .set before you, Mr. Baldwin, so that you may understand that\nthere has been a most cordial business relationship between the two stations.\nSven now, in face of the letters you have addressed to KGGF and WHAD, we desire\nto continue under the old arrangement which was that MAP, the University of\nOklahoma station, be listed to have the air during the sessions of the University\nof Oklahoma on the following hours: 7:15-9:15 P. M., Tuesdays; 8:15-9:15 P. M.,\nWednesdays; 7:15-9:15 P. M., Thursdays.\n\"Then, too, we desire to continue our special arrangement MICH IS AGREEABLE WITH\nBOTH STATIONS and which is as follows: ’IT IS FURTHER STIPULATED AND AGREED THAT\nIN THE EVENT 'MAD DESIRES MORE TIME THAN IS HEREBY ALLOTTED TO THAT STATION THE\nDIRECTOR OF STATION MAD WILL MAKE APPLICATION TO DIRECTOR OF STATION KGGF BY\nLETTER OR WIRE EIGHT DAYS IN ADVANCE OF THE SPECIAL HOURS DESIRED, IT IS FURTHER\nAGREED THAT THE FEDERAL RADIO COMMISSION \" ILL BE IMMEDIATELY NOTIFIED THEN AND\nIF SUCH HOURS ARE GIVEN TO MAD BY SENDING IN TRIPLICATE COPY OF THE SUPPLEMENTAL\nAGREEMENT AFFECTING THE HOURS OF CHANGED PROGRAM. LIKEWISE, SHOULD KGGF DESIRE\nSCME OF THE TIME ALLOTTED TO MAD AND THE LATTER STATION ASSENT IN SAME MANNER\nAS OUTLINED IN PRECEDING PARAGRAPH FEDERAL RADIO COMMISSION ' ILL BE GIVEN DUE\nAND TIMELY NOTICE.’\n\"Will you kindly reconsider your request of March 5 and advise us at the earliest\npossible date whether the Commission will grant a continuance of this arrangement\nbetween MAD and KGGF, since it is satisfactory to both stations.\"\nThe above letter is self-explanatory. The action on the part of the Federal Radio\nCommission in sending the request has not to date been explained.\nRecently in a communication from Joe F. Wright, University Publicity Director and\nDirector of Station MLL, University of Illinois, this suggestion ?<ras made:\n\"SO'ETHING SHOULD BE SAID IN A NEAR BULLETIN ABOUT THE FACT THAT TOO MANY PERSONS—\nPARTICULARLY THE COMMERCIAL FOLKS, AND THE F.R,C. —SEEM TO THINK THAT ALL EDUCATION\nNEEDS IS DAYLIGHT HOURS. EVERY EDUCATOR SHOULD DRIVE HOME THE POINT \"HEREVER AND\nWHENEVER POSSIBLE THAT EDUCATION’S AUDIENCE IS A NIGHT AUDIENCE, ETC.\"\nPersonally, I am convinced that Mr. Wright has raised a very important question\nand a point that should not be overlooked in dealing with problems confronting\neducational stations. Mr. Wright in his communication suggests further:\n\"Some days ago we received a letter from Mr. H. C. Vance, Transmitter Sales\nEngineer of the RCA Victor Company, whose office is at 100 West Monroe Street,"
}