{
  "id": "d1763-6",
  "text": "-8-\nHowever, before a time division could be arranged received telegram stating\nthat we had been assigned to 570 kc. to share with VIBO, WHA and WCC.\ne. Y/hen YUT and 1VNAX also applied for time on this assignment a hearing\nresulted.\nf. Result of hearing: 570 k.c. assigned to WIBO, 'YNAX, and WPCC; we were\nassigned to Canadian shared frequency of 890 k.c. to share time with KFNF\nand KUSD.\ng. Yrheroas our first power assignments had been for 1,000 watts the nearness\nof tho Canadian border required a limit of 500 watts daytime and 250 watts\nnight time on 890 k.c.\nh. Although no hearing has been requested for removal from this frequency,\nor for change in power, such action was withheld on our own part because\nof the commission's ruling that the Fourth Zone and the State of Illinois\nwere both over-quota.\"\nFrom Dr. B. B. Brackett, Director of Station KUSD, University of South Dakota,\nVermillion, \"e submit below a summary of the information he sent to South Dakota\nSenators and members of Congress:\n”1 am writing you and other representatives of our state at Washington about the\nway the breadcasting station, KUSD, of our State University has fared at the hands\nof the Federal Radio Commission.\n”0n April 1, 1927, KUSD was broadcasting with 500 watts on 1080 K. C. and with\nunlimited time.\n\"The first license from the Federal Radio Commission, dated June 1, 1927, to become\neffective June 15, granted 250 watts on 620 K. C. with no restriction of time,\n\"This gave us a greatly improved wave channel and this more than compensated for\nthe reduction in power.\n\"In September, 1927, we again asked for 500 watts power and we repoated this\nrequest in August, 1928. The additional power was finally granted, effective\nNovember 11, 1928.\n\"In December, 1928, we were granted the right to use 250 watts additional during\ndaylight hours, and we continued to use this assignment until June of 1931, when\nwe concluded that the extra power of 250 watts for daylight broadcasting was not\nworth the trouble that it gave us and requested an assignment of 500 watts for\nboth day and night broadcasting. This of course was readily granted.\n\"From June 15, 1927, to November 11, 1928, we were on the 620 K. C. wave channel\nthat was decidedly the Hest frequency we have ever had. Since November 11, 1928,\nwe have been kept on 890 K.C. This, I believe, to be unquestionably the worst\nregional channel for use in this locality of any channel in the whole broadcasting\nband. It seems to have grown worse during the past year or two. It is so noisy\nafter sun-down that it is impossible to get anything like satisfactory results on\nit until after midnight, and often until after 1 a.m. It is Canadian shared so\nthat during the evening we could not be allowed to use more than 500 watts.\n\"There are in tho United States, in Canada, in Mexico, in Cuba, and in Porto Rico\nfourteen stations using the 890 K. C. channel. Our station with two others are\nthe only ones sharing time division, so that twelve of the fourteen stations may\nbe broadcasting at the same time. There is so much background noise on this\nchannel tliat at practically all places in South Dakota and in adjacent states, it\nappears to listeners that our station is operating very poorly."
}