{
  "id": "d1763-8",
  "text": "-10-\n\"We are handicapped in one respect, however, as our school is composed entirely\nof boys but this problem is being turned over to our dramatic de par tire nt for\nsolution. Keep up the good work.\"\nThe folioring is a copy of a letter from Mr. S. Jones, Station KFDY, Brookings,\nSouth Dakota, addressed to Mr. R. C. Higgy, Ohio State University, Columbus:\n\"Thank you for the tro plays rhich re have recently received from you through the\ncooperation of T. M. Beaird. We have not used those plays yet, but I turned them\nover to the Dramatics Department, and they are planning to stage the one entitled\nTAn Ohio Enoch Arden’ over the radio, KFDY, in the near future.\n\"Please keep us on your mailing list to receive both these plays and your program\nschedules of WEAO. Thank you.\"\nBelor is a copy of a letter from Mr. Daniel E. Noble, Station WCAC, Connecticut\nAgricultural College, Storrs, Connecticut, addressed to Mr. R. C. Higgy, Ohio\nState University, Columbus:\n\"Fe rore very pleased to receive copies of the radio play - ’Underground Railroad.’\nThe play seems eminently suited for radio presentation and re plan to use it within\ntro reeks. At present, re are maintaining a weekly play schedule at FCAC, and\nre rore somewhat short of material when your play arrived. A regular service\narranged to provide for the distribution of plays would bo a great help to the\nmember stations maintaining a regular play broadcast schedule.\n\"The play, ’An Ohio Enoch Arden,' was broadcast from our station last reek, and\nras well received.\n\"Probably - all of the members of the Association are not interested in the dis¬\ntribution of plays, and I feel that the expense of such distribution should be\nborne by the members rho wish to be retained on the mailing lirt. The charge\nshould be uniform and I suggest that the officers estimate the cost of distributing\nthe mimeographed copies and charge the stations accordingly. I hope you ’.'ill nlan\nto have the service continued indefinitely and I am sure that the distribution”of\na play each month would bo welcomed by all stations maintaining dramatic groups.\"\nWo quote from copy of letter Hr. Michael P. Kinsella, Program Manager, \"HAD,\nMarquette University, Milwaukee, Wisconsin, sunt to Mr. R. C. Hiffgy, Ohio State\nUniversity, Columbus:\n\"We have received your second radio play ’The Underground Railroad’ rhich re shall\nuse in the very near future. ’An Ohio Enoch ^rden’, rhich you sent us some reeks\nago, has been used with very favorable results. I might say that tMs service is\nvery worthwhile and very much appreciated by station FHAD. We shall be more than\nglad to receive and use any plays you may care to send us.\n\" w are very sorry that re haven’t any plays to submit ourselves. However, re\nhave one dealing with the life of Christopher Columbus and entitled ’His One Com¬\nmand.’ Copies of this play will be sent to you shortly.\n\"Thank you again for your courtesy in supplying these plays.\"\nFrom Mr. TT. C. Palmer, Director of Publications, North Dakota agricultural College,\nFargo, we quote from copy of letter sent Mr. R. C. Higgy of Ohio State University:"
}