{
  "id": "d1763-9",
  "text": "-11-\n”1 have just received the two radio plays ’An Ohio Enoch Arden,’ and ’The Under¬\nground Railroad’ from T. IL Bcaird, secretary of our association.\n”r.re have not done anything along this line yet. We are much interested, and I\nam going to take this up with our Public Discussion department. I believe that\nMr. Arvold rill be interested in havin'\" his department work on and present radio\nplays.\n”1 shall appreciate receiving copies of radio ploys that you prepare. Maybe we\ncan send you some a little later.”\nFrom Dr. B. B. Brackett, Director of Station KUSD* University of South Dakota,\nVermillion, wo quote in full the letter receiveu. on March 4:\n”1 tried to tell you in a recent letter that I did not think at all highly of the\naverage program from the commercial station, and that I considered their claims\nto such -*onderful productions in that line very absurd.\n’’Here is a quotation from the publishers of ’Time’ that quite expresses my ideas,\nexcept that I think much of the music put on by the ’chains* and other commercials\nis terrible, and contributes nothing beneficial to the general public. But let’s\ngot back to the quotation: ’That tens of thousands of listeners should protest\nso violently,’ said the magazine, ’. . . was testimony to the leanness of radio\nfare. For all its blatant claim to being a medium for education, radio contributes\nlittle of its own beyond the considerable service ofbringing good music to the\nmillions. Yet radio-men sputter with rage ’when radio is called just another\nmusic 1 instrument.’\n”1 did not report much of the time that we-give to music as ’educational’ but\nI think I might have so classified nearly all of our music.\n\"’The Music Shop Hour’ of the Ames Station, WOI, is most certainly educational,\nand we are broadcasting much music now that is just as good as that from VOI. We\nare making quite a little use of records belonging to the musical department of our\nCollege of Fine Arts, and used by them as examples of the finest music ever pro¬\nduced.\n’’The persons directing our college and university stations are as capable as any\npersons in the world to decide whether the material presented is educational or\notherwise and surely no class of persons are more honest or more certain to report\nexactly what they believe to be true.\n”If we are not honest enough to tell the truth, it certainly would not be obtained\nfrom those who are putting out the kind of statements in many of the commercial\nprograms.”\nAdditional bulletins will be released from time to time dealing with the problems\nnow before your Association."
}