{
  "id": "d959-21",
  "text": "\"I&tffrpcfeal for Professional Advancement Activities\nI am basing the fiscal material presented below on the following premises which I feel\nare important.\n1-1 believe we should abandon the Scholarship program because it has not really\nproved to be very successful in my opinion. If we were in a position to offer larger\nscholarships, it might be worthwhile, but under the circumstances I believe our money can\nbetter be spent, and do more good, for seminars and workshops and workshop grants-in-aid.\n2-1 believe this request (for funds for professional advancement activites) should be\ntied in, to a certain extent, with our request for operational money for Hq. I think we\nshould not request money for a coordinator for professional advancement activities,\nbut should point out that if such a grant is forthcoming we will be able to coordinate\nthe activities by merely supplementing our present staff somewhat. We should point out that\nthis is the most feasible and economic method since it is difficult to get good people\n(othet than secretarial) on a short-term basis. We could handle the grant by adding some\nsecretarial help, and even a part-time graduate assistant if necessary, but the basic work\nwould be done by us and part of the grant would be used to pa^Lpur jsalarie s, thus cutting down\nthe size of the operational request, should this grant be mad\n3-1 believe the normal activities we have been carrying on in this field should be com¬\nbined with new and increased activity in the area of utilization, and we can use the\nrecommendations of the recent utilization seminar to back this up, especially since\nsome pretty good teacher-training people were there and concurred. I believe we should\ntry to set up regional and local seminars and workshops on utilization. Teachers and\nbroadcasters would pay their own expenses (which wouldn’t be too great if meetings are held\nin several locations) and we would provide the leadership and consultants.\n4 - Schooley mentioned that he thought it would be a good idea to try to get some money to\ngive eomplimentary subscriptions to the Newsletter and Journal to leading educators. I\nagree that this might add more prestige to the organization than most things we could do and\nmight ultimately lead to a broader and firmer base of operations. I also believe that\nthis should be tied in with the professional advancement grant rather than the operational\nbudget.\nBased upon the above, I would recommend that we request the following budget for each\nof three years, beginning July 1, 1959 and ending June 30, 1962:\nSalaries (portion of Hq. staff salaries, plus\nneeded additional help)* $20,000.00\nTravel 4,000.00\nSupplies and expenses (incl. anncts., reports,\noffice supplie s) 5,000•00\nFour seminars and/or workshops for broadcasters 24,000.00\nWorkshop Grants-in-Aid 6,000.00\nFunds for leadership, travel and consultants for utilization\nseminars on a local and regional basis - four of them. 8,000.00\nTo provide 1000 complimentary subscriptions for the Newsletter\nand Journal to educational leaders 6,000.00\nYearly total $73,000.00\nNote-43,650 per year would have to be added to this for University administrative eharges\nif this grant were made to the University in our name.\n*For utilization seminars I would propose that we hire an educational consultant to help\nplan and acrry these out, but this would not be a full-time man on our staff. Rather, it\nwould be someone like Wells Foshay whom we would pay a retianer to help us with these and\nact as a consultant to some or all of them."
}