{
  "id": "d959-28",
  "text": "DRAFT 08U; BOT FIHAX TOISIQB\nHECOISeSfMTXCBS\nFIS®\nTEE KH® SECTAIt OB ISSIKOCTIOfflVL OSES CF TEEKFISIOH ABB RADIO\n1. It ie reooraaended that the HAKB make contact with the ASCB to bring about a\ncooperative study of the actual and potential uses of television and radio\nin education and of the respective roles and responsibilities of teachers\nand educational broadcasters in using these media in accomplishing the sins\nof education.\n2. It Is recc«aaeiided that the mm initiate group action with appropriate pro¬\nfessional educational organisations to bring about the preparation and distri¬\nllion of a series of kinescope recordings (with related guides, outlines,\nand manuals) dealing with principles, practices, problem, and exiles of\nclassroom utilisation of educational television and radio. The use of these\nkinescope by instructional staffs of teacher training institutions mid public\nschool systems should he facilitated and promoted.\ny* It is recommended that educational broadcasters, in collaboration with school\nand college personnel in supervision and curriculum, initiate local and\nregional workshops in which educational broadcasters and teachers would work\njointly on the problems of classroom utilization of radio and television.\nk* It is recommended that the NfcEB explore the possibilities for preparing a\npublication describing current practices in teaching by radio and television.\nThe use of such a publication ineertain courses in teacher training insti¬\ntutions should be encouraged.\n5* It is recommended that contact be made with appropriate professional educa¬\ntional organisations in m effort to bring about the inclusion of suitable\nmaterial relating to the educational uses of radio and television as a part\nof required courses for teachers.\n6. It is recommended that asmpUa of study guides, teachers* handbooks, aid\nother aids to utilisation be distributed as widely as is practical to other\neducational radio and television stations and production agencies.\n7. We endorse the recommendation for the estoblishmeat of a national repository\nof kinescope recordings of in-school programs at the E.T.R.C.\n8. It is recommended that research be undertaken to compare results of instruction\nby television with results of instruction that represents the range of\nteaching in the classroom. It was felt that most conpsrativo studies hare\ncompared television teaching with \"the best\" of classroom teaching rather\nthan with either the average or the rang© of classroom teaching.\n?• It is recommended that the KA1B intensify its efforts to facilitate and\nsimplify the clearance of films, music, and other related materials for use\non educational broadcasts.\n10. It is recommended to the HAEB Board of Directors that ways and mma be\nfound (1) to stimulate a continuing program of creative educational planning\nSn the area of instructional broadcasting sad (2) to finance and organize\nprojects arising from such planning.\n9/23/$%\n# # #"
}