{
  "id": "d959-70",
  "text": "De®n W. W. Wlrtght\nDaceniber 18, 1958\nla eoigaarclal broadcasting the only people who haws specific standards to mat\nare the engineers. They nast hero licenses from the FCC. Bat the people who\nplan, write and produce programs here no standards or quallfi.oat.loas to meet.\nBy analogy, the delivery boy would be licensed, but the food packager, or\npharmacist who determines what is delivered, has generally had no t^siodog In\nlearning theory, social responsibility or any of those other areas ufaich would *\nreduce the accident of unintended effects***~with which the present system is\nnew replete* So we here® been trying to evolve standards for educational broad*\ncasters to meet (much as the AASA and other groups have Wen doing)* This also\nincludes teachers who plan and produce or broadcast programs over these madia*\n■We have been invited by & Foundation (not Ford), which is greatly interested in\nthe need for such leadership, to bring in a proposal for a three to five year\nproject to begin to cope with this problem* The Foundation representatives\nhave been most pleased with the educationally responsible uses we have made of\nother fends given us for coiaparable developmental projects, and they believe m\nare the organisation to coordinate and/or administer it*\nTraditionally, as our Training Program outline shews, we have always felt that\nour big projects require our using, as consultants, the best minds in thenaation,\nfrom the subject matter fields concerned* In this way we serve more as catalysts\nrather than anything else, and avoid the danger of promulgating whet might be\nunsound philosophies, however sincere our intentions might be*\nAs we see it therefore, this project would require the cooperation of several\nschools of education end/or teachers® colleges* It would also involve cooperative\nplanning with the A*A*C*T*K. and other such groups*\nIt would involve our assisting schools of education or teachers® colleges, which\ndo not now have such courses, to plan and develop courses in the uses of television\nand radio, principally as a part of their teacher training program* Later ex*\npensions would depend on the initiative of these schools themselves*\nm greatly fear gadget*orieatatl«u Our studies of the few courses new given in\nthe utilisation of television end radio, and of the actual \"utilisation0 procedures\nbeing practiced, gives us considerable cause for concern* For few of the teachers\nof such courses (George Johnson is an exception) understand enough about the\nbasic nature of TV and radio, potentially, as educational instruments* to realise\nmors than a fraction of the possible advantages they can provide* For your confi¬\ndential information, I am attaching a copy of a draft of another project which we\nfeel needs doing* This (dittoed) draft explains what we mean better than 1 can\nrephrase it here* I find this whole problem very exciting, and urgently in need\nof study and development if we are not to be trapped into merely mechanical usee\nof television and radio in education, or in utilisation of them*"
}