{
  "id": "d1558-1",
  "text": "ELECTION CHANGES IN STRUCTURE OF HOUSE AND SENATE COMMERCE COMMITTEES\no\nThe November 3 Congressional elections saw most incumbents on the 33-man House\nCommittee on Interstate and Foreign Commerce returned to office. Five members of the\n.Committee lost in their bids for re-election; two other members were defeated in the\nprimaries. Among the casualties were: Paul F. Schenck (R-Ohio); Milton W. Glenn (R-N.J.);\nAbner W. Sibal (R-Conn.); Donald G. Brotzman (R-Colo.); J. Glenn Beall (R-Md.); J.\nArthur Younger (R-Calif.); and Kenneth A. Roberts (D-Ala.). Congressman Roberts was\na key figure on the House side in obtaining enactment of the ETV Facilities legislation.\nTHREE APPLICATIONS ACCEPTED FOR FILING UNDER ETV FACILITIES ACT\nIndiana State College, Terre Haute, Indiana, $186,054 in Federal funds to activate\nChannel 27 at Terre Haute. Total project cost is $337,554.\nCommonwealth of Puerto Rico, Department of Education, $298,831 to expand facilities\nof Channels 3 and 6 at San Juan and Mayaguez, respectively. Total cost, $398,441.\nBay Area Educational Television Association, San Francisco, California, $202,260\nto expand Channel 9 at San Francisco. Total Cost, $269,880.\nA fourth application, already accepted for filing, has been amended: Nebraska\nETV Commission, Lincoln, Nebraska. Original request for $156,643 has been amended to\nincrease the amount to $182,747. Total cost of the project to be increased from\n$313,287 to $365,494.\nHEW GRANTS PROVIDE FUNDS FOR ETV STATIONS\nSix grants recently announced by HEW bring to 45 the number of projects approved\nunder the Educational Facilities Act. Total expenditures since funds became available\nis $8,141,062.\nGrant of $186,235 made to the Greater New Orleans ETV Foundation to expand the\nfacilities of Channel *8. With the expanded facilities, the station will reach an\nestimated 1,126,000 persons and 495 educational institutions.\nGrant of $300,000 to University of Illinois Board of Trustees to improve the\nfacilities of Channel *12. The project will quadruple the coverage area and provide\nservice for 886,000 of whom 251,500 are students enroled in 774 educational institutions.\nGrant of $250,000 made to ETV Association of Metropolitan Cleveland to activate\nreserved Channel 25, bringing a new ETV service to an estimated 3 million people,\nincluding 773,000 students at approximately 350 institutions.\nGrant of $96,299 made to University of Idaho to activate and provide a tower,\nantenna, transmitter and other equipment for Channel 12 at the University of Moscow.\nHie new station, expected to provide service to about 155,000 persons in Idaho and\nWashington, will be the first in a 3-station chain that ultimately will link Moscow,\nBoise, and Pocatello.\nGrant of $298,527 made to Alabama ETV Commission in Huntsville to activate\nChannel *25. This station will extend the Alabama network service to more than 331,000\npersons, including 95,000 students in metropolitan Huntsville and five surrounding counties.\nGrant of $381,707 made to the Board of Education of the City of New York to\nactivate and acquire equipment for Channel 25, New York City. Total estimated cost is\n$810,425. Nearly l4 million persons, including over 3 million students in 4,897 educa¬\ntional institutions are the potential audience of the station. Five boroughs of New\nYork, together with the contiguous counties of Nassau, Rockland and Westchester, New York;\nBergan, Essex and Somerset, New Jersey; and Fairfield, Connecticut, will be reached\nby the new station."
}