{
  "id": "d436-19",
  "text": "NAEB Headquarters\n14 Gregory Hall\nUrbana, Illinois\nTOs NASB Granis-in-Aid Committee\nBichard Vogl, Chairman\nJack Westbrook\nJohn Henderson\nWilliam Harley\nLee Eitzen\nRadio Network School Committee\nProgram Planning Subcommittee ^\nMarguerite Fleming, Chairman\nMo McCabe Day\nMarie Scanlon\nGeorge Johnson\nVernon Bronson t\nFROM: H, J„ Skornia $\nDATE: February 4* 1955\nSUBJECT: Qrants-in-Aid Area Proposals\nRadio Network Committee Program\nPlanning Subcommittee\nKenneth Wright, Chairman\nBernard Buck\nLee Eitzen\ncc: NAEB Board\nDr. Ho K* Rewburn, ETRC\nIn ray note of February 2 to you I mentioned that I would send you a copy of\nDr0 Rayburn9 s reply to my inquiry to Mm, if it would affect your thinking on\nthis*\nHerewith his reply to this portion of ray recent letter to him:\n**You refer to the attitude of 'our Board toward the grants-in-aid picture.\nI think actually what they had in mind was that they would like to see some evi¬\ndence of a planned sort of program on the part of the NAEB as it requested\napplications for such grants. I suspect that our Board is anticipating something\nthat might be a little difficult to achieve. They seem to feel that there was\nno necessary rhyme or reason to the various -kinds of grants which were made and\nthat possibly there could be some guidance given to the various potential appli¬\ncants by outlining the areas in which the NAEB would be most interested in\nsecuring program content, At least, they expressed the hope that grants would\nbe made through the use of Center funds which would tend to fit into some sort,\nof broad general pattern. I don6t know whether this helps you or not, tut if\nit doesn*t, ask ms another question and I111 try again. w\nI hope we may hear from you (with carbons of your ideas to Dick Vogl if\npossible) as soon as possible. It” s you-? Network and should offer what the\nmembers of the NAEBss responsible Committees believe it should.\nHJSjjy\nInformational copies to John Henderson, Chairman, Radio Network School Committee\nWaldo Abbot, Chairman, Radio Network Committee"
}