{
  "id": "d1017-0",
  "text": "PRIVATE LINE-6: 'AN OCCASIONAL /fEWSLETTER FOR THE STATIONS OF NATIONAL EDUCATIONAL RADIO\n®®nv ®® ®® ®® ®® ®®\n® ®t IrQ ®® ®® ®® ®® ®® ®®\nPUBLISHED FOR REGION 3£I BY KEBS, SAN DIEGO STATE - FRANK W. NORWOOD, REGIONAL DIR., NER\nPL-6 goes monthly\nAt the suggestion of Bob Mott of KWSC, PL-6 will be published on a monthly\nschedule. We hope that NER-6 stations will find the newsletter more helpful\nif issued with some degree of regularity, and that you will all help us to\nrise to the occasion by contributing more news items, more often.\nNER-6 AT WRTC\nJohn Witherspoon, Associate Director of NER, and the representatives of\nNER-6 stations were the principal contributors to the success of the NER-6\nmeeting which was held in Portland in conjunction with the 1965 Western\nRadio and Television Conference. As advertised, the meeting was a \"shirt¬\nsleeves session\" in which Witherspoon reported on developments at headquarters\nin Washington, and responded to questions and comments from the floor. Among\nthe points raised was the development of additional programming (the Pacem in\nTerris series will soon begin on the network; Westinghouse Broadcasting has\nmade available a substantial number of documentaries and these will be culled\nfor programs suitable for NER Network distribution—all at minimal costs to\nNER), the need for more and better program promotion (the GATEWAY TO IDEAS\nand CONGRESS mailers are a step in the right direction, but more are needed),\nand copyright (a new edition of the proposed copyright law is expected\nshortly from the Register of Copyright, and NAEB/NER will offer comments in\nreply). Witherspoon reported, too, on the progress of the Educational\nCommunications System project. Phase II has ended, and a report has been\nsubmitted to USOE, along with a proposal for Phase III which would involve\nsome eighteen months for the establishment of regional pilot operations as\ndemonstration of the feasibility of a nation-wide ECS. Approval and funding\nfor Phase III is expected shortly.\nOne principal theme which ran through both Witherspoon's remarks and the\ncomments from the floor was the need for increased \"dialogue\" between NER\nstations and national and network headquarters. This relatively unstructured\nmeeting was one attempt to provide such feedback from member stations.\nBob Mott's suggestion that PL-6 appear more often was another. John Witherspoon\nadded the suggestion that all important correspondence to Washington and\nUrbana ought to be prepared with a carbon copy to the Regional Director so that\nhe can provide explanation or help, if possible, and so that each Regional\nDirector can provide the Front Office with a sounding of the opinion in his\nregion.\nWith all credit due John Witherspoon and those of you who were able to spend\ntwo and one-half hours with us in Portland, comments on the meeting were\nmost favorable, and no one who attended left feeling that he had not had\nfull opportunity to \"have his say,\" nor that he had had less than honest\nanswers."
}