{
  "id": "d1017-116",
  "text": "-23-\nwhich he would have moved had he put his mind to it. If you can do that, he will\nfind you both interesting and valuable. And he will be waiting for you any time\nhis leisure permits.\n(c) What I have just said suggests another approach to the \"magic platitude.\"\nChoose a matter upon which you have genuine feelings; and about which you know\nmore and have thought harder than your listener. This does not mean \"talk down\"\nto him.- ... Few'things are worse than that. 3ut he must fedl that you are worth\nlistening to. He must feel that you have something which he hasn't. Othezw/ise\nyour ideas are, as the French say, »deja vues\", old hat. In a perfectly unobjec¬\ntionable sense of the words, he must feel ihat you are superior to him in respect\nto your topic. It is fatal to be so \"folksy\" that a listener who lets you into\nhis mind for half an hour feels no pressures while you are there, feels in nowise\n\"stretched\" after you are gone. That would not be academic broadcasting as I\nunderstand the term.. There is no place here for Jack Benny or Arthur Godfrey.\nYou have a part to play and your best chance of playing it well is to have a sub¬\nject which has laid hold on your own mind, about which you know more and have\nthought harder than your listener.\n(2) My first piece of advice was: Pick a topic which you can make both\ninteresting and valuable, (a) tty second is this: Learn to read from a script\nas though you were talking; and learn to write such scripts. I have strong con¬\nvictions on this. There are in academic broadcasting two things which are an\nabomination. -One is the man who is trying to ad lib his stuff. The other is the\nman who is reading his script and sound like it. I don't know which is worse.\nSeveral perils attend the first man. He may wander around. He may become repe¬\ntitious. He may fall into seconds of silence or uh-ing and ah-ing. He may talk\nhimself out before.jhis time is up and start padding. He may be only part way\nthrough • when his time is up and start cutting corners. He may be unnerved by the\nimpersonality of the mike and become stilted and strained; or try to offset this\nby getting \"folksy\" and \"anecdotal.\" He may start listening to the sound of his\nown voice. These are all bad. They have all happened to me, and the memory of\nthem.brings out a cold sweat. And the point is, they are all unnecessary. A pro¬\nperly .concocted script, worked at until you can read it as though you were talk¬\ning it, is all that is needed. There are two matters here. It must be properly\nconcocted. It must be written as you would talk when you are doing normal straight¬\nforward academic talking. This does not mean \"written as you would write an arti¬\ncle.\" A radio script is not at all the sane as a manuscript. It must fit your\npersonality more closely. It must be less packed and more expressive. It has a\nplace for short sentences; for rhetorical questions; for homely idiom; for racy\nmetaphor; for the first person singular; for passages you would normally say with\na smile or a frown or a look of puzzlement. The point is, a script must be writ¬\nten to be talked. When read aloud it must not sound as though it were written to\nbe read. This is a knack. Any self-respecting academic who wants to broadcast\ncan learn to do it. There are two steps. One, you learn to write as you would\nnormally talk;.two, you learn to read what you have thus written as though you\nwere talking, and not reading. This takes a little self-knowledge, a little re-\nwriting,and rather more than a little practice at making your tongue say what\nyour eye sees, in the manner that you speak when you talk.\n(b) Anything else I can say is secondary to that. But for what they are\n■qorth, I shall close with a few miscellaneous do's and don'ts. (1) Never under¬\ntake less that fifteen minutes or more than thirty minues. There is a certain\nsolidity to the subject-matter of academic broadcasting. It is not news or anec¬\ndotes or jokes. It doesn't come in less than fifteen minute packages. It normally\ncontains exposition, description, narration, argument, criticism; and these take\ntime. It is addressed to the mind, and it takes time to involve a listener’s mind"
}