{
  "id": "d1017-29",
  "text": "Flemming\n7\nThe way is clear to correct the situation. Are we willing to become involved in movements\nwithin our own community which would develop a public opinion which will say to our school\nboards, to our superintendent of schools and our principals, we want to move in the direction\nof making it possible for our young people to know something about religion. If we are\nwilling to take full advantage of the opportunities that have been presented to us by the Supreme\nCourt decision, our generation can become known as the generation that made a significant\ncontribution to wiping out religious illiteracy. We can't afford generation after generation\nmade up of a large percentage of religious illiterates. It will do something in the long run\nto the nature of our society.\nIt seems to me that we not only have to think in terms of what our attitude may be toward\nthis particular issue. I believe that we have to ask - what aho ut our own participation in\nthe religious life of our day? It seems to me that we do have to ask ourselves the question\n- Is worship a prerequisite to obtaining the strength that is called for by involvement in\nthe issues of the day? But then there is another question that it seems to me we have to\nask ourselves. The National Observer put out a book just recently entitled \"Religion in\nAction. \" The opening paragraph of that book reads as follows: \"Religion is at a turning\npoint. From many sides traditional values, Protestant, Catholic, Jewish are being\nchallenged. Materialism, racial violence, Communism, indifference, moral decay,\nslums, all of these forces pose questions that churchmen believe they must answer now.\nThere is a growing company of men and women within the churches who feel that they\nmust relate themselves, that they must become involved in issues of this kind.\" Are we\nlikewise going to become involved? Or are we going to stand on the sidelines as spectators?\nWell, I return to the point at which I started. Will it be the spirit of the thirty-eight witnesses\nor the spirit of the Peace Corps volunteers that will characterize the day and age of which we\nare a part? Are we, no matter what our vocation in life, willing to become involved in the\nforces which are at work and which if encouraged and cultivated can mean that this will\nprove to be one of the greatest ages in the history of mankind? To become involved or not\nto become involved, that is the question that faces all of us."
}