{
  "id": "d1017-30",
  "text": "Banquet Address Given by Lawrence Laurent\nTV Critic, Washington Post, Washington, D„ C.\nto Western Conference on Radio and TV,\nFebruary 19, 1965\nIt is always a pleasure to visit Portland, “The City of Roses\". Every time I come in here it\nkeeps running through my mind a line out of James Barrie's \"Courage\" speech at St. Andrews,\n1922s \"God gave us memories that we might have roses in December.\" Well, roses anytime\nof year in Portland seem to be excellent. It is a very special pleasure because this is the only\nplace any more I get to see my good friend and informal teacher, Ralph Steetle. I don't think\nany of us know fully what Ralph Steetle meant to the educational television movement unless\nyou were around Washington in those days when this movement was being threatened with\nextinction almost every day. It's a pleasure to see you again.\nAnd for many years I’ve read and I’ve heard about the work being done at this Western Con¬\nference. I had heard that it was where the commercial and educational broadcasters met,\nsomewhat relaxed aiid in an informal atmosphere.\nWell the fine results of these meetings over the years is a monument to the people who attend\nthese sessions. Thanks to Francis Murphy I did drop by one of the West's great newspapers,\nthe Portland Oregonian today and I do have a couple of news bulletins for you. First, for the\ncommercial broadcasters there is a new development in thp Jackie Mason-Ed Sullivan battle.\nYou'll recall Jackie Mason's hand guestures on the Sullivan program; Ed cancelled the con¬\ntract; Mason filed suit for one million dollars. Well, today Mr. Mason announced that if he\nwins the suit, he'll change his name to \"Qoldfinger.\" Then there's a sort of minor bulletin\nfor the educators. It seems that the word out of Colorado Springs is that the Air Force\nAcademy is considering negotiation of a \"test ban treaty.\"\nI am always pleased when the commercial and the educational broadcasters get together. You\nhave much in common and your common interests far outweigh your differences.\nYou see, every commercial broadcaster does teach, he does supply information, he does shape\nattitudes, habits, and he does help with the formation of informed opinion. And every educa¬\ntional broadcaster of necessity is involved with money; he must pay bills for power, payrolls\nmust be met, equipment must be bought, and programs must be financed. And each group\nultimately will survive the public acceptance of the role he has chosen.\nNow in the sessions around here I have been particularly pleased that for the most part the\nWestern Conference has avoided those snarling sessions we used to have back in thq East.\nA lot of time was wasted while the educators decried the excesses of the commercial broad¬\ncasters and the commercial broadcasters responded with broadsides against the failures of\nthe educational’s establishment. Back the other side of the Rockies, you will recall, Ralph,\nwe used to endure these pointless sessions and while we sat there the thing that kept running\nthrough my mind was a couplet out of Purcell's \"Dido and Aeneas\": \"Great minds against\nthemselves conspire and shun the cure they both desire.\"\nSo you understand why I am pleased to be with you and particularly for this consideration of\nthe \"Responsibility of Broadcasting in a Changing Society.\" So let's look for a moment at\nsome of the ways this society is changing."
}