{
  "id": "d1017-32",
  "text": "Laurent\n3\nResponsibility means that you will help with solutions to problems and that you will strengthen\nthe economic base and it means most importantly that you will help to narrow the gap between\nthe individual citizen and Ms elected officials. Because responsibility is a great big job and\nperhaps by now you will join me in seconding the thought that appears in Remain Gary's\n\"The Roots of Heaven\" where he says, \"Dogs aren't big enough anymore; men need elephants. ”\nAll the technological advances that we've discussed aren't going to help you much in tMs area\nof responsibility; we are going to need in growing numbers, people who are dedicated to\nbroadcasting, people who will master those grubby disciplines, and be willing to sweat\nthrough the masses and masses of information to get at meaningful, understandable facts. Of\ncourse there are problems and there will always be problems in an industry that has grown\nand prospered on controversy.\nIn WasMngton at tMs particular moment a small fire is burring over the chaotic state of the\nrules of political broadcasting, and I hope I contributed some fuel to that fire in my work with\nNewton Minow. Right now there isn’t a broadcaster in America or a communications lawyer\nwho can predict accurately just how the Communications Commission will rule on a pending\nequal time case. For example, in the recent campaign, a President's news conference was\nnot exempt from equal time although the presence of several hundred reporters would seem\nto indicate that bona fide news was being made. Well, how about a President’s appeal to the\ncitizens to support something as non-controversial as the United Fund? Well, each licensee\nwas advised to make up his own mind and to defend himself against the possible consequences.\nWhen our President went on the air to give a report in three areas of crises, it: was a talk\nthat was scripted and planned and control rested completely with the President who was also\na candidate. Well, folks thaf was exempt }jy a ruling of the FCC, a 3-3 split in the United\nStates Court of Appeals and by a 6-2 vote in the Supreme Court not to hear arguments in the\ncase.\nIt isn't surprising that Associate JustioeArthur Goldberg descended in that vote and noted that\na number of recent FCC rulings \"have not been wholely consistent.\"\nCongress in the current session is interested in a certain amount of harassment about the\nFairness Doctrine, but no congressman is yet willing to give the broadcaster his head. Now\none of the reasons I am out here is to ask you not to let this controversy follow the traditional\npattern. The usual pattern is to get worried about Secion 315 of the Communications Act\nabout 4 months before a national election. The time to ask for repeal, or at a very minimum,\nreform, is right now. And it's here I ask that you assert your responsibility and demand\nthat broadcasters be treated as adults.\nAnother small conflagration is over the FCC’s requirements in the area of religious broad¬\ncasting. A fine contmunications lawyer and my good friend Marcus Cojm holds that this\nrequirement violates the first ammendment; the one that says \"Congress shall make no law\nrespecting the establishment of religion and the free exercise thereof.\"\nThen came Commissioner Levinger last month with a nice legal brief, 123 footnotes and\ncitations, and he proved to my satisfaction that the FCC is violating the Supreme Court's\nrecent insistence that the government be neutral, neither for nor against, those matters\npertaining to religion. You see I happen to believe after many years being close to this business\nthat the broadcasters would serve the religious interests of a community without a demand from\nthe FCC. And here again is one more place to assert your responsibility."
}