{
  "id": "d1017-33",
  "text": "Laurent\n4\nNow let's look at the pocket book issues, the money issues. What are we going to do about\ncommunity antenna television? Well, first, the most powerful lobbying force in the broadcasting\nbusiness, the National Association of Broadcasters, isn't going to do anything. It can't. Too\nmany of its broadcasting members have invested in CATV and they like the results of those\ninvestments. The majority at the FCC act as though they would be most pleased if this very\npolitically dangerous issue would simply disappear. One major group of broadcasters is\ndemanding for CATV what they abhor for themselves; tough, tight, restrictive legislation,\nand the full protection of a broadcasting station. And for the sake of all of you, this particular\ngroup had better move carefully. It is not easy to drop poison into a bucket of water and\ntaint only a few drops. You start dropping poison into a bucket, you usually taint the whole\nbucket. Certainly much litigation and court wrangling is ahead for all the CATV operators.\nIt might take a good ten years to determine precisely the property rights and the payments\ndue for those who write or produce or perform programs. Programs that are sent over the\nair and relayed by a CATV system. Inasmuch as I am not handicapped by a legal education,\nI won't take this into any deep involvement, I just simply have to rely on what Justice Oliver\nWendell Holmes wrote in the Supreme Court majority in 1914° He upheld the copyright\nowners’ right to control public performance of a musical work for profit and his exact words\nare going to be bounced around so many court rooms over the nqxt few years, I'll give you\nexactly what he said, \"If the music did not pay, it would be given up. If it does pay, it pays\nout of the public's pocket. Whether it pays or not, the purpose of employing it is profit,\nand that is enough.\"\nWell, remarkable performances of some of the very fine people in the CATV business have\na counter-argument. They say, \"we don't sell programs; we sell the cable connections and\nreception equipment.\" At the moment that argument is working pretty well. Some people\nthink this kind of reasoning ranks very close to the dairyman’s argument that he doesn’t\nsell milk, he merely provides bottles.\nAdvertising supported broadcasters hold up the specter that CATV is the easy way to a\nnational pay television system. This, they say, threatens the entire structure of our present\nsystem. Well personnally having studied pretty carefully the FCC writs and requirements\nfor pay TV, I have very serious doubts that it will be profitable at the present time. There\nhas never been a test that made money. And I have even greater doubts that the simple\nattachment of a cash box to a TV set will automatically wither away the present system.\nThe greater question, however, is whether intellectually honest people can accept the\npremise that our status quo has some kind of right to eternal life. You have to remember\nthat the arrival of television itself in the United States completely changed the nature of\nradio and all but wrecked the motion picture business.\nOne broadcasting attorney who has earned our respect has already sounded a warning and I\nmust agree with him. That a relatively free broadcaster is asking for trouble when he begins\nto demand protective regulations coupled with restrictions on his competitors. If there is\none thing certain in your future it is that you have much greater competition in all forms.\nWe talked today about the all channel television receiver bill. That means ultra high\nfrequency will have a more favorable chance to compete.\nAlready we can see the results of the federal aid to educational television and that means\nconstruction of more stations. There are indications in Washington that eventually FM\nradio is going to be separated completely from AM radio and about time. Economic develop¬\nment and social change indicate that we are going to need more stations. The population"
}