{
  "id": "d1017-47",
  "text": "April 2, 1964\nMr. Gary N. Hess\nCoordinator, Instructional Television\nUniversity of California\nSanta Barbara, California\nDear Gary:\nEnclosed is a photocopy of a letter I received last summer\nfrom Vic Hyden. In view of the fact he had been privy to\nearlier correspondence between Ken Winslow and others on the\nWest Coast and me, I believe you can understand why Z didn't\nfeel he expected an answer. In addition, one point in his letter\nbothered me when it came to a consideration of NAEB involvement.\nYou will notice in the next to the last sentence on the first\npage, he says,”.. .we are not interested in junior colleges,\ncolleges, or university activities and/or operations.” I presumed\nfrom this that they were interested in something that would serve\nonly elementary and secondary levels. Apparently I was wrong.\nI certainly had no intention of slighting Hyden and really know\nnothing about him. Z would appreciate it if you would let me\nknow something more about him. I agree that it would be well to\ntry to win him over to our cause. Please let me know in a day or\nso about this — although, at this point, I’m not sure what I will\nsay to him.\nWe have realized that there has been a lack of interest in the\nNAEB in the West, but we have sought to do all we could to remedy\nthis. As 1 may have mentioned to you earlier, we changed our\nBy-Laws several years ago to make it possible for tax supported\ninstitutions in California to belong to the NAEB. At this time,\nthe modification was welcomed, and we felt that this was a big\nstep in the right direction. Bill Harley traveled to the West\nCoast for the Western Radio and Television Conference to show\nNAEB’s interest and to attend the NAEB Region VI meeting. We\nfelt, also, that Dick Lewis* being added to the Board would have\na considerable impact because he is certainly one of the recognized\nleaders on the West Coast, and we believe he will be able to do\nsome excellent missionary work.\nI realize that, at the outset, the Instructional Division will not\nbe able to provide as many obvious services as members and prospec¬\ntive members might hope for. However, the Board of the Instructional"
}