{
  "id": "d1017-49",
  "text": "UNIVERSITY OF CALIFORNIA, SANTA BARBARA\n)\nBERKELEY • DAVIS • IRVINE • LOS A NT. FEES • RIVERSIDE • SAN DIEGO • SAN FRANCISCO\nSANTA BARBARA • SANTA CRUZ\nSANT A BARBARA, CALIFORNIA 93018\nMarch 26, 1964\nMr. Harold E. Hill\nNAEB Headquarters\n1346 Connecticut Ave., N.W.\nWashinaton. D.C. 20036\nDear Harold:\nI have just returned from the West Coast Instructional Television\nConference in Corvallis, Oregon. You'll remember that it’s one of\nthe splinter groups we talked about in Columbia. What I’m going\nto say may not surprise you but it should give you food for thought.\nNAEB is a nasty four-letter word in these parts, podner, and some¬\nthing had better be done to clean it up for the folks down home.\nI went to this conference, among other things, to urge its partici¬\npants to support their national organization. It was not a success¬\nful undertaking. ’’Their national organization\" to them is a group\nof old radio broadcast fuddy-duddys in the Midwest who refuse to\nrecognize that there are more than cowboys and Indians in the West.\nParticularly vocal against the notion was Vic Hayden who wrote to\nyou sometime ago and, he tells me, never received an answer. Vic’s\nis a powerful voice and it did little to improve NAEB’s image at\nthat conference. Harold, the NAEB is in trouble out here and it’s\ngoing to take some hard work, careful planning and some faith to\nbuild up membership here. We made one good step, I think, and that\nis scheduling nevt year’s WCITVC adjacent to ^he Western in Po-Mand.\nThis should give NAEB a chance to show its stuff.\nI think it would be very politic to do a little smooth talking to\nVieHayden with particular emphasis on NAEB’s new Instructional\nDivision and its recognition of the West's increasing importance in\nthe national picture. Don’t tell him I sent youl\nI got the literature you sent well distributed but more needs to be\ndone. One thing, I think it would strengthen the western section\nwith a healthy dose of red corpuscles.\nWe need to move quickly on this and show them the NAEB means busi¬\nness and it earnestly wants to up-date its image from the old insular\nmid-westernism. The time is now.\nya, Coordinator\n'al Television"
}