{
  "id": "d1017-80",
  "text": "ACADEMIC BROADCASTING\nDr, Alburey Castell\nChairman, Department of Philosophy, University of Oregon\n■^Delivered at the Region VI Meeting, Eugene, Oregon, October 17, 1953\nI am to speak to you on Academic Broadcasting. I use that phrase to co¬\nver broadcasting by members of college and university faculties. I have no\nidea how much academic broadcasting there is in this country; but I have the\nstrong conviction, that if it is well done, the more there is of it the better.\nBefore turning your attention to details, I wish to take this chance to\nexpress my lively appreciation for NAEB. Its efforts to put academic broadcast¬\ners in touch with listeners all over the nation are all to the good. For over\nten years now I have been having an affair with the academic microphone; but no\nmatter how sedulously I paid court to the lady, we never got beyond the range\nof the university station. And then along came NAEB, and before I knew it I was\ntalking to listeners in states all over the union. Write-in mail began turning\nup from \"far-away places with strange-sounding names\". If you have mike-fever,\nthere is a thrill in this. So I wish NAEB good luck, green lights, straight¬\naways, bon voyage, happy landing, and anything else it needs to keep it plugging\naway at its job.\nI shall divide what I have to say into two parts. The first part is ad¬\ndressed to college and university administrators and station directors; persons\nwhose business it is to use men, money and materials to a certain end. It is\nimportant that such persons have ideas about academic broadcasting, and that\nthese ideas be out of the right drawer. My point is not that they should have\nthese ideas in order that they may themselves do effective academic broadcast¬\ning. In many cases, the further they stay away from the mike, the happier every¬\none is going to be. My point is that they alone can give academic broadcasting\nthe conditions which make it worthwhile. In this respect they are comparable\nto producers and directors among movie people. To these indispensible \"providers\"\nI would say eight things. If these eight points strike you as trivial or obvi¬\nous, then either you operate in an academic radio paradise, or you are insuffi¬\nciently aware of the importance of what you consider trivial and obvious.\n(1) My first point is this: after the student-body and the football team,\na good academic radio program is a university’s best single public-relations\ninvestment. I would place it in many ways above an extension service. It does\nmore than any other one agency to give reality to the nation of a \"state-wide\ncampus.\" It is there many hours each day. It is there many months each year.\nIt gets into lives and homes with an intimacy which even class-rooms do not al¬\nways generate. I have been flabbergasted to discover, in remote towns and vil¬\nlages, in isolated farms and camps, how persistently and respectvully and grate¬\nfully people maintain contact with their university radio. They wouldn’t want\nit all day long. They wouldn't want only academic broadcasting. But they can\nlearn to trust it for quality, to bring their minds as well as their ears when\nthey tune it in. It is reassuring to realize that there is one station which\ndoesn't want your money, doesn’t want to sell you something, doesn't want to\nmake you laugh or put you in touch with the front page of your newspaper. It is\n* A full report of the meeting, together with a copy of the speech by Dr. Harry\nNewburn, president of the Educational TV and Radio Center, will be distributed\nas soon as it is available."
}