{
  "id": "d1017-93",
  "text": "■5-\nGraydon asks the members: \"Where does the NAEB go from here? Does it\nbecome the professional organization? Does it continue to be a producing or¬\nganization? Should it attempt to become an international association? What\nsort of cooperation should it have with other organizations also interested\nin the education of the people of the United States?\" This certainly was\nthe type of challenge that should have been thrown down to a group gathering\nfrom all over the area to discuss their association. That these individual\ngroups met, discussed, came in with recommendations, indicates how well again\nthe meeting was planned and how good a job Ausmus actually did.\nLetts now go to the points raised. The order in which I present these\nwill probably not be in the order that they were presented at the REGION VI\nMeeting. I am handicapped here inasmuch as I have none of the written mate¬\nrial that you gave to the people who attended. However, I think that I have\nmost of the points, — twelve to be exact, — of the fifteen that were brought\nup. Perhaps I have grouped some of them so that actually all fifteen are rep¬\nresented in the following list.\n1) NAEB NETWORK OPERATIONS, The questions raised here were ones that\nhave been raised for years and more than likely will continue to be raised\nevery time NAEB’ers get together. The perennial fight for more quarter-hour\nprograms, for better editing, for more variety, more drama, more interviews\nand perhaps less straight talk and music. All of these are questions that\nhave no real answer. It goes back to the basic idea that this Network is a\ncooperative venture. As long as it is, and as long as it utilizes programs\nfrom its members, the programs offered on the Network will be no better than\nthe members prepare for home consumption. In many cases they cannot be as\ngood because the home consumption type oft-times has aparticular local flavor,\nthat has no meaning outside the confines of that station*s listening audience."
}