{
  "id": "d1017-98",
  "text": "-10-\nKellogg Grant* At this late date members should know what this is about*\nAdequate material has been distributed and there have been sufficient ques¬\ntions asked and answered at national and regional meetings. I suppose it*s\none of those things that have to be gone over and over, again and again.\nI was intrigued, as I have been in the past, by the proposal from some¬\none that we put the NAEB Network on a cost per program basis. This has long\nappealed to me but I could never see quite how it could be made to work.\nMany people feel that we do not have a large enough potential to make it pos¬\nsible to operate on this basis and still effect the economy of mass duplica¬\ntion and distribution that is necessary* However, this certainly should be\ngiven some stucty', It is questionable that you should pay for all of the pro¬\ngrams whether you use them or not. Some people will condemn me for saying so\nbut we here at WBAA have, I believe, played at least 95 per cent of all the\nprograms ever offered on the NAEB Network. We may not be as discriminating\nas we should, but we feel that these programs add materially to our program\nschedule. Some were not as good as others, but in the main they did enrich\nour program fare.\n8) SHOULD THE NAEB BE AN INTERNATIONAL ASSOCIATION? Your decision that\nwe should continue to cooperate with the broadcasters of other countries and\nstep up our efforts in the Americas and the Far East was most heartening. I\nam glad to know that your group realized that communication is basic to under¬\nstanding and that we have one of the greatest means of communication at our\ndisposal. Our experience this fall with an exchange Fulbrighter from RADIO\nITALIANA has been most satisfying. He has been here since October and plans\nto stay until June. I am sure that he will add to our understanding, not only\nof Italy but of all peoples who come from a different background and have a\ndifferent language from ours. We have had foreign students on our campus for\nyears, — some 300-1*00 of them — but we have never had this close day-by-day"
}