{
  "id": "d1216-1",
  "text": "c\n-2-\nV'NYC DESCRIBES NIGHTTIME NEED\nMr. Siegel pointed to the City Station’s outstanding record of public service,\nduring and since World War II, and made the point that notwithstanding the accepted\nindispensability of WNYC’s nighttime operation in the public interest, present\nafter-sundown operation is dependent on continuous temporary Special Service\nAuthorization from the Federal Communications Commission. The failure of the\nMunicipal Broadcasting System to receive permanent authorization from the FCC to\nremain on the air past nightfall, Mr. Siegel stated, was due to complications\narising from the present clear channel system, and supposed interference of vNYC’s\nsignal with that of WCCO.\nMr. Siegel pointed out that in all the war-time and subsequent night-time operation\nof Fl^YC, no complaint of interference from a listener had been received.\nOKLAHOMA A. & M. REQUESTS PERMISSION TO SEFVE AGRICULTURE\nH. H. Leake, radio director of Oklahoma A. & M, College told the Senate Committee\nhow the FCC had granted a license establishing KOAG as a service to the rural areas\nof Oklahoma to allow the resources of agricultural and market information to be\nbroadcast to all parts of the state, and how clear channel station WHAS in Louis¬\nville had objected, resulting in cancellation of the license, and placing the issue\nin the U.S. Court of Appeals.\nMr. Leake compared radio to printing and pointed out the handicap under which educa¬\ntion would now operate if all the good printing facilities (paper, ink, and cresses)\nhad been reserved for the exclusive use of a few commercial groups, and education\nhad had to be content with what was left. This, he said, was essentially the posi¬\ntion with respect to education and radio facilities.\nN-A-E-B STATES CASE FOR NINE STATIONS\nRichard B. Hull, Ames, Iowa, said that ’’pressure” was exerted against Iowa State\nCollege to testify on behalf of clear channel radio stations.\nHull is radio director of WOI, operated by the college, and president of the Nation¬\nal Association of Education broadcasters (N.A.E.B.). He appeared before the\nsenate commerce committee on behalf of the Johnson bill,\n\"I think the committee should also know that the clear channel group, perhaps exer¬\ncising more optimism than good judgment, through one of its stations suggested that\nIowa State College take a position with respect to the Johnson bill which in view\nof the facts and the previous record it was not possible for the college to assume,”\nHull testified.\n’’From information I received from several other quarters, I would judge the pressure\nwas similar to that experienced at Iowa State.”\n24 Clear Channels\nThe measure introduced by Senator Edwin C. Johnson (Dem,, Colo.) would limit the\npower of standard radio stations to 50,000 watts and eliminate the 24 existing\n1-A clear channels*\nA so-called clear chahnel is reserved exclusively for one station for night-time\nbroadcasting, but is shared by several stations during the day*\nStations with clear channels are seeking to retain them and, in addition, 16 are\nseeking authority to step up power to 750,000 watts. The 16 have grouped together\nin an organization known as the Clear Channel Broadcasting Service (C*C*B.S*),"
}