{
  "id": "d1216-12",
  "text": "-13-\nFEDERAL COMMUNICATIONS COMMISSION\nMarch 22, 1948 (Educational) April 19, 1948\nNEWS--APPLICATIONS--ACTIONS\nNSW TEMPORARY APPLICATION FORMS ORDERED\nEffective March 31, 1948, the FCC has ordered that the present Form 408, Application\nfor Experimental or Special Temporary Authorization, and Form 409, Application for\nRenewal or Extension of Special Temporary, Experimental Authorization, to discontin¬\nue ih favor of a new EC Form 408 which will provide the Commission with all the\nrequired information now provided by the two existing forms.\nThe order says, ’that, effective immediately, FCC Form 408, Application for\nExperimental or Special Temporary Authorization, is adopted and Section 1,324 (c)\nof the Commission Rules and Regulations is amended to read as follows?\n(a) Delete subparagraphs (1) and (2) and substitute therefor the following;\n”1) FCC Form No. 408, Application for Experimental or Special Temporary\nAuthorization (fixed public radio services only) shall be used for\nnew application and for extension or modification of existing authori¬\nzation. ”\n(b) Renumber present subparagraph (3) to read subparagraph (2).’\n******\nAMPLITUDE MODULATION APPLICATIONS\n850 KC - Hours of Operation\nWRUF-University of Florida. Gainesville. Fla.- Modification.of construction permit\n(B3-P-4682, which authorized change in hours of operation, installation of new\ntransmitter and directional antenna for night use) to make changes in directional\nantenna system and change transmitter location from near Gainesville, Fla., to 0%1\nmile south of Highway 14, west of Gainesville, Fla,\n******\nAPPLICATIONS (FREQUENCY MODULATION) COLLEGE. UNIVERSITY. AND INSTITUTIONAL\nModification Construction Permit\nWLSU-Board of Supervisors of the Louisiana State University and Agricultural., and\nMechanical College. Baton Rouge. La. - Modification of construction permit\n(B3-FED-53, as modified) which authorized a new noncommercial educational FM\nbroadcast station, for extension of completion date.\nApplication Accepted for Filing\nWHA-FM-State of Wisconsin State Radio Council. Madison, Wise.- Construction permit\nfor non-commercial educational broadcast station to change frequency from 91.5 me.\nto 88.7 me."
}