{
  "id": "d1216-14",
  "text": "-15-\nACTIONS (AMPLITUDE AND MODULATION) COLLEGE, UNIVERSITY, AND INSTITUTIONAL\n900 KC - New CP\nH.QPthwestern Theological Seminary & Bible Training School, Minneapolist Minn.-\nGranted petition to remove from hearing docket and granted application for new\nstandard station to operate on 900 kc., 1 KW, daytime only, conditions. (BP-5273)\nACTIONS (FREQUENCY MODULATION) COLLEGE AMD UNIVERSITY\nConditional Grant\nNorthwestern Theological Seminary & Bible Training School. Minneapolis. Minn,-\nGranted petition to remove from hearing docket and authorized conditional grant for\nClass B FM station, proposed assignment Channel 290 (105.9 me.). (BPH-970)\nConditional Grant\n.Florida. Gainesville. Fla. - Class B; proposed Channel No. 281, 104.1\nme., subject to further review and approval of engineering details. (BPH-1415)•\nGranted New Station CP\nYeterans_Vgcational School, Troy. N.Y.- Granted CP for a new station; Channel #211\n(90.1 me.); minus 400 watts; antenna; minus 240 feet. (BPED-92).\nGranted License\nKUSC-University of Southern California. Los Angeles. Calif.- Granted license covering\nnew non-commercial FM educational broadcast station. (BLED-15)\nGranted License\nWDTR-3oard of Education of the City of Detroit, Detroit. Mich. - Granted license\ncovering new non-commercial FM educational broadcast station. (BPED-21).\nTELEVISION APPLICATIONS\nApplications Accepted for Filing\nNE>Evangelical Lutheran Synod of Missouri. Ohio, and Other States. Clayton (P.0. 801\nPg..Mun Avenue, Clayton 5. Mo.) - Construction permit for a new commercial television\nbroadcast station to be operated on Channel #2, 54-60 me., ERP of visual 0.98 KV,\nAural 0.639 KFi and unlimited hours of operation,\n*•**■**■*\nMAYFLONER TESTIMONY ORDER IS ANNOUNCED\nOrder of testimony for the resumed ’’Mayflower rule” hearing, in the matter of editor-\nialization by broadcast licensees, which reconvened April 19, 1948 before the FGC.\nNAB witnesses will lead off in the testimony, beginning with NAB President Justin\nMiller, followed by Executive Vice President A, D. Lillard, Jr., General Counsel\nDon Petty, Director of Public Relations Robprb K. Richards, Program Department\nDirector Harold Fair, apd Special Services Director Arthur Stringer."
}