{
  "id": "d1216-16",
  "text": "-17-\nN-A-E-B STATiON REPORT\nThe Syracuse Experiment\nReported by Edward Jones, Radio Workshop, Syracuse University*\nA year-long experiment with low-power, low-cost FM broadcasting at Syracuse\nUniversity promises to open the door to broadcasting for colleges and universities.\nWith the development by the General Electric Company of a 2g--watt FM transmitter,\nespecially designed for use on the 20 FCC-allotted FM educational channels, it\nwill be possible for educational institutions to begin on a modest scale and\naugment power and facilities as budgetspermit*.\nAfter a year of successful experimental programming, the University has.applied\nfor a regular FM license to broadcast as an educational station. Decision of\nthe FCC to grant Syracuse their FM license may determine, the^fubur^^of^J-pg^poyjer\nbroaderst.ing in the FM educational channels.\nBeginnings\nOperation of WAER (then WHIV) began on an experimental license granted to the GE\nCompany in March.1947. The transmitter, about the size of a large console receiver,\nwas installed in a corner of one of the small control rooms of the Radio T, orkshop.\nThis unit cost about $2000 and is the ‘’heart\" of any future additions to equipment.\nBy adding another unit to this \"heart\" at a cost of about <„3000, power may be in¬\ncreased from 2k watts to 250 watts. A 20-foot pole supports the doughnut shaped\nantenna located on the roof of the main library. From the regular facilities of\nthe Workshop, five studios and equipment were on hand at the beginning of the\nexperiment.\nCoverage\nTW naming estimates of the signal of the watt.,ti^pn^er^ej^EEi^p!^g^\na q-milft radius from campus. This signal encompasses a p.opulat^qn^3bq^^245^i)^j\nor roughly, the City of Syracuse. Primary coverage is about _a f-mile radius iron\ncampus.\nOriginal estimates of the signal radius have since proved to be surprisingly short.\nOne report indicated that WAER could be received with good volume and quality 20\nmiles from campus. This is the greatest distance yet reported, although requests,\nfof ' program schedules come from as far as 6 or 7 miles. These results are parti¬\ncularly surprising since the antenna only sends out one watt of the 2-g--watts\npower, the other l-g- being lost on the line from the transmitter to the antenna.\n\"Campus Community\" Audience\nIt is to the 10.000 persons in the primary area, a half^i^le_rad^s_frpm_campus,\nthat 'WAER directs most of its programs. With this campus community in mind, plus\na secondary audience comprising the City of Syracuse, it was decided to provide\nservice whenever possible, which is not or cannot be provided by existing commer¬\ncial AM or FM stations in the city.\nOverall Policy\n1. To widen the educational service of the University by presenting lectures,\ndiscussions, forums, concerts, and special events occurring on the campus\nor under University supervision. . . „\n2. To experiment in the development of an \"all-cultural radio program_service\nfor Central New York,"
}