{
  "id": "d1216-2",
  "text": "-3-\nDurr called attention to the fact that man3r educational agencies and colleges\nhave been dilatory about applying for their rightful share of the 20 educational\nchannels reserved for their use on the PM \"band. He warned that history may re¬\npeat the sorry cycle of AM licensing when educators lacked vision, or persist¬\nence or budget to secure and hold onto desirable frequencies, and he pointed\nout the need for a \"conscience in American radio\" as the manifest duty of the\ngreat of right-thinking educators.\nDurr also called attention to the rising tide of prejudice in this country,\nthe \"witch hunts,\" the suspicions, the real onslaughts on free speech, press,\nand radio which had begun to make themselves evident,, He pointed out that the\nFBI was furnishing the Federal Communications Commission with \"unsolicited\nreports on individuals connected with radio\". He told the audience that if he\ncould tell them of the kinds of things contained in many of these reports, \"you\nwould dismiss the information as baseless gossip.\"\nChlAEl CHAHFBL COMMITTEE DIRECTED TO PROCFED UITH UASHIHGTOH HEARINGS\nThe H-A-E-B passed a formal resolution empowering the organization’s Clear\nChannel Committee (Richard B. Hull (UOl) Chairman, William Morgan (TSAD) , and\nSeymour Siegal (UHYC))to proceed with plans for delivering testimony before the\nFederal Communications Commission, October 29 through 31, in the final stages of\nthe Clear Channel Hearings,\nAn official statement expressing the views of the Rational Association of\nBroadcasters on clear channel broadcasting was approved. It pointed out that\npresent AM clear channel allocations prevent full-time operation of 9 educational\nstations in the U.S. and asked that these and other educational AM stations be\nallowed to operate from at least 6:00 a.m, until 10:00 p.m. daily to better\nserve listeners.\nThe R-A-EtB stations involved included ICUOM (University of Minnesota), UCAL\n(St, Olaf College), MAD (University of Oklahoma), HOAG- (Oklahoma A, & M.\nCollege), UOSU (Ohio State University), UKAR (Michigan State College), UOI (Iowa\nState College), UFYC (City of Hew York), UHCU (Cornell University).\nMarcus Cohn of the legal firm of Cohn & Marks, ’.Washington, D.C, was approved\nas official spokesman and counsel for the H-A-E-B, and Morris ITovik, Executive\nSecretary was directed to make the testimonial statement before the FCC,\nCopies of the official statement have been sent to all H-A-E-B officers\nand to members of the Executive Committee. (Any member desiring a copy should\naddress his request to Richard B. Hull, Station UOI, Ames, Iowa),\nSCHOOL BROADCAST COFFSREFCE MEETS IF CHICAGO\nThe growing importance of educational radio was given further impetus by\nthe 11th Annual meeting of the School Broadcast Conference under guidance of\nGeorge Jennings, director of Chicago Board of Education Radio Council, A huge\nturnout of teachers, educational directors from commercial stations and networks\nwas recorded, Meetings were held October 27,28, 29 in the Hotel Sheraton.\nDiscussions dealt with how educational institutions can help create more\nintelligent listeners by teaching an appreciation of good radio, and with ways\nand means to use radio as an educational tool,\nClifford J. Durr, FCC Commissioner, was voted the \"Educational Radio\nMan-of-the Year\"by the School Broadcast Conference."
}