{
  "id": "d1216-23",
  "text": "-2-\nflnally It is Durr who has not hesitated to state his position publicly\nand in lucid terms, stumping the country from one end to the other to preach the\ngospel of democracy in radio.\n\"To the Great Dissenter of the present FCC, the guardsman of ,.tfae _Amegican people*8\nstake in the air they nominally own* and the most show-management-mlnded Commissioner\non the FCC, VARIETY extends its esteem and its 1946 Award.\"\nFrom THE COOPERATIVE CONSUMER - March 31, 1946\n\"Another fact that is e&nsing much concern among farm and cooperative groups\nin Washington is the fact that the terra of Clifford J. Durr on the FCC Is due to\nexpire June 30, The president has not yet sent Durrq s name to the senate for re¬\nappointment and powerful forces are at work backstage to convince him to appoint a\nman who could be controlled by the radio industry,\n\"Durr has been the constant champion of the farmer and farm cooperatives. Moreover,\nhe has helped the land-grant college stations retain their licenses and now asks that\nthey have more time on the air,\n\"Even if nominated by the president, Durr may have difficulty getting confirmed in\nthe senate, A few months ago Durr rapped the knuckles of the FBI, when it persisted\nr' in submitting uncalled for data on applicants for radio stations. Most of the \"tips\"\nwere in the nature of such facts that \"Mr. X who has applied for a radio station\nrecently visited New York City where he had lunch in the Astor hotel at the 3ame\ntime a well-known liberal was registered in room 1104- It is not known if they\ntalked together but it is possible. The liberal, whose name we do not wish to give\nyou now, has a second cousin who attended Columbia University and was once seen at\na forum where Norman Thomas spoke,\" This, I hasten to add, is not a direct quotation\nfrom government records. It merely indicates the kind of thing the FCC has received-\n\"In normal times such drivel would be laughed off, but today Washington is caught\nIn a growing war hysteria. Durr, who Is a native of Alabama, where he practiced\ncorporation law before coming to tashington, may be sacrificed on the altar of\nreaction. If he is not reappointed and confirmed it will be a loss from which rural\nradio may never recover.\""
}