{
  "id": "d1216-3",
  "text": "-4-\nN-A-E-B V ILL HOLD SPECIAL MEETING AT INSTITUTE FOR EDUCATION BY RADIO\nThe annual mid-year meeting of the National Association of Educational Broadcast¬\ners will be held coincidentally with the Ohio Institute for Education by Radio in\nColumbus, April 30 to May 3. An unusually large attendance of members may be\nexpected, from all reports reaching central N-A-E-B headquarters. The Deshler-\nr allick Hotel will again be headquarters for the Institute and for all N-A-E-B\nmeetings.\nBusiness Meeting\nN-A-E-B will hold its mid-year business meeting on Friday. April 30 at 2:00 p.m.\nin Room 337 of the Deshler-Nallick Hotel._Every member is invited to be present,\nand all directors of regions are expected to be on hand.\nThere will be a crowded business agenda to discuss a host of problems centering\naround organization and membership problems. The overseas scholarship exchange\nwill be discussed and reported on; districts will bring up special business matters.\nOther topics will include; regional and national locations for N-A-E-B official\noffices, program and transcription exchanges, a national FM N-A-E-B network.\nvarious policy issues, constitutional changes, conventions sites, etc.\nANNUAL LUNCHEON\ni\nIN-A-E-B will hold its mid-year luncheon in Parlors A, B, C of the Deshler-Wallick ;\nHotel on Saturday, May 1 at 11s50 a.m, A number of prominent radio guests are !\nlexpected. The luncheon meeting will be informal without a prescribed program,\n■but a general review of the yearfs activities by the officers will be included in .\n•the discussion. j\nJOINTLY SPONSORED N-A-E-B & A-E-F\nThe closing general session in the Main Ballroom of the Deshler-Wallick Hotel on\nMonday, May 3 at 2s00 p.m. will feature a program under the sponsorship of the\nNational Association of Educational Broadcasters and the Association for Education\nby Radio.\nPresiding; William B. Levenson, Cleveland Public Schools and President, Associ¬\nation for Education by Radio,\nTopic; \"Serious Radio in America: The Role of Organized Education and the\nCitizen\"\nAddress: Dr. Peter Odegaard, President, Reed College and former Assistant\nSecretary of the U. Sf Treasury,\nPanel Discussion: \"Rays and Means to Implement Serious Radio\"\nPanel Leader: Harold B. McCarty, Director Station rHA and WHA-FM, University\nof Wisconsin.\nParticipants: Edwin F. Helman, Director of Radio, Cleveland Board of Education,\nCleveland\nJames Macandrew, Coordinator of Broadcasting, Station WNYE, New\nYork Board of Education\nHarry J. Skornia, Director of Radio, Indiana University,Bloomington\nParker R'heatley, Director, Lowell Institute Cooperative Broadcastir\nCouncil, Boston\nSeymour N, Siegel, Director, Municipal Broadcasting System, N.Y.C.\nWilliam H. Sener, Director, Station KUSC, Univ. of So. Calif. Los\nAngeles."
}