{
  "id": "d1216-5",
  "text": "DOROTHY LERIS JOINS UN RADIO DIVISION\nMrs. Dorothy Lewis on Monday (29) began work as Coordinator of Women’s Broadcasts\nfor the United Nations Radio Division, it was announced last week by Benjamin\nV. Cohen, UN assistant Secretary-general in charge of the Department of ^ublic\nInformation.\nMrs. Lewis will be remembered as founder of the Association of Women Broadcasters\nof the NAB, and as NAB Coordinator of Listener Activity. In March, 1947, she\ndeveloped the UN Bulletin for Women Broadcasters, 2,000 copies of which are dis¬\ntributed monthly around the world. She attended the San Francisco and Quebec\nconferences.\nWGHF-Fii JOINS RURAL RADIO NETWORK\nAffiliation of WGHF-FM New York with the Rural Radio Network, Inc., Ithaca, N.Y,\nwas announced April 1 by W. G. H. Finch, the station’s president. rGHF will\noriginate facsimile programs for the other stations in the network starting in\nJune. The Rural Network is scheduled to begin operations early next month with 3\nof its 6 projected FM outlets.\nBMB STUDY NO. 1 NOW AVAILABLE AT H,.IF PRICE\nThe complete Broadcast Measurement Bureau’s Study No. 1 on station and network\naudience reports is now available at t32.50. Separate reports including the\nBMB Area Reports are now C>17.50 and the BMB Network Report is priced at ^12.50\nAccording to EMB’s executive committee, the price reductions were made because\nof ’’the fact that half the active life of the reports has transpired and that\nthe Study No. 1 reports will be superseded in approximately 18 months by reports\ncovering the 1949 nationwide survey.”\n*** ***\nRADIO BUILDING PROGRAM AT ST. OLAF COLLEGE\nN-A-E-B member station T\"CAL (St Olaf College, Northfield, Minnesota) has been the\nscene of busy and hectic days the last several months. A double-barreled building\nprogram which includes construction of a new Ali-FM transmitter building, selection\nof FM equipment, filing of FM application, construction of new studios, installa¬\ntion of a 10-KW AM transmitter, and numerous field and measurement tests have\nadded up more than several 75 hour work weeks.\nSt. Olaf College, Augustana Lutheran Synod, operates one of the most modern and\neffective religious radio centers in the United States. Under the direction of\nMilford Jensen and David Johnson, WCAL currently operating with 5000 watts on 770\nkilocycles, serves a large area in Minnesota, Iowa, and portionsof the Dakotas.\nWCAL maintains studios on the St. Olaf Campus and remote studios in Minneapolis,\nPrograms include a generous share of foreign language offerings, and music by the\nworld famous St. Olaf choir.\nN-A-E-B WILL HOLD ITS MID-YEAR BUSINESS MEETING AND LUNCHEON, FRIDAY AND\nSATURDAY IN CONJUNCTION RITH THE OHIO INSTITUTE FOR EDUCATION BY RADIO—\nApril 30 - May 3"
}