{
  "id": "d1216-6",
  "text": "TV RAIVER EXTENDED\n-7-\nWaiver of I'CC’s rule requiring minimum television operation of 28 hours per week\nand two hours per day was further extended last week by the Commission to June 30.\nThis extension was made pending study of a petition by Television Broadcasters\nAssociation to amend the rule to provide for gradual increase in the operating\ntime requirements over a period of years.\nCORNELL COLLEGE TIES UP THEORY AND PRACTICE\nRadio teaching, production and programming at Cornell College (N-A-E-B member in\nMt. Vernon, Iowa) have entered an auspicious beginning at this liberal arts college.\nSupplementing radio course work is a three-way radio activity plan which includes:\n(1) sending news items and background material to radio station news editors,\n(2) presenting programs of serious music over commercial station WMT, using dis¬\ncussion techniques over commercial station KCRG, and lighter types of programs of\nKXEL, (3).operation of campus low-power station KRNL, paralleling the same three-\nway activity on the off-campus scale.\n500th AMERICA’S TOWN MEETING OF THE AIR\nAMERICA*S TOWN MEETING OF THE AIR marked it’s 500th hour on the air March 16. Cele¬\nbrating this special occasion the same topic assigned the first program was again\ndiscussed, \"Which Way America— Fascism, Communism, Socialism or Democracy.\" Winner\nof 28 awards and citations, TOWN MEETING also claims to be the first radio forum to\nbe televised.\nST. JOSEPH COLLEGE MAKES AWARD\nEadio’s Fibber McGee and Molly—James and Marian Jordan in private life—received\nhonorary doctor of laws degrees tonight for \"all-round good taste and family\nacceptability\" in entertainment. The degrees were awarded at St. Joseph’s College\nin R.ensselaer, Indiana, which conducts a radio acceptance poll to rate radio shows\non the basis of taste and moral tone. The Fibber McGee and Molly show holds\nthe top spot in the poll.\nThe Reverend^, alter Pax, Dean of St. Joseph’s, read the citation honoring the famous\nradio team. It was a double celebration for \"Molly\" for today was her birthday,\nYOUTH CRIME FROM I AD10 SAYS COUNCIL\nThe.National Council of Juvenile Court judges has decided that poorly controlled\nradio broadcasts are one of the greatest causes of crime by youngsters. That state¬\nment came in a resolution adopted by some 155 judges at the close of their annual\nmeeting in Atlantic City, »\nHfte resolution.charged that many radio broadcasts harm the youth of America by\njguch_emphasis on crime and violence.\" \"it said that story serials and\nggug.lL episodes convey lasting and harmful ideas and impressions\" to the mines of\nchildren. -\nHowever, the judges praised the Federal Communications Commission for the consider¬\nation it is giving to a stricter control of such broadcasts. The council also\nadopted a resolution asking for uniform marriage and divorce laws by all states.\nBroken homes were cited as another major cause of juvenile delinquency."
}