{
  "id": "d1256-0",
  "text": "HA£.R N£WS urn l\nOffice of Executive Secretary-\nUniversity of Illinois\nUrbana, Illinois\nApril 1, 1938\nPLAN ON COLUMBUS MEETING\nPresident Carl Menzer says the NAEB will hold a meeting in connection with the\nNinth Institute for Education by Radio, held annually by Ohio State University,\nMay 2-4. Already we have word from a number of members who have expressed their\nintentions of being in Columbus.\nKENTUCKY HILLS ARE CALLING\nIncluded with the packet material is a complete announcement regarding the radio\nmeeting v/hich Elmer Sulzer is shouting about, so may we suggest you read it.\nULTRA-HIGH FREQUENCIES URGED\nHow many NAEB members are planning to apply for one of these ultra-high frequencies\nwhich the Commission has recently set aside for exclusive use of educational broad¬\ncasters? There is little doubt that some may be overlooking points worthy of con¬\nsideration. At any rate, here is the viewpoint of one of the Commissioners.\nH<9 says that much more oral broadcasting is certain to be done on the ultra-high\nfrequencies. Furthermore, he believes that receiving sets are now carrying about\neverything that they can include in one receiving set when they cover the full\nrange of frequencies. When television comes and they try to combine that and orai-\nbroadcasting in one set, some of the oral frequencies will be dropped. He predicts\nthat many sets will include the television bands and only high frequency oral bands\nIf this is the case, we shall one day have many sets which cannot receive broad¬\ncast from what is now our regular broadcast band. This Commissioner predicts that\nit will some day be possible to give state and national coverage by a combination\nof high frequency stations.\nA prominent radio attorney also feels that educational institutions should go into\nthis field of broadcasting because this is where the broadcast band is going to be\nin the future. He believes that if educational stations do not take advantage of\nthis opportunity they are going to be in the same position as they are today with\nrespect to the possibility of obtaining adequate broadcast facilities.\nNow don’t you think it would be worthwhile for all of us to at least consider these\nultra-high frequencies and perhaps do some experimentation with them?\nNO RADIO TAX AT THIS SESSION OF CONGRESS\nWe have mentioned this proposal of Congressman Boylan to tax radio stations on a\nwattage basis. Now we can assure you that there is no reason for concern on the\npart of any NAEB member. The bill, as proposed by Congressman Boylan in the House,\nspecifically exempts educational broadcasting stations. However, Chairman McNinch\nhas indicated that he would look favorably upon an income from stations sufficient\nto pay for the operations of the Commission. It is not likely that anything will\nhappen at this session of Congress, but it will be well for members to keep an eye\nopen for what may develop later."
}