{
  "id": "d503-1",
  "text": "-2-\n§MMm, m ”1 iwa that the present service neing altered by MET is more\nthan sufficient to serve the present needs of affiliated ETV stations. 2 do not feel that\nthe MB should establish and maintain a programming and production aspect of operations\nthat in any way would lead to a dilution of efforts or drain off funds that may, in the future,\nbe made available to potential underwriters for NtXftC programming\nK» - JWffPK-TV - \"WFFk is not able at the present time to go beyond our affiliation\ncost involved hi NET membership for programming. So far NET has supplied us with\nsatisfactory programming in sufficient quantity, quality and variety /*\nbee C . Frlschknechi:.wjty&B \"There is already too much confusion in this country concerning\nthe image of educational television. This move can only serve to deepen this confusion.\nThe sources of financial support for our programming efforts are not inexhaustible. The\nestablishment of a second service in competition with the existing one will, in my opinion,\ndo more harm than good. Finally, a wide range of data on financial aspects and production\nproblems is already m hand at NEXRC.\"\nRoy. Barthold KUHI - \"It was appropriate to declare us a professional oriented organisation\nbut it was not particularly necessary, because we already had become that. This production\npioposal does not seem consistent with the role NAEB has so carefully defined for itself.\"\n\"There can be only one long range purpose of the proposed project and that is head-on\ncompetition with NETRC for production money and for affiliations\"NAEB might go out\nin a new suit and snac; a grant for a spectacuia. series. You would, however, be trading\non what the stations and NETRC have established, and you would certainly be confusing\nprospective grantors for Center production\nMartin... F. Busch..KU,BO ~*1i) My Program Supervisor for radio and l have experienced increasing\nconcern over the decline in number as well as variety of recent offerings of the NAEB Radio\nNetwork. Where at one time KUSD Radio was able to till all of ita non-Uve time with\nofferings from the Network, we now find ourselves depending quite heavily cm BFA, SBC, and\nCSC to round out our daily schedule. For this reason, it would seem more appropriate to\nstrengthen and bolster this important service rather than divert effort and money to ETV.\n(2) In view of the fact that most stations now provide about one-sixth of the cost of NETRC\nprograms, the balance of the cost being provided by foundation or underwriter support, it\ndoesn’t seem that the stations can afford another service♦\"\n\"However, should the NAEB divert its effort toward these projects, 1 would give it my full\nsupport, realising that It is a production experiment and that NAEB is not committed to\nanything beyond that at the moment.\"\nOtto F. dchiaak WMVS- \"WMVS feels that the matter of NAEB entering into such contracts\nfor ETV program production needs considerable research and study. We do not feei that\nthere is sufficient need indicated at this time for such service by NAEB.\"\n\"...the stations cannot afford to underwrite another jprogram source, and believe such\nwork would create a disservice to our present network*\""
}