{
  "id": "d503-23",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue , N .W .\nWashington, D.C.\nTO: ETV Stations\nFROM: R. B. Hull, Chr., NAEB Board; R.D. Hurlbert, Chr. TV Board;\nW. G. Harley, Pres.\nRE: NAEB Experimental TV Production\nDATE: June 12.. 1962\nIt may be true that nobody wanis to hear both sides of an argument except\nthe lady next door. However, some points have been raised regarding the action\nof the NAEB Board that suggest the need for clarification.\n1. The action of the full NAEB Board should not be interpreted as overriding\nthe TV Board in this matter.\na. The TV Board met in advance of the full Board and voted for this motion:\n“That the NAEB President, on an experimental basis for a two-year\nperiod, be empowered to enter into contracts for package productions\nof ETV programsThis was approved with an amendment that the\nrecommendation be submitted to a vote of the TV active members for\ntheir majority approval.\nb. The full Board substituted and passed this motion: “The President of\nthe NAEB is authorized to contract for the package production of two\neducational television projects on an experimental basis. This does\nnot contemplate the setting up of any regular system of distribution\nand production. It does contemplate that the production in general\nwould be subcontracted to NAEB members.\"\nOn the new motion-considerably more restrictive than the original-\nthe majority of the TV Board voted with the other members of the full\nBoard.\n2. Authorization to conduct an experiment to produce two packaged program\nseries is an expansion of existing NAEB activities rather than “a major alteration\nof NAEB policy.\" NAEB has been producing programs for years, via contracts to\nmembers in the grants-in-aid program, and directly, (Jeffersonian Heritage, People\nUnder Communism, Ways of Mankind, Washington Report, Washington Special, etc.).\nThis will be the first time the Association has produced television programs, but a\nmodest trial run to test the value of such an activity is not the same as “a deter¬\nmination by NAEB to engage in television production.\" Whether such a course\nshould be followed as a policy is what the test is designed to determine, Such"
}