{
  "id": "d503-24",
  "text": "determination will be made after the test results are in. If the results are\nnegative, that’s the end of it. If the results indicate such an activity is needed\nand is feasible, a decision will need to be made at that time as to NAEB’s course.\nThis is clearly an experiment to provide data for subsequent judgment; no policy\nhas yet been established in this matter.\n3 . The action of the full Board was not * ‘undemocratic“cavalieror\n“capricious.*' NAEB is a membership-based association organized on democratic\nlines with the membership vesting policy determination in elected representatives\nwho are empowered to act in its behalf. While the matter of television program\nproduction (instructional and general) may be of primary concern to ETV stations,\nit is not without importance and concern to other segments of the membership:\noperators of TV closed-circuit installations (an area that may well grow more\nrapidly than all other aspects of TV) and production centers, teachers and educations\nadministrators, and all users or potential users of educational film and video tape\nmaterials. Consequently, since this matter has relevance to a greater portion of\nthe membership than only ETV stations, it was appropriate for the full Board to act\nupon this matter in its role of representing the entire membership. Incidentally,\nthough they are radio directors; Miles, Browne, Press, and Paulu are all heavily\ninvolved in ETV activities and are at least equally concerned with its development\nand welfare as they are with educational radio’s.\n4. Although this is not a matter of concern in connection with only two\nexperimental series, questions have been raised as to whether, if NAEB should\nembark upon a regular development of program production, it would not be com¬\npetitive with NETRC and dilute NETRC’s efforts by reducing the availability of\noutside underwriting.\nThis does not necessarily follow since (1) some donors, because of conflict\nof interest, would not support NETRC production in any case or would not be\ninterested in the kinds of programs NET required for its schedule. Much of the\nproduction might well be for use abroad—particularly in newly-evolving countries —\nwhich would attract different support than that which would underwrite NET\nprograms, (2) such a service could be supplementary or complimentary, providing\nfor needs not adequately served by present efforts."
}