{
  "id": "d503-27",
  "text": "Bill: John sent me a copy of your letter of June 11, to him, and\nasked me about the differences between what J had told him and your\nreply# I'm not trying to carry on a feud, but couldn't duck responding to\nhim*\nWe»ve had a fine time the past several days with the Miles, and Lenny Mark\nwill be out this evening for dinner* Wish you and Jewel were here, too* /\nJuly 2, 1962\nJohn Crabbe\nStation KVIE\nSacramento, Calif*\nDear John*\nI suppose when one gets into the middle of an argument such as we\nseem to have going on over NAEB entry into TV programming, there\nis no such thing as \"facts* or \"truths? but only people's impress¬\nions or interpretations of what is happening. I expect this, in\npart, explains the differences between Harley's Interpretation of\nthe situation and mine*\nI feel that the move approved by the full board has given John\nSchwarzwalder the vie ory he has been seeking over the Center, by\ngetting NAEB into competition with them — a move he has been\nfighting for, for some long time, and wfebh I have opposed vigorously*\nI see no practical difference between two productions and two years\nof producing progra ms* The commitment has been made*\nAs to the vot< Jf the TV Board — the difference hinged on one vote —\nthat of John Dunn, who switched* The TV Board voted 4 to 1, with the\nChairman, Huriburt not voting, to refer the matter to a vote of the\nTV station >rs* When the TV members voted as part of the entire\nboard, Huriburt voted with Sohwarswalder, as he has always done: Hull,\nas Chairman of the whole board did not vote, and Dunn switched his\nvote. The argument to override the TV Board was carried on essentially\nby radio board members*\nI don't understand Harley's belief that 4 radio board members have an\nequal interest in TV with the TV Board members, for there is not one\nwho is involved in Ceter operation or is himself involved with TV station\noperation at his own institution.\nThis is, to me, a continuation of the fight that has been going on for so\nlong by NAEB, which lost control of TV to NETRC and is trying to get it\nback*\nX do not agree that the closed circuit people have any real concern in\nthis matter, for they are not looking to outsiders for programming, as\nare the broadcast facilities, who do programming for general adult\naudiences* The closed circuit people are largely instructional facilities\nand create their own programs*"
}