{
  "id": "d503-34",
  "text": "MEMORANDUM\nTO: Managers of ETV Stations and Closed-circuit Systems\nFROM: William G . Harley\nRE: Experimental TV Production\nDATE: May 25 , 1962\nNAEB has several times been approached by groups interested in under¬\nwriting TV programs of an educational nature. At the Board Meeting in Columbus,\nit was pointed out that stations have indicated a need for more distinctive ETV\nprograms than are currently available from regular sources and that improvement\nin the quality and quantity of television program materials for both broadcast and\nclosed-circuit use is an appropriate concern of NAEB; accordingly, it might\ninvestigate the possibilities of limited involvement in television program\nproduction.\nThe NAEB Board passed this motion::\n“The President of the NAEB is authorized to contract for the package\nproduction of two educational television series on an experimental\nbasis. This does not contemplate the setting up of any regular\nsystem of distribution and production. It does contemplate that the\nproduction in general would be subcontracted to NAEB members\nThis action was unanimous except for votes of two Television Directors,\nwho felt that insufficient direction had been registered to warrant such a move\nwithout first polling the ETV stations. The other members of the Board felt that\nthey constituted sufficient representation of the membership to act in its behalf\nwithout resorting to a poll, particularly since this was authorization for only a\nlimited experiment and any general policy question involved could wait upon\nthe results of this test and then be subject to thorough review and decision by\nthe convention.\nTo assist me in carrying out the directive of the Board, I am interested in\nobtaining comments and suggestions from the membership directly concerned\nwith the possible uses of television program materials.\nAs a limited experiment designed to gather a wide range of data on finan¬\ncial aspects, production problems, and general feasibility of the project, as I\nconceive it, might well be concerned with two kinds of undertaking:"
}