{
  "id": "d503-36",
  "text": "COMMENTS RE NAEE VIDEO PRODUCTION PROJECT\nAGAINST THE PROTECT (17 Replies)\nLoien Stone - 1. Wisdom of creating 4'through NAEB, anoihe television program service\ncompetitive with NETRC , 2 . Question whether ‘ ‘the stations can afford another service,\no. that NAEB can finance a service of any consequence from other than station funds/*\n3 **To the extent that NAEB will seek or accept underwriting financing of programs they\nare confusing the national image of educational television and creating a competition for\nthe present program service which may decrease its effectiveness by far more than the value\nof new programs to be produced by or for NAEB/*\nJohn W . Taylor WTXW - Agrees with Stone.\nThomas Fetry - “For years, the individual stations, working together with NET, have\nbeen complaining and are finally doing something about the matter of quality productions*\nIt seems evident from the productions that we have received in the last year and a half and\nfrom what we were permitted to preview from next year’s schedule, that NET is weil on its\nway in providing a truly outstanding program service which very definitely responds to the\nneeds of the ETV stations I have screened innumerable kinescopes and tapes which several\n“independent** EI:V stations have either produced for their own distribution or acquired\nfrom other sources and, in ail honesty, 1 have found little that was useful or could approach\nthe newer NET products in quality/*\n“It seems obvious that a diversion of funds, such as NAEB proposal would seem to imply,\ncould well be suicidal at this critical period,**\nHoward L, lohnson KRMA-TV - “It does appear to be in disagreement with some of the\nstatements made at an earlier date regarding the activities of NAEB as they relate to the\nactivities of NETRC.\n“1 sincerely hope that we do not enter into future conflicts regarding the designated\nresponsibilities of these two organizations inasmuch as both have a very important role\nto play in educational broadcasting /*\nJohn C, Crabbe KVIE - “I urge that the vested interests in NAEB invite an objective\nanalysis of the Association to determine whether its pruposes are to encourage a strong\neducational broadcasting system in cooperation with all other agencies in the field, or\nwhether those purposes aie to preserve NAEB in competition with many other influences\nthat have come on the scene / *\nKenneth A, Christiansen WUfT-TV- “I think this is the kind of activity which diverts NAEB\nfrom its role as a professional organization* It seems to me much more realistic to think\nof staff time being devoted to interesting foundations or organizations in giving funds for\nestablishing training programs than for the unreality of funds for production d programs\nthat have no real guarantee of distribution. I am convinced that this production activity\non behalf of NAEB diverts the Image of National Educational Television. I think this activity\nproperly rests with the Center.*’"
}