{
  "id": "d503-37",
  "text": "-3\nHempen - KNME-TV - \"If this experimental production is vital to NAEB, I am of the\nopinion that the television members stations should be contacted as to the desirability\nof such an action because the program needs of a non-commercial station can ..be\nbest reflected by the persons who are on the local scene. I, at that time was opposed\nto the idea, and still am opposed to it.”\nBurrell F , Hansen - Utah State - ”Though the memo was very carefully phrased to emphasize\nthe ‘experimenter nature of such an undertaking there does appear to lie implicit in it\nsomewhere the idea that a competing ETV Network is being considered. There are many\ncriticisms—some justified, I am sure—of Net’s operation. However, our educational\nresources, especially financial ones are probably not yet so numerous that competitive\nTV programming can be supported. If there are limitations of Quality in present programs\nit is not apparent to me how a dividing d our resources into competitive programming would\ncorrect the problem. The 'closed corporation' aspects of NET'S organization likewise is\nbeing criticized—I too, protest—but how will this 'experiment' alter that?”\n“I can see virtue in an 'experiment*. From this memoranda, however, it is not clear to me\nwhat the experiment is really supposed to test. I'd like to know more about the hypotheses\nupon which it is based ans which it will test. Too, 1 should appreciate a more explicit\nexpression of the present problems, and of the real objective of the experiment.”\n\"My preference generally, however, is for cooperation and combination rather than compe- ^\ntition and diversification when resources are so hard to come by as they are in education.\nI, Michael Collins WNED-TV - Discusses only by-passing of TV membership. \"As Mr.\nGunn mentioned, if the above is not brought to NAEB members for consideration, we will\nhave to seriously evaluate our continued membership in NAEB.”\nKeith I. Niohbert WENH-TV - \"I cannot support the NAEB Board of Directors plan. I would,\nhowever , welcome early action by the NAEB Board encouraging and providing the means by\nwhich stations might exchange educational television series, from station to station, on a\nfree exchange basis.”\nTames M< Morris - KQAC-AM-TV - \"Two competing organizations which seek to speak for\na group of stations in the search for program material and fear donors of production funds\ncannot help but confuse the ’image’ of educational radio or educational television.”\n\"The strength of the radio network is in having gne strong organization, not two competing\nservices. Likewise the strength of the ETV network is in having one group of affiliates\nand one central approach to the dollars with which to produce network programs. It seems\nto me that the affiliates and the NETRC have a good working agreement on this approach\nfor such production funds. NAEB entry into this field could only confuse the problem for\neveryone concerned.”\n\"I would also be concerned about the idea of seeking donor participation and prod action\nof a series without the additional commitments regarding duplication and distribution,\""
}