{
  "id": "d503-42",
  "text": "W H V V\nEDUCATIONAL r adio and television\nIS 22 CHESTNUT ST., PHILADELPHIA 3, PA.\nLD C U ST B-237D\nJune 8, 1962\nMr* Raymond D. Hurlbert\nChairman, TV Board\nNAEB\n2151 Highland Avenue\nBirmingham 5, Alabama\ny\nDear Ray:\nThank you for your temperate and explanatory letter of\nJune 5. I am sending photostats of it to the persons who received\ncopies of my letter of June 1 to Bill Harley.\no\nMy letter to Bill was prompted by the report I had re¬\nceived of the manner in which the NAEB Board had reached the de¬\ncision to engage in independent TV production. It was presented to\nme as being implemented unilaterally, without due regard far expres¬\nsions of opinion from the TV members. This was my only area of con¬\ncern. I do not oppose the decision itself; in faeO'I encourage the\nexperiment to determine the competence of NAE9 in regard to serving\nunfulfilled TV program needs.41 I also do not question the authority of\nthe Board to decide the matter. 1 guess the only thing that really\nbugged me was the fact that in view of the personalised nature of\nNASB membership, the interest of those to be served by the action\nwas not solicited in the first instance.\nBill Harley is an energetic and intelligent administrator,\nand I am with him all the way, I also respect your abilities and sin¬\ncerity as Chairman of the TV Board. I am not alone, however. In\nthinking that there is a “tight little group” aspect to board deliberations\nand actions, and ! do not hesitate to speak my mind on matters about\nwhich l feel strongly.\nSincerely\nRichard S, Burdick\nExecutive Vice President and\n/ General Manager\nc.c.jv/Mr. William G. Harley\nWHYY, INC WILLIAM GOLDMAN. PRESIDENT ALLEN T. BON NELL. VICE PRESIDENT RALPH W. PITMAN. TREASURER MRS. RALPH J. ROBERTS. SECRETARY\nDONALD K. ANGELL RICHARD M. BURGESS ANTHONY R. CATRAMBONE W. LAYTON HALL GEORGE H. HENRY A. LEON HIGGINBOTHAM. JR.\nLOUIS P. HOYER PHILIP KLEIN J. HARRY LA BRUM JAMES J. LAPENTA, JR. LIONEL F. LEVY RT. REV. MSGR. E. M. REILLY JOHN B. ROBERTS\nABE S. ROSEN WILMER E. SHUE ALVIN A. SWENSON HON. JAMES H. J. TATE GRANVILLE S. THOMAS\nEDWARD F. TOOHEY ALLEN H. WETTER MRS. H. GILBERT WILSON\nLEWIS WEINSTOCK, ESQ., LEGAL COUNSEL"
}