{
  "id": "d503-46",
  "text": "AUBURN UNIVERSITY\nuRS\nAUBURN\nALABAMA\nAM\nJUN 111962\np*\nEDUCATIONAL TELEVISION DEPART\nWAIQ—WBIQ—WCIQ\nJune 8, 1962\nMr. William G. Harley, President\nNational Association of Educational\nBroadcasters\n1346 Connecticut Avenue, Northwest\nWashington 6, D. C.\nDear Bill:\nI have several reactions to your memo concerning the two series\nwhich NAEB may contract for.\ni.\nFirst, added diversity in program sources, which I assume will\nmean new and fresh approaches to programming, is desirable.\nx( Second, speaking only locally (Alabama), we need something that\nis located between our own preoccupation with utility (how to do it,\nteaching), and The Center’s emphasis on Big Issues, Big Names, and\nCulture. I am not discounting either end of the programming scale.\nWe need what NET has to offer, although they speak only to the most\nliterate of the available audience. We will always have with us the\nutilitarian, our daily bread. But somewhere in the ’’vast wasteland”\n(sorry) in between there is swinging room for imagination and crea¬\ntivity. Examples later.\nThird, just as in the Radio Tape Network local talents were\nunearthed which proved of great value, so some ”desert flowers blushing\nunseen” may be given exposure. NET will never touch them. Locally,\nstations are limited in what they may do with outstanding local\ntalent, usually for lack of funds to release what is probably an overworked\nperson from demands of his job.\n*1 Fourth, NAEB should not attempt to go over any of the same ground\nwhich NET has covered. Also a new approach to audience should evelve,\ndifferent from theirs.’ Maybe we could justify trying to cut just a\nlittle wider piece of the audience pie than we are used to. We have\nbecome so used to justifying educational broadcasting in terms of\naudiences (plural) that we may be missing some good chances. I am\nsuggesting lower,-the denominator in the fraction of the available\naudience soughtr'S\nTHE LAND-GRANT UNIVERSITY OF THE STATE OF ALABAMA\nPROGRAMMING ON THE ALABAMA EDUCATIONAL TELEVISION NETWORK"
}