{
  "id": "d503-57",
  "text": "NAEB HEADQUARTERS\n' JUN 6 1962\n?lMlWM2|l|2,3|4|S|?\ni\nJune 5, 1962\nHr. Lfflren : ton*\nKCTS C.V {Channel 9\nUniversity of Kaehlngton\nSeattle S. VJnohinoton\nDeer Lorens\nHank you for your moo dated June 1 In regard to the KMB'e entering\nthe field of Revision program production*. At the outset, let me say that I\nm in entire accord with your feeling® and reasoning.\nFor years, the individual stations, working together with KST, have\nbeen complaining and are finally doing something about the matter of quality\nproductions* It sees* evident from the productions that we have received in\nfee last year and a half and from what we were permitted to preview from next\nyear*® schedule, that Mt ia well on it* way in providing a truly out*tending\nprogram service which very definitely respond* to the need* of the m stations.\nIsiti frankly, I have ecreened innumerable kinescope* and tape* idiich several\n\"independent1* £TV station* have dther produced for their own distribution or\nacquired from other source* and, in ail honesty, 1 have found little that was\nuseful or could approach the newer*- MKT products in quality*\nIt is say very sincere feeling that MS’ will have to assume higher\nand higher costs if it wishes to continue improving it* program schedule, both\nfor production and for acquisition* 11 It seem* obvious that a diversion of funds,\nsuch as the KA£8 proposal would mm to isply* could well be suicidal at this\nat this critical period*^\nin any case, it seems obvious that the way the matter was handled was,\nt® say the least, questionable* If the implications are correct, it would seem\nthat each and every SW station should seriously consider whether the fund* it\napplies to membership in the HA£B are not being used to their very disadvantage.\nthank you for bringing this to our attention, and I look forward to\nfurther development*.\nSincerely,\nThomas Petry\nT^sdyb\n— mil !•>***»MAI8\nAeelatent General Man*tf*r\nProgranolng"
}