{
  "id": "d503-62",
  "text": "CHANNEL\nKAET\n8\nARIZONA EDUCATIONAL TELEVISION\nJune 4, 1962\nMr, William G. Harley\nPresident\nNAEB\n1346 Connecticut Avenue N.W.\nWashington 6, D, C.\nDear Mr, Harley:\nThank you for your recent memorandum in regard to the proposed\nexperimental television production to be undertaken by the NAEB.\nAt this time I would like to assert our station’s view towards\nthe NAEB’s entering into television programming, I feel that the present\nservice being offered by NET is more than sufficient to serve the present\nneeds of affiliated ETV stations, I do not feel that the NAEB should es¬\ntablish and maintain a programming and production aspect of operations\nthat in any way would lead to a dilution of efforts or drain off funds\nthat may, in the future, be made available to potential underwriters for\nNETRC programming, u\nI feel that the programming aspects of television should not be a\nfunction of NAEB, It is my view that NET serves this function quite capa¬\nbly and quite completely and that NET should continue to serve educational\nstations in this capacity, NAEB’s entering into a programming service can\nonly lead to a competition for funds at a time when such funds are extremely\ndifficult to come by, and lead to a confusion on the part of underwriters\nand those who would contribute to ETV’s development,\nI feel that the NAEB can most effectively serve its TV members when\nefforts are extended in those areas where NAEB can be most effective. Pro¬\ngramming and production is not one of these areas. I feel there are enough\nprograms available from regular sources to serve the ETV stations at this\ntime and that the proposed programming to be entered into by NAEB will not\nappreciably add to the available programming to compensate for the potential\ndamage it might do in diluting the efforts of our primary TV programming\nsource, NETRC,\nSincerely,\nJUN 6 1962\nStation Manager\nSPS/jc\ncc: Loren\nARIZONA STATE UNIVERSITY, Tempe , Arizona"
}