{
  "id": "d503-66",
  "text": "GEORGIA CENTER For CONTINUING EDUCATION\nuniversity of georgia/athens\nMay 3i» 19^2\nlearning has no n-g-e limit\nMr. William G. Harley\nPresident\nNAEB\nI3W> Connecticut Avenue, N. W.\nWashington 6, D. C.\nDear Bill:\nI AM RESPONDING TO YOUR MEMORANDUM ON EXPERIMENTAL TV\nProduction by NAEB.\nThe information you have given us in the memorandum is from\nMY POINT OF VIEW RATHER SKETCHY. HOWEVER, SINCE I KNOW YOU\nDONtT WANT TO SIT DOWN AND ANSWER A BUNCH OF QUESTIONS POSED\nBY EACH INDIVIDUAL MEMBER, I WILL REACT TO YOU ON THE BASIS\nOF WHAT I ASSUME YOUR MEMORANDUM MEANS RECOGNIZING THAT SOME\nOF THESE ASSUMPTIONS MAY HAVE ALREADY BEEN ANSWERED IN YOUR\nDETAILED PLANS. U FjRST, EVERY STATION CAN ALWAYS USE ,lMORE\nDISTINCTIVE’* ETV PROGRAMS, BUT I AM NOT CERTAIN THAT NAEB IS\nPARTICULARLY IN A POSITION TO CONTRACT OR SUB-CONTRACT FOR\nSUCH PROGRAMS BETTER THAN EXISTING AGENCIES. SECONDLY,\nCERTAINLY NO ONE CAN OBJECT TO LEGITIMATE EXPERIMENTATION.\nI do not. However, if the experiment is conducted to determine\nWHETHER NAEB CAN PRODUCE ** MOR E D I S T I N C T I V EU PROGRAMS, THAT IS\nONE THING. IF THE EXPERIMENT, HOWEVER, IS CONDUCTED WITH A\nSECOND GOAL OF IMPROVING NAEB1S FINANCIAL STATUS, l BELIEVE\nTHIS HAS ELEMENTS OF DANGER.\nMany such production experiments lose money rather than make\nMONEY. tflN EITHER EVENT IT IS MY PERSONAL BELIEF THAT NAEB\nSHOULD, AT LEAST A GOOD MANY YEARS AHEAD, DEVOTE ITS MAJOR\nENERGIES TO IMPROVING ITS STATUS AS A PROFESSIONAL ORGANIZATION.\nIf THE PRODUCTION EXPERIMENT PROVES SUCCESSFUL, I WOULD ASSUME\nTHAT THIS WOULD RESULT IN NAEB LOOKING TOWARD A POLICY OF\nCONTINUED PRODUCTION IN HEAVIER AMOUNTS. If SO, I WOULD HAVE\nTWO CONCERNS. “FIRST, I AM PERSONALLY NOT CONVINCED THAT NAEB\nSHOULD BE REGULARLY -ENGAGED IN TELEVISION PRODUCTION. SECONDLY,\nTH I K J~Np OF ACT I V I TY, I FEAR, COULD DRAIN AWAY CONSIDERABLE\nNAEE|;’ENERGY from VTHA$ I CONSIDER TO BE OUR ORGANIZATION^\nMAJOR /PURPOSE. V\nJUN4\ni"
}