{
  "id": "d503-8",
  "text": "*4-\nprogramming than do the institutionally supported,stations. It perhaps\nis to some extent the difference between the Chautauqua and a college*\nWe don*t support other parts of our educational establishment by passing\nthe hat — and I don*t think we will support a strong group of educat¬\nional television stations very long by the same technique. Look around\nat what has happened to symphony orchestras throughout the country as\ncompared with public libraries and decide how you want these stations\nto be nourished. If the stations are to be really pafcts of the educat¬\nional communities they can and will be supported as the communities\nsupport education. If the stations are to be alternate programs\nservices to the commercial stations and are essentially cultural\ninstitutions, then they will probably maintain the status of museums,\nart galleries and symphony orchestras.\nI think every effort should be expended toward helping the community\nstations find a bisis of support from the educational establishments\nof their cotmnunities, rather than continuing to encourage them to\nremain \"fund raisers\". Sure it may be fashionable for awhile for all\nthe civic leaders and their wives to take on the educational television\nstation as the current \"pet charity\" but what happens to the station\nwhen this interest turns elsewhere, as it ultimately will.\nThe dependence on income strictly from the educational establishment\nmay mean a lower level of income than some stations presently \"enjoy\",\nbut it may mean a longer and more stable life for the stations than\ntheir present course. And Jack, I think the same thing perhaps applies\nto the Center, You are gathering together a great amount of moaey from\nthe Foundation and from business — and you are spending a tremendous\namount of money to operate an enbaihnously expensive operation in New\nYork. The educational establishment of the country apparently cannot\nafford the type of operation you have developed, for it takes financing\nessentially from others. As you fulfill your credo that your function\nis not to make money but to spend it, I think you are leading the\nstations down the garden path. Perhaps we should be having more *eat\nand potatoes — if that is our real station in life — and not be\ndeluded by all the cake and frosting. I realize I sound like the\n\"poor but proud\" moralist but the old virtues are not entirely outmoded.\nThe Center has not really ever tapped the program potential among its\nmember stations — programs that are both good and far less expensive\nthan most of those produced by the Center. Your staff will never find\nthese programs and make use of them as long as you and they are striving\nto be the \"fourth network\"\nWell, this communication has gone on long enough. Why don*t you come by\nSeattle some time before the Fair is over, on one of your swings to the\nCoast. We could spend an enjoyable and profitable evening talking more\non this. You know. Jack, I have the highest respect for your integrity\nand your energy. You are doing a magnificent job of achieving what you\nbelieve to be your necessary goals. I just happen to believe you have\nyour sights set in some directions that will not produce the best long-\nrange results for the stations or educational television, generally.\nBest personal regards.\nLoren B, Stone"
}