{
  "id": "d1608-14",
  "text": "Frequency:\n760 kilocycles\nPower:\nDaytime: 1,000 watts\nFounded:\nApril 26, 1921\nValue of Plant:\n$15,000\nAudience :\nAbout one hundred letters or so a day are\nreceived by WEW.\nPrograms per Year:\n13,200\nSTATION WEW is on the air nine hours per\nday with a total of 3,000 hours a year. The\nstation broadcasts 255 programs each week and re¬\nceives 49 programs from outside sources. . . .\nBroadcasting time is devoted as follows: Educa¬\ntion, 45 per cent; entertainment, 55 per cent. . . .\nPrograms may be classified as follows: Music, 55\nper cent; speaking, 20 per cent; dramatics, 5 per\ncent; miscellaneous, including sports, public\nevents, etc., 20 per cent. . . . Annual appropria¬\ntion: $8,000.\nStation WEW’s staff consists of twenty-five\nmembers: five full-time workers, eight part-time\nworkers and twelve student workers. . . . Has in¬\ncreased its power as follows: 1921—50 watts;\n1922—1,000 watts (daytime).\nLATEST NEWS FROM WEW\n“The University of the Air” has added to its educa¬\ntional features “The Social Order Forum,” treating of\nthe problems discussed in St. Louis University class\nrooms and now projected to the radio audience. In\nthe scope of social problems the subjects prove varied\nand interesting, whether the talk be on “The Menace\nof Communism” or “Education in Marriage.”\nIn connection with the social problems of the day,\nthe St. Louis University School of Law presents two\nweekly programs considering the constitutional aspects\nof social legislation. These programs are prepared by\nsenior students under the direction of their professor.\n“The Editorial Page of the Air” featured at the noon\nhour brings the latest news with reflective comment.\nIt is a program designed for the noon hour, short but\nthought provoking.\n“Moments with the Masters,” a daily program of\nsymphony and concert music, continues to bring pleas¬\nure to those who appreciate classical music, and who\nare unable to find it elsewhere on the local programs\nduring the week. This program has gained indubitable\npopularity.\nWEW\nST. LOUIS UNIVERSITY\nST. LOUIS, MISSOURI\n13"
}