{
  "id": "d1608-18",
  "text": "probably due to the fact that the Sage Laboratory\nis located on the crest of a steep hill which over¬\nlooks the valley of the Hudson River. The towers\nare far above all obstacles, and from the top one\ncan obtain a clear view for many miles in every\ndirection.\nStudio\nWHAZ studio has received special acoustical\ntreatment. The ceiling is covered with a very\nthick layer of felt. One inch below this felt,\nsuspended from the ceiling, is a perforated oil\ncloth covering. Sound waves passing through the\nholes in the oil cloth are quickly absorbed by the\nfelt. The floor is covered with a heavily padded\ncarpet. The treatment given the walls was unique\nwhen the studio was designed, although it has\nsince been adopted by a number of other stations.\nThe heavy curtains of friar cloth are movable,\nthus permitting acoustical research and also allow¬\ning the studio director a means of varying the\nreverberation produced by the walls for different\nkinds of musical selections.\nOperating Rooms\nAdjoining the studio is the operating room.\nThis room contains the transmitting, receiving,\nand recording apparatus used in both studio tele¬\nphony and radio telegraphy.\nWHAZ operating room\nSome Outstanding Programs of WHAZ\nAre\n15-minute faculty talks\n15-minute round table discussions\nDance Orchestra—Campus Serenaders (stu¬\ndents )\nSymphony Orchestra (students)\nGlee Club (students)\nStudent Band\nDramatic Club (students)\nStaff\nConsists of fourteen members. Six of these are\npart-time workers and eight are student workers.\nW. J. Williams is director.\n* * *\nWHAZ was the first college radio station regu¬\nlarly licensed for broadcasting in this country and\nhas been regularly in operation, following experi¬\nmental work in radio at the Institute, since 1914.\nMany improvements have been made during\nthe last decade. Short-wave experiments have\nfrequently been carried on.\nLast year the students’ Radio Club was awarded\na certificate of membership in the W.A.C. Club,\nsignifying that it had successfully “Worked All\nContinents.”\n* * *\nHere is a brief description of some of WHAZ\nradio equipment:\nAntennas\nThe broadcasting antenna is a four-\nwire flat top antenna suspended from\ntwo towers. In front of this is a short\nvertical expanding cage antenna used\nfor wave lengths below 100 meters. The\ntwo towers are equipped with windlasses\nso that other forms of aerials can be\nquickly substituted when required for\nexperimental purposes. The geograph¬\nical location of the radiating system has\nproved to be unusually good. This is\n17"
}