{
  "id": "d1608-20",
  "text": "Josef F. Wright, director of WILL. Mr.\nWright is a former president of National\nAssociation of Educational Broadcasters.\nHIGHLIGHTS IN THE HISTORY OF WILL\n1911 University of Illinois granted experimental\nlicense to operate a transmitter. Frequency:\nranging from 300 to 360 meters. Call letters:\n9XJ.\n1922 University granted broadcast license. Frequency:\n834 kilocycles. Power: 400 watts. Call letters:\nWRM.\n1923 Station’s power increased to 500 watts.\n1926 University accepts gift of Boetious H. Sullivan,\nChicago, including 1,000 watt transmitter and\ntower, studios and equipment. Station was\nplaced on 1,100 kilocycles frequency and given\npermission to use 1,000 watts power.\n1928 WILL call letters assigned.\n1936 Ground broken for new antenna system and\n•transmitter building. Board of trustees appro¬\npriated $25,000 to carry out improvements.\nCooperating Agencies\nWILL has made its facilities available to the\nfollowing agencies:\nIllinois Congress of Parents and Teachers\nIllinois Department of Public Welfare\nIllinois State Highway Police, Sheriffs, and\nPolice Officers\nPublic Schools of the State\nIllinois Junior Academy of Science\nIllinois Department of Public Health\nThe Daily Illini—student newspaper\nIllinois Secretary of State’s Office\nAgricultural Organizations\nUnited States Department of the Treasury\nA.A.A., W.P.A. and Resettlement Administra¬\ntions\nChampaign Public Library\nService to the State\nStation W I L L is the only State-owned radio station\nin Illinois and the only strictly educational station in\nthe State. It belongs to the people of Illinois and is\nsupported, as is the University, through taxation.\nThe University is the center of much of the State’s\neducational progress. Numerous state conventions and\nvarious organizations are held on the campus each\nyear. It is likewise the center of many high school\nactivities. The Annual High School Principals and\nTeachers Conference, the Annual State High School\nBand Contest, the Annual State High School Orchestra\nContest, the Annual State Basketball Tournament, the\nAnnual State High School Track and Field Meet, and\nother such events, all occur on the University campus.\nIn addition to the Agricultural Experiment Station\nand the Engineering Experiment Station, there is main¬\ntained at the University a Bureau of Business Research,\na Bureau of Educational Research, a Bureau of Com¬\nmunity Planning, the State Natural History Survey, the\nState Water Survey, the State Geological Survey, and\nthe Illinois Historical Survey.\nThe only radio service available to all of these\nagencies is Station WILL.\nStation WILL has, in the staff of the College of\nAgriculture alone, a corps of 190 specialists, each an\nauthority in his own field and each with facts and in¬\nformation of value and importance to farmers, home¬\nmakers, and citizens in general. Many of these spe¬\ncialists are constantly traveling about the State giving\nlectures and demonstrations, but their teaching is ex¬\ntended manyfold as they use the facilities of WILL.\nUniversity programs, in general, are not purely en¬\ntertainment, but are rich with talent whether the\nbroadcast is educational or entertaining. Entertain¬\nment is offered on the University programs because it\nis a belief of those in authority that it is the duty of a\nradio station to present a varied program for the con¬\nvenience or necessity of the listening public, a public\nthat is responsible for the University. Programs con¬\ntain information and factual material sought by the\npeople of the State and of definite value to them. No\nstation in the State has as direct and immediate access\nto these facts as has WILL.\nW ILL Sinfonietta conducted by Arthur Cohen,\ndirector of music for WILL."
}