{
  "id": "d1608-27",
  "text": "wosr\nOHIO STATE UNIVERSITY\nCOLUMBUS, OHIO\n^TATION WOSU is on the air about six hours\n^ per day, approximately 1,600 hours per\nyear. . . . Originates 90 programs each week. It\ndevotes about 80 per cent of its time to education\nand the remainder to entertainment. Programs\ncan be classified as follows: Music, 25 per cent;\nspeaking, 60 per cent; dramatics, 5 per cent;\nmiscellaneous, 10 per cent. . . . WOSU has\nmade its facilities avail¬\nable to 46 cooperating or¬\nganizations in Ohio, to\nforty additional organiza¬\ntions outside Ohio and to\nother educational institu¬\ntions. . . . Annual appro¬\npriation : $22,000, plus\nspecial appropriations as\nneeded. . . . The Univer¬\nsity Architect is now pre¬\nparing plans for new stu¬\ndios. WOSU also plans\nan extension of the Radio\nJunior College instruc¬\ntional program, making\ncourses of University level\navailable to radio listeners.\n. . . Has increased its\npower as follows: 1922—\n500 watts; 1927 — 750\nwatts; 1932—1,000 watts\n(daytime).\nStaff\nThe staff consists of 12\nmembers—seven full-time\nworkers and five-part\ntime workers. Approxi¬\nmately 40 people are also\nemployed under three\nWPA projects.\nRADIO JUNIOR COLLEGE AND WORK SHOP\nFrom the New York Times, April 12, 1936.\nOhio State University, a pioneer among the educa¬\ntional institutions that have extended their influence\nby the aid of the radio, reports success with two new\ndepartures in this field.\nThe first was the establishment, during the depres¬\nsion, of a radio Junior College conducted in coopera¬\ntion with the Ohio Emergency School Administration.\nThe University provides the radio station, instructors\nfrom the regular faculty and working facilities. The\nFederal Agency provided clerical and field workers\ndrawn from the ranks of the unemployed.\nIn two years the Junior College has offered forty-\nthree courses for the benefit of listeners unable to at¬\ntend the University. In all more than seven thousand\nstudents have enrolled for these radio courses. Each\nquarter about fifteen hundred students have registered\nfor an average of one and one-half courses each.\nSixty-five per cent of radio students have been found\nto live in urban areas and the rest in rural districts.\nIn twenty-five counties of Ohio the interest has been\nsufficiently great to justify the employment by the\nEmergency School Administration, of local teachers\nto aid the students with their work.\nSix of the courses are broadcast from the classroom.\nStudents in the classroom seem to benefit in that with\na thought to the larger radio “class” the instructor\ngives more time to the preparation of their discussions\nand also invite outside authorities to come before the\nclass and the microphone.\nProfessor Lloyd A. Cook, broadcasting his class in\nsocial problems, found that radio enabled him to give\nhis course to five hundred besides the seventy in the\nclassroom. The daily stream of mail showed that his\naudience included taxi drivers, housewives, farmers\nand college graduates.\nThe second departure at the University is a radio\n“work shop.” Fifty students now spend considerable\nof their spare time at the radio station helping to\n“dress up” educational programs so that they may no\nlonger be considered dull and also getting practical\nexperience in other phases of radio work. One of the\nstudents conducts a weekly program, “Around Your\nOhio,” which each Friday night honors some Ohio\ncounty or city. The history, natural resources and\nachievements of residents are presented in dramatic\nfashion.\nNo credit is offered for work in the “work shop,”\nbut it is thought probable that some kind of curricu¬\nlum will soon be set up for those interested in radio as\na calling.\n2tt"
}