{
  "id": "d1608-41",
  "text": "KUSD\nUNIVERSITY OF SOUTH DAKOTA\nVERMILLION, SOUTH DAKOTA\nFrequency:\n890 kilocycles, shared with ten other stations:\nCJIC, KARK, KFNF, KFPY, WBAA, WGST,\nWILL, WJAR, WMMN, XEW.\nTime:\nShared with two other stations. Allotted 1/8\ntime.\nPower:\n500 watts, daytime and night\nFounded:\nMay 1922 as WEAJ\nValue of Plant:\n$75,000\nPrograms per Year:\n335\nAudience:\n250,000\nSTATION KUSD broadcasts regularly 2 hours\non Mondays, Wednesdays and Fridays, and\n1 hour on Sundays, Tuesdays, and Thursdays. Sta¬\ntion also puts on the air all important University\ngames, debates, musical recitals and contests. Total\nhours per year, 350. . . . Nearly all KUSD pro¬\ngrams are produced by members of the Univer¬\nsity. Station devotes 75 per cent of its time to\neducation and 25 per cent to entertainment. Pro¬\ngrams may be classified as follows: Music, 30 per\ncent; speaking or reading, 50 per cent; dramatics,\n10 per cent; sports, 10 per cent. . . . KUSD co¬\noperates with all public service organizations and\nwill give time for practically any program of gen¬\neral interest, provided the program is well pre¬\nsented. . . . KUSD has increased its power as\nfollows: 1922—50 watts; 1924—100\nwatts; 1927—250 watts; 1928—500\nwatts.\nSupport contributed by various de¬\npartments and divisions of the Uni¬\nversity. About $2,500 per year.\nDirector B. B. Brackett writes—\n“Like a large number of other early,\neducational broadcasting stations KUSD\nwas for nearly ten years practically a one-\nman station. One man had to do nearly\neverything connected with the station,\nwith little help except what could be\nsecured voluntarily from students of\nphysics and engineering. With practi¬\ncally no funds to use and no relief from\nother full time duties this one man had\nto plan equipment, construct parts, adapt\napparatus made for other uses, borrow\nwhenever possible, and thus assemble the\nbest transmitter possible under these conditions. Then\nhe often had to personally operate this makeshift trans¬\nmitter, and announce at the same time. He had to\nplan programs, and not infrequently produce a con¬\nsiderable part of the program himself.\n“However, the most significant development here in\nrecent years is the increased interest in nearly all de¬\npartments and divisions of the University that now\ncontribute to the programs of KUSD and also help in\nother ways. Interest is shown by individual members\nof the instructional force and the student-body, in\nmaking parts of programs assigned to them of real\ninterest and of intrinsic value.”\nFROM THE PROGRAM LISTINGS OF KUSD\n1936-1937\nEvening Lectures\n1. “Your Health,” by members of the faculty of the\nschool of medicine. Dean J. C. Ohlmacher, Pro¬\nfessor H. V. Atkinson, Professor C. A. Hunter, Pro¬\nfessor C. M. MacFall, Professor E. H. Shaw, Jr.\n2. “Current Governmental Problems,” W. O. Farber,\nAssistant Professor of Government.\n3. “General Trends in English Literature,” Genevieve\nJ. Blair, Associate Professor of English.\n4. “The Culture and Contribution of the Old Greek\nRace,” A. L. Keith, Professor of Latin and Greek.\n5. “History and Development of Banking and Finan¬\ncial Institutions in the United States,” J. P. Jones,\nAssistant Professor of Economics.\n6. “Contemporary World Problems,” by members of\nthe faculty of the department of history: Professor\nH. S. Schell, Professor Carl Christol, Assistant Pro¬\nfessor C. G. Beckwith, Instructor Robert G. Dun¬\nbar.\n7. “Modern Zoology,” E. P. Churchill, Professor of\nZoology.\n8. “The Theory and Practice of Art,” Howard W.\nJoyner, Assistant Professor of Art.\n9. “Money and Banking,” E. S. Sparks, Dean of the\nSchool of Business Administration.\n10. “American Industry,” H. E. Brookman, Associate\nProfessor of Applied Sciences."
}