{
  "id": "d1608-6",
  "text": "FOREWORD\nTHAT the present widespread development of commercial radio in the United States was pioneered by\nresearch, experiment and demonstration of our colleges and universities is a fact not properly appre¬\nciated by the people of the United States. In the early twenties there were nearly 100 university and\ncollege radio stations on the air. If you will pause at the entrance to the impressive University of Wis¬\nconsin studios, you will see some of the grandfathers of tubes now used by radio transmitters all over\nthe United States; indeed, all over the world. These tubes were built in 1916 and 1917 by University of\nWisconsin engineers long before KDKA made its epochal broadcasts. Through research the Univer¬\nsity of Wisconsin and other centers contributed greatly to the building of the radio service now avail¬\nable to the American people.\nMany institutions found radio an expensive luxury. The advent of commercial advertising and\nnetwork service gave commercial stations advantages with which educational stations found it difficult\nto compete. Depression forced many universities to sell their stations or give up their licenses.\nSo greatly have educational stations been overshadowed by commercially owned stations that there\nhas been a disposition in some quarters to think of them as belonging, like the dinosaur, to the past.\nThat such an assumption is contrary to the facts will be clear to any one who reads this brochure, which\nis a pictorial and factual summary of the present very lively state of educational broadcasting stations.\nIt will be news to many that educational stations are growing in power and influence. It will astonish\nothers to find that universities and colleges are setting aside larger and larger budgets for radio program\nservice.\nThe need for a summary which should show the renaissance of educational broadcasting stations\nin this country became apparent at the annual meeting of the National Association of Educational Broad¬\ncasters, held at Madison, Wisconsin, August 18, 1936. Reports presented from various stations revealed\nthat the tide had turned; that educational broadcasting stations were making remarkable progress. So\npronounced was this upturn in their fortunes that the National Committee on Education by Radio\naccepted the invitation of the National Association of Educational Broadcasters to prepare a brochure\nreporting this significant development. The information and illustrations contained in this booklet\nwere received as a result of a questionnaire sent to principal educational radio stations. The\ndocument has been prepared for the printer with the cooperation of the Educational Radio Project,\nOffice of Education, United States Department of the Interior.\nReaders will find in the following pages evidence that our institutions of higher learning are\ncontinuing their research and experimentation in radio. They find that these institutions are also\nrendering an educational service to the areas they serve. Here will be found reports of research\nin use of radio for hurricane protection, for television, for dissemination of child study information, for\nthe organization of listening groups, and other pioneer activities. The record of existing educational\nradio stations affords evidence that they are providing and will provide in a greater measure a valuable\nservice in the application of radio to the advancement of education and science.\nArthur G. Crane,\nPresident, University of Wyoming,\nChairman, National Committee on Education by Radio"
}