{
  "id": "d958-53",
  "text": "~ 3 «\nstill remained, and remains, tias only mrdoorship^bmed association in odmo*\ntional broadening with all the other fwatAom sad responsibilities which\nthis implies. These functions have been outlined in some detail in previous\nreports to the Foundation, particularly thorn of June 6, 195? md June 26,\n1958.\nSelf-Support Efforts\nOs© of the objective of the MB, md of W. K# Kellogg Foundation grants,\nhas been to secure for the Association a permanent basis of self-support. This\nobjective, for the Association as a whole, has been far more difficult to achieve\nthan that of the network. Although progress has been steady, it has been\nslower and more gradual than was anticipated* This progress has been delayed\nby several factors, as outlined in the Report of the BABB Bsrsaanont Financing\nCommittee, forwarded to the Foundation June 6, 1958. It was delayed in part\nby the abundance of free materials and services provided by numerous other\nfhnd-si^ported projects and organisations, which has md® it difficult, during\nthe lifte of those projects, for the HAEB to charge* for such services and\nmaterials. It has also been rendered slower than we would have wished by the\noverall, economic psossures on educational budgets in the U.S. generally! each\nincrease in dues or network fees by the MSB has been followed by a considerable\nmaster of drop-outs. Consequently, the pace of progress towards self-support 1\nhas been tempered by the application of the law of diminishing returns.\nIt is possible that, if the MB had been satisfied to be an association\nof the few relatively strong institutions Which could pay greatly increased\nfbes, it could now be seXf»supporting. But it would not be a truly national\nassociation, with representation from the public schools as well as colleges\nand universities, radio as well as television, md in-school as well as general\nadult education offerings and services. Nor would its programs md objectives"
}