{
  "id": "d1677-0",
  "text": "N-A-E-B NEWS LETTER\nNational Association of Educational Broadcasters\nMadison, Wisconsin — January 12, 1937\nTHE PRESIDENTS GREETING\nThe air of the New Year is filled with optimism — and radio*. All about us\nare signs of growth in radio — more stations, more power, more programs, more ad¬\nvertisers, more talent, and more technical advances, But, more progress? More\nachievement in realizing the social improvement possibilities of radio? Perhaps.\nCertainly there is more discussion; there are more conferences and inquiries\nabout radio education; there is more alertness among educators themselves about\nthe neglect of education on the air. And there seems to be some evidence of in¬\ncreasing distrust of the showman* s sincere interest in education. Certainly the\nexperience of the past is proof that commercial broadcasters cannot be expected\nor trusted to do the complete job of broadcasting.\nSo, we in the field of educational broadcasting begin the new year with a\ndeepened conviction that our purpose is right and our cause essential. Such suc¬\ncess as we enjoy will be in the face of indifference, resistance, and opposition*\nIt's a great struggle — but the new year brings real hope and much promise.\nSuccess to N.A.E.B. and education on the airt\nH. B. McCarty\nPresident, N.A.E.B.\nWCAL - WLB SITUATION\nMr. A. 0. Lee sends us this word. (December 24)\nuWe have had no word from Washington as to a decision regarding our applica¬\ntions. We are of the opinion that the Federal Communications Commission will take\none of two courses of action. First, there is a possibility that it may reaffirm\nthe order of October 20, granting the 760 kc. frequency with 5000 watt power, full\nday-time operation to WCAL and WLB, or it may find it necessary to set a date for\na formal hearing upon the applications due to protests lodged with the Commission.'*\nTHE ANSWER IS HERE? ..p\nWhen it was announced that WCPtff of St. Lawrence University, had been trans¬\nferred to commercial interests, your Secretary wrote the former manager of the\nstation asking about the reasons for the action. This is the reply, from Secretary\nK. C. Ellsworth, of the University:\n\"In answer to your letter of December 2, I can only say that we felt that an\nadvantageous arrangement could be made by the transfer of our station to the Water-\ntown Times and we plan to continue University broadcasts if and when the station is\nmoved to Watertown.\"\nWhy the secrecy, Mr. Secretary?\n(Send in your notes for the News-Letter now! Mail them to\nthe Secretary, H. A. Engel, Radio Hall, Madison, Wisconsin.)"
}