{
  "id": "d730-33",
  "text": "- 2 -\nThe second proposal, for a reorganisation of Pacifica, was set out in my\ncommunication of July 13, to the Executive ^embers. X will not review it in de¬\ntail. it contemplated a reconstitution of the Executive Membership from dis¬\ninterested persons outside the IPFA staff, on a basis previously agreed upon\ndown to the particulars by the present Membership. It specifically proposed\nthat present differences as to the constitution and administration of KPFA's\nstaff, etc., be set aside and left to the proper exercise of authority by a\nnew Membership when such had been created. In making this proposal I stated\nthat X was withdrawing my resignation, which was to have been effective July 3I»\nin the hope that the plan could be accomplished. X asked, also, that an in¬\nformal meeting be held on Wednesday evening, July 15, to explore the matter.\nThe group at KPFA represented by Wallace Hamilton refused to discuss the pro¬\nposal, stating, without explanation, that they rejected it.\nI should like to record the actual sequence of events during the past two\nweeks for the benefit of the non-resident Members of -Pacifica. if there is\nany disposition in the participants of these ©vents to pause and think, they\ntoo* I believe, will benefit from a review.\nThe position of Wallace Hamiltonfs group on July 11, when I returned to\n.Berkeley, rested on the pretext that my resignation had been made immediately\neffective on July 10 through a remark of Eichard Moore, that an overriding\ncorporate emergency had therefore existed, etc. On July 12 X advised Wallace\nHamilton directly that my office had not been vacated. On July 13 X asked\nthe other directors, Mr. Levy and Mrs. Chiaroto, to convene for a special\ndirectors meeting by unanimous consent. They refused. I asked that, in any\nevent, there be an informal meeting of all persons concerned at KP3PA on the\nevening of July 13 to discuss the problem. This meeting was attended by five\nmembers and myself, but Mr. Hamilton’s group refused to enter the room, and\nno communication was obtained. Another effort to bring about an informal\nmeeting on July 1> I have already described. Throughout this period %.\nHamilton's group claimed legal representation of Pacifica, and sent letters\nto tne Fund for Adult Education, the H.A. r.B., and other persons and agencies,\npresenting that claim. The same misrepresentations were made over the air to\nrCPFA's audience.\nAs a consequence of these reckless actions, the Fund for Adult Education\non July 16 sent an attorney to Berkeley to examine the corporate records and\ndetermine, for the Fund's own purposes, the legal representation of Pacifica.\nThis gentleman found a statement entered in the minutes of Pacifica Foundation\nalleging that on July 10 I had instructed the Committee of Directors that my\nresignation was effective immediately. This statement Is categorically raise,\nbut its presence in the minutes raises, from a legal standpoint, a dispute of\nfact which only litigation could clarify. The attorney thus found that the\nund for Adult Education could not accept any legal representation of -Pacifica,\nin these circumstances. From an informal conference of attorneys, including\nthe Fund's attorney, there arose the first of the proposals described above,\nfor curing action by tne cor oration, which Mr. Hamilton's group refused.\nIn a further effort to return this subject to its objective elements and\ndevise a solution, a meeting with Wallace Hamilton and his attorney was ob¬\ntained through the intervention of Charles Israel, an attorney and long-time\nsubscriber to £P?A. On the evening of July 21, %. Hamilton, Hr. Cchwarzer,\nMr. Frael and l conversed for more than two hours. In this conversation Hr.\nHamilton, stating that he represented the entire staff of ffiPFA, presented a\njustification of his group's attitudes and actions which differed extremely\nfrom the previous claims."
}