{
  "id": "d730-36",
  "text": "LEVIS HILL\nA \" pA CipfCtX P<f'1-'\nDuncans Mills\nDear George: July 28, 1953\nMilton has probably filled you in on some of the strange events at KPFA\nsince you last heard from me. Certainly I owe you a little clarification of\nthese affairs, which at a distance must seem even more incredible than they\ndo here. I have your two notes of the 7th and 21st.\nMy resignation from KPFA and the project itself have a background that\nonly a few like yourself are likely to understand. In beginning KPFA, and\nfor seven years thereafter, I held very stubbornly to the idea of a working\nfellowship which shared equally in the large determinative decisions of its\nown activity. Pacifica Foundation was carefully designed to give this idea\na practical framework. I have often been told that the conception was utopian\nin the worse sense, for the reason that persons wholly involved in operational\nduties could not at the same time be efficient or responsible directors. Tet\nwhile agreeing that functions are not interchangeable — that a stenographer,\nfor example, cannot be expected to function as a maintenance engineer — I\nalways felt that the fellowship of ideas implicit in the Pacifica project should\nencourage a stenographer, engineer, or whomever, to learn the implications of\nthese ideas in matters of general policy, and in the end to make wise decisions.\nI had never been able to concede to myself the failure of this idea un¬\ntil KPFA fell apart after the announcement of my resignation. There was al¬\nways a certain amount of internal conflict, involving two or three changing\nidentities at a time, but with this peculiarity: that since I began the pro¬\nject and had always headed it, the conflict usually focussed on some action\nof mine. Resigning from Pacifica was to myself a last-ditch effort to permit\nits principles to prove their potential, unencumbered by any controversy at¬\ntached to my personal participation. I had the hopeful expectation that in\nthis circumstance most, and possibly all, of the staff and members would\nJoin with the best remaining leadership and improve the operation. A special\nproblem I had to consider was the FAE's lien on 50$ of XPFA'e assets,\ngoverned by a note which is immediately payable if I cease to be Chairman\nof Pacifica — the FAE insisted on this proviso in 1951 over my protracted\nopposition. In that regard, however, I expected soon to be able to tell\nScotty that there was a better organization in Berkeley now than when the FAE\nmade its grant. In light of the later events these reckonings may appear\nnaive; but at the time there was excellent reason to believe that Dick Moore,\nwhom I had been training for two years in the administration of the project,\ncould carry on with everyone’s support. In a few days, however, Moore’s ef¬\nfort to reduce the staff slightly had brought on an amazing attempt by\npart of the staff to seize control of the project — a scheme headed by one\nof the persons who was to be left out of the reduced staff. Moore, along\nwith Chiarito, the Music Director, and Zapf the Treasurer of Pacifica made\nthe mistake of entering immediately effective resignations; and about half\nthe membership prepared to resign in protest. The station was now in the\nhands of its most irresponsible elements, which among other things gravely\naffected the FAE relationship. These remarkable phenomena occurred during\ntwo days when I was in Carmel. I have been trying ever since to salvage the\nproject, but without success.\nIncidentally, when I learned what had happened in Berkeley I called\nScotty and asked what he would like done, in these circumstances, with the\n$15,000 check which had Just arrived from the Center via MEB. He asked its"
}