{
  "id": "d730-74",
  "text": "Dr. Harry Skomia-2\nDecember 18, 1953\nspecified in the Memorandum Agreement. I believe that the Stanford Choral\nGroup will be the first program coning up*\nAsian Books t Watts is planning to fill oat this series sometime over the\nChristmas holidays, if possible. The programs have been done in rough form\nalready. It is a matter of polishing and re-recording.\nA£staa« This series can be regarded as complete. It might, however, be\nhelpful if the N.A.E.B. had some suggestions as to any other particular\nareas in the world which might be mutually interesting as a documentary at\nsome future date.\nConcepts of Freedom* This series has been put on occasionally. We have\nthe raw material for a half-hour program on \"Freedom in Contemporary Jssa\nMusic\" already on tape waiting to be edited, and also a discussion of Roman\nCatholic concepts of freedom to be taped tomorrow. Both these would need\nediting and polishing before they are sent off. Meantime, we would like any\npreliminary comments which the program acceptance committee might want to\nmake on this series.\nPoets ££ the Far Waati In this series we are currently planning a program\nor two with Kenneth Raxroth aid will be moving on from these along the lines\nspecified in the Memorandum Agreement. Again, any comments on production\nor content of the series so far submitted would be helpful.\nArt in Our Timat This series has been referred to in earlier correspondence.\nWe can move ahead with it for N.A.E.B. consumption if the program acceptance\ncommittee likes it. It is a regular program over our station, and I be¬\nlieve this would be about twelve talks in all.\nKidnAwnftd« Moves along as scheduled in weekly production. I believe Chuck\nis planning sixteen episodes.\naThe two programs submitted along the lines of the Memorandum\nAgreement are the first part of a series which may include two or three\nrather hot discussions among architects in this area. One such discussion\nhas already been taped, and we will be reviewing it for possible N.A.E.B.\ndistribution in the future. We also have on hand a terrific recording of\na recent speech made by Frank Lloyd Wright out here, but the speech times\nat twenty minutes and consequently we have got to figure out some way to\nfit it into a half-hour or full hour mould, unless you want to make a\nspecial exception in the case of Wright. We figure a twenty-minute lead-\noff followed by a forty-minute discussion. Let me have your ideas on this.\nBritish Economn This is a special series which evolved because one of\nour commentators happens to be in England on a Fullbright Fellowship and\nhad the good luck to arrange an interview through the BBC with G. D. H.\nCole. We are sending along also the interview with Wincott and Sir Vincent\nTewson which seem to all fit together. We also have here an interview of\nlesser interest with Morgan Phillips, Secretary of the British Labor Partyj"
}