{
  "id": "d730-77",
  "text": "naeb headquarters\n1-18-54\n*10:\nTO :\nFROM:\nALL NAEB ACTIVE MEMBERS\nNAEB HEADQUARTERS\n. AyV ^\nRE\n:\na ^ ^ w ■\nLETTER JKOM KPFA COPIED BELOW\nBelow is a copy of the letter NAEB Hdq. received from Wallace Hamilton of KPFA.\nIf any of you are interested, please contact Hamilton directly.\n* * **##**»#\nKPFA\n2207 ^hattuck Avenue\nBerkeley 4* California\nJanuary 14, 1954\nR...For the past year or so we have been supplied with FM sets from Pedersen\nElectronics Company in Lafayette, which is near Berkeley,. Mr. Pedersen has sold\nthese sets to us at factory co3t, $38.21, and we have distributed about 600 such\nsets in this area along with subscriptions to KPFA. The sets have proven satis¬\nfactory for fill but the more difficult rece ption areas, and sales are now moving\nalong around ten or more a week.\nhWq have been in the process recently of renegotiating with Mr. Pedersen for another\n500 sets for sale to new subscribers. In the course of our conversation, Mr. Ped¬\nersen said that sets ordered in groups of a thousand would result in a very substan¬\ntial saving on the factory cost of the set. We asked him to draw up some figures\nfor us, and on January 11 he sent us a price of $31.00 per set for a thousand sets\nof more, F.O.B. Lafayette. He said that he could give delivery of 150 sets after\ntwo weeks of production, 350 after four weeks, 150 after six weeks, and the final\n350 after eight weeks.\n”Ih occurs to me that a number of stations affiliated with the NAEB are probably\nin positions comparable to us here at KPFA. In other words, the difficulty of\nsupplying potential listeners with good inexpensive FM equipment. To give you\nsome idea of the type of product which Pedersen has been making for us, I have\nahked him to send you a sample set for you to look over and enlist some engineer¬\ning advice.\naIf there is any interest in NAEB going in on this arrangmenet on behalf of member-\nstations, along with KPFA, w© might be able to work out some arrangmen fc whereby\nwe could take advantage of this considerably reduced factory price. Ait in order\nto do so we will have to move with a reasonable amount of dispatch, since we are\ngoing to be needing sets in 4rch and it takes Mr. Pedersen six weeks or so to\naccumulate the parts. Hence, I would appreciate an early reaction from you and\nperhaps some of the larger 5M stations in NAEB. We can go into further details\nlater regarding warranty, financing* 3Chipping, etc.\nWith Best regards®\nSincerely yours,\n// signed //\nWallace Hamilton"
}