{
  "id": "d730-8",
  "text": "KPFA\nPROGRAM\nJUNE 28\nJULY 11\n94.1 MEGACYCLES\nFM CHANNEL 231\n% Set oh a . . ,\nOnce a KPFA engineer sat on a tack, and to clear the air following this intrusion he\nleft the transmitter house and went outside. It was a foggy night in the Berkeley-\nOakland hills and after the engineer calmed down sufficiently to remember where he\nwas, he is reported to have asked a curious question. “What’s all this equipment for,”\nhe asked. He was alone with a large, expensive and exceedingly intricate electronic\nmechanism, and obviously he was in an odd frame of mind. Everybody, particularly radio\nengineers, knows what a transmitter is for. But the fog kept pressing in and the world\nbecame more and more remote until our engineer asked a further unsettling question—\n“But for what, and to whom?”\nIt’s possible that our engineer was not so remote from the realities of his situation as\nit might seem. Let’s admit that we’ve added a legendary touch or two to his story, but\nconsider his questions without reference to the foggy landscape and only indirectly to\nthe tack.\nHe was in control of one of the most effective modern means of communication; and\neven though he may have been wool gathering, he gathered in what was once a very\narguable question between men-the old question of ends and means. It has become a\nmodern platitude to say that our means of making and doing have outrun our abilities\nto employ and control these same means for primarily constructive ends. Let’s not con¬\nsider nuclear fission, but merely radio as an example. The world over, the radio speaks\nto individuals, and it speaks with something of the urgency and compulsion of an inner\nvoice. It informs and shapes ideas and actions. Intentionally, unavoidably, it functions\nin the creation of each listener’s image of and relation to the world in which he lives.\nHow it is used or, to put it another way, what is communicated determines, to a rather\ndisturbing degree, what the world is.\nTo sharpen the moral tack, how the radio is used should be the first question pene¬\ntrating anyone attempting to use it. It is a means to an end, and that end, presumably,\nis communication, and the content of communication is of final importance; in all rela¬\ntions between man and man. If it takes tacks to raises fundamental questions, who can\nsay that they should not be found on many a chair. There’s really little point in stopping\nwith the engineers."
}