{
  "id": "d730-82",
  "text": "PACIFICA FOUNDATION\n2207 Shat tuck Avenue\nBerkeley 4, California\nFebruary 21, 1956\nDear KPFA Subscriber:\nAs you may have heard by now, KPFA has a new plan to solve its\ndeficit problem* If the plan works, the station will be self-support¬\ning from its audience for the first time in its history, and the\nfamiliar threat that KPFA may have to leave the air will be ended.\nThe new plan grew out of the recent survey of subscriber opinion.\nWhen about 20$ of the questionnaires had been returned, it was apparent\nthat the fourth of the alternatives listed — a rise in subscription\nrates — was receiving by far the largest preference check. A fourth\nof the respondents checked none of the alternatives, but here are the\nactual tabulations of those who did: (l) Suspend operation 6 months; 5$;\n(2) Reduce operation radically, 13$; (3) All-or-nothing campaign for\n9,500 subscribers, 5$5 (4) Raise subscription rate, 45$. In addition,\n57$ of the respondents said they would renew their subscriptions at a\n$15 rate, 47$ at a $20 rate.\nThese statistics led to two definite conclusions: most subscribers\nwant the station to continue at its present operating level if possible,\nand many are willing to pay a higher subscription rate if necessary.\nOn the other hand, 54$ of the respondents were convinced that new sub¬\nscribers would be harder to find if rates were raised.\nThe plan finally worked out does not raise the basic subscription\nrate, but institutes three supplementary subscription classes at higher\nrates. You will find these described on the accompanying fact sheet.\nQuotas set for the new categories, along with continued growth in Regular\nSubscriptions, will actually supply all of the funds needed for KPFA’s\npresent operation. The important thing about these quotas is that they\nare realistically within reach of KPFA’s existing audience. In fact,\nthe total number of entries needed in all three new categories — 1,600 —\nis only 39$ of the current subscriber roster.\nSo we are entering on a new phase in KPFA’s struggle for survival,\nand with high hopes — much higher, for once, than the quotas 1\nYou will hear regularly on the air and in the Folio how the plan is\nprogressing. Meantime, the accruing expenses of operation have to be\ncovered* To accomplish that, to avoid another \"crisis11 at the end of this\nmonth before the new plan has had a fair chance, we look expectantly toward\ncurrent subscribers like yourself who may wish to enter one of the new sub¬\nscribing categories right now on a pro-rated basis, without waiting for re¬\nnewal time. Will you consider that possibility?\nA business reply envelope is enclosed for your convenience, in case\nyou find one of the new subscriptions suited to your pocket and to your\nestimate of the station1s value. Use the envelope if you can. It will\ngive both you and KPFA new certainty of the project’s future.\nI Sincerely yours,\nLewis Hill\nPresident\nEnc. 2"
}