{
  "id": "d730-84",
  "text": "* v\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n( B . ^3\nBox 2008\nIfeiiversity, Alabama\nWr, Louis sail\nRadio Station KPFJUFM\nBerkeley, California\nDear Lout\nPlease forgive me for being tardy in writing this letter. I\nsuspect, however, that you have already got the good word and thia will\nonly formalise it. At the meeting of the Advisory Ccenittee with Hr. Cm\nScott Fletcher in Washington, L* €., May U, *tr. Fletcher informed us\nthat the \"Center* Board had approved the Advisory Committee's recommenda-\ntion that you at &FFA be given approximately ^30,000.00 to develop various\nradio programs.\nThese programs are to be developed under the supervision of\nHAEB. The procedure will be as followst\nYou will submit to m detailed reooirjmendatiom for programs\nyou would like to develop, including a breakdown of the\nbudget for each program sequence or series. 1 will then\nappoint s BAE8 committee or refer t see to an already\nestablished committee for screening. This committee,then,\nwill make specific recosaBondations through our headquarters\noffice to the Acting President of the “Center* who in turn\nwill negotiate the final details with you.\nYou will be expected to arrange for clearance of broadcast\nand subsldiazy rights and assign those to the \"Center\". The \"Center\"\nwill, then, reassign radio distribution rights to HAEB.\nKay 1 suggest that you shape these requests up as fatfae possible\nso we msy tsegin the processing and complete the cycle of recommendations,\netc*, as early as possible so you may begin your plans for early fall\nproduction.\nI am delighted that the \"Center\" has approved this project and\ncongratulate you meet heartily upon having submitted such very stimulating\nideas for programs. I am sure that from your plans will coco some very\nsignificant contributions to our network.\nVery sincerely yours.\nGrsydon Ausatus\nPresident\nOAtpss\ncci Kember% Executive Committee\n1 embers, Advisory Committee to \"Center* Board\nFrank Schooley"
}