{
  "id": "d730-89",
  "text": "A~\\\nI, PROJECTION OF PROGRAMS TO BE PRODUCED AT EPFA MID\nMADE AVAILABLE TO THE TAPS HETTORK OF mT MEB~~\nMUSIC\nMEET THE COMPOSER; A series of six approximately one—hour programs with out—\nstanding contemporary composers „ These programs are prepared under the\ngeneral digestion of Amerieo Chiarlto, KPFA9s Music Director* and include\ninformal interviews with composers analysing and commenting on their owa\nand their contemporaries9 work; performances, both live and recorded, of\nthe composer9 s work with explanatory and critical program notes by the com-\nposer himself* Present plans call for a series of six programs with the\nfollowing composers s\nDarius Milhaud\nRoger Sessions\nErast Krensk\nJohn Edmunds\nAndrew Xmbrie\nUlis Kohs\nTOWARD A CREATIVE MDSICs A scales of nine programs, ranging frexa twelve to\ntwenty-five idnutes each, in which the experimentalist, Barry Partch, explains\nthe basis of a musical philosophy that led to his construction of a new\nscale and the invention of radically new musical instruments*. This series\nrepresents a simimaiy of thirty years of musical research by Harry Jferfceh\nwho is one of the most controversial .figures in the contemporary music\nworld. The three concluding programs in the series contain 'Examples of Mr*\nPartch3® compositions using the fert^-threa tone scale. The following\nis a listing of program titles and the times for each programs\nCreativity in Mxsic » 169\nEducation and the Hew Instalments - 17*\nEducation and the Record Repertory — 12*\nEducation and Acoustics - 169\nThe Writers on Music - 13*\nMusical Perspectives - 16®\n% Instruments - 21®\nCastor and Pollus (music) - 243\nThe Oedipus Dance Music - 259\n.CHORAL CONCERTSg A series of thirteen one-half hour programs of choral music\ninvolving the Berkeley Chamber Singers end choral groups from Stanford\nUniversity, San Jose Stats College, Modesto Junior College, University of\nCalifornia, College of the Pacific and Dominica? i College * The programs\nwill include both traditional and contemporary works for chorus*\nSTRING QUARTET REHEARSALS; Through an arraa|j$meni with members of the Quartet\nand the Ohiversity of 32aliforrla, K1FA has boon given permission to record\nthe open rehearsals held by the Griller String Quartet* These are ^unstaged\"\nrehearsals and contain all of the exchanges, humorous? and otherwise, between\nmembers of the Quartet. 7here will be between four and five program hours\nin the entire rehearsal series."
}