{
  "id": "d730-91",
  "text": "Page 3\nPUBLIC AFFAIRS fGont J\nDr, So B. Worthington, Ssaretary-General, Scientific Council for\nAfrica, (Gouncil organized by the governments of Britain, Franc®,\nBelgium, Portugal, South Africa and South Rhodesia)\nJohn Klano, student at Stanford University, member of the Kiyuky\ntribe, Kenya,\nJohn Ho Dalton, graduate student in economics, University of Cal¬\nifornia, specialist in African Affairs, former resident in Africa0\nNorth Africa\nRom Landau, U.S. advisor to the U„N, on Morocco, member of the\nfaculty of the American Academy of Asian Studies*\nEleanor Knight, former resident of Morocco, presently at the Uni¬\nversity of California,\nSupplementary Interviews\nRalph Bunche, interviewed on United Nations Trusteeship*\nMINORITY, REPORT 8 A documentary series of four twenty minute programs on the\nattitudes of Junior-High students on such subjects as raise, narcotics,\nsex, housing, parents and teachers* These programs were recorded on\nlocation at a Junior High school serving a lower socio-economic group* Many\nof the youngsters interviewed in this series are described by teachers and\nsocial workers as \"delinquent\" * The techniques used in assembling the\nprogram material was that of separate group interviews, conducted by a\nguidance counselor, of negro boys and white boys, negro girls and white\ngirls. The age of those interviewed ranged between fourteen and fifteen.\n\"Interview\" Is actually a misnomer for the material recorded in that it is\nentirely spontaneous and uncensored conversation between the teen-agers\nand the one adult in the program*\nTHE), LAW AND THE, PROPHETS: A series of six half-hour discussion programs devoted\nto an exposition of the jurisprudence of Justice Holmes, Benjamin Cardoza,\nlearned Hand, and others. The series will be produced in cooperation with\nthe San Francisco Bar Association and with various faculty members from\nBoalt Hall, University of California School of Law. Primary emphasis in\nthe series will be on the philosophy of law*\nARCHITECTURE* A series of conversations on contemporary American, particularly\nwestern styles of architecture. Participants in this series include six\noutstanding American architects* Bernard Maybeck, Frank Uoyd Wright, Pietro\nBelluschi, Edward Stone, Richard Neutra and W. W„ Wooster. Three half-\nhour programs."
}