{
  "id": "d730-93",
  "text": "Page 5\nMISGEIiLANEQUS PBOSRAMS\nThroughout the year many individual programs and series will develop at KPFA,\nyet at the present time it is not possible to predict the exact nature con¬\ntent of these programs. They will include interviews and panels with persons\nprominent in many different aspects of public affairsp the sciences and the arts0\nKPFA maintains program lines to various auditoriums on the campus of the Uni¬\nversity of California and the Station has permission to record lectures 9 discus¬\nsions, etc. held under the auspices of the University* Many of the programs thus\nobtained are valuable program material for educational broadcasters. It is\nestimated that there will be at least ten program hours available to KPFA\nthe NAEB Tape Network through these means. Potential program series Include a\nseries of lectures by outstanding scientists under the general topic \"Madera\nPhysics for Scientists and Engineers\" o Another potential program series includes\na group of five lectures on astronomy to be given by the Nobel Mne winner, Dr.\nBarold Urey of the Ifoiversity of Chicago. The procedure on these programs is to\nedit the recordings of the lectures, deleting those aspects of each talk which\ndo not lend themselves to broadcasts for the general public.\nII. SPECIAL PROGRAM PROJECTS\nKPFA is currently taking steps toward the establishment of a number of subsidiary\nprojects which would, in turn, result in programs for broadcast over KPFA and\nwould also be made available to the Tape Network of the N1EB. These program\nprojects will have independent operating budgets entirely separate from KPFA*a\ngeneral operating budget. Program production costs for these projects are not\nincluded in the cost summary set forth in this Memorandum. However, the series\nnoted here are indicative of the type of program material which will become\navailable through KPFA*s production center.\nOONFEBENQE ON PBPBLEMS Of QQmm^miQKMmm TEE EAST AND WEST* The pro-"
}