{
  "id": "d1098-2",
  "text": "do—things which are therefore left undone principally\nfor reasons of present expediency?\nLet me illustrate. Henry R. Cassirer, Director of\nRadio and Television for UNESCO, in the fall issue\nof Audio-Visual Communication Review, presents a\nvery challenging analysis of the peculiar potentials\nof the different media, comparing what each can do,\nor best do, with what other media can do. He points\nout that this is peculiarly an age of change, speed,\nmotion, instability, and lack of permanency. The\nprinted media, hard as they try, cannot convey the\nmost dramatic dynamics of this age. Print “freezes.”\nIt is just as inadequate to convey movements, pres¬\nsures, and change as still pictures are, in comparison\nwith moving pictures. Does this not contain implica¬\ntions for our use of these new media? Not to teach the\nsocial sciences, geography or any of the other subject\nmatters as they have so far been taught, but in a new\nway in which we finally have the tools adequate to\nthe job?\nAt present, we are inclined to start with the\nprinted syllabus, and use TV essentially as a visual\naid. I think TV challenges us to think about at least\ntwo more questions:\n1) With TV as a tool, is it not possible that for\nsome subjects, ana at some levels, TV should be the\ntext, and printed media should be the “printed aids”\nor “verbal aids” to do the “enlarging upon” what TV\ncan perhaps best present as a principal or primary\nmedium? Are we sure that eventually TV will not\nrevolutionize the concept of education as completely\nas the textbook (which created the classroom con¬\ncept of today) did a few hundred years ago? Or\nshould TV be used to “freeze” into permanency\npresent procedures and practices.\n2) Since TV can now do many things which we\npreviously did not have the tools to do, I wonder if\nthe curriculum of ten years hence will not look quite\ndifferent from today’s?\nWhen we got the automobile and misuses or care¬\nlessness in its use began to cause anxiety, we brought\nthe automobile into the educational plant and began\nto teach driver-training. When the pressures of com¬\nmerce on the school system became great enough\nwe began to teach typing and office procedures. Little\nby little the schools have taken over responsibilities\nwhich industry and the guilds used to assume: giving\nthe individual the training which his eventual em¬\nployer needs to have him have. I wonder if the needs\nof our time, and the multiplicity of needs for decision¬\nmaking on the part of the individual as a citizen do\nnot justify a re-analysis of how large a vocational\nrole the school can play in view of both the pro¬\nliferation of vocational specializations, and the great\nvast areas of (presently neglected) guidance in de¬\ncision-making as a responsible citizen, the use of\nleisure time as divided between entertainment and in¬\ndividual self-development (which I believe can also\nbe. “recreational”).\nOur generation was caught defenseless by tele¬\nvision particularly. Considering the advertiser as the\n“offense” and the viewer as the “defense,” the offense\nhas quickly outstripped the defense. The latter is\nstill not in any way responsibly equipped to cope with\nthe present situation.\nThere was a day, not too far in the past, when\npeople would “believe it”, if it was in print. Thanks\nto the schools, and education, people have been given\nguidance in coping with the printed media. Children\nare taught to distinguish between good and bad writ¬\ning . They are taught appreciation of literature. They\nare beginning to be given clues regarding “phoniness”\nand how to recognize it. Nearly every teacher in the\neducational process becomes an English teacher (of\nthe written and printed word). Is the time not here\nwhen we should teach how to distinguish good and\nbad in the electronics media, too? In view of the time\ndevoted to television and radio as sources of infor¬\nmation, senses of values, and entertainment, are we\nnot overdue for courses in analysis and criticism in,\nand guidance in coping with, these powerful media?\nCan we do this (which I consider education for\ncitizenship) while still retaining all the vocational\nand other courses we now have? Or is our national\nprestige and mentality not yet in sufficient jeopardy\nto justify such a step? If such a responsibility is\nseen by education (and I can think of no one else who\nis obligated to assume it), won’t all teachers need\nto be trained to teach this broad nonwritten new\n“language” responsibility much as all teachers now\nteach written English?\nThese are some of the questions I would raise\nabout TV’s role in education. And those who know\nme well enough know that I ask you to remember\nradio as well as television in all my considerations.\nI would hope that we will all participate in far\ndeeper thinking than how TV can do the same job\nbetter (though this is part of it) or cheaper (medical\nservice is a better—but not cheaper—than it used to\nbe; is it not worth it?), or for purposes of “doing it by\nTV” merely in order to justify larger TV staffs and\nbudgets.\nWhat we need is better education, not cheaper\neducation. What we need is education which will help\nour students to be better citizens in the year 2,000.\nAre we sure that the uses we are thinking about for\nETV today will do that?\n* * * * 45-\nIn future columns I would like to discuss with you\nother problems, from effects and possible educational\nuses of video tape, the redistribution of faculty per-\nJULY, 1958\n3"
}