{
  "id": "d1098-5",
  "text": "dynamics of the new media to disintegrate our exist¬\ning values.”\nLeonard Marks, legal representative for the\nNAEB, indicated that broadcasters are showing in¬\ncreased awareness of their responsibility in forming\npublic opinion.\nFrederick H. Garrigus, manager of organizational\nservices for NAB, said informational and educational\nprogramming on both commercial and educational\nbroadcasting stations are going through a process of\nimprovement in using more ingenuity, thought and\nplanning in the presentation of programs.\nMr. Garrigus thought that educators and com¬\nmercials are showing more willingness to communi¬\ncate. He found an increased awareness of the need for\nmore ingenious and thought-provoking programs\nalong with a growing response on the part of the\naudience to educational programs presented on com¬\nmercial stations when the programs are thought-\nprovoking and professionally presented.\nThe conference ended' with reports of discussion\nleaders who commented on the deliberations of their\nindividual groups which were divided according to\nlevel of instruction interest.\nThe success of the conference was indicated in\ncoverage stories of newspapers and publications such\nas the New York Times, The Washington Post and\nTimes Herald, Radio-TV Daily, and Broadcasting.\nProgram chairmen, speakers, and panelists in¬\ncluded: Robert C. Anderson, director of the Southern\nRegional Education Board, Atlanta, Ga.; Dr. William\nG. Carr; Henry Chadeayne, station KETC-TV, St.\nLouis, Mo.; Kenneth A. Christiansen, program man¬\nager of the ETRC, Ann Arbor, Mich.; A. J. Foy\nCross, professor of education at New York Univer¬\nsity; Edgar Dale of the Bureau of Educational Re¬\nsearch, Ohio State University, Columbus; Franklin\nDunham, chief of Radio-Television Services, Office\nof Education; Dr. Novice G. Fawcett; Marion B.\nFolsom; Fred E. Garrigus; William G. Harley, pro¬\ngram director of station WHA-TV, University of\nWisconsin and chairman of NAEB television af¬\nfiliates; and Charles F. Hoban, of the Human Factors\nStudy Center, University of Pennsylvania, Phil¬\nadelphia.\nOther leaders were: Richard B. Hull, director of\nRadio and Television Broadcasting, Ohio State Uni¬\nversity, Columbus; Armand L. Hunter, director of\nstation WKAR-TV, Michigan State University, East\nLansing; Dr. John E. Ivey; Hideya Kumata, Com¬\nmunications Research Center, Michigan State Uni¬\nversity; Harold B. McCarty, director of the Radio TV\nEducation division, University of Wisconsin, and di¬\nrector of Wisconsin State Broadcasting Service; Mar¬\nshall McLuhan; Leonard H. Marks; Miss Wanda B.\nMitchell; Dr. Burton Paulu, director of Radio and\nTV, University of Minnesota; Wayne 0. Reed, deputy\ncommissioner of education, Office of Education,\nWashington; John J. Scanlon, deputy director of re¬\nsearch, The Fund for the Advancement of Education,\nNew York; Charles F. Schuller, president of the NEA\nDepartment of Audio-Visual Instruction and director\nof the Audio-Visual Center, Michigan State Univer¬\nsity; Mendel Sherman, associate professor of educa¬\ntion, Audio-Visual Center, Indiana University,\nBloomington; David C. Stewart, assistant executive\ndirector, JCET, Washington; Alexander J. Stoddard,\nconsultant for the Fund for the Advancement of Edu¬\ncation; John W. Taylor, manager of station WTTW-\nTV, Chicago; and Dr. I. Keith Tyler, director of the\nInstitute for Education by Radio-Television, Ohio\nState University.\nThe conference planning committee consisted of\nFranklin Dunham and Mrs. Gertrude G. Broderick\nrepresenting the U. S. Office of Education. From\nthe NAEB were Dr. Burton Paulu, Richard B. Hull,\nDr. Harry J. Skornia, and Leonard Marks.\nPROGRAM GRANTS-IN-AID\nAWARDED TO SIX INSTITUTIONS\nGrants-in-Aid totalling $40,512 have been given to\nsix institutions to aid in the production of eight ed¬\nucational radio program series following the general\ntheme of “The American in the Twentieth Century.”\nFrom thirty-seven applicants, the NAEB Grants-in-\nAid committee selected the six winners for recom¬\nmendation to the ETRC, who awards the grants.\nTwo of the institutions, the University of Mich¬\nigan and the University of Wisconsin, were given\ngrants for producing two series each. One of Wis¬\nconsin’s series, “The Lives of Man,” and the State\nUniversity of Iowa’s “Why Is a Writer?” are both in¬\nschool series designed for use in the upper elementary\ngrades.\nGrants were awarded to: the State University\nof Iowa, station WSUI, for “Why Is a Writer?” (in¬\nschool) ; the Lowell Institute Cooperative Broadcast¬\ning Council, station WGBH, for “The Creative\nMethod;” and the University' of Michigan, station\nWUOM, for “News in Twentieth Century America”\nand “American Composers’ Twentieth Century Al¬\nmanac.”\nOther grantees were,: the University of North\nCarolina, station WUNC, for “American Ideas in the\nTwentieth Century;” Purdue University, station\nWBAA, for “The American Negro;” and the Univer¬\nsity of Wisconsin, station WHA, for “The Lives of\nMan” (in-school) and “Light Unto My Feet.”\nThis is the second in the ETRC’s three-year sup-\nNEWSLETTER"
}