{
  "id": "d1098-9",
  "text": "TV TECHNICAL TIPS\n—Cecil S. Bidlack\nOn May 28th, the Federal Communciations Com¬\nmission extended the date for compliance with para¬\ngraphs 3.690 and 3.691 of Part 3 of its rules govern¬\ning Radio Broadcast Services. This extended date is\nJune 1, 1959. These are the paragraphs which re¬\nquire television transmitters to have frequency and\nmodulation monitors. In its release, the Commission\nstated that with the continued development of more\nstable frequency control circuits in all types of broad¬\ncast transmitters (AM, FM, and TV) it is consider¬\ning a review of its requirements on the continued use\nof such apparatus. Should it appear that the rules\nrelating to such monitors need to be amended, an ap¬\npropriate rulemaking proceeding will be initiated.\nOn June 9th the Commission also adopted an\namendment to its rules for non-commercial educa¬\ntional FM stations regarding its CONELRAD rules\nconcerning these stations. Section 3.573 (b) has now\nbeen amended to refer educational stations to the ap¬\npropriate section 3.1003 (a) of CONELRAD rules\nrather than to the commercial FM remote control\nrules as formerly.\n*****\nOur picture for this month illustrates a “boor-\nmobile'’ developed by John Boor of KCTS in Seattle,\nWash., for use in schools in their area. The antenna\nis readily demountable and is at a height of approxi¬\nmately 6V2 feet so that persons of ordinary height do\nnot bump their heads on it. The five-element Yagi\nantenna for channel 9 is of commercial make as well\nas the cart, so that total cost of cart and antenna is\naround $25.00.\nIn addition to the picture Boor has supplied us\nwith a list of what he considers highly desirable fea¬\ntures for a TV receiver to be used in a classroom:\n1) Flat tinted glass, tilted forward over the pic¬\nture tube.\n2) Four-inch beveled light shield around the pic¬\nture tube.\n3) Front speaker, eight-inch minimum.\n4) Long heavy AC cord.\n5) Cart with large rollers.\n6) Yagi type demountable antenna on 6y2-foot\nmast.\n7) Simple operation from front.\n8) Twenty-one-inch screen.\n9) Controls on back for all adjustments—height,\nwidth, H and V line centering; H and V hold,\netc.\n10) High definition video circuits—five hundred\nlines.\n11) Transformer power supply with paralleled\nfilaments.\n12) RF—video switch for air or closed circuit use.\n13) Separated audio input.\n14) Loop AC from set to set.\n15) Loop audio from set to set.\n16) Loop video from set to set.\n17) Frequency corrected audio—curtailed below\n200 N.\n18) Five-watt minimum audio output.\n*****\nWe’d like to call your attention to the April 1958\nRCA Broadcast News as it contains a number of items\nof interest for both radio and television engineers.\nThis issue contains a detailed description of how the\nRCA Videotape. Recorder operates, as well as articles\non automation in television programming, precision\noffset TV carrier operation, design of a combination\ncontrol room/announce booth in addition to the\nusual descriptions of radio and television equipment\ninstallations. Technical details of a new 500 - 1000\nwatt am transmitter, a 2 kw VHF television trans¬\nmitter, a universal coaxial transmission line, and a\nnew ultra-directional television microphone are also\nincluded.\n—N A E B—\n10\nNEWSLETTER"
}