{
  "id": "d519-106",
  "text": "4,\nJOSH: I don't know.\nRICK: 1*11 go out and phone the police. No! Let’s see what\nhappened first.\nJOSH: I don’t know, I came home five minutes ago. I was hardly\nin the door when Mrs. Burnett came up here and accused me, at\nleast she seemed to accuse me, of beating Harriet. She said the\nwoman downstairs heard her screaming \"help me! Help met\nI’m being murdered!\" I suppose she thinks I did it.\nRICK: How did you come home ? On the usual bus ?\nJOSH: No! No! I came home by subway! I wanted to get home\nearlier!\nRICK: Great Scott! man! The subway is no alibi! Let's see now!\nI'd better not phone the police! Not yet!\nJOSH: Harriet! Harriet! Dearest! No, it can’t be!\nRICK: Pull yourself together, man! You're in serious trouble!\nI’ll help you! Let’s put this back first. We'll get rid of the body.\nJOSH: No! No! Nothing like that! Go tell the police! Nothing\nmakes any difference to me now.\nRICK: Josh, think! They’ve got you dead to rights. The circum¬\nstantial evidence is overpowering. We've got to think of something.\nJOSH: Let me alone! I can't think of anything else but that Harriet\nis dead! Nothing else. Tonight of all nights! I don't care what\nhappens to me now! Call the police!\nRICK: I'll swear that you were with me!\nJOSH: I don’t want to live anymore. I'm finished.\nMRS. BURNETT: Here it is, officer! Blood!\nRICK: So what, Mrs. Burnett? Mrs. Reynolds cut herself as she\nwas sewing, with a scissors.\nMRS, BURNETT: How do you know? Were you down here?\nRICK: No! She came upstairs to me to have me bandage it.\nMRS. BURNETT: It's a lie! She wouldn't have had time! They're\nclose friends, him and Mr. Reynolds. He’d lie about anything to\nsave him! Where is the body?\nRICK: Harriet? She's sleeping in the bedroom\"\nJOSH: No, no, Rick! It's no use! Don't lie for me! My wife is\ndead! I've seen her - murdered, murdered! I've seen her lying\ncold underneath. . .\nHARRIET: Ladies and gentlemen?\nPOLICEMAN: Well, I guess that about settles it! How about all of\nus getting out now ?\nMRS. BURNETT: But he said he had seen his wife murdered!\nI'll bet that Mrs. Reynolds has a twin sister!"
}