{
  "id": "d519-108",
  "text": "6.\nHARRIET: Oh Josh, what big words we have always used! What\ndoes the word '•forever'1 really mean? Now tonight I think for the\nfirst time I realized,\nHARRIET: Why, you're tired dearest, very tired. Come rest\nyour head o n my lap. Trala-la-la-la, tra-la-lala-la. I'll love\nyou forever! Mm mm... mmmm-mmmm-I'll love you faithfully,\nalways. Forever, darling.\nSCENE THREE\nSIGNOR ALBERTO: Ah, Mr. and Mrs. Reynolds! I see that you're\nquite on time! Tonights the night!\nHARRIET AND JOSH: Tonight's the night! We wouldn't be late for a\nmillion dollars!\nSIGNOR ALBERTO: Chianti?\nJOSH: Yes, Chianti as usual! Yes the same!\nHARRIET: Yes, the same! Isn't it all wonderful! It's all the same,\njust as always. May it never, never change!\nJOSH: Oh, Harriet! It's slipping! And not a drop of blood inside it!\nHARRIET: No blood inside it ?\nJOSH: No blood! Now, don't you think you'd better explain?\nHARRIET: Oh, explanations are very boring.\nJOSH: This one will not be.. , at least to me! Now come on and tell\nme! How did you disappear ? Did you crawl out from behind the divan\nto the bedroom? How did you get into the bedroom?\nHARRIET: Oh that? That was nothing! So easy, really, my love!\nJOSH: How did you get out from under the divan?\nHARRIET:' I crawled out from underneath it, made my way to the\nbedroom door. , .you two were much too busy; never saw me close the\ndoor! Never saw me!\nJOSH: Oh, I see! You wanted to teach me a lesson, didn't you?\nIt was \"I love you better than my own life!\"\nHARRIET: Yes, that was it. In fact, I was fairly horrified when I\nheard you and Rick talking about how to get rid of my body.\nJOSH: No! That was Rick! Only Rick, alone! I was too upset to\nattempt an alibi!\nHARRIET: I remember that! I'll always remember that! And a good\nthing, too, or else I'd never have come back.\nJOSH: \"Never have come back\"? And left me sitting here with the\ncircumstantial evidence! Fie on you Mrs. Reynolds!\nHARRIET: Well, not quite. No quite. Everybody is dancing! Come on.\nJOSH: Alright."
}