{
  "id": "d519-49",
  "text": ">\n9\nShould the Jury consider that the quality of the works submitted does\nnot justify the awarding of the prize, the amount shall be turned over to\nthe reserve funds provided for in Art. 32.\n11\nAll Organizations participating in the Italia Prize are strongly rec¬\nommended to broadcast, if possible by their own production, the winning\nentries, within the twelve months following the awarding of the Prize.\n12\nEntries submitted must have a minimum duration of 2$ minutes and must\nnot exceed 8£ minutes.\n13\nThe Juries for the Italia Prize and for the additional Prizes shall be\nformed as follows:\nEach year the ordinary General Assembly, mentioned in Art. 2U, shall\nform, for the following year, as many Juries as are the categories of en¬\ntries to which the Italia Prize and the additional Prizes are to be awarded.\nThe seats in the various Juries shall be divided among all the Organizations\nparticipating in the Italia Prize. No Organization may be appointed two\nyears consecutively to attend on the same Jury.\nEach Organization may be appointed to attend on only one Jury and may\nsend, as Juryman, a broadcasting expert of its choice.\nlh\nEach Organization may submit two musical compositions with words, two\nliterary or dramatic works with or without music as well as the works men¬\ntioned by the additional Statutes.\nHowever an Organization appointed to attend on a Jury may not submit\nany entries to that same Jury.\n20\nEntries submitted by the Organizations participating in the Italia Prize,\nmust reach the Secretariat at least six weeks before the meeting of the Juries.\nEntries forwarded to the Secretariat of the Italia Prize shall consist\nof:\nFor musical works:\na) two recordings of the work;\nb) at least two copies of the musical score;\nc) a sufficient number of copies of the English and French transla¬\ntions of the text;\nd) explanatory notes on the work.\nFor literary or dramatic works:\na) two recordings in the original language;\nb) when necessary, a copy of the musical score;\nc) a sufficient number of copies of the English and French transla¬\ntions of the text;\nd) explanatory notes on the work."
}