{
  "id": "d519-99",
  "text": "THE WISH.\nSCENE ONE (SYNOPSIS)\nHarriet and Joshua Reynolds are a young American married couple,\nutterly in love with one another. They live together in a small apartment\nin that quarter of New York called Greenwich Village. The opera opens\nupon the morning of an important celebration for them. It is the\nanniversary of the night, four years ago, when they first met one another\nat a local cafe, \"Alberto’s''. They always celebrate this day in the same\nway; fir3t of all they make one another small inexpensive presents, more\nas a joke than anything else; then they have a cake made with an in¬\nscription such as \"I Love You Forever\" or \"I Love You More Than Life\",\nwith as many candles as years---this year the cake will have four\n.andles. And, at night, they celebrate again at the same table at\nAlberto's where they originally met. It is a charming little ritual; and,\nas the curtain rises, they both bounce out of the bedroom, to unwrap the\npresents both have left for the other the night before. They talk about\nthe inscription which will go upon their anniversary cake this year,\n\"I Love You Forever. \" Harriet, suddenly serious, asks Josh \"Do you\nreally believe that we love one another that much? Beyond life?\nForever?\" She says that she knows she does; and Josh says that he\nknows it too.\nJosh is about to get ready to go off to work when his best friend,\nhis boyhood friend, Rick Daggert, comes in with a box which, when\nopened, proves to be the cake which, otherwise, Josh was going to\norder on his way to the office. Josh thanks him deeply, and leaves for\nthe office. Alone with Rick, Harriet takes a kitchen knife and poises it\nabove the cake, as if she were going to cut it. Rick stops her, saying\nthat it is for tonight; she will spoil it. Harriet asks him, coldly,\n\"why, is it poisoned?\" Rick first pretends not to understand but, as\nshe tells Rick that she has recently become aware that he has been\ntrying to poison Josh, he breaks down, admits that it is true, and that\nhe has been trying to do so because he is so in love with her, Harriet.\nIncredulous, Harriet asks him why he did not tell her all this a long\ntime ago. \"I could have gotten you out of this\" she tells him in a\nrather sympathetic and sisterly way. With strange emphasis, however,\nRick tells her that \"for people like me it is sometimes easier to do than\nto talk. It takes a lot of courage to attempt a murder! \" This antago¬\nnizes Harriet again, and she answers \"With poison. . . . that's a woman's\nway. \" Rick, unable to take this taunt, gets up and runs out of the\napartment, leaving Harriet alone. She looks at the cake with four\ncandles, and has an idea. She will make a wish. She lights them, prays\nthat her wish might come true, and blows-but, alas, only three of them\ngo out---which means that she will not get her wish. The curtain falls\nas she looks at the cake and the one remaining burning candle with a look\nof the deepest disappointment.\nSCENE TWO\nThe curtain goes up on the same apartment, but now it is evening, around\nseven thirty. There is an agitated strange feeling in the air. Josh comes\nhome, looks about for Harriet, picking a poker from the floor and putting\nit back at the fireplace. A landlady, Mrs. Burnett, bursts in and accuses\nJosh of beating his wife. Astonished, Josh asks her why. Mrs. Burnett\nsays that only three minutes ago she heard Mrs. Reynolds screaming\nthat she was being murdered; obviously she believes that Josh was the\nculprit. Josh, alarmed, looks through the apartment, while Mrs. Burnett,\ngazing at the floor, discovers a blood 3pot, and runs out of the apartment.\nJosh decides to signal Rick, who lives in the apartment upstairs, to come\ndown to help him find Harriet. He does this by knocking on the radiator\npipe; and an answering signal comes from Rick, upstairs. Before Rick\narrives, however, Josh discovers Harriet, apparently dead, spread\nout beneath the divan which he has moved away in his search. He tries\nto revive her, listens inexpertly to her heart, believe that she is dead."
}