{
  "id": "d1586-10",
  "text": "*11-\nREPQRT ON NAEB ADULT EDUCATION PROJECT\nThe NAEB Adult Education Project has now moved into the active production phase in\nall four fields in which programs are to be developed, it is reported by Wm. Harley,\nproject coordinator.\nFour of the programs in the 11 Jeffersonian Heritage1’ series are now finished and an¬\nother four will be produced the last two weeks in May when Claude Rains, starred as\nJefferson, returns from London* The completed programs deal with Jefferson’s ideas\nabout the Declaration of Independence, freedom of religion, freedom of the mind, and\nequal and exact justice* All were written by Morton Wishengrad; Milton Geiger has\nbeen brought out from the West coast to d o the remaining programs and is now working\nwith the consultant, Dumas Malone• The Jefferson s eries will be released to NAEB\nstations the first week in June*\nFive full-hour documentary programs on the U.S.S.R. are being produced in the series\n’’People Under Communism.” These programs dealwith: Soviet diplomacy $ controls in the\narts; secret police system; the Soviet factory workers; and communism in Asia* It is\nplanned to produce the complete series by April 30*\nProduction on the \"Ways of Mankind” programs begins the week of April 20th in Toron¬\nto. Andrew Allan, chief of production for CBC, will direct*\nThe Washington project originally planned as the feature of the public affairs area\nhas been dropped, and has been replaced with four pilot projects;\nInternational discussion sen.es in cooperation with BBC and CBC. The\ndirector of the Third Program is being brought over for the planning\nconference. (He will also discuss possibilities for sharing further\nThird Program materials with the tape network.)\nRecorded interviews and discussions from Europe under supervision of\nMilton Mayer.\nTalk-back discussion programs using recorded comments from people about\nthe country in response to experts’ views.\nA series of 26 quarter-hour talks on communications using leading figures\nin government, education, and industry.\nPOSITIONS AND HELP VOTED\nPosition Wanted; Doctoral candidate New York University (B.S. and M.A. from NYU)\nwishes position in communications. Background in science education and human rela¬\ntions work, teaching experience high school and university I.vels. Special interest\nin educational radio and television writing. Frank Wolf, 300 West 109 Street, New\nYork 25, New York.\nHelp Wanted; Program Director for 1000 watt University educational station* Idea\nman with creative abilities and experience in script writing and production. Mature,\nmarried man preferred, midwestern background, college degree, who enjoys working with\ncollege students. Some teaching duties required. Send disc, script, and complete\ninformation to KUSD, Vermillion, South Dakota.\nHelp Wanted: Production Director for 1000 watt University educational station. Posi¬\ntion requires experience in production and script writing, announcing and supervision\nof student staff. College degree with midwestern background. Knowledge.of all types\nof music desirable. Send disc, scripts, and complete information to KUSD, Vermillion,\nSouth Dakota."
}