{
  "id": "d1586-12",
  "text": "-13-\nCOMPTON SAYS SOVIET AFRAID OF AMERICAN BROADCASTS\nA State Department official says the Soviet Union is taking drastic measures to keep\ntheir people from listening to - the Voice of America.\nWilson Compton, Chief of the Departments International Information Administration,\nsays the Soviet Government has ordered electric current cut off in Soviet and satel¬\nlite rural areas during the peak broadcasting hours of The Voice. Compton also said\nsevere penalties are imposed on people in the Soviet Union and the satellite areas\nwho are caught repeating anything heard on the Voice broadcasts.\nHe says 75 per cent of the broadcasts get through to some areas of the Soviet Union\ndespite the fact that Russia has nearly one thousand radio stations trying to '’jam'1\nthe programs. In Moscow and Leningrad—where jamming is particularly heavy—he says\npenetration drops to about 25 per cent.\nRED-WHITE-RED NETWORK FIGHTS COMMUNISM IN AUSTRIA\nThe battle of the radio networks in the tiny but important Republic of Austria is a\nhot spot in the cold war against Communism.\nThe American-sponsored Red-White-Red Radio Network runs far ahead of the Russian\ncontrolled RAVAG in popularity. According to a recent survey, 76% of the Austrian\npublic prefer RWR, which is good news for the U.S. Department of State, since Austria\nunder 4-power occupation, straddles the Iron Curtain. The RWR headquarters in the\ncapital city of Vienna are more than one hundred miles within the Russian zone. Low¬\ner Austria itself is Russian occupied and surrounded by Hungary and Czechoslovakia,\ntwo Red satellites.\nA typical example of the American drive for goodwill is a recent program sponsored by\nRWR with all proceeds donated to the reconstruction fund for St. Stephans Church, one\nof Austria’s most celebrated landmarks. The immense Vienna Concert House, famed as\nthe Austrian headquarters for music, echoed to sounds ranging froma symphony orches¬\ntra, to the Deutsch-Master Band which was the pride of Old Vienna, and a quiz show\nwith audience participation for cash prizes.\nThe SRO house responded to the spirit of the program. Mrs. Paula Konrad, an elderly\nViennese who has known better days, insisted that her first prize of 2000 schillings\n(an average family’s monthly earnings: 1600 schillings) from the quiz show join the\nkitty. Other contestants followed suit. Altogether, RWR raised 25,000 schillings\nfor St. Stephans, money which was subsequently presented to Cardinal Theodor Innetzer\nin the name of the Austrian people.\nCatholic Austria liked the idea of the Americans taking such an interest in the\nchurch project. Since German is a second tongue to the Czechoslovaks and the Hungar¬\nians, and they too are predominantly Catholic, the broadcast captured new friends\nacross the borders where the Reds discourage church activities. A number of letters\nfrom foreign listeners found their way through censorship to the RWR offices in\nVienna.\nCBC SETS UP TRAINING SCHEDULE\n- A training course for 60 new television employees has been started in Toronto and\nMontreal by the Canadian Broadcasting operation. Included in the tra. ning group are\npersonnel who will handle technical and creative elements of TV programs when CBC\ntelecasts begin next August or September. By that time CBC expects to have almost\n200 trained TV workers in the two cities."
}