{
  "id": "d1586-15",
  "text": "-16-\nMORE ON EQUIPMENT\nThe tape network is now the proud owner of two Ampex 300, rack-mounted, recorders.\nThese are part of the results of the engineering conference reported in the February-\nMarch News-Letter.\nThe main function of these machines is to provide the playback copy that goes on the\nmass duplicator. The long range plans call for more and more programs to be supplied\nto the network on 1$ i.p.s. original tapes. These will be reduced to 7f i.p.s. on\nthe Ampex1s. Programs received on disc will also be recorded on tape on these\nmachines.\nThis installation, together with some related equipment, will enable us to put the\nfinest obtainable tape on the playback circuit of the duplicator• ■\nIn addition to the Ampex's we are now equipped with a splendid speaker and amplifier\nsystem for monitoring programs. Poor recording becomes instantly obvious. On order\nwe have the necessary test equipment to insure that all of our equipment is operating\naccording to rigid standards.\nThis all means better tapes for the networkl\nRESEARCH REPORT\nPrepared by Dallas Smythe\nNAEB Director of Studies\nUniversity of Illinois, Urbana\nTHE PSYCHOLOGY OF BROADCASTS ON TOLERANCE\n\"Brotherhood Week\" was recently observed and it is assumed that educational broadcas¬\nters did some programming along this line. The question naturally rises whether the\nappeals in programs designed to build racial tolerance are effective. Usually such\nprograms stress heavily appeals to reason, to moral values (including Christian com¬\npassion), and to patriotic values. As a practicing social scientist the educational\nbroadcaster is presumably interested in knowing what effects such programs have.\nSince the target for them is the prejudiced person, the question revolves around the\nreactions of the prejudiced to such appeals. The un-prejudiced, by and large, don't\nneed to be needled. Is it possible that far from making the bigot less prejudiced,\nsuch programs might even have the opposite effect?\nHere is a very practical problem. Practical and pertinent information on it is pro¬\nvided by a study of the personality, done by psychologists, to which we call your\nattention. The book in question is The Authoritarian Personality published by Harper\n& Bros. (New York, 1950, $7.50) and written by T.W* Adorno, Else Frenkel-Brunswik,\nDaniel J. Levinson, and R. Nevitt Sanford.\nThe problem set for the authors was the question. What is there in the psychology of\nthe individual that renders him \"prejudiced\" or \"unprejudiced\"? What does the term\n\"authoritarian personality\" mean? In character terms, the authors describe its as\nfollows:\n\"In contrast to the bigot of the older sytle he seems to combine the ideas and\nskills which are typical of a highly industrialized society with irrational or\nanti-rational beliefs. He is at the same time enlightened and superstitious,\nproud to be an individualist and in constant fear of not being like all the\nothers, jealous of his independence and inclined to submit blindly to power\nand authority.\""
}