{
  "id": "d1586-18",
  "text": "-19-\nThey liken most programs against prejudice to treatment of synptoms rather than of the\ndisease itself. And they express the hope that\nnKnowledge of what the potential fascist is like•••will make symptomatic\ntreatment more effective* Thus, for example, although appeals to his reason\nor to his sympathy are likely to be lost on him, appeals to his conventional¬\nity or to his submissiveness toward authority might be effective.•.Similarly,\nit is consistent with what we know of the potentially fascist personality to\nsuppose that he would be iirpressed by legal restraints against discrimination,\nand that his self-restraint would increase as minority groups became stronger\nthrough being protected,\" (p. 973—14-)\nDiscounting the possibility of \"curing\" the prejudiced by means of psychotherapy (the\nhuge size of the task and the small number of therapists), the authors point to the\ngreater desirability of changing the child-rearing pattern of our nation to the end\nthat \"children be genuinely loved and treated as individual humans\" in order to grow\ninto adults capable of seeing themselves and being themselves, rather than adults\ntortured with ethnocentrism. Yet they recognize that to change the child-rearing pat¬\ntern will require changes in the economic and political organization of society and\nthey charge all social scientists with responsibility for developing the program for\nthese changes.\nSignificantly for us who work with the mass media, their last conclusion is that no\nlasting increase in people's capacity to see and be themselves, can be expected from\nthe devices of manipulation. They lay responsibility on the mass media with the\nconclusion, \"That people too often cannot see the workings of society or their own\nrole within it is due not only to a social control that does not tell the truth but\nto a 'blindness' that is rooted in their own psychology.\" Finding that the \"potenti¬\nally fascist pattern\" is to \"a large extent imposed upon people\" the authors hold\nhope that the resources of the population will resist it. Finally, they conclude\nthat \"we need not suppose that appeal to emotion belongs to those who strive in the\ndirection of fascism, while democratic propaganda must limit itself to reason and\nrestraint. If fear and destructiveness are the major emotional sources of fascism,\neros belongs mainly to democracy,\"\nAt most, all this kind of summary can do is tease you into reading this pioneering\npiece of research. Its practical usefulness for the educator can hardly be over¬\nstated, But before you plunge into the reading of it, let me give you a warning.\nHere is no slick package of formulae; while the writing is straight-forward, the\nauthors have been concerned more with scientific accuracy than with dressing their\nfindings in popular prose. Be prepared to p^r for your new-won knowledge with some\nmental effort."
}