{
  "id": "d1586-8",
  "text": "KUOM OFFERS LENTEN MUSIC SERIES\n-9-\nKUOM, the University of Minnesota radio station, this year expanded its Lenten music\nprogramming into a two-week \"Lenten Music Festival\" which ran from April 1 12. Music\nDirector Ray Christensen, who produced the festival, selected music \"to convey the\nspirit of Easter.\" The programs were aired from 6-7 p.m. daily and 2-5 p.m. on\nSaturdays•\nHighlight of the series was the Good Friday broadcast of Wagner»s Parsifal. KUOM has\nbroadcast portions of Parsifal during past Easter seasons, but this year listeners\nheard the complete opera — hi hours long — aired for the first time in this area.\nChristensen added an interdenominational flavor to the Lenten Music Festival by invit¬\ning Twin City ministers to appear on the programs with comments about each featured\nwork and its relation to the Easter season. Before the series began a KUOM production\nteam visited the churches of participating ministers to record their remarks.\nSome of the outstanding music aired during KUOM’s festival included the Easter Canta-\nta> St. John’s Passion and St. Matthew’s Passion by Bach; The Resurrection Story and\nSeven Words from the Cross by Schuetz; The Ascension by Massaien; a special all\nchoral concert, and about bO other works.\nChurches, music stores and newspapers cooperated to give the series publicity. Minne¬\napolis and St. Paul music critics used the festival as a news peg and then went on to\nlaud KUOM’s serious music programming which is unique in its area. The newspapers\nalso carried other stories about the programs as did church newspapers and bulletins.\nMusic stores mailed and passed out brochures and arranged window displays.\nWUOM OFFERS UNUSUAL \"TALK BACK\" BROCHURE\nThe Ifoiversity of Michigan's WUOM has prepared an interesting little brochure based\nupon commits from letters entitled »0n Talking Back to a Radio Station,\" The bro¬\nchure begins with the following statement}\n\"Ten hours a day for more than five days a week WUOM speaks to its audience\nthroughout Michigan. It speaks in English, in the universal language of\nmusic, and once in a while in French, Gentian, Hindustani, and Japanese.\n\"It speaks on matters of interest to children of kindergarten age...and to\nadults who have started their years of retirement. It speaks to businessmen,\nhousewives, professional people, students, merchants, and teachers. It speaks\nto the city’s shop girls and factory workers, and to the country’s miners,\ngrowers, and dairymen.\n\"What WUOM speaks about is as diversified as the audience it reaches:\nliterature, sporting events, folk and classical music, science and re¬\nsearch, and current news in the world today.\n\"But this is not a soliloquy. The audience frequently talks back.\n\"For your information we’ve selected and grouped a few typical comments from\nthe WUOM mailbag...\"\nThere follow four pages of comments from listeners' letters, each section being in¬\ntroduced by a description of the programs on which the letters comment. Copies of\nthe brochure may be had upon request to Waldo Abbot, MAEB Region III Director, who is\nDirector of WUOM."
}