{
  "id": "d1201-1",
  "text": "NAEB NEWS LETTER\n-2-\nOCTOBER I, IS4I\njn Defense.” The weekly broadcasts will come direct from the classroom\nof New York University,, The broadcasts will bring home-bound New\nYorkers the voice of Professor A. Anton Friedrich, plus the interrogation\nof students and class recitals, as well as guest lectures when specialized\nSUBJECT MATTER IS DISCUSSED. ?n the initial broadcast, two other members\nof THE NYU FACULTY, PROFESSOR LoIS MACDONALD ANO PROFESSOR J. D. MAGEE,\nWILL ALSO TAKE PARTo THE PROGRAM WELL DEAL WITH “WAGES AND THE PRICE\nSpiral.”\nNEW YORKERS HEAR EDUCATIONAL BROADCASTS\nNew York radio listeners now have an opportunity to listen to the best\neducational and social-service type of programs broadcast by stations\nas distant as Oreqon, and to learn of the civic progress in such towns\nas Ithaca—all without the benefit of high-powered radio receivers or the\nNEED FOR EXTENSIVE NETWORK LINKS.\nSEPT. I I\nFor onAthe New York municipal station began broadcasting a series\nFEtATURING TRANSCRIPTIONS OF PUBLIC SERVICE BROADCASTS NEVER HEARD IN NEW\nYork—programs of the non-commercial type that networkds don*t “feed” but\nWHICH NEVERTHELESS HAVE A GREAT EFFECT ON THE LIVES OF THE MILLIONS OF\nAmericans living outside the larger cities.\nSome transcriptions in the series, known as “Documents of Learning,”\nDRAMATIZE PROBLEMS OF JUVENILE DELINQUENCY MET WITH IN FARM TOWNS AND TELL\nOF THEIR SOLUTION; OTHERS TELL OF THE NEED FOR REFORESTATION IN RURAL\nAREAS OR ILLUSTRATE THE WORK OF STATE UNIVERSITIES DRAMATIZING CLASSICS\nFOR SMALL-TOWN LISTENERS.\nThe PROGRAMS CHOSEN ARE SELECTED NOT ONLY FOR THEIR DRAMATIC INTEREST TO\nTHE AVERAGE NEW YORK LISTENER, BUT ALSO TO ILLUSTRATE THE WORK OF THE\nNAT I ON ® S EDUCATIONAL STATIONS AND THE WAY IN WHICH RURAL COMMUNITIES ARE\nMEETING THEIR UNIQUE PROBLEMS. THE TRANSCRIPTIONS ARE FORWARDED FROM\nSTATIONS THAT ARE MEMBERS OF THE NATIONAL ASSOCIATION OF EDUCATIONAL\nBroadcasters to WNYC, also a member of the Association.\nTranscriptions scheduled for broadcast by WNYC include two fifteen\nMINUTE PLATTERS MADE AT WHA, THE WISCONSIN STATE STATION. ONE OEALS WITH\nTHE CONSERVATION OF SUCH RESOURCES AS OIL, TIMBER AND WATER, THE OTHER\nINTRODUCES A CHARACTER FAMILIAR IN WISCONSIN KI40WN AS “RANGER MACK,” WHO\nDRAMATIZES THE PERIL OF CARELESSNESS IN THE TIMBER LANDS.\nAlso, a transcription made at WILL, the University of Illinois station\nAT URBANA, WILL BE HEARD VIA WNYC. THIS THIRJV-MINUTE PROGRAM FEATURES\nA CONDENSED VERSION OF CHRISTOPHER MARLOWE S UR. FAUSTUSo VNO QUARTER\nHOUR DISCS CAME FROM KOAC—THE RADIO EXTENSION DlV IJ«ON OUTLET OF THE\nOorrsnw Svctfm OF HIGHER EDUCATION. ^HE TITLES ARE jETTING\nOregon System of Higher Education.\nOthers'1 and \"Scrambled Homes for Breakfast."
}