{
  "id": "d1201-6",
  "text": "NAEB NEWS LETTER\n-7-\nOCTOBER I, 1941\nNATIONALITIES, AS WELL-AS THEIR ENTERTAINMENT PREFERENCES WILL BE INTEGRATED\nINTO THE CONTINUITY OF THE SERIES*\nKENTUCKY TRAINING INSTITUTE\nIn conjunction with the University of Kentucky, the Kentucky W.P.Ao Recre¬\nation Project, held its second annual Training Institute in Radio Production\nfor Recreation on the University campus, September 2-6* In the five-day\ncourse advanced production techniques were covered. Director of the Raoio.\nInstitute was Ben Russak, State Specialist in Radio, Drama, and Music for\nthe Kentucky Recreation Project. Assisting were Elmer Sulzer, Director of\nRadio Activities; Lolo Robinson, Program Supervisor; and Willi am. Yount,\nChief Engineer for the U* of K* Radio Station*\nROCKY MOUNTAIN RADIO COUNCIL REPORTS\nA SUMMARY REPORT OF THE WORK OF THE ROCKY MOUNTAIN RADIO COUNCIL FOR THE\nyear, August I, 1940 to July 31, 1941, has just been published. The report\nWAS PREPARED BY ROBERT Bo HUDSON, DIRECTOR OF THE COUNCIL* If YOU HAVEN*T\nSEEN A COPY, WRITE HUDSON FOR ONE*\nSTAY TUNED TO THIS STATION (FROM SCHOOL AND SOCIETY)\nIT IS A CLICHE OF THE COMMERCIAL BROADCASTER THAT EDUCATORS FLOP AT THE MKKE*\nCOMMER^AL BROADCASTERS KNOW THEIR BUSINESS, AND THEIR OPINION SHOULD\nNOT BE REJECTED SUMMARILY ON THE GROUND OF SELF-INTEREST. NOR SHOULD THE\nEDUCATOR SEEK THE EASY ALIBI THAT THE RADIO AUDIENCE PREFERS ENTERTAINMENT\nTO EDUCATION*\nThere may be some truth in the implication that scholars don't know how to\nMAKE SCHOLARSHIP PALATABLE TO THE MANY. ThEY HAVE BEEN TRAINED TO TALK TO\nTHE INTELLECTUALLY IMMATURE, AND WHEN THEY WRITE IT IS USUALLY FOR EACH\nOTHER, IN ACADEMIC JARGON* THIS IS NOT THE BEST PREPARATION FOR\nEXCELLENCE AT THE MICROPHONE, WHICH UNFAILINGLY RECORDS BOTH SNOBBISHNESS\nAND OBSECURITY * RADIO LISTENERS ARE NOT LISTENING FOR CREDIT* If OFFENDED\nOR BORED, THEY SIMPLY TURN THE DIAL*\nA LITTLE BROADCASTING EXPERIENCE SUGGESTS THE FOLLWlNG PRECEPTS FOR THOSE\nWHO V’OULD ARREST D I A L-TWI STE RS S\nI *\n2*\n3*\n4*\n5*\n6*\n7*\nBe specific*\nIF A ONE-SYLLABLE ANqLO-SaXON WORB WILL DO, USE IT*\nTalk picture-making language.\nMake a recording, and listen to your voice—-you might be surprised*\nDon't be patronizing*\nDullness is the card\nRemind yoourself that\nI NG*\nnal radio sin*\nradio listeners\nare individuals,\nNOT A PUBLIC MEET-\nFCC ACTIONS\nW R U F, University of Florida, was granted special authority to operate"
}