{
  "id": "d1798-0",
  "text": "/\nI 6\nNAEB OFFICERS FOR 1940-41\nProfessor H, Ge Ingham, KFKU, University of Kansas, was re-elected\npresident of the National Association of Educational Broadcasters\nat the closing session of the annual convention held September 6\nand 7 in the Morrison Hotel, Chicago, C, Jensen, WCaL, St, Olaf\nCollege, was elected vice-president to succeed M. Yield YJhite, formerly\nof SWSC, W. I, Griffith, WOI, Iowa State College was re-elected\ntreasurers Executive committee members named were: Carl Menzer,\nWSUI, University of Iowa; M. S. Novik, YINY0, Municipal Broadcasting\nSystem, New York; Harold Engel, YIHA,. University of Wisconsin; Luke\nRoberts, KOAC, Oregon State College; Garland Powell, YJRUF, University\nof Florida; and, Homer Heck, YIN AD, University of Oklahoma,\nElection of officers brought to a close another annual convention\nwhich kept attending NASB members on the go and jbut them on the\nalert. It was the concensus of speakers and members that the\neducational broadcasting stations have a real service to render with\na dynamic program for democracy and national defense.\nSo Howard Evans, Executive Secretary of the National Committee on\nEducation by Radio, pointed out that educational stations should\ntake positive action. Educational stations can profitably work\ncooperatively with civic organisations, Evans pointed to obvious\nadvantages which ms,y be gained by courageous corraling of strength\nthrough the se groups„\nFranklin L, Burdette, Executive Secretary of the National Foundation\nfor Education in American Citizenship, explained the proposed\nprogram of his organization. He said it proposes;\n1, To encourage and promote more effective education in citizen¬\nship and in administration of government,\n2, To encourage universities, colleges, secondary and elementary\nschools, arid other educational institutions, to make compre¬\nhensive instruction in the American form of government\navailable to all students,\n30 To aid and encourage the collaboration of ecucators and citi¬\nzens in developing basic instruction in American principles.\n4, To cooperate with educational associations, non-political\norganizations, national and regional movements interested"
}