{
  "id": "d1798-10",
  "text": "NAEB NEWS LETTER....SEPT 15, 1940\nattended the hiax Templeton show in the NBC studios in the Merchandise\nMart. Mrs. Lavinia Schwartz of CBS and Miss Judith Waller of NEC\narranged the visits to CBS and NBC, respectivelyc Both attended a number\nof the NAEB meetings.\nOne of the program features on Saturday morning was an FM*»AM demonstrat¬\nion by J. Eo Brown, and his assistants, of Zenith Radio Corporation.\nPossibilities of FM and possible costs were discussed by Mr® Brown,\nwho is in charge of television and frequency modulation research for\nZenith.\nProfessing to be recounting the \"failure of a mission/- William B.\nBoutwell, Chief of the Division of Radio, Publications and Exhibits in\nthe United States Office of Education, actually portrayed a vivid\npicture of the accomplishments of the Education office in the field of\nradio in his talk on Saturday morning. He recounted the services of\nthe script exchange, the planning and broadcasting of special series\nand the research work which has been carried on during th® past few\nyears®\nAlthough the Congress failed to appropriate funds which would have\nmade possible the continued work of the Office of Education in the\nfield of radio, service of the script exchange will be continued on\na limited basis.\nMembers present were asked to express their views on the services which\nth© Office of Education might supply in promoting education by radio.\nFor members not present, the questionnaire will be included in the\nNAEB packet or you may secure one direct from BOUTWELL. It will be a\nreal service to cast your ballot.\nRegistration at the convention was as follows;\nW, I. Griffith, WOI, Ames, Iowa\nF. E« Sohooley, WILL, Urbana, Illinois\nH. Go Ingham, KFKU, Lawrence, Kansas\nMe Reid White, KWSCe Pullman^ Washington\nRobert Lee, KWLC, Decorah, Icwa\nMildred Seaman, KFKtT, Lawrence, Kansas\nM. Co Jensen, WCAL, Northfield, Minnesota\nFred C, Conger, WBAA, Lafayette, Indiana\nLuke L. Roberts, KOAC, Corvallis, Oregon\nBill Sener, WSUI, Iowa City, Iowa\nDavid Adams9 WRUL, Boston, Massachusetts\nMarian Panko, Radio Council, Chicago, Illinois\nMildred Sollenberger, Radio Council, Chicago, Illinois\nJoe Wright, WILL, Urbana, Illinois\nCarl Menser, ’WSUI, Iowa City, Iowa\nS. I). Andresen, Radio Council, Chicago, Illinois\nWalter Krulevltch, WILL, Urbana, Illinois\nNat Ho Cohen, 'WILL, Urbana, Illihois\nJudith Co Waller, Chicago, Illinois\nAllen Miller. UBC, Chicago, Illinois\nParker Wheatley, Northwestern University, Evanston, Illinois\nJohn Chancellor, American Library Association, Chicago, Illinois\nLee Norvelle, Indiana University, Bloomington, Indiana\nLuella Hoskins, Radio Council, Chicago, Illinois\nJean Simpson, Radio Council, Chicago, Illinois\nHarold W. Kent, Radio Council, .Chicago, Illinois\nMary Agnes Scliroeder, Radio Council, Chicago, Illinois\nCatherine Kilpatrick, Radio Council, Chicago, Illinois"
}