{
  "id": "d1798-12",
  "text": "NAEB NEWS LETTER,.,.SEPT 15, 1940....Page 13\nalso give those to the west Letter service than they now receive,\naccording to the engineers.\nA new goal in radio service\nBy Homer Heck, Supervisor, WNAD\n(Editor’s Notes In July, Homer Hack, WNAD, was elected chairman and\nex officio member of a committee to plan and put into operation a state\nradio council for Oklahoma. The story can best be told by Heck, in our\nopinion, so we submit them to you.».fes)\nBetter utilization of Oklahoma’s state-wide facilities for public\nservice radio broadcasting is the aim of a new council starting to work\nthis autumn under leadership of the University of Oklahoma.\nThe University has been broadcasting for eighteen years - dating back to\nthe pioneer days of this comparatively new industry. Throughout that\nperiod of time, it has owned and operated its own radio station, most\nof the time as a function of the Extension Division. In the early days\nT, Mo Beaird, now 0. U. alumni secretary, was director of the station\nin connection with his work in the Extension Division, and he still\nretains chairmanship of the University’s Radio Committee.\nStation WNAD, whose call letters stand for \"We Never Are Dull\" according\nto one ironic wag, has been operating on a frequency of 1010 kilocycles\nby authority of the Federal Communications Commission, with a power of\n1000 watts. The station has very attractive, well equipped studios, and\na staff composed of a supervisor, a production manager, a secretary, and\na few NYA students* Because of this limitation of staff, WNAD has been\nunable to broadcast more than a few hours each day. It has always been\nthe aim of the personnel of the station to wlrk for continual growth and\nimprovement of program material of a public service nature.\nNote the use of the term \"public service.\" This Is used deliberately in\nplace of the term \"educational broadcasting which is gradually going out\nof favor. Too often the use of the tern \"educational broadcasting\"\nmerely brings on a twist of the dial to some other station, since the\naverage radio listener doesn’t like to be told he is being educated.\nAlso, a- further objection to the use of \"educational\" to denote the\nUniversity’s broadcasting program is that all broadcasting is, in a\nsense, educational, whether for good or ill.\nA recent resolution of the Board of Regents gave official approval to\na considerably expanded broadcasting program for the University. This\nprogram of expansion came as a direct result of the ratification by the\nUnited States of the so-called Havana Treaty which provides for re¬\nallocation of broadcasting frequencies to eliminate interference\nbetween the nations of this hemisphere. The reallocation provisionally\ncontemplates the assignment to WNAD of a much more favorable frequency\nthan that now held, making possible satisfactory service to a much wider\narea of the state. The frequency schedule for WNAD is so favorable,\nindeed, that it is very attractive to the commercial broadcaster, since\nit is a clear channel frequency capable of carrying a power of 50,000\nwat ts *\nIt was felt by the administration of the University that if we were to\nhope to secure and hold the proposed new frequency we wrould have to give"
}