{
  "id": "d1798-13",
  "text": "NAEB NEWS LETTISH..., SEPT 15, 1940* .. .Page 14\nevidence of preparedness to render 8, real public service and it Is the\nambition now of the University to make \"/NAD a state radio station in\nevery sense of the word, with its facilities available to other instit¬\nutions and departments of state that could utilize broadcasting time to\nthe advantage of the people of Oklahoma,\nThe National Committee on Education by Radio has long advocated the\nestablishment of state or regional broadcasting councils for the purpose\nof further improving the quality of public service broadcasting. Such\ncouncils are now in operation in various parts of the United States,\nnotably in the Rocky mountain region.\nOfficials of the University have felt that with the sanction of the\nBoard of Regents to a program of expanded service* the University might\nwell take the lead in developing such a radio council for Oklahoma0\nCo-operation of the Oklahoma A. & M„ College, State Department of\nEducation, State Congress of Parents and Teachers, and Oklahoma Baptist\nUniversity* and others was requested and wholeheartedly given in planning\nfor this first conference. Invitations were sent to practically every\norganization and institution in the state that was known to be in any\nway concerned with education or to have a potential interest in broad¬\ncasting of educational material.\nThe response to the call for the conference was gratifying. Twenty-\nthree organizations and institutions sent representatives July 11 and\n12 to the first preliminary conference on public service broadcasting\nheld at the University. The services of Miss Judith Jailer* director\nof education and public service broadcasting of the National Broadcasting\nCompany for the Central Division, and Dr« 0. Crane, president of the\nUniversity of Wyoming, president of the Rocky Mountain Radio Council and\nchairman of the National Committee on Education by Radio, were secured\nfor the conference«\nOn the recomraendation of Dr* Crane it was agreed by the conference to\nplan a series of general conferences of this nature before definite\norganization of a council was perfected, and a planning committee\ncomposed of the following persons was appointed: Dr* Alice Sowers, State\nCongress of Parents and Teachers; Dan Proctor, Oklahoma Education\nAssociation; Mrs* Ernest Rutherford, American Association of University\nWomen; Marvin Orr, State Department of Education; Ralph Matthews,\nOklahoma Baptist University; Sam Schneider, Oklahoma A. & M. College;\nH. Ho Leake, University of Oklahoma and WNAD; Layne Beaty, Department\nof Agriculture; Perry Ward, commercial broadcaster; and H. R. Heck,\nchairman, and ex-officio member.\nThis committee was instructed to:(1) plan the program of the next\nconference, (2) draw up a preliminary constitution of the proposed\nOklahoma State Radio Council, (3) conduct inventory of needs, materials\nand resources for public service broadcasting in Oklahoma, and (4) in¬\nvestigate the possibility of temporary loans of personnel from insti¬\ntutions for the preliminary setting up of such a council*\nBriefly, the proposed plan of operation of the State Radio Council is\nas follows: Organizations and institutions representing both the broad¬\ncaster and the consumer will band themselves together for the purpose\nof mutual assistance and the pooling of resources for public service\nbroadcasting, and an executive committee will be selected that will be\nheld responsible for the operation of the project*"
}