{
  "id": "d1798-5",
  "text": "NAEB NEWS LETTER.... SEPT 15, 194 0... .Page 6\npart of the truly American scene0 But Idm not going to talk\nabout the cakes or ice cream^.Ko, there's-another part of the\nice cream social....that*s itj The Japanese lanterns*.eyes,\nindeed.....\nHere we have used at least two tricks - flattery and pleasant memory\napproacho\nYou have just been talking.....and after awhile you'll find that\nit's very easy to talk along in this vein....in other words, a personal\npersonable, friendly conversational sjsyle,.But the program director\nwon't let you talk that way in front of his microphones*..everything\nhas to he read, and.•••It's easy then, to have a stenographer take\ndown in shonthand your thinking aloud* Then you go over it...again\nand again...cutting out a phrase here, adding a colorful word here...\nmaking that talk a vivid, living, bit of good writing*..and good\nwriting is nothing more than simplicity, sincerity, straight-forward-\nnessa radio script or talk can be a good piece of writing.,.it*e\njust a matter of bringing all the principles of good writing to it*\nSo much for the talk.....the interview, the news broadcast, the\nnarrative with sound, all can well stand considerable of the Informality\nof the good radio talk. Now, don't misunderstand me*...one of the\neasiest things to do Is to talk down to an audience, and academicians\nare prone to do this....they are likely to deliver their opinions we\nmight say, ex cathedra....but this needn't happen.......\nYour radio talk, as every radio script, should have....and I quote\nthese from Max Wylie of CBS....direction....purpose*...find familiarity\n....By direction Wylie means that the script holds together...it\nproceeds from a beginning, has a middle, and a close»..elementary\nprinciple of good writing anywhere* By purpose, he means, that there's\na reason for it.....I doubt very much if there's a good reason for\nmy Japanese Lantern talk of a few moments ago....one might give it\npurpose and point if he wanted to do a little nostalgic bit of homesppn\nphilosophy. And finally,, we come to familiarity... .this means\nfamiliarity with the subject. It would be rather difficult for me\nto do a broadcast talk on Calculus, because I am not familiar with\nthat subject....yet, I see no reason, if properly handled, a talk\nwritten by someone who is familiar with Math, could not be as interest¬\ning as one on electricity or any other subject. In fact, I think a\nseries on the Philosophy of Numbers, using historical material and\ncommon, every day examples of mathematical examples would go on the airQ\nTo Mr. Wylies triology of direction, purpose and familiarity with the\nsubject, I'd like to add another.... that is, sinoereity. Too many\neducational script writers always looking to the green pastures of\nCommercial writing and thinking they are second Arch Obolars or Irna\nPhillips©, kid their material....1 don't mean necessarily in the\nactual script, because an editor would soon discover that, but in\ntheir thinking* Supposing you were handed a subject, \"The Wild Turkey\"\n.....well, unless you are sincere in your approach to that subject,\nyour script is going to reflect your attitude. Another thing, be\nsincere in your approach to your audience.•.if you have a message that\nis important enough to ha\\re been given time on the air, it is\nimportant enough to handle sincerely* For years, in teaching microphone\ntechnique and speaking we have harped on sincerity..,sincerity..and\nPear, the British psychologist, and no doubt many American psychologists"
}