{
  "id": "d410-35",
  "text": "John H.Lerch\nDr. Harry Skornia\nExecutive Director\nNational Assn, of Educational\nUniversity of Illinois,\nUrbana, Illinois\nTokyo, Japan\nJan. 22, 1956,.\nQ H «* t£*S\nBroadcasters ■£t .\n°?,10/r- ^\nU'J.l\n7/&\nDear Harry;\nAt last I have been able to put some thought\nand attention on the tape-recorded Report from Japan\nwhich we discussed in correspondence before I left\nthe States in November.\nFrom the enclosed outline you will see what\nsubjects I plan to treat generally. This is only a\nrough draft, and I might yield priority to any topical\nevent. I realize these programs oujGJto be \".current1\nfor about six months1 circuI ation/ and so will watch\nthat aspect of it. I cleared permission to make the\nprograms which will present no conflict with my 8- 5\nperformance with the Dept, of the Army; and I may use\nthe Voice of the United Nations Command studios which\nwe operate, or NKH international service studios— they\nneed a little talking with, but probably would grant\npermission. The best deal, however, is VUNC on Saturday\nmornings. Now, I would request a $5.00 fee per show\nto pay the enlisted personnel ( operator) who will have\nto come in Saturday mornings to make the program for me\nand a $5.00 scripting fee in order to get a private\npart-time secretary to do the scripts. None of our\noffice help is either suitable or available, so this\nwill have to be entirely on the outside.\nAnother matter: I*ve not yet got the tapes John\nHolt said he was sending, although I hJJ^one brand new\none at hand here. These can be bought at the PX for about\none-third less Stateside retail price which isn'tbad.\nThis next Sturday I plan to record the first.\nReport from Japan and send it to you. The script is\nalmost finished, and I am working out production\ndetails; music and introduction. Once I get a\nstandard opening and close, we’ll keep that on tape\nhere. Do you want these 14:30 or 14:00 ; and will\none every two weeks be sufficiently frequent.\nCordially yours.\nPsywar Det. 8239\nAPO 500\nSan Francisco, Cal.\nTS~: You know it is standard practice\nto pay a token honorarium for 11 guest\nyou think might be worked out on that\nin Japanese radio\nspeakers.11 What do\nscore."
}