{
  "id": "d410-79",
  "text": "2-\nBB6R0BERT UNDERWOOD. JR,\nNow I believe that B/T will go along and give us a\nfair spread on this, if you will be kind enough to follow\nthrough.\nShould you want other copies of this 5x7 I can have\nthem made. Do be sure to put in some protective padding for\nsafe mai I i ng.\nAnd, by the way, the first good word K've had here\ncame from the Tokyo representative of J. Walter Thompson\nthe other day whom I invited o«er to the stdio , He thought\nthe programs were fine, mighty fine, to use his words.\nI do not know whether the Japan Society is going to buy\nthe scripts and reproduction rights, so as far as I know\nthese are primarily, as planned, an NAEB product and\nexclusive series of programs.\nIf you want, I wiI I make an extra tape recording for the\nprogram that treats the Cherry Blossom festival, for I\nfeel that unless this is scheduled so that it falls l>n\nthe spring it would be an untimely thing to let run as\nit stands in the series. For example, I could get a\nspecial Christmas Number devoted to description of Christmas\nas it takes place in Tokyo and thooughout Japan, or better\nstill the New Years which is more colofful and important\nin a non-Christian country. This special number you\ncould then run, calling attention to it by inserted\nannouncements in your bulletin to the subscriber stations.\nAnd then asking them to watch out for the Cherry Blossom\nnumber, holding it until April., or the right occasion.\nWell, we can work this out. And I*m perfectly willing to\ndo an extra program in order to make the series as good as\nI possibly can. So far, I've put a lot of time and energy\ninto these things, but I must say it has been rewarding and\nit has been fun.\nDo let me know on the publicity; for I think we stand a\ngood chance to get a decent spread here. Remember, Robert,\nthis program is the only one of its kind presently coming\nout of Japan. More later on the little cards Ifm\nhaving printed to send to a select number of people in the\nradio-TV industry; they are not ready yet.^F\ntordially yours."
}