{
  "id": "d816-136",
  "text": "Fege 6\nn. special pbogram projects (Goat.)\nceedlngs of a two-day public Conference exploring and documenting the\nbarriers to effective communication between nation® and people® of radically\ndifferent cultural and ethical background® will be recorded and edited\ninto a series of radio program®, The Conference, to be sponsored by KPFA,\nwill include four papers to be presented by particularly qualified persons\nfrom both the Fast and the Meet, a number of panel discussion® and excerpts\nfrom a series of Conference seminars. Upon final editing there will be\nfrom six to ei#it program hours reporting the proceedings of the Conference.\nLI TIMM PROJECT? This project contemplates an extensive expansion and addition\ncurrent New Writing series. Bi-weekly broa c-sts of the work of\nAmerican and shglish writers, principally poetry, verse drama, and specu¬\nlative writing, will be produced from material solicited from both well-\nknown and lesser-known writers, dramatists and poets in this country and\nin Kngland. On a quarterly basis selections from the broadcast® will be\nissued in a supplement to the KP?A program Folio. Reasonable literary feet\nwill be paid to the authors whose work is used in the broadcasts and in the\nFolio supplement. It is expected that this combination of a broadcast eerie*\nand a literary journal will become a predominant outlet and influence in\nthe contemporary literary world. The broadcasts, numbering thirteen program\nhours per year, and copies of the ?ollo will be made available to HA S\nmember stations.\nPOINT FOUR? A series of dramatised documentary progrmme, with lectures inter¬\nspersed, studying the Point Four program in the perspective of the various\nforeign populations receiving aid, and summarising its history and economic\nprinciples. The project is planned with the Hoover Institute and Library,\nStanford University, as the research center, end will involve a committee\nof highly qualified advisors as well as special research, administration\nand production staffs* It is expected that six documentary dramas will be\nproduced in the series, each half an hour, and about twice as many lecture®\nrelated to the dramatic material.\nIII. SIMMAKY OF 1QGRAM HOURS AND PRODUCTION COSTS\nBased on predictable program source® as noted above, approximately seventy-five\nprogram hours can be made available to the Tape Network of the National Association\nof Educational Broadcasters during 1953* ^h® following Is a breakdown of pro¬\ngram hours in relation to the four primary program categories within JCTFA*s\nbroadcast schedule?\nfbdohah cabbgort mmm or prog rah series total approximate hours\nMUSIC\n7\n25\nPUBLIC AFFAIRS\n7 or more\n21\nLITERATURE ARB BlAMA\n2\n7\nCHILDREN’S PROGRAMS\nk\nJBL\nTOTAL SKRX1S\n20 or more\nTOTAL HIS. 75"
}