{
  "id": "d816-15",
  "text": "-Ill- .\nChambers, ¥., ’'Whittaker Chambers Meets the Press.” American Mercury,\nLXVIII (February 19U9), pp. 153-60.\nDouglas, ?. H., \"Senator Douglas Meets the Press.\" American Mercury, CXIX\n(Seotember 19U9)> P • 322-7.\nDrake, E. J., and Carmen, L., \"Broadcast for Brotherhood.\" School Activities,\nXXI(October 19li9), PP.56-8.\nDye, Lucy F., \"Cookih g Outdoors.\" Practical Home Economics, XXVII (Seotember\n19it9), pp. 389 /.\nEisler, G., \"Gerhart Eisler Meets the Press.\" American Mercury, LXIX (July\n19^9), V' 5*-lU.\nHodson, Cornelia, \"So Tomorrow You Go to Work.\" Business Education World, XXX\n(March 1950), on. 326-8.\nHosier, R. J., \"Radio Script to Define the Nature of Business Education.\"\nBusiness Education World, XXX (October 19U9), PP* 63-5.\nJohnson, H., \"Red Dean Meets the Press.\" American Mercury, (May 19h9),\npp. U63-9-\nmaloney, Martin, \"Henry and the passing of Time.\" ETC., VII (Autumn 19U9),\npp.25-3U.\nMarquis, arnold, \"The Only Good Indian,\" Hollywood Quarterly, IV (Autumn 19U9)\nMillar, L., \"I. 0. U., Drama for Stage or Radio Production.\" Michigan\nEducation Journal, XXVII (Sentember 19U9), pp. 7-10.\n^endergrast, M., and Meyer, Y.,.\"We.Practice Safety.\" Grade Teacher LXVII\n(April 1950), op. UU /.\nSmith, ¥. B., \"Qeneral Walter Bedell Smith Meets the Press.\" American Mer¬\ncury, LXVIII (June 19h9), PP. 697-703.\nWatson, K. ¥., Radio WLays for Children,. 2nd Printing. H. W. Wilson Co.,\n19U9.\nWolfe, B. A., \"Miss Lacey and the Loudsneaker.\" English Journal, XXXIX\n(April 1950), pp. 208-13.\nTTood, Ruth H., \"Recreation.\" Journal of the American Association for Health,\nPhysical Education, and Recreation, XX (OcEeber \"I9H5T, np. 518“*/.\n9. Education and Radio Broadcasting\na. General\nAbbott, Waldo M., \"Educational Stations of the Nation: WHOM.\" Association\nfor Education by Radio Journal^ VIII (April 19U9), pp. 92-9lu\nAnderson, Borghild, F*,. \"Are Good Radio Listeners Made?\" English•Journal\nXXXVIII (September 19U9), pp. 391-iu"
}