{
  "id": "d816-157",
  "text": "147, Argyle Hoad\nEaling\nLondon, W. 13\nOctober 16, 1953\nDear Harry*\nAs the attached letter to Gray don plints out, getting settled\nhas been my major taskcl uring my three weeks in England* But\nsince you*ve js&t finished doing the same in Urbana, that s\nan old story to you*\nAs I set out to work I thinly of a number of services I’d like\nto jpar e headquarters do -a few thingsfor me. So, my requests are\nlisted t elow: fill them if you can; but if X ask too much, just\nsay so and 1*11 forget it.\nFirst off, I should know the status of NAEB-BBC exchanges todate.\nJust how many programs have we taken from them? Could you give\nme a list—in some detail? If we have exchanged any recent cor-\nreepoid ence with them vh ieh Graydon wouldn’t be ^ t to send me\nasa result of my letter of this date to him, would yousend me\ncopies? You see, I don't wait to start agotiations on any sub¬\nject unless I know all that has gone before.\nxhe record albums have arrived and are now in customs. I am\ncurrently getting an impcr t license so I can har e them.\nAs to magazine subscriptions: I’d like both Broadcasting and\nVariety from now thru about mid-June, plus the la st Broadcasting\nYearbook and the TV Digest periodical summary volumes.\nNow about books* looking at this long range, I’d like to see\nboth the BBC library and the Bmba y library with some of the\nbetter American books on brdcsting. I visited the f oirner library\ntoday* aid they hare very little on US brdcasting, and most of\nthat\"is old. You see, there’s the every present dollar prolem.\nCould we work a deal like this* suppose you were to run thru\nmy bibliography and ydur memory and pick out a number of our\nbetter vlumes—say some 15 or 20* including your own, Waldo’s,\nLeven son’s, Bretz’ two, Cruse, Kings on- Kru le v i t ch- Co v.gi 11,\nGarrison, Siepmann, laPrade (dn music), etc. etc., etc. Write to\ntheir publishers vi th a story somewhat as follows (or maybe to\nthe authors, or maybe to one with a carbon to the other), and\nsay something like this *\nPaulu is in GB as Fulbr ght scholar to do research on British\nBroadenstiig and to serve as liaison} GB doesn t Know much & out\nAmerican brdcsting} BBC hasn’t enough dollars to buy such books,\nand Embassy library w> n#t get them without special inducements.\nFurther, Paulu is expected to servd as resource person on US\nedntl brdcsting while in England. Could you send him ( or send\nto NAEB for transshipment) tv© copies each of your books as\nfollows for his use this year, then to be depod. ted in these two\nH braries."
}