{
  "id": "d816-159",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n147 Argyle Road\nEaling\nLondon W. 13, England\nMr. Graydon Ausmus\nNAEB Convention\nRadio Station WNAD\nUniversity of Oklahoma\nNorman, Oklahoma, U.S.A.\nr>oflT» Gravdons --1—-^—'\nA glance at the calendar reminds me that the NAEB Convention will he\nin session when this letter reaches the States. First off, then:\nregards to NAEB’s best convention yeti I wish I could be there with\nyou.\nSince it is convention time, with the Board of Directors in annual\nmeeting, a report on what goes on here and what needs to be done is in\norder. Some other time 1*11 do a piece for all of you on life in\nEngland. Suffice it for now to say that there is a pretty good supply\nof goods in the stores, but buying is inconvenient, partly because\nof trade name and product differences, and partly because—in local\nareas especially and to some extent everywhere—small specialized\nshops are the rule. Thus we buy groceries in one place, green groceries\n(fruits and vegetables) in another, meat in the butcher's shop,\nmilk in the dairy store, and baked goods in the bakery 0 If you want\nKleenex you go to a chemist’s shop, but the stationer has paper\nnapkinsJ And prices are high on all these goods except fresh\nvegetables. Canned goods are more expensive than at home and in less\ngood and varied supply*,\nThe BBC has been coming through magnificently 0 I’ve had luncheon\nsessions plus a flurry nfiPTOann family-type Lea with various members\nof the key external broadcasting staff (external broadcasting—\nprograms for everywhere except the United Kingdom) on four occasions\nwithin the last week and a half. First we went to the Cafe Royal,\nthen twice to Broadcasting House itself (they have a lovely private\ndining room there.*), and once to one of the official’s homes. This\nbrought me new or renewed contacts with: J. B. Clark, director of\nexternal broadcasting; I. Thomas, of the Overseas Liaison Office;\nWari(rW MacAlpine, Director of Overseas Services; George G. Looker,\nDirector of Overseas Regional Services; Hugh Greene, Assistant Con¬\ntroller of Overseas Services; Donald M. Hodson, Assistant Controller\nof European Services; Tangye Lean, Assistant Director of External\nBroadcasting; and Cyril Conner, Director of External Services Liaison.\nAlso Mary Somerville, Controller of Talks, and Miss Milnes, Head of\nthe Reference Library. I shall not attempt to list here any of the\ncontacts in the educational lield which I am making through the"
}