{
  "id": "d816-16",
  "text": "Anonymous, \"College Courses by Radio.\" Higher Education, VI (December 1, 19h9),\np. 82. * r\n-3 Educational Broadcasting. Urbana: Institute of Communications\nResearch, University of\" Illinois, 19l*9. P. 30. ' • -\n-> Lowell Institute Cooperative Broadcasting Council: Third Annual u\nReoort. Boston: Lowell Institute Cooperative Broadcasting Council, 19l*9.\np. 39.\n-, \"Make Up a Party at Your House.\" Recreation, XLIIT (October 19i*9),\n-, \"New Orleans Radio Show Stimulates Outside Reading.\" Publishers'\nWeekly, CLVI (July 30, 19^9), pp. 1*68-9. ~\n--—.—, \"New York State Education Department to Broadcast Home-Study\nLessons,\" School and Society, LXX (October 15, 19l*9), o. 25>1.\n-, \"On the Air; Going to School via Radio.\" Scholastic, LIV\n(May 18, 19l*9), P. 29.\n-, Rocky Mountain Radio Council: Tenth Anniversary Reoort. Denver:\nRocky Mountain Radio Council Inc., 19'1*9. D. 28. *• • • -\n--, \"University of the Peoole.\" National Education Association Journal,\nXXXIX (April 1950), op. 302/. ~ ~\n-, \"Voice of isconsin Reaches Entire State.\" Scholastic, LV(Sentember\n28, 191*9)i p. 30T. ■\nAusmus, Graydon, \"Alabama Radio Services.\" Association, for Education by\nRadio Journal, VIII (May 19l*9), pp. 103-U.\n---3 \"Educational Stations of the Nation: MUOA-FM.\" Association\nfor Education by Radio Journal, IX (May 19^0), pp. 101-3.\nBavely, Ernest, \"High School Students Rate Dramatic Arts.\" Quarterly Journal\nof Speech, XXXV (October' 191*9),' pp. 33U-7. ' \"\nBender, W., Jr., \"Radio Presentation of Sociological Topics.\" American\nSociological Review, XIV (February 19i*9), b. ll*9.\n-, \"Bringing History to Life\" University of Michigan School of\nEducation Bulletin, XXI (October 19l*9), pp. 3-5>.\n-\"Educational Radio: An Uphill Fight.\" Adult Education\nJournal, IX (January 195>0, pp. 23-6.\nBrecher, E. M., \"Radio and Television Repqrt: Educational Broadcast Stations\nand Programs!\" Consumer Reports, Xltf (June 19U9), p. 283.\nCarlson, E. F., \"Effective Listening.\" Chicago Schools Journal, XXX (March\n191*9), pn. 20-1. ~ ~\nCarson, Saul, \"Oh the Airy Gift Package.\" New Republic, CXXI (November 21,\n191*9), pp. 20-1. ‘ ’ ,\nColeman,-Robert J., \"Educational Stations of the Nation: WKAR \" Association\nfor Education by Radio Journal. VIII (February 19L9), PP* o9-fdr-~-"
}