{
  "id": "d816-162",
  "text": "Mr. 'Graydon Ausmus\n-4-\nOctober 26, 1963\neach should suffice for the timebeing.\nThird, books and material on American educational radio activities in\ngeneral. Would Harry ask Gertrude Broderick for 20 or 25 coDies of\nk^J^eilent bibliography and various school aid materials?P Also,\nat least two copies of the better books on script writing, production,\nnews editing, etc., etc. And 20 or 25 copies of the fine research\nsummary Schramm let us distribute at the Lincoln Lodge semimr^ Also\nHonf^nnhSerleS ^ ^zarsfel<?> etc., etc. Universities here haven^i\nre®ear9h on ni^ss media from what X learn, and they at least\nshould see what is done in the U.S.A. in this respect#\n1 find. advantageous in dealing here to identify myself as\nNAEB vice-president, especially since the British attach considerable\n(and probably undue) importance to one's rank in the hierarchy.\nTherefore I hope I shall emerge from the Norman convention with some\nsort of NAEB title to quote while over here. It may not be possible\n?e vice-president in view of my absence from the country—\nalthough that would work out nicely locally. But if not, could I at\nappointed by the president as NAEB representative to the\nUnited Kingdom or some such thing?\nAfter reading Harry's letter to Graham, Larry, and me of October 21,\nI realize how unlikely is financial help from NAEB coffers. Neverthe-\nlessjfor tne record, here is the Paulu's parallel to Larry's story as\ntold m his letter of October 8. Like Larry, we are finding after a\nmonth abroad that ray appointment is much more rewarding from a\npersonal and professional than from a financial point of view. We of\ncourse are prepared to do whatever penny-pinching may be necessary to\nsee us through the year, but ! had strongly hoped some assistance might\nbe forthcoming to meet the fixed dollar commitments in the States which\nI previously outlined for you. Otherwise we most certainly shall ex¬\nhaust all our reserve assets at home, and in case of some large unex¬\npected outlay on the upkeep of our house (our water heater will quite\npossibly need to be replaced, for example) it may even be necessary to\nborrow money from my father—who is living on a teacher's retirement\npension—to pay return passage for Frances and the children.\nMy living allowance here, like Larry's, is predicated on a maximum of\ntwo dependents, so two of the children are excess baggage# Upon\narrival here, we were quartered by the Fulbright people in a by no\nmeans elaborate residential type hotel where the charges for the five\nof us ran to slightly over $100 per week. After two weeks of intensive\nhouse-hunting, we had a choice between a maisonette in Chelsea or this\nhouse in Ealing, either of which would cost us 10 guineas ($30) per\nweek exclusive of utilities. (Housing is extremely scarce; families\nwith children are a doubtful risk; and landlords tend to raise their\nrates the moment an American approaches them.') Rather than let our\nhotel bills run on, we decided to move to Ealing. Here X am about\nan hour from the BBC, but we are able to send Sarah to a County\nCouncil (publicly supported) school, so we at least avoid the ruinous"
}