{
  "id": "d816-165",
  "text": "MEMORANDUM\nNovember 29, 1953\nTo s Graydon fiusmus\nFrom: Burton Pan in-—*\nCc: . NAEB Executive Committee; Creshkoff, Hovey, Siegel, Skomia\nSubject: Liaison Between Fulbright Scholars aid NAEB\nThe arrival.of* Graham Hovey*s NQv. 25 letter to Shornia prompts the\nfollowing line sab out liaison problems*\nMy experiences.are not unlike Graham’s: although I have n<w been in\nEngland for slightly over two months, I hve received no letter from\nany members of the NAEB Board or officers as to policy visavis BBC*\nHsring; been an NAEB officer fox- scos time, I fully realize that its\npretty hard. to.hold down one fUll time job as a station manager, aid\nanother full time plus as NAEB president, vp, secretary, or other;\nnevertheless our work ever heie will be more fruitful if we can clear\nup the liaison problem now*\nEach of us over here has his own problems, and here ar e mine:\nwhereas Italy and France are apparently willing to give programs to\nNAEB free of charge, BBC wants $56,000. In my last two letters to\nGraydon I pointed out at some Jb ngth th. at I needed more information,\nand expressed concern at having to nggotiate with BBC people here with-\nout knowing what hid transpired since Graydon’s trip here last summer:\nI-Iw e a copy of-Nugh -latter to Gteaydea out-linii^ the terns\nof mar offer, but hare never heard officially on the current NAEB\nposition now: hare we given up trying to raise the rest? If so,\nshould I m go fiat e. here as to what we get for the $15,000 in hand?\nShoa Id Istart.® gotiations all over again, hoping to get something for\nnothing? Or is this to be done in. NY? ReaL ly, I ought to be fully in¬\nformed—and in extenso—as to NAEB policy here, and on all negotiations.\nI understand the Transcription service is recoding and holding for us\nseveral programs each w ek, in antid. pation of a successful working out\nof terms, but they will hold thismaterial only through December* So,\nan agreement—if one is to be had—is a matter of urgency*\nPlease do.not conclude from any of the above that I’ve beenwasting any\ntime waiting for wod from home: on the contrary, I’ve been making ex-\ncellet contacts with the various BBC staff members with whom we must\ndeal: controllers and/or directors of Transcription service; Home,\nLight and Third Programmes; TV; Audience Research; Talks; overseas\nLiaison; etc., etc. Some of these lave been. invL tiig me to In eir re¬\ngular staff meetings, which is an excellent way of getting information\nabcut how the BBC works, and what it doe s.\nr'cidentily, BBCplaysare thee ream of the crop so faras NAEB is con¬\ncerned. We could get mosto f their music on commercial r ecords for\nless trouble thanfrom them. But Xamveiy skeptics. 1 about their talks:\nthese are either too local, too English, or just plain dull—and I’d\ninclude the current Keith lectures by Oppenheimer in the last categorv\nunfortunately. So, for NAEB, with BBC, \"The PJay’s The Thing.”’"
}