{
  "id": "d816-19",
  "text": "JL&-\nTunick'/ A. B., \"Educational Stations of the Nation.\" Association for Education\nby Radio Journal, VIII (Hay 19 U9), pp. 106-8.\nTyler* Tracy F., \"Listening, The Number One Problem,\" Association for Ecu-\ncation by Radio Journal, VIII (April 19U9), p. 8$.\n-9 \"Radio's Future Rests with the Schools.\" Association for\nEducation by Radio Journal, VIII (May 19U9)> P» 99.\nWebster, Harvey, \"A College Course by Radio.\" New York Times, XCVIII\n(January 23, 19k9), Sec. 2, o. 9.\nWilliams, H. M., \"Radio Curriculums Questioned.\" Higher Education, VI\n(March 15, 1950), op. 165-6.\n-, \"Status of Courses in Radio.\" Quarterly Journal of Speech,\nXXXV (October 19U9), pp. 329-33..\nWright, J. F.., \"State University Serves with Radio.\" State Government,\nXXII (July 19(49), pp. 177-80 /.\nIn-School Use of Radio\nAnderson, Vivienne, “Leadership-Study Incident.\" School Executive, LXVIII\n(May 191+9), p. U8.\nAnonymous, \"New York School of the Air.\" Scholastic, LV (December 7, 19U9),\np. lUT.\nAyers, M. B., \"Custom Made School of the Air Serves Lubbock and the South\nPlains.\" Texas Outlook, XXXIII (May 19U9), pp. 12-13.\nBarrett, L. A. \"Radio in the Small School.\" Journal of Education, CXXXII\n(Octqber 19h9)> p. 201.\nBennett, H. II., \"Integration of English Radio Lessons and Home Instruction.\"\nHigh Points, XXXII (April 1950), op. 68-73.\nBovaird, If. F., \"Philadelphia Story.\" Music Educators' Journal, XXXV (January\n19U9), up. 22/. -\n-Chapman, A. L., and Jackson, M., \"Not.What You Do But How You Do It.\"\nAssociation for Education by Radio Journal, VIII (February 19U9), pp. 6^-6.\nCook, C. H., Jr., and Cohen, L. J., \"Short-Wave Radio in Language Teaching.\"\nModern language Journal, XXXIV (x&TQh 1950), pp. 199-203.\nDillon Q., \"Museum with a Voice.\" Childhood Education, XXVI (March 1950),\npp. 316-21.\nEwin, H., \"Radio, Invaluable Aid.\" Association for Education by Radio Journal,\n,VIIT (March 19U9), pp. 81-2.\nExton, Elaine, \"New Developments in Educational Radio and Television.\"\nAmerican School'Board Journal, CXVITI (April 19h9), Pp. 53—U /.\nFoster, E. S., \"Empire State FM School of the Airj Progress Report.\" New York\nState Education, XXXVI (April 19h9), pp. h76 /."
}