{
  "id": "d816-2",
  "text": "A. RADIO\n1, General.\nAnonymous, R,C.A•: Wttat Is It, What It Does; Answers to Questions Often Asked.\nRad3.9^Corporation of America, 19h9• P. U7•\nOhester, Giraud, \"The Press-Radio War : 1933-1935.\" Public Opinion Quarterly,\nXIII (Summer 19l9), pp. 252-61*.\nCorwin, Norman, \"Radio and Television - A Prediction.\" Association for Education\nby Radio Journal, IX (April 1950), pp. 87-8.\nDalen, Adrian E., A History of KUSD. Vermillion: University of South Dakota,\n19U9. P. Ii5.\nForeman, Bob, \"What1s Happening in Radio?\" Advertising and Selling, XIII\n(February 19U9), p. 31.\nRankin, Forney A., Who Gets the Air. Washington, D.C.: National Association of\nBroadcasters, 19W^ ” .\nRobinson, H., Jr. \"After the Crystal Set; Backward Glance.\" Theatre Arts,\nXXXIII (September 19U9), pp. U6-7.\n2. Government; Federal Communications Commission; Legal Aspects; Copyright Problems\nAnonymous, \"Administrative Enforcement of the Lottery Broadcast Provision.\"\nYale,Law Journal, LVIII, (June 19li9), pp. 1093-120.\n-, \"Ban on Radio Giveaways Raises Censorshio Issue.\" U.S. News and World\nReport, XXVII (September 2, 19U9), p. 22.\n-, \"Definition of Freedom; Commission’s Right to Deny Radio-Station\nLicenses to Newspapers,\" New Republic, CXXII (February 6, 1950), p. 9.\n-:, \"FCC Attacks Radio Give-Away Programs.\" Stanford Law Review, I\n(April 19h9)} pp. U75-85. — ~\n-, \"Free ,.ir or Hot Air? FCC Ruling on Editorializing and Free Speech,\"\nCommonweal, L (July 15, 19U9), pp. 33U-6.\n-, \"KMPC, Los Angeles. \" Nation, CLXVIII (March 12, 19k9), p. 291.\nJ -’-, \"KMPC ’News1 Show Consists Entirely of Paid Commercials.\"\nAdvertising Age, XX (March lii, 19U9), p.8.\n-—, Select Commission to Investigate FCC. Final Report, January 3, 19h9s\nPursuant\"to\"House Resolution 691. U.S. House of Representatives. (U.S. 80th ,\nCongress, 2nd Session, House Report No. 21*79).\n-3 ''Selected ]\\&terials on the Law of Radio and Television.\" The Record\nof the Association of the Bar of the City of New York, IV (L&rch 191*9)}\npp. 100-1*.\nAgee, Warren K., \"Cross-Channel Ownership of Communication Media.\" Journalism\nQuarterly, XXVI (December 19l*9), pp. 1*10-16."
}