{
  "id": "d816-201",
  "text": "November 30, 1956\nDr. Burton Panin\nStation KUOM\nUniversity of 2-tLnnesota\nMinneapolis 14* Minnesota\nDear Burt:\nDuring the past year I have met several times with the NAEB Public Relations\nPolicy Committee (Jim ’Hies, chairman) and one of the main topics of discussion\nat each meeting has been the Newsletter. At the last meeting of the group, in\nAtlanta, I was instructed to see if we could put out the Newsletter in roughly\nthe same format as the NARTB Mamber Service newsletter (copy enclosed) without\nany great increase in costs*\nI have obtained estimates from the same printer that is putting out the Journal.\n1500 copies (which is approximately what we will need starting in January when\nwe add the Individual members - former AERT members - to the mailing list) will\ncost approximately $125 per issue. This would be for 12 pages of printed matter\nwhich would be roughly the equivalent of 36 pages as currently mimeographed. And,\nof course, following the NARTB format there would be no separate cover, but\nmerely a masthead.\nFor our present run of 650 mimeographed copies per issue we pay from $50 to $90,\ndepending on the number of pages. I have checked and find that 1500 copies would\ncost nearly $250 per issue. This, of course, does not include the cost of a\ncover like the present one. The cost of the cover would add approximately 515\nper issue.\nSince getting the bid for printing I have again talked this over with Miles and\nSkornia. We are all agreed that we should at least try this for a few issues\nto see how it works out. The purpose of this letter is to see if you have any\nobjection to such a project, at least on a trial basis. Since the copy for the\nJanuary issue should be in the printer’s hands by about December 20, I would\nappreciate your letting m know as soon as convenient. Marry suggested that I\ndrop you this note directly, since I know the details better than he does.\nI’m sorry that we didn’t get to chat a little longer in Chicago the other day. I\nwas able to get on the earlier flight to Champaign and I hope you were equally\nfortunate.\nCordially, //J\nHEHsdfe Harold E. Hill\nCC: Mr. Frank Schooley S Associate Director"
}