{
  "id": "d816-26",
  "text": "-25-\nb. Voice of America\nAcheson, Dean G., '’Additional Appropriations for Improving VQA Facilities\nRecommended.’' U. S. Department of State Bulletin, XXI. (August 29, 19^9)}\np. 312. ‘\nAnonymous, \"Ducks, Dogs and Gulls; Jamming of the Voice of America Programs\nin Russia.\" New Yorker, XXV (June U> 19^9), pp. 21-2.\n-, \"Efforts of Soviet Union to Jam Voice of America Programs.\" U. S.\nDepartment of State Bulletin, XXI (July 11, 19h9), p. 32.\n-, \"Let’s Change the Voice of America.\" Christian Century, LXVI\n(December 1U,- 19h9), po. 11*79-81.\n-, \"Master of the Voice.\" U. S. News and World Report, XXVIII (January\n13, 1950), p. 3U.\n-, \"Radio Station at Salonika to Expand VOA Balkan Audience.\" U. S.\nDepartment of State Bulletin, XXI (November 28, 19U9), p. 829.\n--, \"Uncle Sam Says Merry Christmas 1 Christmas Show for the Voice.\"\nScholastic, LV (December lU, 19h9), p. 28.\n-, United States Advisory Commission, on Information: Semiannual Report\nto the Congress. Washington, D. C.: U. S. Government Printing Office,\nSeptember' 19^9P. 22.\n—-, \"U. S. Protests Soviet Jamming of Voice of America.\" U. S. Depart-\nment of State Bulletin, XX (May 15, 19 U9), p. 638.\n-, \"VQA to Broadcast in Indonesian and Arabic Languages.\" U. S.\nDepartment of State Bulletin, XXII (January 9, 1950), p. 65.\n-, \"VOA to Broadcast in Ukranian and Turkish Languages.\" U. S. Depart-\nment of State Bulletin, XXI (December 19, 19b9), p. 9UU.\n-, \"VOA Gets Powerful New Medium-Wave Relay in Munich.\" U. S. Depart-\nment of State Bulletin, XXI (September-12, 19h9)} p. U03.\n-, \"VOA Highlights Diffenences Between Soviet International and Internal\nPropaganda.\" U. S. Department of State Bulletin, XXI (December 19, 19k9),\nP. 31. ‘\n-f »Y0A Increases Service to China and Far East.\" U. S. Department of\nState Bulletin, XXI (August 15, 19h9), p. 239.\n-f nvoice of America Broadcasts Atlantic Pact Ceremonies.\" U. S.\nDepartment of State Bulletin, XX (April 10, 19h9), p. U58.\n-, \"Voice of America Jammed by 205 Soviet Stations.\" Science News\nLetter, LVI (September 3, 19U9), p. 156.\n--, \"Voice of America Opens Studios in Washington.” U. S. Department of\nState Bulletin, XX (January 16, 19U9), p. 83.\n-, \"Voice of America to Iran Inaugurated.\" U. S. Department of State\nBulletin, XX (March 27, 19U9), p. 396; (April 3, 19“ii9), pp. L31-2;"
}