{
  "id": "d816-4",
  "text": "-3-\n-} '‘People’s Air Lanes Need Scrubbing.” Christian Century, LXVII\n(April 12, 1950), p. U52. ---\n-, “Radio Give-Away Answers Desperate Need of Many.” Science News\nLetter, LVI (November 26, 19U9), p. 3li5.\n-9 ”Schoolmen Discuss TV, Radio, Movies.” Secondary Education, XIV\n(February 1950), p. 9.\n-- “Sounds.” Commonweal, LI (December 30, 19i;9), p. 33U.\n-y “Wildest People.\" New Yorker, XXV (February h, 1950), pp. 21-2.\nBard., A.S., “Right to an Unannoyed Journey.” American City, LXV (February 1950),\np. 163.\nBlock, Ralph, “Propaganda and the Free Society.\" Public Opinion Quarterly, XII\n(’Winter 19U8-U9), pp. 677-86. --\nBoutwell, William D., “Radio, Industry or Art?\" English Journal, XXXVIII\n(November 19l;9), p. 525.\nBrecher, E.M., “Television, Radio; Captive Audience.” Consumer Reports, XV\n(February 1950),* Discussion (l^rch 1950), p. 98,\nCarruth, H., “Malediction Against Radio Announcers: Lack of Proper Language for\nPoetic Drama Today.” Poetry, LXXIV (Seotember 19h9), pp. 331-5.\nCarson, Saul, “On the Air: The Reformed Gadfly.”\n1950), p. 22.\nNew Republic, CXXII (Mirch 13,\nChester, Giraud, \"A Reply to Fulton Lewis, Jr.” Public Ooinion Quarterly, XIII\n(Winter 19l;9-50), po. 733-6. --\nf “What Constitutes Irresponsibility on the Air: A Case Study,”\nPublic Opinion Quarterly, XIII (Spring 19U9), pp. 73-82.\nCrosby, John, “Dear Sir, You Cur,* Radio Listening Public Writes in Anger.”\nColliers, CXXIV (December 10, X9U9), pp. 25 /\nErnst, Morris L., and Loth, David, The People Know Best. Washington, D.C.: The\nPublic Affairs Press, 19^9. P. 2H9I -\nFitzgerald, Stephen E., Communicating Ideas to the Public. New York: Funk and\n1/agnails Co., 1950. P. xv / 267, --“\nFrank, Josette, Comics, Radio, Movies—and Children. New York: Public Affairs\nCommittee.\nGilburt, S.G., “Disowning Miss Brooks.” Journal of Education, CXXXII (May 19h9),\nGodman, S., “Menace of the Radio.\" Catholic -World, CLXIX (July I9U9), p. 312.\nGould, J., “TV Daddy and Video Mama: A Dirge.” New York Times Ifegazine. (May lii.\n1950), pp. 20 /. -----9 v J 9\nLarrabbee, Carlton H., “Radio, a Public Servant.” English Journal, XXXVIII\n(February 19h9)} pp. 92-iu —*--—"
}