{
  "id": "d1804-0",
  "text": "Vol. IV, No. 6 DuPont Circle Building, Washington 6, D.C. April 15, 19&3\nHOUSE APPROVES ETV FACILITIES FUNDS\nOn April 9, the House of Representatives passed the HEW supplemental\nappropriation bill which includes $1,500,000 to implement the ETV Facilities Act\nof 1962. The Senate committee hearings on this bill have already been held and it\nis anticipated that the Senate will, within a week or two, approve an appropriation\nof $2,000,000 and that a compromise of $1,750,000 will result. The House bill\nprovides $75,000 for operation of staff and offices for ETV in HEW and USOE, with\nthe balance for ETV grants. Although the appropriation is a supplement for the\npresent fiscal year (ending June 30, 1963), the funds (except for the $75,000 for\noperations) do not have to be expended or even committed by that date, but may be\ncarried over into the next fiscal year.\nRULES FOR MAINTENANCE LOGS\nThe FCC has issued the text of the rules on Transmitter Inspections, Maintenance\nLogs, and Automation which it proposes to put into effect May 10, 1963. However, it\nis understood that the Commission has received such extensive reaction to the proposed\nrules that they may call for official comments, in which case the effective date of\nany rules would probably have to be postponed as much as 90 days. The presently-\nproposed rules would require all AM and FM stations to make transmitter inspections\nfive times per week and would require all AM, FM and TV stations to maintain a third\nset of logs (in addition to present program and operating logs) to be called\n''Maintenance Logs.” The proposed rules are so bulky that the FCC cannot honor requests\nfor copies. However, they may be found in the Federal Register (which is available\nin most libraries) for Feb. 28, 1963 (#28-FR-l872), in case any wish to examine the\nrules and send reactions to the FCC. The NAEB will watch this situation and keep you\nadvised.\nHULL NAMED TO HEW GROUP\nRichard Hull, NAEB Board Chairman and Director of the Telecommunications\nCenter, Ohio State University, has been named to the Board of Directors of the new\nCommittee for the Full Development of All-Channel Broadcasting (see Washington Report\nVol. IV, No. 5, March 15, 1963). Three sub-committees have been set up within the\noverall committee: Committee on Technical Development, Committee on UHF Broadcast\nStation Operations, and Committee on Consumer Information. NAEB Vice President Harold\nHill has been named to this latter committee.\nNAEB SUPPORTS FLORIDA ETV PETITION\nThe NAEB is filing comments with the FCC in support of the Florida ETV\nCommission's Petition for Rule Making seeking to move Ch. 22 from Lakeland to Tampa,\nand to reserve Ch. 22 for educational purposes (through operation by the University\nof South Florida)."
}