{
  "id": "d1674-2",
  "text": "3\nExecutive Committee\nJValdo Abbot, University of Michigan, Ann Arbor.\n.John W* Dunn, TiVNAD, University of Oklahoma, Norman*\n.Richard B* Hull, WOT, Iowa State College, Ames.\n'Milford C. Jenson, WCAL, St. Olaf College, Northfield, Minn*\n.James S. Miles, WBAA, Pu,rduo University, Vv* LaFayette, Indiana\n. Russell Potter, Columbia University, New York City.\nExecutive Socretary\n' Morris S* Novik, Room 5052, 30 Rockefeller Plaza, New York, Now York.\nNOVIK ACCEPTS SECRETARYSHIP\nAt the East Lansing Convention, the officers and Executive Committee extended\nto Morris S. Novik an invitation to serve as MASS Executive Secretary for the next\nyear. He was reluctant to accept the post, and.requested time to consider the\nmatter.\nOn November 8, the acceptance camo' (draft, he calls it) in a phone call to\nPresident Engel. Earlier he had explained that he was reluctant to accept the\nassignment because ho is no longer associated with the educational station which\nbrought him his first affiliation with NAEP, arid because- he feared what his present\nwork with commercial broadcasters might impair his usefulness to the organization.\nThese objections were overruled.\nMorris will devote the major portion of his, efforts in behalf of ITAEB to pro¬\nmotional Activities. He will keep an,ear to the ground (and an eye to the sky) for\nways in which the organization can be strengthened in order to render a greater\nsorvice to its members.\n■ The News Letter will, be published through the president’s office, with the\nassistance of' F. B. McCarty. This change was recommended to relieve Morris of an\nadded burden. This arrangement is subject to change, (any volunteers?) Each\nmonth hereafter, the Executive Secretary will have a section in the Nows Letter\nin which he reports on developments of interest to NAEP members.\nMEMBERS REPORT\nKWSCL-Washington State College, Pullman.\nJohn Frere has returned to the station as chief engineer after serving with\nthe Armed Forces Network.\nJohn Blake, newly appointed KiLSC production manager, visited Los Angelos radio\nstudios in October and also took time out to address the Stephens College radio\nconference•"
}