{
  "id": "d1074-0",
  "text": "/\nN-A-E-B NEWS\nE T T E R\nNational Association of Educational Broadcasters\nMadison, Wisconsin — February 17, 1936\nA LETTER FROM THE \"PREX\"\nGreetings!\nBack from three months’ observation of broadcasting in Great Britain, I am\nglad to send to our members and friends my cordial greetings and a brief account\nof my impressions*\nLet’s pass quickly over the formal acknowledgment of the honor you did me\nat the Iowa City conference. Not that I treat lightly the honor of this posi¬\ntion — I am highly sensitive to that. But I am more concerned with the work,\ninvolved. There’s work aplenty — and for all of us — if educational radio is\nto take advantage of current unrest and activity and emerge fullstatured and\nstrong.\nMy trip was only part of a general effort to discover the best in radio\nabroad and to bring about an exchange of ideas and experiences. Lester Ward.\nParker of Rochester, New York, has just returned from a six months’ fellowship\nin Great Britain, making a most exhaustive study of school broadcasting. Tracy\nF. Tyler spent several weeks abroad, observing radio on the continent as well\nas development of the British Broadcasting Corporation* High officials of both\nnational networks were on a tour of observation in Europe during the late sum¬\nmer. Last month Felix Greene, personable young man whom I had the pleasure #f\nknowing in London, arrived in New York to establish representation and head¬\nquarters for the BBC in this country* And now, at the invitation of the\nGeneral Education Board, Professor Arthur Lloyd James, Honorary Secretary of\nthe BBC Advisory Committee on Spoken English, has come over from England for\na visit of four to six months. Professor Lloyd James has been close to radio,\nduring its growth in Great Britain, and his observation on American broadcasting\nwill be invaluable. To him Parker and I are much indebted for wise, friendly\ncounsel and guidance on our studies*\nThere is, then, considerable activity towards interchange and understanding.\nThis should result in real gain for American Broadcasting. There is much.we\ncan learn about good taste, about high level of program content, about unimpas¬\nsioned interpretation of events> about true emphasis^ about careful planning\nwith supplementary printed aids -- and, of course^ about publicly-supported\nbroadcasting service under the control of a public corporation.\nfor specific program ideas and presentation techniques -- it is natural\nthat the United States, with more than 600 stations Outdoing each other for\nlistener attention, should show faster grovrth. And frankly, the impersonal,\nstyle of radio address in Great Britain occasionally slips into seeming indif¬\nference, with a definite lack of vitality. Much of our American broadcasting,\non the contrary, in its feverish effort to grab and grip the attention of the\nlistener, is super-charged with artificial fervor. It is guilty of misplaced\nx\\"
}