{
  "id": "d1074-1",
  "text": "-2-\nstress and excessive dynamics, We \"dramatize\" history, for example -- we \"dram¬\natize\" science —we put geography into thrilling travel adventures — and if\nwe aren’t careful, we’ll have a nation of listeners who believe that acquiring\neducation by radio is just an effortless surrender to the emotional stimulation.\nYes, we can learn much from the British about substantial motives and\nvalues. And we can learn, most of all, that the principle of publicly-supported\nbroadcasting service works. It truly serves the people. The best evidence of\nthis lies in the fact that the ten year charter of the British Broadcasting\nCorporation, which expires this year, will not only be renev/ed but strengthened,\nwith provision for a larger share of the radio tax of ten shillings ($2.50) per\nyear. The recent report of the Parliamentary committee surveying the work for\nthe BBC was most favorable and commendatory. This should give great encourage¬\nment t« those of us who are endeavoring to make a place in the American system\nfor non-commercial public broadcasting service.\nFurther reports on the various studies abroad will be made available to our\nmembers as soon as possible, I shall be glad to receive specific inquiries, if\nthere are any.\nThis is indeed a time of aroused interest and questioning about fundamental\nprinciples in broadcasting'and radio education. Let’s give to the solution of\nthe problem our alertness, our best thought, and our concerted effort.\nSincerely yours,\nH,B, McCarty\nPresident N,A,E,B,\nIMPROVEMENT OF FACILITIES\nAmidst rumors of ro-allocation of radio facilities, what are your plans for\nimprovement now and in the future?\nD« you have an application in, or ready, for a more favorable assignment or\nincrease in power? Have you had any recent denials by the Federal Communications\nCommission? -What is your present and prospective situation in regard to facil¬\nities? For best representation of our entire membership, the officers of our\nassociation should be kept informed of plans and applications,\nWEAR, Michigan State College, East Lansing, has been granted a favorable\nchange in frequency from 1040 to 850 kilocycles,\nWHA has an application pending for increase of power to 5000 watts on its\npresent channel of 940 kilocycles, daytime.\nLet’s have news of the physical plans of other educational stations. Write\nMcCarty or Engel nowl\nNational Association of Educational Broadcasters Officers\nPresident: H,B. McCarty, WHA, University of Wisconsin,\nVico-Prosidont: W.I. Griffith, WSUI, Iowa State College,\nSecretary-Treasurer: B,B, Brackett, KUSD, University of South Dakota*\nExecutive Secretary: Harold Engel, WHA, University of Wisconsin,"
}