{
  "id": "d1074-4",
  "text": "-5-\nTHE MUSIC COPYRIGHT WAR\nIn spite of tho violent music copyright conflict, practically nothing has\nhappened to affoct tho freo license status of educational stations. Collection\nof license fees has been, and continues to bo, based upon \"public performance\nfor profit.\" Non-commercial stations are, therefore, exempt from payment of\nroyalties, and tho exemption allovrcd by A.S.C.A.P. is also extended by tho\nWarner Brothers group of publishers that withdrew from A.S.C.A.P. It is es¬\nsential, however, that each station make individual application to tho Music\nPublishers Holding Corporation for a free license. No blanket arrangement can\nbo made for our entire N.A.E.B. membership. The following letter states the\nmatter clearly:\n321 West 44th Street\nNow York\nJanuary 10th, 1936\nTho National Association of Educational Broadcasters,\nUniversity of Wisconsin\nMadison, Wise.\nGentlemon:- Atton:- Mr. H. B. McCarty\nReplying to your letter of January 8th, our present\nplan is to grant licenses to Colleges and non-commercial stations\nfree of charge. It will however be necessary to send out, from\ntime to time, a list of numbers that must bo restricted from all\nbroadcasting stations.\nBy stations owned and operated by colleges, churches\nand other non-commercial stations, vrc moan broadcasting stations\nthat do not sell any timo for advertising purposes. If a sta¬\ntion is sponsored by Religious or Educational Institutions, they\ncome under the category of ’free licensees’.\nIt will be necessary for each individual station to\nmake application to us, advising us of their purpose of opera¬\ntion. Upon receipt of such application, wo will issue a free\nlicense, as stated above.\nVery truly yours,\nMUSIC PUBLISHERS HOLDING CORPORATION\nHe man Starr (Signed)\nPresident\nAMERICAN SOCIETY OF RECORDING ARTISTS\nMany stations are receiving notices that fees for the use of recorded music\nmust be paid to the American Society jf Recording Artists. Tho matter is now\nbeing investigated by our Association. As soon as information is received con¬\ncerning tho arrangements to be made ftr non-profit stations, our mombors will\nbe notified at once. This should bo within the next fow days."
}