{
  "id": "d1074-5",
  "text": "-6-\nLEGAL REPRESENTATION IN YA,SAINGTO_N .. ,\n-One sorvico*To~*oducatTonal stations no longer possible under the reduced\nbudget of the National Committee on Education by Radio is the free legal counsel\nof Attorney Horace L. Lohncs, formerly engaged on a partial retainer basis. The\nfollovhLng letter will bo of interest to our mombers:\nLaw Offices\nHORACE L. LOHNES\nMunscy Building\nWashington\nJanuary 23, 1936\nMr. H.B. McCarty, President,\nNational Association of Educational\nBroadcastors,\nRadio Station WIIA,\nMadison, Wisconsin\nDear Mr. McCarty:\nAs you have no doubt boon advised, my contract with the\nNational Committee on Education by Radio has expired and my ser¬\nvices arc no longer available to members of your organization in\naccordance with the terms thereof.\nI want the members of your .association to lenow, however,\nthat I still retain my interest in the matter of educational,\nbroadcasting and that I deeply appreciate and cherish the friend¬\nships made as a result of this past relationship.\nIf I can bo of any service to the members of your Asso¬\nciation I trust that they will not hesitate to call upon me. I\nshall look forward to seeing each and everyone of the station\nrepresentatives whonovor they are in Washington.\nCordially yours,\nHorace L. Lolines (Signed)\n1936 N.A.E.B. CONVENTION — WHERE?\nYour secretary has been receiving invitations from convention hotels xrom\nNow York to Florida to Colorado making bids for the 1936 convention of the\nN.A.E.B. At the 1935 meeting at Iowa City it was decided to continue the pol¬\nicy *f mooting at a city whore cnc of our member stations is. located. Between\nnow and the time the next news-letter goes out invitations will bo received\nfrom member stations wishing to serve as host to the 1936 convention. By hold¬\ning these meetings in various places, wo will all, in time, got to see the\nother follows* studios and equipment.\nIn the next news-letter youTll have a report, and a chance.to express your\n•pinions regarding the mooting place."
}