{
  "id": "d1108-3",
  "text": "4\nThe trade press reports that some Commissioners are in favor of a general\npolicy of conditioning translator grants in this manner. At the present\ntime. Section 74.732(e) of the Rules provides that VHF translator grants\nwill not be made to commercial television stations:\n(1) Where the proposed translator is intended to provide\nreception beyond the Grade B contour of the television\nbroadcast station proposed to be re-broadcast.\n(2) Where the proposed VHF translator is intended to\nprovide reception to all or a part of any community located\nwithin the Grade A contour of any other television broadcast\nstation for which a construction permit or license has been\ngranted and the programs rebroadcast by the proposed VHF\ntranslator will duplicate all or any part of the programs\nbroadcast by such other television broadcast station or\nstations; Provided, however, that this will not preclude\nthe authorization of a VHF translator intended to improve\nreception of the parent station's signal to any community,\nany part of the corporate limits of which is within the\nprinciple city service contour of such station.\nAs a direct result of comments filed by interested educational groups,\nthis above provision of the rules does not apply to educational television\nstations. In view of the active interest in applying more stringent\nconditions upon translator operations, ETV interests should be vigilant\nthat additional amendments to the translator rules contain appropriate\nexemptions for educational interests. This is of particular importance\nbecause of the relatively large number of translators now operated by ETV\nstations to provide better and wider coverage for their signals.\n7. Property Rights. A viewpoint that is voiced strongly in the\ncomments, including active support by NBC and ABC, and active opposition\nby NCTA, is that the Commission's proposed rules should contain explicit\nrecognition of property rights in television signals. While the Commission\nhas indicated that it does not propose to deal in these proceedings with\nthe question of whether there is a property right in broadcast signals\ncarried, some commenting parties have argued that the rules as proposed\nappear to recognize rights of local stations to \"require\" carriage of its\nsignal, and \"permit\" CATV operators to carry outside signals in certain\ninstances. Because of this, parties such as ABC urge the Commission to\nmake it clear that any such authorization by the Commission is not intended\nin ABC's words, to \"derogate from any common-law or statutory rights,\nincluding those of copyright and unfair competition, which any person,\nincluding a Federal Communications Commission licensee, may have in\nprograms thus placed on a cable system.\" Parties such as NBC and station\nKCOY-TV, Santa Maria, urge that CATV systems should, like translator\nstations and regular television stations, be required to obtain the consent\nof the originating station to rebroadcast its programs."
}