{
  "id": "d1633-1",
  "text": "SKQRNIA TO GSIiMANY (CONT.) ~2^\nassignment: \"to raise the general level of production at all (German) radio\nstations.”\nSkornia will be stationed at Radio Eerlin, Stuttgart, Munich, and Frankfurt. His\nassignment with OMGUS includes production duties, training of personnel, selection\nand enrichment of progress resources. Currently great shortage of German radio is\nlack of material to broadcast.\nSkornia is taking with him many scripts ranging from programs on family adjustment,\nhistory, science, art, literature, social science, and many others. He plans on\nusing scripts from other NAEB stations including WHA (University of Wisconsin)\n\"Following Congress,” \"Adventures in Our Town,\" and many others.\nNeed is to tell the truth about America whether it be the truth about health, the\ntruth about how oranges are groY/n, the way American roads are built or New England\ntovrn meetings run.\nAll.NAEB stations are requested to make script contributions to Dr, Skornia. Two\ncopies of each script are needed, because the paper shortage is one of the acute\nproblems in Germany. His address is c/o New Arrivals Section, 25 Base Post Office,\nAPO, Postmaster, New York City.\nFREEDOM CF INFORMATION\nUN Freedom of Information Session makes gains. The six United States delegates\nto the United Nations Conference on Freedom of Information and the press say the\nconference made a \"remarkable\" accomplishment.\nThe delegation—headed by former Assistant Secretary of State William Benton—\nsubmitted a detailed report to Secretary of State Marshall. Despite the black\npessimism that preceded the conference, the group listed many concrete accomplish¬\nments.\nThe delegation pointed out that of the 45 decisions made, the American delegation\nsupported 41* And it said that more than 20 proposals and amendments which the\ndelegation thought Y/ould cripple freedom of expression uqtq decisively defeated.\nThe delegates omphasizddthat the conference marked a decided change in the general\npolitical attitudes of most of the nations of the Western World during the last\nfew months#\nUBOE-FM. CLEVELAND PUBLIC SCHOOL STATION\n\"Get the Answer Right\"—a program aimed at 7th grade Math classes. Dramatic epi¬\nsodes presont ten problems in mental arithmetic. Each dramatized situation in¬\nvolves the selection of the facts necessary to the problem. All four fundamental\noperations—addition, subtraction, multiplication and division are included. Teams\nfor competition provide audience interest. (Program directors can well spend time on\nstudy of VJBOE’s Y/eekly bulletin of programs. Write Ed Helman, station director,\nCleveland, for details)."
}