{
  "id": "d1633-10",
  "text": "-11-\n\"IKFORilATION PLL^SE’’ PRODUCERS .COUNTER-SUIT BY MUTUAL\nMutual Broadcasting Company, in a mid-May counter suit in New York U.S. District\nCourt denied charges of negligence made against the radio network by Dan Golenpaul\nAssociates,who sought 500,000 dollars damages against MBS.\nGolenpaul Associates charged Mutual had failed to get a national sponsor for the\nshow, violated the contract by permitting FM broadcast, and failed to get a proper\naccounting from local stations using the show.\nMutual’s counter suit claimed 100,000 dollars and asked dismissal of the first\naction, charging that the programs were not always of high quality or always suit¬\nable for broadcast and that the producers had created ill will by forbidding use\nof recordings of the programs at schools and civil meetings.\nUNIVERSITY OF MINNESOTA GETS NAVY AUDIO-VISUAL AIDS GRANT\nBurton Paulu, manager of NAEB station KUOM (University of Minnesota) reports the\nNavy has allotted £>20,000 to the university for research in readership, listener-\nship, and the reaction of people to various types of nev/spaper stories, pictures,\nradio programs, and magazine articles.\nCBS URGES UNIFORM TIME LAM\nCBS voiced the view of many broadcasters in urging Congress to pass a uniform time\nlaw to give radio listeners and the industry itself a \"break”. Earl Gammons, CBS\nvice-president spoke for the network. He reported CBS will spend some 200 thousand\ndollars for additional lines and services to help solve the problem during the\nsummer months.\nN-A-S-B SALUTES PORTLAND PUBLIC SCHOOL STATION\nOne of the unique broadcasting stations in the U.S. is NAEB Station, KBPS,\nowned and operated by the Portland Public School System, Second^in the\nPortland area to receive a federal radio license, KBPS was the first pub¬\nlic school institution in America to be given a standard wavelength—and\nto this day is the only school district in the U. S. broadcasting on a\nstandard wavelength.\nThis year KBPS celebrated its 25th anniversary, listing an impressive\nrecord of accomplishment both in student benefits and public services,\nsince Benson Polytechnic pioneered the facl.litvback in 1923. Among the\nmillions of dollars of assets belonging to Portland’s public schools.\nthe most coveted is this ethereal property--the KBPS wavelength which the\nschool district holds by virtue of a farsightedness seldom, associated with\nschool systems.\nUnder the direction of Patricia Green, the station broadcasts between 11 a.m,\nand 4 p.m., furnishing a variety of special sorvicesQn joyed and used not only\nby the public schools but by adult listeners in the general radio audience\nin the region. The district has requested longer hours of operation for\nKBPS.\nSuperintendent Paul Rehmus, congratulating the Benson staff on its anniver¬\nsary said:--\"Radio is education’s latest instrument. Its success has been\nalmost miraculous, not alone for the children in the classroom, but for\nthe entire population of the world. Never has so much been accomplished.\nin so short a time with so small an expenditure._Yet in spite of the fact\nthat almost every homo has a radio and every wavelength throbs with sound,\nits potential value hasn’t even begun to be realized.li"
}