{
  "id": "d1633-16",
  "text": "-17-\nHIGHLIGHTS CF NAB MEETING\nMay 18-19. LOS ANGELES\nFCC CHAIRMAN COY VIE17S RADIO FUTURE\nFCC Chairman Wayne Coy says that radio’s future must be planned within the formula\nof private operations. Says Coy: ”1 know of no responsible person in the govern¬\nment, including the FCC, who favors government operation of broadcasting.”\nCoy says no medium has a more powerful role than radio in the effort to make the\nU.S. a more complete democracy by bringing together the varied groups of its popu¬\nlation and by bringing the people closer to the government. Coy applauds those who\nappreciate that they must operate their stations as public service institutions for\nthe community and nation. ~ ™ ~ .~ ~\nThe FCC Chairman says the FCC is determined that there will be enough channels avail¬\nable to provide a nationwide competitive television system which will serve all the\npeople and not just those fortunate enough to live in metropolitan areas. He says\nall channels will be assigned within a few months and adds the hearing on television\nSeptember 20 is to plan for the future.\nOn static-free FM, Coy says he is hopeful that the time is not too far off when the\nmajor networks as well as the more youthful FM networks will provide facilities\npermitting the demonstration of the high fidelity capabilities of FM.\nCoy revealed that FM allocation plans provide for uniformity of power within a given\narea._This will eliminate present competitive inequality between AM stations.\nCompetition between FM’s will be on the basis of quality of programming, initiative.\nenterprise and imagination in serving \"the public interest.\nThe public looks to the broadcasting industry and the FCC for continuing improvement\nin the quality of radio service and Coy points out that the people have invested\nmore than four times as much in receivers as the broadcasters have in equipment.\nNew sets, tubos and repairs each year total 50% more than the four hundred million\ndollars expended by advertisers on sponsorship of their programs.\nNAB ADOPTS STANDARDS QF PRACTICE,\nThe much discussed and hotly debated ’’code\" for American commercial radio\nwas finally adopted at the Los Angeles meeting of NAB. Action followed\na convention code in which delegates instructed board of directors to\napprove the measure to become effective July 1, but will not affect con¬\ntracts now in existence. Twenty-one members of the board voted for the\nstandards. One was absent, two were excused, and one voted \"no.” He\nwas Edward Breen, manager of KVFD, Ft. Dodge, Iowa\nBAKER SAYS\nNAB Research Director Kenneth H, Baker says that although the net number of stations\nis gaining, the number abandoning the field also is growing. In 1947, 36 AM and 26\nFM stations left the air. In four months of 194&, 22 .AM and 32 FM stations dropped\nout. He warns radio operators must \"keep on the ball” to stay ahead of education.\nBaker says there are now 97 authorizations for television stations and 25 of these\nhave developed in the last three months. 200 applications are pending."
}