{
  "id": "d1633-18",
  "text": "N-A-E-B BUSINESS PAGE\nnovik mayflorer testimony\nOur secretary, M. S. Novik, made an excellent and basic statement before the FCC\nin the editorial hearings last March. Copies of the statement will be made avail¬\nable on request. Briefly, Novik made these points:\n1. Essential belief in spirit of the Mayflower decision which he thinks was\nbased not so much on the fact the licensee editorialized as the fact there\nwas no effort made to present the opposite point of view.\n2. Believes no basic difference in station obligation in presenting (a) edi¬\ntorial (b)one side of controversial issue by someone other than licensee,\n(c)political speech. (Same basic fabric).\n3. YJhen the FCC said a \"Broadcasters cannot be an advocate,\"theymeant to\nand should have conveyed the thought, \"A station cannot be an advocate.\"\n4. If the FCC decides only a licensee may not editorialize, a rule is suggest¬\ned whereby the station, speakers, or employers could editorialize provided\nobligation is placed on licensee to present with equal opportunities and\nskill, in a similar manner, opposing points of view.\nRecommends\n5. in either event the FCC sets forth clearly and unequivocally obligation\nof licensee to present well-rounded discussions of all controversial issues.\nThis was original intention of Congress.\nSTATION COVERAGE MAPS\nNAEB central office is still trying to compile complete coverage data of all member\nstations—actual and potential. Will each station please send .5 millivolt contour\nmaps to R. B. Hull, WOI, Ames, Iowa? To date KUOM(University of Minnesota) and\nWBAA (Purdue University) have checked in. We are waiting for others. Original\ninstructions requested a certain-type Rand McNally map. Give us any project on\nany good county map. Also please include any other data you may have such as BMB\nsurveys. Conian surveys, etc. The contour map is most needed, however, as an esti¬\nmate of potential, Lhen these data are in. a complete compilation will be done.\nand copies made available to each member.\nBILLBOARD OHIO INSTITUTE QUESTIONNAIRE\nIt is suggested each member who has received this answer it with due and proper care\nIt is an opportunity to make a fair evaluation ©f the Institute. Some have felt\nmuch of the industry criticism of Columbus has prompted undue sensitivity. Colum¬\nbus has definitely not been a battleground between educators and commercial radio\nfor many years. And it will be highly unfortunate if the attitude should resume.\nMany commercial broadcasters have not been aware of what actually goes on at\nColumbus (e.g.,opening session comments by N.Y. commercial representatives was\nbased on 10-year old data).\nHUNTER’S INK ARTICLES ON TELEVISION\nMembers interested in TV might wish to writb PRINTER’S INK, 205 East 42nd Street,\nNew York 17, N.Y., for a list of articles in that publication on television.\nSPECIAL REPORTS FOR MEMBERS\nTwo special reports—one on radio copyright for NAEB member stations—and another\nshowing a special cost-accoupting metjipd for programs at KUQM(University of Minn.)\nwill shortly be on their way to NAEB members. (Prepared by Burton Paulu),"
}