{
  "id": "d1633-21",
  "text": "IN GENERAL..\nOHIO INSTITUTES HIGHLIGHTS\nThis was the 18th Institute of Education by Radio with Ohio State University as\nhost. It still remains the oldest and largest—and i#0^ways-—the best general\nradio meeting in the U.S.—and this year, as usual, it attracted a significant\nsprinkling of registrants from Canada and other countries. And special sessions—\nthe strength of the meeting—for religious radio, radio councils, campus stations,\neducational stations, specialized programming groups, television, etc., were pro¬\nvided,\nATTENDANCE\nRegistration, which approached the thousand figure, was down somewhat from last\nyear. Some attributed this to an alleged industry boycott which was explained\nas \"weariness on the part of commercial broadcasters at constant criticism there\nby educators.\" Others felt the \"round-robin\" approach with an eight, not a three-\nring circus, in past years had discouraged some old-timers from attending. Other\nold-timers forget what is \"old\" to them is \"new\" to the rising generation.\nAN OLD' TUNE\nDisappointing—and at the same time—stimulating was the opening session when six\nNew York producers based nearly all their remarks (it was their first attendance\nat the Institute) on beliefs and conditions which existed in part 10 years ago,\nbut no longer prevail. It had the effect of \"straw man\" argumentation.\nTed Cott, YJNEW, for instance, said commercial radio can help educate the nation and\nstill make money, which very few indeed v/ill refute. Current critics, point out\nwith considerable truth, they can but they haven’t.\nHe further attacked the \"belief\" that only stations unhampered by advertising\ncould produce effective public service programs, maintaining when more effective\neducational programs are written and produced, the job will be done by commercial\nradio.\nA POINT OF VIEW\nN-A-E-B, primarily concerned with public service problems for its 50 member\nstations kno?/ as any sociologist or survey expert knof/s--that U. S. Population\nis a \"seven layer\" cake. While population strata are by no means frozen in\nterms of U. S. Income, education, v/ants, and needs, at any given time there\nare different groups of people Y/ho ?/ant different things—from radio—as v;ell\nas other sources,\nN-A7E-B, operating non-commercial educational stations attempt to serve tY/o or\nthree of those layers, know full Y/ell commercial radio simply by virtue of its\nsize (number of stations) must serve most of the U.S, population. Our function\nis special service broadcasting, research, and program development.\nBy no conceivable stretch of the imagination is this an \"either-or” situation.\nNAEB has no doubts of commercial radio’s ability and skills, looks to it to do\nthe job.\nThe thing is to have the job done, consistently and well, in good program periods,\noften enough for effectiveness, and not, as so often has been the case, merely for\nthe FCC record."
}