{
  "id": "d1633-24",
  "text": "-2.5-\nsuccessive six-month period, respectively, and not less than tv/o hours in\neach of the seven days of the week and not less than twenty-eight hours per\nweek thereafter.\nThis would apply to stations operating on special temporary authority or pro¬\ngram tests, as well as during the license period.\nTest or other fixed patterns would not be counted.\nIf prior to May 28 the Commission receives any comments \"which appear to warrant\nthe holding of an oral argument\" a hearing will be scheduled.\n**** ****\nKITTNER NOVJ ASSISTANT TO FCC COUNSEL\nJoseph M. Kittner became assistant to the FCC General Counsel last week, having\nbeen promoted from his position as chief of the Law Department’s Litigation Section.\nMr.Kittner, who has been a member of the FCC legal staff since December 1941, fills\na vacancy created by the resignation of David C. Adams.\ny -V y,,.\\z V v v.v\nA A <V a A A A *A\nAPPLICATIONS (AMPLITUDE MODULATJCi) COLLEGE. ~UNIV~EILl^^m^TIONAL~\n1400 KC-Construction Permit\nNED- Harding College. Searcy, Ark., - Construction permit for a new Standard Broad¬\ncast Station to be operated on 1400 kc., power of 100 watts, and unlimited hours\nof operation.\n870 KC - Construction Permit\nDKAIi- Michigan State College, East Lansing, Mich. - Construction permit to install\na new transmitter, to make changes in vertical antenna, and mount FM antenna on AM\ntower, and change in transmitter location.\n■%***' ***.-*\niAFFLICATla?S~TraE55ENCY MODULATION)' COLLEGE, UNIVE^mT~ANb~\nFor Modification Construction Permit\nBoard of Education of the San Francisco Unified School District. San Francisco,\nCalif.- Modification of construction permit~7B5~PED-64, as modified) which authori¬\nzed a new non-commercial educational FM broadcast station, for extension of com¬\npletion date.\nFor Modification Construction Permit\nKSIH- Board of Education of the City of St.Louis. St. Louis.^Mo. - Granted modifi¬\ncation of construction permit to change transmitter and studio locations and make\nchanges in antenna system. (BMPED-115).\nFor Construction Permit\nNED - Tacoma School District No. Ten, Tacoma, Dash. - Construction permit for a\nnew non-commercial educational broadcast station to be operated on 91.7 me.,\nChannel 219.\nFor Modification of CP\nKPAC-Port Arthur College, Port Arthur. Tex. - Modification of construction permit\n\"[B3-P-5125, as modified, which authorized increase power, install new transmitter\nand change transmitter location) for extension of completion date."
}