{
  "id": "d1633-3",
  "text": "TELEVISION HIGHLIGHTS\nFILM STUDY FOR TELEVISION USE\nDr. Cyril StaucL director of research for the Eastman Kodak Company, reports\nestablishment of studios in Rochester for study of the photographic properties\nof the image on the motion picture screen—and the relation of these properties\nto the image on the television screen. Staud saws the study this far (advertis¬\ning\" shows and newsreelsTindicate prints which give good quality on motion picture\nscreens, also give satisfactory images when transmitted by television.\nTELEVISION CALLED POTENT EDUCATIONAL FACTOR\nEdwin Hinck, sales manager of Industrial Television, Inc., reporting a test of TV\nat Nutley High School (New Jersey) quotes the school principal as saying, \"Tele¬\nvision can be not only a potent educational factor, but is valuable as a recreation¬\nal aid, in curbing juvenile delinquency and in the promotion of inter-group\nunderstanding and race and cultural relations.\" Television was used to bring\nstudents such events as UN meetings, convening of the Congress, and sports events.\nROCKEFELLER FOUNDATION GRANT'S TV TRAINING AT WESTERN RESERVE\nI The graduate school of Western Reserve University at Cleveland received $5000\nI from the Rockefeller Found at ion'-! or the extension of experimental television\nj programming work taking place in laboratories at YiIRU.\nPresident Winifred Leutner, announcing the grant said, the foundation support\n| will extend the training of advanced students and provide two fellowships of\n| $1,800 each to Kathryn Watson and Joan Rorimer, M.A. candidates. Among their\ni objectives: scripts suitable for television adaptation, TV scenery design,\nj TV play direction problems.\ni\nj WTestern Reserve University has worked in close cooperation with WEWS, Cleveland,\n| and Y:orking in cooperation with WHK, Cleveland, produced the first TV shoY/ in\nI that area. Director of TV instruction at MU is Professor Larclay S. Leathern,\n| head of dramatic arts.\nSTASSEN PREDICTS TV WILL BE 'VOTE GETTER1\nHarold Stassen.* Republican presidential candidate, v/as the first political figure\nto use TV as a vote-getter weapon as the initial guest in the new CBS TV series,\n\"Presidential Timber.\" Stassen regarded the appearance as a major event, and\npredicted the medium will in the future be included in the plans of all political\naspirants. Said he, \"As the night follows the day, all public figures will use\ntelevision.*1\nSPECIAL NOTICE TO N-A-E-B MEMBERS\nThe Board of Directors of the National Association of Educational Broadcasters is\nespecially interested in knovjing full details of television activity on the part\nof any member institutions or any educational institutions in any of the six\nN-A-E-B regions in the United States.\nTo date reports are very incomplete. From some indications it would appear a\nnumber of schools have cooperative production arrangements.with commercial tele¬\nvision stations of the kind now engaged in by Waldo Abbot at the. UnAycrsij.y_of\nMichigan (Ann Arbor) who produces programs for a Detroit station. Je solicit\nyour support in supplying information about existent projects,i planned ..projects\nor any contemplated applications. Please send ful1 information to your regional\ndirector or to Richard B« Hull, NAEB president, ~c7o Station W01» Ames.i.Iowa."
}