{
  "id": "d1633-6",
  "text": "SENATOR JOHNSON ASKS FCC TO HOLD UP CLEAR. CK..NNEL DECISION\nSenator Edwin Johnson (D.Colorado) who introduced S.2231. a bill to lj.mj.t^_tho power\nof clear channel stations to 50.000 watts\"and to reduce present standards of pro-\ntection to permit more stations on the air at night, has now requested the FCC to hold\nup its decision until ratification of the new North American Broadcasting Agreement\nhas been concluded (NARBA)\nPresent NARBA expires in March. 1949, but is now slated for a full-year1s_extengion.\nSenator Johnson^ resolution introduced last week would have the effect of holding\nup any clear channel decision until at least 1950 under these circumstances*\nSome Washington D.C. observers believe clear channel group strategy is to delay\nactivity on the bill (S.2231) and if possible to kill the measure in committee.\n(The Johnson bill hearings in April before the Interstate and Foreign Commerce\nCommittee have not yet been reported out) rather than see the bill hit Senate and\nHouse floors.\nOther observers feel the clear channel station group, in asking for super-power wa.s__\nto some extent engaging in a bargaining process (group asked for 750 >000 wattsjhogijag\nto so agitate the public and the legislators that a \"mark-down\" to the original 50,000\nyjatts and present status would actually leave them where they started or in full\npossession of present facilities.\nOther observers feel the super-power \"pitch\", at least on the part of many of the\nclear channel stations was quite genuine. From this sprang \"monopoly\" objections.\nThe nine NAEB stations in Minnesota. Michigan. Oklahoma. Iowa, find /liew York ^ntj^g.\nto follow developmonts in this more than 3-year old issue, still seeking alleviation\nof the' present FCC\"rules and permission\" to apply for permission to broadcast , at night\nto serve local audiences.\nMany farm groups still reiterate their belief that claims of clear channel broadcast¬\ners unique ability to serve rural groups are \"strategy\" claims only, and point, out\nthat service to agriculture must be localized in terms of \"cotton\" or \"peaches^\nor \"corn and hogs.\" and can only be done by local stations, not by \"big\" stations_\nwhich provide general service to large areas.\nFCC WARNS BROADCASTERS INTERFERENCE CHECKSLMUST BE HANDLED \"OFFICIALLY\"\nPrompted by the action of a WAGA (Atlanta, Georgia) engineer, who went to Havanna\nwith instruments for measuring broadcast signals to attempt an independent check on\nthe CMCV signal, the FCC pointed out that all interference questions should be pur¬\nsued through the North American Regional Broadcasting Engineering Committee.\nThe WAGA engineer was allegedly picked up by Havanna police,and Cuban radio authori¬\nties reportedly filed a complaint through the U. S. State Department.\nOREGON STATE BROADCASTERS PRESENT SCHOLARSHIPS AT KOAG\nThe three scholarships presented annually by the Oregon State Broadcasters Associ¬\nation • ill bo awarded Oregon State College and University of Oregon stude.nts,_qn„g.\nbroadcast Wednesday. June 2, at S p.m, from studios of NAEB KOAC,._J^hq._stat^_s^tj:onA\nat OSC and the U of 0. The scholarship committee of the OSBA, of which II. Q. Cox,\nKGW manager, is chairman, will present the awards to James K. Fulton, Eugene, attend¬\ning the U of 0. for work in radio and music; Richard R. Pooley, Corvallis, engineer¬\ning at OSC, for radio and engineering; and Virginia Robertson, school of education\nat OSC, for radio writing and production. The awards will be made annually__by„tho\nassociation to students of the two schools for work in the fields of music^eng^n-\neering, and writing and production, as they are allied to radio, ...The»..^cholarghj:R§\nare for a 100 each, and are awarded junior students to apply on,s o rdor-jr ea^i^ »"
}