{
  "id": "d1908-1",
  "text": "THE RADIO INSTITUTE OF THE AUDIBLE ARTS\nFlorida’s School of the Air\nThe university of Florida operates station WRUF\nat Gainesville, Florida, on a frequency of 620 kilo¬\ncycles, and with 5000 watts power. Garland Powell,\ndirector of the station, has analyzed the program for\nus as follows:\n“Our educational programs run between 35 and 40 per¬\ncent of the time. From 9:00 to 9:45 each morning we broad¬\ncast ‘Music Appreciation’ to the public schools of Florida.\nFrom 9:45 to 10:00 we have a domestic science period;\n10:20 to 10:30, public health talks; 11:30 to 12:00, the\n‘Symphonic Hour’; 12:00 to 1:00, the ‘Florida Farm\nHour’; 2:00 to 2:55, the ‘Educational Hour,’ dealing with\nimportant daily problems or public questions; from 2:55 to\n3:00, we have a period devoted to the ‘World Book Man’ in\nwhich an interesting question is asked and answered; from\n3:00 to 4:00 is the ‘Hour With the Masters,’ an operatic\nperiod with lectures and music dealing with the better things\nof music; at 6:00 o’clock each evening we have a fifteen\nminute period of lectures given by the various professors of\nthe University on different topics.”\nAdvantage to Rural Schools\nIn the musical appreciation manual, prepared\nfor the University of Florida’s “School of the Air,”\nPresident John J. Tigert is quoted as saying:\n“Radio enables the rural schools to enjoy the advantages\nof hearing the greatest educators. It will eventually bring\nsome of the advantages to the rural schools that the city\nschools now enjoy. A course given over the radio affords the\nsame instruction to all alike.”\nMichigan State College\nSix days a week an average of ten educational pro¬\ngrams emanate from the studios of the Michigan State\nCollege Station, WKAR, which is operated on a fre¬\nquency of 1040 kilocycles and 1000 watts power at\nEast Lansing, Michigan.\nDuring March the College is broadcasting programs\ndealing with the following subjects: Agricultural En¬\ngineering, Animal Husbandry, Bacteriology, Biology,\nBook Review, Business Trends, Campus News, Dairy¬\ning, Economics, Electrical Engineering, English,\nEntomology, Farm Crops, Forum, 4-H Club, Geology,\nHome Economics, Horticulture, Landscape Archi¬\ntecture, Market Reports, Michigan State College\nHour, Music Appreciation, Music, Pets, Physics,\nPoultry, Soils, Spanish Lesson, Spartan Theater of the\nAir, Sports Commentator, State Department of Agri¬\nculture, State Department of Conservation, State De¬\npartment of Education, and Travel.\nMost of the above programs are weekly features.\nThe biology course, entitled “Biology and a New\nDeal” is especially designed for biology classes in\nhigh schools and is presented each Thursday at 2:30\np.m., Central Time. A special study outline has been\nprepared for students participating in the course.\nUniversity of Michigan Radio Extension\nOver the facilities of WJR in Detroit, the Uni¬\nversity of Michigan presents series of programs in the\nfollowing fields: Parent Education; Classes in Stringed\nInstruments; Classes in Wind Instruments; Classes in\nElementary Singing; Michigan My Michigan Series;\nVocational Guidance Series; Language Series; Speech\nSeries; Student Health Series; and Series on Mental\nHygiene of Adolescence.\nIn addition to these programs, the University Night\nPrograms feature faculty discussions of current prob¬\nlems and of University research projects. Three morn¬\nings a week students in speech classes present labora¬\ntory programs, including campus news, dramatics and\ninterviews.\nMimeographed weekly announcements, listing\nspeakers, topics, days and hours, and containing brief\nreading lists, are mailed two weeks in advance of the\nprogram to any schools or teachers requesting them.\nIt has been the practice of the University Extension\nDivision to mimeograph and mail copies of talks for\nwhich more than twenty-five requests have been re¬\nceived.\nIowa Child Welfare Programs\nOver the facilities of both WSUI and WOI, the\nIowa Child Welfare Research Station, in cooperation\nwith Iowa State College and Iowa State Teachers\nCollege, presents the Iowa Radio Child Study Club,\ndesigned to offer parents systematic help on problems\nof child rearing.\nThree courses are offered—one dealing with pre¬\nschool children, one with elementary school children,\nand one with adolescents. Each course consists of two\nseries. The first series is given before Christmas and\nincludes ten broadcasts, while the second consists of\ntwelve broadcasts after Christmas. Parents may reg¬\nister for either or both series in one or more courses.\nThe formation of listening groups by parents is\nencouraged. Each leader is supplied with an advance\ncopy of the lecture and an assignment, including sup¬\nplementary reading, and a discussion subject to follow\nthe broadcast."
}