{
  "id": "d1908-2",
  "text": "THE RADIO INSTITUTE OF THE AUDIBLE ARTS\nUniversity of Iowa\nThe university of iowa offers both a High School\nof the Air and a series of weekly programs for\nwomen’s clubs over the University station WSUI,\nwhich operates on a frequency of 880 kilocycles and\npower of 500 watts at Iowa City, Iowa.\nThe High School of the Air is designed to supple¬\nment classroom work and to make possible instruction\ndirect from the University. The contents have been\nselected so that the programs will constitute an\nintegral part of the regular high school course. High\nschool principals and teachers are provided in ad¬\nvance with informative material and assignment lists.\nLast semester, the following courses were offered\nto high schools: Child Development, Orchestral Music,\nVocal Music, Debating, Public Speaking, Social\nStudies and English Compositions. The programs are\nbroadcast four days a week.\nIowa Federation of Women’s Clubs\nThe programs prepared by the University for the\nIowa Federation of Women’s Clubs, consist of talks,\ninterviews and dramatizations, and are designed to\naugment the years’ study of clubs and club depart¬\nments. Speakers who are specialists in the various\nfields are presented, and each phase of the Federa¬\ntion’s work is featured. The University encourages\ngroup listening with supplementary discussions in\nconnection with these broadcasts.\nUniversity of Kansas\nOn six days of each week, the University of\nKansas presents programs that are parts of regular\nseries broadcast over KFKU, which has a frequency\nof 1220 kilocycles and 1000 watts power. The Uni¬\nversity offers programs with the following titles: Book\nReviews, Provinces of Poetry, Elementary French\nLessons, The American Novel, Athletic Scrapbook,\nElementary Spanish Lessons, Studies of Living Things,\nHealth Talks, The Art of Teaching, Musical Pro¬\ngrams, Athletic Interview, Music Appreciation Pe¬\nriod, and Talks on Engineering.\nUniversity of Wisconsin\nMany educators are of the opinion that educa¬\ntional broadcasting can be effective and acceptable to\nthe public only when it possesses entertainment value.\nThose who subscribe to this belief will be interested to\nlearn that the University of Wisconsin is putting on\ntwo dramatic shows intended to give the public some\nconception of the University’s scientific achievements.\nThe scripts have been prepared by the University and\nthe programs will be produced and the roles enacted\nby students.\nUniversity of Kentucky\nThe programs given by the University of Kentucky\noriginate in the University studios in Lexington and\nare carried by special wire to Louisville, where they\nare broadcast over WHAS operating on a frequency\nof 820 kilocycles and with a power of 50,000 watts.\nFive days a week programs of general educational\ninterest to professional men, farmers, business men,\nhousewives, teachers, students and clubwomen, are\nbroadcast.\nDuring the first six months of this year, twenty-nine\nseries of educational and informative talks are being\npresented. Some of the subjects are Poultry, Science,\nFruit Growers, History of Kentucky Counties, Parent\nTeacher Talks, Engineering on the Farm, Pioneer\nDays in Old Kentucky, Nature Talks, Popular Talks\non Physics, Round Table on Current Events, Agricul¬\ntural Market Review, Architecture, Kentucky Prob¬\nlems, English, Preparing for College, Life and Litera¬\nture in Latin Countries, Popular Superstitions, Music,\nGovernment and Business, The Automobile, Summer\nRecreation and Health, Place of Art Education in the\nPublic Schools, and Current Problems in Education.\nListening Centers in Kentucky\nThe University has established listening centers at\nnineteen points in the Kentucky mountains. Contribu¬\ntions were solicited and radios purchased for those\ncommunities unable to purchase their own. Other ap¬\nplications for listening centers are on file awaiting the\nnecessary funds for the purchase of sets.\nUniversity of Southern California\nDuring the month of February the University of\nSouthern California presented eighty broadcasts deal¬\ning with a wide variety of subjects, including music,\nscience, education, literature, research, history, Eng¬\nlish, business, child training and adult education. The\nUniversity of the Air, a regular feature, is presented\nfive days a week from 4:45 to 5:00 p.m., and consists\nof a talk by a recognized authority in a special field.\nThe University’s programs are broadcast over dif¬\nferent stations, many of them being heard over the\nColumbia Don Lee Broadcasting System."
}