{
  "id": "d211-32",
  "text": "- b -\n2. The Role of International Co-operation in the Field of Drama\nThis item was, of course, the most important one on the Agenda\nfor the conclusions reached by the experts in its respect would have a\ndetermining effect on the future thinking of the Radio Programme Committee\non the whole subject. Before tackling the point proper, however, the\nexperts discussed at some length the relationship which either did, should\nor should not exist between radio drama and the legitimate stage play.\nAs Dr. Bruhl had pointed out in his opening address,the radio play in\nGermany had now moved away from its former traditional pattern, was no\nlonger designed to be merely entertaining and was not considered as a means\nof diffusing new writing. Dr. Lauterbach (ARD-HR) wondered whether either\nradio or theatre was helped by radio performance of the stage play.\nHis question was answered as regards Great Britain by Mr. Esslin (BBC) who\npointed out that, amongst others, Frisch, Durrenmatt, Anouilh and Brecht\nwere introduced into Us country entirely through the agency of the BBC which\nhad commissioned the translations of their work which had been instrumental\nin quickening the interest of the legitimate theatre. An interesting side¬\nline to this information was contributed by Mr. Blanc (SSR-RSR) who told\nthe meeting that Anouilh's work was not broadcast at all in the French-\nspeaking countries. He believed that thought and action should be concentra¬\nted on works special to radio and that stage works and their adaptations,\nthough important in themselves, should assume a secondary role.\nIn Italy, pointed out Mr. Angeli (RAI), radio adaptations of\nexceptional stage plays are normal but wherever possible these are reduced\nto acceptable broadcast length. A special point is made of producing on\nradio the works of young Italian writers who as yet find difficulty in\ngetting stage production. A recent innovation has been the broadcasting of\nshortened versions, each of 30' duration, of classical and modern plays and\nto judge from the public reaction so far it may be counted a success.\nMr. Esslin (BBC) stated that opinion was divided amongst the\nmembers of his organization's drama department, some regarding it as their\nduty to inform the audience fully about theatrical happenings with others\nadopting what might be termed a radiophonically puritanical approach to\nthe subject.\nAt this stage of the discussion Mr. van der Zouw (NOS) put\nforward a proposal for a ’’Panorama of Radio Drama” in which participating\norganizations would submit one or two radio drama scripts considered to be\nof outstanding quality. These would be examined by an expert group which\nwould make a selection from them and commend their production and broadcast\nindependently by each participating organization."
}