{
  "id": "d211-33",
  "text": "- 5 -\nMr. Trutat (ORTF) added that he was about to make a veri¬\nsimilar proposal but he emphasized the view of his organization that,\nimportant though pure radio drama was, there was still a very important\nrole to be played, at least in France, by radio in respect of the\nlegitimate theatre which it can greatly help, particularly by the\nencouragement of new writers.\nMr. Esslin was worried that the NOS proposal might conflict\nin some way with the Prix Italia but Mr. van der Zouw stressed that\nthis latter was concerned only with pre-recorded productions whereas\nhis organization’s idea was concerned solely with scripts designed for\nradio drama. Mr. Esslin, however, remained concerned that the NOS\nproposal, with the inevitable delays which would have to intervene\nbetween the writing and possible production of the plays9 might,\nultimately, be unfair to the writers. Mr. Trutat (ORTF) believed that\nshould the NOS proposal be adopted it would be very important to impose\nstrict criteria and to seek works specifically created for radio. He,\ntoo, like everybody else present was anxious to avoid any possible\nconflict with the much-valued Prix Italia. The NOS proposal received\nsupport from Mr. Malatini (RAI) on the grounds that subsequent compari¬\nsons of individual organizations’ productions of the same works would\nbe revealing, interesting and valuable.\nThere followed a lengthy discussion led by Dr. Hasselblatt\n(ARD-DF) on whether or not it was possible to judge a radio play on its\nscript alone. He felt that what, in Germany, were referred to as nneue\nHorspiele*' were complete in themselves and the script of them was only\na part of the many other techniques involved. Mr. Esslin was worried\nthat thinking of this nature might even mean the end of all international\nco-operation in the field of radio drama and did not agree with\nDr. Hasselblatt that \"neue Horspiele*’ could not be judged on the basis of\ntheir scripts, providing of course that these contained fully adequate\ndetails of effects and other techniques required. Mr. Malatini (RAI),\nwhilst supporting Dr. Hasselblatt’s thesis that a radio drama was complete\nin itself, felt nevertheless that it was better to exchange scripts than\nnothing at all. His viewpoint was questioned by Mile Depolo (JRT) who\nsaw nothing to be gained in exchanging scripts which neither she nor an\ninternational jury could understands and, therefore, judge and she\nsuggested that instead each organization should try to exchange complete\nrecorded productions outside the general run-of-the-mill of radio drama.\nThis, however, was seen as approaching too closely the terrain of the\nPrix Italia and two principal problems remained to be sorted out if any\nform of exchange of scripts were to be undertaken: firstly, their transla¬\ntion which, as both Mr. Lounela (YLE) and Mr. Maguire (RTE) pointed out,\npresented a real problem not only as regards their intrinsic cost but also"
}