{
  "id": "d211-4",
  "text": "- 3 -\nITEM 2\nthe \"Italian Madrigal\" or whether the RAI will confine itself to\nproducing the works proposed by Maestro Mompelio.\nAs regards exchange of information the Bureau hoped that\napart from continuing use of the Radio Bulletin for this purpose\nthe Administrative Office would make a special effort to collect\nfrom the Music Departments of all members details of their plans\nfor major forthcoming musical productions. Such information should\nbe sought three or four times a year and distributed for the atten¬\ntion of Heads of Music, so that they could know well in advance what\nlarge scale works were being produced by others and were likely to\nbe placed on offer by them. The Bureau felt that information on such\nplans would, in most organizations, be available many months in ad¬\nvance and by circulating it to other members duplication of effort\nand consequent saving of expense should result.\nIn respect of the final paragraph of the Report on page\n21 it can now be stated that this year's jury for \"Let the Peoples\nSing\" joined by BBC officials responsible for the production of\nthis successful project unanimously elected Dr S. Goslich of the\nBayerischer Rundfunk as President of the 1972 \"Let the Peoples Sing\"\njury.\nThe \"Lied across the world\" project has continued to\ndefy all efforts made to get it moving and, in view of the inherent\ndifficulties, the Bureau proposes that the material at present\nlying in the Administrative Office be made available upon request to\nall organizations by means of photocopies. The task of processing\nthe material and producing the necessary translations and summaries\nhas proved to be beyond the resources of the Administrative Office\nbut it is possible that there will be experts in some organizations\nwho will be able to take the raw material as it stands and derive\nreal benefit from the offers which have been made in this connection\nby various organizations.\nThe Bureau expressed its appreciation of the work done at\ntheir meeting by the Music Experts and recognized the value of such\noccasional meetings. With this in mind it proposes to the Committee\nthat a further ad hoc meeting of music experts be convened some time\nduring 1972."
}