{
  "id": "d211-46",
  "text": "- 18 -\nin the OIRT countries and in the world. (The way of arranging\nthese festivals differs a great deal in various countries.)\nThe festivals - which are more properly international drama\nweeks3 months or series - include in some countries voting\nhy the audience, contests, etc.\n\"Even if the rules of the festivals are very broad they easily\nacquire the character of a compulsory exchange. We have tried\nto avoid this by giving each country the possibility of\ndeveloping the system in any direction that suits its purposes.\nIn this way international theme series have emerged (for example\nthe theme of \"Peace\" in the DDR) which are compiled in the\nsame way as the festival series.\n\"In order to develop exchange further the OIRT intends to arrange\ncommon meetings for listening to and introducing the repertory,\nstarting from the beginning of 1972. The definite form has\nnot so far been agreed upon. It is hoped, however, that as\nmany EBU members as possible should participate in these meetings.\"\nDr. Lauterbach (ARD-HR) hoped that Mr. Lounela's statement\nwould stimulate closer co-operation between the two Unions and added that\nhis organization would be inviting OIRT members to the Radio Play Festival\nin Frankfurt in 1972.\nIndividual experience of co-operation with OIRT organizations\nvaried markedly from case to case and there was clearly room for discussion\non this point when the Bureaux of the two Committees met later in the year.\nFor example, whilst DR, JRT, NRK, ORTF and SSR reported no difficulties,\nthe BBC and CBC both regularly encountered problems ranging from flat\nrefusal to allow plays written by authors in some Eastern European countries\nto be broadcast in the West to silence from the state agencies concerned\nwhen requests were put to them. Of course there were bound to be problems,\nnotably from Russia and Bulgaria as non-members of the Berne Union,\nregarding copyright and payment but the experts unanimously evinced a\ndesire to increase co-operation between the radio organizations of the two\nUnions and to break down the bureaucratic barriers which tended to obstruct\nthis on occasions."
}