{
  "id": "d211-53",
  "text": "- 5 -\nGERMANY (continued)\nRadio Bremen broadcasts all its drama output including\nexperimental programmes after 2100 hours in the evening: entertainment,\nthrillers and children’s programmes are the responsibility of another\ndepartment which means that the drama department is responsible only\nfor the major radio play. Radio Bremen has found that its audience\nfor radio plays is most concentrated in young people and that interest\nin these appears to decrease with age. Difficult plays command\napproximately 1 per cent of the audience whilst more entertaining ones\nreach between 3 and h per cent.\nFinally, the Siidwestfunk stresses the internal co-operation\nwhich exists there between the drama and other departments of the station\nand which is very marked. One outcome of this is that once a week a\nbroadcast time is shared between the music department and the drama\ndepartment with very interesting results. Another activity is that of\ninviting critics to discuss a play with its author in front of the\nmicrophone.\nIRELAND\nRTE’s problem is that it has only one channel but must broadcast\nin two languages. It finds that the afternoon periods except,curiously,\nSunday afternoons, are excellent times for the broadcasting of radio drama.\nA full length play goes out every Sunday night and every Thursday after¬\nnoon although this latter is frequently a repeat. Two 30-minute serials\nand two 30-minute children's serials are also all repeated during the\nafternoons. The RTE uses the omnibus technique in respect of a daily\n5-minute serial in Irish, the episodes of which are collected and rebroadcast\nas one transmission at the weekend. The station tends to plan its drama\noutput in seasons: for instance, a season of Irish plays, one of plays\nfrom abroad, one of plays chosen by a producer etc. RTE works with a\nprofessional repertory company and professional producers. It has recently\nstarted a critics panel in the studio to discuss a radio play and this\nwas found to be both interesting and successful.\nITALY\nThe time allocated to radio drama in Italy is nearly always\nduring the evening when, on account of television, the audience is not\nparticularly numerous, though experiments have been conducted in broad¬\ncasting drama in the morning and even in spreading a complete play over\n3 mornings. RAI produces about 30 new radio plays a year. In spite cf the\nfact that most of its output in this field is not broadcast at the most\nfavourable times it is reckoned to be fairly successful. The RAI broadcasts"
}