{
  "id": "d211-61",
  "text": "ITEM 12\nRad. Com.\nIstanbul\nSOUND ARCHIVES\nThe situation in respect of the Committee’s various projects\nis as follows :\na) Directory\nThe first edition of the Directory of members' Sound Archives\nhas now been completed and distributed to all members, both active and\nassociate. It is hoped that those on whom no information appears in\nthis first edition will, as they have been requested by the Administrative\nOffice, furnish such information so that this can be sent out as an\naddendum as soon as possible. In due course it will probably become\nnecessary to issue a complete second edition, but for the present it\nis hoped that this first Directory will be of service to member or¬\nganizations .\nb) Writers and_Poets\nLengthy lists of names have been received from 25 different\norganizations, including those of Bulgaria, Ghana and Malaysia.\nCopies of these lists have been sent by the Administrative Office to\nthe members of the small Sound Archives group (Mr Eckersley - BBC,\nfir Lotichius - ARD/NDR and Mr Lindberg - SR). With the help of their\nown staffs they are individually short-listing these names and in\ndue course, when they meet, they will draw up a final list which will\nthen be sent out by the Administrative Office to all organizations,\nincluding those of the OIRT, seeking what recorded material exists\non them and is available for exchange.\nc) Sounds of_Cities_and_Countries\nDiversified lists of recorded material available under this\nheading have been contributed by some 20 organizations and the process¬\ning of these is, as these notes are written, virtually complete. It\nis hoped, therefore, that by the time the Committee meets in Istanbul\nthe information on what is available will have been distributed to\nall members, enabling physical exchange of it to start.\nd) The Origins of_World_War_II\nThis, of course, is a much more involved and complicated\nproject than either of the others listed above and it will be recalled\nthat SR originally offered the use of its electronic data processing"
}