{
  "id": "d1562-1",
  "text": "NAE8 NEWS LETTER\nPage 2*\nDecember !, i94J\nHAVE TAKEN AS THEIR THEME, \"THE AMERICAN CHILD IN A FORKING DE¬\nMOCRACY*1; **Lesi We Forget**; “Music for Morale**; “The American\nWay*'; \"Pan American Art\"; and \"This Week8s News\", aae: repre¬\nsentative PROGRAMS THIS YEAR, DEVELOPED WITH SUCH COOPERATORS\nas the Oregon Committee on Implementing the Teaching of Democracy,\nAND MEMBERS OF THE TEACHING STAFFS OF OREGON STATE COLLEGE, TH„\nUniversity of Oregon, and the Oregon College of Education.\nTHE WORLD IN REVIEW, a regular Monday evening (8:1b p.m.) feature\nFROM THE KOAC STUDIOS AT THE UNIVERSITY OF OREGON, IS AN UN¬\nBIASED COMMENTARY BY VICTOR P. MORRIS, HEAD OF THE °CH°2^ ^\nBusiness Administrarion, professor of economics, and a speaker\non world affairs who is in great demand by Oregon audiences.\nThe Daughters of the American Revolution, through its state\nradio chairman, Mrs. G. R. Hyslop of Corvallis, presents a 15-\nminute program monthly on the second Tuesday (3Jo *N0M™E\nAmerican Legion Auxiliary, through ,Tf®^TE^Dio chairman, Mrs.\nGentry Yates of Portland, arranges a 15-minute broadcast every\nSECOND AND FOURTH FRIDAY (3:15 P«M.)«\nWORLD PROBLEMS IS A Bil-MONTHLY RADIO STUDY CLUB SERIES (2ND AND\n;Tk: WEDNESDAY AT 2^30 P.M.) DEALING IMPERSONALLY WITH CURRENT\nWORLD AFFAIRS AND PROBLEMS, PRESENTED UNDER THE AUSPICES OF THE\nOregon DiC sign of the American Association of University Women\nthrough its state radio chairman, Mrs.■ D. W. Densmoor of Albany.\nListening groups in many parts of the state meet, hear the bbo\ncast, discuss it, and send in reports on these programs BY DRo\nMORRIS AND BY Dr. HAROLD J. NOBLE, KOREAN-BORN AMERICAN, WHO HAS\nSPENT 22 YEARS IN THE FAR EAST, WRITER, LECTURER, AND ASSOCIATED\nPROFESSOR OF HISTORY AT THE UNIVERSITY OF OREGON <■\nPeriodical programs by the American Legion, Veterans of Foreign\nSam?iSoDisabled American Veterans, also stress national\nPREPAREDNESS AND DEFENSE, AS 00 L.VE SPOT *NN00NCC«HT8 AND MIS-\nCELLANEOUS TRANSCRIBED FEATURES SCHEDULED THROUGH THE KEO CROSS\nand Poppy Sales representatives.\nPresidential talks and other important National Defense features\nSUCH aI THE HOUR-LONG BILL OF RIGHTS PROGRAM, ARE REBROADCAST\n“ «>AC TROUGH THE COURTESY OF KWIL Of ALBANY, MUTUAL .»N Ul\nrepresentative of the Pacific Broad-casting Company.\nI'lvt'AN AMERICAN, AN ELECTRICALLY TRANSCRIBED PROGRAM FBOM THE\ni)mitfh States Department of Justice, is on KOAC o current schedule.\nOOMTEMPLATED^S FREEDOM'S PEOPLE, A TRANSCRIPTION AVAILABLE THROUGH\nthe Educational Script Exchange. Both are subtle aids in the\ntotal defense picture.\nNOON and EVENING FAR... HOURS (daily) and THE daily HOMEMAKER'S HOUR"
}