{
  "id": "d1562-5",
  "text": "NAEB NEVA’S LETTER\nPage 6\nDecember I, 1941\nPURPOSE IS TO TEACH THE PUPIL TO INTERPRET AND EXPRESS THE VALUES\nOF DEMOCRACY—VALUES WHICH MUST BE CRYSTALLIZED IN THE MIND OF THE CHILD\nIF THEY ARE TO FUNCTION 8N THE LIFE OF THE ADULT.\nDirectly in line with the theme are programs op' Democracy, ^orld His¬\ntory and Geography, Art, music, Current Events, Literature, Civics,\nand Health.\nIhe Oregon Committee on Implementing the Teaching of Democracy, headed\nby Dr, Hugh 8, Wood, professor of Education at the University of uregon,\nand Mr. Martin J. Elle, assistant superintendent of public instruction\nfor Oregon, as co-chairman, is planning a weekly series of programs\nthrough its radio sub-committee of which Dr. C. A, Howard, president\nof the Oregon College of Education ts the chairman* his series will\nBE EXPRESSIVE AS WELL AS INSTRUCTIVE, AS SELF—GOVERNING STUDENTb\nWILL BE FROM TIME TO TIME FEATURED ON JHE BROADCASTS, THUS GIVING^\nA VIEW OF DEMOCRACY AS IT FUNCTIONS IN THE DAILY LIVES OF AMERICA S\nYOUNGER GENERATION,,\nDr, Frederick m. Hunter, Chancellor of the Oregon System of Higher\nEducation and member of the national Educational Policies commission,\nWILL SERVE IN AN ADVISORY CAPACITY ON THE RADIO SUB-COMMITTEE, AND iviR„\n£o Jerry Walker, director of the K0AC School of the Air, will act\nAS TECHNICAL CONSULTANT.\n«ihe American Way”, another series of weekly broadcasts will present\nTHE PERSONAL OBSERVATIONS OF TWO WIDELY TRAVELLED MEMBERS OF THt\nOregon State College faculty; Dr. F« A, Magruder? Professor of\nPolitical Science and widely recognized high school text book author,\nwill alternate with Professor Jo Lloyd LeMaster, Associate Professor\nof Business Administration? in bringing vivid illustrations Or the\ncontrast between living in ^ he American Way1, and living under\nFOREIGN FLAGS, WITH AN EMPHASIS PLACED ON WHAT IS EXPECTED BY BOYS\nAND GIRLS IN OTHER COUNTRIES.\n\"Music For morale\", is the text of a program to be broadcast Wednesday\nAFTERNOONS FROM THE EUGENE STUDIOS OF KOAC M|SS MAUDE GARNETT, HE*D\nof the Department of Public School Music at the University of Oregon,\nis planning what is probably one of the most unique music programs\never to be broadcast to public schools. The series is designed for\nthe one-room school, and to facilitate the placing of the program,\nAN ENTIRE ONE-ROOM S(SdOOL WILL BE BROUGHT INTO THE STUDIOS AS AN\nAUDIENCE AND TO PARTICIPATE IN THE PRGRAMS IN THE SAME WANNER AS\nWILL CLASSROOMS TUNED INTO THE BROADCAST. MISS GARNETT S PROGRAM\nTHEORY IS THAT LEARNING TO HEAR AND EXPRESS MUSIC IS FAR MORE IM¬\nPORTANT THAN THE ABILITY TO \"SEE” MUS.C. \"ENOS, THE TECHNICAL SIDE OF\nMUSIC WITH ITS DRILLS ON! STAFF SIGNS AND KEY SIGNAT0RES WILL BE IGNORED\nUN FAVOR OF WHAT M 1 8S GARNETT TERMS, \"ACTIVE MUSIC.\nMRS. J. W. MclNTjURFF, PRESDIENT OF THE AMERICAN LEGION AUXILIARY OF"
}