{
  "id": "d1319-4",
  "text": "meeting of the membership held after their elec¬\ntion and shall hold office until the close of the next\nsucceeding annual meeting.\nDistrict Directors shall assume office at the first\nmeeting of the Board of Directors following the\nannual meeting of the membership held after their\nelection and shall hold office until the close of the\nsecond annual meeting after assuming office.\nSection 4. MEETINGS. The Board of Direc¬\ntors shall meet at least three times a year, one of\nwhich meetings shall be held immediately fol¬\nlowing the annual meeting. The President may,\nwhen he deems necessary or at the request in writ¬\ning of seven members of the Board, setting forth\na specific subject or subjects to be discussed at\nsuch special meeting, the Secretary-Treasurer\nshall issue a call for a special meeting of the\nBoard, and only five days notice shall be required\nfor such special meetings.\nSection 5. QUORUM. A majority of the Board\nof Directors shall constitute a quorum for the elec¬\ntion of officers and all other purposes unless herein\notherwise provided. In the absence of the Presi¬\ndent the members may choose a chairman for the\nmeeting.\nSection 6. VACANCIES. Vacancies that may\noccur on the Board of Directors by reason of death,\nresignation or any other cause shall be filled by\nthe Board for the unexpired term.\nArticle VII\nOFFICERS\nSection 1. PRESIDENT. It shall be the duty\nof the President to execute faithfully the policies\nof the Board of Directors and to assist the Board\nof Directors at all times in the determination of\npolicies.\nThe President shall be responsible for the man¬\nagement of the affairs of the Association includ¬\ning, but not limited to, the employment, direction\nand supervision of the officers and employees of\nthe Association except as provided in Article VI,\nSection 1.\nThe President shall present a report to the\nBoard of Directors each year not earlier than Octo¬\nber first nor later than November fifteenth on the\nprogress of the Association’s work in the current\ncalendar year to date and expenditures to date\nto carry out that program together with his esti¬\nmate of expenditures to carry on the program for\nthe remainder of the calendar year. He shall at\nthe same time present, for approval of the Board\nof Directors, his estimate of budget requirements\nfor the program of the Association for the ensu¬\ning calendar year.\nThe President, by virtue of his office, unless\notherwise serving as a director, shall become a\nmember of the Board of Directors upon his elec¬\ntion as President, to serve during his term of\noffice. The President shall preside at all meet¬\nings of the Association and of the Board of Di¬\nrectors; and he shall name the members of all\nstanding and special committees from the mem¬\nbers or any employee of any member and pre¬\nscribe their duties. He shall be a member ex-\nofficio, with right to vote on all committees. He\nshall be entitled to make and execute for and on\nbehalf of this Association, contracts for employ¬\nment for a period not to exceed one year.\nSection 2. EXECUTIVE VICE PRESI¬\nDENT. The Executive Vice President shall be\nappointed by the President and shall hold office\nsubject to his will. He shall be directly respon¬\nsible to the President and under the President’s\ndirection and in his absence shall perform the\nfunctions pertinent to the office of President.\nSection 3. SECRETARY-TREASURER.\nThe Secretary-Treasurer shall act under the\nsupervision of the President and shall perform\nsuch duties as may be required of him by the\nBy-Laws.\nAs Secretary he shall keep all records of the\nAssociation, give notice of all committee meet¬\nings, meetings of the Association and of the Board\nof Directors and shall keep a record of their pro¬\nceedings, maintain a current list of all members\nof the Association, and act as Secretary of all com¬\nmittees. In the event he is unable to attend the\nmeeting of any such committee he shall delegate\nan alternate to act for him. He shall prepare and\nsubmit to the President an annual report cover¬\ning the functions of the office.\nAs Treasurer he shall collect all dues or monies\ndue the Association, deposit them in a depository\napproved by the Board of Directors and shall\nmake disbursements authorized by the Board of\nDirectors and approved by the President; he shall\nprepare and make a monthly report of all receipts\nand disbursements for the President; and shall\ncause to be made by a certified public accountant\nat the expiration of each calendar year an audit of\nthe Association and promptly to submit such\naudit to the Board of Directors; and shall attend\nto all other matters properly coming under the\noffice of Treasurer.\n[5]"
}