{
  "id": "d672-17",
  "text": "I.T.A.\nI.T.A.\nFM-10A 10 WATT FM BROADCAST TRANSMinER\nFEATURES\nDesigned primarily for educational in¬\nstallations.\nMay be operated unattended.\nMay be operated by remote control.\nProvides facilities for audio switching.\nHoused in modern artistic cabinet.\nMeters provided in turret for final plate\nvoltage, cathode current, output power\nand input modulation level.\nAudio attenuator pad provided on con¬\ntrol turret.\nUtilizes high quality standard parts.\nConservatively rated for continuous duty,\ncustom tested on customer’s channel.\nMeets all FCC specifications.\nCan be used in building block arrange¬\nment to increase power.\nUSES\nThe FM-10A is a 10 Watt FM Transmitter designed to\noperate on any fixed frequency between 88 and 108mc.\nIt can be used as an independent unit for transmitting\nFM intelligence or as a driver for a medium power FM\namplifier. In particular, this unit is ideally suited for low\npower educational stations, where the coverage of cam¬\npus and immediate areas are required. Since this trans¬\nmitter incorporates audio switching and attenuation feat¬\nures, a minimum of studio equipment will be required to\nform a complete station. Since the FM-10A utilizes iden¬\ntical circuitry to that used in high power commercial trans¬\nmitters, students can derive technical as well as program\nexperience from its operation.\nMECHANICAL - The FM-10A is housed in an attractive\ncustom cabinet and incorporates a modern styled control\nturret. It requires a floor space of 18 Vi\" X 239/16\".\nThe transmitter is completely self contained and requires\nonly the installation of tubes, crystal and the connection\nof audio and power lines before operation can begin.\nDESCRIPTION\nELECTRICAL - The FM-10A is a crystal controlled phase\nmodulated transmitter. Frequency stability of .001% is\nassured by utilizing thermostatically controlled crystal heat¬\ners. The broad audio frequency response is achieved by\nutilizing conventional pulse shaping and phase modulat¬\ning circuits. The RF frequency multipliers are driven into\nsaturation, thus reducing AM hum to a negligible value.\nIt should be noted that no RF stage acts as an on fre¬\nquency amplifier. This eliminates the problem of neutral¬\nization and assures freedom from parasitics and contin¬\nuity of programming. All circuits of the FM-10A can be\ntuned from the front panel. This ease of tuning plus the\navailability of meters for every RF circuit permits ease\nof operation, maintenance and technical analysis. A pow¬\ner output meter on the meter turret gives a direct read¬\ning of transmitter output. Facilities for switching two au¬\ndio inputs are available. Their levels are adjusted by\na front panel attenuator to achieve the desired value\non the \"modulation meter”.\nINDUSTRIAL TRANSMITTERS AND ANTENNAS\nUPPER DARBY, PENNA."
}