{
  "id": "d672-23",
  "text": "Front view of the BFE-10 educational broadcast transmitter.\nThe front cover has been removed to show the tube and com¬\nponent arrangement.\nNow any educational institution can have a good\nFM broadcast station quickly by installing the Gates\nBFE-10 transmitter and a small amount of ac¬\ncessory equipment. The cost is low, it is easy to in¬\nstall and the operating expense is no greater than\nfor a large home radio.\nAdvantages of Having A Radio\nStation In Your School\nEducators have long acknowledged the psychologi¬\ncal advantages of conducting academic pursuits\nin an atmosphere of practical reality. Now, with\nthe advent of educational broadcasting on the FM\nband, classes in radio instruction can be carried on\nusing a regular broadcasting station as the major\ntool in the training. Then, too, a broadcasting sta¬\ntion brings the student body and its activities closer\nto the community, makes full broadcast time avail¬\nable for the school and establishes it as the leader\nin progress. FM (Frequency Modulation) broad¬\ncasting is coffee shop and dinner table talk through¬\nout the country. It is the most modern mode of\naural broadcasting. Most sets have the FM band on\nthem and are located not only in high income but\nalso in the majority of middle income homes. With\nthe Gates BFE-10 transmitter station cost is re¬\nduced to such a reasonable figure that any budget\ncan easily include it and thereby offer a completely\nmodern course in radio broadcasting technique.\nEDUCATIONAL\nBROADCASTING\nWITH THE\nGATES BFE-10\nTRANSMITTER\nEXPENSIVE TOWERS UNNECESSARY\nEASY TO INSTALL ___\nOPERATOR LICENSE REQUIREMENTS ARE EASY TO FULFILL\nSPACE REQUIREMENTS ARE SMALL\nLow power Frequency Modulation Broadcasting has\nbeen made possible by the Federal Communications\nCommission by a recent ruling that premits a sta¬\ntion power of 10 watts and eliminates the necessity\nof using expensive and complicated monitoring\nequipment. Due to the relatively low power the\nphysical size of the equipment is small, permitting\neasy handling and adjustments are few and easy\nto make.\nThe Gates BFE-10 transmitter fulfills the require¬\nments for the transmitter portion of the regula¬\ntions. Antenna requirements are easy to meet as\nthere is no minimum height requirement elimi¬\nnating the necessity of expensive supporting struc¬\ntures. Licensed operators are required but may be\nof Second Class rating Hours of operation are\noptional and need not adhere to any schedule.\nThough “educational institution” has not been de¬\nfined by the Commission, it is assumed that the\nterm includes any organized body engaged in the\ndisseminaton of any kind of academic training or\neducation as high schools, colleges, universities,\nreligious and scientific bodies. No commercial\noperation is allowed.\nTechnical Information About\nThe BFE-10 Transmitter\nThe complete transmitter is housed in a steel cabi¬\nnet 36 inches high, 34 inches wide and 24 inches\ndeep. This small size, although ample for a trans¬\nmitter of this power, enables placement on a table\nand keeps space requirements to a minimum. Cabi¬\nnet finish is in grey enamel which is neutral enough\nto harmonize with any color scheme, yet is so pleas¬\ning in tone that it definitely adds to the appearance\nof the room in which it is placed.\nMeter equipment is complete in the BFE-10. Five\n3-inch meters are placed along the top which read\nGATES RADIO COMPANY, QUINCY, ILLINOIS"
}