{
  "id": "d672-24",
  "text": "radio frequency line current, power amplifier plate\ncurrent, power amplifier plate voltage, and power\nline voltage. In the center is a VU meter so con¬\nnected that full 75 kilocycle swing modulation is\nobtained when program peaks come up to the red\nline. A meter, used to indicate plate current in any\nof the various stages, is located behind the front\npanel on the vertical chassis. It is connected into\nany of the stages by means of a rotary switch ad¬\njacent to the meter. Three controls are placed near\nthe bottom of the cabinet for adjustment of power\nline voltage, turning the power on and off and reg¬\nulating the power output of the transmitter.\nBasically, the BFE-10 transmitter consists of the\nexciter that is used in all Gates higher powered FM\ntransmitters with the addition of a power supply,\nmeters and controls which make it a finished 10\nwatt transmitter.\nModulation is accomplished by the phase method\nwhich has the advantage of permitting direct\ncrystal control of the oscillator. The oscillator\noperates at a frequency in the vicinity of 250 kilo¬\ncycles and this frequency is multiplied many times\nin successive stages to obtain the final operating\nfrequency. A crystal of low temperature coefficient\nis supplied in an oven the temperature of which is\nwithin limits considerably closer than are required\nfor good operation or the regulations of the Federal\nCommunications Commission. Provision is made\nfor the second crystal and oven, and it may be added\nat any time. Differences in characteristics of\nmodulator tubes are compensated by a unique feed¬\nback circuit to eliminate any necessity of readjust¬\nment and thus retain the excellent operating con¬\nditions obtained by the original factory tune up.\nMaintenance of the BFE-10 transmitter is easy as\nit is mechanically arranged to be very accessible.\nLarge panels, both in front and rear, are easily re¬\nmovable, which enable examination of the tubes\nfrom the front and components from the rear. A\ndust cover which encloses the back of the modulator\nand radio frequency chassis is held on by four\nthumb screws-and can be quickly-taken off when¬\never necessary. All power and audio input connec¬\ntions are located on a barrier type terminal strip\nmounted just inside the rear opening. The radio\nfrequency output line is terminated on top of the\ntransmitter near the left front corner and is de¬\nsigned to couple to RG-8U coaxial cable.\nInstallation\nThis is a very simple procedure. The transmitter\nis pretuned at the factory. Locate the antenna on\nthe tallest available building, connect the coaxial\ntransmission line and, with the assistance of an en¬\ngineer from the nearest broadcast station, the few\nadjustments on the transmitter and antenna instal¬\nlation can be quickly made.\nSPECIFICATIONS\nPOWER OUTPUT—10 watts nomlal rating.\nFREQUENCY RANGE—88 to 108 megacycles.\nR. F. OUTPUT IMPEDANCE—40-80 ohms.\nTYPE OF OSCILLATOR—Direct crystal control.\nFREQUENCY STABILITY—Plus or minus 500 cycles.\nTYPE OF MODULATION—Phase shift.\nMODULATION CAPABILITY—100 kilocycles.\nAUDIO INPUT IMPEDANCE—600 ohms.\nAUDIO INPUT LEVEL—Approximately plus 10 decibels.\nFREQUENCY RESPONSE—Within 1% Db of standard 75 micro¬\nsecond pre-emphasis curve.\nDISTORTION—Less than 1%% 50-100 cycles, less than 1% above\n100 cycles.\nTUBE COMPLIMENT—Two Type 5Z3, Nine Type 6SJ7, One Type\n6SN7, One Type 6V6 (metal). One Type 815, One Type 829-B,\nOne Type 5593 G. E.\nPOWER INPUT—165 watts, approximately.\nPOWER SOURCE—115 volts 60 cycle single phase.\nDIMENSIONS—36 inches high, 34 inches wide, 24 inches deep.\nApproximately 31 cu. ft. boxed for export shipment.\nWEIGHT—Net approximately 225 lbs.\nGross packed for export, approximately 300 lbs.\nBFE-10 Transmitter—With one set of tubes, one\ncrystal and oven. Code ZARIG.\nRear view of the BFE-10 transmitter shows the power supply\nin the bottom and the transmitter portion just above. The inside\ncover over the transmitter chassis is easily taken off by removing\nthe four thumb screws in the corners and disconnecting the\ncoaxial output feed line at the fitting on the top of the trans-\nPrice\nIf you already have equipment for a broadcast\nstudio, the additional cost for a BFE-10 trans¬\nmitter, antenna, and the few other accessories prob¬\nably will be in the vicinity of $2200.00. If studio\nequipment is required, $3000.00 could provide a\ncomplete transmitter, antenna and studio instal¬\nlation in most cases. Gates sales engineers can\nreadily work out a plan for you to install the neces¬\nsary items now, and add others later when a more\ncomprehensive outlay is advisable.\nGATES RADIO COMPANY, QUINCY, ILLINOIS"
}