{
  "id": "d672-28",
  "text": "APPENDIX\nSub-part C of Part 3 of the Rules and Regulations is amended ns\nfollows;\n(1) Section 3.503 — Title of section is amended to road,\n11 Licensing requirements and service.\"\n(2) Sections 3.504 and 3.505 — Are amended to read as follows:\n§3.504 Frequency. Power and. Service Area: (a) Xn the\nassignment of frequency and power to a noncommercial\neducational PM broadcast station the Commission will consider\nwith the application: (l) the area served by applicant s\nexisting educational facilities; and (2) the provisions of\nany statewide plan on file with the Commission which meets\nthe requirements of Section 3.502. A station licensed for\ntransmitter power output of 10 watts or less normally will\nbo licensed to operate on the frequency 88.1 megacycles,\nhowevor, should it appear that operation on this frequency\nwould cause objectionable interference, such station may be\nlicensed to operate on the next higher frequency that would\nnot cause objectionable interference.\n(b) The license of each noncommercial educational PM\nbroadcast station licensed for transmitter power output of\n10 watts or less shall specify the maximum authorized\noperating power output of the transmitter* The license of\neach noncommercial educational PM broadcast station licensed\nfor transmitter power output above 10 watts sha.ll specify the\nauthorized effective radiated power of the station and the\nauthorized operating power output of the transmitter*\n(c) Each application for a new noncommercial educational PM\nbroadcast station or increase in facilities of an existing\nstation which proposes transmitter power output above 10\nwatts shall contain a determination of the antenna height\nabove average terrain and the extent of the 1 nv/m and ^0\nuv/n contours of the proposed station by the methods pro¬\nscribed in the. Standards of Good Engineering Practice\nconcerning PM broadcast, stations*\n§3.505 Standards of Good Engineoring-Praetico: The\ndefinitions and interference standards contained in tne\nStandards of Good Engineering Practice Concerning PM Broadcast\nStations shall be applicable to noncommercial educational m\nbroadcast stations*' Other portions of such Standards shall\nbe applicable to the extent specifically prescribed by these\nrules."
}