{
  "id": "d672-30",
  "text": "- 3 -\n(b) The licensee of each nonconnercial educational PM broad—\ncast station licensed for transmitter power output of 10\nwatts or less shall provide at the transmitter a percentage\nmodulation indicator or a calibrated program level meter from\nwhich a satisfactory indication of the percentage of modu¬\nlation can he determined,\n§3.554 Transmitter performance, - (a) The transmitter proper\nand associated transmitting equipment of each nonconnercial\neducational PM broadcast station licensed for transmitter\npower output above 10 watts shall be designed, constructed,\nand operated in accordance with the Standards of Good\nEngineering Practice Concerning PM Broadcast Stations.\n(b) ’The transmitter proper and associated transmitting\nequipment of each noncommercial educational PM broadcast\nstation licensed for transmitter power output of 10 watts or\nless, although not required to meet all requirements of the\nStandards of Good Engineering Practice Concerning PM Broad¬\ncast Stations, shall bo constructed with safety features in\naccordance with the specifications of Article 810 of the\ncurrent National Electrical Code as approved by the American\nStandards Association and shall be so operated, tuned, and\nadjusted that emissions are hot radiated outside the\nauthorized band which cause or which are capable of causing\ninterference to the communications of other stations. The\naudio distortion, audio frequency range, carrier hum, noise\nlevel, and other essential phases of the operation which\ncontrol the external effects, shall at all times be capable\nof providing satisfactory broadcast service* Studio equip¬\nment properly covered by an underwriter*s certificate will be\nconsidered as satisfying safety requirements,\n(5) Section 3.556(c) - Is amended to read as follows:\n\"(c) Both transmitters shall meet the requirements of\nSection 3.554.,r\n(6) Section 3.557(a)(2)-- Is amended to read as follows:\nn(2) That would result in the external performance of the\ntransmitter being in disagreement with Section 3.554.’1\n(7) Section 3.557(d) — Is amended to read as follows:\n\"(d) Other changes, except as above provided for in this\nsection, may bo made at any time without' the authority of the\nCommission, provided that the Commission shall be promptly\nnotified thereof and such changes shall be shown in the next\napplication for renewal of license.\""
}