{
  "id": "d672-36",
  "text": "THEY MADE THIS GUIDE POSSIBLE\nRecognized throughout the industry as engineer¬\ning and architectural authorities, these seven\nmen, acting as consultants, gave unstintingly of\ntheir time, knowledge and experience in the\nplanning and preparation of this guide.\nADOLPH BERNARD CHAMBERLAIN, Chief Engineer, Co¬\nlumbia Broadcasting System. A pioneer in network en¬\ngineering and in the design, installation, operation and\nmaintenance of many phases of broadcast equipment,\nhe was responsible for the planning and construction of\nthe engineering facilities of such an outstanding array of\nstations as KNX, Hollywood, Calif.; WTOP, Washington,\nD. C.; WCBS, New York, N. Y. and WEEI, Boston, Mass.\nADOLPH BERNARD CHAMBERLAIN\nROYAL V. HOWARD\nROYAL V. HOWARD, Director of Engineering, National\nAssociation of Broadcasters; for 14 years vice president\nin charge of engineering for The Associated Broadcasters,\nInc., and subsidiary companies of San Francisco, holds\na number of patents on radio equipment. He is a Senior\nMember of the IRE and a member of the AIEE. He is\nTechnical Advisor to the United States Delegation at\nthe International Telecommunications (Radio) Conference.\nJAMES L. MIDDLEBROOKS, Facilities Engineer for the\nAmerican Broadcasting Company, a former Director of\nEngineering of the NAB, has to his credit the engineer¬\ning design and erection of many well known stations,\nincluding KSFO, San Francisco; WJJD, Chicago; WKRC,\nCincinnati; WSAI, Cincinnati and KOIN, Portland, Ore.\nFormerly a member of Columbia Broadcasting System's\nEngineering Department, he also served as Technical\nDirector of the Broadcast Division of Field Enterprises, Inc.\nCONTRIBUTORS AND ADVISORS\nROBERT CAMPBELL DEIGERT, architect, member of\nDeigert & Yerkes, Communications Architects, BFA, Yale\nUniversity, was chief architect of the Yale Expedition to\nDoura Europos (Mesopotamia) in 1932. He was formerly\nassociated with Harold van Doren in industrial design of\ncommunications equipment. He is a member of the\nAmerican Institute of Architects, the Acoustical Society\nof America and the American Designers Institute.\nDAVID NORTON YERKES, architect, member of Deigert\n& Yerkes, Communications Architects, BFA, Yale Uni¬\nversity, member of the American Institute of Architects\nand an Associate of the Acoustical Society of America.\nAmong the stations now being designed by the firm of\nDeigert & Yerkes are WFMD-FM, Frederick, Md.;\nWDNC, Durham, N. C.; WINX, Washington, D. C.; WASH,\nWashington. D. C.; WRUN, Utica, N. Y. and WRUN-FM,\nRome, N. Y.; WMCP-FM, Baltimore; KVUN, Los Angeles;\nKUBR, St. Louis, Mo. and WVUN, Chattanooga, Tenn.\nJ. R. POPPELE, Vice President and Chief Engineer of\nWOR, heads a staff of 80 technical experts. A pioneer in\nbroadcasting, he early instituted and supervised at WOR\na fine engineering laboratory. He was an early experi¬\nmenter in FM and Television. He is President of the Tele¬\nvision Broadcasters Association, Senior Member of the IRE,\na director of the Veteran Wireless Operators Association.\nHe belongs to the Radio Club of America, the Acoustical\nSociety and the Society of Motion Picture Engineers.\nJOHN W. RAGSDALE, Associate Editor, Architectural\nRecord, a graduate of Princeton University, 1937. He\nwas News Editor of the Record from 1939 to 1941.\nAs Associate Editor, he has been engaged for the\nRecord in the preparation of a monthly series of Build¬\ning Types Studies, involving analysis and description of\nlatest trends in the planning, design and construction\nof such architectural types as apartments, churches,\nfactories, hotels, hospitals, libraries and stores.\nJ. R. POPPELE\nROBERT CAMPBELL DEIGERT\nDAVID NORTON YERKES\nJOHN W. RAGSDALE\n5"
}