{
  "id": "d672-37",
  "text": "SECTION I\nBuilding the Home\nfor Your Broadcast Transmitter\nSy TR. S.\nWhatever kind of building you put up to house\nyour broadcast transmitter, you are going to live\nwith it constantly, day in and day out, for a long\ntime to come. If it fails, even in small ways, to give\nthe transmitter the proper conditions for trouble-\nfree, efficient operation, or if it throws needless ob¬\nstacles in the way of maintenance and servicing, the\ncost to you in time, money, and peace of mind will\ncontinue to grow as long as you use the building.\nThe information in the following pages has been\nbrought together to help you in planning a building\nthat will not cause such needless expense, a build¬\ning that in every respect will be a \"home” for\nyour transmitter. The material has been arranged\nin outline form, with the following main sections:\nA. Preliminary Planning Page 6\nB. Choosing A Site Page 7\nC. Layout of the Building Pages 9 to 20\nD. Technical Accessories Page 20\nE. Building Services Page 21\nF. The Style of Your Building Page 22\nOn page 19, you will find a table of \"do’s” and\n\"don’ts” to give you a quick reminder of various\npoints covered in the article. The table on page 10\nconstitutes a breakdown of the building units or\nrooms that go into a transmitter building, so that\ninitial layout can be based on the choice of the units\nthat will be needed in your building.\nA. PRELIMINARY PLANNING\n1. First, secure expert help in planning\nand construction\nEach management will face a different problem in\nchoosing technical guidance. The available sources\nupon which you may draw are:\nThe manufacturer of the transmitter, for full in¬\nstallation details, technical requirements of the\ntransmitter, and assistance in installing and testing;\nYour chief engineer and his staff, for adaptation\nof the technical facilities to your own needs and\nplans;\nThe architect, for planning the building itself in\naccordance with your needs and resources, for co¬\nordinating the technical requirements with the vari¬\nous building and contracting services, and for super¬\nvising actual construction;\nThe radio consulting engineer, for advisory ser¬\nvices which include preparation of the FCC reports\nand applications, technical advice on all the special\nproblems of installation and \"proof of perform¬\nance,” or even taking over the complete job of plan¬\nning your transmitter installation and supervising\nthe whole job until you are in operation;\nThe building contractor and various subcon¬\ntractors, who are responsible for the actual erection\nof your building.\n2. These specialists must work together\nfrom the beginning\nNothing is more important than for your chief\nengineer, and your architect or builder, to sit down\nwith a transmitter specialist or with your radio\nconsultant, and, with a complete set of installa¬\ntion drawings for the transmitter, to plan all the\ntechnical features of the installation.\nArchitects Deigert and Yerkes emphasize the\nneed for this kind of cooperation: \"The design of a\ntransmitter building is a complex problem, involv¬\ning the close coordination of structural, mechanical,\nand electrical elements. The designer of the trans¬\nmitter building is engaged in arranging the various\n6\nWestern Electric ©i(0EMLI^r®!ll"
}