{
  "id": "d672-40",
  "text": "dinances against installation of the transmitter in\nthe building, or the antenna on top of it?\nWill the building support the antenna? Will the\ntransmitter overload the floor at the chosen loca¬\ntion? A preliminary study by competent engineers\non these points is good insurance against unfore¬\nseen expense. Structural alterations on modern\nskyscrapers can be very expensive.\nCan you get the transmission line to the roof with¬\nout interference with other tenants? A top-floor in¬\nstallation makes this easy but is not always available.\nIs the power cabling to the transmitter location\nlarge enough? Will there be large variations in\nthe power consumed by other tenants, causing ir¬\nregular supply voltage? A separate power run to\nthe top floor of a tall building is an expensive item.\nWhat about building services such as heat and\nelevators during your after-midnight operation?\n6. Transmitters on mountain tops\nAs everyone knows, FM and television are \"going\nto the mountains” for antenna height. Obviously a\nC. LAYOUT OF\n1. Is it better to combine or separate\nstudios and transmitter?\nThis architectural guide does not discuss studio\ninstallations as such. The combination of transmit¬\nter and studios will effect certain economies in the\ncost of building and operation. However, if studios\nnear the business center are desired, separation is\noften necessary with larger AM transmitters, which\nmust usually go to the country for land of reason¬\nable cost. Mountain-top FM and television trans¬\nmitters must also usually be separated from the\nstudios.\nThe different situations are as follows:\nCombined studio and transmitter installations\nare advisable for FM and television stations in tall\ncity buildings, or AM stations in smaller cities where\nthe cost of land for the radiation system is not pro¬\nhibitive. Many new stations, particularly of low and\nmedium power, have found that a combined instal¬\nlation in a suburban district is practical and eco¬\nnomical.\nSeparate locations for studio and transmitter are\nSeptember 1947\nmountain top is in general a very inaccessible site.\nIts usual advantage, besides coverage, is low land\ncost. Here are the items that offset this:\nWater, roadways, power, program lines are often\ndifficult and expensive to bring in.\nThe building will cost more, because of the dis¬\ntance both labor and materials must travel.\nSevere weather conditions may require special\nweatherproofing. A study should be made of the\nmaximum wind velocities and rainfall at the pro¬\nposed site, to be sure that the building will be water¬\ntight, especially around doors and windows.\nCost of operation will be higher because of the\ninaccessibility. Complete living facilities for person¬\nnel will be necessary, particularly in areas where\n\"snowing in” can be expected.\nThe ideal high-frequency site would be a moun¬\ntain top in or near a city, with consequent short road¬\nways, water, power and signal runs. Station KPFM,\nwhich is shown on pages 44 and 45, has an excellent\nsite in this respect with its mountain overlooking the\ncity of Portland, Oregon.\nTHE BUILDING\nusually necessary with mountain-top sites for FM\nand television, and AM stations finding \"breathing\nroom” for their antenna systems by going into the\ncountry.\n2. Should a transmitter building be a\n\"show-place” — or just an enclosure for\ntransmitter and operators ?\nIf you have looked over the field to see what kind\nof building to put up, you are probably in a muddle\nabout these two opposing conceptions.\nIf your building will be in a remote location, sel¬\ndom seen by any persons except the operating force,\nit is obvious that no extra money should be spent\nmerely to give it public appeal. Careful planning\nand sound architecture, however, do pay off heavily,\neven in remote locations. The difficulties of the site\nmake it even more important and prudent to think\ncarefully in advance, to coordinate the planning of\npersons involved in the building, and to put up a\npermanently satisfactory building that will be easy\nto maintain, with all the facilities necessary for effi¬\nciency of the operating force.\n9"
}