{
  "id": "d672-42",
  "text": "low, after which the other building units are taken\nup in the order shown in the table at the left.\nTransmitter Room: The floor space must be suffi¬\ncient for the transmitter itself, and in addition must\nprovide room completely around it for easy servic¬\ning. This means that in back of the transmitter, there\nmust be room to open any swinging doors, plus addi¬\ntional room to allow the operator, with portable test\nequipment or small power tools, to pass the opened\ndoors. The front of the transmitter will face into the\ncontrol room or area. Detailed characteristics of the\ncontrol room are discussed beginning on page 14.\nThe larger transmitters which include auxiliary\nhigh voltage or cooling apparatus in separate units\nwill ordinarily have recommended transmitter room\nlayout plans supplied by the manufacturer. Layout\nof a transmitter room with a number of auxiliary\nunits is based on: (1) short interunit connections;\n(2) separation of equipment that must be attended\nin operation, from dangerous high voltage equip¬\nment; (3) provision of proper insulation and separ¬\nation for high voltage wiring runs.\nThe enclosure of high voltage equipment in sep¬\narate rooms with \"interlock” switches on all entry\ndoors which cut off the power automatically when\nthe door is opened should be planned in accordance\nwith FCC and Underwriters’ regulations. These\nshould be studied to make sure that any planned\nlayout of high voltage equipment is in order.\nThe ceiling height in the transmitter room must\ninclude a margin of several feet over the standing\nARRANGEMENT OF EQUIPMENT\nheight of the transmitter itself. A minimum over-all\nceiling height of 10 feet for AM and 12 feet for FM\ntransmitters is advisable. This is to allow for:\n(1) Access space for servicing meters and other\nequipment near the top of the transmitter.\n(2) Room for discharge of heat from the tops of\nsmall and medium size transmitters.\n(3) For FM transmitters, room for transmission\nline and harmonic shunt line stubs installed on or\nnear the top of the transmitter. If harmonic shunts\nare contemplated, careful consideration should be\ngiven to the maximum length of stub that would be\nrequired, and vertical space allowed accordingly.\nAfter scaling the room and preliminary placing of\nthe main transmitter units on paper, study the plan\nfrom the point of view of the operator. Can he reach\ncontrol points quickly and easily? Is there room for\nall normal maintenance, testing and service? Ob¬\nvious, but sometimes overlooked: Are the doors to\nthe transmitter room large enough for the largest\nunit of apparatus to be installed? (For placement of\nthe transmitter units with respect to the control desk,\nsee the following section on \"control room.”)\nIn the layout of the transmitter room, as in every\nfeature of a transmitter building, the anticipation of\nprobable expansion is one of the surest forms of\nlong-range economy. All of the experts agree that\nevery person going into the broadcast business\nshould take a hard look ahead at his future and lay\ndefinite plans in the transmitter building for the\n(Continued on page 14)\nMULTIPLE UNIT TRANSMITTERS\n(Including Phasing and/or Standby Equipment)\nK\nRECTANGULAR SEMI-CIRCULAR\nOFFSET PANEL\n^ r\nTWO TRANSMITTERS\n(AM and FM or Main and Standby)\nA\na\nV7\n^ .\nSeptember 1947\n11"
}