{
  "id": "d672-47",
  "text": "It is in the placement and arrangement of these\nitems that many buildings go wrong, with conse¬\nquent expensive alterations, or inefficiency caused\nby difficult maintenance and operation. Your tech¬\nnical specialist, and your architect or building con¬\ntractor must work closely together in making thor¬\nough advance plans for installation of all these\nservices to the transmitter. For such planning,\n\"accurate and complete installation drawings of the\ntransmitter and auxiliaries are priceless to the de¬\nsigner,” says J. L. Middlebrooks. \"They are the best\ninsurance against costly hindsight architecture.”\nEach building and each transmitter will present\nan individual problem, but the following general\nconsiderations should be noted:\nTerminal boards and overload control points, such\nas power distribution panels, fuse boxes, circuit\nbreaker panels, should be placed so that they are\nreadily accessible to the operator on duty.\nIncoming program and power lines should be\nbrought in to separate, centrally located terminal\nboards. If these lines run near your AM antenna,\nyou should consider burying them, to reduce inter¬\nference problems.\nInterunit connections should be planned with par¬\nticular care. A drawing showing every electrical and\ntransmitter circuit in the building should be pre¬\npared, to provide assurance that plans have been\nmade for all necessary circuits.\nThe builder has a choice of a number of methods\nfor installing interunit power and audio circuits:\n(1) Conduit: Commercially available conduit can\nbe (a) buried in poured cement floor, after which\nrelocation of wiring is difficult and costly; (b) run\nunder the floor if there is a crawl space or basement,\nin which case changes require cutting holes in the\nfloor and disconnecting the conduit; (c) run under\nfalse floor. A double floor permits the conduit to be\nlaid between the two floors.\n(2) Ductwork: Many forms of metal ductwork are\ncommercially available and this is a very popular\ndevice for installing interunit wiring. Duct in\ngeneral has a rectangular cross section and remov¬\nable top. Many types are supplied with an integral\nshielding barrier which can be used to separate\nspeech circuits from power circuits, making other\nshielding unnecessary. The sketches at the right\nshow typical methods of installing ductwork. The\nPractical methods for installing interunit wiring are shown in above\nsketches. All of them are adaptable to a variety of floor constructions.\nremovable top makes for easy maintenance or alter¬\nation in the wiring at any point along the duct.\nIt can be: (a) laid in poured concrete floors;\n(b) installed under false floors; (c) hung from the\nfloor if there is a crawl space or basement.\n(3) Troughs or Raceways: Troughs or raceways\nformed in poured cement floors provide another\nmethod for installing interunit wiring. The wire\ncan simply be laid in the trough. Some kind of top\ncover must be added, and if speech and power cir-\n16\nWestern Electric MUH"
}