{
  "id": "d672-48",
  "text": "cuits, or high and low level circuits, are run in the\nsame trough, shielding is required.\nConvenience outlets near each of the major units\nof the transmitter for operation of test equipment,\nsmall power tools, trouble lamps and soldering\nirons should not be overlooked. Some manufac¬\nturers supply such outlets in the transmitter cabinet.\nAfter design of the transmitter room and control\nroom, the other building units can be added to the\nplan. These are discussed below.\nWashroom: The FCC requires that a washroom be\ninstalled close enough to the operator on duty so\nthat he will not find it necessary to be away from\nthe control point more than a few minutes at any\ntime. No stipulation as to the exact distance from\nthe control desk is made nor is it required that the\nwashroom open directly into the control room.\nHowever, if the operator has to go to the end of a\nlong corridor, or to another floor a considerable dis¬\ntance from the transmitter, it is considered a case of\nbad practice in this respect.\nStorage Space: No transmitter building can oper¬\nate efficiently without storage space. Spare tubes,\ntest equipment, replacement parts are essential and\nshould not be piled in the corner of the room be¬\ncause nothing better has been provided.\nIn estimating the amount of storage space needed,\nit pays to go well over on the generous side. The\n\"Survey Study of Broadcast Transmitter Buildings”\nwhich is presented beginning on page 36 gives defi¬\nnite information on the value of storage space, as\ndetermined by the experience of broadcast stations\nin all parts of the country. Among the six hun¬\ndred stations answering the questionnaire, the\nmost frequent lack mentioned in describing the\ntransmitter building was \"insufficient storage\nspace.” This makes it plain that storage space is\ncommonly underestimated in stations of all ratings.\nIn larger stations specialized storage schemes may\noffer benefits. With a high power transmitter, for in¬\nstance, the tube storage can be arranged on a func¬\ntional basis, with racks constructed to hold an exact\nduplicate set of the tubes in the transmitter, ar¬\nranged in corresponding order.\nOne type of storage sometimes overlooked is stor¬\nage for reports and other papers. Ordinary file cabi¬\nnets will be satisfactory. Built-in cabinets, conven¬\niently located, make an attractive solution.\nFurther improvements in efficiency and conven¬\nience can be achieved with the following specialized\ntypes of storage:\n(1) Racks or drawers for safe storage and easy re¬\nmoval of the numerous blueprints needed in a\nbroadcast station;\n(2) Closet and lockers for clothes and personal\nbelongings of operating personnel;\n(3) Bookshelves or racks for engineering refer-\nWorkshop at WTOP has ample bench space with covered storage below\nthe bench. Note natural and artificial lighting over working area.\nAnother well-planned shop, this one at WHEC, Rochester, has plenty\nof open and closed storage, drill press, vise, and test equipment.\nSeptember 1947\n17"
}