{
  "id": "d672-49",
  "text": "ence books and periodicals and equipment cata¬\nlogues. A \"library corner” in the office or other\nconvenient space is a great help to neatness and\norder, and puts the reference tools in a known lo¬\ncation where they can always be found quickly by\nthe operating force.\nWork Shop: A shop consisting of a regularly\nequipped bench with adjacent storage space for\ntools and small parts should be included in every\nbroadcast transmitter building.\nThe tools most commonly needed are the small\ntools ordinarily used in repairing or rewiring elec¬\ntronic equipment, plus a drill press and heavy vise.\nIn the larger stations a small metal lathe may be\nuseful, but the completely equipped machine shop\nhas been found to be unnecessary by the great ma¬\njority of broadcast stations. Covered storage space\nto keep dust off of expensive test equipment, should\nbe included in the shop. With FM transmitters, and\nAM transmitters of 1 kw and loiver power, shop,\nstorage space and transmitter room, or shop and\nheater room, may be conveniently combined. With\nAM transmitters above 1 kw it is usually dangerous\nto have personnel working at a bench directly in\nback of the transmitter. No one should work in the\nnear vicinity of a high-power radio transmitter\nunless his full attention is on the transmitter. In\naddition, the safety regulations may require that the\narea in back of the transmitter be within an \"inter¬\nlocked” enclosure.\nOffice: Usefulness of an office even in smaller\nstations arises from the record-keeping activities\nthat are imposed by law on every broadcast station.\nStorage of records and a place to prepare the re¬\nquired reports are just two of the functions that\nmake an office desirable. It is possible to combine\nthe office with other functions, such as the visitors’\nlobby or the operators’ lounge (see plans, Sec. II).\nThere is another kind of value arising from the\ninclusion of an office for the chief engineer or trans¬\nmitter supervisor. The technical heads of a broad¬\ncast station have a professional standing which\nshould be an integral part of their thinking about\ntheir jobs, and should be recognized by the manage¬\nment and the general public. Proper office facilities\nare important in maintaining this valuable frame of\nmind for both the technical men and for those in\ncontact with them.\nShower Room: After more storage space, the\nshower room was one of the features most often\nmentioned as desirable by the persons answering\nthe Survey questionnaire.\nKitchenette: This is another convenience which\nhas universally proved itself in the minds of oper¬\nators, owners and builders of transmitter buildings,\nas revealed in the Survey. Naturally in a building\nwith living quarters, a complete kitchen must be\nincluded. However, in the buildings without living\nquarters or regular kitchens, the single unit kitchen¬\nette with stove, sink, storage and refrigerator all in\none compact, relatively inexpensive piece gives the\noperators a place to \"boil up a bite” while on duty.\nThis has proved particularly valuable for operators\non all-night watches.\nEmergency Studio: Every broadcast transmitter\nwhich is separated from its studios faces the pos¬\nsibility of being cut off from the program source.\nProlonged time off the air can be avoided if provi¬\nsion is made in the transmitter building for emer¬\ngency program production. Various arrangements\nat the transmitter building will allow the station\nto get on the air on a more or less minimum basis:\n(1) Turntable and speech input facilities added\nto transmitter control desk. This is the simplest\narrangement and will generally be satisfactory for\nrecorded music programming. The use of a micro¬\nphone at the control desk may be unsatisfactory\nwithout acoustic treatment of the control room.\nThe noise level produced by air cooling equipment\nof some transmitters may make a glass isolation\nscreen in front of the transmitter desirable.\n(2) Turntables and speech equipment at transmit¬\nter control desk, with a separate acoustically treated\nroom for microphone pickup. With a microphone\npickup room adjacent to the control room, a prop¬\nerly placed viewing window will make it possible\nfor the transmitter operator to operate the turn¬\ntables, and to control the live pickup, without leav¬\ning his position.\n(3) Complete emergency studio. Naturally there\nis no limit, except the resources and needs of the\nstation management, to the completeness of the\nstudio equipment installed in the transmitter build¬\ning. For the average medium-power station, which\nhas no unusual programming methods or operating\nproblems, an emergency studio along the lines of\nthose in the plans on pages 30 and 33 has been\nfound satisfactory.\n18\nWestern Electric"
}