{
  "id": "d672-50",
  "text": "As shown in the plans referred to, the turntables,\nspeech control equipment, and live pickup are all\nin the studio together. The studio adjoins the trans¬\nmitter control room with a viewing window be¬\ntween the two. This arrangement works well with\nthe simple type of program production to be ex¬\npected for emergency use in a station of this type.\nIn a regular studio, of course, the much more com¬\nplicated program control necessary would not per¬\nmit the audio control man to sit with his back to the\nmicrophone positions, and within the studio space.\nGarage: The need for a garage at the great major¬\nity of transmitter buildings is obvious. Additional\nparking space is a further convenience for visitors\nand personnel.\nLiving Quarters: The provision of living quarters\nfor at least a part of the operating personnel will\npay off in many locations which are so inaccessible\nas to make regular daily coming and going of the\noperating force difficult and time-wasting. The\nwidespread use of living quarters as a part of the\ntransmitter building, either from necessity or to\nincrease the efficiency and attractiveness of the\nbuilding for the operating force, is clearly indicated\nin the Survey results on pages 38 and 39.\nEmployees’ Lounge: The employees’ lounge is an¬\nother building unit which adds greatly to the con¬\nvenience of the building for the operating force. It\ncan be combined with the office, as shown in the\nplans on pages 25 and 30.\nHeater Room: The trend to single-floor layouts\nbrings the separate heater room to the fore as a\nfeature of the main floor plan in nearly every build¬\ning in climates where heating is required. In the\nsmaller stations, the heater room can be combined\nwith shop and storage (see plan, page 25).\nTransformer and Power Distribution Room:\nThe larger transmitters using separate high voltage\nequipment introduce the necessity of constructing\nseparate rooms or enclosures which embody the\nsafety and isolation characteristics required by FCC\nand Underwriters’ regulations, and good engineer¬\ning practice, as already explained on page 11. Inter¬\nlock systems and other safety measures for such\nrooms will ordinarily be specified for each trans¬\nmitter by the manufacturer. The planner of the lay¬\nout must take care that interlocked high voltage\nWhen Planning and Constructing a\nBroadcast Transmitter Building . . .\nDO a Check local zoning restrictions.\n□ Consult C.A.A. on tower height.\n□ Secure complete installation information from trans¬\nmitter manufacturer.\n□ Allow room for expansion, if this is contemplated.\n□ Check building plans with fire insurance consultant to\nget lowest rates.\n□ Check rainfall, snowfall, wind conditions, temperature\nrange, etc. at site.\n□ Have doors wide enough for moving in equipment.\n□ Plan location of all interunit wiring before construction\nbegins.\n□ Provide enough work shop and storage space.\n□ Provide sleeping facilities, if only for emergency use.\n□ Arrange to keep temperature in operating areas at\ncomfortable level for personnel.\n□ Provide dirt-free air for transmitter and operating areas.\n□ Isolate transmitter heat from building cooling system.\n□ Provide kitchenette facilities, particularly if food is not\navailable nearby.\n□ Place convenience outlets near all equipment.\n□ Provide rack space for all the audio and test equipment\nyou will need.\n□ Ground any large conducting parts of building frame.\n□ Make your building an attractive, efficient home for\nyour transmitter—and a building in which employees\nwill enjoy working.\nDON'T n Select a site until you have checked costs of roadways,\nbuilding services and utilities.\n□ Plan other rooms until you have laid out transmitter\nroom and control room.\n□ Place wash room at too great a distance from control\ndesk.\n□ Buy land for AM site without considering need for direc¬\ntional array in the future.\n□ Use building power circuit which is subject to heavy,\nirregular loading by other tenants.\n□ Put high-voltage units or wiring where they will en¬\ndanger personnel.\n□ Place \"interlocked\" areas so they block normal access\nto other rooms or equipment.\nCH Put audio and power lines in same raceway without\nshielding.\n□ Allow small metal parts in building to become hot from\ninduced r-f energy.\n□ Put up a transmitter building in your community which\nmisrepresents you and the character of your business.\nareas do not interrupt the normal operating flow of\nthe building, nor interfere with the maintenance of\nequipment which must for any reason be attended\nwhile the transmitter is in operation.\nThere are many solutions to the problem of iso¬\nlating dangerous high voltage equipment from\nparts of the transmitter which must be attended.\nThe completely enclosed and interlocked transmit¬\nter room is shown in the plan on page 33. The use\nSeptember 1947\n19"
}