{
  "id": "d672-51",
  "text": "of a chain link fence is shown in the plan on page\n47. Others will be noted in the various plans in\nSections II and IV.\nViewing Lobby and Visitors’ Lounge: The gen¬\neral problem of deciding what provisions should be\nmade for the public has already been discussed on\npages 9 and 10. The viewing lobby is a popular\nform of public relations effort, for the reason, often\npointed out, that transmitting equipment has beauty\nand drama for the general public. A transmitter\nwith the circle or \"U” of units facing the operator,\nthe high-power amplifier tubes visible through the\nfront panels, and the rows of meters and controls,\nis impressive to any onlooker. The viewing lobby\ncan be combined with an attractive lounge.\nNaturally if you are going to show your building\nto the public the operating area should be neat and\nstraightforward in arrangement. The appearance of\nprecision and efficiency which a well-arranged,\nwell-kept transmitter area gives the onlooker can\nbe a valuable goodwill agent for any station.\nD. TECHNICAL ACCESSORIES TO THE BUILDING\nThere are a great number of technical features\nthat can be added to a transmitter building, the\nchoice of which will be determined in most cases by\nindividual needs, as interpreted by the technical\nspecialists working on the building. A few of the\nmost generally valuable features of this type are dis¬\ncussed here.\nEmergency Power: The chance of losing air time\ndue to primary power failure can be minimized in\ntwo ways:\n(1) Installation of standby diesel or gasoline-\nengine driven generating equipment large enough\nto operate the transmitter and auxiliaries. Such gen¬\nerating equipment should usually be placed in a\nseparate building, for lower insurance rates.\n(2) Provision of alternate power run, or connec¬\ntion to entirely separate commercial source, if such\nis available.\nEmergency power has strongly proved its value\nin the experience of many broadcast stations.\nCommunication System: Communication between\ndifferent parts of the building becomes important\nin the larger buildings. Telephones for outside\ncalls and building intercom should be placed on\nthe control desk. In particular, a telephone line\nfrom the control room to the base of the antenna\ntowers, in directional arrays, will greatly facilitate\nadjustment of the antenna system.\nRecording Room: In combination studio-transmit¬\nter buildings, where disc recording is to be done\nregularly, a stable floor in the recording room is\nessential. Various construction methods are avail¬\nable for giving the floor a very low period of vibra¬\ntion and insulating it from disturbances in the rest\nof the building.\nShielded Test Room: In the higher frequency sta¬\ntions—FM and television—a shielded test room\nmay be found valuable, to eliminate errors in ad¬\njusting monitoring and test equipment. The con¬\nventional grounded \"chicken wire” booth is usually\nsatisfactory.\nYour control room can \"work\" for you with the public, as shown by this\nbeautifully arranged and decorated room at Station WWJ, Detroit.\n20"
}