{
  "id": "d672-52",
  "text": "E. BUILDING SERVICES-CONSTRUCTION METHODS\n1. Heating the building — Waste\ntransmitter heat\nTransmitter buildings in colder climates can be\nheated by any of the conventional methods, but hot\nair and radiant systems have proved the most popu¬\nlar types. Insulation pays off in transmitter buildings\nin the same way as in other types of buildings.\nThe subject most discussed in this connection is\nnaturally the use of waste transmitter heat to heat\nthe building. The system has received widespread\napplication, as can be seen in the Survey tabula¬\ntions on page 38. Many successful installations of\nthis type have been made which have proved to be\neconomical and practical. However, before you\nplan to use it, your architect and heating engineer\nshould give careful consideration to the following:\n(a) In colder climates, waste heat should not be\nrelied on as the sole means of heating the building.\nMost broadcast transmitters are turned off a part of\nthe time, whereas in cold weather a building must\nbe heated continuously.\n(b) In most cases in colder climates, the waste heat\nshould be used to supplement the regular heating\nsystem rather than the other way around, since the\nregular heating system must have full capacity for\nthose periods when the transmitter is turned off.\n(c) In summer, the waste heat must naturally be\ndischarged outside the building. This means that a\nsystem of control must be installed which can be\nused to discharge the waste heat outside in the sum¬\nmer, and utilize it in the building in the winter.\nWhen correlated with an air conditioning system\nfor summer cooling (see below) this can become\nan elaborate and expensive system.\n(d) A careful study of the cost of the required con¬\ntrol systems sometimes shows that it is cheaper to\nexhaust the waste heat outside the building, winter\nand summer, and rely on a conventional heating\nsystem for the building.\n2. Cooling the building\nWhether or not a system is installed for cooling\nthe building by mechanical refrigeration will be\ndetermined by the climate and by the resources of\nthe management. Wherever hot summer tempera-\nSeptember 1947\ntures are encountered, a complete conditioning sys¬\ntem for cooling the building and filtering the air\nwill promote efficiency of personnel and will pay\nbig dividends in increasing the reliability of the\nequipment. The minimum should be a system for\nexhausting the air of the whole building in summer,\nwith provision for entry of filtered air to replace\nthat moved out.\nAs pointed out on page 14, transmitter waste heat\nshould not be loaded on the building mechanical\nrefrigeration system if it is possible to avoid it.\nWith the larger transmitters, provision must be\nmade to isolate the transmitter heat from the build¬\ning cooling system in the summer.\n3. Construction methods and building\nmaterials\nThe construction methods for a broadcast trans¬\nmitter building are in most respects the same as\nthose for other types of buildings of similar size.\nChoice of materials will depend on cost and avail¬\nability, on building ordinances, and on the desires\nand resources of the station management.\nReinforced concrete and brick are the two most\npopular forms of construction for the larger build¬\nings. Fieldstone, alone or in combination with con¬\ncrete or wood, is economical in many areas, and can\nproduce a substantial, attractive building that has a\nstrong harmony with its surroundings.\nMany of the smaller buildings are very satisfac¬\ntorily built mainly of wood. The original design\nfor a 250 watt AM station on pages 24 and 25 shows\nwhat an attractive and efficient building wood con¬\nstruction will produce when combined with brick\ninner walls. Wood in combination with concrete is\nanother attractive possibility.\nYour listeners want to see your transmitter building. KRSC invited\nthem in for a good look around on opening night, as shown below."
}