{
  "id": "d672-53",
  "text": "On pages 12 and 13 several simple \"utility” types\nof construction are shown. The \"utility” building\nhas been of particular value during the war and\nearly post-war years. It permitted many stations to\nget on the air which would otherwise have lost\ntheir chance to get into the business. Building block,\nconverted wood structures, and various types of pre¬\nfabrication have all played their part during this\nperiod when building was difficult.\nFireproof construction is valuable not only as a\nsafety measure, but in lowering insurance rates. To\nmake sure of getting the best possible construction\nfrom the Fire Underwriters’ point of view, have\nyour building plans examined and recommenda¬\ntions made by a fire insurance consultant.\nIt is required by the Underwriters’ and FCC\nregulations that the metal frame of a transmitter\nand all associated equipment, as well as the frame\nof the transmitter building itself, be thoroughly\ngrounded as a protection to operating personnel. In\nsome cases this is combined with the r-f ground for\nthe transmitter. No large conducting bodies in a\ntransmitter building should be left ungrounded. If\nmetal lath is used on the walls, this should be\nbonded together at a number of points and con¬\nF. THE STYLE OF YOUR\nFinally, you must be satisfied that the whole style\nof your building truly fits in with what you want\nyour station to be. Permanently satisfactory archi¬\ntectural style is based on two principles: (a) It fol¬\nlows naturally from the interior shape and function\nof the building; (b) it has some pleasing order or\nharmony in the exterior, which fits in with the site\nand with the materials used.\nBecause a radio transmitter is a very modern\nphenomenon, it seems appropriate that the trans¬\nmitter building should usually follow a style be¬\nlonging within that broad range roughly known as\n\"contemporary”. However, as shown on pages 12\nand 13, many styles are possible, and the important\nthing is that the building follow your own needs,\ndesires, and expectations of the future.\nIt is here that a less tangible element enters into\nthe planning of your transmitter building, an ele¬\nment strongly personal but nevertheless inseparably\nnected to the grounding system, to form a practical\nshield against r-f energy.\nA hazard often overlooked is the induction of\nr-f energy in small metal parts of the building\nframe with consequent dangerous temperature lev¬\nels, particularly when the antenna is close to the\nbuilding. This applies especially to AM stations of\nhigher powers, but it remains as a possibility even\nwith lower power AM stations and FM stations of\nall powers. Wooden buildings with composition\nroof are more often subject to this kind of danger.\nHeating of the nails in the roof or floors of the\nbuilding may require some form of shielding or\ngrounding system to eliminate a definite fire hazard.\n4. Landscaping\nThe landscaping of a transmitter site will natur¬\nally follow the ideas and desires of the station\nmanagement. Do not forget that the landscaping\nplays a major role in the idea that the public forms\nof your station, as already pointed out on page 10.\nIt can be a very positive element in the public rela¬\ntions program of the station. The Survey tabulation\non page 38 shows average expenditures for land¬\nscaping by stations throughout the country.\nTRANSMITTER BUILDING\nconnected, over the long run, with the success or\nfailure of your business. This is the sense of perma¬\nnence, of pride, of personal identification with the\nstanding of your business in the community, which\nshould be expressed in many ways, and certainly\nin a substantial and beautiful transmitter building.\nIt is easy to pick out, in broadcasting as in other\nbusinesses, the organizations that achieve long-\nrange success. Every aspect of their equipment ex¬\npresses this same sense of permanence and pride.\nYou have read this guide because you know that\ngetting on the air with a broadcast station is a large\nundertaking, involving a considerable investment\nof money and effort. You understand that you can¬\nnot afford to let your transmitting equipment oper¬\nate in a building that is badly planned and care¬\nlessly built. Your hopes for the future should be\nbuilt around a really fine transmitter building. Can\nyou afford anything less?\n22\nWestern Electric"
}