{
  "id": "d672-67",
  "text": "SECTION III\nA Survey Study of Six Hundred Ten\nBroadcast Transmitter Buildings\nThis is a report on the American broadcast trans¬\nmitter building—and on the hard-won wisdom of\nthe men who own, manage and operate it. Six hun¬\ndred such men throughout the industry laid the\nfoundation for this report by answering a detailed\nquestionnaire sent out to discover the characteristics\nof transmitter buildings for every power rating—\nhow big they are, what they cost, what technical\nfunctions and operating conveniences they embody.\nThe statistical picture of the American transmit¬\nter building which these six hundred questionnaires\ncontain has been painstakingly developed by tabu¬\nlation, recapitulation and analysis, and is presented\nin the table on pages 38 and 39 of this guide.\nFrom the figures shown, it is possible for the first\ntime to generalize about the character of the trans¬\nmitter building which has developed after two-and-\na-half decades of broadcasting in America.\nIt is evident, for instance, that:\nThe American transmitter building is most often\na single story structure of brick or concrete, in a style\nwhich its owners regard as \"modern;”\nIt was built almost entirely between 1935 and the\npresent, with certain classes—in particular the FM\nstations—built heavily in 1946 and 1947;\nThe use of combined studio-transmitter installa¬\ntions is concentrated strongly in the 250 watt sta¬\ntions, of which about half are of this type;\nWaste transmitter heat is used to heat building\nareas in a substantial majority of the buildings cov¬\nered in the Survey.\nThese facts and many others are shown in com¬\nplete detail in the table on pages 38 and 39, which\nindicates not only the size, cost and type of construc¬\ntion for buildings of each class, but also the building\nunits and rooms, subsidiary to the actual operating\nareas, which are included in the transmitter build¬\nings covered.\nThe six hundred station owners, managers, and\noperators who participated in the Survey have done\nmore than give the dimensions, cost and construc¬\ntion of the buildings they use. They were invited to\ntell what they did and did not like about their build¬\nings after the experience of living with them, and\nthey plainly jumped at the chance.\n\"Inadequate storage space” is the complaint made\nmost often. \"I would say that there should be at\nleast twice as much space for storage,” is the report\nfrom a 250 watter, with 100 square feet of storage\nspace. \"We find the amount of storage space we\nhave not nearly sufficient: we think at least 250 to\n300 square feet should be provided,” comes from a\n5 kw AM installation. One particular type of storage\nmentioned several times was that for a record and\ntranscription library, in a location making recorded\nprogram material easy and efficient to use."
}