{
  "id": "d672-68",
  "text": "Other building facilities of uppermost interest\nto managers and chief engineers are, in approxi¬\nmately the order named: workshop, shower room,\ngarage, kitchenette, employees’ lounge, and living\nquarters. If the building lacks any of these facilities\nthat lack is apt to be noted; if it has them, satisfac¬\ntion is generally expressed with the convenience\nand efficiency of such features.\n\"We really should have the following features to\nmake our building satisfactory from an operator’s\nstandpoint: attached garage, shower room, kitchen\nand sleeping quarters, extra storage space”—this\nfrom a 1 kw AM station.\nA 250 watt station with two complete apart¬\nments, one at each side of the transmitter and con¬\ntrol room, comments: \"This duplex arrangement\nwith transmitter between has certainly been a good\nbet in the last few years.”\nAmong the more graphic warnings noted is one\nfrom an FM station on a mountain top: \"If we had\nknown about the terrific wind and rainstorms on\nthis mountain, we would have given greater con¬\nsideration to weatherproofing. The rain drives\nacross the mountain horizontally and went right\nthrough the walls, until our special weatherproof¬\ning was completed.” Another warning based on bit¬\nter experience comes in these words from a 250 watt\nstation: \"Also fence entire area to prevent trespass¬\ning and disturbance of ground system, namely, un¬\nlawful removal of same.”\nA number of the technical features and building\nservices that stand out as winning more or less\ngeneral acceptance are: air conditioning for the\nbuilding; high-capacity exhaust fans to move hot\nair out of the transmitter room; electrostatic pre¬\ncipitators for cleaning the air; emergency power\nsources; emergency studios.\n\"Would incorporate in a new building” writes a\nThe average cost figures shown below and in the\nchart on the next page are not current construc¬\ntion costs, but are averages for the whole period\nof transmitter building construction going back\nto about 1930. Today’s higher costs show a wide\nfluctuation from locality to locality, ranging from\n50% to 150% higher than the figures shown\nbelow.\n5 kw AM from Florida, \"a solar water heating\nsystem, automatic emergency power supply on a\nseparate concrete base to eliminate vibration, and\nresidence for chief engineer.”\nA number of stations comment on the impor¬\ntance of having duct or raceways in the floor to\nfacilitate interunit wiring, a matter discussed in\ndetail on page 16 of this guide.\n\"The most valuable idea incorporated in the\nconstruction of our building is the wiring through\nthe floor, which makes it easy to repair wiring, and\nthe addition or rearrangement of equipment is\neasily done,” comes from a 1 kw AM.\nOther technical and architectural features, men¬\ntioned as definitely proving themselves in use, in¬\nclude: a water screen on the roof to provide insula¬\ntion; an enclosed entry to keep dirt from getting in\nthe transmitter room when persons enter the build¬\ning; glazed tile to make a removable control room\nwall for easy expansion; bonding and grounding of\nmetal lath to make an r-f screen around the building.\nThe extent to which transmitters are today\nhoused in temporary structures is borne out by the\nnumber of times that a description of \"our future\npermanent building” is offered. The wartime con¬\nstruction difficulties forcing so many stations into\nemergency quarters, and the continuing expansion\nof the industry, make it certain that transmitter\nbuildings are going to be erected in enormous vol¬\nume in the next few years.\nAVERAGE COST OF BUILDINGS\nFROM 250 W TO 50 KW\nKEY\n$46,300\nTRANS- COMB.\nMITTER TRANS-\nBUIIDING MITTER\nONLY STUDIOS\n$36,500\n$43,200\n50 KW 50 KW\nAM FM\n3 KW\nFM\n5 KW\nAM"
}