{
  "id": "d672-97",
  "text": "radio Engineering Laboratories, Inc.\nBEL EDUCATIONAL FM BROADCAST TRANSMITTER\nMODEL 706\nThe BEL Model 706 10 Watt Educational 1M Broadcast Transmitter is a high\nquality, inexpensive equipment which comes within the budget means of most edu¬\ncational institutions. It exceeds in every detail the exacting performance re¬\nquirements of the ECO for commercial FM broadcasting and, surpasses by far, the\nrequirements for educational service. Therefore, the Model 706 Transmitter may\nbe used at a later date as an exciter for BEL transmitters of higher power in\nthe range from 250 Watts to 50,000 Watts.\nThis transmitter employs the remarkable SERRASOIB MODULATOR, developed\nand manufactured exclusively by BEL. As a result, the overall design is simple\nand straight-forward, requiring no special tubes or control mechanisms. There\nare fewer tubes and circuits employed in the BEL Model 706 Transmitter than in\nany other transmitter capable of meeting the educational broadcast requirements.\nIt is the finest equipment of its kind available today.\nThe entire unit is housed in a rugged aluminum cabinet, and is designed\nto permit ready accessibility and ease of servicing.\nThe basic principles used in the design of this transmitter are a result\nof pioneering IM research on the part of BEL, the first manufacturer of FM\nbroadcast equipment in the world.\nECONOMY?\nThe BEL Model 706 Transmitter is outstanding in its economy, be¬\ncause it employs only standard vacuum tubes readily available any¬\nwhere. This coupled with its exceptionally low purchase price,\nresults in a substantial saving to the Purchaser.\nINSTALLATION?\nInstallation is a very simple matter. The Model 706 Transmitter\nis completely tested on the user’s operating frequency before ship¬\nment and an instruction book is furnished containing detailed direc¬\ntions for installation, operation and maintenance. The entire\ntransmitter when delivered, is ready for immediate operation. Con¬\nnection to an ordinary AC wall outlet can be made in the conventional\nmanner similar to any electrical appliance. It is easier to install\nthan the average television receiver.\nRELIABILITY?\nSimple, conservative design employing only the highest quality\ncomponents, assures the operator of trouble-free stable operation\nfor the life of the equipment. All components are generally avail¬\nable in or near most communities.\nArticle 9-220\nPage (l) of (A)\nDate: 12-29-48"
}