{
  "id": "d672-98",
  "text": "Radio Engineering Laboratories, Inc\naccessibllitt-\nAll individual chassis in the transmitter are the vertical relay\nrack type for ready accessibility* All input and output connections\nare available by means of plugs and Jacks located at the rear of the\ncabinet*\nSAFETY:\nSafety devices are provided to prevent physical contact with any\nvoltage. Locks are included to prevent access by unauthorized per¬\nsons.\nCOVERAGE?\nEhere are many factors that affect the coverage of the broadcast\nsignal from the Model 706 to the average home type FM receiver.\nAmong these factors are antenna height, receiver sensitivity and the\nnature of the surrounding terrain. However, with a simple transmit¬\nting antenna mounted on the average school roof, coverage may vary\nfrom a minimum of an average campus area to a maximum area of two to\nfive miles radius.\nThe Model 706 Transmitter is designed around the new BEL SERRASOID M0PU-\nXAffOR** This invention is destined to play an important part in FM history.\nThe device employs only four simple receiving tubes, and contains no tuned\ncircuits. It, therefore, makes available for the first time a simple and re¬\nliable approach to genuine Frequency Modulation transmission. It is interest¬\ning to know that the modulator's electrical performance, which determines the\nquality of the signal that is heard in receivers, is superior by a wide margin\nto any other system known to the radio art today.\nELECTRICAL SPECIFICATIONS\nOperating Frequency?\nAny single frequency in the 88 to 108 me.\nrange.\nCenter Frequency Stability:\nFM Signal to Noise Ratio:\nAM Signal to Noise Ratio:\nAudio Frequency Distortion:\nVithin plus-minus 1000 cycles over normal\nroom temperature range.\n75 db below 100$ modulation.\n50 db below 100$ modulation.\nLess than 0.5$ for any single frequency in\nthe 50 to 15,000 cycle band at 100$ modu¬\nlation.\n* (SBRRASOID MODULATOR) - Electronics,\nOctober 1948,\nArticle 9~220\nPage (2) of (4)\nDate: 12-29-48"
}