{
  "id": "d274-10",
  "text": "-4-\nIt was moved, seconded and accepted that the Executive Committee\nauthorize the preparation of a resolution which would be directed\nto its concern that the professional staff of the Association\nbe informed of the Committee’s understanding of its responsibility\nfor their welfare, and that the Committee commit itself to a\ncontinuation of professional services for institutions and\nindividuals, across media, across divisions, in any way possible,\nand that the staff be directed to recommend alternatives which\nwould make it possible to accomplish such services. (Breitenfeld/\nHarrison)\nPUBLIC MEMBERS\nMr.\nHarley re\nported\nthat Leonard Marks has\nres\nigne\nd from\nthe NAEB\nBoar\nd of Dire\nctors t\no avoid any possible c\nonfl\ni ct\nof inte\nrest\nthat\nmight be\ngenera\nted from his law firm'\ns re\npres\nentatio\nn of\nthe\nCorporati\non for\nPublic Broadcasting as\nout\nside\ncounse\n1.\nELECTION OF TREASURE\nR\nMr.\nRay Richards was\nelected Treasurer of\nthe\nAsso\nc i a t i o n\nCBreitenfeld/Macandrew)\nAUTHORIZATIONS\nThe following resolutions were approved in order to update\nbank authorizations transferring signature authority from Mr.\nHough to Mr. Richards:\nFor NAEB General Fund Account:\n’’Resolved: That Ray J. Richards, Jr., the Treasurer of\nthe National Association of Educational Broadcasters is\nauthorized and instructed to continue a depost account\nfor and in the name of this corporation or organization\nwith the National Bank of Washington, to deposit therein\nfunds of the corporation or organization and that said\naccount may be drawn on only by check signed in the name\nof this corporation or organization by one of the\nfollowing: President, Treasurer, Vice-President and\nSecretary and countersigned by one of the following:\nPresident, Treasurer, Vice-President and Secretary.\"\n(Harrison/Macandrew)\nFor NAEB Payroll Account:\n\"Resolved: That Ray J. Richards, Jr., the Treasurer of\nthe National Association of Educational Broadcasters is\nauthorized and instructed to continue a deposit account\nfor and in the name of this corporation or organization\nwith the National Bank of Washington, to deposit therein\nfunds of the corporation or organization and that said\naccount may be drawn on only by check signed in the name\nof this corporation or organization by one of the follow¬\ning: President, Treasurer, and Vice-President.\"\n(Breintenfeld/Macandrew)"
}