{
  "id": "d274-103",
  "text": "2\nProbst reported two other decisions reached by the FAE at this meeting which\nindirectly affect the NAEB. A proposal by Ralph Steetle to continue a second\nyear grant to the Joint Committee on Educational Television was agreed to.\nAfter consultation with Steetle, Probst presented to Mr. Fletcher a request\nthat Mr. Fletcher authorize the current JCET to pay the old ad hoc JCET debts\nfrom the $9,000.00 that will be unexpended in the current yearns budget. Mr.\nFletcher agreed to present this request to his Board and it will undoubtedly\nbe approved. Thus the old ad hoc JCET debts of about $4*800.00 which now\nhang over the head of the present JCET will be discharged. Everybody con¬\ncerned in this matter is pleased with getting this done.\nSiegel asked whether a second year grant would be made for the Lowell program-\nming project. Wheatley, Hull, and Probst said that their judgment was that\nthe FAE would make this grant. They said, hoxtfever, that Fletcher did not\nprovide an opportunity for discussion of the specific amount. Fletcher did\nindicate that the second grant would probably be made at the July meeting of\nthe Board of Trustees of the Fund. Fletcher had indicated satisfaction with\nthe general areas of the program project and believed they should be continued.\nProbst also commented on the value of a man like Goldschmidt in our project.\nFletcher has met and talked to Goldschmidt several times, and is impressed\nthat we have been able to hire a man of his capabilities. Probst went on to\nsay that Goldschmidt was terrific, that he is the type to make an outstanding\nuniversity president and is one of the leading young social anthropologists in\nthe country. Probst said that the whole past and future success of the project\ndepends upon our ability to identify and persuade brilliant and intelligent\npeople to work for us.\nAt Pasadena, Fletcher stated his desire to discuss the problems and opportunities\nof our project with the NAEB. Siegel said that Fletcher has been invited to\nspeak at the Columbus meeting and has accepted. He will have a chance to talk\nto the NAEB board during its Thursday meeting and will share the speakers9\nduties with Chairman Walker of the FCC at the annual NAEB luncheon on Friday.\nThis means that Fletcher will get a chance to inform the entire NAEB membership\nof his plans and problems.\nProbst reported that he told Fletcher at Pasadena that the Adult Education\nCommittee did not want the responsibility of administering a second year grant.\nMiles asked if this brought any reaction from Fletcher. Probst replied that\nFletcher was disturbed by the request—that he thought both the Adult Education\nCommittee and the Lowell Foundation had been very successful in a difficult\nand creative job. Wheatley reported also that Lowell did not want to handle\nthe funds another year, and that this had been reported to Fletcher.\nThe question was raised as to when the Adult Education Committee should meet\nwith the NAEB Board of Trustees to report on the projects and answer any further\nquestions that the Board may have which are not answered in the minutes of the\ncommittee’s meetings. Siegel said that the next NAEB Board meeting at Columbus,\nOhio, would be the proper and desirable place for a joint meeting with the Adult\nEducation Committee, and that since it will then be three months since the two\ngroups met together on January IB-19, it would certainly be desirable to hold\na joint meeting in Columbus. Siegel formally extended an invitation to the\nmembers of the Adult Education Committee to meet with the Board at that time."
}