{
  "id": "d274-104",
  "text": "3\nHarley then proceeded to report on the current state of each of the four\nareas of the Lowell project he was supervising.\nOUR AMERICAN HERITAGE: There are now four shows on tape. Claude Rains\nappears on all of them. All were written by Wishengrad, and these are all\nWishengrad is going to do for the present. He may do the final one in the\nseries. Geiger, who has already written one of the USSR programs, is going\nto work immediately on the next Jefferson script. Rains is currently in\nLondon for a picture and will return about May 19. One of the big questions\nfor the committee is whether we should wait for him. It looks as though it\nwill be possible to have all the scripts ready for him to do two or three a\nweek when he returns. The committee agreed to wait for the return of Rains\nso that all the scripts can be produced with him playing Jefferson.\nHarley and Papp are experimenting with smaller musical organizations for\nfuture shows. The first show cost about $5,200.00. With a 16-piece orchestra,\nsubsequent shows have cost $4,200.00. At this price, there is about enough\nmoney left to produce six more shows. These costs are for writing, acting,\nand production. They do nob include administration. Harley and Papp are ex¬\nperimenting also with reduced casts on future shows. (Harley thought it might\nbe possible to use money from the Iron and Steel. Institute to pay for two or\nthree more shows—more on this later.)\nSiegel said that he thought that thirteen shows were a must. Harley said they\nwere trying to get them, but that he didn’t want to sacrifice the quality on\nindividual shows. Siegel thoughtthat at least he should proceed to have 13\nscripts written. This was agreed to. Wheatley thought that they should try\nto produce a show with no music, or with a single instrument. Harley agreed\nto work on this idea.\nProbst said that one of the major problems was to get Malone to process the\nJefferson scripts more rapidly. Malone, has always worked at a much more\nleisurely pace and spends a great deal of time checking carefully anything he\nis responsible for. Probst suggested that we should bring in Douglas Adair,\nof the University of Virginia, to help Malone. It would be his job to relieve\nMalone of some of the responsibility for approving plans of the scripts.\nMalone has great respect for Adair’s judgment, and this would enable Malone\nto feel that he has some assurance of professional concurrence in the decisions\nhe is making.\nSiegel pointed out that we have a daily overhead of $70.00. He thought that\nthe wH.t1.ng should be done first, before any producers, etc., were hired.\nHarley pointed out that he and Papp were the whole office staff on the Jeffer¬\nson series, and further emphasized the importance of having the producer work\nwith the writer and others all the way through. Probst said that we were\nhaving to go through a long educational process v&th Malone, and that we were\npaying the tuition. Probst felt that there would have been no scripts if Papp\nhadn’t been on the job full time. Hull said that he thought the costs were\nstaggering and that we certainly needed more planning in the future. Siegel\nsaid that if advertising agencies operated the way we have, they’d be out of\nbusiness in no time. Probst reiterated that the educational process was long\nand difficult and cost time and money. Siegel said that may be true, but in\n• the future we should get the scripts written before hiring a producer and staff"
}