{
  "id": "d274-105",
  "text": "4\nHarley thought there should be a central office staff. Siegel argued that\nhe could do these shows for half the cost. Hull suggested that shortcuts be\nused wherever possible. Harley stated that he had been guided by what he\nunderstood to be the principle of operation outlined by the committee: ,fGet\nthe best minds; and the consultant is God.” He felt that the distinctive\nfeature of the programs was their authenticity and the authority behind them.\nSiegel said that he had no criticism of the past, but that he wanted the\nuneconomic procedures of the past eliminated. What he had been saying was\nintended as advice for the future. Probst said that he was not sure that\nlosses could be avoided when you attempt to transfigure an academician into\na radio dramatist. Probst said his experience was that a content-matter\nspecialist and a scriptwriter alone are not enough to work with a consultant,\nfor the decisions of the producer are a necessary element.\nHull stated that he felt we should keep the committee discussions at the policy\nlevel. He had only expressed an opinion that the costs are alarmingly high,\nbut the ends may well justify the costs. Hull used as an analogy the idea that\nhe could hire Wons to conduct some audience surveys for WOI-TV at 25$ an\ninterview. He didn’t think he’d learn much from such a survey. He could also\nget Won3 to conduct a survey at $5-00 an interview. This would certainly be\nmore revealing and tell him more of what he wanted to know. At the present\ntime a research group on the Iox*a State College campus was conducting some\ninterviews at $25.00 each. From this Hull was getting what he wanted to know,\nbut thought the cost was exorbitant. Certainly there is some middle ground\nbetween the $5*00 and the $25.00 figures.\nProbst said that he had felt that the costs were high, but that now he had\nseen a few of the Jefferson scripts and the high quality which had been ob¬\ntained, he felt that the situation could be justified and defended. Further,\nit must always be kept in mind that the preliminary fumbling and uncertainties\nwere avoided in the later productions.\nAt this point Harley reported on a feeler he had received from the Iron and\nSteel Institute. The tentative idea is that they would make albums of the\nentire Jefferson series and make them available to schools. Probst thought\nthat this was wonderful and would strengthen our hand with Fletcher and\nFletcher’s hand with his Board. Probst pointed out that with all its money\nthe Saudek TV-Radio Workshop group had been unable to sell any of its work.\nIf we could pull off this deal it would support Fletcher’s conviction that\nhe was right in insisting on continuing support of educational radio work.\nProbst asked what should be the conditions of our acceptance of such an offer\nas had come from the Iron and Steel Institute. What credits should the Insti¬\ntute get and what costs should they bear? Siegel said that they could cer¬\ntainly eliminate the cost of distribution to NAEB stations. Probst thought\nwe should keep in mind the effect of this proposal on Fletcher. Siegel pro¬\nposed that the Institute should pay the NAEB a nominal fee, that they put in\na minimum of advertising material, and that they give the NAEB 100 copies for\ndistribution to its members.\nHull moved that Harley, in the basis of the inquiry by the public relations\nofficial of the Iron and Steel Institute, should conduct negotiations toward"
}