{
  "id": "d274-106",
  "text": "5\n*\nthe end that the Iron and Steel Institute would assume all recording, promo¬\ntion, and distribution costs plus a small grant to the NAEB. There was con¬\nsiderable discussion as to the details of the motion, Probst again stated\nhis feeling that the important thing was the strategic position this would\nplace us in with the FAE, Harley indicated that any negotiations with the\nIron and Steel Institute might be quite difficult. For instance, the writers\nby contract retained the rights to their scripts. Siegel thought that in the\nfuture vie should have all rights to all scripts we pay for. Harley stated\nthat the standard Radio Writers’ Guild contracts had been used and that this\narrangement was forbidden by these contracts. Someone added that Wishengrad\nwas one of the leaders of the Guild. Probst argued that we were providing\nexpensive consultants for the writers and we should have full rights to the\nscripts. Wheatley thought that we should have legal counsel in this matter.\nWheatley went on to say that he felt we should recover all production costs\non the Jefferson series from the Iron and Steel Institute. This money should\nthen be put in a revolving fund to produce more shows. Probst strongly agreed\nwith this principle. Siegel thought the idea of recovering the funds was all\nright, but felt that this committee did not have the right to tie up the money\nfor production of more shows. Siegel said that the money should be given to\nthe NAEB and that the NAEB Board should appropriate it for whatever use it\ndesired. He went on to say that he felt the Board would appropriate it to\ndo more shows, but that it should have that right. Probst said that it would\nbe unethical, and certainly unacceptable to Mr. Fletcher and the FAE, if in¬\ncome from the sale of these radio programs were to be diverted in any way or\nany part from the revolving production fund principle. Siegel disagreed,\nsaying that this matter was not the responsibility of the Adult Education\nCommittee to decide. Probst pointed out that the Adult Education Committee\nhad been authorized to administer the Lowell project by both the NAEB and the\nFAE. Siegel asked Probst who would administer the fund if the money were col¬\nlected and put in a revolving fund. Probst replied that the Adult Education\nCommittee was responsible for the first year of the grant. Siegel pointed out\nthat the committee had asked to be relieved of its responsibility in future\nyears. Probst agreed, but said that if money were collected from the sale of\nshows produced under this grant, this committee had the responsibility of\nsetting up the principle of a revolving fund and expending such funds in the\nfirst year (perhaps to supply enough money to insure production of a full\ntotal of 13 Jefferson shows during May-June), or of leaving the money and\nthe principle of the revolving fund as a legacy to whoever is responsible for\nthe second year’s operation. Probst told Siegel that he (Probst) felt he had\nbeen badly burned on the collecting and spending of the ad hoc JCET funds.\nProbst said he had been responsible for raising most of the money, and he was\ndisgusted with the way Siegel tried to convert it to NAEB purposes when the\nmoney had been raised'as a result of the appeal in behalf of the JCET. Siegel\nrepudiated this imputation. Probst said he was shocked that Siegel would for\na moment consider the possibility that the NAEB Board could exercise the option\nof taking these possible Iron and Steel Institute funds for general use by the\nNAEB. Such action would destroy the confidence in our project and actions\nthat had been created in the FAE. Probst said that he would not permit himself\nto be associated in any way with such a development. Further, Probst thought\nthat this matter should not be referred to the NAEB Board at all, for the Board\nis not sufficiently informed about the obligations to and understandings with\nthe FAE to be certain of making & correct decision if given the choice of\naccepting money from the Iron and Steel Institute for NAEB purposes or of"
}