{
  "id": "d274-107",
  "text": "6\nr\napplying such money to program production under the principle of a revolving\nfund for this use. Siegel asked that this statement be recorded in the minutes.\nProbst fully agreed, and repeated that he was convinced that this whole problem\nof what policy instructions should be given Harley in negotiating with the\nIron and Steel Institute was the responsibility of the Adult Education Committee\nSiegel stated that he was in favor of the revolving fund for program production,\nand reiterated his conviction that the decision on such a matter was a respon¬\nsibility of the NAEB Board. Harley asked what, in the light of this discussion,\nhe was supposed to ask for in the negotiations with the Iron and Steel Institute\nWheatley moved to amend Hullf3 original motion to read that Harley should nego¬\ntiate with the Iron and Steel Institute nto recover program production costs\nand additional costs as necessary to serve the mutual interests of both groups.\"\nThe amended motion was agreed to as the directive for Harley. Harley is to\nreport back to the Adult Education Committee on the results of the negotiations.\nThe question of release dates for publicity and for the shows was then dis¬\ncussed. Harley stated that it had been suggested that all four series be\nreleased at the same time. Wheatley thought that the Jefferson series should\nbe released in May, even with the possibility of a hiatus after four shows,\nsince he thought this would be a help to Fletcher. Siegel and Hull thought\nthat a June release would be better from a publicity point of view. Siegel\nthought that the Jefferson series should be released first, although only one\nshow in the series needed to be aired before releasing the USSR series. Hull\nsaid that perhaps the four shows already done could be released on June 1 so\nthat a summer trial run could be made. Siegel moved that as many Jefferson pro¬\ngrams as possible be released to as many NAEB stations available the week of\nJune 1. This was agreed to. Miles questioned whether we still intended to\nfollow the release plan approved at the December meeting. It was decided to\nrelease only to NAEB stations at this time with more to come later when a mass\nduplicator is installed or the Iron and Steel Institute make pressings available\nINTERNATIONAL UNDERSTANDING; Harley said that under the present plan, each of\nthe five consultants are to be personally responsible for one show, and that\neach would appear on that show. It is hoped that all production on the five\nshows can be done during April. Plans for all shows are in, and one script is\ncompleted. Production on this script is set for April 7.\nSiegel moved that the USSR series be released to as many NAEB stations as are\navailable during the week of June 15, but that no shows or publicity on the\nshows should be released until the Adult Education Committee has heard all\nfive shows*\nWheatley thought the USSR series should be tied in some way with the idea of\nthe adult education of the American voter. Hull suggested that a presidential\ncandidate might appear on each show. Probst was against tying in that closely\nwith election politics. Siegel suggested that the shows might be released so\nthat a station could play all five during one week. Wheatley thought that\nwas a good idea if you followed up by repeating them on a one-a-week basis,\n^robst said that release on June 15 would be bad in that we could get little\npublicity on them at that time due to the political conventions. He felt they\nshould be released in the Fall. A vote was taken on the Siegel motion that\nthe USSR series be released during the week of June 15. The motion was agreed\nto with Probst dissenting."
}