{
  "id": "d274-108",
  "text": "7\n-\nIn the matter of credits for each show, Harley proposed that the phrase be\nused, \"This series is arranged or presented in cooperation with the staff\nof...” It was understood that a consultant would appear on each show and that\nthat the names of all cooperating institutions would be used if possible.\nThis was agreed to.\nPapp and Fuller joined the meeting at 1:00 P.M. They backed up Harley’s time\ntable of production on both the Jefferson and the USSR shows. (This had pre¬\nviously been questioned by Probst who didn’t think they could move that fast.)\nFuller outlined some of the difficulties he is having in getting the shows\nready for production. He said that he was sure we were going to be subject\nto attack. He thought that one way we could lessen the attack would be to\ntie together the publicity on the.USSR and the Jefferson series. He also\nthought, under questioning, that \"insulation” whould be difficult. He was\nsure\" that Fisher (of Stanford) felt that the shows should all stand on their\nown. Herbert Hoover was again suggested as the ideal kick-off man on the\nseries. Fuller thought Fisher could get him, but wasn’t sure he’d want to\ndo it. In McCarty’s absence, Harley again presented his idea that insulation\nwas not necessary and that we should let the shows stand or fall on the names\nof the consultants. Papp thought that if we feel the need for insulation on\nthe USSR shows, we might also feel the need for it on the Jefferson show.\nThe general impression was that we should wait until we hear all the shows\nand then decide on the need for insulation. Wheatley restated his position\nthat he felt it was our educational responsibility to do something about the\ncurrent hysteria regarding Russia. Probst and Siegel expressed their convic¬\ntion that the auspices of a few leading Americans would be necessary, feasible,\nand desirable for the Russian series.\nProbst raised the possibility of sponsoring the USSR series by the Iron and\nSteel Institute or Standard Oil of New Jersey—or other like concerns—on a\nnational commercial network. All committee members present liked the idea.\nHarley said he was sure McCarty would vote against it. No vote was taken on\nthe matter. Harley, Papp, and Fuller all thought sponsorship would bring\ncomplications to our working arrangements with both the consultants and the\ninstitutions they represent.\nThe question of whether to do further shows on the USSR was raised. Fuller\nthought that there was plenty of material, but that we should not continue\non the USSR alone. Maybe we should switch over to the general issue of in¬\nternational understanding. Papp thought we should continue shows on the USSR.\nHe felt that we would not suffer very much in the way of further attacks for\ncontinuing the series, and that we did have a responsibility to educate.\nProbst thought that we had gone through a costly process of acquainting the\nconsultants on how to develop good radio programs in this area and that it\nwould be economically wise to continue to use them. Further, we will have\nonly begun to touch the possible material in this field and we should recog¬\nnize that everybody who knows about this project series in the FAE is very\nenthusiastic about it.\nNATURE OF MANKIND: Harley said that he had reported in some detail on this\nin his last memorandum and had little more to add except that production was\nscheduled on two or three shows during the Easter holiday and that the rest\nwould follow after. The question was to get Goldschmidt to Montreal. he"
}