{
  "id": "d274-109",
  "text": "8\nfelt that he did not have to be present for each production after the first\ntwo or three, then production would proceed at once* If he did have to be\npresent, production might be held up until summer, when Goldschmidt is free.\nThe Canadian production details are all worked out and Harley expects no\ntrouble from that area. No motion was made regarding the release of the\nseries.\nCHIC AFFAIRS AND PUBLIC DISCUSSION: Harley and Probst reviewed the past\nconnection with the consultants in this area, Harold Lasswell and Charles\nE. Herriam. Lasswell had presented his suggestion for a series of clarify¬\ning discussion programs out of a Washington, D.C. headquarters last September\nAt the October 30 meeting of the committee in Biloxi, authorization was given\nto Harley to investigate the idea. At the December 8-9 meetings in New York,\ncommittee members expressed doubt about the relationship between a top-name\ncivic broadcasting council membership and the Lowell Institute program pro¬\njects of the NAEB.\nLasswell and Merriam suggested many names for this civic broadcasting council\nHarley had worked on the approach of asking Judge Learned Hand to be its\nchairman (see minutes of December 8-9 meetings and January 6-7 meetings for\ndetails). At the January Ames, Iowa, meeting, on the basis of the informa¬\ntion Harley had assembled, he wa3 instructed to go ahead and set up the\nWashington operation. At this time, Robert Hudson, consultant to the FAE,\nprivately told Harley to go slow on this matter until after the March meet¬\ning of the FAE. Apparently the FAE was thinking of setting up a committee\nsimilar to the one suggested by Lasswell and Merriam. Harley reported that\nLasswell feels that since such a long time has elapsed batmen the original\nsuggestion and the present, and because the NAEB has failed to implement it,\nand since Lasswell is devoted to seeing his idea fully developed as a contri¬\nbution to democracy through better public information and opinion, Lasswell\nhas said that he wishes to withdraw his suggestion as one for the NAEB to\nimplement. Harley stated that we had no alternative but to accept Mr. Lass-\nwell’s decision.\nProbst stated that he felt we had missed a big bet in our failure in this\narea. Lasswell is one of the smartest political scientists in the country,\nand he gave us a million dollar idea. Our committee did not give Harley\nauthority enough to move fast enough to do something about it. Siegel dis¬\nagreed, saying that the idea was not definite enough and that you could not\nexpect any committee to buy a pig in a poke. Hull moved that the Harley-\nProbst reports and outlines on the Lasswell suggestion be made a part of our\nannual report, and that it be made clear that one of the reasons we failed\nto accomplish it was because of the advice from the FAE liaison person to\ngo slow.\nLasswell may or may not continue to be our consultant in this area; Harley\nis seeing him in a few days. In the meantime, Mr. Merriam has suffered a\nvery serious illness. Harley will discuss with Merriam’s assistant the\nreturn of the $5,000.00 minus whatever incidental expenditures have been\nmade from this sum. It is estimated that about $4,600.00 would be returned.\nWheatley asked why we don’t go ahead with the Washington headquarters plan\nanyway. Probst stated that a key part of the plan was the political guidance"
}