{
  "id": "d274-115",
  "text": "3\nwords, it should not be regarded as part of the international short-wave broadcast¬\ning program which exists for the purpose of projecting official views* This is\nnot to suggest that official views should not be presented, but rather to make\nsure that there is variety in points of view and complete freedom to discuss all\naspects of national policy. Otherwise, one of the main purposes of such a program\nmight well be defeated.\nIV. Suggestions Concerning Format\n1. To be effective, the series should probably have a minimum of 20 broad¬\ncasts; or it might be planned in two sections of, say, 10 to 15 each, with the\nfirst section on an experimental basis and the second to be undertaken if the\ninitial experiment proves successful.\n2. The programs should be not less than 30 minutes in length and preferably\n45. Forty-five minutes or more allows much greater flexibility, room to experi¬\nment, and if the programs are well planned, the longer time makes possible a more\neffective job in terms of information and education.\n3. It might be desirable to plan a series in related groups of three or four\nbroadcasts leaving either the 4th or 5th period open for a topical subject which\ncould be arranged on shorter notice. For a program of this kind to have the maxi¬\nmum educational value, it seems desirable to avoid the buckshot approach. In other\nwords, there should be some pattern of development. The area is sufficiently large\nand has enough concrete problems to make for plenty of variety and interest. An\ninternational discussion series should be topical in character, but if it had to\nbe planned on a week-to-week basis, it would be almost impossible to organize, and\nthe programs would suffer in quality. However, with advance planning, one can be\nreasonably sure to selecting topical subjects and at the same time make allowance\nfor considering new and unexpected developments by leaving an occasional period\nopen.\n4. There should be a general pattern of approach keeping in mind the practical\nproblems of organization, but no fixed format for each broadcast. The formats\nshould be varied to fit the topic and circumstances. For example, big names in\nthe international field are desirable for prestige and publicity purposes, as well\nas for authoritative official views, but it is usually impossible to get a foreign\nsecretary or prime minister to take part in a discussion. However, it is much\neasier to secure a recorded statement of four or five minutes which could be in¬\ncorporated in the program. Similarly, if you wanted a spokesman from some other\ncountry, say the Prime Minister of Egypt on the Suez Canal, a statement might be\nsecured by beam and line or by recording. If some topic seems to demand a two- or\nthree-way discussion between the officials of different countries, the necessary\ncircuits could be secured to make it possible.\n5. For ease of operation, I think that in general topics should be allocated\nand points of origin assigned for each program so that the national organization\nconcerned would assume responsibility for arranging and producing the program in\nconsultation with the coordinator-director. This is probably a simpler and more\npractical method than trying to handle everything from a central point or to\nassemble individual programs, say, in New York or Chicago, by means of recordings,\nalthough naturally there would need to be cooperation in securing recorded state¬\nments or live pick-ups from time to time as required."
}