{
  "id": "d274-122",
  "text": "V\n2\ntalks can be secured from the staffs of these various radio service organiza¬\ntions by Mr, Mayer, Through rental, provision can be made for the needed\nradio recording equipment.\nGeneral policy directive on the aims and format\nof this discussion series\nIt is best to begin by saying what this series is not.\nThis series is not an European radio reporter series\nwith a newspaper expert providing a roundup of the news\nof Europe. It is not a radio commentator series a la H.\nV. Kaltenborn or Edward E, Murrow. It is not a series of\nRound Table discussions on assigned topics to which several\nparticipants devote their efforts in trying to present\nsolutions.\nThe aim of the series is to bring to the American public, through\nfriendly interviews, in he bluntest and most direct fashion possible, the\nstatements and views of range of people who, collectively, will reflect\nin a general way the major political and social lines of thought being fol¬\nlowed by important opinion groups in Europe, It is recognized that this is\na difficult undertaking, dnce no one can be completely sure what the true\npublic opinion condition is in Europe on all issues and there is no scienti¬\nfic method of assessing this. In practice we must present the series with\ngood taste and with the necessary qualifications made clear, as for example,\nthat the guest on this program is a co; 1 miner who works in the Saar and\nvhose three sons died in the German army at Stalingrad, that he was so many\nyears a Nasi, and that this particular individual is now going to tell us\nwhat he thinks about certain things that matter to him. It will be desir¬\nable at the end of mch interviews to re-identify this person as an individ¬\nual and to remind the listener that he is in no way presented as reflecting\nthe official opinion of any country or government. We hope, then, in this\nseries to present interesting and informative interviews with a wide range\nof European people. We would hope that interviews could be obtained with\nrefugees, ex-Nazis, neo-Nazis, French Communists, French ex-Conmiunists,\nFrench radicals, German-Bavarian Catholics, and so on.\nIn some instances, interviews may possibly be organized around a\ncentral difficulty, such as the success of the Marshall Plan in Italy, or\nthe problem of the unification of Germany. Because of the time lag between\nthe creation of these interview programs in Europe and their presentation\non American radio stations, it will be necessary to center on those non-\ntopical subjects which have a continuing importance and are likely to be\npressing and interesting problera3three, six, twelve months or more after\nthe interview. It will be necessary to avoid the current events approach.\nAs a further example of what might be done within this series, the\nsuggestion is made that interviews be obtained with the \"left-over people,\"\nthat is, the refugees in Germany, Austria, and elsewhere, who are stateless.\nThe hope is that all of these programs would be finished by June 15\nor July 1 at the latest."
}