{
  "id": "d274-127",
  "text": "mm TAPE NETWORK\nNovember 20, 19$1\nMr. Edwin Berdell, President\nThe Cooper Union\n8th Street at Uth Avenue and Astor Place\nNew York, New York\nDear Mr. Burdell?\nIf you haven® t already, you will soon receive from the Secretary of the\nNAEB a resolution passed by the membership expressing their gratitude for making\navailable The Cooper Union Forums.\nI wanted to add my personal gratitude end that of the Tape Network Head¬\nquarters for these splendid forums® Many people have been astounded at th® success\nof these forums as radio programs. Long-talk programs have always bean con¬\nsidered by radio people as sure death® Continuing success and audience response\nto our broadcasts of The Cooper Union Forums disproves this belief most emphatically.\nI feel that the wide distribution of these lectures by way of educational radio\nstations is a highly significant contribution® We are eternally grateful to The\nCooper Union for maiding them available®\nWe are working out a method whereby tape copies of the talks will be re¬\nturned to Mr® Fairchild for retention on a permanent basis® Eventually we will be\nable to supply you with recordings of all the forum programs which we have on file.\nWe will continue to return a copy of all present and future programs® This seems\na fair gesture on our part since you have continued to supply tape on which to\ndistribute the programs. Vie are hopeful that having a complete file of these\nrecordings will be of some use to you®\nI h*ave enclosed a recent pamphlet about our Network operation which will\nexplain some of the details of its origin and methods® We have added about five\nstations since the pamphlet went to press, which means that programs such as The\nCooper Unibn Forums can now be heard on almost 80 stations located in all parts of\nthe country® This is really an almost unbelievable development in the light of\nradio broadcasting as we have known it previously®\nAgain let jtb say that we feel highly privileged to be able to offer The\nCooper Union Forums to such a wide audience® We hope that you, too, see the worth\nof this cooperative venture®\nAgain expressing our deepest gratitude, I am\nCordially,\nhi! Richard 1,® Rider\n* Richard L® Rider\nManager\nRLR:WG\nEnco\ncc: Johnson E. Fairchild"
}