{
  "id": "d274-17",
  "text": "PERSONAL OBSERVATION\nI support the drive to develop a single powerful voice to\nspeak for the TV licensees and to confront CPB on their\nbehalf. Public TV is under attack and it must respond as\n^effectively and as fast as it can. Whatever is necessary\nto stop the steam-roller and hold the fort must be done.\nReorganizing to maximize the fire power of lay board members\nappears to be the best bet for ETV at this critical moment.\nBut television is not all of public broadcasting! And the\nrest of the enterprise is the responsibility of NAEB,\ntogether with the continuance of various professional\nactivities of importance to the whole field.\nOrganizing to represent the TV licensees in matters affecting\nprogramming and program distribution is the thrust of the\nRogers' initiative and the point'of the Palm Beach Accord.\nAnd, while he is concerned about Radio and recognizes the\nimportance of professional services, these are not in the\nmain stream of his concern and, at best, are matters to be\ndealt with at a future time. Given all that, where does\nNAEB go?\nThis question forces us to think about our mission and what\nsort of structure is most suitable. Form follows function.\nNAEB's mission is to advance the use of communications\ntechnology for social purposes; it follows that we should\ndedicate our future task to a more important question than\nsurvival. Jim Fellows has suggested that this be the validity\nof the telecommunications concept. Institutions interested\nin public uses of modern communications technology will\nincreasingly employ a comprehensive approach - multiple channel\ndelivery systems, multiple media production and utilization\ncapacities and related services.\nMr. Fellows' memo points out that we already have evidence to\nindicate our institutional members view this as a growing trend:\nattendance at the Telecommunications EBI, requests for\nsupporting papers and reference materials, interest in expanding\nthe facilities program to make other technology eligible for\nfederal support - all these suggest that there is a growing\nrecognition that it is no longer sensible to place exclusive\nemphasis upon radio and television broadcasting."
}