{
  "id": "d274-18",
  "text": "Personal Observation\n-2\nAt the same time, there are special needs that relate to\nbroadcasting operations that must be attended. Presumably\nthese services - particularly related to national programming\nand distribution - would be taken care of in the new system\nas well as the licensee representation role now carried out\nby ETS (and NER) .\nFellows suggests that we update NAEB to become NAET, the\nNational Association for Educational Telecommunications\n(or some such). This structure would continue to have both\ninstitutional as well as individual members. Institutional\nmemberships would be reserved for licensees operating more\nthan one-channel delivery systems: radio-television\ncombinations, dual-TV operations, multiplex radio services,\nclosed-circuit and cable feed systems, etc. Associate\nmemberships would be for institutions operating one-channel\nsystems but interested in moving toward expanded service.\nIndividual and Associate memberships would continue as is.\nIndividual memberships could be doubled or tripled. There\nare 9,000 individuals in educational stations and probably\n20,000 all told who have an indirect or peripheral interest\nin the field. However, I believe that NAET should not\nbecome an organization of individuals only; a part of NAEB1s\ndistinction is that it has successfully combined management\nand labor and helped realize individual objectives through\nthe advancement of institutional goals.\nWhat services would be provided and how would they be financed?\nMany of the professional services and some of the current\nservices now provided by ETS and NER staffs would continue or\nexpand. But the emphasis would be upon specific rather than\nat-large representation that is our present major preoccupation.\nThe representation of TV licensees and their concerns about\nprogram, interconnection, etc. would no longer be our\nresponsibility. NAET would not be licensee-oriented; that\nwould be TOP'S role. _-\nSupport would come from three basic sources.\n1. Annual dues from institutional, associate and\nindividual members. -\n2. Annual fees for special services (e.g.. Office\nof Engineering Services)\n3. Unit charges (e.g., personnel service, convention\nregistration, publications, consultancies, etc.).\nCharges to members at preferential rate but non¬\nmembers could purchase services as well."
}