{
  "id": "d274-2",
  "text": "Situation Report\n-2\nMarch 5-6, 1973: Governing Board group meets in Washington\nwith a group of about 100 TV Board Members and Managers to\ndiscuss Palm Beach Accord and plans for a new TV licensee\n^organization governed by an all lay board. Group votes\napproval.\nMarch 6, 1973: Rogers Committee meets again with CPB Board,\nreports it has been successful in getting the go-ahead to\nestablish single voice for PTV. Argument over whether CPB\ncan and/or should operate interconnection is inconclusive;\ndecision postponed until April 13 Board meeting; meanwhile\na CPB Board Committee is to work with Rogers Committee.\nMarch \"7, 1973; NAEB Executive Committee meets, has Rogers\nas luncheon guest.\nThose are the major meetings relevant to this situation\nthough there have been many more of a smaller more informal\nnature. A Committee of ETS has met with Rogers to get his\nreactions to their concerns; I have met with him several\ntimes (also Friendly, Gunn) re possible NAEB relationship\nto the new entity - or what we now refer to as TOP: The\nOrganization Proposed.\nEssentially, Rogers (and Rogers jLs the Governing Board Group)\nis sympathetic to involving NAEB in the new structure and to\npreserving its functions. However, he rejects the idea of\nhaving NAEB become the umbrella under which the new TV licensee\ngroup could be established. Its structure, membership, by¬\nlaws, etc. are far too complicated and cumbersome. He favors\nrestructuring PBS, whose constitution would permit an\nimmediate resignation of present directors so that they could\nbe replaced by laymen elected from the governing boards of\nTV licensees. He is not unattracted by the PBS current\n$9 million budget, either. He has rejected various proposals\nI have made for a compromise approach in which NAEB would\nremain an independent professional organization but with a\npartially interlocking board of laymen. Partial pregnancy\nwon't work, he observes, and the only alternatives are merger\nor remain completely outside."
}