{
  "id": "d274-23",
  "text": "Appendix il\nMINUTES, NAEB, REGION II MEETING, ATLANTA\nAPRIL 1-2, 19&\nRegion II Membership of NAEB, mat in Atlanta, April 1-2, in the WABE studios. City\nHall*\nPresent were: Haskell Bpyter, Atlanta; Vernon Bronson, Miami; Paul Carpenter, Jr,,\nAtlantaJ Ken Christiansen, Southern Regional Education Board, Atlanta; Roy Flynn,\nTallahassee3 A3. Gaines, Atlanta! Margaret Kilian, Atlanta} Lillian Lee, Atlanta;\nKen Wright* Knoxville; Earl Wynn, Chapel Hill; John Young, Chapel Hill, and Frank\nSchooley, President of NAEB,\nEarl Wynn, director Region II, served as Chairman,\nThe tentative agenda for the meeting was approved. The morning session was given\nover to a discussion of {|NAEB Members Look at the National Organization and at\nThemselves,”\nThere was general agreement among the participants that a policy statement of the\nnational organization should emphasize:\n1, that educational broadcasters are first of all educators,\n2, that educational radio and television have the same authority and same\nresponsibility as the institution which they represent.\nFurther such a statement should by implied or explicit purpose encourage any in¬\nstitution which broadcasts to become NAEB members. Such a policy statement also\nshould be designed to position radio and television as broadcast media of equal\npotential and responsibility. There was a feeling among some of the members that\nthe breech between radio and television was reaching dangerous proportions. There¬\nfore, the national organization ought not to close its eyes to this problem.\nThe policy statement of NAEB should honestly interpret NAEB8 s representation of the\nlow power station. Recognition was made of the feelings expressed by the High\nPoint and Greensboro operations through Mr, Young namely, that NAEB doesn3t con¬\ncern itself with the problems of the 10 watter,\nA sub-committee, Bronson, Chairman, Gaines, Kilian, and Christiansen were appointed\nto do a redraft of the NAEB policy statement.\nThe afternoon meeting was concerned with programmings Without considering mechanics\nof distribution, consideration and discussion was made of what programs now being\nproduced are exportable and could be used by other stations in the region. The\nprogram offerings of the several stations were reviewed with this matter of exporta¬\nbility in mind.\nAlthough only station WUNC (University of North Carolina), WABE (Atlanta Board of\nEducation), WUOT (University of Tennessee), WTHS (Dade County Board of Public In¬\nstruction), and WFSU (Florida State University) were represented, it became clearly\napparent from the number of programs now being produced by these five stations\nthat there are a great many programs in Region II of considerable value not only\nto other stations in the Region, but perhaps also through the NAEB Tape Network\nto the whole national family of educational radio stations. The programs mentioned\nare too numerous and Involved to describe here. There were, however, twenty pro-\ngrams named and described which in the opinion of your director are exportable."
}