{
  "id": "d274-29",
  "text": "the audience. (There is now and has always been much information of an em¬\npirical sorb equivalent to the skills and judgments of any competent city\neditor which applies to these situations, but the academic mind has somehow\nbeen consistently blind to these sociological verities—if there are verities\nin sociology.)\nAs lata as 19U2 some educators thought it to be a self-evident fact that any\n\"good” program or any worthwhile subject matter would of necessity attract a\nsmall audience. The fact that this was often merely a rationalization for bad\nperformance escaped these would-be analysts.\nRadio broadcasting in the United States before World War* II developed 900\nstations, but educational radio had failed to enjoy a proportionate growth.\nThere were only 30 odd AM stations. While much was written and spoken about\nthe problems and the opportunities, many gatherings were held, and many in¬\nstitutions in one way or another participated, the inescapable fact was\nthat educational radio was not a vital factor in United States life, although\nalmost everywhere one could get admissions that it should be.\nIn some instances smart and ruthless commercial operators skillfully stripped\nthe radio facilities away from Institutions which did not value or could not\nhold them. Columbia University, for instance, at one time refused as a gift\nwhat is now the NBC key radio station in New York. The University of New\nMexico was gradually infiltrated and finally lost its facilities to an adroit\ncommercial operator. Iowa State College similarly approached in an early day\nplaced a value of a million dollars on the radio facility and scared off such\nintruders.\nIn the U0*s a renaissance in educational broadcasting began to take place, be¬\nginning with the work of Harold A. Engel of the University of Wisconsin who\nset a goal of- 100 institutional members for NAEB during his term as president.\nHe had been active in the move to reserve FM channels for education when FM\nwas thought to be a \"whit© hope” for United States radio 0 Hull of Iowa State\nCollege, Siegel, Communications Director of New York City, and Qraydon Ausmus\nof the University of Alabama inherited his successful work as the succeeding\npresidents and carried on the same aims. NAEB began to get an organization\nof national scope instead of a \"social club” of station managers. (Just be¬\nfore the war a national meeting of NAEB members brought 9 people from the\nentire country. Now such meetings bring 200 or more representatives and people.\nAt the Rockefeller Seminar at the University of Illinois severs! years ago the\nbasis for most of the development leading up to the present situation for the\nNAEB and educational television was established.\nCEt should be noted that the renaissance of the NAEB was a major factor in lead¬\ning Wilbur Schramm, Dean of Communications at the University of Illinois,\nMorris A. Novik, New York radio consultant, and others to consider and seek\nfinancing for such a seminar, e. g. much had happened to substantiate the idea\nof holding a seminar.)\nFrom that meeting came some remarkably basic conclusions and predictions about\nthe future of educational radio and television in answer to the basic seminar\nquestion—\"Where, if anywhere, is educational radio going?”."
}