{
  "id": "d274-36",
  "text": "la order to have any effectiveness at all must take certain steps and follow\ncertain empirical rules of broadcast communication• (It is painfully apparent\nto me that what I and many other broadcasters and telecasters regarded as\nnecessary and inevitable \"first steps\" in setting up such a structure—as\nbasic as building a foundation for a house before erecting the walls—was by\nno means generally understood—and as a matter of fact was sharply challenged.)\nLet me state these points:\njv\n1* .A radio or television broadcasting station is simply a device which\nI has the potential of conveying information of one kind or another\ni from one place to another. \\ A\n2. t[A radio or television station is not an instrument of mass communi¬\ncation unless viewers or listeners have the reception facilities to\nreceive the information; certainly unless significant numbers of\nviewers or listeners in fact do time to and receive with seme degree\nof regularity the information broadcast or telecast, there is no\naudience.\n3. Tim instrument of communication, e.g. a radio or television transmitter,\na printing press, a movie camera, is merely an instrument. It is\neffective or ineffective, moral or immoral, shoddy or exalted, in direct\nproportion to the skill, the understanding, the resources, the motives,\nand the morals of those who control and operate it. (Today many edu¬\ncators and critics stallmake the absurd error made by their predecessors\nin judging radio. They decry the product they see on certain commercial\nscreens—and then reason that television is \"bad® instead of understand¬\ning that the given program merely reflects management, resource and policy.)\nb. ftess corroiunicaticn\" is in many ways an unfortunate term. \"Mass\" means\nmany things to many people. It has semantic value significance to\n, same of the erudite which tends to make them regard any really large\ngroup of listeners or viewers as a somehow degraded group. Excellence\nand appreciation of excellence is construed to be possible only when\nthe numbers of audience are small and specialized. It is an unfortunate\nand loose generalization.\n5. The economics of mass media devices make it perfectly apparent that any\n\"mass communication\" whether it be radio, newspaper or television must\nreach groups of people whose total numbers can be measured in thousands\nof units and not scores of units. The necessary capital outlay and cost\nof operation of these devices, even in their simplest forms, make this\nmeasure of audience a requirement and a necessity; otherwise more tra¬\nditional farms of communication, e.g. books, classes, discussion groups,\netc. must be employed.\na) Educators frequently are unthinking and naive in their mental\nstereotypes of \"mass\". For instance, an audience of 50,000\nto 100,000 viewers or listeners might be tremendous in uni-\n* versity class room or convocation comparison terns. For the\naverage commercial broadcaster, on any regional basis, this\nv is a disappointingly small and almost useless total."
}