{
  "id": "d274-41",
  "text": "5* The NAEB training program, and all the rest of the seminars and work¬\nshops, are useful only to a point. Until there are trained managers\nwho can agree on some kind of a common denominator principle with\nrespect to the shape and substance of educational television, the\nwhole thing will continue to wallow in confusion.\n6. Temporary agencies are becoming permanent, and the duplication already\nnoted, is wasting money. There should be mergers of function and\nperhaps elimination of some presently existing agencies.\n7• Throughout the whole national picture there is too much jealousy,\ntoo much individual ego concern, soma intellectual snobbishness, a\nnatural tendency for various agencies to perpetuate themselves whether\nor not their services are really required, and an illusion that travel\nand motion are synonymous with accomplishment and progress.\n8. Seminars, workshops, and ’’group-thinks\" can become a vast waste of\ntime. \"Group dynamics\" is not the problem nor-can a set of working\ntechniques and approaches very well be evolved from group discussion.\nThe real problem is for those who are motivated to get into educational,\ntelevision to learn the realistic requirements and procedures for\noperating a station. A few competent people need to review all of\nj the present data, discard much of it, integrate the remainder, stipu¬\nlate some standard operating procedures and concepts which give seme\npromise of producing successful results—and then systematically\nteach and train prospective station operators in the facts of life.\n9© Obviously there is a need to group all of the various agencies and\norganisations either into a cooperative working arrangement with the\nelements of cooperation stipulated or to reduce the agencies in\nnumber and consolidate functions in whole or in part<> Such an\n\"umbrella\" organisation would doubtless be more appealing to any\nfoundations which might be approached for further support. Th®\ndifficulties in creating an \"umbrella\" organisation or even a merger\n©f two agencies are apparent. There is a natural disposition for\neach agency to consider itself \"unique\" and \"sovereign\" and relatively\nindispensable o It will take some very hard-boiled thinking and some\ngenuine sacrifice if the logical conclusion is attained after being\nrecognised."
}