{
  "id": "d274-43",
  "text": "broadcasting* The include*\n1* The specialized, intellectual, and high level cultural programs of the\nsame order and for the same audience as the Saturday Review, the Measure,\nthe Atlantic, the Reporter, and the Theatre have served or are serving*\n2. The broadcasts for in~school use—those programs which supplement, en¬\nrich and bring unique experiences to the normal elementary and secondary\ncourses of instruction*\n3. The formal and informal but systematic programs of continuing education\ndirected at the adult whose interests and capabilities are perhaps some¬\nwhat below the levels of #1 above.\nU. Programs of general appeal on basic and crucial issues of our time\nand edited by careful and discerning standards but essentially popular\nin their appeal.\nIn this age of crises careful stucfy of the fourth item is the most urgent* Its\napplication extends beyond the educational television station—at least until\na sufficient number of well-run and well-financed operations of this type cover\nthe major elements of our population. (Were the latter to be the case this\nmight be ideal.)\nWhat I am trying to say is in terms of Lazarsfeld the mass media, if effectively\nused, must utilize the factors of REPETITION and WIDE EXPOSURE. No idea stated\na single time to a small audience accomplishes its purpose* The mass media\ncreates attitudes and impressions much more effectively than they transmit\nskills and particularized knowledge. In effect, one must more often use a\npaint brush than a scalpel* The consideration is that the paint be a bonafide\nproduct and the brush strokes done with ethics and understanding as well as\nwith virtuosity.\nThe obligation of educational television is to serve all of these people and all\nof these needs, but it must first examine the basic current needs and the tech¬\nniques indicated for meeting the problem rather than taking comfortable refuge\nin \"museum type”, \"library-type”, and \"comfortable cultural” thinking.\n\"Beholdl human beings living in a sort of underground den, which has a mouth\nopen towards the light and reaching all across the den; they have been here from\ntheir childhood, and have their legs and necks chained so that they cannot move,\nand can only see before them; for the chains are arranged in such a manner as to\nprevent them from turning round their heads. At a distance above and behind them\nthe light of a fire is blazing, and between the fire and the prisoners there is a\nraised way; and you will see, if you look, a low wall built along the way, like\nthe screen which marionette players have before them, over which they show the\npuppets•\nI see, he said.\nAnd do you see, I said, men passing along the wall carrying vessels, which\nappear oyer the wall; also figures of men and animals made of wood and stone and\nvarious materials; and some of the prisoners, a3 you would expect, are talking,\nand some of them are silent?"
}