{
  "id": "d274-68",
  "text": "Mr* Frank E. Schooley\n>2.\nNovember 5, 195U\nkey paragraph or sentence which sets the NAEB apart from other organ¬\nizations of its type. If so, I would appreciate your pointing out\nthis paragraph or sentence to me* But, what I failed to find was\nsome such statement as this \"The NAEB is primarily comprised of repre¬\nsentatives, usually directors or managers, of educational stations\nlicensed to educational institutions, public school systems, non-profit\nfoundations and the like* One of the purposes of the organization is\nto encourage educational broadcasters to operate their own stations.\nIt is the belief of the NAEB that the best job of educational broad¬\ncasting requires that the educational broadcaster be the licensee in\norder that he might more adequately control the nature and number of\nprograms which he broadcasts.\"\nThe statement quoted above may go too far. It is not a\ncarefully worked out proposal. It is merely the kind of a statement\nwhich you would dictate to your secretary in lieu of something better.\nBut it does convey what I understood to be the feeling of\nHarold McCarty and I think yourself as old-time operators when I talked\nto both of you at the meeting. If something like the above statement\nrepresents the position of people like Mac and yourself then I think\nyou owe it to the body to make such a proposal.\nAnd I can tell you where I would stand on such a proposal.\nPersonally I like it. I will frankly confess this represents a reversal\nof my opinion as the result of talking to Mac and to you. When I made\nmy infamous \"haive\" speech ( in my favor let it be remembered that this\nwas the only time I did speak at the convention save when I gave my\nreport) I frankly did not see what we had to fear by giving associate\nmembers an equal vote. Now I understand that the NAEB traditionally\nhas been, and indeed ought to be, primarily an organization of indi¬\nviduals or institutions which operate their own educational broadcasting\nstations. Let the AERT or some other body function primarily in the\nservice of other persons who use the air for educational purposes.\nI could be completely wrong (naturally, I don*t believe this)\nbut it seems to me one of the reasons we did not get very far in our\ndiscussions at the convention was that we failed to air this above issue\nwhich is more basic than the one which we discussed. It seems to me\nthat if we once smoke out this basic issue there will be no smoke screen\nhiding the true nature of the less basic issues which really hinge on\nthis primary issue of the function of the NAEB. Once we have decided\nthat the NAEB is to be the kind of organization described by the para¬\ngraph I have put in quotes above, it automatically follows that:\n(1) There should be a difference in memberships, and\n(2) a difference in the power of vote."
}