{
  "id": "d274-8",
  "text": "-2-\nMr. Harley outlined the options for NAEB in a new organizational\nstructure.\n1 - NAEB could discontinue its separate incorporation and\nbecome an integral part of the new organization, with\na Division and Vice President for professional services.\nConstituency Advisory Boards could be maintained for\n__ individual members, non-broadcast systems, and indus-\n~~ trai 1/sustaining associates.\n2 - NAEB could be maintained as a related but separate\nentity.\nHe reviewed the advantages of an independent organization (even\nwithout TV and Radio licensee members) as having freedom and\ncontrol of its own affairs, serving as a \"conscience\" and\nadvocate where required. Professional functions and services\ncould continue to the extent of their financial viability. He\nalso pointed out that NAEB may well not be viable outside the\nnew organization or would operate at such a low energy level as\nto be ineffective.\nThe detail of Mr. Harley's observations is attached to these\nMinutes.\nMr. Cannon suggested preparing a list of pros and cons from\nother points of view, and indicated the need to keep in mind\nthat the immediate objectives Mr. Rogers wishes to achieve are\ndirectly related to public television licensees.\nMr. Cordier spoke about radio's concerns in the development of\na unified structure. He indicated that radio station membership\nwas diminishing and that the NER Board considered three organiza¬\ntional options within NAEB and a separate option to move outside\nthe NAEB into closer alliance with National Public Radio. It\nselected the option calling for continuation of the present staff\nand a maintenance of current service, going in the direction of\nserving the \"Full Service\" radio station. The Board also decided\nto recommend to the members a change of the NER name to either\nEducational Radio Services or Public Radio Services.\nMr. Harley indicated that Mr. Cannon's comments to him, as he\nleft the meeting shortly before noon, were to this effect: NAEB\nwould support the unified organization for public television\nlicensees but that we should seek assurance from Mr. Rogers that\nhe would support assistance to NAEB to cover the expense of\nprofessional services previously contributed by television members."
}