{
  "id": "d274-90",
  "text": "EXECUTIVE DIRECTOR'S LETTER NO. 8\nFebruary k, X95&\nTHE MIDWEST LOOKS GOOD—With more than 3,000 miles cn qy oar since I last saw\nUrbarn I pulled in hero Yfednesday morning to find the desk thoroughly covered.\nThree solid days of work haw lot me get dovm to at least a minimum oi working\nspace. Needless to s&y two weeks is plenty to spend amy from home.\nlay visit with Kendall Crane at Duquosns University convinced me \\Jiat\nhere ms one area vdiich wo thought virtually dead but it actually is really full\nof life* Crane is a drivers ho has plenty of support from his administration and\nhas finally convinced the newspapers tliat they should carry the VfDUQ program\nschedule. He is making himself heard in Pittsburgh. This is one area we can\ncount on in the future*\nLEIIIGII UNIVERSITY, BETHLEHE1I, PA*—I had uy first opportunity to visit an associate\nmember* Barrett Davis, the director, is doing a fine job witli wlmt he has. He\nhas raiiy of our problems plus many added tasks which surround a relatively small\nindependent male college. He spoke very highly of HAEB and made two very fine\nsuggestions—one, that there be an \"AhSOCIATE'L PAGE\" in each issue of the News-\nLetter and, two, that additional copies of the News-Letter should be available”\"bo\n'i’lioso1 members who wish to buy them at, say at $*T*5o a year* At last count, m\nhad hi associate members. Undoubtedly, they should be considered more in our\noperational plan.\nI will not comment on the New York meetings. You were all there and have\nyour own ideas.\nPrior to the meetings I had a chance to visit Dorothy Lewis, U* N* Radio,\nwho gave plenty of promises of cooperation. Following the meetings, I had a\nchance to do the New York work on seeing that our UNESCO exhibit got properly set up.\nFive days in Washington were put to good uso. I vas lucky and found\nLowdorailk, Broderick, and Dunham all in at tho USOE Radio Office* If you haven't\nkept up with things these people are doing, it would be worthwhile to investigate.\nAlso visited with Jolrn Miegher (pronounced Harr) of the Department of State Radio-\nTV Lais ion. He is running the ball for us on the row Voice of American radio\nseries* He is also trying to secure permission for us to utilise in some manner\nthe tremendous backlog program material available at the Voice of America Library\nin New York*\nI had the opportunity to have a very fine dinner with Ralph Stoetle and\nhis fine family and to hear more about the JCET work. Also with Frank Abbott of\nthe American Council, with further details on the forthcoming Pennsylvania meeting."
}