{
  "id": "d274-94",
  "text": "NAEB POLICY LETTER #7\nDecentoer 28, 1951\nGentlemens\nI thought you. would get some inspiration out of this exchange of corres¬\npondence between Dick Rider and various staff members of The Cooper Union® It is\nfunny what a little thing can do*\nThis will be the shortest Policy Letter on record. I have been busy on\nthe \"thinking\" side the last few weeks and now comes January* a month of action*\nThe schedule looks something like this:\nJanuary 3—an engineering group meeting in Chicago to discuss tap©\nmaking, tape duplicating, and tape playing standards. The group will meet with\nrepresentatives of ‘Minnesota Mining, Magnecorder, and possibly others. And then\nwe811 move that night to Urbana to look over the set-up here and make the specific\nrecf^mmendations mentioned above.\nI will stay in Chicago January h for a meeting with Siegel, Harley, and\nProbst, on promotion plans for the coming Ford programs.\nThe night cf the lith, all of us move to Ames, Iowa, for a meeting of the\nCommittee of Five, which will hear some tapes of Ford shows and view some Lines\nof the shews WOI is producing under the Ford grant.\nJanuary 7—finds us in St. Louis for the Mayor* s Conference on TV.\nJanuary 8—1 plan to Visit Marguerite Fleming's installation in the\nSt* Louis Public Schools*\nThen comes a week of planning, followed by the Planning Group Committee\nmeeting in Lafayette on January 17, 18, and 19*\nShortly thereafter I expect to leave for Washington for sou® visits with\npeople there and to attend the annual meeting of the American Council on Education.\nA hurried return from Washington to Urbana for a series of meetings here\naround the first of February* Plans are not complete on these as yet so will have\nto give you the details later.\nThey are progressing well here at Illinois $ reports I get from Wisconsin,\nCleveland, Columbus, Ames, Washington, and New York indicate that everybody is\nwell and busy.\nI trust the next report will have more meat in it.\nJim Miles"
}