{
  "id": "d274-95",
  "text": "POLICY LETTER, Hk\nOctober 26, 19bl\nI HAVE BEEN TRAVELLING,.. .AND I©RE TO COMB: Started the rounds of stations early\nthis week by making a three-point touch in Michigan, first to Hugh Masters of the\nKellogg Foundation in Battle Greek, Masters impressed me as being a very fine guy,\ndeeply interested in educational radio, genuinely anxious that NAEB run its own\nshow and that Kellogg help in every way possible. Masters formerly was at Ohio\nState, originally from Texas, While at OSU he either worked with or knew first¬\nhand the old radio education project of Keith Tyler’s, Inasmuch as ny brother was\none of those people, we swapped stories on people mutually known, Hugh is also a\nfarmer, actively managing 160 acres just outside Battle Creek, and so we talked\nconsiderable agriculture# Toward our particular ends, he had many ideas on organi¬\nsations, how they are set up, how they can best operate. He gave me many leads\nwhich I shall attempt to review and which undoubtedly will be of value to us as we\nstrengthen our organisation. He plans to be in Biloxi about 2h hours, from\nThursday noon until Friday noon, I am sure you mil all agree with ey e/valuation\nwhen you meet him©\nThe second visit was to Bob Coleman at WKAR and incidentally to the new Kellogg\nFoundation Hotel which is called there a Continuing Study Center, A really lush\nplace that would be ideal for some of our future meetings either short-term or\nAXlerton length, I imagine it is as busy as the Minnesota Continuing Study\nCenter, so any booking would have to be done well in advance, Nice chat with\nBob Coleman and his good wife, and I have a better picture of their operation now0\nNext to Wally Game&u’s spot at Western Michigan State Teachers College, Carneau\nlias a miniature Waldo Abbot set-up—really nice, top floor, new building, not too\nmuch equipment but what’s there is good, Wally operates on a shoestring but with\nthe complete cooperation of his administration, Wally is strong for the tape net¬\nwork-says it has been the thing that enabled him to adequately program 2$ hours a\nweek*,oIf other visits are as cordial and revealing as these two, we should have\na rather tremendous body of knowledge of what education stations of the nation are\ndoing, *%\nTHE MAIL WAS HEAVY: The desk was piled high alter a week’s absence. Among things\nnoted,,,T,E. Bennett of Schenectady tells me that they have recently lost their\nregular spot on a local AM outlet but have been offered night-time on that outlet\nbecause of TV competition. The first instance of this I have noted. He has also\ncompleted arrangements to use G,Eo»s outlet as much as he wants but now would like\nto buy 100 or 200 AM-FM radios and asks, \"Do you know a good cheap source?*,,,,©\nEdgar Will of the University of Hawaii sits in an enviable position without any\nmoney. There is no FM on the Islands but by the same token there are plenty of\nAM channels available. He asks the usual question, \"Anybody know whero I can find\nmoney to start a station ? \"., o,, Sydney Head is away from the University of Miami\nworking on his Ph,D, Oliver Griswold is the Acting Director©.,.©Ed Adams says that\ndue to some building difficulty, he is having to delay the start of bis operation\nuntil November 13,,,,oKeith Nighbert says that they are getting ready to change\nfrom three to ei^ht hours daily about the first of the year,,.,,Bob Higgy writes\nthat Bill Ewing’s daughter is out of the iron lung but still in the hospital. How\nabout a note to Bill?©Herb Hake gave me the low-down on Iowa State Teachers\nCollege cooperation with W0I and WSUI, It looks like a real deal,... ©Will Wichers\nof Netherlands Information sends along another of his \"Feminine Vignettes\" which\ncontains three nice human-interest stories. It is issued weekly. Are you getting\na copy?...o©Bill Hailey sends along his voluminous report on the Jeffersonian"
}