{
  "id": "d1007-123",
  "text": "the service* More programs were being distributed to more stations in less\ntime*\nWithin a few months the number of stations increased to 70* The\nannual NAEB convention was held in Biloxi, Mississippi, in November, 1951* At\nthis meeting the NAEB Board of Directors took up the problem of levying a fee\non stations using the network* It was deemed wise to put to the test the will¬\ningness of stations to support the network operation* A schedule of assessment\nfees was devised and the matter was put to the membership for a vote* (See Ap¬\npendix nCw*) The membership approved the plan. Thus, prior to the need for\nincome from the stations to augment the annually decreasing funds from the\nKellogg grant, the member stations agreed to pay a substantial annual assessment\nfee* The results of this action have been highly encouraging* 8 stations felt\nthey could not afford to Continue the service on a paying basis. This left a\ntotal of 62 stations* Since then some have returned to the network, and a few\nnew stations have joined. The present total of paying stations is 65* Three\nadditional stations have asked for the service indicating that with the next\nassessment period, beginning July 1, 19S2, there will be 68 paying participants\nin the network*\nBy January of 19^2 the network achieved its present operational level*\nThe average monthly tape production increased to l,06l reels* There were now\n12 '’legs”* Average monthly air time increased to 1,231 hours* This indicates\nthe scope of the operation at the tii® of this report.\nPROGRAMS AND THEIR UTILIZATION\nThe tape network has offered 73 regular series of programs plus 12\nextra series or individual programs, totalling 90b individual programs. This\nrepresents 12,797 hours and 30 minutes of air time* #\nThe programs have been obtained from a wide variety of sources includ¬\ning: member stations; the British Broadcasting Corporation; the Cooper Union;\nthe Canadian Broadcasting Corporation; the University of Berne, Switzerland;\nthe Federal Security Agency; the Mutual Security Agency; the Armed Forces of\nthe United States; the United Nations; UNESCO; commercial stations and networks;\nprivate foundations; and other public service agencies* The programs have been\nconcerned with many important subject areas and were presented in numerous formats*\nThe percent of stations using regular program series has {run from a\nlow of 20$ to a high of 100$ with an average percentage of use of 66$« This is\nan encouragingly high percentage in view of the fact that use is entirely optional\non the part of the station. No effort is made to increase the usage of programs\nexcept to select programs of continually higher quality* This use of the network\nservice has also been achieved with a distribution system that cannot guarantee\na regular delivery of tapes on a sufficiently safe basis to insure complete\nregularity of scheduling* This bodes well for the networks future.\n* (See Appendix\"’”BrfTy"
}