{
  "id": "d1007-124",
  "text": "TOWARD A SOLUTION OF SOME PROBLEMS\nTwo important steps were taken during the past year to help solve\nsome of the network's most pressing problems.\nIn January there met in Urbana a group of engineers and invited\nelectronics specialists. This group was concerned with the technical problems\nof tape recording and the mass reproduction of tapes. Tape recording is such a\nnew process that the extant technical standards are incomplete. Thus it became\nobvious that technical standards would have to be devised by our own members*\nA preliminary report was submitted. The standards are now being revised and\nwill soon be published as a technical guide for the entire network operation.\nIn February there met in Lafayette* Indiana, the Tape Network Program\nAcceptance Committee and the In-School Programs Committee* These committees were\nconfronted with the problem of establishing policies and evaluative criteria for\nprogramming the network. A greatly increased mutuality of thinking on the subject\nof programs resulted. A report of these findings was published for the informa¬\ntion of all member stations. The In-School Programs Committee took further action\nin inplementing an actigfe distribution of programs designed for classroom use in\nelementary and secondary schools* This distribution is now a successful reality*\nTHE OPERATION\nAt this writing the network is still required to operate on a \"bicycle\"\nbasis* The equipment, tapes, and personnel made possible by the Kellogg grant\nhave permitted expanding this operation to a maximum degree. However, optimum\nservice is not possible under a \"leg-bicycle\" system. There are too many possi¬\nbilities of shipping errors, delays in the mail, and actual losses of tapes*\nExperience indicates that the most effective operation is a direct two-way\nservice wherein each station is supplied directly from headquarters with its\nown copies of all programs. This is possible only with a machine capable of\nduplicating tapes in mass volume. Such a machine is now contracted for and will\nbe installed no later than July 1, 1952. Starting with the programs to be issued\nin September, 1952, each station will receive its own copy of all programs, and\nthe network will achieve the operating efficiency toward which it has been\nstriving.\nThe network has acquired approximately $,200 reels of recording tape*\nThis quantity has made possible the continually expanding service. Tape supply\nhas been one of the major chronic problems. This situation has not changed.\nWith the advent of direct headquarters-station service the need for tapes will\nbe increased. The only alternative to an increased tape supply is a reduction\nin the volume of programming distributed. At this time it is anticipated that\napproximately 10,000 reels of tape will be needed to keep the network operating\nat peak efficiency*\nCONCLUSIONS\nThe NAEB Tape Network has achieved a position of eminence in the field\nof educational broadcasting. It is now enjoying a national, and even an inter¬\nnational, reputation. It is supplying a significant program service to the vast"
}