{
  "id": "d1007-134",
  "text": "-3-\nOne of the most critical situations to develop during the last year, and\nbriefly alluded to above, was the strong possibility that a splinter organization\nfor educational television only would be formed. This possibility has now been\navoided, but the cost in money and efforts has been high. In recent meetings of the\nNAEB President and Executive Director with the Joint Committee on Educational\nTelevision (JCET), the National Citizens Committee for Educational Television (NCCET),\nthe Educational Television and Radio Center (ETRC), and the American Council on\nEducation (ACE) Television Committee, during the past few weeks and months, we have\nbeen gratified to find our unique position firmly established and the NAEB recognized\nas the permanent and central association in educational wireless communications. For\nit would be a great tragedy if modestly financed and under-staffed stations were\nexpected to support a multiplicty of organizations, all alleging to be their indis¬\npensable protectors and sponsors. All but one of the educational stations on the\nair in the United States are NAEB members and an increasing proportion of NAEB TV\nofficers are television directors or television station managers.\nIt is now increasingly apparent that the NAEB is here to stay, with no need for\nit to affiliate or compromise with other groups in any way which will significantly\nimpair its independence and freedom of action. It is now recognized as a leader\ninstead of a follower, and the NAEB Board meetings scheduled during the next year,\nwith America’s leading School Superintendents, College and University Presidents,\nand other leaders, will insure that its course will increasingly be educationally\nresponsible and carefully considered.\nThrough the aid granted by the W. K. Kellogg Foundation, educational broadcast¬\ning has strengthened its position in the United States. Adequate ’’delivery\nfacilities” for educational materials have been assured and greatly improved. This\nstrengthening and improvement have come mainly from the broader scope of activity\nand wider sphere of influence which the grant made it possible for the NAEB to exert.\nSince the beginning of the W. K. Kellogg Foundation grant, the NAEB Network so\ntentatively launched in 1950 has become world-renowned. Present plans for at least\none commercial network, NBC, call for careful consideration of converting to a tape\nnetwork for radio instead of an inter-connected one. This would put the NAEB at\nleast three years ahead of commercial radio. Steady programs of workshops, seminars\nand scholarships have helped several hundreds of present and future educational\nradio and TV staff members to secure more adequate training and inspiration. NAEB\nscholarship certificates now hold a place of honor comparable to those of\nGuggenheim, Rockefeller and other such groups on the walls of the offices of many\nfine educators. The first real headquarters for educational broadcasting in the\nworld is conducting itself with dignity and honor, making American educational\nbroadcasters the best informed broadcasters in the world. In a tribute of imitation,\na ’’University of the Air”, (of which the NAEB is probably the most honored member),\nhas been created in Europe, whereby programs are exchanged by all the 21-nation\nmembers.\nOne reason for the greatly increased productivity of NAEB committees is that,\nwith Kellogg Foundation assistance.they have been able to meet and carry on their\nbusiness on a face-to-face basis. The same is true of regional meetings to develop\neducational radio and television locally. The first NAEB regional meeting in the\nhistory of educational broadcasting was held in Norman, Oklahoma, March 28-30, 1952.\nSince then such meetings have also been held in North Carolina, Michigan, and Oregon,\nwith plans for two additional ones during the next year."
}