{
  "id": "d1007-141",
  "text": "-4-\nb. Federal agencies such as the FCC (Federal Communications\nCommission), the U. S. Information Agency, the Departments of Agri¬\nculture, Commerce, Health and Welfare, the Dep.artment of'State*\nforeign embassies and information offices, and the various others\nwith which the NAEB's operations and functions bring us into\nincreasing contact,\n2. Such an office would permit\na. supplying members with regular government, industry and other\nreports normally originating in the East.\nb» servicing network members with recorded Washington and other\nEast Coast reports, and a bi-weekly one or two-page news flier,\nsupplementing the present Newsletter.\nB. Annual funds requested (for a two-year grant)\nAssociate Director $10,000.00\nSecretary 3,600.00\nRadio Program and Recording Expenses 4,500.00\nTravel 1,500.00\nService Materials 2,400.00\nOther Expenses (rent, adminstration, etc.) 6.000.00\nEstimated total (per year, for two-year\ninitial grant) $26,000.00\nIII. A Proposed Two-Year Project of Basic Prestige Programs for Broadcast in\nAmerica and Abroad\nA. General Statement* NAEB member stations have consumed several hundred\nhours of British, French, Italian and other foreign programs during the past\nthree years. In exchange the International University of the Air has\noffered to distribute equivalent NAEB features to its twenty-three member-\nnation networks and stations. So far, except for necessarily limited use\nof some of the NAEB's earlier series (Jeffersonian Heritage, etc.) the NAEB\nhas been unable to keep up its end of this exchange. Each of the series\nproposed below would find a ready market abroad, as well as give the NAEB\nNetwork and NAEB TV members increasingly significant offerings. None of\nthese projects is likely to be realized except as the NAEB may be able to\nundertake them.\nB. Projects Proposed\n1. The Meaning of Americanism (better title to be selected)\nThis is essentially a further development with modifications, of the\nPrestige Radio Series Proposal (And Man Shall Grow: Education in the\nU.S.A) submitted last year. Quoting, in part, from last year's pro¬\nposal:\n\"Series: Thirteen (13) one-half hour programs.\n\"Purpose: To show the role of education in the development and growth\nof the U.S.A. to government, to society, and to the individual.\n\"Contents: Resources of education, based upon research. To include"
}