{
  "id": "d1007-144",
  "text": "-7-\nprofessional presentation talent, on a cooperative basis, by using\nmember stations and the general grant-in-aid approach, it is felt that\nan adequate series could be prepared for the NAEB Network (and distri¬\nbution abroad of certain selected programs) for the sum listed here.\nWriting and Production (grants), Radio Series\nFilm or Kinescope for Television\nAdministration (5%)\n$20,000.00\n5,000.00\n1.250.00\nTotal Requested\n$26,250.00\n4. It is felt that possibilities of a new order for the giving of\ncredit courses have been opened up by television, as compared to radio.\nIt is also felt that most experiments or efforts in this area are as\nyet relatively uncoordinated, and that the NAEB, whose member stations\nare the ones now experimenting in the area, could, if funds were made\navailable, most profitably provide a carefully planned experimental\nproject in this area, using selected schools and universities, with\ndistribution to NAEB members, followed by evaluative measurements and\nreports which, it is believed, would be of great value to education in\nthe U.S.\nCost of Project (estimated) $20,000.00\nAdministration {%) 1.000.00\nTotal Requested $21,000.00\nIV. As television needs become more apparent to NAEB members, various kinescope\nor film projects are needed to help eliminate waste and fumbling, which\ncould be disastrous to educational television. The following request is\ntherefore herewith presented, in the belief that educational television in\nAmerica will be greatly benefited thereby:\nA. Funds for a series of four kinescopes to be used for training local re¬\npresentatives of national organizations in the best use of television as a\nmedium for presenting informational and educational programs.\nSince the NAEB is vitally interested in the entire area of educations!\ntelevision, it would appear that this is one way in which a significant con¬\ntribution can be made to raising the general level of programs of an infor¬\nmational and educational nature. The various national organizations have\nvery worthwhile material to bring to the attention of the American people,\nbut, unfortunately, the general professional competence of programs presented\nby local chapters of national organizations is generally not such as to at¬\ntract a large audience.\nNot only is the NAEB interested in seeing good educational programs\nappear on commercial television stations, as well as our own educational\nstations, but the commercial operators would be more likely to welcome or¬\nganizational programs that are produced with a little more \"know-how.\"\nA similar series of four kinescopes has been produced by the NPAC for\nthe training of farm and home economic extension workers in the proper use\nof television in their extension work. However, the NPAC kinescopes are too\nspecifically designed for agricultural extension workers to be of value for"
}