{
  "id": "d1007-146",
  "text": "-9-\nB. As has been pointed up particularly during and following various\nin-school personnel meetings and conferences, including the recently com¬\npleted Kellogg-financed In-School Writers* Seminar, the need for training\nfilms or kinescopes specifically for teachers and producers of in-school\ntelevision programs is also most urgent. The full outline of the proposed\nseries, also of four kinescopes, will be drawn up in full by the NAEB In-\nSchool Committee if it appears that funds can be made available. The pro¬\ncedure and cost breakdowns would be the same as for the above project pro¬\nposal.\nTotal Requested $ 9,450.00\nV. Other Services\nA. Consultation Service Budget:\nDuring the past few years it has become apparent that the NAEB member¬\nship itself contains resource strengths not previously realized and not\nfully tapped. Questionnaire replies are now being returned In the NAEB\nResearch Committee's Inventory of Human (and potential consultant) Resources.\nThe problem will still prevail, however (until the slow progress of\nNAEB members up the ladder to adequate local financial support is consider¬\nably further along), of funds to get the people with the proper skills to\nthe proper places, when, as frequently occurs, neither the consultant nor\nthe requesting station has adequate travel funds. In order to provide for\nthe adequate distribution of the potential management, program, utilization\nand promotionalskills to member stations, the following budget is requested\nto cover principally travel, but occasionally also consultant fees (when only\noutside consultants would solve the problem involved). It is felt that this\nproject will be extremely important in helping get stations into a position\nto develop more adequate local support.\nAnnual Budget $10,000.00\nAdministrative Costs {%)  5Q0.QQ\nTotal Requested $10,500.00\nB. Radio Program Service for Schools\nOne of the long-term hopes of the NAEB has been for an eventual archive\nand library service for the American Schools. Quoting from last year's re¬\nquest, with a slight modification of the proposed fee basis:\n\"This would be the initial effort to make available to school sys¬\ntems program series that had been accepted and used by the NAEB Network.\nThis would be tried on a small scale, to determine needs and potential¬\nities for future expansion. Simply stated, this service would be in¬\naugurated with previous and present NAEB Network series made available\nby tape recording. Master copies of programs would be kept on file.\nTapes would be sold to stations at $5.50 per 30-minutes of programming,\nlimiting each tape to two programs, or programs would be copies upon\ntapes furnished by schools at $2.00 per program, or rented on a nominal\nbasis, if the rental demand arises.\n\"The cost factors arising are: (l) small storage cabinet, (2) tape\nsupply, (3) cataloging of available programs, (4) securing \"rights\""
}