{
  "id": "d1007-153",
  "text": "4\n®Con tents* Resources of education, based upm research. To Includo educators\nand the educated, the child and the adult, the storie* of MM&9~~mem&mu\nand failures, usd omelet of contributions to a developing Beeocraey.\n\"Teehaicuess Basically, woven doew€mt*ucy «**d oarrattm*\n«Au horltUei To he planned and produced by competent professional personnel,\nunder direction and sufmrviiiAcm of professional producer, aided by profess onal\neducator or educator* as ecsisul tents. Example f possible consultants*\nProfessor Jwma Bartlett Bdno&son, Bean Emeritus, College of r^dueation,\nUniversity of Michigan* Professor Ralph tyierf Batvarsity of Chieago* Professor\nEdgar Bale, Ohio State university.\n*Uaasi (1) By KAEB Ihpe network stations, flrat choioej (2) OWMrcUl\nradio stations, on iwm-o«»»rei&X basis* (3) adult education groups* (4) ln-\neehool usef (5) liferarlesj and (6) the general public*11\nIt la now felt la further elaborating specific plana, that the series might\nheat bo Imploaeatod as follows*\na* That throe MAlMEellecg awards bo offered for the beat, second\nbeat, and third beat series i» the field of Americanism,\npresenting smssplas of tlm African way of life at work sad i«\nevolution in all walks of life in America. ' The first award\nwould -pay 115,000.00 (few? the completed series with both\neovmerolal and educational right*) § the aeccmd |10,00p.00| the\nthird $5, 00.00. 'Twenty thousand dollar* (120,000.0)} would\nbe sot aside for promotion®! expenses, Produear-Coasultant* *\nand judges* fees, travel, and ether expenses.\nFar tide mm it is expected that three half-hour thirteen (or\nperhaps 13} week series would be made available to American\nfind foreign radio, through this joint effort end grant*\nIllustrating various possible chapters and approaches which\nmight be used, are the following suggested heading*, masse of\nwhich might become entire series*\n\"What Makes A Good School?*\n*!he Contribution of the Washing Man (end labor) to\nAmerican Vmmisr&tff*\n*fho Contribution of the Farmer (Agriculture) to American\nBfamfrorasy*\n*Industrialisation i its Meaning to a dynamic Bmaoeraey\"\n\"The Social Structure of Modem American society* (with\nDr* Reisman and other University of Chicago sociologists\nwho are now studying this problem parUeultirly) •"
}