{
  "id": "d1007-158",
  "text": "HI m-ECXAL mtKt Although presented last, one of the m*t pressing problems in\nthe eoammi<»*tiona area nw i« the confusion resulting fro® the groat mlU-\nPUtltar Of iwhUcatlono* The JCE? publications* the j^l^.gwa.\nth# ^*c publications, audio-visual mages! nef, the\n^3J»eiflflat1ay. ate* etc. fas efforts of various organisations to preempt\nthis area S3 \"coordinate for all\" are toeotalag very confusing and Intense, as\nevidenced by this excerpt from a letter of June 1, just received!\n\"fee of the topics ho wmUmmd in which he ms interested related to\nAudio-Visual OmmiQmm wmm. Um stated that there mm mmm in-\ntercet in a professional journal which would service the redio-tele-\nvision field hut that mms objected to using €i B^BlCiTlCh R£VI' 1 as\nan outlet because it had. the sub-title *Audlo-Visual.1\nin BAVI have no particular interest in aalntalniag the •Audio-\nVisual* in the title* We dabbed at soma length a bout whether or not to\nadd it in the beginning but decided to do it, so that m mmId somewhat\nnarrow our approach to the field of mmrnmnlemUmmp feeling that it ms\nmt wise to spread ourselves too thin* Xf you will look over the back\nissues, I am car tain that you will find that we have taken a ratiter\nbroad approach to the field of mmmmimtlmm and would like to do an\neven better job la this respect.\"\nfhis is only one of nearly a score of such efforts which ve experience regie*\nlarty.\nAlthough the MIS is probably not the logical organ* action to undertake the\npublication of such a journal, it is obviously a better nlaeed group than some\nwhich afiX take over, (or are likely to end up taking over) this function,\nla case the W. I* Kellogg Foundation, la its 'broad co?^unications interests,\n$Um*t or would care, to create or sponsor meh a wagaslne. the IMS Would be\ngrateful to contribute, (if funds are available) a (or the) radio and. tele¬\nvision editor for such a publication. With the UHC and its other ccwunica-\nU&m interests, we believe that a Kellogf-cpcmsored effort could do met to\nbrtnf clarity and definition out of the increasing chaos. The UAKB can be\ncounted on to lend Its «v«ory effort to any such step which the Kellogg founda¬\ntion racy be prevailed upon, to undertake, or to discuss this problem further\nif it is felt desirable. At present, any person desirous of keeping Informs*\nin the area must read nearly a score of scattered publications,\nor run the risk of missing essential parts of the rapidly expanding framwoi*\nof c^mniiciatiom. Mway now borrow and <&uota ftm each other in rrther in¬\ncestuous and uneconomical fashion, but no one is yet in a position to coordln-\na ate, integrate, and edit (in the best sense) these scattered efforts*"
}