{
  "id": "d1007-179",
  "text": "DRAFT\nDRAFT\nDRAFT\nTHE HAEB PROFESSIONAL ADVANCEMENT COMMITTEE\nMinutes of meeting of January 28, 1956\nUrbane, IlXinois\nPresent at meeting: Earl Wynn, chairman, Leo Martin, Sydney Head, John Winnie, Garnet\nGarrison, Ro Edwin Browne, Paul Rickard and Gale Adkins. Also present in an ex officio\ncapacity were Harry Skomia, Cecil Bidlack, Frank Schooley (for a portion of the morning\nsession), and Harold Hill.\nUssmsg^esgioa\nChairman Wynn read the purposes of the Professional Advancement Committee as\ndecided upon in an earlier meeting, and possible specific areas of concern which the\ncommittee might consider at this meeting. He indicated that the committee should\nclarify the specific areas. (Functions and specific areas of concern are listed in\nAppendix A)\nWynn then called on President Schooley for an expression of what he hoped this\nmeeting would accomplish.\nSchooley said that it would be well to review and reconsider the functions of the\ncommittee, but that too much time shouldn8t be spent on generalities since the important\nthing was to come up with specific recommendations. He suggested that closed circuit\nTV should be added as an area of specific concern since this is one of the most\nimportant aspects of educational TV and will become more important in coming months.\nThe NAEB should be working toward common goals and shouldn81 always seek to do ^every¬\nthing*'5 If another organisation is performing a function well, the HAEB probably\nshouldn8t get involved in that function. Schooley suggested that the recommendations\ngrowing out of this meeting should be as specific as possible, with an indication\nof priority for the various projects suggested. The recommendations should be con¬\ncerned with those areas in which there is the greatest possibility of success plus the\nability of the NAEB to perform. The committee should review the professional advance¬\nment activities of the Association and make specific recommendations as to the future"
}