{
  "id": "d1007-189",
  "text": "11-11-11\nReport of Workshops Sub-Committee (Winnie)\nRecommends that general production workshops no longer be held. First priority\nto be given to a TV Writing Workshop of 5 to 7 days duration. Should be headed by\nsomeone from an educational institution, but needn’t be held at an institution. Need\nto have outstanding men from the commercial field. Suggested the workshop might be\nheld at Michigan or Wisconsin.\nEqual priority to be given to a combination Kinescope - Lighting Workshop of\n5 to 7 days, to be held at an educational institution with adequate facilities for\nboth lighting and kine (including processing). The two groups would meet separately\nthe first few days of the workshop and come together for the last couple of days for\njoint work. There are 18-20 educational TV set-ups with kine equipment. Iowa\nsuggested as location. Needs to be coordinated with Engineering committee.\nGeneral discussion - Garrison felt that the writing workshop should be held in\nNew York probably where as many as 30 or 40 of the top people in the networks can be\nbrought in as consultants. Consensus was that both workshops should be held this\nsummer. Should be not for beginners but for people actually doing this work in ETV.\nQuestion was raised about radio and whether or not this could be included with TV in\nthe writing workshop. Agreed that on a long-range basis there should be one for\nradio as well as one for TV.\nLong-range plans for workshops - At this point it was decided that the committee\nshould consider the long-range plan for workshops first and then decide on what\nspecifically might be done this summer. Garrison pointed out that there were many\nspecific areas, not just writing, in which workshops were needed, such as use of films,\ngraphics and staging, and he urged a workshop in one or more of these areas.\nWynn - What we want is a series of workshops that will make the picture on the\nscreen more effective, whether it be writing, graphics, lighting, kine or what. However,\nwe probably can’t go beyond a couple of years, because we511 want to review the results\nof the first two years before committing ourselves on a long-range plan."
}