{
  "id": "d1007-19",
  "text": "Footnotes\n1/ Comments of Schramm, to whom I referred in view of his having been one to handle\nfirst grant, being on Kellogg Board, etc<>: ”A good starting point for discus¬\nsion* But you® 11 never get this sum from Kellogg. Rather, it will have to\ncome from a pooling of foundations, or, year to year, from FAE.”\nTo the Boards\nThis has been a tough one to draft. It was done, held for a couple of months,\nredone, and held again. From Schramm, Seay and VanBuyn we have gotten the word\nthat Kellogg will be glad to consider a renewal request, but probably for less\nthan 5 years (perhaps 3) and for less than the 3um presently involved. Messers.\nVanDuyn and Seay also hope and believe that, like the Network, Headquarters\nshould now aim at self-support. This, however, is difficult to visualise.\nWe°ve tried multiplying MSB dues, for example by digits like 5 or more, pre¬\ndicting great increases in publication and album incomes, charging consulta¬\ntion services, combining HASH general with Headquarters budgets, etc. These\nall still fall far short of needs.\nWe therefore feel that we should get a specific and definite reaction from\nKellogg on a 5-year proposal and a sum we can get by on before we can know\nspecifically what, in terms of years and dollars, we must reduce it to in\norder to get support from them.\nWe are hopeful for continuance of present projects from the FAE (you011 note\nthat they are not included; we have renewals on all staff and supporting ser¬\nvices through June 30, 1956), and perhaps might even get support of Headquarters\nand/or a Washington office from them (taking over some of the functions of some\nof the present Washington groups to which FAE grants are diminishing). Par¬\nenthetically Kellogg most definitely will not support or have ary part in a\nWashington office because 1) of fear of political and/or foundation investi¬\ngation dangers and 2) as Van Duyn in essence put it; ”if you can°t yourselves\nsupport one Headquarters office, why build more,”?\nWe need to submit something like this before changing it, or going to FAE or\nsomeone else for it. This is also tieTuJHay the meetings and understandings\namong ACE, ETRC, JGET, NAEB and NCCET, creating a moratorium on new approaches\nto Foundations until some as yet undetermined period. This can best be re¬\nported on by Schooley, Ausmns and Skornia in person.\nPresident Schooley and I also discussed the possible combining of the NAEB\ngeneral budget, handled by the NAEB Treasurer (membership dues, (FAE, ETRC and\nother) grants, administration fees for handling these grants, income and ex¬\npenditures for albums. Legal Counsel, Dues for Prix Italia and other organi¬\nsations.) Newsletter subscriptions, etc. and Headquarters (as outlined here).\nWe agreed tiiat ,' pending decisions on support of HQ, an independent, separate\nbudget identified as ”NAEB general” should be preserved. It would, for in¬\nstance, be unfair to Kellogg to have HQ staff do too completely or without re¬\nimbursement to the Kellogg budget, administrative work for FAE and other grants.\nThese are some of the items which should serve as a basis of discussion of this\nproposed draft.\nIncidentally the ^-year-request total at first came to $270,000.00. It can\nnot be cut ™ifth more than we°ve already cut it, without pretty sharply curtail¬\ning some of our services. We already have difficulty getting staff and have\nto be very careful of travel and other Expensive” items."
}