{
  "id": "d1007-191",
  "text": "13-13-13\nFor requests for new funds, in order of priority, the sub-committee recommended\nthe following: A \"Third Allerton\" seminar to re-examine the role of educational broad¬\ncasting, progress in the last few years, etc.; would have about 25 participants with\ntop-flight consultants, such as Hilton Eisenhower, Arthur Compton, Partridge, the\nSolomons, etc. A seminar in teaching by mass media and the interrelationship among\nthe media in education; should involve about 50 participants and be in the area of\nadult education. A seminar on utilisation and evaluation.\nThe aub-camraittoe also recommended that the Research committee be urged to consider\nresearch seminar and/or research grants to institutions. Consequently, on motion\nby Winnie, seconded by Martin, the committee passed a resolution urging that in ap¬\nproaches to Foundations for funds several of the Research Committee recoiaaendations,\nincluding their grant-in-aid research proposal, be included.\nGeneral discussion of the sub-committee recommendations. Martin pointed out that\nwe should also consider broader problems such as training teachers in the utilization\nof radio and TV. This might well fall within the province of this committee. It was\nagreed that this would make a good seminar.\nOn motion by Rickard, seconded by Winnie, the Committee recommended that the\napproximately $6,000 of seminar funds in the Kellogg budget be used for a radio\nengineering workshop, before July 1, 1956, with the details to be worked out by the\nEngineering committee.\nAs the first item during the evening session, Hill who acted as secretary for\nthe meeting, at the request of Wynn, reviewed what had happened during the morning\nand afternoon sessions.\nWynn - Headquarters is to send out the minutes of this meeting, in draft form, as\nsoon as possible. As soon as committee members receive them, they should study the\nminutes and return immediately to Wynn with any additions or corrections noted.\nSkornia - After Wynn forwards formal recommendations to Schooley, he will probably\ncontact the Board for their reaction, after which informal contact with the Ford"
}