{
  "id": "d1007-193",
  "text": "15-15-15\nLiaison with other organisations - Skoraia reported on NAEB relations with other\norganizations — his position in AEA Delegate Assembly, membership on Field Develop¬\nment Committee of AEA, membership on Broadcasting committee of CNO. Hill has been\nmeeting with CNO editors, worked with NPAC and served as co-manager of their TV\nWorkshop, met several times with CNO, and Film Council of America. Demands on staff\ntime for liaison and consultant work with other groups has shown their interest and\nconcern. Referred to ways in which NAEB might cooperate with APBE. Garrison - Could\nNAEB provide speakers for other groups? Could others than Headquarters staff be sent?\nWynn - This is important to professional advancement. On this committee we have rep¬\nresentatives of several important organisations. Consensus was in favor of providing\nsuch speakers. Martin and Head agreed for their groups. Skoraia discussed further\nhow we work with other groups, especially commercial broadcasters.\nOn recommendation by Browne, the Committee unanimously commended Executive\nDirector and Associate Director for their efforts in cooperating with other organiza¬\ntions.\nCoordination of committee activities - (How can the activities of the . rofessional\nAdvancement committee be better coordinated with other closely related NAEB committees,\nsuch as Reserach, Liaison, Engineering, Grants-in-Aid, etc.?) Skoraia pointed out that\nwe don8t have a really effective Organizational Liaison committee. Might be set up\nbetter to get more and better results. Members of that consulttee don8t go back to\ntheir own organizations with the right impression of our activities and desires.\nConsensus was that the organizational liaison concept wasn't a workable idea.\nStudies by committee - There was a report on studies by the committee in: course\nofferings, philosophy of college presidents toward ETV, radio production centers, TV\nproduction centers, etc. Wynn - Would like to have studies now in progress completed\nand passed on to him as soon as possible so they can be passed on to Headquarters."
}