{
  "id": "d1007-220",
  "text": "Mr* Frank Schooley\nPresident, NAEB\nlk Gregory Hall\nUrbana, Illinois\nDear Frank:\nThis refers to your communication of March 23 requesting a Committee report for\nthe forthcoming Board meeting* For this purpose I would like to submit the report of\nthe NAEB Engineering Committee meeting of January 7# 195^. A copy is enclosed* I have\nalready sent you extra copies for the Board, in case they are desired, but if you\nwish to have more, please let me know. As there are changes in the covering letter of\nJanuary 26, I am sending you copies of this letter to replace it. Your attention is\ncalled to the following paragraphs of the report which involve specific recommendations *\nParagraph # 1 - It is recommended that a full explanation of the tape tests, as\noutlined, be carried as an item in the Newsletter and that a separate letter explaining\nand outlining these tests be sent each Individual station submitting programs for\nduplication. It is further recommended that a full-time maintenance engineer be employed\nat Headquarters; one who Is capable of adjusting the duplicating equipment and keeping it\nin top operating condition. This person would not spend all his time on maintenance but\ncould also operate the machines during regular duplication operations.\nParagraph # 2 - It is recommended that no additional funds be spent for 15 i«p*8.\ntape duplicating equipment until maximum quality output is obtained from present\nequipment.\nParagraph # 3 - It is recommended that $6000.00 be allocated to a conference or\nseminar for technical personnel from NAEB members who operate the smaller AM or FM\nstations. Such stations usually employ engineers who lack experience and knowledge,\nand due to budget limitations, have very little opportunity to acquire It. It Is\nfurther recommended that a sum of $8000.00 be allocated for a technical conference to\nbe held in the fall, to consider problems of a high level nature such ae kinescope\noperation. This may be combined with a conference for production personnel*\nParagraph # 7 - It Is recommended that an engineer familiar with the work of the\nEngineering Committee be appointed to serve as a member of the Professional Advancement\nCommittee.\nParagraph # 12 - It is recommended that a sum of $50j.00 be made available for an\nNAEB Engineering Committee meeting in the fall or winter.\nI would also like to especially call your attention to the resolution regarding the\nNAEB Engineer.\nI believe a careful examination of the report will explain the reasons for the\nabove recommendations . However, If you wish to have more information, please let me know.\nSincerely\nCarl H. Menzer\ncc: Dr. Skornia Chairman, NAEB Eng. Committee\nMr. Bidlack\nNAEB Engineering Committee"
}