{
  "id": "d1007-225",
  "text": "5.\n9* Engineering Committee reports and publications. News Letter:\nEngineering reports and publications have proven to be a valuable NAEB service*\nIt was decided to continue this project and to enlarge it if possible* In editing such\npublications care must be taken to present only those papers which are of benefit to\nNAEB members and which contain information not available elsewhere - or at least\nnot generally available from other sources. Although Mr* Bidlack has spent a great deal of\nwork on the Newsletter, he has had little help from members* By stimulating interest\nin NAEB it is hoped that he will receive more contributions* If members can be made\nto increase their contributions it should also work in the opposite direction — that of\nstimulating interest in NAEB. The letter mentioned in (8) above may help*\nJO, Regional technical meetings: It was thought that regional technical meetings would\nhelp stimulate interest in NAEB as well as bring the technical staffs of various\ninstitutions together for a discussion of their mutual problems* Last year such a pilot\nmeeting was proposed which would include Iowa and Illinois witi perhaps Minnesota\nand Wisconsin* For various reasons this meeting was never held. The committee\nbelieves this to be a sound idea and will continue to promote it* Perhaps during the\ncoming year a pilot meeting, as indicated above, may be held* It will require the\ncooperation of station managers as well as engineers*\n11 Discussion of FCC actions: Mr. Braum mentioned several FCC actions which\nshould be of interest to NAEB, These are listed below:\nA* Efforts are being made to increase the number of commercial VHF television channels\nat the expense of educational FM allocations* Efforts are being made to reallocate\ntelevision channels reserved for education, to commercial interests* While this committee\ncannot take direct action on these matters, Headquarters is urged to keep posted through\nits attorneys and to file comments with the FCC* It is conceivable that the committee might\nan advisory capacity but certainly Mr* Braum is in a position to contribute much*\n/“X® is some interest in the installation of very low powered, low cost, transmitters\nat institutions now operating closed circuit television studios, R was suggested that if\nthe demari were great enough, the FCC might consider some sort of special permit or\nlicense for their operation. Incidentally, the installation of a low powered, lew cost\ntelevision transmitter, of which several are on the market, is an excellent way to hold\na reserved channel that otherwise might be in jeopardy.,\n£• Wtthfr tost year changes have been made in FCC operators licensing requirements.\nMr. Bidlack has mentioned some changes in the Newsletter* However, Mr Braum has\nagreed to check and if there are others, he will so notify Mr* Bidlack who will pass\nalong the information.\nP* FCC engineering division is in need of reliable information regarding field\nintensity measurements for their propogation studies. This is difficult to obtain from\ncommercial stations due to the element of competition between various sales departments*\nIt is thought that considerable information might be available from educational television\nstations where there is no such competition. Anything this committee can do to help the\nFCC should reflect in benefits to NAEB. With this in mind Mr* Ketcham has agreed to\nsurvey the situation and collect what data may be available* Any such material supplied the\nFCC will be given as an NAEB project."
}