{
  "id": "d1007-233",
  "text": "Radio Program KLaaniLng—\nLuring the discussion that followed the compilation cf this Hat , the then©\nof man in modern society became stronger and the emphasis bocam© clearly focused\non this idea. From this thinking car® the final decision ifcat several series\nsoild be don s on 'the problems of an industrialized nation. The committee finally\ndecided upon three series which would be distinctly different but world be inter*\nrelated because of the ooimum basis of the problems explored in each ,, Wo realise\nthat several dozen other sales could have similar relationships, aid it is hoped\nthat further series will fee produced if the idsa is worth espaaiing. The three\nseries- recommended c:ire:\n1. Industrializ ution in the U. S*—its impact* meaning* effect\nMental Health—importance as a problei, what modern society rontribites\nto breakdowns progress?* understanding, etc.\n3. Geriatrics—a series already well outlined by Skoraia; outline is avail¬\nable from him\nIn the section on recoinsndatlcris. more details are spelled out. All of us\nfully realize that these throe series, while excellent possibilities, are perhaps\niio more exciting in potential than dozens of other proposals. But this group\nlias decided that these area's offer the bout opportunity for large seals exploits,-\nlu.cn •\nCCMMITTEE RE COWBffiKDATICWS\nThis committee is aware- of the possibility that the following recofflrasnda*\ntiens, arrived at through a r©ly lofltg day of deldOberaIba on tin© which All of\nus could have used at ham© rrd on money which nbs HAEB could use elsewhere, nay\nh® turned oat. These are pacific proposals?, aid represent the best thirking ”\nr/e could apply in sink a wo (.fully short period, of tin©. We would like to have\nthe ie«»Jisaenclatione accepted, of course, but cam understand that they may mt\n>4S entirely acceptable. Bui* if for any reason they are ignored or changed by\nsomeone else after this report is in, we will :mgist on knoisiag who changed or\ndiscarded than and why. I & ualybelieve that Skonia, Eitzen, ?ogl, aid Wrigit\nrealize that programming a rebwork and choosing a series for laggs seal© ucro-\nfiction are jobs of great difficulty for a committee of people to do in am dsy.\nI3ut we im*o asked' *te do so; ‘m expect cur fr-ndjngs t> be taken seriously.\n(Whew! thatfs 4sa\"Yuloi-ido type tirade.) Anyway, here are the recommenda¬\ntions ?\nThe coBEiitte© proposes that the Beard of the NAEB or tie proper officials\nsubmit thn following ideas in tbs following order of preference far consider &-\nHon by tii® Education aL Television aid Radi© Center for a large budget series:\n(1) What Indintrlaiizatloa, Meaos to America, or this idea under any\n'title. We need to approcia-'m \"TuKCylhemerits and hi© disturbances cf the high¬\nly Indus t:dalized economy of our time® What has happened to the borne, to\ntravel, to schools, to youth, to old people, to art, to gowososent because cf\nvjx&istiiaUzaticn? We suggest 10 to 13 programs of flexible length and format\nto be detexrained, of course, by the producers.\nHarxy and Sonar© 'Overstreet are suggested as possible writer® forth©\nseries. Ho proposal is made for producing agency, specialists for research,\npublishing sad television aspects, motion picture possibilities, etc. This\nmrk is far boo important to discuss in a one clay meeting. Once the area is\ndicseHj: -then a select group should miet for such detailed recommendations*"
}