{
  "id": "d1007-257",
  "text": "Society, before which he presented a paper on Mass Duplication of Radio Broadcast\nTapes in October of 1955, using NAEB experiences with our Kellogg financed\nduplicators for his presentation.\nSuch participation does undoubtedly indicate considerable personal development\non the part of the individuals concerned# However, we like to believe that it is\neven more the growing interest in and awareness of the role which the broadcast\nmedia can play in the educational activities and needs of the nation that is\ncausing distinguished educators and their associations to find our participation\nuseful.\nA part of this interest is reflected in the extent to which our contributions\nare beginning to appear in print, in proceedings of the ACE and its various\nConferences; in Journalism Quarterly, the ACPRA Quarterly and other such publi¬\ncations, as well as in such foreign publications as the German Rundfunk und\nFernsehen, the Journal of Radio Italy, the European Broadcasting Union Bulletin\n(Geneva), the World Radio Handbook (Denmark) and others.\nAdditional recognition has come in the election this year of the NAEB’s\nInternational Relations Committee Chairman as President of the twenty-nation Prix\nItalia international program awards organization, the annual invitation for the\nNAEB to provide jurors for the distinguished international awards of this group,\nand approval of the NAEB as a member of the International University of the Air\nand the European Broadcasting Union. The Executive Director was unable to\naccept an invitation to attend a UNESCO conference in Paris on international\nprogram exchanges, but we were fortunate enough to be represented by our Fulbright\nscholar to Paris, who was more easily available. He is now a member of a UNESCO\nCoordinating Committee on program exchanges, the other nations represented being\nBritain, France, the Soviet Union, and Hungary.\nAs the year ended, the NAEB had been invited to become a member of the U. S.\nNational Commission for UNESCO* at various conferences of which the NAEB has been\nrepresented by its Executive Director and Board members.\nMention was made in last year*s report of the use of Kellogg grant funds\nallocated for Research for the establishment of an international TV Research Fact\nSheet Service, providing current digests and analysis of direct instructional uses\nof television; where available, radio digests are also included.\nAlthough receipts do not fully cover costs, we have this year placed this\nservice on a subscription or charge basis, as we are increasingly trying to do\nwith most of our materials. (As reported elsewhere, success in this attempt is\nconsiderably hampered by the fact that materials from the JCET, the Center and\nother groups are generally distributed free of charge)# As a result of this\nstep, distribution has been considerably reduced; but we feel that this material\nis still reaching the key individuals who need such data."
}