{
  "id": "d1007-259",
  "text": "-6-\npersonnel. Approximately fifteen WAEB member institutions have served as hosts\nto students from abroad who are studying educational broadcasting and school-of-\nthe-air techniques. Approximately the same number have student or staff members\nabroad, many of whom have furnished, or are furnishing, materials to the NAEB\nNetwork, The NAEB is often called upon as advisor in the planning and imple¬\nmenting of study tours for educational broadcasters on requests from the numerous\nindependent and governmental agencies administering such exchanges; the work\ninvolved is shared between the International Relations Committee and the Head¬\nquarters staff. The selection role of the President, Executive Director and\nother NAEB members in their Advisory Committee relationship to the Fulbright\nproject has already been mentioned, to suggest the growing responsibility and\nactivity of the NAEB in this important area.\nOne of the finest recognitions to come to the NAEB from abroad was the\nwinning, for the U. S,, of the Prix Italic First Award for original radio musical\ncomposition. The winning entry was Henry Brant’s Oratorio for Radio, entitled\n\"December.” This composition has now been presented by the radio systems of most\nof the Western World, bringing new prestige to the U. S. generally. It is signifi¬\ncant that this entry was from educational radio and the NAEB.\n(Although not solely in the area of international relations programs, it is\nalso encouraging to report that of the awards given entries in the Annual\nExhibition held at the Institute for Education by Radio and Television, NAEB\nmember stations won 11 of the 37 first awards in TV, and 21 of the 59 first awards\nin radio. Both were in competition with the national networks and commercial\nstations of the U. S. and Canada.)\nMember Services:\nOne problem which has arisen during the past few years is that of attempting\nto achieve more self-support for the NAEB Headquarters operation. As has been\ndiscovered in the operation of the network, increasing charges have so far always\nresulted in some additional drop-outs, illustrating a fairly defined balance\ncalling for great caution. As mentioned above, this situation is related to the\nwillingness and readiness of groups with adequate fluids to provide many services\nfree of charge, to move into the area of providing services for which we attempt\nto charge. This situation has been further complicated by the fact that, as the\nsole Association providing certain resources and being the channel for others, it\nhas not been thought desirable or in the best interests of education generally to\nrefuse materials, services and advice to non-members, although we attempt to\nrecover as large a proportion of costs as possible from both members and non¬\nmembers. It is our belief that the very gradual approach we are using will, in\nthe long run, best serve the education movement without retarding too completely\nthe development of a service and materials charge base for the financing of the\nAssociation."
}