{
  "id": "d1007-261",
  "text": "-8-\nThe visible output of NAEB Committees is very great, to say nothing of the\nthousands of man-hours consumed in association planning, in planning and screening\nprograms, applicants for seminars, workshops, scholarships, and other association\nactivities.\nA brief highlighting of committee activities of the past year appears in the\nappendices to this report, with publications listed under the Pnhlififlfrlona heading\nthere•\nRegional Meetings:\nUsing funds regularly budgeted from the W, K. Kellogg Foundation grant to\nassist in the financial arrangements, four out of the six Regions of the NAE3\nheld regional conferences during the past year.\nThese conferences, called and presided over by the appropriate Regional\nDirectors, are unanimously considered to be among the most useful activities of\nthe NAEB. They provide an opportunity for discussion in depth of common problems,\nand an opportunity for members to get acquainted with the NASD national and\nregional officers and staff personnel, in a manner no longer possible at our\nAnnual Convention, and not possible by mail.\nThe conferences of Regions land IV were attended by the Executive Director,\nthose of Regions V and VI by the NAEB President. In view of the necessity to hold\ntwo of these conferences relatively late in the year, not all expense vouchers\nhave been received and processed in time for the present year’s fiscal report.\nThese will be carried over and will appear in the next report submitted.\nOn the basis of enthusiastic letters still being received, and new appli¬\ncations for membership resulting from these meetings, it is apparent that this\naspect of NAEB member service will need to be maintained. Our U. K. Kellogg\nFoundation grant provides for two such Regional meetings next year, in Regions\nII and III, completing this second round of Regional Meetings held.\nThe NAEB Radio Network:\nMuch of the work of the Network remains routine from year to year. Yet each\nyear also brings new developments, important changes having marked effects on the\noperation of the Network, its relations with its member stations and its contri¬\nbution to noncommercial educational broadcasting. It is our purpose here to\nreport both the routine aind the new activities of the Network during the past\nyear.\nThe membership of the Network has been holding steady for the last two years.\nCurrently we have 74 stations with the possibility of others joining in the near\nfuture. It goes without saying that we hope for more members with the goal of\nsomeday having all noncommercial educational radio stations as members of the NAEB\nRadio Network. At the present time we are working out some promotional material\nto interest non-members."
}