{
  "id": "d1007-262",
  "text": "■9-\nAt the present time the Network staff consists of six (6) full-time persons:\nManager, Assistant Manager for Production, Assistant Manager for Traffic, Engineer,\nand two (2) Duplicator Operators, Our Assistant Manager for Production will be\nleaving shortly, and his present duties will then be divided between the Engineer\nand one of the Duplicator Operators, Also, this fall will see the return of a\npart-time student worker who will assist the Production Department,\nThe addition of an Engineer to our staff, within our salary scale, is of major\nimportance. Our equipment had not been performing in a satisfactory manner, and it\nwas felt that an engineer on constant duty would anticipate many of the dif¬\nficulties and remedy them. This arrangement has worked out very well, and the\nquality of our tapes has risen as a result. It must be emphasized that everything\npossible is being done to maintain technical quality in our tapes. On the advice\nof the NAEB Engineering Committee and other qualified parties, we reversed our\ndubbing procedure and eliminated much of the distortion once present. Future\nchanges of this nature are under consideration.\nOf great significance in bringing about the ultimate solution of the Networks\ntechnical difficulties and at the same time promoting a better understanding of\nthe Network*s problems by station personnel was the Radio and Audio Engineering\nSeminar held from May 27 to June 1, 1956 at Monticello, Illinois, with funds from\nour current Kellogg grant. It was long felt that a meeting of engineers from\nmember stations was necessary, as it would provide an effective means whereby\nthose engineers could discuss their problems and exchange information with\nrepresentatives of NAEB Headquarters and the Network.\nFrom these discussions came concrete suggestions for improving the technical\nquality of Network programs. No doubt some of the suggestions will be incorporated\nby the Network in its operations, resulting in better quality. The Seminar also\ndid much to improve relations between the stations, the Association, and the\nNetwork.\nIn place of the irregular offering times used in past years, it has been\ndecided that the Network year will be divided into four quarters of thirteen (13)\nweeks each beginning with the first complete week of each calendar year, and that a\nseparate offering will be made for each quarter. Also,to increase accuracy\nand efficiency, a number of clerical procedures have been changed, including the\nintroduction of a visible card file system.\nThe quality of our programming remains high. In addition to the fine pro¬\ngrams we receive from member stations, from their regular productions and\nthrough grants-in-aid our programs from foreign sources have increased in quality\nand quantity, through the continued efforts of the NAEB International Relations\nCommittee, Presently, such foreign sources as the Canadian Broadcasting Cor¬\nporation, French Broadcasting System, Radio Italiana, Swedish Broadcasting System,\nRadio Austria and the Japanese Broadcasting System are represented in Network\nofferings. Looking into the future the fall of this year will bring our first"
}