{
  "id": "d1007-282",
  "text": "14 Gregory Hall\nUrbana, Illinois\nAIR MAIL August 24, 195&\nRobert VanBuyn USAOK/ICA\nAPO 928, c/o PM\nBan Francisco, California\nDear Rob:\nGosh, It was mighty good to hear from you. I know you must be busy,\nand I can Imagine that the work you are doing in interesting.\nNow as to NAEB, I'm afraid the boys Just picked on me. But if it is\ntheir wish that I bo their president, 1*11 do my best.\nFrankly — .-.aid I apologize for speaking kinda personally, but I know\nof no better way to do it — I think NAEB really is in pretty good\nshape. So far as I can ascertain there is no disunity, no disharmony,\nno general complaining, I could document. I was sure this could be\nbrought about, ,mc I set about to do it. Two examples. You surely\nwould have enjoyed the 1955 convention. We got more strictly business\nitems through in less time tnan ever, and no Ill feelings. Actually,\nhad actives voted NOT to give Associates a vote, there would have been\nno ill will. Associates got their vote. Example 2: Region VI once\nwanted region broken down. We agreed that we would consider changing\nVI or any other regions. We amended the bylaws to give Board this\nauthority. We put it up to regional membership. Region V said change\nif you want to, but m see no particular advantage. Region VI, where\nproposal started and in meeting assembled voted unanimously not to have\nRegion VI changed. Now everyone Is happy, but they'v© hod chance to vote\nOur relations with the foundations have been excellent. As you probably\nknow, Kellogg gave us a grant for another three years, and we appreciate\nit. We've had a substantial grqnt this year from Ford to do work in\ncertain areas.\nOn the national picture, we've been working hard to get more people\nto channel more efforts into the major problems, rather than so many\nsplinter activities. They a re not all solved, but progress 1ms been\nmade. Actually not announced, but for all practical purposes, the\nAssociation for Education by Radio-Television has Joined NAEB. NAEB\nwill provide individual memberships, oome Atlanta convention. And,\nwe're going td raise dues in certain areas, seek sustaining memberships,\ntoo.\nThe status of NAEB is recognized in more places today than ever before.\nWe've mad© deliberate efforts in this direction. Skornia, Hill and I\nmake as many appearances as we can on behalf of NAEB. This means the\npresident sometimes lives n dog's life, but as long as I'm president"
}