{
  "id": "d1007-40",
  "text": "22? Gregory Hall\nJune 15, 1955\nMr. Robert Gentry:\nMBetter Educational Broadcasting,” a 12x18 printed\nproposal was \"addressed to the W. K. Kellogg Foundation by\nthe University of Illinois, acting in behalf of the Educational\nBroadcasters of the United States through their working\nassociation, the National Association of Educational Broadcasters.”\nAppended are extracts from the proposal which might be helpful\nto have in your files. Bee Appendix.\nMy own recollections of the establishment of the Broad¬\ncasting (MASS) Revolving fund are that the fund was established\nafter a conference, or conferences, between Mr. Farber and\nMr. James 8. Miles, then Executive Director of HAEB, and as\nsuch director of the Kellogg project. The Revolving Fund was\nestablished for the purposes of handling miscellaneous funds\nand for providing machinery by which the University would\ncollect payments (assessments) from HAEB stations using the\nNAEB Radio (Tape) Network services* Part of the proposal,\nand agreement, was that NAEB should pick up progressively\ncosts of operating the network. The Revolving fund made it\npossible to carry out the agreements between the University,\nNAEB, and the doner.\nWhile It would be possible for HAEB to collect Its own\nfunds from members for network service, I feel that, during\nterm of the grant, It might be questionable whether this would\nbe in good faith. Since the proposal indicated that HAEB\nmembers would progressively pick up the costs, I think it\nfollows that there was and is an obligation to be sure that\nagreements are kept by all parties. The only way the University\ncan be sure Is to collect the funds. Because they are part\nof the total trust picture, I also believe that if and when\nthe Kellogg project should be determinated, the funds collected\nwould logically belong to the Association.\nFor the term of the project, therefore, I would suggest\ncontinuation of handling of funds as in the past, with\npossible exception of classifying them as trust funds rather\nthan revolving or s rvice funds.\nFrank E. Schooley\nDirector\nUniversity Broadcasting"
}