{
  "id": "d1007-59",
  "text": "UNIVERSITY OF ILLINOIS\nJune 15, 1955\nAUDIT REPORT—NAEB Broadcast\nRevolving and Kellogg Foundation\nTape Network, June 30, 1951 to\nJanuary 31, 1955\nThe operations of the NAEB Broadcast Revolving and Kellogg\nFoundation-Tape Network accounts for the period July 1, 1951 to\nJanuary 31, 1955, have been audited and the report is attached for\nyour information and use.\nIn Comment 2 it is suggested that the funds in the Re¬\nvolving account belong to the National Association of Educational\nBroadcasters and that the operation should be reclassified in the\nUniversity accounts. It is my understanding that both you and Mr.\nDeLong agree that any unexpended balance remaining in the account\nshould be returned to the Association, should the headquarters for\nthe project be transferred from this campus at some future time.\nIn view of this interpretation of the ownership of the funds and\nequipment purchased, the operation is being reclassified in our\naccounts at July 1, 1955, and included in the current restricted\ntrust fund group of accounts.\nComment 3 discusses a number of equipment items which\nare improperly classified. Therefore, I am asking the Purchasing\nDivision to take the initiative in correcting all inventory\nrecords.\nComment 4 states that overhead charges to the Kellogg\nFoundation-Tape Network account have been computed as 5 per cent\nof receipts, rather than being based on total expenditures. Since\nthe agreement with the Kellogg Foundation provides for basing\noverhead on total expenditures, the Accounting Division should\nmake an adjustment to correct for the excessive overhead charges.\nIt appears that the transactions of the Kellogg Foundation\nTape Network account and the Revolving account are very similar and\nthat the accounts are used for the same purposes. Therefore, it\nwould appear to be entirely appropriate for a 5 per cent overhead\ncharge to be made against the Revolving fund. I wou^d be glad to\nhave your recommendation relative to this suggestion.\nHOF:ML\ncc: Director Skornia\nMr. Dahlenburg\nMr. DeLong\nMr. Edwards\nMr. Smith"
}