{
  "id": "d1432-1",
  "text": "-2-\nTUESDAY I EATINGS OPENED WITH A BUSINESS SESSION in which the following actions\nwere taken: .\nElections\nA nominating committee, consisting of Engle (chairman). University of Hi ionsin\n(WHA); Coleman, Michigan State College (WEAR), and Steetle, Louisiana St be\nUniversity (VJlLSU), presented, the following roster of officers and direct jrs:\nPresident - Richard B. Hull, Iowa State College (WQl)\nVice President - John Dunn, University of Oklahoma (MAD)\nSecretary-Treasurer - W. I.. Griffith, Iowa State College (WOl)\nDirector Region I\nDirector Region II\nDirector Region III\nDirector. Region IV\nDirector Region V\nDirector Region VI\nMotion by Abbot, University of Michigan, seconded by Menzer, University of\nIowa (USUI) and McCarty, University of Wisconsin (WHA). Carried unanimously.\nAuthorizations\n1. President and directors authorized to investigate and propose a new dues\n• schedule which would enable the organization to double its income during\nthe, next fiscal year,\n2, Authorized president'to appointDallas Smythe, former FCC director of\nstudies, now fellow at Illinois U. Institute for Communications Research to\n' conduct a r'udy ‘as basis for a plan to establish either an FM or a trans¬\ncription 'network using a combination of present educational AM and FM\nstations on a national basis. Study planned for completion and presents-,\ntion to members January 1, 1948 (or as soon thereafter as possible) as basis\nfor plan to finance early costs of such an operation.\n-3, Authorized the appointment of Marcus Cohn of Cohn & Marks, ' ashington\nattorneys, as attorney for the National Association of Educational\nBroadcasters without cost or obligation to theAssociation. (It was under¬\nstood: the Association would pay out of pocket expenses incurred by Mr. Cohn\nsuch as telephone, telegraph., etc,)\n4, Authorized enlargement of expenditures for the Association newsletter\n5. Authorized the Board of Directors to propose and state the policy of.the\nAssociation' regarding television. This action was.to take into consider¬\nation the . provable' ponding reallocation of television facilities by bhe\nFCC and if subh reallocation of television channels is to be made and\nadditional television channels to become available in other bands of the\nsoectrum, that sufficient' channel be set aside for possible educational\nuse. •The authorization also required the Board of Directors to.make clear\nto the FCC that educational institutions by virtue of their administrative\norganization and direct responsibility to a tax-paying public must of\nnecessity move slowly in such matters,-and that failure to act with speed\nis not necessarily indication of lack of Interest or inability to proceed.\n- Seymour Siegel, Municipal Broadcasting System of\nNew York City (WNYC)\n- Graydon Ausmus, University of Alabama (WUOA)\n- Harry Skornia, Indiana University (WFIU)\n- Irving R. Merrill, University South Dakota (KUSD)\n- Ralph. Steetle, Louisiana State University (ULSU)\n- James Morris, Oregon State College (K0*AC)"
}