{
  "id": "d1432-3",
  "text": "Discussion of separating, function of Secretary-Treasurer into two positions was\nconcluded with a vote it be loft to the discretion of the Board of Directors.\nMotion by Abbot, University of 1 ichigan (WUOM), Second by Coleman, Michigan\nState College (WKAR). Motion carried.\nDiscussion of Constitution and possible changes resolves itself into recommenda¬\ntions it be held over for action by Board of Directors just taking office*\nOther Businesd\nVice-president John Dunn (Universitj^ of Oklahoma) (UNAD) discussed a mere extensive\nregional plan for the Association, calling attention totheirabsenco at the current\nmeeting, and the need for more such mem bers in broadening the base of Association\nactivity and making its operation more practical on local and regional levels.\nDunn called for a. more intensive plan for regular regional meeting with regular\nsessions planned for February or March. H. H. Leake, Oklahoma A & 1 (KOAG)\nstressed the necessity for careful programming and thorough planning for such\nmeeting. McCarty, University of Wisconsin, asked that more detailed plans be\n,developed for such meetings, requested careful statement of who and what potential\nmembers would be. Further discussion was carried on by Schooley, University of\nIllinois (MILL); Menzor, University of Iowa (WSUl), and Steetle, Louisiana State\nUniversity (ILL.SU).\nAbbot, University of Michigan (WUOM)-stressed need for aid, advice and.consulta¬\ntion to small colleges, and said NAME must show ability to assist these schools.\nWright, University of Illinois(WILL) asked how regional I MSB organization could\nhelp members broadcasting over commercial stations. President regretted\npresent inability to provide complete operations brochure to institutions re¬\nquesting advice, suggested such an item be developed.\nExecutive Secretary\nNovik, NAEB exec ;live secretary, reported on his office and duties, stressing\nneed of concerted action and cooperation and practical approach in fulfilling\nNAEB objectives. He reported briefly on FM situation in the East, his appearance\nbefore FCC in layflower hearings, and offered services of his office in securing\nspecial educational transcriptions available from various foreign and domestic\nagencies in New York, Novik presented Treasurer^ report in absence of W. I.\nGriffith (Iowa.State College, WOl). Novik underscored recommendation.for\nregional meetings, suggested sufficient college administrators participate as\nwell as broadcasters. Wright, University of Illinois (WILL) moved report\nacceptance, and Coleman, Michigan State College (WKAR) seconded. Motion carried.\nPresidents Report\nHull, Iowa State College (WOl), road FCC Commissioner , Walker*s letter regretting\ninability to attend meeting, recommending rapid development of FI channels.\nStated belief NAEB strength lays in institutional membership, either associate\nor active and suggested subscription list for newsletter to accommodate indivi¬\nduals. Suggested Committee on Religious Policy for Association. Reported growth\nof NAEB to°95 members. Reported NAEB’s participation in Clear Channel hearings\nbefore the FCC, Johnson Bill hearings before the Senate, various member partici¬\npation in Mayflower and other FCC-hearings. Reported NAEB activity with respect\nto FCC STA ruling. Reported various consultations and advices to educational\ninstitutions who have begun or plan to begin institutional broadcasting with^\nstations of their own. Reported possibility of international.organization of\nNAEB. Exhibited map showing distribution of NAEB member stations and associate"
}