{
  "id": "d514-102",
  "text": "Mr. William G. Harley\nJuly 24, 1962\n- 3 -\nthe NAEB create meritorious programs. Professionalism is excellent\nfor internal relations, it may even lead to better relations with\ndeans and college presidents, but if you are talking about public\nrelations, professionalism won't sell. Programs will. This is the\nsecret ingredient of the successful PE campaign.\nMay I offer an example which I think illuminates certain\nfallacies and illustrates what we ought to be doing if we are\nreally interested in PR? At K. U. we have an excellent theater\ntradition. What has given the theater a good reputation in our\narea — promotion of the idea that the head of the department and\nhis personnel are qualified men? No. The secret is plays, beauti¬\nfully done. The personnel of our theater department have achieved\nprofessional stature on the basis of their product, plays. What has\ngiven WHA the reputation as the greatest educational radio station\nin America? Is it the personality of Harold McCarty? That doesn't\nhurt the image. Is it the glamour of Bill Harley? This is no\nhindrance. But neither of these mighty contributory factors is\nthe real secret of the stature of WHA nationally. In my opinion\nwhat has given WHA its enviable reputation is its product —\nprograms.* So WHA can put out a bulletin which looks lousy and\nstill have good PR because WHA’s program image is clear and beauti¬\nful.\nThe same applies to the NAEB. Let the NAEB produce better\nprograms (the proverbial mouse-trap) and the world will beet a\npath to our door. This is PR. It is also professionalism on the\nmove upward.\nI note another emphasis which I approve in the committee’s\nrecommendations but which though valuable is really a kind of\nsubstitute for the real thing. Note that the committee suggests\npublicity material on\"the nature and services of the NAEB\" for\nuse in various ways. This is good and ought to be done. We\nhave a story to tell and it is interesting. We have a proud\nrecord. But horn-tooting cannot take the place of the evaluation\nmade by the consumer not on the basis of our pointing out our\nvirtue but on the basis of the consumer discovering it for him¬\nself. When the consumer sees the NAEB in action and -identifies\nwhat he sees as being NAEB in origin then we have accomplished a\nsolid Job of PR. Anything else, no matter how meritorious, is a\nsubstitute for this more solid sell.\nLet's go back to station-activation, as another example of\nPR in action of the solid kind. The NAEB does a solid job in\nWashington and $32 million dollars is obtained. All of us within\nthe family learn that only the NAEB was in the President’s office\nfor the signing. Harley or somebody gets one of the pens. But did"
}