{
  "id": "d514-103",
  "text": "Mr. William G. Harley\n4\nJuly 24, 1962\nanybody from NAEB send a photo of this signing itfrfr -t‘iflt1nn\"\nwho issue prograH guided ' Was a movie of the signing distributed\nto the NAEB ETV stations? Has anybody suggested putting one of\nthese pens in a suitable permanent display along with a photo of\nthe signing and the story of the NAEB*s involvement and giving\nthe whole bit a place of prominence at the convention, or else¬\nwhere? Probably nobody has. And there is a good reason. With\ncertain exceptions, the NAEB personnel are modest guys. Another\nreason why we may never be successful in the horn-tooting variety\nof PR. Which brings me back to what I started to say at the\nbeginning of this paragraph. The Washington bit is sensational,\nterrifically important to the national movement, but it happened\nin Washington, it didn’t happen on the local scene. The pro¬\nverbial little ol1 lady in Dubuque knows nothing about it and\ncouldn’t care less if she did know about it. But get a task\nforce under NAEB sponsorship, with banners flying, out to Dubuque\nand get a station activated there and this little ol* lady will\nknow about the NAEB and will bless the NAEB every time she sees\nher grand-daughter watching the \"Friendly Giant\". Or even just\nput out a terrific movie, along with other helps as part of a\ngreat PR station-activation-plan kit, and supply this to Joe\nBlow, of the radio-TV department of the University of Dubuque,\nget him fired up, see that he shows the film to all the service\nclubs, the PTA, the legislature, etc., so that a station gets\non the air there, and the little ol* lady and all the members\nof her sewing circle will still applaud the NAEB. That is solid\nPR. It improves status. And status-improvement is emphasis on\nthe professional growth of NAEB.\nOne other thought on PR. Today, PR is conceived not pri¬\nmarily as publicity-seeking or publicity-writing, although this\nis part of the total. The modern public relations counselor has\nhis office next door to the president. He is in on the policy¬\nmaking. He knows that policy-making affects PR and if PR can\naffect policy-making then the organization will have the kind of\nPR that it wants.\nThis is just another way ol looking at what 1 have said\nearlier in this same section. Make news and PR takes care of\nitself, almost. Somebody needs to be there beside the president\nhanding out the NAEB buttons.\nPUBLICATIONS\nNo comment."
}