{
  "id": "d514-131",
  "text": "September 13, 1962\nMrs. Betty Mc&ensie\nPublications Editor\nhaeb\n119 Gregory Ball\nUrbane, Illinois\nDear Betty*\nI hope by now you have received the go-ahead from Harold to have\nthe folders printed for our PR KIT and SPEAKERS* PORTFOLIO.\nIn the hope that I would hear trm three individuals who promised\nspeeches many months ago, I have held tip the materials} however, after\nconsiderable prodding I have not received the speeches from Lee Dreyfus,\nJohn Barson, and floyde Brooker, ao ass forwarding the speeches I do\nhave. 1 want to allow you and your people time to accomplish the mimeo¬\ngraphing and assembling of the PORTFOLIO*—an exhaustive and time-con¬\nsuming Job.\nI did write another note to Floyde Brooker, who promised to supply\nMs remarks by August 1, (carbon enclosed) and if he forwards the material\nsoon, X»U send it on to you immediately. It will be fairly brief since\nit was just an analogy comparing ST?*s growth with the growth of the\nautomotive industry. I thought it was quite clever and should be in the\nmaterials for possible use by one of our NABB speakers.\nAlong with the speeches, I m enclosing a rather lengthy one Bill\nHarley used in I960. I selected it rather than Scornia’a farewell address\nbecause it gives an excellent survey of the growth of the ETV movement and\nthe facts can be referred to by anyone preparing an address mi this subject.\nI have made a copy of Scornia*s address and will also enclose it in case\nyou would like to include it too.\nAs you well know, I would like to have included a broader range of\nsubjects, but we certainly tried, didn't we? I think the speeches we have\nwill be an excellent beginning, and the quotations will be most helpful\nto speech writers. This will give the recipients s departure point and a\nconvenient place to accumulate materials for speeches they prepare in the\nfuture. We should also provide an up-to-date fact sheet giving the latest\ninformation about the HAEB. Perhaps the new publication you prepared this\nstiver could supply that material} if not, a brief mimeographed sheet would\nbe fine."
}