{
  "id": "d514-150",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPUBLIC RELATIONS COMMITTEE REPORT\nfor\nNAEB Convention t October 22-25, ^9^2\nBen Franklin Hotel, Philadelphia, Pennsylvania\nRecently, I heard Public Relations described as, ’’Putting your best foot\nforward and hoping the other one looks just as goodt” During the past year, the\nNAEB Public Relations Committee has put its best collective foot forward with\nseveral positive results.\nIn many respects, this past year has been a very frustrating one. To be\nresponsible for the over-all public relations of an organization as large as the\nNAEB is a full-time job—and to make progress, with committee members spread all\nover the United States—all of whom have demanding positions—is indeed a challenge.\nIn reporting the committee*s accomplishments this year, we are keenly aware of the\nmuch larger job of public relations which should be devised and implemented when\nthe organizations budget permits.\nAs a departure point, the committee studied the recommendations of the NAEB\nSeminar held at the University of Wisconsin last year, as well as the Airlie House\nSeminar which convened in Warrenton, Virginia, in June. The committee has im¬\nplemented many of the suggestions made at these seminars and plans to persue all\nrecommendations which are feasible.\nTwo projects which were inaugurated by last year*s Public Relations Committee\nwere executed this year: A SPEAKERS* PORTFOLIO and PUBLIC RELATIONS KIT. The\nSPEAKERS* PORTFOLIO contains manuscripts of lectures on a variety of subjects per¬\ntaining to educational broadcasting and will allow users to speak on a number of\nsubjects with a minimum of effort.\nThe PUBLIC RELATIONS KIT includes a complete guide for promoting a station*s\noperation, with samples and suggestions for the use of the station*s promotion\nmanager.\nBoth the PR KIT and SPEAKERS* PORTFOLIO will be offered as a member service\nupon request. The covers have been printed and the materials are ready to be\nreproduced in~quantity. These two items should prove to be a valuable member\nservice.\nSTATEMENT OF PURPOSE\nA statement of purpose for the Public Relations Committee was prepared, in\naccordance with the recommendations of the Airlie House Seminar.\nIn addition, a paragraph describing the nature of the NAEB was written with\nthe hope that it might be included at the end of every news release transmitted by\nNAEB Stations, along with the statement that the station is an active member of the\nNAEB, The statement will be available in the PR KIT."
}