{
  "id": "d514-7",
  "text": "copy\nSent for the information of\nHoward Hill\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 CONNECTICUT AVENUE, N. W.\nWASHINGTON 6. D. C.\nFebruary 16, 1962\nMr. Richard B.Hull\nDirector\nRadio & TV Broadcasting\nTelecommunications Center\nThe Ohio State University\n2470 N. Starr Road\nColumbus 21, Ohio\nDear Dick:\nThis is in response to your letter of February 12 in which you indicate\nyour reactions to the material sent you in re your acquisition of an individual\nmembership. Your points are all well taken and actually, as you will see,\nsteps have already been taken to improve the situation.\n1. The black and yellow brochure was developed three years ago\nlargely as an overseas promotion piece, but such investment\nwas made in it that we have used it as a general promotion\npiece as well, pasting in inserts on the back pages with infor¬\nmation on the dues, structure, etc. Ten thousand of these were\nprinted and we still have several thousand of them on hand,\nwhich still have some utility but are not what we really need\nfor a good promotion piece. We have already asked the Public\nRelations Committee to recommend a newer, more attractive and\nmore meaningful brochure which might be produced for general\npromotional purposes as well as institutional memberships.\n2. The green flyer promoting individual members we feel is accept¬\nable, except that it is out of date, as you point out. We have\nalso referred this flyer to the Public Relations Committee for\nrecommendations. It probably needs only to be redone in a\ndifferent color and up-dated.\n3. The redesigning of the Directory of Members is already underway.\nHill, McKenzie and Schooley, as Chairman of the Publications\nCommittee, have already spent a good deal of time discussing this.\nWe plan to reprint the list of individual members in the NAEB\nJournal once a year (thus saving about a thousand dollars over\nthe old practice) and print the list of institutional members in a"
}