{
  "id": "d514-97",
  "text": "August 23, 1962\nMrs. Betty MeXensie\n119 Gregory Hall\nOrbana, Illinois\nBear Betty:\nThe material prepared by Henry Mamet Tor the PE Kit arrived this week\nand, frankly, I was disappointed. My idea of the kit is to provide succinct\nhelps for even, a novice to refer to and use as guides in preparing releases\nand publicising his station, as well as the EASE. I cannot see the value\n©f using balky materials available to the membership at any time, upon\nrequest. If you think the idea has merit, we CAN include a listing of\nprinted materials available for the asking from headquarters; if not, we\ncan omit it.\nActually, Henry provided very few of the items essential to the kit,\nalthough he made some good suggestions which we can incorporate. As a\nstatement of purpose for the PE committee, which I think should be included\nin the kit, I don't think we should use the paragraph expressing this\nissued from headquarters because it is too vague. I suggest using the\nstatement I outlined in my letter to Harold dated August 6 (carbon to you),\nparagraph 3. Henry provides' an excellent summation in his final sentence\nof paragraph 3. This could be added to my statements.\n2 am enclosing Henry's letter so you can refer to it and use any of\nhis suggestions which are adaptable*\nIn Item $ of ay suggestions for the PH Hit's contents (see enclosed\nAnnual Report), perhaps it would be better to Just devote one page to what\nmakes news * the who? what? why? where? questions that should always be\nanswered in the first paragraph, how to develop timely news items, etc. . *\nrather than suggesting how stations can report to national. Henry's ob¬\nservation is plausible. . • It's possible national would not be equipped\nto originate items for stations. I do thin*:, though, it would be helpful\nto include a sample news release so the tom (double spaced - originator's\naddress, date of release, etc. * . ) can be followed. Some of the low\nbudget stations don't have fall time PR people and I'm sure this would\nbe of help* I think we should also include the paragraph on the top of\np. 2 of my letter to Harold and suggest stations incorporate it in the\nfinal paragraph of their releases. Bse my of Henry's suggestions (p. 3\nof his letter) that fit in."
}