{
  "id": "d1722-1",
  "text": "Two Commissioners Dissent\nCommissioners Hyde and Jones dissented to the Kansas State College grant. In a dis¬\nsenting opinion Commissioner Hyde said:\n”In my /pinion, applicants for permits to establish noncommercial educational stations\nshould be given every reasonable consideration possible looking toward constructive\naction. However, rather than granting the application of Kansas State College of\nAgriculture and Applied Science, Manhattan, Kansas, for a noncommercial educational\nTV station on the basis of the present showing, the Commission should notify the ap¬\nplicant of certain basic defects and give opportunity for reply as contenplated by\nSection 309(b) of the Act as recently amended,\n'•Examination of the present application indicates that the applicant’s own governing\nooard, the State Board of Regents, has not approved construction of the proposed\nstation, although it did authorize the applicant to apply to the Commission for the\nassignment of Channel 8 to Manhattan, Kansas, to Kansas State College for an educa¬\ntional television broadcasting station and to file an application. In the same meet¬\ning, it authorized the appointment of a commottee to discuss with the tkiiversity of\nKansas and Kansas State College the proposal to establish a television station or\nstations. Exhibit II of the application,) No information has been made available to\nthe Commission as to the results of the committee discussions or as to any further\naction by the board,\n’’The application gives the estimates cost of construction as $362,6214, and the cost\nof operation the first year as $332,800, But it does not appear from the application\nthat any steps whatsoever have been taken toward establishment of a budget for the\npurpose of construction. On the contrary, it appears that funds for construction will\nrequire further board approval even before the request is submitted to the legislature,,\n^’Section 1.382 of the Commission Regulations requires a showing that an applicant is\nlegally, technically, and financially qualified as a condition precedent to a grant\nwithout hearing.\n'’I question whether granting applications under the conditions presented in this case\nwould be consistent with the Commission’s own responsibilities, I doubt -fohether\ngranting applications without a showing of authority; without a firm showing or in¬\ntention to construct within the foreseeable future; and without at least some showing\nas to a financial plan, will encourage actual construction.”\nCommissioner Jones also stated that, in his opinion, the financial qualifications of\nthe Kansas State College of Agriculture and Applied Science, to build and operate this\nstation should be shown before a grant of its application is made.\nOther Grants to New York State\nThe other five grants were to the University of the State of New York for stations at\nAlbany, Buffalo, Binghamton, New York City and Rochester. On July 2h the Commission\nissued construction permits for stations at Albany, Buffalo, and Rochester. The Al-\noany station will operate on Channel 17 (plus) with antenna height l,lfL0 feet above\naverage terrain (BPET-3). The Buffalo station will operate on Channel 23 with antenna\nheight 630 feet above average terrain (BPET-U). The Rochester station will operate\non Channel 21 with antenna height 700 feet above average terrain (BPET-6). Each\nstation x-dll have effective radiated power of 23*1 dbk (205 kw) visual and 20,3 dbk\n(110 kw for Albany; 105 kw for Buffalo and Rochester) aural. These grants are like¬\nwise subject to engineering conditions. Commissioners Hyde and Jones also dissented\nto the New York grants.\nPLAN TO ATTEND THE NAE3 ANNUAL CONVENTION IN MINNEAPOLIS, NOVEMBER 6-7-8"
}