{
  "id": "d1722-12",
  "text": "*13-\n-mmcii'mmt-\nby Dallas W. Smythe\nNAEB Director of Studies\nUniversity of Illinois, Urbana\nON NOTICING OUR WHITE COLLARS\nBroadcasters belong to the \"white collar\" group in society* Educational broadcasters\nare seeking to act like social scientists. Social scientists too are white collared.\nIt is very much in order to try to be aware of what this white collar means—in terms\nof both the conscious and unconscious implications that go with wearing it. For this\n%^%Se3^ire$5T1^C)^ y°u read White Collar, by C. Wright Mils (Oxford University\nHere is no dull collection of statistics; rather a well-written book by a Columbia\nUniversity sociologist whose thinking is solidly grounded on the concepts and processes\ndeveloped by our social scientists over the past 125 years. If a sample of his writ*\ning will give you the flavor of the book,, try this, from the very first paragraph:\n\"The white-collar people slipped quietly into modern society. Whatever history they\nhave had is a history without events; whatever common interests they have do not\nlead to unity; whatever future they have will not be of their own making. If they\naspire at all it is to a middle course, at a time when no middle course is available\nand hence to an illusory course in an imaginary society. Internally, they areqplit\nfragmented; externally, they are dependent on larger forces. Even if they gained\nthe will to act, their actions, being unorganized, would be less a movement than a\ntangle of unconnected contests. As a group, they do not threaten anyone; as indiv¬\niduals, they do not practice an independent way of life.\"\nThe very universality of the facets of life comprehended by the author makesitectreme*\nly difficult todeseribe this book in a short review. For readers of these pages., how¬\never, it may be helpful to mention especially those facets which are related to. the\nprofessional interests of the educational broadcasters.\nMills is sensitive to the role of images in social life, and to the function of the\nmass media of communications in creating and sustaining images. Early in his Introduc¬\ntion we find him pointing out that the way of life of the -bhite collar man was newly\ncreated by urbanization, the standardization of technology and by the mass media. He\nhas no culture to lean on but this\n\"mass society that has shaped him and seeks to manipulate him to its alien ends...\nThis .isolated position makes him excellent material for synthetic molding at the\nhands of popular culture—print, film, radio and television. As a metropolitan\ndweller, he is especially open to the focused onslaught of all the manufactured\nloyalties and distractions that are contrived and urgently pressed upon those who\nliVe in worlds they never made.\"\nHow did the successors of the independent farmers and the small businessmen—those\nheroes of the early days of our country~get this way? Mills sees the transformation\nof property as the basic process, and by this term he refers to the centralization of\nproperty which destroyed the essential freedom and independence of the old middle c3ass.\nFor the farmers, the opening of the west in the last century meant prosperity in pro¬\nducing agricultural products for export markets. The mechanization of farming reduced\nthe labor requirements for agriculture, freeing labor for urban industry. The decline\nof the independent farmer thus dates from the second half of the 19th Century. The\nlong agricultural depression beginning in the 1920's completed the process, grinding\nthe farmer between falling farm income (as the result of the shrinkage of export mar¬\nkets) and unchanged prices of goods and services he must buy from urban industrialists."
}