{
  "id": "d1722-4",
  "text": "WALKER URGES PROMPT FILING ACTION IN OKLAHOMA SPEECH\nFCC Chairman Paul A* Walker recently spoke before the Education Committee of the Okla¬\nhoma State Legislative Council pointing out the need for legislative support of uni¬\nversity and college applications for educational television construction permits*\nOnly ten months remain of the original one year educational channel reservations.\nReviews Oklahoma Statements\nAfter a summary of the history of the FCC and JCET activity in setting up 22*2 educa¬\ntional television reservations. Commissioner Walker went on to say:\n\"Now, as to the siutation in Oklahoma* As you know, the House of Representatives and\nthe Senate of the State Legislature of Oklahoma adopted a concurrent resolution point¬\ning out that radio and television are instruments of communication and means of ex¬\npression like writing, printing and speaking^ that television as a means of broad¬\ncasting pictures has already proved to be an effective tool for the use of education*\nThe concurrent resolution then urged the Federal Communications Commission to reserve\nsuch channels as would adequately serve the interests, uses and needs of education\nnow and whenever they may be desired in the unforeseeable future#\nQuotes State Superintendent\n\"The State Superintendent of Public Instruction declared that his department would be\ninterested in seeing channel assignments irade for the principal cities of the state#\nThe University of Oklahoma at Norman submitted a sworn statement which said in part:\n•The University of Oklahoma has been a pioneer in the field of educational\nradio broadcasting in the southwest — with AM broadcasting since 1922 and\nwith FM broadcasting since 19l*9.«.We are convinced that non-commercial education¬\nal television stations have much to offer in the field of education*1\n\"The Oklahoma Baptist University supported the application of the University of Okla¬\nhoma* The Oklahoma Agricultural and Mechanical College at Stillwater stated that\nit firmly believed that certain frequencies should be reserved for educational pur¬\nposes. The Northeastern State College at Tahlequah supported the proposal for a\nreservation at Muskogee.\nOklahoma City Also Supported Reservations\n\"The Oklahoma City Board of Education in its statement submitted to the FCC, had this\nto say:\n*Wfe are very anxious that a TV channel be reserved for this purpose in our\nlocality* We feel it will be a very grave loss to the proper education of our\nchildren if commercial use of the TV spectrum eliminates completely educa¬\ntional television broadcasting. We are thus requesting you to reserve such\na TV channel for Oklahoma City educational broadcasting.*\n\"In consideration of these claims and the general claims made for non-commercial edu¬\ncational television broadcasting, the FCC reserved seven channel assignments for\neducational institutions in Oklahoma. The channel a ssignments are located at Enid,\nLawton, Muskogee, Norman, Oklahoma City, Stillwater and Tulsa* Stations built in\nthose communities could serve the majority of the children and adults in the whole\nstate of Oklahoma. And assignments in other areas may be applied for if needed.\nWIVES ARE WELCOME TOO AT THIS YEAR’S CONVENT ION—MINNEAPOLIS —NOVEMBER"
}