{
  "id": "d1722-6",
  "text": "- 7 -\n\" NEWS OF NAEB\nFIRST RECIPIENTS OF NON-COMMERCIAL TELEVISION GRANTS TO ATTEND ISC TV WORKSHOP\nCarroll V. Newsom, Associate Commissioner, New York State Education Department, and\nRobert Hilgendorf, Kansas State College, representing the first institutions to re¬\nceive FCC approval to construct non-commercial educational television stations, are\nparticipating in the Iowa State College Televison Workshop held' at Ames, Iowa, Au¬\ngust 17-23, according to Richard B. Hull, Workshop Chairman.\n\"These men, and those representing over UO other institutions and school systems have\npractical problems of television station management for which the Workshop hopes to\nprovide some of the answers,\" said Hull* \"The Iowa State College Staff, including\nWOI-TV, is prepared to pass along our experience in programming, engineering, finance^\nand management to do what we can to get educational television rolling in the least\npossible time.\"\nSpecial Consultants Invited\nIn addition, consultants have been invited from outside the ISC campus to supplement\nthe local staff presentations. Rudy Bretz, former CBS TV Director, wall supervise a\ntelevision program to be presented by the participants. Others to appear include\nGertrude Broderick, Radio-Television Specialist, U. S. Office of Education; James\n^ Butts, Chief Engineer, KWWL-TV; Seymour Krieger, Counsel, JCET; William B. Levenson,\nAssistant Superintendent, Cleveland Public Schools; James Miles, Executive Director,\nNAEB; Paul C. Reed and Walter Emery, Field Representatives, JCET.\nThose institutions which had indicated the greatest readiness to move into TV, as\nrevealed in a search of the files of the JCET, were invited to send representatives\nto participate.\nThe Workshop is sponsored by Iowa State College, the only educational institution now\noperating a television'station, in cooperation with the National Association of Edu¬\ncational Broadcasters and the Joint Committee on Educational Television*\nThe idea for the Workshop developed from the speech of Chairman Paul A. Walker of the\nFederal Communications Commission urging educators to take immediate advantage of\nthose channels reserved for non-commercial educational television. Assisting Hull\non the Workshop Committee are Joseph North, Coordinator of Radio and Television Edu¬\ncation at Iowa State College, and Irving R. Merrill, formerly of the NAEB Board of\nDirectors, Urbana, Illinois.\nList of Participants\nParticipants in the workshop includes\nALABAMAt Bill Kennedy, Office of Director of Publicity, Alabama Polytechnic\nInstitute.\n- Graydon Ausmus, Director, Broadcasting Service, University of Alabama.\nCALIFORNIAi L. DeGraff Stanley, Jr., Producer, Experimental TV Programs, San Diego\nCity Schools.\nILLINOISs George Jennings, Director, Division Radio and Television.\nM. L. Miller, Director of Audio-Visual Education, Ill. State Normal Univ.\nWilliam P. Froom, Director, Radio & TV, Northern Ill. State Teachers College.\nBuren C. Robbins, Director of Radio, Southern Illinois University."
}