{
  "id": "d1599-0",
  "text": "A SUPPLEMENTARY REPORT COVERING THE ACTIVITIES IN MEXICO CITY OF ITS COUNSEL\nSubmitted to the National Committee on Education by Radio, September 6, 1933\nBy Armstrong Perry\nAfter receiving instructions from the Committee to represent it at the North\nand Central American Radio Conference in Mexico City, I attended several meetings\nof the committees organized by the United States Department of State to prepare\nfor this Conference. The Committee was represented in preliminary meetings also\nby Dr. Tracy F. Tyler, Commander T. A. M. Craven, and Mr. Horace L. Lohnes, and\nthese gentlemen informed mo concerning meetings which I did not attend.\nThe topic most discussed at these mootings was the proposed widening of the\nband of frequencies for broadcasting. The commercial broadcasters demanded, and\nfought for, frequencies between 160 and 220 kilocycles. They wore supported in\ntheir demands by the Radio Manufacturers’ Association. The discussion showed\nthat the commercial broadcasters wantod these additional channels in order to\nincrease the sale of time for advertising, and that the manufacturers wanted\nbroadcasting on the new frequencies because the radio listeners would have to\nspend approximately half a billion dollars for new apparatus if they were to hear\nprograms on the proposed channels. The proposal was defeated by the ’’mobile\ngroup”, which included the United States Navy and Army, shipowners and aviation\ninterests. This group objected to giving up the channels because, it was claimed,\nthere wore no other channels in which the mobile services could be accommodated\nwithout prohibitive expense or loss of efficiency. Commander Craven, on behalf\nof the National Committeo, presented a compromise plan which although well\nreceived was not adopted.\nShortly before tho date for the opening of the Conference, a confidential\nletter from the Department of State gave some information as to the position of\nthe official delegation on the matter of widening the broadcast band. The\nposition of the delegation on tho matter of allocating frequencies to the\ndifferent countries was never made known to me by the delegation and, so far as\nI know, no person or group outside the conference was informed by the delegation\nat any time. It appeared to be an official secret, revealod only through leakage.\nSeveral days before tho opening of tho Conference I was approached by an\nofficial of the Chesapeake & Ohio Railroad who wanted to sell me space in an\nair-cooled car in which the official delegation was to make the trip to Mexico\nCity. I reserved space. Then I was notified by this railroad official that the\nDepartment of State had notified the railroad that the car was to be reserved for\nthe official delegation exclusively and I was offered space in another car. I\ninquired of the Department of State and was Informed that the car was reserved\nfor officials exclusively and that all space was taken. The railroad official\nreserved space for mo in another car, which was entirely satisfactory to me.\nAfter the train left St. L^uis three representatives of commercial radio corpora¬\ntions moved into the car reserved for government officials exclusively, and wont\nthrough to Mexico City with the official delegation.\nI arrived in Mexico City on the morning of July 8 and had a room at the\nRegis Hotel, whicji was the headquarters of the American delegation, until tho\nmorning of July 10, when I moved to a house selected from several recommended by\na member of the staff of tho American Embassy. I had a room there during the\nrest of my stay in Mexico."
}