{
  "id": "d1599-1",
  "text": "in turn, the administrator restim\\Oate the members through Ms sensitive response\nto their wishes and feelings.\n4. Reaffirm the individual in his choice of a career in educational broad-\ncasting. A clearer perception of goals, the ei^ouragement derived from realization\ntimtothers are meeting and over-coming similar obstacles, the zest that comes from\nfeeling a part of a forward-moving, expanding, positive movement. All these should\ncome from the convention experience. The conventioneer should return home with\nstrengthened motivation and heightened sense of Ms own challenging role in helping\nto build a free and informed society. He should feel this so intensively as to\nimpart this same sort of lift to workers in Ms own shop.\n5. Provide professional recognition opportunities for the individual. Such\nopportunities'range from providingawards to veterans for accomplishments of the\npast to affording younger people a chance to contribute their ideas, share their\nscholarsMp, and exhibit their capacities. Through reading of technical papers,\nparticipation in panels, and remarks from the floor, members can enhance their\nstatus and stature among their peers and gain leadership roles in the guidance\nand direction of their professional organization.\n6. Afford a rich and useful learning experience. The attendees should get\nMs money’s worth in terms of information and stimulation that can be effectively\napplied to Ms own work. This should include finding out about new methods, improv¬\ned techniques, and the latest developments in equipment and technocracy. He should\nbe able to gain fresh insights, novel ideas and new perspectives. And, finally,\nhe should receive seme measure of inspiration, something to \"set spark to the spirit.\nTMs means not only arranging to have competent technical authorities and stimulat¬\ning sessions on pertinent topics, but, above all, providing for exposure to some\ngreat minds.\n7* Demonstrate the cohesion and strength of the organization. Our convention\nshould be more than a platform for the ritualistic utterances of tribal leaders\n(what Hayakava terms \"accustomed sets of noises”) whose principal function is to\nstrengthen our group loyalties, reinforce our professional allegiances, and produce\na common bond of reactions. Loyalty, Edgar Dale reminds us, is more than blind\nfollowing; it is intelligent devotion to a cause or organization. More than grudg¬\ning assent, spectatoritis, aloofness, it means getting involved, participating,\nhelping determine which was the organization is going and taking responsibility for\nthe consequences. It means thoughtful examination of values and then standing to¬\ngether on a common ground.\nOur open forum business sessions provide an evironment for frank, free and\nopen discussions that, though they may appear to produce undue stresses and strains,\nresult ultimately in harmony, cooperation, and a feeling and thinking together that\nachieve not just consent but consensus. The tested fabric is the more secure. Our\nassociation can tolerate, without disixrtergration, much more disorganization and\nstress than many people recognize.\n8. Be conducive to congeniality and comradeship. This is not fellowship in\nthe American Legion sense, but in the mutuality that comes from sharing the same\nproblems and hopes, of meeting and accepting common challenges and responsibilities.\nThe convention provides the opportunity each year to sit down at one table,enjoy\nwith others, experience in common. We all appreciate the yearly opportunity to re¬\nnew acquaintances, reminisce with old freinds, and meet new comers. To a certain\nextent an HAEB member can say appropriately of Ms convention-going what the cab¬\nman said about taxi driving: \"It’s not the work I enjoy so much; it’s the people\nyou run into.\"\n/ Applying these criteria to the recent gathering in San Francisco, It came\nclose to meeting them all. Congratulations to Jim Day and Ms staff for a first\nrate production job and to all who contributed for affording those who attended\na most rewarding and memorable experience. — WGH"
}