{
  "id": "d1683-1",
  "text": "NAEB NEWS LETTER\nFEB. 15, 1941...Page\nc\nWBQE GOES FM\nWBOE, Cleveland Board of Education, changed from amplitude to\nfrequency modulated signals on February 3. WBOE operates seven\nhours each day, from 8:30 to 4:30, Cleveland schools have been\nequipped with FM receivers.\nKFJM PROPOSED CHANGE\nKFJM* University of North Dakota, Grand Forks, N, D., has applied\nfor modification of license to change its hours of operation from\nunlimited to specified hours, with its present 500 watts night\nand 1,000 day. The proposal is to reduce hours of operation to\ntwo per day, from 3 to 5 p.m. Dal tan LaMasurier, general manager\nof the commercially-operated college station, has filed an\napplication for a new III-B station of KFJM1s frequency, 1410\nk.c. If the FCC approves the two applications, studios of KFJM\nwill be returned to the campus and Mr, LaMasurier will sever all\nconnections with the University station.\nOHIO STATE HOLDS ENGINEERING CONFERENCE\nThe Fourth Annual Broadcasting Engineering Conference lived up\nto all expectations, according to early reports on sessions held\nin Columbus, Ohio.\nA„ D. Ring, assistant ohief FCC engineer in charge of broadcasting,\ncontributed greatly to the conference with his discussions of\ncurrent problems. Ring both interpreted and clarified FCC rules,\nI&nphasizing that to accomplish reallocations by March 29, would\nbe no simple matter, he said, \"we*ve got a big problem on our\nhands, about 795 of them, ana the toughest part of the burden\nfalls on the shoulders of station engineers,” He reiterated\nthe FCC policy of helpful cooperation when requested, and pointed\nout that*he will overlook possible pattern variances during tests,\nbefore March 29, and \\70uld even condone slight deviations in\nregular hours resulting from inadequate time to make complete\nadjustments of transmitter equipment.\nBMI LISTS NON-COMMERCIAL STATIONS\nBroadoast Music, Inc., has listed the following non-comraeroial\nstations as using BMI musio:\nKF3G, Los Angeles, Cal.; WMBI, Chicago, Ill.; WILL, Urbana, Ill.;\nWOI, Ames, la.; KWLC, Decorah, la.; KFKU, Lawrence, Kan. ;T7BKY,\nBeattyville, Ky.; WCAL, Northfieid, Minji.; WSSLS, Buffalo, N. Y.;\nWCAD, Canton, N. Y.; WBBR, New York City,; WNYC, New York City;\nWHAZ, Troy, N. Y.; W03U, Columbus, 0.; WNAB, Norman, Okla.; KOAC,\nCorvallis, Ore.; KBPS, Portland, Ore.; WSAJ, Grove City, Pa.; KFDY\nBrookings, 3. D.; WCAT, Rapid City, 3. D.; WTAW, College Station, ’\nTex.; KWSC, Pullman, Wash.; WHA, Madison, Wis.; WLBL, Stevens\nPoint, Wis«; WSUI, Iowa City, la.; KUSD. Vermillion, 3. D„"
}