{
  "id": "d451-7",
  "text": "MMORAITOM\nTo; Messrs. Tettemer 8s Fellows\nDate; January 20, 196k\nSustained by the belief that\n(1) we are all working in sincerity and good will toward a common\ngoal; the best presentation we can devise (by means of six\nfilms and supporting kit materials) of television*s contribu¬\ntions to the classroom and its effective utilization toward\nlearning;\n(2) our differences are not basic but arise, in the main, from\nhuman shortcomings in communication, superficial differences\nin taste, and sometimes-cursory consideration which is at¬\ntributable to the pressures of time on important and busy\npeople;\n(3) those working on the project are competent and professional\npeople versed in the dynamics of idea development and capable\nof construing change and modification toward ultimate\ngroup acceptance as progress, without undue involvement of\npersonal ego,\nI suggest that we consider the following modifications of the present\nfilm-treatment content and approach, in lieu of any further doctoring,\npatching, or revamping of the treatments in their present form. It would\nseem to me desirable for these modifications to be construed as evidence\nof (1) awareness of the suggestions made by Office of Education per¬\nsonnel, (2) a desire to incorporate the suggestions into our treatment\nof the fijjned materials, (3) ability to do so.\nIn general, the modifications will consist of moving over into the\nsupporting kit materials certain portions of the content which is not\ndependent upon film for effective presentation and which lends itself\nquite readily and appropriately to other forms of presentation. This\nwill accomplish several things, in my opinion. It will permit valuable\nand limited film time to be used in the most advantageous way, by reserving\nthat time for the aspects and procedures of utilization which can be\npresented effectively in no other way. It will automatically eliminate\nsome of the more \"gimmicky\" aspects of the present film design by deleting\nfrom the film and placing elsewhere expository material not inherently\nsuited to filmed presentation. It will thin out generalities which appear\nto be seducing attention from certain points now made but not completely\napprehended. It will remove the verbiage obscuring some important"
}