{
  "id": "d451-70",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTING\n1346 Connecticut Avenue, N.W.\nVfeshington, D. C. 20036\nMEMORANDUM\nTo: Office of Education\nJuly 30 1964\nSTATUS OF PROJECT OE 3-I6-OO7\nand\nREQUEST FOR AMEINDMENT AND EXTENSION OF THE PROJECT\nUnder this contract, the NAEB is preparing and producing six \"kits\" of\ninformation about the utilization of television lessons in the classroom.\nEach kit will contain a 30-minute l6mm sound film together with correlated\nmaterials such as discussion outlines, bibliographies, and general back¬\nground information. The kits are designed to provide the basis for a\nmeeting or class session relating to some phase of utilization.\nThe kits are being prepared in such a way that they can be used in sequence\nor individually for special interest meetings. They will be particularly\nappropriate for seminars and summer workshops in educational television.\nCURRENT STATUS OP THE PROJECT\nThe NAEB was awarded a contract to produce these materials on January 30,\n1963. The scheduled termination date for the contract is August 31, 1964.\nAs a result of the first Advisory Committee meeting, specific outlines\nwere developed and an agreement was made to secure the services of a\nwriter who could develop these outlines into script treatments. As the\ntreatments were prepared and reviewed by the Committee, it became\napparent that the use of video tape and kinescope film for the production\nof these materials as originally contemplated would not provide a satis¬\nfactory technical process for the production of superior materials.\nTherefore, at the request of the Advisory Committee, the Project Staff\nwas directed to discuss with the U.S. Office of Education an amendment\nto the contract which would provide additional funds to produce these\nmaterials directly on film. The discussions between the National\nAssociation of Educational Broadcasters and the Office of Education were\nconducted during a four month period and resulted in an amendment to the\ncontract dated September 15, I963, calling for film production, although\nit was acknowledged that this would most likely require a lengthier\nproduction schedule than videotape and kinescope."
}