{
  "id": "d451-8",
  "text": "-2-\nelements already present but not clearly observed. It will permit\nadditional attention to and emphasis on these elements to the end that\nthere win be no question of their presence, their importance, or their\nimplications for the success or failure of television in the classroom.\nThe modifications to be suggested seem to me to be clearly in line with\nthe stated intention of the project; \"The emphasis in all of the kits\nwill be to show and to demonstrate utilization...not merely to talk\nabout utilization or to show examples of television programs without\nthe classroom activities.\"\nWere the films to be used alone, all pertinent considerations would\nneed to be reflected in the films. However, as the kits will contain\nother materials designed to extend and clarify the material offered\nin the film we should aim at allowing more room, time, and flexibility\nin the filmed sequences for actual demonstration of utilization in as\nmany of its aspects as possible.. .the real reason for going to film in\nthe first place.\nI suggest, therefore, that we transpose to the supporting kit materials\nthe majority of the content in Film No. 2, as it now stands, concerning\nthe development of the communications resources, along with the steps\nin the advent of television. This gives us an opportunity to explore\nmore fully, on film, effective and ineffectual approaches to utilization\nof the television lesson, reasons for success and failure of comparable\nlessons in different classrooms, imperative need for classroom teacher*s\nmastery of utilization techniques...material which originally was in¬\ncluded in the films but deleted because of time pressures.\nI suggest that simplification and compression of the material in Film\nNo. 1 will add clarity and impact to the reasons for using television\nand will give more room and time for a consideration of what television\ncan do.\nMuch of the detailed sequence of preparation material in Film No. 3\nmay be transferred to the supporting kit materials, where it can be done\nquite handily with written exposition and art work. This will delete\nthe boat sequence (only one of several slick or cumbersome attempts\nto present on film an extravagantly long and complex procedure which\ndoes not lend itself to filmed presentation), thereby relieving the\ngeneral nausea, simplifying the writer*s task, and permitting special\nattention to a few major elements in preparation of the lessons; existing\nand defined need, specific objectives, intended behavioral patterns\nanticipated in the presentation and expected to emerge as a result\nof enli^tened utilization."
}