{
  "id": "d1735-0",
  "text": "Urbana, ILLINOI s\nApril ! , !946\nN A E B MEETS MAY 3 IN COLUMBUS\nThe National Association of Educational Broadcasters will hold a one-\nday CONVENTION AT THE NEIL HOUSE IN COLUMBUS, OH I 0 , ON FRIDAY* MAY 3.\nAnnouncement of the meeting has been made by Frank E, Schooley, Presi¬\ndent and Acting Executive Secretary of the Association. The opening\nSESSION IS SCHEDULED TO MEET AT 10 A Jo, IN THE WALNUT ROOM OF THE\nNeil House. Other sessions are scheduled for 2 and 8 o^clock.\nThe meetings will be given over to a discussion of Association business\nand to problems facing the non-commercial, educational broadcasters,,\nIncluded on the agenda will be such items as the proposed rules and\nREGULATIONS OF THE FCC FOR THE OPERATION OF THE NON-COMMERCI AL EDUCATIONAL\nFM STATIONS; THE EXPANSION OR REORGANIZATION OF NAEB; THE FILLING OF\nFACANCIES IN THE NAEB OFFICES, CREATED BY RESIGNATIONS ANO CHANGES IN\nPERSONNEL; THE TIME AND PLACE FOR THE ANNUAL FALL MEETING OF THE ASSOCI¬\nATION, PUBLIC SERVICE RESPONSIBILITIES OF THE EDUCATIONAL STATION; AND,\nOTHER ITEMS OF BUSINESS.\nAll members are urged to be present. All are urged to transmit in\nADVANCE OF THE MEETING YOUR SUGGESTIONS ON ITEMS OF BUSINESS FDR IN¬\nCLUSION ON THE AGENDA.\nTHE MEETING WILL BE CLOSED EXCEPT TO NAEB MEMBERS, ASSOCIATE MEMBERS,\nAND INVITED GUESTS.\nF c C PROPOSES RULES FOR EDUCAT1ONAL-FM OPERATION\nThe Federal Communications Commission on March 7 issued its proposed\nRULES AND REGULATIONS FOR THE NONCOMMERCIAL EDUCATIONAL FM BROADCAST\nservice. Copies of the proposals, no doubt, have been seen by all\nNAEB members. In order that NAEB might give consideration to the\nPROPOSALS AT its COLUMBUS MEETING, THE NAEB HAS REQUESTED A 30-DAY POST¬\nPONEMENT OF THE EFFECTIVE DATE OF THE RUi*ES AND REGULATIONS* THE RE¬\nQUEST FOR POSTPONEMENT WAS MADE WITHOUT INDICATING ANY PREJUDICE TO\nTHE PROPOSALS OF THE FCC, BUT RATHER TO GIVE US AN OPPORTUNITY TO DIS¬\nCUSS THEM THOROUGHLY. |F YOU HAVE ANY SUGGESTIONS, PLEASE FORWARD THEM\nTO YOUR PRESIDENT AND COME TO COLUMBUS PREPARED TO DISCUSS THEM„\nFCC PUBLISHES PUBLIC SERVICE REhQRT\nThe same DAY IT ISSUED PROPOSED RULES for THE NONCOMMERCIAL EDUCATIONAL\nFM SERVICE, THE FCC ALSO ISSUED ITS REPORT ON \"PUBLIC SERVICE RESPONSI¬\nBILITY of Broadcast Licensees*w Copies of the report were made avail¬\nable BY THE FCC, AND MORE RECENTLY NAB HAS REPRINTED THE REPORT« MAYBE\nYOU*LL WANT TO DISCUSS THE REPORT AT. COLUMBUS. ($F YOU DONK T YOU'LL BE\nUNIQUE IN BROADCASTING CIRCLES)."
}