{
  "id": "d1735-1",
  "text": "NAEB NEWS LETTER\noPa.GE\n... •ooNovember l> 1944\n(a) Any UN I VERS I T Y» COLLEGE, OR OTHER EDUCATIONAL OR PUBLIC SERVICE\nAGENCY Of RECOGNIZED STANDING ENGAGED IN EDUCATIONAL, NON-COMMERCIAL\nBROADCAST ING OVER A RADIO STATION OWNED ANO/OR OPERATED BY IT, OR ANY\nSUCH AGENCY HOLDING A CONSTRUCTION PERMIT FOR SUCH A STATION, MAY BE\nELECTED TO MEMBERSHIP IN THIS ORGANIZATION BY APPROVAL OF THE EXECUTIVE\nCOMMITTEE, AND A TWO-THIRDS AFFIRMATIVE VOTE OF ALL ACTIVE MEMBERS OF THE\nASSOCIATION, LACH MEMBER INSTITUTION OR AGENCY SHALL BE ENTITLED TO\nONE VOTE.\n(a) Any individual, educational institution, or public service agency\nENGAGED IN EDUCATIONAL BROADCASTING MAY BECOME AN ASSOCIATE MEMBER OF\nTHIS ASSOCIATION BY APPROVAL OF THE EXECUTIVE COMMITTEE, AND A TWO-\nTHIRDS AFFIRMATIVE VOTE OF ALL ACTIVE MEMBERS OF THE ASSOCIATION.\nAssociate members shall have all the privileges of active membership,\nEXCEPT THAT THEY SHALL NOT BE PERMITTED TO VOTE OR TO HOLD OFFICE.\nSPECIAL COMMITTEE COMMENPEP\nWork of the special committee appointed sv acting president Allen Miller\nTO REPRESENT NAEB at the recent NAEB hearing on the post-war use of the\nSPECTRUM WAS COMMENDED IN A SPECIAL RESOLUTION PASSED BY THE CONVENTION.\nChairman of the committee was Carl Menzer, with Jim £bel and M„ S0 Novik\nAS MEMBERS, MENZER APPEARED AT THE FCC HEARING AND A COPY OF HIS TESTI¬\nMONY BEFORE THE FCC HAS BEEN SENT TO EVERY. NAEB MEMBER. Iff FOR ANY\nREASON, YOU FAILED TO RECEIVE YOUR COPY, LET THE EXECUTIVE SECRETARY\nKNOW AND HE * LL BE GLAD TO FORWARD A COPY TO YOU,\nMCN2ER MADE A SPECIAL REPORT ON THE HEARING TO THE SECOND SESSION OF\nTHE CONVENTION IN CHICAGO. He REVIEWED THE HIGHLIGHTS OF THE HEARING\nAND OF HIS TESTIMONY BEFORE THE FCC,\nThe convention not only approved of the action in raising a special fund\nFOR THE HEARING, BUT ALSO APPROVED AN APPROPRI ATI ON FOR ANY NEEDED ACTION\nON behalf of NAEB during the next twelve months.\nSTAT!ON REPORT SESSI ON\nThe opening session of the convention was given over to a report of\nMEMBERS AND A DISCUSSION OF PROBLEMS CONFRONTED, INDIVIDUALLY AND\nCOLLECTIVELY BY NAE8 MEMBERS. VqU HAVE HAD THE HtGHLIQHTS OF THIS\nREPORT IN A SPECIAL LETTER PREPARED AND TRANSMITTED TO ALL BY THE INIMICAL\nWaldo Abbot of Michigan,\nNAE8 IN THE BLACK\nTreasurer W. I0 Griffith reported that NAEB has continued to transact\nbusiness on a business-like basis. There is more than an ample amount\nOF CASH on hand TO MEET ALL OUTSTANDING BILLS. A VOTE OF THANKS TO THE\ntreasurer was passed unanimously by the Convention.\nRAISE NAEB DUES?\nConsiderable dbscussion was held regarding the amount of dues which\nshould be paid annually by NAEB members and associate members. ^HETC\nWAS A MAJORITY OPINION OF THOSE AT THE CONVENTION THAT THE ANNUAL DJES"
}