{
  "id": "d1735-5",
  "text": "NAEB NEWS LETTER...........Page 6.......November l# 1944\nAbout 85 per cent of the homes, Tyler said, probably would be equippeo with\nCOMBINATION AM-FM RECEIVING SETS, AND ONLY 20 PER CENT OF THE HOMES COULD\nAFFORD TELEVISION RECEIVERS.\nThese predictions are based on the hope, he says, that prosperity will\nFOLLOW THE WAR* If A DECLINING ECONOMY IMPOVERISHES THE NATION, HE ADDED,\nTHE DEVELOPMENT OF RADIO WILL BE ARRESTED—COMMERCIALLY AND EDUCATIONALLY-,\nPresident Clarence Dykstra of the University of Vi scons in was another\nFEATUREO SPEAKER AT THE CONFERENCE. He DECLARED THAT RADIO HAD AN\nIMPORTANT MISSION TO FULFILL AFTER THE WAR IN BRINGING EDUCATION TO THE\nMASSESo IN THE FIELD OF ADULT EDUCATION, DyKSTRA SAID, RADIO CAN BRING\nA FULLER UNDERSTANDING AMONG THE PEOPLES AND NATIONS OF THE WORLD TO\nPREVENT ANOTHER GREAT WAR.\nW I L L LISTS NEW PROGRAMS\nFor ARMCHAIR STUDENTS, FOUR UNIVERSITY OF ILLINOIS COURSES WILL BE BROAD¬\nCAST DIRECT FROM CLASSROOMS THIS SEMESTER 3Y THE UNIVERSITY^ NON-COMMER¬\nCIAL RADIO STATION, WILL (580 KC.), JOS. F. Wright, STATION DIRECTOR, HAS\nANNOUNCED.\nMarketing organization and operation will be discussed by Prof. P. 0,\nConverse at 8 a.m. Mondays, Wednesdays and Fridays. Animal hygiene,\nGIVING ATTENTION TO THE PREVENTION OF INFECTIOUS, CONTAGIOUS, PARASITIC,\nAND NUTRITIONAL OISEASES IN ANIMALS, WILL BE DISCUSSED BY PROF. ROBERT\nGraham and others at II a.m. Tuesdays and Thursdays.\nA NON-TECHNICAL DISCUSSION OF THE LIFE OF INSECTS AND THEIR IMPORTANCE\nTO MAN WILL BE PRESENTED AT 2 P.M. TUESDAYS AND THURSDAYS BY PROF.\nWalter Balduf, a fourth course, on the History of England, will be\nPRESENTED BY PROF. F. C. D|£TZ.\nA NEW PROGRAM SERIES \"JUST ABOUT Music\" DISCUSSING ELEMENTS IN MUSIC,\nMOODS IN MUSIC, AND INSTRUMENTS OF THE SYMPHONY ORCHESTRA, WILL BE PRE¬\nSENTED BY LaNSON F, OEMMING, DIRECTOR OF ?*IUSIC FOR WILL, AT 2 P.M.\nEVERY Friday.\nAlso new is a 15-minute program on \"Interpretation of Literature\" to be\nPRESENTED AT 9:15 A.M. ALTERNATE THURSDAYS BY STUDENTS IN Mrs. OLIVE\nGoldman’s class.\nA THIRD NEW PROGRAM IS \"SpEAKING AND WrUING\" TO BE PRESENTED BY TEACHERS\nAND STUDENTS IN THE COURSES OF VERBAL EXPRESSION OF THE D|VI SION OF\nGeneral Studies at 4 p.m. Thursdays.\nN.V.C* BOARD OF EDUCATION ARRANGE RADIO SCHEDULE\nTwelve new series of educational programs in cooperation with the Board\nof Education, ranging in subject matter from news interpretation for the\nVERY YOUNG TO REVIVALS OF OUTSTANDING RADIO DRAMAS, HAD THEIR PREM 1 ERE\nBROADCAST OVER THE MUNICIPAL BROADCASTING SYSTEM DURING THE WEEK OF\nOctober 55. The comprehensive \"Education by Radio\" program of the H.Y.C.\nBoard of Education, follows:"
}