{
  "id": "d554-26",
  "text": "COMMITTEE ON SCIENTIFIC AIDS TO LEARNING\nCOMMITTEE OF NATIONAL RESEARCH COUNCIL\n41 EAST 42ND STREET, NEW YORK, N.Y.\nJames B. Conant, Chairman Telephone: Murray Hill 2-8352\nVannevar Bush\nRoss G. Harrison\nFrank B. Jewett\nBethuel M. Webster\nBen D. Wood\nIrvin Stewart, Director March 10, 1941\nMr. Frank E. Schooley\nRadio Station YfILL\nUrbane, Illinois\nDear Mr. Schooley:\nThis wml acknowledge the receipt of your letter of\nMarch 7 re1ating to airgducatioffal transcription seryioe and\nexchange. JESBoubtiess you~a're~famiTiar~ w£$hTthe mimeographed \"pubUTca-\nFieh^’^TThe Association of School Film Libraries, 9 Rockefeller\nPlaza, New York City, entitled \"Educational recordings for Classroom\nUseu. It is the best source list for educational transcriptions\nthat I know.\n^The only thing which we have done in the field of\neducational transcriptions was to stimulate the interest of the Office\nof Education in the subject and to make the grant which initiated the\n\"Americans All\" series of transcriptions. The grant was to start a\nrevolving fund, and I understand that actually the revenue from the\n\"Americans All\" transcriptions has been used to make a couple of other\nt rans c riptions.\n^7<e have been responsible for a number of especially\nI made phonograph records including the forty science records and the\nI six art appreciation records, reports concerning the use of which were\nI sent to you some months ago^| The New York State Education Department\nhas made a series of approximately forty records for rural schools in\n: New York State, with which it is now experimenting. A group of Georgia\neducators are now working on a series of records for Georgia schools.\nNone of these activities, however, have any relation to a transcription\nservice and exchange.\n^We do not have presently in mind any further activities\nwith respect to an educational transcription service and exchange. If\nsome one should mature a well thought up proposal in that area, we should\nl be glad to consider whether or not it should be given limited financial\n: support by the Committee. Fundamentally, however, our funds were intended"
}