{
  "id": "d87-42",
  "text": "NAEB HEADQUARTERS\n1346 Connecticut Avenue, N.W.\nWashington, D.C. 20036\nTO: ALL RADIO STATION MEMBERS\nFROM: Harold E. Hill\nRE: Nominations for new Radio Station Division Board\nAt the recent NAEB Convention in Milwaukee, the membership approved\nthe amendments to the Constitution and By-Laws providing for a\nnew organizational structure for the NAEB. Details of the new\nstructure are contained in the latest Washington Report, now in\nthe mail to all members. Among other things, tKe new structure\nprovides for a semi-autonomous Radio Stations Division, with\nits own Board (similar to the present Radio Board).\nBecause the reorganization provides for the election of four new\nDivision Boards, the nominations recently called for for the\nRadio Board from Regions II, IV and VI are invalid, and the\nincumbent members of the Radio Board from Regions I, III and V\nwill have their terms terminated as of December 31, 1963, or as soon\nas the new Radio Station Division Board is constituted, if it is\nlater than December 31.\nTherefore, this is a call for nominations to the entire Radio\nStation Division Board. There wiTT”T>e six DirectoFs~'one”eTected\nfrom eacIOlAEB Region. In order to constitute the new Board\n(which will have regular terms of three years), provision has\nbeen made for initial terms of different lengths, as follows:\nRegions II and V One year terms\nRegions III and VI Two year terms\nRegions I and IV Three year terms\nOnly the official representative of a member Radio station may\nsubmit a nomination, and he may nominate any regular employee of\na member Radio Station within his Region,\nIn order to constitute the new Board before January 1, 1964, it\nwill be necessary to have nominations at Headquarters not later\nthan December 11. Ballots will then be prepared and mailed out\nso that returns can be received by Christmas.\nFor your convenience, the states comprising each of the regions\nare listed on the front of the NAEB Directory of Institutional\nMembers. Also, for your information, the^'memUers^lTThe present\nBoard, who are resigning as of December 31, but are eligible for\nnomination at this time, are listed on page viii of the Directory.\nPlease use the attached form to submit your nominations. NOMINA¬\nTIONS, TO BE VALID, MUST BE RECEIVED AT WASHINGTON HEADQUARTERS\nNO LATER THAN DECEMBER 11, 1963. (May we urge you to send your\nnomination by return airmail, and even by telegram if you feel\ntime might not permit your nomination to reach here before the\ndeadline.)\nHEH/mlm\nDecember 2, 1963"
}