{
  "id": "d1060-1",
  "text": "NAEB NEWS LETTER\nPAGE 2«\"\nMay I, 1942\nMacARTHUR DAY (cont’q)\nKenneth Yeend, Director.\nAn especially unique service was included. As part of the program in\nTHE CONVOCATION WHICH HIGHLIGHTED MacARTHUR Day, A DRAMATIC SKETCH\nENTITLED \"SALUTE TO BATAAN1' ®AS PRESENTED BY THE KWSC STAFF. THE\nCONVOCATION WAS HELD IN THE ROGERS F|ELO FOOTBALL STADIUM. THE\nTECHNICAL LIMITATIONS ATTENDANT UPON THIS LOCATION CALLED FOR SOME\nINGENUITY IN PRESENTING A DRAMATIC SKETCH NEEDING SOUND EFFECTS,\nMUSIC, AND STUDIO EQUIPMENT. THE MaSTER OF CEREMONIES INTRODUCED\nTHE STATION REPRESENTATIVE WHO WAS ANNOUNCING THE CONVOCATION ON\nLOCATION. The ANNOUNCER IN TURN INTRODUCED \"SALUTE TO BaTAAN.\"\nIn THE KWSC STUDIO ACROSS THE CAMPUS, THE CAST TOOK BHE CUE AND\nBEGAN THE TEN-MINUTE SHOW HONORING A SjATE COLLEGE GRADUATE WHO\nHAD BEEN CITED FOR BRAVERY. BACK OVER THE REMOTE LINE THROUGH\nTHE PUBLIC AODRESS SYSTEM CAME THE PROGRAM. A,MY FEA&S THAT A\nLARGE AUDIENCE IN AN OUTDOOR STADIUM WOULD NOT GIVE THEIR ATTENTION\nTO A ORAMATIC FEATURE OFFERING NOTHING FOR THE EYE WERE SOON DIS¬\nPELLED. The crowd received the highly sketch enthusiastically.\nMORE WORK. MORS PROGRAMS ON W H A\nWHA has expanded its broadcasting day to a schedule of 11J HOURS\nON WEEK-DAYS AND 6 HOURS ON SUNDAYS, OR 75 HOURS PER WEEK DURING\nTHE MONTH OF MARCH. AMONG THE SUNDAY PROGRAMS ARE THESE*. BACK¬\nGROUNDS of Today’s Events (Faculty commentary); Books I Like (Pro¬\nfessor Walter Aqard, Greek); Varsity Out (Alumni Program); Lncore\n(Selected week-day program repeated); University Forum (authority\nas speaker, audience present); Wisconsin Industry at War (Dramati¬\nzations of industry’s role today).\nIn addition WHA features good music such as university concerts and\nFEATUREb RECORDED WORKS.\nWAR EFFORT AT MICHIGAN UNDE FI ABBOT\nThe Bureau of Radio Broadcasting, University of Michigan, has a\nworkshop in speech, dramatics, and radio writing consisting of\n176 students, all of whom are concerned with the preparation of\nwar effort programs. Three of these series are aired weekly:\n\"UNITED FOR DEFENSE\" - DESCRIBED IN AN EARLIER\nissue of the News Letter.\n\"THE WILSON FAMILY\" - A PROGRAM DESIGNED TO SHOW\nTHE EFFECT OF THE WAR Ur>ON THE AVERAGE AMERICAN\nFAMILY.\n\"IT HAPPENED BEFORE\" - WHEREIN ARE SHOWN SITUATIONS,\nCRISES, AND PROBLEMS OF THE PRESENT WAR, AS LEAO UP\nTO BY PRECEEDI HQ EVENTS'.."
}