{
  "id": "d644-109",
  "text": "I\nMOHAWK-HUDSON COUNCIL ON EDUCATIONAL TELEVISION\nnUNKUN 4>INI\nHatch 50, LMl\nMia Kxcallency Malaon I* locktfiUtr\nThe Govern#r of Sow Toth\nAlbany, Sev York\nBoar Governor Kockafeller:\nX have Juat received a phono call from the Datleeal AaaoeUtlon\nof Educational Broadcasters In Heehlagton to the of foot that fallowing\ntha hoarlaga of tha House Xatoratato aad Fareign Caanarca Cowalttee on\ntao —pw «ui, ahoAmoN Aussie haa ’4ho Szzzzzzzs. zl\nfifty a tat aa to attayt to Aiaaovar tha extent of ooa4 fat aid to develep\neducational talaviaionathtlooa.\nAa Freeident of tha Mow fork ttata Educational Indio and Talaviaion\nAssociation, I rhonght X aught to tty to give yon a brlof pie tern of\ntho annd fat Federal half if -wa aro to nova ahead la tha vitally la-\nport ant araa of ednaational talaviaion.\nWith fifty-five ana Mum ratal, educational talaviaion atatloaa on tho\nair aarooa tho eoontry it la ha*d to hoi lava that Dev Toth ttata cannot\nhoaat of a atagla non-caaaarelal, educational talaviaion atation aa a\nreserved channal: It ia troa that thorn ia a OUF a tat ton in Buffalo,\nhat aa yon nay kaov, thia station ana owned by HBC, oaf aiaoa tho atatloa\noonld not ceupete with tho othor V*F atatloaa, HBC took it off tho air\nanil offered it aa a gift, to tha Hhatarn loo York kinaattonal Television\nAssociation.\nOf tho ton UHF channel a reserved for a in sat tonal talaviaion in Haw York\nttata not ~a single one has been activated. VOC Csaartijoionar Lea con\nto Albasy during tha recent Laglalatlve aoaaion and copyist nod pnhllcly\nahont this fact. Coil aa toner Lea ia* nor king toward tha non of all HI\nohonnala for television. As no neve closer to an all HIV pic tom them\nwche. on inya a«A. a»w orntm ieny«o« «— uid»i Sift- ««■■■! n «u4\novary likelihood that raaorvod educational taiovialen chaanala will Aava\nto ha given ep aa they have ia tha pant. .\nTha Hehank-Bedsee Council on ■dusstloaal Telovia ten hare in the QBpltsl\nDie trier hoe busy grant od e Bogente Charter permitting It to oyerato on\nChannel 17, one ef the ten channels. Although noth agefpoant has baton\nj aegeired ajifher throngh purchase or doantloo, tha CawaaAl Mill goods ■\neons tier eh la outside help la putting the station an tha air.\nthare am aonaails la Hatortowa and laehaator Hot am in various stages\nof ploaniag for an edncatienal talsvislee station to soma their sms.\nInteract la jgaay other areas of tho ttata la furthering ednaational tala-\nvlaian has hagaohona by tha naoherahip of enr atatovUo association.\n•tilth none outside help action would he tnkon very gulckly, X an carte la,\nin putting educational television stations on tha air."
}