{
  "id": "d644-135",
  "text": "Page 2\nNews letter\nre-deployment of teachers according to children's needs and teachers1\nabilities. Large-class instruction in some subject fields has released other\nteachers to give more time to smaller groups in basic needs, such as remedial\nreading, mathematics, counseling, increasing use of libraries, etc.\nDADE WILL CONSTRUCT ANOTHER STATION\nThe Dade County School Board is applying to the Federal Communications Commis¬\nsion for a permit to build and operate a second ETV station! Just not enough hours in the\nday for its one station -- WTHS, Channel 2 — to meet all the needs. Pittsburgh and\nOklahoma City Schools already operate two ETV stations in their areas.\nIN SEVEN COUNTIES OF THE PINELLAS-HILLSBOROUGH AREA, Director\nThomas Rothchild of the in-school instructional program broadcast by ETV station WEDU\nChannel 3, Tampa-St. Petersburg, says that among 27 schools in that area using educa¬\ntional television, there was a net instructional saving of $180, 000 last year and a class¬\nroom construction saving of $430, 000.\n\"With educational television, \" he sums up, \"we can teach more children more\neffectively -- and save money doing it! \"\n(Of course TV does NOT -- and cannot -- \"replace\" classroom teachers. It simply\nhelps them do an even better job, by providing them with \"a transparent blackboard\"\nthrough which they can bring the whole world to their students; by giving them more time\nfor small-class or even individual instruction where needed; and by demonstrating that\nthe job they do deserves greater prestige and income. School enrollments will continue\nto increase so rapidly that Florida could train and employ teachers at twice the present\nrate -- and still not be able to do the public education job satisfactorily unless effective\nuse of TV helps with the task. )\nOTHER THINGS WHICH ETV IS DOING:\n-- providing small county school systems with good instruction in some fields in\nwhich the counties cannot find, or cannot afford to pay, the most competent\ninstructors;\n-- distributing the skill of the specially gifted teacher to many times as many\nstudents as she could teach in a single classroom;\n-- enabling classroom presentation of many resources and demonstrations which\ncould not otherwise be provided;\n-- giving opportunity for fast learners to move at a pace commensurate with their\nabilities, and providing, at lower cost, the repetition necessary for slower\nlearners.\nPLANS FOR THE EXTENSION OF ETV IN FLORIDA\nThe ETV Commission and the STATE DEPARTMENT OF EDUCATION will soon\nannounce plans for submission to the 1961 Legislature for proposed extension of ETV\nservice to more county school systems and public institutions of higher learning.\nAmong other proposed extensions, the ETV Commission is working with a recently"
}