{
  "id": "d644-194",
  "text": "Louisville\nWhen the first station of the network is ready to begin telecast¬\nings, Jefferson County and Louisville public schools will have had at least\nsix years of ETV experience. The Louisville metropolitan area is large\nenough and has enough educational resources to continue its relative self-\nsufficiency of ETV production. Both the State network and the Jefferson\nCounty effort can be aided, however, by bringing the two into some kind\nof close working relationship.\nA relatively modest investment of about one-half of the cost\nof the originating facility and transmitter at Bowling Green or Murray\nshould enable WFPK in Louisville to increase its coverage significantly\nand to acquire the equipment and space necessary to upgrade further the\nquality of programming. Jefferson County should be linked into the micro-\nwave system early in the network's development. The network could have\nthe benefit of Jefferson County’s experience and resources; Jefferson\nCounty could be relieved of some of the burden of program effort and cost.\nMo re he ad\nTechnical problems, population shifts, and other factors sug¬\ngest that an originating facility at Morehead probably should not be built\nsooner than from three to five years after development of the network\nbegins. Were adequate means of transportation available, Morehead would\nbe a natural place for development of regional programming for Eastern\nKentuckyAt present, however, Richmond or even Lexington can be\nreached more easily from most of Eastern Kentucky than can Morehead,\nThe resources of the State College and of the nearby school\nteachers there should be utilized as well as possible, but, outside of the\nAshland area, the region does not seem to have the growth potential of\nother areas that will have originating facilities earlier.\nThe Microwave System\nA microwave system uses radio signals of frequencies that can\nnot be received in house radios. It is a series of very specialized trans¬\nmitters and receivers that send and receive a beam almost like that of a\nflash light. A signal is sent out from the first tower in the system; the\nsignal is received on a tower from 20 to 40 miles away. The signal is\ngiven a boost in power and sent on to the next tower. At the end of the line\nthe signal can be changed back into what it was at the other end of the line.\n-10 -"
}