{
  "id": "d644-199",
  "text": "General Manager\nBoards or commissions are not suitable instruments for day-to-\nday administration. They usually operate through a single executive. A\ngeneral manager or executive director should have the responsibility for\ndetails of continuing administrations, subject to the over-riding power of\nthe commission. The position of general manager requires an adminis¬\ntrator rather than ah expert in either television or education, although he\nmust believe deeply in the value of ETV. This person would have to deal\nwith experts in television and education as well as with other state agencies\nand his own commission. , He must be a person of considerable ability. An\nacquaintance with educational television and some experience with education\nare quite desirable but may not need to be the determining considerations.\nChief Engineer\nWorking directly under the authority of the general manager\nshould be a chief engineer who would provide the basic technical know¬\nledge necessary for planning. The chief engineer would be in over-all\ncharge of the engineering function at production, transmitting, and inter¬\nconnecting facilities. He would be the expert who would prepare or super¬\nvise the preparation of technical engineering data for the use of the Kentucky\nETV commission and of the Federal Communications Commission when\nthe Kentucky commission had dealings with it. Although extensive engi¬\nneering experience in commercial television work would be adequate for\nthis man, experience in educational television work might be more valuable\nbecause rather significant variations may exist in approach to solution of\nengineering problems between educational and commercial television\nsystems. i-,iJ\nEducational Director\nAn educational expert should be employed who would be respon¬\nsible for the educational programming of the network. Florida uses a\n\"Task Force\" made up of prominent educators which travels to the ETV\nproduction centers in that state, finds out what each of the relatively\nindependent stations plans to produce, and then arranges for the video¬\ntaping of courses that appear to meet the most frequently expressed educa¬\ntional needs of the state. The main weakness of this system is that it\nprovides ofr no one person to whom dissatisfied people can look for changes.\nResponsibility is diffused. The task of programming should be a full-time\njob.\nIn order to assure that personal or arbitrary considerations do not\ndictate the choice of programs to be telecast, the educational director should\nbe required to consult with an advisory body made up of several recognized\npractitioners from each level of education. The Department of Education,\nthe University, the State Colleges, elementary teachers, and secondary\nteachers should all be represented here.\n- 15 -"
}