{
  "id": "d644-207",
  "text": "One of the best methods of communicating is to have the TV\nteacher visit classrooms using her lessons. She can talk to the class¬\nroom teacher and to students, thus seeing first hand the actual results of\nher work. Video-taping of some of her lessons would allow her to do this.\nReceiving Educational Television\nReceiving the Signal\nQuality of picture received is even more important for use of\nTV in the schools than for home consumption of commercial TV. Some of\nthe most important applications of TV for education include showing small\nobjects, as in physics, or pointing out distinctive features or markings,\nas in biology classes. If these things cannot be done, the usefulness of tele¬\nvision as a teaching tool is greatly reduced.\nStated most simply, the quality of picture received may be af¬\nfected by what happens at three different stages of the chain. The signal\nthat is transmitted, what happens to the signal between the transmitting and\nreceiving ends, and what happens to the signal at the receiving end are the\nthre6 basic components of the chain.\nThe Transmitted Signal. This network will use UHF channels rather than\nVHF. UHF is less subject to interference than is VHF. Under good con¬\nditions, UHF can provide a better picture to close-in receivers than VHF.\nThis plan assumes that only high quality equipment will be used. For\nexample, programs that should be sent over the network should be televised\nby image orthicon cameras rather than vidicon. Also, care should be taken\nthat industrial-type cameras are not used for local programming.\nBetween Transmitter and Receiver. The hilly and mountainous terrain\nfound in large ar^as of Kentucky will cause reception problems. In part\nthis is related to the use of UHF rather than VHF channels. Transmitting\nand receiving UHF signals for channels 14 through about 35 are more efficient\nthan for channels between about 35 and 83. The use of the lowest UHF chan¬\nnels possible, therefore, is highly desirable and has be«n a guideline in this\nproposal.\nFor the microwave system, high quality equipment is necessary\nto prevent loss of quality in the signal as it \"hops\" throughout the state.\nReduction in signal quality at one point will lower quality at all subsequent\npoints.\n- 23 -"
}