{
  "id": "d644-220",
  "text": "SENATE COMMITTEE ON GOVERNMENT OPERATIONS\nSTAFF MEMORANDUM NO. 87-1-48 July 20, I96I\nSUBJECT: To Amend the Federal Property and Administrative Services Act of\n1949, so as to permit donations of surplus property to new\ncategories of eligible donees.\nThere have been a number of bills introduced in the 87th Congress and\nreferred to this committee to date, proposing the extension of the Federal donable\nproperty provisions of the above cited Act to other public organizations and groups\nwhich are not now eligible. These proposals include S. 53 (Indian tribes); S.648\n(certain educational institutions); S. 688 (New Mexico Boysr Ranch); S. IO69\n(certain welfare agencies); S. II36 (educational extension activities conducted\nthrough 4-H Club organizations); S. 1687 (educational activities conducted by non¬\nprofit organizations providing educational or occupational training for mentally\nretarded children); S. 1811 (park or recreational and historic-monument purposes);\nS. 2119 (Schools for mentally retarded and physically handicapped, educational TV;\nstations and public libraries); and S. 2173 (Fish and Wildlife management activi¬\nties). There are also a number of similar proposals pending before the House\nCommittee on Government Operations proposing the extension of the Act to other\ngroups.\nThe following reports have been submitted to the Chairman of the Committee\nby the Bureau of the Budget, cn S. 648 and S. IO69, two of the bills referred to\nabove, which set forth the general views of the present Administration on all such\nproposals. Copies of these letters are being furnished to members of the committee\nand sponsors of the above listed bills, for their information.\nEXECUTIVE OFFICE OF THE PRESIDENT\nBUREAU OF THE BUDGET\nWashington, D.C.\nApril 19, 1961\nHonorable John L. McClellan\nChairman, Committee on Government Operations\nUnited States Senate\nWashington 25, D. C.\nMy dear Mr. Chairman:\nThis is in response to your requests for a report on S. 648, a bill \"To\namend the Federal Property and Administrative Services Act of 1949 so as to permit\ndonations of surplus property to certain educational institutions.\"\nThe principal effect of S. 648 would be to redefine existing authority for\ndonations of surplus personal property for educational purposes to permit donations\nto \"other educational institutions\" which would include public libraries and other\ntypes of activities which might come to be considered educational institutions.\nAt present surplus real property may be transferred to libraries but surplus\npersonal property may not be donated to a library unless it is part of a school,\ncollege, or university.\nWe would not object to the inclusion of libraries among eligible recipients\nof surplus personal property but would be opposed to the term \"other educational\ninstitutions\" as contained in S. 648. That term is so broad and general that we\nbelieve difficult questions would arise concerning the eligibility of numerous\norganizations whose programs include some incidental elements of education or\ntraining, although they exist primarily for recreation, entertainment or other\npurposes concerned with personal or local community interests. Although many such\norganizations serve useful purposes in a community, we question whether Federal\nproperty should be made available to them on a donation basis.\nIf amended to redefine \"educational purpose\" to include a library, S. 648\nwould still be clearly distinguishable from the numerous bills to enlarge the\ndonation program by adding new categories of eligible donees, such as volunteer\nfire departments, municipal corporations, mosquito control districts, and various\nlocal agencies. Donations for educational purposes have been authorized for many\nyears and legislation adding libraries to the list of eligible donees would not\nconstitute a new type o'r category of purpose for which donations would be\nauthorized.\nWe wish to reaffirm our opposition to any general or piecemeal expansion of\nt he donation program to include additional categories and purposes. Disposal of\nFederal surplus property is a very difficult administrative task and further"
}