{
  "id": "d644-225",
  "text": "Page 2\nJ. Arthur Younger\nI do not have the competence to tell you how the Federal government should\nspend its money, so I do not urge you to vote for this measure. I can only\ntell you from my knowledge of what educational television facilities are\nenabling schools to do, that such facilities are going to be of tremendous\nimportance to helping our schools do the job we need them to do in the years\nahead of us. Many schools will be unable to acquire the capital funds to\nconstruct the facilities they need without help from somewhere, and t may be\nthat Federal help s what is needed. Operating funds are generally not an\nInsurmountable problem, for many schools are providing the operating funds\nto support these stations, out of fthe savings in Instruct onal costs which\ntelevision broadcasting makes possible.\n£\n'p^jhir station derives 2/3 its operating support from the public school districts\nof the area which make payment of $1.00 per student per year to the University .\nThe $130,000 from these sources is supplemented #by $65,000 from the University\nrof Washington and additional funds from Seattle University, Seattle Pacific\nV^jCollege and the Seattle Public Library. We have been in operation for more\nthan 6 years, but had not the Fund for Adult Education given us an initial gift\nof $150,000 to purchase capital equipment items, it is quite possible that even\n/p^this community would not have developed such a station. After the initial seed\nisoney from the Fund for Adult, the community itself provided amother $400,000.\nA small amount of help from the Federal government might stimulate a large\nnumber of presently un-served areas to develop stations.\na:\nI would appreciate your taking a good look at the measures when they come\nbefore your full committee (the legislation has been recommended to the\null committee by the sub-committee) to see if you can support them.\nst personal regards.\nLoren B. Stone\nManager KCTS-TV"
}