{
  "id": "d1330-1",
  "text": "NAEB NEWS LETTER .. June 1, 194?, .. Page 2\nas a result of which it has been concluded that change in rules in\neither case would not be in the public interest However, a request\nmade by any individual licensee of a noncommercial station to remain\nsilent or reduce hours of operation during certain periods under\nSection 1.365, supported by appropriate showing for the need there¬\nfor, will be given” due consideration. Such request may be made in\nletter form.\n\"With respect to modification of the requirements relative to the\nannouncement of records, the Commission has on several occasions\nin recent months reviewed this subject, and while in some cases\nthe existing requirement may make for awkward announcements, other\nreasons are considered to outweigh this objection.\"\nDo you have any comments? Any advice to give your Executive Committee,\nor Executive Secretary?\nNEW PROGRAMS AT KENTUCKY\nAll of the wealth, tradition, and color of the Kentucky mountains\nand its people will be revealed in a new series of weekly thirty-\nminute broadcasts over the coast-to-coast network of the Mutual\nBroadcasting System, to be presented on Saturdays, 1.00 to 1.30 p.m.,\nCDST starting June 7.\nThe series, entitled \"From, the Kentucky Mountains\" will be a presenta¬\ntion of the University of Kentucky radio studios in Lexington, which\nwill originate the program through Mutual»s Lexington affiliate, WLAP.\nCombating the more spectacular impressions of the Kentucky hills,\nwhich have been pictured as a rendezvous of moonshiners, snake-\nworshipers, child marriages, and feuds, the \"From the Kentucky\nMountains\" broadcasts will picture this area as it really is. Per¬\nformances will be made of the traditional ballads, many of them of\ndirect Scotch, Irish, Welsh and English origin; dramatizations\nwill be produced of the topical writings of mountain authors? and\nthe other numerous contributions of the southern Appalachian area\nto the culture of the country as a whole, will be illustrated.\nInteresting mountain people will be Invited to participate and talk\nto the \"outside world.\"\nThe series will be directed by Ben Russak, formerly of New York City,\nwho has produced the \"Story Behind, the Ballad\" series and other\nUniversity of Kentucky network shows.\nThe role of a modern state university in national defense activity\nwill be graphically portrayed by the University of Kentucky in a\nseries of weekly thirty-minute broadcasts on Saturdays, 12.00 to\n12.30 p.m., also starting June 7. The programs will originate on\nthe U.K. campus in Lexington and will be broadcast by UHA, Louisville*\nFCQ ACTIONS\nChicago Board of Education has applied for construction permit for a"
}