{
  "id": "d1215-3",
  "text": "-4-\nN-A-E-B MEMBERS AT WORK\nUNIVERSITY OF TEXAS, AUSTIN\nThe University reports that it now is carrying on an extensive program of\nbroadcasting over all Texas stations as well as state networks. It is estimated\nthat some 700 \"broadcasts per year are offered. Radio House, the campus \"broad¬\ncasting center, was established in 1938, and has two studios with complete\nproduction facilities. Thomas D. \"Tom'1 Rishworth is Director of Radio House and\ncoordinator of radio. Courses leading to a B-.A. are offered. Some 200 students\nare enrolled. Hopes for an I’M station for Texas are expressed,\nADD IIEP I ANA STATE TEACHERS COLL RGB TO LIST\nDespite the fact that Indiana State Teachers College was not named on the\nmembership list in the October News-Letter that institution is and has long\nbeen an 1TAEB member in good standing. Our apologies to’’The Hoosier Schoolmaster\nof the Air\" Morgan for this omission. ISTC is actively engaged in broadcasting\nover the Terre Haute station WBOW.\nWISCONSIN’S SCHOOL OR THU AIR 3EG-IITS ITS 17TH YEAR\nWisconsin’s educational broadcasting fare for fall featm’es carefully\nplanned program series, ranging from ’’Rhythm and Games” for the kindergartener\nto college-level programs for adults.\nThe Uisconsin School of the Air, which started its 17th year on September 22,\nprovides 10 weekly programs for in-school listening. The College of the Air,\nwhich began its 15th year this fall, presents lectures from two regular univer¬\nsity courses and seven series of studio programs. The educational broadcasts\noriginate on the Madison campus and are carried by State Station WHA in Madison;\nall of the programs except the two university courses are also carried by the ,\nState’s WLBL at Stevens Point. Wisconsin’s centennial celebration is coming ug),\nand the School of the Air will be keyed to the 100-years story, according to\nthe school’s director, H. B. McCarty.\nWDTR — DETROIT, MICHIGAN, BOARD OR EDUCATION\nDetroit’s radio work has long attracted attention, but only recently has\nthe school system acquired its own PH station.\n(Address; 9345 Lawton, Detroit, Michigan)\nWBGO — NEWARK, N.J., BOARD OF EDUCATION\nWBGO, Newark’s school station is about to go on the air with\nWilliam (Bill) R. Pfeiffer as Supervisor of Radio. The station is rendering\nan expanding service to classrooms in the city, and is developing its general\npublic service features. Bill was formerly on the staff of WHA, University of\nWisconsin, so is no newcomer to educational broadcasting."
}