{
  "id": "d1215-6",
  "text": "-7-\nWDTR - The Board of Education of the City of Detroit, Detroit, Michigan -\nModification of construction permit (B2-FED—34, as modified), which authorized\na new non-commercial educational station for extension of completion date.\nKCBW - Santa Monica School Board, Santa Monica, California - Modification\nof construction permit (B5-PED-66, as modified), which authorized a new non¬\ncommercial educational Broadcast station, for extension of completion date.\nWES - Technical High School, Dade County Board of Public Instruction,\nMiami, Florida - Modification of construction permit (B3-PED-79, which authorized\na new noncommercial educational Broadcast station) for extension of completion\ndat e.\nWKR-FM - City of Dallas, Texas, Dallas, Texas - Modification of construction\npermit (33-PH-1028, which authorized a new EM Broadcast station) for extension\nof completion date.\nThe Hinson Memorial Baptist Church, Portland, Oregon - Granted request\nto vacate its construction permit and dismissed application (BPH-1131).\nnoncommercial Educational Applications Accented for Piling\nWUOA - The Board of Trustees of the University of Alabama, Tuscaloosa, Ala.-\nModification of construction permit (BPED-83, which authorized a new noncommercial\neducational Broadcast station) for extension of completion date.\nHEW - State of Wisconsin-’State Radio Council, Madison, Wisconsin (P.0.\nRadio Hall, University of Wisconsin Campus, Madison, Wisconsin) - Construction\npermit for a new noncommercial educational PM Broadcast station to Be operated\non Channel 204,88.7 me.\nHEW - Lewis College of Science and Technology, Chicago, Illinois - (P.0.31 E.\nCongress St.) - Construction permit for a nev; non-commercial educational FK\nBroadcast station to Be operated on frequency to Be assigned By PCC, and power\nof 52.2 HUM\nACTIOUS (Amplitude Modulation)\nrTCAL - St. Olaf College, Horthfield, Minnesota - Granted modification of CP\nfor extension of completion date to 1-25-48. (BMP-3262)\nKSAC - Kansas State College of Agr., etc., Manhattan, Kansas - Granted\nlicense for increase in power, installation of new transmitter and vertical\nantenna and change in transmitter location (BL-2707)\nWHBQ, - Harding College, Memphis, Tennessee - Granted petition for leave to\namend itq application (BP-5405; Docket 8047) to revise proposed daytime direction¬\nal array accepted said amendment.\nWRUF - University of Florida, Gainesville, Florida - Granted CP to change\nhours of operation, from L-KOA to unlimited, install new transmitter and Hi\nfor night use, and change transmitter location; engineering conditions (BP-4682)"
}