{
  "id": "d1215-9",
  "text": "-10-\nCONCRATULATIONS TO BBC — 25 YEARS 0? SEP.VI CS\nThe British Broadcasting Company, founded November 14, 1S22 this year\ncelebrated its Silver Jubilee, The national Association of Educational\nBroadcasters in a special telegraphic message extended its official congratular-\ntions to another organization engaged entirely in public service.\nTYLER QEEICIAh N-A-E-B OBSERVER TO UNESCO\nDr. I. Keith Tyler, director of radio at Ohio State University, was\nappointed official observer and representative for the national Association of\nEducational Broadcasters at the Mexico City meeting of UKESCO, november 11-13.\nTyler, who is in charge of the Institute for Education by Radio, recently\nreturned from a similar tour of the American Zone in Germany as an educational\nobserver for the War Department.\nTyler represented 70 universities and public service agencies who operate\nor use the facilities of non-commercial educational radio stations in the\nUnited States.\nTFE- LABOR MART\nTOTTED ...WRITERS! One continuity writer.. $2400 and one script writer $1800.\nThese people may work on degrees at same time. Write Ralph Steetle,\nRadio WLSTJ, Louisiana State University, Baton Rouge, La.\nTOTTED .. Script writer for Washington State College. Write John L. Blake,\nRadio ICWSC, Pullman, Washington.\nWANTED... Program director for new EM Station at prominent university. Salary\n$4500. Qualifications required: both commercial and educational\nstation experience. The university requests its name not be stated.\nPlease refer requests to Executive Secretary, Morris S, Novik.\n30 Rockefeller Plaza, New York City.\nMORE RADIO STATIONS—MOPE BUSINESS??\nThe Eederal Communications Commission, in the first of a series of tabu¬\nlations of 1946 financial data reported an 8.5$ decline in aggregate broadcast\nincome for 1946 from the 1945 figures.\nThe tabulation showed a rise of nearly 8$ in broadcast income, but pointed\nout that this increase was overshadowed by a 14$ rise in broadcast expenses.\nThe ECC figure^ for broadcast income in 1946 were $76,466,246. This figure\nrepresents net incomeoefore payment of federal income taxes. The total income\nfor 8 networks (four nation-wide’ and 4 regional) and 1,025 stations was\n$322,552,771. Total broadcast expenses were $246,086,525,\nThe 8$ increase in business last year was attributed by the ECC tabulation\nto the rise in total numbers of standard stations on the air from 901 to 1,025."
}