{
  "id": "d573-100",
  "text": "President Baxter\nPage 2\nJuly I?, 1956\nBy recent action of the MAEB Executive Committee new members are allowed\nto join the network without paying the full assessment fee. A graduated\nscale has been set up whereby new stations do not pay the full fee until\nthe third year# Annual Network assessments are based on the same power\nclassifications as membershipt\n1st year 2nd year 3rd year\nClass A rOTT'OTT FOTOTT fBfflKUCT\nClass B 250.00 375*00 500.00\nClass C 150.00 225*00 300.00\nIn addition, member stations must pay postage both ways on t apes shipped\nto and from the Network. For a station in your area this would amount\nto approximately $ 120.00 per year if you availed yourself of all the\nprograms made available by the Network. (There is a strong possibility\nthat there will soon be Congressional action to lower rates for educational\nrecordings, which would make postage payments considerably lower.) Even\nwith the postage charges you see that the cost per hour of programming\n(for U00 hours, or more) is very low.\nIn addition to the regular Network service described above (a sample\nNetwork offering is included in the material being sent separately),\nwe make available in-school programs to those stations who do in-school\nbroadcasting* for this service a station pays an additional fee of one-\nfourth of the re ular assessment, or 2.00 per reel, whichever is less.\nHowever, since many in-school stations are not on the air during the\nsummer months, such stations are allowed to substitute the in-school\nprograms for regular programs they would receive during the summer, and\nthus pay no additional fee for the in-school service. If a station owned\nand operated by a school or school systeji prefers to subscribe to only the\nin-school programs, they may do this undp* a modified agreement. In this\ncase, the station gets all in-school programs, plus one hour a week from\nthe regular* Network offerings, for half the fee they would normally pay\nfor the full service. Of course, the conditions regarding postage payments\nremain the same.\nIf, alter you’ve had an opportunity to look over the materials I’m sending,\nyou have any questions about the NAEB, please let me know, and we’re\nlooking forward to the opportunity of serving you.\nSincerely,\nHEHimk\nEnclosures 3\nHarold E, Hill\nAssociate Director"
}