{
  "id": "d573-67",
  "text": "July 17, 1956\nDirector of Radio\nStation KGAC-AM\nGustavus Adolphus College\nSt. Peter, Minnesota\nDear Sir*\nWe are very pleased to see that your institution has been granted a\nCP for a new educational station. The forces of educational broadcasting\nare growing stronger every day, and, as the association of educational\nstations in the United States, we feel that you will be interested in\nlearning something about our organization and the services it provides\nto members. Incidentally, better than 90$ of all educational radio and\ntelevision stations in the United States belong to the NAEB.\nI am enclosing some material which will give you more details about the\nAssociation, and under separate cover am sending samples of the r ports,\nsurveys and other services we regularly make available to member stations.\nAnnual dues in the Association, including a subscription to our monthly\nNewsletter and the above mentioned materials, are based on rated trans¬\nmitter 'power, as follows*\nClass A - 5 kw and over - $50.00\nClass B - 1 - h*9 kw - 25*00\nClass C - Less than 1 kw- 15*00\nIn addition to the above, member stations enjoy the benefits of our\nPlacement Service, legal counsel, help in meeting day-to-day problems,\nthe opportunity to meet, in seminars, conferences and conventions, with\nother educational broadcasters to consider mutual problems, and, for the\npayment of an additional assessment fee, the use of our tape network.\nThe NAEB Network, which distributes over U00 hours of programming, via\ntape recording, per year, is open only to members of the Association.\nThrough the Network you have an opportunity to broadcast some of the best\neducational programs from all over the country as well as a chance to\nhave some of your better pro rams receive wider distribution. In addition,\nbeing able to rely on the Network for eight or more hours of programming\nper week permits your staff to spend more time on the development of\noutstanding programs.\nI$r recent action of the NAEB Executive Committee new members are allowed\nto join the Network without paying the full assessment fee. A graduated"
}