{
  "id": "d573-80",
  "text": "President Darden\nPage 2\nAugust 6, 1956\nBy recent action of the IMAEB Executive Committee new members\nARE ALLOWED TO JOIN THE NETWORK WITHOUT PAYING THE FULL ASSESS¬\nMENT FEE# A GRADUATED SCALE HAS BEEN SET UP WHEREBY NEW STATIONS\nDO NOT PAY THE FULL FEE UNTIL THE THIRD YEAR, ANNUAL NETWORK\nASSESSMENTS ARE BASED ON THE SAME POWER CLASSIFICATIONS AS\nMEMBERSHIPS\nClass A\nClass B\nClass C\n1st year\nUtoo.oo\n250,00\n150.00\n2nd year\nISbb*So\n375.00\n225.00\n3rd year\nW00Y00\n500.00\n300.00\nIn addition, member stations must pay postage both ways on tapes\nshipped to and from the Network. For a station in your area this\nWOULD AMOUNT TO APPR0X IMATELY ^90.00 A YEAR IF YOU AVAILED YOUR¬\nSELF OF ALL THE PROGRAMS MADE AVAILABLE BY THE NETWORK. (THERE\nIS A STRONG POSSIBILITY THAT THERE WILL SOON BE CONGRESSIONAL\nACTION TO LOWER RATES FOR EDUCATIONAL RECORDINGS, WHICH WOULD MAKE\nPOSTAGE PAYMENTS CONSIDERABLY LOWER.) EVEN WITH THE POSTAGE CHARGES\nYOU SEE THAT THE COST PER HOUR OF PROGRAMMING (FOR i|00 HOURS, OR\nMORE) IS VERY LOW.\nIn ADDITION TO THE REGULAR NETWORK SERVICE DESCRIBED ABOVE, (a\nsample Network offering is included in the material being sent\nseparately), we make available in-school programs to those sta¬\ntions WHO DO IN-SCHOOL BROADCASTING. FOR THIS SERVICE A STATION PAYS\nAN ADDITIONAL FEE OF ONE-FOURTH OF THE REGULAR ASSESSMENT, OR $2.00\nPER REEL, WHICHEVER IS LESS, HOWEVER, SINCE MANY IN-SCHOOL STATIONS\nARE NOT ON THE AIR DURING THE SUMMER MONTHS, SUCH STATIONS ARE\nALLOWED TO SUBSTITUTE THE IN-SCHOOL PROGRAMS FOR REGULAR PROGRAMS\nTHEY WOULD RECEIVE DURING THE SUMMER, AND THUS PAY NO ADDITIONAL\nFEE FOR THE IN-SCHOOL SERVICE. IF A STATION OWNED AND OPERATED\nBY A SCHOOL OR SCHOOL SYSTEM PREFERS TO SUBSCRIBE TO ONLY THE IN¬\nSCHOOL PROGRAMS, THEY MAY DO THIS UNDER A MODIFIED AGREEMENT. IN\nTH IS CASE, THE STATION GETS ALL IN-SCHOOL PROGRAMS, PLUS ONE HOUR\nA WEEK FROM THE REGULAR NETWORK OFFERINGS, FOR HALF THE FEE THEY\nWOULD NORMALLY PAY FOR THE FULL SERVICE. OF COURSE, THE CONDITIONS\nREGARDING POSTAGE PAYMENTS REMAIN THE SAME.\nIf, AFTER you’ve HAD AN OPPORTUNITY TO LOOK OVER THE MATERIALS\nI’m SENDING, YOU HAVE ANY QUESTIONS ABOUT THE NAEB, PLEASE LET\nME KNOW, AND WEfRE LOOKING FORWARD TO THE OPPORTUNITY OF\nSERVING YOU.\nSincerely,\nHEHsmk\nEnclosures 3\nHarold E. Hill\nAssociate Director"
}