{
  "id": "d439-32",
  "text": "Release August 24, 1953\nFrom National Association of Educational Broadcasters\n14 Gregory Hall\nUrbana, Illinois\nURBANA, ILLINOIS — The National Association of Educational Broadcasters\nannounced today the names of the successful candidates for the two intensive\neducational television study sessions to be held late in August and early in Sept¬\nember. This announcement was made in a joint release from Graydon Ausmus, presi¬\ndent, and Harry J. Skornia, Executive Director, of the NAEB.\nCandidates selected to be NAEB Fellows for the Educational Television\nProduction Workshop to be held at the University of Illinois, Urbana, from August\n28 to September 18 are as follows:\nGale R. Adkins, Acting Director of Radio-Television, University of Texas,\nAustin;\nJ. Larry Beauchamp, Program Director, Purdue University, Lafayette, Ind.;\nWilliam K. Gumming, Producer-Director, Michigan State College,East Lansing\nMarguerite Fleming, Station Manager, KSLK, St. Louis Board of Education,\nSt. Louis;\nJohn H. Glade, Producer, Purdue University, Lafayette, Ind.;\nWilliam Gulley, Station WUNC, Consolidated University of North Carolina,\nChapel Hill, N.C.;\nWarren A. Kraetzer, Director, Office of Radio-TV, New York University,\nNew York;\nMarie Scanlon, Supervisor, Radio and TV, Newark Board of Education, Newark\nNev; Jersey;\nKarl F. Schmidt, Program Manager, WHA, University of Wisconsin, and TV\nProduction Development, Staff Member, Madison, WLs.;\nHazen J. Schumacher, Jr., Supervisor of Production, University cfMichigan,\nAnn Arbor;\nHerbert Seitz, Head of TV Production, Indiana University, Bloomington;\nFrancis P. Tobolski, Asst, to Supervisor of Radio-TV, Illinois Institute\nof Technology, Chicago, Ill.;\nEvelyn Walker, Coordinator of Radio and TV for Birmingham Public Schools,\nBirmingham, Ala.;\nWalter Whitaker, Program and Production Director, University of Alabama,\nUniversity, Ala.;\nWolfgang Kuhn, Chairman of Radio-TV Committee, School of Music, University\nof Illinois, Urbana.\nThe Workshop will be in charge of Rudy Bretz, Croton-on-Hudson, N.Y., and\nProfessor Edward Stasheff of the University of Michigan. Professor Richard Rider,\nDirector of Television for the University of Illinois, will serve as coordinator.\n-MORE"
}