{
  "id": "d439-41",
  "text": "(Proposed)\nNEWLURELKASE: FROM NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS, URBANA, ILLINOIS\nFor Release November 23 (?), 1953\nFourteen graat-in-aid awards for from $700.00 to $9*000.00 each were announced today\nby Harry J. Skornia, Executive Director of NAEB. The smallest grant went to George\nWashington University, Washington, D. C. for a series of weekly radio news programs\nemanating from the nation* s capitol. The largest grant was to the University of Nebraska\nfor a series of 39 half-hour recorded Television programs explaining the significance\nof the great plains area to American history.\nAll grants were made possible by a gift from the Educational Radio and Television\nCenter, A’Ji Arbor, Michigan. This is the second year the NAEB has handled such grants-\nin-aid. Programs resulting from the 1953 series of grants-in-aid are soon to be re¬\nlease nationally by the NAEB Tape Network and through the educational television\nstations of the country.\nGrants in each instance are intended to help the institution requesting funds to do\ni significant series which it could not accomplish on its own resources. As the announce¬\nment of the grants states, \"these grants are intended to provide that key person or key\nthing which is needed to enable you to do a good content-oriented program series.\"\nInstitutions awarded grants follow: In radio, Alabama College, University of Chicago,\nIowa State College, University of Massachusetts, Michigan State College, University of\nNorth Carolina, State University of Iowa, and George Washington University of Washington,\nD.C. In television: University of Nebraska, New York University, St. Louis Board of Edu¬\ncation, Stanford University, University of Illinois, and the University of Wisconsin.\nDetails on the individual awards in Radio follow: Alabama College, Montevallo, Alabama—\n$1,800.00. This will enable Alabama College to do a series of 26 half-hour organ\nrecitals on one of the finest organs in the country and with one of the country® s"
}