{
  "id": "d439-9",
  "text": "Reprint\nFOUR MSB SERIES AIDED BY FORD FOUNDATION\nTHE CHRISTIAN SCIENCE MONITOR\nTuesday, December 30, 1952\nRECORDS - RADIO - TV\nNew York\nThis fall and winter the National Association of Educational Broadcasters\nhas been demonstrating the caliber of radio program schoolmen can produce with\nfundsto match their aspirations.\nThe results have been, on the whole, impressive.\nOfficials of the Ford Foundation’s fund for adult education, which granted\nthe NAEB $300,000 for radio programming, should be encouraged by the way things\nhave been going.\n« « * *\nIn the past four months, the NAEB has launched the following four series:\n\"THE JEFFERSONIAN HERITAGE\" - A 13-week, half-hour series dramatizing Jefferson’s\nideas, with Claude Rains playing the American patriot. Even before the 13 pro¬\ngrams had run their course on most of NAEB’s 82 tape network stations, more than\n100 commercial outlets had applied for the series, which is being made available\nat a nominal fee. The only stipulation is that there foust be no commercial\nsponsorship.\n\"VOICES OF EUROPE\" - One hundred half-hour interviews (20 have been prepared so\nfar) with a great many Europeans on a wide variety of subjects. The interviews\nare conducted by Milton Mayer, a United States author, broadcaster, and lecturer,\nwho is now professor of social research at the University of B’rankfort.\n\"PEOPLE UNDER COMMUNISM\" - Seven one-hour shows, 13 half-hour lectures, and one\nhalf-hour documentary. The over-all purpose of this series is to provide an\nauthoritative insight into the strength and weaknesses of the Soviet Union.\n\"THE WAYS OF MANKIND\" - Thirteen half-hour programs aimed at helping the listener\nunderstand the behavior of his fellow men in various times, places, and environ¬\nments.\nThe fundamental objective of these NAEB-sponsored programs is to apoeal to the\nlistener with offerings of first-rate professional quality backechup by conscien¬\ntious scholarship. Thus, \"The Jeffersonian Heritage\" was written, produced,\nand directed by experienced radio men and was based on \"the research, writing\nand advice\" of Prof. Dumas Malone of the department of history, Columbia University"
}