{
  "id": "d1810-1",
  "text": "Engineering Society is being held at the New Yorker\nHotel September 29 - October 4 in conjunction with\nthe New York High Fidelity Show and the Audio\nEngineering Show. Some NAEB technical personnel\nregularly attend this event, which is usually held in\nNew York City the first part of October. A full five-\nday program of papers on audio subjects has been ar¬\nranged covering stereo, acoustics, magnetic tape and\nrecording techniques as well as new devices, measure¬\nments, standards, speech input equipment and loud¬\nspeakers. The program looks interesting—hope\nsomeone who attends will give us a report.\n—NAEB—\nWe hope to see many of our readers at the NAEB\nConvention in Omaha, October 14-17. Jack McBride\nand his committee have been busy arranging a varied\nand worthwhile program.\n—NAEB—\nThe week following the NAEB Convention, the\n84th SMPTE Convention is being held at the\nSheraton-Cadillac Hotel in Detroit. The October\n22nd and 23rd sessions are of prime interest to ETV\npersonnel. Wednesday morning (the 22nd) the gen¬\neral topic is television equipment and practices, while\nthat afternoon kinescope recording problems and\nequipment will be discussed'. The Thursday evening\nsession (the 23rd) is given over to closed-circuit\ntelevision for teaching, and educational, military\nand medical applications of closed-circuit systems\nwill be described. The Thursday morning topic is\nmachine language translation, while that afternoon\nthe general topic is designing for international tele¬\nvision where eventual contributions towards auto¬\nmatic translations and international standards will\nbe discussed.\n—NAEB—\nBefore we bring this column to a close perhaps\nwe should include a couple of technical tips, since\nthat’s our heading; so here they are:\nFactors for good vidicon performance.\n1. Plenty of light.\n2. Flat lighting.\n3. Reasonable target temperatures.\n4. A good camera.\na) Low noise input.\nb) Linear scanning.\nc) Aperature correction.\nd) Gamma correction.\ne) Stability and reliability.\nMany times the company which is endeavoring\nto sell you new television equipment has used oper¬\nable equipment on hand in its storage warehouse.\nThis equipment may have been taken in trade or\nhave been returned as a result of the station leaving\nthe air. Obviously, the salesman who calls on you\nis interested in selling the new equipment of the\ncompany he represents; however, his company is\ninterested in disposing of this used equipment too.\nWhy not ask about it?\nTV TECHNICAL TIPS (November)\nIn our last column, we mentioned October meet¬\nings of interest to educational broadcasters. We\nthought the 34th Annual NAEB Convention in\nOmaha one of the best. Of the 227 persons registered,\nonly five were engineers: Carl Menzer of WSUI-\nKSUI, Bud Phillips and Bob Stumme of the Univer¬\nsity of Iowa TV studio, Clarence Deal of KOKH,\nOklahoma City and the writer. While this isn’t a\nlarge representation, it’s the best yet.\nWith next year’s convention in Detroit, in the\ncenter of NAEB station concentration, we trust\nmore engineers will be there. With the three studios\nof the Detroit ETV Foundation, as well as a number\nof educational radio stations, it isn’t too early to\nbegin plans for a one-day technical program. Ann\nArbor is near, where the University of Michigan has\nthree TV installations, as well as ETRC headquarters.\nWe could make up an interesting tour and see how\nthe Detroit area stations operate. I’m sure the 1959\nConvention committee would’ appreciate your sug¬\ngestions. You can send them to me and I’ll see that\nthey reach the right persons. In the meantime, you\ncan begin working on the boss to take a carload of\nhis staff to Detroit.\n—NAEB—\nWe’d like to pass along the four points made by\n“Jim” Ebel, Vice-president and general manager of\nKOLN-TV, Lincoln, Nebraska, and former chief en¬\ngineer of WILL, at the Wednesday afternoon panel\nsession of the NAEB Omaha Convention. If I were\nan Educational Broadcaster, I would:\n1. Try to have the best possible technical facili¬\nties, operations, and operating and mainten¬\nance practices.\n2. Have a long range plan for technical improve¬\nment, which I would revise constantly.\n3. Sell my staff on my station and its program be¬\ncause this is one of the best and most effective\nways of promoting the station.\n4. Determine the type and tastes of the audience\nI am trying to reach and program accordingly.\nWe believe that the above points, applied to any\noperation, would do much to make it a successful\none.\n2\nENGINEERING NEWSLETTER"
}