{
  "id": "d1810-2",
  "text": "- 3 -\nSecond, we must be able to make a convincing case for education1s\nneed for FM channels 200 kilocycles in width. Otherwise, organised\nopposition to the proposed expansion of the total FM broadcast band may\nbe able to exert enough pressure to effect a. reduction of the present 200-\nkilocycle. channel-width to half this width. According to top-ranking\nFM radio engineering authorities, if FM channel-width were reduced\nfrom 200 kilocycles to 100 kilocycles,, FM broadcasting'would lose the\ncharacteristics which make it uniquely different .from standard AM\nbroadcasting, namely:—(1) its wide range of audible frequencies, (2)\nits wide dynamic range, or range of intensity difference between loudest\nand softest passages, (3) its freedom from distortion, and (/+) its\ncomplete freedom from static and background noise — characteristics\nwhich account for FM1s extreme naturalness of tone which gives the\nlistener the illusion of being actually present at the point of program\norigin.\nThere is reason to believe that any action which might, in any way,\ntend to impair the tone quality and static-elimination characteristics of\nFM broadcasting would tend, inevitably, to reduce the value of FM as an\neducational medium. Music educators have found, in FM, an answer to\nthe long-felt need for an instrumentality capable of faithfully re¬\ncreating the world’s great music in all the beauty of its original\nrendition. There is also some research evidence to indicate that tone\nquality may be an important affective factor in determining the over-all\neffectiveness of school radio listening with respect to promoting worth¬\nwhile interests . and developing attitudes favorable to the support of\ndemocratic processes. Finally, of course, any teacher who has ever\natempted to use radio for classroom listening (and who, in consequence,\nwill have had opportunities to observe, first hand, the devastating\neffects of noisy reception on class-group attention)', should be able fully\nto appreciate the value of the noise-free reception made possible by\nthe use of the 200-kilocycle channel-width which present FM broadcasting\nemploys.\nIn making our case for education’s need for FM channels 200 kilocycles\nin width, perhaps it would be best for us to build our case entirely\nin terms of education’s need for the tone fidelity and noise-elimination\ncharacteristics offered by the ■\"Armstrong System of Wide-Owing Frequency\nModulation,1’ rather than attempt to make any technical defense of the\n200-kilocycle channel width. If we can convincingly show that school\npeople consider it important, from the standpoint of insuring maximum\neducational effectiveness of radio-program listening, that school\nbroadcasts be of the highest possible lone quality and free from static\nand background noise of ail minds, this is all that will be necessary\nfor us, since we can depend on the testimony of the FM engineering\nwitnesses to establish the technical conditions necessary in order to\nprovide these characteristics."
}