{
  "id": "d1810-4",
  "text": "- 5 -\nquite a few school systems which can not, for one reason or another, have\ntheir own stations, will ultimately develop local recorded-program services\nof this hind, to supplement the \"live\" educational broadcasts available\nfrom nearby school-owned FM stations, and even from commercial FM and\nstandard-broadcast stations. Nevertheless, (and here, it seems, is the\nanswer to this argument, should it be raised), even though an educational-\nstation applicant may not be in a position, at the outset, to broadcast\nprograms for out-of-school listeners, we cannot escape the fact that pro--\ngrams designed specifically for in-school listening ARE listened to\n(according to the reported experiences of school systems now operating\nEM stations, with reasonably-constant regularity) by the parents of the\nschool children, and, in consequence, have rather significant public-\nrelations valuet (Actually, it seems probable that the great majority of\neducational-station applicants WILL plan to offer BOTH programs for in¬\nschool listening AND programs for out-of-school listening.)\nSUGGESTIONS FOR ORGANIZING TESTIMONY FOR PRESENTATION:\nThere are four general points which the testimony of educational\nwitnesses will need to establish conclusively, either on the basis of con¬\nclusions or inferences drawn from information now available, or on the\nbasis of calculations made from generally-accepted facts (as in the case\nof showing how closely stations can be spaced without causing mutual\ninterference), or on the basis of the considered opinions of accredited\nspokesmen for recognised groups, organisations, legal entities (such as\nboards of educations, state departments of education, etc.), and the\nlike.\nFirst, we need to show that a substantial number of school systems, col¬\nleges and universities, and state departments of education actually\nintend to establish educational FM broadcast stations as soon after the\nwar as possible; that the types of program service that are being\nplanned will have far-reaching educational, social, and cultural viLues;\nand that the present planning, by the respective groups and organizations,\ncolleges and universities, city school systems, and state departments\nof education which the respective witnesses represent, contemplates\nservice to both in-school and home listeners. We should make it dear,\nalso, that there will be considerable number of school systems, colleges,\nand universities which will NOT be able to have FM stations of their owq\nBUT, nevertheless, WILL plan to install complete program-production\nfacilities to be used in feeding locally-produced .programs to nearby\nschool-owned FM stations for broadcast on the air. Finally, we should\nemphasize the point that there will be a great many schools which intend\nneither to construct their own FM ‘stations, nor to install production\nfacilities, BUT ARE making definite plans- to use the broadcasts of\nproposed school-owned FM stations to be located nearby.\nSecond, we need to show that it will be impossible, in any of the states\nrepresented by the witnesses scheduled to appear, to find room enough,\nwithin the five-channel band education now has, for a sufficient number\nof educational FM stations to provide program service to all the schools\nans school homesj and that, in consequence of needs already in sight, it\nis imperative that education be allocated additional channels."
}