{
  "id": "d1810-4",
  "text": "lege, Nashville 5, Tennessee inquiring where he can\nbuy a used light weight FM transmitting antenna\nand also a used frequency and modulation monitor.\nIf you have these items for sale, or know where they\nare available, he’d appreciate hearing from you.\n_N A E B—\nA new and improved Television Test Film is now\navailable! The new film is a 35mm and 16mm tele¬\nvision alignment and resolution test. The conven¬\ntional resolution chart has been retained and both\nfilms are produced according to rigid standards as\nspecified by the SMPTE Television Engineering\nCommittee. The films are camera originals which\ncompletely eliminates the possibility of printer error.\nThe target is illuminated with exceptional care and\nrecent tests on a sample have shown that the density\nvariation per area is less than .05. The film is avail¬\nable for immediate delivery through Society Head¬\nquarters, 55 W. 42nd St., New York 36, New York.\n—NAEB—\nA report entitled Closed Circuit Television In¬\nstallations in Educational Institutions has been pre¬\npared by the Joint Council on Educational Television\nand the Committee on Television of the American\nCouncil on Education.\nThe report is dated July, 1958, and gives informa¬\ntion on 133 closed circuit systems used by 119 edu¬\ncational institutions. Class instruction over these\nsystems ranges from first grade through college post¬\ngraduate. There is also a report on military closed\ncircuit installations.\nSingle copies are available free through the JCET\nto educational personnel. Bulk and business orders\nare 30 cents per copy.\n—NAEB—\nThe map which fills the back page of this News¬\nletter is one prepared as an exhibit to be presented\nat the FCC hearing on Docket No. 11997 which\ncovers allocations between 25 and 890 me. It shows\nall non-commercial FM stations in the United States,\na total of 164. We hope we didn’t miss anyone.\nWe want to prepare a similar map for educational\nAM stations showing their coverage and directional\npatterns as well as a third map showing non-com¬\nmercial educational television stations and their class\nB coverage. We’ll need data from the stations con¬\ncerned for these proposed maps so we urge your co¬\noperation when you receive our request for this\ncoverage data.\n—NAEB—\nThe 1959 National Convention of the NAEB will\nbe held October 27-30 at the Sheraton-Cadillac Hotel\nin Detroit, Michigan.\nETV\nSTATIONS ON THE\nAIR\nKCTS\nSeattle, Wash.\n9\nKETA\nOkla. City, Okla.\n13\nKETC\nSt. Louis, Mo.\n9\nKLSE\nMonroe, La.\n13\nKNME-TV\nAlbuquerque, N. M.\n5\nKOAC-TV\nCorvallis, Ore.\n7\nKQED\nSan Francisco, Calif.\n9\nKRMA-TV\nDenver, Colo.\n6\nKTCA-TV\nSt. Paul, Minn.\n2\nKUED\nSalt Lake City, Utah\n7\nKUHT\nHouston, Tex.\n8\nKUON-TV\nLincoln, Neb.\n12\nWAIQ\nAndalusia, Ala.\n2\nWBIQ\nBirmingham, Ala.\n10\nWCET\nCincinnati, Ohio\n48\nWEDU\nTampa, Fla.\n3\nWETV\nAtlanta, Ga.\n30\nWFPK-TV\nLouisville, Ky.\n15\nWGBH-TV\nBoston, Mass.\n2\nWHA-TV\nMadison, Wis.\n21\nWHYY-TV\nPhiladelphia, Pa.\n35\nWILL-TV\nUrbana, Ill.\n12\nWIPR-TV\nSan Juan, P. R.\n6\nWJCT\nJacksonville, Fla.\n7\nWKNO-TV\nMemphis, Tenn.\n10\nWMVS-TV\nMilwaukee, Wis.\n10\nWOSU-TV\nColumbus, Ohio\n34\nWQED\nPittsburgh, Pa.\n13\nWTHS-TV\nMiami, Fla.\n2\nWTIQ\nMunford, Ala.\n7\nWTTW\nChicago, Ill.\n11\nWTVS\nDetroit, Mich.\n56\nWUFT\nGainesville, Fla.\n5\nWUNC-TV\nChapel Hill, N. C.\n4\nWYES-TV\nNew Orleans, La.\n8\n“Tape Recorder Directory—Each year Audio\nDevices, Inc. publishes a tape recorder directory as\none of the issues of their magazine “Audio Record.”\nThey have kindly provided us with some so that we\nmay fill your requests for single copies. Just drop\na card to NAEB Headquarters.\n—NAEB—\nBest wishes for a Merry\nChristmas and a Happy\nand Prosperous New Year!\nDECEMBER, 1958\n5"
}