{
  "id": "d1810-9",
  "text": "—XO-\nTn general, exhibits should be submitted, wherever possible, (1) to\npresent facts or relationships that cannot readily visualized from\nverbal presentation alone, (2) to present facts of a statistical nature,\n(3) to document statements of an especially-strategic nature which are\nbased on information sources not generally known, or not generally avail¬\nable, and (4) to provide a visual fixation point (for the attention of the\naudience and of the FOC Commissioners) to aid in the repeated recall of\nattention to a general point that constitutes the basic emphasis of a\nwitnes s1 testimony.\nAll exhibits submitted by each witness (or by the institution or organiza¬\ntion he is representing), including maps, charts, tabulations, descrip¬\ntive materials, and the like, should be labelled or titled to indicate\nwho submitted them and/or who will use them in connection with his testimony\nand they should be numbered consecutively in the order in which reference-\nwill be made to them.\nPLEASE NOTE, ESPECIALLY, THAT EXHIBITS MAY STILL BE SUBMITTED UP TO\nTHE ACTUAL TIME OF APPEARANCEl This means that, if all copies of exhibits\nare submitted at the time of appearance, all 2h copies should be sub¬\nmitted together. Copies of exhibits that witnesses, themselves, will\nuse for reference purposes at the time of their testifying, should be\nbrought with them to the auditorium.\nFinally, it will probably be advisable, if possible, for each witness\nto bring along with him, to the auditorial, three or four dozen mimeo¬\ngraphed copies of his prepared testimony, for use in case they are\nneeded. It is likely that members of the press will ask for copies of\nat least some of our presentations. There are some who claim that it is\nusually a good idea to provide the FCC Commissioners with copies of\naddresses. It is usually well, also, to have a few additional copies\non hand for members of the audience who may particularly want them. •\nHowever, the FCC makes no specific recommendation on this point.\nCertainly, some of the facts educational witnesses will be presenting\nhave very definite \"news value”, find the publicity education can get\nby making copies of prepared testimony available \"in the right quarters\"\nmay serve to make the public more distinctly aware of the fact that\neducation is moving ahead*.\nA FINAL WORD ABOUT RELAY AND TELEVISION CHANNELS:\nAs the concept of educational FM station planning in terms of providing\nstate-wide and region-wide service began to take shape, some of us in\nthe field of education by radio expected that State Departments of\nEducation would eventually construct beam relay transmitters to tie the\nschool-owned stations together for network operation. However, as state\nplans began to mature, it has become less certain whether there will ,\nbe any wide interest in this type of operation. Because of the present\nhigh cost of relay transmission facilities, some States, such as. Michigan\nand Ohio, have given up the idea of linking their stations together with\nultra-high-frequency FM relay transmitters. However, according to the\nlatest reports received by this Office, the Connecticut State Department\nof Education was still planning to link all four of its stations\ntogether with relay transmitters', and the Maryland State Department of\nEducation was planning relay-transmitter links for two of its stations."
}