{
  "id": "d1845-2",
  "text": "-3-\nSecond, the University Radio station will he another link in that impressive\nsequence of developing and establishing facilities for adult education with which\nthe University has so long been identified — in fact, in which it has pioneered.\nTo Summer Session, University Extension, the Institute of Arts and Sciences we\nnow add University Radio.\nThird, the University Radio Station will be used as a new ahd sensitive de¬\nvice for the purpose of maintaining and expanding its contacts with its own com¬\nmunity -- its faculties, students, and alumni.\nFourth, the University Radio Station will be used as an experimental labor¬\natory in testing and evaluating technical inventions, new educational and program\nprocedures, the training of personnel, the processes by which public opinion has\nbeen formed — all growing out of the use of radio. In this connection, however,\nit should be clearly understood that \"experimental” does not mean \"amateurish.\"\nAll programs that are broadcast will be perfected before they go on the air.\nFifth, the University Radio Station’s time will be made available to other\neducational and cultural institutions in the region at the discretion of the Com¬\nmittee. In line with FCC regulations, it is understood, however, that the Univer¬\nsity will at all times exercise full control over all programs.\nTo achieve these ends, the University Radio Station will call upon and uti¬\nlize all the human resources of the University -- its faculties, students, and\nalumni -- and its rich intellectual, educational, and cultural facilities.\nIII. The Functions of the University Committee on Radio\nTo see that these functions are maturely, competently, and steadfastly car¬\nried out will be the role of the University Committee on Radio.\nThe University Committee on Radio will act as the direct liaison agency\nbetween the Director of Radio in the University and the various parts of the\nUniversity community. Debatable questions of program and program priorities."
}