{
  "id": "d1069-0",
  "text": "Vol. IV, No. 7 DuPont Circle Building, Washington 6, D.C. May 6, 1963 ~\nSENATE APPROVES ETV FACILITIES FUNDS\nOn May 1, the Senate passed the HEW supplemental appropriation bill, including\n$1,500,000 to implement the ETV Facilities Act. A similar amount had been approved\nby the House on April 9 (Washington Report, IV, 6, 4/15/63)* Due to a misunderstanding,\nthis appropriation had been stricken the previous week from the measure as approved\nby the Senate committee, but the item was reinserted during floor debate, thanks\nlargely to efforts of NAEB members who came quickly to the rescue when called upon.\nFor the next fiscal year (July 1, 1963 - June 30, 1964), the House Appropriations\ncommittee has already reported out the HEW budget, including $5,000,000 for the ETV\nFacilities Act. The Senate committee has concluded hearings and is expected to report\nfavorably on ETV funds.\nRules and regulations pertaining to the application for grants under the act\nhave already been prepared and will appear in the Federal Register as soon as the bill\nhas been signed by President Kennedy. Appearance in the Federal Register is\nnecessary by law, before general distribution may be made. However, immediately after\nthe rules and regulations do appear therein, they will be distributed by mail by the\nUSOE.\nRULES FOR MAINTENANCE LOGS\nNew FCC rules on Transmitter Inspections, Maintenance Logs, and Automation will\ngo into effect May 10. Although it was felt earlier that the effective date might\nbe delayed, such is apparently not the case. The proposed rules (which are discussed\nin some detail in Washington Reports for March 15 and April 15), which are not being\ndistributed by the FCC due to their bulk, may be obtained from the NAEB by sending\n50^ in coin or stamps (to cover costs of reproduction, mailing, and handling). In\naddition, a memorandum, prepared by Roger Peterson of Jansky & Bailey (NAEB Engineering\nConsultants), discussing and elaborating on the new rules may be obtained from the\nNAEB free-of-charge.\nSome concern has been expressed by NAEB’ers about the inspection requirements of\nthe new rules, especially as applicable to FM stations operated by remote control and\nnot readily accessible every day. No clear answer is available on this, but it is\npossible that, under such circumstances a specific request for waiver might be the\nbest hope. However, a word of caution - if, in applying for remote operation, you\nindicated easy accessibility, the FCC might wonder if you now indicated that poor\naccessibility was the cause for a request for waiver.\nProbably the two items mentioned above will answer most questions, but if you\nstill have questions after reading these two documents, we will attempt to secure\ninformation to answer written requests from member stations.\nC\" JCEB-ACE SPONSOR ETV SEMINAR\nApril 28-30, the American Council on Education and the Joint Council on\nEducational Broadcasting co-sponsored a Seminar on Educational Television and Higher"
}