{
  "id": "d1431-0",
  "text": "REPORT TO 1 EMBERS — 194B ANIUAL MEETING _r\nTHE 22ND ANNUAL MEETING OF THE NATIONAL ASSOCIATION OF\nfesTeid October 10,11,12~on the University of Illinois campus with member\nstations, WILL AND WIUC, together with the Institute for Communications.Research\nicting as joint hosts. (A complete registration list is attached to this report).\nfive of the six FAEB regions were represented; West coast director and members\nere unable to be present, either at the NAEB meeting or the School Broadcast\nConference in Chicago following the Urbana meeting. Washington was only West\nCoast state represented.\nSESSIONS OPENED SUNDAY EVENING TTITH AN ADDRESS BY DR.FHSI^il^^ > director\nUniversity of Illinois School of Journalism, a prominent.authority in the field\nof radio and newspaper libel law, who testified as an expert in the \"Mayflower\nhearing before the FCC last year. Speaking as a representative of the Institute\nfor Communications Research, he addressed the group on 1!The Right to Know and\nthe problems in this area that modern communications technology has called forth,\nM. S. Novik, NAEB executive secretary and well-known radio consultant in New York\nCity reported on the current status of FN, expressing a confidence in its future,\nreviewing in this connection the problems of big and little business, trans¬\nmitter and receiver situation, and the question of advertising and.promotion.\nThere is considerable evidence to indicate the promotion problem will oe aided\nby the decision of some key manufacturers to place full emphasis behind Fh.\nON MONDAY, SESSIONS OPENED -ITH A BUSINESS IEETING, and were followed by a series\nof reports whics included:\n\"Operation Policy in an AN Non-Commercial Outlpt\" - Jim Miles, WBAA,\nPurdue University\n\"Indiana U. Survey of Educational Stations!1 - Robert Lee, Acting Radio\nHead, Indiana University\n\"Meaning of a Land-Grant College Station\" - R. C. Bentley, Market.Editor\nWOI, Iowa State College\n\"Wisconsin’s State FN Network—It’s Promise\" - Harold McCarty, Director,WHA\nUniversity of Wisconsin\nMONDAY AFTERNOON SESSIONS INCLUDED:\n\"Low-power FN Opportunities and Costs\" - Dr, Franklin Dunham, U.S.Office of\nEducation & Ed, Jones, WASR, Syracuse\nUniversity\n\"Storv of WNYC-N.Y. Municipal Bdcst.System - Seymour Siegel, Stations WNYC\ny and WNYC-FM .\n\"The Board of Education FM Station\" - Dr. I. Keith Tyler, Director dhio\nRadio Institute\n\"KOAC and the Clear Channel Case\" - Hi H. Leake, Director of Radio\nOklahoma A. &•. K College .\n\"Report on the FCC Television Hearings\" - Carl .Menzer, Director WSUI AND\nKSUI, University, of Iowa\nTHE ANNUAL BANQUET MONDAY NIGHT HIGHLIGHTED THE 194S_^ANl;H/iL-Jld^TJlI2 with an\naddress~and a highly useful quostion and answer period by Benedict Cottone, Gener\nal Counsel of the Federal Communications Commission(copies of tne Cottone address\nare appended’ to this report). Climaxing the evening was an address by Dr. ilbur\nSchramm, direct r, Illinois Institute for Communications Research, who spoke on\n\"Mass Communications Concepts\" stressing the incredible growth of communications\ntechnology in new world of television, ultra-fax, facsimile, . i1 i an a il0° 0\nother devices and the cultural lag, and the social and technical problems raised\nby this development."
}