{
  "id": "d1171-2",
  "text": "r\nSalary dependent on experience.\nDec 4 Producer-Director for university-affiliated station, midwest. For evening pro¬\ngraming, documentaries. MA with writing background desired, others given\nconsideration. Minimum salary $6,000. Open Jan. I.\nDec 5 Producer-Director for same station as above. Basic staff job, general program¬\ning. Minimum salary $6,000.\nTEACHING\nNov 24 Academic appointment with a state university in NE. To develop advanced\nnon-lab broadcasting courses on undergraduate level in research, theory, his¬\ntory. Ph.D. with prof., assoc, prof. rank. Salary open. Fall, 1967.\nNov 31 Dual position with a state university in midwest. Academic appointment teach¬\ning courses in radio-TV; TV producer-director position. Ph.D. desired. Salary\nand rank determined by individual's qualifications. 9 or 12 month position.\nOpen Jan. I.\nNov 34 Academic appointment for Ph.D. (or near) with Broadcasting Area of Speech\nDept., midwestern univ. To teach undergraduate, graduate courses. Rapidly\ngrowing graduate program. Opportunity for supervising special programing\nof univ. radio station if interested. Salary open. Beginning second semester or\nfall, 1967.\nNov 36 Program Director/Instructor for a leading west coast college, Div. of Tele¬\ncommunications. To teach beginning broadcasting courses, specifically radio\nproduction. To assume responsibility for supervising, programing established\nFM station having varied program schedule. Department also operates ETV,\nCCTV facilities.\nDec 10 Academic appointment with state college in NE. To teach and assist in de¬\nvelopment of broadcasting program at undergraduate, graduate levels. Ph.D.\n(or near) in broadcasting, communications preferred. Extensive experience in\nradio/TV industry, including active broadcast research desirable. Salary and\nrank open, dependent upon qualifications. September, 1967.\nOTHER\nNov 23 News Director for university radio station in NE. Opportunity for qualified\nperson to teach broadcasting courses. M.A. required. Position open summer,\n1967. Salary open.\nNov 38 A-V Specialist, multi-media, knowledge of story-boarding, slide production,\nCCTV, motion pictures, some knowledge of equipment. Large pharmaceutical\ncompany in N.J., near NYC. $9,000+ to start depending on experience. Ex¬\ncellent fringe benefits. Good opportunity for professional growth.\nNov 39 Director for CCTV. Professional to head presently employed technical staff.\nNew facility currently for video taping, observation of classes. Will be util¬\nized later for instruction. Opportunity for some teaching. Wide salary range\ndepending on experience and education. Minimum requirement, M.A. with\nthree years of teaching experience.\nDec 2 Experienced General Manager to direct school-affiliated ETV station in mid¬\nwest. Responsible for total management of operation. Seek an organizer,\nknowledgeable in PR & Dev., to assist in securing community support. Salary\nopen, dependent on experience. Open now.\nDec 6 Operations Manager for university-affiliated radio station. Opportunity for\nteaching. Supervision of student personnel plus some production/announcing\nduties. Salary ranges upward from $6,000. Open now.\nCredit Courses Offered\nFive N. Y. Outlets\nFive educational television stations in New\nYork are carrying three telecourses this se¬\nmester with credit being given by six of\nthe state university institutions in addition\nto Kingsborough Community College of the\nCity University of New York. The stations\ninvolved are WNED-TV, Buffalo; WXXI,\nRochester; WCNY-TV, Syracuse; WMHT,\nSchenectady, and WNYC-TV, New York.\nThe courses are Eye on the Universe,\nHistory of Latin America I, and History\nof Latin America II. In addition to Kings¬\nborough, the State Universities at Albany,\nSyracuse, Oswego, Brockport, Genesco and\nBuffalo have selected students enrolled in\nthe program which they may watch at home\nfor academic credit. Current plans call for\nthe state universities to continue the courses\nduring the next semester which starts in\nFebruary.\n2500 MC Channel Dedicated\nA 2500 megacycle TV channel to serve\nsome 240,000 students in the Diocese of\nBrooklyn, N.Y., was dedicated recently\nat Bishop Ford High School there. The\nBrooklyn Diocesan four-channel system\nis reportedly the largest educational tele¬\nvision system in the world. At the dedi¬\ncation ceremony, Rev. John J. Culkin, SJ,\ndirector of Fordham University’s Film\nStudy Center, exhorted educators to make\nmaximum use of TV as a teaching tool.\n“Our age demands an all-media literacy.\n... a student equipped for anything less is\nculturally deprived. ... all media have\nsomething to offer. All media should be\ntaught in schools,” Father Culkin said.\nNews Notes\nWinners in the Sigma Delta Chi annual\ncollege press contest numbered 27 students\nas well as college publications in this year’s\ncompetition. In the radio-television field,\nthe following students were honored: for\nradio reporting, Edward W. Pierce, Uni¬\nversity of Nevada, and John Ledingham,\nOhio State; for television reporting, John\nLindsay, Washington State University, and\nDouglas Caldwell, Ohio University; for ra¬\ndio or TV newswriting or commentary,\nMark Hall, San Jose State College, and\nWendell Anschutz, University of Kansas;\nfor radio or TV public service in journal¬\nism, Richard Mayk, Charles Bierbauer and\nKenneth Bredenberg, Pennsylvania State\nUniversity, and Edward Yeates, Univer¬\nsity of Utah.\nWRVR, New York, N.Y. plans to broad¬\ncast a live folk music festival on January\n7 from 11 a.m. until 7 p.m. The festival will\nbe held in the theatre of the Riverside\nChurch and will highlight various schools,\ninfluences and varieties of folk music.\nA Film Study Conference will be held\nat Fordham University, New York, July 5-\n8 at the school’s Lincoln Square campus.\nDiscussions, screening and analysis, dem¬\nonstrations and how-to sessions will be fea¬\ntured at the four-day meetings which will\nbe scheduled in the afternoons and evenings\nto accommodate teachers enrolled in sum¬\nmer courses. The fee for the conference is\n$30. A special fee of $20 has been set for\ncollege undergraduate and high school stu¬\ndents.\nThe Georgia ETV network continues\nto gain momentum. Three new transmitter\nantennae were completed in a six-week pe¬\nriod. They are WABW-TV, Pelham,\nWACS-TV, Dawson, and WCLP-TV, At¬\nlanta. The stations are scheduled to begin\nbroadcasting by the end of this month\nbringing the total Georgia ETV operation\nto eight stations. All are owned and oper¬\nated by the State Department of Educa¬\ntion with the exception of the University\nof Georgia’s WGTV-TV, Athens-Atlanta.\nNew Directions in Education, produced\nby and presented over the Georgia ETV net¬\nwork, has received the New York Interna¬\ntional Film Festival Bronze Medal. The\nfilm was shot throughout the state to show\nvarious stages of progress in Georgia edu¬\ncation.\nMore than 40 national educational or¬\nganizations met recently in Washington at\na conference of the National Center for\nSchool and College Television to discuss\npossible satellite communications in schools.\nThe purpose of the meeting was to brief\neducators on the nature of the satellite sys¬\ntem proposed by the Ford Foundation and\nto enlist their aid in determining the inter¬\nest of schools in satellites.\nA series tracing drama from Ancient\nGreece to the present time has begun on\nWNYC-TV, New York, N.Y. Audio tapes\nare being heard on WNYC. The 90 one-half\nhour programs are telecast three times a\nweek. The series was produced by Dr. Dave\nBerkman, coordinator of communications\nmedia, Kingsborough College.\nMaine women in the working world were\nfeatured in a recent telecast on WMEB-\nTV, WMEM-TV and WMED-TV, Uni¬\nversity of Maine ETV Network, Orono.\nThe show was produced in cooperation with\nAmerican Association of University Women.\nThe program provided an opportunity for\ndiscussion of the pros and cons of women\nDECEMBER, 1966\n3"
}