{
  "id": "d1693-0",
  "text": "■\nN\nA\nE\nE\nm\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 28, NO. 3 MARCH, 1963\nWEDU-TV To Host Region II Conference\nSessions at the Region II meeting in Tampa March 29 and 30\nwill be chaired by the following: radio, Kenneth Wright,\nUniversity of Tennessee; engineering, William Kessler, Flori¬\nda ETV Commission; general audience ETV appeal, John\nYoung, University of North Carolina; formal instruction,\nR. LeRoy Lastinger, WEDU, Tampa; public relations, Louis\nPeneguy, Alabama ETV Commission; graphic arts, Hill Ber-\nmont, WGTV, Athens, Ga.; informal instruction, Edward\nL. Herp, WFSU, Tallahassee; vocational instruction, Robert\nBohan, St. Petersburg Junior College. In addition, there are\n32 other panel consultants listed in the preliminary program.\nDr. John T. Caldwell, chancellor of North Carolina State\nCollege, will speak at the Friday banquet, and the luncheon\nspeaker will be NAEB Board Chairman Richard B. Hull.\nNAEB President William G. Harley and Region II Directors\nLeonard Press and Gerard Appy will speak at the Saturday\n“NAEB Professional Association Breakfast.”\nPR Kits & Speaker's Portfolios Popular\nAs we go to press, 135 copies of the NAEB Speaker’s Port¬\nfolio and 272 Public Relations Aids have been distributed to\nNAEBers. These were developed by the PR Committee last\nyear. Limited numbers of the Public Relations Aids are free,\nwhile copies of the NAEB Speaker’s Portfolio are 50 cents\neach. (For orders under $3, payment must accompany order.)\nWrite to the NAEB, 119 Gregory Hall, Urbana, Illinois.\nSpeaker’s Portfolio. This contains nine speeches which can\nbe adapted for various groups before which NAEBers are\noften asked to speak. Titles are: “Teamwork in Public Service\nBroadcasting,” “The Changing Face of Television,” “Utiliza¬\ntion of In-School\" Programing,” “Television and Education—\nThe Coming Quiet Revolution,” “National Developments in\nEducational Television,” “The Need for Action by Educational\nBroadcasters,” “Advertising Versus the Public Interest,” “The\nInter-Relationship Between Education and the Communications\nMedia,” and FCC Chairman Minow’s speech before the NAEB\nconvention in 1961. Also included are some quotes which\nmight be incorporated into speeches, and some factual notes\non the NAEB.\nPublic Relations Aids. This is a two-purpose kit, containing\nboth information to help members promote the NAEB and\nhints for station public relations. Included are the following:\na list of NAEB publications and recordings; a news release\nsample; suggested newspaper fillers concerning the NAEB;\na statement of purpose of the NAEB PR Committee; a book¬\nlet called “A Public Relations Guide for the Educational\nBroadcasting Station,” a booklet and a flyer describing the\nNAEB, a sample speaker’s kit now used by a member station;\nNAEB spot announcements; a brief list of PR hints; para¬\ngraphs re the NAEB; an index of the Research Fact Sheets\nwhich have appeared in the NAEB Journal; and some descrip¬\ntive folders regarding the NAEB radio series, “The Ways of\nMankind” and “The Jeffersonian Heritage.”\nRegion III Meet To Be Informal\nPlanners of the NAEB Region III conference in Chicago\nMarch 17-19 say the emphasis will be on ideas and problems\nwhich participants take to the meeting. Says the announcement,\n“It will be an opportunity for self-examination of ourselves\nas individual broadcasters and of our organization, the\nNAEB.” Main topics for consideration are: “Administering\nEducational Broadcasting,” “Educational Broadcasting Fa¬\ncilities,” “The Heart of Broadcasting: The Program,” and\n“Relationships in Educational Broadcasting.” Ed Morris, di¬\nrector of development for WTTW, Chicago, and Chet Camp¬\nbell, manager of promotion and advertising for NBC, Chi¬\ncago, will speak on “Promoting Educational Broadcasting” at\nthe Monday luncheon. The concluding general session, “The\nMembership Speaks,” will be based on questions suggested by\nregion members; discussion will be led by Alec Sutherland,\ndirector of the Center for Continuing Education and director\nof educational broadcasting for the University of Chicago.\nMembers of the program committee are: Donald Anderson,\nIllinois Institute of Technology; Allen Burns, NBC, Chicago;\nHenry Mamet, Chicago Board of Rabbis; Chalmers Marquis,\nJr., WTTW; Elizabeth Marshall, Chicago Board of Educa¬\ntion; Wanda Mitchell, Evanston Township High School; John\nBuckstaff, University of Chicago; and NAEB Region III\nDirectors Richard B. Hull and James S. Miles.\nFCC Needs Program Schedules\nThe FCC has asked to be put on mailing lists to receive pro¬\ngram schedules of educational radio and television stations.\nPlease address to: Educational Broadcasting Branch, FCC,\nWashington 25, D. C.\nRichmond Campaigns for ETV Station\nOn January 24, some 75 community leaders located within a\n50-mile radius of Richmond, Virginia, voted unanimously to\nbegin a campaign for money for an educational television sta¬\ntion there. The leaders met as guests of Reynolds Metals at\na kick-off banquet to determine their interest in the proposal.\nThe group consisted of bank presidents, industry presidents,\nrailroad executives, newspaper publishers, and heads of cul¬\ntural agencies and educational institutions. They heard brief\nreports on the history of ETV activities, engineering surveys,\nestimated costs, and the impact which ETV would have on the\ncommunity.\nNebraska ETV Network Plans Move Ahead\nAll signals seem to be “go” for Nebraska’s proposed state¬\nwide ETV network. In November the FCC reserved the five\nadditional channels in the state that had been applied for in\nJanuary, 1961: Ch. 3, Lexington; Ch. 9, North Platte; Ch.\n7, Bassett; Ch. 13, Alliance; and Ch. 25, Albion. Specific\nsteps for the six-station network have been outlined in a re¬\nport to the governor and legislature by Dr. John C. Schwarz-\nwalder, general manager of KTCA-TV, Minneapolis-St. Paul,\n1"
}