{
  "id": "d1693-2",
  "text": "^ The University of Wisconsin’s WHA-FM began stereo\nbroadcasts on January 14.\nAt its meeting in Chicago on January 24, the CIC Radio\network Committee concentrated on the financing of a pro¬\nposed live radio network for Big Ten stations. (CIC is the\nCouncil on Institutional Cooperation of the Big Ten and the\nUniversity of Chicago.) Based on estimates by Carl Menzer,\ndirector of WSUI (AM) and KSUI (FM) of the State Uni¬\nversity of Iowa, about $120,000 per year would be needed for\nline rental and network staff. The committee decided to rec¬\nommend to the CIC that foundation support be sought for\ninitial operation.\n^ The University of Maine has produced a 15-minute educa¬\ntional radio program, “Opportunities 63,” which is being broad¬\ncast by 20 stations in the state. The university’s director of\nplacement moderates the program.\n^ Texas Governor John Connal'ly, in naming February 11-15\nETV week in Texas, said in part: “Educational television\nnow offers excellent learning opportunities to the school chil¬\ndren of America. In Texas great strides have been made in\nmany communities through the use of educational television.\nIn times such as these, when our children need the best edu¬\ncation that it is possible to give them, responsible citizens can ¬\nnot ignore such a significant tool.”\n^ Boston University and WGBH-TV are offering 12 $1500-\nper-year scholarships (11 in TV; 1 in FM) leading to an\nM. S. degree in communication arts.\n^ WBGO (FM), Newark, observed Robert Frost Day on\nFebruary 1 by broadcasting special Frost programs—two\nNAEB programs on Frost, and a special one quickly pro¬\nduced for younger children. Regular programs were cancelled\nand the three programs were repeated several times through¬\nout the day, to give teachers appropriate programs for every\nclass.\n^ Student personnel of; East Carolina College’s WWWS-AM\nand WWWS (FM) provided a one-day workshop on January\n26 for students from Wilmington College (North Carolina)\nwho are just getting started with their station, WILC. The\nprogram included lectures on the various phases of broad¬\ncasting operations, including record-library management, and\na series of instructional labs in broadcasting techniques.\nPERSONNEL\n^ John K. Mackenzie has left the Council on Medical TV to\nbecome producer of Science and Engineering TV Journal on\nWNDT, New York City. Joseph A. Staton has been named\ninterim secretary of the Council on Medical TV.\n^ Gary Gumpert has left Queens College to become assistant\nprofessor of radio-TV education and senior producer for\nWHA-TV, at the University of Wisconsin.\n^ Donald B. Upham, former project director of ERN, is act¬\ning as director of radio and instructor in the department at\nthe University of North Carolina in the absence of Robert L.\nHilliard, on leave to serve as consultant on ETV in higher\neducation for the New York state department of education.\n^ Herb Evans, formerly chief engineer for WTHS-FM-TV\nand WSEC-TV, Dade County, Florida, assumed a new post\nlast month. He is director of engineering for Florida Atlan¬\ntic University’s (Boca Raton, Florida) learning resource fa¬\ncilities; extensive CCTV utilization as well as UHF and FM\noutlets are planned.\n^ Syd Cassyd, founding member of the Academy of Tele¬\nvision Arts and Sciences, has been appointed by the Los An¬\ngeles Board of Fire Commissioners as chief consultant for\nTV communications. His initial action in this capacity was to\nsuggest that acquisition of Ch. 28 for TV communications of\nthe fire department and the city would be in the public inter¬\nest; the application was filed with the FCC December 26,\n1962.\n^ Alabama’s Governor John Patterson recently presented Ray¬\nmond Hurlbert with an official state certificate of appreciation\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W.t Washington 6, D. C. Phone 667-6000 Area Code 202.\nacclaiming Hurlbert as “the moving force behind the exten¬\nsive success of educational television.” Before the state legis¬\nlature in his Report to the People on State Affairs, Gov.\nPatterson stated, “To the great credit of the Alabama Educa¬\ntional Television Commission and its general manager, Ray¬\nmond Hurlbert, we now have broadcasting facilities worth\nmore than $10 million. Our total investment, however, is only\nabout $1.5 million. . . .” In the same report, the governor\nurged that ETV in Alabama be expanded, with four new sta¬\ntions added—at Demopo’lis, Rutherford in Barbour County,\nHuntsville, and midway between Decatur and the Tri-Cities.\n^ Richard L. Beach has been named general manager of\nWSCH (FM), South Church Broadcasting Foundation, Inc.,\nHartford, Connecticut. Beach formerly was associated with a\nlocal advertising agency in its radio and TV department. He\nhad also been affiliated with Boston commercial radio stations.\n^ WFSU-TV, Tallahassee, has two new men in its technical\ndepartment, and a new chief engineer. John Milner, formerly\nwith WSUN, St. Petersburg, is assistant chief engineer.\nAlan May, from WEDU, Tampa, is a new studio engineer,\nand Glenn Walden has been appointed chief engineer.\n^ Louie L. Lewis, former administrator of ETV planning for\nRCA, has announced formation of a consulting firm to help\neducational institutions select and install electronic equipment.\nLewis had been with RCA for ten years, and prior to that\nwas in charge of engineering at Iowa State University’s radio\nand TV stations.\n^ Ed Rothhaar, script writer at KSLH, St. Louis, has re¬\nceived commendation from officials at the Korean Research\nand Information Office in Washington for a program on\nKorea. The program is based on Rothhaar’s personal ex¬\nperiences with Koreans during his recent army service in\nthe Republic of Korea.\n^ John P. Twaddle has been named program director for\nWHYY, Philadelphia. He joined the staff in April, 1962, to\nproduce the NET series “Lyrics and Legends.”\nNew NAEBers\nACTIVE\nStation WVIS (cp), Indiana State College, Terre Haute, In¬\ndiana.\nAFFILIATE\nAmerican Bible Society, New York.\nINDIVIDUALS\nAlbert A. Becker, East Lansing; Richard L. Benson, Beloit,\nWisconsin; Arnold Sanford Bernstein, Pittsburgh; Miss Mar¬\ncia Lee Bishop, Eugene, Oregon; Carleton W. Brookins, St.\nPaul; Rodney D. Chipp, Bloomfield, New Jersey; Sister M.\nColman, R.S.M., Washington, Pennsylvania; James Day, San\nFrancisco; Dr. Ronald G. Emery, Shaker Heights, Ohio;\nLawrence P. Flavin, Verona, Pennsylvania; Wendell C. Ford,\nTempe, Arizona; Dr. Carl F. Hansen, Washington; Hubert\nM. Houpt, Spartanburg, South Carolina; H. Eugene Larson,\nSacramento, California; John H. Lerch, Boston; J. E. Lyden,\nPhiladelphia; John McArthur, Detroit; Margaret C. Manley,\nSouth Orange, New Jersey; T. Stephen May, College Park,\nMaryland; Michael H. Molenda, Wauwatosa, Wisconsin; Dr.\nH. Wilbert Norton, Chicago; Dr. Tate C. Page, Bowling\nGreen, Kentucky; Clifford H. Paul, Huntsville, Alabama;\nMrs. Irene L. Schiffer, Woodmere, New York; Miss Made¬\nleine Schwab, Stanford, California; Salim Shah, Milwaukee;\nRoger Sko'lnik, East Lansing; Norma V. Stewart, Denver;\nE. C. Stimbert, Memphis; Mrs. Cecil H. Suffern, New York;\nRobert R. Thalner, Batavia, New York; Cheryl Turbin, Mil¬\nwaukee; Ian Noel Wheeler. Falls Church. Virginia.\nPublications\n• The Television Information Office has a new publication,\nthe first issue of which was distributed the last week in Jan¬\nuary. The newsletter is called informaTIOn and is designed\n“to provide a forum for the exchange of ideas and experiences\nMARCH, 1963\n3"
}