{
  "id": "d1533-0",
  "text": "Office of Executive secretary\nU r ban a,, 1111 no 1 n\nApril 15, 193b\n■' . ': r vpTI Nj>^ .TN -J< HU a\nThe asaoclation will hold a closed meeting Monday nighty Way 1.\nIti$?+ Ueahler-rfalliok Hotel, Columbus, in connection with the Tenth\nuatilute for Education by Radio, sponsored by Ohio State University..\nAlready many members have Indicated their intentions of' neing pro sen v ^\nThis notice la Just another reminder For furthep details on the Insti¬\ntute, see the preliminary program announcement,\nPAX u Jh)lhl\nSince the report of paid-up members listed in the April 1st Hews Letter,\nWNaO, University of Oklahoma, has submitted membership dues and Cleveland\nCollege, Cleveland, Ohio, has brought associate membership dues to date.\nAdded to the NAEB raster within the past ten days have been the Universi¬\nty Broadcasting Council and Indiana University as associate members xei\ncome Allen killer and Bob Allen,\nHAVE YOU CONE YOUR PART?\nNAEB is now endeavoring to secure n&w«members. Have you done your part?\nHave you attempted to secure the interest of some other educational radio\nstation? There are indications on many fronts that Interest In education¬\nal broadcasting Is on the increase- This means there are many potential\nmembers for NAEB, either institutions owning educational stations, or\nothers engaged in educational broadcasting over privately owned stations?\nEarlier this year we suggested a new member or associate member for every¬\none then In NAEB by May 1st,, You'll have to hurry,,\nYour executive secretary has issued Invitations to a number of institutions\nincluding some but not all on the following list* Perhaps you can enlist\nthe Interest of one of the followings\nSir* Burton Paulu, Director of WLB, University of Minnesota,\nMinneapolis, Minnesota\nMr* Robert J. Coleman, Manager of WKAH, Michigan State College,\nEast Lansing, Michigan\nMr* Emory G. Horger, Box 3773, Station TSCW, Denton, Texas\nMr. Mo So Novik, Municipal Broadcasting System, Municipal Building,\nNew York City\nMr. L. L. Longsdorf, Program Director, X3AC, Kansas State College,\nManhattan,, Kansas"
}