{
  "id": "d1533-1",
  "text": "NAEB NEWS LETTER\n°Page 2\n..August I, 1943\nThus reads the announcement in the current edition of Billboard telling\nhow and why WNYC was selected for this Special AwarDo In expressing thp\nTHANKS OF THE ENTIRE STAFF FOR THIS RECOGNITION, MORRIS S0 NOVIK,\nDIRECTOR OF THE C|TY STATION, PROMISED THAT \"THIS AWARD SHALL STAND AS\nA SYMBOL OF PAST ACHIEVEMENTS, WHILE AT THE SAME TIME *CT AS AN INCENTIVE\nTOWARDS MORE AND GREATER SERVICE TO THE PEOPLE OF THE ClTY OF NEW Y0RK„m\nWTAW GETS INCREASED FACILITIES\nWTAW, Texas A & M College has been granted daytime operation on 1150 kc\nBY THE FCC. WTAW had PREVIOUSLY SHARED TIME WITH KTBC, AUSTIN, ON THIS\nFREQUENCY« J. J» WOOLKET IS PROGRAM DlRECTORo\nIndiana presents” in naeb script exchange\nBook Two of hIndiana Writers,ha series of radio dramatizations dedicated\nTO NATIVE AND ADOPTED WRITERS OF INDIANA HAS BEEN FORWARDED BY H0 J,\nSKORNIA TO THE NAEB SCRIPT EXCHANGE. The BOOK CONTAINS 26 ORIGINAL\nSCRIPTS WRITTEN UNDER THE DIRECTION OF SkORNIA BY STUDENTS AT INDIANA*\nRANDOM NOTES\nWaldo Abbot has ground out another of those news letters to his studes.\nmakes #12 in the series to his former students...o0n April 4, 1934,\nJohn Callahan, Wisconsin superintendent of public instruction, issued\nWHAT IS CONCEDED TO BE THE FIRST RADIO TEACHING LICENSE EVER GIVEN, TO\nharold a0 Engel, director of the Wisconsin College of the Air over WHA„\nnAROLD, PAST NAEB PRESIDENT, IS NOW A LIEUTENANT IN THE ARMY«... WONDER\nWHY SOME OF THE FOLLOWING PEOPLE 00N1T WRITE ME A LINE OR TWO FOR\nINCLUSION IN SOME FUTURE NEWS LETTERS— CARL MenZER, HAROLD McCaRTY,\nHarold Lngel, Mike Hanna, Gibbs Williams, MC Jensen, W. I. Griffith,\nib Pettegrew?o.o.Dresser Dahlstead, former Hollywood Blue, spends some\nOF HIS SPARE TIME ANNOUNCING ON WILL THESE DAYS. He 0S STATIONED AT\nChanute ield....One of Bob Coleman's former announcers at WKAR dropped\nin to visit WILL studios.... Have you sent in your AER-NAEB questionnaires?..\nWhat would you like to see in future NAEB NEWS LETTERS?....Guess George’\nJennings is busy with plans for first full year of operation for WBEZ....\nWhat happened to Allen Miller after he returned to West Coast?....Is\nElmer Sulzer in the army of navy, or is he just too busy to write?....\nHow are things at KFKU and WNAD with Miss Seaman and Miss Hawks?....\nRegard.s to Past Prexy Ingham..».Major Powell—what*s happened to Charley\nDUDLEY?9M,BBe is FURNISHING A NUMBER OF NAEB STATIONS WITH TRANSCRIPTIONS\nOF BBC PROGRAMS...Got ANY PERSONNEL PROBLEMS AT YOUR STATION?...,Th|S IS\nNOT THE Wake, but Help, Help, Help, anyway.\nFCC ACTIONS\nWNYC, New York City, granted authority to determine operating power by\nDIRECT MEASUREMENT OF ANTENNA POWER FOR AUXILIARY TRANSMITTER. (7/6/43)\nWNYC, New York Sty, applied for Special Servic Authorization to operate\nFROM 6 A.M. TO 10 P.M., WITH POWER OF I KV;, AMENDED REGARDING DIRECTIONAL\nANTENNA. (7/12/43)"
}