{
  "id": "d1810-0",
  "text": "■\nN\nA\nE\nE\nw\nEngineering Newsletter\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL DECEMBER, 1958 URBANA, ILLINOIS\nTV TECHNICAL TIPS (October)\n—Cecil S. Bidlack\nAll of a sudden summer ends and again we’re\nplunged into the midst of a busy fall season. School\nbegins, the football season starts, renewed and in¬\ncreased programming begins on educational as well as\ncommercial stations. Autumn, too, brings a round of\ntechnical meetings of value to all radio and TV station\npersonnel. Although two of these meetings will be\nover before this appears in print, it will give you time\nto think and plan for next year, since the pattern re-\n/'7> peats yearly.\nThe first of these meetings is the annual Fall\nSymposium of the IRE Professional Group on Broad¬\ncast Transmission Systems held at the Willard Hotel\nin Washington September 27-28. We’d guess that\n125 were registered for the excellent two-day pro¬\ngram just concluded. While the majority of the\npapers presented were on television topics, there were\nalso papers on FM multiplex and stereophonic\nbroadcasting. Three papers covered television\nswitching facilities by relays, transistors, and a diode\nmatrix vertical interval switcher. Other topics were\nprecise carrier offset, the chroma-key effects system,\nand vidicon operating techniques. One afternoon\nsession was devoted solely to video tape recording\nwith descriptions of the NBC-Burbank color installa¬\ntion and the CBS-New York facilities, followed by\na panel discussion of the uses and problems en¬\ncountered in VTR operation at individual affiliate\nand network owned stations.\nThere was a tour of the new four million dollar\nNBC studios in Washington, which houses the WRC\nand WRC-TV studios and offices as well as FM and\nTV transmitters. The plant is designed to make most\neffective use of a minimum of operating personnel.\nAll video controls for live and film cameras are located\nin one central control and transmission room. AM\nand FM studios are located in a cluster with all\nNAEB Engineering Newsletter\nDecember, 1958\nNAEB Engineering Newsletter, a quarterly publication issued\nby the National Association of Educational Broadcasters, 14\nGregory Hall, Urbana, III. $2 a year, edited by Cecil S. Bid-\nlack.\nmicrophone outputs appearing on all control room\nconsoles. Every studio is visible from each of the\ncontrol rooms.\nThere are two TV studios, one large- and one\nmedium-sized. Eventually these will be equipped for\nlive color originations, with lighting boards relay\noperated so that the lighting for ten different sets\ncan be arranged and then turned on as required by\na control room panel switch. I was interested in the\nfact that no dimming facilities are provided for light¬\ning.\nBy the use of punched paper tape and readout\nand memory devices, automatic TV operation is\npossible once the proper sequence has been set up\non the tape. Automation is used primarily for sta¬\ntion break operation during long stretches of net¬\nwork programming. This automation equipment can\nbe clock-operated and switched from network to\nlocal, rolling and stopping projectors and switching\nbetween film and slide projectors as required and\nback into the network with operating personnel re¬\nquired only to supervise the operation and load the\nprojectors.\nWe’d like to see more representation from educa¬\ntional stations at this IRE PGBTS meeting which is\nusually held the last week end in September. The\n1956 meeting was held in Cleveland; Pittsburgh was\nhost in 1957; and the 1959 meeting has tentatively\nbeen set again for Washington, D. C., with Detroit\nalso a possibility.\n—NAEB—\nThe Tenth Annual Convention of the Audio\n1"
}