{
  "id": "d1810-0",
  "text": "September 26, 1944\nCONFIDENTIAL MEMORANDUM\nTO: Educators who have indicated their intentions of appearing\nas witnesses at the forthcoming FCC allocations hearings\nFROM: R. R. Lowdermilk\nPURPOSE OF TlhS COMMUNICATION:\nA number of inquiries have been received by this Office, from those who\nintend to appear as witnesses, requesting information or advice on such\nmatters as how to organize testimony for presentation, what kinds of ex¬\nhibits to prepare, and the like. Since the very limited amount of time\nbetween now and the time we shall be called to appear, will not permit\nanswering these inquiries' individually, this memorandum has been pre¬\npared, for circulation ONLY to those whose names appear on the attached\nlist of witnesses, in an attempt to provide the kinds of information and\nadvice that have been requested.\nIt is expected that all of those to whom it is addressed will fully ap¬\npreciate its confidential nature, and will carefully refrain from either\nquoting it as a source, or allowing any part of it to be published. I\nmight add, further, that it is written purely as the advice of one indi¬\nvidual, who has been closely associated with the particular problems\nwhich confront education at this time, to other individuals presumed to\nbe interested in the same problem, fmd that, as such, it has positively\nno status as an \"official pronouncement\" of the U.S. Office of Education.\nR.R. Lowdermilk\nTHE' SPECIFIC PROBLEMS WHICH CONFRONT EDUCATIONAL FM BROADCASTING:\nWartime developments in various types of radio communications and indus¬\ntrial processes based on the use of radio-frequency energy have vastly\nincreased the demand for operating space in the radio-frequency spectrum.\nNot only must operating space be found within the usable portion of the\nradio-frequency spectrum for new services, but some of the existing ser¬\nvices have found that they will need additional frequencies or channels.\nSince the demand for frequencies greatly exceeds the supply, the Federal\nCommunications Commission is holding a series of hearings, beginning on\nSeptember 28, at which all requests for operating frequencies will be ex¬\namined in the light of the total number of usable frequencies available,\nand in the light of the importance of each of the services."
}