{
  "id": "d1810-10",
  "text": "- 11 -\nIn the absence of any clear mandate from the' states, the Office of\nEducation witnesses mil re-affirm the belief that education should be\nguaranteed access to a sufficient number of relay frequencies to\npermit the eventual linking together of educational FM broadcast\nstations, should this be found desirable. It would be advisable for\nany of the other educational witnesses who have any definite opinions\non this matter to cover this point in their testimony. (Perhaps Mr.\nHiggey, of Station WQSU, ought to cover this point in his testimony,\nin particular.)\nIt DOES APPEAR to be rather DEFINITE that S-T frequencies (i.e.-frequen¬\ncies for use in connecting outlying production centers to the educational\nFM station transmitters by means of low-power relay transmitters) WILL\nBE NEEDED in every state where planning has progressed to the point where\nactual transmitter locations have already been determined. Hence, it\nwill be advisable for educational witnesses to include, in their testi¬\nmony, some mention, at least, of this need, such as affirming the belief\n\" \"the \"education must be assured access to a sufficient number of S-T fre¬\nquencies to permit the linking of each transmitter to up to 6 outlying\nprogram-production centers.\"\nAs for Commissioner Studebaker's request for \"at least two television\nchannels\", frankly, I am at a loss as to how to advise educational wit¬\nnesses. Several .schools had expressed an interest in \"going into television\nafter the war\", and, consequently, we assumed that our request to the\nFCC should protect education's interests on this point. However, the.\ngeneral impression of school people with whom we have had an opportunity\nto discuss this point seems to be that, unless the cost of television\nfacilities can be very greatly reduced below what it is now, few school\nsystems (if any) are likely to be able to afford to construct television\nstations. Moreover, very few schools systems have expressed themselves\non this point, either one way or the other, in their contacts with this\nOffice, and such interest as has been indicated goes little farther\nthan speculation as to how television might serve education.\nConsequently, in the absence of any definite mandate .from public educa¬\ntion, \"the Office of Education witnesses will simply re-affirm the belief\nthat education should be assured access to channels for the operation\nof television broadcast stations, should it ever be found economically\npracticable for schools to undertake educational television broadcasting\nover their own non-commercial television stations.\nAny of the educational witnesses who have definite convictions on this\npoint, or who may happen to be in a position to judge whether or not\nschools are likely to be in a position to use television frequencies in\nthe not-too-aistant future, should cover this point in their testimony.\nTIME AND PLACE. OF THE HEARINGS:\nThe hearings are to be held in the Interdepartmental Auditorium, in\nWashington, D.C., which is located on the north side of Constitution\nAvenue, between 13th and 14th Streets, Northwest."
}