{
  "id": "d848-25",
  "text": "KIT NOo 5: \"GLUE TO MAKE IT STICKS (The Elementary Teacher and\nthe Television Lesson)\"\nGENERAL STATEMENT OF THE FILM:\nGood elementary classroom teachers should USE television lessons,\nnot just FOLLOW them. We cannot count on automatic learning just\nbecause the child is face-to-face with an instrument of learning or\njust because he has witnessed a commendable presentation. Tele¬\nvision, like any other instrument, can bring the lesson and the child\ntogether. The classroom teacher must apply the glue which makes the\nlesson stick!\nIt is not enough for the classroom teacher to be \"an echo\" or a\n\"caboose\" simply parroting or re-teaching the Lesson content. As\nmanager of the learning situation, the classroom teacher has the\nprimary responsibility for clarifying, extending, reinforcing the\nconcepts involved.\nThe television lesson can be \"geared\" to any of the many methods\nwhich teachers know so well; so can the preparation for the tele¬\nvision lesson and the follow-through.\nHow each teacher in the classroom makes his or her glue, then,\ndepends upon what is to be accomplished, what objectives the teacher\nhas in mind, what kind of learning is sought (skills, knowledges,\nattitudes, values, understandings, and/or appreciations.) It depends\nupon the purpose of the television series as a whole, the purpose of\nthis specific lesson (as specified in the Teacher's Guide), and\nthis teacher's own purposes in using the lesson.\nAnd it depends, in important measure, upon this particular teacher's\npersonal \"glue\" recipe...compounded of the teacher’s special touch\nand personality, the teacher’s own skills and strengths, the available\nresources, the procedures which have proved effective in personal\nexperience, the activities geared to the abilities, interests, and\nneeds of a particular class or even to particular pupils within the\nclass.\nThe film will show one particular teacher U3ing a particular tele¬\nvision lesson with a particular elementary class, to indicate some\nof the activities and procedures to be coordinated with the tele¬\nvision lesson in preparation and follow-through, toward providing an\neffective learning experience. The film will suggest other activities\nwhich could have been used, and will suggest that the viewing teachers\nprobab3.y will think of others, equally or more effective for them\nand their own pupils.\nOUTLINE OF CONTENT;\nI. Narrator introduces topic\ns 30"
}