{
  "id": "d982-13",
  "text": "9\nchannels—under civic rather than governmental control.\nIn these times when the independence and even the existence of America\nis at stake and consideration of public affairs is a matter of national concern,\neducational broadcasting has the continuity of dedication and freedom to build\na steadily growing audience in every community composed of responsible opinion\nleaders willing to devote themselves to the consideration of fundamental issues\nand to the interpretation of these matters few: the benefit of their fellow citizens.\nEducational broadcasting, properly supported, can supplement frivolity by responsi¬\nbility in the fostering of civic enlightenment.\n.Special Activities tp Support Civic Education\nIt is proposed that varied but systematic educational opportunities in citizen¬\nship training be organized, both re-inforcing the skills and knowledge of present\npersonnel in education and educational broadcasting and through the development\nof materials for use by the broadcasting media in serving both students in school\nand adults at home •\nA. Seminars\n1. Publlc„AllSlrs Seminar for EducatlonaLBr^idcasters\nA national meeting bringing together producers, directors, writers from\nthe field of educational broadcasting for consideration of the nature and purpose\nof public affairs broadcasting, the special role of educational stations in such\nprogramming, and the techniques for Its most effective presentation. A leading\nuniversity would cooperate with the NAEB to host the five-day session. Top con¬\nsultants from education and government would participate.\n2- leaGherf Seminar cm Comparative Government\nA meeting of history, civics, social science teachers and supervisors\ncharged with the responsibility for citizenship training in the elementary and\nsecondary schools and interested in utilizing radio and television to help in this\nresponsibility. The two-week seminar would provide intensive instruction on the\nbasic nature of Soviet and American governmental systems, outline possible\ncourses of study in this area to be presented on radio and/or television for in¬\nschool use, would develop accompanying teacher manuals and study materials,\nand train teaching specialists in using both the materials and techniques of\neducational broadcasting in the organization and conduct of such broadcast\ncourses.\nThe hoped for outcome of such a seminar would be broadcasts of a\nnumber of courses in this area across the nation so that many more students\ncould be exposed to this specialized instruction by competent teachers."
}