{
  "id": "d982-14",
  "text": "10 -\nRecordings of the best courses developed could subsequently be distributed\nvia the instructional materials centers established by the USOE.\n3* Seminar in gomaflvt government for Administrators\nSince experience indicates that change in education is effected\nalmost exclusively by people on the administrative level, it is vital in intro¬\nducing new programs into the curriculum to convince administrators of the need\nfor change; consequently, it is proposed that a two-day meeting be held bringing\ntogether school superintendents, principals, supervisors, and curriculum\nspecialists for (a) consideration of the importance to our educational system\nof informing (rather than insulating) young people about the nature and intentions\nof the Soviet Union, and (b) for consideration of how the broadcast media may\nassist education by supplementing or providing total-teaching in this special¬\nized area—helping to introduce quickly a new subject area Into the curriculum\nand. handling “sensitive” subject matter with competence.\nSuch a meeting would need to have extremely competent subject\nmatter as well as technical specialists as consultants. AASA or ASCD would be\ninvited to be co-sponsors with NAEB.\n4* Sgfflinar in Public Affairs for Adult Education Leaders\nThis seminar would be designed to have adult education leaders under¬\nstand the effective educational uses of the broadcast media in advancing citizen¬\nship instruction. It would bring together those responsible for planning and\npresenting adult and continuing educational programs and university officials\nresponsible for organizing extension courses. Agenda would include effective\nutilization of broadcast instruction, organization of discussion groups, develop¬\nment of supplementary study materials, identification and development of dis¬\ncussion leaders. Development of a study - discussion program would be tied in\nwith adult education programs in public affairs envisioned in (i) and (2)\nbelow and attention would be given to various ways in which radio and television\ncan be utilized in a many - faceted learning experience tied in with other media,\nmaterials, and methods for the civic education of adults •\nB. Programs *\n1. Develop a series of television programs designed to improve public\nunderstanding of how our democratic society operates so more people will be\nstimulated to play a part in its future. Programs would be made available first\nto the National Educational Television and Radio Center for distribution to its\n65 affiliated ETV stations; subsequently programs would be offered to commercial\nstations.\n* To be produced at member stations such as WUNC-TV, Chapel Hill."
}