{
  "id": "d982-6",
  "text": "PROFESSIONAL DEVELOPMENT OF EDUCATIONAL BROADCASTING AS\nAN AID TO BETTER CITIZENSHIP\nAn American Imperative\nThe need for more education, and, what is more important, better education\nin the United States, is upon us in full force * The impact of a rapidly rising\npopulation is clear in the overcrowded classrooms, sub-standard facilities, and\ninadequate teaching force.\nOf even greater concern is the need for an increase in the quality of education.\nThe United States today is involved in a struggle for ideological survival;\neducation is the accepted basis not only for survival but for the beneficial and\nenlightened progress of our civilization.\nWe are appallingly ill-prepared to meet this challenge.\nIn 1957 Sputnik 1, suddenly awakened Americans to the realization that the\nSoviet Union was rapidly overtaking us in the capacity to wage modern war while\nstill holding fast to its goals of world domination. Inescapably this was a\nchallenge of one way of life to another way of life, a challenge of one philosophy\nand system of education by another philosophy and system of education. Events\nand disclosures have only added to this revelation and to our justifiable alarm.\nThe simple fact is that the Soviets are doing a better job in the survival curricula\nthan we are. We must find the means to surpass their performance while still\nholding firm to the human freedoms which are the basis of a democratic society.\nNot only must we strengthen the quantitative and qualitative productivity\nof the American schools, but there is also the vast and continuing task of pro¬\nviding adult Americans with the means and opportunities for greater learning;\nfor becoming reliably informed on national and international affairs, for over¬\ncoming illiteracy, for broadening cultural horizons, and for giving Americans\nknowledge of the history and development of other peoples and other countries\nand, especially, a greater appreciation and understanding of the heritage of\ntheir own country and the principles which are its reason-for-being.\nWhereas all education is important to the development of mature, informed\nand responsible citizens, there is an urgent need for selective emphasis upon\nthose areas which most directly relate to developing a committed and responsible\ncitizenry for effective participation in a self-governing society. In a time when\nour way of life is challenged as never before—Americans must find answers\nfor fundamental questions of values, purposes, and responsibility.\nThey will find such answers only in more and better education. Since\nour system of government rests upon the combined attitudes and judgments\nof all rather than of a few, education must be widespread and equally\navailable. Not only must education be activated widely but also intensively."
}