{
  "id": "d860-125",
  "text": "Program U\nProgram Title: \"ECONOMIC FREEDOM\"\nRecord Title: \"FREEDOM TO WORK\"\nHistorical Background\nThe incident of Jefferson's conversation with a poor French woman near\nFontainebleau, whither he himself had gone as a diplomat to be near the French\nCourt when Louis XVI was hunting there, is historical,being described in a letter\nto James Madison (Oct. 28, 1785; Koch & Peden, pp.388-389, where it is incorrect¬\nly addressed to Bishop James Madison). Certain of the details, however, are drawn\nfrom observations that he made elsewhere. His trip to the south of France is his¬\ntorical, and he talked with many poor people like the man in the radioscript.\nThis particular conversation is drawn from Jefferson's own extensive notes on that\ntrip and his references to it in letters. The conversation with LaFayette comes\nfrom correspondence with him. The imaginary dialogue with Madison is also drawn\nfrom letters,and one of Madison's comments (not in the radioscript) is of special\npertinence today. As the text suggests, he doubted if the ills of France would be\ncured, even if idle lands were distributed to the landless, and he pointed out\nthat misery seemed to be an accompaniment of a dense population. This was before\nthe pronouncement of the Malthusian Doctrine, which it partly anticipated. It\nmay not have been true with respect to France at that time, but it has definite\nbearing on the plight of overpopulated regions in Asia and elsewhere today. In\nmany of these regions the ratio of land to people would be very low even though\nthere were an equitable distribution. Also, the lack of distress in the United\nStates then and later could be attributed very considerably to the highly favor¬\nable ratio between its physical resources and its population.\nFor dramatic purposes Jefferson's fight against entails and primogeniture in\nVirginia has been telescoped somewhat and thrown chiefly into an exchange of argu-\nExperimental Discussion Program Subject to Revision\n31"
}