{
  "id": "d860-127",
  "text": "Argument\nJefferson favored the maximum of economic freedom in all fields, hut, because\nof the conditions of his time and his own proclivities, he laid major emphasis on\nagriculture. In his day the overwhelming majority of the American people were en¬\ngaged in farming, and he was convinced that a self-sufficient farmer was the freest\nman on earth. The vast North American continent was only beginning to be opened up,\nand there seemed to be plenty of land for an indefinite future. From the beginning\nit had been easier to acquire land in America than elsewhere, but here as elsewhere\nit tended to get into the hands of a favored few. Large grants were made to favored\nindividuals and in certain regions this sort of inequality tended to be perpetuated\nby the laws of inheritance.\nJefferson was convinced that a society that comprised many small holdings of\nland was far healthier than one that consisted of a few large ones, but the equality\nwhich he sought was not that of economic status but of economic opportunity. He\nhimself was a large landholder, veiy tenacious of his beloved acres, and he did not\neven dream of a policy of confiscation. The main object of his economic statesman¬\nship during and Just after the American Revolution was to get rid of laws which\nartificially buttressed great estates and imposed artificial obstacles to the acqui¬\nsition of land. He wanted to make it more available to all the people for homes and\nfarms. This was the purpose and meaning of his successful fight against entail and\nprimogeniture in Virginia, which he began to wage in 1776 - before he went to Europe\nas minister and saw there inequalities of economic opportunity such as he had never\nseen in America. Also (though this does not enter into the radio program), he sought\nat this time and afterwards to make western lands, as they were opened up, available\nto bona fide settlers on easy terms and to prevent them from being gobbled up by\nspeculative companies. His prime interest was always in the small farmer who would\nhave a stake in society when he became a landowner and could then enjoy genuine per¬\nsonal independence.\nThe radio program begins with an episode in France and it eventually flashes\nback to earlier events in Virginia. In pre-Revolutionary France he saw conditions\n33"
}