{
  "id": "d860-133",
  "text": "The radioseript in this program differs from all the others in that it is in\nthe form of a monologue in which Jefferson summarizes these experiences and com¬\nments on them. At first glance he seems to have been inconsistent on the subject\nof the press. While he was in the absolute monarchy of France, before the French\nRevolution, he had this to say about his own country: \"The basis of our govern¬\nments being the opinion of the people, the first object should be to keep that\nright; and were it left to me to decide whether we should have a government with¬\nout newspapers, or newspapers without a government, I should not hesitate a moment\nto prefer the latter.\" He qualified this extravagant utterance by adding that \"ev¬\nery man should receive these papers, and be capable of reading them.\" That is, the\nenlightenment of the people in public matters seemed even more important that the\ninstitutions of government, since the latter had been created by the people and\ncould be created again. But he had no such confidence in the press as an agency\nof public enlightenment during his own presidency. Then,in a moment of deep gloom,\nhe said in a private letter: \"Nothing can be believed which is seen in a news¬\npaper\" . His own disillusioning experiences had served to illustrate the abuses of\nfreedom. But he never surrendered his conviction that a free press is indispensable\nin a self-governing society; he was confident that a dishonest press would prove\npowerless in the end; and he always relied on the corrective power of public opin¬\nion.\nThe major question dealt with in this particular program is that of public\ndiscussion and criticism of public men and measures. (For reasons of convenience,\nthe question of ideological differences is dealt with in the next program, on Free¬\ndom of the Mind). The struggle in Jefferson’s time was, in reality, between two\ndifferent conceptions of government. According to one, the government and gover¬\nnors of a country were the masters of its people, and criticism could not be tol¬\nerated because it would weaken authority. The American Revolution had sought to\noverthrow that conception in favor of another: that the government and its offi¬\ncials were servants of the people, and thus hoth public men and public measures\nwere open to criticism. The old philosophy underlay the Sedition Law which was en-\n39"
}