{
  "id": "d860-155",
  "text": "ous friction between the Massachusetts colonists and the home government, the red¬\ncoats comprised a small garrison - a petty army of occupation - and they were cor¬\ndially hated by the Boston populace. The most active local patriots, like Samuel\nAdams, sought to make life so miserable for them that they would be withdrawn, and\nthey were much abused by the taunting mob. It required the highest sort of moral\ncourage to defend them. John Adams, a rising man but still young and poor, risked\nhis professional and political career by taking this case. On patriotic grounds\nhe deeply resented their presence in Boston, but he believed that the violent pa¬\ntriots were distinctly in the wrong in arousing the mob against them. He was\nchiefly moved by a sense of duty and fairness. As Jefferson put it in the radio\nprogram, \"someone must rise to speak for the reviled, for the man who is hated,\nfor him who is contemptible and unbefriended.\" Otherwise, there can be no real\njustice.\nJefferson draws the moral on the story in which Adams appears as hero. He\nmight have employed even broader terms. He might have said that true lovers of\nliberty, of self-government, and of representative institutions must ever be vigi¬\nlant of the means employed in pursuit of ends. Nothing is more characteristic of\nmodern totalitarianism than the assumption that their ends justify any means. That\nwas not the philosophy of Jefferson and John Adams, and at this time Massachusetts-\nBay was still a royal British province, living under a regimen of law in which the\ncolonists themselves participated. Technically, the Crown was prosecuting these\nsoldiers, and this in itself is an example of the historic English regard for law.\nThe court and jury also deserve credit at the bar of history. They, with Adams,\nwere in the great Anglo-American tradition of impartial justice.\nIn this historic instance fair trial and fair play rose above personal passion\nand fierce local patriotism, and essential justice was done an unattractive group\nof men who were unimportant in themselves. If the conditions of our time make\nthis sort of thing more unlikely than it used to be in our country or anywhere\nelse, one of the priceless traditions of mankind is in danger.\n63"
}