{
  "id": "d860-166",
  "text": "one in which the hest people are the recognized leaders. Thus they addressed them¬\nselves at last to the question of leadership in a free society. Hereditary pri¬\nvilege will not provide it, and there is no absolute assurance that political de¬\nmocracy (universal suffrage, majority rule, etc.) will. There is a great danger,\nwhich Adams perceived more clearly than Jefferson, that a democratic society will\nhe scornful of talented men and will become so corrupt as to scorn men of high\ncharacter. History affords many examples of the rise to power of unscrupulous\ndemagogues who enjoy immense popularity. Sometimes these have been men of great\nability, but very frequently they have appealed to emotion and prejudice rather\nthan to intelligence, and all too often they have been lacking in character.Jef¬\nferson, while aware of the danger that a free democratic society might not choose\nthe best leaders, believed that it generally would, and thought it much more like¬\nly to do so than any other sort of society. More than Adams, he was a man of\nfaith. This confidence in the essential wisdom of free men is the finest part of\nhis heritage to posterity. Indeed, it lies at the heart of it. Adams, who re¬\ngarded himself as more realistic, valued it, nevertheless. Jefferson steered his\nbark \"with Hope in the head, leaving Fear astern\"; and, at last, Adams wanted to\nsail with him. It was of the dauntless faith of his old friend that he must have\nbeen thinking when he said, on his own deathbed, \"Thomas Jefferson still survives\".\nQuestions and Topics for Discussion\n1. What do you think most people mean by the term \"aristocrat\" when they use it\nin our country in our time? Wealth? Birth? Manners?\n2. Would you say that aristocracy of birth represents any problem in our own day\nin America?\n3. Is there a problem of aristocracy of wealth? Is this \"aristocracy\" likely to\nbe perpetuated, or can we rely on the old saying, \"three generations from\nshirtsleeves to shirtsleeves\"?\n4. What did John Adams mean when he said that aristocracy was \"wrought into the\nfabric of the universe\"?\n5. Did Jefferson argue that all men were naturally equal?\n76"
}