{
  "id": "d1307-0",
  "text": "WASHINGTON REPORT\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue, N.W., Washington, D.C., 20036\nVolume V Number 8\njyfoy 15, 19 64\nFORECAST OF ETV STATION ACTIVATIONS\nPredictions are always dangerous, especially when they concern the immediate\nfuture because of the greater risk of recall. Nevertheless, estimates are necessary to\neffective planning. In the course of preparing for educational television expansion under\nthe Educational Television Facilities Act (P.L. 87-447), administered by the Department\nof Health, Education, and Welfare, inquiries as to expected station expansion were sent\nto the legally designated educational television authorities in 39 States (and Puerto\nRico) where such authorities exist. In addition, inquiries were sent to informed leaders\nin a number of States including the 13 States (and the District of Columbia) where State\nETV authorities are not now designated. Responses were received from 46 of the 52 juris¬\ndictions. While the individual responses are privileged, totals based on them will prove\nof interest to those with educational, operational, or programing responsibility in\neducational television.\nDuring the period from July, 1964 to June, 1965, applications were predicted from\nthe 46 jurisdictions which would require a total of $l6.1 million in Federal matching\nassistance. In addition to the predicted expansion projects for existing stations, it\nwas expected that a total of 65 new stations would be activated. The breakdown by NAEB\nRegions is as follows:\n13 New Stations in the 11 Northeastern States of Region I\n(No reply from 1 State)\n22 New Stations in the 11 Southeastern States of Region II\n(No reply from 2 States)\n14 New Stations in the 5 Midwestern States of Region III\n3 New Stations in the 6 North Central States of Region IV\n6 New Stations in the 8 Central States of Region V\n(No reply from 3 States)\n5 New Stations in the 10 Far Western States of Region VI\nIt should be remembered that State authorities are not in every case aware of\nplans being made by private groups and independent non-profit organizations. Additional\nrequests from these agencies can be expected.\nr\nIt was predicted in February, 1963 that a total of 31. new stations would begin\nconstruction by July, 1964. As we enter the final quarter of the first full year of the\nprogram, this estimate still seems reasonable, even though a few applicants have encount¬\nered temporary difficulties in meeting the assurances required under Public law 87-447-\nIt is not unreasonable to hope that by July 1965 after two years of Educational Television\nFacilities Act operation, the number of educational television stations in the United States\nwill more than double.\nThis Washington Report was prepared for the NAEB by Dr. John W. Bystrom, Assistant to the\nUnder Secretary, for Educational Television in the Department of Health, Education, and\nWelfare."
}