{
  "id": "d1307-2",
  "text": "STUDENT NEWS BROADCASTS AT WSUI\n-)\nCarl Menzer reports a program development at WSUI which\nwill be of interest to stations wishing to do more in the way of\nnews broadcasting.\n,fThe Daily Iowan of the Air” is broadcast at 8:45-9:00 A.M.,\nand 5:50-6:00 P.M., each day over WSUI. In conjunction with the School\noi Journalism and the university newspaper, ”The Daily Iowan,” the\nstudents prepare and present the nev/s broadcasts. A regular staff witi\neditors, reporters, rewrite men, and similar nev/s workers has been\nestablished to prepare the program material. Broadcasts arc handled\nby students who showed up best in the auditions. Radio writing and\ncommenting has been made a class activity in Journalism. From the\nAP wire, which comes into the Journalism office, and from stories by\nlocal reporters the broadcasts are kept timely. The feature is among\nthe most popular offered by the station.\nV.'CAC ABANDONED\nWCAC, member station of Connecticut State College, it is\nreported in \"Broadcasting” (June 1, 1956), has voluntarily surrendered\nits license to WICC, Bridgeport, Conn., with which it had a time¬\nsharing arrangement. It was planned that the college would use time\nover the commercial station. The station operated 5 hours per week\nwith 500 v/. power on the 600 Kc. channel, Daniel E. Noble reported\nto the N.A.E.B.\nNCER BULLETIN FEATURES NAEB DATA\nThe current issue of the bulletin of the National Committee-\non Education by Radio embodies the story of the NAEB S. Howard\nEvans, editor, welcomes pertinent contributions to his publication\nfrom educational radio sources. Send them to him at One Madison\nAvenue, New Yotk City.\nKOAC FEEDS NETWORK PROGRAM\nLuke L. Roberts and C. R. Briggs colloborate in telling us\nof the work of KOAC in staging a program for the NBC Farm and Home\nHour through Oregon State College at Corisallis. Featured on the\nprogram, jn May 20, were the State College Glee Club, R.O.T.C. Band,\nPresident Geo. W. Peavy, and other attractions depicting the institu¬\ntions contributions to the development of the state.\nNEW STATION\n\"Broadcasting” magazine reports on June 1: \"A new college\nstation, to operate from Mfddlcsboro, Ky., with 100 watts full time\non 1210 Kc., was authorized May 29, by the F.C.C. Broadcast Division\nto Lincoln Memorial University, Harrowgate, Term. The transmitter\nand studios, however, would be in the Kentucky town.”\nAn inquiry to the President of the institution for further\ninformation has brought no reply."
}