{
  "id": "d1894-2",
  "text": "- 3 -\nSHORT FLASHES FROM THE FIELD\nWCAL - St. Qlaf College. M. C. Jenson, Manager, writes, \"We are afr:id we\nhave been rather lax and silent here at WCAL during the past few months but we\nreally have boon alive and working hard. In case you are still interested in the\nWCAL and WLB situation, I am sorry to report that there is no change in the status\nof our application. We recently petitioned the Commission to have one of the\nprotests thrown out on the grounds of irrelevancy. The consensus of opinion, even\namongst the opposition, is that we will eventually be granted our construction\npermit. However, it will very evidently require a hearing with its subsequent de¬\nlay of several months. We feel that this is extremely unfortunate since it de¬\nprives the listeners of the Northwest of practically one year of non-commercial\nbroadcasting.\nThe station personnel is:\nMartin Heglond, Chairman of the Radio Board\nM.C. Jensen, General Manager\n0. R. Overby, Musical Director\nSigne Hovick, Secretary\nDavid Johnson, Production Manager\nPlans are going forward for a new studio building which it is hopod will be\nerected and completed before the opening of school next fall. If we can also have\nour application for additional power and change of frequency granted so that con¬\nstruction con be completed by September, next year should mark a significant mile¬\nstone in the history of WCAL as having been passed. For the present we are not\nentirely marking time, yet it is true that most of our plans are being made with\nan eye to future expansion.\nKUSD - University of South Dakota. Director B. B. Brackett says, — \"At\nKUSD we are still working hard on our new transmitter, and we hope to have it on\nthe air in another week or two. We believe it will be good, and we hope we can\nthen persuade those who hold the purse-strings to let us go on to the construction\nof a new and better *uitenna.\nWOI - Iowa State College. Director W. I. Griffith sends this word, \"This is\nthe 5th or 6th year that our Department of Public Speaking has debated with some\nof our neighboring colleges in Iowa and adjacent states. In some instances the\ndebate is curried on by means of having the visiting college present their material\nby recordings. This worked out rather well in one or two cases and of course cuts\ndown the expense of travel. For several years Iowa State College has debated\nstudents from Drake University on the State High School question. Copies of the\nmanuscripts have been made available to high schools within the state who might\ncare to use them and many young debaters get some ideas as well as using it as\nsource material in the .preparation of their own debates.\nKWSC - State College of Washington. Kenneth E. Yeend, Program Director, sent\na sad message, \"You will be interested to know that Dr. Nalder died Sunday night,\nJanuary 17, following a severe heart attack, a trouble with which he had been af¬\nflicted for a number of years.\n(See report on Dr. Nalder*s death in this letter.)\nWSUI — University of Iowa. That Carl Menzer, Director, has been doing some\nthinking is shown by the following: \"I just completed another bunch of program\nsuggestions which may serve as a stimulant to program directors of educational\nstations. This makes a total of ninety-eight suggestions from which it seems that\none might be able to pick two or three good ones. I can have a limited number of\ncooies made if you think they will do any good.\n(Why not let us non them as a supplement to the News-Letter, Carl?)"
}