{
  "id": "d1824-2",
  "text": "NAEB NEWS LETTER.\nFEBRUARY 1, 1941\nPage 3\nBROADCASTING COURSES INCREASE\nThe RADIO DaILY reports that increased attention is being paid\nto broadcasting as a university study and there is apparent\nincrease in the number of courses, including writing and technical\nclasses, according to an informal survey. These classes may be\ndivided into two general grotips—those conducted by correspondence\nschools ana those conducted at regular schools or colleges,\n\"These classifications may, however, be further broken down into\nthe types of subjects offered. There has been a decided trend\ntoward classes dealing with the business and dramatic aspects\nof broadcasting, as distinct from technical studies, at colleges\nduring the past two years. For example, NYU offers not only\nclasses in writing, production, music, but has recently added\ntelevision programming to „its curriculum?\nRADIO IN EDUCATION\nIn the November, 1940, the entire issue of the \"Educational Press\nBulletin,\" official publication of the Illinois Office of Public\nInstruction, was devoted to radio in education. Authors con¬\ntributing included Harold W, Kent, Director of the Chicago Radio\nCouncil,\nFINAL ACTION\nThe Federal Communications Commission has approved Recommendations\nof the Engineering Conference, just concluded at Washington, D, 0,,\nunder the North American Regional Broadcasting Agreement, Habana,\n1937, and has released the revised list of United States frequency\nassignments which will become effective at 3 a.ra., Eastern Standard\nTime, on March 29th next.\nThis confirmation of the work of the conference is the final step\nin order to carry out provisions of the Habana agreement entered\ninto by Canada, Cuba, the Dominican Republic, Haiti, Mexico, and\nthe United States,\nAbout 200 matters in conflict were eliminated at the engineering\nconference. Under the agreed allocation, 795 of the 883 standard\nbroadcast stations in this country will begin operation on the\nnew frequency assignments as specified in the revised list,\nFCC ACTIONS\nT7BKY, University of Kentucky, has had its application for change\nin frequency, etc,, reinstated, (i/l5/4l)\nMunicipal Broadcasting System, New York City, filed an application\nfor an FI.: station on 46,700 kilocycles, (1/15/41)\nWTAW^ Texes.A <V.M, applied for an extension of time on its construct¬\nion permit, (1/15/41)"
}