{
  "id": "d1217-15",
  "text": "Following witnesses will be:\n-16-\nBuryl Lottridge, WOC\nRalph Hardy, KSL\nPhil Miller, Gannett Newspapers\nWilliam Quart on, WMT\nWilliam J. Scripps, WWJ\nDr. Frederick Siebert, University of\nE. R, Vadeboncoeur, VSYR\nUnited Automobile Workers, CIO\nGordon P. Brown, WSAY\nT. A. M. Craven, WOL\nLouis G. Caldwell, WGN\nFrank Waldrop\nAmerican Veterans Committee\nIllinois National Lawyers Guild\nCooperative League of U.S.A.\nJames L. Fly\nPROPOSED FCC OPERATOR RULE MODIFICATION\nThe FCC has announced proposals for modifications of its Rules and\nRegulations for the establishment of three grades of Broadcast Oper¬\nator licenses, and given notice of a public hearing in the matter, to j\nbe held in Washington May 10 and 11*\nA new group of commercial operator licenses, to be called the Broadcast j\nOperator Group, will be established. In their comparative order from\nlowest to highest the licenses within this new group will be called\n(a) Limited broadcast operator license :\n(b) Broadcast technician-operator license\n(c) Broadcast engineer-operator license j\n*** **--*\nN-A-E-B SALUTES ANOTHER NEW EDUCATIONAL STATION IN DETROIT\nOne of the newest additions to the roster of school stations is the Detroit Board\nof Education’s FM station, WDTR, which presented its inaugural program early in\nFebruary. On hand to help give the station its send-off were Detroit and Michigan\neducators as well as representatives of several local commercial stations. Kathleen\nN. Lardie, manager of the new station, has set up a daily broadcast schedule of 4i’\nhours. Besides their own productions, the station is carrying Columbia’s, \"American\nSchool of the Air,” Each day an hour and a half of concert music is broadcast into\nDetroit school lunch-rooms.\n|\npetroit station WWJ-TV televised the entire performance which illustrated types of\n{programs to be presented over the station,\ni\njWDTR is only one of several such stations planned for the state of Michigan, another\njof which will be an outlet at the university in Ann Arbor.\nL-,-----"
}