{
  "id": "d1217-17",
  "text": "-18-\n3. To provide the student bodv with a service supplementing the information\nnormally provided by a student newspaper.\n4• To supplement classroom instruction in radio broadcasting.\n5• To develop the talent\"normally found on a large urban university__campM>\nIn general, the type of service offered by W'AER is not now available in degree\nand sometimes not available in kind from existing stations. W'AER now broadcasts\na regular schedule of 25 hours each week, 4^00 p.m, to 9«00 p.m,, Monday through\nFriday, with special events broadcasts wherever and whenever they are considered\nto be of interest to the campus community.\nTraining Values\nThe training values of the transmitter cannot be overlooked, ft1hen the experimental\ntransmitter was installed, approximately 600 students were enrolled in one or more\nradio courses.\nWhen WAER went on the air the students were immediately organized into a staff,\nmodeled after a regular radio station staff from program director down through\nthe line to typists and file clerks. Five seniors, carefully interviewed and\nscreened by the radio faculty, took the positions of program director, production\nchief, chief writer, news and promotion director, and chief engineer. These seniors\nheading up about 40 other WAER staff members, have handled the entire operation of\nWAER from the overall planning of schedules to the details of mimeographing\npublicity pieces. However, the faculty, is in direct supervision of all programs\naired over the station to insure that at no time will the quality of programs\nbroadcast be sacrificed in the name of training. Quality and service are of primary\nimportance in the broadcast of university programs; training, secondary.\nFuture of WAER and Educational Broadcasting\nThe future goals for the 2w-watt station at Syracuse are.(l) an increase in power\nand (2) to continue to supply needs of the area served with programs not provided_\nby other stations.\nW'hile the 2g?rwatt transmitter has proved that it can serve a limited area with a\nminimum initial cost for transmitting equipment, it is felt that any institution\nentering the educational broadcast field should consider it only as a \"budget\nentrance.\" It should plan as soon as possible to seek an increase of power to\ngain more effective coverage.\nIf the present trend to duplicate AM and FM programs spreads..it appears that\ncommercial FM will be different from the present AM broadcasting only in the_clarity\nof signals—not in the type of program. This gives the educator intending to__go\ninto broadcasting even greater incentive—the incentive to fill the gaps with pro¬\ngrams designed \"to meet the needsof the community, programs which reflect the cul¬\nture of the educational institution.\n*Ed Jones was employed by WSYR in 1938, went into the Service in 1940, stayed in the\nService until 1945 and has been employed by Syracuse University since then. Ed\nteaches program planning and building and news writing."
}