{
  "id": "d1217-4",
  "text": "-5-\nRADIO PROGRAMS HAVE IMPROVED. POLL SHOWS\nMore than two-thirds of the radio listeners queried by 64 Indiana University stu¬\ndents in 50 hometown communities think radio programs have improved, according to\nthe second annual university radio poll.\nDr. H. J. Skornia, N-A-E-B member and director of radio, Indiana University,\nBloomington, announced that the survey, included a telephone check of Bloomington,\nshowed that a total of 66.1% of Bloomington listeners thought radio had improved,\n11.5/o felt it was getting worse, and 22.4% noticed little change. In other cities\ntested, 71% were of the opinion that radio was improving. 15% thought they Fere\ngetting worse. 14% saw no appreciable change.\nMOKE RADIOS IN HOMES\nMore homes have two, three, and four or more radios in the United States today\nthan at this time last year when CES made a comprehensive survey of radio owner¬\nship, the American Music Conference reported recently in Chicago. The report also\nshowed that homes not having any sets decreased nearly one-third.\nNIELSEN ADDS A NER DEVICE\nA new Audiometfir developed by the a.C, Nielsen Co., will enable simultaneous measure¬\nment of AM, FM, and Tele audience, whether the three are combined in a single\nreceiver or arranged in separate sets* The new device will also measure listening\non up to four radios simultaneously on a single record.\nNORTHr.ESTERN UNIVERSITY’S SUMMER RADIO INSTITUTE\nThe opening of the seventh annual NBC-Northwestern U. Summer Radio Institute irt\nChicago is scheduled for June 28. The six-week sessions mil offer 12 courses in\nadvanced radio training, including a newly-created one in station management.\nJudith raller, director of public affairs for NBC’s Central Division and head of\nits education department, and Don Fedderson, chairman of the radio department of\nNorthwestern’s school of speech, will serve as co-directors of the Institute.\nIn addition to the 12 courses offering university credit, a series of six weekly\nsymposiums is scheduled. Subjects will include audience measurement, news, tele¬\nvision. and codes._There will be one session on any currently controversial pro¬\nblem in broadcasting.\nS-T FREQUENCIES ALTEi-ED IN FCC NOTICE\nUltra-high frequency studio-transmitter (S-T) broadcast equipment for the 940-952-\nmegacycle band will soon be available for broadcast use, the FCC said in a public\nnotice Thursday (18). Equipment for this band heretofore has not been readily\navailable, for which reason some stations have been operating S-T links under\ntemporary authorization in television channels on a non-interference basis.\nThe Commission notice said that it is now apparent, in view of the demands of tele¬\nvision broadcasters for television channels, the increasing number of FM stations,\nand the availability of equipment for such links, that stations holding temporary\nauthorizations for S-T operation on frequencies not now allocated for the purpose\nshould plan to change operation to the 940-950-megacycle band at an early date.\nThe notice added that FM broadcast stations contemplating initial S-T operations\nshould plan to begin such operations in this band. The availability of equipment\nfor operation in the band was demonstrated at the General Electric symposium held\nlast week in Syracuse. New York,"
}