{
  "id": "d1217-7",
  "text": "-8-\nCN\nUNIVERSITY OF CALIFORNIA PLANS NET: FM STATION\nAnother one of America’s leading educational institutions, the University of\nCalifornia in Berkeley plans a new FM Broadcasting unit.\n| The Associated Students of the University of California have approved a\nproposal to Robert Gordon Sproul, president of the University.wherein they\n| offer to underwrite broadcasting equipment and studio facilities for a\n| three year period,\nj It is hoped the new FM unit will incorporate a wide use of sound-recordings,\nplay-back equioment, and general studio facilities for student training and\npractice as well as the overall service to the adult public listening audience\n! in the area,\n! The University of California, now an associate member of N-A-E-B, will assume\nj active membership with completion of its FM broadcast facilities.\nMIDREST COLLEGE HELD APRIL RADIO CONFERENCE\nSecond annual radio conference of Lindenw^ood College, St. Charles, Missouri, was\nheld April 23 with Dr. I, Keith Tyler, N-A-E-B member of Columbus, Ohio,.the\nfeatured evening speaker. Dr, Tyler discussed: \"Radio in the Re-Education of\nGermany.\"\nA panel discussion, \"Has Radio Come of Age\", highlighted the afternoon session.\nParticipants included: Miss Marguerite Fleming, radio consultant of Harris\nTeachers’ College, St. Louis; Kay Dady of KVK, St. Louis; Irving Dilliard of the\nSt,Louis Post-Dispatch; and Soulard Johnson, of KMCK, St. Louis.\nPiF-rAR RADIO SHORTAGES?\nPaul Porter, former head of the FCC, suggested today that the commission shape its\nlicensing policy to fit the possibility that production of civilian radio equipment\nmay be curtailed.\n\"I am not making any prediction that the government will curtail productionpf\nelectronics equipment, because I have no inside information,\" he said in an_intgr-\nview. \"But if it comes down to a choice between giving the equipment _to_tne_Boein^\nor Douglas companies, or to an FM station on Hogback Ridge, there’s no question,\nwhat the answer will be.\"\nPorter said it may be that the country has enough industrial capacity to.meet the\nneeds of an expanded arms program and also an expanded radio and television.broad¬\ncasting industry. But he reported that broadcasters are beginning to ask him\nquestions. The only source of an authoritative answer, he pointed out, would be.\nthe government itself. So far, Porter added, the FCC has made no announcement. He\nsaid:\n\"I assume that the FCC is going along with a peactime licensing policy.!!_He_said\nmany operators conceivably could be caught in the middle ofa construction program\nby a sudden government decision to channel electrical goods to armg_budlqin^a^^rtgr\nrecalled 'that one B-29 requires as much electronic equipment as one 10^k_ilowatt_.radip\n;station."
}