{
  "id": "d1758-4",
  "text": "-5*\n'’Personally, I believe that the presentation of radio plays offers one of the finest\nmethods that a university station can use for teaching by radio.\nwWe have two professors in the College of Agriculture who are presenting quite regular¬\nly a lesson in agronomy, which they \"broadcast in dialogue form. One appears as Profes¬\nsor Ed. and the other as Farmer Herb. I am inclosing a sample”.\nMr* Harold G. Ingham, Chairman of the Radio Program Committee, Station KFKU, University\nof Kansas, Lawrence, recently sent to this office several announcements relative to\ntheir future programs. Among these were samples of information on a series of discus¬\nsions on compulsory unemployment insurance, etc. Vie were quite interested in noting the\nprinted announcement of rules and regulations supplied to members of the University\nFaculty and students who assisted in providing programs for KFKU. I am listing below\nthe announcement which sets out in detail regulations governing their broadcast.\n\"To Members of the University Faculty and Students in Music and Other Departments Who\nAre Assisting in Providing Programs for KFKU*\n\"We are very grateful to all of you who are assisting in providing the radio programs\nthis year. The broadcasting is regarded by the University as a very important work\nand your part in it is a distinctly worthy service,greatly appreciated.\n”The experience of the N.B.C. and other broadcasting organizations has shown that\nradio listeners as a rule are impatient of long numbers, either addresses or music,\nand are very insistent that programs shall begin and proceed according to advertised\nschedule.\n\"Because of these considerations and some others which may be apparent, the station is\ncompelled to ask its contributors to observe certain procedures, as follows:\n1. Program contributors should be at the station at least ten minutes\nbefore the advertised hour for broadcasting* Strict observance of\nthis request will save the announcer many anxious moments.\n2. Faculty members responsible for musical programs should furnish the\nnames of those appearing on each program at least one week in advance * ,\nand the numbers to be presented at least two days in advance.\n3. Every address offered must be written in full and read into the micro¬\nphone, not rapidly, and with clear enunciation. The address should\nbe timed to occupy approximately 10 minutes--12 minutes should be the\nlimit.\n•'. Similarly, no musical number should exceed 12 minutes in length.\n4. Copies of each address should be in the hands of the program director\nat least one week before the date of performance. Advance publicity\nwill be sent out to the press unless the author especially requests\nthat it be withheld.\n5. Care should be exercised not to use in any talk a quotation including\nprofanity or questionable language of any kind; also to avoid con¬\ntroversial subjects such as partisan politics, religion, prohibition,\netc.\n6. It is necessary to make sure that no advertising or publicity propa¬\nganda is included in any talk.\n”We are sure that our contributors will appreciate the necessity oF observing these\nsimple regulations and we wish to take this opportunity to thank you for your cooper¬\nation.”"
}