{
  "id": "d1758-5",
  "text": "-6-\nFROM MR, CARROLL GARDNER, ACTING MANAGER, WI, BIRMINGHAM* ”Thank you so much for the\ncopies of the special bulletin. We are delighted to receive this kind of material,\nand trust that you will keep us on your mailing list to receive all bulletins in the\nfuture,\nwThe first paragraph of your note contained this line - ”and one whose programs are\nnot subject to commercial sponsorship.” Let me clear up this misunderstanding. Wre\nare a member of the National Broadcasting Company, and also present nationally spon¬\nsored programs.\nHowever, we do devote about ten to twelve hours per week to educational broadcasting”.\nFROM MR. J. W, STAFFORD, MANAGER, RADIO STATION WBAA, PURDUE UNIVERSITY, LAFAYETTE,\nINDIANA* ’’This letter will express our appreciation for the bulletin sent us giving\nthe activities of various educational stations as well as comments.\n”YJe expect to send you two mimeographed bulletins at the end of each semester giving\na detailed account of Purdue University Radio Station activities as soon as this data\ncan be compiled,”\nFROM T. M. SMITH, DIRECTOR, STATION KIEVT, ST. LOUIS UNIVERSITY, ST. LOUIS, MISSOURI*\n”This is to acknowledge receipt of your three special bulletins of November 17th,\nOctober 9th and November 5th. Thank you for putting our station on your mailing list,\nI am quite sure that the information contained in them will be of immense service to\nus, as our problems are the same as those which arise in other educational stations.\n”1 hope before long to be able to write you in greater detail concerning the activities\nof our station.”\nI am quite certain that all program directors have received the bulletin released by\nSamuel French and Company of New York City entitled ”Drama on the Air,” a bulletin\ndealing with a survey of broadcasting of plays with a discussion of the field of radio\ndrama, directing for radio, writing radio continuities, and material available for\nradio prepared by Gwendolyn Jenkins, Director of Radio Dramatics, and Yfilliam E.\nKnepper, Publicity Director, of Station WEAO, Ohio State University, Columbus. This\nis an excellent contribution to the field of educational broadcasting and if you have\nnot already received the bulletin I would suggest that you send for it today.\nPresident A. G. Crane of the University of Wyoming, Laramie, Wyoming, has just releas¬\ned his annual report of the rv-adio Committee of the Association of University Presidents.\nIn a supplementary report he has issued .the bulletin listed below, in which I feel you\nwill be interested since it deals with a problem that has presented itself from time\nto time in the field of educational broadcasting. The bulletin roads as F'ollows*\nTO PRESIDENTS OF STATE UNIVERSITIES*\n’‘Supplementing the report of the Radio Committee I wish to call your attention to a\nnotable bit of research being conducted by Dr. W, Yf. Charters of Ohio State University\nunder a grant of money from the Payne Foundation. Dr. Charters has organized a researc!\nprojeot in radio education, the results of -which should give a much needed statistical\ntest of the educational values of radio broadcasting. Dr. Charters divides his study\ninto the following problems*\n1. The objectives of radio education\n2. Administration of the station\n3. Materials of instruction\n4. The broadcaster and his methods of presentation"
}