{
  "id": "d260-50",
  "text": "in the destiny of etv illustrates the\nrole of private philanthropy in\nAmerican society. The Foundation\ninvested heavily in educational tele¬\nvision for its potential in helping to\nmeet a national need. A philan¬\nthropic foundation has the freedom\n— and responsibility — to attack\nproblems that seem important even\nif they have not been explored. It\ncan take a chance in matters impor¬\ntant to the well-being of society\nwhere others cannot or will not ven¬\nture. And by its example, it can\nencourage the interest, ideas, and\nefforts of others.\n14\nBefore ETV stations took to the air, a nucleus of\nthe ETV movement operated over commercial tel¬\nevision facilities. While it was helping build ETV,\nthe Ford Foundation began “Omnibus,” an ex¬\nperiment to determine whether high-caliber adult,\ncultural television could compete for a large and\nloyal audience on a commercial-television net¬\nwork. ‘ ‘ Omnibus’ ’ ’ ninety-minute weekly telecasts\nbegan in November, 1952. It pioneered in history,\nmusic, biography, and drama. It won forty-eight\nmajor awards and an average audience of twenty\nmillion viewers for each program. The Founda¬\ntion gave “Omnibus” a net subsidy of $3.1 mil¬\nlion. By 1957, the Foundation concluded that the\nexperiment had demonstrated the wide accept¬\nability of “Omnibus.” The subsidy ended, and\n“Omnibus” has continued on commercial net¬\nworks under other auspices.\nTo sustain community support, ETV stations had\nto have enough good program material to remain\non the air more than two or three hours a day,\nfive days a week. Embryonic stations could not\nafford extensive live programming. ETV dipped\ninto millions of feet of “educational film” and\nfound it dated or generally unsuitable for aes¬\nthetic, legal, and technical reasons. To meet the\nafter-school programming needs of ETV stations,\nthe Educational Television and Radio Center was\nestablished in 1953 and has since been supported\nby the Ford Foundation. It is viewed through\nThe Learning Lens:III."
}