{
  "id": "d260-52",
  "text": "16\nScope\nThe Learning Lens: III\netv is growing so rapidly that a\nstatistical anatomy of the field can\nonly he approximate. As of the\nbeginning of the 1960-61 academic\nyear:\n—At least three million students\nin about 7,500 elementary and sec¬\nondary schools were receiving part\nof their regular daily instruction\nby television.\n—Perhaps as many additional\nstudents were receiving televised\n“enrichment” programs, material\nnot counted as academic credit but\nconsidered by educators a valuable\nsupplement to the curriculum.\n—About 250 colleges and univer¬\nsities were giving credit courses on\ntelevision to about 250,000students.\n—About 8,000 college students\npreparing for teaching careers and\nhigh-school teachers working for\nadvanced degrees in education\nwere or had been enrolled through\nAMERICAN\n»*tt€UC\nSCMOCtA\nThese are mimeographed study guides for courses\ntaught by television in the Detroit public schools.\nThey tell classroom teachers in advance that on\nMarch 10, the television teacher in ninth-grade\nWorld History will discuss the Thirty Years’ War.\n... The guide to an eighth-grade science lesson on\nchemical changes suggests that teachers ask their\nclasses to read about Priestly, Lavoisier, and Dal¬\nton and to identify the black material in a burnt\npie crust. . . . The guide for third-grade French\nlists in the new vocabulary for Unit 6, “The\nMarket,” the French for words like “basket,”\n“salesman,” and “I buy.”\nDetroit began telecasting courses in 1955. In 1957, j\nit joined the National Program in the Use of Tel¬\nevision in the Public Schools, supported by the 1\nFord Foundation and the Fund for the Advance- ]\nment of Education. It is fairly typical of school\nsystems using television for direct teaching for\ncredit: ETY neither blankets the school system|\nnor is it a token activity. Ninety-six of Detroit’s\n280 schools use one or more TV courses.\nThe ETV budget for the Detroit schools is about\n$200,000 a year out of a total school budget of\n$125 million. ETV is conducted by twenty-three j\non-camera teachers and twenty-four production,!\nevaluation, and supervisory personnel. No stu-j\ndent receives more than thirty minutes of tele-1\nvised instruction a day. In the ten to twenty-five\nminutes before or after the televised lesson, class¬\nroom teachers further explain the lessons, handle j\npupils’ questions, review and test, and present\nnew material. On-camera teachers spend the full\nweek preparing for and delivering a single tele-1\nvised course. They meet with classroom teachersj\nin four-week summer workshops and monthly\nduring the school year to plan the course and re¬\nview the effectiveness and shortcomings of the\ntelevised presentations.\nThe televised classes are larger than normal, aver-]\naging 150 pupils. As few as two classroom teach¬\ners can conduct such classes. Students are tested,\nbefore and after television courses, in intelligence,\nachievement in subject matter, and listening skill\nTheir performance is compared with that of ‘ ‘ con-!"
}