{
  "id": "d260-54",
  "text": "18\nScope\n300 colleges and universities in\nphysics, chemistry, and mathe¬\nmatics courses taught over “Conti¬\nnental Classroom.” Telecast over a\nnational commercial network, the\ncourses are watched by an addi¬\ntional 400,000 viewers not enrolled\nfor credit.\n—Fifty-four etv stations were\non the air and ten more were pre¬\nparing to go into operation before\n1962. The signals from these sta¬\ntions cover an area populated by\nseventy million persons, of whom\nan estimated twenty million are\nregular etv viewers.\n—The National Educational\nTelevision and Radio Center, with\nwhom the etv stations are affiliated,\nwas operating as a hind of “fourth\nnetwork,” exchanging recorded\nprograms among its affiliates by\nmail or other non-electronic means\nof delivery.\nThe Learning Lens: III\ntrol” classes taught without television. Detroit\nresults, reported by Dr. Elmer E Pflieger, coor¬\ndinator of the project, confirm what is by now an\nold story in testing the effectiveness of teaching\nby television: It is as good as or better than con¬\nventional teaching.\nNET, the National Educational Television and\nRadio Center, is headquarters and chief national\nspokesman for the fifty affiliated educational tele¬\nvision stations, and the main stimulus and ex¬\nchange medium for noninstructional programs.\nNET helps affiliates keep abreast of developments\nin ETV. Visits by station-relations staff, meetings\nof all station managers and program managers,\nand a monthly newsletter help stations compare\nnotes on fund-raising, promotion, and public re¬\nlations. One objective: to increase the audience\nfor programs distributed by NET. Another: feed¬\nback to NET of audience reaction to programs\nthat have been televised nationally.\nThe core of NET’s operations is the program\nservice. The Center provides each station eight\nhours a week of programs: six hours of new mate¬\nrial and two drawn from NET’s growing backlog\nof programs — about 1,900 hours at last count.\nMost programs come from the stations themselves.\nA program idea from a station is accepted by the\nCenter for national exchange on the basis of its\nquality and interest to other affiliates. The Center\npays most of the costs.\nOther program ideas originate at the Center and\nare farmed out to one of the stations for produc¬\ntion. Still other sources of programs: the British\nBroadcasting Corporation, the French Television\nNetwork, and occasional outstanding commercial-\ntelevision shows of educational value. Conversely,\nsome commercial television stations have pur¬\nchased NET programs, especially for showing in\ncities without ETV channels.\nNET claims the title of “fourth network.” The\nevidence: quality, educational content, flexibility, ;\nand visibility of its program service. “It’s not '\nblind reverence for the educational label that\nleads people to watch NET programs,” says an\nofficial. ‘ ‘ We ’re competing for their attention with |\nquality. We consider dullness a criminal offense.\nWe try to make our programs interesting without\nsugar-coating and without watering down the val¬\nidity of the educational material.”\nVisibility: ETV stations make such programming\navailable not just occasionally, or on a Sunday\nafternoon, but every evening, in the prime view¬\ning hours between dinner and bedtime.\nFlexibility: If a program is of unusual interest,\nmany ETV stations telecast it twice the same day\nor several times a week.\nContent: NET’s programming covers six basic\nareas: public affairs, children’s programs, sci-|\nence, the social sciences, humanities, and the arts.\nHere is a small sampling:\nPublic Affairs —“Prospects of Mankind,” the\nseries moderated by Mrs. Eleanor Roosevelt and"
}