{
  "id": "d260-62",
  "text": "26\nProps\ncousin School of Music; Dr. Ed¬\nward Teller’s model of molecular\nstructure; and the dramatic elec¬\ntron microscope views of living\ncells on “Patterns of Life.”\nIn instructional television, ob¬\njects and special effects produce a\nmarked contrast with conventional\nclassroom settings, etv overcomes\nthe time and cost limitations of\nbringing a thousand and one arti¬\nfacts, special maps, original docu¬\nments, photographs, sketches, and\nequipment into the classroom. Edu¬\ncational materials from museums,\nlibraries, historical societies, indus¬\ntrial plants, government agencies,\nand attics and basements are placed\nbefore the cameras. Some “ob¬\njects”—like a local water-purifica¬\ntion plant or the countryside of a\nforeign country—must be visited\nby the camera.\nThe television camera masks out\nThe Learning Lens: IV\n“It’s easy for pupils to turn a classroom into a\nside show, ” says Paul Guptill. He is recalling his\ndays as a teacher in Atlanta. “Many kids just\nwait for any opportunity to alter the mood of a\nserious lesson. I had to be careful about bringing\ndemonstration objects into the classroom. The\nmore common the object —an egg, let’s say—the\nmore it seemed to arouse giggling and wisecracks.\nThere’s nothing wrong with humor in the class¬\nroom, but when it gets out of hand, it’s at the\nexpense of learning.”\nNow a television teacher, Guptill can drive a\nsmall car into Atlanta’s educational-television\nstudio for a junior-high-school science lesson on\nthe conversion of fuel to power. “It takes time to\nposition the car and adjust the lighting so that\nthe camera can move around under the hood to\nshow the various parts,” he points out, “but none\nof this time is wasted in the ten classrooms receiv¬\ning the lesson. By classtime, everything is set up.\nI use the car as effortlessly as I would a test tube. ”\nJim Barfield, a colleague of Guptill who teaches\nhealth on television, almost seems to be present\nin the twenty-two classrooms his course reaches.\nIn a lesson on the blood and circulatory system\none day, Barfield pricked his finger under the\ncloseup lens of the camera. Several students\ngasped. The next moment the screen showed a\nphotomicrograph of blood cells magnified thou¬\nsands of times. Though physically removed from\nthe classrooms, Barfield sensed the reaction of\nsome of the students. “Now don’t any of you"
}