{
  "id": "d260-64",
  "text": "Props\ndistractions and fixes attention on\nthe object under discussion. Using\nscale models, etv alters space as\nwell as time. Simple painted back¬\ndrops or sets and occasional music\nenhance the televised communica¬\ntion of certain programs and les¬\nsons.\nShowmanship, while never an\nend in etv, is often an adjunct to\nthe teaching process. The technical\npreparation necessary to create\nvivid impressions during a tele¬\nvised lesson would be economically\nimpossible in the ordinary class¬\nroom. Even if cost were not a fac¬\ntor, conventional teaching sched¬\nules would not give teachers time\nfor research and for consultations\nwith technical personnel.\nThe Learning Lens: IV\nworry,” he said. “This will clot in a few seconds.\nI’m not going to draw too much blood, because\nwhile I’ll bleed for you, I won’t die for you.”\nTelevision has greatly expanded the kind of\nteaching resources Barfield is able to draw on. In\na lesson on the muscular system, he brings an\narchery champion before the cameras. To demon¬\nstrate dental hygiene, he has a dentist come in\nand brush his teeth in plain view of thousands\nof students. Another lesson consisted of a noted\nsurgeon and a full complement of nurses and as¬\nsistants re-enacting an appendectomy.\nThe hands of Myles Platt became as familiar to\nDetroit high-school students as did the hands of\nFrank Costello to millions of Americans during\nnationally televised crime hearings eleven years\nago. One of Platt’s notable lessons concerned the\nstruggle among England, France, and the Holy\nRoman Empire in the sixteenth century. The\ncamera showed only his hands against a map. The\nhands moved blocks marked for Henry VIII,\nFrancis I, and Charles V as Platt discussed the\nbalance of power. He has also used this technique\nin describing the role of Joan of Arc in the Battle\nof Orleans.\nBut ingenious effects and objects are only one as¬\npect of the drama unfolding in education through\nthe use of television. Platt’s case, for example,\nillustrates ETV’s ability to extend to many more\nstudents teaching that is good to begin with. A\nveteran of nine years ’ teaching at all levels from\nthe third to the twelfth grades, he is completing"
}