{
  "id": "d260-76",
  "text": "Technology\n40\nThe Learning Lens: VI\nterns are high cost and limited geo¬\ngraphical range. Although there\nare about 300 closed-circuit instal¬\nlations in schools and colleges in\nthe United States, the most rapid\ngrowth in instructional television—\nand virtually all of general-audi¬\nence etv—is taking place over open-\ncircuit systems.\nOpen-circuit broadcasting: vhf\nand tjhf—0pen-circuit etv re¬\nquires Federal allocation of an as¬\nsigned frequency in the television\nband. One of its principal ad¬\nvantages is wider geographical\ncoverage. There are two types of\nopen-circuit channels, very-high\nfrequency ( vhf ) and ultra-high fre¬\nquency (tjhf). vhf—channels 2 to\n13—is by far the most common sys¬\ntem, commercially and education¬\nally. Less than eight per cent of the\ntelevision receivers in the United\nStates are equipped to receive vhf\nVideotape is a plastic ribbon, two inches wide,\ncoated on one side with iron-oxide particles. Like\nmotion-picture film, it stores sound and moving\npictures; unlike film, it does not have to be chem¬\nically processed before it can be played back. A\nfew seconds after a scene is recorded on video¬\ntape, it can be shown over a television screen.\nThe difference in quality between the live and\ntaped performance is virtually undetectable.\nMotion-picture film consists of a series of frames\n— individual snapshots which, when run at a cer¬\ntain speed (twenty-four per second in ordinary\n16 mm. motion-picture film), give the visual im¬\npression of continuous motion. On videotape, the\nsound and sight consist of hundreds of thousands\nof invisible electronic impulses, as many as three\nmillion per second on a single inch of tape.\nThe Ford Foundation in 1959 and 1960 granted\n$4,588,000 for the purchase of videotape machines\nand tape for sixty-nine present and future ETV\nstations. At the same time, the grants made it pos¬\nsible for the National Educational Television and\nRadio Center to purchase six videotape machines"
}