{
  "id": "d260-80",
  "text": "Technology\nThe Learning Lens: VI\nsimultaneously, an open-circuit\nchannel carries only one program\nat a time. This limitation is most\nkeenly felt in in-school program¬\nming. Each semester a twelve-\ngrade school system offers more\nthan 100 different courses and a\nfour-year undergraduate liberal\narts college about 300 different\ncourses. In a six-hour classroom\nday, only twelve half-hour units of\ninstruction can be given over a sin¬\ngle television channel. One of the\ntechnical goals of the Midwest Pro¬\ngram on Airborne Television is to\ndouble the number of lessons that\ncan bebroadcast onasingle channel.\nVideotape—Until I960, National\nEducational Television u network^\nfilms and kinescope recordings\nwere the principal means of repro¬\nducing etv programs and lessons\nfor exchange. Filming is time-\nconsuming. Kinescopes, made by\n44\nclassrooms, and 400 pupils. “There are several\ndozen youngsters here with whom we never have\nan attendance problem,” principal John Formby\nsays. “They get their lunches free, and if they\nmiss school, they miss their main meal of the day. ’ ’\nBeneath Formby’s homespun drawl are thirty\nyears of vigorous service to education. At one\ntime he served as a consultant for the U. S. Gov¬\nernment on rural education in Brazil. After\nWorld War II, he staged a one-man invasion of\nWashington. Buttonholing his Senator and mov¬\ning the complex machinery of Air Force surplus-\nmaterial disposal, he obtained several truckloads\nof machinery with which to establish a vocational\nprogram at Holtville High School that is now a\nmodel throughout the state. When ETV came\nalong, Formby seized upon it and aroused local\ninterest. “Folks in Marbury work hard, and we\ndon’t have much spare time or money for civic\nactivities,” says Formby. “This is a poor com¬\nmunity without even a Lions or Rotary Club. But\nMarbury managed to be first in the county to buy\ntelevision sets for its school. The money was raised\nby a barbecue. Chicken, milk, and even a Coke\nmachine were donated. The fathers went out and\ncaught enough fish to feed everyone twice over.\n“My teachers are hard-working, but you can’t\nexpect them to teach math, Spanish, science, and\nEnglish equally well. ETV has given them the\nassistance of a highly trained staff of educational\nspecialists to help enrich classroom instruction.”"
}