{
  "id": "d260-86",
  "text": "Visible\n50\nThe Learning Lens: VII\ndium itself, and the people who op¬\nerate the medium. He controls what\nhe says and shows, but how he says\nit and shows it, where he stands,\nand scores of other details are de¬\ntermined in conjunction with pro¬\nducers, directors, lighting experts,\nand other technicians.\nYet conflicts in etv between show¬\nmanship and the integrity of the\neducational objective are infre¬\nquent and are invariably resolved\nin favor of education.\nSimilarly, in the selection of etv\nteachers and personalities, pres¬\nence and appearance are impor¬\ntant, but secondary to teaching\nability and /knowledge of subject.\nMany college professors were\nbrought to etv by a series of Ford\nFoundation grants beginning in\n1955. Totaling $750,000, they en¬\nabled twenty colleges and univer¬\nsities to pay the salaries of faculty\nSeated behind an old four-pedal piano, a derby\ntilted above his deep-socketed eyes, Max Morath\nlooks like an old Tin Pan Alley song plugger.\nThat is how millions are seeing Max Morath in\n“The Ragtime Era,” a series of which he is the\nwriter and narrator. The twelve-week series was\nproduced by KRMA-TV, the ETV station in\nDenver, and began being shown on the NET net¬\nwork in the fall of 1960. But Morath is neither\nold nor a song plugger. He is thirty-three and a\ngraduate of Colorado College, with a major in\nEnglish. He did graduate work at Stanford Uni¬\nversity. Music, particularly the music reflecting\nthe colorful days of the mining boom in the Colo¬\nrado hills, is his stock in trade as a composer and\nrecording artist.\nOn the surface, “The Ragtime Era” is a musical\nseries—Morath at the piano, by himself most of\nthe time, occasionally with a barbershop quartet,\na ballroom dance team, or a Dixieland band. Be¬\nneath the surface, the series presents a cultural\nhistory of the United States from 1890 to 1920\nthrough a study of popular music. Between songs,\nMorath describes what he terms “the personality\nand morals of America in a time that, in retro¬\nspect, was gentle and naive.” The series was con¬\nceived through the familiarity of one of KRMA’s\nproducers with Cripple Creek, an old gold-mining\ncamp that has been restored. Morath is musical\ndirector of the summer season of musical melo¬\ndramas at Cripple Creek’s Old Imperial Hotel.\nThe series also traces the beginning of unique\nAmerican contributions to music: ragtime, jazz,\nand musical comedy. It conveys basic knowledge\nof syncopation, improvisation, time signatures\nand rhythm, harmony, and the structure of pop¬\nular musical forms. Collaborating with Morath\nin research for “The Ragtime Era” is Dr. Albert\nSeay, a musical scholar who teaches at Colorado\nCollege. The series draws material from Morath’s\nyears of research, his extensive library of refer¬\nence works and sheet music, and a collection of\n10,000 song slides owned by a Topeka, Kansas,\nman.\nMorath insists on using authentic instruments in\nauthentic arrangements, “no matter how awful\nthey sound.” Among other things, therefore, the\nKRMA staff rounded up an antiquated snare"
}