{
  "id": "d260-90",
  "text": "Visible\n54\nThe Learning Lens: VII\nA credit course on etv can seldom\nbe done well on a spare-time or\npart-time basis. Schools and col¬\nleges using etv often give faculty\nmembers full time to prepare and\ndeliver three thirty-minute tele¬\nvised lessons a week. The medium\ndemands more careful planning\nand pacing. The instructor cannot\nlinger over the allotted period to\ndwell on a point; nor can he trail off\nand dismiss the class five minutes\nahead of time. One of the notable\nside effects of teaching by television\nis that thousands of classes are now\ngetting through the whole course.\nStandards are similar for “the\ntalent” in general-audience etv.He\nmust be master of his subject and\nskillful in its presentation. Dull¬\nness, condescension, or abstruse¬\nness are as easily escaped in etv as\nin commercial television by a mer¬\nciless flick of the dial.\n‘ ‘ So you see, this illustration is purely fictitious, ’ ’\nProfessor Crane Brinton tells his television view¬\ners, pointing to the classic Paul Revere engrav¬\ning of the Boston Massacre. “British troops would\nnever have formed themselves into such a close-\npacked, easy target in those days when the patri¬\nots ’ favorite sport was baiting redcoats.” Brinton\ngoes on to describe other historically inaccurate\ndetails of the print familiar to millions of Amer¬\nicans from their history textbooks. He concludes:\n“It does have value as an illustration—to show\nPaul Revere’s skill as a propagandist.” Brinton’s\nown illustration is part of a series called “Anat¬\nomy of Revolution,” produced by WGBH-TV,\nBoston, and distributed by the National Educa¬\ntional Television network. The fifteen-part series\nis a study of the world’s major revolutions from\nthe American Revolution through the Hungarian\nand Cuban uprisings of the 1950s.\nAn admired Harvard professor, Brinton is one of\nthe world’s foremost historians. A Rhodes Scholar\nand the author of a dozen major books, he holds\nwhat many regard as the highest nonadministra-\ntive position on the Harvard faculty, chairman of\nthe Society of Fellows.\nThis sixty-two-year-old scholar, says Robert L.\nLarsen, his director for the series, “has put his\nheart and soul into the television series. Despite\na reverence for the precision and power of written\nlanguage, Professor Brinton has a keen sense of\nthe visual aspects of his subjects. He even scrib¬\nbles notes on the video side of the script. He’s\nsuggested illustrations we never would have\nthought of.”\nThe respect is mutual. Of the ETV staff, Brinton\nsays: “ No matter how jealously a teacher guards\nhis subject, he will communicate it more effectively\nif he puts himself in the same position with regard\nto professionally skilled television people as he\nwould with the publisher of a book of his. Though\nsome of my books have had fairly wide circula¬\ntion among general readers, I’ve never diluted\nmaterial in a book, nor would I in this series.”"
}