{
  "id": "d607-15",
  "text": "—2—\n2.\n3.\n4»\n5.\n6.\n&\n7\nThe Unusual Splice* Very often we receive evidence of a new way of splicing.\nThis particular method incorporates the use of a band-aid. Yes, that is a band-\naid neatly wrapped all the way around the tape. Another new way to splice tape\nis to use part of a mailing label placed on the oxide side of the tape. You can\nimagine what fine reproduction we can get from tapes spliced in these unusual\nways l\nThe Multiple Splice. Here we have five splices in a three inch section of tape.\nIt appears that the splicer used wide splicing tape and tried to do some trimming,\nwith unfortunate results, to be sure. There is nothing wrong with a tape just\nbecause it has a number of splices; but the splices must be good ones. Any tape\nfull of splices of this type goes into the waste basket.\nThe Gap Splice. You are looking at the oxide side of the tape. This type of\nsplice is very common in the tapes we receive: the loose ends were not joined\nand a ngapn in the program is produced. Needless to say, tapes with §>aP\nsplices don*t sound very well over your station, as they stick to the heads.\nThe Oxide Side Splice. Another common finding here is the splice made wholly^on\nthe oxide coating^ Incidentally, the tape used here for splicing is not regular\nsplicing tape, but masking tape. This leads to sticking by the magnetic tape,\nresulting in distortions.\nThe Wrap-Around Splice. These two examples indicate clearly why many of our\ntapes stick and/or break and why distortions and interruptions accompany our\nprograms. In both examples the oxide side of the tape is shown. In Figure 6\nsome attempt was made to join the loose ends before the splicing\nwrapped around; but in Figure 7 the loose ends were overlapped, and the splicing\nmaterial was wrapped around twice to insure security. Both splices have untrimmed\nedges, edges which will stick either to the reel or to the tape above and below\nthem.\nIt is important to note that any tape with material extending beyond the tape\nedge will probably break when run through the duplicators, since the spacers\non the tape guides will not permit anything in excess of i\" Width to pass through\nfreely. When a tape breaks it means a re-run which takes up additional valuable\ntime and delays our service.\n8C The Overlapping. Ontrlmmed Splice. This is a very simple splice: the loose ends\nu©re casually overlapped and the splicing tape was plastered on. No trimming\nwas done, and the splicing tape was left to catch on something and ruin a program.\nq. The Transparent Tape Splice. Next to the untrimmed edge type of splice, the\nwraparound transparent tape splice is the most popular with splicers throughout\nthe country. This type of splice is most dangerous since it is difficult to\nlocate in a visual check. Thus, many of these splices slip through our checks,\nand you, the stations, receive programs with interruptions and deletions recorded\non tape that may break on the machine,\n10. The Splice With a Twist. Judging from the photograph, this is the best splice of\n\"the ten shown. It is not a good splice, to be sure, but it is an adequate one.\nThe twist, however, is that the tape below the splice has the oxide side facing\nthe camera, and the tape above the splice has the acetate side showing. A visual\ncheck probably would not catch this, but it is certain that any station receiving\nthe tape containing this splice would catch it in short order once the program\nbegan over the air."
}