{
  "id": "d607-29",
  "text": "THE\nAMPEX\nMODEL 352 TAPE REPRODUCER\n/ o® e>1\nfor high fidelity playback\nof pre-recorded tapes\nThe Ampex Model 352 is a reproducer that plays pre¬\nrecorded tapes much as a turntable plays disc records. For\nthose many applications where only the playback function\nis needed, it serves in lieu of a high quality tape recorder\nand has special advantages of its own.\nNo accidental erasures — Since the Model 352 has no\nrecording or erase heads, irreplaceable tape recordings are\nfully protected from accidental erasure. Thus the 352 is par¬\nticularly suitable where non-technical personnel will play\ntapes — or in professional applications where loss through\nerasure could be high.\nHighest quality of reproduction — The finest tape record¬\nings can be reproduced \"perfectly” on the Ampex Model\n352. It is identical in performance to the playback functions\nof the Ampex Model 350 Recorder which is so widely used\nin radio network broadcasting and professional studio\nrecording.\nLower cost — The Ampex 352 Tape Reproducer costs less\nthan a recorder of comparable quality. Radio stations, re¬\ncording studios and educational institutions can in many\nplaces use a tape reproducer in lieu of another recorder.\nEquipment costs are cut without sacrificing quality.\nIn radio broadcasting the Model 352 plays transcribed\nprograms and time-delayed network material. In addition it\nis the safest machine for editing.\nFor advertising agencies and theatrical and radio\nbooking agents, it is an ideal machine for auditioning\ntaped radio programs, dramatic performances and com¬\nmercials.\nIn the professional recording studio, the Ampex 352\nprovides high quality playback for checking, editing and\nhearings by studio clients, critics and others.\nFor educational institutions, it is an exceedingly durable\nmachine for playing pre-recorded tapes. It can be entrusted\nto student use with minimum danger to tapes.\nThe Standard of excellence...\nThe 352 Tape Reproducer incorpo¬\nrates those characteristics that have\nput Ampex Tape Recorders in a class\nby themselves.\nADHERENCE TO SPECIFICATIONS. All pub¬\nlished specifications are conservative ratings,\nnot exaggerated claims. Each Ampex is in¬\nstrument-tested to equal or exceed every per¬\nformance figure (see back page).\n1 5,000 CYCLE/SEC. RESPONSE AT\n71/2 IN/SEC. Ampex machines meet NARTB\nprimary standards at a tape speed of 7y2\nin/sec. as well as at 15 in/sec. Tapes main¬\ntain these characteristics when interchanged\nbetween any Ampex equipment.\nFREEDOM FROM NOISE AND DISTORTION.\nSignal-to-noise ratio of single track Model 352\nReproducers is over 60 db at the level of 3%\ndistortion of a 400 cycle tone. Flutter and wow\nare well under 0.2% rms at 15 in/sec. and\nunder 0.25% rms at 71/: in/sec\nACCURACY OF TIMING. Timing is accurate\nwithin ± 3.6 seconds in 30 minutes program\ntime. Timing accuracy is a \"built-in feature”—\nnot a precarious balance of adjustments. It is\nstandard from one Ampex to another.\nFAST RESPONSE TO CONTROLS. Starting\ntime is \"instantaneous\" — full stable tape\nspeed in less than 1/I0th second. In stopping,\nthe tape moves less than 2 inches even at\n15 in/sec. tape speed. Exact cueing is routine\non an Ampex.\nIF YOU PLAN FOR TOMORROW, BUY AN AMPEX TODAY."
}