{
  "id": "d607-42",
  "text": "SPECIFICATIONS\nThe BC-5A hinged front panel and removable top cover provide com¬\nplete access to all components including amplifiers and power supply.\nDESCRIPTION\nThe BC-5A Audio Consolette is a low-cost quality Broad¬\ncast Audio Control equipment. The consolette is of all-metal\nconstruction finished in two-tone umber gray. A hinged\nfront panel and removable cover provide complete access\nto all components, such as the key-selector switches, con¬\ntrols, mixers, terminal blocks and wiring.\nThe VU meter and all switches and mixer controls essen¬\ntial to everyday programming are front-panel mounted.\nExtremely flexible in operation, the BC-5A handles nine\nseparate inputs, with provisions for simultaneous mixing of\nfour inputs. There is provision for feeding program cue\nor talkback to the remote lines. Headphone jacks are pro¬\nvided for network and remote line monitoring. The VU\nmeter is illuminated to facilitate readings.\nCue positions are incorporated on turntable mixers, and\nterminals are available for connecting a separate cueing\namplifier. Separate audition and program channels are\nprovided for maximum flexibility, and the monitoring\namplifier may be switched from the turntable cue position,\nprogram line, or audition bus. All inputs are terminated\nwhen the switches are in the \"off\" position.\nThe BC-5A is a completely wired unit and has self-contained\namplifiers and relay power supply. Four preamplifiers are\nutilized in the basic design and provision is made for the\naddition of external line equalizers. The fourth preamplifier\nis supplied wired for low gain to permit its use with a\nremote line input. It can be easily modified, however, for\nhigh gain when desired.\nInputs:\n4 Microphone (3 Studio, 1 Control Room).37.5/150/600 ohms\n2 Turntable .37.5/150/600 ohms\n2 Remote Lines .600 ohms\n1 Network . 600 ohms\nOutputs:\n1 Program Line .\n2 Monitor Speakers\n1 External Monitor .\n2 Remote Lines Cue\n1 Turntable Cue .\nGain:\nMicrophone or Turntable Input to Program Line. 108 db\nMicrophone or Turntable Input to Speaker.125 db\nFrequency Response:\nProgram ±1.5 db.. .30-15,000 cps\nMonitor ±2.0 db.30-15,000 cps\nHarmonic Distortion:\nProgram (18 dbm output).1% at 30 cps; 0.75% at 50 cps;\n0.5% 100 to 15,000 cps\nMonitor (6 W total).1% at 50 cps; 0.5% 100 to 15,000 cps\nSignal to Noise Ratio:\nProgram Channel (Mixer and Master Gain\nControls set for 68 db gain).68 db below 18 dbm output\nTube Complement\n1- 5R4GY 2-12AX7\n2- 12AU7 1-6X4\n2—6V6-GT 6-12AY7\n5—MI-11299 (selected 12AY7)\nDimensions.19V2\" wide, 11 V2\" high, 21 V2\" deep\nWeight ......66 lbs.\nFinish.Two tone umber gray\nPanel.Photoengraved aluminum with dark umber gray enamel fill\nStock Identification ..MI-11637\nAccessories\nTube Kit for BC-5A..MI-11483\nOn-Air Lights .MI-11706\nSimplified block diagram of BC-5A Consolette.\n600 ohms\n16 ohms\n600 ohms\n600 ohms\n..50,000 ohms\n18 dbm\n3 W each\n-12 dbm\n1 8 dbm\n1 V\nRADIO CORPORATION OF AMERICA\nBroadcast Equipment Camden, N. J."
}