{
  "id": "d607-85",
  "text": "NASB RADIO NETWORK\n119 Gregory Hall\nUrbans, Illinois\nTo: All Network Active Affiliates\nAll other NASB Active Radio Members\nAll NASB Associate Members\nAll Sustaining (Commercial) Members\nFrom: Robert Underwood\nDate: January 10, 1963\nRes Series on \"Great Decisions* 1963w\nIn a memo dated December 28, 1962, we attempted to discover how many of the\nnetwork active affiliates would be Interested In contributing funds for the\nproduction of a series of eight (8) half-hour programs based on the Foreign\nPolicy Association's \"Great Decisions\" discussion project. The mso. stated\nthat such a series would be much like that we had last year, with outstanding\nworld figures speaking on the subjects involved, and if interest was sufficient\nwe would proceed with production.\nWe feel that interest has been such that a series will be produced; this will\nbe 63 Extra I - Great Decisions, 1963 (eight half«hour programs). The series\nwill be produced in Washington, D. C. by John F. Lewis, and the first program\nwill be ready for broadcast use the week beginning February 3. The programs\nwill not be tied to specific dates and will hold up as public service broadcasts\nfor several months.\nThe initial distribution schedule for the programs is as follows:\n1. (Issue #6, Release Date: Feb. 3) The Common Market\n2. (Issue #7, Release Date: Feb. 10) Red China and the U.S.S.R.\n3. (Issue #8, Release Date: Fob. 17) Algeria\n4. (Issue #9, Release Date: Bah.24} Spain\n5. (Issue #10, Release Date: March 3) India\n6. (Issue #11, Release Date: March 10) Laos and Vietnam\n7. (Issue #12, Release Date: March 17) The Alliance for Progress\n8. (Issue #13, Release Date: March 24) Problems & Prospects for Peace\nThe series will be available to Active Affiliates at the times given above;\nthe series will also be available to all others at the times given above\nprovided that the coverage area of each station involved does not overlap the\ncoverage area of an Active Affiliate broadcasting the series.\nA statement of our policy on overlapping coverage areas follows:"
}