{
  "id": "d371-76",
  "text": "2-\nand perhaps coordinate activity with Bruce Linton, President of APBE\nat the University of Kansas and/or with someone who is involved with\nthe parent NAB Research Committee.\nIt might also be noted that FCC Chairman Minow announced in his\nkeynote address before the NAEB Convention that the FCC has set up a\nsection devoted exclusively to education and research. I do not know\nexactly what he meant by research in this instance, but it might be well\nto consult with someone at FCC to determine exactly what their hope for\ndevelopment and research might be.\nIn other words, I think that some effort and coordination or consultation\nof all these research oriented and interested groups - NAEB, NAB, APBE\nand FCC - might prove profitable. At this moment I have no other sugges-\ntions to make regarding Harley’s idea. I hope these have been somewhat\nhelpful and, I would, of course, be interested in helping anyway possible\nto implement any research center which would bring more and better re¬\nsearch studies in broadcasting.11\nThe other two committee members had serious reservations. Here are\ntheir comments:\nSchramm: \"I don’t know that I fully understand this plan which came\nby you out of Bill Harley, but if I do understand it I’m not very enthu¬\nsiastic. Let me ask a few questions which will probably convey my feeling\ntone.\nIf this is to be purely a local operation •- i.e., NAEB puts an\nenquiring station into touch with a local survey research outfit -- what\ndoes the national research director do? (I am not implying that it wouldn’t\nbe a good idea for NAEB to sponsor research from a national outlook, but\ndon’t see exactly what a permanent, full-time research director in Washing¬\nton would do in this case; nor, indeed, how they could make it exciting\nenough to get a really good man.)\nAlong the same line, what is this $30,000 for the national office to\ndo? (Once again, I am all in favor of the national office getting more\nmoney, but how does this contribute to the project?)\nAgain, is this the best way to find out what audiences want and need?\nI am sure you will agree that people are pretty inarticulate about what\nnew and different kinds of programs they want -- and even more about what\nthey need. Would a better way be for the station to talk with representa¬\ntive leaders, perhaps to maintain a continuing program advisory council of\nsuch leaders? Frankly, I suspect that such surveys would be used as a\ndelaying action by a station -- we have brought in this organization, spon¬\nsored by the NAEB, to survey our audience, and we are making maximum use\nof the results; in fact, if you will look at these responses, you will\nsee that 871 of our audience had no concrete suggestions to make, and\ntherefore were evidently completely satisfied, etc. Remember that this\nis research work to be done for the station; it isn’t an outside evalua¬\ntion of programs. The station would have complete right to use the results,\nand even to specify what is asked. I'm not really very hopeful that this\nwould make a fundamental difference."
}