{
  "id": "d1652-2",
  "text": "NAEB NEWS LETTER...Feb 1, 1940...Page 5\nBROADCASTING AT MONTANA STATE\nMontana State University, Missoula, is going to furnish between one\nand five hours a week to Radio Station KGZOo According to Inform¬\nation from Professor E. M« Little of Montana State, plans are being\nmade to set up campus studios so ©s to facilitate the handling of\nprograms on the campus* The Montana State University Radio Station\nKUOM was discontinued in 1929, Preliminary plans call for a program\nfrom the Department of Music, Journalism, Speech, and others0\nWTAW DIRECTOR NAMED\nJohn Rosser is the new managing director of the Texas A. and M.\nCollege radio station, WTAW. and master of ceremonies of the\nInstitution^ Texas Farm and name Hour ivhich goes on the air each\nweek-day at 11:30 A.M. over the Texas Quality Network.\nHe succeeds Dr. E. Pc Humbert, who has served for some eight years\nin that capacity. The job has grown to a full time one, and Dre\nHumbert asked for relief so that ha could give his full attention\nto his duties as head of the Department of Geneticso\nRosser began his radio experience as news editor and director of\nspecial events at KGKO, Fort Wor th. He came to WTAW from New York,\nwhere he was the Herald Tribune’s newscaster over WQXR and prepared\nscripts for the Consumers’ Information Division of the Crowell-\nCollier Publishing Company.\nPUBLIC AFFAIRS PAMPHLETS\nMost of you have seen the pamphlet published by the Public Affairs\nCommittee, 30 Rockefeller Plaaa, New York City. If you are not\nfamiliar with them, see listing of publication enclosed in the\npacket. The Public Affairs Committee is © non-profit, educational\norganization*\nSome of the publications lend themselves well to adaptation for\neducational broadcasts. If any of the non-commercial educational\nstations desire to use these on the air, the Public Affairs Committee\nwould be glad to receive your request, outlining the form in which\nyou intend to us© them.\nPamphlets scheduled for 1940 publication include: PROBLEMS OF PUBLIC\nHOUSING, MIGRATORY FARM IABOR, THE COSTS OF DISTRIBUTION, OLD-AGE\nSECURITY, CIVIL LIBERTIES, MONEY* 0tco\nTO INQUIRE INTO MANAGEMENT CONTRACTS\nTo determine whether broadcast licensees are themselves discharging\nthe rights, duties, and obligations under their licenses or whether,\non the other hand, such rights have been turned over to and are\nbeing exercised by outside operating companies under so called\nmanagement contracts, the Federal Communications Commission has\nordered hearing on certain pending applications for renewal of\nradio station licenses, and for other and similar renewal applications\nas they come before it."
}