{
  "id": "d1652-4",
  "text": "NAEB NEWS LETTER. ...Feb. 1, 1940... .Pag© 5\ncasting Company in presenting this series which is based on the\nfactual findings of surveys in current economioso Beginning\nFebruary 7, the programs will be broadcast over 7/EaF and stations\nof the NBC Red Network on Wednesdays, from 11:15 to 11:30 P.M., EST.\nAn unusual style of technique which is new in educational radio\nwill characterize the dramatized portions of these programs. This\ntechnique which has proved brilliantly effective in radio drama haB\nbeen adapted to give color and impact to research findings,, At\nthe same time the factual content, based as it is on the Twentieth\nCentury Fund’s scientific investigations, will be fresh material\neven to some of those who specialize in the field of economies,.\nEach dramatization in this radio series will be followed by a brief\ndiscussion by one of the eminent, nationally known experts who\ncomprise the Fund’s Special Survey Committees. In a terse dialogue\nwith the characters of the drama he will explain his Committee’s\nrecommendations for ftThe Next Step Forward, \"(See Packet)\nC CURT RULING ON RECORDS\nAn Associated Press dispatch from New York City reports that by a\n3 to 2 decision the Appellate Division of New York State Supreme\nCourt has ruled that the musicians’ and stagehands’ unions should\nbe permitted to use legal and peaceful means to oppose an opera\ncompany’s use of \"Canned Music\"®\nThe ruling reversed an order issued just a year ago by Supreme\nCourt Justice Kenneth P, O’Brien which permanently enjoined the two\nunions from interfering with Opera-On-Tour, Inc., in a dispute over\nthe use of amplified recorded music versus living musicians.\nOpera-On-Tour, Inc., was organized in February, 1938. It was\ndesigned to take popular-priced opera to smaller cities and instead\nof an orchestra, the accompaniment arid some choral singing was\nproduced from records.\nThe company opened at Richmond, Va., November 4, 1938 and closed at\nChapel Hill, N.C., on November 22 after the stage hands walked out\nat the request of the Musicians’ Union. The suit for an'injunction\nthen was filed.\nRESEARCH AT UNIVERSITY OF TEXAS\nThe South’s first radio research bureau recently started its\nmachinery at the University of Texas, A. L. Uhapman, director, has\nannounced. This new agency, the University Bureau of Research in\nEducation by Radio, has been set up by University Board of Regents\nas a subdivision under Dean B. F. Pittenger of the School of Eduoation0\nThe term \"education\" Chapman expects to interpret broadly, extending\nit to adult fields and to the cultural and entertainment programs.\nProjected avenues of investigation embrace studies of listening\nhabits of children and adults, consumer-popularity of radi<b~\nadvertised products, school use of radio programs, effect of radio on\nteacher efficiency in the classroom."
}