{
  "id": "d1652-5",
  "text": "NAEB NEWS LETTERS....Feb. 1, 1940.Page 6\nOne immediate project will be to determine the present status of\nradio as an instrument for education, whether in direct classroom\nuse or in leisure-time home use, Chapman indicated. Place of the\nUniversity in training people for the radio profession* either from\na technical or a performer point of view* must be studied* he slgni-\nfled.\n\"The number of ’glamorous* radio performers is so small in comparison\nwith the number of people who go into radio work as a job ar profe¬\nssion,\" he emphasized* \"that we must decide whether those people\nneed professional instruction, whether adequate training is avail¬\nable in Texas—and whether a University siiould offer that type of\neducation.\"\nNew statistical methods, gearing average pupil intelligent quotients\nto large scale testing of listening habits* will be used to measure\nTexas school children’s responses to radio-vitalized education. Four\ngraduate students have already started research studies in the radio\neducation field, one having been completed this summer, Chapman said.\nLITTLE EXPECTED IN CONGRESS\n\"Broadcasters are anticipating a quiet session of Congress as far\nas radio legislation is concerned, although there are about fifty\nbills pertaining to radio in the Senate and House, there appears\nlittle prospect, according to Washington observers, that more than\na half-dozen may arise to plague the broadcasters.\n\"Reorganization of the Federal Communications Commission and\nresolutions demanding investigations of networks and \"radio monopolies\"\nare definitely reported dead. Copyright legislation, which has been\npending before Congress several years, may have a revival.\n\"Legislation which probably will have the best chance of enactment,\nobservers believe, Is that designed to forbid beer and liquor\nadvertising on the air. Such a bill is now on the Senate calendar,\nhaving been reported favorably by the Interstate Commerce Committee.\n\"The FCC budget will be reported in the House within a few weeks by\nthe House Appropriations Committee.\n\"President Roosevelt in his budget message to Congress asked for\n$2,125,000 for total appropriations for the Federal Communications\nCommission for the fiscal year 1941, composed of $2,100,000 for\nsalaries and expenses and $25,000 for printing. For the present\nfiscal year of 1940 the total appropriation for the commission is\n#1,838,175, composed of $1,800,000 for salaries and expenses, $259000\nfor printing and $13,175 for special investigations.\" - New York\nTimes, Jan. 14, 1940"
}