{
  "id": "d1648-3",
  "text": "^ The Hampton Roads ETV Association moved into new\nstudios in Norfolk in September.\n^ WFBE-FM, Flint, Michigan, will be ten years old October\n3.\n^ Alabama claims the nation’s first gubernatorial proclama¬\ntion of a state ETV week, with Alabama Educational Tele¬\nvision Week September 9 through 13. The announcement was\ntimed to alert teachers and citizens to the network’s new fall\nschedule effective that week.\n^ WNDT, New York City, received a grant from Time, Inc.,\nfor live coverage of the opening U. N. General Assembly\nsessions.\n^ Viet Nam is to receive 10,000 radios from AID, for dis¬\ntribution to village leaders. Another 40,000 are to be sold\nthrough commercial sources in Viet Nam.\n^ The Edison Foundation is accepting nominations for its\nannual “National Station Awards for Serving Youth.” Dead¬\nline for nominations is December 15. Information may be ob¬\ntained from the foundation, at 8 West 40th St., New York 18.\n^ Indiana University radio-TV personnel have begun the\nmove into the new Radio-TV Center, which includes more\nthan 13,000 feet of studio and production space. The building\nis expected to be completed November 1. Costing 2% million\ndollars, the building includes four radio studios and four\ntelevision studios.\ny The University of Wisconsin-Milwaukee has requested the\ncall letters WUWM in its application for a new FM station.\nInitially the station is expected to be on the air in late after¬\nnoon and evening hours on week-days. Ruane Hill, new staff¬\ner formerly with Syracuse University, is arranging the pro¬\ngraming. Local programs will be supplemented by pick-up of\nevening features from the State Radio Council station at\nDelafield, WHAD.\ny Leaders of the Chicago ETV Association have unveiled\nplans for rapid activation of Channel 20 following announce¬\nment of a $299,619 grant under the ETV Facilities Act of\n1962. Edward L. Ryerson, president of CETA, said the total\ncost of equipment and installation will be about $400,000. Ap¬\nplication for the second channel (CETA operates Channel 11)\nwas made because of increasing needs for in-school telecast\ntime during the hours of 9 a.m. to 3 p.m. Currently the Chan¬\nnel 11 schedule calls for elementary school classes on the air\nduring school hours, leaving no opportunities for high school\nteaching.\n► Indiana University’s radio-TV services report 370 TV pro¬\ngrams produced—carried by commercial WTTV, Indianap¬\nolis, during the year 1962-63. I. U.’s radio* station, WFIU,\nreports the following breakdown of air time: 2,230 hours of\nclassical music, 575 hours of semi-classical music, 260 hours of\njazz, and 790 hours of news, public affairs, and special events.\n► The National Science Foundation recently awarded three\nTV grants: City University of New York, $18,170 for the\nproduction of a pilot program in a projected series for com¬\nmercial TV to stimulate and inform the public about science;\nUniversity of Oklahoma, $14,710, a three-part program in¬\ncluding science lectures for the general public, 5-minute news\nprograms on ETV, and residential conferences in science for\npublic officials; National Academy of Sciences, $4,960, for the\npreparation of science filmclips for use on commercial and\neducational TV.\n► Featured speaker at the national convention of Sigma Delta\nChi in November will be Glenn T. Seaborg, chairman of the\nAtomic Energy Commission. The meeting will be November\n6-9 in Norfolk, Virginia.\n► Speaking at the University of Michigan recently, Robert\nLewis Shayon, radio-TV editor of the Saturday Review, said\nthat operators of the mass media are trustees, with accounta¬\nbility to the people, and that the trustees still say the less gov¬\nernment interference the better, “but there are observers of the\nmedia,” he said, “who hold that when self-regulation fails to\nwork, it is the duty of the government to step in as gently as\npossible, without overdoing its centralized power, to prod and\ngoad the media to accomplish some of the rational goals they\nespoused when they won their hard-earned freedoms in the 18th\ncentury struggle against oppressive government.”\n► In the annual report for 1962-63, WKAR and WKAR-FM,\nMichigan State University, report that during the fiscal year\n1,950 listeners from over 300 post office locations in the state\nrequested program information or special services offered by\nthe radio stations. This does not include requests for specially\noffered material nor letters from outside Michigan.\n► WETA-TV, Washington, will produce thirty half-hour\nlessons for lipreading instruction for the hard-of-hearing. The\ntele-lessons are made possible by a $55,350 grant from HEW\nto the station and American University.\n► WEDU, Tampa, is using billboards for promotion for the\nfirst time. Martin Outdoor Advertising is giving the space\nduring the station’s fund-raising campaign. The drive was\nfurther benefited by a paid attendance of 3,000 at a Manatee\nCounty evening showcase of athletic competitions and music.\n► Ampex Corporation has announced a complete new line of\nhigh-quality stereo tape recorders, including four different\nmodels for home, industry, and education.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Miss Julie Hunt, Placement Service,\nat the NAEB office in Washington.)\nOctober I—Producer-director with technical abilities desires\nposition with part-time teaching in college or ETV situ¬\nation. Married, 24, male, M.A. Available January, 1964.\nOctober 2—TV or radio producer and/or director, writer, an¬\nnouncer, with news and music background. Also on-air\nand other promotion. Thoroughly experienced in print\ndesign and creative work and production supervision.\nSeeking a career position of high calibre with or with¬\nout teaching. Creativity and judgment strong charac¬\nteristics.\nOctober 3—Station manager, assistant manager, program di¬\nrector. Ten years in network television, five in local\nradio, and four in public relations. Would like to make\na contribution to educational radio or television. Mar¬\nried, 37 years old, B.A. cum laude (political science)\nand M.A. (U. S. history). Interested in teaching part\ntime. Salary is presently in the $15,000 range. Prefers\nNew England or Middle Atlantic States.\nOctober 4—Produoer/writer with background in commercial\ntelevision, films, and magazine writer. 'Former production\nmanager, well versed in technical aspects, program val¬\nues. Has 400 published articles, television and business\nfilm scripts to credit. Certificates to teach broadcasting\nin state-licensed schools in New York and New Jersey.\nSeeking responsible, challenging career position that will\nutilize experience to the fullest.\nOctober 5—Desires teaching position in radio-television, or as\nhead of the department. Also interested in directing\nETV in-school programs. Teaching qualifications include\nboth high school and college level. M.A. from Univer¬\nsity of Washington; Ph.D. conferred in August, 1963,\nfrom Ohio State University. Male, married, prefers West\nCoast but will consider all areas. Minimum; $12,000.\nPOSITIONS AVAILABLE\n(In order to be considered by these institutions, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nO-l TV engineer with experience in closed and/or open cir¬\ncuit television. Excellent opportunity with new television\ndepartment.\n0-2 Assistant-producer for midwestern ETV station. Duties in¬\nclude standby director, station announcer, and continuity\nwriter. Ten-month position; opening immediately. M.A.\ndesired; $500-$600 per month.\n0-3 Art director for ETV station. Must have skill in hand let¬\ntering. Preferably some experience or training in the\narea of television. Able to supervise staff of student art¬\nists. Salary $7,000.\n4\nNEWSLETTER"
}