{
  "id": "d1172-1",
  "text": "Are You Listed Right?\nIndividual Members will be listed in the January-February\nissue of the NAEB Journal. Anyone who has an address or\ntitle different from that on the envelope for this Newsletter\nshould notify the NAEB Urbana office before November 1.\nPlans are under way for a new Directory of Institutional\nMembers also. Please notify us of changes.\nNAEB-ETS to Study ETV Financing\nFunds have been received by the NAEB from the U. S. Of¬\nfice of Education Which will enable ETS to begin a study on\nlong-range financing of ETV stations. Frederick Breitenfeld,\nJr., has been named project director for the seven-month\nInaugurating the study will be a conference in Washing¬\nton, D.C., December 7-8, to be attended by station managers\nand members of governing boards of more than 90 ETV sta-\nBreitenfeld has joined the NAEB-ETS staff in Washing¬\nton Prior to this assignment he was a communications con¬\nsultant at Cape Kennedy, and from 1960-1963 he served as a\nprogram administrator in adult education and an assistant\ndean at Syracuse University. His articles have appeared in\nSaturday Evening Post, NAEB Journal, Journal of Broad¬\ncasting, and UNESCO’s Television and Adult Education.\nNeeds Info on Teacher Training by TV\nAn ETV specialist with the Peace Corps in Colombia needs\ninformation on teacher training by television, including in-\nservice training via TV. Anyone having concise materials\nwhich would be of assistance should send them to: Miss Lucy\nGratwick, ETV, Peace Corps, American Embassy, Bogota,\nColombia.\nScientists Study Radio Interference\nMore than 500 'leading scientists will explore the problem of\nradio frequency interference at a meeting in Chicago, Novem¬\nber 17-19. According to James J. Krstansky, chairman of the\nconference, many serious interference problems have been\ncreated by the large growth in operating electronic equipment.\nDr. Slcifter Dies\nHector R. Skifter, who aided in the experimental radio broad¬\ncasts that developed into Radio Station WCAL, St. Olaf\nCollege, died in New York July 25. He is credited with de¬\nveloping the airborne magnetometer, a detection device used\nto locate submerged submarines in World War II. He was\npresident of Airborne Instruments Laboratory, Inc., and a vice\npresident of Cutler-Hammer, Inc., at the time of his death.\nNews Notes\nserving this academic year as specialists in the Americans\nAbroad program of the U. S. Department of State. Their\nproject is using ETV to combat illiteracy. Dr. Tyler is pro¬\nfessor in OSU’s Bureau of Educational Research and Serv¬\nice ; Mrs. Tyler is supervisor of the Ohio School of the Air\nin the university’s Telecommunications Center,\nk Mortimer Fleishhacker, Jr., San Francisco businessman and\npresident of the Bay Area ETV Association, was the voice\nof KQED on the weekly station report, “A Few Words About\nChannel 9” recently. He was filling in for general manager\nJames Day, Who was on leave of absence in Africa.\n^ Lee Franks, formerly with NET, New York, is now ad¬\nministering the Georgia ETV system.\nk Miss Eilene Ha'lpern, formerly of NBC and WNDT-TV,\nhas been named a director at WHRO-TV, Norfolk, Virginia.\nBoyd Harrier has been promoted from director to production\nmanager, and John Egan has moved up from director to pro¬\ngram manager.\nk Boris Frank has taken over as production supervisor at\nWUA-TV tTnivprdtv nf Wisconsin, Madison.\nSTATE AND REGIONAL\nk A legislative subcommittee on ETV has recommended that\nSouth Dakota enter the first phase of its proposed statewide\nnetwork. This phase would put the state’s only ETV station,\nKUSD at Vermillion, on full power and would activate the\nproposed station at Brookings.\nWhen completed, the network would also include stations\nat Aberdeen, Pierre, and Rapid City—at a cost of $2 million.\nThe subcommittee said that appropriations for the entire net¬\nwork should be completed within a three-year period.\nAlso recommended was the establishment of a board of\ndirectors for ETV in the state—a nonpartisan seven-man\ngroup to be appointed by the governor.\nk Alabama’s ETV network can cover 90% of the state’s popu¬\nlation, since the new transmitter at Mobile became operational\nSeptember 14.\nk Delaware’s legislature has voted to support a three-channel\nCCTV network connecting all elementary and secondary\nschools in the state. A $425,000 center will be constructed to\nserve the network. Appropriations have been made for two\nyears, and September, 1965, is target date for operation of\nthe system. . .\nThe whole state of Delaware is also receiving hiv\nbroadcasts via a newly installed signal translator in Sussex\nCounty. The device receives the signal from WHYY-TV,\nChannel 12, Philadelphia, and retransmits the picture on Chan¬\nnel 73.\nk Georgia plans statewide ETV by 1966, with a ten-station\nnetwork. $3.3 million of a new school bond issue will be allo¬\ncated for six new stations and a production center.\nINSTRUCTION\nk The 30,000th credit student in the history of Chicago City\nJunior College’s TV College, over WTTW, has been enrolled\nfor the fall 1964 trimester. Viewers may complete the first\nPERSONNEL\nk Reorganization of the radio-TV department at Ohio Uni¬\nversity has resulted in the following appointments: Archie\nGreer, director of radio; Presley D. Holmes, Jr., director of\ntelevision; and Vincent Jukes, director of audiovisual,\nk Wally Briscoe, administrative assistant to Rep. Oren Har¬\nris, chairman of the House Interstate and Foreign Commerce\nCommittee, has been named administrative assistant and of¬\nfice manager for the National Community Television Asso¬\nciation. _ . , ,\nk John Haney, formerly of the Air Force Academy, has ac¬\ncepted the position of director of the office of instructional\nresources of the University of Illinois, Chicago campus.\n^ Dr. and Mrs. I. Keith Tyler of Ohio State University are\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, I 19 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Editorial assistant: Skip Robinson.\nPhone 333-0580. Area Code 217.\nReporters:\nRegion I —Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\n—Shirley Ford, WRVR, 490 Riverside Drive, New York\nCity, 10027.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}