{
  "id": "d1659-0",
  "text": "N - A- E- B NEWS-LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nEdited by Harold A. Engel, President\nStation WHA, University of Wisconsin, Madison, Wisconsin\nMarch 1, 1947\nFCC RELEASES NEW RULES\nThe Federal Communications Commission on February 14 adopted for release new\nsections of its rules governing Non-Commercial Educational FM Broadcast Stations,\nto become effective on April 1, 1947.\nSections 3.501 to 3.591 are new embodying essentially the recommendations made\nafter considerations by NAEB at the 1946 Convention at Michigan State College.\nNEW FM FILM\nThe General Electric Company is about to release a new film entitled, \"Naturally--\nIt's FM\". This 16 mm. sound film in color should be useful in promotion campaigns\nas in the earlier version called \"The Story of FM\". It is to be available through\nthe company's district offices and through film libraries.\nPOLITICS AND THE FCC\nSports prognosticating has nothing on the activities of the radio trade press\nin starting and spiking rumors about prospective FCC appointments. Were it not for\nthe importance of the job, the satire involved would be appreciated.\nIn a single issue of Broadcasting Magazine (February 3) these comments in\ndifferent stories appear: \"-Charles R. Denny will recommend-Wakefield-be\nnamed to succeed himself. Confirmation is far from automatic since new Republican\nmajority in Senate isn't at all satisfied with Republican appointments-\".\n\"-comes word that Thad Brown, Jr.-will be urged for Wakefield post by\nregular Republican stalwarts. Like his father he is an Ohio Republican and his\nmother is most active in Republican Committee circles.\"\n\"-a political deal was concocted and almost jelled, for appointment of\nMarion E. Martin, ex-assistant chairman of Republican National Committee to the\nPorter vacancy.\"\nBasic qualifications and performance \"in the public interest convenience and\nnecessity\" might be given some consideration-rather than political services\nrendered-or subservience to the wishes of those who under the banner of \"The\nAmerican way\" place their own interests above those of the public,\nHLE ’MBERSHIP INVITATION\nThe National Association of Educational Broadcasters invites to\nmembership institutions and agencies operating broadcasting.stations\nor carrying on an educational program over stations not.their own.\nThis includes city, county and state educational bodies engaging in\nFM operations as well as colleges and universities.\nAssociate Membership is open to individuals and institutions\ninterested in the field of public service broadcasting.\nWrite for further information and membership application blank.\nVice-President\nRobert J. Coleman\nWKAR\nEast Lansing, Mich.\nTreasurer Executive Secretary Executive Committee\nW. L Griffith M. S. Novik Waldo Abbot. Michigan Milford C. Jensen. WCAL. St. Olaf\nWOI 30 Rockefeller Plaza John W. Dunn, WNAD, Oklahoma James S. Miles, WBAA, Purdue\nAmes, Iowa New York, N. Y. Richard B. Hull. WOI, Iowa Stale Russell Potter, Columbia"
}