{
  "id": "d1659-4",
  "text": "■ G U E S T I T O R I A L\nSOME FACTS AND FANCIES ABOUT THE FCC\nDuring recent months a grave and dangerous situation has developed\nin American broadcasting. The implications, which are not well under¬\nstood, are serious, not only for the sound future of American radio\n(commercial and educational) but for the basic liberties of the people.\nThe National Association of Broadcasters, under the shrewd leader¬\nship of Justin Miller, has been conducting a carefully-planned attack\non the Federal Communications Commission for the alleged purpose of\nprotecting free speech and free enterprise in American radio. Since\nthese are obviously excellent goals, and since the average American\ncitizen has little knowledge of the structure and personnel of the\nbroadcasting industry, the whole endeavor has sounded reasonable and has\nmet with considerable success.\nMr. Miller has stumped the country, speaking at luncheon clubs,\nbroadcast meetings, enlisting the sympathy of political figures. The\ntrade papers have carried news about \"ripper bills1' designed to cripple\nor replace the FCC. Colliers magazine has taken up the cudgel for \"free\"\nradio. A new Washington newsletter, Capitol Radio Beoorter, furnishing\nits readers with \"inside news\", warns continually against the threat\n(a carefully-nurturedjiyth) of \"government radio ownership.\" and points out\nthat radio, like the press, must fight to retain its freedom.\nThe average citizen (and legislator) does not know that American\nradio has been profitable beyond the wildest dreams of its pioneers. He\ndoes not know that only 1000-odd AM radio channel assignments exist in\nthe U.S. and that no more are available. He does not know that broad¬\ncasting frequencies are so valuable that stations have been selling for\n10 and 21 times their net worth.\nThe average citizen does not know that about 30 clear channel\nstations and 4 networks dominate the radio scene, nor does he know that\n40,000-odd individuals in the broadcast industry and a. handful of major\nadvertisers now have almost uninhibited control over the most powerful\nemotional force with which the public mind has ever been faced.\nNaturally, they resist any change in the status quo.\nCenter of much of the current storm is the FCC report on the \"Public\nService Responsibility of Broadcast Licensees\". It is the \"Blue Book\" -\nwhich sets up tentative standards whereby station program operation\nmight be reviewed and evaluated at license renewal time. This publication\nwas greeted with the familiar cries of \"government domination\",\n\"censorship\", \"left-wing nonsense\" and was construed by the NAB as a\nstep in the direction of federal control of radio. Many individual\nstation operators do subscribe to the FCC policy and views. But the\nofficial point of view is the view of the NAB leadership, which hopes\nto use the headman’s axe.\nThe handwriting is clear—the conflict is essentially that of\nspecial privilege against the public interest. The danger is political—\nthe new Congress is understandably intent on a certain amount of \"house¬\ncleaning\" . It is our hope that they will understand the NAB interest\ngoes deeper and has other objectives than \"free speech\" and \"free\nenterprise\". Every member of the Senate and the House in every state\nshould be advised that this is more than a question of bureaucracy,\nand that the broadcaster has responsibilities which extend beyond\ninsuring the stockholder’s annual dividend.\n—RICHARD B; HULL-, Radio WOI, Iowa State College\nNext month’s guestitorialisti M. C. Jensen*"
}