{
  "id": "d1659-7",
  "text": "GOOD-WILL PLUS SERVICE\nWOSU is setting a pattern which more of us might do well to follow. As the\nonly institution of higher learning in the state which possesses educational\nbroadcasting facilities, it is sharing what it has with its colleagues in the field.\nIn a program \"College Cavalcade\" twenty-one institutions are cooperating to\ntell this story. All colleges in the state were invited to participate. The\nformat will be a brief round-up of the week's top news from as many colleges as can\nbe covered in the weekly 15-minute show. The Ohio State University public relations\noffice gathers the material for the broadcast and aids in publicizing the program\nthroughout the state.\nThe \"have-not\" institutions-as far as radio is concerned-sometimes feel\nleft out and perhaps a bit jealous of the schools which have their own stations.\nThis is a chance to improve relations and an understanding of the job to be done.\nAfter all-no one institution has a monopoly on program talent.\nPROPAGANDA ANALYSIS\nFrom long experience they know how to do it! Spokesmen for the \"industry\"\ncan concoct potions which make the late Herr Goebbels' efforts look puny. A\nrecent speech on censorship-threats by one of them includes these; \"The American\ntenet-un-American approach-alien outcroppings-bombastic individuals-smugly\nunconcerned.\"\nWhy not a few lessons in propaganda recognition-as we had it during the war?\nFACILITIES AND THE FCC\nWOI-(Ames, Iowa) application granted for special service authorization\nto operate from 6:00 AM to local sunrise. (Feb.20, 1947)\nTrustees of Indiana University-(Bloomington, Ind.) Application accepted for\nCP for new 10 Kw. non-commercial educational station amended to use channel *$220,\n91.9 Me. (January 28)\nTech. High School-(Dade County, Miami, Fla,) applied for CP for new non¬\ncommercial educational FM station, 91.9 Me. 250 watts (January 29)\nJunto, Inc.-(Philadelphia, Pa.) application for new non-commercial\neducational FM station amended to 90.1 Me. 20 Kw. Accepted for filing (Feb.12, 1947)\nWIUC-University of Illinois (Urbana, Ill.) applications for CP to change\nfrequency from 42.9 to 91.5 Me. and install new FM transmitter and antenna system.\nv (Feb. 18,1947)\nKSUI-University of Iowa (Iowa City, la.) application for modification of\nCP for new non-commercial educational FM station to install new transmitter and\nincrease power from 1 Kw. to 3 Kw. and make changes in antenna system.(Feb.18,1947)\nBoard of Education-(Toledo, Ohio) applied for new non-commercial educational\n(_FM station 250 watt power.\nWNAD-University of Oklahoma (Norman, Okla.) applied for CP to increase\npower from 1 Kw. to 5 Kw., DA, and mount FM antenna on tower. Make transmitter and\nstudio changes. (Feb. 20, 1947)\nWPTL-(Providence, R«I*) application fdr extension of* time for.beginning\noperations of new non-oommetcial educational FM station. (Feb: 20, 194?;"
}