{
  "id": "d1610-8",
  "text": "NAEQ NEWS LETTER\nPage 9\nJune I, 1943\n8E TO STOP THERE - THE PROGRAM IS BOOKED, YOUR JOB IS DONE, THE RADIO PEOPLE\nCAN WORRY FROM THEN ON, A MOST BEAUTIFUL WAY OF NOT BUILDING GOOD PUBLIC\nRELATIONSo INSTEAD YOU HAVE JUST BEGUN THE JOB. YOU MUST NEXT SEE THAT ALL\nPARTICIPANTS ON THE PROGRAM ARE ADVISED AS TO TIME AND PLACE AND THE PA FT\nTHEY PLAY IN THE PROGRAM AS A WHOLE; TO SEE THAT THE CONTINUITY IS PREPARED,\nAND SENT TO THE NETWORK; THAT THE MUSIC, IF ANY, IS SELECTED, THE NAMES OF\nTHE COMPOSITIONS, COMPOSERS AND PUBLISHERS SECURED; THE SPEECHES WRITTEN\nAND COPIES SENT TO THE NETWORK FOR OKEM AND TIMING; THAT THE PROGRAM IS\nPROPERLY TIMED, AND THAT THE PARTICIPANTS ARE AT THEIR APPOINTED PLACE LONG\nENOUGH AHEAD OF TIME FOR A COMPLETE REHEARSALo EVEN THEN YOUR JOB IS NOT\nDONE o\nIn THE FOURTH PLACE, IT IS UP TO YOU TO SEE THAT THE PROGRAM IS PROPERLY\nPUBLICIZED, THAT YOUR SCHOOL, YOUR ALUMNI AS WELL AS THE PUBLIC AS A WHOLE\nIS THOROUGHLY FAMILIAR WITH THE FACT THAT YOUR SCHOOL IS BROADCASTING AT\nSUCH AND SUCH A TIME, ON SUCH AND SUCH A NETWORK, WITH OUTLET OVER SUCH AND\nSUCH A STATION* By NOT COMPLETING THE LAST PHASE IN YOUR ROLE, YOU ARE\nLEXTING THE NETWORK AND ITS AFFILIATED STATION DOWN AND YOU HAVE ADDED THE\nF < N A L LINK IN THE CHAIN OF BAD PRACTICES IN YOUR PUBLIC RELATIONS DEALINGS\n/WITH THE NETWORKS*\nTHE PRESIDENT SPEAKS\nAnd HIS INTIALS ARE FOR, BUT GDW—GILBERT D„ WILLIAMS, PRESIDENT OF MAEB*\nIN A MOOD FOR WRITING ONE DAY, G|0BS SENT ME A LONG DISr>*TCH, EXCERPTS OF\nWHICH I * LL QUOTE (AND I DON'T MISQUOTE HIS INTENDED COMMENTS BY EDITING\nHI STILL THINK THE DAY OF LONG HAIRED, THIS-IS-GOOD-FOR-YOU-SO-YOU-MUST-\nLISTEN IS PAST« At WBAA I've TRIED TO BORROW THE BEST OF COMMERCIAL PRACTICES\nTO CORRELATE WITH NO^I*COM\\€ RCI AL ADVANTAGES* I WANT ALL THE LISTENERS I CAN\nGET, NOT IIU ST THE “tjPPER 5^\". WHEN I FIRST TOOK OVER WBAA, I MADE SPECIAL\nTRANSCRIPTIONS TO ENDER THE Ouflt0 INSTITUTE COMPETITION* IT TOOK ME A COUPLE\nOF YEARS TO REALIZE WHAT THEY WANTED WAS FORMAL EDUCATION, SOMETHING THAT\nCOULD BE WORKED INTO A H|STORY OF THE ^AST-WEST, INTERAWER ICAS AND All POINTS\nNorth sort of definite course in grade school or high-school* The subcle\nAPPROACH, THE SNEAK«UP-ON—THE-BL I ND-S1DE WAS THROWN OUT OF THE COMPETITION*\nIT HAD TO BE DEFINITE, INALIENABLE TO SPECIFIC CLASSROOM COURSES* So I\nSTOPPED ENTERING TRANSCP1PTIONS« At THE SAME TIME THE IDENTICAL DISCS\nBROUGHT MUCH FAVORABLE ATTENTION WHEN BROADCAST OVER WBAA, BOTH FROM ADULTS\nAND YOUNGER PEOPLE*\nThe above is merely a preamble to my reactions concerning some NAEB’s comments\nto Phillip Cohen re the distributing effect of the “commercial type1' voices\nON THE 0^1 I-MINUTE SPOTS. WHY? MUST EVERYTHING ABOUT AN “EDUCATIONAL”\nSTATION BE COMPLETELY AT VARIANCE WITH A GOOD COMMERCIAL STATION? I THINK\nIF MORE OF US USED MORE AVERAGE TECHNIQUES, WE WOULDN’T BE LOOKED UPON AS\nA THING APART. CERTAINLY MOST OF BROADCASTING TECHNIQUES ARE BASIC* If\nWE CANNOT HAVE SOMETHING IN COMMON WITH THE PROFESS IONSLS IT*S TOO BAD*\nI REMEMBER WAY BACK \"'HEN PROFESSOR GORDON STARTED WITH HIS SWELL WORK OVER\nW HA 0 It CERTAINLY WAS MABB APPEAL; HIS THOUSANDS OF LISTENERS WERE NOT\n8EING FORMALLY EDUCATED, BUT THEY LOVED IT.\"\nDOTS AND DASHES\nWHA, the Wisconsin state staion on the Univepsity campus, claims the title"
}