{
  "id": "d696-126",
  "text": "- 3 -\nNAEB AUDIO STATION BREAK PROMOS — prepared by last year’s P.R,\nCommittee and transmitted to NAEB President - present status unknown.\nNAEB IMAGE STATEMENT PREPARATION - While this chore has been assigned\na number of members of this and last year's P.R. Committee, those involved\nhave uniformly declared the task an impossible one—at least brief enough\nto be of some P.R. service. Paraphrasing the comments—\"We all know\nwhat the NAEB image is—it just can't be said in a few words.\"\nCHECK LIST OF PROMOTIONAL ROUTINES FCR EDUCATIONAL BROADCASTING\nSTATIONS - Not done, but our P.R. Manual may largely take care of this.\nCOMMUNITY WORKSHOPS - Dim view taken by most members in view of\n(a) abundance, maybe too many, workshops now, and (b) too much time in¬\nvolved for Committee members who have full-time Jobs of their own.\nIMPROVED TRAVEL EXHIBIT - most Committee members approve - nothing\ndone about it.\nLOCAL NEWS RELEASES FROM HEADQUARTERS ABOUT NAEB MEMBERS - good idea\nbut man-power time not available at Headquarters.\nSTUDY OF THE NAEB PROFILE - Suggestions have been made that the\nexisting image of NAEB with non-NAEB persons and organizations be the\nsubject of intensive study as a prelude to more accurate knowledge as\nto Just where our P.R. targets are located. Such a study should include\ncommercial broadcasters. Where opposition to educational broadcasting\nis identified, the reasons involved should be carefully appraised.\nPREPARATION OF MAILING LIST TO INCLUDE LEADERS - This involves an\naddition to Headquarters mailing list of NAEB materials so as to include\nindustry leaders and other opinion molders.\nSUMMARY\nThe preceding report, listing things accomplished, things on the\nway, and.items not yet out of the dream world, indicate a Committee\nreplete in ideas and dedicated to the advancement of Educational Broad¬\ncasting. To implement every idea advanced is, of course, out of the\nquestion without the services of many full-time staff people. Thus it\nhas been necessary for the Committee, consciously or otherwise, to confine\n« . ???;!'vlt:Les t0 items that can be carried to completion with existing\nfacilities. °\ntake this opportunity to thank sincerely all members of the\nPublic Relations Committee, Harold E. Hill, and Betty McKenzie for help\nideas, and work far beyond the call of duty."
}