{
  "id": "d696-129",
  "text": "Radio Promotion Tapes\nRoy* Flynn was assigned to review and edit audio tapes which were previously\nproduce d, vhen send them to Henry Mamet for review and possible use in the Public\nRelations \\ltp *\nSummer Workshops\nChairman Sulzer asked members to inform Betty McKenzie of any ratings at\no materials could be distributed. Betty mentioned that the NAEB\nexhibit is available for large workshops0 Henry Mamet suggested the regional\ndirectors be delegated to keep headquarters informed of any educational conventions\nat which the exhibit could be used*\nNAEB Representation\nChairman Sulzar expressed his feeling that lumbers of the Public Relations\nCommittee should be asked to represent NAEB at functions requiring official\nrepresentation in their respective area:3*\nMembership Drive for Public Affairs If rectors\nHenry Mamet suggested NAEB contact Public Affairs directors of commercial\nstations to invite them to join NAEB and participate actively in the organization.\nHe suggested a letter be written with membership blank enclosed. Chairman Sulzer\nsuggesvei the possibility of members doing this as a public relations activity*\nCoramiutee HASB headquarters contact all commercial stations/\nproviding them with a catalog listing the availability of NAEB programs,, as well\nas network t^s* NAEB brochure, and application for membership*\nFull-Time P„ Ra Director\nThe subject of a full-time 'hiblic Relations Director was discussed* Los Peneyuy\nwas asKed to explore possible sources of funds to underwrite the salary of a director*\nNAEB NEWS TO RAPTOR COLUMNISTS\n... suggested a11 ma«3°r radios newspaper columnists be supplied\nwith NAEB ^formation* It was suggested that HQs request members to supplv\nlists of thdio and television columnists and editors in various communities„ so\nthese sources can be supplied with appropriate material. Marion Corwell\nrecommended that a special effort be mad© to supply all NAEB information to\nBr oa dc as ting ^Te lac as ting»\nCommercial Educational Relations\nSul2er ou* the importance of exerting every effort to cement\nrelations between commercial and educational stations*\nThe meeting adjourned at 12sii0 P. M*\nRespectfully submitted*\nMarion Corwell"
}