{
  "id": "d696-13",
  "text": "BROADCASTING COMMISSION\nCHICAGO BOARD OF RABBIS\n72 E. ELEVENTH ST. • CHICAGO 5, ILL.\nSUITE 500 HArrison 7-5863\nHENRY H. MAMET. Executive Director _ .\nMay 15, 1961\nMr. Elmer G. Sulzer, Director\nRadio and Television Communications\nIndiana University\nBloomington, Indiana\nDear Elmer:\nWith regard to our discussions concerning a public relations program\nfor NAEB, and in compliance with your request for a written statement\nabout some of the proposals covered, listed below are some of my\nsuggestions.\nI*_COMMUNITY WORKSHOPS\nI believe this to be one of the most important public relations projects\nfor NAEB, for a community can learn more about an organization through\nwhat it does, than from tons of PR materials.\nI propose workshops conducted throughout the country under the auspices\nof NAEB in cooperation with a local member (preferably active, but\nassociate or affiliate if the first is not possible). In addition, NAEB\nmight also co-sponsor such workshop with a regional chapter of a national\norganization, or an institution of higher learning which has not yet\nbecome a member of NAEB, or a school system.\nSuch workshop would be open to representatives of community and civic\norganizations, or to interested teachers in the case of a school system,\nor to FTA groups, or a combination of all three. This would not be a\n\"hard sell\" of NAEB, but could include an explanation of NAEB in one of\nthe presentations.\nThere are many forms which such a workshop could take. There might be\nmore than one workshop a year appealing to different participation. This\nmight even become an annual kind of a thing. Ultimately it might also\nlead to regional meeting of NAEB, or in connection with a regional\nmeeting. However, such meetings would have to be geared to a different\nlevel than one for members. Subject matter would have to be very\nelementary.\nThe first workshop in an area should include first a presentation on the\nrole of broadcasting in society, with some analysis of the audience,\nviewing habits and impact. Secondly, some attention should be given to\ncontrols. Participants would learn about government regulation, industry\nself-imposed regulation and the role of the public in regulation.\nFinally, broadcasting as media of communication should be discussed,\nwith particular emphasis on effectiveness as a teaching tool. This\nworkshop would be a tremendous contribution on the grass roots level to\ngeneral comprehension about a most important aspect of life in modern\nsociety."
}