{
  "id": "d696-137",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nReport of the Public Relations Committee\nPresented at the NAEB 37th Annual Convention\nOctober 23 - 26, 1961, Washington, D.C.\nFunctions of the P.R. Committee\nA Public Relations Committee of an organization stich as the NAEB\nhas two basic functions in the designing, initiating, and approving of\nPR. techniques. One of these is to assist the member stations and organ¬\nizations in improving the images of their respective operations. The\nother is to build up the image of the parent organization, in this case\nthe NAEB, when in so doing the image of the component members is corr¬\nespondingly helped.\nAccordingly, the efforts of your P.R. committee have been devoted\nto both of these functions. In view of the fact that this committee,\nin common with other NAEB committees can have very few meetings in the\ncourse of an average year, not as much can be accomplished as we would\ndesire. Nevertheless, quite a lot of things (a) have been done, or\n(b) are in course of implementation. Each of these are discussed\nbriefly below.\nNAEB Promotion at Summer Workshop\nContact wqs made with approximately thirty related organizations\nholding summer workshops in an attempt to secure liason persons for the\ndistribution of yNAEB material and for answering questions regarding the\norganization with a possible recruitment of membership as a goal.\nSuccess in varying degrees was obtained with more than half of these\ngroups and hundreds of copies of our publications were distributed.\nCreation of Speakers Guide\nA proposal to the NAEB goard has been presented for the securing\nof funds to print and distribute an attractive looseleaf speakers 1\nguide much on the order of the guides currently in use by the NAB.\nVarious \"speech summaries\" in the proposed guide would cover all phases\nof educational broadcasting, enabling the speaker to face up to most\noratorical demands with a minimum of effort. Besides the primary\nfunction, the guide would be useful in readily furnishing authoritative\ninformation for news stories, background material, and answers to\nquestions that are constantly asked our members."
}