{
  "id": "d696-17",
  "text": "INDIANA UNIVERSITY\nBLOOMINGTON, INDIANA\n* 5\n•%\nRADIO AND TELEVISION SERVICE\nDEPARTMENT OF RADIO AND TELEVISION\nMay 17, 1961\nMr. Harold H. Hill\nNational Association of\nEducational Broadcasters\nSuite 1119\nDupont Circle Office Building\n13U6 Connecticut Avenue, N. W.\nWashington 6, D. C.\nDear Harolds\nKi£CEl v cD\nMAES HEADQUARTERS\nMAY 1 8 1961\ni\nEnclosed is a copy of a letter I just received under date of May 15 from\nHank Mamet. Generally speaking, I believe that his ideas are very good,\nbut I have a feeling that some of them fall in the areas of other NAEB\ncommittees rather than the PR group, and I would like your advice and com¬\nments on this.\nCommenting in more detail—a community workshop in educational broadcasting\nis always a good idea, but my questions regarding this are two: first,\nshouldn’t this be the function of another committee; and second, would this\nnot duplicate and perhaps water down existing workshops in other areas.\nBack to the decals again. I have no objections to a decal for automobile\nwindshields and probably the small size of the two NAB jobs submitted should\nserve the dual purposes of automobile windshields and station doors. There\nis a question as to the practicability of arting in any information on a\ndecal. Some of the people around here who seem to know more about it than\nI do indicate that decals just are not made that way and that it couldn’t\nbe done without causing a curl when the peel is made.\nHow about the descriptive brochure? Don’t we have such a thing? If we do\nand it is adequate for the purpose. Hank’s ideas as to distribution of this\npublication are certainly worth considering.\nRelative to awards, I am somewhat dubious—not because of any difficulty in\nthe idea, but simply for the reason that there is so much involved in set¬\nting up a judging committee and the like that we should take a firm look at\nthis activity and realize fully what is involved before we embark upon it.\nIf you and Betty will give me your candid feelings regarding these four\nsuggestions, I will incorporate them into a general circulation to the PR\nCommittee that I intend to make in the near future. Best regards.\nEGSsmm\ncc: B. McKenzie\nH. Mamet\nCordially yours.\n7 .^7 * f L 'Nr/\nElmer* G. Sulzer. Director\nRadio and Television Communications"
}