{
  "id": "d696-19",
  "text": "Mr. Elmer G. Sulzer\n-2-\nMay l£, 1961\nThe need for such a workshop was highlighted for me at the White House\nConference on Children and Youth, when I found that people about me,\nwho were supposed to be discussing recommendations for mass media, had\nno comprehension about the subject or the problems involved. Many\nstates did not even have recommendations in this area. I am sad to\nreport that our state was among them.\nA second workshop, perhaps some six months later for the same group,\nmight be of the \"how-to-do-it\" variety, with sessions on criteria for\nbroadcasting, and special attention on preparation of materials. This\nwould help to explore and mobilize community resources for the production\nof interesting, worthwhile programs.\nThe mechanics of the workshop could be adapted to the local level and\nsize of the group. If the group is small, presentations and discussions\nwithin the group would be adequate. If attendance is large, a\npresentation and then break-up into buzz sessions with a resource person\nwould be desirable.\nA few examples of sponsorship might be in order. Suppose the National\nAssociation of Educational Broadcasters, in cooperation with the\nUniversity of Indiana were to hold such a workshop. You would then\ninvite for participation representatives from every civic group, from\nevery religious group, from all your schools, etc., from every corner\nof your state. This would be an all-day meeting, with participants\ncharged enough to cover luncheon and a little more to cover costs of\nmailing, etc. Your chief expense would be for space — and I doubt if .\nthis would represent a real cost. Headquarters might furnish one staff\nperson to help with organization, and one speaker. The other personnel\ncould come from your faculty and your staff. There would be some work\ninvolved in organization and building attendance, but the public relations\nvalue would be tremendous, and the service to the community would be\nimmeasurable.\nSimilarly, in Chicago we have a natural situation for a huge workshop\nwhich would give us national coverage. We could hold a workshop under the\njoint auspices of NAEB, the University Broadcasters Association, and the\nStatewide Cooperating Agencies Committee of the Illinois Commission On\nChildren (with 65 national agencies as members) of which I am mass media\nchairman. We could invite the clergy of the three major faith groups\nthrough their respective offices. In fact, the workshop could be done\nby NAEB in cooperation with an almost endless list of cooperating agencies.\nA local committee could be established, and among us, I am sure, personnel\nand speakers could be found. With a little promotion, this could well be\na pilot project for the nation, and could also be used as a forum to\nindicate public interest which would be helpful to everyone concerned.\nThis might be significant enough to warrant a special assignment of a\nstaff person for several weeks to manage the affair, and to publicize it\nwidely. It could be held either on one of the campuses, or even in a\npublic place downtown, such as the new convention center. Some 1200 could"
}