{
  "id": "d696-6",
  "text": "-2-\nThe new aspect of International radio networking\nundertaken by the Center with its Broadcasting Foundation\nmerger is also most interesting. Of course this was one\nof the growth areas of NAEB as*Harry has so often mentioned.\nDoes this now cut the NAEB down to national scope? Does\nthis now make the merger of the NAEB network with the\nCenter a matter of time? Frankly* I believe this Is what\nis happening. I also believe It must happen, for educational\nradio like ETV needs catalytic Jolts of funds and projects\nto increase its growth and impact. It Is difficult to push\nthe radio network image of NAEB for It might soon become\na different but stronger member of the METRC•\nWith the Center so graciously supplying funds for\nNAEB radio program projects during the past years, this\nis not a \"grab for power” but is a practical solution to\nan important development problem.\n2. Learning Resources Institute has taken unto\nitself that area of educational programming which deals\nwith instruction at the elementary, secondary, and college\nlevel. This area will rapidly become theirs by top level\ninvolvement and by acquisitions.\nHaving already acquired the NBC Continental Classroom\nseries and working with all three nets on other potential\ncredit courses in the future, they are on the way. With\nthe great amount of credit courses to be produced for\ntheir Airborne Council and with other production possibilit¬\nies at stations and closed-circuit studios they will have\nmuch to offer the field.\nLR1 will also include radio tapes and scripts of\ninstruction programs at all levels, so It seems to me\nthis area Is being developed on a national scale inten¬\nsively and we need this development.\nBy Intensive involvement of top educational administ¬\nrators, state superintendents, local superintendents,\ncollege presidents, etc. LR1 will have few problems with\nNAEB members who might oppose their plans. (It would be\ndifficult for a department chairman to oppose his president\nand deans.) Therefore, I believe we must work to facilitate\nthe growth of LRI and assist in the gradual change-over,\nmaking sure that NAEB still holds some of its prerogatives\nof \"pioneer ownership.\" (a sort of educational broadcast¬\ners homesteading responsibility and veto.)"
}