{
  "id": "d696-7",
  "text": "-3-\n3* JC£T with its responsibilities for govern¬\nment contact, station and network development and engineer¬\ning information is now being financed Jointly by the Center\nand Learning Resources Institute while a decision for its\nfuture is being made. The NAEB had no funds to assist its\nchild and therefore the NETRC and LRI decision to not let\nit go out of business was laudable. However, right now\nthe NAEB cannot in good faith build an image of station\nand network development for it has given over most of\nthis area to these other organizations,\n1*. Ohio Institute has become a/ platform and\nmeeting ground of educational broadcasters and public\nservice directors of commercial stations. Its awards\nare an important part of publicity for educational and\ncultural broadcasts. It is also an area for closer\ncontact with allied citizens groups interested in pro¬\nmoting educational broadcasting. It also serves a\nfunction for Job placement for personnel entering the field.\n5* NAEB right now is trying to serve all of the\nfunctions 11sted above plus many others. By committees\nwhich meet once or twice a year it attempts to do the Job\nthat other organizations have full time employees working\non every day.\nGranted NAEB now has an excellent full-time President\nand Vice-President, but painfully few other executives\nto work with these other organizations. I am convinced\nthe NAEB must stake out a claim for a certain aspect of\nbroadcasting and hand over some of its present respon¬\nsibilities to these other organizations. Being quite\nnew in the field it is easy for me to say this for I\nhave not worked for years on some sacred cow.\nAt this time there is great and important financial\ninterest on the part of the Ford Foundation in closed-\ncircuit instruction for credit. I believe a comprehensive\nnationwide development project of closed-circuit videotape\nand kine exchange under the guidance of NAEB might be\na worth while project.\nThis project should also be done in radio and include\nfacsimile. This might give NAEB the exciting image it\nneeds, I refuse to believe it will become a meeting for\npapers, JJocial contacts, and remembrances of the old days.\nThere is much for the NAEB to do."
}