{
  "id": "d696-8",
  "text": "-k-\nObviously I don’t believe your request of a \"concise\nimage\" is possible at this time.\n0. Your idea of a development of a check list of\npromotion routines for educational stations might be worth\nwhile, but first we must find out who does P.R. and what\nhis or her background is. The Center’s Houston meeting\ndiscussed the problems of P.R. releases slides etc. and\nthe differences in station personnel and in local policies\nbecame evident. Such a check list should be worked out\nwith the Center, JCET, L.R.I., and also many manufacturers\npresently affiliated with NAEB who send out educational\nbroadcasting newsletters.\nI don’t know how much is duplicative, but I’d say\n2/3rds of the published information I receive during a\nweek I have seen or heard before, and I know there are\nmillions of important people who get nothing. So first\nof all I suggest a joint P.R. meeting of all agencies to\nplan a master system and selection of content material.\nAfter this Is set up, the check list has greater meaning\nfor the local P.R. person could do a much better Job with\nmore and better materials available.\nC. The Center has already started a program schedule\nexchange of ETV stations. I think that by next fall they\ncould give us much information on the problems involved\nand on preliminary results of such a project.\nD. The problem of the image of NAEB within a station\nis difficult in ETV for we are not too sure what they will\noffer us in services. In radio it appears the image could\nbe made more distinct, but it is dependent on potential\nchanges. I respectfully suggest this awaits solution of\ntendencies I pointed out in A.\nE. The image of NAEB with students will be dependent\non what services NAEB will perform for students, not\nconfru£Ing the 1EST Columbus Image with the NAEB either.\nF. The problems of developing success fetories are\nnot too difficult to solve. Some ETV stations, for example,\nmust exist on public support and public acclaim. They\nalso have large P.R. staffs, and they are geared for local\nand national publicity. We know this is their lifeblood\nand do not begrudge them their publicity successes for if\nthey did not have great public acclaim they would receive\nfew public contributions and might not be on the air."
}