{
  "id": "d696-94",
  "text": "J*r. rimer G. Sulaer, ttroct*\nHadio and Television Onnwatlaatloga\nIndiana University\n\"iTomingtati, Indians\nHear Bpcbo:\n:»J!nemx is Bade to Tom Maty1* letter rettsrffitag this African Bar Asso¬\nciation .'tooting, ami your letter* on the sane subject.\nmxet, let m say that both Betty and X cwnaidered the possibility of\nHftEB representation at the Jte»i4<wn Bar Association Seating. However, by\nthe time it mm possible for us to try to set saaemnB up there ms not\ntime. In short, we had art received enough advance notice of the meeting\nto really do anything about it.\nOtis does not detract fro* the Suet that BASE represssrtetioa «* mxti meet-\ntom X* oertsialy sonethiaE we should attempt to follow up on whenever poeei-\nbla. As you well Smew (because you and Betty set it 19) MSB brochure* sad\nother arteriole Saw* been made available at several aerttags of organisations\nduring this past ®«*wr. Sets, I think, ms a dafiait© step la the right\ndirection towerd establishing bettor rapport with those other organizations\naad asking the M stcay bettor known screws the country, especially to those\npeople v*o are engaged i» activities eiatlar to oua*. Hhen it cooes to actual\nrepraseBtakioB, i.e., sending an MSB represmtatim to sudd Meeting, we run\ninto the problem of eapanae . As you well team, the mm budget Is Halted in\n•U respects, and we do art have money to send people to such meetings. Bow\never, to the part whenever aa HASH amber was goto® to attend euefc a meeting\nanyway, we hem made every effort to see sort that person to supplied with the\nnecessary materials tod tafouartlon to do a good public relations Job. Se\nwill continue to try to do this to the mums, aad perhaps someday we mil be\nable to aancansa tor arsease-paid representation at a* least some of tome mart-\nin@&*\nto to tvm to tte Otiife* iMMr to tot iamiea tbo Ikstional\nof a1 tMafe, i« a tortile H3b% aad oh© tot\nsteiia to pursued. 'Her® tola, regretoMy, to natter of aonoyr exstog la*\nI uUl^aa tot «»0gta e<W of to SAB Guide'’ aaA send It al<m\nto Betty Msrnwl®, «o& «h© osa ©at soBses pnatog eBttoto as- to tot\nit would cost m to put to sa»fcMsg of & totor astoe. la to jaeas&iiae, X\ntbto It would mx&aMkp b© adviasato tor grouar eotottoe to tort iraftiag an\ntor eucfc a booklet- m<m if «e aare not la a poaitioa to put it out in a"
}