{
  "id": "d1601-0",
  "text": "The National Association of Educational Broadcasters\nVol. II, No. 7 DuPont Circle Bldg., Washington 6, D.C.June 20, 196l\nCLEAR CHANNEL BREAKDOWN\nOn June 12, the FCC, at long last, made a move looking to a final decision in\nthe clear channel matter, which has been hanging fire for some 15 years. It releas¬\ned instructions to its staff ordering the draft of an order breaking down thirteen\nof the clear channels, thus opening the way to establishment of additional stations\nin certain relatively sparsely populated areas. It is expected that the decision\nwill be opposed in the courts by occupants of the channels involved.\nThe notice does not refer to the several petitions which the NAEB has filed\nurging reservation of a portion of these channels for educational use. There is\nno indication of whether our petitions were considered, granted, or denied. There\nmay be something forthcoming on this later this month upon the adoption and issuance\nof the formal decision.\nIn any event, educational institutions can obviously apply for permission to\noperate on these frequencies and, in the states where the possibility exists, imme¬\ndiate consideration can now be given to the possibility of improving thereby the po¬\nsition of existing educational radio stations or of establishing new ones.\nThe Commission announcement follows:\nThe Commission on June 12, 1961 instructed its staff to prepare a Report and\nOrder concluding the Clear Channel proceeding (Docket 67^1) by rule amendments open¬\ning the way to the assignment of one unlimited time Class II station on each of 13\nClass I-A clear channels, under controlled conditions to provide service to under¬\nserved or white areas, as follows: Permissible Location of new\nChannel\nExisting Class I-A Station\nClass II Station\n670\nkc\nWMAQ\nChicago\nIdaho\n720\nkc\nWON\nChicago\nNevada or Idaho\n750\nkc\nWSB\nAtlanta\nAnchorage, Alaska 1/\n760\nkc\nWJR\nDetroit\nSan Diego, Calif, l/\n780\nkc\nWBEM\nChicago\nNevada\n880\nkc\nWCBS\nNew York\nNorth Dakota\nSouth Dakota or\nNebraska\n890\nkc\nWLS\nChicago\nUtah .\n1020\nkc\nKDKA\nPittsburgh\nNew Mexico\n0\n0\nkc2j\nWBZ\nBoston\nWyoming\n1100\nkc\nKYW\nCleveland\nColorado\n1120\nkc\nKM0X\nSt. Louis\nCalifornia or Oregon\n1180\nkc\nWHAM\nRochester\nMontana\n1210\nkc\nWCAU\nPhiladelphia\nKansas, Nebraska or\nOklahoma\nl/ lb accommodate stations required to shift from their present frequencies under the\nUnited States-Mexican Broadcasting Agreement.\n2j to be reclassified as a Class I-A clear channel."
}