{
  "id": "d1685-0",
  "text": "N A E 8 NEWS LETTER\nNATIONAL ASSOCIATION OF\nFrank E. Schooley, Editor,\nEDUCATIONAL\nStation WILL\nJune I,\nBROADCASTERS\nUrbana, III.\n1944\nNAEB MEETING IN COLUMBUS\nWell, many of us naeBers met prof stably in Columbus in connect son with\nTHE ANNUAL OHIO STATE INSTITUTE. And, IF MY NOTES, KEPT JOINTLY B.Y\nAllen Miller and myself, can be interpreted, I8ll try to give you the\nGIST OF THE HAPPENINGS. KIBITZERS WaLDO AbBOT AND CaRL MENZER, PLEASE\nKEEP QUIET NOW.\nIN ABSENCE OF THE PRESIDENT, GILBERT D0 WILLIAMS, PURDUE, ALLEN MlLLER,\nKOAC AND NAEB VICE-PRESIDENT WAS PRESIDING AT OUR SuNDAV SESSION.\nThe Association voted to ask the United States Office of Education to\nREPRESENT NAEB ON THE RADIO TECHNICAL PLANNING BqaRD. The OFFICE IS\nNOW REPRESENTED ON SOME OF THE RTP8 PANELS AND IT WAS THOUGHT THAT NAE8\nCOULD BE PROPERLY AND PROFITABLY SERVED THROUGH THIS SOURCE. MOTION WAS\nmade by Abbot.\nThe acting president was AUTHORIZED TO APPOINT a SPECIAL COMMITTEE TO\nINVESTIGATE AND REPORT TO THE FULL MEMBERSHIP ON THE PROBLEMS AND\nRELATIONSHIP INVOLVED WITH THE MANY SCHOOL BROADCAST STATIONS AND NAEB.\nIT WAS POINTED OUT THAT THERE ARE MUTUAL FIELDS OF INTERESTS, AS WELL\nAS SOME DIVERGENT INTERESTS. FILLER APPOINTED BqS COLEMAN, WKAR,\nchairman, Waldo Abbot, Michigan, and George Jennings, WBEZ, and asked\nTHEM TO REPORT BY JULY I.\nOlSCUSSION WAS HELD ALSO ON POSSIBLE AFFILIATION WITH FMBI, NAB, AND\nAER. The Executive Secretary was instructed to investigate the\nPOSSIBILITIES OF AFFILIATING WITH NAB AND FMBI , AND TO ACT UNDER CERTAIN\nCONDITIONS. IF POSSIBILITIES FOR AFFILIATION EXIST OUTSIDE OF THE\nPRESCRIBED CONDITIONS, THE EXECUTIVE SECRETARY WAS INSTRUCTED TO REPORT\nBACK TO THE ’WHOLE ORGANIZATION.\nThere was much expression of members present for the need of a Fall\nMEETING OF NA£Be AFTER CONSIDERATION OF MANY PROBLEMS, THE ASSOCIATION\nVOTED TO MEET IN LATE SEPTEMBER OR THE FIRST WEEK IN OCTOBER. The EXACT\nTIME AND PLACE ARE TO BE DETERMINED BY THE NAEB EXECUTIVE COMMITTEE. An\nINVITATION TO HOLD THE MEETING IN DETROIT WAS EXTENDED BY WaLDO A0BOT.\nAfter a recess, the Association reconvened with Elmer Sulzer of Kentucky\nON THE FLOOR. ELMER POINTED OUT THE NEED FOR MEMBERS KEEPING ON THEIR\nTOES, ESPECIALLY IN THE POST-WAR PERIOD, AND KEEPING UP TO DATE ON\nEQUIPMENT, SOME OF WHICH MIGHT BE AVAILABLE THROUGH GOVERNMENTAL SOURCES.\nElmer was appointed a committee of one to advise NAEB members.\nA discussion of promotion was held. Harolo McCarty of WHA agreed to\nGET OUT A TYPICAL MEMBER-STATION REPORT BY JULY 3 WHICH COULD SERVE AS\nA MODEL FOR ALL. IT WAS DEEMED ADVISABLE TO FURNISH THE ASSOCIATION WITH"
}