{
  "id": "d890-100",
  "text": "Converting wavelengths into frequencies x \\\nIt has come to our notice that many of our listeners haveJbee^i experienc¬\ning difficulty in converting wavelengths into frequencies.vU^hough both\nwavelength and frequency are announced in our programmes, this is not\nsurprising in view of the differences of definition of frequency in various\ncountries. In Europe, it is the practice to express frequencies in terms of\nkilo-Hertz (kHz) or mega-Hertz (MHz) .whilst in other parts of the world\nthe terms megacycles (Mc/s) or kilocycles (kc/s) per second are used.\nIt is of value to know that:\n1 MHz = 1 Mc/s = 1,000 kHz = 1,000 kc/s.\nThe formula for conversion is as follows:\nthe frequency (kHz or kc/s) X wavelength (in metres) — 300,000\nExample: a wavelength of 25 metres is equal to a frequency of\n300,000\nkHz = 12,000 kHz = 12 MHz.\nIn conclusion, here are several points which may well be of importance.\n• In certain cases, television aerials or those erected for the reception\nof FM (VHF) programmes may give good results on the shortwave\nband. This is, however, very much dependent upon local conditions.\n• External interference experienced with aerials having a single lead-\nin can be reduced by the use of a co-axial cable for the lead-in. The\ncentre conductor is connected to the input of the receiver and the\nshield to earth. When purchasing co-axial cable for this purpose,\nmake sure that it possesses the lowest possible capacity per foot and\nalso keep the length to a minimum.\n• Interference from the mains supply, such as that caused by fluor¬\nescent lamps, washing machines and other electric apparatus,\ncan best be reduced by the use of so-called “interference suppressors”\nwhich are connected directly to the source of the interference. Your\nradio dealer will be pleased to advise you further in this matter.\nOur Technical Department has prepared this booklet for you with the\naim of assisting you in the acquisition of the most desirable types of\naerial for your purpose, and the erection thereof. We hope that you will\nbe able to profit from the advice given and we shall always be pleased\nto hear the result of your efforts. Your experiences and findings may well\nbe of interest and importance to other listeners.\nNote: 7372 This is the code number of an aerial marketed by Philips in\na number of countries. It is an “L” aerial meeting all requirements and,\nin addition, for sale at the lowest price possible.\nRadio Nederland - P.O. Box 222 - Hilversum\nPRINTED BY BOSCH-UTRECHT"
}