{
  "id": "d890-102",
  "text": "ADDRESS\n■by\nMr. D.E. Tijmstra, Director-General of Radio Nederland* at the\nopening of the new studio-building on October 11th* 1961.\nYour Majesty* Your Excellencies, ladies and gentlemen* and\nalso our listeners and friends all over the world;\nThe inauguration of this new studio-building is at\nonce the conclusion of a period of activity, and the beginning\nof a new chapter. The pioneer period in which we worked in\nconverted garages and in attics has come to an end. We have\nentered the phase of ultra-modern studios and office premises\nwhich breathe efficiency.\nTo those who may be inclined to idealize the snug\nold days, and to envelop them in a haze of romantic nostalgia,\nI would says the entire world of radio is being more and more\nrationalized. But there will always remain scope and opportun¬\nity for inventiveness. This goes especially for the inter¬\nnational short-wave station, which one may rightly call \"the\nlast home of mystery and imagination'1. Just how strongly this\napplies in our own case will become plain to you presently,\nwhen I sketch a completely new field of activity which Radio\nNederland enters upon today.\nSo as far as that goes we can remain ourselves. And\n\"mystery” was in at the birth of Radio Nederland, which -\nmirabile dictu - took place in a girls' boarding-school, Honni\nsoit qui mal y pense.\nThere were only a handful of people at the start,\nbut today our family numbers two hundred and thirty.\nIn the beginning our voice was directed primarily to\nour own compatriots in the various parts of the world, but\nvery soon our task took on its international aspect. We start¬\ned broadcasting in Indonesian on May 1st 1946, and the English\nSection was set up in Eebruary of the following year. Then\ncame the Spanish, Afrikaans and Arabic Sections.\nSince our new transmitters were put into operation\nwe have been able to air two different programmes simultaneous¬\nly; one in Dutch and the other in one of the five foreign\nlanguages used on our direct transmissions. This year, for"
}