{
  "id": "d890-104",
  "text": "- 3 -\nLater we were able to read in the press that our\nbroadcast message had had immediate effect. The Netherlander\nin the area were all evacuated as soon as the warning was\nreceived.\nOther reactions from the Congo tell us that, in\nprecarious situations like this, our news bulletins - and\nmore especially the international news items - are as import¬\nant, if not more so, than food and drink to people living in\nfar-off places. Here is an example from a letter written from\nStanleyville by Father van Dongen. I quotes\n\"There were days when we were only able to\nfollow the situation here through the news\nfrom the home-country. Our heartfelt thanks,\nRadio Nederland. Your services are priceless!\"\nAnd there are numerous letters from listeners in\nsuch threatened areas which speak the same language.\nBut happily it is not always under such dramatic\ncircumstances that our Butch listeners all over the world\nlisten to our voice. Very often it is just the family-tie\nthat is felt, the warm human feelings of those who are near in\nheart, but separated by oceans or continents. This call of the\nheart was answered by putting greetings programmes on the air.\nSome of these programmes reflect our aim of serving the ends\nof unity within the Kingdom....\n(FLASH GREETINGS)\nAs you have heard, these programmes also reflect the\npolyglot character of our Kingdom.\nBut then, Radio Nederland itself has that character¬\nistic. And this brings me to the International Service, which\nbeams its transmissions to the outside world in five languages\nin its task of projecting the Netherlands abroad.\nIn the first place it tries to project something of\nHolland's spiritual store. Among the divers spiritual,\nreligious and philosophical outlooks, the traditional urge\nfor freedom in the Butch has become, since tho days of Spinoza\nand Erasmus, a tendency towards greater tolerance and human¬\nitarian solidarity.\nIt was this spirit which inspired our English\nSection staff member Harry van Gelder when he covered the"
}