{
  "id": "d890-108",
  "text": "- 7 -\nsuccess and the veil of secrecy can today he lifted, I should\nlike for once to deviate from the general rule of not mention¬\ning names. The devotion to duty of some of our staff justifies\ntheir names being publicly, and with honour, linked with our\npermanent relay service.\nMay I then first heartily thank the Head of our\nCentral Programme Service, Mr. Acda, and the Head of our\nSpanish Section, Mr. De Mulder Bonello. It was these gentlemen\nwho laid the contacts in North and South America, and who used\nthe tapes they carried with them in their briefcases to\nstimulate interest for our plan.\nOn the home front Mr. Snijders, Head of our News\nService, toiled at the journalistic and organizational task of\nproducing a programme item with, for the time being, a\nfrequency of twice a week and a duration of a quarter of an\nhour. An item which had to be of the very highest possible\nstandard. In each programme foun correspondents in various\nEuropean capitals were to give their news and analysis of the\nnews. The whole had to be linked together and its presentation\nhold high the reputation which Radio Nederland has established\nin programme-technique. This could only be done by coupling a\nhigh journalistic standard with radio-genic production in such\na way that the listeners on the other side of the Atlantic\nwould look forward eagerly to our programmes.\nIn this of course the International Service, headed\nby Mr. van Eijndhoven, has played an important role. Both he\nand Mr. Snijders, as well as their staffs, deserve praise and\nacknowledgement for their untiring efforts. Binally my sincere\nthanks to Mr. Vastenhoud, who routed all the propagation\nproblems, as far as natural phenomena would allow him.\nPerhaps the best proof of the success of our plan is\nthe presence here today of Mr. William G-. Harley, President of\nthe National Association of Educational Broadcasters, and of\nSehor Hector Manuel Romero, Director of Public Relations of\nRadiodifusoras Asociadas of Mexico, who have taken the trouble\nof flying over the ocean for this present occasion.\nMy heartfelt thanks, Mr. Harley and Mr. Romero, for\nyour kindness to fly all the way to Holland to attend the"
}