{
  "id": "d890-48",
  "text": "\\\n% ♦\nNAE RAD IQ <'£& X*WO R&\n119 Gregory Hail\nUfebana* Illinois\nTo? All Network Members\nFroms Robert Underwood\nDates November 38 1961\nRas Announcement of_New Series\nThe KASB has concluded negotiations with Radio Nederland whereby Radio Nederland\nwill produce a weekly quarter-hour program entitled EUROPEAN REVIEW® The program\nwill be distributed weekly by the network beginning on November 15o\nThis Is not a ”press review*1’ program® Rather* It is a report on matters of\nImportance throughout Europe as reported by correspondents of Radio Nederland,\non assignment in various cities® The purpose of the series is to give American\naudiences an Idea of what is’going on in various European countries•\nAs such8 the programs will be timely* and stations are urged to place the programs\non the air as soon as possible0 For those able to do @o9 the programs will 'be\navailable on short wave at 2§15 p0m0 Eastern Standard Tim®* on Tuesdays and Fri¬\ndays; the frequencies are 17810 kcs® and 15445 kes® Stations having short wave\nequipment might very well prefer.to record the broadcasts for immediate broadcast\n1oca11yo Stations receiving the programs via this method should report this fact\nto the network® It is vital that we _haye~__ this Information,,\nThe network will distribute the weekly Tuesday broadcast on tape® (Standby shows\nwill be available should transmission be. faulty®) As mentioned aboveg, the programs\nwill be. mailed each Wednesday beginning November 15® Shipment will be made on\n600* reels of tape shipped individually; the. programs will not be included in the\nregular weekly shipments which often are delayed® The bo si: code will, be 62-1\nEUR® REV®\nWe are assigning a 62 code number to this series * and no bonus hour charge will\nbe made for programs #1 through #5, inclusive« Bonus hour charges will be applicable\nbeginning with program, #6 which starts the next quarter.\nStations wishing to receive programs #1-5 should complete and return the mtaebo©\norder form® The Torn must be In our hands by m later than November 14®\nRSU/dp\natto"
}