{
  "id": "d890-51",
  "text": "We now have a certain amount of experience with ’’European\nReview”, which is relayed via your transmitters hut we are\nconvinced that much can still he done on both sides to provide\nmore stability as far as reception is concerned. Prom our\npoint of view, this will involve improved antennas. In view\nof the ever-changing influences of season and sunspot activity\nit is highly desirable that steps be taken at your end too,\nnamely the provision of special receiving apparatus in order\nto get the very maximum from the broadcast.\nThe application of diversity reception, for example, will\nlargely eliminate the nuisance of fading. The use of beamed\nantennas will largely cut out interference from stations which\nget into your antenna from directions other than the azimuth\nfor Europe. Both these will improve the link and, consequently,\nthe quality of your relay.\nMuch of the advice in the ensuing paragraphs is probably\nsuperfluous as far as youy are concerned, however you will\nappreciate uour anxiety to leave no stone/to ensure that there\nare no shortcomings on our side. wccf\nEquipping the receiving end of a relay link can demand the\nutmost attention to detail, alternatively it can be done less\ncritically with the means at one’s disposal. If, for example,\nyou were to eonsider establishing a point-to-point system to\nlink you with the Netherlands, you would require equipment\nsuitable for space diversity reception. This, briefly, involves\ntwo independent receivers each tuned to the same frequency\nand each with its own antenna system. The antennas should be\nlocated several hundred yards from each other. An automatic\ndevice is employed which ensures that the strongest incoming\n/.to signal is constantly fed (the loudspeaker. You will realise\nthat a system of this type affords considerable compensation\nfor fading. The antennas can be professional-type rhombics or\nfolded dipoles. Both these are highly directional and have a\nvery favourable effect on the signal-to-noise ratio. Should\nyou consider anything of this nature for your station, we\nwould recommend you to get in touch with Collins, Hammarlund\nor R.C.A. whose knowledge of the American market will enable\nthem to make detailed suggestions and, at the same time,\nprovide the services of local experts to survey your particular\nproblem.\nA system such as we have just described is extensive and\neonsequently costly. Should this be beyond your means, the\nrequirements will have to be made a little less critical and,\nfor example, a high-quality amateur communications receiver\nemployed. Such a receiver should, in any case, afford coverage\nof 6 to 22 magacycles and be used in conjunction with a good\nantenna. Receiver features which can serve to offset the\neffects of interference or bad propagation conditions are:\nan R.P, amplifier, switchable Selectivity, bandspread tuning,\nantenna trimmer, facilities for switching to higher or lower\nsideband, connection for symmetrical antenna, and regulated AVC.\nReceivers offering these facilities cost between $ 250 and\n$ 450 and examples are the National NC-303 ($450), the\n- 2 -"
}