{
  "id": "d890-55",
  "text": "A glance back\nThe law rules that the names and particulars of each new member\nof the human race born on Dutch soil shall be entered at the\nRegistry Office.\nThe birth of Radio Nederland, not being subject to any such\nlaw, was not registered in writing but was sent echoing across\nthe world in sound. A Dutchman in far-away Bandung, Java,\nsearching the wave-bands on the night of March 11th 1927, picked\nup a programme of music from an unknown station. Later the\nstation identified itself as Eindhoven in Holland. For the first\ntime in the history of broadcasting a distance of eight thousand\nmiles had been bridged.\nIt was an experimental station operated by Philips, and using\nthe call sign PCJ. One of the first announcers to build up the\npopularity of the pioneer short-wave station was polyglot Edward\nStartz, who still, Sunday by Sunday, but now as a staff member\nof Radio Nederland, conducts his Happy Station show.\nSo that night of March 11th 1927 must be regarded as the technical\nnativity of Radio Nederland. And although the birth of the new\nmember of the broadcasting family was not officially registered,\nit nevertheless made headline news, for the experimental short¬\nwave link-up between Holland and the then Dutch East Indies\nwas a scoop of world-wide importance.\nIn 1934 the Dutch short-wave activities were co-ordinated in an\norganization known as PHOHI (Philips Omroep Holland /ndie,\nor, freely translated, Philips Holland-Indies Broadcasting Service).\nShortly afterwards programmes were also beamed to other areas\nin Southeast Asia, and to Central America. The second world\nwar put an end to these activities, and the PHOHI transmitter\nwas dismantled as a military precaution. But very soon BBC\nhospitality made it possible for the Dutch radio people in London\nto broadcast two quarter-of-an-hour programmes daily.\nRadio Oranje, as the Dutch station-in-exile was called, continued\nits existence for some time after the war. Holland’s liberation in\nMay 1945 did not mean that short-wave transmissions could be\nresumed at once. The Nazi occupiers had demolished much of\nthe transmitting and other technical apparatus used in Holland\nduring their stay, and it took several months before everything\nwas in place again.\n3"
}