{
  "id": "d890-57",
  "text": "The conviction that world-wide radio broadcasting was a must\nfor Holland had taken root before the war, and the years in\nLondon strengthened this view. And so on October 13th 1945\nher voice was heard again on short-wave. In point of fact that\nvoice was never silenced, for there was no intermission between\nthe activities of Radio Oranje in wartime and the post-war\nactivities of Radio Nederland.\nThus it was that on October 13th 1945, eigtheen years after its\ntechnical debut, the Voice of the Netherlands was officially entered\nin the registers of world broadcasting. The call sign remained\nPCJ, and the wave-lengths used were, alternately, 19.71 and 31.28\nmetres. Overseas broadcasting was at that time part of the task of\nan organization known as “Radio Herrijzend Nederland”, the word\n“Herrijzend” being predictive of the phoenix-like recovery of the\ncountry from the ravages of war. This organization was first heard\non the air on October 3rd 1944, the transmission, significantly\nenough, being beamed from Eindhoven, one of the first Dutch\ntowns to be liberated by the advancing allied forces.\nA start was made by putting three daily transmissions on the\nair, each lasting an hour and a half. They were in the Dutch\nlanguage, and were beamed in different directions. After a few\nmonths two other transmitters were taken into operation, be it\nthat they were less powerful than PCJ. This made it possible\nto broadcast in other languages as well as Dutch, and trans¬\nmissions in Indonesian followed on May 1st 1946. English-language\nprogrammes went on the air on February 4th 1947, and a Spanish\nservice was introduced on September 8th of the same year. Finally,\non November 1st 1949, transmissions in Afrikaans and Arabic\nwere added.\nDuring this time structural changes took place. On January 19th\n1946 a new Foundation made its appearance (“Stichting Radio\nNederland in den Overgangstijd” - a body set up for a transitional\nperiod only), which took over the short-wave service from “Radio\nHerrijzend Nederland”. The short-wave service then became a\nseparate entity, and on April 15th 1947 it was absorbed into a\nFoundation which from that time on has been known as “Stich¬\nting Radio Nederland Wereldomroep”. The English equivalent\nof this, Radio Nederland’s full name, is “Radio Nederland World\nBroadcasting Foundation”.\nThe man who shaped the character of Radio Nederland was its\nThe rotating antenna\nused by PCJ in the past\n5"
}