{
  "id": "d890-63",
  "text": "many which reach us. The establishing of these contacts is not\nregarded by Radio Nederland as constituting its main task, for\nthat, once again, consists of fostering goodwill for the Netherlands\nin the widest sense.\nTranscription programmes are yet another of Radio Nederland’s\nmeans of achieving its purpose. These programmes are recorded\nin Hilversum on disc or tape and supplied free of charge to\nforeign radio stations for local broadcasting. This has obvious\nadvantages, but their real merit lies in the fact that they can be\nproduced in many more languages than the six which may be\nheard daily in the direct transmissions.\nGenerally speaking the transcription programmes are of a cultural\nnature, containing, as far as possible, a Dutch aspect. It is no\nexaggeration to say that the international reputation of the Amster¬\ndam Concertgebouw Orchestra has been greatly furthered by the\ntranscription programmes of Radio Nederland. The total number\nof these transcription programmes, covering a great variety of\nsubjects and made available in 37 languages, amounted in 1960\nto 28.436. They were sent to 122 different countries and territories.\nIn that same year the number of transcription programmes pro¬\nvided over the past 15 years passed the 200.000 mark.\nAgain in 1960, Radio Nederland entered the field of television-\ntranscription. The first telerecording was sent on August 30th to\nTele-Curacao, a station which had then been operating for a short\ntime. Thanks to a close collaboration with the Netherlands tele¬\nvision services and the Netherlands Foundation for Cultural Co¬\noperation with Surinam and the Netherlands Antilles (STICUSA),\nRadio Nederland now sends a weekly review, taken from the\nNetherlands Television Journal, across the Atlantic, sometimes\nsupplemented with recordings made specially for Curasao. A num¬\nber of full coverages, such as the opening of the States-General,\nand many other programmes of mainly cultural significance\n(theatre, ballet etc.) also found their way to Tele-Curacao. Besides\nthese activities a monthly 30-minute programme is also tele-\nrecorded, featuring people from the West Indian parts of the\nrealm, who are working or studying in the Netherlands.\nSelections taken by Radio Nederland from the Netherlands Tele¬\nvision journal are now also being sent to Venezuela.\nThis sketch of the aims and task of Radio Nederland cannot, of\ncourse, claim to be exhaustive. But is does give an idea of how\n1"
}