{
  "id": "d890-65",
  "text": "it is carrying out its assignment, which is one fully in keeping\nwith Dutch tradition. The Netherlands has always, and by\npreference, been active on an international level in its trade\ndealings, in shipping, in air-traffic, and in many other sectors.\nSo its place in world broadcasting belongs, in the opinion of this\norganization, in the same category; the more so when viewed in\nthe light of post-war development in the field of international\nrelations. And if, on the one hand, the need for international\nrepresentation has increased, it may, on the other hand, be truth¬\nfully said that no means of information, of the same potentiality\nand reach, requires so modest a financial outlay as does the\nmedium of radio.\nIn the wake of the sun\nThe Radio Nederland World Broadcasting Foundation (Stichting\nRadio Nederland Wereldomroep) was set up in 1947 by the\nMinister of Education, Arts and Sciences. The Board of the\nFoundation, whose members are appointed by the Minister, reflects\nthe foremost trends in the country’s religious and political life.\nNone of the members, however, acts as mandatary for any part¬\nicular group or party.\nA Programme Council, appointed by the Minister on the recom¬\nmendation of the Board, supervises the programme policy of\nRadio Nederland, the final responsibility resting with the Board.\nThe Council consists of a chairman and eleven members. There\nare also number of advisory committees which occupy themselves\nwith programmes of a more specialized character. At the moment\nthere are four of these committees, one each for the Arabic and\nAfrikaans transmissions, one for Protestant church services, and\nthe fourth for Protestant religious broadcasting in general. Broad¬\ncasts in the Roman Catholic sphere are conducted along the lines\nof an arrangement with the domestic Catholic radio station (KRO).\nRadio Nederland’s budget is financed from the license revenues\ncontributed by the owners of radio sets, the domestic broadcasting\nassociations deriving the major part of their income from the same\nsource. Regular contact and co-operation is maintained in an\natmosphere of cordiality between Radio Nederland and the\ndomestic services in both the programming and technical sectors.\nThe everyday activities of Radio Nederland are conducted under\n13\nThe Indonesian Section"
}