{
  "id": "d890-67",
  "text": "the guidance of the Director-General, or, in his absence, of the\nDeputy Director. The Director-General is directly responsible to\nthe Board. Six departments come under the province of the\nDirector-General, viz, the Central Programme Service, the News\nService, the Dutch Service, the International Service, the General\nServices and the Engineering Service.\nThe Central Programme Service comprises the Transcription\nDepartment, the Productions Department (which includes the\nstudio and Dutch announcing staffs), the Music Department, the\nProgramme Administration Department, and the Disc and Tape\nLibrary.\nThe “pulse” of the News Service is in the newsroom, where the\neditors work shifts in supplying news-bulletins, spotlights, press\nreviews, talks and other items for Radio Nederland’s non-stop\nbroadcasting schedule. All the material is compiled in Dutch,\nand is passed on to the translators who hand the foreign-language\nversions to the news readers and announcers. The News Service\nalso comprises the Spoken Word and Outside Coverage Depart¬\nment, the central point from which suggestions for reportages,\ntalks and the like are distributed to the various sections. This\ndepartment also has a co-ordinating function, which, in view of\nthe fact that many events are covered by more than one, and\nsometimes by all the foreign-language sections besides the Dutch\nService, ensures efficient organization. The department also\narranges appointments for interviews, etc. The News Service also\nhas under its wing a bureau in The Hague, which acts as a kind\nof internal press agency, collecting and supplying items drawn\nfrom parliamentary sources, government bodies and diplomatic\ncircles. Finally, the News Service maintains a Documentation\nDepartment, whose files are available to the editors and reporters,\nand others requiring factual information on events past and\npresent.\nThe Dutch Service also comprises the West Indies Section and\nthe so-called “Greetings Department” which records family greet¬\nings and provides programmes for Dutch seafarers and other\nscattered Dutch audiences. The Dutch Service takes care of all\nprogrammes in the Dutch language.\nThe International Service is made up of the English, Spanish,\nIndonesian, Arabic and Afrikaans Sections. It is here that one\nmeets the Radio Nederland staff members whose native tongues\n15\nThe newsroom"
}