{
  "id": "d890-69",
  "text": "are those of the countries to which they broadcast, and who possess\nthe nationality of a country where those languages are used. The\nEnglish Section, for instance, employs British, American and\nCanadian nationals. Likewise, the Arabic Section draws its staff\nmembers from the various parts of the Arab world. Here in the\nInternational Service one might imagine oneself in the lobbies\nof the United Nations. In this connection it will be readily under¬\nstood that the Happy Station, conducted by short-wave pioneer\nEdward Startz, also forms part of the International Service. The\nmembers of the various foreign-language Sections are, of course,\nfully acquainted with the customs and habits of the peoples\nto whom the transmissions are beamed. They are therefore\nqualified to suit their programmes to the different audience\nrequirements, whilst their stay in the Netherlands provides them\nwith the knowledge they need to reflect all the many facets of\nDutch life in their work.\nContact with the listeners is maintained by correspondence as\nwell as at the microphone, resulting in such programmes als “By\nRequest”, a weekly selection of gramophone records of the\nlisteners’ own choosing, and “Letterbox”, in which listeners’\nquestions about Holland and the Dutch way of life are\nanswered on the air. The English and Spanish Sections put\non special programmes for seafarers, establishing ties of friend¬\nship between the ships and the shore. Expert opinion and in¬\nformation is supplied in interview form and in round-table\ndiscussions. In short, the International Service employs every\navailable means in radio to project the Netherlands abroad in\nthe languages of its world-wide audiences. The various Sections\nof the Dutch and International Services handle their own mail\nbringing the reactions to their programmes from all quarters of\nthe earth. More than 40.000 letters are received annually.\nThe Engineering Service comprises besides studio servicing and\nrelated departments, a bureau which is peculiar to short-wave\nbroadcasting, namely the Propagation Department. One of its tasks\nis to study propagation conditions. It establishes the most suitable\nwave-lengths for each transmission, and checks the results by means\nof the incoming mail, reception reports and tape recordings of\ntransmissions, supplied by listeners and monitors. There are also\nmany useful contacts with foreign radio stations, with which an\nexchange of reception data is maintained.\n17\nDetail of distributing panel"
}