{
  "id": "d890-71",
  "text": "Propagation conditions vary with the changing position of the\nsun, and so differ in each season, and from hour to hour. In view\nof the many transmissions this necessitates a great variety in the\navailable wave-lengths. Solar activity, which fluctuates between\nits minimum and maximum in an eleven-year cycle, is again a\nsource of influence on the choice of the wave-lengths. Yet another\nfactor in recent years is the overcrowding of the short-wave bands,\nwhich has greatly increased the chance of mutual interference, so\nthat here again a change of wave-lengths may be desirable. On\nthe other hand the listener is best benefited by as great a measure\nof constancy as possible. For this reason too many changes must\nbe avoided. Finding the best solutions to all these problems is\none of the main tasks of the Propagation Department.\nIt goes without saying that collaboration and co-ordination are\nindispensable in the devising and creating of radio programmes.\nThis can best be demonstrated by giving an example of how a\nreportage is planned and realized. Let us suppose the editors in\nthe newsroom have received word that a start will be made in a\nfew weeks’ time on an important hydraulical engineering project\nin the Delta area (the scene of the great flood disaster in February\n1953). The news is passed on to the Spoken Word and Outside\nCoverage Department, which contacts the Programme Administra¬\ntion Department to arrange for the necessary equipment. This\nmay consist of one or more mobile recording units and portable\nrecording apparatuses. A special telephone connection will also\nhave to be established between Hilversum and the Delta area,\nfor feeding back the coverages to the studios for transmission.\nDetails of the proposed reportage are then sent to the Dutch and\nforeign-language sections, and to the Transcription Department.\nThe Section Heads consider whether the subject is suitable for their\ntransmissions, and if so, when and in what form it can best be\npresented. They return their findings, via the Programme Ad¬\nministration Department, to the Spoken Word and Outside\nCoverage Department, which is now informed as to how many\nreporters from the various sections will be covering the event.\nThe time has now arrived to take up the matter with the Delta\nengineers, and this is done either by telephone or by sending\nsomeone to prepare the reportage in person. The information\nand details thus acquired are stencilled and handed to the\nreporters.\n19\n“Studio Square”"
}