{
  "id": "d890-73",
  "text": "Now comes the day of the event. The recording van — a modern\nmobile studio — takes the road, with the engineer and the chef\nd’equipe on board. The reporters follow in a separate vehicle.\nWhen all have arrived on the spot, the Dutch and foreign report¬\ners, who have already been partly briefed, view the project in\nhand and talk with the experts. They are now fully informed\nand can start preparing their own creative work, — that of\nreporting on an important event in the Netherlands. Each of them\nhas his (or her) own approach. Each of them knows where his\ncoverage will be heard, and what will most interest his audience.\nEach reporter will go about it in his own way. An Arab reporter\nwill tell the story of how Holland fights back at the sea in quite\na different way to that in which a Spaniard or an Englishman\nwill tell it.\nWhen the job has been done, and assuming that not all the\nrecorded material has been fed back to the studio for immediate\ntransmission, the reporters drive back to Hilversum where, either\nthe same day or later, they play back and edit their tapes contain¬\ning their interviews, narration and sound-recordings, do any\nscripting which may be necessary, and then the cuts are made and\nthe programme is pieced together for the final studio recording.\nIn the case of a coverage being required for direct transmission,\nall these operations have to be done on the spot, using the equip¬\nment of the mobile recording unit.\nThis was but one example illustrative of the many and varied\nactivities which make up Radio Nederland’s task. A random\nexample of how the Netherlands is projected abroad. Day after\nday the reporters travel about, collecting material for their desk¬\nbound colleagues in Hilversum to fit into the many transmissions.\nThe transmissions themselves are timed as far as possible to\ncoincide with evening listening in the areas to which they are\nbeamed. In other words Radio Nederland’s transmissions go round\nthe earth in the wake of the sun. In the early morning hours in\nHolland programmes are broadcast to Australia, New Zealand\nand the Pacific area. As the day progresses here, the areas where\nour broadcasts are picked up come geographically closer; in the\nafternoon Southeast Asia is the target, in the early evening Europe\nand Africa. As night falls over Holland our western reception\nareas lie farther afield. Then follow Latin-America, Central\nAmerica and North America, and when, in the small hours, our\n22\nCurtain antei"
}