{
  "id": "d890-78",
  "text": "Out there in the open country, where the towering masts of the\ndomestic radio and television services are also set up, lies the\n150-acre site of Radio Nederland’s transmitter station and antenna\narray. The transmitters, like all broadcasting and TV transmitters\nin the Netherlands, are the property of a private company, called\nNozema N.V., in which the four big home services, AVRO, KRO,\nNCRV and VARA participate, together with the State of the\nNetherlands. The transmitter complex is also administered by\nthis company. It was designed and installed under the supervision\nof the Postal and Telegraph Service, which also operates and\nmaintains it.\nThe modern, spacious and airy station-building, a creation of the\narchitects Merkelbach and Elling, stands in the centre of the\nsite. In the hall inside there are three 100 kilowatt transmitters\nand one of 50 kilowatts. Two of the 100 kilowatt transmitters\nwere made by Philips, the third by Brown-Boveri of Switzerland.\nAll three are air-cooled. The 50 kilowatt transmitter, also made\nby Philips, has water-cooling. A fifth Radio Nederland transmitter\nis housed in a space to the side of the large hall. This is the\n10 kilowatt Philips transmitter used for broadcasting to Europe.\nThe ground outside is a veritable maze of pale-fences, with, here\nand there, a number of small, high structures, — the so-called\nswitch-huts. The pale-fences consist of wooden and steel masts,\nthe tallest of which are more than 250 feet in height. They are\nconnected by an enormous array of wires, giving the whole a\ncobweb-like appearance. These are the curtain and rhombic\nantennas, with which the four most powerful transmitters can be\nconnected. It is by means of these transmitters and antenna sys¬\ntems, and with the aid of short radio waves, that Radio Neder¬\nland’s programmes are broadcast and beamed to the different\nreception areas.\nIt would take us too far to even briefly explain what goes on\nat the transmitter station, with its bewildering array of wires,\nknobs, switches, lamps and measuring instruments. Let it suffice\nto say that Radio Nederland broadcasts on short radio waves\nbecause these are pre-eminently suited for carrying radio signals\nover great distances.\nUse is made of the ionized region of the upper atmosphere — the\nso-called ionosphere — which is located at about 200 miles above\nthe earth’s surface. The ionosphere is formed and maintained\n27\nTransmitter hall"
}