{
  "id": "d890-79",
  "text": "by the ultraviolet rays emitted by the sun. This means that the\ndegree of ionization and capability of reflecting certain radio\nwaves depends upon the position of the sun with regard to the\nearth. The propagation of the short radio waves is effected by\nbouncing them, as it were, against the ionized layer. The waves\nare then reflected back to earth, from whence they rebound to\nthe ionopshere in a kind of bat and ball sequence. Each “bounce”\ntakes them a distance of about 2500 miles, so for the waves to\nreach, say, Australia, about four are needed.\nIn order to realize the crowded schedule Radio Nederland must\nalso be able to transmit more than one programme simultaneously,\nfor instance a programme in Dutch and another in Spanish. This\nis made possible by manipulating the intricate transmitter and\nantenna systems. In this way one or more radio programmes on\none or more wave-lengths can be beamed to one or more reception\nareas. Beaming is done by means of the curtain and rhombic\nantennas. The curtain antennas are easily recognizable, for they\nare suspended between the tallest (250 foot) masts. Those of the\nrhombic antennas are much lower, being about 120 and 75 feet.\nThe curtain antennas can only beam one wave-length, but they\npossess great adaptability for choosing the beam-direction. The\nrhombic antennas are just the reverse. These can be used for more\nthan one wave-length, but their beam-direction is fixed. All these\ndifferent antennas are in turn connected up with the transmitters\nin the station-builing. This is done at the operating-desk, which\nin many ways resembles an organ-console. The adjusting of the\nwave-length and the selecting of the antenna is done in a matter of\na few minutes by pressing a button, though in an emergency it\ncan be done by hand. Not only are the antennas connected up at\nthe switch-desk, but the beam-direction is also selected from that\npoint. The wave-lengths on which Radio Nederland operates are\nin the 13, 16, 19, 25, 31 and 49 metre-bands. The frequencies lie\nbetween 5900 and 22000 kilocycles (1 kilocycle — 1000 alternations\nper second). The wave-lengths belong to a series allocated to Radio\nNederland by international agreement.\nA final word about our smallest transmitter. This 10 kilowatt\ntransmitter is used for broadcasting to Europe, and so it is not\nnecessary to spread its energy over the entire globe. It is there¬\nfore never, as with the other transmitters, connected with the\ncurtain and rhombic antennas, which enable the transmissions\n28\nAirconditioning plant"
}