{
  "id": "d890-84",
  "text": "each other, Radio Nederland’s staff worked for almost sixteen\nyears. Garages and attics were turned into studios, cellars became\nplay-back cells, and former bedrooms offices. Mantelpieces served\nas bookshelves, and a balcony was covered over to house the\nteleprinters. The inventiveness of the Accommodation and House\nService became legendary, and the pioneering work of the En¬\ngineering Service was without parallel.\nInside the buildings there were alterations without number, and\nthere was no end to the moving and shifting about, for the\ndecentralization and continuous growth of the organization were\nenemies which made any static or permanent arrangement im¬\npossible. And so, by inching and pinching and utilizing every bit\nof available space, Radio Nederland steered its course throughout\nthe pioneer period.\nIt was not difficult for the 225 staff members to turn their backs\non their makeshift quarters, when the time came to do so, though\nthe older ones, who served through the first years of the station s\nexistence, will retain nostalgic memories. For pioneering and\ncreating in difficult circumstances and imperfect surroundings\nhave their aspects of improvisation, of being one with the family,\nof give-and-take. But all of them, old and young, had looked for¬\nward for so long to the spaciousness and light and promise of their\nnew domain, inviting in its imposing, but slender proportions, and\nwith its modern facilities, that in August 1961 they entered it\ngladly and expectantly.\nRadio Nederland’s studio building, now no longer a dream but\nsolid reality, lies on the fringe of Hilversum. Viewed from\nthe air it looks itself very much like an aircraft, with its\nnose pointing south. The architects, Messrs Van den Broek &\nBakema of Rotterdam, used a special method of construction, the\nentire building being erected around 68 square pillars of rein¬\nforced concrete, each measuring some five feet around the four\nsides, and resting, deep under the ground, on a three-foot thick\nconcrete platform. Throughout the building there is no spot\nwhere these pillars, looking like strong, silent watchmen, are not\npresent. Rising from their concrete base straight through to the\nflat roof, and set at right angles to each other, the double colon¬\nnades give support to the entire structure.\nIn describing the building it will best serve to retain the image\nof an aircraft. An enormous aircraft, for the wing-span and the\n33\nThe entrance hall"
}