{
  "id": "d890-94",
  "text": "A lot depends on your aerial...\nThe aim of this booklet is to show you just how necessary a good aerial\nis for the reception of programmes from distant stations. The signals sent\nout by stations far away from you are spread over a very large area and\nthus only a relatively small part of them finds its way to your particular\nlocality.\nThere is also the possibility that the signals may be weakened in the\natmosphere or that a local source of interference may exist. Both these\nfactors mean that you will only be able to obtain satisfactory reception\nby the use of an aerial having the maximum sensitivity for the signal\nwhich you want to receive, and which is also capable of cutting out as\nmuch as possible of the interference. The erection of such an aerial is\nnot the simplest of tasks. A certain amount of knowledge of the subject\nis needed if the results are to be satisfactory. That is the reason why we\nhave prepared this booklet.\nGeneral requirements for an aerial\nGood insulation from earth\nIn radio technology, the word “earth” is used in its broadest sense.\nTrees, bushes and even houses are “earth”, particularly in wet weather.\nA waterpipe makes an excellent earth, because the supply pipes often lie\nin water under the soil.\nA good insulation from earth, therefore, means keeping the aerial as\nfar away as possible from trees, gutters etc. When lashing the ends of an\naerial to a tree, chimneystack, etc., they must be isolated by means of\nceramic, glass or plastic insulators.\nMaterial\nBecause the aerial has to remain in the open air, it is subject to corrosion.\nThe effect of high winds also plays a role in the selection of the most\nsuitable material. Naturally, only wire having a high conductivity should\nbe used. Practice has shown that silicon-bronze wire fulfills the require¬\nment adequately, but there are several other copper alloys which are\nsuitable for the purpose. The ordinary soft copper wire should not be\nused, as it will almost certainly break in a high wind.\nStranded copper wire (Litz wire) can also be used, as well as ordinary\ninsulated domestic wire. The insulation does not have any unfavour¬\nable influence on reception and, in addition, protects the wire from\nweather influences. So don’t remove it!\nMatching the aerial to your Receiver\nOwing to the considerable technical differences in radio receivers, it is\nnot possible to give a general rule for matching. However, in most\nEuropean sets, the aerial input impedance is 300 ohms. It is obvious that\nmaximum results will be obtained by using an aerial of the same impe¬\ndance, as the loss of signals will then be limited to a minimum. Further\nreference is made to this under the next heading.\nHeight.\nAn aerial should be erected as high as circumstances permit. The greater\nthe height the stronger is the incoming signal and the weaker is the factor\nof interference from such sources as ignition systems, refrigerators and\n2"
}