{
  "id": "d890-95",
  "text": "so on. The height of the aerial is always measured down to the near¬\nest “earth”. Consequently, an aerial set up at a height of 20 feet over an\nopen garden or between two houses usually gives better results than a\nwire just a few feet over the roof.\nThe lead-in\nThe lead-in to the receiver must be well insulated, and its length\nmust be kept to a minimum. It should not be laid less than 4 inches (10\ncentimetres) from any electrical supply cable. The plug used at the\npoint of connection to the receiver must make good contact with the\naerial input socket. If your receiver is fitted with separate sockets for an\nFM (VHF) aerial, consult the instruction book regarding the connection\nof an external aerial. In the absence of any specific information, the trial\nand error method must be used.\nVarious types of aerial\nNot everyone possesses facilities for the erection of an “ideal” aerial.\nSo we have chosen a number of types which will give the best results\nunder various conditions.\nThe folded dipole (see fig. 1)\nThis type is best suited to “beamed” transmissions, which most short¬\nwave stations employ. The folded dipole has directional sensitivity, that\nis to say it must be erected to face the direction from where the signal\ncomes. By adhering to the correct dimensions when building the aerial,\nthis type will assume higher sensitivity for a given waveband. As you\ncan see from the sketch, a twin lead-in runs from the central insulator of\nthe aerial to the receiver. The two feeds are connected respectively\nto the aerial and earth sockets of the receiver. There is no fixed length for\nthis lead-in. Construction details of the aerial itself (the horizontal part)\nare given on page 5.\nFor simplicity, we recommend that the folded dipole and the twin lead-in\nbe made from one length of cable. The distance between the horizontal\nwires should not be more than 4 inches (10 centimetres). In the case of\nthe lead-in, this distance is more critical and depends to some extent\nupon the gauge of wire used. In the case of receivers having a 300 ohm\ninput, the distance between the parallel feeds of the (vertical) lead-in\nshould be six to ten times the diameter of the wire used.\nIn both the folded dipole and the lead-in, the wires should be spaced\nby insulators as shown in fig. 1. Strips of plastic material are quite suit¬\nable for the purpose and these should be provided with holes for the wires\nto pass through. Spacers can also be made in a simple way from short\npieces of good quality plastic garden hose. It is quite easy to make holes\nin this for the wires.\nIf you should happen to have any 300 ohm twin cable, as used with TV,\nthis can be used for the dipole. However, this demands some skill in\nmaking the connections at the ends and in splitting the lower feed in the\ncentre for the insertion of the lead-in. Similarly, 300 ohm twin cable may\nbe used to make the lead-in itself, whilst the dipole is made from other\ncable with spacing insulators.\nWe have already mentioned directional sensitivity. For the best reception\nof shortwave broadcasts from Radio Nederland, your aerial should be\nerected as follows:\n3"
}