{
  "id": "d416-145",
  "text": "NAEB HEADQUARTERS\n14 Gregory Hall\nUrbana, Illinois\nTCh NAEBer, School Stations\nFROM: Frank E* Schooley\nDATES August 3, 1955\nHE? NAEB Radio Network service fees\nMany of you asked for the Board to consider revision of service fees\ncharged school stations for the NAEB Radio Network services* In turn,\nJohn Henderson3s School Acceptance Sub-Committee of the Radio Network\nCommittee made a study and recommendation which would have eased the\npressure somewhat* I8m grateful to John and his Committee, but in\nstudying the proposal saw some loopholes, which might have meant oper¬\nations of the Network at a loss* I mention this as tribute to John8 s\nCommittee for its willingness to work in an area in which it had not\nbeen charged with responsibility* When I say IBm grateful, I sincerely\nmean it*\nThis led to a further study and consideration by Skomia, Hill, and\nSchooley* We came up with an alternative proposal, and we believe it\ncan be made to work (l) to benefit of all school stations and (2) still\nmaintain income from school stations to meet costs*\nWill you give it your thoughtful consideration, and then let me know\nyour reactionso If you - that8s most of you - think it is a reasonable\nsolutions we811 /get it approved by the Board/, and we811 make it\neffective this year* If you8 ve already paid this year, we811 give you\na credit or refund, whichever you elect* Her© is the proposal, in\nstream-lined versions\nThat.school-owned-operated stations, wishing In-School Program Service\nof NAEB Radio Network, be permitted to pay rate one-half that paid by\nthose receiving regular (full) network service except In-School*\nFor this payment. School Stations will receive In-School programs,\nplus option to receive ono-hour additional programs per week selected\nfrom regular Network Service*\nThe School Station shall also have the option of paying full rate and\nreceive full service*\nThe Board has already considered this informally, and unanimously agrees\nthat we should try the proposal* But the Board has not formally voted,\npending word from members using the School Service on School Stations*\nThis will not apply to school programs used by College or University\nstations* Now, what do you think?\nFES: jy"
}