{
  "id": "d416-159",
  "text": "REPORT OF THE ASSISTANT NETWORK MANAGER FOR TRAFFIC\nOctober 1, 1955\nIn March, 1955 Miss Rosaline Biason, who had occupied the position of Network\nTraffic Manager since the start of the NAEB Radio Network, resigned to take an\noverseas governmental job. Her replacement was Mrs, Janet Strandjord who has\nassumed the Traffic responsibilities as well as editorship of the Newsletter and\nmiscellaneous other duties.\nRoutine duties performed by Mrs, Strandjord include:\n1. Handling all traffic matters relating to the Network,\n2. Editing the Newsletter.\n3. Handling all billings for the Network Assessment Fees and other miscella¬\nneous items.\n4. Maintaining membership and network data files.\n5. Issuing NAEB Membership Directory.\n6. Processing membership applications.\n7. Processing membership certificates and those for scholarship winners,\nworkshop participants, etc.\n8. Handling records in connection with NAEB album sales.\n9. Handling routine correspondence.\nCertain improvements made during the past year should be pointed out:\n1. Upon recommendation of the NAEB Public Relations Policy Committee, and in\nconsultation with the Executive Director and the Associate Director,\ndepartmentalization of the Newsletter has been accomplished, with more\neditorial judgment of suitable material being exercised. The new cover\nand new type-face have added to the attractiveness of the Newsletter.\n2. The NAEB Membership Directory has been changed in format somewhat for\neasier reference and will hereafter be published semi-annually rather\nthan annually.\n3. A new card file system has been instituted which makes more complete and\nup-to-the-minute information readily available about NAEB members, former\nmembers, applicants for membership, Network members and non-member\neducational stations.\n4. An improved system for processing album orders has been instituted which\nshould increase efficiency and practically eliminate cause for complaint.\nRespectfully submitted by:\nJanet Strandjord\nAssistant Network Mgr. - Traffic\n10/13/55"
}