{
  "id": "d416-175",
  "text": "Dear NAEBer:\nYou are going to have some outstanding visitors on your campus during the next few\nmonths, courtesy of NAEB.\nPerry Miller, professor of American literature at Harvard, is touring with his\ntravelling players to present a lively series of plays and discourses. The Pres¬\nident of the University of the Philippines, Dr. Vidal Tan, will be a special guest\non your campus to give a dramatic account of the greatest hero of his nation. Five\nprofessors of the Millikin School of Music will present a new facet in the appre¬\nciation of fine music. And the Rt. Hon. Harold Macmillan, Great Britain*s Secre¬\ntary of State for Foreign Affairs is coming to your school to give a lecture titled,\n’’From a Window in Whitehall.”\nSuch a parade of notables deserves a large splash in your local news media. Stories\nabout their impending arrival make good publicity for the school and for the commu¬\nnity. But let*s assume you are pretty hep as to what’s going on at your school,\nand you’re positive you haven’t heard a peep about these coming visitations. You\nare therefore about to conclude that:\n(a) These people are not coming to your school, or\n(b) Somebody goofed.\nWow look into your wastebasket.\nOver the past few weeks NAEB has sent you detailed reports on the arrival of these\ndignitaries. Miller will be your guest lecturer for thirteen weeks on the series,\n\"They Bent Our Ear.\" President Tan will appear on \"Tales of the Valiant.\" The\nMillikin professors are on \"Music in the Making,\" and Secretary Macmillan will ap¬\npear with \"Window on the World.\"\nThis information was given to you in brochures and suggested news releases. It\nwas distributed in advance, exclusively to NAEB members, so you would have time to\nmake use of it in whatever manner best suited your purpose.\nIf this material wound up in your wastebasket instead of in the columns of your local\nnewspapers, you have missed an excellent chance for publicity. And as your old\nDutch uncle would tell you, \"Don’t come crying to the next NAEB meeting about how\nimpossible it is to find publicity stories.\"\nBut, seriously, if you have sidestepped the chance to publicize these programs,\nperhaps it is not too late. Most of the series will be distributed in April and\nMay.\n-over-"
}