{
  "id": "d416-19",
  "text": "-2-\nQuarter-hour and half-hour programs are by far the most popular; three-quarter-\nhour programs are the least popular. To the question: ’’How many programs of\neach length would you ideally receive in a weekly shipment of 8 hours of material\nfrom Network HQ (For example, 4 quarter-hour programs, 8 half-hour programs, and\n3 one-hour programs might make an ideal shipment of 8 hours of material.) Twenty-\neight stations replied, and the answers varied greatly. Probably the largest\nsingle group liked the proportion given as an example. However, the answers\naveraged out 9.0 quarter-hour programs, 7.7 half-hours, and 1.9 one-hours♦ That\nis, to round off the figures, the answers averaged out 8 or more quarter-hours,\n8 or fewer half-hours, and 2 one-hours.\nA number of stations made it quite clear that to them the most important\ndimension of a program is not a time-length, but the quality. Nevertheless, other\nthings being equal, many more quarter-hour programs than we have been able to offer\non the Network should be found.\n10 stations {18.5%) can use, 6 (11.1$) cannot use, and 36 (66.6$) can but pre¬\nfer not to use series in which the program lengths are not standard but are regular.\n(For instance, a series of programs each 22 minutes long.)\n30 stations (55.5^0 prefer that most series consist of 13 programs. To 12\n(22.2$) the number of programs in a series ’’makes no difference.” 18 (33.3$) are in\nfavor of some ”short series” (4 to 7 programs), 12 (22.2$) are not in favor of short\nseries, and to 22 (40.7$) the question of short series makes no difference.\n20 (37$) do and 8 (14.8$) do not care for series that run more than 13 programs.\nTo 24 (44.4$) the question makes no difference.\n22 stations (40.7$) use ”one-shot” programs occasionally, 18 (33.3$) use them\noften, and 11 (20.4$) use them seldom. To 27 stations (50$) the lengths of ’’one-\nshots” offered make no difference. 11 (20.4$) prefer quarter-hour and 8 (14.8$)\nprefer half-hour ’’single-shots”. 31 (57.4$) prefer that each one-shot be offered\nand sent out individually, 12 (22.2$) prefer that, when possible, one-shots be\ngrouped together and sent out as ’’pot-pourri” series, and to 8 (14.8/*) it makes no\ndifference."
}