{
  "id": "d504-17",
  "text": "- 2 -\nall new ideas for changing and improving this series and also to the\nstudy of possible changes in the 1972 regulations, such changes, of\ncourse, to be submitted for approval to the Radio Programme Committee.\nFinally the Jury met to elect the chairman of the next ’Let\nthe Peoplej Ping'*.\n1. Examination_of_\"Let_the_Peoples_Sing 197l\"_and_New_Ideas\nEach delegate had prepared several written suggestions in\nadvance of the meeting, for subsequent discussion. These suggestions\ncame principally under three points :-\na) A new system for the annotation of candidates, presented\nby Mr. Little (CBC);\nb) Modification of the duration of programmes recorded for\nthe competition suggested by Mr. Sebastyen (Magyar Radio);\nThese two propositions were, however, not adopted.\nc) A definition of contemporary music and the need for its\ninsertion into this series proposed by Messrs. Beardsall(BBC),\nLittle (CBC), Addlis (BBC), Vaskola (YLE), Dood (BBC),\nSebastyen (Magyar Radio), Goslich (ARD-BR), and Lange (WRK).\nAll the above propositions were the object of lively discussion\ntaking into account the fact that contemporary music does not always\nhave the desired impact in choral formations, and if it were made com¬\npulsory for candidates when setting up their programmes, this might\ndiscourage the participation of choirs that are more at ease with\nromantic or baroque music. Taking into account also the fact that one\nof the purposes of radio is to give the public as complete an idea as\npossible of contemporary musical trends, the group considered it desi¬\nrable to introduce into the \"Let The Peoples Sing 1971M programme a\npiece of contemporary music as an optional item. According to the\nresults this would give, the idea could be repeated the following year\nor could be modified in form.\nAn amendment to the regulations in respect of this proposal will\nbe submitted for the approval of the Radio Programme Committee. The\nexamination of the progress of the competition brought into evidence\nnot only the quality of the choirs and their high musical standard but\nalso the efficient co-ordination of the BBC and its perfect organization\nof the event. In the matter of organization, Mr. Rayvern Allen (BBC)"
}