{
  "id": "d504-23",
  "text": "- 3 -\nITEM 5 (e) contd.\nThis first test could even take place during the violin¬\nmaking competition, as candidates would play their own\ninstruments at this stage and would not need to have\npractised on the winning violin. Then for the semi-final\nthe 5 or 6 selected candidates would be required to per¬\nform 2 pieces from a list previously drawn up. One of these\npieces would be played on the candidate's own violin and\nthe other on the prize-winning violin. In this connection\nit should be noted that it would be absolutely essential\nthat candidates have a sufficient number of hours in which\nto become familiarized with the winning violin as this is,\ngenerally speaking, a rather difficult thing for violinists.\nHowever, the adjudication of the semi-final should be based\nprincipally on the performances given by the candidates on\ntheir own instruments rather than on the winning violin.\n3. Two violinists would remain at the conclusion of this semi¬\nfinal - as was the case in the Beethoven competition.\nThese two violinists would then have a few days at their\ndisposal in which to familiarize themselves with the\nwinning violin. Each violinist would give a complete re¬\ncital on the winning instrument and might play, for instance,\nan unaccompanied partita by Bach, a '‘Caprice\" by Paganini\nfor solo violin, one of the Beethoven sonatas for piano and\nviolin and a piece set for all candidates appearing in the\ngeneral programme for the competition. The two finalists\nmight possible play the same programme, though this would\nlessen the artistic interest.\nAs in Brussels, the winner would be presented with a sum\nof money, together with the prize violin and a number of\nengagements offered by participating radio organizations.\nThe second finalist would also be offered certain engage¬\nments, plus a smaller sum of money. Further, the semi¬\nfinalists would receive awards which, although proportionately\nmore modest, would even so be worthwhile."
}