{
  "id": "d504-31",
  "text": "- 3 -\nIn opening the meeting. Dr. Fritz Bruhl, Director of Radio\nProgrammes of the WDR, laid stress on the experimental nature of much\nof the radio drama at present \"being produced within EBU member organiza¬\ntions. He believed that this greatly enhanced the prestige of radio as\na whole and that even if the listening audience was not yet wholly attuned\nto it or appreciative of it, it was nevertheless a very worthwhile and\nimportant development in the context of radio as such.\nThe Agenda of the meeting had been drawn up in its main lines\nby the Radio Programme Committee during its last meeting in Berne in\nOctober 1970 and consisted, in the main, of seeing where earlier EBU work\nin the domain of drama had failed to justify fully the hope placed in it\nand to explore new areas which held the promise of fruitful co-operation.\n1. Earlier Activity\n(a) Eurotheatre\nThe experts did not entirely share the Committee’s disappointment\nwith this scheme which, it was recalled had comprised commendation to the\nattention of member organizations of six plays selected by an international\nJury as meriting more attention outside of their countries of origin than\nthey had hitherto achieved. One or two excellent works had appeared and\nhad been produced in a number of countries but, as Dr. Lauterbach (ARD-HR)\npointed out, part of the fault undoubtedly lay in the fact that some of\nthe pieces were written for the stage and did not adapt satisfactorily for\nradio. The experts turned to consideration of how this might be remedied\nin the future when they came to discuss item 2 of the Agenda reported on\nbelow.\n(b) Panorama_of_20th_Century_Theatre\nThere had undoubtedly been some misunderstanding over the\nobjectives of this project which was designed to do no more than bring to\nthe attention of drama departments a list of works considered to be unjustly\nneglected and insufficiently performed. It was therefore surprising to\nfind plays by such writers as Brecht, Becket and Ionesco appearing in the\nlist. Even so, the synopses of some 60 plays had been sent to all EBU\nmembers and though they would be unlikely to contain anything new or unknown\nto the more highly developed drama departments they had surely been of\ninterest and of some value to others. The experts agreed with the Committee,\nhowever, that there was little point in attempting to do anything of this\nnature again."
}