{
  "id": "d504-34",
  "text": "in respect of the rate at which translators should be paid* e.g. inter¬\nnational or domestic. Ultimately the whole subject of translation\nboiled down to the question >f money and it was clear that the larger\norganizations would, in consequence, encounter less difficulty in this\nrespect than the smaller. It was recognized on the other hand that\namongst some of the German \"neue Horspiele\" and,indeed,those from other\ncountries, there were some whose general '’sound quality\" was such as\nto be virtually international and universally understood and which could\nbe broadcast in their original form with the help, perhaps,of only a\nbrief commentary or introduction. As Mr. Esslin pointed out, the BBC had\nused this technique of commentary and introduction to broadcast plays in\nsuch languages as Zulu and Japanese in their original productions so\nphysical exchange of a recorded drama was not an impossibility.\nMr. Klippert (ARD-SR) summed up the point by stating that what was here\nsought was not so much the translation of a play, for this could intro¬\nduce distortion and cause the writer’s intent to be misunderstood, but\nthe exchange of fully recorded tape productions which were internationally\nvalid in their original form.\nMr. Takeuchi (NHK) informed the meeting of the intense interest\nwhich his organization had in acquiring scripts of plays specially written\nfor radio and in consequence he supported the NOS proposal though, like all\nothers present, he trusted that this would not involve any competitive\nelement.\nOn a vote as to whether it would be worthwhile to launch a\nscheme whereby interested organizations would each year submit two scripts\nto the EBU for examination by an international jury and thereafter for a\nshort list of those considered truly worthwhile to be drawn up by that\njury and the scripts sent to organizations which wanted them for their\nown production, 13 of the organizations represented shewed themselves to\nbe in favour (ARD, BBC, BRT, DR, JRT, NHK, NOS, ORTF, RAI, RTB, RTE, SR,\nSRC) and two (NRK and YLE) voted against the idea. The SSR abstained.\nIt was therefore decided to recommend to the Committee\nthat :\ninterested organizations should, each year, submit to\nthe EBU Radio Programme Section in Geneva the manuscripts\nof two plays specifically written for radio. They should\nbe of recent origin but may have been broadcast nationally."
}