{
  "id": "d504-36",
  "text": "Mile Depolo (JRT) informed the meeting that her organization\nwas planning an anthology of the radio play since the earliest times,\nin other words covering approximately the past b5 years. She wondered\nwhether perhaps there might be interest in extending this to become an\ninternational anthology collected over a period of two years. This\nproposition, however, came under some criticism, notably from Mr. Pilon\n(SRC) and Mr. Jacques (RTB) but six organizations (JRT, NOS, ORTF, RAI,\nSRC and YLE) expressed interest and believed that by exchanging perhaps,\nat least extracts containing points of special interest they might be able\nto make up worthwhile documentary programmes on the subject. In view,\nhowever, of this comparatively small interest it was decided that the\nEBU as such should not become involved and these six organizations,\ntogether with any others.who might subsequently become interested, were\ninvited to get in touch with each other or via Mile Depolo in Belgrade\nto see what could be evolved.\nAnother aspect of international co-operation in the field of\ndrama lay, of course, in bilateral joint commissioning but here again\nthere seemed little for the EBU as such to do. Mr. Dean felt that though\nthe EBU need not and should not get involved in negotiations of this\nnature it could play a useful role by distributing information in\nadvance on plans of this nature so that others could learn of them and,\nperhaps, join in. It would obviously be important that this information\nshould reach the drama experts in each organization and Mr. Dean reminded\nthe meeting of the existence of the quarterly EBU Radio Bulletin which\nwould be an ideal vehicle for conveying this and asked those present who\ndid not at present get sight of this to make contact with their\nForeign Relations Department to ensure that they were put on their\norganizations' internal distribution lists. At the same time he felt\nthat there might be value in drawing up a list of radio drama contacts\nwithin member organizations and a first start in this direction was of\ncourse the list of participants at the present meeting which is shewn at\nthe start of this report. Any further names plus addresses, telephone\nnumbers, methods of contact, etc., which any organizations, active or\nassociate, might, on reading this report, feel to be useful, would be\nwelcomedby Mr. Dean at the Administrative Office in Geneva and would\nbe included in a forthcoming edition of the Radio Bulletin.\nA further proposal for international co-operation came from\nMr. Malatini (RAI) who suggested the creation of an international\npermanent archive of outstanding radio productions. The idea behind this\nproposal was not to create a pool of first-class and/or historical\nrecordings which could be borrowed by member organizations for broadcasting\npurposes. Rather, it was to assemble in one central point, almost in\nthe sense of a museum, a collection of the best work done in this field-\nin different countries. This would not only be valuable and irreplaceable"
}