{
  "id": "d504-39",
  "text": "- 11 -\nMr. Trutat (ORTF) said that his organization had been\norganizing special workshop sessions for some time designed for\nyoung writers of all kinds and not necessarily limited merely to\nwriters of radio drama. The ORTF planned in the near future to\norganize evening sessions, possibly on a weekly basis, between\nproducers, writers and technicians so that together they could\nstudy anew the possibilities of the radio medium. These would not,\nhowever, confine themselves to drama techniques but would range over\nthe whole field of radio production.\nMile Depolo (JRT) informed the meeting that in Belgrade\nthere existed an Academy for training in dramaturgy. While similar\nacademies existed in other countries for actors and producers it was\nher belief that the one in Belgrade was unique in that it covered all\naspects of film, theatre, radio and television. Mr. Malatini (RAI)\nsaid that seminars of the type referred to by previous speakers\nwere also organized in Italy, notably in Milan and Bologna.\nMr. Trutat (ORTF) stated that he was particularly interested\nin the training of directors and producers in radio drama and he\nwondered whether any organizations arranged refresher courses for\ntheir staff or regular producers. Mr. Esslin said that the BBC did\nin fact train many people on the job and as they progressed in their\ncareers so did the BBC re-educate and update their knowledge and\ntechnique. He felt, however, that the information sought by Mr. Trutat\nwas important and should be incorporated in a recommendation to the\nCommittee and in consequence the point is reflected below. In passing,\nMr. Esslin noted that the present item of the Agenda did not mention\nactors though he believed firmly in the importance of their training.\nHe informed the meeting that every year the BBC offered two engagements\nof a minimum of six months each to actor students from drama schools\nwhich had fully working and equipped radio studios.\n(b) Stereo\nMr. Maentylae (YLE) informed the meeting that the Nordic\nradio organizations had recently held a seminar in Stockholm on new\ntechniques in stereo. It had been of particular interest to an\norganization such as his own which had little experience in this field\nand he believed that stereo techniques were so different as to justify\nthe holding of a two or three day seminar under EBU auspices at some\ncentral point in Europe. Mr. Esslin (BBC) felt that, by the very\nnature of the subject, any such seminar would have to be very limited\nin size but here Dr. Lauterbach (ARDS ! H) disagreed with him, expressing\nhis view that good stereo did not require specially restrictive\nseating arrangements for its audience. He stated that the Hessischer"
}