{
  "id": "d504-42",
  "text": "- Ik -\n(c) The_Serial_Play\nMr. Esslin reminded the meeting that it was necessary to\ndistinguish between series and serials, the former being complete\nin each episode but always using the same characters whilst the latter\ncontinued the same story line throughout the weeks, necessitating\nlistening to each and every episode. In Great Britain there was a\nproblem over broadcasting serials caused, perhaps, by the changing\npattern of life but the series remained popular and supply was well up\nto demand. Mr. Maentylae stated that YLE had recently conducted an\ninteresting experiment which did not fall fully into the category of\neither series or serial. In fact it was a cycle of plays using the same\nactors with a central theme running through them, the first of which was\nthe United States and the second now proposed being Russia.\nMile Depolo said that the JRT was commissioning a series of\nplays each of between 20 and 30 minutes1 duration and each written by\na different author on the subject of \"The Young Man of Today\". The\nplays would be fictional but would be designed to illustrate various\naspects of the central subject and she wondered whether perhaps there\nwere some other organizations who might be interested in co-operating\nwith the JRT on an exchange of script basis. Mr. Naber (ARD-SWF),\nsupported by Mr. Esslin (BBC) and Mr. Lounela (YLE), felt that this was\nan excellent idea which could be of considerable interest and in\nconsequence all organizations which were interested in exchanging\nscripts of plays specially written on this topic were invited to get in\ntouch with Mile Depolo in Belgrade who would co-ordinate the project.\n(d) Cliild-ren^s _Play s\nHere experience and opinion were fairly clearly divided with\nthe BBC and ORTF on the one hand having abandoned these entirely in\nview of the onslaught of television whilst the RTE and JRT amongst\nothers continued to broadcast them even though it had been necessary\nto bring forward their time of transmission. RTE, for example,\nusually broadcast its children’s plays about 1700 hrs whilst Radio\nLjubljana broadcast them every Sunday morning between 08-00 and 09.00 hrs\n- a time which had not changed for years - addressed to children between\nthe ages of 6 and lU. The station offered prizes to authors of children's\nplays who were enabled to go on entering for this purpose year after\nyear. They did not dramatize fairy tales but, regarding children as\ntheir listeners of the future, produced original material for them."
}