{
  "id": "d504-43",
  "text": "- 15 -\nMile Depolo, complementing the earlier information on Jugoslavia\nwhich had been contributed by Mr. Smasek, stated that every year\nsince 1958 the JRT had organized a festival of Jugoslav radio drama\nand that each year one day of this was devoted to a special theme.\nIn 1971 this theme would be the development of children's plays and\ntheir production and she felt that EBU as such might well devote more\nattention to this subject than it had done hitherto.\nThe BBC was slightly revising its earlier attitude, as\nMr. Esslin pointed out, and was just starting an experiment of\nbroadcasting special radio plays for children during the mornings of\nthe holiday periods and Mr. Trutat added that although the ORTF did\nnot broadcast plays as such it did produce two weekly literature\nmagazines specially for them.\n(e) Dramatized_Readings\nIn this domain there was almost complete unanimity as to\nthe very important part that such broadcasts play in the schedule of\nnearly every radio station. They are a much loved part of the\nprogrammes and generate a following and loyalty out of all proportion\nto their very low cost and effort. 19th century prose, in particular,\nhad been found by many to be ideal for this purpose since much of it\nwas originally designed for family reading in instalments.\nIt was legitimate to use one or several voices and a good\nactor could do wonders with most material. Books remain highly readable\nlong after they had fallen out of copyright and into the public domain\nand providing that a very short summary of the story so far were given\nat the beginning of each reading, they were simple to follow and\nimmensely entertaining. As one delegate stated, a single reader could,\nin these hurried times, produce an oasis of calm and remind his\nlisteners how beautiful their language was.\nIt was interesting that in several organizations, notably\nRAI, ORTF and some of the ARD stations, the serialized reading was\nnot the responsibility of the Drama Department but frequently entrusted\nto the Entertainment or Spoken Word Departments. In France it was the\nDepartement Litteraire which did this and which frequently anticipated\nthe release of new novels by reading particularly good extracts from\nthem, sometimes by the authors themselves. Such importance was attached\nto this subject by DR that, as Mr. Pade pointed out, even major\nnovelists were specially commisloned in his country to write for this\npurpose. At least three times a week at mid-day DR broadcast a"
}