{
  "id": "d504-44",
  "text": "dramatized reading of between 30 and 40 minutes, usually by one actor ,\nand it had noticed a distinct increase in the listenership for this over\nthe conventional radio drama which it broadcast in the evenings. Every\nsix months DR published a special radio novel immediately after its\nreading had been completed on the air and sales of these were very\nencouraging. Mr. Pilon (SRC) stated that his organization planned to\nbring this form back into its new Autumn schedules in 1971 and the meeting\ncommended similar action to any other organization which was not currently\nemploying this particular form.\n(f) Commissioning_of_Young_Writers\nThis was an activity in which it was generally felt that all\norganizations already did or should indulge. At the same time it was\none which9 by its very nature, could not be 100 per cent successful\nevery time - in other words organizations must be prepared to lose or\nwaste some money under this head.\nMr. Maguire (RTE) said that his organization was experiencing\nconsiderable difficulty in finding worthwhile young writers and the\nresults of a competition intended for them a year or two ago had been very\ndisappointing. He was therefore particularly interested in the experience\nof DR described by Mr. Pade whereby that organization commissioned about\n12 writers a year but coupled the commission with an invitation to a\nspecial 3-day seminar where the DR demonstrated to them the tools of\nthe radio trade, where they listened, discussed and were generally guided.\nMr. Angeli stated that the RAI divided young Italian writers\ninto two broad categories, the very young and little known oneswho wrote\nat their own risk initially and those whose qualities were known and who\nwere, in consequence, guaranteed fees for, say, three broadcasts of their\nwork. The SRC, according to Mr. Pilon, was planning to conduct most of\nits future drama operations by means of commissions. In Great Britain,\none way in which young writers were found was as the result of a\nprogramme called '‘Northern Drift” in which a regional producer covered\nhis geographical area very widely and commissioned initially very small\nworks or poems of as little as 3 or 4 minutes' duration each and thus\ngradually built up a cadre of accomplished radio writers. In reply to\na question from Dr. Schultes (ARD-WDR), Mr. Esslin confirmed that the\nBBC did not ask young writers for advance synopses of their work.\nThough not strictly within the terms of reference of ”young\nwriters”, Mr. Malatini mentioned that the RAI had achieved some of its\nvery best results by commissioning producers to write and produce their\nown plays - an idea which evoked much interest amongst those present."
}