{
  "id": "d504-47",
  "text": "- 19 -\n6. Audition of Recorded Excerpts\nThe experts devoted a complete morning of their meeting to\nlistening to tapes which had been contributed by a number of organizations\nand from which Dr. Schultes and Mr. Esslin had made a selection to\nillustrate different points. Thus extracts of productions by ARD (HR,\nBIAS, and WDR), JRT, NHK, ORTF, RAI, RTB, SR, SSR (SRG) and YLE were heard\nand provided food for discussion in the afternoon which followed, notably\non the subject of stereo. Here there were revealed the diametrically\nopposed experiences of NHK and BBC, the former estimating that the time\nand cost of producing stereo amounted to some 5 or 6 times that of mono\nwhilst the latter now did stereo production as a routine within the frame¬\nwork of Radio 3 and found it took no longer in rehearsal and cost no more\nthan mono.\nDr. Schultes (ARD-WDR) stated that ARD now produced some '30-40$\n(i.e. 1*0 - 50 plays) per year in stereo and there was evidence from a\nnon-ARD source of considerable public interest in stereo drama production.\nLike others present he recognized that most countries could produce\nstatistics of the number of stereo receivers in the hands of the public\nbut as far as he was aware no organization had yet made a study of how\nmuch this stereo facility was used by the listener, particularly in respect\nof drama.\nDr. Lauterbach (ARD-HR) was interested in ORTF’s recorded attempt\nto illustrate vertical movement by means of stereo but felt that this\nproblem had not yet been satisfactorily solved. He added that ARD stations\nnow moved the microphone to follow the actor and thus achieve the sense of\nmovement instead, as previously, of requiring him to move in an elliptical\nsense. Mr. Takeuchi (NHK) read a long, detailed and very interesting\naccount of development in stereo production in Japan and, at the request\nof the Secretary, agreed to send it in written form to the Administrative\nOffice so that it could be reproduced in the Radio Bulletin, issued as a\nspecial document or, if received in time, included as an appendix to the\npresent report.\nAnother illustration in which much interest was shewn was that\nof the ORTF’s production of '’Macbeth1’ which had, to a very large extent,\nbeen produced in the open air. The results were excellent and prompted\nMr. Maentylae (YLE) to plead that radio should get out more and occasionally\nignore the inevitably clinical atmosphere of the studio. Mr. Hausmann-\nHigson (SSR-SRG) believed that this technique could frequently help actors\nand he added that he used to employ it on occasions. He had found, however,\nthat it took more time, cost more and that intrusive sounds from aircraft,\netc., had increased to such an extent that he had now given it up."
}