{
  "id": "d504-49",
  "text": "Appendix I to\nDoc. OA. 4248\nRADIO : THE PLACE OF DRAMA IN THE OVERALL PROGRAMME FRAMEWORK\nAs mentioned at item 7 of the Report of the meeting of Drama\nExperts, this Appendix contains a summary of information contributed\nduring the course of the meeting by the various delegations present on\nthe place which radio drama occupies within the programme schedules of\ntheir organizations.\nBELGIUM\nSince last summer, the RTB has been decentralizing its pro¬\nduction centres without any increase in the overall air time.\nMagazine programmes are on the increase particularly on the Third Channel\nwhere Drama is having to give way to them. At the present time there\nare two principal weekly Drama broadcasts, a popular one on Wednesday\nevenings and the second on Sunday afternoons, still intended for a wide\naudience but embracing the classical and modern repertoire. Serials\nare broadcast every morning and afternoon, those in the morning usually\nbeing adapted from well-known books. On occasions, there are prestige\ndrama broadcasts on the Third Channel but these are rare. This Channel\nuses stereo whereas the First Channel confines its output to mono.\nIn the BRT, at the present time, the major weekly play is\nbroadcast twice within the course of the same week, on the first occasion\non Channel 1 with its repeat on Channel II. It is anticipated, however,\nthat this pattern will soon change and that each channel will increasingly\nspecialize. When that happens, the principal annual drama output will\nconsist of 40 new productions and 12 repeats. 80 per cent of the\ndramatic output is derived from overseas sources but everything has been\nexclusively conceived for radio and no adaptations from stage novel or\nother sources are either used or envisaged. Within this framework,\nBRT is experimenting over the broadcast in their original language of\nplays coming from other countries. Additionally, Channel II broadcast\nlighter and more popular plays and serials.\nCANADA\nSRC's output has hitherto been limited by the fact that only\none channel has been available but this will alter next autumn when a\nsecond channel comes on the air. At the present time it broadcasts one"
}