{
  "id": "d504-50",
  "text": "- 2 -\nCANADA (continued):\nmajor play per week and each month devotes a 60-minute period to two\nor three pieces of experimental radio drama. Two serials are broadcast\neach day, one of relatively short duration and the other designed to\nlast much longer, in the region of perhaps four months. This pattern\nmay well change next year, however, with the availability of a second\nchannel. SRC made an experiment during last summer of broadcasting a\n30-minute radio drama every evening and this proved successful.\nCBC has to take account of the fact that its national output\nspans 5 time zones which, of course, makes scheduling complicated.\nEvery week it broadcasts a major radio drama which is usually an adap¬\ntation of a classical play and, in addition, from Toronto, a weekly play\nof an experimental nature* repeated in an afternoon period, is broad¬\ncast. Serials are broadcast five days a week and once a week an entire\nevening is devoted to serious matter which might contain dramatic pro¬\nductions of durations ranging from ten minutes to two hours.\nDramatized readings also have their regular place in the CBC schedule.\nRadio drama has been in the foreground of experiment in Canada, amongst\nother things in the matter of combining wavelengths to produce quadraphonic\nsound which it is hoped will involve and interest the younger listener.\nDENMARK\nRadio drama in Denmark is now more strongly established than ever\nand the number of transmissions of this genre has increased over recent\nyears. Whereas previously there used to be three or four major produc¬\ntions there are now five per week. The first channel broadcasts easy-to-\nlisten-to plays on Monday nights whereas on Friday nights the second\nchannel broadcasts productions of an advanced and experimental nature,\nfrequently using young producers and writers. DR is aware of a growing\ndemand from its audience for quality and caters both for the evening and\nday-time audiences, the latter usually the larger. Approximately U5 per\ncent of its output is composed of adaptations of stage plays. Since 19^9\nDR has been keeping recordings of all its dramatic productions and\nrecently, on its first channel, it has started rebroadcasting these on\nWednesday nights rather in the same manner as the old films seen on\ntelevision. This has enjoyed considerable success and popularity. No\nchildren's plays are produced in Denmark but there are some 20 programmes\na week of dramatized readings, serials etc., and in addition a weekly\n^5-minute magazine programme giving news of what is going on in the\ntheatrical world."
}