{
  "id": "d504-55",
  "text": "- 7 -\nSWEDEN (continued)\nother organizations; U or 5 serious plays a week are broadcast in\naddition to a number of serials and plays of a lighter nature on Sun¬\ndays. Some productions are in stereo and SB also broadcasts short plays\nof an experimental character.\nSWITZERLAND\nDramatic output here varies between the different linguistic\nregions of the country. In German-speaking Switzerland a play is broad¬\ncast at 2000 hours every Saturday night on AM on the First (popular)\nProgramme,repeated on Monday afternoon at 1600 hours. These plays em¬\nbrace all types of drama in the light entertainment field. The Second\nProgramme (FM) tends to broadcast longer plays, the classics etc.,\nfirstly at 1715 hours on Sundays with a second broadcast on Thursday\nevenings at 2000 hours. This same channel carries an experimental pro¬\ngramme once a month and every Wednesday morning between 0900 and 1000\nhours a magazine-type programme devoted to theatrical and related topics.\nAudience capacity and size is reported much better than was the case 7\nor 8 years ago and it is interesting to note that some factories in\nGerman-speaking Switzerland, depending on their type of work,allow\nemployees to listen even to radio plays during working hours. In French-\nspeaking Switzerland there has been a slight reduction in the output of\nradio drama over the past 2 years but even so, there are some 260 pro¬\ngrammes broadcast each year fairly evenly distributed as regards type\nand time. Thus, on Monday evenings, there is a 50-minute thriller: on\nTuesday evenings, a major play of 1§ - 2 hours, uHually of a contemporary\nnature and specially produced by the RSR: on the first Tuesday of each\nmonth a classic of French literature is broadcast: each Thursday evening\nthere is a period of between 30 - 50 minutes devoted either to experimen¬\ntal drama or to work by young and new writers, whilst on Saturday evenings\ntwo plays of a popular nature are broadcast. An important slot on Sunday\nevenings is reserved for a major production aimed at a high level audience.\nIn addition, there is a daily serial at 1600 hours which has proved very\npopular and research into the results of this during last August - a\ntraditionally bad listening period - revealed very encouraging results.\nRSR also broadcasts daily a modern 5-minute serial for children and has\nspecial programmes involving authors and actors in which listeners can\nparticipate by telephohe.\nUNITED KINGDOM\nThe BBC has now recognized that as far as Great Britsin is\nconcerned the afternoon is the best time for radio drama and, indeed,\na play varying between ^5 and 90 minutes in duration is broadcast"
}