{
  "id": "d504-56",
  "text": "- 8 -\nUNITED KINGDOM (continued)\nevery afternoon of the week. Some of the important plays broadcast\nduring the evening periods are repeated immediately afterwards during\nthe afternoons: whereas the Saturday evening play may have some\n650,000 listeners, it has been shewn to reach over a million when\nrepeated on Monday afternoons. Family serials are broadcast on Radio 2\nincluding some specially designed for housewives in the mornings, and\nRadio 3 (the former Third Programme) carries one origination and one\ncomplete play a week.\nIn total the BBC produces between 800 and 1,000 new drama\nprogrammes a year but this figure includes serial readings with one\nor more voices which are very popular. Whereas serious drama was\npreviously confined, in the main, to the former Third Programme, this\nhas now been moved to Radio k, a more popular channel and the BBC has\nbeen surprised at the success achieved by serious drama in its new\nhome and the increased audience interest for it.\nYUGOSLAVIA\nAs in some other countries, the dramatic output varies from\nstation to station in Yugoslavia and this report does not, therefore,\npretend to be comprehensive.\nRadio Belgrade broadcasts drama on all its three channels.\nThe First Channel broadcasts the following programmes each week :-\nAn original radio drama of 60 minutes duration written by\nan established writer either from Yugoslavia or from abroad;\n\"The Small Stage\", duration ^0 minutes, alternates with\n\"Radio Playhouse\", the former being relatively simple and deriving from\nauthors of any nationality whereas the latter is devoted exclusively to\ncontemporary Yugoslav writers;\nA 60-minute production, \"The Theatre Scene\", presents works\nadapted for radio from the legitimate theatre either in Yugoslavia or\nabroad and tends to concentrate on contemporary plays;\nFrom time to time and usually in relation to some anniversary,\nthe First Channel also carries cycles of plays such as, for example, a\nseries devoted to Shakespeare during his Uooth anniversary;\nHumour and Variety receive 20 minutes and 30 minutes respec¬\ntively each week on the First Channel, and in addition there are two\nspecific programmes per week designed for children each of 30 minutes\nduration."
}