{
  "id": "d504-70",
  "text": "ITEM 15_contJd\n;\nThe report based on the replies received, doc. Com.T.(G)lU8,\nwill be distributed to the Technical Committee and the Radio Programme\nCommittee as well and also document Com.T.(G)lU9, entitled \"Problems\nrelated to the storage of tape recordings\"9 which provides a general\nsource of information and includes some practical advice for non-specialists,\ntaken from an ORTF Research Report and a publication issued by the Library\nof Congress in Washington.\nCircular letter G 206/2 will reproduce all the replies to the\nquestionary, and will be distributed to the experts who participated in the\nenquiry.\nb) Co-ordinationjDf Multilateral_Sound_Transmissions\nWhen these notes were prepared, five of the concerts of the 1970-\n1971 Season had been transmitted, and all were taken by the EBU members in\n12 countries without serious incident. It is certain that that result\nshould be attributed to the technical co-ordination of these transmissions\nby the RTB/BRT and the application of the Code of Practice for International\nRadio Exchanges (doc. CT/378).\nIt would be advisable to make similar arrangements for the 1971~72\nConcert Season.\nThe Technical Centre has also continued to give assistance to\nindividual members in the organization of international transmissions of\nsound programmes, notably to Danmarks Radio for the Public Jazz Concert\nfrom Belgrade on 13 November 1970, and to the BBC for the tour of the BBC\nSymphony Orchestra in Germany and Switzerland in February and March 1971*\nc) Utilisation of International_Sound\"Programme_Circuits\nAt the Berne meeting, the attention of the Radio Programme\nCommittee was drawn to the major increase in the tariff for leasing\noccasional international sound-programme circuits announced to take effect\nfrom July 1971* The Committee has requested the Administrative Office to\nundertake, in collaboration with the Technical Centre, an enquiry to deter¬\nmine the present use of occasional circuits in order to prepare a list of\nthose which it might be worthwhile to consider leasing permanently.\nA questionary on this subject was therefore issued in December 1970.\nIt enquired as to which were the most frequently-used circuits, the total\nnumber of hours used each month and the monthly frequency of use of each\ncircuit. The enquiry refers to the present-day situation and also to that\nenvisaged in 1975 and 1980."
}