{
  "id": "d504-74",
  "text": "- 3 -\nITEM 16 contd.\nIII.\n(1) continued :\nIt was recommended that a spare portable tape recorder be\nincluded automatically as part of the technical assistance since\nthis would be useful for interviews following the event;\n(2) The Group wished that all requests be made well in advance.\nIt would therefore be advisable to fix a particular deadline for\nrequests, all organizations being asked to respect this deadline;\n(3) In the case of organizations with autonomous stations,within\nthe framework of extraordinary events, requests for assistance\nand use of circuits should he centralized by a single responsible\norganization (e.g. ARP, JRT);\n(k) It is desirable that the material means (positions allocated\nto reporters, T.V. monitors etc.) made available to radio organi¬\nzations he up to the standards required by the mission they have\nto fulfil and cover their needs fully.\nIV, Invoicing of Local Circuits :\n(1) The Group recalled that what is commonly referred to as nlocal\ncircuits** or \"local ends\", as for instance the circuit permanently\ninstalled between Wembley Stadium and the Post Office terminal in\nLondon, were not invoiced and that this Convention was the subject\nof bilateral agreements, as for instance those between the BBC and\nthe ORTF.\n(2) On the other hand, in the matter of the setting up of occasional\nlocal ends and taking account of the appreciable increase of costs\nto set them up, the Group thought it fair that these costs he borne\nby the requesting organization.\nIt therefore recommended that the special costs incurred in\nrespect of the construction of occasional local ends be invoiced by\nthe Postal and Telecommunications Administration of the requesting\ncountry on the same basis as those of the international circuits and3\nin this respect, the existing agreement between the British and French\ntelecommunications administrations would appear to be conclusive and\nto be the inspiration for similar agreements."
}