{
  "id": "d504-79",
  "text": "ITEM 18\nRad. Com.\nIstanbul\nSTATUTE OF THE JAPAN PRIZE\nWhen the present Agenda was drawn up there was a likelihood\nthat NHK might propose one or two modifications to the existing Statute\nwhich would take effect in the current year. The Secretary of the\nCommittee, however, has recently had the opportunity of considerable\ndiscussion with the NHK on this point and has learnt that there will\nnow be no change during 1971*\nIn fact the two principal amendments which the NHK has in\nmind are mainly of a legal and television nature and are unlikely to\nbe of much concern to radio. NHK will be seeking the advice of the\nEBU during the course of this year with a view to a possible amend¬\nment to the Statute next year, but there is no need to concern the\nRadio Programme Committee at this stage. There is, however, one\npoint on which NHK would appreciate advice from both the Radio and\nTelevision Committees and that concerns Article Ik (i) of the Statute,\nwhich reads as follows :\n\"Programmes must have clear and definite educational objectives\nand must be one of those, as mentioned below, which are\nsystematically and orderly organized and arranged in series.\nTherefore, a single individual programme, which does not\nform part of a series, shall be excluded.\"\nAlthough, as mentioned above, there is no intention of amending the\nStatute this year, NHK does feel that there would be value in\ndefining a series, particularly so since recently a European tele¬\nvision organization entered a programme for the Japan Prize, main¬\ntaining that since it broadcast one such programme each year, it\ndid form part of a recognizable series. It has been felt that to\nsuggest that one programme per year constitutes a series is to stretch\nthe point a little and NHK would appreciate advice as to what the\nEBU Programme Committees consider should fairly constitute the\nminimum requirement for a series so that perhaps next year this word\nmay be adequately defined in the Statute*, for example, the Committee\nmay care to propose some such formula as :\n\"In this context a series shall be defined as being not less\nthan 'x' programmes on a given subject, broadcast within a\nmaximum period of 'y' months.\"\nThe Committee is invited to consider and recommend on this point."
}