{
  "id": "d1624-4",
  "text": "NAEB NEWS LETTER.Page 5..April 1, 1943\nWAKR is now operating on Central War Time* When# on February 17, Michigan\nturned back the clocks one hour it became neoese. ry to alter the schedule\nsomewhat* The Blue Network features, as the National *arm and Home Hourt\nare beoateast at a fixed time and these had to be changed*\nBERGER DIRECTS PROGRAMS AT KWLC\nProfessor Kenneth Berger is now in oharge of program work at KWLC, Luther\nCollege, DecoBah, Iowa, according to word reaching us from Mr* Karl\nHanson, treasurer of the oollege*\nLANGUAGES IN ACTION SCRIPTS OFFERED\nThe Chicago Radio Council is doing a dandy series of programs titled\n\"LANGUAGES IN ACTION,\" George Jennings, Acting Director of the Radio Coun¬\ncil, offers copies of all scripts to date and all future ones oh a weekly\nbasis in oase any member stations wish to use the program* The series is de¬\nsigned to awaken interest in the study of foreign languages* *hile aimed\nprimarily at school level, George feels, and from the ones I have read\nI agree, that the series has a considerable listening audience at adult\nlevel. As in oase of NAEB Scripts, credit is to be given Radio Council\nwhen sorlpte are used*\nCOMPETITION PROM WALDO AB':QT\nWaldo Abbot, author, aotor, teaoher and director of radio broadcasting for\nthe University of Miohigan apparently spends his spare time compiling a news\nletter which he mails to all* of hl;s former broadcasting students* Quite a\nJob, Ifd say* Waldo promises his \"etudes\" another letter about May 1.\nSTATIONS MUST CONTINUE OPERATIONS\nThe Federal Communioations Commission at its meeting March 9 rejected a\nproposal that standard broadcast stations be permitted tocease operation\nfor the duration of the war and retain their licenses* While making no\nchange of its existing general policy permitting temporary suspensions to\nenable stations to meet and overcome current emergencies, the Commission\nexpressed the belief that the door should not be opened for any general\nsuspension of radio broadcast operations during the war period.\nIn announcing the decision, James Lawrenee Fly, Chairman of the Commission,\ndrew attention to the fact that the adoption of a policy permitting suspen¬\nsion generally would probably result in the elimination of radio broad¬\ncasting in many areas where the need for public service is the greatest.\nHe pointed out that the indefinite suspension of broadcast operations mig$it\njeopardize this country9s interest in the radio frequencies as provided\nMU the North American Regional Broadoasting Agreement* Fly also said\nthat various steps have already been taken to alleviate the fifficulties\nof the smaller stations* For example, it is provided that stations may op¬\nerate as little as six hours per day*\nNAEB PACKET\nAre you using, are you contributing to the NAEB Packet? Note enclosures"
}