{
  "id": "d281-1",
  "text": "February 17, 1969\nMr. Richard Forsythe\nWBAA\nPurdue University\nLafayette, Indiana 47907\nDear Dick:\nThank you for sending along your edited paper on instruction¬\nal radio. You have set forth a good statement of the history,\nproblems, potential, and needs of instructional radio.\nIt occurred to me while reading through, that there would be\nsome value in considering audio as a rubric instead of\nradio. Audio communication systems for instruction need not\nbe radio in the familiar broadcasting sense; taking this\napproach could reduce some of the reciprocity add versatility\nproblems that you mentioned. As with television, the one-way\nmass distribution format is not necessarily a limitation if\nth© materials themselves are designed on an interactive\nbasis. Moreoever, quite flexibly designed audio systems,\nperhaps with complementary video systems, could improve the\npotential and possibilities for imaginative instructional\ndesign. Should cable coramunication systems coir® along, this\nlikelihood would be greatly enhanced. You have touched on\nthis, but in a section titled \"Lack of Versatility” which may\nlead to confusion about whether you feel radio (audio) does\nor does not lack versatility.\nThe problems you examine are all present, but the overriding\ntrouble seems to roe to lie in the conceptual gap between\nradio as a mass communication system and audio as a practical\nand necessary component of instructional operations. Defending\nradio and documenting its virtues in comparative media studies\ndoes not provide the essential argument required to persuade\neducational planners that electronic audio-video communica¬\ntion systems can facilitate new levels of efficiency in educa¬\ntion. It may encourage them to think kindly about an easily\nneglected medium but the conditions call dor more explicit\noutcomes than that.\nI am glad that you send the paper along to Allen and I hope he\nwill be able to use part or all of it in an EBR.\nBest regards. Sincerely,\nccs Mr. Mott\nJames A. Fellows"
}