{
  "id": "d281-18",
  "text": "-3-\nSecond, follows the recognition that instructional television\nand radio are potentially more effective than their use thus far\nhas demonstrated. The reasons for this condition will vary.\nSome will say that money is lacking; that the lessons are inferior?\nthat the teachers do not know how to use television effectively;\nthat there are not enough receivers; that the teacher guides are\nnot distributed on time? that the students don’t care for in¬\nstructional television and radio; that the schedule is inconvenient;\nthat the materials are inappropriate - too general or too specific -\nto be relevant to the curriculum at hand; that the principal feels\ntelevision is used by teachers to waste time; and so on. All of\nthese conditions exist and they clearly inhibit the use of television\nand radio in the classroom. But if they were each resolved,\nwould we have the slate clear for genuinely effective use of\nthese media? Probably not.\nThird, is the recognition thattths reasons for the ineffective and\ninefficient use of television and radio in the schools is that\nthey have been aeen as classroom aids, rather than as means for\norganizing modern and effective educational methodology. They are,\nfrankly, used to dress up educational practices that have not\nchanged appreciably since the 19th century. Such practices place\nin a central position of authority and instructional decision¬\nmaking a classroom teacher. She is, in every respect, a proverbial\n\"gate-keeper\" who selects what her students are to be taught and\nwhat is to be neglected. Many teachers do this well; most do not.\nAnd instructional television and radio, good or bad, have been\ncompressed to provide only that material and only those lessons\nwhich fit into these traditional practices. Such has been the\nfate of virtually all attempts at innovation, including most\nversions of team teaching, which merely involve more people in the\noriginal sin.\nThere will be arguments about all of these points, but we are\nleft with the general condition of our schools and their productivity.\nAnd we are left with a communications technology that to date has\nhad negligible impact upon that condition. Consider the following\nconditions as illustrative of our educational needs and deficiencies:\nNew York City schools on strike the better part of the school year\nthus far; Youngstown, Ohio schools closed from Thanksgiving until\nChristmas for lack of funds; more than 30% of persons taking the\nArmy General Classification Test failing? increase in number of\nremedial reading programs required; inferior educational opportuni¬\nties for large numbers of racially segregated students; meaningless\ninstruction for the major proportion of children in the inner\ncity schools; these are the facts of educational life for many\nchildren in the United States."
}