{
  "id": "d1004-124",
  "text": "■3»\nb) Though this is to© early to become too involved with this\nproblem and 'Sybase other questions must be answered before\nusaking a final decision, ©re there hot ideas on a possible\ndirector of research?\n(1) Hay Cheydleur raises an important question which we need\nto hash out concerning overall goals* He asks:\n(a) \"Is this research to be of direct help to manager®,\nanr w.’SMarihitw ? **\nor producer®, ©r professors?\"\nT© put it another way, 1 think we need to ask ourselves\nwhere the kind of research which we want to initiate\nor help lies on the continuum from basic to applied\nresearch — whatever those words mean*\nAgain, as Bay points out, this has some relationship\nto the kind of person one hires a® a director of re¬\nsearch and, X might add, the kind of persons the Presi¬\ndent places ©n the Research Cossaittee*\nc) X guess what this adds up to is the fact that we have talked about\nmany kinds of research — at the Columbus seminar and elsewhere*\nThe time Is approaching when w© need to say this is the order of\npriority for this research as far as the NAEB Research Committee\nis concerned* Then we can start scratching to see that it gets\ndone. X think we need to he very specific in this. Vague state¬\nments about research needs, in my ©pinion, do not get us far*\nBy the way, Xrv Merrill has expressed the hope that the NAEB\nformally request the Bureau of the Census to include questions about\nradio and television ownership in the forthcoming 1960 Census of\nHousing* X heartily concur* How do the rest of you feel?\nX will take no more of your time at this point. X would appreciate\nhearing from you* X would like to know if you will be at Columbus and\nif you think a meeting of the Research Committee could be held during\nthe Institute period. If not, would you be willing to stay an extra\nday? If you cannot make the Institute, X would appreciate your reactions\nto the above plus any other ideas which you have which you feel should\nbe considered by the committee or which yew feel the committee can do\nsomething about*\nBest,\nSam L. Becker, Chairman\nHAEB Research Committee\ncc: Burton Faulu\nHarry Skoraia\nJack McBride"
}