{
  "id": "d1004-35",
  "text": "[far*- „\n©{{e Jjlnriha jitaie llnttesttu\n‘Glallatixssee\nUNIVERSITY BROADCASTING SERVICES\nJanuary 8, 1957\nDr. Sam Becker, Director\nTelevision Center\nState University of Iowa\nIowa City, Iowa\nDear Sam:\nIt was mighty good to learn this morning that you are the new Chairman of\nthe NAEB Research Committee! I suggested to Harry and Burton that the\nwork of the coranittee had reached the stage where it should be chaired by\na man with the credentials you possessed* I only hope that I may cooperate\nas well with you as you did with me.\nThere are three bound files of material to be mailed to you. Since there\nare a few personal letters to be pulled, I will not ship them out until\ntomorrow.\nThere are several things you may wish to do:\n1) All of the publications from grants-in-aid have not been\nreceived; these should be obtained and checked out.\n2) Over sixty personal letters have been sent out to thank\nvarious people at the seminar. However, Gerhart D. Wiebe,\nof Elmo Roper and Associates, still needs to be thanked for\nhis participation. A formal note needs to go to Dick Hull\nand to Keith Tyler for their fine cooperation. (The President\nand Vice-President at Ohio have already been thanked.\nThe fourth letter and perhaps it should have been among the\nfirst, but the holidays shut everything down here, should go\nto Mr. Herbert E. Evans, Vice President and General Manager,\nPeople*s Broadcasting Corp., Columbus, thanking him for the\nfine steak dinner he provided.\n3) A formal request went into the Board for funds to pay for the\nediting of the seminar material. Another request has been\nfiled requesting that funds be provided for the position of a\nDirector of Research. At this time you may wish to make an\nadditional request for funds needed to pay committee trans¬\nportation costs. One thing hinges on the other, but it seems\nto me that it should be in the budget requests at once.\nii) You may also wish to file a formal request for grants-in-aid\nhelp. I believe that $5,000.00 has been suggested."
}