{
  "id": "d1004-4",
  "text": "To members of the NAEB Research Committee:\nSorry that we were not able to have a meeting at Columbus. We\ncould have settled committee business much more efficiently there.\nHowever, the mails will have to serve. The majority of the committee,\nin response to our last memorandum, indicated that the grants-in-aid\nshould be continued. We still have no word on additional funds and\nso I feel should get the grants-in-aid project set up for 1958-59\nand then see whether more money is forthcoming before making further\ndefinite plans. There seems to be some disaggeefflent within the com¬\nmittee on whether the purpose of these grants needs redefining. I\nbelieve that the easiest way to get this settled is to send each of\nyou a copy of the announcement for this year and have you indicate\nwhat changes you feel should be made for the 158-159 announcement.\nPlease be specific. You can either insert changes on the copy which\nI am enclosing — or can retype the entire business in the way which\nyou feel it should be.\nIn deciding on this, perhaps some of the reactions of other com¬\nmittee members would be helpful. Here they are:\nHarwood: Probably the general purpose of these grants could\nbe to encourage research of a higher quality instead\nof merely more research. I am alble to think of very\nlittle research in which the committee may not be\ninterested, if that research is proposed by a competent\nresearcher who has knowledge of educational broadcasting.\nCheydleru: We need to be very specific in our announcements about\nwhat expenses we intend to pay...The idea strikes me\nthat committee projects should be approved right along\nwith those that are submitted by other applicants.\nTannenbaum: I still would favor the general system of inviting\nproposals for research on a variety of topics rather\nthan us trying to limit the grants to certain areas.\n....Scholarship and good research flourish, I think,\nin an atmosphere of free choice.\nI believe that everyone is agreed that such matters as publica¬\ntion of anything should not be done with these $2,000.00 unless we\nfail to turn up research proposals which warrant giving all of the two\ngrand away. (The publication of the Columbus seminary report does not\ncome out of our $2,000.00) Everyone might keep in mind this possibility\nand have some suggestions for committee projects, etc. next February.\nI am reminded also that, in my opinion, one of the reasons we have\nnot gotten more good research proposals in the past is that the\nannouncements have not always gotten to the proper persons at all\nschools. Any suggestions, specific or general, which you have for"
}