{
  "id": "d1004-61",
  "text": "or piled in a corner.. They must be stored so they are easily accessible* The\nprinciples of good storage apply not only to those materials which are in and\nloaned out from the center but similarly to those materials housed in other\nschool or departmental locations* Storage facilities for all active circulating\nequipment and materials should approximate about one-fourth the total square\nfeet area of the communication center* Location of the materials storage area\nis as important as the amount of space provided. The storage area should be\nlocated on the main floor near the shipping and repair areas to avoid unneces¬\nsary transportation problems.\nPictures of special equipment and technics for storage of films, filmstrips,\nrecordings, tapes, slides, charts, maps, flat pictures, and exhibits are dis¬\ncussed and illustrated in an earlier publication in this series (_)* A repre¬\nsentative list of the companies manufacturing equipment and illustrations of\nequipment are presented in the Appendix E and F»\nA storage problem rather commonly found in the college center is that\ncreated by the relatively large number of motion picture prints. This problem\nis particularly noticeable on large campuses and where films are circulated to\noff-caucus users. Many find that the use of the usual metal cabinets, housing\nabout 100 films, is not satisfactory. Many use film vaults, equipped with metal\nfilm racks.\nThere seems to be no agreement as to the exact temperature and relative\nhumidity that is best for film storage, but all studies indicate that some\nprovision should be made so that these two factors are kept from becoming ex¬\ntreme regardless of the prevailing climatic conditions. The temperatures usually\nrecommended are from 5>0 to 70 degrees and the relative humidity about 5>0 percent.\nThe materials storage area will need such equipment as; dust proof storage\nfor charts, maps, models, etc.; shelving, storage cabinets, racks for filmstrips,\nrecordings, and films in units that can be rearranged and put in sections; visual\nlocation boards; push carts, especially designed for the purpose, and storage for"
}