{
  "id": "d1004-95",
  "text": "38\n31. Thompson., Sonald B. The Impending Tidal Wave of Students, Columbus, Ohiog The American\nAssociation of Coliegiate’^~gistrarF_and Admissions' Officers, 19$h» 1*8 p.\n32. Tiemann, Ernest* \"Exploratory Conference on Certification of Audio-Visual Instructional\nMaterials Supervisors*w Audio-Visual Communication Review 3 s I Winter 1 933®\n33. Wait, Clifford V* A Study of Audio-Visual Programs in Selected Teachers Colleges in\nthe United States for the Purpose of Identifying and Describing Some Effective Adminis-\nTrative \"Patterns* BloomihgtonT Indiana g Doctor's Thesis,\" Indiana* University/ 19?3* \"\n\"(Typed)\ni\n3k» Wei, H. R. Classification of Slide Films and Motion Pictures. New Yorks Educational\nFilm Library 'Associa tion, Inc *, 195X7\" 18 p.\n35* W: .liams, Don G. \"Universities Are Failing Students and Democracy.” Educational\nScreen 32s 297-312j September 1933.\n36. Wittich, Walter A*, and Schuller, Charles F. Audio-Visual Materials. New Yorks\nHarper and Brothers, 1933• 361* p® n\n37. Woelfel, Norman. \"Teaching Aids Laboratory.” The Audio-Visual Reader. Dubuque, Iowas\nWilliam C. Brown Co., 193U® p® 2^0-32.\nAudio-Visual Materials\n38. Accent on Learning. l6mm, sound, black and white, 30 min. Ohio State University,\nDepartment of Photography, Columbus, Ohio, 19l*9®\n39* Audio-Visual Aids to Learning* l6mm, sound, black and white, 11 min. Government Films\nDepartment, United World Films, Inc., lluU3 Park Avenue, New York 29, N. Y., 1930.\n1*0. Bridges for Ideas. 16mm, sound, black and white, 28 min. University of Southern Cali¬\nfornia, Audio-Visual Services, Department of Cinema, 3318 University Avenue, Los Angeles\n7, Calif., 1931*\n1*1. The College Audio-Visual Center. Black and white, silent, 37 frames,, Young America\nFilms, Tnc77~Nbw^ork73^07~^\n1*2. Film Inspection. Black and white, silent, 33 frames, Washington State College, Audio-\nVisual Center, Pullman, Wash., 1931*®\n1*3. It's Up to You. 16mm, sound, black and white, 13 min. Aetna Life Affiliated Companies,\n?ublicEBuca tion Department, l3l Farmington Avenue, Hartford, Conn., 1932.\n1*1*. The Opaque Projector - Its Purpose and Use. 16mm, sound, black and white, 6 min. State\nUniversity of Iowa, Bureau of Visual Instruction, Extension Division, Iowa City, Iowa,\n1*5. Operation and Care of Ampro l6mm Sound Projector. 16mm, sound, color or black and\nwhite, 12 min. International Film Bureau,\"”37 East Jackson Boulevard, Chicago, 113.,\n193U®\n1*6. Operation and Care of the Bell and Howell Sound Projector. l6mm, sound, black and\nwhite, 21 min. InternatTonaT^ 57 East Jackson Boulevard, Chicago, Ill.,\n1931/"
}