{
  "id": "d1741-1",
  "text": "NAEB NEY.S LETTER...Page 2.. ..December I, 1942\nAssociation of Educational Broadcasters* He is no? regional vice-\npresident of the Association fop Education by Radio and also a\nMEMBER OF THE FEDERAL RADIO EoUCATION COMMITTEE OF THE FEDERAL\nCommunications Commission.\nIn accepting the OV.I shortwave post, Mr. McCarty indicated that he\nPLANS TO RETURN TO V/HA.AS SOON AS HIS SERVICES ARE NO LONGER NEEDED\nIN THE PSYCHOLOGICAL WARFARE EFFORT,\nThree members of the WHA staff are now on leave—McCarty, Engel and\nBartell. William G. Harley has been made Acting Director; Walter Krule\nvitch. Acting Program Supervisor; Joyce Jaeger Kartell; Acting Director\nof the School of the Air, and Roy Vogelman, Chief Announcer. Other\nMEMBERS OF THE STAFF v'» LL SHARE INCREASED RESPONSIBILITIES AND NEW\nTASKS,\nNAEB LEFTS \\U CHICAGO\nMeeting concurrently with the Sixth Annual School Broadcast in\nChicago on November II was NAEB, The meeting vas informal, “ith\nMEMBERS PRESENT DISCUSSING PROBLEMS PRIMARILY CREATED BY THE WAR\nsituation. Roll by stations indicated that all have increased\nTROUBLE KEEPING STAFF PERSONNEL, WH ILE AT THE SAME TIME THERE WERE\nADDED BURDENS OF CREATING GOOD WAR PROGRAMS FOR THE LISTENERS.\nAmong those attending the NAEB session and attending the Conference\n'\"ere Major Harold W. Kent, Chicago Radio Council; Josef F. Wright,\n'A ILL; Mrs. Pearl Broxsam, WSUI; Waldo Abbot, Michigan; Harold Engel,\nWHA; Gilbert D. Williams, WBAA; Dick Hall, WOI; and others »*hose\nNAMES WE NEGLECTED TO JOT D0»»No\nThe special committee appointed to study the music situation reported\nthat it was continuing its study and awaiting developments.\nMICHIGAN PROGRAMS CN THE AIR\nTwelve radio programs are being broadcast each week from the campus\nstudio as the University of Michigan starts its 18th year of broad¬\ncasting, it is announced by Professor Waldo Abbot, director of the\nUniversity*s broadcasting service.\nFive of the broadcasts are made over WJR, Detroit; four over CAR,\nPontiac; and three over WWJ, Detroit. This is the 18th year in which\nWJR HAS CO-OPERATED WITH THE UNIVERSITY 8Y PROVIDING TIME ON THE AIR\nFOR THE CAMPUS BROADCASTS.\nThe broadcasting programs include: \"Wartime Hymns”, directed by\nProfessor Hardin Van Deursen, of the School of Musio, and featuring\nthe University Choir; Faculty ne^s commentator; \"Meet the Emergency,\"\ndramatic program; Dramatization, directed by Professor David Owen,"
}