{
  "id": "d1741-2",
  "text": "NALB NEil.S LETTER\nPage 3\nDecember i, 1942\nASSISTANT PROFESSOR OF SPEECH; \"LFDECINE IN THE ,K - A SERIES OF\nTALKS RV MEMBERS OF THE ^EPICAL SCHOOL FACULTY t \"TELL ME , PROFESSOR,\"\nf3Y Professor Abbot; \"It happened Before,** oramatization; \"Patriotic\nMusic*11 directeo by Dr„ Joseph £. Maddy, chairman of the music\nCOMMITTEE OF THE MICHIGAN COUNCIL ON NATIONAL DEFENSE,\nFRESPg- OF PR£3S OK JlSUt.\n* SERIES OF SI* HALF-HOUR RADIO PROGRAMS DEALING V' I TH THE BATTLE FOR\nFreedom of the Press in America have been recently written* produced\nAND RECCaDFO AT THE STATE UNIVERSITY OF ?CrA, l>0'f'A ClTV. WRITTEN IN\nPARTIAL FULFILLMENT FOR HIS MASTER*S DEGREE IN JOURNALISM BY\nDonald E. Brow, the scripts are authentic historically, being based\nON Brown’s RESEARCH IN THE HISTORY OF JOURNALISM IN THE U.S.\nIncidents in the lives of six of the nation*s outstanding editors\nPROVIDE THE DRAMATIC MATERIAL ON WHICH THE SCRIPTS AFE BASED* IN¬\nCLUDED IN THE SERIES WHICH IS BEING BROADCAST CURRENTLY OVER THE\nUniversity's radio station WSUI each Tuesday afternoon and Wednes¬\nday EVENING, ate: (l) *'ThE MOVING ApoEAL,\" DRAMATIZING THE PART\nPLAYED BY BENJAMIN FRANKLIN DILL OF THE MEMPHIS APPEAL IN FURTHERING\nan American free press; (2) \"The Honef>t Crook,\" dealing with\nLincoln Steffens and his battle with Tammany as editor of the New York\nCommercial Advertiser; (?) \"A Chapter in Freedom of the Press,\" fs\nBASF 0 ON THE FAMOUS TRIAL OF JOHN PETER ZeNGERJ \\4J \"THE L*cc StORY\nof tosepn pulitzer\" treats with his early days on the St„ Louis\nPost-Dispatch; (5) \"The Abolitionist Editor,\" concerns the courage\nof the Reverend Elijah Parish Lovejoy, who, in defending his\nObserver presses at Alton, Illinois, gave his life for the cause\nof a free press; and (6) \"The Strange Case of Fremont Older,\" the\nCRUSADING EDITOR OF THE SAN FRANCISCO BULLETIN.\nThe SCRIPTS WERE WRITTEN UNDER THE DIRECTION OF PROFESSOR CHARLES L.\nSanders of the School Journalism at the University. They are being\ncast and put into production by Professor H, Clay Harshbarger of\nthe Department of Speech* while the recording is supervised by\nPno^ESSCn Carl Menzer of the College of Engineering, director of\nStation YSUI —Editor and Publisher (We have hopes of adding scripts\nto NAi£i3 Script Exchange.)\nA£R SPONSORS PUBLICS I ON OF OBFLFR PLAYS\nThe Association for Education by Radio has sponsored the publication\nof Arch Obeler's PLAYS FOR AMERICANS, a collection of the series he\nwrote and produced on Sunday afternoons on the NBC network last\nseason- T|TLEs include \"Johnny Quinn, U.S.N,\", \"Letter at Midnight\",\nand \"Chicago, Germany\"-"
}