{
  "id": "d276-111",
  "text": "■2-\n2o Dr. Herbert Hunsaker, Professor and Assistant Director of the Adult Edu-\ncation Division at Purdue University, (mentioned above).\n3o Dr. Wilma Donohue, Head of the ^.vision of Gerontology at the University\nof Michigan, who is in charge of the annual University of Michigan Geron¬\ntology Conference.\nho Dro Eo Vo Cowdry, President of the International Gerontological Society,\nand Director of the ^vision of Geriatrics at the Washington University\nMedical School, St. Loui3<>\nMr. William Rutherford, Peoria Attorney, who has endowed and financed the\npublication of the Bibliography of Gerontology and QeriatricSo\n60 Dr. Martin Gumpert, author of Lifetime Living.\n7o Mr. Ray Giles, retired business man, author, and editor of McGraw-Hill\npublications in the field of retirement.\n8. Mr. Clark Tibbetts, of the Department of Health, Education and Welfare,\nDivision of Gerontological Research*\n9o Dr. No Wo Shock, Chief, Section on Gerontology, Department of Health, Edu~\ncation and Welfare.\n10o Other specialists in related areas, such as Harry and Bonaro Overstreet,\nand Geriatrics representatives of various medical schools and colleges,\nare suggested as advisors as well in their areas of specialization, as\nneeded.\nllo Foreign scholars in this field, yet to be selected on the advice of the\nabove* (Particularly England should be represented in view of its experi¬\nence with social Legislation.)\n1. Proposed Programs (illustrative: subject to revision):\n1. Introduction to Gerontology--the study of agUig and the later years. Cur¬\nrent research and progress. Illustrations and definition of the importance\nof the problem.\n20 The increasing longevity of man and the problems created by the rising\nnumbers of older people in our society.\n3» The attitudes of other cultures and races toward old age. Historical and\ncontemporary attitudes.\nh. Building a philosophy for growing old and developing understanding, and public\ninterest, in old age as a basic, solvable problem.\n$o Medical aspects of aging. The physiological changes brought about by the\nadvancing years.\n6. The so-called diseases of old ages summary of medical progress in dealing\nwith them."
}