{
  "id": "d276-117",
  "text": "NAEB Headquarters\n111 Gregory Hall\nUrbana, Illinois\nApr... 15, 1956\nIMPORTANT INFORMATION ON \"PRIX ITALIA\" ENTRIES FOR 1956 ' ‘\nThe Prix Italia is an organization originally established by the Radio Televisions\nItalians in I9li7. At the present time its membership consists of seventeen (1?)\ndifferent countriesv These are: Austria, France, Great Britain, Italy, Monaco,\nthe Netherlands, Portugal, Switzerland, Belgium, Germany, Luxemburg, Canada, Ireland,\nJapan and the United States. The United States is represented by the National Asso*\nciation of Educational Broadcasters.\nThe Prix Italia is interested in-the encouragement and promotion of quality radio\nprograms in the areas of music, literature and drama, and documentary broadcasting*\nIn 1956 the United States is a member of the Literature and Drama Jury. No entries\nin this area, therefore, may be made by the United States.\nENTRIES FOR MUSICAL AND DOCUMENTARY ^BROADCASTING\nIn 1956 the United States will enter two (2) musical programs and two (2.) documentary\nbroadcasting programs. The basic requirements for both-types are that thejr be a\nminimum of twenty-five (25) minutes in length and may go as long as eighty-five (85)\nminutes.\nThe musical composition must be \"with words,\" and should make use of the \"electro*\nphonid medium.\" This, therefore, confines musical compositions to such things as\ncantatas, operas, choral works or musical works employing narrators where the nar¬\nration is an Integral part of the music itself. The composition should have been\ncompleted within the past year and should likewise have been broadcast within the\npast yqar for the first ‘time.\nDocumentary broadcasts in the Prix Italia sense refer generally to actuality broad¬\ncasts. The closer the program conforms to the notion of reportage, the greater con¬\nsideration is given to the entry.\nThe prizes that are awarded for the best entries are not inconsiderable and in the\npast have approached the $7,000. mark. The exact figure is never known until the\nactual date of the award because of changes in exchange rates, numbers of countries\nentering, and other intangibles.\nPROCEDURES\nMember stations of the National Association of Educational Broadcasters are encour¬\naged to submit entries in the field of music and documentary broadcasting to NAEBts\nChairman of International Relations, Seymour N. Siegel, at 2500: Municipal Building,\nNew York 7, N.Y., before May 19^6."
}