{
  "id": "d276-17",
  "text": "REPORT OF NAEB ENGINEERING\nCOMMITTEE MEETING\nWashington D.C. May 23-24, 1055\nPresent: B rugger * Holmberg, Ketcham, Kratt, Menzer.\nAbsent: Higgy.\nAlso present were Mr. C.S. Bidlack, NAEB Engineer and Mr. C0M. Braum,\nJCET Engineer.\nThe NAEB Engineering Committee met in the Ambassador Hotel, Washington, D.C.,\nduring the morning and evening of May 23 and during the morning and afternoon of\nMay 24. The afternoon of May 23 was spent inspecting new equipment shown by\nmanufacturers at the NARTB equipment show. A separate report covering new\nequipment is being, submitted. Topics discussed were as follows:\nA. Report of new equipment.\nBo 1955 NAEB Engineering Workshop.\nC. FM multiplex and how it may be ©f use to NAEB.\nDo Improvements in NAEB tape network.\nE. Need for FM daytime test period.\nF. Proposed FCC regulations re harmonic and spurious radiation.\nG. Progress of attempt to get professional recognition and advancement, and\ndiscussion of lack of personnel v wage scales, job classifications, wage\nequalization, etc.\nH. Fuads for visits of TV engineers to other operating stations.\nL Study of NAETB Engineering Committee and future exchanges with this\ncommittee.\nJ. Pool of test equipment.\nK. NAEB network - FM, AM, Line, Microwave, FM Multiplex.\nL. Standards for video recording.\nM. Attendance of engineers at NAEB convention - meetings.\nN. Technical reports and contributions to NAEB Newsletter.\nO. Use of Roster of technical personnel.\nQ. BHF problems.\nA brief report of the discussions, progress and recommendations covering the\nabove list follows:\nA. Report of new equipment: The Committee spent the afternoon of May 23\ninspecting new equipment shown by manufacturers at the NARTB equipment show.\nA report covering such new equipment in being submitted separately. In view of the\nfact that a similar report was submitted two years ago, only newly introduced\nequipment is covered and an attempt made to show how it may be ©f value to\nNAEB members.\nB. 1955 NAEB Engineering Workshop: A report was made by Mr. Bidlack on\nprogress to date. The program structure as well as applications were discussed.\nProgram details were decided and a complete outline is available from Mr. Bidlack.\nIt was thought that more applications from qualified individuals would be received\nbefore June 1. If however, this was not the case, it was suggested that the deadline\nfor applications bo extended until July 1 and efforts made to urge candidates to\napply. It is hoped that a more qualified list of registrants might thereby be\navailable for assignment."
}