{
  "id": "d276-19",
  "text": "Continuous\ntones as indicated below:\n400 cps\nso *\nSO seconds\n10 ”\n100\n10 ”\n200 ”\n10 ”\n500\n10\n1000\n10 ”\n2000 ”\n10 ”\n4000 ”\n10 ”\n5000 ”\n10 ”\n6000 \"\n10 ”\n7000 ”\n10 ”\n10000 ”\n10 ”\n400\n10 ”\n(To chock frequency characteristic)\n50 Record five short pulses of SG0O cps tone one second apart.\nThe start of the fifth pulse will be used as a starting time reference.\nAfter a few seconds silence, record a 8000 cps tone for approximately\n14 minutes followed by another few seconds of silence.\nThen record five more pulses at one second intervals with the start of the\nfifth pulse exactly 15 minutes after the starting time reference noted above,\n(To check timing, flutter and wow)\nIt is thought that if these test tapes can be obtained and analyzed-before masters are\nmade* we can be assured of highest quality results throughout the tape network\noperation, hi case any irregularity is observed, it can be immediately spotted and\ncorrected.\nE0 Need for FM daytime test period: Several member stations, especially those\noperated by public school systems, have expressed the desire ior a daytime test\nperiod, indicating the extreme difficulty of testing during the hours' of. 1:00 - 6:00 am.\nThis matter was discussed and some hesitancy shown to a formal request from the\nNAEB to the FCC for such a special privilege. This because the purpose of the present\ntest period was to reduce interference and such interference could be as objectionable\nfrom educational FM stations as from any others. The matter was referred to\nMr, Braum who contacted the FCC and reported as follows: The FCC will accept\nrequests for special temporary authority to conduct tests of FM transmitters\nduring the daytime hours, and whenever possible such permission will be granted.\nIt was also indicated that authority to conduct these daytime tests might be\ngranted for rather extended periods, but it is advised that the actual time of\nsuch test be limited to possibly 15 minutes before the regular broadcast day and\nthat no more than two sustained frequencies be used during any single test period.\nF. Proposed FCC regulations re harmonic and spurious radiation. This matter\nwas discussed at length and Mr. Braum reported that there was presently\nconsiderable question as to the exact proposed requirements and methods."
}