{
  "id": "d276-41",
  "text": "- 2 -\nThe conference resulted in agreement upon a comprehensive reorganization of present\nagencies in the field designed to build upon the strengths of the present situation a new\nedifice better designed to meet the demands of the future. This proposal will be re¬\nferred to the organizations represented in the conference in anticipation that it can be\napproved by them and put into operation January 1, 1956.\nThe plan involves the following major itemsi\n^° A reorganization of the present Joint Committee on Educational Television.\nThe name of this organization will be changed to ThTJoint Council on Educational Tele-\nvis ion and its membership will be enlarged to make it fully representative of the educa¬\ntional broadcasting movement. Its membership will include, in addition to the present\nmembership, the Educational Television and Radio Center, representative national\ncitizens organizations and such other groups as will make it truly representative. It\nwill serve as the sounding board for the movement, will make such pronouncements as\nare desirable from time to time, will lend support to presentations before the FCC and\notherwise will represent the developing educational television and radio movement in\nWashington and nationally.\n2. The creation of a Policy Committee of this new and reorganized Joint\nCouncil on Educational Television. The Policy Committee will include three ex officio\n(voting) members = -the chairman of the Joint Council on Educational Television, the\nrepresentative of the National Association of Educational Broadcasters and the\nrepresentative of the Educational Television and Radio Center--and two others appointed\nat large and on a rotating basis from tile constituent member s of the Council. It is\nanticipated that the first at-large members will represent land grant college and national\ncitizens interests. This committee will have full responsibility for the determination\nof policy, the definition of functions, the approval of budget and the appointment of staff\nto the Washington office mentioned under (3) below. It will be the duty of this committee\nto determine not only what functions are to be served and what services performed by\nthe Washington office, but also to decide which functions and services now performed\nby any Washington agency might better be cared for by one of the other operating\nagencies in the field. The committee will determine what is required in the Washington\noffice to meet the needs of all interested parties including the stations, the NAEB, the\nCenter and the public. The committee will do everything possible to interpret the\nmovement to the public. The committee will approve the budget of the Washington office\nincluding support for the Joint Council and will make presentations to the proper agencies\nfor funds in support of this operation. This committee will also be charged with the\nresponsibility of a continuing review of general policies in educational broadcasting and\nwill arrange for such studies as are essential to this end. The chairman of the Joint\nCouncil will serve as chairman of the Policy Committee.\nThe creation of a single, unified Washington office. All present Washington\noperations of the five groups participating in this decision will be closed as of December 31,\n1955. This does not mean that either the National Citizens Committee on Educational\nTelevision or the Committee on Television of the American Council on Education will be\ndissolved, but only that if either does continue it will do so within the framework of the\nbasic decisions announced in this document. In their place there will be created by the"
}