{
  "id": "d276-44",
  "text": "NAEB Headquarters\nIh Gregory Hall\nUrbana, Illinois\nTO: All School Stations\nFROM: Network Headquarters, H. J. Skornia\nDATE: September lU, 1955\nBy Board action a special Network assessment rate is now available to School sta¬\ntions. For one-half the rate normally charged for the full general network service,\nsuch stations are now eligible to receive the In-School series offerings of the NAEB\nRadio Network, plus a maximum of one hour per week selected from the general offer¬\nings. For example, a school station whose regular Network assessment is now .f800.00\nper year (but which has been unable to use the full service and thus had difficulty\nin justifying payment of the full rate) may now subscribe for $U00.00 per year in¬\nstead. For this latter sum the entire In-School service may be ordered, plus one\nhour per week of \"non-in-school\" programs.\nIt is of course our hope that as many as possible of you will take the full service.\nPlease let us know, on the chart below, which service you elect, and, if you have\nalready paid the full fee and now select the reduced service, how you wish to have\nyour overpayment handled.\nStation_City __\nPower Address\nReport by\nDo you wish to continue the regular service (if so check here___) or to take\nonly the half-rate service outlined above (check here_)?\nDo you wish to have your overpayment, if any refunded (if so check here_),\nor credited to next year*s account (in this case, check here )?\nIf you have not paid, or wish to join or rejoin the Network, and wish to have a\n(new) bill issued, please check here (_). (Information on available series will\nbe sent immediately on receipt of this form).\nIf you elect this special school service schedule, which of the regular series\ndo you wish to receive\n(if you have been receiving more than oneniourweelcly of regular programs, and elect\nthe new rate, all but one hour of regular programming will be immediately discontin¬\nued. However, there will be no charge for programs you»ve already received.)"
}