{
  "id": "d276-60",
  "text": "DOCUMENT A * Appendix:\nHere are the pros and cons listed by some of you in correspondence, passed along in\none way or another by others* If I miss any, please forgive me* I am listing all I\ncan find, all I can think of that have been advanced in earlier times. One thing I\ndo hope, for good of NAEB, is that we consider all of the proposals objectively,\ndispassionately....that we arrive at some conclusions by vote at the convention...\nthat whatever the vote is at the convention, we abide by said decision, say for one\nyear at least. If I have failed to list any major proposal, I apologize. I have not\ndone so intentionally. I have no objections to the convention considering other\nchanges, but I would like to know as far in advance as possible. And, such consider¬\nation ivill require unanimous consent for consideration. For good and valid proposals,\nI'm sure we can get it. Now, after you have studied proposals, if you have questions,\ncomments, and jet-propelled criticisms, I'll welcome them. Here goes me:\nRe: Proposals A. B. and C. PRO: (l) Present name does not indicate\nenough the inclusion of both radio and television broadcasters. (2) NAEB has been\nused by National Association of Educational Buyers since 1920.\nCON: (l) NAEB has been used for years.\n(2) NAEBroadcasters includes both radio broadcasting and television broadcasting, see\nWebster for broadcasting. (3) It isn't the name that counts anyhow. It's what we\nare and do and stand for.\nRe: Proposal D. PRO: (l) A more equitable voting system should be worked\nout. This does it. It provides for voting, based upon extent of service given.\n(2) It provides for voting regulations of institutions having three or more stations\nby limiting voting power to three.\nCON: (l) It further confuses voting methods. (2) What's\nwrong with present method, or the old one of one vote each.\nRe: Proposal E. PRO: (l) This gives the Associate Member a vote as well\nas a voice. (2) Associate Members should have a vote because of their mutual inter¬\nest, mutual efforts in education by radio and television.\nCON: (l) Associates have a voice, they don't need a\nvote. (2) Adoption of Proposal \"I\" will give the Associate Members real representa¬\ntion, a better voice than voting on all business matters.\nRe: Proposal F. PRO: (l) Simply makes section consistent with possible\naction on Proposal E.\nCON: (1) Hear I a Con?\nRe: Proposal G. PRO: (l) We need more than six regions, but there should\nbe some limit. (2) Right now, Region Six (or District VI) feels it is too large,\nand not as workable as if it were divided, or re-districted. The limit of six makes\nit difficult for Board to adjust because presently Board can create only six\nregions (districts).\nCON: (l) Board will be getting too big.\nRe: Proposal H. PRO: (l) This simply provides for actives or associates\nto hold office and indicates terms for Directors and years of election."
}