{
  "id": "d276-70",
  "text": "THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n19$$ TELEVISION ENGINEERING WORKSHOP\nCOMMENTS\nHWSC---\nMay I preface ny remarks with the statement that academically I have done aa much\nwork in the field of Education as in the field of Engineering,, I also have ap¬\nproximately seven years in teaching experience. I canat help but view the TV\nengineering workshop with both the viewpoint of an engineer and an educator*\n1c % primary objective in attending the conference was to learn as much as pos¬\nsible about kine recording and the associated problems connected therewith» I\ncan truthfully state that I learned a lot, (Donet ask me for a ten word defini¬\ntion of gamma,) It became increasingly evident that this is a big field in it¬\nself and can best be studied with the actual equipment on hand. The importance\nof proper lighting had hitherto been only on the edge of my consciousness. It\nhas now been brought into sharp focus and although we have an excellent studio\nfacility and lighting grid system, which we wouldn?t trade for WKAR-TV^s, we\nhavenat any dimmers. I now realise that it would be almost ridiculous to embark\non a quality kina recording program for statewide distribution under these condi¬\ntion s0\nFortunately the use of the demonstration technique was used more in this field,\nat the conference than in any of the other fields.\n2o I will lump points 1, 3, and k on your suggestion sheet*\nFrom an educational standpoint, the man who said that this was not a true work¬\nshop was absolutely correct* It would be better to call it a conference* Per¬\nhaps a conference is what it should be* To make it real workshop would be a real\nproblem and maybe not even possible.\nOn the premise that a true workshop were desirable and possible with respect to\navailability of funds and resource persons, I would like to suggest the follow¬\ning o\nNot everybody is primarily interested in the same things* Neither are they\nat the same level of experience and understanding* Going to a conference\nor workshop of this kind is not unlike reading an issue of Electronics\nmagazine, A few articles are of prime interest, some are of secondary\ninterest, others are of no interest at all.\nSo, it would be desirable to have an elementary section and an advanced\nsection of the group* Also it would be nice to have two or three fields\nof activity in operation simultaneously thus giving the participant a\nselection to fit his particular interests and needs and allow him to re¬\nject that which doesn«t particularly concern him* This procedure will\nbreak the group down to smaller groups and thus alleviate the problem\nof large groups actually operating limited equipment* It will also pro¬\nvide more individual attention. Placing people with other people on\ntheir own level will cause more individual participation* In our group\nthis year we all knew where the brains and experience were but many\npeople did not enter into any of the discussions because they were afraid"
}