{
  "id": "d276-76",
  "text": "-7-\n*'##**#■**■&*\nWGBH-HMV—\nI have just returned to Boston from the Second NAEB TV Engineering Workshop and\nwish to express my appreciation to the NAEB, yourself, and the personnel of\nWKAR-TV for a most pleasant and valuable week*\nIt is very difficult to suggest an improvement in the setup or organization of\nthe Workshop, with the exception of minor details such as better location of\nmonitors and such small items* I do not think that it would be possible or\nadvisable to try to operate the equipment with such a large group, since most\nof them already have equipment of their own*\nIn addition to the technical information supplied by the speakers, the course\nwas most valuable in enabling the Chief Engineers of the various stations to meet\neach other and swap ideas and experiences, and it is ny earnest hope that an\neffort will be made to make this an annual affair. Another valued result from\nthis Workshop was to bring to the attention of all concerned that the NAEB Engi¬\nneering Service is there and ready to help* This is not always realized by some\nof us who do not have too dose contact*\nArthur Wo Richardson\n*********'*\nMemphis Community TV Foundation--\nThis member wishes to report the following as per your request*\nlo No suggested change in set-up or organization. This member feels the workshop\nwas extremely well planned and organized*\n2o This member expected to receive the value of meeting with other engineers in\nthe educational television field and exchanging information* This was accom^\nplished,\n3, This member realizes that in a period as short as four and one-half deys,\nthere is not ample time for twenty-five people to operate equipment*\niic This member feels that the entire workshop was a great success* The workshop\nwas well planned, organized, and executed. All was accomplished in as short\na time as could possibly be expected. The program was excellent*\n5* This member wishes to express his appreciation for the present NAEB Engineering\nservice. The workshop is invaluable* The newsletter is a great help In keep¬\ning members informed. It is suggested that an availability sheet for both\nequipment and personnel be incorporated in the newsletter. Many of us are in\nthe market for competent engineers and good used equipment* Perhaps some mem¬\nber or non-members have a surplus of equipment or personnel available; if so\nwe would like to know*\nIt Is further suggested the regional workshops be seVup if possible, This\nwould be accomplished at greater frequency than the national workshop * Per¬\nhaps members in the lower echelon could be revolved which would give them a\nchance to clear information which would in turn make them feel part of the\nscheme and make them better engineers. This would also give the other par¬\nticipating members a feeling of belonging* A regional workshop of this type"
}