{
  "id": "d276-81",
  "text": "=*12=\nof equipment that each of us would like to see and discuss* An excellent way to achieve\nthis would be to overlap the NAEB Television Engineering \"convention” with a portion\nof the NARTB Convention*\nOne other area that could possibly be modified is transmitters 9 Those who have closed\ncircuit operations and donft intend to go on the air* are not interested in the problems\nof transmitters* Those who are on the air are not concerned with Ob problems of ob¬\ntaining construction permits, proof of performance measurements etc* Only those who\nplan to go on the air in the near future have much interest in these problems. There¬\nfore it might be better to devote this time to problems of general interest0\nOur expectations were more than fulfilled, particularly in the field of kinescope re¬\ncording« The wealth of information presented in the sessions on light, lighting, kine¬\nscope recorder operation, and film characteristics and processing, provided us with\nanswers to many of our problemsc For example: knowing nothing about lighting, we took\nthe word of the production people as God* Some of our sets we*re sure had in excess\n300 foot candles of base lights One show that we tried to kinescope had a contrast\nratio far in excess of the recommended 20-1 a The difficulties encountered we attrib¬\nuted tofanlty kinescope operations\nAs far as operation of equipment is concerned, we do not feel that it would contribute\nmuch to the Workshop, It would take considerable time, and few of us would gain much\nby pushing cameras, or twiddling beam current controls* Specific procedures such as\nsetting up a kinescope recorder could better be handled by the NAEB Engineering Serv¬\nice at individual stations—possibly training aids such as tape lectures with slides\ncould be prepared to assist in developing operating techniques.\nMuch information was presented in the field of kinescope recording* This undoubtedly\nwill show in the future in the form of better kinescopes* However, much is left to be\ndone in this field* For example, the kinescope shown by Jim Johnson of W0I-TV was far\nsuperior to any shown by Mr* DsLand. The new Eastman 737k film coupled with the tech¬\nnique of aperature correction seems to make possible film quality in excess of the capa¬\nbilities of film pickup systems* For any type of film used in kinescope recording there\nare optimum negative and positive process gammas. These are dictated by the maximum\nlight output and linearity of the kinescope tube, and the linearity and sensitivity\nof the films used. At present there are as many standards as there are kinescoping\nunits, and to send a negative to a lab with the instructions \"print for best picture”\nleaves much to be desired* To obtain not just acceptable kinescopes, but top quality\nones requires that these optimum characteristics be determined* It remains as a chal¬\nlenge to us to arrive at and specify these standards*\nOf great value at both of the NAEB Television Engineering Workshops has been the\nopportunity to get together on an informal basis with other members of the Work¬\nshop, and with technical representatives* At these \"bull sessions\" many ideas\nhave been discussed and evaluated. Some of these ideas will be tried and better\nkinescopes, better film pickup techniques, or better camera operation may be the\nresult. It would be of great value to get together more often to further this\nexchange of ideas. One proposal is that we organize area workshops mid-way\nbetween the regular workshops. This would have several advantages. By confining\nit to smaller areas, for example—Minnesota, Wisconsin, Illinois, and Iowa—\ntransportation costs could be lessened, the number of people from each station\ncould be increased, and many ideas would be obtained from seeing other operating\nunits. These workshops could also be held in areas where no educational insti¬\ntutions are, but where items of general interest are, such as the new Vita-Scan\nunit in Milwaukee. John KLindworth indicated that ha would be happy to"
}