{
  "id": "d276-89",
  "text": "-17-\n\"Cy\" Braum has sent us a copy of the \"Federal Register\" of December 9 (Vol. 20,\nNo, 239) which includes the AM,FM and TV rules and Engineering Standards up-to-date\nas of November 3. Copies are available from the Superintendent of Documents, U.S.\nGovernment Printing Office, Washington 25, D. C, for twenty-five cents (25$) each.\nThis publication is one that each Chief Engineer of an AM, FM or TV station should\nhave since it contains Part 3 of the FCC's Rules and Regulations covering all Broad¬\ncast Services and also Standards of Good Engineering Practice of Standard Broadcast\nStations. This revision is effective January 2, 1956. These rules will of course\nbe reprinted in the usual FCC rule format and will be available from the Govern¬\nment Printing Office; however, at this time no date has been set.\nAll those considering applying for any class of broadcast license should also have\nthe above material since necessary procedures for applications are outlined therein.\n***\nThe FCC has also proposed rule making on an approved CONELRAD Plan for Noncommercial\nEducational FM and the International FM Services. This is outlined in Public\nNotice 25602 which may be secured by writing to the FCC requesting same.\n/*##\nSWAP SHOP\nElmer G. Sulzer, Director of Radio and TV Communications, Indiana University\n(Bloomington) would like to purchase a Western Electric 618 dynamic microphone.\nSince this type of microphone was discontinued a number of years ago, Sulzer would\nappreciate any word you might have about one being available.\nj\nNorman E. C. Maill, VPI Motion Picture Unit Manager has the following \"slightly\nused,\" since July 1955, Bell and Howell camera equipment for sale. He states the\nequipment is in \"excellent condition haveing had very little use to date. The\nusual B & H guarantee will go with it.\"\n/\nThe equipment for sale consists of two outfits each with:\n1 - 16mm Bell and Howell 70DH with single frame attachment; o.7\", f2.5. Super\nComat lens; 1\", fl.4, Cooke Ivotal lens; 2.8\", f2.3 Cooke Pancrotal lens;\nall with matching objective viewfinders.\n1 - Bell and Howell 115 volt, 60 cy., 0.9 amp. 24fps cyncronous motor.\n2 - Bell and Howell 4001 2 magazines.\n1 - Bell and Howell case which holds the camera, motor, 2 magazines and acces¬\nsories.\nWe can sell these outfits for $1300 each, plus shipping and insurance costs.\nIf you are interested please contact Mr. Maill directly at Virginia Polytechnic\nInstitute, Radio-Motion Picture-Television Service, Blacksburg, Virginia."
}