{
  "id": "d1456-2",
  "text": "page 3\nNAEB NEWS LETTER...Jan. 1, 1940\nwide band frequency modulated signals of equal fidelity,,\n2. Amplitude modulation may be used on all frequencies through¬\nout the radio spectrum, whereas frequency modulation has proven use¬\nful only in the very high frequency bands.\n3. Amplitude modulation is the only system which has been used\nsuccessfully for television on the frequencies allocated by the\nCommission for television service,\nfeoaaanay Motalafr.on\n1. Frequency modulation possesses characteristics whereby it\nis possible to reduce the effects of all kinds of disturbances in¬\ncluding atmospheric static, electrical noises, arid background signal\ninterference*\n3. k frequency issouulatcd broadcast station employing low power\nwill provide greater service than a similar station using amplitude\nmodulation. However, if the power of the two stations is substan¬\ntially increased the percentage increase in service area of the\nfrequency modulated signal will be materially reduced,\n3, A frequency modulated reoeiver will accept only the strongest\nsignal or noise as the case may be when the ratio of the desired to\nunde sired signal strength la approximately 2 to 1. In the case of\namplitude modulation, the ratio must be at least 20 to 1 for good\nbroadcast service. Consequently, it is possible to operate frequency\nmodulated stations at relatively close geographical locations without\ninterference,\n4, Frequency modulation has definite advantages over amplitude\nmodulation in operating the low power services such ae forestry,\npolice, aircraft, etc. In such cases, each system is under the _\ncontrol of one licensee who can plan for the purchase, installation\nand operation of the entire transmitting and receiving system.\nShouldnU NAEB be represented at that meeting? What do you think?\nVSlio will volunteer? Should we have legal representation?\nBiaELiBLMi\nHere»s news from KWSC, State College of Washington, Pullman, Washington\nMo Reid White, Production Director and £AEb Vice-President writes\nthat on December 5, KWSb was granted modification of licence to in¬\ncrease night power from one XW to five KV, In other word®, wo now\nhave five thousand watts power night and day."
}