{
  "id": "d1456-5",
  "text": "NAEB MEWS LETTER., ..Jan. 1, 1940......page 6\n\"The World of the Folk Song\" is the title of the January 11th\nprogram which presents Professor Roy Mitchell of New York University\nand his unique vocal group \"The Consort\". They collect and sing\nballads of weavers, tailors, plowmen, waggoners, and other folk\nsongs that have been handed down from generation to generation\nonly by word £ mouth. u\nOther broadcasts will be conducted by Sarat Lahiri, noted as a\ncomposer, singer, and teacher of Hindu Music; A. W0 Binder, Professor\n°f Liturgical Music at the Jewish Institute of Religion and an\nauthority on Hebrew sym ... . and folk music; Elsie Houston, singer\noi Brazilian and other South American Songs; Dr. Wei, Professor of\nMusic at Shanghai University, recognized as the world*s foremost\nperformer of ancient Chinese instruments.\n. MESSAGE TO ALL STATIONS\nIn a letter to all stations on December 7th, Ed Kirby, director of\nPublic Relations for the National Association of Broadcasters, has\nsome comments worthy of special note. The first few paragraphs\nare produced here;\nTOE RADIO INDUSTRY* 3 NEXT MAJOR SELLING JOB\nTOe radio industry has sold millions of people millions of things.\nAnd, despite rumors to the contrary, It has sold Itself to millions\nof listeners, even though the majority of listeners perhaps donft\nknow itJ\nAfter all, people are people, and think mostly in terras of favorite\nradio personalities nd favorite programs when they think of radio.\nv?!?yt,do no^ ir *crn;s of the American System of Broadcasting\nwhich makes it nossi le for them to herr these programs on schedule.\naround the clock, day after day.\nWhat radio needs to do, then, is to re** awaken the sleeping loyalty\nqj listeners, for American radio is going through one of its most\ntrying periods 2\nThere is, at the moment, no need for undue alarm. But for a variety\nof reasons, there does exist an urgent need for the widest possible\nunderstanding of radio by the greatest number of listeners."
}