{
  "id": "d1374-1",
  "text": "N A E\n«N\nEngineering\nNewsletter\n-V\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 Gregory Hall\nUrbana, Illinois\nPhone 7-6611, Ext. 3394\nPHASE, AMPLITUDE and APERTURE CORRECTION IN TELEVISION SYSTEMS *\nby\nE. D. Goodale\nNational Broadcasting Company\nIf there has been some phase distortion in a system caused by a curvature of\nthe overall phase characteristic away from the frequency axis, then the output\npulse will have an overshoot on the edges after the transition. The slope of the\nphase curve or the time of transmission of the various frequency components of the\nsignal gets greater as the frequency increases. This results in a dissymmetry\nabout an abrupt transition which contains high-frequency components. If the over¬\nall phase characteristic of the system has curvature towards the frequency axis,\nthen the output pulse will have an undershoot, sometimes called an anticipatory\ntransient before the transition. The slope of the phase curve or the time of\ntransmission of the various frequency components of the signal gets smaller\nas the frequency increases. This likewise results in a dissymmetry about an abrupt\ntransition but on opposite corners of the pulse. It is these dissymmetries about\nan abrupt transition that indicate the presence of phase distortion and give a\nclue to the nature of the correction required to compensate for it.\nIdeally, an \"Amplitude Booster\" without phase shift is required for aperture\ncorrection. Such a practical circuit is shown. It comprises a phase correcting\nsection and a couple of cathode peaked amplifier stages. The overall amplitude\nand square-wave responses of such a circuit are shown in Figure 1. Curve A shows\nthe normal response of the unit with no boosting action. Curves B, C, and D are\nthe responses for different amounts of high frequency rise. The accompanying\neffects on a pulse are shown in the photographs with the corresponding letters.\nThese response measurements were made after adjusting the phase controls to give\na reasonable symmetrical transition to the edges of a 100 kc square-wave pulse\nhaving a rise time of approximately .10 micro-second. It should be carefully noted\nthat in this case there are approximately equal under shoots and over shoots on\nan abrupt transition. Exact symmetry would indicate a linear overall phase charac¬\nteristic for the corrector. If the incoming signal has a loss of high frequency\ndetail without phase shift, which is the theoretical result of scanning with a\nfinite spot size, then these units should restore a part of such loss and improve\nfine detail contrast.\n*This is a resume of a paper delivered in April 1952 before the Cincinnati Section\nof the Institute of Radio Engineers by Mr. Goodale, Manager of Engineering Develop¬\nment at NBC. It is being duplicated with his permission. The resume was prepared\nby Keith K. Ketcham, Chief Engineer, WOI-AM-FM-TV at Ames, Iowa."
}