{
  "id": "d1173-0",
  "text": "NEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 29, NO. 10 OCTOBER, 1964\nNER - ETS - ECS - NERN - ????????\nThis pre-convention time seems a good one to recap some of\nthe alphabetization that has been going on within the NAEB\nlately.\nReaders will recall that at last year’s convention voting\nmembers approved a reorganization of the NAEB, setting\nup four semi-autonomous divisions: Individual Member, Radio\nStation, Television Station, and Instructional. (Members of\neach division then elected their own six-man board of di¬\nrectors to run the affairs of the division. These boards,\nplus the NAEB president and one representative elected by\nthe NAEB Institutional Affiliate members, constitute the\nNAEB Board of Directors.)\nDuring the year, both the Radio and Television divisions\nestablished administrative offices at NAEB headquarters in\nWashington, D.C. These divisions also sought names for\nthemselves that would be more descriptive of their specific\nfunctions than would be “The — Division of the NAEB.”\nTherein, perhaps, lies a certain amount of confusion for the\nreader who is not a member of one of those divisions. The\nfollowing is an attempt to clarify things:\n• ETS stands for Educational Television Stations—the TV\nDivision of the NAEB. C. Scott Fletcher is president of\nETS, and Gerard L. Appy is vice president.\n• NER stands for National Educational Radio—the Radio\nDivision of the NAEB. Jerrold Sandler is executive director\nof NER, and John P. Witherspoon is associate director.\n• NERN stands for National Educational Radio Network—■\nthe NAEB’s radio tape network, formerly called the NAEB\nRadio Network. Robert E. Underwood, Jr., is the NERN\nmanager, with offices in Urbana.\n• ECS stands for Educational Communications System—a\nplan for nationwide electronic interconnection of educational\ninstitutions. In addition to a nationwide live educational radio\nnetwork, the system would allow c>ther communications serv¬\nices such as the sharing of faculty and instructional resources,\ncooperative research efforts, rapid collection and exchange of\ninformation and technical data, cooperative use of computers,\netc. The NAEB is studying ECS implications and implemen¬\ntation under a contract from the U. S. Office of Education.\nJames A. Fellows, assistant to the NAEB president, is di¬\nrecting the project.\n\"NAEB History\" To Be Updated\nW. Wayne Alford, graduate student at George Peabody Col¬\nlege, is researching NAEB events since 1954, to bring the his¬\ntory up-to-date. Material which readers feel might be relevant\nto the study should be sent to him at 1503 - 17th Avenue\nSouth, Nashville, Tennessee, 37212.\nThe only printed history of the NAEB available is that\nwritten by Harold Hill, which takes it from the organiza¬\ntion’s beginning to 1954.\nConvention Phone Number: GReenwood 6-3455\nNAEB conventioneers in Austin will have the services of a\nMessage Center provided by the Southwest Bell Telephone\nCompany. This will be the best way for home offices to\nreach anyone at the convention during the hours 8:30 a.m.\nto 5 :30 p.m. The number is GReenwood 6-3455 (Area Code\n512).\nNorwood Elected to Radio Board\nMembers of the NAEB Radio Board have elected Frank W.\nNorwood, manager, KEBS (FM), San Diego State College,\nto the post vacated by John Witherspoon when he was ap¬\npointed associate director of the Radio Division.\nBronson Heads Individual Members\nAlbert P. Fredette, chairman of the Individual Member Divi¬\nsion Board, has announced the appointment of Vernon Bron¬\nson as executive director of the Individual Member Division.\nBronson will continue as director of the NAEB Office of\nResearch and Development, a post he has filled since the of¬\nfice was established.\nLudwig to Join NAEB Staff\nCoy Ludwig, executive secretary of the Empire State FM\nSchool of the Air, has been appointed assistant director of the\nNAEB Office of Research and Development. He is expected\nto join the NAEB staff in Washington about mid-October.\nLudwig replaces James A. Fellows, who has been named as¬\nsistant to the NAEB president.\nNAEB Receives Grants from NHLF\nGrants to the NAEB from the National Home Library Foun¬\ndation, Washington, D.C., were announced last month. The\nfunds will be used by the radio division for creative program\nproduction, and by the TV division for a national TV program\nexchange library service.\n• The grant for NAEB-ETS is for $35,000 in 1964-65,\n$25,000 in 1965-66, and $20,000 in 1966-67. There is a stipula¬\ntion that the funds for the latter two years must be matched.\nThe program library will make available to ETV stations se¬\nlected noncredit programs and series. ETS hopes to have the\nlibrary located by the early part of 1965. Universities and\nother educational institutions are invited to express their in¬\nterest in providing a location for the library and in operating\nthe service.\n• NAEB-NER has $8,000 earmarked for creative radio pro¬\ngrams. NER stations have been invited to submit proposals by\nOctober 10, with contracts to be awarded on or about Novem¬\nber 15.\n1"
}