{
  "id": "d1173-9",
  "text": "-10-\n\"We are of the opinion that your organization can render a valuable service to edu¬\ncational broadcasting by drawing on the wealth of experience of your members. If\nyour organization sees fit, we will appreciate having a committee appointed from your\nmembership to cooperate with us in collecting and evaluating data on methods of in¬\nstruction by radio.”\nOn the morning of October 28 I sent the following reply to Miss Goodykoontz:\nMiss Bess Goodykoontz\nActing Commissioner of Education\nWashington, D. C*\nDear Miss Goodykoontz:\nI have just received your letter of October 20, and before getting in touch with the\nother members and officers of the Association of College and University Broadcasting\nStations, I am quite certain that all of the members will be pleased to assist the\nUnited States Office of Education in any way possible in the preparation of a publi¬\ncation on the methods of instruction by radio. Within the next few days I shall send\na bulletin to the members of the Association, quoting your letter and making sugges¬\ntions as to thoir participation in the collection of these materials, I will be\npleased to have you keep in touch with me and offer any suggestions you care to make\nfrom time to time. I feel that by the end of this season the Association will have\nbeen in a position to serve you in this capacity.\nSincerely yours\nT. M. Begird, Executive Secretary\n(NOTE: It appeals to me that every station holding membership in the Association can\nsupply the Commissioner of Education with excellent materials that will help in the\npreparation of a publication on the methods of instruction by radio. I will appreci¬\nate it if each station director will write her at the Washington, D. C., office and\nwill also appreciate having carbons of the letters sent to my office relative to this\nmatter.)\nFROM MR, D. LEMASURIER, MANAGER, STATION KFJM, GRAND FORKS, NORTH DAKOTA: MI regret\nthe delay in answering your letter of- September 30, but I do not believe what infor¬\nmation we have to offer will be of any value to you,\n\"The only radio dramas we have broadcast were a sories of detective stories written\nfor the Street and Smith Detective Story hour on the CBS. At this writing we are\npresenting weekly 1/4-hour mystery plays furnished gratis by ’Startling Detective\nAdvantures’ magazine, of Minneapolis,\n\"You may be interested to know that Ida Mitchol Roff, 2560 Eaton Avenue, Cincinnati,\nOhio, has a sories of dramatized Bible Stories, thirty minutes each, casts of from\nfive to seven, costing $3,00 per episode.\"\nFROM MR. GARLAND POWELL, DIRECTOR OF STATION WRUF, UNIVERSITY OF FLORIDA, GAINESVILLE:\n\"Your letter of September 30th was called to my attention upon returning to this office,\nI was very glad indeed to hear from you.\n\"Y*e used last year several one-act plays that were given by the University Dramatic\nClub, the names of which I do not recall; however, I am sure of this, that there were\nno royalties on them.\n\"The best source for the information you desire is'Mrs. Amondn H, Barnes,. Fort Lauder¬\ndale Placers, Fort Lauderdale, Florida,\n\"If I can help you in any way please advise.\""
}