{
  "id": "d943-85",
  "text": "19\nMiss Girling then described a number of non-dramatic formats which had\nproved highly successful on the Minnesota School of the Air, such as\ninterviews with prominent personages, speaking not on their specialties\nbut on general topics in which they had vital interest: Eddie Cantor on\nbrotherhood; Gene Autry on citizenship; Ralph Bunche as a living voice\nof living history. She described the use of students on subjects on\nwhich they were expert panelists, from baby sitting to eighteen-year\nold voting, and paid tribute to the effectiveness of tape recorders\nused in the field to get important citizens to talk about things other\nthan their professions. As examples, she mentioned a priest speaking\non housing and the Governor of the state speaking on religion. In each\ncase, the eminence of the person lent authority; the fact that he was\nspeaking on something not in his own field of specialization but some¬\nthing about which he felt very keenly lent added impact.\nk) In short, the writer should start with a goal, with an idea, with a\npurpose. Then he can determine whose life story or what experience\ncan bring out that idea, accomplish that purpose, provide the flesh\nand blood. Only then should the writer determine what format will fit\nbest, whether it be drama, historical drama or biography, interview or\ndocumentary.\nFinally Miss Girling considered the problem of gearing this type of broad¬\ncasting to the curriculum. A social studies series, beamed to the hth through\nthe 9th grades, provided in the teachers* handbook a set of questions which could\nbe selected by the teacher, with a number of them used at the various grade levels\nIn general, Miss Girling felt that a university-operated station, broadcasting\nto the school systems of many cities, could not be too specific in linking a se¬\nries with the work covered in a given grade. \"If we motivate, enrich, give back¬\nground; if we bring into the classroom material which teachers cannot gst in any other"
}