{
  "id": "d1783-3",
  "text": "-4-\npayment of some sort of token fee. The matter has now been referred to the Board\nof Directors who will consider it at their meeting in Columbus May 2. Comments,\nincorporating the views expressed by the two committees and the Board will then\nbe prepared and filed prior to the May 16 deadline.\nNEWS FROM FCC RESEARCH & EDUCATION DIVISION\nThe new Research and Education Division of the FCC is currently pressing\nto get FCC forms for educational broadcasting revised. Currently, although there\nare special forms for educational FM radio, ETV stations and applicants must use\nthe same forms used by commercial stations. The plan is to combine these, for\neducational use, so that educational radio and TV stations will use forms designed\nspecifically for their purposes. Forms being revised are for CP application,\nlicense application, license renewal, financial report, and statement of ownership.\nThe Division is establishing liaison with the Department of Health,\nEducation and Welfare in line with the Federal aid to ETV bill (see text of bill\nabove).\nA new booklet is being prepared by the Division which they hope will explain,\nin simplified form, the specific procedures for ETV applicants for licenses to\nfollow.\nFCC TO CONSIDER PROGRAMMING SERVICE IN ROCHESTER, N.Y., HEARINGS\nOn April 12, the FCC granted petition by Rochester Area ETV Assn, to\nextent of enlarging issues in Rochester Channel 13 comparative proceeding to con¬\nsider programming service proposed in each of the applications considered in the\nlight of (l) whether there are particular types or classes of programs for which\nthere is an unfulfilled need in the area proposed to be served, and (2) extent to\nwhich the program proposal of each applicant would meet such needs.\nADDITIONAL ETV CHANNEL ASKED FOR WISCONSIN\nOn March 23, the Wisconsin Citizen’s Committee for Educational Television,\nInc., Madison, Wisconsin, filed a petition with the FCC requesting an amendment\nto the rules so as to reserve Channel 9 for educational television use in Central\nWisconsin.\nMISCELLANEOUS FCC ACTIONS\nOn March 30> waived Sec. 3*6-13 of the rules and granted modification of CP\nto WEGA-TV (Georgia State Board of Education, Savannah) to make changes in antenna\nsystem, equipment, change transmitter and studio location to 0.8 miles NNE of\nPembroke, Ga.; ERP V-3l6 lew, A-I58 kw; antenna height 1,040 feet.\nOn April 5, granted renewal of licenses to the following educational\nstations: KETC, St. Louis ETV Commission; WMUK (FM), Western Michigan University,\nKalamazoo; WSUI, State University of Iowa, Iowa City.\nOn April 6, granted extension of completion date to Oct. 8, to San Francisco\nTheological Seminary, San Francisco, Calif., for educational FM station KXKX."
}