{
  "id": "d1450-0",
  "text": "1\nN\nA\nE\n5]\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL URBANA, ILLINOIS\nCOMMERCIAL STATION OFFERS ONE-HALF-\nMILLION-DOLLAR SIFT FOR ETV\nA gift of one-half-million dollars worth of equipment\nfor a proposed ETV station has been offered to the\nMohawk-Hudson Council on Educational Television,\nSchenectady, N. Y. by the Van Curler Broadcasting\nCorp., operator of WTRI and UHF Channel 35.\nThe offer is contingent upon action by the FCC\nto assign all commercial stations in the Schenectad'y-\nAlbany-Troy area to VHF channels and upon favor¬\nable action on a proposal to maintain two UHF\nchannels in the area for educational use.\nThe FCC, which proposed that commercial sta¬\ntions now on UHF switch to VHF, planned to assign\nthe UHF channels elsewhere. A petition by the\nCouncil has requested the retention of two UHF\nchannels in the area.\nThe offered equipment consists of transmitting\nfacilities, tower, antenna, buildings and land.\nVacation schedule pressures have prevented Pre¬\nsident Paulu from submitting his monthly column\nfor this issue. The column will be continued in the\nOctober Newsletter.\nMEMO FROM THE EXECUTIVE DIRECTOR\n—Harry Skornia\nYes; thank you; I had a fine vacation during\nJuly. Fishing, swimming, a little writing and just\nplain “lying around.” I’ve come back with renewed\nenergy, enthusiam and eagerness to make this a\nbanner year.\nOn August 7 and 8 the Research Committee met\nin Chicago to plan the NAEB Seminar to be held\n(with Kellogg Funds) at Ohio State. This is now\ntentatively scheduled for December. All actives and\nNAEB Newsletter\nVol. XXII, No. 9\nSeptember, 1957\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14\nGregory Hall, Urbana, III., $5 a year, edited by Hans J.\nMassaquoi.\nassociates have already received questionnaires to as¬\nsist in planning this. If you haven’t already returned\nthem — please do.\nOut of this Seminar, and present planning of\nthe Committee, chaired by Raymond Cheydleur,\nshould come a level and volume of research activity\nwhich U.S. educators and educational broadcasters\nhave long needed. We have high hopes and big plans.\nBy the time you read this, the ETV Management\nSeminar (with Ford Funds) will have been held\nat Allerton House. This promises to be a lively and\nimportant session and will be reported on as soon\nas possible in the Newsletter.\nI personally expect to have left by August 23\nfor Alaska where (with John Groller, Dr. Louis\nEvans and Fred Palmer from “The States”) I shall\nbe doing my best to help the All Alaska Presby¬\nterian Conference in plans for better religious as\nwell as educational uses of radio and television in\ntheir mission work. I’ve spent a lot of time on\nthis, writing my addresses while in Northern Mich¬\nigan, because I’m deeply interested in this subject\nas well as in the work of the Board of National\nMissions of the Presbyterian Church, and the church\ngenerally. On this too, I shall hope to have a report\nat a later date.\nMeanwhile, plans move forward for other com¬\nmittee meetings, seminars and workshops to be held\nduring the year; for the convention about which\nyou’ll be hearing more and more from Marguerite\nFleming, convention chairman; and a cluster of other\nmeetings which will keep us very busy from Oc-\n1"
}