{
  "id": "d1450-3",
  "text": "tions.\n“One group of stations,” he concludes, “the na¬\ntional, can broadcast what it believes should be\nbroadcast from a cultural point of view while the\nother group provides the opposite side of the picture.”\nThis combination, he feels, serves to maintain “a\nfreedom of expression and a standard of values over\nthe air.”\nPresently Australia has 55 national and 108 com¬\nmercial radio stations with approximately two million\nlisteners.\nTV LITERATURE\nMore than two-thirds of the world’s 63 million TV\nsets and well over half of the world’s 900 TV stations\nare in the United States, according to the 25th semi¬\nannual edition of Television Factbook, just published\nby the trade newsletter, Television Digest, Washing¬\nton, D. C.\nThe 476-page publication contains information on\nevery station in operation, including detailed data\non U.S. and Canadian stations.\nOther, leading countries in terms of stations and\nreceivers, according to the Television Factbook, are\nGreat Britain, 21 stations, 7,450,000 sets; Canada,\n40 stations, 2,658,000 sets; West Germany, 39 stations,\n1,100,000 sets; USSR, 30 stations, 3,000,000 sets;\nItaly, 90 stations, 575,000 sets; Japan, 16 stations,\n650,000 sets; Cuba, 18 stations, 300,000 sets; France,\n19 stations, 600,000 sets; and Mexico, 10 stations,\n300,000 sets.\nThe book reveals that Iron Curtain countries\nfall behind the west in TV progress. Western nations\n(excluding the U.S.) have 325 stations and more than\n15,000,000 sets, as compared with 52 stations and\n3,236,600 sets in the Communist world. Altogether,\n43 countries have TV.\nIn addition to its station directories, the Television\nFactbook contains directories of manufacturers, pro¬\ngram syndicators, statistical tables on TV time sales,\nand set and tube production information.\nThe price of the book, including a TV wall map,\nis $5.\nBOX\nSCORE\nTotal\nAM\nstations\n— 3095 (includes\n36\nnon-commercial)\nTotal\nFM\nstations\n— (includes\n136\nnon-commercial)\nTotal,\nTV\nstations\n—/ 24 (includes\n24\nnon-commercial)\nNEWS OF MEMBERS\nGENERAL\nSpeakers at the funeral services for CBS Vice Presi¬\ndent Ralph W. Hardy, held on Aug. 9 in the Assembly\nHall on Salt Lake City’s famed Latter Day Saints\nTemple Square, included Richard Evans, director of\nKUED-TV, Salt Lake City, a member of the Church\nCouncil of 12 Apostles.\nThe services were attended by high officials of\nthe broadcasting industry, the Latter Day Saints\nChurch and the federal government.\ny Equipment valued in excess of $68,464 was re¬\nceived as a gift by the Detroit Educational Television\nFoundation, operator of station WTVS, from com¬\nmercial station WJBK-TV, Detroit, owned' by the\nStorer Broadcasting Co.\nConsisting of projectors, TV receivers, lighting fix¬\ntures, studio cameras and other TV equipment, the\ngift will aid WTVS in its planned program expansion\nthis fall.\ny A five-fold increase of its operating power from\n55,000 to 275,000 watts beginning Sept. 3, was re¬\nported by ETV station WTTW, Channel 11, Chicago.\nThe power boost is expected to extend the station’s\nsignal radius from 55 to about 70 miles.\ny With studio remodeling underway and its trans¬\nmitter almost completed, KOAC-TV, an outgrowth of\nKOAC-AM, Corvallis, Ore., expects to make its “on\nthe air” debut by Oct. 1, according to Dr. James M.\nMorris, program manager of the two stations. The\ndedication of the new station has been planned for\nOct. 21.\nProgramming of the TV station will be handled by\nthe existing KOAC radio staff and by newly-hired key\nETV personnel including William F. McGrath, assis¬\ntant professor and production supervisor; Tess M.\nWilliams, coordinator of radio and TV programs;\nCharles O. Callaci, producer director; Robert Richter,\nproducer; and John MacKenzie, instructor and\nproducer-announcer.\nPERSONNEL\ny Troy Crowder, former publications editor for the\nETRC, Ann Arbor, Mich., has been named assistant\nto the organization’s president. Crowder will as¬\nsume administrative staff duties and perform new\nfunctions in the Center’s public relations program.\ny For the forthcoming academic year, the Boston\nUniversity School of Public Relations and Communi¬\ncations will add to its faculty Roderick D. Rightmire\nas instructor in radio. Rightmire received both his\nB.S. and M.S. degree from Boston University.\n4\nNEWSLETTER"
}