{
  "id": "d1450-6",
  "text": "TV TECHNICAL TIPS\n—Cecil S. Bidlack\nMany television broadcasters have encountered\nthe problem of hum being fed between a mobile TV\nunit and Telephone Company equipment over a\ncoaxial cable. It can also be a problem when feeding\na microwave transmitter over a long coax line on\na permanent installation. While going through some\nrecent issues of the SMPTE Journal, I ran across a\npaper which outlines remedial measures when this\nproblem is encountered.\nThe paper is entitled “Low Frequency Noise\nAssociated With Remote Television Pick Ups” and\nwill be found in the February 1957 Journal. It is a\njoint Broadcaster/Bell System report sponsored by\nthe Video Transmission Advisory Committee which\nconsists of engineers representing three television\nnetworks and AT&T engineers. Seven specific mea¬\nsures are listed which may help in eliminating this\ntrouble as well as a discussion of other precautions\nwhich may be taken to provide a solution to this\nvexing problem.\n*****\nOur congratulations to Cyril M. Braum of JCET\non his appointment as chairman of the AIEE Com¬\nmittee on Television and Aural Broadcasting Systems.\n“Cy” has supplied us with a list of four papers on\nthe Hagerstown, Maryland, closed circuit educational\nTV project which were presented at the 1957 Summer\nGeneral Meeting of the Institute of Electrical Eng¬\nineers. All of these papers are available in published\nform. The following three numbered papers can be\nobtained from the American Institute of Electrical\nEngineers, 33 West 39th Street, New York 18, N.Y.,\nat a cost of 40 cents to members of the AIEE and\n80 cents each to non-members:\n57-667 “Pioneering in Televised Education” by\nJ. R. Brugger, Board of Education, Hagerstown, Md.;\n57-668 “Closed Circuit Networks for Educational\nTelevision” by W. C. Warman, Chesapeake and Po¬\ntomac Telephone Co. of Maryland, Baltimore, Md.;\n57-669 “Television Systems for In-School Teaching”\nby M. H. Kraus, Jerrold Electronis Corp., Philadel¬\nphia, Penn.\nThe fourth paper, “Establishing and Equipping\nthe Hagerstown Educational Television Project” by\nL. L. Lewis, Educational Administrator, Radio Corp.\nof America, Building 15-6, Camden, N. J., may be\nobtained free of charge from Mr. Lewis upon request\nto him at the above address.\n*****\nWhile we are on the subject of the Hagerstown\nexperiment, we’ll give you the details on a Mechani¬\ncal Reading and Writing Tablet which has been\ndeveloped by John R. Miles. The photographs below\nshow some of the constructional details and how the\nmachines are used. The overall dimensions are 39\"\nwide x 28\" high x 12\" deep. The writing surface\nusing a 30\" roll of yellow pastel paper is 22 x 30\nwhich gives a 3 x 4 aspect ratio on camera.\nThree of these machines are in use at Hagerstown\nand I believe the many ways in which they may be\nemployed is self-evident. They have been used as a\nFront and Rear View of the Mechanical Reading and Writing Tablet developed by John R. Miles.\nSEPTEMBER, 1957\n7"
}