{
  "id": "d1607-13",
  "text": "WESG\nCORNELL UNIVERSITY\nITHACA, NEW YORK\nFrequency:\n850 kilocycles\nTime:\nShared with WWL, New Orleans\nPower:\nDaytime: 1,000 watts Night: 1,000 watts\nFounded:\n1909\nPrograms per Year:\n12,633\nAudience :\n7,828 responses to free gift offer, January,\n1936. (21 announcements of sixty seconds\neach.)\nSTATION WESG broadcast time is divided as\nfollows: Education 50 per cent and entertain¬\nment 50 per cent. . . . The types of programs and\npercentage of time devoted to each are: Music, 70\nper cent; speaking, 10 per cent; dramatics, 2 per\ncent; miscellaneous, 18 per cent. . . . This station\nproduces seventy programs per week. . . . About\none hundred twenty-five talks are broadcast each\nmonth during the daily noon farm program. . . .\nDuring November, 1935, over two thousand letters\nwere received at the College of Agriculture as a\nresult of radio programs. On the average, each\nof these letters asked for two or more bulletins\npublished by the College, and in addition many\nrequested specific information on farm prob¬\nlems. . . . WESG supplies material and continuity\nfor about 65 presentations a day over 25 cooperat¬\ning stations.\nEXTENSION OF RADIO BROADCASTING\nRadio broadcasting at Cornell University is, to\na large extent, an activity of the Colleges of Agri¬\nculture and Home Economics. Broadcasting is\nprimarily for extension purposes, although the\nschools use some of the services in connection\nwith class instruction.\nSays Director Taylor: 4T should urge you to\nnote that broadcasting from WESG is but a small\npart of our educational radio activities, although\nit involves the broadcasting of from 1,500 to 1,800\nitems per year. We have, for example:\n“(1) Syndicate Service to 25 New York State\nStations.—In this syndicate, Cornell University\nissues from three to seven items a day on current\nagricultural and home economics topics. These\nsyndicated items are distributed to the 25 stations\nweekly by mail, first-class postage or special\ndelivery, depending on the value of the speed\nelement in getting them before the public. In\naddition, in case of emergency, there is a direct\nteletype conference hook-up from this office to ten\nstations which are so located that they may be\nheard in all parts of the State.\n“(2) County Agent Broadcasts.—Most of the\nextension agents in this State broadcast regularly.\nRegional groups of agricultural agents, home dem¬\nonstration agents, and 4-H club agents, present\nprograms cooperatively on local stations.”\nMap indicates territorial coverage of JFESG as revealed by\nletters received from one serial feature presented twice daily\n(daylight hours) over a period of seven weeks. Figures show\nactual number of individual returns."
}