{
  "id": "d1607-28",
  "text": "Frequency:\n570 kilocycles, shared with nine other sta¬\ntions: KGKO, KMTR, KVI, WKBN, WMCA,\nWNAX, WSYR, WSYU, wwnc\nTime:\nShares time with WKBN, Youngstown, Ohio\nPower :\nDaytime: 1,000 watts Night: 750 watts\nFounded:\n1922 as WEAO\nValue of Plant:\n$60,000. Equipment is valued at $5,000\nAudience :\nMail response has been received from 88\ncounties in Ohio. The mail also indicates\nthat there are many regular listeners in all\nadjoining states and the Province of Ontario.\nPioneering in educa¬\ntional radio, Ohio State\nUniversity instructors have\nprepared syllabi for lis¬\nteners of the Radio Junior\nCollege. This material in¬\ncludes :\nSyllabus for Spanish by\nW. S. Hendrix; Social\nEthics by Dr. J. A. Leigh¬\nton ; Sociology by Dr. L. A.\nCooke; Geography by Dr.\nRoderick Peattle; Home\nCanning prepared by the\nSchool of Home Eco¬\nnomics ; Fundamentals of\nBusiness prepared by the Department of Ac¬\ncounting.\nProbably unique is the Radio Teacher’s Hand¬\nbook prepared for the Ohio Emergency Junior\nCollege. The following brief extracts from this\nhandbook show that a new teaching art is in the\nmaking:\n“Arrange for study and listening centers.\n“Visit the local librarians in libraries of your\ncounty. Try to arrange with each to set aside a\nroom for use of the WOSU Emergency Radio\nJunior College students as a study or listening\nroom. The librarians should be interested, be¬\ncause the service offered should promote the cir¬\nculation of books.\n“Arrange for installation of radio equipment in\nthe centers.\n“Perhaps the library, the school, the church, or\nthe home will loan a radio for use of the students.\nIf the libraries or schools or churches do not have\nradio equipment which can be loaned, then you\nand your County Chairman might seek help from\nlocal radio dealers. They may be willing to loan\ndemonstrators to you. This has been done in sev¬\neral counties in previous years. If a local dealer\nresponds to your request, see that he gets news¬\npaper publicity for his interest.\n“Organize discussion groups to meet weekly or\noftener.\n“You should plan weekly discussion groups to\ninclude all students within range of your central\nstudy center. If you find that you cannot per¬\nsonally conduct discussions, you might assign the\nwork of Chairman of Discussion to some able stu¬\ndent, or to an alumnus of the Ohio State Uni¬\nversity. Announcements of discussion meetings\nmay be sent by you to each of your students by\nmail.\n“Perhaps you may wish to organize several such\ndiscussion groups in your county. These can be\narranged to meet at the various study centers.”\nSome Outstanding Programs of WOSU\nAre\nRadio Junior College\nClass-room Broadcasts\nDepartment of Music Concerts\nHome Economics Program\nCollege of Agriculture\nWOSU Players\nSports Broadcast\nWPA Orchestra\nCollege of Education Lecture Series\nState Departments Lecture Series\nWilliam R. Parker teaches Shakespearean\nDrama, one of the most popular courses\never broadcast from WOSU. .\n27"
}