{
  "id": "d1607-42",
  "text": "Frequency:\n1,220 kilocycles, shared with six other sta¬\ntions: KFKU, KTW, WCAD, WCAE, WDAE,\nWNAC.\nTime:\nShared with KTW, WKSC—2/3 of time;\nKTW—1/3\nPower :\nDaytime: 5,000 watts Night: 1,000 watts\nFounded:\n1923\nValue of Plant:\n$18,000\nPrograms per Year:\n8,328\nAudience:\nDuring the school year KWSC receives from\nten to seventy-five letters daily.\nKW SC\nSTATE COLLEGE\nPULLMAN, WASHINGTON\nSTATION KWSC is on the air daily except Sun¬\nday. From October 1 to May 31 the station\nbroadcasts 11 ^2 hours a day; from June 1 to Sep¬\ntember 30, 4 hours. . . . Staff consists of ten\nmembers: one director, one full-time worker,\nthree part-time workers and five student workers.\n. . . The station originates from 80 to 240 pro¬\ngrams per week. It devotes two-thirds of its time\nto education and the remaining one-third to en¬\ntertainment. . . . Programs may be classified as\nfollows: Music, 25 per cent; talks, 40 per cent;\ndramatics, 15 per cent; news and reports, 20 per\ncent. . . . Some outstanding programs are: (1)\nFarmer’s Daily Program, (2) Homemakers’ Pro¬\ngram, (3) Love, Live and Laugh, (4) Scientific\nProgress, (5)-The American Political Scene. . . .\nKWSC has made its facilities available to State\nFrom a KWSC Newsletter\n“For the coming semester KWSC has enlarged its\nhigh school service. As a result of suggestions received\nfrom a number of high school superintendents, new\nprograms have been added to be presented from 3:00\nto 4:00 o’clock, a time set aside by many schools as an\n“Activity Hour.”\n“Each Wednesday at 3:00 o’clock, members of the\nEnglish department will broadcast fifteen minutes of\ninformation concerning that which is worth looking\nfor in the novel, short story, essay, biography, poem,\nand other literary forms. Immediately following,\nRobert U. Nelson, instructor in music theory, will pre¬\nsent a half-hour broadcast in appreciation of great\nmusic. Science News, a script sent to us through the\ncourtesy of the National Committee on Education by\nRadio, will complete the hour. This feature tells of\nthe latest developments in every field of science.\n“On Fridays the hour will begin with a discussion\nby members of the department of Fine Arts and will\ndeal with the appreciation of art.”\nschools, churches and P.T.A. groups. . . . An¬\nnual appropriation: $3,500. . . . KWSC plans to\nincrease its power for daytime broadcasting.\nKWSC has increased its power as follows: 1923\n— 1,000 watts; 1936—5,000 watts (daytime),\n1,000 watts (night).\nMUSIC AND EDUCATION\n“While its educational programs have music num¬\nbers interspersed through them, the nature of the\nmusic is of a high order and worthy of being spon¬\nsored by a college of the rank of this one, (State Col¬\nlege of Washington)”. Armstrong Perry in Radio in\nEducation, published by the Payne Fund, New York.\nMarian Haydan, Dorothy Carr,\nJanet Sourwine, Eulalie Blair\n(left to right) of the “College\nCrowd” program."
}