{
  "id": "d116-37",
  "text": "September $, \\9$Q\nHr, Hichnrd . Kali\nwax\nIowa Sint* College\nAmos, Ipwr\nDear Dicks\nI -lavs just get back fro® being on a tour of duty la Europe, and read\nymr letter of August 22, together with the report to IASS officers and director*\ndatod July 23* 0*xr position on these question® can be stated simply and straight-*\nforwardlyt\n1) We think that the exchange program network is far and «sr«y the most\nimportant project now facing educational radio in this country, and Illinois will do\neverything in its ymmr to help the project succeed.\n2) We don’t want the network to be centered at Illinois unless SAEB whoie-\nheartedly wants It centered at Illinois, Let m repeat that we don’t want this for\nourselves$ ww want It only if BATH wants us to do it* We are keenly aware of the\nfine and pioneering job £y Siegel has done on the network, .and ws notice with pleas -re\nthat both. Jin Mlm aiad ’Tarry Bkmrrnm are Interested In housing the network on their\n•wpaara*. These men are oar Arisads, and wo bass no interest in trying to get the\nnetwork hare rather than there. The q-mstion is siau.y, where does KAEB wit tbs\nnetwork put?\n3) If BABB votes Illinois its first choice for location of the network,\nthem m shall ixiixtiataly proceed to seek funds to support the activity properly,\nand 'to step up the rmskm- of duplicates and the spaed of eehange ns qnicOy as ’\nsqpipment cm be financed sad supplied* We don’t have finds for such laproveeent\nnow, but will seek the®,\nh) In case Stegsl should be called to active duty, we could take over\n«M.«iistr*.tian of the network, on a temporary basis, on a fssr days notice, I say\nthis to take care of aa obvious worry that aust be in your mind,\n5) Therefore, let’s beware of falling over oixr feet fma waving too fast*\nLet’s get tine right answer, HaJB should consider this fully and carefully at tbs\nLexington meeting ami decide what it considers the best thing to do. If it decides\non Illinois, then let us see what Illinois can do and if what it ©an do is satis¬\nfactory to HA SB then we can decide on the tiiao m& mi*hod of traj»f«r. In the aeaa-\ntime, we shali stand by to threw out a lifeline in case of such an oaerrmey as\ndescribed in (l*).\nTours sincerely.\nWilbur Schraa®"
}