{
  "id": "d116-67",
  "text": "November 30, 1950\nMr. Richard Hull ' .\nRadio Station WCI\nIowa State College\nAmes, Iowa\nDear Dick:\nNASH is becoming, increasingly, an organisation of national\nsignificance and internal strength. Our membership is expanding\nrapidly and we are steadily expanding our scope of activities.\nDevelopments at the Kentucky meeting, especially plans for es¬\ntablishing a national headquarters office and subsequent increases\nin services to member stations, portend truly great things for\nthe future. fe can say without hesitation that NAKB is now an\norganisation of great'-importance and significance in the social\nand educational structure of this country.\nSi Siegel, newly elected president of the organisation, a\nfireball, and a most effective station operator, has started a\nlot of activities rolling already-taking the bail from you\nand moving along with it like a seasoned athlete, one of his\nmajor objectives is increased membership with emphasis on associates.\nIn keeping with Si’s idea, may I suggest that you, as director of\nyour region, make it routine to keep a check on all new CPs granted\nin your district and contact them immediately with.a strong sales\nletter on membership in the National Association of Educational\nBroadcasters. May I suggest, however, that you go past that point.\nCheck a directory of the schools and colleges in your region\nagainst the now and up-to-date NAEB directory vhich Burton Paulu\nhas just compiled, and send out invitation letters to every pros¬\npective production center and radio instruction unit which is not\nalready listed as a member.\nMay I suggest one or two other activities for you as\nregional director. Write every member in your district now and\nask them to keep you posted concerning any activities within\nyour region so you may' forward this material to Burton Faulu for\nthe Newsletter. A letter from you once every- month or six weeks\nto members in your region will also serve to strengthen your\nregion and will serve to make the various organizations feel\nthat they are an important part of If MB. C rtainly you should\nsend each member a note previous to the nationallyeting urging\ntheir attendance."
}