{
  "id": "d1858-14",
  "text": "- 10 -\npeople: the dean, the president. Form an advisory council; pick out the child¬\nren and relatives of prominent people; build up an interested local group or\nperhaps use an already existing audio-visual group. Others pointed out the\ndifficulties, the struggles which they had encountered. One member, after start¬\ning in 1945 on an in-school project, finally last week got the first program\ninto the city schools. Another was three years, after getting the construction\npermit, in getting on the air. The members seemed comforted by the discovery\nthat misery, which loves company, had plenty of it, and to have gotten some\nhelp from the suggestions.\nThe meeting was then adjourned.\n6:45 p.m. Banquet .......Carolina Inn Pine Room\nMembers reconvened at a banquet held in the Carolina Inn’s Pine Room where they\nwere welcomed by Mr. Gordon Gray, President of the Consolidated University of\nNorth' Carolina, former Secretary of the Army, and himself a commercial station\noperator.\nMr.' Gray referred humorously to his experiences as a station operator, saying\nthat judging from the final report of his Winston-Salem station in the month\nof February, he was perhaps closer to non-commercial broadcasting than anyone\nthought. He referred wryly to another venture, ’’the glorious and successful\nfinancial history of WMIT.” He had had some connection, he said, with educa¬\ntional broadcasting in that, owing to some ’’vestigial remnants” of influence,\nhe had helped to get the call letters, WUNC, from the United States Army.\nTurning to television, he expressed the hope that this conference might come\nup with a definition of ’’educational television” as he had been looking for\none since he went to the Penn State Conference a year ago. However, he no\nlonger felt that this was a critical need, and the University planned to pro¬\nceed with educational television whether defined or not.\nReferring to the University’s plans for television, Mr. Gray stated that the\nthree institutions of the Consolidated University would havfe one transmitter,\n' if financial support could be arranged, on Channel 4 VHF, with studios on each\ncampus. He thought that program materials on the three campuses would be\npractically inexhaustible: At Raleigh - our agricultural and technical school\n— the resources of agriculture,' forestry, engineering, textiles, and archi-\n‘ tecture; at the University at Chapel Hill —* the College, of Arts and Sciences,\nbusiness'and professional schools, Division of Health Affairs, School of\n'' Journalism, Department of City Planning, School of Social Work, etc.; and in\nthe Women’s College — fine arts, home economics, education-and others.\nHe found in television an unparalleled opportunity for educational service to\nthe people of North Carolina. With a single transmitter on Channel 4 We would\nhope to reach 2,000,000 to 4,000,000 people with programs of educational Value.\n: This is an extension of tremendous significance for us in North Carolina. In\n;radio we have not yet taken advantage of our consolidated opportunities. In\ntelevision we have every intention of doing so.\nMr. Gray then welcomed the delegates to the campus, wished them success and\ngood luck in an undertaking of great importance."
}