{
  "id": "d1858-26",
  "text": "-22-\nGroup III:\nWalter Whitaker, Chairman\nHoy Me Gill i vray, Rec order\nGroup IV:\nAlvin Gaines, Chairman\nHoyt Galvin, Recorder\nJack Breit\nRalph Boyle\nJose Buitrago\nMrs. Carroll Lusk\nJulian Morse\nTom Carroll\nDorothy Day\nDale Keller\nErnest Lent\nCarroll Lusk\n*###*****#\nAt 7:30 p.m. the group met for a final banquet at the Carolina Inn Ball Room.\nAlvin Gaines, having been elected Chairman by the discussion group chairmen,\npresided.\nMr. Gaines spoke feelingly of the progress which had been made by the NAEB and\nthe real pleasure which he felt in seeing the dream of his early NAEB associa¬\ntion come true in this very active Region II meeting. He then called upon the\ngroup chairmen to report the finding of the afternoon session. These are sum¬\nmarized as follows: (Any discrepancies noted between the recommendations given\nhere and those sent out by Mr. Schooley must be attributed to human fallibil¬\nity in reporting - whose, this deponent saith not).\nThe report for Group I was presented by Mrs.. Camille Halyard.\nHow Can NAEB Help Us?\nA. Programming...by sending out advance leaflets on all programs and program\nseries which are more specific than those at present supplied members. Too\noften programs are chosen or rejected on insufficient evidence. WAYS OF MAN¬\nKIND was cited as an illustration. (Send all a complete list of NAEB member¬\nship, Associate, Active, and Affiliate)\n*B.; Grants: l) to allocate small grants to small stations to help carry on spec¬\nial work in the station;\n2) to give scholarships to help individuals (teachers) get further\ntraining in radio and TV techniques. This is carried on on a\nseminar basis in some places, but...incomplete, not all school\nsystems can afford * trained radio people;\n3) to help pay for trips to production centers for training educa¬\ntors.\nC. Workshops or seminars:\n1) to set up more ‘grass roots’ workshops, where mutual profit can\nbe derived from various experiences;\n2) to provide training session at regional workshops for TV produc¬\ntion (commercial station help, etc.)\nD. Newsletter...Compiled bulletin...\n1) to compile description and to give evaluations of ways TV is\nbeing utilized by public school system, a do’s and don’ts\ncolumn, in short.\n2) to give information as to the prevailing ways of remunerating\ntalent...to give scale for paying Radio-TV personnel in education.\n3) to send out leaflets giving latest technical developments."
}