{
  "id": "d1858-29",
  "text": "Regional Production and Distribution\nIt was highly recommended that stations within each particular region set\nup a production and distributirg center for dealing with subject peculiar to\nthe region, programs to be made available to extra-regional stations through\nNAEB.\nThe report for Group IV was presented by Mr. Hoyt Galvin. The following recom¬\nmendations were made s\nHow Gan NAEB Hein Members:\n1. The NAEB should investigate the possibilities of providing consultant\nservices to schools desiring to establish or improve FM broadcasting.\n2. Other miscellaneous comments of value:\na. Gaines advised that teacher training in radio utilization should\nbe an important factor in new school broadcasting operations.\nb. In television, it was mentioned that commercial programs can be\ncarried on educational television stations provided that audio is\ncut off during the commercials, and this assumes the program it¬\nself was of a nature to be classified as educational.\nc. High gain should be secured in television installations by using a\nhigh gain antenna and wave guide transmission lines should be used\nbetween the transmitter and the antenna even though the first cost\nof these installations will be higher.\nd. In purchasing television equipment, watch for adaptable character¬\nistics necessary in case more pox^er is added later or even for the\ndays of color television.\nHow can Members Help NAEB?\n1. Exchange of personnel between stations be encouraged and facilitated\nby the Professional Advancement Committee of NAEB.\n2. The NAEB should establish a Television Network on both the national\nand regional basis.\n##########&\nFollowing the group reports, the members of ' the Executive Board of the NAEB,\nGraydon Ausrnus, Frank Schooley, Jim Miles, and Sy Siegel summarized the work\nof the conference. Others present joined in a lively discussion of the aims\nand ideals of NAEB and the accomplishments of the meeting. (For a statement\nsummarizing the summaries, see Foreword.)"
}