{
  "id": "d1228-1",
  "text": "NAEB NEWS LETTER\nPage 2\nJnn useyy 15, 1939\n“It amounted In the fiscal year to 2,062 days, or the equivalent of about\n5 days for every person In the Commission’s headouarters organization\nof less than 400 peoole. Since the end of the fiscal year the over¬\ntime condition has grown sorewhat worse.\n“To remedy this situation oi understaffing, overloau, ana accumulation,\nas well as to provide more adequate anu effective f< cilities for regu¬\nlation, the Commission has recordtenaea this yet r a ^uostantial increase in\nfits buuget.“\nThe Commission's report to Congress stated that the Com.ilssicn is inking\na stuay of methods oi organizing al communications, facilities, includ¬\ning radio, telephone, ana telegraph seivice^, to provide for their\nprompt and efficient use upon the ari&in0 of any sectional or national'\nemergency. The men sure s this etuoy contemplates would be auapteci not\nalone to nation**! defense in time of need but to disasters sucn as\nthose caused by flood, fire, or hurricane.\nThe report also h//tea that the Commission had studied certain situations\nwhich might result in recommendations for additional or amendatory\nlegislation. f;ne of these is tne unlicensed operation of radio equip¬\nment by school children. Unaer present law such operation is a felony.\nBecause of *de severe penalties the Commission, prosecutors and 0rand\nJuries ap^oach indictments reluctantly in such cases. The report\nnotes the offense might be made a misdemeanor, with lesser (penal¬\nties more effective enforcement.\n'Ainilarly, witlx regard to possible recommendations for legislation, the\nCommission noted the danger that the usefulness of a large ptrt of the\nradio spectrum for communication purposes may be destroyed by radio\ninterference from diathermy or electro-medical apparatus. The report\nadded: “This interference seriously impairs radio communication\nservice at tne present time ana is rapidly Orowin^ in intensity.1*\nThe last fiscal year and the months since were characterized as “a\nperiod of signifleant de\\relopments nd noteworthy progress, both during\nAmerican communications anu in the aainini strati on of this Commission\nto which Congress has entrusted the duty of regulating them.**\nEstablishment of ^7 new broadcasting stations v/as authorized during the\nfiscal year. This represented little more than a third of the new\nstations for which applications were filed.\nRadio facilities for aviation were stated to have been advanced to the\npoint that instrument landing systems are expected to be in actual\nservice in the United States v/lthin a few months.\nThe Commission’s investigation of chain and network broadcasting and\nof possible monopoly, supervised by a committee embracing, besides the\nChairman, Commissioners Brown, dykes, ana Walker, “promises to produce\nmuch information of value,** the letter of transmittal ncted. This\ninvestigation is bein^ conducted in oraer to the necessary informa¬\ntion upon which to base regulations ana possible recommendations for\nleg!elation."
}