{
  "id": "d1228-2",
  "text": "NAKB NEWU LETTER\nPage 3\nJanuary 15, 1939\nTiie Commission plane to submit a finf.l report on the telephone Investi¬\ngation to the present Congress. This investigation was supervised by\nCommissioner Walker, anu a proposed report v;as submitted during the\nfiscal year 193*5»\nA committee composed of Commissioners Case, chairman. Craven, ana Payne,\nhas obtained evidence to guide the Commission in determining whether the\nnew technical rules concerning broadcasting, ana the Standards of Engin¬\neering Practice formulated by the Cojamission should be adopted. Upon its\ncompletion, this committee’s report will aia in formulating new policies\nwith respect to the technical aspects of broadcasting, including a decision\non the question of superpower.\nNEW FCC PROCEDURE\nThe Communications Commission’s newly established Motions Pocket procedure,\nset up under the New Rules of Practice and Procedure, which became effec¬\ntive January 1, was inaugurated on Friday, January 6. On that.day Com¬\nmissioner Paul A. Walker heard motions and petitions in nine pending cases.\nHereafter a motions docket will be called at 10:00 A.M. on Friday of each\nweek.\nUnder the old rules most of the motions and petitions were handled by a\nComiflissioner without hearing the parties and without specific and uniform\nprovision for the filing of opposition, although opposition was considered\nwhen it was offered.\nUnder the new plan the Commissioner designated to the Motions Dockets will\nstudy the motions and petitions and will also hear the parties at an open\nhearing. Full provision 1ms been made for notice and opposition both\nthrough the filing of counter-motions and counter-petitions and through\nargument. A member of the Law Department will be present at hearings.\nThe Commissioner presiding will pass upon all (potions, petitions, or\nmatters in cases designated for formal hearing, excepting motions and\npetitions.requesting final disposition of a case on its merits, those\nhaving the nature of an appeal to the Commission, and those recreating\nchange or modification of a fine! order made by the Commission.\nWATCH YOUR LICENSE RENEWAL\nThe Federal Communications Commission has announced that hereafter it\nwill insist upon strict adherence to its rule requiring broadcast\nstations to file application for renewal of license more than sixty\ndays in advance or expiration of the license.\nNo temporary broadcast licenses or extensions of licenser will be issued\nunder any circumstances where the stations fall to file applications for\nrenewal. When an application i£ received less than sixty days in advance\nof expiration of licence, a temporary extension of license only will be\ngranted, and the reasons for so acting will be made public."
}