{
  "id": "d1228-22",
  "text": "20\nthe staff and have in fact subcontracted the distribution of kines. Many prefer to\ndeal directly through companies and there are various other individual consider¬\nations. The Center wants to stay out of the contracting and detail business, I\nbelieve and do just planning.\nDaniel: We have a kine processor on Campus but the quality isn’t uniform\nenough or consistent. To get this consistency through the Center would be practical\nand economical. This is one area the Center could really help in. It seems the\ntime has come, with present costs for film, that we should build up our TV library\nlaboratory. The Center doesn’t seem to be gathering in material. We need to cut\ncost, and get uniform quality, and be able to run through films and get good shows\nthat aren't necessarily prepared by the station itself.\nSkornia: I don't think the Center should get into the operational end.\nNeither the NAEB nor the Center want to compete with legitimate business. And we\nhave to count on our members to add to the present films and kines. Actually, these\nquestions could best be answered by the Center.\nGunn; The Center has been forced to lend some operational aid because if a\nlab ruins a kine, the Center is hurt, for it gives the money originally. There\nshould be some standard process so high investment in a kine isn't lost. The\nCenter doesn't even have information on what are good labs and what aren't.\nSkornia: I think we'd better put this on the agenda of the NAEB Advisory\nCommittee to the Center, which meets next at Columbus. Afraid we are not competent\nor authorized to decide such things-—.\nQuestion: Mr. Wheatley, why do you have such a short program time?\nWheatley: These hours represent what we think we can do well enough. It is\na question of what the community expects and is suited to the needs of the\ncommunity and their ability to support more hours of programs. I think it is a good\nidea for ETV also to restrict the number of hours and concern itself with quality\nand not amount."
}