{
  "id": "d1228-4",
  "text": "NAKB NEWb LETTER\nPage 5\nJanuaiy 15, 1939\nbearing on the applioation of KOY to use the KOAC wavelength, and that he\nwas using for this purpose the oommunications he was receiving from his own\nconstituents. Hunger emphasized the fact that the state board has the\ninterests of 65,000 Oregon farm families in mind primarily in maintaining\nthe station, although it serves urban audiences as well.\nPresident G . W. Peavy added his endorsement to the campaign, saying\nKOAC is a vital faotor in keeping the people informed of the far-flung\nactivities of the state oollege, particularly in the field of agricul¬\ntural research and extension, \"KOAC must be preserved to serve the\npeople of Oregon,11 he declared.\nTHIS CONCERNS YOUR STATION, TOO\nThe Federal Comraunications Commission has set for hearing a petition\nof Mayor Fiorello H. LaGu»rdia, of New York City, in the matter of\nStation WNYC, municipally owned broadcast station of that city.\nThe Mayor petitioned the Commission to amend certain of its rules in\norder to permit the rebroadcasting of programs of high frequency and\nInternational broadcast stations, by regular broadcast stations whose\nlicensees are universities, other eduoat ional institutions, munici¬\npalities, other government agencies, or other non-commeroial non-profit-\nmaking organizations.\nAs now written the rules of the Commission do not prohibit the rebroad-\noasting of programs of high frequency broadcast stations but merely\nrequire the authority of the Commission for the rebroadcast. However,\nthe rules do not permit regular broadcast stations to rebroadoast the\nprograms of international broadcast stations located vdthin the United\nStates except where wire lines are not available to transmit the\nprograms to regular broadcast stations.\nThe Mayor*s petition also asked that the Commission amend its rules\nwhich prohibit high frequency and international broadcast stations\nwhich are in an experimental status, from making any charge, directly\nor indireotly, for the transmission of programs.\nIn setting the matter for hearing the Commission opened the way for\na complete discussion of the subject."
}