{
  "id": "d1578-0",
  "text": "The National Association of Educational Broadcasters\nVol. II No. 5 Dupont Circle Bldg., Washington 6, D.C. ' ' May, 1961\nTHE WASHINGTON CLIMATE\nThere's a lot in the wind in Washington nowadays and it isn't just the odor\nof cherry blossoms. There is evidence that the Kennedy administration and the\nFCC under its vigorous new chairman, Newton N. Minow, intend to stiffen regula¬\ntory activity concerning broadcasting, make major shifts in national radio-tele-\nvision policy, have greater concern for educational broadcasting services, and,\nin general take a strong progressive posture in its approach to what constitutes\nutilization of the air waves in the public interest.\nThere is apparent determination on the part of a majority of the commission¬\ners to vigorously enforce the provisions of the Communications Act. This attitude\nis expected to be reflected in an increased number of renewal hearings, fines, and\nother sanctions; intensified concern about promise vs. performance, misleading and\nfraudulent contests and promotions, over-commercialization, and technical viola¬\ntions. Mary more renewal hearings are to be held in the home localities of sta¬\ntions, and Mr. Minow has said that the FCC would be derelict in its duty if it\ndoes not place strong emphasis in such hearings on whether the actual program¬\nming is substantially the same as that promised in the original or renewal appli¬\ncation.\nThe Commission has expressed concern over the sale prices of TV and radio\nstations. It has observed that \"millions are being made by private interests in\nthe sale of public property - the stations franchise to operate over the airwaves.\"\nIt may be that in the future, assignors wishing to transfer a frequency will be\ncalled upon to explain why the station should command such a high price above the\ncost of physical assets and how the transfer would be in the public interest.\nThe White House is studying the spectrum with the intention of providing more\nfrequencies for civilian use. It has asked interested agencies to work out (l)\nreallocation of the radio-tv spectrum between government and non-government users\n(2) supervision over how government agencies use frequencies allotted to them and\n(3) what role the government and private corporations should play in space satel¬\nlite communications.\nCurrently a large portion of the radio-tv spectrum is assigned to the mili¬\ntary for \"top secret\" national defense purposes. Both the FCC and Senator Magnuson\nhave made repeated, but unsuccessful, efforts to find out how these frequencies\nare being used. The President made an oblique reference to this matter in his\nmessage on regulatory agencies by observing that a \"co-ordinated effort\" is under¬\nway to improve allocation of the radio spectrum and regulation of its use. He\nmade no reference, however, to the rumored appointment of a \"czar,\" responsible\ndirectly to the President for allocation of air space for governmental and private\nuse.\nChairman Minow has noted that \"90-plus per cent\" of the problems of televi¬\nsion stem from scarcity of channels. This Situation would be greatly ameliorated\nif the military services could be \"persuaded\" to give up a few VHF and UHF channels\nnow reserved for their experimentation.\nAT&T is pushing for early decision on its plans to put its own communications\nsatellite in orbit. The government has allotted the company frequencies but has\nnot yet decided to make its launching pads and rockets available for \"private\"\nsatellites. The Administration is said to be torn between its desire to maintain\nthe U.S. lead in space communications and its fear of giving a private concern\nmonopoly over this revolutionary system of radio-telephonic communications."
}