{
  "id": "d1324-1",
  "text": "NEWS LETTER,..,\nPaqje 2\nNovember i, 1945\nMunicipal Building in downtown Manhattan one day two weeks ago„ He\nWALKED DOWN THE CORRIDOR TO STUDIO \"8” WHICH IS THE HOME OF ALL OF\nTHE City Station*s dramatic programSo On the wall, was a mural\nERECTED IN 1937 AND PAINTED BY STUART DavISo\nThe man stopped and looked at this mural^, Then he asked to enter\nTHE studio and STUDY IT AT CLOSER RANGEp STUDIO \"B” DfDN''T KNOW IT\nAT THE TIME, BUT IT WAS ABOUT TO MAKE HISTORY—AS THE FIRST RADIO\nSTATION TO DONATE ITS WALL FOR AN ART EXHIBITION, THE MAN LEFT THE\nSTUDIO AND ENTERED WNYC DIRECTOR M, S, NOV«K»S OFFICE,\n\"f*M FROM THE MUSEUM OF MODERN Art MR, NOVIK,” HE SAID, \"aND WE ARE\nPLANNING A SPECIAL STUART DaVIS EXHIBITION DURING OCTOBER, SINCE\nTHAT MURAL YOU HAVE ON THE WALL IN STUDIO *’B“ IS ONE OF THE FINEST\nEXAMPLES OF DAVIS\" WORK, WE WERE WONDERING WHETHER WNYC MIGHT BE\nWf*-LING TO LOAN US THE MURAL^ FOR THE DURATION OF THE EXHIBIT?”\n\"Well”, said Novik, \"the cost, and the acoustics,*,”\n\"Oh, don*t worry about that\", replied the Museum man, \"we are pre¬\npared TO take care of all THE COSTS, AS WELL AS SUBSTITUTING A SPECIAL\nPANEL AP-'ROX I mat I NG THE MURAL, TO MAINTAIN THE PROPER ACOUSTICS IN\nStudio \"B\" for the duration of the exhibit. We will take down the\nMURAL, PATCH THE WALL, TRANSPORT IT TO THE MUSEUM, AND RETURN IT TO\nPRECISELY ITS FORMER POSITION AS SOON AS THE EXHIBIT CLOSES.\"\nNovik listened, and then said he would be glad to cooperate with the\nMuseum for such a worthwhile cultural enterprise, and gave the neces¬\nsary PERMISSION* A FEW DAYS LATER WORKMEN, PAINTERS, AND CARPENTERS\nARRIVED TO BEGIN THE FACE-LIFTING OPERATION* AFTER MUCH WORK AND\nSTRUGGLE (INCLUDING TRYING TO MOVE A MURAL ELEVEN FEET LONG AND EIGHT\nFEET HIGH THRU THE TVO STUDIO DOORS JUST SEVEN FEET TALLH^ THE MURAL\nWAS TAKEN DOWN AND STARTED ON ITS WAY TO THE MUSSUM OF MOO£?^N Art AT\nII WEST 53ro Street for exhibition*\nPETRILLO MOVE COSTS W B 0 £ ITS NETWORK SERVICE\nA recent. ORDER BY PRESIDENT JAMES PeTRILLO OF THE AMERICAN FEDERATION\nOF Musicians has put an end to piping CBS network radio programs to\nAN Educational Frequency Modulation station in Cleveland,\nAssistant manager Carl George of CBS station WGAR in Cleveland says\nPetrillo*s order has halted the piping of network programs to FM\nSTATION WBOE* The FM station is operated by the Cleveland school\nboard. Among the programs that failed to reach the non-commercial\nFM station was the CBS EDUCATIONAL PROGRAM, SCHOOL OF THE AIR,\nPETRILLO HAS BANNED DUPLICATION OF MUSICAL PROGRAMS ON STANDARD\nSTATIONS TO FM OUTLETS*\nK F K U BROADCASTS LECTURE COURSE \"AMERICA AT PEACEl*,^\nA COURSE OF PUBLIC LECTURES ON THE SUBJECT OF “America AT PEACE\" WILL\nBE OFFERED THIS YEAR BY MEMBERS OF THE FACULTY OF THE UNIVERSITY OF\nKansas on Tuesday evenings, in Fraser Theater, beieinninq October 16,"
}