{
  "id": "d1324-3",
  "text": "^ WOI, Iowa State University radio station, is airing a\nseries of programs on current racial and religious issues.\nMichael Collins, production manager, serves as moderator\nand producer. Some of the programs are: “Religion and the\nPublic Schools,” “Tax Support of Private and Parochial\nSchools,” “Legislating Morality,” “Should We Have Sunday\nClosing Laws?” “What It Means to be a Negro in Iowa.”\n^ KLRN-TV, Southwest Texas ETV station, will present\nseveral opera specials this summer. First in the series was\n“Tosea,” prepared in cooperation with the University of Texas\nOpera Workshop.\n^ Acting Manager Richard Estell, of Michigan State Uni¬\nversity’s WKAR, has announced that the award-winning radio\nseries Convention Report will become a part of the official\nhistory of the state. The entire 35 programs will be presented\nto the Michigan Historical Commission as the only account in\nexistence of the day-to-day activity of the 1962 Michigan Con¬\nstitutional Convention.\nGENERAL\n^ A film crew from KLRN, Southwest Texas ETV Council\nstation, started floating down the Rio Grande River on May\n1, to film special TV shows for NET for the What’s New?\nseries for the next season. In addition to the film crew, sci¬\nentists from the University of Texas archeology and botany\ndepartments joined the explorers, photographers, and writ¬\ners. The entire journey is being filmed under the supervision\nof Earl Miller, director of motion pictures for KLRN and\nthe university.\n^ KAET, Arizona State University, received the first Emmy\nAward ever given to a noncommercial ETV station as a sta¬\ntion achievement award. The award was presented by the\nPhoenix Chapter of the National Academy of Television Arts\nand Sciences “in recognition of outstanding achievement in\nthe field of local television . . .”\n^ WMHT (TV), Schenectady, New York, has been forced\nto cancel its weekend broadcasts by lack of funds. The sta¬\ntion went into operation on March 26, 1962.\n^ L. L. Lewis has been retained as consultant for ETV to the\nState of Delaware and the University of Delaware. He will\nadvise on what equipment should be bought and how best to\ndesign a TV system.\n^ Early last month the new studios for WGBH, Boston, were\nscheduled to start to rise. Money for the new building to re¬\nplace those lost by fire in October, 1961, has been raised\nthrough fund drives.\n^ WDCN, new Nashville ETV station, recently received a\ncitation for outstanding programing for the three months it\nhas been in operation. The Middle Tennessee Radio and Tele¬\nvision Council presented the award at a Vanderbilt University-\nWDCN seminar on instructional television, at which Dr.\nCharles Siepmann of New York University was the principal\nspeaker.\n^ Conrac Division of Giannini Controls Corp., NAEB In¬\ndustrial Associate, has acquired the assets and business of\nJet Electronics Corp., Azusa, California.\n^ KVCR-TV, San Bernardino Valley College, has received\nan award for its coverage of college wrestling in 1963. The\nAmateur Wrestling News cited KVCR and General Manager\nRobert F. Fuzy for having “the best TV series on college\nwrestling in the nation.”\n^ WUOT, University of Tennessee, is now receiving mail\nfrom listeners in North Carolina, Kentucky, and Georgia. The\ngreater coverage is a result of recent changes in which the\ntransmitter was moved to a better site and a new tower and\nantenna were installed.\n^ WMVS, Milwaukee, recently received six first-place awards\nfor its locally produced programs from the 1963 Milwaukee\nRadio-Television Council. Winning programs and producers\nwere: “Music Unlimited,” Bruce Fowler; “Lively Arts,” Ted\nSteinke; \"Sound of Jazz,” A1 Binford; “Faces of Christmas,”\nRod Thole; “Frogmen Firefighters,” John Lemke and Lois\nRobinson; and “Great Decisions” (locally produced panel\nwhich followed NET program), co-produced by WMVS and\nthe University of Wisconsin-Milwaukee.\nPublications\n• Report of Comeback’s pilot exploration of TV’s potential\nfor rehabilitation services. $1.25 from Comeback, Inc., 16\nWest 46th St., New York 36.\n• In an article in the May issue of Overview, A1 Renfro,\nAlabama ETV Commission chief engineer suggests colleges\nand schools add an assistant superintendent of technology. He\nsaid the new administrator is needed due to an increasing use\nof classroom electronic devices now frequently handled by\npersons unfamiliar with their purchasing, their placement,\nand their repair.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Mrs. Gail Wilson, Placement Service,\nat the NAEB office in Washington.)\nJuly I—Young man, 29, desires position with educational TV\nstation of university. B.A., English, Harvard. Varied in¬\nterests and extensive creative and administrative back¬\nground in first-rate commercial live TV and motion pic¬\ntures. Location preference: New England or Pacific\nNorthwest. Salary open.\nJuly 2—ETV production supervisor/teacher/producer-director.\nCurrently graduate assistant in radio-TV; M.A. in sum¬\nmer, 1963. Looking for challenging, creative opportunity\nin ETV administration, teaching, and/or production.\nSensitive to, and appreciative of fine cultural program¬\ning. Male, 25, married. Salary and location open.\nJuly 3—TV director and/or producer. Experience: 13 years in\ndirecting and production. Desires position in major city.\nJuly 4—Producer-director desires position with ETV station and\nuniversity. Broadcasting and considerable commercial\nexperience. Will accept radio position; no teaching ob¬\njections. Male, 28. Location open; salary minimum $5200.\nJuly 7—Experienced engineer seeks position as chief engineer\nat TV broadcast station. TV engineering experience since\n1955. Excellent prospect for a position supervising con¬\nstruction of a new broadcasting facility or maintaining\nand upgrading an old one. Male, age 32.\nPOSITIONS AVAILABLE\n(In order to be considered by these institutions, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nJU I Program director for Institute of Music. Combination\nof musical and broadcasting experience. M.A. preferred.\nNorthern Midwest. Salary $6,000-$8,000; open Septem¬\nber I, 1963.\nJU 2 Producer-director with a college degree, M.A. pre¬\nferred, with ample actual directing and producing ex¬\nperience. This position requires a thoroughly experienced\nproducer-director. Midwestern community TV station; im¬\nmediate opening.\nJU 3 Director of TV with 6 years background in engineering\nand production. Comparative to executive level. East\nCoast. Salary $11,000 plus government benefits. Im¬\nmediate opening.\nJU 4 Skilled technician with experience in broadcasting and\nclosed-circuit TV, including antenna distribution. Major\nEastern city. Salary $6,000-$7,000. Immediate opening.\nJU 5 Technicians skilled in installation and maintenance of\nclosed-circuit TV. Commercial engineering concern in a\nmajor Eastern city. Salary $2-$2.50 per hour. Immediate\nopening.\nJU 6 Art and scene director. B.A. in radio-TV, advertising\nand/or dramatics, with emphasis on television graphics\nor scenic design. Television experience is preferred but\nnot essential. This person should have a general knowl¬\nedge of scene shop technique.\n4\nNEWSLETTER"
}