{
  "id": "d1460-2",
  "text": "- 3 -\nFCC CHAIRMAN CCff GIVES U. S. EDUCATORS A WARNING AT INDIANA UNIVERSITY MEET\nA Last Chance\nThe Federal Communications Commission is giving American schools a secondh¬\nand possibly last-chance to use radio._FCC chairman Wayne Coy issued the warning\nJuly 30, in a speech prepared for delivery before the second annual conference\n1 on radio in education, Indiana University.\nHe said the commission is giving education its second chance now, offering\nnew static-free, high-fidelity FM bands. Despite \"general rejoicing\" then the\noffers were made, he said he was disappointed with what has happened since then.\nCoy said? \"There are now only 17 non-commercial education FM stations in operation.\nTen more are under construction* There arb only four applications pending.\"\nHe praised radio station WHAS in Louisville, Kentucky, for \"Making radio\n(history\" through its cooperation with the University of Louisville. The station\nis broadcasting a college course for credits, the first time this has been\nattempted. Said Coy:—\"There is a school that will never suffer from over¬\ncrowding. That professor’s class can double, triple, increase a million-fold,\ngo up to 50-million listeners and he can reach them all as easily as he does a\nhandful of students in a little classroom*\n\"There will be no wear and tear bn the campus. No light bills. No coal\nbills. No living accomodations for students,\"\nRadio For Schools\nCoy said use of radio by schools would \"put American education 25 years\nahead\" of its schedule._But he said schools, overcrowded and under-staffed.\nare not taking advantage of this modern method of teaching.\nSaid Coy:—The school system without radio must go the way of the little\nred school house* The ivory tower must make way for the radio tower.\"\nCoy said that in the early days of radio, few schools took advantage of\noffered wave lengths and permits. Only 34 today have standard stations.\nOther Speakers At Indiana Session\nChairman Wayne Coy of the Federal Communications Commission was one of\nfour speakers at the second annual conference of Radio in Education held at\nBloomington under the auspices of Indiana University.\nOther speakers included radio producer Ben Park; Sterling Fisher t advisor\nto NBC’s public affairs and education department, and Ben Watt. Indiana State\nSuperintendent of Public Instruction.\nHEW NON-PROFIT V EDUCAtT6¥al\" STATION PLANNED IN CANADA\nEvangelical Radio Programs of Canada, a non-profit service for religious\nand educational broadcasters located in Calgary, Alberta is planning a new\nstation with its affiliate body, the Associated Missionary Broadcasters of\nCanada. Reports indicate considerable interest on the part of the.Canadian\nBroadcasting Corporation. Project plans research and development in\nprogramming techniques apart from networks."
}