{
  "id": "d1460-4",
  "text": "NATIONAL ASSOCIATION OF BROADCASTERS INDICATES 19*+9 POLICY LINE\nThe National Association of Broadcasters opened its annual series of district\nmeetings in Boston where members of district number one voted five main resolutions\nwhich are good guidemarks for the association’s policy line during the coming year*\nFirst—that NAB president Justin Miller appoint a committee on observance\nof newly effective NAB standards of practice for American broadcasters*\nTwo—that \"grateful appreciation” be expressed to Senator Wallace White, Jr.\nfor his \"achievements asfather of radio law in America,”\nThree—that further support and action be pledged to Judge Miller’s \"eloquent\nexample in word and deed\" in defending radio’s freedom.\nFour—that the U.S. Bureau of Census include a radio ownership question\nin the 1950 census*\nFive—that NAB president and directors \"in view of the fact that the FCC\nregulates the broadcasting industry by edict and by direct and indirect\nthreat of reprisal and loss or denial of license in a manner not\nconsonant with the spirit and intent of the radio law\" take action to\ncorrect this condition.\nPresident Judge Justin Miller of the National Association of Broadcasters\nalso urged a revision of Frequency assignments for radio stations and said that\ncurrent scarcity of station locations in the broadcasting spectrum is largely the\nresult of governmental controls*\nHe said: \"England and Russia have been grabbing off two and three times the\nnumber of broadcasting locations that we get. Our scarcities now are caused\nprincipally by poor use and allocation of frequencies,\"\nPraising the progress of the broadcasting industry, the NAB president said it\nis \"remarkable broadcasters have gotten along as well as they have with government\nand other critics constantly needling them.\"\nDANGER. 1950 CENSUS MAY CUT RADIO QUESTIONS\nBroadcast Measurement Bureau points out the U. S, Census Bureau probably will not\nask about radio ownership in the 1$50 census unless commercial and educational\nradio agencies strongly urge it.\nTwo factors will determine whether 1950 census will include a radio question:\nsize of the appropriation (this determines number of questions which can be asked)\nand Census Bureau’s own view regarding importance of radio questions.\nBMB points out if Census Bureau does not take an actual count of AM, FM, and TV\nset ownership every decade, no solid basis for comparisons will exist.\nN-A-E-B endorses the 'BMB suggestion that individual or groups, interested in\nseeing a radio question included in the 1950 Census should write Mr. Capt,\nU» S. Census Bureau, Washington, D.C* "
}