{
  "id": "d1460-7",
  "text": "- 8 -\nVIDEO—NOW YOU SEE IT—NOW YOU JDON1 T\nBeginning with the FCC*s statements about additional spectrum space required for\nspecial cogmunioations and safety services, end following the elimination oF\nChannel ^1 from the TV band for special communication, and winding up with re¬\nmarks by John Y/illougby, acting chief engineer for the Commission to South Caro¬\nlina broadcasters, television entrepreneurs spent the month of July examining\ntheir pale reflections in any mirror which happened to be handy*\nReports from the PCC hearing in late June re assignment of television channels\npointed up the following factorss\n1* Reallocations are definitely in the picture—when and where remains a question.\nSome are viewing the 450 to 600 mo, band as TV1s future resting spot.\n2, There are more TV applications thpn frequencies in many areas, and the situa¬\ntion is likely to get worse rather ihan better. \"\n3, Astonishingly few educators appear to be interested in television operation,\nconsidering the fact that once the TV channels are filled there is likely\nto be no second ohanoe. Significant factor here is cost of installation and\noperation which is prohibitive for most, but may show short-sighted view of\nfuture.\n4, Many observers believe, despite reallocation threats, which could render whole\nTV future uncertain/ that present investments both by station operators and\nequipment manufacturers will make any shift a gradual, rather than a drastic\none.\n5• The TV reallocation and assignment hearing scheduled in September may be\nprolonged, but will do much to clarify the present situation.\nN-A-E-B REPRESENTED BY CARL MEFzER AT TV HEARINGS\nCarl Menzer, director of N-A-E-B stations WSUI & KSUI (University of Iowa) attended\nthe FCC television hearings as an engineering observer for his own stations and\nfor the National Association of Educational Broadoasters.\nThe National University Extension Association was also represented by means of\na resolution sent to the FCC by Bittner of Indiana University asking that a por¬\ntion of the TV spectrum be reserved for educational usage as one result of any\nreallocation procedures.\nMAJOR ARMSTRONG SUES RCA & NBC ON PATENT RIGHTS\nMajor Edwin H. Armstrong, inventor of the FM principle of radio transmission, filed\nsuit in Federal oourt in late July against the Radio Corporation of America and the\nNational Broadoasting Company, charging infringement and misrepresentation of his\npatent rights. He sought permanent end preliminary injunctions against what were\ncalled all further infringements in addition to an unspecified amount of damages.\nArmstrong charged RCA and NBC with intent \"to maintain RCA's monopoly of the busi¬\nness of granting licenses under radio patents in the U.S. and to maintain NBC's\ndominant position in the business of broadcasting in the U.sT1*\nArmstrong contended that RCA falsely represented to the radio industry that it had\nan FM which did not infringe upon his patents and induced members of the radie\nindustry to believe it was safe to infringe on his patents without securing lioenses."
}