{
  "id": "d1460-8",
  "text": "- 9 -\nUNIVERSITY, OF COLORADO RADIO RECOGNITION\nRecognition for outstanding work in the field of public relations was given to\nthe University of Colorado (N-A-E-B Associate member) at the annual Denver meeting\nof the America College Public Relations Association*\nSelected from nation-wide entries, the University’s program, \"It Happened Here\"\nwas chosen as the best expression of college public relations by radio*\nProduced under the direction of Ellsworth Stepp and written by William Bender, Jr.,\nand Nancy Harris of the University Radio Department, the winning entry was on the\nair for 43 weeks last year and was carried by eight different Colorado stations*\nThe programs stressed the far-reaching effects of scientific and cultural advance¬\nments made at the University, Earlier this year Bender received first prize from\nthe Association for Education by Radio for his script on the \"Time Detective\",\nanother in the series on \"It Happened Here.\"\nFRENCH RADIO LISTENERS HEAR ABOUT KENTUCKY VIA N-A-E-B STATION\nThe New York Offices of the French Broadcasting System's North American Service\nmade special arrangements with Elmer Sulzer, director of WBKY (University of Kentucky)\nfor a broadcast to be produced in the University studios depicting life on the\nKentucky campus. The program was planned and prepared by a basic production class in\nthe Radio Arts Department. All work on the program, except translation into French\nwas done by students under the direction of Helen Blythe Hampton, graduate student\nin radio. Translations were made by the U. of Kentucky Language Dept,\nIOWA DEPARTMENT OF H3BIIC SAFETY EDUCATES IOWANS_\nThe Safety Education Division of the Iowa Department of Public Safety is rounding\nout a year of highly successful safety education using the facilities of two edu¬\ncational and nine commercial radio stations.\nTitled \"Safety Speaks\" and using the combined resources of state schools in Iowa\nand the Safety Department facilities, programs under the direction of Nolle Keni-\nson, radio coordinator of the Safety Education Division are presented live over\nWHO, and NAEB stations WOI and WSUI, and then released to a circuit consisting of\nKSO, KCRG, KSIB, KWPC, KCID, KDTH, KBIZ, KWSI, and KFMX.\nKWSC PLANS SURVEY OF WASHINGTON RADIO HABITS\nA pioneering, publically supported poll, jointly sponsored by the State College of\nWashington, owner-operator of N-A-E-B station KWSC and the University of Washington\n(N-A-E-B associate member) will question residents'of the state on listening habits\nprogram preferences, and other radio likes and dislikes, early next fall in coopera¬\ntion with the Washington State Association of Broadcasters.\nCOLLEGE OF THE PACIFIC SEEKS ANSWER TO PUBLIC SERVICE,,PROBLEM\nN-A-E-B member station KCVN (College of the Pacific) Stockton, California, reports\nthe Graduate School of the College is conducting a survey on a problem vital to\nevery station manager—what is the meaning of the term, \"in the public interest,\nconvenience, and necessity?\"\nQuestionnaires have been sent to radio stations all over the U. S., enclosing a\nspecial check and asking managerial cooperation in evaluating the problem. Results\nexpected to be forthcoming this fall, should be highly interesting and useful."
}