{
  "id": "d1460-9",
  "text": "N-A-E-B\nBUSINESS PAGE\nj'WNAD NEEDS CHIEF ANNOUNCER j\n, Station WNAD (University of Oklahoma), Norman, needs a full-time announoer who i\ni can take over the responsibility of ohief announoer for the station. College\n! graduate with minimum of one year experience who thoroughly believes in radio edu-j\n< cation is wanted. Full details re duties and salaries may be obtained by writing ,\n| director, Jchn Dunn at WN AD, Norman, Oklahoma. ;\n’___ 1\nKUSD NEEDS PROGRAM DIRECTOR |\n,---\nStation KUSD (University of South Dakota), Vermillion, wants program director who j\nis qualified to teach beginning course in radio orientation as portion of duty. ;\nj College graduate with previous radio experience is wanted. Will consider univer- i\nsity radio school graduate if sufficient experience can be demonstrated. For full\ndetail, write Irving Merrill, KUSD, Vermillion, South Dakota.\nINDIANA SURVEY RELEASED\n• Robert H. Lee, acting direotor of radio at the University of Indiana, reports that!\nthe survey of operational costs, staff standards, personnel, equipment, operating j\nhours, and special services of 17 non-commercial stations is now okayed for relea.se.\nThe survey was prepared by George Willeford, graduate student, under the direction1\nof Dr. Harry Skornia, It represents the first complete and aoourate evaluation &f:\nnon-commercial station operation undertaken in many years.\nAccording to previous agreement, N-A-E-B will distribute the report through its j\ncentral offioe at WOI (Iowa State College) Ames, Iowa. j\n1. Active and associate N-A-E-B members will receive single offioiel (\ncopies without charge.\n2. Additional oopies will be furnished to members at 25 cents per\ncopy to cover mailing and mimeographing. j\n3. A charge of $1.00 per oopy will be made to all non-members who\nj wish copies of the study.\nANNUAL MEETING AT UNIVERSITY OF ILLINOIS (OCTOBER 10, 11, 12) I\n-- j\nN-A-E-B in aooordance with the vote at the mid-year meeting in Columbus will\nhold its annual meeting at the University of Illinois oampus, home of member\nstation WILL on Sunday, Monday, and Tuesday, October 10, 11, end 12.\nj\nThese dates were selected in order to precede the School Broadcast Conference ,\n] in Chicago which begins on Wednesday October 13, in order to permit East and\nWest Coast members to combine attendance at NAEB and SBC in a single trip.\nThe annual meeting is scheduled for formal opening Sunday evening with major\nsession marked for Monday morning and afternoon, and the annual banquet on\nMonday evening. Final business will be concluded Tuesday morning, and the\nmeeting will adjourn at noon in order to permit, delegates to proceed to Chioago. j"
}