{
  "id": "d851-5",
  "text": "f\nSCRIPT ELEVEN\nREPORT FROM JAPAN\nJOHN LERCH\nMUSIC:\nTHEME ESTABLISH ( 5 secs.) UNDER\nANNCR:\nREPORT FROM JAPAN ( EMPHASIS). A program of information and commentary\ntreating current issues in Japan. This program is produced on tape recording\nin Tokyo. Here now is your host: John Lerch.\nMUSIC:\nTHEME OUT\nLERCH:\nWe have a distinguished visitor today, Mr. Marcel Grilli, program advisor\nfor the International Department of NHK ( or the Japan Broadcasting Compand).\nHowever, Mr Grilli visits us in his special capacity of musicologist\nand eminent music critic for the Japan Times. Before talking about music,\nwe do have some items of interest which have made big news over here.\nMUSIC :\nDOCUMENTARY MARCH ( UP BRIEFLY AND OUT)\nANNCR:\nHighlights in the News from Japan.* ( slight pause). A Japanese pearl\ndiver in the Arafura Sea, north of Australia, is reported to have discovered\nIJSRCH:\nthe largest pearl in the world.\nYuji Hama, a diver with\\'pearl expedition stated recently that he had found\na 70 carat pearl. The Japan Pearl Shell Company confirms the report, and\nthis pearl ( so far given no special name) is claimed to be the biggest\nin the world-— five carats larger than the previous king of pe#»ls.\nANNCR:\nA pagoda to house the ashes of Buddha is planned. The pagoda, expected to\nLERCH :\nco|st about 6 million dollars,will be built in a Tokyo suburb.\n\\jgyHSH- KlNtNH )\nA specially constructed pagoda to^whichj >the ashes of Buddha -y^resented by\nsuburbs of Tokyo. Construction of the pagoda is to begin soon under the\nsponsorship of a group of Buddhist leaders who form the Japan Buddha Associa¬\ntion. The pagoda, designed by a leading religious architectural expert, will\n// \"\nbe made of ferro-concrete and will rise 150 feet. An eternal light at the\nANNCR:\nvery tip will illuminate the pagoda area at night.\nThe Italian Import-Export Committee approved \" balanced” exchanges of^goods\nbetween Italy and Japan which makes for greater economic cooperation.\nLERCH:\nThe committee, with headquarters in Rome, has approved the export of"
}