{
  "id": "d412-33",
  "text": "August 15* 1?50'\nMr* Cliarter Heslop\nChief* Kadio Television Section\nAtomic Energy f ©mission\n.ashington* D*C#\nDear Hr* Hcslep*\nxhsnk you for your letter of August 9 following up the con¬\nversation I had with Mr* George Clash eon*\nWhen Mr* Glasheen was on our campus* I pointed out to hi© that\nthe educational radio stations in the country* of which there are\napproximately one hundred* in actuality represent the largest pool\nof radio production talent and facilities available in the country\nand suggested that* inasmuch as we are all engaged in non-commercial\neducational pro granting, the ACC should keep us in raind as a channel\nfor public information concerning civilian defense in the event of\natomic warfare* In addition to operating our own stations, many of\nus produce programs which are distributed on a state-wide basis* I\nfurther suggested that the National Association of Educational\nBroadcasters might be interested in having a representative of the\n‘EC meet with our group at our fali business meeting in Lexington,\nKentucky October 30 and 31.\nI appreciate your offer of help in the ©vent w© attempt to do\ncay progress in the atomic energy field but was of the opinion that\nwe as broadcasters should attempt progranrrdng In this field only5'\nupon request from the U.G. Office of the /.EC# Dr. Eric Rogers, Head\nof our Haydies Department, was a member of the group who studied\ncivilian defense for five weeks at Oak Ridge in the spring and he\ntolls me that their final instruetions were to do nothing toward\npublic info,nation on this subject until they were notified by the\nnational office to set up sot:: r of program* I thought this\nprobably would be a good rale ^or me to follow here.\nThe purpose of this letter then is to repeat to you the sug¬\ngestions I made to Mr* Gl&sheen and further to suggest that as Sec¬\nretary-Treasurer of the Alabama Broadcasters Association, I should\nbe happy to work with your organisation in setting up for Alabama ’\nconferences on atomic defense with the broadcasters in this state\nsuch as hav© been planned with the Alabama Press group."
}