{
  "id": "d286-138",
  "text": "HJS:\nHerewith my chicken tracks on the professional advancement proposal. I\ndidn't think you'd want me to have it typed up, even in draft form, until\nyou'd had a chance to look at what I'd done to it.\nI may not have cut m as much as you had intended, but, with some of the\nchanges I have suggested, I think the sections I have left in add something.\nI'm not sure in my own mind whter we still want to propose the advance meeting\nwith the Foundation and Deans of Education, etc., as contained in our origi¬\nnal proposal (and in our brief minute or two of discussion you didnft have\ntime to comment to me on this), but it may be a good idea, so I've left it\nin. We can easily delete it if we dtwjsib&d decide it isn't necessary, or\nwouldn't appeal to the foundation\nYou will find that I have made insertions, deletions, etc., and then later\ncrossed out some sections containing such changes. This was because I went\nthrough, making certain changes, etc., then realized I probably hadn't\ncut enough and went back to make further changes and larger cuts.\nAgain, referring to the fact that I didn't cut as much as you suggested,\nI felt that at least some of the background material was essential to\nan adequate understanding of the problem and what we had in mind as a\nway to help meet the problem. However, I may be wrong and would certainly\nconcur with any other cuts you felt would help \"tighten-up\" the request.\nI wonder if we should change the dates listed at the end (the yearly periods,\nthat is) and make it start in the fall (if we can get it set up that soon)\nor perhaps the first of I960. I know we can't get it started by July 1\neven if it were possible to get a reaction to our request by then (which it\nisn't), and yet it almost has to be tied in with the academic year. Per¬\nhaps the start could be set for the second semester of the 1959-60\nacademic year - about February 1. If we propose to wait until next (I960)\nJuly 1 for the start of the grant, they will feel there is no urgency (and\nthere certainly is). This matter of timing presents a real problem, and I\nfrankly hadn't thought of it before.\nI was unable to do any cutting in the actual project proposal itself, be¬\ncause it seems about as brief and concise already as it can be.\nI hope my suggestions will help. It doesn't look like much, I suppose, but\nI spent about three hours, reading, cutting, re-reading, etc., trying to\ncut out excess without hurting the sense of what we're trying to say.\nheh\n6/17/59"
}