{
  "id": "d88-25",
  "text": "TO : Executive Cornua.ttee and Harry Skornia\nFROM: John W. Dunn\n5/31/54\n1\nReplying to a number of questions raised recently by Harry Skornia and Others:\n!• Agree that Armand has a right approach regarding utilization of commercial\nnetwork personnel. I would insist, however, that someone with the ranks of educa¬\ntional radio and TV vouch for these people. Many network and local radio and TV\npersonnel are attracted to educational radio and TV because of the advantages which\nwould be theirs o At the same time they can be awful STINKERS unless they are\nindoctrinated with at least some of our philosophy of broadcasting. Maybe we\nshould devise some ss Bihod of doing a little \"brain washing\". Key people (like\nRudy Bretz) would be quite valuable in seminars and especially workshops because\nmethods and standards are somewhat the same whether it’s educational of ccnanercial.\n2. Are you being \"subtle\" with Neely, Brother Skornia 1 Keep up the pressure.\n3. Suggest that we STOP practice of trading tapes with stations. Don’t think we\ncan afford it. No one in the business is harder pressed for personnel, time and\nmoney to buy tapes than we are, YET we have ALWAYS dubbed tapes when we couldn’t\nuse network tapes immediately or wanted to save for summer or another period of\nbroadcasting. John Holt says he thinks it’s only \"human and natural\" for NAEB\nstations to poke off their old beat up tapes for good ones. I think it’s down¬\nright premeditated and cussed for them to do so. Hence my STRONG recommendation\nthat we put a stop to this dishonest and expensive (to NAEB) practice.\n4. Everyone trying to get into the act — yelling their little workshop is worthy,\netc. is kind of disgusting. Of course it’s only natural for every old hen to think\nher chicks are oJc0 A pat on the back for Harry and keep a stiff upper lip, brother.\nDon’t let ’em high pressure you. I think you’ve been pretty tactful with these\nmavericks — far more so than they deserve. Dead lines are important and I think\nno workshop should be recognized unless it is sponsored by an accredited institu¬\ntion of higher learning.\nWhat’3 this about rights to kinescopes? It seems to me this is an entirely\ndifferent problem from the one orginaily designed for brother Novik to handle,\nand it appears that most of the difficulties arise AFTER the kineshave been made.\nETRC and NAEB should be insistent that individual stations undertaking the making\nof kines for ETRC should have all these labor rights cleared before money is\navailable to them. Novik might be assigned to these cases at the request of ETRC\nprovided there are no pressing demands for him from stations trying to get on the\nair or actually telecasting. Such stations should take precedence. I think you,\nHarry, will use your best judgement on this matter."
}