{
  "id": "d88-28",
  "text": "Gentlemen:\nPerhaps Harry*s letter of June 7th to Graydon requires no answer or reaction from\nthe Executive Committee* However, I can't refrain from making a few observations\nfor whatever they're worth regarding the proposal contained therein, (no snide\nremarks from the Gentleman from Illinois—Frank Schooley)\nAs you know, I have felt for some time that the NAEB Network is in need of a com¬\nplete examination and perhaps a wholesale overhauling. This thing, as I have point¬\ned out before, has just \"growed\". No one is to blame except the organization it¬\nself. However, each year sees the network assessment growing; each year we lose a\nfew members and many more are desperately counting their pennies to see how long\nthey can stay in.\nThe Network, so far as programming is concerned, has gone off on some pretty wild\ntangents at times. In most instances it has lost its original purposes of being\nan EXCHANGE CENTER between member stations of NAEB for programs.\nThe so-called Network Acceptance Committee has acted in a high-handed, arbitrary\nfashion — discouraging network participation and contribution. There has not been\none constructive idea to come from this group. For a time I thot the In-School\ngroup was somewhat better, but it is apparaent now that they,too, are mired down.\nBoth of these groups yell about submitting programs for their so-called considera¬\ntion. Yet when you do send in programs., .you never hear anything about them ( even\nthough you may have dozens and dozens of tapes tied up).\nTherefore, I see no use in compounding a felony by taking the Chairman of these\ngroups and creating a so-called \"coordinating committee\". True there may be spme\nbeautiful speeches and brilliant recommendations that will stuff up the chimneys.\nGet some new blood into this thing, forget some of the old nesters and moss-backs,\ntreats a committee that will have power to get in there and do something, that will\nplan ahead program-wise, that will encourage member-wide participation — a committee\nthat can pull these other committees up by the scruff of the neck and make 'em\nfunction as they should. I'll vote for that kind of a committee; the other kind is\na mere waste of pencil and paper to put 'em down.\nAnd while we're on the subject of committees..some very definite directives were\nhanded down at the last convention* Nearly eight months have passed and to my\nknowledge NOTHING has been done about them* It was not the intention of the conven¬\ntion that we should wait until we assemble in New York to act*"
}