{
  "id": "d1345-11",
  "text": "8\nhas dropped from 2.7 per cent of total program\ntime in 1953 to 1.3 per cent in 1954; and ro¬\nmance drama makes up only 2.2 per cent of total\nprogram time in 1954 as compared with 5.1 per\ncent in 1953. Most of the remaining sub-classes\nof drama—action and adventure, classics, fairy\ntales, historical drama, and musical drama—show\nlittle change since 1953 in the proportions of\ntotal program time accounted for by each. The\ncatch-all sub-class of “other\" drama, which makes\nup 2.7 per cent of total weekly program time in\n1954, is up 2.6 per cent over the 1953 figure.\nFor reasons discussed in Chapter 1, monitors\nindicated the intended audience (domestic, chil¬\ndren, or general) of all programs as a step sep¬\narate from the classification of the program. The\nprimary cues for this judgment came from the\nactions and words of the performers, and from the\nmentions of specific groups by the program an¬\nnouncer; e.g., \"Ladies,. . .\" (a \"domestic\"\nprogram), or \"Hey, kids, . , .\" (a children’s\nprogram). In previous years, the distinction among\nthe various intended audiences was accomplished\nby having a duplication of program classes for\nthe different audience groups. That is, in 1953\nand earlier years, the program classification scheme\nincluded a class of general drama, a class of\ndomestic drama, and a class of children’s drama.\nNot all subclasses under any one of these classes\nwas duplicated in the other two classes, however.\nFor this reason, it is difficult, and perhaps not\ncompletely justifiable, to compare the various in¬\ntended audiences in 1954 with those from previous\nyears. However, Table 1 in the Appendix does\nshow the intended audiences under each type and\nclass of program for the years 1951 through 1954;\nwhere comparable data could not be found or re¬\nconstructed, an appropriate notation has been enter¬\ned.\nFigure 5 shows that about the same proportion\nof total program time in 1954 was judged to be\ndrama intended for the general audience as in\n1953 (37.8 per cent as compared with 37.3 per\ncent). Only 1.6 per cent of total program time\nin 1954, as against 5.8 per cent in 1953, was made\nup of drama for domestic audiences, but drama for\nchildren increased from 3.9 per cent of total pro¬\ngram time in 1953 to 6.8 per cent in 1954—a\nfigure closer to that found in 1951 and 1952.\nFigure 6 shows the proportion of total weekly\nprogram time devoted to entertainment type pro¬\ngrams other than drama. As in previous years,\nvariety programs are second to drama in the pro¬\nportion of total broadcast time found in them,\nand this proportion has varied slightly around 11\nper cent during the past three years.\nMusic programs of all kinds have shown a\ngain of 2.3 per cent since 1953 and now account\nFigure 5\nNEW YORK TV: PROPORTION OF TOTAL WEEKLY PROGRAM TIME\nDEVOTED TO DRAMA FOR VARIOUS AUDIENCE GROUPS\nPercent\n0 15 30 45 60\n1951 1\n.\n1.1\nDomestic Drama\n4.0\n5.8\n1954\ni\n1.6\n1951\n7.8\n1QS2\nChildren’s Drama ^53\n6.7\n3.9\n1954\n6.8\n24.3\n1951\nGeneral Drama\n31.7\n37.3\n1954\n37.8\n1"
}