{
  "id": "d1345-13",
  "text": "10\nfor 6.7 per cent of all program time. Table 1 in\nthe Appendix shows that a large part of this gain\nwas made in the sub-class of music and patter\n(formerly made up in part of ‘ ‘house wives’ music ’ ’).\nTwo classes of entertainment-type programs have\nshown slight but steady downward trends over the\nfour years: (1) quiz, stunt and contest programs\nare now down to 5 per cent of total program time,\nand (2) spectator sports have dropped to 3.4 per\ncent of total time. The decrease in 1.9 per cent\nof total time in spectator sports since 1953 may\nbe a function of the fact that the 1954 study was\nconducted at the end of January, while previous\nstudies were conducted during the first week of\nJanuary and thus contained the last of the many\nholiday sports events.\nThe class of personality programs gained 2.1 per\ncent of total weekly program time since 1953,\nand now accounts for 4.8 per cent of total time.\nAll other classes and sub-classes of entertainment\ntype programs have shown little variation since\n1953, and account for less than one per cent of\ntotal program time.\nRecall from Figure 3 that 17.4 per cent of\nthe total program time during the week of January\n25 to 31, 1954, was made up of information type\nprograms. Figure 7 reveals how much of the total\nweekly program time was found in the various\nclasses of information programs. In 1954, general\ninformation programs comprised 9.2 per cent of\ntotal program time—a drop of 3.6 per cent since\n1953. News programs have remained at about the\nsame level and account for 6.1 per cent of total time\nin 1954. Sports news and weather programs have\nalso remained steady over the past few years, and\naccount for 1.5 and 0.7 per cent of weekly program\ntime, respectively, in 1954.\nF igure 8 presents a more detailed analysis oi\nthe class of general information programs into its\nvarious sub-classes. Among the general information\nprograms, cooking programs account for the largest\nshare of total program time with 2.1 percent in-\n1954, a slight drop since 1953. The next largest\nsub-class of general information is that of “other”\ninformation with 1.8 per cent of total time. This\ngroup of programs has not fluctuated greatly over\nthe years. The sub-class of personal care shared\nless total program time in 1953 and 1954 than in\nprevious years, and now accounts for 1.5 per cent\nof all program time. Shopping and merchandis¬\ning programs have also decreased in the last\ntwo years as compared with 1954 and 1952,\nFigure 7\nNEW YORK TV: PROPORTION OF TOTAL WEEKLY PROGRAM TIME\nIN VARIOUS CLASSES OF INFORMATION TYPE PROGRAMS\nPercent"
}