{
  "id": "d1345-17",
  "text": "14\nObviously few variations in the apportionment of\nprogram time among the three types of program\nmaterial are found.\nFor the domestic hours, entertainment type\nprograms have taken up a greater portion of time\nin 1953 and 1954 than in the two previous years,\nand now account for 71.5 per cent of domestic\nhour time. To compensate for this increase in\nentertainment programming, proportionally less\ntime is devoted to information and orientation pro¬\ngrams in the last two years.\nThe distribution of children’s hours time among\nthe three major types of program material remained\nfairly constant from 1951 to 1953, but entertain¬\nment type programs made a 6.0 per cent gain in\n1954 and now account for 81.2 per cent of the\nchildren’s hours. Since the children’s hours begin\nat sign-on and last until 7 p.m. on Sundays, they\ninclude the daytime religion programs and public\nissues programs for that day. Thus, children’s\nhours lead in the proportion of orientation-type\nprograms.\nThe adult hours consistently have carried the\nlargest proportion of entertainment type programs,\nand the figure of 83.2 per cent found for this type\nin 1954 appears to be typical. Information pro¬\ngrams have gained 2.4 per cent in the adult hours,\nwhile orientation-type programs have dropped\nslightly.\nThe late hours have shown a steady trend toward\na smaller proportion of entertainment type pro¬\ngrams. In 1954, they lost another 7.2 per cent of\nentertainment programs, and now contain only\n72.0 per cent of such material. Information type\nprograms have gained fairly steadily in the late\nhours, and in 1954 this time segment contained\nthe largest proportion of information with 23.5\nper cent of its time so employed. Much of this\ninformation in the late hours consists of shopping\nand merchandising programs in 1954, which are\nFigure 11\nNEW YORK TV: THE PROPORTION OF TOTAL WEEKLY DOMESTIC\nHOUR PROGRAM TIME DEVOTED TO SELECTED CLASSES\nOF ENTERTAINMENT\nPercent"
}