{
  "id": "d1345-18",
  "text": "lea.ving the domestic and children’s hours in favor\nof later spots.\nFigure 11 provides a closer look at the enter¬\ntainment-type; programming during the domestic\nhours. Again in 1954, the largest protion of the\ndomestic hours is occupied by drama programs with\n24.2 per cent of the segment; this figure is down\n8.6 per cent from 1953. Table 2, Appendix B,\nshows how domestic hour program time is dis¬\ntributed among the various sub-classes of drama.\nVariety^ programs make up the second largest pro¬\nportion of domestic hour time with 15.6 per cent\nof such time, and have accounted for about the\nsame proportion since 1952, when variety pro¬\ngrams in the domestic hours dropped to about\nhalf their 1951 level. Music programs and per¬\nsonality shows have made substantial gains in the\ndomestic hours and now make up 11.8 and 12.4\nper cent, respectively, of all domestic time. All\nquiz, stunt and contest programs show a steady\ndecline since 1952, and now account for only 6.9\nper cent of domestic hour time.\n15\nFigure 12 illustrates the distribution of chil¬\ndren’s hours among selected classes of entertain¬\nment. As in all time segments, drama programs,\nwith 57.2 per cent, constitute the largest propor¬\ntion of the children's hours; very little change in\nthis proportion has occurred over the years. Table 3,\nAppendix B, provides a closer examination of all\nsub-classes of drama in the children’s hours. Va¬\nriety programs continue their upward trend in 1954,\nand now account for 13.0 per cent of the children’s\nhours. All music programs have had a varied\nhistory in the four years of the studies falling\nfrom 4.2 per cent in 1951 to a low of 1.5 per cent\nin 1952, and now once more accounting for 4.2\nper cent of the children’s hours. Quiz, stunt and\ncontest programs have remained fairly steady,\nand account for 2.2 per cent of the children’s\nhours in 1954. Sports programs in the children’s\nhours are made up of events shown on Saturday\nand Sunday afternoons. In 1954, they made up\n3.3 per cent of children’s hours.\nFigure 12\nNEW YORK TV: THE PROPORTION OF TOTAL WEEKLY CHILDREN’S\nHOUR PROGRAM TIME DEVOTED TO SELECTED CLASSES OF\nENTERTAINMENT\n25\nPercent\n50\n75\nDrama, All\nMusic, All\nQuiz, Stunts and\nContests, All\nSports\nVariety, All\n1951\n1952\n1953\n1954\n1951\n1952\n1953\n1954\n100\n55.7\n55.9\n57.3\n57.2\n4.2\n1.5\n1.9\n4.2\n2.6\n2.2\n3.2\n2.2\n3.1\n4.2\n1.5\n3.3\n8.2\n9.8\n10.3\n13.0"
}