{
  "id": "d1345-19",
  "text": "16\nFigure 13 analyzes adult hour programming\nwithin selected entertainment-type classes. In\nthe adult hours, drama programs have steadily\nrisen until they now account for 55.5 per cent\nof the adult hours. Table 4, Appendix B, gives\na finer analysis of adult hour programming among\nthe sub-classes of drama. Sports and variety pro¬\ngrams have both shown steady declines since 1951,\nand now account for 7.9 and 5.5 per cent, re¬\nspectively, of all adult hours. Music programs,\nwhich make up 5.6 per cent of 1954’s adult hour\nprogramming, and quiz, stunt and contest pro¬\ngrams, which account for another 7.4 per cent of\nthe current adult hours, have remained fairly steady\nover the four years.\nComparable data from previous years are given\nfor various classes of information and orientation\nprograms in the adult hours in Tables 5 and 6 in\nAppendix B.\nFigure 14 shows that the largest classes of enter¬\ntainment-type programs in the late hours are drama,\nwith 56.6 per cent, and variety, with 7.6 per cent\nof all late hour time. The trend for drama in the\nlate hours is clearly downward from the high of\n74.0 per cent attained in 1952 when almost three-\nfourths of the program time after 11 p.m. was\nmade up of cinematic drama. Since 1952 other\ntypes of program material, including some variety\nand personality programs, shopping and merchandis¬\ning information, and so on, have been injected\ninto the early portions of the late hours. Particularly\non the network stations, the “late-late” movies\nhave been moved to midnight or later.\nSports programs (often movies of past events)\nin the late hours have also declined, as shown in\nFigure 14. Music programs have remained about\nthe same at the low level of 1.9 per cent of total\nadult hour time, and quiz, stunt and contest pro¬\ngrams occupy a vanishingly small (0.5 per cent)\npart of the adult hours.\nAlmost by definition, the various time segments\ndiffer in the proportions of time devoted to pro-\nFigure 13\nNEW YORK TV: THE PROPORTION OF TOTAL WEEKLY ADULT HOUR\nPROGRAM TIME DEVOTED TO SELECTED CLASSES OF ENTERTAINMENT\nPercent\n0 25 50 75 100"
}