{
  "id": "d1345-21",
  "text": "18\nSimilar data for information-type programs are\npresented in Figure 16. Since 1951, the domestic\nhours have lost 12.4 per cent of information pro¬\ngram time to other time segments, but still account\nfor 44.3 per cent of all information program time\nin 1954. The children’s hours retreated from a\nhigh of 25.0 per cent in 1953 to their former level\nof 20.1 per cent information programming in 1954.\nAdult hours have increased their share of the total\namount of information time until they now ac¬\ncount for 20.7 per cent of such programming. Late\nhours, too, have increasingly shared in the infor¬\nmation time.\nFigure 17 shows that the children’s hours have\ngarnered the largest share of orientation-type pro¬\ngrams—largerly because they include the morning\nand afternoon programs on Sunday which contain\nmany religious and public issues topics. In 1953,\nchildren’s hours contained 41.2 per cent of orien¬\ntation time, but by 1954 this proportion decreased\nto 35.3 per cent. Domestic hours have steadily\nlost their share of orientation time, and are cur¬\nrently tied with the adult hours with about 27 per\ncent of orientation program time. In 1954, the\nlate hours jumped from their previous level of 3.1\nper cent to 10.2 per cent of orientation program\ntime.\nIn Appendix B, Tables 8 through 16 present\nanalyses of the distributions of selected classes of\nentertainment, information and orientation among\nthe four time segments of the broadcasting day.\nTable 17 in Appendix B shows how programs for\nthe various audiences are distributed among the\ntime segments. An especially interesting finding\nillustrated in Table 17 is the fact that programs\nfor the different audiences have shown a return\nto more appropriate time segments in 1954. In\npast years, for example, children’s programs have\nslowly dispersed over the various time segments\nuntil only 59.4 per cent of them were found in the\nchildren’s hours in 1953. In 1954, this trend has\nbeen reversed, and 80 per cent of the children’s\nprograms now are found in the children’s hours.\nThe Form of New York Television Programs.\nSince 1952, the monitoring studies of New\nYork television have made a practice of noting\nwhether each program is live or recorded on\nfilm. If live, the program is further classified\nas to whether it is a local or remote production;\ni.e., whether it is produced in New York or brought\nin on network cable or micro-wave. In making\nthese classifications in 1954, the principle of pre-\nFigure 15\nNEW YORK TV: THE DISTRIBUTION OF TOTAL ENTERTAINMENT\nTIME AMONG THE VARIOUS TIME SEGMENTS\nPercent\n0 25 50 75"
}