{
  "id": "d1345-23",
  "text": "20\ndominance was used. Thus if a program con¬\ntained some recorded material, but was predomi¬\nnantly live, it was classified as live. With this\narbitrary device, news and weather programs were\nclassified according to form for the first time in\n1954. For this reason, the amount of live material\nin information programs will show an increase over\nprevious years.\nF igure 18 shows the distribution of program time\namong the three forms of programs; data are in¬\ncluded for entertainment, information and orienta¬\ntion programs as well as for all types taken to¬\ngether. Slightly more live material in all types\nof programs appeared in 1954 than in 1953. Orien¬\ntation and information programs both show substan¬\ntial gains in proportions of live time; as noted\nabove, part of this gain in information type pro¬\ngrams is due to including for the first time in\n1954 news and weather programs, usually live, in\nthe analysis of program form. Entertainment\nprograms also have increased in live programming\nby 4.7 per cent. More detailed analyses of pro¬\ngram form for selected classes of entertainment,\ndrama, information, orientation are presented\nin Tables 18, 19, 20, and 21 in Appendix B.\nA large part of the gain in live programming\nin 1954 New York television is attributable to the\nincreases in total program time on the network\nstations, which largely carry live programs, and the\ndecreases in total program time of the independents,\nwhich depend heavily upon recorded material for\ntheir programs. The fact that the network stations\n(WCBS-TV, WNBT, WABC-TV and WABD) carry\nmore live program time than the independents can\nbe seen in Figure 19.\nFigure 18\nNEW YORK TV: THE PROPORTION OF EACH MAJOR PROGRAM\nTYPE IN LIVE-LOCAL, LIVE-REMOTE, AND RECORDED FORM\n25\nPercent\n50\n75\n100\nTotal Program\nTime\nEntertainment\ntype programs\nInformation type\nPrograms\nOrientation type\nPrograms\n1952\n1953\n1954\n1952\n! 1 48.3_5l3\n46.4\ni 143.4 3.7\n52.9\nS3\n; 148.5 6.6\n44.9\n' ' 5\n42.6 4.8\n52.6\nSSI\n139.7 3.2\n57.1\nSH\n140.8 678 |\nSSI\n1\n80.C\n1\n2.0 18.0"
}