{
  "id": "d1345-3",
  "text": "Acknowledgment\nThe study here reported could not have been accomplished without the active cooperation\nof many persons and organizations. It is, therefore, a pleasurable duty to acknowledge this\nassistance.\nFunds for this study, as well as publication, were generously provided by the Fund for Adult\nEducation, out of its deep interest in the educational and social impact and potential °f tele¬\nvision in America. The sincere thanks of the present research staff, as well as the NAEB,\nare hereby expressed for making possible this study in addition to earlier NAEB TV Monitoring\nStudies.\nVarious officers of the National Association of Educational Broadcasters, especially Frank\nE. Schooley and Harry J. Skomia, were helpful in providing orientation from previous studies\nto what was for us a relatively new and complex problem of organization and analysis.\nIn the recruitment of monitors we are indebted to Milton L. Blum, New York City College;\nStuart W. Cook, New York University; Eugene L. Hartley, New York City College; Benjamin\nB. Ringer, Columbia University.\nRichardson, Bellows, Henry and Company, in addition to renting us space, generously made\navailable for our use office equipment including a typewriter and desk calculator as well as\ntheir staff lounge. We are especially indebted to Miss Cynthia Weiss and Mrs. Eleanor Peon of\nthe RBH staff for making detailed arrangements concerning scheduling of monitors and for\nadmission to the premises before and after business hours.\nStop watches were generously made available by the Department of Industrial Engineering\nof Purdue University.\nAs with the previous studies in the series, the Zenith Radio Corporation went to great lengths\nto provide ample television sets, head phones and servicing of the installations. Ted Leitzell,\nW. W. Boyne, S. Reich and George Keck have our sincere thanks.\nTo Leigh Van Ausdall and John Paisios of the Purdue staff is due our full appreciation for\ntheir careful, conscientious supervision of the monitors during the long hours dictated not by\nregular business hours but by the hours of on-the-air television.\nLast but not least we wish to express our appreciation of the fine spirit and faithful, con¬\nscientious service of the monitors, who were juniors, seniors and graduate students in the institu¬\ntions of higher learning in the New York City area. Their names follow:\nJay Bienstock\nSonia Brounstein\nFred Cohen\nLeona Cooperman\nMaury Feld\nCarl Fisher\nPhilip Gittelman\nAlbert Gottesman\nGeorge Gunning\nEdward Haiken\nCarl Hoffman\nRobert Itzkin\nRichard Kemer\nMarvin Lebow\nMarvin S. Lemer\nSpencer Levey\nIrwin List\nEdward Merz\nDoris Miller\nHerbert Nager\nMyron Peikes\nRichard A. Regan\nAlbert Reisman\nSteve Schatt\nJerome Siegel\nArthur Simons\nMarvin Small\nJim Souvelekis\nSandra Starkman\nMartin R. Towey\nEric Weiss\nDavid Wolsk\nJoan Zalinsky"
}