{
  "id": "d1345-4",
  "text": "/\nDnttoduction\nThis report covers the fourth of the annual\nstudies of New York television that have been\nconducted since 1951. This study, carried out\nduring the week of January 25 to 31, 1954, con¬\ntinued the practice of analyzing the format and\ncontent of every minute of commercial television\noriginating from transmitters in metropolitan New\nYork during the study week.\nIn brief, the television programs were monitored\nby college students who used specially constructed\nlog sheets and stop watches to classify the programs\n(drama, variety, news, etc.), to time advertise¬\nments and public agency announcements, to record\nthe frequency and context of violence shown, and\nto record the form—live or recorded—of the pro¬\ngram. A full explanation of the techniques of\nthe 1954 study is contained in the monitor’s man¬\nual, Appendix A of this report.\nRevisions in Monitoring Techniques.\nOne of the objectives of the 1954 study was to\nobtain information comparable to that reported in\nprevious studies. For the most part, this objective\nwas accomplished. However, some changes in\ntechniques were adopted to facilitate the collec¬\ntion and analysis of data so that an earlier publica¬\ntion date for this report could be met. In brief,\nthe following major changes over past procedures\nwere incorporated in the 1954 study:\n1) A minor revision of the program classifica¬\ntion scheme was made. In the old classification\nscheme, many program classes were repeated to\ntake into consideration the intended audience of the\nprogram. For example, there were several classes\nof variety: one for general audiences another for\ndomestic audiences and a third for children.\nIn the new classification scheme, all such dupli¬\ncated program classes were consolidated. Then, as\na separate piece of information obtained for all\nclasses of programs, the apparent intended audience\n(i.e., general, domestic or children) was noted dur¬\ning the monitoring of the program. Also, several\nnew classes were added to handle new program\ntypes observed during pretesting procedures. The\nnew program classification scheme is included in\nthe monitor’s manual, Appendix A.\n2) Only information to be reported was collect¬\ned. In past years, monitors were required to record\nmuch information that never found its way into a\nreport. In the 1954 study, the information to be\nreported was first selected, and then a log sheet\nwas designed upon which this information could\nbe recorded efficiently. This sheet collected only\ninformation comparable to that in previous reports\nand to be used in the final report of the 1954\nstudy. A sample copy of this sheet appears with\nthe monitor’s manual, Appendix A.\n3) Monitors were given greater responsibilities.\nWe judged that greater accuracy of monitoring\n^ould be obtained by making as many decisions\nas possible during the program. Then, if uncertain¬\nties arose, monitors and supervisors could confer\nwhile the program in question was still before them.\nAll initial program classifications were made by the\nmonitors with the assistance of supervisors.\n4) Accuracy of timing was improved. Stop\nwatches were used to time all advertising to the\nnearest tenth of one minute.\n5) A more direct approach to the timing of\nsecondary advertising was used. In previous years,\nan indirect estimate of secondary advertising time\n(cf. Chapter 5 for definitions) was used. This\nwas replaced in 1954 with a direct timing of such\nmaterial.\n6) Monitors worked in teams of two per channel.\nIn addition to reducing the amount of information\ncollected, a further precaution against errors was\ntaken in 1954 by assigning two monitors to each\nchannel at all times. In this way, monitoring\nduties were divided so that, for example, one\nmonitor recorded advertising time.\nA further advantage in the use of two monitors\nper channel came from the cross-stimulation be¬\ntween team members. Supervisors frequently heard\na monitor asking his partner, “Did you get that\nviolence?” or, “Isn’t that a secondary advertise¬\nment in the background? ’ ’\n7) All data were punched into JIM cards and\nanalyzed by machine. By using a carefully planned\nlog sheet, the data from the study were logged in"
}