{
  "id": "d1345-40",
  "text": "Violence on A/ew\nBeginning with the 1952 study of New York’s\ncommercial television, an interesting phase has\nbeen the analysis of violence found in the program\nmaterial. In 1954, this practice was continued\nwith essentially the same definitions and methods\nas reported for previous years, with the exception\nthat the classification of the agents and means\nof violence was not quite as fine as in the past.\nThe following definitions are quoted from previous\nreports of the New York TV studies:\n“Violence is defined to include physical\nor psychological injury, hurt, or death, addres¬\nsed to living things. An ‘act’ is defined as\nan episode of whatever duration which concerns\nthe same agent and the same receiver. Thus,\na battle scene would be one act; a chase scene\nwith a posse pursuing a man would be one act,\neven if interrupted by flashbacks to other scenes;\nan attack by one person on a second, in the\ncourse of which a third person attacks the first,\nwould be two acts. A ‘threat’ is defined as\nany manifest threat to commit an act of vio¬\nlence.”\nEach act of violence was further classified ac¬\ncording to the agent and means used by the agent,\nas follows:\n1. Human agents\na) With Weapons\nb) Weaponless\nc) Legal, verbal, other\n2. Non-human agents\na) Act of nature\nb) Accident\nc) Act of animal\nd) Miscellaneous\nThe monitor’s manual, Appendix A, includes\ndetailed definitions of the various agents and means.\nThe practice from previous years of further classify¬\ning means into specific examples, such as gun,\nknife or club under (a) Weapon, was not continued\nin this study.\nIn 1952, all acts ot violence were classified\naccording to the contexts in which they were found;\ni.e., whether or not the act or threat occured in\na humorous or non-humorous context. This practice\nwas discontinued in 1953. In 1954, we elected\nIf otk \"Television\nto apply a classification to violence according to\nthe extent to which the context included devices\njudged to be “tension-producing.” Such an analysis\npossibly is contrary to the stated policy of not\nattempting to evaluate the effects of program mat-\nerail monitored in these studies. On the other\nhand, certain practices and devices are deliberately\nused in motion pictures, radio, television and on\nstage because they are known to create tension in\nthe audience, or to “thrill” them. Some of these\ndevices and practices are as follows:\n1. Measured, ominous background music.\n2. Shadowy, dark, “low-key” lighting.\n3. Relatively clear depiction of terror or horror\nin the actions or expressions of characters.\n4. Screaming, crying, moaning; other sound\neffects.\n5. Stealthiness of movements on the part of the\nagent.\nOf course, whether or not such devices are successful\nin thrilling television audiences is not known from\nempirical evidence, although it is probably safe\nto assume their effectiveness.\nThree contexts of violence were defined for the\nmonitors in the 1954 study:\nContext I. Violence accompanied by tension pro¬\nducing or “thrilling” stimuli, as described\nabove.\nContext II. Violence not accompanied by tension\nproducing stimuli, but yet not sham violence\nor humorous violence. (Some of the “routine”\nviolence in Western drama falls in this context).\nContext III. Sham violence or humorous violence,\nsuch as the comedian’s fall.\nFuller definitions, with illustrative examples, ap¬\npear in the monitor’s manual, Appendix A.\nViolence in the 1954 Study.\nDuring the week of January 25 to 31, 1954,\n7,065 acts and threats of violence were monitored\non the seven channels of New York commercial\ntelevision. This figure is more than twice the\ntotal of 3,421 acts and threats observed in 1953,"
}