{
  "id": "d1345-42",
  "text": "39\nApart from .the possibility that the 1954 staff\ngave broader interpretations to the definitions of\nviolence to produce the remarkable increase in the\nquantity of such material that was monitored, it is\nalso possible that a part of the increase may be\nattributable to the use of two monitors per program\nin 1954, as compared with only one in previous\nyears. As we show in a later chapter, it appears\nthat less advertising time was missed by the moni¬\ntors in 1954 because of the greater accuracy re¬\nsulting from the use of two monitors per channel,\nand it is equally possible that the use of two moni¬\ntors reduced the amount of violence that would\notherwise have been missed. And, of course, the\nthird possibility to account for the increase is that\nthere actually was much more violence shown in\nthe study week of 1954 than in 1953.\nSince the amount of violence increased over\n1953, it follows that the frequency with which acts\nand threats were encountered in 1954 must have\nbeen higher in the absence of corresponding in¬\ncreases in total program time. Thus, acts and\nthreats of violence were encountered at the average\nrate of 10.7 per hour of programming in 1954,\nas compared with 6.2 per hour in 1953. Hence\na viewer of New York television can expect to\nfind an act or threat of violence on the average\nof once in about every six minutes of program\ntime.\nViolence in the Programs.\nIn 1954, 97 per cent of all violence monitored\nwas found in entertainment type programs. Further¬\nmore, because of special problems in definition and\nin application of methods, violence found in sports,\nnews, weather, public issues and public events pro¬\ngrams is excluded from the total violence analyzed\nin this chapter. For these reasons, the practice\nof previous reports in restricting the analyses to\nviolence found in entertainment-type programs will\nbe followed here.\nFigure 35 shows the number and frequency of\nacts and threats of violence in entertainment type\nprograms for the years 1952-1954 In all years,\nthe greatest amount of violence is found in drama\nprograms. In 1954, such programs contained 6,182\nacts and threats of violence, or 87.5 per cent of\nall violence monitored. The greatest frequency\nof violence, however, consistently has occurred in\ndrama for children, which has an average of 38.2\nacts and threats per hour in 1954. In all years,\nvariety programs have been second in both quantity\nand frequency to the general class of drama. In\n1954, 519 acts and threats were found at the rate\nof 7.1 per hour of variety programming.\nInasmuch as drama programs contain the bulk\nof violence on New York TV, further attention\nis given to the four largest sub-classes of drama\nin Figure 36. These sub-classes, action, comedy,\ncrime and western drama, account for almost eighty\nper cent of 1954's violence. All comedy drama,\nwith 1,760 acts and threats, and all crime drama,\nwith 1,711 acts and threats, contain the largest\nquantities of drama in 1954, followed closely by\nall western drama with 1,542 acts and threats.\nThe highest frequency of violence is found in com¬\nedy drama for children, with 66.0 acts and threats\nper hour, or more than one per minute. In 1954,\nchildren’s comedy drama was made up largely of\nanimated cartoons; the reader’s experience with\nsimilar material on television and in motion picture\ntheatres probably will confirm the high frequency\nof violence in such cartoons.\nWestern drama once again has the second highest\nfrequency of violence, with 32.9 acts and threats\nper hour in 1954. Note that in this and other classes\nexcept comedy drama in Figure 36, not much dif¬\nference in frequency is found between children’s\ndrama and the total class. It is curious that the\nfrequency of violence in western drama has been\nsteadily rising since 1952; almost all western drama\non television is presented in the form of old motion\npictures. It is not clear to us why the frequency\nof violence should be increasing in a drama class\nover which television broadcasters have little con¬\ntrol and in which the content, including the violence\nshown, is almost traditional.\nThe Agents and Means of Violence.\nFigure 37 shows that television consistently\nemphasizes man’s inhumanity to man. In. 1954,\n81 per cent of all acts and threats of violence\nwere committed by human agents. Of the human\nviolence, about as much has been committed with\nweapons as without in all years studied. Verbal,\nlegal and other miscellaneous kinds of human vio¬\nlence have been rising.\nIn past years, accidents accounted for half of\nthe non-human violence on TV, but in 1954,\nacts of animals replaced accidents as the largest\nclass of non-human agents. Much of the “animal”\nviolence reported in this class was committed by\nthe characters of animated cartoons. Some prob¬\nlems in classification were encountered with these\ncartoons; some “animal” characters acted and\nspoke like humans, thus causing monitors to be\nundecided about whether their violence was animal\nor human."
}