{
  "id": "d1345-47",
  "text": "44\ngeneral audience. In view of the overall increase\nin monitored violence in 1954, this finding may\nreflect a real trend toward reduced violence on\nchildren’s action drama programs.\nIn 1954, no crime drama in the children’s hours\nwas directed specifically toward children, and the\namount of all crime drama in the children's hours\nwas reduced from 17.5 per cent of total children’s\nhours time to 8.0 per cent. Because less crime\ndrama was shown in the children’s hours in 1954,\nthe frequency of violence was found to be more\nthan doubled since 1953 even though the amount\nof violence was only slightly higher than in the\nprevious year.\nThe Context of TV Violence.\nIn 1954, 69.4 per cent of all violence occurred\nin programs for general audiences, 29.0 per cent\noccurred in children’s programs, and the remaining\n1.6 per cent was found in domestic programs.\nF igure 40 shows how programs for the different audi -\nences compared in the contexts in which the\nviolence was observed. For all programs, 21.4\nper cent nf rhp violence was observed. For all\nprograms, 21.4 per cent of the violence was found\nin a “thrilling” or tension-producing context,\n47.0 per cent was found in a neutral context,\nand 31.6 per cent was in a humorous or sham con¬\ntext. Programs with the largest proportion of\nviolence in a thrilling context were aimed at\ngeneral audiences, for whom 26.9 per cent of the\nviolence was placed in a tension-producing setting.\nDomestic programs had the largest proportion (56.4\nper cent) of violence in a neutral context. Humorous\nviolence was shown in greatest abundance in the\nchildren's programs with 58.6 per cent of the acts\nand threats in such programs so classified.\nThe seriousness of the possible implications of\nthe very high frequency of violence in the chil¬\ndren’s programs is somewhat lessened by the fact\nthat relatively little of it occurs in tension-pro¬\nducing contexts. However, a proper evaluation of\ntelevision’s violence and of its effect upon children\nmust await the findings of much-needed research.\nSo many conflicting hypotheses have been offered\nconcerning the effects of television, that value\njudgments can not have a sound basis at this time.\nFor example, some argue that violence should\nnot be shown on television because it will serve\nFigure 40\nNEW YORK TV: PROPORTION OF VIOLENCE IN EACH OF THREE\nCONTEXTS, BY INTENDED AUDIENCE OF PROGRAM\n100"
}