{
  "id": "d1345-49",
  "text": "5\n■Advertising in A/ew Ifotk 'Television\nAs in previous chapters, it is necessary to devote\na few paragraphs to methodology before discussing\nfindings. The reader should understand that this\ndiscussion of the methods and definitions of the\nstudy not only makes possible an informed inter¬\npretation, but also provides the bases for proper\nqualification'of the findings. Even an objective\nstudy, with no particular case to support, must use\narbitrary methods and definitions, and the choice\namong the various approaches to a problem will\ndetermine to a large extent the results that are\nobtained. In this chapter, for example, the quantity\nof advertising on television could have been made\nto appear larger by using the ratio of advertising\ntime to non-advertising time rather than that of\nadvertising time to total broadcast time.\nPast reports have identified two kinds of tele¬\nvision advertising, and the distinction between them\nhas been preserved in the 1954 study. Primary\nadvertising consists of messages (“commercials”)\nwhich interrupt the flow of program material to\nsell products or services. Secondary advertising\nconsists of displays, samples, and trademarks which\naccompany but do not interrupt the flow of program\nmaterial, and, in some cases, it actually constitutes\nthe program material. As examples of the latter\ntype of secondary advertising, product plugs are\noccasionally worked into the program material\nin the form of jokes, songs, or brief mentions.\nThe most fully developed form of secondary adver¬\ntising is found in programs which impart informa¬\ntion (e.g., recipes, ironing methods, etc.) while\ndemonstrating a product; such programs have been\ncalled straight secondary advertising programs.\nFor primary advertising, the 1954 study made\nno change in the definition of such material.\nHowever, to improve the reliability of the moni¬\ntoring process, two monitors worked as a team on\neach program; one timed primary advertisements\nand recorded data on program content, the other\ntimed secondary advertisements. These duties were\nperiodically exchanged. Furthermore, all adver¬\ntisements were timed with stopwatches, thus adding\nto the precision of timing.\nThe 1954 study did depart from past procedures\nwith secondary advertising; the actual amount of\nsecondary advertising in each program, as defined\nin an earlier paragraph, was timed in minutes and\ntenths with a stopwatch by one member of the\nmonitor team. In the graphs and tables of this\nreport, the amount and proportion of secondary\nadvertising found in 1954 was timed in this way.\nHowever, secondary advertising reported for pre¬\nvious years was not timed in this way, and for\nthis reason is not strictly comparable with 1954\ndata. The following schematic diagram represents\nthe differences in procedure:\nA_/_ai_h-LJ.-d-/b\nLet line AB represent the time given to a\nparticular program unit.\na r time in station break\nb s time given to primary advertisements\nc = time devoted to public agency announce¬\nments\nd = time in program content\ne = portion of program content accompanied by\nsecondary advertising material.\nIn 1954, only the actual secondary material\n(i.e., “e” in the above diagram) was timed In\n1951 to 1953, all program time exclusive of\nstation break time, primary advertising time and\npublic agency time, for programs with more than\n50 per cent secondary material, was called sec¬\nondary advertising time for purposes of computa¬\ntion; i.e., past reports used all of the “d” portion\nof the above diagram when “e” was equal to or\nmore than fifty per cent of “d”, and counted\nnone of the secondary advertising where “e” was\nless than fifty per cent of “d”.\nTotal Advertising, January 25-31, 1954\nThe 1954 study found almost the same amount\nof total advertising time as reported for 1953,\nbut, as shown in Figures 42 and 43, large dif¬\nferences appear when the two kinds of advertising\nare considered separately. The 1954 study recorded\n23*4 more hours of primary advertising for the full\nweek than in the week studied in 1953. The\nlarger amount undoubtedly is partially accounted\nfor by the new monitoring techniques; but even\nif one assumes that 10 per cent of last year s\nadvertising time was missed, giving 72.8 hours\nas a rough estimate of the actual amount of 1953’s"
}