{
  "id": "d1345-5",
  "text": "2\na convenient form for transfer to IBM cards. All\nmajor analyses were then rapidly made on tabu¬\nlating machines.\n8) The study week was changed. Still another\ndeviation from past practice occurred in the selec¬\ntion of the date for the 1954 study. In past years,\nthe data were collected in the week of January\n4-10. In 1954, it was done the last week in\nJanuary. Unless one wishes to assume that past\nstudies cannot be generalized beyond the particular\nweek studied, the shift in date should have little\nbearing upon the comparability of the studies. The\nreader should understand, however, that all the\nstudies of New York television conducted to date\nare only representative of midwinter programming;\nthey do not take into account seasonal variations\nin the amount of sports programming or the summei\nabsences of some “name” programs.\nRevisions in the Report Format.\nThe reader who is familiar with past reports\nwill find considerable changes in the organization\nof the present report. The authors are indebted to\nthe members of the National Association of Edu¬\ncational Broadcasters Research Committee for many\nsuggestions incorporated in the format of the 1954\nreport. An ever-present difficulty in writing such\na report as this stems from the multiplicity of\npurposes to which its contents may be put. Not all\nreaders will be interested in the same aspects of\nNew York television, nor will all share the same\ndegree of interest in fine detail. Obviously, it is\nimpossible to satisfy all needs and interests in a\nreport whose complication is restricted by matters\nof both cost and time. As a compromise, this\nreport has abstracted from the fine details of the\n1954 findings those highlights likely to be of\nwidest interest, and has discussed and illustrated\nthose points in the five chapters to follow. Gen¬\nerous use has been made of graphic material to\naid the reader in visualizing the 1954 results and\ntheir differences from findings in previous years.\nA minimum of tabular data will be found in the\ndiscussion.\nFor the reader whose interests go beyond an\noverview of the findings, frequent reference is made\nin the discussions to detailed tables included in\nthis report as Appendix B. Even in these tables,\nhowever, it often has been necessary to restrict\nattention to selected aspects of the data accumu¬\nlated in the four annual studies. In most cases,\nthese selections were made in previous reports and\nhave been continued here.\nSome Preliminary Definitions.\nThe timing and content analysis of all programs\nwas done in terms of the program unit. The pro¬\ngram unit includes all of the material contained\nbetween the opening of one program and the be¬\nginning of the program which follows it; it thus\nincludes the contents of the station break which\nfollows the program. Some exceptions to this\nrule are noted in the monitor’s manual. Thus,\nthe amount of time charged to a particular class\nof program also includes the time found in station\nbreaks associated with this class of program. For\nmost programs, this constant additional time is\nnegligible. It should be noted, however, that station\nbreak time is proportionally larger for very brief\nprograms, such as five-minute weather or news\nprograms, than it is for the typical 15 or 30 minute\nprogram.\nThe program classification scheme makes pos¬\nsible a highly reliable categorization of the pro¬\ngram units in terms of the predominant content of\nthe program. Some programs (i.e., program units)\nwere subdivided to make possible more appropiate\nclassification of their content. For example, some\nprograms contained some drama, some information,\nand perhaps some other type content; such pro¬\ngrams were broken into homogeneous units for\npurposes of classification rather than trying to fit\none class to the entire unit.\nThe program classification scheme has a hier¬\narchy of classification levels within it. The broadest\nlevel takes into account three major program types:\nentertainment, information and orientation. Each\nof these types is subdivided into classes; e.g.,\nentertainment type programs include the classes of\ndrama, variety, music, etc. Some classes are furth¬\ner divided into the finest level of classification,\nsub-classes; drama, for example, has sub-classes\nof action drama, comedy drama, and so on. The\nreader should refer to the monitor’s manual, Ap¬\npendix A, for the definitions of the various classes\nand sub-classes of programs. Note that the code\nnumbers assigned to the classes make possible auto¬\nmatic differentiation among levels of classification,\nand of different classes within levels, when analyses\nare made on tabulating machines.\nWith these few definitions, the reader should\nbe able to proceed to the discussions in the fol¬\nlowing chapters. Where further definitions and\ndescriptions of techniques are required, they are\nincluded in the discussion. In any case where the\nreader feels uncertain of the definitions or tech¬\nniques discussed in the following chapters, he\nshould make full use of the detailed explanations\ncontained in the monitor’s manual, Appendix A."
}