{
  "id": "d1345-54",
  "text": "51\nvertising, are well below average in the proportion\nof advertising time they televise.\nTable 27, Appendix B, presents the number and\nlength of primary advertisements for each station.\nDifferences among stations are very similar to\nthose found in total advertising. Table 28, Ap¬\npendix B, shows the per cent of total program time\nin primary advertising for each station. When this\nrelative measure is used, primary advertising ranges\nfrom a high of 15 per cent of total station time\nfor WABC-TV to a low of 11 percent for WOR-TV.\nTable 29, Appendix B, presents the average\nlength of primary advertisements by day of week\nand by station. For all stations, primary advertise¬\nments have an average length of 0.8 minutes during\nthe weekdays, and 1.1 minutes on Saturday and\nSunday in the week studied in 1954. The average\nlength for the total week is 0.9 minutes. Except\nfor primary advertisements on Sunday, these figures\nare larger than those obtained in 1953. When\none considers the large number of very brief pri¬\nmary messages found in station breaks which pulls\ndown the average length of these advertisements\nas a whole, it is clear that primary advertise¬\nments during programs are considerably longer\nthan 0.9 minutes.\nTable 29, Appendix B, also shows that three\nof the four network stations (WCBS-TV, WNBT and\nWABD) have the briefest primary messages, averag¬\ning 0.7 minutes in length. The longest commercial\nspiels are found in 1954, as in previous years, on\nWATV, with average messages running 2.1 minutes.\nTable 30, Appendix B, presents differences a-\nmong stations in the proportion of program time\naccompanied by secondary advertising. The in¬\ndependent stations represent both extremes in the\nuse of secondary advertising; WOR-TV with one\nper cent and WATV with two per cent have the\nsmallest proportions of total time accompanied\nby or made up of secondary advertising, while the\nthird independent, WPIX,has the largest proportion\nwith seven per cent of total station time in sec¬\nondary advertising. Network stations vary between\na low of four per cent for WNBT and a high of\nsix per cent for WCBS-TV and WABD.\nAdvertising Differences among Sponsors.\nFor the first time in 1954, programs were class¬\nified according to the product or service sold by\nthe sponsor of the program; products or services\noffered during station break advertisements were not\nconsidered in the classification. Twenty-two classes\nof products and services were used by the monitors.\nTable 31, Appendix B, shows the per cent of pro¬\ngram time devoted to or accompanied by primary\nand by secondary advertising for each class of\nsponsor's product. These percentages also include\nthe advertisements attributable to other products\nfound in the station breaks accompanying the pro¬\ngram unit; this small contamination probably would\nnot alter the ranking of most product classes listed\nin Table 31.\nTable 31 reveals that six classes of products\ndevote an unusually large proportion of program\ntime (over 20 per cent) to primary advertising.\nThese classes are (1) jewelry; (2) automobiles,\ntrucks, and accessories; (3) household soaps,\ncleansers and waxes; (4) toothpastes and other\ndentifrices; (5) lavatory soaps, shampoos, and\nwomen’s toiletries; and (6) local merchants and\nservices.\nFor other programs with only one sponsor, only\ntwo classes of products were found with less than\nthe average amoutn of primary advertising.\nThese classes were dairy products, with 11.7 per\ncent of program time in primary advertising, and\nindustrial materials and services, with 10.8 per\ncent. Programs with multiple sponsors devote\nalmost 16 per cent of their time to primary ad¬\nvertising. Such programs make up 43 per cent\nof all New York television time; another 23 per\ncent of total time is made up of sustaining pro¬\ngrams with no commercial sponsors, and the re¬\nmaining 34 per cent of total time is bought\nby individual sponsors. In Table 31, the 3.5\nper cent of total time in primary advertising for\nsustaining programs is entirely made up of com¬\nmercials during station breaks associated with such\nprograms. It is the small amount of primary ad¬\nvertising counted in with sustaining programs that\npulls down the overall proportion of total time de¬\nvoted to primary advertising. When the so-called\nsustaining programs are excluded, primary adver¬\ntising alone makes up 16.4 per cent of sponsored\nprogram time, and secondary advertising accompan¬\nies another 6.2 per cent, giving a total of 22.6 per\ncent of total sponsored program time given to ad¬\nvertising.\nPublic Agency Announcements.\nTable 32, Appendix B, reveals that the number\nand length of public agency announcements are\nconsiderably higher in 1954 than in previous years.\nOne and one-third per cent of total broadcast time\nis given to public agency announcements in 1954;\namong the stations, this proportion varies between\n0.7 per cent in the case of WCBS-TV and 2.0\nper cent for WABC-TV."
}