{
  "id": "d1345-55",
  "text": "Pair lie <Jiiu.es on A/ew Ifotk \"Television\nCommercial television has presumably assumed\nan important role as a determinant of public\nopinion for millions of Americans. Research evi¬\ndence on the impact of TV on its audience is\nslowly accumulating, and the hypothesis emerges\nthat the new medium will surpass all others in\nmolding opinions and changing behavior. Advertis¬\ning research shows that television is several times\nmore potent than radio in influencing product pre¬\nferences and in creating new demands. Campbell*\nreports 31 per cent of his study sample listed TV\nas the source of their information on the 1952\nelection campaign as against 27 per cent who\nnamed radio and 22 per cent who listed newspapers.\nOf those who watched the campaign on television,\n59 per cent considered that medium their most\nimportant source of information.\nNot all of the ways in which television affects\npublic opinion can be said to be intentional in\nthe sense that the programs purposely set out to\nchange the minds of viewers. However, at least\ntwo types of television programs attempt to affect\npublic opinion. The first is the information type\nwhich is meant to present “the facts” to the\naudience from which they may draw their own\nconclusions. The second type explicitly attempts\nto change opinions; for example, a candidate\nfor public office states his program or the chair¬\nman of a civic committee urges the audience to\nsupport a fund drive.\nThis chapter and its contents grew from the\nrecognition of the importance of television as a\nmedium affecting opinion on public issues in\nways both intentional and unintentional. Further¬\nmore, interest in public issues presentations on\ntelevision was stimulated by an awareness of the\nimplications of the potency of the medium in\nareas of traditional importance to democracy. We\nfind in this topic potential conflicts between tra¬\nditional and formal guarantees of freedom of speech\nand our sense of fair play, and desire to hear and\nsee all sides of an issue. We also find possible\nfrictions between private enterprise and govern¬\nmental controls, and between criteria of popularity\nand revenue on the one hand and criteria of ac¬\ncuracy and adequacy on the other.\n* Campbell, Angus; Gurin, Gerald; and Miller\nWarren. “Television and the election.” Scient^\nific American, May, 1953,pp. 46-48.\nIt is probably not necessary to point out that\na discussion of public issues on television would\nbe almost impossible without allowing some value\njudgements to color the content. By virtue of the\nfact that the television programs we shall discuss\nwere produced in the United States with its parti¬\ncular form of government, its Constitutional guaran¬\ntees, its legislated controls on communications,\nand its traditions and outlooks imbedded in the\nAmerican culture, it is inconceivable that a wholly\n“objective” analysis could be made.\nWhat Are Some of the Potential Problems in\nPublic Issues Telecasting?\nTelevision critics have cited considerations\nranging from the philosophical to the technical\nin evaluating public issues on television. In gen¬\neral, we find agreement among critics, viewers and\nbroadcasters that public issues programs should be\nproduced “in the public interest. ” This principle\nis deceptively simple. First of all, what is the\npublic interest, and who knows it best? Our\npolitical philosophy embraces on the verbal level\nthe idea that the public itself is the ultimate judge\nof what is and what is not in the public interest.\nOn the other hand, we have increasingly become\ndependent upon experts for guidance in public\nmatters. This trend has been an almost inevit¬\nable consequence of the growing complexity of our\nmodern life. Thus, persons trained in special\naspects of this life—in economics, political science,\nlaw, medicine, education, and so on—-are sought\nout as judges of proposed actions. The 4 average\ncitizen, on the other hand, despite higher levels\nof education and better means of communication,\nmay actually be less qualified to pass judgment\non all matters of public interest than his fore¬\nfathers who lived in a less complex world.\nIn practice, the citizenry still determine what\nwill be done in their interest, but they are in¬\ncreasingly dependent upon the judgment of others\nto define their interest for them. Assuming the\nvalidity of this observation, what are the conse¬\nquences of public issues discussions in the mass\ncommunications media? First of all, how “ob¬\njective” can a public issues discussion afford to\nbe? That is, if the program did nothing but present\nall the facts on the topics of discussion, could\nthe public be assumed to have the training, ex"
}