{
  "id": "d1345-56",
  "text": "53\nperience, knowledge of other factors, and ability\nnecessary to integrate these to arrive at a wise\ndecision? Might special interest groups take ad¬\nvantage of the lack of discussion of consequences\nand implications to restructure the facts to fit\ntheir aims?\nSecondly, if discussion, interpretation and de¬\nbate seem desirable, who shall the experts be?\nHow shall we insure that all sides of an issue are\nfairly presented? Who will guarantee that the\n‘‘experts” will make their judgements in the public\ninterest? Who will judge the accuracy of\nthe “experts” premises and the validity of the\nconclusions drawn from them? And so on.\nLastly, as we rely increasingly upon expert\njudgment, the danger increases that the issues will\nbe personalized. That is, it becomes more a\nmatter of whether or not we like Senator X than\na matter of the value of the issue he backs. Since\ntelevision makes the most of personality factors,\nit is possible that more factors irrelevant to the\nmerit of the issues under consideration will deter¬\nmine how the issues will be received by the public.\nThese are the general problems which any\ncommunication medium has a responsibility to con¬\nsider when using the criterion of the public interest.\nThere are further problems that are more specific\nto television in particular. These may be roughly\ngrouped into problems of time, of technique and\nof revenue.\nTime problems can be appreciated when one\nconsiders the task of discussing, say, the nation’s\neconomy in fifteen minutes. Even on longer pro¬\ngrams, it is necessary to delimit the topic, to hit\nthe high points and to minimize the exploratory\ndiscussions of many facets. As a result, the alterna¬\ntive views are reduced in number and are laid\nout in such a fashion that the issues look fairly\ncut and dried. Says critic Leo Cheme: “The\nissues are no longer black or white—if indeed,\nthey ever were. But the debates that are staged\nfor the living rooms of American tend by their\nformat and emphasis to reduce all of our problems\nto the two colors. There is almost never a gray,\nan expressed doubt, seldom a concession that there\nare elements of truth in contrasting points of\nview.”* To repeat, these shortcomings do not\nreflect a desire on the part of TV discussants to\nmislead their viewers, but rather are the result\n* Cherne, Leo M. “Biggest question on TV\ndebates. ’ ’ New York Times Magazine, March\n2, 1952, p. 14 ff.\nof trying to cover monumental problems in limited\namounts of time. A newspaper or magazine,\nif it desires, can spend more time (perhaps space\nis the more appropriate term) on elaboration,\nqualification and substantiation. Furthermore, the\nwritten discussion can afford to explore more com¬\nplexities than the reader can examine and re-ex¬\namine at leisure; such exploration on radio or tele¬\nvision might well confuse the listener. On this point,\nMr. Cherne adds: “The danger is in the pretense.\nMillions listen to radio and television debates and\ncome away with a feeling that they have learned\nthe essentials about the controversy. More often\nthan not they have acquired exaggerated opinions\nwithout an understanding of the complex back¬\nground.”\nAdded to the limitations of time are further\nproblems raised by technique. Television still\nis regarded largely as an entertainment medium,\nand success in terms of entertainment is an im¬\nportant criterion for any program to meet. This\nis not to condemn the criterion. Psychologists\nhave found that the interest value of material is\nan important determinant of how well the material\nwill be learned or of how effective the material\nwill be in changing opinions. The problem arises\nin the distortions of material and in the distribu¬\ntion of emphasis that might be made to improve\nthe entertainment aspects of public issues programs.\nThe public loves an argument, so areas of dis¬\nagreement among public issues discussants are said\nto be emphasized over the areas of agreement.\nAnd the ability to turn a phrase or spellbind an\naudience might have more effect on audience\nopinion than the logic of the argument used.\nConsider also the other totally irrelevant factors\nthat might be introduced by technical problems in\ntelevision. Voice quality, appearance, resistance\nto “mike-fright”, and organization of presentation\nare factors introduced by the participant which\nmay very well affect viewer opinion; while light¬\ning, camera angle, juxtaposition of content and\nsimilar factors are variables affecting audience\nopinion that are contributed by the television pro¬\nducer.\nRecently in television news the providing of\nopportunity to reply to opponents or critics has\nbeen receiving interest. Here the problems of\ntime and technique are raised again. It seems\nunreasonable to experts that a network can find\nit possible to make time available to every person\nwho feels a need to reply to his critics. But even\nif this were possible, it is possible to guarantee\nthat each party to an argument will have equal"
}