{
  "id": "d1345-57",
  "text": "54\nopportunity to present his case? Some participants\nwill be in a position to capitalize on large finan¬\ncial backings, skilled script writers and producers,\nand superior stage presence to prepare programs with\ngreater impact than those of opponents, even if the\nopponents have equal time at their disposal. Also\nequal quantity of time for reply does not take\ninto account differences in size of audience at\ndifferent time periods. Thus, a half hour at 8:00\nP.M. is more desirable than a half hour at 11:00\nP.M.\nAs a final consideration, we must face the\nfact that most of today's television is the product\nof private, commercial enterprise. As such, it\nrepresents the result of huge investments, and reve¬\nnue to justify these investments comes at present\nwholly from advertising. Thus, sponsor interests\nare in a position to bring pressure to bear on the\ncontent of programs. Raymond Rubicam, former\npresident of the advertising firm, Young and Rub¬\nicam, observes that, “If the advertiser's program\ndoes not appeal to the number of people he wants\nand needs in order to maintain and increase his\nsales, he either grades his program down so as\nto reach more people; or, if he cannot do that,\nhe gives up the program in favor of a new one\nthat will reach more.’’* * Since public issues pro¬\ngrams, as a rule, enjoy less popularity than enter¬\ntainment type programs, it is possible that fewer\npublic issues programs are found than would seem\ndesirable for a well informed public largely because\nsponsors cannot be found, and those which do exist\nmay be designed to appeal to the widest audiences\nrather than to present adequate discussion.\nExamples have also been noted of sponsor pres¬\nsures which caused controversial persons to be re¬\nmoved from public issues panels,* and the rumor\nis often heard that sponsors frequently urge public\nissues discussants to steer away from “hot” or\ncontroversial topics.\nBecause of the possibility of sponsor influence\nover public issues discussions, the possibility also\nexists that public issues programs as a whole may\nshow some biases if sponsors, as a group, have some\ncommon views among them. A similar danger\nexists among those who buy TV time to present\ntheir views for political purposes. Are the views\n* Rubicam, Raymond. “The danger signals\nare up.” Saturday Review of Literature Nov¬\nember 3, 1951, p. 24 ff.\n* “One editor missing.” Time* August 18, 1952\npp. 59-60.\nand objections of groups with limited financial\nbacking heard as often as those of larger and\nwealthier groups?\nThe factor of revenue appears to be responsible\nfor another aspect of public issues presentation.\nFor example, many of the public issues programs\ncarried as sustaining time by the networks are\ndropped by local stations. This has been reported\nto be true of more than half of the sustaining pro¬\ngrams offered by the networks to radio stations.*\nIn many cases, the reason for this action probably\nwas the understandable desire to fill a non-paying\nspot with sponsored material.\nProblems in Public Issues Telecasting and the New\nYork TV Studies.\nWe have summarized some of the more obvious\nproblems of public issues treatment on television,\nespecially as brought to attention by the critics\nof television. This discussion by no means is\nmeant to serve as an indictment of commerical\ntelevision. We have raised possible questions and\nnoted certain dangers, but the fact remains that\nlittle has been done by way of evaluating the\nextent to which these problems are met or the\ndangers circumvented.\nIt was hoped during the planning of the 1954\nstudy that steps might be taken to investigate the\npresentation of public issues on New York tele¬\nvision. Almost immediately, problems in procedure\nwere encountered. First of all, it is obvious from\na consideration of the problems and dangers that\nwe have discussed that very sophisticated judg¬\nments would have to be made. How to detect bias\nobjectively? When has a problem been over¬\nsimplified? What are the appeals used in the\ndiscussions? These are but a few of the difficulties\nwe recognized. Unfortunately, the period of time\nbetween the planning of the study and the target\ndate for its administration was but a matter of\na few weeks. With such a stringent time limita¬\ntion, the preparation of devices and the training\nof teams which seem to be required by a thorough\nanalysis of televised public issues discussion seemed\nout of the question. As a result, a fairly super¬\nficial look at public issues on TV became neces¬\nsary. A small pilot study was conducted to pro¬\nvide ideas for methods that might be used in\nfuture analysis of public issues on television. A\nfew observations made in this preliminary analysis\nare sufficiently interesting to warrant discussion in\nthis report.\n* Seldes, Gilbert ‘ The news on television.”\nNew Republic, January 18, 1954, pp. 7-9"
}