{
  "id": "d1345-58",
  "text": "The Quantity and Format of Public Issues Programs\non New York Television.\nFigure 48 shows the proportion of total broad¬\ncast time devoted to public issues programs over\nthe four years of the New York studies. The rela¬\ntive amount of public issues program time has been\nfairly small and not too variable over the years,\nand amounts to 1.8 per cent of all program time\nin 1954. Some slight fluctuations in the propor¬\ntions of total broadcast time found in different\nformats of public issues programs can be seen from\nyear to year. For example, 1953 had fewer public\nissues programs with a discussion or debate format\nand more with individual views than either of the\nadjacent years, 1952 or 1954. No information is\navailable concerning the amount of discussion of\npublic issues topics in other than public issues\nprograms. The informal impression given by the\nsupervisors of the 1954 study, however, indicates\nthat many public issues topics receive informal\ndiscussion on many other types of programs, espe¬\ncially in the class of personalities programs.\nThe Rationality, Breadth and Impartiality of Tele¬\nvised Public Issues Programs.\nMonitors in the 1954 study were instructed to\napply three coarse rating scales to each public\nissue discussion, whether in a public issues pro¬\ngram or elsewhere. These rating scales were in¬\ntended to provide a rough evaluation of the ration¬\nality of arguments used, the breadth of views, and\nthe impartiality of the discussion. Table 33,\nAppendix B, shows how the monitors rated the 38\npublic issues discussions found in 1954; the three\ncategories of each rating scale are defined in\nthe table. In the judgment of the monitors, an\neven half of the discussions relied upon rational\nappeals, while 13.8 per cent of the discussions\nleaned heavily upon emotional argumentation.\nOnly one view was found in 55.3 per cent of the\ndiscussions, and at least some “selling” of view¬\npoints was done on 53.6 per cent of the discussions.\nSome indication of the reliability of the three\nscales was obtained by having six monitors in¬\ndependently rate the same public issues program\non the three dimensions. On all three scales,\nthe agreement among raters was higher than chance,\nand on the rating of the breadth of the program,\nperfect agreement was found. Nonetheless, both\nmonitors and supervisors agreed that finer categories\nand more precise definitions should be used in future\nratings of public issues on television. Psychological\nvalue and affective content analysis techniques as\ndeveloped in recent years in psychology might well\nbe applied to future study of this problem.\nFigure 48\nNEW YORK TV: PROPORTION OF TOTAL PROGRAM TIME IN\nPUBLIC ISSUES PROGRAMS\nPercent\n0 12 3"
}