{
  "id": "d1345-59",
  "text": "56\nThe Topics Covered in Televised Public Issues\nDiscussions.\nTable 34, Appendix B, draws a comparison\nbetween the public issues topics discussed on New\nYork television during the week of January 25 to\n31, 1954, and public issues topics found during the\nsame week on the front pages of New York’s seven\nlargest daily papers. To some extent, this com¬\nparison is not fair to the televised discussions,\nsince they are limited in the number of topics\nthey can cover in their allotted time more than\nnewspapers are limited by front page space. Also,\nthere may be a greater time lag between an event\nand its discussion on television because of the\nnecessity of obtaining discussants and preparing the\nprograms.\nDuring the January study week, the most fre¬\nquently discussed topic on television was recession\nand the economy; proportionally, this topic re¬\nceived much less attention on the front pages of\nNew York newspapers. For newspapers, the big\ntopic was the Berlin conference, which ranked only\nfifth on television. The second most frequently\ndiscussed issue in newspapers was the refusal of\nrepatriation by the captured American soldiers, a\ntopic which was brought up in less than two per\ncent of the television discussions.\nFrom Table 34, then, it is clear that the dis¬\ntribution of attention among public issues topics\nis not the same in both television and front pages\nof newspapers. However, it should be understood\nthat this is not the only, nor the most valid, com¬\nparison that can be drawn between the two com¬\nmunications media. Similar analysis might have\nbeen conducted with editorials or syndicated com¬\nmentator columns as the criterion from newspapers.\nSummary.\nWhen compared with the problems discussed\nin the early part of this chiapter, the results of\nthe studies of public issues programs conducted\nduring the 1954 monitoring of New York television\nseem hardly to have scratched the surface. We\nhave seen sketchy evidence to indicate that public\nissues discussions do not rely wholly upon rational\nappeals, that many present but one view of the\ntopic under discussion, and that few programs are\nfree from proselytizing for one or another view.\nWe have also seen that some differences exist\nbetween television and newspapers in terms of the\nfrequency with which various topics were discussed\nduring the study week. It is not possible to say,\nhowever, whether or not television programs are\nprone to avoid controversial issues.\nThe need for a thorough investigation of public\nissues broadcasting is no less than it was before\nour efforts were made, and the need extends beyond\nan examination of the mere content of public\nissues programs. Equally important is the question\nof the impact of such programs on the viewing\npublic, and of the sociological and psychological\nvariables which determine how the viewer will\nrespond to the public issues presentation.\nBefore we can expect helpful and constructive\nresearch in these areas, however, it has become\napparent that there is a need for the definition\nof the responsibilities of the various communica¬\ntions media with regard to their roles in shaping\npublic opinion. At this time, these responsibilities\nare only suggested in statements that are difficult\nto apply in making evaluations. To make useful\ninvestigations of public issues broadcasting, we need\nagreement on working definitions of such concepts\nas “the public interest,’’ and we need workable\ncriteria by which one can determine when practices\nsatisfy the criterion of public interest. In short,\nit is our judgment that profitable evaluation of pub¬\nlic issues on television cannot be made until we\nhave at our disposal a statement of the objectives\nof public issues programs in a democratic society,\nand a statement of. desirable and undesirable means\nby which these objectives can be realized."
}