{
  "id": "d1345-6",
  "text": "2\n‘The Ptojtamminy ofi\nThis chapter presents an overview of the what,\nwhen and how of New York television. It discusses\nprogram content of New York television and the\ndistribution of this content over the broadcasting\nday.\nA Summary of the Programming of New York Tele¬\nvision.\nAmong the highlights identified in the 1954 study\nof New York commercial television, a few facts\nabout programming practices can be singled out.\nFor example, total program time for New York\nTV reached a new high of nearly 663 hours for\nthe week of January 25 to 31, 1954. In making\ncomparisons with previous years, it appears that the\nprogram content has begun to stabilize. Enter¬\ntainment continues to make up more than three -\nfourths of all program time, and drama programs\nconstitute the largest single class of entertainment.\nThe few changes in 1954 indicate that comedy\ndrama is on the rise, while crime drama and do¬\nmestic drama appear to be decreasing.\nAmong the information programs, general in¬\nformation suffered a relative decrease in 1954.\nNews programs of all kinds seem to be at a stable\nlevel. Religious programs show slight gains.\nProgramming practices analyzed for content of\nthe various time segments of the broadcasting day\nshow entertainment programs making proportional\nincreases in program time during the domestic\nand children’s hours, but slightly below previous\nlevels in the adult and late hours. By contrast,\nthe domestic and children’s hours have smaller pro¬\nportions of information and orientation programs,\nwhile adult and late hours have gained in these\nprogram types. Lastly, increases in program time\nfrom network stations coupled with decreases in\ntotal time from independent stations have caused\nthe proportion of live programming, as compared\nwith recorded material, to increase in 1954.\nTotal Program Time.\nDuring the week of January 25 to 31 1954,\n62 hours and 46 minutes of New York television\nwere broadcast, an increase of eleven hours in\ntotal program time over the week of January 4 to\n10, 1953.\nA/eur Ifotk ~Televilion\nFollowing a convention adopted in previous\nyears, the broadcast day has been divided into\nfour time segments for purposes of analysis, as\nfollows:\nWeekdays\nSaturday\nand Sunday\nDomestic\nhours\nSign-on to 5 P.M.\nnone\nChildren's\nhours 5 P.M. to 7 P.M.\nsign-on to 7 P.M.\nAdult\nhours\n7 P.M. to 11 P.M.\n7 P.M. to 11 P.M.\nLate\nhours\n11 P.M. to sign-off\n11 P.M. to sign-off\nAs shown in Figure 1, the domestic hours still\ncontain nearly a third of the week’s TV broad¬\ncasting time, even though there has been a slight\ndecrease in program time during these hours.\nChildren’s hours in 1954 have lengthened by 825\nminutes over 1953; this trend is wholly accounted\nfor by earlier sign-ons on Saturday and Sunday.\nAdult hours are 48 minutes short of the full capacity\nlevel reached in 1953, and late hours are 348 min¬\nutes longer than in 1953.\nFigure 2 shows that the network stations (WCBS-\nTV, WNBT, WABD, and WABC-TV) have alJ added\nto their total weekly broadcasting time, while two\nof the independent stations (WPIC and WOR-TV)\nhave cut back their broadcasting activities. The\nweekly gains made by the network stations amount\nto an average of nine hours each. Of the indepen¬\ndents, WOR-TV shows the greatest change in week¬\nly program time with slightly more than a 28\nhour reduction since 1953. The fact that WOR-TV\nnow signs on later in the afternoon accounts for\na part of the decrease in program time during the\ndomestic hours; and their earlier sign-off in the\nevening, which occasionally occurs before 11p.m.,\ncaused the program time in the adult hours to fall\nshort of full capacity by 48 minutes in 1954.\nProgramming on New York Television.\nBefore discussing the content of New York tele¬\nvision, we must make several important points\nclear to the reader."
}