{
  "id": "d1345-62",
  "text": "58\nThere is one possible exception to the rule of\nadding the station break time following a program\nto the program time to obtain the total program\nunit time. This exception involves those occasion¬\nal types of station breaks which are much longer\nthan usual and are filled with shopping and mer¬\nchandising information. If the station break is\nlonger than three minutes, consider it as a separate\nprogram and prepare a separate log sheet for it.\nIn these cases, you will not then add this “station\nbreak” time to the previous program.\nPrimary Advertisements. The commercial ad¬\nvertising material that you will observe in the mon¬\nitored program has been divided into two types.\nThose commercials which interrupt the flow of the\nprogram material are designated as primary ad¬\nvertisements. Advertising material which does not\ninterrupt the flow of program material but none\nthe less is inescapable, or frequent plugs for a\nproduct which are inextricably mixed with the\nprogram material, or those cases in which the ad¬\nvertising material is the program, are designated as\nsecondary advertisements.\nIn the space on the log for recording primary\nadvertisements, you will enter the time in minutes\nand tenths of a minute given to each primary\nadvertisement. A number of special stop watches\nhave been obtained which read directly in minutes\nand tenths rather than in minutes and seconds.\nThe use of tenths of a minute rather than seconds\nhas obvious advantages when the advertising times\nare summed since it will not then be necessary\nto convert accumulated seconds into minutes and\nseconds. If it becomes necessary to use a standard\nwatch or clock, a scale is provided at the bottom\nof the log sheet to convert seconds to the nearest\ntenth of a minute.\nWhile the timing of primary advertisements\nsounds simple enough, experience will soon demon¬\nstrate to you that the ingenious methods devised\nby advertisers to work their materials smoothly\ninto the flow of program material are sometimes\nsuccessful to the point of causing you to fail to\nnote their beginning. It is best to begin timing\nany material that might blossom into an advertise¬\nment and discard it if it does not prove to be a\ncommercial rather than to wait to see what happens\nand then miss timing a portion of a commercial.\nMany problems that will arise in the course\nof monitoring will have to be solved with very\narbitrary decisions, and this probably will be es¬\npecially true in the case of timing advertising\nmaterial. However, if we remain consistent in\nour arbitrariness, our biases will then be account¬\nable. Therefore, we hope that you will bring to\nthe training session notes and questions made during\nthe reading of this manual and trial use of the\nenclosed log sheets, so that difficulties can be\nanticipated and discussed before the actual mon-\ntor ing.\nSecondary Advertisements. All advertising mat-\nerial which does not interrupt the flow of program\nmaterial, which is intermixed with the program\nmaterial, or, in extreme cases, actually constitutes\nthe program material, is secondary advertising.\nExamples of such advertising are the use of product\nnames on backdrops, appearance of product samples\nin the picture, frequent mentions and intermixed\nplugs for the sponsor within the program in the\ncontext of jokes, songs, rhymes, interviews, and\nthe well-known ‘ ‘information’ ’ type program which\nreally is an advertisement of some product (fre¬\nquently a hair tonic or reducing diet).\nYou will time these secondary advertisements\nto the nearest tenth of a minute, and record the\ntime in the space provided on the log sheet for\nsecondary advertisements. Some of the secondary\nadvertisement material will beuntimeable. In such\ncases, you should note this fact in the program\ndescription. However, whenever possible, record the\ntime during which secondary advertising appears\nin the program material. While it is necessary i\nto time primary advertisement separately, it is\nnot necessary to get the time for each individual\nappearance of secondary material. All that is re- i\nquired is the total time during the program within\nwhich secondary advertisements were present. For\nthis purpose, a limited number of stop watches\nhave been obtained which can be used to accumu¬\nlate the time for secondary material without clear¬\ning the watch after timing each appearance. At\nthe end of each program, note in the program de¬\nscription a brief account of the means used in\npresenting secondary advertising on the program.\nA brief statement, such as “Product samples on\nm.c.’s desk,” will be sufficient.\nPublic Agency Announcements. In addition to\nthe commercial advertising which appears in the\nprogram unit, you will also encounter announce¬\nments for non-commercial interests, such as fund\ndrives, safety campaigns, public institutions, and\nso on. These announcements are to be timed and\nrecorded in the section of the log sheet labled\n“public agency announcements.”\nBrief Program Description. To check on pro-\ngram classifications and to secure other informa-"
}