{
  "id": "d1345-63",
  "text": "59\ntion necessary for later analyses, it will be neces¬\nsary for you to give a brief but clear description\nof the program. Make the description sufficiently\ndetailed to enable anyone who has not seen the\nprogram to classify it properly with the program\nclassification scheme to be described below. Note\nthe format of the program, the mechanics of its\nflow of material and so on. Two examples are\ngiven below:\n(1) M. C. introduces guest acts which include\nsinger, dancers, and a comedian. M. C.\ninterjects patter between acts. Secondary\nmaterial appears as a sign in background of\nall acts. Sponsored by Sudso Soap.\n(2) Dramatic play with murder mystery theme.\nTypical whodunit. No secondary material.\nSponsored by Universal tabacco.\nIf you feel more detailed information should\nbe given than in the above examples to bring\nout special features of the program, be sure to\ninclude this in the description. Above all, however,\nmake your descriptions as objective as possible.\nEvaluations in terms of good and bad are to be\nleft out; these judgments fall within the domain\nof the television critic.\nWithin the space of the program description are\nblanks within which you are to place your recom¬\nmendations for the program and advertisement clas¬\nsifications based on the classification schemes de¬\nscribed in the back of this manual. In arriving\nat proper classifications, it will be necessary to use\nthe rule of predominance. If the program contains\nsome brief dramatic portions but is mostly a mono¬\nlogue on some phase of the history of science,\nthe program should be classified as one of the\ninformation-type programs. However, some pro¬\ngrams might be more fairly classified if broken up\ninto several separate “programs” according to their\nformat. A well known Sunday afternoon program,\nfor example, frequently will have a fifteen minute\nor half-hour portion devoted to information of some\nsort followed by one or more plays. In such a\ncase, it seems more reasonable to prepare a separate\nlog sheet for each of the homogeneous portions,\ngiving each an individual classification, rather than\nforcing the entire program into one class. In\nmost cases, the classification of the program will\nbe a relatively straightforward procedure.\nYou are also asked to recommend a classifica¬\ntion for the product plugged by the advertisements\nin the program using the classification scheme at\nthe back of this manual. This classification is to\nbe applied to the product sponsoring the program\nitself and should ignore the spot commercials\nwhich appear in the station breaks that have arti-\ntrarily been added to the program unit. Many\nprograms have more than one sponsor; a “mixed”\nclass is provided for these cases. As with the pro¬\ngram classification, let the rule of predominance\nbe your guide. Ignore mentions of other products\nmanufactured by the sponsoring company. Include\nin the program description the name of the product\nand its nature; e.g., do not merely write “Sudso,”\nbut write “Sudso Soap.”\nViolence Tallies. In this study we shall con¬\ntinue the practice of recording the amount of vio¬\nlence which occurs on television. We shall use\nthe definition of violence used in the past studies:\n“Violence [is] defined to include physical or\npsychological injury, hurt, or death, addressed\nto living things. An “act” [is] defined as an\nepisode of whatever duration which concerns\nthe same agent and the same receiver. Thus,\na battle scene would be one act; a chase\nscene with a posse pursuing a man would be\none act, even if interrupted by flashbacks to\nother scenes; an attack by one person on a\nsecond, in the course of which a third person\nattacks the first, would be two acts. A “threat”\n[is] defined as any manifest threat to commit\nan act of violence.”\nOn the bottom of the log sheet are seven blocks\nwithin which monitors are to tally each act or\nthreat of violence according to the agent of the\nact or threat. We shall not differentiate between\nacts and threats in this study. The agents, listed\nat the top of each block, are defined as follows:\n(1) Human, weapon. Any act or threat carried\nout by a person with the aid of a weapon,\nsuch as a gun, club or knife, should be\ntallied here.\n(2) Human, weaponless. Any physical act or\nthreat carried out by a person without the\naid of a weapon, such as grappling, fight¬\ning with fists, chasing, pushing, etc. should\nbe tallied here.\n(3) Human, legal, verbal, other. Any act or\nthreat carried out by a person in the form\nof vituperation, legal suit, or other mis¬\ncellaneous means should be tallied here.\n(4) Act of nature. Any natural phenomenon\nproducing violence, such as a storm, flood,\nearthquake, should be tallied here.\n(5) Accident. Any violence should be tallied\nhere which occurs as an accident, as when"
}