{
  "id": "d1345-64",
  "text": "60\na car goes out of control and crashes or\na person slips and falls, in situations where\nno agent other than \"fate” perpetrates the\nviolence. The distinction between accident\nand act of nature is fine but the wide spread\neHect of the latter is a good criterion\n(6) Animal. Any violence committed by a\nanimal is tallied here.\n(7) Miscellaneous. Any violence whichdoesno\n1 fit any of the above cases should be listed\nhere. Use sparingly, unless the yolen\nwill not yield to classification in other\ncategories without seriously distorting its\nmeaning.\nYou will encounter many\n* —r\nffacTweapon m welponless? The arbitrary\nmle to follow^ If A is the aggressor and dominates\nthe act, tally theviolenceunder \"Human, weapon.\nClassify all acts according to the means used by\nthe^ersort dominating the act Where the agen\nnr means changes during an act, classify the act\nto the agent with which it appears most\nof the violence was committed.\nTvnes of violence contexts. By way of expert-\nnieSfc^lHSraSduce\non which all violence will be cl^f * dimen-\nicssrSSs\naccording to the extent to which the context ot\n“ST!.\njustify our analysis by attending to the p'eff\"“\nof stimuli known to be effective in evening ten¬\nsion,” rather than by presuming to useo ^\nr^w^n^oral sciences will\nundoubtedly appreciate our reasons for not attempt¬\ning to give explicit meaning to the term tension\nwithin this brief manual.\nWithin each of the cells of the iog sheet de-\nvoted to a particular agent of violence, you w 11\nfind che Roman Numerals 1, II, and 111.\nuse the space following these numerals to tally\ntypes of context within agents of violence accord-\ning to the following scheme.\n(1) Type 1 context. Here tally those acts of\nviolence ^which occur in relatively sinister con¬\ntexts Act or threats which are tallied here are\nthoi which are accompanied by one or more of\nthe following devices:\na. Measured, ominous background music,\nh Shadowy, dark, “low-key” lighting,\nc Relatively clear depiction of terror or horror\nC’ “actions or expressions of characters.\nd. Stealthiness of movements on the part of the\ne. tthefdevices used to create \"suspense.”\nMuch of the violence In crime dramasprobably\nwill fall in this class.\n/o\\ Tvt>e II contexts. Tally in this class those\nacts or threats not necessarily less realistic than\n^ ZL as Tvoe 1, but which are in less\nsinister contexts. The violence is not accompanied\nby stimuli listed under Type I. E5?a^eSd°lSUthe\nviolence are as follows: the Punch l^d^ ^y t\nyoung maiden’s lover on the aw of Ins rivals\nWea'erS in’ftfformrf'g^nplay, chase scenes and\n“ghts are presented in such a matter-of-fact\nway as to warrant inclusion here.\n(31 Type III contexts. Include in this class\nthe caseTof sham violence frequently found to\nssr——\nn some cases fairly serious physical Injury mtght\nbe depicted as resulting from dte act as when a\ncomic fells his partner with f ball bat H\nif the act is done \"for laughs it should be tai\nas occurring in the Type III context.\nSummarizing the log sheet. Monitors will be\nwill make the following entries in the spaces ai g\nthe right hand margin:\n1 Station: enter the code number assi^edto\nthe statTorTon which the program was monitored."
}