{
  "id": "d1345-65",
  "text": "61\nStation\nWCBS-TV\nWNBT\nWABC-TV\nWPIX\nWATV\nWOR-TV\nWABD\nCode Number\n1\n2\n3\n4\n5\n6\n7\nNote that the code number does not correspond to\nthe channel number of each station 1\n2- Day: Enter the code number for the day\non which the program is monitored. Monday is 1,\nTuesday is 2 ... . Sunday is 7.\n3. Sheet No. Place a two-digit number in this\nspace to indicate the number of each log sheet\nfor that day. Use 01 for the first sheet of the day,\n02 for the second, and so on.\n4. Period. The day has been arbitrarily broken\nup into time periods according to the predominance\nof various types of audiences. Use the following\ncode:\nTime\nSign-on to 5 PM\n5 PM to 7 PM\n7 PM to sign-off\n11 PM to sign-off\nWeekdays\nCode Audience\n1 The “domestic” hours\n2 The “children’s” hours\n3 The “adult’s” hours\n4 The “late” hours\nSaturday and Sunday\nlime Code\nSign-on to 7 PM 2\n7 PM to 11 PM 3\n11 PM to sign-off 4\nAudience\nThe “children's” hours\nThe “adult’s” hours\nThe “late” hours\n5. Tot. Time. Enter here the total time for\nthe program unit, from the beginning of the mon¬\nitored program until the end of the station break\nwhich follows it, in minutes. This, of course,\nis obtained by computing the difference between the\non and “off” times listed on the log sheet.\nAlways use three digits to record time: e.g., a\nfive minute program should be entered as 005.\nReview the definition of a program unit given\nearlier. 6\n6. Pri. No. Enter here the number of primarv\nadvertisements. Use two digits.\n7- Pri. Time. Enter here the sum of all time\ndevoted to primary advertisements in the program\nunit. Make the entry in minutes and tenths using\nthree digits; e.g., five and two tenths minutes\nshould be entered as 05.2.\n8* Sec- Time. Enter here the time during which\nsecondary advertising material appeared in the pro¬\ngram. Make the entry in minutes and tenths.\nUse three digits.\n9. PubAg No. Enter here the number of public\nagency announcements during the program unit. Use\ntwo digits.\n10. PubAg Time. Enter here the time devoted\nto public agency announcements during the program\nunit. Make the entry in minutes and tenths using\nthree digits.\n11. 50% Secondary? If half or more than half\nof the program material was accompanied by\nsecondary advertisements, place a check in the\nspace before “yes”. If less than half was ac¬\ncompanied by secondary advertisements, check the\n“no” space.\n12. Live? If the program is not recorded, i.e.\nnot on film, it is designated live, and the space\nbefore “yes” should be checked. As in the case\nof other problems, let the rule of predominance\nhelp you resolve your doubts on this classification.\nIf some filmed material accompanies the program,\nas in the case of some news programs, but the major¬\nity of the program is given to a live presentation,\nclassify it as live.\n13. Local? If the program is produced in the\nstudios of the station being monitored, it is a local\nproduction. If it is brought to the transmitter\nfrom some other city by means of cable, micro-\nwave, or film, it is not local. Programs originating\noutside the station's studios but produced by its\npersonnel and equipment at some local location,\nsuch as at Madison Square Garden or St. Nicholas’\nArena, should be classified as local. Some cases\nmay have to be decided by reference to a tele¬\nvision industry journal by your supervisors at a later\ntime if there is insufficient evidence given in the\nprogram to enable classification.\n14- Ed. Institution? If an educational institution\nis associated with the program, place a check in\nthe “yes” space. Note the name of the institution\nin the program description section of the log sheet."
}