{
  "id": "d1345-66",
  "text": "62\n15. Public Issues? If a public issue, as defined\nin the program classificationrscheme, is discussed\nat any length on the program, place a check in\nthe “yes” space. A special Public Issues Form\nshould be filled out to accompany any log sheet\non which you have placed a check in this space.\nThe program as a whole need not be concerned\nwith public issues to warrant the indication of\na public issues discussion on the log sheet.\n16. HuViWeapon. Add up all tallies made under\nthe classification of “Human, Weapon” violence\nirrespective of type of context. Enter the result\nhere. Use two digits.\n17. HuViWeaponless. Enter here the total numb¬\ner of tallies made under the classification of “Hu¬\nman, Weaponless” violence, irrespective of con¬\ntext. Use two digits.\n18. HuViOther. Enter here the total number of\ntallies made under the classification of “Human,\nlegal, verbal, other” violence, irrespective of con¬\ntext. Use two digits.\n19. Nature Vi. Enter here the total number of\ntallies made under the classification of “Act of\nNature” violence, irrespective of type of context.\nUse two digits.\n20. AcciVi. Enter here the total number of tallies\nmade under the classification “Accident,” ignoring\ntypes of context. Use two digits.\n21. Animal Vi. Enter here the total number of ^\ntallies made under the classification “Animal,\nignoring types of context. Use two digits.\n22 Misc. Vi. Enter here the total number of\ntallies made “under the classification “miscel¬\nlaneous,” ignoring types of context. Use two digits.\n23. Total Vi. Enter here the total number of\ntallies made of violence across all classifications\nand types. Obtain this number by actually recount¬\ning all tallies made. Then, sum the entries made\nunder the seven classes of violence to insure that\nthis total cross-checks with the entry in space 23.\nUse two digits.\n24 Context I. Sum across all classes of agents\nof vioIence~\"the number of tallies listed as Type I\ncontext and enter the total here. Use two digits.\n25. Context II. Sum across all classes of agents\nof violence the number of tallies listed as Type\nII context and enter that total here. Use two digits.\n26. Context III. Sum across all classes of agents\nof violence the number of tallies listed as Type III\ncontext and enter that total here. Add up the\nentries for the three types of contexts to make\nsure they sum to the total entered in space 23.\nUse two digits.\n27. Program Class. Check your recommended\nprogram classification with your supervisor. After\nyou and your supervisor agree on a classification,\nenter the appropriate code number for the class\n28. Audience. Enter here the proper code numb¬\ner from the list below to indicate the apparent\nintended audience of the program. Clues for mak¬\ning this classification frequently are obtained from\nphrases used by the announcer or stars; e.g. Hi\n“Ladies, are you .\nIntended Audience Code\nAudience\nHousewives\nChildren\nTeen-agers\nCode No.\n1\n2\n29. Adv. Class. Check your recommended ad¬\nvertising classification with your supervisor. After\nyou and your supervisor agree on a classification,\nenter the appropriate code number for the class\nin this space.\n30. Monitor. Each monitor will be assigned a\ncode number which he shoulo enter in this space\non each log sheet completed by him. Just below\nthe space for your code number, sign your name.\nYour contribution to this study will be acknowledged\nby name in the published reports.\nThe Public Issues Form. The presentation of\npublic issues on television will receive special\nattention in this study. To quote from our program\nclassification scheme, a public issue presen\nincludes any discussion or debate of action(s),pas,\npresent or proposed, that has consequences for\nthe general public or deals with their interss.\nProposed legislation, governmental actions, foreign\npolicies, defense spending, budget balancing fa\ngovernmental units, educational needs, public\nhealth and crime prevention are but a few of the\ntopics that might be included in public issues\ndiscussions."
}