{
  "id": "d1345-67",
  "text": "63\nNot all public issues content will be in the form\nof discussion or debate among several participants\nYou may find opinions given on public issues in\nthe form of monologues, as in presentations by\nnews analysts, persons being interviewed, or in\nextemporaneous comments by performers. Do not\ninclude the mention of public issues in news reports\nunless the reporter expands on the topic by giving\nan analysis of the news or by giving his personal\nviews in a commentary.\nA special form is provided for recording the\npresentation of public issues. This form shall be\nused for all programs classified as public issues\nprograms, and for all discussions of public issues\nexcept news reports as noted above, in programs\nn°t ciassified as public issues programs. The\npublic issues form is only a supplement to the\nregular log sheet; all programs must be recorded\non the standard log sheet.\nThe Public Issues Form has three spaces in the\nupper right-hand comer in which you are to copy\nthe station code, the day code and the log sheet\nnumber from the log sheet used in monitoring a\nprogram with public issues content.\nAt the top of the main body of the Public Issues\narm is a space to record the program title. Just\nbelow this space are five lines, lettered A through\n’ on which you are to list as accurately as possible\nnames, identifications and affiliations of the par¬\nticipants m the public issues discussion. A sample\nentry might read as follows:\nA. John Jones, U.S. Senator from Maine. Re¬\npublican.\nlame If Senator J°nes ^ates that a\nf dmg army 1S not necessary and cites the\ne of air power in modern warfare as his reason,\nhe has made his reason, he has made a point\neffect\" rh a r ^ r^°inS with an ar8™ent to the\neffect that while air power is important where the\nenemy s strength is concentrated, it is less ef-\ndecentralized strength, then he too\nthus mfrf a- PT- Make °ne tally for each point\ntributor^6 ^ thG ^aCe corresPonding to the con¬\ntributor s name. Do not attempt to judge the\naccuracy or effectiveness of the arguments in mak¬\ning tallies. Do not tally mere veritage or evasive\nomments. Note that one point may be backed\nup by a number of reasons. You are to tally only\nthe points, however. y y\nFnrrri fa alS° Provided on the Public Issues\nForm for summarizing the discussion. In this\nsummary, outline the major views given by each\nparticipant, and note those participants who were\nin agreement and those who were not.\n°n bott°m °f the Public Issues Form are\nthree rating scales. On the first of these, you are\nto place a check on the scale to indicate the extent\nto which rational rather than emotional arguments\nwere used in the discussion. The scale is seg-\n,™f\"ted int° toee portions; the two extremes are\nlabeled and the center portion is left as an “in-\nbetween section. By rational arguments, we mean\nobjective appeal to fact and evidence. By emo¬\ntional agruments, we mean subjective views, ap¬\npeals to custom, and so on. The extremes of\nthis scale could also have been labeled objective\nand subjective.\nRecord all information necessary to identify each\nparticipant.\nBelow the listings of participants are five spaces,\nlettered A through E to correspond to the spaces\nfor recording participants’ names, in which you\nshall enter tallies to represent the ‘ ’points” made\nhy each participant. By a point, we mean a new\ncontribution, including its development and conclu¬\nsion, to the discussion that is relevant to the topic(s)\n, the, ^ond scale, you are to indicate the\nbreadth of coverage given to the topics of dis¬\ncussion That is, were several points of view\nexplored, or only one?\nOne the third scale, you are to indicate with\nan appropriate check the extent to which the pre¬\nsentation was an impartial one. That is were\ncertain views “sold\" to the audience, or were\nfacts presented impartially from which the audience\ncould draw its own conclusions?"
}