{
  "id": "d1345-7",
  "text": "4\n1. Above all, the reader must recognize that\nthis study has sampled New York television, and\nthe many cautions recommended to those who\ndeal with sampling studies in general apply fully\nto this particular study. At best, this report is\nbased on a sample of the winter programming of\nNew York television. This fact imposes some ob¬\nvious limitations upon the extent to which this\ninformation applies throughout the year. As one\nexample, we know from similar studies conducted\nin summer months that more time is devoted to\nsports events and sports news in summer than in\nwinter, and that fewer “name” shows appear\nduring the summer.\n2. Since this report discusses a sample of tele¬\nvision programming, it is safe to assume that re¬\npeated samplings of New York television would re¬\nveal many minor differences when comparisons are\nmade with the 1954 study and with studies from\nprevious years. This fact, of course, is due to\nthe normal variations in programming that occur\nfrom day to day on television. For example, the\n“late-late” shows may contain a few more comedy\ndramas during one sample week than during another.\nFor this reason, some obtained differences among\nsamples can be written off as chance variation.\n3. It is also true that one might find some\nreal differences in programming among repeated\nsamplings of New York television. Such would be\nthe case if a certain program were added to the\nprogram schedule as a regular daily or weekly\nfeature. The problem, of course, in comparing\nfindings from one sample with those from another\nis to single out the real differences from among\nthose that are due to chance factors. The statis¬\ntician attempts to solve this problem by comparing\neach difference with the magnitude of difference\nthat would be expected by chance (sampling fluctu¬\nation) alone. Of necessity, the precision to be\ngained from such tests was sacrificed, and arbitrary\nrule-of-thumb criteria are used in discussing trends\nin this report. The reader thus should be warned\nthat, from a statistical point of view, the trends\nnoted in the report may not all be “real.”\n4. Finally, it should be noted that we make no\nattempt in this report to gauge the importance of\nthe facts about the programming of New York tele-\nFigure 1\nNEW YORK TV: TOTAL WEEKLY PROGRAM TIME,\nBY TIME SEGMENTS, 1951-1954\n20000"
}