{
  "id": "d1565-0",
  "text": "WASHINGTON REPORT\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue, N.W., Washington, D.C., 20036\nVolume IV, Number 15_October 15, 1963 \nNEW EDUCATIONAL FM RADIO STATIONS AUTHORIZED\nFour licenses and four CPs have been issued for new educational FM stations\nin the past two weeks. Those receiving licenses were:\nWIAA, National Music Camp, Interlochen, Mich. (Sept. 27)\nWSAE, Spring Arbor (Mich.) College (Sept. 27)\nKUNR, Univ. of Nevada, Reno (Sept. 27)\nWTSC-FM, Thomas C. Clarkson Memorial College of Technology, Potsdam, N.Y.\n(Oct. 4)\nCPs were granted to the following:\nLafayette College, Easton, Pa., for new Class D educational FM station, to\noperate on 90.5 me, with 10 w.\nUniv. of Mo School of Mines & Metallurgy, Holla, for new Class D station to\noperate on 88.5 me, with 10 w.\nCornell College, Mt. Vernon, la., for new Class D station to operate on 89.7\nme with 10 w.\nWisconsin State College and Inst, of Tech., Platteville, for new station to\noperate on 89.5 me, ERP 275 w, antenna height 115 ft*\nADLER PROPOSES MODIFICATIONS IN 2500 me RULES\nOn Oct. 3, the FCC invited comments to a proposal by Adler Electronics, Inc.,\nto amend the rules governing ITV Fixed Stations so as to assign alternate channels\nwith 6 me separation to a single licensee in the same area, instead of the 30 me\nseparation between the 31 channels specified in Sect. 4.902 for such transmission.\nIn its petition, Adler claimed that arranging assignments in each group on\nalternate channels would make possible a broad-band receiver capable of receiving\nseveral channels, thus saving the cost of a separate receiver for each channel.\nThe Commission is particularly interested in actual experimental data on the\nnecessary ratio of desired to undesired signals for interference-free reception when\nstations are operated on alternate or adjacent channels, and at other channel\nseparations both with broad-band receivers of the type proposed by Adler and single\nchannel receivers, also estimates of the probable range of costs of the different\nreceivers.\nSENATE PASSES NDEA EXTENSION\nOn Oct. 8, the Senate passed (80-4) H.R. 4955, the bill providing for a three-\nyear extension of the National Defense Education Act, the Federally impacted areas\nlegislation, and for an expanded vocational education program. As originally passed\nby the House, H.R. 4955 provided only for the expansion of the vocational program.\nThe differences created by the Senate's addition of NDEA and impacted area extensions\nwill now have to be resolved by a Senate-House conference committee. Normally it\nis necessary for the Rules committee to grant a rule before the bill can go to\nconference. Chm. Howard Smith (D., Va.) is known to oppose some of the expansions now\ncontained in H.R. 4955; therefore obtaining a rule is expected to be a difficult matter"
}