{
  "id": "d1565-1",
  "text": "CHANNEL 37 RESERVED FOR RADIO ASTRONOMY\nBy Report & Order (Oct. 4), the FCC made TV Ch. 37 available for the exclusive\nuse of radio astronomy for a period of ten years (to Jan.l, 197*0 throughout the\nU.S. Ch. 37 is not being withdrawn from the table of TV broadcast assignments but,\nto aid and protect radio astronomy, it will not be assigned for broadcast purposes\nfor ten years. No present TV service will be affected. There are only two cities\nwhere applications have been filed for this channel -- Paterson, N.J., and Melbourne,\nFla. The Commission will propose a replacement for the Paterson assignment in its\ncontemplated revision of the UHF assignment table which is expected to be released\nwithin the next week or two. The NAEB recommended table of assignments (based on\na computer study carried out in recent months in cooperation with the FCC under a\nUSOE contract) which will be released before the end of the month will also provide\nfor a replacement for the Paterson channel, which had been requested for educational\nuse. The NAEB study has also found replacement channels for Ch. 37 in Weston, W. Va.\n(where Ch. 37 was a part of the state plan), and other critical, areas where Ch. 37\nis being withdrawn.\nARTHUR SCHATZOW HEADS FCC RESEARCH & EDUCATION DIVISION\nThe FCC has announced the appointment of Arthur Schatzow as Chief of the Research\n& Education Division of the Broadcast Bureau. After service with the Dept, of Labor\nand the Wage Stabilization Board, he joined the FCC in i960 and served as senior\neconomist in the Research & Education Division until recently when he became its\nActing Chief.\nNEW ETV CHANNELS SOUGHT\nMaryland, Alabama, and Virginia have all requested the reservation of additional\nchannels for ETV. The Maryland State Board of Education has requested the allocation\nof the following channels to Maryland and their reservation for ETV: Annapolis - 53;\nBaltimore - 72; Cumberland - 17; Frederick - 62; and Hagerstown - 52.\nThe Alabama ETV Commission has requested that Ch. 25, assigned to Huntsville,\nbe reserved for ETV use in that city.\nThe Advisory Council on ETV of the Commonwealth of Virginia has requested\nthe assignment and reservation of eight UHF channels and reservation of seven existing\nUHF channels for ETV use in 15 communities \"as a necessary and further step toward the\nestablishment of a Commonwealthwide ETV system.\"\nNEW ETV STATIONS\nOn Oct. 3, the FCC granted a CP for a new ETV station to the Regents of Eastern\nNew Mexico University (Portales). Station to operate on Ch. *3; ERP 57.2 kw visual and\n28.6 kw aural; antenna height 1,400 ft.\nOn Oct. 10, Hearing Examiner Kyle issued an Initial Decision looking toward\ngranting the application of Northern Calif. ETV Assn., Inc., for a new ETV station to\noperate on commercial channel 9 in Redding.\nINTERCITY RELAY APPROVED FOR MAINE\nThe Commission waived Sect. 4.631 (e) of the rules and granted applications\nof the University of Maine for a three-hop intercity relay system to transmit\neducational program material from main studio of WMEB-TV (Channel *12), Orono, to\nColby-Bates-Bowdin's noncommercial educational station WCBB-TV (Channel *10),\nAugusta. Though not licensed to the University, WCBB -TV will be an integral part\nof the State network, rebroadcasting substantially all of the programs originated\nat the University's Orono main studio."
}