{
  "id": "d1565-1",
  "text": "MEMBERSHIP REPORT\nTreasurer Brackett reports one renewal of membership, that of Station ?«0I,\nIowa State College, Ames, and one new membership — the University of Kentucky.\nThe University of Kentucky broadcasts from its own campus studios by wire\nto Station MAS, in Louisville. Members are familiar with the activities through\nthe exchange packet bulletins. Mr. Elmer G. Sulzer is director of the broad¬\ncasting. He organised the listening center plan which makes radio available in\nthe remote mountain areas and so takes the university to a group formerly out\nof reach.\nSHORT FLASHES FROM THE FIELD\nKOAC - Corvallis, Oregon. Luke L. Roberts, Manager of KOAC,*has recently\ncompiled the data and released a report on \"How Educators Support Radio\". Based\non a questionnaire survey of educational broadcasting agencies the report makes\na comparison of financing, hours of service, end institutional backing.\nWBAA - Purdue University. The station is cooperating in the presentation\nof a special course in radio broadcasting to be given during the 1937 summer\nsession. Miss Blanche Young, of Indianapolis, will teach the course. Rehearsal\nand study will be in WBAA studios and workshop.\nUniversity of Kentucky. To extend the services of the University broadcasts\nover WHAS to the listening groups in the eastern mountains, Elmer G. Sulaer tells\nof the appointment of a special supervisor through the NYA to visit theso remote\nlistening posts. Discussion and correlated activities will be encouraged.\nWOI, Iowa State College. Amos. Director Griffith reports that programs from\nhis station are being fed by wire to KMA, commercial station at Shenandoah. Mar¬\nkets ? vocational guidance, music, and other educational features are being\ncarried.\nROCKY MOUNTAIN RADIO COUNCIL PLANNED\nThrough the assistance of the National Committee on Education by Radio a\nsurvey of the talent and facilities resources of the Colorado-Wyoming area was\nmade late in April for a group of local educators and civic leaders. President\nA.G. Crane of the University of Wyoming, was chairman of the committee appointed\nto conduct the study. Harold A. Engel, WHA promotion manager, went to the region\nand drafted a preliminary plan. S. Howard Evans, of the N.C.E.R. joined him in\nthe field work. The study followed the general plan for state organizations out¬\nlined a year ago bv Dr. Crane. Educators, local leaders, and broadcasters are\nenthusiastic over the plan, which would establish a central staff of exports to\nassist agencies in the preparation and presentation of their radio programs.\nMeans of financing the venture are now being considered.\nTHE 1957 ANNUAL NAEB CONVENTION - WHEN - WHERE?\nThree invitations from member stations have been received by the Association\nfor the annual convention. Mr. C. A. Taylor, WESG, Cornell University, invites\nthe meeting to Ithaca, New York. Mr, Clarence Dammon, WBAA, Purdue University,\nopens the gates of Lafayette, Indiana. Mr. Jos. F. Wright, WILL, University of\nIllinois, says, \"Come to Urbana\". There we have it — we can’t go to all places\nat once — so we must choose. On the enclosed sheet make your choice of place\nand dote, and return it promptly, please."
}