{
  "id": "d336-106",
  "text": "-11-\n\\\nE. Scholarship and Training Program\nDuring past years, many letters have reached this office inquiring a-?\nbout possibilities for financial support for various types of personnel¬\ntraining projects. This includes modest assistance to make possible staff\nexchanges on short-term basis between NAEB members as well as with the CBC,\nthe BBC or other systems, and support of Fulbright scholars in both direc¬\ntions when genuine hardship is demonstrated or when an exchange that would\nnot otherwise be possible is made possible. (There will be no possibility\nof an NAEB selectee going to Britain next year because of the financial\ninability of the NAEB or its members to accept a BBC representative this\nyear, for example.) This project should be on a continuing basis if it is\nto be effective.\nThree-year Budget Proposed $ 15,000.00\nAdministration (5%) 750.00\n$15,750.00\nVI. Conclusion\nIn conveying this request,‘San behalf of the NAEB we wish to. express our\ndeep appreciation for the increasingly obvious significance of the devel¬\nopment which the W. K. Kellogg Foundation's grant, to enable the creation\nof a national office and Network, has made possible. Without this office,\nstaff, experience and distribution system, the NAEB could never have se¬\ncured, accepted, or successfully administered the other grants (for TV\nmonitoring Studies, grants-in-aid, workshops and scholarships, the \"Big\nFour\"-Jeffersonian Heritage. Ways of Mankind. People Under Communism and\nVoices of Europe, and other series regularly scheduled and winning increas¬\ning recognition)* The structure to make all this possible is Kellogg-\ncreated and largely Kellogg-maintained.\nIn our requests it will be noted that we are placing considerable em?*\nphasis on funds to enable us now more adequately to publicize this growth,\nand to give Kellogg-financed projects (Seminars, Committee Reports and Pub¬\nlications, Regional and National Meeting Proceedings, Research Studies) a\npublished form, and a distribution which will make their valuable contents\nmore usable to schools, radio and television stations, and civic groups both\nin the U.S. and abroad.\nAs is so often the case, in reports on broadcasting project which must\nbe heard rather than seen, if full impact and value are to be appreciated,\nwe realize that our written report and the materials distributed are only\nsuggestive. With the requested funds, for the uses outlined, more adequate\nreporting and a more accurate picture should be possible for the extremely\nsignificant projects and materials which the W. K. Kellogg grant to the NAEB\nhas made possible.\nIf a priority must be placed on the projects outlined here, therefore,\nour preference would be for the granting first of funds to carry out the\nproject outlined in the first item of the Supplemental request.\nIn the other requests for supplemental funds for deserving projects\n(believed to be in line with Kellogg Foundation objectives) will be found,\nwe believe, evidence of the practice which the NAEB has always followed,"
}