{
  "id": "d336-29",
  "text": "-2-\n1. That NO'/'/ and in the FUTURE the NAEB BUDGET be set and strictly followed*\n2. That no deviation from the budget be allowed except by Executive Committee action\nand then onfjt to be sanctioned by the Board ( by mail if neeessary)®\n3* That NAEB Funds shall be released for expenditure by quarterly allotments. Example:\nIf you have a budget of §100,000, you can get only $25,000 each quarter* Said allotment\nfor each quarter would be determined by action of the Executive Committee. If the\nUniversity of Illinois does not wish to work with us on this plan, then I suggest\nwe go where we can get cooperation*\n4, It should be stressed most emphatically to the Executive Director of NAEB and other\nresnonsible officers that it is their duty to see to it that the NAEB budget is fol¬\nlowed to the letter and thev are to be held personally responsible for any deficits*\nWhen the allotment, for each quarter runs out, we’re out of money. Only by special action\nmay any portion of a subsequent quarter’s allotment be used. Gentlemen, it would make\nthose who spend the money stop and think before the bottom of the barrel is scraped.\nIn the operation of the NAEB Tane Network, I am of the opinion that some radical\nchanges will have to take place.\nIn the first place, it takes just as much money to service WNAD as it does WHA or\nWNAS (16w)*\nI know that the theory has been we should charge according to the power of the station*\nBut that is an erroneous bas^ s because power is not necess&rilv a criterion of ability\nto pay*\nFurthermore, for a great number of us, the Tape Network is a proerramminr adjunct —\nsomethin* nice to have and distinctive but in a pinch we could do without as we did\nfor so many, many years. For a lot of NAEBers, the Tape Network programs represents\nthe programming of the station*• ..periodl Without the tape network, they would be\nlost; the network is a crutch on which they lean heavily, not exploring any of their\nlocal programming potentials. A\nAgain, I say that POWER should not. be the basis of service charges for the Tape\nNetwork, I know a howl will be raised in many quarters, but I believe the time has\ncome for us to be realistic about this whole matter. The so-called lower powered\nstations are getting a valuable service much too cheaply*\nTou mav or may not read this memorandum. I don’t consider myself one of the fair\nhaired boys of NAEB ith super-duper intelligence. But Ido think I’ve got a little\ncommon sense which I hope is reflected in the above paragraphs. Toss it in the\nwastepaper basket, boys, or you can THINK about what I’ve said —just a little*"
}