{
  "id": "d336-68",
  "text": "Purdue University\nSTATION WBAA\nLAFAYETTE. INDIANA\nJune 15, 1954\nNAEB HEADQUARTERS\nMr. Harry Skornia\nExecutive Director,\nNAEB,\n14 Gregory Hall\nUniversity of Illinois\nUrbana, Illinois\nDear Harry:\nJUN 17 i3b4\nDM P*\n,7i8|9|fP(ll|X2|l|2|3|4|5i?\nL\nMay I MAKE SOME UNOFFICIAL COMMENTS ON THE MEMOS YOU WERE SO KIND TO\nSEND ME.\nFirst, regarding the \"Penn State Two Years After\". I think by all\nMEANS WE SHOULD TAKE THE INITIATIVE IN HOLDING THIS. ALTHOUGH I SUPPOSE THE\nAmerican Council on Education should be consulted inasmuch as they were the\nINSTIGATORS OF THE FIRST CONFERENCE AND CONCEIVABLY SHOULD HAVE A PART IN\nCALL 1N6 THE SECOND ONE. I DON * T THINK IT SHOULD BE HELD AS A PART OF THE\nNATIONAL CONVENTION. IF I REMEMBER CORRECTLY THE FAE WAS MORE THAN WILLING\nTO UNDERWRITE THE TOTAL COST ON THE FIRST ONE AND I SUPPOSE WOULD BE ON THE\nsecond. Let’s make it at a different time than from the National Convention\nAND REAP THE NECESSARY PUBLICITY FROM IT.\nI HAVE READ AND REREAD YOUR LETTER TO AUSMUS REGARDING YOUR DISCUSSIONS\nwith Van Duyn. All of this is very reminiscent of several discussions that\nVan Duyn, Masters, Schramm and I have had upon numerous occasions. I think\nyou HAVE HIT THE NAIL RIGHT SMACK ON THE HEAD WHEN YOU POINT OUT THAT WE NEED\nSOME POLICY DETERMINATION. I AM GLAD TO SEE EARL WYNN’S LETTER. I THINK THAT\nTHIS STUFF, WHICH EVIDENTLY IS PLANNED FOR THE FALL CONVENTION, IS A STEP IN\nTHE RIGHT DIRECTION.\nFor your information and perhaps to make you feel a little better about\nTHE WHOLE COURSE OF EVENTS AT BATTLE CREEK, YOU SHOULD KNOW THAT TWO YEARS\nago Bob Van Duyn and I made a trip to Iowa State. Bob wanted to visit the\nIowa State setup and discuss some other things. At that time he wanteo to\nTAKE ADVANTAGE OF OUR LONG TRAIN RIDE THERE AND OUR BEING TOGETHER ON NUMEROUS\nOTHER OCCASIONS TO DISCUSS AT GREAT LENGTH MANY OF THE PROBLEMS THAT HE EVI¬\nDENTLY DISCUSSED WITH YOU. He HIT JUST AS HARD THEN AND IT CAUSED ME TO MAKE\nSOME SIMILAR REPORTS ALTHOUGH I AM AFRAID ONLY VERBALLY TO VARIOUS MEMBERS\nof the Board and, of course, to Schramm and Hudson who were directly involved\nAT THAT TIME. THEN, LIKE YOU, I BECAME SO INVOLVED IN THE DAY TO DAY DETAILS\nOF THE OPERATION THAT THIS KEPT CONTINUALLY BEING SHUNTED INTO THE BACKGROUND\nAND JUST NEVER GOT SOLVED. At THAT TIME, IF I REMEMBER CORRECTLY, I TRIED\nTWO OR THREE WAYS TO GET THIS WHOLE AFFAIR ACCOMPLISHED. BECAUSE OF SOME\nJEALOUSIES WHICH EXISTED AT THAT TIME AND WHICH UNDOUBTEDLY EXISTS TODAY, I\nHAD TO FOREGO DOING ANYTHING ABOUT IT.\nIf you will check, I believe you will find where I proposed in February\nOF 1952 THAT THERE BE CALLED A CONFERENCE OR MEETING WITH SOME OF THE OLDER\nTHE VOICE OF\nWOVE\nf WBAAtm"
}