{
  "id": "d336-78",
  "text": "-3-\nall possible help in raising program offerings.)) do suggest gradual, though\nslow, improvement in the functions and offerings of the NAEB Newsletter, with\nproportional increase in its distribution (now 400 copies per month).\nUnfortunately for the load to be handled by the not proportionately\nincreased staff, the efforts of the Headquarters staff always to give a courteous\nreply to all inquiries has resulted in a greatly increased load of mail from\nstudents, clubs, and other groups which we feel to be of great importance in the\nAmerican System. To handle many of these inquiries, and those from the many\ndirectories and other national organizations calling upon us for advice and help,\nwe have devised economical, succinct historical statements about the NAEB.\n(Exhibit 4). As soon as the NAEB Constitution (now in Committee) is revised, it\nis our hope to secure funds for the publication of NAEB brochures to tell the\nstory of educational broadcasting, the NAEB, the Tape Network, and the role of\nthe W. K. Kellogg and other foundations in this movement. Msanwhile, we attempt\nto provide the most complete data available, and to encourage efforts, now in\ngraduate-student research stages, to secure an adequate history of this area to\ndeserve publication.\nNew Services\nDuring the past year the NAEB has been fortunate enough to secure modest\nfunds for the setting up of various consultation and other member services. An\neducational television and radio placement, personnel and job analysis and\nclassification office is now a full-time NAEB function, the NCCET, JCET, ETHC,\nand all other organizations having agreed that this is one of the many services\nwhich the NAEB is the natural organization to carry out.\nThe NAEB has for some years had Legal Counsel in Washington. It now has a\nManagement Consultant whose services are available without charge (for the term\nof the grant) to member stations. An NAEB Engineer with supporting secretary,\nand expenses, takes over his duties in July, to provide the critically needed\nhelp which frequently technically understaffed stations so often need but can’t\nafford, particularly as they move into the new area of television.\nStudies of the resources available on NAEB member staffs around the U. S.,\nnow in progress, reveal the unique and vital role which the NAEB enjoys and\nwhich both commercial broadcasters and national organizations (with both of\nwhich increasingly friendly relations are being developed and maintained) look to\nit to carry out. The responsibilities which the NAEB bears are increasingly\nweighty, but also increasingly challenging, and it is gratifying to see the\nnumber of inquiries which it now seems natural to hundreds of people around the\nU. S. and the world to address to us.\nNAEB Representation\nDuring the past year the NAEB was invited to provide representation as the\nassociation of educational broadcasters at a considerable number of functions,\nboth abroad and in the U. S. In most cases, in view of the limited travel budget,\nthis had to be done by the NAEB representative nearest to the scene, or at the\nexpense of individuals or organizations other than the NAEB."
}