{
  "id": "d336-81",
  "text": "—6—\nThe NAEB Network\nGENERAL: One of the most important functions of the NAEB is the operation\nof the Tape Network. Through the facilities of the network, the best in educa¬\ntional programming is made available to members. This not only allows the\nmember stations to present outstanding programs from other stations, but through\nthe time-relief factor, allows each station to devote more time to the prepar¬\nation of better programs. The value of this service is illustrated by the steady\ngrowth of the network, even in the face of rising assessment fees.\nEFFECT OF DUES INCREASE: As of July 1, 1953, there were 85 stations using\nthe network. With the increase in assessment fees that same month, an increase\nranging from 33 per cent to 84 per cent, 23 members were forced, for financial\nreasons, to drop out of the network, reducing the number to 62. However, this\nnumber has increased until it is now back up to 82. This increase has been\nbrought about by two factors: l) New members joining the network, and 2)\nSeveral of those who had originally dropped out re-joining the network due to a\nrealization that such membership was vital to them, regardless of the increased\ncost. However, a general reluctance or inability on the part of institutional\nadministrations to grant budget increases necessary to meet this and other rising\ncosts of operating an educational station, has been increasingly noted this year,\nand the estimate of receipts for next year from this source realistically\nanticipates several further drop-outs as the fees rise.\nSELECTION PROCEDURES: A different method of selecting program series for\nuse on the network was instituted this year. In the past the Network Acceptance\nCommittee was used only as an appeal to decisions of the Headquarters staff, or\nwhen there was any question in the mind of the staff about the merit of a given\nprogram. However, this year, all program series submitted to the Network have\nbeen auditioned, and the selection made, by the committee. This has resulted\nin a considerably different type of operation and represents a new effort to\nbring about a general up-grading of programs offered by the Network. Although\nthis procedure has also resulted in the need and use of more tapes, because so\nmany are required to send audition copies to the several members of the committee,\nit also illustrates the increasingly important working status of NAEB committees,\nwhich is virtually unique in American Associations; much of the published output\nof the NAEB is now committee-produced.\nDUPLICATOR SITUATION: This year, through a special grant from the W. K.\nKellogg Foundation, the NAEB was able to purchase a new mass duplicator and,\nalso, to have the original duplicator returned to the manufacturer for badly\nneeded repairs. The new duplicator, plus improved operation of the old one, has\nresulted in almost incomparably better service to the network members. It has\nincreased the number of tapes that can be handled and has assured a better\ntechnical quality. It has removed pile-ups, reduced the number and length of\ncrises due to waiting for parts or repair, and has already resulted in most\nsignificant savings by cutting down on the number of rush shipments necessary.\nUntil this special grant was approved, operations of the network were beginning\nto be greatly hampered. This special grant also included funds for the purchase\nof approximately 1,000 new tapes which were badly needed and are also already in\nservice.\nExhibits 7, 8, and 9 give evidence of the expanded activities of the network\nand show the present tape status."
}