{
  "id": "d336-87",
  "text": "-12-\nHowever, the unstinting and patient efforts of Ex-Executive Directors Frank E.\nSchooley and James S. Miles could always be counted on, and are herewith\nacknowledged with deep appreciation. Evidences of discontinuity were to be found\nHowever, in most cases they were of a minor nature, and were discounted as the\nyear progressed.\nAt year's end, although secretarial and duplicator operations staffs had had\nto be reduced in size and cost (because of the extent to which costs for the most\nbasic factors in keeping the Network going (notably postage and tape) exceeded\nestimates and available budget as explained in the earlier revised budget state¬\nment submitted to the W. K. Kellogg Foundation in February of this year), curtail¬\ning various planned projects, the staff had again settled into a hard-working,\ndevoted team, strengthened in February by the addition, thanks to an additional\nKellogg grant, of Harold E. Hill as Associate Director, to assist the Executive\nDirector in the growing number of projects for which NAEB Headquarters is respon¬\nsible, in addition to the Network. The budget was further relieved by the teach¬\ning of one graduate course at Illinois by the Executive Director, which made\nhim in effect revenue-producing for the NAEB, since none of this sum (approxi¬\nmately $1,350.00) was retained by him personally (being reimbursed to the NAEB).\nAs the year ended, the staff at work, following several further changes\nsince last summer, was as follows:\nHeadquarters:\nHarry J. Skornia, Executive Director\nHarold E. Hill, Associate Director\nWinifred Coatney, Secretary\nMary L. Reaser, Clerk-Typist (hourly)\nNetwork:\nJohn Holt, Network Manager\nRosaline Biason, Network Traffic Manager\nGlenn Blackburn, Duplicating and Shipping Supervisor\nDiane Aronovsky, Duplicator Operator\nChrista R. Schneider, Duplicator Operator\nJack Kuntz, Duplicator Operator (half-time, hourly)\nBudget and Detail Work\nAs we entered the fall season, various details, which the pressure of\nimmediate problems had caused to be postponed, were finally undertaken. Attrac¬\ntive NAEB Fellow Certificates were designed and distributed to those persons who\nhad been selected for the various conferences and seminars held by the NAEB\nduring past years. (Exhibit 21) Business cards for the NAEB officers and\nwallet-size membership cards for NAEB affiliate members were designed and printed\n(Exhibit 22) Careful investigation of the new postal rates, with design of\nproper labels to result in maximum economy, as well as simplication of mailing\nprocedures in general, were instituted."
}