{
  "id": "d336-96",
  "text": "Request for Supplemental Funds\nto the\nW. K. Kellogg Foundation\nPublications\nA. The General, long-term problem:\nIn general the situation in this area is partly responsible for the\nconfusion, the sometimes over-lapping jurisdictions of the many organizat¬\nions interested in radio and television, and the duplication of publica¬\ntions services*\nThe AERT (Association for Education by Radio and T.V) Journal, the JGET\n(Joint Committee on Educational Television)publications, the NCCET (Nation¬\nal Citizens Committee for Educational Television) News, the ACE (American\nCouncil on Education) Television Newsletter, various audio-visual magazines,\nthe NAEB Newsletter, and the NPAC (National Project in Agricultural Commun¬\nications) publications, to mention only a few, illustrate this duplication.\nThe efforts of various organizations to preempt this area and \"coordinate\nfor all\" are becoming both confusing and intense, as evidenced by this ex¬\ncerpt from a letter dated June 1:\n\".One of the topics he mentioned in which he was interested related\nto Audio-Visual COMMUNICATION REVIEW, He stated that there was some\ninterest in a professional journal which would service the radio-tele¬\nvision field but that some objected to using COMMUNICATION REVIEW as\nan outlet because it had the sub-title ‘Audio-Visual.*\n\"We in DAVI have no particular interest in maintaining the 'Audio-\nVisual' in the title. We debated at some length about whether or not\nto add it in the beginning, but decided to do it, so that we could\nsomewhat narrow our approach to the field of communications, feeling\nthat it was not wise to spread ourselves too thin. If you will look\nover the back issues, I am certain that you will find that we have tak¬\nen a rather broad approach to the field of communications and would\nlike to do an even better job in this respect.\"\nThis is only one of nearly a score of such efforts which we experience\nregularly. At present, any person desirous of keeping informed in the com¬\nmunications area must read nearly a score of scattered publications, or run\nthe risk of missing essential parts of the rapidly expanding framework of\ncommunications. Many now borrow and quote from each other in rather incestu¬\nous and uneconomical fashion, but no one is yet in a position to coordinate,\nintegrate, and edit (in the best sense) these scattered efforts. Although\nthe NAEB is probably not the only organization which feels con¬\ncerned about this, or which might undertake the publication\nof such ' a journal, it is obviously a better placed group\nthan some which may take over (or are likely to end up by taking over) this\nfunction.\nIn upcoming discussions which the NAEB proposes to hold in the near\nfuture, with the representatives of such other organizations as the NPAC,\nit is hoped that a (perhaps joint) proposal may be evolved which the W. K.\nKellogg Foundation might be interested in supporting. In view of the longer**-"
}