{
  "id": "d61-15",
  "text": "Long-Range Communication With\nSingle-Sideband Diversity Units\nTRANSOCEANIC COMMUNICATION CAN BE ACCOMPLISHED DEPENDABLY\nWITH SINGLE-SIDEBAND DIVERSITY EQUIPMENT — By MURRAY G. CROSBY*\nONE of the heaviest long-range communication traffic loads\nin history occurred during the time of the recent corona¬\ntion ceremonies in England. Wide use was made of single¬\nsideband equipment, which performed very creditably. De¬\npendable transoceanic reception of standard traffic and photo\ntransmissions was achieved with Crosby triple-diversity single¬\nsideband systems, used by RCA Communications and Press\nWireless. This relatively new equipment is described in the\nfollowing pages.\nAdvantages of Single-Sideband: A primary reason for\nthe increased use of single-sideband systems is that they yield\nan important saving in frequency bandwith requirements.\nThis is of great importance because of the rapid growth in\ninternational radio communication, which is worsening the\nalready-severe congestion in the short-wave channels.\nIn addition to the basic advantage of economical frequency\nutilization, single-sideband systems permit a 9-db effective\npower gain as compared with double-sideband AM systems.\nThis improvement factor is of considerable significance, par¬\nticularly in multi-channel communication circuits and in\ninternational broadcast services where quality of signal must\nbe preserved in order to meet basic performance requirements.\nSingle-sideband receiving techniques have significant value\nin eliminating certain types of interference even when em¬\nployed with double-sideband transmission systems. A single¬\nsideband receiver can operate in the presence of interference\nwhich may fall within the range of one sideband, but not\nin the range of the other. Sideband selection in such a case\ncan get rid of the interference completely. This, of course,\nis a real advantage in view of the present severe band over¬\ncrowding and international jamming. At the present time,\nas a receiver is tuned to various signals in the HF frequency\nrange, it is a very rare occurrence to find one signal free from\ninterference on both sidebands, and which could not be im¬\nproved by using one sideband alone. Thus, there is an\nobvious advantage in the use of single-sideband receivers in\n‘President, Crosby Laboratories, Inc., Hicksville, Long Island, N. Y.\nany communication system, even though the receiver may not\nbe utilized in receiving signals transmitted by the single¬\nsideband method.\nSingle-Sideband Adaptor: In a single-sideband system, a\nconventional short-wave communications receiver is employed\nto select and amplify the desired radio-frequency carrier and\nits modulation components. Fig. 1 is a block diagram of the\nadaptor for converting such a receiver to single-sideband\noperation; a view of the combined receiver (in this case, a\nHammarlund SP-600JX) and adaptor is given in Fig. 2.\nBy means of a coaxial-cable connection with the IF out¬\nput circuit of the receiver the selected carrier signal, at inter¬\nmediate frequency, is fed to the converter of the adapter.\nHere the carrier is heterodyned with a second signal from a\nhigh-frequency oscillator, under precise automatic frequency\nFIG. 3. SINGLE-SIDEBAND RECEIVER ADAPTOR. NOTE CRYSTAL FILTERS"
}