{
  "id": "d61-16",
  "text": "FIGS. 1 AND 7. FUNCTIONAL DIAGRAMS OF THE ADAPTOR AND COMBINER UNITS\ncontrol, to produce a new intermediate frequency of 100 kc.\nThe 100-kc. IF signal, with modulation components, is\namplified and applied to upper and lower sideband filters\nhaving pass-bands from 100 kc. to 106 kc. and from 94 kc. to\n100 kc., respectively. These filters can be seen in Fig. 3,\nwhich is a rear view of the adaptor. Responses of the filters\nare shown in Fig 4. The 100-kc. signal is applied also to a\nsharply-tuned crystal filter with a pas^band of 20 cycles, which\nremoves the sidebands as shown in Fig. 5. This is fed to a\ntwo-stage carrier amplifier, in which the carrier amplitude is\nadjusted to an optimum level, as required in compensating for\ncarrier reduction at the single-sideband transmitter. From\nthis point, the amplified carrier is applied to a three-stage\nlimiter, a pair of diodes which supply AVC and carrier meter\nvoltages, and a keying amplifier which forms a part of a\ncarrier-off alarm circuit.\nFrom the three-stage limiter the carrier, reconditioned\nand exalted by the filter, carrier amplifier, and limiter, is\napplied to one side of a Reconditioned Carrier-Local Carrier\n-10 -8 -6-4-2 0 +2 +4 +6 +8 +10\nAUDIO FREQUENCY. KC.\nFIG. 4. COMPLEMENTARY\nRESPONSES OF SIDEBAND\nFILTERS IN AN ADAPTOR\nFIG. 5. PERFORMANCE OF\nTHE CARRIER SEPARA¬\nTION CRYSTAL FILTER\nselector switch identified as the LC-RC switch in Fig. 1. A\nlocally-generated 100-kc. carrier from a crystal oscillator is\napplied to the opposite side of the LC-RC switch. Thus, a\nchoice of reconditioned exalted carrier or local carrier for\nsingle sideband reception is available. From the LC-RC\nswitch, the selected carrier is fed to an AM-PM phasing net¬\nwork. This is used in establishing the proper phase relation¬\nship between the sidebands and the selected carrier in am¬\nplitude-modulated double-sideband signal reception and in\nphase-modulated double-sideband signal reception.\nThe reconditioned or local carrier and the sideband signals\nfrom the two sideband filters are applied through a reception\nselector switch to individual detectors for channels A and B.\nHere, exalted-carrier detection is provided by a triple-triode\nproduct-type detector; this unique circuit eliminates har¬\nmonic and cross-modulation distortion caused by selective\nfading of the carrier component. The audio signals in each\nchannel are then applied, through low-pass filters, to separate\naudio amplifiers associated with the two channels.\nThe reception selector switch provides for operation with\nvirtually any method of reception. When the sideband filters\nare switched into the circuit, single-sideband exalted-carrier\nreception is provided. Either the upper or lower sideband of\na conventional double-sideband AM transmission can be\nselected individually, and the signals applied to separate\ndetectors and audio amplifiers, or both sidebands of a twin-\nchannel multiplex transmission can be received concurrently,\nwith the individual signals being applied to the respective\ndetectors and audio amplifiers. When the signals are selected\ndirectly from the 100-kc. IF amplifier and the AM section\nof the phasing network, exalted-carrier double-sideband AM\nreception is obtained. When the PM section of the phasing\nnetwork is used, exalted-carrier reception of phase modulated\ndouble-sideband signals is provided. When a connection is\nmade directly to the diode output of the communication\nreceiver, conventional double-sideband AM reception as pro¬\nvided by the basic receiver is possible.\n100-kc. carrier voltage from the first stage of the three-\nstage limiter is applied to an amplifier driving a crystal dis¬\ncriminator, which produces an output voltage proportional to\nsmall frequency deviations from the mean frequency of 100\nkc. This voltage is rectified by the AFC diodes. The DC\nerror voltage obtained is impressed on the grid circuit of a\nreactance-tube driver, which contains a storage capacitor for\nInfinite Time Constant (ITC) operation. In the event that\nthe IF carrier falls below a predetermined level in the ITC\ncircuit, the AFC diodes are disabled. When the carrier re¬\nappears, normal AFC action is restored. This protects the\nreactance tube and oscillator from spurious control by un-"
}