{
  "id": "d61-21",
  "text": "(5)\nFIG. 6. COMPLETE BINAURAL RECEIVING SYSTEM WITH TWIN SPEAKERS\nThe overall signal-to-noise ratio improvement obtained\nwith the sum-and-difference technique is very nearly equal\nto twice the ratio between the two levels. It can be evaluated\nas follows: The material fed to speaker A is a combination\nof the sum signal with the noise from the main channel, and\nthe attenuated difference signal and subcarrier noise. The\ncombination is given by\nSa + N = (A + B) + Nm + ^ [K(A + B) + Nsc], (1)\nwhere Sa = Signal in A channel\nA = Microphone A signal level\nB = Microphone B signal level\nN = Noise in A channel\nNm = Main channel received noise\nNsc = Subcarrier channel received noise\nK = Amplitude ratio between A + B and A — B\nThe signals A and B in equation 1 add arithmetically, and\nthe noises combine in accordance with RMS addition, to give\na total of signal and noise in the A channel equal to:\nSa. + N = 2A + V(Nm)2 + (Nsc/Kj^ (2)\nor 2A + Nsc \\/(Nm/Nsc)2 + (1/K)2 (3)\nand the signal-to-noise ratio is\nN Nsc V/(Nm/Nsc)2 -f (1/K)2\nBy the same process of development, using the difference\ncombination of equation 1, the signal-to-noise ratio in B\nchannel is:\nSb_2B_\nN \" Nsc V(Nm/Nsc)2 + (1/K)2\nSince the difference between the signal-to-noise ratio on\nthe main and subcarrier channels is at least 20 db, so that\n(Nm/Nsc) 0.1, and K ranges between 3 and 5, (Nm/Nsc)2\ncan be neglected in comparison to (1/K)2. Therefore,\nSa\n2AK\n(6)\nN\nNsc’\nSb\n2BK\n(7)\nN\nNsc'\nEither A/Nsc or B/Nsc represent the signal-to-noise ratio\nin the subcarrier channel as it would have been had not the\nsum-and-difference technique been used. Therefore it can be\nseen from equations 6 and 7 that the sum-and-difference\ntechnique results in two equal signal-to-noise ratios of value\nequal to 2K times the signal-to-noise ratio on the subcarrier\nchannel. The upper curve in Fig. 7 shows the signal-to-noise\nratio improvement for various microphone spacings. It can be\nseen that the signal-to-noise ratio on each channel of such a\nbinaural multiplex system is between 15.5 and 20 db (de¬\npending on the microphone spacing) better than the signal-\nto-noise ratio of the subcarrier channel alone.\nObviously, it would be best to agree upon a fixed value of\nK, so that the attenuation could be fixed in the receiver.\nThe value could favor the wider microphone spacings and\nstill be good for the close spacings. The curves in Fig. 7\nindicate that such a compromise value might be about 10 db,\nwhich produces an overall improvement of about 16 db. For\nthe particular example of a signal-to-noise ratio of 65 db on\nthe main channel and 25 db on the subcarrier channel, appli¬\ncation of the sum-and-difference techniques results in two\nequal signal-to-noise ratios of 41 db. Fidelity on both chan¬\nnels is excellent, since the subcarrier receiver is flat out to 20\nkc.\nAside from the improvement in signal-to-noise ratio of\nthe subcarrier channel, the sum-and-difference technique has\nother advantages. Balancing the noises in the two channels\nproduces a more natural reception, and the distracting effect\nof noise from one speaker only is avoided. Another advantage\nis that, since the main FM channel receives the sum of both\nbinaural channels, better balance is obtained for the listener\nequipped only with a conventional receiver. This improve¬\nment becomes appreciably great for large microphone spac¬\nings. Finally, but not least important, is the ability to bal¬\nance the gains of the two loudspeaker systems on noise. This\ncan be done by detuning the receiver and adjusting the in¬\ndividual speaker gain controls until the noise appears to come\nfrom a point between the speakers.\nConclusion: With a binaural system, the listener has a natural\ntendency to seek out the source of the sound with his eyes.\nIt is for this reason that the equipment cabinet in Fig. 6 was\nsituated between the speakers. It is the author’s opinion\nthat the most logical object for the eyes to rest on would be\na television screen; indeed, it appears that there should be\neven more applications for binaural sound in the field of\ntelevision than in FM broadcasting.\nAdditional reprints may be obtained from\nCROSBY LABORATORIES, INC.\nRobbins Lane, Hicksville, N. Y."
}