{
  "id": "d968-108",
  "text": "April 3, 1967\nSubject:\nSenate Bill 1160\n\"Public Television act of 1967\nThe Honorable btuart Symington\nUnited states Senator\nSenate Office Building\nfaahington, C.\nDear Senator cymingtom\nThm provisions of C.1160 are so significant for radio educational broad¬\ncasting generally and in the metropolitan area of Kansas city, that I\nwrite in behalf of this Bill* Hitherto, television has fared well in\npublic support, but public support of radio has been neglected.\nI hope the title itself can be amended to read \"Public Broadcasting Act\nof 1967\", for the reason that the text of the Mil, as it should, applies\nto both radio and television.\nEducational radio here has made extensive contributions to our cultural\nlife. nd this without having had a strong base of financial support.\nThe stations concerned are as follows i Kansas University, Lawrence,\n100,000 atts, FH, Wf University of Missouri in Kansas City, 20,000\nWatts, FM; Watarene Theological Seminary, Kansas City, 10 atts, FMf\nCentral Missouri State College, warrens burg, 10 Matte, FH,.\nThe University osf Missouri at Columbia, I understand is applying for an\neducational band, bus is now confined to a commercial TV station.\nThe programs ©f the above stations are not available fro® any other source.\nThey are vital to the educational work of the institutions with which they\nare connected. They include lectures on various subjects, addresses, course\nwork for enrolled or extensions studentsj music, both classical and modern,\nas well as other matters, am reach a wide public.\nFor your information I enclose tne March 19, 1967 supplement to the Kansas\nCity Ctar. This is entitled \"The Kansas City tar TV Scene** (an amendment\nthere is in order, too), four attention is called to pages i*H, and 6h,\nwhere articles appear respecting educational radio locally and in Missouri.\nThey are by Joyce \"agner, and X think you will find them interesting and in¬\nformative.\nIn my experience I find educational radio performing a useful public function."
}