{
  "id": "d968-126",
  "text": "J. Sandler\nCm Marquis\nccs; NAEB Executive Staff\nE. Burrows April 7, 1967\nJ * Burke\nRE: Scheduling of Witnesses for Next Week\nI have tried unsuccessfully at least five times in the last 24 hours\nto clarify one point with you: namely, that Robert Lewis Shayon must\nbe scheduled to testify on Thursday the 13th and should be so\nscheduled* It is impossible for him to be there on the 14th under\nany circumstances, and he has agreed to come with the clear under¬\nstanding that he will be called on the 13th. He has also urged that\nevery possible effort be made to get him on as early as can be\narranged due to a severely over-committed schedule later that day\nin Philadelphia*\nAs I explained to you last Saturday afternoon at the Kenwood Country\nClub, the best way to handle this, I believe, would be to schedule\nhim following the NET witnesses and prior to the ETS witnesses. In\nthat way, he could be on either at the very end of the morning\nsession, or at the very beginning of the afternoon session. In\neither case, I do not anticipate that his oral testimony will be more\nthan about 10 minutes.\nBecause of the nature of frenetic activity surrounding such hearings,\nI consider it imperative that such arrangements be completely\nclarified in advance and so transmitted to Nick Zapple. Since you\nare the coordinator for all of NAEB regarding this hearing, this\ntask is yours to perform. Under no circumstances do I believe it\neither right or proper to leave such a schedule change either to\nthe last minute or to chance. It is precisely through such loose\nworking arrangements, that we have gotten into precedural dif¬\nficulties in the past within our own organization.\nI would also appreciate your making the necessary corrections re¬\ngarding spelling and order of witnesses as follows;\na. Robert Lewis Shayon .*. not Louis (to be scheduled\nbetween NET and ETS on Thursday, April 13)\nb. On Friday, April 14 under NERs\n1* Jerrold Sandler ... not Jerry\n2. Willard Shadel should be listed third, not last\n3. Leslie Paffrath not Lesley, President, The\nJohnson Foundation\n4. Dr. Frank M. Woolsey, Jr., M.D. ... title should\nbe Associate Deem of the Albany State Medical College,\nnot President\n5. Dr. Fred Harrington should be listed as President,\nUniversity of Wisconsin, an NAEB Public Director, and\nHead of the oldest educational service in the United\nStates."
}