{
  "id": "d968-136",
  "text": "Newsletter\nApril 3, 1967\nUND News-4\nU Studies Role Of Educational Radio, TV (continued)\nCurry indicated that the study, which will survey the relationship between educational\nradio and television and how they can best serve the public at large, will provide a\nsound basis for determining the most appropriate roles for educational radio in the\ncontext of public education.\nThe grant could also provide guidelines for educational stations in utilizing\nprovisions of a bill which is currently before the U.S. Senate Committee on Commerce,\nunder the chairmanship of Sen. Warren G< Magnuson (D-Wash„). Hearings will be held by\nthe communications subcommittee of the Committee on Commerce beginning April 11. The\nbill is Senate Bill 1160, the proposed Public Television Act of 1967, to broaden and\nexpand educational television and radio services and facilities. The bill would\nimprove the program of grants for construction of non-commercial broadcasting facilities,\nauthorize a study of instructional television and its relations to educational tele¬\nvision and establish and finance a non-profit corporation to assist educational tele¬\nvision and radio program operations.\nThe bill marks the first time the Federal government, in a piece of legisla¬\ntion, has recognized the existence of educational radio and has suggested its incor¬\nporation into the various items of legislation. The present proposal calls for a\n\"Corporation for Public Television.\" It would have a 15-member board of directors\nappointed by the United States President with the advice and consent of the Senate.\nIt has been suggested that the corporation be named \"Corporation for Public Broadcasting\"\nto conform more precisely with the inclusion of radio in the 1967 proposed bill.\nUND President George W. Starcher stressed the potential benefits which the\nbill could provide to educational radio and television in North Dakota and to the\nnation. \"Both media have clearly demonstrated their capabilities as educational and\nresources,\" President Starcher commented. They have lacked significant\nsupport because of more immediate, pressing educational needs. If they now receive\nthe necessary support, they can assist in satisfying some of these needs and possibly\ncan aid in retarding the distressing flow of young people from rural to urban areas,\nand the exodus of people from our state.\"\nCurry, who is a member of the board of directors for National Education Radio,\nrecently visited with various legislators and their assistants in Washington, D.C.,\nconcerning the bill. \"They were eager to hear from interested constituents about the\nbill and I strongly urge every citizen to write to legislators in support of it,\" he said.\nResults of the study undertaken with the Ford grant will be a step toward\ndetermining needs and status of educational radio and TV and passage of the bill would\nassure continued progress in those directions, Curry commented. The study will cover\nvirtually every aspect of the educational broadcasting field, including financing,\norganization and administration, program policy, technical capabilities, instructional\nand other specialized uses, the range and scope of broad community services, audience\nresearch and long-range planning.\nSpecial consultant for the National Educational Radio (NER) research is\nHerman W. Land Associates, Inc., of Nov York City, a communications consultant firm.\nThey are aiding in the development of the overall research design and analysis and will\nprepare a comprehensive report for NER. The survey is slated for completion by April 30.\nKFJM was established at UND in 1923 and now serves an area which includes the eastern\nthird of North Dakota and some 12 counties in Minnesota.\n-UND-\nU COLLEGE OF ARTS, SCIENCES NAMES 371 TO DEAN'S LIST"
}