{
  "id": "d968-35",
  "text": "Smithsonian Tropical Research Institute\nP. 0. Box 2072\nBalboa, Canal Zone\nMarch 17, 196?\nKonorabl ■? Quentin N.' Burdick\nUnited States Senate\nWashington, B* C.\nDear Senator Burdicks\nAs one of your constituents, I wish to notify you of my interest\n3.n a legislative proposal. I so a resident of Grand Forks where I an\nity\n1 ^presently on sabbatical leave doing research &t the Smithsonian\nTropical Research institute*\n^he legislation that I air interested in is the proposal to extend\nvhe^Rducational Television Facilities Act of 1963 to include educational\nradio. ^As an educator, I know the value of radio as veil as television\nc ;\ntiro elementary school students, I have learned to appreciate her\neffective educational radio programs can be in the public school\ncurriculum* As a citison in cur complex modern society, I enjoy the\nstimulation provocative discussions carried by eclucational*\"radio*\nresidents of eastern North Dakota are fortunate in having an\nexcellent educational radio station. KF«M, the University of North\nDakota broadcasting station, was the second radio station to be estab¬\nlished i; ijoi'ta Dakota. For i-iany years it was 'the only educational\nradio eta non in the state*% From its studies in Grand Forks is beafdd\na carefully selected program of lectures, discussions, news and music*\nfdi State of North Dakota, through the University budget, has provided\nvery reaper support for this station. Its equipments antiquated,\nand it must operate with a number, of volunteer worker:;. It operates\nonly during the daytime but should be extended into the evening as Veil*\nAdditional financing is needed* It seems to me that it would be much\nless expensive to expand KFJM than it would to finance a new educational\n.radio station.\nIhe need for educational radio and television in remote and sparsely\nseeded regions such as North Dakota is greater than that of urban areas,\n5.n my estimation* Because the citizens of North Dakota, through their\nelec ted S ‘-ate Legislators, have failed to adequately finance this very\nessential sendee, it is necessary to seek federal aid. BierofSre, i\nurge you to support this prooosed legislation and to ensure that North\nDakota receives a generaus allocation of funds*\nSincerely yours.\nPaul 3* Kannoyski"
}