{
  "id": "d968-71",
  "text": "NATIONAL CONGRESS OF PARENTS AND TEACHERS\n700 North Rush Street, Chicago, Illinois 60611\nSTATEMENT IN SUPPORT OF S.ll60, THE PUBLIC TELEVISION ACT OF 1967\nPresented to the Senate Committee on Commerce\nBy Mrs. Edward F. Ryan, Chairman, National PTA Committee on Legislation\nApril 28, 1967\nMr. Chairman and Members of the Committee;\nWe appreciate very much this opportunity to represent to you the very deep con¬\ncern of National PTA for the improvement of noncommercial educational radio and\ntelevision. I am Mrs. Edward F. Ryan, of Manchester, Massachusetts, chairman\nfor legislation of the National Congress of Parents and Teachers, whose member¬\nship numbers more than eleven million.\nOur concern for improving the quality of television fare and for bringing edu¬\ncational television to all people of the United States is probably one of the\nmost widespread among our membership of all our interests in behalf of families\nand children. Twice in the last three years our national conventions have\nadopted resolutions calling upon mass media agencies to raise their own stan¬\ndards of ethics, morals, and program quality. For nearly eight years we have\nfurnished members and other subscribers with evaluations of current television\nprograms as to suitability for children, youth, and families. Third, we have\ndeveloped and widely publicized criteria for evaluating television and other\nprograms. These measures have helped numerous families with their own children,\nbut in all candor their effect on commercial programing has not been visible.\nWe have looked to noncommercial television as a more responsive and fruitful\nsource of programs based on acceptable values. Our state branches have given\nmuch assistance to the establishment of local and regional noncommercial edu¬\ncational television stations, sometimes in supporting necessary legislation,\nsometimes in arousing general public support. Additionally, large numbers of\nlocal PTA's have given necessary assistance to school systems in taking advan¬\ntage of available instructional television, sometimes in furnishing equipment\nfor demonstration projects and thereafter in developing public support.\nThe concept of television as an educational instrument has been strong, and it\nis well known to this committee, I am sure, that the reality has fallen short\nof past and present hopes. The reason, we believe, has been the insufficiency\nof time and talent dedicated to the planning and preparation of programs. Best\nknown and probably most successful of noncommercial television programing have\nbeen documentaries, live coverage of current events, and cultural events such\nas symphonies, ballets, and plays, although even these are by no means given\nthe framework they would command in a commercial production or the technical\nadvantages their value warrants. In another area, the dramatic presentation\nof important and challenging ideas, we have seen a particular promise in edu¬\ncational television, and there have been just enough outstanding programs in\ntelevision's history to enliven our hopes.\nIt seems to us that there are many important ideas and issues which warrant\npresentation of this caliber, and there is no substitute for professional time"
}