{
  "id": "d968-76",
  "text": "'2\n—Our society should not he a society of education but a society of educated\nmen.\n--Radio is distinctive for the transmission of news and its interpretation.\n--Radio must restore a free marketplace of thought that will serve specialized\nneeds of the local community.\n--Radio is one of the chief media to he used in the offering of college-level\neducation to our citizens.\n--The cheapness of radio and its differential range of services make it valu¬\nable as an educational medium.\nWilliam G. Harley, president since i960 of the National Association of Educa¬\ntional Broadcasters, and Robert Lewis Shayon, veteran radio and television pro¬\nducer and writer as well as radio-TV critic for the Saturday Review, gave stimu¬\nlating talks, after which participants went to work in one of four groups to\nidentify and define the role of educational radio and to pinpoint the most ap¬\npropriate ways for educational radio to fulfill its role effectively in our\nsociety.\nAfter three three-hour work sessions of study in depth, it was decided that\neducational radio should, indeed, he treated as a national resource, and that\nevery effort should he utilized to assist educational radio broadcasting to\nreach significant national service goals and capacities.\nSome of the recommendations for reaching these goals and capacities included\nthe following:\n1. There should be new explorations of educational radio's role in the curric¬\nulum at all educational levels.\n2. New conversations with agencies of government, including those committed\nto serving the needs of minorities and subcultures, should he activated.\n3. Exploratory meetings with community officials and representatives empha¬\nsizing the values and needs of educational broadcasting should he held.\n4. Educational radio stations must reexamine their standards of service and\noperation.\n5. Community needs ought to he the subject of appropriate regional and local\nconferences to enable broadcasters to meet with citizens who could be re¬\nsponsible for defining and serving community needs.\n6. MDst important is the need for the establishment of a national institute\nof radio, which would set goals, make policies, examine trends, and recom¬\nmend decisions, which would then be subjected to implementation and evalu¬\nation in the community.\n7. Erom the institute of radio, made up of the best radio broadcasting minds\nof the nation, should emerge an advisory commission that could determine\nthe future needs of educational radio."
}