{
  "id": "d968-81",
  "text": "Steel Products Company\nBusiness Established 1901\nEquipment for Farm, Ranch and Industry\n415-421 South Spring P. 0. Box 443\nINDEPENDENCE, MISSOURI\n64051\nApril 3, 196?\nSubject:\nSenate Bill 1160\n\"Public Television Act of 1967”\nThe honorable William J. Banda11\nRepresentative, Uth District Missouri\nHouse of Representatives Office Building\nWashington, D. C.\nDear Congressman Randall*\nThe provisions of S.1160 are so significant for radio educational bread¬\ncasting generally and in the metropolitan area of Kansas City, that I\nwrite in behalf of this Bill. Hitherto, television has fared well in\npublic support, but public support of radio has been neglected.\nI hope the title itself can be amended to read nPublic Broadcasting Act\nof 1967% for the reason that the text of the Bill, as it should, applies\nto both radio and television.\nEducational radio here has mde extensive contributions to our cultural\nlife. And this without having had a strong base of financial support.\nThe stations concerned are a® follows* Kansas University, Lawrence,\n100,000 Watte, FM, TP? University of Missouri in Kansas City, 20,000\nWatts, FMf Nasarene Theological Seminary, Kansas Dlty, 10 Watts, FMj\nCentral Sto. State College, Warrensburg, 10 Watte, FK.\nThe University of Missouri at Columbia, I understand is applying for an\neducational band, but is now confined to a comn»roial TV station.\nThe programs of the above stations are not available from any other source.\nThey are vital to the educational work of the institutions with which they\nare connected. They include lectures on various subjects, addresses, course\nwork for enrolled or extension students j music, both classical and modern,\nas well as other matters, and reach a wide public.\nFor your information I enclose the March 19, 196? supplement to the Kansas\nCity Star. This is entitled \"The Kansas City Star V* Scene\" (an amendment\nthere is in order, to©}, lour attention is called to pages 1*H, 5H, and 6ff,\nwhere articles appear respecting educational radio locally and in Missouri.\nThey are fey Joyce agner, and I think you will find them interesting and in¬\nformative.\nIn my experience I find educational radio performing a useful public function.\nCurry\nArea Code 816\nCLifton 2-2406\nROLLTOP STOCK TANKS\nMETAL BASKETS\nGRAIN BINS\nINDUSTRIAL PRODUCTS"
}