{
  "id": "d968-83",
  "text": "April 3, 1967\nsubject*\nMMtm Bill ULO\n\"Public Television Act of 1967”\n\"he Honorable Mward V. long\nUnited States Jena tor\nenate Office Building\nWashington, 0* C.\nDear Senator Leapt\nThe provisions of J.1160 are so significant for radio educational broad¬\ncasting generally, and in the metropolitan area ef Kansas City, that I\nwrite in behalf ef this Bill. Hitherto, television has fared well in\npublic support, but public support of radio has been neglected.\nI hope the title itself can be amended to read \"Public Broadcasting Act\nof 196?% for the reason that the text of the Bill, as it should, applies\nto both radio and television.\nEducational radio here has made extensive contributions to our cultural\nlife. And this without having had a strong base of financial support.\nThe stations concerned are as follows: Kansas University, Lawrence,\n100,000 Watt®, FH, T¥j University of Missouri in Kansas City, 20,000\nWatts, FMj azarene Theological ewinary, Kansas City, 10 Watts, FMj\nCentral -Jo. atate College, /arrensburg, 10 Watts, F!f.\nThe diversity of Missouri at Columbia, I understand is applying for an\neducational band, but is now confined to a comr»rcial Tt station.\nThe programs of the above stations are not available from any other scarce.\nThey are vital to the educational w<rk of the institutions with which they\nare connected. They include lectures on various subjects, addresses, course\nwork for enrolled or extension® student®| music, both classical and modem,\nas well as other matter®, and reach a wide public.\nfor your information I enclose ti e March 19, 1967 supplement to the Kansas\nCity tar. This is entitled \"The Kansas City Star f¥ Beene” (an amendment\nthere is in order, too). lour attention is called to pages i*H, SB and 6H,\nwhere articles appear respecting educational radio locally and in Missouri*\nThey am by Joyce Wagner, and I think you will find them interesting and in¬\nformative.\nIn i»y experience I find educational radio performing a useful public function."
}