{
  "id": "d1327-2",
  "text": "NAEB NEWS LETTER ... March 15, 1941 . Page 3\na blue print and directions for erecting one of these antennas,\nand suggest that the station construct one and try it out. If\nit is found that our station can be received with quality and\nreliability suitable for rebroadcasting, we will supply the\nnecessary author!zation. We are enclosing a copy of our antenna\nblueprint and instructions for your information/\n“We furnish,the rebroadcast station with advance copies of our\nprogram schedules, and in order to protect us in our exclusive\ncontracts with the networks and news agencies, we require sub¬\nmission to us of a monthly report of the programs rebroadcast.\n“If any of the stations represented by your association wish\npermission to rebroadcast WLWO*s programs, we will be glad to\nconsider their application*\"\nF. P-, Nelson, WBOS, Boston, Mass*, writes:\n“Westinghouse International Radio Station WBOS is operating at\npresent on a seven-hour per day schedule, seven days per week,\nfrom 4:00 P.M. to 11:00 P.M. , Eastern Standard Time* These\nprograms are all beamed on Latin America and consist of three\nhours in Spanish, two hours in Portugese and two hours in\nEnglish.\n“All programs broadcast over this station are designed for\nlisteners outside of the United States and, since the majority\nof the programs are in languages other than English, I question\ntheir suitability for your purpose*”\nWAKEFIELD NAMED TO FCC POST\nRay G. Wakefield of Fresno, Calif., has been named to fill the\npost on the FCC formerly held by the late Thad Brown. The\nNomination of President Roosevelt has been confirmed by the\nUo So Senate. The appointment was for the unexpired term of\nseven years dating from July 1. Wakefield, 45, is a Republican.\nIn Washington circles he is considered a “liberal.” That gives\nthe “liberals” a majority on the present Commission set-up.\n“BOOKS AND THE NEWS”\nThe last News Letter reported release of a series of transcribed\nprograms on \"Books and the News” by the Library of Congress.\nThese transcriptions are available free to rradio stations and\neducational groups requesting, them for broadcasting purposes,\nArchibald MacLeish, Librarian of Congress, has announced.\nCharles T. Harrell, Program Editor, Radio Research Project, of\nthe Library of Congress, writes further that “We shall keep the\nNational Association of Educational Broadcasters informed of our\nactivities from time to time.”"
}