{
  "id": "d1327-4",
  "text": "NAJSB NEWS LETTER ... March 15, 1941 . Page 5\n”5. In cooperation with the statewide WTA Recreation Project we\nare planning to broadcast a series of thirty minute programs\neach week on Saturday over coast to coast Mutual starting in\nJune to be called ’’From the Kentucky Mountains” and to feature\nthe worthwhile resources of this part of Kentucky including\ndramatizations of stories by her authors such as James Still\nand Jesse Stuart and broadcasts of her ballads with the idea\nof playing down those too publicized elements of the Kentucky\nmountains such as feuds, moonshining, shootings, child marriages,\nand snake revivals,”\nPURDUE (WBAA) IN NEW QUARTERS\nGilbert Williams, WBAA, Purdue University, writes:\n’’Got your bill and accompanying note. Biggest news of the moment\nis that we’ve finally moved, locl£, stock, and barrel of our studio\nequipment to Purdue’s Hall of Music, The big move took place\nFebruary 10th, ...... finally I It surely is swell to have ample\nelbow room, what with four studios instead of the previous one\nin the Electrical Engineering bldg. If you remember the blue\nprint I sent you some time ago, one of the studios is an audience\nstudio capable of seating small audiences up to 60 or 75, complete\nwith stage, etc., etc. Well, since moving over here, we have\nannexed another audience studio, just across the hall, sound\nconditioned, completely wired, etc,, and capable of seating an\naudience of 250 to 275, besides the show. Until such time\nas new transmitting equipment is finished (probably not until\nfall) for full time and increased power, our transmitter is\nstill located in the E. E. bldg. , with antenna toivers still\natop said building.\nYou probably knew that Fred Conger left for a semester’s study\nat the University of Iowa, to complete his master’s. He’ll\nbe back in. June.\nYour first paragraph in Feb. 1st Newsletter talks about NAEB\nconvention. You didn’t list Purdue and WBAA as a suggested\nsite, .and you’ll remember Conger brought it up at last\nSeptember* s convention, and he said they all seemed very\ninterested, but official action would have to wait until the\nOhio Institute, I want to reiterate the invitation, even\nthough as a native of Wisconsin I know and appreciate the\nDells 11 June in the Dells is before everybody and his brother\nmakes the Dells pretty unbearable with raucous commercialism,\nACTIVITIES OF THE CHICAGO RADIO COUNCIL\nHarold Kent, Director of the Chicago Radio Council, sends along\na script for ”A Radio Assembly for an Elementary School.” Says\nHarold: ”We have started the preparation of a series of 9Assembly\nScripts* which are being sent to each of the schools with the\nthought that they will be used for assembly work, using a radio\ntechnique vut not for purposes of broadcasting. As you well"
}