{
  "id": "d1236-2",
  "text": "-3-\nWhen these committees will take up the REW requests, no one can tell—or\nwhether they will be considered together, or separately, and if so, in what order.\nThis is at the discretion of the committees. However, it is quite likely that hearings\nwill begin in mid-February.\nAccordingly, now is the time for direct purposive action by those interested in\nhaving these funds become a reality. It is imperative that the supplemental request\ngoes through so that no more time is wasted and the Federal ETV program can be\nlaunched in 19 63. This will enable the HEW officials in charge to get going official¬\nly—to start staffing, to print and distribute the regulations and application forms,\nand to invite submissions for grants. In turn, this will galvanize the states into\naction and stimulate real: momentum for the bigger push in ’64.\nFailure to launch in '63 would not only be a serious psychological set-back to\nthe whole movement, but would result in serious loss of matching funds, appropriated\nby several states in expectation of Federal action, but due to expire by July 1st unless\nthe program is initiated before then.\nIf the Congress does act favorably on these budget requests, it will largely be\nbecause people around the country recognized these political truths and acted\naccordingly;\n1. It is important that all members of both the House and the Senate be informed\nof plans for ETV development in their states and realize the stake their particular\nconstituency has in the provision of Federal assistance.\na . All votes count.\nb. Each member has some influence in party caucuses.\nc. Some members—and one never knows which ones, necessarily—have con¬\nsiderable influence with certain members of the relevant committees which will make\nthe recommendations to the Congress.\n2 . ETV should not, and must not, become a political issue or cause for partisan\nside-taking. It is important to have bi-partisan support, so that whenever it comes\nup at caucuses it receives a favorable response.\n3. There is no substitute for talking in person with one’s Congressman—in Wash¬\nington or when he visits back home. The next best thing, however, is a persuasive\npersonal letter.\n4. Anyone who wants to have this Federal aid to ETV come into being can play an\neffective role in the outcome. Nobody with a stake in ETV broadcasting can assuage\nhis conscience by saying he has no personal responsibility for the outcome; every\ncitizen has a right and obligation to convey his views to his representatives on\nmatters he believes to be for the public good."
}