{
  "id": "d1609-1",
  "text": "NAE8 NEWS LETTER\nPage 2\nJune I, 1943\ndiscs. While prepared primarily for sale in connection with commercials\nON COMMERCIAL STATIONS, THE SERIES MAY BE USEFUL TO NAEB STATIONS, TOO.\nDiscs were made for sponsorship so that a governmental agency voijldn’t have\nTO ASK FOR MORE TIME FROM STATIONS, BUT UPON INQUIRY OF NA£B EXECUTIVE\nSecretary, *,r. Gray explained the programs would be made available to NAEB.\nPEABODY AWARDS COh>?-.: 1 TTEES\nTo aid the George Foster Peabody Radio Awards Board in its an ual selections,\nLISTENING POST COMMITTEES ARE BEING SET UP IN INSTITUTIONS OF HIGHER LEARN¬\nING throughout the United States, according to Dean John E„ Drewry, Henry\nW. Grady School of Journalism, the University of Geofgia, which, with the\nNational Association of Broaocastefs administers these ’’Pulitzer prizes\nof the air.”\nInstitutions that have already set up such committees, which will function\nthrough the office of the dean of the Grady School, are the state universi¬\nties of California, Colorado, Georgia, Idaho, Illinois, Iowa, Kentucky,\nLouisiana, Minnesota, New JErSEY (Rutgers), Montana, North Carolina, North\nDakota, Ohio, Pennsylvania, South Carolina, South Dakota, Washington, West\nVirginia, and Wisconsin.\nThe George Foster Peabody Radio Awards ate designed to give educational\nRECOGNITION AND ENCOURAGEMENT TO THE BROADCASTING INDUSTRY, AND TO PERPETU¬\nATE THE MEMORY OF THE BENEFACTOR AND LIFE TRUSTEE OF THE UNIVERSITY OF\nCeORGIA.\nThe personnel of the Committees include: The University of Illinois:\nF. So S|EBERT, DIRECTOR OF THE SCHOOL OF JOURNALISM, CHAIRMAN; FRANK E.\nSCHOOLEY, INSTRUCTOR &N JOURNALISM AND PROGRAM DIRECTOR OF RADIO STATION\nWILL; Lanson F. De iming, Director of ^usic for Radio Station WILL; George\nJennings, acting director, Radio Council, Board of Education, Chicago; and\nAlbert Crews, director Radio Department, School of Speech, Northwestern\nUniversity, Evanston.\nThe State University of Iowa: Wilbur L0 Schramm, director of the School of\nJournalism, chairman; Charles L. Sanders, assistant professor of journalism;\nH. Clay Harshbarger, associate professor of speech; Mrs. Pearl Bennet\nBroxam, program director of Station WSUIj Carl H. Menzer, Director of\nStation WSUI and associate professor of electrical engineering.\nThe Univetsity of Kentucky: Leonaro Niel Plummer, Hrad of the Department\nof Journalism and director of student publications, chairman; Maurice Fe\nSeay, Bureau of School Service and head, Department of Educational\nAdministration, College of Education; and Elmer G0 Sulzer, director of\npublic relations.\nThe University of Minnesota: Dr. Ralph Dc Casey, director of the School of\nJoutnalism, chairman; Mitchell Vc Charnley, professor of Journalism-Burton\nPaulu, manager of University Radio Station WLB; and Tracy F. Tyler, College\nof Education.\nThe University of North Dakota: Arnold F. Cecka, head, Department of\nJournalism, chairman; John S. Penn, assistant professor of public speaking;\nDonald J. Robertson, assistant to the president, English faculty; Richard"
}