{
  "id": "d1609-2",
  "text": ". naeb news letter\nPage 3\nJune 1, 1943\n0. Hale, assistant professor of English; Fred J* O'Neil, journalism, faculty\nAND NIGHT EDITOR, GRAND FORKS HeRALDJ AND Dr. RlCHARD BeCK, PROFESSOR OF\nScandinavian languages*\nOhio ^tate University: James E* Pollard, director of the School of\nJournalism, chairman; Or* Edgar Dale, Bureau of Educational Research;\nC. Wilbert Pettegrew, program director, Radio Station W05U, the campus\nstation; N. N* Luxon, Journalism department; and R* C0 Higgy, director of\nTHE CAMPUS RADIO STATION, WOSU.\nThe University of South Oakota; E* G. Trotzig, head of the Department of\nJournalism, chairman; Hale Aarnes, acting he-d of the Department of Speech,\nand director of KUSD, University radio station; G. Russell Bauer, Director\nof Information Service, assistant professor of journalism, and Dr* George\nLawrence Abernathy, head, Department of Philosophy and Psychology*\nThe University of Wisconsin: Grant k»* Hyde, director of School of Journ¬\nalism, chairman; Henry L* Ewbank, professor of speech; Edward B* Dean,\nLECTURER IN JOURNALISM, AND WfLLIAM G* HAfLEY, PROGRAM SUPERVISOR OF THE\nUniversity of Wisconsin Station WHA.\nNAEB UE/.BERS WIN OHIO AWARDS\nAwards and citations for the Seven American Exhibition of Educational Radio\nPrograms, given in connection with the Ohio State Institute for Education\nby Radio, include some for NAEB members* The first cultural award for a\nseries went to \"Civilians in Service,” on WHA* Several awards and honorable\nMENTIONS WENT TO WHA FOR A SERIES, \"LeT*S F 8 ND OUT1’ AND TO WCSU FOR THE\nSERIES TITLED, \"PLAY T|ME.” HONORABLE MENTION WENT TO WNYC FOR A SERIES\nENTITLED “THE CoRWIN CYCLE.\"\nWNAD PRQGRA-S TO HELP REMEDY TEACHER SHORTAGE\nAid for Oklahoma teachers preparing for impending state examinations will\nBE BROADCAST BY THE STATE'S EDUCATIONAL STATION WNAD INTWO 30-MINUTE PRO¬\nGRAMS TO BE CARRIED DAILY THROUGHOUT JUNE*\nThe PROGRAMS, WHICH WILL COVER VARIOUS SUBJECTS INCLUDEDON THE STATE\nEXAMINATIONS, ARE THE UNIVERSITY OF OKLAHOMA8 S CONTRIBUTION THROUGH WNAD\nTO HELP REMEDY THE WIDESPREAD TEACHER SHORTAGE* VIRGINIA HaWK, STATION\nDIRECTOR, SAID* THIS WILL BE THE FIRST TIME DIRECT AID HAS EVER BEEN GIVEN\nBY ANY COLLEGE STATION TO STATE TEACHERS, MI$S HAWK SAID.\nCo-operating in the broadcasts is the State Department of Education*\nDepartment officials have placeo the current teacher shortage at approximate¬\nly ONE-THIRD*\nBecause of the terrific loss of teachers to the armed forces and war\nINDUSTRIES, WAR EMERGENCY TEACHING CERTIFICATES WILL BE GRANTED TO HIGH\nSCHOOL GRADUATES, HAVING LESS THAN 40 SEMESTER HOURS OF COLLEGE WORK, WHO\nHAVE PASSED STATE EXAMINATIONS*\nWNYC BROADCAST FULL ”\\ AM AN AMERICAN PAY\" PROGRAM\nnew York C,Ty’s municipal radio station, V>NYC, broadcast the complete"
}