{
  "id": "d1535-7",
  "text": "in” was evident in 15 seconds. Visual Electronics\nmanufactures this equipment which sells for $2400,\nIt is impossible to mention all the equipment\nshown and manufacturers represented. They ranged\nfrom 10 watt TV translators to a new 50 kw GE AM\ntransmitter with only 16 tubes, and included every¬\nthing from antennas and audio equipment to micro-\nwave equipment, rear screen projectors, test equip¬\nment and' a new monochrome AGC video amplifier.\n* * * *\nMore details on Videotape operation will be\nfound in the April 1, 1957, issue of Broadcasting-Tele¬\ncasting, “VTR—Out of the Lab, onto the Firing\nLine.” More details on the NARTB Convention are\nin the April 15, 1957 issue of the same publication.\nA great deal of interest has been aroused by\npapers presented at the recent IRE Convention in\nNew York and the NARTB Broadcast Engineering\nConference in Chicago, which covered TV test signals\ntransmitted during the vertical blanking interval of\nthe TV signal. These signals have been transmitted\non an experimental basis by the networks.\nThe FCC on April 4, 1957, authorized all stations\nto transmit these signals without further specific\nauthority as long as they do not interfere with syn¬\nchronization, nor degrade the quality of the picture.\nCopies of this notice are being sent to all ETV op¬\nerating stations through the cooperation of Cy Braum\nof JCET.\n* * * *\nDr. George R. Town, executive director of the TV\nAllocations Study Organization, expressed hope at\nthe NARTB convention that a major portion of the\nwork of his organization will be completed within\na year. TASO consists of 5 basic panels now at work,\nwith 131 engineers from 67 organizations serving as\nmembers, alternates or observers.\nOne of the basic and immediate needs of the FCC\nis comprehensive and accurate engineering informa¬\ntion on which to base TV allocations decisions. Panel\n4, of which I am a member is at work in an attempt\nto secure new propagation data. The second meet¬\ning of this panel was held in Washington on April\n17, and preliminary reports of the Committee 4.1 on\nMeasurement of Service Fields and Committee 4.4\non New Factors were presented and discussed.\nWhile many educational institutions are repre¬\nsented on TASO panels, only Robert C. Higgy of\nWOSU-AM-FM-TV represents an operating TV\nstation. It would be desirable to have more repre¬\nsentation from ETV stations. If some of our chief\nengineers could serve as panel members, alternates\nor observers, I would appreciate hearing from you.\nAs a matter of information, TASO is sponsored\nby the Assn, of Maximum Service Telecasters, the\nCommittee for Competitive TV, the JCET, the\nNARTB, and the Radio-Electronics-TV Mfrs. Assn.\nThe 5 sponsoring organizations underwrite the ad¬\nministrative expenses of TASO, while the companies\nfor which individual panel members work pay the\nexpenses of operating the panels.\nPLACEMENT SUPPLEMENT\nMay I - A graduate of Yale University (B.A. English), the\nFletcher School of Law and Diplomacy (M.A. International\nRelations), and the University of Paris (certificate), de¬\nsires position as writer or public relations officer in the\nETV field. He has written scholastically and as an historian\nwith the U.S. Army. Male, 25, married. Location open,\n$3500-5000.\nMay 2 - Male, married, 35, M.A. and 2 years of study beyond,\ndesires writer or producer-writer position in TV with addi¬\ntional teaching duties preferred. 8 years college teaching\n(composition, literature, speech, writing) and 5 years\nbroadcasting—including I year commercial. Has pub¬\nlished in professional and popular magazines. Currently\nassistant professor in large university^ Location open.\n$5500.\nMay 3 - Female, 27, single, B.A. and I year toward M.S.,\ndesires position in radio-TV programming, production, or\npublic relations. Has 2 years experience combined se¬\ncondary teaching and producing ETV features for school\nover commercial outlets. I year commercial TV writing,\nprogramming and air experience; I year university teach¬\ning. Location open. $4-5000.\nMay 4 - U.S. State Department officer, 27, married, A-B. and\n5 years experience in international affairs, desires public\nrelations or producing position in educational broadcasting.\nHas had diplomatic service in Korea, some teaching and\nmanagerial experience. Prefers Northeastern, Northcentral\nor Mid-Atlantic areas. $5000.\nThe ETRC again will make individual awards of\nfrom $500 to $5,000 each to help qualified research\ngroups in studying uses for education during 1957-58.\nLast year the Center awarded grants totalling $35,000\nin partial support of 10 research projects.\n—N A E B—\nMartha Gable, Director of Radio-TV for the Board\nof Education, Philadelphia, was chairman of a panel\non public relations problems in schools and colleges\nat the APR A National Convention the last part of\nApril.\n—N A E B—\nWell, they’ve done it! The English have developed\na flat TV tube, only 4 inches deep and 20 inches\ndiagonally across—comparable to a 14-15 inch tube\nin the U. S. Dr. Gabor, of Imperial College, London\nUniversity, described his invention (the tube is\nknown as the “Gabor-NRDC”) in the March-April\nissue of the European Broadcastion Union Bulletin.\n—N A E B—\nPrograms from 3 NET series have been selected as\namong the outstanding films of the year by the Film\nCouncil of America. They were screened in competi¬\ntion at the Council’s Golden Reel Film festival April\n22-26 in New York.\nNEWSLETTER"
}