{
  "id": "d1535-8",
  "text": "-*2-\nEEDSRAL COUiOTICATIOHS CQMMISSIOU\nNovember 15, 1947\nm. IS --APPLI CAT I OHS—ACTIONS\nDecember 15, 1947\nK-A-E-B TO BE REPRESENTED IN CLEAR CHANNEL ORAL ARGUMENT\nMarcus Cohn of the legal firm of Cohn & Marks, who officially represented\nthe national Association of Educational Broadcasters in the final week of\ntestimony during the Clear Channel Hearings will \"be official spokesman during\nthe period of oral argument noted above.\nThe following N-A-E-B member stations were represented in the basic testi¬\nmony and will be urgently concerned with the outcome of theforthcoming oral\nargument;\nUNYC, City of Hew York UECU, Cornell University\nTrOI, Iowa State College WAD, University of Oklahoma\nKOAG-, Oklahoma A, & U. College IOJOM, University of Minnesota\nUCAL, St. Olaf College UKAR, Michigan State College\nTfOSU, Ohio State University\nAMPLITUDE MODULATION APPL ICATI PITS\n850 ICC - Application Power Increase\nUNYC- City of New York, Municipal Broadcasting System, Hew York, N.Y. -\nApplication for increase in power from 1 ICU to 1 ICU, 5 ICU LS and make changes\nin directional antenna system*\n850 HC - Request SSA\nWNYC- City of Hew York, Municipal Broadcasting System, ITew York, N.Y. -\nRequest for SSA to operate with 85D kc» power of 1 ICt'7, hours from 6;00 a.m, to\n10:00 p.m., E.S.T., with directional antenna from Sundown, Minneapolis, Minn., ,\nto sign-off time. Period of time, six months from March 2, 1948, or until\nsuch time as a final determination has been made in the clear channel hearing.\n900 EC - Hew Station\nHE\\I - Northwestern Theological Seminary and Bible Training School,\nMinneapolis, Minn. - Construction permit for a new standard broadcast station\nto be operated on 900 kc. power of 1 ICUf and daytime hours of operation.\nAmended re officers.\n550 EC - Power Increase\nKOAC - Oregon State Agricultural College, Corvallis, Ore. - License to\ncover construction permit (35-ML~1228, as modified) which authorized to increase\npo^er, make changes in directional antenna pattern and authority to determine\noperating power 'by direct measurement of antenna power."
}