{
  "id": "d405-49",
  "text": "TO:\nNAE3 Members\nFROM: In-School Program Committee\nSUBJECT: Suggestions for stations submitting programs to In-School Program\nCommittee\nExperience in the use of In-School Programs indicates that:\n1 - Programs should be for l$-minute segments (lU* 30\")\n2 - Timely references should be omitted: e*g* \"good morning,\" \"listen again\nnext Tuesday,\" \"to be presented next semester,\" !iwe will be back next\nweek,” etc*\n3 - Programs should be free of:\na. local place references\nb» references to any ?uOcal curriculum, study plans, etc*\nc* requests for write-ins\nU - Programs should not be submitted for network use if they are:\na* too closely related to specific local institutions, agencies, organi¬\nzations, etc* (rural or urban)\nb. too dependent upon seasonal characteristics common only to a regional\narea\nc. geared to a particular local time observance (non-annual), e.g* centennia.\nanniversaries„ These programs cannot be used a year later*\n5> - Care should be taken to be sure that program manual or handbook is adaptable\nto general use and that it can be duplicated.\nNOTE: During the past two years stations subscribing to the in-school program\nservice have indicated a decided preference for programs at the elementary\nlevelo\nThe shipment of your tapes to NAEB is important:\n1 - Mark all submissions \"Audition\" and \"Do Not Erase\n2 - Ship tapes in a separate package from other tapes being returned to Head¬\nquarters *\n3 - It is all right to take tapes from your weekly shipment from NAEB and, after\nplaying, erase and use to submit auditions or masters for the new series\nyou are contributing to NAEE Network* If you do this, please indicate\nby a letter so you can be given credit for the return of the number of\ntapes sent to you.\nU - Mark your address label:\nAudition - In-School Programs\nNAE3 Network\nlU Gregory Hall\nUrbana, Illinois\n5> - For your own protection, it is best not to send your original tapes* Keep\na safety copyj"
}