{
  "id": "d405-72",
  "text": "REPORT OF THE 1955 NAEB RADIO NETWORK COMMITTEE\nOctober 1, 1955\nIn December, 195U, President Schooley joined the Acceptance Subcommittee and the\nProgram Planning Subcommittee into the Radio Network Committee* The Acceptance Sub¬\ncommittee consisted of Jack Westbrook WUOT (who resigned in July, 1955) replaced by\nJohn Regnell of Illinois, Hugh Mix of WNAD, and Edward Slack of KUSD. The Planning\nSubcommittee consisted of Kenneth Wright (WUOT), Bernard Buck (WNYC) and Lee Eitzen\n(WSUI).\nACCEPTANCE SUBCOMMITTEE\nThe new Acceptance Subcommittee, as reported by Chairman John Regnell, took over\nwith a back log of eleven series which had not been voted upon* Since then forty-\nnine series and single shot programs have been referred to the committee making a\ntotal of 60 programs and series. Of these thirty-one have been approved for distri¬\nbution, fifteen have not received approval, and as of October 7th fourteen have not\nbeen voted upon. The network has enough approved program material to operate until\nJuly, 1956, and possibly into the summer season. Auditing of submitted programs\nand determining their acceptability has progressed satisfactorily, and slow-downs\nhave occurred only when great numbers of audition tapes are distributed at a time\nto committee members. It has been the policy of the committee to compromise as\nlittle as possible on production and talent quality. It is information that we are\nconcerned with, but its effectiveness can be diminished by mediocre presentation*\nPROGRAM PLANNING COMMITTEE\nKenneth Wright reports that the members of this committee have conferred by mail\non program ideas for the network. We recommend consideration of a prestige series\nsuch as \"Ways of Mankind\" was, and suggested that the De Tocqueville scripts be con¬\nsidered. We are further agreed that trying to originate programming concepts, spe¬\ncific areas for programs, and specific programs to fit the areas for a network is\nnot a job to be undertaken by three people in Iowa City, New York, and Knoxville.\nProgramming by committee is a big fat headache, of course, even if the committee can\nget together; it*s nearly impossible when the committee aoesn*t meet.\nWright attended a meeting in Chicago with Chairmen of the Grant-in-Aid, Acceptance,\nand In-School Acceptance Committees, along with Skornia and Bob Hudson to discuss\nthis year1s grant-in-aid program. The master title of AMERICA IN THE TWENTIETH CEN¬\nTURY for the grant applicants was suggested by Wright, so this committee can claim\ncredit for originating it,\nWright has also submitted a monthly radio program idea as per Schooley*s suggestion\nfor the NAEB News-Letter for about three or four months now. This will continue,\nsince suggestions are being received from members.\nRADIO NETWORK COMMITTEE\nThe chairman of the Joint Committee has successfully acted with diligence and effi¬\nciency to evade any mental or physical exertion.\nRespectfully submitted by: 1955 NAEB RADIO NETWORK COMMITTEE\nWaldo Abbot, Chairman\nAcceptance Subcommittee\nCopied at NAEB Hqs.,10/lii/55-cr $Sgh mIx”®11’ Chairman\nEdward J. Slack\nProgram Planning Subcommittee\nKenneth Wright, Chairman\nBernard Buck\nLee Eitzen"
}