{
  "id": "d1061-0",
  "text": "IV A E 8 NEWS LtTTER\nOffice of Executive Secretary\nUrbarta, Illinois\nFebruary 1* 1939\nWHA. WINS 19^3 HONOR AWARD\nWisconsin's state-owned broadcasting station WHA was named America's\noutstanding social service station in the VpA WOBI shovrmanshlp\nawards. The honor Is significant in that, it rates the station first\namon« nearly 700 eligible broadcasting units in this country in scoring\nSfirSr^achievements. The granting of the Social Service award\nto WHA. marks the first time a non-conmercial station has been named, for\nsuch an honor.\nWHA is owned hy the State of Wisconsin and operated through the Univer¬\nsity in tedieon. Programs originating in. its Radio Hall studioa are\ncarried extensively over WLBL, the state-station at Steven s Point, and\nby Mve»l private stations. It carries no advertising and serves as\na communications device for extending the state services to the c.tizens.\nTn thP competition of recorded educational programs, at Columbus,\nOhio wm also took top honors in the field of highschool broadcasts.\nmh itate-stations * work in educational broadcasting has put Wisconsin\nin the iead tn ttof, field nationally. The University station is toovn\nas the country !s oldest educatio.nal radio station, having started i\ntelephonic work, in 1917-\nSTANDARDS AT KKNT'JslK>.>,\nthe6following to^AS 'regLcUri^tancte^da used for U. of K. radio programs:\n(1) Avoid controversial subjects unless both sides are\nadequately represented*\n(2) Certain subjects about which nothing whatever oan be\n{ ’ Gained by an open discussion had better be eliminated\ncompletely. In this connection mi Jit be mentioned\nsuch things as Evolution and lleli&ion.\n(3) Disparaging remarks t:bout living people ar®\n° Diso&rakink remarks about, persons who are dead and\nwhich are delivered .n a sensational manner and no\nin an historical mamer are also taboo.\n(4) It is best to avoid mentioning a specific product\n' in speeches unless such mention is essential to\ntL sense of the talk. Anything that might, be\nregarded as an advertisement should be avoided."
}