{
  "id": "d1250-2",
  "text": "-3-\nconnection. with lawsuits in tho courts has not boon compiled.\nOther Countries. No law-suits have been reported. The International Broad¬\ncasting Union states that there have been none in Europe.\nSources of Income\nIn all countries which report profits from broadcasting, advertising is pro¬\nhibited or limited. Where there is income from advertising, this is but\na small proportion of the total income. Only in the United States of\nAmerica, which reports the largest loss, are tho broadcasting companies\ndependent on advertising for their income.\nThe Average Listener's License Fee\nForty-seven countries are known to collect license foes from radio listeners.\nBased on the maximum fee in each country, the average fee is $4.44 per\nyear. Many countries, however, provide satisfactory broadcasting service\nfor less than the average listener’s license fee. Tho fee in Canada is\n$2.00 per year; in Belgium, $0.65; in Denmark, $2.68; in Great Britain,\n$2.43; in Czechoslovakia $3.60; in Yugoslavia $3.96.\nHow This Information Was Obtained\nThe Department of State of the United States of America gave to a representative\nof the National Committee on Education by Radio (appointed by the United\nStates Commissioner of Education) a letter of introduction to officials of\nthe Department in other countries. This representative visited 35 coun¬\ntries in 1931. Officials of the Department of State introduced him to\nofficials in these countries. Written reports of his interviews were sub¬\nmitted to these officials. Corrections suggested by them were made. In\n1932 the representative of the National Committee on Education by Radio\nattended the International Telegraphic and Radiotelegraphic Conference in\nMadrid, Spain. There he interviewed officials of 77 countries. Written\nreports of these interviews were submitted to these officials. Corrections\nsuggested by them were made. The representative of the National Committee\nhas also visited each of the 48 States in tho United States of America to\ngather information on broadcasting.\nOfficial Documents Available\nThe following official documents of the United States of America, from which\nsome of the foregoing information has been taken, may be si>en on request\nto Mr. Armstrong Perry, Counsel of the National Committee on Education\nby Radio, The Swastika, Orizaba 80, Mexico, D. F.:\nCongressional Record, February 18, 1932.\nRadio Markets of the World, 1932.\nSixth Annual Report of the Federal Radio Commission, 1932.\nFees for Radio Licenses, 1933.\nCommercial Radio Advertising, 1932."
}