{
  "id": "d810-47",
  "text": "CONSTITUTION OF THE ASSOCIATION FOR EDUCATION BY RADIO (Continued)\nARTICLE IV—MEMBERSHIP\nSection 1 Any individual interested in the field of education by radio shall be eligible for mem¬\nbership. Each individual member is entitled to one vote.\nSection 2 Any local or national organization or institution interested in the field of education by\nradio shall be eligible for a contributing membership.\nARTICLE V—MEETINGS\nSection 1 The annual business meeting of the Association shall be held concurrently with the\nAmerican Association of School Administrators, and in the same city.\nSection 2 The Association shall participate in joint programs with the Institute for Education by\nRadio and the School Broadcast Conference and other educational radio conferences.\nSection 3 Other meetings and business sessions of the Association shall be designated by the\nExecutive Committee at least nine months in advance of the date of meeting.\nARTICLE VI—QUORUM\nThe members present at the business session of the Association shall constitute a quorum for the\nconduct of business.\nARTICLE VII—AMENDMENTS\nThis Constitution may be amended at any general meeting by a two-thirds vote of the individual\nmember representatives present, provided the proposed amendment has been submitted in writing\nat the previous general meeting or on three month's notice by mail ballot.\nJOIN IN THE DEVELOPMENT OF THE ASSOCIATION'S PURPOSES\nThe unified strength of those working in and for education by radio is needed NOW! Therefore we\ninvite you to become a charter member of the Association for Education by Radio. We urge you per¬\nsonally and as a colleague in the advancement of a great and significant movement to become a\nCharter Member. Let the Association strengthen you in your mark. Send the enclosed application for\nmembership to Robert Hudson, Rocky Mountain Radio Council (AER Treasurer pro tern), Denver, .\nColorado. Investment—$3.00.\nWILLIAM D. BOUTWELL\nH. M. BUCKLEY\nA. L. CHAPMAN\nPHIL COHEN\nJOHN CARLILE\nBELMONT FARLEY\nTHE ORGANIZING COMMITTEE\nDOROTHY FROST\nELIZABETH GOUDY\nROBERT HUDSON\nHAROLD W. KENT\nHAZEL KENYON\nED KIRBY\nKATHLEEN LARDIE\nCARL MENZER\nLEONARD POWER\nPAUL REED\nKEITH TYLER\nVERNA WALTERS\nBLANCHE YOUNG"
}