{
  "id": "d810-78",
  "text": "'c&m\nhe Sacred Heart fortheWorld'TheWorld forthe Sacred Heart\n755 BOYLSTON STREET\nBOSTON 16, MASS.\nVOL. V. NO. 1\nTV AND RADIO\nWORLD-WIDE ON 1141 STATIONS\nWINTER, 1955\n'Dincctrvte @olewu>t\nRemarkable Progress Highlights Closing Months of 1955\nSacred Heart-TV Programs on 40 Stations\nDear Friends:\nI think you will agree with us as you\n.read over this Winter issue of the\n“NEWS and VIEWS”—that our watch¬\nword has been progress and expansion.\nHowever, progress and expansion are\nnot always for the best. For instance,\nthe Reds are making progress with athe¬\nistic communism and are expanding their\narmed might. But the consoling part\nabout our steady development is that\nit carries forward into ever wider fields\nand more numerous channels the beauti¬\nful standard of the Sacred Heart of\nJesus. We can now say we have planted\nthat standard firmly in the world of tele¬\nvision. We are there not only to stay,\nbut to spread ever wider and wider the\nLove burning in the Sacred Heart for all\nmen—a Love that will never find its\nall-consuming flames satisfied until all\nmen are happy in this world and saved\nfor all eternity.\nFather Walter Flaherty, Director of\nRadio and TV for the Boston Archdio¬\ncese, brought out in his address at our\nannual dinner last September that if\nmen can spend hundreds of thousands\nof dollars on meaningless and puerile\nprograms, surely we can contribute pain¬\nlessly and sacrificially to the support of\na program dedicated to bringing to a\ndespairing world the solid food that\nnourishes not the body but the soul unto\nlife—unto eternal life.\nYour generosity to date has justified\nus in going ahead with the work despite\nmounting costs. We now must raise\n$900.00 every week to keep the radio and\nTV broadcasts on the air in this north-\ncontinued on Page 4)\nThe following Sacred Heart-TV schedule for this northeast area alone, shows\neffectively the advances the Program has made since its inception last June:\nWABI-TV (5) Sun. 12:45, P.M. Bangor, Me.\nWCSH-TV(6) Sun. 11:00, A.M. Portland, Me.\nWGR-TV (2) Sun. 8:00, A.M. Buffalo, N. Y.\nWHEC-TV (10) Fri. 7:00, A.M. Rochester, N. Y.\nWIRI-TV (5) Sun. 5:00, P.M. Plattsburgh, N. Y.\nWJAR-TV (10) Mon. 12:30, P.M. Providence, R. I.\nWKNY-TVT66) to start Dec. 18th Kingston N. Y.\nWMGT-TV (19) Sun. 7:15, P.M. Pittsfield, Mass.\nWMUR-TV (9) Wed. 3:45, P.M. Manchester, N. H.\nWRGB-TV (6) Sun. 9:15, A.M. Schenectady, N. Y.\nWTAO-TV (56) Sun. 7:45, P.M. Cambridge, Mass.\nWTW0-TV (2) Sun. 1:00, P.M. Bangor, Maine\nThere are fine prospects that this 15-minute TV program will soon be in New\nYork City, Boston, New Haven, Springfield and Syracuse with weekly TV.\nFrom our central offices in St. Louis come reports of similar expansion throughout\nthe country.\nEnthusiastic\nMrs. Dumaine\nMeeting Held In W. Springfield, Mass.\nOn October 17 some 200 promoters and friends of the program\ncrowded into the Knights of Columbus Hall in W. Springfield, Mass.,\nfor an address by Father Hale. This remarkable assembly was\ndue in large part to Mrs. Theodore Dumaine and her corps of\nindefatigable fellow-workers.\nMayor Trybulski of Chicopee welcomed the assemblage. Mrs.\nDaniel B. Brunton represented her husband, Mayor Brunton of\nSpringfield. Mr. Emmons Purcell represented the Knights and\nserved as Master of Ceremonies for the evening. The hall was\ndonated by the Knights.\nAlso honoring us by their presence were; Selectmen Raymond\nJ. Rosa and Walter J. Cogan of W. Springfield; Mr. Howard Keefe\nof WWLP, and Mrs. Keefe; and Robert Boulay, Civil Defense Dis¬\ntrict Director.\nFilms of the “Mission of a Jesuit” and of “Sacred Heart TV\nProgram” were shown by James Shea of Chicopee Falls. Organi¬\nzations represented at the meeting included: Blessed Virgin Sodal¬\nity of St. Thomas Church, West Springfield; Apostleship of Prayer,\nSt. George’s Church, Chicopee Falls; St. Thomas Women’s Club of\nWest Springfield; Holy Name Society, Holy Name Church, Chicopee;\nDaughters of Isabella, Springfield; College of Our Lady of the Elms,\nChicopee; Sacred Heart High School, Springfield; Holy Family\nWomen’s Club, Holy Family Church, Springfield; St. Ann’s Society,\n(Continued on Page 2)\nFr. Connolly and Fr. Hale prepare to present motion pictures for Springfield meeting.\nPhoto—Stanley Zaleski"
}