{
  "id": "d700-154",
  "text": "NATIONAL ASSOCIATION OF HEUCATIONAL BROADCASTERS\nUj. Gregory Hall\nUrbana, Illinois\nINSTRUCTIONS FOR APPLYING FOR AH NAEB R -SEARCH GRANT-IN-AID\nForm of Applications\nApplications must be submitted in nine copies and should consist of two\nmain sections* as follows?\nSection I (should be limited to one or two pages) should state as a whole\nthe following:\n1- The substantial benefits ‘bo education and broadcasting (radio and/or Tv)\nthat reasonably may be expected to result from this study*\n2- The hypothesis of the study*\n3- The problem of the study.\nli'^The relationships of the proposed study to existing studies.\n5»The sources of raw data* and materials and procedures of the study*\nSection II should indicate the following information:\n1- The expected date by which the following will be submitted to the NAEBj .\n(a) two copies of the full report of the study* (b) nine copies of\n& 600«work abstract of the full report, and (c) two copies of a financial\nreport* together with any unexpened NAEB funds.\n2- A statement of the names and titles of those who will serve as active\nconsultants for the project* will supervise the research* and will\nexecute the details of the study.\n>A budget of all items that will be provided for the research* indicating\n(a) what will be provided by the applicant* (b) what additional amounts\nare needed* (c) what will be provided by sources other than the applicant\nand the NAEB* and (d) what is proposed to be provided by NAEB. Amounts\nof §^00*00 or less may be provided by NAEB.\nU—A statement that no grant funds will be expended for (a) administration\nof the grant* (b) space mod ordinary facilities of the institution,\n(c) or purchase of capital equipment*\n5«The expected date by which a final financial accounting of the use of\nthe grant funds will be made to NAEB.\n6-The understanding that the NAEB has first right to publish a report of\nthe study if it so desires* with all other publications rights retained\nby the grantee* provided that such publication bear acknowledgement of\nthe grant*\n7~Ths approval and acceptance of the grant by the institution*\n8~The approval and acceptance of administrative responsibilty for the\nstudy by the head of the department in which the work is to be done*\nSubmission of Applications\nApplications must be submitted to Raymond D« Cheydleur* University\nBroadcasting Services* Florida State University* Tallahassee* and mast be\npostmarked not later than December 31* 1957* Grants will be announced on\nor about February 15* 1;'58*\nRevised-Approved 8/7/57\nChicago Conference"
}