{
  "id": "d700-3",
  "text": "During the week of September 9-13# I attended a seminar on edu®\nnational television instruction held in Washington, D. C., under\nthe auspices of the Division of Audio-Visual Instruction of the\nNational Education Association,, The seminar was supported by money\nfrom the Fund for the Advancement of Education, which was interested,\namong other things, in getting information which could be used in its\nnationwide experiment on instructional television in public schools0\nDuring this meeting I gave considerable thought to our session, and\nsome of the suggestions which follow are ideas that occurred to me\nin the course of our Washington discussions® The Washington meeting\nbrought together school administrators, curriculum experts, and re¬\nsearch men, plus a few people concerned with the actual broadcasting\nprocess. In consequence, the emphasis was shifted away from the pro¬\nduction of programs—which is an inevitable (though I don8t mean to\nsuggest undesirable) trend in one of our meetings—and placed instead\non other aspects of the television education process®\nI note that most of the suggestions for discussion at our meeting (in¬\ncluded in your memorandum of September 13 to I®, Keith Tyler) are oriented\naround (at home) audience reaction to programs® In many cases this was\nnot spelled out in detail. I heartily endorse these ideas, but should\nlike to suggest in addition a few other aspects®\nIt is important that we concern ourselves with certain details of the\nteaching process, which otherwise may become the exclusive domain of\ngroups such as DAVI (for which, incidentally, I developed a great deal\nof real admiration during the Washington meeting). Exactly what can\ntelevision do in instruction? Are the worries of teachers about the\n\"master teacher\" justified? Are there any disadvantages from having\ngroups of children all over a school system exposed to the teaching of\na single instructor? What does all this hold for the learning process?\nAmong other things, our seminar ought to review the different types of\nstudies currently in process® John Scanlon of the Fund for the Advance¬\nment of Education, who was present at the washington meeting, gave an\ninteresting summary of the research they are carrying out* We ou$it to\nknow about this, so that we will be aware of it. We should fit into it®\nEither we do or don°t cover the same groundj in either case, our de¬\ncision should be deliberately rather than accidentally taken®\nThere also is the research being carried out by the ETRC. What findings\nis it producing? What is our relationship to it? What about the studies\nbeing conducted in connection with the Hagerstown projects? They,too,\nare appraising their work as they go0\nAs to the personnel participating in our meeting, I shall not pass\nupon the qualifications of those people with whom we are well acquainted®\nI think it is desirable, however, to include in this group, not only\nsome of our own members, but also people active in other fields® I see\nthat Ry Crary nominates Dr® Arthur Wells Foshay® Wells was one of the\nmembers of the Washington meeting who most impressed me. He is oriented"
}