{
  "id": "d700-5",
  "text": "MEMORANDUM\nSeptember 25, 1957\nTo: Raymond D. Cheydleur\ncc: Harry J. Skornia, I. Keith Tyler, Richard B. Hull\nProm: Burton Paulu\nI have read with interest, approval, and much enthusiasm,\nthe recent correspondence relative to the NAEB seminar on research\nin educational broadcasting which is scheduled for Ohio State\nUniversity on December 9 through 13.\nDuring the week of September 9-13, I attended a seminar on\neducational television instruction held in Washington, D. C.,\nunder the auspices of the Division of Audio and Visual Instruction\nof the National Education Association. The seminar was supported\nby money from the Fund for the Advancement of Education, which was\ninterested, among other things, in getting information which could\nbe used in its nationwide experiment on instructional television\nin public schools.\nDuring this meeting I gave considerable thought to our\nsession, and some of the suggestions which follow are ideas that\noccurred to me in the course of our Washington discussions. The\nWashington meeting brought together school administrators,\ncurriculum experts, and research men, plus a few people concerned\nwith the actual broadcasting process. In consequence, the emphasis\nwas shifted away from the production of programs—which is an\ninevitable (though I don't mean to suggest undesirable) trend in\none of our meetings--and placed instead on other aspects of the\ntelevision education process.\nI note that most of the suggestions for discussion at our\nmeeting (included in your memorandum of September 13 to I. Keith\nTyler) are oriented around (at home) audience reaction to programs.\nIn many cases this was not spelled out in detail. I heartily\nendorse these ideas, but should like to suggest in addition a few\nother aspects.\nIt is important that we concern ourselves with certain details\nof the teaching process, which otherwise may become the exclusive\ndomain of groups such as DAVI (for which, incidentally, I developed\na good deal of real admiration during the Washington meeting).\nExactly what can television do in instruction? Are the worries of\nteachers about the \"master teacher\" justified? Are there any\ndisadvantages from having groups of children all over a school\nsystern exposed to the teaching of a single instructor? What does\nall this hold for the learning process?\nAmong other things, our seminar ought to review the different\ntypes of studies currently in progress. John Scanlon of the Fund\nfor the Advancement of Education, who was present at the Washington\nmeeting, gave an interesting summary of the research they are"
}