{
  "id": "d1290-2",
  "text": "NAEB NEWS LETTER\nPage 3\nJune I, I 945\nNAEB MEMBERS DO WELL IN OHIO INSTITUTE AWARDS\nAy.'ARDS IN THE N i NT H A\\iER I CAN EXHIBITION OF EDUCATIONAL RADIO PROGRAMS,\nSPONSORED BY O'H 10 STATE UnIVERS8TY*S INSTITUTE FOR EDUCATION 8Y RADIO,\nWERE ANNOUNCED WAY l6, BY Dr„ I, KEITH TyLER, D 8 RECTOR OF THE INSTITUTE.\nNAEB MEMBER STATIONS AND PROGRAMS PLANNED BY ASSOCIATE MEMBERS ARE WELL\nREPRESENTED IN THE FINAL AWARDS AS IS SHOWN BY THE FOLLOWING TABULATION OF\nNAEB winners:\nAgricultural Broadcasts—Honorable mentions (two): “Ohio Farm and Home\nHour”, planned and produced by Ohio State University Agricultural Extension\nService, broadcast over WOSU, Columbus. “Farming with Kenneth Yeend’1 ,\nplanned, produced, and broadcast by KIRO, Seattle*\nPersonal ano Family Life Programs—First Award: “Our Children”, planned\nand produced by WHA, University of Wisconsin; broadcast over WnA, Madison,\nand WL8L, Stevens Point*\nChildren^ Programs for Listening Out of School—Honorable mention: “Story-\nBook Time”, planned, produced, and broadcast by WLB, University of\nMinnesota-, Minneapolis,\nPrograms for Use in School by Primary Children—Honorable mention: \"Old\nTales and New\", planned, produced, and broadcast by WLB, University of\nMinnesota, Minneapolis,\nPrograms for Use in School by Elementary Children—Honorable mention (two):\n\"Exploring the News: Wisconsin School of the Air/’ planned and produced by\nWHA, University of Wisconsin; broadcast over WHA, Madison, and WLBL, Stevens\nPoint, “Once Upon a Time in Ohio: Ohio School of the Air**, planneo and\nproduced by Ohio School of the Air, broadcast over WOSU, Ohio State\nUniversity, Columbus,\nCultural Programs—First Award: “WNYC American Music Festival-1945“,\nplanned, produced, and broadcast by WNYC, New York,\ni\nPrograms for Use in School by Junior and Senior High pupils—First award:\n\"Our America\", planned and produced by Radio Council of the Chicago public\nschools, broadcast over WBEZ, Chicago,\nWKAR WILL BROADCAST FROM 1NTERLOCHEN\nThroughout the summer months WKAR will operate ,on a full twelve hour per\nDAY SCHEDULE WITH MANY OF THE REGULAR FEATURES CONTINUING AS USUAL. New\nPROGRAMS FITTING THE SUMMER SEASON WILL BE SCHEDULED, INCLUDING CONCERTS\nfrom the National Music Camp at Interlochen, discussions of the stars and\nTHE HEAVENS BY KaREL HuJER, A “CAMERA OlUB OF THE A|r“ BY J« BEACH\nand others. For\nNO NEW RAO I OS THIS YEAR\nFCC Chairman Porter sees no relaxation of “freeze\" policies on station\nCONSTRUCTION UNTIL JAPAN IS BEATEN. CONTINUING MILITARY NEEOS WILL ALSO\nPREVENT QUANTITY PRODUCTION OF HOME RECEIVERS UNTIL 1946, ACCOROING TO\nWPB, ALTHOUGH SOME VARIETIES OF SETS MAY REACH THE MARKET IN SMALL NUMBERS\nby Christmas."
}