{
  "id": "d1290-5",
  "text": "NAEB NEWS LETTER\nPage 6...*.\n.. o June I > 1945\nAnother veteran in radio now associated with WQSU is Edward C0 Sprague,\nPRODUCTION SUPERVISOR. SpRAGUE DID HIS FIRST RADIO BROADCAST OVER THE\nWfiST I NGHOUSE STATION IN PITTSBURGH IN JUNE, I921 , APPEARING WITH A GROUP\nOF VOCALISTS CALLED \"The Ajr-CoOLED GANG.” He HAS BEEN IN RADIO EVER\nSINCE SERVING AT VAPIOUS TIMES AS ANNOUNCER, SPORTS ANNOUNCER, ASSISTANT\nPRODUCTION MANAGER, MUSICAL DIRECTOR, PRODUCTION SUPERVISOR, AND\nASSISTANT MANAGER. He IS A SOLOIST IN HIS OWN RIGHT AND SINCE STARTING\nIN RADIO HE HAS TRAVELED WITH MUSICAL UNITS THROUGHOUT THE UNITED STATES\nand Canada. He has sung on more than 75 different radio stations in the\nTWO COUNTRIES, AS WELL AS ON NETWORK PROGRAMS*\nVbOSU CELEBRATED ITS S! LVER ANNIVERSARY IN MaRCH. I SURE THAT THE ENTIRE\nMEMBERSHIP OF THE NAEB WISH FOR THE STATION A FUTURE EVEN MORE GLORIOUS\nTHAN ITS PAST.\nSCHOOLING FOR SCHOOLEY\nPREXY SCHOOLEY HAS BEEN GRANTED ONE OF THE NAB ft AD IO-JOURNAL ISM INTERNE-\nSHIPS AND LEFT JUNE FIRST FOR A'SYR, SYRACUSE, N.Y. He WILL SPEND TWO\nMONTHS STUDYING METHODS, AND PREPARING COPY FOR THE STATION. IT IS A\nGRAND OPPORTUNITY AND YOU MAY REST ASSURED, FRANK WILL TAKE FULL\nADVANTAGE OF IT* In THE MEANT I ME, YOUR EDITOR, WILL TRY TO HOLD THE\nFORT AND KEEP PrEXY ADVISED OF ALL NAEB ACTIVITIES.\nPROGRESS AT VVNAD\nJohn Dunn of VVNAD reports considerable progress during the past year.\nThey have really got the faculty stirred up now with more than 125\nCOOPERATING IN THE PREPARATION AND PRESENTATION OF PROGRAMS. ANOTHER\nHIGHLIGHT HAS BEEN THE COOPERATION OF VARIOUS STATEWIDE ORGANIZATIONS\nsuch as the Parent Teacher Associations of the State, the Oklahoma State\nFederation of Women’s Clubs, the Oklahoma Music Teachers Assn* The AAUW,\nthe State Health Department, the State Historical Society, and the State\nDepartment of PueLtc Safety. All have tied in with VVNAD for some\nSPLENDID PROGRAMS.\nThe Public Relations job has been outstanding too. The Program Bulletin\nand Schedule is now in striking distance of the 6500 mark. This time\nlast year it was only 2l5. More than 6000 requests for the bulletin is\nAN INDICATION of SOMETHING OR OTHER.\nThey are hoping to increase their full time staff to *2 with the usual\nRETINUE OF STUDENTS IN ADDITION. ThEV ARE DEFINITELY IN THE RACE FOR\nPOST-WAR DEVELOPMENTS WITH A $250,000 RADIO CENTER TO BE DEVOTED\nEXCLUSIVELY TO RADIO* More THAN 80 NEW PROGRAMS have been ADDED during\nTHE PAST YEAR AND THE PLAN IS TO CONTINUE BRINGING IN NEW FEATURES*\nIncidentally, John regrets the loss of Mat Erwin, who goes into the armed\nforces June 9. Our best wishes and the 8est wishes of all the members\nof the Association go with Nat »nd we hope to see him sack soon with the\njob done.\nTHIS AND THAT\nThe U.S. Office of Education Has aSked the FCC to limit FM Educational"
}