{
  "id": "d836-101",
  "text": "NAEB PLACEMENT SERVICE\nAny employer interested in one or more of the following applicants can obtain\nfurther information by contacting: .Mr. R(.. E. Underwood,.;Jr., Placement Officer,\n14 Gregory Hall, Urbana, Illinois. Also, anyone interested in registering \\d.th\nthe Placement Service should contact Mr. Underwood, and the proper forms will be\nforwarded. You are urged to retain past issues of. the Supplement for future\nreference.\nMarch 1. A married man of 48 with twenty-five years of classroom experience and\nfourteen years in radio and television wishes a position in educational broad¬\ncasting. Licensed teacher, willing tp teach part,time in connection with station\nposition as either producer-director, news director, writer, program director or\nadministrative post. B.S. Location open. C6500.\nMarch 2. A young, married man, .24,, now assistant director at third largest origi¬\nnation point for CBS TV Network desires1 to enter educational television :as, pro¬\nduction manager or program director. Now working on -degree. Location open.\nCurrent salary: ?125 weekly. '\nMarch 3. A single man, 34, with nine years connection with film companies seeks\na position with an educational television station. Graduate of School of Radio\nTechnique. Two years college. Location, salary open.\nMarch 4. A married college speech instructor with wide training and experience\nin writing, producing and presenting educational television programs desires a\npermanent position with an educational television station. Age 27. Graduate\ntelevision training at Goth Michigan and Northwestern,plus one year’s writing-\nproduction experience with University telecourses. MA, working on PhD. Prefers\nEast, t4800.\nMarch 5. A recent PhD currently teaching and producing in radio and television\nat a major university is looking for professional advancement. His experience\nincludes four years in commercial radio from announcer to program director and\nten years part-time commercial and educational broadcast work. Well grounded\nnews and public affairs background plus interest in communications research.\nEight years teaching experience in speech, radio-television and journalism.\nAge 33. Married, one child. Location open* ■ 6000.\nMarch 6. A single woman of 44, recent television school graduate, desires educa¬\ntional broadcasting position as writer or assistant program director. Bachelor;\nof Music; MA, Education; some work done on PhD. , Six years teaching experience.\nPrefers Midwest location. Salary open.\nMarch 7. A television copywriter /producer with five years of New York advertising\nagency experience would like to put his knowledge to work in either writing, pro¬\nduction or programming. Now doing teaching and consultant work at university.\nSome educational radio and folklore background. Male, 37, single. BS; candidate\nfor MA in Communications. Location open. f6000."
}