{
  "id": "d836-102",
  "text": "PLACEMENT SERVICE, MARCH 1956: Page 2\nMarch 8* A prodxicer-dife'cipr-witxr-annduncer-executiVe would like to secure a\nposition with some educational broadcaster, radio or television. Twenty-five\nyears of local, regional and network experience in radio; seven years in televi¬\nsion, Male, 47* Location ahd salary open.\nMarch 9. A professionally trained, married man of 24 desires a position in\neither programming qr. \"product ion. New York University Radio Department graduate.\nSeeks a start with an educational broadcaster. Local ion\"arid salary open, as\nmain interest, is in permanency and opportunity.\nMarch 10. A family man, age 32, with three years as television producer, direc¬\ntor and .film, director.wishes to be considered for position as either program\n^director, production manager or similar executive*position. Hris served as direc¬\ntor of educational television series. BFA; theatre background. Will relocate.\n*6606. \" '■ ■* \" ;v ,\nMarch 11. ...A.,single woman., age 42, wants the opportunity to enter educational\nradio or television as a trainee...;Limited radio e^erience. B&,;Sociology; ’\nMA, Education. Experience in elementary, secondary and adult education.\nLicensed teacher. Six years of foreign service in social service and education.\n?Location, salary open. ;\nMarph 12. A producer-director with four,and- one-half years experience in educa¬\ntional FM arid television station seeks work ..in radio*or television production,\n.direction or management. Bachelor of Music; professional musician with numerous\ncompositions commissioned and performed by reputable organizations. Training in\nFine Arts, Writing and Photography. Speaks three languages fluently. Prbduced\nand; directed live concerts, musical fine .arts, current events and children’s\nprograms. Single. Age 33.. Prefers. East. f 5.200. ,\nMarch.13. A young (21) female college graduate is seeking a position on the pro¬\nduction staff of' an educational radio or television station. BS, Communication\nArts. Willing to work hard to see efforts rewarded by successful programs.\nAvailable June, 1956. Prefers New York area. ? 2600.\n.. March 14, Young man (26),. married, is looking for a position with an educational\nbroadcasting operation. Hard worker. Fully indoctrinated in radio, television\nand film production by a network in conjunction with Columbia University. BFA.\n'Available June 1, 1956. Prefers Southern and Mid Atlantic states', f3600 minimum.\nMarch 15. A versatile, young woman desires a position with the Art Department of\nan educational television studio. BA in Advertising Design plus one year's ex¬\nperience with an educational television operation in Alabama. Also, she has had\ntelevision production experience, . An accomplished singer and dancer, she has\nappeared in over-seas USD shows. Additional experience includes acting as a\nhostess on a weekly television series'. Prefers New York City, South or West.\nf3600."
}