{
  "id": "d836-104",
  "text": "-2-\nJanuary 9 - Script editor and producer in educational radio station wants\nswitch to educational station that has close operational connection with\na school or college. Male, 41, married, M..A . Location, salary, open.\nJanuary 10 - Man with B.S. in speech and radio, M.S. in administra¬\ntion and supervision. 7 years educational and commercial experience\nin radio-TV, audio-visual instruction and movie production. Licensed\nteacher and supervisor in New York State. Now employed in motion\npicture production and distribution. Married, 37, location open. $7000.\nJanuary 11 - Male, 41, married, M.A. 4 years producer of in-school TV\nprograms wants responsible ETV management position. Location open.\n$8000.\nJanuary 12 - Radio-TV executive, male, 39, single, M.A., complete\nknowledge programming and production. 17 years in commercial, propa¬\nganda and educational broadcasting, 8 years in New York. Wants prod¬\nucer-director position in ETV on a campus. Will teach. Location open.\n$7000.\nJanuary 13 - Teacher with 25 years classroom experience, 14 years in\nradio-TV, wants writer-director, news director, program director position\nin educational broadcasting. Will teach. Male, 49, B.S., married.\nPrefers Eastern location. $6500.\nJanuary 14 - Male, 31, married, M.A., with experience in commercial\nwriting and teaching. Wants educational broadcasting in New York as\na writer. $6000.\nJanuary 15 - Male, 36, EdD., married, producer in ETV station wants\nadministrative position in same field. Location open. $7500.\nJanuary 16 - Young man with some experience in commercial radio prod¬\nuction and is familiar with production aspects of TV wants position as\nETV production assistant. Married, 26, B.F.A. Location open. $55/wk.\nJanuary 17 - TV producer, 7 years in commercial TV and producer of\nmulti-national network shows, live and film, also U.S. and European\nradio background, wants producer-director position in ETV. Male, 32,\nmarried, B.A. Location open but prefers with a university. $7000.\nJanuary 18 - Radio-TV director in ETV at a small college desires program\ndirector or producer-director position in ETV. Male, married, 3S, M.A.\nLocation open. $3800."
}