{
  "id": "d836-108",
  "text": "-6-\nJanuary 45 - Commercial TV program director wishes return to ETV. 2\nyears ETV producer-director; 2 1/2 years commercial TV program direct¬\nor. Wrote, produced and directed national award-winning series.\nProduction experience includes film - silent and SOF - kinescope, and\nlive. Seeking responsible ETV position utilizing background. Male,\nsingle, 33, M.S. Location open. $7500.\nJanuary 46 - \\oung TV director would like permanent position as staff\nTV director. Experience includes the birth pangs of 2 television opera¬\ntions, art supervision, and day-by-day TV production and direction.\nMale* single, 30, M.A. Location open. $4600.\nJanuary 47 - Man with some early ETV experience as writer-producer,\nand some experience as. commercial film story editor, teacher, radio-TV\nactor, is interested in a combination radio-TV-film production and\ntraining position, or teaching in mass media. Licensed teacher. Male,\nmarried, 39, PhD. Location open. $4800.\nJanuary 48 - Producer-director with 3 years commercial TV experience\nis looking for opportunity to grow with ETV. Business experience;\naccomplished musician, designer. Male, married, 34, M.A. Loca¬\ntion open. $6000.\nJanuary 49 - Young man just out of college wishes to work in either\neducational radio or TV as announcer, production assistant, etc. Single,\n23, A.B. Willing to work anywhere at not less than $60/wk.\nJanuary 50 - Veteran commercial radio broadcaster desires to pass on\nhis knowledge to younger people preparing to enter the field. Currently\nemployed by 5000 watt station as news and program director. Back¬\nground includes management of small station. No actual work in TV\nbut not a stranger to it. Male, 3 6, B. Ed., married. Location open.\n$5200.\nJanuary 51 - Woman, 49, single, B.A., with 10 years experience in\nradio, 8 in commercial and 2 in educational - is looking for a perman¬\nent place with writing and production staff of radio-TV operation with\nuniversity or college. Experienced in writing, editing, daily broad¬\ncasts, public service shows, etc. Location open. $300/mth.\nJanuary 52 - Commercial TV operations manager and program director,\nthoroughly experienced in all phases TV operation, is seeking respon¬\nsible position with progressive ETV outlet. Male, 31, married, M.A.\nLocation open. $7500."
}