{
  "id": "d836-110",
  "text": "-8-\nJanuary 61 - Young man wishes position in ETV as writer, announcer or\nproduction assistant. Especially interested in drama on TV. Has worked\nin both radio and TV. Received experience in educational broadcasting\nin radio. Single,. 25, A.B. Location open. $70/wk.\nJanuary 62 * Young man with M.A.. (Syracuse), desires a position as prog¬\nramming assistant, production assistant; assistant director. Wants a\nUniversity-owned station. Can teach in conjunction with duties. Married,\n24, Prefers Chicago area, does not want to go South. $4500.\nJanuary 63 - Pioneer in Radio-TV Educational station operation field de¬\nsires change to college field. Has teaching and administrative credentials,\nfirst class radio-telephone operators license, college teaching experience,\nyears of radio-TV technical operation, installation experience and the\nknow-how to set up and run a large department. Wants Chief Engineer\nor technical director's position. Male, 50, married, M.A. Location open.\n$7500.\nJanuary 64 - Recent graduate of TV school with a background in education,\nnewspaper and technical writing experience, desires radio-TV position as\ncontinuity writer, news writing or production. Male, single, 43, A.B.\nLocation open. $3 00-400/month.\nJanuary 65 - Executive director, writer, producer - executive head of state\nETV agency now available due to Governor's veto of operating funds. Three\nyears TV production^direction; 7 years radio production-direction; film\nqualifications; 8 years teaching radio, 2 teaching TV; Director Radio-TV\nfor state college 7 years , building program from 1 a week to 900 in a typical\nyear, with full responsibility for all broadcast activities. Family man\nwith ample reasons to keep nose to grindstone. Male, married, 38, M.A.\n(with Ph.D. pending). Prefer western location but will go anywhere. $7000.\nJanuary 66 - Employed director-switcher desires opportunity to join educa¬\ntional organization. Three years commercial experience in programming and\nproduction, also commercial radio background. Male, single, 36, B.S.\n(completing M.A.) Location open. $75/wk.\nJanuary 67 - Assistant program director and production manager of 3-station\nTV working on M.S. in speech desires position in ETV in programming or\nproduction. Knows phases of live local programming. Male, married, 27,\nB.S. Will go anywhere except the deep South. $450/month."
}