{
  "id": "d836-119",
  "text": "-16-\nJanuary 129 - University director of radio-TV, has supervised growth of\na campus TV studio, wishes ETV position with more extensive facilities.\nAll phases of broadcasting experience; 16 years writer, director, producer,\nnews and management. Teacher; author of audio-visual texts, holds 3rd\nclass FCC license. Male, married, 45, Ph.D. Location open. $7000.\nJanuary 130 - Male, 39, single, B.S., presently employed as university\ninstructor and does radio-TV consultant work on the side; past experience\nincludes writer-producer for network stations. Would like to put knowledge\nto work actively in educational broadcasting in writing, production or prog¬\nramming. Location open. $6500.\nJanuary 131 - Experienced manager and production director in both commercial\nand ETV desires administrative position in ETV. Twenty years experience in\nthe field. Undergraduate degree in electronics. Has taught all phases of\nradio-TV production and management. Male, 44, single, Ed.D. Prefers\nmetropolitan area. $7000.\nJanuary 132 - Teacher, 10 years, with some radio experience desires position\nin ETV. Has completed a TV workshop and had some graduate courses in the\nfield. Male, 39, married, M.A. Wants South or Southwest. Salary open.\nJanuary 133 - Male, 28, married, working toward B.A., desires position in\nETV. Has 10 years experience as TV actor and assistant in film company.\nAlso has worked as floor manager. Desires position around metropolitan\narea. $75/wk. . . .\nJanuary 134 - News director for commercial radio station seeks similar posi¬\ntion in educational radio. Is also'special events director. Male, 39, married,\nM.A. Location, salary open.\nJanuary 135 - Male, 27, married, M.A., with 7 years broadcasting experience\nas news announcer, producer-director and production manager in radio-TV\ndesires a production-direction place in ETV. Prefers locate near university\nwhere he can continue with Ph.D. work. $390/mth.\nJanuary 136 - Male, married, 46, M.A. and working on Ph.D., at present\nassistant producer for 10 hours a week on ETV station. Desires position\nleading to ETV producer-director. Location, salary open.\nJanuary 137 - Production manager with commercial TV, 6 years experience,\nwants production manager, director or program director position in ETV.\nMale, 27, married. Location open. $400/month."
}