{
  "id": "d836-128",
  "text": "MSB PLACEMENT S3RVXC3\nAnyone wishing to register with the IJAEB Placement Service should\nwrite Bon \"Talker, 14 Gregory Hall, Urbana, Illinois, and the proper\nforms will be forwarded to you by return mail. Also any inquiries con¬\ncerning applicants listed below should be addressed to Don Walker,\nThe following descriptions of personnel listed with us are written\nby the applicants and taken directly from the Placement Service forms.\nNov. 1 Experienced announcer, director, producer, now in commercial re¬\ncording, wishes to return to TV* Desires position demanding good work,\nbut giving responsibility and freedom of execution. Two years of ”on\ncamera” work as commercial announcer, supplemented by responsibility of\ncompletely producing many of shows handled. Proficient technician who\ncan also think,\nNov. 2 Han desires position in educational TV, 3,3, in speech and rad¬\nio, M,S. in administration and supervision. Seven years educational\nand commercial experience in radio, TV, audio-visual instruction and\nmotion picture production and distribution. Licensed in New York State\nas teacher and supervisor. Presently employed in motion picture pro¬\nduction and distribution work. Available immediately.\nNov, 3 Available for immediate employment. Young man, 35, wants pos¬\nition in educational TV, Equipped by training and experience to handle\nwide range of problems. Can fit into any organization. Looking for\nopportunity to combine creative ability with technical know-how in ed¬\nucational field.\nNov, 4 Age 30, seek radio-TV position in New York, B.A, and II.A, de¬\ngree, Experience in commercial writing and teaching. Have good know¬\nledge of music, theatre and literature.\nNov, 5 I have been thoroughly trained in radio and television. My ra¬\ntio experience includes announcing, programming, and management. Two\neducational programs I produced received national citations from the\n3hio Institute, I am looking for a challenging position with an organ¬\nization interested in or active in television.\nNov. 6 Production, script, research. Versatile young woman with com-\nnercial station and network experience in informational and cultural\nprogramming. A.3. with distinction, Cornell.\nNov. 7 Are extra hands needed in your station’s operation? Do jrou\nvant a person who is creative, capable, energetic, enthusiastic,\" loyal\nand willing to work? A person who is experienced and well trained in\nall aspects of broadcasting — program planning and building, radio and\ntelevision x\\?riting, production, acting, announcing, audience measure¬\nment and savoir faire?"
}