{
  "id": "d836-135",
  "text": "Placement Service\nPage 2\nJuly 6: Free lance writer with several years experience in writ¬\ning scripts would like to get into educational broadcasting# lias\nworked for church groups and newspapers# At one time was fran- '\nchised agent in charge of talent for fields of radio, television*\ntheater, motion pictures. Personal representative of Hollywood\nstar clients for Hew York bookings* Assistant to literary agent\nhandling plays and novels, playwrights and authors. Office man¬\nagement •\nJuly 7: Would like position as music director or program director\nat educational radio station. Has had 3 years experience as staff\nannouncer and classical music director. Presently engaged in\nstaff announcing and board work.\nJuly 8: Lady with Ph.D. in Psychology and Reading would like to\nstart a program giving developmental reading instruction for both\nchildren and adults. Has had experience with this type of program\nin TV before* Presently engaged in directing reading programs for\nlarge corporations*\nJuly 9: Is interested in position as writer-producer, or a pos¬\nition administrative or teaching, relative to either. Hill soon\nhold an II.A. in Radio. In addition to journalistic background\nand experience, has had three years of commercial radio exper¬\nience and has held present position as an educational radio writ¬\ner-producer for the past four years. Would like change because\nopportunities for advancement are rather limited*\nJuly 10: Would like a change in the near future. Responsible for\nall the duties of a TV producer for the presentation of some 30\npast Hoard of Education television programs, in both live and film\nform, through the facilities of local commercial stations* Well\nexperienced in the physical staging aspects of television program\nproduction. This experience has included the responsibility of\nscripting, orientation and instruction to the participating per¬\nsonnel, and the outside studio rehearsal of the programs. Res¬\nponsibilities also include being available as a consultant and\nspecialist for all Board of Education departments and persons to\nassist them in the preparation and presentation of a television\nperformance.\nHASH\nBBUCATIORAL TELEVISION AWD RALIO\nPLAC30HT SERVICE\n14 Gregory Hall\nUrbana, Illinois\nJuly 1, 1954"
}