{
  "id": "d836-167",
  "text": "PLACEMENT SERVICE, MAY, 1955: PAGE 2\nMay 8* Young ambitious veteran, married, one child, studio operations graduate\nof Television Workshop, seeking position on television technical staff. Can\noperate television camera, video, audio, turntables, mike boom, projectors and\nremotes. Photograph and resume on request. Will relocate anywhere in U. S.\nMay 9. Available for immediate employment. Young man, 35, wants position in\neducational TV. Equipped by training and experience to handle wide range of\nproblems. Can fit into any organization. Looking for opportunity to combine\ncreative ability with technical know-how in educational field.\nMay 10. AGE 30, SEEK RADIO-TV POSITION IN N.Y, BA AND MA DEGREE. EXPERIENCE IN\nCOMMERCIAL WRITING AND TEACHING. HAVE GOOD KNOWLEDGE OF MUSIC, THEATRE AND LIT.\nMay 11. Experienced in producing and M.C.’ing educational telecasts for youngsters\nand adult audiences. Degrees in music and communications. Competent pianist\nand conductor. Desire position in TV production, preferably with on-camera work.\nMay 12. Former Program Director of WNYC, and Campaign Director for San Antonio\nCouncil for Educational Television wants management and/or program director’s\nposition with educational television station. Has, in addition to experience\nin educational broadcasting and televising, five years programming experience\nwith commercial stations, including WNBC, New York; and comprehensive experience\nin community organization for educational television. Location not important;\nfurthering of career in educational television is. Would consider job as\nCampaign Director for initial community efforts to secure capital funds.\nMay 13. I have been thoroughly trained in radio and television. My radio ex¬\nperience includes announcing, programming, and management. Two educational\nprograms I produced received national citations from the Ohio Institute, I am\nlooking for a challenging position with an organization interested in or active\nin television.\nMay 14* Production, Script, Research. Versatile young woman with commercial\nstation and network experience in informational and cultural programming. A.B,\nwith Distinction, Cornell.\nMay 15. Experienced manager with six years of teaching in college and four years\ncommercial experience on the executive level desires more challenging position.\nAge-35, married, doctoral candidate, and can furnish better than average references.\nMay 16. Available at once: Man, age 50, Ph.D, degree, family, with background\nof successful experience in university teaching (music) and in commercial broad¬\ncasting. Teaching included fifteen years orchestra and band conducting as well\nas various courses in music education and instrumental music. Broadcast exper¬\nience last ten years as director of education and research for leading mid-west\nstation. Have worked closely with school and college officials in planning educa¬\ntional series, radio and television. Position desired in educational broadcasting\nwith possibility of special cooperation with music department.\nMay 17. All phases of television and radio experience, 16 years as writer,\ndirector, producer, news writing and management. Experience in building, operating,\nmanaging 14 radio stations simultaneously. Advisor, teacher, author of texts\non radio production-directing. Have had technical training and am an FCC license\nholder, 3rd class; experience in copyright and clearance problems, wide musical\nbackground, publicity, promotion and public relations background. Phi Beta Kappa\nand currently pursuing doctorate degree in mass media of communications at"
}