{
  "id": "d836-178",
  "text": "NAEB PLACEMENT SERVICE\nAnyone wishing to register with the Placement Service should contact Mr. R. E,\nUnderwood, Jr., 14 Gregory Hall, Urbana, Illinois, and the proper registration\nforms will be forwarded immediately. Also, any employers interested in the can¬\ndidates listed below should contact Mr. Underwood for particulars.\nThe following candidates have registered recently with us. We urge you to retain\npast issues of the Supplement for information concerning other candidates.\nDecember 1. A mature woman, with two grown sons, would like to assist in teach¬\ning young people radio ver?-c. Wide radio experience, including continuity, traffic\nand woman’s director over a total of 14 years. Very strong in continuity, with\n4 years as radio continuity director; presently continuity writer, traffic director\nand film supervisor of commercial TV station. B.A., will take courses to obtain\nmaster’s degree, if necessary. Prefers midwest town where she can become part\nof the community. *\nDecember 2. A producer-director of educational films dissatisfied with present\nduties as manager of 16mm distribution office desires employment with an educa¬\ntional TV station offering better use of his capabilities. Wide experience, all\nphases of film work. Also, eight years as commercial artist. Good knowledge of\nmusic and languages. Fulbright Scholarship to Italy, 1950-51.\nDecember 3. A young single man of 30 has had 4 years experience in educational\nradio, 2 years in commercial radio, and 2j> years in international radio. B.A. in\nSpeech-Radio; M.A. this year in Speech-Radio-Television. Has had one year of\ncollege level teaching experience. Is interested in radio and/or television pro¬\nduction and direction. $4000 minimum.\nDecember 4* A creative designer desires a position as Art Director in an educa¬\ntional television station. His ten years of professional experience includes:\nwriting, design and direction of motion picture films (animated and live-action)\nfor television theaters: management of own advertising art business; advertising\nand sales promobion layout and design for national accounts. Presently working\nin conjunction with an educational television station, but would prefer full-time\nemployment in the field. Single, male, age 30.\nDecember 5. A mature gentleman is seeking a position as a producer-coordinator\nor area chairman in radio and television. Ph.D. in Speech. 15 years commercial\nradio experience; 6 years experience in college and university teaching; 3 years\nas director of ETV workshop. Extensive experience in radio and television curricu¬\nlum development. Producer of many ETV programs. Looking for a challenge.\nDecember 6. A radio executive with an exceptional background is interested in\nentering the educational broadcasting field. Seventeen years work in commercial,\npropaganda and educational broadcasting here and abroad. M.A. plus complete know¬\nledge of programming and production. Expect good salary.\nDecember 7. A young married man with years commercial experience as producer-\ndirector is interested in management or a position leading to management. B.S.\nin speech, Northwestern University. Also experienced in promotion, sales, and\nadvertising. Television positions have given him heavy experience in musical,\ndramatic, and religious shows, plus all types of remotes."
}