{
  "id": "d836-90",
  "text": "4.\nJ. FORM ELEVEN\nThis form - printed on yellow paper - is a master sheet contain¬\ning all information given on Forms One through Seven. There is\nadditional space provided (Section Eight) in which the applicant\nwrites his own advertisement which is published in the NAEB\nNewsletter Supplement,\nOne copy of this form is sent to each applicant. Three thou¬\nsand copies of this form were printed,\nK. FORM TWELVE\nThis form is identical with Form Eleven, with the exception that\nit is printed on white paper. This form is to be retained by\nthe applicant for his personal file.\nOne copy of this form is sent to each applicant. Three thou¬\nsand copies of this form were printed.\nL. FORM THIRTEEN\nThis form contains the positions in television and radio desired\nby the applicant. It also contains the location and salary\nrange desired by the applicant.\nOne copy of this form is sent to each applicant. Five thousand\ncopies of this form were printed.\nM. FORM FOURTF'JlN\nThis f01 . contains all particulars relative to a vacancy report\nsuch as hoevcion, name and address of employer, type of position,\nduties so. oified, qualifications desired, salary, and date and\nmet’:ou of notification. On the back of this card is space wherein\nis .ri’ *:v t? e names of the applicants recommend for the position.\nTheso cardv- orm the Vacancy File, Five hundred copies of this\nform wer3 * inted.\nN. FORM FIFE J\nThis f : rms the recommended applicant of the particulars\nof the p itnot at found on Form Fourteen. On the reverse side\nis space ?r. which the applicant informs the Placement Officer\nof his actions in regard to the position.\nOne cop^ of this form is sent to each applicant recommended for\na position. The form is divided into two sections: the top\nsection contains the location of the position and instructions\nas to the procedure the applicant is to follow; on the reverse\nside of this section the applicant indicates the course of action\nhe ha? chosen and returns this section to the Placement Officer.\nThe be’tim section contains the information given on Form Fourteen.\nIf the applicant decides to apply for the position, he retains"
}