{
  "id": "d836-97",
  "text": "11.\nconcern among applicants as to what positions educational television and\nradio offer and what the salary ranges are. It is felt that the Placement\nService should seek to regulate job descriptions as much as possible and\nhave accurate knowledge concerning classification and probable salary ranges\nto be found in educational broadcasting.\nIn line with this thought, the Placement Service has recently taken steps\nwith regard to accomplishing classification and descriptions.\nclassification\nThe first step in establishing a classification of educational broadcasting\npersonnel was the drafting of a temporary classification list. The Place¬\nment Officer, with the generous assistance of NAEB officials, devised such\na list. This list, accompanied by a form letter requesting that appropriate\nentries be made on spaces provided on the list, and further requesting that\nthe list be returned to the Placement Service, was sent to all active and\nassociate members of the NAEB. (This form letter, hereafter referred to as\nForm Letter II, and the accompanying list may be found in Appendix C.)\nAt this time, the Placement Service has received an approximate twenty per\ncent (2C$) response to this request. It is felt that this response is not\nsufficient to warrant the undertaking of the final tabulation and distribu¬\ntion of results. Therefore, it is strongly recommended that those who have\nnot responded be urged to do so as soon as possible. A step in this direction\nwas taken in the March, 1955 Newsletter Supplement. (See Appendix D.)\nDESCRIPTIONS\nForm Letter II contains a paragraph wherein is described the extreme import¬\nance of descriptions and an urgent request is made that if the employer has\nany available he forward a copy of them to the Placement Service, At this\ntime only a few such descriptions have been received mainly, it is felt,\nbecause employers do not have such descriptions available.\nIt is recommended that inquiries be made as to how the Placement Service can\nreceive some type of job descriptions. It is possible that the Placement\nService could contact commercial radio and television broadcasters and\ninquire as to their willingness to cooperate with us; or perhaps the Place¬\nment Service could contact other personnel services or agencies to discover\ntheir means of obtaining these necessary job descriptions. (See Appendix E)\nIt is strongly urged that these descriptions be obtained in the near future,\nfor without them the Placement Service is unable to give one hundred per\ncent service.\nSUMMARY\nThe importance of obtaining these classifications and descriptions has been\nstressed. The original intention of the Placement Service was to have the\nresults tabulated and distributed by April 1, 1955* However, in the light\nof the response received, this tabulation and distribution will have to be\ndelayed for some time. When an adequate number of responses have been\nreceived, it shall be the duty of the Placement Officer to tabulate and\ndistribute by appropriate means the results of the survey. In the course of"
}