{
  "id": "d1229-3",
  "text": "HAEB NEWS LETTER\npage 4\nJanuary 15, 1939\nExperience haa shown that sixty days is the minimum time required for the\nstaff to check and study applications adequately and for the Commissioners\nto give them effective study and consideration.\nUnder the Commission*s rules applications for renewal of station licenses\nmust he filed more than sixty days prior to the expiration date of the\nlicenses. In many instances stations have filed applications late and in\na few the Commission has Jailed to receive any application.\nThe Commission took the view that temporary extensions, even for thirty\ndays, are unwarranted and may not he legally granted where no application\nhas been filed* Licensees must accept full responsibility for filing\ntheir applications in good time and in proper form under the Commission*s\nrule s.\nThe Commission noted that th© following stations are presently tardy with\ntheir applications for renewals. Stations KUSD, Vermilion, South Dakota;\nStation WCBS, Springfield* Illinois; Station WIRE, (Auxiliary Transmitter)\nIndianapolis, Indiana; Station WKAT, Miami Beach, Florida,; Station WC^BC,\nVicksburg, Mississippi; Station KCDM, Stockton, California; Station KIEV,\nGlendale, CRlifvrnjlai fn<l Station WDZ, Tuscola, Illinois.\nAttention Ip* also invited to the fact that the applications for renewal\nof license-* should he completed to reflect actual conditions at the time\nof filin-> applications and ©are must he exercised in copying previous\napplications for renewal of license to determine that any changes in con-\naii^onfj are properly disclosed. It has been the experience of^the Commis¬\nsion that where certain errors appear in an application, the same errors\nappear time after time. This necessitates either returning the application\nor writing the applicant at each renewal period and often necessitates the\ngranting of temporary extension6 while the repeated error is being corrected.\nWhen a licensee holds special authorization permitting operation different\nfrom that authorized by the license itself, (Use of additional time or\npower for temporary or experimental purposes) the application for renewal\nof the regular licehse should be mad© out as thought the station were\noperating under the regular license alone, without the special authoriza¬\ntion. The. operation as it actually occurs under the special authorization\nshould be set forth in an attached letter of transmittal, properly affirmed\nand in the event formal application is required for renewal of the special\nauthorization such application should be filed simultaneously^*\nCHANCELLOR AND P^GIDEHT JOIN IN KOAC APPEAL\nIf the great state-owned radio service agency, KOAC, is lost now through\nencroachment of commercial interests from another state, it probably never\nwill be regained in its present efficiency, Chancellor F. M» Hunter, head\nof the state system of higher education, warned in adding his support to\nthe intensive drive to inform the Oregon congressional dedegatlon of the\ndesires of Oregon people U'\\ respect to KOAC.\nSenator Mc'ka.ry had informed Chancellor Hunter that he had been asked by\nthe chairman of the Federal communications commission to prepare a rep"
}