{
  "id": "d1139-4",
  "text": "NAE8 NEWS LETTER.Page 5.\n\"SCIENCE FIGHTS THE WAR* REVIEWED IN WNYC SERIES\nDECEMBER I, 1943\nPRONT8 ON WHICH \"SC 1ENCE FIGHTS THE WAR” SERVE AS SUBJECTS FOR DISCUSSION\non WNYC1s 8:15 p.m. Friday series in collaboration with the New York Branch\nof the American Association of Scientific Workers, Since scientific\nRESEARCH, ACCELERATED BY WoRLO WaR II, PURSUES MANY LINES, THE BROADCASTS;\nPRESIDED OVER BY Or. SaMUEL KaISER, EDUCATIONAL CHAIRMAN OF THE NEW YORK\nBRANCH OF THE ASSOCIATION, COVER A WIDE RANGE OF INTEREST,\nThe December topics for the \"SCIENCE FIGHTS THE WAR\" Series are typical\nOF THE BREADTH OF THE DISCUSSIONS.\nOn Oecember 3, \"HUMAN FACTORS IN WAR FLYING\" WILL BE REVIEWED BY Or.\nArthur Shapiro, a New York physician who has done research in human\nPHYSIOLOGY AS IT RELATE8 TO THE SUBJECT OF THE BROADCAST, \"THE CHINESE\nINDUSTRIAL COOPERATIVES\" is the topic of the December 10 broadcast, with\nDavid Leacock, engineer and specialist on Chinese problems for Industrial\nCooperatives, Inc.\nScientific sidelights on war-time problems, including famine, will be\ndiscussco on the December 17, \"INDIA AND THE WAR\", program, by G. 8. Lal,\nscience editor of International News Service. On the last December\n\"SCIENCE FIGHTS THE WAR\" BROADCAST, \"POWDER METALLURGY IN INDUSTRY AND AT\nTHE FRONTS\" will be discussed by Dr, Charles J„ Bier, research chemist and\nmetallurgical engineer,\nPhilip T„ Blackwooq, young American bass baritone, is scheduled to do a\nseries of four recitals in December over WNYC, Saturday evenings at 8:30 p.m,\n\"SONGS OF MANY LANDS\" WILL PROVIDE THE MUSIC FOR THE BROADCASTS, AND THE\nFIRST PROGRAM ON DECEMBER 4 WILL BE A GROUP OF AMERICAN SONGS, THE SECOND\na British group, the third a group of French and Russian works ano the\nFINAL BROADCAST IN THE SERIES, ON CHRISTMAS NIGHT WlLL BE A REQUEST PROGRAM\nOF FAVORITE NATIVITY MUSIC. Mr. BLACKWOOD, A GRAOUATE OF WESTMINSTER CHOIR\nCollege, has sung in church choirs throughout New York for several years,\nAND IS PRESENTLY IN THE CHOIR AT THE CHURCH OF THE EPIPHANY. F(>R THE PAST\nSEVEN YEARS HE HAS SUNG WITH THE DESSOFF CHOIRS.\nBegun last year, WNYC’s \"HISTORICAL CYCLE OF MUSIC\" for the piano will\nCONTINUE THIS YEAR, SATURDAYS AT 9 P.M. AS A HALF-HOUR MUNICIPAL CONCERT\nHall feature. As in last year’s Volume I of the series, the \"HISTORICAL\nCYCLE\" WILL HAVE THE SERVICE OF THE TALENTED PIANIST, DAVID StlMER, WHO\nTRACES THE DEVELOPMENT OF KEYBOARD MUSIC FROM ITS BEGINNING WITH ByRO ANO\nRameau in the 16th century, through present day composers. Mr0 Stimer,\nFORMER HOLDER OF THE PHILHARMONIC SCHOLARSHIP FOR STUDY WITH JOSEPH LhEVINE\nANO OF JUILLIARO GRADUATE SCHOLARSHIPS, HAS BEEN FACULTY ACCOMPANIST IN\nTHE *CELLO DEPARTMENT AT JUILLARD AND IS CURRENTLY ON THE STAFF OF WNYC.\nVolume II begins on December 4th, with a broadcast by Mr. Stimer of works\nBY THE 17th CENTURY COMPOSER OF PIANO WORKS, DaNDRIEU. On THE TWO\nSUBSEQUENT SATUROAY NIGHT RECITALS, DECEMBER ItTH ANO S8TH, WORKS OF\nHANDEL WILL BE PLAYED, AND THE FOLLOWING THREE SATURDAY MUSI CALCS (DEC,\n25, Jan. I and 8) will be devoted to music of Bach. Scarlatti will be the\nFEATURED COMPOSER ON THE \"HISTORICAL CYCLE OF MUSIC\" BROADCASTS FOR JAN.\n15 AND 22."
}