{
  "id": "d881-17",
  "text": "Harshfield, H. W. - Agricultural Extension Service, O.S.U.\nHavighurst, Robert J. - General Education Board, 49 W. 29th St.\nNew York City Deshier\nHead, Myrtle - Radio Music, Cleveland Bd. of Ed. De shier\nHeer, A. L. - Kent State University, Kent, Ohio Chittenden\nHeil, Louis - Bur. of Education Research, O.S.U.\nHeinlich, ff. F. - ff 0 S U - Ohio State University\nHellfritzsch, Alvin G. - Univ. of Wisconsin Y-M.C.A.\nHiggy, R. C. - Ohio State University\nHiller, Miss Ola B. - Pontiac Public Schools, Michigan Deshler\nHissong, Clyde - Dean College of Education, Bowling Green State Univ.\nHolmgren, Rob. - Univ. Broadcasting Council, Evanston, Ill. Deshler\nHodcins, Luella - Radio Council Bd. of Ed. , Chicago - 2287 Neil Avenue\nHubbel, E. Gordon - Research Project in School Broadcasting,\nUniv. of Wisconsin, Madison Ft.Hayes\nHuddleston, Richard E. - Univ. of Southern California, Los Angeles Deshler\nJager, Harry A. - Office of Education, Washington D. C. Deshler\nJones, Carleton C. - Bu.of Ed. Res., O.S.U., 70 W. Tulane Rd. Columbus\nJukes, Vincent - Ohio University, 49 Stinson Ave. Athens, 0.\nKeister, Howard W. - Grad. Student, O.S.U. 70 E. 15th Ave.\nKent, Harold W. - Bd. of Education, 228 N.LaSalle St.,Chicago Deshler\nKerbey, McFall - Nat’l Geographic Society, Washington D. C. Deshler\nKirby, E. M. - W S M, Nashville, Term. Deshler\nKisling, Adrian B. - Student, 1641 Indianola Ave., Columbus\nKnope, Mrs. Franklin A. - Am. Assoc. Univ. Women, Rochester,N. Y.\n577 E. North Broadway\nKoon, Cline M. - 1601 21st St.N.W., Washington, D.C. Neil House\nKyvie, Edward - State University of Iowa, Iowa City Neil House\nLang, C. C. ~ 4>-H, Townsend Hall, O.S.U.\nLaPrade, Ernest - Nat’l Broadcasting Co. New York City\n2530 Park Mill R?ad - LA. 8591, $ R.R. Vance\nLardie, Kathleen N. - Detroit Public Schools Deshler\nLawtcn, Sherman P. - Stephens College, Columbia, Mb. Deshler\nLazanfeld, Paul F. - Princeton Radio Research Project Deshler\nLeeke, H. H. - W N A D, Faculty Exchange, Norman, Okla. 1864 Summit St.\nLowdermilk, R. R. - Bureau of Ed. Res., O.S.U., 163 E. Norwich Ave.\nLundquist, Harold L. - W M B I, Chicago\nMcCarty, Harold B. - W HA, Wisconsin State Station Deshler\nMcClain, Louise - Extension Service, Steubenville, Ohio\nMcOutchen, S. P. - Prog. Educ. Assn., Ohio State\nMcNeill, Mrs. Geo. A. - A. A. U. W. Rochester Branch 577 E. N.Broadway\nMangner, Ted1 - College of Agr., Univ. of Illinois, Champaign Deshler\nSchenectady, N.Y. Fort Hayes\nMarkham, G. Emerson - General Electric Co.\nMarkham, Mrs. G. Emerson\nMarshall, John - Rockefeller Foundation, N.Y.City\nMartin, Eleanor Hall - K W K, Saint Louis, Missouri\nMathews, L. H.‘ - Wisconsin Project School Broadcasting\nMay, Earle C. - Research Pro j., Univ. of Wisconsin\nMelvin, John H. - 713 Franklin Ave., Columbus\nMenzer, Carl - Station W S U I, State Univ. of Iowa\nMiles, J. Robert - Bureau of Ed. Research, 0.S-U.\nMiller, Allen - Univ. Broadcasting Council, Chicago.\nDeshler\nNeil House\nY.M.C.A.\nY.M.C.A.\nDeshler\nDeshler\nMiller, John W. - Ohio State University, 240 S. Hague Ave., Columbus"
}