{
  "id": "d1089-1",
  "text": "President’s Page—-II\nYour President and Executive Director were among recent conferees with some\nnational foundation representatives looking toward, we hope, greater.help for the\ndevelopment of educational TV in the U.S.A. More when there’s more to tell.\nIf you have been real discerning, and I know you are, you have noted that the\nPresident has failed to appoint or reappoint the committee on the constitution\nand by-laws. This action, or inaction, is by design. I’d better explain before\nsomeone says that guy Schooley is lazy, or scheming or something. Anyway, the\nproblem and possible solutions have been much in mind. In fact, I may address\nmyself to the total problem in the next Newsletter, or I may make a special\nmailing on some of my proposals. I really hope, and believe, that we can iron\nout most,if not all,of our considerations before the 1955 Convention. At least,\nwind it all up at the convention. So, bear with me a little while longer. I\nshall return—to the subject.\nIncidentally, things are really moving along on the plans for the 1955 Convention\n•at the Del Prado hotel, Chicago. Dates, again, are October 26-29. You11 really\nlike what's being planned. And more, you’ll like just how seriously the committee\nis working toward making provision for all the things you want included. There 11\nbe time for business, for radio, for television, for evaluating radio and TV „\nprograms, and for good speakers. Already, some of the nation's top persons have\nagreed, but I hope you’ll forgive me if I don’t reveal the whole story now. We\nstill have much to do, and when dope is in shape you’ll be hearing directly from\nChairman A1 Partridge/ If you think I’m enthusiastic, I ami Better make your\nplans now. Save those dates ’ Be there I *\nIf you're over in Champaign-Urbana, don’t fail to visit with us. That means\nHeadquarters. That means us. The Schooleys are in Champaign, and often at\nhome. As we go to press the President and his wife are momentarily expecting\ntheir sixth. No news to 1954 conventioneers, eh.\n—Frank E. Schooley"
}