{
  "id": "d1645-0",
  "text": "rv\n■n aeb\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 28, NO. 6\nJUNE, 1963\nACBB to Convene at IERT\nThe annual convention of the American Council for Better\nBroadcasts will be June 12 in Columbus, Ohio, coinciding\nwith opening day of the IERT. Main topics of the day will\nbe: “The Place of the Local Newscaster in the Community,”\n“The Case of the High-Brow Program,” “Citizens’ Efforts\nto Improve Programing,” “How Radio and TV Improve\nWorld Understanding” and “Satellites: Window on the\nWorld? or Pie in the Sky?’” Robert D. Swezey, director,\nCode Authority of the NAB, will speak at the noon luncheon,\non “Safeguarding the Rights of the Public in Broadcasting.”\nFor luncheon reservations, send a check for $2.75 to Leslie\nSpence, Nationwide Inn, Columbus, Ohio.\nJournal to Inaugurate Production Forum\n“Production Forum” is the name of a column which will\ndebut in the July-August issue of the NAEB Journal. The\ncolumn will be devoted to an exchange of production tips for\neducational television and radio. Michael Ziegler, who sug¬\ngested the column, will compile the copy for each issue, based\non contributions received from production personnel across\nthe country. Write to Michael J. Ziegler, TV Production Spe¬\ncialist, 111C Carnegie Hall, Pennsylvania State University,\nUniversity Park, Pennsylvania.\nOver 200 Attend IB Conference\nSome 211 persons from across the United States (Canada,\nIsrael, and the island of Truk were also represented) met\nMay 13-15 at the University of Illinois to attend the NAEB\nconference on instructiqnal broadcasting. The main topics\nunder consideration were: “Application of Principles of\nLearning to Instructional Broadcasting,” “Uses and Utiliza¬\ntion of Television,” “Creative Production for Instruction,”\n“The Role of Radio in Instruction,” “Faculty Rights and\nCompensation,” and “Manpower and Training.”\nThere were special technical sessions concerning on-air and\nclosed-circuit, portable TV tape recorders as instructional\ntools, and the telephone industry’s role in ITV. Attendees\nsplit into three groups to discuss TV councils and networks;\nthe classroom teacher’s role, teacher training, utilization; and\nutilization in higher education.\nI'heodore Conant, of the Ford Foundation, delivered an\naddress on creative ideas from abroad for ITV programing.\nNAEB President William Harley, together with James Miles,\nRegion III Radio Board member, presented a plan for re¬\norganization of the NAEB. Miles said the plan was still in\na formative stage—but that hopefully it will be ready for\nsubmission to the membership for approval prior to the na¬\ntional convention in November.\nProceedings of the instructional broadcasting meeting will\nn be printed as soon as possible, for distribution to those who\nregistered for the conference. A limited number of copies will\nbe available for sale to others, and the Newsletter will carr^\nan announcement when these are ready.\nGemutlichkeit to Pervade Convention\nWord comes from Milwaukee that the Gemutlichkeit (Mer-\nriam-Webster: “Geniality; easy-going kindliness and good\nnature . . .”) for which that city is famous will be ever¬\npresent during the NAEB convention there November 17-21.\nNAEB staffers Harold Hill and Mrs. Ann Bradley were in\nMilwaukee in May to work on convention plans, and they re¬\nport the following:\n• Format for NAEB business sessions will be the same as\nlast year. There will be a general business session on Monday,\nat which members will hear and discuss problems which will\nbe voted on at the final business session. On Tuesday, there\nwill be regional meetings at which members can query their\nrepresentatives on the Board. The final, “voting” business\nsession will be on Wednesday. Main item to be considered\nwill be the structural reorganization of the NAEB.\n• Every session will have a “producer,” something new this\nyear.\n• Following the suggestions of those who answered the ques¬\ntionnaire re the 1962 convention, there will be more opportuni¬\nty for concurrent group meetings for those interested in radio\nstations, TV stations, and formal instructional broadcasting.\n• The always-popular special-interest sessions will be on in\nfull force this year. Some of the topics scheduled are: in¬\nstructional radio, graphic arts, music for radio, public affairs\nbroadcasting, legal problems, technical session for nontechnical\npeople, instructional television, TV teacher training, school\nbroadcasting in developing nations, etc.\n9 Registration will begin at noon on Sunday, November 17,\nwith Gemutlichkeit, free to convention registrants, from 6 to\n10 p.m. Gemutlichkeit Revisited is on the program for Tues¬\nday evening, and the convention will end with the banquet on\nWednesday evening.\n0 Engineers will have an all-day technical session running\nconcurrently with one day’s convention activities. [See item\non page 2.]\nNetwork Offers Exclusives on Birmingham\n“Dick Gregory in Birmingham” and “Birmingham: Testament\nto Non-Violence” are two specials currently offered to NAEB\nRadio Network stations. The former is an exclusive, recorded\nby personnel of Riverside Church Station WRVR, New York\nCity, as Gregory spoke on May 10. The latter is a series of\nsix hour-long documentaries containing material from on-the-\nspot recordings as events occurred during the Birmingham\ncrisis. WRVR men who were on the scene are: Jack Summer-\nfield, general manager; Walter Nixon, news and public af¬\nfairs director; and the Reverend Robert L. Polk, minister to\nyouth at the Riverside Church.\nInstitutional Directory to be Revised\nWork has started on the NAEB Directory of Institutional\nMembers. Any changes or corrections should be sent to the\nUrbana NAEB office by July 1 in order to be included. Send\nto Mrs. Dorothy Templeton, NAEB, 119 Gregory Hall, Ur¬\nbana, Illinois.\n1"
}