{
  "id": "d1645-2",
  "text": "NAEB Sudan Engineer Returns to Iowa\nAs we go to press, Clarence D. Phillips, studio engineer for\nthe NAEB Sudan project, is expected back on the campus\nof the State University of Iowa by June 1. He has com¬\npleted a two-year assignment for the Sudanese radio facility,\nin which he was a consultant and also trained native personnel\nin basic electronics and in operating and maintaining studio\nand control room equipment. He was on leave from his Iowa\npost of chief engineer of the TV center.\nCompetition for Fulbright Awards Now Open\nAwards for university lecturing in fields of interest to NAEB-\ners are being offered for the academic year 1964-65 under\nprovisions of the Fulbright-Hays Act. Eligibility requirements\ninclude U. S. citizenship, a minimum of one year of college\nteaching experience, and in certain cases, a knowledge of the\nlanguage of the host country.\nCompetition for the awards is open now and will close\nAugust 1, 1963. For information and application forms, write\nto: Committee on International Exchange of Persons, Con¬\nference Board of Associated Research Councils, 2101 Consti¬\ntution Avenue, N. W., Washington 25, D. C.\n• Ethiopia, journalism, October 1964-July 1965. Program in\njournalism is directed toward providing adequate numbers of\nwell-trained young people to staff newspapers, magazines,\nradio, television, and advertising organizations as these de¬\nvelop in Ethiopia. Visiting scholar will be affiliated with\nHaile Selassie I University, founded December, 1961. As¬\nsignment details not available in announcement; will be sup¬\nplied on request.\n• Ghana, visual aids, September 1964-June 1965. An experi¬\nenced lecturer to advise the Institute of Education, University\nof Ghana, on new aspects and techniques of visual aids in edu¬\ncation.\n• The Philippines, teacher education, August 1964-May 1965.\nA lecturer with competence and experience in educational tele¬\nvision relating to teaching at the elementary, secondary, or col¬\nlegiate levels. Affiliation with the Ateneo de Manila, with\nsome lecturing and consulting in other institutions in the\nManila area.\n• Thailand, journalism, May 1964-April 1965. Thammasal\nUniversity, Bangkok. This is the only institution of higher\nlearning in Thailand that offers instruction in journalism. Re¬\nquested is a lecturer qualified to assist in the development of\nthe curriculum and to train potential Thai instructors in the\nfield. Among the subjects on which courses would be welcome\nare: history, organization, techniques, and responsibilities of\nmass communication media; history and principles of journal¬\nism; reporting; news editing; radio and television journalism;\neditorial writing. Lecturer may be invited to stay a second\nyear provided the. arrangement is mutually satisfactory.\nTV Combats Human Obsolescence\nAt a recent FCC inquiry in Omaha, Dr. Paul Miller, super¬\nintendent of Omaha schools, said that television offers a way\nto combat increasing human obsolescence. He said that the\npopulation explosion is easily explained and has been drama¬\ntized over the past three years; therefore the public is in¬\nformed. Though less well known, the explosion of knowledge\nis equally dramatic, he said. Considering that the population\nis doubling every forty-two years and knowledge is doubling\nevery twelve years, he said, the adult population will become\nobsolete within a decade after graduation; therefore, TV as\na medium of adult education has a responsibility to keep the\ngeneral population up to date and running abreast of the\nknowledge explosion. In addition, he commented that since\nsurveys show that children watch TV about thirty-seven hours\na week (which is more than they attend school, he noted), the\neducational content of programs should be reviewed in order\nto help schools also keep children abreast of this knowledge\nexplosion.\nNAEB' Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W., Washington 36, D. C. Phone 667-6000 Area Code 202.\nSPECIAL PUBLICATION OFFER\nFor the next two months, you may purchase the following\nNAEB publications at the reduced rate of two for $1.50 or all\nfour for $2.50. Please order by number.\nR-17: Conducting a Telephone Coincidental Survey.\nResearch Project Report ff4—Samuel L. Becker. A study\nof the telephone survey of listeners to educational broad¬\ncasting, December, 1958. 15 pages.\nS-24: High School Radio & TV Curriculum Guide.\nA guide published by the NAEB in cooperation with the\nMichigan Speech Association, 1959. By Ethel F. Tincher,\nEdward Stasheff, and Edgar E. Willis. 38 pages.\nW-I8a: Children and Television.\nAn annotated bibliography of articles, reports, books, etc.,\ndealing with the effects of TV on children. By Dale B.\nHarris, June, 1959. 50 pages.\nW-26: NAEB Research Seminar for Educational Television and\nRadio.\nReport of the research seminar for educational TV and\nradio, Ohio State University, December 9-13, 1957, for\nresearch specialists in educational broadcasting. I. Keith\nTyler, editor. 31 pages.\nPAYMENT MUST ACCOMPANY ORDER. Send to Special\nPublications, NAEBi, I 19 Gregory Hall, Urbana, Illinois. THIS\nOFFER EXPIRES AUGUST I, 1963.\nPublications\nO Tieline is a new mimeographed publication of the Great\nLakes Region of the Intercollegiate Broadcasting System. The\neditors are soliciting papers, articles, and book reviews of in¬\nterest to college broadcasters. Tom Bletcher, regional direc¬\ntor, writes that mimeograph masters are to be typed by the\nauthors; a complete author’s guide will be sent to interested\nparties. Write to him at 500 East William, Ann Arbor, Michi¬\ngan.\n• Carl H. Hendershot, coordinator of improvement, Delta\nCollege, has just published a bibliography called Programmed\nLearning: A Bibliography of Programs and Presentation De¬\nvices. The bibliographies are available at $2 each, postpaid,\nfrom Delta College, University Center, Michigan.\nNew NAEBers\nASSOCIATE\nAnaheim City School District, Anaheim, California; Charlotte-\nMecklenburg Board of Education, Charlotte, North Carolina;\nFlorida Atlantic University, Boca Raton, Florida; Winthrop\nCollege, Rock Hill, South Carolina.\nINDIVIDUALS\nCharles R. Baddorf, Jr., Harrisburg, Pennsylvania; Rey\nBarnes, Iowa City; M. Virginia Biggy, Cambridge, Massachu¬\nsetts ; Junius Brantley, Birmingham; William R. Buccalo, Co¬\nlumbus, Ohio; Edwin G. Cohen, New York; Father Francis\nConklin, S.J., New Haven; Jeanne L. Davis, Garrison, New\nYork; Lyle W. Durham, Urbana, Illinois; Ronald Eckel,\nWashington; James Edgy, Middletown, Connecticut; J. W.\nEnglish, Chicago; Sean G. Finnegan, Madison; Linden Ann\nFisher, Athens, Ohio; Robert W. Fox, Austin, Texas; Rob¬\nert A. Fredrickson, Chapel Hill; W. T. Gladmon, Pittsburgh;\nArchie M. Greer, Athens, Ohio; Peter Alexander Haggart,\nLawrence, Kansas; Maxine Haleff, New York; Austin A.\nHarrison, Weston, Massachusetts; K. Duane Hurley, Salem,\nWest Virginia; Gene Koskey, Bloomington, Indiana; Dr.\nMaria Lacayo, Tallahassee; Christopher S. Larke, San Fran¬\ncisco; Harry Leibowitz, Brooklyn; Hal G. Lord, Littleton,\nColorado; Joseph O. Loretan, Brooklyn; Donald A. Lubitz,\nHonolulu; Morris A. Mayers, New York; Jean Mosier, Cin¬\ncinnati; Bruce W. Nelan, New York; Charles M. Northrip,\nGainesville; Donald T. O’Brien, Des Moines; Frank W.\nOglesbee, Tulsa; Billy B. Oxley, San Antonio; Marjorie Ann\nPalmer, Adrian, Michigan; Warren Sells Park, Jr., Derry\nVillage, New Hampshire; Richard L. Parker, Tulsa; Ralph\nE. Patterson, Munich, Germany; William B. Perrin, Jr., Mil¬\nwaukee ; Kenneth Polyak, Columbus, Ohio; Stuart Roe, Los\nJUNE, 1963\n3"
}