{
  "id": "d1645-4",
  "text": "over other program material. (See photo.)\nA third device, accomplished by simple circuitry,\nis a means of reducing normal picture information to\noutline form for animated supers. This process cer¬\ntainly has some interesting possibilities since it pro¬\nvides a means of reducing normal picture information\nto a pencil drawing or to a white outline which may\nbe supered over other picture information.\nMr. Southworth will be happy to correspond with\nanyone in NAEB who is interested in these or other\nspecial effects devices of a similar or related nature.\nIf you are interested in more detail, write to him in\ncare of KWSC, State College of Washington, Pullman,\nWash.\n* * * *\nWe have available a very practical eight-page\npaper on “Kinescope Recording,” written by Mr.\nSouthworth, which we are mailing to chief engineers\nof ETV stations and production centers. This paper\nwas written from his experience at the Army Signal\nCorps’ television center at Ft. Gordon, Georgia, where\nhis kinescope work covered a year’s time and some\nfifty TV shows. We have extra copies, which we will\nbe glad to send to others upon request.\n* * * *\nIn the mailing mentioned above, we are also send¬\ning a very fine booklet on “Television Signal Anal¬\nysis,” prepared by the American Telephone and Tele¬\ngraph Co. To quote from its introduction, “this book¬\nlet was written especially for telephone employees\nconcerned with the analysis of television signals\ntransmitted over AT&T facilities. Its principal\nobjective is to promote a common understanding of\nboth signal forms and their nomenclature.”\n“It first discusses satisfactory monochrome and\ncolor television signals as they appear in standard\noscilloscope and picture monitor representations.\nVarious types of test signals are also discussed'. The\nmajor types of video signal impairments are then\nlisted and each type is considered separately. Sig¬\nnificant features, as they appear to monitoring ob¬\nservers in both oscilloscope and picture monitor pre¬\nsentations, are illustrated and discussed. Finally, a\nglossary of video terms is presented.”\nWe will have available only enough copies for\nchief engineers. Others who wish copies of this highly\ninformative booklet may address their requests to:\nMr. F. R. Mac Farland, Division Commercial Man¬\nager, American Telephone and Telegraph Co., 250\nPark Ave., New York 17, N. Y.\n* * * *\nThe April 1957 Journal of the Society of Motion\nPicture and Television Engineers contains three pa¬\npers on Video Tape Recorder Design. They constitute\nthe first published technical discussions of the Ampex\nvideo tape recording system. Various problems en¬\ncountered in the development are discussed and the\nsteps taken toward solutions are described in detail.\nTitles of the papers are “Comprehensive Description\nof the Ampex Video Tape Recorder,” by Charles P\nGrusberg; “The Modulation System of the Ampex\nVideo Tape Recorder,” by Charles E. Anderson;\n“Rotary Head Switching System in the Ampex Video\nTape Recorder,” by Ray M. Dolby.\nIn the same issue of the SMPTE Journal, there is\nan excellent discussion of “Techniques of Television\nLighting,” by David Thayer of the Television Center,\nState University of Iowa, Iowa City, Iowa.\n* * * *\nAn interesting paper in the July 1957 SMPTE\nJournal describes a system of “Wide Screen Tele¬\nvision,” by Seymour Rosin and Madison Cawein. In\nthis system, known as “Scanoscope,” the conventional\n4x3 television aspect ratio is changed to an 8 x 3\npresentation. A “Scanoscope” lens is used on the\ncamera to squeeze the image on the image orthicon\nfrom which it is transmitted over a 9 me bandwidth\nsystem. At the television monitor, the image is un¬\nsqueezed electronically.\nThe July SMPTE Journal also contains a listing of\nU. S. colleges and universities offering courses in\nmotion picture introduction. This report by Desmond\nP. Wedberg, editor of Film and A-V World magazine\nalso gives a detailed listing of M-P courses. A future\narticle will cover television instruction.\n* * * *\nRobert F. Lewis of WFBE at Flint, Mich., sends\nalong a tip ou installing coaxial connectors on\nRG59/U cable. He states that he has found it un¬\nnecessary to solder the shield of the cable when using\nPL259 plugs and UG176/U reducing adapters. Here\nis his method:\n“After stripping the outer polyethylene jacket\nAUGUST, 1957\n5"
}