{
  "id": "d561-112",
  "text": "SYRACUSE UNIVERSITY\nSYRACUSE,NEW YORK 15210\nWAER • 8 8.3 MCS\nAffiliate Station of the Educational Radio Network\nand the National Association of Educational Broadcasters\nMr. Jerrold Sandler, Executive Director\nNational Educational Radio\n13**6 Connecticut Avenue, N. W.\nWashington, D. C. 20036\nDecember 12, 1966\nDear Hr. Sandler:\nThank you very much for your recent letter and all the helpful enclosures which\npertained directly to my study of educational FM radio. The materials were useful\nto me in organizing background information on the exciting new developments in\nthis field. My immediate objective was to organize the information into a 17-\npage term paper for a graduate course, \"Television-Radio in Education,\" which I\nam taking in my Fh.D. program. X then summarized about the last half of the\npaper and submitted my own comments to the FCC in response to that agency1s recent\nNotice of Inquiry. A copy of this is enclosed.\nI have every interest in carrying this inquiry further — possibly to the extern,\nof sitting down with somebody here in New Ygrk state and in other states and\ndrawing up our specific statewide allocations tables for educational FM. I plan\nto contact Mr. King and Dr. Cooper in the near future. I would hope that the\nmethod of assigning channels would proceed according to ny \"Priorities\" (see pp.\n5-6), with special attention given to assigning channels to towns containing\ncolleges and universities not now operating FM stations.\nWhile some of ny recommendations — which are mine alone and not Syracuse\nUniversity’s_may appear a bit harsh for educational FM, I feel that only by\ntightened standards imposed by government does this portion of the broadcast\nspectrum stand any prospect of reaching its potential. That’s why I’m so willing\nto go along with the FCC’s idea that 10-watters are a waste of spectrum space; why I feel\nthat educational FM’s should maintain a minimum 36-hour weekly schedule; that\ndaytime school-board-licensed stations do not serve the public interest.\nIt is encouraging to note that, with your efforts, educational radio may be\nincluded in the ETV Facilities Act. I’d be glad to supply any information or\nideas for which you might anticipate a need. One thing I did for my report was\nto draw on a large map of the United States the land-area coverage of the 3*5\neducational FM stations, using the 50 uv/m contours of all except the 10-watters\n(which were only underlined). If such documents are not otherwise available, I\ncould probably send you my copy.\nIt will be a pleasure to hear from you regarding the progress you achieve on\nbehalf of educational FM, and I’ll pledge ay assistance at this end.\nSincerely,"
}