{
  "id": "d561-137",
  "text": "4. Classes of StatIons and Limitations. We do not endorse the pro¬\nposal to limit the power of educational stations. (I) Some areas In the\nSouth will be without service even though assignments will be made. Some\nareas are economically unable to support an operation even on a small scale.\nTherefore greater coverage from the metropolitan areas should be allowed In\norder to provide some service to these less developed communities. (2) In\nTennessee a network would be greatly enhanced If (a) greater coverage were\nallowed for \"off-the-alr\" Interconnection and (b) sub-carrier authorization\nwere made to provide a \"feed-back\" circuit between stations. Since effective\narea coverage Is reduced by sub-carrier operation, greater power should be\nallowed to facilitate Interconnection. In addition, due to the nature of FM\ntransmission there are inherent limitations on the area covered no matter how\nmuch power Is used. Therefore any arbitrary limitations would be superflous.\nTo adequately serve rural communities while meeting network requirements, we\npropose that no operating power limitations be set for educational stations,\nexcept those that are presently In effect.\n5. 10-Watt Stations. We support the proposals regarding 10-watt\noperations. We believe this would be an Improvement In the use of this medium.\nHowever, we would urge the Commission to give every possible opportunity to all\n10-watt licensees to meet the proposed standards. From experience, we realize\nthat it takes time to mobilize a staff and equipment to operate at the levels\nIndicated in the proposals. While we have been able to develop much more\nrapidly than we anticipated at the start of our program, we have had more for¬\ntuitous circumstances than most stations now In existence. For this reason we\nwould demur with regard to the brevity of the period allowed licensees to meet\nthe proposed standards. We suggest that a system be established whereby the\nlicensee might demonstrate progress toward meeting these standards, thereby\nlengthening the apprenticeship period.\n6. and 7. 10-Watt Channel Assignment and Interference to TV Channel 6,\nWe would be amiable to the Idea that 10-watt stations be restricted to channels\n201 through 204 where development Is a criterion and Interference with channel 6\nIs not a problem.\n8. Translators. We support the view of the Commission.\n9, 10, II, 12. No comment.\nSUBMITTED BY; THE PUBLIC LIBRARY OF NASHVILLE AND\nDAVIDSON COUNTY\nDATE; DECEMBER 16, 1966\nSIGNATURE;"
}