{
  "id": "d561-140",
  "text": "FCC Comment—page 3.\nFinally, the University endorses the Commission proposal that additional channels be\nallocated to communities beyond the channels needed for networking, and endorses the pro¬\nposed assignments listed on page 2 of the Notice of Inquiry.\n4. Classes of Stations and Limitations. The University endorses in general the\nCommission intention to apply the same standards to educational FM in the matters of\nclass, power, antenna heights, and separations as now apply to commercial FM. But it\nis important that present educational FM stations on Channels 201, 204, 206, 208, and\n216 be permitted to continue using facilities greater than those for new Class A stations,\nwhich matter would appear to be clearly the Commission’s intention.\n5. 10 Watt Stations. While the matter of 10 watt stations is of no proprietary\ninterest to the University, a regard for the entire state of educational radio requires that\nthe University endorse the Commission view that restriction of 10 watt licenses will be\nnecessary as educational radio stations increase.\nThe University demurs, however, on the proposal under Paragraph 5(1), admitting\nno further authorization of 10 watt stations. Even with the provision that waiver might be\nmade of this rule, such a rule would surely deter smaller institutions from entering the\neducational radio field. It is clearly the experience in Tennessee that modest facilities\nenable an institution to build staff and faculty support to the point where quite large\nfacilities may be acquired in three to five years. It is unlikely in some cases that larger\nfacilities would be acquired at the outset without prior experience and acceptance of radio\nusage in education.\nThe University endorses the Commission alternative proposal under Paragraph 5\n(2), allowing existing 10 watt stations to continue to operate on this basis for a time. It\nis necessary that the University demur, however, on allowing such continuation only\nthrough the existing license period. It is possible that rule making procedures would be\ncompleted within a year or less of the end of a station’s license period, and such a short\nperiod cf time to change to higher power would prove a hardship to most 10 watt stations.\nIt is proposed, therefore, that 10 watt stations be permitted to operate on that basis for the\nremainder of the license period, plus one additional license period before going to higher\npower.\nThe University also endorses in general the proposal under Paragraph 5 (3) to\ndelete one or more 10 watt assignments for regular assignments elsewhere, and to\nrequire the 10 watt licensee to indicate that an application will be made for higher power.\nBut again the time limit on such application should not just be to the end of the present\nlicense period, but through the present period plus one more."
}