{
  "id": "d561-16",
  "text": "PINELLAS COUNTY\nfff\nv\nBOARD OF PUBLIC INSTRUCT-ION'\nJAMES F. GOLLATTSCHECK\nACTING SUPERINTENDENT\nSCHOOL ADMINISTRATION BUILDING\n1960 EAST DRUID ROAD\nCLEARWATER. FLORIDA 33517\nDecember 7, 1966\nN\nMRS. MILDRED DAY\nRON FISHER\nMRS. JANE S. MANSON\nMRS. KATHARINE F. PROWSE\nMRS. MARJORIE WHITLEY\n'Vv\nMr. Ben F. Waple, Secretary\nFederal Communications Commission\nWashington, D.C. 20554\nDear Mr. Waple:\nI read with considerable interest the Notice of Inquiry relating to Docket Number\n14185 in the matter of \"Revision of FM Broadcast Rules, Particularly as to Allocation\nand Technical Standards (Educational FM Channels)\" and wish to submit the following\ncomments at your request.\nI believe it to be of relevance to state at this time that I am preparing to recommend\nto the Pinellas County Board of Public Instruction that it authorize the application for\na noncommercial, educational FM channel to be used to provide instructional and\nsupplementary materials for elementary, secondary, and junior college classroom\nlistening, as well as to enrich our Pinellas County adult education and community\nservice programs.\nThe Consulting Engineer engaged to perform the technical studies necessary, Mr. E. H.\nMunn, Jr., has recommended that we apply for channel 213, 90.5 MHz, with an\neffective radiated power of 38 Kw, from Pinellas Park, Florida, located midway\nbetween St. Petersburg and Clearwater, the two major concentrations of population\nto be served by the proposed station.\nAs the membership of the Board of Public Instruction will change in January, 1967,\nI shall take my recommendation to it as soon thereafter as is deemed feasible. Upon\nits approval, I shall submit FCC Form 340, technical sections of which have already\nbeen completed.\nI commend your efforts to encourage the establishment of state-wide radio networks.\nIndeed, I believe there is being formulated a feasibility study whose concept details\na live, interconnected radio network of educational radio stations throughout the\nState of Florida. The plan calls for a station to be located on the campus of each of\nthe twenty-six junior colleges."
}