{
  "id": "d561-18",
  "text": "FLOYD T. CHRISTIAN\nSUPCRINTCNDCNT\nState of Florida\nMr. Ben Waple, Secretary\nFederal Communications Commission\nWashington, D. C. 2055^\nBear Mr. Waple:\nIn response to your Notice of Inquiry pertaining to Docket Number 14185 in the\nmatter of \"Revision of FM Broadcast Rules, Particularly as to Allocation and\nTechnical Standards (Educational FM Channels),\" I should like to file these\ncomments with the Federal Communications Commission.\nThe State of Florida has long been interested in educational broadcasting as\nevidenced by the number of educational radio and television stations now in\noperation and from our state-wide plan for interconnection of educational television\nstations•\nI heartily agree with the Commission^ aim of stimulating the growth of state-wide\nand regional educational radio networks by its assignment of a Table of Allocations\nthroughout the country.\nThe one plan that I am presently aware of dealing with providing state-wide\neducational radio coverage for the State of Florida has as its basis the situating\nof an educational radio station on the campus of each one of our twenty-six\njunior colleges. The plan calls for live interconnection of these stations.\nA wide range of advantages could accrue from such a plan. Using the Junior college\nsystem would give a measure of unity and standardization of operation to the net¬\nwork and could veil servo to further otate-vide objectives in education. In\naddition, it would not Jeopardize the service of tho six educational radio stations\nnow broadcasting in Florida.\nMay I therefore request the Commission^ consideration of reserving noncommercial,\neducational FM Channels in the following locations: Pensacola, Valparaiso,\nPanama City, Mariana, Tallahassee, Madison, Lake City, Jacksonville, Palatka,\nGainesville, Ocala, Daytona Beach, Sanford, Leesburg, Cocoa, Bartow, Pinellas Park,\nBradenton, Avon Park, Fort Pierce, Palm Beach, Fort Myers, Fort Lauderdale, Miami,\nKey West and Tampa."
}