{
  "id": "d561-36",
  "text": "- 3 -\n6) The initial capital expenses for WNTH did not exceed $10,000, exclusive\nof real estate and other fixed assets owned \"by the Board of Education. It\nhas been demonstrated that our ten-watt installation was indeed feasible within\nthe above cost figure, and that the station can be operated effectively for the\nbenefit of the entire township at an annual operating budget of approximately\n$1,600. For the past six years WNTH has aired approximately 45-60 hours of\nprogramming each week during the school year within this,budget allowance.\n7) It is clear that increased hours of programming, as implied in the Docket,\nwill result in production costs which will be entirely unjustifiable to the\nschool administration. It is already difficult under the present scope of the\noperation to engage in original program production at the secondary school level.\nLenghthening the broadcast day and year would result in cost increases necessitated\nby expenditures for taped programs, additional production and operating personnel\nbeyond the budgetary limitations of the average school system.\n8) We are confident that the technical problems of co-channel spacing and\noverlapping of coverage areas as discussed in Docket No. l4l85 are\ncapable of full solution within the existing frequency, spectrum without\nmaking it mandatory that low-power stations raise their effective radiated\npower to the proposed minimums specified in the Docket or suffer the alter¬\nnative of resigning their frequency allocations. The harmonic relationship\nof television Channel 6 does appear to present problems in certain geographic\nlocations for both the television station and the radio broadcaster. (We sub¬\nmit that these problems can be solved in the best interest of the general\npublic without forcing the low-power FM broadcaster off the air). In the\ncase of WNTH no problem exists, since the nearest user of Channel 6 is\nlocated in Milwaukee, Wisconsin, approximately 70 miles distant and this\nchannel does not serve the Chicago metropolitan area. Other radio stations\nin this immediate region which operate, as does WNTH, on 88.1 megacycles,,\nhave not caused interference to WNTH, nor, have we reason to believe that\nWNTH has interfered within the primary coverage area of any other radio\nstation with a signal on the same frequency.\n9) If the proposals in Docket No. l4l85 are put into Rule form and compliance\nwith certain commercial station standards were mandatory, an additional hard¬\nship would be created for WNTH. The station is presently enabled to utilize"
}