{
  "id": "d561-5",
  "text": "Page 3\nnot be done. All of the basic technical standards applying to a commercial FM\nstation would also be applied to this type of a non-commercial station except\nfor the number of hours of operation. The number of hours of operation would\nbe a minimum of 10 hours of operation. The number of hours of operation would\nbe a minimum of 10 hours per vTeek and this would be reviewed at the license\nrenewal times where competing applications were on file for the same frequency.\nThe technical recuirement requiring a person holding a Radio-Telephone First-\nClass Engineering license to be on the station staff or under contract, so that\nhe checks the eouipment daily, should be modified to require that he do only\nmaintenance work on the transmitter and check the operating condition of the\neouipment monthly, or at other times when it is believed to be operating ab¬\nnormally.\nMany colleges and schools have licenses for 10 watt stations but do not use\nthe facility except for an occasional period during the year. It would seem that\nat the normal license review time, the FCC should require the station to be\noperated sufficient hours during a year to be of service to the community. This\nreouirement could be an easy one for most operators to meet possibly 10 hours per\nweek that the college or school is operating during the normal school year.\nIt is felt that the assignment of specific FM channels to communities would\nnot necessarily be detrimental except where the educational institutions' are\nnear a major metropolitan market. In these cases, with the licensee showing just\ncause as to the need of additional channel allocation, additional channels could\nbe allocated. Example: a community of 10,000 population, which is a suburban\ncommunity, and has three colleges, could request additional frequencies to have\none for each college and possibly one for the public school.\nIn many current cases, the support for station's operations and new\nequipment is inadequate for anything.except the smallest and most limited 10"
}