{
  "id": "d561-52",
  "text": "November 23, 1966\nHr. Donald W. Ickes,\nWJJTH Radio\nHew Trier Township High School\nWinnetka, Ill.\nDear Mr. Ickes:\nI appreciate your concern over the possible implications of the\nPCC Notice of Inquiry dated November 14, 1966. Having discussed\nat great length with the FCC officials responsible, prior to the\nIssuance of this notice, I can assure you that there is no\nIntent to eliminate the 10—watt stations performing a real Job\nof service to schools and the local community. There are,\nunfortunately, too many instances of ten-watters operating as\npurveyors of \"routine light entertainment\" and showing little or\nno concern for community needs above and beyond the training or\npersonal gratification of a small number of students. Further,\nthere are instances in which, given the proper stimulation and\nfunds, ten-watt stations would be able to increase power in order\nto broaden their service to schools or the community. With this\nIn mind, HSR has supported the FCC Notice in the hopes that such\nan inquiry will influence the \"delinquents\" to become more\nresponsible broadcasters or free their reserved channels for\nothers who want to do the job better.\nWhat should be done now? First, reply to the Notice in as much\ndetail as you are able demonstrating the services performed by\nWNTHj indicate what additional services might be performed if\nadditional power (and the funds to make this possible) were\navailable; be sure to send a copy of your comments to Jerry\nSandler at the HSR office in Washington. Second, since NER is\nworking simultaneously to get federal legislation passed which\ncould bring financial benefit to educational radio stations in\nthis country, document the story of your achievements *»nd your\nplans or hopes for the future In as much detail as possible and\nforward these to Sandler. Such evidence of service should be in\nhis hands by the first of the year If at all possible.\nA number of station managers from Region III are meeting at 9 AM,\nMonday, December 12 in John Regnell's room in the La Salle Hotel\nIn Chicago to discuss the appropriate documentation needed to\nsupport our legislative demands. If you are free, we would be more\nthan happy to have you join us. We intend to break up shortly\nafter lunch. In any event, be assured that I and HER are sensitive\nto the accomplishments as well as the needs of our membership\nand will protect the deserving, among which you are numbered, to\nthe best of our ability.\nCordially,"
}