{
  "id": "d561-56",
  "text": "RADIO STATION WFC1\nDecomber 13, 1966\nCOPY\n!.#r* 1 C«wur.l3*llonJ Cocsloelon\n•* * : • -•\nC«r.tl«3<*n*\nCn be'nlf of Franklin College of Indium I wish to make the following\nccKrenta on FCC Docket 2,o. 141S5 of November 14, 1966, especially in regards\nto the flection concerning the phasing out of ten-watt educational PM stations.\nAlthough I speak only for WFCI-fM I believe my remarks will also apply\nto many of the other 157 10 watt stations operated by small colleges and\nlocal school systems.\nFranklin College is a small liberal arts college located in a small\ntown. Jhe college is not only the towns* largest \"industry\" but is a leader\nin-many of the cultural and educational activities. In fact, the activities\nof the college are of primary interest and importance to many of the business\nand professional people of the community. WFCI-FM was established in 1960\nprimarily to promote and disseminate the activities of the college throughout\nthe community. WFCI-FM broadcasts many programs of community interest,\nincluding convocation speakers, college chapel programs, local church services,\nathletic events, college class sessions, and civio and service club meetings.\nIts facilities are available without cost for any community projeot.\nCut of a total of about 100 operating hours per week, 30 hours are devoted\nto clasaioal music programming, a type of programming that is seldom heard\non the looal commercial FM station, and never heard on the AM stations in\nthis area.\nIn addition to the community activities, WFCI-FM is also operated in\nthe interest of the student body and as a part of the academic program. The\nstation is U3ed as a laboratory for courses in the Speech and Theater Department,\nand by other departments for lecture and out-of-class discussions. Several\nclass sessions are broadcast each week by a number of academio departments.\nAlthough the late evening hours are devoted to \"entertainment\", the general\npurpose endeavors to supplement and assist the college in presenting a well-\nrounded educational program.\n\\\n."
}