{
  "id": "d561-6",
  "text": "Page 4\nwatt operation. This is indicated by the many schools which operate commercial\nAM carrier current stations and support their non-commercial FM stations with\nthem. One way to remedy this would be to allow these stations, which increase\ntheir power, the opportunity to receive payment for time on the basis that spot\ncommercials could not be accepted, but programs of one half or one hour could\nbe purchased by an advertiser with the maximum of 2:20 minutes of non-program\ntime per half hour. This would provide a limited amount of revenue for the\noperation and for maintenance of these stations and provide funds for bringing\nbetter programming to their audiences, or allow colleges and schools to operate\n100 watt AM non-directional daytime-onljr stations for the support of the FM\nnon-commercial stations.\nIn view of the above background, it would be recommended that all 10 watt\nstations be deleted within a period of the next two normal license periods, unless\nthe licensee should prove that his 10 watt service.is necessary to his community\nand that increasing the power would be harmiul to other existing stations in the\narea, and that the FCC modify some of its current rules and regulations to take\ninto consideration the aforementioned changes. These proposed changes, and\npossibly others, would vastly increase the stature and the service of educational\nradio in the United States during the next decade.\nSpecific recommendation based on the above are as follows:\n1. Application for 340 and Section 73.311 be modified as to the prediction\nof coverage curves except for the 50 UV/M contours; also of field strength\ncontours to require only the 50 UV/M contour,\n2. Section 73-261 be modified to.read \"for non-commercial education stations\na minimum of 10 hours per week consisting of not less than 2 hours in any one\nday. except Saturday and Sunday, during the normal college academic year. A non¬\ncommercial station may cease operations during the academic year for normal"
}