{
  "id": "d561-91",
  "text": "The Irish readings of the previous two or three weeks were delightful. Thank\nyou. (Isabel1 Shoemaker, Minneapolis)\nThe Minneapolis Alumnae Chapter of Mu Phi Epsilon wishes to thank you for\nincluding our scholarship program in your list of events on your (Community\nCalendar) program Tuesday, October 18, 1966. We are sure that your\ncooperation helped to give us the good-sized audience that we had that evening.\nCongratulations on your fine radio show, \"Following Conservation Trails.\" I\ncan *t tell you how much I enjoy this splendid show. I think you are doing\na fine job of bringing the true picture of Conservation to your radio audience.\nThe authentic settings and good acting on the part or the cast tend to\nstimulate the mind and imagination so that one can almost see the characters\nthey portray.... Again, I wish to thank you and bless you in your work. (Harold\nR. Snyder, St. Paul)\nCongratulations on your \"Current Events\" program. I have just heard an analysis\nof the United Nations vote on China and the Supreme Court decision on the\nCommunist Party. The presentation was very clear and impartial. I hope\nmany hundreds of listeners hoard it. (Mrs. Edward J. Stevens, Lake Elmo, Minn.)\nSomewhere I read that there was thought of discontinuing the \"Saturday\" show.\nI add my voice to others to acclaioi it as one of the best features of KUQM.\nLast week the dialogue with the Angola girl and the Mitau-Fraser discussion\nwere very interesting. This is real creative radio and still informative.\nKeep it up. (Mrs. H.E. Wright, Minneapolis)\n\"Saturday\" is the best program on the air in the Twin Cities — radio or\ntelevision. (Mrs. George Levin, St. Paul)\nHere’s one vote for continuation of \"Saturday.\" At times, during the summer,\nI found myself bored with the content of the show. Ten minutes later, the\nitems drew all my attention. I think you have an excellent program. (Tad\nShaw, Minneapolis)\nIn honor of the ending of \"Saturday,\" I have ordered all radios in the house\nto nave blade bands placed around them. Why do all good things last so short\na time and bad things last so long? \"Saturday\" represents the highly\ndiscriminating and keen person with many resources. By all means, keep\n\"Saturday.\" (w.W. Keenan, St. Paul)\nA belated bravo and huzzah for your comments on the auto industry on the\n\"Saturday\" program of September 25. \"Saturday\" is a great show. Would\nthat the sun shone longer or the FCG believed in the darlcf Keep up the good\nwork. (The Rev. Clyde J. Steckel, Minneapolis)\nThis is a long overdue note of appreciation for the many, many hours of fine\nlistening your station has afforded me. The excellent reading of \"Lost\nHorizons\" was thoroughly enjoyed. Thanks to all who are connected with KUOM.\n(Mrs. Pat Lundgren, Minneapolis)\nMuch enjoyed \"The Wind in the Willows\" —cool and soothing for these troubled\ntimes. Do you tape these readings? Some, like this present, should be\npreserved and made available to the blind. (Devoted listener, Minneapolis)\nYou did a splendid reading of \"Wind in the Willows,\" which gave us many hours\nof pleasure. (Larry and Louise Schuster, Wayzata)"
}