{
  "id": "d700-33",
  "text": "A. C. NIELSEN COMPANY\n- 2 -\nMr. Irving Merrill\nAugust 19, 1957\nThe proponents of FM naturally find it hard to believe that\nthis low level of ownership is typical and that the amount of\nuse is this low. Admittedly, there are rather wide variations\nmarket by market, but rarely do these levels change more than\n50% or so. When we stop to consider the competitive listening\nand viewing opportunities available to the average home, these\nfigures begin to make more sense.\nWith reference to means through which your Association might\nacquire data on reportable member stations and on all stations\nas of the date of our study, we can offer to your association\nour complete package of reports in the form normally available\nto advertising agencies. Because of the non-commercial nature\nof your operation, we would merely treat your Association in\nthe same fashion as the smallest advertising agency or adver¬\ntiser interested in the entire U. S. or selected states.\nOn the foregoing basis, your Association could have for its\nmanagement and research use 1;8 state volumes on radio, listing\nthe coverage of some 3,000 stations alternately showing stations\nwithin counties and counties within a station*s pattern for a\ngross charge of $2,200. Similar volumes for television could\nbe made available for your restricted use for $3,300. If both\nradio and television were ordered simultaneously, the combined\nreports would cost $U,700.\nIf the selection of states was limited to the 18 in which one\nor more of your member stations was reportable, this partial\nU. S. package would cost $1,716. It should be pointed out,\nhowever, that the 18 states would contain radio and television\ninformation for only three states, radio information for only\nnine states and television information for only six states.\nThis would seem to be an uneconomic type of purchase.\nIt is also possible for each of the 2k reportable members to\npurchase reports on their own performance (and to supply copies\nto the Association) at individual contract prices of $l£0 each\nfor radio members and $250 each for television members. Since\nthere are lk reportable radio stations and 10 reportable TV\nstations in this category, this would amount to $U,600 in total,\nbut with only limited information on competitive station pop¬\nularity in the markets in which these stations are located.\nFrankly, if the expenditure is warranted by your Association,\nI am sure that you would find the complete listing for all\nstations in all areas to represent the most meaningful purchase.\nThrough this information, any of your members could determine"
}