{
  "id": "d1007-108",
  "text": "•2«*\nThe programs have been obtained from a wide variety of sources\nincluding: member stations; the British Broadcasting Corporation! the\nCooper Union; the Canadian Broadcasting Corporation! the University of\nBerne* Switaerland- The Federal Security Agency; the Mutual Security\nAgency; the Armed Forces of die United States; die United Nations;\nUNESCO: commercial stations and networks; private foundations; and other\npublic service agencies. The programs have been concerned with many\nimportant subject areas and rmxe presented in numerous formats®\nThe percent of stations using regular program series has run from\na low of 2C$ to a high of 100$ mth an average percentage of use of 66%«\n‘.Ails is an encouragingly high percentage in view of the fact that use\nis entirely optional on the part of the station* No effort is made to\nincrease the usage of programs except to select programs of continually\nhigher quality. This use of the network service has also been achieved\nwith a di stiibirbion system ihat can not guarantee a regular delivery of\ntapes on a sufficiently safe basis to insure complete regularity of\nscheduling. This tales well for the networks future® v\nTOWARD A SOLUTION OF SOME 'PROBLEMS\nTwo important steps were taken during the past year to help solve\nsome of the network’s most pressing problems®\nIn January- there met in Urbane -a group of engineers and invited\nelectronics specialists. This group was concerned with the technical,\nproblems of tape recording and the mass reproduction of tapes® Tape\nrecording is such a now process that the extant technical standards\nare incomplete. Thus it became obvious that technical standards would\nhave to b© devised by our am members* A preliminary report was submitted®\nThe standards are now being revised and will soon be published as a\ntechnical guide for the entire network operation*\nIn February there met in Lafayette* Indiana the Tape Network\n• Program Acceptance Cbnsnittee and the In-School Programs Committee* These\ncommittees were conf routed mth the problem of establishing policies and\nevaluative criteria for programming the netssork* A greatly increased\nmutuality of thinking on the subject of programs resulted* A report of\nthose findings was published for Hie information of all mister stations©\nThe In-School Programs Conmiittee took further action in implementing an\nmotive distribution of programs designed for classroom use in elementary\nand secondary schools© This distribution is now a successfully reality*"
}