{
  "id": "d1007-147",
  "text": "-10-\nholders permissions to use the series for such purposes, and (5) pre¬\nparation of descriptive materials for distribution, and (6) distribu¬\ntion and handling of programs.\n\"Estimates:\nTapes for first 3-year Network programs,\nin-school programs only\nStorage cabinet\nCataloging, duplicated materials,\nclearances\nTotal\n’It should be noted that approximately\n$1,500.00 could be diverted to the NAEB\nNetwork at a later date if this project is\nfound not to be filling in apparent educational\nneed.\"\nC. Grants-in-Aid in Television\nIn last year's request two television projects were proposed. The fol¬\nlowing one of those two would appear to be at least as much needed as it was\nat that time, and is therefore herewith respectfully repeated, with slight\nmodifications:\n\"To aid educational institutions in the planning and production\nof a series of educational programs for television. The funds to be\nadministered by the NAEB. Grants to be made upon application, (using\nthe same committee procedures used in the NAEB’s other grant-in-aid\nprojects) and upon showing of potential good to educational television\nto come from such series.\"\nSum requested $20,000.00\nAdministrative Costs (5$) 1.000.00\nTotal Requested $21,000.00\nD. Special Project for Special and One-Time Series and Service to Other\nOrganizations.\nDuring the past year, because of budget stringencies, the NAEB was\nunable to provide the cooperation it would have liked in answer to various\nrequests for generally one-time services. In order to agree to undertake\nsuch projects as the proposed NPAC BBC Agricultural series, which the NAEB\nagreed to undertake, it was necessary to quote a figure (adequate to cover\nthe staff-time, tape, mailing and other costs) higher than would be necessary\nif a reserve fund and provision were available providing for a revolving\nfund operation on an actual cost basis. T‘o be able to undertake such pro¬\njects in the future, a revolving fund for one-time service both for NAEB\nprojects developed to meet pressing needs which occur, and to outside de¬\nserving organizations, is needed. It is believed that the sum listed below\nwould make possible approximately fifty small projects of this nature, which\nwould gradually make the NAEB’s influence and assistance available to an in¬\ncreasingly larger number of organizations with deserving educational objec¬\ntives, and lay the basis of a self-supporting service by the NAEB.\nBudget requested $5,000.00\nAdministration {%) _250.00\n$1,260.00\n300.00\n600.00\n$2,160.00\nTotal\n$5,250.00"
}