{
  "id": "d1007-177",
  "text": "COPY\nItem 32.m*\nCOPY\nTOi Members of NAEB Research Committee Jan. 23, 1956\nFROMs R. J. Coleman, Chairman\nSUBJECT: Status of committee work.\nSince the Annual Convention of last October, when the officers who had\nserved in 1955 were reelected, there has been no evidence of any change\nin the Research Committee. I have delayed any message to you pending word\nfrom President Schooley as to whether I would be continued as Chairman of\nthe consult tee or whether there would be any change in membership. There\nbeing no word I presume that committees will continue as they were.\nOur committee has lost the services of Merritt Ludwig, formerly with WOI.\nMerritt has assumed the position as Assistant to the President of Grinnell\nCollege, moving to Grinnell on Dec. 1. Merritt was a valuable member of\nour committee and we are sorry to lose him.\nThree projects are in the works as of today. The study of the acceptance\nof the NAEB Radio Network offerings is to be written up. The data is all\nin. Herman Reamers completed the first part which was a study of the\nreasons why managers accepted or refused network programs. Herman completed\nthis last fall. The second phase was a tabulation of the1programs showing\nthe incidence of their use by members. This is to attempt to see what\nprograms have the most popularity and why. Third is the reasons the Pro¬\ngram Acceptance Committee members give for their acceptance or rejection\nof programs offered to them for the network. I have all the material and\nhope to get at the writing of the report very soon now.\nAnother project, suggested at a Board of Directors meeting in Chicago, in¬\nvolves the NAEB Newsletter. It has been suggested that the Newsletter\neventually become a magazine in keeping with the strength and prestige of\nthe organization. The editor is immediately confronted with decisions\nwhich must be made on the basis of evaluation of the present publication\nand the desires of members for changes or improvements. A questionnaire\nhas been worked out in cooperation with the Public Relations Policy Com¬\nmittee. I have completed the questionnaire and it has gone to Headquarters\nfor processing. You will receive this within a week or two and when you\ndo, you will understand the whys and wherefores. I took it upon myself\nto work out the details vrith the other committee Chairman. The information\nshould be of interest.\nThe third project comes as a request from Graydon Ausmus. It is a study\nof the programs which are made available to commercial stations by members\nof NAEB. This is a part of our educational broadcasting service which has\nnever been transferred to statistics. This will show, not only the in¬\ncidence and volume of service to other stations beyond the programming over\nour own outlets. It will also show the volume being done by our Associate\nmembers and could furnish the data needed for possible reclassification of\nthe Associated membership list as mentioned in Chicago last October. I have\nmade a questionnaire for this one and Headquarters will have it in the mails\nto Active and Associate members. Again I have acted for the committee rather\nthan send out a hurried request for what I am sure would be a unanimous ap¬\nproval."
}