{
  "id": "d1007-224",
  "text": "4.\n6 Pool of test equipment. Listing of equipment for trade or purchase:\nOften it is desirable^ and sometimes necessary, to use test equipment not normally\nowned by every radio or television station. This usually is because of the cost and the\nfact that it is not needed for routine maintenance but rather for special tests. The\ncon“Pittee *ee*s ** 311 inventory cf such test equipment among member stations\ncould be prepared, arrangements miglift be worked out so as to make it available to\n2a22» ^nose who need it„ Mr. Bidlacl-: has agreed to send out a questionnaire to\nNAEB members in an effort to prepare such an inventory of equipment. The committee\nalso feels that a listing of equipment tor trade or purchase, in the Newsletter, might be\nof help to members and recommends that Mr. Bidlack continue this feature.\n7c Professional recognition of technical personnel. Job Classification. Wage scales.:\nThese subjects were discussed at length by the committee. They present a problem\na cases, is becoming acute. Certainly one of the major problems in many\nNAEB stations is the lack of properly trained and experienced technical personnel.\nEfforts have been made to find some basis for job classification and wage scale agreement\nbut thus far little las been done. The committee believes however, that the interest of\ntechnical personnel has been stimulated in NAEB as well as in the aims of educational\nradio and television through attendance at the 1954 and 1955 workshops.\n1ft should be pointed out that there is no thinking along the lines of a labor union.\n, e fact is that, In general, wage scaf.es in educational institutions are much lower than\nin commercial stations and to order to keep capable technical people it is necessary to\nstimulate their interest in educational, broadcasting. Also it may become necessary to\nrecruit such people If standards are to be maintained. With the advent of television\n■SFLflffiE? \"• &c,ed with a problem of job classification and wage scales which\nwul fit both the television and radio operations* The committee will continue to work on\nthis problem and hope that at least a partial answer may be forthcoming\nDuring the course of the meeting it was pointed out that some of the work of the\nEngineering Committee closely parallels that of the Professional Advancement\n«5?5wjee* therefore recommended that, if possible, an engineer who is familiar\nwith this work be appointed as a member of the Professional Advancement Committee,\nIn this way the work of both committees will proceed with a better understanding and\nthere will be no duplication of effort, ,\n™ J?s? °* roster °* technical personnel. Promoting interest in NAEB:\nUntil the NAEB roster of technical personnel was prepared by Mr. Bidlack. this was\nanything but a closely cooperating grcirp„ As a matter of fact, in most instances not\neven the names of chief engineers were known. The committee feels that action should\nbe taken to create interest in NAEB among this group. It should take an active interest\nin the organization s affairs. A step in this direction has been the NAEB technical\nworkshops. There is still much to be d>ne. The chairman of this committee hopes to\nwrite to individuals whose names appear on the technical roster describing the NAEB\nand ^ctJons> telling them how NAEB may help them, and asking them for their\nsuggestions. It is hoped that by such efforts this large group of technical people may\ncontribute much to the future of NAEB* y"
}