{
  "id": "d1007-227",
  "text": "NAEB TAPE TESTING PROGRAM\nTest tapes should be sent to Mr, Edward Kratt, Radio Station WNYE, 29 Fort Greene\nPlace, Brooklyn 1, New York,, They should carry an indication of the make, model and\nserial numbers (both transport mechanism and amplifier) of the recorder used as well\nas make, model and serial numbers of the test oscillator used*\nTapes should be recorded at 7 1/2 inches per seconds\nRecording levels should be maintained as indicated below. “Reference recording level*'\nfor these tests is defined as the level indicated by maximum peaks on the recorder\nVI meter. This is usually 0 DB * If a different maximum recording level is used, please\nso indicate* Record test tapes as follows:\n1. (A) At reference recording level, record two minutes of continuous 400 cps tone*\n(B) At 10 DB above reference recording level, record two minutes of continuous\n400 cps tone*\n(This may easily be done by inserting a 10 DB pad between oscillator and\namplifier for step A and removing it without changing amplifier gain for\nstep B* As the VI meter will doubtless go off scale for step B, one terminal\nof the VI meter may be disconnected*)\n(The above to establish reference level and to check distortion)\n2 Two minutes of no recorded sound (blank tape) accomplished by disconnecting\nthe oscillator and terminating the input of the recording amplifier with a matching\nresistor.\n(To check noise)\n3 At 20 DB below reference level, record one minute of continuous 5000 cps tone\nfollowed by two minutes of continuous 7500 cps tone*\n(To check head alignment)\n4* At 20 DB below reference recording level, record continuous tones as indicated\nbelow. Test oscillator output should be held constant*\nseconds\n400\n50\ncxs\n30\n10\n100\nif\n10\n200\na\n10\n500\na\n10\n1000\ntt\n10\n2000\nif\n10\n4000\ntt\n10\n5000\na\n10\n6000\nn\n10\n7500\ntt\n10\n10000\n>i\n10\n400\n9*\n10\n(To check frequency characteristic)\n5. At 20 DB below reference recording level, record five short pulses of 3000 cps\ntone one second apart* The start of the fifth pulse will be used as a starting time\nreference*\nAfter a few seconds silence, record a 3000 cps tone for approximately 14 minutes\nfollowed by another few seconds of silence*\nThen, record five more short pulses at one second intervals with the start of the\nfifth pulse exactly fifteen minutes after the starting time reference noted above*\n(To check timing, flutter and wow)"
}