{
  "id": "d1007-256",
  "text": "-3-\nVarious national conferences and conventions have called upon NAEB officers and\nstaff members during the past year.\nPresident Schooley, besides serving as Chairman of the NAEB Advisory Committee\nto the President of the Educational Television and Radio Center, a member of the\nFulbright Advisory Committee for broadcasting, and a member of the JCET Board, is\nserving as a consultant to another foundation in educational radio and television.\nHe has represented the NAEB at ACEj JCET, Music Educators, and numerous other.\nconferences. Last April he was the recipient of a special award for distinguished\nservice and leadership in educational broadcasting given by the Institute for\nEducation by Radio and Television, He also addressed che last annual convention\nof the National Association of Radio and Television Broadcasters, and is active.\nin various other organizations such as the Association for Education in Journalism.\nThe Executive Director, too, has been increasingly called upon for contri¬\nbutions to the Conferences and publications of numerous organizations. Principal\nexamples are the U. S. Office of Education’s Conference on Elementary Education,\nACE Constituent Member Conference and Workshops, and conferences and publications of\nthe American Association of School Administrators (AASA), the Department of Audio-\nVisual Instruction (DAVl) of the HEA, the American College Public Relations Associ¬\nation (ACPRA), the Institute for Education by Radio-TV, the American Council for\nBetter Broadcasts, the Speech Association of America, the Modern Language Association\nof America, the Adult Education Association (AEA), and the Council of National\nOrganizations (CNO). He has been a member of the AEA Delegate Assembly (the\nlegislative body of the AEA) and is at present a member of its Field Development\nCommittee. He is a member of the CNO Broadcasting Committee, and a nominee on\nthe single slate to be presented for election to the CNO Executive Committee.\nOther memberships held by him, some in behalf of the NAEB, include the Association\nfor Education in Journalism, the Association for Education by Radio and Television,\nthe Fulbright Advisory Committee in broadcasting, the American Academy of Political\nand Social Science, the National Academy of Economics and Political Science, and\nthe Speech Association of America} also with Dr. Burton Paulu, he has represented\nthe NAEB at recent U, S. National Commission for UNESCO conferences.\nThe NAEB’S Associate Director, besides the outstanding record in local and\nstate civic, club and educational activities which he has established, all of\nwhich reflect credit on the NAEB, is increasingly serving as liaison with other\norganizations. He has represented the NAEB at Cooperative League of America and\nCNO Editors Conferences, devoted to upgrading national organizational publications.\nHe also has served as consultant to the NPAC as needed. For instance, he was a\nmember of the planning committee and served as assistant manager of the NPAC\nAgricultural TV Clinic. Other representations on behalf of the NAEB have included\nmeetings of the Audio-Visual Commission on Public Education, the CIO TV Workshop,\nFilm Council of America meetings, and the Chicago Area Educational TV Conference.\nMr. Cecil Bidlack, NAEB TV Engineer, though not supported by Kellogg Funds,\nis also upholding the record of NAEB representation in the technical area. He\nis a Senior Member of the Institute of Radio Engineers, a Member of the Pro¬\nfessional Group on Broadcast Transmissions, an Active Member of the Society of\nMotion Picture and Television Engineers, and a lumber of the Audio Engineering"
}