{
  "id": "d1007-284",
  "text": "Robert VanDuyn USAOM/ECA\nAPO 928, c/o PM\nSan Francisco, California\nJuly 27, 1956\nDr. Frank; /$p hopley\nPresident, NAEB, l'4l<5r^gory Hall\nUrbana, Illinois\nDear Frank:\nI have followed with keen interest every letter and piece of\nmaterial that has been sent from NAEB even though I have not\nresponded with a word of appreciation each time the mail brings\nsome news from you. May I take this opportunity to say personally\nto you a sincere thanks.\nThere has been considerable thought here on the development\nof a regional school program through radio broadcasting. There\nare many difficult problems to overcome. One is lack of power.\nAnother is the fact that only a small number of radios are owned\nor are available. There has been practically no experience what¬\nsoever in this type of programing and of course there is little\nacceptance of educational broadcasting as a fundamental means of\neducation. I have discussed the possibilities from time to time\nwith the Secretary of Education for the Philippines but as you\nwill appreciate he has had frustrations in attempting to do any¬\nthing about this matter.\nYour re-election as President of NAEB speaks well for the\nwisdom of the organization. Congratulations! I am sure you\ndeserve the honor and will give the leadership needed. I have\nbeen particularly impressed with the recent things you have been\ndoing. It seems to me the reports denote a great deal of prog¬\nress. Do I conclude correctly that the organization is gaining\ngreater security, confidence and solidarity?\nWe have had a most delightful experience in the Philippines.\nWe love the people and found this to be a tremendous learning\nexperience for all of us. Our daughter Betty Ann is thoroughly\nenjoying the university and doing well. I have had abundant op¬\nportunity for much greater breadth of experience. According to\npresent plans we will be back in the States about September 1,\n1957. Please give our best regards to everyone and accept our\nbest wishes to you.\nSincerely,"
}