{
  "id": "d184-28",
  "text": "August 15, 1561\nMr. 0* Leonard Frees\nHead\nDepartment of Radio, ^television and Films\nUniversity of Kentucky\nLexington, Kentucky\nDear Leu:\nI'm sure I don’t need to tell you how delighted I am that you have\nbeen selected to fill out Roy Flynn’s une^pired tern on the MSB Board\nof Directors. In ay opinion, an excellent choice was made.\nBill, in his letter of August 10, indicated that I would be sending some\n\"assorted stuff re your Director duties*** I am not sure just what Bill\nhad la mind, but I do believe that it is a good idea to provide you with\nwhatever background information you deem desirable. As a starter, I am\nasking the Orbasrn office to send you copies of the last three Annual Re¬\nports, which will give you & rough idea of what the Association has been\ndoing during that period. 2be report for the year just ended has just been\ncompleted, and you will automatically receive a copy of it when it is sent\nout to all the Directors. I believe that you probably have copies of most of\nthe reports and publications H&EB !ms distributed in regent years, but I an\nenclosing a list of said publications and if there are any of then that you\ndo not currently have in your files and would like to have, just drop me a\nnote and I will see that they are seat to you free of charge.\nfiscal report for the past year will be forthcoming soon, and within a-\nbout three months, we hope to have the printed report of the recent Madison\nSeminar which I believe you will find interesting* If there Is anything at\nall which you feel would give you added information or would be helpful to\nyou, just let me know.\nI don’t imagine that you need a great deal of briefing as to what your duties\nas a Director are. You are familiar with the HAKB and its activities and\nparticularly with its \"paid staff.* However, X mi$bt say that we consider one\nof the most important jobs a Director has to be the encouragement of MSB mem¬\nbership at all levels. In other words, we hope that within your Region, you\nwllA be able to bring into the MSB fold any educational stations which are not\ncurrently members, and individuals on station staffs as Individual members.\nwould also hope that production centers and closed-circuit television In¬\nstallations, not already belonging might be encouraged to join the Association*"
}