{
  "id": "d184-41",
  "text": "CHANNEL\nSTUDIOS—UNIVERSITY OF WASHINGTON\nTRANSMITTER—EDISON TECHNICAL SCHOOL\nKCTS-TV\nSEATTLE 5, WASHINGTON\nMay 10, 1961\nBill Harley\nNAEB\nWashington, c.\nDear Bill:\nI am sure it will be much better f or the Center and for NAEB; and for\nthe development of the type of cooperative relationship we all Tteant\nbetween the two organizations — and within the entire educational\nbroadcasting movement — if we abandon any attempt to create a docu¬\nment which would spell out \"areas of interest\" or \"areas of primary\nresponsibility\"•\nWe must work from the premise of confidence that the Center’s desires\nand motives are, like those of NAEB, to do whatever it can to further\nthe interests of educational broadcasting. We in NAEB should give\nevery encouragement and support to the Center’s doing everything it\ncan do with the funds and manpower it has at its disposal, for it has\nresources of a magnitude which we don’t have, and by its nature — not\nbeing a membership organization which must be responsive to and consid¬\nerate of the many problems and interests of a diverse membership — is\nin a position to make decisions and move in many areas which NAEB cannot\ndo, or cannot do rapidly.\nWe should not, therefore, try in any way to limit the areas in which the\nCenter should be operating. The Center has certain basic responsibil¬\nities growing out of its charter and the directives of its Board. It\ncertainly cannot and should not limit its own growth by agreeing to\ntake a secondary role in any area important to its fulfilling its own\nresponsibilities•\nAt the same time the Center will, I am sure, recognize that it, alone,\ncannot do all that educational broadcasting needs done; and that it has\nas great — or perhaps a greater interest in helping develop a strong\nNAEB than have any of us who are, as individuals or institutions, work¬\ning to maintain a strong professional organization. There is much that\nthe Center should want done'^hat can be done effectively and economical! y\nonly by a membership organization. Money does not buy the type of service\nwhich NAEB members give the movement through their organization.\nAny attempt to set down areas of special interest will only create, ines¬\ncapably, a set of lines which cannot help but be crossed over, and which\nwill give rise to more of the suspicions and accusations which have\ncharacterized too much of the relationship of the past.\nUniversity of Washington * Seattle Public Schools .King County Schools * Seattle University .Seattle Pacific College •Seattle Public Library"
}