{
  "id": "d605-13",
  "text": "GABLE. MARTHA A.\nDirector. Division of Badio-TV Education, mtadelptoia Public Schools\nB. Ed., Indiana University\nM. Ed., SesDjple University\nExperience:\nClassroom Ttaacher, HiilodelphLa Eleraentaxy Schools\nEnglish and Health Education, Hiiladelphia Junior High Schools\nPhysical Education, Philadelphia Junior and Senior High Schools\nSpecial Assistant to Director of Jhysioal and Health Education, miadelphia Public Schools\nOne year with John B. Kelley os Assistant in Civil Defense Shysioal Fitness Program\nPresented commercial sports programs over experimental television station, 19^1\nResuc^d coowercial sports programs on television, 2$k6\nDeveloped in-school telecasts, 19*7, Ihiladelphla Public Schools\nAssistant Director of School Coranuaity Relations in charge of Radio-TV in 19*48 to 1955\nDirector, Radio-Television, 1955 _ ^ ^\nDeveloped regular daily in-school telecasts with Radio-TV Staff, Curriculum Office,\nand Special Departments in cooperation with txmiaercial stations\nConsultant for Joint Council on Educational TV and The Fund for the Advancement of\nAdult Education\nActivities:\nmnager, U.S. Field Hockey Association Touring Teem to Australia and South Africa, 1938\nJudge, Vfcmen'© Gymnastics in Olympic Games - London, 19**8; Helsinki, 1952; Melbourne,\n1956; World’s Champicinehipc, Moscow, 1958\nDelegate, White House Conference cm Education, 1955\nPresident, Moconate, First Presbyterian Church\nBoard of Directors, Southeastern Chapter American Red Gross\nBoard of Directors, General Alumni Association, Ttemple University\nMemberships:\nMasher, uTs. Olympic Committee for Women’s Qymnastlcs, 19^*9 to present\nMamber, Governor Leader’s Advisory Ccssaissian on Education, 1958-58\nMember, Soropthaiet Club, Philadelphia\nMsmbfer, Philadelphia Branch, American Women in Radio and Television\nMamber, Philadelphia Public Relations Association, American Public Relations Association\nMember, OVand Radio Advertising Club of Philadelphia\nMember, FmnlOin Institute, Philadelphia\nMember, Philadelphia Breach,AAUjL\nExecut ive Board, Federation of Wmen#» Clubs\nExecutive Board, Philadelphia Home and School Council\nMember, World Affaire Council\nMsmber, Rational Education Association\nMariber, American Association of School Administrators\nMember, Philadelphia Teachers Association\nMamber, American Association Health, Physical Education and Recreation\nMember, Philadelphia Club of Advertising Women\nat HAEB Headquarters"
}