{
  "id": "d605-16",
  "text": "irnzrn, GAEL XL\nDirector, Station WSUI, State Itoiversity of Iowa, Iowa City, Iowa\nF.F., State University of Iowa, 1921\nM.S., State University of Iowa, 1922\nE.E., State University of Iowa, 1925\nExperience:\nEmployed as Chief Engineer, Continental Radio and Mfg. Co♦, Newton, Iowa 1922*23\nDirector Radio Stations WSUI and KBUI and Professor of Electrical Engineering,\nState University of Iowa, 1923 to date.\nSix months Rockefeller Stellowship with National Broadcasting Co*, New fork.\nRadio and Television.\nRepresented the State of Iowa at Institute of Nuclear Studies, Oak Ridge, Tennessee\nFAE Fellowship with Columbia Broadcasting System, New fork\nHave attended numerous seminars and workshops on Radio, TV, Electronics and Radiological\nDefense.\nEmployed as President, National Association of Educational Broadcasters.\nof NAEB Engineering Committee, member Professional Development Committee\nHelped organize NAEB, Assn, of College and University Broadcasting Station, Assn, for\nEducational Radio and Television.\nResearch:\nOrganized and conducted numerous seminars and workshops on Radio, Electronics, and\nRadiological Defense.\nConducted surveys and studies of all phases of ETV and radio including financing,\nprogramming engineering.\nConsiderable research with various types of radio, television and electronics equipment\nHave designed, tested assisted in the installation and acted as consultant for many\nradio and television station in the United States, Canada and Mexico.\nPresently working on plans for a national educational radio network.\nEmployed by Atomic Jteergy Commission, testing nuclear weapons, during operations\n\"Sandstone\" 19^, \"Greenhouse\" 3951/ \"Buster” 1951/ \"Jangle\" 1951 at\nEniwetok/tend Las Vegas test sites.\nWith Federal Civil Defense Administration during Operation \"Plumb Bob\" 3957/ las Vegas\ntest site.\nVisiting lecturer. Army Medical Center, Washington, D.C., on Radiation Detection\nInstrumental ion, 1951-52*53*\nOrganized and conducted numerous courses in Radiological Defense and Civil Defense\nand am presently State Radiological Defense Officer, State of Iowa Civil Defense.\nHonors:\nMember of AKR1, Sigma Xi, Institute of Radio Engineers, Rotary, Eta Khppa foi, Theta Tan.\nMilitary Experience:\nArray Service 193B, Honorable Discharge\nCopied at NAEB\n6-9-40\n41"
}