{
  "id": "d605-17",
  "text": "COOPER, BSRMHR\n■— «——*» -■■■ -»■'■■■* ■« «■■■\nAssociate Professor of Radi^Televisian, Florida State l&iiversity, Tallahassee\nA.B., V&bash College, (in foreign languages sad speech), Hii Beta Kappa;\nBbuD., Stanford University, in Ccssaunicatioaus-Radio-OV, and Rhetoric and Riblic Address\nExperience:\nBesponsible for training elementary, secondary, and higher institutional teachers\nto use TV as a teaching aid ^ilizsfcion); responsible fear training teachers at\nuniversity Tevel to teach by TV (at University of I*ev Mexico); responsible for\nteaching techniques in the construction of student study guides and teachers\nmanuals for both TV (lJev Mexico) and radio (Japan and Korea)\nBought utilisation and directed utilisation -workshops (ilev Mexico, Japan KOrea)\nAdvisor and teacher to the production and education staffs of the Broadcasting Corporation\nof Japan. Trained producers and writers for more than XlB stations of two networks\nfor more than 5 years.\nConceived new techniques for the use of dram and general radio methods as educational\nactivities for both direct-teaching and enrichment experiences at the elementary and\nsecondary levels in Japan (for an estimated 600,000 teachers and 20,000,000 pupils)\nConceived techniques for writing and production workshops for Chinese and Korean\nprisoners of war, and techniques for using literature materials of China and Korea\nas bases for writing educational broadcasts and original dramas. Sought and trained\nteachers in production and writing of all types of educational broadcast materials,\nincluding language broadcasts for raising literacy level of audiences in native and\nforeign tongues.\nTaught production and writing at two universities (currently, Florida State Utsiversity;\npreviously, University of Jfev Mexico)\nTeacher of group methods for radio and 337 (panels, discussions and the like) at Stanford\nUniversity and Florida State University.\nBuilt, operated, staffed, and trained personnel for tweleve radio stations (in TOT\ncaaps in Korea), and built and managed ROT station (Hew Mexico)\nCertified high school teacher: Geasaaa, English, Remedial Beading, Speech and Drama*\nPrevious teaching experience in French, and Japanese (for the Signal Corps)\nResearch:\nTrained in research methodology (Stanford University), aided in education TV research\ndesign and experimentation (Bew Mexico); teacher of survey and research techniques\nwithin course work at Florida State University\nat MSI WoaS^KXXtmm"
}