{
  "id": "d605-18",
  "text": "ZIEBARTH, E. W.\nDean of Summer Sessions and Professor of Speech, University of Minnesota, Minneapolis\nExperience:\nFormer Executive Consultant to the Columbia Broadcasting System and now Educational and\nPublic Affairs Consultant to Mid-West Radio and Television Corporation and Hews Analyst\nfor CBS in the Northwest\nFormerly Educational Director of the Central Division of CBS\nManager of KUQM at the University of Minnesota\nCo-author of several books and a great many articles.\nMember of some thirteen professional organizations and eight honorary fraternities.\nWell known for his network broadcasts of \"Opinion Please,\" etc.\nEis \"This I Believe\" program was broadcast by Voice of America in six languages\nand made available by the Department of State for publication in ninety-seven\ncountries in which the U. S. has diplomatic representatives.\nVoice of America now broadcasts \"Ziebarth News Analysis\" to Russia each week\nTravel:\nHas made a number of trips abroad as raving foreign correspondent\nOnly American radio correspondent to interview Prime Minister Kekkonen of Finland\nas the latter was negotiating the Russo-Finnish trade pact\nCtaly American broadcaster to do a program with the farmer Prime Minister of Iran,\nMarshall All Razmara, at the time of the Russo-Iranian crisis shortly before\nRazmik’s assassination.\nHas completed assignment in Japan and the Fir East\nHas recently returned from some ten thousand miles of travel within the Soviet Union,\nmuch of It outside the normal travel routes of western observes.\nTraveled on Russian subways, boats, buses, trains and planes, including thousands\nof miles by Russian 104 Jet.\nOne of the first Americans to get to the Baikal area of Siberia on the Itogoiian Frontier,\nand originated broadcasts from areas never before used as points of origination.\nHonors: / - \\\nTwice Joint winner of the Peabody Award, once for contributions to intercultural\nrelations, and in 1#60 for contributions to international understanding as a result\nof a distinguished series of broadcasts originating from the Soviet Uhioa. i \\\nHas received the Rational Citation of the English Council, holds the Radio douactlX\nAward far Distinguished News Analysis, the First Award for Hews Intrepretatlon of\nthe National Institue for Education by Radio and Television I\nThe Radio Council Award for significant contributions to international understand\n33ae American Federation of Radio and Television Artis \"best commentator award”\nThe Radio and Television Council award for outstanding achievement in radio kid\ntelevision ; \\ V\nIncluded in Who’s Who In America for some years\nCopied at HAEB Headquarters\n6-9-60"
}