{
  "id": "d605-35",
  "text": "\"POINT OF VIEW\"\nAn examination and demonstration of the problems, techniques and potential\nof editorializing:\nChairman: MERRILL PANITT, Managing Editor of TV Guide, directs the editorial\nactivity of the national feature section and the magazine’s U* regional\neditions. He has been with the publication since 1953* Before moving to\nthe staff of TV Guide, Mr. Panitt served as assistant to the publisher of\nThe Philadelphia Inquirer. He also wrote a television column for the paper\nfor several years.\nJOHN CROHAN, Vice President of Elliot Stations and Manager of WICE, Providence\nRhode Island, is 2? years old and has been in broadcasting for ten years.\nOriginally, he worked for WPAW as an announcer and news editor. After serving\nin the Air Force, he became Program Director for Narragansett Bay Broadcasting\nIn July, 195>6 he joined Elliot Stations as Station Manager. In December of\n19f>7, he was elected Vice President.\nWILLIAM C. DEMPSEY, Program Manager, KPIX, San Francisco, joined KPIX in\n1952 as Education Director. He had been with San Francisco State College\nas Assistant Professor of Speech and Director of Radio and Television.\nSome of the award-winning educational programs of KPIX which he supervised\ninclude: \"People, Places and Politics\"; \"Frontiers of Understanding\";\n\"Inquiry\" and \"Discovery\".\nROBERT FORWARD, Director of Programs, KMPC, Los Angeles, has a full back¬\nground in radio and television. He has worked as producer and assistant\nprogram director for Don Lee Network; program director of KTTV, Los Angeles;\nand associate producer of the Jack Benny and Burns and Allen shows on CBS-TV.\nLEON GOLDSTEIN, Vice President in Charge of Public Service Programs for WMCA,\nNew York, started his career as a reporter on the New York Herald Tribune\nin 1928. Since that time he has been Director of Publicity for radio station\nWBNX, Director of Publicity and News for WMCA and an instructor of Radio News\nWriting and Editing at New Yox*k University. In 19bh, he became Vice President\nin Charge of Programs for WMCA."
}