{
  "id": "d605-39",
  "text": "\"THE CARE AND FEEDING OF IDEAS\" - TELEVISION\nChairman: TED COTT, Vice President in charge of owned and operated stations.\nNational Telefilm Associates, Inc., New York, was previously associated with\nthe DuMont Broadcasting Corp. as Vice President and General Manager. Prior\nto this he has been Vice President and General Manager, WRCA, WRCA-TV, and\nVice President and Program Manager of WNEW. He is winner of the 1957\nRobert E. Sherwood Award for the creation of \"Nightbeat”; 1957 Emmy Award\nfor operation of the outstanding local station; and winner of the Variety\nShow Manager Award.\nHERBERT B. CAHAN, Program Manager of WBZ-TV, Boston, since August, 1956,\ncame to the station from WAAM-TV, Baltimore where he had been Program\nManager since June of 19li9* During his tenure there, the station was\nthe recipient of numerous honors, the latest being the Robert E. Sherwood\nAward. WAAM-TV won this award for \"The Baltimore De-Segregation Report\".\nThis documentary was produced under Mr. Cahan’s direct supervision.\nSAM COOK DIGGES, General Manager, WCBS-TV, New York City, got his first\ntaste of radio in 19U2 when he won a position in the sales department\nof WMAL, Washington, D. C. In 19h9 9 he joined CBS, New York, as a sales¬\nman in the television department of Radio Sales. In 1950, he was trans¬\nferred to Chicago as Television Manager of the CBS Radio Sales office\nthere. In 1952, he returned to NYC, to become Eastern Sales Manager of\nCBS Television Spot Sales. In 195U, he was promoted to his present\nposition.\nJOHN HALDI, Program Manager of WBNS-TV, Columbus, Ohio, joined that\nstation in 19U9 as continuity director and became producer-director in\n1952. He was appointed Production Director the following year. He\nproduced and wrote \"Winter’s Wonderland\" for the talented and amusing\nJohnathan Winters, and was in charge of Borden's Fiftieth Anniversary\nshow on the station. The Freedom Foundation award was presented to\nWBNS-TV in 1955 as the result of a special show produced by Haldi.\nRAY MOORE, News Director of WSB-TV, Atlanta, Georgia, started his broad¬\ncasting career in Johnson City, Tennessee in 19h9 before joining the\nstaff of WSB Radio in 1951# He transferred to WSB-TV in 1952 and became\na mainstay in the news and sports departments. Recently promoted to\nNews Director, Mr. Moore currently emcees \"Today in Georgia\" and reports\nthe \"Noon News\" and handles the highly rated 6sUO PM Weathercast.\nDONALD D. WEAR, General Manager of WTPA, Harrisburgh, Pa., entered the\nradio field in 1916 as night News Editor for WKBO, NBC in Harrisburgh.\nHe served as Program Director until 1953 when he went into television\nas Program Director of WTPA. He became General Manager of the station\nin April, 1956."
}