{
  "id": "d605-41",
  "text": "\"THE AUDIENCE — or. Who's Out There?\"\nChairman: RICHARD D. HEFFNER is Director of Programs at the Metropolitan\nEducational Television Association, He formerly was Director of Public\nAffairs Programs at WRCA-TV where he still produces and moderates \"The\nOpen Mind,\" recent winner of the Ohio State Award, the Freedom Foundation\nAward, the Robert E. Sherwood Award and the National Conference of Christian\nand Jews Brotherhood Award. At WRCA-TV, Mr. Heffner has produced the award¬\nwinning \"Profile,\" \"Man of the Year,\" \"Princeton '56,\" and \"All About Women-\nAll About Men.\"\nIRVING GITLIN, Director of the Public Affairs Department of CBS News, was\nExecutive Producer of the 1956 award-winning program \"Out of Darkness\"\nand Producer of \"The Search*\" He was also winner of the Peabody Award\nfor 195U* He is currently supervising the production of Public Affairs\nprograms \"The Twentieth Century,\" \"Conquest\" and the up-coming series,\n\"The Great Challenge.\"\nMELVIN A. GOLDBERG, Director of Research for Westinghouse Broadcasting\nCompany, also acts as a research advisor for each of the company's tele¬\nvision and radio stations. Mr. Goldberg has had considerable experience\nin communications research. Prior to joining WBC, he was deputy director\nof the Office of Research and Evaluation, U. S. Information Agency and\nDirector of Research for the DuMont Television Network.\nSTOCKTON HELFFRICH, Director of Continuity Acceptance, NBC, New York,\nhas been with NBC since 1933 and in his present positions since June,\n19U2, except for three years in World War II as a Navy Lieutenant.\nHe describes his present job thusly: \"to decide what is, and what\nis not, good taste in the presentation of radio and television\nentertainment•\"\nDR. HERTA HERZOG, Vice President and Director of Research, McCann-Erickson,\nInc., New York, is a native of Vienna, Austria, and graduated from its\nuniversity with a Ph. D. in Psychology. In 1935 she came to this country\nand held various research jobs and in 19h3 came with McCann-Erickson.\nShe has been in charge of Radio-TV Research, then of the Motivational\nResearch Department and now her present title. She has been a consultant\nto various government agencies including the Research Branch of the War\nDepartment, OWI, U. S„ Information Agency."
}