{
  "id": "d605-44",
  "text": "TELEVISION NEWS WORKSHOP SESSION - \"Some Aspects of Television News\"\nChairman; MIKE WALLACE, American Broadcasting Company, is well-known for his\npopular television program, \"Mike Wallace’s Night Beat.\" Leaving his post\nas newscaster for the Air Edition of the Chicago Sun-Times, Mr. Wallace came\nto New York in 1951* Since then, he has filled countless radio and television\njobs including, \"Weekday\" which he co-hosted with Margaret Truman and \"The\nBig Surprise,\" on which he was quizmaster.\nROBERT W. BRECKNER, Vice President in Charge of Programming for KTTV, Los\nAngeles, joined KTTV in 19U8 as Film director. In 1952 he was appointed\nProgram Director and in 1955 was named Vice President. Prior to joining\nthe station, Mr. Breckner was contact producer for CBS on the following\nradio shows: \"Lux Theatre,\" \"Masie,\" and \"The Whistler.\"\nF. 0. CARVER, JR., News Director, WSJS-TV, Winston-Salem, N. C., joined\nthe station in 19Ij.6 as News Director for radio. Assumed the dual role\nfor radio and television when the television station went on the air in\nSeptember, 1953* Prior to military service during World War II, he was\nin Public Relations and Newspaper work.\nARTHUR GASKILL, New England Representative, United Press Movietone News,\nBoston, Mass., has been in the newsreel business for 30 years. His photo¬\ngraphic assignments read like a history book: Second Quebec Conference,\nYalto Conference, Potsdam Conference, Surrender of Japanese on board\nUSS Missouri and Atom Bomb at Bikini. He holds rank of full Colonel\nin the Active Army Reserve.\nJOHN H. SECONDARI, Bureau Chief for the American Broadcasting Company in\nWashington, D. C., is also known for his novels, \"Coins in a Fountain,\"\n\"Temptation for a King\" and \"Spinner of a Dream.\" He has also written\nthe following television plays: \"Hostages to Fortune,\" \"Patch on Faith,\"\n\"In the Days of Our Youth\" and \"The Commentator\". After serving six years\nin the U. S. Army during World War II, he became Deputy Chief of Information\nfor the Marshall Plan in Rome, Italy. He is also news commentator for the\nABC weekly television network show, \"Open Hearing.\"\nROBERT E. TRIPP, News %rector, WFAA and WFAA-TV, Dallas, Texas, directs\nthe activities of six radio and eight television news people in separate\nnews departments. From 19U6 to 1950, was news director for WEEK radio in\nPeoria, Ill. He has served in his present position since 1950. He has re¬\nceived the following awards: The National Association of Radio and\nTelevision News Directors 1957 Trophy for Best Television Coverage of a\nNews Event and Sylvania Award, 1958, for Best Televised Coverage of News\nEvent.\nComments: Charles Vanda, Vice President — Programming, WCAU-TV, Philadelphia,"
}