{
  "id": "d605-45",
  "text": "TV CHILDREN’S PROGRAMS\nChairman: HELEN PARKHURST, world-famous educator and child psychologist,\nwho conducts \"Growing Pains,\" Wetinghouse Broadcasting Company’s radio\nseries, for elementary education, known as the Dalton Plan* From 191; 7\nto 1950, she conducted the radio series, \"Child’s World\" which received\nfour major awards* For work in 1956 she was awarded in 1957 the \"McCall\nGold Mike\" for the greatest influence on youth through her Westinghouse\nBroadcasting program, \"Growing Pains*\"\nBOB EMERY, \"Big Brother,\" WBZ-TV, Boston, is a favorite with adults as\nwell as children. Prior to his present affiliation, he has been\nassociated with DuMont's WABD, General Electric’s WRBG and the DuMont\nnetwork. Bog got his start in show business with the Castle Square Stock\nCompany* He is also one of the real pioneers of radio, having started\nin 1921.\nROBERT M. GOLDENSON, Psychology Professor, Hunter College, has prepared\nmany articles on television and children for publications such as:\nParent's Magazine, National Parent-Teacher, Look, Child Stody, and Child¬\nhood Education. He serves on the NBC \"Children’s Program Review Committee\"\nand prepared a pamphlet, \"Television for Children\",in connection with the\nFoundation for Character Education.\nDR. FRANCES R. HORWICH is well-known to her television audiences as\n\"Miss Frances\" on her highly successful television series, \"Ding Dong\nSchool.\" In just a few short years she has received over 50 awards\nfor her television work with children. The Zenith 1953 Special Televi¬\nsion Award seems to sum up the tributes heaped on her. It said,\n\"To Dr. Frances Horwich, distinguished member of the television indus¬\ntry, in recognition of her services to America through television.\"\nBOB KEESHAN, \"Captain Kangaroo,\" CBS-TV, started his television career\nas an NBC page boy. From 19U7 to 1952, he played Clarabelle, the clown,\non \"Howdy Doody,\" while attending New York's Eordham University at night.\nHis next characterization was Corny the Clown on WABC-TV’s \"Time For Fun.\"\nWhile at ABC, Bob introduced \"Tinker's Workshop,\""
}