{
  "id": "d605-6",
  "text": "EMBRY, mLEKR B.\nProfessor in the TV, Radio and Film, Departaaent, College of Cgmaunlcatioa Arts, Michigan\nState University; teaching broadcasting regulations and responsibilities. Radio and\nTV Education, and International Broadcasting, serve as graduate students* advisor,\nto those mooring in mss media.\nExperience;\nDirectorship of Educational radio Station W&AB\nProfessorships at Oklahoma, Ohio State Universities and teaching experience in radio\nat Qiclahqm University while completing law degree, and work with educational radio\nStation WHA while contacting regalements for Ph.D.\n1935, 19^3*1952, served as atteomay, examiner, chief of renewals and revocation\nsection, and legal Assistant to the Chairman, Federal Communications Cocsnission\n19^5 served as editor of Personnel Administration published in Washington, D- C* *\nPresently Law Editor for the Journal of Broadcasting,, and member of the Board of\nMichigan State University Press.\n1952-1957, served as General Consultant to the Joint Council on Educational ^television,\nWashington, D. C.; during which time travelled in all parts of the United States,\nadvising with both cccsaerciol and educational broadcasters, helping plan the\nconstruction of ETV stations on channels reserved for education i\n1955 (f<xr 5 mantles) directed a study for the Hew York State Temporary Study Committee\non Educational Television under the auspices of the Cccmissianer of Education.\nWrote report of this Ccusaittee, ms published in 1956.\nResearch;\nConducted special research for the Ckxaaunications Research Center at Michigan State\nUniversity in the fields of coBsaercial broadcasting and International broadcasting,\nthe results of which are to be published soon.\nBecause of interest in and long studies of mss media in this count ly and abroad,\nwould welcome an opportunity to advise with and give technical assistance to\nauthorities in other countries concerned with the development of broadcasting.\nCopied at UASB Headquarters\n6-9-60"
}