{
  "id": "d605-7",
  "text": "LERCH, JOHN H<\nProfessor, Radio-TV, Boston University, 6k0 Canraonwealth Avenue, Boston, ^aachusetts\nA.B., Stanford University, 1947\nM.A-, Ohio State University, 1950\nCertificat d'Rtudes Btrangeres, Universite de Grenoble, Prance\nCandidate for the RiD. in Radio Television. Area, 195&\nExperience:\nFive years experience os announcer, script-writer, producer, newscaster. Firsthand\nknowledge of European and Oriental broadcasting eysteans.\nIn Vienna (I9ii8~49) Chief producer for the Red White Red Network, controlled by\nthe Department of the Amy. Promoted to station manager bebre leaving\nIn Munich (1953.-52) Producer for Radio Free Europe. Set up training program for\nCzechs, Boles, Hungarians. Produced over 300 programs of varying formats\nIn Manila (1952-53) Assistant program director of the short-lived Radio Free Asia.\nBuilt staff and physical facilities. Program planning, research, and development.\nIn Tokyo (1954-56) Assistant script editor radio section Psychological Warfare. Wrote\ndaily political commentary for Chinese and Korean listeners. Edited and supervised\nsome 40 scripts weekly, wrote and narrated a taped series: REPORT FROM JAPAN\nreleased by NAEB.\nTaught English Composition to foreign students at Q.8.U. for one year.\nProduced and hosted a season of public affairs TV programs over WO0U-TV during\nacademic year 1957 - 5$\nPublications:\nAssistant editor Army newspaper. Camp Campbell, Kentucky.\nIn 3954 wrote three scenarios used by Encyclopedia Britdanica Films\nIn 1956 wrote six articles for The Columbus Citizen \\\nFeature-travel reporter for the Canadian Broadcasting Corporation while in Japan A\nMilitary Experience:\nAmy Counter Intelligence Corps. Eighteen months overseas as interpreter-interrogator.\nPersonal aid to Cqananding General, 7th Armored Division.\n,assagai.\nAuthentic command, of French and German.\nReading and speacklng ski! in Spanish.\nlinguistic ability gained through direct experience in working with Europeans and Aslans*\nTotal of 4 years in Europe, & in Bar East.\nCopied at NAEB Readguarbers\n6-9-60\nn"
}