{
  "id": "d605-72",
  "text": "zxoGmmzcAt mm ~ nmow s» sxxx\nOMSS Harold rn»>iwi Bin\nPBSSKSf ramOB: Vice President, .national Association of Educational Bradaufcm,\n13^6 Conoaeticut Avenue, 3.M., Washington 6, B.C*\nEWE£gZfMt B.S., University of Illinois, 19**Q; BUS*, tlaiverslty of Illinois, 195^*\nijadergraduate work included a major la aceouataaey, and minors la economies and\nradio-television Journalism. Graduate work consisted of a major ia mss cotsauai*\ncation® and a minor la eecMoolcs*\nmm&mmxm MXmOBKBi my, l$k&»July, 19%7l Announcer, writer and producer, Station\nHlUv t&lversity of nilaoisi July, 2&kT-Angust, W*&9 Production Director, WIIX;\nAugust, 19^-February, 19^ Program Streeter, Min* Since that time. Associate\nDirector, then flee President of Sstloaal Association of Educational Broadcasters.\nMU ummm&t 19^7~dune, 195*U Faculty, Collie of JoursaOliBi and\nCQGffisunicatlons, university of Illinois. Sftugxt courses la radio-television.\nmUTABX 8BSVXCSs stared Arsy «* tad Lieutenant, duly, 19**Q; returned to reserve\nstatus la March, l$k$ m a lay or (Having Been promoted during coedat ia April#\n1$&5)* Graduated la top £$ of class from Officers CcMsaiatQations School, Held\nArtiileay School. Xa&ar served on teaching staff at this school, ms member of\nthe School's communications research board. Assigned to Headquarters, Booth\nArmy as Held Artillery Comauaications Officer where he took part la planning\nof field artillery cwmmlea&iam for the invasion of Cfeiaaua, and fear coordina¬\ntion of all math Aw Artillery radio and wire coromicatloas during the operation.\nHJSIACT3 FSQPBaMOSAL AmOTlls Served as Badio-W consultant to the MicMd Project\nin Agricultural Communications in planning spinors and. training programs; served\nfour years on the Emw&i'm Committee (two years as chairman) of the Audio-\nVisual Council on labile Iafoimtion; served on the executive Committee of the\nCouncil of national organisations. Be is &mmmtly a mea&cr of the Motional\nIndustry Advisory Ccsamittee of the Federal Communications Commission and a member\nof the Educational Media Council.\nSFM»S MB mmWJmmBi Wm given some 50 talks m broadcasting before such groups\nas state speech associations, national speech association, institute for Education\nby Radio-mievisioa, Council of National OBpMtmtloa*, citizens education, groups,\nPSA's, national Mucatloaal Film library Association, Department of Audio-Visual\nInstruction of the m, Jtetlonal Audio-Visual Association, high school and college\ncareer conferences, etc. Prepared (and supervised preparation by others) seem\ndomes solitary caaa^amlcatlons training manuals; prepared CKjosarnicatians research\nreports (military); a far articles and one booklet cm 'broadcasting and related\nactivities; edited educational broadcasting reports of surveys, workshops, etc.\nMEMBERSHIP H Pmmsi«AL cWAH2^I(mi National tmozim&lwx of educational Broadcasters;\nSigma Delta Chi (Jw&mOlm Professional); Alpha .Qappa F»i (Comaerce Professional);\nmppa mu Alpha (^ournaUw Honorary); Division of Audio-Visual Instruction of the\nSEA."
}