{
  "id": "d605-74",
  "text": "■\" * ' —wr'—11 .'■» . ■»<-■»■....\nROBERT LEWIS SHAYOH . ■(.:\nBolovialon Editor SASURTAX REVIEW 4',\nProducor-Wrltor-T)lreotor for TT-Re^lo V ;-V •\nSince 1950 Robert Lewis Shay on has been Contributing Editor of SATURDAY\nREVIEW covering television and radio in a weekly oolumn and criticism, and -\ncontributing feqture articles on broadcasting end communications.\nMr. Shayon became TV-radio critic for SR after a long and distinguished\ncareer as a writer-producer-director in television and radio, but he has con¬\ntinued hio active broadcasting, not only writing about television and radio\nbut actually participating in commercial end educational communications on the\nair*\nMoot rocentlv he created, wrote and was hoot-moderator for ABC-Television*s\n(“Directions *63; series, “Ethics in Five Acts,* a series of programs devoted\nto contemporary American adventures in the moral realm* In the fell of 1962,\nhe wrote and oo-produced for ABC-TV*s “Close Up“ eerieo (Bell & Howell) a two-\npart program, “The Big Revolving Door,“ being a study of prisons and prisoners\nin the U*S* Before that, ho was tho writer-member of a five-man American team\nto visit Soviet Russia and film the first television documentary on Russian\neducation, “Meet Comrade Student•“\nHe produced-, wrote and narrated “Everybody*a Mountain,* a 13-program series\non American education for the National Association of Educational Broadcasters\nend National Educational TV and Radio Centex’.\nAs executive producer for CBS Radio, he creeted, produced, and collaborated\nin the writing of most of the entire series, ,rY0U ARE THERE;* For NBC Television, \"\nhe produced “The Big Story,\" a film and live TV series dealing with actual\nadventures of real newspapermen. “Tho Eaglo»D Brood,* an! “Operation Crossroads,*\n“Tho Whole Town's Talking,\" are among the outstanding broadcasts written and\nproduced by Mr. Shayon. He has won many of broadcasting's most distinguished\nawards, including the Peabody Award, The Sylvania Television Award for Creative\nTechnique in Programing, Ohio State, City College, Radio Life. National Conference\nof Christians and Jews, School Bell Award of the NEA, and a Citation from the\nAmerican Foundation of the Blind.\nHo was the first Television Critio for Tho Christian Scienoe Monitor. He\nis the author of \"Television and Our Children\" (David McKay), he wrote the\nintroduction for “The Eighth Art,\" a collection of essays on broadcasting.\nHe oompiled the book, “Interaction* for the Television Information Office,\nMr. Shayon writes ©xtensivel y for other periodicals than SATURDAY REVIEW,\nlectures frequently before university, professional and civic groups on\ncorainunication3 end education. He contributed the article on radio-TV for\n“The Child's World\" Encyclopedia. He is a member of tho Editorial Board of\nThe Television QuartcHy of tho National Academy of Television Arts and Sciences;\n*a member of tho Board of Directors of The National Association for Better Radio\n, and Television. Ho is marriedp has two tecn-ag© daughters, and lives at ]'J\nWestport, Conn. v.\nRooont Activities 1963« TV critic invited tb siting of Intertel Producers,\n• , /Rltchley fork, Oxfordshire, Ssglas;l»\n■ '..V - . 1$ Record.for Horitago, World War-’I.\nF&^slldt (“Tha Cleveland Conference on\nVostigghome Edcatg.Co. ;\nJan -March 19£i& 'Vif&fcirg Lecturer? j.:.B£oadcasfc and Film CriU^cdLea for"
}