{
  "id": "d605-8",
  "text": "CURRIE, ROBERT C, JR,\nAssistant General Manager, WQED-WQEX, Pittsburgh, Bsnnsylvania\nA.B., 19h6 with major honors, University of Pennsylvania\nM.A., 19^7 in English, University of Pennsylvania\nBom Jfey 25, 1921\nExperience:\nwm-TV, Greensboro, N.C., Production Manager, JUly 19**9 to October 1950. Developed\nproduction Pu^i progmoaaing techniques, acted as announcer, director, producer, writer,\ntraffic manager! film supervisor, end performed ayrlad duties at a narv/ station in\na brand new industry*\nWCAU-TV, Philadelphia, Bnmsylvaaia, Production Manager, October 1950 to July 1953*\nResponsible to vice-president in charge of TV for production of all local shows\nand for the development of new production methods* Supervised staff of ten directors,\nhired and supervised production staff and announcers. Produced and directed wide\nvariety of local and CBS network programs*\nKEDD, Wichita, Kansas, Program Manager, July 1953 to July 195^* *&der same general\nmanager built program departments for both new stations, hiring and training all\npersonnel, creating all local programming, setting up traffic system, and serving\nas assistant to general manager in all administrative areas.\nWIN-T (WAHE-TV), fort tfeyrae, Indiana, Program Manager, July 195^ to August 1956*\nWXWX-TV, Richmond-Betersburg, Virginia, Operations Manager, August 1956 to August 1959 *\nComplete responsibility for all operation departments] i.e., program, film, traffic,\nengineering, booidceeping, reporting directly to vice-president and managing director.\nGiven responsibility for budget control. Revised operating and production techniques,\npurchase control system and personnel assignments*\nWQED-WQEX, Pittsburgh, Pennsylvania, Assistant General Manager, October 1959 to present.\nResponsible for development of \"special purpose\" Channel 16 operation and for super¬\nvision special projects in addition to administrative duties under General Manager.\nEducational Experience:\nInstructor in English and Drama at University of Delaware MLOOenbarg College.\nLecturer and Instructor in television production and programming at University of\nNorth Carolina, Drexel Institute, Brice School of Journalism\nCopied at HASB Headquarters\n6-9*60\nja."
}