{
  "id": "d634-2",
  "text": "\\4^tkX\nINSTITUTE OF COMMUNICATIONS RESEARCH\nTHE UNIVERSITY OF ILLINOIS + IIRBANA\n4>/f>: 4\nMay 8, 19^8\nProf. Sam L. Becker\nDepartment of Speech\nState University of Iowa\nIowa City, Iowa\nDear Sam:\nFinally can get around to answering your note to the research committee.\nHope I am not too late.\nNo, I will not be able to attend the Ohio Institute, and hence the extra¬\nday research committee meeting as well. But yes, I do have some thoughts on\nthe problems you raise in your memo.\nAssuming we have only the two grand to play around with, my first\ninclination is to say just let's continue as we have been. By this I mean\nthat this is such a paltry sum to begin with, it is hardly worthwhile trying\nto develop more grandiose plans. Even if we have more, I still would favor\nthe general system of inviting proposals for research on a variety of topics\nrather than us trying to limit the grants to certain areas. I base this\nsuggestion on two feelings I have: (1) Research is needed in ETV and radio\nin almost an area, and (2) I find it personally abhorrent to try to dictate\nresearcn interests to others just because we may control some of the purse¬\nstrings. Scholarship and good research flourishes, I think, in an atmosphere\nof free choice. My main complaint on the activities of Ford and ETRC in the\nETV area to date is jusb on this point—they have virtually decided what kinds\nof research they will support, and anyone wanting to do research in this area\nis almost forced to comply with these limitations if they want some support.\nThe above, of course, should be no excuse to sponsor poor research.\nRather, we should invite applications across the board, as it were, and make\nour decisions on the merits of the individual projects. I do wish, however,\ntnat we had more than $2,000 to work with. There are obviously some projects\nthat could be done for just a few hundred dollars, but there may be a real hot\none that would need most of the available funds, and I would hate to be in the\nposition of turning it down just because we feel we can only offer just so\nmuch for each individual project.\nGenerally, my feelings are that NAEB should appoint a Research Director\nor sometning similar, who will try to work with the committee toward one\nprimary aim at the present—approaching the powers and places that be to\nget more funds for research, which the committee can then allocate to needy\nand worthy projects. Better still, the committee, on its own, can try to\ndevelop a few substantial research ideas and then try to get funds for that"
}