{
  "id": "d634-21",
  "text": "July 7, 1958\nProf. Frank Schooley, Director\nUniversity Broadcasting\nUniversity of Illinois\nUrbana, Illinois\nDear Frank:\nCongratulations mi your appointment by the board* I look for*\nward to the opportunity to work with you* I assume that you have\nseen the correspondence between Burton, Harry, and me and you know\nthat I will be at Columbia University next year on a study grant\nbut X will be happy to do whatever I can for our organisation*\nI am writing at this time principally because I thought you\nmight want to know what the research committee is doing* The answer\nis not a great deal at the moment* The report of the NAEB research\nseminar which was held last Decesaber should be out soon* Keith Tyler\nhas taken on the Job of preparing it for publication* Because of the\nlimited amount of money available at the moment for research, the\ncommittee has decided that all of it should go for research grants-in-\nald, if good proposals come in* In order to increase the probability\nof good proposals, we are going to try to have the announcement out\nmuch earlier — soon after the opening of the fall term. This means\nabout September 20th. We are now working on a revision of the announce¬\nment* When will it need to he in the hands of the headquarters staff\nin order to be in the mails about the middle of September?\n1 understand that the specifics of what will not be paid on a\nresearch grant-in-aid, in the past, have been in the rules which were\ndistributed separately from the announcement* 1 wonder whether we\ncould save the NAEB a lot of problems if we included the rules and\nthe announcement in one brochure? What do you think? If you think\nthis is all right, I would like to receive a copy of the rules (Harry).\nAs a matter of fact, even if you do not think it is all right I would\nlike to see a copy of the rules so that we say nothing which is in\ndisagreement with your basic policies*\nThe question has also come up of our position on some of the\nsurveys which other committees have suggested that they would like\nto do* For example, Elmer Sulrer's report on promotion suggested a"
}