{
  "id": "d634-51",
  "text": "REBOOT OF THE 1IAEB RESEARCH COMMITTEE\nOctober, 1953\nthe past year sm a long~pl; nned-xor project of the 1IAXB\nResearch Committee become a reality# Hxia was a week-long setdnar\non research in educational broadcasting* %>onoored by the national\nAssociation of Educational Broadcasters, it was held on the campus\nof the (Mo State University from December 9th. through the 13th,\n1957* The seminar brought together researchers in educational\nbroadcasting and some of the top research persons in tangential\nfields for the purpose of laying out some of the problems on which\nresearch is needed for educational broadcasting and to point out son©\nof Idle ways in which these problems can be attacked* It is hoped\nthat the sumary of the conference results, now being consolidated\nby Base arch Committee member I* Keith Tyler# will provide some\nguideposts and inspiration for much additional research by educational\nstations, educational institutions, mid, research agencies.\nFortunately, the HAEB Board of Directors made It possible for\nthe grants-in-add program, started in 1955-1956, to continue during\nthis past year* The HASS can talc© credit for making possible som\nexcellent research projects, with the expenditure of comparatively\nlittle money, through this partial support of research projects. The\nannouncements for the 1958-1959 program of grants should now be in the\nhands of II/VEB members and others inter©steel in research of significanc\nto educational broadcasting. A special attempt was mde to get these\nannouncements out early this year so that greater tir® and thought\ncan be given to the preparation of research proposals*\nT he Research Committee still feels that the MSB sorely needs\na full-tiiao Director of Research and adequate funds to enable him to\norganize or direct a large-scale attack on some of the many questions\nwhich need to be answered in order to better understand!; and, thereby,\nto better cany on this business of educational broadcasting* Hie"
}