{
  "id": "d634-55",
  "text": "A Measure of Audience for Educational Broadcasting\nTelephone Coincidental Study\nThe coincidental telephone survey is one of the cheapest types of\naudience surveys to make and a good starting place from 'ditch to develop\nother types of research. Though the average number of viewers or listeners\nis seldom, if ever, the major interest of educational broadcasters, it\nis o ften helpful to have some estimate of audience size, especially in\nrelation to the audience size for other types of programming on competetive\nstations in the area.\n’'Hose-counting” studies have often been derided by educational broadcasters.\nMany claim that the audience of educational broadcasts is necessarily small\nand that the results of research on audience size make their stations\nappear ineffectual. It should be made clear at the outset of any discussion\nof research that the purpose is not to make the station appear ineffectual.\nHor is the purpose to make the station appear effective. The purpose of\nresearch is not to make the station appear anything; the purpose is rather\nto gain knowledge and understanding of what is. Such knowledge and\nunderstanding often can be used as an aid in programming decisions. The\nword \"aid” is used advisedly. Programming decisions obviously should\nnot be based completely upon the results of audience size measurements.\nThese results are simply additional bits of information which will enable\nmanagement and program personnel to make decisions more intelligently,\nbased perhaps somewhat more upon knowledge, somewhat less upon bias or hunch.\nThere are many advantages to the coincidental or telephone survey.\nIt is probably the quickest and cheapest method of securing audience size\nestimates, kith the help of suggestions, such as those in this paper,\ncoincidental studies can be carried out with personnel who are inexperienced\nin research. Because of the great expansion of telephone service since\nWorld War II, samples selected from telephone books are probably as good\nrandom samples as you can obtain from your community. The bias due to\nfamilies who do not have telephones is almost negligible. One of the\ngreatest advantages of this type of study for the educational broadcaster\nis that it supplies him with a list of names and addresses of listeners\nto his station. Such a list can be used for many purposes, including\nfollow-up interviews with these respondents in their homes.\nSponsors of research always should be aware of the limitations of\nthe particular research method used before such research is started.\nThough, as indicated above, the telephone book provides a fairly good basis\nfor a random sample, there are some groups in the population who will be\nmissed. These include the extremely low income group, families in apartment\nhotels which have P.B.X. switchboards, and often a large proportion of farm\nhomes. Because of the large number of hones on each farm line, the\ninterviewers get too many busy signals and thus have a hard time getting,\ncalls through. Detailed information cannot be gathered in telephone\ninterviews. It is probably inadvisable to attempt to discover much more\nin a telephone interview then whether and to what the respondent is\nlistening'. Information about the respondent is not generally obtained.\nCalls cannot be made too early in the morning or very late at night.\nThough this Trill differ somewhat from community to community, 8:30 a.m.\nand 10:00 p.m. are the approximate limits of telephone surveys. When\nthere are multiple sets in use in the household, or when there is a\nradio set in addition to a television set in use, most respondents do\nnot mention this fact. Some of these limitations can be cicumvented by\neaseful planning and skillfully designed questions. In general, however,\nthese limitations should simply be kept in mind so that you are aware of\nwhat your results represent, and what they do not represent."
}