{
  "id": "d634-56",
  "text": "(2 - Telephone Coincidental Study)\nPlanning the Survey\nThe months of March, April, October, and the first half of November\nare probably the best for coincidental surveys if a picture of \"typical\"\nlistening is wanted.\nThe first step in planning the study is to obtain the most recent\ntelephone book available in your community. Mark off all business phones\nand estimate the number of home telephones remaining.\nBefore selecting the numbers to be called, decide on the time period\nor periods to which you want to generalize. If you are simply interested\nin the average night-time listening' to \"your station, you will need to make\nfewer calls than if you are interested in the audience size for each\nindividual program. You should plan to obtain 500 to 600 calls for each\ntime period to which you want to generalize. The average interviewer can\nplace 60 to 80 calls per hour. This means that if you want to generalize to\nyour 7:00 to 10:00 p.m. period, three telephone interviewers can place\nenough calls in one evening to obtain the data, or one interviewer working\nfor three evenings can do it. On the other hand, if you want to find out\nabout a specific half-hour program which is on the air once a week, it \"dll\ntake 17 interviewers placing calls all during one program, or it will take\n1 interviewer placing calls each time the program is on for 5 or 6 weeksfetc.\nThe number of calls which you need to place depends on the precision which\nyou wish your audience estimate to have. The larger the sample, the more\nprecise your estimate. The 500 to 600 figure was arrived at by estimating\nthat the audience for an educational program mil be between 2 and of the\npopulation of a community. With 600 calls, if you find that 2% of your\nsample reported listening to your station, the chances will be 95> out of\n100 that the \"true\" percentage of listeners in the entire cqpamit^^ns\nbetween 1% and 3%. This is calculated with the formula 2 f p(lOO-p) -where\nP - the percentage of the sample reporting listening to your station and\nIT = the number of cadis made in this period. The result, which statisticians\ncall xxxhxkiE sampling error or possible error, is added to and subtracted\nfrom your percentage to find the range Yd.thin which the true figure probably\nfalls. If you find that % of your 600 sample reported listening to your\nstation, the percentage for the entire community probably lies between 3 and\n7p, using the same formula to calculate sampling error. As the reader can\nsee, with a sample much smaller than 5>00 or 600, the sampling error will\nbe so great that the results \"dll be quite unreliable.\nOnce you determine the number of calls to be made, divide this number\ninto your estimate of the number of residential phone numbers in the\ntelephone book. Let us say that you find that you need to call one-twelfth\nof the residential phones in the book in order to obtain the desired sample.\nRandomly select a number from 1 to 10. This can be done by selecting a number\nfrom a hat, or shuffling ten playing cards from the ace through the ten and\nseledting one. Starting with the number you select, go through the phone book\nand check every 12th number. If you get through the phone book and find that\nyou still need more numbers, pick another randolm number to determine your\nstarting place on page 1 and start through again selecting additional |iomes\nto call, again skipping the same number of phones each time. In no case\nshould you call the same home^wicle in one survey. This can be avoided by\nmarking each number in the book which you plan to use. All of the numbers\nthus selected will comprise your sample.\nThe next step is to construct check sheets on which the interviewers\ncan quickly check the responses which they receive to their queries.\nDown one side of the sheet list the numbers to be called, with space to\nthe right of each for checking or filling in the responses to each question.\nIn general, the questions will be somewhat as follows:"
}