{
  "id": "d634-74",
  "text": "Seminar on Research in Educational Broadcasting\nSponsored by the\nNational Association of Educational Broadcasters and\nThe Ohio State University\nROSTER OF PARTICIPANTS\nAdkins, Gale* Director, Office of Radio-TV Research, Utaiversity of Kansas* NASB\nResearch Committee. -\nBecker, 5aa L.\" DirecJSr, Division of Television-Radio-Film, State University\nof Xtta* Currently directing study «f kinescopes vs* classroom lectures.\nResearch sad publications In mass ©ccmaiieatien. NAEB Research Ccamltteo.\nBennett, Jetom. Professor, Sociology snS Asthropology, Qhio 'Raie VaErStStfjy”\nBackground In research in cultmCl Influences including broadcast media.\nResource Person.\nBloom, fenjamln 5. University Examiner, University of Chicago. Research and\npublications In evaluation of educational behavior. Resource Person.\nBogart, Leo. Research Division, McCann-Erlckson, Incorporated. Research and pub¬\nlications in mass coraraunication. Resource Person.\nCheydleur, Raymond D. Assistant Director, Florida University Broadcasting Services.\nResearch and publications in broadcasting. Chairman, NAEB Research Committee.\nCrary, Hyland W. Director of Education, Educational television and kadio Center.\nAudio-visual education. Currently coordinating research supported by Center.\nDale, Edgar. Professor, Bureau of Educational Research and Service. Research and\npublications in audio-visual education including readability. Resource Person.\nDenney, Reuel. Professor of Social Sciences, Center for the Study of Leisure,\nt&iiversity of Chicago. Research and publications in social and cultural\nphenomena. Resource Person.\nEllery, John B. Supervisor, Radio and Television Research, Wayne State University.\nResearch In public opinion and communication.\nEvans, Herbert E. Vice President and General Manager, People®s Broadcasting Cor¬\nporation, Columbus. Host for Monday® a Dinner.\nFlick, Clarence E. Assistant Professor andT&recEor of Radio and Television,\nDepartment of Speech, University of Nebraska. Currently Mass Media Fellow,\nFund fur Adult Education. Research in broadcasting. NAEB Research Committee.\nFoshay, A. W. Executive Officer, Horace Maxm-Lincoln Institute of School Experl-1\"\nmentation. Teachers College* Columbia University. Research and publications\nin education.\nGardner, Burleigh B. Executive Director, Social Research, Incorporated, Chicago.\nn Research and publications in social phenomena. Resource Person.\ntS JJr Gerjucy, Herbert. Department of Psychology, Uhiversi^o?\"Toledo\"..\"Research and\npublications in experimental psychology.\nHarwood, Kenneth. Chairman, Department of Telecommunications, University of\nSouthern California. Research and publications in broadcasting. NAEB\nResearch Caaaittee.\n__Reiminghaus, Eiari G. Research Consultant, St. Louis Public Schools* Graduate\nInstitute of Education, Washington University. Conducted research aspects of\nSt. Louis experiment In large-group television teaching. Research and publi¬\ncations in education.\nHerzog, Herta. Vice President, McCann-Erlckson, Incorporated. Research and publi¬\ncations in social psychology and mass cosmunlcation. Resource Person.\nNull, Richard. Director of Radio and Television Broadcasting, Ohio ^iaie’^University*\nNAEB Vice President.\nKelly, George A. Professor of Psychology, Ohio State University. Research and\npublications in psychology. Directed Montclair preliminary study of school\ntelevision. Resource Person."
}