{
  "id": "d1296-1",
  "text": "NAEB NEV/S LETTER.Dec. 15, 1940.Page 2\nSt3*0 Universities.\nBROADCASTING for December 15th credits the drive for Dr. Crane as\nbeing the most active.\nChairman of the National Committee on Education by Radio and\nPresident of the University of Wyoming, Dr. Crane has long been\nconnected with radio and education.\nMembers are urged to support actively, and to secure the active\nsupport of educators, on behalf of Dr. Crane.\nLUKE ROBERTS LOST TO NAEB\nUnfortunately for NaEB, Luke Roberts is leaving our ranks on\nJanuary 1. Let him speak:\nH0n January 1 I am leaving XOAC to take the position of education\nand farm director at the Portland stations KOIN-KALE, which are\nthe Columbia and Mutual outlets respectively. The position is a\nmuch better situation for me and will offer what I think will be\nsome real opportunities in the field of education over commercial\nstations.\n“In view of the fact that I will no longer be eligible to member¬\nship in the NAEB I must resign my place on the executive committee*\nI shall, of course, continue to be interested in everything that\nthe NAEB members are doing and hope that I will not be looked upon\nas an outsider. I shall probably be asking you for information\nabout the work of the various members from time to time.11\nA few days later, President Ingham of NAEB wrote Luke. It spea.ks\nfor itself, too:\n\"From the standpoint of the National Association of Educational\nBroadcasters, I was greatly disappointed in receiving your letter\nof the 3rd, advising that you have resigned your position at KGAC\nand deserting the field of educational broadcasting. However, I\nam confident that the new position represents a distinct pro¬\nmotion for you and a greater future opportunity. So I want to\nbe among the first to offer my congratulations and to wish you\nthe best of success in your new undertaking.\n\"I greatly appreciate your splendid cooperation in writing so\npromptly to advise me of your withdrawal from a faculty or staff\nposition.with the Agricultural College and the Oregon State System\nof Higher Education. But I regret to see you leave this field,\nthe more so since I was beginning to feel this year that I was\ndeveloping an acquaintance with you personally. And I am hoping\nit may not be necessary that we lose track of each other entirely\nsimply because, in your new field, our paths may cross less fre¬\nquently. I am confident that I speak the sentiments of all of"
}