{
  "id": "d1382-3",
  "text": "HELP WANTED\nIf your station needs help, NAEB Executive Secretary has the dope\nON A NUMBER OF YOUNG MEN INTERESTED IN STAYING IN EDUCATIONAL\nBROADCASTING. IF YOU NEED A GOOD MAN, SEE ME AT THE CONVENTION.\nDetails can be supplied there.\nNON-COMMERCIAL EDUCATIONAL FM BROADCASTS\nPROPOSED BY SAN FRANCISCO PUBLIC SCHOOLS\nFirst use of FM (frequency modulation) broadcast in the non¬\ncommercial EDUCATIONAL FIELD IS PROPOSED BY THE BOARD OF EDUCATION\nof the San Francisco Unified School District as a result of being\nGRANTED A CONSTRUCTION PERMIT BY THE FEDERAL COMMUNICATIONS\nCommission for a new station at 22nd and Bartlett Streets, that\nCITY, TO OPERATE ON 42,100 KILOCYCLES WITH I KILOWATT POWER,\nUNLIMITED TIME.\nIt INTENDS TO USE RADIO FOR INSTRUCTIONAL, ADMINISTRATIVE,\nSUPERVISORY, AND OTHER FUNCTIONS IN THE LOCAL SCHOOLS. THIRTEEN\nSTUDIOS ARE PLANNED FOR HIGH SCHOOLS AND COLLEGES IN THAT AREA.\nThey will be connected with the broadcast station by means of\nLEASED WIRES. In THIS MANNER IT IS EXPECTED THAT A GREATER\nNUMBER OF TEACHERS AND PUPILS WILL BE ENABLED TO PARTICIPATE\nWITH LESS EFFORT AND EXPENSE OF TRANSPORTATION.\nTHE BROADCAST PROGRAMS WILL COVER NEARLY ALL OF SAN FRANCISCO\nAS WELL AS THE EAST BAY AREA WHICH INCLUDES THE CITIES OF ALAMEDA,\nOakland, Berkeley, El Cerrito and Richmond. The Board of Education,\nWHICH IS THE GOVERNING BODY OF THE SAN FRANCISCO UNIFIED SCHOOL\nDistrict, has allocated $9,000 for the station, and an additional\nAMOUNT OF $42,000 HAS BEEN MADE AVAILABLE.\nThree other institutions were previously licensed to use\nAM (amplitude modulation) on the channels SET aside for non¬\ncommercial EDUCATIONAL PUR°OSES. THEY ARE THE NEW YORK C|JY\nBoard of Education, the Cleveland Board of Education, and, more\nRECENTLY, THE UNIVERSITY OF KENTUCKY.\nFCC ACTIONS\nWSAJ., Grove City College, was granted permission to remain silent\nto September 19. (7/25/40)\nKOAC, Oregon State Agricultural College, was granted permission\nTO OPERATE LIMITED HOURS INSTEAD OF UNLIMITED HOURS TO AUGUST 3!.\n(7/29/40)\nWRUW, World Wide Broadcasting Corporation, Boston, granted request\nFOR DISMISSAL WITHOUT PREJUDICE OF APPLICATION FOR MODIFICATION\nOF LICENSE TO ADD FREQUENCIES. (8/2/40)\nWNYC, City of New York Municipal Broadcasting System, granted\nAUTHORITY TO OPERATE UNTIL !0 P.M., EDST, DURING AUGUST TO BROAD¬\nCAST SPECIAL PROGRAMS. (8/2/40)\n- Frank E. Schoolev"
}