{
  "id": "d1382-4",
  "text": "-5-\nSAME TUNE-NEV: V.ORDS\n’’Let The Benton elephant get his snout under the radio tent and you’ve given\nthe government-ownership proponents their greatest impetus\", wails BROADCASTING\n(March 31) in decrying Assistant Secretary of State Benton’s plan for establishing\ngovernmentally owned short-wave stations for international broadcasting. \"Can’t\nthe government buy time on privately-owned stations?\" it asks.\nIf American radio today was all it purports to be it need have no such fears\nsuch as these outcrys betray.\nTHE RUMOR MILL\nIt is touching the way \"The Industry\" worries about radio abroad-as reflected\nin these (Variety March 26) reports;\n\"Belief here(Sidney) is that the government controlled Australian Broadcasting\nCorporation will drop its BBC style of thinking this year and cater to the trade\nvia the commercial route\".\n\"Johannesburg, March 15-The commercial broadcasting picture in the Union of\nSouth Africa remains confused. Although reports had it that commercial broadcasting\nwould start here on January 1, and date v>ras later put forward to June 1,-belief\nis there'll be—-no commercial broadcasting at least until ’4B.\"\nThe customary BBC rumors are conspicuous by their absence this month.\nHITS AND MISSES\nThe Attorney General’s Conference on Juvenile Delinquency will meet in Nev; York\nthis spring, and a special radio panel Y/ill report on its work in building anti¬\ncrime programs for juveniles. (Variety, March 26).\nToronto newspapers have run ads for Station CHUM offering to pay $500 to\nlisteners who telephone in details on any ne¥/s happening they have witnessed. Who\nscoops whom?\nTavern operators in New York are divided on the values of television receivers\nin their establishments. Some say the pictures attii’act viewers who crowd out their\nregular customersj yet fail to buy. Others say certain types of video programs\nincrease the quaffing.\nZenith Radio, which has operated its own FM stotion on a non-commercial basis\nfor a number, of years, polled its listeners to get their opinions on the station\ngoing commercial. Some 7,000 letters v/ere received-and 90 per cent indicated that\nthey preferred their FM without commercial sponsorship.\nIs American radio jittery? The old doctor diagnosed, it as acute Hooper-\nsensitivity.\nGeneral Electric in offering a \"pee-wee\" transmitter to educational broadcasters\nsays that it has \"the added merit of cutting the coverage of non-commercial FM\nstations to a point where they won’t be competing v/ith commercial broadcasters-\"\nNow, that really is a service to educationl .(Variety, March 12, 1947)\nHITS & MISSES MISSED BILLBOARD\n. erry Franken of BILLBOARD reminds ye Ed. that confession is good for the soul—\nas the March NEWS-LETTER stated. So ’tiz-and we confess that the soap-opera quip\nin that issue should have been credited to \"BILLBOARD\"-THE VORLD’S FOREMOST\nAMUSEMENT TEEKLY-25 CENTS\" (How’s that for a plug, Jerry?) So, we give credit\nwhere it is due-to a sheet we all enjoy reading."
}