{
  "id": "d1382-6",
  "text": "\"* Qj9\\A,>Cje0>’^^ <v''''-CM-^-^ vvi> g» a.x4,C.^^_g[i^\n-7-\n0uaA>vw5 lr«^\nir,TTA-T.-tS THE M>fecEIV^ SITUAmONI / /\nOn March ^h thj^ folloying telegram t/^s sent^o seve^l ma^fac^er^\nRADIO DE/^RS Am SERVI^ MEN iEETINy^IERE DT^H STATION OPERATOR^\nTUESDAV NIGHT MRCH 11/FOR FMNK DI^USSION EM PROS^XTS. /PIEA^\nWIRE ioUR OPmON IIOW/SOON M AT V^T PRI^ FM TA&tE MODELS YflL ^\nBE Av/lIABLE 4hIS AbA ' HBMcCARTY STATION WI|fl-FM I\n^ The replies received read in part as follows: . ^ ^ ^ t\nRCA-VICTOR Our production table FM-AM radio should start approximately four weeks\nanticipated price range seventy to ninety dollars. . . , .\nPHILCO FM prospects for the immediate future are increasingly bright...xhilco nov/\nIir^oduotion on two console AM-K phonograph receivers with a decided increase in\nproduction schedules coming.. .Feel that FI- table model receivers mil be available\nin early spring at reasonable prices public will completely accept. ^ .\nGENERAL ELPXTRIC Planning large production of FI\\i receivers for 1947 to materialize\nsecond half of year....cannot quote planned production rate due to company policy.\n5TR0MBERG CARLSON In addition to present line we will market popular price IM-Alii\ntable sets this summ.er and expect to price it well under $75. _\nEMERSON FM-AM table model will list at ninety-nine dollars ninety-five cen s....\nBelieve production will start about sixty days. ^\nADMIRAL Table model FM available late this summer approximate price $75 to\ntirillsole models 1947 line will have B/I available in April, May, and June 1947.\nMONTGOIiffiRY WARD It is our policy to allot FM radios to stop towns with opeptip\nFM stations....Have 9 T AM and FM table model available at $79.95 also console at\n1134c95 and combinations at $189.95 and $234.95 which we are allocating to our\nptores as production permits. , , . ^ , noyr, „ 4.^+o-i ^-r\nThe Radio Manufacturers Association reported that in Februpy 1947 a petal ol\n1 sets of all types were produced (AM, AM-FM, auto-radios, televispn}.\nIncluded were 53,594 AM-M receivers, of which 45,626 wpe consoles and 7,968 were\ntable models. In this tabulation also were 6^,24^ television sets.\nFACILITIES AND THE FEC . . x 4-\nlaL_(St.Olaf, Northfield, Minn.) application for CP to install new trans¬\nmitter, AM 770 Kc. (March 18) , . . . ^\nY,;HAD_(Delafield,V'is.-State-Station) authorized change in asspnment of iM\nnon-commercial educational station from 91.1 Me. to 9.7 Me. (March 20) ,.\nUniversity of Alabama Bd. of Trustees) Tuscaloosa, Ala. ) accepted for filpg\napplication for CP ncTJ non-commercial educational station on frequency to be assigned\n3 Kw., emission A3, Uni. (March 21). „ o\nWLSU-(Baton Rouge, La.) accepted modification of CP for non-comm«rcpl\neducational station to specify frequency as channel 219, 91.7 Me. 205\ntransmitter location, change type transmitter and make changes in apenna (March 21)\nKOAG-(Stillwater, Oklahoma) accepted modification of CP. New non-commercial\neducational station, extension of completion date. (March 21) _\nTrustees-(Purdue University) dismissed application por non-pmmercial educ¬\national station 42.7 Me. 10 Kw. as requeued by applicap piarch 14)\nUniversity of Tulsa (Tulsa, Oklahoma), accepted application for CP for new\noomireroiai educational station on channel m2, 9.5 Mo. ^ watts\nBoard of Education-(Toledo, Ohio) CP granted channel 215, 9.9 Me. 800 xiatts,\nPemsylvania State College — CP granted channel 210, 9.9 Me 35\nUniversity of Indiana -(Bloomington, Ind.) CP granted for channel 215, 9.9\n55 Kw. 550 ft. antenna. . x\nINYC-(New York City) authorized extension of special service to operate\nbetween 6:00 AM EST and sunrise at N.Y., and sunset Minneapolis and 10 » EST.\n(February 2e)"
}