{
  "id": "d607-3",
  "text": ".\n1 LONG-LIFE MAGNETIC HEADS\n(Uniform characteristics during their long life)\n2 WIDE RANGE RECORDING\n(30 to 15,000 cps at 15 & 7^2 inches per second)\n3\nRELIABLE FAST START\n(Full speed in less than 1/10 of a second)\nHEAVY-DUTY RECORDING -\nis fasy for Model 300!\nView inside Model 300 . . . note extra\nrugged construction. Large, quiet ven¬\ntilating fan removes objectionable\nheat. Arrangement makes all elements\naccessible for inspection. Entire cab¬\ninet is sound proofed.\n4 SOLENOID PUSH BUTTON OPERATION\n(Adaptable for remote control)\n5 QUICK ACTING MECHANICAL BRAKES\n(On turntable motors)\n6 EFFORTLESS TAPE THREADING\n(\"Drop-in” and self-aligning)\n7 DEPENDABLE PRECISION TIMING\n(Varies less than 3.6 seconds in 30 minutes in¬\ncluding tape stretch from humidity and tem¬\nperature change)\n8 EASY EDITING\n(Fast operating selector switch)\n9 NEGLIGIBLE MAINTENANCE\n(Rugged precision drive)\nQy4m\nLmpex Model 300 Recorder completely dominates the\nheavy-duty recording field. In radio network broadcasting,\nstudio quality recording, show transcription, disc record\nmanufacture and master tape recording of numerous types,\nAmpex Model 300 has been adopted in preference to other\nmethods and equipment. The reason, complete dependability.\nThis reflects in a very real dollar saving. These savings come\nfrom greatly reduced maintenance, elimination of mechani¬\ncal breakdowns, and negligible out-of-service periods. Many\nusers have more than paid for their Ampex Model 300 out of\nthese sizable savings.\nAmpex Model 300 can deliver on these promises because\nit is a masterpiece in precision manufacture. It has extra ca¬\npacities in power, ruggedness and wide range recording abili¬\nties, making it ideal for grueling continuous service. Superb\nmechanical stability, together with the finest magnetic heads\never built, faithfully capture wide range tonal qualities of\nvoice and instrument. The precision speeds of the tape trans¬\nport system successfully avoid objectionable flutter and pro¬\nduces split-second program timing. Studio engineers are able\nto devote full attention to programming because Ampex\nModel 300 responds instantly and reliably to its principal\nmodes of operation, either by top plate push-button control\nor by remote control.\nCaptures EVERY Mood, Lev<"
}