{
  "id": "d607-32",
  "text": "MODEL 350\nAMPEX is the name that made magnetic recording a professional reality. It's a name that\nmade tape a great research tool, in the world's laboratories. Hence the Model 350 carries\non dn unrivaled standard of excellence. Like prior Ampex machines, the Model 350 is a\nprofessional type recorder. It is designed for broadcast stations, recording studios, edu¬\ncational institutions, high fidelity enthusiasts and other highly critical users.\nAll Ampex recorders have had widespread professional acceptance because of their\nfidelity, timing accuracy and great reliability. To these qualities the Model 350 adds\nnew refinements that make it easier to operate, to maintain and to service.\nAmpex\nNEW CONVENIENCE\nA new 30° slant on the top-plate puts the reels,\nediting knobsand all controls within easierreach\nof any operator — tall or short, standing or sit¬\nting. The operator is not fatigued by reaching,\nstooping, leaning or straining.\nTo save unnecessary steps, a remote control\npanel can easily be attached to a connector\nwhich is an integral part of the machine.\nNEW EASE OF CUEING\nAND EDITING\nExact locating of cues or spots to be edited is\nfacilitated by new controls that permit rapid\nshuttling between fast forward and rewind.\nCapstan drive is on the “pull” side of the head\nassembly to provide tape movement while cut¬\nting and splicing tape during editing.\nNEW SIMPLICITY\nOF CONTROL\nAt a glance the operator can identify and read\nall settings of the machine. “Feather-touch”\npush-buttons are set in individual protective\nwells with their functions clearly labeled.\nA control switch selects proper holdback ten¬\nsion for 101/2 \" NARTB reels or the smaller RMA\nplastic reels. Any possibility of tape breakage\nor timing inaccuracy is eliminated.\nAMPEX MODEL 350\nAs shown in this photo, the table top console is mounted on a base which is avail¬\nable as a standard accessory. This pedestal base provides a stable mounting at con¬\nvenient operating height. Concealed casters are provided for moving the machine."
}