{
  "id": "d607-62",
  "text": "March 9, 1962\nMr. Derate Russell\nRepresentative in the United States\nBritish Broadcasting Corporation\n630 Fifth Avenue\nMew York 20, Mew York\nDear Mr. Russell*\nI am in receipt of your letter of March 6 to Mr. Harley and two (2)\ntapes of BBC World Reports which X am returning to you after having\nmade copies for our possible use.\nHaving heard these tapes and having your letter of March 6 before me,\nI am happy to confirm our intention of making this series available\nto our affiliates. Unfortunately, our production schedule does not\nallow, at this time, for distribution of this series free of charge\nto those stations, commercial and noncommercial, which are not\naffiliated with the Hkm Radio Network. X am confident of a large\nresponse to this series from our network affiliates, end when a\nregular mailing list for the series is ascertained X shall send a\ncopy to youj this list should be pretty well settled in less than a\nmonth's time.\nWe are anxious to begin distribution of these programs as soon as\npossible. Specifically, I should like to commence shipment from\nher® to our affiliates sometime during the week of March 18. We\nshall attempt to mail each program to our affiliates the same day\nthe tape from London Is received, and in line with this I have some\nquestions.\n1. On what day of each week is the program recorded in London? This\nhas some bearing because if we are able to obtain the program\nearly in the week, Monday preferably, then a majority of our\naffiliates will be able to air the program sometime during the\nsame week. If, on the other hand, we receive the tape on\nThursday or Friday then broadcast must be delayed until the\nfollowing week. Of course, based on the content of the programs\nX have heard, this may not be a factor, but if future programs\nare quite timely then the time of receipt of the master tape\nfrom London could be crucial.\n2. Would it be possible for London to mail us a program In the near\nfuture (a program which subsequently would be distributed) in\norder that we might ascertain exactly how long shipment will take?"
}