{
  "id": "d607-66",
  "text": "RBt EW Legislation\nTot MEB Institutional Members\nFrom: William G. Harley\nDate: March 8, 1962\nThe House of Representative® on March 7 approved,, 337-68*\nHoRo 132# but with two amendments. The first amendment# introduced\nby Rep. Hemphill (De-Ala.) and supported by Chairman Harris, provides®\nfor inclusion of closed-circuit facilities which are associated with\na transmitter. Harris explained that his committee was not in favor ol\nindependent closed-circuit TV systems being eligible under this legis¬\nlation (designed primarily to activate the unused reserved channels)\nbut did feel it appropriate to Include closed circuit which was merely\nan extension of a broadcasting facility. The second amendment limited\ngrants to public educational institutions,, thus knocking out nonprofit\ncommunity educational television organizations.\nThis amendment was offered by Rep. Griffin (R.-Mlch.)* who\nwas uneasy about the wording of the definition of a community organ! -\nzation and not reassured by Harris8 comment that it would be possible#\nunder this definition# for an organization like the AFLrCXO or 0.S.\nChamber of Commerce \"to px mote a group which could apply for a\ngrant,\" Harris and Moss (D.-Cal.) vigorously opposed amendment# point¬\ning out that (1) the legislation contained three major safeguards (FCC\nlicense# approval by If.S, Commissioner# approval by State SfV authority)\nagainst irresponsible non-educational applicants and (2) that this\namendment would penalize many communities that had done the most to\npioneer the BTV movement and would discriminate against many who had\nalready made a large investment in FTV.\nRep. Halleck (R.-Xnd.h minority leader# suddenly appeared on\nthe scene to give his blessing to the amendment; whereupon it quickly\ndeveloped into a largely partisan situation and the Democrats# caught\nwith many members off the floor# were voted down 69-66,\nAfter the implications of his amendment were fully explained#\nGriffin is reported to be rather appalled at What he hm done and is\nready to work to repair the damage.\nThe bill now goes to a Conference Committee to iron out dif¬\nferences between the House and Senate versions. Both Senate? and House\nleadership are determined to restore the eligibility of the community\ncorporation. Best bet* tightening of definition language re nonprofit\ncommunity television organization# particularly the clause ’and"
}