{
  "id": "d1168-3",
  "text": "Discount Marks 400 Years of Shakespeare\nOregon’s Shakespearean Festival offers a 50 per cent discount\nfor student groups as part of its 1964 activities celebrating\nthe 400th anniversary of the Bard’s birth. The reduction will\nbe available July 12-31 to high school, junior high, and col¬\nlege undergraduate students. For details, write: Director of\nStudent Tours, Shakespeare, Ashland, Oregon.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Miss Julie Hunt, Placement Service,\nat the NAEB office in Washington.)\nMay I Married man, 39, expects to receive M.A. in speech\n(radio-TV) this summer; wishes to teach in college radio-\nTV department or work in educational radio or TV; would\nconsider teaching a beginning general speech course.\nExperience: 10 years in commercial and collegiate radio\nand TV; 2 years as graduate assistant to instructor of\nradio and TV courses; has supervised a collegiate car¬\nrier-current station. Location and salary open.\nMay 2 Man with I I years commercial experience, including\nall phases medium-market TV as producer-director, pro¬\nduction manager, program director. Now teaching broad¬\ncasting at Big Ten university. Present job includes audio¬\nvisual work, instructional programing, production, su¬\npervision, teaching machines. M.A. in speech (radio-TV)\nwith strong education minor in June, 1964. Thorough\nadministrative-production background, including design¬\ning and getting TV stations on the air. Desires similar\nand/or teaching position with college or community sta¬\ntion. Will work 9 months if Ph.D. opportunity is near.\nMarried, 33; salary open, location not as important as\nchallenge and potential.\nMay 3 Single female, 22, master's degree candidate at New\nYork University, seeks summer position in ETV. Back¬\nground includes lead singing in musical productions, a\nyear of teaching experience, writing of school revues.\nAnxious to learn and will work in both production and\nprograming.\nMay 4 Single 21-year-old male with B.S. in English and speech\ndesires summer or permanent employment with educa¬\ntional radio or TV in Midwest. Salary open; will con¬\nsider commercial operation for summer.\nMay 5 In ETV for 6 years, all phases of production, both sides\nof camera. Wants challenging production manager or\nP-D position in broadcast ETV. Looking for exciting sta¬\ntion that emphasizes quality and quantity and broad,\nbalanced programing philosophy. Primary interest in\ngood well-conceived programs and an active, interested\nstaff, or the potential for these. Married, 31; B.A. in\nliberal arts; M.A. in radio-TV, Sept., 1964, from Michi¬\ngan State. Extensive background in photography and\nfilm. Prefers West or Southwest. Salary $6000 minimum.\nMay 6- ETV producer and program development specialist\nwith 8 years experience public service TV production\nand 2 years commercial radio. In doctoral program in\ncommunication. Prefers East Coast university as producer\nand teacher or ETV station staff. Will consider closed-\ncircuit responsibility or communication research.\nMay 7 Producer-director for television. Experience gained at\nlarge metropolitan commercial TV station. B.S. in teach¬\ning of social studies and speech, with an excellent back¬\nground in radio and TV courses, from Temple Univer¬\nsity. Single male, 21. Available after June 20.\nMay 8 Professional instructional and non-commercial TV pro¬\nducer and administrator. Married with family, age 29.\nM.A. in communications and 7 years experience in all\nphases of noncommercial broadcasting. Capable of step¬\nping into an administrative production or management\nposition. Location open, but the East is preferred. Mini¬\nmum salary $9000.\nMay 9 Graduating in June with B.A. in radio-television; ex¬\nperience in many phases of TV operations. Desires po¬\nsition on production staff as copywriter or production\nassistant. Will do on-camera work. Single female, 22.\nSalary and location open.\nMay 10 Available September I, ambitious young man with\nM.S. in speech (R-TV) and English minor. Experienced\nin both commercial (3 years) and educational (U/2\nyears) radio and TV production. Desires position pro¬\nducing and/or directing ETV. Would also like to teach\nbroadcasting. Highest references, single, 23, location\nopen, salary $6000-$7000.\nMay II Single male, 29, with B.S. degree in journalism, ma¬\njoring in R-TV, and seven units towards master's in R-TV,\nwould like a position offering a variety of opportunities\nin ETV, including on-camera work, production and di¬\nrection, and teaching R-TV courses. Has been news di¬\nrector for university radio station and worked at univer¬\nsity TV station in the production department. Has done\npromotional work in addition to appearing on two state\nETV panels. Location and salary open.\nYoung man presently associated with ETV in Salisbury, Southern\nRhodesia, anxious to spend three to five years in U. S. to study\nand qualify in the uses of TV and other A-V aids in education.\nParticularly interested in studying possible uses of TV for edu¬\ncation in under-developed countries. University graduate and\na trained specialist teacher. As producer at the ETV station,\nwas responsible for work in organization of subcommittees to\nestablish the need for educational programs, research into\napproach and content material of approved programs, super¬\nvision of contracted script writers, supervision of filming of in¬\nsert material for programs, pre-editing all material for programs,\ndirecting production of the program in the final stages for\n'Kine-recording,' writing and editing program publications for\nuse by schools and other institutions.\nIf your institution could provide an opportunity for this\nyoung man, please contact Julie Hunt.\nPOSITIONS AVAILABLE\n(In order to be considered through these channels, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nMAY-1 Producer-writer. Job open starting June 8 for one\nmonth of summer work, resuming September 8. Candi¬\ndates should be male, 25-35 years old, with degree in\neducation and/or professional communication areas.\nNorthwest location.\nMAY-2 East Coast university seeks young man (25-35) as in¬\nstructor in undergraduate school and producer-director\nof instructional tapes. Must have master's degree; Ph.D.\npreferable. Salary, $6000-8000; position open in Sep¬\ntember.\nMAY-3 Production manager for new VHF community ETV\nstation in Great Lakes region to begin operations as\nsemi-satellite of large ETV station in same area. Salary\n$7000 to $9000.\nMAY-4 University in Great Lakes region has opening for\nradio announcer July I. Applicants must have a B.A. de¬\ngree and a Third Class Operator's Permit at time of\nemployment. Must have a knowledge of classical music\nand training in at least one foreign language. Annual\nsalary $5500.\nMAY-5 Chief announcer at university radio station in Great\nPlains region. Will also do some teaching in radio and\ntelevision. Master's degree required. Starting pay about\n$5000 for 12 months, with one month vacation. Position\nopen June I.\nMAY-6 TV technician for large university in California. As¬\nsist in design and construction of closed-circuit TV fa¬\ncilities. Operate and maintain studio and mobile cam¬\neras and VTR1. Good long-range opportunities in grow¬\ning department. Minimum requirements: I year TV ex¬\nperience and graduation from technical school or 2\nyears of college. Additional experience preferred. Sal¬\nary open.\nMAY-7 Middle Atlantic university seeking instructor in radio-\nTV-speech. Master's degree required. Salary approxi¬\nmately $6200. Position for September.\n4\nNEWSLETTER"
}