{
  "id": "d775-12",
  "text": "3\nits own language capable of 9‘total statements without lineal syntax89, as William Xvins has\nexpressed it. Yet the concept of 3 audio-visual aids58, @r television and radio as variants\nof such aids , ignores their real nature as new forms of communication. Not to grasp and\nteach the peculiar properties of these media, as we nmst understand the true nature of print\nas having distinct characteristics, strengths and weaknesses, is to expose all media to\nthe attrition of the new media rather than enrichment in conceit with the new media. The\ntelegraph, telephone, radio, and television create patterns of attention quite alien to print\nand put our huge cultural stake in the printed word in jeopardy by indifference and inattention\nin the glass room.\nTo teach the special powers of these new media in the context of manuscript culture,\nprint, pictorial journalism, the movie, and ail other sources ©f information, education and\nconditioning, is to begin a realistic educational program of training in media literacy.\nUntil now, few individuals other than poets, painters, musicians and some commerical\nusers have seriously tried to cope with the new art forms involved in these new media.\nEducation has generally not examined their true nature and possibilities. Yet today the new\nmedia have become an integral factor in our global co-existence,\nIII. Objectives: To devise a beginner9s handbook, a series of small books, or a syllabus^\nor all three, adapted to the training of media perception and judgement in the school^ with\nemphasis on television and radio. Since all media,from the phonetic alphabet to television,\nare inseparable from the development of the arts, sciences and social instititions, it will\nobviously eventually be necessary to correlate media training with almost every aspect of\nthe existing curricula and the procedures associated with them much as reading, writing\nand English me treated today, particularly in elementary and secondary education. All\ncurrent experiments with these new media would be useful and relevant to the preparation"
}