{
  "id": "d775-18",
  "text": "RECEIVED\nNAEB HEADQUARTERS\nDEC 1 9 1958 29 Wells Hill Avenue\nToronto 10, Ontario,Canada\n7|8|9|lp|Jl|12|J|2!8|4|6|6 December 16, 1958\nl\nDear Harry,\nI wish I could have a visit with you for a few hairs about this\nproject. Am sure I under-estimate the significance of expressing\nto the committee the kinds of Ralph Garry tie-ins you mention.\nrj* had a long chat today with Bruce Atjridge|and Fred Rainsberry\nabout this very matter. They said, \"We will script your book\n(in part) as a series of Junior Magagine programs and have the\nCBC research dep*t. do a full study of audience reactions.\"\nfwe\n| ru\nWe could have the kinescopes of these shows for further test\nruns anywhere we chose to do them.\nI hope, Harry, that this is the kind of thing you have^in mind.\nMyself,Ifm so damned tied up in meditations on the unique\nproperties of the media that I just haven*t given thought to\nthe angles you mention. But I would naturally tend to get to\nthat phase in the process of writing the book.\nOh, yes, for title, how about:\nUNDERSTANDING MEDIA ?\nThe CBC offer is really princely. I know these men very well\nand can really work with them. They are giving us carte blanche\nfor the whole network; that is, large scale access tq parents T\nstudents, and teachers, all at once, and over an extended period\nI donrt think they would have made this offer if they hadn*t\nknown and admired you, Harry. So we can*t let them down!\nIf we can get the CBC kinescopes done early in 1959, we should\nbe able to try them in many jiir&uits and places. And reactions\nto them would enable us to devise great improvements.\nAnother part of presentation I have skimped is audience appeal.\nBut not knowing the make-up of the grants committee, I quite\nnaturally have played it neutral. With your encouragement,\nthen, to make a stronger case , how about such slants as these:\nThe class-room as we have long known it is a by-product\nof the book form of codified information. That is, the\nexactly repeatable form of information made available by\nprinting made possible the assembly of the young in single\nenclosed spaces for instruction. Before printing the\npattern^of assembly were varied. But printing also trans¬\nformed the curriculum,/ since it was no longer necessary to\nspend assembly time in having the students make their texts,\ngrammars, and dictionaries.\nToday we face an even greater transformation ,both of\nassembly patterns and of curricula. It Is now necessary"
}