{
  "id": "d775-19",
  "text": "2.\nto be quite explicitly aware of the dynamic properties of\nthe media forms we have long used ,as well as of the powers\nd properties of the new forms of this century. For\ncenturies educators have lived under the monarchy of printing.\nSince photography, movie, telegraph, telephone, radio, and\ntelevision, educators have found themselves in a confused\noligarchy of new media. Educators now face students who,\n“ n~terns of the information-flow of their experience,\nspend all their waking hours in classrooms without walls,\nas it were. As for the traditional class-rooms, here the\n^students face teachers who are illiterate in the new media\nand not too sur f'otli^n^ \"p^^tion of the old medium of\nprinting under the new regime. roJLft.^f.\nprinted word has itself changed in school and society alike.\n/The rple of the teacher has changed even though the teachers\n{have not. The students sense discrepancy.and irrelevancy,\nand their attitudes vary accordingly. Oxffside the classroom\nstudents are faced with a phalanx of technologies which coivvey\ngreat quantities of information with global range and content.\nThe prestige and power of these media Afe greater by far\nthan those of the older form/ of printing. And in the presence\nof these media the students are on their own. A world\nof global educational scope comes disguised as \"entertainment\".\nFor the perception and judgment of this new world of experience\n1 students receive no training. They are warned that it is\n^vulgar and passive and conformist, and they value it the\nmore a eo.ordi ng1,y^ T purl ng the first decades of the Gutenberg\nJera the custodians of manuscript culture sat on a Maginot\nv Line and deplored printing. Printing in turn released the\n* power of the vernaculars as new media, and classical\n[humanists deplored these vulgar tongues.\nv\\\\-e\nThis period of lament provides just the time and the tone\nin which to en^e-r the older culture.\nI\n, Jgut today we cannot afford to liquidate and ^nter the huge\n'establishment of social and politicalachievement represented\n^by printing. Yet if we fail to disentangle the dynamics\nk of the medium of printing from the new media\n'Hk shall havakided in the destruction of the culture and\n{institutions/based, on printing. It impossible and neces\n\"tTCTday to embark on a new educational venture, namely\nuniversal education in the languages and value^of the\nmedia themselves.\nssary\nFor teachers to use movie and television in the classroom,\nwithout awareness of the powers these media have to reform"
}