{
  "id": "d775-23",
  "text": "December 13, 1958\nDr. Skcralat tfr. Hill called from Chicago at 10»00 AM with hia rambling\nnotes on Marshall McLuhan's proposal. He said he vaa going to write\nthffla and send them to you but thought you would have them faster if he\ncalled and gave them to me over the phene. If you want to reaehhlm\nanytime today he will be in Chicago. The number ia Lincoln 9-7727. He\nleaves fer Washington in the morning. DBC\nHEHR AMBLING NOTES ON MCLUHAN PROPOSAL.\n-Too much emphasis on print, does not fit Hill-Elliott.\n-Don’t believe he should be tied in with axr research.\n- Clearing house notes as he suggests in footnote to his letter—that\nwould just clutter and confuse*\nTry The following are in reference to Sections of his proposal;\nI - Old? This probably refers to print and is something beyond the scope\nof the bill.\nH - \"Technological movement of information around the globe\" - doubt if\nthis is world’s biggest industry. Hia definition of the problem is a little\nhazy f**gi won’t be clearly understood, I fear. Still acre reference to\nprint.\nIll - Impression might be that this would result in \"hew to\" bock - how\nto read, listen, view. Doubt this would receive very favorable reaction.\nVI - Should be his abilities and background - just as we attempted to shew\nhow we are equipped (and preferably best equipped) to do the particular\nprojects we proposed.\nAs I mentioned when we talked about this before, we need to know how\nTV and radio act upon children. Then we’ll know mare about what to do with\nTV and ns* radio.\non the medium itself, and thax;s vnax we neeu — - VlvT*\nthis would apply also to radio) do to the viewer, regardless of the program\ncontent. In other words, what does the act of viewing (the environment,\nintergroup and interpersonal relatione) actually do - how does It differ\nfrom So reactions we have while reading—again without regard to content—\nand here if tied in this way (and maybe that's what he s saying), it would\nbe logical to tied in with reading.\nHow can we properly determine (no matter how extensive the research)\nwhat kinds of programs wo should broadcast, etc., if we do not understand\nthe effects of the medium itself."
}