{
  "id": "d775-28",
  "text": "9\ndata to manageable syntactical forms of compendious scope,\n(e.g., working with the TV image as defined by light\nthrough , rather than on, one can work with the physicist,\nthe engineer, the studio men, the program men, and the\naudience, all at once. Because all of their actions are\nin relation to TV, given a kind of organic untiy of which\nthey may be but little aware.\nWith regard to the older media historical data play the\nsame role in establishing the dynamic lines and patterns\nas the Becker-Schooley project d oes by extensive contemporary\nvision of a new medium.\nMy project is parallel and complementary to the Becker-\nSchooley job also in being designed to make possible\nin-school training of a sort which makes out-of-school\ncontacts with the media available as educational resource.\nPerhaps it would be as well not to stress the present\nconception of educational broadcasting as still having a\nheavy literary and lineal bias!\nThe enclosed application may well need much changing. The\n*theory of education* I’m working on would seem to be dictated\nby the media themselves. As for places to visit and to ®ork\nat, I simply don’t know any that have overwhelming advantages.\nBut I would choose to be at Illinois with you a good deal,\nand to visit on a hit-and-run basis all sorts of places.\nDo you think I should put in for a second year? For two years\nright off? I could then put out The Gutenberg Era as\npre-liminary volume to the Handbbok .1 have' even toyed with\nthe thought of writing down that material (on which I\nhave spent ten years and more) in the first three months\nanyway. I work very fast once I start to roll. I’m slow to\nstart.\nIndustry,which spends sixty-four billion, three-to-four\ndollars on in-industry education for every dollar the\ncountry spends on in-school education,has asked: \"vVhy not\nclose the schools?'* From their point of view, a few more\nbucks and they could handle the entire education picture.\nThis is their way of saying ’’Business used to be our culture,\nbut now culture is our business/* Since media have become\nthe great industry we must secure them for education in and\nfor and by all the media in concert.\nAnd this does re-constitute the nuclear plan of the Little\nRed Schoolhouse, where everything was taught at once. Ohly\nit is the Little Red Schoolhouse at large, turned inside^\nout, and expanded to global size."
}