{
  "id": "d775-35",
  "text": "As for title, would Languages of the Media sound better?\nAll languages are mass media; all technological media modify\nthese languages and are themselves new languages.\nAs for what you indicate asrtsecond part*, to follow the pages\nI sent you, at present I have many data for all media from\nalphabets as snapshots of the mind, to computers as wind tunnels.\nBest procedure here may well prove to be comparison and contrast\nof various effects achieved by pairs of media-- e.g., oral vs\nwritten. Then hieroglyph vs phonetic alphabet. Parchment vs.\nstone. Effects in educational a-z^ers in inter-personal area$,\nin inter-cultural areas,\nBest of alls effect on the various arts of each transition from\none medium to another. Historical data are now increasingly\navailable.\nMost of this material could readily go in film form, for survey.\nMany practical exercises would be possible. Our increasing\ninterest in Chinese ideogram is in same pattern of behavior\nas hula-hoop? i.e.,muclear.\nNew social sciences, e.g.,anthropology, approach a society as\nstructural linguists approach a language--!.e., as a total imm\ninclusive nucleus, organic form.\nStudies of media would naturally include awareness of how new\nlanguages of new media enable us to net or grasp new fields of\nawareness even in historyl\nFor your third part, \"types of school systems\" where proced ures\ncould be tested, I shall rely on you a good deal. CBC would\nhelp here.\nHow many pages would you like to see on the Part II section?\nAs for Part III, I think we might get some preliminary packaging\ndone at Ann Arbor and some consulting done at Palo Alto, for\none place. Ken Bounding is a person I could work with. You\nknow his The Image?\n(iLc\nNK- -\nNOV\n\"TE;\niBbS\n29 Wells Hill Avenue\nToronto 10, Ontario, Canad a\ns . November 9, 1958\ni\nDear Harry,\nEnclosed is a version of the Omaha talk. I found my sheet of\nheadings. Am going out of town for the week. Talks to General\nElectric Management Institute at Crotonville plus visit bo\nNYC, where I hope to get going on some media investigations."
}