{
  "id": "d775-4",
  "text": "j $v?Ke ya\nTj, . '^^r'~(/) T V\n03 V^\npo'iV/U\\l I\nACCORDING to the September 1958 issue of realizes that he. is playing a unique role on life’s stage, that\nFilm World, the Hagerstown, Maryland, five-year he js not just carrying a spear and making mob noises at the\ntime comes when the. prospective\nbeing reached on the five-channel circuit.... On teacher realizes that he must make consequential decisions\nthe average, pupils in the lower grades get ha1 • without asking mother, counselor, or roommate, that he must\nmaximum of an hour-and-a-half of classroom TV decide and act with all the grace, style, and wisdom that he\neach day. High-school seniors learn from TV a can> Woodrow Wilson puts it this way: “It makes no differ-\nhalf-hour m an hour period. ence smajj a part} how insignificant, how unnoticed.\n• When his powers begin to play outward, and he loves the\nWE have reached the point where the teacher task at hand, not because it gains him a livelihood, but be-\nmust be prepared to welcome every economical cause it makes him a life, he has Come to himself.”\nrnlio0 prog“ m8,’ Tn'educational\" fik|’ a\" T?”^ Second, the professional teacher-must.seeJiimself in the\nscope, or a tape recording. Much of the public role ofa_skilled practitioner of the art of learning. He must\ndiscussion of education in these days seems to turn Imtordylearn how to learn,\"\"but he must alscTBeSome s^nsr-^\non the proposition that the student is not m a lively aware of his methods of learning,\nlearning situation unless he is being made miser- : : , , ,\nable at the same time. I am certain that the The prospective teacher should know the circumstances\nschools are anxious to emphasize the importance under which he learns best. He has probably experienced\nof persistency and determination, as well as ability, the fact that he learns best when he is highly motivated by\nin the total educational process. But we ought b0th short-time and long-time goals. He realizes that learn-\nto remember tl^ynen^hav^ • eXperiences get zest and drive when seen as relevant to\ndeeP]y committed goals. He realizes too, that the maturing\nThis is quite as true in the learning process as else- person needs to be active in that search for relevance, and he\nwhere. It may build character to use fireplaces for knows that forgetting is the blessed mental balm for irrele-\nheat and tin tubs and cold water for bathing, but ya^ experiences.\nno Americans and few Englishmen have been able . , . , T c .\nto resist for long the comfort of central heating The prospective teacher asks himself: Why do I forget?\nand of hot and cold running water. If it be possi- Why do I remember? How does it happen that a single rich\nhie to learn a thing with half the time-and effort experience, unrepeated and not drilled upon, stands clear and\ntkrnngh the yse of an educational film or any other lumjnous }n my memory, while other, endlessly repeated\nexperiences remain foggy or dim?\ngence. Effort should be expended when needed, The prospective teacher knows what he is trying to find\n' where needed, and for as long as needed—but it out, knows where to find answers to his questions, knows\nis contrary to the whole experience of mankind to J1QW j-0 extract that information, evaluate it, and put it to\nexpend it when it is not needed ( Pe^me He will have his own professional library, and these\nNEA Convention in Cleveland, July 2, 1958, by days it will contain many paperback books, some of which\nDr. Virgil M. Hancher, President, State Univer- will certainly have been used in his classes. For the prospec-\nsity of Iowa.) tive teacher to say that he hasn’t time to read books in his\n* own field is to suggest that he hasn’t time for getting an edu-\nA PUBLIC service pattern established by Ohio cation. Unless a person has become a self-motivated, effi-\nTV stations with OEA in 1954 found enthusiastic aent? critical reader, he is not ready to teaclu- - -\nnationwide acceptance last month. More than 400 r 11 -j • .1 r r 11\nstations, from Bangor, Maine, to Honolulu, took The crux of all guidance in the four years of collegiate,\npart in the “premiere week” for the new film liberal, and professional education is that the teacher must\n“Crowded Out.” All Ohio stations, as has been learn to go it on his own. It is trite and tautological to say\nthe case each year, telecast the film. Prints of the ^at all education is self-education. But if the teacher has not\nexperienced the delights and rigors of study, he will not pass\nso well that it gave “Crowded Out” a second on hlS attitude to Others.\nshowing one week after the premiere. It’s a par- In an electronic age where we have now learned to record\nticularly timely film, showing the educational im- t^e Sp0ken WOrd and image, recreate by photography the\n__£act__which occurs^jwhen enr^lmente_ outgjft, event jtsei£ far ancJ near), we would expect our teachers\nto be sensitive to possibilities of the electronic media. We\nwould expect them to be sensitive toTKeT^\nThe News Letter\nfacilities^ (The Sc/wot Beat, October, 1958. Pul>\nlished by Ohio Education Association, 213 East\nBroad Street, Columbus, Ohio.)\n[2]\nj"
}