{
  "id": "d775-42",
  "text": "of such a book or syllabus. It would be a means of enabling teacher and student alike\nto share their day-by-day awareness of many media in a meaningful pattern of shared\nexploration and discovery. It also would develop the capabilities and discrimination\nnecessary to make the entire world of out-of-school media an educational resource\ninstead of an educational obstacle.\nV. Other Related Research: Marshall: This you’ll have to fill in with something,I don’t\nhave altogether, as I write this, the various scraps I've sent you (the Nichols book,\nstuff in English Journal etc,)* 1 hope you can list what is known (perhaps also on \"learning\ntheory85) in this section, so we don’t say only that little, basically, has been done.\nHave you written to, or heard from, Harwood? He had some leads. Mention Ivins, etc.\nMaybe part of V needs to be transferred to this section. I understand that Chapter 15\n\"Mass Media of Communication\" in The Teacher’s Role in American Society, by Lindley\nJ. Stiles (N.Y., Harper, 1957, $4,00) might be useful, but someone else has the only\ncopies the library here owns, and I’ve not been able to see. See also May and\nLumsdaine’s Learning from Films (a separate sheet on this is attached). This is an\nimportant section of the application and should contain accurate bibliographical or other\nlistings.\nV, Procedure. Much work has already been done in many fields which can be readily\nbrought to a focus for media training. Basic work on the psychic and social meaning\nof print, for example, has been done by H.A. Innis, H. J. Chaytor, and Wm. Ivins.\nThe same is true for press, photography, movie, telephone, telegraph, typewriter, radio,\nand television. Bufch su work has never been correlated nor codified for use in the\ngeneral training of perception in a manner that would enable teachers to teach children\nhow to understand and cope with the full meanings of these media, especially television\nand radio, in an intelligent, usable manner. Such codification would itself lead to a"
}