{
  "id": "d775-43",
  "text": "s\n'great variety of new perception and study. A book,, or a beginning (as this project\nproposes) which reduced the language of a medium like television to syntactical form,\nwould work with and for the physicist, the station engineer, studio personnel and the\naudience all together. All of their actions are,in relation to television, given a kind\nof organic unity from the medium itself . And all kinds of persons engaged in all the\nmedia can contribute valuable insights to the student. The advertising industry has\nopened up aspects of these unexplored areas for its private benefit. But such private\nbenefit can be extended to all and is critically needed by education for the public\nbenefit of education.\nThe assistance d 3ndre Girrard, the painter (with CBS and NBC) is an example of the sort\nof aid which this project would enlist. The insights of the media industries themselves can\nbe of great assistance in developing a philosophy, which will be developed into book and\nsyllabus form, to bring to the classroom a new media literacy needed for coping with the\nwhole range of our twentieth-century nedia, if they are to become educational resources.\n(See also VI below)\nAs consultant: We propose Dr. Marshall McLuhan, Professor of English at the\nUniversity of Toronto, co-editor, of Explorations magazine & distinguished media specialist\nlecturer and author who has done much work in the field of relating media study to educational proce\ndures. He is prepared to undertake this project and to finalize it into book and syllabus\nform. Experiments in inter-media values have already been conducted and reported on\nin Explorations, published by the University of Toronto. These articles, and the interest\nthey have aroused among specialists and educators provide examples of Dr. McLuhan's\nqualifications, and,the springboard for this project.\nyn« Facilities: Dr. McLuhan would have tcjoravel a good deal in order to consult with m\na wide variety of persons in all phases of media work today and to use as resources many\nprojects in progress. These would include various closed circuit projects as well as others"
}