{
  "id": "d775-5",
  "text": "v\nV\nconceptualizations move from three-dimensional to two- IN evaluating performance of a discussion group,\ndimensional to single-dimensional, from direct experience to \\ before- and after-discussion choice was made\n., • 1 .1 “rr i i from five possible solutions offered to each of four\nthe sign and then to the symbol. problems. Grade, were on the bash of . “pre-\nThird, a teacher assumes the role of a specialist in subject ferred solution” (i.e., staff preferred). The mean\nmatter. Unthinking persons have sometimes referred favor- of the post-tests was significantly higher than that\nably to mere subject matter. Subject matter, the distilled of tbe pre-tests during a six-week period. This\nexperience of the race, is never mere, although it may be dearly indicated that the das. as a whole profited\n. , , r , , . . ii from discussion at a constantly accelerating rate,\nunsitable for students because It IS too hard, too easy, too («Evaluat;on of Performance in the Discussion\ncondensed, too expanded, or too irrelevant. .Discovering rele- Course at Ohio State University,” by W. E. Ut-\nvance is also the student’s responsibility and not ■excIusTveTy\"terback, The Speech Teacher, September 1958.)\ntRaFaTthe teacher or the textbook writer. • ^\nHowever, to be a master of a field of subject matter re- ^AY ENJOY READING: V\nouires more than information One must also make that The Chmate °f Learning, by Ordway Tead. \\\nquires more man inrormation. une must also make mat New York: Harper & Brothers, 1958, $2.50. The \\\nsubject come alive by using it the way a linguist or a biologist first j0hn Dewey Society lecture. —\nor an arithmetician uses it. jjThe teacher of English who is Fundamentals of Measurement: Techniques and\nnot an active student of the EnglislTjanguage mt^tearh a Practices, by Norville M. Downie. New York:\nkind of grammar whiyh a-drnguisticaTf\nwould reject. A teacher of physics or cf\nv sophisticated person |°xford University Press, 1958, $6.00.\n. E ' CCT To i rr 1\\/T ofYOrimo A rfi/>1/if» n n n C\nvoa^a-Atea^p^ics or chemistry must keep up 'w®\nWith hlS field, live the subject matter. Journal, October, 1958. Articles serve as good\nThe able teacher will now justly reply: “You are setting models of expository prose,\nup a standard which the public as yet seems unwilling to pay The Bulletin of the American Society of News-\nfor, one requiring a much closer linking of subject matter Editors, published eleven times yearly by\nfields with teacher education.” This is true. Tl^rpectiye\nelementary teachgr_ may , al_sp„,qof^-that toJieHamrliar with Dawson, Curriculum Digest (San Diego City\nchildren’s literaTure. to master the science and art of reading. Schools in Action), October, 1958.\nto achieve realdepth and unHSrstanding in arithmetlcTp'lu^ “Comments on the Evaluation of Essays,” by\nseveral other subjects, will make excessive demands on the Robert R. Gard, Illmms English Bulletin, Novem-\npresent four-year curriculum. This is probably true.but we iuL'.9 A*cktion of T^eTof EngLY 09\nshould not let our standards of excellence be obscured by our English Building, Urbana, Illinois. Price: $2.00\npresent inability to achieve these ideals. Certainly if we are per year; single copies, 25 cents,\nclear as to what we want and need, we are much more likely “Woolly English,” by Sir Linton Andrews,\nto get it Bulletin of the American Society of Newspaper\nMy fourth point is that a teacher must be an effective ^^\"’ Decembcr 1, J_958- Excerpts from an\n1 . Vt -=-- -t -t_-1 .-address before the Bradford English Society, re-\ncommumcator. He must, as just noted, have ideas to com- printed from the Journal of the Guild of British\nmumcafdoFknow where these ideas are available. But every Newspapers.\ncommunicator has an audience, persons with whom meanings “Let’s Look at the Record! The High School\nare to be shared. In college the student has been communi- Preparation of 1124 University of Kansas Fresh-\neating chiefly with his professors or his own peers. Now he ansas Stu tes m Education, September,\nmust communicate with those who know much less than he. •\n^In any effective communicatioajve musUai^ffihat-to DEVELOPMENT of a new device with which\nsay, fhtpTie:diating vehicle, to- ana we must know the^the blind can read ordinary printed material such\n-reeervgr^^ This IS made especially difficult because many of as books and magazines was reported today by the\nthe messages conveyed by the school are indirect and infor- Veterans Administration. The portable unit, called\nmal, not the formal message in a book or a teacher presents\ntion. There is alsc^limate Qf.loaFning inii..school or college of Columbus, Ohio, under VA contract. ... At\nwhich promotes orth warts Student motivation and learning, the present stage of development of the reader, the\nThe teacher as communicator must know and understand sounds it produces do not resemble those of speech\nwhat boys and girls are like, the things and ideas to which bJlt ar,e Patterns of musical tones similar to chords\nthey respond or which they reject. One sixth-grader may Sed°L“ uWmatdy sCKSn .“reading\nread at the third-grade level, another at grade nine. An speed of from 15 to 30 words per minute. (Film\nadolescent may act like a man one day, like a little boy the World News, November, 1958.)\nDecember, 1958\n[3]"
}