{
  "id": "d775-6",
  "text": "READER'S Choice, sponsored by Scholastic Mag- next. The prospective teacher must get these ideas about\nazines, has cataloged and graded for difficulty and children out of the books and into her bones,\ninterest levels 300 paper-bound titles for use m .\nelementary and secondary schools. Most titles ap- Another principle in communication is that knowledge of\npear on the lists of the H. W. Wilson Co., the a field does not guarantee that one can communicate that\nNational Council of Teachers of English, and the knowledge to Others. jQften a sperJaliv^dbarkarniind may\nAmerican Library Association Price: 25 to 5° mistakenly lead a teachex.to~EilSeve.that bi Jiit&ere ot reild^ .\ncents per copy, with discounts for quantity orders; — \"*•**' * . . , , , . ... , tst- ^\nminimum order, 20 books. Address: ReadersL^^-6”*^ T° COmi?Uim'\nChoice, 33 West 42nd Street, New York 36, N.Y. cate one must know and be able to translate his knowledge\n• into the language of the listener, of the reader. But com-\nWRITE TO: munication is more than a simple onerway conveyance of an\nClaremont College Curriculum Laboratory, idea. It also involves the evaluation and interaction which\nHarper HaU. Claremont, California, for Reaiing {he able teacher encourages and assists.\nm a Geophysical Age, Twenty-1 hird Yearbook of 0\nthe Claremont College Reading Conference, 1958, Fifthrthe-ptK5Sp€Ctive^teacher must play a role in a con-\n194 pp., $2.50. text larger than.lhe classroom. He must indeed be sensitive\nU.S. National Commission for UNESCO, De- to his responsibilities as a citizen of a democratic nation,\npartment of State, Washington 25, D_C„ for Turn Stud;es conducted by Dr. H. H. Returners of Purdue on the\nEast roward Asia, the report of the Sixth Nation- . , r , . . / , , ....... . -«r*\nal Conference of the UiS. National Commission attitude ofJiigh jjthoo] Students toward^ClVllJAffitiarffiJ\nfor UNESCO, held in San Francisco, November censorship ar^istudang^ IFyotm^p^ople in teacher educa-\n6-9, 1957. tion are not sensitive to our great traditions of civil liberties,\nDivision of Radio and Television, Chicago Pub- then they cannot in turn convev an appropriate attitude to\nlie Schools, 228 North LaSalle Street, Chicago ., the;r students. George Washington', for example, spent only\nIllinois, for sample Handbooks for Teachers' JJse r . . ,. f 0 r . , , . , r ’ r . ,\nWith Radio Programs. Areas represented' are seven years of his life after boyhood when he was not in pub-\nScience, Literature, Foreign Languages, Social lie service. Our democratic tradition of universal education\nStudies, and Music. Please indicate subject area was fought for by public-minded citizens, not handed over\nand grade-level interests, and send 25 cents for on a platinum platter.\n^Superintendent of Documents, Government If is a g?°d thing t0 have a\" intellectual Understanding\nPrinting Office, Washington 25, D.C., for Andy- of the meaning of our democratic traditions. It is quite an-\nsis of Research in the Teaching of Mathematics, other to feel it deeply. The Greek word for a person not in\n1955 6? 1956, by Kenneth E. Brown, Bulletin pUHic life gave us the root for our word “idiot.” Today,\n1958, No. 4, 73 pp., 25 cents. jn the opinion of some, an idiot is a person in public life. The\n• teacher as a citizen could help change this point of view.\nA SPECIAL issue of the International Journal of t 1 nrofes<.:ona1 education of teachers the resnonsibil\nReligious Education deals with the topic “How to . An ,me professional education ot teacners ytne resgonsi^Dil-\nUse Audio-Visuals in Christian Education.” k^y to the ^community as a whole mustJ^e-seen..as .an integraL.\ncontains special articles prepared by both religious part oftheTFSlnmg program. I don’t suggest that it is easy,\nand audio-visual leaders on how the various audio- or tH^wT^irdevefop' a neat course in citizenship—far from\nvisual materials can be used effectively for relig- However, the environmental atmosphere of the teacher-\n.ouscducauon and church pmgrams. Address: B°x educat;on program must reflect an active Commitment to\n238, New York 10, N.Y. Price: 50 cents per .. , r . P . . „ . . „ , ... .. ,.TTT\ncopy, with discounts for group orders. responsible citizenship. Benjamin Franklin said it well: “We\n• may make these times better if we bestir ourselves.”\nAT the March 1958 Conference on College Com- . In conclusion, then, a professional teacher must come to\nposition, Georgia Theodore of Chicago Teachers himself, must be a real person. He must become an efficient\nCollege said: “Learning to read is a continuous learner, sensitive to his own processes of learning. The\nprocess which needs carefully planned, systematic teacher must have mastered the subject matter of his own\nS^”and rtt ^ld and developed tastes and plans for continued profes-\ning is the provision of instruction which will result sional growth. He must learn how to share his experience\nin increased competence in a student’s ability to with boys and girls, with young men and women, Become an\nread with greater depth and breadth of meaning,^xfi^ctive communicator. And finally he must see himself as\nto react more thoughtfully and critically to ideas a person in the public service, dedicated to helping others\ningrwS incrSstag uT. g“de!lo build a freely communicating, inclusive society.\nfurther thinking and action.” Edgar Dale"
}