{
  "id": "d1630-0",
  "text": "o/;fe NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 30, NO. 4 WASHINGTON, D.C. APRIL, 1965\nr\nNAEB Supports\nArts & Humanities Bill\nIn testimony before special Senate subcommittees on March\n4, NAEB-ETS-NER spokesmen endorsed the aims of the\nbill which would establish a National Humanities Foundation.\nNAEB—President William G. Harley spoke about the con¬\ntributions of educational radio and TV to the purposes and\nobjectives of the proposal.\nJerrold Sandler, executive director of NER, spoke about\nthe “seed money” necessary if educational radio broadcast¬\ners are to continue to produce programs of the stature of th -\never-popular Ways of Mankind. He urged that funds for dis¬\ntribution and payments to artists and performers not be rigid¬\nly subject to the “matching” provision, saying that in radio’s\ncase it is likely that those costs would considerably exceed\nactual production costs. He also pointed out that about 20%\nof the educational radio stations now on the air began broad¬\ncasting within the last three years, and that 70% of the out¬\nput of the NER network during 1964 was in the arts and\nhumanities area.\nChalmers H. Marquis, ETS executive director, stated\nthat many ETV programs have been lost forever after broad¬\ncast because the money was not available to record them—\nand added that he hoped funds from a National Humanities\nFoundation would help. Pointing out that approximately 60%\nof America’s population is within reach of the 100 ETV sta¬\ntions now on the air, he talked about their role in presenting\ncultural programs throughout the country. He also mentioned\nthat it was desirable that persons being considered for the\nNational Humanities Foundation Board or its committees have\nsome ETV knowledge.\nIMD Raises Placement Fees\nThe NAEB Individual Member Division Board of Directors\nhas announced an increase in fees for NAEBers registered\nwith the Placement Service. Effective May 1, 1965, the fees\nwill be: $10 for initial registration, $5 for updating credentials,\nand $40 payable when the individual is placed. Those currently\nregistered will not have to pay additional registration fees, but\nwill be required to pay the $5 and $40 updating and place¬\nment fees when applicable.\nDenver Named Convention Site\nThe 1967 NAEB national convention will be in Denver, Colo¬\nrado. Dates will be announced later.\nThe 1965 convention will be October 31-November 3 at\nthe Sheraton-Park Hotel, Washington, D.C. In 1966 Kansas\nCity will host the convention. Bids are currently being ac¬\ncepted from Midwesterners for the 1968 site.\nBids Accepted Now for 1968 Convention\nNAEBers in the Midwest who want to submit bids for the\n1968 national NAEB convention should have formal bids in\nthe Washington office by June 1. Details on information to\nbe included are listed on page 1 of the March Newsletter.\nCopyright Hearings Begin April 28\nCongressional hearings on the proposed revised copyright law\nare slated to begin April 28, probably continuing for at least\na week. Members of the ad hoc committee representing edu¬\ncation will be invited to testify.\nSamoan ETV Proceeds as Planned\nAs the NAEB ETV project in American Samoa enters its\nsecond phase, new faculty and staff are scheduled to arrive\nand begin work the first week in July, with three new high-\npower transmitters slated to be on the air September 15. The\nnew personnel and equipment will extend direct TV instruc¬\ntion through the twelfth grade, in addition to the present ele¬\nmentary school schedule.\nThe NAEB is supervising the additional planning and en¬\ngineering, and members of the NAEB staff will coordinate the\nrecruitment and training of the new TV teachers and techni¬\ncal staff, and supervise the development of instructional ma¬\nterial.\nAmerican Samoa’s Governor H. Rex Lee has said that he\nfeels that the experience and knowledge gained in the de¬\nvelopment of this first al'l-out ETV program will establish\nguidelines for extending educational opportunities in many\nother underdeveloped areas of the world. He also says that\nthe measure of success achieved by his ETV staff during the\ninitial phase of the program in the elementary grades fully\njustifies the confidence of the administration and the Con¬\ngress in the plan.\nNAEB Testifies\nOn Higher Education Bill\nA number of NAEBers submitted statements to the House\nSubcommittee on Higher Education, in support of the pur¬\nposes of the Higher Education Act of 1965. Jack Summerfield.\nvice chairman of the NAEB Board of Directors, requested that\neducational radio and television be specifically included in the\nproposed legislation, as they have been in the elementary and\nsecondary education bill.\nOthers who testified for the NAEB were: Robert F.\nSchenkkan, chairman of the ETS Board; E. G. Burrows.\nFrank W. Norwood, and Mrs. Marjorie Newman, all mem¬\nbers of the NER Board; and Frank M. Woolsey, Jr., M.D.,\nchairman of the postgraduate medicine department of Albany\nMedical College, pioneer in the use of two-way radio com¬\nmunication for continuing medical education.\n1"
}