{
  "id": "d1422-3",
  "text": "{^Ews Letter\nPage 4\nAugust !, !94.p\nBUT ALSO THE SOCIAL AND ECONOMIC, ATOMIC ENERGY AND INTERNATIONAL HEALTH\nSubcommittee MEETiNGSo Regarding the latter, which are held at the Henry\nHudson Hotel, and for which the UN itself has made no broadcast provisions,\nTHE Municipal Broadcasting System has offered the use of its facilities\nTO ANY STATION DESIRING TO AIR ANY OR ALL OF iHE MEETINGS# ThUS FAR THIS\ncoverage HAS BEEN EXCLUSIVELY AVAILABLE TO LISTENERS ONLY®\nMunicipal receptions, patriotic celebrations, cfvic events account for a\nSIZEABLE PERCENTAGE OF WNYC*S TIME ON THE AIR AND OF COURSE WILL CONTINUE\nto do SOo\nNews of the world receives additional time and the new schedule of \"five\nMINUTES OF NEWS FIVE MINUTES BEFORE THE HOUR*' HAS ALREADY FOUND FAVOR WITH\nour NEWS-CONSC I Ol'S LISTENERS, ACCORDING TO SEYMOUR No Si EGEL, DIRECTOR OF\nPrograms for WNYC«\nDRAGOQ NAMED PROGRAM DIRECTOR OF K A L W\nK, Qo OraQOO HAS BEEN NAMED AS PROGRAM Of RECTOR OF KALW AFTER AN ABSENCE\nOF THREE YEARS AS A MEMBER OF THE ArMEO FORCES IN THE SOUTHWEST PaCIFICo\nKALW, THE FREQUENCY MODULATION STATION OF THE San FrANCISCO BoARD OF\nFoUCATfON, may be HEARD DAILY ON 42.1 MEGACYCLESo PROGRAMS DURING THE\nsummer ARE OF GENERAL CIVIC INTEREST AND GOOD ENTERTA 5NMENTo FM PROGRAMS\nmay be heard from 9 AM TO I 1 S 30 AM AND FROM I TO 3 PM DAILY DURING\nTHE SUMMER. KALW IS LOCATED AT THE SaMUEL GOMPERS TRADES SCHOOL, 22nD\nAND Bartlett Sts, San Francisco JO, California.\nMajor Dragoo was commanding officer of the Se::neral Headquarters special\nMOBILE communications BATTALION WHICH HANDLED ALL COMMUNICATIONS FOR\nGeneral MacArthurs staff during the New Guinea and Philippine Campaigns.\nAs FOUNDER AND FORMER CHIEF ENGINEER OF KALVH, MR. DraGOO RETURNS TO KALW\nTO ORGANIZE EDUCATIONAL PROGRAMS AND COORDINATE KALW PROGRAM ACTI VITiESc\nThe CHIEF ENGINEER AT KALW IS Mr. KENNETH NIELSEN WHO HAS BEEN SERVING IN\nTHAT CAPACITY FOR THE PAST TH-REE YEARS.\nC«T^S ON THE ALR.>>WBAA. PjJLSPli£-yNi\n^HE DISCUSSION PROGRAM ”TH£ CITIZENS OF TOMORROW SpEAK\" FINISHED ON MaY 9\nITS SECOND YEKR ON THE AIR AS PART Of THE PURDUE UNIVERSITY SCHOOL OF\nThe Air. During the past fchool year, twenty-nine 30-minute programs\nWERE prepared AND BROADCAST BY PUPILS FROM LaFAYETTE'S THREE SENIOR HIGH\nSCHOOLS. Programs were broadcast from MsiS to nc45 each Thursday morn¬\ning with six PUPILS, two from each high school, taking part in each of\nTHE DISCUSSIONS. QUESTIONS DISCUSSED WERE BASED ON ITEMS USED ON THE\nPurdue Opinion Poll For Young People, an educational service of the Uni¬\nversity CONDUCTED BY DOCTORS H. ReMMERS AND KeNNE^H OaVENPORT OF THE\nD VISION Or Educational Reference of Purdue University. .\nIn the entire YEAR'^S twenty-nine discussion, FfFTV-EIGHT DIFFERENT PUPILS\nparticipated •» TWENTY-SI X FROM JEFFERSON Hj GH SCHOOL, FIVE FROM Sf«\nfRANCis High School, twenty-four from West Lafayette '^igh School, and three\nFROM SCHOOLS OUTSIDE LAFAYETTE.\nThe great majority of these pupils took part in two or more discussions;"
}