{
  "id": "d1473-0",
  "text": "President\nHarold G. Ingham, KFKU\nUniversity of Kansas\nLawrence Kansas\nV ice-President\nM. Reid White, KWSC\nWashington State College\nPullman, Washington\nTreasurer\nW. I. Griffith, WOI\nIowa, State College\nAmes, Iowa\nExecutive Committee\nCare Menzer, WSUI\nM. S. Novik, WNYC\nHarold A. Engel, WHA\nLuke L. Robert:, KOAC\nM. C. Jensen, WCAL\nHomer Heck, WNAD\nThe National Association of Educational Broadcasters\n•\nOffice of Executive Secretary\nUrbana, I11inoie\nAugust 14, 1941\nDear NAEB Member?\nFor your Information, and comments, I*m enclosing the ten¬\ntative program for the NAEB Convention which, your program\ncommittee, of which Gibbs Williams is Chairman, has drawn\nup.\nYour co-operation, and the aid of your staff> can help make the\nmeeting profitable for all. In accordance with suggestions from\nour members we have left much time for discussion among the members.\nYou can contribute.\nFlan on bringing to the Convention as many members of your staff\nas possible. Purdue is centrally located, is easily acoeesioie\non many highways. Highway routes entering Purdue are Numbers 02,\n25, 41, and 43*\nAccommodations are available in the Purdue Union Building in West\nLafayette, about two blocks from The Hall of Music, and at the\nFowler Hotel in Lafayette, which is a distance of about two miles\nfrom the Hall of Music. Prices at the Union are 12.50 single;\n$4.00 double; and $5.00 twin beds. Prices at the Fowler are about\nthe same*\nNote; All meetings will be held on Central Daytime Time, or- central\nDaylight Savings Time, if you prefer.\nAlso, all meetings will be held in the air-cond^tionea Hail o* M ■ 0fl\nin which are located the studios of WBAA. The opening session will\nbe held in the Conference Hail, and other sessions in the Audience\nStudio.\nWhile a conference dinner is being arranged for FridaytL\nwill be no speakers. A nominal charge is planned lor the mea*. -e\nhone a!3 will wish to eat together for the two luncheons (also no\nspeakers planned), which may be secured at the Union building, a short\nwalking distance from The Hall of Music.\nOur hoet, Gibbs Williams,\nget behind the Convention\non from your staff?\nie all set to receive you. Now, let®8\nand put it across. How many can we count.\nYour humble servant.\nFrank E. Schooley\nExecutive Secretary"
}