{
  "id": "d1473-0",
  "text": "■\nA E B\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL URBANA, ILLINOIS\nNAEB SCHOLARSHIPS AND\nWORKSHOP GRANTS-IN-AID\nWe would like to bring to the attention of our readers\nthat two types of NAEB financial aid's are presently\navailable to qualified applicants.\nThe first of these consists of scholarships de¬\nsigned to permit persons active in educational broad¬\ncasting to increase their professional knowledge either\nthrough attendance of workshops or regular academic\nsessions. Because funds are limited it seems unlikely\nthat we will be able to help all who apply. However,\nwe nevertheless urge those who are interested to\nsubmit their applications. All applicants will be\njudged collectively.\nThe second category entails workshop grants-in-\naid intended to assist institutions planning to con¬\nduct workshops. The specific purpose of these grants-\nin-aid is to help institutions to hire outstanding con¬\nsultants whom they might not be able to afford\notherwise, thus increasing the caliber of their fac¬\nulties.\nIt should be understood that these grants-in-aid\nare not intended to completely finance workshops, nor\nto help institutions which previously had no inten¬\ntion of conducting one. Thus, if failure to receive a\nare not intended to completely finance workshops, nor\napplication should be filed.\nAs in the case of the NAEB scholarships, the num¬\nber of applicants is likely to exceed the number of\ngrants we will be able to make.\nThose interested in applying should write us a\ndetailed letter including the following information:\n(1) who is sponsoring the workshop (2) when and\nwhere it will be held (3) the purpose (4) the pro¬\nposed budget (5) the staff involved (6) for whom the\nworkshop is primarily designed (7) whether or not\ncollege credit will be given (8) how participants are\nto be selected (9) the cost to the participants (10)\nNAEB Newsletter\nVol. XXII, No. I I\nNovember, 1957\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14 Gregory\nHall, Urbana, III. $5 a year, edited by Hans J. Massaquoi.\nthe amount of money requested from the NAEB and\nthe specific purpose for which the grant is intended\n(11) evidence of the school’s ability to conduct a\nworkshop regardless of whether a grant is forthcom¬\ning (12) any other pertinent information that might\naid our selection committee in making a decision (the\ncommittee may later ask for more detailed informa¬\ntion of one sort or another).\nINTERNATIONAL ETY SEMINAR\n“Community need” was cited by Hartford Gunn, gen¬\neral manager of WGBH-TV, Boston, as the major re¬\nquirement for success of ETV in individual places.\nGunn spoke at the close of the First International\nEducational Television Seminar, a two-day con¬\nference, sponsored by Boston University’s School for\nPublic Relations and Communications, Division of\nCommunications Arts.\n“If a community has this need,” Gunn added,\n“then organizing and financing an educational tele¬\nvision station becomes much easier.”\nHe pointed out that his contention, that existing\nTV stations reflect the needs of the people in the\narea, has been true in many localities in the United\nStates.\nIn commenting on the financing of ETV in this\ncountry, Gunn stated that 11 are underwritten by\npublic educational institutions, an equal number is\n1"
}