{
  "id": "d1473-1",
  "text": "financed by the communities at large, while the re¬\nmaining stations are supported by state institutions\nahd statewide networks.\nOther speakers at the meeting included Richard\nB. Hull, director of radio and television, Ohio State\nUniversity, who gave a history of educational tele¬\nvision from its start at the University of Iowa in\n1932 to the present date; Dr. Harry J. Skornia, exe¬\ncutive director of the NAEB, who outlined the history\nof the NAEB and its contributions to the field of\nETV through grants-in-aid to stations, scholarships,\nand conducting of seminars and workshops; and Dean\nMax R. Goodson of Boston University’s School of\nEducation.\nIn his remarks, Goodson termed television as a\n“promising instrumentality for increasing educational\npower in our time.”\n“But,” he warned, “there is one limitation — tele¬\nvision will never replace the principal instrument of\neducation, the personality of the teacher, and we\nshould think of TV as enhancing the power of and\nnot replacing the teacher.”\nThe late October convention rush has prevented\nPresident Burton Paulu and Executive Director\nHarry J. Skornia from writing their monthly\ncolumns. Their messages will be resumed in the\nDecember Newsletter issue.\nNETWORK NEWS\n—Bob Underwood\nSince a complete annual report of network ac¬\ntivities was just given at the Convention, there is\nlittle need for me to go into that subject any further\nexcept to say that we are “in-between seasons” here\nright now, sort of a lull before the storm of in-school\ndistribution and year-end summaries.\nAnd it is a good thing we are having a lull: we\nhave had the flu or some variation thereof. First\nUnderwood, his wife and son; then Jesse Trump and\nhis wife; George Langberg, one of our student dup¬\nlicator operators, has been out twice recently due to\nsevere colds, once in the hospital. Between illnesses\nGeorge got married so he has had a busy month!\nAs of this writing, only George, Jesse’s wife and Un¬\nderwood’s son are still under the weather. If you\nhaven’t been receiving many communications from\nus during the past few weeks, this will explain why.\nThe 1958 in-school series are about to be distri¬\nbuted, but not too many of the expected orders are\nin. Will you please forward them as soon as possible.\nRemember, if your order arrives after we begin ship¬\nment you will be charged an extra dubbing fee for\nback programs.\nWe were forced to send out another bulletin on\ntape returns recently, and we are pleased to report\na good response. Convention work and staff illness\nhave prevented our working on the tape balance\nsheets save for an hour or so. However, with the Con¬\nvention being over and our health returned we now\nhope to get the balance sheets out to you soon. In\nthe interval we expect to receive many, many returns.\nBest regards to all from the staff.\n—N A E B—\nDULLES COMMENDS ETV\nJust prior to the opening telecast of the META\nBoard of Education television series “Spotlight on\nAsia” Oct. 1 over WPIX, META received this greet¬\ning from Secretary of State John F. Dulles:\n“During the past two decades Americans have\ncome to realize that our national security and the\nsecurity of like-minded nations can be achieved only\nthrough cooperative international efforts. Our\ngovernment has played a leading part in bringing\nabout the present alignment of free nations dedicated\nto the principles of international peace and order.\nIt is not enough, however, that this task be dele¬\ngated entirely to government officials in Washington\nand our representatives abroad. To be meaningful\nand to reflect our national aspirations the fashioning\nof a better and peaceful world requires the active\nparticipation of responsible Americans of all ages. But\nbefore there can be participation, a firm basis of\nunderstanding must exist. To this end, it seems to\nme that educational television focussed' on Asia\nprovides valuable service to us all by bringing be¬\nfore us some of the fundamentals of knowledge of\nAsian history, culture, and human values with the\nvividness of sight and sound. This will lead to firmer\nmutual understanding. It will thus help the free\nworld’s collective security efforts in Asia, and increase\nthe unity and determination we all need in the great\ntask of waging peace.”\nOn the initial “Spotlight on Asia” program on\nPakistan, His Excellency Mohammed' Ali, Pakistani\nambassador to the U.S., discussed his country’s prob¬\nlems and future.\n—N A E B—\n2\nNEWSLETTER"
}