{
  "id": "d1473-3",
  "text": ")\nTV IN JAPAN\nThe following statistics indicating the rapid growth\nof TV in Japan were recived by us from Eiji Take-\nbayashi, United States representative of the Toei\nMotion Picture Co. in Tokyo:\napproximate approximate\ndate\nnumber of sets retail\nprice per set\nJuly\n1955 .\n. 200,000.\n. $350\nJuly\n1956 .\n. 400,000.\n. $200\nJuly\n1957 . ..\n. 650,000.\n. $160\nDecember\n1957 .\n. 1,000,000.\n. $150\npresent TV saturation\nTokyo area . 50.8 per cent\nOsaka area . 28.4 per cent\nNagoya area and others. 13.4 per cent\noperating networks\nNHK-TV . government sponsored\nN-TV . commercially operated\nKR-TV . commercially operated\nnetworks expected to operate by end of 1958\nNHK-TV\n1st channel . gov. sponsored\n2nd channel (educational) . gov. sponsored\nN-TV\n1st channel . gov. sponsored\n2nd channel (educational) . gov. sponsored\nKR-TV\n1st channel . gov. sponsored\n2nd channel (educational) . gov. sponsored\nFUJI-TV ... com. operated\nNIPPON-TV\n(30 percent educational programs) com. operated\nTV STUDENTS VERSUS\nCLASSROOM STUDENTS\nResearch during 1956-57 has shown that for students\nof equal college aptitude the achievement of TV en-\nrollees was equal to that of classroom students in the\nsame subject, according to Clifford G. Erickson, as¬\nsistant dean in charge of TV education at the Chicago\nCity Junior College.\nWhen taken as a group, the study revealed, TV\nstudents did better on examinations and earned\nbetter marks than the daytime classroom students.\nErickson attributes this to the fact that the former\nwere older, more mature, and as a group, of higher\ncollege aptitude. College aptitude was measured by\na test administered to TV and classroom students at\nregistration time.\nPlans are presently in progress for a second year\nof experimentation in televised higher education\nthrough the College’s station WTTW-Channel 11.\nThe 1957-58 experimental design will be refined to\ncontrol more of the factors which might affect re¬\nsearch results. The TV students will be compared\nwith evening classroom students rather than day\nstudents as in the past year. This will make for more\nequivalence of age, maturity and motivation.\nFrom the two groups pairs will be selected, match¬\ning each TV student with a classroom student. These\npairs will be equated insofar as possible on age, col¬\nlege ability, sex, previous training and employment\nload. The achievement of the pairs will be compared\nby subject based on pre-tests, mid-term quizzes and\nfinal examinations.\nNEWS OF MEMBERS\nGENERAL\nSeven new noncommercial educational stations have\njoined the National Educational Television network,\nGeorge L. Hall, director of development for the\nETRC, has announced. This will bring the number\nof stations in the steadily growing network to 30.\nThe stations are KTCA-TV, Minneapolis-St. Paul;\nWHYY-TV, Philadelphia; KOAC-TV, Corvallis,\nOre.; WMVS, Milwaukee; KUED, Salt Lake City;\nWJCT, Jacksonville, Fla.; and WETV, Atlanta, Ga.\n► Freedom of access to information, and developing\nthe radio-TV curricula are among the subjects to be\ndiscussed at a radio-TV clinic at the University of Illi¬\nnois Nov. 4, according to Frank E. Schooley, director\nof university broadcasting.\nThe clinic, which is sponsored by the Assn, for\nProfessional Broadcasting Education and by the\nDivision of Radio-Television College of Journalism\nand Communications, University of Illinois, will be\nattended' by commercial broadcasters, teachers and\nadvanced students of radio and TV from throughout\nthe Midwest.\nThe APBE is organized to promote and maintain\nhigh standards of training and guidance for those who\nplan to enter the professional radio-television field.\nPreceding the clinic, on Nov. 3, the board of directors\nof the APBE will meet at Robert Allerton Park near\n4\nNEWSLETTER"
}