{
  "id": "d1473-5",
  "text": "Harvard University, Massachusetts Institute of\nTechnology and the National University of Australia.\n^ New York University and WCBS-TV have re¬\nceived the Good Citizenship citation of the Sons of\nthe American Revolution for their 26-week series\n“Our Nation’s Roots,” an educational public affairs\npresentation on the history of immigration.\nThe series was presented in cooperation with the\nETRC, Ann Arbor, Mich. Film recordings of each\nshow are being distributed to ETV stations through¬\nout the nation.\nSHERWOOD AWARDS\nThe deadline for submission of entries in the third\nannual competition for the Robert E. Sherwood\nAwards for TV programs on freedom and justice is\nMay 31, 1958.\nThe awards, consisting of a $10,000 first prize and\nfour $1,000 prizes, were established in 1955 by the\nFund for the Republic in memory of the noted play¬\nwright.\nMrs. Eleanor Roosevelt will be among the judges.\nInquiries regarding the awards should be directed\nto the Fund for the Republic, Inc., 60 East 42nd St.,\nNew York 17, N. Y.\nUNM'S TEMPORARY SOLUTION\nTO LICENSE PROBLEM\nDespite a prolonged waiting period for FCC approval\nof a new educational TV channel, the University of\nNew Mexico is carrying out as scheduled its experi¬\nment of teaching freshman classes through TV ac¬\ncording to the University’s News Bureau.\nCourses which are presently taught are kinescoped\nand sent for showing on a 16mm projector to as¬\nsembled classes in outlying towns. This method of\nkeeping out-students abreast of campus classes will\nbe continued as long as the application is pending.\nMembers of the first international educational television seminar, sponsored by Boston University’s school of public relations\nand communications, chat before addressing the general session. Above are, from left to r.ght, John W. Taylor, J'rector at^WTTW\nin Chicago who spoke on \"Television as a Means of Instruction for Credit m Chicago; Dr Thomas C. Pollock, dean of the Washing\nton Square College of Arts and Sciences at New York University who spoke on Television as a Means of Instruction the\nCollege Classroom;\" Dr. Earl Herminghaus, research director of the St. Louis public schools who spoke on Educational Television in\nSt. Louis\" and Dr. Jerry Briscoe, assistant professor of communications at Boston University, hortjoMfc. jemmar.^ ^\n6\nNEWSLETTER"
}