{
  "id": "d1110-1",
  "text": "”(2) to assist (through matching grants) in the construction of educational tele¬\nvision facilities.\n\"AimiORIZATION OF APFROPRIATIONS\n”Sec. 391. (a) Ihere is authorized to be appropriated such sums^ not to exceed\n$520,000 in the aggregate, as may be necessary to cariy out the purposes of paragraph (l)\nof section 390•\n’*(b) There is authorized to be appropriated such sums not to exceed $52,000,000 in\nthe aggregate, as may be necessary to carry out the purposes of paragraph (2) of section\n390.\n\"GRAHTS FOR SURVEYS\n”Sec. 392. (a) To be approved, an application for funds for carrying out the pro¬\nvisions of paragraph (l) of section 390—\n\"(1) must be made by a diily constituted State Educational television agency;\n”(2) must pra\\ride for the mailing of a survey and the development of a program by\nsuch State educational television agency in accordance T-zith paragraph (l) of section\n390; and\n\"(3) must provide assurances satisfact03:y to the Secretaiy that any grant made by\nthe Federal Government under this section vd-ll be matched with an equal amount by the\nState.\n*'(b) The Secretary shall approve any application for funds which complies with\nsubsection (a).\n”(c) The total amount of the grant made to any State for the carrying out of para¬\ngraph (1) of section 390 shall not exceed $10,000.\n\"STATE PLARS FOR CORSTRUCTION OF FACILITIES\n\"Sec. 393. Grants under this part for the construction of educational television\nfacilities in a State shall be made only if the State educational television apncy has\nsubmitted to the Secretaiy a State plan embodying a program for such construction. Such\nState plan t be so submitted within three years of the date of enactment of this part.\n\"GRANTS FOR CORSTRUCTIOR\n\"Sec. 394. (a) For each proposed project for the construction of educational tele¬\nvision facilities there shall be submitted to the State educational television ^ency,\nfor transmission to the Secretaiy, an application for a grant and such application shall\ncontain such information with respect to such project as the- Secretaiy shall by regulation\nrequire, including the total cost of such project and the amount of the Federal grant re¬\nquested for such project, and providing assurance satisfactory to the Secretaiy—\n\"(1) that necessary funds to construct, operate, and maintain the educational tele¬\nvision facilities will be available."
}