{
  "id": "d1059-2",
  "text": "NAEB NEWS LETTER\nPage 3\nMay I, 1942\nWAR EFFORT AT MICHIGAN (cont8p)\nCopies of scripts of these series may be had by writing Waldo\nAbbot, University of Michigan Extension Service, Ann arbor,\nMichigan.\nF.C.C» RELAXES OPERATOR RULES\nThe Federal Communications Commission on the 21st of April ordered,\nmthat ?until further order of the Commission, notwithstanding the\nprovisions of Section 13.61 of the Commission*s Rules and Regu¬\nlations Governing Commerical Radio Operators, a broadcast station\nof any class, which by reason of actual inability to secure the\nservices of an operator or operators of a higher class could not\notherwise be operated, may be operated by holders of any class\ncommercial operator license:\n\"PROVIDED, HOWEVER, THAT ALL CLASSES OF COMMERCIAL OPERATOR LICENSES\nSHALL BE VALID FOR THE OPERATION OF BROADCAST STATIONS UPON THE\nCONDITION THAT ONE OR MORE FIRST-CLASS RADIOTELEPHONE OPERATORS\nARE EMPLOYED WHO SHALL BE RESPONSIBLE AT ALL TIMES FOR THE TECHNICAL\nOPERATION OF THE STATION AND SHALL MAKE ALL ADJUSTMENTS OF THE\nTRANSMITTER EQUIPMENT OTHER THAN MINOR ADJUSTMENTS WHICH NORMALLY\nARE NEEDED IN THE DAILY OPERATION OF A STATION?\n\"PROVIDED, FURTHER, THAT A BROADCAST STATION MAY BE OPERATED BY\nA HOLDER OF A RESTR ICTED Tf'AO IQTELEPHONE OPERATOR PERMIT ONLY I N-\nTHE EVENT SUCH PERMIT HAS BEEN ENDORSED BY THE COMMISSION TO SHOW\nTHE OPERATOR8S EFFICIENCY IN RADIOTELEPHONE THEORY AS ASCERTAINED\nTHROUGH EXAMINATION.\"\nCLASSROOM USE OF RADIO AWARDS\nEntry blanks for a Competition for Awards and Citat on in the\nClassroom use of Radio are available now at the Radio Co“ncil m\noffices. This utilization competition is to be held in connection\nwith the 6th Annual Meeting of the School Broadcast Conference\nWHICH WILL MEET NOVEMBER II > 12 AND 13 AT THE MORRISON HOTEL.\nNAEB PACKET\nENCLOSURES; (l) Script (WHA) - \"Wake Up, America—It s Late. ;\n(2) WO I printed schedule; (3) \"Radio in the Classroom announce¬\nment; (4) University of Kentucky radio programs, May 4-17.\nHarold mcCarty sent along the script because he thought you\nMEMBERS MIGHT WANT A COPY. SAYS HAROLDJ\n\"It WAS A BROADCAST BASED UPON EDWARD T. LEECH’S EDITORIAL"
}