{
  "id": "d1127-0",
  "text": "N-A-E-Q NEVVS-\nER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nRadio Hall, Madison, l/visconsin\nFebruary 1, 1947\nm IS GROOVING\nOn January 1, 1947, grants to FM applicants numbered 633. On January 1, 1936,\nthere were 632 licensed broadcasting stations in the United States.\nOf the 633 applications, 427 had outright CPs and 206 had conditionals. Some\n280 odd other applications were still pending.\nTYLER TO GERI/IANY\nPr• Keith Tyler, Ohio radio education head, is leaving as a member of a\n1/Var Department education mission to help with the instructional materials program\nfor* schools in Germany. He is expected to return in April.\nHarrison B. Summers, OSU speech professor and former ABC public service\ndirector, will be acting director of the 1947 Institute for Education by Radio\nat Columbus. (May 2-5).\nJIM EBEL REPORTS\nOur EX-EX-SECY, now Director of Engineering for the Peoria Broadcasting Company\nafter years at VvILL', reports on his activities at V<MBD. In what is fast becoming\none of the most competitive radio cities in the country, he points to great strides\nin local public service programming. Included in his listing are religious features,\nschools’ programs, farm journal, vets' news, discussions on^civic issues,^notable\nguests and special events broadcasts. Ambitious taskJ Rad.io L'DZ, an affiliate in\nTuscola, is developing a similar schedule.\nJiPi has been getting around the country considerably, and has the answers to\nmany facilities questions. He is working on an FM set-up at the present time, and\nhas designed a portable FM-AF demonstration unit to help sell the public on the\nnew system.\nEVENING OPPORTUNITIES\nThe lengthening days being with them, a chance for the \"daytime” educational\nbroadcasters to use a few of the highly desirable evening hours. This is a chance\nto demonstrate the kind of service which wide-awake non-commercials can give. ^\nYOSU’s January program bulletin indicates that it must leave the air at 6:45.\nIt provides a half-hour dinner concert with 6:30 features carrying these titles:\nMusic Forecast, Keep Your Health in 1947, Down to Earth, Panel on Democracy, Family\nLife Today (Ohio PTA) and Ohio Education Looks Ahead. Tbesio are not high-pressure\nprograms piped in from afar-but rather, features of local origin and interest.\nThere is ample evidence that listeners are interested in v>/ell-produced local\nprograms. In this field educational stations can compete on more than even terms.\nThey have the facilities and the potential talent with which to make names for them¬\nselves. How will the opportunity be used'J\n~ « 15EMEERS?\nEvery institution engaged in educational broadcasting needs\nNAEP and is needed by NAEB. Many need only an invitation to join.\nInstitutions licensed to operate their own AM or FM facilities are\neligible for active membership. Institutions using facilities other\nt harg their own may become associate members.____"
}