{
  "id": "d1127-1",
  "text": "G U E s T 11 O I A L\nQUO VADIS?\nThe next several years will be critical ones for educational radio.\nTwo things are essential if educational radio is to continue and be a\ndominant force in the American scene;\n1., Educational radio must realize it has a big job to do in\nVITALIZING itself.\n2. Educational radio through its best agency—the National\nAssociation of Educational Eroadcasters-”“must expand. Its in¬\nfluence must be felt in EVERY section of the country.\nIf educational radio fails in these important objectives, it cannot\ncommand the respect of either the broadcasting profession or of education.\nEducational radio leads a peculiar, one might say hard, life. The\noverall field of radio is one of the fastest growing, most progressive\nof America's big institutions. It is quick to cast off the old, eager to\nexperiment, always ready to take unto itself the new. Honey is no object,\nif goals are to be achieved * On the other hand, education is conservative,\nslow to accept the new and certainly counts the pennies when changes are\nto be made. Educational radio, with its roots deep in each of these fields,\nexperiences considerable difficulty in reconciling these extreme phil¬\nosophies .\nIn many respects, educational radio is still in the ’’horse and buggy”\nstage. Too many educational stations are forced to vjork with antiquated\ntechnical equipment, with too few and poorly designed studios, with\ninadequate work spaces, and with small underpaid staffs. Too often,\neducational radio is the step-child of the sponsoring institution--rel-\n'.egated to an obscure corner of the academic administrators' planning and\nthinking.\nEducational radio's programming must be made appealing to the masses\nwho desperately need its leavening influence. This is important in light\nof the fact that to the general public radio is still essentially a medium\nof entertainment. Educational programs must be ’’dressed up”. Ye are\nstruggling to make ourselves heard, yet we count our audiences in the\nhundreds of thousands...not in millions.\nPerhaps this indifference of the masses stems from, the fact we do\nnot always inform them of what is available, public relations, adver¬\ntising for educational radio stations, is sadly lacking in general. The\npeople'don't know there's a radio diet available wUiich makes for a\nbalanced healthy, vigorous listening. Educational radio has not been\nvocal enough.\nOur NAEB must grow and expand, bearing in mind certain standards\nwhich must bo maintained in this growth. There are hundreds of colleges\nand universities which broadcast over stations not their own. There are\ndozens of nev/ FF stations in education coming into existence. All those\nmeeting our qualifications should be a part of NAEF. But as it stands\nnow, we need m.ore to offer them.\nI have recently proposed to the President and Exeicutive. Committee\nof NAEB a plan for reorganization. It isn't original; neither is it\nthe only plan T^iich might work. But I beliei;e that by dividing the\ncountry into 6 regions and emphasizing strong regional organizations, we\nwould be able to accomplish in twfo years what we have not been able to\ndo in many, many years-—a strong, active national set-up for the\nNational Association of Educational Broadcasters.\nJohn . Dunn\nRadio l/iUIAD\nUniversity of Oklahoma\nNext month's guestitorialist; Richard E. Hull"
}