{
  "id": "d1127-3",
  "text": "- 4 -\nWBEZ-Chicago Public Schools, Chicago.\nThis pioneer educational FM station changes its frequency on February 1, 1947\nfrom 42.5 Me. to 44.5 Me. Its ultimate place in the new band will be 91.7 life. _\naccording to FCC reports.\nGeorge Jennings reports the availability of two sets of phonograph records\n(78 rpm) \"The Atomic Bomb\" and \"Peace Time Uses of Atomic Energy\", together with\nteachers’ manual, students' handbooks and publicity material. ($12.50 set).\n228 N. LaSalle St., Chicago, Illinois.\nKV^SC-Y/ashington State College, Pullman.\nLois RoaGir (who possesses the first MA in Radio issued by Northwestern Univ¬\nersity) has assumed her duties as producer-director.\nEighteen athletic contests’are scheduled for the Jan.-Feb.-Mar. period over\nMSC. They range from high school basketball and boxing through college clashes\nin the same sport's.\nCollege comedy and musical talent are combined in a weekly \"Campus Showcase\"\nbroadcast. Featured is a 14-pieGe student orchestra. LeRoy Hale is the riter and\nJohn Blake the producer.\nNew talent for broadcasting is being developed at KY'i'SC to take places in\ncommercial stations in the region. Individual performers and talent groups are\nmade available. The first group, with \"The Lamplighters\" program, is now ready.\nKYjSC has prepared a contractual form for political broadcasts which emphasizes\npertinent FCC rules and requires a candidate's agreement before appearing on the\nair. Educational stations, if interested, may receive a copy upon request.\nWEA-University of ’’Ai scons in, Madison.\n\"The Wisconsin Legis 1ative forum\", featuring talks by law-makers directly from\nthe capitol daily while the Legislature is in session, is again on the air with\nHarold Engel handling the broadcasts. Since 1933, this has been a regular feature,\nand law-makers have come to expect this service from their state-stations. ALBL,\nthe Department of Agriculture station at Stevens Point, carries the programs\ns imu It ane ou s ly.\nIVBKY-University of Kentucky, Lexington.\nElmer Sulzer reports that on January 20th, V/BKY, the University’s mountain FM\nstation at Beattyville, changed its frequency to 44.5 Me. The new 1 Kw, transmitter,\nwhich is expected to be on the air within the next sixty days, will operate on\n91.3 Mo.\nKUSD-University of South Dakota, Vermillion.\nIn bringing KUSD back into the NAEB fold™after a lapse following the death of\nthe former Director of,the station, B.B. Bracketts, long NAEB treasurer, the new\ndirector, Irving Merrill, reports on the station as it enters its second quarter\ncentury of broadcasting.\nSays Merrill, \"KUSD is an uneasy center of attention today. Powerful commercial\nradio interests in Iowa, Nebraska and elsexvhere would like to grab without payment\none of the important assets of South Dakota. That asset is the broadcast frequency\nof KUSD, 920 kilocycles.\"\n\"Nine hundred twenty kilocycles remains the property of South Dakota only so\nlong as it serves the public interest, convenience, and necessity. As custodian\nof this \"natural resource,\" President I. D. Y«eeks is determined South Dakota retain\nr' title to this property, KUSD begins its second quarter-century, therefore, by\nexpanding its service to South Dakota,\"\nThe degree of bachelor of arts for major students in radio-speech is now\noffered by the Department of Speech, Radio, and Dramatic Art in cooperation with\nthe staff of KUSD."
}