{
  "id": "d1127-4",
  "text": "IT’S ALL IN THE LAY YOU LOOK AT IT i\n5 -\nThis is the time of year when many non-profit stations are v;orrying about\nbudgets. Running a broadcasting station costs money-and it’s vArth many times\nwhat is spent on it.\nBut, legislatures and boards of regents need to be shown. Hero’s an angle\nwhich helps to show up station operation for the bargain it really is.\nEvery owner of a receiver has a considerable investment in his equipment. He\nspent that money to be able to tune in programs* * Even?- month he pays for elo'ctricity\nto keep that set running-to say nothing of the cost of tubes and repairs now\nand then. He spends that money because he wants to hear programs.\nNow, if he wants the programs that much, it is logical that he wouldn't object\nto spending somethin^, for programs of a type which is different from what other\nstations offer-such as those w'hich come from the non-commeroia 1 stations. But--\nhow much each year should he be willing to spend-as much as he spends for\nelectricity-not in a year-but in just one month? That doesn’t sound\nextravagant does it?\nO.K. It is estimated that a receiver-table set to be conservative-con¬\nsumes about thirty cents worth of electricity in an average month’s use. That is\nabout one cent per day, or $3.65 per year.\nPut you’re not asking for that much. Lhat you’re asking for is shockingly\nlittle-say, ten cents or twenty cents per year. That’s not per person-but\nper radio home-whether the family has one receiver or sixJ Lork it out on the\nbasis of actual figures for your own station. Transpose the cost into comparisons\nwith other expenditures-as the tax on two gallons of gasoline, the price of a\ncigar, three postage stamps, one beer, a pair of shoe laces-or something else.\nThen point out the yearly number of hours of blurb-free radio service that the same\nexpenditure will give.\nAfter all-it is a bargain. You tell about itJ\nSULZER vs. ABBOT GUESTITORIAL\nElmer Sulzer, of the University of Kentucky, has a bone to pick. He says,■\n*Waldo Abbot’s Guestitorial (January Newsletter) interested me in a unique sort of\nway since I was secretary of the convention he attended in Lexington. While there\ncan be no argument between Waldo and me as to the worth of radio in Public Relations,\nI have a feeling that he minimized to too great an extent the interest in radio by\nthe American College Public Relations Association.\n\"First, the ACPRA has had a Vice-President in charge of radio for something like\nten years, and most of the time this office has been exceedingly active in promoting\nthe use of this media for Public Relations.\n\" Second, the magazine published by the ACPPA has contained many articles on\nradio,and the forthcoming issue is no exception.\n\"Third, at the convention in question, one entire session was devoted to radio,\nwhich was as much time as was devoted to any other single Public Relation medium,\nand in addition, one of the two post-convent ion trips v/as of radio nature.”"
}