{
  "id": "d1127-5",
  "text": "COURT ”li'^'HODUNIT’\nUnder a Washington, January 14 dateline, the January 15 issue of Variety re¬\nports the following! \"The U.S.' Circuit court of appeals for the 10th Circuit ruled\nin Denver last Saturday (11) that a ’radio station may not hy private contract\nlimit its right or duty to select programs that are in the interest of the listening\npublic.' The decision spared KOB, Albuquerque, from upsetting choice UBC talent\nshows to clear tiie for the University of Now Mexico, which under a 1935 contract\nhas an option for an hour a day on the station.\"\nThis is another chapter in the sad KOB story. Once the property of State\nCollege at Las Cruces, New Ifexico, the station has a history which exemplifies\neducational apathy, dubious contracts, political maneuvering and commercial\nexploitation.- It is an object lesson which educational station operators should\nremember well, lest they too come out vrith a proverbial mess of pottage.\nFACILITIES AND FCC\nWHCU-(Cornell University) denied application to broadcast from 6;00 AM to.\nsunrise during January and February., (January 3)\n.WNYC_(New York City) granted CP to install auxiliary transmitter with\n1 Kw. power. (December 31, 1946)\nWHA-FM-(Madison) assigned the call letters to the FM station, 3 Kw power,\n91..5 Me*. (January 21)\nHITS AND MISSES\nIt is reported that broadcasters meeting in San Francisco early in January laid\nplans for '*a public relations program to dam the mounting criticism of radio .\nWonder if they didn't mis-spell that word?\nThe FCC has 22 ’round-the-clock monitoring stations searching for \"proof¬\npositive\" against illicit broadcasters. Think of a job in which you couldn’t turn\noff the radio to soothe your nerves.\n\"In long-range planning, FM radio stations must take facsimile into consid¬\neration.\" (Herbert L. Pettey, WHN-YJMGM. )\nLyman Bryson of CBS says that the commercial value of the time given to its\nSchool of the Air series is''4l,438,091. We wonder Isrhat it would be worth to have it\nbroadcast at an hour vhen schools could listen.\nNorman Corwin says that since the Japs lost the war, they've been introduced\nto the radio \"soap-opera\". Y/hat price defeat]\n\"in an effort to put some practical information into a college radio course,\nThe Chicago Radio Management Club is going to work with Chi’s Roosevelt College,\nand members of the club are going to deliver lectures.\" (BILLBOARD, Jan.18,’47)\n\"Radio is moving in the direction of low-cost shows\", says the lead in ^\nVariety’s (Jan.22) headline story. Can it be that they're going to do \"educational\"\nfeatu res ?"
}