{
  "id": "d1852-0",
  "text": "THE PRESlDENT*S PAGE\nOctober, 1955\nDear NAEBers: * ' . •. >. .\nThis is convention month, and 1 hope to see all, of you at the Del Prado\nin Chicago, October 26-29-\nThere * s a story in this issue of the Newsletter.that gives you more\nDETAILS, ThERE*LL BE A MAILING THE FIRST OF NEXT WEEK, WHICH WILL\nGIVE YOU A CHANCE FOR ADVANCE REGISTRATION, ANO A COPY OF THE PRELIM¬\nINARY PROGRAM .\nAll looks good at the moment, but I assure you that Al Partridge and\nHIS COMMITTEE HAVE HAD A TREMENDOUS JOB IN GETTING THINGS ALL SET,\nI HONESTLY BELIEVE Y 0 U * L L PROFIT FROM ATTENDING THE CONVENTION,\nA FEW DAYS AGO I SENT ALL OF YOU A MEMO ON HOW YOU CAN HELP WITH THE\nCONVENTION PRO GR AA/i, AND ALSO SOME PROPOSED CHANGES FOR THE BY-LAWS.\nWE, PROBABLY WON * T SOLVE:” ALL OF OUR PROBLEMS, WE PROBABLY NEVER WILL,\nBUT WE CAn’mAKE STEPS TOWARD BETTER ORGANIZATION AND TOWARD BETTER\nOPERAT IONS.\nOne OF THE GRATIFYING THINGS THAT COMES WITH BEING PRESIDENT IS THE\nCOOPERATION THAT COMES FROM NAEB MEMBERS, THERE?S BEEN LOTS THIS YEAR,\nAND I DO APPRECIATE IT,\nFor example, two committee chairmen. Si Siegel and Carl Menzer, already\nHAVE THEIR COMM4TTEE REPORTS IN AS WE GO TO PRESS WITH THE NEWSLETTER\nin late September, Fine work, men I\nAnd others have responded in like manner. Bill Harley and Ken Wright\nhave willingly picked up the work on the Radio and TV Program Festi¬\nvals THAT ARE PLANNED FOR THE THREE NIGHTS OF THE CONVENTION.\nAnd Garnet Garrison, Gale Adkins, Ola Hiller, .Mac McCarty, John\nSchwarzwalder, and John Taylor have aided nobly in getting their parts\nOF THE PROGRAM IN SHAPE FOR YOUR CONVENTION.\nlTfS BEEN THAT WAY ALL YEAR LONG, AND THAT * S WHAT MAKES IT PLEASANT\nWORKING FOR YOU,\nThere are times when ye ol! prexy finds himself really busy, and some¬\nwhat T1REO, BUT HE THINKS HE CAN NOW LAST THE YEAR. HE^ BEEN TO A\nJCET MEETING WITHIN THE LAST 30 DAYS, AND HAS ANOTHER SCHEDULED WITH¬\nIN THE NEXT 10 DAYS.\nHEtS BEEN ON THE WEST COAST, TOO (INCIDENTALLY, ILLINOIS PLAYED Cal),\nAND WHILE THERE VISITED THE KPFA SETUP IN BERKELEY. TiME DID N * T\nPERMIT HIS VISIT OF KQED IN SAN FRANCISCO, BUT HIS INTENTIONS WERE\ngood. Maybe I'll make more calls another time.\nThere has been a convention committee meeting in Chicago to attend,\nand LOTS OF DETAILS IN GETTING ORGANIZATION SET TO WHIRL AT THE\nCONVENTION."
}