{
  "id": "d1877-5",
  "text": "^ An excellent article in the December 2nd St.\nLouis Post-Dispatch praised KSLH, the St. Louis\nPublic School radio station. Pictures of personnel and\nchildren listening to the programs illustrated the\narticle. Many of KSLH’s programs were singled out\nfor praise. Particularly interesting was the emphasis\non world-wide audience, as tapes of different programs\nare sent to many lands for re-broadcast. Marguerite\nFleming, KSLH manager, should be justly proud of\nher station.\n^ Professor Waldo Abbot’s “Handbook of Broad¬\ncasting,” one of the pioneering and best-known texts\nin the field of radio-TV, is being published by Mc¬\nGraw-Hill in a new edition to be released in January.\nPERSONNEL\n^ Nobel laureate Dr. Glenn T. Seaborg was ap¬\npointed senior advisor in the sciences for the ETRC.\nDr. Seaborg is the “star” of the NET series, “T h e\nElements,” and professor of chemistry and chemical\nengineering at the University of California in Berkeley.\n^ Chapin Ross is the new Assistant Director of\nRadio at Abilene Christian College in Texas. He is\nin charge of their AM wired-wireless station that\nwill go on the air the first of the year.\nPROGRAMS\n► Beginning December 5th, the Mohawk-Hudson\nCouncil on ETV in New York is offering a unique\nTV program called “French Club” on WTRI. These\nweekly programs are geared' to high school students\nand adults, and present a variety of things - mostly in\nFrench - for the viewer who has studied some French.\ny Songs for Christmas from major countries\nthroughout the world were presented by James\nSchwabacher December 14 on KQED, San Francisco.\nThis music festival signified the last live performance\nbefore Channel 9 went off the air for 3 weeks to move\nits transmitter from atop the Hotel Mark Hopkins to\nSan Bruno Mountain in San Mateo County.\nSchwabacher sang one original selection especially\nwritten for the performance. In addition, the song\nfestival included French Noels of the 15th century and\nGerman, Austrian, Italian and American Christmas\nfolk-lore.\ny KQED also is presenting a new TV series “Aero¬\nnautics America.” The first program was shown No¬\nvember 30th and dealt with overall aviation from the\nWright Brothers to supersonic jets. The 13-week series\nprogresses through tests and technical advancements\nand is designed to interest high school students and\nadults.\n^ WKNO-TV, Memphis, says national magazines\nLife, Look and TV-Guide are on-the-spot reporting\ntheir “Streamlined Reading” telecourse that teaches\nadult illiterates to read and write. The current enroll¬\nment figure is 751, and many more are following the\nlessons without texts. The. project was nominated for\nthe Sylvania TV Award. Many congratulations to\nMemphis!\n► “The Shoemaker’s House,” a contemporary hour-\nlong drama, was presented' over WHA-TV, University\nof Wisconsin, on December 16. Timely in the light of\nrecent European events, the play dealt with 3 days in\nthe life of a Czechoslovakian family under Nazi oc¬\ncupation during World War II. The script has won\nseveral playwriting awards and has had numerous pro¬\nductions throughout the country.\n► Indiana University and WTTV, were given a\nnice tribute in the December 15-21 TV Guide. The\ntwo-page article praised the programs Indiana Uni¬\nversity produces over WTTV, saying their Saturday\nnight basketball telecasts top all other TV enter¬\ntainment in their vicinity.\ny The Rev. Harold Rigney, recently repatriated\nCatholic priest, was interviewed on “Campus Tour”\nDecember 9, over WILL, the University of Illinois\nradio station. Father Rigney answered questions con¬\ncerning his experience prior to going to China where\nhe was imprisoned by the Chinese Reds, what he did\nin the West African Gold Coast region, his work as a\nDivine Work Missionary, his plans for the future, and\nh i s work in geology - the field in which he holds a\ndoctorate.\n—'N A E B—\nRADIO GRANTS ANNOUNCED\nThe 1956-57 Radio Grants-in-Aid were made re¬\ncently by the ETRC upon recommendation of the\nNAEB Grant-in-Aid Committee. Seven different\ninstitutions were granted $44,920 to aid in radio pro¬\nduction.\nThe NAEB Committee that made recommenda¬\ntions consisted of Edward J. Rosenheim, Jr., Uni¬\nversity of Chicago, Chairman; James Miles, Purdue\nUniversity; R. Edwin Browne, University of Kansas;\nand Larry Frymire, Michigan State University.\n—N A E B—\nThe Canadian Broadcasting Company has an¬\nnounced the establishment of 5 new TV stations in\nCanada, to be located at Medicine Hat, Alberta;\nKamloops, British Columbia; Argentia, Newfound¬\nland; Quebec and Rouyn, Quebec.\nPage 6\nNEWSLETTER"
}