{
  "id": "d1534-2",
  "text": "programming for the NAEB Radio Network for the\nnext three years.\nThe Headquarters staff is working at least to\ncapacity. As many as can be spared will be at the\nIERT, where we’ll hope to see you. We’d like to\nurge all of you who are Chairmen of NAEB com¬\nmittees, to meet with as many members of your\ncommittees as possible while in Columbus.\nArrangements have also been made for a Region\nII meeting at the IERT (Parlor 11, May 7, from\n9 on, at the Deshler Hilton), in view of the inability\nto find a satisfactory solution to a local meeting.\nMay 17-19, Region I of the NAEB is holding its\nconference at Pittsburgh. A fine program is promised\nby Regional Director Art Weld and Arrangements\nChairman Bill Tacey, Kendall Crane and Tom Cole¬\nman. We hope as many NAEB members as possible\nwill try to attend their Regional Meetings, for this\ntype of meeting is one of the best opportunities\navailable for informal brainstorming, idea exchanges\nand professional good fellowship.\nUntil we see you at one of the numerous upcoming\nmeetings, then, best wishes as we head into what for\nmany of you is the home stretch, leading to a wel¬\ncome and well-deserved vacation.\nATTENTION RADIO MEN\nIll the last few years the number of “success stories”\nfor ETV are multiplying, and are appreciated. But\nin this flurry, solid accomplishments of educational\nradio stations are almost never heard. With a new\ninterest in FM, with radio frequently the first step\nan institution could take, and with many nations\nthat cannot afford TV begging us for “illustrations”\nof what radio can do, we need the help of our now\nall-too-silent and modest radio station operators.\nWhat successes have you had in teaching (credit\ncourses, enrichment, in and out of school), children’s\nprograms, factual or emergency service, programs for\nshut-ins, the institutionalized, or others? We feel\nthe older medium of radio is not dead, and that it’s\ndoing a solid job in many areas.\nWe need to know of such successes, or evidences\nof acceptability of or enthusiasm for outstanding\nprograms, whether from the NAEB Network or your\nown. Please let us hear from you on this!\nCALLING ALL MEMBERS\nDuring the week of April 23, all active and asso¬\nciate member representatives received from the\nNAEB Membership Committee (Frank Schooley,\nChairman) membership or promotion flyers to pro¬\nmote increased individual membership.\nIf each individual who has had an NAEB scholar¬\nship, or attended an NAEB-operated Workshop or\nBOX SCORE\nTotal\nAM\nstations\n— 3016 (includes\n36\nnon-commercial)\nTotal\nTV\nstations\n— 538 (includes\n23\nnon-commercial)\nTotal\nFM\nstations\n— 653 (includes\n127\nnon-commercial)\nSeminar joined the Association, we’d have over 500\nnew individual members.\nIf each staff member of each member institution\nwere to respond, we’d have several thousand more\n(we have a mailing list of over 400 NAEB engineers\nalone, for example).\nAll these individuals should already qualify as\neducational broadcasting “professionals” who should\nbe members of their professional association. We\nhope each of you will do your best to get these\nindividuals into the fold.\nWith greater numbers and resources, we can begin\nto do incomparably more for both individuals and\nthe entire movement. The $5 annual dues, it should\nbe pointed out, bring individual members both the\nNewsletter and the (formerly AERT) Journal, which\npreviously cost $9 a year for both.\nIf adequate membership can be built up, we hope\nto distribute our Fact Sheets and other items to all\nmembers for only the cost of annual dues, which, in\n1958, go to $7.50 to cover the increased services we’ll\nbe providing by then. Now is definitely the time to\njoin.\nIncidentally, with the volume of mail growing\nevery day, we are more and more having to decline\nto promise to send people individual word regarding\nscholarships, workshops, seminars, grants and publi¬\ncations available. Our answer from now on must\nincreasingly be: “See the Newsletter and the\nJournal.”\nFinally, more and more recognition is coming to\nthe NAEB and its members and workers. We believe\nit’s a fine organization. If you agree, how about\nsupporting the membership drive? And if you’re a\nnewcomer to the movement and wish application\nblanks or more information, drop us a line. We’ll\nbe glad to help.\n—NAEB—\nBurton Paulu, NAEB president, is the new NAEB\nrepresentative to JCET, replacing Frank Schooley,\npast-president of NAEB. Richard Hull, NAEB\nvice-president, is the alternate.\n—N A E B—\nThe Mohawk-Hud'son Council on ETV held its\nannual meeting Thursday, April 25. Six trustees\nwere elected for 3-year terms and one trustee elected\nto fill an unexpired term.\nMAY, 1957\n3"
}