{
  "id": "d1534-4",
  "text": "the network’s relationship to them on your home\ngrounds. This is not possible; but at gatherings such\nas IERT and the NAEB Convention we can get to¬\ngether and go over our mutual problems. Therefore,\nwhy don’t you plan to visit the Hill-Bidlack-Under-\nwood suite at the Dcshler-Hilton? We’ll be glad to\nsee you.\nBefore the end of April the offering for the 3rd\nquarter should be off the presses and on its way to\nyou. Although we lose about one-fourth of our\nstations during the summer, we have tried to main¬\ntain a steady hourly output per week with no de¬\ncrease in either quantity or quality. The order dead¬\nline for this offering will be June 10, so please have\nyour orders in before that date. Late orders compli¬\ncate both our books and production schedule, and\ndelay delivery of programs to you.\nSince the amount of storage space required by\nboth network and headquarters files has risen like\nthe cost of living and the amount of available space\nis dropping like the value of the dollar, we decided\nsomething has to be done about the network files.\nOur purpose is to condense the network records\n(from the beginning to the present time) into a group\nof three ringbinders for quick reference and con¬\nvenient storage. Peggy Enderby, our Traffic\nManager, and I have started work on this project,\nand as wc progress we find ourselves being buried\nby a mass of papers. If you don’t hear from us for\na while, you’ll know where we are.\nBest regards to all from the network staff. See\nyou in Columbus!\nFCC ACTIONS\n► C. L. Trigg, majority owner of stations KOSA-\nAM-TV at Odessa, Texas, has withdrawn his applica¬\ntion for TV Channel 5 at Lubbock, Texas, leaving\nTexas Technological College unopposed for the\nfacility.\n► The FCC granted Rensselaer Polytechnic Insti¬\ntute, Troy, N. Y., application for a new educational\nFM station on Channel 218.\n—N A E B—\nNAEB member stations receiving the 1956 National\nSafety Council Awards are: KDPS—Des Moines;\nKSDP—San Diego; KSLH—St. Louis; WBOE—\nCleveland; WFBE—Flint; WEAR—East Lansing;\nWNYC—New York City. Congratulations to you\nall!\nANY PROBLEMS—QUESTIONS?\nA member of the NAEB Staff will be available at the NAEB\nexhibit at IERT from 9:30 to 11:30 and 1:30 to 3:00, Wednes¬\nday through Friday. Anyone with problems, questions, or just\nwanting to visit, is invited to look him up.\nNEWS OF MEMBERS\nGENERAL\n► ETV station WYES in New Orleans went on the\nair the first of April, becoming the 23rd affiliate of\nthe ETRC to begin broadcast activities. Operating\non VHF Channel 8, WYES went on the air ahead\nof schedule in order to broadcast the national live\nprograms being presented by NBC and the ETRC.\nDuff Browne, manager of the station, said they\nwill operate on a yearly budget of $165,000. New\nOrleans area public schools will contribute 50 cents\nfor each school child annually, and parochial, private\nschools, universities, and colleges will make regular\ncontributions.\n^ WTTW, Chicago’s ETV station, recently received\na citation for significant contributions to citizen\neducation. The award was made by the Chicago\nForeign Policy Association for their program, “World\nSpotlight.”\n^ On April 4th, WBAA, Purdue, celebrated its 35th\nanniversary. On April 4, 1922, the radio station was\ngranted its original license to operate on 360 meters\nwith a power of 200 watts. Now WBAA operates\non 920 kc on unlimited time with a power of 5000\nwatts in the daytime and 1000 watts at night. An\nincrease in facilities and service of which they can\nbe justly proud.\n► WNYC, New York’s municipal station, walked\naway with two 1956 Peabody Awards for distinguish¬\ned achievement in radio. One award was given for\ntheir program. “Books in Profile,” the other for “Little\nOrchestra Society Children’s Concerts.”\ny The Wisconsin State Radio Council decided that\nofficials of ETV station WHA-TV, Madison, acted\ncorrectly in permitting Governor Thomson to use\nthe station’s facilities for a film which since has\nstirred up demands for equal time.\nThe Council said use of the film on the state\nstation was in the public interest as a report by the\nstate’s chief executive—as opposed to a speech by a\ncompeting candidate for public office.\nWisconsin Democrats and the Wisconsin Public\nExpenditure Survey, a taxpayer’s organization, both\ndemanded equal time, but the Radio Council decision\nruled out any possibility of that.\n^ A new source of TV programs is anticipated with\nthe announcement that Alabama College, Monteval-\nlo. has been officially designated as the 4th program¬\nming agency for the Alabama ETV Network.\nMAY, 1957\n5"
}