{
  "id": "d1534-5",
  "text": "This means Alabama College will be offered a\nprogram contract to create and produce programs\nwhich will be beamed to transmitters, which in turn\ntelecast educational instruction to 85% of the state.\nPERSONNEL\n^ Kenneth Harwood, chairman of Southern Cali¬\nfornia’s Department of Telecommunications, was\nelected president of the Association for Professional\nBroadcasting Education during the group’s annual\nmeeting in Chicago last month. He replaces Sydney\nHead, head of the University of Miami’s Department\nof Radio-TV.\nt Edward Stasheff, associate professor of speech\nat the University of Michigan, has received a one-\nyear appointment to the program staff of the ETRC\neffective in September.\nk Miss Mitzi Kornetz, broadcasting consultant, has\nbeen appointed Radio-TV Editor of Boston Univer¬\nsity’s News Bureau.\nPROGRAMS\n^ WILL-TV, University of Illinois, recently com¬\npleted an unusual experiment in programming. A\nseries of 6 programs called, “Painting with Bradshaw”\ntried to help televiewers understand what goes on in\nan artist’s mind when he creates.\nIn no sense a “do-it-yourself” show, the series\nshowed Glenn Bradshaw, professor of art at the\nUniversity of Illinois, as he started a painting and\nworked it to completion before the TV camera.\nProf. Bradshaw is an artist of exceptional merit\nand recently won two national prizes for his work.\nOne ($750) was the 2nd Altman Landscape Prize\nat the Annual Exhibition of the National Academy\nof Design in New York. The other was 1st prize\n($550) for painting in any medium at the Isaac\nDelgado Museum in New Orleans.\n^ WCET, Cincinnati, is showing a series of 4 pro¬\ngrams on Military Reserve to help students better\nunderstand their obligations to National Defense.\nHigh-ranking officers of the Army, Navy, Marine\nand Women’s Army Corps will outline the Reserve\nprograms.\nJunior and senior high schools in the area are\nasked to encourage boys 16-18 to watch the series.\nApril Uth the Cincinnati Times-Star carried a full\npage spread on the series.\n^ Half-hour films of President Eisenhower’s news\nconferences now are being telecast in their entirety\nover WTTW, Chicago. The films are flown to\nWTTW for use the day after the news conference.\nExcerpts are used on news shows over other stations,\nbut WTTW is the only outlet offering the complete\nfilm.\n^ The immigrant receiving station Castle Garden\nwas the subject of the first program on “Our Nation’s\nRoots,” 26-week TV series that premiered April 13.\nProduced by New York University in cooperation\nwith station WCBS-TV, and partially financed by\nthe ETRC, the series will be seen from 2-2:30 p.m.\non Saturdays.\ny Governor Stephen McNichols, of Colorado, and\nGovernor Robert Smylie, of Idaho, joined top-ranking\neducators April 9 in a special telecast on the issues\nnow confronting colleges and universities on KQED,\nSan Francisco.\nThe half-hour panel discussion, “Facing the Criti¬\ncal Decade,” also features Raymond Allen, chancel¬\nlor of UCLA, and George Benson, president of Clare¬\nmont Men’s College and provost of the Claremont\nGraduate School.\nTV TECHNICAL TIPS NO. 32\n—Cecil S. Bidlack\nNAEB TV Engineer\nI finally made it—to Minneapolis, that is—and the\nhome of KUOM, NAEB President Burton Paulu,\nand KTCA. In addition to participating on a panel\non the “Use of Closed Circuit TV by Schools” at\nthe Central State Speech Association Conference\nApril 5, I was able to take a look at the facilities of\nKUOM and KTCA.\nKUOM occupies the 1st floor of Eddy Hall on\nthe main campus of the University of Minnesota.\nEvery square foot of this space is being utilized to\nprovide offices, three studios (one of which also\nserves as a TV studio), a combination video control\nand recording room, and a master radio control\nroom. They are presently converting their trans¬\nmitter to remote control operation.\nWe believe many ETV stations could benefit by\nthe procedures used by KUOM for checking and\naging miniature tubes used in TV equipment.\nUpon receipt, KUOM checks each new receiving\ntube on a mutual conductance type checker. Those\nwhich give a sub-normal mutual conductance reading\nor show other defects are immediately returned to\nthe jobber for replacement. In some instances as\nhigh as 20 per cent of the tubes received have been\nreturned.\nThe tubes which pass this first test are then\naged with rated voltages applied for 24 hours. A\nspecial aging device has been constructed which will\nage 24 tubes at a time. A plug and jack arrange¬\nment permits the application of appropriate voltages\nNEWSLETTER"
}