{
  "id": "d1135-3",
  "text": "\"MOTHER GOOF'S RHYMES\nFOR TV TIMES\"\n(Ed. Note: After the recent success of NAEB’s\nconference on Instructional Uses of TV and Radio,\nMrs. Marye D. Benjamin, script editor for the\nUniversity of Texas’ radio-television department, was\nstimulated to write “Mother Goofs Rhymes for TV\nTimes.” The following is one of her verses.\nPussy Cat, Pussy Cat, where have you been?\nI’ve been to Purdue to look at a screen.\nPussy Cat, Pussy Cat, what did you there?\nI stepped in a pitfall and stared at a snare . . .\nFound TV described as a most happy medium\nFor total child care, or relieving the tedium . . .\nMet qualified praise and considered invective,\nAnd suggestions for making TV more effective . . .\nHeard warnings of “palliative” . . . warnings of\n“crutch” . . .\n“It’s used far too little ”... “It’s used far too\nmuch!”\n“It’s better for this!” . . . “We prefer it for that!”\n“But what does it do for the whole Pussy Cat?”\nPussy Cat, Pussy Cat, what can it do?\nIt can show you the man who feeds birds at the\nzoo . . .\nDIRECTORY CHANGES\np.\ni\n59 Affiliate Members\np.\n4 Delete:\n(under WAIQ)\nFA 4-2741\nAdd:\nFAirfax 2-4625\np.\n10 Delete:\n(under WTVS)\n749 Free Press Bldg.\n.Detroit 26, Michigan\nWOodward 1-5650\nAdd:\n12300 Radio Place\nDetroit 28, Michigan\nBRoadway 3-5456\np.\n21 Delete:\n(under DePaul University)\n64 E. Lake St.\nFinancial 6-4000\nAdd:\n25 E. Jackson Blvd.\nWEbster 9-3525\np.\n26 Delete:\n(under Metropolitan ETV Assn.)\nE. A. Hungerford, Jr.\nAdd:\nDr. Alan W. Brown\np.\n30 Delete:\n(under U.S. Information Agy.)\nRichard Erstein\nAdd:\nSanford Marlowe\np.\n33 Add:\nAmerican Broadcasting Company\nWiley F. Hance\nManager of Public Affairs\n7 West 66th Street\nNew York 23, New York\nSUsquehanna 7-5000\nIt can open your eyes with a dull razor blade . . .\nAnd show you the “humor” of which they are\nmade . . .\nOr show you how Eskimo games would be played.\nIt can spark “Fun with French” or with some other\ntongue*\nOr quite firmly entrench concepts bad for the\nyoung.\nYou can do a good job with TV ... or a poor one . . .\nThe one kind of job you can’t do is a sure one,\n(For we’ve special conditions and differing needs,\nAnd criteria skittish as cantaloupe seeds.\nAnd bubbling with apathy, fired with inertia,\nThe insecure few who will fear ya and curse ya.)\nIt can predigest fact for sheer regurgitation,\nBut to have children act, it needs utilization.\nLike a child, some attest, TV’s fraught with poten¬\ntial . . .\nBut to get at its best, a good teacher’s essential.\nPussy Cat, Pussy Cat, why aren’t you here?\nTo accomplish the aims education contrives,\nThey’ll need a consultant with nine or more lives!\n* Your own, for example. Put it in your\ncheek and see how much more fun you have.\nFCC AUTHORIZES INTERCITY\nTV RELAY: TO BENEFIT ETV\nA liberalized policy for private intercity TV relay\nsystems was approved last month by the FCC,\nmaking possible the establishment of more local or\nregional networks. In the ruling, special mention\nwas made of the benefit to educational TV systems\naffected by this policy change.\nThe previous policy was revised so as to permit\nthe use of a station’s own private television intercity\nrelay facilities or to allow a station to obtain trans¬\nmission service from communications common car¬\nriers. The station would be prohibited, however,\nfrom making a direct interconnection with common\ncarrier facilities. (See TV Technical Tips, page 7.)\n—N A E B—\nFurther FCC action recently includes the transfer of\none construction permit from commercial to educa¬\ntional use, and two other grants for educational sta¬\ntion construction permits.\nThe transferred permit for Channel 25 went to\nthe Independent School District of Oklahoma County.\nPermits were also granted to Sacramento, Calif, for\nChannel 6 and to Dallas, Tex. for Channel 13.\n4\nNEWSLETTER"
}