{
  "id": "d1624-1",
  "text": "NAEB NEtfS LETTER,\nPage 2....,..April 1, 194c\nThe 1942 eeleotions were made by the national advisor hoard, individual\nmembers of whioh have made speoial studies of programs in the various\ncategories# The board also had a digest, with recommendations, from a\nUniversity of Georgia facility committee* based on a sifting of hundreds\nof entries whioh were submitted by stations throughout the country*\n\"Ranger Mao\" Is Vfakelin MoNeel* who for ten years has been faoing a micro¬\nphone in a OTA studio, and greeting more than S3*000 Wisconsin school\nohildren tlth a slijple \"Hello Boys and Girls.\" He is Chief of junior\nForest Rangers and assistant state 4-H Club leader. He started wording\nfor young people at an early age, and at 22 was the youngest superintend¬\nent of sohools in the state# He studied oonoerv&tion the famous Bla«\nForest of Germany, was with the conservation commission of Wisconsin for\na year, and worked for a luufber oompany for a year.\n\"Afield, with Ranger Mao\" is a regular feature of the Wisconsin School\nof the Air, heard at 9:30 a.m. every Monday# The program is planned\nprimarily to guide and enrioh the teaching of natural science and conser¬\nvation in grades 5 through 8 of schools throughout the state.\nTeachers utilize the program in a variety of ways, guided by a manual\nwhioh is rioh in suggestions for preparation and follow-up to give\nlasting value to the radio lessons# More than 2,300 teachers have bought\nthe manual for use during thd current term#\nReports of group projects and individual activities motivated by the\nbroadcasts have been inspirational. One school, for ©sample, has pub¬\nlished a monthly nature magazine called \"The Trailhitter# Others have\nplanted school forests, established school museums, made vivariums, bull*\nbirdhouses and feeding stations § and in a variety of ways carried on the\nexplorations of nature beguh for them by Ranger Mac - by radio#\nOccasionally Ranger Mao broadcasts direct from his won garden, or a fish\nhatchery, game preserve, woodlet, cave or duck pond. Generally however,\nhe speaks from Studio 0 at Radio Hall — with no them® music no drama¬\ntization, nor production techniques, just a projection of his knowledge\nand love of nature in a simple, straight forward manner# The results\nIndicate that throughout the years many thousands of listeners have\nfound new pleasures and values in life and have come to have a deep\nappreciation of man1 s debt to nature.\nNQRVSLLE TO NAVY\nDr. Lee Norvelle, head of the department of speech at Indiana University,\nhas been ordered to report for active duty with the Havy on %mday,\nApril 5# Lee has been commissioned a lieutenant# senior grade# Norvelle\nhas been a member of the Indiana faculty since 1925, and also is presi¬\ndent of the National Theatre Conference. He formerly was Indiana Director\nof the Federal Theatre Projeot and served as oofesultant on morals to the\nsecretary of war. NAEB members will miss seeing Lee at our meetings, but\nour best wishes go with him while serting his country.\nA VOICE FRQI. KFKU\nProfessor H. G. Ingham writes from KFKU, University of Kansas:"
}