{
  "id": "d1624-2",
  "text": "NAEB NOS LETTER,\nApril 1, 1943\nPage 3,\n\"Things are moving along rather smoothly for us this year so far as the\nradio programs are concerned. Our greatest problem is still that of\nsecuring an adequate budget to finance the kind of programs tit t we\nwant to present* And we are still limited to a fraction of the time\nthat we would like to use in broadcasting if it were possible to finance\na new transmitter and secure a frequency which do# a not involve sharing\ntime with a Blue Network station* Perhaps this will come after the war*\nIn the meantime, we are endeavoring to do the be3t we can with the\nfacilities and time at our disposal.\"\nThe University of Kansas is nroviding various types of training for\nwomen who wish to aid, or whose help may be necessary* in the war effort*\nThe slogan —\"Every Woman in a War Course\" — was adopted at the beginning\nof the sohool year and the University young women responded by enrolling\nin suoh courses as Elementary Aeronautics, First Aid, Home Nursing*\nNurses Aide, utrition, Canteen, Occupational Therapy, Camouflage, Aerial\nPhotograph, %fcerology, Navigation, Map Heading and Interpretation,\nMilitary Law, Engineering Drawing. Secretarial ©raining , Bacteriology,\nMathematics, Chemistry, Physics, Medical Entomology, Nursing, and ^edecine\nKFKTJ, the University1 s station, is broadcasting from the classroom of\none of these courses on Tuesday evenings, at 9:45.' However* all but one\nof the programs in March will be in the nature of talks or dialogues* It\nis impossible to broadoast fro# the classroom of Nursing and ^edecine\nas these courses are given at the University Sohool of Medicine in Kansas\nCity* The class in Nurses Aides will be broadcast from the classroom\nhere on the campus*\nWNYC RECEIVES MUNICIPAL ART 3001ETY CITATION\nMunicipal broadcasting station WNYC, on March 23rd, was awarded the\n\"Citation of Merit\" for outstanding cultural service to the City f\nNew York given annually by the Municipal Art Society of the City o* ^ew\nYork* Ely Jacques Kahn,president of the Municipal Art Society and a noted\narohiteot and writer on art, made the presentation on behalf of the\nSociety in a ceremony broadoast by WNYC. IS. S. Kovik, director of the\nmunicipal station, reoeived the oitation of merit for the City, WNYC and\nits staff. The award was the result of WNYC’e many outstanding broadcasts\nin the field of music, inoluding its own annual American Music Bestifpl,\nand the many regularly scheduled WNYC broadcasts dealing with the city’s\nmuseums and art exhibits*\nW39NY„ NEW YORK’S FM STATION* BSG-INS TRIAL PERIOD\nThe Municipal Broadcasting System welcomed a new baby brother into its\norganization the week of March 23 when W39NY, New York City8 s Fm 3tatiai\nbegan a period of trial broadcasts* On the air daily from 2P.M. till 5\nP*Mo and again from 7 till Ssl5, W39NY is heard on the Frequency Mod¬\nulation Range at 43«9 megacycles* With the trial broadcast period now\nbringing FU listeners many of the public service, news, and music features\ncurrently heard over WNYC the Municipal Broadcasting System looks for¬\nward to the day when W39NY beginsits full-time schedule of service to\nNew Yorkers."
}