{
  "id": "d1062-0",
  "text": "Office of Executive Secretary-\nUniversity of Illinois\nUrbana, Illinois\nJune 1, 1938\nHOW ABOUT A SELF -APPRAISEMENT?\nDare I, your humble servant, suggest that perhaps NAEB members should give more ser¬\nious consideration to the general practice of repeatedly asking the FCC for special\nfavors, especially when they request permission to operate on less than minimum\nschedule? In a recent FCC release it was noticed that four educational stations were\nasking for permission to remain silent or reduce number of required hours of opera¬\ntion. We believe members should be jealous of their present positions and more ag¬\ngressive in their actions and operations.\nMASTER RECORDS FROM INSTANTEQUS RECORDINGS\nAt Columbus a number of members expressed interest in master records made from in-\nstanteous recordings. The Starr Piano Company, Richmond, Indiana, can make them at\na reasonable cost. R. C. Higgy advises that the Clark Phonography Company, 2l6 High\nStreet, Newark, New Jersey, also makes master records and pressings. We hope to\nhave more complete dope for the July 1 letter.\nIMPROVEMENTS AT WOSU\nOur hats off to Higgy et al at WOSU. Three or four years ago a new Western Electric\ntransmitter, this spring a new steel tower, groundwork, and transmitter location;\nand now a new studio and control room. Not only that, Higgy says they are expecting\nto build a wing, extending their building to the east, to house offices and relieve\ngenerally crowded condition \"as veil as provide for expansion, necessitated by the\nOhio School of the Air programs which we will have charge of next fall.\" Then to\ntop it off, Higgy says \"new speech imput equipment is being installed in the old\nstudios as well as in the new one during the summer.\"\nHiggy has just completed a field intensity survey of WOSU, using the vertical radia¬\ntor antenna. A little later he will have maps available for any NAEB member inter¬\nested. Says Higgy: \"Briefly, we have extended our coverage through the use of this\nnew tower, a signal of 500 microvolts per meter now existing at 110 miles and which\nformerly existed with the old antenna at only 75 miles. Of course, there has been\nno change in power, although we installed complete new speech imput equipment in the\ntransmitter room, including an RCA limiting amplifier.\"\nSOLVING THE RADIO EDUCATION PROBLEM\nDid you read President Arthur G. Crane’s article in BROADCASTING of May 15th? Here\nDr. Crane, president of the University of Wyoming and chairman of the National Com¬\nmittee on Education by Radio, outlines his plan for the improvement of educational\nradio programs through co-operation. Turn to page 4l of that issue and read it.\nYou’ll be interested, too, in pictures of members Joe Wright, Elmer Sulzer, Allen\nMiller, and Miss Judith Waller of NBC as seen in the hills of Kentucky."
}