{
  "id": "d1795-3",
  "text": "NAEB NEWS UTTER\nPage 4\nApril I, 1945\nTHREE STUDIOS, LARGE CONTROL ROOM, SHOP, NEWSROOM, EQUIPMENT ROOM, ANO A\nDETACHED ROOM WH I CH MAY BE USEO FOR A FOURTH STUDIO. The TRANSMITTER IS\nLOCATED ABOUT SIX MILES IN THE COUNTRY AND IS HOUSED IN A MOOERN BRICK\nBUILDING LARGE ENOUGH TO ACCOMMODATE QUARTERS FOR CARETAKER, SHOPS, AND\nAUXILIARY MOTOR GENERATOR OUTFIT. A THREE ELEMENT DIRECTIONAL IS USED FOR\nNIGHTTIME BROAOCASTING. W3AA HAS AN APPLICATION FOR AN FM CONSTRUCTION\nPERMIT PENDING BEFORE THE FCC, ASKING FOR A POWER OF IQ KV• TECHNICAL\nEQUIPMENT AND ITS OPERATION IS CARED FOR BY Mr. OlTTEMORE.\nA GREAT HELP IN PROGRAMMING IS THE USE OF BOTH STANDARD AND NBC THESAURUS\nTRANSCRIPTION SERVICES. In AODITION TO THESE, THE RCA VICTOR \"MUSIC YOU\nWant*1 and Columbia \"Masterworks of Music'* are also available. VtBAA uses the\nPA V | RE AS THEIR NEWS SOURCE FOR FIVE OR SIX DAILY NEWSCASTS AS W'ELL AS A\nONE MINUTE NEWS SUM ARY EVERY HOUR ON THE HALF HOUR. If YOU WRITE TO JlM\nMiles, I think he will be clad to send you his weekly program* scheoule,\nBUT A TYPICAL Day's BROADCAST LOOKS LIKE THE FOLLOWING?\n8:00 a.m. News. 9:05 Smile Time, humor in the news and novelty music.\n9:15 Aaa. §ch,qol Q£. XJtlE. Ajle.- 9:30 fri&RC.JII.M.a IQ. Vl.CTQRX. nbc Thesaurus.\n9:45 Nr*s Summary. 10:00 Listen While You Work, a homemakers progpam using\nPOPULAR MUSIC AND ONE OF THE LARGEST MAIL PULLERS. 10130 PTA PrQGB.AMi\nPRESENTED BY COUNTY PTA COUNCIL. I 0: 45 CHURCH IN THE W|LD^QOQ. NBC THESAURUS\n11:00 Mathematics Is iAhere You Find It. School of the Air program. 11:15\nAloha Land. NBC Thesaurus. I 1:30 A, xfl. L ££. Novelty» from NBC Thesaurus.\n1 1:45 Purdue News. 11:50 News. 1p:00 Farm Fqrum, an agricultural show of\nINTERVIEW' TYPE. lp:30 ^EET THE Band.POPULAR DANCE RECORDINGS. 1•00\nHomemaker 1s Club of the Air, a homemakers program sponsored by the Home £c.\nDept. 1 s30 A Musical program of live talent. 1:45 America Sings., from\nASCAP script. 2:00 News qf the World, a news program for 3rd, 4th, and\n5th grades. 2:15 Listen to Liebert, NBC Thesaurus. 2:30 Voice of the Army,\na transcribed army show. 2:45 History in the Making. School of the Air\nfeature taken from PA news wire script. 3:00 Recorded program. 3:30\nMaster wo r k s of Music. Columbia records. 4:00 Tea Time Tunes, popular recoros\n4:55 Job Reporter. a radio employment agency presented by the U. Se\nEmployment Service. 5:00 Little >Vis_s Buffett, stories for 3, 4, and 5\nyear olos. 5:15 Lone Scout Program, a radio scout meeting of tribe if90,\nquite successful. 5:30 Vespers, sponsored by the Ministerial Association\nof Lafayette. 5:45 News. A moment of Prayer, at 6:00 is a 9rief prayer\nwith harp accompaniment. 6:01 Pinner. Hour, classical recordings. 7:00\nThe Sportsman, a sports news broadcast. 7:15 Band »Vusi.c. recorded.\n7:25 Basketball broadcast, Purdue 43 - Iowa 48!.’! 8:55 News.\nYou have all received the WBAA School of the Alr bulletins which oescribe\nTHESE BROADCASTS IN DETAIL. MUCH CREDIT IS DUE JlM MILES FOR ORGANISING\nTHESE EXCELLENT BROADCASTS. *N MY OPINION ONE OF JlM*S ANNOUNCERS DOES AN\nOUTSTANDING JOB WITH HIS NEWS PROGRAM FOP 3RD, 4TH, AND 5TH GRADERS. He\nALSO HAS A GREAT IDEA IN HIS LONE SCOUT PROGRAM. JlM TELLS ME THAT SOME\nOF HIS GOOD PROGRAMS ARE MATHEMATICS .^JtlfiLBLSL lO-U EjJiH LL> QK AL XtlE. SlA&SL*\nano Reading To Lb vel These are described in his School of the Alr Bulletin\nWHICH WAS SENT TO NAEB MEMBERS.\nThe STAFF AT ftBAA CONSISTS OF 5 MEMBERS PLUS ABOUT 45 STUDENTS. SOME OF\nTHESE STUDENTS ASSUME CONSIDERABLE RESPONSIBILITY AND DO A FINE JOB. RADIO\nCOURSES TAUGHT AT PlJRDUE ARE SEPARATE FROM STATION OPERATIONS, BUT THERE IS\nPRESENT A CRIENDLY INTERLOCKING RELATIONSHIP. ALTHOUGH J|M 'V: | LE S IS"
}