{
  "id": "d1795-4",
  "text": "NA£8 ME!US LETTER\nPage 5\nApriL I, l945\nRELATIVELY A NEWCOMER TO NAEB CIRCLES, THOSE WHO HAVE MET HIM ARE STRONG IN\nTHEIR PRAISE, NOT ONLY AS A SWELL PERSON BUT AS A PROGRAM DIRECTOR WHO IS\nDOING A GRAND UOB.\nKFKU CARRIES VESPER PROGRAMS\nThe March All-Musical Vesper program, presented by the School of Fine Arts,\nWAS BROADCAST OVER KFKU FROM 4 TO 5 P.M. SUNDAY, MARCH 25. KFKU ALSO WILL\nCARRY THE AoRfL VESPER PROGRAM ON Adril 29.\nStudent and faculty music groups, including string ensembles, A Cappella\nchoir, Girl's Glee Club, University Symphony orchestra, and instrumental\nensembles, participate in the four vesper programs.\nftOSU CELEBRATES 25TH ANNIVERSARY\nOhio State University's broadcasting station, WOSU, celebrated its silver\nANNIVERSARY .V<ARCH 23, AND MOST OF THAT WEEK WAS DEVOTED TO SPECIAL PROGRAMS\nAPPROPRIATE TO THE OCCASION.\nIt was on March 23, 1920, that the university received its first experimental\nlicense authorizing it to operate for one year on EITHER 200 OR 375 METERS\nWITH a POWER OF 1.8 KILOWATTS AND THE CALL LETTERS OF 8 Xl, The FIRST\nBROADCAST WAS ON April 20.\nToday WOSU is on the air an average of 72 hours a week, with a wioe variety\nOF BROADCASTS—MUSIC, DRAMA, NEWS, FARM INFORMATION, LECTURES FROM\nUNIVERSITY CLASSROOMS, A REGULAR SUNDAY AFTERNOON FORUM.\nWNYC-HONORS\nNew York City's Own Station WNYC received one of the highest commendations\nIN THE RADIO INDUSTRY WHEN THE MUNICIPAL STATION WAS SINGLED OUT FOR A\nPeabooy Radio Award for “public service by a local radio station.\"\nWNYC WAS ALSO HONORED BY A “ SPECIAL CITATION1’ FROM VARIETY M AGA7 I NE FOR\nthe Mayor's Sunday broadcasts. In expressing his thanks to the Committee\nfor the Peabody Award, M. S. Novik, director of WNYC said that \"This Award\nby the Peabody Award,Committee will serve to re-affirm our policy of\nBROADCASTING OVER WNYC for THE INSTRUCTION, ENLIGHTENMENT, ANO GENERAL\nWELFARE OF THE PEOPLE OF THE CITY AS LAID DO**N IN OUR C|TY CHARTER\nPROVISION....WNYC WILL NOW BE STIMULATED TO EVEN GREATER SERVICE TO EACH\nAND EVERY NEW YORKER.\"\nTHIS AND THAT\nThings can certainly happen overnight in radio, a year ago the bottle\nneck to Fm Network Operations was the lack of high fidelity program lines\nbetween stations. In a recent issue of F?v> and Tele VI si on a map of the\nBell System 15,000 cycle lines was shown. They completely covered the\nENTIRE COUNTRY. FaST WORK, EH?7...•SpRING IS THE SOURCE OF MANY HA°PY\nTHOUGHTS AND INSPIRATIONS. WHAT ELSE COULD CAUSE SUCH AN INNOCENT BYSTANDER\nAS OUR PREXY ScHOOLEY TO TAKE UP THE SPADE AND THE HOE IN THE VICTORY GARDEN.\nA NUMBER OF THE MEMBER STATIONS ARE DOING THEIR PART WITH SPECIAL VICTORY"
}