{
  "id": "d1529-10",
  "text": "Students study a rock slab from LeGrand, Iowa. The specimen is an excellent one, show¬\ning- on its surface many perfect specimens of sea lilies and other forms of marine life fossils.\nThe slab was collected by a class which visited the LeGrand quarries several years ago.\nThis is a part of the training in science which students at Iowa State College receive.\nSCIENCE DAY BY RADIO THIS IS IOWA STATE\nScience Day by radio, thirteenth in the\nIowa State College series and the fourth\nby radio, will continue from April 2\nthrough April 25.\nA series of 12 radio broadcasts will be\nsponsored by the Science Division at the\ncollege at the rate of three a week. Pro¬\ngram days have been set as Tuesday,\nWednesday and Thursday. All will furnish\ninteresting listening for high school stu¬\ndents who plan on a career in science.\nOne of the most popular features of\nScience Day has been the sponsoring of\ncontests for high school students. Five\ncontests have been listed and will include\na three-part mathematics examination—Al¬\ngebra I, Algebra II and Plane Geometry,\nscience vocabulary, history and govern¬\nment essay, bird identification and identi¬\nfication of trees in winter conditions.\nA program designed to bring the average\nstudent before the mike in interview ses¬\nsions, “This Is Iowa State,” will continue\nto devote its time to students and student\nfunctions here at Iowa State College.\nIts purpose is that of telling the folks\nat home just what goes on at Iowa State\nCollege to keep sons and daughters oc¬\ncupied in and out of classes. The pro¬\ngram carries instructors and specialists as\nwell as students on its 15-minute spot—\n4:30 to 4:45 on Monday, Wednesday and\nFriday.\nIt has been a practice to line up pro¬\ngrams ahead of time in order that home¬\ntown stories may be sent out far enough\nin advance of the program to notify frieuds\nand families of those students appearing\non the show that they may be heard over\nStation WOI at a particular time."
}