{
  "id": "d1529-13",
  "text": "MUSIC NOTES\nMany special music features are offered\nthroughout the WOI broadcast week in\naddition to the daily broadcasts of musical\nprograms. Some of these are on the weekly\nbroadcast of the Iowa State College De¬\npartment of Music, headed by Prof.\nTolbert MacRae. Each Wednesday Pro¬\nfessor MacRae presents some outstanding\nmusical event. It may he a recital from\nthe Memorial Union organ or a concert\nby the Iowa State Men’s or Girls’ Glee Club.\nThe Iowa State College Concert Band is\nheard frequently on these programs.\nGrinnell College and Drake University,\nheard Mondays and Fridays, respectively,\nat 4:05 p. m., frequently offer fine musical\nbroadcasts. Ralph Brockway, Navy V-12\npianist, appears on Tuesdays and Thurs¬\ndays at 4:30 p. m. with keyboard styl¬\nings in the program “Melodic Moods.”\n“Scenes From Music,” stories behind the\nsongs you hear, is broadcast each Satur¬\nday morning at 11:15 by Pearl Converse.\nClassical music lovers can hear a full\nsymphony or opera on Saturdays from\n3:05 to 4:00 p. m. with WOI music di¬\nrector Ed Wegener; exponents of the popu¬\nlar school can listen to Claire Gross and\n“Saturday Serenade” from 1:30 to 2:30\np. m. for a full 60 minutes of modern\nrhythms.\nLIBRARY \"SPECIALS\"\n“Magazine Rack,” a reader’s digest of the\nair, is heard each Friday at 11:15 a. m.\nRuth Sprecher, reference librarian at Iowa\nState College, presents this weekly review\nof important magazine features. On Mon¬\ndays at 11:15 a. m. Robert Orr, associate\nlibrarian, brings WOI listeners “Back¬\ngrounding the News.” This is a program\nwhich deals with the important news be¬\nhind the news. From leading periodicals\nand authoritative book materials, Mr. Orr\nbrings listeners a basis for interpreting\nthe world’s daily events. “Famous Short\nStories,” the best in brief fiction old and\nnew, heard each Tuesday at 11:15, is pre¬\nsented by Charlotte Petersen.\nGARDEN TIPS\nThis year a victory garden in every home\ngarden plot will be every bit as important\nas gardens were during the war years.\nWe do not have the war with us. We\nhave its aftermath—the thousands of starv¬\ning people in Europe and in Asia. It is\nthe duty of the United States to pitch in\nand feed these people from the bountiful\nsupplies we have on hand.\nHow can a garden help in this job?\nWell, every time you take advantage of\nthe produce in your garden, grow it, put\nit on the table, preserve it, you cut down\non a visit to the store. As you supplement\nyour diet from your garden, the commercial\nmanufacturers of food have that much more\navailable to ship for relief of the starving\npeople in Europe and Asia.\nIowa attained huge goals of production\nin wartime. Now Iowa will do likewise in\npeacetime. But every home should have a\ngarden in this all-out program of produc¬\ntion and conservation.\nThrough the facilities of Station WOI, the\nhome gardener will have the advantage of\ngetting daily garden tips as planting, spray¬\ning and growing time approaches. These\ntips are timely hints aimed at helping the\ngardener get the most production. Martha\nDuncan, WOI women’s editor, has garden\nspecialists on her 9:00 a. m. program.\nDale Williams, WOI farm editor, features\nthe question box and specialists at 12:00\nnoon. Often, bulletins are made available\nto gardeners to make their job easier.\nIf you are gardening this year, and you\ncertainly should, listen to Martha and Dale\nfor helpful gardening tips. Let them tell\nyou what the specialists say and what bulle¬\ntins are available to you.\nFor you stay-abeds who would like to\nget up early: Turn to 640 on your dial for\nthe March Parade at 6 a. m. Stirring\nstrains of the best military and concert\nbands will make you want to be up and\nabout."
}