{
  "id": "d1529-6",
  "text": "GOOD MUSIC... ALL DAY LONG\nWO I will bring music-lovers an even wider choice of programs during the spring\nand summer months. With a longer broadcast day several musical programs return\nto the air, including the dinner-hour broadcast, “Music to Remember.” Programs which\nare heard daily are listed below.\n6:00— 6:15 a. m. Morning March Parade-Tunes for “early-risers” with fa-\n(Monday through Saturday) mous marching bands.\n7:30— 8:00 a. m. The Music Shop (I) —--A variety program of familiar clas-\n(Monday through Saturday) sics, Strauss waltzes, light opera.\n8:05— 8:55 a. m. The Music Shop (II)-Overtures, opera, arias, favorite\n(Monday through Saturday) songs, symphony. A request pro-\nESL. gram Saturdays.\n9:30— 9:45 a. m. Organ Moods —,---Music from the console with Jesse\n(Monday through Friday) Crawford and Wilson Ames.\n11:02—11:15 a. m. Children’s Corner-Stories and songs, music for very\n(Monday through Friday) small children.\n11:30 12:00 m. Music in the Air-Folk favorites, sentimental songs\n(Monday through Friday) hit tunes from shows. .\n12:30—12:45 p. m. Serenade for Strings -Music with the string orchestra\n(Monday through Friday) waltzes and musical comedy melody!\n1:00— 1:30 p. m. Midday Varieties -Old-time favorites and modern nov-\n(except Wednesday elty numbers—polka, schottische,\nand Saturday) gay nineties.\n1:50— 2:00 p. m. Hymn Time _\n(Monday through Friday)\nGreat songs of faith—hymns from\nall churches.\n2:05— 2:30 p. m. Symphony and Song -A variety program of classic fa-\n(Monday through Saturday) vorites, featuring famous artists\nand orchestras.\n3:05— 3:15 p. m. Patterns in Melody -A gay and tuneful 10 minutes of\n(Monday through Saturday) piano, voice and orchestral favor¬\nites.\n3:30—4:00 p. m. Columbia Masterworks -Classics from the Columbia Library\n(Monday through Friday) —great living artists in symphony\nand song.\n4:45— 5:30 p. m. Today’s Music -Music for moderns—dancing tunes\n(Monday through Friday) for the younger generation in col¬\nleges and high schools.\n6:15— 7:00 p. m. Music to Remember _Music for the dinner hour, slow-\n(Monday through Friday) paced and quiet, song favorites of\ntoday and yesterday.\n7:05— 7:45 p. m. Twilight Symphony -An uninterrupted period of great\n(Monday through Friday) symphonic music from world-re¬\nnowned artists."
}