{
  "id": "d1715-1",
  "text": "NAEB NEWS LETTER\nPage 2\nFebruary 15, 1942\nOFFERED AT 1:30 P.M. TUESDAY, BY H. H. ALP, PROFESSOR OF AGRICULTURE,\nWith travel limited because of tire rationing, Mr. Alp is usinq WILL\nTO REACH THOUSANDS OF POULTR V . R AI SERS WITH TIMELY INFORMATION AND\nADVICE.\nIn CO-OPERATION WITH THE FOREIGN TRADE CLUB, A NEW SERIES OF FORUMS\non “Latin American Relations5' is being presented at 4:30 p.m. Frioays.\nA SPECIAL COMMITTEE OF THE PHYSICAL EDUCATION FOR WOMEN HAS ORGANIZED\nAND IS NOW PRESENTING FIVE TIMES EACH WEEK \"HOME EXERCISES FOR FITNESS\nThis series is on WILL at 8:45 a.m« daily except Saturday and Sunday.\nMany of the regular programs of the station are placing emphasis on\nTHEIR RELATIONSHIP TO WAR PROBLEMS. THESE INCLUDE THE FARM AND HOME\nPROGRAMS, THE A. A. U. Vt. FORUM, THE LEAGUE OF WOMEN VOTERS PRO¬\nGRAMS, THE 0. A. R. SERIES, AND THE HAM FORUM, A PROGRAM FOR RADIO\nAMATEURS.\nIN CO-OPERATION WITH AGENCIES OF THE FEDERAL GOVERNMENT, THE STATION\nIS PRESENTING TRANSCRIBED PROGRAMS OF THE U. S. NAVY, THE U. S. ARMY,\nTHE U. S. MARINES, OFFICE OF EDUCATION, THE DEPARTMENT OF THE IN¬\nTERIOR, the Treasury Department, and the Department of Justice.\nBrief service announcements are also being carried frequently for the\nU. S. army, navy, marines, for the sale of defense savings bonds,\nFOR EMPLOYMENT NEEOEO BY U. S. ARSENALS, ANO FOR THE SEuECTIVE SER¬\nVICE.\nThe Concert Band, on the air at 5 p.m. Mondays, is including much\nmusic of a patriotic nature, as are many of the other musical pro¬\ngrams. The station now signs on each day witm the pleoge of allegi¬\nance and the Star Spangleo Banner.\nNews, carried at nine different times throughout the oay, serves to\nGIVE WILL LISTENERS AN ACCURATE ACCOUNT OF THE PROGRAMS OF THE WAR\nAND OF PREPARATION BEING MADE TO PROSECUTE IT.\nOthers will be aooed, from time to time, to meet the need of the\nSTATE AND NATION FOR THEM.\nWILL STUDIOS TO BE MOVED\nThe studios of WILL are to be moveo to Gregory Hall, newest class¬\nroom BUILDING ON THE UNIVERSITY OF ILLINOIS CAMPUS, IT HAS BEEN\nANNOUNCED BY JOSEF F. WRIGHT, OIRECTOR OF THE STATION.\nAlthough boaro of trustees approval had been given for the creation\nOF A SERIES OF STUDIOS AND OFFICES IN THE LOWER GYMNASIUM OF THE\nWoman * s building, and although the drawing of plans for that area\nHAD BEEN PRACTICALLY COMPLETED, THE INABILITY TO GET CRITICAL\nMATERIALS TO CARRY OUT THE CONSTRUCTION WORK BROUGHT THE DECISION"
}