{
  "id": "d1715-2",
  "text": "NAEB NEWS LETTER.\n.Page 3......February 16* 1942\nTO GIVE UP THAT POSSIBILITY UNTIL AFTER THE PRESENT EMERGENCY.\nTHE MEANTIME, BECAUSE WILL HAS EXPANOEO SO RAPIDLY IN RCCEr'T YEARS,\nBOTH IN TIME ON THE AIR AND IN SIZE OF STAFF, IT HAS LONG\nRECOGNIZEO THAT THE UNIT COULD NOT REMAIN IN THJ PRESEN\nat 400 South Wright Street. That building has only no vehts.^all\nSTUDIOS, AND THERE ARE NO 0FFICE8 IN THE BUILDING ALTHOUGH THERE\nIS AN EQUIVALENT OF EIGHT FULL-TIME PERSONS ON THE STAFF, AND NO\nSTORAGE OR FACILITIES.\nThrough the co-operation of the School of Journalism thc raoio\nSTATION V't LL BE GIVEN USE OF CERTAIN AREAS IN THE WEST WING OF\nGregory hall:\nTwo studios, both considerably larger than either of those at the\nOLD LOCATION WILL BE MADE OUT OF THE TWO ROOMS AT THE NORTH END\nOF THE SECOND FLOOR WHICH HAD PREVIOUSLY BEEN USED BY JOURNALISM\nAS A RAOIO LABORATORY- SINCE A CONTROL BOOTH HAS ERECTEO AS A\nPERMANENT PART OF ONE OF THESE ROOMS, ITS IMMEDIATE USE WITH LITTLE\nALTERATION'S POSSIBLE BY KILL. A ROOM TO THE SOUTH OF THE WEST\nSTUOIO WILL BE DIVIDED, PART OF IT BEING USEO AS *\" S'*CE\nFOR FOUR OR FIVE WILL STAFF MEMBERS AND OTHER PART OF JHE ROOM\nUSED AS A library-workroom- In it will be housed the several\nTHOUSAND RADIO STATION RECORDINGS AND ELECTRICAL TRANSCRIPTION:S,\nTOGETHER WITH SCRIPTS, AND CONTINUITY REFERENCE SOURCES. THIS\nROOM w”l BE USED ALSO FOR MAILING AND DUPLICATING EQUIPMENT.\nTWO OFFICES ON THE EAST SIDE OF THIS Y*ST WING WILL ^ AVAILABLE\nFOR STAFF MEMBERS. WILL'S ASSOCIATED PRESS MACHINE CARRYING*\nSPECIALLY PREPARED RAOIO WIRE RATHER THAN THE USUAL NEWSPAPER\nCOPY, WILL BE HOUSED ON THE FIRST FLOOR ALONG WITH THE SCHOOL OF\nJournalism's Associated Press machine which brings ®®”°0L\nTHE REGULAR AP NEWSPAPER ACCOUNTS. THE JOURNALISM sJLI0eMT8 WILL\nTHEREFORE HAVE THE OPPORTUNITY OF SEEING IMMEDIATE COMPARISONS\nOF ^HE SAME STORIES AND FATURE3 AS THEY ARE HANDLED IN ONE IN¬\nSTANCE FOR RADIO AND THE OTHER FOR NEWSPAPER CONSUMPTION.\nIT IS FELT THAT SOME ADDITIONAL BENEFIT TO JOURNALISM STUDENTS\ninterested In raoTo also will be given BY first hand CONTACT\nWITH THE DAY TO DAY OPERATION OF STATION WILL.\nIn rtwr qf THENEW STUDIOS SPECIAL CONTROL BOOTHS WILL BE BUILT,\nWHICH w?Il bISsED BY THE STATION FOR PUTTING PROGRAMS ORIGINATED\nVn THAT * SPACE ONTO THE AIR, AND BY JOURNALS,- RADIO CLASSES FOR\nTHEIR LA8R0AT0RY WORK - EQUIPMENT AND ENGINEERS FOR THE LATTER WILL\nBE FURNISHED BY THE RADIO STATION.\nIn CO-OPERATION WITH OTHERS WHO NATURALLY USE THE ROOM FOR CLASS¬\nROOM AND PUBLIC FUNCTIONS. WILL WILL BE ALLOWED ALSO THE USE OF\nTMr AitntTftPILfM IN GREGORY HALL (220). BECAUSE THERE ARE TWO\nRADIO OBSERVATION-CONTROL BOOTHS AT THE REAR OF THIS AUOITORIUW"
}