{
  "id": "d1715-4",
  "text": "NAE8 N£'.*S L:TT£R\nPACE 5\nFEBRUARY 16, <042\n£JLax\nMr. Petti grew*a Theory\nTartuffc\nTheatre, My Dear\nauthor\nBetty Crown\nMOL IEPt-AOAPTCO BY\nilARGUERlTE COOK\nBetty 3rown\nSacRfiJK.\nUni. of Oklahoma (MAO)\nii\n«i\nKENT NEAPS R I R O CONTENT-<X>u.) LTIiik\nmajor Harold Kent of the War Department, now on leave from the Chicago\nRadio Council» has been named chairman of the committee of nine to\njudge the KIRO Educational Radio Awards, which were announced at the\nFifth School Hroaocast Conference.' Prizes are to be awardeo for the\nBEST !00-WORD STATEMENT C0MPLET1NQ, MlF I HAO A RADIO STATION, ONE OF\nTHE FIRST THINGS I WOULD D0......rt\nOthers of the Committee are: Lyman Bryson,\nRadio Council; Sterling Fisher, NBC; Saul\nOhio State U.; Alpheus Smith, Columbia U.;\nU.; and Hazel Kenyon,KIRO.\nCBS; George Jennings, Chicago\nHaas, KIRO; l. Keith Tyler,\nParker Wheatley, Northwestern\nWORLD -.IDE OP EH NE •' YORK OFFICE\nThe World wide Broadcasting Foundation, operating WRUL and wruw, will\nOPEN AN OFFICE IN NEW YORK ClTY, IT HAS BEEN ANNOUNCED BY WALTER 80\nLemmon, president, a grant to the Foundation by the Council of the\nAmerican Philosophical Society will finance the office.\nNEft Fid FOR BUFFALO SCHOOLS\nThe Buffalo, New York, Bqaro of Education was authorized to construct\nA NEW NON-COMMERCIAL EDUCATIONAL BROADCAST STATION BY THE F. C. C.\non January 27. Frequency assigned was 42,900 kc., with 1,000 watts.\nThe permittee stipulated to the FCC that an array of educational pro-\nGRAMS WILL BE BROADCAST FOR THE BUFFALO SCHOOL SYSTEM OF 13\nSCHOOLS AND 80 GRAMMAR SCHOOLS WITH AN ATTENDANCE OF APPROX IMATELV\n75,000 PUPILS. In addition, general educational and patriotic pro¬\ngrams will BE PREPARED FOR THE GENERAL PUBLIC.\nThe ne»\" station will be locateo in the Seneca Vocation High School,\nWHERE AT PRESENT THE NON-COMMERC^L BROADCAST STATION OF THE SCHOOL,\nV SVS, IS OPERATING.\nFCC TO OENY V.'NVC REQUEST\nHOLDING THAT THE PROPOSAL IS INCONSISTENT WITH THE *J£CS\nAND FURTHER. IS CONTRARY TO EQUITABLE DISTRIBUTION OF RADIO SERVICE,\non February II announceo intended oenial of the application by"
}