{
  "id": "d351-35",
  "text": "NAEI5 'Public delations —-Study . (/95<f)\nTHE USE OF PROMOTION BY EDUCATIONAL BROADCASTING STATIONS\nBy Elmer G. Sulzer, Director,\nRadio and Television Communications\nIndiana University-\nStation promotion in one form or another is a favorably recognized\nactivity by a large number of the nation’s educational broadcasting outlets.\nHowever, nothing approaching a systematic study of these activities has\never been undertaken nor have there been any plans placed in operation for\nresearch or promotional ideas.\nRecognizing this need, James S. Miles, while Chairman of the Public\nRelations Committee of the National Association of Educational Broadcasters,\nrequested the writer to conduct a preliminary survey which would indicate,\nto a partial degree at least, the extent and types of promotional media\nand methods employed by the member stations. This paper is a result of that\nassignment.\nSince this has been a pioneer venture, the results indicate many\nareas where further research and investigations are extremely desirable.\nIt was felt that in presenting this material, the value of the paper would\nbe limited if the more formal types of statistical tables were adhered to\nat the expense of more informative, but less systematic, methods of presenta¬\ntions; hence, the reader will note percentage tables whenever the data\nreceived permitted such compilations, numerical tabulations when that\ninformation was readily available, and unedited quotations when it was felt\nthat that type of presentation would best serve the reader.\nA questionnaire to provide this information was sent out in November,\n1957. to all members of the National Association of Educational Broadcasters,\nand more or less complete returns were received from seventy-seven. The\nreplying group included virtually every station whose operations have\nfigured prominently in educational broadcasting during the past years, as\nwell as a number of the newer stations that have been on the air a relatively\nshort time*\nThe classification of the replies imposed a difficult problem,\nbased upon (a) the varying organizational status of the stations, including\ninstitutions of higher learning, public schools, municipal ownership, and\ncommunity and foundation sponsorship; and (b) the intermixture of AM, FM,\nand TV operations. In fact, some of the returned questionnaires from\ninstitutions having multiple operations, did not differentiate between\nthem.\nA study of this kind should be presented in a form that presents\nthe most needed information, without the burden of too detailed breakdowns.\nThis calls for some arbitrary decisions. The organizational status of a\nstation is probably of more significance than whether the station is of the\nAM, FM, or TV variety. Accordingly four classifications (I-IV) have been\nset up to delineate the important variances. These classifications, which\nwill be followed in the tables, and the number of respondents from each,\nfollow:"
}