{
  "id": "d351-41",
  "text": "7\ns/\nWhat Changes In Program Schedules Would Respondents Like\nIn this area there is obviously quite a unanimity of opinion. A\ngreat number of the stations, whose present programs are \"processed” would\nlike them printed, instead. Furthermore, a large body of the respondents\ndesire more detail in their program schedules. Many wish to introduce, or\nincrease the amount of pictures. Table IV indicates these points in greater\ndetail.\nTABUS IV\nAREAS IN WHICH EDUCATIONAL STATIONS WOULD LIKE TO\nIMPROVE THEIR PROGRAM SCHEDULES\n(In terms of number of respondents reporting)\nAreas\nClass of Stations\nI\nII\nHI\nIV\nGo from \"processed\"to printed schedules\n8\n6\n2\n0\nInclude more program detail\n14\n2\n2\n0\nIncrease size\n6\n1\n1\n0\nAdd, or increase amount of art (pictures)\n10\n3\n3\n0\nIncrease circulation (publish more copies)\n0\n2\n3\n1\nIncrease frequency of publication\n4\n2\n3\n1\nMore attractive and improved makeup\n5\n0\n1\n0\nChange from folded to booklet form\n3\n0\n0\n0\nIndex musical selections\n1\n0\n0\n0\nSell it\n1\n0\n0\n0\nCarry advertising\n1\n0\n0\n0\nSend first class\n1\n0\n0\n0\nPART II - The Orientation of Public Relations in the Organization\nof the Educational Broadcasting Station\nAs indicated in the section headed \"Positioning the Responsibility\nfor the Program Schedule,\" the Class HI (Community) stations appear to be\nhead and shoulders above the Class I, II, and IV stations in their\nappreciation of the role of station public relations. The PR duties of\nthe Class I, II, and IV stations are so widely and unsystematically distri¬\nbuted, both as to relevant staff member, and amount of time spent, as to\nindicate either^** a lack of realization of the importance of this\nactivity and/or the lack of sufficient funds to develop it. Paraphrasing\nthe comment of one respondent, the public relations person \"unfortunately\nis first to drop in budget crises.\"\nThe \"scattered\" situation alluded to, defies any attempt at systematic\ntabulation. By taking certain liberties of combination and extension of\ncategories, the following compilations are presented for what they are worth."
}