{
  "id": "d351-43",
  "text": "- 9 -\nClass IV Stations\nStation Manager - 1\nBy two or more staff members - 1\n1-25$ - 1\n76-100$ - 1\nThere is no argument to the sentiments expressed by many of the respon¬\ndents to the effect that, \"Public Relations is a full-time responsibility\nfor every staff member,\"\nr\\\nIndoctrinating the Station Staff in Public Relations\nSince a sense of station public relations is the responsibility of\nevery staff member, it is desirable to survey the attitudes of indoctrination\nheld by the various stations. To be of maximum value, the exact comments\nin answer to the question, \"To what extent do you indoctrinate other members\nof your staff in public relations responsibilities?\" are presented without\nthe \"benefit\" of editing. Here are-sfetee-comments from the Class I (college)\nstations:\ni \"Only by general discussion in staff meetings held weekly.\"\nI\"Limited.\"\n\"No special effort.\"\nj\"Haven't the staff at present to do the job. Next semester's class\nin Public Relations course will be integrated with the Station's\nNeeds.\"\n0^-4 | \"Memos, as needed, are distributed to the entire staff informing of\n^ the activities of the Public Relations Department. Often these\nmemos encourage the staff to contribute ideas for particular\n, projects.\" s\nJXJ »0ur 'staff' is the radio class (who completely operate# the station).\nL i Our activity is class 'lab' more than regular station.\"\nV^'Not sufficiently I'm sure.\"\n_ >Fully.\"\n^rHir'We try to make everyone aware of them from switchboard girl to\n^ j Program Director. Announcers and engineers are instructed in the\nart of handling talent, dontinuity editor is constantly reminded\nof responsibilities in this area.\"\nAll personnel are informed of their obligation to the public,\nespecially those concerned with production. They are instructed\nas to what is considered 'bad taste* and to be courteous and\nhelpful to all.\"\n\"Not sufficiently.\"\n\"All of us work on it all the time.\"\n\"Need for public relations consciousness stressed at start-of-year\nstaff meeting for new people. Monthly house-organ INTER-COM gives\nfrequent reminders that PR is everybody's business.\"\n\"Attempt this constantly.\"\n\"We have 5 part-time students; 50 students without pay. All are\nimpressed with PR duties regularly with every persuasive device\nwe can conceive.\"\n\"Not nearly as much as we should.\"\n?"
}