{
  "id": "d351-63",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nReport, of the Public Relations Cosrtttee\nFiscal Tear 1959-1960\nDaring the instant year, it was impossible to get the entire Committee\ntogether in any one place, However, a umber of mailings by the Ccm~\nmlttee Chairman plus personal contacts with the Coamtfct®© mmbers have\nestablished certain conclusions In the public relations area. In\naddition, som concrete objectives have been realised.\nlo The need for a public relations handbook for distribution to\neducational broadcasting stations was clearly indicated. Such\na handbook was subsequently prepared* published by tbs NAJSB\nheadquarters, and widely distributed. It is interesting to\nnote in this ccamectiou that quite a large mxaber of requests\nwore received from ccotterctal stations for copies of this\npublication and a scattered number of requests were also re¬\ncalled from other industries.\n2. The design of an NAEB logotype was finalised and mats were\nprepared for distribution by headquarters. The Committee\nrecommends that members make liberal use of these logotype®.\nThey should unquestionably bo a part of every program schedule\nIssued by cur members and thay should also be used In other\nways as seca appropriate.\n3. In view of the divergence of interests and objectives, public\nrelations-wise* that m have discovered in our membership, w©\nfeel that to a certain orient the development of good public\nrelations is a local problem that each station or dosed cir¬\ncuit operation must meet to achieve its special objectives,\nThe handbook referred to is a guide that will mot most basic\nsituations. Furthermore, the NAEB Public Relations Ccmsdttee\nstands ready to supplement this guide by personal counseling\nwhoa called upon.\nh. The matter of developing on NAEB Image (jams in for a great deal\nof examination. It is the consensus of the majority of the\nCommittee that such an image cannot be expressed in words, but\noust be developed through deeds (which can be publicised) as\nwell as by the activities and public statement® of the NAEB\nPresident himself.\n5. The NAEB headquarters staff should be commended for the national\nnews releases on NABB activities emanating from Urbana. The use\nof these releases was mere widespread, in our opinion, during\nthe past year than ever before. However, it i® apparent that\nany material increase In national promotion emanating from oar\noffice in Urbsaa and/or our new one in Washington, must be matched\nby adequate personnel to handle the increased load. Whether cr\nnot such an increase in news release quantity is justified by\nthe additional expense, is something that should be given careful\nconsideration."
}