{
  "id": "d351-97",
  "text": "RADIO AND TELEVISION SERVICE\nAugust 12, i960\nINDIANA UNIVERSITY\nBLOOMINGTON, INDIANA\nMr. Harold E. Hill\nAdministrative Vice President\nNational Association of\nRUG 16 I960 ^\nEducational Broadcasters\n111 Gregory Hall\nUrbana, Illinois\nDear Harold:\nThank you for the copy of the letter written you under date of August 8\nfrom Mr. Harcus. I have not changed my mind regarding the lack of feasi¬\nble and ultimate value of the NAEB embarking on such a Week. In fact,\nwhen I made my original reply to Mr. Harcus under date of June 27, copies\nof the letter were sent to other members of the Public Relations Committee.\nThose that replied were unanimously in favor of my stand on the subject.\nUndoubtedly the Week would be flattering to ourselves, but would probably\ngo virtually unnoticed by the vast majority of the public who normally have\nno feelings regarding educational broadcasting one way or another. To put\nthe thing over even on the basis of providing proper materials for our own\nmember stations as well as back-up publicity in the press, would be enor¬\nmously expensive in terms of money and manpower that we have available.\nRather than repeat the contents of my letter of June 27, I suggest that\nyou look that over again for a more complete statement of my views.\nAs you know, I have been Chairman of the present Public Relations Committee\nfor two years and I have been involved, NAEB-wise, in this area off and on\nfor more than twenty years. I have just about come to the conclusion that\nour most effective public relations are those that can be engendered by\neach individual member and station plus assists from the various college\nnews bureaus, and releases from the NAEB.\nAny public relations venture, whether it involves educational broadcasting\nor promoting the fluoridation of city water supplies, must be honestly\nconsidered in terms of the nation's complete news picture. In the long\nrun, our really national recognition will take place at times that we do\nthings of national interest as evaluated in connection with all other\nnational activities."
}