{
  "id": "d1801-0",
  "text": "N-A-E-B\nNEWS - LETTER\n^piTORIAL OFFICE\nJames Miles\nStation WBAA\nPurdue University\nLafayette, Indiana\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nRepresenting non-commercial, educational AM and FM radio stations, workshops, and\nproduction centers, owned and operated by colleges, universities and\npublic-service agencies.\nSTUDY DIRECTOR\nDallas W. Smythe\nCommunications Research\nInstitute\nIllinois University\nUrbana, Illinois\nDecember 1, 1948\nFCC HAS NO PLANS FOR EDUCATIONAL TV RESERVATIONS\nDoctor Herold C. Hunt, General Superintendent of the Chicago Public Schools has\nreceived the following communications from Hr. T. J. Slowie, Secretary of the\nFederal Communications Commission: \"This will reply to your letter of November 16,\n194& inquiring what1 consideration has been or will be given to educational groups\ndesiring to operate their own television stations.\nI !\n\"The Commission does not have under consideration any proposal to reserve any\n;jj channels for the exclusive use of educational stations. Educational organizations\n|j are eligible of course to compete with other applicants for the available commer-\n*i1 cial channels\".\nAt the re-allocation hearings which will be held in Washington in the near future,\nthe National Association of Educational Broadcasters, the Association for Education\nby Radio, and the Association of Land Grant Colleges are presenting resolutions\nto the FCC asking that certain TV channels be reserved for educational purposes.\nSuch a reservation was made in the FM band, but the FCC is reported to have been\ndisappointed in the fact that educators have not been too quick to avail themselves\nof the facilities set aside for them.\nTELEVISION NETWORK TO LINK HALF OF UNITED STATES\nThe American Telephone and Telegraph Company says a television network linking\nthe east coast to the Mississippi river will be available on January 12th,\nThus, almost half the nation and more than half of the country!s population will\nbe included in the potential television network audience. The extended television\nhorizon will be made possible through the completion of new coaxial cables, which\ncarry the television signals as well as telephone communications.\nThe A-T-and T says all major broadcast companies and UPIX, the New York Daily news\nstation, will cooperate in the inaugural show on January 11. The company says\nthe networks will become available for regularly scheduled television service\nthe next day.\nThrough the network, 14 major cities will be linked. They include Boston, New York,\nPhiladelphia, Baltimore, Washington, Richmond, Pittsburg, Cleveland, Buffalo,\nToledo, Detroit, Chicago, Milwaukee and St. Louis,\nTelevision engineers predict coast-to-coast television neti/orks, possibly by 1950,\nPRESIDENT VICE-PRESIDENT TREASURER EXECUTIVE SECRETARY GENERAL COUNSEL\nRICHARD B. HULL JOHN DUNN W. I. GRIFFITH MORRIS S. NOVIK MARCUS COHN\nWOI, Iowa State College WNAD, U. of Oklahoma WOI, Iowa State College Room 370, 630 Fifth Avenue 51 7 Evans Building\nAmes, Iowa Norman, Oklahoma Ames, Iowa New York, 20, N. Y. Washington, D. C."
}