{
  "id": "d1801-0",
  "text": "NEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXV NO. 12 DECEMBER 1960\nJanuary 9 Is Closing Date\nfor Ohio State Awards Entries\nRadio and television programs to compete for the\n1961 Ohio State Awards must be in by January 9,\n1961. The awards will be announced at the thirty-\nfirst annual IERT in Columbus, Ohio, April 26-29.\nThis year’s program classes include a special elec¬\ntion-year award for TV. For the first time, TV en¬\ntries will be accepted on videotape in addition to\nfilm or kinescope recordings.\nMore information and entry blanks may be ob¬\ntained from Dr. I. Keith Tyler, IERT, 154 N. Oval\nDrive, Columbus 10, Ohio.\nNAEBers May Tour World in '61\nPlans are afoot for a special tour of the broadcasting\nsystems of the world during the summer of 1961.\nThe tour will last six to eight weeks, and will cost\n$1500 to $2000, if the Iron Curtain countries are in¬\ncluded—less if they are not. Those interested in the\ntour should contact Harold Hill, NAEB administra¬\ntive vice president. Harry Skornia, past president of\nthe NAEB, will conduct the tour. Dr. Skornia has had\nconsiderable experience conducting such tours in the\npast.\nGroup Insurance Plan Being Investigated\nThe NAEB staff is currently investigating the pos¬\nsibilities of a group health and accident policy ex¬\nclusively for NAEB Individual members. Those in¬\nterested in participating in such a plan are asked to\ncontact Harold Hill at NAEB Headquarters. If a\nsufficient number of members indicate an interest,\ndetails will be worked out as soon as possible.\n• The NAEB is also considering offering another\ntype of insurance—group catastrophe accident protec¬\ntion (accidental death, dismemberment, and permanent\ntotal disability). This would be offered to members\nof staffs of institutional members as well as to\nIndividual members of NAEB.\nThrough such a group plan, members can get rates\nranging from $.90 and $1.25 per $1,000 per person\nper year; individual coverage of this nature costs\n$1.75 and up per $1,000. Final rates depend on how\nmany people actually are interested.\nWhile more detailed information will be sent\nto members soon, it would be helpful if those im\nterested in such coverage would indicate their interest\nat this time.\nmerry Christma"
}