{
  "id": "d1801-2",
  "text": "Convention Comment\nResponse to the questionnaires regarding the NAEB\nconvention has been good. Answers are presently being\ncompiled, and the January Newsletter will carry a\nsummary report. Among favorable comments else¬\nwhere was one by Leon C. Fletcher, broadcasting and\nspeech instructor at Taft [California] Union High\nSchool and College, which was printed in the Taft\nMidway Driller. Fletcher summed up his convention\nstay as “the most intellectually stimulating two days\nI’ve ever experienced.”\nETV in the National Magazines\nA picture taken inside the studio of educational\nWIPR-TV, San Juan, Puerto Rico, appeared on the\ninside front cover of a recent Saturday Review. The\npicture and accompanying copy were presented as an\nad by the Commonwealth to induce people to live in\nPuerto Rico.\n• Dr. W. W. Jackson, chairman of the Southwest\nTexas ETV Council, says that a story in Time maga¬\nzine about the projected area ETV station in San\nAntonio “is full of factual inaccuracies which are\nmisleading.” Dr. Jackson emphatically denies the\nstory’s statement that the station “will be strictly a\nplatform for great teachers to shame poor ones.”\nNetwork Offers Varied Schedule\nThe NAEB Radio Network begins its 1961 service\nto members with an impressive program offering com¬\nbining domestic and foreign series in a ten-hour-per-\nvveek schedule for the January-March period.\nNew foreign series scheduled to begin in early\n1961 are The Splendor of Ancient Mexico, produced\nby Mexico National University Radio in cooperation\nwith KUT-FM, University of Texas; Interviews\nfrom Sweden with Marjorie Lundin; Radio Sweden’s\nFamous Swedes; FBS’s Vocal Art in France; and a\nnew CBC University of the Air series, Humanistic\nValues in English Literature.\nNew grant-in-aid series scheduled are WKAR’s\nOral Essays on Education and KFJM’s Heritage of\nAmerican Humor. Other new series include H Is For\nJoy (a study of the nature, status, and treatment of\ndrug addiction); a folk song series, Songs of the\nPeople; a panel series on Religion in Life; a study of\ncontemporary music, Composers On Composers, fea¬\nturing composers discussing themselves and their\ncontemporaries; another series from Michigan State\nUniversity’s annual Asian Institute Lectures; and a\nseries of talks on John Dewey in the Light of Recent\nPhilosophy.\nIn addition, network members may obtain a study\nof Shakespeare’s contemporaries, Aside From Shake¬\nspeare; lectures from a recent Newport Jazz Festival\non Jazz in American Life; a new Voice of America\nForum Lecture series on music; and a new series\nfrom the Cooper Union on The Individual.\nForeign produced shows continuing from 1960 are\nthe Canadian and French press reviews, RAI’s Italian\nComposers, and the French Broadcasting System’s\nContemporary Music From France. The series Ger¬\nmany Today, produced both in the U. S. and in\nGermany, will continue also.\nContinuing domestic series include the children’s\nseries, Stories ’n Stuff and Carnival of Books, the\nGeorgetown Forum, and the Voice of America Forum\nLectures: Chemistry. Two grant-in-aid series, Listen\nto the Land and Medical Research round out the\nseries continuing from 1960. Medical Research is\nthe first of four sub-series in a 58-part series on\nHuman Behavior: Social and Medical Research pro¬\nduced by WUOM, and other sub-series will be avail¬\nable later in the year.\nAnyone desiring further descriptions of any of\nthese series may obtain free single copies of the first-\nquarter network offering. Write to NAEB Head¬\nquarters.\nNews of Members\nGENERAL\n► At the University of Illinois, a study was done to\ntest the hypothesis that persons attracted to WILL-\nTV by the “Play of the Week” dramatic series would\nincrease their viewing of the locally produced “Mo¬\nsaic” program. Telephone calls were made to 400\nfaculty homes on October 6 and again on November\n10. Results showed that viewing of “Mosaic” in¬\ncreased about 28 per cent in the month between the\ntwo studies, while the increase in viewing of “Play\nof the Week” was less than 2 per cent. However,\n“Play of the Week” viewers were more likely than\nothers to increase their viewing of “Mosaic” as well\nas their over-all viewing of the channel.\n^ The University of Utah has received program\ntest authority from the FCC to operate two UHF\nchannels with ten-watt transmitters to determine\nwhether or not standard quality transmission is pos¬\nsible with such equipment. The university is con¬\nducting experimental work on the installations\nthrough a research grant from the U. S. Office of\nEducation. If the low-power system proves itself,\nthe way is opened up to use ETV on an extensive\nbasis for a fraction of present costs. Transmission\nequipment was manufactured by Adler Electronics\nand the CCTV studio equipment was manufactured\nby RCA.\n► ETV stations last month had a chance to broad¬\ncast an exclusive interview with Red China Premier\nChou En-Lai. The NETRC program was recorded\nin Peiping by Felix Greene.\nh New York University is offering a new scholar¬\nship of $500 annually to be given to a student who\nshows outstanding promise in the area of creative\nwriting for radio and TV. The scholarship was estab¬\nlished through support of the Mogul Williams &\nDECEMBER 1960\n3"
}