{
  "id": "d1801-25",
  "text": "f\nA\n7 \\\nof this now and powerful medium. It therefor© fall© upon you to sell it\nto your laggard or comatose colleagues.\nDon’t think I am unaware of* or insensitive to* the heart-breaking ob¬\nstacles you face in this job - or to the tremendous efforts you have made\nand are making to overcome them. The Commission’e keen awareness of your\nproblems oan be gathered ,rom Mr, Coy’s Bloomington speech. 1 am* there¬\nfore „ deliberately refraining from going over them,-,\nThe Commission has recently done something which may help you in the tough\njob of expanding eduoationa1 FM, j have^in\"mind\"the recently adopted rules\npermitting educational Isfoadc^ IQ watts or less\nThese regulations make it poasibll^^ plant°Tt\"a nominal cost\nin whioh educational broadcastlag techniques and the training of personnel\nmay ‘be developedo.Syra'ous las you know., has been operating; with\n■Mbwo^and a half watt FM transmitter for more \"than a year on an experimental\nlicense« This service* 1 understands reaohes approximately 15*600 students\nand possibly a like number of Syracuse residents, it may be installed for\nlittle '^ore than the cost o? n bo-cqli'ad 'o^pua^FlsTred radio. BePatrn\nUniversity and three others in addition to Syracuse have already applied for\nconstruotion ponalte for this type of operation,, * I hope you will encourage\nothers quickly to follow suite\nIn speaking of this low power service 1 emphasise the use of the word pilot\nplante I am sure I cun safe in saying that the Commission does not consider\nsuoh doll^sised ooffeepots the equivalent of a full fledged eduoational\nbroadcasting system - or as in any way meeting the need it had in mind when\nit adopted the frequency reservation plan for non^oommeroial educational\nbroadcastings It is tho Commission’s hope that these low power authorise®\ntions will enable educators to give those upon whom they are dependent for\nfunds a praotioal demonstration of the potential of the radio medium as a\nmighty instrument for defending educations’ hori*ons0 In short* the Commis¬\nsion views them distinctly as a means end not as ends in themselves. The\nCommission* I am sure,, would be loath to see suoh low power stations develop\ninto little more than training oenters for ootmaerciai broadcasting personnelo\nFGO ATTITUDE TOMRD JSDUCATIQ5\nWithout blowing our horn too much* 1 think I oan say thefc by and large the\nComalssion has at the moment done about as muoh as it oan for non-c^mcroia 1\neducations 1 broadcasting. Yes - the STA rule notwit he tandi ng. ifre have set\naside a block of most desirable frequencies for your exclusive use; we have\nfor your benefit made a;i exception to our ruloa by authorizing low power FM\nbroadcastingo ton haW been encouraged to seek a plaoe ol your own in the\nreoessea of upstairs television-. There are* I'll grant you, some further\nactions we might take that* X venture to say, might not be entirely displeas¬\ning to some of you0 But for the most pert I think you’ll agree that in recent\nyears your demands have been largely met, V»here they are still pending*\nothers are in the same boat* In this respect* at least* you haven’t been\ndiscriminated against0"
}