{
  "id": "d1801-26",
  "text": "-5-\nA\nWHAT EDUCATORS SHOULD DO\nIn brief, I think you mow have the ball* It ia up to you to call the\nrunning playa, Within your own bailiwicks you have done exemplary jobs*\nYou have demonstratod clearly the vital Toros radio as an instrument for\neducation ors.\"piay~ in a nation that cries for education and unbiased in-\nformation. But I wond©7\"wh©tfeer you have sufficiently paraded your ex¬\namples of what can be dona with this instrument before the great majority\nof schools and universities that appear blind to its potentialities*\nI also wonder whether you have fully explored. Congressional avenues to\ndetermine what help,- if any, can be there given the development of edu¬\ncational broadcasting, The Congress has from time to times by its notions\nexpressed great interest not only in education but in educational broad¬\ncasting as wello la fact, its concern was such that it wrote into the\nCommunications Act of 1934 as amended a provision instructing the Commis¬\nsion to \"study the proposal that Congress by statute allocate fixed per-\noentages of radio broadcasting facilities to particular types or kinds of\nnon-profit radio programs or to persons identified with partioular types\nor kinds of non-profit activities.0 I refer to this provision not to re¬\ncall to you the* to my mind* not altogether happy results of the Commis¬\nsion’ o study under this mandat®., but to stress again Congress’s concern\nwith your problems 0\nWHERE EDUCATORS FAIL\nI wonder further how much attention you have paid to such bodies as the\nPresident’s Commission on Higher Education. I believe I am correct in\nstating that certain members of this Commission are also presidents of\nuniversities represented in your membership* It is unfortunate that a\nrecent report of this Commission, strikingly setting forth the alarming\nand growing educational bottlenecks in oar country, as well as the shock¬\ning number of our oitisens to wnom adequate educational facilities are not\nyet available* made only passing reference to the use of radio in educations\nIn conclusion, I wish to assure you that the Commission will oont5.au© to try\nto assist you in both small and large ways. We etand ready with engineering\nand legal personnel to help any legitimate educational organisation, not only\nin acquainting them with our requirements and procedures but in helping them\nwith the necessarily detailed job of preparing their applications0 I hop©\nyou in turn will frequently call upon us, the staff as wo11 as the Commission,\nand to keep us informed of what you are doing. I look forward to the day when\na representative of the HAEB can be reached as easily an Washington as a rep-\nresoatative of the HAB*"
}