{
  "id": "d1801-3",
  "text": "Saylor advertising agency, as a memorial to Myron\nA. Mahler, a pioneering figure in advertising.\n► WVSH, the School City of Huntington [Indiana]\nstation, reports that 60 per cent of the total teaching\nstaff utilized some of the radio series during the\nfirst half of the first semester this fall.\n► The Albuquerque public schools bulletin reports\nthat KANW (FM) is producing education via radio\nat a bargain rate. The story states that, compared\nwith eleven other public - school - owned stations\nthroughout the nation, KANW’s per-pupil cost each\nyear was less than half that of the average (44 cents\nas against 96 cents).\nPROGRAMS\n► English professors at Auburn University (Ala¬\nbama) are crediting an ETV program as one of the\nfactors accounting for a decrease in the number of\nentering freshmen who had to enroll in remedial\nEnglish this fall. When the program “Two R” went\non the air last year, English-weak high school seniors\nwere encouraged to enroll.\n► WWWS-FM, East Carolina College, and com¬\nmercial WGTC-AM, Greenville, cooperated to present\na stereophonic broadcast of an Atlanta Symphony\nOrchestra, concert recently. This was a new venture\nin radio programing in eastern North Carolina.\n^ Indiana University’s WFIU (FM) this year will\ncarry the Metropolitan Opera broadcasts live. It will\nbe the only Hoosier station to do so. For the past\ntwo.:seasons, WFIU has carried broadcasts of the\nperformances via tape. (See story in November-De-\ncember NAEB Journal.)\n^ : WEDU, Tampa, is presenting “Career Opportuni¬\nties,” a half-hour panel show during which two stu¬\ndents have a chance to quiz two outstanding business¬\nmen about their profession.\n^ WTTW, Chicago, is presenting a series of pro¬\ngrams designed to answer viewers’ questions regard¬\ning TV commercials — how many people and how\nmany hours, it takes to prepare a 60-second commer¬\ncial, etc. The programs are prepared by the Chicago\nchapter of the . Academy of Television Arts and\nSciences.\ny KQED, San Francisco, has launched a live weekly\nseries of scientific news. New experiments and scien¬\ntific;'concepts from archaeology to physics will be\nunveiled;.. Models and illustrative materials will be\nused on ■ the programs.\nPERSONNEL\n► -Burton Paulu, director of radio and TV broad¬\ncasting at the University of Minnesota, will teach an\nETV workshop during the summer session at Los\nAngeles State College.\n► Kent State University announces two new ap¬\npointments : Dr. Philip A. Macomber, formerly of\nWOSU-TY at Ohio State University, has joined the\nstaff as assistant professor of speech. He will be in\ncharge of CCTV development. Barton R. Derby has\nbeen appointed chief engineer.\n^ Dr. Kenneth Harwood, professor of telecommuni¬\ncations at the University of Southern California, has\nbeen elected president of the Southern California\nConference of the American Association of Univer¬\nsity Professors.\nHere and There\nThe Washingon County [Maryland] Board of Edu¬\ncation is polling teachers and parents on whether or\nnot they want the Hagerstown CCTV system to con¬\ntinue on a tax-financed basis after the Ford Founda¬\ntion grants run out.\n• Los Angeles State College has established a new\nbroadcast service center to act as coordinating and\nproduction agency for all the school’s radio and TV\nactivities. James Loper, formerly assistant director\nof the radio-TV bureau at Arizona State University,\nwill direct the new unit.\n• Edward Stasheff, professor of speech at the Uni¬\nversity of Michigan, told a meeting of the Catholic\nEducation Association recently that today’s instruc¬\ntional TV is more in danger from its friends than\nfrom its opponents. He said that instructional TV has\nbecome so attractive that many schools are rushing\ninto it without understanding it or without adequately\npreparing for its use.\n• WHYY, Philadelphia, has received an assist from\nthe Philadelphia Home and School Council. WHYY\nis seeking Channel 12, Wilmington, and the council\nhas raised funds so the station can present a good\ncase before the FCC January 10.\n• A series of thirteen half-hour programs drama¬\ntizing college teachers is being produced by the ABC\nin cooperation with the National Education Associa¬\ntion. Entitled “Meet the Professor,” the programs\nwill be broadcast on Sunday afternoons.\n• Educational KCSD-TV, Kansas City, is aiming\nfor a January 15 target date.\nPublications\nThe U. S. Office of Education has recently issued\nan annotated bibliography on radio and television\nbooks, periodicals, scripts, and plays. Copies are 25\ncents each, from the Superintendent of Documents,\nWashington 25, D. C.\n• The Television Information Office, 666 Fifth\nAvenue, New York 19, has issued a book to assist\nTV stations in planning and producing local public\naffairs programs. The book, Interaction, describes\nmore than a thousand programs broadcast by 264\nTV stations. $3.00 per copy.\n• Available free of charge from Adler Electronics,\nInc., One LeFevre Lane, New Rochelle, New York,\nis a twenty-page study describing the translator sys¬\ntem set up by Adler to rebroadcast programs of\nWUNC-TV throughout western North Carolina.\n-4\nNEWSLETTER"
}