{
  "id": "d1801-8",
  "text": "-.9:-\nCOLLEGE OF PACIFIC’S KCVN MARKS YEAR OF PROGRESS-FIRST ANNIVERSARY\nFrom a small room in the Conservatory for a classroom and studio, to a >100,000\nFM station--that1s the history of KCVN, the College of the Pacific station in\nStockton, California. KCVN recently celebrated its first anniversary with the\ncompletion of \"Studio A” in the campus radio building. The poly-cylindrical studio\nrepresents the latest in design for accoustical control.\nSpecial tribute was paid to the man largely responsible for the high standing\nof KCVN, Radio Director John C. Crabbo. Before the war Crabbe organized tho\nfirst major curriculum in radio broadcasting in the Nest at the College of the\nPacific. During the war, while serving in the Navy, he dreamed and planned\nPacific1s own broadcasting station. Now the station is complete, and more than\n170 students are enrolled in the various radio classes. The station is the most\nmodern and complete broadcast plant in the Stockton area, and the best; at any\neducational institution in the Nest, in Crabbe’s opinion.\nThe station, operating at 91.3 megacycles on the FM band with an effective power\nof 3400 watts, was the second in California to bo licensed to a college for non¬\ncommercial broadcasting. KCVN, on the air daily from 6 to 10 p,m., has a unique\nmobile unit to make possible recording or short-wave broadcasting of programs\nat great distances. Listeners hear programs from Lake Tahoe Philosophy Institute\nand the Pacific Marino Station at Dillon Beach, site of Pacific’s Marine Biology\nStation.\nAssisting Mr. Crabbe at KCVN arc Assistant Director William H. Ramsey, Chief\nEngineer Lee Berryhill, Program Manager Helen Cummings and Technicians James\nJolly and Robert Holmes, Beyond this tho station is student-manned. Over 60%\nof KCVN’s programs are live, student-produced shows. Many are carried by other\nstations in the San Joaquin Valley.\nALABAMA UNIVERSITY TO GET FM\nAfter hurdling many obstacles, WU0A, the University of Alabama station will\ngo ahead with FM. A 250 watt Collins transmitter with a Collins two-bay\nantenna array at 150 feet will bo used. Graydon Ausmus, director of the\nNAEE station and of Region II, hopes that the station will officially open\nMarch 1.\nA FOOTBALL GAME INSTIGATED the most thoroughly state-wide broadcast over to\noriginate in Alabama. The pep rallies on both tho University of Alabama and\nAlabama Polytechnic Institute were recorded preparatory to the A.P.I.- Alabama\nfootball game December 4« The program was fed by telephone to three high\npowered FM stations. Two additional FM stations picked up the signal and all\nfive FM: stations and AM stations, plus other FM stations, re broadcast the\nsignal.\nHOPING TO FORM A RADIO LISTENERS’ COUNCIL within the framework of tho Ameri¬\ncan Federation of Women’s Clubs, Ausmus and Leo Martin, also from University of\nAlabama, conducted a conference on radio for the Federation, Subjects included\nEducational Radio, Out-Of-School Listening for Children,and Radio Listeners’\nCouncils."
}