{
  "id": "d1801-9",
  "text": "-10-\nFOUR UNIONS IN THE ENTERTAINMENT FIELD IEB.GR TO ORGANIZE TV WORKERS\nFour unions made a merger agreement in Hollywood December 14 to control the tele¬\nvision jurisdictions of all Unions taking part. The four are: Actors Equity,\nthe American Federation of Radio Artists, the American Guild of Musical Artists\nand Chorus Equity. The merger must be approved by governing boards and member¬\nships of the groups as well as by A.F. of L. International and the Associated\nActors and Artists of America before itls final0\nACADEI IC CREDIT OFFERED ON RUGS UNIVERSITY OF THE AIR\nStudents can listen to the FM radio on the University of Tulsa, Tulsa, Oklahoma\ncampus and get 10 academic hours credit through the KWGS University of the Air,\nClasses in Music Appreciation, General Appreciation, Literature and Criminology\nare provided.\nRECORDING BAN ENDS\nMembers of James C. Petrillo’s American Federation of Musicians ended their nearly\na year long recording ban December 14. Recording sessions began shortly after a\nnew 5-year contract was signed between the union and the phonograph record companies.\nThe agreement was reached in October, but was waiting for a government OK on the\nlegality of a union welfare fund financed by record royalties. The 2 million\ndollar trust, to be administered by Trustee Samuel R. Rosenbaum, was pronounced\nlegal under the Taft-Hartley Act by Attorney General Tom Clark and Solicitor\nWilliam Tyson of the Department of Labor. The fund will be used to hire jobless\nmusicians to give free public concerts and other Union welfare purposes.\nTWO OF THE FOUR RECORD COMPANIES, RCA Victor and Columbia had artists lined up\nto start recording the moment the contract was signed. Capitol also planned a\nquick start, while officials of Dbcca said they were in no rush. Industry officials\nhope the end of the ban will help bring the record business out of a 35% slump\nsince last year.\nUNIVERSITY OF MICHIGAN INCREASES FM AUDIENCE\nBesides upping their 3 KW transmitter to 10 KW, the University of Michigan\nis increasing their audience in a systematic promotion scheme. Under the\ndirection of Waldo Abbot, a monthly bulletin is sent to every known FM\nowner in the primary listening' area. Stacks of the bulletins are placed in\nevery radio sales room. University Alumni Clubs get copies. The student.-\noperated wired radio system carries the WUOM. music to the University dormi¬\ntories. Local restaurants carry WUOM music programs during the dinner hour,\nand are also given cards announcing that the music comes to them from WUOM.\nCommercial stations carry the live music programs with a WUOM station announce¬\nment. Another idea came from a doctor who was so impressed by the December\nmusical programs that he purchased two FM receivers—one for his waiting room\nand one for the ward in his private hospital. The schedule is now mailed\nto all known doctors in the area."
}