{
  "id": "d132-100",
  "text": "10\nNEW PUBLICATIONS\nRecent Soviet Psychology\nEDITED WITH AN INTRODUCTION BY N. O’CONNOR, M.A. Ph.D.\nSocial Psychiatry Research Unit, Institute of Psychiatry,\nThe Maudsley Hospital, London.\nThe method of presentation and treatment is novel and makes available in\nEnglish the work of Anokhin at the Sechenov Laboratory, the Uznadze school\nfrom Georgia and Sokolov’s work from Moscow which has not been known to a\nwide English audience in the past. $8.50\nHow To Be A Hermit\nA Bachelor Keeps House\nBY WILL CUPPY\nIncluded are hints, advice and sometimes startling news about the psychology\nof the tin can, lumps in the pancakes, the perils of working, the prune, the kitchen\nbeautiful and how to get rid of visitors. $3.95\nAlso Available: How To Tell Your Friends From The Apes $3.50\nThe Way Our People Lived\nThe Early Life and Customs of the American People\nBY WILLIAM E. WOODWARD\nA fascinating book about the manners and customs of average Americans over\nthree centuries; the author paints in the authentic background of the country—\nthe habits and the foibles of the everyday men and women who helped to found and\nbuild our nation. In each of the eleven chapters there is a different set of people.\nThe action takes place in different parts of the country and at various times during\nthe past three centuries. A human, vivid, lively book—a Book Club Selection.\nBLACK & GOLD EDITION Fully Illust’d—525 Pages $4.50\nWedlock BY JACOB WASSERMANN\nAuthor of: The World’s Illusion, The Maurizius Case, etc.\nUnmatched philosophy and psychology—the deepest thoughts, emotions,\nand self-justification of the principal characters reveal every hope and innermost\nfeelings of women and marriage, resulting in the best understanding of women\nby their male counterparts. 344 Pages $4.50\nAlso Available: THE MAURIZIUS CASE 546 Pages $5.00\n“The Anatomy of a Prosecutor”\nBULA MATARI: The Life of Stanley $4.50\nProphecies on World Events by Nostradamus\nTranslated and Interpreted by Stewart Robb\nA COMPACT and valuable commentary on one of the most intriguing charac¬\nters of France, fortelling with amazing accuracy events far ahead of his own era.\nPaper Edition—Illust’d 145 Pages $1.95\nAlso Available: Nostradamus on Napoleon 145 Pages $1.95"
}