{
  "id": "d132-125",
  "text": "October 31, 1963\nMr. Dean Gregory\nApartment SH\nInternational House\n500 Riverside Drive\nRev York 2?, New York\nDear Dean:\nAs you know. Bob Goodell and I have been reviewing our progress with\nthe Voice of America project and have been making plana for the work\nthat remains to be done.\nI am sure you know that we are considerably behind schedule on this\neffort, and although the original time schedule may not have been\nfully realistic, it was something in which we had general agreement.\nHow we have spent over twice the amount of time originally allocated\nfor the preparation of the intermediate level course and still have\nnot received the final product.\nIhis very serious time delay is accompanied by some financial problems\nwhich leave us with only a small amount of money to complete the work\ncm the basic course. Our discussions have led us to the following\nconclusions concerning the work that remains to be done in the inter¬\nmediate level course and the other aspects of our contract with the\nVoice of America.\nFirst, it will not be possible to provide any additional money to complete\nthe work that you are now doing on the intermediate level course. It is\nour feeling that in spite of the fact that this work has been distributed\nover a long period of time, the amount we have already paid to you and\nto other persons who have worked cm the preparation and evaluation can\nnot be supplemented.\nSecond, we are considering other possibilities for the work which needs\nto be done for the basic course, and have suggested to the English language\nServices organization, which may be handling this work, that you be\nconsidered as a consultant to them. Mr. Cornelius, President of E.L.S.,\nwould like to talk with you about this possibility and would like to\nhave an opportunity to consider with you the form that your continued\nparticipation might take. I think it is important that we have the\nbenefit of your experience with the intermediate course and arrange for\nan opportunity to relate this to the basic course. If you are interested\nin exploring this further, please let me know."
}