{
  "id": "d132-156",
  "text": "International House\n500 Riverside Drive\nNew York, N.Y., 10027\n28 July 1963\nMr. James A. Fellows, Asst. Dir.\nNational Association of Educational Broadcasters\n1346 Connecticut Avenue\nWashington, D.C., 20036\nDear Jim:\nI see that I made an error in my note to you a couple of\ndays ago. I mistook your new ZIP number for your communication\nnumber.\nI*m enclosing a few scripts, and 1*11 put another batch in\nthe mail tomorrow and so on after that as fast as they’re ready.\n(I see that'I’ve been writing so many contractions in the lessons\nthat they have gone to my head.) I’m trying to prepare mine in\nthe VOA format, more or less, but Margery, in her effort to revise\nas many scripts as possible before she leaves, is not concerning\nherself with such details. Probably Dr. Goodell can provide your\ntypist with a sample or two to guide her.\nWe have not yet settled on a title for the series. Ma#gerv\nhaw written in the title ’’Time and Tune in English Speech.” I\nthink that this might be a little obscure or misleading. An\nalternative that I have been thinking about is ’’English Speech:\nTones and Rhythms” or maybe simply ”English Tones and Rhythms”,\nbut I’m not satisfied with either of the*, either. I am\" just\nleaving the title spaces open in my scripts.\nDr. Goodell has asked for a vernacular introduction which\nincludes (a) the number of the lesson or broadcast being introduced,\n(b) the title and purpose of the whole seriev. (c) the objective\nof the particular lesson being introduced, (d) a resume of the\ndialog between Charles and Ann (or Tony and Carol, as we have\nrenamed then) in the lesson being introduced. I am trying to do\nthis, but this is another thing that Margery is apparently not\nfind ing time for. I can try to write them for her scripts when\nI have finished with mine, but I would rather not take time for\nit now.\nWe have not chosen a name for the teacher. Our thought is\nthat if Dr. Goodell is going to narrate the teacher’s part, it\nwould probably be well if he uses his own name. Similarly, if a\nknown linguist or teacher reads the part, he would probably want\nto use his own name.\nIn our hast* to get these scripts out, there are a number of\nthings which, I find, Margery and I seem to have overlooked\ndiscussing and hence handle differently in our lessons. For"
}