{
  "id": "d132-179",
  "text": "brief msmm of ubia quesiedwhaire oh\nRADIO I3IGLISH FAACKIHG\n(IMA CA-2201, Feb. 11, 1963)\nThe report which follow® include© six section®s (plus worksheet)\nI General Aummary (of UBIA Post responses)\nII Tabulation of Answers (for each question)\nHI Selected Consents and Suggestions\nIV Critique of the Questionnaire\nV Some Gu^plaaentary Suggestions\nVI Diet of Posts responding to Questionnaire\nVII Master Tabulation (worksheet)\nI. General Suanaay (of B st responses)\nAnalysis of 7T usable returns Indicates that a majority of UBIA posts would\nlike to have available a new, freshly conceived course for the teaching of English\nby radio. This course would best be aired by local stations in 15 sdnute segments\nthree to five days each week. Assuming the mm of the sponsoring organisation is\nomitted and there is no hard sell” propaganda, local station acceptance is at\nleast probable in a majority of countries represented.\nQuestionnaire responses indicate that saost of the posts would welcome a\ncourse on the elementary level and at least half would appreciate having some inter¬\nmediate material offered. A few, notably serving in countries where much • ngliSh\nteaching is dons by ther agencies, would be interested only in advanced material.\nProperly selected Americana would interest a majority of the listeners\nit is expected, would be mainly young people, 15-35, including high school and\ncollege students, some government workers and others having special business or\nprofessional needs for learning English.\nGenerally ©peaking, the posts do not want and, with a few exceptions, are not\nequipped to produce such programs locally.\nThe questionnaire response© appear to suggest that current and past efforts\nto teach English by radio have generally tact with lukewarm reception. Pfeifcap* this\nimpression reflects poor programing and/or a negative reaction to BBC course\nofferings.\nThe responses do not suggest that serious objections would be raised by the\nBritish, nor that such a course would interfere with other types of current UBIA\nactivities and, with one or two exceptions, the agency is applauded for its new\nprogram of English -by -radio."
}