{
  "id": "d132-185",
  "text": "Ill* (continued)\nfleameyi Powers that he in national radio will oppose material, regardless of any condi¬\ntions we may agree to*\nQuitos Should give information respansorship, etc.\nRangoont Local radio authorities will not accept IBS-prepared lessons.\nSan Salvador» Local stations interested only if commercial sponsor available,\nTegucigalpa* Should he allowed to find local sponsors to pay for the time.\nTehran; Avoid what local officials might term \"propaganda.\"\nTel Aviv: Time paid for by private foundation; ready-made lessons, no attribution.\nTokyot Heed to be given permission for local stations to sponsor these programs.\nTunist Avoid anti-communism and cold war issues.\nQ* 7 Would -post prefer to write ,.apd„produce,_i^s own. radio j;o^\nffTl'iabttB?' If iso':\"oes~o«t haTe available near,, or in prospect, the required raPEiS,\nand facilities%\n.Ankara* Using Turkish service IBS tapes now and will continue.\nAthens! Manpower available. Until IBS production can be reviewed, auditioned and revised,\nft is hard to determine,\nBangkok! Has facilities end probably could find people. Wants materials available at\nagency to see if Bangkok can produce its own show from them. Getting supplementary\nmaterials printed will be problem.\nBelgradei Interested in adaptation® in simplified American English of scenes from. American\nnovels, plays; typical scenes, i.e* air terminal, !,E# station, fcroadway, farm..\nBonn; Such courses neither necessary nor useful, plus no facilities or personnel*\nCairo! Can do it and is eager to do it. If Agency provides syllabus, post can and will\nprepare adaptations. Excellent facilities and people available.\nCaracas s Prefer to produce locally—under contract. Wants to submit estimate and have\n“local production funded by IBS.\nDamascus: Tries to maintain a balance. Ho German or Russian courses available, so\nwon * t accept English courses.\nBar cs Salaami Post does not have an English teaching specialist.\nDjakarta! Ho facilities or personnel, but happy to contribute whatever general assistance\nmight be required.\nFort-de-Franeei Has produced 30-lesson course (summer of *6l) with limited facilities.\nPrefers Agency-produced materials,"
}