{
  "id": "d132-186",
  "text": "ttu (continued)\ngtjatggala: Facilities and personnel available. Too such time to write and produce so\nlet Agency produce it* *\nKarachi! More emphasis on Urdu and Bengali* Limited BC time*\nPrefer course produced in Cairo. Egyptian, Arabic are suitable for Sudan.\n£a_Pas« Has written its own script, plus booklet for sale by radio station. Ho facilities\nor personnel—request agency support*\nMadrid! Interested only in professionally produced course® written and tested by successful\nclassroom teacher®* -— * ^\nrfexiC£: Can do it here if not too technical or academic a script, IBS furnishes good\ntape® with unaccented American English yoice and neutral Spanish.\n—k°C81 Nations producing their own script®. We may give scripts to network\nfor their use*\nO^adm^ous Propose® to produce its own, live, with on-the-spot adaptations*\nPhnosa Penh: Has people, but no time.\nJ£gEfa3MrP5fc<»8 Fost has already recorded a series, Ho need for another unless it takes\nup where Port-au-Prince1s series left off,\n'?'r-nts to wite and produce its own. course®. Mo personnel. No comment\non facilities*\nk3M2£B.* facilities, no personnel, but might be able to provide some local adaptation\nof basic scripts if needed*\nSl&Jft ^«ir series completed. No funds or people for further programs.\nTaioeis Prefers IBS production—good voice utilizing techniques of teaching is hard to\nfind. IBS production would have advantage® of continuity* However, if IBS series\ncannot be practically utilized, each post should be given opportunity to produce\nits own radio courses from syllabus.\nYncundi; bocal voices and noses preferred. Post now producing its own programs twice\nweekly. Excessive workload for sire of post. Therefore want prepared prograffi.\n8 ggjon consider predominantly American cultural material in the lessons would.\n11,.KWffMA. he Interesting; and meaningful to the listeners?\nAvoid too heavy an emphasis on American cultural material,\nAnkara; Do not have material carry too much freight.\njjaiSSSlgg* *es, but temper with familiar Latin American cultural pattern.\nBaghdad; Yea, but too heavy a hand on Americana will result in rejection for local\nbroadcast*"
}