{
  "id": "d132-188",
  "text": "Ill* (continued)\nRangoon: Americana would make programs less acceptable*\nFlo de Janeiro! Consider Brasil, too, tor maximum listener effect and to aid in placing\nprograms *\nSaigon: If carefully selected, it would be interesting and meaningful*\nSan Salvador: Yes, but do not exclude Latin American cultural pattern,\n'Taipei; Extreme care to \"carefully\" select Americana material*\nTegucigalpa: Americana must be highly artificial in introductory stages. Will be best\nin intermediate and advanced stages*\nTehran: Overt emphasis will make programs hard to place*\nTripoli! Ho*\nTunist Americana must be extremely basic. Have to establish terms of reference at start,\nUsumbuoa: Hof African cultural material wanted. Previous series of ICS material was\nAmerican and remote in interest,\nVienna: Yes, if not obviously propagandists or too self-congratulatory in tone and nature,\nVientiane; Predominantly Americana less than satisfactory. Use materials based on local\nsituations, geared to local speech customs,\n12* Comments and Suggestions!\nAmman: Wants all available data quickly* Jordanian station going on air 196k late, and\nwe want to mate® contacts for placement early,\nAscuncion: Print individual scripts and send to us. Advance announcement of start of\nseries and of availability of scripts would indicate size of audience, Repeat\nperiodically,\nBaghdadi Urge go-ahead. Par more merit in this program than some other current UOA\nactivities,\nBangkok: Materials accompanying lessons to be readily available to audience. Present\nprogram suffering—poor scripts and no materials available to audience,\nBeirut: Update UOA materials and BC them to us out of Rhodes, If UOA material compliments\nITV series, would be extremely helpful.\nBern: Went tapes and scripts of first several lessons, to \"sell17 SWiss radio.\nBogota: Let's see the BBC continue their good work on their own and our behalf.\nBonn: Courses would not be accepted, nor are they needed."
}