{
  "id": "d132-189",
  "text": "III. (continued)\nBrazzaville: Don’t want to antagonize British. BBC course only cultural, activity they\nhave in this country. Only approach C.A.E. authorities if agreement satisfactory\nto British is worked out,\nCairo? Long-felt need for new and better English material for the Arab world. We are\nready, willing and able to assist.\nCol who: Very few. announcers on UGA tapes are acceptable. The Ceylasese out-british\nthe British when speaking English.\nCopenhagenr Placement chances very unlikely. Glad to try again, thou#.\nPar es Salaami Ho priority can be given to English programs. Current news and feature\nmuch more important. Hew. national emphasis on Swahili mitigates against English.\nFort-de-France: Highly useful here. A \"painless\" way to learn English. Excellent method\nof talking about the U.S.\nGuatemala? Program by each Spanish-speaking post would be wasteful, except posts can\nproduce advanced program covering dialectical differences,\nHelsinki.? All programs turned down so far. Ho prejudice—just very close to the British\nway of doing things, by tradition.\nKabul; English is virtually a second language in national school system*\nKarachii Local - or UGA productions would not be productive.\nKhartoum; Thoughtful, well-done programs with accompanying pamphlets can do much good*\nCaution on Arabic voicing; use Sudanese or Egyptian Arabic only*\nLa Pag: Please inform us as soon as possible concerning possibility of having programs\ntaped by Agency in Washington*\nLeopoldville: Simple lessons explained in almost basic French. Hot too much material per\nlesson. Musical (current American hits) introduction end elose (30 sec.).\nLibreville ? Must convince British that our objectives are same. Must increase overall\nnumber of English teaching air hours per week*\nLome: Careful planning with Ministry of Information and Radio Lome, after consultation\nwith British Embassy. Have to convince radio station that IBS courses attract more\nlisteners than BBC.\nMadrid: English the first foreign language of Spain. Many opportunities for teaching\nEnglish in Spain. Anything we could supply in quantity would be well received.\nLanguage regularly taught by radio to secondary school students.\nMexico; Demand for English entirely unanswered in smaller cities and villages, heed\npackage programs without any local-station adaptation.\nMexico City: Good clear American English pronunciation, with neutral Spanish (no river\nPlate or Cuban accent) if tapes are made for Latin America,"
}