{
  "id": "d132-190",
  "text": "Ill* {continued)\n!l2£Sw: ^assy wants & sample series after it has been prepared.\nHeamgjrt Remember need to propagate national language, French. Only 10? of population\nspeak it. 3><m*t interfere with need to propagate French.\npanama: Eants elementary and intermediate lessons for David and Santiago. BBC in\nPanama City would, he interested in use of proposed pronunciation and intonation\nand rhythm tapes for use in language laboratory and doss idle transmission in\nPanama City.\nParis: Students will listen to BBC as adapted to French audiences.\n^nknovn: Of very little interest in the posts program for time being.\n£uitc: Leaflets and pamphlets for free distribution to radio listeners who ask for them.\nSuggest producers sample the \"Frank and Maria\" programs of XBS/RL and\nconsider use of booklets such as used in this series. Link up with \"Lets Learn\nEnglish ITV program would add chances of success.\nSaigon: Avoid use of topical or political material. Don't speak too fasti use clear\nsimple language. *\nAppreciate value of such programing, but feels it is not best designed for\nradio and cannot give it high priority now.\n§S93ASS?; Use coordinated material supplements. Integrate course into programs in\nbi-national centers. Offer certificate on successful completion of course*\nStockholm: Want advance scripts and tapes to \"sell\" Radio Sweden, If program goes UOA.\nwant advance publicity materials, \" 9\nTaloei_s Series to arrive at posts as a package program, or funds to be allotted for\ncontract production. Present correct vowel sounds and consonants and combinations.\nLehran: English is “lingua Franca\" of area. Radio potent instrument, English la required\ncourse in schools. Well-prepared series welcomed by educators, broadcasters and\nstudents. Will use tapes also in classrooms.\nTripoli: Post believes the UOA instruction would be valuable.\nTunis: Local stations not wildly enthusiastic, but receptive.\nliSHSfeg^8 French-Snglish; cheap attractive printed test; deal with things and situations\nfamiliar to Africans. SHOULD NOT BE DULL!\n^ienrta: Avoid anything but long-range, low-key propaganda overtones.\nWarsaw: Sees neither need nor opening for such programs in next few years. Immediate\nvalue of lessons on UOA, especially advanced and literary categories.\nYaounde: Development of material to be used at home to follow Radio English courses is\nimportant and should be designed to follow the air classes as closely as possible.\nArrange so that students must apply regularly (monthly) for upcoming material."
}