{
  "id": "d132-200",
  "text": "She lived her entire life as a recluse, remaining quite willingly in her\nfather’s house until her death. Same biographers have suggested that an early\ndisappointment in love caused Sally Dickinson to withdraw from life, hut her\nactual motives remain a mystery* Because she had few contacts outside her\niasafidiate family, her work has been the major basis for critical theories concerning\nher personal life*\nMost of her poetry reflects the withdrawn, contemplative, almost passionless\nself-sufficiency of an intelligent woman. However, in the poem \"I Sever Hear\nthe Word ‘Escape”*, another aspect of her nature is suggested*\nSally Dickinson demonstrates great poetic skill—parti culary in the choise\nof simple yet evocative language. Her poems—biref and deceptively simple as\nthey appear—are powerful works of art.\nIV. VOCABULARY NOTES\ngWTT.IKT\nchildish2\nBy position, this word seems to be an adverb; we would therefore expect\nthe adverbial form childishly. However, the word performs an adjectival\nfunction by describing the speaker, ±x? i*e., \"I tug childish”* Compare\nchildish (ineffective, iRiaature) with childlike (simple, innocent, canddd).\nExamples: ”His behavior was childish. (emotional, irrational), lie\nspoke with childlike candor.\" (Forthright, open-hearted, innocent.)\nflying attitudes\nFly is frequently used to mean \"run from danger or eonfinement.\" Compare\nflee. In the poem, the phrase expresses the urge to escape, and suggests\nalso the posture of actual flight.\nquicken blood:\nThe original meaning of quick was \"alive”; it is still used occasionally\nin this sense. She noun form is used in a common idiomatic phrase, cut\nto the quick\" meaning \"reach a living or sensitive spot”. Examplesi He\ncut his fingernail to the quick (felt some pain). She was cut to the\nquick by hi© impolite manner (emotionally hurt, deeply disappointed.)\nSUGGESTIONS FOR FURTHER STUDY\n(l) SELSCnOHS FROM TSE POETS WORK\nBolts of Melody. Mable Loomis Todd and MUUcenfc Todd Bingham, editors.\nNew York and London: Harper, 19^5.\nSelected Poems of finlly Dickinson.\nHelnemann, 1959*\nEdited by James Reeves* Londons"
}