{
  "id": "d132-206",
  "text": "III. ABOUT THE POET\nGeorge Gordon. lord Byron Bom 1788\nDied 1824\nAmong the English poets of the nineteenth century. Lord Byron ranks vlth\nPercy Bysshe Shelley and John Keats as the finest of the Romantic period of\nEnglish literature. Romanticism, a period of flowering in all the art® of\nEurope, was characterized by an emphasis upon imagination, sentiment, and\nindividualism. Romantic peats were highly conscious of the separation between\nthe ideal and the real.\nIn his own life, Byron embodied much of the spirit of the Romantics. Bom\ninto a titled family, he was given a gentleman’s education. Even in his student\nyears, he began his life-long revolt against what he felt were the artificialities\nof society. He left Trinity College, Cambridge, to travel for two years, roving\nthrough Southern Europe as far as the eastern Mediterranean. His early published\nwork, \"Childe Harold, * showed the degree to which Byron had been inspired by\nhis traveling. He was a popular poet very early in his writing career, admired\nfor the vitality and artistic skill evident in his work*\nHis early marriage lasted only a year, ending in divorce. For this Byron\nwas so severely criticized that he was forced to leave England. Aimless\nwandering and a series of tempestrous love affairs added to his naturally\nrebellious nature, so evident in his poetry* Those years, although Bryon was\nnotorious for his revolt against the social standards of his time, he was\nnevertheless recognized as a poet of genius by many of his contempoiaties.\nIn 1823, Lord Byron, having become passionately interested in the Greek\nrevolutionary movements of the period, sailed to Greece to putad himself at the\nhead of the republican forces. Six months later, at the age of thirty-six,\nrespected by his comrades and honored by them as a hero, he died not on the\nbattlefield, but from fever.\nIV. VOCABULARY UOTES\nbreasts\nThe portion of the human body where the heart is located. In Western art\nand literature, the heart and the breast represent the source of the human\nemotions (love, hate, passion, sorrow, etc.}. Byron has used this symbolism\nand contrasts breast (the purely human, emotional and even physical\nqualities of the lover) with the soul (the spiritual enduring, eternal\nquality).\noutwears:\n2he prefix out is attached to some verbs in English to mean \"better than”,\n\"greater than”, \"more than.” Examplesi Outgrow, outlast, outlive, out-\nnumber, outplay, eut-talk. Out is pronounced with very little stress in\nthis position."
}