{
  "id": "d132-213",
  "text": "2\nXXX. ABOUT TBE POET\nBichard Eberhart Bora 1904\nRichard Eberhart has had a varied career; he has been a teacher, the\npresident of a large corporation, tutor of a Siamese prince and a military\nofficer in World V&r II. At present, he teaches poetry at Dartmouth College.\nIn his poetry, Eberhart writes most often on themes of death and childhood.\nDeath, particularly, seems to have special—almost mystical-attraction for\nhim. Many of his poems concern the relationship between appearance and reality\n(in this respect, his work can be compared with that of Edward Arlington\nRobinson)*\nla 1959, Eberhart was appointed by President Eisenhower to the Advisory\nCommittee on the Arts for the National Culture Center in Washington, D.C*, and\nthree years later, the poet was co-winner of the Bollingen Prise in poetry.\nCritics recognize Richard Eberhart as one of the most technically skilled of\nliving American poets. Hie poetic vocabulary is rich in connotative meanings\nand his evocative Imagery has often been compared with the best work of Qnily\nDickinson, another American poet represented in this series*\nIV. VOCABULARY NOTES\nguts; putrid:\nThese words are naturalistic and rather crude words in English; we\nwould hesitate to use them in ordinary speech. Synonyms for these terms\nare entrails (guts) decaying (putrid) have the same denotations, but are\nmore acceptable in general usage.\ndeep:\nWe frequently describe the ocean, a lake, a well, or even a field of tall\ngrass as deep. In a related sense, deep can describe emotions or states\nof mind: deep sleep, deep gratitude, deep sorrow, deep concentration.\nDeep in these phrases suggests an extraordinary degree of feeling.\nplaint:\nPlaint (a melancholy cry) is related to complaint (n.s.) and plaintive\n(adj*). Plaint is often used in poetic context, less frequently in\ngeneral usage.\nSUGGESTIONS FOR FURTHER STUDY\n(1) A SELECTION FROM THE POET’S WORK\nCollected Poems. 1930*1960. Richard Eberhart. Oxford: Oxford University\nFrees, XncV,' 1986*\nGreat Praises, Richard Eberhart. Oxford: Oxford university Press, Inc., 1957*"
}