{
  "id": "d132-237",
  "text": "XU. ABOUT THE POET\nAlfred, Lord Tennyson Bom\nmed\nAlfred, Lard Tennyson began to write peotry at an early age; while he was\nstill a student he had several poems published* His early poetry was generally\nwell received, but scathing criticism of a later volume of his work deeply\ndepressed him, and he refused to publish anything for a period of nine years\nthereafter# His real popularity began with the publication of Idylls of the\nKing in 1859*\nBecause of family responsibilities, he did not marry until late in his\nlife--when he was forty-one. He continued to be a popular poet throu^iout his\nlong life; he was named Poet laureate of England, and was honored with the\nrank of peer.\nTennyson wrote various kinds of poetry and many verse dramas. His early\nwork expressed a worship of beauty) his later work reflected a modified\nRomanticism and a tendency to treat serious problems of society. Most critics\nfeel his most successful work to be his lyric poetry. He has been called\n“England** Virgil.”\nIV. VOCABULARY ROTES\nazures\nThis word designates a particularly clear blue color and in addition, has\nmany connotations which blue does not have. Historically, the word was originally\na Persian word and is related to the tern lapiz lazuli (n.s.), (a deep blue stone\nused chiefly for ornamental purposes). Azure is a more poetic, literary term\nthan other words designating shades of blue, and most frequently refers to the\ncolor of the cloudless sky. The noun form is the same.\nthunderbolt I\nClassical legends ascribe the coincidence of thunder and lightning to the\nanger of deities who punished men by hurling thunderbolts toward the earth*\nBy extending the meaning, thunderbolt may refer to any sudden, severe,\ndestructive, or startling happening. Example: ”The loss of all his\npossessions in the flood struck him like a thunderbolt.\" Thunderstruck\nis a related word, meaning confounded or astounded. Example: was\nthunderstruck by the news of the accident .ir Bolt (n.s*). my refer to a\nsudden shaft of lightning, and by extension to any swift motion (the horse\nbolted at the sight of a snake)."
}