{
  "id": "d132-28",
  "text": "IA—355 (Rev)\n10-20-62\nU. S. INFORMATION AGENCY\nGENERAL PROVISIONS\n(Service Contract)\n1. DEFINITIONS - As used throughout this contract, the following terms shall have the meanings set forth below:\n(a) The term \"Government\" means the TJ. S. Government, and shall be deemed to include any department or organizational\ncomponent thereof, including the Agency. .\n‘(b) The term \"Agency\" means the U. S. Information Agency, acting through any of its duly authorized officials.\n(c) The term \"Director\" means the head or any assistant head of the Agency; and the term \"his duly authorized repre¬\nsentative\" means any person or persons or board (other than the Contracting Officer) authorized to act for the Director,\n(d) The term \"Contracting Officer\" means the Agency official who executes this contract, his duly designated succes¬\nsor, and to other Contracting Officers of the Agency who have been formally designated and given such authority. Only\na Contracting Officer may execute a contract amendment, or may authorize such changes in scope of contract operations as\nwould necessitate a change in contract price or other formal modification by contract amendment.\n(e) The term \"Authorized Representative of the Contracting Officer\" (abbreviated as \"AR/CO\") means an official of\nthe Agency, or his designee, authorized by the Contracting Officer to act for him respecting any matter or phase of opera-\ntions^under the contract. Such authorization shall be effected by a contract provision or by a separate written notifi¬\ncation to the Contractor; the scope and limitations of the delegated authority shall be stated therein. Each authoriza¬\ntion of an AR/CO or redelegation to a Project Manager or other special officer of the Agency shall embrace activities\nunder a single contract only.\n(f) The term \"subcontracts\", except as otherwise provided in this contract, includes purchase orders under this\ncontract.\n2. GOVERNMENT SAVED HARMLESS - The Contractor shall hold and save the Government, its officers, agents and employees,\nharmless from liability of any nature or kind, including costs and expenses, for or on account of any or all suits for\ndamages of any character whatsoever resulting from injuries or damages sustained by any person or persons or property by\nvirtue of performance of this contract.\n3. ASSIGNMENT OF CLAIMS - (a) Pursuant to the provisions of the Assignment of Claims Act of 1940, as amended (31 U.S.\nCode 203, 41 U.S. Code 15), if this contract provides for payments aggregating $1,000 or more, claims for monies due or\nto become due the Contractor from the Government under this contract may be assigned to a bank, trust company, or other\nfinancing institution, including any Federal lending agency, and may thereafter be further assigned and reassigned to any\nsuch institution. Any such assignment or reassignment shall cover all amounts payable under this contract and not already\npaid, and shall not be made to more than one party, except that any such assignment or reassignment may be made to one\nparty as agent or trustee for two or more parties participating in such financing.\n(b) In no event shall copies of this contract or of any plans, specifications, or other similar documents relating to\nwork under this contract, if marked \"Top Secret,\" \"Secret,\" or \"Confidential,\" be furnished to any assignee of any claim\narising under this contract or to any other person not entitled to receive the same. However, a copy of any part or all\nof this contract so marked may be furnished, or any information contained therein may be disclosed, to such assignee upon\nthe prior written authorization of the Contracting Officer.\n4. COMPLIANCE WITH LAWS - The Contractor shall comply with all applicable laws and all rules and regulations having the\nforce of law which deal with or relate to performance hereunder, or the employment by the Contractor of the employees\nnecessary for such performance.\n5# TERMINATION FOR CONVENIENCE OF GOVERNMENT - The Government shall have the right to terminate this contract or cancel\nany order placed pursuant thereto, as to all or part thereof, at any time upon 10 days' prior written notice of intent to\nthe Contractor. In which event if the parties mutually agree to an equitable adjustment of the contract payment provi¬\nsions, they will amend the contract in writing accordingly. Such termination or cancellation shall be without prejudice\nto any claim or right either party may have against the other. Any disagreement as to termination costs or other claim\nor right shall be determined pursuant to the provisions of the \"Disputes\" clause hereof.\n6. NONDISCRIMINATION IN EMPLOYMENT - (The following clause is applicable unless this contract is exempt under the rules\nand regulations of the President's Committee on Equal Employment Opportunity issued pursuant to Executive Order No. 10925\nof March 6, 1961 (26 FR 1977).)\nIn connection with the performance of work under this contract, the Contractor agrees as follows:\n(a) The Contractor will not discriminate against any employee or applicant for employment because of race, creed, color,\nor national origin. The Contractor will take affirmative action to ensure that applicants are employed, and that employees\nare treated during employment, without regard to their race, creed, color, or national origin. Such action shall include\nbut not be limited to, the following: employment, upgrading, demotion or transfer; recruitment or recruitment advertising;\nlayoff or termination; rates of pay or other forms of compensation; and selection for training, including apprenticeship.\nThe Contractor agrees to post in conspicious places, available to employees and applicants for employment, notices to be\nprovided by the Contracting Officer setting forth the provisions of this Nondiscrimination clause.\n(b) The Contractor will, in all solicitations or advertisements for employees placed by or on behalf of the Contractor,\nstate that all qualified applicants will receive consideration for employment without regard to race, creed, color, or\n\"c)1C*The Contractor will send to each labor union or representative of workers with which he has a collective-bargaining\nagreement or other contract or understanding, a notice, to be provided by the Agency Contracting Officer, advising the\nsaid labor union or workers' representative of the Contractor's commitments under this Nondiscrimination clause, and shall\npost copies of the notice in conspicuous places available to employees and applicants for employment.\n(d) The Contractor will comply with all provisions of Executive Order No. 10925 of March 6, 1961, and of the rules,\nregulations, and relevant orders of the President's Committee on Equal Employment Opportunity created thereby.\n(e) The Contractor will furnish all information and reports required by Executive Order No. 10925 of March 6, 1961, and\nby the rules, regulations, and orders of the said Committee, or pursuant thereto, and will permit access to his books,\nrecords, and accounts by the contracting agency and the Committee for purposes of investigation to ascertain compliance\nwith such rules, regulations, and orders."
}