{
  "id": "d132-29",
  "text": "- 2 -\n(f) In the event of the Contractor's noncompliance with the Nondiscrimination clause of this contract or with any of the\nsaid rules, regulations, or orders, this contract may be canceled in whole or in part and the Contractor may be declared\nineligible for further Government contracts in accordance with procedures authorized in Executive Order No. 10925 of\nMarch 6, 1961, and such other sanctions may be imposed and remedies invoked as provided in the said Executive order or\nby rule, regulation, or order of the President's Committee on Equal Employment Opportunity, or as otherwise provided by\nlaw.\n(g) The Contractor will include the provisions of the foregoing paragraphs (a) through (f) in every subcontract or\npurchase order unless exempted by rules, regulations, or orders of the President's Committee on Equal Employment Oppor¬\ntunity issued pursuant to section 303 of Executive Order No. 10925 of March 6, 1961, so that such provisions will be\nbinding upon each subcontractor or vendor. The Contractor will take such action with respect to any subcontract or\npurchase order as the contracting agency may direct as a means of enforcing such provisions, including sanctions for non-\ncompliance: Provided, however, that in the event the Contractor becomes involved in, or is threatened with, litigation\nwith a subcontractor or vendor as a result of such direction by the contracting agency, the Contractor may request the\nUnited States to enter into such litigation to protect the interests of the United States.\n7. EXAMINATION OF RECORDS - (The following clause is applicable if the amount of this contract exceeds $2,500)\n(a) The Contractor agrees that the Agency and the Comptroller General of the United States or any of their duly author¬\nized representatives shall, until the expiration of three years after final payment under this contract, have access to\nand the right to examine any directly pertinent books, documents, papers, and records of the Contractor involving trans¬\nactions related to this contract.\n(b) The Contractor further agrees to include in all his subcontracts hereunder a provision to the effect that the subcon¬\ntractor agrees that the Agency and the Comptroller General of the United States or any of their duly authorized represent¬\natives shall, until the expiration of three years after final payment under the subcontract, have access to and the right\nto examine any directly pertinent books, documents, papers, and records of such subcontractor, involving transactions\nrelated to the subcontract. The term \"subcontract\" as used in this clause excludes (i) purchase orders not exceeding\n$2,500 and (ii) subcontracts or purchase orders for public utility services at rates established for uniform applicability\nto the general public.\n8. DEFAULT - (a) The Government may, subject to the provisions of paragraph (c) below, by written notice of default to\nthe Contractor, terminate the whole or any part of this contract in any one of the following circumstances:\n(i) if the Contractor fails to make delivery of the supplies or to perform the services within the time specified\nherein or any extension thereof; or\n(ii) if the Contractor fails to perform any of the other provisions of this contract, or so fails to make progress\nas to endanger performance of this contract in accordance with its terms, and in either of these two circumstances does\nnot cure such failure within a period of 10 days (or such longer period as the Contracting Officer may authorize in\nwriting) after receipt of notice from the Contracting Officer specifying such failure.\n(b) In the event the Government terminates this contract in whole or in part as provided in paragraph (a) of this clause,\nthe Government may procure, upon such terms and in such manner as the Contracting Officer may deem appropriate, supplies\nor services similar to those so terminated, and the Contractor shall be liable to the Government for any excess costs for\nsuch similar supplies or services: Provided. That the Contractor shall continue the performance of this contract to the\nextent not terminated under the provisions of this clause.\n(c) Except with respect to defaults of subcontractors, the Contractor shall not be liable for any excess costs if the\nfailure to perform the contract arises out of causes beyond the control and without the fault or negligence of the Con¬\ntractor. Such causes may include, but are not restricted to, acts of God or of the public enemy, acts of the Government\nin either its sovereign or contractual capacity, fires, floods, epidemics, quarantine restrictions, strikes, freight\nembargoes, and unusually severe weather; but in every case the failure to perform must be beyond the control and without\nthe fault or negligence of the Contractor. If the failure to perform is caused by the default of a subcontractor, and\nif such default arises out of causes beyond the control of both the Contractor and subcontractor, and without the fault\nor negligence of either of them, the Contractor shall not be liable for any excess costs for failure to perform, unless\nthe supplies or services to be furnished by the subcontractor were obtainable from other sources in sufficient time to\npermit the Contractor to meet the required delivery schedule.\n(d) If this contract is terminated as provided in paragraph (a) of this clause, the Government, in addition to any other\nrights provided in this clause, may require the Contractor to transfer title and deliver to the Government, in the manner\nand to the extent directed by the Contracting Officer, (i) any completed supplies, and (ii) such partially completed\nsupplies and materials, parts, tools, dies, jigs, fixtures, plans, drawings, information, and contract rights (hereinafter\ncalled \"manufacturing materials\") as the Contractor has specifically produced or specifically acquired for the performance\nof such part of this contract as has been terminated; and the Contractor shall, upon direction of the Contracting Officer,\nprotect and preserve property in possession of the Contractor in which the Government has an interest. Payment for com¬\npleted supplies delivered to and accepted by the Government shall be at the contract price. Payment for manufacturing\nmaterials delivered to and accepted by the Government and for the protection and preservation of property shall be in an\namount agreed upon by the Contractor and Contracting Officer; failure to agree to such amount shall be a dispute concern¬\ning a question of fact within the meaning of the clause of this contract entitled \"Disputes.\"\n(e) If, after notice of termination of this contract under the provisions of this clause, it is determined for any reason\nthat the Contractor was not in default under the provisions of this clause, or that the default was excusable under the\nprovisions of this clause, the rights and obligations of the parties shall, if the contract contains a clause providing\nfor termination for convenience of the Government, be the same as if the notice of termination had been issued pursuant\nto such clause.\n(f) The rights and remedies of the Government provided in this clause shall not be exclusive and are in addition to any\nother rights and remedies provided by law or under this contract.\n9. AMENDMENTS - This contract constitutes the entire agreement between the parties. No amendment or modification chang¬\ning its scope or terms shall have any force or effect unless it is in writing and signed by both parties.\n10. OFFICIALS NOT TO BENEFIT - No member of or delegate to Congress, or resident commissioner, shall be admitted to\nany share or part of this contract, or to any benefit that may arise thereform; but this provision shall not be construed\nto extend to this contract if made with a corporation for its general benefit."
}