{
  "id": "d132-30",
  "text": "11• COVENANT AGAINST CONTINGENT FEES - The Contractor warrants that no person or selling agency has been employed or\nretained to solicit or secure this contract upon an agreement or understanding for a commission,, percentage, brokerage,\nor contingent fee, excepting bona fide employees or bona fide established commercial or selling agencies maintained by\nthe Contractor for the purpose of securing business. For breach or violation of this warranty the Government shall have\nthe right to annul this contract without liability or in its discretion to deduct from the contract price or considera¬\ntion, or otherwise recover, the full amount of such commission, percentage, brokerage, or contingent fee.\n12. DISPUTES - (a) Except as otherwise provided in this contract, any dispute concerning a question of fact arising\nunder this contract which is not disposed of by agreement shall be decided by the Contracting Officer, who shall reduce\nhis decision to writing and mail or otherwise furnish a copy thereof to the Contractor. The decision of the Contracting\nOfficer shall be final and conclusive unless, within 30 days from the date of receipt of such copy, the Contractor mails\nor otherwise furnishes to the Contracting Officer a written appeal addressed to the Director. The decision of the Direc¬\ntor or his duly authorized representative for the determination of such appeals shall be final and conclusive unless\ndetermined by a court of competent jurisdiction to have been fraudulent, or capricious, or arbitrary, or so grossly\nerroneous as necessarily to imply bad faith, or not supported by substantial evidence. In connection with any appeal\nproceeding under this clause, the Contractor shall be afforded an opportunity to be heard and to offer evidence in\nsupport of its appeal. Pending final decision of a dispute hereunder, the Contractor shall proceed diligently with the\nperformance of the contract and in accordance with the Contracting Officer's decision.\n(b) This \"Disputes\" clause does not preclude consideration of law questions in connection with decisions provided for\nin paragraph (a) above: Provided, That nothing in this contract shall be construed as making final the decision of any\nadministrative official, representative, or board on a question of law.\n13. UTILIZATION OF SMALL BUSINESS CONCERNS - (a) It is the policy of the Government as declared by the Congress that\na fair proportion of the purchases and contracts for supplies and services for the Government be placed with small\nbusiness concerns.\n(b) The Contractor agrees to accomplish the maximum amount of subcontracting to small business concp^s that the Con¬\ntractor finds to be consistent with the efficient performance of this contract.\n14. UTILIZATION OF CONCERNS IN LABOR SURPLUS AREAS - It is the policy of the Government to place contracts with concerns\nwhich will perform such contracts substantially in areas of persistent or substantial labor surplus where this can be\ndone, consistent with the efficient performance of the contract, at prices no higher than are obtainable elsewhere. The\nContractor agrees to use his best efforts to place his subcontracts in accordance with this policy. In complying with\nthe foregoing and with paragraph (b) of the clause of this contract entitled \"Utilization of Small Business Concerns,\"\nthe Contractor in placing his subcontracts shall observe the following order of preference: (1) persistent labor sumlus\narea concerns which are also small business concerns; (2) other persistent labor surplus area concerns; (3) substantial\nlabor surplus area concerns which are also small business concerns; (4) other substantial labor surplus area concerns;\nand (5) small business concerns which are not labor surplus area concerns."
}