{
  "id": "d132-39",
  "text": "March 12, l<>64\nErcrfeseor HomslLJfoliase Staarson\nXalo University\n8m Owen, Cona.-ctlcut\nDear Hrofossor Baareons\nWe are relating authorisation from Sale adversity to use a poem by\nS* B. (Hilda Boolittle), \"oread\", for which we understand you hold the\ncoJSrrlgbt.\nR-jalesloa to use this material i* Being sought By the mm In connection\nwith on arrangement we ham with the Voice of America to develop an\nEnglish Sfcraugh Rjcfcry series. ®ta 13 ceraasntarlcs law these programs\nare being written by Professor M U Rosenthal of Hew lark University.\n3he Voice of America, in turn, working closely with Professor Rosenthal,\nwill produce 13 sartor-hour radio scripts on the basis «f these ecementaries\ntte radio progress themselves are intended for broadcast to listener*\noverseas, and are being designed to appeal to tie listeners interest in\npoetry in the English language.\nIn each script the poem will be read in its entirety, and the listener*\nwill also be invited to read th® lines aloud in appropriate unite after\nthe radio speaker.\nP mission is sought both for the broadcast by the Voice of America to\noverseas countries and for broadcast in countries where local radio\nstations nay receive the taped pregreas through the United States Infor¬\nmation Agency. Rnwissim is also naught for publication of the poems\nthat might be published in any given country (with the aid or supervision\nof U.S.I.A.,) and distributed free or at cost to radio listeners.\nEmission is also sought tor eventual publication of the materials in a\nsimilar study booklet to be produced by U.S.I.A. far gratis distribution\nto overseas listeners who request such booklets.\nSfe hope we will hear firm you shortly and that authorization to use these\nmaterials in the manner which we have outlined will be forthcoming- If y>u\nwould like to hare additional information about the use to Which this poem\nwUl be put, may I suggest that you contact Ur. Robert Ooodell, Chief, Itedio\nEnglisto-asaching Breach, voice of America, Washington, B.C. (fbooe, HO 3O63J8\nJs»is A. F Ucw«\nAssistant director"
}