{
  "id": "d132-62",
  "text": "National Association*.of Educational Broadcasters\n134 6 CONNECTICUT AVENUE *\nWASHINGTON 36. D. C.\nOFFICE OF RESEARCH AND DEVELOPMENT\nMarch 12, 1964\nMe. Stuart M. Low, Director\nPublic Relations\nCrowell-Collier Publishing Company\n640 Fifth Avenue\nNew York 19^ New York\nDear Mr. Low:\nWe are requesting authorization from the Macmillan Publishing Company\nto use the following poems for which we understand they hold the copy-\nFlower Fed Buffaloe^yi^y^yAchel., Lijidsayy \"For Anne Gregory\"\nor \"Politics' b^TlJT^B'r’Teats;TRi chard Cory\" by E.A. Robinson; and\nSilence by I^trianne Moore. --— -——-——- -- , „ C (\nPermission to use these materials is being sought by the N.A.E.B. in\nconnection with an arrangement we have with the Voice of America to\ndevelop an English Through Poetry series. The 13 commentaries for those\nprograms are being written by Professor M. L. Rosenthal of New York\nUniversity. The Voice of America, in turn, working closely with\nProfessor Rosenthal, will produce 13 quarter-hour radio scripts on the\nbasis of these commentaries. The radio programs themselves are intended\nfor broadcast to listeners overseas, and are being designed to appeal to\nthe listeners interest m poetry in the English language.\nIn each script the poem will be read in its entirety, and the listeners\nwill also be invited to read the lines aloud in appropriate units after\nthe radio speaker.\nPermission is sought both for the broadcast by the Voice of America to\noverseas countries and for broadcast in countries where local radio\nstations may receive the taped programs through the United States Infor¬\nmation Agency. Permission is also sought for publication of the poems\nthat might be published in any given country (with the aid or supervision\nof U.S.I.A.), and distributed free or at cost to radio listeners..\nPermission is also sought for eventual publication of the materials in a\nsimilar study booklet to be produced by U.S.I.A. for gratis distribution\nto overseas listeners who request such booklets.\nWe hope we will hear from you shortly and that authorization to use\nthese materials in the manner which we have outlined will be forthcoming."
}