{
  "id": "d132-66",
  "text": "Nfcrch 26, 196k\nAppleton-Ceatory-CroTts\n3^ Wwt 33 Street\nNew York 1, New York\nAfOTs Permissions Department\nDear Sir:\ntfe are requesting authorization from Appleton-Century-Crons publishing\nCompany to use a poem by V&ehel Undsay, \"The Flower Fed Buffaloes\", for\nwhich we understand you hold the copyright.\nPermission to use these materials is being sought by the N.A.E.B. in\nconnection with an arrangement we have with the Voice of America to\ndevelop an English Ofcrough Poetry series. afce*13 commentaries for those\nprograms are being written by Professor M. L. Rosenthal of New York\nUniversity. She Voice of America, in turn, working closely with Professor\nRosenthal, will produce 13 quarter-hour radio scripts on the basis of\nthese commentaries. 33ie radio programs themselves are intended for\nbroadcast to listeners overseas, and are being designed to appeal to the\nlisteners interest in poetry in the English language.\nIn each script the poem will be read in its entirety, and the listeners\nwill also be invited to read the lines aloud in appropriate units after\nthe radio speaker.\nPermission is sought both for the broadcast by the Voice of America to\noverseas countries and for broadcast in countries where local radio\nstations may receive the taped programs through the United States Information\nAgency. Permission is also sought for publication of the poems that might\nbe published in any given country (with the aid or supervision of U.S.I.A.),\nand distributed free or at cost to radio listeners. Permission is also\nsought for eventual publication of the materials in a similar study booklet\nto be produced by U.8.I.A. for gratis distribution to overseas listeners\nwho request such booklets.\nNb hope we will hear from you shortly and that authorization to use this\npoem in the manner which we have outlined will be forthcoming, if you would\nlike to have additional information about the use to which these poems will\nbe put, may I suggest that you contact Dr. Robert Goodell, Chief, Radio\nEngUsh-3?oartiing Branch, Voice of America, Washington, D.C., Phone NO 3-6378.\nSincerely,\nJAP;sc\nJames A. Follows\nAssistant Director"
}