{
  "id": "d132-94",
  "text": "3\nThe BLACK AND GOLD LIBRARY... $4.50each\n° fa\nporary letters”—New York Times. , , , , j\nn IL PENTAMERONE, or The Tale of Tales; by Giambattista Basile; translated by Richard\nBurton. A collection of witty, lively, and vivid stories. . , _ . .\n□ INTIMATE LETTERS OF JAMES GIBBONS HUNEKER: Introductwn by Be,„amm\nDeCasseres. Huneker at his very best-gay, frank. Rabelaisian.\n□ JOURNAL OF MADAME GIOVANNI, by Alexandre Dumas. 429 pages. The personal diary\nof a very fascinating Frenchwoman.\nn IOYCE KILMER’S ANTHOLOGY OF CATHOLIC POETS. This collection by Kilmer\nD has been brought up to date by James Edward Tobm with a selection from notable\nCatholic poets of recent years. (Available in paper edition from Doubleday)\n□ LIFE OF BENVENUTO CELLINI: Translated by John Addington Symonds 520 pages\nU More amusing than any novel; most vivid, sharp-witted biography m the annals of art.\nn LIVES OF FAIR AND GALLANT LADIES, by Pierre de Bourdelle (MbeBrantamt^\nU 576 pages. Ulus, by Majeska. The impudent, famous classic of love and ladies of the\nFrench court of the 16th Century-Delightful.\n□ MEET GENERAL GRANT, by W. E. Woodward. 512 pages, fully MmU. ^\"^ ^Editfon\nU of the man, who hated war and became the greatest warrior of his time. Enlarged Edition.\nA Literary Guild selection. , .\n□ MODERN READER’S BOOK OF PSALMS. Sixty outstanding modem poets give us their\nversions of the immortal Biblical poems.\n□ MUCH LOVED BOOKS, by James O’Donnell Bennett. 461 pages. 60 best-sellers of the ages,\ndiscussed and quoted. A liberal education. _ . , .\nn MY LIFE, by Isadora Duncan. Illus. by Majeska. “Explicityand sincerity are involved in\nD the autobiography of a talented, bizarre, intelligent, scandalously extraordinary woman.\nn NAPOLEON,mby Emil Ludwig. 722 pages. Fascinating, fully documented biography. “An\nD outstanding book in Napoleonic literature-a Sargent portra„ ^erj tecret, ^\nordinarily lie hidden in the heart are written m the countenance for all the\nread May prove to be an abiding contribution to the worlds creative literature.\nAtlantic Monthly; A Book-of-the-Month Club selection.\n.—| tv ATT Tit AT PTTTT OSOPHY OF LOVE, by Remy de Gourmont. Translated with a postscript\nD\nmanifold examples are discussed. . “Th/>\n□ ON LOVE, by Stendhal (Marie-Henri Beyle). The volume includes such chapters as\nBirth of Love” “Infatuation,” “Intimacy, Jealousy.\nn ORPHFIJS- A HISTORY OF RELIGIONS, by Salomon Reinach 528 pages, illus. A classic\nD ° w™ ihe SI/of mar?!beliefs and taboos lucidly and pointedly presented by a scholar\n□ PAINTED VEILS, by James Gibbons Huneker. One of the best examples of Huneker s\nn PHYsToLOGY^OF MARRIAGE, by Honore de Balzac. Delightfully illustrated by Howard\n□ PHY^IOcL^ Komrotf. A book for brides and bridegrooms-prospec\n□ PHYSIOL^Y^OT0TASTE: Meditations on Food and Dining, by Jean1 Anthelme BnUat-\nD Sagarin; preface by Charles Monselet. The wisest guide to Pleasant^nZ’s\nsays “An animal swallows its food; a man eats it, but only a man\n. . how to dine.” “The discovery of a new dish does more for the happiness of mankind\n□ PRIMITIVE religion! JyZbert k Lewie. 4»2 pe*e». KWd. A M t^terpiepe,\n° i\"lZtg,heinnermostlecrets of the faiths, codes, and practtce, of the prim, me peoples.\n□ PRIMITIVE SOCIETY, by Robert H. Lowie. 470 pages. Family life seaud practKes, and\ntribal life of primitive peoples in all parts of the world. Enlarged Edition,\nn RED AND THE BLACK, THE, by Stendhal (Marie-Henri Beyle). TransZafed /rom t/ie\nD French byC. K. Scott-Moncrieff. 636 pages. Two violent and P^rmtelovec.ffairs, rely¬\ning upon the eternal ego and romance in man. One of the world s great novels.\nn RF1URRANDT bv Hendrik Willem van Loon. Fully illus. A biography of the master of\nD love-rich in hurZn interest. 600 pages. Enlarged Edition.\nA Literary Guild Selection."
}