{
  "id": "d132-95",
  "text": "4\nThe BLACK AND GOLD LIBRARY...$4.50each\n□ ROBERT BURNS, Rantin’ Dog, Poet Extraordinary, by John Lindsey. The plough, the pen,\nthe tavern, the pretty blonde head: these four symbols fittingly represent the many-faced\npersonality of the greatest of Scottish poets.\n□ SATYRICON OF PETRONIUS ARBITER, translated by W. C. Firebaugh with an essay by\nCharles Whibley. Classic arbiter of elegance and fashion. Rabelaisian entertainment\nwithin the bounds of art.\n□ SENTIMENTAL JOURNEY, by Laurence Sterne, introduction by Prof. Wilbur L. Cross. A\nfree and buoyant spirit roams through France and Italy, noting with humor and sentiment\nthe foibles of Man.\n□ SHORTER NOVELS OF HERMAN MELVILLE. The shorter works of America’s greatest\nnovelist in one volume, including Billy Budd, Benito Cereno, Bartleby the Scrivener, and\nThe Encantada, or Enchanted Isles.\n□ SHORTER NOVELS OF STENDHAL (Marie-Henri Beyle) : Translated from the French by\nC. K. Scott-Moncrieff. 552 pages. The complete versions of Armance, The Abbess of\nCastro, Vittoriai Accoramboni, The Cenci, The Dutchess of Palliano, Vanina Vanini.\n□ SON OF MAN: The Story of Jesus, by Emil Ludwig. A new, unbiased, tenderly written\naccount of the life of the Saviour.\n□ STORY OF AMERICA, by Hendrik Willem van Loon, 512 pages fully illust’d. The thrilling\nstory of the background of our great country and the never ending struggle to preserve it.\nEnlarged Edition.\n□ STORY OF THE AMERICAN INDIAN, by Dr. Paul Radin. 410 pages, fully illust’d in color\nand black & white. The fascinating and authentic story of the Indians of North and South\nAmerica.\n□ STORY OF THE BIBLE, by Hendrik Willem van Loon, 471 pages, with over 150 character¬\nistic illustrations by the author. A beautiful and simple story of both the Old and New\nTestaments. Enlarged Edition.\n□ STORY OF MANKIND, by Hendrik Willem van Loon, 608 pages: with over 150 delightful\nillustrations. You will be spellbound by this glorious pageant of world history, dramatic\nand intensely readable. Winner of the Newbery Medal of the American Library Associ¬\nation. Enlarged Edition. Over a million copies have been sold.\n□ STORY-TELLER’S HOLIDAY, by George Moore. 526 pages. Delectable romance of Irish\nfolk tales in golden prose.\n□ STORY OF THE WORLD’S LITERATURE, by John Macy. 700 pages. Over 140 illustrations\nby Onorio Ruotolo. Most compact general history of literature, a guide and companion\nfor readers. A literary education in itself. “A book of heroic proportions containing a\nresume of the most important books and writers in the whole world of literature, from\nits beginning . . . The work is sound and vigorous—no hint of pedantry here—and its\nvalue is greatly enhanced by the fine pictures of Onorio Ruotolo.” — THE BOOKLIST\n—American Library Association. Enlarged & Revised Edition, 1961.\n□ STORY OF TOLERANCE, by Hendrik Willem van Loon. Illustrated. The philosophies of\nthe great thinkers. The fascinating story of man’s fight for the right to think.\n□ TRAVELS OF MARCO POLO, edited by Manuel Komroff. 404 pages. The classic of all\ntraveler’s tales. Truth which was stranger than fiction.\n□ TREASURY OF HUMOROUS VERSE (including Poems in Praise of Practically Nothing),\nby Samuel Hoeffenstein. 440 pages. Gay, mad, witty, and profound poems of love, women,\nmarried men and bachelors—of children, animals, hopes, complexes, etc.\n□ TRISTRAM SHANDY, Gentlemen, by Laurence Sterne. 536 pages. A chronicle to read and\nre-read. Contains material published only in the earliest editions.\n□ VANISHING WILDERNESS, by Francesca La Monte and Michaela Welch. Strikingly illus¬\ntrated. Into the life stories of 19 wild animals whose home is the fast vanishing wilderness,\nthe authors have subtly interwoven a mixture of history, biology, geography, and a wealth\nof educational material.\n□ THE WAY OUR PEOPLE LIVED: The Early Life & Customs of the American People, by\nWilliam E. Woodward. A most fascinating book about the life, manners and customs of\nthe men and women who helped found and build our Nation, covering different periods\nof over three centuries in American life—might be called A History of America, in terms\nof the common man. A Book-Club Selection. Illustrated.\n□ WITH HEART’S COURAGEOUS, by Edna Kenton. Profusely illustrated by Raphael Doktor.\nThe exciting adventures of French missionaries opening up the St. Lawrence, the Cana¬\ndian wilderness, and the Mississippi. Her story is one of vivid adventure and invaluable\ninformation that brings back the past with exciting truth for readers of every age.\n□ WONDER BOOK OF TRAVELLERS’ TALES, by H. C. Adams. Introduction and illus. by\nHendrik Willem van Loon. 352 pages. Entertaining stories of the world’s most famous\nvoyagers."
}