{
  "id": "d808-56",
  "text": "Dr. Barry Skoraia\nPage 3\n3. Subsequent payments under this commitment will be contin¬\ngent upon evidence of satisfactory progress in the program\nas revealed in the Annual Program Report and through other\nsources and upon receipt and approval by the Foundation of\nthe Annual Financial Statement and upon receipt and approval\nby the Foundation of the projected plans and budget for the\nnext fiscal year which may include phases of the \"program which\n-ere not activated during the previous year.\nb* Any unexpended balance existing at the close of a fiscal year\nwill be deducted from the payment for the next fiscal year*\nunless provisions acceptable to the Foundation are made in\nadvance for carrying funds committed to continuing activities*\n5* If at the end of the three-year commitment there remains any\nunexpended funds or if the program is terminated at any other\ntime, any unexpended cash balance is to be returned to the\nFoundation.\n6. Any anticipated change in the itemized budget which has been\napproved for a particular year should be made in writing and\nsubmitted to the Foundation for approval prior to expenditure.\n7* Any salary increases or contributions to retirement pi *na above\nthose planned in the budget which is submitted with this proposal\nare to be provided by the Association unless approved in advance\nby the Foundation.\n8. The NAJ3B agrees to disseminate, through established channels of\ncommunication or by special reports, pertinent information relat¬\ning to tile results, findings, or methods developed through this\ngrant.\n9* We request that you release no publicity concerning this commit¬\nment until you receive our first payment. The Foundation ordi¬\nnarily does not publicize its assistance to projects and programs\nunless they appear to be o particular public interest. In the\nevent such a Foundation news release appears desirable, we will\naccompany the first payment to you with a copy o our release\npost-dated ten days 30 that you may synchronize with that date\nany release you may be contemplating. It is, of course, entirely\noptional with you as to whether you publicize the commitment.\n10. In case of national emergency the Foundation reserves the right\nto review the program and negotiate with the National Association\nof Educational Broadcasters as to modification or termination of\nthe program in view of the national situation*"
}