{
  "id": "d808-67",
  "text": "RECEIVED\nNAEB HEADQUARTERS\nFEB 14 1959\npm\nWlWlVlVlMlMlW\nI\nFebruary 9. 1959\nOr. Maurice F. Seay, Director\nThe Division of Education\nW.K. Kellogg Foundation\n250 Champion Street\nBattle Creek, Michigan\nDear Maurice:\nDuring these iast years, i have developed a kind of \"allergic-depressive\"\nexpectation set with respect to the morning mail delivery. When—as some¬\ntimes happens—the reality exceeds even my most dismal expectations, my\nprejudice is confirmed and 1 simply kick another leg off the pine desk\n(supplied by the furniture factory of the Ohio State Penitentiary).\nFebruary 5th, however, proved to be such a memorable and heart-warming de¬\nparture from this pattern that it will remain for many years to come one\nof my real “red-letter\" days. This was the day when i received from Harry\nSkornia copies of your January 30th letter stating the terms of a new\n3-year NAEB grant and his official response of February 3rd.\nAs chairman of the NAEB Foundation Committee of last year, as a former NAEB\npresident, and as a worker in the somewhat varied vineyard of educational\nradio and television broadcasting for many years, I felt a sense of pleasure\nand pride and gratitude which one is privileged to experience only on rare\noccasions.\nThe long-time understanding and support from the W.K. Kellogg Foundation\nof NAEB*s operations, its goals and professional-ethical concerns (which\nour friend, Harry Skornia, in a very real way epitomizes) has been vital\nto the grovtfth and development of NAEB. And many of us believe NAEB has made\nand will make fundamental contributions to American society in this increas¬\ningly important area of educational communications. To me, this new Kellogg\ngrant represents a kind of “reaffirmation of faith\" in a)) that the NAEB is\nand hopes to be. While the fiscal aspects of the grant are vita! as you know,\nthe spiritual and moral encouragement It provides really transcends the dollar\ncontribution. Please know how deeply grateful all of us are for both aspects\nof the support.\nRichard B. Hull, Director\nRadio and TV Broadcasting\nRBH/mh\nP.S. 1 am also pleased to report the local plumbers who masquerade under\nthe title of M.D. assure me that all pipes and fittings have been re¬\nstored and function is normal. I hope the Michigan medics now give\nyou the same \"all clear.\"\nbe: Skornia, Harley, Schooly."
}