{
  "id": "d1050-2",
  "text": "Moody Bible Institute. This institu.tionapplied for active membership\nin NMB. After publication of the application in the NEWS-LETTER in routine\nform several members questioned the eligibility of the applicant for member¬\nship. It was revealed that the Moody Institute is not accredited by the\nAmerican Association of Theological Schools, Discussion centered on the\nobjectives of the applicant in using radio and on his standing in the field.\nThe conclusion was that the applicant did not qualify for membership under\nthe constitution of NAEB.\nMoved, seconded and passed that the application be not accepted and\nthat the president write the applicant explaining the matter of accreditation\nas a basis of eligibility. This is not to be construed as passing judgment\non the quality or character of the applicant’s radio activity - but rather\nas adherence to basic standards to be adhered to.\nIBS — Intercollegiate Broadcasting System,\nMembers of IBS have asked about their eligibility for NAEB member¬\nship. Russell Potter, director of the IBS Board and a member of NAEB,\nexplained the scope of IBS activity. He expressed the belief that these\nstations were not generally eligible for active membership: (l) They\noperate commercially, (2) They are not \"educational’1 in purpose basically.\nHe asked for cooperation between IBS and NASB, with the possibility of\nadmitting certain such stations as might wish to apply for associate\nmembership.\nMoved (by Coleman) , seconded, and passed that a committee be appointed\nto handle NASB-IBS relationships.\nCommittee appointed by the chair:\nRussell Potter, Chm., Harry Skornia, John Crabbe\nV. Negotiations for National Office Support\nNovik reported that he and Potter had talked with foundation\nrepresentatives about the possibilities of obtaining funds for setting up\na Washington office. Interest not high in such projects. Little hope held\nfor those contacted. Other contacts suggested (Kellogg, Kresge, Racham),\nPossibility of adequate financing through member-station contributions\nsuggested. Discussion followed.\nMoved, seconded and passed that the committee continue to investigate\npossibilities and report at the next regular meeting.\nVI, NAEB Station Survey\nA revised form for surveying the activities of NAEB members was\nsubmitted by Engel for consideration. Changes desired to be reported to\nhim for consideration and inclusion. Survey to be made as soon as\npractically possible,\n(Copy of form appended hereto)\n- 3 -"
}