{
  "id": "d1050-6",
  "text": "In conclusion Hull made a plea for unity behind NAEB which would result\nin greater good to all members.\n.Remarks by Dr. Lee de Forest, \"The Father of American Radio\", as guest-of-honor\nat the NAHB banquet.\nDr. de forest said that he was heartened by the fact that NAEB was moving\nforward toward a goal waich had long been in his mind for radio broadcasting -\nthe use of the medium for a serious purpose as well as for sheer pleasure.\nReminiscing on the early days when he set up his experimental telephonic\ntransmitter he recalled the advent of \"sponsored\" programs, and his resistance\nto over-commercializing because it threatened the service which he knew should\nbe rendered.\nBanquet Speaker... Commissioner Clifford J. Durr, F.C.C.\nCommissioner Durr paid high tribute to Dr. de Forest for his contribution\nto the science of radio, and to Professor Lighty, at the University of Wisconsin,\nfor his vision in the social significance of what broadcasting could do for\nthe people of this country if intelligently handled.\nCommissioner Durr indicated that the U.S. is in a state of nerves - and\nthat radio, the 'one medium which is in the best position to give assurance, is\nnot rising to the occasion. Leadership is needed, and it is up to the\nuniversities of this country to educate men - not just train them technically.\nCommissioner Durr warned the educators that they have serious competition -\nand quoted from the NAM proposed code to show that educators must truly serve\nas guardians of the freedom in this country if it is to be preserved in respect\nto broadcasting.\n\"I am disappointed at the progress made so far by educational broadcasters\n(in respect to FM station development), but I am not discouraged,\" said the\nCommissioner. Educators, he said, must understand that if they do not move\nforward that their efforts will be nullified - and others less well qualified\nwill take over.\nIn conclusion Commissioner Durr urged educators to re-evaluate their\njobs in respect to the over-all job to be done. ’He pleaded for more reality\nand better financing for the broadcasting activity. For contrast he pointed\nout that while about 4 million dollars is spent for tne opsrations of education¬\nal broadcasting activities in this country some 4 billions are spent for the\noperations of the countries universities. This did not seem to be adequate\nwhen considered in terms of the numbers of persons being served.\nIn conclusion Mr. Durr pointed out that despite the provisions in law\nthat the monopoly created by the scarcity of radio facilities has limited the\nfreedom of expression as far as broadcasting is concerned. He emphasized\nthe fact that scientific development is far ahead of the social scientists\nat the present time. We must hurry to catch up. \"The atom bomb and human\nmisery cannot exist side by side in the same world for very long,\"\n- 3 -"
}