{
  "id": "d1492-5",
  "text": "6\nNATIONAL EDUCATIONAL RADIO DIVISION\nA program of grants to assist the production of unusual, high-\nquality radio series was announced upon the establishment of NAEB's\nNational Educational Radio Division in September. Five awards have\nbeen made from funds granted by the National Home Library Foundation.\nA radio series featuring top scientists in the field of cancer\nresearch is under development by NER. The programs are underwritten\nby the National Cancer Institute. At year's end, negotiations were\nproceeding well toward the acquisition of a number of award-winning\nradio documentaries.\nA comprehensive, long-range plan on the present status, tech¬\nnical capacity, and cultural/instructional potential of radio has\nbeen developed by the NER staff and work now underway will lead to the\nimplementation of this plan via a series of individual but correlated\nstudies.\nThe National Educational Radio Network distributed 57 million,\n804 thousand feet of tape last year. Forty new series were begun\nduring 1964, fourteen continued from the previous year, and seventeen\nspecials were sent to affiliates. NERN programs accounted for about\n24 thousand hours of air time on affiliated stations. The network\ncatalog now lists 1054 programs in 79 series.\nEDUCATIONAL TELEVISION STATIONS DIVISION\nAn $80,000 grant from the National Home Library Foundation was\nreceived for the establishment of a National Television Program Service\nSteps were taken for selection of a location from which high quality\nETV programs, produced by individual stations, would be catalogued,\nduplicated and distributed. Supplementary funds were sought to put\nthe service in action in early 1965.\nETS conducted its first competition for the nation's best ETV\nprograms. A grant of $5,000 from Reader's Digest Foundation was re¬\nceived for awards to go to the prize winning stations — KLRN, Austin;\nWQED, Pittsburgh; KUED-TV, Salt Lake City; WOSU-TV, Columbus, Ohio;\nKOAP, Portland, Ore.; WMVT, Milwaukee. The six award winning programs\nare expected to be made available through the National Television\nProgram Service.\nThe accelerated program of ETS pin-pointed the need for con¬\nsideration of the prime problem facing all ETV stations financing.\ngrant was received from the USOE for a seven months' study of the\nlong-range financing of ETV stations. The December Conference mention\ned on page 1 of this Memo constituted an important part of this study.\nA complete report will be published by March 31, 1965."
}