{
  "id": "d1250-1",
  "text": "-2-\nItaly. The income increased 10$ in 1932. It was already ample to cover all\nexpenses.\nLithuania. The Government contributes $15,000.00 annually to supplement the\nincome from listeners’ license fees. This is not regarded as a deficit but\nas a service to the citizens.\nNew Zealand. The income is sufficient and is increasing.\nNorway. The income increased in 1932. The Government has taken over the broad¬\ncasting system.\nPoland. The operating company continues to make profits.\nRumania. The income increased 42$ in 1932.\nSweden. The income is increasing. Stockholders receive 7$ dividends.\nUnited States of America. Total value of broadcasting stations, $47,879,249.24.\nThis includes ’’good will\" valued at $18,264,215.51. Gross income, 1931,\n$77,758,048.79. Gross expenses, 1931, $77,995,405.68. Aggregate loss,\n1931, $237,356.89. (Mr. Henry A. Bellows, representing the National Asso¬\nciation of Broadcasters, states that these official figures showing income\nand expense aro incorrect, and that the actual aggregate loss was\n$1,232,817.96. He also testified: ’’Nobody can question the fact that the\ncalendar year 1932 was even less satisfactory....than 1931, and there are\nfew people rash enough to predicate their budgets on any material increase\nof business during 1933.”) Estimated investment of listeners in 16,679,253\nreceiving sets, approximately $1,000,000,000.00. Amount paid by listeners\nannually for electric current for receiving sets, approximately\n$141,773,650.50.\nYugoslavia. The income increased over 72$ in the first five months of 1932.\nExponsc of Administration\nEurope. The International Broadcasting Union performs functions for European\nbroadcasting similar to the functions of the Eederal Radio Commission in\nthe United States of Amorica. The budget of the Union is about $30,000.00\nannually.\nUnited States of Amorica. Federal Radio Commission budget, 1931, $444,179.94.\n1932, $454,197.79. 1933, about $640,000.00. Approximately one-half of\nthese amounts is expended for the regulation of broadcasting.\nInternational Telegraph Bureau, Borne, Switzerland, coordinates the telegraph,\ntelephone and radio services of the world and its budget is approximately\n$50,000.00 annually.\nExpense of Litigation\nUnited States of America. The expense of broadcasters for lawsuits to secure,\nprotect or increase their privileges in the public radio channels is\nestimated at more than $600,000.00 annually. The expense to tax payers in"
}