{
  "id": "d1103-18",
  "text": "Indiana Looks Ahead\n19\nHealth, the Indianapolis City Hospital, the American Red Cross,\nand the law-enforcing agencies of the state.\nThe war which has given the School of Medicine and its\nhospitals these great responsibilities has brought, in the same man¬\nner, heavy burdens. Shortages of both manpower and materials\nhave been keenly felt. However, the School has thrived on ad¬\nversity. It loyal Faculty has put forth unremitting effort; its\nstudents, aware of the trust imposed in them, have worked harder;\nand altogether the standards of instruction and of academic en¬\ndeavor have not only been maintained but have gone forward on\nhigher levels.\nThe School of Medicine, while striving to perform its war¬\ntime duty, is giving thought to the days of peace. To that end,\nFaculty committees have been studying these postwar problems:\nimprovements in educational and administrative procedure; new\nbuilding needs; research; postgraduate study; proposed school or\ndepartment of public health; special services of the Riley Hospital;\nand plans for expanded instruction for nurses, dietitians, medical\ntechnicians, X-ray technicians., and physical and occupational\ntherapists.\nPostwar instruction and refresher courses will be required by\nhundreds of the School’s graduates and other physicians now in the\narmed services. It will be the School’s task to provide these\ncourses and thus enable service physicians to reconvert to peacetime\npractice.\nPublic health seems destined to have a large part in the\nthinking of our people after the war and there will be great\nneed for physicians trained in public health and industrial medicine.\nThe School of Medicine looks forward to the opportunity of co¬\noperating in the establishment of a department, and eventually a\nschool, of public health.\nDespite the burdens of war, medical research through the\nIndiana University School of Medicine has gone forward. The\nreturning staff members and hoped-for addition to facilities will\nenable the School after the war to devote much greater attention\nto research. Problems already designated for research attention\ninclude these:\nInvestigations of outbreaks of food poisoning and diarrheal\ndiseases;\nStudy of mental disorders—a field of research which should\nenable many veterans of the war to assume positions of usefulness;"
}