{
  "id": "d1103-19",
  "text": "20\nIndiana University News-Letter\nMore accurate diagnosis of tuberculosis and more effective\nmethods of combating its causative bacterial organism, and,\nParasitic diseases common to residents of Indiana.\nOther medical research needs urgently to be undertaken.\nThis is especially true of research in the diseases which afflict middle-\naged and elderly persons, such as cancer, heart diseases, arterial\ndiseases (including heart diseases and diseases of the kidneys and\nbrain), enlarged prostate, arthritis, and diseases of the eye. Another\nimportant field of study concerns the nature of the bacteriologic\ninfections in infants and children, particularly of infections of the\nrespiratory tract.\nThe medical profession “looks ahead” and the Indiana Uni¬\nversity School of Medicine confidently expects to maintain a posi¬\ntion of leadership to the end that the people of Indiana shall enjoy\na greater measure of health as well as. a greater degree of happiness\nand prosperity.\nWillis D. Gatgh,\nDean of the School of Medicine.\nDentistry\nINDIANA University and its Dental School are looking ahead\nthrough the eyes of research to yet undiscovered ways to\nbetter general health and happiness through better dental health.\nNew truths are being learned which will lead to methods of im¬\nproving the preventive, surgical, and restorative fields in dentistry.\nDental decay is the most prevalent disease afflicting mankind,\nand few adults escape it. The widespread prevalence of dental\nills is shown by the fact that at the installation of the Selective\nService System, one out of every five men rejected for physical\nreasons was rejected because of dental defects. The condition o\nthe teeth of young men entering the armed forces has brought to\nour attention very forcibly the shocking statistics of dental con¬\nditions.\nCarefully prepared data from recent studies on the prevalence\nof dental decay in the student body at the University of Minnesota\nindicate that decay has increased about 7 per cent in the past ten\nyears. This was true in spite of the fact that the general health"
}