{
  "id": "d1103-21",
  "text": "22\nIndiana University News-Letter\nThough decay is responsible for the loss of most missing\nteeth, there is another disease which is responsible for the loss of\nalmost as many. This dental condition is known to many people as\npyorrhea and is actually an infected condition of the tissues which\nsupport the teeth. Disease of the supporting tissues of the teeth\nis responsible for the loss of nearly half of all the teeth extracted.\nThis disease occurs in many degrees of severity. It may be very\nmild. Under such circumstances it is called gingivitis.\nPyorrhea, and the subsequent loss of teeth from it, is usually\nthe result of poor mouth hygiene. It must be remembered that\nmany varieties of bacteria are always present in the mouth just\nwaiting, it seems, for the resistance of the body to get low enough\nfor them to infect the tissues. Therefore, any disease such as\nanemia or diabetes, or dietary deficiencies, or any of a large\nnumber of other conditions which lower the general resistance of\nthe body, may be causes of pyorrhea.\nTo combat this disease as well as decay, Indiana University\nlooks ahead through the eyes of research to learn undiscovered\nways to better health. Well-qualified scientists, fired with the\nenthusiasm to learn what lies beyond the horizon, are blazing new\ntrails into the unknown and are making new discoveries in the\npreventive, surgical, and restorative fields in dentistry. Indiana\nUniversity looks impatiently forward to the day when the sons\nand daughters of this state can be provided, through science and\nadequate dental care, with the best dental mechanisms to be\nfound anywhere.\nWilliam H. Crawford,\nDean of the School of Dentistry.\nPublic Health\nIF this nation is to go forward as a vigorous people paying the\nwar debt and rebuilding a war-torn world, it must be a healthy,\nwell-nourished nation. It is not to be supposed that a sickly\npeople can clean the Augean stables which are the aftermath of\nwar, starvation, and desolation. Our returning service men will\ndemand for their homes and their families some measure of the\nsanitation and care which has made it possible for them to remain\nalive, well, and vigorous even in the midst of terrible health\nhazards."
}