{
  "id": "d1103-25",
  "text": "26\nIndiana University News-Letter\nIndiana University has been an educational factor in a nation at\nwar. Each time the University has emerged in a stronger position\nof leadership, with a broader program, and alert to the newer\nmethods of teaching.\nAs with the other great colleges and universities of the Ohio\nValley, Indiana University will be ready to accomplish all that is\ndemanded. Its only limitation will be the scope of the facilities\navailable. And the facilities for teaching, for training, and for\nresearch cost money.\nIt is easy to say of the great state universities such as Kentucky,\nWest Virginia, Ohio, Illinois, and Indiana that, since they are\nsupported by tax money their financial position is secure and that all\nproblems of money are solved. Fine as is their support from tax¬\nation, that support supplies only a portion of the needs of these\nuniversities; to some it is only the basic source of income.\nEach of these universities has been fortunate in that persons\ninterested in education and the upbuilding of the area ii\\ which\nthey live and in which their children will live have added physical\nequipment, scholarships, fellowships, and endowments through gifts\nso that these great schools may be even greater.\nLikewise some of the industries of the Ohio Valley have provided\nthe ways and means that these institutions might further research\nand investigation. These industries have provided equipment and\nmoney..\nGreat art treasures and valuable historical collections have\ncome to these universities by gifts and by bequests from friends.\nThe stability and permanence of these state institutions have\nattracted the finest sort of cooperation from literally thousands\nof men and women who believe in education and emphasize that\nbelief with financial support.\nAt Indiana University such support from sources other than\ntaxes is encouraged and administered by the Indiana University\nFoundation. The Foundation is a corporate body associated with\nthe University and administered by a board of directors that\nincludes some of the outstanding professional and industrial leaders\nof the country. These men, generous with their time, each year\nask the University what project is most desirable and what project\nis least likely to be provided from other sources. The answer\nbecomes the program of the Foundation for the year. Just now\nthe emphasis is on scholarships so that more and more boys and"
}