{
  "id": "d1579-2",
  "text": "A late development has been the reassignment from the Subcommittee on Communica¬\ntions to the Rules Committee of Rep. William H. Avery (R.-Kan.). Avery has been an\noutspoken critic of the ETV proposals and at the last session made a personal appear¬\nance before the Rules Committee to argue against reporting out H.R. 10609.\nPersons interested in giving emphasis to the need for passage of the proposed\nlegislation, may write to any member of the House Committee and duplicate copies for\nthe Chairman and Counsel may be addressed to Room 1334, New House Office Building,\nWashington 25, D. C.\nHOUSE COMMITTEE ON INTERSTATE AND FOREIGN COMMERCE\nOren Harris, Ark., Chr.j John Bell Williams, Miss.; Peter F. Mack, Jr., Ill.;\nKenneth A. Roberts, Ala.; Morgan M. Moulder, Mo. * 1/; Harley 0. Staggers, W. Va.;\nWalter Rogers, Tex.*; Samuel N. Friedel, Md.; John J. Flynt, Jr., Ga.*; Torbert H.\nMacdonald, Mass.; George M. Rhodes, Pa.; John Jarman, Okla.; Leo W. O'Brien, N.Y.;\nJohn E. Moss, Calif.*; John D. Dingell, Mich.; Joe M. Kilgore, Tex.; Paul G. Rogers,\nFla.; Robert W. Hemphill, S.C.; Dan Rostenkowski, Ill.*; James C. Healey, N.Y.; John\nB. Bennett, Mich.; William L. Springer, Ill.; Paul F. Schenck, Ohio; J. Arthur Younger,\nCalif.*; Harold R. Collier, Illinois; Milton W. Glenn, N.J.; Samuel L. Devine, Ohio;\nAncher Nelsen, Minn.; Hastings Keith, Mass.; Willard S. Curtin, Pa.; Abner W. Sibal,\nConn.*; Vernon W. Thomson, Wise.; and W. E. Williamson, Clerk.\n* Subcommittee on Communications and Power\nl/ Chairman of Subcommittee\nFCC ACTIONS\nInquiry. - The Federal Communications Commission (March 29) inaugurated a formal\ninquiry into the methods by which one of the seven commercial VHF television channels\nat New York City and at Los Angeles could be made available for non-commercial educa¬\ntional broadcasting. Interested persons may file comments on or before May 1, 1961.\nIn taking this step the Commission noted that, despite the achievements of edu¬\ncational groups in placing 54 educational TV stations on the air, the vast populations\nof the New York City and Los Angeles areas — over 13% of the total population of the\ncountry -- are still not served by non-commercial educational TV stations. In these\ncircumstances, and recognizing the abundance of resources for educational programming\nin those cities, the Commission stated it is urgently desirable in the public interest\nto inquire into available means by which it could enhance the opportunities for provid¬\ning such services. NAEB plans to file comments.\nApplications Accepted for Filing. - WYES-TV, Greater New Orleans Educational\nTelevision Foundation: Renewal of license. KLSE, State Department of Education, State\nof Louisiana, Monroe, La.: Renewal of license. The School of the Ozarks, Point Lookout,\nMo.: CP for a new non-commercial FM Station to be operated at 88.1 me., ch. 201, with\ntransmitter power of 10 watts.\nActions on Motions. - The Commission (March 27) granted petition by the Committee\non Education of The Legislative Council of the State of Kansas and extended from March\n27 to May 25 time to file reply comments in TV rule-making proceeding involving Superior,\nKearney, Albion, Nebraska, and others (Docket 13860).\nBy Memorandum Opinion and Order, the Commission denied a petition by Rankin Fite\nand Robert H. Thomas for rule making to allocate Channel 2 for commercial use in Hamil¬\nton, Ala., by deleting that channel now reserved for educational use in State College,\nMiss., and Nashville, Tenn., and reserving Channel 30 (now commercial) for educational\nuse in Nashville.\nBy Report and Order, the Commission finalized rule making in Docket 13945 and\namended the TV table of assignments by substituting Channel 52 for Channel 44 in Vin¬\ncennes, Ind., Channel 44 for Channel 52 in Princeton, Ind., and Channel 8l for Channel\n60 in Washington, Ind. Purdue University in its comments requested that the assign¬\nment of Channel 8l rather than Channel 76, as originally proposed, in Washington so as\nto eliminate any future interference should a station commence operating from that\ncity, to the operation of its experimental station on Channel 76 (KS2XGD) aboard a\nplane over Montpelier, Ind."
}