{
  "id": "d1579-3",
  "text": "N.Y. UHF Project. - The Commission (April IT) issued a \"Request for Quotations\"\nfor establishing a system for the collection, processing and analysis of data ob¬\ntained from observations and measurements taken in the Nfew York City UHF-TV Project.\nThis project is being organized for a study of the technical and economic feasibility\nof using UHF channels to provide satisfactory broadcast coverage in a large metro¬\npolitan area.\nThe data will be obtained from observations and measurements made at about 5,000\nlocations in the New York City area during 10 months of operation, starting about\nAugust 1, 1961.\nThe NAEB Survey of the Needs of Education for Television Spectrum Space is now\non the home stretch and the material is being evaluated for the final report which\nwill be due sometime in September. A progress report just released to the U.S. Office\nof Education stated that the present indications spell out a three-way pattern of need\nfor educational television channels:\n1. A basic ETV service for the entire country, compatible\nwith the general receiving potential of the community,\nwhich means VHF channels in most areas;\n2. A supporting service of multiple channels for instruc¬\ntional services on the various levels which will provide\nfor indicated needs in the localities;\n3. A group of contiguous channels in the higher frequencies\nof the UHF band to provide for future extra-terrestrial\nbroadcasting for educational purposes.\nNetwork Programs. - The Washington office is presently originating two programs,\nWASHINGTON REPORT and a majority of the weekly half-hour segments known as SPECIAL\nOF THE WEEK. The latter includes coverage of events, such as cabinet news confer¬\nences, and major talks, such as those at the National Press Club. In the past two\nweeks these have included: Conrad Adenauer, the Prime Minister of Greece, Secre¬\ntaries Freeman and Udall, and Walter Heller, Chairman of the President's Economic\nAdvisory Council. The unedited tapes, many of which are provided by Voice of America,\nare shipped to WUOM, where Ed Burrows sees to selection and editing of the final pro¬\ngram.\nWASHINGTON REPORT, now four weeks old, alternates two commentators at present.\nMark F. Ferber is Director of the Congressional Fellowship Program and Assistant\nDirector of the American Political Science Association. John F. Lewis, until re¬\ncently was special press assistant to former Secretary of Agriculture Benson and is\na former documentary writer and producer for WBAL and WBAL-TV, Baltimore."
}