{
  "id": "d758-11",
  "text": "But the editor should he solely responsible for the execution\nof board policy, He should he the judge of what goes into the\nmagazine and how it is presentedo He should accept or reject\nmanuscripts on what he regards as their merits, not on the basis\nof association politics,,\n2, The managing editor is responsible for the\nproduction of the magazine. His duties include minor editing,\ncaption and headline writing, style, prepax’ing copy for the\ntypesetter, makeup, typography, proofreading and relations with\nthe printero He should he an experienced magazine journalist\nhut does not necessarily have to be an authority on educational\nbroadcastingo\nIdeally, these functions should be combined in on© person\non this magazine; given the budget of the magazine, however, it\nis not feasible*\nTherefore, we recommend that the association hire the best\nmanaging editor possible with funds available. The journal currently\nneeds an experienced, capable managing editor* It gets its low\nprinting rate in part for three reasons. First, the printer uses\nhelp which would not meet the standards of a first-class printing\norganization. Second, he requires more printing knowledge and\ndiligence from the editor than first-class printing houses do*\nThird, his Mention makes lower prices possible at the expense\nof convenience to the editor. All of this means that part of the\nsavings in printing must go to editorial help if the magazine is to\nmaintain its standards,\nGapable editors cost money. But in the long run, they are an\neconomy, not a luxury.\nSince we believe a good editor so important to the long-term\nsuccess of the magazine, we have based our recommendations on\nprevailing salaries for competent, experienced editors. The median\nsalary for editors of roughly comparable publications in 1951 was\nbetween $4(50 and $500 a month, according to a nationwide survey\nconducted by the International Council of Industrial Editors,\nA somewhat similar survey by J. IC„ Laeser in 1950 substantiates\nthat figure. Therefore, the association should expect to pay in\nthe neighborhood of $100 a week for a fulltime editor. For part-\ntime work, the association should expect to pay proportionately\nwhat the editor would earn as a fulltime employee.\nObviously the association cannot afford a fulltime editor for\nthe Journal, Nor does it need one for the Journal alone, although\nediting both the journal and the nexirslstter could be a fulltime Job*\nWe further recommend that a capable managing editor assume\nsome of the traditional responsibilities of the editor-in-chiefs\n1, The managing editor should plan the pace of each\nissue and handle the balance of content from issue to issue. The\nmanaging editor should also on the basis of his experience be free\nto question the manuscript recommendations of the editor-in-chief;\nsince the Journal is so limited in size, he should have the freedom"
}