{
  "id": "d758-12",
  "text": "a\nto sharpen the copy through editing so long as the authors Intent\nis not lost* When making major revisions, he Should consult the\neditor-in-chief o'\n20 Once a manuscript has been accepted , we recommend\nthat the managing editor handle correspondence with the author;\nfor example, he should make specific requests for pictures to\nillustrate the article and to clarify ambiguous writing in the\ncopy* He also can supervise mailing complimentary copies to\ncontributors with a personalised thank-you note and returning\npictures with personal note to pave the way for continued contri¬\nbutions in the future0\n3o The managing editor should build sources for pictures\nsuch as stock shots for the picture inventory, news photos, cover\nshots * etc*\n4* The managing editor should make use of frequent\nquestionnaires for mailing to association members; these question¬\nnaires may suggest topics for reader discussion, may elicit items\nfor survey articles, and may constitute an important method of\ngaining feedback for the magazine; such questionnaires may get a\n**free ride“ with other association mailings to cut down on costs*\n5« The managing editor should initiate articles from\ntime to time to round out the content balance of the journal*\n11* Salaries*\na* Editor-in-chief. We assume that the editor-in-chief\nwill serve without honorarium, especially since much of the\nburdensome detail of the magazine has been assigned to the role of\nthe managing editor*\nb. Managing editor. After eu3'veying the local labor\nmarket and studying editorial scales of small national magazines,\nwe doubt that the association can hire the sort of managing editor\nit needs for less than $100 a week* Since the magazine9s editorial\noffices have been moved to Champaign-Urbana, we have had an oppor¬\ntunity to study the amount of time inquired to do a creditable job.\nThe managing editor for the issues of October 1956 through\nJanuary 1957 has required an average of one 40-hour week, and\nher duties have not included all of the details we recommend for\nthe job* In view of the amount of work she has done, the $50 fee\nhas been unrealistically low* It would be impossible to find feft\nexperienced magazine editor to handle this job at thlfc -rtitcM*\nexcept, perhaps, on an interim bafiie.\n! [ $! 1 ’> t j\nsince September the acting managing editor has handlettffchfe\nfollowing-{autledb j ' it * V&V'C’\n* Editing m^nu^c'ripts with minor rewriting\nWriting for«many pictures \\x \\m'\nHandling' pertinent correspondent\nvV*'\n. v -"
}