{
  "id": "d758-125",
  "text": "April 18, 1962\nDr. Walter B. Emery\n437 Rosewood Avenue\nBast Lansing, Michigan\nDear Walters\nThank you for your note r» the article by Ballard and for your offer\nto look It over. I'm enclosing a photocopy for you.\nWith a little editing, X think it makes a pretty good how-to-do-lt\narticle, and might give soma readers a new Idea or two.\nBy the way, I'm always a little confused regarding a general policy\nfor this type of article. A number of people on the Board and staff\nsay we should head toward a more scholarly Journal, which I assume\nmeans steering away somewhat from this type of piece. However, this\nvery type of article Is the type on which X get the most favorable\ncomments from readers. People come up to me at meetings and tell me\nhow much help they received from, for example, Tom Petry's article\n«aa?*a st*8,n8 for Small Studios,\" which appeared In May-June,\n1961. (That article, by the way, talked at great length about the\nuae of \"Modulwail\" units { so I don#t want to be too hard on Ballard\nas to commercialism.) So generally I tend to Just try to achieve\nsome kind of balance between this kind of short, step-by-step outline\nand the more philosophical type of thing. We*ve talked about this\nbefore, but if you have any further comments or feel that I*m leaning\ntoo far In either direction, 1*4 like to know.\nhow back to Ballard. If we take out the reference to Dow on page 2,\nline 15, and eliminate Eccles as co-author, I think we*re o.k. I\ncan also do a little editing and cut out some of the Styrofoams\nwhich are so liberally sprinkled throughout. We can*t get around—\nand I don't feel we need to try—the fact that it*s a trade name,\nbut we can say in a few places something like 'This type of material...*1\ninstead of naming it specifically.\ncalled me this morning. He said the eliminations were o.k.\nwith him—though he would like to have Socles listed, but he won't\ninsist. He said Secies had as much to do with the actual writing\nof the article as he had, and therefore he*d like to give him credit.\n*4**!**“ \"? ***** a copy of this article to Art Weld, and\nsaid Art also had received copies of two other articles by people at"
}