{
  "id": "d758-128",
  "text": "- 2 -\nBougfe planks of Styrofoam con be finished by high speed planers.\nA planer with fix blades parallel to the axis, rotating ot 3,600 rpm.\nIt suggested for chit operation.\nSymmetrical ohjacta such aa balla and balla art formed by fending\na rotating flat blada having cha doairad contour into tha foam. Brill\npraaaaa art commonly uaad for thia operation. Symmetrical objects may\nalao ba formed with tha uaa of a lathe. la forming thaaa, tha flat blada\n!■ -jm ** f •*\nboa-symmetrical piacaa way ba fonaad with ahapara, routara,\nsenders, milling mnchines, multiple wood carving machines, or ba carvad\nby hand. Cavitiaa any ba obtaiaad with a flat blada router. Marrow c»ta\n•r alota art made with circular saws, high apaad willing toola, or dado\nbladaa.\ngtyrofoaw can ba purchaaad in varioua alaaa and ahapaa at waay\nluwbar atoraa. (For aiaaa and pricaa, contact Tha Bow Chawical Cowpany,\nPlattlea Salta, Midland, Michigan). Factory produead board* art ideal\nfor vortical flata and ara light enough to ba *uapandad by awall wiro or\nstring. They can ba atacked and uaad for atope, (Cautions Stepe ahould\nbo cavnrad with plywood or towparod hardboard *uch aa Maaoclta if they\nara to ba uaad frequently), and they ara ideal for fabricating nodala,\nt** loee rounh fiolehed, glvn a pleaearr. textured\nappearance. Thair ai*o allowa one’s iwagination and creativity to produce\nunlimited ahapaa and foime. Tha pleetic quality of Styrofoam allowa it to\nba uaad and routed. It reaiete penetration by wator. Thue it it aaaily\nand quickly changed from color to color and from deelgn to deeign by\nwater boat paint. Various piacaa of complicated modele can ba aacurad by\ntha uaa of a good wood glue. Tha rough treatment that propartiaa receive\nin a talaviaion etudio makee repair work eeeeatial, but repairing Styrofoam\nla relatively ethple and aaay by ualng wood glue and toothpicke.\nStyrofoam hea other uaee: 1. insulation. 2. buoyancy. 3. display\nand packaging material. 4. plaatar beat. 5. core material la sandwich\nconstruction. Tha key characteristics of Styrofoam ara axealiant thermol\ninsulation and resistance to water and water vapor. Probably the moat"
}