{
  "id": "d758-14",
  "text": "1\n-10-\nIn obtaining renewals and In developing new circulation, the\nassociation can use many of its non-magazine mailings so that the\ncirculation effort can get a “free ride***\n4* Reorints. As part of the acknowledgment when an article\nis scheduled for publication, the managing editor can notify the\ncontributor of the cost of reprints. Wide distribution of reprints\nis good promotion for the magazine and enables it to reach a wider\naudience at no cost to Itself. In addition, reprints furnish an\nadditional source of revenue to the printer and so contribute to\ngood relations between him and the magazine. Each reprint should\ncarry a notice of copyright.\n5o Mailing protection. When the budget allows, the magazine\nshould consider adopting either an envelope or wrapper for protection\nin the mails. For a few extra cents a copy, the magazine can\nguarantee the larger investment In production by making sure that\ncopies reach the readers in good condition.\nCRITIQUE OF NAEB-PRODUCED ISSUES*\nWe are delighted with the improvement In the magazine, especially\nsince production costs are roughly 4o per cent of what they were\nduring X955“56* The improvement results, we think, from the\nchange to black Ink, cleaner and more attractive typography, and more\neffective pacing and layout. A primary cause of this improvement\nno doubt is the centralization of editing and production.\nHowever, we still see certain opportunities for further\nimprovement s\n1. The managing editor must keep a close check on\nthe printer to assure a satisfactory quality of engraving. While\nthere has been some Improvement since the dreary plates of the\nOctober issue 5 continued improvement demands that the printer be\nprodded constantly.\n2. The magazine should use a standard authority to\nachieve a consistent style. Suitable guides are the University of\nChicago Press Btylebook and Skillin et al., Words into^fypio\n3. The editors should keep a close eye on editorial\nbalance. The November issue was especially poor in balance, since\nit carried only four major articles. We suggest that the editor-\nin-chief and editorial board note our recommendation for article\nlengths and try to have writers observe them.\n4. We object to the non-functional subtitles on some\ntwo-page layouts (e.g., October Issue, pp. 12-13). For our\nsuggestions, see the attached layout.\n5. The magazine should carry slightly more expanded"
}