{
  "id": "d758-140",
  "text": "MICHIGAN STATE UNIVERSITY east lansing\nCOLLEGE OF COMMUNICATION ARTS • DIVISION OF MASS COMMUNICATIONS • DEPARTMENT OF TELEVISION AND RADIO\nHuron 9, 1963\nDear 5b?ank:\nIs my face red? I am terribly embarrassed. Running through\nmy personal file(which is stacked high) today, I came across\nyour questionnaire about the Journal. You deserve better\nservice and more consideration from your old friend and ad¬\nmirer. All I can say is, that Leo Martin has been on sabbatical\nleave this year and I have had double duty,and I have let my\npersonal correspondence pile up. I doubt if I have many of my\nold friends left, because I have been so neglectful.\nIs it too late for me to try to answer the questionnaire? If\nnot,Ifll give it some time next week and give it my best\njudgment. I was sorry that you felt it necessary to resign as\nChairman of the Committee, but I knovtf how you feel. I want\nto get rid of some committee assignments myself and have more\ntime to write. All my life, it seems, I have been afflicted\nwith \"committeeitus\".\nFred Siebert got off to Europe the other day. He and his wife\nwill be away for two months* Jonn Marston will be holding\nforth for the period as Acting Dean. Things seem to be going\nalong here pretty well. I have been asked if I would be\ninterested in a $19,000 job in another institution, but I am\npretty happy here with less money,aand when you get passed\nfifty, you need tnink pretty hard before making a change. The\npeople I work with here are pretty fine people and I do get\na lot of satisfaction from my associations and work. But, of\ncourse, filthy lucre has its attraction and its kind of nice\nto think what you could do with a little extra money.\nHope you and your family are well. Do you plan to be at the\nChicago meeting? (Why, of course, I am looking at the program\nand see your name on it). I hope we can get together for a\nsession and T,twist the tail of the cosmos11 in this age of\nsatellites.*\nSincerely\n* Say, that’s a h-11 of a figure to conclude a letter. Sound’s\nlik, higii school oratory."
}