{
  "id": "d758-144",
  "text": "1346 Connecticut Avenue, N.W.\nWashington 6, D. C.\nPhone North 7-6000\nVolume II No. b\nApril 1963\nRes tructuring\nThe staff and the Planning Committee of the Board, is now working on a general\nplan for reorganizing the Association in an attempt to develop a structure which will\nprovide for more adequate representation of various interest groups, involve indivi¬\nduals in their area of concern, and afford more self-determination by the various\ncategories of membership in the advancement of their particular interest.\nI have had the opportunity now to \"try out\" several versions of this general\nplan on Regional Meetings II, III, and VI and the Affiliates ETV group. Although\nthere seems to be common agreement that some changes are needed, there is none on how\nthis should be done. Understandably if you make a confusing presentation, you can\nexpect a confusing reaction. It is clear to me now that the preliminary proposals\nwere too amorphous, too complex, and too pretentious. We must now lay out a definite\nblueprint, complete with full \"specs,\" cost data, and illustrations of how such a\nstructure would operate and what precise purposes it would serve.\nSuch a plan will be prepared for submission to the Board for consideration in\nJune. The plan, as adopted by the Board, will then go to the Constitution Committee\nfor translation into constitutional changes. The proposed constitutional changes will\nthen be distributed to the membership for study in preparation for a vote at the\nconvention.\nThe Multiplied Individual\nIt’s one thing to write a prescription; it*s another to get it filled.\nAs an association executive, I*m acutely aware of the problem that is posed by\nthe tendency of members to think of themselves as one group and their officers as\nanother; \"they\" and \"we\" rather than thinking in terms of \"us.\" It's our Association\nand. what it accomplishes is only through our cooperative effort. True, in any organ¬\nization this large, there are people who have conflicting interests, who want to be\nsatisfied, and this frequently must be done by having them translated into a general\ngood. This means extensive discussion must precede major decisions; it means there\nmust be organizing and coordinating efforts of many people, but all with the aim of\ngroup betterment. By advancing the group cause, we can best fulfill our individual\npurposes."
}