{
  "id": "d758-145",
  "text": "-2-\nIt* s true that we emphasize in our society individual effort and voluntary\naction. Yet all of us, as individuals, belong to various groups. And the effective¬\nness of these groups determines to a large extent the degree to which the individuals\ncan function adequately in their work and have an environment which permits them to^\nachieve the fullest development of their professional potential. Individual partici¬\npation in voluntary groups allows people to maintain a degree of freedom and power\nimpossible for the isolated individual. Together people can accomplish projects one\nperson could not and the stimulus of the group can enhance the effectiveness and\nworth of each individual. As I said in Philadelphia, it is only through the united\neffort and individual cooperation that we, as individuals, will attain the status of\nprofessionals; it is only through the conviction and determination of the individuals\nthat we will know progress as a profession.\nCurrent Activities\nIn talks to MEB groups around the country in recent weeks, I have been describ¬\ning current activities, and, since not all of them have been reported elsewhere, I\nthought I might include some of this material here.\nOne of NAEB's traditional roles has been to insure that education's stake in\nthe electronic spectrum is preserved and protected; this year we have conducted a\nnumber of special projects of this nature. As a follow-up to the study on the needs\nof education for television frequencies and the study of educational applications of\nsatellite relays, we have been involved recently in two new projects. The first is\na pioneering achievement in the analysis of the UHF portion of the TV spectrum, to\ndetermine by digital computer methods the most efficient and usable distribution of\navailable television channels. This report shows the possibility of a saturated UHF\ntable of 2,583 assignments; this means that we have found it feasible to add over\ntwice the number of usable channels to the present table of allocations.\nThe second project is a study of technical standards required for microwave\ninter-connections for educational use.\nBy using the basic information that we have as a result of the spectrum survey\nand the knowledge which the computer has stored up as a result of the UHF saturation\nstudy, we can provide the FCC with valuable data on the problems of microwave fre¬\nquency use and assignment in relation to the needs of education.\nAnother major project, which we will be finishing this month, is a nation-wide\ninventory of professional personnel available for various categories of educational\ntelevision, together with recommendations regarding the type of training programs and\nother learning opportunities which will produce the numbers and quality of personnel\nrequired to fit the indicated needs for ETV manpower.\nIn addition to these various research projects which we have been carrying on\nunder contract, we have been doing some informal research. We recently completed a\nsurvey of all state ETV agencies to determine what funds might be lost to ETV if the\nsupplemental appropriation for the ETV facilities act is not passed at this session\nof Congress."
}