{
  "id": "d758-147",
  "text": "Seminars\nAs an earnest of NAEB's interest in the rapidly expanding area of instructional\n■broadcasting (particularly closed-circuit TV), the NAEB will hold a conference on\nInstructional Broadcasting at the University of Illinois, May 12-15* This meeting\nwill include formal papers, group discussions, and an opportunity to see and hear\nout-standing examples of instructional radio and television programs. The Steering\nCommittee will meet in Chicago April 8th to work out details.\nWe are also making tentative plans for an educational radio- seminar at the Uni¬\nversity of Wisconsin toward the end of the summer* Whether this goes forward will\ndepend largely upon the degree of interest registered. An exploratory committee has\nbeen appointed to determine the feasibility of following through.\nETV Appropriations\nAs we \"go to press,\" the HEW people have just concluded an appearance before\nthe Senate Subcommittee on Deficiencies and Supplements (requesting $2 million for\nfiscal 1963). They will be heard before the Senate Subcommittee on Labor, Health,\nEducation and Welfare (requesting $7 million for fiscal 1964) tomorrow (April 3rd).\nOn March 19 and 22 hearings were held before the opposite number committees of\nthe House. The presentation was made by Ivan Nestigon, Undersecretary of HEW,\naccompanied by John Bystrom, Assistant to the Secretary (for TV).\nIn my judgment, there is basis for cautious optimism, especially from the stand¬\npoint of the early scheduling of the hearings. One of the major concerns about the\nsupplemental was that the hearings on this request might be held so late in *63 that\nthere would be no point in appropriations to begin a new program at the tag end of\nthe old fiscal year.\nHEW officials estimate they could get out materials within 30-45 days after\nfunds become available and could begin making grants within 60-90 days later to\nsome applicants in favorable position, i.e., appropriate FCC authorization, available\nmatching funds, and no competing application or unfavorable comment from their state.\nDates and Events\nApril 18-20\nApril 20-26\nApril 22-23\nApril 24-26\nApril 28-30\nAlpha Epsilon Rho Convention, Hotel President, Kansas City, Missouri.\nBAVI Convention, Denver, Colorado.\nConference on Broadcasting and Mental Health, Hotel Thayer, West\nPoint, New York.\nU. S. National Commission for UNESCO, Washington.\nETV and Higher Education—Airlie House, Warrentown, Virginia.\nSponsored by JCEB and ACE."
}