{
  "id": "d758-149",
  "text": "1346 Connecticut Avenue, N.W.\nWashington 6, D. C.\nPhone North 7-6000\nVolume II No. 5\nMay 1963\nFlorence Agreement\nThings are finally moving on the implementing legislation which will allow the\nU. S. to ratify, at long last, the Florence Agreement.\nThe major purpose of the Agreement, as you recall, is to make it easier to import\neducational, scientific and cultural materials. It reduces tariff and trade obstacles\nto the international circulation of these materials, permitting organizations and\nindividuals to obtain them from abroad with less difficulty and at less cost. It is\nof importance to educational broadcasters, because the Agreement provides for free\nimportation of materials, including, in addition to publications and documents, works\nof art, scientific instruments or apparatus, and articles for the blind, visual and\nauditory materials of an educational, scientific or cultural character.\nThe Agreement makes importation of these materials easier in three ways. First,\nit removes direct customs duties completely. Second, contracting states undertake,\ninsofar as possible, to grant foreign exchange for importation of materials covered.\nThird, it binds contracting states to continue their efforts to abolish or reduce\nother restrictions and to simplify administrative procedures governing importation of\nthese materials. Some 40 countries have already ratified the Agreement.\nThe United States participated in drafting the Agreement in 1950; it signified its\nintention to ratify by requesting that a special protocol be annexed to the Agreement\nto facilitate its participation.\nIn 1959 the United States signed the Agreement; the Senate consented to ratifica¬\ntion on May 26, i960. Draft legislation incorporating the necessary changes in the\ntariff law was then drawn up by the Department of State. The draft bill was submitted\nduring the second session of the 87th Congress by Chairman Wilbur D. Mills of the House\nWays and Means Committee. No action was taken on the bill during the 87th Congress.\nBecause of the passage of the Trade Expansion Act in 19^2, certain technical\nchanges are required in the bill before it can be submitted to the present session of\nCongress. These amendments have now been worked out and a final version of the bill\nhas been cleared for submission to Congress. Once again, the bill will initially be\nconsidered by the House Ways and Means Committee.\nWhen a hearing is scheduled, NAEB and other interested parties will be given an\nopportunity to appear."
}