{
  "id": "d758-155",
  "text": "TO:\nNAEB Publications Committee |Qcrg ^,\nfrom::\nHugh Cordier\nDATE:\nCjJp '}■.\nSeptember 19. 1963\nV» 11_ L & W1U C\nWould you please reserve 12:15—2:00 p,*m,ifY Ws&iesday, November 20,\nfor a luncheon meeting of the Publications Committee*\nWe’ll meet at the Hotel Schroeder Dining Room and, following lun¬\ncheon, adjourn to a room that will be available for our committee\nmeetingo\nThe agenda will include the following items:\n1) A proposal for a survey to determine the number of colleges\nantTmilversities tHa:; grant\"1*puGllcatTonw credit\"\"toraculty\nTor atFlmrET\nFollowing receipt of an article and bibliography from Betty McKenzie\nfor review s Presley Holmes (Ohio University} wrote as follow:\nThe thing that interested me most was in\nthe bibliography, In the ’List of Publications/\nunder BOOKS, there are two items which refer to\nseries of audio tapes (for modern language teach¬\ning).\nIt occurs to me that this could be a boon\nfor radio and television in education, if profes^\nsors are given ’publication® credit for using\nthese media0\nThis leads me to the suggestion that per¬\nhaps the publications committee could do a sur¬\nvey on this matters If there is a trend in this\ndirection we might change the old saying ’publish\nor perish® to something more up to date, such as\n’media or obitua,®\nHolisss® suggestion received an enthusiastic second from Harold Hillo\nHe stated:\nI know that there has been a great deal of dis¬\ncussion about such ’credit® being given to\nfaculty members who do air work, but nothing\nconcrete ever seems to come of it. However, I\ndo know that at Oklahoma they keep (or at least,\nused to) a record of all faculty appearances on\nthe university’s station and this is compiled\ninto a report each year and sent to the Provost*\nI understand that there they did give ’publica¬\ntion credit® for air work,\nI believe that this would not only fall within\nthe purview of the NAEB Publications committee."
}