{
  "id": "d758-156",
  "text": "but I also believe that it is going to take\nsome prodding by department heads like your¬\nself to make much headway with university\nadministrations in this regard0 I hope that\nsomething fruitful can come of this — it\nwould certainly make it a lot easier for our\nstations to get faculty agreement to appear\non the air*\nAlso in response to Pres Holmes* letter, James Fellows reported:\nI have asked Ru Hill at Syracuse Uni¬\nversity to send everyone copies of a Syra¬\ncuse University publication which does this\nvery thing, including not only radio and\ntelevision but music, art, preparation of\nspecial papers to be presented at profes¬\nsional meetings and other related material*\nThere is certainly room for additional\nstudy of whether this occurs at other uni¬\nversities* Off hand, the chances are probably\nagainst it, but the Syracuse University effort\nmay stimulate some interest on the part of\notherso\n2) A proposal to use the January-February issue of the NAEB\nTournanis’ a yearbook*\nIn response to Betty McKenzie?s memo of September 10, I forwarded\nthe following comments to Harold Hills\nHere*s a predicament for you! I enthusiastical¬\nly support the proposal for a NASB Yearbookf but\nI*m not the least bit enthused about Sacrificing\none issue of the Journal for this purpose*\nInstead, would it not be feasible to use the\nbudgets presently allotted the \"Directory of\nInstitutional Members\" and the \"Annual Report\"\nas the basic budget for the proposed Yearbook?\nThe materials from both of these publications\nare naturals for inclusion in the Yearbook*\nGranted, the combined budgets woulTUe'Tnsuf-\nficient to initial3.y include all the items sug¬\ngested in Betty McKensie* s memorandum of Sep¬\ntember 10. However, It seems to me that a\npriority-rating could be assigned to each of\nthe items* Then, as increased income from the\nsale of advertising space *fattened* the budget,\nthe total scope of the Yearbook could be enlarged\nin a gradual, pre-deteraThed fashion*,\nHarold, I must confess that, as yet. I?m not\nfamiliar enough with the total publications pic®*\nture to evaluate the practicality of this counter¬\nproposal* However, if it is practical, we would"
}