{
  "id": "d758-164",
  "text": "November 9, 1964\nTo 5 Members of NAEB Publications Committee\nPromt Betty McKenzie\nRet Committee meeting at 40th NAEB convention in Austin\nThe committee met on Monday evening, October 26, at the Drlskill Hotel,\nPresent were Rudy Bretz. Presley Holmes, Wayne Bundy, and Ron Stewart\n(representing Len Press) from the committee? Dr. Patricia Grinager from\nthe University of California Medical Center, Stanford, observing? and\nBetty McKenzie. In the absence of Chairman Cordier, Rudy Bretz chaired\nthe session.\n1. Cover design for NAEB Journal. Those present discussed the present\ndesign and lookedat several sketches submitted by various persons.\nConsensus was that the present design should be ohanged, but not\nto any of the submitted designs. It was suggested that we have a\ncontest, inviting sketches fro® the membership, the winner to be\ndecided by the committee, and the winner to receive a token of\nsome sort—perhaps a year’s membership in the NASB. This will be\ndone, with the announcement appearing probably In the Nov-Dec\nJournal* and also in the Deo Newsletter.\n2. NASB Newsletter. Consensus of the group was that the Newsletter is\nfine as is, is easy to read, and does the job it is Intended to do5\nas individuals those present said they read it when it arrives,\noften acting upon suggestions there—by sending for publications\nmentioned etc. The group definitely felt that the format of the\nNewsletter is preferable to that of the Washington Report.\n3# Journal columns. Consensus of the group here was that the columns\nshould be continued and expanded—that there is no other place in\nany other journal for the kind of information presented In the\ncolumns9 and that this is where such information belongs.\nSpecifically*\na. Production Porum—O.K. Those present look at this column\nespecially, and feel it does a good job. If the column didn’t\nexist, it would have to be invented.\nb. Program Reviews—Good idea. Would like a little more serious\ntone than the * cute ness11 of the first one.\nc. Teaohing..»by Television—O.K. Keep it and suggest writing to\nstation managers perhaps to get more of these - and perhaps also\nto get articles written by classroom teachers as well as studio\nteachers.\nAfter this meeting, at the convention, suggestions were made for\ntwo other columns, which we hope to present soon*"
}