{
  "id": "d758-168",
  "text": "4) Nhile strongly endorsing the Yearbook concept, the Committee unanimously\nrejected the proposal to use the Jam^^^ebruary issue of the NAEB Journal for\nthat purpose#\nKith the diversification of interests and the tremendous growth in total\nmembership* the current sis issues may soon be inadequate*\nTim Committee recommended that the proposed Yearbook be financed by (a) the\nbudgets from miscellaneous HA.EB annual publicationFm^*(b) Income from advertising\nin the Yearbook#\n5) The Committee umnimousXy approved a motion to increase Hie subscription\nrate from $h*GO to $6*00 a year.\n6) The Committee approved the publication of the Xnschool Broadcaster\nnewsletter by the Radio Network School Committee.\nFoUoxdng publication of Vol. I, No* 1, October, 1963, James Fellows stated:\n•••••it has suddenly occurred to me that with all good intentions,\nthe Radio Network School Committee may be undertaking a project which\nshould have cleared with the Publications Coranittee, or certainly with\nyou as overall Publications Editor* The Newsletter itself, which we\nwould like to have as an occasional publication developed by th© Radio\nNetwork School Ccmittee, explains Hie function that we have in mind\nand Hie method for getting information*\nI would kind of like to have your reaction before we pursue\nthis any farther, and I am sorry that I didn’t think to check with\nyou on this sooner*\nReacting favorably to Fellows5 inquiry, the Publications Cosnsaittee, however,\nrecossaendsd that original copies of each issue of the Xnschool Broadcaster (or\nany other special interest newsletter) be forwarded to^tliG^^^ilTcaSions^ESitgs? «\n7) The- CoisaitieG unanimously approved th© following statement of th©\ndivision of publications responsibility:\na) Broad general policy (what publications there should be, how\n1,T often ^ch snoula appear, budgetary limitations, advertising\npolicy, staff appointments, other considerations regarding\nth© place of publications in the overfall NAJ3B picture) *\nShould be decided by Board ©r Officersa on advice of Publications\nGoiiS^toQ and staff*\nb) Execution of general policy (wliich should be clearly defined\nSITplans, general content, general format,\ngeneral tone of each individual publication)*\nShould be responsibility of the editor^inM^hief of each publication*\nHemay delegate '-the' re^onsiBili^ to oHIbr editors3Lflie~8e^ifflt»\nla can aSEso ^ek\"h©3p fr^tlFPSilcatloas l!5SE5Z%£aa*"
}