{
  "id": "d758-173",
  "text": "TO: Publications Committee members\nFROM: Betty McKensie\nAttached is a copy of the questionnaire which was distributed at the convention,\nwith tabulated results. Only 10 questionnaires were filled out and returned.\nI have or am going ahead now with soliciting articles from suggested sources. Any\nsuggestions any of you have for authors for specific articles along the lines named\n(or any other), please let me know.\nIn spite of several comments in the questionnaires about extremely short news items\nin Newsletter not being worthwhile. quite a few people have told me personally that\nthey like it this ways so Pm inclined to leave it alone for a while.\nFuture plans for the Journal look: like this at the moment:\nJan.-Feb. issue - Convention (coming out in Februaxy, because of my working on\nWashington Conference book? am trying to move the next one ahead\na little $ and thereby hope to get them coming out in the first\nmonth of the tiro.)\nIlarch-April - Have been promised articles by Magnuson (wrote Oran Harris for an\narticle givSSgTIs side of it, but haven’t heard from him* so it\ndoesn’t seem likely), Walter Emery on problems of regulation of\nbroadcasting, and Ivey on the Learning Resources Institute.\nHave on hand now articles on speech teaching via tv, the 1959 Humani¬\nties Seminar, one on new techniques for etv, a speech by Yoakam from\nIndiana University on editorialising by broadcasters.\nAlso a PR story of a station, OT-JMV, Albuquerque, that went all-out,\nand one on the Texas CCTV plans — these may or may not arrive in tins.\nMay-June - I hope to get som radio articles, May being Radio Month, as declared by\nsomebody or other. Good radio articles being hard to get, the other\n... part of the book Trill probably be devoted to Washington Conference speeches.\nOn hand I have a speech by Worth Kramer, from JJR, Detroitj one by\nMSrquerlte Fleming on the use of radio programs at the School for the\nBlind.\nPromised are articles by Bernard Jacobs (or sopioono on his staff) on\n'Chicago, and Frank vJoolsoy, on the use of two-way radio conferences\nat Albany Medical College."
}