{
  "id": "d758-176",
  "text": "i\nTYPES OF ARTICLES LISTED IDii THE JOTHRTAL: {\n1* More articles on non-school oriented broadcast activities.\n2. More articles about radio—reports on pro jamming with depth.\n3. Reviews of shows (new ones),\nlw Reviews that comment on the ability and imagination of the producers and\nthe intelligence and communication ability of the performers * should consider\nour programs as related to their network counter-parts.\nMore information on film and radio. TV is not a cure-all.\n6. Articles along the line of more accurate analysis of what makes a program\neffective.\n7. Ideas of how controversial ideas might best be presented to listeners.\n8. Those which give readers an indication of the trends in programming and uses.\n9. Those which indicate financing of educational stations.\n10. How-to-do-it articles on programs, outlined as to title* day, time, and station*\naudience* purpose* topics* format* participants* organization* production* and\nCOStB.\n11. More original articles, rather than printing speeches.\n12. Hews and articles to beep members abreast of what’s developing on all fronts?\ncreative technical, national, and international.\n13. New ideas in production and programming as well as production technique in\nradio and 77.\nTOPICS SUGGESTED FOR SPECIFIC ARTICLES*\n1. International programming.\n2. Articles on film, public service programing, any area of radio-T7 try the most\nhighly informsd writers available. Example: show John Crosby a series of LTV\nshows and ask for comment that is not necessarily kind.\n3. Interview a viewer who used to listen or watch—and find out why he stopped,\nlu Interesting and sometimes controversial ideas about educational broadcasting\n— from writers like Lee Popps tin, producers and directors of network programs:\nEdward Murrow, Walter Cronkito’s crew and other public affairs men.\n5. How-to-do-it on organization structure (TV and radio departments) - H. B. McCarty-\nArmand Hunter, John Schtjarzwaldor, Hartford Gunn, Marguerite Fleming.\n6. After Experimentation—What? \"An -emerging pattern for in-school TV instruction\nIn America.\n7. The plan for ETV nctsrorks—state, regional, national.\n8. ETV in foreign countries.\n9* Community service TV programming - by Wendell If. Williams (who did such an\narticle for Adult Education in summer 1955.\n10. An analysis of the local'public service programming of selected TV stations -\nreferred to in footnote of no. 9 article by Williams.\n11. Ned Rosenheim’s Detroit speech."
}