{
  "id": "d758-182",
  "text": "Publications Committee\nNational Association of Educational Broadcasters\nlumbers present? Rudy Brets, Hugh Cordier, Walter Baexy, Presley Holmes,\nBetty McKenzie, and Arthur Weld*\nMembers absents Patrick Hazard, Philip Lewis, P. R. MacTaggart,\nHoward Martin, and Frank Schooley.\nTh© NAEB Publications Coaanittes convened in Milwaukee, Wisconsin, November\n20, 1963, to consider problems relating to the selection of a new Journal editor;\nth® implementation of a survey to determine the number of colleges and universities\ngranting \"publication\" credit to faculty far air work; a proposal to use the\nJanuarv«5tebruarv issue of the Journal as a yearbook; a proposal to increase the\nsubscription price of the JournaTIVom $U.0Q to $6*00 a year; \"special-interest\"\nnewsletters; and a policy for publications responsibility.\n1) The Committee regretfully accepted the resignation of Dr. Walter B.\nEmery as Editor. Dr. Emexy will be on sabbatical leave from Michigan State\nUniversity during the academic year 1961**65 and it appears that a large portion\nof this leave will be spent outside the country*\nIn discussing possible replacements, the Committee selected and approved\na list of three candidates. President William G« Harley will contact the\npotential candidates.\n2) The Committee unanimously approved a motion that, in the future, the\nmembership of the Publications Committee should reflect the various interest\ngroups (W station division, radio station division, etc.) within the reorganized\nAssociation.\n3) Dr. Presley Holmes* proposal for a survey to determine the number of\ncolleges and universities that grant \"publication*1 credit to faculty for air\nwork was approved.\nImplementation of the proposal follows* Holmes will prepare the questionnaire,\n(see attached) it will be printed rather than dittoed or mimeographed, and Cordier\nwill distribute to the one hundred largest institutions with radio, television,\nclosed-circuit, or instruction film programs. The questionnaire will be\ndistributed through the membership at each institution and returned to Cordier\nfor tabulating.\nOther professional education groups (l.e., NEA, DAVI, SAA, AAUP, and the\nAPBE) interested in this problem will be infomed of the study.\nThe Committee also expressed the hope that the NAEB Board of Directors\nwill take official action on the final report, thereby developing a national\npolicy."
}