{
  "id": "d758-20",
  "text": "Publications Committee1\nNAEB\nMinutes of Meetings Saturday, May 11, 195?\n^ , JQ(%$'C\n1.\n%, ■%, ***\nPresent - Stasheff, Broderick, Dunham, Grady, Tyler, Emeryte,and Schooley\n— ..• - *.\nAbsent « Hiller, Martin, and Sulzer\nThe Committee met for breakfast In Room 310, Deshler-Hilton Hotel, Columbus\nOhio, at 8 a.m., May 11. Breakfast was informal. After breakfast,\nSchooley served as chairman pro tem, pending arrival of Chairman Stasheff\nvia delayed plane flight.\nNote. Minutes are highlights of actions and igroemente, not necessarily\nlisted in chronological order as might b© case in formal minutes.\nCommittee approved changing title of magazine to NAEB JOURNAL, effective\nwith the next volume. Committee was acting in dual, capacity as Publica¬\ntions Committee and Editorial Board for the JOURNAL. Motion was made by\nBroderick, seconded by .Emery, and passed unanimously.\nCommittee agreed that in carrying out agreement with AERT, JOURNAL sub¬\ntitle for the next year should be : ;J(Combined with AERT JOURNAL)n»\nSuggestion for exact wording was made by Dunham, and unanimously approved.\nCommittee agreed that JOURNAL contents should be professional in character,\nand should ba aimed toward emphasising the teaching tgr radio and -television\nnot teaching of radio and television. This is the special role of the\nMSB JOURNAL, Just as it has been in the past. This is not now the primary\nor exclusive role of any other publication.\nCommittee suggested where appropriate a section on authors of articles,\nbut not to detriment of publication, such as taking too much space.\nSchooley' agreed to do some promotion work for the JOURNAL through use o.f\nlibrary and school lists. This he can do with allocation for promotion\napproved by NAEB Board sometime ago. /\nCommittee members suggested occasional guest editorial In th© JOURNAL.\nIt was felt this not only would relieve Tyler from stress of regular\ncontribs, but would also offer other points of views. This Is a\npractice followed by some other professional Journals.\nIt was noted that Tyler will be in Korea much of the summer, so in order\nto keep all, and especially Tyler, abreast of JOURNAL activities relating\nto articles, that copies of, letters should always go to both Tyler and\nSchooley. Schooley advised the committee that he had NAEB Board authority\nto hire managing editor again, but that he was not sure he could retain\nthe services of Dolores Merchant Hanson®\nThe committee voted to have the chairman or acting secretary send Mrs,\nHanson a note of commendation and appreciation for her excellent work\ndone on the publication during the past year©"
}