{
  "id": "d758-21",
  "text": "afre?a ^aG Scbo?ley or -the Managing Editor would get up a page of\nto Jelatin§ to Publication, especially those relating\nlength, ana use of pictures. Pictures are desirable for cover\nand to accompany published articlesc £*\nS!S«agr?ed t0 mak@ every eff^rt to inaugurate and keep\nf™§ * feed-back column or page in the JOURNAL, This is in line with\n,madf DX !!ansori and.Pefcers^ in their study and recommendations\nfor improvement of the JOURNAL, It was agreed that each editorial board~\nmember would be responsible for two such for each issSe during the coming\nsomIor»AR^iP°nflbll^y means wrifcinS ^he *®feed-back” letter, or getting °\nsomeone else.to write it® * 6 06\nThe committee formally approved in principle, and in effect, adooted in\nfor guidance in future publication of the NAEB JOURNAL recoin*®\ni°nS made by Hanscn and Peterson. It was agreed\n^af a^taa,L Practice, in some cases, would be delayed for further develop\nment of the magazine itself, .and upSn attaining ofsubscriptions.\nthe Committee meeting was spent in considering desirable articles\nwouldUbe0rSsponslbl©?0mine ^ “* ln ■*\"•*« upo/which oo^Ztf\nEHEBI (responsible) for inviting Dr. Swanson, departing superintendent\nol School, Oklahoma City, Oklahoma, to contribute article on his ideas\nSLtTI|-57)S 0f EW 111 0klabOBa City «*«*«>« (“£° sSery^already\nDUNHAM - Hex Lambert of possible collation of radio and TV by the C3C.\nDUNHAM - Teacher College Workshop, perhaps Lewis.\nEMERX - ETV scientific areas. (EKEHI has started exploration).\nSTASHEFF - on-going reeearch activities,\nSTASHEFF - Writing projects; KcCune,\nSCHOOLEY * George Johnson on his regional III talk®\nSCHOOLEY - Masters on Georgians Center*\nSCHOOLEY - ETRC (he has it),\nSCHOOLEY - JTCETf if and when good idea comes along*\nSCHOOLEY - Hurlbert on Alabamans program; selected area®\nSCHOOLEY « architectural, .perhaps Francis G, Cornell®\nSTASHEFF - Reply to Engar, an article, not a fight-starter.\nSTASHEFF - Ethel Tinscher, Denby HS, Detroit.\nSTASHEFF - Or, Ronald Dawson (sp?), Ann Arbor®\nSTASHEFF - Simple lighting needs for vidicon*\nHELP HELP — Qualifications for good teachers via radio-T?."
}