{
  "id": "d758-27",
  "text": "To:\nProm:\nRe:\nrA\nPublications Corr.irlttee (1959)\nPrank E. Schooley, Chairmarf^^\nOperations*\n1. President-elect Bill Harley will name thoae listed below.\nI assume and trust all will be willing to serve.\n2. If you have suggestions for additional name% please let\nme know pronto.\n3. I should lilce to initiate system which will provide for\nmore editorial judgment on JOURNAL contents, if you'll ag.-ee am help,\ntoo.\nMy idea is to get reaction of committee members on articles\nsubmitted for publication. This procedure will be used wher* time\npermits. It would be by-passed where time is of the essence. I8d\ncheck articles with one or two committee members. Where time ioesnH\npermit, I'd use my best judgment (often check with Skomia and ,tillw«ll)\nas I have in the past.\n4. We still need articles on radio. I have asked Burton 'au.u\nto write one on some aspect of use of radio in Europe, or some spct\nin Europe. We have an article that Tracy Tyler solicited from\nHarold Engel on the oldest station.\n5. We need good pictures badly. We often come up to press\ntime without really good pictures. Pictures with article are always\nhelpful.\n6. By this memo, Phil Lewis is hereby requested to start his\nmonthly contribution along lines he and Stasheff and Schooley have\nhad correspondence.\n7. Each and everyone Is requested to suggest articles,\nsolicit them. Please keep me advised.\n8. I think we should also improve the JOURNAL with book\nreviews. Wegve said this before, but I find it difficult to come\nup with them on a regular basis. We811 run If we can get them.\nSuggestions?\n9. Shortly I'll Issue memo on who now gets JOURNAL, List\ncontlnuesto grow, and acceptance of publication continues to improve\nNAEB prestige. That's good, but I would like to make it better yet.\n10. Copy deadline is 35 days ahead of issue. (Nov. 25 for\nJanuary issue).\nFES\n12-17-58\nTO: Tracy F. Tyler\nGertrude Broderick\nElmer Sulzer\nEddie Stasheff\nPhilip Lewis\ncc -NAEB Board"
}