{
  "id": "d758-55",
  "text": "REPORT\nPublications Committee\nNational Association of Educational Broadcasters\nA A y\nMembers present! Rudy Brets, Hugh Cordier, Walter Saexy, Presley Holmes,\nBetty McKenzie, and Arthur Weld*\nMembers absent: Patrick Hazard, Philip Lewis, P. R. MacTaggart,\nHoward Martin, and Frank Schooley.\nTh© MSB Publications Committee convened in Milwaukee, Wisconsin, November\n20. 1963, to consider problems relating to the selection of a new Journal editor;\nthe implementation of a survey to determine the number of colleges and universities\ngranting \"publication\" credit to faculty for air works a proposal to use the\nJanuary«*Ttebruary issue of the Journal as a yearbook; a proposal to increase the\nsubscription price of the JomwtTfrom fiwOO to $6*00 a year; \"speclal«in*erest\nnewsletters; and a policy for publications responsibility.\n1) The Ccssmittee regretfully accepted the resignation of Dr. Walter B.\nEmeiy as Editor. Dr. Emery win be on sabbatical leave from Michigan State\nUniversity during the academic year I96U-6S and it appears that a large portion\nof this leave will be spent outside the country#\nIn discussing possible replacements, the Committee selected and approved\na list of three candidates. President William G. Harley will contact the\npotential candidates.\n2) The Committee unanimously approved a motion that, in the future, th©\nmembership of the Publications Committee should reflect the various interest\ngroups (TV station division, radio station division, etc.) within the reorganized\nAssociation.\n3) Dr* Presley Holmes4 proposal for a survey to determine the number of\ncolleges and universities that grant \"publication?* credit to faculty xor air\nwork was approved.\nImplementation of the proposal follows: Holmes will prepare the questionnaire,\n(see attached) it will be printed rather than dittoed or mimeographed, and Cordier\nwill distribute to the one hundred largest institutions with radio, television,\nclosed~circuit, or instruction film programs. The questionnaire wiU be\ndistributed through the membership at each institution and returned to Cordier\nfor tabulating.\nOther professional education groups (i.e., NEA, RAVI, SAA, AAUP, and the\nAPSE) interested in this problem will be informed of the study.\nThe Committee also expressed the hope that the NAEB Board of Directors\nwiU take official action on. the final report, thereby developing a national\npolicy."
}