{
  "id": "d758-56",
  "text": "li) While strongly endorsing the Yearbook concept, the Cousnittee unanimously\nrejected the proposal to use the Janua^-^^ruary issue of the NAEB Journal far\nthat purpose.\nWith the diversification of interests and the tremendous growth in total\nmembership, the currant six issues may soon be inadequate*\nThe Coranittee recommended that the proposed Yearbook be financed by (a) the\nbudgets from miscellaneous RAEB annual publications an<f (b) income from advertising\nin the Yearbook.\n5) The Committee unanimously approved a motion to increase the subscription\nrate f*om $ii.00 to $6.00 a year.\n6) The Committee approved the publication of the Inschool Broadcaster\nnewsletter by the Radio Network School Committee.\nFollowing publication of Vol. I, No. 1, October, 1963, James Fellows stated!\n• ••••it has suddenly occurred to me that with all good intentions,\nthe Radio Network School Committee may be undertaking a project which\nshould have cleared with the Publications Committee, or certainly with\nyou as overall Publications Editor. The Newsletter itself, which we\nwould like to have as an occasional publication developed by the Radio\nNetwork School Committee, explains the function that we have in mind\nand the method for getting information*\nI would kind of like to have your reaction before we pursue\nthis ary further, and I am sorry that I didn*t think to check with\nyou on this sooner*\nReacting favorably to Ibllowa8 inquiry, the Publications Committee, however,\nrecommended that original copies of each issue of the Inschool Broadcaster (or\nany other special interest newsletter) be forwarded to the !Publ±cations Editor.\n7) The Committee unanimously approved the following statement of the\ndivision of publications responsibility!\na) Broad general policy (what publications there should be, how\n” often eactTsnoul’a appear, budgetary limitations, advertising\npolicy, staff appointments, other considerations regarding\nthe place of publications in the over-all NAEB picture) •\nShould be decided by Board or Officers^ on advice of Publications\nCommittee and staffT\nb) Execution of general policy (which should be clearly defined\nand to include long«tem'plans, general content, general format,\ngeneral tone of each individual publication).\nShould be responsibility of the editor-in-chief of each publication*\nfle may r'e^onsiHll'ty 'to otEer editors if he sees fit*\nW can a3So Seek help from the !^ublicatTona Committee."
}