{
  "id": "d758-74",
  "text": "10-A Davis Avenue\nBrookline, Massachusetts\nAugust 18, 1961\nHrs. Dorothy Templeton\nTruffle Manager\nNational Association of Educational Braodcasters\n119 Gregory Hall\nUrbana, Illinois\nDear Mrs* Templeton,\nAgain I want to thank you for the loan of the 1954-1960 NAEB\nflRP.f^P'tfregf. I placed them in the nail, insured as you requested\nfwT *n ?. - - — - -——-\nTh® w*re really full of information, tiy original\nrequest was for N^jl^tjars beginning with 1948. It was thought,\nhowever, that the information for this period could be gained from\nMr. Hill’s Klstogy,, oI_the NAlp. Vhllt Mr. Hill's publicstion did\ngive us euch valuable information, there are a number of areas that\ndid not fall into the scope of his project. Such information.\nJudging from the later Newsletters should be found in the isuaes\nfrom ’948 thru 1953* Therefore I make the request for loan of this\nmaterial on the same basis, l.e. postage an, insurance both ways.\nI understand by a recent New tie t Ur that the NAJKB is coming\nout with a new publication. I do hope it can resore some of the\nchattyneaa of the older Newsletter?. The older Newsletters may not\nhave been as efficient and as businesslike as the ones in recent\nyears—but I aw spect they will yield more Information to the\nresearcher in the future. Vhy from old Newsletters I even *mew\nwhen Bob Underwood and hie family were uncUrUte \"veatfceri Just a\nf*v of the oldtime chatty columns mixed in with the rest of the\nformal featares would do wonders for the new publication. Just get\nout a few old Newsletters and see what I mean, they’re fascinating.\nI noted a few irregularities in the bound Issues which I used.\nPage 10 of the December, 1954, issue was blank. The June, 1955, issue\nwas, I bellve, misting—A duplicate July issue took its place. I\ncan't find the note I made about this last error so I may be wrong\nas to the year. And finally, the Dec ember, 19 56 .\"President's Page\"\nappears fo be missing. It may be that none appeared that month,\n■however mention was made by President Schooley*in the November issue\nof one more column to write.\nIh 1955 the Newsletter published excerpts of the Kellogg Annual\nReport for that year. If it ia possible, I would like to use the\nKellogg and any other Annual Reports which might include Network\nstatistics."
}