{
  "id": "d719-21",
  "text": "ALABAMA EDUCATIONAL TELEVISION COMMISSION\n807 PROTECTIVE LIFE BUILDING BIRMINGHAM 3, ALABAMA TELEPHONE FAIRFAX 2-4625\nCOMMISSIONERS\nREX SIKES\nLuverne\nVINCENT F. KILBORN\nmobile\n,H. MAYNARD LAYMAN\nDecatur\nMRS. BERTHA S. ROBERTS\nGadsden\nHAROLD T. PURDY\nBirmingham\nWAIQ, CHANNEL 2 WBIQ, CHANNEL 10 WCIQ, CHANNEL 7\nOctober 26, 1960\nMr. William G. Harley\nN.A.E.B.\nPROGRAM BOARD\nI. FRED SIMMONS\nBirmingham\nFRANK A. ROSE\nUniversity\nRALPH DRAUGHON\nAuburn\nFRANK STEWART\nMontgomery\nDuPont Circle Office Building\nRooms 1119-1121\n1346 Connecticut Avenue, N. W.\nWashington 6, D. C.\nDear Bill:\nHOWARD M. PHILLIPS\nMontevallo\nSTAFF\nRAYMOND D. HURLBERT\nGeneral Manager\nAL RENFRO\nChief Engineer\nCongratulations on another very successful accomplishment.\nThe NAEB Convention in every aspect was a success. You and\nyour cohorts rose to the occasion and made the convention\nmeasure for a top flight international affair.\nLOUIS PENEGUY\nDirector\nCoordination a Information\nMRS. MADGE LAW\nOffice Manager\nIt has been a privilege and a pleasure to serve the NAEB as\nChairman of the Membership Committee. I want to take this\noccasion for again commending the members of the committee\nand the headquarter's staff for assisting in any progress made.\nPersonally, I feel that two years as chairman of an NAEB com¬\nmittee can pretty well absorb any individual's ability to contri¬\nbute; therefore, I request that the assignment not be repeated as\nfar as my case is concerned. I hope this is not presumptuous\non my part that you would even consider such, but it is intended\nas a suggestion in the interest of our association. My personal\nattitude in this respect does not apply to individual members of\nthis committee for, in certain instances, they have developed\ntechniques and skills that might well serve to chair the com¬\nmittee itself. Ted Sherburne comes to mind as one such member.\nMy attitude on the chairmanship of the Membership Committee\ndoes not hold when other services to the NAEB are concerned. I\nsay this in a sense of loyalty to the NAEB, but in no wise as a\nrequest. Please know that I am at your service.\nPlease confirm the verbally made engagement for the NAEB Region 11\nConference. As you may recall, you were agreeable to speaking\nat the Professional Breakfast of NAEB Region 11 Conference to be\nheld at the Atlanta Biltmore Hotel, Saturday ,morning, April 22,\n1961, at 8 a.m. Your appearance on this occasion will add much\nThe nation’s first educational television network with programs originated by University of Alabama, Auburn University, and Birmingham\nArea Educational Television Association"
}