{
  "id": "d719-26",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF THE REGIONAL DIRECTOR\nTelevision — Region VI\nSeattle, Washington\nNovember 8, I960\nToi\nMembers of NAEB Television Board\nFrom* Loren B. Stone, Chairman\nThose of you who attended the recent meeting of the managers of stations\nwith NETRC at Palo Alto may recall toe discussion about problems of\nlabor contracts and toe desire expressed that information on existing\ncontracts and practices be exchanged between stations*\nIt was agreed that thismatter wasnot one affecting toe relationship of\ntoe stations with the Center and that it would be better to have toe\ninformation pulled together under the auspices of the N&EB TV Board\nthan through the Center Affilliates* Committee*\nI am in receipt of a letter from Jack McBride, who as chairman of the\nNAEB TV Planning Committee passes along a request of that committee that\n\"as proposed at Palo Alto\" the TV Board request Morris Novik, NAEB union\nconsultant to compile information and disseminate it to the stations*\nIt was not my recollection of the concensus of the Palo Alto discussion\nthat Novik was to be asked to do this job*\nI am mindful of the furor created a few years b ack when information on\nwage rates paid engineers was distributed to station engineers wa well as\nto management, and had thought that since there still appears to be strong\nfeeling on the need to keep this exchange of information closely controlled\nand exchanged solely between station managers, it might be desirable that\nI, as chairman of the Television Board, personally undertake to gather\nand distribute the information*\nI would appreciate your suggestions as to how we should proceed*\nShould the TV Board ask Morris Novik to prepare a summary of existing\ncontracts and practices among television stations?\nShould the TV Board request the NAEB staff to prepare the information?\nShould the TV Board itself, acting through its chairman, collect, compile\nand distribute the information?\nAny other suggestions?\nccs Bill Harley"
}