{
  "id": "d719-39",
  "text": "An Investment nr the People—Ss ucattonal Television - Page $\nSHOULD WE NOT TEST THE POTENTIAL IN EDUCATIONAL TELEVISION,\nAND ITS ABILITY TO BRING INCREASINGLY VALUABLE DIVIDENDS?*1\nDonald ff. He Gann on, president, Vnbtingho use Broadcasting\nCo. HAD THIS TO SAY?\n,fIr IS AN INTERESTING THING ABOUT EDUCATIONAL TELEVISION,\nTHAT WHILE IT IS IN THE SIXTH ACADEMIC YEAR AND REPRESENTS A\n$60 MILLION INVESTMENT, IT HAS ACHIEVED THE OUTSTANDING GOALS\nIT HAS, BUT TAR MORE LIES IN THE FUTURE THAN IN THE PAST. As\nI HAVE INDICATED, I BELIEVE THAT TO BE TRUE OF TELEVISION IN\nGENERAL BUT THE EDUCATIONAL PHASE REPRESENTS A DIMENSION WITH-\nOUT WHICH THE MEDIUM CANNOT ACHIEVE ITS TULL POTENTIAL OR\ncapacity. Commercial television as a medium ot entertainment,\nINF ORA MTI ON AND A D VERT I SI NG REQUIRES THE PURE RESEARCH AND\nLABORATORY TECHNIQUES AND OPPORTUNITIES OT EDUCATIONAL TELE¬\nVISION, WORKING HAND IN HAND TO ACHIEVE THE DEGREE OT FULLER\nENLIGHTENMENT EVERY ONE OF US IN THE INDUSTRY FEEL CAN AND\nEVEN MUST BE ACHIEVED. MUCH HAS BEEN ACCOMPLISHED IN LESS\nTHAN A DECADE BUT PAR MORE NEED BE ACCOMPLISHED IN THIS WORLD\nOF NUCLEAR PHYSICS AND INTERNATIONAL HYPERTENSION.\n\"In other more blunt words, get the educational station\nON THE AIR IN ORDER THAT THE WHOLE EVOLUTIONARY AND DEVELOP¬\nMENTAL PROCESS OF QUALITATIVE PROGRAMMING CAN BE UNDERTAKEN\nAND PERFECTED. THE LONGER THIS IS DELAYED, THE LONGER THESE\nVITAL FREQUENCIES ARE LEFT UNUSED, THE LONGER THE AMERICAN\nPEOPLE ARE DEPRIVED OF SUCH EDUCATIONAL OPPORTUNITY: YES,\nTHE LONGER OUR ALREADY STRAINED EDUCATIONAL SYSTEM AND OVER¬\nBURDENED MUNICIPAL FINANCES ARE DENIED THIS DYNAMIC AND COL¬\nLATERAL aid. Then, too, will our ability to achieve the bless¬\nings AND OPPORTUNITIES OF THE ULTIMATE PUBLIC SERVICE EDUCATIONAL\nSYSTEM BE FORESTALLED.\nnThe United States must improve and increase the use of\nALL EDUCATIONAL MEANS AT OUR DISPOSAL BUT SURELY TELEVISION\nAND RADIO, OCCUPYING SO PROMINENT A PLACE AMONG THE INTERESTS\nOF OUR PEOPLE, HAVE A GREAT OPPORTUNITY AND A STILL GREATER\nOBLIGATION IN THIS REGARD. *\nMany other prominent officials of public and private\nINSTITUTIONS GAVE SIMILAR TESTIMONY IN SUPPORT OF FEDERAL PAR¬\nTICIPATION IN THE PROMOTION OF EDUCATIONAL TELEVISION BROAD¬\nCASTING. It is my belief that it is only a question of time\nbefore public demand will bring about a more complete USE OF"
}