{
  "id": "d1699-1",
  "text": "commercial broadcasters, reserved Ch 48 in State College, Fa., was exchanged for Ch\n69 and reserved Ch 24 in Baltimore was exchanged for Ch 66. In Columbia, S. C.,\nresolved Ch 19 was exchanged for Ch 31*\nThe Nebraska Council for Educational Television has asked the FCC to allocate\nCh 4, 3, and 8 to Kearney, Bassett, and Albion respectively and reserve them for ed¬\nucation, and in addition to reserve Ch 13 and 9 in Alliance and North Platte. This\nschedule is essential to their state ETV plan, which has been carefully engineered.\nCommercial interests have filed counter-proposals.\nOgden, Utah, which is now operating on ETV Ch l8, has requested Ch 24 for addi¬\ntional ETV service.\nWHYY, the ETV operation in Philadelphia, which is competing in an assignment\nhearing with several commercial interests for Ch 12 Wilmington, won an important\npoint this past week. The FCC ruled that \"WHYY should be afforded an opportunity\nto show that the area to be served has need for a specific type of programming; that\nsuch need is not being met by the programming of existing stations; and that it\nwould serve such need better than the other applicants.\" This, in effect, recog¬\nnizes at long last that the educational and cultural needs of the community are on\na par with the entertainment needs I\nNEW COMMISSIONER OF EDUCATION\nThe new Commissioner of Education, Sterling M. McMurrin, is a firm believer in\nfederal aid to education and has been a good friend of educational television. As\nvice-president of academic affairs at the University of Utah he has been the admini¬\nstrative officer to whom Keith Engar, manager of Station KUED, reports, and he has\nshown a sympathetic interest in the university’s television development. McMurrin,\na philosopher by profession, served as a consultant to the Fund for the Advancement\nof Education in 1958.\nJCET to JCEB\nAt a meeting here (Feb. 2) of the Board, the reorganized and reconstituted\nJoint Council added educational radio to its concern for ETV and adopted the new\nname of Joint Council on Educational Broadcasting. David Stewart, formerly Execu¬\ntive Director of JCET, was named Secretary of JCEB.\nUnder the new arrangement the JCEB will continue to represent the educational\nestablishment in policy determinations relating to educational broadcasting but,\nother than a secretary, will have no staff. Staff functions are being assumed in\na cooperative arrangement by the U&shington offices of the NAEB and NETRC.\nJCEB members are the American Association of School Administrators, American\nAssociation of Land-Grant Colleges and State Universities, American Council on Edu¬\ncation, Council of Chief State School Officers, National Association of Educational\nBroadcasters, National Educational Television and Padio Center, National Education\nAssociation, and State Universities Association.\nNASBINOTON NETWORK ACTIVITY\nSee story elsewhere in this Newsletter. We welcome suggestions for develop¬\ning the tremendous potential here. Your perspective out there will frequently be\nbetter than ours here."
}