{
  "id": "d1528-0",
  "text": "M.A.f.B. MEWS LE'f'ffJl\nOffice of Executive Secretary\nUniversity of Illinois\nUrbana, Illinois\nMarch 15, 1938\nRCA WILL PERMIT PLAYING OF RECORDS\nYour secretary wrote RCA asking an exception for educational radio\nstations with reference to broadcasting of phonograph records. The\nletter speaks for itself, so I quote it:\n\"So that you may be completely advised concerning the broadcasting of\nrecords of our manufacture, I am enclosing copy of a letter dated\nJanuary 4 which was sent by us to all broadcasting, stations.\n\"To those stations who have written us requesting further information\nregarding the possibility of continuing the broadcasting of Victor\nand Bluebird records until such time as definite license agreements\ncan be worked out, we have replied per the form of the other letter\nenclosed.\n!{If any educational radio station desires to continue to use our re¬\ncords on their programs, we suggest that you advise them to write us\nrequesting copies of the agreements forms identical with those en¬\nclosed herewith.\ni!Upon receipt of their request, we shall be very happy to send them\ncopies which they may sign and return to us thereby giving them our\nassurance that until further notice use by them of oqr records will\nnot be made the basis of any action against them by us.\nCordially yours,\n(SIGNED) W. W. Early\nAss’t. Mgr. Recording and\nRecord Sales'*1\nThe enclosures were those received by every radio station, so will\nnot be copied here. It is significant to note, if you have not al¬\nready acted, that you may receive permission to use RCA and Bluebird\nrecords. NAEB has requested RCA to make special exception for educa¬\ntional stations if and when the license agreements are worked out.\nNo work has been received from DECCA, Inc.\nSTILL MORE ABOUT RECORDINGS\nFrom New York comes word that James Petrillo, head of the Chicago local\nof the American Federations of Musicians, will be offered $100,000 as\nan initial fee to direct the campaign of the National Association of\nPerforming Artists in its campaign to prevent use of recordings with¬\nout payment of royalty."
}