{
  "id": "d1862-11",
  "text": "-11-\nMr. Cassirer also suggested that we should be aware of the\ngreat influence abroad of every U. S. television program,\ndevelopment, or trend. Pressure toward the lowest common\ndenominator exists everywhere, not only in commercial systems.\nTherefore the way in which educational radio- and television in\n.America go about their task is watched with great interest\nabroad. Finally Mr. Cassirer helped explain the mistake we\nall so often make in identifying radio and television’s total\naudience, (made up of many small minority-interest groups)\nwith a single majority or mass audience. We were pleased to\nnote that the Associated Press devoted considerable space to\nMr. Cassirer’s talks.\nWhile we ’re in a serious note I would like to mention the\nincreasing concern I have picked up at conferences of educators\nand science groups with regard to the extent to which we are\nlagging behind Russia, particularly, in the manpower we are\nturning out with technical training.\nOne speaker asked whether the compromise or ’’adaptation”\nwe have had to make to shortages of skilled personnel in the\nsciences and engineering has not caused a high degree of me¬\ndiocrity to be built into our supply also? Are we really as.\nsuperior as we think? Some figures given indicate that Russia\ngraduated 62,00C engineers in 1954, 72,000 in 1955* and will\ngraduate 100,000 in I960. Many of this growing supply will be\n’’available for export,” complete with propaganda mechanism\nand all the other skills that will facilitate the spread of the\nCommunist philosophy throughout the world.\nScience is then definitely one area to which we, as educa¬\ntional broadcasters, should be turning our attention. The\ngrowing shortage of school space and supply of teachers, as\nwell as the status and salary of teachers, if this shortage\nis to be met, is another.\nIt was nice to see many of you at the Institute. I hope\nwe may see nearly all of you at our Atlanta Convention October\n15-13. The Center Affiliates plan to meet immediately follow¬\ning our Convention in Atlanta, the Convention will be proceeded\nby the NAEB Board meeting, and some other groups and committees\nare also planning to meet in conjunction with it. Many of the\nsort of things that are difficult to put into writing, and\nwhich I probably should not attempt to set down, can be better\ndiscussed at our national convention, and, as mentioned earlier,\nparticularly at our regional meetings. Let me, then, once more\nurge you to try to attend the regional meetings, for which we\nhave funds from our W. K. Kellogg Foundation grant to pay ex¬\npenses for one representative of each Active and Associate\nmember."
}