{
  "id": "d1862-14",
  "text": "General Offering. We sincerely hope that the summer of¬\nfering now in your hands is satisfactory. In glancing over it,\nhowever, I think you will agree with me that one troublesome\nfact stands out: the lack of balance between the number of\nseries from MEB members as compared with the number of NAEB\nstations supplying those series. We would like to see more\nNAEB stations participating in Network offerings. This, as I\nunderstand it, is one of the primary purposes of the Network:\nto provide an effective means whereby member stations may\nexchange urograms. I realize that small stations encounter\nnumberous difficulties in putting together a series suitable\nfor Network use. But wouldn’t it be nice if each station could\nsupply at least one series a year? I don’t believe that that\nideal is too far out of the realm of possibility. I do think\nit to be a worthy goal, well worth working for. Do you suppose\nwe could try it out?\nOperation ^Panorama” The NAEB, in cooperation with the\nUnited States Information Agency, is seeking to initiate a\ncontinuous series of five minute interview programs for world\nwide distribution. The purpose of the series is to infora\nforeign listeners as to what Americans from all walks of life\nare thinking and doing.\nIt is most important that we receive contributions from\nstations in all parts of the country so that we can mark the\nseries as being truly Americana. We would like each station\nto arrange interviews with local educators, farmers, merchants,\nindustrialists, laborers, etc. and get these people to discuss\ntheir local problems and how they are solving them.\nWe urge all stations to begin work on this project as soon\nas possible, as this type of program is needed to increase\nworld understanding of the American way of life. Also, this\nproject will get us started on the road to repaying the many\ncourtesies we have enjoyed from foreign broadcasters.\nFor details concerning this project, see the memo dated\nApril 26, 1956 from the Network Manager. If you did not\nreceive this memo, please write us and we will send you one.\n— Bob Underwood\n***-**-\nWaldo Abbot, Director of Broadcasting, University of Michi¬\ngan, missed the IERT for the first time in many years. Waldo\nis now recovering from a slight stroke he suffered during March\nand is planning to make up for the IERT miss at the NAEB Con¬\nvention in October at Atlanta."
}