{
  "id": "d1862-16",
  "text": "-16-\nassignments and a bibliography. They normally print 300-400\ncopies of each study guide. Since there is little contact\nbetween the students and the instructor, they feel it is neces¬\nsary to have two to three times as much written work required\nas for the same course taught on the campus.\nAt the same time the manual is being prepared, the in¬\nstructor is working with the chairman of the department of\ndramatic arts, or one of his assistants, on the use of the TV\nmedium, (in 1942, the chairman of the department of dramatic\narts started experimenting with TV techniques and formats.\nBefore there was a TV station in Cleveland, he was taking pro¬\ngrams to Schenectedy. As soon as Cleveland got a station, the\nstation used this man as an advisor.) WEWS furnishes the crews\nfor the telecourses, but production and direction are done by\nsomeone from dramatic arts. No attempt is made to stage an\nelaborate production. They feel they are putting on a univer¬\nsity lecture course, not a \"show.\" Of course, some of the in¬\nstructors make very good use of visual aids and \"gimmicks”\nbut others use nothing and just stand and talk. Each telecourse\nruns for the regular 15 weeks of the academic semester, and there\nare 45 lectures. There are no rehearsals of the presentations.\nNormally the instructor goes to the station 20-40 minutes before\nair time to discuss use of visual aids, etc. He gives the pro¬\nducer a rough run-down sheet indicating approximate times\nthat different aids will be used, or he!ll get up and go to\nthe blackboard, etc.\nPromotion and publicity — the University has prepared a\nmineographed sheet of information to send out in response to\nrequests, by phone or mail. The telecourses are listed in the\nTV sections of the Cleveland papers, under \"Best Viewing for\nthe Day,\" and, due to their morning time, appear at the top of\nthe list. Brown feels this has been helpful. All public\nlibrarians within range of the station are sent a bibliography,\nplus a supply of the mineographed announcements. The libraries\nnormally make a display of the books involved, with an announce¬\nment.\nRegistration — Students may register by coming to the\nregular University registration, by coming to Brown’s office,\nor by mail. If a new student, who hasn’t been registered\nbefore, writes in, he is called in for an interview. If a\nprospective student is registered in one of the other under¬\ngraduate colleges of the University he must get permission\nfrom his Dean or advisor before he can take the telecourse.\nStudents registering for the telecourses must pay the regular\nUniversity fee which is $22 per credit hour - -thus $66 for the"
}