{
  "id": "d1862-2",
  "text": "Radio ’’firsts” were awarded to the University of North\nCarolina for ”American Adventure;” the University of Chicago for\n’’The Sacred Note;” Illinois Institute of Technology for ’’Ear\non Chicago;” WOI, Iowa State College, for ’’The Fourth ,R’;”\nWNYE, New York Board of Education for ’’What Would You Do?”,\n’’Hands Across the World” and ”To Continue the Story;” The Uni¬\nversity of Texas for ’’Behind the Scenes,” ’’The Child Beyond”\nand ’’Trailblazers for Texas;” WTDS-FM, Toledo Public Schools\nfor ”How You Talk!” and WUOM, University of Minnesota for ’’Down\nStorybook Lane,”\n’’Tales of the Valiant” by the University of Michigan;\n’’Segregation” by WNYC, New York Municipal Broadcasting Corpora¬\ntion; ’’Quiz the Professor” by WHA, University of Wisconsin;\n’’What's News!” by the Philadelphia Public Schools; ”T'he World's\na Stage” by WNYE, New York Board of Education; ’’Robin Hood” by\nKPFA, Pacifica Foundation; ’’Music for You” by KUSD, University\nof South Dakota; and ’’Tips for Pre-Teens” by WABE, Atlanta\nBoard of Education received honorable mention in radio. A\nspecial award was given to KPFA, Pacifica Foundation for the\nprogram ’’The First Amendment: Core of Our Constitution.”\nSCRIPTS NEEDED BY RADIO FREE EUROPE\nRadio Free Europe, as all broadcasters know, is a broad¬\ncasting operation directed into the five countries under Com¬\nmunist rule in Eastern Europe. A substantial portion of RFE's\nactivity is devoted to the projection of the American way of\nlife, its institutions, customs, etc. as it is necessary that\nthe peoples of Eastern Europe be made aware of our way of life\nand the common values of civilization which we share.\nThe immediate problem of Radio Free Europe is to obtain a\nwealth of simple, intimate, appealing human interest material.\nTherefore, NAEB member stations are requested to submit to RFE\nappropriate materials in script form. RFE will be glad to pay\nwhatever costs or other charges are involved, and would like\neither to retain the scripts permanently or to borrow them for\ncopying purposes, whichever is most convenient to the station.\nIf you have such material, please contact RFE and offer\nyour cooperation. All contacts should be addressed to: Mr.\nGerald L. Steibel, Assistant Chief, Information Department,\nRadio Free Europe, 110 West 57th Street, New York 19, New\nYork. Thank you for your cooperation."
}