{
  "id": "d1862-5",
  "text": "Artransa, a television production service in Australia,\nis offering complete service on a completely independent basis\nto all advertisers, advertising agencies, television stations\nand production companies, Artransa, with the help of Rudy\nBretz, erstwhile director of NAEB ETV Production \"Workshops\nand recently Director, Birmingham Educational TV, has worked\nto get the most efficient and practical organization possible.\nThis has involved some three years of extensive planning.\nThe studios, although geared initially for film production for\ntelevision, will also be readily adaptable to full-length\nfeature production. The 20-acre lot has been planned to allow\nfor rapid sound stage expansion.\nWHOM, THEN, DO 1 CALL EDUCATED?\nFirst, those who manage well the circumstances which they\nencounter day by day and who possess a judgement which is ac¬\ncurate in meeting occasions as they arise, and rarely miss the\nexpedient course of action. Next, those who are decent and\nhonorable in their intercourse with all men, bearing easily\nand good naturedly what is unpleasant and offensive in others,\nand being themselves as agreeable and reasonable to their as¬\nsociates as is humanly possible to be$ furthermore, those who\nhold their pleasures always under control, and are not unduly\novercome by their misfortunes, bearing up under them bravely\nand in a manner worthy of our common nature. Finally, and most\nimportant of all, those who are not spoiled by their successes,\nand do not desert their true selves, but hold their ground\nsteadfastly as wise and sober men, rejoicing no more\nin the good things which have come to them through chance,\nthan in those which through their own nature and intelligence\nare theirs since birth. Those v/ho have a character which is in\naccord not with one of these things but with all of them,\nthese I maintain are educated and whole men, possessed of all\nthe virtues of a man.\n—Socrates\nAdditional subscriptions to the Newsletter are available\nfrom Headquarters for $2.50."
}