{
  "id": "d1862-8",
  "text": "-3-\ntemporary, shorter appointments. Ken will be responsible\nprincipally for riding herd on radio projects for the Cen¬\nter.\nI think an announcement appears elsewhere in this Newsletter\nregarding conclusion of a contract with Milton Mayer for a series\nof European interviews, following the pattern of his earlier\nVOICES OF EUROPE. This series is financed from a grant by the\nCenter, as recommended by the NAEB, to the University of\nChicago. The University’s Radio and Television Office, under\nthe direction of Ned Rosenheim, will be responsible for the\nchecking and editing of these programs.\nThe Center meeting was a good one with some thirty-five\npeople in attendance. It was a great shot in the arm to see\nthe success beginning to be achieved by what a few years ago\nwas a little band of sometimes discouraged pioneers in an\narea in which realization was hard to come by. I believe ETV\nis now a reality and a dynamic movement. The calls that will\nbe made on the services and energies of the Center, the JCET\nand the NAEB will not be lessened by this growing status and\nstature, however, no one can rest on his laurels yet, if any.\nThe next meeting at Columbus was the NAEB Board meeting.\nI believe President Frank Schooley will report on this more\nfully in his President’s Page to Actives and Associates.\nIn passing, however, I might call attention again to the\nRegion I meeting, hosted by Art Weld, being held at Syracuse\nUniversity’s Sagamore Lodge, May 4 and 5, which Cec Bidlack and\nI shall be attending before this reaches you. From there I\ngo on to Washington for a Conference on Elementary Education,\nwhere I shall be representing you to the best of my ability.\nThe Region V meeting is now planned for Denver, under\nthe leadership of Henry Mamet, on June 14 and 15. Tentatively\nRegion IV is scheduled to meet in Minneapolis June 21-23, with\nBurton Paulu as host. Dates of the Region VI meeting are yet\nto be announced, although it is scheduled to be held before\nthe end of June. Regions II and III are scheduled for meetings\nduring the 1956-57 fiscal year. These regional meetings do\nmore than anything I know to make possible an intimate ex¬\nchange of ideas and acquaintances. I hope you will all try\nto attend your regional meeting when it is held, in order that\nyour viewpoint may find its way into the thinking, structure\nand projects of the NAEB."
}