{
  "id": "d1862-9",
  "text": "-9-\nOne other important thing discussed at the Board meeting\nwas proposed amendments to the Constitution* A draft of a\nfairly basic revision proposed by Vernon Bronson after con¬\nsiderable study of other organisations and discussions with\nDick Hull, some members of the Board, and yours truly at the\ntime of my visit to Miami, will be slightly re-worked and\ndistributed well in advance of the Atlanta Convention to en¬\nable study by all members before it is voted on. This is.an\nattempt to re-define and sharpen the statements and classifica¬\ntions needed for the NAEB in its dual role of a professional\nassociation (utilizing individual members and talents) and a\ntrade association (of broadcasting institution member repre¬\nsentatives), which at the same time is operating a network for\nradio. The best thinking of all members is needed on this im¬\nportant problem, and I hope you will all read these materials\nand be prepared to give your best thinking on them when they\nreach you.\nThe IERT itself contained a number of fine talks this.year.\nThe feeling on the part of people who attended the discussion\ngroups and clinics seems to vary considerably, depending on\nwhich groups they attended. Since the results and an evaluation\nof these sessions are not available at this time, I shall re¬\nstrict myself to brief comments on two or three of the out¬\nstanding talks.\nThe first was by Charles Siepmann on April 17. His talks\nare always provocative and well-prepared. He expressed concern\nat the extent to which we have spread money and the symbols of\nour standard of living better than culture or education. He\nwas equally concerned with our preoccupation with \"our little\npile” \"(of money), our increasing conformity of thought, our\nlooking to broadcasting to flatter rather than to fulfill us,\nand the extent to which original thinkers, with ideas essential\nto the dynamics of a democratic society, are now so frequently\ndismissed as radical, rather than being given considered at¬\ntention.\nHe was followed by Mr. Alan Griffin, Professor of Edu¬\ncation at Ohio State, who also had a few statements to make\nwhich I found provocative. He pointed out our growing inclina¬\ntion to educate children to serve got ends, rather than to\nrealize their potential. Too rarely have we realized that all\nother men’s education helps us. He also threw out for thought\nthe idea that we can no longer manipulate the minds of other\npeople to our ends, as we used to think we could. \"The world\nhas almost outgrown propaganda as a technique of control.\""
}