{
  "id": "d816-114",
  "text": "NATIONAL ASSOCIATION\nOF EDUCATIONAL BROADCASTERS\nr\nOFFICE OF THE VICE PRESIDENT\nlli February 1953\n(dictated February 12)\n./\nMr. Graydon ^usmus\nStation WUOA\nUniversity of Alabama\nUniversity, Alabama\n*/\n^ear Graydon:\nSarah is recovering as well as can be expected after her broken\nleg, and I have caught up on my work that had accumulated while I was\nin New York, and now I am in the remarkable position of being able to\nreply to a letter the same day I get itI So here goes on your letter\nof February 9 just received.\nI have already roughed out a letter to Fletcher which acknowledges\nhis sending me copies of the report that we submitted to him in New\nYork and also suggests the need for a reply from him acknowledging the\nreport and commenting on it. In this I am also going to put something\nabout giving us more chance to prepare for the next meeting. You will\nreceive one of these in due course, once I have a chance to review the\ndraft which is now on the dictaphone cylinder.\nI have decided to make an application Fulbright\nscholarships. In the covering letter to FranKT^ctSsid^r myself *better\nqualified to represent NAEB in London than in Paris\" but that I am\nlisting France as a second choice anyway in order \"to offer an alter¬\nnative to the selection committee in the event that they have many\nmore qualified candidates for the London than for the Paris post.”\nIt is more important for the Fulbright scholars to know -American edu¬\ncational broadcasting than to know the language of the country to which\nthey are assigned, although they should be well qualified in both res¬\npects. But it may be that the supply of people for the Continental\nposts with both language and broadcasting qualifications may be very\nlimited, in which case the committee may prefer an experienced educa¬\ntional broadcaster who knows a little French and is willing to learn\nsome more to someone who knows French well but has little or no know¬\nledge of educational broadcasting. For this reason I have indicated\nParis as a possible alternative.”\nI also state that I have discussed this with the proper adminis¬\ntrative officials here at the University and that at present \"they and\nI see no positive local commitments which would interfere with my\naccepting such a scholarship were it offered. In the event changes\nin my status here at the University of Minnesota should make it\ndifficult or impossible for me to accept xscsh an appointment, I will\nimmediately inform you of that fact.”"
}