{
  "id": "d816-118",
  "text": "University of Minnesota\nGeneral Extension Division\nMinneapolis 14\nRadio Station KUOM\n770 ON YOUR DIAL\n16 February 1953\n(dictated February 11)\nMr* Graydon Ausmus\nStation WUOA\nUniversity of Alabama\nUniversity, Alabama\nbear Graydon:\nHere is a memo I have just turned out to the Board of Directors\ncommenting on your memo of February 7.\nYour memorandum looks good. It follows, I note, the memorandum\nwhich Bob Hudson sent you dated January 31 (Bob sent me a copy too,)\nOne thing I like about this is that it clarifies the relationship between\nthis project and the Educational television and Hadio Center^ much as\nI agreed with your proposal (page 3 of the committee's report) on the\nsubject of \"Program Resources Inventory,” I couldn't see the relation¬\nship between it and the Center, But now it becomes clearer: this\nmeeting would discuss program areas for development by the Center.\nThings were a little rough starting a couple of dsys after I got\nhome from the New York meeting but now we are back on the track again.\nI got home on Friday night, spent Saturday and Sunday catching up with\nhomework, went to the office Monday and Tuesday, and had just about\ncaught up with my pile of mail and local assignments. Then Wednesday\nafternoon, February U, ray little Sarah (aged 6) fell and fractured her\nright leg. xhat kept me home the next four days — and let me tell\nyou they were hard days for Frances and me as well as for little Sarah!\nBut now Sarah feels pretty well, and we're back on the track again.\nImportant decisions relative to the nature of the request we should\nmake to the legislature were taken during my attendance at the meeting\nof the Educational Television and Baciio Program Center in New York. Had\nI been around here I would have been consulted and would have been able\nto suggest a few changes in the procedure. £or this reason I am going\nto try to stick pretty close to home from now until the legislature\neither sinks or floats us around the 5th of April. However I am defi¬\nnitely reserving February 26 and 27 to be with you in Montgomery."
}