{
  "id": "d816-155",
  "text": "147, Argyle Hoad\nEaling\nLondon, W. 13\nEngland\nOctober 16, 1953\nDear Graydon:\nIt is just out a month since I left home, and three weeks since\nthe Paulu’s arrived in London* Mgr be you’d like a little resume\nof what we've done during this period when we were out of contact\nwith our friends at home*\nFirst there was the flight from Mpls to NY—fast, uneventful and\nenjoyable. Northwest Airline’s Stratocruiser flight 208 did\nwell by us; and since it was thee hildren s first time aloft, we\nwere much interested in their reactions#\n0^ cr® sing on the S* United States has become famous because\nof our rough weathers we had 60 mile gales a day or so, and even\nthat 53,000 mechanical monster pitched around with the result that\na good 95% of the passengers were sick—as were some of thecrew.\nI joined the 95% on the two rough days, I’m sorry to report]\nIn London the first problem was housing. The war’s bombing made\nour housing shortages at home seem slight in comparison. For\ntwo weeks we stayed at & small hotel—total bill, about 70 pounds,\nor $210] That was enough to spur the several Fulbright family\nmen staying there to real exertion] Finally we found this place,\na house located in a nice section, looking out on a large park,\nwith a school within walking di& ance for Sarah. For $125 monthly\nrent (yes, that’s right, $125 plus) we get three bedrooms, DR,\nLB, kitchen, bath and WC. There *s no T& sement (few English homes\nhare them), but we have lovely yards (gardens, here) both front\nand back, with roses on the garage roof] (Just what you’d love,\nI’m sure, Graydbn.) Heating of course is not central: fire¬\nplaces in LR and DR, coal hot water heater in kitchfen to heat\nwater for kitchen and bath, plus kitchen itself (aa d bathroom\nvia uninsulated hot water tank located there). We ha e gas\nfires In the fireplaces in two of the bedrooms, but no heat\nin third ER or WC. But this is England; who e xpects anything\nelse?\nThis past week saw us moving in and making the thousand and one\nadjustments » cessary. Sarah*s grade here is studying arith¬\nmetic, of toich we had none at home. English grocery buying is\na fiekl all by itself, whiejj both Frances and I had to i am.\nAnd gettiig settled in a new house is tough anywhere."
}