{
  "id": "d816-160",
  "text": "^ Mr* Gray don Ausmus\n-2- October 26, 1953\nUniversity of London, the institution to which I am formally\naccredited by Fulbright.\nPerhaps I should mention that X had a brief talk at a reception with\nAmbassador Aldrich, When I told him I was from KUOM at the University\nof Minnesota, he asked me if there were comparable stations in New\nYork and Boston,* (Sy and Parker, please note!) So I gave him as\nmuch about them as our reception-length conversation permitted, with\nthe result of his putting a London newspaper reporter onto me for a\nstory; nothing came out in tne press, however* I have also been\ngetting acquainted with the cultural officer at the embassy, William H.\nMorris (who has asked me to go to Bournemouth for a Rotary Club talk\nin a couple of weeks) as well as with the Fulbright secretariat staff\nhere,\nThat*s the ground work. The way now seems clear to go on from there,\nClark said at lunch last week mat they were prepared to help me\narrange interviews with any BBC people I want to meet, and Mary Somer¬\nville is ready to invite me to some of her Talks Division policy staff\nmeetings. Sessions with the Home, Light and Third Programme directors\nmay be had for the asking—and I expect to ask for them soon. But\nfirst I am taking a look around to see what I want to doi after all,\nI*m here for nine months, so I want to lay my plans carefully.\nIn the area of program exchange, in which I know you and the board are\nall interested, several things need to be done:\n(1) learn all I can about the BBC in order to use its resources to\nthe maximum and negotiate intelligently with its staff;\n(2) tell BBC people and others influential in broadcasting here\nabout American educational broadcasting in general, and NaEB in\nparticular.\nItem (1)—learning about the BBC: Clearly I must listen to and view\nBBC programs. I managed to get a good radio only a few days ago, al¬\nthough I*ve had a poor one for a couple of weeks. I dislike going to\nsee (say) a drama or talks producer without having previously heard or\nseen examples of his work; and it isn*t efficient either. (What I have\nheard so far, incidentally, indicates that an awful lot of BBC talks\nwould never do for us, for reasons of interest, style and/or subject.)\nI am getting a TV set next Wednesday from a rental concern. This will\ncost me about $100 rental during my stay here? and I cannot get any in¬\ncrease in my Fulbright expense allowance for it, a fact investigated\ncarefully in talks with both the finance officer and executive director\nlast week. Since I could buy for 90 pounds the same set I am renting\nat the rate of 35 pounds for eight months, I suggested to the Fulbright\nCommission that they buy the set and hold it for use by future Ful¬\nbright fellows. But they were unwilling either to buy it, to pay the\ndifference between rental and purchase cost, or to supplement cpy\nallowance in any way for this purpose. They also stated very em-"
}