{
  "id": "d816-180",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nFebruary 17, 1954\nDear Harry:\nThank you for the material—2&EB bulletins and reports, Jeffersonian\nHeritage, et al. This morning I spent forty minutes on the phone\ntrying to get through Customs the second Ways of Mankind Album; it\ncame to my house, complete with $15 (&5) customs and prchase tax\nbill on Christmas Day* I was in a bad mood and sent it back* and\nbegan negotiations with everybody in the British Govt excepting only\nthe Queen and Phil.* I finally got a piece of paper from the Treasury\nexempting me from Customs duty, but nothing yet about purchase taxi\nxhis morning It ried to get that cleared up. This is no fault of\nyours, pleas- understand: its just that my attempt to save 1ALB\n$15 has involved two months delay; next time 1*11 pay and send you\nthe billi\nI*ve bean working on the features Departi ent to get them to finish\nmonitoring the Jeffersonian series with a view to broadca ting them.\nAl® gsv e them a cojy of the book. I checked up sterdays not yet\nthrough with them. Friday I see Gris ©wood and will suggest he look\ninto the matter too. What this seems to boil down to is that they\ncould monitor those r ecards if they really wanted to, but they den 't\nfeel excit4d about it. 0 ce I get a reply on the Jeffersonian I'll\ntry the* new anthropology series on them, but I don * t waa t to © mplicate\nmatters now with that, until the first project is settled onew ay or\ntheother.\nTo the Embassy Library I supplied a © mplete set of all NAEB material\nplus one eachof the books, -hey mentioned that I didn t give them\nthe first monitoring study. If any are available, could you mail roe\ntwoor three? Incii entally, Mr* Nolan, the librarian suggested that if\nwe s ent copies of our main studies to: Inform a. ion Center\nServices, United States Information Agency, Washington, 25,--they could\ngive us world circulation on our material. *his seems good procedure\ntom e: if you'd send them (provided we have enough copies) such\nthings as the thxe e-yea$ monitoring summary,-.Lincoln lodge, aid the\nbibliography, they'd send copies to all US Information Libraries in\nalllhe countrieso f the world.\nThe BBC is sending you a couple of hundred copies of the Radio Times\nfor mailing out with a future News-Letter. I thought this might be\nof interest to NAFB member , and accordingly arranged it. Shortly\nI'll write a little piece on what the Radio Times is, fbr you to run\nin that issue o f the News-Letter."
}