{
  "id": "d816-22",
  "text": "-21-\nWoodbury, R.M., \"Safety Radio Forum,\" Safety Education, XXIX (October 19h9),\np. 1.\n10. Broadcasting in Foreign Countries\na. General\nAnonymous, \"Austrian School Broadcasting.\" Association for Education by Radio\nJournal, VIII (March 19b9), no. 80-1. -\n-> \"Coooeration in Berlin; Work of Rias Schulfunk.\" Times Educational\nSupplement, MDCCLXXI (April 9, 19b9), p. 228. ---\n---, \"Lessons on the Air; School Broadcasts in the U. S. Zone.\" Times\nEducational Supplement, UBCCLVIII (January 8, 19U9), p. 21. -\n,-—, \"Radio Stations in the U. S. Area in Germany Shift to New Frequen¬\ncies.\" U. S. Department of State Bulletin, XXII (April 10, 1950), o. 567.\n-, Report of the Commission on Technical Needs: Press, Film, Radio.\nUNESCO Publication R36. Paris: United Nations Educational, Scientific,\nand Cultural organization, September 19b9. W 296.\nArmstrong, O.K., \"Man the Russians Fear uost in Germany.\" Readers Digest,\nLVI (February 1950), pp. 53-6. -*\nBomhoit, Julius. \"The Danish State Radio: a Radio Set in Nearly Every Home.\"\nDanish Foreign Olfice Journal, (January I9h9), pp. 15-19.\nBull, C., \"Comradeship Over the Air; Sc ool Broadcasts In Australia.\" Times\nEducational Supplement, ^JDCCCXXIII (Aoril 7, 1950), p. 258. ~~\nEfron, E., \"War on the Radio.\" Life, XXVI (March 28, 19b9), on. 17-18/.\nInkeles, Alex, \"Mass Media Abroad: Domestic Broadcasting in the U.S.S.R.\"\nPp. 223-296 in Lazarsfeld, ^aul F., and Stanton, Frank, Communications\nResearch 19bd-l9b9. New York: Haroer & Brothers, 19b9.“~\" '\n-j Public Opinion in Soviet Russia, A Study in Mass Persuasion.\nCambridge: Harvard University Press. Pp. xviii7 3797\nKantor, K., \"Uncle Come-Come.\" New York Times Magazine, (September 25. 19k9).\npp. 78-9.\nLandry, R. J., \"Radio with a Sombrero.\" Nation, ELXVIII (January 1, 19b9),\nLeiser, E., \"Voice Behind the Curtain.\" Colliers, CXXV (February b, 1950),\npp. 30-1 /.\nLund-Johansen, 0., ed. and pub., World Radio Handbook. Copenhagen: Lindorfsalle\n1-Hellerup, November 19b9.\nMartin, L. J., \"Press and Radio in Palestine Under the British Mandate.\"\nJournalism Quarterly, XXVI (June 19U9), pp. 186-93. r*\nMedley, Sir John, \"Educational Broadcasting in Australia.\" BBC Quarterly, IV\n(October 19h9), op, lb2-7."
}