{
  "id": "d816-47",
  "text": "December 11, 1951\nMr. Burton Paulu\nSecretary and Publications Editor\nNational Association of Educational Broadcasters\n2500 Municipal Building\nNew York 7, N. Y.\nDear Mr. Pauluj\nI have your letter of November 29 which deals with the ever recurring\nquestion BIs WHCU in NAEB or out\"? You may have participated in some\nof the discussions a couple of years ago when the new NAEB constitution\ncame into being. At any rate, I am sure that there is considerable\ncorrespondence in the Association files dealing with this subject.\nI have a sincere interest in keeping the station and the University in\nactive membership.\nIt has been my understanding that WHCU enjoyed active membership under\nthe original constitution. When there was talk of the new constitution,\nthere was a question as to whether, in view of article 1, Cornell*s\nWHCU would lose its status of active membership. While I could not be\npresent during the meeting, it is ay understanding that there was some\npretty strong discussion on the subject. At that time it was decided\nthat the application of the new constitution would not be retroactive,\nand that WHCU would maintain active membership. As a matter of fact,\njust a few days ago Seymour Siegel sent us our certificate of active\nmembership which, according to his wish, we had properly framed and\nexhibited. In the interests of brevity, may I say that we don*t want\nto be either overbearing or misunderstood in this matter. We value our\nactive membership in NAEB. The work that Cornell has done and is planning\nto do in the field of radio and television is pretty well know to\nbroadcasters, both educational and commercial. We have been standing on\nthe interpretation of a previous Board which gave us assurance that the\nnew constitution was not to be considered retroactive. The fact that we\nhave been unable to attend meetings of the Association in the late pest\nis a source of real regret to us, but certainly should not be construed\nas a lack of interest."
}