{
  "id": "d816-64",
  "text": "July 21, 1952\nTO: NAEB Officers and Directors\nFROM: President, NAEB\nSUBJECT: NAEB International Meeting with CBS and BBC in London Sept. 1952\nlo The Adult Education Committee has requested me to report on the\ninvitation from, and the forthcoming meeting with, the officers of the\nBritish Broadcasting Corporation, in London, during the month of\nSeptember.\n2o As all of you are aware the NAEB Tpp® Network even prior to its\nestablishment at the University of Illinois, received a great deal of\nits basic program material from the BBC and to some extent from the\nCBC. This cooperative assistance continued and increased with the\nexpanded activity of the Tape Network. Last year with the creation\nof the radio programs production grant at the Lowell Institute from\nthe Fund for Adult Education, one of the program elements in which Fund\nofficials expressed most interest was the area of international under¬\nstanding o\nAccordingly, pl.ans were made not only for the forthcoming series of\nprograms on USSR (People Under Communism) which by the way is to be re¬\nleased September 14th at tine same time as the Jefferson Heritage, but\nseveral other projects were planned and put in motion. These included:\nI. \"Voice of Europe\". This is a series of interviews being done on the\nspot on people and their problems, by Professor Milton Mayer, well-known\nlecturer, author, etc., These tape recordings are being done in France,\nEast and West Germany, Switzerland, Belgium and Italy. The first batch\nof 33 fifteen-minute pericd s have been received by Harley and are in the\nprocess of being edited.\n2«> \"International Exchange\". This is a project involving the CBC and\nthe BBC as well as NAED. Following the JCET Institute at Penn State,\nMr„v Grisewood, then the Director of the BBC Third Program(and now the\nBBC*s Director of the Spoken Word) came to the united States, as did\nNeil Morrison of the CBC in Toronto and a series of meeting were held\nwith NAEB personnel in New York and Boston. Plans were Established for\na \"round-robin\" productions emanating respectively from Canada, England\nand the USA. The major problem was to apprise each broadcasting group\nof audience problems in a given country and to dispense with and clarify\nmany of the misconceptions about educational progran&oing in the several\ncountries. Plans for the international exchange of programs have been\ncarried forward and some of these programs will emerge in late fall for\nthe tape netvaork."
}