{
  "id": "d816-86",
  "text": "Robert B. Hudson\nMEMORANDUM\nDecember 22, 19$2\nTO: President J. L. Morrill\nPROMs Burton Paulu, Manager of KUOM\nSUBJECT: A proposal for the joint operation by the Minnesota educational\ncommunity of one or more noncommercial educational television\nstations*\nIn any plan for one or more noncommercial educational television stations\nfor Minnesota, the determination of the licensee must be a basic consider*\natioru Furthermore, any proposal for educational television in Minnesota\nmust provide adequate participation at the policy level for the state1s\nentire educational ccwsaunity*\nThe proposal has been made that the University of Minnesota serve as\nlicensee of these stations* Under this proposal the participation of other-\neducational institutions, school systems, agencies end groups can end should\nbe definitely assured through the establishment of a Minnesota Educational\nTelevision Commission which would play an author it stive role in policy\ndetermination.\nA. BASIC LEGAL REQUIREICHTS FOR THE LICENSEE\nEvery broadcasting station roust have a licensee who thereby assumes certain\nresponsibilities before the law*\n(1) All stations roust be operated in accordance with the provisions\nof the Comunications Act of 193U and the Federal Communications Commission^\nRules. Among other things these require that the licensee be ultimately\nresponsible to the Commission for the station1s program, output and technical\noperation. This responsibility cannot be shifted to anyone else; the\nlicensee therefore must be prepared to undergo any penalties assessed\nagainst him by either the FCC or the Federal Courts as a result of violations\nof the Camraunications Act or the FCC rules.\n(2) The Commission®s Rules also provide that the licensee of a non¬\ncommercial educational television station be prepared to serve the gener al\neducational television needs of its entire areas in other words, such\nlicensee could not operate solely with reference to its own immediate\ninterests. Among other things it must make sir time available to other\neducational groups and agencies.\n(3) Many legs! responsibilities stemming from other sources than\nthe Communications Act of 193U also must be boms by station licensees.\nThus a licensee must comply with the copyright laws or be subject to civil\nsuits for their infringement. He also is subject to libel and slander suits\ngrowing out of material he may have broadcast* In addition to these matters\ndirectly concerned with broadcasting he also is subject to many legal require-\nments of a more general nature."
}