{
  "id": "d816-9",
  "text": "-8-\nEshenfelder, A.F., ’’Radio Forum Helps Solve Community Problems.” American\nCity, LXIV (May 19l*9), pp. 108-9. -\nMosse, Baskett, ’’News Promotion.Newscaster, IV (January - February 19U9),p.l.\nNadig, H.D., ’’Media of MPR: Radio.” American City, LXV (April 1950), pp. 100-1.\nPeterson, Sheldon \"Blending News and Special Events.” Newscaster, IV\n(Larch - April 19l*9), p. 1. “\nRay, William, ’’Bill Ray Calls On-the-Spot Recordings Most Vivid jay of\nPresenting News.” Newscaster, IV (January - February'19L9), p. 3.\nStuebing, A.D., ’’City Council on the Air at Hamilton, Ontario.” Saturday\nEvening Post, CCXXI (June 11, 191*9), p. 91. * ~\ng. Personalities On The Air\nAnonymous, \"Goldbergs March On.\" Life, XXVI (April 25, 19l*9), pp. 59-62.\n-f ngara Talks Like Anybody.” American Magazine, CXUX (March 1950),\np• 110.\nBeatty, J., \"High, Low, Ace and Jane.” American Magazine, CXLVII (January\n19l*9), pp. 58-60 /,\n-, \"Tex’s Lucky Jinx.” American Magazine, CXLVIII (September 19l*9^.\npp. 1*2-3.\nCrosby, John, \"Amos »n' Andy, Ain’t Dat Simpinl” Colliers, CXXII (October 15,\nX9U8). Same, condensed, Readers Digest, LIV (February \"l'9l*9), pp. 39-1*2.\nFroman, R., \"Man ,!ho Comes to Breakfast,” Colliers, CXXV (May 13, 19^0),\npp. 28-9 A\nHeggie, B., \"Mary Margaret’s Miracle; M.M. McBride.” Woman’s Home Companion,\nLXXVI (April 19h9), p. 76. ---\nHughes, C., \"What’s the Secret of King Arthur Godfrey?” Coronet, XXVII\n(December 191*9), pp. 158-66.\nKobler, John, \"Junior’s in a Hurry.” Saturday Evening Post, COXXI (February\n19, 19l*9), pp. Ul A\nLong, J., \"Everybody’s Neighbor.\" American Magazine-, CXLVIY (March 19l*9),\npp. 1*6-7 A ’\nPrice, Wesley, \"Marrow Sticks to the News.\" Saturday Evening Post, CCXXII\n(December 10, 19l*9), pp. 25, l52-iw\nSouthern, R., \"Great Larynx; A. Linkletter.\" Colliers, CXXIII (May 28,191*9),\n. pp. 26-7 /.\nWilliams, R.L., \"Duffy’s Latin Tavern.\" Life, XXVIII (February 13, 1950),\npp. 109-12. -\nYoder, R.M., \"McGees of ,ristful Vista.” Saturday Evening Post, CCXXI\n(April 9, 19U9), pp. 26-7 A (April Ib7l9l*9), dp. \"36 /. '"
}