{
  "id": "d704-117",
  "text": "OUTLINE OF PURPOSES AND FUNCTIONS\nUnderlying purpose of both the Division and the Department: To provide\nleadership for better education through the use of AV media and concepts\nin instruction and in professional communication.\nPurposes and Functions: Division of Audio-Visual Instructional Services, NEA.\nI- To provide and stimulate research and pioneering in the field.\nA. Science Film Project\nB. TV-work\n^C. Development of Research Bulletins\n*D. Surveys of research to determine needs\n*E. Special conferences and workshops to achieve better present object¬\nives, to ascertain new objectives\n*F. Work in new fields and new media such as TV and automation\nII- Raise standards and competencies of professional educators including\nteachers, administrators, and AV specialists\nA. Work with TEPS AND FTA\nB. Work thru DAVI with\n1. -NCATE\n2. AACTE\n3. American Council on Education\n4. ACRL-AASL-DAVI\nC. Thru conventions of Departments\nD. Thru publications of Departments\nE. Work to up-grade professional AV personnel thru DAVI committee, mem¬\nbership servicese\nF. School Facilities Council\nG. Audio-Visual Commission on Public Information\n*H. Working with regionals\n*1. More work with state departments and organizations\n*J. Analysis of needs and determination of program\nIII- To provide assistance and guidance to educators and related groups\nA. Information via correspondence, etc,\nB. Consultant service, i.e„, Safety, Math., AEA, HPER\nC. Convention planning and participation, i.e.. Rural, AASA, Secondary\nSchool Principals\nD. Committee Work\nE. Office research and preparation of requested information material\n*F. Application of TV\n^G. Working with AV producers\n*H. Improved liaison with AV committees of specialized . educational or¬\nganizations\n*1. Better study and knowledge of new developments\n*J. Exhibit of new materials, equipment, and building facilities\n*K. Working with communication schools\n*L. Stimulation of and better liaison with other organizations"
}