{
  "id": "d704-122",
  "text": "Evaluation of Secondary School AV Programs - Daniel Rohrbach, Chairman;\nA» ¥• VanderMeer, Assistant Chairman\nExpires at the 1957 DAVI Convention\nDistributed 5>600 copies of Evaluative Criteria for AV Instructional Materials Services\nfor field study. Prepared 'information Request in sumary' form for evaluation of above\ncriteria© Are at present studying reactions from field on proposed criteria for im¬\nprovement* Established working relationship with committee which will study and revise\nthe Cooperative Study of Secondary School Standards*\nLegislative - Irving Boerlin, Chairman; Frank F. Gorow, Assistant Chairman\nExpires at the 1958 DAVI Convention\nEfforts were continued during this year of the 8Uth Congress to have the Senate Bill\nS.1292 enacted into law© Working with groups representing music education and pub¬\nlishing interests, library and book publishing interests, and educational testing\ninterests, this bill, passed by the Senate, was finally incorporated by the House Post\nOffice Committee into one big bill including the President’s rate increases. For audio¬\nvisual, this bill v/ould have extended the present low audio-visual materials rates with¬\nin state or third zone limits to the entire United States. It is a matter of history\nthat the House passed this combined bill and sent it to the Senate, where it ’’died”\nwhen the 8Uth Congress adjourned. Our original bill was re-introduced in the.Senate\nand in the House in 1957* We will continue to work for its passage.\nAssistant Chairman, Frank Gorow, started a survey of all types of audio-visual legis¬\nlation within the states*.\nProfessional Education - Kenneth Norberg, Chairman\nExpires at the 1957 DAVI Convention\nConducted survey to gather data for revised edition of Directory of Graduate Programs\nfor the ProfessionalEducation of Audio-Visual Supervisor, Directors, and Building\nCoordinators^ Cooperated with national office of DAVI and the Committee on Standards\nof the National Council for the Accreditation of Teacher Education in the preparation\nof proposed standards for accreditation of programs for the professional education\nof audio-visual specialists® Dr. Norberg is acting as Departmental Editor of Audio-\nVisual CCM/EUNIGATION REVIEW.\nResearch - Paul Wendt, Chairman\nExpires at the 1957 DAVI Convention\nThe Committee has been investigating sources of a grant to make it possible for the\nDAVI to supplement the micro-film file of doctoral theses in audio-visual education\nat Indiana University so as to establish there a complete file of this material for\nthe DAVI. A brochure entitled ”What Research Says To The Teacher About Audio-Visual\nEducation” is ready to be submitted to the Research Division of the NEA for publica¬\ntion in their series, ’’Research Says to the Teacher.”\nSchool Service Corps - Fred Winston, Chairman\nExpires at.the 1957 DAVI Convention\nThe first section of the manual tentatively entitled ’’The AV Instruction Squad” was\npresented and evaluated at the 1956 DAVI Convention. .The suggestions and recommenda¬\ntions were studied by the writing committee and incorporated into the completed draft.\nThe framework and working outline for the last section of the manual has been pre¬\npared for presentation to the committee as a whole at the 1957 Convention. This outline\nis to be expanded by the committee at the Convention*"
}