{
  "id": "d704-123",
  "text": "-3-\nStandards for AV Equipment — Chairman to be elected by committee members\nAppointed January 195>7 (ad hoc)\nTeacher Education - William Pulton, Chairman\nExpires at the 19$7 DAVI Convention\nContinued to represent DAVI in the Coordinating Committee of AACTE, in the National\nConvention of American Association of Colleges for Teacher Education, and in the\nregional conferences of the Commission on Teacher Education and Professional Standards\nMembers participated in the program at both of the conventions* Continued study of\nthe schedules now being used by the National Council for Accreditation of Teacher\nEducation, revised and re-submitted some proposed changes to be made in the next\nrevision of the general schedules* Submitted proposed standards for a professional\nprogram for AV Specialists for inclusion in schedules now being used by NCATE* Sub¬\nmitted a list of consultants for the possible use of NCATE on accreditation.teams*\nTelevision - Emma Fantone, Chairman; James Davis, Assistant Chairman\nExpires at the 195$ DAVI Convention\nInvestigating the possibilities of a workshop or workshops for DAVI members, the work¬\nshops to be set up specifically to assist AV personnel in fulfilling their role in\neducational television* Also preparing a questionnaire to obtain information on\npresent and optimum viewing conditions for in-school use of television* Probably this\ninformation will be summarized and interpreted in a four-page brochure or in an\narticle in Audio-Visual Instruction*\nII* Functional Committees\nAdult Education - Kenneth McIntyre, Chairman\nVolume 10 in the set of folios prepared by the College and University Section of\nDAVI now available* Collection of publications and reports on audio-visual materials\nand techniques relating to Adult Education are. included. The Adult Education Section\nhas coordinated its activities with the Armed Forces Section, civil agencies of the\ngovernment, and lay adult organizations for the current Washington conference. The\nprogram will be correlated with the three general session themes and should provide\nexcellent audio-visual material on adult education to be added to Folio No. 10.\nArmed Forces Section - Perry Graybill, Chairman\nHave planned participation in idle 195>7 Convention.\nCity Programs - Constance Weinman, Chairman\nInvestigation underway on the following problems:\nCataloging - Ralph A. Stout\nBooking Procedures — E. Dudley Parsons\nTime Allowance for AV Building Directors - Edward Bernard\nPreview Practices - Harold Coman\nDistribution - Clifton Schropp\nProduction Practices for Radio and TV . - Wanda Johnston\nData for Budget Justifications - Donald Ely\nCommunication Within A System — Lloyd J. Cartwright\nIn-Service Techniques with Teachers - Raymond Petrie\nEvaluating AV Programs in Individual Schools - Walter Bell"
}