{
  "id": "d704-137",
  "text": "hOy 1, 1957\n’*r. Ralph Hall, Coordinator\nAudio-Visual Center\nKent Jtate University\nKent, (Mo\nbear Ralph i\nThe last couple of weeks have been a bit hectic, and It wasn’t until last\nweek, upon ey return from an out of town trip, that I sent on to the Center\nfor their study sad reaction your proposed agreement as contained in your\nletter of June 17*\nTheir is on© alight problem raised In connection with the Exclusive* clause,\n'tabor stations, which take these series, ere encouraged to make all possible\nuses, beyond broadcast as well, of any series which meet their needs. I’d\nguess acne of this would ’be oonsitaed *nam-broadeast* distribution, and I\ndon’t think these institutions should be prevented from making sueb use or\neven their own dubs for sueh us®.\nSecondly, there are a few ~ though not many —- requests which come to ua\nwhich wo like to handle ourselves because of quality, promotional or other\nconsiderations. Sam of this la from within the U.S., both government and non¬\ngovernment. Sons la international. These, too, we would like to handle, where\ndesirable. Since our coy^ing rates are and will remain 12.00 per reel for\nmembers and #4*00 for non-««mbersf as compared to your 50# rate. I’d guess you\nwould not find this competitive with you.\n4mt we really went *— both the .Jester and the RA2S9 —~ is an additional\nsaauricst, which you would create and service.\nUp to this point, only Grant-in-Aid programs, of which there are now several\nhundred, are involved. I’d suggest we confine any initial agreement which\nmight be readied with you or anyone else by the denier to this at this stage,\nand see how that works out. teiwhile, for non-grant HASS programs, suppose\nwe continue as ws have in the recent past?\nI’m off on vacation for all or most of the month of July, now, but your reply\nwin be taken up by iarold Hill and Bob Uadanmd of this office if aiy additional\nproblems are raised.\nBest regards.\nHJo/dfc\nGot Kenneth aright, sm*\nhxrton Psulu, $AiB WW\n'Robert- R. Underwood\nHarold E. Hill\nHarry J. komia\nSbeecutlv© Director"
}