{
  "id": "d704-149",
  "text": "r\n'•? ■ r\"T* * d I Jr\n-'^QUARTERS\nf(4 *■ !hb /\n. p. September 25, 1957\nTo: Harry J. Skornia\ncc: Robert Underwood, Harold Hill, Kenneth L. Yourd\nProm: Burton Paulu\nSubject: Comments on proposed draft of agreement between\nETRC and Kent State\nI think this represents progress. I have a couple of\nquestions, though, to ask.\n1. Does this mean that the original producing organization\nwould have absolutely no rights for non-broadcast distribution?\nI think there might be some questions here; we at KUOM, for\nexample, would like to retain the right to give a copy of our\nprograms to Minneapolis schools or other branches of the\nUniversity of Minnesota for their use, rather than having to\nrequire them to write to Rent State University. There might\nbe other occasions too when I should want to provide a tape\nto somebody in the country. But I should be more than happy\nto turn over to Kent State the supplying of our programs to\nmost out-state and many Minnesota groups.\nI’m a bit confused by the parenthetical statement:\nunless released in writing by the Educational Television and\nA'l Radio Center.” I assume you mean that Kent would be the\ni/exclusive distributor unless ETRC says otherwise, although I\ndor’t think this is entirely clear from the phraseology.\n,fV* ^ I am puzzled by lb.\nUniversity of Illinois?\nWhich university—Kent State, or the\n2. I assume that you are referring here to future tense,\nmeaning that they will obtain master tapes of all programs\nproduced in the Center. I think this fact should be clarified,\nin order to eliminate discussion about series produced in\nprevious years.\n5b. This, too, I think could be sharpened up a bit. It\nmeans, I assume, that Kent State will pay the cost of the tape\nplus the labor for copying it, although one might infer from\nthis that they were also to bear some of the production costs\"T\"\nThis I am sure the Center doesn’t mean, but I think it might\nbe phrased to eliminate possible interpretation of that type.\nW1\nk\nBP:ds"
}