{
  "id": "d704-29",
  "text": "2\nThe audience or \"publics'* to whom the group should address itself were listed, and\nsummarized as generally in four groups: School executives and administrators; film\nusers--teachers, those in labor and industry, etc.; government bodies--city coun¬\ncils, state legislatures, etc.; and the general public, A different approach\nwould be needed for each group, and different materials must be prepared.\nDon White presented a list of suggestions for projects, and others were added by\nthe group. These were discussed in detail, and eventually action was taken on\neach proposal. For convenient reference, these projects are listed below, with a\nnote for each as to the decision about carrying it out.\n1. A program oriented toward getting more money for schools.\nThis is an over-all objective, to be kept in mind in carrying out specific\nprojects. See #3 below.\n2. A booklet \"Public Relations is Your Responsibility\"\nCharles Schuller will investigate possibilities of journalism departments in\ncolleges, and will consult with Ernest Tieman and/or Bob de Kieffer. The\npamphlet will be about 12 pages, aimed at the audio-visual administrator,\nwith hints on how he can get attention outside his own baliwick, NAVA will\nprint the pamphlet in its own printing shop,\n3. A report on facts on state a-v programs, expenditures, etc.\nThe first objective will be to get a figure on the amount to be spent per\npupil per year which will be an acceptable minimum standard. It was decided\nthat this figure should be 1% of the annual budget for instructional materi¬\nals. Since the national figures on such budgets run from $200 to $600 per\npupil per year, with an average around $350, the a-v budget would be from\n$2,00 to $6,00 per pupil for materials, not including salaries. This figure\nis admittedly a minimum, and should be raised when conditions seem to justify\nit, but at present it makes an easily understood talking point. The group\npassed a resolution to this effect (see Appendix A) and will urge all\nnational organizations to get it into their programs as soon as possible. In\nparticular, it was suggested that Walter Wittich be urged to include mention\nof it in his President's Address at the DAVI meeting in March,\nIn addition to publicizing the 17. formula, action in this area will include\na report on existing state programs, to be prepared by Bill King, working\nthrough ASCAVO and D/VI.\n4* Standards and reports on local a-v programs\nThe standard given above will apply here also, but the emphasis on the local\nlevel will be on how the amount is spent, to get the best use of available\nmaterials.\n5, A picture book entitled \"Gateway to the Mind\", for the general public, to\nexplain what audio-visual is and can do.\nNAVA is working on a book of this kind, and with cooperation from other groups,\nwill be able to print it.\n6. A visual presentation, with a filmstrip or set of color slides and a suggested\ntalk, to be made available to anyone who has an opportunity to talk to a\ngroup about the audio-visual field."
}