{
  "id": "d1432-2",
  "text": "-3-\n6, Authorized the president tq> purchase any necessary information service or\nlegal directory to keep NAEB advised of FCC action.\n7. Authorized the president and the Board of Directors to state the policy of the\nAssociation with respect to low-power FM grants having in mind the recent\naction of the FCC which permits institutions to apply on the' educational.FM\n, band for non—coirimercial FM facilities operating at 10 watts or less. This\n'policy is to clearly state there are both dangers and values inherent in such\ngrants and that some method of re-evaluation of such grants be recommended to\nthe FCC, so that engineering standards-^-temporarily relaxed under.the hew\nauthorization—-would eventually be re-instated.\nOther Actions\nAbbot, University of Michigan (WUOM) presented report of Resolutions Committee,\nwhich was moved and carried. In brief resolutions voiced thanks to member station\nhosts at the University of Illinois, proposed a more vigorous policy of service.\nand program interchange between stations, supported president and director, action\nduring past year. Motion by McCarty (University of Wisconsin), Second by Steotlc,\nReport of the Resolutions Committee\nResolved\nThat the members of the NAEB assembled for the annual meeting wish to\nexpress their sincere appreciation to Mrs, Frank Schooley, to the staff.\nof WILL, and to the faculty and administration of the University of Illinois\nfor their generous hospitality.\nResolved Tr _ _\nThat the NAEB commend its president, Dick Hull, and treasurer, W, I, arifiith,\nfor the extensive and efficient manner in which they ha.ve served the members.\nr^\nResolved\nThat the NAEB express its appreciation to Cohn and Marks, attorneys,\ntheir generous and efficient service to the NAEB in the Clear Channel\nhearings.\nfor\nThat the president be requested to appoint committees of the membership.\nto coordinate and develop various services to benefit the membership, viz,\n(1) to establish a central office for the distribution of information,\nrequested in surveysj (2) to investigate and report upon the ieasibility\nof regional transcription and beamed FM networks and to submit plans.for\nthe same; (3) to establish a clearing house for the exchange of equipment\nand to keep members informed concerning offers of swaps and surplus,\nequipment, expected shortages of supplies, and the availability of need\nof personnel.\nRespectfully submitted,\nCommittee on Resolutions\nWaldo Abbot, University of Michigan (WUOM)\nAbbot, University of Michigan (WU01 ) invited the. Association to hold annual\nmeeting at the University of Michigan in October, 1949. Acceptance was moved\nand carried. Motion by Dunn, University of Oklahoma(WAD), and second by McCarty,\nUniversity of Wisconsin."
}