{
  "id": "d55-102",
  "text": "Page 2\nMr. John Holt\nAugust 30, 1954\nthat it is particularly educational to learn that breakfast is\nserved in the morning, with comments made in the interviews\nwere not significant or important. And, the program material\nis localized to the farm and there is a great deal of Iowa in\nit. The program audited seemed to imply that the life.of a\nfarm wife is very different from that of wives in villages,\ntowns, or cities. It may be in details, but in all cases it may\nbe s u mm ed up in one word ” w o r k • ” The quality of the recording\nis not smooth. I therefore, vote \"no\" for this series.\nSTORIES IN THE WlND-University of Texas--The\nsubmission form says, 11 these radio stories are directed to pre¬\nschool and primary g-ade levels” and, that is perfectly obvious.\nI do not see why they should be submitted to our Committee,\nrather it seems to me that they should go to the School Tape\nNetwork Committee. The stories are very nice little stories, but\nthey are obviously below the adult level—way, way below. I like\nthem, but I would use them as stories coming from the School\nCommittee. For use on the adult Tape Network Committee I would\nvote \"no”. If I were on the School Committee I probably would\nvote “yes.”\nREASON AND DlSCQNTENT--The three talks by Dr.\nLyman Bryson are adult, educational and yet thoroughly entertain¬\ning. As the first radio offering presented by the new\nEducational Television & Radio Center, with a promise of similar\ntalks to follow each year, I believe it not only valuable but\nexpedient to use this material. Lyman Bryson has charm and\ninformality and delivery and if used within a reasonable time,\nI think his material is timely. You can’t hold it too long.\nI therefore, vote \"yes\" for this series.\nIN THE BEGINNING submitted by KPFA-- I don’t\nlike the variation of eight minutes in length of the various\nprograms in this series. It will make a difficult problem in\nediting. I think the subject matter would be of interest to a\ndecidedly limited audience. The dialect of the speaker is not\neasy to follow, not smooth and l don’t think conforms with our\ngeneral type of educational presentations. A great many techni¬\ncal phrases are used but not explained to the layman. Finally,\nin casting my vote \"no\" for this series, f refer you to the\nfinal paragraph on the back of the first page of the submission\nform.\nNEGRO SPIRITUAL submitted by KPFA--I thoroughly\nenjoy this type of music. I think it would have a popular\nappeal. In some places I think the quality is a little bite\noff and I'm not sure whether we should submit it to the NAEB\nTape Network unless we are sure that we have clearance upon\nall of the recordings used. On the whole I would vote \"yes”\nfor this series of programs.\nMore to come! Hope I catch-up someday!\nCor di a I I v, , ^ OlS.&T>\nWaldo Abbot, Chairman"
}