{
  "id": "d55-105",
  "text": "ANN ARBOR WUOM 91.7 M.C. /I ' /*£\n(\nFLINT WFUM 107.1 M.C.\nUNIVERSITY OF MICHIGAN\nANN ARBOR. MICH.\nWALDO ABBOT. DIRECTOR OF BROADCASTING\nE. G. BURROWS. PROGRAM DIRECTOR\nRECEIVED\nNAEB HL\\DQUARTLRS September I, 1954\nMr. John Holt GhP 2 1954\nNAEB; Tape Network PM\nUniversity of I I I i noi s ^|8|9jip^ll|12| Ij2i^|4l5l?\nGregory Hall\nUrbana, Illinois £\nDear John:\nHere is a score card on the University of Chicago\nsubmissions. I*m pretty thoroughly disgusted with this —\nthey received their Grant-in-Aid in 1952 and signed the\nstatement in their application that their project would be\ncompleted by July I, I 953 and then we don’t get the tapes\non this project until 1954. One year after they were due.\nFurthermore, I’m thoroughly disgusted at any institution\nthat would send in forty tapes all in a batch for auditing.\nFurthermore, most of the tapes are odd lengths, it is going\nto be a HELL of a job for you to try to edit these t apes\nength for programs for the\nbut I’m not putting down\nany comments. Those that I voted for I think are the better\nones out of the forty. As I pointed out they are at odd\nlengths and odd numbers in the series. A great many of them\nI do not think would have much of an audience. They are on\nsubject matter that would not greatly increase our listening\npublicjbut would raise, possibly^ the standard of our\neducational programs. They are all well done but as the\nUniversity of Chicago does not own and operate it’s own radio\nstation, it obviously pays no attention to the time limita¬\ntion of individual programs. As far as I’m concerned you\ncan make up one or two series (thirteen programs) out of the\nofferings from the University of Chicago...you may select\nwhat you please. None of them are outstandingly bad..\nand try to make them J~he j;ight\n\"Tape^\nCor dial Iy yours.\nWaldo Abbot, Chairman\nNetwork Acceptance Committee\nWA:mv\nl^OArf CX- VI. ^\nl-cruj\nH-tyuo\ntj-c yidj vAjtA QaaJ&lA. cw q~Lsuz^~"
}