{
  "id": "d55-126",
  "text": "Page 2\nMr» John Holt\n\"NEW ENGLAND ANTHOLOGY\" —I thought was\nstuffy. If you like this kind of a program it is just the kind\nof a program you would like. But, how many people have we got\nthat would like it. The unfortunate part is, that three out of\nfour on the committee like it — I don't! I never did understand\npoetry. I have met Sandburg, Frost, and a lot of others. I like\ntheir personalities but I don't like their poetry for any length\nof time. But, with three in favor and one against, I guess the\nfinal vote is \"yes.\"\n\"FRANCE TODAY\"--l was bewildered by the\nfact that we had \"pressed duck\" twice in succession. It was a\npretty good program the first time I heard it, but I lost my\nappetite and the bill of $30 kind of killed the second rendition\nof the same program. My feeling is at the present time we got\njust a little bit too much of France on the network and upon\nour station. I certainly enjoyed the meal, however, and think\nthat there are opportunities in the program. I've always wanted\nsome station to do something of the same sort from an epicures\nviewpoint of various sections in New York and in the United\nStates. There are two votes against the program from Minnesota—\nHill is in favor, of it. I generally agree with Hill, some how\nor other, but I'm afraid that this program would have a limited\naudience among educators, and those who listen to educational\nstations. A few of them are going to enjoy the great pleasures\nthat are described in this series \"France Today\". So, I'll\nteam up with Minnesota and make the vote \"no.\"\n\"MEN WITH A QUESTION\" —Re I ies upon the\nbig names of interviewers who contribute nothing but their\nnames. One or two selected programs would be good but a series\nwill not hold attention after the first one or two programs. I\nhad to work like hell to drum up an audience for \"Torchbearers.\"\nWait awhile before we have another series on the blind. My\nvote is \"no.\"\nThe phrase, fifth wheel, has lost its old\nhorse and buggy connotation.Today, the fifth wheel is in the\nautomobile trunk. It is the most vital part of the equipment,\n*s a life saver, it brings you through. No one would start\nto try to go anywhere without a fifth wheel and that is why I\nrefer to John as the Fifth Wheel. He is the sort of ex officio\nmember of the Committee. I hope I see you all in New York. We\nwill get together for a drink in my room, some time during the\nproceedings and be able to stay just as long as the old flask\nholds out.\nYour s,\nquzM-O"
}