{
  "id": "d55-14",
  "text": "3\nSTATEMENT OF PRO (BAM ACCEPTANCE STANDARDS\nThe following statement is intended as a guide in the selection of pro¬\ngrams for us© by the Tape Network® Obviously few programs can meet all the\nstandards listed below; some programs excellently suited for the Tape Network may\nmeet only a few of them.\nThe Network as now constituted is to a large extent an outgrowth of the\nfirst Allerton House Radio Seminar of ±9h9; therefore, it is fitting that the\ncoramittees should accept the basic educational programing principles determined\nat that meetinge As phrased toy Robert B« Hudson, \"The Allerton seminar asserted\nthat the aims of educational broadcasting are the broad aims of educations\neducation in a democracy has the responsibility of lifting the\nlevel of understanding and appreciation of the people, of giving\nthe individual a knowledge of himself and his society, and of the\ntensions and perplexities in each;\nt cin a free society it is essential that the individual have a\ncontinuing sense of belonging and participating* of keeping up\nwith a complex and fast-moving world;\n«„*„it is the responsibility of education to foster and further that\nfeeling of belonging and counting.\"!/\nThe committees further agree that programs chosen for the Tape Network\nshould meet certain minimum standards as to: (1) network suitability; (2)\nengineering standards; (3) audience appeal; (U) subject matter; and (5) presen¬\ntation,\n1. Network Suitabilitye The programs distributed should be of wide¬\nspread interest ard should be selected to supplement the program\nresources of individual stations*\n2<> Engineering Standards® The engineering e ;anaards of the programs\ndistributed shall oonfora to the standard; drawn up by the NASS\nTape Network Engineering Advisory Committee.\n3® Audience Appeal* The programs should attract and hold their\nintended audiences.\nU® Subject Matter. The programs - again in Hudson’s words - should be\n\"distinguished by*..high concern for integrity in the selection...\nof materials, and by® • .consistent dedication to social purpose*,{\nSubject matter chosen should have the effect of:\n\"(1) informing,\n»(2) stimulating the individual to organize and give meaning to\ninform lion,\n17 Hudson, \"Allarton House 19ll9, 1950\", Hollywood quarterly, Vol. V,\n~ Moo 3, p. 239°"
}