{
  "id": "d55-144",
  "text": "THE UNIVERSITY OF TENNESSEE\nDIVISION OF UNIVERSITY EXTENSION\nBOX B450, UNIVERSITY STATION\nKNOXVILLE\nRADIO AND TELEVISION SERVICES April 2 ,\nRADIO STATION WUOT\nTO : Waldo Abbot, John Holt, Hugh Mix, Jim Slack\nFROM : Jack Westbrook, Chairman, _Network Acceptance Subcommittee\nSUBJECT: GREAT LAKES; WINDOW ON THE WORLD; SEVENTH CONTINENT; MAN1S\nRIGHT TO KNOWLEDGE; PURDUE BAND OF THE AIR; MORALS AND\nPOLITICS; and REPORT ON EUROPE\nLike the other gents on this subcommittee, I too have been\ninterfered with and/or retarded, one way or another, in getting around\nto auditioning these last few offerings. Not the least of the hindrances\nhas been two out-of-town trips.\nWe have three votes on the first mentioned program, and at least\ntwo votes of agreement on the others.\nGREAT LAKES—three ’’yeses.’’The views of the others are known, and\nI must report that my vote is a very reluctant ”yes.” I vote aye only\nbecause I think the basic material and ideas are very good, and, by\ncomparison, the presentation is considerably better than most of us can\ndo. Actually, I think WKAR should do much better. When I look at the\nnotes I made on the program, I wonder if I shoudn’t change my vote.\nThe narrator is' awful. He’s too much interested in golden pear-shaped\ntones, and not enough interested in a first-rate job of interpretation.\nThe dramatic sketches are poorly presented, as is the music poorly\nplayed. (All of this is relative, of course.) Moreover, there are\nmany overt propaganda pitches. The propaganda effect is inevitable,\nof .course, but it should be only that by-product that obtains from an\nobjective presentation* I am very much at a loss to understand wh/y\nthis program should receive yes votes, when CONTOUR COUNTRY was re¬\njected.\nWINDOW ON THE WORLD—Yes by Westbrook and Slack. I feel it is\nalways useful to know the views hold of us and of world affairs. And,\nof course, this program contributes to international understanding.\nSEVENTH CONTINENT—-Yes by Slack and Westbrook. Generally very\ngood. Audition programs sound like good material and good purpose.\nThe program is produced in the best ’’commercial style,” such* as using,\nunfortunately, an organ. I think the gimmicks and the so-called or\nintended dramatic effects often deter from the serious purpose and\neducational value of the program."
}