{
  "id": "d55-167",
  "text": "TO: Ed Slack, Jack Westbrook, Waldo Abbot\nand John Holt\nFROM: Hugh M. Mix\nDATE:\nB „ si ED\nMAEB headquarters\nMarch 1, 19$$\ni\\iiixu 4 bob\nSUBJECT:\nTHE SOVIET*^CEHE. TIE\nTHE WRITER] I'MticSONGS'\nLAKES i\nConcerning the latest package of audition programs, these are some of the finest I have\nheard so far* However, I would like to break down my remarks program by program be¬\ncause there are some reservations to be noted.\nTHE SOVIET SCENE (WHA, University of Wisconsin) - Although Professor Gasiorowski has\na very heavy accent, the overall quality of her voice is good* And once you get used\nto hearing her, what she has to say is very interesting* The only serious question\nabout this program is whether or not it will be outdated before it can be distributed\nto the network. For example, in the third program particularly, and to a certain extent\nin the second one, she contrasts what life in Russia is really like with Malenkov*s\nplan for more consumer goods and a better existence for the Russian peasant. Now, as\nwe all know, Bulganin has succeeded Malenkov as premier and has reportedly junked the\nformer regime’s plan for one emphasizing heavy industry at the expense of the consumer.\nI would vote \"yes’* for the series, but only after it had been re-evaluated in the light\nof this factor of dating.\nTHE MIND OF THE WRITER (WHA, University of Wisconsin) - Without doubt, this is an excel¬\nlent program. Professor Glicksman is convincing and authentic as an authority, and the\nacting is top notch. An enthusiastic \"yes.”\nFOLKSONGS (WHA, University of Wisconsin) - This, too, is a fine program. The reproduc¬\ntion is excellent, and the singer, Ed Sprague, has a good personality as well as a\nfine speaking and singing voice. I would like to follow the suggestion in this matter.\nThis program is far superior to the one on folksongs submitted earlier called THE WANDER¬\nING BALLAD SINGER. I vote ’’yes” on the Wisconsin program and propose that the previous\none be held for possible later release in favor of American Folksongs.\nGREAT LAKES (WKAR, Michigan State College) - In some ways this is the weakest of the\npresent offering, next to THE SOVIET SCENE. This observation has nothing to do with the\nquality of the program. Reproduction and production are good. And Tom Waber, on whom\nmost of the weight of the program falls, is up to his usual top standard. My only\nobjection to the program is that it is in many ways a promotion piece for the Great\nLakes region. This doesn’t necessarily rule it out. However, since you’d have a hard\ntime convincing an Oklahoman that the Great Lakes had anything to do with his economic\nwell being, I’m not sure we could use it here. Oklahoma is plugging for industry, and\nI’m sure we’re not the only ones who are. But the program should find wide acceptance\nin the middle west. Consequently, millions of people will benefit from it. To avoid\nbeing narrow minded on the subject, I vote ”yes\" for this offering also.\nHMMtln"
}