{
  "id": "d55-38",
  "text": "•2“\nI also enclose a form which I send out if the program is found to\nbe acceptable by the majority of the Acceptance Committee.\nI also enclose a copy of the submission form mentioned.\nYou do not have to do anything about tho evaluation forms ivhich are\nbeing sent to you, these merely give you trie stations* reactions to\ntne programs which you have voted as acceptable. You can check up\non your judgement by considering the comments made by various stations.\nThere is one more thing that I should mention, and that is, that-\ncertain programs to be distributed by the N4>TB Tape Network do not\ngo through the Network Acceptance Committee. These are such programs\nas those arranged for by Seymour Siegel principally in international\nfields.\nI aloo would like to call your attention to the fact that while\nthe Grants«in~Aid Committee will give a grant to an institution\nfor a series of -programs \"to be acceptable to the NAEB Tare Network,11\nthat grant is made upon the basis of a written submission form. In\nsome instances, the tapes, (the finished programs) do not come up to\nthis prospectus and therefore, grants-inlaid programs should be\nsubmitted to the Acceptance Committee and evaluated, in just the\nsame manner as programs received from other stations. There have\nbeen one or two instances where grants-in-aid programs were not of\na satisfactory nature when listened to.\nFor the first time this year we have the chief engineer of KUOM\n(Berten Holmberg) as a member of tine Committee. I think Mr. Holniborg '\nwill be an invaluable member of the Committee because he will\nconsider the tapes from a technical standpoint, as v/oll as from the\nstandpoint of content and production. He will help us in deciding\nwhether these tapes are of a quality to be dubbed for national\ndistribution.\nI’ve been informed that a small fund has been made available by\nthe NAEB to pay expenses of the Committee members to additional\nmeetings of the Committee. By additional I mean meetings in 1\naddition to the one held at the Institute at Columbus and the\nNational Convention which whis year will be in New York City. The\nsum is very modest and was based upon the expenses of the members\nin going to Urbana. A number of the new members say they can not\nget from their own institutions funds to take them to the Institute\nand probably not the National Convention because other people\nfrom those institutions will be sent ss representatives of their\nstation. I can not answer the question as to whether these funds\nmay be used to bring members together at Columbus or at the\nNational Convention. That question I am referring to Mr. Ausmus, i\nPresident of NAFB and Mr. Frank Schooley, Treasurer. I suggest J\nthat partial expenses might be made .available for such purposes, M\nprobably railroad fare to and from the place of the meeting. This M\nshould not overdraw our budget because it had been anticipated that ' M"
}