{
  "id": "d55-75",
  "text": "network Acceptance Cora&tt©©\nP age 2\nJuly 27, 1954\nIII* SGtt AHFJ IGAK WCftTSUES. 4 progs, Ui35 'to X7t3£. Infoiml talk\nwith readings from letters, etc* \"Portraits of four curious fig¬\nures in the American past* Based on diaries, journals and other\nbodes of personal record* I obert E* Streeter, Professor of English\nat tbs University of Chicago, Is the speaker*\" Programs*\n1* Samuel Sewall, Puri tan Judge 14*35 (oaapla)\n2. Parson testae, Biographer 13i3B (sample)\n3. Ellhu Burriti, the Learned Black¬\nsmith 17136\n4. John Ledyard and HI© Trip to Si¬\nberia 16*50\nthe two sample progress are being sent on tbe seme tape*\nIV* tHE IHTEUECmi ktWimm OF AHCIEHT MAK. 3 progs, 14 to IS min.\nAudiences adult, \"These are well read programs dealing with in¬\ntellectual life of ancient Mesopotamia showing how their world\nview is tmaAmm idly different from ours of today.\" \"these pro¬\ngrams are prepared under the directorship of Professor Thorfcild\nJacobson of tbe Oriental Institute, University of Chicago* They\nare based on the book, Intellectual Adventure &£ Apoiont\nwhich was prepared by the Oriental institute and published by the\nUniversity of Chicago Press. These programs are based on the chap¬\nters dealing with the good life In Mesopotamia, which were written\nby Dr* Jacobean. The text is road by Professor Josua Taylor,\nUniversity of Chicago,\" The first two of the three programs ore\nbeing sent on on© tap©*\nV* THE PGETE7 OF THE XVIXI GBRTDKI* 1 prog. 3I*4C, A talk be Fdward\ni osenhelm, Jr*, Assistant Professor of the Humanities in the Col¬\nlege of the University of Chicago.\nVX* ETHAK FHOHE, ty Edith Vharten - a reading. 50 sin.\nTO, THE mm Of TO semi, by Henry James - a reading, 50 min* Ethan\nFrom and X^St Turn g£ the Pcxm \"wore adapted for radio presenter\ntlon by Tits Haggard, former actress and professor of speech at tho\nUniversity of California,” %]gL ^1T: &£ J&£ Screw is road by Mrs.\nHaggard*\nThere will be two moss shipments of about this same sis© of U*\nof Chi. 1953 Ormt-in-Aid material.\nJtftqp"
}