{
  "id": "d55-85",
  "text": "August 18, 1954\nMr. Waldo Abbot\nStation WHOM\nUniversity of Michigan\nArm Arbor, Michigan\nDear Waldos\nAnd so on ad infinitums\nCONTOUR COUNTRY - WOI (GRANT-IN-AID)\n— NO - The idea of an actuality documentary on farming\nis certainly a worthy one. However, this series (at\nleast, the two audition programs) has too many shortcom¬\nings to overcome the merit of the idea* The choice of\ntaped interviews is not good; technically many of the\nrecordings are bad; the introductions to the programs\nare weak and will not help hold the audience; there is\ntoo much selling of Iowa - sure Iowa’s a great state -\nI was born there - but that doesn’t mean that listeners\nall over the country want to have so many boasting state¬\nments sho/ed down their throats - might be great for Iowa\nlisteners, but not others; the two narrator’s voices are\ntoo similar; the timing is bad in many places; and so on\nand so on* The idea was great, but it didn’t bear fruit.\nI hope that none of us considers the fact that some of\nthese shows we’re auditioning are grant-in-aid shows, be¬\ncause 1 don’t think that should have any weight whatso¬\never. On the contrary, I think it might help future\ngrant-in-aid committees to be a little more cautious.\nHOW’S THE FAMILY - WSUI (Grant-in-aid)\n— NO - Several things wrong with this, in my opinion*\nPossibly the worst fault is the format - it wears a\nlittle thin. The dramatic sketches are too long, for\nwhat little they do and say, and the actual meat of the\nprogram (the discussion following the dramatic scenes)\nis too short (one of the audition tapes had a Is 10 sum¬\nmary, the other was 2:40). In my opinion, it would be\nbetter if there were some narration, or shorter scenes\nfollowed by discussion. Even the format used might prove\nacceptable if the dramatic scenes were hotter. The show\nis over-written in that it over-emphasizes truisms, pre¬\nsents a warped viewpoint of certain things, e. g* * city\nlife, and sort of leaves you hanging in places. The\nacting is not so good in that some of the persons are"
}