{
  "id": "d55-88",
  "text": "Hr* Waldo Abbot\n-2-\nAugust 17, 1954\nWHAT WE LAUGH AT - U. of Chicago\n— NO - This idea is pretty good., but the presentation is rather deadly\nand Ifm afraid people wouldn*1 listen long enough to get interested*\nProf. Blair doe© not get across the real ideas of humor that he is trying\nto explain.\nWHAT IS MODERN POETRY - U* of Chicago\n— NO - There is nothing particularly wrong with this series, but, in\nthe first place, it is something that could be done equally well, and\npossibly better, by any college or university English department. In\nthe second place, it i«n*t even original with the B. of Chicago, but\nis an adaptation of a BBC series.\nTHE MEDIAN PEACE CONFERENCE - U. of Chicago\n— NO - This program, standing alone without any central theme, would\nnot get many listeners* It might be all right as a part of a series\ntrying to show something in particular, but not this way.\nENCORE - U. of Chicago\n— NO - The readings are well done, but, here again, any number of\neducational stations can, and do, present this type of nshort story*1\nprogram* Also, the length*are so different as to present an almost\ninsurmountable problem from the programming stand-point* As I have\nsaid so many times in the past, I do not feel that it 1® the function\nof the network to present programs which the member stations can do\nfor themselves* I*m afraid we do this all to often, and we deserve\nto be criticised.*.*this defeat® the purpose of the network*\nSTILE IN LITERATURE - B. of Chicago\n— NO - Same as above, except that the presentation is not so good.\nSTORIES IN THE WIND - Radio House, B* of Texas\n—* YES - These are not all of equally good quality. However, I have\nalways felt that there are not enough programs for children, and that\nshould be scan©thing that educational station® should carry. This is\na little ridiculous in places, and possibly adults would feel it was\nsilly all the time, but kids seem to enjoy this type of thing, and I\nthink we should make it available and then let the various static©\nprogram directors make up their ~inds, I ©specially like children* a\nprograms that teach them something and yet main t& in interest — they\nvon*t learn if they don»t listen.\nWell, there* s some more — 1*11 try to wind them all up within a day or\ntwo*\nCordially,\nHEHijy\ncc* Mr. John Holt\nHarold E. Hill\nAssociate Director"
}