{
  "id": "d779-1",
  "text": "•c NAEB NETWORK INTERIM BEPGBT\nApril 2, 1954\nTOs\nTHROUGH! Executive Director'\nNAEB Network\n1. Current budget considerations have resulted in the reduction of the Network\nHeadquarters staff from the equivalent of 5 to 4« parsons and the program\noutput to a maximum of 8 hours a week including both general and in-school\nprograms. If occasionally the output should exceed this limit, a com*\npensating drop will ijEmediately be made unless there is absolute surety of\nno ha sard to the general Network operation.\n2. Network Headquarters work assignments have been rearranged* More man hours\nare allocated to paper work, organizational work, individual problems* Less\nemphasis is put on the *mass operation11 aspect of Headquarters work, more on\n^personal service.® This is made possible by the facts of the limited work\nload and the lessened editing of tapes. (On the whole, I believe that pro*\ngram producers are doing increasingly better work in preparing masters.)\n3. Network Headquarters has worked out a method of integrating tho ^general® and\n*in-*schbol8 series into a single distribution schedule. Members of the Ii> >\nSchool Program Committee were asked to comment on the plan proposed several\nmonths ago. Later, the problem was thoroughly discussed with the In-School\nSubcommittee (Fleming, Henderson, and Day), and a mutual u»testanding of the\nproblems involved resulted. All are convinced that our new method of in-\nschool program distribution will be more satisfactory than the old, and will\nbe accepted as such by the majority of in-school stations.\n4* A new and improved mass duplicator has been installed, and it seems to be\nworking fairly well* It has done some excellent reproduction of music, though\noccasionally showing sam temperament in this respect. Mass duplicators are\napparently too delicate to be relied upon absolutely, for quality, whatever\ntheir obvious advantages. And Network budget does not provide far a fuTte\ntime maintenance man. Consequently we must rely on help available from the\nUniversity of Illinois which is also sometimes too short handed to meet\nemergencies or provide regular service.\n5. The ^old® duplicator has been overhauled and returned. Wb are not altogether\nsatisfied with the job. For instance, an “improvement® (actually a necessity),\nwhich was devised by a University of Illinois engineer, has not been in**\ncorporate! into the machine. Headquarters is remedying this deficiency. Other\nproblems with the manufacturer are being gradually solved.\n6. Space continues to be & great problem, as is inevitable in such an operation,,\nAn “audition® room which become a storage closet is now the Network Manager2 s\noffice. Some 70 disk cabinets, only recently installed at no cost to tho\nMEB are a wonderful help in organizing the hundreds of future master tapes,\naudition tapes, etc-, which must be readily at hand, and which, previously had\nto be stacked on the floor, on files, etc.\n7. About 6,000 Program Submission Forms have boon distributed. This is enough for\nhundreds of submissions. Submitters have boon understandably reluctant to go\nthrough the paper tsoek involved in making suisainsions, and too few of these\nforms have been utilised. However, Headquarters has been increasingly insistent"
}