{
  "id": "d779-47",
  "text": "Xa order to alleviate the work-load# we attempted for a period to place the\nresponsibility for the quality of master tapes on contributing organisation® whenever\npossible# but this did. not work well & and# on®# again* we ares auditioning all master\ntapes before duplication * Happily 3 the second duplicator acquired by the Network makes\navailable the worktime necessary for such auditioning•\nThe duplicators themselves deserve a few words,, since they are a key factor in\nour operation» They are in a better condition than was the old machine at the time of\nthe last convention® The old machine has been rebuilt# and both duplicators have been\nfairly reliable throughout the year® although* as m have said before# they do not lack a\nassure of temperament® During the past few weeks m have had some difficulty# apparently\ndu® to changes In temperature and humidity, but this trouble seems to be ironing out..\nThe Natwork Headquarters has always been somewhat handicapped by not having its\nown engineer readily available® Radio Station WILL always has men and continues to\nb@ most helpful in this area® but of course its ©agineers have their prime duties\nelsewhere• Fortunately® Mt, Cecil Bidlaek# the NAEB Television Engineer® is now often\nat the Headquarters office# and he has .kindly volunteered to give the Network Head¬\nquarters the benefit of hie electronic experience when not engaged in his primary\nresponsibilities as TV engineer©\n'The process of scheduling and offering programs to our member stations now takes\nplace at an earlier date® and stations know three months in advance what will be available\nto them from the Network* We hope in the future to make this information available as\nmuch as six months in advance®\nThe use of submission forms by contributors has greatly increased since last year#\nthough it is still far fro® universal# and sometimes their use is far from complete\nOccasionally Headquarters has assembled for the Network Acceptance Committee information\nwhich was not included with the forms. We continue to promote the use of these farms*\nany number of which are available to members at any time®\nThe NAES Network has been in operation less than five years. It began when\nnineteen stations took turns playing seven tapes. It now has a headquarters office\nwhich is always in the process of distributing twelve# fifteen# or mor% aeries directly\nto eighty-one member stationsAssessments for the three ©lasses of stations are now\n1600# $375# and $225, respectively. And for this payment they may obtain recorded\nprograms# some of which cost hundreds or even thousands of dollars® for less than it\nusually cost® to broadcast disk-recorded music,. Moreover# this project is now almost\nself-supporting», i,e® station supported®\nThough problems remain and new problems shall arise# the practicality of network\nuse of tap® has been proven,. Major commercial networks are now considering how they\ncan best utilise tape® In this area# as in others® the NAEB has led the way® But the\norganisation has by no means become static. It is constantly seeking and reaching far\nnew goale* For instance# the Associate Members Committee has been studying the problem\nof haw the Network can broaden the scope of its operation in order to serve this\ncategory of members.\nIn conclusion# may we note once again that the NAEB Network is not an independent\norganisation# but an association# a function® a tool of the educational broadcasters of\nAmerica® There are a number of individuals end organisations who deserve special, credit\n%"
}