{
  "id": "d721-7",
  "text": "- 8 -\nAny ballot indicating more than one choice for the same candidate for the same\noffice will be invalid for that office.\nA statement of these conditions which invalidate ballots shall appear on each\nballot.\nSec. Counting of Ballots. The Board of Tellers shall count the first choices\ncast for the candidates in each office. Those candidates receiving a majority\nof the first choice votes cast for the respective offices shall be declared elected.\nIn those offices in which no candidate received a majority of first choice votes,\nthe Board of Tellers shall tabulate the number of first choice votes, the number\nof second choice v*>tes, and the number of third choice votes cast for each\ncandidate in each contested election. Then the following shall be performed on\nthe preferential votes cast for each candidate* the number of his first choice\nvotes shall be multipied by two and the sum of these two products shall then be\nadded to the number of his third choice votes. This sum shall be called the\nwei^ited vote. The candidate with the highest weighted vote in each office for\nwhich no candidate secured a majority of first choice votes shall be declared\nelected to that office.\nSec. 6. Election of Regional Directors. The right to vote for candidates for\nregional directors shall Ibe restricted to the active members of the region for\nwhich the director is being elected.\nThe ballot for regional directors shall indicate clearly the composition of the\nregions involved in each regional election.\nSec. 7. Elections to Fill Vacancies. The Constitution provides that the Board\noTHKr ectors~sKa3T^ in the offices and in the Board of the\nAssociation until the next annual election. In the event the tenure of positions\nthus filled extends beyond the next annual election, the Committee on Nominations\nshall prepare a slate of candidates to fill the unexpired term as a part of the\nannual election. The incumbent by appointment shall be one of the candidates.\nThe ballot shall indicate the length of the unexpired term for which the election\nis being held.\nArticle V - Revision of By-laws\nSec. 1. Authority to Revise. Revision of By-laws shall be by an affirmative\nvote ot two-thirds of the Board of Directors. Changes in the By-laws may be made\neither when the Board is assembled or by mail as previously provided in Article IT,\nSec. 6 on the Board of Directors.\nSec. 2. Proposals for Revision. Proposals for revision of the By-laws may be\nmade By t&e Eixecutive^Comna £t*ee“to the Board, upon initiative petition signed by\nfifty active members of the Association, and may be initiated within the Board\nitself. In any event, the proposals for revision in written form must be in the\nhands of members of the Board not less than thirty nor more than ninety dayB before\na vote is taken on the proposal."
}