{
  "id": "d721-73",
  "text": "TO: LAM\nFROM: JAR\nHE: Suggestions and proposals to straighten out AERT\nApril 11, 1956\nHerewith are my thoughts on AERT, the constitution and by-laws, and so on.\nSome of these thoughts are actual proposals for action to be taken ... others\nare random thoughts on what I consider to be trouble areas.\nConst. Art. II - Purpose - \"to extend and improve the educational use of radio\nand television.\" I don’t feel that we’re necessarily doing that. It seems to\nme that we’re kind of foundering around, not moving In any particular direction.\nIt seems to me that decisions should be made as to where we’re supposed to go\nso we can then start going there.\nArt. 17 - Regional Divisions. I spoke to you about this. Also dropped a line\nto Arnold Wilkes to get his thought. He concurs. Suggest we split up the\nSoutheastern region into two regions. As it is, it’s just too much territory\nfor one person to handle. Suggest a new dividing line be established just\nsouth of Virginia and West Virginia. This wou d then put the solid south into\na region of its own, which I think is as it should be, and would also give X\nus a new middledtlantic region.\nArt. VI - Board of Directors. As you know, we have a vacancy in the board due\nto the fact that we only have three directors-at-large. The constutution\nspecifically calls for four directors-at-large.\nArt. H - Local Chapters. I feel very strongly that we should set up the proper\nmachinery so we can encourage the forming of more local chapters. We have\ndiscussed this before. More about this below.\nBy-Laws - Sec. U - Institutional Members. We have several institutions which\npresently appear on the membership rolls with five-dollar Individual memberships.\nThis situation should be corrected. An example of this is the Archdiocese of\nChicago which has an individual membership (not in the name of anyone in particu¬\nlar) for five bucks. Suggest the Board of Directors adopt action to rectify\nthis situation. Either these organisations should give us another ten bucks,\nor should request that we change the membership to an individual one in the name\nof some one person. This Is a type of discrepancy for which there is no excuse,\nand we ought to clean It up.\nSec. 2 - Life Membership - We don’t use it, but the provision is there for it.\n. In the event that the question ever comes up, suggest the Board either do away\nwith it, or else substantially increase the fee for it, which Is presently $25.\nI realise this is not important now, but we should be prepared for the day when\nthe question might come up.\nSec. 3 - Associate members - We ain’t got any. Let’s either sell some, or else\nremove the category from the by-laws. Present fee for this is $3> which we just\ncan't afford.\nSec. 6 - Dues - Let’s straighten out this whole dues mess, particularly the deal"
}