{
  "id": "d207-10",
  "text": "4.\nGA/6\nshould bo appointed as the Auditor to the ABU for 1967/68 and that tho General\nAssembly should record its warm appreciation of the services of Mr Hiroshi Sho\nwho had carried out the responsibilities of Auditor from the establishment\nof the ABU until October 1967*\nDecisions of the Administrative Council \\\nThe Vice-President pointed out that, as required by the Statutes, it was\nnecessary for the General Assembly to consider the confirmation of decisions\nmade by the Administrative Council, acting on behalf of the General Assembly,\nduring the preceding year. These decisions had been set out in the Council’s\nreports to members, particularly the reports numbered A/4 and A/6 submitted\nfor consideration at the present meeting and had been discussed during the\nwork of the Committees.\nIt was agreed that the General Assembly should confirm the decisions made\nby the Administrative Council, acting on behalf of the General Assembly, at\nthe meetings of the Council held on 3-5 July and 19-20 October 1967*\nPress Statement\nAt the invitation of the Vice-President, the Secretary-General submitted a\ndraft press statement dealing with those aspects of the work of the Fourth\nGeneral Assembly about which it might be desirable to make a public announcement,\nAfter discussion, during which some minor amendments were agreed upon, the\nGeneral Assembly adopted the draft statement and requested that it should be\nissued to the press immediately and that copies should also be made available\nto delegates for use on their return to their own countries.\nDate and Place of Fifth General Assembly\nIn response to an enquiry from the Vice-President, Shri A.K. Sen announced\nthat All India Radio wished to offer to be host for the ABU’s Fifth General\nAssembly in Hew Delhi and would like to suggest that this meeting be held on\nappropriate dates in November 1968.\nThis proposal was warmly welcomed by the representatives of other members\nand was carried with acclamation. Speaking on behalf of the other members,\nthe Vice-President said that he wished to thank AIR for its generous offer and\nthat he felt sure all members would look forward with much pleasure to\nattending the 1968 General Assembly in Hew Delhi.\nClosing Address\nThe Vice-President explained that the Chairman of the U.H. Visual Information\nBoard, Mr Snowden Herrick, had been invited to attend the meeting as he had\nexpressed a wish to address the delegates.\nMr Herrick said that, on behalf of all the members of the VIB, he wished to\nthank warmly the ABU?s Secretariat and Mr Raman and the officers of RTS for\nthe efficient arrangements that had been made for the VIB meeting in Singapore\nand for the many courtesies which had been extended to the members of the\nBoard. He would also like to thank the many ABU delegates who had attended\nthe joint meeting with the Board, particularly for the constructive comments\nand suggestions which they had offered on the visual information services\nprovided by the U.H. agencies. The members of the Board considered that the\njoint meeting had been most helpful to them and they hoped that it had also\nbeen useful for the ABU delegates."
}