{
  "id": "d207-100",
  "text": "b) In determining the amount of the share to be borne by each full member all\nthe full members shall be classified into eleven groups. Members shall be\nclassified into the various groups in proportion to their operational budgets for\ntheir previous fiscal year. Operational budget for this purpose shall be the\nprovision made in the annual budget for the gross expenditure of each member,\nexcluding capital expenditure.\nc) All full members shall belong to one of the groups to which the units on the\ntable hereunder are assigned, and the total of the subscriptions payable by all\nfull members during a fiscal year shall be divided by the total of the units\nassigned to full members. The sum obtained by the division shall be the unit\nsum of the subscription for that fiscal year and the subscription payable by\neach full member shall be obtained by multiplying the said unit sum by the\nnumber of units assigned to the said full member.\nd) Table of Subscription Groups:\nGroups\nNumber of Units\nA Up to\n100,000 dollars US\n1\nB From\n100,001 n\nit to\n300,000 dollars US\n2\nC it\n300,001 it\nit it\n600,000 it it\n3\nD n\n600,001 it\nit it\n1,250,000 n it\n5\nE n\n1,250,001 it\nit it\n5,000,000 it it\n7\nF n\n5,000,001 n\nit ti\n10,000,000 it it\n10\nG it\n10,000,001 it\nit it\n20,000,000 it n\n15\nH it\n20,000,001 it\nit it\n35,000,000 it it\n20\nI n\n35,000,001 it\nit it\n60,000,000 n it\n30\nJ it\n60,000,001 it\nit it\n100,000,000 it it\n45\nK Over\n100,000,000 it\n't\n65\ne) In no case whatsoever shall the amount of the subscription to be paid by a\nfull member exceed forty percent of the total amount of the subscriptions.\nShould the same exceed forty percent of the total of all the subscriptions, the\nsubscription payable by the said full member shall be reduced to forty percent,\nand the amount by which it is so reduced shall be allocated to the other full\nmembers on the basis of the above scale.\n3. Contributions:\nAssociate members shall pay no subscription but shall contribute to the expenses\nof the Union, having regard to the services rendered by the latter and the financial\nresources of each of these members:\na) by paying, on the one hand, an annual contribution, the amount of which\nshall be fixed each year by the General Assembly for each member considered\nseparately at a sum equal to half of the sum that would be payable as a sub¬\nscription pursuant to the provisions of Clause 2 of this Article if the said\nmember were a full member, provided, however, that the number of units for\nany member shall in no case be greater than 15, and\nb) by paying, on the other hand, a sum to be fixed at the end of the fiscal year\nby the General Assembly in compensation for any special work that might have\nbeen undertaken at their request by the ABU.\n8"
}