{
  "id": "d207-11",
  "text": "GA/6\n5.\nOn behalf of ABU members, the Vice-President thanked Mr Herrick and asked\nhim to convey to the other members of the Board the sincere gratitude felt\nby all members of the ABU concerning the Board's decision to meet in\nSingapore. ABU members had been pleased to participate in the joint\nmeeting and had also been happy to have the opportunity of meeting the Board's\nmembers on other occasions during the General Assembly.\nThe Vice-President then invited Mr Guruge, representing the full members,\nand Mr Chalmers, on behalf of the associate members, to address the General\nAssembly.\nMr Guruge said that he wished to express to Mr Raman and the officers of RTS\nthe very sincere gratitude of the members represented at the Fourth General\nAssembly for all the assistance they had given as the host organisation for\nthe meeting. Speaking for the full members, he also wished to thank other\norganisations in Singapore which had extended courtesies to the delegates\nand also the President and officers of the ABU and the delegates who had\naccepted the responsibility of acting as Chairmen and Rapporteurs of the\nCommittees. The full members considered that the Singapore General Assembly\nhad been very valuable and were grateful to all those who had contributed\nto achieving its success.\nSpeaking on behalf of the associate members, Mr Chalmers endorsed the views\nexpressed by Mr Guruge about the outstanding success of the meeting and the\nvalue of the action it had taken for the future development of the ABU.\nThe associate members wished to offer their sincere gratitude to the host\norganisation for the assistance that had been extended to them in so many\nways, the President and Vice-Presidents and the Chairmen and Rapporteurs of\nthe Committees and also the Secretary-General and his officers for their\nuntiring work in the smooth running of the meeting.\nResponding to the earlier addresses, Mb? Raman thanked the Chairman of the\nVIB and the representatives of the full and associate members for their\ngenerous comments. Acting as host for the General Assembly had been a\npleasant and valuable experience for RTS. He was happy that, with the\nassistance of the ABU's staff, the arrangements had run smoothly and the\nmeeting had been a further step forward in the growth of the Union.\nOn behalf of the President and the Vice-Presidents, Mr Stringer said that he\nagain wished to thank Mr Raman and his officers for all their assistance\nto the delegates and also to thank the speakers for their comments about\nthe contribution made by the ABU and its officers,\nMr Stringer declared the Fourth General Assembly closed at 1630.\nG.H. STRINGER\nVice-President"
}