{
  "id": "d207-16",
  "text": "5.\nN/8\n4*13. Recognising the need to make changes in the Statutes in order to make it\npossible to secure additional revenue through increasing the amount\nof the unit of subscription of full members and increasing the\nmaximum number of units payable by associate members, and\nrealising that there was a need for a number of consequential and other\nminor amendments to be made to the Statutes and its annexes,\nThe General Assembly\nresolves that the Statutes of the ABU and the Annexes thereto be amended\n(a) by the adoption of the amendments to the Preamble and to\nArticles 1, 2, 5? 9? H? 15? IT and 18 as set out in\ndocument G/9$\n(b) by the adoption of the new Article 19 as set out in\ndocument g/9 with the exception that the title of this\nArticle will be \"Final Provisions\" instead of \"Date of\nEffect\"5\n(c) by the addition of a new sub-clause 3(b) to Article 7 as\nset out in document G/lO and the renumbering of the existing\nsub-clause 3(b) as sub-clause 3(c), and\n(d) by adopting the amended Annexes to the Statutes as set out\nin document G/9*\n4.14. Being aware of the need to fix a date for giving effect to the amendment\nto Article 15 referred to in Resolution 13(a) above, and to put\ninto effect the expressed intention of the Third General Assembly\nthat the value of the unit of subscription of full members should\nbe Increased for the 1967/68 fiscal year, and\nrecognising that members had already adopted these changes on a voluntary\nbasis,\nThe General Assembly\nresolves that\n(a) the revised scale of units of subscription set out in\nArticle 15 as amended shall be operative from 1 July 1967?\n(b) the value of the unit of subscription for the 1967/68\nfiscal year shall be &US125? with effect from 1 July 1967?\n(c) the increase from 15 to 20 in the maximum number of units\npayable by associate members provided for in Article 15 as\namended shall be operative from 1 July 1967? and\n(d) the value of the unit of contribution payable by associate\nmembers shall remain unchanged at $100.\nOther Resolutions of the General Assembly?\n4*15. That the General Assembly records its very sincere appreciation of the\naction of the U.N. Visual Information Board in arranging to meet in\nSingapore, thus enabling joint VIB/ABU meetings to be held which proved\nto be of great interest to ABU members."
}