{
  "id": "d207-17",
  "text": "6.\n4.16.\n4.17.\n4.18.\n4.19.\n4.20.\n4.21.\n4.22.\n4.23.\n4.24\n4.25.\n4.26.\njst/8\nThat, with a view to assisting members in making contacts with each\nother, the Secretariat should arrange for up-to-date lists of the names\nand positions of their senior staff to be exchanged between members.\nThat the Secretary-General is authorised to provide the International\nFilm and Television Council (IFTC) with an estimate of the cost of\nestablishing an IFTC office in the Asian/Pacific area without committing\nthe ABU to collaborate with the IFTC until a specific IFTC proposal has\nbeen fully considered and approved by the Administrative Council.\nThat AIR should be informed that the General Assembly expressed its warm\nappreciation of the offer made by AIR regarding the participation by\nstaff from other ABU members in the AIR Staff Training School Courses and\nnoted with satisfaction the wide range of courses in tho programme field\nwhich are arranged at the School each year.\nThat the budget recommended in the report of the Finance Committee\n(Document FC/7) is adopted as the ABU budget for 1967/68.\nThat, with regard to Resolution 5l(c) of the Third General Assembly,\nappointments to senior positions on tho Secretariat shall bo subject to\nconfirmation by tho Administrative Council.\nThat the Administrative Council is authorised to increase the salary of\nthe Secretary-General, as and when it sees fit, by an amount or amounts\nnot exceeding a total of SUS2000 per annum.\nThat Mr Takashi Matsunaga shall bo appointed Auditor to the ABU for 1967/68•\nThat the ABU records its warm appreciation of the services of Mr Hiroshi\nSho who was Auditor of the ABU's accounts from the establishment of the\nUnion on 1 July 1964 until 30 October 1967.\nThat, while recognising the need for the ABU to avoid involvement in\ninter-governmental relations and that the Secretariat has already a\npressing burden or work, the General Assembly requests the Secretary-\nGeneral to arrange for as much assistance as is practicable to be made\navailable to members in developing countries desiring to prepare\nsubmissions aimed at seeking aid for the development of their services\nin their own countries.\nThat, while recognising that it may take a number of years to complete\nthe project, the ABU requests the Secretariat to proceed with the\ncompilation of a catalogue of such representative ethnic music of the\ncountries of members as is available in the form of recordings or\nmusical scores.\nThat a further Radio Festival of Ethnic Music should be arranged by the\nSecretariat towards the end of 1968 and steps should be taken to stimulate\nABU members in the Asian/Pacific region to participate in this Festival\nto the greatest possible extent."
}