{
  "id": "d207-18",
  "text": "7\n4*27* That the ABU notes with satisfaction the progress made in putting into\neffect the recommendations originating from the FAO/aBU Farm Broadcasting\nSeminar held in Tokyo in October 1966 and requests the Secretary-General\nto continue to take all possible steps to activate the proposals resulting\nfrom this Seminar.\n4«28. That the ABU commends the progress being made towards the joint production\nof educational films about Asian countries for use in schools, in the\nfirst series of which four ABU members have expressed their intention of\ncollaborating.\n4*29* That the ABU expresses satisfaction that MK proposes to establish an\nNHK International Library of Educational Programmes which will be made\navailable to members in developing countries at minimum cost, and requests\nthe Secretariat to obtain further information about the similar EBU\nproject for maintaining a catalogue of EBU educational television programmes,\n4*30, That the Secretariat should seek information from members with available\ninterlude films so that an exchange of suitable material of this type\ncan be arranged as soon as possible.\n4*31, That the Secretariat should prepare a questionnaire requesting from\nmembers information about their administrative structure, programme policies,\nproportional budget allocations and other relevant information which\ncould be useful to other members.\n4*32. That the Secretariat should collect and circulate information about the\ntypes of programmes broadcast by members and the proportions of broadcasting\ntime allocated to the various programme headings,\n4•33• That the Special Television Prize should be continued as an integral\npart of the annual competitions for the ABU Prize with the same conditions\nas for the 1967 experimental competition except that only one entry per\nmember may be submitted for the television competitions on the under¬\nstanding that programmes submitted as low cost productions would also be\neligible for the main Television Prize.\n4*34* That the General Assembly records its warm appreciation of the action of\nDHK and the ABC in continuing to give the two major prizes of $US1000 and also\nin contributing an amount of $100 each towards the Special Television Prize.\n4•35• That, with respect to the proposal arising from the recommendation of the\nFAO/ABU Farm Broadcasting Seminar concerning an international competition\nfor young farmers, the suggestions put forward by EHK regarding\npreliminary investigations aie noted and the Secretariat is requested to\ntake such action as is practicable.\n4*36. That the General Assembly takes note of the information given by the\nDirector-General of AIR to the President of the ABU regarding participation\nby the Union in a Music Rostrum for Asia to be organised by the Interna¬\ntional Music Council, and suggests to the Administrative Council that it\nshould study the possible scope of such participation sympathetically."
}