{
  "id": "d207-20",
  "text": "BOX 3636, G.P.O.,\nSYDNEY.\nASIAN BROADCASTING UNION\nCABLE ADDRESS: ASBUN. SYDNEY\n6th November 1967\nBefore I left Singapore last Tuesday I arranged for a parcel to be sent\nto you containing the documents used during the ABU General Assembly, so\nthat these would be available to you without delay. The Proceedings will\nbe published as soon as possible but in the meantime we are anxious that\nthe documents should be available to members not represented in Singapore.\nThe parcel was sent by airfreight, through BOAC-Qantas, the consignment\nnumber being 08l/l465377* We are a little worried about its reaching you\nsafely as my Assistant in Sydney, Miss Cook, who took the parcel to Ihe\nairfreight office just before she left Singapore, found that she had\nalready packed your address in her luggage and therefore had to put it on\nthe parcel from memory. The address on the parcel is:\nMr William J. Harley\nPresident\nNational Association of Educational Broadcasters\nConnecticut Avenue\nWashington D.C.\nU.S.A.\nTo assist you and your officers in looking at the contents of the parcel, I\nshould explain that the structure of our General Assemblies is as follows:\n(a) Opening Plenary Session, which is attended by all delegates and\nwhich deals with matters such as are shown\nin the first section of the agenda (document\nN/l), e.g. appointment of Committees etc;\n(b) Committee Meeting^, which are the working sessions;\n(c) Closing Plenary Session, which is open to all delegates and which\nreceives and normally adopts the\nrecommendations of the Committees.\nThe documents in the parcel comprise those used at the Opening Plenary Session;\nthe report, minutes and papers for each Committee, and the press statement\n(document N/7) adopted at the Closing Plenary Session. The minutes of the\nClosing Plenary Session will be completed and distributed to all members as\nsoon as possible, but will add little to the information in the parcel as\nthe recommendations set out at the end of the report of each Committee were\nadopted without alteration.\n*\nIf there is any other information you would like to have about the meeting,\nI will of course be glad to do all I can to supply it. I thought it was a\nvery useful conference both officially and in the opportunities it provided\nfor personal and informal contacts among our members. It was also the best\nattended with 98 delegates and observers.\nWith kindest regards,\nMr William G. Harley,\nPresident,\nNational Association of\nEducational Broadcasters,\n1346 Connecticut Avenue, NW,\nSuite 1101 Cupont Circle Building,\nWASHINGTON. D.C. 20036\nU.S.A.\nYours sincerely,\nCHARLES MOSES\"\nSecretary-General"
}