{
  "id": "d207-29",
  "text": "ASIAN BROADCASTING UNION sLT GP°\nOFFICE “OF THE SECRETARY-GENERAL CABLE ADDRESS: ASBUN. SYDNEY\n,, %\n23rd August 1967\nI was delighted to receive today your letter of 17 August taking up again\nthe question of NAEB associate membership of the ABU,\nAt the recent Administrative Council meeting in Bangkok some amendments\nto our Statutes which I had been asked to prepare were endorsed by the\nCouncil and will go to the General Assembly in October, These amendments\nprovide that the contributions of associate members will be \"fixed each\nyear by the General Assembly for each such member •••••• but will not exceed\nhalf the number of units that would be applicable if the member were a full\nmember'1.\nThis amendment is intended to give the General Assembly some discretion\nin fixing the contributions of associate members: there is no such discretion\nin the case of full members. In drafting the amendment I had in mind\norganisations or associations such as NAEB, However, if we have to wait\nfor the General Assembly, it would mean that an application from NAEB could\nnot be considered until after the amendments to Article 15 have been approved\nand, even then, one cannot be sure that the discretionary power would be\nexercised,\nI have been giving some thought to the case of NAEB which I personally feel\nis a very special one and suggest that a way out could be found if you are\nprepared to attach an explanatory note to your application and not fill\nin the answer to 5(b) on page two of the form, except to say \"see attached\nnote”.\nKnowing something about your members and the way you operate I have drafted\nthe sort of explanatory note that would present an excellent case, would\ncreate no problems for the ABU and, I hope*would not make you feel your\ntongue pressing hard in your cheek. For my part, for reasons^prefer not\nto put on paper, I have no hesitation in suggesting this step.\nProvided you send the application to the President of the ABU, Mr Maeda,\nwithout delay, associate membership for NAEB should be assured in ample time\nfor you and \"Lady Moses”(i) to be with us all in Singapore,\nThe completed form with a brief covering letter should be addressed to:\nMr Yoshinori Maeda,\nPresident,\nAsian Broadcasting Union,\nc/- Nippon Hoso Kyokai,\n2-3, Uchisaiwai-cho, 2-chome\nChiyoda-ku,\nTokyo,\nJapan,\nPerhaps in the covering letter,in addition to expressing the hope that you\nwill renew your friendship with Mr Maeda, it might be a good thing to\nmention your real interest in assisting the developing countries of Asia,\nespecially in the fields of education and national development. Such a\nletter could then be circulated to members. You might also mention NAEB's\nassociate membership of the EBU, But don't mention this exchange of\ncorrespondence or my Tokyo office - which operates in NHK premises -\nwill wonder why they haven't been sent copies* On the other hand it might\nbe as well to say that, following a discussion you had with me during the\nEBU Education Conference in Paris you have decided to submit an application\nfor associate membership of the ABU. You will remember that your previous\napplication was not submitted, your letter to me being treated as an enquiry."
}