{
  "id": "d207-44",
  "text": "APPENDIX A\n- 3 -\nAGENDA ITEM 24. The Role of TV and Radio in Creating A Scientific Approach to\nPresent Day Problems in Developing Countries\nFrom AIR\n\"The ABU, could help to define this role in order to generate and enthuse a\nscientific climate in the tradition-bound societies. A scientific attitude\nwould not only help the drive against ignorance and superstition but also\nenable men and women to accept new ideas and technological change.\"\nAGENDA ITEM 25. Involvement of the Audience in Broadcasting\nFrom AIR\n\"Until recently the tendency has been, particularly on the part of national\nand government-controlled broadcasting organisations, to use sound radio\nand TV for publicity purposes and for informing people. But there is an\nawareness of the need to get listeners involved in problems and create\namong them a feeling of participation. This new concept of communication\nwould mean changes in techniques as well as in the approach to people and\nproblems. A discussion of the new approach and techniques would help\ndeveloping countries to utilise broadcasting even more purposefully.\"\nAGENDA ITEM 26. Audience Research - Exchanges of Information\nFrom UARBC\n\"This subject was discussed by a previous ABU General Assembly and papers\nfrom some member organisations were submitted expressing the importance of\nconducting audience research and of exchanging information about the\nfindings.\nIt may be helpful to determine what type of material in this field should\nbe exchanged.\"\nAGENDA ITEM 27. Content of Radio Programmes\nFrom UARBC\n\"Do ABU members determine in advance the proportion of the different types\nof programmes included in their radio transmissions (e.g. cultural, enter¬\ntainment, news, drama, spoken word, music, songs, etc)? Is this done\naccording to the needs and circumstances of the audiences concerned? If\nso, to what extent are the proportions firmly applied and what factors\ndetermine the fixing of the proportions?\"\nAGENDA ITEM 28. A TV News Agency\nFrom AIR\n\"A TV News Agency to be formed to function under the auspices of the ABU\nwould help improve the quality and quantity of news material from Asian\nand African countries.\"\nAGENDA ITEM 29. Exchange of Music Programmes\nFrom AIR\n\"Most countries of the ABU region broadcast their own music, i.e. music of\ntheir own area, and the music of Europe. The area, however, has live"
}