{
  "id": "d207-45",
  "text": "APPENDIX A\n- 4 -\nmusical traditions and an exchange of music programmes is suggested to get\nto know and appreciate the musical traditions of neighboring countries. To\nbe purposeful, this exchange of programmes would have to be on a continuing\nbasis.”\nAGENDA ITEM 30. An Asian Magazine in Sound\nFrom AIR\n“This Magazine, to be broadcast on a weekly basis, should be based on\ncontributions from the member countries. The contributions should be sent\nto the ABU Secretariat and distributed by it.”\nAGENDA ITEM 38(a). Heterodyne Eliminator for Use in Radio Reception of Programmes\nto be Rebroadcast\nFrom AIR\n”The report describes the design of a sharply tuned, continuous variable\nfrequency notch filter for use in eliminating annoying heterodynes due to\nundesired signal in radio reception of programmes meant to be rebroadcast.”\nAGENDA ITEM 38(b). A Method of Testing Microphones\nFrom AIR\n\"In a broadcasting organisation, it is necessary that the microphones used\nin studios be periodically tested so as to ensure their quality of per¬\nformance. The standard testing of the microphones requires that the\nenvironment be free from noise and reflections and that the wavefront of\nthe sound waves at the location of the microphone be plane. These condi¬\ntions cannot be met easily except in a laboratory which has an anechoic\nchamber. In this report a method of achieving the result with reasonable\naccuracy inside the studio is described.\"\nAGENDA ITEM 38(c). Aluminium Conductors for High Power Shortwave Feeders\nFrom AIR\n\"In the paper submitted to the 3rd General Assembly of the ABU in 1966\nstudies undertaken by All India Radio to develop feeders using Aluminium\nConductors for use with high power shortwave transmitters were described.\"\nThree experimental feeder lines using aluminium conductors - both solid\nand stranded - were erected and these were tested successfully with 100 kW\nshortwave transmitters. In order to simulate voltage conditions obtainable\nwith 250 kW shortwave transmitter power, deliberate mismatch sections were\nintroduced in a part of the feeder lines but keeping the other parts\nmatched. The feeders were tested with 100 kW transmitter power, but with\nSWR up to 7 in the mismatched section. The feeders have been tested to\nwork satisfactorily.\""
}