{
  "id": "d207-46",
  "text": "NEWSLETTER NO, 1\nx~ '\nTo All Delegates\nI am very happy to learn that you will be attending the\nFourth General Assembly of the Asian Broadcasting Union in\nSingapore later this month. As you may have read from the ABU\nNewsletter, the meetings will be conducted at the Singapore\nConference Hall. Many of you would have visited Singapore at\nsome time or other but I would like to take this opportunity\nto acquaint you with certain factors which would assist to\nmake your stay here comfortable.\nHealth\nHealth requirements for an entry visa to the Republic is\nInoculation against small-pox and cholera. Although reputed\nto be a clean and beautiful city, our Prime Minister has just\ninitiated a drive to make Singapore the cleanest and healthiest\nplace in any part of the world. It is one of the few places\nin South-East Asia where you may safely drink water straight\nfrom the tap.\nCurrency\nThe Republic of Singapore issues its own decimal currency -\nthe Singapore dollar and cents. It has the same value as the\nformer Straits Settlement's or Malayan dollar and also the new\nMalaysian dollar. These three currencies circulate in Singapore\nand are freely interchangeable at par.\nPractically all foreign currencies can be changed in\nSingapore at any bank, the approximate ratos of exchange being,\n£1 Sterling to S$8.fj0 and US$1 to S$3.\nNhat to wear\nSingapore has a tropical climate, the day-time temperatures\nbeing around the nineties (Farenheit) with the evening temperatures\naround the eighties (Farenheit) getting slightly cooler towards\nthe early hours of the morning. You are advised to bring\nalong lightweight clothing. Though October is not normally the\nrainy season, it may be prudent to bring along raincoats during\nyour visit here.\nWith very few exceptions, evening dress is not usually worn\nand on most occasions It is sufficient to wear lounge suit.\nDay-time wear for most of the inhabitants usually consist of\nlight casual clothing. Women wear frocks and occasionally,\nevening gowns for night-time entertainment.\n-BN General Assembly.\nAll arrangements are in the final stages of preparation\nto ensure the success of the Fourth General Assembly in\nSingapore. Other official arrangements have been made to\nensure that your stay in our Republic • is a pleasant and\nmemorable one.\nNOTE\nLuggage tags and labels are enclosed herein. Please\nbring your swimming costumes for the Seaside picnic on\nSunday, 29.10.67.\n4th October, 1967."
}