{
  "id": "d207-53",
  "text": "to the General Assembly at the Closing Plenary Session exceeded 60.\nThe Secretariat faces a big task during the coming year in putting into\neffect, or taking the required action on, many of these resolutions. We\nwill be busy, too, in working on the reports of the General Assembly so\nthat every member will receive by air at an early date at least one copy\nof each of the two Volumes of the Proceedings. There can be no resting\nwhile we in the Secretariat recover from the pressures of the work in\nTaipei; now we have to work at getting through the work our members\nhave provided for us --to keep us busy!\nThe members of the Secretariat enjoyed the opportunity the General As¬\nsembly gave us of renewing old friendships and making new friends. The\nFourth General Assembly may seem a long way off now but time passes\nquickly and we shall all be meeting again in Singapore in what will certainly\nseem to be only a short time. And at Singapore there will be a number of\nnew members whom we will all be glad to get to know.\nAt a charming farewell gathering at which the children of the BCC's staff\nhelped to entertain us, our host Mr. Lee Shih-feng presented to the\ndelegation from Singapore the flag bearing the ABU Emblem which had\nbeen used during the Third General Assembly. As we left the function\nwe found in the garden outside a lighted sign bearing the words \"Till we\nmeet again in Singapore\". These gracious gestures to our next host were\ntypical of the thoughtfulness of the BCC who warmed our hearts so often by\ntheir kindness and by the trouble they took to make our stay in Taipei\nhappy and useful. There will be many other General Assemblies in the\nyears ahead but those of us who were fortunate enough to go to Taipei will,\nI think, remember most the smiling faces of our hosts, always cheerful\neven when they must have been very tired, and the efficient organisation\nwhich lay behind their gracious hospitality.\nHIGHLIGHTS OF GENERAL ASSEMBLY\nThe Third General Assembly, which met in Taipei from 24th to 31st October,\nwas attended by 62 delegates from 24 member organisations and by five\nobservers representing the United Nations, UNESCO, ECAFE, ITU, FAO\nand COMSAT. The observers were Dr. M. S. Sarwate, Secretary-General,\nITU; Mr. S. Hase of the International Frequency Registration Board, ITU;\nMr. Bill Tanzer, Chief, UN Information Service, Bangkok, who represented\nthe UN, UNESCO and ECAFE; Mr. John Douglass, Consultant, Farm Broad¬\ncasting and TV, FAO; and Mr. Edwin Istvan, Special Assistant, COMSAT.\nThe following are some of the highlights of the General Assembly.\nOpening Ceremony\nThe Opening Ceremony, which was held at the City Hall in Taipei on the\n- 3 -"
}