{
  "id": "d207-62",
  "text": "3. Miscellaneous documents for exhibition such as folders, models,\nphotographs, etc. which could illustrate the action taken by the\norganisations in the field of education by radio and television.\nAll these documents should reach the Organising General Secretariat\nby 15th December 1966 at the latest.\nFAO FARM BROADCASTING SEMINAR TOKYO\nThe above Seminar was completed on 17th October and was described by all\nconcerned as one of the most successful and fruitful exercises ever under¬\ntaken in the field of farm broadcasting and rural television. There were\nparticipants from Afghanistan, Ceylon, Fiji, India, Japan, Korea, Laos,\nMalaysia, Pakistan, Philippines, Thailand, Tonga and Western Samoa.\nNine Japanese participants attended the Seminar full time.\nMr. Yoshinori Maeda, President of NHK and ABU, at the opening ceremony,\nstressed the importance of radio and television in increasing food production.\nHe hoped that the experienced people here assembled would produce a programme\nto help developing nations. Dr. B. R. Sen, the Director General of FAO of\nUnited Nations, in a tape recording said that the latest figures in food pro¬\nduction indicated that in the past year food supply in the world decreased 2%\nand the only region which increased agricultural product was North America.\nIn regard to South Eastern Asia, the food supply last year was only equal to\nthat produced prior to World War II. This region, the most heavily populated\npart of the world, increased its population 2.8% last year.\nMr. John Douglass, the FAO expert in farm broadcasting and rural television,\nspeaking on behalf of FAO stated that FAO has now conducted farm broad¬\ncasting training courses in all the FAO world's regions. He said that the\nmajority of the countries have very good radio facilities but only a few had\nutilised radio for agricultural purposes. He said that he hoped the experts\nat the Seminar could suggest a firm plan of action to assist developing\ncountries to utilise radio and television to alert farmers to adopt modern\nmethods of production.\nIt was hoped that the income for the subsistence farmer could be raised\nand enable them to become commercial producers. He said that it was a\ntragedy that many agriculturists in the world did not get an adequate living\nfrom the land and, in many instances, have no produce for commercial sales.\nNHK provided ideal facilities for the seminar and invited some of the experts\nto assist in TV programme and TV film production. The people attending\nthe Seminar were shown all facilities of NHK which were equal to the world's\nbest and also enjoyed an extensive country tour to examine modern methods\nof rice production, Kobe beef, fisheries, fish market, artificial pearling\nand farmers' cooperative. Mr. Douglass mentioned that the revolutionary\n- 13 -"
}