{
  "id": "d207-63",
  "text": "advances made in Japanese agriculture and fishery since the end of the\nwar was an example that may well be followed by all developing countries.\nIt was a result of the application of already known scientific information\nplus hard work.\nThe Seminar itself discussed all important aspects of farm broadcasting\nand rural television and passed eleven resolutions which would provide an\nexcellent guide line for individual countries, radio stations and international\norganisations such as the ABU and FAO to develop Farm Broadcast as the\nmost powerful tool in agricultural production.\nOne of the significant resolutions recommended was that FAO seek the co¬\noperation of radio organisations with training facilities to include in the\nregular programme of training a farm broadcasting and television training\ncourse of maximum of four weeks.\nIt was also recommended to FAO to establish a world panel of professional\nfarm broadcasters and television directors who can advise FAO and member\ncountries of United Nations in establishing or improving farm broadcasting\nand rural television.\nIt was recommended that each of radio stations in the world should provide\na minimum period of ten minutes daily to farm broadcasts in order to improve\nthe lot of subsistent farms as well as a primary producer.\nSeminar recommended that FAO encourage the establishment of a reliable\nmarket reporting service which was to be broadcast as soon as possible to\nthe target audience. Farm broadcasting should include agriculture news,\ninformation and weather market reports.\nAs the young people of the world hold the key to the future food production\nin the world, it was emphasised that all radio organisations should encourage\nthe formation of junior farm or 4H Clubs, and give their work encouragement\nby planning competitions including international competitions.\nAs a majority of the radio stations in the world are commercial, it was\nstrongly recommended that FAO seek their co-operation in providing farm\nbroadcasting space. It was also suggested that an efficient advisory com¬\nmittee in developing countries would be an aid to programme planning. It\nwas also recommended to FAO and broadcasters to assist a formation of\nfarmers' co-operative in all countries.\nThe Seminar discussed methods to be adopted to expand the activities of the\npresent Asian Farm Broadcasters Association. This Association was formed\nin India in 1964 to encourage the exchange of farm programmes and knowledge\nbetween members.\nThe Seminar concluded with the theme that farm broadcasting and rural\ntelevision should always be \"A Service to Agriculture\".\n- 14 -"
}