{
  "id": "d207-70",
  "text": "4) News and Current Events\nIn presenting the news. Television Malaysia has tried always to give good\nand comprehensive coverage of local and world news. It has tried to main¬\ntain a fair balance of national and international news, laying stress\nusually on the most important news of the day. Its news operations are\nguided by the Broadcasting Code which calls for the objective presenta¬\ntion of news, the promotion of communal harmony, religious tolerance and\ninternational understanding and goodwill and high standards of decency\nand decorum. News and news magazine occupy about l6/o of the total air¬\ntime. This high percentage of time given to news is based on the con¬\ncept that in a developing country where great strides are taking place\nit is important that the people be informed of what is going on in every\npart of the country and also of what is happening in countries around us.\nIn this manner this medium can make a very useful and important contribu¬\ntion towards national development,,\n5) Education\nPure educational television for schools is still at a pilot stage in\nTelevision Malaysia. The first experiment was carried out in June 1965\nfor a period of two weeks. The second experiment is being carried out\nthis year in September and October, providing improvements and taking\ninto account suggestions given by the various listening school audience.\nA further survey of audience reaction to the second series is being\nplanned, the result of which will be recorded for the purpose of improv¬\ning future series.\nIn addition to pure educational television series for schools, Television\nMalaysia also runs series of programmes on the teaching of the National\nLanguage (Malay) for the general public. The first series was telecast\nin 1965 for three months and the second series is being currently run for\na further duration of three months.\nIndirect teaching in the form of enrichment is carried out almost daily\nin programmes of various types, including documentaries about peoples and\nplaces which are telecast with the idea of building international\nunderstanding.\n6) Staff\nThe number of staff employed by Television Malaysia gradually increased\nfrom year to year in order to meet the increasing commitments. In 1966\nthe total number is divided as follows:-\nAdministrative\n- 30\nProgramming\n- 124\nEngineering\n- 154\nFilm Service\n- 87\nDesign and Staging\n- 59\nTotal\n= 454\nRecruitment of staff has not been very easy in view of the fact that not\nmany trained people are available to man the various skilled posts. The\n- 21 -"
}