{
  "id": "d207-71",
  "text": "major sources of supply of people are the sister organisations like Radio\nMalaysia, Information Services, including Film Negara Malaysia, and the\nlocal newspapers. In view of this difficulty of recruitment, a part of\nthe total posts mentioned above are still not filled.\n7) Finance\nTelevision Malaysia obtain its revenue from an annual appropriation given\nby the Government. In return Television Malaysia earns as revenue for\nthe Government in the form of licences paid by viewers, and commercial\nadvertising which was introduced in December 1965. The fee paid by the\naudience for a combined Radio and TV licence is M$24 per annum (M$1.00 =\nUS$0.33 at official rate). The annual revenue from the sale of licences\nis in the region of M$1.7 million. The Commercial Service has earned for\nTelevision Malaysia a monthly income of approximately M$200,000. This\ntotal of about M$4.1 million per year is still short of the amount that\nthe Government spends on running the Department, which is approximately\nM$5.1 million.\n8) Viewership\nThe total number of viewers can only be given by approximation. This\ncan be based on the total number of sets that are licensed annually. Up\nto May 1965 there were approximately 46,000 licensed sets in operation.\nIn July 1966 this number increased to approximately 70,000. It is\nbelieved that about 50,000 sets are being used without licences and steps\nare being taken to improve this situation. It is estimated that there\nare about 700,000 viewers exposed to the programmes telecast by Televi¬\nsion Malaysia. (The average size of a family is 6 persons, according to\nthe population census).\n9) Future Plans\nConsiderable progress has been achieved since television first started\nin this country.. All available facilites have been exploited to the full,\nsparing practically no reserve. Work on a modern broadcasting complex\ncosting M$34 million is now in progress. By the middle of 1967 TV Malaysia\nwill move to its new premises and it is hoped it will be possible to begin\ntransmission from there before the end of that year.\nTECHNICAL INFORMATION\nReports from BBC\n1. BBC Contribution to ABU Technical Information Library\nAs a result of the enquiries made by the ABU Secretariat, the BBC is\npresenting the following publications to the ABU Technical Library:\n1. BBC Engineering Division Monographs 1-62 inclusive\n2. BBC Television, a British Engineering Achievement\n3. BBC Sound Broadcasting, its Engineering Development\n4. The BBC Television Centre\n5. The BBC Television Centre and its Technical Facilities\n(I.E.E. Reprint)\n- 22 -"
}