{
  "id": "d207-76",
  "text": "ASIAN BROADCASTING UNION\nBOX 3636. G.P.O..\nSYDNEY.\nOFFICE OF THE SECRETARY-GENERAL\nCABLE ADDRESS: ASBUN. SYDNEY\n1st October, 1965\nDear Mr Harley,\nThank you for your letter of 23rd September from ■which I was very pleased to\nlearn th^t NAEB continues to be interested in becoming an associate member of\nthe ABU*\nI am. glad to be able to tell you that there is no difficulty about the matter\nmentioned.in the second paragraph of your letter, as the Preamble to our\nStatutes includes the following statement:\nu•** the broadcasting organisations of a national character or associations\nP-f__such organisations (hereinafter called ’’broadcasting organisations”)..*”\nIn other words, the term ’’broadcasting organisation” in Article 3 should be read\nas meaning either one organisation or an association of organisations, We already\nhave among.our associate members the Federation of Australian Commercial Broadcasters\nwhich is similar in structure to NABB although its members are commercial broadcasters.\nWith regard to the assessment of contributions, I can well understand your point,\nespecially as your members are educational organisations, but the decision is of\ncourse a matter for our full members* Our next General Assembly is to be held in\nTokyo from 21st to 29th October and this matter could be cleared up then. I would\nsuggest that if you would care to send an application, with a separate letter\nrequesting that your contribution be assessed on NAEB1s own budget, the application\ncould be held for submission to the General Assembly if it becomes clear that the\nmembers would be agreeable to your request. In this regard I should explain that\nit is the ABU*s practice for the leaders of delegations from full members to meet\ninformally on the day before the General Assembly begins: this provides a convenient\nopportunity for dealing with any problems, such as the one you have raised, which\nmay best be resolved in informal discussion.\nAlternatively, I could raise your request at the informal meeting and, if the\ndecision is acceptable to NAEB, you cou^d then make an application after the General\nAssembly which could be dealt with by postal vote. It seems to me that it would\nbe simpler for you to send an application that could be submitted or not, as\nappropriate, but this is entirely a matter for you,\nI will be going to Tokyo at the end of next week to take part in the preparations\nfor the General Assembly, so perhaps you could let me know thebe what course you\nwish to (follow. My address will be the ABU Secretariat, c/- NHK, Uchisaiwai-cho,\nChiyoda-ku, Tokyo.\nWith kind regards\nYours sincerely.\nCHARLES MOSES\nSecretary-General\nMr William G. Harley,\nPresident,\nNational Association of Educational Broadcasters,\n1346 Connecticut Avenue,\nWASHINGTON. D.C. 20036,"
}