{
  "id": "d1291-1",
  "text": "NAEB NEWS LETTER\nRage 2\n* June I, 1945\nOperation in these three alternative bands will be studied by a committee of\nENGINEERS FROM THE FCC AND FROM InOUSTRYo The RESULTS OF THEIR FINDINGS ON\nTHE PROPAGATION CHARACTERISTICS OF THESE BANOS AND ON THE PROBABLE INTER¬\nFERENCE PROBLEMS WHICH WILL ARISE AS A RESULT OF PROPAGATION PECULIARITIES\nWILL DETERMINE WHICH OF THE THREE ALTERNATIVES WILL BE SELECTED FOR THE\nFINAL ALLOCATION* INCIDENTALLY, NAEBeR, H|QGY OF WOSU IS WORKING ON THIS\n.COMMITTEE*\nFM ANO TELEVISION COOPERATE ON PftQPQSEO ALLOCATION PLAN\nFm Broadcasters, Inc., and Television Broadcasters Association announced\nRECENTLY THEY HAVE SUBMITTED TO THE FEDERAL COMMUNICATIONS CoMMISSIOM A\nSUGGESTED PLAN FOR ALLOCATING FREQUENCIES FOR 30TH SERVICES*\nThe ANNOUNCEMENT, RELEASED BY FM BROADCASTERS, INC*? SAID THE PLAN CALLS\nFOR ALLOWING FM 90 CHANNELS BETWEEN 50,000 AND 68,000 KILOCYCLES, AND\nCOMMERCIAL TELEVISION 13 CHANNELS BETWEEN 68,000 AND 216,000 KILOCYCLES*\nSince the FCC already has allocated seven channels to commercial television\nBETWEEN 174,000 AND 216,000 KILOCYCLES, THE PERTINENT FEATURE OF THE PLAN\nSO FAR AS TELEVISION IS CONCERNED IS THAT TELEVISION WOULD RECEIVE SIX\nCHANNELS BETWEEN 68,000 AND I08,000 KILOCYCLES*\nThe ANNOUNCEMENT BY FM BROADCASTERS, InC.» AND TELEVISION BROADCASTERS\nAssociation said, however, that although both will cooperate with the FCC\nIN THE TESTS NEITHER ORGANIZATION ’'BELIEVES THE ADDITIONAL INFORMATION\nTHAT MIGHT BE GATHERED WILL WARRANT THE POSSIBLE EFFECTS OF SUCH OELAY.\"\nFCC SAID IT HAD NOT YET RECEIVED THE PLAN AND THAT COMMENT WOULD NOT BE\nFORTHCOMING UNTIL THE COMMISSION HAD AN OPPORTUNITY TO STUDY IT.\nJAZZ CONCERT ON WNYC\nEddie Condon, ranking jazz authority, and thirty exponents of this type\nof popular music, participated in the first Cjty Center jazz concert, to\nbe heard on the City Station, Monday, May *4, from 9'30-9:55 P.M*\nMr * Condon, whose contention is that the jazz capital of the world has\nSHIFTED FROM New ORLEANS TO NEW YqRK, ASSEMBLED OUT STAND ING JAZ7 ARTISTS\nFROM ALL OVER THE COUNTRY TO PERFORM IN THE PROGRAM OF SOLO AND COLLECTIVE\nIMPROVISATIONS* PRIOR TO THE MONOAY BROADCAST, Mr. CoNDON WILL INTERVIEW\nSOME OF THE ARTISTS BN WNYC PREVIEWS OF THE CONCERT*\nWSUI AIRS SPEECH CONTEST\nThe Department of Speech, which sponsored the national forensic league\nREGIONAL EXTEMPORANEOUS SPEAKING CONTEST AT THE UNIVERSITY OF I 0'*‘A,\nPRESENTED TWO PROGRAMS OVER STATION 'SUI ON Friday, May 4* The CONTEST\nhao representatives^ from Minnesota, Iowa, Nebraska, Illinois, South Dakota,\nWisconsin and Missouri, each representative was a winner in his own state*\nAt four o'clock, a number of the speakers vere interviewed over Station\nKSUI by Bob Ray of the speech department. At eight o’clock, I broad¬\ncast THE FINALS OF THE REGIONAL EXTEMPORANEOUS SPEAKING CONTEST HELD IN\nthe Senate Chamber of Old Capitol. At that time the four dinners of the\nsemi-finals in the afternoon delivered their speeches*"
}