{
  "id": "d1291-4",
  "text": "NAEB NEK'S LETTER\nPage 5\nJune I, 1945\nDr, William Oxley Thompson, president of the u«m jversi ty, was the speaker.\nHe said, in part: “We are starting tonight the first of a series of programs\nof entertainment and instruction for the citizens of central Ohio...These\nPROGRAMS W| ll be of the highest type, including music, science, and other\nSUBJECTS OF POPULAR INTEREST...\n“Happily, Columbus* first radio program is being broadcast from Ohio State\nUniversity. Educational institutions always have shown a strong interest\nIN APPLIED MODERN SCIENCE...\n\"I CONGRATULATE YOU ON THE PROSPECTS BEFORE YOU AS THE RESULT OF THIS\nMARVELOUS DEVELOPMENT•“\nThe program that night also included news—RESULTS of all games PLAYED THAT\nDAY IN THE NATIONAL AND AMERICAN LEAGUES AND THE AMERICAN ASSOCIATION, AND\nTHE REPORT OF A $10,000 FIRE IN COLUMBUS,\nIn June, 1922, the station received its permanent license and the call\nLETTERS WEAO. The DESIGNATION WAS CHANGED TO WOSU IN SEPTEMBER, 1933.\nOver the years several changes sn frequency, power, ano hours occurred,\nTHE LAST BEING IN AuGUST, I 94.1 , WHEN WOSU WAS' MOVED TO 820 KILOCYCLES AND\nAUTHORIZED TO USE POWER OF 5000 WATTS.\nDuring the learlier years Professor R. Se 8rovn of the department of\nELECTRICAL ENGINEERING DIRECTED STATION ACTIVITIES, UNDER PROFESSOR FRANK\nC. Caldwell who was then head of that department. Students were employed\nparttime. In the summer of 1923 a full-time operator was employed, and\nSHORTLY THEREAFTER A PROGRAM DIRECTOR TO ARRANGE PROGRAMS AND ANNOUNCE THEM.\nThis first paid program director was Mrs. Ann Charles, who is still with\nWOSU TODAY IN THE POSITION OF MUSIC SUPERVISOR.\nIn 1925 THE station was set up as an independent department, separated\nFROM ELECTRICAL ENGINEERING, AND PROFESSOR C0 A. Wr|QHT BECAME THE DIRECTOR.\nWhen Wright left the university in 1927, ^iggy secame the director.\nOver the years, the university station has been unique in that it has never\nSOLD TIME FOR ADVERT 8S8NG PBRPOSES. The EXPENSES OF OPERATING THE STATION\ncome from University funds.\nBob Higgy, station director for the past 18 years, became interested in\nRADIO WHILE still a BOY. He obtained HIS PRIVATE operator's LICENSE IN\nI9I3 AND DURING THE WORLD War, WHILE HE WAS STILL IN HIGH SCHOOL, HE WAS\nAN INSTRUCTOR IN THE Army COMMUNICATIONS SCHOOL ON THE CAMPUS. HlGGY\nGRADUATED FROM Ch#0 STATE IN 8925 WITH A MAJOR IN COMMUNICATIONS ENGINEERING\nAND IMMEDIATELY AFTERWARD HE STARTED FULL-TIME WORK WITH THE UNIVERSITY\nST AT I ON.\nOur ING HER YEARS WITH THE CAMPUS STATION, ^RS\nTHE YOUNG PEOPLE SHE STARTED IN RADIO DEVELOP\nPROM INENCE —ONE OF THEM MARGARET SpEAKS, SpE\nEARLY YEARS OF GETTING 0H8O STATE FACULTY MEM\nMany of them thought radio only a toy.\n. Charles has seen many of\nINTO ARTISTS OF NATIONAL\nRECALLS THE DIFFICULTY IN\nBERS TO A°PE AR ON THE RADIO."
}