{
  "id": "d1097-0",
  "text": "nnnm**\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nRepresenting non-commercial, educational AM, FM, and TV broadcasting stations, workshops,\nand production centers, owned and operated by colleges, universities, school systems, and public service agencies.\nMAY 1952\nNAEB AT THE COLUMBUS INSTITUTE\nADDRESS OF FCC CHAIRMAN AT NAEB LUNCHEON KEYNOTES THE INSTITUTE\nA capacity audience attended the NAEB-sponsored luncheon held on April 18 at the\nInstitute for Education by Radio-Television in Columbus, to hear a stirring address by\nPaul A. Walker, new chairman of the Federal Communications Commission. The enthusias¬\ntic crowd gave the FCC chairman rising ovations before and after his talk, and further\napplauded the announcement that he had been made an honorary life member of NAEB.\nA \"Victory Luncheon\" Says Walker\nAfter paying tribute to the late W. W. Charters, XERT founder, Chairman Walker told\nthe group:\n\"This really should be called a victory luncheon. You educators have every cause to\ncelebrate.\n\"You educators have come into a fabulous inheritance. You are now the inheritors of a\nhighly valuable portion of that etherial public domain — the radio spectrum. It\nseems only yesterday that apportionment of the prized television channels to educa¬\ntion was only a dream. Now that dream has come true.\"\nOptimistic About UHF\nIn regard to the relative effectiveness of VHF and UHF channels. Walker had this to\nsay:\n\"It is true that there are some differences in propagation characteristics of the UHF\nand the VHF band, but these differences are not nearly as great as some have thought..\n\"In communities where VHF stations are now operating and where all the sets are de¬\nsigned to receive only VHF broadcasts, the set-owners can buy relatively inexpensive\nadapters if they wish to receive the broadcasts from new UHF stations that may be\nbuilt in their city.\n\"There has been enough experimentation in UHF television to give the Commission confi¬\ndence in its utility. I have seen UHF demonstrated. I am sold on it. UHF is going\nto grow because it has to grow. It is needed.\n\"I suggest that those of you who wish to get into television and your only chance to\ndo so is via UHF, ponder very carefully before passing up that chance.\n\"You may be gnawed by the same remorse that has gnawed at the hearts of those during\nthis long freeze who failed to file applications for the VHF at a time when they were\nbeing granted quickly.\nThe N-A-E-B NEWS-LETTER, published monthly, is distributed from\nthe national headquarters office at the University of Illinois. N-A-E-B\nmembers and associate members receive the NEWS-LETTER as part of\nmembership service. Non-members may obtain the publication at a\nsubscription rate of $5.00 per year. All inquiries regarding subscriptions\nand distribution should be addressed to: NAEB, 119 Gregory Hall,\nUniversity of Illinois, Urbana, Illinois. Editorial copy and inquiries\nconcerning editorial matters should be sent to the Editor, Burton\nPaulu, Station KUOM, University of Minnesota, Minneapolis 14,\nMinnesota."
}