{
  "id": "d1097-14",
  "text": "■15-\nTELEVISION IN GREAT BRITAIN\nBRITISH TV PROGRESS REVIEWED\nAt 3:30 p.m. on Monday, November 2, 1936, the world's first regular TV service^went\non the air. It was a lively show and included an American comedy team called ’‘Buck\n< md Bubbles. ” There were only a few thousand TV set owners in Britain then, but\nnigh definition video had arrived and the experimental state — after nearly 70\nr years of scientific endeavor — had ended.\nPrograms from Alexandra Palace, London, continued without interruption - morning,\nafternoon and evening - for almost three years. Then on September 1, 1939; a ^ev\ndays before the outbreak of World War II, the service was suddenly cut off half-way\nthrough a Disney cartoon ('Mickey's Gala Premiere'). TV screens in 23,000 homes went\nblank for the duration of the war. When the BBC re-opened its video transmissions In\nJune, 1946, the program was resumed at the point where it had been interrupted - in\nthe middle of the- Disney movie!\nToday, one and a half million Britons own TV receivers and it is estimated that on\nweek-ends, 6l per cent of the 5 l/2 million viewers watch the BBC programs (only 31\nper cent of people with radios use their receivers).\nTV in Scotland\nBy next fall some 40,000,000 people or 78.5 per cent of the entire population will be\nwithin range of the service. Already, in March of this year, the Scottish service\nwas opened when the Kirk o' Shotts station was brought into operation, enabling\n3,000,000 more potential viewers (half the population of Scotland) to receive pro¬\ngrams emanating from London, more than 400 miles away, via the longest TV relay link\nin Europe. The BBC's network at present consists of a 1-inch underground coaxial\ncable from London to Birmingham, a further coaxial cable from Birmingham to\nManchester and a 250-mile micro-wave radio relay, from Manchester to Kirk o' Shotts.\nThe latest relay link is unique in that it can transmit pictures simultaneously\neither way, thus enabling Scottish TV shows to be seen in all parts of Britain.\n- TV For In-School Use\nAn important new development launched in May of this year is the BBC's 'Educational\n* TV' program. Special telecasts for high school students will be sent over a closed\ncircuit to six schools in London. Every day, children from 11 - l6 will watch video\nshows ranging from science to history, from geography to current affairs. Techniques\nused in the presentation of the programs will include laboratory demonstrations from\nthe studios, the use of animated diagrams and micro-photography. Extensive use of\nmovies will be made and in some cases travel films will be introduced by the people\nwho made them.\nBritain A Pioneer In Television\nHistorically, Britain has long been a pioneer in TV. As early as 1926, John Logie\nBaird gave a demonstration to scientists in London, showing moving images with\ngradations of light and shade and recognizable human faces. It was Baird, too, who\nin February, 1928, first spanned the Atlantic with television."
}