{
  "id": "d1097-15",
  "text": "-16-\nClosed Circuit Television Also Developed\nIn the use of video for industrial purposes, Britain has made striking advances.\nSurgical operations in British hospitals, have for several years been telecast to\ngroups of student internes and many other ways of exploiting the medium have been\ndeveloped. Atomic scientists will observe the tests of British nuclear weapons in\nAustralia this year by remote control TV while the use of a special underwater tele¬\nvision camera to locate the sunken Royal Navy submarine Affray (at a depth of 280\nfeet) led to a completely new field for the TV camera. The technique is now being\nused to study wrecked shipping, investigate the behavior of fish in their natural\nenvironment, observe fishing trawls and nets under operational conditions, identify\noyster and scallop beds, inspect dock gates and.underwater cables, and carry out\ndeep-sea research to depths exceeding a thousand feet.\nPerhaps the most promising achievement of British TV to date was last year's first\n\"country-to-country\" telecast, a program relayed across the English Channel from\nCalais and seen by viewers in all parts of Britain. This year, the BBC hopes to take\nthe idea a stage further. On July 14, Bastille Day, they will begin a week of tele¬\ncasts from Paris.\nThe long-term possibilities of inter-continental video, in spanning frontiers and\nbringing the peoples of the world into closer contact are exciting to contemplate\nand Britain's pioneering efforts in this direction may well further the cause of\nworld peace.\nOTHER RECENT TELEVISION DEVELOPMENTS IN BRITAIN\nFollowing the recent extension of Britain's television service to the North of\nEngland, an important Radio and Television Exhibition was held at the City Hall,\nManchester, from April 23 to May 3* It included displays of equipment - both sound\nand vision- with a large range of ancillary components and accessories; exhibits\nof transmission and communication equipment; radar and the application of elec¬\ntronics to civilian, commercial and industrial uses; as well as phonographs, records,\naccessories and test gear. There was a television studio where visitors could see\nthe actual production and transmission of television programs.\nBBC Films For Television\nThe BBC Television Service started a year ago to make a series of films about famous\npeople. The first one which showed the aims and methods of the sculptor, Henry\nMoore, was awarded a first prize at the 1951 International Documentary Film Festival\nat Venice.\nThe second film, designed to present eminent British personalities, is now in active\npreparation. This film will bring to the screen the distinguished scientist Sir\nEdward Appleton, whose study of the ionosphere confirmed the existence of the\nHeaviside Layer and led to the discovery of the Appleton Layer. It was this work\nwhich made possible round-the-world broadcasting.\nThe film will deal with the nature, methods and importance of scientific research,\nparticularly in radio physics, and Sir Edward's own contribution to this subject\nwill be explained. Later developments which have evolved in the same field will\nbe shown, and it is hoped to illustrate the latest contribution of radio to astron¬\nomy, which has resulted in the discovery of invisible stars."
}