{
  "id": "d1097-2",
  "text": "-3-\nUtilization of Channels Nov the Problem\n\"The outstanding service already being performed by educators through aural radio sta¬\ntions is an indication of the value of educational broadcasting* I hope you will con¬\ntinue and expand your efforts in that field. Some of the finest broadcasting service\nin America is being rendered by educational radio stations.\n\"There is a tremendous educational job to be done if our citizens are to be fitted\nfor their responsibilities in these difficult, fast-moving times. You educators are\nprimarily responsible for that impressive task. You have assured the Commission that\ntelevision can help you. I am sure you are right. Now you have the opportunity to\ntest the full power of this magical medium.\n\"These educational stations can assure a community's democratic control over its edu¬\ncational process. A community with such a station need not depend for its educational\ntelevision material upon the desires of a commercial network, nor upon the desires of\nother independent program sources perhaps far from the scene. The community can make\nits own survey of its local educational needs and then it can serve those needs\nthrough its own television station in the manner it sees most fitting.\nReservations Certain For Only One Year\n\"The decision recognizes that ’the great mass of educational institutions must move\nmore slowly and overcome hurdles not present for commercial broadcasters....'\n\"But the decision also states that 'the setting aside of channels for non-commercial\neducational use is precisely the same type of reservation of channels as that pro¬\nvided by the assignment table for commercial stations in the various communities, and\nthe two should be governed by the same rules.’\n\"That means that just as an assignment for a commercial station may be deleted, so\nmay an educational reservation be deleted. I repeat that at the end of one year from\nthe effective date of this report, anyone may request the Commission to change an\neducational assignment to a commercial assignment. [Emphasis added.] ~\n\"In my State of Oklahoma, the Five Civilized Tribes at one time had vast holdings\nunder a treaty with the United States. They understood that they were to have these\nlands, to use their own picturesque phrase, 'as long as grass grows and water runs.'\n\"There is nothing in the Commission's Sixth Report and Order that gives you any\nassurance that your channels will be reserved 'as long as grass grows and water runs.'\nOr anything like it.\nReservations Only Round One\n^\"So you see that you have won only the first round in this fight. If you relax now,\nyou may find that you have won the battle and lost the war.\n\"Already efforts are underway to initiate an organized campaign for the commerciali¬\nzation of these non-commercial educational assignments. And if you wonder why,\nconsider these figures:\n\"Some commercial television stations these days are being priced at $6,000,000,\n$7,000,000 and up."
}