{
  "id": "d1097-20",
  "text": "■21'\nThus far, two studies have been conducted in New York, and one each in Los Angeles\nand Chicago. The first to be published in form useful to the general reader is the\nreport on Los Angeles TV, published last December and available from the NAEB Head¬\nquarters office in Urbana. The Chicago and the second New York studies are in the\nprocess of publication at this time.\nThese studies have rested basically on the timing and classification of program and\nadvertising material. Classifications developed by the industry were modified to\ndevelop a scheme of classification which would best fit the TV program structure on\n\\e working principle of putting like things together. The information about the\nprograms which was used in their classification was obtained--not from newspaper logs\nof TV guides—but from the factual reports of ^trained monitors who observed and noted\ndown data relevant to the classification problems. The purpose here was to stick\nclose to manifest content, and to minimize in. every way possible subjective percep¬\ntion by the monitors, whose judgments were not desired on the \"good\" or \"bad\" things\non the air.\nProgram Classes Described\nWe came up with 17 broad classes of programs, most of which had sub-classes. And\nwe attempted to define the broad classes of program in such a way that they in turn\nmight be combined into three groups: the classes of programs primarily devoted to\nfactual information; those most devoted to orientation; and those devoted to enter¬\ntainment. \"Information\" programs include General and Sports News, Weather, Informa¬\ntion, and Domestic programs. \"Orientation\" programs include Public Issues, Public\nEvents, Public Institutional, Personal Relations, and Religion. The \"Entertainment\"\ngroup includes Drama, Music, Variety, Quiz, Stunts and Contests, Personalities,\nSports, Fine Arts and Dance. (This summary is based on the two New York studies and\nthe Los Angeles study. The Chicago study was conducted on a different basis of\ncounting program time.)\nThe Findings: Drama Leads\nWhat can be said about the broad pattern of TV programming? To say \"it‘s all in\nfun\" would be only a slight overstatement. Entertainment programs dominate TV.\nEntertainment occupies about three-fourths of the program time in both New York and\nLos Angeles. Information-type programs amount.to 19 percent of total time in both\nNew York studies, and to'2b percent in Los Angeles. Orientation programs supplied\nonly a very minor part of total programming — from 4 percent in the case of Los\nAngeles to 7 percent in the second New York study.\nNow let's take a closer look at the entertainment. Drama programs amounted to 33\npercent of both of the 1951 studies in New York and Los Angeles. By this year, how¬\never, New York's Drama programs amounted to 4£ percent, a quite sharp increase. The\nlargest single type of Drama program in New York was Crime drama: where in 1951 it\n^mounted to 10 percent of all time on the air, in 1952 it had risen by half to 15\npercent. In Los Angeles it amounted to 9 percent of all time on the air. There (as\nmight be expected perhaps) Western Drama topped Crime drama slightly, with 11 percent\nof all time on the air.. In New York Western Drama stood second with 8 percent in\nboth years. These two types of drama are a sizable part of all TV: in Los Angeles\nthey amounted to 20 percent; in New York 18 percent in 1951 and 23 percent in 1952.\nOther classes of Drama were of minor proportions, with Comedy, Romance and Domestic\ndrama standing at about 4 percent in New York..; One might say that while the typical\ntheme of Hollywood pictures has been \"Boy Meets Girl,\" the typical theme of TV is\n\"Boy Meets Body\"--a violently dead body usually."
}