{
  "id": "d1097-22",
  "text": "-23-\nOur definition of \"secondary\" advertising runs something like this: primary ad¬\nvertisements interrupt the program material. But secondary advertisements either\naccompany the program material, or as in the case of shopping and merchandising pro¬\ngrams, they are the program material. For example, when the children in the studio\naudience all wear hats which are replicas of dog food cans — we find secondary ad¬\nvertisements which accompany program material. When the Charles Antell man goes into\nhis spiel, we find secondary advertisements which are the program material. Even so,\nin identifying a program as having secondary advertising in it, we have ignored those\ncases where the secondary advertising in it is less than 50$ of the time. Defined in\nthis way, secondary advertising amounted to 4 percent of ail air time in the first\nNew York study, and to 6 percent in the Los Angeles study. In the second New York\nstudy, I am now able to state for the first time, it rose to 10 percent.\nIf we add together the time devoted to primary and secondary advertising, we find\nthat in 1951, New York devoted 14 percent of its TV air time to advertising of both\nkinds and Los Angeles used 19 percent in this way. In 1952, New York TV advertising\namounted to 19 percent of all air time. Advertising time is going up I\nConclusions\nWhere they are not commercially valuable entertainment, information and orientation\nare ignored even though their cultural value is high. This means you will find lit¬\ntle of the Fine Arts, the Dance, Religion, and Literature developed in this and\nother countries. These deficiencies are particularly apparent in the field of\nChildren *s programs where the sponsors' interest in the fast buck results in casting\nmost programs into juvenile versions of programs designed for the general audience.\nThe children's programs even sometimes go the adult programs one better. For in¬\nstance in Howdy-Doody we find the child studio audience singing or shouting the com¬\nmercial.\nAs to crime and violence on TV, we are still doing an extensive analysis of the\namount, kind, and psychological context of violence found in the second New York TV\nstudy. Now all I can say is that there is reason to suspect that the relation of\nfictional crime to the real thing is not as simple as many of TV’s critics make it\nseem.\nBut there is another issue that has even wider implications. While there are many\nfine programs, the bulk of TV fare as far as we could tell is stereotyped. Some of\nyou may think this is important. Others may think it is not. But the existence of\nthe stereotypy can hardly be disputed. Our social scientists are telling us that\nthinking in stereotypes is associated with emotional coldness, cynicism and a gen¬\nerally destructive and manipulative attitude toward people. And they tell us that\nthese qualities are destructive of the individual's capacity to be and to know him¬\nself. We haven't demonstrated in a laboratory that the mass media \"cause\" these\npersonality traits. But it seems reasonable to assume that with children looking at\nTV for 24 hours a week or more, they will absorb the stereotyped thinking that is\nimposed on them by program after program. There are lots of angles to this matter\nof stereotypes. Let’s take just one. Interplanetary fiction for kids. I don't\nthink it makes any difference that these programs use space ships and ray guns. What\ndoes matter Is that in these programs the individual is usually a mere shadow who is\nmanipulated by technology and events, fie never has to make a human choice. His con¬\nscience never has a chance to operate. The primary force in democracy is the making\nof decisions by individuals who have to live with their consciences. The mass media\nrightly claim a profound influence on children. Can we hope to develop democratic\ncitizens when their main source of entertainment and ideas neglects to show them in\nthat entertainment how the democratic person operates?"
}