{
  "id": "d1097-8",
  "text": "-9-\nOTHER MEWS OF MAEB\nLYNN POOLE IM LONDON\nLynn Poole, producer of the \"Johns Hopkins Science Review,\" and public relations\ndirector of MAEB associate member Johns Hopkins University, has arrived in London\nwhere he is the guest of the British Broadcasting Corporation. In England he is pro-\n/'“'ducing three television programs—the first produced in Britain for showing in the\nJnited States. The general theme is \"An American Looks at Science in Britain.\"\nOn arrival Poole was taken to the Royal Institute and the Royal Society in London,\ntwo of Britain’s scientific Institutions to meet the directors and discuss material\nto be shown on the program. Next day he was taken to Huddersfield, Yorkshire, to see\nthe Holme Moss television transmitter, the top of which is 2^50 feet above sea level.\nPoole was allowed to climb the mast and his ascent was filmed by a BBC Camera Unit.\nThis sequence was to be shown on the first television program, which was to demon¬\nstrate the story of British Television before and after World War II.\nThe second program will be broadcast by remote control for the Royal Society and\nviewers will be shown treasures of science, and a demonstration by Professor Andrade,\nDirector of the Royal Institution. Viewers will be taken into the laboratories, of\nfamous British scientists, and on hand to greet them in person will be scientists\nsuch as Sir Alexander Fleming, discoverer of penicillin. This program was to be\nshown in America on May 19th.\nPoole was also scheduled to be taken on a flight of the COMET, the all-jet airplane,\na companion craft to the one which was recently flown from London to Johannesburg.\nHe will describe to viewers his reaction to this new mode of passenger flight.\nRADIO-TV DEVELOPMENTS IN KENTUCKY\nAt its last session the Kentucky State Legislature passed a law relieving radio and\ntelevision stations in that state from being compelled to reveal to any tribunal or\ngovernmental legislative committee the source of any information broadcast. This act\nmay have an effect on educational broadcasting in Kentucky since it makes possible\nthe on-the-air use of certain types of recordings made at the scenes of law viola¬\ntion. E. G. Sulzer, Director of NAEB member WBKY, was chairman of the Kentucky\nBroadcasters Association legislative committee which fathered the law.\nU.K. Students to Accept Summer TV Internships\nFour University of Kentucky Radio Arts majors will accept ten week internships at\nWHAS-TV (Louisville) this summer. The students will persue a carefully outlined\ncourse of activity including experience as floor directors, script writers, film\neditors and producers; and will receive college credit for this work.\nTV Research To Be Done At, The University of Kentucky\nA recent grant by the University's Research Fund Committee will permit the department\nof Radio Arts at the University of Kentucky to conduct an interview-type survey among\nfour hundred carefully stratified television homes in Greater Lexington during the\nearly summer. This survey, supplementing one conducted two years ago, will attempt\nto probe more deeply into the effects of television ownership upon the respondents'\ncommunication and other habits."
}