{
  "id": "d1461-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nBULLETIN\nAmes, Iowa _March 27, 1955\n(Mailed at Norman,\" 'Oklahomafrom office of Executive Secretary, T. M. BeairdJ\nProsident.* IT, I, Griffith, Iowa State College.\nVice-President: H, G, Ingham, University of Kansas,\nSecretary-Treasurer: B. B# Brackett, University of South Dakota,\nExecutive Secretary: T. M. Beaird, University of Oklahoma,\nGreetings to New Members and Prospective Members of the NAEBj-\nIt may be that this bulletin is sent to you as a new member or as one who nay be in¬\nterested in becoming a member because we want to enter into a co-operative arrangement\nin which you help us with your comment, news items and constructive suggestions#\nThe Association believes it can help you by sending its bulletin with its construc¬\ntive articles and stories of successes and accomplishments of its member stations#\nYou will understand that this applies, since the revision of the constitution at\nthe Kansas City meeting September 10-11, 1934, to the colleges and universities\nbroadcasting over commercial stations as well as to the stations owned and operated\nby colleges and universities# Then there is the associate membership designed\nespecially for friends of educational broadcasting who may or may not be connected\nwith an institution doing broadcasting at this time but who want to keep informed as\nto what is new in the art of educational broadcasting. If interested fill out the\nblank on the last page.\nRespectfully submitted,\nW# I. Griffith, President - N.A#E#B#\nATTENTION - FEDERAL COMMUNICATIONS COMMISSION CALLS CONFERENCE\nJust as we are completing this bulletin, we receive the letter of March 19 from\nSecretary Herbert L# Pettey that all of you have probably received# You will note\nthat a conference has been called in Washington, D# C#, for Wednesday, May 15th#\nThe conference will evidently be for the purpose of discussing questions at issue\nbetween commercial and educational stations# The National Committee on Education\nby Radio will be represented at this conference# Is it your wish that the National\nAssociation of Educational Broadcasters be represented directly or only through the\nNCER? Intentions to appear at the May 15 conference should be filed by April 29\nNotify executive secretary, T# M. Beaird, of your opinion on this important matter\nat once#\nLISTENING GROUPS\nAs an example of listening groups we report the Iowa Radio Child Study Club programs\nbroadcast by both WSUI, State University, Iowa City, Iowa; and Iowa State College,\nAmes, Iowa# (WOI)\nThe Iowa Radio Child Study Club was initiated at the University of Iowa by the Iowa\nChild Yfelfare Research Station in cooperation with Iowa State College., Ames, Iowa,\nand Iowa State Teachers College, Cedar Falls, in 1932-1933# Its fundamental purpose"
}