{
  "id": "d1461-0",
  "text": "N-A-E-B NEWS - LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nEdited by Richard B. Hull, President\nStation WOI, Iowa State College, Ames, Iowa\n[ JULY 31. 1948 1\nWISCONSIN S PUBLIC SERVICE RADIO INSTITUTE—REQUEST PERFORMANCE\nThe annual Public Service Radio Institute at the University of Wisconsin\n(N-A-E-B station WHA) sandwiched between the two major political conventions*\nbereft of two network news names and with small advance registration, looked\ntwice at its July 5-10 schedule, and decided to cancel.\nCancellation notice proved to be a stimulant, and Institute, rescheduled on\nrequest, chalked up a total of 90 registrants including 25 special guests\nincluding representatives from universities in Iowa, Illinois, Indiana* and\nMichigan; Chicago and Milwaukee production and television personnel and a\ncontingent from the Canadian Broadcasting Corporation.\nHighpoints of session was CBC’s dramatic supervisor, Andrew Allan’s, sketch\nof perspectives in programming and production who demonstrated skill and realism\ntoo seldom found in broadcast circles.\nChicago producer, Ben Park (nReport Uncensored”), with demonstration-lecture\non tape recorder use and opportunities left most of the group feeling this\ndevice, properly used, was as distinct and challenging a radio form as the\nvariety show or the forum—a dimension completely new.\nOther speakers included Pranklin Dunham, Radio Chief, U,S. Office of Education;\nGertrude McNance, Canadian Broadcasting Corporation; Jim Robertson, WMTJ-TV;\nMarjorie Thomas, Northwestern U. Radio Dept, and Richard Hull, N-A-E-B president.\nv\nHIGHLIGHTS\nIN\nTHIS ISSUE\nECC>S COY WARNS EDUCATORS..\n3\nNOW YOU SEE IT—N£W YOU DON’T .\nUSD A TV PROJECT APPROVED.\n4\nCOLORADO U. RADIO RECOGNITION ,\nCCT.mmTA TT. CANCELS ST ATT ON.\n6\nN-A-E-B BUSINESS PAGE\n,....10\nCERMAW VTSTTORS N-A-E-R TOUR .\n7\nSTa PRIVILEGE CANCELLED .\nNEW N-A-E-B STATION—MICHIGAN.\n► 7\nPCC NEWS & ACTIONS (EDUCATION).\n• •#•15\n■NBC’S COLLEGE BY RADIO MAY REACH 100 AREAS\nv\nThe NBC College of the Air launched at Louisville over WAVE in cooperation\nwith the University of Louisville is reported to be attracting keen interest.\nCooperators to date include University of Washington, University of Maryland,\nUniversity of Alabama, Syracuse University, Boston University and Columbia\nUniversity, Prominent in the project was Pred Hayward, Manager of N-A-E-B\nstation KWSC (Washington State College) who conferred with Sterling Tislier,\nNBC director of public service programming, on arrangements for -combined\neducational-commercial station release of air courses on the West Coast,\nVice-President Treasurer\nJohn Dunn W. I. Griffith\nWNAD, University of Oklahoma WOI\nNorman, Oklahoma Ames, Iowa\nExecutive Secretary\nM. S. Novik\n30 Rockefeller Plaza\nNew York, N. Y.\nExecutive Committee\nSeymour Siegal, WNYC, New York Graydon Ausmus, WUOA-FM, Alabama\nCarl Menzer, WSUI, Iowa Ralph Steetle, WLSO-FM. Louisiana\nFrank E. Schooley, WILL, Illinois William Sener, KUSC-FM, California"
}