{
  "id": "d1461-1",
  "text": "- 2 -\nIT HAPPENED IN JULY—TRAPS TOPICS\nJohn A, Willoughby, FCC acting chief engineer spread consternation through\nbroadcasting and television circles with his South Carolina prediction that\nthe lower end of the present TV band may be wiped out in two years.\nFCC ordered a full-dress investigation of the whole structure of station\nrepresentation in sale of national spot advertising for All. FM and TV stations*\nUnified action by record manufacturers to circumvent the American Federation\nof Musicians ban against recordings appears to be a near fact*\n****\nHouse of Representatives begins investigation of the FCC August 5 with Rep*\nForest A. Harness (Indiana Republican) in the driver:s seat*\nCivil defense Planning chief Russel Hopley is studying ways and means and\nadvisability of radio silencing system for aircraft protection in event UCS.\nis attacked*\n****\nRadio jackpot giveaways are running into six figures every week and approaching\nthe million dollar mark every six weeks* (To date only one winner has refused a,\nprize* This is reported to have alarmed the entire industry.)\n****\nZenith Radio predicts television by telephone or ’’phonevision1’ soon. Service j\nwould compare on video level to fee-paid Muzak music service.\n****\nMB offers FCC services of the NAB1s engineering executive committee with full\ncooperation in solving prob.terns concerning ^frequency spectrum requirements.,\nallocations, and ' engineering standards.11\nThe FCC*s Port Huron ruling is protested by FCC, contradicted by a Federal\nDistrict Court Ruling in Houston, Texas, and planned as the main dish in the\nforthcoming House FCC inquiry*\n****.\nU. S» State Department to record all shortwave hearings as NBC and CBS check\nout of their contract relations with Voice of America, ”l/oice*f still reported\nto be a whisper in Europe, might improve there as well as avoid more involvements,\nlike its recent difficulty, with sufficient funds and personnel.,\n****\nThe FCC postponed indefinitely a hearing on the application of Westinghouse\nRadio Stations, Inc. to use television channel #8 for stratovision broadcasting\nin the Pittsburgh area0\n****\nMartin Codecs ^Television Digest” lists 30 television stations on the air,..\nconstruction permits granted for 78 more, and 285 applications pending* This\ncompares with its April 1 survey showing 23 stations on the air, 78 construction\npermits, and 183 applications pending,\n****\nRational Association of Broadcasters lend aid to Federal Government and U.S* Army\nof Occupation in ,TSilver Shower” campaign, designed to raise money to provide\nradio receivers for schoolrooms in America1s occupied territory in Germany &Austrja*\n___**** _ —\nOCTOBER 10-11-12 ARE DATES FOR THE ANNUAL MEETING OF THE NATIONAL ASSOCIATION OF\nEDUCATIONAL BROADCASTERS. MAKE YOUR PLANS NOW FOR ATTENDANCE AT THIS 3-DAY MEET*\nING ON THE UNIVERSITY OF ILLINOIS CAMPUS. HOME OF N-A-S-B STATION WILL_"
}