{
  "id": "d1461-1",
  "text": "page 2 - Bulletin - March 27\nwas to make available to the entire state up-to-date materials direct from child\ndevelopment centers and to aid communities ih organizing study groups* Each suc¬\ncessive year has seen an expansion of the original program, which presented a course\nfor parents of elementary school children on topics of interest in the study of the\nschool age child* This year, three courses have been offered; namely, the Preschool\ncourse, the Elementary school course, and the Adolescent course* Each course con¬\nsisted of two series with ten talks in the first series and twelve in the second*\nBroadcasts were given three times a week beginning October 2, from Station WSUI\n(University of Iowa) and from WOI (Ames) on Tuesday, Wednesday, and Thursday for the\npreschool, elementary school, and adolescent courses respectively• The length of\nbroadcast was approximately thirty minutes—twenty for the talk and ten for announce¬\nments and discussion of the replies received from groups and individual members to\nthe problem sent out in time for the broadcast. Parents could enrol under the group\nplan or the individual plan*\nGroup Plan;\nTen or more parents organized as a study group chose a leader who reported the\nnames and addresses of the members and leader to the Iowa Child Welfare Research\nStation, State University of Iowa, Iowa City or to radio station WOI, Ames. At the\ntime of enrolment, each group signified in which course and in which series it was\ninterested* There was no charge for group enrolment*\nEach leader was supplied in advance with a copy of the lecture, suggested reading\nreferences and a problem to be discussed in connection with the broadcast* The\ngroup worked out a suggested solution to the problem and sent its answer to the Sta¬\ntion at Iowa City on a report form provided for this purpose. These reports were\nassembled and discussed over the radio two weeks later* Libraries cooperated to\nmake available the references used in the assignments*\nP. T. A. study groups enroled in the Radio Child Study Club received credit toward\nstandard or superior rating*\nIndividual Plan;\nTo meet the needs of parents who find it difficult to join a group, the individual\nplan was developed. A person may enrol as an.individual member by paying a regis¬\ntration fee of fifty cents for each series in which he or she wishes to enrol* Each\nindividual member received a copy of the lecture and the assignwrafc for each lesson\nand reported solution to the problem*\nAt the close of the enrolment on February 7, for the year 1934-1935 there were\n2,305 members in the Radio Child Study Club. One hundred and fifty groups took ad¬\nvantage of membership and forty-one individuals enroled*\nThe growth of the Club from its inception may be compared with the report of 1932-\n1933 which shows thirty-one groups representing 425 members*\nCopies of the addresses may be secured with the privilege of broadcasting over your\nstation by addressing Dr* R* H* Ojemann, Iowa City, Iowa*\nTHE FEDERAL COMMUNICATIONS COMMISSION\nMr. Aiming S. Prall, who was appointed to fill the vacancy on the Federal Communica¬\ntions Commission, received senate confirmation shortly after his appointment* Mr*\nPrall was appointed to fill the vacancy caused by the resignation of Commissioner\nHampson Gary* The following commissioners were confirmed by the United States\nSenate February 7, 1935; Chairman, Aiming S* Prall; Judge Eugene 0. Sykes, Jackson,\nMississippi; Col. Thad* H. Brown, Columbus, Ohio; Dr. Irvin Stewart, Fort Worth,"
}