{
  "id": "d1461-10",
  "text": "11 -\nN-A-E-B\nBUSINESS PAGE j\n' _j\nANNUAL MEETING AT UNIVERSITY OF ILLINOIS (OCTOBER 10,' 11, 12)\nThe University of Illinois operates stations WILL and WIUC-FM, maintains an out¬\nstanding department of radio education under the School of Journalism and is the\nhome of the newly formed Communications Institute, headed by Wilber Schramm.\n1 Joe Wright, WILL director and Frank Sohooley, WILL assistant director, are in\nI charge of hotel reservations and other arrangements. Next issue of the News Letter\nI will carry complete detail with respect to hotel accommodations and train connec- j\ntions between the Illinois campus (Urbana-Champaigne, Illinois) and Chicago.\n■ — -i\nj t\nA tentative agenda of the meeting will be furnished all members in the near future\nwith the request for suggestions for additional topios of business.\nIt is hoped final details for N-A-E-B district operation can be completed, a thor- j\nough system of aid be planned for member and prospective member stations, pressing j\nlegal questions affecting all stations be adequately discussed, and the organiza- j\ntion of N-A-E-B sub-sections such as radio teaching group's, women’s colleges, en- j\ngineering, legal, and program committees can be completed.\nASSOCIATED SCHOOL PROGRAM SERVICE\nAssociated Transcriptions (151 West 46th Street, New York 19, N. Y.) now distri¬\nbutes a special '’Radio School Library\", now used by several N-A-E-B stations,\nnQtably 1/fflYC (New York), WLSU (Baton Rouge, La.), IfBAA (Xa.fayette, Ind). A ver¬\ntical transcription service, the \"school library\" useful for either radio course\ninstruction or station use, contains 1800 selections on 225 vinylite discs. Con¬\ntract provides two additional platters per month. Library provides dual indexing\nsystem--by artist and by title. Full details and prices can be obtained from\nAssociated Headquarters. Rates are good.\nOFFICE OF EDUCATION DIRECTORY\n! Dr. Franklin Dunham and Gertrude Broderick have prepared a list of all stations\nj owned and operated by educational institutions in this oountry. It comprises both\noommeroial and non-commercial operations. Copies may be obtained from the Office\nof Education in Washington. This list requires ohecking in your individual areas\nto determine commercial end non-commercial operations.\nN-A-E-B REGIONAL RESEARCH PROJECT\n\"^The joint study, initiated by W'KAR and Michigan State College, approved by NAEB a\nyear ego in Columbus, has run the gamut of federal and state agricultural agencies\nand at present no final report is forthcoming. Survey was to be financed by Title\nII funds of the Hope-Flannagan bill and to cover areas served by NAEB Land Grant\nCollege stations in Regions III and IV. Robert Coleman, chairman of the committee\nindicates a final report will be forthcoming later.\n} ASSISTANCE*~Tb N-A-E-B MEMBERS~IF~GERk,N RADIO POSITIONS\nDr. Harry Skornia (on leave from Indiana U. radio department) and Friel Heimlich\n(former program director W'OSU, Ohio State U.), along with several other representa¬\ntives, still have need of script materials, transcriptions, and other supplies for\ntheir liaison work in German radio. If you can assist, contact M. S* Novik, NAEB\n|j secretary, at 30 Rockefeller Plaza, New York City."
}