{
  "id": "d1461-13",
  "text": "14\nFCC ACTIGKS (AMPLITUDE MCDUIAraf)~CO^ INSTITUTIONAL\n1030 KG - Extension of SSA\nK8TBU--‘Baylor University, Corpus Christi, Tex,— Granted extension\nof SSA for operation of KWBU on 1030 KC, 50 KS7 power, from local\nsunrise at Boston to local sunset at Corpus Christi, for a further\nperiod of one year from June 15, 194&. (BSSA-1S6)\n1920 KC - Granted CP Change\nKTW--The First Presbyterian Church of Seattle, Washington, Seattle,\nWash,—Granted CP to make changes in transmitting equipment.\n(BOP-3993)\nFCC AHPLICATIONS (FREQUENCY MCDUIATION) COLLEGE. UNIVERSITY. INSTITUTIONAL\nFor Final License\nWUOM—The Regents of the University of Michigan. Ann Arbor, Mich.—\nLicense to cover construction permit (BPED-26, as modified)which\nauthorized a new noncommercial educational broadcast station.\nFor CP Modification\nKOKH—-The Board of Education of the City of Oklahoma City. State\nof Oklahoma. Oklahoma City. Okla«—Modification of construction\npermit (B3-PED-76, as modified) which authorized a new noncommercial\neducational broadcast station, for extension of completion date*\nFor CP Modification\nWSOU—Seton Hall College. South Orange. N. J_.—Modification of\nconstruction permit (BI~PED-78, as modified)\" which authorized\na new noncommercial educational broadcast station, for extension\nof completion date.\nFor Final License\nWHAD—State of Wisconsin--State Radio Council. Madison. Wise.—\nLicense to cover construction permit (BPED-94) which authorized a\nnew noncommercial educational FM broadcast station.\nFor CP Modification\nlNYE-»Board of Education. City of New York. Brooklyn, N* Y.—\nModification of construction permit (BI-PED-72, as modified)\nwhich authorized a new noncommercial educational FM broadcast\nstation, for extension of completion date.\nFor CP Modification\nWBEZ--Boarft of Education. City of Chicago* Chicago. Ill.—Modification\nof construction permiFTBPEb-Bd, as modified) which authorized changes\nin noncommercial educational broadcast station, for extension of\ncompletion date."
}