{
  "id": "d1461-15",
  "text": "-l6-\nAPPLICATIONS (FREQUENCY MODULATION) COLLEGE, UNIVERSITY, INSTITUTIONAL (cont.)\nFor Construction pera.it\nMinnesota—St. Olaf College, Northfield—Construction permit for a new PM\nbroadcast station to be operated on channel 251. me. with power of 60 KW.\nISt. Olaf College plans to operate this station on a semi-commercial but non-profit!\n(basis. Thus a rigid policy of commercial acceptance will be enforced, time sales j\n[will be limited and governed by station policy, and monies accuring from any time j\njsales will be plowed back into operation., _ 1\nPor Construction Permit\nNew York—Radio Corporation of the Board of Missions and Church Extension of the\nMethodist Church, Inc., New York—Construction permit for a new PM broadcast\nstation (Metropolitan) to be operated on frequency to be determined by Chief\nEngineer of FCC. AMENDED to specify frequency as Channel #298, 107*5 me,\n(Resubmitted)\nFor Construction permit\nPennsylvania—Haverford Township Senior High bchool applied for a new non-commercial\nbroadcast station at Havertown, Pa., to operate on 2-| watts.\n*****\n' LOW^POu'ER PM BROADCASTING—A STATION POP, $3500\n' The Haverford Township Application noted above is the first in what may be an\njj extremely^large number of PM applications on the educational band under provision\n| of the new POO proposal for low-powered PM broadcastings\nIn June of this year, the FCC proposed to amend its rules to permit FM broadcasting/\n| non-commercial educational stations with 10 watts or less of power, and to waive\ncertain requirements to promote this type of service.\n.Favored by the UP S« Office of Education, low-power transmitters are already in\nI&PPlication stages at several universities, including Syracuse and De Pauw.\niSyracuse has successfully broadcast on an experimental license for over a year\n|using a 2jr watt transmitter and covering an area 3 to b miles in radius.\niLow-power FM broadcast would be authorized in the 88-92 Land, now allotted\n'to the non-commercial educational service. The FCC said ‘'such a station could\nget on the air for the expenditure of a few thousand dollars, covering an area\n;2 to 5 miles in radius. \" G-eneral Electric can make transmitter deliveries for\nthis new plan within 30 to60 days.\nThe way it now open to literally hundreds of school systems, colleges, and\nuniversities to serve student and adult populations at low cost—and to make their\ninitial entrance into PM broadcasting through low-power FM.\nN-A-E-B Headquarters—Iowa State College, Ames, Iowa—is prepared to furnish\ninformation to member stations and others interested in FM and AM educational\nbroadcasting. With over 90 member institutions in 30 states, N-A-E-B is singularly\nwell-equipped through experience and philosophy to offer aid, comfort, and advice\nto prospective educational broadcasters."
}