{
  "id": "d1461-4",
  "text": "page 5 - Bulletin - March 2Y\nonEdubation by Radio. One very valuable part of its work is conducted by Director\nof its Service Bureau, Mri Armstrong ’Perry. Mr. Perry kindly submitted the following\nstatement with reference to the Service Bureau*\n\"The National Committee on Education by Radio maintains a Service Bureau in the Na¬\ntional Press Building, Washington, D« C., for service to educational stations. It\nis a clearinghouse for information on education by radio. One of the most success¬\nful radio attorneys in the country is made available, free of charge, for advice on\nlegal matters.\n\"In the past four years the Federal Ettdio Commission and its successor, the Federal.\nCommunications Commission, have reported over 1500 applications affecting the facili¬\nties of educational stations. The Service Bureau has been able to save considerable\namounts of money for the educational stations.\n\"Cooperation among the educational stations is necessary if their rights are to bo\nadequately protected and their service fully developed. The National Association\nof Educational Broadcasters is represented on the National Committee on Education by\nRadio and in the opinion of the Service Bureau every educational broadcasting station\nshould be a member of the Association.\nBROADCAST OF ELEMENTARY GERMAN BY KFKU\nWe acknowledge receipt of a copy of a very fine radio address on the subject, \"Radio\nas a medium for foreign language instruction,\" presented over KFKU by Professor E. F.\nEngel, professor of German at Kansas University, Lawrence, Kansas. Professor Harold\nG. Ingham says that this is the third year that this radio course in elementary Ger¬\nman has been presented. It consists of 50 fiftecn-aaohte periods each. Professor\nEngel has been identified with higher education for forty years. He is a radio en¬\nthusiast with a vision of the expanding possibilities of radio for human progress and\nculture. Professor Engel has agreed to make this course available to other stations\nfor the cost of the mimeograph material. There is absolutely no financial return to\nhim except the possibility of a very small royalty on the sale of a text that he has\ndeveloped as a result of thirty years of teaching. If you are interested we suggest\nyou write to him c/o KFKU, Lawrence, Kansas, at once.\nCOLUMBUS RADIO MEETING\nAre you so adjusting your time and program that it will be possible for you to attend\nthe radio meeting in Columbus, Ohio, May 6, 7 and 8? This is an unusual meeting.\nThe Sixth Annual Institute for Education by Radio combines with the Fifth Annual\nAssembly of the National Advisory Council on Radio in Education. Dean Yf* YT. Charters\nDr. Levering Tyson and Dr. George Zook, Director of American Council on Education,\nform the program committee and judging from the tentative program it will be well\nworth your attention.\nThe writer of this bulletin has been asked to provide the program for Monday after¬\nnoon, May 6th, and has been fortunate in securing the acceptance of Miss Judith Trai¬\nler, Educational Director Central Division NBC, who will address us on the subject,\n\"What'I would do if I were running an educational broadcasting station;\" Pres. Herman\nJames, University of South Dakota, Vermillion, S. Dakota, \"Democracy and Radio;\"\nState Superintendent of Public Instruction, Agnes Samuelson, Des Moines, Iowa, \"The\nRadio as an agency in interpreting education.\" Tib know you will enjoy the addresses\nand the discussions that will follow*\nBy the way, do you recall that Dean Charters asked you to send or bring any samples\nof recordings that you have made of any typical programs that you have broadcast."
}