{
  "id": "d1461-5",
  "text": "-6-\nCOLUMBIA UNIVERSITY WITHDRAWS WOUY APPLICATION\nThe Federal Communications Commission, at the request of Columbia University*s\npresident, Dwight Eisenhower, vacated the University1s construction permit for\nWCUV-EH early in July, The action, taken \"without predjudice\" hy the ECO\ntemporarily closed the file on Columbians construction permit for W3UV-EH on\nchannel 210, held hy the school since 1946, ~~\nEisenhower, in requesting the withdrawal, thanked the ECO for having held the\nmatter in abeyance and expressed the hope the University would be able to proceed\nwith the matter in the future. He explained that \"owing to internal difficulties,\"\nthe University had not been able to proceed with the contemplated development\" and\nthat he could not forsee \"any immediate possibility” of proceeding with WCUV-EM.\nMeanwhile the University has established a radio bureau with Erik Barnouw, formerly\nassistant manager of NB0*s script division, and presently in charge of Columbia\nU,1s radio courses, which are offered in conjunction with NBC studio facilities.\nThe University operates under a Badio Committee of which Ur, Hassell Potter\n(formerly N-A-B-B Hegion I director) is chairman, from the Institute of Arts and\nSciences.\nColumbia*s new radio bureau has just completed a platter series with the U»S.\nOffice of Public Health which will be used, beginning in September, in a\nnationwide anti-V.J). campaign.\nKALTEKBOHN SCHOLARSHIP AT UNIVERSITY Of WlSOOflsIl. .\nAnnouncement of the H.V, Kaltenborn radio scholarship for the school year (19^8-49)\nat the University of Wisconsin was made this month by Professor H. L. Ewbank,\ndepartment of speech.\non an income from a $15,000 trust fund set up by HBC^s leading news\ncommentator, the fund was established to assist deserving students in the pursuit\nand training of some phase of radio broadcasting with particular emphasis on news\npresentation and news analysis'll\nAny student or entering student of junior standing or above at the University of\nWisconsin is eligible for the scholarship. Selection is made by university\nregents on recommendation of the school*s president after conaitation with~the\nUniversity radio committee.\nTraining facilities are furnished by H-A-E-B stations WHA and WHA-EM. Pinal date\nfor filing applications is August 20.\nMIDWEST EDUCATOR SAY SCHQ0L300M TV IN DISTANT FUTURE\nExperts attending a five-day audio-visual aids workshop at the University of Iowa\nfeel it will be many years before television plays an important teaching role in\nthe nation*s schoolrooms. The 35 staff and guest lecturers at the July 26-30 event\nagreed that television may replace radio but it won*t be an overnight process.\nDr. E. L. Whan, commercial radio survey expert from Kansas reported his figures\nindicate y/o of U.S, children listen to radio in the public schools. Other speakers\npointed up use of school transcription libraries as fulfilling many aspects of\nschool broadcasting with exception of element of immediacy.\nConference was joint presentation of College of Education and Extension Division\nat the State University of Iowa,_j"
}