{
  "id": "d1461-6",
  "text": "7 -\nGERMAN RADIO VISITORS COMPLETS TOUR OF N-A-E-B STATIONS\nSix German broadcasters from the Frenoh, American, and British zones completed\nthe first stages of a 6-months-long tour under the auspioes of the Rockefeller\nFoundation, the Bureau of Applied Social Research at Columbia University and\nthe National Association of Educational Broadcasters.\nConceived more than a year ago at the Wisconsin Radio Institute by past president,\nHarold Engel and secretary, Morris Novik, the project finally materialized after\nofficial sanction of the State Department and the War Department.\nThe six men, after an orientation period in New York, left Columbia University to\ntour the country, and in teams of two, visited the following N-A-E-B stations for\nperiods of study and observation; WBKY(University of Kentucky], WILL(University\nof Illinois-!, W0I(Iowa State College), WCALpSt. Olaf College), WSUI(University of\nIowa, YfKAR(Michigan State College;, and WHM(University of Wisconsin).\nTheir tour also included a survey of commercial stations, WSM(Nashville) and the\nTennessee Valley Authority, WHO (Des Moines), WCCO(Minneapolis), the Wisconsin\nRadio Institute, the NBC Northwestern University Radio Institute, and the Rooky\nMountain Radio Council operation.\nThe German representatives were Rudolf Didczuhn, Literary Editor, Radio Munich;\nOtto Herr, Chief Political Department and Commentator, Radio Frankfurt; Peter\nKehm, Program Director, Radio Stuttgart; and Hans Westermann, Youth Department\nChief, Radio Bremen; al1 from the American zone. The British zone was represented\nby Franz Reinnolz, Head of the School Broadcast Department at Radio Hamburg; and\nthe French zone by Horst Scharfenberg, Deputy Program Director at Radio Baden-Baden•\n!K\\\nw\nv\n0\nn\nN-A-E-B SALUTES UNIVERSITY OF MICHIGAN'S NEW FM STATION\nCulminating a long period of planning and development, headed by one of America’s\nbest known radio educators and writers, Waldo Abbot, the University of Michigan\nbegan regular operation of its new FM station, WUOM, this summer, from studios /\nin Ann Arbor, home of the University.\nWUOM, as a full-fledged member of the National Association of Educational Broad¬\ncasters, brings to still another area of the country, a new array of publio ser¬\nvice and educational programs, not otherwise available, helping to further serve\nthe one-third of the U. S. radio audience neglected by commercial broadcasters*\nWUOM, labelled as the major outlet of the University of Michigan broadcasting ser¬\nvice, began operation from an 8-element radiator, located on the top of Peach Moun¬\ntain, providing height above average terrain of nearly 600 feet. This elevation,\ntogether with 3000 watts transmitter power and 13,500 watts radiated power, pro¬\nvides clear, static free FM service to an area ranging from 60 to 100 miles from\nAnn Arbor. WUOM operates on 91.7 mg or channel 219.\nMichigan's new NAEB station operates Monday through Friday 3*00 to 9j00 PM, on\nSunday mornings from 9;15 to lljOO AM, and on Mondays and Tuesdays presents a\nspecial university music program until 9*00 pMe\nDirector Waldo Abbot’s skill as a program producer has long been reoognized. For*\nmany years University of Michigan radio productions have been aired over commercial\nstations in Detroit and throughout Miohigan. With the advent of WUOM, these came\nproductions originating now in WUOM studios will be heard over such stations as\nWJR, WHRV, WPAG, WEAR, and the Michigan FM Network."
}