{
  "id": "d1461-9",
  "text": "- page 10 - Buxxetiii - , urc^\nIT, E. STEWART, WCI ENGINEER GRINDS HIS OTJN CRYSTALS\nA gfeat step forward was nade in the frequency control of broadcasting stations with\nthe advent of the crystal-controlled transmitter. '701, I believe, claims to have\nbeen one of the first transmitters in the middle west to take advantage of this ad¬\nvance in the Radio arts. Crystal control brings problems of its own, however. One\ndisadvantage has been the effect of tenperature on the crystal. A degree of change\nin the tenperature of the crystal is often enough'to throw the transmitter outside\nits allowed frequency deviation. To prevent this, the crystal is kept in an oven at\nconstant temperature. In case of power failure, the oven may cool off and the trans¬\nmitter must stay off, even after the power is back on, until the oven is warm again.\nThe Bell system Technical Journal, July 1934, page 453, carried an article describ¬\ning a new way to cut the quartz plate so that no change in frequency results from\na change in temperature. This cut has been named the \"A-cut” crystal. This crystal\nis now on the market at a moderate price. However, rather than buy an ”A-cut” crys¬\ntal, TfCI is giving its operators, who are students at Iowa State College, seme\nvaluable experience and training by cutting and grinding an ”A-cut” crystal from the\nraw quartz. Incidentally, it gives the engineer an opportunity for some research\nalong this line in which he is especially interested.\nClarence E. Damon, 203 Administration Building, Purdue University, Lafayette, Ind.;\nis responsible for the operation of station WBAA* According to the outline sub¬\nmitted, they are making very effective use of the time at their disposal. Personally\nI am more interested in what they \"are doing on their Children’s Hour, for the reason\nthat at T70I we are now giving attention to this matter, I suspect that others will\nfind other features that will appeal to them. I suggest that you write to 1 r* Damon\nfor his program, if you do not now have it.\nRadio station WKAR of East Lansing, T ichigan, are broadcasting a series of lectures\nthat are somewhat of an innovation. The series is called the Economics of the New\nDeal. If you are interested in this topic or other items on this program, I suggest\nthat you write to Robert J. Coleman, director of TJKAR.\nWilliam AcKinley Robinson is broadcasting programs representing Western State Teach¬\ners College at Kalamazoo, \".ichigan, over station WKZO. I am sure from the list of\ntopics discussed that the time is being used to good advantage.\nElmer G. Sulzer is responsible for the radio programs broadcast by the University\nof Kentucky over WHAS. ”In order to make available to the people of the mountains\nof Kentucky, University and other valuable radio features, a plan was inaugurated\nduring the sprinc of 1933 whereby a system of Radio Listening Centers was to be es¬\ntablished in this territory. In the carrying out of this system, the University of\nKentucky equips such centers with radio sets, and the operators of the centers see\nthat they are tuned daily to educational programs of worth. They encourage people\nof their communities to daily come in to the centers and listen.” Funds for the\npurchase of receiving sets in the listening centers were secured by donations.\nA fine series of children’s programs are being broadcast by station KOAC at Corvallis\nand by station KBPS, the station owned by the Benson Polytechnic School at Portland*\nIf you are interested in the content of this program for the past three months,\nwrite to either one of the above mentioned stations.\nStation KFDY of Brookings, South Dakota, have a very effective way of releasing\npublicity. This is sent as page 4 of the literature known as 4-Ii Club Doings."
}