{
  "id": "d1393-0",
  "text": "Washington Report\nIhe National Association of Educational Broadcasters\nVoi'« 11 No> 1 Dupont Circle Bld^.j Washington 6, D. C. January, I961\nFISCAL FUSS\nNAEB, through its general counsel^ Cohn and mrks, is preparing comments\nrequesting that educational stations he exempted from preparation of the financial\ninformation required in the expanded Form 324.\nBroadcasters in general are irked at the proposal to require a greatly misused\namount of financial data. To smaller stations, especially, it’s a hig headache.\nNAEB’s position is that for noncommercial stations the questions do not apply.\nWALTER REED CUTBACK\nPossihility looms that TV operation at Walter Reed Hospital, one of the most\nelaborate TV medical installations in the world, faces virtual liquidation under a\nbudgetary cut calling for reduction of the staff of 57 employees to 19 employees.\nThe reduction will mean practical immobilization of the $1,000,000 TV production\ncenter that has done medical information and scientific programing for military,\ngovernmental, and national professional groups. Individuals and groups prominent in\nmedicine, science, arts, and educational TV are hopeful of salvaging project until\nits potential usefulness can be more fully appraised.\nALL-CHANNEL RECEIVERS\nFCC Commissioner Robert E. Lee believes there’s a good chance that the new\nCongress will pass legislation requiring manufacture of all-channel TV sets.\nRepeating his stand for all UHF-TV made in his speech at WAEB convention, Lee told\nElectronic Industries Assoc, that the mandatory provision, though admittedly a form\nof government interference with private industry, is justified by the critical\nnat\\ire of the present situation. EIA promptly, for the thii^i time, rejected any\nand all proposals that in any way impose government control over TV set specifica¬\ntions .\nA strong faction in the Commission feels that all-channel sets are basic to any\nsolution of the allocations problem; good chance FCC will recommend all-channel set\nlegislation to Congress.\nEDUCATIONAL FM FILINGS “ _ - .\nTwo FM applications have been accepted for filing as follows: Modification of\nconstruction permit to the University of Chicago for station WUCB-FM for extension\nof completion date; construction permit to Northwestern University to install new\ntransmitter and antenna for station WNUR.\nWesleyan University, Middletown, Connecticut, has tendered for filiiig an\napplication for a construction peimit for a new station to be operated on 88.1\nmegacycles with 10-watt power.\nFCC-UHF EXPERIMENT\nActivation has begun of $2 million experiment with UHF in New York. FCC, which\nwas given money by Congress to conduct a full-scale test of UHF potential for\nserving a metropolitan area, is acquiring tower-mounting rights on Empire State\nBuilding.\nCommissioner Lee, protagonist for project, says the station will use UHF Ch.\n31, ETV reservation in New York, and he will recommend that after the two-year\nexperiment is over, the facilities be given to New York City as an educational\nbroadcasting facility."
}