{
  "id": "d1393-0",
  "text": "THE PRESIDENT'S PAGE\nNovember, 1955\nDear NAEBer:\nThe odds turned against me. 1 thought you’d be relieved of getting a\nMESSAGE FROM THE OL* PRESIDENT THIS MONTH. NOT SO. $0, HERE GOES.\nFirst, let me thank all of you for your help and support during the\nPAST YEAR, |T1S 8EEN ,GRANO BEING YOUR PRESIDENT. YOUR PRESIDENT CAN\nBE NO BETTER THAN THE SUPPORT HE GETS FROM HIS MEMBERS, AND I GOT\nPLENTY,*\nTOO, | WANT TO THANK ONE AND ALL OF THOSE WHO HELPED WITH THE CONVEN¬\nTION. It WAS A LOT OF WORK, AND NO ONE APPRECIATES MORE THAN I THE\nHELP GIVEN IN MAKING THE CONVENTION A SUCCESS, WHICH ALL WHO ATTENDED\nHAVE TOLD ME IT WAS.\n|F 1 HAVE ANY REGRETS AFTER THE CONVENTION, IT IS THAT MORE OF YOU\ndidn’t GET TO ATTEND. You NOT ONLY WOULD HAVE PROFITED BY ATTENDING,\nYOU’D HAVE ENJOYED IT, TOO. THAT*S. NOT UUST MY OBSERVATION. It IS\nTHE EXPRESSION OF DOZENS OF NAEB MEMBERS, AND SOME WHO WERE NOT NAEBERS\nWHO WERE WITH US.\nNAEB HAS HAD A NUMBER OF NOTES FROM PERSONS WHO ATTENDED, OR WHO HELPED\nUS WITH THE PROGRAM, SUCH AS' Dr, McFARLAND, EDUCATIONAL CONSULTANT TO\nGeneral Motors, from1 Mayor Richard Daley of Chicago, from Fred GarrIgus\nof NARTB, from Ann Spinney of the Fund for Adult EducatiOn,* and from\nOTHERS TOO.\nOne more note of thanks. Thanks to NAEB for the citation. It was\nREALLY EMBARRASSING TO RECEIVE IT. MANY HAVE DONE AS MUCH OR MORE* I\nONLY TRY TO DO MY BEST FOR NAEB AND EDUCATIONAL:BROADCASTING, AND YOUR\nSUPPORT WOULD HAVE BEEN. SUFFICIENT THANKS FOR ME. 1 DO APPREC I ATE THE\nHONOR DEEPLY’.\nNOW THAT THE CONVENTION IS OVER, I’M TRYING TO CATCH UP WITH MY WORK.\nMeanwhile, I’m asking all committees to continue functioning until new\nCOMMITTEE APPOINTMENTS ARE ANNOUNCED* SOME FEW CHANGES WILL BE MADE,\nBUT IN GENERAL I HOPE ALL YOU WORKERS WILL BE WILLING TO CONTINUE IN\nYOUR ROLES.\nLife seems to be one thing after another. After the convention, it\nwas to Washington to attend a meeting of JCET.\nWhile the 1955 convention is over, we’ll be starting plans for the 1 95&\nAND 1957 CONVENTIONS, It’LL BE ATLANTA IN *56, ST. LOUIS IN *57, AND\nALREADY WE HAVE AN INVITATION FROM PITTSBURGH FOR THE 195° CONVENTION.\nIf others wish to invite NAEB for 1958, you may send your invitations\nTO HEADQUARTERS PENDING APPOINTMENT OF ANOTHER COMMITTEE.\nHaskell Boyter in Atlanta And MarguerIte Fleming in St. Louis have al¬\nready BEEN COMMUNICATING WITH US ABOUT DATES AND PLANS FOR THE NEXT\nTWO CONVENTIONS. WHEN WE GET DATES WORKED OUT, WE*LL LET YOU KNOW."
}