{
  "id": "d1393-1",
  "text": "Engineers Cy Braijm (JCET) and Stewart Bailey (Jansky & Bailey, Inc., HAEB*s\nengineering consultant firm) are advisors on the project.\nWGBH-TV STILL PURSUED\nDavid Franklin, -v/rite-in congressional candidate whose attempt to have the\ncourt intervene in his effort to get equal time on the V/GBH-TV series \"Ask the\nCandidate\" was thwairted when his request for an injimction was denied on the grounds\nthat FCC has primary jurisdiction, has not given up; he has now petitioned the FCC.\nWGBH-TV’s position is that the series was a bona fide news series and therefore\nexempt from equal-time requirement. Counsel for VJGBH-TV is collecting affidavits\nfrom authorities testifying to this effect.\nFCC DELETES 26 UHF CP’s\nFollowing its \"get tough\" policy begun last February, the Commission at the end\nof November denied extension of construction permits for UHF stations to 26 pexmit-\ntees. No reserved channels were involved. Commissioners Hyde and Lee dissented on\ngrounds that deletions should wait until the Commission has devised an over-all\nallocations policy.\nThis action mal<:es a total of 234 UHF peiroits that have been deleted since 1952.\nFCC PROPOSED RULE MAJONGS\nReserving Ch. l8 (commercial) for ETV and deleting Ch. 70 (noncommercial) in\nAustin, Texas, and adding Ch. 67 to Austin, Texas, and substituting Ch. 75 for Ch.\n53 in San l^rcos, Texas.\nNewark Public Schools, Ohio, request adding ETV Ch. 28 to Newark, and substi¬\ntuting Ch. 68 for Ch. 28 in Lancaster, Ohio.\nAdding Ch. l4 & ETV Ch. 31 to Columbia, South Carolina, deleting ETV Ch. 19 and\nCh. 67, substituting Ch. 19 for Ch. l4 in Camden, Ch. 67 for Ch. 31 in lancaster.\nBoard of Regents, University of State of New York requested that Ch. 23 (now\ncommercial) Albany, be reserved for ETV. Ch. I7 has already been reserved for ETV.\nOgden City Board of Education requested that Ch. 24 (novr commercial) be\nreserved for ETV. Ch. 18 IG'fCS-TV has been operating since October by the Weber\nCounty School District.\nWTFIS-TV, Ch. 2, lilami, Florida, filed application for Ch. I7. This was neces¬\nsary because of such a demand for in-school use.\nFCC CHAIRI4AN\nIt appears that the Kennedy administration is not going to appoint a new\ncommissioner for some months. Chairman Ford will continue as head with his legis¬\nlative and regulatory revitalization program.\n\"MEET THE PROFESSOR\"\nThe Association for Higher Education’s TV series scheduled to start on January\n29 on ABC has selected Harold Taylor, former president of Sarah lawrence College, as\nits host-moderator. The writers for the series include: Elliott Baker, Alvin\nBoretz and Robert Lewis Shayon. Dr. G. Kerry Smith, executive secretaiy of the\nassociation remarked that the station managers have been very helpful with their\nsuggestions and that more than 70 of the nominees for top college teachers have been\nscreened.\nOFFICE OF EDUCATION\nPlans are imder way for the Educational lyfedia Council to meet during Januaiy —\ntentatively the 13th and l4th."
}