{
  "id": "d1393-1",
  "text": "Presi oent* s Page--!I\nMeanwhile, ir you have any suggestions for. the: 195& convention, please\nSEND THEM ALONG. THE 1955 COMMITTEE IS GOING TO GET TOGETHER TO RE¬\nVIEW THE SITUATION AND MAKE SUGGESTIONS FOR THE NEXT YEAR, TOO. WeVvE\nALREADY PICKED UP ONE OR TWO GOOD IDEAS FROM PEOPLE WHO ATTENDED.\nYou know, I’ve already mentioned letters from Boyter and- Fleming. Well\nLOOKS LIKE THE COMMITTEES ARE REALLY MOVING AHEAD FULL STEAM. WITHIN\nLAST DAY OR TWO, HAVE HAD LETTERS FROM DICK VoGl’s GrANTS-IN-AI 0 COM¬\nMITTEE, from Carl Menzer’s engineering committee, from Bob Sqhenkkan’s\nTV DEVELOPMENT COMMITTEE, FROM JlM MlLES* PUBLIC RELATIONS ADVISORY\nCommittee, from Mac McCarty’s Awards and Citations committee, from\n8urton Paulu’s Convention committees. All of this points to activi¬\nties, and that’s good.\nIncidentally, the Board is going to have to make a couple of important\nDECISIONS ON NAEB BUSINESS WITHIN THE NEXT SIXTY DAYS, AND YOUR SUG¬\nGESTIONS COULD BE MOST HELPFUL.\n1 .: NAEB WILL R E C 0 M’M END TO THE CENTER THE PRODUCTION OF ONE OR MORE\nSERIES OF ’’PRESTIGE” RAOIO PROGRAMS. ALREADY, KEN WRIGHT’S RADIO PLAN¬\nNING COMMITTEE HAS GIVEN PRELIMINARY CONSIDERATION TO A NUMBER OF PRO¬\nPOSALS. At a meeting early in December Ken’s group will recommend to\nthe Board certain proposals to pass along to the Center. If you have\nany good ideas, now is the time to fire away. Get any suggestions in ,\nbefore December 1, and be specific as possible. What subject area,\nwho might be good consultants, who might plan and produce, length of\neach program, length of series, purpose, etc. And this can include\nadult or in-school programming.\n2.. NAEB must plan and hold one or more seminar.s within the coming year.\nIn what areas? For whom? For what purpose.? Here, too, a number of\nSUGGESTIONS HAVE BEEN GIVEN PRELIMINARY CONSIDERATION BY THE BOARO,\nthe Professional Advancement committee is studying similar problems in\nSPECIAL AREAS, AND YOU HAVE AN OPPORTUNITY TO CONTRIBUTE WITH GOOD\nsuggestions. Let’s have them before December 1.\nIn all cases,' if you have doubt as to where suggestions really should\nGO, FIRE AWAY AT EXECUTIVE DIRECTOR HARRY SkORNIA. THE HEADQUARTERS\nOFFI-CE WILL SEE THAT ALL CONCERNED PERSONS RECEIVE THE DOPE.\nAt YOUR CONVENTION, YOU ELECTED THREE NEW REGIONAL DIRECTORS. THEY\nHAVE ALREADY RECEIVED THEIR WELCOME FROM THE BOARD, AND HAVE ATTENDED\na Board meeting. The new members also held a two-hour conference with\nYOUR PRESIDENT, GETTING A FILL-IN SO TO SPEAK ON WHAT’S BEEN GOING ON,\nWHAT’S LIKELY AHEAD. ■\nRight here I wish to express my personal thanks for- the help I’ve had\nfrom ’Paul' Rickard, from Marguerite Fleming, and from Jim Ma;candrew. I.\nKNOW YOU, TOO,. JOIN IN THIS EXPRESSION OF APPRECIATION TO THEM FOR\nTHEIR SERVICES TO NAEB. THERE ARE SOME MIGHTY FINE PEOPLE IN NAEB, AS\n| HAVE ALWAYS SAID, AND WE’VE HAD SOME MIGHTY FINE BOARD MEMBERS.\nThanks, again, trio."
}