{
  "id": "d746-15",
  "text": "AMERICAN CHAMBER MUSIC\nThe advancement of chamber music performance in America during the past\ntew years has been accompanied by an enormous increase in the number -— and\nquality — of chamber music works composed by Americans. During the nineteenth\ncentury a composition for a small instrumental combination from the pen of an\nAmerican composer was a rarity, though there was no shortage of symphonies,\noperas, piano pieces, and many other forms of music. Today this genre is the\nprincipal means of expression for many of our most gifted composers.\nThe years since World War II have been years not only of great development\nof American chamber music, but of the universal recognition of that music, and of\nits dissemination to many corners of the world. This phenomenon, which continues\nundiminished, is due in considerable degree to the influx, and subsequent assimilation\ninto our culture, of many of the world's greatest composers during the I930's.\nThe summer series of chamber music concerts at the Museum presents a varied\nand typical cross-section of the chamber music being created today by Americans,\nnative and transplanted. Some of these works will grow in stature with the years,\nothers will be forgotten. At the concerts, players and listeners alike will be contribut¬\ning to that historical process—and, we are sure, finding much pleasure in so doing.\n—Robert Turner\nFelix Slatkin, Violin\nPaul Shure, Violin\nQuartet in A Minor, Op. 41\nQuartet No. I *\nQuartet in E Minor\nJULY 2\nHOLLYWOOD STRING QUARTET\nPaul Robyn, Viola\nEleanor Aller, Cello\nRobert Schumann\nWalter Piston\nBedrich Smetana\nJULY 9\nPHILHARMONIC TRIO\nWilliam Kurasch, Violin Maxine Furman, Piano\nJoseph DiTullio, Cello Franklyn Stokes, Clarinet, Guest Artist\nTrio in E Flat for Violin, Celio & Piano, Op 100 ..... Franz Schubert\nSuite for Violin, Clarinet and Piano * - - - - - - - - Darius Milhaud\nTrio in B Flat for Clarinet, Cello & Piano, Op. II - - - - Ludwig van Beethoven\nTrio in D Minor for Violin, Cello & Piano, Op. 49 - - - - Felix Mendelssohn\nJULY 16\nNEW MUSIC WOODWIND ENSEMBLE\nHenry Woemtner, Flute Franklyn Stokes, Clarinet\nJoseph Rizzo, Oboe Adolph Weiss, Bassoon\nBernard Whitefield, Pianist and Composer, Guest Artist\nQuartet for Flute, Oboe, Clarinet, Bassoon, Op. 93 Karl E. Goepfart\nSmall Classical Suite (1940)*.- - - - Adolph Weiss\nQuartet for Woodwinds in C Major (1941)* ------ Arthur Berger\nTrio for Oboe, Clarinet and Bassoon (1921) - - - - - - Villa-Lobos\nQuintet for Piano and Woodwinds .Bernard Whitefield\nJULY 23\nMANUEL COMPINSKY TRIO\nManuel Compinsky, Violin Alex Compinsky, Cello\nSara Compinsky, Piano\nTrio in D Major, Op. 70, No. I.Ludwig van Beethoven\nThree Nocturnes for Trio*.- - - - Ernest Bloch\nThree Trees*.- - - - - - Willy Stahl\nTrio in D Minor, Op. 9 - - - Serge Rachmaninoff\nJULY 30\nEUDICE SHAPIRO and SHIBLEY BOYES\nSonata in A Minor - - - - - - - - Pasquali-Ysaye\nSonata (1943)* -----.Aaron Copland\nSonata in G Minor (1917) - - - - - - - - - Claude Debussy\nDuo, Op. 162 in A Minor --------- Franz Schubert"
}