{
  "id": "d1768-10",
  "text": "An inexpensive and reliable survey service of the type organized by\nG E Garrison of the Wayne University Broadcasting Guild (Detroit, Michigan)\nwill supply information of this type to broadcasters. Such a survey does not\nhave the shortcoming common to most of the commercial services of failing to\nadequately reach families of low income level, which have no telephones.\n(2) Broadcasters can use data on relative preferences (that is,\npreferences between programs) to estimate the desirability of changing edu¬\ncational programs to more nearly resemble preferred types. An analysis of pro¬\ngrams most preferred should provide plenty of hints for the improvement of\nexisting educational series.\n(3) Bata supplied by research showing preferred types of program\ncontent (news, comedy, fiction, education) can be used by broadcasters of edu¬\ncational programs to provide leads for the remodeling of educational programs\nin terms of preferred types. It is possible that educational programs that are\nto attract and hold the attention of large masses of people must actually be\nmade to resemble other types of programs that are most popular before mass\neducation by radio can be successful. At present \"educational’' programs are\nactually the least preferred type. Many people do learn a good deal from other\ntypes of program, of course, and it may well be that the popular daytime\nserials provide the form in which educational programs must be cast, before they\nwill be widely accepted. Only research can decide this question, and such re¬\nsearch is urgently needed by educational broadcasters.\nThe Evaluation of School Broadcasts group studied the effect of a\nchange in content of educational music programs in cooperation with the Columbia\nBroadcasting System. Symphonic music using familiar thematic material taken\nfrom the folk music of America was presented on the assumption that familiarity\nof theme would help make symphonic music more understandable to students. Al¬\nthough the study is not yet complete, it appears that themes must be more\nfamiliar than those used in this study if they are to aid in increasing under¬\nstanding and enjoyment of symphonic music. A large proportion of the American\nfolk themes used turned out to be unfamiliar to most of the children who\nlistened.\nIt is also possible to decide by means of listener research what\ngeneral subjects and what topics are preferred by the radio audience. It has\nbeen known for quite a while that astronomy ranks high in interest among\nscience topics. Further research will uncover many other particular content\ninterests of this sort, although but little is known of these preferences now.\n(4) Broadcasters can use immediate information supplied by research\nconcerning preferred types of program production. The time is rapidly passing\nwhen educators-in-radio feel compelled by considerations of dignity to\ndifferentiate educational programs from entertainment. Progressive educators\nare unanimous in their acceptance of the principle that effective education must\nbegin in a language, style and form acceptable to the persons being educated.\nSince radio programs are freely chosen, acceptability must mean preferability.\nIf for example it is found by research methods that not more than 20\nper cent of the time on the air can be spent in carrying the message of the\nprogram explicitly, then educators-in-radio will have to modify their programs\nwidely from existing practice.\n-5-"
}