{
  "id": "d1768-14",
  "text": "interest in certain science activities. Transcriptions of science school broad¬\ncasts that fitted their school work were played for these children. They were\nthen given tests to determine whether or not the programs and their utiliza¬\ntion in the classrooms had stimulated them to find out more about the subjects\npresented. It was found that the groups hearing these programs did in fact do\nmore reading, discussing and information-getting than comparable groups of\nstudents not hearing the programs. Similar research is urgently needed both on\nthe stimulating effect of in-school and out-of-school radio listening.\n(8) Educational radio may be expected to change some of the attitudes\nof those who listen regularly. Research is urgently needed to determine what\ntypes of attitudes are most easily changed and what groups of adults and young\npeople are most susceptible to this influence. The Evaluation of School\nBroadcasts group is working on this problem with attitude tests and opinion\nscales given to comparable groups of school children before and after radio\nseries. The Office of Radio Research at Columbia University, working with\nlistener panels and repeated interviews, will shortly provide some information\non these points. Preliminary studies already completed by the latter group\nimply that persons of neutral attitude shift more often toward one side or the\nother than do persons who state beforehand that they are certain of their\nattitudes.\n(9) Teachers concerned with developing the ability of their pupils\nto think will be quick to see the value of research designed to test the effect\nof educational radio on thinking. The Evaluation of School Broadcasts group\nhas some work in progress in this area. For example, they are testing the\nrelative ability of high school listeners and non-listeners to \"America’s Town\nMeeting of the Air\" to give good reasons for their opinions. If significant\ndifferences are found between the listening and non-listening groups, a strong\ncase will be made for the value of this program to high school students, and\nteachers will know that students can be helped in their thinking by programs of\nthis type.\nResearch of Particular Value to Civic and Administrative Groups\n(l) Many civic groups, particularly Parent-Teacher Associations, are\nconcerned about the large amount of time that youngsters spend listening to\n\"trashy\" radio programs. Judgments of the time spent in this way are made all\ntoo often on the experience of a few individual parents. It is a subject for\nobjective research to determine the actual listening habits of youngsters all\nover the country. Furthermore, until more definite results have been obtained\nfrom research on effects, of the types discussed below, it will be premature to\nstigmatize programs as trashy. Studies reported on at the Eleventh Annual\nInstitute for Education by Radio at Ohio State University, May 19^-0 (especially\nthose by Ethel Shanas and by John P McKay) show that it is not difficult to\nget reliable information, at least for a single community, concerning favorite\nprograms and total time spent. Such information should be a sine qua non for\nParent-Teachers Associations and other civic groups who wish to be influential\nin determining the radio diet and habits of children.\nOther civic groups engaged in safety, health, consumer education, or\nother campaigns, will need to know when they can reach the particular audience\nthey have in mind. Research will be required to determine the best times to\nreach women, adolescents, children, working-men, or professional people.\n-9-"
}