{
  "id": "d1768-16",
  "text": "radio offering of broadcasters in constructive ways. They can use the findings\nof research on content-preferences in several ways. If it is found that the\nadult audience shows consistent preferences for, say, news commentaries and\nhumorous variety programs, this fact should affect the administrative group's\nsponsoring and publicizing of programs. Such a finding surely does not justify\nthe development of programs featuring academic discussions of the great Greek\nphilosophies or of astronomy.\n(5) The preferences of young people as between different types of\nradio production must be studied extensively if civic groups are to make\nresponsible recommendations concerning programs that children can like. It may\nbe that the preferences of many young people for programs judged objectionable\nis not due to their content but to the interesting way they are produced. Re¬\nsearch can decide this question: recommendations by civic groups made in the\nabsence of this research are merely the opinions of pressure groups,\n(6) Civic groups concerned with the listening habits of children\nwill want to know if listening to one program influences the youngsters to\n-listen to others of the same type. or if they become quickly satiated and turn\nto other types. Such \"effect studies on preferences\" are not now available, but\nthe schedule of broadcasting for children can probably be improved by studying\ninformation on this point.\nWe rarely know in advance if repetition serves to get something into\nthe youngster’s system or whether it serves to get something out of his system.\nSome will say he is developing the habit of listening to programs of a given\ntype, others will say he is getting rid of some kind of frustration in a harm¬\nless way. Many of the programs widely listened to by youngsters depict killings\nand tortures, many describe as a hero someone who has powers not possessed by\nanyone else, some consistently present members of other races as inhuman cri¬\nminals and agents of the police as heroes. It may be, as some think, that these\nprograms debauch young people into permanently vicious attitudes and habits of\nthought. On the other hand, it may be that some such period of permissible\nfantasy is needed by many youngsters and their other, more constructive efforts\nWould be blocked if these destructive impulses were not given some free play.\nResearch can supply information on these points, and civic groups can use this\ninformation to help decide their policy with respect to these programs.\n(7) Civic groups are concerned with the possibility that destructive\ntrains of thought and action may be stimulated in youngsters by some of the\nradio programs they listen to. A few studies have implied that children in\njuvenile court frequently admit the influence of gangster radio productions on\ntheir actions. Much more research is needed before it can be taken as proven,\nhowever, that these youngsters would not have been found delinquent had no such\nprograms been on the air. Miss Ethel Ghanas found that delinquent and non¬\ndeliquent boys living in so-called delinquency areas have about the same types\nof radio preferences, crime and mystery programs being the major interest of both\ngroups. These programs are noticeably less popular with children coming from\nmiddleclass areas. It may well be, however, that such programs provide a\nvaluable substitute for other destructive activity, and civic groups should not\nrecommend, without further research, that these programs have predominantly\npernicious influence.\n-11-"
}