{
  "id": "d1768-17",
  "text": "(8) Those civic groups that are concerned with the influence of radio\nprograms on the attitudes of young people will require a large volume of ob¬\njective data before they can be sure that their recommendations are desirable\nand feasible. It should be clear that testimony of teachers and parents, even\nthough large in volume and wide in spread, is not a substitute for research\ndata. Information is urgently needed telling in detail which opinions and which\nattitudes are most influenced for young people of different ages, of different\neconomic status, in different parts of the country, in the cities and on farms.\nCivic groups interested in the effect of the radio on the attitudes\nof adults include groups interested in political propaganda and in adult edu¬\ncation. It is evident that the publicity sections of the major political parties\ntake it for granted that opinions can be influenced by radio, or at least that\nthe radio can be used effectively to maintain attitudes already professed. How¬\never, the first thorough study of the place of radio and other media in\ninfluencing voters was made during the 19^0 Roosevelt-Willkie campaign.* The\ndirectors of adult education projects and workers’ schools, and trades union\ndirectors have some information on these points but more data will mean less\nenergy wasted on ineffective programs.\n(9) Little information is available concerning constructive effects\nof radio listening on thinking. The unpublished reports of the Evaluation of\nochool Broadcasts group show that any improvement in critical thinking as a\nresult of listening to radio programs designed for that purpose must be very\nsmall, if indeed it exists at all. However, this conclusion by no means settles\nthe question: Can the radio serve in adult education? The effectiveness of\nlanguage courses over the air is now being studied. There can be little doubt\nthat such radio courses as WLXAL’s Modern Radio Course taught many of its\nlisteners a great deal. However, the listening group is highly selected and the\nsubject well adapted to radio teaching. One could not venture a general con¬\nclusion on the basis of these data concerning the effectiveness of radio in\nteaching people to think. ■ It is highly probable that radio will become a unique\nteaching tool for certain groups, for example - for the isolated families in the\nKentucky Mountains using the listening centers established by Station WKBY.\nThe writers believe that the foregoing classification should prove\nuseful for the various potential users of research. In order to make this\nclassification of practical value it will be necessary to make a fairly exhaus¬\ntive study of the research done so far, classified along the lines outlined by\nChart I on page 3,\nShowing the preferences for and effects of radio classified by sub¬\ngroups of the audience should be a fundamental consideration in analyzing the\nresults of such research. Such \"stratification\" by education, by section of\ncountry, by income group, by age, by sex, by size-of-community, etc., always\nhelps the users of research. It is of especial importance to those interested\nin educational broadcasting because they rarely are interested in the entire\nradio audience but rather must direct each program toward a certain group.\n* - A publication covering this study by Columbia University*s Office of Radio\nResearch will be published by Chicago University Press early in 19^1.\n-12-"
}