{
  "id": "d1768-7",
  "text": "A. The producers are all those associated with broadcasting;\nstation managers; program,, educational and publicity\ndirectors; sponsoring educational and public service groups\nand agencies.\nB. The distributors are: teachers in classroom, college and\nnormal school; supervisors, and state departments of\neducation.\nC. The ultimate consumers are the listeners, who would be\nrepresented by:\n1. Civic groups\n2. Administrative groups\nAlthough it is unlikely that the listeners will be able to use the\nresults of research directly, certain civic and administrative groups repre¬\nsenting them may find several important uses for research data. Typical of\ncivic groups are parent-teacher associations, women’s clubs and adult education\ngroups. These groups may be said to consume educational broadcasting directly,\nwithout the mediation of any distributor. (The fact that some of these groups\nmay also function as producers of programs should not obscure the fact that\nessentially they represent segments of the listening public.) By adminis¬\ntrative groups are meant the Federal Radio Education Committee, the Federal\nCommunications Commission, the Federal Trade Commission, the U. S. Office of\nEducation and the like. We will distinguish here, then, between four groups\nwho may use research in educational radio, namely, broadcasters, teachers,\ncivic groups, administrative groups.\nListener research in educational radio may be classified into two\nmain types.\nI. On the PREFERENCES OF LISTENERS AND POTENTIAL LISTENERS.\nII. On the EFFECTS OR INFLUENCES OF RADIO ON LISTENERS.\nI. PREFERENCES are mainly of these kinds:\n1. Quantitative, shown by amount of listening, size of\naudience, time of day, etc.\n2. Relative, shown by comparison of radio listening\nwith other activities (reading, visiting, theatre\nand movie attendance, sports, etc.), and by\npreferences between programs.\n3. Content, used here to refer to\n3.1 Type of program (classical music, popular music,\ninformation, comedy, news, fiction)\n3.2 Subject matter (astronomy, history, economics,\ntechnology, psychology, etc. etc.)\n4. Production, as shown by choosing dramatizations,\nlectures, forums, on-the-spot broadcasts, documentaries,\nserials, etc.\n-2-"
}