{
  "id": "d1452-1",
  "text": "-2-\nTEE NEEDS OP EDUCATIONAL BROADCASTING\nF, H# Lumley\nOhio State University\nThere are at the present time several deficiencies in the functioning of\neducational broadcasting in the United States. Conditions which handicap further\ndevelopment of radio as an educational medium are; (l) lack of adequate publicity\nfor educational programs; (2) lack of balance and appropriateness in the presenta¬\ntion of educational programs; (3) lack of syndicated educational features, either\navailable by wire transmission or recordings; (4) lack of adequate remuneration\nfor educational talentj (5.) lack of development of listener organizations.\nThe average listener is now in a state of hopeless confusion as far as know¬\nledge of programs, educational or otherwise, is concerned. The listings of the\nnewspapers are inadequate and tantalizing. Other special listings put out by\neducational stations, organizations, and departments of commercial stations are\nnecessarily limited in scope. A unified program information service is needed.\nI hooe the time will come when educational programs will be listed in regional\nprogram bulletins, and listeners will subscribe to such a service. The programs\nwill be given not only by time of day, but classified under subject matter as well.\nThe listener who wants to hear- a talk on economics will not have to search diligent\nly for mention of such a talk in among countless other program listings.\nProgram balance is an expression which the listener has learned to forget.\nBy this I mean that sequences of programs now bear little if any relation to one\nanother. Therefore groups of programs should be intrinsically related within cer¬\ntain periods of time. The least time for which programs may be balanced should\nbe cne hour, and two hours is preferable. No one would think of going down town\nto a mcvie which lasted only 15 minutes, nor can the radio listener be expected to\nstay heme to listen to a 15-minute program which comes in the middle of the evening\nYue must build programs which the listener will prefer to other types of educational\nofferings or entertainment. This can only be done if the programs are of exception\nal interest or form a coordinated presentation of sufficient length to justify the"
}