{
  "id": "d1590-0",
  "text": "NfWS LETT £ R.\nN-A-E-B\nNational Association of Educational Broadcasters\nUrbana, Illinois - November 18, 1937\nPLAN TO BE THERE\nThe National Conference on Educational Broadcasting will be held in the Drake\nHotel, Chicago, November 29, 30, and December 1. The Conference will hear spokes¬\nmen for the radio audience, the radio industry, and for education. Representatives\nof the Federal Radio Education Committee, the Federal Communications Commission,\nand the Office of Education Radio Project will report on government activity.\nTopics which will be discussed at the Conference will includes \"The American\nSystem of Broadcasting,\" \"Talks Programs,\" \"What Happens to the Listeners?'*,\n\"Radio and the Child’s Education,\" \"How Does Broadcasting Operate in the Public\nInterest, Convenience, and Necessity?\", \"Cooperative Radio Councils,\" \"Radio As an\nArt Form,\" \"Classroom Use of Radio,\" and others. Some of the subjects will be dis¬\ncussed in sectional meetings, some at the general sessions.\nHERE'S CHANCE TO BOOST YOUR STOCK\nN.A.E.B. members have been requested by Mr. C. B. Roden, Librarian of the\nChicago Public Library, to submit material for an exhibit at the Conference.\nMr. Roden writes:\n\"Will you contribute to this Exhibit copies of books, pamphlets,\nscripts, program announcements, printed radio talks, periodicals, news\nletters, discussion outlines, yearbooks, &e. - which you may wish to\nexhibit or which you think will be of interest to those attending this\nConference?\n\"Such material may be sent either in quantities for free dis¬\ntribution or in single copies for display only. We should, however,\nprefer to avoid responsibility for returning items to the sender unless\nhe has representatives at the Conference who will take charge of such\nitems.\n\"The material will be displayed on tables and wall boards\nspecially provided for this exhibit, adjacent to the place of meeting.\n“Please address all exhibit material to:\nMiss Alice M. Farquhar, Readers* Adviser\nc/o Chicago Public Library, Chicago, Ill.\"\nThe above excerpt from the letter speaks for itself. Better get your material\noff to Chicago right away.\nWELCOME KFUO!\nNAEB welcomes its newest member. The Rev. Herman H. Hohenstein, Director, has\nplaced KFUO in the ranks of NAEB. Our new member is owned by the Evangelical\nLutheran Church, Missouri Synod; is located at Concordia Theological Seminary in\nSt. Louis, and operates on 550 Kilocycles with 1000 watts power. Like others of\nus, KFUO has had to fight to retain its place on the radio dial. But KFUO fights\non. It now seeks an increase in power from 1 KW to 5 KW.\nWHERE NEXT?\nNo sooner has the ink dried on the NEWS LETTER, issued by Harold Engel in\nMadison, Wisconsin, than Elmer G. Sulzer of the University of Kentucky sits himself\ndown at the typewriter and writes the new executive secretary. Elmer wants the next"
}