{
  "id": "d1590-1",
  "text": "-2-\nmeeting of NAEB held in Kentucky - specifically at the University of Kentucky.\nElmer has many reasons why he believes the organization should come to Kentucky, too\nmany to mention. Now what do you think of Mr. Sulzer’s suggestion? NAEB members\nwould like to know.\n\"THIS IS THE EDUCATIONAL BROADCASTING SYSTEM'*\nDoesn't that cue line sound good to you? Don*t you think if it were used by\nall educational stations when two or more are broadcasting simultaneous programs,\nthat it would help build up our prestige? Think it over and perhaps you’ll agree\nwith Jim Ebel, Joe Wright, and the Radio Committee of WBAA of Purdue Uiiversity.\nJim Ebel is the chief engineer of WILL. He suggested that, looking toward the day\nwhen educational stations can be linked together more frequently, the stations\nshould use a chain-cue. WILL - Joe Wright - approved. WILL carries six periods of\nprograms each week from WBAA at Purdue. Gilbert D. Williams, Director of Programs,\ngot the approval of his radio committee for use of this cue. That was the start.\nWILL carried a football from WSUI. The same cue was used. WILL uses it when fur¬\nnishing any of its programs to commercial stations. Think it over, NAEB members.\nPerhaps you’ll have an opportunity to use this cue. Perhaps you would be glad to\nvoice your criticism to the secretary.\nIMPROVEMENTS FOR WOSU\nMr. R. C. Higgy, Director of Ohio State University's radio station WOSU, re¬\nports that things will be different in Ohio soon. The FCC has approved an applica¬\ntion of WOSU for permission to move its transmitter and erect a new vertical antenna.\nThe new tower is to be erected on the University’s golf course about three miles\nfrom Columbus. The tower will be 330 feet in height. Of course, the transmitter\nwill be moved. Then WOSU expects to increase its service to its listeners.\nWTAW ASKS FOR BETTER FACILITIES\nTexas A & M, owner of WTAW, has filed an application with the FCC requesting\npermission to make changes in antenna, change hours of operation from specified\nhours to daytime, and to move transmitter locally. WTAW is requesting facilities\nof KTBC.\nTHE OHIO RADIO ANNOUNCER\nThe Ohio Radio Announcer, a monthly listing of educational radio programs, is\nbeing published again this year by the Bureau of Educational Research, Ohio State\nUniversity. Any teacher interested in the use of educational radio programs in the\nclassroom may be placed on the mailing list of the Radio Announcer by writing to\nI. Keith Tyler, Hayes Hall Annex, Ohio State University• There is no charge for\nthis publication.\nEYES ON THE GOAL\nMany NAEB members are seeking better facilities. WLB, University of Minnesota,\nand WGAL, St. Olaf College, both have been granted construction permits recently by\nthe FCC. WHA, KFUO, WBAA, WILL, and perhaps others have applications pending before\nthe FCC. Our next NEWS LETTER will give a more comprehensive report. Let's have\nthe dope from your station."
}