{
  "id": "d1332-1",
  "text": "RECORDED MUSIC ROYALTIES — GOOD NEWS\nN.A.E.B. members have boon spared, much trouble and possible payment of large\nfees by negotiations wo have carried on with the American Society of Recording Ar¬\ntists* Non-commercial educational stations are to bo exempt from the payment of\nfees for playing phonograph records* Special N.A.E.B. bulletins on this subject\nwere issued recently. Here now is the latest official information:\nAMERICAN SOCIETY OF RECORDING ARTISTS\nGuaranty Building, Hollywood, California\nMarch 13, 1936\nMr* H.B. McCarty\nRadio Station WHA\nMadison, Wisconsin\nDear Mr* McCarty:\nYour lotter of February 25th was referred to the\nBoard of Directors, and I am instructed to advise you as follows:\nInstead of dealing with each station individually,\nit is the Board’s preference that the National Association of Educa¬\ntional Broadcasters be the medium through which contact with education¬\nal stations be made* Therefore, you are authorized to notify your station\nmembers that thoir use of the talents of the Society’s members, through\nthe medium of recordings, will not be interfered with so long as such\nusages are for non-commercial, non-profit purposes, and the stations\nwhich do not sell time may feel free to continue using such talents,\nthrough the medium of recordings, as heretofore.\nIn tho few instances of such of your station members\nas aro selling a small percentage of time, tho Board would appreciate\nfull details with regard to such sale of time, that is, whether during\nthe time sold, tho station broadcasts live talent or recorded talent#\nit for us.\nWo shall appreciate this information if you can obtain\nVeiy truly yours.\nARTHUR W. LEVY\nExecutive Secretary\nThis servos as notice of members’ authorization from tho A.S.R.A. Member sta¬\ntions selling time are urged to send to McCarty at once full information as sugges¬\nted in Mr, Levy's letter* Wo may assume that no further individual negotiations are\nnecessary because the Society will be kept informed of our members and their status*\nIn case'of questions or difficulties, report them to headquartors of our •wn Asso¬\nciation, not direct to the American Society of Recording Artists.\nHere v/o have a vivid demonstration of the importance and value of our organiza¬\ntion. We see clearly tho benefits of unified action* \"Instead of dealing with each\nstation individually, it is tho Board’s preference that tho National Association of\nEducational Broadcasters be tho medium through which contact with educational sta¬\ntions bo made.\" There we have it — unbeatable argument for paid-up, active member¬\nship in N.A.E.B.\nThis exemption, secured through cooperative effort, means a saving of thousands\nof dollars, should the A.S.R.A. bo disposed to collect from all stations and be suc¬\ncessful in enforcing its claims for royalty payments. This makes our yearly member¬\nship foe of $10 look mighty small — and its value big#"
}