{
  "id": "d1332-3",
  "text": "Fodcral Radio Education Committee - cont«\nPreliminary to the efforts to \"eliminate controversy\" and \"promote cooperative\narrangements\" between educators and broadcasters, it is planned to study cases in¬\nvolving failure to cooperate* Your president, H.B. McCarty, has been invited to\nservo as a membor of this Sub-Committee on Conflicts.\nMcCarty, in an appeal for guidance, says \"I need suggestions and comment from\nall our members, in order that I may properly represent our association on this Fed¬\neral Radio Education Committee. Won’t you please send to me at onco information\nyou have about instances of controversy or lack of cooperation between educators\nand broadcasters? And as for research, what ideas do you have? 'What studios would\nyou like to soo made? Give mo your guidance, please.\"\nFACILITIES IMPROVEMENTS\nWILL - University of Illinois. Joe Wright reports:\n\"The Federal Communications Commission this week granted authority to WILL to\nchange from 890 to 580 kilocycles, subject to the installation of a directional an¬\ntenna to protect WIBW, Topeka, Kansas, which also operates on 580 kilocycles.\n\"It will bo necessary for us to put up 325 foot towers and consequently find a\nnew location for them out on the University’s South Farm. A new transmitter build¬\ning mil also bo erected on that site, although the various studios will remain\nin their present locations on the campus. Wo hope to have our now outfit in oper¬\nation by the first of September. Although wo will have no nighttime hours, wo\nwill have a full daytime schedule, and we believe we will be able to do a much bet¬\ntor job in all respects than wo have been doing up to the present time.\"\nAuthorized power is 1000 watts, but \"wo hope to got more power later,\" Joe adds#\nThe next ncws-lottcr mil include a tabulation of the data on facilities and\noperation of educational stations as reported in the N.A.S.B. survey, /my changes\nto report for your station?\n\"BROADCASTING\" SUBSCRIPTION OFFER\nThe editors of \"Broadcasting\" magazine have come through with a special, at¬\ntractive offer for N./..E.B, members* A full year’s subscription to the magazine,\nincluding the big \"Year Book\" number, is available for $1.50. This is just half\nthe usual price. In each issuo is listed the record of F.C.C. decisions since the\nprevious issue. Members taking advantage of the offer are requested to mention\nthis N.A.S.B. arrangement with Mr. Sol Taishoff, Vice-president* The address:\nBroadcasting, Suite 870, National Press Building, Washington, D.C.\nTHE 1936 CONVENTION\nIn last month’s news-letter, it was stated that this time wo would report on\ninvitations from stations wishing to servo as hosts to the annual convention this\nsummer or fall* The only reaction thus far is a letter of invitation to each member\nfrom Prof. H.L. Ewbank, chairman, of the Wdi\\ Radio Committee, inviting the station\nrepresentatives to meet in Madison. Return cards wore included with the letters.\nThose will give an expression of sentiment and will bo reported on in the next lctteri"
}