{
  "id": "d231-21",
  "text": "■2'\n-y\nKennedy^Secretary of State Dean Brisk, Secretaries Ribicoff and Freeman,\nAttorney General Robert Kennedy/ chief of protocol Angler Biddle Duke,\nEdward R. Murrow and Henry Loomis of the USIA and VOA, visiting\ndiplomats and heads of state such as Konrad Adenauer, Chaban-Delmas,\nSukarno, Hastings Banda, Tage Erlander, Manlio Brosio, Pedro Beltran,\nand Fulbert Youlou, journalists Raymont and Maestro, broadcasters Frank\nStanton and Leroy Collins, and many others in public office#\nThe Voice of America has been extremely cooperative in providing\nmaterial of all sorts to the NAEB# They have indicated enthusiasm for\nthe opportunity to have VOA productions and services available to\nthe American public through educational stations# Procedures have been\nworked out whereby timely talks and interviews, as well as special\nproductions, are mailed promptly to the committee chairman for audition\nand incorporation wherever possible into network programs#\nIt should be pointed out that the network does not and should not\nplace over-emphasis or rely too heavily on such materials from the U.S#\ngovernment or other organizations (those prompted to submit materials\ninclude the Center for the Study of Democratic Institutions, the National\nCommittee for the Musical Arts, the National Education Association, The\nCleveland Orchestra, and a number of individual producers#) But network\nmembers as always should be encouraged to keep presently available formats\nin mind when submitting materials# Network stations have the programs#\nGreater participation is needed#\nThe committee has announced its interest In receiving single\nlectures recorded on various campuses# Sufficient entries for this\n\"lecture of the week” idea already will make it possible to program an\nentire quarter#\nI venture to suggest that within the past few months more programs\nof a timely nature have been distributed by NAEB than ever before in\nits history# It Is still not possible to distribute dated materials and\nthere seems to be no way short of a live network that this can be\naccomplished# As live networks come into existence in the East, the\nMidwest and elsewhere, the network should adapt Itself to supply the\nneeds of such live networks and to benefit from new programs made\navailable to such live networks# However, the NAEB and its members\ncannot ‘lose sight of the fact that, in spite of these efforts to supply\nvital timely information and comment, the foundation of network\noperations must remain the carefully-produced durable series, whether of\na documentary, dramatic, music or talk nature. The need for such programs\nhas never been greater than it is now#\nIn the field of programming from foreign sources, the Committee\nas not been altogether Idle# The Chairman spent a day with Mr. Acda of\nthe Netherlands Radio and several proposals on both sides were made\nwhich may bear fruit in the near future# Beginning July 7# Netherlands\nRadio will broadcast once a week a news commentary program on short\nwave aimed directly at the United States and with the specific intention\nof having the program used by educational stations. WUOM will record\nthe first transmissions and correspond with Mr# Acda about the technical\nand content problems involved# If the operation is successful, the programs\nwill be distributed by NAEB."
}