{
  "id": "d1144-1",
  "text": "NAEB News Letter\nMarch 1, 1939\nPage 2\nArticle One. The proper presentation and broadcasting of educational\nprograms by radio is a joint responsibility of educational authorities\nand radio station executives. The whole-hearted and understanding\ncooperation of each group is necessary to insure effective results in\nthis field.\nArticle Two. Allocation of a certain amount of time for educational\npurposes is a “public interest11 requirement on the part of radio stations.\nRadio stations have a right, however, to insist upon standards of\npresentation that are in keeping with their program standards.\nArticle Three. Radio stations should endeavor to prevent duplication in\neducational programs by discussions involving all parties concerned.\nArticle Four. The selection of educational subjects for broadcasting,\nas well as the selection of proper techniques for such presentation\nwhould be in the hands of educators. It is important, therefore, for all\neducators involved in handling 9uch programs to acquaint themselves with\nthe latest techniques, to study studio procedure in general, and to\nmaintain at all times a broad objective point of view.\nArticle Five. In common with other types of programs, educational\nprograms should attempt to reach as large an audience as possible. To\ndo so, radio educators should attempt to frame programs in the most\nattractive way possible — to make them interesting as well as educational\nthus Increasing their educational effectiveness.\nArticle Six. Educational programs should be planned for limited groups,\nonly when such groups are of an underprivileged type and can conveniently\nget the material In no other way, or when the nature of the program is\nsuch that a radio broadcast proves itself vastly superior to any other\nmedium of presentation.\nArticle Seven, .questions of taste and censorship involve an Interlocking\nrelationship between broadcasters and educators. Broadcasters should not\ncensor an educational program as regards fact, or as regards policies.\nOn matters of taste, however, broadcasters have a right to Insist on the\nusual station standards as well as discussions of certain subjects open\nconsideration of which is regarded as contrary to current good taste.\nArticle Eight. Educators owe to themselves and to_the cooperating # ^\nstation the impartial presentation of controversial subjects. Editorial-\nlzatlon is not desirable on controversial subjects, even on an educational\nprogram, unless all sides are fairly expressed.\nArticle Nine. Stations have a right to refuse time for a program that\nXs essentiaYly institutional promotion0 A certain amount of institutional\npromotion is naturally present ii all educational broadcasts, but the\nprimary purpose of a truly educational broadcast must be educational.\nWSUX FEEDS NBC NETWORK\nOn the 92nd Anniversary of the University of Iowa's founding, the blue\nnetwork uf NBC carried a broadcast, originated on the Iowa campus.\n“Out of the Land“, was a dramatized story written by Donald Sturgis,"
}