{
  "id": "d1144-2",
  "text": "NAEB News Letter\nMarch 1, 1939\nPage 3\nWSU1 script writer, and directed by H, Olay Harshbarger, Production\nManager0 The story told of the extraction of Vitamin K from Iowa alfalfa\nand the tense drama of its first use in saving an Iowa farmer8s life\nthreatened by extensive bleeding. President Eugene A. Gilmore of the\nUniversity opened the broadcast.\nFGC HEARING FOR WSUI\nThe University of Iowa (WSUI) application for construction permit to\nincrease power to 5 KW daytime and 1KW nighttime with directional\nantenna has been sfct for hearing. The case is set on the Calendar for\nMarch 27,\nKFUQ WITHDRAWS FROM NAEB\nA note from the Rev. H. H, Hohenstein, Director of KFUO, tells the story\nin these wordsi ,fI regret to inform you that the Board of Directors\nresolved to discontinue its membership,\nSTATE RADIO HEARING POSTPONED TO MAY FIRST\nWisconsin8 s application to the Federal Communications Commission for a\nfull-time, high power broadcasting station will be heard on May 1,\naccording to notification Just received by the Attorney General s office.\nOriginally set for February 28, the hearing was postponed to allow more\ntime for the preparation of the State6s case.\nIn its application the State is asking for a 16 hour a day station to\noperate in conjunction with the University of Wisconsin and capable of\nbeing heard in all parts of the state at night, as well as in the daytime.\nThe two public stations now must go off the air at sundown to avoid\ninterference with private stations on the same channels.\nThe application requests the use of the 670 kilocycle channel, the one\nselected by engineers as being the best able of any assigned In this\nmid-western region to render the service necessary over the entire state\nof Wisconsin, That frequency Is now used by WMAQ,, one of 168 stations\non the NBC network, and one of three stations in Chicago carrying NBC\nprograms.\nsuch coverage. There are large areas In the state where no Wisconsin\nstation can now be heard at night.\nLAWMAKER# BROADCAST DAILY OVER V»HA AND_WLBL_\nWisconsin 3olons are on the air from the state capital each afternoon at\none o* clock with discussions of .important issues facing the Legislature.\nThe broadcasts are originated and carried by the state-owned stations\nWHA, Madison and WLBL, Stevens Point,\nPRINCETON AND YALE ON THE RADIO\nGleaned from the collegiate press are these two Items whlcfr may interest"
}