{
  "id": "d1144-3",
  "text": "NAEB News Letter\nMarch 1, 1939\nPage 4\nyous\n“In yesterday’s papers appeared the announcement that Harvard will start\nits second year of weekly shortwave broadcasts of outstanding lectures\non a variety of subjects to an international audience. Continuation\nthis year follows responses indicating that the broadcasts gained the\nattention of individual listeners the world over, as well as that of\nacademic groups which used the lectures for classroom instruction.\n“Here seems to be a fine way of disseminating knowledge far beyond the\nconfines of the college itself. The radio has made possible the bringing\nof first-rate entertainment into the most remote territory. Why should\nnot higher education be spread likewise? . . . Princeton should not, of\ncourse, attempt a grandiose radio schedule. That Harvard’s experiment\nhas proven sufficiently successful to warrant its continuance is an\nadequate reason, however, for this University to Investigate the possi¬\nbility of performing a similar service on a 'somewhat smaller scale.—The\nDaily Princetonlan.“\n“In rejecting the proposed Yale Daily News radio program the Corporation\nhas made it amply clear that they are as yet undecided upon the two\nfundamental issues which a venture of this kind raises — first, should\nthe University “go on the air“; second, If so, what sort of program can\nthey endorse?.\n“There is ample reason to support the ground that Yale has no need to\ntake to the radio. The tradition of university life ... is strong\nenough to retain many adherents ... But the fact is that, whether or\nnot Yale likes it, many important oonees3ions have to be made to the\noutside world. Educators are coming more and more to feel that this is\nas it should be, since the main task of the University is to fit its\nstudents to lead a full life once they leave the ivied precincts. Those\nof this view will be found Increasingly in the pro-radio camp, we venture\nto oredict, as the years go by. Two main considerations are convincing\nthem that the air waves have a very important service to render the\nuniversities if given a chance.\n“First of these reasons is that radio is becoming more and more the all-\npowerful medium of education, persuading, threatening, and cajoling people\ninto one view or another. And since this is the case, for better or for\nworse, it will be well for the most important educational houses in the\ncountry to discover the best means of its use and exploitation. . . •\n“Second in the consideration of those who feel that radio should be taken\nup by the universities is the less appealing but essential business of\npublicity — that is, friendly and intelligent relations with alumni and\nwith the public. If a university ceases to be a dynamic force in the\nminds of its graduates, and becomes instead a mere hallowed memory, no\npart of which they would have changed, then that Institution is not\nplaying its part to the hilt.... No institution, moreover, is complete\nunless the public understands something of what it is trying to do and is\nsympathetic toward these efforts, —The Yale Dally News.“"
}