{
  "id": "d1144-5",
  "text": "NAEB News Letter\nMarch 1, 1939\nPage 6\nthe activities of the station* (2) During the year the Federal\nCommunications Commission authorized WILL bo increase Its power from\n1000 to 5000 watts. A new transmitter has been purchased and its install¬\nation awaits only the formal approval by the Commission of the Construction\nPermit. The Increase in power will enable the University to reach most\nof the state and a large section of Indiana. The Board of Trustees\nrecognizes the radio station as a valuable adjunct to the service of\nthe University rendered the state and has indicated its desire to bring\nthe station up to the same high standard the University maintains in Its\nother activities.\n“Indiana. Radio work introduced second semester last year to provide\ntraining to students Interested and talented in the field of radio work,\nand to provide means of favorable publicity for the educational activities\nof the University. Full time Director of Radio and Program Director work\nin conjunction with University Radio Committee. Four regularly scheduled\nprograms are broadcast each Wr ek by remote control through WIRE.\nCourses offered in script writing and mdlo broadcasting, as well as a\ngraduate course in radio. Radio Workshop Is Just beginning a State-wide\nRadio survey to determine how various agencies may contribute to better\nradio. A lecture series Is planned for the winter season.\n“All the leading colleges of Indiana are showing an active Interest in\nbroadcasting. Indianapolis Public Schools also maintain a full program\nmanaged by radio staff. Indiana State Teachers College and Purdue carry\nextensive programs. Indiana should present very favorable conditions for\na cooperative council and program.\nhIowa. The State University of Iowa has been moving ahead in the field\nof radio during the past year. A special committee consisting of deans\nand department heads Interested both in radio broadcasting and radio\nteaching surveyed the present status of radio on the campus and compiled\na bulletin entitled “WSUI Radio Programs - Service to the State”, which\nhas been printed and widely distributed. A sum of $100,000 was secured\nfrom state and P.W.A. funds for a new radio building and equipment. ±he\nRockefeller Foundation made the following grants; Professor in the\nDepartment of Speech received fellowship for six months* study with C.B.S.\nin New York City; Director of Station WSUI received fellowship for five\nmonths8 study with N.B.C. in New York City; Grant for three fellowships\nin radio at the State University of Iowa in the field of radio production;\nAssigned a research worker* from Princeton University project to study\nlistener response to stations WSUI and WOI. A student news commentator\nreceived a fellowship from a newspaper corporation to spend four months\nwith B.B.Co in London, A plan has been formulated for A Radio Institute\non the utilization of radio In the classroom to be held on the campus\nduring the year. An application for an Increase from 1000 watts day and\n400 watts night to 5000 watts daj^ and 1000 watts night has been filed\nwith the Federal Communications Commission.\n31 Kentucky. A Kentucky radio education council has been formed consistlig\nof the acting directors of radio of the University of Kentucky, University\nof Louisville, Eastern State Teachers College, Western State Teachers\nCollege, the President of Transylvania, the State Superintendent of\nPublic Instruction, and the president of ,the State Parent-Teachers\nAssociation. This group will function as a clearing house for problems"
}