{
  "id": "d1144-6",
  "text": "NAEB News Letter\nMarch 1, 1939\nPage 7\nassociated with radio work in Kentucky* The group has the endorsement of\nvirtually all radio stations in Kentucky* The University of Kentucky has\nbeen attempting to give a state-wide broadcasting procedure, using WHAS\nat Louisville as a key station* The mountain listening centers established\nsome years ago have been extended by the addition of some new centers and\nthe relocation of others* It is hoped to try out local broadcasting\nservices in Eastern Kentucky by the use of ultra high frequency broad¬\ncasting.\n‘‘Minnesota. Minnesota programs have been extended and improved. The\ninstitution is installing new transmitting equipment and is operating\nunder its new license with good wave length and improved power and time\nprivileges. Booklets for the Minnesota School of the Air have been\nextensively distributed. The project includes broadcasts to a large\nschool audience*\n“A radio Affiliations Committee to maintain contacts between University\nand radio stations throughout the state of Minnesota had been perfected.\nMr. Thomas D. Hishworth of KST.P has been the leader in this movement. The\ncommittee maintains service departments as follows; script laboratory,\nIntercollegiate, transcription\" library, artists0 bureau, and university\nnews. It is a promising development of the cooperative council idea.\n“An interesting enterprise and one which should not only advertise\nMinnesota programs but should also help to build an appreciation of the\nstation1s service is the publication of extracts from fan mail.\n“Montana. On March 5, 1938 a state-wide conference on civic broadcasting\nwas held in Bozeman, Montana. Much enthusiasm was manifest and definite\nplans were made_ looking, to the organization of a Council on Civic Broad¬\ncasting* Committees were selected to study the possibilities and make\ninventory of the resources of the state and region. Mr. Boyd F. Baldwin,\nchairman of the Radio Committee of the Montana Education Association, is\nleading the movement.\n“New York. Radio activities at Cornell University consist of the main¬\ntenance of a 1000 watt station, WESG-, for laboratory and extension purposes,\nand also cooperation with twenty-four radio stations operated in other\nparts of the state. Radio Station WESG serves as a laboratory for research\nand instruction for the school of Electrical Engineering. It serves\nalso as an outlet for extension broadcasting primarily by the College\nof Agriculture and as a laboratory medium in Instruction in broadcasting\nfor University groups. The College of Agriculture broadcasts as extension\nprogram for one hour each weekday; about one hour each week is used by\no$her groups for broadcasting to schools and to homemakers. During the\nyear about two thousand radio talks, announcements, seasonal warnings,\ndramatic and musical productions, etc., are broadcast by the University\nfrom this station.\n“North Dakota. Educational broadcasting is still in Jeopardy, as indicate\nby three recent law suits of the University of North Dakota. The Board of\nAdminlstration attempted to lease the station for ten years to -an adver¬\ntising agency in Chicago. The courts pronounced this lease invalid. A\nvhl0h wa? tsrmect a managerial lease, was then formulated.\nThis also has been declared illegal."
}