{
  "id": "d93-13",
  "text": "THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nNAEB Tape Network\nUniversity of Illinois\n119 Gregory Hall\nUrbana, Illinois\nPRELIMINARY OFFER\nMarch 7, 1951\nTo: All Stations*\nFrom: Dick Rider.\nIt is highly probable that the following described program\ncan be offered soon to all participating stations. A part of\nthe oroblem of getting clearance to use it is the permission of\nAFRA. The AF of M gave a blanket clearance, but AFRA would like\na specific list of the stations. Thus, this preliminary survey\nbecame necessary0\nThe program is entitled, \"The New World of Atomic Energy\"*\nIt consists of eleven (11) fifteen minute programs which explain\natomic fission and possible future uses of atomic energy. The\nprogram was produced by WLS of Chicago in cooperation with the\nU.S. Atomic Energy Commission and the Argonne National Laboratory.\nThe program is broadcast on WLS’s School Time. It has been\nenthusiastically received by the schools, the public, and by the\nAtomic Energy Commission. WLS has spent considerable time and\nmoney on this series, and it has promise of being a most worth-\nwhile addition to our schedule.\nIt is impossible to set an exact date at this time, but a\ngood guess would be that it could start late in April or early in\nMay. School stations might like to dub copies and use it next fall\nTo the best of my knowledge this would be O.K. I will also check\nwith AFRA on the possibility of keeping copies for school use, etc.\nI suggest that if you are at all interested in this series\nyou so indicate on the enclosed post-card. From these cards we\nwill make up a list to send to AFRA headquarters for clearance.\nOnce this process has been completed it may be next to impossible\nto add stations. Expression of interest does not mean acceptance\nof the series? We will send out regular offering forms when\nall clearances are completed.\nPlease return cards promptly so we may proceed with\nclearances. If we have not had a reply from you by March 19,\nwe will assume that you are not interested in this series.\nWith continuing best wishes,\nRichard L. Rider\nManager\nNAEB TAPE NETWORK\nRLR;bgm"
}