{
  "id": "d984-27",
  "text": "ASSOCIATION FOR EDUCATION BY RADIO-TELEVISION\nOffice of the President\nBoston, Massachusetts\nFebruary 29, 1956\nTOs AH Re clonal Directors\nFROM: John Adams Rourke, National Membership Chairman\nSUBJECT: Enclosed materials\nI am happy to report that the problems of a purely clerical nature which we\nhave been experiencing in this office in the last few months have now been cleared\nup* Now that we have the able assistance of two young ladies, both seniors in\nthe division of communication arts at Boston University School of Public Relations\nand Communications, we should be able to get caught up on the membership mate Tr¬\nials you are to receive. Enclosed you will find:\n1* The somewhat belated December issue of our new Membership Newsletter plus\nthe January-February issue. It is our thought, that in months to come these News¬\nletters may be of assistance to you in arranging membership campaigns in your own\nareas.\n2. A list of staff members of schools and colleges in your regions which\noffer courses in radio and television. Please note that this list contains names\nof people who are not presently members of AERT. It seems safe to assume that\na lot of theso folks will want to join as soon as you contact them. This list\nthen, will go along with the li3t of heads of departments of the same schools and\ncolleges. This latter list was sent to you late last\" fall.\n3. A relatively up-to-date list of those who presently are AERT members plus\nnames of people and institutiorf that subscribe to the AERT Journal. This should\nbe helpful to you in that it will indicate those you need not contact.\nli. A sample copy of the mimeographed AERT membership blank. It is our sug¬\ngestion that you have copies made of this and sent out to potential members within\nyour regions.\n5- A sample letter which we are using in this office to send to potential\nmembers. Vfe suggest that you have similar covering letters sent to potential mem¬\nbers along with a copy of the membership blank. The covering letter should con¬\nsider many of the advantages of membership plus the objectives of AERT and should\nin effect be an '’invitation11 to join."
}