{
  "id": "d984-79",
  "text": "ASSOCIATION FOR EDUCATION BY RADIO-TELEVISION\nRECEIVtD\nOCT - 5 i956\nPRESIDENT’S\nOFFIC--\nOctober 1, 1956\nDear AERT Member:\nThe Board of Directors of the Association for Education by Radio-Television\nacting on a unanimous approval by the officers of AERT of a recommended plan\nfor the consolidation of AERT with the National Association of Educational\nBroadcasters, have approved the proposed plan and have directed that it be\nsubmitted to a meeting of members having voting rights at a special meeting\nto be held concurrently with the 1956 Annual Meeting of the National Association\nof Educational Broadcasters in Atlanta, Georgia,\nYour attendance is invited at this special meeting of AERT which will be\nheld at the Hotel Biltmore in Atlanta, Georgia, on October 16, 1956 at Us30\nofclock (P,M.). The purpose of the meeting is to discuss and vote on the\nfollowing proposal:\n'•That the Association for Education by Radio-Television consolidate\nwith the National Association of Educational Broadcasters,\"\nThe proposal for consolidation includes various conditions, which will\nbe discussed at the meeting in Atlanta,\nA summary of the plan for consolidation follows:\n5.\n6.\n7.\n8.\nAll members of AERT would become either affiliate or individual\nmembers of NAEB,\nDues already paid by members of the AERT would be honored with\nfull, credit through the terminal date of their membership and/or\nsubscription period.\nThe AERT JOURNAL would be continued, although the form and title\nmight be aitered to conform with the consolidation of AERT and NAEB,\nine utilization and evaluation day now known as AERT Day would be\nei^her at the annual sessions of the NAEB Convention or\nwith half a day at the annual NAEB Convention and a half or full\nday at future IERT meetings in Columbus. It is possible that a\nfall, and spring meeting might thus be arranged in diverse locations.\nT|?e presfnt membership of AERT would be represented on the Board\nof Directors of NAEB in a manner to be determined.\nThe NAEB would handle all administration of membership files,\nmembership promotion, billing, dues collection and distribution\nof publications from its headquarters,\nA Committee on Utilization would be appointed from the present\nmembership of AERT, F\nResearch projects in utilization would be inaugurated.\nyour AERT°n?fW^t+0n Pl“ «*glnated from (l) a desire on the part of\ntftEtlof!loers,t° P™0ect the purposes and function of AERT beyond the\non the nart t w • +preSent finan?ial resources, and (2) a realization\n. parf 7 NAEB ^hat as an organization, is in a position to strengthen\nthis important aspect of educational radio and television, S"
}