{
  "id": "d209-128",
  "text": "CHANNEL\nSTUDIOS—UNIVERSITY OF WASHINGTON\nTRANSMITTER—EDISON TECHNICAL SCHOOL\nKCTSfTV)\nCOMMUNITY TELEVISION SERVICE\nSEATTLE 5, WASHINGTON\nFebruary 7, 1955\nHarry J. Skornia SW T I 933\nlfcLgory Hall SUliaVnOOVIH J3VM\nUrbana, Ill.\nDear Harry:\nEd Adams turned over to me your note and the one from Mr. Novik\nmaking ^inquiry about the labor situation out here. I thought I\nwould answer you, and you can relay what information you wish^\non to Mr. Novik.\nWe have no labor agreements of any kmmd, have not been requested to\ndiscuss any, by any of the unions, nor do we contemplate having any.\nThe station is operated by the University of Washington, an integral\nunit of state government — there are no labor contracts between the\nUniversity and any unions.\nOuHf transmitter operation is maintained by students of Edison Technical\nSchool, a trade school operated by the Seattle Public School sustain. The\nstudents who stand watches on the transmitter all have 1st ’phone tickets,\nand do this work, as well as maintenance as part of their regular assigned\nclass work in the radio-TV trades d epartment. We normally operate on a\nMonday-thru-Friday schedule. 0n those non-school days (holidays) on which\nwe operate, we have decided to pay the Edison students $1.50 per hour.\nEdison students also perform regular maintenance work on our studio\nequipment on the same basis.\nUniversity of Washington students do our studio production work, such as\ncameraman, boom operator, control switcher, etc., as part of an under¬\ngraduate credit course.\nThe Seattle local of AFM has told us they are not concerned about live\nmusicians as long as they are instructors or students in one of the\nlocal schools, public, pri'vate or colleges who are participating in the\noperations. We cannot bring professionals from the outside without payment\nof union scale.\nWe have a BMI license at $1.00 per year, and an ASCAP license for free.\nBest regards.\nStone\nCCS Is I U\nB. St\nManajger\nUniversity of Washington Seattle Public Schools King County Schools Seattle University Seattle Pacific College Seattle Public Library"
}