{
  "id": "d209-158",
  "text": "MR. NOVIK\nLEST ANYONE THINK, from the title of this\npiece, that Labor is a newcomer to radio let the rec¬\nord show that Labor started using commercial radio\nmore than five years ago; and has been using the\nmedium consistently on a year-round basis since\nthen; and that Labor uses radio on a Monday\nthrough Friday schedule. More than that, Labor\nplans to continue using radio.\nFrom the commercial aspect, Labor in radio is a\ngood success story for the industry. For not only\nhas it been a consistent user but it has also increased\nits use of commercial time and can point to a num¬\nber of specific instances where broadcasting really\ndelivered the goods.\nAnd this despite the interesting point that what\nLabor has to sell is a way of life and not a piece\nof merchandise from a shelf.\nThe background on how and why Labor turned\nto radio goes back to the days of the NRA and the\nWagner Act during the depression. As a result of\nthat legislation the labor movement grew by leaps\nand bounds. This growth was so tremendous and\nthere were so many new members wanting to learn\nabout trade unions that no union hall, not even\nMadison Square Garden, was large enough to hold\nthe audience.\nFor example, one union, the International Ladies\nGarment Workers Union, had over 150,000 new\nmembers. So in February of 1934 I produced, for\nthe ILGWU, the first network labor program. It was\na weekly series titled The Union Assembly and its\nprimary function was educational.\nTo provide the sparkle that would carry the edu¬\ncational portions we used good music—actually, it\nwas the first time chamber music groups like the\nGordon String Quartet, the Compinsky Trio and\nLABOR TURNS\nTO RADIO\nMORE than 20 years ago—in February 1934—\nM. S. Novik produced labor’s first network radio\nprogram. His interest and close contact with the\nlabor movement continued through the following\ndecade when he was head of WNYC, New York’s\nmunicipal station, during the LaGuardia regime.\nSince leaving that post he has been active as a\nradio-tv consultant to various organizations, includ¬\ning many unions.\nthe Coolidge Quartet had been on radio—and show-\nbusiness names like Eddie Cantor, George Jessel,\nMorton Downey and Molly Picon. All this plus talks\nby newsworthy personalities like Mrs. Franklin D.\nRoosevelt, the then Secretary of Labor Frances Per¬\nkins, U. S. Senators Wagner and LaFollette, the then\ngovernors Lehman of New York and Pinchot of\nPennsylvania, and New York City’s Mayor Fiorello\nLaGuardia.\nThis was so effective, on the network level, that\nin May of 1934 when Local 89, the Italian Dress¬\nmakers Union of the ILGWU, found itself with\n40,000 new members in the Metropolitan New York\narea, this local union developed a similar program.\nLocal 89 started with a weekly hour on WEVD\nNew York in the Italian language, using operatic\nconcerts for entertainment and top names for the\ntalks. That Local 89 program which started over\n20 years ago is still on the air, using the same\nformat, and now has a regional hookup of stations\nalong the East Coast.\nSo, when in 1949 the American Federation of\nLabor considered the use of radio, the labor move¬\nment had a precedent.\nThe reasons for the AFL’s move to radio were no\nsecret. As the executive council of the AFL stated\nin its 1950 report to the Convention, “With the vast\nmajority of the press, radio and magazines still\nbitterly opposed to Labor’s objectives and still con¬\nducting what amounts to a deliberate campaign of\npropaganda against labor’s policies and activities, it\nbecomes increasingly important that Labor present\nits own side of the story to the public by whatever\nmeans possible.”\nAround the country, at that time, there were eight\nmillion AFL members in 30,000 locals. (Now there"
}