{
  "id": "d209-159",
  "text": "are 10 million.) A good newscast, on a national net¬\nwork, could reach our members and the general\npublic too. Our problem was to find a network, an\nexperienced and qualified newsman who could build\nan audience, and to do it all on a limited budget.\nOn Jan. 1, 1950, the AFL started a Monday-\nthrough-Friday quarter-hour newscast over 150 sta¬\ntions ot the Mutual Broadcasting System. To stay\nwithin the $750,000 budget we broadcast five times\na week in the 25 major markets, only thrice weekly\nin the other 125.\nin most areas we were no different than any other\nnational sponsor starting a big network program. We\nworried about the possible competition of the then\nnew medium of television; we fussed about our spot¬\nlight ad schedule, and we fretted about notifying our\nJU,000 locals around the country about the correct\ntime and day and station in their area.\nThere was one area where we differed and that\ndifference was mighty big: it was in the program\ncontent and the commercial treatment. From the\nvery beginning the AFL realized it had to be even\nmore circumspect than Caesar’s wife; the news on\nthis program had to be factual, impartial and com¬\nprehensive. The commercials had to be educational,\neffective and logical. There could be no vitriolic\nblasts, no bellicose hard sell, and the name of the\nsponsor must never be camouflaged.\nIt was quite an ice jam we had to break in those\ndays back in 1950, but the AFL succeeded. Not only\nhave we stayed with radio, but evidence of our\neffectiveness and vindication of our approach came\na year later, when in 1951, the CIO started its own\ndaily newscast on another network.\nToday, as most everyone knows, the AFL pre¬\nsents Edward P. Morgan, veteran newspaperman\nand newscaster who headed the CBS news desk for\nradio and tv before taking the AFL program, while\nthe CIO offers John W. Vandercook, another veteran\neditor and newscaster and ex-NBC commentator.\nBoth programs are Monday-through-Friday network\nfeatures and both newscasters have complete edi¬\ntorial freedom.\nAnother interesting note, and one unusual facet of\nthe commercial treatment, is that the plug does not\nbreak into the middle of the program. There’s a brief\nopening and less than a minute of commercial at\nthe very close of the newscast.\nOne direct result of the success of these network\nprograms by the AFL and the CIO is the use of\nradio by local labor groups on local stations in their\nown communities.\nSome of these unions sponsor football games,\nothers baseball, still others offer musical shows, and\nsome participate as co-op sponsors, in their home¬\ntowns, of Drew Pearson, Martin Agronsky, Quincy\nHowe, etc., while others underwrite local newscasts.\nAll of them do this consistently as a method of de¬\nveloping their identity in and with their communities.\nIn almost every instance, the commercials on these\nlocal programs are devoted to the needs of the com¬\nmunity. Thus one commercial may call for blood\ndonors for the blood bank and another may stress\nthe union participation in the community chest\ndrive.\nAs an example of the commercial treatment used\nby Labor, here is what the AFL did on the Edward\nP. Morgan program during the week of September 5\nthrough 9.\n“The upcoming merger of the AFL and CIO\nwill strengthen the campaign for better schools,\ndecent housing, good roads, etc.”\n“Despite the conference at the summit there\nis no assurance that Soviet Russia sincerely de¬\nsires to cooperate for peace. The free world must\ncontinue to maintain the strongest possible de¬\nfense program, etc.”\n“The merger of the AFL and CIO will result\nin a united American labor movement with 15\nmillion members standing solidly together for\nfreedom, democracy and human progress, and\nresisting with all its power any form of dic¬\ntatorship, including Communism.”\n“The AFL has succeeded over the years in\nwinning substantial advances in the American\nstandard of living. If you work for a living the\nAFL is working for you.”\nAnd here is the complete commercial for\nTuesday, Sept. 6, 1955:\n“Opening of the new school year underlines\nthe fact that our country has failed to come to\ngrips with its educational problems. The school\nshortage is more acute than ever. The lack of\nqualified teachers persists because standards\nhave not been raised to a point high enough to\nattract young people to this noble profession.\nThe AFL is convinced that this is one problem\nthat time alone will not solve. A coordinated\nprogram of action is required—at the Federal\nlevel along with community and State coopera¬\ntion. We have long advocated an effective pro¬\ngram of Federal aid to education and we be¬\nlieve Congress should make this its first order\nof business when it reconvenes in January. The\nchildren of our country are its greatest asset\nand we cannot ignore their acute educational\nneeds without imperiling our free way of life.”\nThese programs have been most effective. This\nwe know just as the national brand advertiser knows\nif his program is clicking. For the AFL’s equiva¬\nlent of the retailer is the 30,000 union meetings that\noccur each week all over the country. This consid¬\nerable grass roots sample soon lets “the home office”\nknow if it’s not pleased. And the rank and file like\nwhat we do and so do their neighbors and friends.\nIn the more than five and one-half years since the\nAFL started its network news program, labor has\nlearned a lot about the use of radio. In recent years\nit has been using the broadcast medium to meet\nspecific local and regional problems.\nThe United Auto Workers (UAW) created a re¬\ngional network to air daily reports on the status of\ncontract negotiations for the benefit of its members\nand their communities.\nThe Hatmakers Union used radio last year to get\nits side of a strike story across to its members and\ntheir neighbors."
}