{
  "id": "d209-20",
  "text": "Heeler is an old, personal friend and we spent a great deal of time together.\nI reviewed the Los Angeles and San Francisco situations. His key people are\nactive in both stations. He wanted to be educated on the whole problem because\nthe matter has come up at their boards and they are in the throes of determining\na policy. The matter may come up for consideration in the near future. I\nstressed the need for securing cooperation so that the first voice hired should\nnot be restricted but should be given permission to instruct students, to produce\nto direct, etc., etc. I think we can obtain this but there again each local\nwill have to decide. The only area that he was worried about is what would\nhappen if Los Angeles or San Franoisco were to use senior high-school or\nJunior college dramatic societies to put on Hamlet or Life with Father, etc.\nOf course. I advanced all of the WNYC arguments. He admits they are valid\nbut may be in immediate 4 direct conflict with actors who are seeking employment\non commercial stations. I do not think we have to worry about this because\nthe area of conflict will depend to a large degree on the area of close\nrelationship in each community.\nI didn't discuss the matter with Petrillo because I can always meet him in\nNew I0rk, and my WNYC pattern I am sure could be extended. In addition, the very\nfriendly relationship in Los Angeles will go a long way to help.\nTo sum up, I am glad I got into it and it is too bad this was not done six\nmonths ago when the Immediate problems like St. Louis would not be so urgent.\nX made it very clear that I wasn't involved in negotiation but that I wasn't\nsetting up contracts for the individual stations but trying to evolve a general\npolicy.\nBefore I enumerate the highlights of each area, I would like to tell you how\nencouraged I was by Bill Sener's complete grasp of the problem and his relation¬\nship with the key community people. Frankly, I don't think anybody knew the\nextent of his contacts and his relationship with these people.\nI don't think 1 ever met Jim Day before but I couldn't help but be thrilled at\nhis grasp of all of the problems and his concept of the role of the station\nin the community.\nHouston was a revelation. I spent three hours with John, and saw his set-up.\nI think I will be able to help him with the Mayor, who is an old friend and the\nformer president of the F. M. Association. He knows the area, he knows where\nhe is going and I think he will educate his superiors to the role of the station.\nI cannot help but feel that there should be more contact between our key\nguys and him and his station. Unless I have been taken for a ride, 1 am\nconvinced tha+ he will not be kicked around, and he will not allow the Station\nto be used :r any personal r sectional advantages.\nBill Woods, of course, is & trained, experienced guy. I got to talk to him only\nbecause when Dick called me in Houston about some problem which arose, he\ntold me that he was meeting with the Uhion people. I called him and made it\nclear that I was speaking as an old friend and that I hoped to get to Pittsburgh\nonly after I finished the other cities. As it was, I was able to help him\nwith some suggestions for his meeting, and received from him a very good\nreport on his IA negotiation which, by the way, X hope will help Dick in\nhis negotiations. f\nThat's it — and now for the individual cities ."
}