{
  "id": "d209-235",
  "text": "-2-\n\"Cincinnati - WCET-TV\nI have not been called upon for any help, I hope that the Station is in touch\nwith the many top labor people and labor organizations in their community,\n\"Birmingham - Station WEDM - TV\nHaven’t been called upon to be of any help. I am sure that Rudy Bretz will be\ncalling upon some of the labor people to help stimulate audience and community sup¬\nport. I will gladly assist in this connection when they want it.\n\"Cambridge - Station WGBH-TV\nHaven’t been called upon for any specific help. At the end of last year and a\nfew weeks ago, I discussed the problem at considerable length with Parker Wheatley.\nParker is aware of the interest of labor and has had a good working relationship\nwith some of the labor groups in the operation of the FM Station. I have urged upon\nhim the need to utilize the many organizations and labor channels for audience pro¬\nmotion.\n\"Chicago - Station WTTW - TV\nHave had one meeting and numerous telephone conversations, and more recently\nhave had discussions with Taylor and the 3BEW. I think I helped bring about a\ncloser understanding, which will afford a better relationship. It seems to me,\nas I have told them, that no time should be lost in getting the key labor people\nand organized labor channels involved in helping to promote the Station.. .especially\nto develop its audience.\n\"Detroit - Station WTVS\nHaven’t been called upon for any special help except planning, but understand\nthat sometime in the near future, a meeting will be set up. I understand they\nare anxious that I come in to help with some of the local groups in developing a\nbetter community support#\n\"Norman - Station KETA\nHaven’t been called upon for any special help, except that I have had corres¬\npondence with John Dunn about his general problems and he knows that he can count\non my help.\"\nBriefly supplementing Mr. Novik’s report with regard to other areas:\nChapel Hill - Station WUNC-TV\nNo troubles and no labor involvement, so far. An area in which the problem\nis yet to come. Meanwhile Mr, Schennkkan has been fearful lest what we do nation¬\nally would cause a problem to him. We hope our handling (i.e. Mr. Novik’s) of\nthe problem to date has reassured him, since though we have sought to get favor\nand preferences on a station-by-station basis for education, no \"national pattern\"\nhas been imposed."
}