{
  "id": "d209-27",
  "text": "i&g-Ansre-laa\nI had a long conversation with Bill. His advisory board of 21 is quite active.\nThey wanted Jin Haggerty, the state secretary to serve, but he designated Bill\nBassett. Haggerty is a member of the San Francisco board. Bassett has not\nbeen active but I promised to talk to him and discuss the need for his participation.\nBill has a good relationship with the key union people. H3s key staff people\nare instructors at the University and are, in most cases, members or officers\nof the unions involved. He has a fine relationship with all of the unions,\nespecially the Musicians. Gapt. Hancock has been a member of the Musicians’\nUnion for many, many years. He’s contemplating holding a conference with\nall of the unions involved. He accepted my suggestion that before he does\nthis, he discuss the agenda and problems with his key people.\nHe has an immediate transmitter problem. At present he operates his transmitter\non top of Mt. Wilson on a deal with John Poole. I think I helped him solve\nhis problem in this connection, which will also act as the basis for his IBEW\nrelationship in the future. As a general solution, he would like his union\npeople limited to transmitter, maintenance and control — in that order —\nand devote full time to the station. He will aim for a student and apprenticeship\nset-up. He made it very clear that the policy of the station is to be honest\nand fair to the unions, and to quote hims nW© aren’t interested in a wild-cat\noperation, nor will we go in for strike-breaking.\" At present eight or nine\ninstructors are running his shop. He agrees that he will fill his first\nannouncer’s post with an AFRA member. H© would like to arrange for that man\nnot to be restricted to announcing but that he be permitted to produce, direct,\ntrain apprentices and part-time students, etc. He is most interested in the\nstudy course phase.\nBill once helped with AFRA, ASCAP and EMI * He has had some minor difficulties\nwith I FEW but they have all been straighted out. As a non-commercial station he\nhas had some consideration from the Musician’s Union. He is hopeful that we can\nwork out something similar with the other craffcs. He was sure that what I was\ndoing on the national level would be of help with the local groups.\n§mS£*nclfios-\nI talked to Jim on the phone. In forty minutes I got a fast fun-down on his\npresent and future plans. He intends to utilize skilled professional help in\nhis key jobs, both programming and technically. He has a good working\nrelationship with IBEW and labor. The four instructors at the John O’Connor\ntrade school of the S. F. public school system are umbers of the unions. This\ntechnical training program is open to technicians with prior experience\nin electronios. His main studio will be located at the school and both unions\nhave agreed to augment his crew with apprentices from the school. He, of\ncourse, agreed with the suggestion that our stations operate on a student-\napprenticeship and craftsman base. His problem will be to get the consent\nof the unions to use John O’Connor school students outside of the building when\nhe has additional studios. Strange as it may seem, in S.F. his dealings have\nbeen with IEEW and not with the XA. He has had meetings and is in good standing\nwith the local AFRA people. He, too, is anxious that AFRA permit their people\nto do more than just announce."
}