{
  "id": "d209-31",
  "text": "*f__A\nMEMO QF TELEPHONE CONVERSATION WITH MORRIS NOVIK\nw\nTuesday January 19, 1954\nMorrie began ty pointing out the four areas with which he is first concerned,\nares\nThey\n1. Houston. He is going there next Monday to survey and discuss the\nsituation with John Schvarzvalder.\n2. Los Angeles. From Houston he is going to Los Angeles to talk\nwith Sener and study the situation there.\n3. It is likely that he will also go to San Francisco to talk to Jim Day.\nIn all of these cases, letters have gone to these stations\nfrom Steetle on behalf of JCET, which has had the budget and staff\nto be faster on its feet than the NAEB.\n4. St. Louis. This is a strong IBEW area. IATSE is the contesting\nparty, of course.\n5. Pittsburgh. Here Morrie knows Bill Wood, and feels that the\nsituation is likely to be solved without too much difficulty.\nAfter checking with Houston and Los Angeles, and possibly San Francisco, Morrie will\nprobably discuss this problem with top IBEW leadership in Miami within the next week\nor two,\n—/ what he is attempting to do is evolve a formula, as was done at WNYC, to recognize\nand set apart the special status of non-commercial television, just as was done in\nradio.\nMorrie feels that the greatest mistake made to date is failure to include labor\nrepresentation in the community committees organizing future non-commercial\ntelevision groups.\nHe feels that there is a serious RIGHTS problem as we all know. Here, however,\nI told him that we would have to coordinate our efforts carefully with the Center\nwhich has already been negotiating in this area.\nMorrie could also handle ASCAP relations, getting the same special status for\nnon-commercial television that has been achieved for non-commercial radio• In\nthis area too, we would want to be sure to coordinate with all interested groups,\nto be sure that someone else is not also attempting to handle these relations.\nHe is also willing to handle AFM relations. I felt, in talking with Morrie, he\nwould also be a good man to handle the possibility of securing the sort of blanket\narrangement with AFM that MEKC now has. This, I can explain more fully, if desired.\nOne of the great dangers, I feel, is that the Center has hired, to handle its rights\nand legal problems, a former commercial man (Kenneth L. Yourd). This, plus the\nknowledge everyone he negotiates with will have, that the Center has Ford money (which\nmeans a lot of money) certainly makes the Center a less good negotiator than the\n^ NAEB with its more easily recognized poverty. It is therefore not merely a dog in the"
}