{
  "id": "d209-33",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF EXECUTIVE DIRECTOR\nUNIVERSITY OF ILLINOIS\n119 GREGORY HALL\nURBANA, ILLINOIS\nn. s. 1*0vik\nJiadlo Consultant\n300 West 23rd Street. Hoorn 500. Hew York 11, K.Y. Algonquin 5-A3B5\nHovember 20th, 1953\nMr. Harry J. ikomia\nExecutive Director, KAKB\nUniversity of Illinois\n119 Gregory Hall\nUrbans, Ill.\ntmOOliAL\nDear Harry:\nMy main objection which I admit 1 u not a valid one la unwilling: •\nness to start to talcs money from the HaBB; and If I do, it certainly doe®\nnot have to be In the f-100 a day class. 1 have been working: on that base\nlevel but that doen't mmn that the HAEB should pay that much.\nI think 1 can help in the areas you suggest. 2 feel confident that 1 can\nhelp work out u fair arrangement with the labor unions involved.\nBut here is one thing which you might do immediately, i notice in the\nit. Souls October 20th letter, reference is made to the fact that Overton\nhad checked into the matter of a national agreement with the musicians*\nUnion. Whet he® he done? Has he had any direct contact with i etriilo\nUnless he has a very close personal relationship , X know that X can present\nour objectives in a mre favorable light. Please understand that I •*aintw\ntrying to break down or minimi&e Mr. Overton.\nWhat has been done with the Engineers* pacifically, Bt* Louis is 10-*\nterritory**-- have they contacted the X1HTW? There X know X would have\nmore than a sympathetic reception from Mr* Tracy, the president.\nHow about AFSUt\nActually, it seems that other than the general basic policy, each city\nhas different problem and undoubtedly will require a different approach.\nIn most cases, X would either know the head of the local central body or\nthe utate president, or get to them via Mr. Heany who is very much inheres*\nted in the development of educational radio. You remember he appeared\nbefore the FCC at the hearing*.\nSincerely yours,\np.S. Have you discussed this whole matter with sick* HaMHBber, we\ntalked about it at lunch at the UHESCO meeting*"
}