{
  "id": "d209-37",
  "text": "ST. -LOUIS EDUCATIONAL TEIE7ISIGN COMMISSI®\nCHAI0EL isms\n303 B06RD <p education bldg. 911 locust st.\nST. LOUIS X, MISSOURI CEntral 6085\nCHANNEL NINE STUDIOS\nWASHIH3T® UNIVERS3TX •\nSt. Louis 5* Mo.\nVOLunteer >6722\nOctober 20* XS53\nMr. Harry J. Skcraia* Esscutiv© Director\nNational Association of Educational Broadcasters\nUniversity of Illinois\n1X9 Gregory Hall Urbara* Ulinois\nDear Mr. Skornias\nWe have several questions hero at KETC for tdrich m would like your\nanswers based upon past X.A.S.B. eaparienc© in radio as well as television.\nIn setting up our operating and capital investment budgets* ue ware\ndiscussing the matter a’ snscrtlssfciaa and depreciation of capital equipment.\nOar accountants inform as that the general practice in non-profit educational\ninstitutions is not to depreciate equipment. Is this a standard procedure\nin educational radio stations around the country? In the cost figures that\nhave been submitted to you by educational institutions producing programs under\nan N.A.E.B. grant* haft depreciation been included?\nThe ttnacfc item is that of musicians9 unions. **»f» there\never been any agreement made on a national seals with unions in either of these\ncategories? I am were specifically concerned with the engineering unions be¬\ncause it poses a more immediate and continuing problem© La the September meet**\ning at Ann Arbor of the Program Center* the station managers who were in\nattendance all indicated that they did not plan to have any contract or work*\ning agreement with engineering unions but intended to have a completely non¬\nunion engineering staff. This is mere agreeably achieved in the small\ncommunities than in the larger cities like St. Louis where even the Board of\nEducation FM Station has been unionised. George Overton* legal attorney for\nthe Center* has* I believe* been cheeking into the matter of the rational\nagreement with the musicians9 unions* but I have heard nothing further about this.\nCan the N.A.S.B. furnish me with any information regarding libel and slander\nprecedents pertinent to educational broadcasting? Our insurance counselor is\nrecommending that we have some coverage in this lira but before we decide I felt\n1 would like to investigate the matter further with N.A.E.3o In a commercial\nsituation 1 know that stations generally cover themselves with insurance* bub\nI am wondering: about the necessity far educational stations to do so."
}