{
  "id": "d209-49",
  "text": "-f* <^L\nMarch 31, 1954\nMr. G. H. Orimthe\nFund for Adult Education\n1444 Wentworth Awns\n-Pasadena 5, California\nDear Mr. Griffith® s\nSunoarlsing ita earlier requests, on this matter, and providing the\nadditional information requested in your letter of March 26, the\nnational Association of Educational Broadcasters hereby requests the\nsun of fifteen thousand dollars (415,000.00) for the operation of a\nunion relations consultation service for all Aswrioan educational television\nand radio stations for a period of three years, with immediate emphasis on\ntelevision. It is expected that only a small proportion, if acy, of the\nefforts of this consultant would be devoted to radio, as the situation now\nstands.\nNumerous requests have been received by the RAEB for help and advice on\nlabor end union relations free now eduoatlonal television stations om,\ngroups planning such stations. In view of the growing msabor of such odu*\ncations! television stations it is felt that the services of a qualified\nconsultant are needed in this area. The IIAEB is looted to go the service\norganisation of educational television and radio broadcaoters. Therefore,\nthis proposed service is a natural one for the NAIB to undertake.\nA copy of this request is being sent to Dr. harry Newton of the Eduoatlonal\nTelevision and Radio Center, to insure adequate coordination of efforts in\nthis area. In recent discussions with Mr. Kenneth Yourd, of the Center's\nstaff, it was our specific understanding that the Center would not under*\ntaka this general service* but would like to be included in all ouch dis¬\ncussions, and would of course need to have a voice in all decisions, in\nview of the need for clearances to facilitate program ©aschiange. Mr. Ralph\nStootle, of the X£% has also indicated readiness to have the NAEB take\nover this service, finding it the natural and obvious province of the HAE8.\nThe same is true for the NCGET, with which these areas of jurisdiction were\nearlier discussed.\nMr. Morris Novik, New York Consultant, for many years an MASS Officer and\nlong associated with the NAEB, has already been contacted and has agreed to\naerve as consultant. As agreed in discussions with representatives of the\nFAE and the Cento, one of Mr. Novik's first functions will be to hold a\nconference with appropriate representatives from the Cento, the JCET, to"
}