{
  "id": "d209-7",
  "text": "2JUL1\nDecember 14, 1953.\nMr. Morris S. Novik,\n300 Meat 23 St.,\nNew York 11, N.Y.\nDear Mbrrie*\nAs per ycosr request I am sending along to you the gist of last\nFriday1 s meeting with the Business Manager of IBEW Local 1217, Radio Broad¬\ncast Engineers.\nHe is asking that all people hired in technical capacities (the\nusual jobs covered by IBEW and MEET in TV stations) become IBEW members,\nwith full OQEsserdaX rates of pay. We have six such technicians on staff now\n(the Chief Engineer is exclusive of this), all with varying backgrounds and\nvarying amount of experience.\nIn addition to this he is asking that we give the union a blanket\nagreement by which we recognize its jurisdiction over all other job classifi¬\ncations (outside of office workers and creative staff, I assume), such as\nfilm editors, stage hands, costume, etc. The union’s predication of this in¬\nclusive kind of agreement is on the basis of protecting the station from union\njurisdictional disputes which IBEW says would be the case if we didn’t have a\nblanket agreement with them. Such a blanket agreement would, they say, keep\nother unions out. IBEW is frank in admitting that it would keep other unions\nout for them too.\nThe IBEW Business Manager says he has already been in contact with\nour technical staff and they have indicated their willingness to join IBEW,\nobviously in the hope that we will sign with the union on their terns, which\nwill materially increase each man’s salary. Our budget is not predicated on\npaying ccemaereial TV rates for anyone at the station. This is a non-profit,\neducational organization and m cannot be evaluated on the basis of what are\ngoing rates for a ecmmarei&L, profit-making organisation. In addition to our\nfull-time engineering staff we intend to use students on a part-time basis,\nsome possibly under course credit arrangements at St. Louis University and\nWashington University, and some paid on an hourly basis.\nIBEW has no objection to our us-lug students (and they could handle\nand use all the gear on shows), but they had thought that we would be using\nonly students on a course basis. This is not as practical for us as it is for\nstations owned by universities. We cannot integrate our operations as easily\nwith academic departments as a university-owned station could, for obvious\nreasons.\nFrankly, the thing that disturbs me is that some months ago three\nmembers of our Gassnission went to see Jacobs, the head of the IBEW in town.\nHe said he wanted to have just 2 or 3 of his men on our staff. When I met"
}