{
  "id": "d209-72",
  "text": "Hr. Gray&on Axasma\nRadio Station WW&\nBos 2002\nUniversity of Alabama\nUniversity, Alabama\nDear Graydom\nKenneth Ycurd Just celled (from 3TRC) regarding the need to get on\nwith the mien probXe®, not with relation to station staffs, hut with relation\nto rights on kinescopes which the STRG had hoped to ©asehangc. Tmy ore fre¬\nquently prevented from carrying out this distribution by the type of labor\narrangement agreed to In and for t!ie original production* If coaasKsrolel fees\n&r© to be applied (i.s. if no cpocial status war® eacured for ETV) fees will\nb® sod®times ruinously high at a precedent-making tine*\nFealing that they should not tmiXatsrally ps^oeed, he asked ©bout\nthe earlier-discussed saseting with Novik. Whan I suggested ay checking with\nthe Board h© pointed out h© was afraid there wore a couple of cases which\ncouXtin’t wait that long. 1 then suggested that he talk to Morris iovik by\nphone to savo time. If they together th*» tml a meeting essential, they can\ntogether plan agenda and proposals for It, end flovtk can call it, subject to\nay ©hacking with the Board ac 2 now herewith do* Although I h&v© not dismissed\nthis n93st thought with either Yourd or NcvtJr, I personally fed that\nnegotiations, once decided should m£ must probably than obviously b©\nhandled by Yourd for the E?MS, rather than Hovik for the HAEB. This is not\na gtatidwyelatioPiB case, in other words. However, it will, affect ©11 ETBC\noontraetees, all SW stations (who are also all HASS mashers), and whether\nthe hoped-for Center-distribution system will weark or not.\nI therefore hereby request Board reaction to Hovtk* © serving in\nthis oas© m approved ETRC Baquast, as visualised md deaerlb&d in the FAE\nRequest, whenever Novik, with Ycurd, easy deoid© it is necessary, with whatever\npersona era felt to bs involved, I do not fml that XET and HCGST are\ndirectly involved at this stag®, although Ho vile3 s and Yourd’s opinion on this\nwill be fipproolatsd end should fe© taken into account*\nAs this is written I9® awaiting word from Novik and/or Yourd as to\nwhat they reooasBcnd."
}