{
  "id": "d209-92",
  "text": "-\nHay 27, 1954\nHr- Graydon Aussmc\nBedi© Station V/TJCA\nBex 2002\nUniversity of Alabama\nUniversity, Alabama\nDear Graydont\nKenneth Yourd just called [frm STEC) regarding the need to get ca\nwith th® union problem, not with relation to statical staffs, but with relation\nto rights an kinescopes which the £©G had hoped to exchange, they are fre¬\nquently prevented from carrying out this distribution by the type of labor\narrangement agreed to in and for .the original production. If cosiosrolal fees\narc to be applied (1,©. if no special status were secured for ETY) fee® will\nbe sees®times ruinously high at a precedent-making time.\nFsaling that they should not unllatserally proceed, he asked about\nthe ©arlier-discusssd raeetihg with Novik. When 2 suggested say checking with\nthe Board he pointed out ha was afraid there were a couple of cases which\ncoulcnH wait that long. 2 thm suggested that he tall: to Morris Nevik by\nphone to save time. If they together then feel a meeting essential, they can\ntogether plan agenda end proposals for it, and Novik can call it, subject to\nny checking with the Board as 1 now herewith do0 Although I have not disousoed\nthis next thought with cdther Yearn? or Hovik, I personally feel that Jfc<gj&g.\nnegotiations, once decided on, should and must probably thm obviously be\nhy Yourd for the EXBG, rather then Novik for the NAEB. This is not\na station-relations ease, in other words. However, it will affoot all EXEC\ncontracts a* all KT? statics (who are also all NAEB ambers), and whether\nthe hoped-for Center-distribution system will work or not.\nI therefor© hereby request Board ruction to ffovik-1 g,L&®rvtag in\nthis case m approved ETRC Bequest, as visualised and descHtSdln the PAE\nBequest, whenever Novik, with Yourd, my decide it is necessary, with whatever\nperson® are felt to be involved, I do not feel that XET and ROOT are\ndirectly involved at this stag®, although Novik1 • and Yourd1® opinion on this\nwill b© appreciated and should b© taken into account.\nAs this is written X‘J® avail ting word trm Novik and/or Yourd as to\nwhat they recommend *"
}