{
  "id": "d1551-13",
  "text": "-13-\nTHS USE OF APERTURE CORRECTION IN LIVE BROADCASTING AND KINESCOPE RECORDING\nby Keith K. Ketcham\nChief Engineer, WOI-AM-FM-TV\nRecently we have had inquiries as to the feasibility and the use of aperture cor¬\nrection in kinescope recording. Aperture correction or aperture equalization is\nneeded in television systems because of the finite size of the scanning spot in\neither the television camera or the reproducing kinescope. Generally, an over¬\nsize scanning spot results in loss of picture detail. With the lack of detail\ncaused by a large scanning spot, there is associated an equivalent filter char¬\nacteristic that describes this loss. Theoretically, we can design an equalizer to\ncorrect for this filter loss. Practically speaking, the amount of allowable\nequalization depends on the noise threshold, since enhancing the gain to make up\nfor loss of higher frequencies also enhances the noise. Usually, a scanning spot\nhas circular symmetry. This means that the equivalent filter characteristic is\none that has linear phase. If the amplitude equalizer is not to cause phase dis¬\ntortion, then it must have linear phase (constant delay) at all frequencies.\nThe aperture corrector may readily be used for \"crispening,n that is, for the kind\nof over-emphasis of the high frequencies which improve the subjective sharpness\nof some types of pictures. In experiments performed here at WOI-TV, we have found\nthat, as an example, a live camera shot of a subject with a complex background,\nsuch as a bare winter tree, or other fine detailed type background, the use of the\naperture corrector would cause the individual limbs on the tree to \"crispen\" and\nstand out in sharp relief. Whereas, without the aperture corrector, they appear\nto be out of focus due to normal depth of focus problems inherent with lens systems.\nIn other types of pictures, which show the effect of the aperture corrector very\nmarkedly, the subject vore a black and white striped tie. Through the use of the\naperture corrector, the tie, itself, was made to stand out like a \"barber pole\"5\nwhereas, it had more or less a soft appearance without the use of the aperture\ncorrector. One other situation, which points out the need for and the good use\nof an aperture corrector, was evident upon doing a remote broadcast. One case in\nparticular concerned the pickup of a basketball game, in which the camera was unable\nto obtain the medium close-up shots that the director wanted. Without aperture\ncorrection, the figures on the shirts of the players were quite small, and, as a\nmatter of fact illegible, but, through the use of the aperture correction, these\nfigures were plainly legible on the control monitors and the final air picture.\nWhen using the aperture corrector for kinescope recording, it is adjusted to give the\nmaximum increase in sharpness or apparent sharpness commensurate with the appropri¬\nate signal to noise ratio. The instrument, itself, is inserted between the studio\ncameras and the input of the kinescope recorder. In our particular case here at\nWOI-TV, we found that it was very undesirable to attempt any type of aperture cor¬\nrection on pictures which were obtained from an iconoscope film chain. The reason\nfor this is quite obvious, and that is the iconoscope, itself, is extremely noisy.\nThose stations using vidicon pickups for film will find that the aperture cor¬\nrector, itself, can be used to great advantage. The flying spot scanner type film\npickup, of course, is a \"natural\" for the use of an aperture corrector."
}