{
  "id": "d1551-3",
  "text": "-3-\nThey also point to the new DuMont Electronicam system and the growing use of multiple\nfilm camera systems using television techniques to cut cost and time in production of\nfilm programs. Only time can tell which of these systems will ultimately win out.\nFor the complete story we refer you to the November 14 issue of Broadcasting-Tele-\ncasting magazine.\n**********\nMany of our readers wonder why we do not include a ’’Swap Shop” column. We’d like to\nrun such a column, but as you no doubt know, many educational institutions, espe¬\ncially those tax supported, have problems when they try to sell or swap equipment.\nFor those interested in used FM transmitters, two used 3 kw FM transmitters are ad¬\nvertised in the October 31 issue of Broadcasting-Telecasting and there is another\n3 kw FM transmitter listed in the November 14 issue.\nWithin the past week we received a list of equipment from the Gates Radio Company of\nQuincy, Illinois—an inventory close-out of broadcasting, recording, and test equip¬\nment, plus tubes and parts. If you are interested, I’d suggest you write directly to\nthem for the list. The prices look right, if they have items you can use.\n**********\nIssue No. 4 of the NAEB Engineering Newsletter should be in the mail soon.. In addi¬\ntion to material published previously in the regular NAEB Newsletter, it will contain\ntwo articles by Berten A. Holmberg, ’’Target Blanking Problems in Image Orthicon\nCameras,” and ’’Classifying 16 mm Emulsion Positions and Film Winds,” and one by\nKeith K. Ketcham, ’’Data on Eastman 7374 Negative Film Stock”.\n**********\nA new 226 page microwave manual, ’’Point to Point Radio Relay Systems—44 me to\n13,000 me,” originally prepared for the Air Force, is being offered commercially for\n$2.00 by the RCA Government Service Department, Camden, New Jersey. This manual\ncovers propagation, interference, etc. and includes charts, curves and monograms.\n**********\nIf you contemplate making Proof of Performance Measurements on your television trans¬\nmitter, we have a limited supply of a paper by Alex C, Latker of the General Electric\nCompany, which we believe will be helpful to you. It was presented at the 1955 NARTB\nBroadcast Engineering Conference, and is titled ”A Discussion of Techniques for Mak¬\ning VHF Proof of Performance Measurements.” Since our supply is so limited, we shall\nhave to restrict requests for this paper to those who are chief engineers of oper¬\nating television stations. Others may be able to obtain a copy from their General\nElectric Sales Representative.\n**********\nThis space could have been used to list ’’equipment for sale” or ’’equipment wanted,”\nSince we have nothing to list under either of these classifications it provides us\nwith the opportunity to wish all of our readers\nMERRY CHRISTMAS I Best Wishes for the New Year!"
}