{
  "id": "d272-125",
  "text": "November 20th, 1951\nMr. Jim Miles\nExecutive Director\nNAEB Tape Network\n119 Gregory Hall\nUniversity of Illinois\nUrbana, Illinois\nDear Jims\nI was delighted to see your letter of November 14th,\nas well as the NAEB Policy letter #5*\nBefore going any further, let me congratulate you on\nthe latter. It is a swell Idea, and I hope that the circulation is\nexpanded*\nInsofar as your November 14th epistle is concerned, I\nhope I have never given you the idea that neither you nor Frank should\nnot spend Thanksgiving with your families . I merely feel rather\nstrongly that it will take more than 24 or 56 hours with Hull, and\nwith Griffith’s oM gal to absorb the results of years of operation\nby the old guy©\nOne of our great difficulties at all times is the\nnecessity of rushing through a meeting because of lack of time.\nMcybe you and Frank are able to absorb at a faster rate than the\nrest of us poor mortals. However, both of you are sufficiently\neware of the importance of learning everything possible about the\nfinancial set-up, the membership situation, etc. I rely entirely\non your own judgment*\nThe December 4th meeting in Washington, in connection\nwith the unveiling of the monitoring studies, has been tentatively\ncancelled. Basically, this is due to lack of funds.\n' I would love to be able to come to the School Broadcast\nConference, but I fear there is neither time nor money available. The\nschool situation is an extremely important one for NAEB. The problem\nof providing Network service to school stations must be tackled without\ndelay» A glance at our membership list will show the tremendous\nproportion of school operations as compared with colleges and universities.\nUnless we can provide school stations with the service they desire, I\ndo not see how we are going to be able to c<£\" Wet any Network service fee®\nI have been receiving letters from all over the country concerning this\nlack of emphasis on our part. ’Whether we like it or not, this is a number\none problem, vtiich must be solved, and which I look to you and Alvin Gaines\nJim Macandrew, et al, to get solved.\n(more)"
}