{
  "id": "d272-127",
  "text": "- wmsfoox a*-\nAs you kaowfi we hair® tentatively made arrangements\nto tape the proceedings for release over the HA SB Network® We must\ndo mo re, however, to let the assembled delegates know about the\nexistence of NASB,\nI believe it advantageous for the Sewe-Letter to\ncontinue to be published by Paulu, pending a further discussion by\nthe Board of Directors,, If you do not have regular funds for thlB\npublication, I presume that in accordance with your statement at\nBilgxi, Kellogg ftmda can be made available*\n/ Insofar as your suggestion about a Committee on\nCommittees is concerned, perhaps it is not very clear in my own\nmind* if you are thinking about a Planning Comalttee to decide\nabout a program for the equivalent of an Allerton House Seminar,\nI think the people you named are good suggestions* I would include,\nhowever, more school people, and I think before we take any action\nat all as to naming such a Committee, with you as Chairman, that the\nfghole matter be thrashed out and discussed by the entire Board of\nDirectors*\n/ My congratulations on the affidavit plan concerning\ntape network material. This is an excellent idea. Insofar as the\nquantity of tape is concerned I can see no objection to your\nencumbering next year*s budget, if necessary. Certainly the Net¬\nwork must continue to function, and by next year there will undoubtedly\nbe funds available from the contributions of individual member stations*\nSpeaking about service fees, there is a serious doubt\nin my <xm mind as to whether or not a two -bund red~do liar fee could be\njustified in the case of WC*\nIn all of the packets we have received, or which we are\nnow projecting, there is only one series of programs in which we have\nany interest at all, and that is \"Stories and Stuff\"* Koat of the other\nofferings have already been on this station, or originate with us.\nObviously, I feel very strongly about our setting the proper sort of\nexample, but unless some additional compensating factor enters the\npicture, I shall be caught between two fires.\nPerhaps this is enough to write in one letter, but it\nexpresses some ideas which might serve as a point of departure.\n(more)"
}