{
  "id": "d272-140",
  "text": "December 2lot, 1951\nMr. Richard Rider\nITAEB Tape Network\n119 Gregory Hall\nUniversity of Illinois\nUrbane, Illinois\nDear Dicki\nI hashsn to acknowledge your letter of December 17th»\nI need not point out at the outset that many of tfoo problems\nyou pose are dependent for ensrrers cm a question of policy,\naa well as procedure. I am writing this letter to you only\nbecause your note presents an opportunity to say things which\nmany of us believe need saying* Please do not take anything\nin a personal light. Dhen I use the ward \"you”, it moans the\nsecond person plural1\nI start off by breaking an egg because I hope to create\na good omelet. I differ very strongly with the present mihod\nof program distribution by -~~-\nTho present package method, which was instituted sox® months\nago, was to be, as I understood it, a temporary stop-»gap« It\nconsiderably lowered the paper work, I presume, and xaade it a\ncomparatively easy job to distribute progress. It ms put into\neffect, I understood, on a temporary basis, until such time as more\npersonnel and duplicating equipment became available. How it begins\nto appear that due to inertia, or perhaps due to terminal conditions\nstill prevailing at Headquarters, the present method is frozen. Has\nthere been a change in the original plan, or does the freeze applv\nvO our thinking as well as the actual operation?\nProgramming the Network is like programming an individual\nstation.* If vm are oing to depend on the philosophy of utilising\nthe equivalent of a transcription service, instead of a flexible-\nmobile, timoly, newsworthy approach ... if w© are going to forget\nthat xm are channels of communicatioa in a democracy, with the\nnecessity of keeping our people informed ... if we are going to\nforgot the broad community objectives which make a station more\nthan Just a transmitter and a tower ... I say again ... if m are\nreally vegetating ... I do not believe that w© are doing more then\n60y of the Job that should be done*"
}