{
  "id": "d272-151",
  "text": "I haven’t any idea whether such is the case in the present\nseries. My own personal reaction would be much the same as\nyours. My working opinion, however, remains thesame. I think\nthe program should be considered by the duly appointed program\ncommittee before it is offered.\nIndeed we have offered the UN and UNESCO programs. I’m not\ncertain they are quite in the same class as governmental\nadministrative agencies. However, they may well present the\nsame problem^ in the future. I also think the board and the\ncommittee should consider this type of program and how it\nshould fit into the future network picture.\nI am not against programs on subjects that can be\nconsidered controversial. Far from it! It is only that I\nthink some democratic process should exist in the organization\nto decide such issues, to insure that the association is\nplaced in any given position with its eyes open and not\nbecause of personal beliefs or whims of mine, not? Jim’s, nor,\nindeed, yours.\n3. The Los Angeles County Museum Concerts. Talk about\nliaison! It is my firm belief that Morton Levine, Bill Sener,\na»d J. Caesar Petrillo have no business whatsoever soliciting\nthe network stations in an effort to promote their program!\nWhich points up a very serious organizational problem which I\nshould like to discuss later.\nOn the previous L.A. series, nine stations accepted it,\nat least one of which dropped it before it was half over. I\nhave nothing against the Los Angeles Museum nor against any\nofathe musicians in that area. If we can fcsfc get some information\non the series, if they are decently recorded, and if enough\nof them are done to guarantee a flow of programs I am all for\nputting it before the program committee. Now here is case,\nwhere some committee recommendation should decide which of\nseveral music programs should be offered. We can’t offer them\nall, so who is to decide? In this particular case the\nmechanics of the thing would have to be straightened out before\nit could even be considered.\n4. Network facilities. We may have been wrong in deciding\nto have the U of Illinois Recording Service do our duplicating.\nHowever, both Jim and I, working closely at the scene, felt\nthat it was the only possible solution. We did think about the\nproblem rather extensively. I don’t know of any better way to\narrive at such answers.\nIf we hadn’t followed this course we wouldn’t be doing\nmuch duplicating. We have not yet had the equipment and the\npersonnel to do this job. On the pooled basis currently in\noperation we get the best possible service at the iacaxjE lowest\npossible cost. I am of the opinion that in the long run some\nsimilar xxxxkx system will be the answer. As long as trained\noperating and maintenance personnel already exist, and can\ndevote as much time as we require to our work I see no reason\nto hire and attempt to train new people. We have received\nnothing but wholehearted cooperation and service. Experience"
}