{
  "id": "d272-154",
  "text": "policies (including programming), its organizational position,\nand its operation. Further, that this body establish\nspecific policies in these mgtiitilTP ~ * trr? «\nb. That the network office undertake to publish a\ndittoed report, similar to the executive director’s policy\nletters, at periodic intervals for the purpose of fully\ninforming members of the board and other interested individuals\non all network developments.\nc. That the problem of program acceptance be given\nimmediate attention and that a decision be made on precisely\nwho shall have the final power to approve and/or reject\nprograms.\nd. That all final arrangements for programs and all\ncommittments of the network’s facilities be made through this\noffice. Further, that before negotiations have advanced to\nthe final stage all potential sources of programs be put in\ntouch with this office to coordinate details before the\nfinal product is prepared.\ne. That all gifts, contributions, etc. made to the\nnetwork be handled through this office. The financial\nstructure within the University’s business office provides\ntwo funds allowing for a good deal of flexibility. At the\nsame time it makes all accounts a matter of public record\n*€(ncfr efficient accounting. It seems clear that central financial\ncontrol is the only sound business practice.\nf. That Seymour Siegel and Jim Miles get together and\nestablish a sound and practical relationship between WNYC and\nthe network. That it be clarified what is obtained for the\nnetwork, and what for the station. That a policy be\nestablished whereby the network could pay the recording costs\non certain programs desired—where they are acquired primarily\nfor the network.\nIt is obvious that New York will always be a source of\nmany programs. It is equally obvious that WNYC is the natural\nobtainer of these programs. Therefore, a practical arrangement\nwhereby the network gets these programs on a basis other than\nat the convenience of WNYC seems mandatory.\nNone of this is intended to disparage the enormous\ncontributions of WNYC to the network. I know that we here\nand all the stations as well feel the deepest gratitude for\nthe many fine programs supplied the network by the New York\nstation. It is purely the mechanics of the process which\nseem to me to be on axis an unorganized, helter-skelter basis.\nI assume we can expect some programs of WNYC origin on the\nsame basis that we receive them from other stations. It is\nnot fair to expect this station to bear added costs and\ntroubles to get things for the network in volume far in excess\nof the load expected from other stations. On the other\nhand it does not seem wise to be without an organized\nunderstanding as to how this process should work."
}