{
  "id": "d272-51",
  "text": "■7-\nS>. Ideas far Television Programs\nMuch emphasis has been placed upon the obtaining of licenses and\nallocationso When can we start planning outstanding programs?\nWCAL\nMilford Jensen\nlo Could NAEB provide some type of program evaluation service? As we\nsee it, stations tend to become ingrown. Upper management remains soraewhat static\n(I have been at WCAL for 2£ years). Maybe the local station*s approach to a\nprogramming problem is right; maybe it isn*t. As for example, every station has\ncertain local conditions which it must satisfyo Each station has an institution\nbehind it which has certain aims and objectives. Does the station aid in reaching\nthese aims and objectives? Does the station meet its obligations in the community?\nCould there be some type of agency which would evaluate the aims and objectives\nof the station and score the station an its efforts to meet these aims?\n2o Many stations have program schedules which have developed over a\nperiod of many years and now are somewhat set by tradition WCAL is a good example.\nIs the WCAL programming effective programming? Are we programming in a manner\nwhich will hold and attract listeners? Are we offering sufficient variety? Where\ncan we turn for an answer to the question? NAEB should be able to provide it.\n3° WCAL is seriously considering television. Maybe we have enough\nmoney to support television; maybe we don't. Who knows how much money is needed\nto carry on television station operation in a minimum, manner? What outside source\nof program material would be available to the station? NAEB should be able to\nprovide these answers. What are the possibilities, the hazards to be watched, the\npossible complications and advantages in associating with a commercial TV station\nand supplying programs on a regular basis, either from campus studios or from the\nstudios of the station?\nko What are the advantages and disadvantages of regional meetings of\nthe membership of NAEB? How can regional meetings be instituted? How frequent\nshould regional meetings be held? Are the regions of the NAEB geographically con¬\nducive to regional meetings? Someone ought to study this.\nX -5RB*\nWVSH\nM. McCabe Day\nWhat opportunities might the NAEB tape network open if universities\ndeveloped a real ’’classroom of the airf* type of program, in which listeners might\nenroll, and possibly follow a course outline, with an examination and even materials\nsent in for some sort of credit recognition? This may be a brainstorm, but it\nseems to me that there are possibilities in this concept of adult education. For"
}