{
  "id": "d272-52",
  "text": "-8-\ninstance, the BBC World Theatre tapes surely could be utilized for some sort of\n’’appreciation of radio drama” course* \"Masterworks Story” and “Music for the\nConnoisseur” offer opportunities for the development of music appreciation* Pos¬\nsibly one could hardly expect to teach typewriting by radio (that’s meant to be\nsomewhat facetiois), but there surely are some things that could be fostered* Un¬\ndoubtedly the idea has been bandied about before, but one difference now is that\nthe NAEB tape network, through such stations as ours, offers the spread of such\nprogram material into the \"hinterlands\" hitherto not always within reach of educa¬\ntional stations, as well as the duplication of offering, which is bound to reach\nmore prospects*\n-JBK-\nWABE\nAlvin Mo Gaines\n1* Shouldn’t your proposal number 9 (an Allerton type seminar for Public\nSchool People) be pushed up in order of importance to replace number 3? Two\nthings are constantly reiterated throughout the Kellogg proposals, viz: (a)\nservice to rural areas, (b) in-school broadcasting * I am in hearty agreement with\nthe Kellogg emphasise After tSe in-school meeting at Biloxi it was evident that\nsuch a seminar for in-school people was of primary importance* Let’s not kid our¬\nselves, are the school stations going to be NAEB step children or not?\n2. A study of the exact part school stations can play in NAEB? (Their\nduties, responsibilities.) School stations haven’t played their proper part. I\ndon’t think we have lived up to our responsibilities in the organization and in\nthe field* Some such positioning might come out in the proposed seminar*\n3» Shouldn't the program relations between University \"Schools of the\nAir\" and school stations be studied to find out-where they can be of mutual assist¬\nance, etc.?\nUo lour proposal $ (evaluation of school programs) by all means*\nMiles’ suggestions\n1. Irving Merrill’s paper on political broadcasts impresses me as point¬\ning to a fertile field for policy determination* One, which if Irv interprets\ncorrectly, NAEB as an organisation-and its members individually had better do\nsomething about*\n2* Political or propaganda efforts of radio stations* This needs some\nhigh sounding title to hide behind — but is vital if we are to keep all of our\nstations going up the hill* Basically \"How to get along with other people — in\nthe radio-academic life?\" Certainly some good practical political theory could be\nused here*\n3® Value of Promotion* We need some practical suggestions here a\nfurther translating of Sandages’ report — documented with some applied lessens\non printed material -» and radio salesmanship*"
}