{
  "id": "d272-88",
  "text": "Preliminary Survey of Programs\nSeptember 1991 Offerings NA3SB Tape Network\nJuly 12, 1991\nIt is proposed that the NAEB tape network begin an extended operation toy\noffering a minimum of five hours of programming weekly starting the week of\nSeptember 16, 1991*\nSince it is apparent that it is going to take some little time to obtain the\nmass duplicating equipment, it will be necessary to use the bicycle method\nwith the stations organised into legs for the first few months. A tentative\nplan has the present sixty-six stations organised into eight geographic legs*\nIt is anticipated that a rigid master schedule will be arranged for this block\nof five weekly hours* This schedule will stay in effect even though stations\ntake only part of the programs offered. In this way the problem of initial\nscheduling will be greatly simplified, and it will be possible for the stations\nto know well in advance when they will receive the various programs* This is\na poor substitute for what we will be able to do when we can schedule all programs\nfor the same week on all stations, but that must await the duplicator.\nIt is not intended that this be all of the programming offered. Extra\nprograms will be offered individually, perhaps to start on the opposite end\nof the legs as that of the block of five hours.\nIt is also believed that as time goes on we will be able to establish\na minimum number of weekly programming hours. This basic package we can\nbalance as to type and content. In addition to the basic package we can continue\nto make available individual series as they become available.\nTentative Schedule Five hour block ,\nSome of these programs have not beeF'emluaied^by the program committee.\nSome are repeats of previous series (with new programs) and are therefore\nconsidered safe to include. Thus this plan is strictly a tentative schedule\nfrom which to work.\nMusic For The Connoisseur.\n1 hr.\n26 weeks.\nBBC World Theatre\n1 hr.\n12 weeks.\nThe People Act (2$th Cent. Fund)\nh hr.\n13 weeks.\nStories N Stuff\ni hr.\n26 weeks.\nU of I Festival Goncerst\n1 hr.\n13 weeks.\nCampus Visitor\ni hr.\n13 weeks.\nMasterworks Story (WCAL)\n| hr*\n26 weeks.\nThe Seven Utopias\nI hr*\nweeks*\nTT5S7\nDescription of Programs.\n1. Music For the Connoisseur. (Similar to previous series.)\n2* BBC World Theatre. Drama. Titles include! Mother of Cheops, Dearest Wife,\nThe Fire on the Snow, Queen Elisabeth, Canterbury Cathedral, Givis\nBritannus, It*s a Shame To Take The ^ay, Cinderella, The Face of Violence,\nA Tale of Two Cities, and Happy and Glorious."
}