{
  "id": "d909-10",
  "text": "-9-\n3. Use the channels of the Audio-Visual department of the state P.T.A.\n(Mr. McKown is state chairman of this committee for the P.T.A.)\n4. Appoint someone to talk to Mr. Robert H. Wyatt, Secretary of the State\nTeachers' Conference, to see if a meeting on radio-television can be\narranged for a general session of the State Teachers' Conference.\n5. Send fact sheets regarding stations to Purdue and Indiana University\nand other centers where superintendents would go to seek information.\nFurther topics discussed included: the tape library (tapes should be reviewed\nevery two years for possible use or discard); the use of funds of the NAEB, with\nthe question of spending more for promotion of programs and for manuals and less\nfor tapes; the possibility of markers to indicate the cueing of tapes with long\nleaders.\nHow can workshops with elementary teachers be worked out? It is best to go di¬\nrectly to the schools and teachers to explain the utilization of radio. Michigan\nhas had success with a teachers' workshop at a conference held before school\nopened.\nThe following recommendations were worked out for presentation to the NAEB:\n1. The NAEB might expend more time and effort to get tapes and manuals to\nthe teachers in time for duplication in advance of the time needed.\nThis material should be available in the spring before the fall semester.\n2. Forms should be provided for evaluation of programs by the stations\nusing the programs. The NAEB should be asked to set up a program eval¬\nuation form. Stations refusing programs should explain why they refuse.\n3. More promotional material in the form of maps, etc., should be sent to\nmember stations. More money should be spent for promotion, less for\ntapes.\nILLINOIS & WISCONSIN: (E.C. Waggoner. Chairman; Gertie L. Hanson. Recorder)\nArrived at several questions and problems to be referred to the Board or Execu¬\ntive committee of NAEB:\n1) What can we do to encourage FM set ownership?\n2) What can be done to integrate educational radio and TV programming?\n3) What is the possibility of getting A-l scripts in radio and TV that could be\nused as a guide for study and production?\n4) Due to the need for an operational \"shot-in-the-arm\" would it be possible\nto have a travelling production workshop in radio? Andrew Allen, Rudy Bretz\nor others might be leaders.\n5) How can it become possible to have newspaper publicity of radio and TV programs?\n6) Would like to have some sort of acknowledgement of tape network program accep¬\ntances.\n7) Would like from NAEB a follow-up showing utilization of tapenet programs. If\nstation receiving program does not use it, can arrangements be made for its\nuse by another station in the area?\n8) Since an entire series of program might not be acceptable to tapenet, could\nindividual, single-shot programs be selected?\nMICHIGAN: (Paul Rickard, Chairman; Betty Fuller, Recorder) Arrived at several\nrecommendations:\n1) Try to locate all groups in Michigan that are trying to do Educational Broad-\n. casting: groups that may produce shows for broadcast over commercial stations.\nGet a statement from each listing its activity in this line.\n2) Establish complete exchange of materials from all Educational Broadcasting\ngroups within the state; i.e., program listings, brochures, teachers manuals,etc.\n3) Explore means whereby established Educational Broadcasting stations in Michi¬\ngan can help groups that want to do some work in this line. (Such as WANR, Al¬\nbion wired-wireless, and WKBZ-FM, Muskegon Schools)"
}