{
  "id": "d909-109",
  "text": "FOR INFORMATION OF_\nJanuary 20, I >5 9\nF. G. Macomber, Provost, Miami University, Oxford, Ohio\nJames Robertson, Educational Television and Radio Center,\n2320-Washtenaw Ave., Ann Arbor, Michigan\nRichard B. Hull, Director of Broadcasting, Ohio State University,\nColumbus 10, Ohio\nArmand L. Hunter, Director of Broadcasting, Michigan State University,\nEast Lansing, Michigan\nGentlemens\nnamed as a team\nThis may come as something of a surprise, but we have beer\nto participate in three sessions at the Region TUf NAEb n eeting in East\nLansing, on February 19 and 20. More information on the mating will be\nforthcoming.\nIt is planned to divide the attendees\nchairman. These groups will meet for<\nThere are three teams that will rotateXsessi\nthe other. The teams are to treat the\n1. The role of Radio1* future >Te3ui\neducation. 3. The role of HfrEB's fUturiyn\nthe team will present a halljr hour summary\nthree sjroups, each with a continuing\n^Cte, hour and a half, sessions,\nby session, from one group to\n,_g topics, roughly described:\n2. The role of TV’s future in\niucation. Before each group,\n,s topic, followed by an hour\ndiscussion under the leadership of the continuing chairman\nDc I make myself clear? JIot\\very, I’m a/raid.\nAnyway, Macomber/Robertson, HulTTVEnter, and Rider are a team to treat\nETV. It involves appearing at three separate sessions.\nI know that theisenior member® would do better, but I am willing to speak the\nspeech, unless sXmeone else Volunteers. However, I am certain that I would\nneed your bu trees tSgg aswhat material to cover. Hence, would you please\nadvise me on what youTJdnk should be covered?\nThis is a hasty note just prior to my departure cm a short, fishing trip to\nFlorida. I hope to have some advice from you on my return, and I will advise\nfurther at that time, and as I get more information from J. J&les.\nRLRscmt\nCC i H. J. Skomia X\nJames S. Miles\nWm. J. Harley\n?/8,\nm,\n\"j,\n;sss\nWarmest regards.\nRichard L. Rider"
}