{
  "id": "d909-110",
  "text": "FOR INFORMATION OF_\nJanuary 20, 1999\nGarnet, Garrison, director of Broadcasting, Univeristy of Michigan\nAnn Arbor, Michigan\nUmberto Neely, Manager, WCET-TV, 121*3 Elm Street,\nCincinnati, Ohio\nPaul Taff, Manager, WMVS-TV, 1019 N. Sixth Street,\nMilwaukee, Wisconsin\nJohn Glade, WBAA, Purdue University, Lafayette, Ind.\nGentlemen*\nAs you noticed in Jim Miles* memo, *ith or without your consent, you have\nbeen named to a committee to explore the possibilities of\nconnected, television network, Ihere is an engii\nto explore the technical problems and the costj\nHence, I take it that our job is primarily\nand liabilities, of such an arrangement,\nI am hopeful that we can follow Jim* s and meet at the Kellogg\nCenter, East Lansing, at 9*30 A.M. on Fewqguy 19• If you can attend the\nRegion III meeting it will provjKfe an~>%ce]\\ent opportunity to have a\ncommittee meeting. In any care, I will jWveWjrd with the conference\nregistration desk and as many members as arc prtesent will meet*\nregional, inter-\nttee designated\nfhe program possibilities.\npad all suggestions, ideas, thought,\nmoment can be phrased in the form\nIn the meanwhile, I should appreciate any\netc. on the subject. My own Thinking at\nof four questions._\n1. what kinrfs of programming would fit an interconnected ETV network in\nour geographical regitan?\n2. ^hat. conflicts in scheduling times, etc. would arise?\n3. what wild an intereflected network afford that could not be achieved\nby a systematic exchange of tape recorded programs?\nU. Should th^jAEB aidrempt to stimulate a regional organization for the\nexchange of tV material, either by interconnected network or tape/kine\nexchange?\nPlease feel free, in fact even feel compelled, to write me your ideas. At the\nvery least, think about the problem and bring your thoughts with you to East\nLansing on the 19th of February.\n/, JC OWarmest regards.\nRLRicmt\nCC* H. J. Skomia\nWalter %iory\nLarry Frymire\nJames S. Miles\nWm. G. Harley\nRichard L. *ider\n'*is,\n8, a p*"
}