{
  "id": "d909-134",
  "text": "III. Objectivesg The principal objective of this study -would be to provide\nto the governors, state officers, legislators and educational administra¬\ntors (including state and private college regents and trustees) of each of\nthe six states, the folio-wing informations\na. A practical engineering plan for the establishment of\nthe regional network with a schedule of costs for each\nstate’s participation in the network. Alternate routes\nand costs must be clearly indicated.\nb. A listing of program resources presently (and potentially)\navailable to the network in order that no legislator or\nadministrator might be in doubt as to what his constitu¬\nents might receive from such a network.\nc. A schedule of costs for establishment of a network, in¬\ncluding alternate routes and stations, broken down by\nstates.\nd. A schedule of costs for operation of the network, in¬\ncluding alternate routes and stations, broken down by\nstates.\ne. An administrative and policy plan for the network which\nwould represent an informed concensus on these matters*\nA secondary objective of the study would be to prepare a plan which\nwould stimulate formation of other regional networks and, eventually,\na national educational television network.\nIn furtherance of these objectives Region IV of the National Associ¬\nation of Educational Broadcasters, including representatives of the states\nmentioned above, and with the participation of Mr. William G. Harley,\nPresident of the National Association of Educational Broadcasters and\nDr. Harry Skornia, Executive Director, unanimously passed the following\nresolution supporting this projects\nRESOLUTION PASSED BY REGION IV, NATIONAL ASSOCIATION OF EDUCATIONAL\nBROADCASTERS AT REGIONAL CONVENTION, JANUARY 15, 1959, MPLS., MINN.\nRepresentatives of Region IV of the National Association\nof Educational Broadcasters meeting in Minneapolis, Minnesota,\nJanuary 15, 1959, recognizing the desirability of a regional\neducational television network for the furthering of educa¬\ntion at all levels in an area where the population is fairly\nwidely scattered, and noting that Title VII of the National\nDefense Education Act of 1958 is designed to implement research\nand experimentation in the use of television for such purposes,\ndo hereby direct John Schwarzwalder, Director of Region IV,\nto prepare and submit an application to the Department of Health,\nEducation and Welfare for a grant to support a research project\nto investigate the feasibility of such a regional network."
}