{
  "id": "d909-159",
  "text": "To: Jim Miles\nDick Hull\nPrank BoUswma\nDick Rider\nLarry Prymire\nFrom? W.G. Harley, Director, Region III\nDate: December 12, 1958\nRe: Region III Convention\nI am appointing you gentlemen to the general arrangements committee\nfor the convention* Frankly, I had hoped to hold off on setting\nthings up in advnace of my successor1s election, but the time is\ngrowing too short to hold off any longer. So this is something\nto throw into the hopper to get us started\nFirst, let me fill you In on what* s already set up.\nDate: Feb. 19-20\nPlace: Michigan State University, East Lansing\nHousing: Kellogg Center; Meetings: Union Building\nIn Charge of Local arrangements: Larry Frymire\nHousekeeping:\nWe will be housed in the Kellogg Center, but due to unavailability\nof meeting rooms on these dates w© will need to hold the sessions in\nthe Union Building nearby. We will also have our meals In the Union\n(other than breakfast and the banquet). Tentative plans have been\nmade to hold a modest banquet In the Kellogg Center on the 20th.\nKellogg Center has ample accommodations on the 19tli and 20th but, it\ncan not house a large number who might ■tfirish to come the night of the\n18th. It has 10 double rooms at the Center for ladles and can put\nup the men in adjacent dormitories.\nX suggest we arrange the program to run from the afternoon through\nthe following evening and In that t*ay most' people can travel to East\nLansing during the rmorning and afternoon of the 19th. Schedule might\nrun something like this:\nFeb. 19 b* OOpm-4.: 30 Registration\n4:30 - Coffee Hour - Get acquainted session\n8:00 - First Conference Session\nFeb. 20 9:00am-12:00 Morning Sessions\n2:00pm-4:30 Afternoon Sessions\n6:30 pm Dinner - Speaker\nFinances: Headquarters has agreed to make available $400 tpvyard the\ncoast of a regional meeting. (Available funds must be divided among\nthree regions.) This amount Is not large enough to go very far and\ncertainly some §25-450 will need to be held out to cover adminstrative\nand incidental expenses.\nThere would seem to be these possibilities. Apply the money toward:\n1. Expences of participants, probably limited to those coming from\nbeyond a 50 mile radius and paid as a flat fee or on the basis of\ntotal miles traveled."
}