{
  "id": "d374-48",
  "text": "The Honorable Or«n Harris\nFags 2\no£ this undertaking, ws understand both program and participating schools\nwill ha sob at ant tally iacraasad this coming year. Representatives of a\nnumber of school systems throughout the Stats have indicated desire to\nparticipate, but cannot do so until lac ill ties are made available.\nOn January 6th of this year the Nebraska Council for Educational Televi¬\nsion, Inc., on behalf of all educational iatereata in our State, petitioned\nthe Federal Communications Commission to reserve five additional\nchannels for future educational purpose*. Supporting data were forwarded\nby virtually the satire educational community. This is viewed ae the\nfirst of s series of steps necessary to see provided an adequate educational\ntelevision service for our State.\nIn view of the potential of television for education in Nebraska and the\nincreasing need to provide program service for both the classrooms and\nhemes of Nebraska, 1 am establishing a State-wide committee on educational\ntelevision to serve la advisory capacity to this office. This committee will\naddress itself to the task of surveying the current educational television\nprogram, assessing future needs, and providing leadership in developing\nexpanded facilities end programs most beneficial to our State.\nThere is need for a thorough legal, fiscal, technical, program and adminis¬\ntrative survey in Nebraska in order to provide intelligent development of\neducational television within our State. This, too, would bo conducted under\nthe direction of the above-mentioned committee.\nAdditionally, wo expect to investigate possible interconnection with neighbor¬\ning States for the purpose of sharing educational rasources. Several studies\nhave already beea completed which demonstrate the feasibility of linking\ntogether six Midwestern States.\nIf funds ware available to increase KUON-TV to maximum power and more\nstrategically relocate it to serve metropolitan Omaha as well, this on# move\nwould bring educational television to 50% of the Nebraska population. The\ncomplete network ae described to the Federal Communications Commission\nwould bring this service to 90% of the people of Nebraska.\nThere is considerable educational television activity here in Nebraska.\nTbs need for increased facilities and program exists. W« have the interest,\nthe personnel and the experience. Certain Stats funds already are directed\nto the operation of KUON-TV. Participating school systems in the Nebraska\nCouncil have demonstrated willingness and ability to assume their fair\nshare of such instructional coats. Although the demands for appropriations\nare continually increasing, it is my hope that the Nebraska Legislature\nwould look favorably upon an enlarged educational television program for\neur State."
}