{
  "id": "d1763-0",
  "text": "OFFICERS\nEXECUTIVE COMMITTEE\nPRESIDENT! R. C. HIGGY, WEAO\nOHIO STATE UN IVERS ITY\nCOLUMBUS, Ohio\nVICE-PRESIDENT! CARL MENZER, WSUI\nSTATE UNIVERSITY OF IOWA\nIowa City, Iowa\nof\nFirst Zone: DANIEL E. NOBLE, WCAC\nCONNECTICUT AGRICULTURAL COLLEGE\nStorrb, Connecticut\nSeddnd Zone: J. B. HASSELMAN, WKAR\nMICHIGAN STATE COLLEGE\nEast Lansing, Michigan\nSecretary-Treasurer!\nB. B. BRACKETT, KUSD\nVERMILLION, SOUTH DAKOTA\nCollage and L\\r\\w/e.r'^\\\\y\ndealing\nTHIRD ZONE! GARLAND POWELL, WRUF\nGainesville, Florida\nFourth Zone: W. I. GRIFFITH, WOI\nidwa state college of agriculture\nOffice of Executive Secretary\nT. M . BEAIRD, WN AD\nSPECIAL BULLETIN\nRelease Date March 16, 1932\nFifth Zone: H. V. CARPENTER, KWSC\nSTATE COLLEGE OF WASHINGTON\nPullman, Washington\nAT LARGE: CHARLES A. CULVER, KFM X\nCARLETON COLLEGE\nTO MEMBERS\nof\nTHE ASSOCIATION OF COLLEGE AND UNIVERSITY BROADCASTING STATIONS .\n(and a special request mailing list)\nMany encouraging communications are being received daily at this office. In the\npast six or eight weeks a nation-wide awakening has taken place among colleges and\nuniversities owning and operating broadcasting stations. One of the most encour¬\naging communications received is from the State College of Washington, Pullman,\nWashington. Mr. Frank F. Nalder, Chairman of the Faculty Committee on Radio and\nDirector of Station KWSC, the educational station using 2,000 watts during daylight\nhours and 1,000 watts during evening hours, sends this very interesting letter:\n\"During the past few weeks we have received several bulletins from you as Executive\nSecretary of Association of College and University Broadcasting Stations.\nSpecifically, these are dated January 29, February 6, 11, 18, and 24. Also, there\nwere two undated special rush bulletins. Our failure to acknowledge or apparently\nto act on these bulletins from you has not been due to neglect, but to the fact\nthat for some little time either Dean Carpenter has been away on two eastern trips,\nor I have been out of the city on extension business which has made the conference\nthat seemed desirable difficult.\n\"Yesterday, at our first opportunity, Dean Carpenter, President Holland, of this\ncollege, and I conferred at length with your bulletins before us.\n\"We are, of course, in the heartiest sympathy with all that you are doing to per¬\nsuade the Federal Radio Commission to give education more nearly its due on the\nair. I should add that education by radio has, it seems to me, no more vigorous\nand intelligent defender than President Holland. He stands by our efforts here\nwith great discernment and firmness. Also, not only as President of this College,\nbut as President of the American Association of Land Grant Colleges, he exerts\nhimself by every possible connection to advance the cause of educational radio\nbroadcasting.\n\"Furthermore, we have the cordial support of every member of the congressional\ndelegations of 'Washington and Idaho, and at least the sympathetic consideration\nof the delegation from Oregon. The strategic place of KWSC in educational broad¬\ncasting in the Northwest is well recognized. Yesterday after our conference,\n1 resident Holland wrote letters to several of the most influential men in Congress,\nincluding Senators Dill and Couzens, urging favorable consideration of measures"
}