{
  "id": "d1763-2",
  "text": "-3-\nT::!NAD. We therefore petition your help again in opposing in any way possible the\ngranting on the part of the Federal Radio Commission an assignment on a frequency\nof 1010 kilocycles to Station \"/LAP—The American Broadcasting Corporation of\nKentucky. We will appreciate your assistance in this matter and any advice you\nmay give us as to your findings.”\nThe attitude of the Federal Radio Commission toward educational broadcasting\nstations and more especially toward WNAD of the University of Oklahoma did not\nchange with the above move. Just March. 5,.; Mr. James W. Baldwin, Secretary of\nthe Federal Radio Commission, sent us a very indefinite communication of some ten\nor fifteen lines which has caused more concern. Below you will find the protest\non the part of the President of the University of Oklahoma, the Dean of the\nExtension Division, and the Program Director of Station WHAD, which was sent to\nthe Secretary of the Commission:\n”Your letter of March 5 dealing with the interpretation of Rule 155 of the Federal\nRadio Commission has just been received. At the outset we are forced to state that\nyour letter is quite indefinite. Likewise, the letter you addressed to Mr. Powell,\nManager of Station KGGF of Coffeyville, Kansas—our sister station with whom we share\ntime—is quite indefinite. Immediately upon receipt of the letter from your office\nMr. Powell called my by long distance from Coffeyville, Kansas, and discussed the\nmatter with me at some length. This was the day before Station UNAD received your\nletter addressed to this office.\n”As I interpret your letter, Mr. Baldwin, you are asking for one of two things\nbased on Rule 155. First, you are asking that we execute a new time-sharing agree¬\nment between UNAD and KGGF which would permit an equal division of time in which\neach station would operate fifty per cent of the time (nine hours for each station )\neach day in the week. Second, in case we do not make this time-sharing agreement\nwith KGGF, as I interpret your letter, you desire that we execute a new time¬\nsharing agreement and relinquish to KGGF ALL HOURS of the radio day except the\nfollowing: 7:15-9:15 P.M. Tuesdays; 8:15-9:15 Wednesdays; 7:15-9:15 Thursdays;\nduring the sessions of the University of Oklahoma.\n\"May I call your attention to the fact that you and the Commission are fully aware\nthat it is an impossibility for WNAD of the University of Oklahoma to agree to\nbroadcast nine hours each day in the week as set out under the first interpretation\nabove. Like all educational stations our appropriations are quite limited.\nFrankly, we will not, under any circumstances, agree to broadcast from this insti¬\ntution nine hours each day of the week. Educational stations throughout the entire\ncountry have been hoping for the day when the Federal Radio Commission would\nrealize that some of their most important broadcasts come at special hours. For\nexample, all colleges and universities have special concerts, lectures, etc., which\nare scheduled in many instances on two weeks’ notice. Such programs prove to be\nsome of the most important educational broadcasts. It is quite necessary that the\narrangement between KGGF and WAD remain as it is in order that we may present to\nthe citizens of this State these special educational features. As the arrangement\nnow stands, we are able to schedule these special time broadcasts by giving the\neight days’ advance notice to KGGF as set out in our time-sharing agreement.\n’’Under the second interpretation given above as applying to Rule 155, I wish to\nsay that we bitterly object to and oppose such an arrangement. If the Commission\nforces UNAD to stay off the air all the hours except the five hours designated\nabove, you will materially hinder the development of the educational program\nsponsored by this institution in the State of Oklahoma. We assuredly feel that\nyou have no moral or legal right to interfere with the regular functioning of any\neducational station to this extent."
}