{
  "id": "d1763-7",
  "text": "-9-\nMT\"o have made so many requests for a change of wave channel without any result\nthat for the past year or more we have made no further attempt to get relief.\n\"Previous to the general allocation of wave channels by the Federal Radio Com¬\nmission of November 11, 1928, re had had full time use of any rave assigned us.\nT'hen it was evident that time division would be extensively used after November\n11, 1928, we joined in a request to have our station grouped with KFDY of South\nDakota State College, Brookings, and UNAX of Yankton, S. D. After it seemed that\nthis combination -would be assured in August, 1928, re were tentatively changed to\na combination of KUSD, WIAX of Yankton, S. D., and KFNF of Shenandoah, Iowa.\nThen two days before November 11, we were assigned to a combination with FILL of\nthe University of Illinois, and KFNF of Shenandoah, Iowa; and we have since re¬\nmained in that combination.\n\"t’:g have had the most agreeable relations with those directing WILL and KFNF; and\nwo have had not the slightest trouble of a personal nature with the managers of\neither station, but the stations of the group are too widely separated to have\nthe combination satisfactory in a general way. The school stations in particular\nhave many special events to be arranged for by exchange of time; and there are\nmany adjustments that need to be made on very short notice. We are too far from\neach other to make such arrangements either quickly or easily,\n\"Various attempts to get a more compact arrangement of time-sharing group of\nstations have in all cases come to naught.\" * * * *\nFrom Hr. R, C. Higgy, Station W3A0, Ohio State University, Columbus, we list\nbelow a summary of W3A0 information supplied members of Congress:\n\"1. W3A0 was operating on April 1, 1927, on 1060 kilocycles with a power of 750\nv;atts, The station operated on this frequency, which v*as assigned by the\nDepartment of Commerce. WEAO shared time with another Columbus station.\n2. WEAO was next changed on November 11, 1928, by order of the Federal Radio\nCommission to share time on 550 kilocycles with 750 watts power.\n3. WEAO has always been licensed to share time with another station. No definite\nproportion of time has been stated in the license. The station has never\noperated more than one-third of the total time on the channel. A recommendation\nnow before the Federal Radio Commission will reduce the entire time to forty-\ntwo hours per week all during daylight hours, (up to 7:00 p.m.).\n4. The only request made by Station WEAO previous to the present time controversy\nTwas a request for a change in hours and assignment from the one made November\n11, 1928. Such a change was obtained on July 15, 1929, moving to the present\nassignment of 570 kilocycles, 750 watts, sharing time.\n5. Our present application and controversy before the Federal Radio Commission\nrequests an assignment to full one-half time with a practically even division\nof day and night time.\n6. Only one hearing has been held before the Commission, this on November 24, 1931.\nThe Attorney General of the State of Ohio has supervised the legal procedure\nfor the University.\"\nFrom Mr. W. D. Allingham, Manager of Station KBPS, Benson Polytechnic School,\nPortland, Oregon, we quote the folloY.ring from a copy of his letter addressed to\nMr. R. C. Higgy of Ohio:\n\"Copies of your two plays were received today. This service is greatly appreciated\nby Station KBPS, and the plays will be released at a future date."
}