{
  "id": "d838-8",
  "text": "HBH #ei\n- LOW POWER F,M. FOR CHIRCHHS -\nA pet*-ion, the approval of which would mean that churches of all denoial-\nnations could operate their own 10~vatt FM radio stations, is now ready to\ngo before the Federal Communications Commission, Washington, D„ C» The pe¬\ntition, filed by Dr., R* Alton Reed for the Southern Bantist Convention of\nTcxop., calls for opening of the radio educational band to religious groups*\nThe movement for the low power frequency modulation units began after the\nOctober meeting of the FM Association, where considerable interest vas mani=\nTested in the Serrasoid Modulator nroduced. by Radio Engineering Laboratoraei c\nDr. Reed, director of the department of radio for the Texas Baptist Convention,\nsaw in the low power FM transmitter an opportunity to benefit both church\ngroups and the cause cf FM.\nChurches of all faiths throughout the nation could set up for less than $2,500\nth?ir own broadcasting ’ tatlons, because a church was broadcasting on FM*\nthe membership of that church would be more likely to purchase FM sets, thar©«~\nby making FM more profitable than it hag been in the past.\nAt its annual convention in Houston in Hovember 1948 the Baptist General Con¬\nvention of Texas adopted a resolution asking the Federal Communications Comm¬\nission to allow churches to broadcast on low power FM in the 88 to 92 mega*\ncycle band. Later the resolution vaa presented to the radio commission of\nthe Southern Baptist Convention, where it was unanimously approved. These two\norganizations, representing more than six and one-half million Baptists, se¬\ncured counsel in Washington and prepared the petition to the FCC not only in\nthe name of Baptists, but in the name cf all churches.\nIt is asked that the application forms for the 10~watt FM stations be einm-\nlifted so that they can be answered by laymen without the service of a locai\nengineer®, that the installation of such stations be simplified so they can\nbe operated similarly to a nubile address system; and that the antenna be a\nsimple one-ring affair*\nMore than 200 Baptist Churches in Texas have already signed tentative apnli*\ncations indicating definite interest in the small stations* \"It is the hope\nof the denomination*\" declared Dr„ Heed, * that every community of 1500 popu¬\nlation and more will week to have these low power FM sets in the local churches*\n\"Where there are schools and colleges in the community and there ar*» more who\n**ant broad casting stations than there are channels available, it is hoped that\nthose churches and schools wanting transmitters will work out a plea to share\nthe s -me freouenev,\" There is no conflict in this, he pointed out, because\nschools would be broadcasting during t^e daytime, and churches would do most\nof their broadcasting on Sunday,\n\"Every indication leads tc the fact that these low never FM station for schools\nand colleges and for churches have ooened un a new field of broadcasting which\nwill give the life blood to frequency modulation that it has needed. There\nis no doubt that it is the best type of audio broadcasting,*\n-30-"
}