{
  "id": "d838-9",
  "text": "rbh~84\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nRadio Station WG1, Hdqrsu\nAmes, Iowa\nBferofe f0 1949\nTO OFFICERS AND DIRECTORS?\nEnclosed is a copy of a letter from the Baptist General Convention of\nTe^as to which I urge you give your very serious consideration and re¬\nact to me as soon as you conveniently can*\nYou have doubtless noticed in the trade journals that this church group\nis expecting to apply for some 200 low power FM broadcasting stations„\nObviously, they hop© to secure epao© on what is now known as the educa¬\ntional FM bando\nOn the positive side, 3uoh a development would vastly encourage the sale\nand use of FM on a nor-ocramerGial basis. At the same time it is evident\nthat religious broadcasting as such is not necessarily ©duoational\nbroadcasting,.\nThe traditional attitude of NAEB has been to opposo approval of member¬\nship for any religious station wnich ia not affiliated with an accredited\ncollege, 30hool or universityc The intent has been clear—to eliminate\nwhat might be termed the \"'rabid fringe58.\nHowever, in the presort instance we may well find ourselves in somewhat\nof a “‘dog in the manger1* position. Through the vigorous efforts of a\nnumber of educational groups, including NAEB, twenty channels were desig¬\nnated as non-commercisl FM channels and set aside for suoh us© in the range\nof 88 - 92a\nXt is unfortunate that to date thee© frequencies have by no means been\ntaken up by educators, and despite the fact that many of us know of several\nscore of prospective epplicants, official action has been token only by\nthose listed in the Isst News Letter* Recent and unofficial reports from\nthe FCC indicate that wo would bs making an insane and impossible gesture\nif we apply for a so-called ’'educational band5* on the television spectrum.\nNow, with educators having used less than half of the available FM fre¬\nquency, if we categorically petition the FQC to deny the Baptist Convention\nthese frequencies for non-oommercial use, we will b© able to enow little\njustification and are quite likely to be overwritten.\n1 will appreciate your reactions S3 to how this situation may be vet* It\nhas occurred to me there might be some merit in voluntarily relinquishing\ntwo or three of the channels in the so-called educational band in favor of\napplicants of this type and not making the distraction officially for the\nFCC between education©1 and religious groups,, Xt seems some statement of\ntiis kind must be brought to the attention of our general council and to\nthe FCC, or we shall yield the point by defaults\nva\nRICHARD Bo HULL\nPRESIDENT"
}