{
  "id": "d1233-1",
  "text": "94 Register for Region III Meeting\n—by Henry H. Mamet\nInformality was the order of the day at the sessions of the\nNAEB Region III conference at the University of Chicago\nCenter for Continuing Education March 17-19. Mendel Sher¬\nman, president-elect of DAVI, keynoted the convention for\nwhich there were 94 official registrants, with his address on\n“The Challenge of Change.” The theme pervaded the con¬\nference. General discussion areas included administration, fa¬\ncilities, relationships and programing, the team approach to\npreparation of materials as well as the responsibilities of the\nvarious representatives of the elements of production.\nIn the session on broadcasting facilities, discussion included\nthe new low-priced videotape recorders, the 2000 me band, and\nthe progress of state networks. The problem of finding avail¬\nable UHF channels for future ITV translators in Chicago\nand Detroit was discussed. Reports were given on the Illinois\nSchool Problems Commission-sponsored bill calling for a\nmicrowave link connecting ETV stations throughout the state.\nIndiana reported on a proposed microwave link connecting\nPurdue and Indiana universities and others. Wisconsin has\nproposals for connecting 7 ETV stations by microwave with\n4 of them acting as production centers. Ohio has a 29-station\nplan under way.\n“How to do it” discussions shared time with discussions of\nphilosophy. In one buzz group, participants talked about the\nneed for more experimentation, utilizing TV to its fullest\npotential in terms of its ability to express immediacy through\nthe extended use of mobile units and film. This concept was\nalso discussed as it related to radio. One suggestion was that\nall educational broadcasters might well agree to work jointly\non special projects for the year. This would be particularly\napplicable in attacking social problems and problems dealing\nwith the welfare of the nation. It was agreed that a principal\nproblem was public apathy, not only toward mass media but\ntoward other elements of society as well. It was reported that\naffiliates are now discussing a concerted effort toward pro¬\ngraming in the general area of the “Environmental Revolu¬\ntion.”\nA half-day session in which NAEB members asked ques¬\ntions about the organization concluded the conference. Pres¬\nident Harley presented a proposed change of structure for the\nNAEB which is being developed; this seemed to meet with a\nconsiderable amount of favor from the group. A financial re¬\nport was presented.\nQuestions were raised about NAEB’s participation in dis¬\ntribution of TV as well as radio programs. President Harley\npointed out that the emergence of many closed-circuit oper¬\nations, 2000 me band operators, and nonaffiliates of NET pro¬\nvides a market for program materials outside the Center. He\nindicated that the NAEB is considering this problem.\nOther items discussed in this meeting were problems of the\ntape network, an FM live network, stereo, and the possibili¬\nties of a radio seminar. The publications policy of the NAEB\nwas discussed and a vote was taken on the nature of the type\nof journal or magazine which would be preferred by the\nmembership. The vote indicated that the members present felt\nthere was need for a “professional” journal, but that there\nwas a greater demand for more of the “how to do it” types\nof material.\nOn the lighter side, one of the highlights of the conference\nwas banquet entertainment by Art Hodes, noted jazz authority\nand pianist.\nIntern-Teacher Program Receives Support\nGlen H. Traw, director of the Southwestern Indiana ETV\nCouncil, writes of the intern-teacher program in which sixteen\nstudents from four colleges in Indiana will do practice teach¬\ning both in ETV classes and regular classroom situations. As\nthe first four students completed their work, Traw says that\nthe reaction from receiving teachers and all concerned seems\nto be one of enthusiasm for the project.\nThe students’ schedule includes TV studio orientation, on-\ncamera teaching, directing, camera work, lighting, eight weeks\nof classroom teaching, and a trip to another TV project to\ncompare techniques. Cooperating institutions are Evansville\nCollege, Indiana State College, Indiana University, and Oak¬\nland City College. The project is financed by a Ford Founda¬\ntion grant.\nETV Promotion Tapes Available\nThe South Carolina ETV Center has announced a willing¬\nness to provide at nominal cost copies of promotional tapes\nand films produced there for RCA. The recordings are suit¬\nable for use in training teachers and promoting ITV. For\ninformation, write: Mr. Henry J. Cauthen, Program Direc¬\ntor, South Carolina ETV Center, 2712 Millwood Avenue,\nColumbia, South Carolina.\nRadio Stations May Obtain Free Programs\nPublic-service documentaries on human and intergroup re¬\nlations themes are available to radio stations as a free service\nof the Anti-Defamation League of B’nai B’rith. “Conversa¬\ntions with Dr. Spock” is a series of four quarter-hours fea¬\nturing Dr. Benjamin Spock. In these, prejudice in children\nand the role of parents and teachers in teaching good and bad\nhabits of interpersonal relations are discussed. The second of¬\nfering is a quarter-hour show, “Some of My Best Friends\n. . . . ” Quentin Reynolds narrates this dramatization of ac¬\ntual cases of discrimination in social clubs, housing, and re¬\nsorts. For information, contact your area ADL office, of\nwrite: Anti-Defamation League of B’nai B’rith, 515 Madi¬\nson Avenue, New York 22.\nNAEB Exhibits at ASCD\nMarguerite Fleming and her staff from KSLH, St. Louis,\nmanned an NAEB exhibit at the 1963 conference of the Asso¬\nciation for Supervision and Curriculum Development. Par¬\nticipants in the national conference met in St. Louis March\n10-14.\nSouth Dakota ETV Group Organizes\nThe South Dakota Educational Television Association has\nbeen organized to conduct a feasibility study of the potential\nfor ETV in the state. The association is also negotiating for\nreservation of TV channels for education; two channels are\nreserved now, and two more are being sought. Various state\neducation organizations are contributing funds for the survey,\nwhich is to begin this spring, and hopefully will be completed\nby the end of the year.\nMartin Busch, general manager, KUSD, University of South\nDakota, was elected president of the association at its organi¬\nzation meeting. Other directors are: Mrs. Virginia Simpson,\nRapid City, vice president; Tom Kilian, Sioux Falls, secre¬\ntary; F. R. Wanek, Pierre, treasurer; Elgie Coacher, Pierre;\nMrs. Kathryn Wilson, Hot Springs; Robert Hald, Pierre;\nand Robert Black, Sioux Falls.\nNITL Announces 272 Courses Available\nIn its second guide, the National Instructional Television Li¬\nbrary lists 272 telecourses (11,814 separate lessons) now avail¬\nable for exchange. This is over a hundred more courses than\nwere listed in the first guide, described at length in the Sep¬\ntember, 1962, Newsletter.\nThe new guide also Indicates the extent to which the\ncourses have already been exchanged. While elementary science\nis highest in the number of courses available (35), it is third\nin exchange use with 43 “other” users. Elementary foreign\nlanguages, for which 30 courses are available, leads in ex¬\nchange rate, with 81 users besides the original. Second is the\nadult course group, in which a single literacy training course\nhas had 46 “other” users.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. $5.00 a year, $7.50 including Washington Rleport.\nEditor: Betty McKenzie. Phone 333-0580.. Area Code 217. Report¬\ners: Region I—Michael Ambrosino, Ruane Hill; Region II—Shirley\nFord, Lou Peneguy; Region III—McCabe Day; Region IV—Richard\nVogl.\n2\nNEWSLETTER"
}