{
  "id": "d1219-1",
  "text": "- 2 -\nUnconsciously, many people have come to think of\nbroadcasting in America as being represented entirely by the\nbig national networks. That, of course, is a compliment to\nthe general appeal of network programs and a recognition of\ntheir dominance of the broadcasting scene. It is a tribute\nto the popular techniques which characterize most chain fea¬\ntures, techniques derived for the most part from other fields\nof commercialized entertainment. But such an attitude of\npassive acceptance does not acknowledge the constant denial of\nprivilege and the frequent insult to good taste found in the\nprograms and the insistent commercialism of hundreds of sta¬\ntions during many hours of every broadcast day. Let us not.\njudge American broadcasting solely by a few of its outstanding\nnational offerings from six P.M. to ten P.M. Let’s take ac¬\ncount also of the hours of insufferable stuff and wasteful\nduplication from countless local stations throughout the day\nand into the night. Nor should we give the networks a vote\nof complete confidence, if I may be permitted to say so.\nAs I have said, not many people are alert to the\nweaknesses of American radio practice. Too many are satis¬\nfied to take what they can get and be grateful. Whatever\nthey get is a gift, they feel. They either have not cared or\ndared to question, criticize, and reject.\nThen, what doubles our discouragement is this, that\ndistinguished educators, even university presidents, have\nfailed to see the importance of safeguarding education’s in¬\nterests on the air. They have been indifferent, thoughtless,\nor — misled. They have acquiesced in the status quo. Scien¬\ntists have neglected the objective view which says, \"These are\nthe facts; the decision is yours.\" They have accepted the im¬\npossible competitive basis set up between education and enter¬\ntainment. They have permitted the acquisition and the use ol\nradio facilities as a medium of mass appeal upon lines of least\nresistance. They have failed to recognize the discrimination\nagainst education as such, which naturally results from such a\npolicy.\nSo the unive sity station director comes face to\nface with the fact that all about him is a lack of understand¬\ning and considerable indifference to the high purpose and deep\nsocial need for the educational station. His own faculty, as\na whole, is tolerant and mildly interested. They are preoccu¬\npied. Certain individuals are eagerly helpful, anxious to\nexplore. A few close advisers are loyal and.devoted. But\nby and large the radio director meets with minds that have\nnot reached far ahead to find means of adapting radio to their\nfields of professional interest. He finds acknowledgment of\nthe social potentialities of radio in oratory but not in\naction."
}