{
  "id": "d1219-5",
  "text": "- 6 -\ncontributions of personal services by the Colleges of Agricul¬\nture and Engineering, building maintenance by the University,\nand the help of 15 NYA student workers. And of course it does\nnot include contributions of program talent and effort from\nother university branches, state agencies, and governmental\ndepartments. To some other university stations this annual\noperating budget of $20,000 may seem generous, even vast. To\nour friends in the radio entertainment business it appears\ntrifling. They scoff at the meager amounts set aside for edu¬\ncation on the air. And whether we like it or not, they are\nentitled to some scorn. But some day, we hope, we shall all\ncome to see the everlasting value of a publicly-supported\nbroadcasting service operating in the interests of education\nand social improvement. Then our university stations will be\nadequately financed, and the cost, though considerable, will\nbe small in comparison with the social benefits achieved through\nthe spread of truth and understanding.\nWe come now to Problem Number Three: Programs. In\na sense this is the least and the greatest of the university\nstation director!s problems. Least, because the university\nitself is a rich storehouse of radio program material. The\ncombined wisdom, experience, and understanding of a universi¬\nty community offer an inexhaustible wealth of talent and pro¬\ngram content. Here associated in one place are persons whose\nknowledge embraces all sciences and all arts. Here are lec¬\nturers who fill their halls with students, teachers who devote\ntheir summers to travel and research, scholars who can pre¬\nsent and interpret the best in foreign cultures. Here are\nscientific explorers, travelers, musicians, and authors.\nIn a dim laboratory somewhere on the campus late at\nnight there!s a quiet but gripping search.for the unknown.\nIn a fourth floor classroom somewhere a gifted teacher in¬\nspires students to find new experiences in books. Somewhere\na historian opens up vistas into the life and thought of the\npast. In a crowded lecture room somewhere a professor guides\nhis students in a grasp of world affairs and of their place\nin the scheme of things. Somewhere, everywhere in a great uni¬\nversity there is constantly going on that finest of earthly\nendeavors, the quest for knowledge and understanding. Here,\nthen is the radio director1s paradise of potential programs.\nHere is the home of radio education, a center of cultural\ngrowth and extension, the only kind of home from which true\neducation may be expected to emanate.\nBut how to convert this wealth of potential talent\nand material into appealing radio programs? — that.is the\nstation director’s task now. How to select and train writers."
}