{
  "id": "d1219-6",
  "text": "- 7 -\nspeakers, and actors? Look enviously at professional broad¬\ncasters and try to follow their pattern? Perhaps. But bet¬\nter still, we might dig in and develop our own techniques for\neffective use of the radio. And here again the facilities,\nthe potentialities, for this development are to be found right\non the university campus. In Speech classes, English compo¬\nsition, journalism courses, forensic training — in these and\nother fields there is constant study and experiment in effec¬\ntive expression, a search for the means of being interesting\nand convincing. Here the director will find talented persons\nwho develop amazingly under guidance. He will set up a train¬\ning class for announcers, a group for actors, and an intimate\nclub for writers. He will conduct a radio speech clinic per¬\niodically for faculty members. He will record their voices\nand show them how they can improve their radio style. He will\naudition public-spirited citizens and teachers. And he will\nfind among these plenty of interesting, eager, vibrant per¬\nsonalities. Don!t tell me that education is deadly and that\nall teachers are dull. I know better, and the director who is\nprepared to give broadcast training and opportunity knows that\nhe can discover and develop techniques and performers with\nabundant appeal.\nNaturally, the station director will not attempt to\ncarry on all this training alone. His staff will include\nspecialists prepared to help others. He will have close as¬\nsociation with numerous participating organizations, teachers1\nassociations, parent groups, music clubs, literary circles,\nand others. He will help to introduce radio instruction and\nappreciation into various phases of university courses, into\nspeech, dramatics, journalism, and educational methods, into\nteachers1 institutes and public discussions. He will demon¬\nstrate wherever possible the unique service which his station\nis capable of giving.\nThrough all this the university station director will\nhave overcome his awe of professional radio and Broadway enter¬\ntainment devices. He will be a bit skeptical of that something\ncalled \"showmanship”. He will recognize that broadcasting re¬\nquires certain techniques but that the essentials of effective\ncommunication are as old as society itself. He will be con¬\nvinced that he has close about him all of the elements needed\nfor the development of successful educational radio programs.\nAnd he will steadfastly assert the falsehood of a statement by\none of the big networks that: \"All broadcasting is predicated\nupon entertainment....broadcasting is a professional occupa-.\ntion. ■ Any attempted reform which takes broadcasting facilities\nfrom professional control and hands them over to non-professional\ncontrol is a menace to good broadcasting.\""
}