{
  "id": "d1067-2",
  "text": "NAEB NEWS LETTER\nPage 3\n.....January I, *945\nCALL LETTERS, WKAR. INTERESTED STAFF MEMBERS ANO STUDENTS IN THE ELECTRICAL\nENGINEERING DEPARTMENT DEVELOPED THE FIRST TRANSMITTER WHICH WAS OPERATED\nON A LIMITED SCHEDULE FOR TWO YEARS.\nWhen the Detroit News, early in 1924, installed a new transmitter they gave\nthe College their old 500-watt equipment and on January 12 a license\nENABLING THE COLLEGE STATION TO COVER THE OPERATION OF THIS NEW POWER WAS\nGRANTEDo\nAs WKAR GREW IT CAME MORE AND MORE TO THE NOTICE OF THE EXTENSION SERVICE.\nIn 1925 a Farm Radio School was inaugurated for the presentation of such\nCOURSES AS HOME ECONOMICS, ANIMAL HUSBANDRY, POULTRY AND VETERINARY\nMEDICINE, HORTICULTURE ANO GARDENING, DAIRYING AND FARM CROPS. ThIS NOVEL\nEXPERIMENT OF AGRICULTURAL EDUCATION BY AIR ATTRACTED LARGE ENROLLMENTS\nAND EXAMINATIONS WERE GIVEN AND CERTIFICATES AWARDED TO ALL WHO COMPLETED\nTHE COURSE So\nFurther service to rural audiences, which began about the same time,\nINCLUDED MARKET REPORTS AND TIMELY INFORMATION ON AGRICULTURAL PRACTICES.\nThis program has continued uninterrupted for 14 years and has become one\nOF THE LEADING CONTACTS WITH RURAL LISTENERSo\nThe farm radio school was repeated in *926 with a *2 weeks’ course of\nSTUDY AND A SCHEDULE WHICH INCLUDED *82 LECTURES WITH I 00 DIFFERENT\ninstructors cooperating* In addition there WAS a series in nature study\nAND ONE BY DEPARTMENTS OF STATE GOVERNMENT 0 The SCHEDULE OF CLASSES THIS\nAND THE FOLLOWING YEAR WAS 0FFERE0 FROM JANUARY TO April. THE FARM PROGRAM\nAT NOON PROVIDED THE PROGRAM MATERIAL THROUGHOUT THE REST OF THE YEAR*\nBy THE TIME WKAR WA S READY TO APPLY FOR A LICENSE RENEWAL IN 1927 IT HAD\nCQME A LONG WAY FROM ITS PIONEER DAYS WHICH Fred C0 HqLME?3, ENGINEERING\nGRADUATE OF *923, DESCRIBES THUS.* \"W'E HAD THE THRILL OF ACCOMPLISHING\nEVERYTHING WITH MAKESHIFT EQUIPMENT, OF TEARING EVERYTHING AND EVERYBODY\nLOOSE ON THE CAMPUS TO GET THROUGH, AND FEELING IMPORTANT IN A TELEPHONE\nBOOTH ON THE TRACK AT BASKET BALL GAMES AND LECTURES« Bui EVERYTHING WAS\nPRETTY CRUDE . RARELY DID ANYONE KNOW UNTIL FIVE MINUTES BEFORE BROADCAST\nTIME IF THE.PROGRAM WOULD GO ON* We HAVE NO MONITOR, AND ONE OF US RAN\nBACK AND FORTH FROM THE ARMORY TO THE NEXT HOUSE WHERE SECRETARY HALL1DAY\nHAD A RECEIVER* THERE WAS MUCH MORE ENTHUSIASM IN THOSE DAYS THAN THERE\nWAS SKILL AND FINESSE.”\nBy 1927, radio had come far from that description. *n the license\nAPPLICATION WERE LISTED FACULTY TALKS, VALUABLE INFORMATION ON CROP AND\nMARKET CONDITIONS AND INSECT PEST CAMPAIGNS. The APPLICATION FURTHER\nSTATES THAT THE COLLEGE STATION, IN ADDITION TO HAVifJG BECOME AN IMPORTANT\nINFORMATION SOURCE TO ITS LISTENERS, HAD BECOME OF MATERIAL ASSISTANCE TO\nOTHER EXTENSION FACILITIES SUCH AS COUNTY AGRICULTURAL AGENTS, BOYS8 AND\nGIRLS* CLUBS, HOME ECONOMICS DEMONSTRATIONS, RAILWAY DEMONSTRATION TOURS\nAND PUBLICATIONS.\nSeveral shifts of frequency assignment occurred during b?he year, *927,\nBUT WHEN THE FEDERAL RADIO COMMISSION REALLOCATED ALL STATIONS ON\nOct. 31, 1928, WKAR was placed on *040 kilocycles and authorized to use\n500 WATTS OF POWER DURING DAYTIME HOURS."
}