{
  "id": "d1525-1",
  "text": "The President1 s /Page I I\nWell, there you have some of the broader problems ahead of.us., .1 .\ndon't mean to indicate here that they are all-inclusive* Goooness\nKNOWS,- .WE HAVE, LOTS to do. .i '\nAlways, there is some question in my minohqw much I should indicate..\nTHE SCHOOLEY TRAVELOUGUE IN THIS PAGE, BUT USUALLY I END UP THE SAME\nway. If Pm going to be Schooley, going to talk about,what the pres¬\nident- DOES I N H I S SPARE T I ME, -THEN. W.HY .NOT LIST IT HERE. SO YOU FINE\nPEOPLE WILL KNOW. WHY NOT? Ok.\nI HAD THE REAL PLEASURE OF VISITING WITH MA C McCARTY, BILL HARLEY,\nJack, Stiehl, £rni e Engberg, Lou Landman, Arlene McKellar and others\nat WHA on one November- week-end. Just incidentally, Illinois defeated\nWisconsin's football team that week-end. I talked with Waldo Abbot\nA WEEK EARLIER, HAD TO CALL: HIM BY ' PHONE TO DISCUSS THE Il.LINO I S-\nMl CHI GAN GAME,. S INCE HE .DI D N' T PUT I N APPEARANCE ALTHOUGH HE HAD\nSPECIAL, INVIT-ATION.. > ...\nIn December, Pll be representing NAEB at dedicatory program of WTTW\nin Chicago. Think Skornia will be -there* too. That1ll be December\n11th. A' week earlier* say about December 5> Skornia and Schooley w.jll\nbe busy i/,i th officials of the W. K *, Kellogg Foundation in Battle Creek.\nThere'll be a JCET meeting -in. Wash ington on December. 1 5th. P ll be\nTHERE •\nI -HOP-.E TO; VISIT WITH JOURNALISTS AND; ,BRO.ADC ASTER S AT THE UNIVERSITY\nof 'Missouri and at Notre Dame, come some days thi.s month, too. It just\nHAPPENS THAT THE ILLINOIS BASKETBALL TEAM. WILL PLAY. i.N THESE SPOTS,\nSO I C.AN DOUBLE, UP ON BUSINESS. . -\nSomewhere Pm supposed to find time for a 1956 Convention committee\nmeeting in Atlanta. Maybe I will. Oh yes, there are six Illinois\nBASKETBALL GAMES IN DECEMBER:, AND. I HOPE TO SEE ALL. . AND, CHRISTMAS\nIS COM ING . *\nDon't think we don't look ahead, either. Hotel arrangements for the\n1 957 Convent 1 on have tBEEN made by Marguerite Fleming. Same goes-for\n1956.* So.-here's dope: ... ,\n1956 Convention, October 16-18, Biltmore Hotel, Atlanta.\n1957 Convention, October and November 1 2c 2, Statle'r\nHotel, „$ t. Louis. .\nHere's a chance to give yourself a Christmas present. Plan now to\nATTEND THE 1956 AND 1957 conventions.\nTq<each and all, A Merry Christmas and A Happy New Year'.\n--Frank E. Schooley"
}