{
  "id": "d1525-2",
  "text": "' ‘ ' ' • • • ^ j -T\\ _ • ; r -\nHe at Control. No. station dn the: Metropolitan area provicLes.as much regular con¬\ntinuous information 'on the rent problems of \"'City dwellers as. are contained in\nthe New'To'rk Citv Pent Commission.broadcasts, conducted by the Chairman of the Hent\nCommission over. WNYC on. Thursday nights;.\nWe have utilized the resources of: the-College:;of the City of New York,\n'-Queens [College,' Hunter College,- Brooklyn- College and New. York University in\nthe broadcast of .forums and: debates on social1,, economic and political issues,\nespecially those' of local import. : These discussions of -public is sues attract\ntheir greatest audiences during nighttime hours,1 and many such local issues have\nbeen presented to the public -in this form solely- by*' WNYC. I-have, in ..mind parti¬\ncularly the broadcast of the Transit Hearings direct from the Board of Estimate\nChambers 'which 'lastedtwo days arid two •\"nights,- The nickel.'fare,.was and is an\next'reijiely’ ■important 'issue In new -York City. ' Hundreds of .representatives of\nvarious organizations,*' as well as individuals themselves, appeared, before .WNYC' s\nmicrophones when they expressed their views concerning this issue before New\nYork City's Board of Estimate, as a result of these broadcasts tnousands of\npieces of mail were received, and we like to believe, that the airing of these\nhearings' had a great deal to do with the crystallization of public ^opinion and\nwith a fuller dnderstandirig of :-the-many problems: involved-in the issue. No other\nstation in New York City provided this service on such-a scale and. if ..WNYC .did\nnot enjoy the temporary special service authorization,:* tnis service.-would not,\nhave been available to'the people of the City of .New■ York. Permit me to, point out\nthat this particular broadcas t- attracted wide .acclaim from the trade paper\n\"VAETETY\", and that publication-presented to WNYC a first award • in-the form of\nits showmanagement plaque-fOr community leadership.\nThe public health is another major area in which WNYC provides a peculiarly\ncomprehensive service. One of the important functions is to disseminate public\nhealtn information- in accordance with the requirements of the-Health Commissioner\nof the City of New-York and of the United States-'Public Health ..Service, We\npublicize and emphasize:the enforcement of local ordinances and laws essential\nto and for the protection of the health and safety of the inhabitants of the\nCity of New York, -- There are more public health-programs on WNYC: than any other\nradio station iri'New York -City.\nThe drive against communicable diseases, especially tuberculosis and\nsyphilis, is constantly being emphasized in our programming.\nThe-'station carries the Academy of M-Odi'eine*.\"Le.ctures to the. .Laity\"., as.-\nwell'as integrated series of programs provided-by--‘the NewuYork County.-Medic.al\nSociety, the Medical ■ Society of Kings. Co-uiity, the Bronx.'County: Me die,al Society,\nthe\" New'York Tuberculosis and Health Association'' dridn the Oral-. Hygiene..Committee\nof the American Dental Society,\nPublic health association functions- and’-meetings are-broadcast..regularly\nby WNYC, and in many instances this service would not be available to the people\nof the City of New: York if; WNYC ’did' not enjoy -the .benefits of. the special temporary\nservice authorization granted by th^ 'Co-imnisSion.- -:\n1948 is the 50th anniversary of -the--co’nValidation of the five boroughs\nof the City of New-York find the establishment-:of-.Greater New-York, Plans have\nbeen proposed for the celebration of the-City ls Golden Jubilee, , WNYC ...already\nhas drawn up plans to broadcast events and functions celebrating New York City's\nGolden Jubilee throughout the year with a special;,emphasis on a proposed -exposi¬\ntion to be held during 1948. The preparation of these plans takes on an air of\nuncertainty because of the temporary character of our nighttime authorization.\nThere are many other programs and services rendered by WNYC in the public\ninterest. I should like to invite your attention to our use of non-commercial"
}