{
  "id": "d1501-3",
  "text": "PROGRESS ON ETV LEGISLATION ADMINISTRATION\nOfficials in HEW and USOE involved in the administration of federal funds for\nETV are making good progress in the development of rules and regulations governing\napplications for grants, and in the acquisition of staff to process them.\nDr. John Bystrom, as Assistant to the Secretary for ETV, and Dean Costin, as 35\nDeputy Assistant, have \"been working closely with Charles Zellers, Executive Officer\nof the Educational Assistance Program (USOE), in whose office the operational respon¬\nsibility will reside. Together with lawyers and specialists from HEW and the FCC,\nthey have been working on formulation of application forms and statements of rules\nand procedures.\nOn July 16 this group met with staff members of NAEB and NETRC in an all-day\nsession to review and react to initial drafts. Changes growing out of this meeting\nare being incorporated in revised drafts to be shown to a task group of ETV people\nrepresenting various regional interests being brought to Washington by NETRC to meet\nwith HEW administrators August 57&• Later in the same month, the NAEB Board is\ninvited to a similar session and the JCEB will confer on August 21.\nNAEB, which has been in almost daily contact with administrators working on the\ninterpretation of the law, sincere disposition of those in charge to\nseek advice and counsel from the individuals and professional organizations closely\nconnected with development of the legislation and the ETV movement. Further encourage¬\nment comes from indications that those in charge are sensitive to the intent to Congress\nthat the bill go into effect fast, that the moneys provided are moved as rapidly as\npossible into the states, and that this be done with a minimum of red tape.\nMeanwhile, Bystrom & Co. is preparing for appearance before the House subcommittee\nin charge of supplemental appropriations probably to obtain funds for the\n1963 fiscal year. Other major problem: securing the right man for the still unfilled\npost of Director of the new branch in USOE charged with processing grant applications.\nRELAXATION IN RADIO OPERATOR REQUIREMENTS\nBie Commission proposes to relax its commercial radio operator rules for certain\nstations so they may use qualified operators with first-class permits on a part-time\nbasis instead of full-time as now required. This would include non-commercial educa¬\ntional FM stations with power up to 25 kw. Such operators would need to be on call\nand be required to check the transmitter at least four times weekly. Comments due &\nOctober 3.\nETV VOLUNTEERS NEEDED FOR COLOMBIA\n( v $ > Pf C • )\nThe Peace Corpses recruiting volunteers to work with Colombians in developing\na national ETV network. Applicants should have fluency in Spanish and be available\nfor a two-year assignment. Positions to be filled: Dir. of Evaluation, Utilization\nCoordinator, Prod. Mgr., Promotion’s Mgr., Graphics-Staging Dir., and two Producer-\nCinematographers . **\n\\ Those accepted will undergo an intensive two-four months training program, part\nof which will be in Puerto Rico.\nColombia has an existing government o-and-o television network, which has been\noperating commercially and doing limited experiments in instructional broadcasting.\nAppl i rants , d conf a .Vfoffh 1 -\np(x%i A U - TljujAA^v , , ^\nei* fcc- flocf \\\n|^vv c\\ dUOCC bntfc* VftF *i*>"
}