{
  "id": "d1751-0",
  "text": "NEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 28, NO. 2 FEBRUARY, 1963\nr\nr\n1963 NAEB Committees Announced\nEnclosed with this Newsletter is an insert naming the various\nNAEB committees and their members for 1963. Although\nmost chairmen will be contacting their committee members\nshortly, this announcement in the Newsletter is the only offi¬\ncial notification of appointment members will receive.\nThree new committees have been named for this year:\nETV Commissions Committee—made up of representatives\nfrom state ETV commissions, to serve as liaison between\nNAEB and state commissions.\nPlanning Committee—a Board committee, to assume the func¬\ntions of the old Development Committee, which was dropped\nthis year because of the opinion that such functions could be\nbetter performed by a Board committee.\nInstructional Radio Committee—analogous to the Instructional\nTV Committee.\nThere are 200 people serving on the 22 committees, with 27\nappointees who did not serve on a committee last year.\nIn addition to the Development Committee, three others\nwere dropped this year: Grants-in-Aid, because grants are\nnot being awarded at present, and when they are, an ad hoc\ncommittee will be named; Live Network Committee, to await\ndevelopments of EEN and the proposed network of the Big\nTen area; History and Archives, because the task of as¬\nsembling educational broadcasting materials is virtually im¬\npossible for a committee and it is hoped that the NAEB Of¬\nfice of Research and Development will be able to undertake\nthis.\nNAEB Board Chairmen Elected\nRichard B. Hull, Region III TV representative, has been re¬\nelected chairman of the NAEB Board. Ken Kager, Region VI\nradio representative, has been re-elected chairman of the\nRadio Board, and Dr. John Schwarzwalder, Region IV TV\nrepresentative, has been elected chairman of the TV Board.\nAustin Selected\nThe 1964 NAEB convention will be in Austin, Texas. This\nis in line with the recommendation of the Permanent Con¬\nvention Committee presented at the Philadelphia convention\nlast fall.\nRadio Stations May Air \"Meet the Professor\"\nEducational radio stations in certain locations may obtain per¬\nmission to broadcast the 26-program series Meet the Professor,\ncurrently appearing on many ABC radio and TV stations.\nEducational stations in coverage areas where the series is not\nbeing broadcast by an ABC affiliate may obtain a letter from\nthe ABC affiliate stating that it does not plan to air the\nseries. This letter, along with a request to broadcast the series\non educational radio, should be sent to Wiley Hance, Man¬\nager, Public Affairs, ABC, 7 West 66th St., New York 23.\nMeet the Professor is produced by the Public Affairs De¬\npartment of ABC News in cooperation with the Association\nfor Higher Education, NEA.\nNAEB To Install ETV in Samoa\nOn December 22, 1962, the NAEB signed a contract with the\nGovernment of American Samoa whereby the Association\nagreed “to perform certain engineering, technical installation,\ngeneral supervision and training . . .” in connection with the\ninstallation of educational television in American Samoa.\nIn brief, the contract calls for the NAEB to design, super¬\nvise, procure and install a three-channel (later to be expanded\nto six) ETV system for the schools of American Samoa, and\nrecruit and train technical and instructional personnel to\noperate the system. Since the contract called for work to com¬\nmence within 30 days of signing, an exploratory trip by key\npersonnel was made in mid-January.\n1963 NAEB Convention Dates\nMarch 17-19—Region III meeting, at the new Kellogg Center\nat the University of Chicago.\nMarch 29-30—Region II meeting, Tampa.\nNovember 17-20—National convention, Hotel Schroeder, Mil¬\nwaukee.\nNAEB Study Lists 2,583 UHF Assignments\nLast month the NAEB submitted its report to the USOE on\nthe study which used electronic digital computer methods to\ncalculate the most efficient and usable distribution of avail¬\nable TV channels across the nation. This study was done\nunder a contract signed with the USOE last June.\nAt the time the study was undertaken, it was hoped that\nthe final distribution would add more than 1,000 channel al¬\nlocations to the table without disturbing previous assignments.\nActually, the study located 1,018 additional channels. Beyond\nthis, as an experiment in saturation, the computer selected\nanother 715 channels—thus providing the ultimate figure of\n3,298 as reported in the Washington Report and elsewhere.\nDuring the study, information about the precise location of\nthe community, the size of the urban area, the current chan¬\nnel assignments, all FCC rules and regulations governing the\nassignments, the relative size of the area, and its educational\npriority was fed into the computer. These data are stored on\ntape and can be retrieved at any time for further studies.\nIERT to Meet Later This Year\nJune 12-14, 1963, are the dates for the 33rd annual Institute\nfor Education by Radio-Television at Columbus, Ohio. Theme\nand program are to be announced soon.\nIn order to be eligible for the awards, films and tapes of\neducational programs must be delivered to IERT headquar¬\nters by February 15.\nRay J. Stanley has been named acting director of the IERT;\nI. Keith Tyler, currently on leave in Egypt, will continue in\nan advisory capacity.\n1"
}