{
  "id": "d1751-3",
  "text": "\"Seminars (like those for executives and industry) are needed\nfor professors — for exchanging experiences in teaching —\nand stimulation by outside specialists.\"\n\"Too much of adult education has been an extension of a\nsystem devised for and. centered on youth: 'The best years\nof our lives.1 We need to begin to emphasize 'the best is yet\nto come'.\"\n\"Our educational system has come from a pre-metropolitan\nera. We have not yet found the educational structure to fit\nthe new pattern of our new metropolitanism and urbanization.\"\n\"We create self-expression in our elementary schools and\nstamp it out in our secondary schools, colleges and universities.\"\nThanks to new machines, new types of research are possible.\n\"We can compute things we couldn't have attempted to survey\nbefore.\"\n\"We shouldn't be attempting merely to 'catch up' with\nRussia, educationally, diplomatically and militarily.\n\"Few educators see a need to participate in decision-making\nat top policy levels.\" To what extent can we arouse our own\ncolleagues to such participation?\nAnd finally, from Wanda Mitchell at the NAEB Convention:\n\"You can't hold back the sunrise. You can only say: 'I don't\nwint to get up'.\"\nNot all these quotes are exact. They are based on\nnotes. Some combine thoughts from several people.\nTo many I’ve added a little in “application.” To the\nmany fine speakers from whose distilled wisdom\nthis is taken, our thanks.\nI know some will say: What’s that got to do with\nthe NAEB, or broadcasting? A lot, I think. But I’ll\nbe glad to have your reaction.\nMeanwhile, may I, too, wish you a rewarding,\nrestful and happy holiday season?\nPARENTS BLAMED FOR NEW CHILD DISEASE\nAssociate Professor Edward Stasheff at the 28th an¬\nnual Parent Education Conference at the University\nof Michigan warned his audience to watch for a new\ndisease in their children—“rigor kinescopis.”\n“If your kids get it, you have only yourselves to\nblame,” he said.\nHe described the symptoms of the disease as a\nglazed lqok in the eye, accompanied by an ache-all-\nover feeling, drowsiness and extreme wear on the\nTV-room furniture.\nThe cure, said Stasheff, lies not so much in an\noutright prohibition of TV viewing by children, but\nin improved programming to meet their needs, and\ngreater selectivity in the viewing habits of their\nparents.\n“Television has, on the whole, avoided the pro¬\ngramming excesses of radio in the 30s and 40s,” he\ncommented. “Children’s TV programs have, in the\nmain, not been harmful. At worst, they have been\ntime-wasters and habit formers. But they have\nnot always made a positive contribution to the child’s\ngrowth.\n“On the other hand, programs designed primarily\nfor adults have indicated some negative effects on\nchildren who were not supposed to be watching them\nin the opinion of broadcasters. Except in isolated\ncases, however, the emphasis on crime, on bawdy\nexcitement, on sensation and tension have not been\nproved to be harmful.”\nNoting the prevalence of “rigor kinescopis” among\nadults, Stasheff said a recent report showed nearly\n85 million Americans watch TV daily, spending an\naverage of better than 18^ hours weekly at this\npastime.\nFCC ACTION\nIn a petition to the FCC, the Western Television Co.\nasked that a proceeding, which resulted in an exam¬\niner recommending a grant for the operation of a\nnon-commercial station on channel 5 at Lubbock,\nTex., by Texas Technological College, be reopened\nfor further hearing, with Western participating as a\ncompeting applicant for the channel.\nWestern claims that the proposed non-commercial\noperation on that channel by Texas Tech involves an\neffort to suppress competition in the area.\nThe examiner in September proposed the grant to\nTech, but the FCC announced later it would take no\nfurther action until it examined Tech’s financial\nplans. The Commission said it was particularly in¬\nterested in getting more information on an announced\nproposal by Lubbock stations KCBD-TV and KDUB-\nTV to donate $30,000 each toward construction and\noperation of Tech’s proposed educational station.\nThis proposal was termed by attorneys for Western\nas “an unusual financing plan.”\nWestern is owned by David P. Pinston and Leroy\nElmore, who operate Lubbock radio station KDAV.\n^ WTVS, Detroit’s non-commercial educational TV\nstation, has been granted its license by the FCC,\nFranklin G. Bouwsma, newly appointed executive\nsecretary of the Detroit Educational Television\nFoundation, has announced.\nIn making the announcement Bouwsma com¬\nmented on the station’s growth in its two years of op¬\neration. During the first week of broadcasting in Oc¬\ntober, 1955, WTVS carried five hours of programs;\ntoday it is broadcasting more than 60 hours of pro¬\ngrams each week.\nWTVS is the fourth UHF educational station in\nthe United States to be granted its license.\n^ The FCC has authorized the regents of the Uni-\n4\nNEWSLETTER"
}