{
  "id": "d1751-4",
  "text": "versity of New Mexico and the Board of Education\nof Albuquerque to operate a new noncommercial\neducational TV station at Albuquerque on channel 5.\nOSU AWARDS\nEntries for Ohio State University’s 1958 American\nExhibition of Educational Radio and Television Pro¬\ngrams will close Jan. 2, 1958, according to Dr. I.\nKeith Tyler, director of the University’s Institute\nfor Education by Radio-Television.\nPurpose of the exhibition is to further the broad¬\ncasting of significant educational programs by sing¬\nling out for special honors outstanding series broad¬\ncast in the U. S. and Canada.\nJudging will be done in cooperative evaluation\ncenters located throughout the nation, with each\ncenter being responsible for the evaluation of all\nprograms in a particular class. Radio awards will be\nmade in 10 program classes and the TV awards in\nseven.\nWinners will be announced May 12, 1958. The\nprize-winning programs will be available for review\nat the annual Institute meeting in Columbus May\n12 through 15.\nEntry blanks and additional information may be\nsecured by writing to Dr. I. Keith Tyler, Institute\nfor Education by Radio-Televison, Ohio State Uni¬\nversity, Columbus 10, Ohio.\nNth ANNUAL RADIO AND TELEVISION\nCONFERENCE\nDelegates from seven western states will meet at\nBellevue Hotel in San Francisco for the 11th annual\nWestern Radio and Television Conference Feb. 13\nthrough 15, 1958.\nOrganized in 1947, the Conference was established\nto provide an annual meeting on the West Coast for\nan exchange of ideas among broadcasters, educators\nand students who share an interest in the greater\nuse of cultural and public service aspects of broad¬\ncasting.\nThe 1958 Conference will feature informal provoca¬\ntive sessions pinpointing the problems, needs and\ncurrent developments of public service programming\nfor radio and TV. In addition, a prominent panel of\nexperts will discuss the pros and cons of pay-TV.\nAdditional information on the Conference can be\nobtained through Ronald L. Hunt, 3712 Starr King\nCircle, Palo Alto, Calif.\nNAEB FORUM\nStarting with the January Newsletter, our readers\nwill be given an opportunity of discussing pertinent\neducational broadcasting problems and ideas in a\ncolumn titled the NAEB Forum.\nReaders who are interested in sharing their\nideas, experiences or suggestions with other educa¬\ntional broadcasters, are hereby invited to write us\nabout them for the purpose of publication.\nContributions will be edited to meet space re¬\nquirements.\nNARTB CHANGES TO FORMER NAME\nMembers of the National Association of Radio and\nTelevision Broadcasters voted on Nov. 15 to revert\nto the organization’s former name, the National As¬\nsociation of Broadcasters, effective Jan. 1.\nA count of the mailed ballots showed 1,227 mem¬\nbers favoring the shorter name with 35 opposed.\nThe business association of the broadcasting in¬\ndustry was organized in 1922 as the National As¬\nsociation of Broadcasters. This remained the name\nuntil 1951 when the name was changed to National\nAssociation of Radio and Television Broadcasters\nfollowing a merger with the Television Broadcasters\nAssociation.\nMembership of the organization currently is com¬\nposed of 1,727 radio stations, 319 television stations,\nthe four national radio networks, and the three\nnational television networks. In addition there are\n117 associate members from fields allied to the broad¬\ncasting industry.\nGOVERNMENT ETV PROPOSED\nA proposal that the government buy top quality,\ncommercial TV time for educational programs was\nmade by Garnet R. Garrison, University of Michigan\ndirector of television.\nGarrison, while addressing the Ann Arbor Rotary\nClub, suggested the government might exercise the\nright of eminent domain to reach mass audiences\nthrough the regular channels and thus further the de¬\nvelopment of the nation’s scientific and intellectual\nprocesses.\nEducational programs on commercial stations,\nGarrison feels, are ineffective because they are usually\nscheduled when few persons are watching. Neither\ndoes he believe that the few existing educational sta-\nDECEMBER, 1957\n5"
}