{
  "id": "d1751-8",
  "text": "bolt through the mast enables the antenna to be\noriented for maximum response. A short mobile\nrun (100 ft.) is then made with the antenna at 80\nfeet. An average value of field strength is taken\nover this run as the measured field. The mast is\nthen lowered and secured and they’re off to the next\nmeasurement.\nRob Beldon, WILL chief engineer, says the mast\nand channel iron cost less than $15 including one mast\nwhich was bent before they decided that the bracing\nshown was necessary. The field intensity meter is\nmounted temporarily on a desk in the truck with\npower supplied by the truck battery. Beldon may\nbe seen in front of the truck. If you look closely,\nClarence Berbaum may be seen inside the truck and\nA1 Saldeen could be seen at the right of the picture\nif we hadn’t cropped it to fit the column.\nThe FCC also recently denied a petition which\nasked that UHF stations be permitted to broadcast\nmusic and other purely aural programs while tele¬\ncasting still pictures and slides for a part of the broad¬\ncast day. The FCC rule is that television aural and\nvisual transmissions must comprise integral parts of\nthe announcement or program and have a substantial\nrelationship with each other.\n*****\nThe first production model of the Ampex Video¬\ntape Recorder is scheduled to be completed in Nov¬\nember. Among the new features announced by Am¬\npex are complete interchangeability of tapes among all\nproduction units and a means of editing the recorded\ntapes without loss of synchronization. Production\nmodels are priced at $46,000 and a delivery schedule\nset up earlier this year is expected to be maintained\nin spite of a strike which shut down production for a\nmonth this summer. Over 100 units have been or¬\ndered to date.\n*****\nAn excellent paper on “Television Film Stand¬\nards” was presented at the recent SMPTE Conven¬\ntion in Philadelphia. The authors are K. B. Benson\nand J. F. Whittaker of CBS Television in New York.\nIn the paper, standards for control of the combined\nmotion-picture and TV system are developed by an\nexamination and correlation of the relationships be¬\ntween the two component processes and the effects\nupon the end product. It’s a paper of interest to all\nTV engineers and will no doubt be published soon in\nthe SMPTE Journal.\nIncluded in the seventy four papers presented at\nthis five day meeting was one by John R. Brugger,\nChief Engineer of the Washington County Closed\nCircuit Television Network. John’s paper covered a\ndescription of the equipment and the facilities used\nat Hagerstown.\nWhile in Philadelphia we had the opportunity of\nvisiting the studios of WHYY-TV and being con¬\nducted on a tour of their new facilities by Samuel\nBarbour, Chief Engineer. He reports that present\nprogramming from 9:00 a.m. to 3:15 p.m. is primarily\nfor in school use. Programming will be expanded later\nto include evening hours. Reports of excellent re¬\nception on Channel 35 are very encouraging, Mr.\nBarbour states. WHYY-TV has a 12y2 KW RCA\ntransmitter with an ERP of 155 KW from a 500 foot\ntower.\n* * * * *\nA television film camera for $89.50! That’s what\nMerlyn Rawson paid for a surplus iconoscope camera\nwhich he has modified for use at the University of\nSouthern California Telecommunications studio at\nLos Angeles. While the definition can hardly be cal¬\nled broadcast quality, (about 250 lines) this ike chain\nenables them to integrate film and slides with live pic¬\ntures from the vidicon cameras used in teaching TV\nproduction.\nThe unmodified camera has free running oscillators\nand internal sync such that the video signal is suitable\nfor feeding a monitor. However, the modification\nnecessary to use standard RETMA pulses is very\nsimple. A type 1846 iconoscope tube is used as the\npick up tube. Since this is not available from stock,\na spare camera tube was provided by purchasing a\nsecond camera. By the use of a simple mirror multi¬\nplexer, pictures from either a slide or film projector\ncan be projected directly on the mosaic of the icono¬\nscope.\nThe camera filaments operate from a 28 volt dc\nsupply although instruction sheets furnished with\nthe camera provide for AC operation by filament and\nplate rectifiers. A plate voltage of 400 volts at 175\nmils is required as well as 50 volts of bias. This\ncamera was built by RCA for aircraft use. We can\ntell you where it may be obtained on the West Coast\nalthough we’ve seen it advertised elsewhere. The data\nDECEMBER, 1957"
}