{
  "id": "d1751-9",
  "text": "sheets mention this camera as belonging to the ATK\nor ATJ series although the heading is Television\nCamera CRV-59.\n*****\nA new list of available FM, and FM-AM combina¬\ntion receivers on the market has been compiled by\nRay Cheydleur of WFSU-FM at Florida State Uni¬\nversity. They are including the list in their fall pro¬\ngram bulletin recently released. With the thought\nthat other FM stations may want to include the list\nin their program bulletin or offer it to listeners, Ray\nhas supplied us with a number of copies of the list.\nWe’ll be glad to send it to you upon request.\n*****\n“Fundamentals of Light and Lighting,” Bulletin\nLD-2 of the General Electric Company, is an 86\npage text covering lighting terms, measurements,\ncolor systems and design fundamentals. Dick Lawson\nof the WILL-TV staff recommends it highly and\nuses it as a reference in his course work in TV pro¬\nduction. If you’d like a copy, write to the Inquiry\nBureau General Electric Co., Nela Park, Cleveland\n12, Ohio. They also have available a multilithed list\nof lamps for studio and theatre spotlights and flood¬\nlights. It covers lamps for virtually all of the units in\nuse in television studios. It might be helpful to our\nreaders in selection of proper lamp types for studio\nuse.\n*****\n“Operation Shoestring” a television project of the\nSchenectady Public Schools received considerable\nnotice in the trade press last summer. A letter from\nMr. Bernard F. Haake, Administrative Assistant, ex¬\nplaining the project, arrived too late to be included\nin the October Newsletter. Perhaps the point most\nemphasized last summer was that the system cost\nonly $3000.00.\nMr. Haake states that they did not intend to\nimply that a Complex closed circuit television installa¬\ntion could be obtained at this price. The purpose of\nthe project was to place minimal equipment in the\nhands of teachers so that they could become ac¬\ncustomed to working with it. The teachers did use\nthe equipment, and now regard television in the same\nlight that they regard a tape recorder or movie pro¬\njector.\n*****\nThe equipment used a GPL vidicon camera and\nmonitor, which fed used television receivers purchased\nfor the project and installed in three rooms adjacent\nto the transmitting classroom. Speakers were bor¬\nrowed from film projectors to supply audio and room\nlighting was supplemented by photo floods in the\n“studio.”\nMr. Haake believes that many school systems\nwould be willing to spend $3000, as they did, to be¬\ncome familiar with this new medium and to see for\nthemselves that it has application and value to edu¬\ncation. Then they might be willing to consider more\nelaborate systems involving perhaps $40,000 to equip\na high school of 2000 students.\nMerry Christmas and a happy New Year\n—NAEB—\nNETWORK NEWS\n— Bob Underwood\nAll contributors of programs to the NAEB Radio\nNetwork will receive certificates of recognition suit¬\nable for framing. The first certificates will be issued\nto contributors of series for the first quarter, 1958,\noffering and the 1957 and 1958 in-school offering.\nAdditional certificates will be distributed at the be¬\nginning of each future quarter.\nThe nine by eleven-inch certificates will be worded:\n“ (Title of Series) produced by (Station or Organ¬\nization) has been selected for distribution to the\nstations of the National Association of Educational\nBroadcasters Radio Network. Recognition is hereby\ngiven to this contribution to the educational broad¬\ncasting movement.”\nThe certificates will be signed' by the executive di¬\nrector of the NAEB and by the network manager.\nThe idea of this procedure originated with the\nRadio Network School Committee, whose plan had\nsuch merit that it was decided to distribute certifi¬\ncates to all network contributors.\n*****\nRadio Station WUOM, University of Michigan, is\nworking on a very original and interesting series for\nthe network. This series is attempting to bring the\noutstanding musical activities of our colleges and\nuniversities to the radio audience of NAEB by means\nof 13-hour programs, each of which will be devoted\nto musical organizations from one or more education¬\nal institutions.\nIf you would like to contribute to this series please\ncontact Mr. E. G. Burrows, Assistant Director of\nBroadcasting, Station WUOM, University of Michi¬\ngan, Ann Arbor. You are urged to contact Mr. Bur¬\nrows as soon as possible since actual pfoduction of\nthe series will begin in the near future.\n*****\nThe NAEB Radio Network announces that it needs\nsubmissions particularly in the 30-minute segment\narea, although submissions for any time segment are\nalways welcome. Outside of the grant-in-aid series\nfew submissions of 30-minute program series are re¬\nceived. Write to the network manager for details on\nhow to submit series.\n10\nNEWSLETTER"
}