{
  "id": "d1505-1",
  "text": "National Commission for UNESCO.\nThe 100-member National Commission serves to\nadvise the State Department on UNESCO affairs in\nrelation to American policies. Members are selected\nto represent national voluntary organizations and\nfederal, state and local governments. Terms are for\nthree years and members may be re-appointed.\nAppointed to the National Commission with Dr.\nSkornia were Howard Hanson, Director of the East¬\nman School of Music at the University of Rochester;\nHerman Finkelstein, General Attorney for the Ameri¬\ncan Society of Composers, Authors and Publishers;\nJoseph Dainow, Professor of Law at Louisiana Uni¬\nversity, and The Very Reverend Monsignor Francis\nJ. Lally, editor of the Pilot, a weekly newspaper pub¬\nlished in the Roman Catholic Archdiocese in Boston.\nFAE GRANTS ANNOUNCED\nThe Fund for Adult Education has announced names\nof the,.53 newspapermen, radio-TV broadcasters, edu¬\ncators and other persons chosen for their fellowship\ngrants. Nearly a quarter of a million dollars has been\ngranted for study and training during 1957-58.\nInteresting to note among the grant recipients\nwere names familiar to NAEB members. Graydon\nAusmus, director of broadcasting at the University of\nAlabama, will work on his doctoral dissertation on\neducational broadcasting in the U. S., at New York\nUniversity.\nClarence Flick, director of radio-TV at the Uni¬\nversity of Nebraska, will study writing and pro¬\nduction at UCLA with interneship at commercial\nnetwork production centers. Nazaret Cherkezian, as¬\nsistant to the director, Office of Radio TV, New York\nUniversity, will study public service TV programming\nin Boston, Philadelphia, Washington, and other\ncities.\nAlso, applications for the 1958-59 Leadership\nTraining Awards Program opened the first of this\nmonth. Recipients of the grants are expected to par¬\nticipate in a one-week institute in July, 1958. Apart\nfrom this, candidates are free to propose any program\nof study they deem appropriate.\nApplication blanks are available from: Leader¬\nship Training Awards (Mass Media), The Fund for\nAdult Education, 320 Westchester Avenue, White\nPlains, New York.\nGREETINGS FROM THE PRESIDENT\n—Burton Paulu\nWhat does the president of NAEB do?\nThe constitution says he is “responsible for the man¬\nagement of the affairs of the Association and . . .\n(for) carrying out the policies . . . (set by) the Board\nof Directors.” That’s a pretty broad statement!\nFor me, the NAEB presidency has meant, among\nother things, a lot of reading (you ought to see my\nmail!), much writing (at times it takes two secre¬\ntaries to keep up with my output), and a good deal of\ntraveling (despite a firm resolution to hold trips to an\nabsolute minimum).\nImpressed with the magnitude of my task, I set\nout in December, while still president-elect, to orient\nmyself for the new office. First I went to NAEB\nheadquarters in Urbana, where I talked at length,\nand with great profit, to retiring president Frank\nSchooley, as well as to Executive Director Harry\nSkornia and his excellent staff.\nI wish every NAEB member could visit Urbana,\nso that “14 Gregory Hall” wrould become an experi¬\nence rather than Just an address. Never have I seen\na harder working, more conscientious group of people,\nthan our Headquarters staff. They are short of space,\nshort of help and short of funds—but long on work\nand marked by devotion to the cause. December also\ntook me to Washington, New York, East Lansing and\nAnn Arbor.\nIn the middle of January, as February’s News¬\nletter has already reported, the Executive Committee\ncame to Minneapolis to lay its plans for 1957. Later\nthat month I spent a day in Columbus with Keith\nTyler and the committee planning the IERT meeting.\n(It seemed strange to be in Columbus with snow on\nthe ground!)\nI was impressed with the attention Keith and the\nother committee members (including NAEB Vice\nPresident Dick Hull, and honorary member Judith\nWaller) gave to the criticisms sent in after last year’s\nInstitute. This year’s IERT should be a good one.\nWatch the increase in commercial station participa¬\ntion, and note especially the NAEB utilization pro¬\ngram on May 8, and luncheon on May 9.\nFrom Columbus I went directly to Purdue for the\nRegion III meeting. The program was good; but what\npleased me most was the large number of new faces.\nThis is very important, since it indicates the exten¬\nsion of our membership far beyond the so-called “old\nguard.” (By the way, just who are the “old guard”?\nI hear the term used implying both praise and\ncriticism, but don’t know exactly to whom it refers,\nnor whether I am old—or new—guard.)\nIn February I went to a meeting in Ann Arbor.\nThere Dick Vogl (chairman of the Program Accept¬\nance Committee), Ned Rosenheim (chairman of the\nGrants-in-Aid Committee), Harry Skornia and I met\nwith representatives of the ETRC to discuss their\nexciting new proposal to spend up to $100,000 a year\nfor 3 years to support radio programs. (Who says\neducational radio is dead?) By now announcements\nof the first year’s plans have been distributed.\n2\nNEWSLETTER"
}