{
  "id": "d1505-3",
  "text": "MEMO FROM THE EXECUTIVE DIRECTOR\n—Harry Skornia\nMajor efforts during the month were devoted to pro¬\ngram planning for radio. In late February a meeting\nwas held at the Center in Ann Arbor to plan the best\nuse of available funds for radio programs for the\nNAEB Radio Network. By the time this reaches you,\nthe new announcement of Grants-in-Aid available\nshould be in your hands. Funds available should\ngreatly strengthen network offerings for the next\nthree years in the radio area.\nCoordinated with this is the Radio Programming\nSeminar to be held at Allerton House, April 22-24, for\nradio program planners and directors. With these\ncombined resources and efforts, it is hoped that con¬\nsiderable improvement will be noted in network\navailabilities. Some problems which still plague the\nnetwork are left to Bob Underwood, Network Man¬\nager, to discuss.\nConsiderable effort is also being made by a Sub-\nCommittee of the Professional Advancement Com¬\nmittee—composed of Leo Martin (Chairman), Ver¬\nnon Bronson and Carl Menzer—to move forward\nwith steps aimed at establishing increased profession¬\nalization and standards for educational broadcasters.\nIf you have suggestions, I’m sure any member of the\nSub-Committee would welcome them.\nDuring the month, following notification of my\nappointment to the U. S. National Commission for\nUNESCO to represent NAEB (which is therefore\nnow a member), I also agreed to serve on the Ad¬\nvisory Committee to the Sixth UNESCO National\nConference to be held in San Francisco in November,\nand met with that Planning Committee in New York,\nMarch 21 and 22. At that time I also looked in on\nMETA, the first time I’d seen the New York studios\nof our most active TV member.\nConsiderable progress was made last month in\nclearing and integrating membership files as a result\nof the recent merger with the AERT. If any of you\nduring this interim period have received more than\none copy of the Newsletter and Journal, please be\npatient. If you’ve been missed, please let us know.\nAs soon as all records are fully reorganized (by Frank\nSchooley who is working on it every spare moment he\nhas) there should be no more such problems.\nAs this is written, meetings have been held by the\nSpecial Planning Committee for the Radio Program\nSeminar (Ned Roseheim, Richard Vogl, Lee Dreyfus,\nplus Paulu, Hill and Skornia), Foundation Reports\nand Relations are moving forward, a meeting is plan¬\nned with Marguerite Fleming to start the wheels\nturning on the 1957 Convention in St. Louis (October\n30-November 2), two NAEB sessions are being plan¬\nned for the Annual Institute in Columbus, and plans\nare moving forward for Regional Conferences in\nPittsburgh and (probably) Atlanta.\nIt is our hope to see many of you at one or more\nof the many meetings which will bring NAEB mem¬\nbers together in the coming months. These meetings\nprovide a fine opportunity to discuss Association\nproblems, as well as common (interests) of other\nsorts together.\nMeanwhile, please let us hear from you with news\nor pictures you think would be interesting to other\nNAEB members. Such intercommunication is one of\nthe most important functions we, as an Association,\ncan perform.\nREPORT FROM PARIS\n—Keith Engar\nThe French Broadcasting System is soon to release a\nseries on music from the French Ballet. In addition to\nthe music, a major feature will be the critical notes of\nHenri Barraud, eminent French musician and critic,\nwho places each selection in its historical perspective,\nproviding background which increases our apprecia¬\ntion of the music. Madame Paz and her associates\nhave designed this excellent series especially for\nNAEB stations.\nThis will probably be the last report from Paris,\nsince we hope to be travelling during the next few\nweeks. We have surely learned the true meaning of\n“French courtesy” during our stay. Mr. Robida and\nhis staff, and, of course, the incomparable Madame\nPaz, have all extended favors and assistance which\nhave made the year a grand one.\nOur two countries have a great deal yet to learn\nabout one another in spite of our close ties for nearly\ntwo centuries. The excellent programs the French\nBroadcasting System prepares for NAEB release arc\nimportant, not only because of their intrinsic cultural\nworth, but because of the otherwise unavailable in¬\nformation they give us about France.\nOne of the unlooked for benefits of this year’s ex¬\nperience representing NAEB in Paris has been in¬\ncreased pride in U. S. educational broadcasting as a\nprofession. I have learned how much NAEB has done\nto create respect in Europe for U. S. radio and TV.\nThis is a tribute to the brillant work done by Sey¬\nmour Siegel (everybody in Europe, but everybody,\nknows him as “Sy”) and the committee he heads, to\nthe effectiveness of the day to day operations of the\nNAEB Headquarters staff under the dynamic leader¬\nship of Harry Skornia, and to the strength of the\nelected officers.\n—N A E B~\nMonsieur Maxence Bernheim de Villers of Radio\ndiffusion and Mademoiselle Micheline Chamant were\nmarried February 27, 1957, in Paris.\n4\nNEWSLETTER"
}