{
  "id": "d1505-8",
  "text": "Pictured is the specially-designed chalk board used tor a credit course at WUNC-TV, Chapel\nHill, North Carolina. The chalk board is 4' x 8' and is built on a framework that extends it 15\"\nfrom the wall. Due to the framework and a 5\" chalk tray, the person using the board stands at\nleast 2' from the wall, facilitating back and key lighting and improving camera angles.\nThere is no “hard sell” in the announcement or\nstation breaks, which are quiet and relaxed. One in¬\nnovation is the variety of station identification slides\nused. I can’t recall having seen the same one twice.\nThemes and background music are also appropriate.\nObviously the background of 8 years operating an\neducational FM station is evident in their ETV pro¬\ngramming. Like Jack Gould of the New York Times,\nI was very much impressed. Other ETV stations\nmight learn a great deal by observing WGBH-TV\nprogramming.\n* * * *\nOthers may be interested in the photo on this page\nwhich shows how WUNC-TV mounts a blackboard\nfor use on TV. Actually, the board isn’t black; it’s\ngreen. The framework was built by their staging\nfacilities people and holds the board away from the\nbackdrop. This feature makes possible the use of\nback light and also keeps the performer away from\nthe wall so back light is effective. The supporting\nframe is not covered, as it adds a very pleasing pat¬\ntern to the set.\nNote to those stations or production centers consider¬\ning the purchase of a kinescope recorder. WTTW, the Chi¬\ncago Educational TV Association, has two RCA 16mm kine¬\nscope recorders for sale. These were formerly used by ABC\nand are complete and in operating condition except for\none WP-33 power supply. If you are interested in buying\na kinescope recorder at a bargain price, contact Duane\nWeise, WTTW, 1761 East Museum Drive, Chicago, Illinois.\nTelephone: Museum 4-3800.\nPLACEMENT SUPPLEMENT\nApril I - Young college professor of Radio-TV in East would like\nsummer work in ETV, any phase. Production experience.\nPrefers West, Midwest, or Canada, but all locations con¬\nsidered. Male, 26 married, M. S. Salary open.\nApril 2 - Male, 26, single, M.A., will be in Europe until late in\nthe fall. Has been commercial TV director and wants switch\nto ETV. Location open. $4500.\nApril 3 - Associated producer in commercial TV wants change\nto ETV as producer or director. Has experience in business,\nperforming and directing children and adults. Male, 38,\nmarried, M.A. Location, salary open.\nApril 4 - Radio-TV program director at large university seeks\nsimilar position elsewhere in same field due to lack of\nfunds and facilities where presently employed. Former col¬\nlege instructor with over 10 years experience*. Experienced\nproducer-director and has first-hand knowledge of studio\noperations. Male, 42, married, Ed.D. Location open.\n$7500.\nApril 5 - Male, 24, single, B.S., assistant engineer for com¬\nmercial network TV studio, works on camera blocking, cue¬\ning, applause; desires position in educational broadcasting.\nLocation open. $70/wk.\nApril 6 - Assistant program director for commercial TV station\nwants switch to ETV as instructor or performer-supervisor.\nHas experience as director. Male, married, 37, B.F.A.\nPrefers locate along eastern seaboard. $4500.\nApril 7 - Male, 43, married, B.A., former protestant minister\nwishes start in educational broadcasting. Does not have to\nbe religious programming. Has written two books. Would\nlike to locate where he can work on his M.A. $4800.\nApril 8 - Assistant professor of Speech desires start in edu¬\ncational broadcasting. Has directed a city radio work¬\nshop. Many years experience teaching,. Male, single, 43,\nPh.D. Location open. $6500.\nCar radio ownership has increased 366% in the\nlast 10 years to 35 million.\n10\nNEWSLETTER"
}