{
  "id": "d754-27",
  "text": "4\nMarge Rodgers, WVAN-TV, Pembroke, Georgia\nRosalind Roulston, Box 2784 East Carolina College, Greenville, North Carolina\n(East Carolina College, WWWS r AM - FN|)\nNancy Russell-Tutty, Lexington, Kentucky\nRonald Russell-Tutty, Kentucky Authority for Educational Television, Medical Center,\nUniversity of Kentucky, Lexington, Kentuqky ( Kentucky\nAuthority for Educational Television)\nJerrold Sandler, 1346 Connecticut Ave. NW, Washington D. CT 20036 ( NAEB)\nJ. D. Saumenig, 1830 Pendleton St., Columbia, S. C. (S. C. Broadcasters Association)\nJames W. Sawyer, College of William and Mary, Williamsburg, Virginia t Department\nof Theater and Speech ( College of William and Mary)\nMiss Caroline Scuitti, Division of Communication Services, Bos? 8Q21> University of\nMiami, Coral Gables, Florida 33124 (University of Miami)\nWilliam E. Scott, WETV 740 Bismark Road, NE, Atlanta, Georgia 30324 (WETV Atlanta\nBoard of Education Television)\nRobert L. Shepherd, P. 0. Box 6188 - Acklen Station, Nashville, Tennessee 37212 (WDCN-TV)\nGrady Skelton, 526 Plester Ave., Atlanta, Georgia; (Electronic Equipment Inc.)\nMrs. Lucy Smith, 740 Bismark Road, NE, Atlanta, Georgia. (WETV)\nMiss Christine Smith, 1200 West Beach, Biloxi, Mississippi (feeler AFB, Miss.)\nMrs. Mary Howard SnfSRJsouthern Regional Education Boar<37 130 Sixth Street, NW\nAtlanta 13, Georgia ( S.R.E. B.)\nE. Fred Steele, 439 E, Samford, Auburn, Alabama (Educational Television Dept.,\nAuburn University)\nRonald Stewart, Lexington, Kentucky (Kentucky Authority fdr ETV)\nG. V. Strickland, 330-795 Peachtree Street, Atlanta, Georgia (Sou. Beljl Tel. & Tel. Co.)\nJoseph E. Stuckey, Box X, University, Alabama (Broadcasting Services, Univ. of Alabama)\nCatherine J. Turrey, WETV 740 Bismark Rd. NE, Atlanta, Georgia. ( WETV).\nMrs. Ruth D. Thomas, P. 0. Box 5497, Columbia, S» C. (§TC. ETV. Center).\nJoe Thher, 1900 Barnwell St., Columbia, S. C. (Dixie Radio)\nJerry Tiemann, 2712 Millwood Avenue, Columbia, S. C. ( S? C» ETV Center)\nKary L. Tilley, P. 0. Box 6188 - Acklen Station, Nashville, Tennessee 37212 (WDCN-TV)\nMiss Jane Tuggle, 740 Bismark Rd. NE, Atlanta, Georgia 30824 (WpTV)\nRobert E. Tyler, 78 Cherokee Road, Tuscaloosa, Alabama (Birmingham Area ETV-University\nof Alabama)"
}