{
  "id": "d97-39",
  "text": "KIT NO. 4s »A ROLE FOR EVERYBODY (Selecting and Utilizing the\nTelevision Lesson)M\nGENERAL STATEMENT OF THE FILM:\nFor conscientious teachers who take pride and pleasure in their\njob, the mechanics of creative classroom presentation may involve a\ndisproportionate share of their teaching time and effort. Where tele¬\nvision shares these presentational tasks, the classroom teacher is not\ndivested of control and responsibility, but Is enabled to concentrate\nher (his) unique insights and personal skills on other vital aspects\nof the learning process.\nOne of the most crucial of these is discriminating selection of the\nlesson or lessons to be used. Whether this selection is made by the\nclassroom teacher, the curriculum director, the principal, or the\nsuperintendent, the constant criterion must be what television can do\nfor the learner. Learning is enhanced when the television lesson is\nselected for specific purposes, based on carefully assessed class and\nteacher needs...when the teacher, using the study guide, knows what\nthese purposes are, what to expect for the lesson, and what kind of\nlearning is envisioned in the lesson presentation, and sees to it that\nthe student knows.\nEffective utilization of the television lesson (or lessons) is a\nfully-cooperative process toward shared goals. It consists of those\nactivities and procedures (arising out of and coordinated with the\nlesson) which are carried on in the classroom before, during, and\nafter a television lesson...some basic to learning and common to all\nlearning experiences, some specifically involved in learning with\ntelevision. Prime responsibility for adjusting the lesson’s content\nto the abilities of the particular class and for helping students\nrealize maximum learning from the viewing experience rests with the\nclassroom teacher. But there are no passive roles. Effective util¬\nization presupposes that significant contributions, vital to success,\nwill be made by everybody involved.\nOUTLINE OF CONTENT:\nI. INTRODUCTION: Portraits (by animation) of four teachers\nharassed by problems of lesson preparation\nII. Problems attending classroom presentation\nA. Lack of materials\nB. Inaccessibility of materials\nC. Time and energy demands\nD. Weakness in content areas"
}