{
  "id": "d1689-14",
  "text": "NAME\nORGANIZATION\nMAILING ADDRESS\nLOFFLSR, GENS P. - Program Director, WNAX - 2nd and Capitol, Yankton, S. D.\nLOGAN, CLARA S. - 882 Victoria Avenue, Los Angeles, Calif.\nLONDON, HOWARD J. - Radio Director, National Foundation for Infantile Paralysis, Inc.\n120 Broadway, New York\nLONG, CHESTER S. - Director Production and Continuity, W3NS - 33 N. High St., Cols.\nLONG, MADELINE S. - Consultant in Radio Education, Minneapolis Public Schools -\n424l Alden Drive, Minneapolis, Minnesota\nLONG, WATT A. - Asst. Supt., Portland Public Schools - Clackamas, Portland, Ore.\nLONGFELLOW, MARRY - Teacher, Cincinnati - 4138 Forest, Cincinnati, Ohio\nLOTTRIDGS, J. BURYL - Vice-Pres., Tri-City Broadcasting Company - 1002 Brady St.\nDav enp o r t, I ov/a\nLOVELL, ELLEN - Director Public Relations, National Tuberculosis Association -\n1790 Broadway, New York\nLOWDERMILK, R. R. - Radio Education Specialist, U. S. Office, Education, Wash. D.C.\nLUCKY, URLA - South High School, Columbus\nLUNDQJJIST, HAROLD - Associate Editor, Moody Monthly (WM3I) - 153 Inst. PI, Chicago\nLYMAN, JANE - Radio Specialist, Cglebay Institute - Wheeling, West Virginia\nLYONS, JOHN H. - Director Audio-Visual Education, Enfield Public Schools - Box 142\nThompsonville, Connecticut\nMcALEER, CHARLES G. - Publicity Director Catholic Secondary Schools, Philadelphia\nRadio Council - Wayalusing Ave., and 47th St., Philly, Pa.\nMCALLISTER, ROBERT M. - Georgetown University, Washington, D, C.\nMcCARTY, HAROLD 3. - Director, WEA, Univ. Wisconsin - Madison, Wisconsin\nMcCARTY, RHEA - 4S4-S. Drexel Road, Columbus\nMcCLATCHY, ELEANOR - Pres., McClatchy Broadcasting Company, Sacramento, California\nMe COMAS, MRS. ROSALIE CAIN - Exec. Secy., Baltimore Radio Show, Inc. - 10 S North\nAvenue, Baltimore, Maryland\nMcCRAY, THOMAS C. - National Program Manager, NBC - New York\nMeCUE, DOROTHY JEANNE - Ohio State University\nMcCULLOCH, BILL - South High School, Columbus\nMcCUNS, SHANNON - Asst. Prof., Ohio State University, Columbus-\nMcCUSKNY, ALICE - WOSU, Ohio State University, Columbus\nMeDADE, LUCILLE - Secy., Denver Van Deventur, Columbus, Ohio\nMCDONALD, J. F. - FSA, U. S. Dept. Agriculture - 220 S. loth St., Philadelphia, Pa.\nMcDOUGALL, R. H. - County Agent, Butler County Agric. Extension - Community Bldg. -\nButler, Pennsylvania\nMcGAREY, MARY - Reporter, Columbus Dispatch - 34 S 3rd St., Columbus\nMcGAVRAN, JAMES H. - Continuity Director, WING - 121 N, Main St., Dayton, 0.\nMcGILL, EARLE L. - Radio Director, Radio Directors Guild - 26 E 83rd St, New York\nMcGREEVEY, MRS. GENEVA N. - Ohio State University\nMcHUGH, OLIVE E. - Chief of Evaluation, Radio Education Dept., Toledo Schools -\n1868 N. Cove Boulevard, Toledo, Ohio\nMcINTOSH, OTIS, 0 - Director, Public Relations, Ralston Purina Co.- 835 S 8th St.\nSt. Louis, Missouri\nMeKENNEY, BARBARA M. - Radio Chm., Junior League - 1426 Cedar, Saginaw, Michigan\nMcKIM, JUDSON J. - Director Educational and Religious Programs, WKRC, Cincinnati-\n2754 Observatory, Cincinnati, Ohio\nMcMENAMY, CHRIS - Farm Service Director, WNAX E 2nd and Capitol, Yankton, S. D.\nMcNELLSY, PAT - Director Radio School, Rich’s - Atlanta, Georgia\nMcSTEA, ELIZABETH M. - Director of Public Relations, Camp Fire Girls r 88 Lexing¬\nton Avenue, New York\n- 15 -"
}