{
  "id": "d1689-15",
  "text": "QRGANI ZATION_MAILING ADDRESS-\nMACANDREW, JAMES F. - Coordinator of Broadcasting, WNYE - 29 Ft. Greene PI., Bklyn.\nMACDONALD, WILLIAM E. - Earm Service Director, KFAB - Sharp Bldg, Lincoln, Nebr.\nMACDOUGALL, ROBERT B. - Education Director, WAAT - Newark, New Jersey\nMACEARLAND, BARBARA S. - Promotion Manager, CKLW - 33°Q Guardian Bldg., Detroit\nMACKENZIE, ARCHIE, R. K. — British Delegation to United-Nations, Savoy Plaza Hotel\nMACLATCEY, JOSEPHINE H. - Editor, Education on the Air, OSU, Columbus Jin\nMaDDSN, SAMUEL a. - Acting Chairman, Audio-Visual Center, Va. St. College, Ettrict,\nMADSEN, MRS. ESTHER M. - Director, Radio, WCTU - 3288 Kildare Rd, Cleveland /Va.\nHeights, Ohio\nMAGEE MRS. WALTER V, - Pres. Ecderation Womens Clubs Cleveland - 1283 Gladys Ave.\nLakewood, Ohio\nMAHAN, BRUCE S. - Director Extension Division, SUI, St. Univ. of Iowa - Iowa City\nMaHER, WALTER - Collinwood High School, Cleveland\nMAELOCK, CALO 0. - Continuity Supervisor, V0WO, 925 S. Harrison, Et. Wayno, Ind.\nMALLORY, MARILU - South High School, Columbus\nMALOY, JOHN D. - Program and Production Manager, VIC OP - Copley Plaza Hotel, Boston\nMANCHESTER, ALICE W. - Recordings Librarian, Teaching Aids Lab, OSU, Columbus\nMANGNER, TED - Earm Director, KMQX - 401 S. 12th St., St. Louis, Missouri\nMANN, ROBERT F. - Collinwood Veterans Institute, Cleveland\nMARKEL, HAZEL KENYON - Director Public Service and Education CBS - Earle Bldg, hash.\nMARSHALL, ELIZABETH E. - Program Director, WBEZ-Radio Council, 228 N. LaSalle St./DC\nChicago, Illinois\nMARTIN, EESTUS H. - District Forester, Division Forestry and Parks, El Dorado, Ark.\nMARTIN, J. 0. - Asst, Regional Director, Farm Security Administration r- 342 Mass¬\nachusetts, Indianapolis, Indiana\nMartin, PERRY - South High School, Columbus\nMAELTZ, HOSIER H. - Agricultural Director, KEKA - Pittsburgh, Pennsylvania\nMASON, JAY E. - Pres., James Broadcasting Co. - Jamestown, New York\nMASON, LIN - Vice-Pres., Transcription Sales, Inc. - 117 W. High St., Springfield,0.\nMASON, ED - Program Director, WIBC - Indianapolis, Indiana\nMASTERS, FRANK E. - Actor, Independent Players, - 100 N. Central Ave., Columbus\nMATCHETT, KATHERINE E. - Director, Radio activities, West Technical High School,\nCleveland - 1U78 W. Clifton Blvd., Lakewood, Ohio\nMATCHNESE, MARY - Junior League, Columbus\nMATHER, KENNETH C. - Salesman, Time, Inc, - Chicago, Ill,\nMATHEWS, KAROLYN - Ohio State University\nMATTISON, CHARLES W. - Chief, Section of Education, Division of Information and\nEducation, U, S, Forest Service, Washington, D. C.\nMAXWELL, JESSIGA - Director and Producer, Robert Maxwell Associates - Room 933*\n480 Lexington Avenue, Now York\nMEIZLISH, FLORENCE- Ohio State University\nMSNCHHOFSR, JOSEPH D. - Asst. Prof, Speech, Mich. State College - 621 Kedzio Drive\nEast Lansing, Michigan\nMENZSR, CARL H. - Director WSUI, St. University of Iowa, Iowa City, Iowa\nMEOLA, LIBRADOR K, - Director, Sensory Aids, John Hay High School - 2075 E 107 St.\nMERRIDEW, REG P. - Chief Announcer, WGAR - Statler Hotel, Cleveland /Cleveland\nMERRILL-, BILL - South High School, Columbus\nMERRILL, HOLLIS E. - Radio Workshop, Syracuse University - 108 Berkeley Dr. Syracuse\nMERRILL, IRVING R. - Director KUSD, Univ. South Dakota - Vermillion, S. D. /NY\nMERTZ, GLORIA - Secy to Irwin Johnson, WBNS - 6l9 Hanford St., Columous, 0.\nMEYER, MARY JANE - South High School, Columbus\nMICKELSON, SIG - News Editor, WCCO - 625 2nd Ave.,S., Minneapolis, Minn.\nMILES, JAMES S. - Director, WBAA, Purdue University, W. Lafayette, Indiana\nMILLER, ALLEN - Director, Rocky Mt. Radio Council r 21 E 18th Aye, Denver, Colo.\nMILLER. ANDREW J* - Asst. Director of Research, Pittsburgh Public Schools -\nForbes St., Bellefield Ave., Pittsburgh, Pa."
}