{
  "id": "d1689-19",
  "text": "NAME\nORGANIZATION\nmailing address\nRESCH, MARION - Director of Women's Activities, WPMJ - '..01 W. Boar&man, Youngstown\nREYNOLDS, DANA D. - Specialist in Information, Radio Service, Office of Inform¬\nation, U. S. Dept, of Agriculture, Washington, D. C.\nREYNOLDS, EL3RENCS - Asst. Director of PuThlic Relations, United-Nations Rood and\nAgriculture Organisation - 2000 Mas% Aye., NW, Wash, D.\nREYNOLDS, PAUL E. - Studio Director WD3J, P. 0, Box 150, Roanoke, Va.\nRICE, ALLIS L. - Pres., Univ. of Minn. Radio Guild - 20S 12 Ave SE, Minneapolis\nRICHARDS, HELEN - Antioch College, Yellow Springs, Ohio n\nRICHARDS, NORMA H. - Director Women’s Activities, WSPD - .3d Huron St., Toledo, u.\nRICHARDS,ROBERT K. - Editorial Director, Broadcasting Magazine - Nat 1 Press Bldg.\nWashington, D. C. , . _\nRICHARDSON, MRS. PEARL - Midwest Chairman, Pan-Pacific Wome.i’s Association, NYC\n217 N. Marie, Pratt, Kansas\nRICHARSON, ROBERT NOBLE, JR. - 513 Adams Street, Montgomery 5. Alabama\nRIDLEY, WALTER N. - Pres., American Teachers Assn., Virginia St. college - fuf\nSt. Anthony Avenue, St. Paul, Minnesota\nRIPE, BETTY - South High School, Columbus\nREINHART, EDITH C. - Editorial Assistant, Ohip State University, Columbus\nRITCHIE, WELLS - Supervisor of Press and Information Service, CBC - 35^ Jarvis t.\nToronto, Ontario, Canada\nROBECX, PETER M. - Harm Director, KNX t- 6121 Sunset Blvd., Hollywood, Calif.\nROBERTS, EMMA MAE Radio Director, Community Chest - 123 S. Broad St.. Philly, Pa.\nROBERTS, LUKE L. - Director of Education, KOIN, Portland, Oregon\nROBINSON, ROY E. - Administrative Asst, in charge of Instruction, Public Schools\nof Highland Park — 12541 Second, Highland Park 3> Michigan\nROBISON, BARBARA r 46 r loth Avenue, Columbus\nROBISON, MORRIS M. - 46 - loth. Avenue, Columbus\nROBY, ELIZABETH R. - Guidance Counselor, Bd. of Education, Bklyn. - b Gramercy\nPark, New York\nROCHTE, BEULAH - Tutor - 13S0 E 20th Avenue, Columbus\nROCHTE, NEWTON - Ohio State University\nRODGERS, BEULAH M. - 2701 Connecticut Avenue, Washington DC\nBOEDER, CHARLES A. - Asst. General Manager, WORM ~ Community House, Baltimore, Md.\nB.0GERS, MARIAN S. — , . „• . .\nROGERS, THOMAS A. - Station Manager* PM Radio Station, 25 Main St., Newark, Ohio\nSORER, JOHN ALEX - Director, Bureau of Teaching Materials, Univ. of Virginia -\nBox 14S7, Charlottesville, Virginia\nROSE, MARILYN J. - Ohio State University '\nROSSBEERY, CHARLES r- South High School, Columbus, Ohio\nROSEN, GEORGE - Radio Editor, Variety - 154 W 46th St., New York\nROSENBLUM, SIDNEY - Ohio State University\nROSS, BETTY - Public Service Dept., NBC - Merchandise, Mart, Chicago\nROSSER, PEARL - Director of Radio Education, International Council of Religious\n*. Education, 203 No, Wabash Avenue, Chicago\nROTHEN, MARSHALL G, - Director of Broadcasting, Rutgers Univ., New Brunswick, N. J.\nROTHMAN, MARIANNE - Ohio State University\nROUND, GEORGE - Public Relations Lir©Gtor, Univ, oi Nebr, - 13^0 Idywild, Lincoln\nROWELL, S. J, - Asst. Dir, Information, Production and Marketing Administration,\nU, S. Dept, of *%ri culture, Washington, D. G.\nRUBY, LUCILE - Instructor in Radio, Stephens College, Columbia, Mo,\nRUDICK, NATHAN M. r Chairman, Radio and Television Dept,, New School for Social\nResearch, l6l West l6th Street, New York\nRUDNER, WILLIAM B. - Research, WMPS - 215 Columbian Tower Bldg, Memphis, Tennessee\nRUNYEON, KAY - 132 Aldrich Road, Colurib us\nRUES A, FRANCIS L, - Ohio State University\nRYAN, JACK f Manager, Press, NBC, Merchandise, Mart, Chicago\n20"
}