{
  "id": "d1689-24",
  "text": "NAME)\nQ5.Q-.Auv IZAYX OH\nMAI LIB G- ADDRESS\nWEAVER, JOHN. OEM - Director Education, CBS-WBBM - 4x0 N. Michigan Ave., Chicag\nWEBB, WILLIAM E. - Manager, Public Service Promotion, NBC - 3p Rockefeller Plaza,NY\nWEEKS, HANNAH E, - 3rd Vioe-Pres-elect, Cleveland ^adio Council - 17^2 Elberon\nAvenue, E, Cleveland, Ohio\nWELTA-ER. LOUISE - Women's Director, WINN- Trier Hotel, Louisville, Xy.\nNLIS^AN MiOLTnE R. - South:HIgh. School, Columbus\nWELCH, H233ESB J. - Program Director, WELD - 33 N. High St., Columbus, Ohio\nWELDON, JACK - Program Director WBBJ ** P.0- Box 15^, Roanoke, Virginia\nWELLS, ELLA\nWELLS, ELLA HICHET - Teacher, Dramatics, Barrett Jr. High School, Columbus\n105 Campbell Street, Delaware, Ohio\nWENGER, ROY - Asst, Prof-, Education, Indiana Univ. - R 5 Bloomington, Ind.\nWERIC, BEN Cc - Earn Program Director, WXRC - Hotel Alas, Cincinnati, Ohio\nWHEATLEY, PARKER (MAJOR.) - Chief, Radio Programs Section, Information and Edu¬\ncation Division - 2E ’pJS Pentagon Bldg, W ashing ton, DC\nWHEELER, MRS. ARBIS HILLMAN - Exec. Secy. Institute, for Education by Radio, Cols.\nWHEELER, EDWIN K. - Asst. General Manager, WWJ, Detroit News - b30 W. Lafayette\nBlvd„, Detroit, Michigan\nWHEELER, ROBERT C. - 120o South 22nd Street, Columbus\nWHITACRE, MARY C. t- Ohio State University\nWHITE, ROBERT B. « Public Service Director, ABC - 20 N. acker Drive, Chicago\nWHITE, ROBERT E. - Educational, Public Relations Director, KDKA - Grant Bldg.,\nPittsburgh, Pa.\nWHITLOCK, AGNES - Programs, WNBP - Binghamton, Hew York\nWHITLOCK, RAY - Acct. Executive, *NBF - Binghamton, New York\nWHITTLESEY, EDWARD P. ** Director, Public Relations. Univ. of Denver, Denv., Colo.\nWICKMAN, PAUL - Secy, Radio Commission \"Voice of Prophecy,\" General Conference SDA\n6840 Eastern Avenue, Washington, D. C. _ > ^\nWIETING, C. MAURICE - Director of Information Services, National Council of Parmer\nCooperatives - 1731 Eye Street, Washington, D. C.\nWILCOX, JUANITA M. Continuity Writer, Promotion, WHKC t 1429 Hudson St., Cols.\nWILDER, PRANCES P. - Consultant, CBS - 4S5 Madison Ave, N. Y.\nWILKIN, MARY ANN - South High School, Columbus\nWILLIAMS, MRS. BRUCE - Exec-Secy, Radio Council - bth Ploor Pepper Building,\nWinston-Salem, North Carolina\nWILLIAMS, CATHERINE M. - Bureau Educational Research, Ohio State Univ., Columbus\nWILLIAMS, HARRY H. - Prof., Miami University, Oxford, Ohio\nWILLIAMS, ROSWELL 0. - Moderator, Radio Guild, Creighton University - 2jth and\nCalifornia, Omaha, Nebraska\nWILLIAMS, SIDNEY R. - Exec. Secy, Cleveland Urban League - S3XI Quincy, Cleveland\nWILLIAMS, !®S. WINTKROP ** Kansas City Star - 4917 Glendale Road, Kansas City, Mo.\nWILLIS, JANE - Piold Repr., College of Music and WLw r 1222 Central Pkwy, oinciny.-\nWILLIS, MARGARET M. - Assoc, Prof., Ohio State University, Columbus\nWILSON, PAUL J. - Wilson -^adic productions, l4l4 12th St,NE, Canton, Ohio, Box 902\nWILSON, W. GAIL - Speech Teacher - 2270 N« High St., Columbus\nWILSON, STUART - Parm Service Director, WKBN - 17 N. Champion St., Youngstown, 0.\nWINDLS, BEN E. - Engineer, Advocate, Newark, Ohio\nWI3ECARVER, NANCY - South High School, Columbus\nWISEMAN, WILLIAM 0. r- Public Relations Director, WOW, KODY - Room 280, Insurance\nBlag., Omaha, Nebraska\nWISSMAN, MEL C. - General Program Manager, WWJ, Detroit News, Lafayette and 2nd,\nDetroit, Michigan\nWOBIDO, LEO P. Director Queen’s Workshop of the Air, 3742 W. Pine Blvd, St.Louis\nWOLFE, MRS. PRESTON - Jr. League, 2X2 Park Drive, Columbus, Ohio\nWOELFEL, NORMAN T Director, Teaching Aids Lab, QSU, Columbus\nWOLFORD, JOAN - South High School, Columbus, Ohio\nTT 25"
}