{
  "id": "d1689-25",
  "text": "HAKE\nOHGAHXZATIC®_MAX LX HO ADDR-aSS__\nWOLLCOTT, BOS - South High School, Columhus „\nWOODS, MARY JC - Librarian, Indianapolis Public Library - 2b 33 14th St, Indianapolis\nWOODWARD, SALLY - Flanley and Woodward.- 551 Fifth Avenue, New York\nWORCESTER, CHARLES A. - Director of Agriculture, CBS - Earle Bldg, Washington, DC\nWORDEN. RALPH - News Editor, WGAR - Hotel Statler, Cleveland, Ohio\nWRIGHT, FLORENCE D. - 120 Tremont, Boston, Mass.\nWRIGHT, J. ELWIN - National Exec. Secy., National Assoc. of Evangelical - 120\nTremont Street, Boston, Mass.\nWURSNER, LOIS C. - Ohio Wesleyan University, Delaware, Ohio\nWYATT, Wr. JUDD - Advertising Manager, Missouri Farmers Assn., Columbia, Missouri\nWYER, MRS. SAMUEL S. - AAUW - 1125 Cambridge Place, Columbus, Ohio\nWYLER KARL 0. - Vice-Pros, Manager, KTSM, Hotel Paso Del Norte, POBox 197°\nEl Paso, Texas\nWYLER, MRS. EARL 0. - KTSM, P. 0. Box 1376. SI Paso, Texas\nYASECIG, JOSEPH S. - Ohio Wesleyan University - Delaware, Ohio\nYATES, PHYLLIS J. - Asst. Editor, N. C. St. College, College Station, Raleigh, NC\nYEAGER. CONNIE - South High School, Columbus\nYERIAN, JIM 0. - Promotion Director, WELD, 33 N. High St., Columbus, Ohio\nYCLEN, WILL - Director of Press and Special Events, WHEW - 001 Madison Ave., NY\nYONTZ, MRS. CHARLES K. - Radio Chm, Camp Eire Girls - 2071 Stanford Ad., Columbus\nYOUNG, BLACHE C. - Radio Consultant, Indianapolis Public Schools - 150 N. Meri¬\ndian, Indianapolis, Indiana\nYOUNG, MRS. FILM(DR - Book Commentator, WHEN - Marion, Ohio\nYOUNG, HAROLD - South High School, Columbus\nYOUNG, ROBERTA J. - Asst, to Dir. Work with Children, Akron Public Library - 11\nS. Summit, Akron, Ohio\nYUNDT, JOHN E. - Principal Moorestown Jr. H. S. - 2nd and Church St, Moorestown,WJ\nSSIGLER, VERDA MAE - Radio Director, Ft. Wayne Public Schools - 823 College\nFt. Wayne, Indiana\nZEIS, GEORGE L. - Ohio State University\nZEISLER, RICHARD S. - Clergyman, 85 Hamilton park, Columbus 3> Oki°\n2IBBARTK E, WILLIAM t Production Manager, Educational Director, WCCQ - CBS -\n625 Second Avenue S,, Minneapolis, Minnesota\nZIHAND, SAVED - Exec. Director, NYC Cancer Comm., - 130 E 66th St., New York\n2IPF, BILL - Farm Radio Editor, Ohio State University, Columbus\nZUBLR, MRS. F. R. - 205 Wilson Avenue, Columbus\nZURHORSE, MARY 0 - Reporter, Radio Consultant, National Housing Administration,\nBroadcast Magazine - 870 Nat'1. Press Bldg, Washington, DC\nZWOSTA, JANNEAN - South High School, Columbus\n- 26 -"
}