{
  "id": "d239-100",
  "text": "$\ncharacter of certain preblea* in criticim which ehculd occupy brende«*ter*\nof poetry. fhe pro.leet direct-p fool, that tho point In contention Involve*\ntho dlffor.no. between • useful nod a noelo.. lllualon.\nTha foregoing paragraph. will sarre to sketch eon* of tho eleaentary\n**1*”*Bt* on the nature of tho took which underlay thl. oxp.rln.at>. work with\ntho tap. rocordor. It cannot ho urged too etrongly that tho development of\nbroadee.ttng a. a aedlun for poetry raeniro* ranch thought along thooa lino*,\nboth a. to tha nature and Halt, of the medium for that purpe.., and ao to\ntha critical ra.nonalbllltlae of tha broadcaster. In the proposal for an ex-\nton.Ion of tha experiment whlah conclude. thl. ronort. It lo not onggo.tod\nthat tho pro .loot lneorpopato a full-length .tudy of theorte. and method.. a.\ntha work of preparing «ueh a .tody for mblloatlon would repair* .ewaral\n»onth. for Itaalf. It la to he hoped, howowap, that at .aae time, from tha\nexperience coined la a well-rounded experiment of greater .cope than tha pre¬\nsent on#, .uoh a etudy can be praoarad and mad* available. Far tha broadoa.t-\nIng of poetry la not ao much a problem of tecimloue. a. of ba.io aeauaptlon*.\nfhe talent for good reading and imaginative .crtntlng and production can be\nfound, khat 1. wanting 1. a .ound and generally aeae.olble organlMtlon of\ntheory for It. application.\nHI* B»eord»d\nwithin tho «lx nontht allotted to the experiment now being reported. It\nproved petalbla ta complete erproximately half the recording work originally\nplanned, with certain quaUfleattons at to production noted below. Following\nte a Hat of tape, completed, with brief deeorlptione of their eonteat.i\nSertM I, tape at poms OF H03--T Kh r.t. a reeding, with very\nbrief cogent and Identification, of the following nine pee*.,\nfhc Holy Innocent.; After the hurprl.in* Converalone; wary\n»ln«low| the Quaker Graveyard la Kantueket (Part I through ?);\n!? \"j^f**?* Coaeora* *♦ * «M> House; The Crucifix;\nAt th® Indian xm#r»» llili. Half-hour."
}