{
  "id": "d239-104",
  "text": "13\nsufficient %im to s©ad dubbings to the ©©asm!tents, allow m empl# period\nfor th©ir auditioning and a further petted for the preparation of consultants*\nreports* lxtre©e effort mm required to complete useable recordings no liotod\nIf mid-December 1991** Immediately after Christmas, the dlfooter travelled with\ntapes in bond to obtain audition evaluations from no assay of the oontultontt no\nwore then immediately accessible* Miss Miles, Hr* Biadorar, Kiss bailer, Mis*\nBo«oa, and Hr* Packard were subjected te booty visits and eo may recordings\nae could be tolerated in a single sitting, which in no ease numbered »ore than\nfive of the tapes* 2a cheerful helplessness to asks any studied consents,\nthese persons then composed the letters of general reaction which will be found\ncompiled in Appendix i ©f this report* The fault ef course lay with the direct¬\nor, whose ambition and preparation In August end September for a rounded experi¬\nment ignored the nearness of January*\nHowever, fro* the appended letters and fro© conversations held during\nauditioning, a fmt conclusions nay be drawn which have high value for an ex¬\ntension of the experiment.\nThere was general agreement among the consultants actually involved that\nthe series design itself suggested a desirable and potentially effective method\nof presenting modem poetry on mdie* The director concurs in this view. It\nhas already been mentioned that the Aeries ¥ presentations wire conceived ae\nterminal programs dependent on a preceding sequence ef readings and discussions*\nThe concensus in the experiment thus far is that four, five or six programs on\nthe same poet, scheduled et intervale ©f not more than a week, and ranging from\nsimple reading-discussions to more slab©rets •contextual1 interpretations, would\nbe the optimum procedure* On the other hand, it must be noted that none ef the\nconsultants actually heard all of the prepared sequences. Series I-¥, on slther\npest* la the haste of the brief auditions during December and January, none ©f"
}