{
  "id": "d239-108",
  "text": "IT\nIMr convenience over a reasonable period. Inch consultant should be\n^4v#n opportunity to hear « complete sequence of profrax* on at least on*\nof the ports* and to prepare • detailed ©ofMeni^ry, The project should alto\naUmr tin* for preparation of a wore studied final report V>«»d on tho eon-\n•ultante1 evaluation*. 7h*«* activities together* wholly sport from tho\ndevelopment of tho recordlag*, could not consuae loos than two months. Tho\ndirooter fool* that consultants should not ho asked to engage la lengthy\naudit lotting and osrofnl commentary without ex honoraria* of iioo.oo In ac¬\nknowledgment of tho considerable tin# and thought involved. It to alto folt\nthat tho oral nation of tho project1# materials should include actual broad-\n«a»t of tho completed experiment (twenty programs) at wmro, hew York, and\nI Fd# Berkeley* where pi^rtl lntoroot among tho typo of audience for which\ntho presentation® are i a tended could ho munI *uugtily hy nail count.\nIt it proposed that a period of oi#\\t months ho need to complete the\nexperiment* hut without tho exacting deadline which obtained before. If an\nextra month were required to complete the consultants’ part of the project*\nit It attuned In this proposal that that would he allowable* though without\nincrease of the budget. Within an estimated slight months* the eriddnal plan\nof the experiment would he completed in finished productions, the work Pre~\nce*din& with less haste and greater latitude fhr revision than was previously\npossible. The time estimate is baaed on the advantage already gained is -pre¬\nliminary work for the development of presen tat lone of Hr. *b#rhert and Wise\nScore.\nIf It appeared alter completion of the proposed experiment that tome or\nall of its recording* should he made available for broadcasting elsewhere than\nat WlYO and KPU general recording H#t« on the performances could be rene¬\ngotiated with the talent employed, and allocation of a sun of approximately"
}