{
  "id": "d239-112",
  "text": "mmmm imvmmrt\nPrinmtm, iw «Torsoy\n1 imm 55\nBopartoo&f of\nHr. mu\nThis it to mnfim mm amah so I o*a rouomhor hawing mid la f«aiaa of\nyour oxporlaoatal radio program oa tho pootry of Stowont mad Xavoll,\nwhich you playod to mm yootorday la ouch wnrloty. Thoy w«ro lungina*\ntiro aad woadorfully gomudlag of tho atioattoa, with, for »#, oaly\noao mmmtjtioa, tho ©»• which mm %hm mmap»%o*-opora ttylo of which tho\nXBC lady to aporowod* I would ouppaoo that for tho moot port th# # 2\nworoloat — tho poomo with Aioeuroiwo mmamim would ho moot offoot-\niwo* Aooualag that you wort going to run a tori to of tlx program*, I\noould ismglm that four ought t© ho # 2, oao author 1 (pur# rondiag),\nand oao o # H ©r # 5. whoro you Anwaotlto tho ;mm and turrotmd It with\no goaoyal prehloo of latoroot and kaowlodgo and \"culturo*. I aould\nImoglno tho trootoaat of tho King** Ghapal Burial around which you playod\nloot, or alaoot loot, m feoiag a pooh fonrftemuMa (tho arohotypo of oao)\nwhich you might uto oaeo a fortnight. 1 AcnH wood to urgo you, olaeo\nyou nlroady soots to ngroo, of th® aaaaaolty for tho hlghoot pootlhlo\nlltoraay Both la approglatloa and in loading* Indood. If I war# to odd\nmay ougnooiioa of ay mm, it *t#t ho thloi that you triod oao or two\nprogram* whoro tho mam pmmmm woro road Aifforontly (at toy Icuosowitsky\nmad BooohAfB and Hoatoux doing tho tutor Mutic tutooooiwoly) whothor hy\ntho tamo or dlfforont roador*. But tueh a ta#vootioa ohrnsld only ho\nadoptod at iafroquont latorwala — mm ©thorwino hogging rathor thoa pro*\nmot lag tho lloioaor1# attoattoa.\n1 think tho root proof of your bidding, for *#, woo that 1 ato it with\n•toady oajoymont and had no tr nhlo in koopiag w ottoatioa both foot-\noaod and olort. •» I wioh you all good fortuno ia your vholo oatora\nprlao, and whorowor ay mil s*»pr©w**l hat any waluo you soy ho aura\nyou how# it — all tho mrm mm tine# I had arpoetod nothing of tho tort.\nTim Kooloyo (tho oounlo who aoao la ot •!*) talfcod a loag tfoo aftor-\nwordo how extraordinary your pragma wat. Ouch thing* aako all tho\ndlfforonaa*\nfinally, it wao wory good to too you.\nfaithfully,\nml *.*• llagte—r\n1 *F. Btaakmur"
}