{
  "id": "d239-116",
  "text": "m\nQOft\nwmimA nmmmnm mw*m, m.\norohaadiso Hart, Chicago 5** Illinois\nBoooisbsr 30# 195&\n«r. u*u mix\no/o SoyaOUT Sl*«Ol\nStation WBTO\n25 Municipal ttdg.\nlow Tone T, ».t.\nDear Mr. HUi\nYou asked if I would ho will lag to put down on papor tom# of tho thou^ito\nthat ooourrod to no aftor listoaimg to a fow of tho factor FfCjCCt tape*.\nI am mmmtfmk loathe to do this at there wot ao opportunity for »e to list-\nex1 to hut two of tho tapee la thoir entirety and I wa* latorruoted fre¬\nquently whoa trying to liotoa to ewen fragmentary portion* of thro# othor*.\nTho idem of presenting such a torlot of pyograsie on modern poetry appealed\nto no rory mmh - pacffldtag torlot war® presented ow#r **a educational\nradio * tat loo • ! n not sure any commercial station would fool it should\nsot aside tim for any pragma tori#*, that, on tho face of it, would attract\na ce-callcd minority or fringe *udi#no*. I know, howewer, that you hare not\nhad a eoxweretal station in mind whoa thinking of presenting thin oorioo.\nla tho first place, way l toy, that you hare *n wey* with oetry and if you\npersonally woro to vote# tho oorioo, it would ho excellent. tho quality of\nyour woiee pice your Inn*to ability to road poetry voll would color any\nappraisal of tho pro# on tat ion.\nI liko tho rarioty of format, though* poroonally, I thought \"Tho four ooe»#\nof Wallaao itowone* road on tho on# tap# woro a littlo \"hard to take.* That\nthi» could ho usod in a olaoorooo lecture is under# taadahle, hot I am not\nouro it would ho good for tho radio, tho aothod of presenting tho o tho rot\n•Tho Trouble with doing AHnf\n•Sou# of tho Jdom* of Biohard Ihorhart*\nu hard hy KhUaao it owns*\n•lection of a Soliloquy*\nwas interesting and oaoh would hold attontlon and would intrigue no, for ono,\nto liotoa for othor* and to dip fhrthor into tho 000a* of tho particular poet\npresented.\nI haw* no fooling that ia discussing format* it rrnst ho a onto of oithor or -\neach hao I to distinguishing point* and I should think tho subject of tho poo*\ncould Tory woll dictate tho format of prosontation. Thus, tho dialogue on\nfiobert IfioU'l poem was eycelleat hut would not ho m«od on tho Callao#\nStoroas* pooas.\nThee# fow random thought* aro not much in tho way of objeetlwe thinking -\nhut under tho oiruwwtorKoo are tho host I enn scramble together. I would"
}