{
  "id": "d239-129",
  "text": "The Role of National Associations\n- 4 -\nAlan Gregg, M.D,\n3* Inform and encourage members by holding at least one general meeting a\nyear, and by the maintenance of a journal and a central reference library\nwith an active lending service.\n4* Initiate or sponsor studies by staff or even by members—studies related\nto the chosen field—-and distribute the reports thereon.\n5. Roster and support research done by others. In the choice of research\nprojects I would beg that you give deliberate attention to the balance be¬\ntween the gilt-edged and the speculative—to use the phrases of an investment\nportfolio—for that distinction deserves attention. And I would also beg\nyou to help in the search for causes of disease, for without knowledge of\ncauses the task of prevention becomes haphazard and discouraging.\n6, Standardize the qualifications of persons engaged in the types of work\nsupported, facilitate recruitment in every possible way, and when necessary\nmaintain a registry of well-qualified personnel to be employed in special\n'\"•-fields.\n7. Coordinate the field with others related to it; avoid preciousness and\nisolation. None the less, protect the field from encroachments by others\nwEcTappear ready to ignore or sacrifice or even attack the work in hand.\n8. Collaborate with government and tax-supported agencies. For example,\nlegislatures have been known to appropriate large sums for the control of\ndisease, but nothing whatever for finding out how best to do it. Government\nofficials are often the first to recognize and appreciate nonr-governmental\norganizations—especially if such organizations decline to boast of their\nown accomplishments in contrast with occasional governmental limitations,\nmistakes, or ineptitudes.\n9. Riase funds for the association’s budget. The Dean of the Faculty of\nArts and Sciences at Harvard, McGeorge Bundy, recently said, “The excellence\nof Harvard is not in the first instance a product of its financial resources.\nFundamentally its resources are the reward of its excellence.\" It is a\npleasure to quote some one else in point of one of the more austere of my\nown convictions. And I would add that I found long ago, when I used to be\ntold that a situation \"presented a real challenge,\" that all too often the\nuse of that word, \"challenge,\" meant merely that there was a deficit. From\nsuch a sad fact I would offer the—I hope, not too blunt—opinion that a\nrecord of high performance offers more challenge to a wise donor than does\na deficit.\nWhile we are on the subject of finances, I would offer the simple calculation\nthat an organization that sets aside 5 per cent of its annual income as en-\ni dowment to pay interest at 4 per cent will, if its annual income is $30,000,\n\\ reach an endowment income of $1,400 annually after twenty-five years, even\n\\ without compound interest. What size of stable income you would have to~ds§r\n\\if you had begun twenty-five years ago such a 5 per cent sequestration of\nyour annual income, I don’t know—and perhaps it is too painful to elaborate.\nRut it would be large and dependable. The tasks of this association will\nnot be completed in the next fifty years, and some such sequestration of in¬\ncome might serve to remind you that you seriously need some dependable con¬\ntinuing endowment income."
}