{
  "id": "d239-130",
  "text": "The Role of National Associatione\n- 5 -\nAlan Gregg, M.E,\n10. Increase membership—especially in local chapters. The Red Cross has\nan admirable history—of getting membership of this decentralized and widely\nshared kind*\nAfter this brief review of what a national association can do and actually\ndoes accomplish, let me turn to the criteria that may be applied by any na¬\ntional organization with the idea of self-improvement. These criteria may\nbe internal or external—questions properly asked inside the family, as it\nwere, or likely to come from the outside.\nWithin the organization, what would you say of the quality of your communica¬\ntions with each other—written and spoken? It is a question simple in form,\napplicable to each member, and always a point where improvement can be begun\nat any time by any one.\nI refer to the cardinal qualities of communications of any sort—frequency,\nbrevity, completeness, promptness, and sincerity. In many organizations the\nletters and conversations are rare, but long and verbose, incomplete and\nhastily composed, reluctant and delayed, and—for reasons that cannot be jus¬\ntified—sometimes lacking in candor.\nNext, do your officers—not the executives, but the elected officers—really\nknow what is going on? And have you trustees who have the time and the abil¬\nity to brood upon the affairs of the organization, upon its potentialities\nas well as its policies?\nOn the subject of budget, I have already mentioned the importance of endowment\nincome. For the year ended September 30i 1953, your interest income was only\n$263.84 out of a total income of $586,631.47. That seems to me extremely\nsmall, for it is only forty-four thousandths of 1 per cent. As for temporary\nsupport, experience has shown me more than one example of the risk to any na¬\ntional organization of depending on any one source for more than one-third\nof its total income. And I might add that I have come to that opinion slow¬\nly and reluctantly. I am still nettled by a wry definition I heard years\nago of a national association as \"an outfit whose head is in the clouds,\nwhose hands are in the air, whose foot is in the door—and supported by the\nRockefeller Foundation.\" There are times when the well-known analogy of\npriming the pump proves to be exactly that—and initial help from a founda¬\ntion is justified. But the pump-priming argument has something glib about\nit unless the most conscientious attention be given to making the pump work\nafterward, for that is where the justification lies. In other words, pump¬\npriming, though a neat figure of speech, describes a great obligation.\nIs your membership growing? ,,rhat is its turnover? ’’That is the age composi¬\ntion of your membership? What is its trend—toward an older or a younger\nmembership? What studies have been made comparing this association’s mem¬\nbership with that of other national organizations? Are the possible activi¬\nties open to members made vividly clear to your new members? How are the\nservices given by your members acknowledged? Is a significant bit of service\nsure to be recognized? Or do you have the trouble of a church I used to\nknows whose members wrere described as \"worshipping the Lord vrith a cross on\none shoulder and a chip on the other\"? Does the unselfishness of your ends\nexcite, or even excuse, jealousies and vanities in the members in attaining\nthose ends?"
}