{
  "id": "d239-131",
  "text": "The Hole of National Associations\n- 6 -\nAlan Gregg, M* D,\nLet us turn from soul-searching to what may he said or thought hy others about\nyou. From the outside, the effectiveness of a national organization may he\njudged hy how widely and accurately its work and purposes are understood and\nsupported hy the public; hy the character as well as the size of its member¬\nship; hy the excellence of its studies and the range and reliability of its\ninformation services; hy the measure of pioneering in its programs as well\nas the quality and continuity of its routine services; hy the growth and\nquality of local chapters and the help given them hy national headquarters;\nand—an item often ignored—by the extent to which the national organization\ngives to the local chapters and even other local groups the credit for pro¬\ngress made.\nObviously the annual report of a national society or league deserves careful\n■consideration, I have come to feel that short reports are better than long\nones. This is not because they are easier to read, hut because short re¬\nports can reveal excellent work* out cannot hide the lack of it. You can\ncover any cadaver if you have plenty of sheets—of paper- In these times\nof ignored, hut undeniable inflation, an annual report might well contain a\ntable showing the loss of purchasing -value of the dollar, and the correction\nto use in comparing the actual purchasing value in to-day’s dollars of eveiy\nbudget hack to 1915* If allowance were thus mad© both for the loss in the\npurchasing value of the dollar, and for the steady growth of our national\npopulation, we should. I suspect9 stare at each other in surprise at the\nshrinkage of per-eapita support for many of our national organizations,\n1 have offered you some comment on the nature of national associations, their\nintimate relation to democratic citizenship; the range of their work and pur¬\nposes, some ten of their major activities or potentialities, and some of the\ncriteria hy which they can be judged both from within and from without, I\noffer all of this in the mood of an old French friend who said,, ’’Remember,\nmy hoy? you can have anything you want in this world,, only don’t forget to\npay for it®15 The psychology of high endeavor is a subtle matter, and we can\nwisely hear in mind what lias been said of the alcoholic—he doesn’t want to\nstop drinking', he only wants to want bo stop drinking. In short, yon are\nwhat you are, ib is not enough to want to want to do better, for accomplish¬\nment must be paid for in another currency than that of appearances.\nPerhaps these comments have seemed too analytical and matter of fact-, too\nlacking in emotional resonance and fervor. If this organization were devoted\nto some abstract principle like the single tax, or even a purpose as concrete\nas the reduction of our high tarxifs, then another kind of address might have\nbeen in order. Far more stirring and eloquent than any words, there stands,\nat no impossible distance from any of us, a mental hospital we could visit\nfor one whole day. From the agonized compassion renewed by one thoughtful\nvisit, we could obtain enough emotional drive to take us through another win-\nter in steadfast conviction of the value of this National Association for\nMental Health*"
}