{
  "id": "d239-35",
  "text": "THE ROCKEFELLER FOUNDATION\nAnnouncement of Grants\nThe Rockefeller Foundation is primarily a grant-making organization.\nExcept to a limited extent, in public health and agriculture, the Foundation\ndoes not itself engage in research and experimentation, or furnish services\nin particular fields; rather it seeks to advance its charter purpose “to pro¬\nmote the well-being of mankind throughout the world” chiefly through\ngrants to universities, research institutes, and other qualified agencies con¬\nducting work within the scope of the Foundation’s program.\nSince its establishment, the Foundation has followed the practice of\nrecording its grants in an Annual Report that appears early each year.\nMore recently this has been supplemented by Quarterly Reports in which\nbrief announcements of grants are published soon after they have been\nmade. Through these reports the Foundation seeks to fulfill its responsi¬\nbility of accounting to the public for the current use of funds it holds in trust.\nConsequently, the Foundation has no reason to ask recipients of its\ngrants to make any announcement of them. Recipients who do wish to\nacknowledge publicly receipt of funds may do so, either by routine refer¬\nence or by similar listing in their Annual Reports. If occasionally special\ncircumstances make desirable some further announcement that involves\ninterpretation of the Foundation’s action in making the grant, the officers\nof the Foundation will appreciate the opportunity of seeing such announce¬\nments before they are made public.\nSince the Foundation neither expects nor desires that the results obtained\nin research or other projects supported by its grants should be submitted to\nthe Foundation for approval, there should be no acknowledgment of the\ngrants in prefaces of books or in similar usages which might imply or sug¬\ngest that those results carry the specific approval of the Foundation.\nWhile the Foundation’s action in making a grant carries implicit\napproval of the proposal for which the grant is made, the recipient, and not\nthe Foundation, is responsible for giving effect to the proposal and for its\nresults. Therefore, no reference of any kind should be made by the recip¬\nient implying that the Foundation has control over the project or any\nresponsibility for its results.\nThe Foundation requests particularly that its name should not be\nused on jackets or in any advertising of books or in designating projects,\nfellowships, laboratories or buildings toward which it has contributed.\nJanuary, 1953"
}