{
  "id": "d239-55",
  "text": "LfeWI S HILL\nDear Mr. Schooleyi\nI have received copief\nDuncans Mills, Calif,\nAugust ?• 195**\nfrom Graydon Ausmus to of¬\nficers of the Hockefeller Foundation, regarding the grant of $9,970.00 for\nexperiments in poetry broadcasting under my direction* Some aspects of these\nletters affect the content of my letter of August 4 to you, and perhaps it\nwould be well to start all over again in settling procedure*\nIt is relieving to note in Ausmus*• letter to Miss Flora M. Rhind that\nthe Hockefeller Foundation designated its grant for a period of six months\ncommencing on July 15* 1954, any balance of unexpended funds to be returned\nto the Foundation on that date* Early in July I had been advised informally\nthat the grant period would begin on the 15th, and on the strength of that\nI began to spend quite a bit of time on the preliminary planning at mid-July.\nIn my recent letter to you I was not aware that the July 15 date had been\nformally attached to the grant, but made the suggest! on, as you will recall,\nthat August 1 be taken as the beginning date* My suggestion of August 1 Is,\nof course, rescinded, and I will commence the accounting of my own services\nand the project's activity in general as of July 15*\nOn the other hand, the Initial advance of $2,500*00, which my August\n4 letter requested, will stand for the present* I note (also some thing of\nwhich I was unaware) that the $1,000.00 which was being forwarded to me is\nevidently out of HAEB's pocket, the Hockefeller check not yet having been\ndelivered when Ausmus wrote these letters of August 3* Ag soon as the grant\nIs actually In hand I suggest that the $2,500 (or the additional $1,500\nabove your first advance, as the case may be) should be airmailed out. Ho\nfunds have yet been received here. I would also appreciate some of your\nvoucher forms, so that we can begin an orderly recording and accounting to\nyour office of the expenditures made against your advance*\nIt is mentioned in one of Ausmus1 s letters that the equipment pur¬\nchased for this project will revert to HASB. That is also my understanding*\nOn investigation I have found the Ampex 600 tape recorder unsuitable for\nthis purpose as well as considerably over-priced. I am acquiring instead\na Magnecord *03 portable* I have also found it necessary to purchase a\ntypewriter for use in the project* At the conclusion of the six-month\nperiod from July 15, these and any similar items will be at your disposal,\nso far as 1 am concerned* I presume it can be determined at that time\nwhether you would prefer to have them shipped to your headquarters or\nsold for the proceeds*\nVery truly yours,\nMr* Frank J. Schooley\nHAEB Treasurer\n14 Gregory Hall\nUniversity of Illinois\nIfirbana, Illinois\ncc: Gray&on Ausmus\nSeymour Siegel"
}