{
  "id": "d239-56",
  "text": "LEWIS HILL\nDuncans Mills, C&lif.\nAugust 9$ 195&\nDear Mr, Hills\nI have received today your check lo. 492 for $1,000.00,\nas an advance for use in the poetry project. Blanks very much\nfor seeding this on so promptly.\nIn various communications to Mr. Schooley, I have asked\nthat a supply of your voucher forms he provided, eo that we can\nbegin a careful routine accounting for the funds immediately.\nIfm sure ve will have no difficulty on this score. If you\nhave no vouchers or voucher system I will follow an analogous\nprocedure of my own.\nWe must hear in mind that this is a six-month project\nwhich terminates on January 15, 1955. W0 are almost a month\ninto it already and, as you will easily understand, the absence\nof adequate funds here has a hampering effect, the expenditures\nin the project to date, including the equipment purchases and\nmy own fee, already exceed the amount advanced; and of course,\nin order to proceed with any ease we must have funds on hand\nfor current needs. In letters to Mr. School ey*s office I\nsuggested that a total initial advance of $2,500.00 he provided\nfor the month of August. 1 do not believe we can expect to\noperate the project through the month of August unless these\nfunds are provided. X would therefore urge (not knowing the\ntime of Mgi. Schooley*e expected return) that some arrangement\nhe made in your office which will permit us to proceed on the\nbudgeted expenditures of the project without further delay.\nVacation season presents many hs sard si I would not wish\nto detract from the results of this project by having to\ncompress six months* work into four on account of a delay in\nfunds. Because the unexpended balance of funds is to be returned\nto the Rockefeller foundation on next January 15* we must re¬\ngard it in this light. Anxious though I am to present no\nunusual burden to your office, I must insist that my own re¬\nsponsibilities in the project are contingent upon my receipt\nof punctual disbursements from the grant as originally con¬\nceived over the six-month period from last July 15*\nSincerely yours.\nMr. Harold E. Hill, Associate Director\nM.A.I.B., Gregory Hall\nUniversity of Illinois\nIJrbana, Illinois\ncc: Oraydon Ausmus\nSeymour Siegel"
}