{
  "id": "d239-69",
  "text": "Octdber 8, l<$k\nV *■\nLEWI S HILL\nMr* Cany dm Avtmm\nProtiUkrafe, H.A*B.S.\nBox 2002\nWnlimrstty, Alabama\nDeer Oroya on.\nThanks for your note of Saptsnter 1 m. mm getfctog Into the\nheart of th* Rockefeller project, end at the moment feel fairly hep**\nful that it may achieve the desired results*\n1 do west to ©all to your attention end to that of the other per**\nsons receiving carbons of this letter, that the\nfeller prelect is not to p red up* nror'yam* far\nNt* of the Hooke*\nproject is rather for the purpose of comparing different method* of\npresenting poetry, including mtm e^rimoatal methods of my devising*\nto important part of the project is it® jury, consisting of R,P. Black-\nmur, Lloyd Frank*aberg, John Grow Ransom, 1.8* Bliot, J»L* Sweney,\nLouis© Began, Aldous Iftkley, Josephine Miles, Frederick Packard, Judith\nWeller, and certain others* These persons have been enlisted to hear\nny tape recordings of oGrcperctive end experimental presentations of\npoetry, and to register their judgments as to which of th* method* eon-\npared is in each case of four different poets the most effective* On*\nbasic aim of the project is to assemble the opinions of this Jury so\nthat a decision om be made at th© Rockefeller foundation as to whether\n© narnmrmt larger project should be undertaken for th* .production of\npoetry progress for actual broadcast*\nAs part of the process of testing the effectiveness of different\nmethods of presentation 1 have considered running test brood casts, with\nappropriate audience 'participation for a sampling at K2PFA, WHYC, and\nlUt (the latter too stations having expressed & mm Inter*«t in such\nan experimost)* However, I have not finally decided whether this will\nbe desirable as part of the project, and in any case, if 1 do dot ©mins\nto run the©* actual broadcast tests, I ©hall be dependent upon th© will*'\ningness of the publisher© of the poets in question to permit such broad¬\ncasts without royalty fees. There is no revision at all In the pro¬\nject’s budget for royalty arrangements, since, as aforesaid, bread** -t-\ntog of th© material was not, oaobenplatsd*\nI trust there has been no widespread Rlaunderstftndiag cm this\npoint but it ii well to mention it nor and avoid disappointment to any\nquarter* To the best of my knowledge, imlcaa fee IliKB or the Rockefeller\nwish to undertake separate reget IgtSfmgJtor bwwdofl on the,\nnatcrial j.an ue:V,-:r noao o£ the la am., gill M available for use on the\nnda/ark*- Our hope is, rather, that they will f om the basis for another\nproject and some real program production in this field.\nWith regard to the question of reports m th© project*© development,\n1 will m glad to keep Shorn!a informed, but X am afraid 1 oasmot under-"
}