{
  "id": "d239-76",
  "text": "Duncans Mills, California\nNovember 1, 1954\nMr. Seymour H. Siegel\nMunicipal Broadcasting System\n2500 Municipal Building\nHew York 7> Hew York\nDear Sy:\nSiis is just a little past the mid-way point in the Rocke¬\nfeller Foundation poetry project which I am conducting for MSB.\nI*m sure you will be interested to know how it is going.\nAt the present moment I am working on the material of Wallace\nStevens and Robert Lowell which will represent Series 3V and V on\nthese poets, corresponding to the outline contained in ray letter\nof September 4. I am reasonably well satisfied with the way this\nwork is going. Except for eoraa odds and ends (mostly re-recording\nto get the optimum tape) the first three Series on all four poets\n(Stevens, Lowell, Moore, Eberhart) are in hand. 2hese are all\nvariations on the formal reading and the formal lecture, fhe\nfourth and fifth Series, you will recall, voyage into other tech¬\nniques, I must say I am having a wonderful time with them. But of\ncourse whether anyone else will like the results I cannot guess.\nWhile I was carting some eamples of my first three Series\naround the country about a month ago, and drawing together the\nconsulting group for the project, I did encounter some mightily\nencouraging evidence of success in that part of the work. I\nplayed some of the tapes for a variety of people in different\nplaces — people with much and little background in poetry, in\ncolleges and living rooms — and their apparent effectiveness was\nsurprising to me. If the last two Series do as well, I think we\nwill have what we want.\nMy only serious worry is about the time. You remember that\nJohn Marshall siggested I put out the finished report on the pro¬\nject around December 1, with a view to its entering into a January\nconsideration of further activities along these lines. I am not\nsure this time schedule will be feasible — not for completing what\nI should like to complete. It may be necessary to hold the report\nfor January at the actual conclusion of the project period, or near\nits but I would rather delay the consideration of further activities\na little ldiile, if necessary, than permit the work to suffer be¬\ncause of the hurry.\nIn our last conversation face to face, you expressed concern\nand evidently some surprise on learning that the tape recordings\ncomprising (along with the consultants' evaluations and the written\nsummary) the final products of this experiment will not exceed two"
}