{
  "id": "d239-77",
  "text": "Hr. Seymour I. Siegel\nNovember 1, 1954\nXfege 2\ndozen, and may actually round out beat at twenty. Tour view on thie\nmatter hae bothered me a little, since we had the same determinative\nconversation with Marshall at the same time. X have organised the\nproject to produce a sywmtrical study of types of presentation, and\nnot at all an arbitrary quantity of program tapes. A principal object\nbeing to obtain an evaluation of different presentation methods from\na \"jury** of well qualified consultants, it is obvious that few or\nnone of the individual consultants can be expected to study & very-\nlarge number of half-hour tapes. It was the conception shared by\nMarshall — in hie own words, I think — that I should \"sit and think\"\nfor six months, and see what qualitative evidence I could put together\non tape that serious contemporary poetry can be effectively presented.\nI have applied this conception literally. I hays sat and thought,\nwith the tape recorder at hand, and abandoned more recordings than I\nshall ultimately put in the package. And actually, I am net sure\nthat two dozen finished recordings is not too scattered an effort for\nthe actual purpose of this project! in any case none of the consultants\nwill be asked to study more than five. If there hae been a misunder¬\nstanding on the whole enterprise, and the view except in my own thought\nwas that I would spend the six months producing poetry readings as\nfast as possible, I should be alarmed to learn it. Have you any\nsecond thoughts that might clarify our different impressions ad thie\nsubject?\nAs our last meeting disclosed, I have thought that as a supple¬\nment to the evaluations of the consulting group it would be both\npractical and interesting to broadcast all of the project's tapes\nin close sequence at USA and WKXD, with small audience groups par¬\nticipating in a questionnaire. All of the relevant publishers\nhave given permission for such one-time broadcasts for this purpose\nwithout royalty. If it still interests you as a possibility there\nplease let m know,\nA current summary of the project's financial statue, going to\nSehooley in this same mail, le enclosed.\nSincere best wishes.\nEnel.\ncos Harry Skomia"
}