{
  "id": "d239-79",
  "text": "LEWI S HILL\nDuncans Mills, California\nNovember 15, 1954\nDr. Harry J. Skornia\nNational Association of Educational\nBroadcasters\n119 Gregory Hall\nUrbana, Illinois\nNOV VI 1B54\nDear Harry Skornia:\nI can well understand your anxiety about foundation ref¬\nlations and project deadlines, and I am afraid my remarks to\nSiegel have misled you in this connection. There is no formal\nobligation in the Rockefeller project to produce the finished\nreport on it during December. That idea arose very informally\nin a preliminary conversation with John Marshall, and its inw\nport was that it would be nice if the question of a larger\nproject, based on this experiment, could be put before the\nRockefeller board at its January meeting (my work, you under¬\nstand, is being done on an administrative grant, and involved\nno board action). The subject was tentative at the time, and\nhas not been discussed since. I daresay the Humanities Di¬\nvision is eager to go ahead with a larger project in litera¬\nture whenever it has adequate evidence to present to the board\nthat such a project is feasible. But in the actual circum¬\nstances of our preliminary conversations last June, the matter\nof a December report was primarily personal, as you will no¬\ntice if you examine its implications as to January, The pre¬\nsent project terminates on January 15. Marshall was consider¬\ning the possibility of making a larger and longer project\ncontiguous with this one, and the very generous motive in this\nthought seems to have been to keep me occupied. As aforesaid,\nhowever, the whole subject has no bearing on the formal con¬\nditions of the grant you are administering.\nIn about a month I shall be seeing Marshall in New York,\nand reviewing v/ith him the work accomplished to that time. If,\non the basis of what lire then have, he feels a final report\nought to be prepared, I will proceed that way; otherwise, hold\nit till January. In either case I am sure it will work out\nsatisfactorily to all.\nBest regards.\ncc: Schooley"
}