{
  "id": "d239-80",
  "text": "LEWI S HILL\n(fUcMdk*. %'^Jr\nA\nDuncans Mills, California\nNovember 18, 1954\nMr. Robert B. Hudson\nEducational !Belevision and Radio Center\n1610 Washtenaw Avenue\nAnn Arbor, Michigan\nDear Bob:\nI have corresponded lately with Harry Skornia of NAEB concerning\na recording made by Wallace Stevens as part of the \"New England\nAnthology\" produced at the University of Massachusetts by Robert\nTucker. I understand that the NAEB grant-in-aid which supported\nthat project came ultimately from the Center, which holds all rights\non the material. As a result of my request for a copy of the\nStevens tape, Harry Skornia has written that the necessary permis¬\nsion must come from the Center; and I am now writing to that end.\nIn an experimental project which I am conducting for NAEB\nunder a Rockefeller foundation grant, I am preparing several dif¬\nferent presentations of Wallace Stevens's poetry, centering par¬\nticularly about the poem, \"The Idea of Order at Key West.” In one\nof my recording!, there ie one place where I wieh to use Mr.\nStevens's own reading of that poem. The poem in question, and\nseveral othlirs, along with commentary, are included in the tape\nwhich Mr. Stevens made at the University of Massachusetts. I have\nasked for that tape solely in order to make a dubbing of the\none poem.\nThe materials of my project are not intended for distribu¬\ntion for broadcasting. They are merely studies in different methods\nof presenting poetry on radio, and are to be reviewed at the first\nof the year by a consulting group, whose reports will comprise\nthe project's main findings. As part of the general assessment of\nmethod, it has been planned tentatively that all of my tapes might\nbe broadcast once in close series at KFFA and WNYC, with an\naudience questionnaire. In that event, Mr. Stevens's reading\nof M‘The Idea of Order at Kby West\" would be heard as a tiny part\nof the whole (the whole deals with four poets and five different\nmethods). I will gladly assume responsibility for there being no\nfurther public use of the material, should you provide it.\nSince I shall be visiting with Mr. Stevens again in December,\nit would be possible to extract a different reading from him; but,\nfirst, my need is earlier than that; and second, the gentleman is\nold and tired. Will you advise at Tfrbana and here whether the ex¬\nisting tape can be made available for this purposeT\nSincere regards.\ncc: Harry Skornia"
}