{
  "id": "d239-99",
  "text": "8\nvirtually inpessible to create a dramatic interplay of tensions or attitude*\nabstracted fro® the poo® without 41 rootly or indirectly personifying tho tV\nstractions. This 1* tho familiar process of creating an illusion, and It ti\nindispensable ia creating on inducement external to tho peon.* But since tho\nentire Illusion In thio onto Is to ho superimposed on n pce» from which tho to\npersonifications havs boon abet me tod? and sinew thoso personified abstractions\nnro presumed to bo configurations of tho mind's exportoaoo? it becomes n erit-\nienl question as to whoso Bind Is being porsoaiflod. Tho view w#e held en-\nphatienlly in the present sxpsriment that the experiential Interpretation of\ntho pooe, and therefore any personification# of tho wind's necessities 'in¬\nside' the peon, an* altegsthsr of tho reader's or critic's identity, not of tho\npoet's. Their relative accuracy with respect to the poet's actual experience,\nor the poea't actual genesis, is not a part of this question. Ivon if the in¬\nterpretation is assumed to be essentially true to the poet's Bind, it was felt\nthat an unwarranted and possibly misleading imputation to the poet should be\ncarefully avoided, la Appendix A of this report it will be found that one of\nthe consultants, Professor Miles of the University of California, took oxeopt-\nion to the project's emphasis on the Interpretation as the experience of tho\nreader, and argued for a kind of contextual presentation which crested »the\nfiction of the poem itself**. l*rofeeeor Miles would prefer the broaden sting\nformat to ^dramatise the creation, that is the created situation, jot the\nhypothetical response*, fhie objection at very least suggest* the fundamental\nIn some nessure this statement applies to any interpretive criticism, whether\ndramatic or discursive. The critic writing formally for a professional audience\nusually assumes that his insights ar« eo-extensive with the peea, and creates,\nin the critical return itself, an illusion of action within the poem. Mo would\nnot otherwise persuade. It is where personifications are used as a deliberate\ndevice to characterise the poor's genesis that special attention must be given\ntho identity of the personifying Bind, the immediacy of the loudspeaker dis¬\ncourages reflection on this matter, and opens the way to easy falsification of\nthe auditor's perspective."
}