{
  "id": "d1718-0",
  "text": "OFFICERS\nEXECUTIVE COMMITTEE\nPresident: JOS. F. WRIGHT, WILL\nVICE-PRESIDENT: W. I. GRIFFITH, WOI\nIOWA STATE ODLLEBE\nof\nFIRST ZONE: DANIEL E. NOBLE, WCAC\nCONNECTICUT AGRICULTURAL CCLLEDE\nSTORRS, CONNECTICUT\nSecond Zone: g. R. Faint, WJBU\nBUCKNELL UNIVERSITY\nLEWISBURB, PENNSYLVANIA\nSecretary-Treasurer\nB. B. BRACKETT, KUSD\nUNIVERSITY OF SOUTH DAKOTA\nVERMILLION. SOUTH DAKOTA\nCc>lle.g<a £2y\\A Urvivtei^ily\nDecember 12, 1932\nTHIRD ZONE: GARLAND POWELL, WRUF\nUNIVERSITY OF FLORIDA\nGAINESVILLE, FLORIDA\nFOURTH Zone: H. G. INGHAM, KFKU\nUNIVERSITY OF KANSAS\nLawrence, Kansas\nFIFTH Zone: H. V. CARPENTER, KWSC\nSTATE COLLEGE OF WASHINGTON\nPULLMAN, WASHINGTON\nAT LARGE: R. C. HIGGY, WEAO\nOHIO STATE UNIVERSITY\nSPECIAL BULLETIN\nTO MEMBERS\nof\nTHE ASSOCIATION OF COLLEGE AND UNIVERSITY BROADCASTING STATIONS\n(and educational officials cooperating with the Association)\nAttached you will find comments supplied the office of the\nExecutive Secretary of your Association by Mr, Joe Ff Wright,\nDirector of Radio Station WILL of the University of Illinois,\nand President of the Association of College and University\nBroadcasting Stations, The comments attached deal with the\nrecent meeting of the National Committee on Education by Radio\nin Washington, Mr* Wright, as president of our Association,\nrepresents our group in these conferences, I feel that the\nentire membership will be glad to read of the developments in\nthe conference held some ten days ago, and in order to stimulate\nfurther reports of this type I will sincerely appreciate your\ndropping a note to Mr. Wright acknowledging receipt of this\nbulletin and supplying this office with a carbon copy of your\nletter so that we may complete our records.\nMay I again at this time ask for reports of radio interest from\nany of our station managers or directors as your Association is\nquite anxious to stimulate the exchange of ideas among the various\ngroups throughout the United States,\nSincerely yours,\nCy, 771\nT, M, Beaird,\nExecutive Secretary"
}