{
  "id": "d72-30",
  "text": "EDUCATIONAL BROADCASTERS\nNATIONAL ASSOCIATION OF\nNAEB\n119 GREGORY HALL\nURBANA, ILLINOIS\nMEMO\n/\nNovember 9» 1964\nTo * Harley, Hill, Fellows\nFrom! Betty McKenzie\nRe* Changes in Newsletter as discussed in Austin\nFrom my notes from our Meeting in Austin, I am proceeding under these\nassumptions s\n!♦ There will be no regular Washington Report after January 1, 1965,\nexcept as occasional papers reporting in depth on special issues.\n2. Beginning with the January issue, we will mall the Newsletter via\nfirst-class mall to all institutional members; remainder will be\nmailed third-class as in the past.\n3. Bill Harley is designing a new logo for the Newsletter, which Jim\nFellows will have an artist complete and send to me by December\n10 at the latest, for the January Newsletter. Otherwise, I will\ngo ahead, with the regular logo.\n4. Beginning with the January issue of the Newsletter. “Personnel\nAvailable*1 will no longer appear as part of the regular Newsletter.\nThe Individual Member Division will handle this, and will mimeo\nor otherwise print and mail to me (Dotty tells me that if this is\nmailed fourth-class special handling It will get here in about\nfour days, and the cost will not be exorbitant) in time for mail¬\ning with the Newsletter to Institutional members. (We will need\n600 copies of this insert, and we will have to have them in our\nhands by the 25th of each month in order to be sure we do not\nhave to hold up the mailing of the Newsletter.)\n5* “Positions Available** will continue to appear in the regular News¬\nletter. with copy coming to my hands by the 15th of each month\nfrom the placement office. v.\n6. Members will hear of these changes through a Washington Report\nto be mailed with the December Newsletter.\nIs there anything I’ve forgotten? Since my notes were on a paper\nnapkin which was squushed around in my purse for several days, I’m\na little hazy in translation.\nIt was good to see you all again.\nMrs. Betty McKenzie\nOffices at 59 East Armory, Champaign, Illinois"
}