{
  "id": "d72-38",
  "text": "ofth NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 30, NO. 5 WASHINGTON, D.C. MAY, 1965\nNAEB Appoints Four\nDirectors at Large\nFollowing are the first Public Member Directors to be ap¬\npointed to the NAEB Board: C. Scott Fletcher, management\nconsultant, former president of the Fund for Adult Educa¬\ntion, Miami; Dr. Fred Harrington, president of the Univer¬\nsity of Wisconsin, chairman of the special committee on fed¬\neral legislation of the National Association of State Univer¬\nsities and Land-Grant Colleges, Madison, Wisconsin; Irving\nHarris, president of Standard Shares, Inc., member of the\nChicago Educational Television Association, Chicago; and\nLeonard Marks, communications attorney, member of the\nboard of Communications Satellite Corporation, Washington,\nD.C.\nSchlaak Named to Board\nOtto F. Schlaak, manager of WMVS and WMVT, Milwau¬\nkee, has been appointed to the NAEB-ETS Board of Directors\nto fill the vacancy left by Keith M. Engar. Engar resigned\nL from the Board when he left his position with KUED, the\nUniversity of Utah ETV station.\nSamoa Needs ETV Personnel\nThose in charge of the NAEB Samoan ETV project would\nlike to hear from persons who qualify as producer-director,\nphotographer, engineer, chief engineer, cameraman, supervisor\nof adult education, supervisor of physical education, supervi¬\nsor of guidance, supervisor of in-service teacher education,\nand librarian. Appointments would be for a minimum of two\nyears in Samoa. Address inquiries to Vernon Bronson, NAEB,\nWashington.\nCopyright Hearings Postponed\nCongressional hearings on the proposed revised copyright law\nare scheduled to begin May 12. They were postponed from\nthe earlier named date of April 28.\nRaise Funds for Robert Bohan\nSome friends of Robert Bohan have started a fund to help\nhim and his family financially during his long recovery period\nfollowing a knife attack in mid-February. He was attacked in\nhis own yard by a man living with a neighbor.\nAs we go to press he is reported to be recovering from\nserious abdominal and other wounds, but it is expected to be\na long, slow process. Surgery, several blood transfusions, spe¬\ncial nursing care and medications have already been required.\nHe has been at St. Petersburg Junior College, where he\nis chairman of the radio-TV department, for about five years.\nPrior to that he was at Auburn University.\nThose who would like to help should send contributions\nKs to Kenneth B. Hobbs, 3052 S. Dorchester Road, Columbus,\nOhio 43221. Hobbs requests that checks be made out to: K. B.\nHobbs for Robert Bohan.\nState ETV Officials Plan Meet\nSome officials of state ETV organizations plan an all-day\nmeeting in connection with the IERT in Columbus, Ohio. All\nsuch state ETV representatives are invited to attend, begin¬\nning at 9 a.m., Wednesday, June 2.\nAmong the items scheduled for discussion are these high¬\nlights : a proposed membership classification for NAEB af¬\nfiliation, developments in ETV assistance contained in new\nfederal legislation, and a plan for action to acquire further\nfunds for state agencies for ETV development. For further\ninformation, write to Larry Frymire, Room 1149, State Capi¬\ntol Building, Sacramento, California 95814.\nNAEB Staff Changes\n• John Witherspoon, formerly associate director of NER\nand also of ECS, has been named director of the ECS proj¬\nect.\n• Coy Ludwig, assistant director of the NAEB Office of\nResearch and Development, has resigned effective May 31 to\nreturn to school to work on an advanced degree. Jack Brown,\nwho has been working on a Great Plains ITV Library proj¬\nect, will join the NAEB research and development staff.\n• Frederick Breitenfeld, Jr., who has been directing a spe¬\ncial seven-month project for NAEB-ETS, has been appointed\nassociate director for ETS.\nNER Board Meets\nAt the invitation of the Johnson Foundation, members of the\nNER Board of Directors met March 25-28 at Wingspread,\nthe foundation’s conference center in Racing, Wisconsin.\nHighlights of the meeting were—\n• Preliminary discussions with foundation officials\nwhich may lead to national conferences on educational radio,\ntentatively scheduled for this fall.\n• Plans for future cooperation—such as NERN use of\naudio materials on file at Wingspread and Johnson Founda¬\ntion use of NERN duplicating facilities.\n• Discussion of NER membership, including the merits\nof an incentive plan for Class C (under 1 kw) stations, plans\nfor commercial station use of NERN programs, and the re¬\nview and retention of present rates for educational stations.\n• Creation of a special committee of the Board to\nfurther explore many of the items discussed. Members of the\ncommittee are E. G. Burrows, representing the Board; Dick\nEstell, chairman of the NERN program committee, and Rob¬\nert Underwood, network manager.\nTo NAEBers of the Midwest\nMidwesterners are reminded that June 1 is the deadline for\nreceipt of bids for the 1968 national NAEB convention. In¬\nformation to be included in the bid is outlined on page 1 of\nthe March Newsletter.\n1"
}