{
  "id": "d1446-1",
  "text": "NAEB NEWS LETTER....Jan 15, 840....page 3\nNASU REPORT WORTH READING\nThe report of the Committee on Radio Broadcasting to the National\nAssociation of State Universities is well worth reading. Some of\nthe things considered in the report are:\nProgram Emphasis9 Libraries, Radio courses, Recordings, Radio\ncouncils. Cooperation, Recognition of radio service within educational\ninstitutions, The tendency of most educational institutions to\nprovide adequate staff, Promotional publicity, and Finance.\nNo doubt copies of this report may be found around the state\nUniversities. Better look\" for the report and read it. The committee\nwas composed of President A. G, Crane, chairman; President I. De\nWeeks; John J, Tigert; and Clarence A, Dykstra.\nJULLIARP SCHOOL OF MUSIC ON WNYO\nThe Institute of Musical Art of the Juilliard School, one of the\nnation*s foremost professional music schools, took to the air for-\nits first regular radio series on January 10 s when WNYC inaugurated\nweekly concerts under official Juilliard auspices.\nThe programs will feature outstanding students of the school, including\nvocalists, as well as violinists, fend other instrumentalists. The\nString Quartet, Trio, and String Orchestra of the School will also\nbe heard from time to time.\nThe Quartet launched the scries Wednesday, with a performance of\nBeethoven68 Quartet in 0, Opus 18, No. 3a\nAlthough this is the first time that the regular session of the*\nJuilliard School has broadcast regularly, WNYO for the past two\nyears has aired the annual Music Festival of the Juilliard summer\nSchool.\nGeorge A0 Wedge, Dean of the Institute, believes that ohe modern\nmusician must adapt himself not only to the requirements of the\nconcert hall, but also tb broadcasting. Commenting on the WNTC ,\noeries. Wedge said, \"We are glad to let the radio audience hear\nsome of the work of our students. At the same time, einoe Radio\ntoday is one of the leading factors in the development of music,\nwe welcome the opportunity to give radio experience to our students.\nThe Juilliard School numbers among its graduates members of the\nnation8s major symphony orchestras, numerous concert artists and\nteachers, and many of the country*e important young composers and\nconductors.\nWHA RATES PUBLICITY\nPase 2 of EDUCATIONAL RADIO AMD RECORDING of January 4th carries a\nstory about the activities of WHA, Other articles include one by\nMiss^Blanche Young, Director of Radio Activities for the Indianapolis\nPublic Schools, on \"Utilizing Radio in Indianapolis Schools ; Radio\nAdvertising\"; and \"On the Record ,"
}