{
  "id": "d1827-0",
  "text": "Vol. IV, No. 2 IXiPont Circle Building, Washington 6, D.C. January 25, 19&3\nCOX NOMINATED AS COMMISSIONER\nPresident Kennedy has nominated Kenneth Cox, now head of the FCC Broadcast\nBureau, to serve the balance of Commissioner Craven's term (when he retires), and a\nfull seven-year succeeding term. Mr. Cox had the strong backing of Sen. Warren\nMagnuson, Chairman of the Senate Commerce Committee and a long-time friend and\nassociate.\nSucceeding Cox as chief of the Broadcast Bureau will be James B. Sheridan,\neconomist with the Commission for many years. Other shifts are expected shortly.\nMOVE TO SECURE NEW QUARTERS FOR FCC\nA committee has been organized in Washington to try to secure better housing\nfor the FCC. The all-industry group, on which the educational constituency is\nrepresented by Pres. Harley, was formed in recognition of the fact ^hat the space\nsituation at the FCC is already critical and will become more so with the added\nstaffing imposed by space communications development. Currently the FCC offices\nare located in two other places in Washington in addition to its over-crowded location\nin the Post Office Building. Representatives of the Committee called on Senator\nMagnuson recently to enlist his support for a move to find or build a building of its\nown for the FCC.\nNAEB STUDY DOUBLES NUMBER OF UHF CHANNELS\nlast week NAEB released a report of its study of nationwide assignments of\ntelevision channels by use of electronic digital computer methods. The report proposes\na saturated UHF table of 3,298 assignments, placing every available channel in the\nUHF part of thfe spectrum in some community. The result of the study:\"over twice the num¬\nber of useable channels have been added to the FCC table, most of these channels\nhave been placed where they are needed, either now or in the future, and this has been\naccomplished without disturbing any of the presently active or near active stations,\nwhile adhering to the established rules and standards of the FCC.\"\nThe report recommends that the FCC use the table thus derived from the computer\nas a basis for allocation determinations to meet present and future needs of education\nand other television broadcast services.\nFCC spokesmen indicated that a new nationwide assignment of channels, taking\ninto account the NAEB computer study and its own manual calculations, would be released\nfor comments shortly.\nPACIFICA FOUNDATION QUERIED\nThe Senate Internal Security Subcommittee held closed hearings (week of Jan.\n7) looking into possible Communist influence in operation of the three non-commercial,\nlistener-supported stations of the Pacifica Foundation: KPFK, Los Angeles, KPFA,"
}