{
  "id": "d1883-0",
  "text": "NEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXVI NO. 6 JUNE, 1961\nGrants-in-Aid Winners Announced\nThe Grants-in-Aid Committee met in Chicago\nMay 8 and 9 and picked the following to receive\ngrants:\n• Empire State FM School of the Air. Spanish\nToday. Re-production of sixteen 15-minute programs,'\noriginal production of fifteen 15-minute programs\nin beginning Spanish for school use.\n• Western Michigan University, WMCR. Where\nMinds Meet. Thirteen 30-minute programs dealing\nwith communications in various aspects.\n• The University of Texas, Radio-Television.\nSpeaking of Mexico. Twelve 30-minute programs,\n“twice-produced” discussions dealing with Mexican\nproblems for American listeners and with American\nproblems for Mexican audiences.\n• University of Wisconsin, WHA. Smoke? Six\n15-minute programs dealing with the teenager’s de¬\ncision about smoking in the light of contemporary\nmedical and technical knowledge.\nNew NAEB Magazine to Appear\nMembers of the NAEB Board, meeting in Co¬\nlumbus in April, decided that it was advisable to\nlook into the possibility of issuing a monthly maga¬\nzine, with advertising, to include some of the articles\narid columns which now appear in the Journal,\nas well as expanded versions of some of the items\nwhich now appear in the Newsletter. Pictures will be\n.an important part of this publication.\nA pilot issue will appear instead of the Septem¬\nber Newsletter. If the amount of advertising\nand the enthusiasm of recipients seems to warrant\nit, this will probably become a monthly publication as\nof January, 1962. The NAEB Journal in that\nevent will become a quarterly publication. The “Wash¬\nington Report” will continue to be issued as usual.\nARTICLES NEEDED\nPlease send possible articles for this publication\nby July 1 to the NAEB Publications Editor, 119\nGregory Hall, Urbana, Illinois. The more photo¬\ngraphs included for selection, the better.\nAttention, Individual Members!\nThis is the last month for Individual members\nto pay for NAEB memberships at the current rate\nof $7.50 per year. As of July 1, dues become $10 a\nyear. Members, or prospective members, may pay for\nas many years in advance as desired at the $7.50\nrate, if payment is received in the Washington office\nbefore June 30, 1961.\nNetwork to Inaugurate Lecture-of-the-Week\n[Ed. Note: The NAEB Network Acceptance Commi-\ntee has taken up the challenge outlined by O. Leonard\nPress in the May Newsletter. Following is the result\nof this committee’s deliberations on his second recom¬\nmendation—and this is an initial step toward full\nimplementation of his ideas.]\nThe NAEB Network plans to air some of the\ngood single lectures recorded at member institu¬\ntions. These have seldom been submitted to the Net¬\nwork, but almost all stations record single lectures\ngiven by their own faculty or important guests.\nEach radio station is asked to send to Bob Un¬\nderwood, at Network headquarters in Urbana, two\nthings:\n• One such locally recorded lecture (not from a\nseries), on any subject, either by a local lecturer or\na guest.\n• A list of other single lectures on the station’s\nshelves, which might be tapped at a later date.\nRegular submission forms may be obtained from\nthe Network office. Please include full information\non the lecturer, his title and position, his topic, the\nlength of the lecture (between 45 and 60 minutes is\npreferred), and whether or not permission has been\nobtained for national distribution of the lecture.\nThe Network acceptance committee will audit\nthe lectures and make selections for the lecture-of-the-\nweek series, which will be offered as soon as a safe\nbacklog of lectures has been built up. Lectures will\nbe judged on:\n1. Prominence of lecturer.\n2. Importance of subject.\n3. Quality of recording.\n1"
}