{
  "id": "d1883-3",
  "text": "NAEB, WASHINGTON, D. C.\n... is the NAEB's new cable address. The telephone number\nis NOrth 7-6000. Address: Suite 1119, 1346 Connecticut\nAvenue, N. W., Washington 6, D. C.\nREPRINTS OF BURNS' 'SPEECH AVAILABLE\nWrite to NAEB's Urbana office for free copies of the\nspeech delivered by RCA President John L. Burns at the\nNAEB-IERT luncheon in Columbus in April. The speech will\nalso appear in the May-June issue of the NAEB Journal.\nPRESIDENT'S\nAt a meeting of the JCET Board in January,\nplans were made for a modification of JCET in\nwhich it would continue to serve as the policy formu¬\nlating forum for the educational community in na¬\ntional issues affecting educational broadcasting, but\nits staff functions would be assumed by NAEB\nand NETRC. The ipresidents of the two organizations\nwere invited to submit a proposal for a cooperative\nreallocation of the JCEB staff functions.\nIn attempting to work out the related roles of\nNAEB and NETRC in their responsibilities as con¬\nstituents of JCEB (changed at NAEB’s suggestion\nso that radio would be included) the discussions got\ninto other areas of activity beyond those formerly\nof JCEB concern. Accordingly, several drafts were\nprepared for a proposed “letter of agreement” which\nattempted to outline certain areas of priority or major\nresponsibility to be assumed by NAEB and NETRC\nin serving educational broadcasting.\nThe idea certainly appeared serviceable and\nworthwhile—to work out between the two operating\nagencies in the field a mutually reinforcing alliance\nso that we could productively reinforce, rather than\nwastefudy oppose, one another. Such a basic blue¬\nprint could result in cooperative directed effort vast¬\nly more potent than the effect of both agencies work¬\ning independently.\nSincere efforts were made to construct such a\ndocument. But it couldn’t be done! The more we\nslaved over words and became immersed in specifics,\nthe more it became evident that attempts to achieve\nsuch a legalistic document were futile—and probably\nunwise.\nThe position of the executive committee was\npresented to the NAEB Board at Columbus, by the\nchairman of the TV Board, Loren Stone. I have\nasked him to let me include his statement in my\ncolumn:\nI am sure it will be much better for the Center and for\nNAEB, and for the development of the type of cooperative\nrelationship we all want between the two organizations—and\nwithin the entire educational broadcasting movement—if we\nabandon any attempt to create a document which would spell\nout “areas of interest” or “areas of primary responsibility.”\nWe must work from the premise of confidence that the\nCenter’s desires and motives are, like those of NAEB, to do\nwhatever it can to further the interests of educational broad¬\ncasting. We in NAEB should give every encouragement and\nsupport to the Center’s doing everything it can do with the\nfunds and manpower it has at its disposal, for it has resources\nof magnitude which we don’t have, and by its nature—not\nRe NAEB Board Action\nIn the May Newsletter there was an item\nstating that the NAEB will “continue” as a constitu¬\nent member of JCEB. It has been pointed out that\ntechnically the NAEB became a member of JCEB\nat that time. (Previously the NAEB had been a mem¬\nber of the JCET, predecessor of JCEB).\nCOLUMN\nbeing a membership organization which must be responsive\nand considerate of the many problems and interests of a\ndiverse membership—is in a position to make decisions and\nmove in many areas which NAEB cannot do, or cannot do\nrapidly.\nWe should not, therefore, try in any way to limit the areas\nin which the Center should be operating. The Center has\ncertain basic responsibilities growing out of its charter and\nthe directives of its Board. It certainly cannot and should\nnot limit its own growth by agreeing to take a secondary\nrole in any area important to its fulfilling its own responsi¬\nbilities.\nAt the same time the Center will, I am sure, recognize that\nit, alone, cannot do all that educational broadcasting needs\ndone; and that it has as great—or perhaps a greater interest\nin helping develop a strong NAEB than have any of us who\nare, as individuals or institutions, working to maintain a\nstrong professional organization. There is much that the\nCenter should want done that can be done effectively and\neconomically only by a membership organization. Money does\nnot buy the type of service which NAEB members give\nthe movement through their organization.\nAny attempt to set down areas of special interest will only\ncreate, inescapably, a set of lines which cannot help but be\ncrossed over, and which will give rise to more of the suspi¬\ncions and accusations which have characterized too much of\nthe relationship of the past.\nIf we recognize that the Center has a responsibility to do\neverything it can to strengthen the stations it serves, and to\ncreate a climate in which the present and yet-to-come stations\ncan be strong, we will not begrudge its doing anything it\nbelieves it needs to do to accomplish these ends.\nThe Center should recognize that included in those things\nwhich mean strength for its stations is a strong professional\norganization—which only the institutions and the individuals\ncan create and maintain—but which the Center must support,\nstrongly.\nIt should not begrudge the membership organization doing\nthose things which it must do to provide development for its\nmembership and give its members reason for association.\nThe Center should not want, in any way, to limit the areas\nof activity which NAEB should be undertaking.\nWe must recognize there are many areas of common interest—\nas there are between NBC and NAB, for example; and that\nboth our organizations will be active, separately and together,\nin many matters. If at a staff level, we can honestly respect\nthe sincerity and ability of each other; and operate with a\ndesire to help the other and keep him informed of those of\nour activities in which we know he will be interested, I see\nno reason why a most harmonious relationship cannot be\nestablished and continued without each trying to limit the\nother by a set of “writings.”\nIt was the consensus of the Board that the posi¬\ntion stated above should govern our general posture\ntoward NETRC and that the cooperative working-\nrelationships should be worked out on a day-to-day,\ncase-by-case basis by the officers of the two agencies.\n— William G. Harley\n4\nNEWSLETTER"
}