{
  "id": "d568-100",
  "text": "-2-\nthe time offered taxes that institutions ability to produce TV shows to .\nthe utmost — the date for the TV code acceptance (March 1) all seem to\npoint to increased activity against making the proposed allocations\ntable finalo Anything more concrete that you can offer, Ralph?\nNEW YORK CITY AGAIN:- George Probst as chairman of the committee of\nfive asked me to sit in on their meeting in NYC Dec. 8 and 9° There\nthe committee asked me to sit in on all of their future meetings® (This\nplus increased effort on the part of both Harley and me to keep each\nother informed of our activities should improve liaison appreciably) •\nThe committee approved the release date for the IA study (about Dec® 19);\napproved the NYC study for January; applauded the action of Frank SchooXey\nand the subsequent board approval of fiscal plans for the monitoring funds\nauthorized the executive director to handle administrative details of\nthe Monitoring fund; and authorized the executive director to attempt\nto secure the services of Robert K. Merton of the Bureau of Applied Social\nResearch, Columbia University to work with Smythe on the NYC study\n(which I did — and he accepted, althou^i the relationship will be dif¬\nferent than in the past)• The committee also heard reports on the\nLowell project from Harley and the ISC-TV project from Hullo Complete\nreports on these will be issued by Harley and Hull® However, the Com¬\nmittee did agree to meet at Ames, Iowa, Jan* 5 and 6 to hear at least\none program in ea«h of two Lowell series and view at least one program\nproduced under the grant at ISC. The committee moved on to its non-\nadministrative area and considered proposals for further grants. In\nthe main, these consisted of a continuance of present efforts, but some\nnew areas were discussed. The committee authorized the executive\nsecretary to send complete minutes of the meeting to all members of the\nBoard of Directors of NAEB (about Dec. 20). This meeting undoubtedly\naccomplished more in two days than any previous one. Implementation\nof the decisions made will keep us busy for some time to come.\nVJBOE, CLEVELAND PUBLIC SCHOOLS:- Returning from New York I paid ray first-\nvisit to the fine layout of Bill Levenson and Jay Stillinger. Ample\nstaff, space and equipment, plus complete cooperation from administration\nand teachers makes this the outstanding operation it is. As a guide to\nother schools, Cleveland spends &1.0Q per pupil per year on radio and\nanother dollar on AV. They are now into TV with a weekly hhS to 8:00\np.m. Tuesday nite spot. A PR show with the Superintendent of Schools\nas MC. They figure it takes l|- man weeks of staff time to prepare for\nthe quarter hour plus the time of the talent on the show winch Is, of\ncourse, students and teachers. With this amount of preparation they are\ncompeting with a Pulse rating of 1.3 according to the station management.\nXMAS:- This will more than likely be the last of these letters for 1951.\nSo 1*11 take this opportunity of wishing you a Very Merry Christmas, and\nask you to join me in making 195>2 the best year yet for educational\nradio.\nJim"
}