{
  "id": "d568-110",
  "text": "9\nto be given by top names, and that many of the people we would need and want\nwould be serving on the FAE board. Further, it would be rather silly for\nthe FAE to be supporting two civic broadcasting boards simultaneously opera¬\nting in relation to a Washington project.\nThe question was raised as to what should be done in the civic affairs and\npublic discussion area. Harley had been spending the previous ten days see¬\ning people and investigating various lines of approach. Harley proceeded to\ndescribe the various possibilities he had developed as a result of this in¬\nvestigation. The premise underlying his approach were: that this project\nwas assured, now, of a second year grant; that there was no single idea to\nbe found that justified the expenditure of all the money allocated to this\narea; that the best and most rapid action would result from simultaneously\nputting three or four talk and discussion projects into production on an ex¬\nperimental basis; that after the second year grant became available in July,\nit would be possible to examine the accomplishments of each of these pilot\ndiscussion projects to determine which should be expanded and continued; that\nthere was great need to show accomplishment in this area by the July meeting\nof the FAE. It was further assumed that negotiations with McCarty would\nmake %rley* s services available at least through July 30. Siegel said that\nthe only pressure for haste in getting this project started that he could\nsee was occasioned by its relation to the coming political conventions.\nHarley listed the following possibilities:\n(1) A European interview series of talks, using Milton Mayer, who has been\nin Europe for a year and is now professor of social science at the\nUniversity of Frankfurt. Mayer is an experienced newspaperman and\nradio performer. He is not a government employee. Harley added that\nit might or might not be possible to use cooperation with the American\nFriends Service Committee. (In later discussion it ms unanimously\nagreed not to use in any formal way the cooperation of the AFSC.)\n(2) An international discussion series. See the Neil Morrison proposal\nattached as Appendix A.\n(3) The Talkback show. Harley had described this before. Briefly the idea\nis to have an authority make a statement which would be sent out to\nNAEB stations. League of Women Voters groups, the 16 FAE test cities,\nand others. These groups would arrange for local citizens to talk\nback to the authority. Recordings of these discussions would then be\nreturned to the authority for rebuttal, and from this material a show\nwould be made.\n(4) A series of public policy problems of the mass media. Fifty-two pro¬\ngrams would be produced using many of the specialists and experts in\nthe NAEB, the FCC, etc. These talks would be outlined in overall\nplanning and consultation with Las swell.\n(5) Coverage of the political conventions. (Lengthy discussion of this\npossibility revealed that no one had turned up a distinctive, unique\nidea that would insure competitive superiority of the NAEB over the\ncommercial service coverage of these conventions, and in addition there"
}