{
  "id": "d568-111",
  "text": "10\nremains an elaborate and costly physical facilities problem. This\nidea, consequently, was given up.)\nNo report is made of the other four or five program ideas that Harley had\ninvestigated and which were found either to be impossibilities or would\nhave to be podjponed until later.\nHull immediately voted for the first and third ideas. Wheatley expressed\nstrongly his view for the necessity of getting an expression of the opinions\nof ordinary people. As a variant of the Talkback suggestion, Siegel described\na series which measured audience reaction through use of a mechanical \"cricket.\"\nThe title of this series is \"Ask the Audience.\" He said that it is possible\nto measure audience reaction by means of the sound level of noise made by\neach person with his cricket snapper within 6% of accuracy. The advantage\nis that an immediate, lively, statistical measurement of audience reaction to\nquestions they have heard the experts discuss can be obtained. The reliabil¬\nity of the measurement was discussed at some length. The idea of testing\npeople first and having the composition of the audience figured by analysts\nifas brought in, as was the idea of having people vote on certain issues as\nthey enter the hall and then again (via the cricket snappers) after they have\nheard the discussion. It was agreed that Harley should get guidance from\nRobert Merton on the Talkback area.\nProbst expressed himself as being in favor of doing the first four suggestions\nand of dividing the $45,000.00 assigned to this area among them. Harley sug¬\ngested that as a first step he should hire a person who could supervise this\narea. He pointed out that this person could also be his general assistant\non the project and might be considered to be Harley’s successor. Probst put\nthis proposal in the form of a motion, which was agreed to.\nProbst thought that Harley should start to work on ideas 1 and 2 at once.\nProbst stated that he thought between $8,000.00 and $10,000.00 should be\nallocated to idea number one. This would be for 26 shows. Siegel questioned\nthis and mentioned that he got a lot of shows from overseas for free and thought\nwe could do likewise. Probst disagreed, saying that this would be only about\n$500.00 per show, and he didn’t think you could pay participants and the\nrecording costs for any less.\nWheatley expressed himself more firmly this time about the necessity for local\nparticipation. He quoted at some length from the FAE report, particularly\nthose parts which pointed to the FAE interest in arousing local thought and\naction. He thought we should do some experimentation with discussion programs.\nHe thought the big question yet to be answered is hrw people can be educated through\nparticipation in discussions. He thought maybe we could help find the answer\nthrough experimentation.\nHarley asked for some immediate action. He thought that numbers 1 and 2 were\nthe easiest to get started on. Wheatley at first expressed some opposition to\nsuggestion number one, but later decided that this was a sound experiment and\nworth doing. Hull emphasized the need for taking immediate action. Harley\nsaid that he was sure that McCarty would agree that we should move ahead very\nrapidly and get something done on these suggestions. The lengthy discussion\nof the Talkback possibility led to the decision that Harley should decide what"
}