{
  "id": "d568-113",
  "text": "APPENDIX A\nCOPY OF\nPROPOSAL FOR INTERNATIONAL DISCUSSION SERIES - THE PROSPECTS FOR PEACE\nBy Neil Morrison, Supervisor of Talks and Public Affairs, CBC\nMarch 27, 1952\nI. Proposal\nThe following is an attempt to outline in tentative fashion the proposal that,\nin the discussion field the National Association of Educational Broadcasters might\nconsider the possibility of initiating and presenting an international series about\nsome aspects of the world crisis in cooperation with other interested broadcasting\norganizations.\nII. Reasons for an International Discussion Series\n1. The most urgent problem of our time is world peace.\n2. There is widespread anxiety and concern in the minds of people everywhere\nabout the possibility of another world war. A series which attempted to examine\nrealistically and objectively the prospects for itforld peace and specific areas af\ntension would meet a need for information, understanding, and clarification.\n3. Such a series of broadcasts, if based on a genuinely international approach\nto planning and production, would break new ground in the field of communication.\nWhile there have been extensive developments in international broadcasting in recent\nyears, there have been few, if any, real attempts to plan such programs on a coop¬\nerative* international basis. Most efforts in this field have been simply on an\nexchange basis or a projection of the national agency concerned either in gathering\ninformation for their own listeners at home, or in disseminating it abroad. This\nproposed program should not be regarded as a national project nor as an attempt to\npropagandize national policies and points of view on an exchange basis, but rather\nto promote mutual understanding.\n4. There is an urgent necessity on the North American continent, and elsewhere,\nto hear the various points of view held by peoples of other nations presented\ndirectly and discussed freely.\n5. The dominant role of the United States in world affairs since the end of\nthe war has drastically changed international relationships. This has raised many\ndifficult problems of adjustment of relationships between the Western powers and\nthere has been evidence recently of divergence of policies, mutual criticism, sus¬\npicion, and even mistrust which should be explained and freely discussed in the\ninterest of greater understanding. It would be valuable for Americans to have an\nopportunity to hear, for example, British and Canadian reactions to various aspects\nof United States policy and, conversely, for Canadian and British listeners to hear\nsome of the reasons for American actions and to understand something about the\nvarious political forces at work in the United States which affect national policy.\n6. Such a project seems more likely to arouse attention and interest and to\nhave a higher publicity and promotion value than more orthodox discussion series\ndealing with national or regional problems, or in the main presenting only American\nopinions about world affairs."
}