{
  "id": "d568-114",
  "text": "2\nIII, Possible Organization and Procedure\n1. Such a project should be planned and organized on a joint cooperative basis\nwith coordination by a director appointed by and responsible to the NAEB.\n2, Aside from the expenses for the director and his office facilities, and\npossibly some traveling and communication, there should be a sharing of costs by\nthe participating organizations in such things as payment of speakers, use of studio\nand recording facilities, wire lines, and beam circuits, etc. Division of respon¬\nsibility for expenses would need to be worked out, but it is not expected that\nother broadcasting organizations should, or would want to take a free ride in a\njoint project of this kind at the expense of the NAEB*\n3* Such an international program might be set up to include participation of\nNAEB, CBC, BBC, the Australian Broadcasting Commission, and All India Radio,\nalthough it might be preferable to begin with a smaller group in order to avoid\nunnecessary complications* If a working program can be planned by NAEB, CBC, and\nBBC, ABC and AIR could be asked to contribute on a per occasion basis. If an\ninitial experiment in this direction with three national agencies proved success¬\nful, then it might be desirable to broaden the scope at a later date.\n4* If it is decided to proceed with such a project, there should be a joint\nplanning conference with representatives of the organizations concerned for three\nor four days. It might be worth having such a conference simply on an exploratory\nbasis even without making a definite decision to proceed in advance. There should\nbe two or three official representatives from each of the three organizations who\nmight meet with the NAEB Advisory Committee in this field. It is likely that the\nBBC representatives in New York and in Toronto would be willing to attend such a\nconference, and it would also be important to have, if possible, some responsible\nofficial in a position of authority from BBC headquarters in London attend such a\nmeeting. Someone might be coming to America anyway or they might combine the con¬\nference with other business on this side.\nSuch a conference should have enough time to thrash out areas of interest and\nto line up a list of possible topics for discussion. It should also discuss in\ndetail the form of the program and techniques to be used as well as operating pro¬\ncedures, It would be important to reach as clear an understanding as possible on\nadministrative procedures. Experience indicates that if you clear the ground in\nadvance not only about purposes, subjects, and approach, but also determine the\ndivision of responsibility, this makes subsequent cooperation and execution much\nsimpler and more effective.\n5. An experienced, competent coordinator-director will need to be appointed\nby the NAEB. Each of the other broadcast organizations should assign some staff\nmember as their responsible liaison officer. The process of planning and organ¬\nizing can be simplified if, once such a project is under way, copies of all com¬\nmunications are sent to all those concerned.\n6. If such a plan is agreed upon, it would be important to secure the approval\nand support of the top authorities in the cooperating organizations (i.e., BBC, CBC)\nas well as commitments to broadcast the complete series in their national (or\nhome) services. Every effort should be made to avoid allowing any of the coopera¬\nting organizations to adopt a \"national” policy approach to the series. In other"
}