{
  "id": "d568-116",
  "text": "4\n6. It would probably be desirable to record the programs on tape or disc and\nfly copies to each cooperating organization for broadcasting at convenient times.\nV. Possible Techniques\nSuch a series should attempt to present: (a) authoritative information,\n(b) representative and important opinions and points of view, not only between\ncountries but within each country, (c) frank and vigorous discussion about basic\nissues, not just for its own sake, but to clarify and to stimulate thought.\nThere should be no attempt to manufacture argument nor to avoid real issues where\nthey exist. There should also be constructive efforts to find areas of agreement\nas well as disagreement. It is assumed that participants selected would be of the\nhighest possible calibre and would include top political leadership, both in and\nout of office. But there should also be a role for the non-expert, or at least\nopportunity to reflect popular opinion and attitudes in various ways. The follow¬\ning suggestions include some of the techniques which might be considered;\n1. Straight round-table studio discussion, generally using nationals of more\nthan one country.\n2. Town meeting type with live audience participation.\n3* Listening audience participation, e.g., questions live, recorded, or\nwritten in advance to open a program—possibly from another country. For example,\nquestions might be secured from Americans to put to a British panel on the subject\nof British policy in China or Iran, or questions might be worked in by the chair¬\nman during discussion.\n4. Use of a selected panel of questioners in same city as speakers or at\nanother point. E.g., a small group of listeners might be assembled in Ottawa tc\nlisten to statements and discussion by speakers in Washington or London and at\nhalf or two-thirds point in the program the listening panel could be brought in\nto put questions to speakers.\n5. Split program. There seems to be no reason why, if the topic lent itself\nto such treatment, you couldn’t have the first half of the program handled by a\npanel of three in London and the second part by a panel of three in Washington\ndiscussing exactly the same subject in order to provide contrast and breadth of\napproach.\n6. An international roundup of views using beam and line circuits. E.g., the\nBBC did a couple of very effective Commonwealth broadcasts of this type during\nthe China crisis in late 1950. The chairman was in London and one speaker each\nwas in London, Toronto, Sydney, and Bombay. Thus one got in one program a pic¬\nture of attitudes toward the problem from different countries around the world.\n7. A two-way international discussion which is a variation of the same tech¬\nnique allowing for more back-and-forth exchange of opinion. E.g., transatlantic\ndiscussions between Toronto and London with an M.C. and two speakers in each place.\ng. Recorded or live statement or statements by top-level government leaders to\nbe used at the opening or during the program, with content to be discussed by\npanel."
}