{
  "id": "d568-117",
  "text": "5\n9. Programs on particular areas might open with an on-the-spot report by a\ntop-flight correspondent setting the scene and providing background information,\ne.g., Iran. Or you might have two short commentaries, one by a British reporter\nand one by an American or by an Arab.\n10. Similarly recorded actuality items, or interviews with leaders or\naverage citizens from trouble spots under discussion, might be used. This need\nnot necessarily be confined to trouble spots.\n11. Reports describing popular attitudes on particular issues could be worked\ninto programs using opinion poll results, man-in-the-street interviews\nand quotes, selection of editorial opinion, etc. (along the lines of the Chicago\nRound Table Roving Reporter). CBC has found that Gallup Poll organization has\nbeen glad to cooperate as well as newspaper editors.\n12. *t is sometimes easier to get Cabinet members and other top-flight\nleaders for a press conference technique than for straight discussion, and fre¬\nquently this technique makes a more effective broadcast. You might open a group\nof three broadcasts on a related area with a press conference to be followed by\ndiscussion programs with non-official experts. E.g., you might have a group of\nCanadian, American, English, and Asian correspondents question Mike Pearson on\nCanada’s policy, role, and actions in the Pacific—or on Canadian-American relations.\nVI. Some Possible Subject Areas and Topics\nThe following are no more than preliminary and very tentative suggestions\nbrought forward only to indicate the kind of subject matter that might be con¬\nsidered. There are obviously many different methods of organization of topics,\nand this sort of thing would need to be worked out at a conference to achieve the\nmost effective results in terns of listener needs and interests, important prob¬\nlems, etc. While some discussion of general principles and policies is obviously\ndesirable, it has been our experience that you frequently get a more effective\ndiscussion if you can focus attention on a fairly specific aspect or area, and if\nnecessary, branch out from that rather than trying to tackle a broad, general\nquestion initially.\nA. The World Crisis - As I See It, or How It Looks From Where I Sit.\nRoundup of views from various parts of the world by both leaders and some\naverage citizens. Perhaps some discussion defining issues and setting the\nscene.\nB. Trouble Spots\n1. In the Pacific\n(1) Korea - IT Settlement and After?\n(2) China - How Should We Treat the New Pacific Power?\n(3) Japan - Her Future Role in Asia?\n(4) Southeast Asia - A New Policy for Old Colonies\n(5) India - Why Does She Act That Way?\n2. The Middle East\nTlFrran - Oil and Nationalism\n(2) Sues and Sudan\n(3) Israel and Her Neighbors"
}