{
  "id": "d568-121",
  "text": "APPENDIX C\nMEMORANDUM ON RADIO PROGRAMMING PROJECT IN THE INTEREST OF\nCREATING INTERNATIONAL UNDERSTANDING THROUGH THE EX!%RIMENT\nOF EUROPEAN INTERVIEW PROGRAMS\nBy George E. Probet, Chairman, Adult Education Committee, NAEB\nApril 3, 1952\nThe whole objective of the project here proposed is to use the\nresources, both at home and abroad, available to the National Association\nof Educational Broadcasters, to create radio programs that will contribute\nto an understanding of the basic conditions of life in Europe and a feel¬\ning of understanding for the views these people have of their problems,\nA deep sense of concern has led us to feel that it is important for Ameri¬\ncans to have the opportunity to hear the voices of peoples of Europe, We\nbelieve also that there are citizens of these other countries who can speak\ndirectly and candidly of their own feelings and of their own aspirations to\nthe American people unimpeded by the artificial screen of cable costs and\nnewsprint. To as great a degree as possible we propose to retain the ad¬\nvantages of person-to-person communication which we have found so effective\nand successful.\nThe proposed program efforts are to be organised in accordance\nwith the following planning and approach.\nInterviews and discussions with European peoples in\nprograms originating in Vfestern Europe\nThe National Association of Educational Broadcasters has competent,\nexperienced university people to whom it can turn in Europe to talk with and\nget the views of sensitive Europeans who are alive to the tragedy and dilemma\nof the conditions that surround them, and bring to the American people\nthrough the medium of recordings the direct expressions of these views. We\npropose to use such people as Milton Mayer, Professor of Social Science at\nthe University of Frankfurt; Robert Redfield, who is with UNESCO in Paris;\nLouis Gottschalk, European historian; Richard McKeon, philosopher and dele¬\ngate to UNESCO, etc.\nThe project director of this European interview program would be\nMilton Mayer. Mr. Mayer has had extensive newspaper and radio experience.\nHe is now in Europe with headquarters at Frankfurt, Germany. He has been in\nEurope for one year and has developed extensive contacts throughout Germany,\nay»d France, and has some acquaintance with problems in Yugoslavia, Austria,\nSwitzerland, and Italy.\nIn every instance the project will use existing technical .facilities\nThe physical facilities of the mass communications division of UNESCO, the BBC\nthe American Armed Forces radio service, and French and Swiss broadcasting\nfacilities are available. Production assistance in arranging some of the"
}