{
  "id": "d568-123",
  "text": "V\ns*\n3\nThe series should be organized so as to obtain either twenty-six\n15-minute programs or thirteen 15-minute programs and thirteen half-hour\nprograms* (This should be taken to mean that the 15-minute programs would\nactually time to 14 minutes 30 seconds, and the half-hour programs to 29\nminutes, 30 seconds.) In the process of executing the project, if Mr. Mayer\nfinds it easy to assemble forty or fifty 15-minute programs and wishes to\nreserve to William Harley the problem of judging, in marginal cases, which\nshould be included in the completed series, these forty or fifty recordings\nare to be sent by Mr. Mayer to Mr. Harley at WHA, University of Wisconsin,\nMadison, Wisconsin, and Mr. Harley will make the final selection in terms\nof which programs are most likely to be of significance and interest to the\nAmerican audience. This procedure would free Mr. Mayer to go right ahead\nas energetically as possible to get as many talks recorded as possible. It\nwould be desirable, however, for Mr. Mayer to think in terms of a target of\ntwenty-six programs which might be divided into groups of four to six pro¬\ngrams each. For example, Mr. Mayer might plan to get eight or ten inter¬\nviews and discussions with people in Italy with the final objective in mind\nthat Mr. Harley can choose the five or six of these that best give an inter¬\nesting and informative picture of certain aspects of Italian society. The\nseme allocation might be made in regard to the problem, for example, of the\nunification of Germany. Another allocation, aiming at a final group of five\nor six programs, could be made for the area of ”1eft-over people,” etc.\nA memorandum by William Harley and George Probst is attached which\ngives the suggested formulation of the overall title of the series and the\ngeneral identification and introduction to be used by Milton Mayer at the\nbeginning and end of each program.\nEstimated Costs\nIt is difficult to estimate costs accurately. The hope is to secure\ntwenty-six interview programs. This is a pilot project experiment. The\ndirective being given Milton Mayer is that he is to produce as many programs\nas he possibly can for $6,500.00. It is assumed that Mr. Mayer will devote\napproximately two months to this work and that for this he will receive an\nhonorarium of $1,000.00 per month plus traveling expenses. This would leave\nabout $3,500.00 to cover other expenses of the project for:\nTravel for participants\nHonoraria for participants\nEngineering costs\nMiscellaneous - Cables, tele,grams, secretarial,\ntelephone, air mail express, taxis, etc.\nIn considering the general problem of costs, it should be kept in mind that\nexperience in the problems of talk production is that it is necessary to con¬\ntact and work with a number of possible participants for each program actually\nproduced."
}