{
  "id": "d568-130",
  "text": "COOPER UNION FOR THE ADVANCEMENT OF SCIENCE AND ART\nNew York 3, N. Y.\nNovember 30, 19S>1\nMr, Richard L* Rider\nNational Asso* of Educational Broadcasters\nUniversity of Illinois\nUrbana, Ill.\nDear Dick:\nI was delighted to hear from you and to echo your sentiments that one\nof the best things that come out of conventions, is the opportunity to meet and\ntalk with people with mutual interests and problems*\nNeedless to say, your letter to President Burdell was a great joy to\nall of us concerned, and did a tremendous amount of good for the general causeo\nHe was so proud of the lettdr that he passed it on to the Board of Trustees, and\nI believe that the President of the Board replied to you0 The letter came in the\nnick of time, because the resolution has not yet been received, and I have heard\nsome grumbling as to why I spent $600 on tape* Well- now they knowo\nI will be glad to send you a hundred copies of the Forum programs just\nas soon as they are out* If you like, I will send one to each of the member\nstations*\nYou might get a quiet chuckle out of the information that I have gotten\nWayne Coy to speak on the next Cooper Union Forum series,— \"EDUCATION FOR THE\nNEXT FIFTY YEARS\"* He will talk on \"Educational Radio and Television for the\nFuture\"* I made this arrangement while flying back from Biloxi with Siegel and\nCoy*\nThe other speakers on this program include General Hers hey, Luther Evans\nof The Library of Congress, Dean Melby, George Axtell of N.Y*U., Robert Ulich,\nKilpatric of Columbia, on \"Philosophy of Education\". I have decided that as long\nas The Cooper Union is an educational institution, and the N*A.EoB* is an educat¬\nional network, that it was high time to put on a good educational program*\nFurthermore, I think that at the present time the public is getting quit© inter¬\nested and excited about education.\nI haven*t seen Siegel since Biloxi, but have had several phene calls\nwith him* He seems to be active and healthy as usual* Seems like everybody in\nour shop is battling colds or what is now called virus X, Y or Z, depending on\nwhere you happen to live.\nThanks again for the fine letter.\nBest regards,\n/s/ Johnson E. Fairchild\nJEF/djk\nJohnson E. Fairchild\nDirector of Adult Education"
}