{
  "id": "d568-131",
  "text": "NAEB POLICY LETTER #6\nDecember 17, 1951\nGENTLEMEN:- Times are still hectic — or hadn’t you noticed? It’s been\nquite a while since the last of these missives was issued — and maybe\nitfs time to restate their purpose. It is ray hope to so Inform those\nusually called upon to state policy to members and the public that they\nalways know what the many operations of NAEB have been doing and why.\nThese then are background and your good judgment of their use is of\ncourse essential.\nA FIRE?- John Henderson called me about two weeks ago and read a letter\nfrom \"Wag” Waggoner* director of the Elgin, Illinois school 10 watter\nWEPS. In it he was inviting various people in the midwest to attend a\nluncheon on the first day of the SBC to consider, among other things,\n’’...the formation of an organization composed of public school station\noperators and school program producers to consider problems peculiarly\nours.” I immediately called Waggoner on the phone, drove to Elgin that\nafternoon and spent the best part of the next day with him. He didn’t\nmention the proposed organization and neither did I, but I did outline\nthe many plans NAEB had for working with the school stations. He’s a\nsmart guy and has a good operation and plenty of plans for future use.\nHe invited me to the luncheon — which I attended. Nothing was said of\nthe proposed organization — and I believe those who were there left\nwith a renewed sense the value NAEB membership held for them. There\nwere many offers of cooperation among those present. — but this of course\nis where we were many years ago, and it has no better chance of suc¬\nceeding than did our efforts then. The fact is apparent that the NAEB\noffers the only concrete continuing help now available to educational-\nnon-commercial radio stations.\nSCHOOL BROADCAST CONFERENCE:- George Jennings* annual clambake went off\nin the usual manner. Those interested in utilization—manly teachers—\nand those interested in helping schools* use radio—mainly PTAers—\ncomprised 95% of those attending. NAEBer there were Waldo Abbot,\nKeith Tyler, John Crabbe, Dick Setterberg, Kalph Steetle, George\nJohnson (Indiana), Ed Weggener (W0I), Frank Dunham, Gertrude\nBroderick, Ronnie Lowdermilk, and new representatives from St. Louis\nand Huntington, Indiana. There undoubtedly were others but I don’t\nremember them. Biggest hassle was ori the AV split reaction to the\nJCET TV proposals. Read the editorial in the recent \"See and Hear1\nmagazine and I’m sure you can imagine the answer Jim McPherson,\nExecutive Secretary of DAVI, gave. He was backed up most effectively\nby Ralph Steetiej Seldom have I heard anyone do as quiet, reasonable,\nsound job as Ralph did there. We haven’t heard the last of this issue\nthough.\nAM I SEEING SPOTS? The blast mentioned above, including blasts at W0I\nand WNYC — the story I get in Indianapolis and Cleveland of continued\noffers of time and the attendant requests for statements indicating that"
}