{
  "id": "d568-133",
  "text": "NAEB POLICY LETTER #5\nNovember l5a 1951\nBIIDXI:- ’'The only possible thing wrong was the weather\". I've heard that state¬\nment many times since leaving Biloxi—together with \"The Best Ever!” and similar\nremarks. Certainly no one could have attended and not been stimulated. People\nwill long discuss the Siepman talk — the Laswell proposal — the Coy performance\n— the Sparkman spark — and on the lighter side the seafood and S3 uthera hos¬\npitality. The bud. ness meetings and the board meetings were also very well done\n— the officers, new directors, and the convention sit© for 53 — how can we\nhelp but expect even greater things from NAEB during the next stage of its\ngrowth. Guess its up to Siegel to come up with a newAlabel — I can't think of\nanything to follow \"adrenilin\" — or aren't we thru that stage yet?\nVISITATIONS:- The southern trip made it possible for me to visit the followng\nplaces — and get more than the thumbnail impressions I list here. New Albany,\nInd.:- organization and coordination with a High School workshop group a revela¬\ntion to a University operator — now they're picking up the nighttime operations\nidea — programming entirely from NAEB Tape Network features (a trend?)\nLouisville, Ky.A pushing, shoving, hauling operation that is nevertheless\napparently quite sound. Don't write off this wire idea for municipalities —\nit makes plenty of sense from a service, and a financial, point of view*\nUniversity of Alabama:- Ausraus at his best. Use of persons trained on gaspipe\nradio seems to work '— and each certainly has its place. Atlanta, Ga.:- Gaines\nfurnace blew up on him — much as I sympathized with Al — I was happy for the\nopportunity to know Ilaskell Boy ter better. Another excellent operation — that\nundoubtedly will expand to an adult education nighttime operation in the near\nfuture..;there's plenty of material available for such expansion — and cer¬\ntainly WABE is adequately equipped both staff wise and technically. University\nof Tennessee:- Ken Wright finally remembers that we were commercial opponents\nin the halcyon days of Cincinnati radio. He's applying plenty of that know¬\nhow to the WUQT operation. Needs both space and staff, but is maiding progress\nin those directions. University of Kentucky:- Erorno is still the same. We\nalmost had a knockdoun-dragout fight on the question of timing versus material\nas a program determinant, .and he offered the first opposition to paying up for\nnetwork servj.ce — largely due to the fact that he's only on the air 15 hours\nweekly.\nHERE AT URBANA:- We're still fighting the battle of the tapes...but think we'll\nhave something definite to report most any day. The tape duplicator looks\nsomewhat more promising with Toogood saying \"I'll more than likely have some¬\nthing for you about Jan. 1\" Keep your fingers crossed too — please 11 Nice\nlong chats with Dallas Sirybhe and Will Schramm. Dallas is working cut that\n\"research design\" deal I mentioned at Biloxi for this office. Promises to\ncome up v&th something in afew days. Schramm again esp res seel his regrets at\nnot being able to attend the Biloxi meeting. Hudsons out of town for a week —\nditto Schooley. Frank at the SDX convention—a glutton for punishment huh?\nSiebert and Lindley listened to all the La a swell tapes today. Incidentally,\nwatch the program offering letter for an offering on the Biloxi tapes."
}