{
  "id": "d568-138",
  "text": "n\nNASD POLICY LETTER\nOctober 8* 1951\nGENTLEMEN:® It’s been hectic around here this past week. Our expeditious\nexpediter, Hon. Frank Schooley, really went to work on the construction crew —\nand we now have a wall — no two walls, and an outside mail shute. Add to this\nthe fact that Will Schramm ordered necessary new office furniture — not on\nKellogg — and you can see our physical office equipment is progressing nicely.\nIn addition to all this Illinois generally is a fine host. I've certainly had\nthe best of treatment at every turn, as the intricacies of U of I procedure were\nexplained. It's going to be easy to work here -- no doubt about that.\nSO TO THE WORK: The new Secretary is really fine -«• Helen Bishop is the naraeo\nShe was formerly secretary to Doug Mills Athletic Director here — and only thru\na twist of fate available to us. The NETWORK e&t'cies on its usual fine fashion.\nDistributed the Fire Underwriters series to 12 stations — next up is the USUN\nseries to about the same number — you'll be getting details soon.\nHad a nice chat with Fir. Roy Gavin of 3M, Minneapolis, via phone. Tried to line\nup a visit, but he's oing out of town for two weeks. Said he had talked to Toogood\nand that he was building our duplicator. I tried to pin him down, but he wanted\nto check the'Tact, and caiT\"me back — which he hasn't done yet. On the tape\nsupply, he suggested that they work out some sort of lease arrangement, so that\nwe might have say 3,000 tapes now for $500 to $1,000. He's working on that too.\nThe door here seems absolutely closed against very much of an outright gift. As\nyou might expect, they're besieged with such requests.\nBILOXI— Another item for that meeting is proposed membership of NAEB in the\nAmerican Association for the United Nations — AAUN — Ausmus suggested this in\nNew York. I've written Clark Eichelberger to see if we are eligible and the cost.\nNo further word from Ausmus regarding the program at Biloxi. In fact — no word\nfrom anyone regarding — Biloxi — this letter idea or anything else. 'Smatter —\nyou guys busy?\nHANDWRITING ON THE WALL — but who's got a Rosetta stone? NBC's supposed intention\nto increase net by 200. N3C's proposed UO second lag in starting sustainers for\nlocal \"cowcatchers\" Associated's decision to break down its Library. Also did you\nnote World veepee saying there is \"increased interest in longhair material\"?\nIncidentally has anyone heard anything recently on the proposed BMI promotion of\nnew serious music?\nTHIS AND THAT:- See where Sam Slate has left BBC for CBS. Anyone any ideas on\nwhether or no and if so on what another Allerton type seminar in 1952? Let me\nhear from you IU t\nJiUlo o.«\nP.S. If you haven't already done so catch the Sat. Review Sept. 8 story on\n\"The Public School Crisis\" and the Sept. 22 Walter White article \"Time for a\nrogress Report\"."
}