{
  "id": "d568-24",
  "text": "Special emphasis and interest x*ere given to programs in the special events cate¬\ngory, i.e, famous speakers, musicians, etc, appearing on various college campuses\nand in public school auditoria in the Region, It was thought that these programs\ncould and should be shared by member stations of the Region,\nDiscussion then was centered on gaps in the programming schedules. Some sug¬\ngested needs were:\nFlynn: (1) Educational radio and television promotional programs\n(2) n Specialists11 programs—utilizing outstanding authorities in the\nseveral fields implementing the idea of MCampus«South or Campus USA,”\nBoyter: American History Series (Dramatization)\nGaines 3 Programs at high school level.\nYoung: In-school broadcasts (Although he modestly admitted a fault common to\nmost of our operations* he wasnH exploiting all the resources he had\navailable to him right on his own caxnpus«)\nKilians Supplementary reading\nLee j Exchange of Information on program schedules*\nThe Chair appointed Wright (Chairman), Boyter, Lee, Young, and Flynn as a sub¬\ncommittee to draw up recommendations re: programming*\nFriday evening and for an hour Saturday the sub-coimaittees met. Reports and. cosh\nmittee recommendations were heard and discussed by the Committee of the whole.\nThe following actions were taken by the group:\nLee, Bronson: Moved the adoption of the policy sub-committee revision and\nthat the revision be sent to MEB Board for their consideration and adoption, (State¬\nment as adopted is attached.) Motion passed.\nThe programming sub-cosm&ttee made two recommendations:\n1, Program exchange in the special events field b© initiated immediately on\nan informal basis: the station initiating the program send a brief an¬\nnouncement to all member stations in Region II as soon as the program\nhas been set for broadcast, giving program information, length of pro¬\ngram, nature of event, personality involved and like information.\nThose stations wishing to carry the program would then send a blank\ntape to the originating station which in turn would record the program\nor programs. Re commendation was approved.\n2. Regional director was asked to secure from each member station in the\nRegion a list of programs, including titles and full description, eon*^\nsi dared exportable. This information would be compiled in the regional\noffice and made available to all member stations in the Region. Requests\nfor any of these programs would be made to the originating station as\nfollows:\na) request for audition program, blank tape included*\nb) if audition approved, request for series, blank tapes included.\nThe regional director would take the responsibility of keeping record of\nprograms available to the Region up-to-date. RecosBBndation was approved.\nFrank Sehooley offered services of the National Office in drawing up a clearance\nfor broadcast form which could be used to secure the release and broadcast per¬\nmission."
}