{
  "id": "d568-30",
  "text": "I will mention only one item which is illustrative. It was concluded that if\ntelevision in general develops as a prime factor in United States mass media\nradio will be placed in an inferior, competitive position—and that commercial\nradio, in order to survive, will embark on specialized programming of the kind\nnow done by educational stations—and that many, if not most, educational in¬\nstitutions will find television inordinately expensive.\nStudy of the report of this seminar is a rewarding undertaking. The seminar\nespecially deserves notation as a sociological device which did merge, blend\nand integrate educational broadcasting thinking to a greater degree than had\never before occurred. (There did appear to be common goals and a common\npurpose—and it was from this sotting the NAEB began an approach to what we\nthought was a universal goal.)\nIt is doubtful now if any repetition of this sort of seminar situation could\nresult in the same kind of conclusions or activity. All of the actors are\nolder—they are playing different roles and time has moved on in many ways.\nA repeat situation would call perhaps for a smaller group to arrive at some\northodoxy—and subsequently their role should be to set up meetings and con¬\ntacts to implement the orthodoxy and procedures, not more and more ,rbull\nsessions\nIn 19U9 the NAEB and its attorneys issued the first petition to the FGC asking\nfor set-asides of educational channels. NAEB tried over a two-year period to\nget positive expressions of interest from institutions, and being unsuccessful\nit was decided to petition for set-asides in the UHF bands which were then un¬\nwanted by anyone on the basis NAEB wanted to stake out a claim which would still\nbe inviolate when institutions were ready to use the frequencies perhaps 10 years\nlater.\nThe full movement for educational television then began to get underway 0 Frieda\nHennock and others initiated moves to get VHP as well as UHF reservations for\nthe 88ke of real effectiveness. This made a great deal of sense in an in¬\ndustry where the practical standardization was on VHF not UHF. It failed to\nmake as much sense, however, when New York and Los Angeles were not included\nin the FGC re-allocation moves and similarly in some smaller cities.\nThe rest of the history is familiar up until the present time insofar as times,\nplaces, and organizations are concerned.\nThe background coaaent should end with several other observations*\n1. The growth and enthusiasm of educators, civic leaders, “do-gooders”,\nand hopeful malcontents for educational television paralleled and\nfar exceeded the earlier history of educational radioj so likewise\nhas foundation financing.\n2. Educators who never had an interest in radio developed such an in¬\nterest in television—its promise an an educational aid or device\nwas much more readily seen.\n3. The interest demonstrated in #1 or #2 above was and is perhaps fatally"
}