{
  "id": "d568-31",
  "text": "weakerod and threatened due to several factorst\na) Very few of these people ever understood in radio or do\nunderstand in television the practical and basic exigencies\nrequired in operating a broadcasting station in terms of\nthe psychology of small and/or large units of the listening¬\nviewing public, in terms of the technical requirements of\nthese media, or in terms of the fiscal problems involved,\nb) Mary supporters of the movement repeated the errors demon¬\nstrated earlier in educational radio broadcasting by be¬\ncoming pre-occupied with non-commercial as opposed to com-\nmerici. broadcasting and failing to recognize semantic\ndifficulty in their prejudices.\nSimilarly they were bound, not only to the myopia of their\nparticular academic backgrounds in terms of taste levels\nand considerations of program content, but very often assumed\ntheir own projection of a particular set of subjective no¬\ntions about education was a \"universal'1. Thus without terms\ndefined, confusion was and is still rampant on \"ends” as well\nas “means”. (The confusion did not substantially exist when\neducators banded together to secure the FCC educational\nreservations? here the goal was clear—they ware not united\nto produce educational television—they were united to win\na victory from the FCC based on the assumption that having\nwon the victory they could proceed toward what they thought\nwas a clearly stated goal.)\nko The best idea of all died aborning, e. g. the suggestion that the Ford\nFoundation purchase the then struggling ABC Network for its television\noutlets and use this as a framework and a nucleus, cluster all edu¬\ncational television development around it? thus affording to paraphrase\nthe British a “fourth program service” which has been in no way like\nthe BBC or for that matter like ary United States system.\n(Interesting isn’t it—and semantically significant—that the British\nuse the words “program service”? American educators find a connotation\nin \"service broadcasts” which they somehow tend to deplore.)"
}