{
  "id": "d568-40",
  "text": "PROTECTING THE CURRENT DEVELOPMENT\nIf the dream of educational television is to become a reality—and if the pro¬\ngress already mad© is to be consolidated and assured—several factors of the\nsituation ought to be examined painstakingly*\nCertainly all of the agencies which have involved themselves in supporting the\ndevelopment of educational television have a moral and philosophical stake in\nseeing their point of view justified by the emergence of a sound and healthy\neducational television structure across the country*\nFoundation groups like the FAE have invested a good many million dollars in\neducational television—presumably on the basis this would be \"stimulatory\nmoney1\" and would be matched and carried through by local resources*\nThe moral and fiscal investments are already so large they obviously demand\nprotection and nourishment* But those investments are presently in jeopardy*\nLet us examine the situation in more detail*\n1* The commercial attack on educational television is in full swing and\nis finding most of educational television*s weak points.\n2* There is incredible duplication of effort on the national scene* For\ninstance—\ni a) The JCET, the NAEB, and the Center all have television\nengineers* 4\nb) Until recently the National citizens Conmittee on Educational\nTelevision and the NAEB both tried to run employment services*\nc) The separated and complementary role which presumably each\nof the educational television agencies should play is in¬\nextricably confused, duplicated, and even complicated by\nrivalry, e.g* JCET, Citizens Committee, NAEB, and the Center,\nnot to mention other elements such as the American Council\non Education, the AER, the Southern Regional Educational\nAssociation, the U*S. Office of Education, etc* In some\ncases individuals within these groups frankly do not know\nwhat they ar© doing*\n3* Most of the stations on the air or building are under-financed, in¬\nsufficiently staffed, and in nearly every case, lack a clear-cut\ndefinition of their goals and philosophies0 Their supporting agencies\nand boards are in even worse shape insofar as understanding goes, e.g. in\n\"Middletown” a budget of $300,000 for a station should not b© viewed\nwith raised eyebrows and feared as \"too rich\", it should not be a '\nmatter of question in some cities whether or not \"news\" should be part\nof the station offering. It is incredible to find that \"controversial\nissues\" are in many instances excluded from the station’s plans.\n2|. The Center is making excellent progress but the demands of affiliate\nStations are outstripping its resources."
}