{
  "id": "d568-5",
  "text": "President's Remarks\n-2\nThat will be a disaster: Ford will pull out. Congress will\npostpone or withdraw its support, and lay leadership will\nlanguish and disappear. But, if we do manage to establish\na unified structure, many argue, it can become stronger,\nbetter financed, and more influential than anything we have\ncreated previously to represent and serve us; it can lift\npublic broadcasting to an entirely new plateau of importance\n\"and consequence.\nSo, it's understandable that professionals are uneasy if they\nsee a structure being built that gives them no meaningful\naccess to the executive suite, i.e., an organization in which\nnone of them is allowed to have a seat on the governing board.\nMoreover, they are distreessed by the possibility that their\nprofessional association that they have established, built,\nprayed over, sworn at, nursed and nurtured, may go down the drain\nIt's as though there's a proxy fight and the old family firm is\nabout to be taken over by strangers. So, I.suggest, that one\nprinciple we must stand by is the involvement of professionals\nin a meaningful way in policy making and that they not be\nforever foreclosed from full voting participation at the policy\nlevel.\nSimilarly, it is important that the professionals retain\ncontrol over their own professional organization in their role\nas individuals who have chosen a career in public communications.\nWithout attempting a philosophical disquisition, let me give\nyou a few personal reflections on the unification thrust. In\nthe midst of a shifting terrain and rapidly changing\ncircumstances, the only thing constant is principle. And\nthough it is difficult to intellectualize what is essentially a\nfeeling of unease and vague apprehension, I think the principle\ninvolved here is the question of amaturism driving out\nprofessionalism. Prestigious laymen are important for their\nclout, but they have achieved their distinction in other fields\nand furthermore, wise and intelligent though they may be,\ntheir involvement in our fate is only superficial and a matter\nof periodic concern. Whereas for staff, public broadcasting\nis not only a vocation but a full-time religion - something\nthey eat and breathe, and something in which they were, are,\nand will continue to be obsessively involved. It's like the\nstory of the pig and the hen looking at a billboard displaying\na plate of ham and eggs. \"For you,\" observed the pig, \"that\nrepresents a contribution; for me, though, it's a total\ncommitment!\""
}