{
  "id": "d568-6",
  "text": "President1s Remarks\n-3\nOn the other hand, if this new structure is not functionally\nright and appropriate in form and if the procedure for its\nestablishment is not handled properly with due process for\ndiscussion, debate and ratification by the licensees, it will\nbe a disaster of another sort: disruption , defiance, and\ncontinuing chaos - not one voice, but many; not unity but\ndisunity. Whatever is developed must rest upon the willing\nconsent and support of the professionals in the field or it's\nno-go.\nI am convinced we can do both - propose a new unified, cohesive\nstructure - at least for licensees - and get it accepted in\nsuch a way as to provide for a strong and lasting enterprise.\nFurthermore, NAEB's current fiscal problems could be helped\nor at least ameliorated in the event that this unified approach\nprevails. In the meantime, we have no alternative but to face\nup to the hard realities of our present fiscal circumstances.\nThese include a deficit situation at the end of fiscal '73 and\na much larger one for '74 if we are to maintain existing\nservices at even their present level.\nA barebones budget based upon assured sources of income only\nwould require total elimination of six services and one officer;\na minimal budget for sustaining a minimal service would still\nproject a deficit of nearly $300,000. The budget we should have\nfor '74 costs out at about $400,000 above anticipated revenue.\nLet me say in closing that despite the fact that the present\nsituation is perhaps the most critical that has ever faced the\nNAEB - though I have survived several - I am, in the main,\noptimistic - both for NAEB and for public broadcasting.\nAgonizing as the present doubts and uncertainties undoubtedly\nare and strenuous as the present struggling and striving\nunquestionably is, the outcome can be a major plus.\nYes, the Chinese gave us a curse. But they also gave us a\nhappy philosophy, laced with such aphorisms as: \"He must first\nclimb the mountain who would see the peaceful plain;\"\"When\nwe have nothing to worry about, we are not doing much, and\nnot doing much may supply us with plenty of worries in the\nfuture;\" and finally, \"If there is righteousness in your heart,\nthere will be beauty in your character. If there is beauty in\nyour character, there will be harmony in your home. If there is\nharmony in the home, there will be order in the nation. When\nthere is order in the nation, there will be peace in the world.\""
}