{
  "id": "d568-60",
  "text": "'S*\n-2-\n3) We need to develop fallow areas in a Point Four Program approach in many\nparks of the U. S. where communications are backward*\nh) We need what Wilbur Schramm calls a continuing source of aid and comfort\nin crises.\n5) We need all the cooperation and interchange we can get with other educa¬\ntional comraunicationso\n6) We need increased nationwide coverage* to fill in the many white spaces\non the NAEB map*\n7) We need evaluation (either under a separate organization or under the\nNAEB) and research*, possibly as a national research office* carrying on\ncontinuous studies in production* writing* and utilization*\n8) We need continuous training and up-grading programs for personnel*\n9) We need a certain amount of ,fraad money*1 for experimentation with new ideas*\nfor innovation. Probably a hundred thousand dollars or so is needed for\nthis sort of development.\n10) We need to extend and intensify the usefulness of schools to society. We\nneed to meet the increasing demand for better school education and adult\neducation.\n11) We need to help meet the crisis which is imminent in this area within\nten years. Educational institutions are finding it harder and harder\nto meet the growing crisis of increased enrolments of all kinds. (Cfo\nPenn State option of taking courses by television as well as in person).\nIn soitb cases TV-taught courses seem better than classroom courses in\nthose areas where demonstration (as for science or medicine) are involved.\n12) We need to get across to educators the need to involve the total educa¬\ntional institutions in educational radio and TV. ——\n13) We need to involve legislative leaders in our activities.\n1U) We need a device for looking and seeing ahead* perhaps an annual \"think\"\nsession* a senior council of a half dozen experts in as many fields.*.,\nsome means of keeping ahead of developments* of visualizing and calling\nattention to \"the growing edge\" in society and education.\nIII. Financial Structure Needed:\nIn investigating a base of financial support for the services needed* sev¬\neral practical considerations must be taken into account. There are non-profit\noperations like WOI-TV. There is membership supports the HAEB now derives nearly\none-fourth of its support from member dues and assessments; the ETRC probably\nnot over one-twentieth or so. It would seem that for the sort of one-time pro¬\nmotional job which the NCGET now is called upon to do* an advertising agency\nmight well be employed as needed if fiscal considerations are to be taken into"
}