{
  "id": "d568-67",
  "text": "November 5, 19£U\nHr. Frank E. Schooley, President\nNational Association of Educational Broadcasters\nStation WILL\nUniversity of Illinois\nUrbana, Illinois\nDear Frank*\nAt the recent convention I did not have an opportunity to\npersonally extend my congratulations and condolences on your elevation i?)\nto the office of President of the NAEB. You are hereby praised and\nconsoled. You have been very helpful to me during the period of my\nintroduction to educational radio and so I am looking forward to the\nsplendid kind of administration which I know you will give to our\norganization.\nMrs. Browne was especially pleased to learn that you had\nbeen elected to this office because she was so favorably impressed\nby the friendliness and the genuineness of Mrs. Schooley.\nWith this letter I am enclosing a copy of the convention\nreport of the Professional Advancement Committee. I know you have\nreams of material to go through and that you may not have an\nopportunity to give as much attention as you would like to give to\nall matters of importance to NAEB. Acting upon the principle that\nthe squeaking wheel gets the grease, I am taking this opportunity\nto call to your special attention one matter contained in this report.\nOne of the problems inherent in any organization of the size\nof the NAEB is that of communication. In spite of the best efforts\non the part of old-timers to convey their experience and their philosophy\nto newcomers, there is always the danger that a new generation may lose\nsome of the benefits of an older group because the newcomers are not made\naware of the salient factors which may be vital to the perpetuation of an\norganization whose success has been earned through arduous labor.\nBefore coming to the convention I had studied the proposed\nconstitution rather carefully. At the convention when we were con¬\nsidering important matters with relation to active and associate\nmembership, I studied the constitution again in an attempt to discover\nexactly what the purpose of the NAEB is. Perhaps I overlooked some"
}