{
  "id": "d568-79",
  "text": "What is it?\n- The national professional association which represents the interests and needs\nof educational broadcasters\nWho comprises its membership?\n* 114 educational institutions and organizations owning and operating a total of\n120 educational radio stations and 9 educational television stations (Active\nmembers )\n* 100 educational institutions and organized producing educational radio and\ntelevision programs independently or over commercial stations (Associate\nmembers)\n- 27 other organizations and individuals interested in the general development\nof educational broadcasting (Affiliate members)\n+ Total membership of 244\nHow is it organized?\n- National Officers and Regional Directors elected by, and ffom, membership\n* National Headquarters and Network employ professional staff headed by Executive\nDirector\nWhat services does it offer?\n- Full-time Television Engineer\n- Educational Television and Radio Placement Service\n- Management and Employee Relations Consultant Service\n- Legal Consultation Service\n- NAEB Radio Network\n- Workshops, Seminars, Scholarships: a constructive, progressive program of\npersonnel training and upgrading\n- Grants-in-aid to foster the production of outstanding radio and television\nseries by educational member stations and institutions\n- Monthly Newsletter and research publications concerning the many facets of\neducational broadcasting\n- General consultation and service to membership\n- International program, materials and personnel exchanges\n- Prestige Productions (some in book and album form) recognized around the world\n■ Continuing Research in all phases of broadcasting\n- The most active and productive Committee structure in the H.S.\nHow is it financed?\n- Membership dues and network assessments\n- Grants from the Vi. K. Kellogg Foundation, the Fund for Adult Education, and\nother Foundations,\nWhere can I get further information?\n- Write;\nThe National Association of Educational Broadcasters\n14 Gregory Hall, Urbana, Illinois"
}