{
  "id": "d568-86",
  "text": "EXECUTIVE DIRECTOR’S LETTER $9\nMaroh 6, 1952\nThe grindstone is moving slowly at Headquarters 0 The flurry of meet¬\nings of January and early Ibbruary is crvara So, there is a breather in that\nrespect — but certainly no breather as far as Tape Network operations are con¬\ncerned 0\nI trust by now you have had a report on the meetings held at Purdue *\nThese were,. I believe, extremely stimulating and valuable. We will be drawing\nupon these considered opinions for many months to come* If you haven’t received\na copy of the report, please let me know and I will send you one. .\nThe Urbana meeting of the Executive Committee was marked by harmony,\ndiligence, and a completed agenda. You will be getting a complete report of this\nin the form of minutes from Burton Paulu soon. We did a great many detailed\nthings, but the action which will affect you most immediately is a schedule of\nmeeting proposals which were adopted.\nThe first of these meetings will oame March 28, 29, and 30, at Norman,\nOkla. This will be the first, we hope, in a series of regional meetings aimed at\nstrengthening the grass roots of NAEB. It is only logical that the director who\nspearheaded the creation of NAEB regions should be the first to hold such a meet¬\ning. There are only eleven active members and seven associates in Region 5*\nMost of them have not attended any of our conventions or past meetings. It is\nfertile ground that will be well cultivated. This will be a shake-down cruise.\nA report of the meeting will be extremely valuable in deciding whether we plan\nsimilar meetings in years to came.\nThe second meeting approved was on television. The Executive Director\nms given authority to work out the details of this with Dick Hull. Dick has\nbeen away from his desk for a week or ten days and hence I have nothing further\nto report. Certainly scsae sort of workshop seminar or just plain meeting can be\narranged so that we may derive all possible benefits from the operation of our\nonly educational television station.\nThe third meeting approved was an Allorton Type Seminar. The Executive\nDirector was authorised to explore the possibility of holding this for music direc¬\ntors, script writers, and the like. This meeting is perhaps the unolearest in icy\nmind of them all. We are exploring all the possibilities and will have a report\nto make to you at some later date.\nThe fourth meeting approved was an Allerton Type Seminar for school-\nstation people. This, more than likely, will follow the pattern of the first\nAllerton Seminar of educational station operators and take up the basic aims and"
}