{
  "id": "d568-87",
  "text": "-2.\nresponsibilities of school stations as well as spend considerable time at the\n”how-to-do-it level\". Either meeting ’’three’* or \"four” will be held after July 1®\nThere is insufficient money to hold both of them during the current budget year.\nIt will not be a question of delay but rather which is the most appropriate meet¬\ning to be hold at which time*\nIf you would like to add to the above list the other meetings which will\nundoubtedly be coming up, may I suggest the following:\nApril 16-17 - NAEB Board meeting, Columbus, Ohio\nApril 17-20 - IERT meeting at Columbus, Ohio\nApril 17-20 - HXJEA meeting in Houston, Texas\nApril 21-26 - ACE-TV meeting. State College, Pa.\nMay 2-3 - ACE annual meeting, Chicago, Ill.\nIt looks like a busy spring and summer.\nThd Executive Committee asked me to attend the American Education Asso¬\nciation meeting in Vfashington, February 22 and 23* A family down with the flu,\nwhich is running rampant in the Midwest, prevented me flroa going. Frank Dunham\nrepresented us, and I have a fine report from him on the meeting. This meeting\nwas held to ffbrm a \"national council on adult education” which will attempt to\noorrelat© all of the activities that the various agencies concerned were carrying\non. It will act as a clearing house. It, more than likely, will not initiate any\nprograms of its own but undoubtedly will point out areas in which programs should\nbe carried on. I agree with Fi*ank Dunham that we undoubtedly should belong to this\ngroup - which is sponsored by - but different than - the AEA. The NAEB Board has\ngone on record as favoring joining AEA, and we are in the process of determining\n•where we stand on that matter. Thero has been no formal action on the new joint\neffort* I understand that it would cost us nothing* However, I believe it is a\nmatter •which can be deferred for formal action to the April Board meetingo\nI said that things here at the Tape Network are humming, and they are.\nWe have been receiving remarkably fine acceptances of our new in-school package,\nalthough I am deeply chagrined that certain of our good old line AM members have\nrefused this offering of top-level in-school shows* I am sure there must be a\ngood reason, although I don9t see it now.\nTo add to all the rest of the headaches with which Dick Rider and Roz\nBias on have been wrestling with is the problem of stations being off the air for\nvarying lengths of time during the summer or a reduced hour basis. We all are\nsincerely hoping *£mt this is the last time we will have to make up a Network leg\nschedule* The answer to this lies in the tape duplicator, which I now believe is\ncloser than ever before and which may very well be in operation in time to by-pass\nthe next package. A13/of which may run into a real problem of tapes, but we will\ncross that bridge when we get to it."
}