{
  "id": "d568-88",
  "text": "-*\nWe finally got off the Hull Biloxi speech and have sent it to Ste^tle for\ndistribution. We also have received a corrected copy of the Lass-well Biloxi speech\nand will liave it prepared on mime© for distribution to you sometime next week.\nWe have perfected our card file system for members and will have it in\noperation soon0 Along with that has come a change order fom which you will be\nseeing frcm time to time and which should keep our membership lists current.\nThe new stationery for Headquarters and Network will be off the press\nsoon and should start arriving at your bailiwick.\nThe News-Letter mast-heads have been revised and printed so that the\nNews-Letter, with the combined February and March issue, will take on a new appear¬\nance.\nWe have perfected the revision of the new ’’application of membership\nforms” and are preparing to do a simple printing job on the Constitution and By-\nLaws (including the Paulu amendment).\nWe received our first response to the 5^ flyers which have recently been\nsent out on the LA-TV booklet. We figure it will be necessary to sell 250 of these\nbooks at the $5.00 price to make back our costs. We will appreciate any help you\ncan give us.\nI said tape ms one of our problems and it is. We will need more tapes\nin order to switch from the package to the direct system. We also must solve the\nproblem of how many masters do we store and how do we assure ourselves that they\nwill be as good three years from now as they are today. We have explored these\nproblems with nearly everyone and have not as yet come up with a good answer. We\nwill keep working on it. One of the by-produots of that exploration my be of\nvalue to you. JU now has a new reel with a 2 3/V* hub as compared to the 1 3/V* 1\nhub on the old 7” reels. The now tape is slightly thinner so that with the new\nand enlarged hub, the 7n reel will still hold 1300 feet of tape. May I suggest\nthat if you are planning to make any tape purchases in the near future that you\ninsist on this new reel and tape. I think you will find it a considerable improve¬\nment.\nI understand that wa have received an additional grant on the EAE in the\namount of $3,000, which will enable us to print the New York and Chicago Monitoring\nStudies. Formal word on this should be coming soon.\nWe have been promised pictures of the big NAEB exhibit which was first\nshown at the UNESCO meeting in New York. When these are forthcoming, we will im¬\nmediately offer the exhibit to all NAEB Tape Network stations. The deal will bo\nthat each university or school will have to handle all local expenses of the\nexhibit. This means setting it up, tearing it down, and paying the shipping ex¬\npenses to the next point. This will be routed just as tapes are on the Network,"
}