{
  "id": "d568-92",
  "text": "~y\n/\nTHE OLD FILES—During recent weeks my sense of humor has been almost lacking, my\npatience tried, and my feeling that we were in a vast ocean with no charts compounded\nmany times* Last night I looked at the file that Dick Hull had sent me, more partic¬\nularly at a bit of history - in the form of some old News-Letters and convention pro¬\ngrams. I really think we are pikers compared to the guys who were fighting the\nbattles in those days. Take for instance, the recurring problems of the loss of AM\nfrequencies, which evidentally was a combination of lacking of prosecution on the\npart of the educators and the lacking of sympathy on the part of the FCC, and then\na topper for all of this was the masterful switch pulled by WHA in demanding the\nclear channel frequency occupied by WMAQ in Chicago.\nThen, too, there was the fine story of the 1939 convention in which\nJudith Waller ©pounded on \"How I Would Run an Educational Radio Station,” winding\nup with the fact that she didn't think it was possible.\nCarl Menzer and Bob Higgy evidentally did a terrific job with a disc\nrecording machine they got from somewhere and sent around to member institutions.\nThe New York delegation was heard from in 1939 with the W1XAL story.\nThis evidentally was a high powered short wave rig in New York to which Mayor\nLaguardia wanted to feed the WNYG shows for possible re-broadcast by NAE33 members\nthroughout the country.\nThere is an interesting item in the 1936 News-Letter in which AM re-broad-\ncasts were urged. They spoke highly of the exchange of broadcasts between WOI and\nWSUI and the possible enlargement of this to include KSAC, WHA, and WILL.\nThere was considerable consideration given to an \"exchange library of\n-recorded programs.\"\nI also got a big kick out of reading two 19U7 publications—one by Elmer\nSulzer on hew to set up an educational PM radio station and another by George\nWilleford of Indiana University on a study of educational radio stations.\nThan there was KUOM Station Report of 191$ which still has many implications\nfor us today. If this is any sample of mat the files contain, there will be most\ninteresting reading whenever I can take out two months to do so.\nHEADQUARTERS JOTTINGS—Acceptances are now all in for the combined meetings of the\nNetwork Acceptance Committee and the In-School Program Committee. This meeting\nwill be held at Purdue, February ?, 8, and 9.\nPlans are underway for the Executive Committee to meet here at Urbana,\nFebruary 15 and 16.\nDick Rider is on his my back from the UNESCO meeting and will undoubtedly\nhave something to report on that at a later time.\nMaterial continues to come in from the USDA, the National Safety Council,\nNetherlands Information Service, and others. I hope all of you are taking advantage\nof this free stuff."
}