{
  "id": "d568-98",
  "text": "•2«\nWORTH READING — AND TALKING ABOUT, TOO:- The fantasy — the Sato Review review\n— and the Coy Biloxi story in the current Broadcasting. Thelast doesn*t quite\ngive me the impression I got in the Hurricane roome The next to the last is a\nperfect example of biased journalism when you read the Sato Review originals*\nAnd the first — oh, well, let the guy dream. ..Put these three together — The\nTV code, Coys* Biloxi talk and the fantasy — and you come out with an NAEB\nmust namely: A positive approach to broadcasting today * Ri#it?\nMAIL AND PUBLICATIONS:- If you* re having trouble with untrained personnel\nunderstanding your operations — see if you can talk Dick Hull out of a copy\nof his very sound, very excellent 60 page operations manual* It*s the best l*ve\nseen. I*m also impressed by the terrific job Iowa State Teachers College does\nworking with WOI and WSUI — mentioned this before, but just couldn*t refrain\nfrom doing so again....Note that Kay Lardie reduces her program sked to\n2 J X 5 inch size. Would paste on a radio — or slip under a glass topped desk\nnicely... .Noted with some amazement the UO hour schedule of KAIW out in San\nFrancisco. They evidently are doing considerable training of radio at the\nHigh School level, with an eye toward placement after graduation.,ditto WEVD\nin New York state. This might be something that those of us who feel Univer¬\nsity broadcasting is a poor training ground — or at the least a waste of\nfacilities — might espouse.\nREMEMBER:- We promised to help bring Waldo, Jack and Parker up to date as\nquickly as possible — send *era anything that would help....Remember too, that\nwe here at headquarters want to see anything you’ve done —send it along.\nA THOT FOR FUTURE DISCUSSION:- What part of our effort should eventually be\naimed at helping those schools without radio stations get tapes or discs of\nradio programs for use in the classroom? Would a tape library — separately\nfinanced — upon which all schools could call be a good corollary activity to\nthe tape network? How closely should we play with the AV boys in their\noverall effort?\nDon*t jump to any hasty conclusions on the above!\nRegards,\nJim<"
}