{
  "id": "d1589-0",
  "text": "REGIONAL TALENT DEVELOPED FOR COMM,\nr^a^d^^ec tive\nOne of the most sincer^and emotive developments by stations operating in the\npublic interest has been the progress made in training new talents for broadcast¬\ning. During a visit to some of the commercial stations of the Northwest last fall,\nthe Station Manager of KWSC listened to suggestions and requests for the develop¬\nment of new radio talent for the area - young individual performers or new local\nprograms that the commercials either lacked the time or the personnel to train,\nhe agreed with station managers that only by developing such talent could radio\ncontinue to exercise its full public service and, in time, perhaps replace or\naugment the headliners of today.\nIn November, KWSC held auditions, and in December the station announced that three\nindividual performers and three talent-groups were getting indoctrinated in the\nsense of showmanship which might make their talents immediately important to the\ncommercial stations. At this date, the six radio shows are fast approaching pro¬\nfessional standards. Talent group jfl, \"The Lamplighters” program, twenty mixed\nvoices, accompaniment and director, with special continuity and original arrangements\nfor popular and familiar music, is now' available. If a radio station in Oregon,\nWashington, or Idaho washes to fill either a 30 or 15-minute blank in programming,\nKWSC will supply, simply at cost, weekly transcribed shows, completely produced,\nfor a 13-week period. The cost to a commercial station is slight - and the money\nwill go to the young college people who perform, \"The Lamplighters”, and the five\nto follow, are audience-builders in the Pacific Northwest (a ready audience in\nWashington, Oregon, and Idaho of hundreds of thousands of interested friends, alumni,\nand parents) and good-will gestures to brand-new radio talents, as well as fine-\nsounding regional shows for the stations. A second talent group will be ready on\nMarch 1.\n* * * *\nEX-KNSC MAN’S PLAY PRODUCED\nRay Hamby, former writer-director on \"School of the Air” shows over KWSC, subse¬\nquently on the continuity staff of KEJC, Portland, Oregon, is the author of \"Shared\nWife\", three-act comedy-drama now running at the Musart Theatre in Hollywood.\n* * * *\nKWSC CHIEF ENGINEER PREFARES MANUAL ON TRANSMITTER OPERATION\nEngineers to be added to the KWSC technical staff will have to pass three stiff\nexaminations, according to the Chief Engineer. He has prepared a manual that will\nassist and train the new operators as the department expands.\n♦ * * *\n\"Jive at five\" popular in Aberdeen, souih Dakota\nAnnouncer Louis Fowler has built \"Jive at Five\" into an except!onably listenable\nshow, according to a number of fans in Aberdeen, South Dakota. Mail from British\nColumbia and the Pacific Coast comment also on his accurate and interesting talks\nabout juke box favorites.\n* * * *\nS'PRAYER REPORT TO HAVE COMPLETE SUMMARY ON AIR\nThe KWSC \"Strayer Report\" program series on Washington State education and public\nschools, now carried weekly in Class A time by five other radio stations in dif¬\nferent parts of the State, will conclude in February, with the -twelfth program\nfeaturing a complete summary of Dr, Strayer’s survey."
}