{
  "id": "d1044-59",
  "text": "MTIOML ASSOCIATION OF EDUCATIONAL BROADCASTING\nOffice of Research and Developaent\n1346 Connecticut Avenue, N.W*\nWashington, D.C* 20036\nMEMORANDUM\nDRAFT COPY\nNOT FOR DISTRIBUTION\nTo: Office of Education\nJuly 23, 1^64\nSTATUS OF PROJECT OE 3*l6*007\nand\nREQUEST FOR AMENDMENT AND EXTENSION OP THE PROJECT\nUnder this contract, the NAEB is preparing and producing six \"hits'* of infor¬\nmation about the utilization of television lessons in the classrocm. Each\nkit vill contain a 30-minute l6mm sound film together with correlated materials\nsuch as discussion outlines, bibliographies, and general background information.\nThe kits are designed to provide the basis for a meeting or class session\nrelating to some phase of utilization.\nThe kits are being prepared in such a way that they can be used in seg.uence\nor individually for special interest meetings. They will be particularly\nappropriate for seminars and summer workshops in educational television.\nCURRENT STATUS OF THE PROJECT\nThe NAEB was awarded a contract to produce these materials on January 30>\n1963* As a result of the first Advisory Committee meeting, specific outlines\nwere developed and an agreement was made to secure the services of a writer\nwho could develop these outlines into script treatments. As the treatments\nwere prepared and reviewed by the Committee, it became apparent that the use\nof video tape and kinescope film for the production of these materials as\noriginally contemplated, would not provide a satisfactory technical process\nfor the production of superior materials.\nTherefore, at the reg.uest of the Advisory Committee, the Project Staff was\ndirected to discuss with the U.S. Office of Education, an amendment to the\ncontract which would provide additional fimds to produce these materials\ndirectly on film. The discussions between the National Association of Educa¬\ntional Broadcasters and the Office of Education were conducted during a four\nmonth period and resulted in an amendment to the contract dated September 15^\n1963, calling for film production, although it was acknowledged that this\nwould most likely require a lengthier production schedule than videotape\nand kinescope."
}