{
  "id": "d1044-9",
  "text": "-3-\nGeneral aspects of teacher and pupil preparation can he moved over into\nthe other kit materials, permitting extended consideration of presenta¬\ntional and follow-through activities, and specific aspects of teacher\nand pupil presentation*\nFilms 5 and 6 are almost exclusively \"utilization\" and should perhaps\nhe re-read in their skeletal-treatment form, as the comments indicate\nthat the readers have not grasped the emphasis of these treatments on\nthe importance of the teacher role.\nDivesting the treatments of the material suggested and compressing\nother material (which changes in style will permit) will certainly enable\nus to put even more emphasis throughout the entire film series on ele¬\nments which the Advisory Committee and the Office of Education personnel\ndeem highly important: (l) the fact that television is not the end\nand all of learning resources, hut simply a relatively new technology\nin the school instructional program, another in the long line of resources\nemployed hy education in its continuing effort to improve the teaching-\nlearning process; (2) the fact that the role of the classroom teacher\nis crucial in adapting stimulus to learning; (3) that activities which\nare appropriate for developing skills are not necessarily those most\nappropriate for developing attitudes or reinforcing knowledge or estab¬\nlishing values, and that the efficacy of the activity is determined\nhy how it relates to the goal to he achieved; (4) that the classroom teacher\nmust control the use of the television segment to create a wholesome,\ndynamic learning situation and, conversely, that the television segment\nmust not control the classroom; (5) the fact that teaching can he improved\nhy the use of television lessons because, when properly planned and pre¬\npared, and when used effectively, such lessons can promote effective\ntypes of learning experience at all levels.\nIllustrations in the present treatments were approved or suggested hy\nthe members of the Advisory Committee, hut the writer, as previously\nand vehemently stated on several occasions, welcomes and urges assistance\nin determining which are the best illustrations to he used in specific\ninstances. In the next stage of development these will specifically\nhe solicited from the Advisoiy Committee.\nThe original plan for the films suggests that the kits will he so designed\nthat they can he used either in sequence or as individual presentations.\nAs it is urged hy those contemplating final review and approval that\nscripts should he related to one another and suggested that there should\nbe a bridge from one film to another, attention will be given to doing\nthis. Attention also will he given to designing one or more programs\ntoward further discussion and study. Perhaps each of the films should\ninclude encouragement for further discussion and study, as each already\nbasically is oriented to continuing consideration of the elements in"
}