{
  "id": "d247-158",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOffice of the President\nWHA-TV, Madison, Wisconsin\nFebruary 4, 1959\nMr. Seymour Siegel\nDirector, Municipal Broadcasting System\n2500 Municipal Building\nNew York, N. Y.\nDear Sy:\nI have carefully considered the matters we discussed in New York\nand find myself still of the same opinion.\nWithout reviewing all aspects of the situation, the central point\nis the matter of dual responsibility. The officers of NAEB feel that\nit is not to the best interests of the Association to have the offices\nof Chairman of the International Relations Committee of NAEB and board\nmember and Permanent Secretary of BFA combined in the same person. It\nis our conviction that no man, no matter how loyal and dedicated, can\npossibly be so benevolently schitzophrenic as to serve both organizations\nequally well.\nI should like to make clear that there is a distinction involved here\nbetween the man and the office. The Officers are fully aware of the tre¬\nmendous contributions you have made to the Association as past-president,\noriginator of the tape network, and developer of international relations.\nFor all this they are most grateful to Sy Siegel.\nThis decision, however, is ex officio; it is based upon the offices\nyou hold simultaneously in separate organizations. This twofold respon¬\nsibility, in our judgment, causes confusion among those with whom NAEB\nhas relations in the international area and creates uncertainty among\nus as to which hat you are wearing when.\nThe recent meeting in New York, called by BFA for the purpose of\nforming an advisory committee to encourage U. S. Radio-TV broadcasts to\nsubmit programs to international competitions, is a case in point. Pre¬\nsumably, NAEB was represented through you, although you were also the\ncaller of the meeting in behalf of BFA and its interests. These do not\nnecessarily correspond to those of NAEB.\nIt is our feeling that though both organizations subscribe to the\nsame general purpose of promoting better international relations between\nthe U. S. and foreign countries via broadcast materials, the approaches\nand means of achieving this goal may differ considerably between NAEB,\nrepresenting educational broadcasters, and BFA, admittedly concerned with\ncommercial stations. Hence, we believe it inadvisable that this dual\nrepresentation continue. Accordingly, I am appointing Dr. Keith Engar\nas Chairman of the NAEB International Relations Committee for 1959.\nI again repeat my invitation to have you serve as a member of the\ncommittee, but if you do not feel that you can do so, would you agree to\nthe appointment of Bemie Buck?\nI remain, with warm personal regard, I assure you.\nMost cordially yours.\nWilliam G. Harley"
}