{
  "id": "d247-46",
  "text": "NAEB\nNational Headqiirter*\n14 Gregory Hal\nUrfcaaa, Illinois\nfor. Janes S. stiles\nStation WBAA\nPurdue University\nLafayette, Indiana\nDear Jins\nBushed, as usual, following end-to-end Chicago-New York-Denver trips•\nBut hastily a few comments an Constitution revision (and handling on the floor)*\n1* p. 3, should items 5 and 6 not be reversed so Industrial Associate is\nexplained before it is referred to?\nI see I don’t have my marked copy (left at home - had marked an the plane),\nbut I don't recall anything else* It's surely a fine job* vr+\n2* This doesn't affect the writing: I assume Individual membership definition\ngives us freedom to create, within it, a student category, mad student bulk\nrates, doesn't it? I propose to push this, since lots of classes can use\nand we can give discounts an 10 or more, and free membership to the teacher\nto encourage. I'll explain this orally to the Board* I think we can catch\na lot of new members at $5.00 ($4.00 in bulk) when they're still (half-time\nor mare) students.\n3* This too is oral} If the amendment passes to have a paid president, I'd\nurge that this not become effective till perhaps January 1, 1961. Reasons\nto work out the many representation and staff problems, attendant in many\ncases, on the Washington move. Between us, I feel Harley started the real\npush and should see it through and get the satisfaction and credit for it.\nI could explain this further, orally. Don't seem to have time now. But I\nfeel strongly about it, and you can quote as ig£ suggestion if you like.\n4. One other quickies Not sure (in principle - all personalities aside)\nit's good for Board (instead of president) to select the staff he works\nwith. And \"at the Board's pleasure* I assume means on contract (3 year\nminimum or similar) basis. Right?\nA wonderful job, Jim. I expect you're busy as I am-what with airborne (are\nyou yet?) and all. Our most sincere respect, affection and best wishes.\nSincerely,\n&\n/\nOctober 9, 1959\nHJS/dp\ncc: William Harley\nHarold Hill\nRichard Hull\nHarry J. Skomla\nExecutive Director"
}