{
  "id": "d1177-15",
  "text": "TARGET BLANKING PROBLEMS IN IMAGE ORTHICON CAMERAS\nby Berten A, Holmberg\nChief Engineer of KUOM\nIt is extremely advisable that the television camera service engineer pay rather\nstrict attention to the matter of wave-form existing at the point where camera blank¬\ning is applied to the target control circuit,, As is the case when observing most\nwaveforms on an oscilloscope, one is prone to judge the magnitude of any discrepancy\nin wave shape more on the basis of its comparison with the overall amplitude of the\nphenomena being displayed than by its arithmetic value in volts.\nThis can lead to trouble in the case of the target voltage, where the total\namount of target blanking may be considerably in excess of the actual useful amount\nrequired to drive the front end into cutoff during retrace. In this particular in¬\nstance it is very necessary to judge the operation of the blanking circuit on the\nabsolute value of the variation in volts occurring during the active line period as\nwell as during an overall field period.\nSince the useable differential in target setup is only a matter, of two volts,\nany small fraction of a volt discrepancy occurring over a line or field period can\nhave bad effects. These effects are not only confined to the matter of the horizon¬\ntal and vertical shading of the picture. It is not sufficient that proper shading\ncan be restored at another part of the circuit by the introduction of a corrective\nsaw voltage. A more important consideration is that of the irrecoverable damage\ndone to the quality of the overall picture due to the inconsistency of beam vs.\ntarget criteria which exists over the general target area when a small amount of tar¬\nget voltage variation is present.\nObviously, there is only one optimum amount of beam current for a particular\namount of target voltage. Therefore the very basic quality of the charge image can\nbe seriously altered by even a few tenths of a volt difference in the target circuit\nduring a line or field period. .\nUsually the source of this tilt lies in the time constant of the target coup¬\nling circuit. While some improvement can be effected by increasing the value of the\ncoupling condenser, it is far better to use a diode restorer across the target re¬\nsistor. Furthermore, increasing the value of the coupling condenser has the detri¬\nmental effect of making the target voltage control very sluggish.\nAn examination of the target blanking circuits used in leading cameras has dis¬\nclosed that perhaps too little emphasis has been placed.on target circuit design by\n. some manufacturers. In some brands a D.C. restorer is used to achieve relative con¬\nstancy of the target pedestal period. This, however, due to the finite diode resis¬\ntance, still falls a little short of what would be ideal. Another brand completely\nignores the problem and from what can be deduced falls back on corrective shading\nas an attempted remedy.\nPerhaps a good clipper circuit in the target blanking mixer output used in con¬\nnection with D.C. restoration at the.target would be the most effective solution. ....\nIt will be wise that engineers make a careful examination of the absolute (num¬\nerical volt) target voltage tilt during active line and overall field periods when\ntracing camera shading trouble. If the variations are in excess of a few per cent\nof the normal target setup voltage, then steps should be taken to reduce the tilt."
}