{
  "id": "d1177-7",
  "text": "-7-\nITIES OF WTTW WHERE DUANE 17 El SE AND HIS £ N G I N E £ R f N G CREW WERE FINISH¬\nING THEIR EQUIPMENT INSTALLATION. . PRESENT WTTW LIVE PROGRAMMING IS\nCOMING FROM THE CHICAGO BOARD OF EDUCATION TV STUDIO, WHERE ANDY\nANDR ESEN! S WBEZ CREW IS WORKING OVERTIME ON THE WTTW OPERATION.\n\"Andy\" also attended some of the Convetnion sessions but only in a\nWORKING CAPACITY, RECORDING SOME OF THE FEATURED SPEAKERS.\nA NEW li.50 PAGE BOOK ’'COLOR T E L E V I S I O N E N G I N E E R 1 N G ” BY JOHN W. WENT¬\nWORTH OF RCA WAS PUBLISHED IN OCTOBER BY McGRAW HlLL. DESIGNED FOR\nENGINEERS AND TECHNICIANS WHO ARE ALREADY FAMILIAR WITH BASIC PRIN¬\nCIPLES OF MONOCHROME TV, IT DEALS WITH COLOR TELEVISION THEORY AND\nEXPLAINS IT IN SIMPLE, LARGELY NON-MATHEMATICAL FORM. OVER dyU IL¬\nLUSTRATIONS ARE INCLUDED, AND THE PRICE IS ^8.00.\nr^\nn\nThe Allen B. DuMont Laboratories during October changed the method of\nSALES AND DISTRIBUTION OF ITS TELEVISION TRANSMITTING AND STUDIO\nequipment. Instead of the parent company handling sales of this\nEQUIPMENT,, FIVE SEPARATE SALES CORPORATIONS NOW REPRESENT DuMONT,\nCOVERING EVERY STATE IN THE U. S. AS WELL AS HAWAII AND ALASKA.\nLouis L. Lewis, Educational Coordinator for RCA, is now editing a bi¬\nweekly Educational TV Newsletter which goes primarily to administra¬\ntors OF EDUCATIONAL INSTITUTIONS. He HOPES IN THIS PUBLICATION TO\nSHOW PROGRESS BEING MADE IN THE USE OF TELEVISION IN EDUCATION AS\nWELL AS TO MAKE IT A MEDIUM FOR THE EXCHANGE OF IDEAS IN THIS RAPID-\nLY EXPANDING FIELD.\nThe Federal Communications Commission has recently revised its list\nOF TRANSMITTERS AND MONITORS ACCEPTABLE FOR USE IN AURAL BROADCAST\nSERVICES (AM AND FM) . COPIES OF THIS LIST HAVE BEEN MADE AND ARE ON\nfile at NAEB Headquarters. If you have a question on the acceptabil¬\nity OF THE ABOVE EQUIPMENT, WE SHALL BE HAPPY TO ANSWER YOUR INQUIRIES\nAS FAR AS THE INFORMATION ON HAND PERMITS. THIS LIST IS DATED AUGUST\n18, 1955.\nA NUMBER OF PEOPLE ATTENDING THE NAEB CoNVENGION MENTIONED TO OTHER\nSTAFF-MEMBERS THAT THEY WOULD LIKE US TO RUN A 'SWAP-SHOP OF SOME\nkind in the Newsletter. We are very happy to mention such items in\nthe Newsletter, either those for sale or wanted. However, our crys¬\ntal BALL IS A LITTLE DULL AND WE HAVE TROUBLE KNOWING WHAT YOU HAVE\nFOR SALE AND WHAT YOU WANT UNLESS YOU WRITE US. WE REPEAT WHAT WE\nsmd'n THE October Newsletter - deadl.ne is the 25th of the month,\nGET YOUR ITEMS IN BEFORE THAT DATE."
}