{
  "id": "d38-17",
  "text": "FROM: RADIO STATION WXXX (RELEASE #7)\nADDRESS\nPHONE\nFOR RELEASE: (DATE)\nSOVIET SYSTEM STIFLES\nTRUE LITERARY TALENT\nNot the least of the restrictions exervised by the Soviet government in Russia\ntoday are the controls exercised on literature by the leadership of the Com ¬\nmunist Party. The imagination of the literary artist is fettered and compelled,\nthrough fear, to subscribe to a uniform, idealized conception of Soviet life\nprescribed by the Party as a propaganda clevice. The Party is not likely to\nchange this policy in literature unless and until it changes its whole national\nand international line.\nA talk outlining the controls that the Soviet hierarchy puts on what the Russians\nread will be gi ven over the radio by Professor Ernest J. Simmons of the\nRussian Institute at Columbia University. The half-hour outline, entitled\n\"The Soviet Literary Strait jacket\", will be presented as part of the distin¬\nguished series \"People Under Communism\", produced as an Adult Education\nProject by the National Association of Educational Broadcasters.\n\"The Literary Straitjacket\" program will be heard by radio listeners over\nstation WXXX on -- (date) --at -- (time) --. Professor Simmons was one\nof the consultants who provided the materials used in the writing of the entire\n\"Communism\" series.\nProfessor Simmons finds that the Soviet restrictive policy has brought about\na stagnation of literary accomplishment. The situation, he feels, is a reflec¬\ntion of the antagonism felt by writers of genuine talent toward the literary\ncontrols and the fear-inspiring methods employed to implement them. After\nsix years of full operation, Professor Simmons,says, it is now possible to\nsee how this uncompromising dictation has brought Soviet literature to probably\nits lowest level in thirty-five years of development.\nBut the Russian public is now found to be undergoing a revulsion to this \"canned\"\nliterature. \"People, \" Professor Simmons says, \"are not buying the novels and\naudiences refuse to attend performances of boring contemporary plays. The\nsale of classical Russian literature and attendance at pre—revolutionary plays\nare on the increase. The Party purpose of propaganda on behalf of the trans¬\nition from Socialism to Communism is meeting a defeat in literature.\n30 '* * * *"
}