{
  "id": "d38-19",
  "text": "f ’ • 7W^\n^ JWi&ry 10, 1952\nMemorandum to Messrs*. Merle Fainsod\nHarold Fisher\nAlex lokeles\nPhilip Mosely\nErnest J. Simmons\nAs chairman of the Special Committee of the NAEB, whose\nmembers are:\nMr* Richard Hull, director of station HOI-TV, Ml and FM,\nat Iowa State College;\nMr. Harold B, McCarty, director of radio station WHA at\nthe University of Wisconsin, and president of the Wis¬\nconsin State Radio Council;\nMr. Seymour Siegel, president of the NAEB, and director\nof radio station WNYC, the Municipal Broadcasting System,\nNew York City,\nMr. Parker Wheatley, director of the Lowell Institute Coop¬\nerative Broadcasting Council, and general manager of\nradio station WGBH in Boston,\nI am sending you the attached materials*\nCur Committee, having assembled all the evidence available,\nspent two days considering the problems which have developed in the pro¬\ngram series on the U.S.S.R. The attached directive, which states the\nprinciples and procedures which should govern the project, is the result\nof these deliberations. I call your particular attention to the five\nappendices, which are of importance in understanding this statement of\npolicy and operational procedures. The entire directive is based upon\nprevious experience by the Cossdttee members in developing educational\nprograms, and upon our understanding of the purposes of the project.\nIt goes without saying that the Committee does not expect\neach consultant to be individually responsible for all programs to be\nproduced, but with the aid of all of you, we hop© to have assistance in\nsecuring the services of other outstanding American scholars who can\nserve as consultants to individual programs.\nIt should be made clear that the Committee, with the informa¬\ntion that it has in hand, rejects the memorandum of January 3, 1952 by\nMr. Bale Fuller as a policy and operational statement for the project.\nThe Committee earnestly requests your study of this directive\nand your comment upon it. We hope to have you and other four con¬\nsultants meet in the near future to discuss it.\nVery sincerely yours,\ntUg^X~\nGEP:PM George E.Tk>fest, Executive Secretary,\nEnclosures Radio Office, and director of The\ncc: William Harley University of Chicago Round Table\nDale Fuller\nFrank Papp"
}