{
  "id": "d38-21",
  "text": "5) Because of the diversity of views and the sensitiveness of the\nproblems of public relations in this area* every effort should be\nmad® to emphasise the intellectual apparatus* the research techniques*\nthe care, and the objectivity that have gone into the scholar®s pro¬\ncess of finding out as much as he can learn about the Russian system„\n6) It is important to comuni cate to the American people the fact\nthat the opinions of the leading American scholars on Russian life*\nbased on the most careful social science research work and objective\nprocedures* are worth more and deserve more consideration than the\nopinions of men whose study and experience has been casual and super¬\nficial. The central asset of this series is the consultant.\n75 The convictions of the members of the Special Coraittee are that\nthere is a difference between education and propaganda. Our under¬\nstanding and purpose in this project is to present materials about\nRussia that are so completely accurate*and are so without any hidden\npurpose of manipulation* that the resulting programs can b® listened\nto and evaluated by a listener as being educational efforts with no\nulterior motives. Only through this can we achieve believ&bility•\nIf we are successful as educators in this project* we will be able to\npresent programs about Russia which we would be proud to present un¬\nchanged in any item whether we are at war or at peace with Russia •\nThe content of these programs should foe true* irrespective of the\nstate of the political relations between the United States and Russia.\nThe object of the project is to present the truth about Russia inso¬\nfar as it is known by the most competent American scholars. He be-*\nlieve this to be consistent with the national interest of the Ameri¬\ncan people.\nOur conviction is that more knowledge about the U.S.S.R. is essential\nand desirable for Americans discharging their civic responsibilities.\nB. OPERATIONAL PRINCIPLES\n1) The central asset and the wstarw of the Russian program series is\nthe contribution* work* and knowledge of the consultant.\n2) There is a variety of materials about Russian civilization t© be\npresented.\n3) Radio form follows content. % this is meant the fact that the\nparticular radio format of presentation is adapted to the needs of\nthe content and materials to fo© presented, about Russia. It is assumed\nthat there are some materials on Russian civilisation that offer high¬\ner level of ccssnmication difficulty than others. It is recognized\nthat this more difficult and intellectually complicated knowledge\nabout seme problems on Russia will be more difficult to communicate\nto a mass audience and will not have a mss appeal in the my that\nother materials will have which also present is^ortant facts about\nRussian life. Some Russian materials will lend themselves more\nreadily to popularisation then others. This does not mean that the\nmore complicated data are thereby t© foe ignored. It is not a question"
}