{
  "id": "d38-25",
  "text": "13) A recorded program is approved for broadcast as a result of being\nauditioned and approved by the Project Director and the Program Co¬\nordinator • In the vexy early stages of this project, the members of\nthe Special Comities mil want to hear the first couple of programs\nbefore the Program Coordinator gives Ms final approval.\n14) The Special Committee attaches a suggested statement on credits*\nThe’ Committee urges that in all possible instances, the name of the\nresponsible consultant will be identified on the program as a means\nof giving authoritativeness to the materials presented*\n15) The Project Director has the responsibility of keeping the Pro¬\ngram Coordinator fully informed of the progress of the efforts of the\nproject. The Program Coordinator will make these reports available\nto Committee members and add his own comments on them.\n16) The Program Coordinator will keep in direct touch with the five\nconsultants and report on their participation in and appraisal of\nthe program efforts. This operation is not a rigid lino mid staff\noperation with the consultants cosammicating with the Program Coordin¬\nator and Special Committee members only through the Project Director *\nThe needs for future planning and television considerations are part\nof the elements that make this direct, personal contact desirable.\nMembers of the Committee are free t© comssunicate with consultants*\n17) The Committee expects that the consultants will meet as a group\nseveral times during the year* The Gcssmittee deems it necessary for\nthem to engage in periodic general discussions with the consultants\non the success and weaknesses of the program efforts in this Russian\nseries. Since this is the first year of what is ejected t© be a\nfive-year project, the Special Committee must have assistance from\nthe consultants in blocking out the long-range development of programs\nwhich will contribute to international understanding.\nTEE SPECIAL COMMITTEE OP THE NAEB OM THE LOWELL PROJECT\nGeorge B. Probst, Chairman\nRichard Bull\nHarold McCarty\nSeymour Siegel\nParker Wheatley\nADOPTED SUNDAY, JANUARY 6, 1952"
}