{
  "id": "d38-27",
  "text": "APPENDIX Bs\nCopy ©f Letter fro© Mr* Fletcher to Committee of Five\nApril 24, 1951\nMessrs* Richard Hull\nHarold McCarty\nGeorgs Protest\nSeymour Siegel\nParker Wheatley\nGentlemens\nI am enclosing a copy of a letter which lias just gone to Mr* Ralph Lowell\nadvising him of the $300,000. grant to your committee of the National\nAssociation of Educational Broadcasters 1'or programs for the Educational\nRadio Network. The first hundred thousand will be available soon and,\nwith the concurrence of Mr. Lowell, you should work out a responsible ad¬\nministrative procedure. '\nSeveral points need to be reemphasised. In addition t© servicing the Educa¬\ntional Radi© Network, it is understood that, insofar as is possible, these\nprograms will be made available to the BBC in England and to broadcasters\nin other countries, including South Africa, Australia, New Zealand, and\nCanada. In the same way, these programs should be made available, on re¬\nquest, to the Division of .Mass Communications of UNESCO and to the Depart¬\nment of State.\nThe members of the Board ©f The Fund for Adult Education look upon this grant\nof #300,000. as an investment in the production of outstanding educational\nradio programs. It is their hope that these programs mil have sufficient\neducational and entertainment value as to set new standards for the sustain¬\ning programs of the national networks and for sponsors of commercial programs.\nFurthermore, it is hoped that in many cases the networks and sponsors of\ncommercial programs will take over the formats of your educational programs#\nAs you know, there are many sponsors of commercial programs who are willing\nand eager to broadcast radio programs with more mature content, provided\nthey have a large audience value. You know, further, that many professionals\nin the field of commercial radio feel that owners and operators of educational\nstations have not proved their ability either to build or hold audiences\nother than captive audiences.\nIn approving this grant to the special committee of NAE8, the Board of The\nFund for Adult Education feels that it is establishing for the first time a\ncentral fund of sufficient dimensions to warrant the use of the best script\nwriting, directing, and acting talent available.\nJust as quickly as possible, we hope that you will arrange for your program\nplanning meetings and inform us of the general areas in which you decide to\nbuild programs."
}