{
  "id": "d38-3",
  "text": "FROM:\nSTATION WXXX (RELEASE #1)\nADDRESS\nPHONE\n(Date of Release Issuance)\nFOR RELEASE: (DATE)\nThe story of how the Soviet Secret Police operates, how it developed,\nand where it appears to be going, is told in stirring dramatization\nand narrative in the first of a series of seven one-hour programs,\nentitled nT ££££ £__a_s_a_§_y_s_t e_m__o_f ^P£w_e_r_^', which will be heard\nover Radio Station WXXX on -- (date) -- at -- (time)\nThe new documentary is the first in the series of programs under the\ngeneral title of \"People Under Communism*1 being presented\nas an Adult Education Project by the National Association of Educational\nBroadcasters. George Probst of the University of Chicago is chairman\nof the NAEB Adult Education Committee which supervised script-writing\nand production.\nIf we are to prevent terror from spreading to more lands than already\nlive under its shadow, we need to be familiar with the evil story of\nthe Soviet Secret Police. \"Terror as a System of Power\" tells that\nstory --in the authentic language of the historical record -- without\nembroidery and without sensationalism. The practitioners of terror\nspeak for themselves. The words of the victims come frbm official\ndocuments and the reports of living witnesses.\n\"Terror as a System of Power\" was written by David Driscoll . . narrated\nby Alex Scourby . . and produced and directed by Frank Papp. The script\nwas based on documented evidence and expert knowledge in the possession\nof Dr. Merle Fainsod, professor of government at Harvard University,\nand director of political studies at the Russian Research Center.\nDr. Fainsod not only the the author of books on American government,\nbut also is well known for his writings on the government of the Soviet\nUnion. He has traveled widely in Russia, and has interviewed many\nescapees from the Soviet Union.\n'The manipulation of terror as a system of power is a delicate art, \" Dr.\nFainsod said in commenting on the documentary. \"A dictator in command\nof modern armaments and a secret police can transform his subjects into\nrobots and automatons. But if he succeeds too well, he runs the risk of\ndestroying the sources of creative initiative on which survival of his\nown regime depends. This is a problem which the Soviet dictatorship\ncannot evade. Over the long run, it may well turn out to be the rock\non which the Soviet system will founder.\n**■*__* _30\n* * * *"
}