{
  "id": "d38-34",
  "text": "APPENDIX E: ^ W\nMEMORANDUM REPORTING HARVARD PROGRAM CONFERENCE ON PROJECTED\nEDUCATIONAL RADIO PROGRAMS ON RUSSIA — JULY 24, 1951\nPresent: Merle Fainsod\nAlex Inkeles\nPhilip Mosely\nErnest Simmons\nParker Wheatley\nWilliam Harley\nGeorge Probst\nMr. Harley opened the meeting by reviewing the purposes of the\nproject to create educational radio programs in the area of \"international\nunderstanding\" under the Fund for Adult Education grant. Mr. Clyde Kluck-\nholm’s letter giving clearance for use of tfce Russian material was read.\nThis appears in Appendix A. Mr. Kluckholra will talk with Mr. George\nBarrett* Assistant Secretary of State in charge of information* and inform\nhim of the contemplated project.\nThe discussion turned to a consideration of the purposes to be\nachieved in the educational programming about Russia. Briefly reporting\nsome of the main points by way of summary* Mr. Mosely said that the point\nmust be made that Russia is dif f erent—that it does operate on its own basis\nand has a strong force for continuance. There are two fallacies in American\npublic opinion about Russia: the first is that since Russia is different it\nmust be repugnant and weak. To offset this we can show how Russia operates\nin her own framework. The second fallacy is that the Politburo is omniscient-\nand manipulates us here in America.,\nMr. Simmons said that the current concentration in the press on\nRussia’s military might and aggressive intensions* to the exclusion of the\nextensive social* economic* and cultural developments within the country*\nwas a disservice to the American people and one that our program should try\nto correct. Mr. Simmons believed we should show what deflation has meant\nfor the Russians* and the kind of life they are really living. We should\ntake the long-range point of view here* demonstrating, for example* that\nRussian economic development may outstrip that of the United States. We\nshould recognize that there is flexibility in their system; for example* when\nRussians get into an ideological blind alley* they recoil. We should show\nboth the weaknesses and the strengths of the Russian system. Mr. Simmons\nmade the further point that the agricultural revolution now going on in Russia\nis of great importance and is another example of flexibility and change of\npolicy. We might also attempt to answer the question: how has the Russian\ncharacter changed since the revolution?\nMr. Fainsod felt that we must correct exaggerated notions of Russia’s\nweaknesses. In our radio programming we should not make the mistake of pre¬\nsenting an over-simple reaction against the current simplification of the\ngeneral public’s views of Russia. It will be helpful to see Russia in per¬\nspective and give as much historical depth as possible. Mr. Fainsod further\nsuggested that we intersperse historical data into the current human interest\nmaterial."
}