{
  "id": "d38-36",
  "text": "^ -3-\n8) Control of public opinion. Consultant: Inkeles\n9) Culture-literaturej, theater, arts. Music, education. Consultant:\nSimmons.\n10) How planning works in Russia. Consultants: Bergson and Granick.\n11) The legal system. Consultant: Hazard.\nAll agreed that for the historical aspects deRochemont’s script\non Communism should be consulted. In summing up his list of items, Mr.\nFainsod said that in terms of a general framework approach he thought of\nit as the history of Communism, the Communist Party, life in the Soviet\nUnion, and finally, a summing up in terms of future prospects.\nThe group then adjourned for lunch and there was a long discussion\nof possible staff candidates to be project directors. There was a good deal\nof discussion of the operational problem. It was agreed that Mr. Dale\nFuller was the best candidate and Mr. Harley attempted to get in touch with\nhim. Other people suggested as either full-time or part-time assistants\nwere:\n1) Andrew Haufman - part-time only .\n2) Warren Wolfe - M.A. and Certificate of Russian Affairs, Columbia\nUniversity, Russian Institute - as a junior person.\n3) Mrs. Rosa of New York - part-time.\n4) Bob Fleischer of CBS.\n5) Fred Neal - now with Committee on Present Danger.\n6) Fred Wyle - 25 years old; Harvard, going into Law School;\nknows all the interview material - might be a full-time\nassistant - knows all the people in displaced persons community.\nUpon returning from lunch, the major effort was directed toward\nidentifying particular individuals who could serve as consultants or partici¬\npants and contributors to programs in the area. Using Mr. Mosely’s initial\nmemorandum titled ^Series on the USSR,” a large number of people were pin¬\npointed for inquiry. The results of this work are presented in the follow¬\ning enlarged version of Mr. Mosely’s memorandum.\nSERIES ON THE USSR\n(Inkeles suggests two programs\non the rise of Bolsheviks: as a\npolitical party from 1890 on.)\nI. What is a totalitarian system?\n1. The Party ”line” and how it operates,\na. Illustrations:\nThe Varga controversy; why Varga* s interpretation of postwar\neconomic prospects of U.S. was rejected; how the change in\nline was carried out; effects of the change in line.\nConsultants: Domar; Barghoorn of Yale.\nThe dispute over consolidation of the collective farms; the\nKhrushchev policy and why it was adopted; how it was curbed\nand why.\nConsultants: Wayne Vucinich of Stanford; Dinerstein of Rand."
}