{
  "id": "d38-39",
  "text": "2. Fate of several smaller nationalities during and after the war.\n3. Recurrent purges of national party* cadres and intellectuals.\n4. Revision of content of cultural life of non-Russian nationalitiesj\nrejection of any criticism of Tsarist conquest or oppression in\ncontrast to early Soviet attitude- (Ukrainian)\n5. The linguistic controversy; Stalin’s rejection of Marr; its polit¬\nical and cultural significance. Student of Marr by name of\nMaria Poltorat^kaya. ConsultantJ Roman Jacobson of Harvard.\nVII. World affairs and Soviet policy. Consultant: Mosely\n1. Soviet policy in satellite ares. Consultant: Skilling of Dartmouth '\na. Methods of securing control\nb* .Extension of totalitarian domination to all aspects of life;\nrevision of traditions (rejection of Masaryk, e.g., in Czecho¬\nslovakia )\nc. Fear of \"national Conmiunisra\" recurring, as in Yugoslavia\nd. Military integration\n2. Soviet policy in Germany\n3. Soviet policy in China. Consultant: Allen Whiting of Harvard. Have\nLattimore’s Mongolian government-:,n-exile.\n4. Soviet policy in Western Europe\n5. Soviet policy toward Japan\n6. Intensified Soviet interest in Africa. Take what Soviets are writing\nabout it. Jacobsen of Library of Congress. See Melville Herskovits\nof Northwestern U., and his Institute of African Studies.\n7. Soviet policy towards Latin America\n8. Soviet policy and Pan-Slavism\n9* Soviet policy and the Moslems\n10. Soviet policy and colonialism\n11. Soviet policy toward the UN and its agencies: Security Council, Assembly,\n\"Little Assembly/1 UNESCO, World Health Organization, Economic Com¬\nmission for Europe, ECAFE, etc.\nFainsod suggested that we do a series of historical cases, e.g., 1939\nPact, Brest-Litovsk (take debates in Central Committee by Lenin, Trotsky,\netc.), which would show silly predictions by Soviet leadership of Polit¬\nburo. \"Expose of Power Politics Against Inevitable Doctrine of the\nSoviet Union,\" Conrad Brant of Harvard on China Crisis of 1926.\nVIII* Bases of Soviet ideology\n1. What is \"Russian\" and what is \"So* let\" in the Soviet program?\nConsultants: Karpovich, Geroid Robinson, George Kerman, Philip Mosely\n2. Leadership as crucial factor, versus initiative from below.\n3. Bolshevist philosophy of history as a guide to action. See Fainsod\nsuggestion above. Also suggests discussion on dynamics of this\nsystem. Consultants: Geroid Robinson; Barry Moore\n4. Expansionism; \"Russian” or \"Soviet\"?\n5. Can Soviet ideology change from within or only be changed from without?\nHas it shown and will it show equal intensity of drive?"
}