{
  "id": "d38-4",
  "text": "FROM: RADIO STATION WXXX (Release #2 )\nAddress\nPhone\nFOR RELEASE: (DATE)\nNAEB PROGRAM EXPLAINS HOW SOVIETS SEEK\nTO MAKE MUSIC FIT STATE POLITICS\nThe story of how the Russian government and its agencies seek to compel\nmusic in Russia to reflect the ideology of the Soviet state is told in\n\"Music to Order\", the latest in the National Association of Educational\nBroadcasters series of one-hour programs bearing the series title of\n\"People Under Communism\"„\n\"Music to Order\" will be broadcast by Radio Station WXXX on -- (date)\nat — (time) *\nSince 1948, Soviet composers have been compelled in the name of the \"people\"\nto bow to rigid party controls on the form and thematic content of the music\nthey write. But it is the all-powerful party, and not the people, that deter¬\nmines what is \"anti-people's\" music and what is \"pro-people is music.\nWhat this Soviety policy has meant and is likely to mean in the nation's\nmusical development is explored in a broadcast script prepared with the\nhelp of materials and counsel provided by Dr. Ernest J. Simmons, chairman\nof the Department of Slavic Languages at Columbia University. The work\nwas produced and dire cted by Frank Papp.\nGuests on \"Music to Order\" whose discussion on the program describes the\nplight of musical composers in the U.S.S.R. today are Deems Taylor and\nHenry Cowell, composers, and Nicolas Slonimsky, authority on Russian\nmusic. Dr. Simmons appears with the guests to help develop the discussion.\nCommenting on the new program, Dr. Simmons, who has been a student of\nRussian literature and culture for about twenty years, said the discussion\nwould show how destructive Soviet controls on composers have become and\nhow they have forced \"the free, soaring spirit of original genius\" into the\n\"mediocrity of conformity\".\n\"The creative mind cannot be restricted to set forms and themes, or to a\npattern of ideas, beliefs and loyalties prescribed by a political party, \" Dr.\nSimmons said. \"Under such compulsions art withers and dies. And so will\nthe greatness of Soviet music wither and die under the sweeping controls of\nthe Communist Party. \"\n& ^ # 30 * * * & *"
}