{
  "id": "d38-42",
  "text": "MINUTES OF MAY 29 MEETING - Page 2\nlong-runr permanent improvement of the interests of the NAEB or educational radio.\nHull and Siegel argued for giving a strong directive to -whoever is appointed as\nexecutive secretary that he is a NAEB employee and must be constantly working In\nthe interests of promoting the long-run interests of educational radio and the\nNAEB, and not simply be producing educational programs. Probst argued that\nproducing educational programs is the purpose of the grant; further, that the\nachievement of these programs will lead to the development of the long-run in¬\nterests of educational radio and the NAEB. The renewal and increase in grant\nof funds in following years for programming and other purposes depends on the\njob that is done in quality programming. Probst emphasized the need and obliga¬\ntion to produce some high caliber programs in four areas (that we were not\nobligated to produce \"The People Act\" series, removing responsibility for pro¬\ngramming in this area) and that these programs need not be many in number\nQuality is the aim!\nThere was much further discussion of this problem of the relation of\nthe Ford grant and the Kellogg grant. There was general agreement that, of\ncourse, the executive secretary of the Special Committee of NAEB on the Lowell\ngrant should be expected to be alert to seeing the possibility of suggesting\nprogram resources for the NAEB network as he did his job traveling through\nthe nation. But there was no agreement on assigning him any responsibility\nin addition to developing the very finest educational programs to satisfy the\nterms of the Ford grant. Probst repeated the proposition that the Ford grant-\nin-aid is a \"put up or shut up” situation. The test we were faced with wass\ncould the educational radio directors join in a national cooperative effort\nto administer a fund for the production of quality educational radio programs\nin the interest of the citizens? The challenge iss can the educators do this\njob? If they can, further support for NAEB programs and facilities will be\nforthcoming. McCarty expressed his belief that the programs must be a demon¬\nstration of the talent and ability of the educators to educate through radio\nand he stated that this talent does exist in education and must be brought out.\nHudson agreed*, saying that he believed that the programs produced will be the\ndeterminant on whether the board of directors of the FAE renew in the following\nyears. Hudson stated his plan to make sure and have the members of the board\nof directors hear the best programs. He believed these programs would be the\ndeterminant on whether there is renewal.\nSiegel argued that the members of the board of directors of the FAE\ndidn’t have the capacity to judge the programs and in his belief it will be\nthe amount of publicity they see in the daily newspapers and industry press\nthat will get the board of directors to renew. If there is favorable comment\non the programs in the industry press, renewal will take place. Siegel argued\nfor the establishment of a New York publicity office that could accomplish\nthis. He argued also for the need of a New York office where a NAEB repre¬\nsentative can go to the United Nations or the Red Cross, etc., and ask for &\nspecially produced series for the NAEB network. Hudson and Probst argued that\nthe Ford grant did not provide for or intend that it support a New York office.\nMcCarty said that for many years he had tried to get a New York and a Washing¬\nton office for the NAEB. Hull pointed out the educational stations need"
}