{
  "id": "d38-43",
  "text": "MINUTES OF MAI 29 MEETING - Page 3\npublicity* programming, and personnel assistance. Hudson pointed out the NAEB\nnetwork has been externally centered* and the Kellogg grant is intended to\nencourage and feed into the NAEB network stream the programs from local educa¬\ntional stations. Hudson reminded the Committee again of the fact that the Ford\ngrant is a grant-in-aid. He pointed out that Siegel is the New York representa¬\ntive of the NAEB and is doing a fine job, and that the Ford grant was not\nintended to do anything but support new programs on a \"set up” basis. Siegel\nraised the question of where were the offices going to be in New York. He\npointed out the difficulties he had with his staff in contributing so much\nresource to the NAEB network. Where will the office of the executive secre¬\ntary be? Hudson pointed out the NAEB is a going organization with affiliated\nmembers who are in possession of facilities scattered all across the nation,\nthat the NAEB was represented as such to the Ford Foundation, and that the\nFord grant was not made for the purpose of setting up buildings or buying\nfacilities, or providing things of a technical character since the NAEB was\npresumed to have these. Probst stated his belief that whoever was executive\nsecretary would have the resources of the University of Illinois in Urb&na,\nthe University of Chicago in Chicago, the University of Wisconsin in Madison,\nthe Lowell Institute in Boston, etc., as basing points for operations in those\ncommunities. Whatever charges that resulted locally from the going operation\n(i.e., telephone, secretarial, engineering, etc.) would be billed against the\nLowell Institute. Hudson restated that the Ford grant is a grant-in-aid and\neach institution is to aid as much as possible in the common effort to benefit\nall. Siegel stated that, of course, he and his New York resources would con¬\ntinue to aid the NAEB, but that the real problem was not being met. Siegel\nand Hull argued for a much closer supporting relationship than this would seem\nto mean for the line between the Ford grant and the Kellogg grant.\nThe Committee then turned to consider candidates for the office of\nexecutive secretary to execute the Ford grant. A total of 76 possibilities\nwas considered. At the end of extended discussion, Hull nominated \"William\nHarley, program director of WHA at the University of Wisconsin, as program\ncoordinator for the educational program development project for which the FAE\ngranted money to the Lowell Institute on behalf of the NAEB.\" Hull’s motion\nwent on to states \"William Harley is to explore with and record for the\nSpecial Committee of Five program plans in accordance with the Ford grant and\nexecute the programs stipulated by the Special Committee of Five of the NAEB.\nWilliam Harley is to work with the Special Committee of Five to define the\nprecise and desirable relationships to exist between his function as progra:-:\ncoordinator and the network organizational activities of the NAEB. These\nnetwork organizational activities of the NAEB are defined under teras of the\nKellogg grant and will be further defined by the NAEB board of directors.\nWilliam Harley is to be appointed at a salary of 510,000 for one year begin¬\nning June 1 with an additional 52,000 to pay the costs of the moving expens os\nand readjustments of his family plans resulting from his taking this position.\nWilliam Harley is to prepare a plan of operations and budget and report on\nsuch other administrative procedures as may be necessary for a year-long program\nof operations.V Siegel second the motion. It was unanimously adopted. In"
}