{
  "id": "d38-45",
  "text": "MINUTES OP MAY 29 MEETING- - Page 5\nProbst asked if the Committee would recommend action in certain pro¬\ngram planning areas. No action was taken to authorize this. Probst presented\nseveral motions,that failed of adoption, to provide for some immediate decision\non some series. Hull moved and it was generally agreed to that Harley was\nauthorised to implement program conferences for all four subject matter areas.\nIn the discussion of these areas, the program conference on \"Russia and American\nForeign Policy\" with George Kennan and Philip Mosely came under the following\ncriticisms by McCarty, Siegel, and Hull: (l) The Committee should not be\nresponsible for choosing these men to participate in program conferences; (2)\nThe Committee should not be responsible for anything that was said in any of\nthe programs (McCarty pointing out that he was not responsible for a single\nthing that was said on WHA); and (3) There should be a general conference\nbringing together a group of outstanding authorities who would select the people\nto be turned to for programming direction in the various areas. In reply to\nthis, Probst pointed out that certain areas and scholars had already been\nidentified to the Ford Foundation and that, further, if these areas and spe¬\ncific program suggestions had not been identified, the FAE would not have made\nthe grant in support of program development. It is impossible to secure finan¬\ncial grants for programming without giving some specific ideas about the pro¬\njected educational programming that is expected to be superior to the current\ncommercial programming. Probst also argued that we, as educational broad¬\ncasters, were also faculty members of universities and were also social\nscientists. We must accept the responsibility that comes to us as people who\nare criticizing the commercial broadcasting fare. We are educators who are\nresponsible for trying to create better radio than the American people are\nnow being given. As educators, we had to decide what was important as a prob¬\nlem, and turn to the outstanding scholars in universities to aid us in this\ndecision and to tell us what needed to be said about these problems. These\nauthorities, as always, were individually responsible for what was said on\neach program. But the Committee was responsible for selecting the best men of\nthe best universities.\nIn an extended discussion the objection was made that the program\nplanning conference on Russia should not come first. In reply it was pointed\nout that effort was being made to work out a program planning conference with\nRodfield on the \"Study of Man,\" and that, further, the order of program plan¬\nning conferences had no necessa2*y relation to the appearance of the actual\nprograms. It might turn out that the development of a series of programs on\nRussia would involve such effort and take such time that it would very likely\nbe the last series produced rather than the first. In the further discussion\nit was made explicit that any program done in this series as a result of the\nefforts of this Special Committee should carry the identification of the\nresponsible scholar and the responsible university or college or educational\ninstitution. Probst cited the example of the University of Chicago \"Human\nAdventure\" programs always identifying the scholar or scholars at the end of\neach program who had read and supervised the script and were responsible for\nits content."
}