{
  "id": "d38-46",
  "text": "MINUTES OF MAY 29 MEETING - Page 6\nAttached in Appendix C is a statement of the educational radio\nprogram development plan approved by the board of directors of the FAE.\nAlso attached is Appendix D containing the text of the memorandum on program\nplanning conferences given to Mr. Fletcher on February 21 to explain plans\nproposed in development of new educational radio programs worked out in\nconsultation with FAE. Probst said regretfully that the Committee should\nprobably have devoted its entire day to the problems of decisions about the\nseries of educational programs to be developed in the various subject areas\nof the Ford grant. The grant of money was made by Mr. Fletcher and the\nboard of directors of the FAE to this Special Committee of the NAEB; Richard\nHull, Harold McCarty, George Probst y Seymour Siegel, and Parker Wheatley,\nbecause they assumed the responsibility of a program production committee.\nIt would be impossible for this Special Conn&ttee to discharge its responsi¬\nbility if it were to ignore in any way the full burden of the responsibility\nfor the decisions involved in creating programs that falls upon it.\nHull arranged that the Special Committee would meet in relation\nto its programming responsibility to WOI-TV on June 12-13 in Arnes, Iowa. It\nwas also agreed that Harley should be there* It was further agreed that the\nCommittee should try to find some time to discuss the problems of educational\nradio programming in carrying out the terms of the Ford grant and carry on\nsuch discussion at some convenient time that is free on June 12 and 13 in\nAmes, Iowa.\nMcCarty criticized the proposed series using the Supreme Court\njudges, since this might not be the best way to present the American heritage.\nHe wished to know where this program subject had come from. Probst replied\nthat it was one of those discussed with Mr. Fletcher as an example of the\nkind of tiling that we would do if we were given the money for these educa¬\ntional programs.\nOn the problem of the expenses for this meeting, it was agreed that\nthe Committee members should individually send their expenses to William Harley\nat his office at the University of Wisconsin, and that as soon as the problem\nof the fiscal procedures had been worked out, William Harley would process\nthese disbursements. Hudson urged McCarty to release Harley so that he would\nbegin work on June 1, 1951*\nIt was agreed that a full report of these minutes should be gotten\nout immediately.\nThe meeting adjourned at five P.M.\nRespectfully submitted,\nGeorge e1Probst * Chairman"
}