{
  "id": "d38-48",
  "text": "APPENDIX B\nCOPT OF LETTER FROM MR* FLETCHER\nTO COMMITTEE OF FIVE\nApril 24, 1951\nMessrs. Richard Hull\nHarold McCarty\nGeorge Probet\nSeymour Siegel\nParker Wheatley\nGentlemen:\nI am enclosing a copy of a letter which has just gone to Mr. Ralph Lowell\nadvising him of the 1300,000. grant to your committee of the National Associa¬\ntion of Educational Broadcasters for programs for the Educational Radio Network.\nThe first hundred thousand will be available soon and, with the concurrence of\nMr. Lowell, you should work out a responsible administrative procedure.\nSeveral points need to be reemphasized. In addition to servicing the Educa¬\ntional Radio Network, it is understood that, insofar as is possible, these pro¬\ngrams will be made available to the BBC in England and to broadcasters in other\ncountries, including South Africa, Australia, New Zealand and Canada. In the\nsame way, these programs should be made available, on request, to the Division\nof Mass Communications of UNESCO and to the Department of State.\nThe members of the Board of The Fund for Adult Education look upon this grant\nof $300,000. as an investment in the production of outstanding educational\nradio programs. It is their hope that these programs will have sufficient\neducational and entertainment value as to set new standards for the sustaining\nprograms of the national networks and for sponsors of commercial programs.\nFurthermore, it is hoped that in many cases the networks and sponsors of com¬\nmercial programs will take over the formats of your educational programs.\nAs you know, there are many sponsors of commercial programs who are willing and\neager to broadcast radio programs with more mature content, provided they have\na large audience value. You know, further, that many professionals in the\nfield of commercial radio feel that owners and operators of educational stations\nhave not proved their ability either to build or hold audiences other than\ncaptive audiences.\nIn approving this grant to the special committee of NAEB, the Board of Tie rund\nfor Adult Education feels that it is establishing for the first time a central\nfund of sufficient dimensions to warrant the use of the best script writing,\ndirecting, and acting talent available."
}