{
  "id": "d38-5",
  "text": "FROM:\nSTATION WXXX\nADDRESS\nPHONE\n(RELEASE #3 )\n(Date of Release Issuance)\nFOR RELEASE: (DATE)\nThe performance of Soviet MIG jets in the skies over Korea is tangible\nevidence of the industrial capabilities of the U.S0S.R0, and the founda¬\ntion of those capabilities is the Soviet factory. The industrial phase of\nSoviet power is surveyed in \"The Men Who Make the MIGs\", latest\nin the series of one-hour radio shows, under the general title of\n\"People Under Cjommunism\", produced as an Adult Education Project\nby the National Association of Educational Broadcasters.\n\"The Men Who Make the Migs\" will be heard on Radio Station WXXX on\n-- (date) --at -i (time) The Soviet factory, we learn, is a major\nkey to understanding the weaknesses and strengths of Soviet Russia.\nThe Radio listener in this broadcast is taken inside one of these\nfactories for a night and a day. The listener learns of its inner workings\nas these workings were exposed to the programs producers by Soviet\nengineers and workers who escaped to the West.\nThis new episode in the Russian radio story was written by Ralph Tangney\nand was produced and directed by Frank Papp. The script was based on\nmaterials supplied by Dr. Alex Inkeles, research director of the Harvard\nproject on the Soviet Social System.\nAuthor of \"Public Opinion in Soviet Russia\", Dr. Inkeles is research\ndirector of a project in which almost 500 formerr Soviet citizens were\ninterviewed in the western zone of Germany in the fall and winter of\n1950-51. In addition, he had access to questionnaires filled out by more\nthan 2, 000 former Soviet citizens about their experiences in Russia.\n\"It is in the nature of a totalitarian regime that it can mobilize all resource,\nto push through the programs which the all-powerful leaders regard as\ncrucial, \" Dr. Inkeles said in discussing his documentary. \"That is the\nfundamental strength of a totalitarian regime. But at what cost in\nmachines, in men and, in the last analysis, in the loyalty of its\nharrassed citizens? There lies the great weakness of the totalitarian\nregime. \"\n■* * * * 30 * * * *"
}