{
  "id": "d38-50",
  "text": "APPENDIX C\nSTATEMENT OF EDUCATIONAL RADIO PROGRAM DEVELOPMENT PLAN APPROVED BI\nBOARD OF DIRECTORS OF IKE FUND FOR ADULT EDUCATION OF THE FORD FOUNDA¬\nTION APRIL 5, 1951\nThe whole objective of the Project herein proposed is the bringing together\nof the best minds and the most competent communications skills in delineating\nand producing programs of educational significance.\nThe first step in developing such programs is the determination of (a) what\nshould be said* and (b) how can it be communicated most effectively. Accord¬\ningly* included in the Project is provision for program planning meetings in\nfive important subject areas. Each of these planning meetings would include\nseveral area specialists and radio writers and producers. They would go far\nbeyond the mere suggestions of subjects of broadcasts and spell out in detail\nmaterial to be presented in programs, the frame of reference in which it should\nbe presented* ways and means by which listener involvement can be attained* etc\nIn other words* the planning work should focus on the question* what is it that\nthe American people ought to know about a given area and how can that icnowledge\nbe communicated to them in such a way as to promote their understanding of the\nproblem?\nThe cost of five such program planning meetings is estimated to be $25*000.00.\nProgram Areas\nThe five program areas annotated here are recommended for further study and\nconsideration.\n1. The problems of international understandings\nA series of programs on JTHow America Looks to the World”—helping ue to\nsee ourselves* our problems and world problems through the eyes of other\npeoples and other cultures. Resources of such organisations a© the\nAmerican Friends Service Committee* UNESCO,, United Nations* BBCf All-\nIndia Radio* Institute of Current World Affaire* etc.* would be drawn\nupon* in addition to scholars and journalists* and publications and\nother research materials available in the United States.\nThe estimated budget for a series of 52 programs in this area is\n$60*000.00.\n2. ”The People Act”?\nA aeries of narrative-dramas reporting the experience of selected ccmr-\nmunities and groups of citizens in recognizing their own problems and\norganizing to take appropriate action for resolving them. This series\nwould be in the same pattern as* if indeed not a continuation of* the\nseries of programs under this title prepared by the 20th Century uni\nand broadcast by the National Broadcasting Company. Such demonstrations"
}