{
  "id": "d38-51",
  "text": "Appendix C - Page 2\nof effective citizen action a9 the work of the Committee for Kentucky;\nthe Bergen-Pasa&ic Community Council; Sharon, Pennsylvania—a study in\nindustrial peace, etc*, would be recalled and dramatized for the lessons\nthey teach and the example they set.\nThe estimated budget for a series of 26 such programs is $52,000.00*\n3* Discussion programs in the area of public affairs:\nSeveral unit series of programs which use the resources of great univer¬\nsities directly and continuously in the immediate service of the demo¬\ncratic process, placing before a wide, thinking audience information and\nopinion regarding the pressing issues and perennial values.\nIn developing this area, it is expected that (a) existing discussion\nprograms on educational and commercial radio stations would be screened\nwith a view to rebroadcasting the better ones and thus giving them a wider\nhearing (America at the Crossroads; Northwestern Reviewing Stand, The\nAmerican Way, etc.); (b) existing programs would be aided in developing\nstrong sequences of broadcasts on an important issue or problem; and (c)\nnew program series for the Educational Radio Network would be addressed\nto important non-topical problems which rarely are heard on the American\nradio. This latter group might include units of three to a dozen programs\ntreating consecutively relevant aspects of such subjects as the military\nprogram and American life, the Mid-Century White House Conference on\nChildren and Youth, the American judiciary, the military budget, the\nHoover Commission report, laborfs role in industrial management, etc.\nThe estimated budget for a series of 26 programs ii $35,000.00.\n4. The study of man:\nA program dealing with some of the problems posed by the great differences\nin cultures and human interests, with a view to creating a better under¬\nstanding of the behavior of the many different groups of people in the\nmajor cultures of the world. The programs would draw heavily again&t\nthe fields of social anthropology, psychology, literature, and sociology.\nIn depicting a highly developed culture, the programs could draw on the\nresources of the Institute of Russian Studies at Harvard or Columbia in\ndeveloping the. Russian national character as revealed in Russian docu¬\nments and literature. Likewise, the works of Redfield, Mead, and others,\ntogether with their advice and active participation, would make possible\nauthentic programs about primitive peoples giving emphasis to these human\ncharacteristics which all men have in common.\nThe estimated budget for a series of 26 programs is $35,000.00."
}