{
  "id": "d38-54",
  "text": "MEMORANDUM TO THE SPECIAL COMMITTEE OP FIVE OF THE NAEB:\nMr. Richard Hull\nMr* Harold McCarty\nMr. Seymour Siegel\nMr. Parker Wheatley\ncc Mr. William Harley\nSUBJECT: CONFERENCE WITH MR. CHARLES E. MERRIAM, CONSULTANT TO THE PUBLIC\nAFFAIRS AND CIVIC DISCUSSION PROGRAM AREA AND CONSULTANT TO THE\nTOTAL LOWELL ADULT EDUCATION BY RADIO PROGRAMMING PROJECT -\nThursday, November 15, 1951, 3:00 P.M.\nMr. Harley and I had a two-hour conference with Mr. Merriam.\nWe discussed the procedures and priorities of action within this area of set¬\nting up a project to do discussion programs on civic education. Mr. Harley is\nto see Mr. Las swell on his next trip East. He is to consult with Mr. Lasswell,\nMr. Donald K. Price of the Public Administration Clearing House, Mr. Frank\nBane, Mr. Herbert Snerick, Mr. Howard Myers, and Mr. Robert Culkins to search\nfor the right man to head up the Washington office for the production of talk\nprograms on civic affairs.\nMr. Merriam stated that he would:\n1) Prepare a statement on the function of clarification in\ncivic education. This statement would attempt to lay the basis of\nthe political philosophy that underlies the contribution that we\nare trying to make to civic education and give an overall rationale\nfor the project (it goes without saying that among other things, this .\nstatement will be of service to us in preventing us from falling into\npolitical difficulties where our programs might be accused of being\n\"leftist” or \"rightist\" or whatever).\n2) Prepare a statement on how radio programming could be pro¬\njected to increase the amount of individual initiative and participa¬\ntion in the society.\n3) Prepare a suggested li3t of members of a civic broadcasting\ncouncil to serve as the overall top brass on this project. This list\nwould be worked out with Mr. Lasswell.\n4) Prepare the way for Mr. Harley in working with the Public\nAdministration Clearing House, CED, Brookings Institute, etc.\n5) Prepare a suggested list of subjects for radio presentation,\nthis list, of course, being screened by Mr. Harley and then by the\nWashington project director before any of the suggestions are carried\nout.\n6) Prepare a long-range statement of alms and efforts in this\nwhole field of the Lowell civic education project, this to be done\nwith the help of Mr. Lasswell."
}