{
  "id": "d38-56",
  "text": "JEFFERSON’S STEADILY RISING STAR\n(From a review of Nathan Schachner’s new biography\n* !,Thomas Jefferson”, New York Times, Dec. 2, 1951;\nAdrienne Koch, author of \"Jefferson\nand Madison: The Great Collaboration.\"\nThe star of Thomas Jefferson continues to rise. Americans,\nmade conscious in this generation of the real and potent danger of\ntyranny and totalitarianism, turned in the Thirties, with the logic\nof self-“interest, to the Inspiration and works of the finest demo¬\ncratic mind in this nation’s history. What began there in the way\nof fresh studies of Jefferson’s mind and his \"lengthening shadow\"\nof democratic influence, was keyed to new majesty with the prepar¬\nation of the full writings of Thomas Jefferson.\n\"The Papers of Thomas Jefferson\", four volumes of which have\nalready appeared, is conceived on the grand scale of fifty-two\nvolumes. At the same time, Dumas Malone’s comprehensive five-volume\nbiography (the second volume was published' In October) is breaking\nnew ground, departing from accepted myths and distortions about its\ncomplex and ever-faecinating subject. It is hardly surprising. In\nthis atmosphere of recrudesced democratic theory, that even those\nwho originally gave their hearts to Hamilton, experience some his¬\ntoric impatience with the specialized contribution of that important\nfigure, and seek broader vistas such as Jefferson, the humanist, can\nprovide....since these two handsome volumes are more comprehensive\nthan previous biography in the twentieth century (Randall’s larger\n\"Life of Jefferson\" belonging, in more than the chronological sense,\nto the nineteenth century) they will surely earn themselves a con¬\nsiderable reading public. They will not, however, satisfy students\nof Jefferson with anything approaching the degree of intellectual\nsatisfaction that Dumas Malone’s \"Jefferson and His Time\" is creating.\nIn Malone’s work one finds a combination of the most meticulous\nscholarship, the most courteous acknowledgment of debt to those who\nhave provided materials or interpretations of Jefferson, and the most\ngenuine maturity of judgement and interpretation....a combination that\ntogether with gracious prose promises to produce the definitive bio¬\ngraphy of Jefferson for our century."
}