{
  "id": "d38-7",
  "text": "FROM:\nRADIO STATION ffXXX (RELEASE # 5 )\nAddress\nPhone\nFOR RELEASE: (DATE)\nRUSSIAN LITERATURE MUST EXTOL\nSOVIETS, NAEB PROGRAM RELATES\nBy virtue of official U.S.S.R. government controls, Soviet literature\ntoday is obliged to reflect a negative sense of reality -- the idealization\nof life in the Soviet Union which the Communist Party foists upon the\npublic, both as a reflection of Communist aspirations for the future,\nand as an opiate to minister to its present discontents.\nHow the Communist Party in Russia moves, through governmental machinery\nto convert practically all of what might be productive Russian literature,\ninto little more than a Soviet propaganda mill is told in a one-hour broadcast\n’‘Literature to Order”. The show is one of a series \"People Under Com¬\nmunism\", produced as an Adult Education Project by the National Association\nof Educational Broadcasters.\n\"Literature to Order\", with all of its dramatic overtones, will be heard by\nradio listeners in this area on -- (date) --at (time) over Radio Station\nWXXX.\nMaterials for the broadcast were supplied by Dr. Ernest J. Simmons, chair¬\nman of the Department of Slavic Languages at Columbia University. Dr.\nSimmons also acts as narrator for \"Literature to Order\". The program,\nlike the others in the series, was produced and directed by Frank Papp.\nDr. Simmons has made five trips to the Soviet Union for research purposes.\nHis biographies and critical studies of Pushkin, Dostoevski and Tolstoy are\nstandard works.\n\"Communist theology --if its literature can be accepted as being a mirror\nor it -- insists that badness can never succeed, at least only in the unsocial -\nistic realism of the West and America, \" Dr. Simmons said. \"Thus,\nsocialist 'realism* in Soviet literature of today seems to have been trans¬\nformed into the unreality of a kind of Soviet fairy tale in which the wicked\nstepmother, steeped in bourgeois survivals, always gets her just desserts\ni the end, and the persecuted heroine always marries the brave Communist\nero and lives happily ever afterwards in the socialist paradise of the USSR. \"\n* * * * * 30 * * * * *"
}