{
  "id": "d38-9",
  "text": "FROM:\nSTATION WXXX\nADDRESS\nPHONE\n(RELEASE #7 )\nFOR RELEASE: (DATE)\nIf the nations of the West are to help the peoples of Asia avoid the\ndisastrous \"short cut” which the Communists promise will lead\nthe Asians to a fair share of the good things of life, we must under¬\nstand what conditions make this Communist path so alluring.\nAll understanding of these conditions is conveyed in \"The Music and\nthe Dream\", an hour-long broadcast in the series of seven one-hour\ndocumentaries with the group-title \"People Under Communism\",\nproduced as an Adult Education Project by the National Association\nof Educational Broadcasters. \"The Music and the Dream\" will be\npresented over Radio Station WXXX on -- (date) -- at -- (time)\nThe peoples of Asia and the Middle East, so little understood by us,\nwant to be better known. They want to be respected and treated as\nequals, to be allowed to manage their own affairs, to have a fair\nshare in the good things of life. They cannot fully understand, with¬\nout our sympathetic help, that other countries have taken the course\nrecommended by the Communists and have found themselves on a rough\nroad to a dead end of stagnant despotism. On this program we will\nhear what some of the Asians are saying and learn what they are doing.\nThe script for \"Music and the Dream\" was written by Milton Geiger\nand narrated by Arnold Moss, with special music composed and con¬\nducted by Wladimir Selinsky. The show was produced and directed by\nFrank Papp. Materials and counsel for the broadcast were supplied\nby Dr. Harold H. Fisher, chairman of the Hoover Institute and Library\nat Stanford University.\nDr. Fisher is a radio commentator and author of several books on the\nSoviet Union. He served with the American Relief Administration in\nRussia, has traveled extensively in Asia, and is a scholar on Soviet\npolicy in the Far East.\n\"A revolution is going on in Asia today\". Dr. Fisher said in explaining\nhis new documentary. \"The Communists are trying to capture it and\nlead it away from the goals of liberty, equality and fraternity, and turn\nit through class wars and fear into a totalitarian dictatorship. We\nAmericans can contribute to good will among Asia's millions by giving\nthem our respect, our friendship and understanding, and with these\na reaffirmation of the freedoms and responsibilities that are the\nfoundation of our way of life. \"\n* * * 30 * * *"
}