{
  "id": "d1459-3",
  "text": "GILDING THE GUILD\nTfe have our own I. U. Radio Guild, as you know, and Sunday,\nFebruary 29, the Guild nut on its first broadcast of the current\nsemester — sort of an introductory program in which all Guild\nmembers took part. A whole half hour, too, and. we* 11 be half-\nhouring our way for some time to come each Sunday evening over\nWTOM, Bloomington.\nThe Guild., this past summer, had a half-hour Wednesday night\nshow over WIBC, Indianapolis. \"Seven for Summer\" it was called,\nand that means there were seven broadcasts. Mice little variety\nshows with everything done by Guild members — seriating, acting,\ndirecting, music, sound effects, controls et cetera and ad\ninfinitum.\nThe Guild is composed of students and faculty members who are\ninterested in radio. Since the members do all the work it‘s pretty\npractical training for them.\nThey elected new officers this semester. Here they are*.\nChuck Aidman, PG, president; Mitch Gerbick, junior, vice-president;\nDotty Katzman, junior, secretary-treasurer; Leonard Wenner, PG,\nscript and continuity supervisor; Bill Potter, senior, technical\nsupervisor; Mickey Purcell, junior, sound and music supervisor;\nand R. D. Kern, senior, production supervisor.\n* * # #\nYOU HAVE THE FLOOR, SENATOR\nWe take the floor, too, every Tuesday night, 7:30-8:00, on\nWTOM, Bloomington, wj. th FOLLOWING CONGRESS, Just as the opening\nannouncements reads —\"Reenactments of scenes from Congress and\nParliament,\" That \"Parliament\" part means we get a little British,\nnow and. then. The lively debates of Congress and Parliament are\npresented, just as they happened, with the throat clearings, gavel\npoundings, boos, sighs, laughs and* applause realistically portrayed.\nSuzanne Reed.er (of the red hair) does the directing. Last\nsemester1s director was Leonard Wenner, The scripts come from\nWHA, Wisconsin\n■M- *\n# # #\nALONG THE JORDAN\nBloomingtonians had been let in on the happenings and mis-\nhappenings of I, U. all last semester when they tuned to WTOM,\nBloomington, at 6:05 every week-day evening. This time has now\nbeen changed to 8:05 p.m. daily. News broadcasts about campus\ndoings are prepared by the Department of Journalism and produced\n(continued, next page)"
}