{
  "id": "d1459-4",
  "text": "by the Radio Department. R. D. Kern, Junior, does the reporting,\nwith a half dozen others being groomed for wofk this semester.\nThis semester, too, we began giving campus news over WSUA,\nBloomington, also, on their \"School and College Matinee broadcast,\nfrom 4:55-5:00. John Taylor handles this broadcast, with new\nreporters due to start soon.\nWith a new commercial AM station due to go on soon, with WSUA\nadding FM, and a Television station scheduled for Summer, outlets\nfor programs are not difficult to find., although coverage and\nhours available sometimes leave something to be desired.\n* *\n•K # #\nAHEM!\nWe1 re sorta proud of the INDIANA SCHOOL OF THE SKY, so we1re\ngoing to talk about.it.\nTwelve radio stations now carry the SCHOOL OF THE SKY here in\nIndiana, with more scheduled to join our network next year. The\nbroadcasts are heard daily by 50,000 or so school children.\nFurthermore, all kinds of educators endorse the programs, and\nschool teachers write us some very nice letters.\nGeorge C. Johnson (you remember George — once of Kansas\nState Teachers College) handles the head position on the SCHOOL OF\nTHE SKY, and Fred. L.^Gerber does all the producing and. directing.\nFred writes a few scripts, too.\nHere's the way we've got the series set up:\nMonday — Music\nTuesday — Social Studies\nWednesday — Art\nThursday — Science\nFriday — The Story Book.\nThe programs are aimed for elementary school children. School\nteachers using the broadcasts have handy an information-oacked\nTeacher's Manual, with music books for the children besides. The\ntwo publications are free for the asking. The Manual lists the\nbroadcasts — pre-broadcast and post-broadcast activities, readings\nand all sorts of audio and visual aids. The music book (it has\npictures in it drawn by one Sara Chapman McClain who used to put\nout this NEWSLETTER) contains the songs the kiddies sing along\nwith our Music Lady — she's Miss Dorothy Kelley, assistant pro¬\nfessor of music at I. U.\nWe didn't plan any of the programs haphazardly but called in\neducation experts. There's Miss Kelley, whom we just mentioned.\nPaul Seehausen, counselor in social studies for the State Depart¬\nment of Education, naturally supervises the Social Studies series.\nMiss Martha Carter heads the art programs — she's an instructor\n(continued, on next page)\n-5-"
}