{
  "id": "d1459-9",
  "text": "WHAT1 s msi\nThat's right — WVIS — or, \"The Voice of Indiana Students.\"\nBy this coming summer a group of interested students has\ndeclared that it hones to have its own campus radio station --\nthe kind of station which can only be heard by the housing units\nwhere it's \"piped,\" Sort of exclusive. And since only student\ndwellings will be able to nick un the broadcasts, more latitude\nin program subject matter will be possiblei (ho Mike and. Bat\njokes, though).\nBob Schwarz and Dave Benjamin, of the student body, are\nheading this venture. The nroject is only on paper, now, and\nstill has such hurdles as committee annroval, technical problems,\nfinances, Trustee annroval, etc. to scale yet. In the words of\none of the boosters, \"WVIS will be a non-nolitical student\nventure intended, expressly for those students who are interested\nin radio work.\"\n•ir # *\n•*\nU. N. AND OTHERS\nLast summer we got to talking to the U. N. Radio men at\nLake Success. We wanted to do something to help. Finally got a\ndeal set un which is now growing: a daily,\"U. N. Revue,\" with\nactual dubs of voices from the U. N.1s business of the day. These\nhave been going fine since July. We distribute booklets explaining\nthe U. N. free of charge to listeners requesting them. The show\ngoes over WTOM every evening at 6:15> and some of the more unusual\nones we also send to other stations*\nWe also got a scholarship Set un* The Wendell Wilkie\nScholarship, provided by the Indiana University Foundation under\nthe always cooperative and energetic leadership of Lawrence\nWheeler. Our first Wendell Wilkie scholar, just back from the\nU. N., working and learning in the Radio Department at Lake\nSuccess, was Pat Gates. She was selected out of a considerable\nnumber of candidates. Selection was made by a committee\nscrutinizing grades, honoraries, interests (Pat's a government\nmajor) and personality. We all feel we made a fine choice, and.\nPat worked, her head, off to prove it. She was on one of^the.\nU. N. Revues recently and we sent the platter on to WIRE which\nalso aired it, after it w^s played on WTOM.\nWe've also turned out to be the first school in the U. S.\n(up to a little while ago anyway) to get a script in for a new\ncultural exchange series with CBC. You'll probably be hearing\nit some day on platters. All a part of UNESCO ideals, etc.\n(continued on next page)\n-10-"
}