{
  "id": "d915-0",
  "text": "NAEB HEADQUARTERS\n1346 Connecticut Avenue, N.W,\nWashington 6, D.C.\nMEMORANDUM\nTO: NAEB Board of Directors\nFROM: Harold E. Hill\nDATE: April 22, 1963\nI am enclosing a copy of an analysis we have just made of educational\nstations in the United States.\nI believe you will be as concerned as we are over the decline in percentage\nof educational FM and TV stations belonging to the NAEB. Below is a table\nshowing comparative figures for such studies made approximately a year\napart over the past three years. The first figure in the series of three\nfor each report represents the total number of such educational stations,\nthe second number indicates the number belonging to the NAEB, and the third\nfigure represents the percentage of stations which were members.\n1/1/60 4/1/61 2/1/62 4/15/63\nTV stations 45-37-82.2% 56-50-92.5? 62-54-87? 78-63-80.8%\nFM stations 177-129-72.8% 209-143-68.4% 216-150-69.4? 234-159-67.9?\nYou will notice that the percentage of stations belonging to the Association\nhas declined. Put another way:\nSince January 1, I960, the number of educational FM stations has increased\n32.2$, while the number of FM stations belonging to the NAEB has increased\nonly 23.3%.\nDuring the same period the number of ETV stations has climbed 73.3%, while\nthe number of members has increased only 70.3%. And, even more graphically,\nduring the past two years (since April 1, 1961), while the number of ETV\nstations increased 39.3%, our membership increased only 26%.\nSince it is impossible for the staff to do much nevangelistic” work in the\nfield, it is hoped that the members of the Board will increase their efforts\nto bring into membership those non-members in their respective Regions.\nThe non-member ETV stations are listed on the attached analysis, and I am\nalso enclosing a list of non-member radio stations for your use.\nThe number of AM stations has remained static for several years, with the\nexception of W1NAD, University of Oklahoma, which \"went commercial\" about\na year ago. You will notice, furthermore, that most of the non-member AM\nstations are owned and operated by churches or church-connected groups.\nHEH:atb"
}