{
  "id": "d1666-0",
  "text": "June, 1955 I\nTHE PRESIDENT'S PAGE\nDear NAEBer:\nAnother day, another dollar. Oh, yeah. That's just Donley Feddersen’s song now;\nnot mine. Anyway, if you didn't hear Don in Columbus, or in Chicago, you'll want\nto read his book. And, if you did, you'll want to read it, too.\nThat's not a commercial. I'm just getting started. Don's on our 1955 Convention\nCommittee. And, A1 Partridge is chairman. A1 says things are coming right along.\nMore dope someplace else in this issue. I’ll mention a couple of other items in\nconnection with the convention.\nGeorge Jennings is in charge of the exhibits at the Del Prado. You'll want to\nsave time for viewing the exhibits and if you have a good idea for an exhibitor,\ndrop George a line.\nBully for ol’ Region V. Region V members are coming early for regional meeting on\nTuesday afternoon and evening before the national convention. ' Meeting has been\nset for the Fiesta Room, Del Prado Hotel. This latest dope from Regional Director\nMarguerite Fleming*. ... . .\nI understand that some other regions are considering making same or similar move.\nRemember, if you care to use Wednesday noon for that purpose, the only \"free\" lunch¬\neon or dinner period is that of Wednesday noon.\nUnderstand Chairman Jim Mies is arranging for meeting of his NAEB Public Relations\nPlanning Committee for late June, just prior to ACPRA convention at Drake Hotel\nin Chicago. NAEBer Stew Howe is chairman of arrangements for the ACPRA meeting.\nLynn Poole, Joe Wright, Dick Rider, Colby Lewis, and others of NAEB circles are\nslated for program performances. NAEB will have an exhibit there, too.\nThe President is grateful to the many NAEBers who responded to the invitation in\nlast month’s letter — the invitation to comment on needed constitutional and by¬\nlaws revisions. You'll hear more from us later, after others get their comments\nin. So far, so good. All helpful.\nEarlier mentioned some committee work. Better tell you that we've changed name of\nBill Harley’s committee to TV Program Committee. Have asked Bob Schenkkan if he’d\nlike to change name of his TV committee. Never a dull moment.\nIn keeping with agreement at Region II meeting in Atlanta, we’ve sent Earl Wynn\na suggested form of agreement for NAEBer member stations to secure from program\nsources for purposes of broadcast on their own stations, or on a.combination of\nstations such as the NAEB Radio Network. We’ll include a copy either with this\nissue or the next. . .\nOne of NAEB’s good friends is going to be absent from the country for about a year.\nBob Van Duyn of the W. K. Kellogg Foundation, Associate Director of the Education\nDivision, left at the end of May to spend a year in the Phillipines. We’ll miss\nhim.\nThe University of Illinois is losing a long-time friend of NAEB, too. Wilbur\nSchramm is leaving Illinois to go to Stanford University. Wilbur will be taking\nup his new duties at Stanford in September. We hope he won't lose his interest in\nNAEB, and we'll always appreciate all he’s done for us in NAEB."
}