{
  "id": "d1320-0",
  "text": "BY- LAWS\nof the\nNATIONAL ASSOCIATION OF\nBROADCASTERS\n(as Amended August 12, 1947)\nArticle I\nNAME\nThe name of this Association shall be the\nNational Association of Broadcasters.\nArticle II\nOBJECT\nThe object of this Association shall be to foster\nand promote the development of the art of broad¬\ncasting; to protect its members in every lawful\nand proper manner from injustices and unjust ex¬\nactions; to do all things necessary and proper to\nencourage and promote customs and practices\nwhich will strengthen and maintain the broad¬\ncasting industry to the end that it may best serve\nthe public.\nArticle III\nMEMBERSHIP\nSection 1. CLASSES OF MEMBERSHIP.\nThe members of this Association shall consist of\ntwo classes, active and associate.\nA. ACTIVE DEFINITION. Any individ¬\nual, firm or corporation which is engaged in the\noperation of a broadcasting station or which\nholds a construction permit for such a station\nwithin the United States or its dependencies\nshall, subject to the approval of the Board of\nDirectors as hereinafter provided, be eligible to\nactive membership in the Association to the ex¬\ntent of one membership for each station which it\noperates; provided, where an individual, firm or\ncorporation operates two or more stations he or it\nshall be ineligible for membership for the lesser\nstation or stations with respect to dues classifica¬\ntion, as hereafter provided, unless the larger\nstation or stations with respect to dues classifica¬\ntion is in membership.\nWhenever active membership is in the name of\na firm or corporation, such firm or corporation\nshall certify to the Secretary-Treasurer of the\nAssociation the name of an owner, partner, an\nofficer, or an executive whose time is devoted prin¬\ncipally to the broadcasting business of such firm\nor corporation and such individual may represent,\nvote and act for the member.\nEach active member shall be entitled to one\nvote for each active membership and shall be en¬\ntitled to participate in all affairs of the Asso¬\nciation.\nB. ASSOCIATE DEFINITION. Any individ¬\nual, firm or corporation engaged in any business\nor profession connected with broadcasting but\nnot such as to come within the requirements for\nactive membership shall, subject to the approval\nof the Board of Directors, be eligible to associate\nmembership in the Association. An associate\nmember shall not be entitled to any vote except\nas a member of a committee to which he has been\nduly appointed.\nSection 2. DURATION. Membership in the\nAssociation shall be effective from the date of the\napplication, subject to approval by the Board of\nDirectors. Membership shall continue in full\nforce and effect until notice in writing of resigna¬\ntion has been received and accepted.\nProvided, however, that any member who for\na period of three months has failed to pay the\ndues incident to his membership for which proper\nbilling has been made by the Secretary-Treasurer,\nshall be dropped from membership. For good\nand sufficient cause the Secretary-Treasurer may\nextend the period of delinquency for one addi¬\ntional month.\nSection 3. LOSS OF MEMBERSHIP. Any\nmember may be suspended for any act which, in\nthe judgment of the Board of Directors, consti¬\ntutes a willful violation or breach of any of the\nterms of the charter or By-laws of this Association"
}