{
  "id": "d1320-3",
  "text": "trict a list of the names of all persons nominated\nfor District Director in that district. At the meet¬\ning hereinbefore provided for, the names of all\npersons nominated by petition shall be announced\nand posted. Additional nominations may be made\nfrom the floor. A majority vote of the members\nin attendance at the meeting shall be required to\nelect a District Director. If no nominee shall re¬\nceive a majority of the votes cast on the first\nballot, a second ballot shall be taken on the two\nnominees receiving the highest number of votes\non said first ballot. In event of a tie vote, addi¬\ntional ballots shall be taken to break the tie unless\nsettled by other means by consent of the nominees.\nB. DIRECTORS-AT-LARGE. There shall be\nten Directors-at-Large, two from large stations,\ntwo from medium stations, two from small sta¬\ntions and one each from FM stations in Class B,\nFM stations in Class A, television stations and\nfacsimile stations, provided, that the director-\nships-at-large from these classifications shall be\nfilled when there are at least twenty-five active\nmembers in such classifications respectively. ^\nAs used hereinafter the term “large stations”\nshall be deemed to include all standard broadcast\nstations in Class 1-A and Class 1-B and in Class 2\nabove 5,000 watts power. The term “medium\nstations” shall be deemed to include standard\nbroadcast stations in Class 2 above 250 watts\npower and up to and including 5,000 watts power\nand all standard broadcast stations in Class 3-A\nand 3-B. The term “small stations” shall be\ndeemed to include all standard broadcast stations\nin Class 2 of 250 watts power and all standard\nbroadcast stations in Class 4.\nExcept during 1947, at which time Directors-\nat-Large shall be nominated and elected at the\n1947 NAB convention, Directors-at-Large shall\nbe nominated and elected in accordance with\nthe following procedure: Ninety days prior to\nthe date set by the Board of Directors for the\nannual membership meeting the Secretary-Treas¬\nurer shall cause to be mailed to the accredited\nrepresentative of each active member in good\nstanding a nominating form, together with a\ncertified list of all persons eligible to be nomi¬\nnated as Directors-at-Large in the classification\nor classifications to which such member belongs.\nWith respect to Directors-at-Large for large,\nmedium and small stations, each representative\nshall be entitled to write in the space desig¬\nnated on said form the names of two persons in\nhis classification from among the names appear¬\ning on the certified list. With respect to nomina¬\ntions for Directors-at-Large for FM Class B, FM\nClass A, television and facsimile stations respec¬\ntively, each such representative shall be entitled\nto write in the space designated on said form the\nname of one person in his classification from\namong the names appearing on the certified list.\nThe representative shall sign his name to the\nnominating form and return it to the firm of cer¬\ntified public accountants designated by the Board\nof Directors within fifteen days from the date of\nthe original mailing of such form. Such returned\nforms shall be canvassed and the names of all\npersons receiving five or more nominations in any\nclassification shall be deemed nominated and\nshall be certified for inclusion on the final ballot;\nprovided, that no person shall stand for election\nin more than one classification and if nominated\nin more than one classification, the firm of certi¬\nfied public accountants shall notify him of that\nfact and he shall within five days elect the nomi¬\nnation he will accept and give written notice of\nsuch election to the firm of certified public ac¬\ncountants; provided further, that in event less\nthan four persons are nominated in each of.the\nclassifications of large, medium and small stations\nand two persons in each of the classifications of\nFM Class B, FM Class A, television and facsim¬\nile stations, the District Director members of\nthe Board of Directors shall constitute a nominat¬\ning committee for the purpose of making such\nadditional nominations by mail in such classifica¬\ntion or classifications so that there shall be at least\nfour nominations in each of the large, medium and\nsmall Directors-at-Large classifications, and two\nnominees in each of the FM Class B, FM Class A,\ntelevision and facsimile Directors-at-Large clas¬\nsifications.\nWithin ten days after nominations in all classifi¬\ncations have been completed, the firm of certified\npublic accountants designated by the Board shall\nmail to the accredited representative of each ac¬\ntive member in good standing, in each classifica¬\ntion, a ballot containing the names of the nomi¬\nnees in his classification. All ballots shall be re¬\nturnable to the firm of certified public accountants\ndesignated by the Board of Directors within\nfifteen days from the date of their original mail¬\ning. Such returned ballots shall be canvassed\nand the results of election certified to the Secre¬\ntary-Treasurer by the firm of certified public ac¬\ncountants hereinbefore mentioned.\nSection 3. TERM OF OFFICE. All Directors-\nat-Large shall assume office at the first meeting\nof the Board of Directors following the annual"
}