{
  "id": "d1320-5",
  "text": "Article X\nSection 4. BOND. Any person entrusted with\nthe handling of funds or property of the Associa¬\ntion shall furnish at the expense of the Association\na fidelity bond approved by the Board in such sum\nas the Board shall prescribe.\nArticle VIII\nDISTRICT AND STATE DIVISIONS\nSection 1. BOARD SHALL ENCOURAGE.\nThe Board of Directors shall encourage the or¬\nganization of State Associations.\nArticle IX\nMISCELLANEOUS\nSection 1. The term “broadcasting” as used\nherein is defined as the free dissemination to and\nreception by the general public, by means of elec¬\ntro-magnetic waves, of intelligence and entertain¬\nment appealing either to the aural or visual senses,\nor both.\nSection 2. By application for or acceptance of\nmembership in the Association every member\nshall be deemed to have waived and does thereby\nwaive for himself or itself, his, or its successors\nor assigns, in case of his or its loss or suspension\nof membership for any reason from the Associa¬\ntion as hereinbefore provided, all further rights\nand privileges of membership of any nature what¬\nsoever and all claims, if any, of every nature and\ndescription to any fees, dues or charges paid to\nthe Association and to any and all claims for dam¬\nages for or because of such suspension.\nOFFICES\nSection!. CORPORATE OFFICE. The prin¬\ncipal corporate office of the Association, as re¬\nquired by law, shall be located at 7 West Tenth\nStreet, in the City of Wilmington, County of\nNew Castle, in the State of Delaware, or at such\nother place or places as the Board of Directors\nshall from time to time designate, in accordance\nwith the provisions of law.\nSection 2. EXECUTIVE OFFICE. The Ex¬\necutive Office of the Association shall be located\nin the City of Washington, District of Columbia.\nThe Association may have such other offices as\nthe Board of Directors may determine from time\nto time.\nArticle XI\nSEAL\nSection 1. The Association shall have a seal of\nsuch design as the Board of Directors may adopt.\nArticle XII\nAMENDMENTS\nSection 1. The By-Laws of the National As¬\nsociation of Broadcasters may be amended, re¬\npealed or altered in whole or in part by a major¬\nity referendum vote submitted by the Board of\nDirectors to the qualified voting membership in\nsuch manner as the Board may prescribe; pro¬\nvided, upon petition signed by not less than five\n(5) per centum of the active membership of the\nAssociation proposing amendment of the By-\nLaws filed with the Secretary-Treasurer at least\nthirty (30) days prior to any meeting of the\nBoard of Directors, the Board shall at such meet¬\ning provide for the submission of such proposals\nin accordance with the provisions of this Section."
}