{
  "id": "d1260-1",
  "text": "To be eligible, a script must be submitted in duplicate,\naccompanied by a release form, typed, double-spaced, and\nbound in regulation theme folder. There are no specific re¬\nstrictions as to subject; scripts should meet the standards of\ngood taste of the broadcasting industry and the production\ncapabilities of WQED.\nFor further information and competition release forms,\nwrite immediately to: WQED TV Playwrights’ Contest, 4337\nFifth Avenue, Pittsburgh 13, Pennsylvania.\n• The EMC Corporation, St. Paul, periodically needs the\nservices of gifted free-lance audio and audiovisual script¬\nwriters who are experienced in the specific field of educa¬\ntion. At the present time, they are particularly interested in\nwriters who have had some experience in educational program¬\ning in the social science, language arts, and literature fields.\nThe company develops and produces supplementary teach¬\ning aids (discs, tapes, filmstrips) for a variety of subject\nareas from the elementary to the college level. Reimbursement\nfor free-lance writing is either on a fee or royalty basis, de¬\npending upon the nature of the project and the budget avail¬\nable.\nInterested writers should send resumes of experience in\neducational broadcasting—preferably with sample scripts and/or\ntape recordings illustrating their work—to Northrop Dawson,\nJr., Vice President - Executive Producer, EMC Corpora¬\ntion/Educational Materials Division, 180 East 6th Street, St.\nPaul, Minnesota 55101.\nAlthough it is not a determining factor, Mr. Dawson\nwrites that they would be particularly interested in hearing\nfrom past award-winners at the IERT.\nObituaries\n• John P. McGoldrick, a veteran of 41 years of service in the\nbroadcasting field, died November 8 in Scranton, Pa At the\ntime of his death, he was chief engineer for WUSV-FM, Uni¬\nversity of Scranton, and for WPTS, Pittston. Joseph A.\nRisse, of the International Correspondence Schools, Scranton,\nis filling in as chief engineer at WUSV.\n• Rev. Florencio V. Tamesis, S.J., 39, production coordinator\nof the Center for ETV, Manila, Philippines, died of a heart\nattack November 16, 1964. He was lecturer at the Ateneo de\nManila Graduate School and traveled extensively observing the\nmajor ETV installations in the U. S.\nNew NAEB Institutional Members\nRADIO DIVISION AND NETWORK\nMontana State University, Station KUFM (FM), Missoula.\nINSTRUCTIONAL DIVISION\nCentral Michigan University, Mount Pleasant; Roanoke City\nSchools, Virginia.\nEDUCATIONAL ASSOCIATE\nFlorida Institute for Continuing University Studies, Gaines¬\nville.\nINDIVIDUAL MEMBERS\nDuring the past two months, 96 new Individual Members have\njoined the NAEB.\nHelp Needed on FM Bibliography\nFred L. Christen, graduate researcher at Syracuse University,\nis working on an annotated bibliography of all research on\nFM radio, commercial and noncommercial. He is seeking in¬\nformation on all previous FM studies, and says that he is\n“interested in any and all research bearing on FM radio—local\nor regional, recent or antiquated, commercial or noncommer¬\ncial.”\nAnyone knowing of anything along this line can help by\nwriting him at the Television and Radio Center, Syracuse\nUniversity, Syracuse, New York 13210.\nHelp Needed in English Study\nPatrick Hazard has begun a U. S. Office of Education survey\non the use of newer media in teaching English. He would like\nto hear from persons who have been involved in such experi¬\nments—kindergarten through high school.\nThe purpose of the survey is to identify outstanding ex¬\nperiments in order to publish their news to all English teach¬\ners. The most promising one may be filmed in order to get\nthe new ideas circulating as quickly as possible.\nHazard is interested in any such experiments which will\nhave conclusive evidence as late as May 1965. Write to him\nat Beaver College, Glenside, Pennsylvania.\nNews Notes\nPERSONNEL\n^ Irving R. Merrill, director of TV research at the San\nFrancisco Medical Center, University of California, recently\nspent two weeks visiting England and Scotland, where he\nserved as consultant at a meeting of the TV research com¬\nmittee of the British Association for the Study of Medical\nEducation. His schedule also included addresses before the\nRoyal College of Physicians and Surgeons, Glasgow, the TV\ncommittee of the medical faculty of the University of New¬\ncastle upon Tyne, and the Kent Post-graduate Medical Center\nat Canterbury. He says he was “impressed at the lively inter¬\nest in television as a means of medical instruction for both\nundergraduates and practicing physicians.”\n^ Colby Lewis, professor of TV and radio and coordinator\nof CCTV at Michigan State University, has been named man¬\nager of TV broadcasting. He has been serving as acting man¬\nager since July. His new assignment involves administrative\nresponsibility for WMSB, and he will retain his present aca¬\ndemic responsibilities.\n^ Michael J. Ziegler has joined the staff of WTVI, Char¬\nlotte, North Carolina, as producer-director, coming to them\nfrom Penn State. Other new WTVI staffers are Sam Grainger,\nchief artist and animator, who left Sam Grainger Productions;\nDon Polley, chief engineer, formerly chief engineer at WVEC-\nTV, Norfolk; and Wayne Shope, staff engineer, from the\nRaethon Corporation and WCYB, Bristol, Tennessee.\n^ Lee Marks, chief engineer at WTVI, has resigned to re¬\nturn to KTCA, St. Paul-Minneapolis.\ny Last month the University of Texas Drama Department\nperformed the Robert Schenkkan and Kai Jurgensen trans¬\nlation of Ibsen’s “The Lady from the Sea.” The two had done\nthe translation 15 years ago to free, as they saw it, the au¬\nthor’s poetic and folk overtones from the bonds of Victorian\nprose imposed by earlier translators. Jurgensen did the literal\ntranslations; Schenkkan set it in its proper English equivalent.\n^ Gerald F. McVey has been appointed manager of the Uni¬\nversity of Wisconsin Multimedia Instructional Laboratory\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Editorial assistant: Skip Robinson.\nPhone 333-0580. Area Code 217.\nReporters:\nRegion I —Shirley Ford, WRVR, 490 Riverside Drive, New York\nCity, 10027.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}