{
  "id": "d1260-2",
  "text": "visitor wants and try to give it to him. An educa¬\ntor and a Hi-Fi fan will be interested in different\n^ things.\n2) Help the visitor understand something about\nyour over-all goals. Don’t just open the door for\nhim to look at gimmicks and gadgets; tell him\nwhat you are trying to accomplish.\n3) Never hurry a visitor. Invite questions and make\nsure you provide the answers.\n4) Recognize the visitor’s major interest, try to give\nhim something appropriate to take when he\nleaves: a program schedule, brochure, dial card,\nteachers manual, or even the annual report.\n5) Recognize the opportunity of pictures and press\nreleases when you have a distinguished visitor, or\na group-tour.\n6) Make it a point to mention your NAEB affilia¬\ntion. This helps all of us.\nHow do you attract visitors in the first place?\nSome inevitably appear out of nowhere. Others re¬\nquire invitations. Try a spot announcement some¬\ntime. Keep in touch with the program chairmen of\ncampus and civic groups, Faculty Wives club, PTA,\nhistorical society, etc.\nSome of you have had good results with visita-\ntions. Send us a couple of paragraphs telling how you\nwent about it, and we’ll let others share your exper¬\nience through this column.\nrN\nPLACEMENT SUPPLEMENT\nFebruary I — Male, single, 39, M.A., 2 years radio experi¬\nence and 4 years as teacher, desires position in ETV\ndirection or programming. Interested in joining a new\nand growing station or school system for development\nof programs. Licensed teacher. Location open. $4,500.\nFebruary 2 — Male, 29, single M.S. experience as chief of\noperations of commercial VHF station, is seeking a re¬\nsponsible position in ETV. Background includes teach¬\ning and educational radio-TV. Interested in use of TV\nin schools. Location open. $7,000.\nFebruary 3 — Radio program and 16mm motion picture pro¬\nducer seeks opportunity to put 13 years experience to\nwork for educational broadcasting. Background com¬\nprises all phases of radio announcing and program\nproduction, managing of educational FM station, in¬\nstruction of students and production of sound-color\ncampus motion pictures. Male, single, 36, A.B.\nLocation open. $5,200.\nFebruary 4 — Quality writer, international background, cre¬\native, imaginative, strong on ideas, outstanding credits\ninclude stage plays, major Hollywood studios, 80\ndocumentary film and radio scripts for U. S. Army, Air\nForce, U. S. Information Agency, Voice of America\nand industrial film companies, seeks challenging posi¬\ntion in educational TV as writer, but also additional\nduties as assistant to producer, program director etc.\nLocation open, $8,400 minimum.\nNAEB SEEKS SAFEGUARDS\nIN FCC BOOSTER PLANS\nThe NAEB, through its attorney Leonard H. Marks\nof Cohn and Marks, has filed comments with the\nFCC in response to a recent Commission proposal\nto sanction nationwide VHF booster station opera¬\ntion. The comments call attention to the potential\ndanger of a licensed booster system to the effective¬\nness of ETV stations because of possible interference,\nparticularly to those stations which are not yet using\nmaximum power.\nThe NAEB’s interest in the matter is “to insure\nthat the Commission takes no action which would\nhave the effect of inhibiting the future growth and\nexpansion of educational television services to the\nAmerican public.”\nCopies of the comments are, presently available\nat NAEB Headquarters.\nNEWS OF MEMBERS\nGENERAL\n► WBOE, the Cleveland (Ohio) Board of Education\nstation, has announced that it will carry the non¬\ncommercial programs of Cleveland radio station\nWERE-FM.\nThe event came about with the silencing of\nWERE-FM’s signal so that the station could double\nits voice to 40,000 watts, making it one of the most\npowerful stations in the country.\nCooperative efforts between officials of both sta¬\ntions have brought about a vertical program pattern\naired over WBOE for approximately 30 days, the\ntime it will take WERE-FM to engineer its power\nincrease.\nTargeted for a three-hour period each evening\nfrom approximately 7 until 10 p. m., the pre¬\nsentations originate in the studios of WERE-FM and\nare fed by line to the facilities of WBOE.\n\\ To aid the many Eastern Massachusetts school\nsystems which are planning the installation of TV\nreceivers and antennas for in-school programs,\nWGBH-TV, Channel 2, will telecast its test pattern\neach weekday from 10 to 5:30 p. m. during the entire\nmonth of February.\nHome viewers can take advantage of this op¬\nportunity to have their home receivers adjusted\nfor the best reception of the channel.\n\\ One hundred and seventy-seven New York Uni¬\nversity students who just completed a course in com-\nFEBRUARY, 1958\n3"
}