{
  "id": "d1260-7",
  "text": "were presented in color as well as a specimen of\nblack and white recording. Tape dropouts were in\nevidence on both the monochrome and color record¬\nings and were especially noticeable in the color re¬\ncordings since they produced white noise flashes.\nThe RCA system is similar to Ampex in that tape\nwidth, tape speed and the tape itself are the same.\nRCA uses a revolving head mechanism holding four\nheads, although head rotational speed differs slightly\nfrom the 1440 rpm used by Ampex. At present tapes\nare not interchangeable between machines, however\nthis feature will be available on production models.\nRCA and Ampex are discussing mutual standards so\nthat eventually universal interchangeability will be\npossible. RCA equipment is entirely rack mounted\nwhile Ampex uses a console-mounted transport mech¬\nanism with part of the equipment rack mounted. The\nRCA equipment also incorporates an erase head while\nAmpex tapes must be bulk erased. RCA has an addi¬\ntional independent audio cue channel so that special\noperative instructions can be recorded along with\npicture information.\nA price of $63,000 has been announced for the\nRCA color recorder and $49,500 for monochrome\nequipment. Production models are expected to be\navailable toward the end of 1958 with seven proto¬\ntype models to be built and put in service prior to the\nproduction run. Monochrome equipment contained\nin five racks, can be converted to color by the addi¬\ntion of one rack of color processing equipment. The\nequipment requires 6 kw of 60 cycle single-phase\npower for operation.\n*****\nAmpex, too, is making an accessory kit to con¬\nvert its monochrome video tape recorder to color. It\nconsists of an additional rack of equipment costing\n$29,000 for the prototype units. The first of these\nhas been promised for June delivery to WGN-TV,\nChicago. A substantial reduction in price is expected\nonce this equipment is on a production basis.\n*****\nDamage estimated at $75,000 was caused by a fire\nJan. 9 in Swain Hall, which housed the studios of\nWUNC-TV and WUNC-FM in Chapel Hill, N. C. It\nis believed that the fire was the work of an arsonist\nas seven fires occurred on the campus that day. Spun\nglass used in the sound treatment of the studio area\nprevented the fire from spreading, thus saving the\nbuilding from complete destruction.\nThe radio area suffered only smoke and water\ndamage. It is expected that the radio studio will be\nready for occupancy before Feb. 1. Much video\nequipment was saved. TV programming was moved\ntemporarily to the Raleigh studios. However, on\nJan. 20 some programming was resumed from Chapel\nHill by using the remote bus as a studio. It is ex¬\npected that it will take at least six weeks before the\ndamaged studios and offices are ready for occupancy.\n*****\nGeneral Electric has announced that 50 TV sta¬\ntions are now equipped with “1-0 guards” the wobbu-\nlating device designed to improve the useful service\nobtained from image orthicon camera tubes. Among\nthe ETV stations which are using this equipment are\nWTTW, Chicago; and WBIQ, Birmingham, Ala.\n*****\nDid you know . . .\n. . . that the Lincoln Division of the Ford Motor Co.\nhas made a FM tuner available as optional equipment\nin its 1958 Lincoln and Continental automobiles?\nThe tuner is manufactured by Bendix Radio and\nfeeds audio through the AM set since volume and\ntone controls operate either receiver.\n. . . that as of Jan. 1 there were 537 commercial and\n140 non-commercial FM stations operating? This is a\ngain of 7 commercial and 15 non-commercial stations\nover the past year.\n. . . that both radio and television signals have been\ntransmitted over long distances by bouncing them\noff meteor trails?\n*****\nThree meetings of interest to engineers in the\nradio and television broadcasting industry which will\nbe held during March and April are listed below for\nyour information:\nMarch 24-27 Institute of Radio Engineers, Na¬\ntional Convention and Radio Engineering Show, New\nYork City, Waldorf-Astoria Hotel and New York\nColiseum.\nApril 21-26 Society of Motion Picture and Tele¬\nvision Engineers, 83rd Semi-Annual Convention, Los\nAngeles, Calif., Ambassador Hotel.\nApril 28-May 1 NAB 12th Annual Broadcasting\nEngineering Conference, Los Angeles, Calif. Statler\nHotel, concurrent with 36th Annual NAB Convention\nat the Ambassador Hotel.\n*****\nPlanning a radio station? RCA has available a\nbrochure, including floor plans, equipment require¬\nments and current trends. The material contained in\nthis brochure has been appearing serially in RCA\nBroadcast News beginning with the October, 1957\nissue. The brochure contains the complete series and\nmay be obtained by writing RCA, Broadcast and\nTelevision Equipment Departments, Camden 2, N. J.\nNEWSLETTER"
}