{
  "id": "d530-0",
  "text": "EXHIBIT 3\ncopy copy\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1U Gregory Hall\nUrbana, Illinois\nTO:\nHr. William Wood, Director, Station WQED-TV, Pittsburgh, Pa.\nMr. Robert F. Schenkkan, Director of TV, Station WUNC-TV, Chapel Hill,N.C.\nDr. Armand Hunter,Station WKAR-TV,Michigan State College,East Lansing,Mich.\nMr. Richard Goggin, General Manager, Station KETC-TV, St. Louis, Mo.\nMr. H. B. McCarty, Station WKA-TV, University of Wisconsin, Madison, Wis.\nMr. William Sener, Station KTHE-TV, Los Angeles, California\nMr. John Schwarzwalder,Station KUHT-TV, University of Houston,Houston,Tex.\nMr. Jim Day, General Manager, Station KQED-TV, San Francisco, California\nDr. Garnet Garrison,Director of Television,University of Michigan, Ann\nArbor\nDr. Harry Newbum, President, Educational TV and Radio Center, Ann Arbor\nFROM: Harry J. Skornia, NAEB\nDATE: June 12, 195U\nRE: TV Program (American Council for Better Broadcasts) proposal\nFollowing the IERT Conference in Columbus in April, this organization held its\nfirst annual meeting, one of the sessions for which I moderated.\nAt that time they proposed making an all-out effort to encourage and help de¬\nvelop truly educational and high-level programs for children in the one hour\nfrom 5 to 6 p.m. and to do the same for programs for family listening for the\nhour from 7 to 8 p.m., for a truly alternative service, by educational tele¬\nvision stations, to the general offerings available on commercial TV, in the\nhope that this influence might also eventually affect the latter*s offerings\nas well.\nAt that time, I told Miss Leslie Spence, their President, that I would call\nthis to the attention of all NAEB educational TV members, since this is entirely\nin line with NAEB objectives of influencing the improvement of all programs,\nwhether on TV or radio, in the U.S. I believe knowledge of such interest and\npotential support will be of interest to you, as NAEB members, and to the Edu¬\ncational TV and Radio Center, which would be centrally placed in any such ef¬\nfort. This should in no sense be interpreted as an anti-commercial television\nstep, as I believe is obvious.\nI have suggested to Dr. Spence that she send each of you directly a copy of the\nresolution concerned. When you*ve had a chance to look it over, how do you feel\nabout it, and the possibility of carrying it out?"
}