{
  "id": "d530-118",
  "text": "HAEB Engineering Service\n14 Gregory Hall\nUrbana, Illinois\nTo 1 Board\nFrom: Skornia\nDatet September 2, 1954\nHerewith copy of recent note from Cecil Bidlack. For another ex¬\ncellent statement from him, of his work so fary see September Newsletter.\nCOPY COPY\n\"Having observed the duplicator operation and maintenance situation\nfor the past two toontha, I feel that I should take over their maintenance\nfrom WILL* Obviously, when I am away they will have to take care of emer¬\ngencies, however, I feel that if one person takes care of the machines,\nit will be much better than to have constantly changing maintenance per¬\nsonnel* I can also give them a daily check since I am on hand and this\nwill also help to prevent troubles. I feel too, that I will have more of\na personal interest in their operation and that by close attention to them\nat regular intervals, the overall operation will be improved.\n•Since August 1, vacations at WILL have almost necessitated my taking\nover their maintenance. McGee has been at Allerton most of the time, and\nmy personal feeling is that Colaw tolerates them as a necessary evil. If\nw® could break McGee loose from his WILL duties for a few hours, he and I\ncould move all the recording heads back to their normal positions, make a\nfrequency and distortion run and I’d be off to a fresh start.\n’ton August 19 and 20, I came back in the evenings and gave both machines\na good cleaning which they needed badly. I checked all tubes on the latter\ndate. I also cleaned up the floor around the machines which was covered\nwith pieces of adhesive tape used to stick the ends of the tape down. There\nwere also cigarette butts on the floor with the above litter and on the day\nfollowing my cleanup. Use of ash trays has since been recommended to per¬\nsonnel.\n*1 talked to Mr. Toogood in Chicago for & few minutes on August 11,\nand he stressed the importance of cleanliness for proper operation of\nthe machines. If at some future date the duplicating setup is moved, the\nduplicators should be placed in a room separate from the room where tapes\nare wrapped, packed and unpacked. I believe that we should have plastic\ncovers mad® for the machines, and they should be covered at night or when\nthe room is being swept. We should also have buildings and grounds keep\nthe window wells clean so that dust is not blown in from this source."
}