{
  "id": "d530-128",
  "text": "2.\nDuring the middle 1940's modest efforts were made by NAEB leadership to\nbegin to hold conferences with some of the oustanding educational planners in\nthe nation. The NAEB's confidence in its mission and task was strengthened by\nseveral factors: l) its success and leadership in rallying support to secure\nspecific allocations in the FM broadcast spectrum for educational use exclusively;\n2) the friendliness and understanding with which its proposals and thoughts\nwere met in the FCG as then constituted; and 3) the apparent favor with which\ncertain foundations looked upon its plans and proposals.\nIn the late 1940's funds were secured for the first of what was to be a\nseries of three Allerton House Conferences, at which broadcasters, subject-\nmatter specialists, and social scientists particularly, met together for two-\nweek periods, long enough to begin to hammer out communications blueprints for\nthe future. Out of these meetings came a dream...but also broad outlines for\nwhat, it now became obvious, would require considerably greater resources than\nthe NAEB had at its disposal, plus a permanent staff and office. Committees\nbegan to draw up plans which could be presented as requests for foundation\nsupport for the long-term problem. In succeeding months and years these plans\nwere drafted and redrafted many times by many NAEB members.\nMeanwhile, however, the work of the Association had to go on. One of the\ntasks which the members wished to undertake without undue delay was the starting\nof an exchange of programs which might be considered a sort of experimental\n(educational) mutual network operation. In 1950 this project was started.\nTapes of We Human Beings. programs from the Lowell Institute in Boston, were\ndistributed from WNYC in New York at first. These programs were \"bicycled\" from\nstation to station. There were few resources except a box of postage stamps and\na stack of tapes (both gifts), and a great deal of good will and enthusiasm. The\nnumber of programs which could be thus exchanged was small. Loss and damage were\nhigh. The nerves and tempers of both senders and recipients or intended\nrecipients were frequently frayed."
}