{
  "id": "d530-130",
  "text": "4.\nvisualized self-support by the end of the fifth year. Too rapid a rate of dues\nincrease ran the risk of forcing many to drop out of the Network, or even out of\nthe Association, because of inability to secure even the extremely modest sums\ninvolved. Original plans and ambitions have had to be tempered with a recogni¬\ntion of realities. Success is now believed assured, and will undoubtedly be\nrealized in this effort, but considerably more slowly than many had hoped, and\nwith a considerably larger number of strictly financially-caused mortalities\nthan was expected.\nThe cost of the struggle for channels for education in television (in which\nthe NAEB took a leading part, a former NAEB President becoming the Executive\nDirector of a new organization, the Joint Committee on Educational Television\n(JCET), which rallied educational forces and organized the campaign which ended\nin success) and of the services needed by prospective and actual educational TV\nstations, out of all proportion to their number, has also proved far higher than\nanticipated. A larger share of the NAEB budget than was anticipated or ear¬\nmarked has had to be budgeted for television if educational television was to\nbecome a reality, and if the NAEB was to remain the central association of both\nTV and radio for education. Many special projects, most of them made possible\nby FAE grants, have also been necessary, and will continue to be needed.\nFortunately much of the material needed has been able to be produced by NAEB\ncommittees. For out of the membership-based structure of the NAEB has emerged\none of its greatest strengths: much of the work of this Association is actually\nand economically done by committees, as many of the NAEBfs finest and most use¬\nful publications will reveal. If these various studies had had to be commercially\ncontracted for, the cost would have been many millions more. And funds of this\norder were not available.\nOne of the most critical situations to develop during the last year, and\nbriefly alluded to above, was the strong possibility that a splinter organiza-"
}