{
  "id": "d530-131",
  "text": "5\ntion for educational television only would be formed. This possibility no longer\nseems likely. But the toll in time and patience has been great. In recent\nmeetings of the NAEB President and Executive Director with the Joint Committee\non Educational Television (JCET), the National Citizens Committee for Educational\nTelevision (NCCET), the Educational Television and Radio Center (ETRC), and the\nAmerican Council on Education (ACE) Television Committee, during the past few\nweeks and months, under the chairmanship of Dr. Arthur Adams of the American\nCouncil, we have been gratified to find our unique position firmly established\nand the NAEB recognized as the permanent and central association in educational\nwireless communications. For it would be a great tragedy if modestly financed\nand under-staffed stations were expected to support a multiplicity of organiza¬\ntions, all alleging to be their indispensable protectors and sponsors. All but\none of the educational television stations on the air in the United States are\nNAEB members. And an increasing proportion of NAEB officers are television\ndirectors or television station managers.\nIt is now increasingly apparent that the NAEB is here to stay, with no need\nfor it to affiliate or compromise with other groups in any way which will\nsignificantly impair its independence and freedom of action. It is now recog¬\nnized as a leader instead of a follower, and the NAEB Board meetings scheduled\nduring the next year with America's leading school superintendents, college and\nuniversity presidents, and other leaders will insure that its course will\nincreasingly be educationally responsible and carefully considered.\nThrough the aid granted by the FAE and other foundations, educational\nbroadcasting has strengthened its position in the United States. \"Delivery\nfacilities\" for educational materials have been greatly improved in radio and\ncarefully planned and started in television. This strengthening and improvement\nhave come mainly from the broader scope of activity and wider sphere of influence\nwhich FAE and other grants have made it possible for the NAEB to exert."
}