{
  "id": "d530-132",
  "text": "6.\nSince 1950 the NAEB Network, so tentatively launched, has become world-\nrenowned, Present plans for at least one commercial network, NBC, call for\ncareful consideration of converting from an interconnected one to a tape net¬\nwork for radio. This would put the NAEB at least three years ahead of commercial\nradio. Steady programs of workshops, seminars and scholarships have helped\nseveral hundreds of present and future educational radio and TV staff members\nto secure more adequate training and inspiration. NAEB scholarship certificates\nnow hold a place of honor on the walls of the offices of many fine educators.\nThe first real headquarters for educational broadcasting in the world is con¬\nducting itself with dignity and honor, making American educational broadcasters\nthe best informed broadcasters in the world. A ^University of the Air'1 (in\nwhich the NAEB provides the American representation) has been created in Europe,\nwhereby programs are exchanged among themselves and with the NAEB by the 21-\nnation members.\nOne reason for the greatly increased productivity of NAEB committees and the\nNAEB Board as suggested by its growing energy and activities is that, thanks to\nFoundation assistance,they have been able to meet and carry on their business on\na face-to-face basis. Regional meetings of members have also been possible, to\ndevelop educational radio and television locally. The first NAEB regional meet¬\ning in the history of educational broadcasting was held in Norman, Oklahoma,\nMarch 28-30, 1952. Since then such meetings have also been held in North\nCarolina, Michigan, and Oregon, with plans for two additional ones during the\nnext year in the Eastern States, and at Ames, Iowa. During 1952-53, the NAEB\nsponsored a seminar for Public School Broadcasters, and in 1953-54 a Seminar for\nWriters of In-School Programs.\nDuring the last three years, the NAEB also has increased liaison with broad¬\ncasting systems of foreign countries and with other educational organizations in"
}