{
  "id": "d530-133",
  "text": "7.\nthe United States. It also has administered three series of Grants-in-Aid, with\nfunds provided by the FAE, which have produced broadcast series, both radio and\ntelevision, which have further enhanced the prestige of educational broadcasting,\nthe Network and the NAEB in general. (For details concerning the Grants-in-Aid\nand other FAE-sonsored projects mentioned briefly in this summary, see later\nsections of this report.)\nThrough a series of seminars, workshops and scholarships, made possible by\ngrants from the FAE, the NAEB has carried on a continuing program for the train¬\ning and upgrading of personnel in educational broadcasting. Two educational\ntelevision production workshops have been held, one in 1953, and one just com¬\npleted. Last year (summer 1953) the NAEB also held an Educational Television\nSeminar (Lincoln Lodge) and an Educational Television Station Management Seminar.\nIn October of this year an NAEB Television Engineering Workshop is being held in\nthe New York area. During the summer of 1954 scholarships of $150.00 each were\ngranted to 20 persons to allow them to attend television workshops and/or\nregular university and college summer sessions where they might take advanced\nand generally intensive work in television courses.\nDuring 1953-54,particularly, in line with the international interests, con¬\ntacts and background of the new Executive Director, the NAEB established publica¬\ntion exchanges with foreign broadcasting systems and other educational organiza¬\ntions which spread the name and respect of the NAEB around the world. 1953-54\nalso saw the establishment, at NAEB Headquarters, of a central Educational Tele¬\nvision and Radio Placement Service for the United States, a Station Management\nConsultation Service, and a new full-time TV Engineering Service. All these\nservices are made possible by grants from the FAE. The NAEB also coordinated\nthe selection and European missions of the American Fulbright scholars in radio\nand television, and began basic discussions with other government agencies to\nserve as the coordinating center for all such exchange-of-persons activities in\nwireless communications fields."
}