{
  "id": "d530-134",
  "text": "8.\nAs this is written, the U. S. Information Agency's pans to distribute nearly\n2,000 copies of the FAE-NAEB Jeffersonian. Heritage scripts as published in book\nform by Beacon Press are completed. The demand for albums of this series, plus\nWays of Mankind and People Under Communism, both in the U.S. and abroad, is\nincreasing. Thanks to the efforts of our Fulbright Scholar to France, Radio¬\ndiffusion Francaise during the last year has translated and broadcast four of the\nJeffersonian Heritage programs. Teachers’ manuals for Ways of Mankind are now\nin process of discussion with interested educators both in the U.S. and abroad.\nNAEB relations with such other organizations as UNESCO and the UN are also\nbecoming increasingly close. At present it is hoped that joint NAEB-UNESCO\nprojects now under discussion in the areas of basic research on radio and tele¬\nvision as cultural media, and on their uses for workers* education, may materi¬\nalize within the next twelve months.\nMeanwhile the membership of the NAEB has increased to 243 members. During\n1953-54 four Engineering Committee reports, six Television Operation Committee\nreports, and the first of a series of Research Committee Reports, were published.\nIn addition to the reports mentioned above, the results of these and other\ncommittee meetings were a revised constitution, more programs auditioned by the\nIn-School Program and the Network Acceptance Committees, increased exchange of\nforeign programs through the International Relations Committee, over 30,000 lines\nof publicity in newspapers and trade magazines, and the processing of nearly 300\napplications for the 120 NAEB Scholarships, Fellowships, and Television Workshops,\nmade possible by FAE grants, which were handled during the 12-month period from\nOctober 1953 to October 1954.\nMuch has been done. But much still remains to do. The NAEB’s efforts to\nserve its membership and the cause of education, providing wise and broad leader¬\nship and essential services to educational broadcasting throughout the world."
}