{
  "id": "d530-138",
  "text": "12\nwhich our materials are greatly sought after. And it is believed that in NAEB\nmembers and Newsletter readers in general there is developing a new interest\nin foreign programs and news of foreign countries and communications problems.\nThis expansion of international aspects has been carried out without neglect\nof local responsibilities. The largest problem, from this point of view, is\nstill to secure significant news of NAEB activities from its scattered and busy\nmembers. This will require more time than the present staff has available to\nsolve adequately although progress is gradually being achieved.\nDuring the last few months several new features (reviews of books of in¬\nterest to NAEB member representatives; regular personnel and placement news;\nand news on joint projects of the NAEB with other groups—such as the ETRC,\nNPAC (National Project for Agricultural Communications), and American Council\nfor Better Broadcasts do suggest gradual, though slow, improvement in the func¬\ntions and offerings of the NAEB Newsletter, with proportional increase in its\ndistribution which now numbers slightly over 1*00 copies per month. (Attached\nas Exhibit 3 is a recent communication on a TV program proposal, which will\nillustrate the NAEB * s overall efforts to provide all possible help in raising\nthe level of program offerings.)\nBeyond Newsletter contacts, the efforts of the Headquarters staff always\nto give courteous replies to all inquiries has resulted in a greatly increased\nload of mail from students, clubs, and other groups which we feel to be of\ngreat importance in the American System, and to the future of educational\ntelevision and radio. To handle many of these inquiries, and those from the\nmany directories and other national organizations calling upon us for informa¬\ntion, advice and help, we devised inexpensive, simple and succinct historical\nstatements about the NAEB (See Exhibit 4). As soon as the NAEB Constitution\nrevision is complete (it is now being voted on by the membership) it is our\nhope to secure funds for the publication of NAEB brochures to tell the story"
}