{
  "id": "d530-139",
  "text": "13,\nof educational broadcasting, the NAEB, the NAEB Radio Network, and the role of\nthe foundations in this movement. Meanwhile, we attempt to provide the most\ncomplete data available, and to encourage efforts, many of which are now in\ngraduate-student research stages, to produce an adequate history of this area\nto deserve publication,\nC, NAEB Representation\nDuring the past year the NAEB was invited to provide representation as\nthe Association of educational broadcasters at a considerable number of func¬\ntions, both abroad and in the U,S. In most cases, in view of the NAEB*s\nlimited travel budget, this had to be done by the NAEB representative nearest\nto the scene, or at the expense of individuals or organizations other than\nthe NAEB,\nFollowing the trip abroad of three NAEB representatives to attend the\nEducational Broadcasting Convention and to establish various NAEB contacts\nin Europe in 1952, and representation at the International University of the\nAir Convention in Paris, in April of 1953, Mr, Seymour Siegel, chairman of the\nNAEB International Relations committee was able again, principally at his own\nexpense, to represent the NAEB at Italian and other conferences last summer.\nWhile there he also served as a judge for the world-famous Prix Italia, which\nprovides world-wide awards for original and quality programming, and helped\nestablish contacts and working relationships for Fulbright Scholars in England,\nFrance, and Italy, Following the audition of two NAEB entries (including Ways\nof Mankind) experimentally, for the first time, at the 1953 Prix Italia Confer¬\nence, a new (educational program) classification was established. As the year\nends, the NAEB is again participating, both as judge and entrant.\nOur general representative to the Prix Italia this year is Graham Hovey,\nour Fulbright Scholar, who has been reappointed for a second year. His Letter\nFrom Italy is a weekly NAEB Network feature. The NAEB - U.S. Judge, for the"
}