{
  "id": "d530-141",
  "text": "15\nthe television committees and conferences of such organizations as DAVI, NPAC,\nthe Adult Education Association, The American Association for Better Broadcasts,\nthe Council of National Organizations, the American Association of School Ad¬\nministrators, the Film Council of America, etc. As the year eneded part of\nthis Headquarters representational travel load was taken over by the Associate\nDirector, who represented the NAEB at the recent Toledo CNO Television Workshop,\nFilm Council Planning Committee Conferences, and others.\nOne of the strengths of the NAEB is revealed in the fact that probably no\norganization has had the amount of representation both in America and abroad\nthat the NAEB has had, for the financial outlay incurred. The entire cost to\nthe NAEB, for all the above, was less than three thousand dollars for the year,\nwhich reveals the advantages of the strategic locations of NAEB members, and\nthe values of having, as NAEB representatives, various people who are members\nalso of other professional organizations and societies.\nThese representational contacts (and many important examples have been\nomitted), together with the exchanges of publications, persons, ideas and pro¬\ngrams, and the constant, inspired work of the International Relations Committee,\nillustrate what we believe are very substantial prestige gains by the NAEB dur¬\ning the last year. As this was being written, we have taken time out to dis¬\ncuss, with an Exchange of Persons representative of the State Department, what\nwe hope will be even more significant gains during the next year as the NAEB * s\nrole in the planning of exchange programs, and the selection of specialists\nand scholars for such programs, is recognized and implemented,\nD. Membership\nAt the present time (September, 195k) the NAEB has 2l;3 members, an increase\nof approximately 20 per cent over one year ago when the membership totaled 202.\nThis increased participation and interest in the activities of the NAEB speaks"
}