{
  "id": "d530-144",
  "text": "18.\nThe acquisition of a second mass duplicator during this past year has made\npossible a considerable improvement in both quality and economy of operations.\nIt is now possible to begin to shift emphasis from the mass service to a more\nindividual service type of operation. The various stations, of course, find\nthis arrangement much more satisfactory, with the result that Headquarters-\nstation relations have greatly improved*\nThe Network Manager has had five meetings of the Network Acceptance Com¬\nmittee, the In*-School Program Committee, and the In-School Program Sub-Com¬\nmittee. These meetings have resulted in refinement of program selection pro¬\ncedures and a revision of methods of program offerings and distribution.\nAll in all the NAEB Network is providing an essential service to the edu¬\ncational broadcasting stations of America, and an organization with which Euro¬\npean stations can exchange ideas, publications, personnel, techniques, and pro¬\ngrams. Without foundation support this Network service, which 80 per cent of*\nall member stations list as the most essential of all services which the\nNAEB provides them, would never have materialized or become a model for instal¬\nlations in many other parts of the civilized world. (Exhibits 6 and 7. give\nan indication of the expanded activities of the Network).\nF. Committee Activities\nCommittees of the NAEB continued to be increasingly active during the past\nyear. In this section complete reports are not possible, and some omissions\nwill undoubtedly occur. This section is, however, intended to be generally\nindicative of committee work in the NAEB.\nAll of the committees held meetings at the annual convention last October\nat Norman, Oklahoma. Most of them met again at Columbus, Ohio in April, and\ncarried on committee business throughout the year by correspondence. In addi¬\ntion, several of the committees (Engineering, Network Acceptance, In-School) were\nable to have additional meetings during the year as needed for special problems."
}