{
  "id": "d530-148",
  "text": "22,\n5. INTERNATIONAL RELATIONS COMMITTEE: This committee has arranged this\nyear, as in the previous year, for outstanding programs from other countries to\nbe made available to the NAEB Network. A total of 12 series, constituting\n3,547 hours and 30 minutes of Network progran time were provided. Some of the\nseries which have been provided the NAEB include the Comedie Francaise. modern\nFrench plays, dramatic programs about great French poets, writers, and composers,\nmusical programs covering contemporary French music, the French music festivals,\nItalian music, and the Prix Italia first award opera. Outward Bound kith Columbus.\nThe work of this committee has undoubtedly done a great deal to bring to\nlisteners to these programs a better understanding of the language and culture\nof other countries.\nOur ,findebtedness” to other countries program-wise, is, however, becoming\na source of some self-consciousness to the NAEB. The NAEB has been able to\nreciprocate with far fewer programs than have been received. The Wavs of Man¬\nkind has been broadcast by the Canadian Broadcasting Corporation. A few programs\nof The Jeffersonian Heritage have been broadcast by the British Broadcasting\nCorporation. The entire series has been translated into French and four programs\nhave been broadcast over Radiodiffusion-Television Francaise. This contribution,\nhowever, is a small item as compared to what we have received. It is hoped that\nfunds and procedures for correcting this may be found in the near future.\nFurther reference to the activities of the NAEB in international relations\nwill be found under the headings: NAEB Representation and Newsletter and Pub¬\nlications Exchange, earlier in this report.\n6. MEMBERSHIP AND CREDENTIALS COMMITTEE: This committee has processed\nmany membership applications from various individuals and educational institu¬\ntions over the country. Since June, 1953, there has been an increase of 41 in\nmembership. Fourteen new active members, 17 new associates, and 10 new"
}