{
  "id": "d530-149",
  "text": "23,\naffiliates were approved. Several candidates were turned down for inability to\nqualify fully. However, as the year ended it became apparent that procedures\nfor still closer scrutiny of potential applicants, and improved statements of\nstandards, will be necessary. It is hoped these also will be ready for a vote\nat the fall convention, in connection with the constitutional revisions.\n7. ORGANIZATIONAL LIAISON COMMITTEES This committee, which, under the\nchairmanship of NAEB Director Allen Miller, consists of (usually non-NAEB)\nrepresentatives of various national educational and communication organizations,\nas an informal advisory group, met April 9 in Columbus, Ohio, for a luncheon\nmeeting with the Chairman, the NAEB President, and the NAEB Executive Director.\nA further meeting is called for the October Convention as the NAEB takes the\nleadership in calling all these groups together for a discussion of the problems\nof educational broadcasting and organizational functions in order, as far as\npossible, to eliminate duplication in the field, and to insure maximum possible\ncoordination of educational effort. The NAEB is also cooperating with the ACE\nTelevision Committee in the planning of a MPenn State Two Years After” Conference\nto be held this fall or winter. After basic discussion among all concerned, it\nwas concluded that the American Council on Education, under the leadership of\nDr. Arthur Adams, was the best possible organization to undertake this project,\nhaving also handled the first such conference.\nAmong the groups represented on the NAEB Liaison Committee are the national\ncommercial networks, the Joint Committee on Educational Television (JCET), the\nSpeech Association of America (SAA), the American Council on Education (ACE),\nthe American Educational Theatre Association (AETA), the Educational Television\nand Radio Center (ETRC), the National Citizens Committee for Educational Tele¬\nvision (NCCET), the Council of National Organizations (CNO), the Adult Education\nAssociation(AEA), the National Association for Better Radio and Television\n(NAFBRAT), the Department of Audio-Visual Instruction (DAVI), the U. S. Office"
}