{
  "id": "d530-152",
  "text": "26.\nwest particularly. A survey has been made to determine the potential population\ncoverage of NAEB member stations (See Exhibit 19). An Interviewer Manual\n(Research Committee Report #1; Exhibit 20) was recently distributed to all\nmembers. The committee is currently engaged in an inventory of the \"manpower\"\nconsultant resources of educational broadcasting, the impact of the NAEB Network,\nand other significant projects beyond the coordination of the policy behind such\nstudies as the Television Monitoring Studies. It is hoped that the results of\nthe first of these studies will enable the NAEB to provide members with a list\nof experts in the various fields of broadcasting whom they can call upon for\nadvice and consultation as needed, at less cost than most consultation services\ninvolve. This will be on a regional basis, so that the best expert in each\nfield :will be readily available for consultation without a great deal of\ntravel and expense being involved. The need for a study of the NAEB Radio Net¬\nwork’s program and cultural impact over the past three years, also in progress,\nis equally essential. There is some likelihood that a cooperative project with\nUNESCO may grow out of this study.\n14. TELEVISION OPERATIONS COMMITTEE: This committee conducted a series\nof six studies into educational television organizations and activities on\nthe part of member institutions. These studies were combined into a report\n(attached as Exhibit 21) which was distributed to all groups planning educa¬\ntional television stations. This report has been rather heavily borrowed\nfrom by other organizations, as a tribute to its excellence and usefulness.\n15. IN-SCHOOL SEMINAR AND WORKSHOP AND SCHOLARSHIP PLANNING COMMITTEES:\nThese two committees have recently screened applicants, respectively, for the\nNAEB In-School Writers’ Seminar and applicants for the NAEB Summer Session\nScholarships and the NAEB Second Television Production Workshop. Applicants\nfor the NAEB Television Engineers’ Workshop in New York have been screened"
}