{
  "id": "d530-157",
  "text": "31.\nrepresentatives of the Radio Corporation of America in Camden, New Jersey ;\nGeneral Precision Laboratory, Incorporated in Pleasantville, New York; the\nAllen B. DuMont Laboratories, Incorporated in Clifton, New Jersey; the National\nBroadcasting Company and the Columbia Broadcasting System in New York City.\nThese companies are cooperating fully in the program of the workshop which\nwill give those attending the latest technical information on the theory,\noperation, and maintenance of television equipment, as well as providing\nthe opportunity to meet and work with fellow engineers in educational tele¬\nvision. This exchange of ideas, and the discussion of individual problems\nencountered with their solutions, should be a very valuable part of the work¬\nshop program. The workshop will overlap the NAEB Convention by one day and\npermit workshop students to meet Officers and Directors of NAEB as well\nas giving them the opportunity, seldom offered, to attend the Convention\nat small cost to themselves or the institution they represent. Vie have had\nmany comments to the effect ’’that it is about time something was being done\nfor the engineers.”\nThe program of the workshop has been included in Exhibit 24 of this\nreport, together with a list of the successful candidates selected by the\nNAEB Engineering Committee.\nWhile on this trip east, Mr. Bidlack visited WGBH and the upcoming\nWBGH-TV in Boston. He went over studio plans in detail with Hartford\nGunn, Jr., Assistant Manager for Operations, who reports that a number of\nMr. Bidlack’s suggestions were passed on to the architects for WGBH-TV.\nOn the return trip he made a stopover in Pittsburgh to observe the operation\nof WQED, see their facilities and give whatever advice was requested.\nOn August 11, the NAEB-TV Engineer met with Mr. Carl Menzer, Chairman\nof the NAEB Engineering Committee, at Iowa City to make final selections of\napplicants for the TV Engineering Workshop. On the following day, Mr. Bidlack"
}