{
  "id": "d530-158",
  "text": "32.\naccompanied Mr. Menzer, at his request, to a meeting of a sub-committee of the\nIowa Joint Committee for Educational Television which was working out a\n\"minimum package\" for educational television in Iowa. On this trip he inspected\nthe facilities of WSUI; the State University of Iowa closed circuit television\nstudio at Iowa City; WOI-TV and WOI at Ames, Iowa; and the facilities of WHA-TV\nand WHA in Madison, Wisconsin. On August 27, Mr. Bidlack appeared on the pro¬\ngram of the NAEB Production Workshop at East Lansing. His topic was \"What the\nEducational Producer Should Know About Television Engineering\". He also visited\nWKAR-TV and WKAR in East Lansing, and VCET in Cincinnati to observe operation\nand see their facilities, and stopped in Columbus for a conference with R. C.\nHiggy regarding WOSU-TV facilities. WOSU-TV has requested Bidlack's services\nfor staff training when it is ready to go on the air late this fall.\nRequests for information on film scanning equipment from the University of\nAlabama, and for data on studio switching systems from WKAR-TV at Michigan\nState College have been received and information supplied. However, since con¬\nsiderable time is required to build up engineering reference material of this\nnature, better handling of such requests will be possible as time goes on.\nIn addition to his duties as NAEB Television Engineer, Mr. Bidlack has taken\nover supervision of the technical problems of the NAEB Tape Network. It is\nbelieved that a small amount of time spent in supervision of the operation and\nmaintenance of the Multitape Duplicators, will be highly effective in keeping\nthe technical standards of the tape network on a high plane.\nThe above will give some idea of the scope of the Engineering Service to\ndate. Data is being compiled on technical facilities of existing educational\ntelevision stations as the NAEB Television Engineer visits the operating\nstations and observes their operation. A tentative form for this data is\nincluded as Exhibit25 • These visits also give Mr. Bidlack ideas and suggestions"
}