{
  "id": "d530-164",
  "text": "38.\nC. Management Consultant Service\nThe NAEB has for some years had legal counsel in Washington, so far unpaid,\nbecause of a shortage of funds, although a modest fee is to be paid them this\nyear by action of the Board of Directors. It now has a Management Consultant\nwhose services are available without charge to member stations.\nDuring the past year, when questions regarding union, clearance and other\nmanagement problems began to come in to our various organizations, discussions\nwere held to determine who might best handle this service. The responsibility\nhaving been determined to be within the general framework of association-type\nfunctions, of the sort generally performed by the NAEB, the FAE generously made\na grant for this purpose. Mr. M. S. Novik, well-known New York Radio-Television\nConsultant, with close and friendly contacts with most unions, to many of whom\nhe has served as Consultant, was secured for this purpose. Herewith, the\nreport of the operation of this service, which is available without charge to\nnew and prospective educational stations, the ETRC, JCET, and NCCET, as well as\nto NAEB member stations. (This pattern applies equally to the Placement and\nEngineering Services, above.)\nGENERAL STATEMENT;\nAs became obvious in sometimes heated discussions with various television\nstation and Television Department directors concerned, this area is extremely\nsensitive. Many operations, particularly in certain areas of the South, have\nno union problems, and were fearful that the NAEB's concern, and the securing\nof Mr. Novik’s services, might cause various unions to move into an area which\nthey had heretofore not concerned themselves with. The long experience and skill\nof Mr. Novik seem now to have convinced most or all of them that this would not\noccur, and it definitely hdsn’t.\nHowever, on one point Mr. Novik at the outset pointed out what he thought\nwas unwise procedure in various areas where fund drives and community committees"
}