{
  "id": "d530-170",
  "text": "43.\nattend television workshops and/or regular university and college summer sessions\nwhere they might take advanced work in television courses. (The list of winners\nof these scholarships together with the announcement for these scholarships and\nthe two workshops described below, is attached as Exhibit 29.)\nAlthough the final reports of all scholars are not yet in, the list\n(in Exhibit 29) of those candidates approved (from the 24 applicants) for this\nstudy, together with the institutions they elected to attend, will indicate\nwide distribution. Asterisks indicate those from whom final reports are\nalready available. Of the $6,300.00 granted for this purpose, a total of\n$3,036.51* was expended. It is our hope, as will be taken up later in separate\nmemoranda, that this balance may be made available for carry-over to next year\nso that plans can be formulated and announcements issued in time to provide for\nbetter-organized handling than was this year possible. These delays were in\nno wise the fault of the FAE, whose promptness, counsel and understanding,\nparticularly in this project, are most gratefully acknowledged.\n5. SECOND NAEB EDUCATIONAL TELEVISION PRODUCTION WORKSHOP - Twenty-six\nmen and women responsible for the production and direction of educational tele¬\nvision programs attended this second production workshop, held August 23 to\nSeptember 10, 1954, at Michigan State College, and conducted by Mr. Bretz and\nProfessor Stasheff. The report of this workshop is in preparation and will be\nforwarded separately upon completion. (A workshop schedule and roster of\nparticipants is attached as Exhibit 30.) (The final financial report will not\nbe available until final bills are in.)\n6. NAEB EDUCATIONAL TELEVISION ENGINEERING WORKSHOP - This workshop is\nbeing held in the New York area, October 19-27, 1954. Twenty-six engineers from\nstations operating or planning educational television facilities will attend this\nworkshop, which will include tours of RCA, GPL, DuMont, NBC, and CBS plants and\nfacilities. (See Exhibit 24 earlier referred to.)'\n*0f the 20 scholars (§3,000.00) one returned.an unexpended $31.23. NAEB adminis¬\ntrative expenses so far have totalled only $67.74. wwxuxo"
}