{
  "id": "d530-174",
  "text": "47\nIV. CONCLUSION\nNo one who is not in close contact with the day-to-day activities of\nthe NAEB Headquarters and Network Office, where committee reports, requests\nfor information and advice, complaints and occasional words of praise\nconverge, can realize the variety, scope or significance of the operation\nwhich foundation aid largely has enabled the NAEB to launch on the American\nCommunications scene. Perhaps the principal problems are the multiplicity\nof daily deadlines which make interruptions sometimes extremely important,\ntogether with problems of inadequate space and staff, as judged by usual\nstandards. For the NAEB central office is a combination of an editing,\ndrafting, reporting and writing center, as well as of the operational type\nof service, with its hundreds of rush telegrams, emergency phone calls and\nother deadline crises of the type radio and television know so well. These\npressures make difficult the reflection, adequate reporting and liaison,\nand long-term planning which should be available.\nNevertheless, as the 1953-54 fiscal year ended, the functions of the\nNAEB began to become increasingly sharply defined. (See \"Policy Statement\nDraft,\" attached as Exhibit I4O and Comments of the NAEB on Policy Questions\nof Robert Calkins, Exhibit Ul.) This increased clarification was being gradual¬\nly achieved in the service areas referred to above. The NAEB is now in¬\ndisputably the recognized professional or \"trade\" association in educa¬\ntional radio and television. It is only in certain peripheral regions that\nthe situation is not yet clarified, and with the steps being taken month\nby month even these areas are becoming more clearly defined-as sharply\ndefined as the pressures of the times make possible, in any case.\nAlthough no one can predict with certainty (as retrospective consideration\nof early statements by some of the wisest minds available, outlining early\nrequests of the NAEB to the FAE and other Foundations so well illustrate)"
}