{
  "id": "d530-2",
  "text": "EXHIBIT 8\nCOPY\nNAEB HEADQUARTERS\n14 Gregory Hall\nUrbana, Illinois\nCOPY\nApril 19, 1954\nMr. Richard Bell, Chairman\nNAEB Associate Members Committee\n14 Matthews Library\nArizona State College\nTempe, Arizona\nDear Dick:\nFor many months I have heard from many Associate Members protests at not being\nable to share in the advantages of the Network. I have discussed and explained\nthis quite frequently, but wonder if something can’t still be done.\nThe principal reason why the Network doesn’t distribute to Associates, as you\nprobably know, is the matter of rights and other legal restrictions. Our various\nseries carry no music sheets, for example, because educational stations require\nnone. The thin staff at Headquarters must also limit itself to coordination of\n(Committee) selection, and to distribution. They can assume no responsibility\nfor rights and clearances. Their only recourse now, in case of a request for a\nseries, is to refer the requester to the originator, because both of these two\ncontain all the variables involved in the problem. That is the first difficulty.\nThe second is the matter of number of requests. If only three or four Associate\nMembers desired to receive NAEB Network programs, this would not justify opera¬\ntion of the 11-channel duplicator mechanism in Urbana. This same rule applies to\nNAEB Actives, of course. But this probably needs getting out of the talking and/\nor conjecture stage. If a substantial number of uses would be made, greatly in¬\ncreasing distribution throughout America of good educational programs, I would\nthink that this would be most desirable. And I would guess that if specific\nfacts and a proposed plan, showing a real need and a real possibility, were pre¬\nsented, the Directors and membership would be likely to consider favorably.\nIt seems to me that the offerings of the Network need study by your Committee, or\na sub-committee and/or a member of it, to see which programs, from the point of\nview of rights, music, union relations, etc. could go to commercial stations on\na sustaining basis. These could then be circularized to Associate Members to see\nhow many would take, if available, so a specific plan could be proposed. What\ndo you say?\nSincerely,\n* „ -\nExecutive Director\ncc: NAEB Officers\nAssociate Members Committee\nPaul Reed\nGale Adkins\nHJSrmbh"
}