{
  "id": "d530-29",
  "text": "1. SCHOLARSHIPS. Participants will be selected on the basis of educational radio\nand television and radio experience, education and experience in related arts,\nand on the basis of the contribution to educational television likely to result\nfrom attendance at a television workshop or summer session.\na. Selection of scholarship grantees will be made by the NAEB Workshop and\nTraining Committee. No more than 40 scholarships will be awarded.\nb. Grantees may attend the workshop or summer session of their choice from\nthose offered by the following institutions (which have been selected by\nthe NAEB Works hop and Training Committee from respondents to the March 12\nquestionnaire)s\nMichigan State College\nSyracuse University\nThe University of Houston\nThe University of Cincinnati\nGeorge Peabody College\nState University of Iowa\nCollege of the Pacific\nWashington State College\nIowa State College (WOI-TV)\nc. Grantees will be given a brief description of the workshops and courses\noffered by each of the above institutions, but will make all their own\narrangements for attendance at the institution of their choice. (To save\ntime candidates may do their own investigation of programs available.)\nd. Grantees will receive up to $150.00 as reimbursement of expenses to apply\ntoward tuition, travel, and/or other expenses.\n2. APPLICATIONS. Applications should be submitted in seven copies and should\nspecifically include the following items:\na. Institution Represented: Name, TV status, and TV activities.\nb. Applicant: Name, title, present responsibilities and qualifications, and\nlikely activities and duties for the next five years.\nc. Recommendation of Superior: Name, title, and signed letter of recommendation\nfor the applicant, including information as to why this applicant was\nselected over possible other candidates.\nd. The following statement, signed, and dated, by the applicant:\n”If granted a scholarship, I agree to attend a summer workshop or summer\nsession offered by one of the institutions listed in the May 25th announce¬\nment. I also understand that the NAEB*s contribution to the expenses involved\nshall not exceed $150.00. All expenses beyond this amount will be borne by\nme or my institution.”\ne. Name of institution at which applicant prefers to attend workshop or summer\nsession (if known)."
}