{
  "id": "d530-39",
  "text": "g&ch group began by outlining what it believed its frictions to fes© Th©\nJCEf* for example* listed its function® m\nlo Pro 15cting reservations\n20 Providing legal* engineering* md program assistance\n3o l&couraging program exchanges between schools and colleges\n4o Sotting*up conference® and providing consultant®\n5o Providing publications research\n6„ Securing the guidance of b®m fid© and reputable educators in the\neducational tel©vision aoves^&t\nIt is in connection with these various points that 1 Hade action- of Cohn\nmd Mark0 a surprise at discovering that the JCBT was duplicating M efforts at\nthe tim® of a recent ICC prcpossl t© charge licensing fesCo 1 also .made mm\nmention of duplicate efforts In the placement and other fields in recent months©\nIn each case the other organisation SaosasscoesssEX outlined its primary job©.\nThe HGGET to provide national publicity and assist in fund drives© The Ccnt;sr ^\nto serw* as a program development center, both in radio and television* although\nBr© Newborn indicated that* for to present* the radio distribution part was heiag\n-left with the MEB© On© sentence in th® definition of the role of’the Sasmittee\nm Television of th® American Council on Education, as giver;.. Sonic® Parker* was\nto th® effect that this committee serves as a channel frees the JG&t to the council\nastor organisations© to rol© of th® MM, as the Association of Broadcasters,\nwhose various functions Qraydon and 1 listed* was fairly wall understood* and\nsympathetically rm©±md0\nKo radical steps were taken or decisions made during this meeting© Th® most\npositive results were\nI© Following a proposal by Ray Witteoff* it was agreed tot none of to\norganisations prepent would engage in any national campaign© for funds*\nwith to ©-sceptic©, of to Genter- until furtor s? -lags wave hwid lv\ncoordinate effortaG\nlour representatives pointed oat that cur traditional approaches to\nfoundations gouM of sours© not be abandoned* but this seemed not to be to\nsort of nations! campaigns which the group generally referred to©\nTh© JCETf represented in this statement by Dave Henry* was to sol® strong\ndisstntsr© He pointed out that he could not agree to keep such a pledge* AM\nit funds had to be secured in order to keep th® JGET alive* he would nave tv\nshaws la the responsibility of a drive to seeare them. This led to scaio conjectures\nnot expraseed, ae to whether or not to FAB Bight b» dropping its support oi this\norsanikuoc, I rsresai that this was strictly conjecture and Is not to be con-\nsiderod aitor as a fact or a possibility to ba discussed aaoag ourselves.\n2 The seating ended with agreement tot all our organizations should\nMet with various feandation representatives by fall for l«a|=te»\nplenssina,, fit to aeeattaa* Kotert Calkins of to EPS'sKlngs Institutions\nidio has had a good deal of experience as a assabar of foundation boards\nand staffs* was asked to set forth a list of questions for dieesusssion\nwith tose foundations at th® prop®* tiae„ He are to add eaggesttos\nfor other questions and topic© .for discussiono A second meeting o-> th®.\nmm ©rgsnimtions (which m% Jus® 30) will ton b© h@M to discuss\nto ©a points asd( to ooordiimte an ©geMa for to noting later with\nfoundation representatives©"
}