{
  "id": "d530-41",
  "text": "Q^SfXOIS SUGGESTED AS BASIS FOE\nDISCUSSIHG WUCAT1QMAL ‘ZELBVISIOi? WITH\nFOtMEATIdf REFRE»m?mS\n1. What factually is the preset scope of Educatioml TV aM Radio broadcast¬\ning «*> list of stations, by whom operated, hours ©f operation, sis® of audience,\ngrowth ©f audience, how much ha® it cost, who has financed it?\n20 What ar© tho realistic prospect® of further development over the mxt\ntwo to five years — list of stations planned, with realistic estimates of their\nopening date®, hour® of operation* potential audienoo, local interest, ate*?\n3o What are the crucial problems for this year, the next, and thereafter?\n4o To what ©stent are studies and kinescope facilities urgent now? Where\nare such facilities strategically Important? What are the prospects of local or\nother financing?\n§o To what extent ar© good productions important sow? Why? How can they\nbe produced? Fuat would it cost? What are -the prospect® of financing these\nproductions? How can they be produced m m to develop interest,., esperlenoe, and\nstandards among educators? How can ideas for production h® stimulated?\n60 What is the long-run place of Educational TV and Bsdio? Is it to be m\noxtrs-currioular affair ©r a regular part of education? What conception is the\nenterprise working toward md striving to attain? Has it a conception of its\nplace is. education? Who in education accepts this ooneoption? How is the interest\nof educators to so elicited end held? What provision is being made for their\nparticipation, for their cooperation, for recognition of their-acfaiausaBBta in\nthis field? Or is Educational TV and Radio to be run by a group of young outcasts\nin the drates, degMurteo&t, aided by a f©w outcast professors seeking the limelight?\nMaiuisteativ® approml alone will sot win faculty approval and parbieipatlexio\nHow is the faculty to be brought into this work sad aroussd to be successful in\nit?\n7o What ©r® the soar future and longer^run future conceptions of Educational\nT¥ and Radio as a network blanketing the country? Am regional or national hook¬\nups feasible? Am* chains contemplated? How wasy stations in what cities are\ncontemplated?\nm., What c^g&uiaations are proaotiiig Educational TV and Radio? What do they\nd©? Who control© th®a? Who finances the®? Bow do they co-operate? What other\neducational organisations can help? Is an effort feeing made to ©licit their feolp?\n9. If the organisations want southing dom to foster their develops*!* over\nnest few years, what i© it? What plan does it have? What ^ouM it w What\npmrt© @m feo financed by local or other support? Recognising that foundation aid\nmet fee temporary for a Tew years at fessi,’whore could its aid fes of greatest h©lp?\n10. What ©r© the oemequenees of th© alternative of ptashing forward with such\na P*Qgra» nud the alternative of not asking this concerted effort? Ar© not slow\nprogress and m occasional shakedown a good thing for th© long-run fate© of\nBducaticsml TV ©sd Radio?\nMEB Headquarter©\nas received 7/l2/% fins' AGE\n^uesttas ter Robert Calkin®\n^(/j. 0j. _4^"
}