{
  "id": "d530-57",
  "text": "Mffo Graydon Ausmxs\n-a-\nJuly 22, 1954\nHe briefly sketched wsmt BBS, CBS, EBF„ IhseUe films on infant\ngrowth, Film Board of Canada',! and other contacti which promise kinescope material.\nXyl$ shoved us the data sent affiliate stations by the Center* This is\nconfidential because the critical evaluations are sometimes pretty frank .\nIt was revealed during the discussion that the HGGET and the XET have\noffered the ETRC space in their publications as needed • Since the ETRC is short\nof staff, the TOST will send one or sore of its staff members out to Ann Arbor\nonce or twice a month to get news, develop stories, and arrange for publication.\nThe HDGST will also assign someone to secure parfermsr \"s permissions to use some of\nthe present ETRC programs for promotional purposes. This use was discussed at\nsome lengtho\nIyie was to carry beck to the Center the request for kins® by Adler, Lee,\nBaxter, and others of the more successful educational programs to date. The 2€CET\noffered to pay to Overton any n^essary fees to secure the clearances mentioned\nabove. Finally the NOCET suggested, and the &TBG concurred, that the M3GET and\nXET be considered as members of the ETRC so that they would get the flve-in»a-»vmek\npackage, which the rather adequate staff of the XCET and ND1ET would view, and\nfrequently write reviews and summaries of. In fact, the XET is apparently starting\na program summary service, which overlaps rather closely with the statements already\nrent out by the Center.\nDuring the final part of the discussion, we learned that the XET sends\ncopies of aH clippings, etc. to the Center and' to NOGET.\n2o The H5GET. When called upon for a report, Director Mallen passed\nto Dresden, saying the role of the executive is not to burden his mind with\noperational matters, or with such details as publications•\nDresden explained that the NSGET has n mailing list of 31,000 persons\nfor ETV NEWS. They also have a “crest* list of 5,50© for newspapers. They ale©\nhave various other special lists for editorial writers, magaaine editors, etc.\nVarious Jb&oks and associations are frequently found for stories which\nrelate to BTVo For example, BBGET recently sent out a story on one of Spec's\nprograms on the care cf children in hot weather.\nAt this point in Dresden' s recital a discussion eme up of the impose!\"\nbility, which Nelson still canH get used to, of getting reactions to programs\nAnd other materials from stations. Being an expert in this matter, I also\nparticipated. We engaged in a discussion of the possible uses to which meaibers\nof the AEKT, the AA3B, NAFBRAT, Audio-Visual groups, and others might serve."
}