{
  "id": "d530-58",
  "text": "Mr. Graydon Ausrnus\nJuly 22, 19%\n+\nIt appears that everyone Is sm£i that evjssyons els© has mm tins thm h® has for\nsuch matters. Ralph promised to join e® la taking up with tho A® again tha\npossibilities of evaluating projects m I had earlier discussed with Gertrud®\nBroderick.\nReturning to tha TOM’ mailing lists, it was pointed out that those\nlists ay® developed and cheeked through field mm. Lists of preachers, and ©they\ntypes of ©pinion leader® are generally lists of people to whoa in NSQH?\nha® actually talked•\nSom upeeming publication by tho N8GKT were outlined. A f@un»panel Job,\nin its first printing, was passed around. A brochure for business non only is\nin the works. Over a thousand speak®jaMt* have been distributed. Their film,\nNSW VISION, has had over 150 showings so far. ?h® advisory oouaoil of the NGGET\nnow contains 103 organisations® Raymond kLttooff1[fs article in a mmnt issue,\nJuly 17, of the SATURDAY REVIEW (F LITERATURE was pointed out. It is an exsalient\nartiele. Beginning with the September issue, the K3GET NEWSLETTER is being con¬\nsiderably increased. Cm of the most important statements made was that the HGGHT\nkeep® helping stations (Ilk® KTHB) api@n they go on the air, whenever danger\narises. The statement of respoa&iMlityj of the XKT and the NDSET in this area\nwas put In these words by Ralph Steetl©si ^Tb© HSOM* and the XET aro as much\nconcerned with station pmW,®m as with problems before they are on the air.®\nThe USD situation ms briefly ^utliaed again. The USG ha© agsmed to l^®p\nETHB on the air for a year. JK3GBT station men arc in to Angeles to try to mis©\nthis into a eemrailty station. State law in Gaiifomla prevent® the sort of\ncontributions which St. tod® and PItisbfcgh, for example, have been able to um*\nThey seen to have $163,00©, or &&m m®h tebst figure as a result. During the\nlast year they see£: to h&v-u spent over $4PQPOOQ ©a operations alone. Their\npayroll had climbsd to over 1® people. This situation Is having to be radically\naltered*\nj\nHalloa pointed out that most of the station® m® still In crisis,\nand'consequently are being aurs©d by the NGGET. Pittsburgh, for exanpl®, is In\nseme difficulty. The TOET has a MI tin® mm there helping with tbs situation.\nJ. A©E=TVo Eunice Parker briefly outlined her problem® and responsi-\n-bilitiss. Then© aro 2,500 on the mailing list of the AGS: and 1,0©© on the\n©ailing list of the TV &m&|liteeo The is issued only on an irregular\nbasis. Host contacts are/t1 direct correspondence basis. Over half the people on\nthe AGE list® are faculty.\nThe AGE is undertaking the securing of funds for a proposed masting of\na PENN STATE TWO YEARS AFTER nature. This meeting wlH review the status of\nBTV and will involve most faculty people. It is hoped that this mating might\nbe held at a somber station institution."
}