{
  "id": "d530-59",
  "text": "Mr. Grayte Ausmus\nJuly 22, 1954\n-4-\n4® Th* JCET. Blanche Csippin outlined the mailing list and services of\nJSBT. Thom at® about 6,000 naag®$ on tfes mailing list fas* the ®Houndup of tbs\nNation9® Pros®,* for ©s»mpl®| both XET and WSSS have full time people demoted\nexclusively to mailing lists.\nBlanche distributed outlines showing their pulsations and nailing lists\nwhich wars gom over and explained in considerably ©ore detail than is required\nhere. Cto# interesting development was that the JGET ha® sot a pries of 44*00 per\nset on extra sets of material.\n5*\nI outlined the various functions of the NA1B. in the .\ncur rather modest mailing lists. Ms also ware able.\npublications area and explained cur rather modest mailing lists, ms also^vare foi*.\nto ocopste successfully ^cr the top honors for else of staff fosfr editorial p8fi©j worl\nI baliava ay submit of HAS* uvea of responsibility \\ka Mtejurt*.. I; bad previously\nsent ovweyon. rm®.s«nted eepies of our pubHoations,, together with a list of\n_everyone represented copies of our publications.\neverything m distributed with the mmhti&m* etc., so that there wodM be no\nquestion of it® area of operation®. I eaqpreesed the hppa {that promotion of ETV\nwould not necessarily always msmm that radio was a “dead* duck® as some M3&KT\narticles seemed to indicate. Xh reply to the proposal! of the MSQET that it\nhandle all new® release® for all organisations, I pointed out that the NAEB\ntraditionally handled it® own release® on publication® and operations. We\ntherefore would be an exception to this relationship.\n1 was invited by Bob to write a 1,000 word statement of th®linterrela~\ntiorships of the media, and the possibility of the survival of radio, for their\nSmUttcr. It was a rather shocking experience to fijad ssyself surrounded by\npeople who believed that radio was now just the tail cjr the snake, which has been\nmt off but ®wiH soon stop wiggling,® a® Bob Mullen so p^phicaBy put it.\nDeadlines for publication* were announced as, far as possible.\nFor the BOOST, the first and fifteenth of each month, backing up\nfive or six days for submission of material.\nFor the XET report®, the first of ©ash ssanth. fe*d*$d five day®\nin advance. Other materials throughout the month.\nThe N&fS material needed by the 25th of each month.\nIn the final discussion, no satisfactory solution was found to the\nproblem of who should-, exclusively handle the large volume of mail reaching\nparticularly the NAS^SIudents, persons doing theses, and other things of a\nscholarly nature, and other random inquiries about where to find or secure various\nkinds of material, where to go to school to get- good radio and television courses,\netc. Since no adequate solution to this could be found, the best we can do is for\neach organisation to provide each other with more carbon copies of its output."
}