{
  "id": "d530-81",
  "text": "-9-\nWhat is the long-run place of Educational W and Radio? Is it to bo\nan extra-ourrl oular affair or a regular part of education? What conception is the\nenterprise working toward and striding to attain? Has it a conception of its\nplace in education? Who in education accepts this conception? How is the inter¬\nest of educators to be elicited and held? What provision is being made for their\nparticipation, for their cooperation, for recognition of their achievements in\nthis field? Or is Educational. F? and Radio to be run by a group of young outcasts\nin the dream department, aided by a few outcast professors smoking-the limelight?\nAdministrative approval alone will not win faculty approval and participation.\nHow is the faculty to be brought into this work and aroused to b© successful in it?\nIn the long run picture of educational radio and television, it is hoped\nthat both will ba recognised as legitimate curricular as well as extra-curricular\nactivities so that BSfciEhgrgl financing will not have to be. continued indefinitely.\nJust as books have cone to be considered as legitimate direct curricular expenses,\nso should television and radio. They should and must be integrated into the corps\ncurriculum. Media should b© considered as legitimate as content in competition\nfor budgets. Radio and television can deliver inforsnatipn and understanding as\nsurely as books. Food for the mind and spirit and food for the body, regardless\nof their abundance, are equally useless unless delivered.\nThis conception has not been fully realised partly because many of the\npeople representing educational radio and television have been media people instead\nof educators, and partly because educators have been too busy with mor© traditional\nproblems to realise fully both the promise and the threat of the new media.\nThe continued efforts which we must all make must be directed at both\nlevels, and at erasing the line between. \\h need more broadly-educated media people,\nand more media-educated educators* subject-matter people, administrators, and\nteacher-trainers. Realizing this, the MSB1 a conventions are more and more bring¬\ning in college and university presidents and city and state superintendents And\nmore and more M4F«B members are participating in the conferences and programs of\nvarious subject-matter and professional Associations. Problems like reimbursement"
}