{
  "id": "d530-83",
  "text": "-n-\nvision stations on a time-table basis are impossible. JCET and 53CCET status\nreports should be our best indication in this area, since both the HCCET and JCEF\nare more predicting and planning in nature than the NAEB, ETRC or AOE-TV\nin\nCommittees,/which pEftggflfc problems are frequently overwhelming• However, it\nwould appear that wire, cable, or relay networks are not to be counted on at\nthis juncture, HBG is in fact now considering a tape network for radio, in an\neffort to reduce expense® to a more sound base for the more economical medium of\nradio and to insure a broader proportion of local programming for radio. In the\nview of these developments, and the avid interest with which commercial television\nalso is watching the development of television tana recording prospects (as a\npossible partial or whole replacement for both kinesooping and interconnected\nnetworks), to dissipate all-too-sc arcs funds on attempting to set up an inter¬\nconnected national network at any time, for education, would seem to b® an error\nin judgement, from the perspective of present developments, at least.\nWhat organisations are promoting Educational TV and Radio? What do\nthey do? Who controls them? Who financeo them? How do they co-operate? What\nother educational organizations can help? Is an effort being made to elicit their\nhelp?\nThe principal organizations concerned with educational television are\nnotably those represented at this meetingt the ACE s TV Committee, the ETRC, the\n<ICET, the MEBP and the 39CCET, to put them in alphabetical order. However, the\nAEHT, CHO, DAVI, and others would also reseat being forgotten, X9m sure, as would\nthe various Foundations and Funds which have contributed money and programs. Of\nthese the VOCES 9 JCET, and ETRC (so far) have been financed by the FAB; the waeb\nby its members, Kellogg, Rockefeller, the FAE, and various others. The sources\nof financing available to the AGE-TV Commltte are not known to this writer."
}