{
  "id": "d530-85",
  "text": "-13-\nth© need for sound economic bases; constituencies or members who be counted\non to carry part of the load and help weather the various crises which are bound\nto come; and which oan count for loyalty and support on listeners, without whom\nour entire operations are in a vacuum*\nIn some cases functions and services may well be improved and rendered\nmore economical by a basic reconsolidation. At least reexamination and consider¬\nation of the desirability and possibility of such a step must be undertaken\nperiodically if foundations are to be convinced of the broad sincerity and\nintegrity of all concerned and of the interest of all of us in the whole rather\nthan its parts, or any super-structure. The patient should be the primary concern.\nSince foundation support is not expected to prove to be practical on an eternal\nbasis, the number of doctors, and the extent of specialization of each, must\neventually be tailored to the ability bf the patients themselves to bear the load\neither alone or with a minimum of outside subsidy. The only alternative would seem\nfor some of us to come up with a plan for indefinite subsidy which oan really be\nfound to be practical. If this were possible, we would undoubtedly all agree that\nthere would be no need for such basic consolidation. More coordination would still\nbe necessary, however» if the station manager is not to bo forced to spend muoh\nof his time in answering correspondence and questionnaires from increasingly large\nstaffs in our organizations, instead of concentrating on the job at or\nshoring up frequently shaky bases of local and internal support.\nIn the long run. it would seem that a minim^m of organizations,\n(and certainly no one oan do the job) is essential. These organizations will\nassume as many as possible of those present and foreseeable functions which are\ndeemed essential. It is our belief that such a set-up with modest budgets and\nminimum staffs will be all that educational broadcasting oan realistically"
}