{
  "id": "d530-86",
  "text": "-14-\nsupport. Commercial broadcasters , with far larger resources, have come to this\nconclusion, and though this does not prove it right, it does indicate the over¬\nwhelming importance of the (frequently fiscal) realities of life.\n^agtig^JjO; What are the consequences of the alternative of pushing forward with\nsuch a program end the alternative of not making this concerted effort? Are not\nslow progress and an occasional shakedown a good thing for the long-run future of\nEducational TV and Radio?\nThe consequences of not pushing forward with all energy and with ade¬\nquate funds now are obvious. Educational television is not yet over the hump.\nWhether it will be in one year, or two years, it is difficult to say. I t.MnV\nwe can all be grateful that fairly adequate funds and adequate staff £re avail¬\nable to promote it aggressively now, and have been during the past three years.\nIt has been a belief of the KAEB, as expressed at the general session, that over¬\nextension of the organisation is extremely unwise, and that it is better to be\noverworked than to expand too broadly and risk falling from onefls own weight.\nIt also Is our belief that, like radio, educational television may not really be\na full reality for 10 or 20 years. Slow, steady progress is therefore more\ndesirable than hasty efforts, conducive to overextension. This progress must be\nand\nbased on sound research, genuine needs, and available economy,/on services which\ncan be provided to a clientele which exists. At no time should it be an objective\nof any organization to perpetuate or enlarge itself unless this is economical and\nthe functions could not better be done by existing or better placed groups. For\nthis may endanger the entire movement which we are set up to save and advanoe.\nService must be placed above self and organization. This may sound idealistic,\nbut it is also believed to be practical and essential.\nSpeaking only of and for the MSB, and subject to later review by the\nRAEB Board and membership, it is believed that this organization can continue a"
}