{
  "id": "d1916-12",
  "text": "- 13 -\n\"Since, as I stated in my dissent, it is my opinion that the public\ninterest will be served best by keeping channels open for- use-by as .\nmany varied educational groups as possible until a trend or.development\nin the educational television field can be observed, undoubtedly, for\nthe present, I will be expressing myself in the same vein .in connection\nwith other financially unqualified educational applicants. The MS\nLETTER will, I assume, have reason to again refer to my remarks. I\nwill appreciate'it if my position is made unequivocably clear to your\nreaders.-.\" • .. ... _ ... - ' .\nWISCONSIN- TV PLANS: • TV PROJECT DIRECTOR NAMED; SEMINAR HELD\nRaymond J. Stanley, a member of the Wisconsin faculty since 19^6 and production\nmanager of the University’s radio station, WHA, since 19^8, has been named project\ndirector of the University of Wisconsin Television Laboratory by the University\nradio-television committee. He will coordinate the operations of the UW’s closed-\ncircuit television operations, which will be located in the former Chemical Engineer¬\ning Building, near the WHA studios.\nDean John Guy Fowlkes of the UW School of Education, who will head a special tele¬\nvision research committee, recently named as members of the committee: Professors\nRichard C. Church, School of Music; Burton R. Fisher, sociology; Chester W. Harris,\nSchool of Education; M. Leslie Holt, chemistry; Bryant E. Kearl, agricultural Jour¬\nnalism; Lowell E. Noland, zoology; Robert L. Reynolds, history; William H. Sewell,\nrural sociology; Kurt F. Wendt, College of Engineering; and Dean William S.\nMiddleton of the Medical School.\nConsultants for the committee will be Professors Glenn Koehler, Cqllege of [Engineer¬\ning; Walter Wittich, Extension Division; Raymond J. Stanley, the project director;\nand Harold B. McCarty, director of WHA. i ■ •• r‘.\nStanley, who was prominent in radio work as a UW student, received his bachelor of\nscience degree in education at the University in 1939, and his UW master of philos¬\nophy degree in 19^0.\nHe taught at the University of Nebraska and at Michigan State, where he was program\nsupervisor for WKAR, before he entered the Navy for war service in 19^2.\nThe television research committee^.Dean Fowlkes said, was set up as a special group\nto help guide research into television. \"We will try to learn something.about the\neffectiveness of television presentations and techniques, and perhaps develop new\nmethods. It is our hope that we can throw some light on the educational values of\nthe medium,\" Dean Fowlkes said.\nSummer Seminar Held\nSeveral outstanding planners and producers in educational television were brought to\nthe Wisconsin campus last summer by the Television Committee Of the University Exten¬\nsion Division. The purpose was to provide guidance and stimulation for those con¬\ncerned about the possibilities of television as an extension tool of the University.\nThe series opened with two sessions conducted by Armand Hunter, director of tele¬\nvision research and television at Michigan State College. Speakers were: Barclay\nLeatham, Western Reserve University, Cleveland; John'Ross.Winnie,.State University of\nIowa; Garnet Garrison, Director of Television, University of Michigan; and,Colby\nLewis, Producer-Director, WTMJ, Milwaukee."
}