{
  "id": "d1916-15",
  "text": "Fund Appropriation Also Proper\n\"(3) It would seem to follow that if the operation of a television station is an\neducational function, the appropriation of public fluids for its operation would\nbe justifiable. Of course the legislature would still control the purse strings,\nand would have the ultimate power to determine the allocation of funds to it.\nThe vote of legislators on the. matter, no doubt, would be determined by its\nproved value to the people of the state. The objection by commercial stations tc\nthe expenditure of funds by the state for television is no more valid than an ob¬\njection by privately owned technical and engineering schools to state expendi¬\ntures for engineering shops and laboratories.\nCritics On Horns of Dilemma\nDo the people of the state want educational programs? On this point the\nrepresentatives of private business are on the horns of a dilemma. If they say\nthe people do not want educational programs, a University station would offer\nthem no competition in public appeal, and their objection on this score would\nhave to be withdrawn. If they say a University station will offer them competi¬\ntion then they must recognize that the people want educational programs. Now if\nprivately operated stations propose to sponsor educational programs then it is\nadmitted that telecasting is an enterprise, into which the University, as an edu¬\ncational institution, has a right to enter. If the people of the state want edu¬\ncational programs and are willing to pay the costs to enable the University to\nsupply them, why are they not entitled to them? It can hardly be contended at\nthis late date that education is not a matter of public concern or that it should\nnot be supported at public expense.\nTV Station Operation May Be Private or Public\n\"It is not denied that television Is a legitimate and desirable field in which\nprivate enterprise may operate, or that television advertisement is not a bene¬\nficial and an essential branch of that business. The contrary is true. Nor is\nit contended that the University should have exclusive telecasting rights in this\narea of the state. The contention is simply that the operation of a television\nstation comes within the proper sphere of education and that the University, in\norder to perform its educational responsibilities should be granted either full^\nor part time control over a television station. If all available practicable air\nchannels were awarded to commercial institutions then the vesting of substantial\ninterests in reliance thereon could forever block education from entering the\nfield. This might well have serious consequences. A monopoly in television by\nbusiness would be as harmful as monopoly in television by the state.\"\nNARTB REQUEST DENIED BY FCC IN SCHOOL BID\nThe request of the NARTB for reconsideration of the FCC’s grant of a television con¬\nstruction permit to Kansas State College of Agriculture and Applied Science,\nManhattan, Kansas, was denied recently by the Commission.\nThe NARTB had claimed the FCC’s July 23 grant had violated the Commission rules re¬\nquiring all TV applicants, without distinction between commercial and educational\napplicants, to be legally, technically and financially qualified as a condition to\ngrant without hearing.\nThe Commission rejected the NARTB claim that the grant actually affected an amendment\nof the rules and was, therefore, a rule-making matter. In such case, NARTB had con¬\ntended, the association and/or individual persons could be parties in interest.\nNARTB had explained, after polling Its board on the proposed protest, that the peti¬\ntion was not filed in opposition to the Kansas State College grant but to the manner\nof FCC handling."
}