{
  "id": "d1916-20",
  "text": "=====\n- 21 -\nc\nr\n.GENERAL HEWS OF • BROADGASTING\nRESEARCHER TABULATES RADIO COMMERCIAL VOCABULARY\nWriters of radio commercials have some standard ideas on the subject of words you\nlike to hear, according to a survey of 303 commercials made by David L. Thompson,\ngraduate student researcher in the University of Wisconsin School of Journalism.\nTile word most used is \"you.” It appears eight times a commercial on the average.\n\"Wonderful\" is next, a total of 167 times by the 303 commercials. Then come--in\norder—\"new,\" \"good,\" \"better,\" \"fine,\" \"best,\" \"effective,\" \"natural,\" \"big,\"\n\"fast,\" \"finest,\" \"great,\" \"efficient,/■’\"improved,\" \"nice,\" and \"favorite.\"\nBut the words that writers thought listeners Tike the best--just for the sound when\nthey are spoken^-are these: \"Pleasant,\",\"sparkling,\" \"beautiful,\" \"lovely,\"\n\"refreshing,\" \"perfect,\" \"delightful,\" \"loveliest,\" \"pleasure,-\" and \"pleasing.\"\nFor his study, Thompson picked only the most successful network commercials of 14\nadvertising agencies submitting the commercials for examination. Eighty-seven were\nfor food products, 94 for soaps and cleansers, 31 for smoking materials, and 91 for\ndrugs and toiletries.\nPurpose of Study\n\"The purpose of the study was to Team which of the words and phrases comprising the\nvocabulary of radio commercials have the greatest appeal,\" Thompson said.' \"Appeal\nwas determined by measuring the repetition -of words and phrases in the most effective\nand successful commercial continuity on the airwaves.\"\nNone of the words was used less than 10 times and most were used much oftener.\nThompson found that radio writers have an array of favorite words for use in specific\ninstances.'\nTo establish a congenial atmosphere the announcer addresses the radio audience with\n\"you,\" \"ladies,\" \"folks,\" or■\"families.\" The time for action is \"today,\" \"now,\"\n\"tomorrow,\" or \"daily.\"\nListeners are most often commanded to \"try,\"' \"remember,\" \"get,\" \"buy,\" \"enjoy,\"\n\"use,\" \"serve,\" \"take,\" and \"taste.\" The reasons for the commands are provided by\n\"words of factual reference\"—\"easy,\" \"American,\" \"doctors,\" \"tests,\" \"facts,\".....\n\"economical,\" \"world,\" \"guarantee,\" \"thrifty,\" and \"convenient.\" ;\nSuperlatives and Prestige\nOf the superlatives, none of the Hollywood favorites were even ringers, but writers\noften put \"quick,\" \"special,\" \"handy,\" \"speedy,\" \"amazing,\" and \"super\" into the\nannouncers’ mouths. A variety of words with taste appeal were used: \"fresh,\" \"mild,'\n\"smooth,\" \"rich,\" \"pure,\" \"light,\" \"creamy,\" \"clear,\" \"tender,\" \"sweet,\" and \"tasty.1\nWriters also often appealed to the,listener’s sense of prestige. Phrases used with\nprestige in.mind were often \"there’s no finer,\" \"that’s why WE suggest,\" \"call for it\nby name,\" and \"so why not join me.\"\nThompson’s survey disclosed that the listener is often told to \"ask for,\" \"look for,'\n\"always use,\" and \"depend on.” These phrases are usually used with the advertiser’s\nbrand name.\nAlthough the writers' supply of adjectives and other words appealing to most listen¬\ners seems to be fairly limited, it could not be called unsuccessful. The commercials\nused in Thompson's study represented three-fourths of the gross network expenditures\nfor 1950-51."
}