{
  "id": "d1916-23",
  "text": "- 2b -\nFORD FOUNDATION SERIES TO FEATURE.OPERA . v\nOpera produced, especially for television by the Metropolitan Opera Company will be\npresented at least twice during the forthcoming season of the Ford Foundation's\n\"Omnibus” which will be carried on the nationwide CBS television network beginning\nSunday, November 9«\n.Robert Saudek, director of the Foundation's TV-Radio Workshop which will produce the\n90-minute Omnibus series, lias announced that Rudolph Bing of the Metropolitan Opera\nwill personally work with the Workshop group toward the development of new tech¬\nniques of stagecraft and of direction for televised opera.\nThe opera will be presented in English, and will feature the Met's foremost artists\nand conductors. The choice of operas will be announced later. For the TV presenta¬\ntions, Omnibus will depart from its diversified format in order to devote an entire\nprogram to.each opera.\nOmnibus, with a $2,000,000 fund set aside for this most lavish of all TV program\nventures, has been scheduled by CBS for the b:30 to 6 p.m. EST time period on Sunday\nafternoons. The program is being offered for the multiple sponsorship of five\nnational advertisers.\nMany of the program features will be in the nature of \"show-casting’ programs that\nmay eventually find their own places in network schedules, Saudek declares. He added\nthat wide latitude will be given to creators of individual features to insure a high\nperformance level. Alistair Cooke, Peabody Award-winning commentator, will be master\nof ceremonies for the series.\nIncluded in the Omnibus plans are original plays by Maxwell Anderson, French ballet\nfeatures already in production in Paris, a music series by Leopold Stokowski, a\nseries of plays by poet-critic James Agee, and specially edited films by the New York\nZoological Society and the American Museum of Natural History,\nSaudek says the series will present, within its 90-minute format, five distinct\nfeatures of unequal length in each broadcast. These will be both live and filmed.\n\"A variety of features is now being produced,\" Saudek declared, \"ranging from fact\nand fiction to modern living, and treated to popularize matters of vital interest and\nlasting value. Associated with individual features are Richard de Rochemont, former^\nMarch of Time producer, and Jean Benoit-Levy,. producer of the French film \"Ballerina\"\nand \"La Maternelle.\"\nThe permanent staff of Omnibus includes John Coburn Turner, assistant director of the\nWorkshop, Franklin Heller, executive associate, who is on leave of absence from CBS\nto join the Foundation, and William Spier. Omnibus will be the third series produced\nby the Workshop since its inception in 1951. Omnibus will continue for 26 weeks\nduring its initial season.\nCOLUMBIA SEMINAR SERIES PRESENTS SOCIAL PROBLEMS\nABC has spotted its new \"Seminar\" program, presented by the Columbia University\nSchool of General Studies, at 7 p.m. Saturday evenings. The half-hour program made\nits debut October b.\nThe TV series airs an actual seminar in American civilization, based on a regular\ncourse studying the major contributing factors of civilization in the United States.\nTelevision viewers can obtain a syllabus of the course from the University, and will\nbe permitted to take a final examination if they choose to do so.\nViewers taking the examination will be graded, free of charge, but will not receive\nacademic credit for the course. Donald N. Bigelow, assistant professor of history at\nColumbia is conducting the programs, which are produced at ABC's 58th St. Theater\nunder supervision of John W. Pacey,' the web's director of public affairs."
}