{
  "id": "d1916-8",
  "text": "ST. LOUIS SCHOOL BOARD INCREASES USE OF RADIO STATION\nIncreased and more effective use of the St.. Louis, Mo., Board of Education's FM\nRadio Station, KSLH, is being made this year, public, school principals wer.e; told at\na- conference recently by Superintendent of Public Instruction Philip J. Hickey.\nIt was made plain at the meeting that KSLH is regarded as an important audio-visual\naid which will continue to receive more attention and which will not be displaced bj\nthe expected local, educational TV station.\nMIAMI UNIVERSITY’S RADIO-TV CHAIRMAN RESUMES POSITION\nProfessor Sydney W. Head has,resumed chairmanship of the Radio and Television Depart\nment of the University of Miami after a year leave of absence to work on his Ph.D.\nProfessor Head has completed his course work in mass communications at New York\n•University under Prof. Charles Siepmann. He expects to complete his thesis by the\nend of 1952. His thesis is in the area of the sociology of mass communications and\ndeals specifically with a content analysis of the social aspects of television drama\nIn addition to supervising the instructional, and program'production work of the Radi\nand Television Department, Prof. Head will teach \"Survey of Broadcasting,\" conduct e\nsenior seminar in \"Communications \"and Society,\" and direct research, special proj¬\nects, and internships.\nDuring Prof. Head’s absence, 0. P. Kidder, Jr., associate professor of Radio-TV, was\nacting chairman in charge of academic phases of the department, and Oliver Griswold,\nprogram coordinator, handled administration.\nTV Programs Back on the Air '\nThe University of Miami Radio and.Television^ Department has been asked by WTVJ to\nreturn all of its TV programs to the aid this fall. w\nLee Ruwitch, vice-president and general manager of WTVJ, has written Oliver Griswold.\nRadio-TV Department program coordinator, that each university program has added\nprestige to the schedule.\n\"Naturally, we want to make sure that the University of Miami will be represented\nagain this year,\" Ruwitch wrote. \"All of the programs presented by the University\nduring the past three years, have been well-received by the viewing public and we at\nWTVJ are proud.to have had the facilities for.their presentation. Each new Univer¬\nsity program has added prestige to our schedule.\"\nThe Radio-TV Department starts its Television Workshop Series of programs on Sunday,\nOct. 26, with a \"Science Show Window,\" featuring Allan McNap,,Director of the Lowe\nGallery, interviewed by Oliver Griswold in a demonstration Of \"Art Records the\nProgress of Science.\" >. :„ • *\nFCC GRANTS FM CHANNEL CHANGE TO U. OF MICHIGAN\nThe University of Michigan was recently given authority by the FCC to transfer Its\nnon-commercial, educational FM station WFUM in'Flint from channel 209 to commercial\nchannel 296.- The. station will continue non-commercial operations. The change waS\nmade to eliminate some interference in Flint .to reception of television station\nWJIM-TV in nearby Lansing."
}