{
  "id": "d85-1",
  "text": "(2)\nESTABLISHMENT OF NONPROFIT EDUCATIONAL BROADCASTING CORPORATION\n(Title II)\n1. Title II of the Public Television Act of 1967 amends\npart III of title IV of the Communications Act of 1934 to\nauthorize the establishment of a non-profit private corporation\n(the Corporation for Public Television )•\n2„ The Corporation would have a Board of Directors of 15\nmembers appointed by the President with the advice and consent of\nthe Senate. The members must be citizens of the United States\nselected from fields such as education, cultural and civic affairs,\nor the arts, including radio and television; and must be repre¬\nsentative of various regions of the country, professions, and\noccupations, and kinds of experience and talent, appropriate to the\nCorporation’s functions and responsibilities. The members of the\nBoard would serve six-year staggered terms. Each year (except the\nfirst year) one of the members would be elected by the Board to\nserve as Chairman and one or more would be elected to serve as\nvice chairmen.\n3. In addition to the Board of Directors, the Corporation.\nwould have a president and other necessary officers; and no political\ntest or qualification could be used in selecting, promoting, or\ntaking other personnel actions with respect to the Corporation's\nofficers, employees, or agents.\n4. The Corporation would be non-profit and it would have no\npower to engage in any political activity.\n5. The purposes of the Corporation would, among others,\ninclude:\n(a) Establishment and development of a system of\ninter-communication for distribution of public and instructional\nprograms among non-commercial educational television and radio\nstations}\n(b) Establishment and development of a system of\nnon-commercial educational television and radio stations in\nthe United States.\n6. In carrying out the above purposes, the Corporation would\nhave the usual powers conferred on District of Columbia non-profit\ncorporations and could—\n(a) Accept grants and enter into contracts with\nother agencies and institutions;"
}