{
  "id": "d85-43",
  "text": "Burt Harrison, page two\nCATHERINE MAY (cont.) get KWSC off the air as offering unfair\ncompetition. Much apologies from John because of soft answer.\nAnswer says—in effect—your problems are between you and the\nState University. ’’Wanted to tell him to go to hell—said\nJohn—but you can't do it in our position.” John says Catherine\nhas many close acquaintances on Commerce Committee and on\nSubcommittee. ’’Let us know soonest the number of the bill,\nwhether what you want is still in it, and if it isn't what you\nwant in,” says John. \"I guarantee that Mrs. May will get to\nthe key committee members with the message.” Left him the\nbundle. I think we have a friend in court here. Met all members\nof the staff. Drank a cup of coffee. Ate a Valentine’s Day\nchocolate provided by one staff member. Got called in as expert\nconsultant on new tape recorder the office is purchasing so that\nMrs. May can do weekly program from her office instead of having\nto shag over to Radio-TV.\nREPRESENTATIVE BROCK ADAMS (D-Wash.) Member House Interstate\nand Foreign Commerce Committee. Freshman representative. Brock\nout of town selling Lincoln. Talked to Henry Seidel, his\nAdministrative Assistant. Talked with Terry Bracy, his press man\nGave them the pitch. Got sidetracked into setting up half-hour\nradio discussion program, via telephone tape, with Representative\nAdams for KWSC. Silly damn thing, but needed something to make\nthis crew aware of educational RADIO, the existance of which\nthey were previously unaware. Lengthy session, but I hope\nproductive.\nSENATOR WARREN G. MAGNUSON (D-Wash.) Long, long session with\nGovernor’s press man, Carl Downing—and old buddy for 20 years.\nLunch with Carl and Sandler. Sandler made pitch. Hard sell.\nCarl gave Jerry hard pitch on KWSC. Advised us to build lots of\npressure from grass roots on all committee members. Arranged\nto have me meet briefly with Senator on Wednesday when he returns\nto town. Downing full of hot ideas on how to raise money for NER\nSuggested tapping AAAS for dough. Suggested tapping National\nPTA. Suggested forming national citizens committee. Agreed to\nbe active member of such committee if formed and to involve\nSenator Magnuson. We started to leave, he ordered more coffee\nand made more suggestions. Old Carl gave impression of being\nvery interested and involved. He is an old pro at this—so\neverything must be discounted 50%. Even so, we felt this one\nwas pretty productive.\nSENATOR FRANK MOSS (D-Utah) Committee member. Talked to\nresearch man, Jerry Jenson, and the press man—who is old KOL\nnews director. Sandler made pitch. Brethern involved asked\nmany informed questions. Jenson entrigued by multiplex pos¬\nsibilities. They wanted to know did we want separate bill or\nwhat. We promised to keep them fully informed."
}