{
  "id": "d85-46",
  "text": "E. G. Burrows\nFebruary 14, 1967\n1. Talked with. Steve Stockmeyer, Administrative Assistant\nto Marion Esch (R-Mich.). Stockmeyer, U-M journalism graduate,\nworked at WUOM and at TV. Indicates Esch will be very interested\nin all developments and wants to be kept informed. Said would\nbe glad to give whatever help necessary.\n2. Spoke to John Dingell (D-Mich.). Dingell very negative,\nabout desirability of renewal of Facilities Act. Says original\nidea was Congress would start the ball rolling and states would\ntake over. If states haven't taken over — tough. Congress has\nmore important business, such as air and water pollution (his\nspecial interest). Accused Sen. Griffin of torpedoing original\nETV Act in Michigan by insisting no church schools could bene¬\nfit. (MRS. CANTWELL, Administrative Assistant; GRANT SEAVERS,\nLegislative Assistant).\n3. Saw Jim Sparling, Administrative Assistant to James Harvey\n(R-Mich.). Sparling implied he didn't want to think about\nlegislation until it was actually introduced, but would be gald\nto help in getting testimony heard.\n4. Saw Sid Hoyt, Administrative Assistant to Sam Devine (R-Ohio).\nGot something of same reaction as Sparling. Hoyt indicated\nOhio State University had already been very vocal but wouldn't\nsay whether they were pushing TV only or both. He seemed to\nreact favorably to inclusion of radio, asked many intelligent\nquestions, but kept saying it's too early to talk.\n5. Lunch with Peter Holmes, Legislative Assistant, and John\nCrowley, Administrative Assistant, to Sen. Griffin (R-Mich.).\nHolmes seemed most actively interested and asked many questions.\nCrowley had evidently been exposed to complaints of commercial\n•broadcasters about practices of WKAR in football, etc. Seemed\nworried as to how commercial operators were going to react to\nany legislation favoring radio/TV. Holmes, however, pursued\nall subjects including private corporation idea with considerable\nintelligence. Feel we may- have made progress here, but no telling\nhow Griffin will eventually react.\n6. Talked with William Springer's (R. Ill.) legislative As¬\nsistant who said bluntly they relied for guidance in communication\nmatters on Lewis E. Berry, attorney (minority) for House Com¬\nmerce Committee.\n7. Went to see Berry. He was delighted to see me, he said. He\nis former radio student at University of Michigan, has home in\nCheboygan, knows a great deal about all aspects of commercial\nand educational operations. He said: 1) he thought ETV Act\nought to be kept separate from any public commission; 2) saw no\nreason why radio shouldn't be included in renewal; 3) hoped HEW\nwas definitely writing this in; 4) would urge his people to\ngive serious consideration to radio. We talked FCC problems\nwith which he is very conversant, netowrking, etc. etc. The"
}