{
  "id": "d85-48",
  "text": "JERROLD SANDLER - ADDENDA TO BOARD NOTES\nFebruary 13, 1967\n1) Accompanied Burke to see:\na. John Beaty, Senator Pearson’s press secretary (R-Kansas)\nb. Senator Carlson (R-Kansas)\nc. Charles Grady, education assistant to Senator\nMonroney (D-Okla.)\nBurke reported on Pearson and Carlson OK. In the Grady meeting\nI would add he was Superintendent of Schools in Oklahoma City\nbefore joining Monroney's staff, and seemed very familiar with the\nETV situation, not as familiar with the educational radio back¬\nground. He asked many intelligent questions, particularly in\nregard to Instructional broadcasting. Don't expect any agressive\naction from this source, but would expect a passive OK from\nMonroney when the time comes.\nFebruary 14, 1967\n1) Accompanied Curry to see Representative Kleppe. Not know¬\nledgeable about educational radio. Had some familiarity with\ncommercial radio. Promised to study appropriate legislation when\nit becomes available and will look for our report.\n2) Accompanied Harrison for lunch meeting with Carl Downing,\nMagnuson's press man. I think we definitely can count on him as\na friend in court in Magnuson’s office. He seemed surprised that,\nthere were other radio stations in the United States that were doing\nas good a job as KWSC. Thus, our report becomes very important to\npeople like this. This is one of the people I will definitely try\nto keep contact with in the coming weeks and months. He has been\nwith Maggie for 11 years and is totally familiar with the person¬\nalities and politics involved on thfe Senate side. I think he can\nbe very helpful to us.\n3) Accompanied Harrison to Senator Moss's office where we saw him\nlegislative research man and his press assistant. As in a number\nof other cases, they became quite interested and intrigued once\nthey began to understand what this was all about and definitely\nleft the door open for any legislative initiatives we might want\nto discuss with them in the future.\nFebruary 15, 1967\n1) Accompanied Burrows to Senator Hart's office where we saw\nMiss Ferris, legislative assistant. Very intelligent, sharp woman,\nwho took careful notes and asked pertinent questions, listened\nintently, and seemed to comprehend the situation as we explained it\nto her. It's worth noting that towards the end of our meeting she\nsaid that the key man around here (meaning the Senate) was Nick\nZappel, and indicated that they leaned rather heavily on him for\nguidance in matters of this kind."
}