{
  "id": "d85-50",
  "text": "Jerrold Sandler, page three\nf. While Burrows met with him, he introduced us to Senator\nHart, who was eating a few tables away. Brief chat with Hart.\nWe told him that we saw Miss Ferris. Coston told us later that\nHart leans heavily on Miss Ferris for legislative advice.\ng. Regarding the possibility of separate radio legislation\nwhich might be introduced (see my report on Representative\nOttinger below), Coston agreed that this could be very helpful\nto our cause by calling attention to the needs of educational\nradio and its very existence. He does not feel that it would\nhurt our cooperation with HEW or the administration as such,\nbut that it would probably be good political strategy on our\npart to work this thing from as many different angles as\npossible.\nh. My overall reading is that Dean is delighted that we are\nactually following through to the degree already reported\nand he wants me to keep him informed in our contacts, reactions,\nfollow-up, etc. While he represents an important friend in\ncourt, it should be understood that he is responsible for\npushing close to 50 bills yia HEW and that his own primary\nlegislative fights this year are in the area of- air and\nwater pollution. Therefore, we can’t really count on him too\nheavily in an active way, but within the total legislative\nenvironment his quite sympathetic to our cause. His main\nnegative feelings are simply that he is convinced that the\ndollars given by the federal government to ETV and ITV via\nthe Facilities Act and the various educational bills over the\npast years have been largely wasted and unproductive. He is\naware that the fault lies within HEW, the legislation itself,\nand the people in educational broadcasting, let alone the\neducational establishment. Nevertheless, this view which tends\nto be pessimistic and disallusioned will probably make our\nfight that much tougher in subtle ways, since we are seen as\nbeing a part of the same establishment. There is very little\nrespect over there for the educational broadcasting estab¬\nlishment itself. Coston on a number of occassions has indicated\nthat outside of Marquis and myself, he would as soon wash his\nhands of the whole matter.\ni. Take it for what it’s worth, but he says that from his\nvantage point generally on the Senate side you will tend to\ndo your best speaking directly with legislative staff people,\nand on the House side with the Congressmen themselves. My\nown experience indicates that this doesn’t always hold true,\ni. e., in our own four days of contacts on the Hill, there are\na number of examples where staff people on the House side have\ntaken the initiative.\nj. In my final encounter this past weekend with Coston (this\ntime along with Hilliard in a social setting), it became very\napparent that there will be considerable noise from the ITV\nworld, since the proposed bill leaves them out of general\nfunding on the basis that there are already appropriate bills\nfor that purpose. Instead, HEW is proposing ”a study” of ITV\nproblems under the aegis of the Rand Corporation."
}