{
  "id": "d85-54",
  "text": "Jack Burke\nFebruary 13, 1967\nSENATOR PEARSON (R-Kansas) Saw John Beatty, Press Secretary.\nWill carry the information to the Senator. Became very involved\n(12:30-3:00 meeting). Pointed out need for continual contact\non the Hill. Follow-up letters will be very helpful, especially\nfrom University presidents and local groups. Even though he\nhas a broadcasting background had no real knowledge of educational\nradio — especially in-school. We need some facts on this\nphase of our activity. John can be counted on to be a friend\nin court. He is not agressive enough to carry the cause without\na hand.\nPearson is solid conservative Republican, but not ultra-con¬\nservative. Don't think he will champion, but should support.\nSENATOR CARLSON (R-Kansas) After discussing the cost of\nfertilizer, we spread a little. He is conservative, but very\napproachable and reasonable. Knows educational radio as\npracticed in Kansas. Good friend of University and our\nPresident. Assured us we would be heard in committee hearings.\nIf we can't get in there, why, what the hell, come and talk to\nhis foreign relations committee. Could be used if needed.\nSENATOR MONRONEY (D-Okla.) Saw Charles Grady, educational\nassistant. Listened, friendly — will take the information to\nthe Senator. Average response.\nCONGRESSMAN JOE SKUBITZ (R-Kansas) Is very unhappy with\ncommercial broadcasting.\n1. Against editorializing\n2. Over commercialization\n3. All rock, no talk, no minority tastes represented\n4. Against clear channels\n5. For longer hours for day timers\nCould be very helpful because he is in favor of broadcasting.\nAlso gave a long lecture on excessive profits in broadcasting\nand use of public franchise granted by government. They don't\nown anything except the equipment. Big interest in new social\nsecurity legislation. Will introduce a bill. Should be included\non programming in this abea. Wants to be kept informed. Had\nno packet to leave with him — send immediately\nCONGRESSMAN CHESTER L. MIZE (R-Kansas) Saw assistant Freeburg\nfirst, and about % way through he became interested, particularly\nin variety of services and multiplex potential. He changed from\nvery cold to interested. The Congressman arrived and in a\nrepeat of the information both reacted favorably. Asked what"
}