{
  "id": "d85-55",
  "text": "Jack Burke, page two\nFebruary 14, 1967\ndoes TV think of radio in ETV Facilities Act. Answered to his\nsatisfaction. He listens to KSAC, has been a participant and\ncan't really see how (at this point) anyone can be against.\nHe is conservative (quite) but should be counted upon for sup¬\nport. After it's beyond committee and up for consideration, he\nshould be contacted. Could help before, if necessary.\nREPRESENTATIVE GARNER E. SHRIVER (Kansas) Talked to office\nstaff. No real contact. Send information both types —\npacket and report.\nCONGRESSMAN LARRY WINN, JR. (R-Kansas) Saw Lyden Bitter.\nGood looking doll — should have been great interview, became\nvery interested, although one big problem. They consult with\nthe Manager of our share time commercial station. He is an\nSOB and would bomb me, if possible. AVOID! The Broadcaster\nsupported ETV and helped get money for Washburns, so don't\nwrite support off completely. No other contact except Research\nreport.\nCONGRESSMAN DONALD G. BROTZMAN (R-Colorado) Saw Robert Tonsing.\nCONGRESSMAN JOHN JARMAN (Oklahoma) Saw Juanita Mosher\nMild interest, will take information to the Congressman, will\ntake follow-up to turn on. Both are on the House Committee so\nshould be done. Good experience, but no definite impression.\nCONGRESSMAN ROBERT DoLE Saw Bill Kats. Reaction very good,\nalthough Dole is a frequent critic of government programs. I\nfinally broke off the conversation. Dole out of town. Interest,\nno opporition. Dole is very vocal. If we could get him he\nwould speak out on our behalf, but don't think you could get him.\nNo educational radio in his district now, except service from\nKSAC.\nSENATOR LONG (Louisanna) Saw Charles McBride, press aide.\nSeemed attentive, interested, and totally unaware of radio. Will\nsee the Senator gets the information. Average contact.\nCONGRESSMAN J. J. PICKLE (Texas) Saw Tony Profitt. Listened\nand responded. Said he knows something of broadcasting, since\ntheir district includes Austin. Bob Schenkkan and LBJ have\ninterests there. Looks alright, but since it's Bob's territory,\nperhaps the follow-up report of xsadx radio research will be\nenough."
}