{
  "id": "d85-61",
  "text": "The Honorable Vance Ilartke\nPage 2\nFebruary 26, 1968\nAs concrete examples, I would like to cite these two\nin-school series:\nPatterns in Folklore, originally produced by WBAA\nfive years ago and telling the story of American folk¬\nlore to 3rd and 4th graders, contains stories and\nanecdotes taken from printed collections. The series\nalso contains recorded folk music of various record¬\ning companies. WBAA rebroadcasts the series each\nyear, and this year it is being used as an in-school\nfeature by the NER Network. Under the proposed copy¬\nright law revision, it would be eliminated on at least\nthree counts: 1) the tapes are more than a year old,\n2) the radius of distribution is more than 100 miles,\n3) the programs include copyrighted material.\nOf Cabbages and Kings is a new series WBAA is currently\nproducing. Xt is being used by eight Indiana stations.\nFifty-five teachers in the state have ordered teacher’s\nmanuals from us for use with this series. Material\nused in making up this children’s story series comes\nfrom 53 different books involving 24 different pub¬\nlishing companies. Indications are that the series\nwill be accepted for distribution on the NER Network\nnext fall. Under the proposed copyright law revisions,\nobtaining clearances would have been far too onerous\na task and the program cost for a one year run would\nhave been prohibitive. Too, there could be no distribu¬\ntion to other Indiana stations or to NER Network\nstations.\nA similar statement could be made about nearly all\nof our in-school programs. The limitation to one year\nof use and to use only on WBAA would make the first\ncost far too great for us to afford.\nClassical music composes nearly 30% of our broadcast\nschedule. If S. 597 becomes law, the various clearances\nit will be necessary for us to obtain will create an\nimpossible situation, as such clearances would have\nto be obtained from artists, composers, recording companies,\nor rights holders for each classical selection aired."
}