{
  "id": "d85-65",
  "text": "February 18t 1967\nThe Honorable Glenn Cunningham\nHouse of Representatives\nCongress of the United States\nWashington, D. C. 20510\n1/ear Sir:\nIt was a privilege to visit your office in Washington last Wednesday,\nJtebruary 15, 1967. Mr. Jim Roberts of your office staff was very courteous\nand 1 greatly appreciated his taking tine to talk with me.\nI came as the representative of rational Educational Radio ?4egian IV,\ncomprising Nebraska, Wyoming, North and South Dakota, Iowa, and Finnesota.\nMy purpose was to call your attention to the inclusion of educational radio\nin forthcoming legislation for extending the Educational Television Facilities\nAct. I understand that at present Nebraska has two educational FM stations;\nKGBI-I54 in Omaha and &J^T-FF in North Platte. They would stand to benefit\nfrom the inclusion of educational radio in pending FT? Facilities legislation.\nIn mid-M&rch you should receive data gathered from educational radio\nstations around the nation showing the current status of educational radio\nand indicating its values and needs. Tills information, together with\nmaterial which should by this time have reached you from NBRfs Washington\nheadquarters, is intended to provide legislators and the committees concerned\nwith the IT? bills with sound grounds for incorporating educational radio\nwith educational television in the forthcoming legislation.\nIt is hoped that you and your colleagues on the House Interstate and\nForeign Commerce Committee will see fit to ensure a hearing for educational\nradio when the ITV Facilities legislation comes before the committee.\nHere in the Prairie states, particularly, it is further hoped that our\nRepresentatives and Senators will champion the cause of supporting educational\nradio in any contemplated legislation.\nSincerely yours.\nkyron M. Curry, Director\nKFJM A Closed Circuit T?\nand\nRepresentative for Region I?\nNational Educational Radio (NHR)\ncc to Mr. Roberts\nNER\nHerman Land Associates,\nInc"
}