{
  "id": "d85-78",
  "text": "February 18, 196?\nfhe Honorable Milton R. Young\nSenate of the United States\n3121 Hew Senate Office Building\nWashington, X). C. 2Q510\nBear Sir:\nIt was a privilege to visit with you in your Washington office last\nTuesday afternoon, February lAth. The conversation with you was enjoyable*\nas always, and I appreciated your willingness to hear ay observations about\nincluding educational radio in the language of the forthcoming legislation\nextending the ;4ucational Television facilities Act.\nIt was particularly encouraging to learn that you have heard no complaints\nabout the existing ETV legislation* It is to be hoped that such conditions\nwill encourage your supporting extension of the act in a fashion which will\ninclude educational radio*\nBy aid*4.arch, it is expected that you will receive the results of a\nnationwide survey of existing educational radio facilities. If the voice of\neducational radio can be heard In the Senate Commerce Committee hearings\nthrough presentation of the survey data, the desirability of including\neducational radio in the language of the LTV facilities bill will surely\nbe clear*\nAlthough the Information packet which I left with you was a bit bulky,\nmy 1 call your attention, in particular, to the »SEJT Re sorter11 and some of\nits substance which deals with last Hovember*8 Wings preae Conference on\nAucationai Radio at Milwaukee* The articles in the NR .Reporter’* may\nserve to indicate the widespread concern for educational radio1® development.\nIt is my hope that you will be able to discern the need for new and more\nextensive educational radio facilities nationally and in our own state of\north Dakota. It is also my hop© that you can see fit to assure a hearing\nfor educational radio when the legislation is taken up by the Senate\nCommerce Committee, I even hope that you will be willing to be an active\nsupporter of educational raaio, both now and, in the future.\nBest wishes to you, and thank you and Mr. Sylvester for your courtesy\nto me.\nSincerely yours.\nMyron H* Gurry, director\nKFJM & Closed Circuit TV\nand\nRepresentative for Region IV\n(H. & S. Me*, Minn*, Ia., Nebr., Wyo.)\nnational Educational Radio"
}