{
  "id": "d85-86",
  "text": "February 18, 1967\nThe R an ora Vie Roman !>• Hruska\nof the United State®\n313 Old Senate Office Building\nWashington, D, C. 20$ 10\nDear Sir:\nWhile 1 was in Washington this past week, I visited your office and net\nyour arsist^nt, hr. Janes Defaults. My visit was occasioned bj *y being the\nrepresentative for National ducational Mio legion l\\ comprising .Nebraska,\nIowa, Minnesota, North and South Dakota, and byoning.\nIt is mg understanding that forthcoming legislation to extend the\nIducat ioaal Television Facilities Act will include educational radio for\ntbs first ti*». If so, it will be oartioulariy welcome because educational\nradio has wlt&sld vigorous pursuance of its nerds for support in order to\navoid Jeopardising the firm e*tablishiatnt of educational television. New\nthat *;TYfi position appears to be sound. It is believed that now is a good\ntime to pro ids similar support for educational radio,\n* Educational radio's economy, flexibility, pervasiveness, and ease of\nutilisation by local eltlsens seems to make it susceptible to strengthening\nand diversifying with v«ry little additional support which could be\nincorporated into the pending FTY Facilities legislation. To provide\nsuv^art for educatiq^ua! radio would enable it to serve each state in ways\nwhich its more glamorous brother, lift, can hardly offer economically.\nA survey is currently providing data, which when synthesised, is\nexpected to show the existing nature and status of educational radio\nthroughout the country. The information should become available to ycu\nin mid-harch. It is hoped that in forthcoming Senate Commerce Cojwnittee\nhearings that the voice of educational radio can be heard in support of\nits case for inclusion in the pending ; TV Facilities legislation* It is\nalso hoped t hat our Senators end Congressmen from the xrairie states\nwill see the value in supporting the development of educational radio,\nMr. Defaults was most courteous and generous with hie tire in meeting\nwith me last foc&nasday. I deeply appreciated his reception and wish to\nexpress «y good wishes to him, and to you.\nSincerely yours.\nkyron tf, Curry, Director\nOTM A Closed Circuit TT\nand\nRepresentative for legion IF\nNational Educational Radio (S B)\ncc to: Mr. Schult®\nHER\nHerman W, Land Associates, Inc."
}