{
  "id": "d1570-0",
  "text": "L\n□ □□□«*\nOF EDUCATIONAL BROADCASTERS\nRepresenting non-commercial, educational AM, FM, and TV broadcasting stations, workshops,\nand production centers, owned and operated by colleges, universities, school systems, and public service agencies.\nJUNE 1952\nFOUNDATION GRANTS AND SPECIAL PROJECTS\nC'\nFUND FOR ADULT EDUCATION MAKES GRANT TO NAEB FOR LOCAL PROGRAMING\nThe Fund for Adult Education has set aside $80,000 for grants-in-aid to be distributed\nby NAEB to educational institutions to assist them in planning and producing educa¬\ntional radio and television programs*\npurpose of the Grant Outlined\nA letter to NAEB Executive Director James Miles from the President of the Fund for\nAdult Education, C. Scott Fletcher, describes the grant. After stating that the\n$300,000 Lowell grant was expected to “set standards for educational broadcasting\neverywhere,” Fletcher said it was the Fund’s \"view that high quality programming at\nlow, out-of-pocket cost is the pattern that holds most promise in educational tele¬\nvision •”\nAccordingly he asked that the NAEB Executive Director and his ‘’associates in the NAEB\n,,,evaluate the resources and technical skills of the several institutions which may\nbe interested in having some financial assistance in pro graining,” Fletcher spec¬\nifically declared! “It would be as suited that institutions which are not members of\nNAEB would be considered equally eligible for such grants,”\nTop Limit; $7,000 Radio; $9*000 Television\nThe FAE President also said:\n“We have earmarked for use this year $35,000 for radio and °00fortelevision.\nIt is our general view that a grant-in-aid to an educational institution £°r plan g\nand producing a series of content-oriented radio programs should not ri^_ than\n$7,000* In television, where an educational institution and a c ommercial televis\nstation each make inportant contributions to a series of content-oriented programs,\nour view is that the grant-in-aid should not be larger than $9,000*\n\"You will recognize, I am sure, our hope that these grants will make the difference\nbetween routine broadcasts and carefully planned, adequately researched, well written\nquality programs in specific subject areas. It would be our expectation, too, that\nradio series thus produced would be made available to many educational stations\nthrough the tape network, and that through this device the,, program services of edu¬\ncational stations would be measurably enriched,”\nWATCH FOR NEWS OF THE NAEB 1952 CONVENTION—NOVEMBER 6-7-8\nThe N-A-E-B NEWS-LETTER, published monthly, is distributed from\nthe national headquarters office at the University of Illinois. N-A-E-B\nmembers and associate members receive the NEWS-LETTER as part of\nmembership service. Non-members may obtain the publication at a\nsubscription rate of $5.00 per year. All inquiries regarding subscriptions\nand distribution should be addressed to: NAEB, 119 Gregory Hall,\nUniversity of Illinois, Urbana, Illinois. Editorial copy and inquiries\nconcerning editorial matters should be sent to the Editor, Burton\nPaulu, Station KUOM, University of Minnesota, Minneapolis 14,\nMinnesota."
}