{
  "id": "d1570-14",
  "text": "-15 -\nUNIVERSITY OF MIAMI TO OFFER TV HOME COURSE\nThe Evening Division of the diversity of Miami will offer a course in “Home Mechan¬\nics” this summer via television for home viewers* J. Richard McElheny,.chairman of\nthe Industrial Education Department, will give the course from the studios of WTVJ\nweekly beginning June 5.\nThe series will be produced by the University's Radio and Television Department under\nthe direction of 0* P. Kidder, Jr*\nThe \"telecourse\" will show the average householder how and when to make minor repairs\nand insure proper maintenance*. Emphasis will be placed on how to foresee the need\nfor household repairs, when the amateur should attempt the job, and when to call in\nexpert repair service. Mr. McElheny will also demonstrate how to analyze household\nmerchandise for good design, construction, and materials*\nCorrespondence to Supplement Demonstrations\n%\nThe eight half-hour \"teLeclasses\" will be supplemented by printed materials which can\nbe obtained by mail from the Evening Division for $1.00. These will include a text,\n\"Mister Flxum's Handy Hints,\" covering major points of the course, and an outline oi\nthe course content. The fee also entitles the \"telestudent\" to attend two question¬\ned-answer clinics to be held on the University campus, where Mr. McElheny will meet\nhis \"telestudents\" for solutions of special, individual problems.\n\"Telelessons\" will cover painting and decorating, furniture finishing and refinishing\nplumbing hints, removal of dirt and stains from various materials, home handicrafts,\nelectricity and electrical appliances, miscellaneous common repair and maintenance\njobs, and \"When the Auto Won't Start - Why?\" Much of the course will be directed to\n^ the needs of the housewife who is frequently faced by breakdowns in household equip¬\nment.\nWOI-TV HOSTS 10-STATE RELIGIOUS TV CONFERENCE\nRepresentatives from 10 midwestem states took part in the religious television work¬\nshop at WOI-TV April 20-25* Richard B. Hull, radio-TV director of Iowa State Colie ge,\nmade the station's facilities and engineering personnel available for aid to the 50\ndelegates.\nThe week-long workshop was sponsored by the television and radio committee of the\nIowa Inter-Church council, of which the Rev. C. Orville Strohl is chairman. Rudy\nBretz, TV consultant for CBS in New Y°rk, and Charles Schmitz, educational director\nof the Commission on Films, Radio, and Television of the National Council of Churches,\ndirected arrangements for the discussion sessions.\nThe schedule included sessions on program monitoring, sciiptwriting, and production\ntechniques. A half-hour program on WOI-TV was produced by the group. Participants\nincluded state and city church councils, pastors, directors of Christian education.\nLaymen and councils of church women.\nv SCOTS USE NAEB-SMYTHE STUDY ON LOB ANGELES TV PROGRAMMENG\nAccording to a recent item in Variety, the NAEB - sponsored Dallas Srrythe - Angus\nCampbell report on television programming in the Los Angeles area has been under\nstudy by the Free Church of Scotland.\nThe religious group, which usually sitojects motion pictures to its criticism, is now\nturning its attention to television. It cited that section of the NAEB report which\npointed out that 692 crimes were committed on television programs aired by seven Los\nAngeles stations, and mentioned that \"programs specially built for children presented\n82# of the violence.\""
}