{
  "id": "d1570-2",
  "text": "March 1* 1943\nNAEB NEWS LETTER.Page 3.\ntoday1 e events as they are taking place around the globe*\nEach broadoast, on Friday 3:15 p.m., EWTf Is under the direct supervision\nof W. Robert Farnsworth, Dlreetor of Radio in the Ithaca Miblic Sohools. It\nconsists of a preparatory psrlod of review, touching on the people, geo^»\nraphy, and topography of the region to be discussed in the day1 s lesson;\nthen, having been provided with an individual map, the student follows the\ncourse of the day*s discussion, as he listens to the broadcast and comments\non the news, as taken from the wires of the United Press*\nLetters from sohools in the listening area report that teachers see it as a\nmeans of correlating audio- and visual-aide in modem teaching© It serves\nto demonstrate in a practical way, what radio can offer in the field of\nformal education; — it also brings the young person into closer relation\nwith his radio*\nW N T 0 PARRIES AMERICAN MU3I0 FESTIVAL\n\"In these times of war and stress WNYC*s Fourth Annual American Music\nFestival assumes new and added importance in keeping alive the American\nmusioal heritage and providing entertainment for everyone in the war effort*\"\nThus M. 8. Novlk, director of the City Radio Station announced the begin¬\nning of WNYC® s American Music Festival.. * a Festival whi ch Matured tm;\ndays of outstanding programs written and directed by and for Americans.\nNinety-seven broadcasts were carried and got under way with the gala con¬\ncert held the night of February 13th in the Hunter College Auditorium.\nDeems Taylor, Quincy Porter, Paul Oreeton and Alec Templton, were oonduet-\nors of their own compositions as a part of the first public Festival Con-\noert, and Dean Dixon, nationally-known conductor led the orchestra in works\nof William Grant Still, Walter Piston, and ?aul Bowles. Beveridge Webster\nnoted American pianist was guest soloist in this concert. Olin Downes,\npopular New York Music critic served as commentator*\nBut this was only the beginning. Eith other symphonic concerts followed\nIn rapid succession during the ten day period of the Festival*..in addition\nto conoarts of Amerioan Jazz Music*\nOKLAHOMA FARMER8 HOUR STARTED ON W N A D\nAddition to WNAD* s. University of Oklahoma, broadcasting schedule of a\nweekly eduoatlon 1 15-minute program of news and infromation for Oklahoma\nfarmers has been announced by Virginia Hawk, station director*\nEntitled the Oklahoma Farmers Hour, the first program went on the air Feb¬\nruary 15 with Tom Wc Cheek, president of the Oklahoma Farmers Union, as\nmain speaker*\nThe Oklahoma Farmers Union will co-operate with WNAD in preparing and Pr0~\nseating the weekly program. \"We at the University are happy Indeed to be able\nto provide facilities of the state educational broadoasting station for\nthis series of agricultural programs for the farmers of Oklahoma* H* H*\nSoott, Extension Division director said. \"These programs will help to br.ng\ngreater farm production which is absolutely essential to win the war*\""
}