{
  "id": "d1837-1",
  "text": "-2-\nMINIMUM STUDIO REQUIHEMINTS\nPor strictly \"broadcasting purposes you will require a control room at\nleast 20 feet square; a studio the same size adjoining the control room;\nand an announcer \"booth 5 feet \"by 10 feet also adjoining the control room.\nYour offices will not require the high space if it is not readily available.\nThe control room, studio, and announcer \"booth must have separate corridor\nentrances, and large double or triple glass windows (with the panes set non¬\nparallel) should give visibility from the control room to the other two units.\nIt is best for the announcer’s booth and studio to abut the control room on\ntwo adjoining, and not two opposite walls. Entrance to the booth and studio\nshould be made by small corridors so that two sound-proof doors, constituting\nan efficient sound-lock, may be set up. Your own building or maintenance\ndepartment can no doubt construct these doors, as well as double the walls\nsurrounding the studio .and announcer booth.\n■Ar far as accoustical treatment of these units is concerned, don’t let\nit worry you. Secure some accoustical celotex in the usual foot square blocks.\nHave this applied solidly to the ceiling and over three-fourths of the wall\nspace, using care not to leave uncovered areas directly opposite. The un¬\ncovered areas, plus the doors and windows, will give the studio enough \"bounce”\nbut you will still have adequate absorption. For the floors, use any type of\ntile linoleum, -feccoustical experts may writhe at the simplicity of the accous-\ntioal problem as I have solved it, but it will work well for most small and\nmedium sized units. Your control roon should also have some accoustical treat¬\nment. Apply the accoustical celotex to the ceiling and the top half of each\nwall first. If that doesn’t give you enough absorption;, additonal blocks of\naccoustical tile can be quickly glued on.\nNow back to the location again. If your college is unfortunately located\nin a depression, you’d better look for a location on the top floor of the\nhighest building in your town and ignore the campus. After all, your space\nrequirements are not excessive, and the rent of the necessary room should not\nbe too high. However, if a location at or near a high point in your community\nis impossible, give up your EM ideas.\nAs long as your station is at or near the highest point in your vicinity\nthe location doesn’t have to be much higher than the surrounding land. If\nyour topography is gently rolling and you can see out a mile or so from the\nroof of the building you select to house the station, the chances are that\nthe visibility will be extended several miles from the top of the tower itself.\nSince the radio waves will easily cross two or more gentle horizons, your\nstation, if operating on low power, will likely give service to all the area it\nsupposed to.\nEQUIPMENT WD COSTS\nIf you are going into PM for the first time, I’A recommend that your\ntransmitter be a 25(1 or 1,000 watt job—no higher. Most PM transmitters are\nso constructed that additional power units may be added to the basic unit, so\nyou'd do well to start v/ith a lower power and see just what coverage you'll\nget. Perhaps your lower-powered transmitter will do all you want."
}