{
  "id": "d1798-16",
  "text": "NAEB NEWS LETTER••••SEPT 15, 1940....Page 17\nto place all our programs on a higher plain. Th© response from our\nlisteners has been very favorable® 1fAn oasis in the desert? — thus\none of our listeners comments on our service to the public.”\nKFUO has no endowment fund, no commercial sponsors, but is financed\nsolely by voluntary contributions from congregations, organizations,\nsocieties, and individuals.\nMASTERPIECES OF ART ON WNYC\nWYNC, New York City, introduced a now series of programs on \"Masterpiece?\nof Art/* with Dr® Bernard Myers of New York University as commentator 0\nSeries went on the air in August® The series is based on the Master¬\npieces of Art Exhibit at the World’s Fair®\nFCC MODIFIES ULTRA-HIGH ASSIGNMENTS\nThe Commission on July 24, 1940, modified its Rules Governing Broadcast\nServices Other Than Standard Broadcast as follows:\nRepealed Section 4.137 applying to Non-commercial Educational Broadcast\nStations and substituted therefor the following:\n\"Section 4.137 Frequences s® {a) The following frequencies are allotted\nfor assignment to ncn-commeroial educational broadcast stations®\nKilocycles\n42100\n42300\n42500\n42700\n42900\n(b) Stations serving the same area will not be assigned adjacent\nfrequencies.\n(c) Frequency modulation shall be employed exclusively unless it is\nshown that there is a special need for the use of amplitude modulation®\n(d) Only one frequency will be assigned to a station®\"\nKENTUCKY SYSTEM ADOPTED IN TENNESSEE\nThe University of Kentucky’s system of radio listening centers, in\nremote sections of the Kentucky mountains, a pioneering plan in the\nfield of adult radio education, has been adapted to the mountains of\nTennessee, according to a recent announcement from there®\nThe plan, as promulgated by the University of Kentucky, has been adopted\nby a Knoxville radio station, and consists of the solicitation of old\nbattery radio sets which are brought in, remodeled, and taken to remote\nposts in the mountains where listening centers are established for those\npeople who have no sets of their own, and very meager facilities for\ncontacting the more densely populated sections of the state®\nThe University of Kentucky established its radio listening center system\nin 1933 and at present there are approximately 40 such centers in the\nmountain sections of Kentucky® The Knoxville station plans a similar\nsystem, and like the University of Kentucky, will direct a certain number\nof programs each week to listening center groups, which programs they\nare also patterning after the Kentucky plan®"
}