{
  "id": "d1798-2",
  "text": "NAEB HEWS LETTER,... SEPT. 15, 1940. /..Page 3\nexpand publication activities; 4, Each station submit list of community\nprojects which they are carrying on; 5P Contact schools which now or\nlater operate standard or Ft! stations vrith a view to membership.\nThe Association formally approved sending of a letter to the Committee\non Scientific Aids to Learning, encouraging development of a trans¬\ncription exchange.\nDetermination of the time and place for the next annual convention\nwas referred to the Executive Committee with power to act.\nCommittees apoointed by President Ingham to serve during the convention\nincluded the followings FCC Rules - Harold Engel, WHA, Chairman: Fred\nc. Conger, WBAA; and Frank Schooley, WILL, Resolutions- M, C, ffensen,\nWCAL; L!„ S, Novik, WYNC; M, Reid White, KWSO. N&E3 Program - Luke\nRoberts KOAC; W. I, Griffith, HOI 5 Harold Kent, Chicago Radio\nCouncil, Copyrights - Waldo Abbot, Michigan; Lee Norvell, Indiana;\nRobert Lee, KWLC. Nominating - Jos, F, Wright, WILL; Carl Menzer,\nWSUI; Wo I, Griffith, WOI,\nThanks was extended by resolution nto all those who have participated\nin the program, and have assisted in any way in making it a success,,\nAnnouncement was made regarding availability of educational trans¬\ncriptions from C, p. MacGregor of Hollywood, Special concessions\noffered include indefinite use of the transcriptions for same as\nsale price to others.\nA resolution urging member stations to extend their relationships\nv/ith local library croups, that a joint local or state committee be\nset upto further the joiAt Interests between libraries and stations,\nthat we extend our co-operation beyond the present literary programs\nto news special events., and civic interest and call attention to\navailable books for background reading, was approved by the convention.\nProfessor W. I. Griffith, W, gave the annual treasurer's report\non NAEB1 s financial status. The report, as of September o, ww,\nshoweds\nCash balance on hanWa^reported at Columbus, April 26,1940. 4534,09\nMay 10, 1S40, WHAD, Oklahoma University, Norman, Oklahoma, 10e00\nMayH°4^1940^*WOSU, Ohio State University, Columbus, Ohio, ^ 10„00\nJune\" 13°, 1940^\" KUSD*,\" University \"of \"south' Dakota\", Vermiiiion, ^ qq\nSix copies of \"Date on Instantaneous Recording Machines.. 3.00\n@ .. Total Receipts $567.09\nDisbursements\nCheck No. 25, 1940 Convention Expenses and postage to i8„71\nAufcust 31, 1940 to Frank Sehooley...• • •• •• ■ ■ ..! ’! 3545.38\nb ’ Balance on Hand to date,..\n, , , +hP waeb Executive Secretary for the past year,\nSF“sSleTxeepBortedhL following activities, editing and mailing"
}