{
  "id": "d1798-4",
  "text": "NAEB NEWS. LETTER. . . .SEPT 15, 1940....Page 5\nIs 11 grant you that a course Is well to take, but no course in radio\nwriting is in itself sufficient. What do I think is sufficient?\nFirst of all, an ability to put words on paper. I*m sure all of you\nmust realize how difficult it is for the average person to do this*.\nthe minute he gets before a typewriter or gets a pencil in his hand he\nstops thinking. . o and many of our scripts heard on the air.both\ncommercial and educationa sound as if they had never been thought\nthrough. First of all, a writer must be able to write0..and good\nwriting is good writing whether it is in a radio script, a radio\ntalk, a newspaper story, a magazine article, a short story or a novel.\nSo let*s get rid of the idea that there*s some hokus-pokus. some mumbo-\njumbo abotifc radio writing that sets it off apart... .as a field\npeculiarly its own. The beginning writer should have one of two\napproaches to radio writing...either he should b© trained in a good\nstiff school of journalism; or he should be trainee in a good stiff\ncourse in the theatre, literature, drama, creative writing, if you\npill permit that somewhat obsolete term. Radio writing is not a\nbeginners course.... we haven*t time to teach writers the fundamentals\nof English construction; dramatic construction....Radio writing should\nbe a professional course, given in advanced collage or university\nwork. Given a student or individual who is genuinely interested in\nwriting for radio, and who has a sound background in literature,\ndrama, journalism or some other form of popular writing, its a relat¬\nively simple matter to teach him the tricks of radio writing. Ah,\nbut you say, none of us are students,..many of us ere professors of\nscience or literature or some other esoteric subject....we are asked\nto write radio scripts...talks.....on our subjects for broadcasting...\nwhat are re going to do? !7e must presume that most of us at one time\nor another had a background in the English language, !7e use it daily\nin our classes, in our living,, All of us speak. But most of us have\nforgotten that we no longer speak the vernacular,,.we no longer speak\nTHE language..... too many of us speak our language, Well, you can® t\nspeak \"our language * on the radio..... you have to speak the listeners\nlanguage. And the simplest way to get your talk into the language\nof the listener is to speak it....„I*m speaking now of talks, those\nfifteen minute or five minute or ten minute spots that the program\ndirector uses to fill in the blanks in his program....This is an old\nsuggestion, one that has been made by every speaker who ever spoke on\nradio vrriting.. .don* t attempt to put your ideas first hand on paper....\nthink through your subject.supposing it is \"Hand Painted Japanese\nLanterns\"...«there have been worse on the air...•.Think through all\nyou want to say about Japanese Lanterns, organizing, in your mind\nthe salient facte you want to bring out about them...where are they\nused, why are they used, why are they handpainted, where are they\nmade, what relation do they have to your listeners mode of life...\ntie up with his experience,....when you get this done you have some¬\nthing like this...For a lead, starting from the known and proceeding\nto the unknown.... your talk will sound something like this....\nUnless you*re too awfully old, everyone of you can remember\nthe summer church socials, which were held on the lawn of\nthe village Methodist Church.••.Remember, those grand cakes\nMrs. Jones used to bake...and did you ever beg your grand¬\nmother for just one lick of the ice cream freezer dasher?\nI*m sure you have, for ice cream socials have long been a"
}