{
  "id": "d1798-6",
  "text": "NAEB NEWS LETTER....SEPT 15p 1940....Page 7\nhave mad© tests to determine listeners reactions to the sincerity o.f\nair voices....sincerity has to start back farther than that....it has\nto start with the writer in his very first opening sentence»\nThe Radio Council, primarily because of its elementary school audience,\nhas gone rather heavily towards dramatic writing as a form of presenting\ninformation. I think, personally, a good talk, has just asmuch oomph,\nand just as much sustaining of interest power as most dramas....or\nshould I say* most dramatic writing. It's a peculiar thing...my\nbackground is a kind cf jumble of theatre and newspaper experience...\nsome writers who have had dramatic training will insist that the\ndramatic is the only way to present material....the newspaper trained\nwriter is inclined to think that the talk, the interview, the narration\nis the bettor way. I doubt if there is any best. The material to be\npresented should dictate the form in which it is to be presented.\nThere are times, when in science series, I’d like to throw out the\ndramatic form we ordinarily use and substitute for a time or two an\ninterview or a talk. I see no reason that this cannot be done, and\nmost times profitably. «7© are inclined to think of radio as a\ndynamic medium*..•.and yet, once we have established a set form for a\nprogram, everyone in the organization thinks the entire system of\nradio broadcasting would collapse if that form be changed. I don’t\nthink it would* Too many educational script writers, and it’s not\naltogether our fault, ar© pouring new wine into old bottles....either\nwe must break those bottles, or they’ll be broken for us.\nIn thinking of presenting informational material on the air, consider\nthe medium. Is the talk the best way to present it^ Will drama or\ndramatic incidents enhance the value of the material.....if you\ndecide on the latter....the dramatic..... then it is the business of\nthe writer to be dramatic.... to build a scene, presenting the Inform¬\nation according to the rules of dramatic writing...oh, yes, there are\nrules...Build to your climax from a statement cf the opposing forces....\nbut be sure there are opposing forces before you begin to write ’drama’.\nI suppose I should say a word about adaptations....this is one of the\nmost popular of so-called educational scripts...I remember the writer\nwho came into my office just over-joyed. She had an adaptation of\nIbsen’s Peer Gynt, which on the stage runs almost four hours, even if\nyou leave but Anrita’s dance...it was a fifteen minute adaptation.\nYou see how little the untrained writer...the individual who thinks\nthat radio writing is a royal road to romance and riches (which it\nisn’t)*•.knows about the medium. I’m also reminded of the writer who\nremarked that she was collaborating with her husband... she was doing\nthe writing and he was doing the collaborating! First of all, you\nmust know your medium......you must know what can be done and what\ncan’t......George Baker, the famous teacher of playwrighting used to\nremark that it wasn’t the writers business to worry about what could\nbe done...it was his business to \\7rite the words.. .another producer.\nMax Reinhardt used to say, \"Never mind the stage sets...give me the\nwords!” I’ll grant you that the words are all-important In radio, but\nwords to the complete exclusion of the microphone or radio medium, as\nfar as most producers are concerned can stay on the paper...let me\nread you a synopsis of a radio drama..it’s the easiest way to explain\nwhat I mean........ This is called (and it actually came across my\ndesk) \"The VVhitfords go th the Movies\"*\nJoe and Jane have just finished dressing to go to the movies*"
}