{
  "id": "d1655-9",
  "text": "E.B.U. Review contains a paper by Dr. P. E. Axon\nof the Engineering Research Dept, of the B.B.C.\nwhich gives technical details of this equipment\nThe B.B.C. version uses ^-inch wide magnetic\ntape running at a tape speed of 200 inches per second,\nthus a 20}/2-inch reel of tape is required to record a\n15-minute program. Three tracks are laid down\nlongitudinally on the tape, two of the tracks record\nthe video signal and the third track records the ac¬\ncompanying sound. The three heads are mounted in\na single stack so that sound is in sync with picture.\nA second head stack permits continuous monitoring\nof sound and picture.\nIn the B.B.C. system, the video signal is split into\ntwo frequency bands, 0—100 kc and 100 kc - 3 me.\nThe 0—100 kc video band frequency modulates a\ncarrier which is recorded on one track. The higher\nvideo band from 100 kc - 3 me is recorded on the\nsecond video track in a conventional manner. The\naudio signal also modulates an FM carrier of 250 kc.\nIn the recording mode, a servo system locks the\nspeed of the capstan to the frequency of the 50 cycle\nAC supply by use of a light source, photo cell-dc-amp-\nlifier combination. In the reproduce mode, the speed\nof the capstan is controlled by comparing the re¬\ncorded 50 cycle synchronizing signals with the TV\nstation’s sync signals to derive a correction voltage.\nIn addition to an erase head, there is also a cueing\nhead which has been added to assist in editing taped\nprograms. This editing system is subject to further\ndevelopment. At present the cue head is fed through\na separate recording amplifier from a 30 kc oscillator.\nThis frequency is used as a “marking” device by pres¬\nsing a “cue” key at the point desired for cutting. This\ncauses a 30 kc burst to be recorded on the sound\ntrack, which does not interfere with the subsequent\nplaybacks of the tape at normal tape speed. This\n“mark,” however, does produce an audible signal\nwhen the tape is moved slowly past the reproducing\nhead to provide a way of finding the point marked.\nThe 30 kc signal may also be modulated by a voice\nsignal giving editing instructions or it can be AM\nmodulated by vertical sync pulses so that the precise\ncutting point on the tape may be located. A splicing\njig is provided to assure accuracy in joining the cut\nends of the tape together.\n*****\nWhile we are not aware of any educational FM\nstation using multiplex transmission, in the future\nthis type of transmission might well be used in\nstereophonic broadcasting. The FCC is taking an¬\nother look at multiplexing and attempting to de¬\ntermine whether additional uses are feasible, ap¬\npropriate, or should be permitted in the FM band.\nWritten comments are invited covering seven\nspecific applications of FM multiplex under Docket\nNo. 12517. These should be filed on or before Sep¬\ntember 2, 1958.\n*****\nWe have an equipment “buy” for an educational\nstation planning to go on a reserved UHF channel.\nThis is equipment for a complete UHF TV station\nand includes the following:\n1) One Continental 1 kw UHF transmitter\n18) Chan, diplexer and approximately 400 feet of\ntransmission line\n2) One G.E. helical an¬\ntenna\n3) Two GPL image or-\nthicon camera chains\n4) One GPL PA 505 vi-\ndicon film camera\n5) Two GPL PA 100\n16mm projector\nIt also includes sync gen¬\nerator, switcher, master mon¬\nitors and other miscellaneous\nequipment. This station was\nin operation until June 20,\n1958 and the equipment is\nbeing sold on an as is, where\nis, condition. The price is\n$25,000 for the lot. If you are\ninterested in the purchase of\nthis equipment contact the\nwriter of this column.\n10\nOmaha, Nebraska\nNEWSLETTER"
}