{
  "id": "d796-42",
  "text": "September 10, 1962\nDr. Harry J. Skomla\nProfessor of Radio and Television\n24 Gregory Hall\nUniversity of Illinois\nUrbana, Illinois\nDear Harry%\nIn answer to your scribbled set of interrogations, I\nhasten to supply answers of a sort. (If you have forgotten\nwhat the questions were, it’s Just too badi).\n1* This was merely the working of the cyclic-response\nmechanism: growing tensions followed by a blowoff, followed\nby a period of innocuous desuetude. Evidently Riblcoff got\nthings into such a muddle that he thought it would be the\nlesser of evils to get Into the Senate. We don’t know much\nabout the new man, except that he was instrumental In bringing\nsome order out of the chaos in Cleveland so they can apparently\ngo ahead now. Walter evidently felt that he could no longer\ncompromise his principles with decisions that were being made\nabove him and which he had to accept whether he liked It or\nnot. He chose, therefore, to be a free man and go back to the\ngroves of academe. He probably will be succeeded by Seth\nSpaulding, who Is a good man and is Walter’s own choice as his\nsuccessor.\n2. Lee Dreyfus more or less succeeds me as Manager of\nWHA-TV. There is still room for me somewhere in the total\nsetup, if I choose to come back next year. The sudden ascendency\nof ray friend Harrington to the Presidency of the University\nof Wisconsin, has altered my outlook a bit. When It was an¬\nnounced that he was going to the University of Hawaii as Its\nPresident, I about decided that this had tipped the scales in\nfavor of my staying in Washington. Now I must re-evaluate in\nterms of this new development and what Harrington’s adminis¬\ntration might do to really advance television at Wisconsin. Lee\naccepted the job with the understanding that I might return,\nbut that there would be room for both of us. Lee will teach\npart time In the Speech Department. McCarty stays on as Director\nof the Division of Radio-Television Education, of which WHA-TV\nis a part."
}