{
  "id": "d796-78",
  "text": "THE OHIO STATE UNIVERSITY\nTELECOMMUNICATIONS CENTER\nRichard B. Hull, Managing Director\nWOSU TELEVISION\n2470 North Star Road\nColumbus 21, Ohio\n:rs\nFebruary 22, 1963\nMr. William G. Harley\nPresident, NAEB\n1346 Connecticut Ave„,\nWashington 6, D.C.\nDear Bill:\nAfter receiving your personally typed letter which arrived here February\n18th, I called together a small committee to review this signal example\nof manual dexterity and linguistic skill. It was the committee^ unani¬\nmous opinion that you should not only further pursue your exploration of\nold English and ancient Vedic, but in view of your quick and remarkable\ngrasp of this area of scholarship that you also turn your attention to\nSanskrit and the irregular verbs in Beowulf as an imperative next step.\ni agree with your suggestion that there is little point in proceeding with\na partial meeting of the Executive Committee in Chicago on the 16th and go\nalong with your suggestion that you, John S. and I meet in New York on the\nafternoon of the 19th. We can meet informally with Miles at Chicago.\n(Talked with him yesterday and he feels Sunday afternoon about 1:00 p.m.\nis the time to do it—I agreed tentatively but am not completely sure I\ncan make it this early in the day. Will try, however, to do so). We\n(you and l) will have to clear out of Chicago before the Region III meet¬\ning is over on the 19th probably around noon. When you return indicate\nwhat time you, John, and I will meet and what time we meet with the\naffi1iate group.\nLater we can have a full dress meeting with Kager et al with more time and-\na more complete agenda.\nThe new governor and his cohorts are giving state agencies a continuing\nseries of traumatic experiences—a 9.1 budget cut, dismissal of 4000 em¬\nployees, etc. All of this has not helped my mental convalescence in this\npost hospital period of seat cushions and non-phi1osophica1 contemplation.\nHowever, I am progressing nicely, and my only real complaint is frustration\nthat my energy level did not automatically snap back to full speed ahead.\nSincerely\nRichard B. Hul1\nRBH:rc\nWOSU, WOSU-FM, WOSU-TV • Office of Instructional Radio-TV • Ohio School of the Air • Institute for Education by Radio-TV • Teaching Aids Laboratory"
}