{
  "id": "d819-108",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVICE-PRESIDENT\nCRAYDON AUSMUS\nWUOA, University of Alabama\nUniversity, Alabama\nTREASURER\nFRANK SCHOOLEY\nWILL, U. of Illinois\nUrbana, Ill.\nEXECUTIVE DIRECTOR\nJAMES MILES\nGREGORY HALL, U. of Illinois\nUrbana, Ill.\nGENERAL COUNSEL\nMARCUS COHN\nCafritz Building\nWashington, D. C.\nREGIONAL DIRECTORS\n☆\nRegion I\nPARKER WHEATLEY\nWGBH, Lowell Institute\nBroadcasting Council\nBoston, Mass.\nMaine, New York, Connecticut, New\nHampshire, Massachusetts, Vermont,\nRhode Island, Pennsylvania, New\n, Jersey, Delaware and Maryland.\nRegion II\nALVIN GAINES\nWABE, Board of Education\nAtlanta, Ga.\nVirginia, West Virginia, Alabama,\nKentucky, Tennessee, North and\nSouth Carolina, Georgia, Florida\nand Mississippi.\nPRESIDENT\nSEYMOUR N. SIEGEL\nWNYC, Municipal Broadcasting System\n2500 Municipal Building\nNew York 7, N. Y.\nMr. Graydon Ausnius\nStation WUOA\nUniversity of Alabama\nUniversity, Alabama\nDear Gray don:\n4 February 1953\nI had a pleasant and uneventful flight back to Minneapolis,\nlanding around 9:30 Friday evening with the temperature in the\nmid-fcventies. Twenty—four hours later the temperature was somewhat\nbelow zero: it made me think of the Southland and our projected\ntrip to the Gulf.1\nI am still fighting the effects of the flu. Our program\ndirector, \"Bun* Dawson, and our chief engineer, Bert Holmberg,\nwere out most of the week I was in New York; and the naps I felt\ncompelled to take last Saturday and Sunday — rest during the day\nis distinctly the exception with me — suggest that perhaps I should\nhave stayed home and slept instead of going to New York.\nRegion III\nWALDO ABBOTT\nWUOM, U. of Michigan\nAnn Arbor, Mich.\nOhio, Michigan, Indiana, Illinois\nand Wisconsin.\nRegion IV\nRICHARD B. HULL\nWOI, Iowa State College\nAmes, Iowa\nIowa, Minnesota, North and South\nDakota, Nebraska and Wyoming.\nRegion V\nJOHN DUNN\nWNAD, U. of Oklahoma\nNorman, Okla.\nMissouri, Kansas, Colorado, New\nMexico, Oklahoma, Arkansas, Texas\nand Louisiana.\nRegion VI\nALLEN MILLER\nKWSC, State College of\nWashington\nPullman, Washington\nMontana, Washington, California,\nIdaho, Oregon, Nevada, Arizona,\nUtah and Territory of Hawaii.\nDIRECTOR OF STUDIES\nDALLAS W. SMYTHE\nIllinois University Communica¬\ntions Research Institute.\nUrbana, Illinois\nSECRETARY AND\nPUBLICATIONS EDITOR\nBURTON PAULU\nKUOM, U. of Minnesota\nMinneapolis, Minnesota\nLooking back on the thirgs we discussed in New York, I don't\nhave much to write here that I didn't tell you there. So far as\nthe Fulbright set-up is concerned, I think the point is for you to\nsynthesize the written data you picked up in New York and write a\nnotice based upon that, sending out also dittoed copies of the\nFulbright personal data sheets.\nI believe we should recommend three people for each of the\nthree posts for the following reasons: the letter from their\nsecretariat suggests it; it is very possible one or more of our\nsuccessful applicants may have to withdraw for reasons personal\nor professional at home; and because there is always a chance\nthat one of our Fulbright nominees may either be taken ill before\nhe can leave for abroad, or may not pass the physical examination\nwhich is a part of the procedure for those chosen as either regulars\nor alternates.\nI think your letter also should point out the desirability\nof language proficiency. When our committee makes its choices,\nI don't think language should be an absolute barrier; however,\ntake the example which I gave during the discussion in your room —\nI would prefer Mac McCarty with a smattering of French and Italian\nto Joe Doakes who might speak those languages fluently but know\nlittle or nothing about the American educational broadcasting\nestablishment. The notice, therefore, should stipulate that pro¬\nficiency in the language of the country concerned will be weighed\nheavily but should not imply that proficiency is absolutely necessary\n(in view of the fact that we might in the last analysis take a man\nlike Mac without a knowledge of French or Italian rather than a man\nlike Doakes with much of it.)\nRepresenting non-commercial, educational, radio and television stations, workshops, and production\ncenters, owned and operated by colleges, universities, school systems and public-service agencies."
}