{
  "id": "d819-109",
  "text": "Mr. Graydon Ausmus\n2\nMonday when I got hack to the office, I found waiting for me copies of our\nmemorandum to the Television and Hadio Center Advisory Committee. I have already\nmailed copies to you, Dick, George, and Mac.\nI think I mentioned to you in New York that the Center wants a formal\napplication from us for the second year's grant-in-aid program. I assume you\nwill he taking care of this.\nSo far as the negotiations in Washington with the State Department and\nCongress are concerned, I still am not quite clear. In the discussions that\nGeorge, Hay don and I had Thursday night after you left us, I stated very clearly\nthat it seemed to me that what was happening was that George and Haydon were\nsort of free-wheeling in Washington and hy indication at least committing NAEB\nto various positions in regard to the activities of the State Department's Inter¬\nnational Information Service. They insisted that we were under no obligation to\naccept any of the things they might arrange, hut I nevertheless repeated my objection\nbecause I feel that what they do is hy implication at least involving our whole\norganization.\nI believe that at our next executive committee meeting this matter should he\nreviewed, and that it also should he on the agenda of our next Board of Director's\nsession.\nWhen I told Frances about the projected trip to Montgomery and the coast,\nshe was very enthusiastic; and we are already making inquiries about travel arrange¬\nments. I trust that your wife can he torn free from the University of Alabama\nfor a few days' outing; however, I want you to feel free to cancel any and all\narrangements in the event that your family or professional commitments render it\nadvisable for you to do so.\nAs usual I look back on our NAEB sessions with the feeling that we tried to\ndo too much in too little time with the result that we didn't do anything just as\nwe wanted to do it. Also, we were deprived of much opportunity for relaxed personal\nassociation. I feel the same way about this one, too, yet it was fun, and I think\non the whole was a most fruitful session.\nWith best personal regards,\nYours sincerely,\nBP :cjm\n(dictated but not read)\nBurton Paulu\nVice President"
}