{
  "id": "d819-11",
  "text": "-10-\nLevinthal, S., \"Daytime Radio. Programs as a Medium for Book Publicity.\"\nPublishers' weekly, CLV (June 18, 19l*9), pp. 96.\nRovner, Samuel, \"Radio's BAB Takes Agressive Sales Tack”Editor and Publisher,\nLXXXII (September 10, 19l*9), p. $0. -—-\nWolfe, C.H., \"How to Evaluate Radio Station as Advertising Media.\" °rinters Ink\n(January 21, 19i*9), pp. 1*6 /. -\n-, Modern Radio Advertising. New York: Funk and Wagnalls in cooper¬\nation with editors of Printers Ink, 191*9.\n6. Occupations and Employment\nAnonymous, \"Radio Artists: Income and Employment Survey Released.\"■Broadcasting\nXXXVI (May 2, 19h9), o. 66. --\n—--, \"Radio's Payroll and Operating Costs.\" Broadcasting, (January 16,\n1950), pp. ll* /.\nLarson, R.D., et al., \"Employment Outlook in Radio and Television Broadcasting\nOccupations.\" U. S. Bureau of Labor Statistice Bulletin, CMLVIII (191*9),\nLerner, L.L., \"Television and Occupational Information.\" Occupations, XXVIII\n(February 1950), pp. 229-301.\nRanson, Jo, and Pack, Richard, Opportunities in Radio. Vocational Guidance\nManuals, Inc., 191*9. P. 96.\nWood, H.,\"Employment and Unemployment of Radio Artists.\" Monthly Labor Review\nLXVIII (my 191*9), PP. 5lU—16. 5-'-3\nWood, Helen, and Larson, Raymond D., \"Annual Earnings of Radio Artists in 19li7.\"\nLXIX, (September l9l*9), op. 268-72.\n7. Research and Audience Impact Studies\nAnonymous, \"Broadcast Measurement Bureau, Inc.: 19h9 Urban, Rural Non-Farm,\nand Rural-Farm Radio Ownership.\" Western Advertising, (October 19U9), p.9.\n-.> \"CBS »IAMS» Revealed.\" Broadcasting, XXXVI (January.21*, 191*9), d. 23.\n-, Farm Radio in Illinois. Urbana: University of Illinois, .October 191*9.\np. ii / To::\n-FM Radio Listening Survey, Tulsa, Oklahoma. Tulsa: University of\nTulsa, Mayl9i*9. • -P. 18.-\n-5 \"Fortune Survey: The Relative Appeal of Radio and Movies: A Look\nat Leisure.\" Fortune, (March 19i*9), pp. 39-1*0 /. .-\n> Listening Habits, RpaC. Manhattan: Kansas State College, October 19l*9»\n* Radio Index Service, Introduction to the NRI Complete Report.\nChicago: A. C...Meils-en Cpv, 19U9.“V26.' \"..X --—-- —-"
}