{
  "id": "d819-120",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF THE VICE PRESIDENT\n18 February 1953\nMr. Graydon Ausmus\nStation WUOA\nUniversity of Alabama\nUniversity, Alabama\nbear Graydoni\nI have just finished looking over your letter of February 13 to John Dunn.\nI am not fully informed on all of the points that you comment on — in some\ncases you were replying to points raised by John in his letter to you which I did\nnot see. But I did want to dash off a few paragraphs reporting my reactions to\nthose aspects of your exchange of correspondence which are meaningful to me.\nFirst of all, I should say that generally speaking John has been unduly con¬\ncerned lest NAEB lose its identity. I an all for maintaining the identity of the\norganization, but I don't think that the way to do ihat is to limit our cooperation\nwith other groups in big enterprises. So long as we continue to operate on a small\nscale there isn't much danger of our being swallowed up by anybody else. But as\nsoon as we move into the national field in as big a thing as television, we of\ncourse do run that risk. The problem is that of contributing to a big national\ndevelopment so importantly that we become a leader in the big movement rather than\na minor part of it.\nAs far as the \"great and exalted Executive Committee\" is concerned, John is\ndefinitely off ona rampage again if he is writing about that! The only problem\nthere is that nejM-ar^konvinced too many people that h&xxs the Executive Committee\nis trying to run the organization without reference to the Board of Directors or\nother members. Actually we are not, and certainly we are all doing our best to\ninvolve more members in committee activities than ever before.\nI agree with you — as I am sure will all of our officers -S^he desirability\nof bringing more people into the organization. Noone regrets more than I do the\nway in which the Board of Directors has continued through the last few years with\nlittle or no change of membership. The present Board, for example, is exactly the\nsame as last year's except for the addition of Wynn. The question is how do we\nbring in more people? I think the answer is, involve more and more people in\ncommittee activities so that (a) they become acquainted with the problems and\noperations of the organization, and (b) we become more aware of their capabilities.\nThen we should elect each year one or two officers and/or directors on whom we\nare \"taking a chance,\" in the sense we don't know exactly what they can do but\nthink the opportunities for their developing are pretty good. After all the only\nway to find out if a man can really do something is to give him a chance to try,\nI wouldn't suggest we elect a president, vice president, secretary or treasurer\nmerely on faith — such an officer must have proved his ability to meet the problems\nof the association; but we can elect some new directors each year and from them\nchoose our officers.\n•ton Paulu, Vice President"
}