{
  "id": "d819-124",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nMr. Gray don Ausrnus\nStation WUGA\nUniversity of Alabama\nUniversity, Alabama\nOFFICE OF THE VICE PRESIDENT\nKUOM, University of Minnesota\nMinneapolis lh, Minnesota\n18 May 1953 *\nDear Graydon:\nYour letter of May 15 to Frank Schooley arrived this morning. I am much\ndistressed at the thought that you may have to miss the Ann Arbor meeting on\naccount of your legislative hearings, but I certainly understand your problems\nand will be the last to criticize you for staying home under those conditions\nand the first to defend you against anybody who did offer criticism 1 Good luck\nto you in the Alabama hustings, and may you be somewhat more successful than we\nin Iowa, Wisconsin and Minnesota have been at getting legislative fundsi\nWe of course will proceed with the Executive Committee meeting in Ann Arbor\neven though you cannot be present. I trust that you are writing to several of us\nin the group listing the problems and facts with which we should deal at any\nExecutive Committee discussions we have.\nI note that you quote at some length Bill Griffiths’ insistence on specific\ndata in requests. This is not at all surprising to me? in fact following the\nWardman Park meeting in a little informal talk I had with Bill just before he\nhad to leave for the airport he told me at some length about his feeling that\nNAEB proposals had been lacking in specificity. One of the reasons that I sug¬\ngested the week-long committee meeting in the North woods in August was because\nI thought it would give us a chance to get down to more detail in our dealing\nwith the work of the Center. This of course is not to say that our NAEB proposals\n(as opposed to policy suggested by the Center) should be delved until August.\nBy this time you have received two copies of my letter relative to Fulbright\nassistance funds. As of yet I have not heard from Young directly or indirectly\nas to the state of our candidaojfi However in view of what he told us in Washington,\nI think I should make my plans on the basis of going to England at least until I\nhear to the contrary. This involves among other things the financial problem;\nand if we cannot raise any money from Kellogg, I shall have to look for some some¬\nwhere else. In view of this fact do you think you should send a copy of my letter\nto you along to Van Duyn? That is, assuming that you cannot go to Battle Creek\nnext week to deliver it yourself. What is your feeling about this?\nI got cost data from a very nice lodge with which I am acquainted this morning.\nIt appears that we could meet for a week up there for two or three hundred dollars\nless than either of our meetings in New York cost us. (I got New York cost data\nfrom George Overton, so I am sure of my figures here.) For this reason I an writing\ntoday to Scotty (carbon copy to Griffiths) relative to the August meeting. I sug¬\ngest you hold August 2-8 free until I hear from them one way or another."
}