{
  "id": "d819-135",
  "text": "5\nms&nsMiimm pbqukams\nThr©u$*out the year many individual programs end series will develop at XPFA,\nyet at the present time it is not possible to predict the exact nature and con¬\ntent of those programs. They will Include interviews and panels with persons\nprominent in many different aspects of public affairs, the sciences and the arte.\nKPFA a* intaint program lines to various auditoriums on the campus of the Uni¬\nversity of California find the Station has permission to record lectures, discus¬\nsions, etc. held under the auspices of the University. Many of the progress thus\nobtained are valuable program material for educational broadcasters. It Is\nestimated that there will be at least ten program hours available to IPFA and\nthe 8A>'.3 Tape network through these means. Potential program series include a\nseries of lectures by outstanding scientists under the general toole \"Modem\nPhysics for scientists and Rinsers’*. Another potential program series includes\na group of five lectur on astronomy to be given b; the Bobel Prise winner. Dr.\nHrrold CJrey of the University of Chicago. The procedure on these programs is to\nedit the recordings ©f the lectures, deleting those aspects of each talk which\ndo not lend themselves to broadcasts for the general public.\nII. Si XIAL PTOSUM FBPJRCTS\nKPFA is currently taking steps toward the establishment of a number of subsidiary\nprojects which would, In turn, result in programs for broadcast over 3CPFA and\nwould also be made available to the Tape Network of the BASS* Th-se program\nprojects will have independent operating budgets entirely separate from KPFA1#\ngeneral operating budget. Program production costs for these projects are not\nincluded in the cost summary set forth in this Memorandum. However, the series\nnoted here are indicative of the type of program material which will become\navailable through KPFA*e production center.\nC0KFTO3TCK OK rBOBLSMS OF COMMUNICATION B^;'I TH% yA.ST AFP WK3T: The pro-"
}