{
  "id": "d819-14",
  "text": "-13-\nSieomann, Charles A., Radio, Television and Society. New York: Oxford\nUniversity Press, 1950. “W vii / UlO.\nSkornia, Harry J., Lee, Robert H., and Brewer, Fred, Creative Broadcasting.\nNew York: ^r entice -Hall, Inc., 1950.\nb. Production and Acting\nBarnouw, Eric, Handbook of Radio Production: An Outline of Studio Techniques\nand Procedures in the United States. Boston: Little, Brown and Co., 19l*9.\nDuerr, Edwin, Radio and Television Acting: Criticism, Theory and Practice.\nNew York: Rinehart and Co., 191*9^ P.1*17 •\nWaters, C., \"Singing Before the microphone; ed. by A. Comfort.\" Etude,\nLXVII (June 191*9), pp. 35l /.\nc. writing\nCousins, Norman, ed., Writing for Love or Money. New York: Longmans, Green,\n19h9- P. lx / 278\n' Cowgill, Rome, Fundamentals of Writing for Radio. New York: Rinehart and Co.,\n191*9.\nDoyle, E., \"Air-Borne.-\" Writer, LXII (February 19l*9), pp. 1*7-9.\nFahey, John R.,, \"How to Hake News Cony Easier for Announcers.\" Quill, XXXVII\n(March 191*9)7 p. 7.\nFifield, If., .\"Golden Corn; Dossier on Radio (and Television) Markets.\"\nWriter, LXII (August 19l*9)* p. 61*.\nKaplan, Milton Allen, Radio and Poetry. New York:’ Columbia University Press,\n19U9. P. lie / 333.\nKingson, Walter K.,’ Essman, Phil, Mintz, Arthur, et al.', \"Four Ways to Drama.\"\nHollywood Quarterly, IV (Winter 19h9) > dp. 109-1*1*.\n. -Maloney, Martin, The Radio Play. Evanston, Illinois: , Student kook Exchange,\n191*9. P. iii / 2i*i; r“\"\n• McDonald, J., \"What’s Wrong With Your Radio Scripts.\" Writer, LXII (February\n191*9), pp. 53-1*.\nNail, W. A., \"Literature’s Orphan Child.\" Quarterly Journal of Speech, XXXVI\n(February 1950), pp. 88-91.\nRichardson, Lou, and Callahan, Genevieve, How to Write for Homemakers.\nAmes; Iowa State College Press, 19l*9» .\nWylie, Max, Radio and Television Writing. New York: Rinehart and Co., 1950.\nd. Script Anthologies\nAnonymous,,,\"Why Be Afraid? ; Story of a Fearless Man,.St. Francis de Sales.\"\n.Catholic 'School Journal, XLIX (February-191*9), pp. ,6o-l."
}