{
  "id": "d819-143",
  "text": "NATIONAL ASSOCIATION\nOF\nEDUCATIONAL BROADCASTERS\nMr* Graydon Ausmus\nc/o Agiph Steetie\nJoint Committee on Educational television\n1785 Massachusetts Avenue N. W#\nWashington 6 D, C,\nDear Graydon:\nOFFICE OF THE VICE PRESIDENT\nKUOM, University of Minnesota\nMinneapolis lii, Minnesota\n2 June 1953\nYesterday*s mail brought several letters from you, one of which says that you\nwill be in Washington most of this week. Accordingly I am addressing you there.\nThe agreement with KPFA looks good. I see that the money is being given to\nNAEB, and we are contracting with KPFA, an arrangement which appeals to me.\nYour letter of May 29 to Louis Hill states that you are \"asking the Executive\nCommittee of NAEB to function in the supervision of these projects and herewith set\nour meeting date for 9:30 a.m., June 21, in the C0nrad Hilton Hotel in Chicago.**\nI assume that the proceedings in the Conrad Hilton will be finished in time for us\nto get up to Madison that evening for the educational television seminar.\nfielative to the representation of NAEB by Earl Wynn at the Film Producers*\nAssociation meeting, this looks good to me, and I am sure Earl will represent us\nably. I assume there is enough money in the treasury to cover thisl That*s my\nonly possible reason for hesitation, but I vote \"yes** subject to the availability\nof funds.\nYour letter of May 29 brings encouragement concerning the projected meeting\nwith Van Buyn. You state that \"Frank and others feel that we must secure funds\nfor all three of our men on the same basis.\" For the sake of the record let me\nrepeat here what I think I told you before: I of course am not requesting special\ntreatment. I think that if there is a possibility of obtaining dollar aid for the\npeople who go to Paris and dome, that should be done. If there is any difference,\nit comes from the fact that the Kellogg Foundation apparently is willing to contri¬\nbute to the expenses of a man going to England and not to one going to France or\nIraly. But if Kellogg or some other foundations will make like contributions to\nthe expenses of the men going to the other two countries, they should be requested\nto do so.\nI have also looked through your letter of May 29 to Sy Siegel. I think the\npoint you make in the second paragraph on page 1 is a good one: we are \"morally\nobligated to make every effort possible to secure the additional L.1 thousand from\nsources here and in England as an indication of our willingness to abide by our own\nprinciple and to maintain good faith with the Center.\"\nSee you in Chicago on June 23. Good luck until then.\nYours sincerely.\nBurton Paulu\nVice President"
}