{
  "id": "d819-154",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF THE VICE PRESIDENT\nKUOM, University of Minnesota\nMinneapolis Hi, Minnesota\n26 August 19$3\nMr. Graydon Ausmus\nStation WUCA\nUniversity of Alabama\nUniversity, Alabama\nDear Graydon:\nI have just finished looking over your letter of August 18 to Waldo Abbot\nrelative to his serving as chairman of our Grants-in-Aid Committee. I should\nlike to comment on two questions which it raises: whether or not an institution\nwhich received a grant last year should be eligible to apply this year; and if it\nis proper for someone whose institution is applying for such a grant to serve on\nthe committee.\n1 definitely feel that those who received grants before should not be auto¬\nmatically excluded from receiving them this time. Other things being equal — if\nthings ever are equal — I think we should give preference to those who did not\nget grants rather than to those who did. But it seems to me that a blanket elimi¬\nnation of repeat grants would be undesirable for several reasons.\nInIhe first place, the long range purpose of these grants is to provide\nprograms that could be exchanged anong NAEB members. If we make grants to stations\nwhich cannot turn out good programs merely because those which can turn out such\nprograms received grants the previous year, we are defeating one of the purposes\nof the whole project. Another thing, ihere may be situations where one institution\nwhich is asking for a second grant has a project which is clearly better than many\nof the other institutions who are making application; in this case the grant should\nbe to the best equipped institution rather than to the one which did not receive a\ngrant the previous year.\nI do feel however that it is difficult for anyone to pass upon his own insti¬\ntution and that from the standpoint of the committee members as well as from the\ninstitutions not represented on the ccmmittee, it is preferable that the committee\nbe made up of people who have no personal involvement with pending applications.\nI hope this comment will some wsy hasten the decision of this matter.\nYous sincerely.\nBurton Paulu\nVice President\nBPscjm"
}