{
  "id": "d819-169",
  "text": "COPY\nTHE (London.) TIMES, Monday, January 11, 1954, Editorial\nA Problem in Communication\nThe announcement by the B.B.C. that Sir Oliver Franks will broadcast\nthe 1954 Reith Lectures on tne subject of “Britain and the tide of world\naffairs\" arouses expectant interest. This will be the seventh series of\nReith Lectures, and the recent completion by Professor Oppenheimer of the\n1953 lectures makes it useful to review the enterprise so far as it has\ngone. When the Reith Lectures were originally inaugurated the B.B.C.\nstated that it was hoped that by thoughtful selection of speaker and sub¬\nject the broadcasts would not only be the peak of the B.B.C.’s effort each\nyear in the field of serious talks but would also become a valuable\nnational institution. How far has this hope been realized?\nThe Reith Lectures suffer ffom the drawback of their opportunity.\nThey appeal to so huge an. audiencn.that if they fall short in any way the\nfact is news. Among almost all the most famous long-established lectures\nat Oxford, Cambridge, and other places there are years when the outside\nworld has no knowledge of who the lecturer was, and is completely unaware\nof the fact that the lectures have been delivered. Hot so with the Reith\nLectures. They are an effort to reach a serious, attentive audience, it\nis true, but an audience spread throughout the United Kingdom and counted\nby the million. Of the speakers who have so far been submitted to this\ntest five—Lord Russell, Mr. Robert Birley, Professor J. Z. Young, Lord\nRadcliffe, Professor Arnold Toynbee—have in greater or lesser degree\npassed it. It can, moreover, be said that the marked successes have out¬\nnumbered the moderate ones. If so many could not understand Professor\nOppenheimer’s talks the question arises whether this was not an illustration\nof the frequent failure of communication between scientists and laymen\nto-day.\nFor the Reith Lectures are in essence a problem of communication.\nThis is no new problem. Broadcasting may have in some ways intensified\nit, but the idea of the great minds of the day trying to convey their\nknowledge and ideas to the ordinary man of the day was well established\nin Victorian times. And one has to mention only Hazlitt, Ruskin, Carlyle,\nand Huxley to show that the problem can be solved without “talking down.\"\nThey were Reith lecturers ready-made. If public affairs, politics, and\nscience have become more complicated since their <fcay, there is, due to the\nspread of education, the wider diffusion of the Press, the improvement of\nthe public library, and the B.B.C. itself, a comprehending audience many\ntimes greater now than there was then. Broadcasting, however, presents\nspecial problems of its own. Every broadcast talk is bound to be a three-\ncornered cooperative effort between listeners, speaker, and the B.B.C.\nThis is more true of the Reith Lectures than of any other talks. Ho\ndoubt the B.B.C. will have sought learn some lessons from listeners’\nexperience with Professor Oppenheimer1s broadcasts. The fact that they\ndid not succeed as well as their predecessors should be a challenge and\nnot a discouragement."
}