{
  "id": "d819-172",
  "text": "Mr* Urrayaon ausmus\n-3-\nshould get together to review our experiences; we have been carrying on a\nfairly lively correspondence, but one day's conference would cover far\nmore ground than a ream of letters.\nMy book exchange project is off to a good start. I had Harry Skornia\nask a number of publishers to send me books on radio and television, and\nalso collected material from WOI, JCET, and elsewhere. At the moment,\nfor example, Scupham and his group are inspecting the Levenson-Stasheff\nand Skornia volumes, plus some WOI schooltime materials. Sir George\nBarnes of BBC-TV has received some NAEB publications on TV, as well as\nthe WOI things. Before I leave next summer, I shall have passed this\nmaterial around pretty generally, and shall then leave it on file at the\nBBC and United States Embassy libraries.\nYou may wonder what has become of our hope that BBC will use more\nthan the one or two NAEB shows they have so far carried. The answer is\nthat these are now being monitored in the features department, which is\nthe program supply department here concerned with that kind of program. I\nhad lunch this week with Geoffrey Br id son—known to many of you—who is\nsecond in command, and he personally is apparently the man in the\nposition to decide about them. I urged him to use them all, and he\nassured me he would monitor the rest shortly. We shall meet again soon,\nand I'll keep working on him.\nBy the way, I appeared on a BBC quiz show this week (\"Burton Paulu,\nformerly vice-president of the National Association of Educational\nBroadcasters of America, and Director of the university of Minnesota radio\nstation in Minneapolis\")—and won first pl&eej But alas, no refrigerators,\ndeep freezes, TV sets, or Bolls Boyces• Just a chance to compete again\nnext week, with the standard fee of ten guineas ($30.00) per snow as\nremuneration, van or lose.\nAs all this implies, things go well here. I receive uniformly help-\nful and friendly treatment at the BBC and am having really a wonderful\ntime as I go from department to department getting a line-up on their\nwork. For this reason I request that my comments here on BBC programs\nnot be published or quoted;'they are offered merely to provice information\nto assist the Board in determining NAEB policy with regard to the\nscheduling of BBC programs.\nI might add that if we cannot raise funds with which to implement the\nterms of our present agreement, it is my recommendation that w^reopen\nnegotiations in the hope of continuing an output of BBC shows in any case.\nHave a good time in Ames.*\nYours sincerely,\ncc. John Dunn\nDick Hull\nBui’ton Paulu"
}