{
  "id": "d819-176",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nFebruary 6, 19SU\nDr* Burton Paulu\n11*7 Argyle Road\nEaling, London W* 13\nEngland\nDear Burton*\ntour latter of February 2 is most important and your suggestions more than\nwelcome*\nFirst, I am hereby requesting that Harry get a letter out — or ask the\nChairman of the International Relations Coned ttee to do so — making an appeal\nnow to all MAES member stations to begin thinking in terms of the possibility of\nplacing s Fulbright scholar from either England, France, or Italy next year*\nI thought you were aware that the Board of International Scholarships had\napproved the renewal of the three scholarships w® now have in Europe, and Francis\nXoung has asked me to name a committee to work with the Fulbright Commission in\nV choosing for the Commission scholar® in radio and television to any countries of\nthe world. I will have that committee shaped up in another week* A special com¬\nmittee has already screened applicants for positions next year and has made recom¬\nmendations to the Fulbright Commission*\nAt this point, I would say the £$6,000.GO is out; however, I believe I could\nraise it if I had one full week in New York* In light of the continued flow of\ngood materials from the BBC, I see little point in our attempting to raise such a\nsum. I would not be adverse, however, to a contribution of from £15,000.00 to\n$2$,000.00 to increase the drama output* As the matter stands, I think there Is\nno point in your attempting to negotiate on a smaller fee basis. It would be bet¬\nter for It to be done on sn informal basis from here.\nHave you considered the possibility of doing a commentary, written or recorded,\non the British scene, such as Hovey is doing in Italy? 1 should like to see you\ntry your hand at it on a limited series basis*\nThe past two days I have spent st Alabama Polytechnic Institute with Dick\nHull, where he served as a consultant to the college in helping them make prelimi¬\nnary plans for their TV operations* I leave this afternoon with my family and\nwill pick Dick and Dorothy up In Montgomery for a weekend on the Gulf — after a\nfull year we complete the plans for s Gulf-coast jaunt with the Hulls, which was\nscheduled st the time the Paulas and the Ausmuses went that way. We will stop st\nGulf Shores and spend a day in Mobile and the Bellingrath Gardens. If the weather\nis good, we shall probably go deep-sea fishing tiie second day. wish you and Frances\nwere here to go with us. We still remember very pleasantly our trip to the Gulf\nwith you two*"
}