{
  "id": "d819-178",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nDear Graydon:\n147 Argyle Road\nLondon, W. 13\nFebruary 17, 1964\nYours of February 6th makes it sound as if your life is really\ninteresting these days.* A trip to the Gulf with the Hulls (which\nbrings back memories of our lovely long week-end there), plus the\naddition of educational television in Alabama. It all sounds w nder-\nfuli\nItsb erne hardly possible that my year here is about half over. In of¬\nficial observance of that* event Frances and I a re planning a three\nweek's jaunt to the Continent—the first time we've been more than\naf ew fcours away from London sire e we arrived here in September.\nWe've planned weeks in •uome, Paris and Brussels: Rome and Paris are\nofficially visits approved by and hence to erne extent finane ed by\nthe Fulbright Commissions in those places; the Brussels affair^ ig to\nattend an educational telvision meeting at which Larry and I both\nspeak, ^e'll be gone on that jaunt from about February 27 through\narch 20, which fact I record in case you should want to reach me\nthen: the first week I'll be in ^ome, third in Paris, so I could\nbe addressed in care of Graham and Larry respectively during these\nperici s.\nIn regard to yours: letter of the 6th: I am somewhat more concerned\nthaQ you apparently ajp ut the future of the Bulbright arrangement\nhere. Even though the folks in Washington say OK, the group here\nmust be sold too. There is no dissatisfaction with work in educa¬\ntional broadcasting per se; it is only that there is so much demand\nfrom British schools for experts in other fields, and so little for\npeople in our area. 1*11 be seeing Tgyior next week and will keep\nmy ear to the ground on this; but I would suggest clcs e liaison with\nFrancis IpSP^p' in Washington. Don’t count this as sure yetj\nOne ffitor here is the BBC $56,000. Discussing this with the director\nof the General Overseas Services yesterday (who has North American\nservices under him), I suggested that I would be glaa to help select\nthe bits aa d pieces which are presently being sent to America . (Ap¬\nparently they do and will continue to send Basil Thornton some s tuff\nfor distribution to NAEB or anybody ei e). ftiis suggestion did not\nmeet with any enthusiasim: since we do not pay the piper, we ar4 not\ninvited to help call the tune was, In effect,the reply.\nI did however get the impression that a token contribution might help\nour position. Now, since we do have a leg on that $66,000 rubber, I\nwould ssl ggest conversations between somebody repreentiig NAi-B in\nthe States and Thornton (or me ad BBC here) to give them semthirjg—\nsay $5,000 per year or something. Then our man over here could get\nin on makings few choices; and that would strengthen our hand with\nthe British ommission. It would give us a double & proach: research\n(which is ab6ut the only big project an NAEB man can engage in if the\nBBC here don't care for his he&p in arrangement exchanges); plus the\nprogram exchen ge anglF."
}