{
  "id": "d819-179",
  "text": "-2-\nHelative to your si ggestion t hat I do Ma commentary, written or\nrecorded, on the British scene\": this is a g> od idea, I am cairrently\nwriting up a g> od deal of stuff on broadcasting here; some of this\nmight be done as a spoken piece, but its too early to tell for aare.\nOther subjects might be broadcast about too, I'm not a political\njournalist, and should rather not try to describe tie.- British\npolitical sc ene as Hovey does so well that in Italy; tut there a* e\nother things as well, and X shall think these over while outof the\ncountry the next few weeks, I did a somewhat chatty piece for the ra xt\nNews-Letter on BBC television which you will so on be reading, by the\nway.\nOther things: twice I've appeard on Ask Me Another, a quizz show on\nthe Light Programme which isjtrying to select the \"Brain of Britain.\"\nThese two rounds I've wcnj I reccrd the third time on April 4*, . •\nI've suggested that I give three talks on American Broadcasting on the\nHome Service, though have had noanswer yet. But they need something\nlike that, sl nee American broadesting is dragged into the current\ntg controversy so often, and seldom to its credit. ... Upcoming are\ntalks at the Univ of Bristol and Univ of Liverpool on the sane subje ct.\n, , , , The Listener ran a somewhat erratic piece on the recent\nUNESCO report on world tv, which dealt mostly with educotionalt v in\nUSA. I wrote—and got published—a correcting letter (tfi ich I am s end¬\ning to Harry in case hew ants to put it in the News-Letter.\nBefore I sign cff: pleas do not indicate to Young that I have b een\ndiscussing this with Taylor and am concerned about what may happen here.\nPlease do tnot mention my talks with the folks here at BBC in the event\nanybody from NAEB sp proaches Thornton, since our chats were \"off the\nrecord\" and confidential—the BBC man's espcially.\nAnd, since I shall now be sending along News-Lettac copy, plea® do not\nquote from this or any other of my letters, in the News-Letter.\nWith best personalr egards,\nYours sincerely,\nBurton Pailu\ncc. Harry Skornis—-\nPS. Recently, li& ening to a new Home Servx e news analysis program\ncalled \"At Home aid Abroad,\" I heard Si Siegel discussing the Bricksr\nAmendment, in a short talk previously short-waved and recorded from\nNY. A good job, too, as I write aid told him."
}