{
  "id": "d819-20",
  "text": "-19-\nGaynor, I. L., ’’Radio Enriches the English Curriculum.” High Joints, XXXI\n(September 19b9)j pp. 66-71.\nGlore, V. R., ’’Radio for Teachers.” Montana Education, XXV (April 19ii9),\npp. Il*-l5.\nHenderson, K. B., and Fulton, M. ^., ’’Critical Thinking; Geometry Classes Use\nRadio Programs.” Clearing House, XXIV (November 19l*9), pp.195-8.\nJenny, G. F., \"Teacher’s Hanuals for Radio Programs.\" Association for Edu-\ncation by Radio Journal, VIII (January 19^9), pp. 96\"^\nKaplan, Milton A., \"Radio Flay as an Introduction to Grama.” English Journal,\nXXXIX (January 1950), pp. 23-6.\nLevi, I. J., \"Evolution of a Radio Broadcast.” Educational Forum, XIII (May\n19k9), pp. U55-6. -\nLippe, Paul, \"He?; Commentary in the Secondary Schools.” Association for\nEducation by Radio Journal, IX (May 1950), pp. 10l*-5.\nMcAleer, C. G., \"Radio as an Aid in Teaching High School Subjects.” National\nCatholic Education Association Proceedings (19l*9)\nMcGovern, Verita H., \"Radio, the Fourth R.\" Instructor, LIX (January 1950),\np.25.\nMcGranahan, R. S., \"Rural Children Listen and Learn.\" Nation’s Schools, XLIII\n(May 19U9), op. 58-9. “\nMcKay, G. R., \"Radio as a Teaching Aid in Agricultural Education.” Association\nfor Education by Radio Journal, VIII (May 19l*9), pp. 102-3.\nMcKenzie, A., \"Classroom of the Air Waves.” Practical Home Economics, XXVTI\n(June 19U9), pn. 313 A\nMorgan, Clarence M., \"Growth of a New Dimension.” Teachers College Journal,\nXXXI (December 19U9), P 5U-6.\nNovokovsky, Gertrude, \"Radio and Language Arts.\" Education, LXX (December\n19U9), PP. 255-9 -\nOmmanney, Katherine Anne, and Ommanney, Pierce C., The Stage and the School.\nNew York: Haroer & Brothers, 1950. P . xvi / 571.\nPeterson, E., \"Radio Motivates Teaching of Reading.” Association for Education\nby Radio, VIII (March 19h9), p.75. -\nPierre, Sister, \"Make Your ML>e Pattern Fit.\" Catholic School Journal, L\n(May 1950), pp. lUU-5.\nQuatprocki, A., \"Radio and Social Studies.” Pittsburgh Schools, XXIII\n(January 191*9), pp. 77-9.\nSaunders, K. M., \"Among Ourselves; with Summaries of Scripts for In-School\nPrograms.\" English Journal, XXXVIII (January 19l*9), pp. 33-7.\nSchofield, Edward T., Audio-Visual Ideas for the English Teacher. Newark:\nBoard of Education, New jersey!"
}