{
  "id": "d819-24",
  "text": "-23-\nArmfelt, R. M.j ’’School Broadcasting in Britain.” School and Society, LXIX\n(January 2.2, 19i|9), pp. 58.60.\nCallaway, Joe A., ’’School Broadcasting in the United Kingdom.” Association\nfor Education by Radio Journal, IX (January 1950), pp. 5U-5.\nChester, Giraud, ”How Good is British Radio?” Quarterly Journal of Speech,\nXXXV (October 19U9), pp. 320-8.\nCoase, R. H., British Broadcasting; A Study in Monopoly. Cambridge: Harvard\nUniversity Press, 1950. ' P. ix / 206.\nEwer, W. N., ’’Mass Persuasion through the Microphone.” BBC Quarterly, III\n(January 19h9), pp. 199-20U.\nGreen, John, ’’’Farm Radio' in the English-Speaking I/or Id.” BBC Quarterly, III\n(January 19)49)» np. 205-11.\nGrisewood, Harmon, Broadcasting and Society. London: S.C.u. Press, November\n19U9.\nHale, L., \"Secret of Itma.” Spectator, CLXXXII(January 21, 19U9), p. 76.\nJones, I., \"British School Radio Emphasizes Current Affairs.” Association\nfor Education by Radio Journal,\nKavanagh, T., Tommy Handley. Hodder & Stoughton, 19i#. P. 255.\nMoor, P., \"BBC's Third Program.” Theatre Arts, XXXIV (May 1950), pp. 51-2.\nMottram, V. H., \"Purpose in the Broadcasting of Science.\" BBC Quarterly, III\n(January 19U9), pp. 223-8.\n^edrick, G., ed., World Radio and TV Annual. London: Sampson Low, Marston and\nCo., October 19W~.\nPickles, W., Between You and Me. Werner Laurie, 19!#. P. 223.\nPostgate, R. S., \"Broadcasting for Schools.” Fortnightly, CLXXIII (New Series\nCLXVII) (February 1950), pp. 99-106,\nRatcliffe, S. K., \"The Influence of Broadcasting on Public Speech.\" BBC\nQuarterly, III (January 19^9), pp. 212-16.\nReith, J. C. W., Into the Yfind. Hodder & Stoughton, 19h9• P. 536.\nSchwartz, G. L., \"Economics on the Air.” BBC Quarterly, III (January 191*9),\npp. 193-8.\nSomerville, T., and Brownless, S. F., \"Listeners' Sound-Level Preferences.”\nBBC Quarterly, III (January 19U9), pp. 2U5-50.\nStonier, G. W., \"Voces Intimae; An Appreciation of Itma.\" New Statesman and\nNation, XXXVII (January 29, 19U9), pp. 100-1.\nVandercook, J. W., \"British Radioj Without Commercials and Without Machine\nGuns.\" Holiday, V (May 19^9), PP. 16-18."
}