{
  "id": "d819-33",
  "text": "Bender, J. F., \"Do’s and Don’t’s of Television.” Science Digest, XXIV\n(October 1949), pp. 22-5.-\nBryson, Lyman, and Murrow, Edward R., ”You and Television.” Hollywood\nQuarterly, IV (YJinter 1949), pp. 178-81.\nCapp, A1 and Cousing, Norman, ’’Television 1950: Is It Good or Bad.” Town\nMeeting, (January 3, 1950), pp. 1-14.\nCerf, Bennett, ’’Trade Minds? New Bugaboo that Has Book Publishers Meeping«”i\nSaturday Review of Literature, XXXII (February 26, 1949), p. 4.\nCousins, Norman, ’’The Time-Trap.” Saturday Review of Literature, XXXII\n(December 24, 1949), p. 20.\nCoy, Mayne, ’’Look Out for Television.\" Rotarian, LXXIV (March 1949), pp. 8-11.\nCrosby, John, \"Tihat’s Television Going to Do to Your Life?\" House Beautiful,\nXCII (February 1950), pp. 66-7 /•\nEmerson, R. W., secundus, \"Television's Peril to Culture.” American Scholar,,\nXIX No. 2 (1-950), pp.. 137-40. • '\nErnst, Morris L., \"TV in Relation to the Public Interest? Government Subsidy?”'\nVariety, CLXXIII (January 5, 1949), p. 95.\nFranken, Merritt,- and others. Queens College Forum: Television, a Problem\nfor Parents and Others. Flushing, L. I.: Queens College, 1949. P. 7.\nGould, Jack, \"Yihat Is Television Doing to Us?\" New York Times Magazine,\n(June 12, 1949), pp. 7 /? Discussion. (June 26, 1949), p. 4.\nHornaday, M., \"End of Conversation?\" Christian Science Monitor Magazine\nSection, (March 19, 1949), p« 5.\nHorton, Donald, \"Sociologist Looks at Television.\" Educational Screen,\nXXIX (January 1950), pp. 16-17 /•\nHouseman, J., \"Hollywood Faces the Fifties.\" Harper's Magazine, CC\n(May 1950), pp. 51-9.\nKolodin, I., \"Television: Interim Report.\" Saturday Review of Literature,\nXXXII (February 26,-1949), p. 62.\nLaufman, H. S., \"Television’s Impact.\" Radio and Television- News, XLII\n(July 1949), pp. 30-1 /.\nRiley, J. W., and others, \"Some Observations on Social Effects of Television.”\nPublic Opinion Quarterly, XIII (Summer 1949), pp. 223-34.\nSchane, H. G., \"impact of Television on Schools and Home.\" Nation’s Schools,\nXLV.(January 1950), pp. 23-4.\nSchreiber, Flora Rheta, \"Television: A New Idiom.\" Hollywood Quarterly,\nIV (’Vinter 1949), pp. 182-92.\nSeldes, Gilbert, \"Television: The Golden Hope.\" Atlantic Manthly,\nCLXXXIII (March 1949), pp. 34-7."
}