{
  "id": "d819-65",
  "text": "Memorandum to NAEB Officers and DirectOBS\nFrom: S.N.Siegel, President NAEB\n- 2 -\n7/21/52\nSubsequently an official invitation came from BBC for CBC and NAEB\nrepresentatives tov come to London in August for a full-scale discussion\nleading to a large-scale mutual*interchange of programs with arrangements\nfor special productions on each side of the ocean and in three countries*\nGrisewood has already shipped 84-hours or a \"fortnight\" programming via\ntape to Basil Thornton, BBC*s Norther American Director here in New York*\nRepresentatives of the Adult Education Committee will be auditioning\nthese during the first week in August. Subject to the eventual acceptance\nby the program committee we are hopeful that large quantities of thfcs.\ndistinguished program material might be pried loose and made available\nfor distribution over the tape network.\nFurther exploration has been discussed with respect to the international\nexchange of television, film and kinescopes among NAEB, CBC and BBC „\nThese arrangements follow up other discussions which Dick Hull at WOI-TV\nhad conducted with UNESCO in Paris and London*\nAccordingly, the Adult Education Committee after advising with the Fund\nfor Adult Education voted to send as delegates Georfce Probst, Parker\nWheatley and myself to the London meeting, Neil Morrison will be coining\nfrom Canada and working with a group in England will be Herman Grisewood,\nRonald Peletier and possibly Basil Thornton among others. The Committee\nis studying invitations which have been received from the Directors of\nthe Italian National Radio and Radio Diffusien in France, in addition\nto the Swiss Radio Corporation, to discuss similar program exchange\narrangements ifust before or just after the London meetings* It is sug¬\ngested that a substantial amount of music from La Scala, for instance,\nmight be made available as well as an extension of such programs as\n\"Letter from Italy\".\nYour president was able to make special arrangements with the French Line\nfor passage to Pari3 at a special rate. This would permit meetings with\nFrench Radio officials at no extra cost. The three or four days addi¬\ntional with the Italian and Swiss people would not be an excessive\naddition to cost and might well be highly productive in the end results*\nSeveral of you have had previous experience with some of these radio\ngroups and with UNESCO. The Committee and the undersigned would welcome\nany suggestions you may have for particular areas of policy or program\nexploration*\nCordially yours.\nSNS:LG\ncc: Mr. James Miles\nMr. Wilbur Schramm\nSeymour N. Siegel\nPresident"
}