{
  "id": "d819-89",
  "text": "-u-\nThc University of Minnesota as licensee could not legelly divest itself\nof actual program operation and decision as to performance standards and\npredetermined policy* but with good faith between the University and\nthe other educational groups, institutions and agencies in the state,\nthe Commission would for all practical purposes determine basic station\npolicies, subject to FCC regulations and a delegation of authority by\nthe University Regents,\nThere is precedent to indicate how station licensees do accept outside\nprogram guidance, Every network station is individually responsible\nbefore the lor for the network programs it carries. let such stations\nrarely know or are concerned about the exact contents of their network\nprogrwnsj in effect, therefore, they delegate responsibility to a network\nwhich they are certain will maintain acceptable program standards, Many\nexamples also could be cited of educational institutions and agencies in\nair own state which in fact have complete independence of progrgs judgment\nin broadcasting over local commercial and educational, stations of which\nthey ere not the licensees.\nE, SUMMARY\nWith the University of Minnesota as licensee working with a Minnesota\nEducational Television Commission as here proposed, it would be possible\nfor the entire educational community of the state to participate In the\npolicy-direction of a stats-wide educational television network. This\narrangement would also insure program contributions from many institutions\nand agencies.\nSubject to the policy direction of the Commission, the University of\nMinnesota as licensee would administer the stations as trustee for the\neducational community cf the state. The University ~ the natural focal\npoint for a St ate-wide educational activity of such broad scope ѥ would\noffer the project its extensive broadcasting experience and prog ran resources,\nas well as a long-established service organisation, thus permitting the\nproject staff to concentrate its major efforts on the development of m\neducational television broadcasting service.\nit it"
}