{
  "id": "d819-93",
  "text": "Bo THE UNIVERSITY OF MINNESOTA AS LICENSEE\nWho should be the licensee of Minnesota's noncommercial educational\ntelevision stations? First, let us determine who under the law could\nbe the licensee,. The Federel Communication Commission's television rules\nprov3.de that » noncommercial educational television station may \"be li¬\ncensed only to nonprofit educational organizations,\" public or private*\nIn Minnesota therefore such s station might be licensed either to a single\ninstitution or agency (college, university, or public school system), or\nto a corporation created for that purpose, made up of several such edu¬\ncational institutions and organizations* Good reasons m«y be advanced\nfor either of these alternatives. Licensing to a single institution —\nthe University of Minnesota in particular — may seem preferable for the\nfollowing reasons:\n(1) The stations would acquire stability if licensed to an already\nexisting institution, organization or agency, rather than to a new cor¬\nporation set up especially for that purpose. They also could benefit\nimportantly from the extensive administrative services which a going\ninstitution could provide.\n(2) The University of Minnesota is immediately qualified to serve\nas licensee, because of the state-wide nature of its educational functions,\nthe extent of its general resources, and its radio and television broad¬\ncasting experience * It would be the logical focal point for the many\nand divers© educational groups which would b© involved in programming the\nstation* it would offer the most productive single source of program\nmaterial (even though wide use must, certainly be made of the educational\ntelevision program resources of the entire state)* and its thirty years\nas radio station licensee would provide a valuable experiential background\nagainst which to develop the new educational television network*\nFurthermore the University could make available to the 'television project\nsuch services as the following: fiscal procedures — payroll and purchasing*\nlegal arrangements — the letting of construction bids and the assumption\nof contractual obligations* the maintenance of records; and physical\nplant administration. Direct broadcasting co3ts would have to be paid\nfrom funds appropriated expressly for that purpose, but most of the special\nservices listed above would be available to the project at considerably\nless cost if the University were the licensee. On the other hand, if *\nnew independent corporation were the licensee, it would need to devote\na sizable portion of its funds and personnel to setting up and maintaining\nthese administrstive and service functions.\nC* THE MINNESOTA EDUCATIONAL TELEVISION COMMISSION\nIf the University of Minnesota were the licensee of these stations, ho#\ncould active participation by the rest of the Minnesota educational community\nbe enlisted and assured? To accomplish this the University would propose\naid require s state-wide Minnesota Educations! Television Commission which\nwould* insure that these stations effectively serve the educational tele¬\nvision need3 af the entire state* give the Minnesota educational community"
}