{
  "id": "d546-28",
  "text": "-2-\n\"Sing-a-long with Educational Radio\" - HTDI\n\"Hie NAEB Goes to Tanganyika\" - Actually neither, hut I would say this is a Journal\narticle, if for no other reason than it deals with the important aspects of interna¬\ntional broadcasting, even though this is more of a report than a scholarly article.\n\"There are 5 lypes of ETV Stations\" - SCH\n\"Frame and Focus\" - Neither, and because Vernon writes, really, both types from time\nto time, I'd be a little hard pressed to categorize his articles. However, I'm\ninclined to favor the magazine for things of this sort.\n\"Live ETV over the Commercial Station\" - HTDI\n\"Reinforcement Effects of the Mass Media\" - SCH\n\"Panic\" - HTDI, and a very poor one. Personally, I don't think this should have\nbeen in the Journal, and I doubt if it has enough substance to even be in the magazine.\n\"Community Television\" - Neither, really, but definitely belongs in the magazine in\nmy opinion.\n\"Indiana Plans State-Wide CCTV\" - Same as immediately above.\n\"Book Reviews\" - Definitely belong in Journal, in my opinion.\n\"In-School Programming of ETV Stations\" - This is a little light to be classed as\nscholarly, but, since it involves research of a sort, I'd say it should be in the\nJournal, but it is almost a borderline case, partially due to its brevity - not that\neverything in the Journal has to be lengthy, but the more scholarly articles aJunost\nhave to be if they are to get much \"meat\" across, and this is especially true of\nanything involving research, it seems to me.\n\"Milwaukee Uses ETV\" - SCH - At first glance this might appear to be the HTDI-type,\nbecause it is basically a report of something done. However, since it is a report\nof how ETV is used in Milwaukee schools, and its importance educationally, and since\nit reflects the views of the superintendent, I think this is definitely the SCH type,\nprimarily, I suppose, because it lends educational authority and is an actual analysis\nof ETV and its value to education.\n\"Television Recording\" - HTDI\n\"Panamanian Television\" - I think about the same rationale holds here as for the\nSyd Head article.\n\"Education's Place in the TV and Radio Spectrum\" - SCH\n\"Products and Projects\" - HTDI"
}