{
  "id": "d546-36",
  "text": "December 27, 19&\nMrs. Betty McKenzie\nmm Publications Editor\n119 Gregory Ball\nUrbana, Illinois\nDear Betty:\nReference is made to your exchange of letters with Jim Fellows regarding\na doctoral dissertation by — it just now occurs to zae that Jim never have\nthe name of the \"fellow” — if you* 11 pardon the pun, which was entirely\nintentional.\nI believe that the inforcratioa would be worthwhile to have available, but\nwe wouldn’t be able to afford to publish such a wori; outright, ^therefore,\nI believe we should follow your suggestion — i.e*, have it broken down\ninto lengths suitable for the Journal. In this event, I think we could\nlet each installment be a little longer than might the regular Journal article.\nSecondly, I believe this un-named author should bjsealc it down into segments\nthat make good sense ~~ that is, have each segment deal with a particular\nphase or area of interest.\n•Then, I would auggest that we have a hundred or so reprints made of each\nof the separate articles and when the aeries is through the whole bundle\ncould be stapled together as a single volume. In this way we would have\na series of worthwhile articles for the Journal (and I realize these aren’t\nreally \"articles” but Mbltographical listings!, a final complete volume,\nand a saving in printing costs.\nSiese should, of course, be fairly well annotated entries, as I presume\nthey arc, and I would suggest that Jim send you a few samples so you’ll\nknow whether or not they’re what we would really want.\nSo - there you are * it *s now up to you to worry your pretty little head\nabout it and work out the details — Just don’t let it cost very much —\nand we should perhaps make it clear to Ilo-lfaae\" that idien we have the\ncompleted \"booklets'* combining all the reprints, we will likely charge a\nnominal sum for same with all proceeds to ccsae to the MSB and none to the\nauthor.\nRegards,\ncc: Mr. James A. Fellows\nP.S. Flease see other side.\nHarold S. Bill\nA&aiaietmtlve Vice Fresident"
}