{
  "id": "d1067-0",
  "text": "N A £ B NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nA„ James Ebel, Editor, Station W I L L, Urbana, III,\nJanuary I, 1945\nPAUL PORTER JOINS FCC\nPaul A0 Porter has become a member of\nThis was oisclosed in a statement by\nOFFICE UNDER a RECESS APPOINTMENT,\n_the Federal Communications Commission\nr — C-*C OFFICIALS, WHO SAIO PORTER TOOK\nPorter was nominated by President Roosevelt to fill a vacancy left by the\nRECENT RESIGNATION OF F-C-C-ChaIRMAN JAMES LAWRENCE Fly, HOWEVER, THE\nSENATE adjourned without taking action on the appointment of Porter to\nTHE r-L-C, CONFIRMATION^OF THE APPOINTMENT OF PORTER TO BE AN F-C.C\nMEMBER IS UP TO THE NEW SENATE WHICH CONVENES IN JANUARY,\nPorter was publicity oirector for the Democratic National Committee in\nTHE FALL POLITICAL CAMPAIGN,\nOHIO PLANS Ift-STATtON FM NETWORK\nTMC.2HiS STATE DEPARTMENT HAS COMPLETED ITS PLANS FOR A STATE-WIDE NETWORK\nOF a riVi TRANSMITTERS AND 52 PROGRAM PRODUCING CENTERS WHICH WILL BE CON¬\nSTRUCTED AT AN ESTIMATED COST OF $336,000 TO SERVE THE STATE8S 7,000,000\nPERSONS WITH IN-SCHOOL AND ADULT-EDUCATION BROADCAST PROGRAMS, The FM\nSTATIONS WILL RANGE IN COST FROM $ I 0,000 TO $40,000, The STATE LEGISLATURE\nWILL BE ASKED TO APPROPRIATE FUNDS FOR STATIONS BUT PROGRAM PRODUCING\nCENTERS WILL BE FINANCED LOCALLY, TRANSMITTERS WILL BE LOCATED AT CANAL\nWinchester, Mt. Gilead, Youngstown, Dover, Woodford, Jackson, Hillsboro,\nDayton, Indian Lake, Napoleon, Toledo, Cleveland, aKROn, Zanesville,\nAthens, Cincinnati, Bellevue and Ashtabula,\nM 8 CH 8 GAN 8 S \"STUMP THE PROFESSOR*1 AIRED BY WJR\nA Q)t\\l PR0GRAM planneo by the University of Michigan started December 9th\non WJR, Detroit 50 KW outlet with a board of University professors answering\nTHE QUESTIONS, The BASIC PANEL INCLUDES PROFESSORS RaNOOLPH AqaMS (H|STORy)\nAmos Morris (English), Clarence Munn (sports), and Arthur Hackett (music).\nStation WJR gives a subscription to the Reader's Digest to those who submit\nQUESTIONS THAT STUMP THE PROCESSORS. The PROGRAM IS HEARD AT 2,00 D.M.\non Saturdays,\nWHA ORIGINATES MUTUAL PROGRAM\nOn December 23 at 1:30 CWT, WHA originated a special Christmas program for\nthe Mutual Netv'ork, Feature performers of the broadcast were the famous\nPro Arte Quartet of the University of Wisconsin, Plans are underway for\nA REGULAR PRO Arte SERIES ON MUTUAL SIMILAR TO THE ONE LAST YEAR,\nTYLER 8 S PLANNING SIXTEENTH OHIO INSTITUTE\nThe Sixteenth Institute for Education by Radio will be held at the Deshler-"
}