{
  "id": "d1067-3",
  "text": "NAEB NEWS LETTER\nPage 4\nJanuary 1, 1945\nResultant re-scheduling of programs brought in an afternoon period and placed\nTHE FARM COURSE BROADCAST AT 7?30 A,M. DAILY.\nWhen broadcasting hours were limited to specified times by the Federal\nCommission on Jan. 30, 1932, a second schedule shift brought in a half-hour\nFARM PROGRAM INCLUDING MARKETS AND TALKS BY AGRICULTURAL STAFF MEMBERS AND\nAN HOUR PERIOD IN THE AFTERNOON WHICH INCLUDED MUSIC, HOME ECONOMICS, AND\nEDUCATIONAL TALKS BY VARIOUS COLLEGE DEPARTMENTAL STAFF MEMBERS*\nFirst actual student participat ion in educational programs occurred in\n1932 WHEN AGRICULTURAL COURSES WERE PRESENTED FOR SmJTH-HuGHES HIGH SCHOOLS*\nWith THE REVISION OF THE COURSE IN 1933 TO a HIGH SCHOOL BIOLOGY COURSE\n(which IS STILL IN operation) REGULAR PARTICIPANTS LEAPED FROM THE ORIGINAL\n700 TO MORE THAN 2,000 IN 5938-39 WHEN A SERIES INCLUDING PHYSIOLOGY,\nBOTANY, 7OOLOGY, ENTOMOLOGY AND BACTERIOLOGY WAS OFFERED eY THE VARIOUS\nDEPARTMENTS®\nBecause of economic conditions, the radio station had been somewhat\nRESTRICTED* BUT IN 1934 IT WAS DECIDED TO REBUILD THE SERVICE AND A NEW\nSCHEDULE OF BROADCASTS WAS INAUGURATED WHICH BROADENED THE SCOPE OF THE\nSU8JECT MATERIAL BUT STILL STRESSED FARM PROGRAMS* W|TH THE APPOINTMENT\nOF A FULL-TIME DIRECTOR CAME A PROGRAM EXPANSION WICH SCHEDULED 13 HOURS\nPER WEEK, THE MOST ATTEMPTED BY WKAR UNTIL THAT TIME*\nWith this expansion came such new features as the broadcasting, oirect\nFROM THE MEETINGS, OF FaRMERS* WEEK EVENTS FOR THE BENEFIT OF THOSE WHO\nCOULD NOT ATTEND IN PERSON® TwENTY-ONE PICKUPS WERE AIRED DURING THE WEEK\nAND THE FEATURE HAS BEEN CONTINUED AS A REGULAR PART OF THE FARMERS* Week\nSCHEDULE*\nInterference from other stations, making reception difficult in several\nPARTS OF THE STATE, BECAME SUCH A SERIOUS PROBLEM IN 1934 THAT APPLICATION\nFOR A FREQUENCY CHANGE WAS.MADE. The NEW FREQUENCY (850 KILOCYCLES) WAS\nassigned Jan. 14, 5935, by the Federal Communications Commission and has\nNOT SINCE BEEN CHANGED.\nBy 1935 THE EARLIER SEARCH FOR ’’SKILL AND FINESSE*’ H4D BEEN ANSWERED*\nDuring that year the Michigan State College of the air was scheduled, and\nINCLUDED COURSES IN AGRICULTURE* OFFERING OF SUCH COURSES AS FLOWER\nGROWING, GARDENING, RURAL ELECTRIFICATION, PLANNING FARM 8UILDINGS, POUL¬\nTRY (DIRECT FROM THE CLASSROOM), DAIRY, FARM CROPS, SOILS, FEEDING OF\nLIVESTOCK AND NUTRITION OF FARM ANIMALS PLUS SEVERAL COURSES IN ACADEMIC\nSUBJECTS PROVED POPULAR DURING THE YEARS 5935-38*\nPrograms continued to expand as each year additional hours were added until\nIN 1937 THE SCHEDULE WAS 15 HOURS PER DAY, 66 HOURS PER WEEK # ThIS IS THE\nFULL TIME ALLOTTED THE STATION BY THE FEDERAL COMMUNICATIONS COMMISSION.\nWith the added programs and hours, increased listener demand for service\nBECAME SO ACUTE THAT IN APRIL 5937, A REQUEST WAS MADE FOR INCREASE TO\n5,000 WATTS. On July 2, 1938, the F.C.C. authorized the power boost and\na construction permit was issued in March 5939, to build new studios and\nTRANSmItTER THAT WOULD ENABLE WKAR OPERATING ON 5,000-WATT POWER, TO REACH\n86 PERCENT OF THE TOTAL STATE POPULATION ANO 73 PERCENT OF MICHIGAN\nRURAL RADIO AUDIENCE,"
}