{
  "id": "d1067-4",
  "text": "NAEB NEWS LETTER*.«<-.Page 5... . o. . . . ... ..... c. January I, 1945\n(These studios in the nev* college auditorium have been completed and the\n5,000-watt power is now being utilized., The new service was inaugurated\nJune 6, 1940.)\nWKAR * s PRESENT PROGRAMS ARE PLANNED TO PROVIDE A WIDE VARIETY OF EDUCATIONAL\nMATERIAL IN EVERY FIELD REPRESENTED ON THE CAMPUS. ALTHOUGH NEW FEATURES\nARE NOT EXCLUSIVELY AGRICULTURAL IN NATURE NEW METHODS OF COMMUNICAT I ON„\nTHE AUTOMOBILE AND MODERN INVENTIONS HAVE MADE THE RURAL LISTENER AS\nDISCRIMINATING AS HIS CITY BROTHER SO THAT HIS ADDED INTERESTS ALSO RANGE\nWIDER THAN HIS WORK.\nWhere radio is going is yet to be determined. But the large group of\nLISTENERS WHO DEPEND FOR SERVICE ON WKAR (FIGURES OF JAN. I, 1938, SHOW\n278,720 RURAL AND 293,090 URBAN FAMILIES OWNING RADIOS WITHIN THE SERVICE\nAREADOF THE STATION) IS AMPLE PROOF THAT THIS STATION HAS DEMONSTRATED\nITS WORTH IN THE FIELD OF AGRICULTURAL EXTENSION. The’ NEXT 25 YEARS WILL\nUNDOUBTEDLY BRING MUCH GREATER USES OF THIS MODERN MEDIUM.\nUnquote. That brings us almost up to the day of my visit with Bob Coleman,\nPresident John A. Hannah, ano others on the faculty of Michigan State\nCollege. I said, almost.\nBob used to be at Ohio State University. He went to Ohio State sometime\nAFTER GRADUATING FROM DePaUW IN GrEENCASTLE, INDIANA. AnYHOW, IN 1925\nBob was at Ohio State and in 1930 we find him at Michigan State where\nhe's TEACHING MUSIC OR SOMETHING. He GOT INTO RADIO IN 1934, 1 MEAN AT\nMichigan State. Since then Bob has made things hum.\nNow, WKAR enjoys being housed in the relatively new Auditorium. Here,\nON THE THIRD FLOOR WKAR HAS THREE STUDIOS, WITH MASTER CONTROL ROOM,\nTRANSCRIPTION AND RECORD ROOM, TWO OFFICES, AND RECEPTION ROOM. All\nSTUDIOS HAVE GOOD, MODERN EQUIPMENT. On THE FLOOR BELOW, OUT OF TRAFFIC,\nIS LOCATED THE RECORDING ROOM. On THE FOURTH FLOOR, Bob AND HIS STAFF\nNOW HAVE USE OF TWO ROOMS FOR NEWS AND CONTINUITY.\nThere are plans for taking over more space on the fourth floor for another\nSTUDIO AND MORE WORK SPACE. PLANS ARE ALL DRAWN ANO WORK MAY GET STARTED\nANY OAY «\nWKAR uses ®he Standard transcription service and records for transcribed\nAND RECORDED MUSIC. PA IS USED FOR THE NEWS SERVICE.\nRecent improvements in the WKAR programming was brought about by the\nADDITION OF A FULLTIME PROGRAM SUPERVISOR ANO CONTINUITY WRITER. Two\nQUALIFIED YOUNG MEN WERE ADDED TO THE WKAR STAFF ON JULY l. THAT WAS AN\nEXPANSION REQUESTED BY CoLEMAN AND APPROVED BY PRESIDENT HaNNAH. IT\nTYPIFIES THE BACKING ANO CO-OPERATION THAT BOB GETS FROM THE ADMINISTRATION\nat Michigan State.\nThat spirit of backing and co-operation was one of the most impressive\nTHINGS TO ME IN MY BRIEF VISIT TO THE MICHIGAN STATE CAMPUS. ACTUALLY\nTHE FACULTY AT StaTE COME TO Bob WITH PROGRAMS AND SUGGESTIONS FOR\nPROGRAMS. At TIMES, Bob IS FORCED TO TURN DOWN PROFFERED PROGRAMS. 1\nKNOW, BECAUSE I SAT ACROSS THE DESK FROM HIM ON THREE OCCASIONS DURING\nTHE SAME DAY WHEN THREE REQUESTS FOR PROGRAM TIME CAME IN AND BqS HAD TO"
}