{
  "id": "d1067-5",
  "text": "NAEB NEWS LETTER\nPage 6\nJanuary I, 1945\nEVALUATE EACH BEFORE MAKING ANY COMMITMENTS,\nFurther evidence of the\nIN IMPROVING ITS PRESENT\nTHE FUTURE, WKAR WANTS\nSPIRIT IS SHOWN IN THE INTEREST OF MICHIGAN\nBROADCASTING SERVICE AS W£LL AS PREPARING\nFULLTIME OPERATION IS GOING OUT TO GET IT,\nState\nfor\nBob is planning Sunday operation, Michigan\npicture, too. It will probably have its own\nWIDE NETWORK IN MICHIGAN DEVELOPS, MICHIGAN\nWILLING CO-OPERATORS,\nState will be in the FM\nFM STATION, AND IF A STATE-\nState will be one of the\nWell, that's the story as I saw it—about WKAR.\nON THE CAMPUS IN EAST LANSlNG,\nMichigan State College,\n(Editor s Postscripti The third article in the\nby Treasurer W. I0 Griffith on WRUF, University\nLIBERTY SHIP NAMES AFTER FORMER VVNYC ENGINEER\nSERIES WILL BE WRITTEN\nof Florida5at Gainesville,)\nWNYCSr^?J^ L,8ERTY Ship S.S. Murray Morr.s Blum, honors the former\nWNYC ENGINEER WHO HEROICALLY GAVE HIS LIFE LAST DECEMBER TRYtvr rn\nA DROWNING FRIEND IN THE N0RTH ATLANT,C, SLlS DOWN THE WAYS ll ATLANTA\nEORGIA LAST MONTH, THE SHIP WAS CHRISTENED BY Mrs, SYLVIA BlUM THE *\nMOTHER OF THE LATE LIEUTENANT MURRAY BLUM, * ™E\nTHE S^Sc MUKSAY M°RR,S B*-UM WAS NAMED FOR THE FORMER WNYC\nMarFIt?meS1eRrv?ceT?0L 0VER YEARS AG0 70 J0,n up '\"\",th the\nENGINEER WHO\nUnites States\nNOTE TO HARRIED EMPLOYERS\nIp you’re interested\nWHO HAS UNDERSTUDIED\nI N A\nWOI 8\nA HALF, CONTACT W. I, GRIFFITH,\nCOMPLETELY IN CHARGE OF WOMEN’S\nREGULAR DIRECTOR, HANDLING THEM\nDONE IN ADDITION TO HER REGULAR\nINFORMATION SERVICE OF THE SOWA\nWoman’s Editor in the person of Mary Burnham,\ns women’s Program Director for the past year and\nI r» -'’■*■** * v ‘ < \"i- r- MO I T C. M n\n”0* Director, Miss Burnham, has been\nBROADCASTS DURING AN ILLNESS OF THE\nMOST ADEQUATELY, ThIS RADIO WORK WAS\nDUTIES AS ASSISTANT EDITOR IN THE\n..*r O'.nviu yr int • uva AGRICULTURAL EXTENSION SERVICE. A\ngraduate of the Technical Journalism Department at I ova State, she brings\nto the microphone a background in both the sciences and home economics,\n&HE IS A thoroughly competent writer in either newspaper or radio copy\nAGE0 ABOUT 25 YEARS, HER PERSONALITY AND HER APPEARANCE ARE VERY\nATTRACTIVE. Her REASON FOR LEAVING* CONCENTRATION ON RADIO RATHER\nTHAN PRESS IN THE SPECIFIC FIELD OF WOMEN'S PROGRAMS,\n1 NO 1 ANA UNIVERSITY HOLDS STATE A£R MEETING\nThe Indiana Chapter of the Association for Education by Radio met for a\nGENERAL RADIO CONFERENCE ON THE CAMPUS OF INDIANA UNIVERSITY DECEMBER 9,\nThe program, arranged by Harry Skornia, v'as directed along lines of\nINTEREST TO COLLEGE BROADCASTING AS WELL AS TO PUBLIC SCHOOL UTILIZA¬\nTION, Most outstanding among the many features of the full day’s schedule\nof discussions were the Panel Discussion on \"The School’s Role in the\nProduction of Radio Programs,m “The School’s Role in Utilization of\nAudio Aids,” and “Implications of Frequency Modulation for Education.“"
}