{
  "id": "d1067-6",
  "text": "NA£B NEWS LETTER\nPage 7\nJanuary I, 1945\nOne of the outstanding ideas developed as a result of the discussions was\nTHE NEED FOR A RADIO REPRESENTATIVE IN EACH SCHOOL« So MUCH GOOD RADIO\nLITERATURE WHICH WOULD BE USEFUL TO THE TEACHERS IN THEIR RADIO UTILIZATION\nGOES INTO THE WASTE BASKET IF SENT TO THE PRINCIPAL OR SUPERINTENDENT*\nnote: THE BOOK REVIEW ATTACHED TO THIS NEWS LETTER\nEnclosed with this News Letter is the first in a series of six reviews\nOF BOOKS BY CaRROLL ATKINSON DEALING WITH RADIO® I HEREBY CAST, IN\n8EHALF OF THE ENTIRE NAEB MEMBERSHIP, AN UNOFFICIAL VOTE OF THANKS TO\nBROTHER ZlEBARTH FOR HIS EFFORTS IN THE PREPARATION OF THESE FINE REVIEWS®\nECHOES FROM THE STEVENS COLLEGE RADIO CONFERENCE\nWe HAD A BRIEF ITEM ON TELEVISION FROM THE STEVENS COLLEGE RADIO CONFERENCE\nIN LAST MONTH1S NewS LETTER BUT A COMPLETE REPORT OF THE CONFERENCE\nACTIVITIES ARRIVED TOO LATE TO MAKE THE DEAD LINE® ALTHOUGH THE' PRO¬\nCEEDINGS ARE NOW HISTORY A FEW OF THE FINDINGS CANNOT BE PASSED WITHOUT\nMENTIONING EVEN AT THIS LATE DATE. THEY WERE SELECTED FROM A FIFTEEN\nPOINT SUMMARY OF THE CONFERENCE BY SARA Ann Fay.\n1. There will be an increase of exchange of raoio programs with foreign\nCOUNTRIES AFTER THE WAR®\n2. Television is a problem child from the operations standpoint® Tele¬\nvision HAS PROVED IT IS A PRACTICAL MEDIUM OF COMMUNICATION BUT IT WILL\nBE MANY YEARS BEFORE USE OF TELEVISION IN THE HOME IS WIDE-SPREAD.\n3® CHILDREN'S PROGRAMS SHOULD GIVE INFORMATION, CREATE AN UNDERSTANDING\nAND DEVELOP DESIRABLE ATTITUDES.\n4. Serial dramas* or \"soap operas” have not affected the happiness of\nWOMEN LISTENERS*\n5. As LISTENERS® GROUPS, RADIO COUNCILS HAVE IN THEIR HANDS A VERY\nPOWERFUL INSTRUMENT FOR HELPING RADIO TO MAINTAIN ITS HIGH STANDARDS\nOF EXCELLENCE.\n6® The American home of tomorrow will need solidarity. Radio, through\nwomen's PROGRAMS, CAN AID THE WOMAN OF TOMORROW BEYOND HINTS ON DOMESTIC\nSKILLS AND PERSONAL APPEARANCE. RADIO CAN HELP CREATE AN UNDERSTANDING\nOF THE PERSONAL RELATIONSHIPS INVOLVED IN MARRIAGE®\nTHIS AND THAT\nTried to pick up WSUI's program \"One Man's Opinion\" tonight on my hoppeT;)-\nUP SUPER-SENSITIVE SELECTOR RECEPTOR BUT TO NO AVAIL® THE QRM (INTER¬\nFERENCE TO YOU) WAS TOO TOUGH. SOUNDS LIKE A VERY FINE PROGRAM FROM\nTHE LITERATURE IN WSUI 'S PROGRAM BULLETINS.®•• M Y FRIENdO HOPE BY NOw)\nAbbot has done the impossible in the preparation of a booklet describing\nMichigan's present and future radio possibilities® It is one of the few\nBOOKLETS WHICH DISCUSSES RADIO IN GENERAL AN,D FM IN PARTICULAR THAT\nSTICKS TO THE FACTS.... IF YOU WATCH THE FCC ACTIONS CLOSELY YOU FIND AN\nINTERESTING TREND IN RECENT GRANTS IN VIRGINIA. ME8BY WE SHOULD GET"
}