{
  "id": "d1067-7",
  "text": "NAEB NEWS LETTER\nPage 8\n. . . . o .. January\n1945\nTOGETHER AND f-'O SOME HORSE TRAD I NG TOO.... J WISH SOMEBODY WOULD MAKE UP\nTHEIR MINDS ABOUT FRENCH TELEVISION, FlRST ITS SUPERIOR, THEN ITS INFERIOR,\nAND NOW ITS SUPERIOR AGAIN IN THE LATEST REPORTS. PERHAPS THE TROUBLE IS\nTHAT TOO MANY NBC AND CBS FOREIGN CORRESPONDENTS ARE INTERVIEWING TOO MANY\nFrench cooks. Mayse Mutual should send a correspondent over there to\nMEDIATE, OR BETTER STILL, MAYBE THE BOYS OVER THERE SHOULD TRY TO DIG UP\nA LITTLE BETTER WAR NEWS.„.<>ThE VIEWS OF Lewis A. WeISS, GIVEN ON TELEVISION\nAT THE RECENT TELEVISION BROADCASTERS ASSOCIATION CONFERENCE SEEM PRETTY\nSOUND TO THIS DEPARTMENT. You’ll RUN ON TO THEM IN ANY REPORT OF CON¬\nFERENCE activities....The U.s, Office of Education has issued a helpful\nBULLETIN FM FOR EDUCATION.11 BETTER GET A COPY. . . . Ai_SO ENCLOSED WITH THIS\nNews Letter is a card describing a suggested improvement in basketball\nBROADCASTING FATHERED BY YOU KNOW WHO. We ARE TRYING TO GET THE SYSTEM\nUNIVERSALLY ADOPTED BY ALL SPORTSCASTERS SO THAT THE PICTURE OF THE FLOOR\nAREAS WILL BECOME GRAPHIC IN THE MINDS OF THE LISTENER. So FAR THE SYSTEM\nHAS THE BACKING OF ALL THE COACHES CONTACTED, MOST OF THE SPORTS WRITERS,\nMOST OF THE SPORTSCASTERS CONTACTED, AND MOST OF THE LISTENERS WHO HAVE\nHEARD IT USED IN BROADCASTING. PASS THE CARD ALONG TO YOUR SPORTS MAN\nAND HAVE HIM DROP ME A LINE WITH HIS COMMENTS. The CUT IS AVAILABLE IF YOU\nWANT TO PUT OUT THE DIAGRAM AS PROMOTION FOR Y0UR BASKETBALL BROADCASTS....\nAnd That i s That.\nF.C.C. ACTIONS\nAn APPLICATION BY RADIO STATION WOf, TO EXTEND ITS BROADCAST TIME 10 THE\nEARLY MORNING HOURS, WAS GRANTED IN PART DcC.9 BY THE FEDERAL COMMUNICATIONS\nComm Ission.\nThe commission, in a divided opinion, authored WOt to broadcast with one\nTHOUSAND WATTS FROM 6 A.M. TO 8 A.M., CENTRAL ^AR T|mE, DURING DECEMBER,\nJanuary and February, and from 6 a.m. until average local sunrise time\nDURING THOSE MONTHS WHEN 6 A.M. OCCURS PRIOR TO LOCAL SUNRISE.\nTHE ONE-THOUSAND WATT AND OTHER RESTRICTIONS WERE ORDERED, THE COMMISSION\nSAID, TO PREVENT INTERFERENCE WITH STATION KFI OF LOS AngeLES. WO I is\nPERMITTED TO BROADCAST WITH ITS AUTHORIZED POWER OF FIVE THOUSAND WATTS\nDURING THE OTHER HOURS OF THE DAY FOR WHICH IT IS LICENSED.\nCommissioners Paul A. Walker and Clifford J. Durr said in an opinion that\nTHEY FAVORED GRANTING THE STATION’S FULL REQUEST FOR FIVE THOUSAND WATT\nOPERATION FROM 6 A.M. TO LOCAL SUNSET, HOLDING THAT THE STATION’S INTER¬\nFERENCE WITH KFI WOULD BE OF LITTLE CONSEQUENCE AND WOULO OCCUR, BECAUSE\nOF GEOGRAPHIC DIFFERENCE IN TIME, FROM 4 A.M., AND TWO HOURS BEFORE SUNRISE,\nLos Angeles Time, when few people in Los Angeles would be Listening.\nActing Commission Chairman E. K. Jett and Commissioner Norman S, Case\nOBJECTEO TO THE APPLICATION. They CONTENDED THAT IT VIOLATED COMMISSION\nRULES CONCERNING SUCH SITUATIONS AND MIGHT RESULT IN WHAT THEY TERMED “The\nFLOW OF A LARGE NUMBER OF APPLICATIONS REQUESTING SIMILAR TREATMENT WHICH,\nIF GRANTED, WOULD RESULT IN SERIOUS INTERFERENCE WITH BROADCASTING AND\nTHE PIECE-MEAL REPEALING OF THIS RULE.\"\nWestern Illinois State Teachers Collego of Macomb# Illinois has applied\nFOR A NON-COMMERCIAL EDUCATIONAL BROADCAST STATION TO BE OPERATED ON ONE\nOr THE EDUCATIONAL FREQUENCIES WITH A POWER OF NOT LESS THAN > KW.\n; i\n—Ebel"
}