{
  "id": "d74-30",
  "text": "fylr. Sam Becker\n-2-\nAugust 25, 19 61\nWealthy stations in metropolitan areas have means and facilities for carry¬\ning out such surveys; stations which happen to be situated in communities\nwhere there are colleges and universities have help at hand. But many sta¬\ntions which do not enjoy such advantages, are not in a position to conduct\nstudies of their audiences, particularly surveys that are not suspect.\nIt occurrs to me that NAEB, under the aegis of its research committee, might\nset up in its Washington headquarters a national audience survey office,\nwhich would undertake to conduct surveys for local stations to determine the\nspecial requirements and wants of their audiences . I can envision something\nlike the following:\n1. A full time national research director, with secretary, and office\n2. A group of regional research directors (who might or might not be\nthe members of the present committee) who would organize and supervise\narrangements for surveys within their particular geographical area.\n3 . Wherever possible NAEB members and/or people on college and\nuniversity staffs would be engaged for a fee to conduct a survey for a sta¬\ntion in their vicinity.\n4. The surveys would be conducted by educators and would use stu¬\ndents to do the interviewing, doorbell-pushing, or whatever.\n5. Although this activity would be undertaken as a service designed\nto return funds to the Association, it would at the same time provide some\nproductive research opportunities for research people throughout the country.\n6. Any or all of this kind of research undertaken for commercial\n“clients”, would be done with strict regard for principles of scientific re¬\nsearch and scholarly integrity. In other words, whatever the results show¬\ned, these would be the ones reported.\n7. I estimate this would take $3 0,000 to set up such an office for\none year, for personnel, travel funds and incidental expenses.\nI know there is enough interest in this kind of thing on the part of the comm¬\nercial stations so that I would have no trouble in raising the $30, 000 in"
}