{
  "id": "d74-54",
  "text": "STANFORD UNIVERSITY\nSTANFORD, CALIFORNIA\nINSTITUTE FOR COMMUNICATION RESEARCH\nNovember 24, 1961\nI don't know that I fully understand this plap which came by you\nout of Bill Harley, but if I do understand it IYm not very enthusiastic.\nLet me ask a few questions which will probably convey my feeling tone.\nIf this is to be purely a local operation -- i.e., NAEB puts an\nenquiring station into touch with a local survey research outfit — what\ndoes the national research director do? (I am not implying that it\nwouldn't be a good idea for NAEB to sponsor research from a national out¬\nlook, but don't see exactly what'a permanent, full-time research director\nin Washington would do in this case; nor, indeed, how they could make it\nexciting enough to get a really good man.)\nAlong the same line, what is this $30,000 for the national office\nto do? (Once again, I am all in favor of the national office getting more\nmoney, but how does this contribute to the project?)\nAgain, is this the best way to find out what audiences want and\nneed? I am sure you will agree that people are pretty inarticulate about\nwhat new and different kinds of programs they want — and even more about\nwhat they need. Would a better way be for the station to talk with rep¬\nresentative leaders, perhaps to maintain a continuing program advisory\ncouncil of such leaders? Frankly, I suspect that such surveys would be\nused as a delaying action by a station --we have brought in this organiza¬\ntion, sponsored by the NAEB, to survey our audience, and we are making\nmaximum use of the results; in fact, if you will look at these responses,\nyou will see that 87% of our audience had no concrete suggestions to make,\nand therefore were evidently completely satisfied, etc. Remember that this\nis research work to be done for the station; it isn't an outside evaluation\nof programs. The station would have complete right to use the results, and\neven to specify what is asked. I'm not really very hopeful that this would\nmake a fundamental difference.\nAgain, I wonder whether this kind of applied, commercial research\nis what we ought to spend our time on? Certainly we at the Institute\naren't going to spend our time on it. Supposedly, the results would be"
}