{
  "id": "d74-75",
  "text": "Mr. William G, Harley\nPresident, NAEB\nDupont Circle Office Bldg*\n134f Connecticut Ave*, N.W\\\nWashington 6t D. C.\nDear Bill;\nAs I believe I told you in Washington, only one other member of\nthe research committee, beside myself, showed up at the Research Com’\nmittee meeting. Most of them, of course, were not at the convention.\nAs a result, I polled them by mail on your proposal for the establish¬\nment of an audience survey service.\nRather than summarizing their responses, since most of them have\na number of important points to make, I am submitting a copy of the\nrelevant reaction from each individual. These men have obviously given\nsome thought to the proposal and I believe that you and the next chair¬\nman of the research committee should have all of this information and\nthinking on which to base a decision.\nThree of the members tended to favor such a proposal. Here are\ntheir comments;\nHarwood: f,Bill Harley's suggestion sounds very good. You or he\nshould confer with Donald McGannon of the Westinghouse stations, who is\nchairman of the NAB Committee on establishment of a research center to\ndetermine any extent to which NAB has similar plans. We here are and\nhave been studying audiences for commercial radio and television broad¬\ncasters of southern California and nearby areas.\"\nEllery: \"Bill Harley's suggestion that the NAEB establish a national\naudience survey office has my enthusiastic endorsement. You may he sure\nthat I would be happy to lend my services as consultant, supervisor, or\nwhat have you.\"\nStarlin: \"In answer to your letter of November IS, I think that Harley'\nidea for NAEB to set up a national audience survey office in Washington,\nD. Co is essentially a good one. The only question I guess I would have\nis why such an office should be limited to \"conducting surveys for local\nstations to determine the special requirements and wants of their audiences\"\nI am sure that this is a legitimate and often helpful kind of research ac¬\ntivity but I would think that an organization which was set up with broader\nresearch aims and development might be better than one which was limited\nto audience research alone.\nIn terms of developing a possible NAEB research center, I think it\nmight also be well to consider the stated interest in research which has\nrecently come from NAB. President Collins of NAB, I believe, has set up\na committee (with McGannon as chairman me thinks) which is presently dis¬\ncussing a NAB sponsored Research and Training Center. This committee is\nnow engaged in some conference and discussion regarding the research needs\nand problems in broadcasting and whether such a center should be established\nat some university or in Washington, D. C, or some other metropolitan area.\nThe Association for Professional Broadcasting Education has been quite\ninterested and active in this NAB development. If NAEB is going to develop\na research center, I think it might be well for Bill Harley to consult with"
}