{
  "id": "d201-100",
  "text": "-8-\nSOCIETY MORE AND MORE WITHOUT CONTACT BETWEEN ITS\ndifferently colored human parts. Certainly, contact\nBRINGS ITS OWN PROBLEMS. SUT , IF CONTACT IS AVOIDED\nELIMINATED, THERE SIMPLY IS NO CHANCE FOR THE GROWTH\nOF MUTUALLY ACCOMMODATIVE HABITS, PRACTICES, AND 1NST1\nTUT I ONS.\nRICHTER: That sounds rather general and abstract. As I under¬\nstand YOU, YOU’RE DESCRIBING A SITUATION IN OUR B1GGE\nCITIES IN WHICH NEGROES AND WHITES HAVE NOT MANAGED T<\nCREATE A KIND OF SM00TH-FL0WING SOCIAL SET-UP. To A\nLARGE EXTENT, THEY’RE OUT OF TOUCH, AND WITHOUT BRIDGC\nBETWEEN THEM I SUPPOSE VARIOUS KINDS OF PROBLEMS A;' I SC\nNOW, CAN WE BE CONCRETE? YOU’VE SAID THERE ISN’T MUCf\nCHANCE FOR THE GROWTH OF MUTUALLY ACCOMMODATIVE HABIT\nPRACTICES, AND INSTITUTIONS. THAT’S RATHER A MOUTHFUL\nVhaT DOES IT MEAN, SAY, IN TERMS OF EVERYDAY RELATION;\nSCHNEIDER: I’ve spoken more than once with friends living in some\nOF OUR LARGER CITIES WHO HAVE INDICATED THE SPECIAL\nDIFFICULTIES ARISING FROM THE R I VENNESS. . . .THE SPLIT¬\nNESS I’ve mentioned. Friends will indicate their will¬\ningness ... THE I R ENTIRE W I LL I.NGNESS . . . . I N PRINCIPLE, TC\nLIVE IN MIXED NEIGHBORHOODS. SUT HOW SHALL THEY COPE\nWITH SOME OF THE PROBLEMS THAT INEVITABLY ARISE? Ch!'\nREN H.VE THEIR ORDINARY TROUBLES AND DISAGREEMENTS ON\nTHE STREETS. SOMEONE’S EYE GETS BLACKENED. HoW DOES\nONE TAKE UP THIS, OR A MORE SERIOUS THING, WITH A\nNegro neighbor? Perhaps this sort of business isn’t\nEASY IN ANY CASE, BUT NOW IT BECOMES FURTHER COMPLI¬\nCATED BECAUSE ONE IS AFRAID OF BEING SUSPECTED OF A\nfeeling of prejudice he really doesn’t have. One is\nalso afraid of arousing special sensitivities on the\npart of his Negro neighbor. It’s difficult, inordin¬\nately DIFFICULT, TO KNOW WHAT TO DO. AND THE NEGRO.\nFOR HIS PART, IS ALSO PERPLEXED AND CONFUSED. MIGHT\nHE CREATE THE IMPRESSION OF A DISLIKE OR HOSTILITY HE\nDOESN’T REALLY FEEL? OR, IF HE IS ESPECIALLY ANGRY,\nHOW SHALL HE BEST GIVE EXPRESSION TO THAT ANGER.\nMaybe it would be dangerous for him to speak and act\nin certain ways. Of course, this is an illustration\nINVOLVING RELATIVELY SMALL DIFFICULTIES, You CAN GET\nMURDEROUS ANTAGONISMS, NOURISHED BY LONGSTANDING HOS¬\nTILE feelings. Where there are no rules to organize\nTHE RELATIONSHIP OF PEOPLE TO ONE ANOTHER, ALMOST\nANYTHING MIGHT HAPPEN. PEOPLE LITERALLY DON’T KNOW\nhow to act. Since there are no precedents, no stand¬\nards FOR ACTION, BEHAVIOR BECOMES UNPREDICTABLE, AND\nIT MAY EVEN BECOME EXPLOSIVE. AND WE COME CLOSE\nENOUGH TO A SITUATION LIKE THIS IN THE RELATIONS OF\nwhites to Negroes in our major cities. Without rules\nAND STANDARDS FOR ACTION, WITH A HERITAGE OF HOSTILITY\nWITH CONTINUED CUTTING OFF OF NEGROES FROM WHITES, YO1\nGET, IN A WAY, A SET-UP IN WHICH THERE IS NO SOCIAL"
}