{
  "id": "d201-106",
  "text": "-2-\nRICHTER:\nLOG '\\N :\nNegro1s present day overall employment situation,\nWITH PERHAPS A FEW WORDS ON SOME SPECIAL LOCAL CONDI\nticns. And finally, if we turn to endeavors that\nHAVE BEEN MADE IN THE PAST FEW YEARS, PARTICULARLY\nsince World War Two, to help the Negro in his employ\nMENT SITUATION, WE SHOULD HAVE A REASONABLY ROUNDED\nBRIEF VIEW OF THE SUBJECT WE’RE TRYING TO TACKLE.\nFollowing your suggestion then, Lou, I don’t think 1\nCOULD DO MUCH BETTER'THAN TO TURN, ONCE AGAIN, TO Dr\nRayford W. Logan, Professor of History at Howard\nUniversity, who discusses significant features of th\nNegro’s labor situation since the end of the Civil\n\"Var.\nLabor had not in this period immediately after the\nCivil War achieved the strong position which it now\nhas. The National Labor Union debated from 1866 to\n186.9 what it should do with this new contingent of\nworkers. Looking back we would say that White worke\nSHOULD HAVE WELCOMED AN IMPLEMENT IN THE FORM OF NEW\nWORKERS, EVEN THOUGH THEY BE 3LACK, IN THEIR STRUGG'\nFOR BETTER WORKING CONDITIONS, HIGHER SALARIES FOR\nworking men. But prejudice prevailed, custom pre¬\nvailed. And so in 1869 the National Labor Union\nVOTED TO HELP NEGROES TO ORGANIZE BUT IN SEPARATE\nunions. In 1869, then, Negroes organized the color;.\nNational Labor Union. This union, like the National\nLabor Union, disappeared largely after the crisis of\n1873. There then emerged the Knights of Labor which\nSOME PERSONS CALLED A RADICAL ORGANIZATION, CALLED\nITS MEMBERS BLACK ANARCHISTS, AND IN GENERAL SUCCEE:\nED IN MAKING IT HAVE THE IMAGE OF A SUBVERSIVE ORGAr\nization. But the Knights of Labor did make an\nATTEMPT BOTH IN THE SOUTH AND IN THE NORTH TO HAVE\nSOME OF ITS UNIONS INCLUDE BLACK AND WHITE WORKERS.\nThe year 1886 was a crucial year in the histor\nOF labor in this country. In that YEAR THERE WAS\nORGANIZED THE .AMERICAN FEDERATION OF LABOR WHICH,\nBECAUSE OF THE ASSOCIATION OF THE PREDOMINANT POSI¬\nTION OF LABOR IN THE UNITED STATES. BUT THE LEADER,\nOF THE A F OF L WERE MOSTLY EUROPEANS WHO WERE INTE\nESTED IN SKILLED WORKERS. NOW, IN 1886 MOST SKILLE\nWORKERS WERE WHITE MEN. !E ARE NOT SAYING, THEN,\nTHAT THEY WERE NECESSARILY PREJUDICED AGAINST WOMEN\nOR THAT THEY WERE NECESSARILY PREJUDICED AGAINST\nNegro workers. That was the philosophy of the labo\nMOVEMENT, REPEATEDLY EXPRESSED BY SAMUEL GOMPERS AN:.\nothers. By the latter part of the Nineteenth Centu\nthe Knights of Labor had gone out of existence.\nPerhaps because of this stronger position which the\nA F OF L THEN HAD, ITS GENERAL CONVENTION IN 1900\nAUTHORIZED EACH NATIONAL AFFILIATE TO DETERMINE\nPOWERFUL ORGANIZATIONS SUCH THE MACHINISTS, AND THE"
}