{
  "id": "d201-110",
  "text": "-6-\nRICHTER:\nSCHNEIDER:\nFOR THE COUNTRY AS A WHOLE~, 2.2% OF TOTAL EMPLOYED\nmales among non-Whites were professional, technical,\nAND KINDRED WORKERS, BUT THE COMPARABLE FIGURE FOR*\nWhites was 7.9%. Two percent of the non-White employ\nMALES WERE MANAGERS, OFFICIALS, AND PROPRIETORS ( E X C F\nF Rm), BUT 11.6% OF THE WHITES WERE SO LISTED. TwENT\nTHREE POINT ONE PERCENT OF THE NON-'A'hITES WERE L*BORE\nEXCEPT ON FARMS AND IN MINES, BUT NO MORE THAN 6.6$ C\nthe Whites were such laborers. Non-Whites are, of\nCOURSE, VERY LARGELY NEGROES. AND THIS IS THEREFORE\nA GOOD ENOUGH DESCRIPTION OF CONTRASTS BETWEEN NEGROE\nand Whites in terms of occupational distribution.\nWe now have a portrayal of historical background, and\nWE HAVE A FEW FEATURES OF THE STRUCTURE OF THE NEGRO1\nOCCUPATIONAL AND EMPLOYMENT SITUATION. I WONDER IF\nWE CAN SHIFT GEARS AT THIS POINT. Let’s TURN TO ONE\nOR TWO OF THE PROBLEMS IN CONNECTION WITH EMPLOYMENT\nAND WITH RELATIONS TO EMPLOYEES AND EMPLOYERS THAT TH\nNegro faces. There are certainly numerous diffi¬\nculties HERE.\nNot the least of those difficulties is the sheer fact\nTHAT MANY PEOPLE ARE STILL PULLED IN DIFFERENT DIRECT\nIONS BY THE CASTE AND CLASS PRINCIPLES. THE CASTE\nPRINCIPLE SAYS IN EFFECT, \"n'E CAN’T ACCEPT THESE\nCOLORED PEOPLE ON EQUAL TERMS. It’s OUT OF THE\nquest ion.” The class principle says, \"We’re united\nBY THE FACT THAT WE’RE ALL WORKERS FACING CERTAIN\nCOMMON WORKING CONDITIONS.\" If YOU UNITE, YOU OVER¬\nLOOK COLOR. IF YOU DON’T UNITE, YOU MAY OVERLOOK\nCOMMON ECONOMIC INTERESTS OF BLACK AND WHITE, TO NO\nmore. Although the caste principle still has appre¬\nciable POWER, WE HAVE TO REALIZE THAT, AS MYRDAL\nALREADY KNEW IN THE FORTIES, WE ARE NOT DEALING WITH\nABSOLUTELY FROZEN ATTITUDES ON THE PART OF AHITE\nWORKERS, IF WE ARE EVER JUSTIFIED IN SPEAKING OF\nFROZEN ATTUDES., WORKERS WHO TALK ONE WAY, A WAY THAT\nWOULD SUGGEST PREJUDICE AND READINESS TO DISCRIMINATE\nWILL SOMETIMES ACT AETHER WAY WHEN CONFRONTED WITH A\nSITUATION IN WHICH THEY FIND NEGROES ARE ALREADY\nWORKING WITH THEM. AND EMPLOYERS, FOR THEIR PART, IF\nTHEY ARE MINDED TO END DISCRIMINATION, MAY DISCOVER\nIN PARTICULAR CASES JUST THIS OPENNESS, THIS FLEXI¬\nBILITY, THIS FAILURE TO HOLD ON TO PREJUDICED ATTI¬\nTUDES AND DISCRIMINATORY BEHAVIOR; i F\nTO THE BITTER END. ThERE ARE TIMES WHEN A LITTLE\nCOURAGE WILL GO A LONG WAY, AND PRODUCE SURPRISING\nresults, Also, of course, THE UNFROZENNESS, THE\nOPENNESS of ATTITUDES GIVES GROUND FOR SOME OPTIMISM\nABOUT THE WORK OF ACTION AGENCIES THAT HAVE THE OBJECT\nOF REDUCING EMPLOYMENT DISCRIMINATION AGAINST NEGROE6"
}