{
  "id": "d201-121",
  "text": "-8-\nRICHTER: It does seem then, that we have in this entire area\nA VERY GREAT DEAL OF MISUNDERSTANDING. I THINK I\nCAN SENSE, OR GLIMPSE, SOMETHING OF THE MYTHS AND TH\nSPECTERS AND GHOSTS WHICH YOU REFERRED TO PREVIOUSLY\nLou. -JET VE ENCOUNTERED THE SELF-FULFILLING PROPHECY\nAGAIN IN CONNECTION WITH PANICS WHEN NEGROES BEGIN T\nMOVE INTO A NEIGHBORHOOD. '1E SEE THE NEED FOR A\nCERTAIN ACUTENESS OF THINKING, AS WELL AS SOCIAL\nSYMPATHY, WHEN RACIAL FACTORS ARE COMPLICATED BY CLA\nFACTORS IN THE SPHERE OF HOUSING AND URBAN MOVEMENT.\n3UT, IF WE HAVE MYTHS, GHOSTS, SPECTERS, WE ALSO HAV\nMEN WHO COMPLICATE THE SCENE.\nSCHNEIDER: Yes, we have men who do. And as long as we remember\nTHAT THEY ARE THEMSELVES PUT INTO SITUATIONS WHICH I\nWOULD BE HARD TO HELP, I SEE NO HARM IN SPEAKING\nABOUT THEM. SOME AND SOME REAL ESTATE BROKERS HAVE\nUNDOUBTEDLY HAD A HAND IN MAKING THE HOUSING SITUATI\na Trough” one for the Negro.\nRICHTER: Dr. Joseph Taylor, a professional sociologist and\nPROGRESS DIRECTOR OF FL A N N E R HOUSE IN INDIANAPOLIS,\nIndiana, made some comments about certain landlords.\nTAYLOR: Well, I think the role of the landlord in the per¬\npetuation OF THE SLUMS IS A VE Y BIG ONE, HE’S PLAYE\na very big role. This, I think, could be pointed ol\nBY THE FACT THAT IN ONE AREA THAT I COULD POINT OUT\nIN THIS COMMUNITY, THAT IS DEFINITELY A SLUM AREA,\nONLY ONE IN F|VE HOUSES IS OWNED BY THE PERSON WHO\nlives in it. This leaves 80yo of the housing belongi\nTO ABSENTEE OWNERS. Now THE. ..THIS CRE.TES QUITE A\nPROBLEM FROM TWO ASPECTS. ONE, THIS SLUM AREA IS\nUSUALLY JUST OUTSIDE AN EXPANDING BUSINESS AREA,\nBUSINESS OR INDUSTRIAL AREA, AND SO IT IS ANTICIPATE\nTHAT THE USE OF IT WILL BE CHANGED. THIS IS NO INDU\nMENT TO THE OWNER OF THE PROPERTY TO INVEST MORE\nMONEY IN IT FOR RESIDENTIAL PURPOSES. Now, BECAUSE\nHE’S PAYING A HIGH AMOUNT OF RENT, AN EXORBITANT\nAMOUNT OF RENT, THE PERSON WHO LIVES IN HOUSE DOESN'\nFEEL OBLIGATED TO DO ANYTHING TO IT IF THE LANDLORD\nwon’t. It means that often as a part of his resent¬\nment TO THE TREATMENT THAT HE’S GETTING AT THE HANDS\nOF THE LANDLORD HE IS NOT AS CAREFUL WITH THE PROPER\nAS HE MIGHT BE. RvND IT OUGHT TO BE KEPT IN MIND THA\nTHE PROPERTY WAS NOT IN GOOD REPAIR WHEN HE WENT I NT\nIT. It means that in the course OF NORMAL WEAR and\nTEAR IT RAPIDLY DETERIORATES. PARTICULARLY IS THIS\nTRUE WHEN YOU CONSIDER THE OVERCROWDING THAT IS NEC¬\nESSARY IN CRDERTFOR MANY PEOPLE TC HAVE A PLACE AT\nALL XO'LIVE."
}