{
  "id": "d201-129",
  "text": "-5-\nTHAT THEY INNATELY STEAL, THAT THEY WILL CUT YCU AND\nTHAT THEY WILL DO OTHER ACTS OF VIOLENCE, MAKES SOME\nJUDGES WHO CALL THEMSELVES GOOD JUDGES THINK THAT TH::\nBEST WAY TO DEAL WITH A NEGRO WHO RUNS AFOUL OF THE\nLAW IS TO GIVE HIM THE LONGEST PUNISHMENT THAT THEY\nCAN.\nSCHNEIDER:: I find that last statement a very interesting one.\nMr. Delaney sees how a factor having nothing t c d b •\nWITH RACE COMPLICATES A R AC I A L .P R 0 B LE M , .'E’VE\nENCOUNTERED THIS SORT OF THING BEFORE IN SPEAKING\nABOUT HOUSING. It’s REALLY QUITE IMPORTANT ALSO IN\nTHE AREA WE’RE TALKING ABOUT TODAY. The NEGRO PARTI¬\nCIPATES IN THE AMERICAN CULTURE. He IS BOUND TO BE\nINFLUENCED 3Y -AMERICAN VALUES WITH REGARD TO ‘WHAT IS\nGOOD, WORTHWHILE, WORTH HAVING. aND OURS IS STILL A\nCULTURE THAT PLACES APPRECIABLE STRESS UPON VARIOUS\nMATERIAL THINGS THAT MAY BE OBTAINED WITH MONEY. But\nAT THE SAME TIME THE NEGRO IS BY VIRTUE OF H|S LOW\nINCOME, LOW EDUCATIONAL LEVEL, AND BY VIRTUE OF OTHE\nTHINGS STILL, ESPECIALLY HANDICAPPED IN THE EFFORT T\nOBTAIN THE SO-CALLED \"gOOD THINGS OF LIFE1’ THROUGH\nLEGITIMATE CHANNELS. THE MORE POWERFULLY HE IS IMBUE\nWITH THE CONVICTION THAT IT IS GOODTO HAVE FINE\nMATERIAL THINGS, SUCH AS SWANKY AUTOMOBILES, WHILE\nAT THE SAME TIME HIS INCOME AND EDUCATION REMAIN AT\nLOW LEVELS, THE MORE POWERFUL BECOMES THE TEMPTATION\nTO REACH FOR THE SO-CALLED FINE THINGS BY ME NS THAT\nARE OUTSIDE THE LAW. . \\ND HERE THE NEGRO IS INVOLVED\nIN A SITUATION MUCH LIKE THAT WHICH HAS BEEN SAID TO\nHOLD FOR NUMBERS OF WHITE PEOPLE BY SOME VERY CAPABLE\nSOCIAL SCIENTISTS. But WE HAVE TO REMEMBER, ONCE\nAGAIN, THAT THE WHOLE NEGRO CLASS STRUCTURE IS, AS IT\nWERE, LOW PITCHED, AND THEREFORE THE PRESSURE TO\nTRANSCEND LEGAL MEANS OF OBTAINING THINGS HITS NeGROE\nPARTICULARLY HARD . . . . ALWAYS ON THE ASSUMPTION THAT\nTHEY HAVE, IN FACT, BEEN STRONGLY IMBUED WITH THE\nGENERAL VALUES THAT EMPHASIZE THE EXCELLENCE OF HAVIN'\nFINE MATERIAL GOODS AND THINGS.\nRICHTER: That you’re saying suggests that Negro crime is at a\nHIGHER RATE IN ACTUALITY THAN WHITE CRIME.\nSCHNEIDER: That is quite possible, and even likely in some areas\nOF CRIMINAL ACTIVITY, PERHAPS IN A GOOD MANY. >T THE\nSAME TIME, THERE A RE UNDOUBTEDLY AREAS OF CRIMINAL\nACTIVITY IN WHICH NEGROES ARE NOT WELL REPRESENTED,\nSIMPLY BECAUSE THEY CANNOT BE. RELATIVELY VERY FEW\nNegroes, for example, could, as individuals, cheat th\nGOVERNMENT OF VAST SUMS OF MONEY DUE ON INCOME TAX.\nBut let me return to my point. I believe the situati\nI’ve described is real. :*nd it has its consequences.\nFor example, Negro racketeers who make a good deal of\nMONEY ARE OFTEN LOOKED UP TO WITH ADMIRATION IN THE"
}