{
  "id": "d201-134",
  "text": "-10-\nCRIME AND DELINQUENCY THAN VA/ E HAVE. The NOTION THAT\nFAMILY FACTORS AND INFLUENCES ARE OF IMPORTANCE IN\nCONNECTION WITH CRIME AN D DELINQUENCY HAS SOME SUPPORT\nAND IS IN AT LEAST SOME DEGREE PLAUSIBLE. BUT I MUST\nSTRONGLY STRESS THAT WE NEED MUCH MORE, AND MORE A\nACCURATE, KNOWLEDGE IN THESE MATTERS. IF, FOR EXAMPLE\nas Or. Frazier contend., Negro boys so often lack male\nMODELS, JUST WHAT DOES THIS MEAN? In EXACTLY WHAT WAY\nMAY IT BE INCITEMENT TO DELINQUENCY? V OULD IT INVARI¬\nABLY LEAD TO DELINQUENCY? If SO, WHY? If NOT, WHY N\nIf delinquency is sometimes an outcome OF SUCH A SITUA\nTION, WHAT OTHER THINGS MAY BE ASSOCIATED WITH SUCH A\nsituation? There are countless other questions that\nSUGGEST THEMSELVES.\nRICHTER: .':e need, then, To know more than we do. But would you\nNOT SAY THAT WE HAVE AT LEAST SOME FAIRLY GOOD GENERAL\nU N D E R S T ANDINGS OF FACTORS THAT IMPELL THE NEGRO TO\nCRIME AND DELINQUENCY?\nSCHNEIDER: Yes. I think I would. »nd th se factors would includ\nA GOOD MANY MO..E THINGS THAN WE’VE BEEN ABLE TO ME NT I\nThe cultural backgrounds of the Negro, the depressed\nCLASS AND STATUS SITUATION OF THE WHOLE NeGRO COMMUN¬\nITY, SUCH FACTORS AS THE HERITAGE OF LAWLESSNESS WHICH\nWAS NENTIONED, THE FREQUENT ABRUPTNESS OF THE TRANSI¬\nTION of the Negro from a rural and Southern environ¬\nment to a Northern or ..estern and urban one .... these ,\nTO BE .SURE, AND NUMBERS OF 0 T H E R TUB N G S , f M A K E'- N EG R 0\nCRIME AND EXCESSIVE NEGRO CRIME WHERE THAT EXISTS,\nREASONABLE COMPREHENSIBLE.\nRICHTER: I take it, then, that you would not find it any more\nNECESSARY HERE THAN ELSEWHERE TO SUPPOSE OR PRESUME,\nTHAT THE NEGRO HAS INNATE OR INBORN QUALITIES THAT\nPROPELL HIM IN THE DIRECTION OF CRIME AND DELINQUENCY\nSCHNEIDER: No, I see no reason for making such a supposition or.\nHOLDING TO SUCH A PRESUMPTION.\nRICHTER: Then, do you think that it would be a fair inference\nTHAT IF AND WHEN THE NEGRO’S CRIMINALITY IS HIGH, FOR\nEXAMPLE, THIS WOULD BE DUE TO FACTORS THAT WOULD MAKE\nTHE CRIME RATES OF NON-NEGROES ALSO HIGH? If THE\nnon-Negroes were subjected to the special conditions\nTHAT MAY INFLATE NEGRO CRIME RATES?\nSCHNEIDCR: I think that this would be a pretty fair inference.\nYou may remember that in a previous program we noted\nTHAT ACCORDING TO THE RESEARCHES OF SC-ME OF THE OLDER\nChicago social scientists there are so-called patho¬\nlogies—like HIGH CRIME RATES, HIGH RATES FOR CERTAIN\nKINDS OF MENTAL ILLNESS, AND SO ON — WH I CH TEND TO BE\nPECULIAR TO AREAS OF THE CITY, RATHER THAN TO ANY"
}