{
  "id": "d201-157",
  "text": "-10-\nRICHTER:\niVlUS I c\n\\NNCR :\nMUSIC\nTHEMES, AND WHOSE NOVELS, INCIDENTALLY, HAVE DEEN\nENORMOUSLY POPULAR. THESE ARE FAIRLY ODVIOUS.CASES.\nSo THERE HAS BEEN SOME BREAKING OF THE MOULDS. Of\nCOURSE, TO STRESS THE TREMENDOUS PRESSURE UPON THE\nNegro artist of the peculiar -merican milieu is not\nTO SAY THAT HE CONCERNS HIMSELF WITH NOTHING BUT NEGR\nLIMITATIONS UNDER AMERICAN CONDITIONS. The POETS, FOR\nEXAMPLE, SING, AS POETS GENERALLY DO, OF LOVE, ADVEN¬\nTURE AND THE BEAUTIES OF NATURE WITHOUT NECESSARILY\nMAKING ANY RACIAL REFERENCE.\nNOW, WE HAVE VERY LITTLE TIME LEFT, LOU, BUT • THINK\nWE SHOULD HAVE SOME NOTION OF THE NEGRO’S STYLE AND\nFEELING. > ND IN THE MOMENTS WE HAVE LEFT, I’D LIKE TC\nread Claude McKay’s famous, '’If We Must Die,'’ which I\nWANT TO READ BECAUSE IT SO NICELY SETS THE STAGE FOR\nNEXT WEEK’S PROGRAM WHICH IS ON NEGRO PROTEST.\nIf we must die, let it not be like hogs\nHunted and penned in an inglorious spot,\nWhile round us bark the mad and hungry dogs,\nMaking their mock at our accursed lot.\nIf we must die, 0 let us nobly die,\nSo THAT OUR PRECIOUS BLOOD MAY NOT BE SHED\nIn vain; then even the monsters we defy\nShall be constrained to honor us though dead’\n0 kinsmen’, we must meet the common foe’.\nThough far outnumbered let us show us brave,\nAnd for their thousand blows deal one deathblow’.\nWhat though before us lies the open grave?\nLike men we’ll face the murderous, cowardly pack,\nPressed to the wall, dying, but fighting back’.\nTHEME UP NO UNOER\nYou have been listening to Or. Louis Schneider, pro¬\nfessor of Sociology at Purdue University and the\nprogram’s producer-director, E. .. Richter, as they\ndiscuss '’The Last Citizen1’. This program was produced\nand recorded by W3 .A, Purdue University, under a gran:\nfrom the Educational Television and Radio Center and\nis being distributed by the National association of\nEducational Broadcasters.\nTHEME UP TO FINISH\n,NNCR :\nThis is the N.aEB Radio Network"
}