{
  "id": "d201-169",
  "text": "THE L .3T CITIZEN\nProgram 16\n'■’Protest'*\nHUGHES:\n(Glory of Negro History) In 1831 another great slave\nREBELLION BROKE OUT IN VIRGINIA, LED BY Nat TURNER.\nIn this one some sixty slave owners were killed, iviore\nTHAN A HUNDRED NEGROES LOST THEIR LIVES BEFORE THIS\nUPRISING WAS SUPPRESSED. SEVENTEEN SLAVES WERE PUT TO\nTRIAL AND HANGED .\nMUSIC:\nSTINGER\n,NNCR :\nThis excerpt from Langston Hughes recording the The\nGlory of Negro History sets the scene for today’s dis-\ncuss i on of '’The Last Citizen”—Protest’.\nMUSIC:\nSTINGER\nvNNCR :\nThe L^st Citizen: The Negro in Am erica., -a series of\nPROGRAMS DEVOTED TO THE EXTENSION OF OUR KNOWLEDGE OF\nTHE LARGEST MINORITY GROUP IN THE UNITED STATES, ITS\nPROBLEMS, AND THE PROBLEMS IT POSES TO ALL AMERICANS.\nThe Last Citizen is produced by Radio Station\nPurdue University, uner a grant from the Educational\nTelevision and Radio Center, in cooperation with the\nNational association of Educational Broadcasters. The\ndiscussants are the producer of the series, E. W.\nRichter, and Sr. Louis Schneider, professor of Socio¬\nlogy at Purdue University. Today’s program: Protest.\nHere now, is mr . Richter.\nRICHTER:\nHe have been concerned with now the Negro has reacted\nTO AND COPED WITH THE VARIOUS LIMITATIONS AND DISCRIMIN\nATIONS THAT HAVE BEEN IMPOSED ON HIM IN AMERICAN LIFE.\n• E HAVE NOT, HOWEVER, AS YET FACED UP SPECIFICALLY TO\nTHE QUESTION OF HOW THE NEGRO HAS STRIVEN TO IMPROVE\nHIS LOT. And the moment one begins to think of this,\nTWO THINGS MUST COME TO MIND: THE Negro’s PROTEST,\nand the Negro’s Defense. Defense would encompass the\nWORK OF SUCH ORGANIZATIONS AS THE NATIONAL URBAN LEAGUE\nCommissions against discrimination, and so forth. Ve\nSHALL BE DEALING WITH THESE NEXT WEEK. FoR THIS WEEK\nWE WANT TO TREAT THE MATTER OF THE NEGRO PROTEST.\nProtest has taken various forms historically. Cut as\nsoon as we become, so to put it, history-minded in\nREGARD TO PROTEST, WE MUST INEVITABLY THINK OF THE EARL\nNegro slave revolts.\nSCHNEIDER:\nOne gathers from the accounts of the historians that\nIN THE PASSAGE FROM ^FRICA TO THE New WORLD THE DANGER\nOF REVOLT IN THE COURSE OF THE VOYAGE WAS A VERY REAL\nONE. ACCORDING TO ONE WELL KNOWN HISTORIAN, ”ThE\nNegro men were usually kept shackled for the first part\nOF THE PASSAGE UNTIL THE CHANCES OF MUTINY AND RETURN"
}