{
  "id": "d201-175",
  "text": "-7-\nRICHTER:\n-ILK I NS:\nRICHTER :\n■ILK INS:\nRICHTER:\nI LK INS:\nDETAILS, EXCEPT TO ADD THAT DY 1909, OR I 9 I 0, THE\nNiagara iviovement was no longer really effective, and\nthe NWCP, with which it merged, had gotten started.\n1 '• E COME THEN TO THE NATIONAL ASSOCIATION FOR THE\nAdvancement of Colored People, undoubtedly the most\nIMPORTANT CONTEMPORARY ORGAN OF NEGRO PROTEST. Ae\ncan’t HOPE TO GIVE A FULL STORY ON THIS, EITHER. 3 u T\nI ? D LIKE TO HAVE US UNDERSTAND SOME SIGNIFICANT FEATURE\nOF THIS MAJOR ORGANIZATION. ^ND TO DO THIS WE’lL\nLISTEN TO THE SUBSTANCE OF AN INTERVIEW WE HAD WITH\nRoy Vilkins, Executive Secretary of the N,*aCP.\n■v'ell, the association, of course,was formed in 1909 FOP\nTHE PURPOSE OF GETTING RID OF DISCRIMINATION AND\nSEGREGATION BETWEEN UNITED STATES CITIZENS ON THE\nOASIS OF RACE AND COLOR. THAT WAS ITS BASIC FORMULAT¬\nING principle. Fifty odd persons gathered in response\nto a call from Oswald Garrison Villard and stated this\nPRETTY V' ELL IN THE CALL TH T THEY ISSUED TO THE REST 0 F\nTHE COUNTRY TO JOIN THEM IN THIS NEW ORGANIZATION. It\nWAS SPARKED, OF COURSE, BY THE RACE RIOTS WHICH HAD\nBEEN HELD IN SPRINGFIELD, ILLINOIS, IN 1908, WHICH\nSHOCKED THE COUNTRY A GREAT DEAL AND THE, AS MOST\nPEOPLE KNOW, THE FIRST TWENTY-ODD YEARS OF THE ASSOCIA¬\nTION WERE DEVOTED ALMOST SINGLE-HANDEDLY TO THE FIGHT\nAGAINST LYNCH I NG — RAC I AL VIOLENCE--AND IT WAS NOT UNTIL\nTHE MIDDLE THIRTIES THAT LYNCHING BEGAN TO DECLINE,\nNOTICEABLY, UNDER THE HAMMERING OF THE FIRST TWENTY,\nTWENTY-FIVE YEARS OF THE ASSOCIATION’S WORK. FlRST I\nLIKE TO THINK THE NA \\CP HAD TO GET THE NEGRO FREE FROM\nPHYSICAL INTIMIDATION AND MURDER BEFORE IT COULD TALK\nABOUT HIS ENJOYING THE REST OF HIS RIGHTS, AND THIS\nTOOK A BIT OF DOING.\nIn OTHER WORDS, THERE WAS A TRANSITION THEN, SOMEWHERE\nALONG THE LINE, FROM THE FIGHT FOR THE PROTECTION OF\nthe Negro physically to the protection of his rights.\nHEN DID THIS CHANGE?\nVell, there wasn’t,...I don’t think it’s fair TO SAY\nTHAT THERE WAS A CHANGE. It WAS ONLY THAT THE EMPHASIS\nUPON LYNCHING WAS AN EMPHASIS RATHER THAN AN EXCLUSIVE\nPROGRAM.\n'■ELL, WAS THERE A CHANGE OF EMPHASIS THEN?\nAh, well, let us put it this way: the association\nBROADENED ITS ACTIVITY AS IT FOUND SUPPORT AND RESOURC\nBEYONq THE LYNCHING FIGHT. FOR EXAMPLE, AS EARLY AS\n1913, IT DECLARED AGAINST SEGREGATION IN THE PUBLIC\nSCHOOLS, So THIS W A S AN OBJECTIVE*. I T DECLARED FOR\nJUSTICE IN THE COURTS, WHICH MEANT THE DUE PROCESS"
}