{
  "id": "d201-179",
  "text": "THE L\\ST CITIZEN\nP 0 G R A M i 7\n’’iiEFEMt.E ,J\nV( ICE' 1 :\nThe National Urbian League fo'rmed in 1910\nVOICE -2:\nThe Southern Regional Council, formeo in 1919\nVOICE 3:\nThe Los Angeles County Committee on Human Relations,\nFORMED IN 1944\nVOICE 4:\nThe Kansas City Mayor* s Commission on Human Relation;:\nFORMED IN....\nVOICE 5:\nThe San Francisco Council for Civic Unity.\nMUSIC:\nSTINGER\nANNCR:\nAn almost unending catalogue of organizations in the\nUnited States devoted to defending and extending the\nRIGHTS OF THE NEGRO, LISTEN AS A E EXAMINE THE WORK\nOF SOME OF THESE ORGANIZATIONS IN OUR CONTINUING DIS¬\nCUSSION of the Negro in America, '’The Last Citizen1’.\nMU3 l C\nSTINGER\n4NNCR:\nThe Last Citizen: The Negro in America. A series\nOF PROGRAMS DEVOTED TO THE EXTENSION OF OUR KNOWLEDGF\nOF THE LARGEST MINORITY GROUP IN THE UNITED STATES,\nITS PROBLEMS, AND THE PROBLEMS IT POSES TO ALL AMER¬\nICAN! S . The Last Citizen is produced by Radio Statics\n73Aa ? Purdue University, under a grant from the\nEductional Television and Radio Center, in coopera¬\ntion with the National Association of Educational\n3roadcasters, The discuss., ts are the Producer of\nthe sfries, E. . Richter, and Dr. Louis Schneider,^\nProfessor of Sociology at Purdue University. iodayV\nprogram: '‘’Defense*’. He^e now, is mr. Richter.\nRICHTER:\nIn the past 16 programs, we have been discussing\nVARIOUS PR 03 LEMS THE NEGRO FACES AND HAS FACED IN\nthe United States over the past three hundred years.\nLast week, we dealt with organized Negro protest.\nA GREAT MANY ORGANIZATIONS DEVOTED TO THE NEGRO’S'\nCAUSE, EITHER THROUGH PROTEST SUCH AS THAT ENGAGED\nin by the National Association for the Advancement or\nColored People, or through the somewhat less public¬\nized ACTIVITIES ENGAGED IN BY DOZENS OF ORGANIZATION,\nSCATTERED AROUND THE COUNTRY—ACTIVITIES WHICH ARE\nLOOSELY BUT USEFULLY CLASSIFIED AS DEFENSE. 'E HAVE\nIN VIEW ORGANIZATIONS SUCH AS THE NATIONAL AND LOCAL\nURBAN LEAGUES, THE SOUTHERN REGIONAL COUNCIL, VARIOU."
}