{
  "id": "d201-183",
  "text": "-5-\nSCHNEIDER :\nRICHTER :\nBRAZIER:\nANOTHER THAT WE LIKE TO THINK OF -- WE WORKED FOR TEN\nYEARS WITH OUR DEPARTMENT STORES HERE IN LoS ANGELES\nTRYING TO SELL THEM ON MERIT EMPLOYEMNT pOR MINORITY\nGROUP PERSONS AS SALES CLERKS, ^E HAVEN’ T COMPLETED\nTHE JOB, BUT THERE ARE Q U I T E A NUMBER OF NEGRO, iVi E X -\nican-Amer i can , Japanese girls now selling directly\nFROM THE FLOOR IN OUR MAJOR DEPARTMENT STORES, JE\nALSO LIKE TO THINK OF THE SUCCESS OF INTEGRATION IN\nTHE BANKS IN LOS ANGELES. HERE AGAIN WE FIND, AFTER\nMANY YEARS OF WORKING WITH PRESIDENTS OF THESE FINAN¬\nCIAL INSTITUTIONS, THAT MINORITY GROUP PERSONS ARE\nBEING HIRED IN VARIOUS CAPACITIES. I COULD GO ON,\nBUT I THINK THERE* D BE TOO NUMEROUS FOR US TO MENTION.\n■ i ALT, 1 NOTE ALSO THAT YOUR INTERVIEW MATERIALS WITH\nMr. Srazier include one story that I think we should\nallow Mr.. Brazier to add, again in his own words.\nIt’sTHE KIND OF THING THA'T ONE CALLS ,?HUM AN INTEREST\"\nMATERIAL, AND I THINK ITS HUMAN INTEREST IS CONSIDER¬\nABLE. I REFER TO THIS MATTER OF ADOPTION AND ADOPTlOt\nAGENCIES.\nVery WELL, then. Here’s Mr. Brazier to tell us the\nSTORY.\nSome years ago here in Los Angeles, none of the\nPRIVATE ADOPTION AGENCIES WOULD ACCEPT MINORITY GROUi\nchildren. And we approached the Boards of Directors\nOF THESE AGENCIES AND ASKED THAT THEY CONSIDER ACCEPT¬\nING them. That there were many minority group parent-\nOR FAMILIES THAT WANTED TO ADOPT CHILDREN BUT HAD NO\nWHERE TO TURN, DID NOT HAVE THE LEGAL PROTECTION THAI\nTHEY COULD GET FROM SUCH AGENCIES AS THEIRS, AND THAT\nWE FELT THEY OULD FIND THIS VERY HELPFUL TO THE\nCOMMUNITY. TWO OF THE AGENCIES ACCEPTED OUR CHALLENGE\nAND AFTER KEEPING THE YOUNGSTERS THERE FOR SEVERAL\nMONTHS, THE AGENCIES CALLED US AND SAID, '’W'e’rE NOT\nABLE TO PLACE THESE YOUNGSTERS. V0ULD YOU, WHAT’S\nwrong?” And we immediately asked, ”How do you go\nABOUT PLACING YO R CAUCASIAN YOUNGSTERS?” ”WELL, WE\nADVERTISE.” JE SAID, ” AELL, DO THE SAME FOR THE\nminority group youngsters.” They called in several\nOF THE METROPOLITAN PAPERS AND CARRIED A PICTURE OF A\nVERY BEAUTIFUL LITTLE CHILD, ONE OF A DARKER HUE AND\nONE OF A LIGHTER HUE, AND THE CAPTION WAS ’’LOOKING F\nHomes.” Je later learned from the adoption agency\nTHAT THEY HAD OVER 350 REQUESTS FOR THOSE TWO CHI LORE\nToday, as a result of this initial effort on the part\nof the Urban League, we now have what is called a\nJoint recruitment agency. Their primary purpose is t\nINTERPRET, THROUGH THE MINORITY GROUP COMMUNITY, WAY;\nAND MEANS OF GOING AB0UT AD0PTING A CHILD AND DISPROV¬\nING MANY OF THE MYTHS THAT THE ADOPTION RULES AND\nREGULATIONS ARE SO SEVERE AND SO STRICT THAT THEY\nCAN’T ADOPT A CHILD. I LIKE TO THINK OF THIS HUMAN"
}