{
  "id": "d201-184",
  "text": "-6-\nRICHTER:\nSCHNEIDER:\nR I CHTER :\nRELATION ELEMENT IN ADOPTION BECAUSE IT HAS BENEFITTED\nSO MANY OF THE MINORITY GROUP FAMILIES IN LoS ANGELES.\nBefore we move on, we should note that these statement\nEXEMPLIFY ONLY A FEW OF THE ACTIVITIES OF THE URBAN\nLeague. We could fill several hours of programs with\nSTORIES AND ANECDOTES. BuT AT LEAST WE HAVE A NOTION\nOF THE TYPE OF WORK THE URBAN LEAGUE DOES. But NOW,\nLOU, WHAT mDOUT THE SOUTHERN REGIONAL COUNCIL? CaN\nYOU GIVE US SOMETHING OF THE BACKGROUND OF THIS ORGAN¬\nIZATION?\nThe Council grew out of a prior organization known as\nthe Commission on Interracial Cooperation. The latter\nAS ITS NAME WOULD, OF COURSE, INDICATE, WAS A JOINT\norganization of whites and Negroes. It HAD ITS CENTER\nin Atlanta, and was organized immdiately after World\nWar One in 1919. If I may again use myrdal’s words,\nIT WAS organized in '’an effort to meet the great uncer\nTAINTY AND STRAIN IN THE RELATIONS BETWEEN WHITES AND\nNegroes after the First World War. 11 In 1957, the\nCongressional Record printed an account of the Commis¬\nsion FROM WHICH I ’ D LIKE TO QUOTE 3R I E F LY :\n■’The commission was founded by a group of the\nSouth’s leading church men and women. The commission\nhelped organize, extend, and guide the work.of State\nAND LOCAL INTERRACIAL COMMITTEES. It ASSISTED THEM IN\nMAKING THEIR INFLUENCE FELT BY NEWSPAPERS, CIVIL\nAUTHORITIES, CHURCHES, SCHOOL OFFICIALS, POLICE ADMIN¬\nISTRATORS, AND HEALTH OFFICERS. It GAVE MUCH ATTEN¬\nTION TO FACTUAL ANALYSIS OF THE PROBLEM OF LYNCHING\nAND OTHER FORMS OF INTERRACIAL VIOLENCE. I T S AUXILIAR\nTHE ASSOCIATION OF SOUTHERN vVoMEN FOR THE PREVENTION\nof Lynching, under the driection of Mrs. Bessie\nDaniel Ames, did much to educate public opinion in\nTHE CAUSES AND POSSIBLE REMEDIES FOR SUCH VIOLENCE.\n'’In its 25 years of operation, the commission made\nTHE MEETING OF WHITE AND NEGRO CITIZENS FOR THE DIS¬\nCUSSION OF COMMON PROBLEMS AN ACCEPTED PRACTICE ALMOST\nEVERYWHERE IN THE SOUTH. It MARSHALLED THOUSANDS OF\nSOUTHERN CHURCH PEOPLE IN OPPOSITION TO LYNCHING AND\nOTHER INJUSTICES, 3R0UGHT NEW LIGHT TO BEAR ON RACE\nRELATIONS, ISSUED TWO MILLION COPIES OF PAMPHLETS AND\nLEAFLETS, AND SYMBOLIZED THE FAITH OF THE SOUTHERN\nWHITE PROPLE AND NEGRO PEOPLE IN THE PROCESSES OF\nMUTUAL AGREEMENT AND COOPERATION.*’ IN THE YEARS 1939\nTO 1944, THE TRANSITION FROM THE COMMISSION ON INTER¬\nRACIAL Cooperation to the Southern Regional Council\ntook place.\nWhen we visited the offices of the Southern Regional\nCouncil in Atlanta during the summer of 1958, ivir.\nHarold Fleming, the present Director, telescoped some\nOF THIS HISTORICAL BACKGROUND AND WENT ON TO MAKE SOME\nFURTHER INTERESTING COMMENTS ABOUT THE WORK OF THE\nCOUNCIL."
}