{
  "id": "d201-190",
  "text": "THE L\\ST CITIZEN\nProgram 18\ns?The Present and the\nFuture ■’\n;,! AYS:\n1 THINK THAT A E WILL INEVITABLY MOVE TOWARDS DESEGRE\nGAT ION IN EVERY AREA OF AMERICAN LIFE, HOW LONG WIL\nIT TAKE? 1 DON’T KNOW.\nMUSIC:\nSTINGER\nANNCR:\nA VIEW OF THE FUTURE GIVEN BY Dr. BENJAMIN E. MAYS,\nPresident of More house College in Atlanta, Georgia.\nVe shall hear more from Dr. Mays and others as we t,v\nUP THE MATTER OF \"ThE PRESENT AND The FUTURE*’ IN THI\nTHE FINAL PROGRAM IN THE SERIES, '’ThE LAST C|TIZEN,t,\nMUS1C:\nSTINGER\nANNCR:\nThe Last Citizen: The Negro in America. A series o\nPROGRAMS DEVOTED TO THE EXTENSION OF OUR KNOWLEDGE 0\nTHE LARGEST MINORITY GROUP IN THE UNITED STATES, ITS\nPROBLEMS, AND THE PROBLEMS IT POSES TO ALL AMERICANS\nThe Last Citizen is produced by Radio Station pJBAaj\nPurdue University, under a grant from the Educationa\nTelevision and Radio Center, in cooperation with the\nNational Association of Educational Broadcasters. T\nDISCUSSANTS ARE THE PRODUCER OF THE SERIES, E. vV,\nRichter, and Dr. Louis Schneider, professor of Soci¬\nology at Purdue University, Today’s program: The\nNegro; his Present and his Future. Here now, is\nMr. Richter.\nRICHTER:\nFor the past seventeen weeks we have been exploring\nVARIOUS FACETS OF THE LIFE OF THE NEGRO IN AMERICA.\nToday we shall engage in some general reflections\nabout the materials we have covered. Our major ques\nTION IN ORGANIZING THESE REFLECTIONS IS THIS: LOOK\nING AT THE MATTER IN TEsMS OF THE INTERESTS AND VALU\nof the Negro, is there ground for optimism about his\nCAUSE IN THE UNITED STATES IN THE NEAR FUTURE? CaN\nWE BEGIN TO ANSWER THAT QUESTION, LOU9\nSCHNEIDER:\n1 BELIEVE THERE IS WARRANT FOR SOME 0 PT 1 M1 SM. . . .EVEN\nIF IT MUST OFTEN BE AN OTIMISM TEMPERED BY CAUTION,\nLet me try to indicate one ground of optimism to\nWHICH NUMBERS OF STUDENTS OF RACE RELATIONS ASSIGN\nSOME IMPORTANCE. It’S SOMETHING WE’VE BEEN OVER,\nBUT 1 THINK THIS IS AN APPROPRIATE TIME TO STRESS IT\nagain. When we look at the so-called Negro problem\nIN ALL ITS FACETS, IN ALL ITS ASPECTS, IN ALL ITS\nDIMENS IONS. ...HOWEVER YOU WISH TO PUT IT....I SUPPOS\nIT’S RATHER EASY FOR US TO FEEL OVERWHELMED IF WE\nLOOK FOR A SOLUTION WHICH, AS YOU PUT IT, WOULD BE !"
}