{
  "id": "d201-192",
  "text": "-3-\nRICHTER :\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nWHAT THE STRATEGIC FACTORS IN ACTUAL SITUATIONS ARE.\nAlso as we’ve suggested before, you can get a\nSTRATEGIC DISPLACEMENT, A STRATEGIC 'JUSH , THAT WILL\nSET OFF A RAMIFYING DOWNWARD MOVEMENT THAT IS ALSO\nCUMULATIVE AND VERY POWERFUL. FINALLY, IT IS POSSIBL\nTHAT IN VARIOUS PARTICULAR SITUATIONS YOU MAY GET\nINTERFERENCE FROM OUTSIDE THE SPIRAL. Thus, AS I\nBELIEVE WE’VE NOTED, WHITES SEEING THE POWERFULLY\nRAMIFYING, CUMULATING EFFECTS OF AN UPWARD SPIRAL\nMIGHT STILL BE IN A POSITION TO PUT A HALT TO IT BY\nSOME KIND OF INTERVENTION FROM OUTSIDE THE SPIRAL\nSYSTEM. OF COURSE, THERE MIGHT BE TIMES WHEN THEY\nCOULD NOT READILY DO THIS OR WHEN THEY COULD NOT DO\nIT AT ALL.\nI TAKE IT THAT DESPITE THESE QUALIFICATIONS, YOUR\nFEELING IS THAT THE principle you’ve BEEN talking\nABOUT STILL WARRANTS A CERTAIN DEGREE OF OPTIMISM.\nI TAKE IT, TOO, THAT YOU WOULD AGREE THAT IN THE\nPRESENT DAY IN THE UNITED STATES IT IS POSSIBLE TO\nSEE THE UPWARD OR BENEFICENT SPIRAL AT WORK?\nYes, mind you, it still does seem to me that a good\nBIt’oF PLANNING IS NECESSARY AT VARIOUS LEVELS IN\nORDER TO MAKE UPWARD SPIRALS WORK WITH MAXIMUM EFFECT\niveness. Further, a good deal of research is needed\nSO THAT WE MAY HAVE BETTER KNOWLEDGE OF WHAT STRATEG\nFACTORS ARE, AND OF PRECISELY HOW THEY WORK. <aven\nNOW, HOWEVER, THERE IS A CERTAIN AMOUNT OF PERTINENT\nKNOWLEDGE AND I SHALL ADHERE, AT LEAST FOR THE TIME\nBEING, TO MY QUALIFIED OPTIMISM ON THIS WHOLE MATTER\nOo YOU FEEL OPTIMISM ON ANY OTHER GROUNDS?\nI do. Again providing that there are certain quali¬\nfications. Antipathy to those who have different\nSKIN COLOR, AND PRACTICES OF SEGREGATION AND DlSCRIM\nINATION ARE LEARNED SENTIMENTS AND ACTIONS. In THE\nWORDS OF THE SONG FROM ”SoUTH PACIFIC\", '’You’VE JOT\nTo Be Carefully Taught.”\nJust how does this give ground for optimism?\nPrejudice and discrimination are learned from others\nHuman beings are not ’naturally” prejudiced. Pre¬\njudice IS NOT CARRIED IN THE GERM PLASM. A NEW\ngeneration of Southerners not raised in the South,\nbut in an environment free of prejudice would itself\nBE FREE OF PREJUDICE. NOW I’M PUTTING THIS IN A\nSIMPLIFIED WAY. ”*E MUST REMEMBER THAT PREJUDICE IS\nOFTEN SUSTAINED BY THE GAINS THAT COME FROM DISCRI¬\nMINATION. IT MAY BE ALSO THAT HUMAN 3EINGS HAVE\nCERTAIN IMPULSES TOWARD THE ASSERTION OF THE P R I M A Cv"
}