{
  "id": "d201-3",
  "text": "-4-\nR1CHTER:\nSCHNEIDER:\nRICHTER:\nEASILY I DENT 1 FI ED. . .HE HAS HIGH V ISI B I LITY . . . . S I MPLY\nBECAUSE OF HIS PIGMENTATION. At THE SAME TIME HE PRE¬\nSENTS to Americans some of the most difficult moral,\nSOCIAL, POLITICAL, AND ECONOMIC PROBLEMS THAT ARISE IN\nREGARD TO ANY MINORITY GROUP, AND FOR ALL PRACTICAL\nPURPOSES THE NEGRO MINORITY IS THE LARGEST IN THE\ncountry. There are, to be sure, about five million\nJews; there are Chinese, Japanese, FilIpinos, Puerto\nRicans, Mexicans...all less numerous than Negroes in\nthe United States. And we hardly bother any longer to\nAPPLY THE TERM, MINORITY, EVEN TO SOME OF OUR MOST\nRECENT IMMIGRANT GROUPS SUCH AS POLES, OR ITALIANS, OR\nGreeks. Or even if we do, we are so aware that Negroes\nREPRESENT THE ? B I GMINORITY PROBLEM THAT OTHER GROUPS\nARE OVERSHADOWED WHEN WE HAVE REFERENCE TO MINORITIES.\nThe Negro is the Conscience-Disturbing man. Gunnar\niViyrdal, in his study of the American Negro, An American\nDilemma, indicates that the dilemma of which he speaks\nis this: if we wish to hold to democratic principles,\nWE CANNOT SHOW PREJUDICE AND DISCRIMINATION TOWARD AN\nARBITRARILY SELECTED TENTH OF THE NATION: IF WE DO\nSHOW THE PREJUDICE AND DISCRIMINATION, WE CAN HARDLY\nPROFESS TO BE ADHERING UNQUALIFIEDLY TO DEMOCRATIC\nprinciples, The .Negro; creates.much unea si nessiamongiu\nThere are voices from abroad that sometimes mock,aand\nSOMETIMES POUR SCORN UPON US.. .VOICES THAT TELL US TH,\nMUCH OF THE WORLD BECOMES SKEPTICAL OF OUR DEMOCRATIC,\nHUMANITARIAN, AND CHRISTIAN PROFESSIONS AS LONG AS THE\nNegro continues to receive the treatment he does.\nThese voices mingle with inner voices of our own that\nINTIMATE THAT THERE MAY BE JUSTIFICATION FOR THE VOICES\nFROM ABROAD. THE NEGRO THUS PRODUCES A MORAL SPLIT\nWITHIN THE WHITE MAN HIMSELF. SOME ARE QUITE RIVEN BY\nTHIS SPLIT; OTHERS ARE RELATIVELY FREE OF IT. BUT, IT\nIS A FAIR PRESUMPTION THAT A GOODLY PROPORTION OF US\nCAN, AND AT TIMES DO, BECOME MUCH DISTURBED OVER THE\nso-called Negro problem in its highly important moral\nDI MENS I ONS .\nThese are a few of the possible answers to our question\nAS TO WHO THE ‘’LAST CITIZEN™ IS... I SAY A FEW OF THE\nPOSSIBLE answers, and even the ones that we’ve given\nARE HARDLY MORE THAN SKETCHES . . . I NCOMPLETE .\nAnd this is one of the things we hope to do in this\nSERIES. ..FIND OUT JUST VH0 THE AMERICAN NEGRO IS.\nHow MANY OF US REALLY K N QW ANYTHING ABOUT NEGROES?\nOr even one Negro? And what the fuss is all about9...\nLet’s turn to the eminent historian and author, Jr.\nRayford Logan of Howard University in Washington, D.C."
}