{
  "id": "d201-32",
  "text": "-9-\nSCHNEIDER:\nRICHTER:\nSM I TH :\nSCHNEIDER:\nQUOTED STATEMENT OF BooKER T. WASHINGTON i?TH A T YOU\nCAN’T HOLD A MAN DOWN IN THE GUTTER WITHOUT GETTING\nDOWN THERE YOURSELF.* DOESN’T THIS IMPLY A PSYCHO¬\nLOGICAL DAMAGE TO THE WHITE MAN?\nLet’s return again for a moment to the -American\nCreed. I think we’ve seen that this creed has some\npower in American life and in the moral outlook of\nAmericans. Insofar as this is the case they are\nBOUND TO FEEL GUILT FOR PREJUDICE, DISCRIMINATORY\nBEHAVIOR, AND SEGREGATIVE ACTION. THE SUBJECT OF\nGUILT ON THE PART OF THE WHITE MAN, THE GUILT THAT\nARISES IN HIM IN CONNECTION WITH TREATMENT OF THE\nNegro is a large one and I wonder whether it might\nNOT BE A GOOD IDEA TO HAVE A LOOK AT HOW THIS GUILT\nFUNCTIONS IN A SPECIFIC AREA.\nIn our chat with Lillian Smith SHE BROUGHT UP THIS\nMATTER OF GUILT, LOU, RELATING IT TO SEX, AND EVEN\nLOVE, BETWEEN WHITE MEN OF THE SOUTH AND NEGRO WOME\nof the South.\nAnd as we know historically, this existed. And ex¬\nisted AMONG LARGE NUMBERS OF OUR PEOPLE. AND THAT\nWAS A RELATIONSHIP OF DISESTEEM, TOO, YOU SEE* AND\nALSO A RELATIONSHIP OF GUILT. GuiLT...WE HUMAN BE!\nBEINGS... I THINK IT’S WONDERFUL THAT WE CAN FEEL\nGUILT. ..BUT A GUILT THAT WE DON’T UNDERSTAND, AND\nGUILT THAT IS SUPPRESSED IN US, DOES US GREAT PSY¬\nCHOLOGICAL HARM. VHEN WE CAN BRING IT OUT AND SAY\n;’YES, I SHOULD FEEL GUILTY ABOUT THIS THING THAT\nI’ve done because this thing is wrong”. -Jell, now,\nTHAT KIND OF GUILT CAN ‘fctLP US GROW. BuT THE KIND\nOF GUILT THAT IS VAGUE. ..AND WE CAN FIND NO NAME FC\nAND WE FIND, INSTEAD, CURIOUS RATIONALIZATIONS FOR\n...THAT KIND OF GUILT CAN HURT US MORALLY, AND PSY¬\nCHOLOGICALLY. .«E WON’T QUITE ADMIT THAT THESE THIN\nHAPPEN. And SO INSTEAD WE BUILD UP ANXIETY AND\nGUILT FEELINGS, AND A DESIRE NOT TO THINK ABOUT IT\nCLEARLY. AND SO I FEEL THAT THE MIND OF THE SOUTH\nHAS BEEN INJURED BY SEGREGATION, BECAUSE OF ALL THE\nDICHOTOMIES AND AMBIVALENCES AND AMBIGUITIES THAT\nHAVE BEEN CREATED BY THE ATTITUDES AND BUILT UP BY\nOUR ACTIONS. So I FEEL THAT WE REALLY HAVE BEEN\nHURT BY IT.\nI AM REMINDED OF fvi Y R D A L ’ S VIEWS OF THE PSYCHOLOGY\nOF SEXUAL RELATIONS BETWEEN WHITE MEN AND NEGRO\nwomen. These give only one example of how guilt\nFEELINGS CAN BE BUILT UP IN THE RELATIONS OF WHITE L"
}