{
  "id": "d201-48",
  "text": "-2-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nfessor of Sociology at Purdue University. Today’s\nprogram, '’The Changing Image1’, Part Two. Here now i\nMr. Richter.\n‘n Part One of our discussion of ‘’The Changing Image\nWE CONCENTRATED ON THE EVOLVING CONCEPTIONS OF THE\nNegro in the United States until the time of the\nCivil War .\nWe noted that when the Negro is subjected to handi¬\ncapping (CONDITIONS HE DOESN’T LOOK ‘’VERY GOOD’’.\nThus, if you have state laws forbidding him to learn\nREADING AND WRITING YOU CAN’T EXPECT HIM TO PRODUCE\nGREAT WORKS OF LITERATURE. VVE MUST SAY THAT THE\nIMAGE WE HAVE OF THE NEGRO HINGES TO A GREAT EXTENT\nON HIS APPEARANCE TO AFTER WE HAVE TREATED HIM A\nCERTAIN WAY. AND AFTER WE HAVE TREATED HIM A CERTAIN\nWAY, IF WE’RE UNEASY ABOUT IT, WE WANT TO JUSTIFY OUR¬\nSELVES ~ AND THEN WE HAVE TO PROVE THAT HE WAS WORTH¬\nLESS ALL ALONG. JUST TO SHOW THAT WE WERE '’RIGHT”\nIN TREATING HIM THE WAY IN WHICH WE DID. THESE\nTHINGS ONE INEVITABLY FINDS WHEN ONE INQUIRES INTO\nTHE NATURE OF THE IMAGE HELD OF THE NEGRO UP UNTIL\nthe Civil War, or for that matter thereafter.\nToday we continue the story of the image of the Negr*\nin America. We will touch, at least briefly, on\nFOUR MAIN PERIODS SINCE THE ClVIL WA R, EACH OF WHICH\nHAD A PROFOUND INFLUENCE ON THE IMAGE OF THE ^EGRO,\nThe four periods are; Reconstruction, the period\nbetween Reconstruction and the turn of the Century,\nTHE PERIOD AROUND WORLD WAR I, AND THE PERIOD FROM\n1930 TO THE PRESENT.\nGoing directly into the Reconstruction period, it\nMIGHT BE WELL TO NOTE THAT AT THIS TIMETHE GREAT\nMAJORITY OF NEGROES STILL LIVED IN THE SOUTH. JE\nMUST ALSO REMEMBER THAT, IMMEDIATELY AFTER THE ClVIL\n'Var, the Confederate States were treated as conquered\nlands. Federal troops occupled the chief towns, and\nTHE TROOPS INCLUDED NUMEROUS NEGROES. SOUTHERNERS\nWERE UNDOUBTEDLY RESENTFUL ABOUT THIS. PERHAPS\nRESENTFUL ISN’T A STRONG ENOUGH TERM. THE EVIDENCE\nSUGGESTS THAT MANY OF THEM WERE SIMPLY SHOCKED.\nAmong the Negro troops were former servitors of the\nWHITES, AND THIS, UNDER THE CIRCUMSTANCES COULD ONLY\nINTENSIFY FEELINGS OF RESENTMENT AND SHOCK. We HAVE\nTO REMEMBER, TOO, THAT THIS OCCURRED AT A TIME WHEN\nthe Army of the Confederacy had been disbanded and it\nwas forbidden to wear the Southern uniform. To re¬\nsentment and shock, we should probably add fear -\nWIDESPREAD fear, for example, in the YEAR 1865, THA ;"
}