{
  "id": "d201-50",
  "text": "-4-\nSCHNEIOTR:\nRICHTER:\nSCHNEIDER:\nVOICE:\nIMAGE, IF YOU WISH, LOU, WAS THE PREVALENT ONE IN THE\nSouth after the Civil War?\nThis kind of view was certainly very widespread* We\nfind Governor D. S. Jalker of Florida, in an inaugura\nADDRESS OF DECEMBER 20, 1865, PRAISING THE NEGRO FOR\nHIS FAITHFULNESS TO SOUTHERN WHITES, IN WAR AND PEACE\nThe Governor notes that it is not the Negroes’ fault\nTHAT THEY ARE FREE. He A, DDS, ,?BUT THEY ARE FREE*\nThey are no longer our happy contented slaves, with\nAN ABUNDANT SUPPLY OF F 0 00 AND CLOTHING FOR THEMSELVE\nAND FAMILIES, AND THE INTELLIGENCE OF A SUPERIOR RACE\nTO LOOK AHEAD AND MAKE ALL NECESSARY ARRANGEMENTS FOR\nTHEIR C OM FO R T ’. The IDYLLIC PICTURE OF THE NEGRO’S\nCONDITION UNDER SLAVERY IS, TO PUT IT AS MILDLY AS\nPOSSIBLE, VERY nFpATAotc, BUT THE IMPORTANT THING HER\nof is the Governor’s bland assumption of the\nSUPERIOR INTELLIGENCE OF WHITES. It SOUNDS AS IF\nTHIS WOULD NOT HAVE BEEN A MATTER OF ARGUMENT FOR HIM\nAT ALL.\nIT STRIKES ME LOU, THAT THIS SORT OF AN IMAGE. ..THE\nONE OBVIOUSLY HELD BY GOVERNOR WALKER...IS A SURVIVAL\nOF A PRE-CIVIL WAR IMAGE.\nIT IS, AND THERE’S A POINT TO BE MADE HERE, THAT IS\nTHAT THE PRE-CIVIL WAR IMAGES, PARTICULARLY THOSE\nANTAGONISTIC TO THE NEGRO WERE RE-ENFORCED AND AUG¬\nMENTED by Reconstruction conditions and experience.\nB . \"Ci. .Truman., at jdur^ia l i st who, after thef.C i v i llWarl -■\nREPORTED ’.ON CONDITIONS) I N ! THE •; S.OUTH T 0 v R R E S ,1 D E N T A ■'\nJohnson and_to_Ccngress:wroie$* l, 1\n’’Almost the only key that furnishes a satisfactory\nsolution to the southern question in its relations to\nthe Negro, that gives a reasonable explanation to the\ntreatment which he receives and the estimation in\nWHICH HE IS HELD, IS FOUND IN THE FACT - TOO OFTEN\nFORGOTTEN IN CONSIDERING THIS MATTER - THAT THE PEOPL:\nFROM THEIR EARLIEST DAYS HAVE REG \\ RDED SLAVERY AS HIS\nPROPER ESTATE. ..THAT A VAST MAJORITY OF THE SOUTHERN\nPEOPLE ENTERTAIN THIS OPINION, NO ONE WHO TRAVELS\nAMONG THEM FOR EIGHT MONTHS CAN DOUBT...\n'’Holding that the Negro occupies a middle ground\nBETWEEN THE HUMAN RACE THE ANIMAL, THEY REGARD IT AS\nA ••• REAL MISFORTUNE TO HIM THAT HE SHOULD BE STRIPPED\nOF A PROTECTOR. ..THE P RSISTENCY AND HONESTY WITH\nWHICH MANY, EVEN OF THE GREATEST MEN OF THE SoUTH,\nHOLD TO THIS OPINION, IS ALMOST UNACCOUNTABLE TO A\nNorthern man, and is an element of such magnitude\nTHAT IT CANNOT WELL BE OMITTED FR OM . . . CO NS I DERAT I ON . tT"
}