{
  "id": "d201-52",
  "text": "-6-\nLOGAN :\nSCHNEIDER:\nBut what amazed our students, and I might say shocked\nME WAS THE EVIDENCE OF THE STEREOTYPES IN LEADING\nNATIONAL MAGAZINES. -HEN ONE OF THE STUDENTS FIRST\nBEGAN TO REPORT ON THE ANECDOTES AND THE CARTOONS AND\nTHE STORIES IN HARPER’S MAGAZINE, FRANKLY I DID SGT\nBELIEVE THAT STUDENT, AND HAD HER BRING COPIES OF\nHarper* s Maga z i ne to class so that we could have th u:\nVISUAL EVIDENCE. I THINK ONE MIGHT BE SAFE IN SAYING\nTHAT THERE IS HARDLY A NEWSPAPER IN THE DEEP SOUTH\nTODAY WHICH LAMPOONED AND CARICATURED NEGROES AS DID\nHarper* s Magazine in that period between 1877 and ISO\nThe North American Review, a scholarly magazine, was\nNOT A.... BAD AS HARPER’S, BUT THE IMqRTH AMERICAN REVIEW\nGENERALLY TOOK A POSITION IN SUPPORT OF THE SOUTH.\nMost of the contributors to the short stories in\nAtlantic Monthly, and in its various departments, wed\nSoutherners, and they wrote some of the most outlandi\nSTORIES IN THE MOST ATROCIOUS DIALECT THAT ONE COULD\nPOSSIBLY READ. SIMILAR ARTICLES LAMPOONING NEGROES\nAPPEARED IN THESE NORTHERN NEWSPAPERS.\nLet*s put beside this statement of Professor Logan’s\nSOME OF WHAT THE HISTORIAN, C. ^ANN VOODWARD TELLS\nUS IN HIS VALUABLE LITTLE BOOK, THE STRANGE CAREER\nof J i m Crow . He points out that as far as action in\nRELATION TO THE NEGRO IS CONCERNED IT TOOK THE ^OUTH\nabout a dozen years after 1877 to get launched on a\nJim Crow program. He recounts how, as recently as :\n1885, one T. McCants Stewart, a Negro newspaper man\ntravelling down from Boston to South Carolina, found\nno discrimination directed against him on railroad\ntrains or in general when he was prepared to dine.\nHe was impressed, according to our historian, with\n,f TH E EASE AND FREQUENCY WITH WHICH WHITE PEOPLE ENTEI\nINTO CONVERSATION WITH HIM FOR NO OTHER PURPOSE THAN\nTO PASS THE TIME OF DAY*’. He IS REPORTED AS SAYING\nf*l THINK THE WHITES OF THE SOUTH \\RE REALLY LESS\nAFRAID TO HAVE CONTACT WITH COLORED PEOPLE THAN THE\nWHITES OF THE NoRTHif. It WOULD BE FOOLISH TO ARGUE\nTHAT THIS AND OTHER LINES OF TESTIMONY ESTABLISH IT\nAS A FACT THAT THE NEGRO ENJOYED ANYTHING LIKE FULL\nSOCIAL EQUALITY WITH WHITES IN THE SOUTH AT THIS TIME\nBut the important matter is that within a short time\nafter Stewart’s visit the South began to exhibit an\nEXTREME IN RACISM THAT HAD NOT BEEN MANIFEST BEFORE.\nROUGHLY, ABOUT THE YEAR 1890 WHEN THE J|M CROW CAR\nMOVEMENT GATHERED FORCE. The SUPREME COURT HAD\nALREADY BEGUN TO WEAKEN IN ITS RESISTANCE TO THE R\nRACIST OUTLOOK, AND, IN A CASE DECIDED IN 1896 ES¬\nPOUSED THE DOCTRINE THAT ’’LEGISLATION IS POWERLESS\nTO ERADICATE RACIAL INSTINCTS."
}