{
  "id": "d201-53",
  "text": "-7-\nRICHTER:\nSCHNEIDER:\nRtCHTER :\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nDoes C. Vann Woodward have anything to say about\ni mages?\nYes, he points out that in literary materials such\nas the popular novels of the time there also seems to\nBE A RATHER SHARP SHIFT. BEFORE THE LAST DECADE OF\nthe I 9th Century, according to his review of relevant\nMATERIAL, THE PICTURE OF THE N EGRO THAT EMERGES IS\nONE THAT INSPIRES A KIND OF RESPECT,SYMPATHY , AND\nEVEN INDULGENT TENDERNESS AND AFFECTION.\nHe refers, I suppose, to the Uncle Remus Tales and\nSIMILAR WRITINGS?\ny\nes, that’s what he has in mind. But by the end of\nthe Century the picture has definitely begun to\nchange. Anglo-Saxon superiority doctrines were find¬\ning MUCH FAVOR OUTSIDE THE SOUTH, IN CONNECTION WITH\nAmerican enterprises in the Pacific and Carribbean.\nThese doctrines fitted in neatly with Southern convic¬\ntions ABOUT WHITE SUPERIORITY AND'THE NEED FOR WHITE\nSUPREMACY. By 1900, AND IN THE YEARS IMMEDIATELY\nFOLLOWING, WELL KNOWN TITLES HAD BEGUN TO APPEAR, SUC h\nas Charles Carroll’s The Negro. A Beast, or specifi¬\ncally FICTIONAL ITEMS SUCH AS THOMAS WjxoN’S, T HE\nLeopard’s Spots: A Romance of the White Man’s Burden-\n186 3-1900, and the same writer’s The Clansman: An\nHistorical Romance of the KuKluxKlan. and The Traitor\nA.Story of the Fall of the Invisible Empire. As one\nMIGHT GUESS FROM THE TITLES, THESE BOOKS, POPULAR AS\nTHEY WERE, DID MUCH TO CREATE A DISTINCTLY UNFAVORABLE\nIMAGE OF THE NEGRO.\nV/OULD YOU SAY, LoU, THAT THERE WAS MUCH CHANGE IN TH i\nNEGATIVE IMAGE OF THE NEGRO IN THE PERIOD FOLLOWING\nTHE TURN OF THE CENTURY UNTIL, SAY. ..THE OUTBREAK OF\nthe First World War?\nell, anthropologists, like Franz Boaz, were in this\nPERIOD GIVING LITTLE COMFORT TO RACIALIST THEORIES\nTHAT WOULD IMPUTE INFERIORITY TO THE NEGRO. ON THE\nOTHER HAND, THERE WAS MUCH RATHER POPULAR MATERIAL\nWHICH WAS CLEARLY IN THE RACIALIST VEIN. I HAVE\nHERE A COPY OF A FAMOUS. ..OR PERHAPS A BETTER '.WORD\nIS NOTOR I OUS * . . BOOK BY iVlADISON GRANT, ORIGINALLY\nPUBLISHED IN 1916, ENTITLED THE PASSING OF THE GREAT\nRA c E WHICH MADE SOMETHING OF A STIR IN ITS DAY AND\nWHICH SCHOLARS, AT LEAST, HAVE NOT FORGOTTEN. GRANT\nWROTE IN AN EASY, FLUID STYLE THAT VERY PROBABLY\nPERSUADED MANY READERS WHO COULD NOT EVALUATE HIS\nARGUMENTS PROPERLY. HERE ARE SOME OF HIS CHOICE WORD'\nABOUT THE NEGRO: !J WHENEVER THE INCENTIVE TO IMITATE\nTHE DOMINANT RACE IS REMOVED, THE NEGRO OR, FOR THAT"
}