{
  "id": "d201-72",
  "text": "THE LAST CITIZEN\nFRaZIER:\nHOLLAND:\nCL^RK:\nMUSIC:\nAIM NCR:\nMUSIC:\nANNCR:\nRICHTER:\nProgram #7\n'’The Second Schoolhouse”\nPart I\ni HAVE TAUGHT ALL KINDS OF STUDENTS. I HAVE TAUGHT\nWHITE STUDENTS WHO WERE STUPID, I HAVE TAUGHT WHITE\nSTUDENTS WHO WERE VERY BRILLIANT. I HAVE TAUGHT NEGRO\nSTUDENTS WHO WERE STUPID, AND NEGRO STUDENTS WHO WERE\nBRILLIANT.\nOur Nation needs, beyond the shadow of doubt, all the\nqualified manpower in all of the vocational classifi¬\ncations.\nThere are some Negroes who can make their most creative\nCONTRIBUTION TO SOCIETY BY VOCATIONAL EDUCATION—\nBECOMING SKILLED IN CERTAIN TRADES. THERE ARE OTHER\nNegroes who can make a more constructive contribution\nTO SOCIETY BY THE HIGHEST TYPE OF ACADEMIC EDUCATION.\nSTINGER\nThese have been a few excerpts from three of many\nDISCUSSIONS WHICH HAVE BEEN, AND ARE CONTINUING TO\nRAGE OVER THE QUESTION OF THE EDUCATION OF THE NEGRO...\nDISCUSSIONS HAVING THEIR ROOT, IN MANY INSTANCES, IN\nTHE PRESENCE IN MANY OF OUR COMMUNITIES OF A SECOND\nSchoolhouse....The colored schoolhouse. Join us in\nTAKING A LOOK AT THE EDUCATION OF NEGROES, AS WE CON-,\nTINUE TO DISCUSS, ”ThE LAST CITIZEN,”\nSTINGER\nThe Last Citizen: The Negro in America. A series of\nPROGRAMS DEVOTED TO THE EXTENSION OF OUR KNOWLEDGE OF\nTHE LARGEST MINORITY GROUP IN THE UNITED STATES, ITS\nPROBLEMS, AND THE PRO.BLEMS IT POSES TO ALL AMERICANS.\nThe Last Citizen is produced by Radio Station /VBAA,\nPurdue University, under a grant from the Educational\nTelevision and Radio Center, in cooperation with the\nNational Association of Educational Broadcasters.\nThe discussants are the Producer of the series, E. V,\nRichter, and Or. Louis Schneider, Professor of sociology\nat Purdue University. Today’s program: ’’The Second\nSchoolhouse,” part I. Here now, is Mr. Richter.\nToday we want to begin an exploration of the problems i .\nTHE FIELD OF EDUCATION WHICH THE NEGRO FACES. THOSE\nPROBLEMS ARE, OF COURSE, NUMEROUS, AND WE MUST BE\nPREPARED TO FIND HERE ALSO THE USUAL INTERACTION OF"
}