{
  "id": "d201-74",
  "text": "-3-\nR I CHTE :: :\nHOLLAND:\nMORE MONEY, AND THEY HAD WORKED THEIR WAY THROUGH\nCOLLEGE, SO * ASKED MYSELF, '’WHO SAID • WOULD NEVER\nGO TO COLLEGE? ” So I SWITCHED AND TOOK Cat IN....\nPREPARED MYSELF FOR COLLEGE. AND WHEN I FINISHED\nCOLLEGE, I THOUGHT I WOULD PROBABLY NOT GO ANY FURTHER.\nBut then I aspired to get a Master’s Degree, and then\nAFTER I GOT A MASTER’S DEGREE I ASPIRED TO GET A\nDoctor’s Degree, and by that time I had set no limita¬\ntions TO WHAT I SHOULD ASPIRE TO. vVELL, I THINK l*M\nTYPICAL OF MANY NEGROES. AND THEIR ATTITUDES TOWARDS\nEDUCATION. THE LEVEL OF ASPIRATION IS AN IMPORTANT\nTHING. I KNOW WHEN I WAS A CHILD VERY FEW NEGROES\nEVER ASPIRED TO GET A DOCTOR’S DEGREE. Now MANY NEGROE\nASPIRE TO GET THE PH.D.AND MANY OF THEM HAVE SECURED TH\nPh.D. Not that I have any illusions about the Ph.D,\nI don’t mean to say that. That is an important thing.\nNow LET US TAKE A QUESTION LIKE...A PROBLEM LIKE\nTHIS, RATHER. IN NORTHERN SCHOOLS FOR A LONG TIME THEY\nUSED TO HAVE COUNSELLORS WHO TOLD NEGRO CHILDREN THAT\nTHERE WAS NO USE IN ASPIRING TO CERTAIN JOBS..,.AS AN\nARCHITECT, OR ENGINEER, AND SO FORTH. AND NEGRO\nCHILDREN JUST WOULDN’T ASPIRE TO BE ARCHITECT OR\nENGINEERS. BUT WITH THE OPENING UP OF NEW OPPORTUN¬\nITIES I DON’T THINK ANY VOCATIONAL GUIDANCE PERSON OR\nCOUNSELLOR WOULD DARE TELL A NEGRO CHILD TODAY NOT TO\nASPIRE TO BE AN ARCHITECT OR NOT TO ASPIRE TO BE AN\nENGINEER. I’M ONLY CITING THIS TO SHOW YOU THAT THE\nNegro’s aspirations in education, or what education\nMEANS TO HIM, IS NOT A CONSTANT FACTOR, OR AN ISOLATED\nFACTOR, IT’S A FUNCTION OF HIS SOCIAL POSITION, IT?S\nA FUNCTION OF HIS SOCIAL WORLD, IT IS RELATED TO WHAT\nIT MEANS TO HIM. AND SO WHETHER NEGROES ASPIRE EDUC¬\nATIONALLY, OR WHETHER THEY SHOW THEMSELVES BRIGHT OR\nSTUP ID . . . . THEY ARE ALL TIED UP WITH THE SOCIAL MATRIX I\nWHICH HE SPENDS THE MOST SIGNIFICANT PART OF HIS LIVING\nDr. Fraz ier thus stresses the social world of the\nNegro....the matrix in which he must operate. There\nSEEMS TO BE A LARGE SENSITIVITY TODAY TO THE BACKGROUND\nFROM WHICH THE NEGRO COMES, A GOOD MANY EDUCATORS\nAPPEAR TO BE SO SHARPLY AWARE OF THE NEED FOR KNOWLEDGE\nOF THE SOCIAL MATRIX. ON THIS POINT, I THINK It’s\nWORTH OUR WHILE TO LISTEN TO SOME WORDS 3Y Dr. JEROME\nB. Holland, President of Delaware State College....\nWORDS EXCERPTED FROM AN ADDRESS TO THE NATIONAL\nURB N LEAGUE CONVENTION IN OMAHA, NEBRASKA, AND RECORDE\nIN THE FALL OF 1958.\nIT HAS BEEN DISCOVERED THAT THE TEACHING PROFESSION .\nUSUALLY DRAWS ITS RECRUITS FROM OUR MIDDLE CLASS STRATU\nof society. Fortunately or unfortunately there are\nMANY MORE WOMEN THAW MALE TEACHERS. l\\/lANY OF THESE"
}