{
  "id": "d201-84",
  "text": "-2-\n'M\\R ING:\nGRADUATED FROM HIGH SCHOOL IN 1920; INDEED THE RATE OF\nINCREASE IN NegRO COLLEGE ENROLLMENTS DURING THIS\nPERIOD WAS SIX TIMES THAT OF THE WHITES. NEVERTHELESS.\nALTHOUGH THE NEGROES ARE FAST CATCHING UP TO WHITE\nEDUCATIONAL LEVELS, THEY STARTED WITH A GREAT HANDICAP\nWHICH STILL MARKS THEM. As OF 1950, OVER A THIRD OF\nTHE TOTAL WHITE POPULATION BUT ONLY 13 PER CENT OF THE\nNegroes, had graduated from high school. Thirteen\nPER CENT OF THE WHITES HAD GONE TO COLLEGE FOR AWHILE,\nBUT ONLY FIVE PER CENT OF THE NEGROES HAD ENTERED\nIvy halls. And the quality of Negro education is\nSTILL DEFICIENT; THE NEGRO COLLEGES ARE HELD BACK BY\nTHE POOR QUALITY OF PREPARATION IN SOUTHERN NEGRO HIGH\nschools. Only recently have the gates of white\nCOLLEGES BEEN OPENED IN SIGNIFICANT DEGREE TO COLORED\nSTUDENTS, AND THEY WILL BE AT A DISADVANTAGE THERE AS\nLONG AS HIGH SCHOOLS ARE UNEQUAL. The SUPREME CoURT\nDECISION OUTLAWING SEGREGATION COULD VASTLY SPEED THE\nIMPROVEMENT OF THE QUALITY OF NEGRO EDUCATION, FOR\nONLY IN THE STATES THAT HAVE INTEGRATED SCHOOLS DO\nTHE EXPENDITURES FOR THE EDUCATION OF NEGRO PUPILS\nMATCH THOSE FOR WHITES. BUT IF THE SOUTHERN STATES\nSUCCEED IN OUTMANEUVER I NG THE DECISION BY ABOLISHING\nTHE PUBLIC SCHOOLS, THEN THE NEGROES WILL BE SET BACK\nA GENERATION OR MORE IN PROGRESS FOR THEY WILL BE\nUNABLE TO AFFORD GOOD PRIVATE SCHOOLS EVEN IF THERE IS\nA PARTIAL STATE SUBSIDY.iT THIS LONG STATEMENT IS\nTAKEN FROM JOSEPH KaHL’S ’’The AMERICAN ClASS STRUCTURE\nNOW, LET US MAKE CONCRETE SOME OF THE THINGS KAHL SAYS\nBY LISTENING TO JUDGE J. WAITES WARING, RETIRED FEDERAL.\nJUDGE FROM SOUTH CAROLINA.\n1 HAD THE FIRST SCHOOL SEGREGATION CASE. AND WHILE TF\nCASES THAT WENT TO THE SUPREME COURT. ThE ONE FROM\nKansas, Brown against the board was number one, and\nBriggs against Elliott that was the Clarendon school\nCASE WAS NUMBER TWO. But BRIGGS AGAINST ElLIOTT WAS\nSTARTED FIRST. And went up and was sent back and went\nUP AGAIN, AND BY THE TIME IT GOT UP, 3ROWN HAD GOTTEN\nTHERE. But the cases involved somewhat ...practically\nTHE S \\ME ISSUES. CLARENDON CoUNTY, SOUTH CAROLINA IS\nA DREADFULLY POOR COUNTY. ThE COUNTIES IN THAT STATE,\nAS IN MOST STATES, VARY, AND THEY VARY VERY DIFFER¬\nENTLY. That’s one of the worst counties in South\nCarolina. They have more Negroes than whites in the\nPOPULATION, it’s A RURAL COUNTY, WITH ONLY TWO LITTLE\nTOWNS IN IT. It’s poor farming country, poor people,\nwhite and Negro. Large numbers of them illiterate or\nNEAR ILLITERATE. AND VERY BACKWARD. N0W THEY WERE...\nNegro people up there had dreadful schools. I some¬\ntimes DROVE THROUGH THE COUNTY ON THE WAY TO HOLDING\nCOURT IN ANOTHER PLACE OTHER THAN CHARLESTON..."
}