{
  "id": "d201-85",
  "text": "-3-\nRICHTER:\nPATTERSON:\nCharleston was my headquarters, but I went to Florence\nFREQUENTLY. AND YOU COULD SEE THESE TUMBLED DOWN,\nDREADFUL, DIRTY, BACKWARDS PLACES. And THE NEGROES\nFOUND THEY HAD TERRIBLE SCHOOLING—THEY FIRST STARTED\nASKING FOR BETTER SCHOOLS, BUILDINGS, BOOKS—THERE\nWEREN’T ANY BOOKS IN THE SCHOOLS. ONE - SAY ONE-BOOK\nTO TEN PUPILS, AND ALL OF THAT KIND OF THING. No\nHEATING, NO TOILETS, AND JUST TERRIBLE KINDS OF THINGS\nThe kind of thing that we imagine as only in India and\nBACKWARD CHINA.\nAnd we can place Judge Taring’s observations on the\nstate of Negro education in one county of South\nCarolina side by side with the results of a study made\nof Negro education in the South. Frederick D. Patters\nPRESIDENT OF THE PHELPS-St0KES FUND, BRIEFLY DISCUSSED\nSOME OF THE FINDINGS OF THIS STUDY IN AN ADDRESS TO\nthe National Urban League convention in Omaha, Nebrask\nin the fall of 1958.\nThese are some of the common failings that we have\nencountered: One, that there was very little relation\nbetween what participating high schools stated as\nTHEIR PHILOSOPHY (PARTICIPATING, IN THE SENSE, MEANING\nin this 4 state study involving alabama, Georgia, Miss\nissippi, and North Carolina)there was very little rela\nbetween what participating high schools stated as\nTHEIR PHILOSOPHY AND OBJECTIVES ON ONE HAND, AND THEIR\nACTUAL PRACTICES. ThERE IS A CLOSE CORRELATION BETWEE\nNUTRITION AND GRADES, THE HONOR STUDENTS WERE THE WELL\nFED STUDENTS, I GUESS THERE MAY BE SOME EXCEPTIONS,\nBUT BY AND LARGE THAT WAS TRUE. THOSE WHO FAIL IN\nCLASSWORK ARE USUALLY THOSE WHO HAVE LITTLE OR NOTHING\nWHOLESOME IN THE WAY OF FOOD. WE HAVE ESTABLISHED\nTHIS THROUGH A STUDY OF TEACHER’S RECORD BOODS, ^UNCH-\nROOM PATRONAGE AND HOME VISITS. vV £ HAVE FOUND THAT\nTHERE IS A DIFFERENCE BETWEEN ACTUAL AND OFFICIAL\nATENDANCE REPORTS, TO MAINTAIN TEACHER ALLOTMENTS\nTHERE IS A CONSIDERABLE PADDING OF ATTENDANCE REPORTS .\nACTUALLY, AFTER EIGHT YEARS IN THE AVERAGE RURAL\nSCHOOL, THE PUPIL HAS COMPLETED ONLY FOUR FULL YEARS\nWHERE ACTUAL DAYS ATENDED ARE CONCERNED. AND I MIGHT\nSAY THAT THERE IS COLLABORATION FROM THE SUPERINTEND¬\nENT’S OFFICE RIGHT THROUGH TO THE CLASSROOM TEACHER IN\nTHIS MATTER OF FAKING ATTENDANCE RECORDS IN ORDER TO\nGET FINANCIAL ALLOTMENTS WHILE THE KIDS ARE OUT OF\nSCHOOL PLAYING OR PICKING COTTON OR GOING HUNTING.\nThe reading levels of both pupils and teachers are\nlow. Children are not motivated to read widely. This\nIS REFLECTED IN LIMITED ACCOMPLISHMENT IN ALL FIELDS\nOF LEARNING. READING ABILITY, OF COURSE, IS SERIOUS.\nYOU CAN’T DO ARITHMETIC IF YOU CAN’T READ. AND YOU\nCAN’T DO MANY OTHER THINGS IN TERMS OF ACADEMIC"
}