{
  "id": "d201-88",
  "text": "-6-\n?’equal't, and it is well known to students of these\nMATTERS THAT THE SEPARATE SCHOOLS OF THE NEGRO HAVE\nIN FACT GENERALLY BEEN QUITE INFERIOR ONES. ..NOT ONLY\nin the South, but in the North as well, where housing\nPATTERNS ARE INCLINED TO MAKE FOR ALL NEGRO SCHOOLS.\nAnd it’s a commonplace that the effort to support\nSEPARATE SCHOOL SYSTEMS AT A LEVEL ANYWHERE NEAR\nEQUALITY IMPOSES A GREAT ECONOMIC BURDEN, GREAT\nECONOMIC BURDENS I SHOULD SAY ON COMMUNITIES, TO SAY\nNOTHING OF THE FACT THAT SUCH EFFORT IS ECONOMICALLY\nWASTEFUL AS BUILDING COSTS ARE MULTIPLIED AND OVERHEAD\nARE DUPLICATED.\nRICHTER: Well to alter slightly the line of approach for the\nMOMENT LOU, IN DISCUSSING THE SUPREME COURT DECISION,\nYOU MENTIONED THAT ONE OF THE POINTS THAT WAS MADE\nWAS THAT SEPARATE SCHOOLS GENERATE A FEELING OF\nINFERIORITY ON THE NEGROES’ PART AS TOTHEIR STATUS\nIN THE COMMUNITY. REVEREND W|lUAM BORDERS, OF THE\nWheat Street Baptist Church in Atlanta, Georgia,...\nHAD THIS TO SAY WHEN WE ASKED HIM WHETHER OR NOT THE\nSupreme Court decision had done much in bolstering\nthe Negro self-image ...his morale, if you wish.\nBORDERS: Oh, yes. This decision h s done a tremendous amount\nGOOD. It HAS AGITATED THE PUBLIC MIND, AND ALL OF US\nARE THINKING MORE CLEARLY WITH REFERENCE TO SEGREGA¬\nTION, AND THERE ARE MANY OF US WHO HAVE BEEN STRIPPED\nOF OUR PREJUDICES. AND THE IMPROVEMENTS WHICH HAVE\nCOME ALONG EDUCATIONAL LINES, COMMON CARRIERS, AND\nOTHERWISE, HAVE DONE A GREAT DEAL TO MAKE THE NEGRO\nTHINK MORE OF HIMSELF. AND THIS WAS ONE OF THE RESUL'\nINTENDED. MOREOVER, IT’S THE IMPLEMENTATION OF\nDEMOCRACY AT ITS HIGHEST AND BEST. ..NO QUESTION IN MY\nMIND ABOUT THAT.\nRICHTER: We have dealt, then, with the educational situation of\nthe Negro, as it existed at the time of the Supreme\nCourt1 s decision of iViay 17, 1954. We have discussed\nTHE “’SEPARATE BUT E QU A Lif DOCTRINE WHICH WAS OVERTHROWN\nBY THAT DECISION, AND REVEREND BORDERS OF ATLANTA,\nGeorgia, has commented on the results of that decision\nIN TERMS OF THE MORALE OF THE NEGRO. 3uT WHAT ABOUT\nOUR WHITE POPULATION, PARTICULARLY IN THE SOUTH? WhAT\nare their attitudes toward this historic decision?\nWhat has been done to implement it? Mr, Fred Routh,\nAssistant Director of the Southern Regional Council,\na consultative organization upon problems of race\nRELATIONS, DISCUSSED THIS QUESTION WITH US WHEN WE\nVISITED HIM IN HIS OFFICE IN ATLANTA, GEORGIA. We\nasked Mr. Routh what he felt was the most important -\nFACTOR IN THE SOUTH’S REACTION TO THE SUPREME COURT\nDECISION, AND TO GIVE US A BREAKDOWN, AS OF THE TIME\nOF OUR INTERVIEW WHICH WAS IN THE SUMMER OF 1958, OF"
}