{
  "id": "d502-160",
  "text": "In Miami, where a Hotel Workers Union struck\nlor a new contract, they turned to radio to get their\nstory across.\nIn New York City last year, the AFL used local\nradio in its drive to reorganize the waterfront.\nPerhaps the best success story of all, about labor’s\nuse of radio, is the one that happened earlier this\nyear. After more than a year of negotiation every\nrailroad but one signed new contracts with the Rail¬\nway Unions. That one exception was the Louisville\n& Nashville, a railroad serving 16 southern states.\nThe lack of a contract resulted in a strike that in¬\nvolved 25,000 workers in some 40 communities\nthroughout the 16 states. Since it was a railroad, the\nmediation of the strike was under Federal jurisdic¬\ntion and took place in Washington, D. C.\nLabor Tells Its Side\nAs often happens in situations like this, the news¬\npapers, with few exceptions, told one side of the\nstory. Even the statements of union officials were\nnot being used. And since the mediation negotia¬\ntions were going on in Washington the union had\nno fast line of communication to its members and\nto their communities.\nAll sorts of rumors spread like wildfire. The union\nmembers found themselves accused of sabotage,\nshootings, rioting and wrecking; the familiar reports\nof back-to-work and break-the-strike started to crop\nup. The railroad got its story across, the scare ru¬\nmors cropped up anew each day and, because it had\nno fast line of communication, the union members\nwere often confused and the townspeople more so.\nThe situation was fluid and, since the economics of\nthe communities were affected by the strike, there\nwere potential areas of violence all over the region.\nThe answer was a hookup of 89 stations all\nthrough the 16 southeastern states involved. Twice\ndaily, at 12:05 p.m. and 8:25 p.m., six days each\nweek, direct from Washington where the negotia¬\ntions were in progress. President G. E. Leighty of\nthe Railroad Telegraphers and chairman of the joint\nnegotiating committee, reported to the workers and\nthe communities. (When Leighty was in negotiations\nPresident T. C. Carroll of the Maintenance of Way\nEmployes pinch-hit; the important thing being that\nagain it was a union executive that the members\nknew and an executive that was participating in the\nnegotiations.) He explained and interpreted what was\nhappening around the bargaining table and covered\nthe reasons leading up to the strike.\nFor five weeks the unions used this regional hook¬\nup of stations. After the first week the terrors and\ntensions disappeared. The union members and the\ntownspeople knew what was happening; some of\nthe newspapers found they had to cover both sides\nof the story. And, believe it or not, the railroad\nfound it had to buy radio time to justify itself to the\npeople in some of the areas affected by the strike.\nThis L. & N. strike story is a perfect example of\nhow the speed and coverage of radio quickly and\neffectively stabilized a potential trouble area that\nwould adversely affect both the unions and the com¬\nmunities. So far as labor is concerned, this series of\nradio programs opened contact with the general pub¬\nlic, as well as the union members, and benefited\nboth.\nThis successful use of radio by labor didn’t come\neasy; it required a lot of work and doing. When\nlabor first wanted to buy network time, two of the\nfour national chains would not accept its business\nand many of the local stations were suspicious of\nlabor and its objectives. Even now, after five years,\nsome are still suspicious. Permit me to use some of\nEd Morgan’s words, from his July 4 program, to\ncover this:\n“Traveling back and forth across the country,\nas I have just done, people ask you such ques¬\ntions as these: How much control does the\nsponsor exercise over your broadcasts? How\nmuch editing and censoring of news and com¬\nment does the sponsor do? What ‘line’ does the\nsponsor dictate that you follow? The answer is,\nto their surprise, none, on all counts.\n“I raise this point for two reasons: first, a re¬\nporter likes to try to build up a reputation of\nwhat might be called responsible independence.\nIf he takes pride in his work, he wants to\navoid becoming, or even seeming to become, a\n‘mouthpiece,’ which means he wants to preserve\nthe right to make his own mistakes. That is\nwhy, as I mentioned on Jan. 3, there is nothing\nin the agreements with the network and/or the\nsponsor, in fine print or otherwise, inhibiting\nthis correspondent’s editorial freedom.\n“The second point is more interesting and, I\nthink, generally more important. It stems from\nthis question: why do people assume, almost\nautomatically, that if a labor union, or a labor\nfederation, sponsors something, it has an ulte¬\nrior motive, whereas if a business does, it is\nmerely interested in selling a product or a serv¬\nice? The answer to this is not a simple one but\nI think a large part of it lies in the fact that the\npublic in the past has regarded organized labor\nin a combative sense, as possibly a necessary\nbut belligerent evil. Only recently has it dawned\non the ordinary citizen, including this one, how\nheavy a stake unions have in, and how positive\nan influence they have on social progress. If this\nis a plug for my sponsor, let the most be made\nof it. It is made as a sincere observation on the\nbasis of experience.”\nNow, one final word, as to the effectiveness of\nthe AFL’s newscasts. In January of 1955 we started\non a new network, ABC, with a new commentator,\nEd Morgan, at a new time. After six months, the\nratings show that the program delivers homes at a\ncost per thousand of $2.36 and delivers listeners at\na cost per thousand of only $1.52.\nThis, we feel, is one of the best, if not the best,\nbuys of network newscasts across the board that any\nsponsor can make. We’re satisfied and so are our\nmembers and our listeners."
}