{
  "id": "d502-217",
  "text": "M {is \\'JU\nFUND FOR ADULT EDUCATION\nESTABLISHED BY THE FORD FOUNDATION\n914- EAST GREEN STREET'\nPASADENA\nI , CALIFORNIA -\nApril l6, 195*\nitlonal Association\nitional Broadcasters\ni7l?l?lW\n1|2|B|4jS|\nDear Mr. Ausmis: i\nIt gives me pleasure to inform you, on behalf of our Board of\nDirectors, that The Fund for Adult Education has approved a grant\nof $7,000 to the national Association of Educational Broadcasters,\nfor a period of one year, beginning April 1, 195^, *or a ®on8^L k*®\nservice in union and labor relations problems. Within a few days\na check in the amount of $7,000 will be sent to Mr. Harry J.\nSkomla.\nxt is understood that this grant will enable the\nof Educational Broadcasters to meet the needs of the developing\nfield of educational television and radio for\nof relationships with unions and labor interests. Althouj^\nservice will be provided by the HAEB, it is\nvill be available, througi proper arrangements with the HAEB, to\nsuch other organisations as the Educational Television and todio\nCenter, the Joint Committee on Educational Television, an* the\nRational Citizens Comnittee for Educational Television. It a\nunderstood further that the service is regarded as a service to\nbe aade available primarily to local stations and for the purpose\nof clarifying individual problems rather than to national organiza¬\ntions in their own right.\nOur Board understands that the HAEB has been receiving numerous\nrequests for advice on labor and union relations from naw\neducational television stations and\nstations. Since they recognize that the HAEB is regarded\nas the service organization of educational television and radio\nbroadcasters, ttay believe that this Association should provide\nthe services of a qualified consultant in this area of labor\nrelations.\nThe proposed budget as submitted for a first year of the service\nby Hr. Skornia in his letter of March 31 to Mr. 0. H- Oriffi\nis satisfactory to the Fund."
}