{
  "id": "d502-227",
  "text": "March 31, 1954\nMr* G. H* Griffiths\nFuad for Adult Education\n1444 Wentworth Avenue\nFaaadena 5» California\nDear Mr* Griffith**\nSunoarlaing ite earlier requests, on thia scatter, and providing tho\nadditional information requested in your letter of March 26, the\nnational Aaeociation of Educational Broadcasters hereby requests the\nsum of fifteen thousand dollar* (#15,000*00) for the operation of a\nunion relations consultation service for all American educational television\nand radio stations for a period of three years, with Immediate emphasis on\ntelevision* It is axpeetod that only a small proportion, if any, of the\nefforts of this consultant would be devoted to radio, as the situation now\nstands.\nIteasrcus requests have been received by tho HAEB for help and advice on\nlabor and union relations from new educational television stations and\ngroups planning such stations* In view of tho growing number of such odu»\noational television stations it is felt that the feorvtoss of o qualified\nconsultant arc needed in this area* The IIAEB is looked to os the service\norganisation of educational television and radio broadcasters* Therefore,\nthis proposed sorvioo is a natural one for the NAEB to undertake*\nA copy of this request is being sent to Dr. Harry IfeMsan of tho Educational\nTelevision and Radio Center, to insure adequate coordination of efforts in\nthis area* In recent discussions with Mr* Kenneth Yourd, of the Center’s\nstaff, it was our specific understanding that the Center would not under*\ntake this general service, but would like to be included in all such die*\noussions, and would of course need to have a voice in ell decisions, in\nview of the need for clearances to facilitate program exchange* Mr. Ralph\nStoatl©, of the XET* has also indicated readiness to have the NADS take\nover this service, finding it the natural and obvious province of tho HAEB*\nThe same is true for the NCC2T, with which those areas of jurisdiction were\nearlier discussed.\nMr* Morris Novik, New York Consultant, for many years an NAE9 Officer and\nlong associated with tho NAEB, has already been contacted and has agreed to\nserve as consultant* As agreed in discussions with representatives of the\nFA32 and the Center, am of It?. Novlk’s first functions will be to hold a\nconference with appropriate representatives from tho Center, ths XET, tho"
}