{
  "id": "d502-234",
  "text": "Report oh ikEB TV Mahagement\nConsulthtioh Service\n(M» Si Novik)\nFrom Inception to May 1, 195£\nThe following station-by-station report indicates the status of the general\nmanagement-labor relations problem in educational TV, as reported by Mr. Novik,\ntogether with the role he has played in each area.\n\"San Francisco - Station KCJSD\nHad long meeting with Jim Day on one of my trips last year. Know his problem.\nDiscussed with the head of the San Francisco Labor Council the problems of the Sta¬\ntion, the potential of the Station, and the need for extending cooperation to the\nStation management. Advised Jim of the interest of labor and recommended that he\ncooperate more closely with it. Neil Haggerty, Secretary of the California Federa¬\ntion of Labor is a member of the board of the Station. I met with him in September\nand discussed the needs of the Station.\n\"Houston - Station KUHT\nSince my last visit with John Schwarzwalder, I have had some correspondence\nwith him about specific problems and helped him get trade publicity in connection\nwith his engineer*s training course. I think I have been of some help in trying\nto get him closer to truly educational television, the Center, and the NAEB,\n»St. Louis - Station KETC\nI have not been to St. Louis since we cleared up the engineers* situation. At\nthat time, I had extensive phone conversations and correspondence with Goggin. Have\ntalked on the phone with Messers. Quigley and Storck. Had one long conversation\nabout the engineering problem. I assured them that I was willing to be of help\nshould the occasion arise. This is one area where a great deal more should be done\nin tying up the large and very effective labor organizations to help build an audi¬\nence for the Station. The President of the local CIO group, who has been elected\nto the Board of Education, is now a member of the Board of the Station.\n\"Madison - Station WHA\nThe extent of my contact with the Station has only been in the area of lining\nup labor support in the struggle the Station had in connection with the November\nreferendum. H. B. McCarty is working closely with and getting full support of\nall of labor in the recent attempt on the part of some legislators to put through\nsome harmful legislation.\n\"Ames - Station WOI-TV\nAs yet, there has never been any need of my helping the Station in any of its\nlabor or management problems. Dick Hull has done a mighty good job and has been\nable to handle his own affairs. However, we are in close contact with each other\nvia phone and mail.\n\"Pittsburgh - Station WQED\nHaven*t been to Pittsburgh since my first visit, but have talked on the phone\nwith Bill Wood. There haven*t been any labor problems. I will be glad to help in\nstimulating interest among labor. However, the station has the two top labor people\nof the community on their Board of Directors. I know that an effort is being made\nby them to help the Station."
}