{
  "id": "d502-237",
  "text": "REPORT OF THE NAEB MANAGEMENT CONSULTANT\nOctober 1, 1955\nTHE ASSIGNMENT was to look into and help the new educational TV stations with some\nof their management and operational problems including union relations*\nThe assignment was a challenge. The field was wide open. While operational and\nmanagement problems were similar to a very great extent in the stations wanting\nthe service, the union relations were different in each case.\nIt is with a great deal of satisfaction that I*m able to report that in every station\nwhere help was needed, all of the unions involved cooperated. The major unions were\nIBEW-AFL, IATSE-AFL, and to a lesser degree NABET-CIO, AFTRA-AFL, AND IAM-AFL. The\nunions involved recognized the difference between the educational and commercially-\noperated TV stations. That recognition was of immediate help to the stations in¬\nvolved, and this policy will help all new stations in the future.\nLabor cooperation was important not only in operational problems, but in promotion,\nin developing audience and the raising of funds. This cooperation has just barely\nbegun. It should be extended, especially in the community operated stations.\nPittsburgh, St. Louis, San Francisco, etc.\n1'fy assignments at the Institutes and Workshops were even more of a challenge. Novik\nis certainly no orator; no educator. The facts of life, practical problems and the\nbackground history of the organization were my agenda. I hope the participants in\nthe Amherst, East Lansing, Iowa City meetings, and others gained as much by my\nefforts as I did by the spirit, enthusiasm and desire of all to know more and more\nabout the present and the past.\nThe role of the NAEB (with the cooperation of the Kellogg Foundation, the ETRC, the\nFAE, the JCET and other groups) in training the personnel and helping the stations\nin operational problems, it seems to me, is the difference between life and death.\nLimited as this help may be, had we had it twenty years ago for radio, we would\nhave had a different and better educational broadcasting picture in this country.\nRespectfully submitted by:\nCopied NAEB Hq. 10/l4/55jy\nM. S. Novik\nConsultant"
}