{
  "id": "d502-25",
  "text": "ftf\nc*—* *\nTOs NAEB OFFICERS, FYI CONFIDENTIAL\nFrom? Skornia\nCOPY\nFebruary 9f 1954\nHr. Ralph Steetle, Executive Director\nJoint Committee on Educational Television\n1785 Massachusetts Ave., NW\nWashington, DC\n% dear Ralph:\nBefore I forget any of the highlights I want to get this to you. I will put\nthem down as they come to me without any attempt to polish or worry about\nterminology. I will try to give you th?> facts, mention the source* and you,\nWalter and I can meet and discuss this further. I will send a copy to Skornia\nand you can decide whether a copy should go to Day, Sener*. Woods and Schwartzwalder.\nI am sure you agree that this ought to be confidential until we decide how to\ntreat the whole subject.\nNow here are the facts?\nBefore I reached Miami, I knew the St. Louis picture from personal contact so\nthat when I reached Phoenix I used that as a base for my discussions with Sener,\nDay, Schwartzwalder and Woods.\nMeeting in Miami\nFive days was hardly sufficient time. I met with Messrs. Tracy, Walsh and\nHeller. I had a long conversation with Neal Raggarty, an outstanding labor\nman of California* who is a member of the San Francisco board and who designated\nBassett, Secretary of the Los Angeles Council, to serve as a member of the board.\nMr. Tracy was interested and explained to me the past policies of IBEW — they\nare strong on local autonomy. The radio and television division have had\nspecial conditions. They have never had a policy for educational, non-commercial\nstations; but he said that he wanted bo do all he could to help, and he asked\nthat I see Mr. Hardy, his radio-TV director. Had a long talk with Hardy\nyesterday and we have agreed to meet in New York or Washington on Wednesday\nor Thursday.\nI met with Dick Walsh, a close friend, who recognizes our problem and the need\nfor special consideration. He was going to do all he could to get word to\nhis people in Pittsburgh to cooperate with us.\n*1. A. is not involved in San Francisco, but is in LOs Angeles; the I.A. man\nis in charge of film there.\nThe difficult one will be St. Louis where the IA and IBEW have been battling\nfor years. While I haven't any commitment on St. Louis because I didn1t ask\nfor any, he recognizes that in the TV field the IBEW has had supremacy\nand therefore I am confident that if it comes to a showdown we will receive\nfavorable consideration.\n*Skornia note? IATSE"
}