{
  "id": "d502-3",
  "text": "CASSIUS M. DOTY\n(1331-1950)\nTAYLOR, MILLER, BUSCH &. MAGNER\nFRANCIS X. BUSCH\nORVILLE TAYLOR\nJOHN S_ MILLER\nJAMES J. MAGNER\nWHITNEY CAMPBELL\nCHARLES R.SPROWL\nRICHARD A. BECK\nTHOMAS E- DEACY7 JR.\nGEORGE W. OVERTON\nRICHARD F. BABCOCK\n134- SOUTH LA SALLE STREET\nCHICAGO 3\nTelephone STate 2-6070\nRECEIVED\nNAEB HEADQUARTERS\nE. MARVIN BUEHLER\nJOHN A.HUTCHINGS\nEDGAR E.LUNGREN?JR.\nJAMES J. HOFFNAGLE\nTHOMAS W_JAMES\nNovember 30j 1953\nDEC 1 1853\n** Pt»\n?|?|9,16,11,12,1,8,8,418,5\nMr. Harry J. Skornia, Executive Director\nNational Association of Educational Broadcasters\nUniversity of Illinois\n119 Gregory Hall\nUrbana, Illinois\nDear Harry:\nI have your letter of November 27th and will attempt to\nanswer your questions in series.\n1. No definitive arrangements have been reached with the\nMusicians’ Union and, until my last trip East, I had ex¬\npected only to get ad hoc clearances for one or two shows.\nAs I have reported to Dr. Newburn, I received some indi¬\ncations that the American Federation of Musicians wishes\nto reach some national union agreement. I will keep you\nfully informed on anything further we hear from them and\ncertainly I feel sure we will not move without consulting\nyou. To answer your specific question, I have had no\ndirect contact with Petrillo but have dealt directly with\nClair Meeder in the New York office.\n2. The Center has had no contact and so far as I know in¬\ntends to have no contact with the IBEW or any engineering\nunion. Our sole concern is with the talent unions and\nother guilds that reserve contractual rights to repayment,\nin connection with shows we wish to exchange. Unless Dr.\nNewburn has undertaken some change of plans in this re¬\ngard, I don't think the Center intends to involve itself\nIn any way in union matters not related to its own direct\noperations.\n3. As to AFTRA (please note correct spelling), I have had one\nexploratory talk with Heller in New York. I sensed a suf¬\nficiently negative reaction on his part not to press my then\nimmediate business (again a specific clearance on a specific\nshow) but will possibly return to this union at a later date\non the same specific business. I am advised by the com¬\nmercial networks that Heller will be a lot tougher than\nPetrillo because he is uon the make1* and his union is in¬\nvolved in a number of jurisdictional disputes whereas"
}