{
  "id": "d502-42",
  "text": "SLSJg.X\n-w'r *'\nDecember 14, 1953.\nMr. Iteris S. Novik,\n200 West 23 St.,\nHew York 11, N.I.\nDear Morrle#\nAs per your request I am sending along to you the gist of last\nFriday’s meeting with the Business Manager of IBEW Local 1217, Radio Broad***\ncast Engineers.\nHe is asking that all people hired la technical capacities (the\nusual jobs cohered by IBEW and HABET in TV stations) bsocgr^a IBEW members,\nwith full coemsercial rates of pay. W© have six such technicians on staff now\n(the Chief Engineer is essdusive of this), all with varying backgrounds and\nvarying amount of ©xpsriQncQ.\nIn addition to this he is asking that w© give the union a blanket\nagreement by which m recognize its jurisdiction over all other job classifi¬\ncations (outside of office workers and creative staff, I assume), such aa\nfilm editors, stage hands, costume, etc. The union’s predication of this in¬\nclusive kind of agreement is on the basis of protecting the station from union\njurisdictional disputes which IBEW says would be th® case if we didn’t have a\nblanket agreement with them. Such a blanket agreemsnt would, they say, keep\nother unions out. IBEW is f&arik in admitting that it would keep other unions\nout for them too.\nTh® IBEW Business Manager says he has already been in contact with\nour technical staff and they have indicated their willingness to join IBEW,\nobviously in the hope that we will sign with the union on their terms, which\nwill materially increase each man’s salary. Our budget is not predicated on\npaying ccsmorcial TV rates for anyone at the station. This is a non-profit,\neducational organisation and we cannot be evaluated on the basis of what are\ngoing rates for a eomnsrcial, pro^t-saaking organisation. In addition to om1\nfuH-tiiae engineering staff w© intend to use students on a part-time basis,\nsome possibly under course credit arrangements at St. Louis University and\nWashington University, and some paid on an hourly basis.\nIBEW has no objection to our using students (and they could handle\nand use all the gear on shows), but they had thought that we would be using\nonly students on a course basis. This is not as practical for us as it is for\nstations owned by universities. We cannot integrate our operations as easily\nwith academic departments as a university*^sa©d station could, for obvious\nreasons.\nFrankly, the thing that disturbs me is that sot© months ago three\nmembers of our Commission went to see Jacobs, the head of the IBEW in town.\nHe said he wanted to have just 2 or 3 of his men on our staff. When I met"
}