{
  "id": "d502-56",
  "text": "GOPIES OF TWO NOTES (4/27) FROM G. H. GRIFFITHS, CF FAE\nffiDear Harry?\nI have read very carefully the recent letters from you to me and from Graydon\nAuamua to Mias Howard regarding the assignment of Mr. Novik as a Consultant or\npersonnel problems” or, if you will as ’’management consultant*.\nI believe all of us are clear as to the actual duties Mr. Novik will perform.\nAccordingly we would be only too happy to use whatever terminology you consider most\nappropriate. Miss Howard will be away from the office until the end of this week but\nI shall review this matter with her as soon as she returns. If any change in the\nwording of the grant letter appears to be ©ailed for, we will advise you However I\ndoubt that will be necessary.\nIn any event since the services Mro Novik is performing ar*e the services the grant\nwas Intended to ©over, I assume you are going right ahead with all your pi&ns.\nSincerely ;oure,*\n******\n,TDear Harry?\nRecently you sent along a draft of a proposed letter to go t> all holders of\neducational television channels regarding the NAEBes Placement Service.\n1 appreciated your thoughtfulness in sending this along and X regret that the\nextremely heavy schedule of the past ten days or so has prevented earlier comment on\nmy part.\nAs I am sure you know, we feel that the proper limits of our concern in matters\nof this kind are confined to the referenced to the Fund and the na ure of the grant.\nIn these respects your suggested draft strikes me as very good indesd^as it does in\nall respects for that matter.\nIf you haven' t yet gone to press, 1 do have one suggestion. The last sentence in\nthe first paragraph could read? 'Full time operation is now possible through a grant\nfrom The Fund for Adult Education*. (While we used to request it, 1; i© not really\nnecessary to add *an independent organisation established by The /ord Foundation*•)\nThis, however, is not too important a point and if there is any ^wku&riness for you in\nmaking the change, forget it.\nFor our records here, we would appreciate a copy or two of the announcement as it\nfinally goes out.\nAgain, many thanks.\nSincerely yours,-\nNAEB HQ 4/29/54\nTOs NAEB Officers and Novik"
}