{
  "id": "d502-60",
  "text": "April 20, 1954\nMr, M0 S* Hcrlk\nRadio-TeleviBion Consultant\n300 West 23rd Street - -Room 500\nNew fork 11, New fork\nDear Morris?\nTo help clarify ths situation, here is a quotation from the\nminutes of the last board meeting, in Columbus £\n*It was moved that the public? (human) relations ©on*\nsultant systematically Inform the Doard through the office of\nthe Executive Director of any labor problem or situation which\ndevelops and that his function be confined to (individual,\nstation) consultation and advice and should not Involve\nnegotiation* The motion was seconded and carried.*\nEarlier a motion had been made that no service be provided by\nyou to any NAEB member without specific authorisation (in each ©aae)\nof each member of the Board of Directors through m9 Although this\nformal motion did not pass* I think it reflects, as does the motion\nwhich, did carry,, very specifia concern est areas now in good shape\nbe endangered, and lest a problem which is now a local one become a\nnational one* That is also behind the Statement of Services available\nfrom you, which it is understood will not be limited to union areas,\nin view of your overall consultation background and the fact that you\nar$ a radio and television consultant rather than a union consultant,,\n•\n(attached) from the Directors, FU announce your availability to SAEB\nmembersv, and to the BTRC, JCET, and BOOST. I think a meeting, called\nfey you, la then in order to insure integration of all effortsG Soon’\nthereafter or at the same time, 1 believe interested parties (Sehankkan,.\nGoggin* Wood ,i and others who wish to attend — I don t yet know how\nmany there will be* hence my indefiniteness as to whether or not this\nwould be a separate, meeting; should meet with us also.\nBy that time I hope requests for your services, based on\nunderstanding, and with most suspicion eliminated* can be accepted and\nyou can go oh with that phase of it« The suspicions, X might say, are"
}