{
  "id": "d502-66",
  "text": "COPIES OF TWO NOTES (4/27) FROM G. H. GRIFFITHS, C3F FAE\n\"’Dear Harry?\nI have read very carefully the recent letters from you to me and from Graydon\nAusmus to Wise Howard regarding the assignment of Mr. Novik as a ^consultant on\npersonnel problems\"’ or, if you will as ^management consultant”.\nI believe all of us are clear as to the actual duties Mr. Novik wi.ll perform.\nAccordingly we would be only too happy to use whatever terminology you consider most\nappropriate. Miss Howard will be away from the office until the end of this week but\nI shall review this matter with her as soon as she returns. If any change in the\nwording of the grant letter appears to be called for, we will advise you. However I\ndoubt that will be necessary*\nIn any. event since the services Mr. Novik is performing are the services the grant\nwas intended to cover, I assume you are going right ahead with all your pl.anB.\nSincerely touts,51\n'\"Dear Harry?\nReoently you sent along a draft of a proposed letter to go t? all holders of\neducational television channels regarding the NAEB8s Placement Service.\nI appreciated your thoughtfulness in sending this along and I regret that the\nextremely heavy schedule of the past ten days or so has prevented earlier comment on\nmy part.\nAs I am sure you know, we feel that the proper limits of our concern in matters\nof this kind are confined to the references to the Fund and the nature of the grant.\nIn these respects your suggested draft strikes me as very good inda sd—as it does in\nall respects for that matter.\nIf you haven' t yet gone to press, I do have one suggestion. The last sentence in\nthe first paragraph could reads \"Full time operation is now possible through a grant\nfrom The Fund for Adult Education*• (While we used to request it, iv is not really\nnecessary to add wan independent organisation established by The lord Foundation*.)\nThis, however, is not too important a point and if there is any iwkwariuess for you in\nmaking the change, forget it.\nFor our records here, we would appreciate a copy or two of the announcement as it\nfinally goes out.\nAgain, many thanks.\nNAEB HQ 4/29/54\nT0» NAEB Officers and Novik ^\nSincerely yours^"
}