{
  "id": "d502-70",
  "text": "May X2P 19%\nMr, Morris S, Rovll:\n30C Most 23rd Street\nRoom 500\nRev fork XX, H<w Xos'k\nDear Morrlei\nThis will put la*v a letter statement, at Gr&ydonse request, his and the HAEB-8\nunderstanding reg arding the oonditiens of your consultation service.\nOn the taels this understanding^ thie service will be first undertaken on a\nsix-oonths »Jtsi9# beginning April X, renewable for a second six months, Theee\ndates are Jios© of the grant itself (April X, 1954 - March 31, 1955)* Xou will\nbe paid r retainer of $2500,00 per year (X understand this to mean 4l250,C0\nper ei?v oaths period) plus $73*00 per day plus expenses for days worked for\nth© Hj%3 outside your office. In ome ©f two different days consumed in travel\n(one goings on© returning), one will be chargeable, the other not,\nY; work don© on behalf of the MAEB from your offloe, under this understanding,\nti© MEB will pay no charges other then those for actual expenses such as phone,\nolograph or sailing costa, Checks will b® forwarded to you by F, E. SohooXey,\nHAEB Treasurer, upon receipt of bills forwarded from you through this office.\nAs you will have noted in earlier correspondence of which X tmm kept you\ninformed, services arc to be performed for HAEB and other®, Including\nth® JCEK, 1ICCET, eud EIEC, only after clearance through this office, which\nmem chewing by nm with th© Directors of th© organisation, or others interested,\nexcept in th© moat routine matters, and tahnt only after routines have boon\nestabXiehed.\nA report tvm you will bo necessary, dm September 15, 1954* ®o that it may b®\nincorporated into the report required of us by th© FAS, to reach them not later\nthan October X, V© should also appreciate reports of services performed, on a\nmonthly basis, together with, bin®,\nfour retainer fee for th© first six assntfce will be forwarded to you September 15,\nupon receipt of your first report, if this ie satisfactory with you. At that\ntame a letter of extension can b© issued, if agreeable to both sides of this\nagreement.\nSincerely,\nHJSsrar\ncos MSB Officer©"
}