{
  "id": "d502-71",
  "text": "NAEB HE/U3QUARTERS\n14 Gregory jHalL\nUrbanav Illinois\nT0$\nNAEB Officers\n/ * /\nCONFIDENTIAL\nFROM;\nHarry J, Skornia jl Q Jrr^~\nDATE:\nMay 12, 1954\nSUBJECTS:\nVarious\nThe attached letter to Novik speaks for itself, It*s as I was requested\nby Graydon to drajw up, but with various generalities reduced to specifics,\nI do feel that the fears of one or two people have had sc much effect on\nthe situation now* that Novik;i s value to us is likely to be virtually nil* Herewith,,\nquotations from 2 recent notes from Morrie?\n(1) \"My Dear Harry:\nYou have covered the understanding that youv\nGraydon and I had - thoroughly and accurately.\nAs far as I cun concerned* it is o.k „ and 1\nwill await further instructions.\"\n(2) \"Having said what I did about your May 4th Mem^v I\nthink I ought to tell you in confidence about one\nsac-back that 1 have had* Due to my desire to live\nup to the letter and your prohibition about possible\nNational negotiations.\n1 think I have told you that the top 1BEW> people\nof Los Angeles and San Francisco* St, Louis* etc*\nhave been meeting in Washington for the past couple\nof weeks. Hardy, the top Washington man, arranged\nfor an informal luncheon session to give me a\nchance to explain the problem of the educations;\nstation* 1 was so anxious to avoid any possible\nviolation of the spirit of the Columbus decision*\nthat I cancelled the session and of course missed\nthe opportunity of having the sympathetic attitude\nof L«A._ s San Francisco and Hardy help break down\nSt, Louis which* as you know, is a hard nut to crack,^\nUnless this is to be reduced to an impossible situation of fearfulness,\nI think we should best drop it. I therefore hereby request authorization for\nMorrie to engage in informal conversations of the sort mentioned above, which will\nbe to the long-term advantage of all, I think all unions who read and listen now\nknow there is such a thing as educational TV? and the best presentation of our\nsituation would be one presented by us rather than someone else.\nThe reaction (and In essence vote) of all officers* to Graydon with copy\nto me (if this is o.k* with him) is urgently needed4 as well as your reaction to\nmy May 10 note re meeting. I now believe this meeting should include Scbenkkan and\nGoggin as well as a few Directors at least, so that various sides of the problem\ncan be threshed out. Personally I5m willing to lose a member, if necessary\n{Schenkkan.. you may recall threatened this on behalf of WUNCLTV’ if we \"even talked\"\nto unions) rather than being \"babes in the wood\" a-few years from now. May I hear\nfrom you (besides Hull and Dunn who are already firm and clear)!"
}