{
  "id": "d502-79",
  "text": "May 12, 1954\nMr* Morris S. Novik\n300 West 23rd Street\nRoom 500\nNew York 11, New York\nDear Morries\nThis will put into a letter statement, at Graydon*s request, his and the NAEB*s\nunderstanding regarding the conditions of your consultation service*\nOn the basis of this understanding, this service will be first undertaken on a\nsix-months basis, beginning April 1, renewable for a second six months. These\ndates are those of the grant itself (April 1, 1954 - March 31, 1955)• You will\nbe paid a retainer of $2500.00 per year (I understand this to mean $1250.00 per\nsix months period) plus $75.00 per day plus expenses for days worked for the\nNAEB outside your office. In case of two different days consumed in travel (one\ngoing; one returning), one will be chargeable, the other not.\nFor work done on behalf of the NAEB from your office, under this understanding,\nthe NAEB will pay no charges other than those for actual expenses such as phone,\ntelegraph or mailing costs. Checks will be forwarded to you by F. E. Schooley,\nNAEB Treasurer, upon receipt of bills forwarded from you through this office.\nAs you will have noted in earlier correspondence of which I have kept you\ninformed, services are to be performed for NAEB members and others, including\nthe JCET, NCCET, and ETRC, only after clearance through this office, which\nmeans checking by me with the Directors of the organization, or others interested,\nexcept in the most routine matters, and that only after routines have been\nextablished.\nA report from you will be necessary, due September 15, 1954, so htat it may be\nincorporated into the report required of us by the FAE, to reach them not later\nthan October 1. We should also appreciate reports of services performed, on a\nmonthly basis, together with bills.\nYour retainer fee for the first six months will be forwarded to you September 15,\nupon receipt of your first report, if this is satisfactory with you. At that\ntime a letter of extension can be issued, if agreeable to both sides of this\nagreement.\nSincerely,\nHarry J. Skornia\nExecutive Director\nHJSsmr\ncc: NAEB Officers"
}