{
  "id": "d502-8",
  "text": "December 14# 1953\n(Mr. Morris 3. Novik) - COPY\n—2f*\nindividually with the IBEW Business Manager a few weeks ago he wanted to in¬\ncrease it to 3 to 5# but in any event just the technicians who would be con*\ncorned with installation. When he met last week with Dr. Compton of Washington\nUniversity, Father Reinert of St. Louis University, and myself, he wanted all\nour electronic technicians covered, those wa now had on staff and those we might\nadd in the future.\nYou can see how this thing has pyramided just in informal talks.\nWhere would it go from here, either in negotiation now or in the future?\nLet me elaborate more on this overall agreement IBEW would like to\nhave. We were told last week that IBEW did not want to actually have their\npersonnel in our film department, or in our scenery construction and erection\ndepartment. We could employ anyone we wanted to there, and presumably on our\nown wage and time basis. The IBEW technicians would be allowed to and expected\nto, by the union, to help shift scenery, etc. There would be no hard and fast\njob functions to preclude something like this. Again, the questions what are\nthe probabilities of this situation pyramiding and the whole staff becoming\nunionized?\nMorrie, no educational television station can financially face a\nfuture in which everyone on staff is unionized at union commercial television\npay scales. We are now at a crucial point.\nFrom some quarters here in town I understand that the AFM has eyes\non the station, also possibly AFTRA, and even the Newspaper Guild is con¬\nsidering trying to place its raambors as script and continuity writers.\nYesterday, the Business Manager of the IATSE Motion Picture Operators\nUnion was at the studio to see me; along with him was the Secretary of the Ninth\nDistrict of IATSE. Both wanted to place men on our staff, the first a pro¬\njectionist and the second stagehands there will he a jurisdictional dispute be¬\ntween IBEW and IATSE, and that was made clear to me yesterday when the IATSE\nrepresentatives said that they would oppose any encroachment of IBEW into their\nfields.\nWe don’t want to get caught in any union jurisdictional disputes, we\ndon’t intend to play one union against the other, and w© must be neutral and im¬\npartial. I know local autonomy is strong in St. Louis, but it seems to me that\nthe AFL itself ought to try to reconcile its unions in terms of jurisdiction. I\nhear reports that this is being attempted in Washington, at the national head¬\nquarters, but will the locals concur?\nWith no co&SQsrcial income, with no profits accruing to management and\nto owners, educational stations have to predicate their operations on a level\ndistinct from eceaaorcisl stations. I think the unions should consider pay rates\nof a different order for non-profit, educational stations. This is not a sub¬\nstandard concept for rates of pay because the standards for oossaercial station\noperation and for educational stations are not the same. IATSE indicated to me\nyesterday that they would agree to discussing a different pay scale than for\ncomaercial stations; IBEW was not in sympathy with this when the matter was\nbrought up last week.\nAn educational television station can be and in an area such as St.\nLouis might very wall be considered by the unions as a potential training ground\nfor personnel who would be able to go from us to canxoercial or other forthcoming"
}