{
  "id": "d502-99",
  "text": "COFT\nKQED\nSan Francisco\nAugust 6, 19$k\nMr. M. Si Novik\n300 W. 2bvd St.\nHew Xorjt 11, NT\nDear Mbrry*\n'Diank you for your offer of help. I can11think of any ay we have\nneed if your services at the moment but I can!t be sure that a need might arise\nalmost momentarily.\nEvents of the past few months have put us on a fairly firm foundation^\nSeyen leading businessmen have been elected to® our Board and have begun to make\nplspls for a corporate fund campaign this Fall. Reaction to our modest program\nservice of films from the Center has been good. X believe we are well established\nir^the minds of our audience - thanks to the popular program, \"Shakespeare on TV.\"\nrmr With respect to our relationship with unions, there has been very little\nactivity on this front during the past weeks. The musician* s union has indicated\n/their willingness to let us use their musicians at no cost. X doubt that they\ncould be more generous. IBEW is still willing to hold off until we get started\nwith live programming and then look the situation over. Their representative\nhere has been very considerate and I feel certain a mutually agreeable arrange¬\nment will be worked out when the time cqanes. Only AFTRA has presented problems.\n$ feel sure this is due to the fact that t&ere is an ovorly-zealous woman at the\nhead of the organization. Their own Board is beginning to show signs of bringing\nabout a change in policy. They have talked in t erais of a contract that would re¬\nquire \"normal membership fees\" for all of our talent, including teachers. I have\nresisted this on the grounds that teachers making occasional appearances on our\nprograms are not earning their living as television artists and are, therefore,\nnot within the jurisdiction of AFTRA. This happened at least three months ago\nand AFTRA has not been heard from since. I don* t think they are convinced but\nmay be confused.\nI am enclosing a copy of our annual report which will tell the story\nof the yrontt past year’s activities. We appreciate your interest in us and will\ndo our best to keep you posted on our progress.\nRegards,\nJames Day\nGeneral Manager"
}