{
  "id": "d1401-2",
  "text": "3\nas an educational broadcasting station, from tax exemption,\nprovided it otherwise meets the exemption requirements of\nsection 501 (c) (3) of the Code. Further, the application of\nsection 501 (c) (3) and the Income Tax Regulations thereunder\ndoes not preclude a tax-exempt educational television station\nfrom presenting broadcasts on political matters or political\ncampaigns, if the broadcasts are nonpartisan, the station is\nable to \"show that these programs were undertaken entirely m\nthe public interest, and the station itself is not participating\nor intervening in a political campaign on behalf of a candi¬\ndate for public office . The mere fact that such station affords\nequal opportunities to opposing views would not of itself be\nsufficient to establish as a fact that the station is not so inter¬\nvening or participating, but would, of course, be peitinent to\nany such consideration. Thus, the station would have to be\nprepared to establish factually that it does not urge, advocate,\nor otherwise endorse the views presented.\nWhether, and the extent to which, a particular program or\nactivity falls within the statutory proscriptions against legis¬\nlative and political activities is essentially one of fact to be\ndetermined on a case-by-case basis in the light of the facts\nand circumstances presented. You will appreciate, I am sure,\nthe complexiti e s and difficulties inherent in determining\nwhether political activities of this type are conductea in a\nnonpartisan manner. Similarly, where opposing candidates for\npublic office are being presented by the station for the education\nof their viewers, the fact that equal time is granted to all\nlegally qualified candidates for a particular political office will\nnot in itself usually be sufficient to overcome these difficulties .\nTeaming Resources Institute\nFtom time to time, I plan to give you a brief fill-in on agencies with which\nNAEB is affiliated or which are working in our area of interest.\nThe LRI, of which NAEB is a constituent member, was formed in 1959 as a\nnon-profit corporation for the development and encouragement of instructional\nuse of all learning'resources Candid-visual, electronic, etc.). John Ivey and\nA1 Eurich were its principle architects. Originally, it was planned as a large-\nscale operation which would include a learning resources laboratory and\nresearch center to be housed in its own building at Princeton. The instant\nstimulus, however, was to create an agency to take over the conduct of Conti¬\nnental Classroom from the American Association of Colleges for Teacher\nEducation, which felt that C. C. was becoming too large an activity for it to"
}