{
  "id": "d1221-8",
  "text": "-8-\nBert has a couple of other papers \"in the mill\" which we feel you*!! want to read.\nWe hope more of you will feel the urge to write up your experiences. They may be\nof valuable help to some fellow engineer struggling with the same problem which you\nhave solved. Why don*t you send them to us to include in the Engineering Newsletter?\nJohn Brugger, Chief Engineer of WILL-AM-FM-TV and Clarence Bierbaum, John Wahlfeldt\nand Don Colaw of his TV staff are working like the proverbial beavers to get the\nWILL-TV transmitter on the air. The antenna and transmission line are installed,\nand at this writing it is a matter of tracking down a few elusive bugs and making\nfinal adjustments before the WILL-TV test pattern will be on the air, John reports\nprogress is being made.\nProgress too is being made in the installation of the Detroit ETV Foundation trans¬\nmitter WTVS at the Detroit Public Schools Studio. With power available at the end\nof this week, they will be able to complete final tests before putting a test pat¬\ntern on the air.\nThe Detroit University studio is in operation, the Public Schools studio is ready\nfor live camera installation with film camera and projectors nearly ready for test.\nThe Wayne University studio is still under construction with a completion date of\nSeptember 1.\nPOSTING OF STATION AND OPERATOR LICENSES\nCy Braum of JCET writes \"I think that the NAEB engineers would be interested in\nknowing that on July 22 the FCC changed its rules concerning Sections 3.16U, 3.26U,\nand 3.5>6U which relate to the posting of station and operator licenses at AM, com¬\nmercial FM, and noncommercial educational FM, respectively. These rule changes are\neffective August 31.\n\"The present rules require the licenses to be posted in the transmitter control room\nwhich raises questions about posting licenses when transmitters are operated by re¬\nmote control for a part of the time. The revised rule provides for posting of the\nstation licenses or authorizations at the principal control point of the transmitter\nwith photocopies at other control points. Either the operator*s license or Ecc\nForm 759 must be posted at points where the operators are on duty. The language\nof 3.161* is as follows and the identical language is used in the other two rules:\n\"Station and operator licenses; posting of.\n(a) The station license and any other instrument of station authorization shall\nbe posted in a conspicuous place and in such manner that all terms are visible,\nat the place the licensee considers to be the principal control point of the\ntransmitter. At all other control points listed on the station authorization,\na photocopy of the station authorization shall be posted.\n(b) The original operator license, or FCC Form 759, of each station operator\nshall be posted at the place where he is on duty as an operator.\""
}