{
  "id": "d1638-0",
  "text": "1346 Connecticut Avenue, N.W.\nWashington 6, D. C.\nPhone North 7-6000\nCONFIDENTIAL\nTO: NAEB BOARD OF DIRECTORS APRIL-MAY 1967\nPUBLIC BROADCASTING ACT\nAs you may know by now, the Act has been reported out by the full Commerce\nCommittee with some minor modifications. The principal changes, made by\nthe Pastore Sub-Committee on Communications, removed the words in\nparagraph E of Title II wfcich precluded the Corporation from arranging by\ngrant or contract to secure interconnection facilities directly from a\ncommon carrier. This was the only substantial issue upon which a\ndifference arose on the part of the witnesses, all of whom testified in\nfavor of the bill. Dr. Killian, speaking for the Carnegie Commission,\nfelt that the final responsibility for the distribution of educational\nbroadcasting programs nationally must be under the control of the\nCorporation. In this position he was seconded by Bill Henry, by all of\nthe representatives of the common carriers and by all three major networks.\nTheir reasons for this insistence, however, were quite different. Killien\nfeels that educational broadcasting must not be developed nationally along\nthe pattern of commercial networks and the only way he sees to prevent\nsuch a development is by retaining control of the interconnection within\nthe Corporation. Henry, on the other hand, sees the need for inter¬\nconnection control by the Corporation as a means of building it into a\nstrong \"network agency\" for the full and effective development of educa¬\ntional broadcasting. Stanton took the same position and the other network\npresidents just assumed that this is the only appropriate way to develop\na national educational broadcasting service, i.e., via strong centralized\ncontrol.\nNET and NAEB took the position that the Corporation should not be an\noperating entity. It should collect and dispense money, develop broad\npolicy decisions, and do other appropriate things to foster and encourage"
}