{
  "id": "d1638-3",
  "text": "4,\nGOLFERS, pleas© note that the day before the opening of the conference\nhas been eet; aside for your pleasure® Jo© Wright has challenged\nall comers. Carl Menzer will be on hand Thursday, too. The 18-hole\ngolf course and recreational area at Ames is located less than a\ncity block from the College Armory. Par is 70, 35 for each nine.\nThe total yardage of the course is 4945. There are 5 bridges on\nthe course, three over .Squaw Greek and two over Clear Creak. 30 sand-\ntraps, most of them merely for decorative purposes, are spotted\nthroughout the course. The course fee is ordinarily $1, but by\ngetting a guest permit from Professor Griffith you will b© entitled\nto play for 40 cents, a faculty rate.\nHOTEL rates at the Sheldon-Munn run from #1.50 to #3.50 for a single\nroom and from #2.50 to #5.50 for a double room. The more expensive\nrooms are air-conditioned. The Memorial Union has some rooms which\nwill be made available to NAEB members. The rates are: single\nrooms #1.60 and |2.50; two in a room, double bed $3£ and two in a\nroom, twin beds, #2.50 and #3.80'.\nWHAT DO YOU DO?\nHarold Engel, NASS Vice-President and Public Relations Director for\nWHA, raises some fine points for thought in his comments regarding\nproposed formulation of aims and purposea for NAEB. Read them and\nlet*s have your reactions at the convention!\n\"Your letter, in which you refer to the objectives and scop© of the\nNAEB NEWS LETTER, brings up a point we need to discuss at our con¬\nvention in September. We should raak© it reflect the program of the\nAssociation. . » but first we need to know what that program is.\n^Personally, it seems that the News Letter should serve, as its\nname indicate®, to keep members in touch with matters in which they\nhave a common interest. It should record the achievements and fail¬\nures of the members in their efforts to carry on. It should, also,\nbe a clearing house for the many personal Items which help us to\nbecome 'setter acquainted.\n\"In considering a program for next year I favor consideration of a\nmore aggressive plan of publicizing the work being done by educational\nstations. You have only to look at the propaganda campaign being\ncarried on by the 31 industry® to entrench the ® American System9 to know\nthat it is aimed at an ultimate commercial monopoly. There is no\nplace In the American system for non-commercial station®. That means\nthe elimination of our stations. . unless we get; busy and tell our\n©id® of the story.\n*If you9ve read the press stories, listened to the promotional radio\nblurbs and program© on the air (Magic Key, etc.5, seen the efforts\nto sail teachers on the American system idea, listened to the speeches\nby broadcasters, and read between the lines in some proposed legisla¬\ntion you know that we are facing a tough proposition. What are w®\ngoing to do about %t% Something, 1 hope.\nWX doubt favor militant tactics, but 1 am tired of seeing our stations\ntake it lying down. Let*s figure out a way to defend ourselves. .We\ndon®t have the money on >ur side, but we do have the merits. We can\nhelp the right people to say the right things at the right time. • •\nand all benefit by the publicity.*"
}