{
  "id": "d1638-5",
  "text": "s*\nAmericans nay say to themselves that; Harvard and other fmouia\nuniversities or colleges might do better and render more diroot and\nmo7*e useful gervioe to a nation or world In travail or distress*\nAre our educational institutions' afraid of tackling over the\nradio such complex and difficult oroblams as unemployments labor\nrelations, taxation, budget miniums* wage legislation,\ntic relief of agrioulture, collective security, the prevention of\nwar, the recrudescence • of: violence and barbarism in Europe, the re¬\nvival of racial ism and. of quack notions concerning itv\nThe Roosevelt administration was ridiculed for years to:.* its\nalleged dependence upon a ‘brain trust.w Ho such institution baa\never\"existed. But the administration has consulted, and continues\nto consult, men and women of braina, education and experience in\nIts efforts to solve the problems.f&oing it and us, and everybody\nrn.&i; applaud that policy. The trouble is, *th© doctors disagree/'\nand the opponents of the administration think that it ij ^cmauitiug\nthe wrong people. The opposition has? its brain trust, and the frt.f-•\nof the $ew Deal think tt et the. wrong guide and lor. Thm\nXt: natural enough. We know that- even in criminal oares the experts\ncontradict each other, and no prosecutor or defender rails to find\nexperts to testify in behalf of his client. In so ole logy and ©con-\ncade unanimity 1 * rare indeed, if it has ever happened, me W*S*\nSupreme Cou .« majority and minority opinions, and no\nindiv i J { ;1 i labeled or stamped* In a 1 *e state,\ntherefore* fairness.-and ommn sense suggest discussion of ail oon~\ntrcvsrslal probleme in a tol -rant and scientific spirit by the queu-S\nfled and respcote4 leaders of the nation*\nSuch discussion is 11 the more essential because partisan\ndiscussion during pre-e?.$G\"5ioh campaigns is, as a rule* woefully\nunscientific, not. to say intellectually dishonest, Assertion is\n■a: % accompanied by proof worthy of . the name. Benunol.it ion, per sons 4.-.4\nties- vituperation,\" wild extravagance, and windy generalities\nthe place of quiet argueont or analysis of evidence* The typical\nstump speech does not • -lucat© any one* it misleads and confutes*\nIt is sheer -propaganda, ...at sincere- education*\nThe writer has often thought that presidents end catenets call?.\nupon to malts important decisions, launch momentous legislation, d op sir\nfrom cherished traditions or precedents would disarm much partisan\ncriticism and greatly strengthen their position by summoning, before\ntaking action, a conference of the leading authorities in the field\naffected an! requesting them to canvass the issue requiring action,\ncon p 'it note; a r oo ini on a deliver Cither a oolle oti v*> Judgment,\nor else, If that bo' igposeibbe, majority and minority reports* The\nnation would know then to what extent science and education, support\ntin decision eventually made. There would be no rooir. for guesswork\nor for irony and sarcasm • Disagreement would be registered publicly.,\nand The reasons for it set forth in documents soberly addressed to\nthe intelligent elements of the nation.\nA government might, after due deliberation, pref-sr the minority\nview to that of the majority* In solenoe, the majority is net\nnecessarily right. Darvrin did not express i.he wonv^ctlonc of a"
}