{
  "id": "d1831-1",
  "text": "NAEB NJfilfS LETTERa. . . APRIL 1, 1940, .o . Page 2\nfield might make possible an educational broadcasting chain which would\nlessen the burdens on individual stations so that they could concentrate\non quality^ rather than on quantity*\nFor the NCERg Evans emphasized the need to eliminate the unfair and\nunequal competition which now exists in the broadcasting band* He\nsuggested that the ultra-high frequencies created an opportunity for\nthis and that it might be possible on the ultra-highs, where every station\nwill be duplicated anyway, to put stations on equal power in the different\nlocalities so that competition among them might be equalized,,\nEvans says that it seems perfectly clear that for the present at least\nthe educational frequencies aie safe. All of the commercial people\nindicated a willingness to have the present reservation of channels\ncontinued.,\nHoward writes? \"The hearings appeared very fully in both Broadcasting\nmagazine and in the NaB Reports. I hope you go over them very carefully.\nTo me they indicate that up around 40 megacycles, frequency modulation\nis the only thing to use,\"\nOn this same subject Commissioner Studebaker says?\n\"It seems to me that the National Association of Educational Broadcasters\nwould do well to consider the potentialities of Frequency Modulation,\nnot only for their own institutions, but for educational systems within\nthe respective states. The rules now permit the use of the education\nband for Frequency Modulation and it is clear that education should be\nvigorous in the development of the reservation,M\nWELCOME QKLAHQVa BAPTIST UN '[VERB IT!\nApplication of Oklahoma Baptist University Campus Studios for associate\nmembership in NAEB has been approved by the Executive Committee of NaES,\nMr„ Ralph E, Matthews is Director of the radio activities of Oklahoma\nBaptist, located at Shawnee, Oklahoma,\nBAUER SUCCEEDS RATLINS AT KIJSD\nMr, G. R0 Bauer has been named Director of KUSD at the University of\nSouth Dakota, He succeeds K, £. Rawlins, whose presence at NaEB meetings\nwill be missed. Our congratulations to Mr. Bauer and we hope to see\nhim on hand for NAE3 affairs, H, S* Peterson is assistant director of\nthe station.\nRADIO TOPICS FOR SPOKANE MEET\nIf Reid White * NaEB Vice-President, will be Chairman of the Radio\nSection at the IoE,E,A0 in Spokane on Anril 4th, Subjects for discussion\nat the meeting were listed as follows?\nSound Films: \"Sound Waves and their Sources\" 5 *»lr ’Saves\", \"Television\".\n\"Why Not Use a Radio in the High School?\" - Ruth Sherwood, High School\nTeacher, Red Lodge, Montana,"
}