{
  "id": "d1170-1",
  "text": "• One day of the convention was set aside for separate di¬\nvisional meetings, including luncheons. From all reports this\ninnovation was a success and will be repeated at future con¬\nventions. Details of each division’s day will be sent to mem¬\nbers by the respective division staffs.\n• At its Austin meeting the Board of Directors re-elected\nWilliam G. Harley as President and Harold E. Hill as Vice\nPresident and Treasurer; James A. Fellows was elected Sec¬\nretary. The chairman and vice chairman of the Board of Di¬\nrectors and the chairmen of the various division boards wild\nbe elected by the boards after the current board elections.\n• Sylvania, a subsidiary of General Telephone & Electronics,\nis a new NAEB Industrial Associate Member, and a plaque\nwas presented to a representative of the firm at the conven¬\ntion banquet. ITT Industrial Laboratories of Ft. Wayne, In¬\ndiana, another new Industrial Associate Member, was also\nrecognized at the banquet although last minute obstacles pre¬\nvented its representative from attending.\n• The following citations were presented at the convention\nbanquet: .\nM. McCabe Day: for his long service and leadership m\ndeveloping the techniques of instructional radio and for his\ncontributions to the expansion of the NAEB Radio Network\nIn-School Service.\nCyril M. Braum: for his many contributions to the tech¬\nnical and organizational development of educational broad¬\ncasting in the United States, and for his steadfast loyalty to\nthe high principles of this Association throughout his years of\nservice.\n• Over 650 persons registered for the 40th annual NAEB\nconvention in Austin, Texas, October 25-28. Except for last\nyear in Milwaukee, when registration was over 800, this is\nthe highest number to attend. An excellent atmosphere of\ncooperation and comradeship prevailed as the re-organization\ncompleted its first year. Both the keynote address by Lester\nBeck and the banquet speech by Carl Rowan were given ex¬\ncellent receptions by the members attending. The other general\nand special interest sessions were well attended, also.\n• The convention approved the report of the Resolutions\nCommittee which thanked all involved in organizing and run¬\nning the convention, memorialized the late President Herbert\nHoover, commended the FCC for its “. . ■ continued en¬\ncouragement and support . • •” of educational broadcasting,\nand saluted “. . . the timely and effective coverage of na¬\ntional and international events by the broadcasting industry\nin the United States. . •\n• Most convention sessions were recorded on tape, and may\nbe ordered from -NERN. For order blanks and information on\nprices, write to Robert E. Underwood, Jr., NERN Manager,\nUrbana NAEB Office.\nInsurance Notice\nFlyers on the insurance plans available to individual members\nhave been mailed to such members and are enclosed with this\nNewsletter. Please note the January 1 deadline for applications.\nProf. Waldo Abbot Dies at 76\nWaldo Abbot, NAEB pioneer and early NAEB Board mem¬\nber, died Saturday morning, November 14, at the age of 76.\nA member of the University of Michigan faculty for 37\nyears until his retirement in 1957, he was that university’s\nfirst teacher in the field of radio and taught broadcasting to\nsuch figures as Mike Wallace. He was the first U-M direc¬\ntor of broadcasting and the author of one of the first text¬\nbooks in the area, Handbook on Broadcasting. Besides being\na leader in the field of broadcasting, Professor Abbot was at\ndifferent times a journalist, prosecuting attorney, manufac¬\nturing firm director, and teacher of college English.\nNAEB Dues Questionnaire\nA questionnaire to facilitate the preparation of bills for\nNAEB dues and divisional fees has been mailed to members\nof the television, radio, and instructional divisions. All should\nhave been returned by this time. Those who have not done\nso are urged to send the completed questionnaire to the Wash¬\nington office immediately.\nNews Notes\nPERSONNEL\n• Anne Doyle of WGBH-TV has been appointed vice-presi¬\ndent and Washington representative of the Broadcasting Foun¬\ndation of America.\n• James M. Morris, professor of education in the Oregon\nDivision of Continuing Education, has been named head of\nits information services.\n• John C. Schwarzwalder, general manager of KTCA-TV,\nhas been reappointed to the Metropolitan Planning Commission\nby Minnesota Governor Karl Rolvaag.\nNER PROGRAM GRANTS\n• Five creative production awards were made by NER, the\nfunds coming from a grant made to NAEB-NER by the\nNational Home Library Foundation. Announcement of the\nawards was made by Jerrold Sandler, NER Executive Di¬\nrector, at the NAEB convention banquet. Of special inter¬\nest is the award to Station KEBS (San Diego State College)\nfor a series of thirteen dramas written, produced and di¬\nrected by Arch Oboler. Additional awards were made to\nStation WDET (Wayne State University), Station WKAR\n(Michigan State University), and Station WBGO (Newark,\nNew Jersey, Board of Education). Another award calls for\na cooperative project between Station WHA (The University\nof Wisconsin) and Station WRVR (The Riverside Church,\nNew York City).\nETS AWARD WINNERS\n• Winners of awards for ETV program proposals were an¬\nnounced by C. Scott Fletcher, President of ETS, the Televi¬\nsion Stations Division of NAEB. A grant of $5,000 from the\nReader’s Digest Foundation made possible four awards of\n$1,000 each and two of $500 each. The $1,000 award winners\nare KLRN-TV, Austin, Texas; WQED-TV, Pittsburgh;\nKUED-TV, Salt Lake City; and WOSU-TV, Columbus,\nOhio. The $500 award winners are KOAP-TV, Portland,\nOregon, and WMVT-TV, Milwaukee. The programs are to\nbe produced by February 1, 1965 and will be made available\nto other ETV stations later in the year.\nAWARDS\n• Marvin Camras, 1IT scientist who developed a magnetic\nrecording device to help a cousin with his singing lessons over\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Editorial assistant: Skip Robinson.\nPhone 333-0580. Area Code 217.\nReporters:\nRegion I —Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\n—Shirley Ford, WRVR, 490 Riverside Drive, New York\nCity, 10027.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul\nMinn.\n2\nNEWSLETTER"
}