{
  "id": "d1170-2",
  "text": "two decades ago, was honored recently at the Nationall Elec¬\ntronics Conference.\n• KFME, Fargo, North Dakota, reports that it has been\nawarded an All-Electric Building Award from Northern\nStates Power Company.\nINSTRUCTION\n• “Electronics At Work,” produced at the South Carolina\nETV Center, is being telecast this fall over ETV stations in\nfive cities. The course, which consists of 90 half-hour films,\nis designed to provide instruction in the basic principles of\nelectronics and their major applications in communication\nsystems. Study guides and practical exercise manuals for each\nunit of 15 lessons are available. Write for information to\nElectronics at Work, Box 96, Barrington, N. J.\n• Noel J. Reyburn and James S. Miles of Purdue are work¬\ning on a project to use classroom videotape as a part of di¬\nrected classroom observation.\n• Please send syllabi of courses in radio and television to\nJack B. Frank, Associate Director, Instructional Television\nCenter, State University College at Brockport, Brockport,\nNew York.\n• Patrick B. Kidder is anxious to get in touch with people\ndoing TV work in the social studies. Write him as chairman\nof the Social Studies Department, Hopkins North Junior\nHigh School, Minneapolis 26, Minn.\nSTATE AND REGIONAL\ny The South Carolina ETV network was featured in an ar¬\nticle, “Closed-Circuit ETV Boom,” in the Sunday, October\n18, New York Times.\n^ The annual meeting of the Association of American Medi¬\ncal Colleges in Denver, Colorado, on October 17 studied the\nuse of South Carolina’s ETV network to further post-grad¬\nuate studies for physicians.\nGENERAL\n^ Picture windows in the east wing of Chicago’s Museum of\nScience and Industry bring weekend visitors within inches of\ninterviews, dramas, and discussions being rehearsed and video¬\ntaped in a special WTTW studio there all day long on Sat¬\nurdays and Sundays.\ny KTEH, San Jose, California, got program test authoriza¬\ntion, on October 19 and began the same day.\ny KVCR-TV, San Bernardino Valley College, has been\npicked up 2200 miles away in Milwaukee, Wisconsin.\nSTATION ANNIVERSARY\n^ David Susskind and Charles Siepmann helped WHYY-TV\ncelebrate its first anniversary last month.\nINTERNATIONAL\n^ The Japan Broadcasting Corporation, NHK, recently par¬\nticipated for the first time in the annual San Francisco Film\nFestival, with entries in the Communication and Art cate¬\ngories.\nPROGRAMS\ny The 43rd Pittsburgh International Exhibition of Contem¬\nporary Painting and Sculpture is the background for the\nWQED original award-winning ballet, “Comment.”\ny Filmed reports of work being done by the world’s leading\nscientists are presented each week on “Spectrum,” WNED-\nTV, Buffalo, N. Y.\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN.W., Washington, D.C., 20036. Phone 667-6000. Area Code 202.\nBOX SCORE\nTotal AM stations 4081 (includes 38 noncommercial stations)\nTotal FM stations 1494 (includes 293 noncommercial stations)\nTotal TV stations 665 (includes 97 noncommercial stations)\ny The CBC Television Network’s approach to the Shake¬\nspeare sesquicentennial is “This Was a Man,” a show com¬\nbining filmed scenes in Warwickshire and London and quo¬\ntations from plays, poems and sonnets, tracing the boy and\nthe man, and emphasizing the timelessness of his writing. The\nprogram tries to “see the same signs and 'hear the same\nsounds that Shakespeare talks about constantly.”\ny “Delegate,” produced jointly by WQED, Pittsburgh, and\nWHDH-TV, Boston, follows one delegate from each party\nat the national conventions.\ny San Diego State College’s “Profile,” a half-hour continu¬\ning series now being carried by nine ETV and commercial sta¬\ntions, recently presented a three-program series entitled “In\nthe Shadow of Greatness,” featuring dramas by three Eliza¬\nbethan playwrights long overshadowed by Shakespeare.\ny Professor Saul D. Larks, who heads a biomedical engi¬\nneering and training program at Marquette University has\nproposed a world-wide medical monitoring system using Re¬\nlay and other communications satellites.\n^ WNYC recently broadcast five programs devoted to the\nCity Planning Commission’s Symposium, “The Future By\nDesign.”\ny “Dear Mr. Scientist,” produced at Argonne National Lab¬\noratory near Chicago, consists of informal give-and-take dis¬\ncussions of questions sent to the Laboratory by students across\nAmerica, and of elaborations on basic scientific problems in\nthe nuclear age.\ny “First Person, American,” a series done by WNYC and\nWNYC-FM in cooperation with the American Council for\nNationalities Service, studies individual American immigrants.\ny WQED’s “Key to the City,” an evening program of inter¬\nviews with outstanding personalities, has begun its eighth\nyear.\ny Two Canadian films available to the public are “Are Peo¬\nple Necessary?” produced by Metropolitan Educational Tele¬\nvision Association of Canada, and “We Could Keep the\nWheels Turning,” by CBC Newsmagazine. Both are offered\nfree, the first from the Ontario Department of Economics\nand Development, 454 University Avenue, Toronto; the sec¬\nond from CBC Newsmagazine, 354 Jarvis Street, Toronto.\ny WTTW recently presented “The Foundations and the\nArts,” a conversation among representatives of three foun¬\ndations which use distinctly different approaches in their fi¬\nnancial support of the arts and artists.\n^ WHRO-TV, Norfolk and Hampton’s ETV station, recent¬\nly taped a series of ten lessons on “Space and Space Prob¬\nlems,” developed and produced by National Aeronautical and\nSpace Administration, Langley Air Force Base, Virginia.\nThese are now available to other ETV stations.\ny Secretary of the Interior Stewart Udall was guest on the\ncampus of Washington State University recently, where he\nwas interviewed by the KWSC-TV film unit for statewide\ndistribution on the university MOSAIC TV program.\n^ WHYY-TV, Philadelphia, is presenting a new eight-pro¬\ngram series, “Metropolis: Creator or Destroyer ?” studying\nproblems of Philadelphia and other major American cities.\ny “All Seriousness Aside,” a new series of weekly programs\nproduced and read by Bill Shigley of WBAA, consists of\neverything from the wit of H. L. Mencken and John F.\nKennedy to the musical burlesque of Spike Jones. All forms\nof comedy are being presented.\nDECEMBER, 1964\n3"
}