{
  "id": "d1119-0",
  "text": "National Association of Educational Broadcasters\nheadquarters: Radio hall\nLi ad i s on 5 Wisconsin .\nAugust 18, 19?6\nTo All 0. S, Educatlon al 3 road casting S t a tions t\nThe October 5 allocation hearings before the Federal Communications\nCommission may directly or indirectly effect every educational station\nin this country. Special interest groups are now uniting to further\ntneir interests* Education, too, must tell its story.\nAt the recent 3.A.E.B. convention ways of presenting the case of\neducational radio were discussed, a first, and immediate, step isthe\nproposed publication of a brochure depicting the present status of edut.\nrational stations.\nData and pictures must be supplied at once by the stations. The\nFederal Radio Education Project will edit the material and prepare it\nfor publication. The National Committee on Education by Radio is ex¬\npected to finance the printing, all will work with us - but we must\nwork fasti\nIt is expected that Commissioner Studebaker will see that conies of\nthe completed brochure are in the hands of the F.C.C. members and others\nconcerned. In this way a composite and convincing picture of the\nactivities of educational broadcasters will be available prior to the\nallocation hearings.\nhere are the plans for publishing the brochure -\n1. Fill in the enclosed questionnaire and return\nit at once to.* h. a. .Engel, Radio hall, Madison,\nhi scons in. «-c cu racy of s t a t emen t is impo r tan t\nalthough data should be selected to make the best\nshowing.\n1. All stations will have equal space IF they sub¬\nmit their data and suitable pictures promptly. (One\npage of copy and one page of photographs.)\n?. Copy and proof will be returned to each station\ndirector for checking before publication.\n4. Extra copies of the brochure will be available\nat small cost.\n5. Reprints of individual stations1 portions of the\nbooklet may be had at a nominal cost if desired.\n6. Booklet will include brief general history of\neducational broadcasting in this country, a nap'\nshowing call, power and location of educational\nstations will be included also.\nPlease read the following pages carefully! Add extra data per-\ntain:1 ng to your station."
}