{
  "id": "d798-2",
  "text": "National Association of Educational Broadcasters\nPRESIDENT’S MEMO\nVnl T No. 1 \" washinqton, D. C . November 9 f 1962\nI have long felt the need for a vehicle of some kind that would afford a\nmeans for more informal and off-the-record communication with managers of\nstations, closed-circuit systems, and production centers. This is it.\n“President’s Memo” will be issued at least once per month-and oftener\nwhen circumstances dictate. It is my intention to report regularly on matters\nof current concern or which I feel should be brought to your attention. Since\nthis memo will not be distributed for general consumption, it will be possible\nto include a good deal more news-behind-the-news and suggest reasons, offer\nsuppositions, and make predictions. I hope it will prove a useful .addition to\nour communication resources.\nPhiladelphia Afterthoughts.,\nThis was the biggest NAEB convention (over 500 registrants, 36 exhibitors)\nand certainly the liveliest. Both conditions are a reflection of ever-m\ncreasing interest.\nWhen the questionnaires on the convention are returned, we will have a\nmore precise reading, but even now it is possible to make some statements\nwith confidence.\n1. There was overwhelming approval for the structuring of the convention\nin such a way that the Board met twice, with its decision-making session\nheld after the convention and with the benefit of discussions at two business\nmeetings, regional meetings, and interest group sessions-not to i\ncorrider comment and cocktail colloquy. This structure, for which Harold Hill\ngets the credit, was in response to comments of previous conventioners a\n“We didn’t have a chance to talk,” “Everything was cut and dried—decided\nbefore we got there’ etc.\nWell, this time there was a good deal more time to talk and unquestionably\nthis talk had an effect upon the Board in its deliberations on Thursday.\nEncouraged by the success of this arrangement, the staff will employ the\nsame plan at Milwaukee and extend it still further by giving the radio, closed-\ncircuit TV, and TV station groups longer periods for the discussion of their\nparticular interests.\n2 There was widespread interest in providing for a greater voice in\nAssociation affairs for closed-circuit operators and for individual members"
}