{
  "id": "d798-36",
  "text": "Staff Proposal Regarding Program Acquisition and/or Exchange between the NAEB\nandThe*Bducational Radio Network\n1. The ERN would became a Sustaining member of the NAEB at $200 per /ear.\n2. Otoe ERN would pay a basic NAEB Radio Network fee of $1,000 per year for which the\nERN would receive 52 hours of programming during the year for which the fee was paid.\nAdditional programing could be obtained for $25 per hour or fraction thereof.\n3. These programs would be broadcast by ERN member stations simultaneously or by tape\ndelay not later than seven (?) days after network origination. The ERN would abide by\nrelease dates for programs as established for all NAEB Radio Network members.\n4. All ERN affiliated stations will maintain Active membership in the NAEB.\n5. Any ERN station desiring to do so could, if it so desired, subscribe to regular\nNAEB Radio Network membership at the established rate. ERN stations not subscribing\nseparately to the full NAEB Network service could acquire NAEB programing not available\non the ERN schedule at the rate applicable to other NAEB Active members who are not\nNAEB Network members. (This rate is currently $7 per hour, or fraction thereof.}\n5. Any agreements between the NAEB Radio Network and individual stations of the ERN\nfor services to the NAEB in exchange for NAEB programs (e.g., the present arrangement with\nWAMJ) may still be entered into upon mutual agreement between the NAEB and the station\nconcerned.\n6. ERN stations belonging separately to the NAEB Radio Network may submit programs for\npossible use on the NAEB Network under the normal arrangement whereby submitting stations\nreceive credit toward additional Network programming. Such programs may not then be\noffered by the originating station to the ERN, the only way the latter can obtain such\nprograms being through acquisition from the NAEB- Similarly, if the originating station\nprovides a urogram for the ERN, it may not then offer the same program to the NAEB\nNetwork, and the NAEB could obtain such program only from the ERN in the same manner it\nmight obtain programs originated by the ERN itself, as outlined in paragraph ?.\n7. ERN programs offered to and selected by the NAEB Radio Network would be exchanged\nfor NAEB programs on a quid pro quo basis, except that such exchange arrangement couxa\nnot be applied to the basic offering of 52 hours nor the basic fee of $1,000 be\nreduced thereby.\n8. Only those ERN stations subscribing to the regular NAEB Network service would be\npermitted to record and retain in their libraries those NAEB programs carried by the\nERN. However, the ERN itself may retain such programs for later repeated use on the\nERN, except in those cases where there are restrictions placed on use by all stations\nand organizations using NAEB programs.\n9, The ERN may not make programs it obtains from the NAEB available to any person\nor organization other than its affiliated stations.\n10. The fees established under this agreement will be applicable only so long as the\nERN is composed of the eight stations now affiliated with the ERN (WGHi-F^Eoston;\nWCR, Amherst: HAMC, Albany; MOTH, NYC; HHYY-FM, Hiiladelphia; WAMU, Ifeshingtonj WAER,\nSyracuse; HRTC, Hartford). If additional stations are added, the lee will need to be\nrenegotiated."
}