{
  "id": "d798-4",
  "text": "(3)\nproposed service would outweigh the potential usefulness of the channel\nfor education.\nA recent case in point is the Commission's action, despite a vigorous\nopposing effort by a commercial applicant, designating Channel 2 0 in\nChicago as a non-commercial reservation. In its Report and Order the FCC\nstates: “The substance of the remarks in favor of the reservation of Channel\n2 0 for educational purposes is covered by NAEB’s statement, ‘The necessity\nindicated by educators in Chicago for multiple educational channels in a\nsingle community is in accord with the majority of educators throughout the\ncountry, who reported to the NAEB that two or more channels were necessary\nto provide for the complex schedules, the added diversity of courses and\nthe mushrooming types of services which could be afforded by school\nsystems to the community at large.\nChannels 14 and 15\nThe attempt by the Land Mobile Communications Section of EIA to obtain\nChannels 14 and 15 for mobile services is not being taken very seriously\nin Washington. NAEB, NAB, and holders of licenses or CPs for these\nchannels are filing oppositions to the petition, but most communications\npeople here feel the FCC is not likely to even schedule the petition for\nrule-making. Education’s stake in Channels 14 and 15: 3 existing stations\nor CPs, 6 educational reservations, 3 6 proposed reservations, 5 proposed\nadded channels to be reserved.\nASCAP May Move Against ETV\nPresident Adams, of ASCAP, has recently announced that, though up till\nnow the Performing Rights Society has been granting free licenses to ETV,\nthis situation is about to change, now that ETV is beginning to take on\n“substantial proportions.“ It is quite likely that ASCAP will attempt to\nmake royalty charges during the coming year for ETV and will probably ex¬\ntend the demand to radio.\nObviously, such an additional expense would place a serious burden\non many educational stations. NAEB, in concert with other interested\nparties, proposes to inaugurate discussions with ASCAP on this matter to\nforestall such a development. If unsuccessful, exploration will be made\nof possible legislative remedies ."
}