{
  "id": "d798-54",
  "text": "7\n2\nnevertheless, a majoiity of the Directors, who are, after all, elected by the\nmembers to represent them, made a decision and it should, therefore, be accepted\nwith good grace as the will of the group—at least till opportunity arises tfuough\nnormal procedures to reconsider the vote,\nThe Board itself may subsequently alter its decision or the membership in con¬\nvention assembled may direct the Board to reverse its decision *\n1 appreciate that you felt the decision at Columbus was wrong and, what's more,\ncontrary to the wishes of members most concerned. I could wish, though, if you felt\ncompelled to broadcast your disagreement, that it could have been done with prior\nknowledge of headquarters. In that way we might have worked out a joint statement\nof opposing views so that readers could have a coherent dialogue upon which to make\na judgment The series of alternate releases—of arguments and counter-arguments—\nwhich did take place was rather undignified and certainly caused needless harm with¬\nout, I think, achieving any useful purpose.\nAt the same time though, I recognise that another democratic principle is\nfreedom of speech. When somebody feels strongly he ought to speak out. In a\ndemocratic organization, there must be opportunity for reporting so that leaders\ncannot keep themselves and their acts from scrutiny, nor can we permit the reporting\nto be selectively organised so as to put the administration's case in the most favor¬\nable light. 1 respect your right to write; 1 just deplore the manner in which you chose,\non this occasion, to exercise it.\nAt the convention there will be an opportunity for the ETV station managers to\nmeet and fully express their views and wishes to the Board. You will note that\nwe have arranged to have the Board meet both at the beginning and end of the con¬\nvention so that there will be ample opportunity for the membership to react to initial\nproposals and convey wishes to the Board before it fakes final action on any matters\nof consequence -\nWith highest personal regards,\nSincerely,\nWilliam G. Harley\nWGH :pw\nBCC: Messrs. R.B. Hull\nR. D. Hurlbert"
}