{
  "id": "d798-65",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nMr. William G. Harley\nPresident, NAEB\nDuPont Circle Office Building\n1346 Connecticut Avenue, N. W.\nWashington 6, D. C.\nOFFICE OF THE REGIONAL DIRECTOR\n2151 Highland Avenue\nBirmingham 5, Alabama\nMay 8, 1962 MAY 10 1962 ^\nI\nDear Bill:\nThis is to commend you for slogging through another series of Board and com¬\nmittee sessions with dignity and accomplishment. Our growing pains are so\nevident, but growing we must and do. There were several milestones passed\nat the recent sessions which were even more significant than those who parti¬\ncipated realized. We survived to progress where we might have recessed and\natrophied. I am still concerned with the matter of formalizing mechanics for\nour management level structure. During our executive committee meeting, you\nfelt that the presentation for such considerations would be fitting and proper\nfor the President to make to the Board. However, in your comments to the Board,\nyou gave it rather passing attention. I now request that this matter be given\nserious constitutional attention.\nOut of six TV Board members, all of whom responded to filling the blank, I am\nsending you a composite of their response in addition to their comments to a\nnumber of the questions which could not be answered with a simple \"yes\" or\n\"no.\" You will note that there is unanimous opinion in practically every case\nand there is certainly evidenced a feeling for serious attention to the matter of\nimproving our procedures.\nMay I suggest that, inasmuch as we are all quite in accord as to the necessity\nfor most of the recommendations, we proceed with the same and formalize the\nacceptance by official act, whether this be a change in by-lawy, constitution,\nor Board action. Incidentally, I would like to add that meetings of the executive\ncommittee should have an official record by a secretary as we practice with any\nother type of meeting.\nI am prompted now to urge that we reconsider the matter of where the NAEB Board\nmeetings will be held in the future. This question has been of serious concern\nfor sometime because of our inability to decide when and how long our meetings\nshall be held. There has been schedule conflict or at least inconvenience in con\nnection with the IERT meeting. I recommend that the spring meeting of the NAEB"
}