{
  "id": "d798-66",
  "text": "Mr. William G. Harley\nMay 8, 1962\nPage #2\nBoard from here on out be held in Washington at our national headquarters and\nthat the fall meeting be held at our national convention.\nCopies of the TV Board and Development Committee meeting minutes are attached\nfor your records.\nI have a copy of a proposed project as prepared by Vernon Bronson and submitted\nto Bill Bowden for a southeastern conference on matters of interchange with ETV\nmaterials and signals. My instigation of this whole idea from the first was with\nemphasis on interconnection of networks in the southeast where there exists as\nnowhere in the nation a laboratory, partially equipped (ten ETV stations), for\nsuch a project. This was to be studied in conference in Washington with Seth\nSpaulding and then an approach to be made to the SREB and the NAEB.\nThis ready hatched proposal has had no participation in its preparation so far as\nthe AETC is concerned. Furthermore, it subordinates the prime objectives as\nconceived in the AETC original idea. Likewise, it completely leaves out the part\nthat our NAEB could well play in sponsoring such an important project. The AETC's\ninterest in the idea is strictly professional with the NAEB taking a pre-eminent\npart in its launching and its implementation.\nI regret burdening you with this problem, but, if the AETC is to have any responsi¬\nbility in this plan,,it will expect to be included in the decision on objectives.\nFurthermore, the AETC will need to be satisfied that the objectives are within\nreach or why bother. Chasing rabbits is too time consuming and Enervating.\nEven though I withdrew the designation of John Dunn as the proposed chairman of\nthe NAEB committee for studying and presenting a revised plan for redistricting\nNAEB, I feel that the idea is good for NAEB. This brings him back in the operation\nin a functional manner and in a capacity that he can well fill. The more partici¬\npation we get on this sort of activity the more we relieve the administration of\nsuch matters and lessen the burden at headquarters.\nSincerely yours,\nRDH/ml\nenc.\nChairman, TV Board\ncc: TV Board members"
}