{
  "id": "d798-76",
  "text": "Febnixary 27, 1962\nMr. Richard B. Hull\nTelecommunications Center\nThe Ohio State University\n2470 North Star Road\nColumbus 21, Ohio\nDear Dick:\nRe your letter of February 22nd, let's try to get together with\nJim for lunch on Sunday at 1 P.M. If you cannot make it that soon,\nyou may be able to get in for coffee and dessert. If not, we will\nget together as soon as we can that afternoon, because there is a\ncocktail hour at 5.\nI have asked Jim (after Harry declined because of commitment to\nhis new book) to serve as chairman of our new Planning Committee.\nThis will be a committee composed partly of members of the Board and\npartly of our more experienced \"people at large.\" It will assume\nsome of the aspects of the old Development and Fund Raising Committees\nbut having a larger purpose in developing long-range planning. Its\nimmediate concern will be the preparation of the restructuring plan.\nSince there is much to discuss on this latter score, I plan to\nvisit Jim in advance of the Region III meeting so that we can have\nsomething pretty well in shape before we get together with you.\nI had a good two-hour session with Lyle Nelson and it was well-\ntimed: he was just putting the final touches on his report to Ford.\nWe were in agreement on a substantial number of points concerning the\nfuture of educational television and I was particularly gratified to\nfind that he believes that the next big area of development must relate\nto people} furthermore, he feels NABB is the logical organization to do\nthis. He believes that after this evaluation by Ford, and their decision,\nthe air will be cleared considerably. Ford will make clear the precise\nnature of support they will provide for ETB, thus leaving the way\nclear for other foundations to enter the field.\nWe had a good talk and I came away feeling quite encouraged as\nthe result. Not all of Nelson's recommendations will be accepted,\nof course, but if a substantial number are, I think prospects are\nmuch improved for enhancing our activities."
}