{
  "id": "d798-80",
  "text": "Februaxy 1, 1962\nBr. Boren B. Stone\nManager, KCTS-TV\nUniversity of Washington\nSeattle % Washington\nBear Boren:\nBill has asked me to report to you on the current statue of the -various\nitems you passed on to him after the convention as a result of the meet-*\nlag of the TV Board.\nIn planning for the 1962 convention, we are setting aside a session which\nwill permit simultaneous meetings of TV station personnel, radio station\npersonnel, and production center personnel — each group meeting with the\nproper members of the MM Board. In addition, we are setting aside a\nperiod for each Regional group to meet with its Birectors, and for Asso¬\nciate members to meet with their Directors, and Individual members to meet\nwith their Director.\nI was a little surprised that the TV managers felt that there was too\nlittle on the convention agenda of interest to them. Actually, in recent\nyears we have overloaded in the direction of TV - to such an extent, in\nfact, that the radio members are complaining more loudly than the TV mem¬\nbers. However, we will continue, especially through the various special\ninterest interest sessions, to provide as much material as possible of\ninterest to the diversified groups we must serve.\nIn regard to the 1962 seminar - you will recall that the Board approved\nunanimously a recommendation by the Professional Development coaasittee\nthat available seminar funds be used for a follow-up meeting on last sum¬\nmer's seminar, and plans are now underway to hold such a conference. It\nIf felt that we should not let last summer's \"good start\" be wasted,\nthat we should proceed to determine how the Association can best carry out\nsome of the recoii^ndations growing out of last summer's meeting.\nI believe you know that the inventory of STV programs available from sources\nother than the Center is currently in progress - being handled by Chris\nDonaldson.\nHie staff has been working closely with the new Research and Mucation divi¬\nsion of the FCC - especially with KSeith Engar. Xte agree that we should do\neverything possible to help find a well-qualif 1 ed permanent person to replace"
}