{
  "id": "d1622-0",
  "text": "N A £ 8 NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nFrank E0 Schooley, Editor, Station WILL, Urbana, Ill„\nAugust 1, 1944\nWNYC RECEIVES BILLBOARD PROMOTION AWARD\nWNYC, New York City, received a special citation from Billboard Magazine\nAS A PART OF ITS SEVENTH ANNUAL RADIO STATION PROMOTION SURVEY. The\nCITATION WAS GIVEN WNYC BY THE JUDGES OF THIS YEAR8S BILLBOARD SyRyEY\nhfor making New York a better radio town.” WNYC was the only non¬\ncommercial RADIO STATION IN THE NATION TO RECEIVE AN AWARDe\nThis special citation marks the second consecutive year that the\nMunicipal Station has been singled out by the award committee of Billboard8s\nannual surveys for special recognition. Last year the radio editors of\nNew York that formed the award committee presented WNYC with a citation\nFOR OUTSTANDING PUBLIC SERVICE TO THE CITIZENS OF NEW YoRKo\nThis year, the judges were members of the leading advertising agencies\nENGAGED IN RADIO SALES PROMOTION., ThEV INCLUDED CARLOS FRANCO VOF YquNG\nand Rubicam), Linnea Nelson (of J, w. Thompson), and Frank Silvernail\n(of Batten, Barton, Ourstine, and Osborne).\nFCC ANNOUNCES POLICY OF STATE-WIPE PLANS FOR FM\nThe Federal Communications Commission has received information from the\nUl Sc Office of Education concerning proposed state-wide plans for the\nALLOCATION OF THE FIVE FREQUENCIES RESERVED FOR NON-COMMERCIAL EDUCATIONAL\nFM BROADCASTING STATIONS,, It APPEARS THAT SUCH PLANS, IF CAREFULLY PRE¬\nPARED WITH A FIEW OF FAIR TREATMENT OF PUBLIC AND PRIVATE EDUCATIONAL\nINSTITUTIONS, BOTH URBAN AND RURAL, AT THE PRIMARY, SECONDARY, HIGHER?\nAND ADULT EDUCATION LEVELS ALIKE, MAY PROVIDE A SOUND MEANS FOR SECURING\nTHE MAXIMUM POSSIBLE UTILIZATION OF EDUCATIONAL FREQUENCI ES. ACCORDINGLY,\nwhile the Commission must dispose of each application on its merits, it\nWILL GIVE CAREFUL CONSIDERATION IN CONNECTION WITH EDUCATIONAL APPLICATIONS\nTO ANY STATE-WIDE PLAN FILED WITH IT,\nThe Commission8^ rules define a^non-commercial educational broadcasting\nSTATION11 to MEAN \"a STATION LICENSED TO AN ORGANIZED NON-PROFIT EDUCAT¬\nIONAL AGENCY FOR THE ADVANCEMENT OF ITS EDUCATIONAL WORK AND FOR THE\nTRANSMISSION OF EDUCATIONAL AND ENTERTAINMENT PROGRAMS TO THE GENERAL PUBLIC.\nWISCONSIN HOLD SUMMER RADIO INSTITUTE\nThe Director of the Division of Radio Education at the University of\nWisconsin - H. Be McCarty, better known as Mac —reports that he has been\nSWAMPED IN CONNECTION WITH THE UNIVERSITY OF WISCONSIN SUMMER RADIO\nInstitute, held July S7th through 24th, On the instructional staff of\nthe Institute were H0 L0 Ewsank, Professor of Speech; William G* Harley,\nAssistant Director of WHA; Walter Krulevitch, Program Supervisor, WHA;\nHelen Hanford Stanley, Director, Radio Workshop, University of Alabama,\nand Mac."
}