{
  "id": "d1223-2",
  "text": "construction and operation has been voted out by the house\neducation committee.\nGENERAL\n^ The University of Alabama has won three certificates of\nexcellence from the Southern Speech Association. Graydon\nAusmus, director of broadcasting services, received the group’s\nfirst professional award for his contributions to educational\nbroadcasting, and certificates were awarded two ETV series\n—Capstone Concert and Music Time.\n^ Only one ETV facility was cited by the Edison Foundai-\ntion this year—the University of Michigan TV Center. The\ncitation was for “creative educational television.”\ny KVCR-TV, San Bernardino Valley College, is now carried\non Channel 6 by the CATV system; this covers an additional\n2,000 homes in the California city.\n^ KTCI-TV, sister station of KTCA-TV, Minneapolis-St.\nPaul, has gone on the air. The KTCA staff, including General\nManager John Schwarzwalder, will serve KTCI also.\n^ The Northeastern Pennsylvania ETV Association is re¬\nceiving a gift from the Taft Broadcasting Company of the\ncomplete TV transmitter of WNEP-TV, valued at over\n$350,000. It is hoped that the gift will advance the beginning\nof ETV in northeastern Pennsylvania by three years.\n^ WTVS, Detroit, presented a special schedule for the week\nof May 9 in honor of the city’s ETV Week and also cele¬\nbrating WTVS’s first decade of broadcasting.\n^ WGBH, Boston, broadcast a special program on radio and\nTV on May 1 to celebrate its tenth anniversary.\ny WMVS, Milwaukee, pioneer in ETV color telecasts, showed\nan hour-long NET program in color on May 3. This was the\nfirst NET program to be shown in color on an affiliated sta¬\ntion and WMVS was the only NET station to carry it in\ncolor. WMVS has been carrying color films and showing\ncolored slides on the air since January 28.\n^ The Texas Educational Microwave Project is making\nlong-range plans to use its system to full capacity. Only a\nportion is used by TV, and TEMP could expand its services\nby providing instructional material by high-quality audio pre¬\nsentations as well as by TV. In addition, the system could\ntransmit computer-based data up to four million bits per sec¬\nond (equivalent to transmitting the entire Encyclopedia Bri-\ntannica in 30 seconds).\n^ Plans of the University of Mississippi to operate a com¬\nmercial FM station have run up against strong opposition\nfrom the Mississippi Broadcasters Association, which says\nit is unalterably opposed to any state-supported institution\noperating a commercial radio or TV station. The association\noffered to help the university in securing and operating a\nnoncommercial station.\n^ KLRN-TV, San Antonio-Austin, is showing the CBS Re¬\nports by special agreement with CBS.\n^ The Nashville Public Library (licensee of WPLN, NAEB\nFM station) has a new building, which the telephone com¬\npany is featuring on the Nashville directory cover.\n^ Included in a $750,000 three-story addition at Morehead\nState College, Kentucky, are facilities for ETV production,\nincluding a 1220-square-foot studio.\nPROGRAMS\ny “What IS a College Education?” is the name of a gradua¬\ntion special to be distributed in June state-wide in Washing¬\nton. The KWSC-TV documentary film unit spent spring va¬\ncation traveling across the state interviewing the governor,\neducators, parents, high school students, for the special. Rob¬\nert Davy headed the unit.\nNAEB Headquarters: 1346 Connecticut Ave., N.W., Wash¬\nington, D.C., 20036. Phone 667-6000. Area Code 202. TWX 202-\n965-0299.\n^ WETA-TV, Washington, broadcast live the entire day’s\nteach-in re the Vietnam situation, from 9 a.m. to midnight.\n^ About 75 NERN affiliates are broadcasting the 26-pro¬\ngram radio series based on the International Convocation on\nPacem in Terris. The programs were produced by the John¬\nson Foundation.\n^ The Wisconsin 1965 Legislative Forma series includes\nlawmakers talking on such subjects as: “Lie Detector—Tool\nor Monster?” “Constitutional Conventions for Wisconsin,”\n“Your Tax Dollars,” “Fair Housing Legislation,” “Water\nPollution and Boating,” and “Shall We Legalize Gambling?”\n^ WBFO, FM station of the State University of New York\nat Buffalo, played an active part in the recent Buffalo Fes¬\ntival of Arts by broadcasting three of the avant-garde con¬\ncerts live, plus recording talks for later broadcast. WBFO\nwas the only Buffalo station to cover the festival completely.\nThe station has also broadcast six live concerts by the Buda¬\npest String Quartet this semester.\nJack Boone Visits Site\nNamed for Forebear Daniel\nJack Boone, TV director at WOUB-TV, Ohio University, and third\ngeneration descendant of Daniel's brother Joseph, is shown at\nBoone Rocks in southeastern Ohio. He is engaged in photograph¬\ning points of interest in twenty-one counties in the area for a\ntelecast in support of President Johnson's Area Redevelopment\nProgram.\nIt is hoped that the series of ETV programs will focus atten¬\ntion on the tourism potential of the southeastern part of the\nstate. It was at Boone Rocks that Daniel was held prisoner by the\nShawnee Indians and forced to work with the squaws boiling down\nsalt. It was here that he hunted with braves and, allegedly,\nplanned his escape to Boonesborough from whence he directed\nthe defense activities which saved the settlement from Indian\nattack.\nJUNE 1965\n3"
}