{
  "id": "d1223-3",
  "text": "Remote Van tor Sale\nWFSU-TV, Florida State University Broadcasting, has a 32'\ntractor-trailer unit, minus equipment, for sale. It has been\nconverted for TV usage and includes a shooting platform on\ntop, a winch, collapsible stairs, interior and exterior cabinets,\nwood paneling, and equipment racks. The tractor is a Ford\nV-8. Contact Edward Herp, WFSU-TV director of broad¬\ncasting.\nNASA Offers TV Programs\nThe National Aeronautics and Space Administration is offer¬\ning a new series of six half-hour TV programs, Space: Man’s\nGreat Adventure, without cost to ETV stations. Film prints\nare available for closed-circuit and direct projection.\nNASA also has a new section on still photos and addi¬\ntional film clips to be added to their Radio-Television Produc¬\ntion Aids Catalog, and a new folder describing all of NASA’s\neducational programs and services.\nSend requests for all materials to NASA, Television and\nRadio Branch, Code AFEE-4, Washington, D.C. 20546.\nMedical TV Broadcasters Organize\nThe Association of Medical Television Broadcasters was for¬\nmally organized recently at a meeting of prominent physicians\nfrom throughout the United States and individuals interested\nin organizing a national program of continuing postgraduate\nmedical education through ETV. Dale Groom, director of\npostgraduate education at the Medical College of South Caro¬\nlina, was elected president.\nSummer ETV Offerings\nEastern Michigan University. TV utilization workshop, August\n4-17. 2 hrs. graduate credit. Write Graduate School, EMU,\nYpsilanti, Michigan 48197.\nUniversity of Hawaii. Two 3-credit graduate courses: Tele¬\nvision in Education—use, history, research, production,\nteaching, utilization of ETV; Ronald Bornstein instruc¬\ntor. Educational Television—learning principles and mo¬\ntivation, ITV design and development, multi-media de¬\nsign, ITV production; Robert Reed instructor.\nSyracuse University. Seminar/workshop on design and use of\nlearning spaces for new educational media. July 12-23.\nWrite Donald P. Ely, 121 College Place, Syracuse, New\nYork 13210.\nPublications\n• Experiments on Mass Communication, by Hovland, Lums-\ndaine, and Sheffield, has been issued as a paperback by John\nWiley & Sons. The original copyright date was 1949. The\npaperback version, published April 30, 1965, sells for $1.95.\n• Supplement No. 1 to the National Tape Recording Catalog\nhas been published by DAVI. 38 pages. $1.\n• “8” is the name of a new newsletter of 8mm film in edu¬\ncation. Published by Teachers College, Columbia University.\n• One Week of Educational Television is an analysis of\nsubjects broadcast over all ETV stations in the U. S. during\nApril 19-25, 1964. $1 each from: Morse Communication Re¬\nsearch Center, Brandeis University, Waltham, Massachusetts,\n02154. This is the third in a series of examinations of ETV\nprograming by Brandeis. The study reports an effort by ETV\nto broaden its popular appeal, an increase of almost 100 per\ncent in news and public affairs programing during two years,\nand a decrease in local programing despite an average three-\nhour rise per station in weekly broadcast time.\n• A 68-page Handbook for Studio Teachers is available\nfrom: Division of Radio & TV, Florida Institute for Continu¬\ning University Studies, 703 Seagle Bldg., Gainesville.\nHere and There\n• S. I. Hayakawa is program chairman for the 9th Inter¬\nnational Conference on General Semantics, San Francisco\nState College, August 9-13.\n• The Japan Broadcasting Corporation is celebrating this\nyear the 40th anniversary of broadcasting in Japan.\n• The nation’s first master FM antenna, which will permit\n17 FM stations to broadcast simultaneously, is to be installed\natop the Empire State Building.\n• The American Management Association will sponsor a\nfive-day conference on the “Impact of Educational Technol¬\nogy,” July 12-16 at the Americana Hotel, New York City.\n• It is reported that on April 1 the BBC inaugurated\n“smellovision” by putting coffee beans, then onions into a ma¬\nchine and telling viewers to sniff and phone if it worked.\nSome viewers called to complain of tears caused by the\nonions. BBC’s reply: “April Fool!”\n• The latest exhibit to tour Russia under the U.S.-U.S.S.R.\ncultural exchange agreement included a Telstar satellite which\nrelayed a live TV image and a laser beam which carried a\nhuman voice. But the display most popular with the Moscow\nvisitors was one with hundreds of U. S. phone books!\n• Speaking before the SMPTE recently, R. W. Hallet, a\nDouglas aerospace engineer, said TV transmission to space¬\nships roughly 200 million miles from earth is considered post\nsible. Speaking of the problem of feelings of total isolation\nand loss of purpose that spacemen may experience when away\nfrom earth for long periods, he said he believes that TV can\nplay a major role in solving the problem by televising from\nearth to each member of the crew the things that are impor¬\ntant to him.\nPLACEMENT\nPOSITIONS AVAILABLE\n(For information, write the Placement Service, at the NAEB\noffice in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the\nNAEB, with credentials on file with the NAEB Placement Serv¬\nice. Non-members can save time by sending the $10 annual\ndues and $10 Placement registration fee at the time of in¬\nquiry.)\nJune I Radio producer for Big Ten AM operation. Responsi¬\nbilities include general announcing and production with\nopportunity to do sports play-by-play. Position open\nimmediately.\nJune 2 Director of in-school programs for ETV station. MA\ndegree or equivalent with experience in curriculum de¬\nvelopment, classroom teaching (elementary-secondary\nlevel); proven leadership in working with administrative\nand teaching personnel. Salary open.\nJune 3 Director of nursing education TV project. MA in nurs¬\ning or equivalent experience in directing educational\nproject. Communications background desirable. 3-year\nproject.\nJune 4 Cameramen with at least 2 years experience in cam¬\nera operation, lighting, and set erection wanted by non¬\ncommercial TV station.\nJune 5 Assistant to executive secretary for state educational\nbroadcast authority. Should be experienced in ETV, as\nthe person will be expected to help set up educational\nsystem for state. Will work directly under executive sec¬\nretary and will be expected to stay in home office. Sal¬\nary based upon qualifications, but will run between $6,-\n000 and $8,000 for 12-month contract. Must have good\nsecretarial skills.\nJune 6 Assistant producer-director needed for northeastern\nstate teachers college. Must have BA plus 15 hours and\n3 years experience in field. Salary range: $5,500-$6,200.\nPosition open September 1965 for 10 months.\nJune 7 Technician sought for northeastern state teachers\ncollege. No experience necessary, although preferred.\nMust have First-Class Telephone license. Contract for\nI I months. Salary $5,300-$6,000 dependent upon back¬\nground.\n4\nNEWSLETTER"
}