{
  "id": "d1469-1",
  "text": "NAiSB NEWS LETTER*. .MARCH 15, 1940...Page 2\nREPORT OF KFUO,, CONCORDIA SEMINARY\n\"On Sunday, December 10, 1939, from 3:00 to 4:30 P.M., KFUO cele¬\nbrated its fifteenth anniversary in a public Bible Sunday Service in\ncooperation with the St. Louis Publicity Organization and the\nLutheran Hour at the Municipal Auditorium in St. Louis, and in a\nnumber of studio programs throughout that week. The speakers at\nthe public anniversary service were the Rev. E. L. Roschke and Dr.\nW. A. Maier, The Lutheran Hour broadcast was a part of the service• *\nThe week of the celebration of the fifteenth Anniversary was also\nLetter Week, and we received approximately 3,000 cards and letters.\nSome radio experts estimate that only one out of every 200 persons\nwrites in to a station. According to this estimate, the audience of\nKFUO would number 600,000 persons.\n\"You will perhaps remember from our last annual report that the\nexaminer of the Federal communications Commission who heard the\nimportant KFUO-KSD case recommended full equality for kFUO with KSDs\nbut the Federal Communications commission did not sustain the e\nexaminer. Thereupon we appealed the case to the Court of Appeals\nof the District of Columbia, which heard oral argument on April 18,\n19391 and handed down its decision on June 26, 1939, affirming the\ndecision of the FCc and denying our application for increased power\nand additional time. For the present, therefore, we shall have to\ncontinue with the use of 500-watts power at night and 1,000-watts\npower during the day, and with the use of approximately only 20\nper cent of the time, KSD using the remaining 80 per cent.\n\"KFUO broadcasts three times on Sunday (6-J hours) five times daily\nfrom Monday through Friday {3^ hours daily); and four times on\nSaturdays (2§ hours) - a total of 26^ hours a week, The total time\non the air during 1939 was 1,383 hours and 19 minutes. Detailed\ninformation regarding our programs is published in the GOSPEL VOICE,\nan eight-page monthly bulletin, containing the schedule of our\nprograms, news items regarding the station, pictures of speakersB\netc, A sample copy will be sent to any person gratis upon request.\"\nCONGER AT WBAA\nFred Conger, formerly of V/SUI, University of Iowa, is now assisting\nGilbert D. Williams with programs at WBAA, Purdue University.\nConger succeeds Mrs. Chamberlin who has been forced to resign because\nof ill health.\nMany NAEB members will recall seeing Mrs. Phillips at the Harold\nKent Mid-West School Conference in Chicago early in December.\nSPECIAL OFFER FROM MAC GREGOR\nIn the last issue of the News Letter we told of a coming offer\nfrom C. P. MacGregor. Here it is in a letter from Dr. Cline M,\nKoon, Educational Consultant for MacGregor. Dr. &oon says:\n\"Mr. MacGregor is quite sincere in his desire to learn how to serve\neducation, and wishes to merit the cooperation of the educational\nbroadcasters. Therefore he wants your criticisms and suggestions\non the limited number of broadcasts he is offering schools."
}