{
  "id": "d1469-2",
  "text": "NAEB NEWS LETTER*•,.MARCH 15, 1940,..Pag© 3\n\"I discussed with Mr. MacGregor your question of special rates for\nbroadcasting his transcriptions over educational stations. You will\nnote that broadcasting rights are not given with the prices quoted\nin the catalogue. The minimum rates for a single broadcast over a\ncommercial station per 30-minute program is $2.17* and this rate\napplies only to the lowest power poor stations. The average rate is\nnearly $5.00 per transcription *\n\"Mr, MacGregor said that he is Trilling to permit educational\nstations to broadcast any transcriptions they purchase at the\nregular school rates. In other words, he is willing to waive the\nbroadcasting restrictions. This means you can add the transcriptions\nto your library and use them often as you wish. You would not be\nauthorized to permit other educational stations to broadcast the\ntranscriptions in your library.\n\"If you prefer to rent the transcriptions for a single broadcast\ninstead of buying them, you may do so at the flat rate of $1.00\nper transcription (50# per 15-minute program), providing you order\na minimum 24 transcriptions at a time to be delivered aT the rate\nof two or more transcriptions per week. Of course, transportation\nboth ways would be extra.**\nREMEMBER NAEB MEETING AT COLUMBUS\nIn connection with the Eleventh Institute for Education by Radio at\nOhio State University, Columbus, Ohio, April 29th to May 1st, NAEB\nwill hold a special closed meeting on the first evening of the\nconference.\nChairman Fly will address the Institute at the annual dinner meeting\nTuesday, April 30. He will be introduced by Judith Waller, Western\nDivision educational director of the National Broadcasting Company.\nLyman Bryson, professor of Education at Teachers College, Columbia\nUniversity, will conduct a breakfast table discussion on the morning\nof the opening day, April 29, employing the same technique used on\nhis \"People’s Platform\" heard on CBS Saturday night. Subject of\nthe discussion will be, \"Are We Victims of Propaganda?\" Following\nthe conversation, Professor Bryson will lead a discussion from the\nfloor. Similar discussions from the floor will follow all general\nsessions of the Institute.\nFor the first time, announcement of awards for the Fourth American\nExhibition of Recordings of Educational Radio Programs will be\nmade on the opening day* The announcement will come at the close\nof the morning session at the Deshler-Wallick Hotel.\nAn innovation of this year’s Institute are the clinics on music\nappreciation and science broadcasts. These will be held on Monday\nand Tuesday afternoons, in conjunction with the work-study groups.\nAlton O’Steen, research associate of the Evaluation of School\nBroadcasts at Ohio State University, will preside as chairman of the\nmusic appreciation clinic. Chairman of the clinic on science\nbroadcasts will be Loring Andrews, chairman of the program committee\nof the World Wide Broadcasting Foundation, Boston, Massachusetts*"
}