{
  "id": "d1469-4",
  "text": "NAEB NEWS LETTER...MARCH 15, 1940...Page 5\nNEW AM) GROWING MOVEMENT OF LOCAL EDUCATIONAL RADIO GROUPS SERVED BY\nTn~TTTTOcE Of jffitftT^olTAir^^ on committee\nA new national depository and library of scientific aids to education ~\nthe Educational Radio Script Exchange, serving a rapidly growing\ndevelopment of local school and civic groups actively interested in\neducational radio - has published its first complete printed list of\nservices for furthering the cause of American education.\nThe Script Exchange, created by the Federal Radio Education Committee\nin October 1936, to serve as a clearing house for Educational Radio\nScripts and other information, lists in its new publication available\ntoday, the four major services of the exchange® These are: (1) Radio\nScripts, (2) Production Aids, (3) Information end Idea Exchange, and\n(4) Recordings.\nSince its establishment 3 years ago, the Script Exchange has filled\nrequests for more than 250,000 copies of scripts received from about\n12,000 groups in all parts of the country. The steadily expanding\nservice of the Exchange has been made possible through the cooperation\nof several hundred local educational and civic organizations,\nGovernment agencies, and radio stations. These sources have contri¬\nbuted approximately 3,000 educational scripts to the files of the\nExchange during the past 3 years.\nFive hundred and thirteen programs selected by a special script-\nreviewing committee on the basis of quality, and on the kinds of\nrequests for program material which are constantly pouring into the\nExchange, are listed in the ne?; Fourth Edition Catalog. Through the\nExchange’s Circulating Library these scripts are now available to\nqualified groups actively interested in educational radio. Scripts\nmay be borrowed for a period not exceeding 4 weeks. There is no\ncharge for this service.\nDesigned to meet the diversified needs of many different groups, the\n513 scripts are grouped under: Biography, Children’s Radio Programs,\nEducation, Government, Hi .story, Holidays and Special Occasions,\nIndustries, Latin America, literature* Music Appreciation, National\nParks, Natural Science, Parent Education, Safety Education, Science^,\nSocial Science, Vocational Guidance and Wildlife Conservation. Many\nof these programs had their ’’premiere” performances over the CBS, NBC,\nand Mutual Networks.\nThe Script Exchange also makes available upon request, production aids,\nsome of which are free, and others which may be borrowed for a period\nof 3 weeks.\nFree pamphlets listed in the new Catalog are: College Radio Courses,\nRadio Bibliography, Handbook of Sound Effects, Radio Glossarjr\n(2nd Edition), and Radio Manual. Those which may be borrowed are:\nThe ABC of Radio, Annotated Radio Bibliography, How to Use Radio,\nHow to Use Radio in the Classroom, Radio Script Monographs, and The\nRadio Workshop * Also listed are the following FREC publications:\nCollege Radio Workshops, Forums on the Airs FREC Service Bulletin,\nand Local Station Policies.\nDetailed information concerning the recordings of the prize-winning"
}