{
  "id": "d1469-6",
  "text": "N/JSB NE'.VS LETTER. . .MARCH 15, 1940,. .Page 7\nit would interfere with operation of the latter’s station, KOAC (550\nkilocycles, 1 kilowatt), at Corvallis, Ore,\n\"A careful review of the exceptions filed by the intervener and of\nthe contentions of any merit made in the briefs and upon the oral\nargument reveals that the only issue remaining for our consideration\nis that of interference in nigh.ttime service and that this issue\nresolves itself solely into questions of fact/- says the Commission\nin today*s Opinion and Final Order joined in unanimously by the five\nCommissioners present<>\nThe Commission goes on to explain:\n\"The Commission*s present Standards of Good Engineering Practice\n(effective August 1, 1939) deal explicitly with the point raised by\nthe intervenes./.Thile the formal adoption of these Standards and\ntheir official effective date is relatively recent, the policy\nexpressed in them is of some years standing and has been made clear\nto the broadcasting industry and particularly to its technical\nexperts,\n\"The Commission’s curves are based upon averages arrived at by c reful\nactual measurement of a great number of signals in all portions of\nthe country and over a long period of time. Their accuracy as\nreflecting the average situation has been confirmed many times and\nnow is we11 established, Even more important, although based on\naverages, their applicability in specific cases has rarely been\nopposed, in view of the diverse conditions (e,g,, seasons, sun sppt\ncycles) taken into account in the figures on which they are based,\nwhich conditions are not reflected in a limited set of measurements,,\nEnough has been said to indicate the basis for declining to accept\nresults inconsistent with the curves unless scrupulous attention is\ngiven to employing accurate methods of measurement and to obtaining\nsufficient data upon which to base a conclusion. Under this criterion\nthe engineering evidence offered by the intervener in regard to the\nquestion of interference has been found wanting..*.The theoretical\nseparation required by the Standards for this class of operation\nis 735 miles. The actual distance here involved is 977 miles.\"\n\"If in the actual operation of KOY objectionable interference\nshould develop as to the present service area of KQkC9 the Commission\nwill enter an order requiring appropriate protection/' adds the\nCommission,\nINTERVENES IN UNYC HEARING\nThe State of Minnesota was granted petition to intervene in the\nhearing on the application of ;VNYC for modification of license to\nchange hours of operation from Daytime-WCCO to Specified Hours, on\n810 kc, (March 15-FCC)"
}