{
  "id": "d20-33",
  "text": "required. Broadcasters constantly ask what a given kind of satellite would cost\nto,, construct and operate, and what it could do. Engineers want to know\nspecifically what the broadcasters want to do and what kind of cost levels their\nsatellites are expected to meet..\nIt is therefore imperative that planners in the developing countries carefully\nconsider the conditions under which, and the purposes' for which, they could\nfeasibly use a communications satellite, and what they could afford to pay for its\nuse. m against the use of more conventional means for solving their communica¬\ntions problems. A ground television station, as an example* can effectively cover\nan area of 7.500 to 10,000 square miles, while air-borne television can extend\nthjs range to as much as 150.000 square miles. A satellite, however, is customarily\ndesigned to provide coverage of at least 1 million square miles.\nIn many developing countries, there is no need to sene an area that great and,\nif one country cannot reach a satisfactory agreement with its neighbouring\ncountries for joint use of a satellite, it might very well decide not to use a satellite\nfor communications purposes. It would also have to consider the social and\neducational desirability of a service covering a very large area, as opposed to a\nnumber of local services. Language problems would also have to be taken into\naccount. Only after considering all these factors could a country tel! the engineers\nexactly what kind of satellite it could use and at what cost.\nPoint-to-point satellites can also be used very advantageously by the developing\nnations in education. Satellites should make it possible for certain kinds of teaching\nto be carried out more effectively through television where it already exists.\nSatellites should also make it possible to set up television networks, embracing all\nexisting stations, which could carry out such projects as training teachers, which\nis extremely important in developing countries. This might be done through a\ncontinental or even world-wide radio teacher training programme, with satellites\ntransmitting either to individual receivers or group receivers. Similar programmes\nmight be organized for training specialist workers in other areas ---nurses, farmers,\nminers, etc.\nIt might also be possible to set up a network which could employ communi¬\ncations satellites to transmit to local stations is the developing countries educa¬\ntional and cultural programmes of common interest, A broad* schedule of civic\nand cultural programmes appropriate to developing countries could be devel-\noped. Such pi ©grammes could contribute to national unification, raise profes¬\nsional standards, or teach adults to read and write through group reception in\ntelevision clubs.\nIn connexion with such collective reception projects, experts have noted that,\nat present, monitors would be required to organize* the groups and encourage\nregular attendance by group members. This would also imply the use of auxiliary\nteaching materials—books and other supplies—to reinforce and point up the\nbroadcast lessons. Training of monitors could be carried out on a regional or\ncontinent-wide basis, in conjunction with the preparation of the broadcasts and\nauxiliary teaching materials.\nfhe report of the meeting of experts on the use of space communications by\nthe mass media, organized by unesco in Paris in December 1965, provides an\nexcellent summation of the technical and economic aspects of communications\nsatellites. The experts’ conclusions in this area were:\n1. The prospects for developing communication satellites for point-to-point\nservices of various kinds are excellent. ,4A11 countries, large and small,” the report\n7"
}