{
  "id": "d20-39",
  "text": "There is little doubt that satellite etv could serve a number of useful purposes\nin the developing nations. Among them are:\nL bringing the advantages of modern mass communications to areas presently\nlacking in ground telecommunications or broadcast networks;\n2. bringing modern educational techniques to regions where teaching facilities\narc either inadequate or totally lacking;\n3. promoting personal health and hygiene;\n4. providing news and information to hitherto backward or difficuH-to-reach\nareas;\n5. promoting national unity and closer cultural ties;\n6. promoting the use of a single national language in areas where multiple lan¬\nguages or dialects are in use.\nAnd how much would all of this cost? Again, it is difficult to come up with ac¬\ncurate figures, but one study of television broadcast satellites, made in 1962, esti¬\nmated that such a system, if developed for India, would cost about 20 per cent\nof the expenditures required to establish a similar ground-based system.\nAnother study, made in 1966, and based on published data, attempted to esti¬\nmate the cost of establishing satellite etv systems in several different countries. For\nIndia, the estimated total annual cost of space and ground systems was $10.4 mil¬\nlion. Using a 19/0 estimate of 89 million students, the annual cost per student as\nof that date would be $0.12. For Peru, the figures were $6.5 million, 3 million stu¬\ndents, and $2.IS per year; for Nigeria, $5.6 million, 3,5 million students, and $1.62\na year.\nAn even more interesting analysis in the same study compared 1970 educational\nstatistics in the three countries without and with a satellite etv system. In number\nof students per teacher, the figures for India, Peru and Nigeria are 34, 24 and 31,\nrespectively; with etv, the figure is 100 for each country. Annual expenditures for\neducation in the three countries are estimated as being $1,110, $680 and $63 mil¬\nlion, while the incremental cost of etv is given as $10, $7 and $6 million. This\namounts to an increase over the cost without etv of only 0.90, 1.03 and 9.5 per\ncent, respectively. Annual expenditures per student without etv are $13, $225 and\n$18; wills etv, $13, $229 and $20. The percent increase is thus 0, 2 and II.\nThese figures indicate quite dearly that the incremental cost of satellite etv is\nrelatively small when taken as part of any over-all education budget. While this\ncost would obviously be larger in some countries than in others, in no case would\nit appear to be prohibitive.\nIn view of the tremendous advantages offered by direct satellite radio and tele¬\nvision educational broadcasts over ground-based educational systems, it would ap¬\npear that participation in experiments aimed at the development of such satellite\netv systems would be of incalculable assistance to any nation in solving its educa¬\ntion problems.\nHowever, any such programme would require the services of skilled technical\nand scientific personnel, and the training and education of such personnel is obvi¬\nously of the utmost importance.\nClearly, the need for education and training will not be the same in each coun¬\ntry, nor is it possible to outline one comprehensive programme which could be\nemployed by all developing countries. In general, however, the scope of such train¬\ning can be broken down as follows:\n33"
}