{
  "id": "d20-66",
  "text": "2.\nthL^h eqf was therefore that ABU members should take action,\nthrough the appropriate organisations in their own countries, to ensure that\nthe recommendation to UNESCO made by the conference of the broadcasting\nUmons wouid be adopted by the next UNESCO General Conference, which is to\nthafurai^n NYw °°tober/November, 1968. The aim of this request was\n° would be authorised to take steps for the preparation of the new\ncopyright convention at the earliest possible date.\nHowever, I have just received a letter on this subject from the Director\naddr!^1 Affalrs.f°^ the European Broadcasting Union, Dr. Straschnov, whose\naddress on copyright was an outstanding feature of the ABU's last General\nAssembly. Copies of Dr. Straschnov's letter and of the statements he sent\nwith it are attached. It will be noted that Dr. Straschnov's point is that\nUNESCO CenerVfr°nr noVPPear t0 have been “ade for discussion at the\nUNESCO General Conference of the recommendation about the new copyright\nZ™ °V ? MaS unanimously adopted at the meeting of the broadcasting\nUnions. To make sure that this recommendation will be considered, he\n'tha't aa many broadcasting organisations as possible should request\ntheir Governments to send to the Director-General of UNESCO a letter requesting\nPensrai T°ffl° resolution on this matter should be placed before the UNESCO\niHttL / v3”1*16 letter' out the proposed resolution,\nIS attached immediately behind Dr. Straschnov's letter.\nThis-aotion wouid be line with the request to ABU members made by the ABU's\nown Administrative Council, as it would help to ensure that action will be\ntaken about the necessary copyright convention as soon as possible. It is\ntherefore hoped that ABU members will give consideration to raising this\nmatter with their Governments. It '\nhowever, necessary to emphasise the\npoint made by Dr. Straschnov that,\nof the UNESC^r “ FariS at least 10 weeks tefore the beginning\nof the UNESCO General Conference that is by the beginning of September.\nSecretary-General\n15th Jaly 1Q68"
}