{
  "id": "d20-67",
  "text": "EUROPEAN BROADCASTING UNION (E. B. U.)\nUNION EUROP6ENNE DE RADIODIFFUSION (U. E. R.)\nDEPARTMENT OF LEGAL AFFAIRS\nC«ntro Internationa!\n1t do Varomb#\nGENEVA\nRef.: GS/RT/BO\n55.38fc\nSir Charles Moses\nSecretary-General of the\nAsian Broadcasting Union\nBox 3636, G.P.O.\nSydney\nAustralia\n25th June 1968\nDear Sir Charles,\nYou attended the meeting of experts on space communications\nin Paris last January and supported the recommendation calling on\nUnesco to draw up a convention for the protection of television signals\ntransmitted via satellite* For various reasons this recommendation is\nnot included in the programme which the Director General of Unesco is\nsubmitting to the Unesco General Conference in October/November this\nyear* To remedy the omission it is essential that Governments should\nwrite to the Director General of Unesco, by the beginning of September\n(-) at the latest, on the lines of the enclosed model.\nI woujjd be extremely grateful if you would take immediate\nsteps with ABU members to suggest to them that they, in their turn,\nmight press their Governments to write to Mr, Maheu, Director Gereral\nof Unesco. To explain the need for the proposed convention, which\nwill primarily benefit developing countries, I have prepared an\n(-■—) explanatory memorandum which I also enclose and which you may wish\nto distribute to ABU members.\nI am taking the same steps with ESU members, since without\nthe support of a large number of governments the proposed convention\nwin not see the light very soon and thus, yet again, technology will\nhave developed a splendid medium of communication which, for legal\nreasons, cannot be fully exploited.\nI therefore count on your full cooperation.\nWith kind regards.\nYours sincerely,\nr Lj\nG. Straschnov\n2 Enclosures in English and French\n(022) 33 24 00\nII I I I III INI PHlJllinil 111 - TELEGRAPHIC ADDRESS: UNIRADIO GENEVA -\nPOST OFFICE BOX: 1211 GENEVA 20 MONTBRIILANT\nTELEX: 22.230"
}