{
  "id": "d20-79",
  "text": "NOTES\nAn animated, cartoon in black and white, made very simply*\nExcellent for young children up to 7 years. Music very good.\nDurations 25 minutes. Commentary in English.\nCategory II;\nnLets Draw*1 (Radio Telefis E'ireann, Ireland)\nThe programme unobtrusively induces children, with very simple means, to\noccupy themselves playfully with pencil and brush.\nThe presenter shows the children how to turn chance forms into imaginative\ndrawings simply by using their imagination.\nNOTES\nAn excellent programme for children of 12-15 years. A young\nwoman with an attractive personality and a good voice encourages\nchildren to use their imagination in drawing. Black and white.\nDuration; about 20 minutes. Programme in English.\n\"The Young Bullfighters” (U.S.S.R. Radio and TV)\nThis contribution is marked by its fascinating tempo, its gratifying humour\nand inescapable hilarity.. The film shows veritable young rascals, children,\nas they really are: natural, spontaneous, without shyness; therefore it is\nutterly different from the type of artificial and overly ingenious\nchildren's programmes so often encountered.\nThe failure of the fantastically ambitious plans of the two \"heroes\"\nprovides an unobtrusive commentary on human life.\nThe way in which the idea of the programme is combined with a perfect\ndialogue, excellent acting, exemplary photography, and superb directing\nmakes this programme the very model of an excellent children's programme.\nNOTES\nOne of the most outstanding programmes in the Prix Jeunesse.\nThe Bayerischer Rundfunk have decided to 'dub' the dialogue in\nGerman but, even with an English commentary read by the official\ninterpreter , this programme was superb entertainment - for adults\nas well as children; in fact it would have a great success\nas 'family* entertainment in any country. Filmed in black and\nwhite. Duration: 30 minutes. The English translation is very\nwell prepared.\n\"Kuro Hime\" (Nippon Hoso Kyokai, Japan)\nConforming with the tradition of Japanese culture this programme presents\na legend of high ethical value with remarkable force and artistic precision.\nThe tremendous expressiveness of the puppets, the. lyrical tenderness, the\ndramatic fights, the brilliant colours and the masterly exploitation of all\ntechnical facilities make this programme a most impressive achievement\nand an outstanding work of art.\nNOTES\nIt was difficult to separate \"Kuro Hime\" and the U.S.S.R. programme,\n\"The Young Bullfighters\". They were of equal standard: though\nvery different. This programme, presenting puppets in colour,\nwas remarkable. I have never seen puppets so lifelike. A 'must*"
}