{
  "id": "d20-80",
  "text": "3\nfor any colour TV service but would also be effective in black\nand white. Duration: 42 minutes. English sound track.\nMost adults would be fascinated with the fantastic skill of\nthe puppeteers and the overall production.\n\"The Scarecrow” (Czech Television)\nIt may be surprising that a film whose hero is a scarecrow is awarded\nthe prize for the best human-interest programme. In fact it is a cartoon\nin which no human figure appears.\nThe film whose presentation is just as suitable to a child’s power of\nperception as the simple but convincing graphic realization, treats of\na human problem in the form of a fable. In a humorous way the children\nare made aware of the fact that something old and insignificant may\nnevertheless be useful and valuable and that contrasts and apparently\nirreconcilable hostilities may, in fact, be overcome.\nNOTES\nSplendid animated cartoon film for children of 7-12 years.\nIt has no dialogue: the film itself tells the story.\nThe duration is only 7 minutes. The film is black and white.\n’’Vision On” (B.B.C., United Kingdom)\nThe programme, which forms part of a series that has met with great\ninterest, not only offers educational assistance for deaf children in an\nentertaining manner, but also successfully tries to integrate them in the\ncommunity of the not handicapped. In doing so it makes a valuable cont¬\nribution in keeping with the objectives of Unicef, to the realization of the\nright of the child to unhampered, physical, and mental development.\nNOTES\nAlthough primarily intended for deaf children this excellent\nprogramme can be seen by any children, and even adults, with\ninterest and much pleasure. There is clever and amusing use of\ncameras. Black and white. Duration: about 21 minutes.\nEnglish programme.\n;‘Marie-Christine” (Swiss Radio and TV)\nThe special UNESCO prize was awarded to the film Marie-Christine, which\ntells of the life of an 8 year old Indian girl, living in a Swiss industrial\ntown.\nWith her family and at school, at play and in her encounter with nature the\nlittle Indian girl experiences a new world confronting her with under¬\nstanding and respect.\nThe special educational value of the film, which is intended for children\nbetween the ages of 8 and 12 years lies in the fact that the native Swiss\nchildren are shown persuasively but unpretentiously why and how it is\npossible and necessary to live, learn and play together with a child from\na faroff country.\nThe programme constitutes a valuable contribution to UNESCO’s efforts to\ncreate a society in which people of the most diverse backgrounds, races and\neducational standards may develop their capacities in free co-operation\nfor the benefit of all."
}