{
  "id": "d20-89",
  "text": "The Councillors were also pleased to have had the opportunity of meeting His\nExcellency the Minister of Public Information, Mr. Hong Jong-chul, under whose\ndirection KBS operates, as well as the officers of a number of other organisations\nincluding the President and senior staff of the ABU’s associate member in the Republic\nof Korea, the Munhwa Broadcasting Corporation.\nThe Council began its meeting by reviewing the action taken by the Secretariat\nsince the 196? General Assembly on decisions made by the General Assembly and at\nprevious Council meetings. The Council was pleased to note that progress has been\nmade regarding a number of important projects. It is aware that the Secretary-General\nand his small staff have a heavy burden of work but is pleased that so much has\nbeen done in the period since the General Assembly met last October.\nAmong the more important current projects discussed by the Council were:\nRegional Broadcasting Training Institute\nFollowing a recent visit to Malaysia and a number of other Asian countries\nby UNESCO’s Assistant Director-General in charge of Communications, Mr. Tor\nGjesdal, it now seems probable that the proposed Regional Broadcasting\nTraining Institute will be established in Kuala Lumpur, where it will be embodied\nin a national training institute which is to be planned in detail in the coming\nmonths.\nAs reported at the last General Assembly, the main function of the Regional\nBroadcasting Training Institute will be to train instructors in various aspects\nof broadcasting, so that they can then return to their own countries to conduct\ntraining courses at the national level. The survey undertaken by UNESCO in 1967\nindicated that there is not only an extensive need for the training of broadcast¬\ning staff in the ABU region but that one of the most pressing problems is a\nserious shortage of trained instructors.\nDuring the coming months UNESCO will make available to Radio-Television Malaysia\nthe services of an expert in broadcasting training. UNESCO also proposes to\narrange in Kuala Lumpur next September an international seminar on broadcasting\ntraining. The advice of the UNESCO expert and the recommendations of the\nseminar will provide the basis for the planning of a national training institute,\nto be located on the same site as RTM's new radio and television buildings where\nthere will be adequate space for incorporating the projected Regional Institute.\nWhile there is still much to be done, the Council believes that all members\nwill be pleased to know that very valuable progress has been made towards\nachieving the Regional Institute which would train instructors and also\nassist broadcasting organisations in the ABU region in establishing their own\ntraining courses.\nIn the meantime several ABU members in the region are continuing to provide\ntraining for the staff of other members and assistance is also being given by\norganisations outside the ABU such as CETO and the Thomson Foundation.\nAssistance to Members in the Field of Copyright\nFollowing the decision at the last General Assembly that the European Broadcast¬\ning Union should be requested to make available the services of its Director of\nLegal Affairs, Dr. Straschnov, to prepare model copyright legislation for Asian\ncountries that would be in the interests of broadcasting organisations, detailed\nproposals have been discussed with the EBU’s officers. It is expected that the\nEBU's decision will be available before the end of this month and that, if it is\nfavourable. Dr. Straschnov will visit two Asian countries in the period between\n28 October and 9 November 1968 to assist in the preparation of legislation on\nthe spot.\n-- 2"
}