{
  "id": "d20-90",
  "text": "This legislation could then be used as models in other countries in the ABU\nregion, with appropriate adaptation on which Dr* Straschnov would be prepared\nto provide written advice.\nSpace Communication\nThe Council was very interested to receive reports on the conference of the\nregional broadcasting Unions organised by UNESCO in Paris last January to\nconsider particularly the non-technical aspects of the use of space communica¬\ntion in broadcasting. The UNESCO report on this Conference was sent to all\nABU members shortly before the Council meeting and the Council wishes to\ncommend this report to members, as it contains an account of a number of\nmatters on which action should be taken to protect the interests of broadcast¬\ning organisations.\nThe Council also received at its meeting a report from the Chairman of the\nABU Study Group on Space Communication dealing with various developments\nsince the last General Assembly, including those which had been considered at\nthe UNESCO Conference in January. Copies of this report are being sent to\nall members for their information.\nOn the basis of these reports, the Council adopted a number of important\nresolutions requesting members to take action in their own countries. These\nresolutions will be sent to members in the near future and the Council hopes\nthat members will assist by approaching the appropriate authorities in their\nown countries, as the matters concerned are important in furthering the\ninterests of all broadcasting organisations in the future.\nThey are concerned particularly with the need to speed up the allocation of\nfrequencies for space communication and to establish a copyright convention\ndealing with copyright in programmes relayed by satellites.\nLow-cost Television Receivers\nThe last General Assembly requested that steps be taken to encourage studies\nof low-cost television receivers which would be easy to operate and maintain,\nas the high cost of receivers is a deterrent to the effective use of televi¬\nsion for educational purposes in developing countries. Subsequently it was\nlearned that a Study Group of the C.C.I.R. was about to examine this matter\nas a result of a request made on behalf of developing countries in Africa.\nShortly before the Council meeting the report of the C.C.I.R. Study Group\nbecame available but it expresses the view that suitable receivers could be\noperated only in areas in which electricity is available. However, information\ngiven to the Council indicated that there are other approaches to this matter,\nresulting from recent technological developments, and the Secretary-General has\nbeen requested to make further enquiries.\nMeasurement of Signals from Distant Medium Frequency Transmitters\nThe last General Assembly requested that the Council should examine a recommenda¬\ntion made by the Engineering Committee that the ABU should undertake a survey\nof ionospheric propagation in the medium frequency band in tropical areas in\nthe ABU region. There is at present a lack of information in this field, so\nthat this survey would not only be of value to ABU members but also to broadcast¬\ning stations in tropical areas in other parts of the world.\nIt was proposed that the survey should be carried out at the Klang Monitor¬\ning Station in Malaysia but at the time of the last General Assembly it was\nnot clear whether the Malaysian Government would permit the use of the Klang\nStation for this purpose and the cost of the proposal, including the purchase\nof equipment, appeared to be more than could be met from ABU funds.\n3"
}