{
  "id": "d20-95",
  "text": "satisfactory status for discussions with their communication authorities.\nFollowing suggestions by ABU delegates that they should aim at achieving a\ndialogue at a much higher level than heretofore, the point has been reached\nthat senior broadcasting executives are now in contact with the post and telegraph\nauthorities. As a result, the E.B.U. has been served with a set of provisional\nrules which it regards as representing a considerable advance on the system\npreviously in force. The American delegates to the conference indicated firmly,\nhowever, that the rules were still unsatisfactory to broadcasters in general\nand would not be acceptable to the American networks. The meeting decided,\ntherefore, that it would not give its sanction to the provisional rules just\npublished, but would give further consideration to them. The American network\nrepresentatives will be in communication with me on the points they feel are\nessential for proper control of satellite transmissions and we hope to advance\nthis matter further at the next E.B.U. Meeting in October. It is obviously of\ngreat concern to broadcasters that an acceptable standard set of rules should be\navailable for use throughout the world.\nAdvertising Code\nAt the meeting of the E.B.U. Legal Committee in Lugano in October last, the\nrepresentative of NHK requested that consideration be given to the framing of a\ncode governing the insertion and deletion of advertising matter in satellite\nrelays. This task was undertaken by the E.B.U. Legal Bureau which presented a\ndraft code to the meeting. This was rejected out of hand by the American delegates.\nWhile it seemed to me that the code had some minor weaknesses, and should be\nexpressed more simply, it was also clear that such a code is of particular\nimportance to non-commercial broadcasters. The temper of the meeting eventually\nforced the Americans to concede that a Working Party should be set up to draft\na simpler code and this will be dealt with at the next meeting of the E.B.U.\nCommittee. Along with a representative of NHK, I was appointed to the Working\nParty.\nUNESCO MEETING\nAs our Secretary-General, Sir Charles Moses was present at this meeting with the\nGeneral Manager of the ABC, Mr. T.S. Duckmanton, it is not necessary for me to\nreport on it in detail. It is defficient to say that the E.B.U, Directorate\nconsidered that the meeting had been a signal success for broadcasters and that\nmuch of the credit for this could be given to the way in sdiich the ABU had\nprepared its delegation and supported the E.B.U. in its attitude. There was\na good deal of discussion at Istanbul on the need to follow up the advantages\nalready gained. Accordingly, I would hope that the Administrative Council\nwould adopt the following resolutions, bringing it in line with resolutions\nproposed to the Administrative Council of the E.B.U.:\n(a) recommend to member organisations that, following the UNESCO Meeting\non ”The Use of Space Communication for Broadcasting” they inform the\nnational authorities and the national UNESCO Committees of the\nimportance to broadcasters of the proposal for a universal convention\nfor the protection of television transmissions carried via satellite,\nand of the ABU position in this respect; and that they take appropriate\nsteps to insure that the national delegations to the next session of\nthe UNESCO General Conference in the autumn of 1968 support the recom¬\nmendations made by the broadcasters at this meeting."
}