{
  "id": "d1465-0",
  "text": "OFFICERS\nPRESIDENT: R. C. HIBEY, WEAO\nOHIO STATE UNIVERSITY\nCOLUMBUS, OHIO\nVice-President: CARLMENZER, WSUI\nI□ wa Dity, Iowa\nSecretary-Treasurer:\nB. B. BRACKETT, KUSD\nUNIVERSITY DF SOUTH DAKOTA\nVermillion, South Dakota\nof\nCallage, ar\\A Unis/ar^ily\n\"Bkea dealing\nEXECUTIVE COMMITTEE\nFirst Zone: DANIEL E. NOBLE, WCAC\nCONNECTICUT AGRICULTURAL COLLEGE\nStorrs, Connecticut\nSecond Zone: J. B. HASSELMAN, WKAR\nMICHIGAN STATE COLLEGE\nEast Lansing, Michigan\nThird Zone: GARLAND POWELL, WRUF\nUNIVERSITY OF FLORIDA\nGAINE5VILLE, FLORIDA\nFourth Zone: W. I. GRIFFITH, WOI\nOffice of Executive Secretary\nT. M. BEAIRD, WNAD\nSPECIAL BULLETIN\nRelease Date February 24, 1932\nFifth Zone: H. V. CARPENTER, KWSC\nSTATE COLLEGE GFWASHINQTDN\nAt Larges CHARLES A. CULVER, KFM X\n□ARLETDN COLLEGE\nNdrthfield, Minnesota\nTO MEMBERS\nof\nTHE ASSOCIATION OF COLLEGE AND UNIVERSITY BROADCASTING STATIONS\n(and a special request mailing list)\nTen days ago we released a bulletin from this office dealing with the pro¬\nposition of a statement to be made up by the various member stations and\nsubmitted to the Federal Radio Commission as well as the senators and con¬\ngressmen of the state in which the university or college station is located.\nYou will recall that this suggestion was made by Professor J. C. Jensen, Di¬\nrector of Radio Station WCAJ, Nebraska Wesleyan University, Lincoln, Nebraska,\nMr. Jensen has recently received a letter from Mr. Armstrong Perry stating in\nessence that this would be a very valuable piece of work for the Association\nto place before the Federal Radio Commission and others named.\nIt is quite necessary if statements of this type are attempted that we have\nat least a majority of the member stations of the Association agreed upon\nsending these to the parties named. Your officers personally feel that this\nmatter should be attended to immediately upon receipt of this bulletin (in\ncase your station has not already submitted the statement). You recall that\nseven main points were emphasized in the bulletin asking that the stations give\nthe Commission and others information dealing with this particular point. In\norder that you may have these points before you again and to help you in as¬\nsembling information for the statement we are again listing them as follows*\n1. Power, time and frequency used by your station April 1, 1927.\n2. Power, time and frequency first assigned by the Commission in June, 1927.\n3. Details regarding each change in power, time and frequency required since\nJune, 1927, with dates.\n4. Limitation to daylight time, giving dates and details of order and effect\nupon broadcast program.\n5. Request by the station for improvements in time, power and frequency, and\na statement of the Commissions action.\n6. Details regarding any applications now pending.\n7. A summary of hearings held before the Commission together with costs to\nthe university and outcome of the same.\nFROM MR. JOE F. WRIGHT, UNIVERSITY PUBLICITY DIRECTOR AND DIRECTOR OF STATION\nWILL, UNIVERSITY OF ILLINOIS, URBANA, we have just received the following\nletters\nMI have a letter this morning from Secretary Baldwin -which raises a point in\nmy mind that it would possibly be a good move if, in addition to the material\nit is suggested that we send to Armstrong Perry about our station and others,\nwe also include a statement as to the value of the institutions with which we"
}