{
  "id": "d1262-3",
  "text": "Educational Radio & TV Stations\nTwo out of every three students in the\nnation’s schools and colleges are in areas\ncovered by ETV programs, the USOE has\nannounced. Following is a breakdown of\nnumbers of educational stations per state—\nincluding radio as well as TV.\nThese figures were compiled basically\nfrom the 1965 revision of the USOE’s list¬\ning of “Educational AM and FM Radio\nand Educational Television Stations by\nState and City.” However, the USOE in¬\ncludes commercial stations that are educa¬\ntionally owned and operated; it does not in¬\nclude noncommercial stations operated by\nprimarily religious institutions. The figures\nin the table were obtained by subtracting\nthe commercial stations from the USOE\nlist and bringing it up to date as of No¬\nvember 1, 1965.\nAlabama\nAlaska\nArizona\nArkansas\nCalifornia\nColorado\nConnecticut\nDelaware\nDistrict of Columbia\nFlorida\nGeorgia\nHawaii\nIdaho\nIllinois\nIndiana\nIowa\nKansas\nKentucky\nLouisiana\nMaine\nMaryland\nMassachusetts\nMichigan\nMinnesota\nMissouri\nMontana\nNebraska\nNevada\nNew Hampshire\nNew Jersey\nNew Mexico\nNew York\nNorth Carolina\nNorth Dakota\nOhio\nOklahoma\nOregon\nPennsylvania\nRhode Island\nSouth Carolina\nSouth Dakota\nTennessee\nTexas\nUtah\nVirginia\nWashington\nWest Virginia\nWisconsin\nPuerto Rico\nTOTAL\nAM FM TV\nI 5\nI\nI 2\n1\n25 7\n3 I\n5 I\nI\n2 I\nI 5 7\nI 5\n1\n2 I\nI 16 4\n1 22\n3 8 I\n2 6 I\n5 I\nI I\n3 4\n2\n13 I\n1 14 3\n2 2 3\n6 2\nI\n3\n1\n2 I\n6\n2 I\n2 23 4\n6 3\n1 I\n2 218\n4 3\n2 5 2\nI II 6\n1\n2 2\nI I\n4 2\nI 9 5\n3 5\n5 2\n1 6 5\nI\n2 13 3\nI I 2\n26 272 III\nPLACEMENT\nPOSITIONS AVAILABLE\n(For information, write Miss Yasmine Mirza, Placement Service, at\nthe NAEB in Washington. In order to be considered through these\nchannels, the reader must be an Individual Member of the NAEB,\nwith credentials on file with the NAEB Placement Service. Non-mem¬\nbers can save time by sending the $10 annual dues and $10 Place¬\nment registration fee at the time of inquiry.)\nDec I Instructor to teach fundamentals of speech and to direct technical aspects\nof theatre, concerts, and artist series programs in new theatre-concert hall.\nJunior college on west coast of Florida. Position open August.\nDec 2 Western university seeks Ph.D. or Ed.D. in education or mass communications\nto be associate director of instructional communications bureau, with major\nresponsibility for radio-TV, and to develop professional training program in\nradio-TV. Some teaching. Academic rank commensurate with degree and ex¬\nperience. University has closed-circuit, plans activation of ETV and FM sta¬\ntions; state-wide plan for ETV under development. Experience with ETV re¬\nquired, and previous university work desired. Salary $10,000-$12,500 depending\nupon qualifications.\nDec 3 TV writer wanted to write scripts for effective ETV programs. Big Ten univer¬\nsity with VHF operating for more than ten years. Salary open.\nDec 4 Big Ten university ETV station seeks creative, experienced producer-director\ncapable of major project work. B.A. required. Ability to read music desirable.\nOnly experienced applicants considered. Salary commensurate with experience.\nDec 5 Assistant professorship beginning at $7,500 up depending on qualifications to\nteach radio-TV broadcasting in eastern university and also manage carrier-\ncurrent station and plan for future FM radio station. M.A. desired with ex¬\nperience in broadcasting. Position open February.\nDec 6 Immediate opening for chief engineer in large midwestern university. Position\ncarries responsibilities of supervision of staff of three radio-TV engineers in all\ntechnical aspects of broadcast and closed-circuit operations; also supervision\nof maintenance of non-broadcasting electronic equipment. Must be capable of\nhandling all technical data for FCC applications, preparing specifications for\nequipment purchases, and designing radio and television installations for both\nbroadcast and campus instructional purposes. Should have administrative as\nwell as technical competency. Salary $9,500 annually with one-month vacation.\nThis university is an equal opportunity employer and as such will give con¬\nsideration for employment without regard to race, color, creed, religion, or\nnational origin.\nDec 7 Large midwestern university needs producer-director fully qualified to take\nover existing production chore. This position is a replacement for an opening\nin December. Would prefer a person able to move immediately. Must have\na minimum of B.A. This university is also looking for producer-director or\nproducer-talent capable of assuming full production responsibilities plus as¬\nsuming on-air roles.\nDec 8 Large midwestern university needs someone with professional and academic\nbackground (Ph.D. or close) to serve as academic coordinator. This posi¬\ntion entails revision and evaluation of the radio-TV academic program—\ncoordination of that program with other university departments in the school\nof communications. Assignments of faculty to teaching subjects and direction\nof student advisement program. Salary open.\nDec 9 State university in the Midwest needs producer-director, full or half-time for\nclosed-circuit TV operation. Responsible for producing and directing tele¬\ncourses, promotional tapes, and instructional programs. Some experience with\n8mm and 16mm film production and knowledge of audio-visual materials\nhelpful. Excellent opportunity to work full or part-time toward Ph.Di. Excep¬\ntional M.A. candidates will be considered. Position will carry academic rank\nof assistant instructor in speech. Available June I, or September I, 1966.\nDec 10 State university in the Midwest needs production assistant, half-time. Will\nassist producer in CCTV operation with preparation of instructional programs\nand supervision of undergraduate student crews. Experience and knowledge of\nset construction important. Some experience with film production and pho¬\ntography helpful. B.A. degree required. Opportunity to work full-time toward\nM.A. or Ph.D. Available June I, or Sept. I, 1966.\nDec 11 State university in the Midwest needs assistant instructor, half-time, with a\npossibility for full-time after the first year. Will teach beginning courses in\nbroadcasting and assist in upper division laboratory courses. Ideal position\nfor the graduate student who wants to work full-time on a doctorate. M.A.\nand good academic record required. Available September I, 1966.\nEngineers, teachers, technicians, principals needed for NAEB's ETV setup in Samoa.\nBroadcast engineers and technicians for studio and transmitter operation and main¬\ntenance. Elementary teachers and principals, experienced in using TV in the classroom.\nGood living conditions and adequate family housing on lovely South Pacific island.\nOpportunity to participate in new educational development. For interview, write: Re¬\nsearch and Development Office, NAEB, 1346 Connecticut Avenue, N.W., Washington,\nD.C. 20036.\n4\nNEWSLETTER"
}