{
  "id": "d206-11",
  "text": "-2-\nNETRC’s supporting activities normally will result fern its regular services\nto stations on the air and about to Gome on the air, and specifically through\nits efforts toward Station Activation, as in Item II above.\nIV.- DEVELOPMENT QP,_NON~BROADCAST U^BS.,0F^RADIOJ^NE^ELE^S^N.\nIN EDUCATION\nNAEB will assume responsibility for all services to closed circuit television\nusers, with the exception of furnishing actual program materials supplied by\nNETRC. NAEB also will maintain close relations with those in audio-visual\nand teaching device development so that educational broadcasters generally\nmay be kept aware of important developments in these related fields.\nV. INFORMATION SERVICES\nNAEB will be responsible for collection and publication of research findings\nand will endeavor to establish a national clearing house and referral center\nfor all those requiring data on any aspect of the use of radio and television\nin education. NAEB also will continue to publish a weekly Washington Report,\na monthly Fact sheet (similar to that previously Issued by JGET), and its\nregular professional Newsletter and scholarly Journal. It will also maintain\na directory of educational radio stations.\nNETRC will publish the Directory of Educational Television Stations (formerly\nissued annually by JGET ) and will maintain its present publications. NET News,\nInside Channels, and NET Annual Reports together with such other special\nreports or publications as may be necessary to interpret activities of NETRC\nand affiliated stations to each other, to the\\ field/ and to the general public,\nNAEB and NETRC will attempt to coordinate their publications in order to\navoid duplication and to service adequately all those engaged in or interested\nin educational radio and television.\nVI. INTERNATIONAL EDUCATIONAL BROADCASTING\nNAEB will have primary responsibility tor international exchange of consultants,\noverseas visits by educational broadcasters, and all international affairs not\ndirectly concerned with broadcast programs and the planning, production, dis~\ntrtbution, and transmission thereof.\nNETRC, on the other hand, will have the primary responsibility for international\naffairs which are directly concerned with broadcast programs and the planning,\nproduction, distribution, and transmission thereof."
}