{
  "id": "d206-14",
  "text": "page 2\ndramatically step in on the side of WHYY-TV — thus further illustrating\nNAEB's weakness and indecision — can now only be painfully reassessed with\nthe hope that it might awake the organization to sharpen its thinking and its\naction on behalf of aU its membership *\nI have also received a letter from Bill (apparently written about as soon as he got\nto Bermuda - which is a heck of a way to start a vacation) requesting that two more\nadditions be made to the minutes. These would be as indicated below:\nOn page 9, immediately preceding the heading “Channel 12 Matter*', insert the\nfollowing: “Miles said that he agreed with everything Harley had said, with one\nexception; namely, that the seminar should be concerned with the future of NAEB.\nHe believes it should be about the future of educational broadcasting and, secondarily,\nhow NAEB can help to successfully shape that future. He cited the two Allerton House\nconferences on educational broadcasting as examples of the proper focus**.\nAlso, at the very end of the minutes, the following would be added: *‘ Various members\nof the Board raised questions about wording of the letter of agreement and Hurlbert\nmoved that, rather than try to decide on precise wording at this time, that each Board\nmember turn in his edited or ammaided version by a deadline to be set by the President\n(April 10). These changes will then be incorporated into a second draft to be submitted\nto the Board for final action at Columbus.\n“Harley indicated that, in the interim, NAEB would continue to work informally with\nthe Center along the lines suggested in the agreement. So far, he said, this has been\ngoing well and he cited the Center's scrupulous regard for NAEB's leadership role\nin the Magnuson Bill hearings as an example. The Center has let us call all the signals\nand has provided help instantly when asked**.\nAnd that's it, gentlemen. 1*11 appreciate your considering these insertions as you\nexamine the minutes.\nCordially,\nHEE:jph\nHarold E. Hill\nAdministrative Vice President"
}