{
  "id": "d206-20",
  "text": "VI. INTERNATIONAL EDUCATIONAL BROADCASTING\nNAEB will have primary responsibility for International exchange of consultants,\noverseas visits by educational broadcasters, end all international affairs not\ndirectly concerned with broadcast programs and the planning, production, distri¬\nbution, and transmission thereof.\nNETRC, onithe other hand, will have the primary responsibility for International\naffairs which are directly concerned with broadcast programs and the planning,\nproduction, distribution, and transmission thereof.\nVII. mgOmNg MMPES\nAs the recognized professional and trade organizations in educational broadcasting,\nNAEB has the primary responsibility in the entire area of professional services\nand will be looked to for the continuation and - hopefully - the expansion of\nsuch necessary activities as:\nPlacement service\nIn-service training\nInternships\nManagement training fellowships\nLabor-management consultation service\nInternational exchange fellowships\nLiaison with teachers of radio and television\nLiaison with teacher training institutions in better utilization\nof radio and TV in education.\nIn special instances, limited workshop or conference sessions related to specific\nnetwork operations may be conducted by NETRC exclusively for staff members of\naffiliated stations. In such special cases, - NETRC will advise NAEB of its plans\nso that all training activities in the field may be properly coordinated.\nVIH. CIX>?*» RELATIONSHIP ORGANIZATIONALLY\nIn addition to the close cooperation and mutual understanding which has been evident\non the part of all NAEB and NETRC officers and staff immediately involved in the present\ndiscussions and which gives excellent promise of smooth working relationships In the\nfuture, two specific procedural suggestions have been made.\n(1) NETRC intends to Invite the President of NAEB to be a guest at all regular\nAffiliates Meetings, and also to be in attendance at all meetings of the NETRC Affiliates\nCommittee called by the Center.\n(2) NAEB is exploring the possibility of allowing some similar Center representation\nNAEB board meetings."
}