{
  "id": "d206-35",
  "text": "1. Liaison with government\nEducational broadcasters * concerns with governiiaBnt\nare directed to two different types of bodies: legislative\nbodies (Congress and its committees, state legislatures, etc.)\nand a&alnlstratlve and regulatory bodies (FSC, CAA, Internal\nBevermeBureai'^ ~X&9 NAEB, and WBBXSC roust all par¬\nticipate in the formulation of major presentations to any\narm of government. As has been indicated, both 11 and HETRC\nwill expect to alert JCIB to matters of major importance\nwhere a determination of educational policy is required,\nwill share in decisions regarding strategy, and will under¬\ntake cooperatively to implement such policies and positions\nas may be established.\nIn addition to these major matters, however, there\nis an endless variety of day-to-day activities requiring\nheavy staff work and many contacts with government merely in\nthe transaction of normal business. All three agencies are\ndesirous of avoiding confusion In the minds of government\npersonnel, unnecessary duplication of efforts, or possibly\nunintentional neglect of opportunities to represent the\ninterests of educational broadcasting.\nTherefore, it Is proposed and agreed that It&EB\nwill undertake primarily responsibility for day-to-day\nliaison with legislative bodies, and ^THTHC will undertake # F\npriraaryiresponsIBIliVy for day-to-day liaison with adminis¬\ntrative and regulatory bodies. The organization hol&lr*;\n^primary reapcnsIHlIty” for such liaison will be expected\nto take leadership and to maintain initiative in its designated\narea, but will also be expected to call upon the resources\nof the other two agencies to assist and augment Its efforts\nas necessary. Moreover, any organization shall be free to\nmake an independent representation to government If so\ncompelled, but should at least inform other organizations\nof its Intention before doing so.\nIt is felt that this plan takes best advantage of\nthe previous experience, current contacts, present resources,\nand availability of staff personnel of both ?SAEB and KHTRC.\nFurthermore, legislative deliberations are of concern to all\npersons in the fid d of educational broadcasting (served by\nHAEB), while regulatory actions are of importance mainly to\nstations (served by NfFTEC)»\n2. Engineering and legal consulting services\nTo the extent that NAEB maintains liaison with\ngovernmental legislative bodies, it will employ its own"
}