{
  "id": "d206-41",
  "text": "PROPOSAL FOR JCET FUNCTIONS DISTRIBUTION\nAt a meeting of the JCET Board, January 3, 1961,\nplans were made for a possible modification of the JCET\nin which its staff functions would be assumed by the two\noperating agencies in the field, NAEB and NETRC. The\npresidents of these organizations were directed to submit\na proposal for a cooperative re-allocation of the JCET\nstaff functions.\nGENERAL PLAN\nThe Council will continue as a policy-determining\ngroup representing the educational community in matters\nrelating to ETV.\nThe staff function - legal, engineering, informational\nservices - would be assumed cooperatively by the Washington\noffices of the NAEB - NETRC and the product of this work\nmade available to the Council as the basis for its policy\nformulation.\nExpression of such policies would be made by the Chair¬\nman of JCET who, in appearances before the FCC or Congression¬\nal Committees, would bespeak the united voice of the con¬\nstituent members. Any member, however, would be free to make\nan independent appearance at such hearings even though ex¬\npressing a divergent view.\nSERVICES\nFollowing are the major areas of JCET activity for\nwhich NAEB-NETRC will undertake the continuing and expand¬\ned responsibility. In general, the allocation is made in\naccordance with recognition of the NAEB as the Professional\nand Trade Association for ETV and NETRC as its network.\nNAEB has responsibility for a broad representation including\nstations, closed-circuit installations, production agencies,\norganizations interested in general development of educational\nbroadcasting, as well as individuals working professionally\nin the field. NETRC has as its primary responsibility the\nprovision of services for its affiliated stations and for\nthe development of the educational television broadcasting\nmovement.\n1. Legal Services\nThis area concerns coordination of efforts on behalf\nof education before the FCC and committees of Congress and\nprovision of supporting materials and testimony, defense of\nreserved channels, and assistance to those working to acti¬\nvate channels for ETV. These services also include assist¬\nance in the solution of rights problems and representation\non education's behalf at national and international confer¬\nences involving legal matters affecting educational broad¬\ncasting. NAEB services would fall into these categories:"
}