{
  "id": "d206-44",
  "text": "-4-\n(NETRC engineering services will be concerned with: asistance\nin activating stations, representation for network problems,\nassistance to network members and stations under construction\nwhich will be network members, assistance in development in\ncooperation with NAEB of Center positions on national issues.)\n3. Information Services\nOne of the greatest needs in the field of educational\nradio and television is for adequate access to present know¬\nledge and current developments. There is an ever expanding\ndemand for information concerning educational broadcasting by\nscholars, research specialists, and station operators, as well\nas foreign nations seeking to use these electronic media for\ntheir national welfare.\nNAEB will carry on the following activities in the\ncollection and dissemination of information and research\nfindings in the field of educational broadcasting:\na. Collect research findings in educational radio and\ntelevision.\nb. Publish a monthly compilation of digests of recent\nresearch findings in the field.\nc. Publish an annual catalog summarizing the research\naccomplished in the year and indicating where the reports\nmay be obtained.\nd. Publish a weekly Washington report on current develop¬\nments in the nation's capital affecting the broadcasting\nindustry and especially its educational aspects.\ne. Publish the monthly Factsheet and Directory of ETV\nStations, formerly issued by JCET.\nf. Continue to publish a monthly Newsletter and pro¬\nfessional journal containing scholarly articles about\neducational broadcasting.\ng. Serve as a clearing house for educational broadcasting\ninformation and as a referral center for use of federal\nagencies, scholars, institutions, or foreign countries.\nh. Provide a library facility for use of scholars and\ncommunication research specialists.\ni. Develop, in cooperation with an institution of higher\nlearning in Washington or with the Library of Congress,\nthe nation's foremost deposit library for books, pamphlets,\nreports, documents, and other materials relating to educa¬\ntional broadcasting."
}