{
  "id": "d206-46",
  "text": "-6-\n(NETRC has a major concern in station activation and will\nutilize its legal, engineering, informational and other\nservices and resources in active participation in station\nand NET development. This includes stimulation of interest\nand use by educational and community agencies of ETV, visita¬\ntions to areas seeking to activate channels, advise on community\norganization and fund-raising, and other support activities\nrelated to expansion of the ETV Network.)\n5. Supporting Services\nIn addition to the primary services listed in the fore¬\ngoing, the NAEB and NETRC currently perform many services\nwhich provide valuable support and supplementation.\nAmong those supplied to its membership by NAEB are:\na. Placement Service: To help educational stations\nlocate tne best qualified staff, the NAEB operates a\nPlacement Service, maintaining a file of qualified\npersons seeking employment in the educational broad¬\ncasting field. This file includes personnel in program¬\nming, engineering, management, and all phases of broad¬\ncasting. This service is particularly beneficial in\nsupport of the activation service by assisting new\nstations to more quickly and efficiently employ quali¬\nfied persons.\nb. In-service Training: Provides in-service training\nto personnel employed by educational stations through\nthe conduct of workshops and seminars. During the past\nnine years, it has conducted some 35-40 such training\nsessions — ranging from seminars for writers of in¬\nschool programs, through production, staging and lighting,\nand utilization, to workshops dealing with video recording\ntechniques.\nIn addition, the NAEB has provided nearly 100 scholar¬\nships to permit broadcasters to increse their professional\ncapabilities through attendance at summer sessions or\nseminars offered by universities. Plans are being developed\nfor a management training program which will provide\nfor two annual apprentice fellowships at ETV stations.\nSuch in-service training, combined with the Placement\nService, results in better qualified men and women to\nhelp man the new stations.\nc. Management Consultation Services: The NAEB currently\nretains a consultant in the field of labor-management\nrelations to assist stations with any problems they may"
}