{
  "id": "d206-48",
  "text": "Joint Council on Educational Broadcasting\n1785 Massachusetts Avenue, N.W.\nWashington 6, D.C.\nTel: Hudson 3-6620\nFOR IMMEDIATE RELEASE\nJOINT COUNCIL ON EDUCATIONAL BROADCASTING FORMED\nAt its meeting on February 2, 1961 the members of the Joint Council\non Educational Television agreed to change the name of the organization\nto the Joint Council on Educational Broadcasting, in order to reflect the\nCouncil's broadened interest in the educational use of both radio and\ntelevision*\nThe following organizations were named members of the newly\nconstituted JCEB:\nAmerican Association of School Administrators\nAmerican Association of Land-Grant Colleges and\nState Universities\nAmerican Council on Education\nCouncil of Chief State School Officers\nNational Association of Educational Broadcasters\nNational Education Association of the United States\nNational Educational Television and Radio Center\nState Universities Association\nThe Chairman of the JCEB, Lawrence E. Dennis, Vice President of The\nPennsylvania State University, announced that David C. Stewart, who has\nbeen associated with the JCET for the past six years, has been appointed\nSecretary of the new organization. The Joint Council on Educational\nBroadcasting will retain the Washington law firm of Krieger and Jorgensen.\nStewart and Cyril M. Braum (formerly Engineering Consultant to the\nJCET) have joined the staff of a newly established Washington office of\nthe National Educational Television and Radio Center as Director and\nEngineering Consultant respectively.\nIn announcing the Council's actions, Chairman Dennis pointed out\nthat the constituent organizations had approved in principle the primary\nrole of the Council which is to maintain leadership in the formation and\nenunciation of important educational policy decisions having a bearing\nupon educational radio and television broadcasting. \"In discharging\nthese responsibilities,\" Mr. Dennis stated, \"the present organization will\nbuild upon the extensive experience of its predecessor organization, the\nJoint Council on Educational Television, and will continue to provide the\nchief forum for discussion and policy formation on national issues\naffecting all aspects of educational broadcasting.\"\n2/7/61"
}