{
  "id": "d206-56",
  "text": "NATIONAL EDUCATIONAL TELEVISION AND RADIO CENTER\n1785 Massachusetts Avenue, N.W.\nWashington 6, D. C.\nTelephones HUdson 3-6367\nWe are glad to know of your interest in educational television\nand to send available material in response to your request.\nThe Joint Council on Educational Television (JCET) has been\nchanged to the Joint Council on Educational Broadcasting (JCEB), as\ndescribed by an enclosed news release, and the service functions\npreviously furnished by the JCET are now being provided by the\nNational Association of Educational Broadcasters (NAEB) and the\nNational Educational Television and Radio Center. The Educational\nTelevision Factsheet previously published by the JCET has been dis¬\ncontinued, and the NAEB plans to publish a similar newsletter. The\nNAEB also has additional material available concerning educational\ntelevision, and your inquiry has been forwarded to their office,\n13U6 Connecticut Avenue, N.W., Washington 6, D. C., for further\nattention.\nThe National Educational Television and Radio Center,\n10 Columbus Circle, New York 19, New York, is the network headquarters\nfor more than £0 affiliated noncommercial educational television sta¬\ntions across the country. Its primary function is to provide national\nprogram service to these affiliates. It also furnishes them with\nconsulting service on all phases of ETV station operation. To report\non ETV developments, it publishes NET NEWS, a quarterly. Requests\nfor information about programs and station affiliation, for copies of\nNET NEWS, and for inclusion on the mailing list should be sent to\nthat office.\nThe Washington office of the Center, in coordination with the\nmain office in New York, is concerned with the reservation of channels\nand the activation of ETV stations. It furnishes legal, engineering\nand other advice to those planning ETV stations, including matters\nconcerning FCC applications and procedure. It serves as a source of\ninformation on channel allocations and government regulations. Should\nyou wish information about any of these matters, we would be pleased\nto be of assistance."
}