{
  "id": "d1317-2",
  "text": "check in on the business phone in the booth. “Good\nold days? Phooey.”\n—N A E B—\nTV TECHNICAL TIPS (November)\nOn September 19, the FCC amended Part 3 of its\nRules and Regulations to permit remote control op¬\neration of AM and FM transmitters (Docket 11677)\nincluding non-commercial educational FM stations.\nAll stations may be operated remote control regardless\nof power or whether directional or not. Since 1953,\nthe FCC has permitted remote control operation for\nAM and FM stations using not more than lOkw and\nomnidirectional antennas. The Commission has not\nchanged the rule requiring a first class operator to be\nin charge of stations operating with a power in excess\nof lOkw and with directional antennas. Applications\nfor remote control will be considered on a case to case\nbasis and the applicant will be required to show that\ntransmitters and directional antenna systems are\nstable and in proper adjustment. Information sub¬\nmitted on stability will be obtained from an analysis\nof operating logs over a one year period and must in¬\nclude an outline of the maintenance practice of the\nstation and the policy to be followed after remote con¬\ntrol authorization.\n*****\nOn October 2, the FCC adopted Docket 11896\nwhich deletes section 3.182 (c) and the first sentence\nof footnote 1 to the table contained in section 3.182\n(v) of the rules. These sections, commonly called the\n“unique service” rules, provided that when it is shown\nthat primary service is provided by any station be¬\nyond its normally protected contour, and primary\nservice to approximately 90% of the population of the\narea, between the normally protected contour and the\ncontour to which the station serves, is not supplied by\nany other station or stations carrying the same gen¬\neral program service, the contour to which protection\nmay be afforded will be determined on the facts in\n.each case.\nComments opposing this action were filed’ by\nWBAA, WILL, KOAC, KWSC, WOI and NAEB,\nstressing the importance of protecting the program\nservice rendered by educational radio stations beyond\nthese station’s normally protected contours and sug¬\ngesting that if any action is called for the rules should\nnot be abolished but should merely be clarified.\nIn deleting the rules the FCC stated that present\nprovisions were too vague and indefinite to be of as¬\nsistance in filing and processing of applications for\nnew and improved standard broadcast facilities, that\nthere was no satisfactory criteria for determining\nwhat constitutes the “same general program service”\nand that the “unique service” rule is an unsatisfactory\nallocation tool and should be dispensed with. The\nFCC also believes this amendment will encourage the\nestablishment of more uniform, fixed allocation rules,\nthereby fostering a more effective AM broadcast ser¬\nvice throughout the country.\n*****\nThe August 1957 edition of RCA Broadcast News\ncontains an eight page article on the State University\nof Iowa television studio. The article features the use\nof the studio as a Teaching Center for the Iowa\nClosed Circuit Television Teaching Experiment. It\nis well illustrated and details the equipment used and\nshows cut-away views of the TV facilities. It might\nbe helpful to our readers who are planning television\nfacilities.\n*****\nThe Richmond Area University Center, Inc. Ellen\nGlasgow House, One West Main St., Richmond 20,\nVirginia is interested in purchasing a used 1 KW FM\namplifier or transmitter for use at WRFK-FM. If\nyou have this equipment for sale please contact Mr.\nPaul K. Keim at the above address.\n*****\nVorce C. McIntosh has been appointed Chief\nEngineer, University TV and Radio, at the University\nof New Mexico, Albuquerque. He formerly was em¬\nployed as an engineer at WTTW.\n—N A E B—\nGE is featuring John Cullen, Chief Engineer of\nKRMA-TV Denver, in its camera tube advertising\nin the trade press.\n—N A E B—\nTV TECHNICAL TIPS (December)\nEngineers at the University of Illinois have been busy\nthis past month trying to beat the arrival of Old Man\nWinter. They’ve been making field strength mea¬\nsurements of both WILL-TV and WILL-FM. Their\nmeasurement method is patterned after TASO tech¬\nniques which call for a 100-foot mobile run every two\nDECEMBER 1957\n3"
}