{
  "id": "d1534-0",
  "text": "N A £ 9 N £ IV S LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nFrank £. Schooley, Editor, Station WILL, Urbana, III*\nAugust I, 1943\nSEND IN YOUR UNI LEVEL QUESTIONNAIRE PRONTO!!\nMike Hanna, WHCU, Chairman of the Joint AER-NAEB Committee to study the\nEXTENT ANO EFFECTIVENESS OF UNIVERSITY LEVEL BROADCASTING SAYS THE\nINFORMATION ON HAND IS NOV,’ BEING COMPILED AND ANALYZED*\nFurthermore, he says a number of NAEB stations haven*? responded to the\nQUESTIONNAIRE. THAT SHOULDN'T BE THE C A E» So IF YOU HAVEN * T SENT IN\nTHE DOPE ON YOUR OWN PROGRAMS, V’H V NOT 00 IT NOW. , 0 IT NOW BEFORE YOU\ndelay action again* What is that old adage about never putting off to\nTOMORROW.—‘‘STOP ScHOOLEY, I ’ LL SEND MINE IN PRONTO.\"\nWNAD PKOCRA;.. ,;£R I IS ATTSLTI C«\\\nA recent issue of TIME MAGAZINE carried an article on the “Indians for\nIndians Hour” program broadcast by University radio station WNAD. The\nPROGRAM, HEADED BY Don WHISTLER, NORMAN, HAS ALSO RECEIVED NATIONAL\nPUBLICITY IN VARIETY MAGAZI ME, TUNE IN radio JOURNAL AND THE OMAHA\nWORLD-TELEGRAM.\nVirginia Hawk, WNAD director, has received a request from the Congressional\nLibrary in Washington, D* Ca, for recordings of the program for their\nfiles, ano the Columbia Broadcasting System has asked permission to\ninclude it in the School of the Air series to be broadcast next fall.\n“Indians for Indian Hour\" may be heard on WNAD (640 kilocycles) from\n1:00 to 1:30 on Tuesday*\nWNYC WINS “SPECIAL Al AQ» BILLBOARD POLL\nWNYC, New York City’s Municipal Station won a \"Special Award for out¬\nstanding PUBLIC SERVICE\" ACCOrDING TO SELECTIONS OF THE AWARDS COMMITTEE\nCONSISTING OF JOHN Ka HUTCHENS, RADIO EDITOR OF THE Ne’ YORK TtMES,\nHarriet Van Horne, radio editor of the World-Telegram, 8en Gross, radio\neditor of the New V'ork Daily News, Leonaro Tf.aube, editor of Billboard,\nin Billboard Magazine’s Sixth Annual Radio Fusl.icitv Exhibit Survey*\nThe statement of the Committee in granting WNYC this special recognition\nreads in part,*,* *“The City outlet, being non-commercial, tackles\nPUBLICITY TO ROUND OUT ITS PUBLIC SERVICE IMPRINT WHERE THE STANDARD\nSTATION SHOOTS FOR SPACE BECAUSE IT MEANS DOLLARS AND CENTS, News ABOUT\nRATIONING, SELECTIVE SERVICE, OCD AND CONSUMER ACTIVITIES ARE STANDARD\nWITH WNYC. In ADDITION, THEY DO A WHOPPING JOB ON THE CULTURAL SIDE*\nTypical of the latter ”as its annual festival of American music.1 The\nSTATEMENT WENT ON TO ADD THAT 11 I T (WNYC) OPERATES ON A SHOESTRING, THE\nPOLITICAL ’OUTS9 GUN FOR IT EVERY YEAR, YET DESPITE EVERY HANDICAP IT\nPRODUCES PROGRAM SCHEDULES THAT ARE STRICTLY IN THE BIG GUN CLASS.\""
}