{
  "id": "d1534-1",
  "text": "join in the discussions and good fellowship. Seminar\nmanagement was in the capable hands of Harold Hill,\nwith the able assistance of Ned Rosenheim, Richard\nVogl, and Lee Dreyfus, who served as discussion and\ngroup leaders.\n(Due to deadline difficulties, this story had to be\nwritten before the Seminar took place but we knew\nit would be a success anyway.)\nIERT CONVENTION\n“Great Issues in Broadcasting 1957 will be the theme\nof IERT at Ohio State University, May 8, in Colum¬\nbus at the Deshler-Hilton Hotel.\nPreliminary program for the 1957 meet calls for\n4 general sessions, 15 clinics on specialized areas of\nbroadcasting, a dinner meeting, and a joint session\nwith the American Council for Better Broadcasts.\nKick-off is scheduled for 8 p.m. May 8, when\nDonald M. McGannon, president of the Westinghouse\nBroadcasting Co., Inc., will speak on “The Respon¬\nsibility of Broadcasters.”\nIn the same general session Joseph Csida of\nCsida-Greene Associates, will discuss “What Hap¬\npened to Broadcasting, 1946-56.” He is a contribut¬\ning editor to Sponsor Magazine and former editor-in-\nchief of Billboard.\nKenneth G. Bartlett, vice president of Syracuse\nUniversity and director of its Radio and IV Center,\nwill serve as Institute discussion leader.\nTopics of other general sessions are “The Broad¬\ncaster and the Audience,” “Radio in a TV Age,”\nand “International Broadcasting in a Cold War.”\nThe closing event will be a discussion-demonstration\nsession.\nDirected by Dr. I. Keith Tyler, the Institute\neach year attracts some 600 to 800 broadcasters,\neducators, civic leaders and key persons from na¬\ntional organizations throughout the U.S. and Canada.\nThe American Council for Better Broadcasts will\nhold its convention May 11 at the Deshler-Hilton\nin Columbus—immediately following the IERT.\nAll Institute members are invited to stay and partici¬\npate.\n—NAEB—\nA Symposium in Color TV will be offered by the\nNorthwestern University School of Speech during the\n1957 Summer Session. It will be presented in co¬\noperation with NBC and Chicago’s WNBQ, the na¬\ntion’s first all-color TV station. Dates have been set\nfor June 24-August 3. For further information write:\nJames H. McBurney, Dean, School of Speech, North¬\nwestern University, Evanston, Illinois.\nMEMOS FROM THE EXECUTIVE DIRECTOR\n—Harry Skornia\nGENERAL REPORT\nIn order to get this issue distributed in time for the\nInstitute, it is having to be published early. To\nspeed up delivery, we are also sending it first class.\nAs a result of this early deadline, however, there\nis less to report than usual. The Radio Programming\nSeminar at Allerton Park has not been held, as this\nis written. A TV Management-Operations Financial\nProblems Seminar will soon be announced; but the\nPlanning Committee to select dates, consultants, and\nwork out details, has not yet had an opportunity to\nmeet, following approval (just received) of funds for\nthis purpose.\nThe fine “Utilization Day” program for the IERT,\nas planned by Gale Adkins and his committee, will\nbe found elsewhere in this issue. We hope that\nNAEB and former AERT members will be able to\nattend both NAEB luncheons at the IERT, and the\nother fine programs arranged.\nWe are on the threshold of conferences with offi¬\ncials of the Kellogg and Ford Foundations. It is\npossible that these conferences will take some of us\naway early from the IERT, but we feel they are\nimportant enough so you will all understand in case\nwe can’t be found after Thursday.\nWe have had recent conferences with the BBC\nAssistant Controller of the Overseas Service, Oliver\nWhitley, who spent the week-end of April 14-15 with\nus at Urbana. The results of that conference must\nawait discussions in London, following his reporting\nback on various suggestions we passed on for consid¬\neration.\nThe previous week we entertained Richard\nErstein, of the Voice of America, who was here for\nconferences on plans for the future. These plans,\ntoo, will take time to develop.\nWe are gratified and pleased at the increasing\nsupport developing nationally for ETV, and for re¬\ncent evidence of a strong resurgence of FM. New\nFM educational stations, as well as ETV stations,\nare going on the air virtually every month.\nWe are exceptionally happy about the increasing¬\nly fine quality of programs available to U.S. educa¬\ntional stations, both radio and TV, and the national\nand international recognition they are winning each\nyear. We hope to bring out a special report on this\nlater, and believe that a number of NAEB stations\nnot now taking the Radio Network service are over¬\nlooking a strong means of promoting educational\nbroadcasting as well as a source of increasingly fine\nprogramming, under joint ETRC-NAEB efforts to\nprovide stepped-up support for educational radio\n2\nNEWSLETTER"
}