{
  "id": "d1534-3",
  "text": "CONVENTION COMMITTEE ANNOUNCED\nThe Convention Planning Committee is hard at\nwork on next fall’s NAEB Convention. Margu¬\nerite Fleming, chairman, asks that all members\nforward their ideas or suggestions to her, or a\ncommittee-member near them. The committee\nmembership is: Gale Adkins, George Arms, Has¬\nkell Boyter, R. Edwin Browne, Edward Dumit,\nRichard Hull, Dorothy Klock, Jack McBride,\nHarold McCarty, Leo Martin, Allen Miller, Hugh\nMix, Rev. R. C. Williams, Gerald J. Willsea, and\nFrank Schooley.\nWELCOME MAT FOR BROADCASTERS\nIN ACPRA\nThe American College Public Relations Assoc., once\nalmost exclusively for “press” and “news bureau,\npersonnel, now offers a special invitation to radio\nand TV broadcasters in colleges and universities.\nAt their annual meeting in Omaha, June 24-27,\nACPRA will formally organize a new “Communica¬\ntions Section.” The section will serve as a focal\npoint for all media-workers in higher education who\nare concerned with institutional public relations.\nThe welcome mat is out for broadcasters to at¬\ntend the organizational meeting of the Section: 3\np.m., June 24.\nNAEBer Lynn Poole of Johns Hopkins is presi¬\ndent of ACPRA this year. The planning committee\nfor the new Communications Section includes William\nBender, Jr., of the University of Michigan, who is\nalso a member of the NAEB Public Relations Com¬\nmittee.\nUNIVERSITE RADIOPHONIQUE\nINTERNATIONALE\n—Keith Engar And Bernard Buck\nNAEB Fuibright Scholars in Paris and Rome\nWe represented NAEB at the convention of URI\n(International University of the Air) held in Paris\nApril 2-4. Sponsored and financed by the French\nBroadcasting System, URI promotes exchange of\nuniversity-level programs among member organiza¬\ntions. Twenty-eight nations and' international groups\nwere represented at this year’s meeting.\nWe made no commitments for NAEB to pro¬\nvide the URI with program material, but instead\nobtained a clear proviso that NAEB could sub¬\nmit series whenever the organization was able to do\nso.\nPerhaps the major value in the convention was\nthe opportunity of establishing rapport with educa¬\ntional broadcasters from so many different countries.\nIt will be only a matter of time before international\nARE OUR FACES RED!\nWay back in the February Newsletter we listed a Frank\nWilliams under the Associate Members Committee list. We\nmeant the very Rev. R. C. Williams, S.J. of Creighton Univer¬\nsity, and somewhere along the line his name became scrambled.\nOur apologies to all concerned.\nexchange on a grand scale will be an accomplished\nfact, with resulting rich rewards to U.S. educational\nradio and TV stations. Certainly educational broad¬\ncasters the world over owe a great deal to Radio-\ntelevision Francaise for organizing and financing\nURL , .\nIf we may add a personal note, many thanks are\ndue to M. Michel Robida of RTF who proved such\na grand host. As director of Cultural Exchange for\nRTF, M. Robida was responsible for the detailed\nplanning of URI. We noted that everyone at the\nconference inquired about Seymour N. Siegel, who\npresided over the Technical Committee of URI in\nthe 1955 meeting, and Dr. Harry Skornia, who is\nremembered for his excellent work in Vienna.\nNETWORK NEWS\n—Bob Underwood\nIf we disregard those hectic days around NAEB\nConvention time, the next few weeks promise to be\nthe busiest of the year for me. First, I am to attend\nthe Fourth Allerton Seminar on Radio Programming\nto be held from April 21-24; then back to the office\nfor a few days in an attempt to find the bottom of\nmy ever full in-box; and finally off to Columbus for\nthe IERT meeting. That is quite a schedule, and\nI am beginning to realize the problems traveling\nmust present to the NAEB President and the Execu¬\ntive Director who, it seems, are constantly on the\nroad.\nAfter glancing at the list of speakers and sche¬\ndule of events for the Allerton Seminar there is no\ndoubt in my mind regarding the success of this meet¬\ning, and I am looking forward to it with great antici¬\npation—not just because I will learn something from\neach speaker, but mainly for the opportunity it pro¬\nvides for a group of NAEB people interested in radio\nto get together and exchange ideas on how both\nNAEB as a whole and each individual NAEB mem¬\nber station can improve its program services.\nThe IERT meeting provides the same type of\nopportunity. However, I look on the IERT meet¬\ning as a chance for me to meet and discuss network\nproblems with you; not through this monthly column\nor by a letter, but face to face where you can talk\nback should you feel so disposed.\nWhat I would like to do is travel to each station\nonce a year where we could discuss your problems and\n4\nNEWSLETTER"
}