{
  "id": "d1534-6",
  "text": "to the tube elements.\nAfter aging, the tubes are checked on a SECO\nGrid Circuit tube tester, which indicates control grid\nemission, grid to cathode shorts, cathode to heater\nshorts, and gaseous conditions. Another 5 to 10\nper cent of the aged tubes fail to pass this test and\nare returned for replacement. The remaining tubes\nare then placed in stock to be used when the occasion\ndemands.\nLarry Brogger, KUOM chief engineer, has pro¬\nmised to furnish us details on the KUOM tube ager\nwhich we will duplicate and pass on to you. He\nbelieves this equipment will pay for itself in a year’s\ntime by locating sub-standard “new” tubes, to say\nnothing of the maintenance time saved by knowing\nthat a tube is good before it is used in equipment.\nAlso as a result of the use of this procedure, he\nhas become convinced that an occasional routine\ncheck of tubes in operating equipment is advantage¬\nous in maintaining the equipment in peak operating\ncondition.\n* * * *\nI spent some time with Berten Holmberg, chief\nengineer of KTCA, the Twin City Area ETV Corpor¬\nation station. The KTCA transmitter has been in¬\nstalled in the KUOM transmitter house, proof of\nperformance tests have been completed, and they\nhave had a test pattern on the air on Channel 2.\nPresent plans call for programming to begin in\nSeptember, 1957.\nKTCA offices are located at present in a tempor¬\nary building on the Agriculture campus of the Univ¬\nersity of Minnesota (which will also house live\nstudio and film equipment). Work is about to be\nstarted on the installation of studio equipment.\nBert has had his physical activity severely slowed\nbecause he tore a tendon in his left heel in an attempt\nto get away from the KTCA tower when a bolt was\ndropped. Now that the cast has been removed and\nthe crutches discarded, he hopes soon to be going\nfull speed ahead.\n* * * *\nThe NAEB Engineering Committee held a short\nmeeting in Chicago Monday, April 8, prior to the\nNARTB Convention and Broadcast Engineering\nConference. Six of the 10 committee members were\npresent.\n* * * *\nSpeaking of the NARTB Convention, I saw per¬\nhaps 20 engineers from educational radio and TV\nstations in attendance. No doubt there were others\nwhom I didn’t happen to meet or see. Total reg¬\nistration for the Convention was 2358, with 577 reg¬\nistered as engineers.\nSome excellent papers were presented during the\n3 full days devoted to the presentation of engineering\npapers. Eleven of these papers covered radio sub¬\njects, and 18 were devoted to TV engineering.\n* * * *\nI have no idea how many manufacturers were\nrepresented at the Equipment Exposition. Space in\nthe Conrad Hilton Exhibition Hall was filled and\nthere were a number of equipment representatives\nexhibiting on the 5th or 6th floors of the hotel.\nProgram services, networks and others were also\nthere providing something of interest to everyone in\nthe broadcast industry.\nAs I saw it, the theme of the NARTB equipment\nexposition was “automation,” with automatic devices\nbeing displayed for both radio and TV programming.\nThese automatic devices were shown by Gates,\nAmpex, and General Electric. RCA also is working\non an automatic program device.\nVidicon equipment was much in evidence. RCA\ndisplayed its new, broadcast quality vidicon camera.\nKin-Tel, Sarkes-Tarzian, Dage and General Electric\nalso were showing vidicon camera equipment for\nlive and film use. In much of this equipment the\nfilm and live camera chassis is interchangeable.\nIn the field of video recording, Dage and Sarkes-\nTarzian were showing 16mm kinescope recording\nequipment built to sell for less than $8000. Ampex\ndemonstrated its videotape recorder in the recently\ncompleted installation at the ABC-TV studios.\nThree of the prototype models have been installed,\nthe first to incorporate the much desired feature of\nuniversal playback. As a result of non-interchange¬\nability on earlier prototype models, CBS solved this\nproblem by storing the recording head with the pro¬\ngram tape in order to accomplish a 4 week delay on\nthe Arthur Godfrey programs.\nTape continues to be the major problem of video¬\ntape recording, and tape manufacturers are working\nhard to solve tape problems. Some tapes now have\na life of 200 passes—100 recordings and 100 play¬\nbacks. An hour’s tape costs $200, so when this life\nis achieved, cost is only $2 per hour. However, cost\nper hour skyrockets when the tape only lasts 10\npasses.\nAnother item of interest displayed was a device\nto reduce, “burn in” on image orthicon cameras. It\nconsists of a mechanism to oscillate the lens board\nof the TV camera, at the same time providing an\nelectrical cancellation of the resulting vertical and\nhorizontal motion.\nIt was demonstrated with an image orthicon with\nover 1000 hours service which had been discarded\nbecause of burn in. The camera was left stationary\non a test pattern and, due to the action of the device,\nshowed no burn. With the device turned off a “burn\nMAY, 1957\n7"
}