{
  "id": "d658-126",
  "text": "r-\nMICHIGAN STATE UNIVERSITY\nOF AGRICULTURE AND APPLIED SCIENCE • EAST LANSING\nTELEVISION STATION • WKAR-TV\nSeptember 9, 1957\nMr. Harry J. Skornia\nNARB Headauarters\n14 Gregory Hall\nWbana, Illinois\nDear Harry:\nI will be glad to do the second round of fact sheet documents by September\n23rd which I received in the mail this morning. I will be unable to get\nthe Hurt Mind Study to you by that time. Allow me to explain.\nThe Hurt Mind is a study of the effects of a BBC educational TV series.\nThe fact that they have been able to show in a scientific manner that\nlearning did take place on the part of the general viewing audience as\na result of a typical viewing situation is far more important than the\npercentages given in the summary section of the report you handed me.\nI have therefore written Mr. Belson for Part Two of the report which gives\nhis methodology. It is this aspect of the Study which undoubtedly will\nbe of greatest interest to research people and educators in this country.\nAs soon as I receive the copy of Part Two you shall have the fact sheet.\nNow you can help me. I urgently need a copy of “Measurement Of Meaning11,\nthe Osgood, Suci, and Tannebaum book published by the TJ. of I. Press.\nSince B. T. reviewed it because of the radio and TV experimental results\nincluded in the book, it seems to me that the fact sheet should have a\nreport on it as well. I am volunteering for the job. Please forward\nreviewer's copy at once.\nIt so happens that I need a copy of this book as a reference in regard to\nmy own Study of the Political Campaign on TV during 1956. If you cannot\narrange for a reviewer's copy and the subsequent fact sheet report, then\nI beg you to buy me a copy obtaining the U. of I. faculty customary JOff*\ndiscount. I promise by all that is holy to return the cost of the book\nto you by return mail. I could wait a week if you need to negotiate for\nthe reviewer's copy. If this is absolutely out of the auestion, please\npurchase said copy as soon as may be convenient.\nIRM/odm\nSincerely,\nvjur-\nIrving R. Merrill\nDirector of Television Research\n*i. vj - T"
}