{
  "id": "d658-137",
  "text": "Educational Television Research\nSeries _*\nOctober 3, 1957\nTELEVISION AS A MEANS OF MEETING COLLEGE STAFF SHORTAGES AND UPGRADING\nGUIDANCE AND COUNSELING SERVICES IN THE SCHOOLS. Walter M. Lifton,\nAssoc. Prof., College of Education, Uhiv. of Illinois, mimeo, 10 pages.\n\"In the face of the growing tide of requests for counselors, counselor\ntraining institutions find themselves unable to either train an adequate\nnumber of new counselors or to travel about the country to assist schools\nin their efforts to develop or improve guidance services in their programs.\"\nA proposal by Professor Lifton goes into considerable detail on one sug¬\ngested method of meeting these problems.\nThe anticipated outcomes of the study include*\n1. More effective use of teaching personnel to provide guidance\nservices, especially in schools where no formal programs pre¬\nsently exist.\n2. A better understanding on the part of students as to their own\nresponsibilities in our society, and the way they can best\nselect a career which provides satisfaction.\n3. An increased understanding of the changing nature of the world\n^ of work by the public, with particular reference to parents.\nAssociated with this should be a better knowledge of existing\nfacilities for use in the selection of schools or work,\nij. A better perception of the differences which exist in vocational\nplanning for rural vs. urban populations.\nThe project plan and timetable is carefully laid out and no attempt is\nreally made to condense all the material in this report, because of the\nthoroughness and detail into which the proposal discusses each phase of\nthe project* FACTSHEET readers interested in administrative procedures\nof a project of this scope will find it useful to study the full report.\nManagers will also appreciate the opportunity to study the details in this\nproposed budget of sixty telecasts, since few production costs are ever\nmade available for comparative cost studies. For this three year project,\nthe budget has been reduced in this brief report to the following seven\nbasic items* TV Staff Salaries—$1*2,350.00, Production Costs—$21*,000.00,\nKinescope Recordings—$30,000.00, Monitors for Schools—112,000.00, Guid¬\nance Staff—$29,500.00, Research Staff—131,800.00, General Budget—\n$32,1400.00. Total* 1202,050.00\nThe study itself will be of particular interest to Counselor Trainers.\nTV Producer, and TV Managers.\nRaymond D. Cheydleur\nOctober 3, 1957"
}