{
  "id": "d658-184",
  "text": "NAEB HEADQUARTERS\n14 Gregory Hall\nUrbana, Illinois\nAt the time of the Research Ckasalttee meeting in Chicago, August 7 and 8\nCor in scone cases previously), the following individuals were given the\nfollowing Research Documents or reports on which to do Fact Sheets,\n(Robert Coleman was given none because of the very heavy burden of reports,\naccounts, etc, he has as NAEB Treasurer, and his agreement to serve &&\na member of the Committee with that understanding),\nIrving Merrill - BBC; Hurt Sflnd study.\nClarence Flick - CBC Reports,\nGale Adkins - Atme Durham Robinson9 s thesis,\nKenneth Harwood - The Thayer (Ohio State, Research Orant-inOid) Study,\nKeith Tyler - The FAE (Glenn Burch) Study.\nRaymond Cheydleur - 2 ETRC studies (Fact Sheets on both already received),\nSam Becker - The Ed Browne Thesis (for evaluation on^ possible Fact Sheet\nreport).\nKenneth Harwood also still has the New York University 3tudy for Fact Sheet.\nSince various other reports have now been received, t m sending the\nfollowing persons the following second reports on thsp; sme basis;\nGale Adkins - (Since he (you) did the preliminary siu$y report) £ Phnd\nfor the Advancement - Purdue University Study.\nClarence Flick - The (Schramm Stanford) \"Audience for JET7 in the San\nftrancisco Bay Area\" (July 1957).\nIrving Merrill - Thesis (20 pp., by Frances Jewell .(#7 Norwood Avs.,\nBuffalo)?s \"The Training of Teachers to Teach on Television\".\nSam Becker - \"The WQED Audience\" study, by Howard Rowland.\nAs others come in, 1*11 ship to Harwood, Tyler, and Qbeydleur, in that\norder.\nI know it 0s a lot to ask, but to avoid strewing these out, it would certainly\nbe nice to have these by about September 23, so we could get them run and\nlist them in the October (convention issue) Newsletter, as the committee\nsuggested. Otherwise they911 have to wait tlHT th©\"l^vcmbop issue, pretty\nlata to help people who need them as soon as possible. I know we*re all\nburning midnight oil, but there9 s very little value to these unless they\nare current."
}