{
  "id": "d658-19",
  "text": "Mr. Bob Coleman\nDwember 3* 195&\nultimate. It may evolve Into something of greater utility.\nEventually, It mi^it he passed on to other hands. In the\nmeantime, it is a feasible and useful HAS® service. It is\none of the tangible evidences that our organisation recog¬\nnises research as a cornerstone to progress in educational\nbroadcasting.\n3. Plans and machinery for the get sheet service must be coordi¬\nnated with the expanding pattern of HAsSft development.\nThe first phase is now outgrown. Since Harry Skornia no\nlonger has the time neceeeary for Pact sheet supervision,\nmore of the load may have to fall on Individual members,\nWhenever a research coordinator can be added to the staff,\nthe service should be under his supervision.\n4. The Fact sheet project should continue to utilize member\nservicee.\nTo the extent that qualified and dependable assistance is avail¬\nable, members should participate in the preparation of digests.\nBoth the member involvement and the reduction of load on Head¬\nquarters are desirable.\n5. Any responsibilities for the Pact sheet service that might\nfall on the Research Committee should not deprive the committee of time\nand attention needed for planning and organising other research activities.\nHow that I have explained the framework of my thinking, here are\nmy recommendations.\n1. For the time being continue the Fact sheet service along essen¬\ntially the same plan but with more assistance from members. Recruit\na pool of several qualified Factsheet writers from the Research Committee\nand the general membership, fills.could free Harry from writing all ex¬\ncerpt occasional digests.\n2. As soon as possible employ part-time at Headquarters a graduate\nstudent who could prepare some Fact sheets, mail out studies to BAH\nmembers in the writing pool, and supervise duplication and distribution\nof digests. He might carry the title of research coordinator. Harry\nwould then be freed from all except keeping a paternal eye on the proceedings.\n3. Hext year, or as soon as the budget permits, employ half time\nor full time a thorou^ily qualified and experienced research coordinator.\nHe would supervise the Fact sheet service as a part of his work in assisting"
}