{
  "id": "d658-54",
  "text": "possibilities of television instruction and provide an opportunity for planning the details\nof the program.\nMore than fifty teachers, principals, supervisors, and P.T.A. leaders, representing\nvarious subject matter areas and geographical regions of the county participated in the\nworkshop which was held from July 9 to August 17, 1956. The workshop proved to be\na stimulating experience for all the participants. The members first organized into\nsmall groups to discuss what they thought could and could not be done by televised in¬\nstruction. Problems and plans were studied and attempts made to meet the criticisms\nand objections raised when new approaches to traditional concepts were considered.\nConsultants from leading colleges pioneering in television training and public school\nteachers experienced in television teaching presented their opinions to the group.\nAs a result of the discussions the members of the workshop found that they were actually\nre-evaluating their ideas about education and the learning process. It seemed reassuring\nto them to realize that they were primarily discussing education and not television.\nTelevision was viewed as a means to an end with the plans for the educational aspects\nof the program taking first place. Television thus became a vehicle for looking anew\nat educational problems, procedures, methods, theories and techniques. This experience\nwas most beneficial to the participants and they expressed their continued interest and\nenthusiasm.\nThe learning process was analyzed in detail and the various items involved were listed.\nThe question then arose as to which items could be handled readily by direct television\ninstruction and which ones would be difficult or impossible to attain.\nThe general feeling of the group was that instruction by television:\nProbably Could\nMotivate and stimulate\nInform\nDemonstrate\nShow application\nEnrich backgrounds\nRaise questions\nProvide common experiences\nSuggest activities\nChallenge pupils to assume more\nresponsibility for their own learning\nProbably Could Not\nHandle classroom discussion\nCare for individual differences in pupils\nClear up immediate misunderstanding\nSupervise needed drill and problem solving\nProvide for foSIow-up of the lesson\nDirect and supervise the activities grow¬\ning out of the lesson\nProvide remedial teaching\nHelp pupils to do something about the\nthings learned\nProvide opportunities for pupils to exercise\ncritical judgments\ninterpret the testing program\nGive sufficient attention to the establish¬\nment of desirable habits and ideals\nThis analysis led to the idea of organizing a teaching team with the television teacher\nresponsible for the Stems that television can best do, and a classroom teacher caring for\nthose which, at the moment, seem to be better handled by direct contact with pupils.\nThe lesson plans were therefore developed by the teaching team and regular meetings have\nbeen scheduled throughout the school year for further planning and evaluation.\n-8-"
}