{
  "id": "d658-61",
  "text": "The television project is operated as follows:\nThe Board of Education of Washington County\nPresident\nSuperintendent\nCoordinator\nDirector of Public Relations\nChief Engineer\nAssistant Engineer\nProduction Supervisor\nAssistant in Production\nTechnician\nClerical Staff\nJunior college students are employed on\nwith the production of the lessons.\nJohn M. Baer\nWilliam M. Brish\nT. Wilson Cahall\nRobert F. Lesher\nJohn R. Brugger\nJohn F. Wahlfeldt\nMrs. Marjorie E. Hoachlander\nStanley D. Johnson\nD. Glenn Thomas\nMrs. Hilda E. Newcomer\nVirgie L. Rudolph\nMrs. Joanne M. Taylor\nhourly basis to operate cameras and assist\nAdditional personnel will be added as the project progresses.\nOBSERVATIONS ABOUT USING CLOSED-CIRCUIT TELEVISION FOR DIRECT INSTRUCTION\nThe project has provided stimulating motivation for the professional advancement of\nteachers. It is increasing interest in the teaching process and is making teachers more\naware of the opportunities for improving instruction.\nThe television teachers feel that television is providing many advantages, some examples\nof which are:\n1 . The television screen gives the teacher direct control of the attention of the pupil.\nIt provides an effective fixation point for group instruction. Lessons are planned\nto utilize this effect.\n2. Visuals help explain the ideas of the lesson. They are developed for use under\ncontrolled conditions. Developing ideas for effective visuals is a creative experience\nthat is having a wholesome effect on teacher morale and enthusidsm.\n3. The television camera can greatly magnify a small part of the area to be shown. This\nis especially effective when presenting a close up of the action that is taking place\nin g demonstration. In this way, the pupil can actually see better what is happening\nthan if he were present in person for the demonstration. Every seat in the classroom\nbecomes a front row seat.\n4. The teacher looks at the camera and immediately is looking straight into the eyes of\neach pupil who is watching. This seems to have a psychological effect that causes the\npupil to give close attention to what is happening.\n-14-"
}