{
  "id": "d658-64",
  "text": "8. Studying the persistence of adolescents through the full twelve years of schooling as\nopposed to the tendency to drop out of school at age sixteen\n9. Finding out to what extent valuable learning can take place by means other than those\ndirectly dependent primarily upon skill in reading\n10. Discovering the potential involved in opportunities for teachers to plan together at\nrather frequent intervals\n11 . Identifying the contributions of the television teacher to the total learning situation\n12. Identifying the contributions of the classroom teacher to the total learning situation\n13. Studying the relationship of the techniques needed by pupils to achieve maximal results\nfrom televised instruction (Importance of such skills as listening, note taking, paying\nattention)\n14. Noting the effect of televised instruction on schedule making (Simplified or made more\ncomplicated)\n15. Learning the factors of classroom environment that improve televised instruction\n16. Noting specific instances which indicate that through televised instruction there are\npositive or negative evidences of\na. Increase in the achievement of slow learners\nb. Stimulation to gifted pupils\nc. Awareness of pupils of the great range of knowledge\nd. Awareness of pupils of the interrelatedness of the various fields of knowledge\ne. Increase in accepting responsibility for self direction\nf. Enrichment of the instructional program\ng. Acceptance of self discipline\nh. Increase in the ability of a group to work together\ni. Opportunities for more attention to the individual pupil\nj. Savings In teacher time and effort\n17. Noting specific examples of improvement\na. in the quality of instruction\nb. in learning by involvement in large groups\nc . in the study habits of pupils\nd. in the retention and voluntary recall of ideas that have been learned, hence a\nreduction in the need for reteaching\n18. Noting specific instances which explain what was accomplished in the lesson by\ntelevision that could not otherwise have been achieved\n19. Analyzing specific procedures for handling large groups\n20. Noting evidences of changes in the concept of teaching\n-17-"
}