{
  "id": "d658-8",
  "text": "Dr. Harry Skornia\n-2-\nMay 19, 1956\nYour mention of clearing-house understandings caused\nme to wonder if research information is being exchanged with\nthe networks and large agencies. I suppose these sources\nhave been explored, but in looking back through my file of\nFact Sheets I can find no reports of such origin. Perhaps\nno great number of network or agency research studies would\nmeet the requirements, but some would definitely be of in¬\nterest to educational broadcasters.\nMy last question is to ask why the Fact Sheet Service\nmust be self-supporting and on a subscription basis. One\nresult of the subscription system must be that many members\nare slow in sending in the fee and some may feel it to be an\nextra they can do without. I suspect the result is a spotty,\ninconsistent kind of service to the membership. In my opinion,\nall members should have the Fact Sheets.\nSince the Fact Sheet Service is not an obviously ex¬\npensive operation, like the Tape Network, the reason for the\nfee is subject to misunderstanding. One of the undesirable\nwrong impressions is that this service is not really a basic\nconcern or responsibility of NAEB. It may seem to be an\nextra service that MSB is undertaking as long as subscribers\nwill support it outside the regular MEB commitments. I\nthink the service is appropriate for the MSB to include as\none of its budget-supported functions. I would not like to\nsee this service taken over by any other organization.\nAt the present subscription rate, income from NAEB\nmembers who might subscribe to the Fact Sheet Service would\nnot exceed $*J00. I think it would be worth more than $400\nto furnish the service to every NAEB member. Non-members\nshould of course pay a fee. If the income from Service sub¬\nscribers is a critical amount, then I would suggest that\nthe next raise in all classes of membership dues be suffi¬\ncient to permit dropping the extra fee. I think the Fact\nSheets should come as a standard service to all members.\nThis would, incidentally, be a useful attraction to affiliate\nmembers who may not now count many advantages of membership.\nIn the meantime, until a good, thing can be further"
}