{
  "id": "d1859-1",
  "text": "NAEB NEWS LETTER\nPage 2\nMay 15, 1942\nRECEIVE DEFERRED STATUS IN SELECTIVE SERVICE,, THESE STATIONS HAVE\nunusual problems, not only because of Selective Service demands on\nPERSONNEL, BUT ALSO WITH FIXED BUDGETS THEY CANNOT COMPLETE WITH\nCOMMERCIALLY OV'NED STATIONS AND INDUSTRY FOR SERVICES OF MEN AVAIL¬\nABLE* NOV IK AND MENZER WERE APPOINTED ON A SPEC I LA COMMITTEE TO\nSTUDY THE PROBLEM* THERE WAS UNANIMOUS FEELING THAT NO BLANKET DE¬\nFERMENT SHOULD BE ASKED FOR ALL PERSONNEL, BUT ONLY FOR SUPERVISORY\nPERSONNEL IN THREE OR FOUR KEY STAFF POSITIONS* THERE WAS ALSO\nUNANIMOUS OPINION EXPRESSED THAT WINNING THE WAR COMES FIRST, BUT\nMORALE IS A PART OF THE WAR AND THE EDUCATIONAL STATIONS ARE PLAYING\nA DEFINITE PART IN THE BATTLE.\nAccomplishments and problems of all stations, represented at the\nMEETING, WERE REPORTED TO THE CONVENTION*\nA SPECIAL COMMITTEE WAS NAMED TO AUDITION A TRANSCRIBED SERIES OF\nprograms on Social Diseases offered by Elmer Sulzer, which would\nBE MADE AVAILABLE TO NAEB STATIONS, IF DESIRED BY THEM*\nThe Executive Secretary was instructed to mail only one copy of the\nNews Letter, hereafter, to members and associate members. It was\nalso decided to issue the News Letter monthly, effective September I.\nActually, monthly issuance os the Letter starts with the summer\nmonths, because the mid-month issue has not been published during\nTHE SUMMER IN PAST YEARS* SUPPLEMENTS WILL BE MAIL0D OUT WHENEVER\nDEEMED ADVISABLE*\nLKAR JOINS NAEB\nR. J. Coleman, Director of WKAR, Michigan State College, East Lansing\nMichigan, advises our treasurer, W. I* Griffith, that WKAR is\njoining NAEB. Welcome, ColemanS Glad to have your statson in\nNAEB. V.e hope our relationships will be of mutual benefi t. .. .Wallace\nL, Garneau is now managing radio for Western State Teachers College,\nKalamazoo, Michigan* Garneau attended the NAEB meeting in Columbus*\nMarburger is now serving his country at war.\nNAEB SCRIPT EXCHANGE GROWS\nNat £rwin, Director of the NAEB Script Exchange and Production\nDirector of ILL, reported to the NAEB Convention in Columbus\nTHAT THE FOLLOWING MEMBERS HAD CONTRIBUTED TO THE NAEB SCRIPT\nExchange: Oklahoma; Wisconsin; Michigan; Kentucky; Purdue; Illinois;\nand Indiana* The following have avaiiled themselves of the ser¬\nvices: Oklahoma; Illinois; Indiana and Florida*\nRemember, the Script Exchange is for the services of NAEB members,\nAND ESPECIALLY FOR THE CONTRIBUTORS. SEE PREVIOUS NEWS LETTERS\nFOR CONDITIONS GOVERNING BORROWING E«JANGE SCR PTS. OKLAHOMA\nISSUE FOR ADDITIONAL SCRIPTS CONTRIBUTED RECENTLY BY OKLAHOMA."
}