{
  "id": "d1859-4",
  "text": "NAtb ME‘VS LETTER\nPage 5o\nMay 15, 1942\nCOL.. I SSI OK RELAXES RULE 3,71 (cont’d)\nEFFECT THE WAIVER PERMITS THE LICENSEE TO MAINTAIN A MINIMUM SCHEDULE\nOF HOURS BEST SUITED TO THE NEED OF THE AREA CONCERNED. SPECIFICALLY\nTHE RULES HAVE BEEN REDUCED TO TWO—TH I RDS THE AUTHORIZED HOURS BETWEEN\n6 A.M. AND MIDNIGHT.\nIt is RELIEVED THAT SUCH RELAXATION at this time will be of MATERIAL\nASSISTANCE TO LICENSEES, TO OPERATING PERSONNEL, AND WILL EXTEND THE\nLIFE OF EQUIPMENT AND REDUCE MAINTENANCE REQUIREMENTS, BUT AT THE\nSAME TIME WILL NOT REDUCE THE OPERATING SCHEDULE BELOW A REASONABLE\nMINIMUM.\nThis step adds to the Commissions action in orders 91 and 9UA, which\nRELAXES REQUIREMENTS ON OPERATOR LICENSES, AND WHICH TOGETHER TENDS\nTO RE.LIEVE THE SHORTAGE OF TRAINED PERSONNEL IN THE BROADCAST IN¬\nDUSTRY.\n(NAEB HAS LONG ADVOCATED THIS POLICY FOR GENERAL PRACTICE, IRRESPECTIVE\nOF WARTIME CONDITIONS.)\nCQ.UiiSSiOL TO RESTRICT CONSTRUCT SON\nThe FCO has ADOPTED A POLICY TO GRANT no APPLICATION FOR AN AUTHORI¬\nZATION ? NVOLVING THE USE OF ANY MATERIALS TO CONSTRUCT OR CHANGE THE\nTRANSMITTING FACILITIES OF ANY STANDARD, TELEVISION, FACSIMILE, RELAY,\nOR HIGH FREQUENCY (Flu) BROADCAST STATION. THE COMMISSION, HOWEVER,\nHAS DEFERRED ACTION ON THE RECOMMENDATION OF THE DEFENSE COMMUNICATIONS\nBoard with respect to experimental high frequency and non-commercial\nEDUCATIONAL BROADCAST STATIONS. ACTION WAS TAKEN APRIL 27.\nApplications filed to meet the requirements of authorizations heretofor\nMADE IN THE FORM OF CONDIT8 ONAL GRANTS, AND APPLICATIONS REQUESTING AN\nEXTENSION OF TIME WITHIN WHICH TO COMPLETE CONSTRUCTION UNDER AUTHORI¬\nZATIONS HERETOFORE MADE, W>LL NOT BE GRANTED, UNLESS IT APPEARS THAT\nTHE APPLICANT (D HAS MADE ^SUBSTANTIAL EXPENDITURES IN CONNECTION THERE\nWITH OR ACTUALLY COMMENdED CONSTRUCTION PRIOR TO THE DATE HEREOF, AND\n(2) HAS ON HAND OR AVA 8LABLE 'SUBSTANTI ALLY ALL MATERIALS AND EQUIPMENT\nNECESSARY TO COMPLETE CONSTRUCTION.\nFCC ACTIONS\nThe FCC, on Way 5> granted *//SUI , University of Iowa, a license renewal\nFOR THE PERIOD ENDING AUGUST 1, 1942.\nSCHOOLEY"
}