{
  "id": "d1583-0",
  "text": "MARCH, 1947\nTRACY F. TYLER, Editor\ni'\nJOURNAL\nI PHIt\n1\nVIRGINIA S. TYLER, Assistant to the Editor\nVOLUME 6, NUMBER 7\nGEORGE JENNINGS, Business Manager\nIs This Cooperation, Mr. Broadcaster?\nCALIFORNIA IS ONE OF THE STATES attempting to fol¬\nlow the leadership of the United States Office of Edu¬\ncation and the Federal Communications Commission\nby planning for a publicly-controlled, educational FM net¬\nwork. Reports indicate that the University of California is\nseeking a legislative appropriation of $1,750,000 for this\nworthy purpose. It goes without saying that all persons who\nare sincerely interested in assisting radio to render maxi¬\nmum service to education will wish the progressive state of\nCalifornia well' in this effort.\nCalifornia hay an excellent reputation educationally. It\nhas • a- -clistfnguished university—the largest in the world.\nA substantial per-capita sum is provided from state funds\nfor the education of every student who attends the public\nschools. Fine school plants, the envy of many other states,\nhave been provided. Standards for admission to the teach¬\ning profession are high. Teachers’ salaries are very substan¬\ntially above the average for the nation as a whole. Personnel\nin the state’s teaching and administrative posts meet rigorous\nstandards. Many important advances in educational practice\nhave originated in California. No state is better qualified\nto embark on new educational endeavors.\nIt is hard to believe that any member of the commercial\nradio industry would have any other feelings than those of\ngratitude to find educators showing such a deep interest in\nradio and its non-commercial, educational, and public serv¬\nice possibilities. Especially should they welcome the en¬\ntrance into the radio field of the public educational authori¬\nties. Yet Broadcasting, February 3 [page 61], reports that\nNorthern and Southern California Broadcasters Associations\nare opposing the entrance of California into FM. The reason\nfor this reported opposition, according to Broadcasting, is\nbecause broadcasters are “conscious of this threat to free¬\ndom of expression as well as implied competition.”\nThis writer must have been fortunate in his associa¬\ntions with members of the commercial broadcasting frater¬\nnity. Practically all of those with whom he is acquainted\nwould encourage, rather than impede, educational FM plans.\nSurely commercial broadcasting in California is not in such\na precarious position as to cause any of its members to fear\nnetworks operated by the public educational authorities.\n[Can it be-that education is a threat to business? When have\neducators been convicted of suppressing free speech?] Yet\nsuch opposition can lead only to the conclusion that Califor¬\nnia broadcasters are suffering from fear—have developed\nfeelings of insecurity, of inadequacy.\nPerhaps the attitude of the Northern and Southern Cali¬\nfornia Broadcasters Associations has been incorrectly re¬\nported. In that case a public denial is in order, and Broad¬\ncasting should provide prominent space in an effort to undo\nthe irrevocable damage which an incorrect report of this\nnature might do.\nIn any event, it is to be hoped that the officers of the\nNational Association of Broadcasters will take cognizance\nof this unfortunate move on the part of the California radio\nindustry. An NAB investigation should result in an official\nstatement immediately in full support of California’s pro¬\nposed state educational FM project. Only in that way can\nthe NAB convince American educators of commercial\nradio’s sincerity in its professions of friendliness.\nAn official investigation by the Federal Communications\nCommission also seems to be indicated. The Commission has\nlabored diligently to bring about the establishment of edu¬\ncational FM networks by the public educational authorities\nin each of the forty-eight states. It has set aside twenty\nchannels for this use at the request of Dr. John W. Stude-\nbaker, United States Commissioner of Education. AlthpugJjj\nthe educational FM channels, which it is believed are\ncient to accommodate as many as seven or eight hundred\nstations, have not, even yet, been applied for in large num¬\nbers, the Commission realizes the almost staggering prob-*-?\nlems which the educators are facing today. It is aware that\nschools generally need more time to complete their plans\nand arrange for financing than do commercial applicants.\nBut the Commission could have had no prior intimation that\ncommercial broadcasters would fight the educators on the\nwhole educational FM proposal. In fact the very opposite\nis the case.\nThe Federal Communications Commission is a trustee of\nthe public interest insofar as broadcasting channels are\nconcerned. It has been protecting these twenty FM channels\nbecause it believes that it is in the “public interest, con¬\nvenience, and necessity” for the educational authorities in\neach of the states to have adequate radio facilities under\ntheir control through which accepted educational objec¬\ntives may be advanced.\nIs there an ulterior motive behind this commercial op¬\nposition? Could it be the hope that if states are prevented\nfrom establishing educational FM stations, the twenty chan¬\nnels would be thrown open to commercial exploitation?\nPerhaps an FCC investigation might bring to light some\ninteresting data. It is conceivable that, if the facts war¬\nranted, a public statement of the findings might be released\nwidely for public consumption. The least that could be done\nby the FCC would be to issue an official statement deploring\nthe irresponsible attitudes which the article in Broadcasting\nreports, and to make sure that this statement received wide\npublicity.—Tracy F. Tyler, Editor.\nVOLUME 6, NUMBER 7; MARCH, 1947\n[101]"
}