{
  "id": "d1583-4",
  "text": "-5-\nISTC IS NAEB MEMBER\nApologies are due Clarence Morgan for the unintentional omission of the name\nof Indiana State Teachers’ College from the regional NAEB list in the June News¬\nletter. ISTC holds associate membership and is doing a good job of its educational\nbroadcasting.\nREPORT ON WAN\nAt' the Newsletter’s request, John- Dunn has submitted information about the\nactivities of WAD. Here is a summary of a year’s work:\nFrom July 1, 19l*6 to June 30, 19l*7, WNAD broadcast a total of 2,956 hours.\nThis included special broadcasts on Christmas Day. WNAD was on the air at night\nto broadcast the home basketball gomes.\nA A total of 10,01*1 programs were aired during the past year, embracing one\nhundred and thirty one NEW and different program series. THE OKLAHOMA SCHOOL OF\nTHE AIR-on a small scale—-was inaugurated. Four different series were broadcast—\nchiefly to rural schools in Cleveland County.\nA total of 2,799 different individuals broadcast over WNAD. Of this number,\n172 were faculty members, representing some forty odd departments of the university.\nAbout 38 agencies other than university departments made use of WNAD facilities.\nAmong our distinguished speakers were President Cross with his weekly series,\nTHE PRESIDENT OF O.U. SPEAKS and Governor Roy J. Turner’s semi-weekly series,\nREPORT TO OKLAHOMA.\nWNAD has a recorded music library of over 8,000 recordings of fine music,\nand subscribes to a transcription library. With AP news wire, its staff of local\nnews reporters, and religious news service, WNAD boasts of a complete newsprogram.\nAn extensive ’’listener survey\" was made during the past year. . This\nsurvey, showed that 3 out of 1* listeners listened REGULARLY to WAD; 3 out ^4-\nlisteners report reception \"good\"; 1* out of every 10 listeners were on the rural\nroutes or in very small towns; 1* out of 10 listeners were MEN; that good music\nranked highest in preference among listeners, educational programs second and news\nreports third* It was also found from this survey that listeners wanted more good\nmusic, literature, more forums, science, art, et cetera.\nWNAD has paid especial attention this year to public relations and promotion.\nActivities in this direction are too many to list here, A conservative estimate\nof the listening audience in Oklahoma, southern Kansas and north Texas is around\n500,000 people. Noarly 3*000 cards and lottors about WNAD’s programs havo come\ninto the station during the past yoar*\nWNAD now has a 3 kw FM transmitter ready to bo installed, and permission\nis sought to buy a now transmitter and move location of the transmitter to a sito\nnorth of Norman. The salary and maintonanco budget for tho next fiscal yoar has\nbeen increased 35^* It is now six times what it was in 19UU» A movo is underway\nto got now and moro studios and office spaco* Prospects look good.\nAll in all, WNAD is serving moro people than over boforo in tho history of\ntho station. As moro pooplo know about tho station....tho moro listeners and\nloyal boostors thero aro for WAD,"
}