{
  "id": "d1821-1",
  "text": "The fifth application was filed by San Bernardino Valley Joint Union Junior\nCollege District in San Bernardino, California. It calls for Federal expenditures of\n$74,3§6 to improve the operation of channel 24, KCVR-TV. Total cost wofUld be $101,405*\nThe five new applications bring to 38 the number accepted for filing and awaiting\nfurther action. They request a total of $8,l6l,101 in Federal funds.\nADDITIONAL UHF CHANNEL ASSIGNMENTS APPROVED\nBy Supplement to the Third Report and Order in Docket 14229, the FCC acted on\nadditional UHF channel assignments as follows:\nSanta Barbara, California. Reserved Channel 20 (now commercial) for educational\nuse. Already has UHF commercial Channel 26.\nSan Diego, California. Continued assignment of Channels 39 and 51 (already has\nChannel *15 for education) but took no action on other proposed UHF assignments there.\nAustin,Texas. Added Channel 42 and modified the construction permit for KTXN to\nspecify operation on that channel instead of Channel 67* latter is retained for Austin\nwhich also has UHF Channels *18 (educational) and 24.\nOlney, Illinois. Reserved its only present channel—l6 (Commercial)--for educational\nuse.\nCleveland, Qhio. Continued to retain Channel *25 for educational use, but took no\naction on other proposed UHF assignments there. Also has UHF Channels 19 and 65.\nPortsmouth, Ohio. Continued to assign Channel 30> but took no action on proposal\nto assign Channel *6l (educational) there.\nHanover, New Hampshire. Added Channel 49 (making it also available to nearby\nLebanon)*Hanover already has Channel *20 (educational).\nRutland, Vermont. Substituted Channel *75 for Channel *49 (educational) and\nadded Channel 8l.\nThese actions are in accordance with the Commission’s announced intention to adopt\ncertain assignments in the proposed UHF channel assignment table which will expedite the\ninauguration of new UHF service without impairing the adoption of the overall assignment\nplan.\nOTHER FCC ACTIONS (RADIO AND TELEVISION)\nLicense to cover construction permit which authorized changes to antenna-transmitter\nlocation, ERP, HAAT, TPO, antenna system, and install new transmitter and antenna at the\nUniversity of the Ricific in Stockton, California.\nLicense to cover construction permit which authorized installing new transmitter\nand new antenna and changes to ERP and TPO at Michigan State University cf Agriculture and\nApplied Science, East Iansing, Michigan.\nLicense to cover construction permit which authorized a new non-commercial educa¬\ntional FM broadcast station at the University of North Carolina at Greensboro.\nGranted CP for a new non-commercial educational TV station to operate on Channel\n*17; ERP 23.8 kw visual, and 11.9 kw aural; antenna height 490 feet, to Twin City Area\nEducational Television Corporation, St. Flaul, Minnesota.\nPetition by South Central Educational Broadcasting Council to request amendment of\nrules to delete reservation on channel 65 and make channel 33 educational in Harrisburg,\nPennsylvania."
}