{
  "id": "d1709-1",
  "text": "-2-\nof any project and defines certain terms. The law gives authority to The Secretary to\nestablish priorities for grant approvals and to make necessary rules and regulations.\nIt recognizes the interest of the Federal Communications Commission by providing for\nconsultation and close cooperation. Other provisions deal with record keeping,\nrecapture of grant funds in case of discontinuance of education use and similar admin¬\nistrative procedure.\nIt is now anticipated that rules and application forms, together with an information\nbrochure, will be issued by early fall, and that grant applications will be accepted\nshortly thereafter as funds become available.\nTypical of the many questions which must be dealt with in the regulations are these:\n1) What will be the effective date after which a project shall be considered as eligible\nfor matching funds,? and 2) what are the specific types of project and items of trans¬\nmission equipment which will be eligible for grant support? While neither of these\nquestions can be finally answered at this time, some general statements can be made.\nFirst, it seems clear that the Department could not be responsible for commitments\nmade in advance of any project grant approval. The law, in setting forth the 25 percent\ncredit provision, states that it applies to “equipment owned by the applicant on the date\non which it files such application.” This seems to indicate that the date of filing is the\nfirst date which could be considered for the initiation of a project.\nEven using this date, however, can create serious problems for an applicant as well\nas for the Department. A project initiated after the date of filing, but before the final\napproval of the project application, would be initiated at the risk of disapproval or\nmodification at the time of final determination. If, for example, an applicant filed for\nsupport in the purchase of a transmitter, and proceeded to install that transmitter in\nexpectation of up tb a 5 0 percent matching grant, it would tend to prejudice the freedom\nof the Department in considering the merit of the project. For example, if the Department,\nin its final decision, determined that a transmitter of higher power would be required for\na more satisfactory project, the applicant would have a transmitter but no matching grant.\nIn order to minimize the risk to the applicant, therefore, and to permit the Department\nto make judgments without the pressures of accomplished fact, it would seem wisest to\ninclude as a part of a project only those acquisitions and installations made subsequent\nto final project approval by the Department.\nWhile it is true that such an approach may lead to some delays in development of\nnew projects, the necessity of protecting a Federal investment and the importance of\nreducing the risk of the applicant in purchasing and installing equipment which might\nnot receive project approval require a businesslike approach. It is not believed that\nthe delays which may be encountered between filing and approval will be significant\nenough to offset the necessity for sound financial policy. If, for good reason, it is\nnecessary for an applicant to contract for the purchase of equipment before the project\ngrant application is approved, the applicant should make certain that the contract\ncontains a provision that the applicant will not be obligated to purchase in the event\nthat his application is disapproved in whole or in part.\nThe second question, as to what constitutes a project, is also difficult to comment\nupon in the absence of specific determinations. Generally speaking, projects must be\nrelated to the operation of a noncommercial educational broadcast station, and must\nsatisfy the general criteria of serving the greatest number of people in the greatest\n^number of areas, and be adaptable to the broadest educational use. In the case of a"
}