{
  "id": "d1709-3",
  "text": "-4-\ncooperate in “expediting as much as possible the construction of additional educa¬\ntional television broadcasting facilities.” Rather, the Department encourages the\ndevelopment of good plans which will help avoid duplications and conflicts within\nStates with resulting delays and confusion. The existence of regional plans, too,\nwill present still another source of information which will be useful in evaluating\napplications. These plans may be particularly helpful in assessing situations where\nservice across State lines is contemplated, or where several inter-State jurisdictions\nare contemplating joint efforts .\nWhile the Department is very much concerned with encouraging this kind of planning,\nhowever, it will of necessity consider applications individually and on their individual\nmerits , as the law provides .\nThere are several areas in which prospective applicants can be working now, in\nanticipation of applying for matching grants. In those States which have ETV agencies,\npreliminary discussions concerning procedures might well be taking place, and coordin¬\nation of activities in every State would be productive at this time.\nMany prospective applicants will find it necessary to file with the Federal Communi¬\ncations Commission requests for channel reservation, construction permit, or modification.\nSome of this work could be instituted now. Discussion with the Commission, with equip¬\nment manufacturers, and with local persons interested in a project could be useful.\nConsulting engineers and legal services will be necessary in many instances, and these\ndetails could well be explored in advance of preparation of a project grant application.\nThe applicant must assure The Secretary that matching funds will be available, and\nthe necessary funds to “construct, operate, and maintain” the facilities will be available\nwhen needed. It is the intention of the Department to require fairly detailed information\nconcerning the financial structure of the construction and operation of the station, and\nprospective applicants should begin now to develop financial plans in the form of con¬\nstruction and operating budgets that would be helpful in determining the ability of the\napplicant to comply with the requirements of law. Applicants who expect to qualify for\nthe 25 percent credit for equipment presently owned should be sure that their inventories\nand financial records concerning this equipment are accurate and current.\nThe applicant should also be prepared to demonstrate that he has made arrangements\nto serve the “broadest educational uses,” and it would be desirable for the applicant to\nsecure agreement from the educational and cultural organizations in the area proposed to\nbe served that, they will participate. (This would include colleges, school systems or\ndistricts, museums, art galleries, etc .)\nViews and comments on the legislation and its implementation are most welcome, and\nwill be of considerable assistance in developing regulations . Questions raised by people\nin the field, even if they cannot be answered at this point, will be helpful in determining\nproblem areas which must be treated in the regulations.\nInquiries and comments should be addressed to:\nDr. John W. Bystrom\nAssistant to the Secretary (Educational Television)\nOffice of the Secretary\nDepartment of Health, Education, and Welfare\nWashington 25, D.C."
}