{
  "id": "d1522-10",
  "text": "7\nthe Thursday audiences; but only repeat versions of two of the plays placed among\nthose programs liked most by the viewer panel.\nTwo of the four programs liked least by the viewer panel composed the entire\ncategory of programs devoted to the dance on BBC TV. The only two programs devoted\nto serious music ranked in the least-liked 19.\nAmerican TV News Faster Than BBC. When Not on Motion Picture Film\nChapter X contains detailed results of a special study of BBC television news¬\nreel programs shown during August 12-25, 1953.\nA rough comparison of BBC television newsreel programs during August 12-25,\n1953, with stories telecast on the CBS ”Doug Edwards Show11 during the same time\nperiod indicates that coverage of world events without movie film was faster on the\nAmerican program. The format of the BBC television newsreel was so designed that\nthe entire program had to be on movie film. The announcer was never seen. Taking\ngeographical factors into consideration, movie film coverage speed of both news\nprograms was about on par.\nBBC Television News Paid Most Attention to British Isles:\nStories Made No Unfavorable Mentions of the United States\nThe analysis of items on BBC television’s newsreels showed no direct or indirect\nunfavorable references to the United States during the two-week period. The United\nStates was of primary importance in two stories; of secondary importance in three;\nand of passing interest in seven stories—all out of a total of 80 unrepeated news\nstories. The British Isles were of primary importance in 46 stories; of secondary\nimportance in 11; and of passing interest in three stories. Other foreign lands\noutside the British Isles and the United States (including members of the British\nCommonwealth) were of primary importance in 33 stories; of secondary importance in\nseven; and of passing interest in 12 stories.\nThere was no one available in the United States to evaluate news stories on\nthe ’’Doug Edwards Show,” during August 12-25, in terms of the importance of geo¬\ngraphical areas."
}