{
  "id": "d1522-12",
  "text": "9.\n2. Only the writer was available to make the viewing study and tabulate the\ndata. He could not check his classifications of BBC television programs with other\nmonitors. This limitation was explained in Chapter III.\nBritish Television. Past and Present\nBy the end of 1953 television in Britain had reached a crossroad. There were\ntwo—possibly three—alternative roads to follow, but there had to be a choice.^\nOne road meant continuing the then current low annual license charge for operating\nreceiving sets ($5.60 for sound radio and television combined) and keeping programs\nmuch as they were, for a little over five hours a day on one channel; there could be\nsome future expansion, but it would have to be slow because of limited finances. The\nsecond choice, a variation of the first one, also meant sticking with the BBC. Great\nBritain could have an expanded non-commercial television service within the next few\nyears, but the yearly license fee would have to be higher (perhaps $8.40 or $11.20\nper set). The alternative to these choices meant at least a partial element of\ncommercial competition in television, although the BBC's TV service might be retained\nalso. The Conservative Government chose this last alternative, against the wishes\nof the Labor Party and against the wishes of some of its own Party members. How\nsoon the Conservative Government could implement its television plans depended on\ndecisions by Parliament (pending in the spring of 1954) and on the nation s ability\nto pay for television expansion. Chapters I and II bring the television situation up\nto the end of 1953*\nContent Analysis Summary\nThe following points are summarized from the content analysis portion of this\nthesis (Chapters IV-VIl):\n1. Programs took more time on each of the seven New York stations for an\nobservation week in 1953 than on BBC television. The average New York station was\non the air over twice as long as the BBC, if content analysis periods are represen¬\ntative of the entire year.\n2. New York television had smaller percentages of many kinds of programs than\ndid the BBC, but this does not tell the whole story. The actual times taken by\nNew York programs were often greater because the total program time of all New York\nstations was much the greater. Though there was some duplication from station to\nstation, the New York viewer could see more hours of programs in almost every\ncategory than could the British viewer.\n3. Just the same, a slightly smaller proportion of BBC programs were enter¬\ntainment-type than were New fork programs. Slightly larger percentages of BBC pro-\ngrams were information-type and orientation-type.\n4. Scheduled BBC television transmission periods were usually from 3 to 4,\n5 to 6, and 8 to 10:30 p.m. (The first afternoon transmission period was left out\non Sundays,) but they were frequently varied to suit day-to-day circumstances and to\nallow for special events (like the cricket Test match). Schedules for each day w©^e\nprinted in the newspapers and in Radio Timep, a weekly magazine published by the BBC.\n5. BBC television programs were not required to fit into rigid time limits as\nwere New York programs. There were no interruptions in programs for station"
}