{
  "id": "d1522-13",
  "text": "10.\nidentification. Telecasts did not have to fit arbitrarily into quarter-hour, half-\nhour, or hour-long time segments; there was some effort to make them fit roughly\ninto these general limits.\n6. There were no commercials or \"public service announcements\" on BBC tele¬\nvision. Announcements between programs varied considerably in length. Such announce\nments always concerned the television programs themselves.\n7. BBC-TV transmissions were almost always over by 11 p.m. (when the \"late\nhours\" started). Some of the New York stations stayed on much later.\n8. All British television transmitters carried the same regular program at the\nsame time during the August 12-25 viewing period. There was no alternative channel.\n(Schedules in Radio Times indicate that during other weeks, from time to time, one or\ntwo of the transmitters presented a few regional programs of their own.)\n9. The BBC frequently televised public events, national ceremonies, parades,\nreviews, etc. This gave occasion for a remark: \"It*s easy to find the Queen these\ndays; just follow the * outside broadcast* television cameras.\"\n10. Because most of the BBCfs total television time was logged in the adult\n(evening) hours, the largest percentages of entertainment, information, and orienta¬\ntion-type programs were during these hours.\n11. There was a larger percentage of news reports programs on the BBC than on\nNew York television, but BBC-TV newsreels were repeated as many as two times without\nchange. (See also summary item 2.)\n12. Sports occupied a large share of BBC television time during August 12-25,\n19533 partly because of a cricket Test match. The Corporation*s figures show that\noutside broadcasts of sports events took 13.6 per cent of total program time during\nthe year ending June 30, 1953. Sports broadcasts took 21.0 per cent of all program\ntime during the two weeks in August. (See also item 2.)\n13. The BBC had special daily hour-long transmissions for children and special\nregular programs \"for the very young\" and for deaf children. New York stations were\nless likely to schedule programs for children as a special group of viewers, and\nfor special groups of children.\n111. Programs on the BBC intended for children were pretty well confined to the\nchildren*s hours (usually about 5 to 6 p.m.). Children*s programs were more scattered\non New York television stations.\n15. Children*s hours on both New York and British television had high percen¬\ntages of drama programs; but most drama during New York children* s. hours was inten¬\nded for a general or adult audience. Almost all the BBC drama during children*s\nhours was intended for children.\n16. \"Leisure and Pleasure\" and \"About the Home\" were the titles of series of\nprograms for women frequently found during the BBC afternoon domestic hours (usually\n3 to 3:ii5 or h p.m.). There was a somewhat larger percentage of information con¬\ntent, smaller percentage of entertainment content, on BBC-TV domestic-hour programs\nthan on New York programs shown during the domestic hours."
}