{
  "id": "d1522-14",
  "text": "11.\n17. Drama was a popular kind of entertainment on both television systems. New\nYork TV had a considerably larger share of its evening (adult) hours devoted to drama\nthan did the BBC.\n18. Variety programs were present in about equal proportions on both television\nsystems. Large shares of the New York variety programs were intended for children\nor housewives during the daytime hours. Most of the BBC variety programs were of a\ndifferent sort. With a few exceptions they were presentations of \"music hall\" vaude¬\nville acts during the evening hours for adult viewers.\nSummary of Data on Violence\nThese points summarize the study of violence on British television (Chapter\nVIII):\n1. New York television when studied by Smythe had nearly twice as many acts\nand threats of violence per hour as did the BBC when studied by the writer.\n2. Entertainment-type programs had the most acts and threats of violence per\nhour on both television systems.\n3. Drama was the most violent entertainment-type category on both systems.\nIu Childrens drama was the most violent kind of drama on both television sys¬\ntems, but New York childrens TV drama had more than twice as many acts and threats\nof violence as did BBC childrens drama. This difference was most evident in comedy\ndrama for children.\n£. Twelve of the BBC acts and threats of violence, nearly a quarter of those\nin all British childrens drama programs, happened during one episode of an American\nWestern serial film,\n6. Programs shown during the childrens hours were more violent than programs\nshown in all other time segments on both TV systems. New York children* s-hour pro¬\ngrams were more violent than children*s-hour programs on the BBC.\n7. Human agents caused far more violence than non-human agents on both tele¬\nvision systems, though accidents and acts of animals were responsible for greater\npercentages of the violence on BBC television than on New York TV programs.\n8. As a weapon the gun was less than half as popular in BBC programs as it\nwas in New York television. The club or stick and the whip (on animals) were used\nmore often than the gun for committing BBC acts and threats of violence.\nSummary of Audience Reactions\nThe study of viewer preferences in Britain (Chapter IX) produced the following\ninformation;\n1. The BBC Audience Research Department used \"reaction index\" figures to show\nprogram preferences. These had nothing to do with audience size. They were quali¬\ntative ."
}