{
  "id": "d1522-15",
  "text": "12.\n2. The Department used \"box office\" figures to show the actual viewing audience\nsizes. These had little to do with reactions to programs. The largest audience was\nalways in the evenings. There was no alternative channel for dissatisfied viewers\nto turn to.\n3. All 21 of the most seen programs during the observation period were in the\nevenings. Almost all of these were entertainment type.\nU. All 3h of the least seen programs were in the afternoons. Over half of the\ntime of these programs was information type, and nearly a quarter was orientation\ntype.\n5. Critics and viewers of the BBC all liked cricket,* the popularity of the\nTest match increased as time went on, and as England started to win over Australia.\n6. All but one of the 20 most liked programs were entertainment type; the lead¬\ning ten of the top 20 were telecasts of the cricket Test match.\n7. Programs with the lowest reaction indices (least liked programs) were also\npredominantly entertainment type.\n8. Next to sports, drama accounted for the largest share of the most liked pro¬\ngrams. The drama category took the greatest time of those programs most seen by\nBritish viewers, but variety was close behind.\n9. Drama was also the most frequently disliked type of BBC program. Seven of\nthe 21 least liked programs were drama. Many viewers disliked \"highbrow\" music and\nthe ballet.\n10. Programs seen least by BBC viewers had fewer acts and threats of violence\nper hour than other programs. This may have been because over half of these programs\nwere information type.\n11. Data from the columns of critics writing about BBC television during August\n12-25, 1953, were generally inconclusive. Not enough critics rated each program.\nMany opinions were indefinite.\nSummary About News Programs\nPoints 2 and 11 of the content analysis summary in this chapter should be applied\nto the detailed study of news programs in Chapter X. The information below concerns\nBBC adult and childrens newsreels and the American CBS \"Doug Edwards Show,\" all for\nAugust 12-25, 1953. (The idea was to compare the BBC television newsreel with a typi¬\ncal American network TV news program.)\n1. There were no commentators employed to express their own opinions on BBC-TV\nnews programs,\n2. BBC television newsreels were entirely on motion picture film; the \"Doug\nEdwards Show\" used stills and man-on-camera to supplement and bring up to date its\nmotion picture coverage.\n3. Because it operated under more competitive circumstances, the American pro¬\ngram was faster with the news than the BBC. Both programs had to wait days for mo¬\ntion pictures from remote areas, but American film coverage seemed a little the faster."
}