{
  "id": "d1522-16",
  "text": "13.\nIj.. Both news programs were fastest at filming-*and showing—news events at their\ndoorsteps.\nBoth programs (especially the BBC*s) stressed events local to the home coun¬\ntry.\n6. The \"Doug Edwards Show\" had almost twice as many stories as the BBC-TV news¬\nreel. But BBC stories were longer; the BBC covered more events on movie film. BBC\nfilm stories were generally the longer.\n7. There were more feature stories on film on the British than the U.S. program.\nThe pace of the British television newsreel seemed more leisurely.\n8. A report of the news, sound only, was transmitted nightly over the audio\nportion of BBC television. This lacked the essential element of vision though it\nwas as up to date as radio news.\n9. BBC-TV newsreels made no unfavorable references to the United States, but the\nU.S. was \"a locale of primary importance\" in only two stories out of ten newsreels.\nConclusions\nThe points enumerated above summarize those findings in this study of British\ntelevision that the writer believes are most important. He also believes the results\nthemselves demonstrate the practicality of applying the Smythe content analysis\nmethods to a study of any English-language television system. He experienced no\nunusual difficulties in categorizing most of the programs shown on British television\nduring his viewing period, although he changed some of his classifications after\ntalking with Professor Smythe.\nOne important point of difference between American and British television in¬\nfluenced program content probably profoundly. That was in the nature of the tele¬\nvision systems themselves. Neither system seemed to have all the arguments in its\nfavor.\nNon-commercial British television assumed a policy of planning programs for the\ngood or the benefit of its viewers. Commercial American television assumed that\npeople would watch only what was good and that the most-watched show was in some way\nthe best show. These are oversimplifications, but they illustrate the difference.\nAnother point of difference that affected the two television systems was in the\npreferences of the viewers themselves. Television broadcasts of the cricket Test\nmatch were praised by British viewers. American viewers would have undoubtedly pre¬\nferred baseball to cricket.\nThis difference should not be overemphasized. British versions of American quiz\nprograms were popular on British television, as were American Western films.\nSince British television was not commercial, it was not as greatly concerned\nas American TV with attracting an audience away from competing means of entertain¬\nment. The emphasis was not entirely on \"box office\" or audience size figures.\nBritish viewer reactions were measured by a method that took no account of audience\nsize. These \"qualitative\" reaction figures were used along side quantitative audi¬\nence measurements. Neither kind of data was supreme, and both kinds of data had to\nbe weighed with BBC judgments of what it thought viewers should have."
}