{
  "id": "d1522-17",
  "text": "ili.\nBBC audience ratings were not publicized as such figures are in America. Data\nupon which Chapter IX of this study was for the most part based were intended for\nconfidential use within the Corporation.\nBBC television time could not be bought or sold. There were apparently no\nrules confining programs to rigid time segments measured (and paid for) to the second\nThere we re no announcements on BBC television other than those pertinent to the pro¬\ngrams themselves.\nBritish television apparently did not have all the tried and true methods of\nattracting viewers that U.S. television has been accused of using. There was less\nviolence per hour on British than American television, though both television systems\nseemed to cater to an apparent liking of children for violence. Percentages of time\n(though not actual amounts of time) of programs devoted to ballet, art, and classi¬\ncal music were higher on the BBC than New York television, but research figures in¬\ndicated programs of these types were not among the most popular.\nBritish critics of American television have suggested that the tastes of British\nviewers are somewhat more elevated than the tastes of Americans who watch television.\nThe writer believes he has found evidence that this is not so. Indeed, those pro¬\ngrams most popular among British viewers were variety, drama, and sports offerings,\nthe types of programs most popular in the United States.\nThe BBC could, and did devote a greater proportion of its time than New York\ntelevision to special programs for groups of viewers, often groups who were minori¬\nties of the potential viewing audience. This was especially noticeable with regard\nto programs for children. \"Children*s Television\" was always at £ o*clock, Monday\nthrough Sunday. Also, newsreels, plays, and special events programs were often re¬\npeated for the groups of viewers, usually smaller groups, who did not see them during\ntheir first showings.\nBecause the BBC did not sell its programs to advertisers who needed audiences\nfor their commercial messages, the BBC could experiment with programs that might\nhave had very limited appeal. Information-type programs at times seemed directed\nto relatively small groups of interested people.\nThe goal of each BBC television program was within the content of that program\nitself, not in getting results to a set of accompanying advertisements.\nThe successful BBC television playwright received less money for his efforts\nthan his American counterpart (that is a matter of record), but he apparently enjoyed\ngreater freedom in dealing with his subject matter. Taboos aginst things that might\noffend some viewers were less apparent on the BBC than in American television drama.\nThus, with warnings from the announcer that the children be sent to bed, the BBC in\n19!?3 presented a grotesque, but thrilling, science fiction serial (\"The Quatermass\nExperiment\") that resembled somewhat the Orson Welles broadcast of the 1930*s which\ncaused havoc among U.S. radio listeners. (There was apparently little unfavorable\nreaction to the BBC program.)\nBut aside from all of these things, the New York viewer, by judicious twist¬\ning of his television set dial among seven stations, could find in 1953 more program\nmaterial of practically every kind than the British viewer could find on the BBC. In\naddition, television was available in New York at almost any time of the day. In\nLondon it was available a little over five hours daily."
}