{
  "id": "d1522-18",
  "text": "IS.\nIndividual American stations frequently originated their own television programs\nto suit local audiences. This was not true in Britain. BBC regional television pro¬\ngrams were a rarity. Host of the telecasts originated from London studios and were\ncarried by all British video transmitters.\nUnited States television was considerably better financed than the BBC. Better\nsalaries were the rule. More expensive talent could be hired, and better sets and\nstudio facilities were available. New York and Hollywood added a professional polish\nespecially to variety programs, that was lacking on Bntisn television. This\nence in technique was not generally as evident in drama or information-type programs.\nTradition played an apparent part in British television. The BBC’s traditional,\nand enforced, rule of strict neutrality toward all controversial matters was observed\nA rather evasive traditional way of doing things seemed to set a pattern for BBo\ntelevision. This pattern was in no way like that set by the advertisers who spon¬\nsored American TV programs.\nAnother tradition was \"the British way of life,\" sort of a feeling of patriotism\nthat caused public ceremonies and pagentry to rank among the most popular program\nofferings.\nPartly because of this feeling of tradition, partly because of the lack of com¬\npetition, the whole British television operation—as well as its newsreel programs—\nseemed to proceed at a more leisurely pace than did New York television. (Conclu¬\nsions regarding the newsreels were reached in Chapter IX.) The British television\nexecutive seemed calmer than his American opposite number; his job seemed more secure.\nOpportunities for Future Study\nCommercial television for Britain was approved by Parliament in votes taken\nduring late 1953 and early 19514, although no starting date had been set by the spring\nof 195k. The question arises: \"How will the presence of commercials affect future\nBritish television program content?\" Chapter II of this thesis contains a number of\nDredictions by opponents and supporters of a commercial service; but what will squ¬\nally happen ist be the subject of a future study titled, perhaps, \"British Televisior.\nProgramContent Before and After Commercialization.\" It would also\ncompare British television through an annual survey of programs like Smythe s yearly\nNew York study.\nThe findings of this thesis indicate many factors that should be examined in a\nfuture study. The thesis itself illustrates some difficulties that the person who\nattempts an analysis of British television should be prepared for. io get the| best\npossible results the future analyst should conduct a thorough pre-survey, select th\nmost representative possible viewing period, and make use of trained monitors to\ncheck each other’s program classifications."
}