{
  "id": "d1522-2",
  "text": "A\nINTRODUCTION\nBritish and American television systems in 1953 represented two very different\npatterns of operation, commercial and non-commercial. British TV was the older\nsystem; it had been functioning since 1936, with a long wartime interruption. But\nviewers were still limited to approximately five and one-half hours of programs\ndaily on the single available British Broadcasting Corporation channel. Great\nBritain should get a commercial television network, apart from the non-commercial\nBBC, sometime in 1955.\nThe two chapters presented here are summary portions of an unpublished thesis\ntitled, British Television. August 12-25. 1953. a Content Analysis of Program^.\nAn article based on material from the thesis appears in the Fall 1954 issue of\nJournalism Quarterly (Vol. 31, No. 4). Throughout the two chapters, taken without\nchange from the original manuscript, are references to tables and chapters from the\ncomplete thesis. Copies of the thesis are available from the author or from the\nState University of Iowa Central Library and Journalism Reading Room, Iowa City.\nMethod of Study\nThe approach used in examining BBC television was that of content analysis;\nthe study was planned to parallel in many of its investigations the surveys of\nUnited States TV programs conducted by Professor Dallas W. Smythe for the National\nAssociation of Educational Broadcasters. In classifying program content the writer\nused, for the most part, the same methods employed by Professor Smythe in his 195*2\nand 1953 monitoring studies of New York City television programs.\nSeventeen basic categories of programs were adopted, and the categories were\nsubdivided where necessary. A tabulation attached as an appendix to the two chap¬\nters shows the British program time and percentage for each analysis category with\ncomparable New York television percentage figures. The reader should note that\nNew York program figures are for the winter, while British figures are for summer\nprogramming. Content categories were also divided into three general types or\ngroups according to purpose: entertainment, information,or orientation.\nFollowing Professor Smythe’s methods the writer listed programs according\nto the ’’time segments” they occupied. These segments were arbitrarily chosen to\nfit presumptive television audiences. Hours from 7 to 11 p.m. each day were termed\n’’adult hours.” Daytime hours from sign-on until 5 p.m., Monday through Friday,\nwere termed ’’domestic hours,” signifying an audience composed largely of house¬\nwives. Hours from 5 to 7 p.m., Monday through Friday, and from sign-on until 7\np.m., Saturday and Sunday, became ’’children’s hours.” Hours after 11 p.m. each\nday were termed ’’late hours.”\nThe writer measured violence on television by counting acts and threats in\nprograms of classes other than sports, news, weather, public issues, and public\nevents. Identification of the agents and means of violence were also determined.\n1. Dallas W. Smythe, Three Years of New York Television, 1951-1953, January &rlO\nand New York Television. January 4-1Q, 1951, 1952."
}