{
  "id": "d1522-4",
  "text": "Chapter IV\nSUMMARY OF STUDY OF BRITISH TELEVISION PROGRAMS\nGeneral findings for the August 12-25, 1953, BBC television content analysis\nare here reported under their respective subheadings. Comparisons with New York\ntelevision programs, where listed, are from Smythe’s 1952 and 1953 studies. This\nchapter introduces five chapters of specific data which follow it. The reader who\nwishes to explore more thoroughly any of the material in this chapter may refer to\nthe appropriate subject later on. Tables showing information summarized in this\nchapter are distributed throughout the five chapters.\nTable I, p. 60, defines the subject matter categories used by the writer in\nhis content analysis. Other necessary definitions are in the preceding chapter.\nQuantity of BBC Television Far Lower Than New York Programs;\nMost Time in the Adult Hours\nA total of 76.8 hours of scheduled air time was clocked for BBC television\nprograms during the two-week analysis period, an average of 3^.4 hours per week.\nOnly two New York stations studied by Smythe for one week (January 4-10, 1953)\nwere each on the air for less than twice that time. In one week 651.7 hours of ^\nTV programming were observable on New York!s seven stations. The BBC’s television\nservice was on the air with scheduled programs a little more than one-seventeenth\nthat time per week during the test period.\nThe greatest proportion of British television program time was in the adult\nhours. Forty and seven-tenths hours of programs, over half the two-week total,\nwere broadcast during that period. The adult-hour transmission usually started\nat about 8 o’clock and continued to 10;30 or 11. It was longer on Saturday nights.\nThe children’s hours came in for the next greatest portion of BBC television\ntime. They contained 17.5 hours of programs during the two weeks. The first week\naccounted for the larger share of children’s-hour viewing time partly because a\ngreater amount of sports (cricket) programs were telecast during that week than\nduring the second. Domestic-hour programs took the third greatest amount of time,\n16.8 hours for the two weeks. The late hours were least used for BBC telecasts;\nthey contained less than half an hour of scheduled TV programs for the entire\nobservation period.\nOn New York television during a week in January Smythe’s monitors viewed\n196.0 hours of adult-hour programs. New York domestic-hour programs took 218.2\nhours. Children*s-hour programs were third, with 170.4 hours for the single week.\nLate-hour programs on New York television took 67.2 hours during the January week.\nA total of 4.8 more program hours were clocked for the first week of the BBC\nsample period than for the second. Part of this can be attributed to a 2.7 hour\ngreater amount of spectator sports programs during that week."
}