{
  "id": "d1522-5",
  "text": "2.\nMost Programs Entertainment Type; However, Percentage Not\nas High as for New York\nLike New York television programs, TV programs on the BBC were predominantly\nentertainment. However, the percentage was not as high. Entertainment got 77.7\nper cent of New York time, but 64.9 per cent of BBC time was classed in this\ngeneral category. Entertainment-type program percentages were almost equally\ndistributed over the two weeks of the analysis period, but the first week contained\n2.3 hours more of entertainment program time than did the second.\nInformation-type programs were also concentrated more in the first week of\nBBC survey time than in the second. There were 2.5 more hours in the first week.\nPart of this was due to a preponderance of children’s information and instruction\nprograms during the initial seven-day period. Information-type programs took\n26.2 per cent of the BBC's TV time; Smythe’s New York figure is less than this,\n16.8 per cent.\nOrientation-type programs were about equal in television time for each of.\nthe two BBC weeks. They accounted for 8.9 per cent of the program minutes during\nthe entire study period. The figure for New York stations was 5.5 per cent.\nDram** Programs Took Quarter of Scheduled Time\nDrama programs took more time than those in any other class during the BBC\nviewing period, 24.5 per cent of all TV time. There were over two hours more of\ndrama in the second week than in the first. The total percentage was considerably\nless than the New York TV figure, 47 per cent of all time. Drama aimed at the\ngeneral audience took 16.8 per cent of total British program time; the January\n1953 New York figure was 43 per cent. BBC television showed a larger percentage\nof children's drama programs than was reported on New York TV, 7.7 per cent of\ntotal program time compared to 3*9 per cent.\nComedy drama stood first in time as a sub-class of all BBC drama programs,\nreceiving (for both children and adults) 5.4 per cent of all time. The New York\nfigure for comedy drama was 6.0 per cent (also for both children and adults).\nThe second sub-class on the BBC was domestic drama, with 4.6 per cent of program\ntime; this category occupied 6.0 per cent of the New York time. Crime drama,\nthe leading New York drama sub-class with 15.3 per cent, rated 4.2 per cent of\nBBC program time.\nSpectator sports won a two-week total of 18.5 per cent of BBC television\nviewing time. (Outside broadcasts of sporting events took 13.6 per cent of the\ntime of BBC television during the year ending March 31, 1953.) As was previously\nnoted, this extra-large total was partly due to the telecasting of a cricket Test\nmatch. Two and seven-tenths more hours of spectator sports were shown during the\nfirst week than during the second week. The New York figure for spectator sports\nwas 5.3 per cent of total time.\nVariety programs were about as popular, percentage-wise, on August BBC\ntelevision as on January New York TV. The BBC figure was 12.4 per cent; that for\nNew York, 11.8 per cent. Domestic variety which occupied 4.9 per cent of total\nNew York time was entirely absent from the BBC; general variety programs for adults\ntook 11.1 per cent of the BBC time. Programs classified as quiz, stunts, and con¬\ntests took 5.3 per cent of New York time, 2.2 per cent of time on the BBC."
}