{
  "id": "d1522-6",
  "text": "3.\nNews Dominated Information-Type Programs\nNews of all types (including sports news and interviews) got the most time of\nBBC information-type programs, a somewhat larger share than news received in New\nYork. The BBC figure was 13.1 per cent of all scheduled program time; that for New\nYork, 7,9 per cent. This was partly caused by the BBC practice of repeating news¬\nreel programs. The five Monday-through-Friday newsreels and the weekly childrens\nnewsreel were all repeated at least once; many were repeated twice. A composite\nprogram each Saturday evening featured the week’s adult newsreels.\nGeneral information-type programs occupied 6,4 per cent of all BBC scheduled\ntime; the New York figure was 2.4 per cent. Listed under this category were science,,\ntravelogue, and miscellaneous documentary material. Domestic information, which\noccupied 5.4 per cent of all New York program time, took 3*5 per cent of the time\non the BBC. During the observation period there were no BBC television programs on\ncooking or personal care. Cooking programs took 2.8 per cent of all New York time;\nprograms on personal care took 0.8 per cent.\nPublic Events Led BBC Orientation-Type Listings\nPublic events led BBC orientation-type program listings with a total of 4.2\nper cent of the time of the entire August 12-25 viewing period. In the week of\nJanuary 4-10, 1953, there were no public events programs on New York television.\nAn hour and a quarter of the BBC public events programs were telerecordings of pre¬\nvious public events. Public issues on the BBC received 1.7 per cent; the New York\npercentage was 1.5. Religion was the largest class of orientation-type programming\nfor New York, with 1.7 per cent, but it got only 0.3 per cent of time on the BBC.\n(The Corporation’s figure for television time devoted to religion in the year\nending March 31, 1953, was 1.0 per cent.) Pre-school entertainment took 2 per cent\nof the total BBC scheduled time, only 0.5 per cent of the time on New York tele¬\nvision.\nDrama Was Biggest Category in the Adult Hours\nAfter examining the various kinds of programs distributed throughout the con¬\ntent analysis viewing period (See above and Chapter V), the writer studied what\nprogram types fell into each of the four time segments of the day. This informa¬\ntion is presented in Chapters VI and VII; it is summarized below.\nDrama took a greater portion of adult-hour viewing time than did programs in\nany other class. The BBC August figure was 28.0 per cent; this was considerably\nsmaller than the figure of 50.3 per cent of all adult-hour viewing time assigned\nto drama on January New York television. The second biggest adult-hour program\ncategory on the BBC was variety, with 22.0 per cent, compared to 7.4 per cent of\nNew York television adult-hour viewing time. The BBC had more adult-hour drama\nprograms during the second week than during the first, more variety programs during\nthe first week than the second.\nNews (including sports news and interviews) was the third largest adult-hour\nprogram category on the BBC, claiming a two-week average of 13.7 per cent; the New\nYork figure was 6.4 per cent. General information had 6.5 per cent of time on the\nBBC, 2.2 per cent on New York television. Public events programs, all during the\nsecond week of the analysis period, contributed 4.1 per cent of the BBC adult-hour\ntotal."
}