{
  "id": "d1522-7",
  "text": "4.\nSpectator Sports Was Biggest Domestic-Hour Category\nSpectator sports (the cricket Test match) got the greatest amount of time dur¬\ning BBC television domestic hours. The two-week average was 36.7 per cent; sports\nnews had 4*3 per cent of the domestic-hour time. The January 4-10, 1953, New York\ndomestic-hour sports average was 0.2 per cent. Drama had 32.8 per cent of the New\nYork domestic-hour program time, but the BBC figure was 7.5 per cent, representing\na single feature-length .American movie shown during the second week. Eleven and\nsix-tenths per cent of the BBC domestic-hour scheduled program time was devoted to\nrepeats of newsreel programs. News occupied 7.5 per cent of domestic-hour New York\ntime. Domestic information claimed 13.5 per cent of domestic-hour time on the BBC,\n12.7 per cent of this time on New York TV. Pre-school entertainment counted for\n9.1 per cent of BBC domestic-hour timej the New York figure was 1.1 per cent.\nChildren* s Drama Biggest Children* s-Kour Class\nDrama, almost entirely children*s drama, was the largest content category during\nthe children's hours on BBC television, amounting to 33.2 per cent; drama claimed\n57.3 per cent of New York children*s-hour TV program time, but Smythe's 1953 survey\nstates that most of this was drama intended for a general audience, not specifically\nfor children. Spectator sports (partly the Test match) took 30.0 per cent of BBC\nchildren's hour time; most of this was during the first week. The New York sports\nfigure was 1.5 per cent. Sports news took 5.3 per cent of BBC children's hours;\nthe New York percentage was 2.1.\nChildren's information and instruction programs had the third highest percentage\nof time during BBC children's hours, a total of 10.6 per cent. The January 4-10 New\nYork figure was 2.0 per cent. Public events programs took a total of 8.4 per cent\nof children's hour time on the BBC, no time at all on New York television. On the\nother hand programs classed under religion had 4 per cent of New York children's\nhour time, no time on the BBC during children's hours.\nWeather programs (regularly shown at the end of each evening's television\nthroughout the viewing period) claimed more of the small late-hour BBC time than\ndid programs in any other category. New York late-hour viewing (a much longer time)\nwas dominated by drama programs.\nOver Half of BBC Entertainment Programs in Adult Hours\nEntertainment time for BBC television, August 12-25, 1953 > was centered mainly\nin the adult hours; the same was true of New York television, though the percentage\nwas not as large (32.9 compared with 58.2 per cent). Due to the fact that evening\nprograms took most of the BBC's television transmission time, the adult hours also\nhad the largest shares of information and orientation-type programs. The center of\ngravity for information-type programs on New York television was the domestic hours;\nthe greatest amount of New York orientation-type program time was in the children's\nhours.\nA larger percentage of BBC children's programs was in the children's hours than\nwas true of New York television (74.0 per cent compared to 59.4 per cent). Domestic\nprograms were more-or-less concentrated in the domestic hours on both British and\nNew York television. General audience programs were mainly in the BBC's adult\nhours, although a large amount of sports programming was found in domestic and"
}