{
  "id": "d1522-8",
  "text": "5.\nchildren’s time segments. A larger percentage of sports programs was in the domestic\nhours than in any other time division.\nThere was no variety programming in the BBC’s domestic hours, though nearly\nhalf of New York television variety program time was in these hours. Over 95 per\ncent of BBC variety program time was in the adult hours. BBC adult hours also\naccounted for 61.8 per cent of drama time; the New York figure was 32.2 per cent.\nThese hours contained 87.5 per cent of the BBC’s music programming. Music program\ntime was concentrated more in the domestic hours on New York television.\nMore Violence on New York TV Than BBC\nData concerning acts and threats of violence are presented in detail in\nChapter VIII.\nIt is difficult to judge the significance of an act or threat of violence, how\nharmful (if at all) it would be to a given member of a given audience. The writer\nhas only attempted to count the acts and threats in certain program classes. He\ncounted 89 acts and 67 threats during the two weeks of BBC television programs. The\naverage number per hour was 3.3; the New York January average as determined by Smythe\nwas about twice as large, 6.2. The New York figure was based on a count of 3,421\nacts and threats of violence over many more program hours than were on the BBC.\nNearly 85 per cent of all acts and threats of violence on BBC television were\nin entertainment-type programs; the average was per hour. The New York per-hour\nfigure for entertainment-type programs was 7.1 acts and threats. Drama averaged\n6.0 acts and threats per hour on BBC television, 9.7 acts and threats for New York.\nDrama for children contained more acts and threats of violence per hour than any\nother program class on both BBC and New York television, 10.1 for the BBC and 22.4\nfor New York television. A single episode of western drama (part of an old American\nWild West serial) lasting 16.5 minutes was the British program most saturated with\nviolence. In it there were 12 acts and threats. BBC comedy drama contained 31\nacts and threats of violence; the total for crime drama was 29. New York crime drama\nwas slightly more saturated with violence than was crime drama on the BBC; however,\nthe BBC’s comedy drama was the more saturated with violence.\nHuman Agents Caused Most Violence\nHuman agents caused three-quarters of the acts and threats of violence during\nthe August 12-25 BBC viewing period; the January New York figure was 88 per cent.\nThe whip, the club, and the gun were the most popular weapons used on the BBC;\n\"weaponless” use of the hand or foot was also popular. There were no acts of\nviolence (though there were threats) on the BBC involving military action, use of a\nrope, legal process, or force of nature. Accidents accounted for most of the BBC\nviolence caused by non-human agents; and falls were the most common accidents. Acts\nof animals were responsible for a much larger percentage of violence on the BBC\nthan on New York television. There were more verbal threats than threats caused by\nany other single means on both BBC and New York television programs."
}