{
  "id": "d1522-9",
  "text": "6.\nBoth the Viewers and the Critics Liked Cricket: Drama, Variety Rated High\nChapter IX contains a detailed breakdown of viewer reactions to BBC television\nprograms during August 12-25, 1953-\nFindings from analysis of the preferences of critics during the two-week BBC\nviewing period were inconclusive, mainly because not enough critics commented\nspecifically on most of the programs to enable their judgements to be tabulated.\nThe cricket Test match telecasts were given top ratings by the most critics and were\nmost liked by the BBC's own panel of viewers. The cricket telecasts were not among\nthe programs most widely seen by the BBC viewing audience; they were presented dur¬\ning the afternoon hours when the audience was smaller than during the evenings.\nTwo half-hour episodes of an adult evening science fiction thriller rated high\nwith the critics and were among the programs most seen by the viewing public. (They\nwere among the programs most saturated with violence, also.) A play classified as\ncrime drama (also one of the more violent programs) was also among the programs\nmost liked by the critics and most seen by the public.\nThe 21 programs on BBC television most seen by adult viewers contained nearly\nthree times as much violence per hour as the 22 least seen programs. But even this\nfigure, 3.2 acts and threats per hour, was slightly below the over-all BBC average.\nThe 20 programs liked best by the BBC panel of viewers had the same average as all\nBBC television programs together, 3-3 acts and threats per hour; the 21 programs\nliked least had a very slightly higher saturation with violence.\nDrama and variety programs rated high among those most seen by the adult\nBritish audience. Many programs in these categories were among those most liked\nby members of the BBC panel; many in the same two categories were among the programs\nleast liked by the panel; but no programs in drama or variety categories were among\nthose seen least*\nThe Most Viewers Watched Saturday Nights: Sunday Nights\nWere Second\nPrograms Saturday nights during the BBC viewing period captured the largest\nadult audiences; second most popular were Sunday evening programs. All of the 22\nprograms least seen by adults were televised during the daylight hours. Most of\nthem were shown during domestic—hour viewing time. All six programs classified as\npre-school entertainment during the two weeks were among those least seen by adult\nviewers. General and domestic information programs and repeats of newsreels were\nalso frequently among the least seen.\nSix of the 21 BBC programs most seen by adult viewers were on Saturday nights;\nthe top three most-seen programs were Saturday nights. The top ten most-liked\nprograms by the BBC viewer panel were all portions of the cricket Test match, which\nlasted four days. Viewers liked the Test match telecasts better and better as the\nevent continued from day to day (and apparently as England's hopes of winning\nimproved)• Three other programs connected with the Test match also were among those\nmost liked by the panel.\nDuring the study period the BBC produced a major play each Sunday evening, then\n^ropeatedJi^ on Thursday. Sunday audiences for the plays were somewhat larger than"
}