{
  "id": "d385-134",
  "text": "Skornia -2.\nbe demanded in that culture. In the same way we could\npredict the exact means by which Algebra or Literature\nwould have to be taught, and how long before saturation\nby such means would require a shift to other media\nin order to achieve the same ends. This may sound like\ndeterminism. It is not. Determinism is the result of\nsubliminal control. You may have noticed on ny chart\nthat the upper left HD corner contains not only the con¬\nscious elements in media, but the individual ones.\nThe lower right ID comer contains the subliminal and\ngroup characteristics of media. I did not plan it this\nway. It just turns out that the subliminal characteris¬\ntics are group dynamics. Consciousness will always be\nthe area of the individual and freedom, but of course\nmost of those who talk about such things may be merely\nsubliminally misguided people. Is it not strange that\nas we push into the areas of awareness of our own mechan-\nisims people should shrill \"determinism\" when all they\nmean is that thev are becoming conscious of their own\nt mechanism, that Consciousness can never Itself be mechanical,\nherefore the more consciousness the less mechanism. Thus\nhe whole of the educational enterprise may pass into ESP\nhands and the only possible consequence would be libera¬\ntion.\nIf there were some means whereby I could learn\nChinese as completely and unconsciously as the two year\nold knows Chinese, would I not be an enormously freer\nperson in relation to the people and culture of this\nplanet? Can there be ary cultural or moral value in the\nsheer laboriousness of the act of learning? Is not the\npossession of that learning the goal? And does this posses-\nsion not enable^to associate with people more adequately?\nourselves more adequately? Harry, I assume that\nions of the human spirit are Inexhaustible and also\nthat they are never to be considered to be In a state of flux.\nI would never dream of extending the notion of cultural\nrelativity to any idea of human relativity.\nIf I go down to see Dick Evans, it will mean spending a\ngreat many hours explaining ny media approaches to him, but\nib be verY rewarding for both of us. Also\nWigren^(phonoscopist) is eager to have me visit the\nsetup* but let ask what you yourself had in\nmind as desirable or even urgent in ny visiting Dick? Does\nit concern Walter Stone and Warren Seibert?\ncontinued,"
}