{
  "id": "d385-135",
  "text": "Skornia - 3.\naC\\\nApril 6th we do the teenager and the media video.l5^ 1\nIt is like to make quite a sensation. It will be avail¬\nable for loan to you and others.\nThe Gutenberg video in Detroit will not be made\nbefore the end of April.\nApril 10 to 12 I am at Harvard presenting media\nmatters to David Hiesman^ seminar. I am looking forward\nto meeting Gordon Wilson of MIT at that time who has just\ngot nine million from Ford for Systems Development.\nI have seriously in mind the future of media study as\nbelonging somewhere in such a project. Is it not\nridiculous that people like Norbert Wiener having begun\ncommunications study under electronic auspices should\nhave tumbled Into the subliminal pockets of Gutenberg\ntechnology? Shannon, Schramm and Wiener alike in their\nobsession with information content and codification are\nunconsciously working with the assumptions derived from\nwriting and print; namely, that there Is one medium within\nanother medium, speech within visual code, hence \"content”.\nBut the moment one becomes aware that \"content” is an\nimage derived from our peculiar phonetic culture of live\nspeech within a static visual code, then you can see the\nabsurdity of the content obsession. Where there is only\nat ? t^me* nobody has any trouble with the\nproblem of content* Every moment of content is then\nsimply seen to be a moment of structure. Gestalts have\nno content.\nVery exciting work remains to be done on the play\na^*earning P°ssJkmties resulting from the deliberate\n°f ??? medium within another medium. Unknown to\nMcCracken, this is the key to his Newcastle experiment.\nIn the same way, Harry, a culture within a culture creates\ne^riChes- And this is what happens in\n?£ raPid transition. The inter-play between\nthe old and the new releases floods of insights. Such is\nour own age to-day, by far the greatest of 111 humn ages.\nmy ^ the«fCh JUXtap0SltlOna of culture t0\nrf» „Jt °? Planning. Acceleration equals steerageway.\nafc the “f® sPeed « the currents around you; you\nhave no steerageway at all and, therefore.no port of call.\nHope we can get in some chat soon."
}