{
  "id": "d385-142",
  "text": "A propos of media study:\nMy new Jargon is exceedingly useful as a type of abstrac¬\ntion which separates many of these matters from existing\nverbal association. If I say that the S-C (Subjective Completion)\nis utterly different from the S-C in film, it seems to gain\nmore attention than saying that there is nothing in common\nbetween film and television experience. Panoplied in vast\nlayers of semantic verbiage most people will simply laugh off the\nidea that film and television are not in the least alike in\nimpact or consequences. In the same way I have found, quite\nrecently, that visuals in the way of charts and drawings are\nthe only means of impressing a semi-literate audience. The\nwhole idea of visual order which rose with printing (see\nWalter Ong*s book on Ramus) Harvard University Press, is\none which forbids theordinary literate to grasp any non¬\nvisual ideas. Look at Bertrand Russell^ recent little\nMentor book on The ABC of Relativity in which he analyses\nthe imaginative problems of the ordinary person who is trying\nto cope with non-visual relationships.\nThe moment one abandons the idea that things happen on\na single plane, or in a single time, or in a lineal sequence\n(all of these which took centuries and centuries of phonetic\nalphabet technology to get into the human brain) then there\nis no problem whatever in understanding modern physics. The\nproblem is merely a preliminary brainwashing. Since all\nelectric media are engaged in brainwashing this from our culture,\nmy present strategy is to reveal the type of causation and effects\nwhich we all experience. I have often used the example of\nthe road as a primitive type of communication which first brings\nthe country to the town and as it improves brings the town to\nthe country, then substitutes for the country, then destroys\nthe country, then substitutes for the city and destroys the\ncity, then becomes the country (parkways and throughways) and\nthen becomes the city. In becoming a city 3500 miles long,\nand containing 150 million people, the channel properties\nof the road are transferred from the highway to the airway, and\nthe countryside on each side of the 3500 mile throughway will\nthen return to its primal and pre-road condition.\nThe causation at work in this organizational change is a\ncompound of vehicle and surface; in other words of two media\nnot one, and so with writing and printing, each is two media;\nnamely, a visual code for speech. The precarious relation be¬\ntween the visual code and the spoken word is constantly breaking\ndown, through technological change and I am most interested in\nthe McCracken experiment in which a temporary vulcanizing Job\nis done between speech and visual code by translating them into\ncontinued"
}