{
  "id": "d385-155",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPROJECT IN UNDERSTANDING NEW MEDIA\nAddress reply to:\nMARSHALL McLUHAN\nPROJECT DIRECTOR\n96 Saint Joseph Street\nToronto 5, Ontario, Canada\nMarch 8th, i960.\nDr. Harry J. Skornia,\nNAEB,\n14 Gregory Hall,\nUrbana, Ill.,\nU.S.A.\nDear Harry:\nThe backspln on every pitch, as it were, in American\neducation, culture and entertainment is inherent in the print\ntechnology which began as a new mechanical way of doing the\nold manuscript job. For more than a century the printed book\nwas regarded as merely a cheap manuscript. It was more than\na century before pagination began.\nA basic item concerning writing and printing is that they\nare not one, but two media. Speech presented by visual\ncode. Any shift in either affects both. Thus writing is a\nLow Definition visual code which gave speech the High Definition\nrole, so that people read manuscripts aloud for 3000 years.\nt^ie visua^- c°de the High Definition or ascendancy\nenabling people to read at much higher speed and silently. You\nare aware of the fact that we perform the muscular movements\nof speech while, reading silently. The balance between the\nmedia of speech and visual code is precarious, and speech is always\ntrying to break out of the charmed circle as the history of\npoetry in the past 500 years attests.\nI wanted to draw your attention to the strange dynamic\nwhereby the over-all structure of any medium reverses many of\nT^fr £~^a5£?rlsti2S' 2ependinS on whether the S-I is of High or\n2?finitionm See the enclose<* note on the Poly-antics of\nhafr^H^f«Wao* ^jThe Saine PrinclPle applies to this matter which we\nin indust^ nnrtC?h^e^ng th® enormous educational expansion with¬\nin industry and the defense services. These, taken in relation\nthe sense^of^att1?«L*?hUSir'1\"eS'’ Whl°h are alS0 educational in\n°£ attitude-shaping, represent an expenditure in\nin education irL^n5? than a11 Publl° expenditure\n^£atlon% Xt £as only dawned on me these last few davs\nmeaning of all this is that compulsory education in its\ncontinued..."
}