{
  "id": "d385-156",
  "text": "Skornia -2.\npresent segmental and uniform patterns for the training of the\nnation*s manpower as they say, not only is, but has been for a\nlong time, obsolete. In his Vanishing Adolescent, Friedenberg\nmakes many points that fit perfectly into these discussions #\nHis first major point is that there is a new kind of adult for\nwhich adolescence is not a phase of development, so the teenager has\nsimply abandoned the role of adolescence. His second point is\nthat the teenager is an \"aristocratic\" being whose code involves,\nbasically, courage, loyalty and confidence; ie. tribal men.\nHis third point, child and teenager, alike, can easily buy a\nlarge portion of the adult world on the installment plan. It\nis this third point that brings me to my issue; namely, that the\nteenager is impatiently awaiting his return to the adult world,\nin a multiplicity of serious roles. And this will be done sooner\nor later by the simple means of employing the youngsters over\n10 or 12 and educating them on company time. This would not in¬\nvolve an increase of more than 20$ in the present educational\nbudget of industry. The question of controls, policies, would\nbe no more serious than now, and there would be no lag whatever\nin the use of new media for new educational goals.\nAnd the existing educational establishment could be left in¬\ntact for pre-school and elementary-school effort on traditional lines,\ninstead of dissolving it by the effort to incorporate old media\nto do the new work.\nInstead of uniformity and regimentation of education across\nthe country, industry would automatically decentralize and\npluralize its aims just as it has had to do with its own operations.\nI am not discussing this as an ideal, but as the obviously\nindicated development of the current dynamic factors in the\nsituation. That is to say, Harry, that just as the improve¬\nment in the technology of highways precipitates a series of\nsomersalts and reversals, so in all other aspects of our society.\nIt is easy to see why tribal man chooses to freeze himself into a\nsingle attitude, and that of course is where we are heading.\n„ Accelerated change invokes the gyroscopic or vortex principle\nof rigidity. Also, to high speed change no adjustment is possible.\nbecome spectators only, and must escape into understanding.\nThis may be why the conservative has an advantage in such an age\nof speedy change, and is frequently more radical in his sugges¬\ntions and insights than the progressive who is trying to adjust.\nP£actical progressive, who is trying to make realistic\nadjustments to change exhausts himself in minor matters, and has\nno energy to contemplate the over-all.\ncontinued..."
}