{
  "id": "d385-176",
  "text": ",JL“\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPROJECT IN UNDERSTANDING NEW MEDIA\nAddress reply to:\nMARSHALL McLUHAN\nPROJECT DIRECTOR\n96 Saint Joseph Street\nToronto 5, Ontario, Canada\nFebruary 16th, i960.\nsi\nV'® v\nDr. Harry J. Skornia,\nNAEB,\n14 Gregory Hall,\nUrbana, Ill.\nDear Harry:\nr—\nEnclosed is ny first run of Hypotheses for our\ncommittee, the idea for which came from Warren Seibert.\nAre you familiar with The Organization of Behavior by\nDonald Hebb? The work of Wilder 'fenfield, ’the' Neuro-\nsurgeon seems to be very derivative from him. They are\ncolleagues. At any rate, Hebb’s hypotheses translate at\nonce into media terms. In fact, he Is helpless without\nawareness of the media. He attacks lineality right and\nleft, and insists on field approach.\nLet me spell out a few of the implications of the\nHypotheses here enclosed.\nA propos of No. 2, for example, the effect of any\nmedium depends on what is missing in the medium. Hebb\nsays (p.4; ‘psychology has long been a search for the\nproperty of the stimulus which by itself determines the\nensuing response, at any given stage of learning...”.\nHe is asking the wrong question. If ny hypotheses are\nsound, the response to a stimulus is the filling-in of\nwhat is not there. Of course this is very evident in the\nuse of any particular medium as, for example, telephone\nwhere the low definition (LD) of the auditory image so\nus ln the auditory that there is relative¬\nly little visual completion. In the same way, the LD of the\ntelevision image keeps us so busy completing the visual\nthat our tactual and kinesthetic completion is very small\nas compared with film where the visual definition is high.\nPerhaps make it possible to take a great deal\nH i S56 2” Revision than on film. This would also\n^L^lndiCfe wi?y Pyoces3 is such a salient mode in\nthe completion of the dominant image,\ninyolves us in the over-all action at a\ntotally different level from film.\ncontinued..."
}