{
  "id": "d385-181",
  "text": "SKORNIA - 2.\nis\nThe constant here, human sensorium, the five external\nsenses. Radio and Gramophone are perhaps the only media\nwhose structural impact effect one sense only and each,\ntherefore, require four of the five senses to be filled in\nby the perceiver and this subjective completion will be\nthe more intense because of the highly specialist nature of\nthe structural impact.\nIt might be suggested that, in the case of the photo¬\ngraph, the structural impact is solely visual and that\ntactual and kinesthetic and audio completion are entirely\nleft to the perceiver. It occurs to me, however, that a\nconsiderable degree of kinesthetic impact may be directly\ninvolved in that kind of visual experience. This could\neasily be tested.\nThe advantage of this structural impact vs. subjective\ncompletion way of approaching media is that the five senses\nare typically involved, and only five. Of course, in the\nmatter of subjective completion, it may well be that inhibitions\ncan occur anywhere in the total field and that a whole culture\ncan under the structural impact of one medium be diminished\nor retarded in some area of sensuous completion.\nWarren Seibert suggested to me that this approach to\nthe media offered the possibility of my preparing a variety\nof hypotheses capable of being tested. When we discussed\nthat frequent occurrence of one medium operating within\nanother medium, Warren pointed out at once that this situation\nmight in itself define an area for testing.\nFor example, television in film, film within film,\n=^Pri^ed(-?age in fiim form-> with regard to structural impact\nand subjective completion, offer independent and novel\nforms of experience.\nOne effect of medium within medium is to intensify the\nsense of art form or art convention and, in a way. to\ncreate the illusion of fantasy. But these effectsare con-\n^fo^able 4°*.a high de&ree both ^om an entertainment and\ntesting point of view. The medium of print, for example,\nis a complex case of medium within medium, of audible\nk Yislble c°de which may or may not be the cause\nof literature being felt as separate from \"lifeu Certain! v\nwe would find it less convincing to speak of film and life\ndl° °r Vision and life, or even photo- '\nmprH»y my be* unlike print, these latter\n^^e direct Lpac? MediUm ^ are thUS able t0 “*» a\nO'\ncontinued..."
}