{
  "id": "d385-182",
  "text": "SKORNIA - 3.\nFor example, in The Right to Learn by Glenn McCracken,\nthe 12 year New Castle experiment is based mainly on the\nuse of the book medium within the film medium albeit a\nfilm strip* He claims by this means to have achieved a very\nmuch greater book and print impact on young learners. The\nkinds of impact and the kinds of structural impact even\nin such a change as putting book page on film strip is of\nvery great divergence and suggests the possibility of\ntesting not only what happens to one medium inside another\nmedium (so far as the perceiver is concerned) but of finding\nout which media help which in the teaching and learning\nprocess.\nInstead, therefore, of pursuing a program of Grade XI\nvisits in Detroit, Chicago and New York, Warren suggested\nthat I concentrate in this phase on developing hypotheses\nand visiting the members of the Research Committee in order\nto work out experiments to establish or refute them.\nThis I have already begun to do here with Carl Williams\n(psychology) with whom I have worked for years in media\nstudy.\nIf agreeable therefore to the members of the Committee,\nI shall proceed to frame hypotheses which I shall send\naround to the Committee very soon,preparatory to making\nvisits for further implementation.\nGarry Eckhard from a Chicago agency announces that\naudience study has shifted from program rating and audience\nsegments to the over-all. This is a recognition of field\ndimensions of the electronic situation and the fact that' not\nonly no program, but no medium and nobody has its or his\nmeaning alone.\nOscar Handling recent little book on Dewey, pages 22-23,\nexplains how even vocational training in the later 19th\ncentury was oriented to the past—that is, to disappearing\nhandicrafts rather than to available jobs. We are committing\nexactly this error when we consider the uses of the media\nin relation to the existing class room, curriculum, or\ndisciplines and moreover to turn these new forms to these\nold tasks merely ensures that they will be obliterated in\nexactly the same way as if we were recording on an already\nrecorded tape. That is to say, if there is anything in the\nexisting establishment which we would choose to perpetuate\nit must be done on the old terms. It cannot be done in terms\nof the new forms. The new must be used on their own terms to\ndo things impossible on the old terms e.g. Oppenheimer teaching\nGrade XI, T.S. Eliot teaching Freshman English, or Bertrand\nRussell introducing Philosophy, etc. etc.\nBest regards, pLdM."
}