{
  "id": "d385-211",
  "text": "Skornia - 2\nI am going to make a tape recording of a panel\ndiscussion on media questions to be run entirely by\nthe Grade XI people who have had this four-visit\nrun. Merely to have a tape from a wide diversity of\nschools of the terminal state of mind should prove\nof some use. Do you think that it would also be de¬\nsirable to have a tape of their initial state of\nmind? In a current ETV broadcast which my research\nman Art Knowles observed in a third grade class room,\na peculiar fact occurred in the class reaction.\nThe broadcast invited the class to participate in\nsinging a song, and pre-broadcast instructions had\nurged that the members of the class be supplied with\ntumblers and forks so that they could strike the key\nof the song at various times, when given a que from\nthe monitor. In this class, only one girl had tumbler\nand water and fork, and it happened that whenever the\nsignal came for her to tap her glass, the entire class\nturned to her ignoring the continuing program. What\nstruck Art Knowles was the spontaneity and unanimity\nwith which they turned away from the show. Here is one\nof those aspects of the lines of force, in a given medium,\n(in this case directly concerned with the participational\npower of T.V. ) which is suddenly revealed by an unexpected\nmode of behavior and which I consider to be worth thousands\nof pages of tester material.\nFor example, if the same show were shown to the same\nclass on film, it would be unthinkable to have tumbler\nand fork etc. at all. The film audience is a group of\nisolates. The film invites people to go into themselves,\netc.\nCould you give me Dr. Ruhe»s address. The man at\nthe Kansas City Medical Center? I suddenly bethought me\nthat he must have a good deal of available data on the\ncontrast between film and T.V. in medical and dental teach¬\ning.\nI am enclosing a little sheet which will appear in\nMedia Log III and which concerns the peculiar lines of force\nin the written and the oral modes. Consider, Hariy, that\nwhat we call case histories necessarily have no point-of-view.\nIn the same way, the means by which these case histories are\nobtained the totally permissive” interview is a form of\ndiscourse or dialogue from which point-of-view is systematically\ncontinued"
}