{
  "id": "d385-229",
  "text": "Skomia - 2\nIn fact, like the Colonel, he sees himself and The House\nof Intellect as isolated from all that is going on in the\nworld. He is prepared to sacrifice everything to the\nidol of \"morale”. The Colonel was prepared to build a\nbridge for the sake of the morale of his men which would\ndestroy much larger values.\nI spent two days recently at Encyclopedia Britannica\nFilms at Evanston, Illinois (which incidentally is a dry\ntown). They have acquired the film rights in a large\npercentage of all foreign and American film from the\nbeginning to 1955. Oddly, they have not, or have not\nbeen able, to acquire the television rights. Consequently,\nall these holdings are un-usable even on classroom\nt.v. Their ambition is to tie film study to the Highschool\nEnglish curriculum as a means of large-scale rental of\ntheir holdings. Lou Forsdale gathered a large group\nof those currently engaged in teaching film appreciation\nto consider the possibilities of the whole project for\nHighschools. I think the whole thing is futile. They\nare as much unrelated to the newer media as any bookman.\nThere is, obviously, a close tie-in between the book form\nand the film form.\nThe scripting for film o* kinescope or video tape\nis going ahead quickly. I have just written Dick Evans\nasking him about certain problems. For example, do you\npersonally have any thoughts about how I might get a\njob done very reasonably in the area of graphics and\ngraphic animation? In counterpointing graphic and concrete\nsocial situation (the latter to be done by film clip)\nit will be necessary for each medium to have a fair amount\nof animation. For example, in the matter of the moveable\ntypes of Gutenberg their uniformity, repeatability,\nimmutability, their mobility, in relating these to the rise\nof National power. National armies, uniform public education,\nthe rise of industry, assembly lines, markets and prices,\nto say nothing of the private consequences, these can\nbe shown by animated graphic revelation of structures.\nThe graphic part can be repeated as leit-motiv so need not\nbe nearly as extensive as the concrete illustrations.\nStill, it may prove to be expensive stuff.\nask akout the concrete proposals of demonstration\nand test procedure. I now have the personal contact and\nassurance of several people like Ethel Tincher in Detroit\ncontinued...."
}