{
  "id": "d385-232",
  "text": "DEPARTMENT OF\nHEALTH. EDUCATION, AND WELFARE\n•OFFICE OF EDUCATION\nWASHINGTON 25, D C\n*; I\n,. •>;;\nJanuary II, I960 .\niX\nDr. Harry Skornla, Fresident\nNational Association of\nEducational Broadcasters\n14 Gregory Hall\nUrbana, Illinois\nDear Harry:\nIn accordance with your request for information from tbs project\n#279 f£l«» I as sending the following excerpts from Valter Stona's nemo\nof June 5, 1959. This memo sets forth the understandings which ward\nreached when he negotiated the grant with you. I gather froca our *\ndiscussion of yesterday that these items coincide with your recollection\nof the agreements and hope that they wlllprove helpful in developing the\nfuture course of project action.\nThe excerpts from the memo are as follows:\ni§\nI\nmm\nm\n\"Experimental aspects of this project will Involve the development\nend testing of materials and techniques for utilisation to develop student\ninsight into the nature of media, using both in-class and out-of-elaas |\nexperience. Among possible insights to be gained would be, for\npie, effects of radio on newspaper style; awareness of the changing , |\nstructure and politics resulting from radio utilisation (e.g., fire¬\nside chats); use of radio to create atmosphere of privacy (i.e, by etude\n);\nthe fact that radio Intensifies language Barriers; TV influence om eho:\n' of political candidates (e.g., search for handsomeness); TV roles In\nbypassing literacy to create understanding; development of synthesised\npersonality by TV; Interplay of forms illuminating each other, etc**1\n\".....the investigator recommended that Dr. McLuhsn be givtn ap\nopportunity, in the space of 4 months to develop s suitable plan end\n.procedures for carrying out his project in cooperation with the Research^\nCommittee on the NA&B, and that his salary be guaranteed for one yearVj’ln\nthe event that suitable procedures are developed vfhieb justify cirrylng the l\nproject forward (these are subject to review by the NAXB and tha Office of *|| ?\nEducation personnel), then the project would be funded as indicftted in tha >v I\nattached budget statement. The investigator suggested that the project\nmight be developed*in four stages: (1) preliminary exploration and planning;\n(2) development of materials; (3) experimental utilisation; and (4) final *\nevaluation of preparation of report. This suggested staging teemed gener¬\nally acceptable . It was also agreed that the first two stages of the project"
}