{
  "id": "d385-8",
  "text": "WAYNE STATE UNIVERSITY\n(D\nRADIO AND TELEVISION\nDETROIT 2. MICHIGAN\nMay 26, 1961\nMAY 2 9 1961\n** pi\n7|8|%lp|lX|12|l|2|3|4|5|$\ni\nMr. Harold E. Hill\nAdministrative Vice-President\nNAEB\nDuPont Circle Building\n1364 Connecticut\nWashington, D. C.\nDear Harold:\nEnclosed are verifax copies of correspondence and billing in connec¬\ntion with the making of the kinescope entitled \"Gutenberg Galaxy.\"\nThis, as you remember, was the kine made here a year ago with Pro¬\nfessor Marshall McLuhen.\nThe billing involves the cost of the use of the video tape recorder\nand even the rental of video tape up to the time of the making of\nthe kinescope. This sums up $64.80. The other bill is the actual\nkinescoping costs with a negative and three prints. This amounts to\n$503. The total of both brings this to $567.80. Wayne State pro¬\nvided all in-studio and production costs of the taping and kinescoping.\nConsequently, this entire bill should be payed out of those funds.\nIt is my understanding that of the three prints the following distri¬\nbution was made. One print was for Professor Robert Shafer of the\nCollege of Education here at Wayne State, and the other two were sent\nto the NAEB. I also somehow have the notion that one of those two\nwere given to the Office of Education, but I am not certain. Of\ncourse, the NAEB and the particular funds involved should not pay for\na print for the Professor of Education here at Wayne. He, however,\nsays that the amount of money for his one print was sent to the NAEB\nsometime this past year. Consequently, his funds have already been\nput into the NAEB funds and now the total bill would justifiably come\nfrom this account.\nI realize, with the amount of time that has gone by, that there is a\npossibility that you do not have these funds for that account; and this\nhas me quite concerned. Would you let me know whether or not this bill\ncan be payed from the project grant and if the funds from Professor\nShafer were received in Urbana and also the disposition of the two kine¬\nscopes which were supposedly sent to the NAEB. Please understand my"
}