{
  "id": "d1903-2",
  "text": "-3-\nILLUSTRATION AND THEN LATER FOR REFERENCE AND REVIEW' MATER * A L . The\nPROPOSED USE INCLUDES THE TRANSMISSION OF ILLUSTRATIONS, PICTURES, MAPS,\nAND OUTLINES. The ONLY PROBLEM INVOLVED WILL BE FACILITIES TO TRANSMIT\nMATERIAL FAST ENOUGH TO SUPPLEMENT ALL THE SERVICES THAT WILL 8E USING\nEDUCATIONAL BROADCAST INGo * HE NAEB WILL ENDORSE ANY APPLICATION OF\nFacsimile to FM broadcasting so long as there is no impairment of FM\nAUDIO FIDELITY® ^ANY OF THE NAE8 MEMBERS CONTEMPLATE THE USE OF FAC¬\nSIMILE AS SOON AS STANDARDS ARE SET AND RELIABLE EQUIPMENT IS AVAILABLE®\nTelevision broadcasting offers intimate* flexible* and a timely\nAPPROACH IN EDUCATIONAL PROGRAMMING. Sn THE TRANSMISSION OF CURRENT\nEVENTS ALONE LIES REASON ENOUGH FOR ALL EDUCATIONAL BROADCASTERS TO\nLOOK TO TELEVISION. The ADDITIONAL POSS I B I L I T I E S OF DEMONSTRATION\nLECTURES, VISITS TO POINTS OF EDUCATIONAL INTEREST, AND TELEVISED FIELD\nTRIPS MAKE IT AN INVALUABLE EDUCATIONAL TOOL*\nSeveral members of MAES have pioneered in television broadcasting\nAND FROM THEIR VAST EXPERIENCE IN THIS FIELO THEY HAVE LEARNED THE FOLLY\nOF TRYING TO SET UP AM EXPANDED PROGRAM OF TELEVISION SERVICE UNTIL\nDEFINITE STANDARDS HAVE BEEN SET UP, EDUCATIONAL INSTITUTIONS CANNOT\nSTAND^ THE RAPID OBSOLESCENSE THAT HASTILY DEFINED STANDARDS MIGHT LEAD\nTO. The MEMBERSHIP WILL 8E willing to take up television just as soon\nAS STANDARDS ARE DEFINITELY SET, AND SOON AS MASS PRODUCTION MAKES\nTELEVISION RECEIVING EQUI PMENT WITHIN THE RANGE OF RESTRICTED SCHOOL\nBUDGETS» There is no type of programming that fits television as well\nAS EDUCATIONAL BROADCAST INQ.\nIn THE ALOCATION OF FACILITIES FOR TELEVISION BROADCASTING AND\nRELAY SERVICE, THE NAE8 RECOMMENDS THAT PROVISION BE MADE FOR STATE WIDE\nCOVERAGE FOR EDUCATIONAL ‘BROADCASTERS. OUR ONLY RECOMMENDATION ON THE\nTECHNICAL STANDARDS TO BE ESTABLISHED FOR TELEVISION ARE THAT THEY BE\nFAR-SIGHTED ENOUGH TO MEET THE NEEDS OF HIGH QUALITY TRANSMISSION FOR\nSOME TIME TO COME AND YET FALL WITHIN THE REALM OF PRACTICAL APPLICATION\nIN THE NOT TOO DISTANT FUTURE."
}