{
  "id": "d866-17",
  "text": "-2-\nmay bear upon the study of instructional television and radio.\n(Films, for example, along with slides, overhead projectors,\nchalkboards, et. al., can be used on television, so it is\npossible to see them as related instructional materials that are\ncomplementary and not competitive with television).\nIn its efforts to be technologically ecumenical, the Commission\nstaff has adopted current nomenclature that sees ’’multi-media”\nas an improvement over a single medium, and that sees \"systems\napproaches” as more valid than piecemeal analyses. It would\nbe hard to disagree until the words are examined further. Multi-\nmedia, it turns out, is a way of treating fairly the various\ndevices (and their interest groups) so as not to exclude from\nconsideration any of the new means for innovation in the schools.\nIn the zeal to be fair with all the media, they seem to have been\ntrapped into considering each of equal value. Educational utopia\nwill be achieved, the reasoning goes, when \"each has been afforded\nits proper place\" in the spectrum of materials available to the\nclassroom teacher. In this setting, the \"system approach\" is the\nframework within which decision is made to use one medium over\nanother.\nThere may be a romantic appeal to such argument, but it is\nscientifically naive and educationally without merit. Radio,\ntelevision, and electronic communications were singled out for\nspecial study, not because their value is exclusive, but because\nit ^-s b^sic. Among the resources now available, only electronic\n(which is to say mass) media offer the means by which substantial\nimprovements can be made in managing our educational enterprise?\nthey make it possible to consider educational operation both as\na system composed of different but related components, and as a\ntask which needs to be conducted systematically.\nIn view of both valid and silly criticism that has been made of\nthe Commission's activities, what can we recommend that will\nsatisfy the intent of the legislation and be professionally\nproductive? First comes recognition of the present stage of\ninstructional television and radio’s development. The observations\nand conclusions seem uniform: television and radio have not been\nused to effect comprehensive and substantive changes in educational\nmethodology, educational opportunity, or educational achievement.\nThey have supplemented classroom activities, which are generally\nconsidered to be inadequate and inferior, thereby expecting poor\nsituations to be a good environment for effective use of\npresumably superior instructional material. The extent to which\nthe televised material is less than superior merely accentuates\nthe malpractice."
}