{
  "id": "d866-2",
  "text": "A division of\nNATIONAL ASSOCIA TION OF EDUCATIONAL BROADCASTERS\nPHONE: 667-6000 • 1346 CONNECTICUT AVENUE • WASHINGTON, D.C. 20036\nFebruary 11, 1969\nMEMORANDUM\nTO: Mr. Chalmers H. Marquis\nFROM: Mr. C. Scott Fletcher\nRE: Teaching by Television\nSince the beginning of this year, I have noticed and read with some\nalarm the increasing number of syndicated columns in the newspapers and\ncolumns by local newspaper writers and also articles in various magazines\nconcerning teaching by television.\nLast week I sent you an article which also appeared in the Miami\nHerald written by a Miami Herald writer. I don't know how many other papers\nit appeared in, especially Knight papers. This morning a syndicated column\nappeared in the Miami Herald with a heading \"A Live Teacher Does Better\".\nThe main heading reads \"Teaching Machines are Education's Edsels\". I don't\nknow who Martin L. Gross is or where he lives. I think it would be worth¬\nwhile to have Sally Ehart check into this and I would like to be advised\nabout Mr. Gross.\nI am beginning to wonder if the work of the (Title III) Commission of\nInstructional Technology is not unwittingly stirring up interest among\nwriters about teaching by television. We must not overlook the fact that\nhundreds of people have received letters from the staff of the Commission\nasking for facts, experience, and conclusions about teaching with television\nand radio. I don't know if the staff of the Commission has written to\neducational editors of newspapers and selected magazines but I am sure that\nthe existence of the Commission has aroused the curiosity of people in the\nnewspaper and magazine world who are interested in various aspects of\neducation.\nUnfortunately I have not read a favorable article or column on the\nsubject of teaching by television whether it be a column which is the result\nof a writer interviewing students who have been taught by television or a\ncolumn such as the attached by Martin Gross who states \", . .and the first\nresults are in. The educators--if not the public--are surprised, for the\nprogram has generally proved a failure. . .\" Mr. Gross then goes on to\nquote from various people whom I am sure have received letters from the\nstaff of the Commission."
}