{
  "id": "d866-27",
  "text": "Commission on Instructional Technology\n1424 SIXTEENTH ST., N.W.\nSUITE 203\nWASHINGTON, D. C. 20036\n(202) 265-5577\nSTERLING McMURRIN\nChairman\nSalt Lake City, Utah\nJuly 15, 1968\nDAVID BELL\nNew York, New York\nROALD CAMPBELL\nChicago, Illinois\nMr. Jerrold Sandler\nNational Educational Radio\nC. RAY CARPENTER\nUniversity Park, Pennsylvania\n1346 Connecticut Avenue, N. W.\nNELL EURICH\nPoughkeepsie, New York\nWashington, D. C.\nHAROLD B. GORES\nNew York, New York\nDear Mr. Sandler:\nA. LEON HIGGINBOTHAM, JR.\nPhiladelphia, Pennsylvania\nI am writing to ask for your help in our work.\nKERMIT MORRISSEY\nPittsburgh, Pennsylvania\nAs you probably know, the Secretary of Health, Education and\nWelfare has recently appointed the Commission on Instructional\nKENNETH OBERHOLTZER\nDenver, Colorado\nTechnology as authorized under Title III of the Public Broadcasting\nAct. In his charge to the Commission (see enclosed copy of press\nrelease), U. S. Commissioner of Education Harold Howe II said, \"The\nscope of the Commission's work is wide-ranging. It must consider\nevery aspect of instructional technology and every problem which\nmay arise in its development.\"\nAs a first step in its activities, the Commission wishes to\nobtain views of educators, including media specialists, as well as\nmanufacturers, publishers, and other persons interested in the use\nof television, radio, computers, tapes, and other media for instruc¬\ntional purposes. Because of your important role in education, the\nCommission would be grateful for, and would read with great interest,\na letter incorporating your views and recommendations on instructional\ntechnology, as well as such information on the activities and plans\nof your organization as you feel the Commission might find useful.\nPlease send your reply to the Executive Director of the Study, Mr.\nSidney G. Tickton at the above address, who will arrange for the\nsending of copies to all members of the Commission.\nIt would be most helpful to the Commission if any memoranda or\nreports you submitted contained a short summary of the main points.\nWe would also appreciate it greatly if we could have your reply\nwithin 30 days.\nCordially"
}