{
  "id": "d866-3",
  "text": "-2-\nI forget whether the Commission is to publish its findings on or\nbefore June 30 or complete its study on or before June 30 and publish\nits findings as quickly as possible thereafter. If the report is to be\npublished on or before June 30 then it won't be long before the first\ndraft of the report will be submitted to the members of the Commission.\nSomehow, some way, we should make a special effort to get the facts\nabout the Commission's plans and today--Saturday--I called Bill Harley v\nat home in view of his meeting with Dr. McMurrin on Sunday, February 9„\nI hope that he will be able to have a confidential visit with McMurrin\nalone in order to find out more about the Commission's plans concerning\ntheir report.\nI have just finished talking to Bill Harley at his home and we agreed\nthat this whole subject matter area should receive the attention of all\nmembers of the Executive Staff after we have met during the week of February\n16. It is also my hope that the first meeting on the subject can be done\nduring the week of February 9.\nIt is my great hope that the Commission will stress the need for\nmore evidence through responsible research before specific recommendations\ncan be made about the future use of television and radio for teaching pur¬\nposes. If the Commission's report is unfavorable I am sure that a high\npercentage of superintendents of public schools which are at present using\nthe broadcast services of ETV stations for instruction by television, and\nalso superintendents of public schools which are considering 2500 MHz\noperations and/or cable operations, will think twice before they go further\nwith their plans. I also am sure that many superintendents of public schools\nwhich are using the services of ETV stations will be inclined to consider\nplans for reducing these services. Nearly two years ago I became an active\ndirector of Channel 2 and since I attended the first meeting I have heard\nnothing but discussions by the school board concerning either eliminating\neducational television or turning Channel 2 over to the foundation as a\ncommunity channel. As you know Harold Wigren and several people from NAEB\nhave met with the school board and the members of the foundation board\nabout the programming for Dade County Schools by Channel 2. Because\nseveral school board members, mostly businessmen, became disenchanted with\nteaching by television, it is possible that Channel 2 will become purely a\ncommunity station, and may or may not broadcast instructional programming\nfor the Dade County Public Schools when it does become a community station.\nYou also know that the Dade County School Board owns Channel 17 and is now\nin the process of erecting the first of four 2500 MHz. operations which\nthey will rely on heavily in the future. Because of this experience in\nthe past two years, I am more conscious than many people about the increasing\nnumber of disappointments which are being expressed by educators concerning\nthe use of television for instructional purposes.\nI would emphasize that I am as well versed as many people about the\narguments in favor of using educational television for instructional pur¬\nposes. You have heard me express myself about the proper programming of\ncomputers and programming of television for instructional purposes. I am"
}