{
  "id": "d1774-3",
  "text": "REGION I MEMBERS MEET\nIN NEW YORK CITY\nRegion I members of the NAEB met at the Car¬\nnegie International Center in New York City, Sep¬\ntember 20-21. The meeting focused attention on\nthree main themes: regional live networks for educa¬\ntional radio and television stations; the superinten¬\ndents’ view of in-school television; and international\nexchange of educational television programs, staff,\nand materials.\nRalph Steetle, Executive Director of the JCET,\nrelated the highlights of the progress in educational\nbroadcasting in Region I during the past year. Dr.\nHarry Skornia, Executive Director of the NAEB,\nreported on the national scene. Seymour N. Siegel,\nNew York City Director of Radio Communications,\ndescribed the new live FM educational radio network\nwhich is in the planning stage with only certain\ntechnical problems yet to solve. The network involves\nNew York City, Boston, Albany (New York), and\nSpringfield (Massachusetts). The prospects for live\nregional hookups between educational television\nstations was outlined by Hartford N. Gunn, Jr.,\nGeneral Manager of WGBH-FM and WGBH-TV,\nBoston, Massachusetts, who also explained how such,\nnetworks would strengthen the stations economically\nand improve the quality of program service by the\nregular interchange of the best programs of each.\nThese talks took place during the morning session\non Saturday, September 20.\nThe Saturday afternoon session on in-school tele¬\nvision brought together five prominent Superinten¬\ndents of Schools to discuss the potential for instruc¬\ntional television in the schools. Dr. William M.\nBrish, Hagerstown, Maryland; Dr. Calvin E. Gross,\nPittsburgh; Dr. Maurice U. Ames, Assistant Super¬\nintendent, New York City; Dr. Allan H. Wetter,\nPhiladelphia; Dr. Harold B. Gores, New York City;\nand moderator Dr. Alan Willard Brown, President of\nthe Metropolitan Educational Television Association\nrevealed the amazing successes they had experienced\nwith in-school broadcasting. Transcripts of these\nreports will be nationally distributed to all superin¬\ntendents, financed by a grant offered by George\nProbst of the Thomas Alva Edison Foundation.\nDr. George D. Stoddard, Dean, School of Educa¬\ntion, New York University, addressed the Saturday\ndinner meeting. His subject was “The Lincoln Square\nProject”, with special emphasis on the relation of\nthe project to the educational broadcaster.\nOn Sunday, September 21, Basil Thornton, Ex¬\necutive Director, Broadcasting Foundation of A-\nmerica, outlined several programs for the interchange\nof broadcasting materials and reported on the role\nof the Broadcasting Foundation. Mrs. Dorothy Cul¬\nbertson of NBC reported on a new NBC series in\nteacher training in Physics. The series is produced\nin cooperation with the American Association of Col¬\nleges of Teacher Education. James Armsey explained\nthe role of the Ford Foundation and its interest in\nETV. He freely answered the questions which were\nasked about the Foundation.\nArrangements for the two day meeting were in the\nhands of Martha Gable, Philadelphia; Robert Lesher,\nHagerstown; Ralph Steetle, Washington; Hartford\nN. Gunn, Jr., Boston; and Seymour N. Siegel, Law¬\nrence Creshkoff, and James Macandrew, all of New\nYork, with Arthur Hungerford of META as chair¬\nman.\nMembers of Region I operate educational radio and\nTV stations in the 12 northeastern states: Connecti¬\ncut, Delaware, District of Columbia, Maine, Mary¬\nland, Massachusetts, New Hampshire, New Jersey,\nNew York, Pennsylvania, Rhode Island, and Ver¬\nmont.\nMORE SPEAKERS ANNOUNCED\nFOR NAEB CONVENTION\nThe NAEB Convention in Omaha, October 14 -\n17, will have several well-known men as speakers for\nthe major sessions. The opening session of the con¬\nvention will be held Tuesday, October 14, in the eve¬\nning. Highlighting this meeting will be Dr. Roy M.\nHall, assistant commissioner of education for research\nof the United States Office of Education. Dr. Hall\nis the individual who will be given the responsibility\nof administrating the Hill-Elliott Bill, which is re¬\nproduced in another section of the NEWSLETTER.\nFor the general session Thursday, October 16,\nin the afternoon, the speaker will be Bob Banner.\nMr. Banner was the producer-director of the Dinah\nShore program last season, which won both he and\nMiss Shore “Emmies.” This season he will produce\nand direct the Ginger Rogers program. Mr. Banner’s\nother credits include the Fred Waring program, Gar-\nroway at Large, and Omnibus.\nThe banquet Thursday evening will feature the\nHonorable John S. Cross, commissioner of the Federal\nCommunications Commission.\n—NAEB—\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 14 Gregory Hall,\nUrbana, III. $5 a year, edited by Nancy W'hitmore.\n4\nSee You In Omaha\nNEWSLETTER"
}