{
  "id": "d1774-4",
  "text": "BOX\nSCORE\nTotal\nAM\nStations 3281\n(includes\n39\nn o n-commercial)\nTotal\nFM\nStations 705\n(includes 1\n162\nn o n-commercial)\nTotal\nTV\nStations 586\n(includes\n32\nn o n-commercial)\n44 ATTEND ETV MANAGEMENT SEMINAR\nForty-four ETV managers, consultants and ob¬\nservers attended the second NAEB ETV Manage¬\nment Seminar held at Madison, Wisconsin, August\n24-27, 1958. The meeting, primarily a “work session,”\ngave the managers an opportunity to discuss com¬\nmon problems and hear from consultants on fund\nraising, relations with faculty and other talent, ef¬\nfects of national legislation and legal problems.\nThree members of the board of directors of the\nETRC attended the closing session, giving ETV man¬\nagers their first opportunity to meet and discuss com¬\nmon problems with representatives of the board. The\nboard members attending were Leland Hazard, Pitts¬\nburgh; Raymond Wittcoff, St. Louis; and Richard\nHull, Columbus. Kenneth Yourd, newly named vice-\npresident and treasurer for the ETRC, attended the\nentire seminar.\nThe seminar, made possible by a grant from the\nFord Foundation, was planned by Richard Rider,\nWILL-TV, chairman of the NAEB TV Operations\ncommittee; Harold E. Hill, NAEB Associate Director;\nand' a subcommittee consisting of William Harley,\nWHA-TV; Richard Burdick, WHYY-TV; and Loren\nStone, KCTS. Local arrangements at the University\nof Wisconsin were handled by Harley.\nA brief report of the seminar will be prepared\nby the planning committee and will be distributed to\nthose who attended. It is possible that an oral re¬\nport will also be presented at the forthcoming NAEB\nConvention in Omaha, October 14 - 17.\n—NAEB—\nMEMO FROM THE EXECUTIVE DIRECTOR\n—Harry Skornia\nThe past few weeks have brought numerous sem¬\ninars, workshops and meetings: the Purdue - NAEB\nConference, the NAEB ETV Management Seminar,\nand the Region I NAEB Meeting. Reports on all of\nthese will be found separately in this issue of the\nNEWSLETTER.\nI also attended meetings of the Program Com¬\nmittee of the UNESCO National Commission, Sep¬\ntember 3, and the National Commission itself, Sep¬\ntember 11 and 12. The fine work , of the UNESCO\nNational Commission is so deserving of the support of\nall of us that I could not resist mention of these in¬\nspiring meetings.\nAs we settle down for the fall season, I would like\nto continue with the editorials begun some months\nago. This month I am concerned with the general\nstatus of education in the U. S. and our relation to\nthat status.\nI believe we all realize that the educational\n“crisis” of the U. S. has not been created, but only\nfurther dramatized, by Sputnik and other recent de¬\nvelopments.\nI hope you will all agree with my belief that ed¬\nucation is bigger than radio or television; the latter\nare considered by the NAEB, in its use of them, as\ntools and instruments of both formal and informal\neducation, to be used responsibly, subject to the\nhighest standards which we can devise.\nRecent developments illustrate the need for or¬\nganization and integrated leadership if education is\nto maintain its balance, gain in respect, and make\nwise use of new techniques and tools. As Alfred\nNorth Whitehead said some years ago: “The novel\npace of progress requires a greater force of direction\nif disasters are to be avoided.” We need to give firmer\nand firmer direction to what we are trying to do.\nWe need to develop a philosophy, and sets of stand¬\nards and principles, which will enable us to meet,\nquickly and adequately, the immense responsibilities\nof television and radio as important instruments of\nour age.\nEvery movement depends upon the people who\nmake it up. It will not be Washington, Ann Arbor,\nNew York or Urbana offices or organizations, or even\nfunds alone, which will make educational broadcast¬\ning an indispensable part of American education, or\na respected and dependable alternate broadcasting\nservice for the U. S.\nIt will be people: people with courage, standards,\nand ideals: not a separate corps of “broadcasters,”\nbut professional, qualified educators who understand\nbroadcast implications, tools and techniques. It will\nbe professional educators with the highest possible\nsocial and educational concerns and goals. It will\nbe people who feel a responsibility to help explain\nthe complexities of today in ways that will make in¬\ntelligent decision-making possible, and the involving\nof the most intelligent minds in the U. S. in inter¬\nnational, national and local decision-making. It will\nbe people who can help reestablish, unashamedly, re¬\nspect for the intellectual, and intellectual effort . . .\nin the humanities as well as in science. It will be\nOCTOBER, 1958\nSee You In Omaha\n5"
}