{
  "id": "d430-113",
  "text": "34\nLearning and Attitude Changes\nroutiere,' ‘ toujours tout droit.’4 These twenty-six words and phrases were, it\nshould be pointed out, all presented with a serious teaching intention, practically\nall of them being shown in caption form and the appearance of no one of them\nin the programme being merely incidental.\nIn the test of factual knowledge there were questions about twenty-nine\nof the facts presented in the programme and some examples follow : (i) About\nhow many French francs are there to the English pound ? (ii) If you were tipping\na porter in France, how much would you be expected to give him for each piece\nof luggage he handled for you? (Answer in English or in French money),\n(iii) If you were getting a passport where would you expect to get it ? Here,\ntoo, of course, each of the facts selected for testing had been presented in the\nprogramme with a serious teaching intention. In marking answers, a fair margin\nof error was allowed (e.g., that there are anything from 800 to 1,200 francs to\nthe English pound).4\nThe attitude test consisted of a set of twenty-eight statements each dealing\nwith one of the various issues which it was intended to treat in the programme\nand they took the following forms : (i) You don’t need to know much French\nto ‘ get-by ’ on a short visit to France ; (ii) It would probably be quite a lot of\ntrouble making arrangements about passport, money, transport, customs, and\nso on. (iii) I know so little about French money that I would probably be\nswindled. The statements were listed and the subject had to indicate in respect\nof each of them whether he ‘ agreed strongly,’ ‘ agreed,’ ‘ disagreed,’ ‘ disagreed\nstrongly/ or simply had ' no opinion ’ on the matter. The response chosen was\nunderlined.4\nAssessments and classifications were also made in respect of six variables\nproposed as possible matching criteria. For this purpose the following informa¬\ntion was required : (a) age and sex ; (b) educational level achieved ; (c) job\nat present or before marriage ; (d) whether or not subject had ever (i) visited\nFrance, (ii) studied the French language ; (e) score on a short test of French\nterms not presented in ‘ Bon Voyage.’ The latter test included only five words\nand these are referred to hereafter as ‘ control words.’ For the purposes of\ntesting, they were scattered amongst the other twenty-six. The answers to\n(d) (i) and (ii) required only a ' yes ’ or a ‘ no.’ The information about education\nand occupation was collected on a standard form developed in Audience Research\nfor general research purposes and on the basis of this information occupational\nand educational classifications were made.4\nThe tests were all of a paper and pencil kind. All subjects were assured of\ntheir anonymity and there was a lot of emphasis on the need for constant effort\nand for frankness. In all tests, abundant time was given and naturally there\nwere no penalties for poor grammar.\nIII.—Findings.\n(1) Details related to the design and to the analysis :\nSelecting the stable correlates.—The first analysis of results was made with the\naim (already stated) of determining, for each of the three separate variables under\nstudy, that combination of the proposed matching characteristics having the highest\nmultiple-association with the variable concerned.2 Table I gives the main results.\nFrom Table I, it will be seen that the matching criteria for use in the study of changes\n4 The word knowledge tescs, the questions about facts and the attitude test which were\nused in this study are set out in the appendix referred to on page 32, and stated there to be\nobtainable from the Documents Unit of the D.S.I.R. This appendix also contains an\ninformation form and the classifications of occupational background and of educational\nlevel referred to on page 33."
}