{
  "id": "d430-114",
  "text": "William A. Belson\n35\nTABLE I\nThe Proposed Matching Criteria.\nVariable under study\nStable correlates selected\n(in order of priority)\nVariable Correlation\nMultiple Correlation\nAchieved\nKnowledge of French\nControl words .. -(-0-78\n+ 0-82 (first two)\nwords and phrases pre¬\nsented in ‘ Bon Voyage’\nEducational level +0-59\nOccupational level +0-58\n+ 0 -85 (all three)\nKnowledge of facts pre¬\nControl words .. +0-54\n+ 0-63 (first two)\nsented in ‘ Bon Voyage ’\nVisit to France1 .. +0-46\nEducational level +0-51\nOccupational level -f- 0 -43\n+0-65 (first three)\n+ 0-65 (all four)\nAttitude on issues related\nControl words .. +0-48\n+ 0-54 (first two)\nto visiting France\nVisit to France .. +0-34\nOccupational level -j-0-39\n+ 0-55 (all three)2\n1 Those who had made a visit in the past were more favourably and confidently dis¬\nposed to making a further visit.\n2 To have selected more correlates than those shown would in the case of each of the\nvariables under study, have involved no appreciable increase in the multiple association\n(see Wherry Doolittle formula).\nin word knowledge are ‘ control words ’ and ‘ educational level ’ ; the use also of\n‘ occupational level ’ would have improved the matching, but by too small a margin\nto warrant the additional computation involved. It will also be seen that the\nmatching criteria for the study of changes in both knowledge of facts and attitude\nwere ‘ control words ’ and ‘ whether or not subject had ever visited France.’\nThe three main s cores of the non-viewing group were then separately adjusted\n(each according to its relevant matching criteria) to give the results set out in Table\nII.\nThe Adequacy of the Corrections.—In the section on Design, it was stated that a\nbuilt-in check was being used to find out if the correction device described in that\nsection had, in fact, eliminated pre-broadcast differences between the groups. A full\ndescription of this relatively complex process and of its outcome is given in the\nAppendix,4 but for the moment it may be taken that this outcome ensured that a\nhigh degree of confidence may be attached to the assumption that the residual (or\ncorrected) differences between the two groups represent relatively ‘ pure ’ effects—\ni.e., that the correction device was markedly successful.\n(2) Effects of the programme.\nThe degree of exposure achieved.—The effect of the series must, of course,\nbe related to the amount of it seen by the viewer. The number of ‘ Bon Voyage ’\nprogrammes seen by persons coming to Broadcasting House as members of the\nviewer group (post-broadcast) was, expressed as an average, 1-6 (out of 4).\nSome 59 per cent, saw only one of them, 28 per cent, saw two, and the remaining\n13 per cent, saw either three or four. Even where two of the four programmes\nwere viewed, these two tended not to be consecutive. This suggests that exposure\nto the programme was not more than partial and that there was relatively little\ncontinuity of viewing.\nChanges produced.—‘Table II sets out the main findings and shows also the\ninfluence of the correction procedures used."
}