{
  "id": "d430-123",
  "text": "FURTHER STUDIES OF THE USE OF TELEVISION 203\npossible to assign the students randomly to groups, give them all\nthe same instruction simultaneously, by the same instructor, and\nat the same time vary the methods of treating comparable groups.\nFor example, such problems can be attacked as class size, amount\nof supervision, opportunties for questions, the use of incentives,\nassigned or voluntarily chosen supplementary study, personal\ncounseling.\nComparisons between methods of presentation are more com¬\nplicated because they involve random assignment of students\nacross course time sequences, but this can be achieved by modified\nregistration procedures. Furthermore, an experiment can be con¬\nducted with one set of variables, for say a month, and then after\nan examination and the reconstitution of groups, another experi¬\nment can be conducted in the same course.\nSUMMARY OF RESULTS—FALL 1955\nComparisons between face-to-face and televised instruction.\nComparisons between face-to-face and televised instruction were\npossible in two courses: General Chemistry (2 sections) and Busi¬\nness Law. No significant differences in achievement were found.\nIn other words, no differences in effectiveness between face-to-face\nand televised instruction were detected.\nIn Chemistry it was also -possible to compare the achievement\nof the students who sat in the front five rows of the lecture-demon¬\nstration auditorium with that of the students who sat in the second\nfive rows and the third five rows. No significant differences were\nfound between these randomized groups.\nClass size comparisons. The problem of the size of classes in\nthe television receiving rooms relates to the physical facilities of\na university which usually include rooms of various sizes. It would\nbe very desirable if large groups and small groups could be taught\nvia television with equal effectiveness. This question was studied\nin five different courses: Air Science (ROTC) (range: 20 to 200\nstudents), Chemistry (2 sections) (range: 14 to 43 students),\nEconomics (range: 15 to 45 students), Music Appreciation (range:\n15 to 92 students), Psychology (2 sections) (range: 21 to 150\nstudents). With one exception, no significant differences in achieve¬\nment were found in these comparisons.\nThe one exception was in Music Appreciation where, on the\nfirst examination in the course, one group of 40 students had a"
}