{
  "id": "d430-132",
  "text": "212 AUDIO-VISUAL COMMUNICATION REVIEW\nResearch Program.3 This standard requires that no student be\nseated further than 12 screen widths from a TV receiver. This\namounts to 21 feet for a screen 21\" wide. The 24\" receivers have\nscreens 21\" wide, or 24\" on the diagonal.\nHowever, in the General Psychology and Air Science courses\nthe enrolments made it necessary to use a large auditorium as a TV\nreceiving room. One hundred fifty to 200 students were randomly\nassigned to seats in this room. Four 24\" receivers were placed\nacross the front of the room. In each course approximately 100\nstudents were seated within the 21-foot viewing distance mentioned\nabove. The additional students were seated in a “zone of possible\ndisadvantage” which extended from 21' to 35' from the TV screens.\nA careful check was made on the academic achievement of these\ngroups, but no significant differences were found. However, it is\npossible that in both of these courses, no very strong demands were\nmade on visual learning.\nDuring the current semester (spring 1956) the large room has\nbeen rearranged and six receivers have been provided so that the\n12-screen-widths standard can be maintained as a maximum\nviewing distance.\nMEASUREMENT\nIn view of the number of nonsignificant differences obtained a\nquestion might be asked about the sensitivity of the achievement\nmeasures used in the various experiments. In other words, it is\npossible that there are differences resulting from some of the\ntreatments but the tests are failing to measure them.\nIn practically all of the courses under study, objective tests\nwere used. Tests were of a type generally employed in the evalua¬\ntion of student achievement in university courses or in educational\nresearch. They were usually prepared by the professors in charge\nof the courses, although in some instances they are prepared by\nseveral members of a department working as a group. Assistance\nwas also provided by members of the staff of the Instructional\nResearch Program.\nA special effort has been made to achieve adequate reliability\nvalues by developing tests of satisfactory length and by the avoid¬\nance of ambiguity in the wording of items. Furthermore, in most\ncourses, an effort has been made to include items which cover\n3 ash, Philip. Optimum Physical Viewing Conditions for a Rear Projection Daylight Screen.\nSDC Technical Report 269-7-37. Instructional Film Research Program, Pennsylvania State\nUniversity. Port Washington, L. I., N. Y.: Special Devices Center. Oct. 12, 1953. 17 p."
}