{
  "id": "d430-77",
  "text": "Prior to the scheduled meeting date, copies of the applications to be\nreviewed are mailed to each member of the advisory screening com¬\nmittees. A prepared list of the applicants byname and by country is\nenclosed for the use of the committee member in making notes and\ncomments.\nMeetings of the advisory screening committees are generally held at\neither the National Academy of Sciences or the American Council on\nEducation. Offices of some of the professional organizations such as\nthe American Political Science Association are also used for the meet¬\nings. The hour for convening is usually 9:00 a. m. with adjournment at\napproximately 5:00 p.m. A few committees with an especially large\nnumber of applications to review maybe scheduled fortwo-day sessions.\nTravel expenses in connection with the meetings are assumed by the\nConference Board Committee.\nCommittees Which Review by Mail\nCommittees with less than twenty applications for consideration in\nthe Fall Cycle usually complete the review by mail. All Spring Cycle\napplications are reviewed by mail, since the total number of applicants\nfor that competition does not justify convening the committees.\nCopies of applications for review by the mailing committees are dis¬\npatched to committee members as soon as possible after the close of\nthe competition and approximately two weeks are allowed for consider¬\nation of the papers. Forms are supplied for recording a rating, with\nexplanatory comments, for each application. These forms are then\nmailed by each member to the committee chairman, who is responsible\nfor the preparation of a consolidated report representing the evaluation\nof the entire committee. This consolidated report is sent by the chair¬\nman directly to the staff of the Conference Board Committee.\nSome deviation from this procedure may be necessary if special cases\nrequire a more rapid review, but every effort will be made to have the\nconsolidated report prepared by the committee chairman. When this is\nnot practicable, the chairman will be consulted in the event of wide di¬\nvergencies in the ratings of the committee members.\nThroughout the year, applications are also submitted for review by\nmail when candidates are recruited for openings which were not filled\nin the regular competition.\nPOINTS FOR CONSIDERATION IN RATING APPLICATIONS\nBefore reviewing any applications, members of the advisory screen¬\ning committees are urged to read the General Information booklet for\ndetailed data on the operation of the Fulbright program, referring par¬\nticularly to pages 11 through 13, describing the selection of grantees."
}