{
  "id": "d430-81",
  "text": "Comments by Committee Members\nSince numerical ratings serve only to place the individual on a scale\nwithout disclosing the basis for the judgment, comments explaining and\njustifying a rating are very important for those who must make the final\nselections and should never be omitted. In reviewing applications at\nmeetings, group discus sion is also facilitated if the member s of the com¬\nmittees have made notes about each application.\nIn reviewing applications by mail, the written comments should be\nquite specific since they serve in lieu of group discussion. The com¬\nmittee members are particularly asked to indicate any personal knowl¬\nedge of, or acquaintance with, the applicants,.and. t.o give-any.additiogal\ninformation known to them concerninp the particular opening, the country,\nor the applicant.\n-- ^\nIn making their comments, it is usually helpful to Committee mem¬\nbers to have in mind the main criteria to be applied, namely the appli¬\ncant's professional qualifications; his personal suitability in relation to\nthe program applied for, adaptability, and probable effectiveness as a\nrepresentative of American scholarship; the value of the project in\nterms of his own professional development and the advancement of\nknowledge in his field of study.\nLATE APPLICATIONS, TRANSFERS AND RECRUITMENT\nLate applications may be of two kinds: (1) Those intended for con¬\nsideration in the open competition but filed shortly after the closing\ndate, and (2) those filed in response to the Committee's invitation to\napply for an opening remaining unfilled after all applications received\nin the open competition have been considered.\nApplications which are intended for the open competition but which\nmiss the closing date by one or more days are ordinarily marked con¬\nspicuously as LATE. Such applications will be included for screening\nwith the applications received on time and should be screened in the\nsame way. In drawing up the final panels of nominated candidates,\nhowever, applicants who have observed the closing date are given\npriority.\nAlthough there are a great many more we 11-qualified applicants for\nsuch countries as the United Kingdom and France than the re are awards\navailable, there maybe quite a few openings in other countries for which\nno applications are received. This is often true in the case of countries\nrecently included in the Fulbright program. In addition, rigid language\nrequirements, differences in academic calendars, or less firmly-es¬\ntablished cultural relations may combine to render many of the new\nopenings \"hard to fill.\" Since, from a program point of view, it is\noften of great importance that these positions be filled, the Committee\nemploys the following means of reducing the number of vacant awards\nto a minimum:"
}