{
  "id": "d350-105",
  "text": "2\nAdministratively, at NBC I. supervised a staff of eighteen\nin the public service programs division. At the University\nof Texas, my staff numbered thirty. During the past summer,\nat the National Music Camp, our radio staff produced a total\nof seventy-nine broadcasts and three motion pictures in\nonly fifty-six days. At NBC I was that networks first edu¬\ncational director to be assigned a definite budget for the\noperation of the department. Until that time budgetary de¬\ntails were known only to the vice-president in charge of\nprograms. At Texas, our radio and TV budget amounted to\n75 thousand dollars annually. The St. Paul Junior Associa¬\ntion of Commerce, of which I was president, operated on\na 60 thousand dollar annual budget.\nProfessionally, I believe my views are well known to most\nof your membership, with whom I have worked for years. As\na fellow member of the Allerton House seminar, I partici¬\npated in the discussions which resulted in the establishment\nof the NAEB tape network. As a consultant to the Educational\nStandards Committee of the NAB (now the NARTB), I was one\nof four responsible for the establishment of curriculum and\nteaching standards for professional radio at the college\nlevel. The new four year television curriculum at the Uni¬\nversity of Texas was established under my direction. I have\nparticipated annually in the meetings of the Institute for\nEducation by Radio as discussion chairman, panel member, or\nspeaker.\nI believe that an executive secretary should be a first\nsergeant, carrying out the orders of the commanding officer -\nor officers - and within those limitations serving his\norganization impartially and objectively. He must be a\nman of ideas and a public relations servant. So far as\npossible he should seek anonymity. He must not operate as\nif he were surveying a homestead for permanent occupancy,\nfor if he does operate in this manner he is likely to protect\nhis own Interests before he protects the welfare of his\norganization.\nTemporarily, I am engaged as technical consultant on the\nproduction of educational and industrial films for the\nEmpifce Photosound Company of St. Paul. I am determined,\nhowever, to continue in the educational field. I believe\nI have much to offer.\nA one year trial arrangement might ferve to prove my point.\nVery sincerely yours,\nThomas D. Rishworth"
}