{
  "id": "d350-130",
  "text": "CONFIDENTIAL\n£/V£0\nRA°I0 staticin\nOCT 3\n8 « All bo'/.\nSeptember 29, 1952\n1 Wit*C\nUNIVERSITY OF ij\nGray don Ausmiis s\nRadio Station WUOA-FM\nUniversity of Alabama\nUniversity, Alabama\nDear Graydon:\nThis is a follow-up to our phone call and to thank you for\nyour letter of September 22nd*\nI think the procedure you suggested in following through on\nEarl Wynn Is a very good one and I also concur that we do\nneed a meeting when the proposed candidate is chosen so that\nwe may brief him on a number of things* I also think you\nare correct that it is more Important for him to talk to the\nCommittee than the present executive secretary since, if he\nIs employed, he would doubtlessly parallel the work of Miles\nfor a considerable period of time before h© took on the task\nhimself.\nThe more I think of it the more I think of Earl Wynn as a\nfine, mature person who is used to dealing with prominent\nand important people In an easy way and who, despite this\nsocial intelligence and skill, still has a great deal of the\nroutinized activity and the ability to organize and pursue a\nplan which is so vital to anything w© do.\nMy feeling is still that a fundamental need, and one that we\nhave only approached, is getting a real sound core to this\nNAEB. Without this basic core and a really basic organiza¬\ntional set-up with proper distribution, advice and Informa¬\ntion, proper improvement of outlets, and a general pulling to¬\ngether of all our forces all of the fine and splendid things\nthat have been done in this country and abroad become meaning¬\nless. Their only real virtue and utility is to feed them back\nthrough the outlets we have and to make them pursue the cre¬\nation of new outlets, either radio or television, so that w©\nmay continue our basic purpose of broadcasting a different and\nbetter type of program for the American public. This does not\npreclude the fact that we may act in a sense as educational\nbroadcast counselors, seek to Improve and provide programs\nfor other outlets than our own, and to generally stimulate the\ncause but again without the basic core organization we cannot\ndo this In a concentrated way* We must have a strong, sound,\nwell-worked out headquarters. This to me is basic to all other"
}