{
  "id": "d350-160",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVICE-PRESIDENT\nGRAYDON AUSMUS\nWUOA, University of Alabama\nUniversity, Alabama\nTREASURER\nFRANK SCHOOLEY\nWILL, U. of Illinois\nUrbana, Ill.\nEXECUTIVE DIRECTOR\nJAMES MILES\nGREGORY HALL, U. of Illinois\nUrbana, Ill.\nGENERAL COUNSEL\nMARCUS COHN\nCafritz Building\nWashington, D. C.\nREGIONAL DIRECTORS\n☆\nRegion I\nPARKER WHEATLEY\nWGBH, Lowell Institute\nBroadcasting Council\nBoston, Mass.\nMaine, New York, Connecticut, New\nHampshire, Massachusetts, Vermont,\nRhode Island, Pennsylvania, New\nJersey, Delaware and Maryland.\nRegion II\nALVIN GAINES\nWABE, Board of Education\nAtlanta, Ga.\nVirginia, West Virginia, Alabama,\nKentucky, Tennessee, North and\nSouth Carolina, Georgia, Florida\nand Mississippi.\nRegion III\nWALDO ABBOTT\nWUOM, U. of Michigan\nAnn Arbor, Mich.\nOhio, Michigan, Indiana, Illinois\nand Wisconsin.\nRegion IV\nRICHARD B. HULL\nWOI, Iowa State College\nAmes, Iowa\nIowa, Minnesota, North and South\nDakota, Nebraska and Wyoming.\nRegion V\nJOHN DUNN\nWNAD, U. of Oklahoma\nNorman, Okla.\nMissouri, Kansas, Colorado, New\nMexico, Oklahoma, Arkansas, Texas\nand Louisiana.\nPRESIDENT\nSEYMOUR N. SIEGEL\nWNYC, Municipal Broadcasting System\n2500 Municipal Building\nNew York 7, N. Y.\n29 August 1952\nMr, Graydon iAusmus\nWUOA, University of Alabama\nUniversity, Alabama\nDear Graydont\nYour memo of August 26 arrived this morning and I hasten to\nsend the first portion of my reply to it.\nFirst — for the record ~ let me say that I of course accept\nthe general proposition which you outline, I'his you knew, but I am\nputting it down in black and white so that you have it on the record.\nSecond, I would favor choosing someone on the first level —\nthat is the \"top-level, high-caliber man,11 rather than someone on\nthe second level.\nAs to the nominating committee, I have a few suggestions for it,\nI am not considering Siegel or Wheatley as I assume they are out of\nthe country and not available; if either of them were available, I\nwould list them among the possible members of such a committee.\nOther members — in addition to you — would be Gaines, Miller, and\nHull, If you wanted to supplement this by someone from outside the\nboard of directors, I would suggest McCarty or Levenson, Mac is\nunquestionably our “elder statesman\" and his advice would certainly\nbe helpful; and from what I’ve seen of Levenson, he is a very able\nperson who would probably know people in the educational world better\nthan most of the rest of us.\nIn view of his frequent protestations of disinclination to work\ntoo hard or too intensively on special assignments I think that Waldo\nshould not be included on the committee. And in view of his nomination\nfor the position I think that John Dunn should likewise be omitted.\nRegion VI\nALLEN MILLER\nKWSC, State College ol\nWashington\nPullman, Washington\nMontana, Washington, California,\nIdaho, Oregon, Nevada, Arizona,\nUtah and Territory of Hawaii.\nDIRECTOR OF STUDIES\nDALLAS W. SMYTHE\nIllinois University Communica¬\ntions Research Institute.\nUrbana, Illinois\nSECRETARY AND\nPUBLICATIONS EDITOR\nBURTON PAULU\nKUOM, U. of Minnesota\nMinneapolis, Minnesota\nI will give a good deal of thought to a list of names and shall\ncertainly come up with one before the committee meets.\nAs far as I’m concerned, the relationship which should be main¬\ntained between the board and the executive director was adequately,\nstated in the excerpts of the minutes which you attached to your\nmemorandum. I would supplement these by reference to the footnotes\nas provided in those minutes; even though we did not adopt those\nparts of the resolution as originally submitted, I think they should\nbe accepted as guidance.\nFinally, whatever names are suggested by members of the board,\nI think the canvassing committee should turn up a number on its own;\nthree men devoting several d; ys to this can do lots more than any\nof us working along for a few hours—or minutes l\nRepresenting non commercial, educational, radio and television stations, workshops, and production\ncenters, owned and operated by colleges, universities, school systems and public-service agencies."
}