{
  "id": "d350-167",
  "text": "COPY\nMEMORANDUM\nTO: MEMBERS OP THE BOARD OP DIRECTORS\nPROM: GRAYDON AUSMUS, VICE-PRESIDENT\nDATE: August 26, 1952\nAs you are aware, we are faced with the problem of finding a\nreplacement for our Executive Director in the near future. Before\nSiegel left for Europe, I talked at great length with him and he\nadvised that the Board go ahead and canvass the field for $ man.\nAt the Iowa State College TV Workshop last week, Hull, Paulu,\nMiller, Dunn, and I met several times with other NAEB members and\nthe Executive Director and thrashed out the following procedure:\nAs Acting President, I am to poll all members of the Board\nfor a very extensive list of names for the Executive Director*s Job.\nUsing this list as a starting point, the Committee will sift and\nevaluate, narrow the list down, make contacts with prospective\ncandidates, then make recommendations to the Board for\napproval or rejection. At the suggestion of the members of the Board\npresent at Ames, this Committee will not be named until the members of\nthe Board have been polled for their list of candidates and no\nfinal decision will be made by the Committee without approval of the\nBoard.\nThe thinking of the group at Ames was that names should be suggested\non two levels:\n(1) A top level, high-caliber man with an established\nnational reputation and organizational and administrative experience\nand ability, an educator, preferably though not necessarily a\nbroadcaster, but certainly a man who represent the organization\non the national level, making contacts with Foundations and working\nwith other national educational organizations. It is conceivable that\nthe Board may wish to increase the salary for this caliber man\nby taking money from the funds contributed from member stations\nor by drawing upon the Kellogg funds for the year ahead.\n(2) A younger, less experienced man, but one who is an\neducational broadcaster with some experience preferably and certainly\nsome considerable study in the field. This would be a man whom we\nwould expect to see move into the Executive Director's Job slowly,\nunder rather close supervision of the Board of Directors. In\neffect, he would be our Headquarters Manager or our Executive\nSecretary and would operate Headquarters under rather specific\ndirectives from the Executive Committee and the Board of Directors.\nIf such a man can be found, the President and other elective\nofficers would have to assume the responsibility for representing us\nwith other organizations and in our dealings with the Foundations.\nWe could assume that his salary could begin at a somewhat lower\nfigure and that it would be increased as he evidence! ability to\nassume more and more responsibility."
}