{
  "id": "d350-195",
  "text": "«2~\nWalter Emery was tied up with ICC hearings on the TV allocation plan,\nhut X finally got to him Saturday afternoon at his nice horns in Cheesy Chase, Md.\nI also ran into Eldon Campbell, who is alumnus of WILL and a good friend of Allen\n:,Iillor and also at one time ray boss at WOWQ at lort Wayno, Ho is doing real well\nas national sales coordinator for Westinghouso Radio Stations, Inc*\nAMERICAN COUNCIL MEET INGS —T he real purpose for ray trip to Washington ms to attend\nthe American Council of Educational Conference of Organisation Member Representa¬\ntives » It is a real thrill to see this vast organization work* I am sure we have\nlong appreciated the work the American Council does, but none of us have really\nunderstood the tremendous pressures that are exerted by all sorts of diverse inter¬\nests which the group represents# It is literally a wonder that they can take a\nstand on any subjeot concerning education* It is only because men of good faith\nstrongly believe in the necessity for education at all levels that the Council lias\nsucceeded* Maybe we can take a leaf from their book*\nPrimary areas of consideration at the meeting were public relations,\ninternational understanding, vaterone benefits, and UMT and all of its ramifications*\nThis is all put together under ono publication called \"Education and National\nSecurity\" - a 60*pag© document which can bo secured for $*50 by writing to the\nAmerican Council on Education, 1785 Massachusetts Avenue, H.W*, ’Washington 6, D« C*\nIt occurred to me that with the hundred or so associations which were\nrepresented at this mooting, we may have a very live potential source of inform-\ntion for a series of shows on education* It certainly will bear further investiga¬\ntion#\nTHE MASS DUPLICATOR PRQBLS'I—Among the things I had thought would take a few minutes\nto do in V&ehington ms to visit Georgetown University and see their mss duplicator\nin action® lty first shock ms that it wasn’t at Georgetown but m© v&th. an engineer\nby the name of Rawden Smith, who ms setting up to make tape duplicates on a com-\nmerohal basis® My visit with Smith took sametiling less than U hours during which\nI got a terrific sales talk on the value of the machine and some indication that\nhe, not Toogood, was the nan who would eventually bo able to 'supply us a machine,\nbut no further indication as to when such a machine might be available*\nI then visited Dr® Dorstair, Head .of the Linguistic Institute of Georgetown\nUniversity* This is an amazing institution which teaches 26 different languages\nand can make almost anyone a conversationalist in any of these languages within an\namazingly short time*\nTo do this they use some 100 brush soundmirror tape recorders. They have\n16 of them set up so that they can put a master on any one and dub on the other 15.\nThe system works but the quality leaves much to ba desired. Dorstair was very\ninsistent upon his need for a mass duplicator and was more than willing to go along\nwith us to get one developed. I plan to pursue this whole area much further in\nthe immediate future and will have a more complete report for you0"
}