{
  "id": "d350-26",
  "text": "Hr. Robert C. Anderson\nNovember 13 , 19!? 2\nPage 2\nincreasingly a significant organization in the national and inter¬\nnational commimications field. Our Executive Director must constantly\nsearch out and explore new avenues and new opportunities for service.\nHe should become one of the most important single individuals in the\nUnited States in the area of intelligent communications. We are\nlooking for a man who will sign a four-year contract at a starting\nsalary of ten to twelve thousand dollars a year. There is every\nreason to believe that the contract would be continued well beyond\n-a four year period if our man is at all effective* If you feel you\nmight be interested in our considering you for this job, I should\nappreciate a detailed summary of your background aid experience\nwhich I might us© in a presentation to the Board at our first meeting.\nTurning to another subject, you may count on my being in\nAtlanta on the afternoon of December 10. I shall be in Arkansas\non the 9th but can arrange to arrive at the hotel by late afternoon.\nThe agenda for the meeting looks very interesting indeed and you are\nto be congratulated upon having done a most excellent job for the\nplanning, of this as well as for the very attractive brochure published\nOctober *23. I trust you will give me more detailed instructions con¬\ncerning any contribution you may expect of me during this three-day\nmeeting. Be assured of my interest in and enthusiasm for helping\nin any way I can.\nI am enclosing a list of all of the active and associate\nmembers of NAER in the fourteen states to be included in this con¬\nference. b have been slow returning this because our one copy of\nthe NaEB directory had.been sent to a friend who did not return it.\nI trust I have not delayed your contacts by .this •\nI am completing the questionnaire which you forwarded\nto me but do not have the names of all of the people who were listed\non our state-wide comraittep. The secretary at our last ireeting took\nthose names with him aid minutes of that meeting have net been dis¬\ntributed. I will write L. 0. Brackeen to send you that list as soon\nas the minutes are completed. On a separate page I will summarize\nstops that have been taken up to the present time on our state-wide\nplanning. At the present moment, however, X am soirewbat disturbed\nbecause of the loss of momentum.and propose to spend several days\nthis week and next traveling in the state in an attempt to revive\nthe enthusiasm that was engendered at the meeting In Montgomery\nOctober 9 and at a later meeting in Birmingham.\nThe Birmingham people are much less enthusiastic than they\nwere following Ralphs visit and the meeting of the committee about\nthree weeks ago. I talked with Ear. Banks last night and again this"
}