{
  "id": "d1878-1",
  "text": "BOX SCORE\nYou probably notice the figures this month\nhave changed considerably, some up and some\ndown. For months we have been plagued with\nthe fact that everyone prints or quotes different\nfigures on the number of TV, AM and FM sta¬\ntions. No one knew who was right, so we wrote\nFCC. The figures this month are the ones the\nFCC sent us. From now on we’re using these,\nwhich, incidentally, are the same as the ones the\nNARTB uses.\nTotal TV stations — 511 (includes 22 non-commercial)\nTotal AM stations — 2987 (includes 37 non-commercial)\nTotal FM stations — 654 (includes 126 non-commercial)\nThe Executive Committee (made up of the\npresident, vice president, secretary and treasurer)\nwill meet with the executive director early in Janu¬\nary, and thereafter will come together every few\nmonths. The Board of Directors, of course, will con¬\nvene at the Columbus Institute. Committees for 1957\nwill have been announced by the time this issue of\nthe Newsletter is distributed.\nWith the wisdom and experience of past adminis¬\ntrations to guide us, with an excellent set of officers\nand regional directors, and with the strengthening\nof NAEB through the addition of many new mem¬\nbers from the ranks of the AERT, we can look for¬\nward confidently to the New Year.\n—N A E B—\nMEMO FROM THE EXECUTIVE DIRECTOR\n—by Harry J. Skornia\nThis month’s column, the first in our new garb,\nwill be relatively brief. How do you like it? With the\ngreatly increased circulation it was more practical for\nexpense, distribution, and other reasons to go to a\nprinted and less cumbersome format. This had to be\ndone during the holidays, and we hope in each issue\nto improve considerably on this first one. Judith\nStevens will welcome your reactions and suggestions\nfor future revisions and changes.\nSince this will continue to be to a certain extent\nthe NAEB “House Organ,” we shall for the time being\ncontinue to feature “family news” and a more familiar\ntone than that used in the Journal (which you should\nall have received by now) .\nTherefore, I shall briefly report on trips and other\ndevelopments as they occur, since this has been gen¬\nerally indicated as something you expect of me.\nI was in New York December 11 - 15, for Adult\nEducation Association, CNO Executive Committee\nand Broadcasting Committee meetings. (For those\ninterested in travel expense, I should mention the in¬\ncreasing frequency with which our travel expense is\nborne by those organizations requesting our assistance,\ncounsel or services . . . which is a considerable saving\nto the NAEB.)\nWhile in New York I attended the meeting of the\nNew York AEA, welcoming the FAE into their midst,\nfollowing the recent centralizing of FAE offices in\nWhite Plains. In addition to the opportunity this pro¬\nvided to see a number of foundation, NAEB and other\nAssociation friends, I was very pleased to be able to\nhear FAE President Fletcher’s address at this session.\nHe urged us not to concentrate on “felt” needs,\nbut to seek to provide leadership in the discovery and\nsolution of needs many of us ignore at our peril. He\npointed to the extent to which liberal education in\nAmerica has failed to train people for real community\nand political leadership. Presidents, cabinet members\nand other political leaders are generally from such\ndistantly related fields that the need for career-train¬\ning is becoming apparent . . . with specific curricula\naimed at training people for positions of responsible\nleadership. He quoted Mr. Randall from this year’s\nFAE Lectures: “Education is too precious to be\nmeasured in dollars.”\nMr. Fletcher outlined grants of the FAE to date,\nincluding favorable mention of achievements of the\nNAEB, using FAE grant funds, and especial mention\nof the “test city” (discussion) and ETV projects they\nhave financed. There was no question but that the\nFAE supports what we all stand for, as we strain to\nuse our media for enlightment and education.\nNorman Ross, Education Director of Life, had in¬\nvited me drop in, and I had a pleasant discussion with\nhim and his staff. He showed me the mock-up of a\nfine feature nearly ready to go, in Life, on ETV as a\nteaching tool. We offered our help in calling it to your\nattention, since I think the article will be of help in\nboard, legislative and community efforts you may\nhave under way. _\nI also discussed the possibility of Life’s covering\nthe first of the NBC live feeds to ETV stations and\nI hope something may come of that. Mr. Ross and his\nstaff are sympathetic and interested. We appreciate\nthe opportunities this contact affords for the promo¬\ntion of our efforts on behalf of American education\nand educational broadcasting.\nFrom Mr. Ross I dropped by briefly to chat with\nQuincy Howe, now at ABC, but formerly on the\ncampus at the University of Illinois.\nMr. Alvin Eurich of the Fund for the Advance¬\nment of Education had also invited me to drop in, and\nI did, so . . . the day following the announcement of\ntheir being taken back into the Ford Foundation. In\ntheir new relationship they will continue with renewed\nPage 2\nNEWSLETTER"
}