{
  "id": "d1878-3",
  "text": "WTTW, Chicago; and WBIQ, Birmingham, Ala.\n*****\nDid you know . . .\n. . . that the Lincoln Division of the Ford Motor Co.\nhas made a FM tuner available as optional equipment\nin its 1958 Lincoln and Continental automobiles?\nThe tuner is manufactured by Bendix Radio and\nfeeds audio through the AM set since volume and\ntone controls operate either receiver.\n. . . that as of Jan. 1 there were 537 commercial and\n140 non-commercial FM stations operating? This is a\ngain of 7 commercial and 15 non-commercial stations\nover the past year.\n. . . that both radio and television signals have been\ntransmitted over long distances by bouncing them\noff meteor trails?\n* * * * *\nThree meetings of interest to engineers in the\nradio and television broadcasting industry which will\nbe held during March and April are listed below for\nyour information:\nMarch 24-27 Institute of Radio Engineers, Na¬\ntional Convention and Radio Engineering Show, New\nYork City, Waldorf-Astoria Hotel and New York\nColiseum.\nApril 21-26 Society of Motion Picture and Tele¬\nvision Engineers, 83rd Semi-Annual Convention, Los\nAngeles, Calif., Ambassador Hotel.\nApril 28-May 1 NAB 12th Annual Broadcasting\nEngineering Conference, Los Angeles, Calif. Statler\nHotel, concurrent with 36th Annual NAB Convention\nat the Ambassador Hotel.\n*****\nPlanning a radio station? RCA has available a\nbrochure, including floor plans, equipment require¬\nments and current trends. The material contained in\nthis brochure has been appearing serially in RCA\nBroadcast News beginning with the October, 1957\nissue. The brochure contains the complete series and\nmay be obtained by writing RCA, Broadcast and\nTelevision Equipment Departments, Camden 2, N. J.\nTV TECHNICAL TIPS (March)\n—Cecil S. Bidlack\nIn early February, one of the most recent technical\ndevelopments was demonstrated to newsmen by the\nBlonder-Tongue Labs, of Newark, N. J. It was Bi-\nTran, a system of TV broadcasting which allows two\nprograms to be broadcast over the same television\nchannel. This is a “compatible” system which may\nbe applied to double the number of programs received\non a single channel.\nAs the system would work, each channel would\nbe divided into an “A” and a “B” portion. The “A”\nportion would contain present commercial or educa¬\ntional programming as now provided. The “B” por¬\ntion would be used for special services not now ac¬\ncorded television time and would be received only if\nthe viewer elected to decode the signal at his receiver.\nAt the demonstration, the regular broadcast pro¬\ngram (program “A”) was seen on the receiver screen.\nWhen the decoder was switched on, program “B”, a\nclosed circuit picture, appeared on the screen. Those\npresent at the demonstration commented that the\nmultiplexed program was inferior in resolution and\ncontrast to the regular program. However Blonder-\nTongue officials stated that the demonstration was\nprimarily to show the feasibility of the system and\nthat the system required refinement to improve pic¬\nture quality on the the multiplexed channel.\nIt was stated that it would cost approximately\n$5,000 to modify transmitting equipment for Bi-\nTran and about $60 for a decoder for the home re¬\nceiver. Further demonstrations will be held for radio\nand television broadcasters as well as industry and\nmilitary leaders, educators, medical and governmental\nspecialists.\n*****\nTwo papers of interest to technical personnel at\nNAEB stations and production centers will be in the\nmail soon. The first, “Film in Television” by Rodger\nJ. Ross of the Canadian Broadcasting Corporation is\na discussion of the technical quality of television film\nfrom the standpoint of the television broadcaster.\nThe second is a “how-to-do-it” paper by Mel’ Haas of\nthe WOI staff. It details their method of balancing\ncrowd noise at sports broadcasts automatically when\nthe announcer uses his mike cut-off or “cough” but¬\nton. It’s called “Automatic Crowd vs. Announcer\nBalance.”\nThese papers will be mailed to chief radio and tele¬\nvision engineers on our Technical Directory list. We\nhave extra copies available to send upon request to\nothers wishing them.\n*****\nWTTW has expanded its kinescope recording serv¬\nice for outside agencies by the installation of a sec¬\nond kinescope recorder, according to Duane Weise,\nchief engineer of the Channel 11 Chicago ETV sta¬\ntion. They are equipped to record either off-the-air\nfrom Chicago stations or by direct line from their own\n4\nENGINEERING NEWSLETTER"
}