{
  "id": "d1878-4",
  "text": "FCC ACTIONS\n^ FCC Chairman George C. McConnaughey told\nCongress one way to advance UHF television would\nbe to eliminate or reduce the 10 per cent excise tax on\nall-channel TV receivers. McConnaughey described\nthe current UHF service situation as “a vicious\ncircle.” He said the public is waiting for more UHF\nprogramming before buying UHF sets, and UHF per¬\nmit holders are awaiting wider distribution of UHF\nreceivers before going on the air.\n“The best interests of the public require this\ncircle to be broken some place, so there will be more\nTV service,” he said. Noting that the Senate Com¬\nmerce Committee has unanimously recommended that\nthe excise tax on all-channel sets be reduced or elimi¬\nnated, he said, “We agree with that view.”\n—AP Wire Service\n^ The U. S. Court of Appeals upheld the FCC in\nrefusing to change its assignment of certain TV chan¬\nnels at Fresno, California. The O’Neill Broadcasting\nCo., operator of a Fresno TV station on Channel 47,\nhad asked the Commission to assign Channel 12 for\neducational use instead of Channel 18.\nAWARDS\n^ The Ohio Education Association has presented its\nannual awards for “superior educational qualities” to\ntwo network TV programs and one radio program.\nThe Association’s network awards went to the adult\nTV program “Wide, Wide World,” to the children’s\nTV program “Disneyland” and the adult radio pro¬\ngram “Voice of Firestone.” The Awards Committee\nChairman said no award was made for children’s radio\nprograms because the number to choose from was so\nsmall an award was “unwarranted.”\n^ The University of Minnesota radio station,\nKUOM, has been given the National Safety Council’s\npublic interest award for farm safety promotion. The\naward was presented in Chicago, Nov. 25, during a\nnoon luncheon of the National Association of TV and\nRadio Farm Directors. KUOM has received the award\nfor 6 of the past 7 years.\n^ The Edison Foundation Mass Media Awards\nCommittee presented a special citation to New York\nCity’s Municipal Broadcasting Station, WNYC, for\nits recently established “Annual Science Seminar.”\nNEWS OF MEMBERS\nGENERAL\ny An ad appearing in the November 30th issue\nof U. S. News and World Report, featured a picture of\nDr. Hubert Mate, professor of Romance Languages at\nthe University of Alabama, and teacher of a TV course\non Spanish. The cut line under the picture praised\nAlabama’s ETV network, giving percentage of cover¬\nage and kinds of college credit courses offered. The\nSouthern Company, a group of Southern electric\npower companies, placed the ad. A nice tribute from\nan unexpected source.\n^ In the Nebraska Alumnus magazine for Nov¬\nember there is an article on teaching high school\nalgebra through the University of Nebraska’s ETV\nstation, IvUON-TV. Titled “Experiment in Educa¬\ntional TV,” the article says this telecourse may point\nthe, way to relieving the teacher shortage in Nebraska.\nThe treatment is comprehensive and complimentary -\na thoroughly nice job.\ny KUSC, the University of Southern Calif¬\nornia’s FM station, received a tribute titled “Radio\nwith an IQ” in TV Radio Life. A piece that started\nout tongue-in-cheek linking KUSC’s programming\nwith “culture vultures,” the article presented admira¬\nble facts. KUSC has a wide listening audience; their\nprograms are rich in subject matter and polished in\ndelivery. Admitting educators are reluctant to blow\ntheir own horn, the author of the article blew it for\nthem in a stimulating bit of prose that might well have\nfurther increased KUSC’s audience.\ny Gertrude Broderick, Radio-TV Educational Spe¬\ncialist for the U. S. Office of Education, has put out a\nsurvey of ETV programs over commercial stations\nduring the school year of 55-56. The brochure states\n198 American TV stations are now carrying 531 edu¬\ncational program series. The 198 are located in 144\ncities. The 531 programs are sponsored by 8 state de¬\npartments of education, 15 county school systems, 160\ncolleges and universities, 13 teachers’ colleges, 67 city\nschools or school systems and 5 parochial school\nsystems. The survey included neither educational pro¬\ngrams carried on networks nor those carried by the 23\nstrictly ETV stations on reserved channels. Nice job\nMrs. Broderick!\ny WCET, Cincinnati, was given a grant of $66,000\nby the Ford Foundation’s Fund for Adult Education.\nAdded to the $34,000 for a kinescope made earlier this\nyear, the fund has granted WCET a total of 100,000\nduring 1956. The. FAE grants are based on the policy\nof one dollar for two already raised by the organiza¬\ntion.\nNEWSLETTER\nPage 5"
}