{
  "id": "d1586-1",
  "text": "-2-\nKSLH CELEBRATES SECOND BIRTHDAY\nKSLH, the St. Louis Board of Education Radio Station, celebrated the anniversary of\nits second year of broadcasting on April 8th, 9th and 10th. From a modest beginning\nin the spring of 1950, the station has grown until it now carries twenty-six class¬\nroom programs. Eighteen of these are original programs planned, written and pro¬\nduced in the KSLH studios. The remaining eight programs, produced elsewhere, are\nrelayed by transcription and tape recordings released by the NAEB tape network.\nIn order to broadcast these programs the station extended its broadcasting hours\nthis semester so it is now on the air from 9:10 a.m. to 3:30 p.m. daily*\nKSLH programs have already received national recognition. \"Your United Nations,\" a\nseries written and presented over KSLH during 1950 and 1951 by Lucille Sutherland,\nPrincipal of the Ashland School, was broadcast to school children in Flint, Michigan,\nthis year, and scripts for the series will soon be made available to all educational\ninstitutions by the United States Office of Education.\n\"Let’s Find Out>\" KSLH Primary science series, written and narrated by Gertrude B.\nHoffsten, KSLH staff member, received an honorable mention at the Institute for\nEducation by Radio and Television last spring and was recently accepted by the NAEB\nTape Network. The series is now being sent to some fifty-four stations in the United\nStates.\nIn recognition of its second anniversary, Station KSLH planned several special events\nfor the week of April 7th. On Tuesday, April 8th, administrators met with radio co¬\nordinators of the St. Louis Public Schools and members of radio planning committees.\nInvited out-of-town guest included James Miles, NAEB Executive Director, and Richard\nRider, NAEB Tape Network Manager.\nOther events scheduled for this anniversary week included utilization demonstrations\nof KSLH radio programs to be held on Wednesday, April 9th, and an open house on\nThursday, April 10th.\nPAYNE SCRIPT CONTEST OPEN\nOpening of the Payne competition for writers of educational radio programs has been\nannounced by Robert B. Hudson, Director of University of Illinois Broadcasting.\nThe competition offers three $500 prizes for scripts on the subjects of health, inter¬\nnational relations, and community action. Both professional and amateur writers are\ninvited to submit scripts for 15 minute programs in one of the fields plus outlines\nfor three additional programs in the field. The winner in each contest will be ex¬\npected to complete his outlines for a series of four broadcasts.\nThe four scripts by each winner will be broadcast by the University of Illinois radio\nstations, WILL and WIUC, and transcriptions will be made available through the Nation¬\nal Association of Educational Broadcasters Tape Network for broadcasting by other non¬\ncommercial educational stations.\nJudges of the comptetion will be Robert J. Landry, editor. Time and Space; Richard\nRider, manager, NAEB network^ and Parker Wheatley, director, Lowell Institute Co¬\noperative Broadcasting Council.\nEntries must be submitted in triplicate with an official entry form by September 15,\n1952. Information and entry blanks may be obtained from the Director of University\nBroadcasting, University of Illinois, Urbana."
}