{
  "id": "d1586-11",
  "text": "RADIO AND TELEVISION OVERSEAS\nEDUCATIONAL TV IN BRITAIN\nThe BBC intends to carry into television the techniques which it has developed during\n25 years of successful broadcasting to schools on sound radio* At the present time\n114,000 schools listen daily to programs ranging through advanced courses in Madera\nLanguages, Literature and History for the intermediate grades, and Music and Rhythm\nfor the tots* Programs of the ’Our Town’ type are also done on a regional basis for\nlocal schools* All of these programs are run in consultation with the School Broad¬\ncasting Council, a body whose members are nominated by the Government, the BBC, and\nthe various organizations connected with British Education*\nLong-Term Program\nFrom this national Council there has now been drawn a small professional group to\nadvise on the problems of teaching by television. This committee, which has been\nworking on the question for some time, has come to the conclusion that two years of\nexperimental television broadcasts will be required before a full program can be\nevolved* Since it is expected that it will take a further year before the schools in\nBritain can be equipped with receivers, it will not be until the autumn of 19%h that\nthat country can expectto see educational television on a national basis*\nAt the moment Britain is served by a single television network and the only alterna¬\ntive programs are those provided by regional stations operating out of the national\nnetwork, but the priorities of both educational and broadcasting authorities are such\nthat school broadcasts form the first basis of a national alternative program to be\ndeveloped.\nIn the initial stages of the experiment, which begins on May 5 th, there will be four\nweeks of daily afternoon programs* There will be five short series of subjects\nScience, Current Affairs, Travel, Aesthetics and the Industrial Scene* The main pur¬\npose of the project is to try out a variety of program techniques with special^empha¬\nsis on their effectiveness in presenting educational material to children viewing in\nclassroom conditions*\nSix schools have been selected as partners in the experiment, all of them near the\nBBC's transmitter at Alexandra Palace in North London, and all of them Secondary\nSchools, or High Schools as they would be called in the United States. They will re¬\nceive the pictures on a special frequency and for technical reasons the sound will be\nfed to them by direct land line*\nFilm Will Play Big Part\nTechniques to be used in the presentation of the programs will include laboratory\ndemonstrations from the studio, the use of animated diagrams, and photo-micography.\nIt is. intended that considerable use will be made of film material. In some cases\ntravel films will be presented by the people who made them, commentators will make\nuse of film in reporting on Current Affairs, and film will also be integrated into\nremote broadcasts as well as studio interviews*\nThe subjects selected for the beginning of this project are those in which the video\naspect can most usefully supplement the already flourishing system in schools sound\nbroadcasting* The children attending the schools selected for the initial experi¬\nments are said to be looking forward excitedly to May 5th* School, they say, will be\n\"as good as the movies.\""
}