{
  "id": "d1586-13",
  "text": "FOURTH RADIO FREE EUROPE TRANSMITTER GOES ON AIR IN PORTUGAL\nA 50 kilowatt short wave transmitter near Lisbon, Portugal, has started relaying Radio\nFree Europe programs through the Iron Curtain, it has been announced by General Lu¬\ncius D. Clay, national chairman of the Crusade for Freedom.\nGeneral Clay revealed that with the inauguration of this transmitter, Radio Free Eu¬\nrope now operates four $0 kilowatt short wave transmitters in Portugal, made possible\nby the contributions of the American people to the 1951 Crusade for Freedom*\nRadio Free Europe now broadcasts daily to six Iron Curtain countries for a total of\n300 hours per week over a network of nine freedom stations. In addition to the four\ntransmitters in the Munich and Frankfort areas of Western Germany.\nPortugal Selected Due to Short Wave Relay Position\nThe four Portugal transmitters, located in Gloria, a village i;0 miles northeast of\nLisbon, are operated by a joint Portuguese-Radio Free Europe corporation named Socie-\ndade Anonima de Radio Retransmissao (RARET). Under the terms of an agreement with\nthe Portuguese government, RARET facilities are used exclusively by Radio Free Europe\nto relay programs originating in its Munich studios to Albania, Bulgaria, Czechoslo¬\nvakia, Hungary, Poland, and Rumania.\nPortugal was selected as the site for Radio Free Europe's new transmitters because of\nits excellent short wave relay position to Eastern Europe, General Clay said. He\npraised the government and the people of Portugal for their cooperation in making the\nRadio Free Europe installations possible and c ompleting their construction in the\nrecord-breaking time of less than six months. Ground for the transmitter building in\nGloria was broken last September and the four transmitters were on the air by the end\nof February.\nThe first of the four 50 kilowatt transmitters in Gloria went on the air Christmas\nday, beaming Radio Free Europe programs to the Communist satellite states. The second\ntransmitter started broadcasting operations in January, the \"bird early in February\nand the fourth on February 27.\nRARET’s installation at Gloria includes a half-mile long antenna system designed to\nmagnify the power of the transmitters and provide pin-point accuracy for Radio Free\nEurope broadcasts to Eastern Europe.\nMultiple Transmissions Possible\nIn order to relay programs to Portugal from Radio Free Europe's broadcasting head¬\nquarters in Munich, two 10 kilowatt transmitters have been installed by Radio Free\nEurope. These programs are received at RARET1s modern receiving station ten miles\nfrom Gloria and then fed to the powerful 50 kilowatt transmitters in Gloria for re-\nbroadcast through the Iron Curtain.\nIn this way. Radio Free Europe’s program can be broadcast simultaneously, on differ¬\nent wave lengths, to Eastern Europe by transmitters in Munich, Frankfort and Portur-\ngal. The transmission of programs over several frequencies enables Radio Free Europe\nto reach a maximum potential audience in the Soviet captive states and counteract the\nefforts of the Communists to jam the programs.\n\"The expansion of Radio Free Europe, which started broadcasting on July 1+, 1950, with\na single low-powered transmitter, is a tremendous achievement,\" General Clay said.\n\"Much of the credit for this hard-hitting campaign against Communism goes to the\nAmerican people who have given so generously to the Crusade for Freedom."
}