{
  "id": "d1586-14",
  "text": "THE NAEB TAPE NETWORK\nPrepared by Richard Rider\nNAEB Tape Network Manager\nUniversity of Illinois, Urbana\nA CALL FOR PROGRAMS\nIt was reaffirmed at the recent Purdue meeting of the program committees that one of\nthe important functions of the tape network is the interchange of programs produced\nby member stations. This function presupposes that the menber stations will submit\nprograms for use by the network. Our present purpose is to stimulate this latter\nprocess.\nIn addition to regular programs the network needs in-school programs. While other\nsources are being investigated we are, at this time, coupletely dependent upon our\nmember stations for in-school programs.\nIt is only by sorting through many possible series that we can keep a high level of\nquality and achieve the diversified and balanced schedule which we all desire. We at\nheadquarters and the members of the program committee can only listen to the programs\nwhich you send in,\nBRIEFLY: PLEASE SEND IN SOME PROGRAMS. We are starting to plan the fall offerings\nnow. We plan to have the in-school committee select the next school programs at the\nIERT in Columbus. We hope to afford you the opportunity at Columbus to hear some of\nthese programs. None of this is possible, of course, unless we receive some programs.\nThe following points should be kept in mind*\n1. Send to Network Headquarters?\na. Prospectus of series showing number and titles of programs, time, talent,\nformat, etc.\nb. Several representative programs for auditioning.\nc. Teacher’s manuals for school programs.\n2. Be prepared to furnish us with original recordings of all programs accepted\nfor use.\n3. Headquarters returns or replaces all tapes submitted either for audition or\ndistribution.\niw It is desirable to have scripts, promotion materials and any other available\ninfornation that would be helpful to stations using the programs.\nNEW WORD ON THE DUPLICATOR\nNo sooner do we say soma thing about the mass duplicator than the little wheels spin\nand all is different. HOWEVER, (and I say the following advisedly) this time it\nlooks like the real thingj\nL. S. Toogood, our original inspiration for mass duplication of tapes, has completed\narrangements with Rawdon Smith Associates, of Washington, D.C., for the distribution\nof duplicators. The mechanical part is supplied by Toogood. Smith adds all the elec¬\ntronic circuits, installs the machine, and checks it out to insure that it is perform¬\ning according to the desired standards.\nLf present negotiations are completed on schedule we will have a duplicator by summer.\nBy fall we can say goodby to the \"bicycle network.\" We will, at long last, be in\nbusiness."
}