{
  "id": "d1586-17",
  "text": "-18-\nThe results of the broad program of research can only be sailed here* One interest¬\ning passage sunmrizes txhe types of \"syndromes\" found among persons high on measures\nof authoritarian potential, tfe offer a condensed version of two of the 6 syndromes\nso that you may sample the findings;\n1. Surface resentment. This is really a sociological type which includes the \"more\nrational, either conscious or preconscious, manifestations of prejudice.\" Such per¬\nsons have a \"generality of prejudiced outlook;\" they \"accept stereotypes of prejudice\nfrom outside, as ready made formulae, as it were, in order to rationalize and psycho¬\nlogically or actually, overcon© overt difficulties of their own existence.\" They are\nable to give sensible reasons for their prejudice and are accessible to rational argu¬\nment. \"Here belongs the discontented, grumbling family father who is happy if some¬\nbody else can be blamed for his own economic failures, and even happier if he can de¬\nrive material advantages from anti-minority discrimination...\"\n2. The manipulative. Regarded by the authors as \"potentially the most dangerous\none,\" this syndrome is defined by extreme stereotype. Organizational categories fill\nthe outlook of this type of person, along with concern for the technical aspects of\nlife, social and other. They treat everyone and everything as objects to be manipu¬\nlated. They are sober and intelligent. \"They do not even hate the Jews; they cope\nwith them by administrative measures without any personal contacts with victims. Anti-\nSemitism is reified, an export article...Their cynicism is aLmost complete; ’The Jew¬\nish question will be solved strictly legally’, is the way they talk about the cold\npogrom*..The ingroup-outgroup relationship becomes the principle according to which\nthe whole world is abstractly organized.\" In Germany, Himmler personified this type •\nSpace does not permit a similar summary of the types found at the other end of the\nscale. However, it is concluded that greater differences are found among the types\nof people who are low on the authoritarian scale than at the other extreme.\nThe authors fortunately stated the policy implications of their research. One might\nthink of radio programs on tolerance as he reads:\n\"It follows directly from our major findings that counter-measures should take\ninto account the whole structure of the prejudiced outlook. The major\nemphasis should be placed, it seems, not upon discrimination against\nparticular minority groups, but upon such phenomena as s'+Treotypy,\nemotional coldness, identification with power, and~general destructive¬\nness! When one takes this view of the matter it is not difficult to see\nwhy measures to oppose social discrimination have not been more effective.\nRational arguments cannot be expected to have deep or lasting effects upon\na phenomenon that is irrational in its essential nature; appeals to sym¬\npathy may do as much harm as good when directed to people one of whose\ndeepest fears is that they might be identified with weakness or suffering;\ncloser association with members of minority groups can hardly be expected\nto influence people who are largely characterized by the inability to have\nexperience, and liking for particular groups or individuals is very diffi¬\ncult to establish in people whose structure is such that they cannot really\nlike anybody; and if we should succeed in diverting hostility from one\nminority group we should be prevented from taking satisfaction by the\nknowledge that the hostility will now very probably be directed against\nsome other group.\" (p. 973 emphasis supplied.)"
}