{
  "id": "d1586-3",
  "text": "PUSH BUTTON RADIO RELAY IN MICHIGAN\nFlint, Michigan, will have one of the first twelve push-button radio stations in the\nnation when WAJL (FM) returns to the air this month under the auspices of the Uni¬\nversity of Michigan. The station was given to the University on February 19 by an\nanonymous donor.\nThe University Broadcasting Service has applied to the Federal Communications Commis¬\nsion for permission to operate WAJL entirely by remote control from Ann Arbor. The\ncommission is studying the request and a favorable answer 4 believed forthcoming in\nthe very near future. Under the plans submitted by University engineers, the entire\ncontrol of WAJL would be by micro-wave signals from the main studios in Ann Arbor.\nThe University now operates WUOM, a UU,000 watt (ERP) FM station broadcasting on 91*7\nmegacycles. A special FM receiver installed at the WAJL transmitter will be tuned\nto WUOM's frequency. Leading off from this will be a sensitive chain of relay\nswitches which can be tripped only by a supersonic tone signal coming over WUOM.\nWhen a WUOM engineer wants to put WAJL on the air, he will press a button, which\nwill transmit the supersonic tone for a fraction of a second. In Flint, a relay will\ntrip, power will flow into the WAJL transmitter, and the station will be on the air.\nAt the Close of the broadcasting day, the station can be turned off the same way.\nAccording to F.C.C. secretary, T. J. Slowie, only eleven authorizations for remote\ncontrol FM stations have been issued throughout the country. Some of these are not\nyet on the air.\nWhen the system is approved, station WAJL will carry the current schedule of Univer¬\nsity of Michigan educational, sports and musical programs. The normal broadcasting\nday will begin at 12 noon and continue until 10:30 p.m. Monday through Friday. A\nsegment of each day's schedule will be devoted to programs for daily classroom lis¬\ntening in Michigan's rural schools. Several hundred rural schools already are using\nthese shows and station WAJL will become a vital link in transmitting the series to\nnew areas. Sport schedules and special events will be aired over the weekends.\nKUOM RECORDS FOR VOICE OF AMERICA\nKUOM staff members and station facilities were put to work for the Voice of America\nApril h to help produce and record a musical salute from thp Minneapolis Symphony\nOrchestra to Florence, Italy.\nThe program was a regular Minneapolis Symphony concert given at Northrop auditorium\non the University of Minnesota campus. Chief Engineer Berton Holmberg and engineer\nLarry Larson tape-recorded the program while Northop Dawson, Jr., program-production\ndirector, assisted Walter Ducloux, VOA music chief, in production.\nThe concert included an intermission program with short talks by Minneapolis' Mayor\nEric Hoyer, Antal Dorati, orchestra conductor, Baron Carlo De Ferrariis Salzano, the\nItalian consul general from Chicago and several Italian-Americans.\nAccording to Ducloux, the aim of this music good will gesture is to demonstrate that\nAmerica has a high quality of cultural as well as industrial production. \"It's a\nkind of people-to-people diplomacy,\" he said.\nThe tape will be sent to Florence for broadcasting and will be heard throughout\nItaly over Italian national radio facilities.\nThe program is one in a series being worked out by the U.S. Department of State in\nwhich major orchestras of the country are saluting a number of important European\ncenters."
}