{
  "id": "d1586-7",
  "text": "-8-\nHOPKINS SCIENCE REVIEW TO BE PRODUCED IN BBC STUDIOS\nThe British Broadcasting Corporation has invited Lynn Poole, creator and producer of\n\"The Johns Hopkins Science Review\" to consult and work with its production staff at\nAlexandra Palace in London, and to produce three programs in the BBC studios,\nMr* Poole will leave for London by plane on Tuesday, April 22, returning to the\nUnited States late in May. While there he will consult with British TV personnel,\ngive several lectures and present three \"Science Review\" programs* For these programs\nBritish scientists will be the guests and demonstrate current developments in British\nscience. These programs will be kinescoped and flown back to the United States and\nshown to the American audience at the regularly scheduled time, Mondays at 8:30 P.M.\n(E.S.T.)\nIt is believed that this will be the first time a network television series has been\ninvited to appear and originate its programs in a foreign country, and will be the\nfirst American television series to be presented in England from the BBC’s studios*\nOne of the programs presented will be about British television itself; how it was\ndeveloped, how programs are presented in England* The first television set to be\ndeveloped in England by John Logie Baird will be shorn, as well as photographs and\nfilm taken from this set.\nAnother of the programs will be broadcast remote from one of the British scientific\ninstitutions. The third program will cover the development of jet planes and will\nshow the British passenger jet-propelled plane.\nThis is the second international project of \"The Johns Hopkins Science Review.\" Last\nyear the French television directors requested kinescopes of the program through\nUNESCO* Two kinescopes were sent, shown on French television and have since been\nshown to many groups by UNESCO.\nSURVEY OF BRITISH WEEKLIES TO BECOME WEEKLY FEATURE OF WNYC\nIn line with its policy of keeping the American public informed about what people in\nother countries are thinking and doing, WNYC started a new series of weekly programs,\n\"Survey of British Weeklies,\" on February 2k at 1*30 p.m.\nThese transcribed broadcasts consist of summaries of the contents of British weekly\nperiodicals. They will be heard exclusively in the New York area by special arrange¬\nment with the British Broadcasting Corporation.\nSince Christmas of last year, WNYC has been keeping its listeners up-to-date on cur¬\nrent Italian thinking through the weekly series of transcribed broadcasts from Rome,\n\"Letter from Italy,\" heard every Monday at 5tk$ to p.m.\nUNIVERSITY OF TENNESSEE ISSUES BROCHURE ON ITS USE OF RADIO\nThe University of Tennessee recently issued a brochure entitled Radio at the Univers¬\nity of Tennessee which states the basic philosophy and reviews the experiences of the\nUniversity in its use of radio.\nThe booklet surveys the History of Radio at the University, reports on its Broad¬\ncasts On Commercial Stations, and goes into detail on The Who, What, How and Why of\nWUOT (the University’s own station—an NAEB member)* Copief are available from\nF. C. LOWRY, Dean of University Extension, Knoxville, Tennessee."
}