{
  "id": "d1678-2",
  "text": "istered as engineers.\nSome excellent papers were presented during the\n3 full days devoted to the presentation of engineering\npapers. Eleven of these papers covered radio sub¬\njects, and 18 were devoted to TV engineering.\n* * * *\nI have no idea how many manufacturers were\nrepresented at the Equipment Exposition. Space in\nthe Conrad Hilton Exhibition Hall was filled and\nthere were a number of equipment representatives\nexhibiting on the 5th or 6th floors of the hotel.\nProgram services, networks and others were also\nthere providing something of interest to everyone in\nthe broadcast industry.\nAs I saw it, the theme of the NARTB equipment\nexposition was “automation,” with automatic devices\nbeing displayed for both radio and TV programming.\nThese automatic devices were shown by Gates,\nAmpex, and General Electric. RCA also is working\non an automatic program device.\nVidicon equipment was much in evidence. RCA\ndisplayed its new, broadcast quality vidicon camera.\nKin-Tel, Sarkes-Tarzian, Dage and General Electric\nalso were showing vidicon camera equipment for\nlive and film use. In much of this equipment the\nfilm and live camera chassis is interchangeable.\nIn the field of video recording, Dage and Sarkes-\nTarzian were showing 16mm kinescope recording\nequipment built to sell for less than $8000. Ampex\ndemonstrated its videotape recorder in the recently\ncompleted installation at the ABC-TV studios.\nThree of the prototype models have been installed,\nthe first to incorporate the much desired feature of\nuniversal playback. As a result of non-interchange¬\nability on earlier prototype models, CBS solved this\nprobLem by storing the recording head with the pro¬\ngram tape in order to accomplish a 4 week delay on\nthe Arthur Godfrey programs.\nTape continues to be the major problem of video¬\ntape recording, and tape manufacturers are working\nhard to solve tape problems. Some tapes now have\na life of 200 passes—100 recordings and 100 play¬\nbacks. An hour's tape costs $200, so when this life\nis achieved, cost is only $2 per hour. However, cost\nper hour skyrockets when the tape only lasts 10\npasses.\nAnother item of interest displayed was a device\nto reduce “burn in” on image orthicon cameras. It\nconsists of a mechanism to oscillate the lens board\nof the TV camera, at the same time providing an\nelectrical cancellation of the resulting vertical and\nhorizontal motion.\nIt was demonstrated with an image orthicon with\nover 1000 hours service which had been discarded\nbecause of burn in. The camera was left stationary\non a test pattern and, due to the action of the device,\nshowed no burn. With the device turned off a “burn\nin” was evident in 15 seconds. Visual Electronics\nmanufactures this equipment which sells for $2400.\nIt is impossible to mention all the equipment\nshown and manufacturers represented. They ranged\nfrom 10 watt TV translators to a new 50 kw GE AM\ntransmitter with only 16 tubes, and included every¬\nthing from antennas and audio equipment to micro-\nwave equipment, rear screen projectors, test equip¬\nment and a new monochrome AGC video amplifier.\n* * * *\nMore details on Videotape operation will be\nfound in the April 1, 1957, issue of Broadcasting-Tele¬\ncasting, “VTR—Out of the Lab, onto the Firing\nLine.” More details on the NARTB Convention are\nin the April 15, 1957 issue of the same publication.\n* * * *\nA great deal of interest has been aroused by\npapers presented at the recent IRE Convention in\nNew York and the NARTB Broadcast Engineering\nConference in Chicago, which covered TV test signals\ntransmitted during the vertical blanking interval of\nthe TV signal. These signals have been transmitted\non an experimental basis by the networks.\nThe FCC on April 4, 1957, authorized all stations\nto transmit these signals without further specific\nauthority as long as they do not interfere with syn¬\nchronization, nor degrade the quality of the picture.\nCopies of this notice are being sent to all ETV op¬\nerating stations through the cooperation of Cy Braum\nof JCET.\n* * * *\nDr. George R. Town, executive director of the TV\nAllocations Study Organization, expressed hope at\nthe NARTB convention that a major portion of the\nwork of his organization will be completed within\na year. TASO consists of 5 basic panels now at work,\nwith 131 engineers from 67 organizations serving as\nmembers, alternates or observers.\nOne of the basic and immediate needs of the FCC\nis comprehensive and accurate engineering informa¬\ntion on which to base TV allocations decisions. Panel\n4, of which I am a member is at work in an attempt\nto secure new propagation data. The second meet¬\ning of this panel was held in Washington on April\n17, and preliminary reports of the Committee 4.1 on\nMeasurement of Service Fields and Committee 4.4\non New Factors were presented and discussed.\nWhile many educational institutions are repre¬\nsented on TASO panels, only Robert C. Higgy of\nWOSU-AM-FM-TV represents an operating TV\nJUNE, 1957\n3"
}