{
  "id": "d1678-4",
  "text": "ELECTRONIC SYNC FOR DOUBLE\nSYSTEM KINESCOPE RECORDINGS\n—James Leonard\nChief Engineer, WCET\nAt WCET we have used the space provided for pre¬\namplifiers in our Stancil-Hoffman S/5 Magnetic Film\nRecorder to incorporate an electronic sync cueing\nsystem. This is used in conjunction with our kine¬\nscope recorder to make double system television re¬\ncordings. This device produces a sync cueing signal\nsimultaneously on the tape and on the kinescope neg¬\native for use when the film and tape are edited to\nmake the composite print.\nThe sync unit is a multivibrator type oscillator\nwhich produces horizontal bars on the kine and sound\non the tape. The wave-form is that of the usual\nmultivibrator. No attempt was made to sync the\nrate (about 360 cycles) to the field rate since it was\nnot believed necesary. Figure 1 shows the unit\nmounted on the shelf of the ARP4 amplifier occupy¬\ning the space provided for two preamplifiers. The\n3x4x6 inch chassis is a snug fit in this space. Video\noutput and output control are shown on the back of\nthe chassis as well as the location of the sync cue\nswitch on the amplifier panel. This places the cue\nswitch below and slightly to the left of the “record”\nbutton of the ARP-4 as shown on Figure 3. This\nmakes for ease in cueing since once the recorders have\nbeen started the cue switch can be flipped up mo¬\nmentarily and the cueing is done.\nThe unit gets its two 12 volt d.c. supplies and also\nits B plus from the Jones sockets intended for the\npreamplifiers. The sound output feeds directly into\nthe #1 volume control on the ARP4 and the level can\nbe set for a convenient zero on the V.U. meter. The\nknob on the rear of the chassis sets the level for the\nvideo bars. The two Jones plugs mounted on the\nfront of the chassis, plug into the preamp sockets. See\nFigure 2.\nThe low impedance video output from the cathode\nis fed via RG 59/U coax to the video input on the\nkinescope recorder in place of the normal video input,\nwhen the cue switch is thrown. The relay and the\nthree coax connectors are mounted in a small shielded\nbox near the associated coax connectors on our GPL\nrecorder.\nAs is usually the case, after the first model of a\nnew unit has been constructed, ways of improving on\nthe original become evident. It is quite apparent that\na unit the size of one preamp (one-half the size of our\nunit) could be built. This would permit the use of\none preamplifier, if required. The heater of the 12AT7\nwould be substituted for the 75 ohm resistor in series\nwith the relay. When the switch is operated the\n12AT7 heater would be opened just long enough to\noperate the relay during the sync operation. The\ncathode would hold its heat during the cueing interval,\nand only one Jones plug and half the space would be\nrequired.\nJUNE, 1957\n5"
}