{
  "id": "d1754-5",
  "text": "taught by Prof. T. J. Crawford of the University\nSchool of Business’ office training department.\n“Classes,” which started June 17, are held from\n1:30 to 2 p.m., Mondays, Wednesdays and Fridays.\nViewers in the WTTV area who are enrolled, received\ntheir instructional material through the I. U. Division\nof Adult Education. No college credits are offered for\nthe course.\nOne group of university students participates in\nthe TV course while another group is taught in the\nclassroom. At the end of the summer, both groups’\ntyping skill will be compared to test the relative ef¬\nfectiveness of each instruction method.\n^ The Educational Television and Radio Center in\nAnn Arbor, Mich., reports having contracted with\nWCET, its noncommercial affiliate in Cincinnati, for\nthe production of a series of programs introducing\nscience to youngsters from 4 to 7 years old. Pro¬\nduction of the twenty-six 15-minute programs, en¬\ntitled Uncle Wonder s Workshop, was estimated at\n$23,000.\n^ The University of Nebraska has been offered a\ngrant of $115,050 by the Fund for the Advancement\nof Education to continue its TV-correspondence in¬\nstruction in Nebraska high schools.\nThe grant will enable the expansion of a “first-\nyear algebra” course now offered by KUON-TV to\nsix high schools. If formally accepted by the Uni¬\nversity’s Board of Regents, the new financial support\nwill probably be used to offer additional courses in\nplane geometry, American history and “senior\nEnglish.”\n► The nation’s oldest ETV station, KUHT, at the\nUniversity of Houston, Tex., has extended its services\nto include the animal kingdom.\nIn a weekly series of 15-minute programs, Harvey\nB. Richards, American Kennel Club licensed obedi¬\nence judge and experienced trainer, offers a course to\ndog owners in how to train their pets. Richards uses\nhis titled obedience-trained Weimaraner and Minia¬\nture French Poodle for his demonstrations.\n► Beginning July 7, WBJB-TV in Roanoke, Va.,\nwill inaugurate a church school of the air to supple¬\nment classroom instruction in churches. The project,\nwhich was hailed by the National Council of Churches\nand TV industry spokesmen as a “precedent for the\nnation,” is the first attempt to teach church school\nby TV.\n—N A E B—\nThe New York University received a plaque from the\nFederation of Hellenic American Societies for its\nTV series “Our Nations Roots\" The series depicts\nthe contributions of immigrant settlers to the growth\nof the United States.\nTV TECHNICAL TIPS NO. 34\n—Cecil S. Bidlack\nNAEB TV Engineer\nNews of the month centers around publications of the\nEngineering Service. A two-page mailing of additions\nto the NAEB Test Equipment Inventory was sent to\nall chief engineers on our mailing list on June 12. The\nJune Engineering Newsletter is at the printers and\nshould be in the mail by the end of the week.\nIncluded with the ENL is a four-page list of ad¬\nditions and corrections to the NAEB Technical Di¬\nrectory. This brings the February 1 directory up to\ndate as of June 1. We urge you to help us keep this\ndirectory up to date by keeping us informed of\nchanges on your technical staff. Many times, the only\nnotice we have of a person’s departure is the return\nof mailing by the post office. When this happens, we\ndelete the name from our mailing list.\nThe June ENL also features an article by James\nR. Leonard, chief engineer of WCET in Cincinnati,\nOhio. He gives constructional details of an electronic\nsync device for double system kinescope recordings\nwhich is incorporated in their Stancil-Hoffman S/5\nMagnetic Film recorder.\n*****\nA second issue of a Staging, Lighting and Graphic\nArts Newsletter was also mailed this month. This we\npublished with Dick Lawson of the WILL-TV staff.\nThe June 10 issue contains an article by Bob Peary\nof the TV staff of the University of Alabama on the\n“Selection of Title Printing Equipment for TV.” It\nalso has a revised edition of an article by George\nMurphy of the TV Studios of the Alabama Polytech¬\nnic Institute on “Slide Making for Television.”\nWe know that our mailing list of staging, lighting\nand graphic arts personnel is far from complete. Ad¬\nditional copies of this newsletter are available which\nwe’ll be glad to send to those interested. If you wish\nyour name on the mailing list, we’ll be glad to include\nit.\n*****\nDuring the past month we’ve received copies of\nthe thirty-one technical papers presented at the 1957\nNARTB Broadcast Engineering Conference in April.\nIf any if our readers are interested in the list, we’ll be\nglad to send them a copy. Most of these papers are\navailable from the authors upon request.\n*****\nThe new Spectra C-3 Brightness Spot Meter, just\nannounced, should prove to be a very useful tool for\nTV studios, especially for those making a serious at¬\ntempt to control brightness ratios. This instrument is\nentirely self-contained, being battery operated. A\nmaximum battery life of over 400 hours operating\ntime is claimed due to an automatic switch in the\n6\nNEWSLETTER"
}