{
  "id": "d1747-0",
  "text": "WASHINGTON REPORT\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue, N.W., Washington, D.C., 20036\nVolume V Number 10\nJune 26, 1964\nFRYMIRE LEAVES FCC POST AND MOVES TO CALIFORNIA\nDr. Lawrence Frymire, Chief of the Educational Broadcasting Branch of the FCC,\nhas resigned his position effective August 1. On or about September 1 he will assume\nthe position of Television Coordinator for the State of California, and establish\noffices at the Department of Finance in Sacramento. Frymire will work with the\nGovernor's Advisory Commission on Educational Television to develop a state plan and\nsupervise its implementation. His successor at the FCC has not been selected.\nHARLEY ATTENDS EBU GENERAL SESSION\nNAEB President Harley attended the Fifteenth General Assembly Meeting of the\nEuropean Broadcasting Union held in Vienna, Austria, June 18-22. NAEB is an Associate\nMember of the EBU, and as such has taken an active part in their all-over activities.\nThe cost of this trip, like NAEB's recent participation in the EBU ITV Conference in\nTokyo, was financed by funds from outside sources.\nHEW GRANT TO CHARLOTTE-MECKLENBURG\nApproval of a $191,378 grant to help activate educational television facilities\nin the Charlotte-Mecklenburg area of North Carolina was announced June 11. The grant\nwas made to the Board of Education to activate station WTVI on reserved Channel 42.\nTotal cost of the new equipment which includes four studio cameras, video switcher,\nand two video tape recorders, is estimated at $284,657* The new station expects to\nmake ETV service available to an area with a population in excess of 400,000, including\n266,800 students.\nETV APPLICATIONS ACCEPTED FOR FILING\nThree new applications for a total of $907,909 have been accepted for filing\nunder the ETV Facilities Program. The applications are from:\nArkansas Educational Television Commission, little Rock, Arkansas, for $293,569\nto activate Channel 2 at little Rock. The total project cost is $587,138.\nUniversity of North Carolina, Chapel Hill, North Carolina, for $209,127, to\nactivate Channel 2 at Columbia, North Carolina. Total cost of the project is $555,243-\nBoard of Education of the City of New York, for $405,213 to activate Channel 25,\nNew York City. The project cost total is $810,426.\nThis brings to 20 the number of grants allocated since funds became available\nin my, 1963. They total $4,995,368 in Federal funds. Accepted for filing and awaiting\nfurther action are 40 applications which request a total of $8,424,453*"
}