{
  "id": "d1747-0",
  "text": "Office of Executive Secretary\nUrbana, Illinois\nMarch 1, 1940\nWHAT ARE YOUR VIEWS ON COPYRIGHT?\nProfessor W* I0 Griffiths WOX, points out the dangers which will be\ninvolved in any new legislation relating to copyright which Congress\nmay enact* either at this session* or perhaps at some later time.\nShould not any new law provide protection for the non-commercial*\neducational and municipal station? What other provisions should be\nin the law? What should NaEB do about this problem? Write now what\nyou think about it*\nRCA-VICTOR AGREES TO SPECIAL CONSIDERATI ON\nThe special committee of NAEB which has been conferring with RCA-\nVictor regarding the use of phonograph records by the non-commer¬\ncial educational and municipal station reports that information can\nsoon be sent NAEB members within this group. It appears that RCA-\nVictor will agree to a lowering of the rate originally asked*\nHOW ABOUT BROADCAST MUSIC, INC?\nSome* if not all NAEB station members, have received letters from\nNeville Miller asking them to accept licenses from broadcast Music,\nInCo Broadcast Music, Ino. was willing to make a special concession\nto the non-commercial stations, but a number of NAEB have failed to\njoin the movement at the present time, feeling that their action\nmight be Interpreted as taking sides in the so-called fight between\nASCAP and commercial radio interests. All non-commercial education,\nmunicipal* and religious stations enjoy complimentary licenses from\nASCAP, and have used this music royalty free for years.\nHURRAY FOR KWSC\nKenneth E. Yeend, Director of KWSC, wrote m© recently: \"Sometimes\nI feel that we are a bit negligent in sending you the activities of\nKWSC. However* here goes for some items.\" Well, I want to say if\nevery NAEB member broke forth with news as the boys from KWSC have\ndone this year, the News Letters might have blossomed forth as it\nhad never done before. It heartens ye secretary to hear from\nyou-all. Now President Ingham and Treasurer Griffith have had me\non the run (not to mention Joe Wright), and some few others have\ncontributed a bit now and then, but how about some more contribs*\nAnyway, here goes with Kenneth Yeend of KWSC:\n\"KWSC has recently arranged for leased wire facilities between Its"
}