{
  "id": "d1747-6",
  "text": "NAEB NEWS LETTER.•.MARCH 1, 1940,..Pag© 7\n\"Five years ago\", commissioner Studebaker saids \"educational radio\nwas a phrase in search of a definition. Today it is a going concern.\nIn thousands of schools, homes, clubs, uCC camps, educational radio\nis adding to the meaning of life. Radio helps the eighth grade pupil\nto see his geography as an exciting adventure. It brings classics\nof music and literature to a busy housewife. It aids citizens to\nknow more about the Government they buy with taxes. But Its posaiblli-\nties for education of our people have only been scratched.\n\"Among the clientele of the U, S. Office of Education Radio Division\nare millions of Americans, ranging from youngsters literally glued to\nradio sets listening to adventures of scientists on the Amazon, to\neducators eagerly seeking new techniques for education.\"\nFCC TAKES ACTIONS\nImportant to every radio station are recent actions of the FCC. Some\nof the Commission’s actions are of especial interest to the educational\nbroadcasters. Briefly, some recent actions include:\nPreparatory to the reallocation of standard broadcast stations as a\nresult of the recently ratified Rorth American Regional Broadcast\nAgreement, the FCC has suspended its yearly license basis and is\nterminating licenses on August 1. It now appears that the realloc¬\nation will take place on this date.\nThe FCC ordered the revocation of licenses of five Texas stations\nbecause of the applicants failure to make full disclosure to the FCC\nconcerning ownership, management, financing and control of stations.\nThe Commission has transmitted to the Department of Justice the facts\nconcerning the Turns \"Pot o’ Gold\" program, broadcast over the NBC\nnetwork, and a program advertising Mead’s Bakery, recently broadcast\nby stations KWFT and KBST at Wichita Falls and Big Springs, Texas,\nrespectively.\n\"The Federal Communications Commission is under no duty to protect\nlicensees of existing radio broadcasting stations from competition,\nin passing upon an application for a permit for a new station\",\nasserts the Federal Communications Commission in a brief filed with\nthe United States Supreme Court.contesting judgment of the United\nStates Court of Appeals for the District of Columbia in the case of\nSanders Brothers radio station WKBB, Dubuque, Iowa, v. F.C.C.\n\"The basic theory upon which broadcast licensee have always been\nallocated is that competition Is essential to the maintenance of\nhigh-quality programs,\" avers the Commission, explaining: \"This is\nbecause competition among stations for advertisers means competition\namong stations for listeners and this in turn means rivalry to\npresent the highest quality programs. Thus the character of radio\npresentations, and therefore the public Interest, is largely dependent\non competition.\"\nThe Commission points out that this view was stressed by the former\nFederal Radio Commission in an early report to Congress and more\nrecently was expressed in the case of Spartanburg Advertising Company\nwhen the Commission declared that \"neither the license now enjoyed\nby petitioner nor any provision of the Communications Act of 1934"
}