{
  "id": "d1352-1",
  "text": "2\nEDUCATIONAL RADIO BROCHURE\nThe booklet, to be made up from the data and pictures submitted by stations\nin reply to a rush call a few weeks ago, is now in the process of being prepared\nfor distribution. The Federal Radio Education Project and the National Committee\non Education by Radio are cooperating in producing it. Copies will be sent to\nmembers as soon as they are available.\nNATIONAL CONFERENCE ON EDUCATIONAL BROADCASTING\nOur Association is one of the sponsoring organizations for the National Con¬\nference on Educational Broadcasting to be held in Washington December 10-12.\nPrograms, out soon, reveal an impressive array of national leaders scheduled to\ndirect thinking on all aspects of educational broadcasting. Better make plans now\nto attend. NAEB should be well represented.\nASSOCIATION TRANSCRIPTION EQUIPMENT\nThe recording device acquired last spring by the NAEB for demonstration work\nis much in demand. Carl Menzer, at WSUI, Iowa City, is handling the machine and\nrouting it to those who wish to use it. Neatly packed in a substantial shipping\ncase the machine is on a circuit which is taking it to several member stations.\nApplications to use the recorder should be sent to Mr. Menzer, Several stations\nalready have their own recorders, and more are planning to acquire them.\nAGAIN - THE PACKET EXCHANGE\nAlready some members have started sending bulletins and material for the \"ex¬\nchange packet\". This activity bases its continuance on the support of members who\nsupply the pieces to be distributed. Your new fall bulletins must now be ready.\nLeave a memo for your secretary to send 50 copies of everything you have for dis¬\ntribution to the Secretory. By this exchange of ideas we can do much to further\nthe cause of education on the air.\nKWSC - STATE COLLEGE OF WASHINGTON\nDirector Frank Nalder says, \"Radio Station KWSC at Pullman, Washington is re¬\njoicing in the possession of a new vertical antenna which has been erected on its\nmain tower by student technicians during the past months. An additional feature\nof its equipment is a copper wire counterpoise made of thousands of feet of No. 10\ncopper wire, buried in the ground and radiating in all directions from the tower.\nRadio Station KWSC depends entirely upon student help for its technical and\nannouncing staff. The Directors of the station are making it a strong means of\neducation of young people in the radio arts and practices. As a result, many grad¬\nuates of the college are filling important radio positions throughout the United\nStates.\nKFDY - SOUTH DAKOTA STATE COLLEGE\nWith a smile we note an application of the old saying, \"It's an ill wind which\nblows no one some good.\" S. W. Jones writes, \"A news-note concerns our football\nbroadcasting booth. Our old booth, which was very inadequate, burned up (appropri¬\nately enough’.) during a firemen’s convention which was held in Brookings last spring.\nThe new booth contains broadcast as well as public address facilities, and enables\nthe announcing staff to put out a description of the game without fear of mechanical\nbreak-down during the broadcast. The new booth is greatly enlarged and thoroughly\ninsulated.\"\nWBAA - PURDUE UNIVERSITY\nClarence Damrnon sends an interesting letter in which he gives a lot of news\nabout his station. He says, in part, \"First of all we have had our first auditions\nfor new announcers. We had over one hundred applicants. About twenty-five will be\nselected to be put on probation for an indefinite period. If they demonstrate the\ndesired qualities, they will be assigned to the regular staff. Twelve regulars from"
}