{
  "id": "d1352-3",
  "text": "- 4 -\nfavorably with field intensity surveys made of the WOSU signal. Copies of this\nreport can be obtained upon application to WOSU.\n\"Three WPA projects are under way at WOSU for the Fall Quarter, 1936. An\norchestra project provides twenty-two professional musicians, an excellent orchestra\nwith several soloists, filling an important place on the station's programs.\nThe Radio Junior College assistance project, mentioned above, will be continued,\nA new project, begun during the summer, will be continued, providing a group of\nactors for the presentation of plays, and the reading of scripts.\n\"Several Ohio commercial stations will continue to rebroadcast WOSU programs,\nforming a state-wide network for release of WOSU programs. These stations, during\nthe past year, have broadcast as much as twelve hours per week of WOSU programs,\nall rebroadcast via radio. A complete statement explaining in detail the arrange¬\nment with all stations may be had upon request to WOSU.\"\nWCAL - ST. OLAF COLLEGE\nM. C. Jensen, manager of the station, spent the summer working as a consulting\nradio engineer. He reports having done extensive field work.\nMAD - UNIVERSITY OF OKLAHOMA\nSeptember 15 this station planned to move into its new studios in the $65,000\nMemorial Radio Tower on the campus, reported Ted Beaird some weeks ago. More data\non this later.\nKOAC - OREGON STATE AGRICULTURE COLLEGE\nLuke L. Roberts reports, \"KOAC was a pioneer in the field of parent education\nradio-study clubs. Last year, which was the ! sixth, was the most successful so far\nexperienced. In addition to broadcasts over KOAC the programs were featured over\nlocal stations in widely separated parts of the state by means of electrical\ntranscriptions made in the studios of KOAC.\"\nFACILITIES IMPROVEMENTS\nWBAA - PUPDUE UNIVERSITY\n\"During the month of August we extended our antennae towers end put up a new\ncage antenna about twice as long as our old flat top. Wc have completely remodeled\nour input equipment, and we now have the very last word, in equipment to meet all the\nrequirements of the commission. We have also purchased some RCA Velocities and\nEight-ball microphones. We are now in the process of equipping our four new studios\nin the Union Building which were built for us in the new addition. The University\nhas just purchased a new concert grand Steinway piano for use in the new music studio.\n.It has also purchased a complete RCA recording library which is one of the finest\nthings I have ever set eyes on. Every important musical work and master is repre¬\nsented in this library. We are installing a special pickup in our Union Studios for\nthe broadcast of this collection.\"\nWHA - UNIVERSITY OF WISCONSIN\nStepped up power to 5000 watts on September 16, 1936. Work now under way on a\nfourth studio and four additional offices in Radio Hall.\nWLBL, state-owned station at Stevens Point, Wisconsin, has secured an increase\nin power to 5000 watts. Is building new transmitter, moving to new location, and\nerecting a vertical radiator. Rebroadcasts many WHA features daily.\nSEND IN YOUR REPORTS!"
}