{
  "id": "d1183-1",
  "text": "-2-\nDAYTIME STATIONS BAFFLED & ANGRY AT FCC ST A STOP^ORDEB\nRadio attorneys who attended the recent FCC hearings on whethgr^r not to__gon-\ntinue Special Temporary Authorizations to daytime-only stations_feej^_the_gC^\nmove ignored policy considerationsf hearing evidence, and fry-passed normal hear¬\ning procedure.\nReportedly all testimony was in support 'of continuance„qf^^\neither fry the Commission1s'attorney or fry other opposition,—|CG nonetheless .with¬\ndrew the privilege and ignored formal and' informalypr otests J^„la^ej^.jhlO-ask|d\nwhat mod are hearings, if testimony is ignored. Qne^jaUoniey^^jLJ^\na 11 hoi low... mo c keryj1 p f administrative .proceedings and, set a danggrous precedent.\nNet result is to eliminate, all special events service by-daytime-only, stations\nincluding reporting of election returns in November. Daytime only stations m\nsmall town and rural- sections protest a substantial area of the country will be\nprevented from hearing local election results in November* < .\nSeveral stations have indicated they will carry the problem to Congress which is\nnotably sympathetic to small business point of view in-situations like this.\nSIDELIGHTS ON STA'o\n.TnUnHnat.inn of STa’ a could represent a severe bloWL_to_i.mpor_tant municipal .out-\nlets like WNYC. New York City Municipal Station,.\nnow operating under an SS-A\nuntil 10:00 p.m. if next logical step is to kill.\nthis privilege.\nWOT (Iowa State College)-registered protest along\n>• with 10 other stations. WOI\nhad used STA 'ti broadcast meetings of Des Moines\nFarm Institute, nation-wide\ngathering of agricultural leaders in this Mid-wes\n;t farm capital: state high\nschool basketball tournaments, and an address by.\nSenator Bourke Hickenlooper,\nchairman of the Joint Congressional Committeemen.\nAtomic Energy.\nGEORGIA TECH SPENDS HALF-MILLION FOR WGST -.\nExpansion program of tf.GrSJC., owned by Georgia School of Technology, moved a. step\nnearer this month when State Board of Regents, operators ol the station, called\nfor bids for construction of a $500,000 building to house station on the Georgia\nTech campus. The building, scheduled to be completed by. July 1, 1949 will con¬\ntain six studios for AM, Fk, and Television programs.\nAMERICAN UNIVERSITY WILL OFFER DEGREE IN TELEVISION\nStarting, in. September the American University,in Washington, D.C. will offer\ncourses in radio and television leading to a Bachelor of Science degree with\na major in- radio- and television.\nThis is..; the..first, time an accredited U. S. Unlversrty has officially recognized\nthe impact television has made and is likely to make on U. S. culture. e\nAmerican University has been offering courses in radio taught exclusively by\nprofessionals from various Washington stations,, the NAB, and-the FCC for the\npast three years."
}