{
  "id": "d1183-12",
  "text": "-13-\nABC TO BROADCAST METROPOLITAN PSrJCRMAI'TCES_.THIS,FALL'\nAmerican Broadcasting Company will again broadcast Saturday afternoon per¬\nformances of the Metropolitan Opera .during 194« and-1949. Broadcasts will\nin alH cover 16 performances. Announcement by ABC president Mark Woods_\nfollowed official confirmation that the Metropolitan would open ^is fall\nafter union difficulties had been settled. ABC is also considering\noast of opera performance if union agreements can be reached.\nEARIB MCGILL REPORTED SERIOUSLY.III\nEarle McGill, freelance'director and former production director for CBSis\nreported in serious condition in the Hospital for Joint Diseases in lew York\nCity! laken seriously ill at the Hollywood meeting of the Radio and Television\nDirector’s Guild of which he is president, McGill was hospitalized there,\nlater discharged, and then returned to the N.I. hospital,\nCBS TO AIR THIRD REPORT ON GEORGE POLK MURDER\nOn Sundry September 9 at 9=30 p.m. CBS will present \"Report Humber Three\" on\nthe murder of its radio correspondent in Greece, George Polk, whose body wa.\nfound floating in Salonika Bayhast May. Kinston Burdett, CBS Eorae correspon¬\ndent who has completed four months of investigation in connection with the\nmurder returned to the 0,S. to assist General William Donovan, counsel .or\nthe Lippman committee investigating the murder.\nKANSAS STATE COLLEGE CONDUCTS RADIO RESEARCH THROUGH KSAC\nH-A-E-B new member station KSAC, Kansas State College outlet, is being used a.\na research tool in a special program and listener project under spon.or.hip\nof the College and the United States Department of Agriculture.\nKSAC recently modernized, equipped with new studios, a new RCA 5000 watt\nKfi a new verticL \"antenna began operation with these new facili¬\nties during the fall of 1947. The station broadcasts from 9.30-10.30 a.m.,\n12:30-2:00\"p.m. and 4:30 to 5=30 p.m. on a time-sharing arrangement with l.IBi.\nThe modernized equipment and increased power permit effective coverage of\nthe entire state of Kansas*\nThe survey currently underway is supervised by L. 1. Longsdorf, station mana¬\nger alTc! E. Jaccard, extension economist with the-College. It involvest>\nselected Kansas counties which are being comprehensively surveyed by trained\ninterviewers rather than spot checked. Study will continue °ver a perio ; of\ntime wHh recurring visits to sample families, and will concern itself, not\noriy with amounts Ld times of listening, bit with variable factors of pro¬\ngram appeal*\nKansas State College in connection with KSAC operates_a radio training program\nin cooperation with the departments of Music, journalism, and speedh wit\ncourse-work leading to both a B.Sc, and anH.S. An electronics laboratory\nwith an operating experimental television transmitter is one .rea of\nspecialized training*"
}