{
  "id": "d1183-15",
  "text": "^OC J&i eve *Lm 4 & J&t&j\n-16-\n*\nDEPOSITORY LIBRARY SYSTEM IS ESTABLISHED\nAn extensive list of 109 depositories for literature on radio 'broadcasting, in\nlibraries throughout the United States, has beon established bythe NAB and the\nFederal Radio Education Committee of the U, S. Office of Education.\nInstitutions representing all types of libraries have agreed to participate in the\nplan, which will bring within easy roach of students and the public in general the\nbulk of the valuable literature on radio broadcasting.\nMechanics of the plan involve the placing of each depository library on a distri¬\nbution list which automatically sends to such a library all publications of the\nNAB, the FREC, all networks, and other sources which may join in the depository\nplan. This distribution follows the agreement of the library to serve as a\ndepository.\nDispersed in all states and in centers of radio and educational activity throughout\nthe nation, the depositories are expected to provide easy access for reference wor\nand research, and information centers for the answering of the many questions ask¬\ned about broadcasting.\nCurrent lists of participating libraries may be obtained from firs. Gertrude G.\nBroderick, secretary FRED, U. S.Office of Education, Washington, D. C. or Mrs.\nLouis K, Aldrich, librarian, NAB, 1771 N, St,, Washington, D.C.\nPURDUE U, HAS UNIQUE RADIO PLAN FOR INTERNATIONAL UNDERSTANDING\nWBAA N-A-E-B station at Purdue University has begun a new and unusual pro¬\ngram service aimed at promoting a better understanding of international\naffairs. The campaign is aimed at keynoting a factual approach to the\nhistory, geography, commerce and customs of the nations of the world.\nThe Purdue station is utilizing the service_of_nati^nals_of approxjgately\n35 countrics who are now enrolled as students in the.university. These\nyoung men and women will provide the basis for..a_MrMS^fJjjteQiQip.^s\nwell as\" music from their private collections for use_pnJ^BAA_j^ical,^pro-\ngrams.\nThe \"Voice of Purdue\" is using soot announcements as_woll_asi.featurg>,s^grios\non homo' noonoinics. agricultures\nfSiign nations. Transcriptions are boing requested_f^JA-^lQMi^Bl^\nof them are already cooperating.\nAll of this material submitted for use on the air goes through a screening\nprocess composed of Purdue faculty members familiar with the various sub¬\njects.\nFurther ooonoration in the plan is being_offorod_bZ_»ther ...gtatla^oQ^S\nNational Association of Educational Broadcasters and by comorcial. stations\nin the Purdue area."
}