{
  "id": "d1183-19",
  "text": "-20-\nFCC ACTIONS (AMPLITUDE MODULATION) COLLEGE, UNIVERSITY. INSTITUTIONAL\n910 KC - For Reduced Hours■ (Temporary) • v*‘\\\nWSUI- State University of Iov/a. Iowa City, Iowa - Granted request for permission\nto reduce operating hours from unlimited time to.a minimum of 6 hours daily from\nAugust 5 to September 20, 1948.\nFor Reduced Hours (Temporary)\nKFJM-University of North Dakota, Grand Forks/ N,D«; KlLO-Dalton LeMasurier, Grand\nForks, N.D., Granted requestsfor KFJM for permission to remain silent for the per¬\niod ending September 30,.1948, and of Station KILO (which shared time with KFJM\nto use the time relinquished by KFJM.\n•*** *** .\nFCC APPLICATIONS (FREQUENCY MODULATION) COLLEGE. UNIVERSITY71NSTITUTI0NAL\"\nFor CP Modification\nKSIH-Board of Education of the City,of St» Louis, St. Louis. Mo,-Modification of\nconstruction permit (B4-PED-40, as modified, which authorized a new FM broadcast\nstation noncommercial educational) for extension of completion date#\nFor CP Modification\nNEVJ-Haverford Township Senior High School.Havertowns. Pa.- Construction permit for\na new noncommercial FM educational broadcast station to be operated on frequency\nto be assigned by FCC with power of 2,5 watts..\nFor CP. Modification\nHNAD-FM-State University of Oklahoma. Norman. Okla#-Modification of construction\npermit (B3-PED-41, as modified, which authorized a new noncommercial educational\nbroadcast station) for extension of completion date#\nFor CP Modification\nYJSOU-Seton Hall College. South Orange. N. J. - Modification of construction permit\n(Bl-PED-78, as modified) which authorized a new noncommercial educational FM broad¬\ncast station to change ERP from 250 watts to 1 KW, and type of transmitter to RCA-\n'BTF-1C, maximum 1 KB#\nFor CP Modification\nKWGS-FM- The University of Tulsa. .Tulsa. Okla.- Modification of construction permit\nBPED-82, as modified) whibh authorized a new noncommercial educational FM broad¬\ncast station, to change ERP from 1 KW to 1.1 KW, and make changes in antenna system*\nFor CP Modification\nKOAG-FM-Oklahoma. Agricultural and Mechanical College. Stillwater;, OklaA-Modifica-\ntion of cohstruction permit (B3-PED-59/aslncdified) which authorized a new non¬\ncommercial educational broadcast,, station, for extension of completion date."
}