{
  "id": "d1183-22",
  "text": "FCC ACTIONS (FRECIJB^Y^O^^i^GNy^^^LEGE, UNIVERSITY, INSTITI3TIOMAL (Cont.)\nModification of- CP\nUBEZ-FM, Chicago Radio Council, granted modification of construction permit to\n10-1-48 (BMPED-132)\nModification of CP\nYJNYE-FM, Board of Education (Municipal Broadcasting System) New York City, granted\nmodification of construction permit to 10-30-48, (BMH2D-133T^\nModification of CP\nKOKH, Board of Education, Oklahoma City, Granted modification of construction\npermit to 1-21-49 TMPED-1347*~\nF^c\" A^IJCATIQNS~TTEl^TsT0Nr\"C0LLEGET~ijNIVERsTTyT INSTITUTIOnIiT\nlowa-WOI-TV-Ipwa State College of Agriculture and Mechanic Arts? Ames - Modifi-\n\"cation of construction permit (\"BPCT-120 as modified? xiHicTTauthorized\"a new\ncommercial TV broadcast station) for extension of completion date,\nFCC PROPOSES CHANGES IN HEARING PROCEDURE\nProposed - amendment s announced August 20 would see FCC he firings conducted under\nrevised procednr.il relations. Initial decisions would be issued by hearings,\nexaminers or commissioners presiding at hearings,\nActions presently handled by the motions commissioners, with certain exceptions,\nwould be acted upon by hearings examiners,\nIn this way the FCC explained, an initial decision would take the place of, and\nserve the same purpose as, a proposed decision of the Commission itself.\nPETITIONS FQ-, ST A ORDER DELAY ARE DENIED\nPetitions of nine licensees for reconsideration on postponement of the FCC\naction ending all special temporary authorizations were denied August 28 by\na Commission memorandum opinion and order.\nThe order said that the petitions had raised only one point not covered in the\noriginal report and order of June 2b, 1948, alleging that certain findings in\nthat order were not supported by evidence or statements in the ^record\"•\nIt added that the fact that operation beyond authorized hours by daytime only\nand limited time stations is inconsistent with Standards of Good Engineering\nPractice is sufficient proof that such .operation has produced a degradation' of\nnight service required by the standards.\nFCC RULES AND REGULATIONS LIST TO AUGUST 9. 1948\nA list of rules and regulations of the Federal Communications Commission up to\nAugust 9, 1948 was issued this month as a check against the FCC book of rules.\nThose who wish to chock their rules book against the list will find it published\nin the “Federal Register11 of August 10, 1948. The list is NCT available.for\ndistribution at the FCC. . . ."
}