{
  "id": "d1183-4",
  "text": "-5-\nAFRA PUTS THUMBS DOM ON NAVY TRANSCRIPTION SERIES\nA recruiting project for the U. S, Navy involving use of top network shows*\nminus commercials, to be distributed free to stations across the country was\nreported to have been scrapped due to an objection by the American Federation\nof Artists,\nThe arrangement, which had been okayed by Petrillo and the American Federation\nof Musicians came to grief when AFRA refused its okay unless full performer’s\nfees were paid for the transcription.\nNBC PLANS HEAVY PUBLIC SERVICE DOCUMENTARY SCHEDULE\nNBC, which has been undergoing criticism for large promises and short performance\non public service programming, reportedly has looked twice at the orchids dis¬\ntributed to other networks for achievements in the same field._The 194& NBC\npublic service sche'dule calls for throe hour-long documentaries dealing with the\ndivorce problem, the world food problem,, and U. S« military potential,_In ad¬\ndition to these major presentations, a host of shorter subjects under the general\nseries title. \"Living 194£n are due for airing.\nNCRTHVIBSTERNUNIVERSITY TO HAVE TELEVISION SEMINAR\nNorthwestern University is reported to be arranging a seminar on television broad¬\ncasting to begin this 1943 fall term. Upper classmen and selected students from\nthe university school of speech will be permitted to enroll. This TV seminar\nwill augment the already comprehensive series of radio courses offered at North¬\nwestern under the auspices of the Schools of Speech and Journalism,\nILLINOIS TECH ADDS A TELEVISION LABORATORY\nThe Illinois Institute of Technology is planning a program of television teaching\nand development for students at the school. Space is now being made available\nin a studio laboratory for operation of the training project.\nR. L. D. S. & Graceland College Plan New Missouri AM Outlet\nThe Reorganized' Church of Jesus Christ of Latter Day Saints with headquarters\nat the Auditorium in Independence, Missouri plans a new AM daylight station on\n13CQ\"kilocycles to operate with 5000 watts, in connection with Graceland College.\nPlans call for a non-commercial, educational program service for the Kansas City\narea which wi.ll provide cultural and religious material not only for the benefit |\nof R, L. D, S. but for all church and civic groups in the area. Program opor^\nation will bo closely tie'd in with activities of Graceland College, operated as\nJunior College institution in Lamoni, Iowa.\nR.L.D.S* originally applied to the FCC for a construction permit in Febru¬\nary of this year. Subsequently the matter came to hearing because of a\ncontesting application by another religious group, one of whose supporting\nwitnesses was Gerald K, Smith,\nThe .FCC hearing, held locally in Independence, attracted numbers of citizens\nwho testified in support of the R.L.D.S. application, as against application\nof the contesting evangelist„"
}