{
  "id": "d1384-3",
  "text": "4,\nstations provided no compensation is received therefor. » If the Association of\nCollege and University Broadcasting Stations should wish to reppen the matter concer¬\nning the offer of the Crosley Company Id permit educational stations to rehroadcast\nprograms from WLW and their short wave station, this statement might he useful. It\nwould hardly seem that the Commission would care to maintain its opposition to the\nuse of a radio channel for educational purposes in this country when it was permit¬\nting the use of similar channels for the broadcasting of Anerican advertising into\nforeign countries without considering the wishes of those countries.”\nTHE FOLLOWING COPY OF A LETTER FROM MR. H. UMBERGER, .STATE CCLL'iC-S OF\nAGRICULTURE, MANHATTAN, K/l^SA^ TO MR. J. C. JENSEN, RiJDIO STATION WC/iJ, LINCOLN,\nNEBR;.^KA, WilS SENT TO THIS OFFICE BY MR. JENSEN. ”I have yours of March 9 and I\nwish to thank you for sending to me the copy of the N;A'I0NAL BROiiDCAST REPORTER con¬\ntaining the article entitled, ’College Owned Stations Devote more Time to Entertain-\nmoit t.han to Educational P.rograms.’\n’’The figures as given for station KS/iC are exactly reversed from those given\nin oun^last application for a license. Consequently, I am writing to the editor of\nthe National Broadcast Reporter asking if this statement is a misprint.\n”I shall be glad to follow this matter up and let you know. I appreciate very much\nyour thoughtfulness in calling this matter to my attention.”\nTHE FOLLO^'UNG EXPLi'iNATION MD /JDDITIONiiL INFOIMATION U.;S GIVEN BY m. JENSEN:\n”The article above referred to is found in the Feb. 20 issue of the magazine, on\npage 6. This article gives KSAC Educational 5% and entertainment 95^. Some of the\nother figures in the table \\7ill doubtless bear scrutiny. For example, in the case\nof UCAJ they do not bring out the fact that we use 40^ for civic, religious and\nagricultural broadcasts. At least half of our 24^ entertainment consists of musical\nprograms by music students and faculty from Cotner College, Union College, and our\nown institution, and might properly be classed cultural and educational, To say\nthat we spend nothing for talent when members of our faculty spend a considerable\nportion of their time on program work is obviously unfair.\n\"If we could afford to spend the $25 for blank records we would record the programs\nof for a whole day and send them in to some committee for analysis, jazz so much,\nadvertising so much, etc. Why not have someone make a careful analysis of such\nprograms, and give them full publicity?”\nWe are glad to advise that four excellent plays that have been found good for radio\nuse vjill be ready for release to members in the next few days.\nSincerely yours\nT. M. Beaird, Executive Secretary\nfor Association"
}