{
  "id": "d1063-0",
  "text": "Vol. Ill, No. 7 DuPont Circle Bldg., Washington 6, D.C. May 11, 1962\nANALYSIS OF PART IV OF COMMUNICATIONS ACT — ADOPTED MAY 1, 1962\nThe following brief analysis has been prepared to outline the fundamental\nprovisions of the recent legislation amending the Communications Act of 1934 to pro¬\nvide for Federal grants to assist in the construction of educational television sta¬\ntions. Some provisions will be interpreted by the Health, Education and Welfare\nDepartment on a case to case basis, and the statements which follow are general ex¬\npressions based upon the legislative history of the Bill.\nThis interpretation has been prepared by Leonard H. Marks, as General Counsel\nof the NAEB, who was closely identified with the legislation for the past seven years.\nFor convenience, the interpretation has been put in question and answer form to de¬\nvelop the principal areas involved and to anticipate the inquiries that might nor¬\nmally be made by those who are totally unfamiliar with the legislation. The text of\nthe legislation has been reproduced as an appendix to this analysis.\nQ. What is the purpose of Part IV of the Communications Act as adopted by\nthe Congress in 1962?\nA. To assist through matching grants in the construction of educational\ntelevision broadcasting facilities. The clear legislative intent is to encourage\nthe development of the 273 reserved educational channels of which 63 are now in use.\nQ. What is the maximum amount available to any one applicant?\nA. There is a limit of $1,000,000 to applicants in any state to be matched\nby an equal amount by the applicant. Although any one applicant could qualify for\nthe total sum, it is unlikely that the Health, Education and Welfare Department would\naward this sum to a single school, university or community group. However, if a plan\nwere presented for the coverage of an entire state, it is possible that a single\naward could'be made for the maximum amount.\nQ. Who is qualified to apply?\nA. The bill provides in Section 392 that an applicant can be: (A) an agency\nor officer responsible for the supervision of public elementary or secondary educa¬\ntion or public higher education within that State, or within a political subdivision\nthereof, (B) the State educational television agency, (C), a college or university de¬\nriving its support in whole or in part from tax revenues, or (D) a nonprofit founda¬\ntion, corporation, or association which is organized primarily to engage in or en¬\ncourage educational television broadcasting and is eligible to receive a license from\nthe Federal Communications Commission for a non-commercial educational television\nbroadcasting station pursuant to the rules and regulations of the Commission in ef¬\nfect on April 12, 1962.\nQ. Does this permit a private college or university to apply?\nA. Yes, if it derives its support in part from tax revenues. It can also\nparticipate as a member of a nonprofit community group as defined in Sec. 392(d)."
}