{
  "id": "d1597-10",
  "text": "NEWS OF MEMBERS\nGENERAL\nThe University of Michigan radio station WUOM\nhas received the 1957 Audio Devices National Educa¬\ntional Award for “outstanding application of radio\nrecording to education.” The presentation was made\nby George Wedemeyer, president of Wedemeyer\nElectronic Supply Co. of Ann Arbor, to Edwin G.\nBurrows U. M. assistant director of broadcasting\nservice-radio.\nThe citation recognizes WUOM’s “demonstrated\nability to enrich the educational experience of stu¬\ndents.” WUOM is producer of a number of instruc¬\ntional radio series used statewide by elementary\nschools.\n► Robert Coleman, NAEB treasurer and director\nof WKAR-AM-FM at Michigan State University, is\nthe composer-author of “Spartan Toast,” one of four\nSongs of Michigan State, a folio recently published by\nthe University.\n► Raymond Hurlbert, general manager of the Ala¬\nbama Educational Television Commission, licensee of\nthe state’s educational TV channels 2, 7, and 10, an¬\nnounced today with Robert Schlinkert, general man¬\nager of WBRC-TV, Inc., licensee of channel 6, they\nhave mutually filed with the FCC to make certain\nchanges for improving their TV service. The joint ap¬\nplication requests permission to erect a new tower on\nAlabama’s Red Mountain to support antennae for\nboth stations. The proposed antennae’s overall height\nwould be approximately 700 feet, or more than 1,000\nfeet above the average terrain. Present channel 10\nand 6 antennae are 187 and 500 feet above ground\nrespectively.\nSpecifically,, the proposal is for WBRC-TV, Inc.\nto erect the new tower and make provision for the\nmounting of the channel 10 antenna atop along with\nthat of channel 6 at a cost of several hundred thous¬\nand dollars without any expenditure by the state.\nPROGRAMS\nThe first live, on-the-spot telecasts from the barred\ncells of San Quentin Prison were aired on two special\nprograms Dec. 19, on KQED, the Bay Area’s non¬\ncommercial ETV station.\nThe day long task of setting up KQED’s equip¬\nment involved 22 staff members and extra volunteer\nworkers to provide this rare TV fare. Special pre¬\ncautions were required for stringing cables on the\ntop of cells. The latter had to be guarded throughout\nthe day to prevent inmates from hiding in KQED’s\nlarge remote truck.\n► A battery of more than 70 programs featuring\nseveral of the nation’s outstanding scientists have\nbeen scheduled by WTTW-Channel 11, Chicago. The\nprograms, to be seen every week-day evening, will\nbegin Jan. 6. Only the Monday night series will be\nproduced live at WTTW; the others are on film made\navailable by the ETRC.\nPurpose of the concentrated programming, ac¬\ncording to James Robertson, WTTW program man¬\nager, is to meet the tremendous public need for know¬\nledge about science and scientists.\n► Following the recent completion of its studios and\nproduction offices, WYES-TV, New Orleans’ educa¬\ntional station, has inaugurated an extensive schedule\nof live local programming. The station’s new $100,000\nbuilding houses equipment valued at more than\n$200,000.\nSince the station went on the air last April, WYES\nprograms have consisted exclusively of filmed and\nkinescoped presentations supplied by educational TV\nagencies and networks.\nDuff Browne, general manager of the station, com¬\nmenting on the move to local programming, said,\n“This has been the primary aim of our operations\nsince its inception.”\nLocal live and film shows, Browne said, will be\nused to augment programs supplied from other\nsources.\n► Long before the launching of Sputniks and the\nresultant furor over space travel, a group of educa¬\ntional TV experts and scientists began work on a TV\nseries about problems rocket fliers and passengers\nwould encounter.\nThe results of their labors will be seen by educa¬\ntional TV viewers nationally when the series “Doctors\nin Space” begins its run on the nation’s educational\nstations in January. The series went into production\nnearly two years ago at KUHT-TV in Houston where\nit was filmed under contract for the ETRC at Ann\nArbor, Mich.\nWhat kinds of clothes are suitable for celestial\ntrip? How does the traveler withstand the heat of\nthe sun as he gets nearer to it? What happens if the\ntraveler’s space is damaged — how does he get back\nto earth?\nThese questions, once left to the imagination of\nscience fiction writers, come in for serious considera¬\ntion on the new series by men qualified to tackle\nthem.\nJANUARY, 1958\n11"
}