{
  "id": "d1597-2",
  "text": "goals for many years; but it was felt that current\nchanges in educational needs, taken together with\nrecent developments in broadcasting itself, might\njustify a general reappraisal of the educational broad¬\ncasting movement. Therefore, it was the consensus of\nthe Board that the several groups and interests in¬\nvolved in educational broadcasting should re-evaluate\ntheir functions and performance in the context of the\nnation’s present educational needs. This process might\ninvolve not only the leaders of education and educa¬\ntional broadcasting, but advisors from other fields as\nwell.\nWhat might be the eventual outcome of such a\ngroup self-appraisal? This no one can foresee. It might\nbring about new definitions of goals and objectives.\nIt might lead to basic changes, both within and among\nthese organizations. It would not necessarily enhance\nthe role of the NAEB: our purpose in advocating\nsuch a self-appraisal is to advance the cause of edu¬\ncational broadcasting, not merely to change the\nstatus of any one organization. As the preamble to\nour constitution declares:\n“Believing that radio and television broadcasting\nare most important factors and influences in the na¬\ntional and international welfare, we, the representa¬\ntives of educational, cultural and public service in¬\nstitutions, organizations, agencies and associations\nengaged in educational and cultural broadcasting, do\nassociate ourselves to promote, by united effort and\nmutual cooperation, the dissemination of knowledge,\ninformation, and education to the end that the edu¬\ncational, cultural and technical benefits of broad¬\ncasting may be extended to all.”\nSuch objectives, it seems to me, constitute a good\nguide for NAEB and all others in educational broad¬\ncasting, as we enter what we hope will be:\nA HAPPY NEW YEAR!\nMEMO FROM THE EXECUTIVE DIRECTOR\n—Harry Skornia\nThis month most of the essential news I would norm¬\nally report on is included in President Burton Paulu’s\nreport to the membership on recent Board and other\npolicy meetings, a report on the NAEB Research\nSeminar by Raymond Cheydleur and the list of new\ncommittees. We also welcome what we hope will be\nthe first of a regular series of columns by William\nBender, in the public relations area.\nWith such excellent contributions on an increas¬\ning basis by various NAEB chairmen and members,\nthe reporting required by the Headquarters staff can\nbe considerably reduced, and a better Newsletter will\nresult.\nDuring recent months we have been making an\neffort to get you more news, written in more straight¬\nforward and less “folksy” fashion. As our circulation\nincreases, I think this suggestion, which orginated\nwith the NAEB Publications Committee and was en¬\ndorsed by the Board, is well-timed. It represents\nprogress and increasing maturity. This does not\nrelieve NAEB members of responsibility, however; it\nincreases that responsibility. For Editor Hans Mas-\nsaquoi can not invent news. We therefore hope you\nwill take as seriously as we do the Board’s mandate\nto provide more news in this publication. The style\nwill of course be made to fit, in every way possible,\nthe mandated approach.\nMay I too wish all readers a fine 1958?\nNAEB HOLDS FIRST RESEARCH SEMINAR\nRaymond D. Cheydleur, Chairman,\nNAEB Research Committee, 1957\nKellogg funds made possible the recent successful\nand highly productive Seminar on Research in Edu¬\ncational Broadcasting, sponsored by the NAEB Re¬\nsearch Committee with significant contributions,\ngratefully acknowledged, by the Committee on Re¬\nsearch in Communications of the Ohio State Univer¬\nsity. Seminar director of this meeting, held at\nColumbus from December 9 through the 13th, was\nDr. I. Keith Tyler.\nThe goal of the intensive seminar was to delineate\na broad program of significant research in educa¬\ntional broadcasting and to familiarize participants\nwith a wide range of available research techniques.\nIt was recognized that the scope of the seminar\nwould have to be broad. Nationally, an appraisal of\nthe impact of educational broadcasting and its role\nin the total educational picture awaits development\nof a comprehensive, integrated, country-wide re¬\nsearch program which can be systematically imple¬\nmented over a period of years as resources become\navailable. Locally, research personnel connected\nwith educational radio and television stations and\nproduction agencies face frustrating problems re¬\nsulting from significant and complex needs on the\none hand, and inadequate financial and human re¬\nsources on the other.\nOf particular help to the participants was the\navailability of competent staff members from Ohio\nState University, acting as resource persons in social\nresearch. In addition, other outstanding consultants\ncame to the seminar to participate in the critical\ndiscussions. These included such experts as Benjamin\nS. Bloom, Herta Herzog, Paul Lazarsfeld, John J.\nJANUARY, 1958\n3"
}