{
  "id": "d1597-4",
  "text": "radio and TV stations? The elusiveness of good stor¬\nies? You tell us, and we shall present problems, too.\nFor speed and convenience, write me in care of\nWUOM, University of Michigan, Ann Arbor, not at\nNAEB headquarters. Remember this: the rest of the\nmembership may never write at all, so I shall be\nlooking for your letter.\n*****\nDEFINITIONS:\nOne authority (?) defines P/R as “Das Braggen\nund schnoen grupe.” Then there’s the more conven¬\ntional: “Doing good and getting credit for it.”\nPublic Relations News, one of the leading expo¬\nnents in the field, declares, “Public relations is the\nmanagement function which evaluates public atti¬\ntudes, identifies the policies and procedures of an in¬\ndividual or an organization with the, public interest,\nand executes a program of action to earn public un¬\nderstanding and acceptance.”\n*****\nREMINDER:\nElmer Sulzer sent you a questionnaire by direct\nmail asking about your publicity program. (Our copy\narrived Dec. 3) . Please get these to Sulzer (at Indi¬\nana) as quickly as possible. We’ll ask him to summar¬\nize the results so you can see where you stand com¬\npared to other NAEB-ers.\nETV SEEN AS ANSWER\nTO SCIENTIST LACK\nNationwide education by television is urged as a\nmeans of quickly producing thousands more scientists\nand engineers. Hugo Gernsback, editor and publisher\nof Radio-Electronics, proposes a closed circuit TV\nfor schools to .be built by the federal government,\nbut free of governmental controls over the teaching.\nGernsback, who sees this country in shocking\nperil from lack of scientists and engineers, believes it\nis far too late now for a crash program in technical\neducation through the use of “our antique teaching\nmethods,” because there are not enough teachers.\nGernsback is confident that through the ETV\nsystem, famous and inspiring teachers could reach\ngreat numbers of children and awaken the interest\nof youngsters in science.\nThis, he says, would not eliminate local teachers,\nbut would give them a boost.\nGernsback thinks the closed circuit could be\nworking within a year with the result that within 10\nyears many youngsters would be on the way toward\n“filling our sadly lagging ranks of scientists and\ntechnologists.”\nTV DIGEST PREDICTS\nETV OUTLOOK FOR 1958\nIn its “Annual Crystal-Gazing Stint,” Television\nDigest (Vol. 14: No. 1) predicts that the addition of\nnon-commercial, educational TV stations will follow\n“the same slow and steady pattern” of the last four\nyears. From 10 to 15 new stations are expected to be\nadded to the 28 now on the air. Compared with edu¬\ncational station increases during past years (last\nyear saw six additions), this estimate points toward\na record number of stations to begin telecasting\nduring a single year.\nFurther predictions are that ETV stations will\ncontinue to grow as programming quality increases,\nand that educational and public service program¬\nming on commercial outlets will again hit a new high\nin 1958.\nTelevision Digest’s outlook for educational closed-\ncircuit TV is similarly optimistic. The 200 schools\nand institutions now using this medium on a regular\nbasis are expected to be joined by another 100. Set¬\nting the pace, according to the prediction, will be\nWashington County, Md., where closed-circuit teach¬\ning will be extended to the entire public school system\nby next September to reach 18,000 pupils in 48\nschools.\nA number of tape recordings of folk and’ religious\nmusic, collected last summer in the hills of Assam\nand the Himalayas by Dr. Mostyn Lewis of Great\nBritain are now offered for sale. Persons interested\nin these recordings may write Dr. Lewis at Westwood,\nGresford, Wrexham, Denbigshire, Great Britain.\nUS1S LISTS NAEB PROGRAMS\nSeven NAEB Radio Network-distributed program\nseries are included in the current Catalogue of Selec¬\nted Voice of America Programs now being sent to ap¬\nproximately 165 USIS posts throughout the Free\nWorld. The programs will be used not only at USIS\nposts where local stations broadcast in English, but\nalso where they may be used in information centers.\nThe seven series are Jeffersonian Heritage, Tales\nof the Valiant, America on Stage, Document: Deep\nSouth, American Idiom, Negro Spiritual and Roots of\nJazz.\nAdditional NAEB Radio Network series have\nbeen obtained by the Voice of America and are now\nbeing prepared for distribution abroad. The majority\nof the series selected were produced under grants-in-\naid.\nJANUARY, 1958\n5"
}