{
  "id": "d1597-8",
  "text": "NCTE RESOLUTION\nThe following resolution is one of 14 adopted by the\nNational Council of Teachers of English at a recent\nmeeting, attended by representatives of 40,000\nteachers of English:\n“Whereas the National Council of Teachers of\nEnglish recognizes the importance of exploring the use\nof television as one way of meeting the teacher short¬\nage, but believes that important goals of instruction\nin language and literature are best achieved in small\ngroup-individual learning situations where the teacher\nis able to establish close personal relationships with\neach learner; be it resolved that the National Coun¬\ncil of Teachers of English\n1. Commend and encourage sound experimenta¬\ntion in using television as a new medium of com¬\nmunication in learning; and recommend that\nthe researchers study the possible use of tele¬\nvision in improving the quality of instruction in\nlanguage and literature.\n2. Urge more consideration of the effect of tele¬\nvision on the processes of learning, particularly\non those intangibles in the classroom situation\nwhich cannot be easily measured by objective\ntesting, such as the learners active participation\nin discussion and the effect of individualized in¬\nstruction by the teacher.”\nWQED GETS $250,000 WESTINGHOUSE GIFT\nA gift of a 500-foot transmitter tower, adjoining land\nand buildings was made by Westinghouse Electric Co.\nto WQED, Pittsburgh’s educational TV station. The\nproperty, valued at $250,000, has been used by\nWQED since the station went on the air April 1, 1954.\nGwilym Price, president of Westinghouse Electric\nCo., presented the deed to John Rayan, president of\nWQED, during a luncheon.\nDonald McGannon, president of Westinghouse\nBroadcasting Co., predicted at the luncheon that ed¬\nucational TV stations will become an indispensable\npart of the United States educational system.\nMore than three years of WQED operation in\nPittsburgh, McGannon said, is proof that educational\nTV need not be dull. He said educational TV “sup¬\nplies pure research for commercial television in de¬\nvelopment of varied forms and techniques before they\nare brought into commercial television.”\nCommissioner Robert Lee of the FCC told the\ngroup that his own original concern about the feasi¬\nbility of educational TV has been erased by the suc¬\ncess of many stations and that he is now its ardent\nsupporter.\nWQED, now broadcasts 90 hours of programs per\nweek and reaches directly a total of 350 classrooms in\nPittsburgh area schools.\nADVERTISERS' PSYCHOLOGY\nBELIEVED HARMLESS\nPopular fears that advertisers soon will have the\npublic at their mercy through manipulation of the\nsubconscious mind are debunked by H. Richard\nBlackwell, University of Michigan professor of\npsychology and opthalmology and director of the U.\nM. Vision Research Laboratories.\n“I am not convinced,” he said, that subliminal\nprojection would be at all effective as an advertising\ntechnique. Ads we faintly see would have about the\nsame effect as the ones that are obnoxiously visible.\nWe would pay little or no attention to them once the\nnovelty had worn off.\nSubliminal projection, as applied to advertising,\nconsists of flashing a series of movie frames over a\nregular movie or TV program already in progress.\nEach special frame contains a slogan, such as “eat\npopcorn.” The slogan is flashed too briefly to be\nseen in the usual sense of the word, but is assumed to\nleave its imprint on the subconscious mind and, in\nsome cases, to cause the audience to do as the slogan\nsuggests.\nWhile banned by the three major TV networks, it\nis being considered for possible use by movie house\nchains and independent TV outlets.\nBlackwell studied subliminal projection during\nWorld War II for the U. S. government and since\n1945 at the U. M., where he set up special apparatus\nexclusively for measuring responses to sight stimuli.\nSUMMER WORKSHOP ANNOUNCED\nKenneth Harwood, chairman of the Department of\nTelecommunications at the University of Southern\nCalifornia, has announced the scheduling of a summer\nworkshop in educational broadcasting to be conducted\nat the University June 24 through Aug. 1, 1958.\nThe workshop, which will yield three semester\nhours of college credit to advanced undergraduates\nand graduates, will be conducted by Dr. Burton\nPaulu, director of radio-TV broadcasting at the Uni-\nJANUARY, 1958"
}