{
  "id": "d1292-2",
  "text": "-3-\n2. Special provision has been made by Congress for TV and FM channels for\neducation's exclusive use and it enacted legislation providing 32 million\ndollars for expansion of ETV. Such legislation recognizes the special\nnature of educational television.\nIf educational radio and television is to live and grow, it must not be\nburdened with taxes, fees, and other costs accepted as routine costs in profit¬\nmaking enterprises. Educational institutions must have maximum access to materials\nand resources with minimum restrictions under law; to impose commercial standards and\nrestrictions upon educational use of materials by educational stations would severly\nlimit their full use and development in the service of education, and by forcing\nthem to produce their own materials place an intolerable burden upon limited staff\nand fiscal resources.\nThe MEA conference group passed a resolution expressing the vital concern of\nthe participants in the proposed revisions, especially as they affect education as\na producer and consumer of copyright materials.\nAt the suggestion of Larry Dennis (ACE and Chr. of JCEB) an ad hoc committee\nis being established between a number of organizations (including WAEBj in order\nto present a unified position for education before the Register of Copyrights. It\nwill advise its constituent members of action which it feels should be taken by\nconstituent groups and serve as a clearing house for relevant information.\nThe first meeting of this committee is set for September 5* This group will\ndetermine a course of action for education and spell out next steps.\nHAEB will participate in this committee work and join in a united effort to\nmarshall education’s forces so as to have the fullest impact upon the Register of\nCopyright office.\nIn addition, NAEB will:\n1. Prepare a detailed memorandum on the Copyright Law Revisions and their\nimplications for educational broadcasting and distribute the memo to the\nmembership.\n2. Write a strong letter to the Register of Copyrights on behalf of the\neducational radio and television stations of the country and follow up\nwith a personal conference.\n3. Participate through counsel in all subsequent panel discussions.\n4. Continue to alert our membership regarding the seriousness and urgency\nof the situation regarding the copyright law.\n5. Gather’information from members regarding the disruption to their operation\nand development which the proposed revisions would create. Such\ninformation will be made a part of a written statement to be transmitted to\nthe Register of Copyrights and will be used subsequently in testimony in\nwhatever hearings are scheduled on the bill."
}