{
  "id": "d687-12",
  "text": "TO :\nOfficer©, Directors, Members of\nFWMi John W. Dunn, Chairman, Member\nYour attention is invited to the following applications for Active and Associate\nmembership in the National Association of Educational Broadcasters* These appli~\ncations have been duly received in the office of the Executive Director and have\nbeen cleared by that office for presentation to the Officers, Directors and\nMembers of the Membership Committee of MSB for immediate action* The information\nabout each applicant is based on ALL of the available information at hard.. Please\nuse the ballot furnished and return to MSB HEADQUARTERS immediately* Do MOT\nsent your ballot to me.\nACTIVE\nROLLINS COLLI^Ea Winter Park, Florida Application has been made for a CP\nExpect to get CP and be in operation some time in November on 10 watts power*\nHours of operation: 7:00 a.m« to 9:00 a.m. and 6:00 p.m, to 11:00 p.m, Mondays\nthru Saturdays with 6*00 p*m* to 11:00 p.m* on Sundays* Expect to program for\npublic in general as well as college group.\nHew facilities include two good-sized accoustioally isolated studios, each with\nits ovsa control room, RCA consoles and mikes, Fairchild transcription tables,\nHaguecorders, and sound effects and filter equipment.\nApparently two full time staff members with most of operation by students.\nApplication mad© by Benjamin Aycrigg, Program Director\nSAN MATEQ JUNIOR COLLEGE, San Mateo, California KCSM-FM 91-1 me\nExpect to go on air January 1953 with 10 watts power, CP granted July, 1952\nBroadcasting unit controlled directly by the teaching unit. College expects to\nbe fully accredited by Junior College Association of California#\nAnticipate station will be on the air from 5:00 p.m, to 10:00 p.m. daily dlth\ngradual increase In hours as time goes by. No information regarding facilities\nor equipment.\nApparently three full time personnel. No Statement regarding how other personnel\nwill be selected or used. College offers courses and degree in radio broadcasting.\nApplication made by Richard P* Marsh, Program Director.\nPLEASE NOTE THAT HOLLINS COLLEGE DOES NOT HAVE A CP BUT EXPECTS ONE. I RULE THAT\nIT WILL BE PERFECTLY IN ORDER FOR . YOU TO VOTE CONDITIONALLY.. - THAT IS IF ROLLINS\nIS GRANTED A CP BY FCC THEY MAY BE ADMITTED TO MEMBERSHIP ON AN ACTIVE BASIS*"
}