{
  "id": "d687-127",
  "text": "Box 2002\nUniversity, Alabama\nMr. Leslie W. Engler\nProfessor and Dean of Administration\nThe City College of the College of the City of New York\n139th Street and Convent Avenue\nNew York 31, New York\n*\nDear Mr* Engler*\nPlease permit 'me to welcome you to membership in the NAEB and to\nassure you of our interest in making the full facilities of our organiza¬\ntion available to you in any way wherein we may be of service.\nThe National Association of Educational Broadcasters, now 28 years\nold, has always been the voice of educational institutions and indivi¬\nduals who are interested in utilizing radio and television as an\neducational tool. During the past several years the organization has\nincreased its activities many times and its scope of influence. You\nare, no doubt, aware of the NAEB Tape Network whereby many of the\nworld*s finest programs are made available for broadcasting on the\neducational stations throughout the country. This activity has expanded\nfrom a three programs per week \"bicycle11 network to direct service on\napproximately eight hours of programming per week. During the past\ntwelve months, through direct negotiations with countries of Western\nEurope, we have increased the flow of cultural and informational programs\nin both directions to a considerable extent and expect to expand our\ninternational exchange considerably during the current year.\nEach year NAEB conducts several sendnars and workshops for the\nupgrading of personnel and through a grants-in-aid program made possible\nby the Bund for Adult Education has been able to contribute to the\nimprovement of programing on the local level to a significant extent.\nThis year we have created a special committee within the organization\nto devote particular attention to the problems of our associate members,\nand two special committees are spending a considerable amount of time\nto the problems of school stations. We hope to continue to serve the\nneeds of educational radio and television production groups increasingly\nin the future.\nI trust that your membership in NAEB will offer stimulating and\nrewarding contacts, information, and services during the year ahead.\nPlease feel free to call upon me or upon our headquarters office for\nany services we may be able to render.\nVery sincerely yours.\nGAspse\nGray don Ausmue\nPresident"
}