{
  "id": "d687-137",
  "text": "APPLICATION FOR MEMBERSHIP\nA\nP P\nL\n1\nN\nA\nE\nB\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n(NOTE: Please read this application carefully. Answer all questions where applicable. Give\nsupplementary material the same number as the section of the application which asks for it.\nApplication and all supplementary materials must be in duplicate.)\n1. a. Name of Institution or School-\nThe Uv\nb. Address. Alviv v ers's -V m.a\nc. To what Accrediting Association does your school or institution belong?—\n2. Type of activity into whic|> your application falls?\nBroadcast Station.\nRadio Council_\nProduction Center-\nRadio Workshop-\n3. a.\nb.\n_ _ Cooperating Organization._ Teaching Department_\nCampus Station (Low-radiation, “wired” or “piped” radio)_ Short Wave- Individual-\nDoes your institution operate its own broadcast station? Yes.\nIs the station operated on a non-commercial basis? Yes\nIf you have only a CP from the FCC, give date of CP\nPlease supply the following information as indicated:\nAM Call Letters_ TV Call Letters_\nAM Frequency_TV Frequency-\nAM Power- _ TV Power, aural._\nFM Call Letters-W U QA\nFM Frequency_\\ . H IM& >\nFM Power_* p \\<.V4—\nFM, ERP\n-IQ-\nTV Power, video_\nPlease note your hours of operation for either or all facilities:\nAM Stations_a.m. to-a.m. and ——\nFM cilntinn7 to-a.m. and -\nTV Stations_a.m. to_a.m. and _\nDoes your station operate on a shared time schedule? If “yes” indicate station with which shared\nand hours of sharing_---\nUnder what general divisiomof the institution does the broadcasting station fall?.\nEx^ertsiow la*\n_p.m. to\n_p.m. to\n_p.m. to\niwv sum. _L_\nDate station(s) (AM, FM, TV) established_~Dg, C.C.W* P tr\nAttach a brief description of your broadcasting facilities (studios, control rooms, technical equip¬\nment, music library, etc.)\nAttach a typical week’s program (If only CP, then material submitted to FCC)\nAttach a list of staff members and titles, indicating whether paid or unpaid, part time or full time.\n4. a. Do you broadcast only over commercial stations? Yes.\nb. Extent of such broadcasting (As a separate exhibit give number and t\nc. Call letters of stations used_Kt \\ ^—NAl\nd. Do you originate the programs in your own studios?__ If so, then answer 3.h. so far\nas it is applicable to you.\nAttach a list of your staff members actively engaged in broadcast work.\nORIGINAL"
}