{
  "id": "d687-142",
  "text": "TO : Officers & Directors, Membership Committee, NAEB\nFROM: John W. Dunn, Chairman, Membership Committee 2/10/53\nHerewith are applications for membership in NAEB in the several different cate¬\ngories, As much information as possible is supplied for each. Please cast your\nballots as given you at the end of this report arid return them to NAEB HEADQUARTER^\nUrbana, Illinois. DO HOT send your ballots to me.\nASSOCIATION OF JUNIOR LEAGUES OF AMERICA, INC. AFFILIATE\nWaldorf-Astoria, 305 Park Avenue, New fork\nAs I understand it, there is no such thing as an accrediting agency for such an\norganisation. Therefore, I rule we pass this important question. Application made\nby Luella Hoskins, Consultant on Radio & TV. Apparently, organization very much\ninterested in promoting educational TV. This from small amount of literature\navailable from them.\nWESTERN RESERVE UNIVERSITY, Cleveland, Ohio ASSOCIATE\nNo accrediting agency stated. Investigation shows, however. North Central Associa¬\ntion,\nStaff of five* Broadcast 9 TV and 2 radio programs weekly over WEWS-TV,WGAR and\nWJW, commercial outlets. Apparently no studios or facilities of their own. Both\ngraduate and undergraduate work offered in radio and TV.\nApplication made by Barclay Leathern\nPROVIDENCE BIBLE INSTITUTE, Providence. R. I, WPTL-FM ACTIVE\nAccredited by Collegiate Division of the Accrediting Association of Bible Insti¬\ntutes and Bible Colleges,\nOwns and operates WPTL-FM, 91.5 me, 1000 watt power, 3200 w. erp. On air weekdays\nfrom 2:57 p.m. to 10:30 p.m.; Sundays, 9:42 a.m. to 10:30 p.m. Station established\nFeb. 22, 1943 and is under supervision of Radio Department. Does not engage in any\nother broadcasting. One course in radio speech. Paid staff of 8 full time and\n2 part-time people. No description of studios.; technical equipment standard and\napparently from listing of good quality and above average in quantity.\nProgram schedule submitted for entire week. Shows influence of Bible college\nbut not objectionably so. Rather good schedule and shows some careful planning\nand showmanship.\nApplication made by Thomas M. Robertson, Manager of WPTL-FM\nJUDITH W. GAYLQR, 504 W. 112th Street, New York AFFILIATE\nNot so actively engaged in educational broadcasting at present. Interested in\nfuture of educational broadcasting, ©specially TV. AB, Smith College, Major in\nTheatre and Radio. Professional work in radio; production assistant for Ford\nRadio Theatre. Actor*s Agent; past 3 years has been working in theatre with\ncollege students and faculty thru Episcopal. Church in New York City."
}