{
  "id": "d687-16",
  "text": "TO : Officers, Directors and Membership Committee, • NAEB\nFROM: John W. Dunn# Chairman, Membership Committee 1/29/53\nMany of yon have asked for information on the new membership requirements* The December\nissue of the NEWSLETTER carried an article on this. Page 9* Please refer to it*\nThru an error on the part of the Chairman, the application of the BALTIMORE, MARYLAND\nBOARD OF EDUCATION was classified as Active* It should have been, ASSOCIATE* Since\nthe vote has already been taken on this application with Dunn, Schooley and Siegel\nvoting for active membership and MiULer and Miles voting for Associate Membership, I\nam therefore requesting those of you who voted on the basis of Active Membership to\nrevote on the basis of Associate Membership*\nThe following applications have been received from Headquarters:\nTHE UNIVERSITY OF MISSOURI, Columbia, Missouri Associate Membership\nAccredited by the North Central Association\nBoth Speech and Journalism Departments maintain complete studios for practice work\nBoth of these departments maintain radio workshops. The School of Journalism works with\nRadio Station KFRU in the preparation and presentation of 13 daily newscasts\nJournalism School maintains one instructor and four graduate assistants5 Speech Department,\non© instructor and four assistants*\nThis application is for ASSOCIATE MEMBERSHIP. However, since the University of\nMissouri5s application for a TV station on a Commercial Frequency has been granted, it\nraises an interesting problem as to whether or not we can consider this the basis for\nactive membership* This is especially true in light of the statement from Dean Earl\nEnglish of the Journalism School, “Despite the fact that this (the TV station) is to\nbe listed as a commercial station, our primary purpose will be education”. In spite\nof this assertion, it is my opinion that we should proceed cautiously and wait to\nsee just what their program policy will be*\nMissouri maintains rather elaborate set-up in Radio Journalism but offers only\nthree courses in Radio Speech\nNORTHERN STATE TEACHERS COLLEGE, Aberdeen, South Dakota Associate Membership\nAccredited by American Association of Colleges for Teacher Education it North Central Asso.\nSmall studio at present* Plan to buy complete broadcast equipment current year for\npermanent studio* Use facilities of &SDN, Aberdeen, a 1 kw station* This is their\nfirst year in broadcasting. Presently doing one half hour program weekly* Plans\nare to increase their offerings.\nOffer two courses in radio, on© on a year basis, the other on & on© quarter basis."
}