{
  "id": "d687-21",
  "text": "February 1U, 1953\nProf. R.H. Myers\nProfessor of Speech Sc Chairman of the Speech Dept.\nThe University of Wisconsin »\nMilwaukee Intension Division\n623 West State Street\nM ilwaukee 3, Wisconsin\nDear Professor Myers 1\nPlease oermit me to welcome you to membership in the NAEB and to\nassure you of our interest in making the full facilities of our organization\navailable to you in any way wherein we may be of service.\nThe National Association of Educational Broadcasters, now 26 years\nold, has always been the voice of educational institutions and individuals\nwho are interested in utilizing radio and television as an educational tool.\nDuring the oast several years the organization has increased its activities\nmany times and its scope of influence. You are, no &>ubfc aware of the N/EB\nTaoe Network whereby many of the world’s finestorogrania are made available\nfor broadcasting on the educational stations throughout the country. This\nactivity has exoandea from a three programs per week \"bicycle” network to\ndirect service on approximately eight hours of programming per week. During\nthe oast twelve months, through carect negotiations witn countries of Western\nEurope, we have increased the flow of cultural and informational programs\nin both directions to a considerable extent and expect to exoand our inter¬\nnational exchange considerably curing the current year.\nEach year NAEB conducts several seminars ana workshops for the\nupgrading of personnel ana through a rants-in-aid orogram made possible\nby the Fund for Adult Education has been able to contribute to the improve¬\nment of programming on the local level to a significant extent* This year\nwe have created a special committee within the organization, headea by Mr.\nGale Adkins of Madio House at the University of Texas, to aevote particular\nattention to the problems of our associate members, and two special cor-,\nmittees are spending a considerable amount of time to the problems of school\nstations. e hope to continue to serve the needs of educational radio and\ntelevision stations and educational radio and televsion production groups\nincreasingly in the future.\nI trust that your membership in NAEB will offer stimulating and\nrewarding contacts, information, ana services during the year ahead. Please\nfeel free to call upon me directly or upon our headquarters office for any\ns rvices we may be able to render.\nVery sincerely yours.\nGraydon Ausmus\nPresident"
}