{
  "id": "d687-23",
  "text": "February lit, 19^3\nKr. W. Ferron Halvorson\nDirector of Broadcasting\nTexas Technological College\nLubbock, Texas\nDear Kr. Halvorson:\nPlease permit me to welcome you to membership in the NAEB and to\nsBsure you of our interest in making the full facilities of our organization\navailable to you in any way wherein we may be of service.\nThe National Association of Educational Broadcasters, now 28 years\nold, has always been the voice of educational institutions and individuals\nwho are interested in utilizing radio and television as an educational tool.\nDuring the past several years the organization has increased its activities\nmany times and its scope of influence. You are, no doubt, aware of the NAEB\nTaoe Network whereby many of the world’s fine ^programs are made available\nfor broadcasting on the educational stations throughout the country. This\nactivity has exoanded from a three programs per week ’’bicycle” network to\ndirect service on approximately eight hours of programming per week, luring\nthe past twelve months, through direct negotiations with countries of Western\nEurope, we have increased the flow of cultural and informational programs\nin both directions to a considerable extent and expect to expand our inter-\nnational exchange considerably during the current year.\nEach year MAEB conducts several seminars and workshops Tor the\nupgrading of personnel and through a grants-in-aid orograj made possible\nby the ^und for Adult Education has been able to contribute to the improve¬\nment of programming on the local level In a significant extent. This year\nwe have created a special committee within the organization, headed by Mr.\nGale Adkins of Radio House at the University of Texas, to devote particular\nattention to the problems of our associate members, and two special com¬\nmittees are spending a considerable amount of time to the problems of school\nstations. Vie hope to continue to serve the needs of educational radio and\ntelevision stations and educational radio and television production groups\nincreasingly in the future.\nI trust that your membership in MAE3 will offer stimulating and\nrewarding contacts, information, and services during the year ahead. Please\nfeel free to call upon me directly or upon our headquarters office for any\nservice we may be able to render.\nVery sincerely yours.\nGraydon Ausmus\nPresident\nGA:pk"
}