{
  "id": "d687-25",
  "text": "February lh, 19!?3\nMrs, Eleanors Bowling Kane\nSpecialist in Radio and Television Education\nBaltimore Board of Education\n3 East Twenty-Fifth Street\nBaltimore 18, Maryland\nDear Mrs. Kane*\nPlease permit me to welcome you to membership in the NAEB and to\nassure you of our interest in making the full facilities of our organization\navailable to you in any way wherein we may be of service.\nThe National ssoeoation of Educational Broadcasters, now 28 years\nold, has always been the voice of educational institutions and individuals\nwho are interested in utilizing radio and television as an educational tool.\nDuring the past several years the ort anization has increased its activities\nmany times and its scope of influence. You are, no doubt, aware of the NAEB\nTape Network whereby nsny of the world’s finest programs are made available\nfor broadcasting on the educational stations throughout the country. This\nactivity has expanded from a three programs per week ’’bicycle” network to\ndirect service on approximately eight hours of programming per week. During\nthe past twelve months, through direct negotiations with countries of Western\nEurope, we have increased the flow of cultural and informational programs\nin both directions to a considerable extent and expect to expand our inter¬\nnational exchange considerably during the current year.\nEach year NAEB conducts several seminars and workshops for the\nupgrading of personnel and through a grants-in-aid progra* made possible\nby the Fund for - dolt ducation has been able to contribute to the improve¬\nment of programming on the local level to a significant extent. This year\nwe have created a special coi mittee within the or, anization, headed by\nMr. Gale Adkins of Radio Rouse at the University of Texas, to devote\nparticular attention to the problems of our associate members, and two special\nt committees are spending a considerable amount of time to the problems of\nschool stations. V/e hope to continue to serve the needs of ecdcational\nradio and television stations and educational radio and television production\ngroups increasingly in the future.\nI trust that your membership in NAEB will offer stimulating and\nrewarding contacts, information, ana services during the year ahead. Please\nfeel free to call upon me directly or upon our headquarters office for any\nservices we may be able to render.\nVery sincerely yours,\nGA*pk\nGray don Ausmus\nPresident"
}