{
  "id": "d687-27",
  "text": "February 31*, 19^3\nMr. Lyman C. Miles\nDirector of the Radio and Audio-Visual Education Service\nMacalester College\nGrand & Snelling\nSt* Paul, Minn.\nDear Mr* ilesj\nPlease permit me to welcome you to membership in the MAEB m4 to\nassure yqu of our interest in making the full facilities of our organization\navailable to you in any way wherein we may be of service*\n*ne national Association.of Educational Broadcasters, now 2o years\nold, has always been the vdce of educational institutions and individuals\nwho are interested in utilizing radio and television as an educational tool*\nDaring the past several years the organization has increased its activities\nmany times and its scope of influence* You are, no doubt, awai e of the NAEB\nlape Network whereby many of the world's finest programs are made available\nfor broadcasting on the educational stations throughout the county, This\nactivity has expandso from a three programs per weeh \"bicycle” network to\ndirect service on approximately eight hours of programming per week. During\nthe past twelve months, through direct negotiations with countries of Western\nEurope, we have increased the flow of cultural and informational programs\nin both directions to a considerable extent and expect to expand our inter¬\nnational exchange considerably during the current year*\n£ach year M/EB conducts several seminars and workshops for the\nupgrading of personnel and through a grants-in-aid program made possible\nby the und for Adult Education has been able to contribute to the improve¬\nment of programming, on the local level to a significant extent. This year\nwe have created a special committee within the organization, headed by r.\nGale Adkins of .adio house at the University of Texas, to devote par-tic alar\nattention to the problems of our associate members, and two special com¬\nmittees are s-pen6' n% a considerable amount of time to the problems of school\nstations Re hope to continue to serve the needs of educational radio and\ntelevision stations and educational radio and television production groups\nincreasingly in the future. b F\nI trust that yo’ir membership in NAEB will offer stimulating and\nregarding contacts, information, and services during the year ahead.\" Please\nfeel free to call upon me directly or upon our headquarters office for any\nservices we may be able to render.\nVery sincerely yours.\nGA:ok\nuraydon Ausmus\nPresident"
}