{
  "id": "d687-31",
  "text": "Box 2002\nUniversity, Alabama\nFebruary 16, 1953\nHr. Leslie Cheek, Jr., Director\nVirginia Museum of Fine Arts\nBoulevard & Grove Avenue\nRichmond, Virginia\nDear Mr. Cheekt\nPlease permit me to welcome you to membership in the NAEB\nand to assure you of our interest in making the full facilities of\nour organization available to you in any way wherein we may be of\nservice.\nThe National Association of Educational Broadcasters, now\n28 years old, has always been the voice of educational institutions\nand individuals who are interested in utilizing radio and television\nas an educational tool. During the past several years the organiza¬\ntion has increased its activities many times and its scope of in¬\nfluence. You are, no doubt, aware of the NAEB Tape Network whereby\nmany of the world’s finest programs are made available for broad¬\ncasting on the educational stations throughout the country. This\nactivity has expandsd from a three programs per week \"bicycle11 network\nto direct service on approximately eight hours of programming per\nweek. During the past twelve months, through direct negotiations with\ncountries of Western Europe, we have increased the flow of cultural\nand informational programs in both directions to a considerable extent\nand expect to expand our international exchange considerably during\nthe current year.\nEach year NAEB conducts several seminars and workshops for\nthe upgrading of personnel and through a grants-in-aid program made\npossible by the Fund for Adult Education has been able to contribute\nto the improvement of programing on the local level to a significant\nextent. This year we have created a special committee within the\norganization, headed by Mr. Gale Adkins of Radio House at the\nUniversity of Texas, to devote particular attention to the problems\nof our associate members, and two special committees are spending\na considerable amount of time to the problems of school stations.\nWe hope to continue to serve the needs of educational radio and\ntelevision stations and educational radio and television production\ngroups increasingly in the future.\nI trust that your membership in NAEB will offer stimulating\nand rewarding contacts, information, and services during the year\nahead. Please feel free to call upon me directly or upon our head¬\nquarters office for any services we may be able to render.\nVery sincerely yours.\nGAtpse\nGraydon Ausmus\nPresident"
}