{
  "id": "d687-65",
  "text": "Box 2002\nUniversity, Alabama\nMarch 27, 1953\nMr* Don W* lyon, Director\nRadio and Television\nThe University of Rochester\n1$ Prince Street\nRochester, New York\nDear Mr. Lyoni\nPlease nerrait me to welcome you to membership in the IJAIB and to\nassure you of our interest in making the full facilities of our organization\navailable to you in any way wherein we may be of service.\nThe National Association of Educational Broadcasters, now 28 years\nold, has always been the voice of educational broadcasting and individuals\nwho are interested in utilizing radio and television as an educational tool*\nDuring the past several years the organization has increased its activities\nmany times and its scope of influence. You are, no doubt, aware of the NAEB\nTape Network whereby many of the world*s finest programs are made available\nfor broadcasting on the educational stations throughout the country. This\nactivity has expanded from a three programs per week \"bicycle** network to\ndirect service on approximately eight hours of programirdng per week. During\ntiie past twelve months, through direct negotiations with countries of Western\nEurope, we have increased the flow of cultural and Informational programs\nin both directions to a considerable extent and expect to expand our inter¬\nnational exchange considerably during the current year.\nEach year NAEB conducts several soninnrs and workshops for the\nupgrading of personnel and through a grants-in-aid orogram made oossible\nby the Fund for Adult Education has been able to contribute to the improve¬\nment of programr ing on the local level to a significant extent. This year\nwe have created a special committee within the organization, headed by Mr*\nGale Addins of Radio House at the University of Texas, to devote particular\nattention to the problems of our associate members, and two special com¬\nmittors are spending a considerable amount of time to the problems of school\nstations. We hope td continue to serve the needs of educational radio and\ntelevision stations and educational radio and television production groups\nincreasingly in the future.\nI trust that your membership in NaEB will offer stimulating and\nrewarding contacts, information, and services during the year ahead. Please\nfeel free to call upon me directly or upon our headquarters office for any\nservices we may be able to render.\nVery sincerely yours.\nGAipse\nGraydon Ausmus\nPresident"
}