{
  "id": "d687-69",
  "text": "TO : Regional Directors, NABB\nFROM: John W* Dunn, Chairman, Membership 4/24/53\nBy thii time, gentlemen, all of you have had a chance to study the membership mater¬\nials wh^ch were recently sent you. As a check list, may we remind you that these\nMaterial, consisted of the followings\n1* Active members in each region\n2. Associate members in each region\n3- Potential active members in each region\n4* Potential associate members in each region\nIn th case of Ve potential active members, these are schools which now have a\nstatic* in operat'on or a CP for one but are not members of NAJEB, The potential\nassociate members \\re production centers of universities and colleges which are\nlocated ),\\ cities tad town3 in which there are one or more radio or TV stations.\nThe gimmici for the otential active members is the NAJSB Tape Network which now\nhas 83 members out ct the 98 active members on our rolls, Recently, at Columbus\nThe Board of Director; voted, as you recall, to set up a Radio and TV Script Exchange.\nThat’s the etna on for the associate member potentials. Now in flip, of this we have\nnot and will slot at tim time make any pitch for the high school production centers.\nAfter we have .vrveyed .he field for the colleges and universities, then I have a\nplan for going iut after the high school production centers as associate members.\nWhat’s the reasen for all this ballyhoo for members? Hee it is in a nutshell, boys2\nWe want to get evwy institution in America that’s interested in educational broad¬\ncasting in the folds of NASP. In that way we can stiffle any opposition before it\ncan get started tc t far. Aiy by offering these people something in the way of ser¬\nvice, we can keep 'em satisf ied.\nBut all of this is ping to tike WORK...LOTS OF WORK on the part of regional officers.\nIn large regions, yen may vranv to get the help of the active members in each state.\nI think they can get. the low-aiwn on these potentials and can help the regional\noffices by a follow vhrough of their own.\nWhatever plan you choose, the important thing is to get busy today and start this\nthing wheeling. Our goal for MvB by October 1, 1953 is 250 members. If we can\nexceed that figure, ‘hen so much \\he better.\nOn a separate sheet .re some salient fact3 about NABB membership, dues, etc. You\nmay want to mimeograph or ditto this information for distribution. But your letter\nto the prospective number should be a personal one typewritten especially for them.\nOnce you’ve made yosr* initial attack and receive a favorable reply, then forward\nfull details to NAB2 Headquarters so that application blanks can be sent immediately.\nHeadquarters should notify you when these have been sent so that you can follow\nthrough with a nice letter \"offering your help” in filling out the blanks. You see,\nit’s not so easy ami will take some push and work. However. I think it’s worth it 1"
}