{
  "id": "d687-71",
  "text": "TCT : Officers, Directors, Members of Membership Committee\nFROM: John W. Dunn, Chairman, Membership Committee 4/24/53\nThe following applications for membership in NAEB have been received from headquarters:\nSPRINGFIELD, MASS, TRADE HIGH SCHOOL WEDK-FM (CP from FCC) ACTIVE\nAccredited by Massachusetts State Department of Education\nHope to be on the air by May 6, 1953 on 91.7 me with 10 watts. Hours of operation:\n9 to 12 a.m. and 6 to 9 p.m. No instruction offered in broadcasting and no programs\naired over commercial outlets.\nPhysical facilities consist of combination transmitter and control room and small\nstudio together with a completely equipped modern auditorium. Ten Watt composite\ntransmitter assembled by post-graduate students in radio technician classes. Gates\nconsolette, 2 Gates turntables, 2 RCA veolcity and one Turner dynamic mikes# Presto\ntape and disc recorders. Development of studios and equipment depends on how TV\ngoes in state.\nTwo part-time paid staff. Propose to broadcast rather extensive array of programs\n\"for every grade level, especially in fields of music, social studies and science\".\n\"It is intended that pupil participation shall be outstanding feature of the programs\nscheduled for our students\". Station designed to serve all of the schools in\nSpringfield, Mass, school system. Rather active department of technical radio.\nApplication made by William J- Sanders, Supt. of Schools,\nSTATE lialVARSITY COLLEGE FOR TEACHERS, Buffalo, N. Y, ASSOCIATE\nApplication made by D. Paul Smay, Director of Visual Education\nCompleting two years of TV programming over WBEN-TV, 15 minutes each Monday thru\nFriday. Another series, quarter hour, Tuesday, Wednesday and Thursday each week.\nAll programs related to work of college in various areas of specialization and are\nunder directorship of Audio-Visual dept. Rafto program over WKEW, half hour, each\nweek on problems dealing with issues in modern education and the public schools* TV\nprograms have covered fields of art, music, industrial arts, photography, economics,\nchild development, history, sociology, geography, home economics, architecture,\nhealth* More than 100 teachers and 200 students have participated in broadcasts\nduring the past two years. Supported 3tate-wide TV program for state of New York.\nOFFICE, COUNTY SUPT. SCHOOLS, LOS ANGELES, California ASSOCIATE\nApplication made by Helen Rachford, Director of Audio-Visual Education\nApplicant sends along Radio Listening Guide and Look and Listen for ei^ht radio\nprograms and four TV programs which are done regularly over 9 AM outlets and 4 TV\noutlets. No studio facilities and no instruction in broadcasting.\nFrom exhibits, 1 would say that Office does a very good Job of in-school brcadcastig\nover commercial outlets and a very fine job of utilization in the schools. All\nmaterials well organized and planned. Apparently, good cooperation from commercial\noutlets*"
}