{
  "id": "d687-77",
  "text": "Box 2002\nUniversity, Alabama\nMay 22, 1953\nMr* J.tames R. Oliver\nDirector, Audio-Visual Education\nStation WSKS-FM\nSchool City of Wabash, Indiana\nWabash, Indians\nDear Mr* Oliver*\nPlease permit me to welcome you to membership in the IiAEB and to\nassure you of our interest in making the full facilities of our organization\navailable to you in my way wherein we may be of service.\nThe National Association of Educational Broadcasters, now 28 years\nold, has always been the voice of educational institutions and individuals\nwho are interested in utilizing radio and television as an educational tool*\nDuring the east several years the organization has increased its activities\nmany times and its scope of influence* You are, no doubt, aware of the NAEB\nTape Network whereby many of the world’s finest programs are made available\nfor broadcasting on the educational stations throughout the country* This\nactivity has expan <fed from a three programs per week \"bicycle” network to\ndirect service on approximately eight hours of programming per week* During\nthe past twelve months, through direct negotiations with countries of Western\nEurope, we have increased the flow of cultural and infomationa! programs\nin both directions to a considerable extent and expect to expand our inter-*\nnational exchange considerably during the current year.\nEach year NAE3 conducts several seminars and workshops for the\nupgrading of personnel and through a grants-in-aid prograr made possible\nby the Fund for Adult Education has been able to contribute to the improve¬\nment of programming on the local level to a significant extent* We hope\nto continue to serve the needs of educational radio and television stations\nand educational radio and television production groups increasingly in the\nfuture*\nI trust that your membership in NAEB will offer stimulating and\nrewarding contacts, information, and services during the year ahead* Please\nfeel free to call upon me directly or upon our headquarters office for any\nservices we may be able to render*\nVery sincerely yours.\nGAjpse\nGray don Ausmue\nPresident"
}