{
  "id": "d687-84",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF EXECUTIVE DIRECTOR\nUNIVERSITY OF ILLINOIS\n119 GREGORY HALL\nURBANA, ILLINOIS\nILLINOIS\nMrs# Robert 1* Dalton, Jr*\nChairman* television Committee\nThe Junior League of Charlotte\nRoute 1\nMatthews, North Carolina\n\\\nDear Mrs. Daltons\nI am very happy to inform you officially that the Board of Mr ©c tor© of the HAEB\nhas approved the application of the Television Committee of the Junior League of\nCharlotte for affiliate membership in our association*\nTou vill new be receiving regularly from us the monthly HASH lneletter> addition*\nal publications of interest, and many other things* Xou should, of course, feel\nfree to writs this office at any time for any information concerning educational\nbroadcasting*\nUnder separate cover we are sending you a copy of the IAM. J^frrJjLaUd.iQamato*\nXou will note that you are classed as an affiliate macaber. The association In\nits 1952 convention decided that now was the time to broaden its membership base,\nhence, it created a new type of membership known as affiliate*\n% definition, active members own and operate their own stations; associate m«»-\nbers regularly produce progrums for use over stations they do sot own. Affiliate\nmembers neither own their own stations nor produce programs regularly but are in¬\nterested in educational broadcasting and wish to be kept informed of its progress*\nAnyone who is an affiliate member of this organisation and who at any time in the\nftature qualifies for either associate of active membership can automatically be\nput in those classes merely by notifying the hxeeutive Director*\nPerhaps the greatest good of an XAEB membership is the associations you fora. It\nIs good to know that others are having the mm problems as you are and how they\nare solving them* It has been the tradition with NASB to exchange this sort of\ninformation on a friend~to~friend basis* Xou1!! find lots of friend© in HAEB*\nSincerely,\nMarry J* Skornia\nExecutive Director\nHJSirtb\nSchooley\nWynn"
}