{
  "id": "d1826-0",
  "text": "PRESIDENT’S COLUMN\nHaving written last month about some of the criteria I feel\nare pertinent to evaluating an NAEB convention, I have been especial\nly interested in looking over the completed questionnaires which\nhave been returned by those attending the San Francisco meeting.\nThe response covers a predictable range, reflecting the particular\ninterests and experience backgrounds of the attendees. Many were\nenthusiastic — almost ecstatic — asserting it was the \"best\nconvention ever?; others, less influenced by San Francisco’s\nundoubted attributes, were, nonetheless, impressed by the quality\nof the program. Most of the critical comments dealt with non¬\nsubstantive aspects, such as the high cost of the rooms and the\nremote location of the hotel. Still others deplored the lack of\nrelevance in some of the program features to the precise interests\nof educational broadcasters.\nThe significant comments — and the genuinely disturbing ones\n— concerned the failure of the convention to provide for carrying\non the business of the association: to give the membership oppor¬\ntunity to really discuss and debate, to examine alternatives, to\nmake decisions. There were remarks' such as these: \"We came! to\nvote and never had a chance.\"; \"It was all cut and dried;\"; \"Too\nmuch power politics,\"; \"I didn’t feel like a participant, just an\nobserver.\"\nThere is too much truth in these observations. Much of the\ntime in the business sessions was consumed in reporting — an\nexercise that might better be limited to delivering oral briefs\nof written reports. This arrangement would leave more time for\ndiscussion and interchange — for the reverberant aspect of the\nconvention I described last month. Perhaps an hour might be set\naside solely for the purpose of interrogation by the membership\nof its officers ( alively feature of the Norman meeting).\nUnquestionably, more time could and should be reserved in\nfuture conventions for business sessions conducted in a thorough¬\nly professional fashion with time effectively utilized for group\nconsideration and decision making. We will continue to try to\nimprove each convention over its predecessor. However, in my\njudgement, a convention by its very nature can never be an ade¬\nquate mechanism for thorough study and analysis of the organi¬\nzation convening. The pressures of a three-day program of varied\nactivities is not conducive to probing in depth, to giving\ndeliberate consideration, to making conscientious choices and\nclear judgements, to developing creative group thinking, to shap¬\ning self destiny. And yet, every now and again, these kinds of\nfunctions need being done.\nAny mature association must have some sort of self-correcting\nfeed-back mechanism which helps it to change directions in response\nto unanticipated conditions or in recognition of unproductive pro¬\ngrams. It must also develop the means for orderly correction of\nrecognized shortcomings.\nA part of these functions can be fulfilled at the national\nconvention, in regional conferences, via the committee and board\nstructure, and through correspondence and personal interviews.\nBut these approaches only partially do the job I am thinking about:"
}