{
  "id": "d1826-1",
  "text": "a full-scale examination and agonizing appraisal of the XAEB\nitself.\nDuring the past 10 years NAEB has held more than 30 seminars\nand workshops devoted to helping its members improve themselves\nin everything from creative writing *od television production and\nto help advance the cause of such activities (in which its members\nhave a stake) as communications research and live, interconnected\nnetwroks. It is high time, it seems to me, to devote a seminar\nto the association itself, e.g., an NAEB seminar on the NAEB.\nOn the 12th anniversary of the first Allerton House seminar\n— a landmark meeting which established the aims of educational\nbroadcasting — I propose an Allerton House conference devoted to\na study of the aims and means of implementing them of educational\nbroadcastingprofessional association. It would include a\nthorough check-up plus prescriptions to insure the association's\ncontinuing good health and robust future.\nWho would be the attending specialists: For the mostpart\nthey would be drawn from our own ranks: officers, directors,\ncommittee chairmen, and retained consultants. Personalizing the\nassociation for a moment, I think of NAEB (a la David Riesman's\nformula) as being largely inner-directed, in the sense that its\nsource of direction was implanted by the pioneers in the movement\nand is directed toward destined goals and generalized ideological\naims. Thus, rather than being overly responsive to the expecta¬\ntions and wishes of others, the NAEB has a gyroscope that keeps\nit on course. On the other hand, the association must avoid\nrigidity in its attitudes, maintaining a delicate balance between\nthe demands imposed by maintenance of traditional direction and\nthe impact of the external environment. So, in addition to a\ngyroscope, it must have radar as were, so that while adhering to\nwhat we know is good and true we can still be responding and util¬\nizing signals from a changing environment. In other words, ours\nis a self-propelled organization that is also realistically\nresponsive to altered circumstances.,\nConsequently, I envision the Seminar as being largely our\nown show — inner-directed — with our own leaders bearing the\nmajor responsibility. To avoid asitgmatism and self-deception,\na few outside experts might well be brought in to give us the\nbenefit of their insights and special competencies. To the\ncontribution of these \"others\" would be added the inner contrib¬\nution of working papers provided by each of the standing committees\nof the NAEB. The preparation of these studies would constitute\nthe principal activity of these committees from the time of their\nappointment in January until the staging of the seminar in July,\nWith some stimulating presentations from consultants plus care¬\nfully prepared papers from the committees, the seminar should\nhave an ordered body of pertinent material to dig into that should\ngo a long way toward assuring a fruitful outcome to its deliberations.\nThe first Allerton House meeting is reported to have been\ncharacterized by the revelation of a great truth — the truth that\neducational broadcasting has a job to do and is capable of doing\nit. I am confident that a third Allerton House seminar such as\n$ propose would generate the same sort of revelations and"
}