{
  "id": "d1826-2",
  "text": "MESSAGE FROM THE PRESIDENT\n—Burton Paulu\nVacations are over, and it’s time to go back to work.\nI hope you had as enjoyable a vacation as I did; if so,\nthen you too are returning to the office with increased\nenthusiasm and zeal.\nFor three weeks in August, the Paulus (children,\nSarah (10), Nancy (7) and Tommy (5); mother,\nFrances; and father, Burton), took a 4200 mile drive\nfrom Minneapolis to Oregon and back. We saw the\nSouth Dakota Badlands, the Black Hills, the Big¬\nhorn Mountains, Yellowstone Park, and the Grand\nTetons. Then, after an enjoyable six days at an Ore¬\ngon ranch, we returned via Glacier Park.\nThis was my third visit to these places, and my\nwife’s second. Yet we enjoyed them more than ever\nbefore. Maybe this was because we’ve seen enough\nother things to realize how significant and impressive\nthese really are. Certainly one factor, though, was the\nenthusiasm of the children, to whom it was all new.\nFor them, the 80 bears counted in Yellowstone Park\nwere a great experience; for Frances and me, watching\nthem count the bears was the big thing. Surely we\nshall long remember the return trip, on which we\ncooked out and lived in a tent during six of our seven\nnights on the road (it was too cold and rainy the\nseventh night to attempt it). This does not make for\nfast traveling; but if the weather is good, it is an en¬\njoyable way to go on vacation with a family.\nTen days after returning to the office, I attended\na seminar on instructional television, held in Washing¬\nton, D. C., September 9 through 13, under the\nauspices of the Division of Audio-Visual Instruction\nof the National Education Association. Funds were\nsupplied by the Fund for the Advancement of Educa¬\ntion. There were twenty-five participants from all\nparts of the country, representing school administra¬\ntors, curriculum specialists, teachers and audio-visual\nexperts, as well as a few people active in NAEB, in¬\ncluding Elizabeth Golterman, Clair Tettemer, I. Keith\nTyler and Armand Hunter.\nThis was a very good meeting. We of NAEB are\ndoing our best to draw in more and more people from\nrelated fields. It was interesting, therefore, to take\npart in discussions oriented around the interests of\nthese other groups.\nSeptember 15 was dedication day for the Twin\nCities Area Educational Television Corporation’s new\nstation, KTCA-TV (needless to say, an NAEB\nmember). As NAEB president, I contributed a two\nminute greeting (John Schwarzwalder, KTCA-TV\ndirector, was very insistent that only Dr. Clarence\nFaust talk more than that!) The Minneapolis public\nschools, the St. Paul public schools and the University\nof Minnesota are the major contributors. Since the\nUniversity programs the periods from 9:00 to 10:00\np. m., Monday through Friday, the week of Septem¬\nber 16-20, therefore, was another busy one.\nBefore we gather in St. Louis, I shall go to Colum¬\nbus for a meeting of the advisory committee to the\nInstitute for Education by Radio-Television; to\nWashington for a session of the executive committee\nof the Joint Council on Educational Television; and to\nState College Pennsylvania for a meeting on television\ncourses for credit, to be held under the auspices of\nthe American Council for Education.\nAs I have written before, the president of NAEB\nleads a busy life! Yet it is a rewarding one, because of\nthe work he does and the people he works with. But\nthe really high point of any NAEB president’s year\nis the annual convention. So, I hope to see you in St.\nLouis on October 29, 30 and 31 and November 1.\nNAEB NOMINATING\nCOMMITTEE APPOINTED\nPresident Burton Paulu has announced the\nappointment of eight members to the committee\nwhich will make nominations for the four national\nNAEB offices (president, vice president, secretary\nand treasurer) during the convention in St. Louis.\nThey are Richard B. Hull, chairman; Miss Martha\nGable; Howard L. Johnson; Harry Lamb; H. B.\nMcCarty; James S. Miles; James Robertson; and\nEdward Wegener.\nMEMO FROM THE EXECUTIVE DIRECTOR\n—Harry Skornia\nSince this is Convention month, and we shall be re¬\nporting to the membership in person at that time,\nour report this month will be very brief. As a result\nI’m devoting most of this column to the discussion of\ntwo matters which, we trust, will be of interest to\nmany of you - Fulbright Scholarships and the\nUNESCO National Commission 6th Annual Con¬\nference. But first . . .\nMy participation in the All Alaska Workers Con¬\nference (Board of National Missions, Presbyterian\nChurch) was, I believe, useful to NAEB and general\neducational broadcasting objectives. Copies of my\naddresses are being distributed by the Board to those\nOCTOBER, 1957\n3"
}