{
  "id": "d1826-3",
  "text": "interested. Enthusiasm was high for the NAEB\ntapes I played for them, and for the ETV kines¬\ncopes we showed and discussed. Our “Ways of Man¬\nkind” and other series have been a great success in\nAlaska, and I believe increased use of our materials\nwill result from this recent Conference.\nWe urge all who can to attend the Convention.\nThat’s where and when decisions are made which\ndetermine the directions of the NAEB. It is a res¬\nponsibility as well as a privilege to attend and parti¬\ncipate. I hope we may see all at St. Louis October 29\nto November 1. Further details on the Convention\nare discussed in the lead article of this issue.\nFULBRIGHT SCHOLARSHIPS AVAILABLE\nIndividuals interested in study, lectureships or re¬\nsearch under the Fulbright program are urged to\napply for the 1958-59 academic year.\nThe NAEB and Educational Broadcasting espec¬\nially need representation in Italy (first priority),\nFrance and England, to keep open channels already\nestablished, and to capitalize on the fine ground¬\nwork laid by Fulbright predecessors of the NAEB m\nthose countries in past years. Persons interested m\ncomparable broadcast assignments in Germany as\nwell should not hesitate to apply. In many cases the\npresence of applications, and the quality of the pro¬\njects proposed and the individuals applying may\nhelp create or influence the creation of openings not\nlisted in advance.\nEven though not all such applications can be filled,\nthere is much to be gained and little to be lost by\ntrying — if you are, or have on your staffs, qualified\nindividuals with projects which such study might\nbring to fruition. In some cases such projects may\nhave educational or journalistic ramifications other\nthan merely broadcasting-centered interests. Those\nwho qualify in broadcast-related areas of value to\nthe NAEB are designated NAEB representatives.\nThese credentials have been of considerable value to\nprevious scholars in their contacts with European\nbroadcasting organizations.\nBefore applying, it would be well to secure infor¬\nmation from the Institute of International Education\n(1 East 67th St., New York 21, N. Y.) or the Con¬\nference Board of Associated Research Councils (2101\nConstitution Ave., N. W., Washington 25, D. C.) so\nyour broadcast project may be related to currently\nemphasized areas (workers’ education, research,\nsocial work, social sciences, the arts, the humanities\netc.)\nUNESCO NATIONAL COMMISSION\n6TH ANNUAL CONFERENCE\nThe U. S. National Commission for UNESCO\nis holding its sixth National Conference in San\nFrancisco November 6 to 9, 1957. The program theme\nwill be “Asia and' the U. S.: What the American\nCitizen Can Do to Promote Mutual Understanding\nand Cooperation.”\nTwo NAEB individuals active in UNESCO Na¬\ntional Commission affairs in recent years are Richard\nB. Hull and yours truly. The latter is a member of\nthe Planning Committee of this year’s conference.\nTwo West Coast NAEBers will also be participat¬\ning in the Conference on behalf of the NAEB: Dr.\nKenneth Harwood, Director of Telecommunications\nat USC, and Mr. James Day, Director of San\nFrancisco’s widely recognized ETV Station, KQED.\nThe importance of Asia in the current develop¬\nment of world affairs has become widely recognized,\nand the need for greater understanding, if friendly\nrelations are to prevail, is becoming increasingly\nobvious.\nSpeakers at the Sixth Conference will include\nUnder-Secretary of State Christian A. Herter,\nUNESCO Director General Luther Evans, and\noutstanding national leaders from many of the Asian\nNations.\nThe UNESCO National Commission, of which\nHull and I are members, is composed of 100 members,\nappointed by the Secretary of State.\nIts functions are 1) to serve in an advisory capa¬\ncity to the U. S. Government in matter relating to\nUNESCO and 2) to serve as a liaison agent between\nthe American people (and particularly educational\nand other organizations from which the members are\nselected) and UNESCO. Sixty of the one hundred\nmembers are selected from national voluntary or¬\nganizations like the NAEB. The other forty are\nnamed as individuals: 10 from the federal govern¬\nment; 15 from state and local governmental organi¬\nzations and institutions; and 15 at large.\nIf the “feedback” which the National Commission\nexists to serve is to be effective, it is essential that the\nconstituencies be kept informed by their representa¬\ntives of UNESCO developments. It is also essential\nthat ideas and' suggestions regarding UNESCO be\npassed on by members through their representatives.\nI therefore shall be glad to receive from any of you\nproblems or reactions that should' be passed on to the\nNational Commission.\n—NAEB—\nNEWSLETTER"
}