{
  "id": "d1826-5",
  "text": "Delegates who attended the ETV Management Seminar at Allerton House near Monticello. III., from Aug. 20 through 25. Left to\nright (front row): Roy Barthold, KUHT; Gordon Canterbury, KLSE; Jack McBride, KUON-TV; Hartford Gunn, WGBH-TV; E. A. Hungerford,\nMETA; Harry Skornia, NAEB; Harold Hill, NAEB; Loren Stone, KCTS; Gerard Appy, WGTV; Ray Hurlbert, Ala. ETV Commission; (second\nrow): Harry Lamb, Toledo ETV Commission; Haskell Boyter, WETV; Earl Wynn, WUNC-TV; John Dunn, KETA; Armand Hunter, WKAR-TV;\nHenry Chedeayne, KETC; Frank Schooley, WILL-TV; Paul Taff, WMVS; William K. Cumming, WJCT; (third row): William Murphy, WTVS;\nWilliam Ewing, WOSU-TV; Richard Rider, WILL-TV; John Schwarzwald er, KTCA; John Taylor, WTTW; David Stewart, JCET; James Day,\nKQED; Howard Jonson, KRMA-TV; James Robertson, WTTW; Allen Brown, META; George Hall, ETRC; William Harley, WHA-TV; H. M.\nMartin, WKNO-TV; George Arms, KETC.\nFERTILE GROUND FOR\nEDUCATIONAL BROADCASTERS\nTwo striking examples of how radio can extend its\ncommunity services are cited by the NARTB’s weekly\npublication Highlights. In an article “How Radio\nWelcomes the Newcomer,” (Sept. 9, 1957) Highlights\nshows how radio can be a valuable aid to foreigners\nand citizens, moving into new communities, in adjust¬\ning them to their new environments and in giving\nthem a sense of belonging.\nAs typical of the many stations which take ad¬\nvantage of the fact that radio is often the new resi¬\ndent’s first contact with his new community, the\narticle lists WLEC, Sandusky, Ohio. Each new\nfamily in that community receives upon arrival a per¬\nsonal welcome letter from the station containing an\ninvitation to listen to the station’s news of community\nactivities and to its entertainment.\nThe second example mentioned is Chicago where\nthe Mayor’s Committee on New Residents reaches\nimmigrants and migrants through radio disk jockeys\nspecializing in the music of each group. Besides their\n6\nmusical fare, the disk jockeys offer information on\nproblems ranging from how to obtain polio vaccina¬\ntions to how to avoid exploitation by confidence men.\nBoth examples suggest vast opportunities for sim¬\nilar services by educational radio and TV stations.\nBIDS FOR REGIONAL FUNDS INVITED\nIn a recent letter to all regional directors, Executive\nDirector Harry Skornia, with the agreement of Presi¬\ndent Burton Paulu, has invited interested Regions to\nsubmit bids for the greater part of $1,500 available\nfor Regional Conferences this year.\nA portion of the funds will be used at Head¬\nquarters to cover administrative expenses, leaving\napproximately $1,350 to pay for one meeting or $650\nper Region should two conferences be held.\nThe bids, the letter explains, “should point out the\nneeds (a possible special timing justification) of each\nRegion, and indicate assurance that such a conference\nwould be definitely held, well-attended and bene¬\nficial.”\nRegional directors were asked to address their\nNEWSLETTER"
}