{
  "id": "d1826-8",
  "text": "in an exciting and entertaining manner. The program,\nwhich in 1953 won the Peabody Award as the best\nnetwork program for children and youth, has been\nseen regularly on the NBC network for six consecutive\nyears.\n^ Experiments in the TV-teaching of foreign lang¬\nuages to Detroit school children started last month.\nDetroit Superintendent of Schools Samuel Brownell,\none of the nation’s leading proponents of teaching\nforeign languages to American school children, said\nthe TV instruction will supplement work now being\ncarried on in Detroit.\n^ Five new series of live national TV programs will\nbe broadcast over the nation’s educational TV net¬\nwork beginning Oct. 29 as a part of the joint project\nby the ETRC and the NBC.\nInauguration of the fall programs will constitute\nthe second part of an effort by the two organizations\nto connect the non-commercial ETV stations in a live\nnetwork. The first part of the project was conducted\nearlier this year.\nThe commercial network and the ETRC are shar¬\ning costs of approximately $700,000 to carry out both\nthe spring and fall series.\n► With 30 hours of programs each week, WCET,\nCincinnati, has doubled its program schedule over\nlast year, Uberto T. Neely, general manager of the\nstation announced. WCET, the nation’s first licensed\nETV station, is entering its fourth year of telecasting.\n► An eight-program series of tape on the influence of\nFreud in modern America, partially financed by a\n$5,200 NAEB grant, will be broadcast for seven suc¬\ncessive Thursday nights by the San Bernardino Val¬\nley College’s Community Education Division begin¬\nning Oct. 3.\nSpeaking for the president of Valley College, Dr.\nJohn L. Lounsbury, and for CED Director Lawrence\nK. McLaughlin, Rex Gunn, public information di¬\nrector of the College, expressed appreciation for “the\npart that the NAEB has played in Lacking the CED\nprojects.”\nDuring the past five years, the CED projects, a\npermanent part of the College, has given people in\nthe San Bernardino Valley a chance to talk back to\nthe school’s station, KVCR. Following the broadcast\nof programs, several groups, numbering from 6 to 20\npersons each, discuss the subjects in their homes.\nQuestions which arise from these discussions are tele¬\nphoned to the station where a panel attempts to pro¬\nvide the answers at a subsequent live broadcast.\nOn Sept. 23, KSLH, the St. Louis Board of Educa¬\ntion FM radio station, returned to the air for its\neighth year of broadcasting. Although planned\nprimarily for use in kindergarten through college\nclasses, KSLH programs are not limited to student\naudiences. Special late afternoon broadcasts are of\ninterest to adults as well.\nThis semester KSLH intends to broadcast 52 dif¬\nferent program series — 30 for elementary school, 8\nfor high school and 14 for college. Most of these will\nbe produced by the station, to fit classroom needs.\nAlso included in the series are offerings from the\nNAEB.\n^ A Television study of the executive branch of the\ngovernment to be presented over the country’s ETV\nstations beginning Oct. 28, was announced by Robert\nSarnoff, president of NBC. He said the government\nstudy will be one of five new series of live TV pro¬\ngrams launched by NBC in cooperation with the\nETRC at Ann Arbor, Mich.\nThe government study will consist of behind-the-\nscene camera recordings of operations in federal\nagencies in Washington.\nFor his part in furthering the project, Sarnoff re¬\nceived the American Legion’s Americanism Award at\nthe Legion’s 39th Annual National Convention.\nAT PRESS TIME\nA few moments before the deadline of this News¬\nletter we received notice that Commissioner\nRichard A. Mack of the FCC has kindly consented\nto speak at the NAEB Annual Banquet Thursday,\nOct. 31, during the Convention in St. Louis. His\naddress will be in addition to that of Tor Gjesdal,\nreferred to on page two of this issue.\nTV LITERATURE\nThe growing importance of educational television and\nthe public’s increasing awareness of ETV as a pos¬\nsible solution to the nation’s mounting shortage of\nqualified teachers is apparent from the amount of\nspace devoted to the subject in two recent issues of\nSaturday Review.\n“The Schools of Tomorrow” by Carl Bakal (SR\nAug. 24) and “Educational TV: Teacher’s Friend” by\nJohn K. Weiss (SR Sept. 14) are articles which in\ndetail describe ETV’s present status as well as its\ngreat potential as a key intruction device.\nBut even more eloquent than these two articles are\nthe comments which they provoked and which Satur¬\nday Review published in subsequent editions under\n“Letters to the Editor.” The greater number of these\ncomments indicate clearly the rocky road which lies\nbefore ETV and the extent of the resistance which it\nwill have to overcome before it can take its place as\nan established institution throughout the nation’s\nschool systems.\nOCTOBER, 1957\n9"
}