{
  "id": "d1196-12",
  "text": "SUNDAY MORNING\nSunday, May 4\nWORK STUDY GROUPS, Second Session\nAll Groups Meet from 9:30-11:30 a. m.\nAgricultural Broadcasts\n9:30 a. m.. Parlors H, I, J\nChairman: Larry Haeg, Farm Service Director, Station WCCO, Minneapolis; and\nPresident, National Association of Radio Farm Directors. Secretary: Dana\nReynolds, Information Specialist, Radio Service, United States Department of\nAgriculture\nTopic: Organizing the fob of Serving Farm People by Radio\nTal\\s To Be Presented\nRadio to Serve Farm People\nAs an Agency Looks at Farm Service\nOrganizing All Sources of Information\nThe Job Ahead\nThe Junior Town Meeting\nProgram Arranged by Junior Town Meeting League\n9:30 a. m., Room 218\nChairman: W. Kenneth Fulkerson, Producer, Rochester Town Meeting of the\nAir, Rochester, New York, Board of Education\nTopic: Problems in Organizing and Producing Junior Town Meeting Discussions in\nClassrooms, Assemblies, and by Radio\nDiscussion Questions: What are the classroom bases for good Junior Town Meeting discussion?\nHow introduce the discussion of current problems during the development of course-of-study\nunits? What makes a good discussion topic for Junior Town Meeting? Should community\naction be a planned result of Junior Town Meetings? How publicize radio Junior Town\nMeetings, Shall radio Junior Town Meetings be sponsored? What are the problems in¬\nvolved in local sponsorship of Junior Town Meetings?\nParticipants\nb Assistant Radio Education Specialist, U. S. Office of Education\nGeorge Cremeens, Program Director, Station WWXL, Peoria, Illinois\nSecondary Education, Pennsylvania State Department of\nNational Catholic Welfare Conference\nElaine Debus, Division of Audio-Visual Education, St. Louis Public Schools\nJohn Dickman, Director of Public Service, Station WBAL, Baltimore\nFrederick J, Qillis, Assistant Superintendent of Schools, Boston\nProgram and Educational Director, Westinghouse Radio Stations, Inc.,\nPhiladelphia\nR. O. Hughes, Moderator, Pittsburgh Junior Town Meeting of the Air\nHarry Lamb, Director of Audio-Visual Education, Toledo\nRobert Macdougall, Director of Educational Activities, Station WAAT, Newark, New Jersey\nJohn Marston, St. Louis Star-Times\nGeorge H. Reavis, Assistant Superintendent of Schools, Cincinnati\n13"
}