{
  "id": "d1196-17",
  "text": "MONDAY MORNING\nClinic for College and University Stations\n9:30 a. m.. Room 216\nChairman: Richard B. Hull^Director, Station WOI, Iowa State College\nEducational Broadcasting—Shortcomings and Opportunities. Charles Seipmann,\nChairman, Department of Communications, New York University\nEducational Broadcasting—Program and Promotion. M. S, Novik, Public Service\nRadio Consultant; and former Director, Municipal Broadcasting System, New\nYork City\nEducational Broadcasting—Budgets and Legislative Relations. Harold Engel, As¬\nsistant Director, Station WHA, University of Wisconsin; and President, National\nAssociation of Educational Broadcasters\nEducational Broadcasting—Practicality and Realism. E. W. Ziebarth, Education\nDirector, Central Division, Columbia Broadcasting System\nEducational Broadcasting—Objectives and Audiences. Allen Miller, Director,\nRocky Mountain Radio Council, Denver\nEducational Broadcasting—Publicity and Planning. Hadley Read, Extension Editor,\nUniversity of Illinois\nClinic for Educational and Public Service Directors of\nCommercial Stations\n9:30 a. m.# Parlor J\nChairman: Luke L. Roberts, Director of Education, Station KOIN, Portland,\nOregon\nParticipants\nCharles F. Church, Jr., Director of Education and Research, Station KMBC, Kansas City,\nMissouri\nMark L. Haas, Director of Public Relations, Station WJR, Detroit\nRobert B. Hudson, Director of Education, Columbia Broadcasting System\nMax Karl, Public Service Director, Station WTCN, Minneapolis\nRobert B. Macdougall, Director of Educational Activities, Station WAAT, Newark, New\nJersey\nSam Serota, Educational Director, Station WIP, Philadelphia\nMary Somerville, Director of School Broadcasts, British Broadcasting Corporation, London\nE. W. Ziebarth, Education Director, Central Division, Columbia Broadcasting System\nBroadcasting and College Public Relations\n9:30 a. m.. Room 1440\nChairman: Waldo Abbot, Director of Broadcasting, University of Michigan\nSuggestions for College Public Relations and Broadcasting Directors. Lyman Bryson,\nCounsellor on Public Affairs, Columbia Broadcasting System\nWhat the College Broadcaster Wants from the Public Relations Director^Clarence\nM. Morgan, “The Hoosier Schoolmaster of the Air,” Station WBOWTTnHTana\n\"StStTTeacIiers ’ College\n18"
}