{
  "id": "d1196-18",
  "text": "MONDAY MORNING\n^^JMJiat the Director of Public Relations Wants from the College Radio Station. T. R.\nJohnson, Director, News Bureau, Purdue University .\n^..^M^^What Is a Good Public Relations Radio Program? Robert Coleman, Director of\nBroadcasting, Michigan State College\n..Mttblic Relations Value of Radio and Television. Floyd E. Carlson, New York\nState College of Forestry, Syracuse University ' .\nA Statement of Governing Radio Policies for Universities. Frank Schooley, Pro¬\ngram Director, Station WILL, University of Illinois\nProblems of Radio Chairmen of Local Organizations\n9:30 a. m.. Parlors H, I\nChairman: Mrs. Walter V. Magee, Founder, Radio Council of Greater Cleveland\nParticipants\nDavid Baylor, Program Director, Station WGAR, Cleveland\nMrs. George V. Goodbold, President, Radio Council of Greater Cleveland\nRosel Hyde, Commissioner, Federal Communications Commission\nGrace M. Johnsen, Manager, Continuity Acceptance Department, American Broadcasting\nCompany\nLuella S. Laudin, Radio Chairman, General Federation of Women’s Clubs\nM. Margariete Ralls, Radio Chairman, National Federation of Business and Professional\nWomen’s Clubs\nRecordings for Education\n9:30 a. m.# Room 1212\nChairman: Gertrude Broderick, Assistant Radio Education Specialist, U. S. Office\nof Education\nTopic: Uses, Sources and Evaluation of Educational Recordings and a Report on\nPresent Status of Equipment Market\nShannon Allen, Shannon Allen Associates, Washington, D. C.\nEmil H. Andresen, Chief Engineer, Radio Council-WBEZ, Chicago Board of Education\nMildred Batchelder, Secretary, Audio-Visual Committee, American Library Association\nGloria Chandler, Gloria Chandler Recordings, Inc., New York City\nDean E. Douglass, Regional Director, Education Department, RCA-Victor, Chicago\nHarold Franklin, Program Director, Institute for Democratic Education, New York City\nMarguerite Kirk, Director, Department of Libraries, Visual Aids and Radio, Newark (New\nJersey) Board of Education\n<(-^^*William B. Levenson, Directing Supervisor of Radio, Cleveland Board of Education\nw“if?CZffi'T?^^ONT^\"ARSEt., Director of Community Service and Education, Station WTOP,\nWashington, D. C.\nRuth Weir Miller, Educational Director, Station WCAU, Philadelphia\nEllis Miracle, Director of Radio, Lash High School, Zanesville, Ohio\nRobert Schacht, Bureau of Audio-Visual Instruction, University of Wisconsin\nBlanche Young, Radio Consultant, Indianapolis Public Schools\nNorman Woelfel, Director, Teaching Aids Laboratory, Ohio State University\n19"
}