{
  "id": "d1196-6",
  "text": "SATURDAY AFTERNOON\nTopic: Varied Media as Discussion Resources\nDemonstration: The Problems of Metropolitan Life Today—A Discussion Report on a Unit of\nStudy\nTwelfth Grade Social Studies Class, University High School, Ohio State University. Hugh\nLaughlin, Instructor\nCritique Panel\nDorothy Blackwell, Assistant Director of Audio-Visual Education, St. Louis Public Schools\nE. L. Bowsher, Superintendent of Schools, Toledo\nEdgar Dale, Bureau of Educational Research, Ohio State University\nHarold Reynard, University School, Ohio State University\nalter Wittich, Director of Bureau of Visual Instruction, University of Wisconsin\nC. W. Pettegrew, Executive Secretary, Junior Town Meeting League, Discussion Chairman\nDiscussion from the Floor\nNational Organizations and Radio\n2:00 p. m.. Room 1440\nChairman: Howard London, Radio Director, National Foundation for Infantile\nParalysis, New York City\nTopic: What Can the Listener Rightfully Expect from the American Form of\nBroadcasting?\n>* James Lawrence Fly, Attorney, New York City, and former Chairman, Federal Communica¬\ntions Commission\nRobert S. Stephan, Radio Editor, Cleveland Plain Dealer\nTopic: How Can National Organizations Promote Public Service Broadcasting?\n[^H.JB.^McCarty, Director, Station WHA, University of Wisconsin; and National Radio Chair-\n.maiirNatlAfld'!''f?ongress of Parents and Teachers\nGeorge W. Johnstone, Director, Radio Department, National Association of Manufacturers,\nNew York City\nTopic: Local Broadcasting by National Organizations\nGeorge Patterson, Program Director, Station WAVE, Louisville\nWalter Huffington, Chief, Radio Section, Public Information Department, American Red\nCross\nRadio News\nProgram Arranged by National Association of Radio News Directors\n2:00 p. m.f Room 1212\nChairman: John F. Hogan, Station WCSH, Portland, Maine; and President, Na¬\ntional Association of Radio News Directors\nTopic: News Room Operations and Management, with a Study of Local News\nGathering Methods\nTom Eaton, News Director, Station WTIC, Hartford, Connecticut\nLeslie Ford, News Director, Station WBEN, Buffalo\nDavid Kessler, News Director, Station WHAM, Rochester\nSoren Munkhof, News Director, Station WOW, Omaha\nPaul H. Wagner, News Director, Station WOSU, Ohio State University\n7"
}