{
  "id": "d1350-3",
  "text": "mo PAYS THE FIDDLER?\nAcoording to reports coining out of Washington the taxpayers of this country will\ncontribute some <i?6,l|.00,000 for the running of the Federal Communications Commission\nin 1914.8 fiscal year. This may be small change in terras of the millions in revenues\nderived from the sale of radio time——but it further indicates that free radio is\nstill a myth in these United States, Perhaps those who advocate a rental fee for\nthe use of the public domain do have some arguments on their side,\nTHE Vi/QQW QUESTION\nThe experience of WQQW, ViTashington .known as the \"blue book station\" because it\nreduced commercials to a minimum and kept the listeners’ interests in mind as well\nas those of the sponsors, indicates again that \"he who pays the fiddler calls the\ntune\".\nThe station, which was piloted by Edv^ard Brecher, gave the public what it\nwanted-good music, brief commercials, and quality programs. Listeners liked it.\nBut, the station could not adhere to the policy of brief commercials and at the\nsame time earn sufficient revenue to operate profitably. The result--reorganization\nalong more conventional lines—a loss to the listeners.\nThis should serve to again remind non-commercial stations of their unique\nopportunities for serving. The audience is v/aiting. Capture iti\nADMlS TALKS RADIO COOPERATION\nAdams reports from the University of Washington in Seattle that when the\nbroadcasters of Washington and Oregon met in a joint session in Portland in June, he\nwas called in to speak on the mutuality of the need for cooperation bekiveen broad¬\ncasters and educators,\nMUSIC CODE DEVELOBaENT\ni’ollowing the report that union restrictions on the use of educational music\nwould be eased, and that a code conference would be held to formulate conditions of\nmusic use this exchange of telegrams occurred:\nHonorable Carroll Kearns\nHouse Office Building\nWashington, D,C,\nTHE NATION/Ii ASSOCIATION OF EDUCATIONAL BROADCASTERS, REPRESENTING THE NON-\nCOMMERCIi'JL INSTITUTIONALLY OWED STATIONS OP THE COUNTRY, REQUESTS THAT ITS\nINTERESTS BE NOT JEOPARDIZED IN THE FOUvIULATION OF THE CODE FOR EDUCATIONAL\nMUSIC BROADCASTING. YlTELL APPRECIATE OPPORTUNITY TO HAVE NAEB RlilPRESENTATIVE\nAT CODE CONFERENCES.\nJuly 2I4, I9h7\nHarold A, Engel, President NAEB\nI HAVE FORWARDED YOUR TFAEGR/JI TO CLIFF HJTTEU5AN. I FEEL SURE HE WLL\nGIVE YOU FULL CONSIDER/lTlON i'JID CONFERENCE ON CODE.\nJuly 25> 19^4? Carroll D, Kearns MC\nNAEB’ers interests will be represented at the conference and a report will be\nBade on the developments.\nIn the past non-commercial stations have, in general, enjoyed immunity from\nmusic restrictions by virtue of the basis of their operation. It is desired that a\ncordial working relationship be maintained.\nCONVENTION HOTEL RATES\nThe Continental Hotel, 905 N, Michigan Avenue, Chicago, Illinois will be the\nmeeting place for the NAEB convention on October 25 and 26. The School Broadcast\nConference which opens on the 27th v;ill meet in the same hotel and reservations may\nbe made for continuous attendance. Hotel rates quoted are; Single ^|5,00 un.\nDouble C)5.50-7.5‘0, Twins $7«00-C59.00, Suites |511.50 up. ^"
}