{
  "id": "d1350-5",
  "text": "NEWARK SCHOOLS START M\nThe Newark (N.J.) Board of Education will put its Wi station WBGO on the air on\na regular five hour daily schedule starting on October 1. The station will have\nstudios and transmitting equipment atop Central High School in Nevi/ark.\nW illiam Pfeiffer, formerly of Westminster Choir College and earlier on the\nstaff of l/lfflA at the University of Wisconsin, has been appointed Supervisor of Radio,\nOn his staff are a producer, a program arranger and a script writer.\nPrograms for classrooms will range from elementary to high school level,\nINDIANA STARTING SCHOOL OF SKY\nHarry Skornia reports -bhat^ Indiana University is this fall opening its School of\nthe Sky for classroom listening. The programs will be integrated with the Indiana\nschools curriculum on the sixth grade level in the fields of the social studies,\nscience, literature, art and music. The State Department of Education will publish\nand distribute teacher manuals for the courses, George Johnson, formerly in charge\nof the Kansas Classroom of the Air, is coordinator for the new School of the Sky\nwhich is expected to be broadcast by at least a dozen oomraercial Ail and FM stations.\nPlans are under way for participation in television programs over stations in\nBloomington and Indianapolis.\nWFIV is the call assigned to the University of Indianans FM station. It will\noperate with 10 Kw, power.\nHITS AND MISSES\nWOL, Washington is reported to have instituted a new \"public service\" program\non July 7 -the race results and prices.\n\"The Infernal Triangle \" in radio, says Fannie Hurst, is the radio industry\nitself, the advertiser, and the consumer.\nTelevision, say four network officials in a study published by an advertising\nagency, because of its combination of sight, sound, motion and immediacy will offer\nthe most potent form of mass advertising ever developed and one with the most\n\"terrific impact\". Terrifying indeed when you think what theyWe been able to do\nwithout the benefit of the \"sight\" factor.\nKT/VSC’s claim to the \"longest remotes ever done by a non-network station\" (Los\nAngeles, Calif, to Pullman, Washington) is challenged by WILL which did basketball\nfrom Berkeley, California to Urbana, Illinois, Talk it over, boys’.\n\"The Great Day is coming,-It will come because there is a growing and spread¬\ning awareness that radio today does not provide that essential training ground for\nthe development of new talent, coupled with the awareness that the whole economic\nsystaii underlying the local station’s operation doesn’t presently permit for support\nof such a training ground\". .... George Rosen, Variety, 7/9/I47\n\"Don’t tell me I don’t know what I’m talking about, I have a grandson, Michael,\nwho is eight, and if he continues to listen may never bo nine, I sat with him\nseveral evenings before he went to bed and heard things which scared the bijabbers\nout of me\", , , . . Eddie Cantor, Variety 7/9/54-7\n\"Are your parties dull? Are\nElsa Maxwellj just ask, \"What do\nyour guests bored? Do you need a party book\nyou think about children’s radio programs?\"\n.... Olga Druoe, Variety 7/9/Il-7\nor\nTELEVISION——YES\n\"To see or not to see: that is the question\", shades of Shakespoarc,\n\"Children should be seen and not heard\"."
}