{
  "id": "d1335-11",
  "text": "■l/ow to uie tadi\npioneer efforts in learning efficiently to\nutilize this new technological tool of in¬\nstruction will its real value be dem¬\nonstrated. The teacher who thinks in\nterms of education as effective living will\nnot hesitate to attack vigorously such\nobstacles as re-scheduling her instruc¬\ntional program or advocating curricular\nrevision in order to fit radio in.\nWHAT ABOUT\nEQUIPMENT?\nIT SEEMS unnecessary for the pur¬\nposes of this booklet to go into the\ntechnical problem of equipment for\nclassroom radio reception except to make\na few general suggestions. Radio will\nnaturally serve the purposes of educa¬\ntion best when there is a receiving set\nin every classroom. Frequently, how¬\never, a number of classrooms may tem¬\nporarily find it necessary to use the same\nradio. This can readily be done if each\nteacher plans in advance the programs\nshe wishes to use with her class and con¬\nsults with the other teachers with whom\nshe must share use of the radio.\nAuditorium listening, or listening in a\ncrowded classroom, are generally un¬\nsatisfactory. Bad acoustics, difficulty in\ncontrolling volume so that it is satis¬\nfactory both to those near the radio and\nalso to those farther away, discomfort\ndue to crowding, all distract from the\nvalue of the program. Best results\nseem to be secured when children listen\nin their own classrooms, in a natural\nsituation, with classroom materials at\nhand. The proper tuning of the class¬\nroom radio should be assigned to a\nradio-minded boy who understands the\nvarious adjustments.\nListening in a rural school is compli¬\ncated by the fact that the teacher must\nof necessity consider children of various\nages and grade levels. One solution to\nthis problem might be to place the radio\nin an anteroom or hall and allow the\ngroup who would benefit most by the\nprogram to listen there. If no anteroom\nis available, a corner of the classroom\nmight be used, with the radio turned low\nenough to avoid, if possible, disturbing\nother children. This arrangement is far\nfrom ideal, of course, but the enrichment\nthat radio can give to the rural school\ncurriculum definitely outweighs such diffi¬\nculties.\nRather than supply a radio for each\nclassroom some of the larger schools in\nthe country have purchased a central re¬\nceiving set which serves an entire build¬\ning. Briefly, this consists of a receiving\nand broadcasting unit usually located in\nthe administrative office, with a receiv¬\ning outlet in every room. Radio programs,\nphonograph records, and programs or\nannouncements originating within the\nschool may be broadcast over the sys¬\ntem, reaching any or all of the class¬\nrooms.\nThe number of radio programs which\nmay be used in the building at any one\ntime depends on the number of channels\nprovided for in such a unit. Since most\nof the centralized systems are of the one-\nchannel type this usually results, in so\nfar as radio reception is concerned, in\nthe same situation that would arise with\none portable radio in the building. In\naddition, some persons feel that teachers\nwill not make as complete use of radio\nwhen it is necessary to make arrange¬\nments through the administrative office\nto tune in as they would if the radio\nwere a regular part of their classroom\nequipment. On the other hand, pro¬\nponents of the central equipment sys¬\ntem feel that these objections are more\nthan offset by the multitude of teach¬\ning uses to which centralized radio sound\nsystems, especially of the several chan¬\nnel type, can be adapted.\nrTHE relative merits of central receiv-\ning over individual receiving equip¬\nment is admittedly a controversial one.\nThe issue, however, seems to boil down\nto this: If the purpose of the equip¬\nment is to enable the teacher to make\nas complete use of radio as possible, that\npurpose will best be met by a radio re-"
}