{
  "id": "d1335-20",
  "text": "in the claMoom\nnot brought into conflict with his family\nwhen the school requests him to listen to\nthem. Where it is desirable to use the\nactual subject matter from the program\nin the classroom, the program should\nbe simple and clearly intelligible, because\nof the necessary interval between broad¬\ncast and follow-up. Listening to an out-\nof-school broadcast should be required\nrarely and then only if the material is\nhighly relevant to classroom activities.\nMusic, drama, story, variety show,\nscience, history and news programs may\nall on occasion be recommended by\nteachers. Many programs which are\nplanned for adults are equally interesting\nto children. Before recommending any\nout-of-school radio program for boys and\ngirls the teacher should ask herself the\nfollowing questions:\n1. Is the program based on children’s\ninterests?\n2. Does it come at a suitable time?\n3. Is it well presented technically?\n4. Is it emotionally satisfying?\n5. Does it meet the particular needs of\nthe child or children for whom I am\nrecommending it?\n6. Is it valid?\n7. Is it of general interest?\n8. Is it closely correlated to our work\nin school?\n9. Do the programs which I recommend\npresent a variety of experience?\nb. How can contributions from out-of-\nschool ■programs be utilized in the class¬\nroom. Since the teacher is interested in\nthe whole lives of the children and is\nanxious to make as close a correlation as\npossible between home, playground and\nschool activities, she will want to examine\nthe possibilities of out-of-school radio\nprograms in helping her realize these\npurposes.\nFREQUENTLY programs which may\nhave a definite relation to work in the\nclassroom come during out-of-school\nhours. Examples of these carried on\nnation-wide radio networks are: Amer¬\nica’s Heritage, Science on the March, The\nStory Behind the Headlines, America’s\nTown Meeting of the Air, The World Is\nYours, Men Against Death, Great Plays,\nImmigrants All—Americans All, and Cav¬\nalcade of America. Others may be se¬\nlected from a careful study of the local\nstation’s program roster.\nWhen is the teacher justified in making\na definite assignment for out-of-school\nlistening? To answer this question it is\nnecessary first to answer several others.\nDoes every child in the class have a radio\nin his home, or is there a place where he\ncan go to listen? Obviously it is unfair\nto make an assignment when all the chil¬\ndren are not equally equipped to carry it\nout. There is also the danger that the\nchild without a radio will be made to feel\ninferior or ashamed. The organization\nof occasional listening groups in the\nhome of the teacher or of a pupil might\nhelp. Is the program on the air at a\ntime when it does not conflict with pro¬\ngrams to which other members of the\nfamily regularly listen? It should be re¬\nmembered that a radio assignment given\nto the child frequently means an assign¬\nment to the family as well. What is the\nrelationship of the program to the regu¬\nlar classroom activities? This relation¬\nship should always be clearly apparent to\nthe pupils as well as to the teacher.\nAssuming that the students have equal\nopportunities for listening, that the as¬\nsignment will not bring them into con¬\nflicts with their families, and that the\nmaterial of the program is closely corre¬\nlated with the work in school, how is the\nteacher to prepare for and follow up the\nbroadcast?\nAdvance preparation cannot be as ex¬\ntensive as for school broadcasts because\nit is frequently impossible to get detailed\naccounts of the broadcast content in ad¬\nvance. The chief activity in preparing\nfor an out-of-school radio program would\nperhaps be the defining of the purposes\nof listening, and a consideration of the\nquestions the class would like the pro¬\ngram to answer, or of the specific points\nthe pupils expect to hear brought out.\nThe teacher might also point out things\nto watch for. Follow-up activities might\ninclude a critical evaluation of the pro¬\ngram, a sorting out of the material which\nis useful to the class, and a discussion of\ncontroversial points raised.\nThe teacher will want to make frequent\nrecommendations about out-of-school\nradio programs which may serve as sup¬\nplementary material in certain subject\nareas. Often these programs will not be"
}