{
  "id": "d1335-6",
  "text": "in the cLa&itoom\nTHE materials for this introductory handbook on the use of radio in\nthe classroom were gathered by the persons named on the title page\nin the course of a six weeks’ radio education seminar held in connec¬\ntion with the Progressive Education Association’s Eastern Workshop\nat Sarah Lawrence College, Bronxville, New York, during the Summer of\n1938. These persons, all of whom have had considerable experience in class¬\nroom use of radio programs, set for themselves early in the seminar the\ntask of preparing a booklet that might stimulate wider use of radio by\nteachers and that would at the same time lay the foundations for more\nintelligent classroom radio utilization. The group divided itself into small\ncommittees, each of which undertook the responsibility for one or more of\nthe present chapters. Miss Anne O. Gottschalk of the Chicago Public Schools\nRadio Council was chairman of the general committee and her help was\nindispensable in getting the project under way. Many committee confer¬\nences were held and a large amount of material was collected in the course\nof the six weeks. The task of preparing a preliminary draft of the booklet\nfell to Miss Jean Friedberg of Chicago and Mrs. Helen Moore of the Detroit\nPublic Schools. These two teachers worked tirelessly throughout a hot and\nsultry week editing and re-writing the various chapters until a really inte¬\ngrated document emerged. The handbook in its present form is a second\nrevision of the original material. Various fellow-members of the Evaluation\nof School Broadcasts staff as well as teachers and radio-educators have made\ninvaluable criticisms and suggestions which have been embodied into what\nhas been a truly cooperative effort.\nThe handbook offers suggestions to teachers who are interested in using\nradio in their classrooms. It is intended to be introductory and provocative\nrather than comprehensive and conclusive. Because the practice of using\nradio in the classroom is relatively new, and because learning content will\nvary each time a new radio program comes into the schoolroom, a handbook\nof this type can hardly do more than recommend general procedures. A\ngreat deal of the success of using radio in school depends upon the adapt¬\nability of the teacher, her insight into the implications of educational radio\nand her understanding of where, when, and how to serve the educational\nneeds of the boys and girls in her classroom.\nNorman Woelfel,\nOhio State University."
}