{
  "id": "d1435-7",
  "text": "SOCIAL RESPONSIBILITY OF RADIO IC>5\nsion’s reports, and many more pages of discussion and analysis\nin the Commission’s unpublished documents.\nNow as to the series of propositions:\nFirst: — Freedom of expression as an effective individual\nright constitutes a fundamental basis for the maintenance and\nsuccess of a free, democratic society.\nSecond: — This basic concept was given partial expression\nin the free press clauses of our constitutional documents. As\ninterpreted by our courts, these clauses provide an effective\nguarantee that governmental regulation shall not abridge free,\nindividual expression.\nThird: — In the contemporary situation with mass com¬\nmunication concentrated to a considerable extent in each local¬\nity, and in the nation, in a relatively small number of relatively\nlarge units, protection against government is not enough to\nguarantee that a man who has something to say shall have a\nchance to say it. Necessarily, the owners and managers of the\nmedia determine, to a large extent, which persons, which facts,\nand versions of the facts, which ideas and which causes shall\nreach the large masses of people. The way they exercise\nthis inevitable control determines the degree of the effective\nmaintenance of freedom of individual expression. Thus, abridg¬\nment of free expression may be as harmful, may be as danger-4\nous, as ever were the actions of royal officials on the writings of\nPeter Zenger. Furthermore, we cannot prohibit by law this\ncontrol by the media of the people who use it. They must\nsomehow regulate their own selections so as to give maximum\nopportunity for the man with something significant to say to\nhave his say.\nFourth: — Equally basic with individual expression as a\nconcept underlying democratic society, is the need to provide\nevery citizen with an adequate and uncontaminated daily diet\nof the current news, of the conflicting ideas and arguments on\npublic issues j with fair pictures of the attitudes of the groups\nthat constitute the society. The need is so essential to a demo¬\ncratic process that it acquires the stature of a citizen’s right and\nfor the agencies of mass communication an obligation which\nthey must reasonably meet as the price of their freedom. A\nfree press and radio and film industry, therefore, must be a\nresponsible or accountable press, radio, and film industry.\nFifth: — This responsibility on the part of the major\nmedia of mass communication means that they “should regard"
}