{
  "id": "d1449-2",
  "text": "TV PUT END TO \"STARVING WRITER\" ERA:\nMcCLEERY\nThere is no such thing as a “starving” writer today,\nunless he is a lazy writer or no writer at all, accord¬\ning to Albert McCleery, executive producer of NBC’s\nMatinee Theater. Good writers, he feels, can sell to\nTV regularly.\nWhile addressing students, educators and\nprofessional TV people at the seventh annual Summer\nTelevision Workshop at Michigan State University,\nMcCleery enumerated the changes brought about\nin the American theater by TV.\nHe credited TV with having produced the first\ntruly “American” theater which, he held, during the\npre-TV era was actually “a New York theater —\nan overflow and outgrowth of European theater.”\n“It was not until about seven years ago, with\nthe opening of Kraft Theater, Studio One and' some\nof the other pioneer dramatic TV shows,” McCleery\nsaid, “that we could begin to use American writers\non American themes with an instant audience of\n10 million people.”\nCalling the close-up the “one thing which modern\ndrama has brought us which the Greeks didn’t do\nas well or better,” McCleery welcomed the mech¬\nanical possibility to “make use of the eyes as the\nwindow of the soul.”\n“What television has to decide now, he said,\nis what kind of cultural force it intends to be, how\nit intends to deal with man’s leisure time.”\nViewers who brag they do not watch commercials,\nhe said, are treading on dangerous ground.\n“When advertisers think you aren’t watching\ncommercials,” he warned, “then you will have\ngovernment TV and you will pay for it in another\nway — through taxes. Television is never free.”\nMcCleery, one of the industry’s top producer’s,\nis a staunch advocate of abandoning lavish TV pro¬\nduction settings. His own Cameo Theater present¬\nations have pioneered the use of what he terms\n“selective realism and symbolic settings” to set the\nmood for a scene.\nDEATH OF BOY, 6, BLAMED ON FAULTY\nTV SET\nCook County (Ill.) Coroner Walter T. McCarron\nhas ruled the July 14 electrocution death of Howard\nErenstein, a 6-year-old boy from Skokie, Ill., as an\naccident caused by contact with a faulty TV set.\nThe verdict was based on a lengthy report by\na blue ribbon jury of electronics experts which\nfound the set involved — a GE portable — defective.\nThe defect, it is believed, resulted from faulty fact¬\nory assembly of the set. Prior to the experts’ report,\nGE Engineer Mertis E. Jones testified that the\nset was not dangerous “until it had been dropped\nand damaged.”\nIn connection with their findings, the experts\nrecommended that safety codes and practices of the\nportable appliance industry be strengthened.\nNOMINATIONS WANTED\nThe Rev. Joseph M. McKee of Faribault, Minn.,\ninvites Newsletter readers to submit nominations of\npersons “who merit recognition for some contribu¬\ntion toward the advancement of secondary educa¬\ntion.” The nominations are to determine 100 winners\nof awards to be made in connection with the June,\n1958, observance of Shattuck School’s (Faribault)\ncentennial.\nAll persons living in the United States or terri¬\ntories, except those having connection with Shattuck,\nare eligible for the awards.\nNominations may be made by sending the name\nand address of the nominator and of the nominee\nwith a brief statement why he, or she, was chosen to:\nThe Centennial Office, Shattuck School, Faribault,\nMinn.\nAUSTRALIA'S DUAL BROADCASTING\nSYSTEM\nTwenty-five years of peaceful commercial and\ngovernmental broadcasting co-existence in Australia\nhave convinced C. W. Davidson, postmaster general\nof the Dominion, that “no other system is as fair to\nthe public or as efficient as our own.”\nIn an article, which appeared in the Australian\nBroadcasting Commission’s Weekly, July 7, Davidson\nexplains the advantages arising from this unique\nblending of socialized and laissez-faire broadcasting.\nGovernment stations, he holds, because of their\nindependence from advertising, can broadcast both\n“high class” and popular programs. Without these\nprograms, he believes, musical and educational\nstandards would suffer.\nAs an essential function of governmental broad¬\ncasting, David lists the presentation of parliamentary\ndebates, shunned by commercial stations because of\ntheir limited popularity.\nOn the other hand, Davidson thinks that govern¬\nmental broadcasting is limited in that it must main¬\ntain a balance in its comments on public issues — a\nrestriction which does not apply to commercial sta-\nSEPTEMBER, 1957\n3"
}