{
  "id": "d1449-4",
  "text": "^ The Department of Education for the State of\nAlabama has appointed Dr. James Y. Moultrie as\ncoordinator of the Alabama Educational Television\nNetwork’s Special Educational Television Project.\nThe project, which is aimed at encouraging the ex¬\nperimental use of TV teaching in classrooms, is an\nin-school and in-service teacher training program.\n^ Frank W. Norwood has joined the faculty of San\nDiego State College as assistant professor of speech\narts and coordinator of instructional television.\nNorman has held positions as assistant to the director\nof the Institute for Education by Radio-TV, Ohio\nState University, and writer-producer at the St.\nLouis Board of Education FM station.\n► Gale R. Adkins, director of the Bureau of Re¬\nsearch in Education by Radio-TV, University of\nTexas, was appointed to the faculty of the University\nof Kansas. Prof. Adkins will head the University’s\nradio-TV research activities, teach in the departments\nof speech and journalism and serve on the committee\nwhich supervises the school’s broadcasting training.\n► Steward S. Rowe, vice president of the Illinois\nInstitute of Technology, Technology Center, Chicago,\nwas elected president of the Chicago Chapter, Public\nRelations Society of America.\n► The Illinois Institute of Technology has named\nDonald P. Anderson its new audio-visual coordinator\nand radio-TV assistant. A graduate of Northwestern\nUniversity, Anderson formerly worked for the NBC\nin New York City and for station WMAQ in Chicago.\n^ Robert W. Schlater, a former NAEB Fellow at\nthe State University of Iowa, was named program\nmanager of KUON-TV and assistant director of\neducational TV at the University of Nebraska follow¬\ning three years as KUON-TV producer-director. He\nalso participated in the NAEB Program Planning\nSeminar at the University of Wisconsin in 1956.\n► Veteran NBC producer-director Edward King is\nthe new staff director of META, according to Dr.\nAlan W. Brown, META’s president. King’s first\nassignment following his appointment was the direc¬\ntion of The Living Blackboard, a daily educational\nseries to be introduced Sept. 30 over WPIX in coop¬\neration with the city’s Board of Education.\n► The Adult Education Assn, of the U.S.A. has re¬\nelected Dr. Harry J. Skornia, NAEB executive direc¬\ntor, as delegate-at-large, an office he held during\n1955-56.\nAmong the duties assigned to Dr. Skornia in this\ncapacity are the serving on committees of the Dele¬\ngate Assembly and the maintaining of two-way com¬\nmunications between the national AEA and its state\nconstituencies.\n^ Kenneth D. Wright has rejoined the staff of\nWUOM-FM, University of Tennessee, after spending\na year on the ETRC’s program staff at Ann Arbor.\nHe has been replaced as the Center’s program asso¬\nciate by Ray Stanley of the University of Wisconsin\nwho will maintain radio program liaison with the\nNAEB.\n^ James Day, general manager of KQED, San Fran¬\ncisco, has announced the appointment of Richard\nBarnett as KQED’s new public relations manager.\nFor the past three-and-a-half years, Barnett\nserved as the Central California director of the Na¬\ntional Foundation for Infantile Paralysis. In his\nnew job, he will be primarily concerned with increas¬\ning public support of the station.\nPROGRAMS\n^ The 1957-58 Lowell Television Lectureships will\ngive poetry and art lovers in the Greater Boston\narea an opportunity of viewing lectures on these\nsubjects by two distinguished Harvard scholars over\nBoston’s noncommercial station WGBH-TV.\nProf. I. A. Richards, critic and teacher of lan¬\nguages, who will lecture on poetry, is well known for\nhis pioneering ideas in teaching French and Spanish\nthrough TV.\nThe art lectures will be presented by Prof. Jakob\nRosenberg, a native of Berlin, Germany, and an\nauthority on the Dutch masters.\nThe Lowell Television Lectureships were esta¬\nblished by Harvard in 1956 to enable outstanding\nscholars to prepare for TV “a college course of in¬\nstruction selected both for its intellectual content\nand for the excellence of its manner of presentation.”\n► What makes the broadcasting industry tick?\nTwelve radio and TV executives will provide answers\nto this question during a series of lectures beginning\nthis month at the Indiana University Television\nDepartment.\nProf. E. G. Sulzer, department head, has invited\nall persons interested in the field to attend.\n► A statewide in-school teaching-by-radio program\nconsisting of 12 broadcasts each week will be\nlaunched Sept. 23 by the Wisconsin School of the Air\nover WHA, Madison, WLBL, Auburndale, and State\nFM Network. The broadcast, which will cover a\nvariety of subjects, will be heard in schools at 9:30\na.m. each Tuesday.\n► In a unique celebration of its 35th anniversary,\nMichigan State University’s radio station WKAR,\nthird oldest station in the state, reintroduced to its\nlisteners the familiar voices of more than 60 former\nannouncers—some of them dating back to 1934.\nSEPTEMBER, 1957\n5"
}