{
  "id": "d1449-5",
  "text": "The programs, which were broadcast daily from\nAug. 12 through Aug. 31, consisted of recorded sta¬\ntion break announcements and personal remarks\nidentifying each former announcer’s part in the sta¬\ntion’s history. Tape recordings were obtained from\nas far as Tokyo and Alaska.\nAnother special anniversary program, commem¬\norating the Michigan Department of Health’s 1,000th\nconsecutive weekly broadcast over WKAR, was pre¬\nsented on Aug. 6.\nThe program featured the presentation of an\naward and certificate by the health department to\nRobert J. Coleman, WKAR station director, in recog¬\nnition of nearly 20 years of cooperation between the\ndepartment and WKAR. During this period, all\ntypes of general public health information were\nbroadcast, ranging from the treatment of common\ncolds to the Salk vaccine.\n^ The U.S. government has come to the aid of some\nof the nation’s estimated 15 million hard-of-hearing\nwith a grant for the preparation of 20 half-hour\nkinescope films designed to teach lip-reading by TV.\nThe grant was received by Hear, Inc., a Madison,\nWis., social service agency. Project coordinator is\nDr. John Irwin, director of the University of Wiscon¬\nsin Speech Clinic. The series will be produced and\ndirected by Robert Squire from Boston’s WGBH-TV.\nIts initial release will be in January 1958.\n^ On Sept. 15, following two weeks of experimental\nbroadcasting, station KTCA-TV, Channel 2, Minnea¬\npolis and St. Paul, will commence its regular program\nschedule with a telecast of its own dedication cere¬\nmonies.\nThe new ETV station, which is owned and opera¬\nted by the Twin Cities Area Educational Television\nCorp., University of Minnesota, will broadcast 40\nhours each week. Programs will include credit and\nnon-credit courses.\ny The Tales of Poindexter, a TV series depicting the\nadventures of a floppy-eared dog puppet of doubtful\nancestry, is presently prepared by Tom Tichenor, new\nacting director of children’s programs at WKNO-TV,\nMemphis, Tenn.\nThe series of 39 fifteen-minute programs to be\nreleased this fall, will include fairy tales by Anderson,\nGrimm and many originals.\nTichenor, an expert in puppets and marionettes\nsince high school days, was engaged by the station\nthrough a grant-in-aid from the Junior League of\nMemphis.\n^ The United Nations Story will be told in pictures\nto students of Hunter College, N. Y. C., through 40\nfilms and kinescopes beginning Sept. 17.\nThe course will be conducted by Dr. Arno Huth,\nan expert in international communications, who\ndesigned the 15-session series to promote greater\nunderstanding of the United Nations, to explain\nits concepts and to demonstrate its world-wide\naction.\nNEW MEXICO TO ENTER ETV FIELD\nSeven New Mexico towns have announced their\nparticipation in the University of Mexico’s junior\ncollege experiment tentatively scheduled to begin\nSept. 23 while an application for a station permit\nis still pending.\nThe experiment entails classes in English, math¬\nematics, biology and anthropology to be telecast\nover Channel 5 from a studio on the UNM campus.\nStudents in each of the seven receiving towns\nwill meet in public school classrooms for the\ninstructions which will be supervised by University-\nhired monitors. A similar group of students, while\nserving as control group, will take the same courses\non the campus to enable comparison of the effect¬\niveness of both teaching methods.\nTeachers who will serve as monitors attended a\none-week summer workshop to become familiar with\nthe TV system. They also worked with the professors\ngiving the courses and laid out course schedules.\nThe new station will be manned by professional\nand student technicians.\nPLACEMENT SUPPLEMENT\nSeptember I - Young man with M'.S. and B.S. in radio and\nTV along with 10 years experience in the industry is\ninterested in teaching and working with ETV station;\ntop references from a major TV and radio market;\nwishes job with emphasis on management, writing and\nproduction. Location open. $7,000 to 8,000.\nSeptember 2 - Male, single, 30, graduate of business admin¬\nistration college: Syracuse University, and radio-TV\nschool; thoroughly trained in all aspects of broad¬\ncasting (except engineering); desires educational\nbroadcasting position. Location and salary open.\nSeptember 3 - Male, married, 35, engineer, FCC license;\nwith 2 years transmitter, studio and recording exper¬\nience; seeks permanent position - will accept respon¬\nsibility. Location open. $75/wL\nSeptember 4 - Male, single, 31, experienced record librarian;\nfamiliar with programming and production techniques;\nwould like to find employment in the record library of\na station in New York City or vicinity. $50/wk.\nSeptember 5 - Male, married, 33, with extensive musical ex¬\nperience — choral director, pianist, arranger, music\nlibrarian, dance band; high school teacher; M.A. from\nColumbia University; limited experience in radio, none\nin TV, but eager to learn; seeks position in ETV.\nLocation secondary, but prefers Florida. $5,500.\nNEWSLETTER"
}