{
  "id": "d1549-0",
  "text": "N A £ 8 NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nFrank £. Schooley, Editor, Station WILL, Urbana, III.\nOctober I, 1944\nANNUAL N A E B MEETING IN CHICAGO, OCTOBER 22 AND 23\nThe annual meeting of the National Association of Educational Broaocasters\nWILL BE HELO SUNDAY AND MONOAY, OCTOBER 22 AND 23, IN THE MORRISON HOTEL,\nChicago.\nSessions will be held Sunoay at 2 p.m. and 8 p.m. in Parlor D of the Morrison,,\nSessions on Monday call for a luncheon at noon in Parlor D and the business\nSESSION TO FOLLOW IN THE SAME PLACE.\nRoom reservations should be made by delegates direct with the Morrison Hotel.\nLuncheon reservations must be made with the NAEB Executive Secretary no\nlater than Sunday evening.\nThere will be no speakers other than NAEB members making reports and remarks\nTO THE CONVENTION.\nFinal plans for convention topics will be made on October 20. Members\nWISHING ANY PARTICULAR TOPIC SCHEDULED FOR DISCUSSION SHOULD TRANSMIT THE\nREQUEST TO THE EXECUTIVE SECRETARY IMMEDIATELY.\nSome of the topics already listed for oiscussion include:\nSecuring of surplus war materials and equipment for educational use.\nThe FCC Hearing on Post-War Use of the Spectrum.\nLegislation of radio broadcasting.\nListener surveys for educational stations.\nPolitical broadcasts over educational stations*.\nNAEB membership and affiliation.\nRoundtable on member station activities.\nI *ll see you in Chicago. aNo, ! *m going to have to travel 800 miles that\nweek-end to get there, too, Ripley.\nKENTUCKY ROUNDTABLE ON WHAS\nDr, Henry Noble Sherwood, acting head of the department of political\nscience at the University of Kentucky, ano former president of Georgetown\nCollege, will act as moderator for the University’s weekly roundtable\nseries over WHAS, Louisville, with the opening of the fall schedule. The\nroundtable, which is broadcast on Sundays, ^2:00 to 12:30 p.m”. has been\na University of Kentucky feature for a number of years, and concerns\nITSELF ABOUT EQUALLY WITH INTERNATIONAL, NATIONAL AND STATE QUESTIONS OF\nPOPULAR INTEREST."
}