{
  "id": "d1875-1",
  "text": "A second grant announced this week was to Washington educational television ^\nstation, WETA# The grant of $323,077 vas the 15th to be approved and will be used by\nWETA for a $528,929 project to increase the power of its transmitter and to expand its\nproduction and video tape recording facilities. With higher power, WETA expects to\nreach an additional 634,000 viewers.\nForty-two applications have been accepted for filing and are awaiting further\naction. The pending applications seek $7,327,556 in federal funds.\nETV CHANNEL PROPOSED AT R0SC0E, SOUTH DAKOTA\nThe FCC invited comments to its Notice of Proposed Rulemaking looking’toward\nassigning Channel *2 to Roscoe, South Dakota, for noncommercial educational use, in\naddition to that state's presently assigned four VHF reserved channels. The South\nDakota Educational Television Association and the State Superintendent of Public\nInstruction petitioned for the assignment to make possible the creation of a state¬\nwide educational television network. The proposal requires Canadian concurrence.\nNAEB URGES FREE USE OF COPYRIGHTED MATERIALS FOR EDUCATION\nThe NAEB, along with 25 other educational organizations which have formed an ad\nhoc committee on copyright law revision, was represented in testimony by Harry N.\nRosenfield, Washington Attorney, who appeared recently before a Consultants Rinel to\nthe Register of Copyrights. The Panel has been charged by Congress to bring in recom¬\nmendations for revision of the 1909 Copyright law. Speaking for the educational groups,\nRosenfield proposed that \"recognized non-profit educational institutions\" be allowed\n\"where no commercial advertising is included nor other private financial gain is involved\"^\nto make one copy of a copyrighted work for educational purposes. A detailed statement\nof the NAEB's position on the copyright issue is included in the President's Memo, dated\nMarch, 1964, Vol. Ill, No. 1.\nAmong the educational organizations included are such other national groups as\nthe American Association of School Administrators, Council of Chief State School Officers,\nAmerican Association of University Women, National Education Association, National\nEducational Television and its affiliated stations, National Catholic Welfare Conference,\nNational Council of Teachers of English, National Science Teachers Association, and a\nnumber of associations for foreign language teachers.\nAPPLICATIONS INCREASE FOR INSTRUCTIONAL TELEVISION FIXED-SERVICE\nThe Plainedge, New York, school system and the Central School District of\nHempstead, Long Island, have filed applications with the FCC for licenses to operate\nInstructional Television Fixed Services. The Plainedge School System was the first to\ntest this type of supplemental educational television service. In a previous Vfe-shington\nReport, it was incorrectly noted that the Plainview-Old Bethpage School System had\nconducted the experimental studies.\nNEW FCC FILING FEES NOT APPLICABLE TO EDUCATIONAL BROADCASTING STATIONS\nOn Tuesday, March 17, the FCC instituted a fee for filing applications. Because\nof NAEB efforts, the Commission has not required fees in the case of applications filed\nby tax-exempt organizations for the operation of stations for non-commercial educational\nbroadcast services. The Commission included all such stations in its dispensation\nregardless of whether the stations are operated on frequencies allocated or reserved\nfor noncommercial educational use."
}