{
  "id": "d542-4",
  "text": "SCHOOL STATIONS COMMITTEE REPORT\nThe School Stations Committee T.Qt Jointly with the In-School Program Committee\nin Columbus in April and three members of our Committee are in attendance at the\nConventiono\nThroughout the year we have found that the problems closest to the school stations\nwere also those being considered by the In-School Program Committee. Members of both\nCommittees feel that school stations should not be set aside as a special group in NAEB,\nbut rather that all member institutions involved in planning and producing programs for\nin-school use should be working together—sharing experiences, responsibilities, and\nvisions for the common good of children and youth. Likewise, we should be working with\nthe total group in the out-of-school and adult program areas.\nWe recommend that NAEB sponsor wholly or in part further seminars and workshops for\npersons engaged in in-school programming. We should like to see these open to writers\nand producers as well as to school of the air directors and school station managers.\nWe hope that NAEB will consider the recommendations of the Foundations9 Committee\nReport made at the School Stations Allerton Seminar regarding the production of outstanding\nprogram series for use in schools, particularly at secondary school level. We should\nlike to have some series which wo :Id make the impact upon the classroom aud sues that\nWays_of Mankind and Jfe-jJeffersonian Heritage make upon adult audiences.\nOur Committee, in cooperation with the In-School Committee, prepared and circulated a\nquestionnaire to all member school stations. Not enough have been returned to formulate\ndefinite conclusions coneming the many items listed. However, there seemed to be a real\nneed to develop some program, series which would make a greater impact upon a tott.1\ncommunity audience through programming for many special audiences which make up a 'rotal\nCommunity. This is in accord with the idea suppressed at this convention that in some of\nour programming we need to reach out where the people are.\nAs more Questionnaires are returned, the results will be tabulated and sent to the\nIn-School Program Committee and to NAEB Headquarters.\nRespectfully submitted,\nHarry Lamb\nJohn Maier\nOla Hiller\nNote}\nWe should also send the questionnaire results to all member stations who broadcast\nin-school programs even though they are not •'Chool stations."
}