{
  "id": "d863-104",
  "text": "GENERAL HISTORICAL NOTE\nSince this discussion project is based on a series of radio programs, some¬\nthing should be said at the very start about the character of the latter. It is\nsummed up in the words of the announcer at the end of each of these little plays:\n\"Authentic in historical spirit, while imaginative in form, these programs drama¬\ntize ideas which are the enduring possession of all Americans, and all free peo¬\nples.\" These ideas have been centered in a particular historic personage for pur¬\nposes of effective presentation, and Thomas Jefferson was chosen for the central\nrole because he can be more easily and fully associated with them them any other\nsingle man. But they belong to anybody who will receive them—in any and every age.\nThe radio as a medium permits us to take liberties with time and space which\nwould be difficult or inpossible on the stage or television screen, and which are\nnot compatible with sober history. In this series Jefferson is often summoned from\nthe grave, and in fact he is regarded as timeless, just as these ideas are. His\nlanguage is adjusted to the circumstances of particular programs, and often he is\nmade to say things in one situation when he really said them in another. Many of\nhis finest and most characteristic sayings come from private letters and may have\nbeen known to relatively few of his contemporaries. We have not hesitated to put\nthem into other settings, and are glad that they can be heard by millions now. No\nliberties have been taken with his ideas, however, and no violence has been done\nhis language. Much though not all of his conversation consists of direct or in¬\ndirect quotation, and he and the other historic personages are always kept in char¬\nacter. If in life they did not actually do all the things they are here represent¬\ned as doing, they easily might have done them.\nThis mingling of fact and fancy may possibly be confusing to some, even though\nthey are laymen rather than professional students of history. Also, some may be\ninterested to learn Just what the historic facts are in the particular episodes.\nAccordingly, a fairly detailed Historical Note is attached to each program. Our\nExperimental Discussion Program Subject to Revision\n7"
}