{
  "id": "d863-107",
  "text": "As a member of the Committee to revise the laws of the state, he proposed the aboli¬\ntion of primogeniture (eventually agreed to) and drafted his famous bill for estab¬\nlishing religious freedom (passed in 1786) and for the more general diffusion of\nknowledge (never passed). He was less successful as governor, 1779-1781, during\nthe British invasion. Soon after his retirement he wrote what proved to be his only\nbook, his \"Notes on Virginia\". Then, after the death of his wife in 1782, he re¬\nturned to public life as a member of the Continental Congress (1783-178^). Here he\nproposed the decimal system of coinage and recommended the major features of the\nlater policy of forming new states out of the territories.\nFor five years, I78U-I789, he was in France - first as a commissioner to ne¬\ngotiate commercial treaties and then as Benjamin Franklin’s successor as Minister.\nHere he has his \"Notes on Virginia\" printed, associated with scientists and phi¬\nlosophers, and witnessed the outbreak of the French Revolution. On his return home\nhe became, in 1790, the first Secretary of State under the Constitution, remaining\nin office through 1793. While thoroughly loyal to Washington, he strongly opposed\ncertain policies of his colleague Alexander Hamilton, In 179& he was supported far\nPresident by the Republican or Democratic-Republican party against his old friend\nJohn Adams, candidate of the Federalists. Adams had a majority of the electoral\nvotes and,according to the system then in effect, Jefferson as the second man became\nVice President. During the presidency of Adams, when he himself was practically\nimpotent as Vice President, the notorious Alien and Sedition Acts*were passed. He\nalways regarded these as an unconstitutional infringement on the rights of political\nopposition and free speech, and he and James Madison drew the Kentucky and VirginLa\nResolutions in protest against them. At the same time he was serving as president\nof the American Philosophical Society and interesting himself greatly in scientific\nmatters.\nIn the election of 1800, John Adams and the Federalists were defeated, but\nthe electoral system then provided for no distinction in the vote for president and\nvice president, and by accident there was a tie between the two Republican candi¬\ndates, Jefferson and Aaron Burr. This was finally broken by action of the House of\n10"
}