{
  "id": "d863-126",
  "text": "ments between him and Edmund Pendleton. Some injustice may have been done the latter\nby process, and those who hear this program should remind themselves of the picture\nof Pendleton in the program on religious freedom. The nature of the problems con¬\nnected with entail and primogeniture may be clear enough from the radioscript, but\nreferences to that subject are given in the list of Suggested Reading. These laws\nwere really relics of feudalism and the practice of entail, in particular, was an\nembarrassment to large owners who wanted to sell as well as to small owners who\nwanted to buy land. It limited the mobility of property and the attack on it was\nin no sense an attack on individual freedom. The distinctiveness of Jefferson's\nattitude lay in the social purposes which were in his mind. His efforts to maVg\nwestern lands readily available to small farmers were even more significant, per¬\nhaps, but it was not feasible to dramatize this aspect of his economic statesman¬\nship. Nor is there any reference to the Louisiana Purchase, the most important\nachievement of his presidency. By means of this he enormously increased the amount\nof land which might be opened up to American farmers.\nIt has not been possible to deal here with the controversy between Jefferson\nand the New Englanders over commerce at the time of his Embargo (1807-I809). This\nmuch-disputed policy was designed to use what we now call \"economic sanctions\"\nrather than resort to war, and it has generally been judged unsuccessful. It would\nrequire a session by itself and all we can say here is that in itself it shows no\nhostility on his part to commerce. Jefferson's most extravagant praise of agri¬\nculture was made relatively early in his career, in his \"Notes on Virginia\" (1785).\nHe gave great attention to commerce while minister to France and as Secretary of\nState, and in his first inaugural address (l80l) referred to it as the \"handmaiden\"\nof agriculture. His conversion to manufacturing was later and never complete. He\nregarded it as necessary if the United States would become a relatively self-suffi¬\ncient nation. He always preferred agriculture, however, as a better way of human\nlife. His last speech, which summarizes his mature economic philosophy, is really\na series of quotations.\n32"
}