{
  "id": "d863-134",
  "text": "acted (1798) at the Instance of the extreme Federalists in the administration of\nJohn Adams. Passed in a time of anti-French hysteria it sought, in the name of\nnational patriotism, to prevent all criticism of the government. It was chiefly\nemployed against journalists belonging to the opposing party} and a major motive\nfor it in the minds of the more extreme Federalists was to crush the other party\n(generally called Republican at that time) of which Jefferson was the acknowledged\nleader. He himself termed the Sedition Law (with which the Alien Law is generally\ncoupled) unconstitutional, since it seemed to be in complete defiance of the First\nAmendment. The attempt to stigmatize the opposition party as unpatriotic and se¬\nditious was unsuccessful, for Jefferson was elected President in 1800. He par¬\ndoned the men who had been convicted under this law, and at that time or later the\nfines these men had paid were all remitted. Thus the legitimacy of political crit¬\nicism and opposition was vindicated. Needless to say, this sort of vindication\ncould have occurred under no dictatorship, ancient or modern, without overthrowing\nit.\nJefferson's concern for freedom of discussion related to public matters, and\nit was his misfortune to be subjected to a flood of personal calumny. The forms\nwhich this took are suggested by the \"Voices\" in the radio program. There had been\npersonal attacks on public men before this but these on him appear to have been the\nworst. Thus the question arose whether the freedom of the press extends to private\nslander. Jefferson did not think it did, and he saw no reason why libel laws (state\nlaws) should not be invoked in punishment of defamation. He thought it inappropriate\nfor a high official to have recourse to such laws, however, and he himself never did\ninvoke them. He relied on the corrective power of public opinion, and he inter¬\npreted his triumphant re-election as proof that an unscrupulous press was powerless\nto overthrow a just government. If he lost much of his faith in newspapers, he never\nlost faith in the people as a whole - in their common sense and essential fair-mind¬\nedness. He himself had been supported by many papers, to be sure, but this was a\nlow period in the standards of the press and he was shocked by the manners of his\nsupporters as well as by those of his enemies.\n1*0"
}