{
  "id": "d863-142",
  "text": "may arise from the people themselves. This is what Alexis de Tocqueville afterwards\nreferred to as the \"tyranny of the majority.\" Jefferson anticipated that in his\nfirst inaugural (see his'last two speeches in the radio program). Here he said\nthat the will of the majority \"to he rightful, must he reasonable.\" The success of\na democracy depends on the recognition of the rights of minorities, mutual forbear¬\nance, and full respect for the honest opinions of every man. Its strength lies,\nnot in coercive laws, hut in general confidence in its fairness,and it cannot hope\nto thrive in an atmosphere of poisonous suspicion. It should he inspirited by faith,\nnot paralyzed by fear.\nQuestions and Topics for Discussion\n1. Can you think of any instances in the United States in our time where the at¬\ntempt has been made, by means of law, to limit freedom of opinion?\n2. Instances where such an effort has been made by non-governmental groups?\n3. Why did Jefferson regard coercion of opinion as more dangerous than dissent\nfrom majority opinion?\n4. What dangers, if any, do you think he would perceive in the procedure of con¬\ngressional investigating committees?\n5. How would you yourself distinguish between political dissent and subversion?\nCan you think of any instances in our own time when the effort has been made\nto identify them?\n6. What do you understand by the expression, \"tyranny of the majority\"? What\nsafeguards are there against it in the Constitution? What safeguards did\nJefferson suggest?\n7- Should tolerance of other people's opinions extend to allowing:\n(1) Advocacy of communist doctrines in a public meeting;\n(2) Advocacy of the overthrow of our government by force;\n(3) Advocacy of socialist doctrines in public;\n(4) Advocacy of pacifism in public;\n(5) Public attacks on the social or political policies of a\nreligious group?\n8. Sum this up by saying where, if anywhere, you would draw the line.\n9. Do you know of anybody who urges freedom of economic enterprise while objecting\nto freedom of opinion on economic subjects? Which do you regard as more impor-"
}