{
  "id": "d863-160",
  "text": "The most effective line of objection in his own time, actually, was that the\neducation of all the people was impracticable because of expense — which, inci¬\ndentally, would fall chiefly on the well-to-do. Jefferson's answer to this argu¬\nment was that all would share the benefits of public enlightenment, and that in the\nlong run the fruits of ignorance would prove even more costly. On this point, pos¬\nterity has agreed with him and the prosperity of a new and growing country has per¬\nmitted American society to assume a financial obligation beyond the dreams of even\nJefferson. This should not be attributed to prosperity alone, however, for the\nAmerican enterprise of universal public education is one of the most striking ex¬\namples of the faith of a democratic society. It has been said that education has\nbecome an American religion.\nAnother line of objection in his time was that universal education was danger¬\nous to organized society because it would make the lower classes dissatisfied with\ntheir lot, and undesirable since it would reduce all classes to the dull level of\nmediocrity. Such objections were inspired by the self-interest of the favored\ngroups, of course, but there was some point in them. No society can survive if\neverybody in it is \"educated\" to such a point that he refuses to do physical work,\nand there is a danger of leveling men down by pouring them into a common mold.\nThese dangers were foreseen and guarded against by Jefferson, as a matter of fact,\nand it was not his fault that later generations disregarded important qualifications\nand refinements in his proposals.\nHe was convinced that the education of everybody at public expense up to a point\nwas necessary, in order that men might intelligently exercise their duties as citi¬\nzens. Under the conditions of his own time he tried to make these proposals feasi¬\nble, and few Americans now would be satisfied with them. It is only the principle\nthat need concern us here. He believed that beyond a point education at public ex¬\npense should be on a selective basis. This should not be the artificial basis of\nbirth and wealth, as it tended to be under the old system. It was to be wholly on\ngrounds of merit,and was to tap the aristocracy of talent and virtue, from which the\nleaders of society must come. (This matter of leadership is central in the next\n69"
}