{
  "id": "d863-165",
  "text": "wanted to bring about tbe highest possible degree of public and private happiness.\nAdams tried to be a realist. To borrow a figure of speech from Gilbert and\nSullivan, he played the \"hose of common sense\" on the foibles and sentimentalities\nof his time. In his mellow old age he argued about aristocracy as follows: (l)\nThe testimony of history is that wealth and birth have actually prevailed in all\nages; (2) There is no use talking about equality, since men are born unequal in\nbody and mind; (3) Strong and able men are always likely to get into the saddle;\n(4) Therefore, aristocracy (of birth and wealth) cannot be got rid of; it can only\nbe controlled; (5) The best practical means of controlling it is to give it a rec¬\nognized, though not a dominant, position in the government. (His-ideas on this\nsubject are not entirely clear, but he thought it inevitable that there should be\nsome representation of wealth in the government.); (6) Absolute power is abhor¬\nrent in any form -- even in a majority in a popular representative body — and the\nonly safeguard against it is a balanced government.\nJefferson's argument went like this: (l) Hereditary aristocracy had no real\nplace in America; in reality it was so unpopular that an \"aristocrat\" was at a\ndisadvantage if he ran for public office; (2) There is no denying the inequali¬\nties of men in natural endowment, but artificial inequality is unreasonable and\nundesirable; (3) An aristocracy of birth and wealth is artificial. It should not\nbe buttressed by law, and, so far as wealth is concerned, it need not be, since\nwealth can be counted on to look after itself. (This does not mean that he favored\nany sort of confiscation of property; what he wanted to get rid of was artificial\nprotection.); (4) In any sort of society there is constant danger that the ras¬\ncals will gain control, but the best of safeguards is the good sense of the whole\nbody of the people — who must be educated; (5) The natural aristocracy of talent\nand virtue, which is scattered through all ranks of society, is Nature's most pre¬\ncious gift; and the best of all governments is one in which aristocrats of this\nsort have the best chance to become leaders of society.\nOn the natural aristocracy, thus defined in terms of ability and character,\nAdams and Jefferson were finally agreed. The best society, they believed, is the\n75"
}