{
  "id": "d863-24",
  "text": "(Release number 1)\nFrom: Radio Station XXXX\nAddress\nTelephone\n(date of release issuance)\nFCR RELEASE: (date)\nRADIO STATION WXXX INTRODUCES NEW SERIES ON\nTHOMAS JEFFERSON.\nThe introductory program of the new thirteen-week series\non \"The Jeffersonian Heritage’5, produced by the National Association of\nEducational Broadcasters will be presented on (date) over Radio\nStation (name) at -F. M.\n\"The l iving Declaration\", which will lead off the distin¬\nguished series of narratives of the life and times of Thomas Jefferson,\nwill dramatise the part played by Jefferson in the writing of the Dec¬\nlaration of Independence. The main theme of the opening broadcast will\nbe that the third President's ideas and the ideas in the Declaration are\nliving realities.\nMorton Wishengrad wrote the text for the first program,\nwhich will emphasize the Jeffersonian quotation: \"The earth belongs to\nthe living generation. \" The script is based on the research, writings\nand advice of Dr. Dumas Malone, Professor of History at Columbia\nUniversity.\nProduced and directed by Frank Fapp, as an Adult Education\nProject of the NAEB, the dramatization will carry vibrant dialogue against\na background of music composed and conducted by Wladimir Selinsky,\nThe music has been paced to provide depth and meaning to the impressive\ndialogue.\nAs Thomas Jefferson, Claude Plains, the distinguished star\nof stage, screen and radio, speaks the sonorous words that might be\nconsidered the keynote of the first program of \"The Jeffersonian Heritage\",\n\"Some men look at constitutions and declarations with\nsanctimonious reverence and deem them like the ark of the covenant,\ntoo sacred to be touched. They ascribe to men of the preceding age\na wisdom more than human. I knew that age well. I belonged to it.\nI labored with it. It deserved well of its country and of you, but what it\ndid is not beyond amendment.The earth belongs, not to dead men,\nbut to you* \"\n30"
}