{
  "id": "d863-32",
  "text": "(RELEASE NUMBER 9)\n* i\nFROM: Radio Station WXXX\nAddress\nTelephone\n(Date of Release Issuance)\nFOR RELEASE: (DATE)\nFREEDOM OF THE PRESS SUBJECT OF\nBROADCAST ON WXXX\nThomas Jefferson always championed a free press\nin this country, even when, much to his disillusionment, the vituper¬\nation of the Fourth Estate was poured upon him when he was President.\nJust how much the statesman believed that newspapers should have free\nrein to express their opinions is brought out in ' Freedom of the Press\",\nsoon to be heard by radio listeners in this area.\nNinth in the notable series on \"The Jeffersonian Heritage\"\nan Adult Education Project of the National Association of Educational\nBroadcasters, \"Freedom of the Press\" will be heard -- (date) -- at\n(time) -- over Radio Station -- (name) -\nAs in the other broadcasts in the series, Claude Rains,\nstar of the screen, will portray Thomas Jefferson. The episode has\nbeen produced and directed by Frank Papp, with the musical score com¬\nposed and conducted by Wladimir Selinsky. Mr. Selinsky is no stranger\nto television viewers and radio listeners as he has provided musical\nbackgrounds for many shows in both media.\nThe script has been based on research, writings and\nadvice of Dr. Dumas Malone, Frofessor of History at Columbia University,\na noted authority on Jefferson.\nThroughout the story of this ninth episode in the\nHeritage series, the values and abuses of a free press are portrayed\ndramatically.\n\"The free press and what it meant in Jefferson's time\nis something that cannot fail to be of interest td us today, \" Seymour N.\nSiegel, President of NAEB, declared in commenting on the subject.\n\"We have observed the subsidised press in the intellectual darkness of\ndictator countries and we realize how destitute we would be of any real\nfreedom in any field if the freedom of press in our own country were to\nb<» loot. I am sure no one will want to miss this broadcast. 11\n30"
}