{
  "id": "d863-33",
  "text": "RELEASE NUMBER 10\nFROM: Radio Station WXXX\nAddress\nTelephone\n( Date of Release Issuance)\nFOR RELEASE: (DATE)\nTHE UNIVERSITY OF THE UNITED STATES PROJECTED BY\nTHOMAS JEFFERSON IN BROADCAST OVER RADIO STATION WXXX\nThe story of how Thomas Jefferson, in his later years,\nfought for universal public education through sponsorship of his bill\nfor \"The More General Diffusion of Knowledge\" is outlined in \"The\nUniversity of the United States\", tenth in the distinguished radio broad¬\ncast series on \"The Jeffersonian Heritage'1.\nThe new Jefferson episode, which illustrates the founding of\nthe University of Virginia and dwells on the application of selective tests\nin higher education, will be heard -- (date) -- over Radio .Citation -- (name)\n-- at -- (time) Starring the noted picture actor, Claude Rains, as\nThomas Jefferson, the broadcast is an Adult Education Project of the\nNational Association of Educational Broadcasters.\nWith the \"Heritage\" series now more than two-thirds through\nits total number of thirteen broadcasts, Ceymour N. Giegel, President of\nthe NAEB, described the reaction of radio listeners to the Jefferson episodes\nas \"little short of sensational\". Reception of the series, Mr. Siegel said,\nhad proved the very great need for mature, well-thought out, yet enter¬\ntaining programs such as NAEB sponsors.\n\"The University of the United States\" was written by Milton\nGeiger on the basis of research, writings and advice of Dr. Dumas Malone\nFrofessor of History at Columbia University. With music composed and\nconducted by Wladimir Selinsky, it was produced and directed by Frank Papp.\n\"Education is a proper function of government\", Jefferson\nwill say in the new episode while defending his Bill for the diffusion of\nknowledge. \"Education of all of the people up to a point is necessary to\nsafeguard their freedom and happiness. The education of persons of\nnative ability to the highest degree is necessary to provide leaders and\nadvance knowledge. These should be selected on the grounds of talent\nand virtue wholly without reservations of wealth and birth. On that\ntrinity I found my philosophy of education. \"\n30"
}