{
  "id": "d983-0",
  "text": "COPY\nHAE8 Headquarters\n14 Gregory Hall\nUTbona, Illinois\nCOPY\nSeptember 29, 1954\nMr0 Robert VanBuyn\nAssociate Director\nDivision of Education\nWo K. Kellogg Foundation\nBattle Greek, Michigan\nDear Bobs\nAs Dr. Seay may have told you, I had the pleasure of meeting him and\nvisiting the Kellogg Foundation for the first time a week ago today, when I was\non my way through Battle Creek from other meetings. Pa sorry it was at a time\nwhen you w©ren8t yet back, but hop© I may pass that way again soon. Although I\nimagine this finds you still in th© unpacking stag©,' I thought it slight be desir¬\nable as soon as possible to get before you one rather limited request which might\naffect next y©ar8s grant.\nThis specifically concerns the fact that wo now haw an Associate\nDirector, Harold E„ Hill, as a part of t i i jtaiar K@; ^quarters® eiaiK ly th®\nbeginning of the next fiscal year, Harold will have been with us approximately\na year and a half. However, unless budgetary provision for his salary can be\nadded to th© earlier approved Kellogg grant expected for th® 1955-56 fiscal year,\nw® should have to drop Harold a year before th© expiration of the rest of the\npresent Kellogg grant.\nX believe that by the end of the year and a half he will have served\nby the end of June, Harold will deserve a raise in salary,, X hop© to recommend\nto th® directors an increase of something on th® order of $800.00, for an annual\nsalary of #8,000.00 per year. Adding to this the #623.20 retirement and #120.00\nworkmen0 s compensation charges which the budget would also have to carry, this\nwould make a total of #8,743o20, not including any administrative charge, which\nI am sura w© could absorb.\nInasmuch as X feel we owe it to Harold to know what 'the prospects are\nfor the coming year as soon as.possible, X hopo you do not mind my request for an\nopinion on this matter as soon as possible. Granting it would not be interpreted\nas a decision on th® part of the W. K. Kellogg Foundation to extend its commit¬\nments beyond the period already decided upon. For this more basic problem X am\nsure w© all agree more time and more fundamental examination of all the issues\nand possibilities involved will be necessary.\nAt the time of this more intensive series of discussion® X bflljeve it\nextremely desirable for us to tak© up with you in greater detail than ■'.boa hereto¬\nfore been done the matter of the Washington office which th© 1IASB hopes to set up"
}