{
  "id": "d983-14",
  "text": "February 17 , 195>6\nMr. Kenneth R. Kurts\nStation ^BQ\nAugusta, Georgia\nDear Kens\nAdnittedly, it has been many, many months and I suppose that ire could go into\nall kinds of conversation about who hasn’t been keeping in touch with whom, however,\nKen, what the hellI\nThe main purpose of this letter, is to bring to your attention an organization\nmhlch, I think you will agree, presents great challenge to people Just like you.\nFrankly, I £mt something. I want to tell you the story of the Association for\nEducation by Badlo-Television because, Ken, I think itisaaggropp for which you cou\ndo some very substantial work. I know it's a group which is dedicated to principles\nand objectives with which you are in sympathy.\nAEFfT was formed some sixteen years ago as an educational non-profit association.\nIncorporated under the laws of the state of Illinois. Kan outstanding radio educators\nand educators-by-radio were charter members. Among them were such people as Judith\nTaller of EEC Chicago, Kenneth Bartlett, head of the radio department at Syracuse,\nand Parker Theatley of the Lowell Institute Cooperative Broadcasting Council here in\nBoston! AE® ?s dedicated to the utilization and evaluation of educational radio and\ntelevision materials, both in the commercial and non-commercial broadcasting industries.\nAt the present time, the Association has about 600 members. These include teach¬\ners and administrators on all levels of education, commercial broadcasters, religious\nbroadcasters, civic leaders, parents, and representatives of leading business and\nprofessional groups on both national and local levels.\nAFWr has a Journal which is published eight times during the academic year, usually\nrunning about 32 pages. It contains articles written by members, having to do with\npractical program and promotional ideas, how-to-do-it and how-to-find-it sugges ions,\nreports of listener surveys, and evaluation studies plus an occasional piece on mass\ncommunications theory.\nThe Association has an annual convention held in Columbus, Ohio coincidental\nwith the Ohio State Radio and Television Institute. This year’s convention will be\non the 17th of April.\nBow the reason I am telling you all this is three-fold. First, I think you m• ght\nlike to affiliate yourself with AFPT. Second, you might be in a position to interest\nsome of the stations in the CSPA in signing up as local institutional members and\nthird, and perhaps most important, you might be interested in devoting a small amount\nof time to helping us in our efforts to broaden our membership base."
}