{
  "id": "d983-47",
  "text": "Utoch 26, 1956\nMrs* Dexter 0. Arnold\nChairman, Ccxasisiic&tlORS \"^p/irtiaont\nGeneral Federation of Tioeaen’s Clubs\n6 Dearborn Road\nConcord, How Hampshire\nDear Mrs* Arnold:\nProfessor Leo A. Martin, national president of the Association for\nEducation by Radio-Television, has forwarded to me your letter and enclosures\nof August 29$ 1955. Let me say that I was delighted to see that a si sable\nnumber of the members of the General Federation of T anon’s Clubs are not only\ninterested In the evaluation of radio and television programs, but Indeed are\ntaking the time to do constructive work In this vital field*\nBecause of the nature of the activities of your Somraunications Department,\nyou may sell be Interested in the purposes and objectives of the Association\nfor Education by Radio-Television.\nAERT is a non-profit organisation, national in scope, which Includes among\nits members teachers and administrators on all levels of education, coamrcial\nbroadcasters, religious broadcasters, civic leaders, parents, and representa¬\ntives of many leading civic, business and professional groups. This, then,\nprovides a truly national cross-section of those who are keenly Interested in\nthe further exploration of the utilisation and evaluation of educational radio\nand television materials, both in the commercial and non-commercial broadcasting\nfields.\nIn addition to the publication of the AEHT Journal, of which there are\nei$at issues annually, AEHT has played an important role in the formation and\nimplementation of the Joint Cwiittee on Educational Television. AEHT also\nserves as one of the sponsors of the National Tape Recording Catalog and Re¬\nrecording Service, a project set up In cooperation with the Department of Audio-\nVisual Instruction of the Rational Education Association* The annual national\nconvention of AEHT members is held each year In conjunction with the Ohio State\nInstitute for Education by Radio and TV at Columbia, Ohio.\nThat AEHT is equally concerned with both educational radio and educational\ntelevision, on both commercial and non-comercial stations. Is evidenced by the\ncomprehensive articles on both media which appear regularly in the AEHT Journal*\nSubmitted by Association members themselves, these articles cover a diverse\nlumber of topics including areas of communications theory, practical program\nand promotional Ideas, helpful how-to-do-lt and how-to-find-it suggestions, as\nwell as reports on listener council and other evaluation activities*"
}