{
  "id": "d983-59",
  "text": "<4\nJ\ntorch 28, 19#\nMrs. R.M. Van Horne, Assistant\nTX^artnent of Community Services\nCollege of Adult and Extension Education\nUniversity of Kentucky\nLexington, Kentucky\nDear Mrs* Van Horne:\nTour letter of March 9> addressed to the Chicago business\noffice of the Association for Education by Radio-Television, has\nbeen referred to me.\nTour Package Library Service sounds like a vexy interesting\nproject. I wish I was able to supply you with several copies of\nthe types of materials you obviously are looking for. Because\nAERT is incorporated as a non-profit educational organisation, we\nfind it necessary to make most of our materials available on a\nself-liquidating basis. We find the best way to accomplish this\nis to Include all wp our services under a set of membership and\nsubscription fees, which vary according to the situation.\nI am sending you seven packets of material. Each is the same,\nand contains a membership form, a statement of our objectives and\nthe advantages of membership, a form letter explaining AEHT in some\ndetail, a copy of a recent news release, and most important, a\nsample copy of a recent issue of the Journal of the AEHT.\nthought is simply this. Probably the users of your service\nwould be most interested in the variety of articles on the utilisa¬\ntion and evaluation of educational radio and TV which appear\nregularly in the pages of the Journal. Unfortunately we are not\nin a position to regularly supply you with gratis copies. However,\nperhaps the users will want to either join our Association or take\nout a subscription to our Journal once they find out what our\norganisation is and does. With this thought in mind, I have in¬\ncluded the materials listed above.\nIf you have the funds available, may I suggest that you take\nout a subscription to the AEHT Journal for each Package Library\nthat has to do with radio and TV. In this way you would be able\nto keep each collection up to date as far as AEHT is concerned."
}