{
  "id": "d983-81",
  "text": "November 1, 1956 ^tCt-Wc-D\nMnw -2\nDear AERT Member: WUV <-\nPRESIDENT’S\noFF,r\nBy now you may have learned that AERT has merged with NAEB. The vote\nat the special meeting in Atlanta on October 17th was in favor of the con¬\nsolidation. While the AERT does not now exist in name, its purposes and\nobjectives will be continued within the framework of NAEB and the projects\nof AERT should be given even greater impetus and encouragement in the\nexpanded NAEB.\nMany of you were undoubtedly surprised to learn of this projected\ndevelopment and you also may have wondered why the action appeared to be\na sudden one. Actually, this was anything but impulsive action and a\nresume* of the history leading up to the Atlanta meeting should illustrate.\nAERT was founded for the purpose of providing an association for those\npeople who were primarily interested in methods of utilization of radio in\nthe classroom. It was, and always has been, the classroom teacher who has\nformed the base of the association's membership and focal interest. Early\nactivities of the association included research into and study of methods\nfor the best utilization of radio (later TV) in the school rooms. Confer¬\nences were held on national, regional and local levels and frequent suggestions\nwere circulated to the membership.\nWhen the JOURNAL was expanded into a more elaborate format, the income\nof the association was needed just to publish the monthly issues. Dues\nwere not raised; yet printing and mailing costs increased. The primary\nactivities associated with utilization had to be dropped so that the\ncommitments for JOURNAL subscriptions could be met.\nAs early as five years ago, the then officers of AERT began to realize\nthat the end of AERT was in sight unless some means for raising greater\nrevenue could be found. No other organization seemed interested in a\nmerger with AERT at that time although attempts were made to interest them\nin such an arrangement. Each succeeding administration has operated on a\nbasis of strict economy. During the past year, for example, AERT has\nnot had any official stationery. Office expenditures of postage, typing,\nbookkeeping, travel, etc. have all been financed outside the AERT treasury\nduring the past year. It has been impossible to provide any member services\nor even permit association expenditures for the annual convention and AERT\nday.\nEven with the strictest economies imaginable, the organization came\nclose to a loss for the year. The JOURNAL has averaged $500 per issue or\n$4,000 for the year. Revenue from almost 500 memberships at $5.00 and\nslightly over 200 subscriptions at $4.00 (less agency fees of 20ft) brought\nin less than $3500 for the year. Thus, our income was less than our expenses.\nWere it not for a special one-year assistance fund, we would not have ended\nthe year out of the \"red\". But we did and then we began to face this present\nyear with apprehension. The final blow came when we learned that we would\nneed to find a new publisher at a cost greatly exceeding that which we had\nbeen paying."
}