{
  "id": "d1489-1",
  "text": "-2-\nfor the NCER brought in a preliminary report which was thoroughly discussed and\nformally adopted by the Committee, The Committee authorized the subcommittee to\nbring in a detailed report at a special meeting of the NCER tentatively set for\nMarch 4.\n#\nThe National Committee on Education by Radio, through its Secretary and\nResearch Director, Tracy F. Tyler, has transmitted the following letter to most\neducational stations. Action of the F.C.C. deserves consideration of NAEB members:\n\"The Federal Communications Commission has finally transmitted to the Senate\nits report relative to the allocation of facilities to educational, religious, and\nother nonprofit agencies. The report is essentially a 'straddle'--a device for\nkilling time while the commercial interests become more firmly entrenched. There\nis one section of the report, however, in which you will be particularly interested.\nThe Commission states:\n'There have been protests, particularly by persons interested in the\npreservation of the broadcasting facilities of educational institutions,\nagainst the procedure under which licensees are required to defend their\nassignments in hearings upon applications of other parties. The Commis¬\nsion now proposes that provisions be made to conduct informal, preliminary\nhearings on applications that appear from examination to be antagonistic\nto established stations, to determine whether the application violates\nany provisions of the Communications Act or the rules and regulations of\nthe Commission, or whether or not the applicant is legally, financially\nand technically qualified to contest the use of a radio facility\nwith an existing station* Under such a provision, applications found\ninconsistent with law or regulation and applications of those found not\nqualified to operate stations will be refused without requiring the presence\nof licensees of existing stations at hearings.’\n\"The above paragraph is the response to the Committee's recommendation 'that\nexisting educational public-welfare stations be protected in their present privi¬\nleges.' Now that the Commission’s report is in, it appears that the next fight\nwill occur in the halls of Congress. The Interstate Commerce Committee of the\nSenate has an able chairman in Mr. Wheeler of Montana. It is from that source\nthat progressive legislation will undoubtedly emanate.\"\n#\nT. M. Beaird, Executive Secretary of the N.A.E.B., WNAD, University of Okla¬\nhoma, etc., speaking:\n1, In the Kansas City conference held on September 10 and 11, 1934, it was\nvoted by the delegates assembled that the name of our Association should be changed\nfrom The Association of College and University Broadcasting Stations to the National\nAssociation of Educational Broadcasters. The reason for this change in name was\nthe fact that the member stations voted that we should now include two new classes\nof members, namely: (a) those institutions that are engaged in educational broad¬\ncasting over stations other than those educationally owned, and (b) individuals\nof faculties of recognized institutions who are interested in educational broad¬\ncasting. Many faculty members sponsor regularly organized educational courses and\npresent their material through commercial stations which are located in the towns\nwhere their institutions are located. Therefore, it was the feeling of all dele¬\ngates, as well as all station representatives in the mail ballot taken following\nthe Kansas City meeting, that these co-workers should enjoy the privilege of mem¬\nbership in the.educational broadcasters association, We look forward to having\nmen of this type participate with us again since the constitution has been changed."
}