{
  "id": "d1489-6",
  "text": "\"A bulletin is printed each quarter describing the courses offered, and\ngiving general information concerning the broadcasts. These bulletins will be dis¬\ntributed to any college or university station requesting same from WOSU.\"\n#\nGarland Powell, Director of WRUF at the University of Florida, says:\n\"I f eel that our organization should be more cooperative in sending copies\nof programs to the various university stations. I realize however that there is a\ngreat deal of work to a thing of this kind and it may be that most of the universi¬\nty stations are like WRUF, having little or no money with which to operate. It\nmight be interesting to note that WRUF is now operating on an annual average of 13-g-\nhours a day and using 38 students and four full time men to operate the station,\ngiving us a staff of 42. We take great pride in the fact that seven boys who have\ngraduated from the University of Florida and who worked at the radio station have\ngone into the radio field and secured employment immediately, even in view of the\nfact of the great number of radio men out of employment; so we are contributing in\na small way to the development of radio men.\"\n#\nW. I. Griffith, president of N.A.E.B., Director of WOI in the state of the\ntall corn, reports as follows:\n\"The WOI Book Club is going strong and we have circulated about 26,000 vol¬\numes in the five years in which the club has now been organized. We have approxi¬\nmately 1800 members and find that it is rendering a real service in supplementing\nthe library facilities of our radio friends. This is particularly true to our\nfriends who live on farms and in villages and find it hard to get suitable reading\nmaterial in any other manner.\"\n#\nProfessor Brackett reports for KUSD of Vermillion, S.D., as follows:\n\"As has been done for several past years, KUSD is again broadcasting a series\nof programs featuring humorous readings in the Low German Dialect. Very great\nappreciation is shown by those in our territory who once used this language but in\nmany cases have not heard it spoken for a very long time.\"\n#\nForensic Ted Beaird, Director of the University of Oklahoma station, WNAD,\ntells us about the broadcastings and doings of his station:\n\"We have introduced a new feature over WNAD this year which may be of interest\nto some of the fellows as it has proven quite satisfactory in our work. Each\nThursday promptly at 2:00 p.nu we have a feature for 15 minutes known as the ’man\nwith the traveling mike.’ One of our staff announcers has a portable mike and\n’scouts around' among students, faculty members and others in the student union\nbuilding and presents a series of questions, picking for the particular interviews\nany person who may be near the mike at that time. Various and sundry questions\nare presented by the man with the traveling mike, and you can imagine that he gets\nvarious and sundry answers to these questions. This feature has proven quite novel\nnot only with our student body here but to all our radio audience. We have consid¬\nerable comment on this feature and we can highly recommend it to any of the boys\nin similar work.\n\"Our revised (and may we hope modern) practical landscape garden series pre¬\nsented once each week for the season, is proving of great interest. This is under\nthe auspices of the landscape gardener of the University and his staff. The mater¬\nial he is presenting is proving to be practical, and this is the first time we have\nbeen able to work it out where we felt it was practical to our listeners."
}