{
  "id": "d1489-7",
  "text": "-8-\n\"For the first time in the history of the station, WNAD is sponsoring under\nthe auspices of the Norman Chamber of Commerce, a series of farm group programs.\nOf course this feature is greatly expanded by agricultural stations, but coming\nfrom the state university for the first time, it is proving of great interest to\nour radio audience.\n\"We have some very novel developments in our International Relations group\nprogram which we sponsor regularly over the station. These programs of course are\nunder the supervision of the International Relations group of the University of\nOklahoma. We shall be very happy to give details to a program director over the\ncountry as to the manner in which we have stimulated more interest in this work\nthis season.\n\"Another very popular introduction this year is the Survey of English Litera¬\nture course presented regularly over the station coming under the immediate super¬\nvision of our Department of English of the College of Arts and Sciences. We shall\nbe happy to supply details relative to this course to any interested group.\n\"For the first time we have introduced the WNAD Radio Book Club this season.\nThe plans we use are similar to those perfected by Griffin and his staff at Ames,\nand WOI has been quite helpful to us in introducing this feature to our radio\naudience. To say the least, it will cause state-wide interest in book review, book\nreading, etc.\n'We have presented this season regular feature programs under the auspices of\nthe Oklahoma Educational Association and the State Department of Education of Okla¬\nhoma. These programs have been presented in panel discussions as well as regularly\nrehearsed skits. This feature is a great help to the station as it gives us addi¬\ntional leads among our co-workers in the state in developing other fields of work.\n\"The most novel introduction that we have ever made in our work is a regular\nweekly feature entitled 11nside stuff This is under the immediate supervision\nof the School of Journalism and the State Association of Newspaper lien. Every week\nan outstanding newspaper editor or an individual quite prominent in the field of\njournalism, is brought to the University campus by the School of Journalism, and a\nformal 45-minute address is presented to all the journalism students in joint\nassembly. Immediately following this person is interviewed by some outstanding\npersonality of WNAD. We have a stack of very complimentary comments from the press\nof this state relative to this feature. You can see that it gives the University\nsome valuable contacts among a group of business and professional men who are in a\nposition to mold a great deal of public sentiment.\n#"
}