{
  "id": "d1331-2",
  "text": "FEDERAL RADIO EDUCATION COMMITTEE\nThe first meeting of the Federal Radio Education Committee, on which our Asso¬\nciation is represented by President McCarty, was hold in Yfashington on February 17\nand 18, As you know, the committee was authorized by the Federal Communications\nCommission to:\n1, Eliminate controversy and misunderstanding between groups of educators\nand between the industry and educators,\n2, Promote actual cooperative arrangements between educators and broadcas¬\nters on national, rogional, and local bases*\nOf the 40 members of the committee, the following wore in attendance during the\ntwo day session: (There may have boon two or three others not listed.)\nJohn W* Studobakcr, Chairman\nWaldo Abbott\nJamc s W* Baldwin\nEdgar Bill\nMorse A* Cartwright\nW*W* Charters\nHarry W. Chase\nA.G, Crane\nWalter Damrosch\nMilton S, Eisenhower\nWillard Givens\nFr, George W, Johnson\nLambdin Kay\nJohn F. Killeen\nCline M* Koon\nMrs* B.F, Langworthy\nLuclla S* Laudin\nLenox S. Lohr\nC,S* Marsh\nH. B. McCarty\nEdward R. Murrow\nA.D* Ring\nJohn Shepard III\nLevering Tyson\nJudith C. Waller\nFrederick A* Willis\nWith such diversity of radio experience and opinion among its members, it is\nonly natural that the committee’s approach to its problems should be general and\ndeliberate. For the most part, discussion centered around a number of research\nprojects recommended as necessary background to specific action*\nSome of the projects proposed a survey of successful local commercial radio\nstations, survey of successful radio stations owned by colleges or universities,\nstudy of use of radio by state departments of education, experimentation in the\npresentation and evaluation of broadcasts for school use, fellowships to study\ntechniques of successful broadcasts, job analysis of elements of program building\nand broadcasting, and survey of teacher training courses.\nSo far, no funds are available to finance those studies or others to be decided\nupon, but the committee as a whole felt the need for such research and approved the\ngeneral plan.\nAs usual, and as to be expected perhaps, no agreement was reached on a defini¬\ntion of educational broadcasting. Formulation of such a definition is planned, for\nguidance of the committee in future deliberations. In the course of discussion\nthere was the familiar and no doubt deserved criticism of educators generally that\nthey have been indifferent, lacking in initiative and imagination in the use of\nradio. The committee favored the investigation of successful techniques which have\nboon developed so that such advancements might be more wide-spread.\n(cont. next page)"
}