{
  "id": "d514-1",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nSuite 1119\n1346 Connecticut Avenue, N. W.\nWashington 6, D. C.\nOFFICE OF THE VICE PRESIDENT\nJanuary 31, 1962\nMrs. Marion Corwell, Manager\nEducational Television\nHenry Ford Museum and Greenfield Village\nDearborn, Michigan\nDear Marion:\nSince I handle most of the liaison with the various NAEB committees,\nBill has asked me to reply to your letter of January 25.\nAccording to the \"Definition of Responsibilities of NAEB Committees, \"\n(as revised in February, i960), the following summarizes the respon¬\nsibilities of your committee: \"This committee is charged with general\nPR responsibility; it should remain sensitive to the Association’s\ncurrent PR position and provide,guidance, constructive criticisms and\nsuggestions for the Association's PR operations. This committee\nadvises' the President and Editor on all such matters and is expected\nTo recommend activities ranging from day-to-day\n'range promotional goals.1\n'publicity to long-\nAs you know, this committee has always worked closely with Betty\nMcKenzie on PR activities. I know she would appreciate your help on\nday-to-day publicity-type operations, and we would all appreciate your\ncommittee looking into the matter of long-range promotion and publicity\nin an effort to establish a better national \"image\" of the NAEB and\neducational broadcasting in general.\nThe list of your committee members will appear in the February News¬\nletter which you will probably receive about the same time you receive\nthis letter, so I won't bother repeating them all here.\nWe have appointed this year, for the first time, a Committee on Committees\nto look into the roles the various committees do and should play. After\nthey have examined this question, all committee chairman will be advised\nof any modifications of their role as seen by the administration of the\nAssociation.\nI believe you and Betty worked out the details of adding Robert Montgomery\nto your committee (as an eleventh member) so there should be no problem\non that score."
}