{
  "id": "d514-10",
  "text": "MEMO\nTo: boards, staff, patrons\nand volunteer workers\n38 EAST 57 STREET • NEW YORK CITY • MU 8-6380\nTHE NATIONAL NEWS SERVICE FOR THOSE WHO\nFINANCE, MANAGE AND COMMUNICATE THE ARTS\nOf; museums, orchestras,\ntheatres, opera groups,\ndance companies, arts\ncouncils, festival^)schools\nand other cultur, \"\norganizations.\n% rt3 o\nThose of us close to the cultural scene know thet8t9 ,.t 0 ‘®62\ncontribution that behind-the-scenes management skills can mwk&iQj 4J>\nto artistic success. But we have also seen, too often, ho^ ho -\nhaphazard management, inexpert fund-raising or poor public\"\nrelations can turn cultural achievement into dollars-and-cents\ncatastrophe.\nToday such failures are costlier than ever. Fortunately,\nthey are avoidable. As our arts mature, and public interest in\nthem grows, a body of \"management know-how\" is developing that\ncan help us solve many of our most frustrating problems.\nThere are today highly effective, yet dignified, ways to\nconduct public relations for your institution on a minimal budget.\nFinancial and fund-raising activities can be managed efficiently\nand successfully. Valuable lessons lie in the experiences of\nother cultural institutions, other arts, and even in non-cultural\nactivities.\nArts Management, a unique monthly newsletter, covers all\nthe arts and reaches out beyond them to bring this know-how to\nyou — along with stories and surveys about basic economic and\nsociological trends affecting the arts. In forthcoming issues\nyou will find stimulating, idea-sparking articles like these:\nHOW TO PREDICT ATTENDANCE • RATING A POTENTIAL DONOR •\nREACH-YGUR AUDIEHCE THROUGH FREE RA1H0-T-IME © TAX\nGUIDE FOR CULTURE GIFT GIVERS • HOW EFFECTIVE ARE\nYOUR PRESS RELEASES? • CULTURE AND THE BUSINESS CYCLE#\nBUILDING A MAILING LIST • ADVERTISING AS A SOURCE OF\nREVENUE FOR THE ARTS • WHAT THE ESTATE LAWYER CAN DO\nFOR YOUR INSTITUTION# RENT, BUY OR BUILD?# SALARY\n(over)\nactivity of The Radius Group, Inc."
}