{
  "id": "d514-101",
  "text": "Mr. William 0. Harley\n2\nJuly 24, 1962\nRelations Association) to a member of the NAEB, was to see the\nweakness in NAEB* s public relations endeavors. But I kept my\nmouth shut because I had too such to learn about educational\nbroadcasting to launch into an overhaul of NAHB's PR. I am\nreluctant to say anything even now, partly because PR has noved\non while I have stood still in that field. But while I an still\nin the wood, I will get a fee natters off my chest.\nI shall lay off any suggestions pertaining to PR work at\nthe national level and concern nyself with national help at the\nlocal level.\nThe best thing we do locally is put out a program guide.\nI wish we had more money so that it could be a two-color job\nand so that we could afford to make other improvements but I\nam of the opinion that nothing which we do pays better dividends\nin attracting new listeners. In spite of the inadequacies of\nour own effort, I don't find myself wanting to show my bosses\nexamples of program guides put out by most of the other educa¬\ntional radio stations (with certain notable exceptions) for fear\nthat the keeper of the purse will tell us to cut back further.\nSo what I would like to advocate is a drive to improve\nprogram guides.\nOne of the best things which can be done in this regard is\ntn provide art for the guides which L\nknow our station has never received an 8 x 10 glossy phot\nof the star of an NAEB network show for use in our program guide.\nA. far as I know, w. have never received a piece of art work\nsuitable for reproduction in our prograa guide to promote an NAEB\nprogram series (except for the NAEB sig cut).\nItems of this nature should be part of a promotions kit sent\nwith every series of significance. Few of us have the staff to\ndream up a good Job of PR. But with these helps so that a secre¬\ntary could do the Job, our promotional effort would be lastly\nimproved.\nOn another subject, the first principle of PR is to have\nsomething to sell. The press agent forerunners of the modern PR\nmen were past-masters at the art of creating a news event. The\nprinciple is sound. For us, the best kind of news is the creation\nof an outstanding program for broadcast. Mo aa»unt of yak about\nthe NAKB can take the place of doing something worth yakking about.\nSo I am a nut. But in broadcasting the program is the thing, lot"
}