{
  "id": "d514-11",
  "text": "SCALE SURVEYS • HOW TO WORK WITH YOUR CHAMBER OF COMMERCE #\nTHE CORPORATION AS PATRON • WHAT IS THE RIGHT ADMISSION\nPRICE? • REDUCING OFFICE EXPENSE FREE ADS OUTDOORS 9\nDIVISION OF LABOR ON YOUR BOARD • JOINT FUND RAISING\nMETHODS • CULTURE’S STAKE IN CITY PLANNING # HOW TO\nSURVEY YOUR AUDIENCE • TAPPING ANCILLARY INCOME #\nEach monthly issue of Arts Management is a fountainhead\nof ideas, advice, tips, news and reports, A single suggestion\nadopted (or adapted) from its stimulating, fact-filled pages can\nmake the difference between failure and success for your program,\nA new idea picked up from AM can make entirely new programs\npossible.\nNobody, as far as we know, has ever attempted to provide\n”how-to\" information, and economic and sociological data about\nall the arts — distilled into accurate and usable form for the\nmen and women who make the decisions in cultural enterprises:\nboard members, staff and volunteer leaders.\nTo guide in its interpretation of events, trends and\ntechniques. Arts Management is assembling a distinguished Board\nof Consulting Editors, all leaders in their fields. It will\ninclude, among others, Zelda Fichandler, producing director of\none of the nation’s most important theatre companies. Arena Stage\nof Washington, D.C.; and George Irwin, president of the Quincy\nSociety of Fine Arts, a national arts leader in several disciplines.\nArts Management, as the enclosed issue indicates, is a\nquality production, written specifically for a limited audience.\nA twelve month subscription will cost $25.00. To encourage charter\nsubscribers. Arts Management now offers you or your institution\n(or both) a fifteen month subscription for the same price, if you\nsubscribe by April 1, 1962. Arts Manage rue nt. we believe, will\nmore than repay its cost. A single concrete suggestion from just\none of its issues could well save your institution far more than\nthe cost of the subscription. It could make success possible in\na fund raising effort or financial program that might otherwise\nhave failed. For this service, the price is negligible.\nWe urge you to take advantage of the special charter\nsubscription rates now.\nSincerely,"
}