{
  "id": "d514-121",
  "text": "August 23, 1962\nMrs. Batty .eKaasle\n119 Qragory Hall\nUrbane, Illinois\nDear Bett«.':\nthe material prepared by Henry Mamet for the PR Kit arrived this week\ntod, frankly, I was disappointed. My'idea of the kit is to provide sueclnot\nhelps for even a novice to refer to and use a* guides in preparing releases\nand publicising his station, as well as the HUB. I cannot see the veins\nof using balky .aterlals available to the membership at any time, upon\nrequest. If you think the idee has •■erit, we CiH include a listing of\nprinted aatsrial# available for the asking from headquarters; if not, we\ncan omit it.\nActually, Henry provided very few of the items essential to the kit,\nalthough he ad* so e good suggestions which we can incorporate. As e\nstate sat of purpose for the PR ooi.ittee, which 1 think should be inoluded\nin the kit, 1 don't think we should use the paragraph expressing this\nissued from headquarters because it is too vague. I suggest using the\nstatesent I outlined in my letter to Harold dated August 6 (carbon to you),\nparagraph 3. Henry provides an excellent au nation in his final sentence\nof paragraph 3. Shis aould be added to ay statements.\nI m enclosing Henry's letter so you can refer to it and use any of\nhis suggestions which are adaptable.\nIn Item 5 of my suggestions for the JR Ufa contents (see enclosed\nAnnual Report), perhaps it would be better to just devote one page to whet\nmakes awe - the who? what? why? where* questions that should always be\nanswered in the first paragraph, hew to develop timely naan items, etc. . .\nrather than suggesting hew stations can report te national. Henry's ob¬\nservation is plausible. . . It's possible national weald not be equipped\nto originate items for stations. I do think, though, it would be helpful\nto include u sample uses release so the few (double spaced - originator's\naddress, date of release, etc. . . ) can be fallowed. Some of the low\nbudget stations don't have full time IR people and I'm sure this would\nbe of help. I think we should alee include the paragraph on the top of\np. 2 of agr letter te Harold and suggest stations incorporate it in the\nfinal paragraph of their releases. Use any of Henry's suggestions (p. 3\nof hie letter) that fit in."
}