{
  "id": "d514-122",
  "text": "Mr*. Betty HcKensie\nPage 2\nSince Henry dicta* t offer any help on Item 11 of vy suggested list of\nthings to include, this can be omitted, unless you have a listing which\ncould be used. However, it would be easy to adapt Have Birt’s notarial\n(enclosed) and it night be helpful to the stations to have this to refer\nto in the event they don’t have an established speakers’ bureau and tour\nprogram*\nIn addition to the eleven itaaa Z listed in j report, I think we\nshould add a copy of a brief history of the organisation. The enclosed\ncopy can be reproduced, . • I thin* it covers the subject well, (Please\nreturn - it is the only copy I have and I refer te it often,)\nI also think we should enclose a TV ID slide for use in station breaks,\nwith accompanying copy, as well as copy for .redie proves. I am enclosing\nsuggested copy, is I wrots Harold, 0, of D, is willing to make the slides\nas soon as we receive the go ahead fro- H4E9 headquarters. Whether or not\nwe can afford to invest in the slides, I think we should include the copy\nfor stations to use if they wish,\n1 think we should include a copy of each of our small brochures for\nacquainting new oeabers to the organization, as well as the PR Guide that\nUmor Sulr.er wrote.\nAs to a definition of PR, publicity, and advertising - we can ©wit\nthat, although X think It would bo helpful to have It succinctly stated.\nIf headquarters is interested in the survey questions ( I should think\nthey would be), they might be willing to list a few pertinent questions,\nwhich could be included. If not, we cm omit that item.\nThe item Henry supplied explaining how to aet wp Co; unity Workshop#\ncould be included, • • under the heading of ETV Community Wor shops. Do\nas you thin: bent on this,\n1 m sending all this to you in the hope that production of the Ait\ncan be expedited, I m leaving on vacation and don’t want it stalemated\nwhile I«fi gene, Xeu would have to execute the final production anyway\nand will do your usual excellent job, I know* I think the different items\nin the Ait should be on different colors of paper, if possible, with the\nitems identified by number and title in the upper right hand corner, for\neasy reference. If you think of anything that should be included that I\nhave failed to mention, feel free to add it."
}