{
  "id": "d514-127",
  "text": "September 13, 1962\nMrs. Betty McKeasie\nPublications Editor\nHAEB\n119 Gregory Hell\nUrbana, Illinois\nBeer Betty:\nI hope by now you have received the go-ahead from Harold to have\nthe folders printed for our PR Elf and SPEAKERS' PORTFOLIO.\nIn the hope that I would hear from three individuals who promised\nspeeches many months ago, I have held up the materials $ however, after\nconsiderable prodding I have not received the speeches from Lee Dreyfus,\nJohn Barson, and Floyde Brooker, so am forwarding the speeches I do\nhave . I want to allow you and your people time to accomplish the mimeo¬\ngraphing and assembling of the PORTFOLIO-an exhaustive and time-con¬\nsuming job.\nI did write another note to Floyde Breaker, who promised to supply\nhis remarks by August 1, (carbon enclosed) and if he forwards the material\nsoon, 1*11 send it on to you immediately. It will be fairly brief since\nit was just an analogy comparing STf *s growth with the growth of the\nautomotive industry. I thought it was quite clever and should be in the\nmaterials for possible use by one of our HAKB speakers.\nAlong with the speeches, I m enclosing a rather lengthy one Bill\nHarley used in I960. I selected it rather than Scornia's farewell address\nbecause it gives an excellent survey of the growth of the ET7 movement and\nthe facts can bo referred to by anyone preparing an address on this subject.\nI have made a copy of 80011110*8 address and will also enclose it in case\nyou would like to Include it too.\nAs you well know, I would like to have included a broader range of\nsubjects, but we certainly tried, didn't we? 1 think the speeches we have\nwill be an excellent beginning, and the quotations will be most helpful\nto speech writers. This win give the recipients a departure point and a\nconvenient place to accumulate materials for speeches they prepare in the\nfuture. We should also provide an up-to-date fact sheet giving the latest\ninformation about the HA1B. Perhaps the new publication you prepared this\nsummer could supply that material; if not, a brief mimeographed sheet would\nbe fine."
}