{
  "id": "d514-159",
  "text": "ffM\nAMERICAN ASSOCIATION\n2-401 VIRGINIA AVENUE, N W\nOF UNIVERSITY WOMEN\nWASHINGTON 7, O.C\nNovember 19, 1962\nMrs. Betty McKenxie, Publications Editor\nNational Association of Educational\nBroadcasters\n119 Gregory Hall\nUrbana, Illinois\nDear Betty s\nOn recalling your note, I asked the General Director about\nthe possibility of an NAEB exhibit at the AAUV convention. She\ntold me that a long-standing policy of the Board of Directors\nstipulates that no outside exhibits be displayed at national\nconventions. I an sorry we cannot comply with your request.\nAs to the filler items, I consulted some people at the\nNAEB convention about the availability of all-channel receivers.\nI was referred to the Electronic Industries Association, which\nhas since given me the attached information.\nAlso, I have been invited to a meeting about UHF problems\nwhich Will take place tomorrow night. If I learn anything new,\n1*11 let you know. As of this moment, it doesn’t seem that\nthere is enough specific information to use as the basis of a\nfiller item.\nIncidentally, I might add that I had not suggested any\nfiller items in response to the initial request because all my\nnews about NAEB comes to me through your own publications —\nthe Journal and the Newsletter. It would seem like \"carrying\ncoals to TEwcastle\" tc quote'These iteas back to you. As to\nMiss Cornell*s other requests, I did the best I could (for a\nnon-publicity person) with the radio spots and the brochure.\nIt is unfortunate that some of us who wers appointed to the\ncommittee do not have the skills required. If the nature of\nthe assignments had been explained to us in advance, I am sure\nthat we would gladly have made way for better qualified persons.\nSince my term expires next month, I see no point in resigning\nat this late dats.\nOur Publicity Assistant, Mary Boyette, gave me the enclosed\nmaterial to tend to you. She was pleased that you liked her\nnotes in the General Director's letter."
}