{
  "id": "d514-47",
  "text": "Mrs. Betty McKenzie\nPublications Editor, NAEB\n119 Gregory Hall\nUrbana, Illinois\nDear Betty*\nSince I received no comments from our PR Committee members concerning year spot\nannouncement saluting the HASH, I assume they all agree with me that it sounds fine.\nConcerning the Speakers Guides...I have been attempting to gather speeches on\na variety of subjects from which the recipients could gamer material to adapt for\ntheir own speeches. Or in some eases they could use the speech very much as it is\nwritten, inserting their mm experiences or human interest stories. So far I have\n*TV and Kids** fro© Lee Dreyfus (this is a veiy popular speech which tells the effect\nof television on children and is especially good for PTA use)» \"Airborne Television*,\nfrom John Barson, ah© is coordinator of the program for Wayne State University* \"The\nBole of the lO-’Jatt FK in th© Community\" fro© Jim Meade, who built the m station in\nuse by the Royal Oak High School. (This is a little more academic but for m broad-\ncasters it should have quite a bit of helpful material.) I am enclosing copies of my\nletter to Bill Harley requesting his general speech on Educational Broadcasting, and\nthe letter to Montes Tjaden requesting her speech cm Government Controls. In addition\nto these, I thought it would be a good idea for informational purposes to include Mjinow's\n■Vast Wasteland* speech. I also feel we should have a speech cm \"Careers in Broad¬\ncasting* for us© in universities and high school career days, and possibly erne on the\npro1# and cons of Subscription Television. Do you know of anyone who has prepared\nthese speeches and could give us a copy?\nIn the interest of keeping production costs down, the speeches could be mimeographed.\nIf the budget allows, the title page of each speech could have printed at th© top*\n(with the HAEB symbol) EDUCATIONAL Bi&) ADCASTIMG. . . . .lour topic for today.\nsuggested for us© by members of the National Association of\nEducational Broadcasting\n(THEN THE TITLE OF THE SPEECH) ... (FJK3DGEARifi))\nLength* About 23 minutes\nHo. of words* About 2,300\nTEXT OF SPEECH\nif th© Board feels th© extra trouble is warranted, we could have each speech on a\ndifferent color paper cut to different sizes to allow the title of each speech to be\nvisible when the folder is opened.\nI think the cover of the GUIDE should be printed and a descriptive paragraph\ntelling the objectives of the GUIDE could be included on the flap of the right folder—\nor on a mimeographed insert signed by President Harley."
}