{
  "id": "d514-5",
  "text": "MSB Headquarters\n13^6 Connecticut Avenue, H.W.\nWellington 6, D.C.\nMM1\nTO2 MEB Public Halations Committee\nHRGM: Harold S. Hill\nBATE: February 5, 1962\nShis may reach you before the February Newsletter does, so sane of you may be sur-\npr;tsed to learn that you have been appointed to this committee. of course, some of you\nare carry-over members from last year, since most committee appointments are now\nffiide for a three-year period, four new Chairman is Mrs. Itaion Cornell, Manager,\nEducational television, Henry Ford Mjseum and Greenfield Village, Dearborn, Michigan,\nand I have already exchanged correspondence -with her.\nf?® °Lthe flrst ** 8h0uld like for aw* ccsmaittee to undertake is the consider-\ncion of a new p^otronal brochure for the MEB. I expect that all of you are already\njtaaliar with the present brochures, but I am enclosing copies, in case you aren’t.\nJ1'? JE a general brochure used for may purposes: general promotion,\nto interest potential institutional members, describe our work to outsiders, etc.\nThe dues structure of the MEB is to be found on inserts stuck in the back of this\nbrochure (because of changes in dues sometimes, we felt it best, at the time this bro¬\nchure was printed, not to print the dues structure as a part of the brochure). 02ie\nsmaller brochure is designed primarily to bring in Individual members and, you will\nSli tete 60 ^ as amount of dues> location of Headquarters, and name of\ntit SfiSorSiorernea’ ttey E'W ^ a WiW,er to at J-*\nAlthough we still have literally thousands of these brochures, we believe that a new\none should be designed. We don’t believe this one quite tells the story - and perhaps\none brochure could do both «3obs these two were intended for. She net/ piece should\nprobably be of a size to permit its insertion in a normal business envelope, but should\nstill tell a pretty complete story.\nX have sent this memo to all the members of the committee in the interest of time and\neffort, rather than asking your chairman to do so. Will each of you please give seme\nthought to a new brochure and pass your ideas along to Jfericn ( with a copy of your\nletters to me, please)? She can then pull the various ides.i together, perhaps circulate\nmore ideas or questions among you, and then on that basis prepare a recommendation to\nforward to us.\nAs you know, this committee has always worked with MEB Publications Editor, Mrs. Betty\nMcKenzie, very closely, and we know that you will be able to call upon her for ideas\nand help."
}