{
  "id": "d514-59",
  "text": "April 20, 1962\nMiss Marlon Corwell\nManager, Educational Television\nHenry Ford Museum & Greenfield Village\nDearborn, Michigan\nDear Mariont\nThank you for your letter of April 13. You've obviously given a lot of\ntime and thought to the Speaker’s Portfolio (and I agree wholeheartedly\nthat that's a better name than \"Guide,” even if the latter weren't\ncopying from NAB!). Harold and X spent quite a little time discussing\nIt the other day, and he wanted me to be sure to convey his apprecia¬\ntion, too.\nHe reiterated that we need to stick within the $100 that the Board\nallowed us for these two projects—and with your suggestion re mimeo¬\ngraphing the speeches, etc., I see no reason why this can't be done.\nAnd we can use colored paper to give it a little more interest! ng\nappearance...and also cut to different sixes as you suggest...I think.\nThat can be worked out after the contents are collected and the cover\ndesigned, etc. (I like the layout you suggest for the cover, by the\nway.)\nHarold and I both think the selection of speeches you've made thus far\nsounds good. I have one reservation—the airborne speech. Since the\nNAEB's position on this isn't too clear, this might be one the Board\nmight want us to leave out.\nAs to \"careers in broadcasting” and \"pros and cons of subscription tv\"\nas well as any other topics you think might be Included, I'll be glad\nto put a note in the Newsletter, which might Just bring forth an\noffering or two. Neither o# us could think of any specific ones right\noff the bat. Do you think we should have anything on utilization, to\nbe given before teachers* groups? What about something to do with\nwhat the research in educational broadcasting really shows? I can\nnote such topics as those, and your two suggestions, \"The Unique Role\nof the Educational Broadcast Station\" and \"Teamwork in Public Service\nBroadcasting,\" along with any other you wrHarold or Bill might have...\nand we con see what comas of it. I agree that we shouldn't ask anyone\nto take the time to write a speech for this purpose. It's possible\nthat, with a Newsletter note, someone might go ahead and do so. It's\nsurprising to me how many times busy people do write articles for the\nJournal when they're asked.\nAs to Minow's **vast wasteland\" speech, to be used for information, if\nwe don't have a copy of the entire thing handy, there's a condensation\nin Broadcasting for May 15, 1961, which might even be better."
}