{
  "id": "d514-60",
  "text": "Miss Marion Cornell, Page 2, April 20, 1962\nAs soon as we have final artwork for both the PR kit and the speaker's\nportfolio, plus the speeches, etc., in hand, 1*11 investigate the cost—\nand if we can afford it, under the budget, we'll have the title page\nof the speeches printed as you suggest. There's a possibility—though\n1 fear remote—that It might be almost as cheap for us to have the whole\nthing printed by an outfit in Aim Arbor that does it inexpensively and\nit might be as cheap as mimeographing. I'll look into that, soon as I\nknow more exactly how much copy there*11 be.\n1 agree that probably about 8 speeches—possibly 10 at the maximum-\nshould be enough.\nAs to Roy Flynn's quotes, 1 was under the impression that he was going\nto pull out some quotable quotes (statistics, maybe?) from here and there\nthat had to do with educational broadcasting, which a person giving a\nspeech might use as a starting thought, etc. But I agree with you that\nif he doesn't provide us with any, we needn't be too concerned. The\nspeeches are the main thing.\nHarold asked me how we were planning to distribute these, and 1 told him\nI didn't think we had any special plan. He thought perhaps we could\nannounce their availability in the Newsletter, and just let anyone\ninterested write for them. We might do that and then also mail one\ncopy to each Active member, since station personnel is obviously called\non quite often to give such speeches. What do you think about who\nshould get them?\nTfiou're right that it would save us postage to distribute these at the\nconvention. However, I wonder if some of them might not get lost\nbefore they got \"home. ** I tend to think it would make more of an\nimpression If their availability could be announced at the convention,\nwith perhaps a couple of samples kept on hand to show people.. .and\nthen have them mailed directly to the institution, with a covering\nletter telling about them - and that we hope they'll use them for back¬\nground material, but that we have provided entire speeches so that If\nthey get a last-minute invitation to give a speech, they can actually\nuse one of the speeches as it Is.\nAgain, thanks for all your work on this* I'm beginning to get quite\noptimistic about this project—which I must admit I looked on aa\nsomething of a dud at first!\nSorry you won't be in Columbus, but I hope you have a pleasant time in\nChicago, and I'll see you in Philadelphia if not before.\nSincerely,\n(Mrs.) Betty McKenzie\nPublications Editor\nBMC/dp\ncc: Mr. Harold E. Hill"
}