{
  "id": "d514-62",
  "text": "cci Miss Marlon Corwell\nMr. Harold E. HIU^\nApril 24, 1*62\nMrs. Patricia L. Swenson\nOnager, KBPS (AM)\n346 N. £. 12th Avenue\nPortland 14* Oregon\nThank you eery mesh for your cotmasnts re an HAJSB exhibit at the PTA\nconfer®nee —and for checking with Ralph 3testla to get his promise of\nhelp. I certainly understand the problem you have with understaffing.\nThe schedule you outline sounds fine to m, with Channel 10 personnel\nmanning it am day and m personnel manning it two days* under your\nsupervision* and you cheeking in the evenings to answer queries. And I\nappreciate your offering to train the people In whet to say* etc* I’m\nsending a couple of flyers along to help you in this*\nAs to the exhibit, we will send you a 3-panel exhibit of which each\npanel Is 3 feet tall and l feet wide, making an over-all sire of about 3\nfeet by 6 feet. This fit# very nicely on a table* end setting It up le\nno problem, as it stands by itself when unfolded. Then we HI send you\nvarious give-away materials trtiioh people can pick up to take with them.\nIf you are asked questions which you or your people can#t answer, or\naren’t explained by the literature* the dullest way to handle It, l think,\nwould be to take the person’s name and address and note what he wants* and\nthen send it all to m. I’ll be happy to try to find the answer and write\nto the person direct, if they want to write to us themselves* of course\nyou’re free to give them our address, i’ll send later a list of addresses\netc., which you can keep at the exhibit table for ready reference.\nAlso* if you are willing to take it on, we Hi send you a batch of publica¬\ntions which can be sold right on the spot, some of them at ^-price rates.\nWe will have signs that indicate the price and that It is at a special\nrate...and then all your people have to do is accept the money and give the\nperson his bock.\nI*» writing today to tha hone office of th« PTA to ses if we can bog\nspam for the exhibit...and 1*11 l«t you know juat as soon as I find out.\nMe appreciate your cooperation very *uch.\nCordially,\nBMC/dp\nenclosures\n(Mrs.) Betty MeKensie\nPublications Editor"
}