{
  "id": "d514-92",
  "text": "r\nINDIANA UNIVERSITY\nBLOOMINGTON, INDIANA\nDEPARTMENT OF RADIO AND TELE'\nSION\nJuly 21, 1961\nBUILDING\nMiss Marion Corwell,Manager of Educational Television\nHenry Ford Museum and Greenfield Village\nDearborn, Michigan\nPersonal\nDear Marion:\nFirst let me give you my heartiest congratulations on your fine article\n\"Personalized Public Relations\". It is such a relief to read something\nof this nature done by a pro -who knows what he or she is talking about.\nFurthermore you show a fine sense of showmanship and attention-getting\nin the way you cast your article. To put it another way, I am proud of\nyou.\nNow as to the suggestions you have made for our committee. I am planning\none of these days to submit in dittoed fashion to the committee several\nof the projects that you and two other members of the committee have brought\nup for consideration. So, at the outset, do you object to my referring\nto you as the source of those suggestions ofyoursthat I include?\nI am inclined to agree with you that our action in recommending a full¬\ntime Public Relations Director for the NAEB was hasty. Next time I will\npreside without the benefit of several martinis. I agree that the NAEB\npresident is the prime party for presenting our PR image, and I am going\nto suggest in the mailing that we reconsider this action.\nRelative to your point # 2: what you are referring to are what I always\ncalled \"personal interest stories\", and I believe that our work-horse\nat Urbana, Betty McKenzie, is thoroughly capable of taking care of this.\nIn fact I will write her today suggesting that she do that very thing.\nI agree that we have an important obligation to build a better image be¬\nfore commercial broadcasters. Maybe you and I had better do some deep\nthinking as to how this will be done. Many members of the NAEB and, I\nfear, some members of our PR committee constantly assume an antagonistic\nattitude towards the Industry, and whether we can change this or not re¬\nmains to be seen*-^\nI have an idea which encompasses several of yours which I would like to\nsuggest to you at this time. Are you familiar with the SPEAKERS GUIDE\nsent to all member stations by the NAB? If you are not, let me know at\n%jnoP%U.\nPMj>b m >|btkiPwte."
}