{
  "id": "d514-98",
  "text": "Mrs. Betty McKenzie\nPage 2\nSince Henry didn’t offer say help on I ten* li of ay suggested list of\ntilings to include, this can be omitted, unless you have a listing which\ncould be used. However, it would be easy to adapt Bare Birt's material\n(enclosed) and it might be helpful to the stations to have this to refer\nto in the event they don't have an established speakers1 bureau and tour\nprogram.\nIn addition to the eleven items 1 listed in ay report, I think we\nshould add a copy of a brief history of the organization. The enclosed\ncopy can be reproduced* • • I think it covers the subject well, (Please\nreturn - it is the may copy I have and I refer to it often.)\nI also think we should enclose a T? 335 slide for use in station breaks,\nwith accompanying copy, as well as copy for .radio promos. I am enclosing\nsuggested copy. As I wrote Harold, 0. of D. is willing to make the slides\nas soon as we receive the go ahead frcp MSB headquarters. Whether or not\nwe can afford to invest in the slides, I think we should include the copy\nfor stations to use if they wish.\nI thin*, we should include a copy of each of our small brochures for\nacquainting new members to the organization, as well as the PR Guide that\nElmer Sulzer wrote.\nAs to a definition of PR, publicity, and advertising - we can omit\nthat, although I think It would bo helpful to have It succinctly stated.\nIf headquarters is interested in the survey questions ( I should think\nthey would be), they might be willing to list a few pertinent questions,\nwhich could be included. If not, we can omit that item.\nThe item Henry supplied explaining how to set up Community Workshops\ncould be included. * . under the heading of IT? Community Workshops. Bo\nas you think best on this.\nI «r sending all this to you in the hope that production of the Kit\ncan be expedited. I arc leaving on vacation and don't want it stalemated\nwhile I'm gone. Tou would have to execute the final production anyway\nand will do your usual excellent job, I know. X think the different iteas\nin the Kit should be on different colors of paper, if possible, with the\nitems identified by number mid title in the upper right hand corner, for\neasy reference. If you think of anything that should be included that I\nhave failed to mention, feel free to add it."
}