{
  "id": "d1542-1",
  "text": "-2-\nAuaust 4, 19 64 - American Bar Association meeting in New York holds a major\nsession on Copyright. Attorney Rosenfield, representing Ad Hoc Committee,\nupholds education’s position.\nAugust 5. 1964 - Ad Hoc Committee holds press conference in New York City\nindicating proposed bills are intolerable and that unless substantial revisions\nare made, the Ad Hoc group prefers the present law and will oppose the proposed\nlaw. Statements are presented by Dean Fred Siebert, Chr. NAEB Rights Committee\nand by President Harley, in behalf of educational broadcasters.\nAugust 6, 1964 - Register of Copyrights holds a panel of consultants in New\nYork City to obtain reaction to the Bills. Statements of objection are made by\nRosenfield, Alleinikoff, and Harley.\nSeptember 2, 1964 - Ad Hoc Committee lawyers draft possible revisions of\nCommittee’s proposed amendment.\nSeptember 14, 19 64 - Ad Hoc Committee considers alternative positions proposes\nby lawyers, decides to adhere to its proposed amendment as previously\nmodified.\nSeptember 15. 19 64 - Ad Hoc Committee holds meeting with textbook publishers\ngroup.\nSeptember 22. 19 64 - Representatives from Ad Hoc Committee have private\nconference with the Register to impress upon him and his staff education’s\ngoals and needs in respect to copyright revision.\nThe above represents the barest outline of activities reflecting education’s interest in\nthe Copyright situation. It does not include the numerous speeches, panel discussions,\nand conferences in which the NAEB has participated, nor the almost weekly work\nsessions of the Ad Hoc Committee which have been held during the past few months.\nII. SIGNIFICANCE OF INTRODUCTION OF BILLS FOR COPYRIGHT REVISION\nAt the request of Abraham Kaminstein, Register of Copyrights, identical bills\nproposing revision of the Copyright Law of 1909 were introduced (July 20) by\nRepresentative Emanuel Celler (d-N.Y.) and Senator John L. McClellan\n(D--Ark.), Chairmen respectively of the Rouse Judiciary Committee and the\nSubcommittee on Patents, Trademarks and Copyright of the Senate Judiciary\nCommittee.\nThese bills were introduced for purposes of study and comment; no committee'\nhearings will be held on them during the present session of Congress.\nNevertheless, these bills represent the outcome of nine years’ study by the\nRegister and thus reflect Mr. Kaminstein’s present thinking; consequently,\nexcept for possible modifications, they indicate what is likely to be contained\nin the bills (hereafter referred to as the Bill) to be introduced at the next sessior\nof Congress. This “draft Bill”, therefore, merits most serious attention. It has\nfar-reaching implications for educational broadcasters both as users and\nproducers of copyrighted materials.\n(1) Copies of these bills (HR11947, d.3008) may be obtained by writing the Committees\nor your Congressman."
}