{
  "id": "d1542-8",
  "text": "VI.\n-9-\nTherefore, unless H.R.11947 and S.3008 are substantially amended to\nprovide necessary and suitable protection for education’s rights in the\npublic interest, the Ad Hoc Committee will vigorously oppose enactment\nof these bills and will make ail possible efforts to urge retention of the\npresent law which provides time-tested (albeit inadequate)\nCongressional recognition for non-profit educational uses of copyrighted\nmaterials.\nSOME OF EDUCATION'S CONTENTIONS IN COPYRIGHT LA\\'v REVISION\nEducation represents the major public interest and highest public\nconcern of the nation. The primary objective of conferring copyright,\naccording to the Supreme Court, is “for the public benefit. ^ The ^\npublic interest is served by maximum encouragement of the creators\nin our society together with maximum availability of the fruits of their\n1# Education’s needs require the maximum degree of accessibility to\ncopyrighted materials with minimum restrictions under law.\n1. Historically, education has always been accorded exemptions\nin laws dealing with land grants, taxes, postal rates, distri¬\nbution of surplus property, etc.\n2. Recently Congress passed laws for the special fostering of\neducational television. .\n3. The FCC has recognized the special nature of education s need;.,\nby reserving for education's exclusive use portions of the FM\nand TV spectra.\n3. Education is not a business and should not be lumped with profit¬\nmaking enterprises.\n1. Imposing commercial standards and restrictions upon\neducational use of copyrighted materials would greatly hinder\ntheir use by education and severely handicap the educational\nprocess.\n2. Non-profit use of copyrighted materials by an educational user\nfor a recognized educational purpose is not injurious to the^\ncopyright owner in the market place, but, on the contrary, often\npromotes sales of such materials. This proposed law would:\na. restrict rather than expand the use of copyrighted\nmaterials,\nb. diminish rather than enlarge the provocative exposure\nof works of art.\nc. foster a short-term financial gain for copyright owners\nat the cost of arresting the development of modern\neducational technique and impede the creation and\npromotion of a future market for meritorious works."
}