{
  "id": "d1542-9",
  "text": "-10-\nD. Education is education - whether over a microphone, or camera, or in a\nface-to-face teaching situation. To separate educational broadcasting\nfrom education is wholly incompatible with the realities of modern life.\nE. At a time when education is facing its greatest challenge, it is mani¬\nfestly contrary to the public interest to burden it with handicaps which\nwould restrict its full utilization of modern technology to increase and\nimprove educational productivity.\nF. At a time when the Government is calling upon education as never\nbefore in history to train the young and re-train the adults in our\nsociety, it is absurd to have a particular branch recommend legislation\nto Congress which would impose a crushing handicap upon the whole\neducational process.\nVII. AD HOC COMMITTEE’S SPECIFIC AMENDMENTS TO THE PROPOSED BILL\nConsonant with its previous recommendations, the Ad Hoc Committee\nrecommends that:\nA. the proposed Section 8 of H.R. 11947 and S.3 008 be renumbered as\nSection 8(a), by inserting “(a)” prior to “Notwithstanding” on line\n22 of page 6;\nB. subparagraphs (1) and (2) of Section 8 be deleted entirely, and the\nremaining suoparagraphs be renumbered accordingly; and that\nC. the following new subparagraph “(b)” be added to Section 8:\n“(b) Notwithstanding the provisions of Section 5, recognized non¬\nprofit educational institutions or organizations may use for\nnon-commercial educational purposes:\n(1) non-dramatic opyrighted works, provided that no more\nthan a single copy or recording of such copyrighted works\nis made in the course of such use;\n(2) dramatic copyrighted works if no special admission fee\nis charged to the audience, provided that no more than a\nsingle copy or recording of such copyrighted works is\nmade in the course of such use and then only where the\nperformers are limited to students, faculty, or staff;\n(3) excerpts or quotations from copyrighted works if such\nuses are for illustrative, critical or ancillary educational\npurposes, provided that such excerpts or quotations are\nidentified as to source;\nwhere no such copyrighted material is sold or leased for profit,\nno commercial advertising is included, nor other private gain is\ninvolved."
}