{
  "id": "d1370-2",
  "text": "It should be noted that on the schematic shown there are three controls. One\nof these is labled Ph-R, a second Ph-C and the third Amplitude Control. The first\ntwo are phase adjustments and are separated from the third which changes the amount\nof amplitude boost. For each step of the amplitude control the approximately\ncorrect values of Ph-R and Ph-C are simultaneously connected into the phase corrector\npart of the circuit so that the unit has a reasonable linear overall phase charac¬\nteristic. This leaves the variable Ph-R and Ph-C controls for adding additional\nphase correction of the type to produce an anticipatory transient if needed.\nTo facilitate making system amplitude response measurements, including all\ncomponents of a system as they are normally used in operation, an adapter or\ncoupling unit such as shown in Figure 2 was designed and built to simulate the\nimage orthicon output. It is simply a 1T4 tube having a flash-light cell for a\nheater supply mounted on an old image orthicon tube base. In use, the unit is\nplugged into the socket in the camera in place of the pickup tube and a test signal\napplied to its grid. The plate of the IT4 is connected to pin #7 of the base and\nthus has the identical impedance which the pickup tube uses including all stray\ncapacities due to wiring, etc. The plate to ground capacitance of the 1T4 has to\nbe increased by approximately 5uuf in order to make it similar to an image orthicon\nmultiplier output. A Q-meter is used to measure the total grid-to-ground capacity\nof the first tube in the camera when the image orthicon is in place and then when\nthe simulating unit is connected. The plate-to-ground capacitance of the 1T4 is\nincreased by the difference between the two measurements in order that the high\nfrequency loading effect will be the same in either case. When using the simu¬\nlating unit, with an RCA television camera, the 1B3 high voltage rectifier tube\nis removed from its socket and the bottom side of the 100K ohm isolating resistor\nin the image orthicon output load circuit which normally supplied with 4-1300 V. by\nthe 1B3, is connected to the *285 V. with a short jumper. Screen voltage for the\n1T4 is picked up on pin #10 in the image orthicon socket.\nA frequency run made through a chain of equipment in this manner includes\nthe effect of the RC roll off in the grid circuit of V-2 and its compensation in\nthe grid circuit of V-4 of the camera. Before making such a measurement the chain\nof equipment should be lined up with a good pickup tube in place and the so-called\n,,hi-peaker,f adjustment in the grid circuit of V-4 set for minimum smear or streaking.\nThe input signal level to the 1T4 should be padded down until the video level on\nthe cable connected to the camera output is approximately .25 volts peak to peak\nwith the camera gain control set at mid-position.\nA composite signal is advisable, such as a multi-burst frequency, a sweep or\na window, which might be available from a network standby feed, or generated on\na film chain.\nCopied NAEB Headquarters 2/7/57CSB/dfc"
}