{
  "id": "d1370-6",
  "text": "NAE8 NEWS LETTER..Page 7...............March I, 1945\nDRAMA RANG I NG FROM ^!LDE TO SHAKESPEARE. All OF THE NEWS PROGRAMS, A\nUnited Press wire report edited by the staff of the University paper,\nTag- ...Mt nnesota Daily, which was carried through the school year; and a\nDAILY PROGRAM OF NEW'S INTERPRETATION, DRAWN FROM VARIOUS NEW'S SOURCES,\nCAN BE CLASSIFIED AS GENERAL INTEREST PROGRAMS o ANOTHER BROADCAST OF\nWIDE APPEAL IS THE BOOKSHELFWHICH PRESENTS SHORT STORY READINGS, HALF\nAN HOUR LONG, T»*l CE A WEEK. On A THIRD AFTERNOON THE TIME IS TAKEN BY\nthe Magazine Back v-hich conducts a survey of the current periodicals of\nIMPORTANCE AND PRESENTS INTERESTING MATERIAL IN CONDENSED FORM.\nThose programs designed for specific adult education are: The Music\nAppreciation program, conducted this year for the eighth season; the\nAmerican Literature Series, which included talks by prominent University\nlecturers; the broadcast of classroom lectures in American government;\na series of talks by the faculty of the Business school on the problems\nOF THE ORDINARY BUSINESS MAN; THE UNIVERSITY FARM AND H()ME HOUR, ORI¬\nGINATING ON THE FARM CAMPUS WITH THE ASSISTANCE OF THE FACULTY; AND THE\nBROADCAST OF ALL OF THE CONVOCATION SPEECHES OF THE YEAR, PRESENTED TO\nTHE STUDENT BODY BY SUCH PEOPLE AS ^ARY SLLEN CHASE.\nWell, you can see that Easy is a busy man and I appreciate the time he\nSPENT WITH ME ON A SaTUROAY—HIS BUSIEST DAY. INCIDENTALLY EaSY DOES A\nSWELL 15 MINUTE NEW'S CAST AT l2:l5 WHICH IS TOPS IN THE Twf N ClTIES,\nWHERE THERE IS PLENTY OF COMPETITION FROM TWO 50 KILOWATTERS AND SEVERAL\nOTHER FIVES.\nCHICAGO PTA RADIO CONFERENCE\nThe Illinois Congress of Parents and TeACHers Radio Department and the\nRadio Council - WBEZ will jointly sponsor a one day Radio Conference\nTuesday, April 10 in the studios of the Radio Council and in adjacent\nCONFERENCE ROOM, ROOM 753.\nPrincipals and School Radio Chairmen, as well as radio chairmen of local\nP.T.A. GROUPS, ARE INVITED TO ATTEND THE CONFERENCE.\nTWO CLASS DEMONSTRATIONS IN THE USE OF RADIO WILL BE PRESENTED. At\n10:30 A«M», A TEACHER AND CLASS WILL DEMONSTRATE THE USE OF AN ASSOCIATED\nPress news broadcast over WBEZ; at 2:15 p.m,, the use of SCIENCE STORY¬\nTELLER, HEARD OVER WJJD AND WBS2, WILL BE SHOW'N.\nHAVE YOU RESPONDED TO THE BBC PICKUP FACILITY SURVEY\nHere is a letter received by your editor from Joseph Kenas, Research\nManager of the B3C. nTo oate, eleven responses have been returned to us\nON THE SHORTWAVE PICK-UP INQUIRY. WHILE WE ARE DOING THE JOB, I SHOULD\nLIKE, IF AT ALL POSSIBLE, TO HAVE A COMPLETE RETURN FROM NAEB STATIONS,\nWHICH I PRESUME WOULD MEAN A FOLLOW-UP ON THE ORIGINAL REQUEST. %\nWOULD BE VERY HAPPY TO UNDERTAKE THIS OR TO LEAVE IT TO YOU, WHICHEVER\nYOU FEEL BEST.\nWI SEE THIS PROJECT AS ONE OF MUTUAL VALUE. SHOULD ANYTHING OF GREAT\nIMPORTANCE COME UP, WE COULD QUICKLY INFORM THOSE STATIONS WITH PICK-UP\nEQUIPMENT OF WHAT IS AVAILABLE. WITHOUT THIS INFORMATION, IT IS"
}