{
  "id": "d1733-2",
  "text": "WHY THE EDUCATIONAL RADIO STATION? *\nHarold B. McCarty »\nProgram Director, WHA, Wisconsin State Station\nPresident, National Association of Educational Broadcasters\nWe have already had today two answers to the question\npartially expressed in the title of this talk, Why the Educa¬\ntional Radio Station?\nIn a sense, Mr. Frost gave a negative answer this\nmorning in his ringing rebuke of educators for their failure to\nrealize their opportunity and for the mistake they made in re¬\nlinquishing valuable broadcasting facilities. Then we have had\na second answer, and I believe a loud affirmative one, this af¬\nternoon in this roll call of educational stations, reporting\nrecent achievements of college and university broadcasting\nstations throughout the country.\nTo much of what has been said about the failure of\neducators, I am inclined, in good old prayer-meeting style, to\nsit off in a corner and shout ’’Amen”. But when you indict the\neducators of America because a number of institutions failed to\nretain their radio transmitter licenses, something more needs\nto be said. It’s this: Those early stations were not all edu¬\ncational stations. I repeat, those were not educational stations,\nin the sense of education which means the dissemination of know¬\nledge. Those licenses were, for the most part, requested by\nphysicists and electrical engineers to permit experiment in the\nscience of radio. Their aim was to discover scientific relations,\nnot to disseminate information. They were interested in the\ntechnical aspects of this new instrument, not in its social use¬\nfulness. They secured licenses to explore physical principles,\nnot educational avenues. I say again,(they were not truly\neducational stations.\nLet’s not lose sight of this distinction, for when\nthose scores of colleges and universities, voluntarily or under\nsome pressure, lost their licenses, they had not failed completely.\nMany of them had reached their original objective of scientific\nresearch. The shrinkage in numbers is chargeable, I believe, to\nthe ’’experimental” rather than to the ’’broadcasting” period of\ncollege radio activity. And, instead of cries of ’’shame!” we\nmight properly send up a couple salvos of applause for their\nsuccess.\n*Talk given at the Annual Institute on Education by Radio\nColumbus, Ohio, May 3, 1937."
}