{
  "id": "d1733-5",
  "text": "- 4 -\nLight from unbiased educational agencies, that’s the\nimportant thing. Through the years, experience has taught us\nthat such light and leading, which constitute true education,\nmay be expected to issue most surely out of a center of learn¬\ning or an educational community such as a great university.\nRadio education, likewise, may be expected to emerge most authen¬\ntically from an educational home; and the freedom which radio\neducation requires may be enjoyed only when broadcasting facili¬\nties are controlled and operated by institutions committed to\nteaching and the advancement of learning. Certainly the princi¬\nple of educational freedom cannot be denied. Without this free¬\ndom there can be no advancing education. Consider the dilemma\nof the educator. He is supported by society; he is maintained\nin the nation’s schools by a society that is naturally more or\nless interested in maintaining the status quo. But the research\nmen and teachers in our universities are, by and large, not\nprimarily interested in preserving the status quo. They are in\nthe universities because they are explorers. They are reaching\nout for new truths, new interpretations; and often those new\ntruths.make for change, for instability or insecurity of sections\nof society. Often it happens that university groups introduce\nthe discussion of questions and social measures which are not\nwell received for many years. These measures originate in the\nminds of men of the exploratory type found associated with uni¬\nversities. These minds must be free to pursue their inquiries.\nLikewise, the interpreters who transmit the results of this re¬\nsearch and study must be guaranteed complete freedom to communi¬\ncate with the public mind. Broadcasting provides the most effec¬\ntive medium for this interpretation, and in broadcasting, education¬\nal freedom can be achieved only through facilities controlled by\neducational institutions. Without this control, the educator\nencounters the restraint of business attitudes, the censorship\nof time scarcity and restrictions, and the competition of enter¬\ntainment and sales devices.\nThese are inescapable facts of our human society, and\nour educators are sound asleep if they don’t seek to obtain the\ngreatest possible freedom in the use of this new agency for\ncommunication on questions of human welfare.\nWhy the Educational Radio Station? Secondly, then, to\ninsure perfect freedom for educational communication.\nBut someone still is unconvinced, and he says. \"That\nmay all be true, but let’s be practical about this thing. It\ncosts money to operate a radio station, so why not take advantage\n°f the4-£ree tlme offei,ed by cur commercial friends and let them\ncarry the cost of transmission?’’ Now, that’s a good question.\nAnd criere are practical, working examples of educational broad¬\ncasting based upon.a cordial relationship between certain univer¬\nsities and commercial broadcasting stations. But _ I hone\nyou’ll pardon me if I’m too bold in saying this — but, may I"
}