{
  "id": "d828-19",
  "text": "Types ot Research\nBage 2\nprlnclpae* and genaraXiaationa. Such rcaaareb may proeaad from tiia theoraUcal\nformaUtlona found in tha ralatad fialds, and naad not mcaasarlly origliiata\nMithin faroadcaating Itaalf. Thla typo of reaaarch ia oeaontlaiay intandad to\nproduca naw louwladgo, pnnclpiea, and thaoriaa. It ia tha nawiooa of tha\nknowladga m wduU uiah to atraaa in thia dafinltion and not Ita ganaral valna\nor ap^icabUity to broadcaatlng. It mould, of eooraa, ba «q)oetod that thia\nraaaarch, if maU dona, would prorida a baaia of largo ranga of doeiaiona and\naetlona by odaoational broadeaatera.\ndaaonatration raaoareb wa maan raaaarch for lAicb tha raaulta can ba\nprodlotad with almoat coqcleto cortain^ in adranco and which aorvaa to\natrata to a naw group aomething already wall known to anotbar. Ihle raaaarch\nwthod may waU ba aa elaborate and aound aa would ba trua in baaic reaaareho\nIba aignlfieence of thia form ia not in what it contributaa to the of\nknoiAodgo, but rathor bow it nay help a groi^) raaolaa ita doiibta*\nBy way of aummaxy, the relationahip of tbaae typea of raaaarch to each\nother, aa wall aa to aducatlonal broadeaaUng itaalf ahould ba made clear. It ia\npoaalble that a particular reaaarch procedure comparing Method A with Method B\nia Field X may ba baaic reaaareh, aa wa hava dafiaad it. If the aama raaaarch\nware dona again, with aomawhat different groupa and under aomaidiat different <»a-\nditiona, it could atUl ba regarded aa •baaic\" raaaarch, aince naw knowladga waa\nbeing aataUiahed in both oaaaa. However, after aeveral auidi axploratiena, there\nmay coma a time idian nothing eubatantially new ia added by fbrthar lnvaatlgatl«,\nbut tha Invaatigator may find it neeeaaary to demonatrata again ia order to help\na particular group taka an ia^iortant atap with acme greater degree of confidenca.\nWhile thia latter action la clearly not tha reaponaibiUty of tha reaaardiar la\nhie traditional role, it auggeata that reaaarch, aa it appUea to broadcaatlng at\nthia tine at laaat, can have thia important and addlUonal function."
}