{
  "id": "d828-35",
  "text": "Page Two\nMAY I TAKE A FEW MOMENTS THIS MORNING IN REFRESHING OUR MEMORIES.RECENTLY\nSTANLEY FRANK IrJROTE A PROVOCATIVE ARTICLE ENTITLED TELEVISION'S DESPERATE\nNUMBERS GAME. IN IT HE EXPLAINED TO THE GENERAL PUBLIC SOME OF THE DIFFERENCES\nBETIrJEEN TRENDEX, NEII3EN, AND OTHER RATING SERVICES.-IN COMMENTING ON OVER¬\nALL mOGRm QUALITY HE QUOTED STEVE ALLEN AS SAYING 'W SEEM TO BE A NATION OF\nARTISTIC ILLITERATES.” -—ARTHUR GODFREY ADDED: ‘'WITH THE EXCEPTION OF A FEW\nINTERVIEWS ON SUNDAY AFTERNOON, I NEVER LOOK AT THE DAMN THING.”\nAND wmT DID SOME OF THE ADMINISTRATIVE EXECUTIVES SAY: N.B.C'S ROBERT SARNOFF:-\n”IF WE LISTENED TO THE EGGHEAI^, WE'D BE OUT OF BUSINESS IN SIX MONTHS.”\nC.B.S;*S MERLE JONES WAS EQUALLY GLUM: “CULTURE HOLDS NO BURNING FASCINATION FOR\nMILLIONS OF PEOPLE.”\nA THIRD EXECUTIVE, A.B.C'S LEONARD GOLDENSON:-“IT'S NO ACCIDENT THAT “I LOVE\nLUCY”, \"WYATT EARP”, AND \"DRAGNET” REMAIN FAR AHEAD OF IMITATORS.” “THE\nRATINGS PROVE QUALITY IS NOT INCOMPATIBLE WITH MASS APPEAL.”\nTHE FOURTH ONE WAS MORE ON THE POSITIVE SIDE:-C.B.S'S EXECUTIVE VICE PRESIDENT\nHUBBELL ROBINSON HAD THIS TO SAY: “WHEN RATINGS ARE TRANSLATED IN TERMS OF PEOPLE,\nYOU GET A MORE ENCOURAGING PERSPECTIVE. TI<ffiLVE MILLION PEOPLE SAW R(BEO AND\nJULIET, A TOTAL AUDIENCE SHAKESPEARE NEVER APPROACHED IN HIS LIFETB'ffi.”\nHO^TEVER, I MAY INJECT THAT AS ENCOURAGING AS IT IS TO LOOK AT THE TOTALS HERE-\nIN ROUND NUMBERS, AT THE SAME TIME THAT TWELVE MILLION CITIZENS WERE WATCHING ROMEO\nAND JULIET-mm AN AVERAGE RATING OF li4.5-IT WAS SEVERELY CLOBBERED BY\n“I LOVE LUCY” VTITH A COMMANDING RATING OF 5l.2.\nNOI^T WE ARE m HERE AT TECS SiMINAR TO DISCUSS THE PROGRAM PROBLEMS RELATING TO\nCOMMERCIAL TELEVISION; PERHAPS BEING GUILTY OF OVER GENERALIZATION I MIGHT SAY\nTHAT EDUCATIONAL BROADCASTING-RADIO AND TELEVISION-HAS FAR MORE PROBLEMS\nFACING IT AT THIS TIME THAN THOSE FACING OUR GOOD FRIENDS ON MADISON AVENUE. TOO\nOFTEN WE HAVE THOUGHT WfELLE PREPARING ANNUAL BUDGETS, REVISED BUDGETS, AND TENTATIVE\nFINAL BUDGETS FOR OUR LEGISLATORS-“IT MIGHT BE NICE TO BE BACK IN COMMERCIAL WORK"
}