{
  "id": "d1151-0",
  "text": "Vol. IV, No. 8 DuPont Circle Building, Wishington 36, D.C. May 20, 19&3\nMINOW RESIGNS: HENRY APPOINTED CHAIRMAN\nNewton Minow has announced his resignation as chairman of the FCC, effective\nJune 1. President Kennedy has announced the appointment of E. William Henry as\nchairman to replace Minow. Henry, 34-year-old Memphis attorney was appointed to the\nFCC last September by the President. At the time of his appointment to the\nCommission Henry indicated that he felt there is room for improvement in television\nprogramming and that it is up to the industry to provide it. However, he added that\nthe government should act if the industry doesn*t.\nAsst. Attorney General Lee Loevinger has been appointed by President Kennedy\nto fill the vacancy on the FCC created by the resignation of Minow. Loevinger has\nbeen in charge of the antitrust division of the Justice Dept. Loevinger, an expert\non corporate law, was formerly a lecturer in business law at the University of\nMinnesota.\nSTATUS OF ETV FACILITIES ACT\n'-\nThe Senate-House conference committee on the omnibus 19&3 supplemental\nappropriations bill (which includes funds for the ETV facilities act) has agreed on\na deficiency appropriation of $1,500,000 to implement the ETV bill, and the\nsupplemental appropriations measure is at the White House awaiting signature as this\nis written (May l6).\nThe $1,500,000 agreed to by the conference committee includes $40,000 for\nadministration of the act. This will require a reduction in the size of the proposed\nstaff which, while not necessarily harmful for the balance of fiscal 19^3, will make\nit more difficult to enlarge the staff again to the desired size in the appropriation\nof fiscal 1964.\nThe 1964 appropriation has had hearings before both the House and Senate\ncommittees, and the House committee has reported it out favorably at $5,000,000\n(HEW had requested $7,000,000). The Senate committee has not yet reported, but\nthe general reaction at the time of the hearings was favorable and no difficulty is\nforeseen.\nEDUCATIONAL STATIONS EXEMPT FROM NEW LICENSE FEES\nOn May 8, the FCC announced that a schedule of fees for the filing of\napplications in most of its licensing activities will become effective January 1,\n1964. However, such fees will not apply to noncommercial educational applications\nby tax exempt organizations. Thus, as the NAEB had requested, this exemption applies\nto educational stations whether they operate on reserved or non-reserved frequencies.\nThe fees are expected to bring in about $3.8 million a year which, under law, must be\nturned over to the U.S. Treasury."
}