{
  "id": "d1151-3",
  "text": "NAEB NJS17S LETTER.,,, Oct. 1, 1940.... Page 4\n3, The granting of a permit for the proposed changes in equipment and\noperating assignment of Station KILO will tend toward a fair,, efficient,\nand equitable distribution of radio service«\n3c The operations cf Station KGLO, subject to limitations proposed\nupon signal strength radiated in certain specified directions, will\nnnt cause objectionable interference to reception of any other station\nor stations within service areas contemplated by the Commissions\nallocation plan.\n4, The granting of a permit therefor in accordance with the proposals\nof Mason City Globe Gazette Company in its application and reconstruct¬\nion of Station KGLO to be operated on the frequency of 1370 kilocycles\nwill result in improvement of service to the public and serve public\ninterest better than it would be served by granting renewal licenses\nt6r operation of stations KV*LC and KGCA or either of these stations\non the frequency of 1270 kilocycleec\n5, The service of Station KTJLC could be improved and extended by the\nuse of a looai frequency such as that now assigned to KGLO in lieu of\nthe present f requency assignment of the station.\n6, Public interest, convenience and necessity will be served by the\ngranting of t e application of Mason City Globe Gazette Company,\nsubject to ap >rovaX of an antenna which must be so designed and so\nsituated as t meet the speoifications indicated with respect to field\nstrength 7radi ted in certain directions, and at the same time provide\na minimum fie d intensity of 35/m throughout the business district of\nMason City and a minimum field intensity of 5 mv/m throughout the\nresidential section of the city.\n7, No evidence was offered in support of the application of Charles\nWalter Greenley for a renewal of license for operation of Station\nKGCA and accordingly the application should be denied as in default,\n8, Public interest would not be served by the granting of the applica¬\ntion of Luther College for a renewal of license to operate Station\nKWLC on the frequency of 1379 kilocycles. This finding, however, will\nnot prejudice consideration of an application of this applicant for\nauthority to operate Station KWLC upon another frequency. Upon the\nfiling of such an application appropriate provision will be made for\nthe purpose cf maintaining the continuity of applicant’s service.\nAll parties will have 30 days within which to file exceptions and\nrequest oral argument on the proposed report and exceptions,\nCLEVELAND SOEQCLS TO U5E FM\nThe Cleveland City Board of Education has been granted authority by\nthe Federal Coir rani cat ions Commission to change that school system s\nnon-commercial education radio service from amplitude modulation to\nfrequency modul ition.\nThe specific g3 int involves the education board* s station WBQK shifting"
}