{
  "id": "d1477-2",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nRegion III Meeting Report\nUniversity of Michigan\n22-24 May 1953\nSUMMARY OF RECOMMENDATIONS:\nThe following are the major recommendations arrived at by the Region III con¬\nferees. Further recommendations and details of those presented here will be\nfound in the body of the report.\n1) NAEB Headquarters should begin long-range program planning. Such planning\nshould be based on research findings of what makes a good educational program,\nand the needs and demands of the prospective audiences. Such a ’’Planning Com¬\nmittee” should replace the present \"Network Acceptance Committee.\" It should\nfind the best people and the be t areas for programming, and then commission\nthe programs to be done.\n2) Futures conferences should include at least one session in which small sta¬\ntions and wire-wireless people could assemble to discuss problems unique to their\noperation. Some conferees thought the division could be made on the basis of\nstation power; others, however, felt it should be made on the purpose of the\nstation: i.e., student-training, education, in-school broadcasts.\n3) The Board or Executive Committee of NAEB should formulate a imple three-\nword tag to be used by all NAEB stations. The present \"NAEB\" tag is too cum¬\nbersome for constant use in the station breaks, and is even ungainly at the\nend of Tape Network programs. Since the NAEB Network, informal though it may\nbe, is still a network, there would be an element of promotion and prestige in\nemploying a pertinent tag-line. Suggestion was made for \"E.B.S.—the Educa¬\ntional Broadcasting System.\" Vote of conferees was taken and although \"E.B.S.\"\nwas not especially popular, the vote was overwhelmingly in favor of finding and\nusing some such tag-line.\n4) A national policy should be established in regard to paying participants\n(especially faculty members) for radio appearances. The recommendation arose\nfrom consideration of the educational broadcasting dichotomy in which TV pays\ntalent fees and radio does not. Suggestions were made whereby \"pay\" could be\nmade in prestige advantages. These will be found in the body of the report.\n5) Favorable discussion centered around proposals for a regional Newsletter.\nThis might be prepared within the region and mailed with the national NAEB\nNewsletter.\n6) Suggestions were made for developing the exchanging within the region spe¬\ncial regional-interest programs. An example would be an historical series\nabout the old \"Northwest Territory\" which is geographically similar to NAEB’s\nRegion III.\n7) Headquarters should explore the possibilities of re-instituting the script\nexchange. This might entail a screening of scripts presently on had, discarding\ndeadwood, determining thenesds of the various members for s cripts, etc.\n8) Headquarters should provide continued clarification and legal advice re¬\ngarding copyright laws, and the liabilities of members for broadcasting aid re¬\ncording various types of programs."
}