{
  "id": "d1477-5",
  "text": "-4-\n\"THIS IS YOUR NAEB\"\n22 May — 1:45 p.m.\n'‘Tape Network and Other Services\"-Jin Miles, NAEB Secry.\nMiles presented an illustrated lecture on the resources of NAEB Headqurters.\nThis included the methods of interchanging information, the publications file,\ndisplay boards, and physical operation of the Tape Network.\nHe pointed out that the whole is an expensive operation which is only partially\ncovered by the present assessments of #400 for Class A, #250 for Class B, and\n#150 for Class C stations. When NAEB becomes fully self-supporting, the cost\nwill probably fall into the following brackets:\nClass A—#750-800\nClass B-#450-500\nClass C-#250-300\nQUESTION: Can we get prints of the map of educational stations in the nation?\n(Lardie)\nANSWER: This is under consideration. (Miles)\nCOMMENT: This slide-presentation itself would make a good TV program.\nANSWER: See Schooley. He may lend it to you. (Miles)\nQUESTION: Do you have any p}.an for a TV film service operating similar to the\nTape Network?\nANSWER: The Fund for Adult Education is establishing a Radio and TV program\nCenter in Chicago designed to accomplish this end. It's future relationship with\nNAEB proper, remains to be determined.\nCOMMENT: (Complaint that some shows from Tape Network have not been fully\nwiped before dubbing so that there is a certain amount of crosstalk coming through\non the tapes.)\nANSWER: Whenever you have a complaint on tape quality let us know immediately.\nSend back the bad tape so the engineers at Headquarters can have a chance to\nexamine it. (Miles)\nQUESTION: W hat are the necessary steps to submit a program to the NAEB Netwoik ?\nANSWER: Submit a sample program plus an outline of the series to Headquarters.\nThe Acceptance Committee consequently reviews the decision of Hdq. (Abbot)\nQUESTION: We are a wired-wireless station. What can we get from NAEB and how\nmuch will it cost? We operate 24 hours a week.\nANSWER: The Tape Network is established to serve \"licensed radio stations\"only.\nWe cannot service you via the network because you are not a licensed station.\nQUESTION: We are a University-owned, but student-operated station. We could\nuse the network for 6-8 months of the year only. Can we get a knockdown on the\nprice?\nANSWER: No. The general operating costs make it impossible to make exceptions\nof this nature. The network must operate 12 months a year. (Schooley)\nQUESTION: Can commercial stations use NAEB programs? (Schooley, SIC)\nANSWER: Permission for commercial stations to broadcast an NAEB program must come\nfrom the institution which originated the program. We prefer that the intended\nuser contact the originator direct. NAEB does not want to get involved in this\nat the present time. (Schooley, SIC)"
}