{
  "id": "d1101-1",
  "text": "IT—A— Sr-13 SALUTES hOUISI.AIA STATE UlTIYERSITY1 S UE” STATIOIT, ULSU-EM\nLouisiana Stated LTjSU-FH Joins the U-A-E-3 Parade\nStation ULSU-FM greeted the 1947 Tuletide season with a new FM station opera¬\nting on 91,7 megacycles. Housed in one of the most modern studio and transmitter\n\"buildings in the United States, ULSU-FA now takes its place with other non-commer¬\ncial, educational, and public service stations of such institutions as Ohio State\nUniversity, the University of Uisconsin, the University of Illinois, Purdue Univer¬\nsity, and the University of Michigan,\nBroadcast Testing Began October 16\nStation FLSU-FH commenced testing operations last October, officially taking\nthe air during the recent holiday season. Currently transmission is from a 90\nfoot tower; meanwhile construction is progressing on a 400 foot guyed supporting\nstructure for the FM antenna. Already, however, from the 90 foot radiation point,\nreports are being received from points as far away as Hew Orleans. A much great¬\ner coverage is expected from the 400 foot mast.\n| .~ ... -...\nj Congratulations to Ralph Steetle\nThe national Association of Educational Broadcasters offers\nits special congratulations to ULSU-FH’s director, Ralph Steetle,\nfor sound results from sound planning, and a good job well done.\nSteetle, who is director of H-A-E-3 Region V, points out that\n*TjSU-F, licensed to the LSU Board cf supervisors and operated\nby the General Extension Division, is in the truest sense of the\nword . an ”all-university station,11 and an \"all-state station.”\nT!LSU-FM, a charter member of the Louisiana Association of Broad¬\ncasters, is committed to the development of public-interest pro- j\ngrams, and experimentation in the techniques of presentation.\nThus it is not in competition with commercial radio stations from j\nthe programs it develops and the effective techniques it discovers\nwill be available to all stations in the state.\nULSU-FH is committed to a sound Radio Vorkshop training program j\nandbelieves the training and experience gained by qualified\nstudents from the stations operations is a valuable by-product,\ni\n”Radio,” Steetle believes, ”can be an emotional force in the\ncreation of desirable attitudes. Radio can add authority.\nThrough its space conquering nature, radio can emphasize the\ntruth in the phrase, ’’one world.” ;\nULSU-FH Facilities Ranked High in United States\nThe LSU studios and transmitter are housed in a special building on Dalrymple\nDrive in Baton Rouge, Louisiana. Here are a transmitter room, workshop, office,\ntwo studios, an announcer’s booth and control room for daily operation. The set¬\nup is said to be one of the most perfectly built low-cost radio stations in the U.S.\nAuxiliary ULSU-FH studios are maintained in the Music and Dramatic Arts\nBuilding and the LSU campus, connected to the transmitter building by high-\nfidelity telephone lines. Additional studios are planned to the Band Hall.."
}