{
  "id": "d1101-10",
  "text": "-11-\nm station applications largely urban to date — station totals\nPCC’s annual report to Congress reported 75)t» of PM. applications are for\nstations in metropolitan areas. May, 1947, saw applications for class B stations\noutnumbering those for class 4 by almost 6 to 1, (The higher-powered B stations\nare primarily for metropolitan service). Seventy-five percent of applications\nwere from standard broadcast stations while one-third were from newspapers. The\nJCC indicated no concern about tne situation; its feeling is that M channels\npermit so many more stations there is little danger of present-day AM interests\nmonopolizing ill.\nThis end of the year (May, 1947) report showed 1,795 stations licensed,\nor authorized, and 918 PM grants,\n\"X^-ST CALL\" POR ENTRIES IN OHIO' INSTITUTE PROGRAM EXHIBIT\nPurpose of this annual recording exhibition is to further the broadcasting\nof significant educational radio programs in the U»S. and Ohnada by calling atten¬\ntion to outstanding programs in four groupings—national networks, regional\nnetworks and dear-channel stations, local stations and organizations preparing\ntranscribed shows for individual stations.\nDr. I. Keith Tyler, Director, Institute for Education by Radio,\nmeeting April 30-May 3 in Columbus, reports entries for the Twelfth ;\nAmerican Exhibition of Educational Radio Programs will close ;\nFebruary I.___ ____________ _ !\nComplete details on how to enter a prof.ram in this exhibition^ precise nature\no_f classification, entry forms, etc,, may be obtained by addressing the Institute^\nSENATE POxtEIGN ABLATIONS COMMITTEE OKAYS \"VOICE OP AM.c;RICa»,\na bill giving the State Department permanent authority for its much disputed\n\"Voice of America\" was approved by the Senate Poreign Eolations. Committee. It\nwill now be submitted to the Senate, according to Senator n, ALexander Smith\nof New Jersey, who sponsored the measure.\nAdministration quarters report Secretary of State Marshall has selected\nGeorge Allen, U, S. Ambassador to Iran, to take over the program. lie will hold\nthe post of .assistant Secretary of foreign Affairs. This post has been vacant\nsince William Benton resigned last October to return to private business. Allen,\nit is said, plans to return early in February from Iran to the United States.\nThe bill’s backer, Senator Smith said, he hoped the bill would be enacted\nin time to correct what he called the \"current misstatements of some nations,\nmainly Russia\", about the long-range Marshall plan for European recovery.\nN-A-E-B Shortwave Station WRUL. (New York & Boston) is seeking locally\noriginated, transcribed programs which give a true picture of American cul¬\nture, educational and daily activities of people in the United States.\nOther member stations are urged to contact WRUL’s New York Offices for\nmore information about this overseas program project."
}