{
  "id": "d1101-13",
  "text": "-14-\nUOI INCREASES EilPHASIS OH FOOD PRODUCTION\nry\nStation UOI, non-commercial public service outlet of Iowa State College\nServes a rural and small-torn audience ■numbering 189,000 radio families accord-.\ning to Broadcast Measurement Bureau, programs aimed at increasing Io^a food\nproduction goals have been implemented by farm editor, Bale Williams and Market\nHews Editor, R. C, Bentley, for the 1948 winter and spring program schedule.\nMindful of Sir John Orr1s (Pood and Agricultural Organization) report issued\nChristmas Bay, a more complete market news program which reports buying, selling,\nand production activity throughout the day has been put into effect.\nThe PAO report said world food production will have to be doubled or man¬\nkind will suffer dire calamities in the next 25 years. The United States is\nproviding a necessary stop-gap for the immediate present, but the future depends\non total world food production.\nN-A-E-B station managers interested in obtaining details\nof UOHs Market Hews Service which involves the IJSDA\nleased wire, Western Union, AP & UP, and two TUX facilities,\nmay obtain schedules by addressing R. C. Bentley, Station \"T0I,\nAmes, Iowa.\n\\_______\nUUITED HATIOHS SHORTWAVE STATION\nThe United Nations at Lake Success has established an amateur radio station\nwith the call letters K2TJN—meaning \"come to the United Nations,rl Operations\nwill begin February 15 and the United Nations staff members who are licensed\namateurs will be able to broadcast to their families and friends as well as the\n100,000 radio '’hams\" in countries throughout the world,\nALABAMA APPEAL FOR \"PAIR SHARE\" OP CLEAR CHATTELS\nGovernor James E. Folsom of Alabama sent letters to the governors of 10\nother southern states, asking their intervention with the PCC for a \"fair\nshare\" of the high-powered radio channels for the South. Included with the\nletter was a copy of the statement submitted by him to the FCC during the\nrecent Clear Channel hearings,\nN-A-E-B members will recall their own testimony submitted to the PCC\nOctober 30 and 31, pointing out the unique program service rendered by 9 of\nthe N-A-E-B member stations and the limitation on the services they are able\nto render listeners under the present clear channel rulings,\nH-A-E-B stations in Hew York, Minnesota, Oklahoma, Ohio, Michigan and Iowa,\nnow operating daylight only on clear channel frequencies, sought permission to\ncontinue broadcasting after sundown,\nHOOPER TO OFFER POLL OH RURAL LISTENERS\nC. E. Hooper of the radio research firm told the Des Moines Advertising\nClub last month that he hoped soon to provide an accurate means of measuring\nrural audiences. The method is said to be perfected, and according to Hooper\nwould enable measurement of network station1s audiences outside the 80-odd\ncity areas now covered by the Hooper coincidental telephone survey.\nAnnouncement of the new plan was regarded as significant in view of Hooper\ncriticisms and many proponents of the new Nielsen audiometer research system.'"
}