{
  "id": "d1454-0",
  "text": "NAEB NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nFrank £. Schoouey, Ed8Tor> Station WILL, Urbana, III,\nApril I, 1944\nNAEB TO MEET IN COLUMBUS, MAY 7\nNAEB WILL MEET IN CoLUMBUS AT 12 NOON, SuNOAY, MaV 7.\nThat period has been set aside by NAEB orncERS after consultation with\nKeith Tyler and Wib Petteqrew of Ohio State. The time seemed to be the\nbest available for qivinq every member a chance to be present. The\nCHANGE FROM A SATURDAY NIGHT MEETING WAS MADE BECAUSE SOME MEMBERS FELT\nWE SHOULD NOT BE MISSING SOME OF THE OTHER SESSIONS. OFFICERS FELT THAT\nUNDER PRESENT CONDITIONS IT WOULD NOT BE ADVISABLE TO CALL A MEETING OF\nNAEB EITHER BEFORE OR AFTER THE INSTITUTE.\nSetter make your arrangements now and plan to be there!\nW 0 S U ANNOUNCES SPRING COURSES\nOpportunities for Ohio people to ’’attend® college by radio have been\nannounced by Ohio State University. Spring quarter courses to be\nbroadcast over the university STATION, WOSU, INCLUDE “A SuRVEY OF PlANO\nLiterature®, daily at 10 a.m.; Spanish, daily at 10:30 a.m.; Russian,\nDAILY at II A.M.B \"The Human Quality of Literature®, daily at I p.m.;\nElementary Economics, daily at 3:30 p.m«; French, Wednesday and Friday\nat 4 P.M.; ^Problems of Peace and Post-War Planning®, Tuesdays at 4 p.m.\nEnrollment is free, and course outlines may be obtained by writing to\nW 0 S U at Ohio State University in Columbus.\n®SCIENCE DAY® ON W 0 I\nProfessor W, I. Griffith, Director of WOI and NAEB Treasurer, writes\nfrom the Iowa State campus: ”For a good many years on this campus we\nHELD WHAT WAS KNOWN AS ®SCBENC£ Gay\". LaST YEAR THIS HAD TO BE ABANDONED\nFOR THE REASON THAT THE HIGH SCHOOL PUPILS THAT USED TO COME TO THE CAMPUS\nON A GIVEN Saturday, could not get here on account of gas and rubber\nRESTRICTIONS, SO WE OECHOEO TO CONTINUE THE FEATURE BY RADIO, ONLY EXTEND*-\nINQ IT OVER SEVERAL DAYS RATHER THAN A PHYSICAL APPEARANCE OF PUPILS IN\nONE DAY. The success was such THAT WE DECIDED TO REPEAT IT.”\nAn announcement of the series says: ”As spring approaches, hundreds of\nHIGH SCHOOL BOYS AND GIRLS AND THEIR PARENTS THINK OF SCIENCE DaY AT\nIowa State College. This year, as last, the Sciencf. Day Committee decided\nTO PRESENT THIS ANNUAL EVEN BY RADIO. EvERY TUESDAY, WEDNESDAY, AND\nThursday afternoon from 2:30 to 2:45 beginning on April 4 and ending\nApril 27, scme of the highlights of Science in c-veryday Life will be\nPRESENTED FROM RaOIO StaTION WOI. NoT ONLY WILL THERE BE DISCUSSION OF\nTHE latest developments «N SCIENCE, BUT THE BOYS AND GIRLS WILL BE AFFORDED\nAN opportunity TO PARTICIPATE BN SEVERAL CONTESTS AND COMPEITI0N8,\""
}