{
  "id": "d1454-2",
  "text": "NAEB NEWS LETTER\nPaQE 3\noApRj L“ i'944\nPRODUCED, AND DIRECTED BY THE CITY STUDENTS AND FACULTY MEM8ERS OF THE\nBoard of Education, are designed to serve as an addition to the regular\nPUBLIC school CURRICULUMo ORIGINATING FROM BROOKLYN TECHNICAL HiGH\nSchool, the programs are broadcast over WNYC and heard in all radio-\nequipped PUBLIC SCHOOLS IN THE CITY,\nP^OLKS WH0*VE been DIALING WNYC, NeW YoRK * S MUNICIPAL STATION THESE PAST\nFEW WEEKS have BEEN HEARING SOMETHING NEW ON THEIR CITY AIRWAVES IN THE\nFORM OF TRANSCRIBED SPOT ANNOUNCEMENTS THAT SELL, NOT SOAP, NOT FURS NOR\ncandy-bars but such intangible products AS TOLERANCE AND DEMOCRACY,\nJust a month ago, WNYC Director M. S. Nqvik, writers Jack Goodman, Mitchell\nJablons, and-dramatic director Nathan Rudich weighed advantages and dis¬\nadvantages OF the commercial ’*transcribed spots” techniques, and decided\nTO experiment with the form. The resulting 30 second and one-minute\nspots have now become an accepted part of WNYC POLICY AND PROGRAMMING,\nTen spots calling on New Yorkers to be tolerant of the rights of others,\nto beware of bigotry, and to instill democracy in their children have been\ncompleted and are now being aired several times daily.\nIncidentally, here is a brief item about WNYC that the AP carried on\nMarch 27: ”Some fifty public school students visited New York's\nMunicipal radio station—WNYC—this morning to hear a lecture on ’’Civic\nsafety.” But before the lecture was finished, the students left in \\\nhurry—because of a fire in the station's air conditioning unit. Station\nprograms were not interrupted.”\nJOE maooy testifies\nJoseph Maddy, University of Michigan and President of the National Music\nC*MP, appeared before the Senate Interstate Commerce subcommittee on\nMarch 20 to protest the ban on broadcasts by the Camp orchestra imposed\nby the AFM President, James G„ Petrillo. Maooy told the subcommittee\nthat he appeared because he believes it is the duty of Congress ”to see\nto it that private interests shall not monopolize the great new facility\nTO the exclusion of its use for the public welfare in the field of music\nEOUCATIONo”\nEDUCATIONAL PROGRAM DIRECTOR WANTED\nMax Krone, Director of Radio, University of Southern California, Los\nAngeles, writes: ”We are making plans for the establishment of our\nown educational radio station on the campus, and would like to find the\nRIGHT person for PROGRAM DIRECTOR, SOMEONE WHO IS TRAINED AND EXPERIENCED\nIN THE FIELD OF ScRIPT WRITING AND PRODUCTION, AND WHO IS FAMILIAR WITH\nTHE FIELD OF EDUCATIONAL BROADCAST INQ.”\nInterested parties may write direct to Director Krone,\nSTATE GOVERNMENT CLASS ON W N A D\nPresenting a course in Oklahoma government for the first time by air,\nGovernment 130 will be broadcast from 11:16 to 12 a.m. each Monday,\nWednesday and Friday as a regular classroom lecture series, Miss\nHawk, wnad station director, has announced.\nHe V. Thornton, professor of government, will conduct the informal lecture\nCLASS WHICH WILL BE HELD IN ONE OF THE STUDIOS OF WNAD. StUOENTS WILL BE\nALLOWED to PARTICIPATE IN OPEN DISCUSSION, MsSS HaWK SAID,"
}