{
  "id": "d1404-14",
  "text": "-8-\n(2) ’’Since the first general reallocation of wave channels by the Federal Radio Com¬\nmission we of KUSD have been associated in time division with TfllL and commercial\nstation KFi'IF. The relations of all three stations in this matter have been thorough¬\nly ideal. All the managers have been honest and ooen in their mutual dealings with\none another; and each one has tried to be fair and considerate of the interests of\nthe other two stations. From our own experiences we cannot see why there should be\nany friction of any kind between stations associated as our three stations are.\n’’However, we know that there has been trouble and that differences hard to adjust\nhove arisen. I think the F. R. C. has been trying sincerely to find a way to minimize\nthe difficulties that they have had to adjust for some of the time-sharing stations.\n' letter written to the commercial station in o^r time-sharing group confirms this\noninion.\n\"In trying to work out some rules to cover these time-sharine- adjustments, as in many\nother things, the Commission either overlooks or does not understand the unusual con¬\nditions that surround the college or university stations. It probably does not realize\nhow many broadcasts, important to us and to our listeners, are dated bv persona who\nhave no connection with the station. These dates are often fixed not lone- in advance\nby persona who are in no way responsible to the station or the school owning the sta-\ntion wishing to broadcast the event; and in some oases the date has to be changed\nalmost at the time when the broadc st was to begin. Think of a basketball game when\nthe visiting team fails to make connections somewhere on its trip, or of a football\nteam that is ordered into Quarantine the day before the game on account of an epidemic\nthat has developed suddenly and unexpectedly. V«e had a football game postponed for\nabout a month in what was practically that way last year.\n”It seems probable to me that if the actual facts can be eresented to the F. R. C.\nsome way will be arranged to cover such emergency cases that cannot ^e adjusted any\nconsidera.ble length of time in advance* it least, I think it worth trying.\n\"As to forcing a station into an expensive hearing over time-division, when no\nviolation of the rules or general orders is involved, that is criminal, whether it\nis covered by law or not. The station that will do this is too mean to be respected\nby honest people and the Commission should find some means to prevent it. Professor\nJensen’s remedy seems to me a good one.”\nIt is quite encouraging indeed to note the active interest being displayed bv many\nof our members in the past few weeks. Many important problems are now before your\n/ssociation. Give us one hour of your time each week for the next eiaht weeks and\nconditions will be better. Mrite us your reactions relative to the many pending\nproblems. VOICE YOUR SENTIMENTS. THE ASSOCI/TION IS DESIGNED TO SERVE ITS * EMBER-\nSHIP AND NOT TO DICTATE POLICIES. MAY ME HEAR FROM YOU /T ONCE.\nSincerely yours.\nIff! g OOX/J\nT. W, Beaird, \"Executive Secretary\nfor Association"
}