{
  "id": "d1404-4",
  "text": "•5.\nUniversity chimes are located in the tower of the Law Building. One microphone\nwas plaoed there. The organ used is located in Smith Memorial Music Hall and one\nmike was placed there. These two points are about five blocks apart and the sta¬\ntion is four blocks from the Law Building# The announcer remained in the studio at\nthe station. The organist wore ear phones and followed the progress of the chimes\nby that means# It went over very well and we are making it a regular Saturday after*\nnoon feature during the next few weeks#\n\"A program new to us, but not to many other stations, was started this fall and\nhad to do with the Parent-Teaoher group# The programs are supervised by a local\nP.T.A. organization which is responsible for music, talks, etc.\n\"To the station, the only new equipment added during the summer is an RCA\ncathode ray indicator. We have also built a new four-channel remote control pick\nup. This was designed and built by W. £• Phillips, our engineer. WILL is on the\nair thirty-one hours weekly at the present time# In addition to the two studios\nin the main radio building we have two studios in Lincoln Hall, three in Smith\nMusic Building, one in the Band Building, and all together, twenty—seven pick up\npoints where we can pick up a broadcast on a notice of an hour or two#\"\n#\nFrom KFJM, University of North Dakota, Prof. Jenkins writes *\n\"We have just completed a new broadcasting studio in one of the University\nbuildings.\n\"We have made arrangements with a number of high schools to have the pupils\nlisten to a daily program consisting of fifteen-minute talks on Athletics, Science,\nLanguages, Music, Education, Health, Vocations, etc. Responsibility for these pro¬\ngrams rests with a committee of five undergraduates who must secure the speakers and\nsupervise the broadcast. These innovations are planned to interest high-school\npupils and university students in educational broadcasts.\n\"We also have other periods of broadcast with music, and talks by faculty\nmembers on a variety of topics.\"\nAn interesting letter from Major Powell, Director of WRUF, University of Florida,\ntells of two cases in which WRUF played an important role. The first concerned an\nairplane lost in the swampy section of Florida. Information relayed to the coast\nguard as a result of WRUF announcements resulted in the location of the plane within\na few miles radius. The second told of valuable help in handling relief messages\nby short wave radio during the reoent storm in South Florida. Staff members from\nWRUF took short wave equipment into the storm area and maintained communication\nuntil lines could be installed.\nHarold McCollum, who is caring for the work of WPA Beaird at WNAD, University\nof Oklahoma, says:\no"
}