{
  "id": "d1404-9",
  "text": "-5- '\n'•If any member station of the Association of College and University Broadcasting Sta¬\ntions has not received the Iowa State College Publication, Volume XXX, No. 7, Bulletin\n105, entitled \"The Location and Elimination of Radio Interference\" by J. K. McNeely,\nmay I suggest that you get in touch with Iowa State College at once and secure the\nbulletin. Valuable information is included in this publication covering methods of\nlocating radio interference, methods of eliminating radio interference, interference\ncaused by Summation frequencies of broadcast stations, etc.\nBelow vie are quoting a carbon of a letter addressed to Professor R. C. Higgy of Ohio\nState University, President of the Association, by Dr. Charles A. Culver, Professor\nof Physics, and Director of Broadcasting, Carleton College, Northfield, Minnesota:\n\"We are in receipt, through the office of our Executive Secretary, Mr. Beaird, of\nseveral copies of the radio play, ’An Ohio Enoch. Arden.’ We desire to thank vou very\nmuch for this dramatic material. I have passed it on to the professor who has charge\nof our radio dramatic productions, and I am sure that he will be glad to use the\nmaterial. We will advise you with regard to the reactions which we receive as a re¬\nsult of our presentation of this play on the air.\n\"I am very sorry that we do not have any similar material, at the present time, to send\nin exchange. However, one of our professors in the English Department has considerable\nability, and it is possible that we may be able to reciprocate in the near future.\nProfessor Hunter, to whom I have just referred, has written two or three short plays\nwhich we have put on the air with very satisfactory results. One of them at least is\nsuitable for production at any time and place. Unfortunately, however, from the stand¬\npoint of rad'o broadcasting, the play has been copyrighted and sold. Nevertheless,\nI am getting in touch with Mr. Hunter in an effort to learn what arrangements can be\nmade with the publishers for its use by educational stations. Personally I felt that\nthe play was an excellent piece of work and particularly suited for radio presentation.\nI will advise you as soon as I secure further information in this connection.\n’’The exchange of program material is, I believe, a service which we should work up\namong our member stations. I have had in mind for some time a desire to work up a\nweekly news bulletin of scientific events, along somewhat different lines from that\nsent out by the Science Service Office. Thus far, I have not had time to do anything\nwith such a project. It has occurred to me that possibly each one of our member sta¬\ntions could work up some particular feature which could be distributed among our member\nship, and thus the burden would not be great on any one station.\n\"It has also occurred to re that it might be well to consider the possibility of the\nAssociation subscribing to one of the leading news-gathering ogranizations with the\nthought of establishing a central short-wa.ve station from which we could relay this\nmaterial to our member stations. The writer would be interested to learn your reac¬\ntions in this connection. I am sending a copy of this letter to Secretory Beaird,\nand also to the Washington office.\"\nFROM MR. GEORGE R. FAINT, PROGRAM DIRECTOR, STATION WJBU, BUCKNELL UNIVERSITY,\nLEWISBURG, PENNSYLVANIA! \"I have appreciated the bulletins you have sent me from\ntime to time. The fact that I have not written you before does not indicate that I\nam not interested in the problems concerning radio stations, but is due to the pres¬\nsure of work at the University.\n\"We appreciated the receipt of the mimeographed copies of ’An Ohio Enoch Arden.’ In\nfact it has enabled me to revive interest in studio productions in one of our dramatic\norganizations on the campus, and I am expecting them to organize a group of students\nto present plays over our station.\n\"As is the case -with practically all of the college stations, we are in need of funds\nand are hoping to get them.\""
}