{
  "id": "d1233-0",
  "text": "A E B\nr'\nr\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 28, NO. 4\nAPRIL, 1963\nNAEB Membership Rises 36%\nDuring the last six months, Individual Membership in the\nNAEB has risen almost 36%. On March 13, the number of\nIndividual Members stood at 1,217, an increase of 321 over\nthe September 15 figure of 896.\nMarch Busy Month for NAEB\nMarch saw two regional meetings of NAEBers, plus a meet¬\ning of NAEB officials and ETV station managers in con¬\nnection with the affiliates’ meeting of the NETRC in New\nYork on March 19. The latter was set up with the coopera¬\ntion of the NETRC and its affiliates committee, as a follow¬\nup to recommendations at the Philadelphia NAEB conven¬\ntion that such a session be arranged.\nAs we go to press, some 200 delegates are expected to at¬\ntend the Region II meet in Tampa March 29-30. This will be\nreported in the next Newsletter. The Region III meeting is\nreported elsewhere in this issue.\nBrown Heads Industry Relations Committee\nW. S. Brown, AT&T product marketing supervisor, has been\nnamed chairman of the NAEB Industry Relations Committee.\nJohn Wentworth, manager of educational electronics for RCA,\nwill fill Brown’s unexpired term on the committee. Former\ncommittee chairman L. L. Lewis has resigned from RCA to\nestablish his own consulting firm.\nWho Are Individual Members of NAEB?\nAn informal survey of occupations of the 1,085 Individual\nMembers on January 22, 1963, indicated a heterogeneous mem¬\nbership, with the largest group comprising only 25 per cent\nof the total. Following are the figures for the 778 Individual\nMembers whose occupations are known:\nEducational station personnel . 197\nCollege instructors (mostly radio-tv & allied fields) . 103\nStudents, graduate & undergraduate . 85\nA-V or radio-TV consultants for schools & colleges . 49\nCCTV & production center staffers . 46\nElectronics industry & telephone company personnel . 41\nCommercial station staffers . 29\nPersonnel of associations in allied areas (NAB,\nschool boards, teacher organizations, etc.) . 27\nPublic & private school administrators . 27\nCollege administrators . 23\nETV association personnel . 21\nMilitary ETV personnel .. 18\nState & county education department personnel . 18\nETV teachers . 11\nU. S. Government employees (HEW, USOE, etc.) . 11\nNAEB staffers. 10\nReligious radio-tv personnel . 8\nAdvertising, PR, legal firm personnel . 8\nForeign station personnel . 7\nElementary & secondary school teachers . 6\nTOTAL 778\nMiller Gives NAEB $1000\nOn March 11, Harold C. Miller, president of Miller Asso¬\nciates, Inc., presented the NAEB with $1000 to help support\nthe general activities of the association.\nInstructional Broadcasters to Meet Next Month\nThe NAEB is sponsoring a national conference on instruc¬\ntional broadcasting May 13-15 at the University of Illinois.\nCo-chairmen Charles J. McIntyre, University of Illinois, and\nLeslie P. Greenhi'll, Pennsylvania State University, have asked\nthose with specific suggestions for topics for the conference\nto notify McIntyre immediately. Announcements were sent\nto all NAEBers in mid-March; Newsletter readers who would\nlike to attend the conference but have not yet notified Mc¬\nIntyre should do so at once. Each participant will pay his\nown expenses plus a $5 registration fee. Anyone who is in¬\nterested in the field may attend, and professional practitioners\nare being encouraged to invite administrators, school board\nofficials, and legislators so that they may learn more about\ninstructional broadcasting.\nOther members of the conference committee besides the co-\nchairmen are: William Ewing, Ohio State University; Bart\nGriffith, University of Missouri; Stephen Hathaway, Miami\nUniversity of Ohio; Roy J. Johnson, University of Miami;\nLynn Kalmbach, South Carolina ETV Center; Robert Lesher,\nHagerstown; and Lt. Col. Robert E. Wood, Air University,\nMaxwell Air Force Base.\nThese are the people who met in Washington to discuss\nsuch a conference, and who were named in the Washington\nReport of February 8, 1963. New members of the committee\nare Robert R. Suchy, Milwaukee Public Schools, Mrs. Kath¬\nleen Lardie, Detroit Board of Education, and Clair R. Tet-\ntemer, Sr., Twin City Area Educational Television Corpora¬\ntion, St. Paul, who were chosen to give adequate representa¬\ntion from the schools.\nConvention Session Topics Needed\nFor two successive years, NAEBers who have attended the\nnational convention have voted the special-interest sessions as\nthe most popular feature. These sessions are currently being\nplanned for the Milwaukee convention this fall, and the com¬\nmittee needs suggestions for specific topics, as well as sug¬\ngestions as to who should be asked to present the papers.\nPlease send all such recommendations to Jack McBride, chair¬\nman of the Permanent Convention Committee, at KUON-TV,\nUniversity of Nebraska, Lincoln, with a carbon copy to NAEB\nVice President Harold Hill.\nCalifornia Approves NAEB Membership\nAt its meeting in Los Angeles on February 14, 1963, the\nCalifornia State Board of Education passed a resolution ap¬\nproving the NAEB for membership by schools and by county\nsuperintendents of schools. The resolution carries specific ap¬\nproval for the school years 1962-63, 1963-64, and 1964-65.\nRepresentatives of school systems in the state have reported\nin the past that California schools could not join an organi¬\nzation without such approval.\n1"
}