{
  "id": "d1233-3",
  "text": "Birmingham class purchased a set for $9 tax—plus 47 trading-\nstamp books.\nCharles W. Joiner, associate dean of the University of\nichigan Law School, says that TV is giving a big assist to\nthe law school in training better lawyers with more profes¬\nsional responsibility. He was reviewing the first year of op¬\neration of the CCTV link between the circuit court and the\nlaw school; this was described in the July-August, 1962,\nNAEB Journal.\n^ KBPS (AM), Portland (Ore.) school station, celebrated its\n40-year anniversary in March.\n^ The University of New Hampshire has received $14,900\nfrom the Air Force Cambridge Research Laboratories for\nantenna research.\n^ In a recent statement before the North Dakota House of\nRepresentatives, W. Ferron Halvorson, director of educa¬\ntional communications for the state department of public in¬\nstruction, said that North Dakota “. . . is one of the few re¬\nmaining areas in the United States where some VHF chan¬\nnels are still left. Perhaps our state is the only area remaining\nwhere there could be an educational television network of\nVHF channels entirely. . .\n^ A press release from Wayne State University says that\nthat institution’s Television Theater is the only locally pro¬\nduced dramatic series in Detroit.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For Information, write Mrs. Jacqueline Swain, Placement Serv¬\nice, at the NAEB office in Washington.)\nApril I Desires position as music director with ER or ETV\nstation, planning programs of live and recorded music,\ndoing air work and giving courses in radio/TV and music\ndepartments. M.A. in music. 10 years experience in com¬\nmercial and educational radio in all phases of music\nprograming, production, continuity and announcing. Also\nexperience in college teaching and adult education. Lo¬\ncation anywhere; salary open.\nApril 2 Ambitious and energetic broadcaster seeks challeng¬\ning production-direction position in ETV. B.S., Radio/TV;\nFCC 1st Class Radio telephone license. Five years ex¬\nperience in all phases of radio and TV; presently em¬\nployed in major market commercial TV station. Age 28,\nmarried, available immediately. No geographic restric¬\ntion; salary, $6,500 minimum.\nApril 3 M.A. candidate in Radio-TV with unusual wide tech¬\nnical/practical experience background desires ETV op¬\nportunity; willing to consider any possibilities, but pre¬\nfers production-direction. B.S. in distributed studies:\ntelecommunicative arts (TV), English, technical journal¬\nism, and industrial admin. FCC 1st Class radio-telephone\nlicense. Age 30, married male, available on or after\nJuly I. Location open; $5,500 minimum.\nApril 4 EDUVIDEOCATOR (a person experienced in both\ntelevision and education) seeks executive position with\neducational station. M.Ed.; 9 years in TV as director,\nproducer and program manager; 3 years in education as\nteacher. Male, 37, with wife and daughter. Salary should\nbe commensurate with position.\nApril 5 Challenging work in ETV programing and/or pro¬\nduction wanted by B.S. in radio-TV. Working toward\nM.S., airwork, writing, news. One year educational radio\nsupervisor; 5 years commercial radio-TV in writing, pro¬\nduction, sales. Male, 27, single. Minimum $5,800.\nApril 6 Producer-director position. M.A. in radio-TV this June\nfrom University of Michigan. Extensive musical back¬\nground with junior and senior high teaching experience.\nMale, 27, married. Any location.\nApril 7 Commercial/educational broadcast executive in mar¬\nket for new opportunity. Looking for top, permanent lo¬\ncation where significant ETV effort is in demand. M.Ed.\nin radio-TV-education. 10 years commercial/public serv¬\nice TV experience. Male, 37, married/children. Location\npreference: Midwest, California, Washington.\nApril 8 Responsible young man seeks responsible position in\nTV and/or film production and/or direction with ETV\nstation or university. B.A. radio-TV-film; M.S. TV-film\nearly summer 1963. Teaching experience and considerable\nexperience in TV-film production and direction. Married,\n26. Location and salary open.\nApril 9 Director of racfio-ETV with 12 years production back¬\nground wants to create and develop radio and ETV in\nyour institution. Location no barrier.\nApril 10 Television production and/or instruction in established\ncollege or university television facility. Wishes to teach\nin educational TV area. B.A., M.A., summer 1963. Teach¬\ning experience in and out of TV; professional TV experi¬\nence. Male, 31, married.\nApril I I Seeks college-level teaching position in radio-TV\narea beginning September 1963. M.A. radio-TV; 2 years\ncommercial TV experience as writer and assistant pro¬\nmotion director with major market net affiliate; familiar\nwith all areas of radio-TV production. Married, one\nchild, age 27. Prefers West Coast but will consider all\nareas. Minimum salary, $6,200.\nApril 12 Radio-TV station director seeks similar position in\nan established or new operation in west or southwest.\nB.F.A., M.M. and M.A. 8 years experience in educational\nbroadcasting; experience in all phases of radio-TV pro¬\ngraming and production; will consider some teaching in\nradio-TV. Married, age 40. $9,000 minimum.\nApril 13 New York network TV engineer with more than 13\nyears exhaustive experience in TV, and excellent refer¬\nences, desires chief engineer position at college or uni¬\nversity. Can completely design, build and efficiently\noperate ETV station of any size at minimum expense,\ntrain personnel in all phases of engineering and pro¬\nduction. Salary negotiable, depending primarily on com¬\nmunity.\nApril 14 Graduate of RCA Studio Production School of\nNYC, interested in obtaining position as camera man,\naudio, boom operator or projectionist. Anxious to start\nwork to gain experience. Male, 19 years of age, single.\nPrefers southern states or New England states.\nApril 15 Radio-TV major wishes to work in radio or TV station\nfor experience. Male, 19 years of age, single. Willing to\nrelocate.\nApril 16 Candidate for M.S. in communicative arts seeks\nposition as producer-director or production manager.\nMale, age 23, single. Prefers midwest or southwest lo¬\ncation. Salary open somewhat, but expect $5,000-$6,000.\nApril 17 TV writer-producer-program executive, just back\nfrom contract position overseas, desires creative post in\nETV operation heavy on documentary. B.A. in drama,\nYale University. 13 years experience includes 3 years\nas operations manager regional network, 5 years writing-\nproducing in major Florida markets, 5 years directing in\nDetroit. Male, 37, married. Will relocate for creative\nchallenge and $10,000 plus.\nPOSITIONS AVAILABLE\n(In order to be considered by these institutions, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nA-1 Experienced TV Producer. M.A. Must be able to teach in\nCalifornia. Open immediately. West coast college.\nA-2 Experienced TV Engineer. Must be able to teach in Cali¬\nfornia. 7 years experience required. West coast college.\nA-3 Faculty member opening in radio-TV area. Ph.D. required.\nMust be particularly strong and experienced in creating,\nproducing, and directing educational radio and TV pro¬\ngrams for both public consumption and for college-level\nclosed circuit instructional TV using college students and\ncollege faculty for the production crews and talent.\nOpen September 1963. West coast college.\nA-4 Producer-director. Open near future. Salary, $4,200 to\n$4,500. Southern community.\nRemember 1963 dates for IERT: June 12-14,\n4\nNEWSLETTER"
}