{
  "id": "d1233-3",
  "text": "December 19, 1931\nBATON ROUGE APPEALS DECISION\nThe application of A. B. Murray-'and T. P. Singletary, Baton Rouge, Louisiana,\nfor a new station on 1500 kc with power of 100 watts and unlimited time was\nappealed to the Court of Appeals of the District of Columbia this week. ^The appli¬\ncants allege the Commission erred in denying the request for the new Louisiana\nstation, on the ground that the facilities of the State are now centered at New\nOrleans and Shreveport, with the exception of one 50 watt daylight station and that\nthis situation results in \"lack of consistent service in Baton Rouge and the terri¬\ntories between the two cities.” In its application, the appellants set forth the\nrequest which had been made to reduce the power of station ZTBS, Shreveport, La.,\nfrom 1000 to 500 watts, in order to bring the Baton Rouge application within the\nterms of the quota. Error on the part of the Commission is further claimed.by the\nappellants by the failure of the Commission to defer action on the application\nuntil pending litigation in the Court of Appeals is concluded.\nParkersburg Application Opposed\nThe application of the Parkersburg Board of Commerce, Parkersburg* West Virginia,\nfor authority to erect a new station on 1370 kc with power of 100 watts and un¬\nlimited time was recommended for denial by Examiner Hyde in Report No. 306 this.week.\nThe grounds for the examiner's decisien are based on the facts that if the appli¬\ncation were granted, West Virginia would be slightly over quota, and the applicants\nfailure to show sufficient financial ability \"to afford assurance that an adequate\nfinancial basis for the proposed service\". It was further concluded that the grant¬\ning of the application would result in increased interference on the requested\nfrequency.\nQUOTA CITED AS BAR\nConceding that Station WCSH, Portland, Maine, is making \"full and efficient\nuse of the facilities heretofore granted for the operation of its station,\" and.\nthat the station \"is rendering a high class program service\" and that the granting\nof the application \"would enable the applicant to extend its service to include a\nlarge area not now well served by this station or any other station in the State\nof Maine\", nevertheless Examiner Pratt was compelled to recommend denial of the\nPortland station's application for increased day power from 1000 to 2500 watts.,\n(Report No. 305) on the ground that the granting of the request would cause Maine\nto be over quota. This State is .02 unit under quota. The granting of this\napplication would increase the quota .25 unit.\nMINNESOTA APPLICANT DEFAULTS\nThe application of Weber Jewelry & Music Company, St. Cloud, Minnesota, for a\nconstruction permit to erect a new station on 1500 kc with power of 50 watts to\nshare time with Station ICGEX, Moorhead, Minnesota, was recoimiended for denial as\nin cases of default by Examiner Yost this week in Report No. 304. In his conclu-"
}