{
  "id": "d1336-21",
  "text": "4jour to uie tadic\nones to which the whole class will care to\nlisten. Individuals may volunteer to\nreport upon them, or discuss them before\nthe group. The class may wish to set\nup a committee to watch for and suggest\ninteresting programs. A radio club might\nbe organized to study and report on pro¬\ngrams, do selective listening, discuss\nproblems of radio production, collect and\ntry to find the answers to questions about\nradio personalities and problems, or study\nthe mechanics of radio broadcasting and\nreceiving.\n■WE71TH the purely recreational type of\nprogram the teacher can do several\nthings. She can be acquainted with suit¬\nable current programs. She can tact¬\nfully recommend good programs. She\ncan help the children to analyze their\nown tastes and to understand their func¬\ntion as consumers of products advertised\nover the radio. The teacher may be in¬\nterested in making a survey within her\nown classroom of what programs are en¬\njoyed by her pupils. This might prove a\nstarting point for discussions on what\nmakes a good program or why certain\nprograms are popular. Reports by in¬\ndividual pupils on programs they wish to\nrecommend can be helpful to the class\nand may form a basis for discussion.\nIt is important in connection with com¬\nmercial programs that the teacher refrain\nfrom sweeping condemnations of broad¬\ncasts which, from a cultured viewpoint,\nmay seem trivial or even harmful. A co¬\noperative approach in which pupil and\nteacher work together toward an under¬\nstanding of what programs best fill the\nrecreational needs of individuals will be\nfound most effective.\nHome radio listening is also an area in\nwhich it is important to establish a co¬\noperative relationship between the school\nand the parents. Parental interest and\nconcern in the field of radio may be as¬\nsumed. It is necessary that parents know\nabout the kinds of materials and experi¬\nences to which their children are being\nexposed by means of the radio. There\nare several techniques by which the\nteacher may utilize parental interest.\nDiscussions of listening may be held at\nParent-Teacher Association meetings.\nAmple opportunity should be provided\nfor the parents to present their problems\nand points of view, and an attempt should\nbe made to formulate a definite approach\nto radio which can be used both at home\nand in school. A radio committee of\nparents might listen to suggested pro¬\ngrams and report back to the larger\ngroup. The school might send out a\nbulletin prepared by pupils and teachers\nand listing suitable available programs.\nParents might be invited to the classroom\nto listen with their children to school\nprograms or to discussions of out-of-\nschool broadcasts.\nThroughout Parent-Teacher discussions\nan attempt should be made to understand\nthe situation from the point of view of\nthe needs of the children and how these\nneeds are being met. To try to coerce\nchildren into listening to certain pro¬\ngrams, or to forbid them to listen to\nothers may engender feelings of distrust,\nantagonism, and resentment. Each out-\nof-school listening problem involves a\nconsideration of the needs of the child\nas a personality. The merits or demerits\nof a particular program may be a matter\nof relative unimportance. If a child\nlistens to the radio four hours a day is it\ndue to the ready availability of interest¬\ning programs, or is it because of lack of\ngood books, lack of opportunities for\nout-door recreation, or lack of facilities\nfor wholesome indoor activities? If a\nparticular child suffers nightmares after\na certain program is it the program which\nis to blame or is it some deeper disturb¬\nance in the child which is at the root of\nthe matter? The discussion of questions\nlike these may produce a very vital form\nof parent activity.\nSo far, little has been said of the op¬\nportunities for the teacher in out-of-\nschool radio listening. The teacher who\nhas become interested in radio in the\nclassroom will wish to listen not only to\nkeep herself informed in order to be\nable to help her students, but also be¬\ncause leisure-time listening can offer her\na great deal of valuable cultural experi¬\nence which she might not otherwise be\nable to obtain. Round-table discussions\nof current issues, newscasts, lectures,\nmusic, dramatizations, can contribute\ngreatly in enriching and broadening her"
}