{
  "id": "d1155-0",
  "text": "NEWS NA61B LETTER\nNATIONAL ASSOCIATION - EDUCATIONAL BROADCASTERS\nFrank E. Schooley, Editor, Station WILL, Urbana, Illinois\nFiBRUARV 5 ? * 942\nSUNDAY BROADCASTS FOR IVHA\nStarting Sunday (February i) radio listeners will enjoy additional\nBROADCASTS AS STATE-STATION V7HA CHANGED ITS “ S 8 LENT ON SUNDAY*’ POLICY\nAND TAKES TO THE AIR ON A SEVEN-DAYS-A-WEEK SCHEDULE. NEW PROGRAMS\nPLANNED ESPECIALLY FOR &IS00N3IN LISTENERS WILL BE FEATURED IN THE\nEXPANDED SERVICE, H. B. McCaRTY, THE STATION DIRECTOR, HAS ANNOUNCED«.\nHThe hope,” saio McCarty, “is that we may serve a large audience which\nIS NOT ABLE TO LISTEN TO DAYTIME PROGRAMS DURING THE WEEK. THE PRO¬\nGRAMS WILL BRING TO THE MICROPHONE THE BEST WISCONSIN TALENT AND\nTHOUGHT AVAILABLE.0 Y.'HA IS LIMITED 3Y FEDERAL REGULATIONS TO BROAD*\nCASTING DURING DAYLIGHT HOURS.\n“Wisconsin Industry At War“ is a new program to be heard at 4:00 o’clock\non the Sunday schedule. It is a moving story of what the men and wo¬\nmen OF THE BADGER STATE ARE DOING TO PRODUCE THE MATERIALS NEEDED TO\nWIN THE WAR.\nBack-stage looks at the tremendous power Wisconsin factories are\nPUTTING INTO THEIR VICTORY EFFORTS WILL BE GIVEN IN THIS SERIES. IHE\nSCHOOL OF COMMERCE OF THE UNIVERSITY OF WISCONSIN HAS PLANNED THE\nSERIES UNDER THE TITLE “WISCONSIN INDUSTRY At W'aR. “ AMONG THE REPRE¬\nSENT AT IVE COMPANIES WHOSE EFFORTS WILL BE DEPICTED ARE THE FOLLOWI NG J\nFebruary I - Gisholt Machine Co.\n8 - Allis-Chalmers Manu-\nFACURING Co.\n15 - Fairbanks Morse & Co.\n22 - Kohler Co.\nMarch I - Kearney-Trecker Corp.\n8 - The Heil Co.\nThe PLAN IS TO SHOW' what is being done and so stimulate greater civilian\nPARTICIPATION IN THE ALL-OUT VICTORY PRODUCTION CAMPAIGN. JOYCE JAEGER,\nWHA SCRIPT EDITOR, IS IN CHARGE OF THE WRIIT ING OF TH€ PROGRAMS AND\nPERSONALLY GATHERS AND AUTHENTICATES THE MATERIAL INCLUDED.\n“Why the U. S. Must Fight Again” is the topic to be discussed by\nWISCONSIN'S EMINENT HISTORIAN, PROFESSOR JOHN D. HICKS ON THE UNIVERSITY\nForum at 3:30 o’clock. Each week a vital topic will be analyzed bv\nAN AUTHORITY."
}