{
  "id": "d1155-3",
  "text": "NAEB NEWS LETTER\nPage 4\nFebruary I> 1942\nDR. W. Vi. CHAFFERS TO RETIRE\nAfter serving as director\nucational Research since\nACTIVE DUTY AUGUST 31.\nof Ohio State University's Bureau of £d~\n1928, Or. V/. W. Charters will retire from\nThe well known educator will then devote his full time to writing,\nGATHERING TOGETHER THE THREAOS OF RESEARCH WHICH HE HAS SEEN DOING\nFOR MANY YEARS, AT OHIO STATE AND ELSEWHERE.\nAnnouncement of Dr.\nTRATIVE RESPONSIBILI\nCharters* desire to qe relieved of his adminis\nTIES WAS MADE BY PRESIDENT HOWARD L. 8EVIS.\nThe retiring director, nationally know as education,\nHAS BUILT THE OHIO STATE BUREAU INTO ONE OF THE BEST KNOWN RESEARCH\nORGANIZATIONS IN THE FIELD. ITS STUDIES, FFcEQUENTLY SUPPORTED\nFINANCIALLY BY NATIONAL FOUNDATIONS, HAVE EXTENOED INTO MANY AREA.,\n-—CURRICULUM, TESTS, HOUSING, EVALUATION, MOVIES, RADIO.\nOnp of HIS EDUCATIONAL CONTRIBUTIONS HAS BEEN THE ESTABLISHMENT OF\nOhio State ofthI annualInstitute for Education by Radio, held here\nannually since 1930 to bring together hundreds of representatives\nOF RADIO AND EDUCATION FOR A DISCUSSION OF COMMON PROBLEMS.\nSTERLING FISHER TO NBC\nSterling Fisher, noteo for outstanding achievements in the PROtf>TtoN\nof culture and understanding through radio between the\nappointed assistant TO Or. James Rowland aNGell, public service\nCOUNSELLOR FOR THE NATIONAL BROADCASTING COMPANY AND FORMER P^SIDENT\nof Yale University, according to an announcement made by Dr. Angell.\nMr. Fisher who, in December/ was awarded a citation for singular con¬\ntributions TO THE ADVANCEMENT OF A FRIENDLY EXCHANGE OF RADIO ED¬\nUCATIONAL BROADCASTS BETWEEN THE AMERICAS, WILL ASSIST DR. AnGELL IN\nTHE ESTABLISHMENT BY NBC OF A PERMANENT InTER-AmERICAN NI VERS IT Y\nOF THE A|R.\nIn making this announcement, Or. Angell saio, h?oday, as NEVER BEFORE,\nW^RlS EVENTS ARE MAKING THE PEOPLE OF ALL THE AMERICAS VIVIDLY AWARE\nOF THE INCREASED NEED FOR MUTUAL UNDERSTANDING OF THE CULTURES AND\nANO^DEALS^WHICH PREVAIL AMONG ALL OF THE NATIONS IN THE WESTERN HEMI¬\nSPHERE.\"\nAMEKl CAN EXHIBITION OF RECOP 0JJ£5S\nEntries for the Sixth American Exhibition of Recordings of Educational\nRadio Programs will close March 15, it was been announced by .\nKeith Tyler, Director of the Institute for Education by Radio. In-"
}