{
  "id": "d6-33",
  "text": "Program Personalities\nThe voice of the noon Farm\nProgram is that of Maurice E.\nWhite, associate professor of\nagricultural journalism in the\nUniversity of Wisconsin Col¬\nlege of Agriculture. Maury has\nbeen radio farm director for the\npast seven years, having re¬\nturned to his native Wisconsin\nafter serving as farm director\nfor WOSU, the radio station\nof Ohio State University. He\nreceived both his bachelor and master’s degrees in\nagricultural journalism at the University of Wiscon¬\nsin. His studies were interrupted during World War\nII when he served in the U. S. Army. Last year\nMaury was selected for a fellowship at Cornell Uni¬\nversity under a program sponsored by the Ford\nFoundation for agricultural extension workers. The\nfellowship included a year of study toward a Ph.D.\ndegree and concluded with a trip around the world\nto examine at first hand agricultural extension meth¬\nods in other countries. Maury is in demand as a\nteacher of agricultural information methods at dis¬\ntrict and state meetings of county agricultural\nagents. For several years he has taught summer ses¬\nsion short courses both in Wisconsin and South\nDakota. He is a member of Sigma Delta Chi, honor¬\nary journalism fraternity, and the National Association\nof Radio and Television Farm Directors.\nCooper Union Forum\n7:00 P.M. Sundays\nRepeated 11:00 A.M. Fridays\nThe series Great Ideas in the Great Hall ends with\nthe broadcast of May 4. A new series entitled Great\nExpectations begins May 11, to be followed by a\nseries on Places, Travel, and World Affairs begin¬\nning June 15.\nMay 4\nThoughts on Space and Matter, Percy W. Bridg¬\nman, physicist, author, 1946 Nobel Prize Winner\nin Physics.\nMay 11\nNutrition and Diet, Norman Jollife, M.D., Direc¬\ntor, Bureau of Nutrition, City of New York De¬\npartment of Health.\nMay 18\nAntibiotics and Their Contributions to Science and\nSociety, Dr. Walker A. Wakeman, Director, In¬\nstitute of Microbiology, Rutgers State University.\nMay 25\nThe Geophysical Year, Hugh Odishaw, Executive\nDirector, U. S. National Committee for the Inter¬\nnational Geophysical Year, National Academy of\nSciences.\nJune 1\nThe Man-Made Moon and Rockets, Willy Ley,\nRocket Scientist and author.\nJune 8\nAntarctic Expedition, Laurence M. Gould, Presi¬\ndent, Carleton College, Director of the IGY ant¬\narctic program, member of the Byrd and present\nantarctic expeditions.\nJune 15\nThe Mediterranean, Johnson E. Fairchild, geog¬\nrapher, Director, Division of Adult Education, The\nCooper Union.\nJune 22\nGreece and Turkey, Michael M. Dorizas, Professor\nof Economic and Political Geography, Wharton\nSchool of Finance and Commerce, Pennsylvania\nUniversity.\nJune 29\nHow to Tour Europe on a Shoestring, Eric Mann,\nworld traveller, author, travel editor, Cue Maga¬\nzine.\nForums and Discussions\nPatterns of Thought, 2:30 p.m. Wednesday\nA series of programs presenting discussions of vital\nand interesting topics as seen through the eyes of\nphilosophers. Participants are members of the faculty\nof the University of Utah. Dr. Waldemer P. Read\nis the moderator.\nGeorgetown University Forum, 4:00 p.m. Wednes¬\nday and 5:00 p.m. Sunday\nThe Georgetown Forum, winner of many local and\nnational awards, is a continuous series of discussions\non significant topics by outstanding authorities. The\nobject of the programs is clarification, not controversy.\nLondon Forum, 4:00 p.m. Friday\nA series recorded directly from international short¬\nwave radio from the BBC in London. Many leading\nworld figures appear in these programs to discuss\ncurrent topics of the day. London Forum has been\na regular feature on the state stations for many years.\nContinental Comment, 2:00 p.m. Thursday\nA lively and informal series based on the leading\nnewspapers of Europe. Members of the Modern Lan¬\nguages department at Purdue read and interpret the\nnews as seen through the press in Spain, France, Ger¬\nmany, Italy and other European countries.\nBooks of Today, 2:00 p.m. Wednesday\nProfessor Paul Wiley of the department of English\nat the University of Wisconsin reviews current\nAmerican and British fiction. Professor Wiley is a\nspecialist in the modern novel and his reviews bring\nto bear his scholarship and wide experience on the\nlatest books by leading authors.\nThe Gilbert Highet Program, 7:30 p.m. Tuesday\nGilbert Highet, Anthon Professor of Latin Litera¬\nture at Columbia University, discusses a wide variety\nof topics. In this series of informal essays, Professor\nHighet draws on his background in the classics to\ndiscuss topics of interest to modern listeners.\nWindow on the World, 2:30 p.m. Monday\nProminent Britons visiting America record their\nviews on topics ranging from politics to poetry.\nRadio Journal, 9:00 a.m. Friday\nCurrent magazine articles, prominent visitors, dis¬\ncussions on current affairs make up the material for\nthis series. Roy Vogelman, state station News Editor,\nconducts the series.\nSpecial Lectures, 2:00 p.m. Friday, 7:00 p.m.\nSaturday\nMany special talks and discussions are recorded by\nyour state stations both in Madison and Milwaukee\nand around the state. It is our intention to record\nfeatures of general interest and educational value so\nthat they may be shared with our listeners. Thus we\nare leaving unscheduled two hours each week in\nwhich we hope to present current programs recorded\nrecently at the Wisconsin State Colleges, the Uni¬\nversity of Wisconsin-Milwaukee, the Madison campus\nof the University of Wisconsin, or anywhere else\nin the state.\n3 '\n\\\\\nFreshman Forurp\n11:00 A.M. Tuesday and Thursday\nRepeated 7:30 P.M^ Thursday and Friday\nThe general theme of this lecture-discussion series\nis Science Today: A Beginning and an End. The\ntopic is explored and developed by leading scholars\nfrom many departments of the University of\nWisconsin.\nApril 29\nPsychologists and the Pied Pipers, J. C. Gilchrist,\nAssociate Professor of Psychology\nMay 1\nClass Discussion Period.\nMay 6\nPhysical versus Biological Sciences, James F. Crow,\nProfessor of Zoology and Genetics\nMay 8\nClass Discussion Period.\nMay 13\nChanging Conceptions of Cause and Effect, Julius\nWeinberg, Professor of Philosophy.\nMay 15\nClass Discussion Period.\nMay 20\nScience, Scientists, and the Law, Willard Hurst,\nProfessor of Law and Carlisle P. Runge, Associate\nProfessor of Law and Assistant Dean, Law School.\nMay 22\nClass Discussion Period.\nMay 27\nScientists and How to Get Them, C. Harvey Sorum,\nProfessor of Chemistry.\nMay 29\nClass Discussion Period.\nJune 3\nBrave New World, Robert Doremus, Professor of\nEnglish, Associate Dean, College of Letters and\nScience.\nBroadcasting Hours\nThe advent of daylight saving time means more\nbroadcasting hours for WHA and WLBL. Accord¬\ningly, WHA and WLBL will remain on the air\nuntil 8 o’clock in the evening with the exception\nof Thursday and Friday evenings. On these evenings\nwe shall remain on the air until about 8:15 to\nbroadcast the complete lectures and discussions from\nFreshman Forum.\nThe French Story\n4:00 P.M. Tuesdays beginning May 13\nThis series is devoted to giving the listener,\nthrough dramatized incidents, a general history of\nFrance. The programs were produced by the French\nBroadcasting System, with content supervision pro¬\nvided by a number of noted French historians.\nMay 13\nVercingetorix.\nMay 20\nCharles Martel.\nMay 27\nThe Carolingian\nRenascence.\nJune 10\nCrusades and\nCathedrals.\nJune 17\nPhilip the Fair.\nJune 24\nEtienne Marcel."
}