{
  "id": "d6-36",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF THE PRESIDENT\nStation KUOM\nUniversity of Minnesota\nDr. Harry J. Skornia\nNAEB Headquarters\n14 Gregory Hall\nUrbana, Illinois\nDear Harry:\nAPR 2 5 £53\n7|8|9|10|11|12|1i2|8|4|Ei?\nL\nRelative to NAEB testimony on the Smathers Bill:\nFeel free to use or not use me as a witness without\nreference to anything except the most effective presentation\nof the case. I have investigated and found that the Univer^ty\nof Minnesota Press publishes no music to speak of. If the\nUniversity of Michigan Press does publish music, then Garnet\nwould make a better witness than I—if there were to be only\none of us. In view of the fact that the New York Times last\nweek reported that the chances of the Smathers^ill passing\nwere practically nil, I am inclined to say, let us minimize\nour expense and trouble at this point. In fact, If Marcus\nthinks it's desirable, we could even wait until the bill\ncomes up in the House for testifying at all.\nIf we do testify, we'll have to organize a case which\nwill include data as to how many university presses publish\nmusic. I learned from the director of the University of\nMinnesota Press, John Ervin, Jr., that the president of the\nAssociation of American University Presses is August Fuge of\nthe University of California at Berkeley. However, Mr.\nErvin doubts if Mr. Fuge or anyone else could tell offhand\nhow many universities do publish music.\nThere is also in this connection the fact that some\npublish music through their alumni associations. Thus, from\ntime to time the University of Minnesota Alumni Association\nhas published books of University football songs. Clearly,\nthough, this is a very peripheral part of our activity as an\neducational institution!\nIn any case, if we are going to appear, I think someone\nshould get a list of university presses (which could be had\nfrom the director of the press at Illinois, Michigan, Minnesota\nor most any other place), and then circularize them in a\nhurry to find out whether or not they do publish music."
}