{
  "id": "d1293-6",
  "text": "^^aJjL &\nN-A-L-B NIWE LETTE\nI&tfronal Association of Educational Broadcasters\nMadison, Wisconsin—April 22, 1936\n?STUDEBAKER COMMITTEE\" TO STUDY CONFLICTS.\n. ?inc* the meeting of the Federal Radio Education Committee several\nspecial sub-committees have been set up. One of these is known as the Sub-Com¬\nmittee on Conflicts. Our ^resident, H. B. McCartv, has been asked to serve with\nthis group to inquire into cases of controversy or conflict between educators and\nbroadcasters, to diSCOver instances of failure to cooperate and see what can be\ne o ring about better relations. Membership of this committee is as follows;\nChairman A. G. Crane, President, University of Wvoming\nM. S. Eisenhower, U. S. Dept, of Agriculture\nH. B. McCartv, National Assn, of Educational Broadcasters\n^eorve B. Porter, Legal Division, F. C. C,\nFrank M. Russell, Station WRC, Vice-President NBC\nHarrv C. Butcher, Station WJSV, Vice-President CBS\nThomas Reed, National Advisory Council on Radio in Education\nllliam B. Dolph, Station WOL, Washington\n. po® fi/*l meeting of this Sub-Committee on Conflicts is scheduled for\n1 According to McCarty, the work of this sub-committee\nlk fht ** th® heart of the Pro'blem which ‘he Federal Radio Education\ncommittee was set up to solve.\nT>etw..Whae haIe 70U t0 report hy way Of controversies or failures to cooperate\n. e\"educators and broadcasters? Whrt do you know of instances of disguised\ncommerce? U °°mm®rc:lal broadcasters? Do you know of cases of the imposition of\nera^lei 1fSd',n^1r<5Se0f-entertaini”ent on educational material? Can you give specific\ncrowed off ral °t 6 eduoational authorities’ Where has education been\nif anv a the alJ tlecause lt; rsn't popular enough\"? What educational stations,\n®!,e Un ®r Pressure from commercial interests seeking to acquire their\nSpiled tl ♦ £*£? a S the rin0lple 0f the what it «»t.* been\napplied, to the hindrance of educational and social values?\nvert „rnJ,he .°ther hSE?d’ do vou know of 00ses of indifference and neglect on the\nprise? WhereinFare th?I failing to do their part in a cooperative enter-\naccent advi? f? •*“**?” of the charge of being dull, unwilling to\naccept advice from commercial broadcasters, and inconsiderate of audience wants?\ncases ofeoo^;oTitteVn Confli°ts needs ™nr help. Accurate information on\nMr Mccfrtv V Cens°rshiP is required. As a member of the committee,\ndeliberation?^ ^ °F VT he?‘ He is anxlous that hls contribution to the\nunon flcts and thef,?omralttee he based, not upon theorv and generalities, but\nthf^fo^ns^p^nUy:118- \"rUe Mm h6lp this ^ittee t0\nNATIONAL CONFERENCE ON EDUCATIONAL BROADCASTING\nsor the first Natio^l Cn ? * d *£ he one of a group of organisations to spon-\nWashington D p Tp °0n?ere?®e on Educational Broadcasting to he held in\nallXT’ ?• C< on December 10, 11 and 12, 1936. The aim is to draw together\nall who are interested in any phase of the social use of radio. ®\nmaking the arrant \\ m? 13 & member °f the Plannin« committee which is\nreport will be ? ? ”atter w111 discussed at Ohio. A complete\nreport will be givfen m a later issue of the News-Letter."
}