{
  "id": "d1293-8",
  "text": "-3*4 v\n—-■Yg South Dakota_State College, S. W, Jones sends this information;\n11KFDY is justly proud of its student operator, Even Jensen, who hes the ability to\ngo through a redio transmitter and ’’comb out the bugs”—those imperfections in\nwiring, manufacture, hook-up, etc. which contribute to noisv reception. He has\nconstructed, soverol pieces of eouipment which saved the station the expense of\n\"buying them ready made. His latest triumph is a remote amplifier into which may\n\"be plugged as man- as tw0 velocitv and one condenser microphone—all at the same\ntime—vet the amplifior i* no larger than a brief cage and ig easily carried around.\nKFDY has added considerable new eouipment this vear, the latest being a new\nmonitor in the announcers’ booth, three new velocity microphones, a new remote\namplifier, a new suitcase model public address system, and lastly, is wiring a\nnew small sound-proofed auditorium for use ag a broadcasting studio for bands,\nglee clubs and other large units. South \"Dakota Stated famous militorv band under\nthe direction of Professor Carl Christensen will inaugurate the new broadcasting\nauditorium with a series of concerts in May. KFDY also broadcasts the outdoor\nconcerts of this band plevcd in the Sylvan Theatre on State College campus during\nthe last ^our weeks of the spring term.\n’’South Dakota State College is to furnish the Land Grand College Padio Hour\nprogram during the National Farm and Home Hour on the network, July 15, 1936, from\n11;30 to 12:30 c.s.t. S. W, Jones, manager of KFDY, is in charge of the program.\n11 Every Tuesday fr0m 1:30 to 2i00 p.m. KFDY1 s ’’Little Theatre of the Air”,\nunder the direction of Earl James of the South Dakota State College speech de¬\npartment, broadcasts a one act play.”\nMEMBERS ON OHIO PROGRAM-_May 4-5-6\nThe meetings of the Ohio Institute on Education bv Radio win find, sevaral\nrepresentatives of member stations taking part. Among them are Carl Menzer, WSUI;\nA. G, Woolfries, WOI; H. B, McC«rtv, WHA; Ralph H. Ojemann, WSUI; W. I. Griffith\nWOI; and R. C. Higgv, WOSU.\nMany N.A.E.B. stations, it is reported, plan to be represented at the Monday\nevening closed meeting of the Association. Others say they ai~e trying to arrange\nto have their people present. The inspiration gained at such a get-together will\nhelp to farther the cause of educational radio. Several subjects of real impor¬\ntance to the Association are due for consideration at our meeting.\nRemember the detes-Mav 4,5, and 6. Plan to attend if it is at all possible.\nOn to Columbus.1\nTHE EXCHANGE PACKET\nWhen you look ove^ the current exchange packet notice the splendid collection\nof material from WRUF. We can all get some wood ideas to ^it into our own situations\nThe same goes for the r^st of the pieces ais0.\nStill we haven’t had any contributions from a few stations. Remember-\npack up vour material now—25 nieces of each. The continuance of the exchange\npacket idea depends upon Trour participation. Send the matcria.l to the Secretary,\nNevs-Letter Headquarters: Radio Hall, Madison, Wisconsin.\nRECORDING EQUIPMENT\nCarl Menzer, chairman of the committee to investigate recording equipment and\nmake recommendations reports; ’’Within the next few days we expect to have available\nfor trial three or four complete units for instantaneous recording. It is hoped\nthat the best unit available mill soon be secured for use bv NAEB members and a,\nstart made to form a circulation library of recorded programs.”"
}