{
  "id": "d1005-130",
  "text": "®lre Jjlonha: jitate pfmtarstig\nUNIVERSITY BROADCASTING SERVICES\nApril h> 1958\nDr# Sam Becker, Director\nTelevision Center\nState University of Iowa\nIowa City, Iowa\nDear Sam:\nYour January 28th letter did not structure my thinking,” as you put it#\nIn fact, my thinking has been very unstructured since we have started to\nlay plans for ETV; one day we’re to go ahead, the next day the Gov# says\nwe can’t, and the following day he claims he really didn't mean it#—Take\nthis sort of thing once a day for twelve months and you can see why a\nperson's thinking becomes very unstructured#—Let this then be a formal\nappeal that if you hear of a decent teaching job or a radio management one,\nI’m really in the market for a move#\nLet’s get to the interesting problem: NAEB Research. These are ideas I have\njotted down but not having too much connection at times.\n1) I believe we need to redefine the purpose of these grants; that is,\nspell out for ourselves just what type of project we will okay#\nThe first time we approved grants, few of us were really happy\nabout the selections, but we went ahead with it to get things\nstarted#—Now on the recent requests it was interesting to note\nour voting was so close, however, even though I may be splitting\nhairs, some of the money went for approval of items we hadn't\napproved during that first year.\nSo, in other words, can we this year define just what we want on\nthese# Do we want to approve typing expenses, payment to clerks, etc#\n2) If funds are available for a Director of Research, won't we need\nto spell out the relationship between his position and that of\nthe Research Committee, as well as Headquarters?\nWhat about an operating budget for him? If he is to travel to\nWashington, shouldn't funds be available for this as well as\nfunds for the Chairman?\n3) Speaking of money, can we get funds for a three-day meet at\nColumbus, for the Committee?\nU) Perhaps this is the time we also need to think about results#\nI'm confused as to whom will be benefited# Is this work to be\nof direct help to managers, or producers, or professors? —Maybe\nall of them somewhere along the line, of course# But can we start\nto shape up a list of the basic problems now. I'm certain the"
}