{
  "id": "d1005-140",
  "text": "UNIVERSITY OF SOUTHERN CALIFORNIA\nUNIVERSITY PARK\nLOS ANGELES 7\nApril 30, 1958\nProfessor Sam L. Becker, Chairman\nFAEB Research Committee\nDivision of Television-Radio-Film\nState University of Iowa\nIowa City, Iowa\nDear Sam,\nMary thanks for your thoughtful memorandum of April 2iu I\nam unable to be in Columbus during the Institute, so I am taking\nthis opportunity to put some remarks on paper.\nHopefully, most or all of the $2,000 would be used for grants\nin aid, if projects of sufficient merit are presented. Probably\nthe general purpose of these grants could be to encourage research\nof a higher quality instead of merely more research. I am able\nto think of very little research in which the committee may not\nbe interested, if that research is proposed by a competent researcher\nwho has knowledge of educational broadcasting.\nYes, the announcement of grants should be out by mid September,\nat latest. I hope that we would have enough applications of\nsufficient merit to leave no money for research by the committee.\nwould favor publication of some kind by the oommittee, and I\nwould give first priority to the publishing of the report of the\nTresearch seminar. I see no special need for a separate meeting\nof the committee at this time. In my view, the best procedure\nfor increasing the probability that sound research will be done\nwith NAEB funds would be to broaden the abilities of the members\nof the committee.\nThe kind of person who would be best as director of research\nis the same kind of person who would be best as a member of this\ncommittee, I think. That kind of person should have advanced\nunderstanding of mathematics, psychology, and educational broad¬\ncasting. He should be able to carry forth erudite researchs and\nto be most responsive to the day by day needs of operating educational\nbroadcasters.\nPlease give Irv Merrill my support in his request that\nquestions about radio and television be included in the I960 census"
}