{
  "id": "d1652-3",
  "text": "-4-\nof “fair use\" and the courts must decide each case on its own merits. Accordingly,\nthere is much uncertainty about one's legal rights in proceeding under the doctrine\nof “fair use.\" There is no specific number of words, lines, or notes that can be\nused safely without permission and acknowledgment of source is no protection\nagainst infringement. However, book publishers and other commercial groups are\nchallenging the propriety of any interpretations and are exerting pressures to write\ninto the new copyright law specifications which would further curtail the application\nof \"fair use\" in education.\nThe ambiguities in the application of \"fair use\" have caused educational broad¬\ncasters serious difficulties and seriously diminished its value to education. Failure\nto spell out what rights and privileges education has under the law will increasingly\noblige broadcasters to forego the use of written and visual materials because of the\nrisk of infringement and because of the increasing tendency of copyright owners to\ntake such cases to coiirH\n3. Duration of Copyright\nPresent law provides protection for 28 years with the privilege of 28 year renewal;\nafter that the work is in public domain. Current proposals would extend the time\nbefore copyrighted materials come into public domain. One provides that the first\nterm remain 28 years and the second term be extended to 48 years. Other proposals\nsuggest that copyright be for the life of the author plus 50 years or 75 years from\nthe date of creation or publication of the work.\nSince education's need is the ready availability of materials, it is opposed to\nproposals which would increase the duration copyrighted materials and slow their\navailability in the public domain.\n4. Deposit copies\nTo copyright materials under the present law requires the deposit with the Register\nof Copyrights of two copies, e.g., two audio tapes, two video tapes, two films, etc.\nSince stations ordinarily make only a single copy of a program and because tapes -\nespecially video tapes - are expensive, this requirement seems unduly burdensome,\nunnecessary, and impractical. This requirement, a carry-over from the days when\nmanuscripts or printed materials were all that was copyrighted, is unsuited to the\nvariety of materials on which copyrighted content may be recorded today.\nEducation should be relieved of this onerous requirement and a more reasonable and\nappropriate provision made to meet the needs for present and historical records.\nEducation's Proposed Amendment\nIn a positive effort to improve upon the unsatisfactory portions of the law, the\nCommittee has proposed an amendment which would include its objectives in one\nsection which would be applicable only to non-profit educational institutions."
}