{
  "id": "d1381-2",
  "text": "-2-\nHow Non-commercial Is or Should ETV Be?\nIncreased attention is being given currently to the non-\nsrJs‘i»-*sS5-«r ^g=sj;,rss--\ncan however, broadcast programs underwritten by others when no\nother corporation egeC®hIyda?shalsohrequiredUto1identify via a\nprogram.” In such cases ’ institution or agency furnishing\nsai^programl^However^such^regulations^open up /number of Srey\n„c laavp unanswered a number of questions.\nareas, l^a _ttee f JCEB and NAB is now working on a memo\nappropriate limits of non-commercial status *rta2lCfn\nnromotion in local papers of \"Age of Kxngs,\" (BBC-NET) in which\nHumble Oil Co. was featured in display advertisements announci g\nbroadcasts overi^cautiouf interest being evinced in federal agencies\nconcerning possible alteration in present rules so that educational\nstations might continue to operate --“ht'be revived tof\nnrofit enterprises, One approach, money might\nbroadcast in/an outside program so long as it does not accrue to\nthe benefit of individuals and is used solely to be plowed back\nint° NAEB^/watching all these developments closely, since they\nhold the potenfilfof grave consequences for the future of education^\nbroadcasting.\nA Word in Your Ear\nA determined effort will be made by opponentsoffaderalaid to\neducation to prevent any ETV appropriation by the Congress\nThis means that an even more determined use of\norganizational strengths through individual and collective eiiort\nwill need to be made by proponents to 0f\nimplementation of the ETV legislation forcefully to the attent\nCongress nod now and tha conVening of Congress in\nn m.imhprc: are still in their home territory and avail\nableafor”discussion--provides1a chance to acquaint them with this\nmailer Indirietlhem know about your operation and your problems\nand plans and in what ways federal assistance may be important to\ntheiryConstituency^o ^ thoge n3wly elected or re-elected to\nSSSHnS report^and ?he* to visit\nreflect state and local pressures and oounter-pressures local or\nstatewide expressions of concern are ®°rl*kep/?jrsLa /ken,\nthan statements from a national organization...By the same tok ,"
}