{
  "id": "d1381-3",
  "text": "-4-\nGUESTITORIAL\nIHAT ABOUT FACSIMILE?\nEducational broadcasters have been interested in M for some time.\nThey are now becoming interested in FM and we hear a great deal about TV,\nbut what about FAX?\nFacsimile has been a much abused and little understood nor appreciated\nbranch of radio broadcasting, but just what is the present status of\nFacsimile? While it may be presumptuous to say that Facsimile has been\ndeveloped to the point tliore virtually nothing more is desired, it is at\nleast true to say that at the present time Facsimile delivers a quality\nin reproduction of printed or written material which is equal to, or better\nthan, the reoroduction standards of the modern newspaper. It reproduces\nthis material at a very satisfactory rate, although the exact rate varies\nsomewhat with the system employed. It is possible to transmit Facsimile\nin multiplex over virtually any radio station, although frequency limita¬\ntions and Commission niles prevent multiplex operation on the standard\nAl! band. But for those stations with F'M facilities, the simultaneous\ntraDsmission of voice and Facsimile is both possible and permissible.\nWhy should we, as educational broadcasters, be interested in\nFacsimile? The reasons should bo fairly obvious. They can be summarized\nas follows: It provides a racans of distributing outlines, charts, maps,\nand diagrams to the people who are intorostod iwithout the attendant delay\nof the mail, and without the necessity of the individual’s deciding in\nadvance that he is interested and notifying the station to send the\nmaterial to him. L!ultiplex operation would allow the material to be trans¬\nmitted more or less simultaneously with the discussion, and consequontly\neach individual listener who was interested in the talk could, by a simple\nturn of a switch, bo provided with the accompanying printed material.\nPermanent reference material can also.be transmitted by fhcsimilo, although\nit might be more economical to provide such material through the mail.\nYou may ask Vifhy television wouldn’t be bettor. Yvhile television will\nprovide a picture, it is a fleeting, temporary picture that cannot be re¬\nferred to after the talk is over.\nHow can we introduce Facsimile in our territory? Certainly there will\nbe no incentive for listeners to buy Facsimile receivers if there is no\nFacsimile transmission. And equally true, there is no incentive to broad¬\ncast Facsimile material if there arono receiving sets. Two possibilities\nsuggest themselves - stations might buy printers and lease oriwnt these\nunits on a non-profit basis to interested listeners. Or, theproblem could\nbe left to the individual listener, much as is being done with FM at the\npre sent t ime .\nIn any event. Facsimile can be an important educational toolj lot us\n,:ee that proper use is made of it.\n---Milford Jensen, Radio YICAL, St. Olaf\nNext month ’ s Guo stit ori a list: Jim Miles, hiBAil, Purdue."
}