{
  "id": "d1381-5",
  "text": "TO:\nNAEE'ers\n-6-\nTM E SEC R E TA RY '5 PAGE\nFROM: Radio City, New York\nDid you ever hear of the Commission on Freedom of the Press?\nDid you know that the Commission has been at work on a general report on mass\ncommunications — newspapers, radio, motion pictures, magazine and books;\nThe Commission of 13 was headed by Dr. Robert M. Hutchins. The Commission and\nits staff has been studying, interviewing people and holding information meetings.\nTheir report is a miust for everyone in radio and especially those interested in\neducational institutions and educational radio.\nThe report is an answer to some of the issues that have com.e up in recent weeks.\nThe first suggestion is, 'HTi: RLCCM®ND THAT NCN-PRCFIT INSTITUTICNS HELP SUPPLY\nVARIETY, QUANTITY, AND QUALITY CF...SERVICE REQUIRED BY THE AMERICAN PECPIl,.\"\n2- ® indicated our belief that the agencies of mass communi¬\ncation have a responsibility to the public like that of educa¬\ntional institutions. Re now wish to add that educational insti¬\ntutions have a responsibility to the public to use the instruments\nemployed by the agencies of mass communications...But the non-profit\ncorporation does not exist for the purpose of making profits. It\nis peculiarly able to enlist the cooperation of all who are in¬\nterested in the cultural development of the country. Hence it can\nrender those services which commercial enterprise cannot offer on\na profit-making basis.\n<1!^ ’’It can restore an element of diversity to the information and dis¬\ncussion reaching the public by organizing the demand for good things\nand by putting out good things itself. A chain of libraries, schools,\ncolleges, and universities, together with the various religious\norganizations, could establish the documentary film in mass communica¬\ntion. A chain of educational FM stations could put before the public\nthe best thought of America and could make many present radio pro-\ngrams look as silly as they are,\n..Ve cannot believe that non-profit institutions will continue to\nfail to grasp the opportunity they have before them...,It has always\nbeen clear that, as working hours diminished and leisure increased,\na responsibility devolved upon educators to help people make wise\nuse of their leisure. Now a new urgency is added to this duty. The\nworld seems on the brink of suicide, and the ultimate catastrophe can\nbe avoided only if the adult citizens of today can learn how-to live\ntogether in peace. It will not be enough to educate the rising\ngeneration; the time is too short.,..It is fortunate that, as their\ntask has grown greater and more pressing, technology has given them\nnew instruments of incredible range and power.\"\nAs against this, how insignificant are the current charges against educational\nradio — 1-The California broadcasters who still advance the arguments of 25 years\nago 2-In a sense, it is also an answer to ideas advanced recently by a trans¬\nmitter manufacturer for cheap transmitters, with very little power, allocating to\nthe college educational stations an area of five or six miles for their coverage.\nSome people just refuse to learn.\nMarch 31, 1947\nMorris S. Novik\nExecutive Secretary"
}