{
  "id": "d524-27",
  "text": "~Va efo-FCC-\nBefore the\nFEDERAL COMMUNICATIONS COMMISSION\nWashington £5, D. C*\nIn the Matter of\nAmendment of Sub-part C\nPart 3 of the Commission1s\nPules and Pegulations\n)\n)\n)\nOPDER\nPocket Hi\n84781\nPCC 48-1958\nLd\"UJ PM\n9048\nAt a session of the Federal Communications' Commission held at its\noffices in Washington, D. C#, on the 18th day of August, 1948;\nThe Commission having under consideration a. proposal to amend va-rious\nsections of Sub-part C of Part 3 of the Commissions Pules and Regulations\nrelating to non-commercial educational EM Broadcast stations; and\nIP APPEARING, That Notice of Proposed Rule Making setting forth the\nabove amendmentswas issued By the Commission on June 17, 1948, and was duly-\npublished in the Federal Register, which notice provided that interested parties\nmight file statements or Briefs with respect to the said amendment on or Before\nJuly 26, 1948; and\nIT FURTHER APPEARING, That the Commission has’ received. two. comments\nsupporting the adoption of the proposed amendment s in the form .presently .proposed,\nand one further comment pronosing that the Commission authorize non-profit\ncommercial operation of low-powered non-commercial educational Fid Broadcast\nstations;\nIT FURTHER APPEARING, That the above prnpra^l is Beyond the scope of the\nNotice of Proposed Rule Making which dealt only with amendments to the Rules\ndealing with engineering and related matters; and\nIT FURTHER APPEiiRING, That the abortion of the said amendment will\nmake possible the entry into the non-commercial educational FM broadcast field\nof many educational institutions which might not Be able to afford the\nconstruction and operation of high-powered stations;\nIT IS ORDERED, f That ..effective September 27.. 1948, Sub-part 0 of •\nPart 3 of the Commission’s Rules and Regulations IS AMENDED’ as set forth in the\nappendix attached hereto#\nFEDERAL COMhUNICATIOHS COMMIS SION\nReleased; August IS, 1948\nT* J* Slowio,\nSecretary"
}