{
  "id": "d524-38",
  "text": "rooms and equipment to produce a good, workable\nbuilding. In order to do this he must have a thor¬\nough understanding of the functions and the inter¬\nrelationship of the equipment as well as of the\nelements of the building. The engineer is interested\nin the technical requirements and auxiliary services\nfor the transmitter. The two must work together\nclosely to fit the plumbing, heating, structural, and\nelectrical features into a unified whole with the\ntransmitter services, or they will not produce a\nplant that really works.”\n3. Expert planning will save you money\nGood, workable buildings that provide your trans¬\nmitter with all of the services it needs are not neces¬\nsarily expensive, but they are necessarily well\nplanned from the beginning. With additional money\nyou can buy additional services and conveniences,\nbut a basically excellent building need cost no more,\nand indeed often costs less, than a badly designed,\npoorly constructed, expensive-to-operate building.\nGood planning saves money in several positive\nways: by preventing mistakes that are costly to rec¬\ntify ; by making efficient use of building materials in\na sensible, well-engineered building structure; by\narranging the building so that it is easy to maintain\nand operate. \"In the past many transmitter buildings\nsuffered from lack of advance planning,” says J. R.\nPoppele. \"The industry is now well aware of the\nimportance of careful layout and design.”\nB. CHOOSING A SITE\n1. Basic formula for site selection is signal\nstrength and coverage versus cost of\nland, construction and operation\nAdequate coverage is the first necessity for the\nsuccess of any broadcast station. With two or more\nsites to chose from, you can balance improved cover¬\nage against the factors listed below.\n2. Factors in site selection\nZoning Restrictions: Visit your municipal or coun¬\nty government early in your negotiations to find\nwhat building restrictions, if any, apply to the site.\nRoadways: Will you need additional roadways?\nHow much will they cost?\nWater: Is fresh water available? Must you sink a\nwell to unknown depths in search of water, with\npossibly very high costs?\nSewage: What provision must be made for sewage\ndisposal?\nPower: Will primary power be easy or difficult to\nbring in? What about an alternate source of primary\npower?\nProgram Circuits: What is necessary to bring in\nprogram circuits?\nDrainage: Unless your building is specifically\nadapted to a marshy site, does the land drain prop¬\nerly with the heaviest precipitation to be expected?\nSoil and Foundation Conditions: Are there any\nunusual conditions that will make construction diffi¬\ncult and costly? Will soil give the ground screen\nreasonable efficiency?\nTransmission Fine: Are there any problems in the\nproposed transmission line run, such as steep grades\nor soft ground?\nTowers: Is there a convenient location for the erec¬\ntion of your antenna towers? Check the Civil Aero¬\nnautics Authority for any restrictions on antenna\nheight at the site you are considering.\nAccessibility: Will the site have unusual construc¬\ntion and operation costs because of inaccessibility?\n3. How much land does a broadcast\nstation need ?\nFM stations will fit on a small tract of land because\nthey do not require acreage for an antenna ground\nsystem. Little more than the building plot, with\nparking area and appropriate landscaping, will ac¬\ncommodate the majority of FM stations, provided\nthe antenna tower can be erected on or near the\nbuilding. However, bear in mind the desirability of\nexercising control over property in the immediate\nvicinity of the tower in order to avoid the possi¬\nbility of future erection of a tall structure which\nmight adversely affect the propagation of your FM\nsignal.\nAM stations must have land for the antenna ground¬\ning area: 1 to 5 acres for non-directional antennas,\nforty or fifty acres for directional arrays involving\ntwo or more towers. If you are putting up an AM\nSeptember 1947\n7"
}