{
  "id": "d760-1",
  "text": "^v\\\nDear Mr. Skomias\n4\nTHE ESACGN press\nBoston 8S Massachusetts\nMay 13, 1954\nI promised to tell you if the State Department were to come through on the order for\n1800 copies of TIE JEFFERSON 1 All HERITAGE., They have! We are now going ahead with the\nproduction of a paperabound edition that we will make available to the x'ord Foundation\nand MSB at about one dollar. 1811 send you sample copies in a few weeks,\nlours cordiallyf\n/ s/ Melvin Arnold\nBrooklyn 17, New York\nMay 12, 1954\nWith very great regret I report no further progress on plans for the regional meeting*\nThis is a major reflection upon the regional director and a minor on© upon the region*\nThe final response to my letter of inquiry totaled twenty-five, eleven in this immediate\narea and fourteen from surrounding states, Of these twelve represented stations. The\ntotal number of letters sent out was sixty-three\nWhether the above response merits pursuing the regional rjsting Idea further is question¬\nably considering the cor es involved,\nThe chief handicap rests in my inability to get the time to push the project further\nboth as to hotel facilities and program, Working as I do for WNYE five days weekly and\nfor CBS every Sat; m a well ten up-guy by the end of w- ik Situ;* CAMERA.\nTHREE took the Peabody lie time and effort put upon that show *ach we ok has been re-\ntw pose: ' + s /hi . h •• ha m Lu»\nThe first is a one-day general meeting of the 1954 Convention Committee with the officers\nB Region 1 members\n'\npossibility would involve your sending Harold Hill her© to pick up the organization of\nthe regional meeting from my faltering hands-. That may seom either a brash or weak-\nminded suggestion, but it^s the only way I see of having a Region I meeting this year,\n!• m sorry to send in such a pessimistic reports but pressures being what they are, it*s\nthe best I can do*\nWith kindest regards.\ni/tt/ilW\nSincerely,\nJames F, Macandrew\nDirector of Broadcasting"
}