{
  "id": "d1487-1",
  "text": "' NAEB NEWS LETTER....AUGUST 1, 1940....Page S\nCOURT UPHOLDS USE OF RECORDS BT STATIONS\nIn New York, the U. S. Circuit Court of Appeals, in a far-reaching\ndecision, has ruled that radio stations are entitled to use phonograph\nrecords without the permission of the manufacturer or author of the\nrecord.\nThe National Association of Broadcasters took a silent part in the\ntest case initiated after the R.O.A. Manufacturing Company, Inc., and\nPaul Whiteman}, obtained an injunction against the V/.B.O. Broadcasting\nCorporation, operators of station W N E W. . The corporation was\nenjoined from using Whiteman recordings because the use allegedly\nviolated a ban on broadcasting which appeared on the face of the record\nR.O.A. and T/hiteman contended that broadcast of the recordings provided\ncompetition which was likely to reduce the demand IfrirorteipdL\npleying by the person or group whose work was recorded and that they\nshould be paid for the privilege of broadoasting the recordings.\nCol. Joseph H. Hartfield argued for the broadcasters that the radio\nstations were bound to pay only the regular copyright fees to the\ncomposer and publisher of recorded music.\nS! bSein&bloadcIsti^ewhiohdappearId o^the^acfof recordings had\nno legal effect.\ns&\nSfcyrs.irsis.vs esw\nflZ the American Society of Composers, Authors Md Publishers, mien\nmakes no distinction between recorded and live performances.\nWOBP PETITIONS DENIED\nThere is no statotory or cAer re^irement t- a^the^Federal^icati^^\nCommunications Commission withhold action o conBider such\nwhich it deems in the puM-ic lnterest “ apolications. So\napplication on a comparable basis with some pei s gtetion WCBD,\nthe Commission stated Kay B, of application by ^he\nChioago, for rehearing of the Sr0ht, * license for its station\nEvangelical Lutheran Synod for modification^of^ioe^^^^ ^ 83Q\nKFUO, Clayton, Mo., to charge AJ!local sunset at Denver, and a\npet it iorj6? o^r e turn^of°KDF0' s° sub sequent application to increase\npower to 5 KW as a Class IX station.\nCITIZENSHIP PROOF BEoplRED OF AIL RADIO, OPTOATORS\nProof of citizenship of about g®^°^P®nderTa Comission7order\nFederal Communications Commission is required unuer\nrecently announced."
}