{
  "id": "d1487-2",
  "text": "NAEB NEWS LETTER,...AUGUST 1, 1940....Page 3\nThis new requirement applies to amateur as well as commercial oper¬\nators, and calls upon them to file such proof in the form of affidavits,\nfingerprints, and photographs before August 15 next.\nThe Commission, which licensee citizens only for all classes of radio\nauthorizations, has heretofore depended upon the applicant1® own\nstatement as to that fact. It will henceforth require evidence of\ncitizenship on standard forms which the Commission is now sending out\nas a questionnaire.\nFCC ACTIONS\nWNAD, University of Oklahoma, wf?.s granted permission to remain silent\nduring August periods in order to observe vacation.\nWLBL, State of Wisconsin, was granted permission to operate specified\nhours, 8 a.m. to 4:15 p.m., pending completion of plans being made\nfor additional station personnel.\nWESG, Cornell University, has been given permission to move studio\nfrom Mark Twain Hotel, Elmira, N. Y., to Cornell campus.\nKWSC, State College of Washington, has been granted permission to\ninstall automatic frequency control apparatus.\nWKAR, Mlohigan State College, has applied for license to cover\nconstruction permit to install new equipment, changes in antenna\nsystem, increase in power, and to move transmitter.\nKFUO, Concordia Seminary, St. Louie, has applied for construction\npermission to install new transmitter and new vertical radiator and\nto increase power to 5 KW, day and night.\nY/BAA, Purdue University, was given permission to *****atival °D\nJuly 13th In order to broadcast the Purdue University Lusio Festi a .\nKUSD, University of South Dakota, was given remission to remain\nsilent from August 1 to September 15 in order to observe summer\nvacation.\nWSUI, University of Iowa, was given special 50 h°Ur8\nof operation in order to observe vacation period,\nSeptember 25.\nWLBL, State of Wisconsin, was given permission to remain silent on\nJuly 4th,. .' %.\nKFDY, South Dakota State College, was granted temporary authority to\nremain silent on July 4th.\nto 50 KW."
}