{
  "id": "d1098-7",
  "text": "MICHIGAN ETV\nTO SHARE CHANNEL\nEducational station WKAR-TV, Michigan State\nUniversity, awaits a final FCC decision awarding\nshared use of channel 10 to the university and the\nTelevision Corp. of Michigan, creating the nation’s\nfirst station combining educational and commercial\nTV on a split schedule basis.\nOn June 28 the ETV station suspended broad¬\ncasting on UHF channel 60, which it has used since\n1954. Application for the VHF channel has been in\na competitive hearing for over three years. The Com¬\nmission’s initial decision was in favor of Michigan\nState and its co-licensee, and a similar final decision\nis anticipated in the near future.\nAccording to Dr. Armand L. Hunter, director of\nWKAR-TV, the channel will operate as an edu¬\ncational station from 9:30 a.m. to 2 p.m. Monday\nthrough Saturday, from 6 to 7:30 p.m. Monday\nthrough Friday, and from noon to 4 p.m. on Sunday.\nTelevision Corp. will operate during the remainder\nof the broadcasting day as a commercial station, using\nseparate call letters.\ning the summer months.\nAdditional funds have come from New York sta¬\ntion WMCA, which contributed $5,000 last month,\nand from public donations totaling another $5,000,\na sum considered disappointing by Dr. Brown.\nAfter his original estimate that $200,000 would\nbe needed to keep META going, Dr. Brown said that\nre-evaluation of META’s needs resulted in an in¬\ncreased estimate. Despite total contributions of\n$102,000, he said that META still needs $200,000.\nTARIFF AMENDMENT\nPASSED\nSenate gave its vote of approval June 13 to the Eber-\nharter Bill permitting the importation of tapes and\nrecordings without duty when they are used for ed¬\nucational purposes.\nPassage of this bill will prove beneficial to edu¬\ncational broadcasters since it also provides free im¬\nportation for “. . . exposed or developed picture film\nfor the encouragement of the arts, science, or educa¬\ntion through broadcasting on a nonprofit basis\nThe House of Representatives passed the bill in Feb¬\nruary.\nMETA GETS GRANTS\nTOTALING $92,000\nTwo grants, one in the amount of $50,000 and another\nfor $42,000 have been received by META, the Metro¬\npolitan Educational Television Assn., in response to\nits emergency plea for financial assistance, according\nto a recent announcement by Dr. Alan Willard Brown,\npresident.\nThe $50,000 grant was made by the Avalon Foun¬\ndation, one of six philanthropic organizations that\nhelped build META last year, and the remaining\nsum represented an advance, from the ETRC against\ncontracts for the production of kinescope series dur¬\nP. I\nP. 20\nP. 20\nDIRECTORY CHANGES\nAssociates - 96\n(under CALIFORNIA)\nSan Diego State College\nAdd: Mr. Frank W. Norwood\nAssociate Professor\nSpeech Arts\nSan Diego State College\nSan Diego 15, California\nJUniper 2-4411, Ext. 255\nSan Jose State College\nAdd: Frank McCann\nAssistant Professor\nDept. Speech and Drama\nSan Jose State College\nSan Jose, California\nCYpress 4-6414\nNEWS OF MEMBERS\nGENERAL\nJuly was proclaimed “WCET Month” by Cincinnati,\nOhio’s Mayor Donald E. Clancy, who called on the\ncity to help “the nation’s first licensed educational\nTV station” celebrate its fourth birthday.\nWCET went on the air July 26, 1954, with a non¬\ncommercial license. It is owned and operated by 52\nvoting member school systems, colleges and univer¬\nsities which provide the station’s primary source of\nsupport.\nDuring the past year, WCET had a weekly audi¬\nence of 35,000 children in 350 schools. It is estimated\nthat 30,000 homes are now equipped to watch\nWCET’s educational and cultural programs.\ny WBGO, Newark, N. J., sends its thanks to NAEB\nmembers who sent letters, telegrams and tape re¬\ncorded greetings for a program celebrating its 10th\nanniversary. In a successful effort to make Newark\naware of the progress made in educational broadcast¬\ning, WBGO utilized the 44 messages received in a\nspecial program emphasizing the idea that broad¬\ncasting is an accepted facet of education all over the\nUnited States and in foreign countries.\n^ In another effort to gain public support for edu¬\ncational broadcasting, WEDU-TV, Tampa, Fla., and\nmany other stations sent letters to people in their\ncoverage areas urging them to write their House\nNEWSLETTER"
}