{
  "id": "d1098-8",
  "text": "representatives to secure passage of the Magnuson\nbill. This bill (S. 2119), which was passed by the\nSenate in May, grants up to $1 million to each state\nfor ETV.\nPROGRAMS\n^ For the first time in the history of the Boston\nArts Festival, regular live television coverage of the\nevent was provided by WGBH-TV, Boston’s ETV\nstation. From June 8-22 the station circulated its\ncameras through the city’s Public Gardens five eve¬\nnings of the week covering events and exhibitions\nsuch as ballet, jazz, opera, folk dance, painting,\narchitecture, poetry, photography, handmade art,\nand a symphony concert.\n^ The ETRC has selected a series of the George\nWashington University world affairs program. “The\nOther Two Billion,” for kinescoped distribution. This\nseries consists of 15 programs under the specific title,\n“Millions Doomed to Die,” and investigates the\nworld-wide problem of health with featured guest\nexperts.\nPERSONNEL\n^ Robert J. Coleman, one of the radio industry’s\npioneer broadcasters, retires this month after 24\nyears of service to Michigan State University as man¬\nager of WKAR and WKAR-FM. He will, however,\ncontinue his duties as NAEB Treasurer and will serve\nas consultant to broadcast organizations and radio\nstations.\nOver eighty-five friends and associates, includ¬\ning university notables and former station employees,\ngathered last month for a testimonial dinner to honor\nColeman. He was also recently named' Wayne State\nUniversity’s “Broadcaster of the Year.”\n^ Operations of Michigan State University stations\nWKAR-TV and WKAR-radio combine this month\ninto a Radio-Television Department. Dr. Armand L.\nHunter, director of the television station, will head\nthe new department as Director of Broadcasting.\nServing as manager of the radio station in the new\ndepartment is Lawrence T. Frymire, who has been as¬\nsistant director of WKAR-radio since 1952.\n^ The ETRC has elected Nobel Prize winning\nscientist Glenn T. Seaborg to its board of directors\nto assist the Center’s efforts in science programming.\nA strong supporter of ETV for solving today’s educa¬\ntional problems, Dr. Seaborg is a professor of chemis¬\ntry and director of nuclear chemistry research at\nthe University of California, Berkeley.\n^ John C. Crabbe, director of radio and television\nat College of the Pacific, has been appointed general\nmanager of Channel 6, contemplated ETV station of\nthe Central California ETV Corp. Announcement of\nthe appointment was made by Dr. Nolan D. Pulliam,\npresident of the corporation board of directors.\nCrabbe has served as executive secretary of the\ncorporation since last December and directed a fund\ndrive this spring to raise funds for the construction\nand operation of the channel. Crabbe is also past\npresident of the National Assn, for Education by\nRadio and Television.\nPLACEMENT SUPPLEMENT\nJuly I - Ph.D. candidate with M.A. in audio-visual materials\ndesires a position in educational broadcasting as a writer\nor script editor. Author of 34 film scripts; magazine articles\npublished. Single man, 30. Location open. $4,000 minimum.\nJuly 2 - Man, 28, single, wants a producing or directing position\nin ETV. Has had 3 years in TV broadcasting (I in ETV) and\nsome work in radio. Also experience in teaching produc¬\ntion courses. B.A. in radio-TV. Location open. $5,000 mini¬\nmum.\nJuly 3 - Position wanted: to direct and/or produce ETV pro¬\ngrams. Single man, 28, with a primary interest in film work\nhas I year commercial experience, M.A. in TV production,\nand experience in 16mm film production which encompasses\nthe operation of the Cine Special, Bolex, Auricon, and\nMauer cameras to the editing of programs. Prefers Mid¬\nwest, West, or Northwest. Salary open.\nJuly 4 - Man who has installed, programmed, and now operates\na successful educational FM station for a midwestern uni¬\nversity, is interested in management, programming, pro¬\nduction, or teaching position. Will establish FM station\nfor college or university. Married, 36, B.A., with 5 year;\nexperience in commercial radio and 5 years educational\nradio and teaching. Location open. $8,000 minimum.\nJuly 5 - Young man with solid experience and training seeks a\nposition as an ETV Art Director. Background includes work\nin television, theatre and display; a graduate of one of\nthe largest design schools in the country. Married, 26.\nPrefers Midwest. $5,200.\nJuly 6 - Married man, 25, August candidate for M.A., desires\na position in ETV production with a supervisory or directing\ncapacity as an eventual goal. Qualified in all phases of TV\nand 16mm film production including directing, lighting and\nstaging. Experience in supervision and administration. Will¬\ning to teach in conjunction with a production position.\nLocation open. $4,500 minimum.\nJuly 7 - Director-production manager-writer with 3 years tele¬\ncasting experience including in-school and closed circuit\nseeks position in a metropolitan area. Also fully versed in\n250 watt radio operation. Creative, versatile, award win¬\nner in production, budget conscious. Veteran, 27, single,\ncandidate for M.S. in Communication Arts. Location open.\n$4,400 - 5,700.\nJuly 8 - Experienced film producer seeks work in ETV, looking\nfor challenging job in writing, directing, camera work or\nediting. Has done work in U. S. and abroad in documentary\nand educational film production. Has personal 16mm pro¬\nduction equipment. Graduate work and college teaching in\nsociology and anthropology. Will submit films with \"pro¬\nducer\" credit; also highest references. Single veteran, 29,\nB.A. Location open. $4,500.\nJuly 9 - Single young man, 20, with B.A. in radio-TV is looking\nfor a future in educational broadcasting. Fifteen months\nexperience; good knowledge of serious music; also strong\non news and special events. News and announcing back¬\nground in radio; TV experience as audio director, camera¬\nman, etc. Efficient, ambitious, dependable. Location open.\n$3,500.\nJULY, 1958\n9"
}