{
  "id": "d1331-4",
  "text": "SHORT SIGNALS FROM THE FIELD\nWOI - Iowa State College. W.I, Griffith, Director, says: \"Again this year;\nfor the 7th year, MOI is broadcasting the Iowa state high school basket ball tourn¬\nament. Nino games are being handled, coming by remote from the Drake University\nfield house in Dcs Moines,\"\nBccauso the logical N.B.C. station to roach Iowa failed to carry the National\nAdvisory Council’s series \"The Constitution in the 20th Century,\" WOI is receiving\nmanuscripts of the talks and presenting them at 2:45 on Friday afternoons. Director\nGriffith reports that the schedule was sent to all high school teachers and that\nmany arc using the program as a part of their class work,\nA.G, (Andy) Woolfrics has sent out nearly 5000 copies of a music chart to am¬\nplify his courses in Music Appreciation, A copy is included in the Packet this\nmonth,\nWRUF - University of Florida, Garland Powell, director, writes: \"You might bo\ninterested to note that v,kUF the year around averages twelve and a half hours a day.\nBetween thirty-nine and forty per cent of our time is utilized for educational\n^broadcasts. When wo say educational broadcasts, we do not moan the University of\nFlorida band, the glee club, or tho orchestra. Each Sunday evening the Florida\nMedical Association presents a fifteen minute talk on some phase of health. These\narc tremendously valuable to tho people generally, Tho Florida Dental association\nlikewise presents a fifteen minute talk ovoiy Sunday afternoon on the care of tho\nmouth and teeth, Tho University of Florida presonts every Wednesday evening in\ncooperation with tho Parent-Teachers Association a scries of lectures on parent\neducation and child welfare.\nWBAA - Purdue, Diroctor Clarence Damman reports the installation of a lino\nand pick-up equipment in tho local high school.\nWOSU - Ohio State, William Friel Heimlich, diroctor of dramatics, is develop¬\ning the \"Ohio Theat re of tho Air.\" It \"will be instrumental in stimulating interest\nin radio dramatics, script writing, and the preparation of continuities within tho\nvarious educational institutions.\" If you are interested in tho dotails of tho or¬\nganization, write Mr. Heimlich for a copy of the charter. In May WOSU will sponsor\nthe Fourth Annual Radio Play tournament for Ohio Colleges.\nWILL - University of Illinois. Jos. F, Wright reports a new series \"Around\ntho world\" in which \"foreign students tell of their home life as well as their\nnative country, educational facilities of their native lands and somethin.g of what\nthey think of America and the educational institutions here,\"\nWSAJ - Grove City (Penn,) College. Director H,W. Harmon reports that his sta¬\ntion broadcasts college chapel services, athletic contests and other features from\ntho campus. Special events are comiaomorated by broadcasts. Students find radio an\ninteresting activity.\nKUSD - University of South Dakota. \"KUSD has little to report, but wo have\nnever 'been going as well\" before as we are at this time,\" reports Director B.B.\nBrackett. (Who says that isn’t something to report?) \"Our broadcasts have more sub¬\nstantial talks and lectures than at any previous time during tho life of tho station.\nWo have added a new mixing and volume control panol in our now studios. Wo also\nhave a now cathode ray oscillograph. We give talks that contain valuable information\nand at the same time are onterto.ining. They are varied and on subjects that repres¬\nent different departments of the university. Thomusic presented is good and well\nexecuted, but not of too high a character to be enjoyed by any listener with average\ngeneral culture.\""
}