{
  "id": "d1331-5",
  "text": "-6*\nKOAC - Oregon State Agricultural College# After saying \"May I express ny per-\nsonal appreciation for the Packet and News-Letter service of NASB• I think it’s\ngrand,” Joo M, Morris, acting manager of this station sends those notes.\n1. The staff of KOAC is looking forward to April when Manager Luke L. Roberts,\nreturns after an absence since mid-December. Ho has boon in Now York City on a\nthroe months1 fellowship to the studios of the Columbia Broadcasting System, from\nthe Rockefeller Foundation. He will bring to KOAC the latest ideas in broadcasting\nas practiced by CBS,\n2. ICOAC’s School of tho Air is making rapid advancement under Alexander Hull,\nnew to tho staff this year, as Director of School Broadcasts. Tho second series of\nvery successful dramatic programs has just been concluded, with a third scheduled\nto open tho last week of March undor the program title \"The Magic Casement.n The\nseries will feature dramatizations of famous children*s stories as prepared for\nbroadcast by students in tho Radio Speech Class at Oregon State College, Certain\nfeatures from the school broadcasts including those dramatizations are being re-\nbroadcast in Portland, Oregon, by Station KBPS.\n3. The rapid advance in KOAC’s listening audience is shown for 1935-36 by the\nradio clubs organizod throughout tho state of Oregon. Reaching a \"now high\" of 56\nclubs, with a total enrollment of 664 womon, those organizations tunc in each Tues¬\nday afternoon for lectures centering around the theme \"is My Child Growing Up?\"\nThrough tho medium of transcriptions made at KOAC, tho lectures are used by several\nf|f Oregon’s smaller stations in remote parts of the state* resulting in increased\ninterest in tho state-owned station and its educational service.\n4. On May 20th, 1936, between 9:30 and 10:30 PST, KOAC will release to the\nnation over tho NBC network, tho Land Grant College Program of tho United States\nDepartment of Agriculture, featuring on that day Oregon State College. C.R. Briggs,\nDirector of Farm Programs at KOAC, is in charge of preparations for tho broadcast.\nWSUI - State University of Iowa. Carl Menzor reports:\nWo have throe new foaturos which have proven popular; they arc: First, Tho Daily\nIowan of the Air, a news broadcast presented daily at 5:45 p.m. Tho organization of\nthis feature is under tho direction of the School of Journalism and is much tho same\nas the daily newspapor, tho \"Daily Iowan.\" Tho organization includes a radio editor,\nradio reporters, radio rewriters, radio commentators, etc. Students arc taught to\nedit news for radio and receive credit for this work.\nSecond, Magazine of tho Air, vdiich is arranged and presented by the editor and\nstaff of \"American Prefaces,\" a now magazine for young writers^\nThird, Woodland Rambler, a program cooperating with the Iowa State Conservation\nCommission and presenting nows of interest to those who enjoy outdoor and wild-life\nactivities.\nRecently, this station has installed two new Western Electric, non-diroctional,\ndynamic \"Eight-ball\" microphones. Those are very useful for group broadcasts.\nOther new equipment includes three velocity microphones with associated amplifiers\nand mixers designed especially for remote pickups.\"\nCarl’s new bulletins arc included in the Packet.\nWCAL - St. Olaf College. M.C, Jenson says \"I imagine by this time that you think\nwo have'all died up hero• Such, however, is not the case. We are still alive and\nkicking, mostly kicking.\" His program includes notable musical offerings (wo all\nknow of St. Olaf’s reputation in that field) and other interesting features."
}