{
  "id": "d43-32",
  "text": "FOR RELEASE Thursday, June 4, 1953\nJOINT COMMITTEE ON EDUCATIONAL TELEVISION\ni 1785 Massachusetts Avenue, N.W.\nWashington 6, D. C.\nPhone: HUdson 3-6620\nRalph Steetle, Executive Director\nJCET EXPRESES APPRECIATION FOR COMMERCIAL BROADCASTERS * COOPERATION\nWashington, D. C., June 4, 1953 - In a letter dated today, addressed to Harold E. Fellows,\nPresident of the National Association of Radio and Television Broadcasters, Ralph Steetle,\nJCET Executive Director, expressed appreciation to the many commercial broadcasters who have\n\"generously given of their time, facilities and money to help establish educational tele¬\nvision stations.\"\nThe letter, which also commended the NARTB for its efforts in the total development\nof American television, was the result of formal action taken by the JCET during its\nregular meeting yesterday.\nCommenting on the speed with which broadcasters had moved into the field since the\nlifting of the FCC \"freeze\", Steetle noted that commercial stations now on the air total\n189, that construction permits had already been granted for more than 350 additional\nstations and that some 250 applications are pending before the FCC.\n\"All of this\", stated Steetle, \"is a real tribute to American initiative and enterprise.\"\nSteetle also pointed to the participation of educators in the television development\nof the nation *>* 47 applications filed for educational television channels (over 20$ of the\ntotal number of reserved for educational use) and 17 construction permits granted. One\neducational station, KUHT, Houston, Texas, is already on the air and several others are\nexpected to begin operation soon.\nThe great majority of applications filed for educational channels, according to Steetle,\n\"show solid financial and community support.\" Many applications describe generous offers\nof assistance by commercial interests. In Birmingham, Alabama, for instance, Storer\nBroadcasting Company has offered to provide a complete transmitter and antenna. Other\napplicants report offers of other types of equipment and cash donations.\nIt is in response to these specific examples of contributions on the part of commercial\nbroadcasters to the development of educational television that the JCET letter of appreciation\nwas written."
}