{
  "id": "d43-6",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nJanuary 13, 19S3\nLor. Wilbur Schramm\nSean, Division of Communications\nUniversity of Illinois\nUrbana, Illinois\nDear Wilbur i\nFirst may I say it was indeed a great pleasure to see\nyou again and to visit in your home* I appreciate most profoundly\nthe opportunity of talking over our NAEB problems with you and\nvalue more than I can say the advice and reactions from you.\nOne of the problems which we did not finally settle\nwas the arrangement for Frank *s time between now and June 1 in\nthe capacity of Executive Director. Frank and I discussed this\nat some length but we did not arrive at any conclusion* I\nsuggested that you keep him on in his full capacity with the\nUniversity of Illinois and that HAEB contribute rather generously\nto him for his time* This would enable him to pick up some\nadditional money tfiich may in small measure pay him for the many\nyears of conscientious service he has given this organization*\nWe both know that Frank will give full measure to his job with\nthe University of Illinois and to the HAEB and I feel that he\nshould be amply rewarded for the extra energy and time he will\ngive* Frank had a definite idea of how the arrangement should\nbe made and proposed that the approximately 8QjC of his salary\nhe is now receiving for the station supervision be turned back\nto the University of Illinois for this interim period*\nMy only concern is that Frank be well taken care of\nfor this job* With this in mind, will you please make whatever\narrangements you and Frank think advisable and best and let me\nknow directly or through Frank what the plan is. I will then\nsubmit this to the Board for approval. Incidentally, I can see\nno reason why we should designate Frank as Acting or Interim\nExecutive Director but simply add Executive Director to his\ntitle of Treasurer for the organization fbr this period.\nlou will recall that we asked Jim to go ahead with\npollli^: together our thinking on the type of training which\nmight be needed to supplement the training now being afforded\nthrough the scholar di ips, fellowships, and internships program*\nI am sure he will carry you along with him as he shapes up any\npirns for an expansion of the current program and that you in\nturn will advise me of the most satisfactory way of proceeding"
}