{
  "id": "d43-62",
  "text": "October 5, 1953\nj\nSeymour N. Siegel, President\nNational Association of Educational Broadcasters\nBoom 2500, Municipal Building\nNew York 7, New York\nDear Mr. Siegels\nIn my telegram of Wednesday I said I would send you details of the\nclosed meeting at the Pentagon in Washington on October 20th.\nThe session will be briefed by high government officials on con¬\nditions in the strategic satellite countries behind the Iron Curtain. The\nprogram and methods of operation of Radio Free Europe, which broadcasts\npractically around the clock to this critical area, will be presented, as\nwell as other activities of the National Committee for a Free Europe. This\nsession has been arranged at the suggestion of President Eisenhower to give\noutstanding leaders of American life a close look at this situation and what\nis being done to bring the truth to the captive peoples of Europe, sustain\ntheir hope and strengthen their will to resist Communist domination.\nIn addition, plans will be discussed for the forthcoming educational\nand fund-raising programs of the Crusade for Freedom, a project of the American\nHeritage Foundation, in which we hope to have your participation and assistance.\nIt is hoped thafc you will make every effort to attend this afternoon\nsession and the dinner the following evening at the Mayflower Hotel where we will\nbe addressed by the Hon, Walter Bedell Smith, Under Secretary of State and former¬\nly our Ambassador in Moscow; by Walter Reuther, President of the CIO, and others.\nIt would be appreciated if you will fill out and mail the enclosed\ninformation card. Also enclosed is our tentative program.\nThis letter will assure admission to the Pentagon meeting.\nSincerely,\nEnel-2\nHFIIjvw Chairman 6% the Board\nBoard of Trustees: William D. Askren Barney Balaban Chester I. Barnard Don Belding fames G. Blaine Harold W. Brightman\nThomas D'A. Brophy Leo Burnett Tom C. Clark Henry L. Corbett John Cowles William W. Crocker John W. Davis Henry Ford II\nFord C. Frick Eric Johnston Robert Lehman Henry R. Luce Charles Luckman John L. McCaffrey Timothy A. Mclnerny\nGeorge Meany Harvey S. Mudd Earl Newsom Louis A. Novins Irving S. Olds Arthur W. Page Mrs. Robert P. Patterson\nSamuel F. Pryor Walter P. Reuther Edward L. Ryerson David Samoff Paul R. Scott McGregor Smith Robert G. Sprout\nNiles Trammell Frank C. Walker DeWitt Wallace Thos. J. Watson Edwin L.Weisl Charles E. Wilson Robert E. Wilson"
}