{
  "id": "d1541-6",
  "text": "sion sets in the state’s public schools primarily used\nfor viewing in-school Alabama ETV network tele-\ncasts. In comparison to last year’s survey, a signifi¬\ncant trend towards an increased addition of ETV to\nclassroom teaching is noted, with the largest degree\nof in-school TV being used in high schools and the\nelementary grades than in junior high schools.\nThe majority of schools have one TV set, reports\nthe Commission, but eight schools are registered\nhaving five or more sets. In some rural areas where\na school wants ETV in its course of study but are\nwithout a set, specific classes visit a neighboring\nhome to follow TV lessons.\nIn issuing the survey, Alabama ETV Commission\nManager Raymond Hurlbert called attention to the\nspeed of development and acceptance of the network.\nThe system, which is barely three years old, has or¬\nganized its network of three stations and has extend¬\ned its in-school telecasts to a total of 25 hours per\nweek.\nPROGRAMS\n► Production has recently been completed by\nWSFU-FM, Tallahassee, on seven half-hour programs\ndocumenting the question: What are our prisons for?\nThe new series, “Prison Document,” explores the\ncountry’s penitentiaries for current attitudes and\npractices in state penal institutions.\nThe programs concern the historical development\nof prisons, the mechanics of day-to-day life in prison,\nand reforms made in the system in areas of rehabili¬\ntation and discipline. The series was produced under\nan ETRC-NAEB grant and is distributed by NAEB.\n► A series describing the growth and effect of na¬\ntionalist spirit in Africa, Eastern Europe and the\nOrient features actual recordings of Nikolay Lenin,\nIndonesian President Sukarno and Ramon Magsay-\nsay. Titled “One Nation Indivisible,” the 13-program\nseries has been in production for a full year at the\nUniversity of Michigan Broadcasting Service.\nOpening broadcasts were given last month on\nWUOM, Ann Arbor, and WFUM, Flint. The pro¬\ngrams utilize on-the-spot recordings from several\nforeign broadcasting services and dramatize sequences\nof events in the development of nationalism.\nThe series will be distributed this month by the\nNAEB network. Programs were written by Edwin\nG. Burrows, assistant director of the U-M Broadcast¬\ning Service, and directed by William Stegath under\n^ a grant-in-aid of the ETRC and NAEB.\n^ The structure of twentieth century thought as it\napplies to man in religion, literature, politics, science,\nand economics, is the theme of a new TV series called\n“Dialogue,” produced by META and Columbia Uni¬\nversity for the ETRC. The program is designed to\nexamine the “modern turn of mind” as it appears in\nintellectual patterns of modern civilization.\nThe first segment of the series went into produc¬\ntion March 18, giving three half-hour dialogues on\nThe Literary Man by outstanding faculty members\nof Columbia University. Subsequent portions of the\nseries will feature similar dialogues on man and his\nrelationship to the other topics.\n^ New Yorkers possibly saw the first televised\ncourse in the Russian language on WRGB, but view¬\ners of WTVS in Detroit were running a close second.\nWRGB initiated its series on the morning of Feb. 4,\nwith WTVS beginning its evening 20-week Russian\nsurvey on the same day.\nThe Wayne State University series on WTVS\nfeatures Dr. Harry Josselson, head of the university’s\nSlavic Department, for instruction in Russian. Each\nprogram is divided into three parts—a general des¬\ncription of the Soviet and its culture, lessons on the\nstructure of the Russian language, and phrases deal¬\ning with daily life in the country.\nThe series is aimed at stimulating enough interest\nin Russian so that the average person might continue\nwith a more intensive study of the language. Dr.\nJosselson says, “I am convinced we can teach A-\nmericans Russian as well as they can teach Russians\nEnglish.”\n► “The Count Down,” a special half-hour documen¬\ntary on disarmament, has been produced by United\nNations Television for the affiliated stations of the\nETRC. The program traces the devastation and hor¬\nror of World Wars I and II through authentic films\nof bombings and battles.\nActor-director Peter Ustinov narrates the pro¬\ngram, weighing various plans and proposals by East\nand West for disarmament. Heated UN meetings on\nthe subject and debates by representatives from both\nsides of the Iron Curtain are shown. The program in¬\ncludes in its scope discussion of the arms race among\nnations including information on late advances in\nmissiles and satellites.\n^ The first weekly program of a WGBH-TV series,\n“Camera on the Commonwealth,” featured Gov.\nFoster Furcolo in a visit to his office. The Boston sta¬\ntion started its new 12-week series March 18 with\nAssoc. Prof. George D. Blackwood of Boston Uni¬\nversity as host.\nIn succeeding weeks other state officials and per¬\nsonnel will describe their jobs to viewers and show\nhow the state government functions. The series will\nAPRIL, 1958\n7"
}