{
  "id": "d1102-11",
  "text": "-12-\nNSU APPOINTMENTS TO \"VOICE OF AMERICA\" . *\nCharles V. Thayer, Villanova, Pennsylvania, has been appointed Acting\nChief of the International Broadcasting Division of the Office of Information\nand Educational Exchange in the Department of State, Thayer will succeed\nKenneth Fry who resigned effective January 16, to return to private \"business.\nLeland Barrows, Hutchinson, Kansas, was named Deputy Director of the OIE\nto succeed G. Stewart Brown who resigned effective January 9 to \"become head\nof the public relations division for the Standard Oil Company in California.\nThayer is an expert on Soviet affairs and supervised the State Department’s\n\"broadcasts to Russia. He is a graduate of Vest Point and joined the foreign\nservice in 1933. He speaks several languages and spent 5 years in Russia\nEX-BBC OFFICIAL JO IDT SALT DIES\nJohn Salt, former North American director of the British Broadcasting\nCorporation died suddenly at his home in Manchester, England, December 27.\nA veteran radio executive in the United Kingdom, Salt joined the BBC in 1936\nand was a director in his home region until 1939. From 1940 to 1942 he was\ndirector of the European service of B3C and served in the United States in a\nsimilar capacity until 1945.\nTEKPL3 UNIVERSITY RADIO TTQ?rSF0P\nTemple University, Philadelphia, Pennsylvania, begins Radio Workshop\nactivities January 22. Armand Hunter, former radio instructor in Northwestern\nUniversity's Department of Journalism and now director of Radio at Temple U\nannounced Ira Marion, ABC staff writer, will begin instructing an advanced *\ncourse in radio writing for the University,\n83p of U.S. FARMS HATE RADIOS\nBAE (Bureau of Agricultural Economics, U. S. Department of Agriculture)\nhas just released a report on a sampling survey made in July (1947) showing\n—^ per cent of farms in the U.S- have radios in working order,\nAccording to U.S. census reports, the percentage of radios on farms has\nincreased in the following order;\n1930 — 30^ 1945 75$\n1940 — 60£ 1947 -r- 83f>\nThe range of distribution is from 66 percent in Mississippi to 9&p in\nWashington.\nN-A-E-B members in every state are finding, unless their station coverage\nis exclusively metropolitan, t.iat the rural audience, both farm and non—farm,\ncannot be neglected as a program and audience factor. The largest cluster of\nAM stations is in the central or \"heart\" states where the bulk of the\nnation's agricultural cash crops are produced. These same N-A-E-B stations\nfind tha/t serving a rural audience means meeting a cultural demand as well as\nproviding farm and market news."
}