{
  "id": "d1102-14",
  "text": "KIETS FOP THE PROGRAM i-IMAGER\nSHOE FOE :AT\nEAB does a deft public service show Sundays at 1:00 p.m. (AMERICA TJ1TITED),\nComing programs will utilize 5 national organizations representing labor,\nmanagement, and agriculture. American Farm Bureau Federation has 10 programs;\nAFL, 13; Fational Grange, 10; CIO, 13; and U.S. Chamber of Commerce, 6.\nTPAESCP.IPTIOES\nThe third annual series of transcribed dramatizations by the national\nTuberculosis Association is now ready for release. The 1948 series features\nHerbert Marshall as narrator; Hu Chain is the author-producer, and Ben Ludlow\ncomposed and directed the original music. Title: \"Constant Invader.\"\nTB Association distributes platters through state organizations, wants to be¬\ngin airing February 1. Contact your local TB Association Chairman or your\nState Director. Transcriptions are without cost to the station.\nFRENCH EETUOPK\nThe North American Service of the French Broadcasting Company explains recent\ndelays in the distribution of their transcribed programs arise from difficulties\nraised by the U.S. Customs Office, Apparently objection is voiced by TT.S.\nCustoms in connection with importation into U.S. of French-originated master\nrecords.\nHOPE TPiilT S CP. IPTI OH S\nThe Institute for Democratic Education, producers of the splendid series, \"Lest\nUe Forget,\" is releasing a new sequence of programs under the title, \"Stories\nto Remember.\" The current productions will be the 12th series of \"Lest Ue For¬\nget\" presentations and will consist of radio adaptations of stories written by\nKacEinley Eantor, Irwin Shaw, Dorothy Canfield Fisher, Claudia Cranston. Carl\nEwald, and B, J. Shute. The series is designed to remind Americans that pre¬\njudice and discrimination have no place in a democracy. Transcriptions will be\navailable, free of charge this spring. A good bet for a good schedule spot.\nSTILL HOKE TRAESCRIPTIOES\nThe National Foundation for Infantile Paralysis is distributing a single 15-\nminute platter for use in plugging the 10th anniversary drive of the foundation\nfor funds. Title: \"Saturday Eight Party.\" E-A-E-B Headquarters will appreciate\nprogram’ director’s comment on this show.\nPT’BL IC SUPUIC3 T U TK 3ACE30UE\nListen to \"Meet the Press\" on Mutual Broadcasting System, Friday nights at\n10:00 p.m. (Eastern Standard Time), This is Edgar Eobak’s (MBS President)\nidea of technique for doing what many radio forum formats try to do and don’t.\nBig need for most educational, non-commercial public service stations is more\nproduction \"know-how.\" Here’s a good sample.\nFEAT’S YQTJR 3MB I'DEE?\nEon-commercial, educational stations can get special rates on BMB maps and\ncoverage index. For information on costs and availability write Hugh Feltis,\nPresident, Broadcast Measurement Bureau, Hew York City."
}