{
  "id": "d1102-15",
  "text": "16\nIndiana University News-Letter\nbetter things. We must seek to profit by war experiences which\nhave shown both weaknesses and strengths in our educational pro¬\ngram; but we shall need to keep an even keel in the midst of\ninsistent demands for departures into the fields of new courses, new\nmethods of teaching, new policies and programs, and even new\neducational goals.\nSome of the above demands will prove reasonable and practical.\nThey should be and will be met.\nAn immediate task, increasingly important, and already im¬\npending is that of meeting the needs of returning veterans. Whatever\nthe needs and whatever the cost, this group must have special\nattention and be adequately provided for, in partial compensation\nfor the sacrifices they have made.\nImmediately after* the war also, the University will face a\ntwofold problem with other groups: First, that of handling students\nwhose normal course in education has not been interrupted; and,\nsecond, that of taking care of the large numbers whose school\ncareer has been broken into and who will have to take up their\neducational work anew. There will therefore be need for rapid\nextension of educational facilities and personnel to provide for a\npredicted large increase in attendance on the campus and for a\ncontinuous state-wide adult educational program. Also, because of\na serious shortage of public school teachers in numerous fields, it\nwill be necessary to expand the teacher-training program both in\nnumber and types of courses and in the number of centers where\nthe training may be given.\nOne of our more fundamental problems is the enlargement of\nour concept of education. Not just any kind of education will\ndo. We need an education which will develop all the individual’s\ncapacities and integrate all his activities; an education which will\nintegrate also all social activities; for true education is a force\nwhich furnishes the light and the leadership both to see and to\nimprove social conditions. In turn the improved, advanced social\nconditions form a new level and new springboard from which\nleadership may again advance society to better things. This cycle\ncontinues through the generations and demonstrates the lifting\ncultural power of a sound education.\nIn education, as in industry, we shall have to face the problem\nof conversion. Perhaps in some cases we may need to convert\nfrom factory methods tendencies, and from a trend to bring off our\nassembly lines regimented automatons-—to the more intensive and"
}