{
  "id": "d1102-15",
  "text": "SATURDAY EVEITIITG POST PUBLICIZES REGIQEAL PADIO PROGRAMMING\nRegional programing to keep American radio on it's toes is advocated in\nthe January 10th Saturday Evening Post by Paul Schubert, Mutual network news\ncommentator, in discussing a 30,000-mile tour which took him into 44 of the 48\nUnited States,\n\"I wish the city of St, Louis could he handed the challenge of entertaining\nthe United States for a week, and after that Seattle, and after that Atlanta,\nand on around the nation,11 Mr. Schubert writes. u're might hear some mediocre\nstuff, but we get that anyway, I believe the mediocre would be far outbalanced\nby a wealth of new ideas and performers as local talent rose to the big occasion..\nRegions'Coincide with Time Zones\n\"national programs are, of course, important. I am net sure, however, that\nAmerican radio would not be greatly improved if we could change over to a much\ngreater proportion to regional programing....11\n\"The great American regions coincide more or less naturally with the Ameri¬\ncan time zones,..Personally, I think the greater bulk of each zone’s entertain¬\nment and news should originate specifically for that zone. I think the Middle\nUe.st is just as capable of originating its own entertainment as are Hollywood\nand Hew York - perhaps more so. I think the Mountain States would rise to the\noccasion with special verve.,,\n\"Top flight artists will always be heard nationally. But I suggest that we\nwould all benefit if radio would develop regional opportunity for new talent...\nAt the moment, almost the only way for a gifted entertainer to work into the\nevening hours .is to go on as a stooge for one of the big names, where his or her\ntalents are usually devoted to helping the star’sjxever-ending buildup,.#\nDivide Up the Talent Money\n\"I would like to see talent money divided up and used to originate four...\nregional network shows..,I would like to see each regional show run thirteen weeks\nand then switch to another region. Pour times a year the listener would have a\nfresh cast competing for his listening pleasure., ..The artist would need to pro¬\nduce only thirteen weeks of new shows every year(which) would lift the level\nenormously..*\nMany American Radio Faults Prom network Operation\n\"All this would disrupt the radio industry as it now exists. And perhaps\nit is too much to expect any radical change...\"\nHr. Schubert criticizes \"tired and jaded\" disk jockeys, saying the only one\nin the United States he enjoyed listening to was broadcast from a Fashville,\nTenn., station* There are too many formula soap operas, he declares, not enough\ngood sports broadcasts, and radio news commentators are out of touch with the\nsignificant story of the United States, He regrets that big-name talent has\nacquired \"what amounts to a vested interest in the evening ether.\"\n\"A great many of the faults of'.American radio are the direct result of\nnational network operation, with headquarters in Hew York and Hollywood,\"\nHr. Schubert says. \"At present, almost all network shows are built on the\nresources of those two cities, which, though considerable, are only a fraction\nof our real talent,\""
}