{
  "id": "d1102-17",
  "text": "18\nIndiana University News-Letter\nstrength by which to hold fast. It is the knowledge of the way and\nthe wisdom to walk in that way. Some day we shall learn that a\nsound education is as essential as food and clothing and shelter;\nthat the cost of ignorance is far higher than the cost of education;\nthat the ignorant, untrained, and unmotivated man is doomed to\ntake the low road that leads to low values, while the educated,\ntrained, and inspired man may take the high road to freedom and\nrichness of attainment.\nIndiana is going forward in the conviction that with deal\nvision, proper procedures, wholesome incentives, and a truly co¬\noperative spirit it is not only possible to reach higher goals but that\ngreater achievements are thus assured.\nHenry L. Smith,\nDean of the School of Education.\nMedicine\nrEDICAL training at Indiana University is in effect a 100\nper cent war effort. With only minor exceptions, all\nactivities centering in and about the School of Medicine are direct\ncontributions to the winning of the war.\nThe School of Medicine and its affiliated divisions on the\nUniversity’s Indianapolis campus are providing training for 298\nmedical students, 311 nurses, 25 dietitians, and 13 medical tech¬\nnologists. Practically all of these students on completion of their\ntraining will enter the armed forces where their services are greatly\nneeded.\nThe three hospitals of the Medical Center—James Whitcomb\nRiley Memorial Hospital for Children, the Robert W. Long Hospital,\nand the William H. Coleman Hospital—in 1944 cared for 10,739\npatients with a total of 193,536 hospital days. The Center cared for\n35,309 out-patient calls during the same period. The care of\nthese patients, an indispensable part of the training of medical\nstudents, nurses, dietitians, and medical technologists, is a direct\nand important contribution to the war effort because of the great\nshortage of physicians in civil practice.\nThe School of Medicine, despite the loss of seventy of its\nFaculty, or practically every man under fifty years of age, to\nthe armed forces, has furnished assistance to the State Board of"
}