{
  "id": "d1102-23",
  "text": "24\nIndiana University News-Letter\nIt will be impossible to get the best results from our health board\nuntil this is done.\n4. The part-time health officers of the state should be re¬\nplaced by full-time health officers, physicians especially trained for\nhealth work, just as soon as such a number of health officers can\nbe found or trained. The work of the health officer is just as\nmuch of a medical specialty as ophthalmology, surgery, or obstetrics.\nThe part-time health officer is paid so little that he can do no\nmore than scratch the surface of the work which so badly needs\ndoing. Every county or group of counties which has a full-time\nhealth officer should also have a nursing supervisor with a corps\nof public health, school, and maternity nurses, a sanitarian, and\npossibly a health educator if the county or district is large enough\nto support a staff of such size. Except for supervision at a state\nlevel, this health officer should be under local control, which means\nof course that he should be paid from local funds.\n5. Each such health unit should have a health office. Prefer¬\nably such an office should be new, clean, planned for the purpose,\nand a source of community pride. Such an office for a county of\nmedium size could be built for $30,000, which is the cost of one\nmile of concrete road. Surely such an office would equal in value\nto the community a mile of road! Larger units would, of course,\nrequire larger quarters, but rarely would the cost need to be over\n$50,000. In addition, the State Board of Health at Indianapolis\nneeds another building for housing its laboratories and offering\nadequate fire protection for its 5,000,000 birth and death records\nwhich are utterly irreplaceable and extremely valuable to the people\nof the state. This building, well equipped, would cost about\n$500,000, or 10 cents for each birth and death certificate, to say\nnothing of the other uses of the building.\n6. The Indiana University Medical Center at Indianapolis\noffers exceptional facilities for the health training of physicians,\ndentists, nurses, technicians, sanitarians, dietitians, and health edu¬\ncators. There should be developed a School of Public Health as\na part of the University. This enterprise can succeed only if the\nother projects here mentioned are carried out. Such a school\nwould serve as a most valuable stimulus to the whole program in\nIndiana. We understand that the University is eager to go ahead\nwith this project if there is promise of effective action on the other\npoints of the program.\nPeople of Indiana, parents, teachers, physicians, dentists, nurses,\ncitizens—here is a program which should make for better health in"
}