{
  "id": "d1102-24",
  "text": "Indiana Looks Ahead\n25\nour fair state. This program is vital; it must not be made the tool\nor plaything of partisan politics; it must not fail.\nWe present it for the consideration of the public. Indiana is\nbehind in such matters. Most states have full-time health officers\nand much larger budgets than Indiana. Most states have lower\ndeath rates than Indiana. We cannot afford anything but the best\nin this respect. And we believe the people and the legislature of\nIndiana will demand the best.\nThurman B. Rice,\nChairman of the Department of\nBacteriology and Public Health.\nExpansion\nXTTFTER the Ohio river completes its short journey within the\ni- state of Pennsylvania it becomes a part of the boundaries\nof five great commonwealths: West Virginia, Ohio, Kentucky,\nIndiana, and Illinois. The valley of this tremendous river includes\nnearly all of the 200,000 square miles contained in these five\nstates. More than 23 million people reside in the Ohio Valley.\nIndustrially it has grown far beyond the ideas of the agricul¬\nturally-minded pioneers who followed the river into the promised\nland west of the mountains. In these war years the products of\nthe factories and farms within the Ohio Valley have been the\ncapstone of the war effort.\nThis tremendous ability to produce must also be the goal for\nthe years following the war. The Ohio Valley, it is believed,\nwill be the center of the peacetime advance within the nation.\nAccompanying articles in this booklet have indicated some of\nthe problems in education which will arise from that leadership\nand some of the solutions of those problems which are already being\nplanned by Indiana University and its sister institutions. Men\ncompetent in the various fields of education have pointed out the\ngreat responsibility which rests upon higher education to be ready\nto provide trained leadership in economy and in culture in peace\nas it had in the arts of war.\nAt Indiana University the reconversion to peacetime activity\nwill not be a new experience. Five times since its founding in 1820"
}