{
  "id": "d1102-3",
  "text": "-4-\nAUSTRALIaN FARM RADIO DIRECTOR VISITS THE UNITED STATES\nJohn Douglass, Director of Rural Broadcasting, Austrialian Broadcasting\nCommission, was in Washington, D.C.,:the first week of the New Year, visiting the\nUnited States Department of Agriculture,•transcribing programs including an inter¬\nview with Secretary of Agriculture Clinton Anderson, for Australian re-broadcast.\nHe has been doing spade work toward getting more cooperation with farm broad¬\ncasters in various countries. His visits here followed the visit of Wallace\nKadderly, former radio chief for the USDA to Australia last summer.\n| Douglass would appreciate having accounts of N-a-E-B rural broad- j\ns casting activity forwarded to him at the A,B.C, Building, William ,\nj Street, Sydney, Australia,_______■\nAustralia’s radio farm director reports his chief interest was to see and\ninvestigate U.S, Barm radio. He reports he likes the \"friendly approach” but not\nthe \"super-super-sponsored-pusher,” He liked those farm broadcasters who had a\ngood story to tell—an interesting important agricultural story—in a way that\nwould hold the urban audience and also included important technical material.\nOutside of farm radio, Douglass reports he finds the ordinary commercial hard\nto listen to, but reminds U.S, radio people that Australia has just as many\ncommercials in their commercial radio as the U.S. does, He believes \"blatant,\nover-qprolonged, and commercial plugs are of doubtful merit, and not good sales\ntalk.\" He believes \"subtle ads” are best.\nf The Australian Broadcasting Commission is the Australian equivalent\nj of the BBC in Great Britian. Australia does, however, have a number\n! of commercial and individual stations. The aBC is financed by a tax\nj of about $3.25 per radio set, The aBC does not carry sponsored pro-\n; grams, but does maintain rather rigid program standards because of\nstrong competition from commercial broadcasters. The aBC, having\n! neither sponsors nor Governmental directives, gives maximum time to\n1 public service programming.\nj ABC, like the British Broadcasting Corporation, is a governmental j\n! corporation roughly equivalent in the United States to an agency\n: such as the Tennessee Valley Authority._____:\nCOLUMBIA BROADCASTING COMPANY SHIRTS STARR\nJrank Stanton, CB$ president, has announced major changes in the network\norganization. Howard Meighan, former vice president in charge of company-owned\nradio stations, becomes a general executive of the company, supervising a number\nof major departments.\nOther promotions include: James Seward, Director of Operations to become\nVice-president in Charge of Operations; S. E. Dean, Assistant Treasurer to Treasurer\nJ. L. Volkenburg, General Sales Manager, Spot Sales Department, to be Supervisor\nof Company Owned Stations,\nBBC SYMPHONY BOR NEw YORK\na series of full-hour symphonic broadcasts, furnished by the British Broad¬\ncasting Corporation, will begin on WINS and continue for 13 weeks, a unique\nfeature of the transcribed series is personal commentary by the BBC conductors,\nSir Thomas Beecham, Clarence Raybould, and Sir Malcolm Sargent. These conductors\nwill personally read program notes before each number,."
}