{
  "id": "d1102-3",
  "text": "4\nIndiana University News-Letter\nyoung people complete their high school work. Still fewer, and\nit is not to our credit, go to college.\nIn these postwar years, our duty is plain. In addition to\nthe necessary provision for the veteran returned from war service\nand to the veteran from industrial service we must see to it that\nour young people have the advantages that will permit them to take\ntheir place in the world that is before us. For the men and women\nof my generation this is perhaps the greatest contribution we may\nmake.\nThe statement of the problem is simple: To provide educational\nadvancement for the greatest possible number of boys and girls.\nThe solution of the problem is not so easy. It involves\neducational institutions, prepared for service. It means adequate\nfinancial support both from tax sources and from private sources.\nIt means housing for students. It means laboratories, libraries, and\nresearch programs. It means farsighted administration and sym¬\npathetic instruction.\nBut when the problem is solved, within the structure of our\nunusual natural advantages, all of us will be the beneficiaries and\nthe communities in which we live will be stronger for our efforts.\nAt Indiana University, as in the other great institutions of\nlearning, plans have been made. All of the experience that has\nbeen gained in its century and a quarter of service is directed\nto even greater service in the immediate months and years. This\nservice will not be a narrow offering to youth; it will enrich and\nintensify the lives of all with whom it comes in contact.\nHerman B Wells,\nPresident.\nPostwar Planning\nOON after Indiana University converted its academic program\nk-s from a peacetime to a wartime basis, it became obvious that\nthe problem of reconversion would be an even more difficult task.\nFortunately President Wells early during the war realized this and\nappointed a Postwar Planning Committee to undertake a study and\nto make recommendations. This committee, which consists of\nDean W. W. Wright, and Professors Ralph Cleland, Carroll L."
}