{
  "id": "d1102-4",
  "text": "Indiana Looks Ahead\n5\nChristenson, Robert T. Ittner, and Francis D. Wormuth, was ap¬\npointed in August of 1943 and since then has been engaged in a\nstudy of the postwar problems.\nThe first task which faced the committee was to find the\nsubjects which would demand its study and attention. Among those\nwhich seemed most urgent were the following: an organization to\ncare for the needs of returning veterans; the probable size of the\npostwar student body and the times and levels at which students\nmight be expected to enter the University; the question of the\nsize and recruitment of Faculty which would be needed to meet\nthe expected increase in enrollment; the problem of the University\ncalendar, that is, converting from the three-semester speed-up plan\nto a program more suited to peacetime needs; the extensions of\nUniversity services to the people of Indiana; the possibilities of\nnew methods of teaching, such as the use of visual aids; and\nspecial short curricula to meet the needs of mature students who\nmight not be able or might not wish to remain for four years at\nthe University. These were some of the most urgent problems\nfacing the committee. One of the first tasks of the committee was\nto appoint a number of subcommittees to study each of these\nproblems. Many of these subcommittees have already reported\nand others have almost completed their work.\nIt was obvious to the Postwar Planning Committee that some\nof the previously mentioned problems were of more immediate\nimportance than others. Working on that assumption, the com¬\nmittee designated as its number one problem, an organization for\nreturning veterans. The report on this has already been made\nand approved by the Board of Trustees and the Faculty. The\nOffice of Veterans Affairs has been established and is now function¬\ning under the directorship of Dean Wright.\nThe next problem for the committee is that of the University\ncalendar. In dealing with this question, the committee is faced\nwith two conflicting interests, namely the desire of the general\nstudent body to abandon the three-semester speed-up calendar and\nto return to a normal academic year, and the needs of veterans\nwho desire and who are encouraged under the G.I. Bill to go to\nschool during most of the year.\nAnother problem of immediate importance is that of prepar¬\ning for an enlarged postwar student body. Available data point\nto a greatly increased enrollment at Indiana University after the\nwar. The University faces a real task in finding the Faculty"
}