{
  "id": "d1102-5",
  "text": "6\nIndiana University News-Letter\nwhich will be necessary to take care of this increase. The Postwar\nPlanning Committee is studying this problem and will make a\nreport in the near future.\nIn conclusion, a word should be said concerning increased\nservices to the people of the state of Indiana in the postwar\nperiod. President Wells has always recognized that one of the\nimportant tasks of Indiana University is to render services to\nthe people throughout the state. One of the tasks of the Postwar\nPlanning Committee is to study ways and means of extending these\nservices so that Indiana University may attain its maximum\neffectiveness as an institution of higher education.\nFord P. Hall,\nHead of the Department of Government.\nScience\nEOR three years and more America has been mobilized for war.\nIts men have been mobilized, and from all walks of life\nthey have marched away to camps and to battles in widely scat¬\ntered parts of the world. Production has been mobilized. Plants\nthat once made automobiles now make armament. Plants that\nonce made pencils or toasters now make machine gun and radar\nparts. Knowledge and skill—science and technology—have also been\nmobilized; mobilized to make possible the most amazing production\nfor war the world has ever seen; mobilized to provide our armed\nforces with new and efficient tools and machines of war; mobilized\nto meet the knowledge and skill of the enemy with greater knowledge\nand greater skill of our own; mobilized to focus all of our energy,\nall of our natural resources, all of our labor, all of our industry,\nall of our wealth upon the objective of bringing the war to a\nspeedy conclusion with a victory that is complete and with a peace\nthat is lasting.\nWhen victory has been made certain, I believe we shall find\nfor our postwar world two clearly defined conditions concerning\nthe science and technology of America. First, there will be an\nopportunity unequaled in history for man to apply newly discovered\nknowledge. Before the first World War, for example, we were\nlargely dependent upon German industries for almost all of our\ndyes, many of our drugs, and most of our necessary supply of"
}