{
  "id": "d1102-6",
  "text": "PBTRILLO DECISION PEP3CTED JAUTAP.Y 14\nTestimony in the U.5. District Court in Chicago in the trial action charged\nJames C. Petrillo, (American Federation of Musicians) with violation of the lea\nAct. The government charges Petrillo with having called a strike May, 1546 against\nChicago station MAAF when its officials refused to hire 3 additional members of\nthe AFM. The defense held the APM's action against MAAS1 was in keeping with normal\nlabor activity.\nThe Lea Act, known as the \"anti-Petrillo law\" specifically states unions cannot\nforce any company to hire more persons than they normally need in their business.-\nThe act was previously held unconstitutional by Judge Malter La Buy (judge also in\ncurrent case) but the U.S. Supreme Court reversed his decision.\nHAPPY PREDICTS RBCORD BAN MILL BPPAII APM\nOn the heels of Petrillo*s January 1 order calling all APM musicians out\nof recording studios and declaration that they will \"never again\" cut a phonograph\ndisc came a ruling restricting all network transcribed \"repeat\" programs after\nJanuary 31. All \"repeat\" shows, he says, will have to be done \"live.\"\nMeanwhile. .Dr.Joseph Maddy, head of the Interlochen,Michigan Music Camp, and\nlong-time foe of petrillo, predicts the \"record ban\" will \"break\" the APM. in one year.\n\"Leading recording artists will break away from APM and form an independent union.\nThe two-year backlog the record companies claim to have won't keep leading per¬\nformers from breaking the union. The ban on records won't stick.\"\nDr. Maddy, member of the University of Michigan faculty (H-A-S-B Station\nMUOK), was ousted from the union in 1946, four, years after Petrillo had barred\nhis student musicians from radio broadcasting. Maddy will testify later this\n! month before the House Labor and Pducation Committee in Washington. He says\n. he will provide information to help Congress enact legislation to curb what he\ni calls \"Petrillo's one-man rule in the APM.\"\nPCC CLHAR CHAITFFL DISPUTE COMPLICATED BY HTr MI!3\"PS\nThe PCC faces a new tangle in the long-standing clear channel controversy with\nonly two of its members (Durr and Tfalker) having been present since the beginning\nof the hearings. Rosel Hyde joined the PCC in time to take part in the last porr-\ntion of the hearing.\nThe last four members (Coy, Mebster, Jones, and Sterling) have appeared on\nthe scene only in time to sit through the oral argument (begins January 19) although\nSterling as former chief engineer for PCC is well acquainted with the technical\naspects of the case.\nPrevious bets on clear-channel breakup for at least two frequencies are now\nbeing hedged by close observers, because of new PCC commissioners. Any change in\npresent allocations must be placed before !TAKBA(lTorth American Regional Broadcasting\nAgreement) in August; so PCC is racing against time.\nIf Clear Channel Decision is delayed status quo would probably -prevail until\nnext 1TAP3A meeting, probably 1949.\nThree possible courses exist, observers say-: (l) Complete breakdown of U.S.\nClear Channels (2) Dissolve or re-allocate some or present clear channels. (3) ' G-o\nalong with CCBS(Clear Channel Broadcasting Service) which asked PCC for 750 ICM for\n.two clear channel stations each in 10 regions of country making total of 20 such\nsuper-power stations."
}