{
  "id": "d1102-6",
  "text": "Indiana Looks Ahead\n7\npotash. Under the stimulus of necessity and the conditions existing\nduring and following World War I, the American chemical industry\ndeveloped to the extent that in 1940 it was producing all the\ndyes and drugs that we and our allies required and was not only\nmeeting domestic potash requirements but was providing potash\nto others. Following World War II we may expect similar\ndevelopments in other fields of science and technology. During\nthe war research has been speeded up, and the probable results\nof twenty-five normal years have been condensed into two or three.\nIt remains for us in peacetime to apply this knowledge in providing\nfor all of our people more adequately and more richly the necessities\nof life and at least some of those things that add to the happiness\nand comfort of living.\nSecondly, it appears quite clear than science and technology\nin postwar America will suffer because of lack of manpower.\nFour years, and in many cases at least seven years, are required to\ntrain the engineer, the chemist, the physicist, the geologist, the doctor\nof medicine, or almost any other man or woman for scientific\nwork. During the war it has been necessary to curtail training\nuntil at the present time one can say that the potential supply of\nnewly trained professional and technical personnel for the next\nfew years represents an almost negligible number of persons in\ncomparison to the normal number absorbed each year by industry\nand in research and teaching before the war. Because of the\nlength of time required to train a scientist it will necessarily be\nthree or four years after the war is over before the number of\nnewly trained persons will be anything like the normal number or\nthe number required. To meet this need we must look to the\ncolleges and universities because it is there that the scientist, the\ntechnologist, the engineer, the doctor, and the dentist are trained.\nThe colleges and universities accept this responsibility. They are\nnot discouraged and to the young man and young woman who is\ninterested in science as a career they have this message, “Never\nin the history of our country has the need for first-rate scientists\nbeen greater or your opportunity more promising.”\nHerman T. Briscoe,\nDean of the Faculties."
}