{
  "id": "d1102-7",
  "text": "8\nIndiana University News-Letter\nVeterans Affairs\nEARLY 9,000 former students and alumni of Indiana Uni-\nJL L versity have entered the armed services. At least one-third\nof those were students when they entered the service. More than\n1,600 men and women who would have attended Indiana Uni¬\nversity if it hadn’t been for the war have had their college days\ndelayed.\nThe University realized that there were many problems that\nwould need special attention when these ex-service men and women\ncame or returned to the campus after the war. To meet these\nproblems of the returning veteran there was created, in the Uni¬\nversity, in March, 1944, the Office of Veterans Affairs with a\ndirector, appointed by the president, and a board of control made\nup of members of the Faculty* This group has been formulating\npolicies and procedures in relation to returning ex-service students\nin matters of evaluation and transfer of credits from other institu¬\ntions, credits for military service itself, for special training received\nin military service, etc. The Office of Veterans Affairs furnishes\nguidance to the returning student to help him work out a satis¬\nfactory educational program. This applies both to those who wish\nto complete their work toward a degree in the various schools of the\nUniversity and to those who wish to take special programs not\nleading to a degree. The office will act as a liaison between the\nstudent and government agencies. Perhaps its most important\nfunction will be to serve as an office of information.\nIn all departments of the University there are already enrolled\nsome 320 ex-service men and women. Primarily these men and\nwomen are medical dischargees. How well are these men and\nwomen adjusting themselves to college life after the rigors of army\ntraining and days and nights in the fox-holes on the front? To\nanswer that question we have some facts and several impressions.\nFifty of these ex-service students were enrolled in 1944 summer\nsemester. We compared their academic grades with those of their\nnon-serv'ice classmates. We found that, as a group, these ex-service\nstudents did 5 per cent better than other students. We can say,\nat least, that they are doing as well academically as the other\nstudents, and generally better. From many hours of conversation\nwith these ex-service students and numerous observations we find\nthat, on the whole, they are adjusting themselves well to the life"
}