{
  "id": "d1102-8",
  "text": "TELEVISION SET CENSUS — DO YOU h*VE ONE — DO YOU WANT ONE?\na plan to survey cities with television stations and cities anticipating\ntelevision stations by the nations electrical companies is already in operation\nthrough the American Television Society,\nUnder the plan, residents in these cities will receive a questionnaire asking\nif they own a video receiver, what \"brand, etc. In other cities public utilities\nare running newspaper ads with the same questions, promising respondents priority\non television set purchase, free tickets to video shows, etc.\nSURVEYS - HOPFEB, NIELSEN, ETC.\nThe discussion about best methods of surveying audiences continues to j\ngrow more heated. C, E, hooper, whose \"Hooperating\" is perhaps best known\nof the methods, finally answered criticism by pointing out other methods, !\n? particularly the \"electronic\" method (refers to Nielsen system) does not\nactually measure actual listening. Hooper's coincidental telephone call |\nmeasurement, he says, gives actual evidence of listener reaction whereas\ni Nielsen's system of measuring \"sets in use\" may find the listener elsewhere ‘\nin the house and not by the radio. Critics of the hooper system point out ■\n. dependence on the telephone sample leave out large segments of audience, ;\nRaLIO -USIC FIGURE LIES\nCesare Sodero, 61, conductor and composer, died Lecember 18 after a long\nillness, Widely known in radio and opera circles he conducted 600 concerts for\nNBC from 1925 to 1934 and directed for Mutual from 1934 to 1940, he specialized\nin reducing full-length operas into 60-minute shows for broadcast.\nSPECULATION ON NEW Cr.IEF ENGINEER NOR FCC\nWith appointment of George E. Sterling, former FCC chief engineer, to the\nCommission itself, informed parties predict that James Barr is expected to move\nfrom assistant to chief engineer of the broadcast branch of the Federal\nCommunications Commission.\nRELIGIOUS RADIO WORKSHOP\nA workshop on religious broadcasting met the week of January 4 in New York\nat the Prince George hotel. Under the direction of Rev. Everett C. Parker, dir¬\nector of the Joint Religious Radio Committee, guiding personnel included Elinor\nIman, CBS director of religious broadcasts; Dr, Ross Snyder, of the theological\nfaculty at Chicago University, They seek higher \"listenability\" in religious\nbroadcasting.\nParker points out polls show religious programs rank last or next to last\nin listener interest. Their concern at the meeting, he sa.vs, is improvement of\nreligious programs. A stat ion offering free broadcast time has right to expect\na program of high listener interest.\nMorris L. Ernest, attorney, author of \"The First Freedom\", will discuss\nradio and freedom of speech, Other scheduled talks include personnel from NBC,\nCBS, and other radio and religious organizations."
}