{
  "id": "d1102-8",
  "text": "Indiana Looks Ahead\n9\nof the University. They do find it difficult to settle down to\nschool work again. Long hours with their nose in a book is at\nfirst a difficult adjustment for ♦them to make. They are very\nserious-minded. They are anxious to get their training completed\nand will, in the main, desire to go to school the year around.\nAn unprecedented opportunity for education is now available\nfor ex-service men and women through the enactment, by Congress,\nof Public Law 346, popularly known as the G.I. Bill. The essential\nfeatures of the educational section of the law are:\n1. Eligibility. Any veteran of World War II, with ninety days\nor more of active service and with an honorable discharge, is\nentitled to its benefits.\n2. Benefits. These benefits are listed with regard to: (a)\nTime—An individual can receive training for one calendar year\nplus the time in active service. For example, a person with two\nyears of active service would be eligible for one calendar year\nplus the equivalent of two years in active service, which would\nmean three calendar years or thirty-six months of schooling, (b)\nSubsistence—During this period of time the veteran would receive,\nif single with no dependents, $50 a month for subsistence. If he is\nmarried, or has one or more dependents, he receives $75 a month.\n(c) Other benefits—In addition to subsistence, there are also\nprovided his tuition, fees, and necessary books and supplies.\n3. Place and type of training. The veteran may take his\neducational training at any approved educational institution and in\nany field of his choice provided he is accepted by that institution.\nPerhaps millions who have served their country in the armed\nforces will take advantage of this educational opportunity—an\nopportunity to increase their training to be better fitted to meet\nthe problems of the postwar world. Indiana University expects\nthousands of these veterans in its various branches—on the Bloom¬\nington campus, the Indianapolis campus, and its five Extension\nCenters. It is our hope that we shall not fall short in meeting\nour obligations to these men and women who have fought that\nwe might have an even better Indiana University.\nWendell W. Wright,\nDirector, Office of\nVeterans Affairs."
}