{
  "id": "d1203-0",
  "text": "MARCH 19 61 NEWSLETTER\nT HE PRESI DENT'S SAY\nSome wag has said that a camel is something created by\na committee; right now 1 feel like a committee created by a camel.\nI have been recently subjected to a series of mild buff©tings and\nkicks, nudges and shoves, and just generally stepped upon . What\nis more, 1 brought it al o n mys elf .\nIn my innocence, I addressed a friendly little communique\nto the membership a while back inviting people to write and tell\nme if they would like to oe on an NAE B committee end, if so, to\nlist their preferences hi order : 1, 2, 3*\nIt was my feeling, I explained, that there were ma ny who\nwere willing to serve but were often, inadvertently overlooked.\nEvidently, Many agreed.\nI expected a modest response; certainly I was not prepared\nfor a ma il return of about S0%, No t o nly did you answer the\nquestionnaire with indications of your preferences , but almost\na fourth of you appended letters indicating the reasons for your\nchoices, recounting your background, or indicating why you should\nbe chose n.\nActually, I was pleased and warmed by this wholehearted\nresponse . This had been a call for assistance (“not for glory; a lot\nof just plain hard work*') and, as always, the NAE B responded.\nBut this reaction, while helping to place more information\nat my disposal did ma ke the ta sk of selection more difficult and\ntime-consuming. More than ever I wanted not o nly to get the best people\nto do certain committee jobs, but X wanted, so far a s feasible, to give\nthem the jobs they preferred. This careful sifting and winnowing has\ntaken ma ny days - and nights. O bviously, the results will not please\neveryone; there are not enough assignments to go around to give a job to\nall who offered their services and certain committees w ere “over-subscribed“\nby as much as 400%.\nThis year, i n order to insure a contl nous flow of new blood into\nthe committee system, while yet preservtng cahtinuity of experienced\npersonnel, I am init tating an arrangement of s taggered terms for\ncommittee members. After the initial two years, members will serve\nthree year terms , with three new members being chosen each year to\nreplace t hree members who ro tat e off. The sma 11 numerals oppos Ite th e\nnames in dicate th e 1 ength of ter ms fo r e ach appo int ee. In general."
}