{
  "id": "d1096-1",
  "text": "-2'\nEducational Broadcasting's History Reviewed\n\"Now let us examine the valuable estate to which you educators have fallen heir.\nThey are: 242 Television channels. And even more can be granted later.\n\"And let us remember some significant history: The Congress, in adopting the Radio\nAct of 1927, did not see fit to reserve any channels for education. The Radio Com¬\nmission set up in 1927 did not allocate any channels for education. The educators\nwaged several campaigns later to have channels reserved. Their first success came in\n1945 when the Federal Communications Commission reserved 20 FM channels. Now in this\nyear of 1952, you educators are allocated twelve per cent of all the available tele¬\nvision assignments. I say that this allocation for education is tremendous progress.\nIn order to convince the Commission of the need for this reservation, you educators\ndid a magnificent job.\n\"By giving your time and effort and by raising the necessary funds to make your pre¬\nsentation, you have rendered a historic service to education. The educators that come\nafter you, and the public, too, will forever have cause to honor you for the fight\nyou made.\n\"...there are unassigned channels that may be available to communities for non¬\ncommercial educational stations. But there is still another path by which you educa¬\ntors can enter television.\n\"You have the right to compete with any commercial applicant for any of the commercial\nVHF or UHF channels assigned to your city. And, according to the rules, if you are\ngranted such a channel, you may employ that channel either for commercial purposes or\nfor non-commercial educational purposes.\n\"Of course, this report does not mean that commercial television stations are ex¬\npected to let the educational stations carry the whole burden of meeting educational\nneeds in a community. In fact, the report specifically states that the provision for\nnon-commercial education stations: ... does not relieve commercial licensees from\ntheir duty to carry programs which fulfill educational needs and serve the educational\ninterests of the community in which they operate. This obligation applies with equal\nforce to all commercial licensees whether or not a non-commercial educational channel\nhas been reserved in their community, and similarly will obtain in communities where\nnon-commercial educational stations will be in operation.\nCongratulates NAEB\n\"As one with a lifetime interest in educational movements and as a member of a\ngovernment commission charged with promoting the public interest, I congratulate the\nNational Association of Educational Broadcasters on the splendid role it played in\nthe campaign for exclusive educational assignments.\n\"On the basis of the entire record, the Commission is convinced of the need for edu¬\ncational television stations. To my mind, you have exciting opportunities. I am\nespecially inpressed by this fortuitous and fortunate meeting of the need and the\nmechanism in the field of adult education.\"\nIN THIS ISSUE\nNAEB At the Columbus Institute. ....* • 1- 8\nOther News of NAEB.9-14\nTelevision in Great Britain .. 15-16\nClosed Circuit Color Television in Surgery--Burton Paulu.17-18\nNAEB Tape Network—Richard Rider...18 - 19\nResearch Report--Dallas Smythe.20-23"
}