{
  "id": "d1096-12",
  "text": "-13-\nAMERICAN ASSOCIATION OF SCHOOL ADMINISTRATORS DISCUSSES TV AT LOS ANGELES MEETING\nSchool administrators from all sections of the United States attended the discussion\nsession on television’s role in education during the 78th annual convention of the\nAmerican Association of School Administrators held in Los Angeles March 8-12.\nSpeakers included Roy E. Simpson, California State Superintendent of Public Instruc¬\ntion, who told the educators they must prepare for the service of the forthcoming\nnon-commercial educational TV stations, pointing out that California schools have\nample authority under the Education Code to take part in the educational use of\ntelevision. He reviewed the principles, purposes, and plans for television that have\nbeen outlined by the California State Department of Education.\nNine-Point Project\nThis outline consists of nine points covering: (l) the need for coordinating the\nefforts of all school districts; (2) the advisability of a central coordinating coun¬\ncil; (3) recommendation of maintaining a full-time coordinating staff; (4) the\nvarious potential uses of TV by educators; (5) the necessity of educators owning non¬\ncommercial channels; (6) costs of TV station operation; (7) increased effectiveness\nof teaching through video; (8) relationship between use of TV and audio-visual mate¬\nrials; (9)- the effects of educational TV on teacher employment.\nSimpson's address was enthusiastically in favor of full development of non-commercial\ntelevision by educators throughout the United States.\nLos Angeles School TV\nMrs. Margaret Divizia, supervisor of audio-visual aids for the Los Angeles City\nSchools, presented a plan for the experimental use of television in the Los Angeles\nCity elementary schools. She is chairman of a television committee which has worked\nout details of an extensive experiment in classroom education by television, through\nwhich one of the Los Angeles stations will televise to 25 schools a specially created\nseries of programs designed for elementary grade students by school supervisors,\nadministrators, and teachers.\nThe program presented by Mrs. Divizia is expected to provide research material to aid\nin establishing a national pattern for the use of TV in classrooms. The telecasts\nwill consist of a daily half-hour program which includes a five-minute opening and a\nfive-minute closing for the special interest of viewers outside of school.\nArrangements for these school telecasts have been under discussion with one of the\nLos Angeles stations which is expected to support the project. The plan calls for\ninstallation of two 20-inch sets in each classroom used for the experiments.\nr NEW RADIO FREE EUROPE TRANSMITTER STARTS DAILY BROADCASES TO POLAND\nA 50 kilowatt short wave transmitter near Frankfort, Germany, began on May 3 to\nbroadcast Radio Free Europe programs exclusively to Poland, it was announced by Rear\nAdmiral Harold B. Miller, USN (Ret.), president of the Crusade for Freedom. The\npowerful new transmitter will be on the air twelve hours a day, seven days a week.\nSeven Radio Free Europe transmitters now broadcast daily programs to Czechoslovakia,\nHungary and Poland. Two other transmitters beam programs to Albania, Bulgaria, and\nRumania."
}