{
  "id": "d1096-18",
  "text": "-19-\nPROBLEMS\nThere remain two policy problems to be decided in regard to the network operation.\n1. a policy for keeping on file master copies of programs distributed. We now have\napproximately 1,000 reels of tape devoted to file copies. In view of the present\nplans these will accumulate at the rate of roughly 1,000 per year. This means an\nannual investment of $3,000 for file masters. Do we need all of these? Should we\n- keep only selected ones? Should we keep none after a given time interval?\n2. A number of associate members and several independent commercial stations have\ninquired as to the possibility of making available some of the network offerings for\nuse on a sustaining basis over commercial stations. It is probable tnat some of the\nprograms could be cleared for such use; others, of course, could not be so cleared.\nIs it desirable to make those programs which can be cleared available for such use\non a cost basis?\nEQUIPMENT\nNetwork headquarters is now operating with the addition of two new Ampex 300 rack¬\nmounted tape recorders. These are primarily for use in making the playback copy\nfor the duplicating process.\nThe University of Illinois business office has completed all contractual arrange¬\nments with Rawdon Smith Associates for the multi-channel tape duplicator. It is\nexpected that it will be installed and ready for use not later than July, 1952.\nThis will allow some experimentation and trial runs prior to the enlarged operation.\nPLANS FOR FALL\nEffective with the series scheduled to begin in early September of 1952 copies of\nall programs will be supplied to each station. We will be happy to cast into limbo\nthe infamous terms, \"bicycle,\" and \"leg.\"\nIt is anticipated that at least four series of programs produced under the grant\nfrom the Fund for Adult Education will be available for distribution next fall and\nwinter.\nMEMBERSHIP\nThere are currently sixty-five stations actively participating in the network.\nThree morte are expected to begin within the next month or two.\nUTILIZATION OF PACKAGES #5, #6, AND #S-1\nStations using #5 and #6 37\nStations using #5 and #S-1 9\nStations using #S-1 only 1\nStations using #5, #6, and #S-1 14\n6l\nSTATION USE OF PACKAGES -#3 AND #4\nBroadcast use by stations of series in Packages #3 and #4 ran from a low of 73$ to a\nhigh of 95$. These percentages represent stations which having been offered a series\nactually broadcast it. The average use for the two packages was 79*82$."
}