{
  "id": "d1096-5",
  "text": "-6-\nPaul A. Walker Made Honorary Life Member\nFCC Chairman Paul A. Walker was made an honorary life member of NAEB. At the NAEB-\nsponsored luncheon Vice-President Ausmus presented the Commissioner with a suitably\ninscribed scroll.\nNext Board Meeting in Battle Creek\nThe next meeting of the Board of Directors will be held May 23 and 2b in Battle Creek,\nMichigan, the headquarters of the Kellogg Foundation, at which a review of the first\nyear of the Kellogg project will be the main order of business.\nOTHER IERT SESSIONS REVIEWED\nHunter Says Educators'■ Job Is Program Improvement\nImprovement of television programming \"will probably have to be the major responsi¬\nbility of the educator and the educational broadcaster,\" Armand L. Hunter of Michigan\nState College told the opening general session of the Institute. Hunter, who is\ndirector of television development at Michigan State, took part in a symposium on\nthe improvement of TV programming.\nThe job will fall to the educator, he said, \"because the industry has certain philo¬\nsophical and economic obstacles in its path, the Commission has no practical method\nof enforcing it, and the public has no articulate means of demanding it.\"\nHunter noted a \"fundamental philosophical conflict and opposition\" within the indus¬\ntry, which he said makes it \"extremely difficult for much progress to be made.\" This\nconflict, he believes, involved proponents, of low-level programming and \"the men of\ndifferent conviction, who hold to higher standards.\" \"... I would personally en¬\ncourage every step taken by the industry to improve standards and programming, and\nurge the active and vocal support of those men ’fighting on the side of the angels,'\"\nhe said.\n\"But I'm still of the opinion that the battle will be long and hard, and that the\neducators as outside forces are the only ones who can perhaps swing the support and\nweight needed to help the industry win the fight and eventually achieve the common\nobjective of program improvement.\"\nThe job should be the responsibility of the educator. Hunter said, \"because he is the\ninstrument through which society preserves and transmits its intellectual and cul¬\ntural heritage.\" He listed two contributions which the educator can make toward im¬\nprovement of programming -- the determination of needs and standards through qualita¬\ntive research, and the realization of these standards through creative experimenta¬\ntion in program content and form.\nListener-Viewer Group Functions Described\nThere is \"a great need\" for activity of listener-viewer associations in promoting\nhigher standards for radio and television programming, Mrs. Clara S. Logan, president\nof the National Association for Better Radio and Television, stated at another\nsession..\nRecent criticisms of television's portrayal of violence and lawlessness \"are similar\nto those we have been hearing for years about children's radio programs,\" she ob¬\nserved, and added that they \"point up the developing pattern of the similarity be¬\ntween television and radio.\" Mrs. Logan said that a major function of listener-\nviewer groups should be to inform the public that \"every citizen of the United States\nowns an interest in the broadcast channels, and that the broadcasters are licensed to\nuse these channels through laws which give us the power and right to demand higher\nstandards of radio and television programs.\""
}