{
  "id": "d226-115",
  "text": "The proposed study will inquire into the impact of the recently\ninaugurated in-school television service of KTCA-TV in Minneapolis-\nSto Paul on the in-school audience of the Minnesota School of the Air*\nthe school service offered for twenty years by the University of\nMinnesota radio station for public* parochial and private schools©\nIn part it will be a follow-up of the audience survey made with the\nassistance of an NAEB grant in the spring of 1957® immediately before\nthe inauguration of educational television in Minnesota0 In addition*\nthe survey will measure the extent to which the availability of\nin-school educational television programming has influenced schools to\npurchase television receivers\nThe study will be of great use not only to us at the University of\nMinnesota* but also to people interested in in-school broadcasting in\nall parts of the country* many of whom have had no opportunity to study\nthe effects of a complementary educational television in-school service\non the audience of a long-established radio school of the air* To this\nend* the study will compare the effects of the television service on\nin-school radio programs of different types0 For what subjects is\ntelevision preferred over—and better than—radio? Which areas are\nbetter left to radio? How can the two be combined to cover the same\nfields?\nThe proposed study will update some of the Information gained from the\n1957 Minnesota School of the Air audience survey0 It then was found\nthat almost one-fourth of all children in Minnesota elementary schools\ndid not have access to radios* central sound systems or tape recorders©\nThe new study will show at what rate the use of audio material has\nIncreased in Minnesota schools located (a) inside and (b) outside the\ncoverage area of educational television©\n* Attached herewith is a news story summarizing the findings of this\nprevious study« The entire document is available upon application\nto KUOM; copies also have been deposited at NAEB headquarters in Urbana©"
}