{
  "id": "d226-126",
  "text": "CHA\nVERSITY OF NEBRASKA TELEVISION\nON-TV\nLincoln 8, Nebraska\nDecember 27, 1957\nMr, Raymond D. Cheydleur\nChairman, NAEB Research Committee\nUniversity Broadcasting Services\nFlorida State University\nTallahassee-, Florida\nDear Ray:\nAttached you will find an application for a research grant-in-aid as prepared\nby one of the KUON-TV full-time staff members. Continuity Director Elizabeth M.\n(Betty) Meisinger. We are quite enthused about the project and the inherent pos¬\nsibilities for evaluation. The Lincoln, Nebraska, P-TA Council is likewise en¬\nthusiastic about the series and promises full cooperation.\nIn response to several specific questions concerning the application, let me\nstate the following:\n1. August 1, 1958, is the expected date by which there will be submitted\nto the NAEB two copies of the full report of the study, nine copies\nof a 600 word abstract of the full report, and two copies of a finan¬\ncial report, together with any unexpended NAEB grant funds,\n2. Research Supervisor and Advisor: Dr. Knute 0. Broady, Director of the\nUniversity Extension Division; Professor of School Administration.;\nChairman, University Television Committee.\nActive Consultant: Dr. Charles 0. Neidt, Professor of Educational Psy~\nchology and Measurements and Chairman of the Department; Research\nCoordinator for the Nebraska Television-Correspondence Project\nsupported by The Fund for the Advancement of Education, and for\nthe special classroom teacher versus television attitudes study\nsupported by an ETRC grant; recent attendant at the NAEB Research\nSeminar.\nProject Participant: Dr, Dale K. Hayes, Professor of School Adminis¬\ntration; Associate Administrator of the five-year Nebraska Cam-\nmuni ty Education Experiment as supported by the Carnegie Founda¬\ntion.\nResearcher and Evaluator: Elizabeth II. (Betty) Meisinger, Continuity\nDirector, KUON-TV, and candidate for Master of Education degree,\nassisted by a qualified graduate student."
}