{
  "id": "d226-128",
  "text": "REQUEST FOR NAEB GRANT-IN-AID\nFOR EDUCATIONAL BROADCASTING RESEARCH\nUniversity of Nebraska Television, HJON-TV, hereby makes application fot a\ngrant-in-aid to cover partial expenses of a research project involving the use of\ntelevision as a means of stimulating discussion groups within a democracy.\nThe idea for.the.experiment is based on the theory that television can help\npromote interest in citizenship responsibilities^ thereby strengthening the demo--*\ncratic processes within a community and .the nation as a whole.\nIn the belief that discussing important issues which concern the local coramu-\nnity — Solving mutual problems together\" — is both the process and the product\nof democracy,.KUON-TV plans a program series spotlighting educational issues of\ninterest and involving the participation of viewing groups organized especially for\ndiscussion of these topics throughout the community.\nThe Plan\nProcedure: Programs of this television discussion series will consist of three\nparts.\n1) 7:45 to 8:00 « a television presentation featuring resource per¬\nsons of the University in an overview of the evening's discussion\ntopic (indicating implications relative to the subject and cli¬\nmaxed by challenging questions for community consideration)\n2) 8;00 to 8;45 « continued discussion amongst members of the P-TA\naudience meeting together in small groups in homes or at schools\n3) 9-15 to 9:30 - a summary discussion from the KUON-TV studios, in¬\ncluding .reports by couriers representing the various viewing\ngroups in person, comments received by phone, appropriate remarks\nby an administrative delegate from the public schools, and a con~\nsensus by the moderator\nDates: These programs are planned for alternate Tuesday evenings beginning February\nTopics: Tentative topics are as follows:\nTuesday, February 25 -\nTuesday, March 11 -\nTuesday, March 25 -\nTuesday, April 8 -\nTuesday, April 22 -\n'Protection against Molesters\"\n'Myths of Physical Fitness\"\n'Signs of Science at the Crossroads\"\n'The Sense of Adolescence\"\n'Leisure Time on Trial\"\nTalent: Moderator for the series will be Dr, Dale Hayes, Associate Administrator\nof the Nebraska Community Education Experiment, Other outstanding per¬\nsonalities from the University have indicated their willingness to act\nas resource persons on the panel.\nOrganizational Participation\nBeamed especially to groups within the cooperating units of the Lincoln P-TAs,\n*hcse programs will reach citizens admittedly interested in the welfare of the com¬\nmunity — in its young people, in its schools, in hana^school-ccmmunity relations."
}