{
  "id": "d226-129",
  "text": "and in education per se. The F4TA was especially selected for participation be¬\ncause it syiobblizes the community spirit betokened of a mutual interest.\n(In addition to the P5TA groups, the program series will undoubtedly be of\ninterest to other viewers in the Channel 12 area. The scope of the project there¬\nfore includes a potential audience of many, many citizens as viewers if not as\nactive participants.)\n1 ^ committee is forming the liaison contact. A high degree of enthusiasm\nana interest has developed and wide participation is indicated. The Parent-Teacher\nCouncil at its December meeting voted unanimously to support the plan for the\ntelevision-discussion series.\nStill to be determined are matters dependent on the number of P-TA units par *\nticipating and the number of viewing groups registered. If there are more groups\nparticipating than can logically be included on a single summary program, represen¬\ntation mil be placed on a rotation basis. Groups not sending a courier on a cer¬\ntain night would be asked to report by phone. In the event that a P-TA unit has\nseveral viewing groups, representation will be figured on a numerical basis. (Scoe\nP-TAs may find it convenient to allow their members to view the TV presentation in\nQ ro<De a\"t the school, then divide up into discussion-si zed groups fo-*-\na buzz session, coming back together again to coordinate their reports and to view\nthe TV summary.)\nBackground\nBelieving in the inherent worth of the individual and the. significance of the\ndemocratic processes in America today, many educators are viewing discussion as the\nmeans for developing the personal and common understanding necessary if our free\nsociety is to be maintainodc\n. , P?®110\" i* if Vcn says, “The vital -. of- ftwrioa oannot bo measured\nina dollars anti cen-:nr shiny automobiles, bath tula machine^ and libraries full oi\nknowledge. It cannot be measured in terms of effijiency^ Democracy is spiritual\nin nature. It is a basic process, a method of communicating^ of exchanging thon d L\nideas, joys, sorrows, and human feelings. It is freedom to live, to choose, to bo '\nresponsible. It is a process by which free people in a free society are in communi¬\ncation with one another anc! together mold and control their own destiny at the\nneighborhood or community level* It is intangible, yet real and concrete. It can,\nnot be sold to the rest of the world, or even to our own people, unless we can learn\nto practice it in a more realistic way than we are practicing it now.\"\nThe ultimate good of all education is acknowledged try many to be the develop¬\nment of better people and better communities. This is education for a free society\n* * *\nSeveral features indicate the local setting to be advantageous for such an\nexperiment.\n1) The Nebraska Community Education Project has for the past several years\nbeen engaged in a study of community improvement and citizenship developre nt in\nfour pilot centers in Nebraska. Their experience and fundamental ideas will pro¬\nvide excellent resources for such a program series^ The University Extension Divi¬\nsion and the Office of Community Services may also be of assistance,\n2) Lincoln seems ideal for such an endeavor- Most of its citizens were for¬\nmerly residents of small towns. The atmosphere seems basically neighborly....\nLoyalty to the community is evidenced; the people are interested in personal and"
}