{
  "id": "d226-134",
  "text": "faoed the cameras for a term or more of course work. They must be\ndrawn from as many subject areas as possible. Opinions are needed\nfrom those who have worked on closed circuit systems as well as\neducational and commercial channels. Knowledge in this area is slight,\nso even limited research will be of some value, but the wider the\nselection of teachers interviewed, the more teachers will find areas\nof identification and therefore be helped.\n1. To obtain information on the teachers who have engaged in the\npresentation of credit courses by television, I will write to all the\ninstitutions which have presented or are presenting television credit\ncourses to learn who taught those courses and how successful the courses\nwere.\n2. This information will be screened to find representatives of\nas many subject areas as possible, attempting to cover closed circuit,\neducational and commercial stations. When choice is possible, the\nbest teachers in a given subject area will be selected, also giving\npreference to those with the most experience in the medium.\n3. The teachers selected will then be interviewed. The personal\ninterview in depth is the best method for this, since questioning can\nbe directed down avenues only hinted at in a questionnaire. It is\npossible that some information could be obtained by questionnaire,\nbut because of the very personal involvement of the teacher in this\ntotal experience of television teaching, some of the most necessary\ninformation for the neophyte teacher may be slighted.\nThe exact questions or the scope of the interview in depth has\nnot been completely determined as yet. The following type of question\nmay be indicative of the areas in which Information will be obtained!\nWhat was the teacher*s attitude toward teaching by television before\nthe actual experience?\nWhat is the teacher’s present attitude toward teaching by television?\nHow did the teacher get the television teaching assignment?"
}