{
  "id": "d226-14",
  "text": "INSTITUTE OF COMMUNICATIONS RESEARCH\nTHE UNIVERSITY OF ILLINOIS + URBANA\nJanuary 23, 1959\nDr* Irving Merrill\nMichigan State University\nEast Lansing, Michigan\nDear Irvs\nToday I received from Harry Skornia a letter from Samuel L* keeker,\ndated January 9, a letter from Harry to you and others, dated January\n13, and copies of four research proposals* This is the first I have\nheard about my being on an MIS research committee or on a subcommittee\nthereof, other than by a phone call from Harry yesterday advising me\nthat this material was headed my way*\nIn view of the fact that you appear to have a short-term deadline,\nI am giving you my recommendations on the four applications* I would\nrecommend disapproval of the applications from Ithaca College and from\nGeorge Washington University, and for the same reason in both cases: that\nI would hate to see the MEB*s limited research funds wasted* The Ithaca\nproposal calls for research of a most complex and sophisticated kind on\naudience perceptions, program effects and program consequences. With all\ndue respect to the economists who are proposing blithely to do all this,\nI doubt that they know jgst what they are getting into* Certainly they\npropose no research procedure which assures me to the contrary* If they\ncould propose a limited and competent design for research on their pro¬\nblem, I would feel otherwise* But now, no. The George Washington pro¬\nposal is even less competently framed than the Ithaca proposal. For\nwhereas the Ithaca people at least stated their research objective clear¬\nly, the George Washington proposal specifies neither research objective\nnor procedure. To approve either of these would be, in effect, to write\nblank checks.\nThe University of Utah proposal I would recommend be approved, for\nobvious reasons. It proposes pertinent hypotheses and a competent research\ndesign.\nI would also recommend approval of the Ohio State proposal. We bad¬\nly need more attention to the historical aspects of broadcasting and this\nproposal certainly seems both pertinent and competent.\nWith best regards to you and your family.\nCordially yours.\nDallas W* Smyth*\nActing Director"
}