{
  "id": "d226-18",
  "text": "THE OHIO STATE UNIVERSITY\nNovice G. Fawcett, President\nCOLUMBUS 10\nDEPARTMENT OF SPEECH\nJanuary 13, 1959\nMr* Samuel L* Becker\nApartment 61\nU6U Riverside Drive\nNew York 27, New York\nDear Mr* Becker:\nYour letter of January 11, 1959 arrived this morning. Thank you so much\nfor your comments and encouragement*\nAs you may recall, I introduced myself to you after the first meeting of\nthe Radio-TV~F3m Interest Group at the SAA Convention in December* You, how¬\never, gave me the impression that you were quite busy; and would not be avail¬\nable to discuss this project* Mr* Scharrer and I both made the trip to the\nChicago convention primarily to meet you and to present this proposal to you*\nHowever, as with so many such conventions, the opportunities of locating\npeople to talk with them were few*\nWe both attended the Radio-TV-Film Interest Group meetings. But because\nof the current lack of certainty regarding the future and importance of our\nstudy, we hesitated presenting it to anyone* Although we have been at work on\nthis slide catalogue for over a year, we were uncertain as to the real value\nof it to the whole field of radio and television. Part of the reason for our\nattendance at the Chicago convention was to seek out reaction to the project\nto determine some value in it for all*\nNow, however, we are reasonably assured of its value and we certainly\nfeel that other could benefit from it. I have sent copies of the NAEB pro¬\nposal to James Lynch, Bruce Linton and Robert Summers — who are to plan\nthe Interest Group's activity for the 1959 convention in Washington. We are\ninterested in selecting some sections of this slide collection to present\nbefore the Group at that time. This is, of course, provided we are able to\ncomplete our major research work through a grant from the NAEB.\nYour mention of trying to do too much has concerned us, too* But I feel\nthat all the work we've proposed in the NAEB proposal could be accomplished\nwithin the time we’ve allotted. We have already culled the files of NBC, CBS,\nBMI and ABC, for materials; and I belie^TraTwivili^^\nfrom those places already in our collection. Our major photographing will be\nthe NSW York Public Library.\nworking constantly, I believe we can do It. The proposal submTtt^ aoesnTt\nmeTTt:lTm~a this, but wehave a good idea of what isavailable^in\nthese libraries, having been in constant correspondence with the curators\nBesides, if we find that there is just too much to be\nshotin the time we've allowed, we'll remain or return on our own time to com-\nplete the proj e ct. In the spring vacation here at Ohio State, Mr. Scharrer"
}