{
  "id": "d226-56",
  "text": "sms ummmnt m 10m\ntwLMiuim cmtm\nimA cm, im&\nJanuary as, 1958\nI* Keith T$ler, Director\nRadi© mi Telmls±m\\ Education\nOhio State University\nColustes, fei©\nDear Keiths\nJust a brief note to inquire about the state ©£ and pleas for\nthe depletion ®f th& ©eiiiasr report. I realise that yds are tied\nup at the wmsent with the msgmi&&Z±m ©f your yearly Institute.\nHowever, the activities «\\f our research emsa&t&m are pretty well\nstymied until we this report mi a© me are beginning to\nget antsy* Is it possible t© give us a tentative date when each\nstep of the report might 'be exacted — e.g., when rough drafts go\nout to the participants for their proof reading, when these mill he\nscheduled for return to you, and when the final draft mill be ©oa^leted?\nIn order to as^editu matters, 1 an asking each ms^er of the\nresearch committee to jot 4mm ideas, baaed oa the seminar and his\nmm thinking* these ideus should be based on the assisting* that\nthe MU mill har® a Director of Research and funds for large research\nprojects of its own. 1 believe that me mat also think of this in\nterms of a four or five year period. of these proposed projects\nmight be cos^il&tive and analytic©! In nature (such as milling together\nand analysing research findings in the area of learning and getting\nthem into a form useful to educational broadcasters and broadcast\nresearchers) or they might he original research projects (such as a\nstudy of the effect of performer variable® on attention, retention,\nmotivation, etc.). I do not wmZ to structure your thinking (Gads,\n1 sound like a group dynamic!et.) but I feel that w@ need to find\nareas which are not already being done by other® and, from among these\nareas, need to select those which will prove met fruitful in helping\nus to gain an understanding of feetevior a® it is affected by educational\nbroadcasting.\n1 would eppreeiet@ your ideas m the above within the neat month.\nAfter the seminar report is coeploted, we will have these ideas with\nwhich to get us started m our plan of attack. Hope that you will\nreally let yourself go on the above. I would like to see seme truly\nimaginative approaches to our problems!\nCoed luck.\nccs Research committee: aeydleur; living Msrrtlli Kenneth\nl@rw©@d$ HJd@ya &umafea; Percy Tmmmbmm\nDr. Harry Skomia"
}