{
  "id": "d226-60",
  "text": "!\nJh QJ ,119/\nJanuary 10, 1957\nMr. Kenneth Harwood, Chairman\nTelecommunication s\nUniversity of Southern California\nUniversity Park\nLos Angeles, California\nDear Ken:\nSam Becker tells me that you have been designated as Chairman of the Research\nCommittee's Sub-Committee on Research Grants-in-Aid.\nI am therefore sending you, herewith the packet for selection, as follows:\n1. R. Edwin Browne did a study last year to determine the attitudes of college\npresidents to ETV. This study had previously been endorsed by both the NAEB\nResearch Committee and the Professional Advancement Committee. At that time,\nBrowne requested $100 to help defray incidental expenses incurred in connection\nwith the study. Although the Research Committee was in sympathy with this re¬\nquest it came at a time when there were no grant funds available. Therefore,\nBrowne was informed that, if possible, his request would be considered with\nthis year's applications. There is no formal request (therefore no copy enclosed),\nsince the original request was in the form of a letter to Skomia and Coleman.\n2. Kenneth Kager, Instructor in the Department of Communications, requests\nsupport of research entitled \"An Evaluation of The Importance of the Opinion\nLeader in the Audience of an Educational Radio Station\" for the period of February,\n1958 to September, 1958. AMOUNT: $500.00\n3. Burton Paulu, Director of Radio/Television, University of Minnesota requests\na grant -in-aid for a study of the impact of a recently inaugurated in-school televi¬\nsion program service on the radio audience of the long-established Minnesota\nSchool of the Air, to be conducted in February or March of 1958. AMOUNT: $500.00\n4. Father Walter Le Beau, Director, Division of Philosophy, and Religion, College\nof St. Thomas, St. Paul, Minnesota, desires a grant-in-aid to study the problems\ninvolved in the presentation of a marriage course on educational television and the\nresponse of the various groups to this television presentation . This presentation\nand subsequent study to be conducted during the spring of 1958. AMOUNT: $500.00"
}