{
  "id": "d226-65",
  "text": "A SURVEY OF RADIO AND TELEVISION LISTENING\nIN THE LAFAYETTE AREA\nForeword\nThe purpose of this study was to determine the status of WBAA listenership, as\nwell as radio and television listenership in general, in the Lafayette area. The more\nspecific goal was to evaluate comparatively (largely by size alone) the audiences of\nWBAA, other radio stations covering the Lafayette area, and those television stations\nthat are received in the area. Information was also desired regarding the relationship\nbetween radio and television listening in general at different hours of the day.\nThis study is a replication of a study made during equivalent periods one year\nprevious. General comparison is developed between the two surveys.\nThe survey method utilized was of the coincidental telephone type. The data\nare presented in tabular and graphic forms with percentage breakdowns as single factors\nof statistics.\nFindings are of two major types: those conclusions drawn regarding the periods\ncovered by this survey, and comparisons between the two surveys.\nThe analysis of the data for the current survey revealed that WBAA’s share of\nthe listening audience during the total periods was 4.2 ±.4 per cent. WBAA maintains\nits own share of the total listening audience better than any other radio station during\nthe evening hours. WBAA had the highest listenership of any other radio station re¬\nceived in this area during the evening hours, 7:30 to 8:30.\nDuring the whole period of the survey, Radio’s share of the audience appears to\ndecline steadily throughout the day, while television gains in audience correspondingly.\nA comparison of the 1956 and 1957 surveys indicated that during both surveys,\nRadio gradually declined in listenership as the day progressed. Both surveys showed\nthat WBAA maintained its evening audience better than any other radio station in the\narea.\nIntroduction\nOver a period of years WBAA has conducted periodic surveys of its listeners\nand its potential listeners for the purpose of determining the growth and impact of its\nprograms, and also of those of other radio stations with competitive coverage to that\nof WBAA.\nIn recent years, audience surveys have served the double purpose of determining\nthe audience or listenership in general, as well as comparing with previous surveys and\nthereby uncovering useful information on related listening trends. An important added\nfactor that has required attention in the past few years has been the mighty entrance of\ntelevision onto the broadcasting scene. This had to be reckoned with in its impact on\nWBAA’s effectiveness and that of other area-receivable stations. The later surveys"
}