{
  "id": "d226-66",
  "text": "-2-\nhave also shown the year-by-year trends and changes caused by television broadcasting and\nits competitive effect in comparison with preceding survey results.\nIn the present study, telephone subscribers in the Lafayette area were selected as\nthe population to be interviewed. This interviewing was done by the coincidental telephone\nsurvey method. A previous study sponsored by the Division of Educational Reference and\nRadio Station WBAA was conducted last year and the present study was patterned closely\nafter it. Comparison will be made between the two studies of the two consecutive years.\nThis study is necessarily thus reproduced in a form similar to the 1956 survey. In\nfact, where the opportunity presented itself, the same type of information is presented ex¬\nactly as in the 1956 study, with the specific comparable details inserted relevant to this\nsurvey.\nA statement of terminology is considered important at this point. As was the case\nin the 1956 study, the survey is broken down into two major sections. These sections\nare based on the survey periods involved. In the 1956 study the first period referred to\nas \"Survey I\" by the authors was actually a five day period in December. The second\nfive day period was in January 1956 and was referred to as Survey II. Since this study\nwill make a comparative analysis of the two gross surveys (the 1956 Survey and the pre¬\nsent study), it is necessary to deviate slightly in terminology, as follows:\nHereafter, the term Survey I, 1956, will refer to both \"Survey I\" and \"Survey H\"\nof the preceding (1956) report and these terms will become December period (Survey I,\n1956) and January period (Survey I, 1956) respectively. For the corresponding periods of\nthe present study the designation will be the December period (Survey II, 1957) and Jan¬\nuary period (Survey II, 1957), as the case may be.\nMethods of the Study\nFrom those households having telephones in the Lafayette area, 12, 000 numbers\nwere selected by random sampling techniques. By \"Lafayette area\" is meant that largely\nurban area of residence encompassing urban Lafayette and West Lafayette and their immed¬\niate environs.\nThe 1956 Lafayette telephone directory was used as the source of telephone numbers.\nEvery fifth number was selected successively starting with the fifth number on page one.\nWhen a number was obviously a non-residential telephone subscriber, such as a business,\ngovernmental, or University business phone, these numbers were omitted. Upon reaching\nthe end of the directot-y the process was repeated starting with the sixth number and select¬\ning each successive fifth number. This process was continued until 12, 000 numbers had\nbeen selected.\nEach telephone number represented a residence with a private telephone. As with\nlast yearTs coincidental telephone survey, calling was conducted during two separate five\nday periods. Three hours of calling was performed on each of the weekdays of the two\nfive day periods. The first period of the present study, (December 10-14, 1956) covered\nlargely the morning hours; the second week of surveying, one month later, (January 7-11,"
}