{
  "id": "d226-67",
  "text": "-3-\n1957), covered largely the evening hours. The three hour periods were from 9:00\nAM to 12:00 noon the first week, and from 11:30 AM to 12:30 PM, 5:30 to 6:30 PM,\nand 7:30 to 8:30 PM the second week. Thus there was one half hour period (11:30\nAM to 12:00 noon) common to both survey times of the two weeks.\nFive private telephones with direct outside lines to the Lafayette exchange\nwere used for the calling, and student volunteers (one for each of the five phbnes\nfor every fifteen-minute period) acted as interviewers. Each interviewer was\ngiven a sheet of printed instructions prior to his interviewing. (See Appendix I.)\nEach interviewer was also given a data sheet, upon which were the numbers for\nhim to call. Each data sheet contained 20 telephone numbers, and all necessary\ncolumns and spaces for fast data-entering. (See Appendix II.) Each interviewer\nused one of these sheets every fifteen minutes. Thus, a maximum of twenty\ncalls was attempted by each interviewer each fifteen minute period. Other de¬\ntails of interviewing procedure may be found in the instructions to the inter¬\nviewer (Appendix I).\nConclusions as to trends, significant changes, inter-station comparisons\nand so on are made in this report with reference only to the Lafayette area of\nlisteners. Very different conditions may exist outside of this listening area.\nResults of December Period (Survey II, 19 57)\nThe Survey was conducted from 9:00 AM to 12:00 noon for the five day\nperiod beginning Monday, December 10, 1956.\nThe data from the first week are presented in Tables 1-4. Most of the\ndata in this report will be presented in similar tabular form. Therefore, a\nbrief explanation here of Table 1 should suffice in explanation of successive\ntables of the same type.\nTable 1 summarizes the results obtained from all calls made during the\nhour beginning at 9:00 AM on all five days covered by the first survey. The\ntable consists of four sections. The first is labelled \"Raw Figures.\" This sec¬\ntion contains the totals derived from all the interviewer data sheets during the\n9:00 hour. The totals from this gross total are broken down by fifteen minute\nperiods. For example, in line A we see that 449 calls were attempted from\n9:00 to 9:15, Monday through Friday. Of these, there were 141 no answers, 55\nlines busy, and 253 calls were completed. Of the 253 interviewed, 192 own a\ntelevision set. Also of the 253 homes covered, 76 persons were listening to\neither radio or television and 177 were not listening to either. Of the 76 lis¬\nteners, 40 were listening to radio and 36 were watching television. These lis¬\nteners are further broken down among stations. The totals for each fifteen\nminute period are summed across the rows to the right to obtain the totals for\nthe entire hour. A number of checks for arithmetic errors can be made in any\ncolumn:\n1. B+OD -A\n2. F+G-D\n3. Sum of H= 1+J= G"
}