{
  "id": "d226-80",
  "text": "-16-\nIt should also be noted that while all other radio stations are losing in their\nshare of the audience, television^ share increases from 77.4% during the 5:30-6:30\nhour to 87.6% during 7:30-8:30 hour. The drop in listenership for all radio from the\n5:30 hour to the 7:30 hour is from 22. 5% to 12. 7%. WBAA's share of audience figures\nduring the 7:30 to 8:30 hour averaged between 3% and 6%. During this period, classical\nmusic was the basis of WBAA program content for three out of the five days surveyed.\nOn Monday evening, however, WBAAfs share of the audience during the 7:30 to 8:30 hour\nranged between 11% and 13%. On this evening WBAA carried a sports broadcast of the\nPurdue University vs. Ohio State University basketball game.\nTable 12 presents the evening programs of WBAA and their ratings.\nTable 12\nMonday Tuesday Wednesday Thursday Friday\n7:30\nPurdue vs. OSU\n8\nMusic\n0\nMusic\n2\nMusic\n0\nMusic\n1\n7:45\nit\n7\nft\n1\n»t\n2\ntt\n1\nit\n0\n8:00\nIt\n8\nit\n1\n»»\n2\ntt\n3\n*\n3\n8:15\nft\n6\nit\n1\ntt\n2\nif\n0\nit\n0\n* West Lafayette High School (Basketball)\nRelative ranks of radio and television stations for the January period (Survey II,\n1957) are presented in Table 13.\nComparison of December Period and January Period of 1957 Survey\nThese two periods include a half hour in common, 11:30 to 12:00 PM. The purpose\nof having this overlap was to develop some estimate of stability of results obtained.\nThe share of audience and ratings for the 1957 survey are presented in Table 14.\nThe pattern seems to be similar in each period with certain exceptions. Television\nappears to have gained a greater share of the audience, going from 60.7% to 66%.\nOther gains and losses appear to have occurred in light of the raw percentage shares\nof audience. WASK, WFBM-TV, and WISH-TV each appear to have changed in their\nshare of the audience. These three stations were selected for statistical comparison\nbecause of the apparent divergence between the two periods.\nThe standard error of the proportions in question were determined and are as\nfollows:"
}