{
  "id": "d226-82",
  "text": "-18-\nDecember Period\nJanuary Period\nShare\nSE\nShare\nSE\nWASK\n19.1\n2.8\n12.8\n2.6\nWFBM-TV\n31.0\n3.2\n34.4\n3.6\nWISH-TV\n19.6\n2.8\n22.2\n3.1\nRADIO\n39.2\n3.4\n33.9\n3.6\nT. V.\n60.7\n3.4\n66.0\n3.6\nThe standard error is a statistic which tells you the degree of confidence\nthat you can place in the obtained percentages. For example, in the December per¬\niod it was found that 19.1% of the listening audience was tuned to WASK. The\nstandard error of this percentage for our sample is 2. 8. If repeated samples were\nto be drawn of the same size and in the same manner we would expect the obtained\npercentages of listener ship to WASK to be within one standard error (2. 8) of 19.1%\n— about two thirds of the time. We may expect to obtain percentages within two\nstandard errors 95 times in 100, or within three standard errors 99 times in 100.\nIn the second period, January 10-14, 1957, 12. 8% were listening to WASK\nduring the 11:30-12:00 hour. This is 6. 3% less than the percentage obtained in\nthe December period, thus slightly less than three standard errors difference was\nfound between the two percentages. If the population were the same, we would ex¬\npect to obtain such an extreme deviation 1 time in 100. For WFBM-TV, the dif¬\nference between the two percentages is slightly less than two standard errors.\nThis difference would occur by chance 4 times in 100. Likewise the differences\nbetween the total percentages for radio listenership for the two periods and be¬\ntween the total percentages for television listenership are also slightly less than\ntwo standard errors.\nWe conclude that these shifts in the share of listenership represent true\nchanges in listenership and are not due to sampling errors.\nResults of C ombining Two Periods\nThe grand totals of both periods (December and January) of the 1957 survey\nare presented in Table 15. During the hours surveyed it is estimated that 32% of\nthe homes have either radio or television turned on.\nWBAA ranked second among all radio stations with 4. 2% of the audience.\nWe would expect WBAA’s share of the audience to be between 3.4% and 5. 0% 95\ntimes out of 100 if random samples were repeated in the same manner.\nRadiofs share of the audience was 31. 9%. We would expect the figure to lie\nbetween 29. 8% and 33. 0% 95 times out of 100.\nWFBM-TV carried 31.9% of the listening audience, while WISH-TV and\nWTTV followed second and third with 16. 6% and 11. 2% respectively."
}