{
  "id": "d226-85",
  "text": "-21-\nTable 16 presents some of the general information of the 1957 Survey. More than\nthree fourths (78.1%) of the population has television in the home. During the morning\nhours, (9 ofclock to 12 o'clock), 27% of the television sets are in use and during the hours\nof the January period, which are predominantly in the evening, 52.4% of the television\nsets are in use.\nOf the attempted calls, 31% did not answer and 12. 3% of the telephones were busy.\nThe percentage of completed calls is slightly more than 10% higher in the later part of\nthe day (January period.)\nTable 16\nGeneral Break-Down (1957 Survey)\nDecember Period\nJanuary Period\nCombined\nTV ownership\n74.9\n81.1\n78.1\nLess than year\n14.6\n9.7\n10.3\nMore than year\n60.3\n71.4\n67.8\nNo answer\n36.4\n25.4\n31.3\nLine Busy\n12.4\n12.0\n12.3\nCalls Completed\n51.1\n62.5\n56.4\nListeners/completed\n37.8\n54.7\n46. 5\nListeners/attempted\n19.3\n34.2\n26.2\nTV Sets in use\n27.0\n52.4\n40.4\nRadio's share of the audience at the various hours covered is graphically portrayed in\nFigure 1. There is a progressive decline throughout the day from 50. 9% during 9:00\nto 10:11 AM to 12.7% during 7:30 to 8:30 PM. Each percentage is accompanied by its\nstandard error.\nCommensurate with the presentation of the 1956 Survey, Figure 2 illustrates\nthe share of audience maintained by WBAA. This may be used to indicate the relative\nappeal of the various programs on WBAA, but the figures are relatively unreliable and\nshould be interpreted with extreme caution. The figures are not stable because they\nare based on a small number of cases. It is not customary to use standard errors of\nextremely high or low percentages. Since all these percentages are less than 10, no\nstandard errors are given.\nIn all the data presented this far, one concern has been with the number of\nradios or television sets in operation rather than the number of persons listening.\nTable 17 shows the ratio of the number of persons listening to the number of\nradios tuned to WBAA for each hour. For example, between 11:30 and 12:30 an aver¬\nage of 1.91 persons was listening to each radio tuned to WBAA."
}