{
  "id": "d226-9",
  "text": "February 21, 1959\nMr* Lany Walcoff\nAssistant Program Director\nRadio Station WSBI\nthe State University of Iowa\nIowa City, Iowa\nDear Larxyi\nfirst of all, congratulations on toe HA, the forthcoming child, and\nyour decision to move, which I believe is a wise one* I have sent\noff the first recommendation form and will send off the others as\nsoon as I receive them * I do not knew of a job in the East at the\nmoment but will certainly keep my eyes open and let yon know if I\ndo hear of one*\nI appreciated your sending me an outline of the result® of your study*\n(I have not yet received the record but looking forward to hearing that\nalso*) It occurred to me that yon ought to extract the most important\npart® of your study and write them up for publication in the HAEB Journal*\n1 believe that there are parts which are relevant not only tol®F5u£\nto anyone interested in in-school radio broadcasting today* If you\nlike, I would be happy to look over and criticise anything you wrote\nbefore you submitted it to the Editor. (Don't feel obligated to send\nit to me first. I do think that it is a good idea, in general, to\nhave someone other than yoursblf take a good hard look at it before\nyou do the final draft.* am sure that there are other persons on the\ncampus who would also be happy to look at it.) I think that this sort\nof publication is one of to© responsibilities of a researcher. lour\njob is not really completed until you do this. Also, looking at it\nselfishly, this would be good for you professionally. It would look\ngood cm your record to have a publication. It would also make your\nmam familiar * at least more familiar - to the operator® of educational\nbroadcasting stations and production centers*\nIf you decide to write this up for the MAKE Journal, I would think\nthat points 1, 2, k, 5, 6, 7, and 8 in your summary and 2 and k\nin your recomraendat ions should be included —* though not necessarily\nin the fora in which you have them of course. For example, on point\n2 of the summary, we need an educated guess * car hypothesis - cm the\nreal reasons for not listening more. Does your study S^v® yo& some\nbasis for some hypotheses about this — hypotheses which later studies\nmight test? Ion say that after ten years the methods of utilization\nhave remained fundas^ntally the same. From this study aid the thinking\nyou have done about it, should this bet If changes should have\noccurred, what do you think they should bet then you need some solid\nrecommendations which might help educational broadcasting generally.\nIn all of this, try to dig out of your study and experience those ideas\nwhich everyone does not already know - or think he knows.\nAgain, thank you for writing* Good luck in your job seeking. Keep me\ninformed of how it goes.\ncct Dr. Barry Skcrnia, Executive Director, HAEB"
}