{
  "id": "d226-99",
  "text": "-35-\nAPPENDIX I\nSPECIAL STUDY OF RADIO AND TV LISTENING\nGeneral Instructions\nAdvance Preparations:\n1) Each report sheet represents calls to be made during a specific 15-min¬\nute period, as indicated at the top of the sheet. As soon as you get your\nsheets, check to see that they represent the correct periods — when\nyou are available -- and that a day and period are written in.\n2) Check each report sheet to see whether phone numbers have been en¬\ntered in spaces under ’’number called” at the left.\nDay-of-Interviewing Advance Preparations:\n1) Before starting your interviewing, check your watch with radio time, to\nbe sure it*s correct. Also, provide yourself with two or three well-\nsharpened pencils.\nInterviewing:\n1) Don?t call the first number on the list on your report sheet until one\nminute after the beginning of the 15-minute period indicated. Give\nyour listeners a chance to time their programs in before you call.\nFor instance, if you®re assigned to the 15 minutes beginning at 8:00\no'clock, make your first phone call at 1 minute past eight, not at\n8:00 even and end at 8:15.\n2) If the operator tells you that the number has been discontinued, or\nthe phone disconnected — draw a line through that number, and go\non to the next on your list. Do not attempt to re-call new number\ngiven to you by the operator!\n3) If you get no answer, after waiting for five full ’’rings”, hang up —\ncheck under ”no ans”; and go on to next number.\n4) Similarly, if you get a ’’busy” signal, check under ’’line busy\" and\ngo on to the next number.\n(Note: Do not try to get either a \"no answer\" number or a\n\"busy\" number later. One call is enough, for each number.)\n5) Take numbers in order as long as you can — and still stay within\nyour 15-minute period. Maybe you1 2 3 4 511 not finish all 20 of the num¬\nbers listed; if not, no harm's done — just do as many as you can.\nBUT — when your watch shows that it's 15 minutes after the begin¬\nning of your period, stop. Just leave spaces blank, opposite num¬\nbers you didn't get to try."
}