{
  "id": "d503-12",
  "text": "University of Washington\nSeattle 5, Washington\nMEND TO: Dick Hull\nRay Hurlbert\nBill Harley\nJuly 5, 1962\nGentlemen:\nYou must all realise that I have been most extraordinarily quiet for the last\nfew weeks. But then, a man about to go under the waves for the last time isn't\nusually found shouting a lot of advice to others. How that I’ve finally found\na quiet eddy in a flood of work, I’m starting to dry out a bit and look around\nagain. Tut it’s temporary. I leave in the morning for summer camp in Utah.\nMy specific purpose in writing this short note is the recent flap over the TV\nproduction action taken by the UAEB Board at its Columbus meeting this spring.\nI haven’t been at all oblivious to the repercussions that followed, and several\ntimes had stationery in the typewriter to fire my own salvo at the insurgents\n(one of them was holed up within rifle range of here, at that.) It’s just as\nwell I didn’t, as your joint memo of June 12th said most of what I had in mind\nmore temperately than I would have been likely to phase my reaction, tour\nmemo arrived the day my masterpiece was finally finished, so the full text of\nwhat I had to say on the matter was lost to posterity. The truth was finally\nout.\ntherefore, congratulations to each of you. I do regret that I was not included\nas one of the writers, as some of the heaviest fire was directed at the upstarts\non the Radio Board, and I feel I should have spoken up for them.\nX would also have liked te add one additional point to your nemo...the fact\nthat the original proposal emanated in the Jevelopsaant Committee and vas\npresented for Board action as a revenue producing measure for the HAES. While\nsome Board members may have leea broader in the action, I’m sure\nthat most of those who did not participate in the TV Board discussions accepted\nthe whole proposal at face value and voted upon it for its revenue potential.4f\nAgain, congratulations for a job well done. The president and the Board owe\napologies to no one for their actions, elthough I suspect that a couple of\nIndividual members of the Board might well examine their consciences with apology\nin mind.\nGood summer to you all--and keep me in mind the next time there is a good fun\nsession in prospect.\nSincerely,\nKen Xager, Chairman\nRadio Board\nKKiiaes t \\"
}