{
  "id": "d503-19",
  "text": "STATE UNIVERSITY OF SOUTH DAKOTA\nVERMILLION\nJune 12, 1962\nMr, William G. Harley, President\nNational Association of Educational Broadcasters\n13U6 Como Avenue, N.W.\nWashington 6, D. C,\nDear Bill:\nI was most interested in your communication of May 25th in which you briefed\nmanagers of ETV stations and closed circuit systems on the proposed authorization\nfor you to contract for the package production of two educational television series\non an experimental basis,\nI have given this rather long and serious thought, and I, without perhaps\nhaving all of the information I should have, must at this time voice my skepticism\nand general disapproval of such a move which would involve the NAEB in such a pro¬\nject, I do so for two main reasons, (1) My Program Supervisor for radio and I\nhave experienced increasing concern over the decline in number as well as variety\nof recent offerings of the NAEB Radio Network. Where at one time KUSD Radio was\nable to fill all of its non-live time with offerings from the Network, we now find\nourselves depending quite heavily on BFA, BBC, and CBC to round out our daily\nschedule. For this reason, it would seem more appropriate to strengthen and bolster\nthis important service rather than divert effort and money to ETV. (2) In view of\nthe fact that most stations now provide about one-sixth of the cost of NETRC programs,\nthe balance of the cost being provided by foundation or underwriter support, it\ndoesn*t seem that the stations can afford another service.\nI realize that the two kinds of NAEB projects anticipated call for underwriting\nby private or governmental agencies. I also realize that an ETV station should have\nat hand all of the possible program sources it can get. However, at the moment I\nseriously doubt whether another production agency would serve to strengthen the\nexisting service from NETRC, or for that matter, build a solid effort in this dir¬\nection by NAEB on what would be a competitive basis. It would appear to me that\nsuch an undertaking might be justified sometime in the future when and if it is de¬\ntermined that one producing agency is not providing a sufficient number of variety\nof substantial programming.\nThese are ny feelings. However, should the NAEB divert its effort toward these\nprojects, I would give it my full support, realizing that it is a production experi¬\nment and that NAEB is not committed to anything beyond that at the moment. n\nNAEB HEADQUARTERS\nJUN 14 1962\nl\nyours.\ntin P. Busch\nDirector\nKUSD Radio-TV-Film\nMFBiks"
}