{
  "id": "d503-2",
  "text": "ilemnea - KNME-TV * **M this experimental production Is vital to NAEB* l a® of the\nopinion that the tele vision membeis stations should be contacted as to the dash ability\noi suoh an action because the program needs of a non-commercial station can., be\nbest reflected by the poisons who are on the local scene, I, at that time was opposed\nto the idea, and still am opposed to it \"\nBurrell F, Hfrffffp * fltyh atytf * “Though the memo was very carefully phrased to emphasise\nthe 'exper imentfei' nature of such an undertaking there does appear to Ue implicit In. it\nsomewhere the idea that a competing ETV Network m being considered* There are many\ncriticisms—some justified, I am sure—of Bet's operation. However, our educational\ntesouices. especially financial ones are probably not yet so numerous that competitive\nTV programming can be supported. If there are limitations of Quality la present programs\nit is not apparent to me how a dividing d our resources into competitive programming would\ncorrect the problem The 'closed corporation’ aspects of NET'S organisation likewise is\nbefog criticised—I too, protest—but how will this 'experiment* slier that?**\n“1 can see virtue in an ’experiment*, From this memoranda, however, it is not clear to me\nwhet the experiment is really supposed to test • I'd like to know more about the hypotheses\nupon which it is based ms which U will test. Too, I should appreciate a mere explicit\nexpression of the present problems, and of the rpal objective of the experiment*\"\n“My preference generally, however, is for cooperation and combination rather than compe¬\ntition and diversification when resources are so hard to come by as they are in education.\"\nI, Michael Collin* WUMSHBL - Discusaes only by-passing of TV mastership * \"A* Mr •\nGunn mentioned, if the above is not brought so MAES mmmbms foe consideration, we will\nhave to seriously evaluate our continued membership in MAH/*\nKeith 1, Nighbert WENH-TV - “I cannot support the MAES Board of Directors plan. I would,\nhowever, welcome early action by the NAEB Board encouraging and providing the means by\nwhich stations might exchange educational television series, fro© station to station, on a\nfree exchange basis ,**\nlames M. Morris - KOAC-AM-TV - *’ Two competing organisation* which seek to speak for\na group of stations in tha search for program material and for donors of production funds\ncannot help but confuse the 'image' of educational radio or educational television,”\n“The strength of the radio network is in having one. strong organisation, not two competing\nservices. Likewise the strength of the ETV network is in having one group of affiliates\nand one central approach to the dollars with which to produce network programs» It seems\nto me that the affiliates and the NETRC have a good working agreement on this approach\nfor such production funds NAEB entry into this Held could only confuse the problem for\neveryone concerned^ _\n“I would also be concerned about the idea of seeking donor participation and production\nof a series without the additional commitments regarding duplication and distribution,\""
}