{
  "id": "d503-39",
  "text": "-5-\nNJ.S..(4 Replies)\n1. Why not refer groups interested in underwriting programs to NETRC ?\n2. Does an interest by NAEB in quantity and quality improvement necessarily mean that\nNAEB should enter the production business ? Might this not deter potential underwriters\naway from NETRC, thus restricting their financial capability to improve their service to ETV?\n3. Since NAEB is our spokesman for ail educational broadcasting, won't their value in this\ncapacity be Impaired if they undertake an endeavor which may be felt to be in competition\nwith the interests of a segment of NAEB’s membership, namely the NET affiliate stations?\nIs it conceivable that this would bring about a rift in NAEB? NET is only a subscription\nservice to us, whereas NAEB must serve as our united spokesman. We cannot endanger\nNAEB's role in this respect.\nBlair L. MacKenzie WHRQ-IV - “lam not quite sure of what is meant by 'TV programs of an\neducational nature’—whether the intent is instructional material for in-school use, adult or\ngeneral Instructional material, or programs of a general oi cultural nature...\"\n1 would question the value of producing from scratch an ITV series. We have just gone through\nan arduous search for suitable instructional taped series that we could use to supplement our\nlocal courses. This sounds quite contradictory, I suppose, but I think that the introduction of\none new series would do little to ease the problem.\"\n\"I am certain that all of us are most interested in the continued upgrading of quality but I\nwould question the contribution that one series could make at this time. Rather, isn't there\nthe possibility of dividing the educational television effort at a time when it is gaining\nmomentum ? \"\n\"At the last IERT meeting I got the impression that NAEB was attempting to disassociate itself\nfrom the nuts-and-bolts of broadcasting. Therefore, your memo was a mild surprise.\"\nGerard L. Appv, Univ. of Georgia - \"First, every station can always use 'more distinctive*\nETV programs, but 1 am not certain that NAEB is particularly in a position to contract or sub¬\ncontract for such programs better than existing agencies. Secondly, certainly no one can\nobject to legitimate experimentation. 1 do not. However, if the experiment is conducted to\ndetermine whether NAEB can produce 'more distinctive' programs, that is one thing. If the\nexperiment, however, is conducted with a second goal of improving NAEB's financial status,\n2 believe this has elements of danger.\"\n\"In either event it is my personal belief that NAEB should, at least a good many years ahead,\ndevote its major energies to improving its status as a professional organisation.\"\n\"I question the value of production of the kind you describe, experimental or oot, that does\nnot carry with it the assurance of duplication, distribution, and use.\"\n\"I deeply hope that every possible step is taken to insure that this kind of project will\nstrengthen rather than weaken the organisation.\"\nDonald E. Schein, WMHT - \"Since NAEB leadership has been approached by groups\ninterested in underwriting ETV programs, would be that in the interests of its membership\nit might very well contact those stations which are capable of producing such programs to\nsee if there is intere^.\" <<Since NAEB has offered a service to its individual members in"
}