{
  "id": "d503-43",
  "text": "Hampton Roads Educational Television Association\nAn Association of the\nSchool Boards of Hampton and Norfolk\nBUSINESS OFFICES\n402 E. Charlotte Street\nNorfolk 10, Virginia\nFrom:\nTELEVISION CENTER\n735 Pembroke Avenue\nNorfolk 7, Virginia\nJune 8, L962\nTRANSMITTER\n1932 E. Pembroke Ave.\nHampton, Virginia\nMr. William G. Harley\nNational Association of Educational Broadcasters\n1346 Connecticut Avenue, N. W,\nWashington 6, D. C.\nDear Sir:\nThis is in reply to your memorandum of May 25 re \"Experimental TV\nProduction\" in which you asked for comments and suggestions.\nI am not quite sure of what is meant by \"TV programs of an educational\nnature\"-whether the intent is instructional material for in-school use,\nadult or general instructional material, or programs of a general or\ncultural nature (Educational with a capital \"E\"). ^\nPerhaps subsequent detailed plans, which you mention, would help me in\nfirming up some of my thoughts and reactions. At the present these are\nrather nebulous. For whatever they are worth, however,''i would question\nthe value of producing from scratch an ITV series. We have just gone\nthrough an arduous search for suitable instructional taped series that we\ncould use to supplement our local courses. This sounds quite contradictory,\nI suppose, but I think that the introduction of one new series would do little\nto ease the problem. *\nIf general or adult instruction is the intent I think there is more possibility\nof success. We have also been searching this field and with little progress.\nSpecifically, we are interested in series in typing, shorthand, bookkeeping,\nand consumer economics (courses that have received the most interest in\nour adult training courses in night schools).\nIn the area of general cultural programs--I don't know. ^ I am certain that\nall of us are most interested in the continued upgrading of quality but I\nwould question the contribution that one series could make at this time.\nRather, isn't there the possibility of dividing the educational television\neffort at a time when it is gaining momentum? 'V\nNAE8 HEADQUAR[£aS\nJUN 11 i962\nAM pm\nI"
}