{
  "id": "d503-5",
  "text": "August 2, 1962\nJohn F* White\nNETRC\n10 Columbus Circle\nNew York 19, N. Y*\nDear Jacks\nThanks so much for your most courteous and detailed reply to my letter\nof July 13th* In looking now at my letter I see I should have tried\nto spell out my point of view more fully •• but I was trying to get\nseveral things off my chest before I took off for some vacation and\nI guess I belong to the school which says \"if you can’t say it in\none page, don’t say it”*\nI am understandably pleased that the members of the FCC and their\nstaff are as Interested in and friendly to educational broadcasting\nas they currently appear to be •• but 1 expect some substantial part\nof their enthusiasm for us is that we are moving in the direction\nthey want broadcasting to move* But what happens to us if we don’t\nmove as fast or as far as they wish us to move*\nI am most disturbed by the story in the current (July 30) issue of\nBROADCASTING which, on page 5, reports that the FCC staff has urged\na regulation which would require all educational stations to carry\npolitical broadcasting* If the FCC could require us to carry political\nbroadcasting they could require us to carry *• or not to carry «• almost\nanything else they desire, and we would no longer be locally controlled\nfacilities responsible to our own communities and to the schools which\ncreated us, but to the bureaucracy in Washington*\nPart of my concern about the \"network concept\" of the Center grows\nout of my honest belief that if the educational stations are to\ncontinue to be \"educational\" they have to be related to the educate\ntonal institutions of the individual communities and responsive to them*\nTo the extent that we divest ourselves of increasing degrees of control\nto someone else, whether the FCC or NETRC, we are moving away from the\nlocal control which I believe to be so necessary*\nBefore you finally decide that you want to be a \"network\" within the\nFCC meaning you should read the FCC Report on Chain Broadcasting,\nCommission Order No. 37, FCC Docket No. 5060, May, 1941* Do you\nreally want to subject your operation to the type of regulation the\nnetworks now have and will have in the future? The Commission will\ncontrol you. If only through the station licensees, just as they now\ncontrol the commercial networks* How will you justify the territorial"
}