{
  "id": "d503-51",
  "text": "STATION WGTE-TV\n2801 W. BANCROFT ST.\nTOLEDO 6, OHIO\nJural 7, 1962\nMr. Lorca Stone\nStation KCTS-TV\nUniversity of Washington\nSeattle 5, Washington\nDear Loren:\nI’m concerned about your Letter of June 1 (and May 23 letter to TV members\nof Region VI) because I respect both you and Barley and now feel that ray\nletter (copy enclosed) of May 29 to Harley was probably precipitate. The\nthird paragraph cf Harley’s letter now has more significance and meaning\nthan it did prior to your letter.\nThe main Issues that you have raised are (l) the wisdom cf creating through\nHAEB, another television program service competitive with HBTRC/ and (2)\nyou question whether \"the stations can afford another service, or that HAEB\ncan finance a service of any consequence from other than station funds/*\nand finally, (3) \"to the extent that HAEB win seek or accept underwriting\nfinancing of programs they are confusing the national image of educational\ntelevision and creating a competition for the present program service\nwhich may decrease Its effectiveness by far more than the value of new\nprograms to be produced by or for HAEB.\"\nm On the first issue, the wisdom of creating another television program ser¬\nvice competitive with HBffiC, I had the impression that the Center was not\na continuing philanthropy to be underwritten by the Ford Foundation, but\nthat eventually it would have to be self-supporting. I am not aura that\nHAEB’s service need be competitive—it could be suppleamntaiy,‘ and address\nitself to special needs of certain subject and Interest aims not served by\nHECBC or not served adequately by HBTRC. “\nI have no quarrel with HETRC, but neither do I think that it Is the final\nanswer to all program need®, nor do I think that it is necessarily the\nstandard of excellence in programming, and la the long run it ahould profit\nfrom this evidence of growth and maturity and independence in our HAEB\nBoard.\nSincerely,\nDirector\nHDL/jb\nJUN U m\nDick Hull"
}