{
  "id": "d503-58",
  "text": "June 5,1962\n®ir. Loren Stone\nManager, KCTS-TV\nUniversity of Washington\nSeattle, Washington\nDear Loren:\nI, too, regret that you feel you are 4,in complete disagreement4* with me\non the matter of NAEB experimenting with TV production. We have usually seen\neye-to-eye on NAEB and other professional matters and I have always had a\nhigh regard for your judgment as well as admiration for your forthrightness in\nexpressing your convictions«\nIn this matter I don't believe we are nearly so far apart as you suppose,\nI have never contemplated having NAEB enter into large-scale TV production\nor make such an activity anything more than a modest sidelines la the\nCenter’s production in radio of one or two prestige programs per year, However,\nI know that you feel, once started, Parkinson’s law will begin to operate and\nsuch activity will breed more of the same, I can only give you my word that,\nso long as I am president of NAEB, I will vigorously oppose such a development.\nIhis is not because I feel we must protect the Center from competition or believe\nthat it will confuse the national image of ETV, etc 4 it is because ! am convinced\nthat NAEB must move to become a truly professional organisation and operational\nactivities (however useful) will necessarily dilute such efforts and divert energies\nand attention from the prime goal. It was for this reason that I suggested to the\nBoard and to the audience at the NAEB luncheon that I felt the time had come to\ndivest the Association of pperational responsibilities and establish them separately\nI look upon the undertaking authorised by the Board as a true experiment. The\nresults may well prove completely negative from the standpoint of need and admin¬\nistrative feasibility; in which case that's the end of it. If they are positive, and\nthe majority membership feels on the basis of these results that more ETV production\nwould be a useful and appropriate service, it would have to be developed under\nother auspices than those of the professional association—possibly by a separate\nautonomous division."
}