{
  "id": "d503-6",
  "text": "Jack White\n-2-\nexclusivity you now maintain — whei^in you will not offer service to\na station which lies within the Class A contour of an existing affil¬\niate* We have every freedom now to take or not to take programs from\nNETRC that a station does in purchasing from a package producer* Why\nshould we and you be saddled with the \"network\" regulations when we are\nnot inter-connected.\nOur friend Mr* Minnow is now talking about adopting the industry\ncHdes and having them applied by the FCC against licensees* He will\nnext be asking the educational stations to subscribe to the NAB Code,\nThat will be like asking the text book manufacturers to agree to a\ncode governing the publishers of comic books. But it is no more\nridiculous to suppose the FCC might pressure us into such a code than\nthat they would require WTTW to participate in the station hearings in\nChicago. John Taylor and his staff did a fine job of presenting the\nstory of educational broadcasting, but why should they have been forced\nto go to the time and great expense of preparing such a case. I really\nfear getting too close in bed with the FCC* They cannot escape having\nthe bureaucratic point of view which has to control and direct those\nthey regulate.\nI realize. Jack, that from your vantage point you do not see that NETRC\nis exerting control over the stations — but there is this control\ndeveloping in increasing amounts, and the potential for more control\nis great. The power you can wield with money is a corrupting one —\nit can easily corrupt the judgment of a statidn in the kinds of\nprograms it should broadcast. When you get an underwriter for a\nprogram series -- and particularly if the underwriter will also\nprovide funds for extensive promotion of the series, it becomes most\ndifficult for a station to make an objective judgment as to the desir¬\nability of that particular series in its schedule. And if you further\nget strong national promotion for the series, few stations could turn\nthe series down.\nAs the Center becomes Increasingly dependent on underwriting help by\nIndustry the percentage of programs which constitute borderline decisions\nfor some stations will increase. You will not be able to get under¬\nwriting unless the underwriter is assured that a large nufaber of\nstations will broadcast the series* The responsibility will be yours\nto get as many stations as possible to run a series, to make sure it\ncan be underwritten. This direction can only end in a need for some\nform of \"option time\", for you will have to deliver stations to satisfy\nthe needs of underwriting. And I see little difference whether you\nrequire stations to deliver time through contract or coerce them by\noffering better quality or greater quantity with underwriting than\nwithout underwriting*\nNow believe me, Jack, I do not in any way question your sincerity or\ndetermination to do the very best job you can for educational broad¬\ncasting. No one — and I sincerely mean that — no one has worked\nharder to develop healthy stations and good programs than you have in\nthese past few years* But I am seriously concerned about the judgment"
}