{
  "id": "d503-65",
  "text": "W H V V\nEDUCATIONAL RADIO AND TELEVISION\nMANAGING DIRECTOR\n15 2 5 CHESTNUT ST., PHILADELPHIA 3, PA.\n, .LOcust\nJune 1, 1962\nMr. William G. Harley\nPresident\nNAEB\nDupont Circle Office Building\n1346 Connecticut Avenue, N.W.\nWashington 6, D.C.\nDear Bill:\nIn response to your memorandum of May 25, 1962 regarding\nexperimental TV production by the NAEB, my feelings are as follows:\nThe NAEB has a right to consider independent TV program\nproduction, for the purpose of determining competence and quality of\ncontribution in this area. However, since this effort involves a\nmajor policy change, the Board of Directors should have sought a wider\nexpression of support from the TV members before making its decision.\nIt was undemocratic and arrogant of the full Board to override the\nTV Board on a matter which so directly affects the TV members.\nIn his letter of May 24, 1962 to Hartford Gunn, Ray Hurl-\nbert stated that he had sought opinions on this matter from a \"number\"\nof NAEB active TV members other than the TV Board members. I wonder\nhow many and whose opinions were sought? To my knowledge, none of\nthem were in Region I.\nI am not disturbed by the competitive factor raised by\nLoren Stone in his memorandum of May 23, 1962 to members of Region\nVI; the only really important initials in respect to a national image\nare ETV, not organizations. However, as the manager of an NAEB active\nTV member station, as an individual member, and as chairman of the\nTV Planning Committee, I feel frustrated and infuriated by an action\nthat I can only regard as cavalier and hostile.\nK EC '\nNAEB HE/’\nSincere\nJUflU !•- v\nc.Qw-i: Hartford Gunn\n71vi Richard5Hull\nRaymond Hurlbert\nLeslie Martin, Jr.\nKeith Nighbert\nDonald Schein\nLoren Stone\nDonald Tavaner\nRichard S. Burdick\nExecutive Vice President\nand General Manager\nWHYY, INC WILLIAM OOLDMAN, PRESIDENT ALLEN T. BONNELL.VICE PRESIDENT RALPH W. PITMAN. TREASURER MRS. RALPH J. ROBERTS. SECRETARY\nDONALD K. ANGELL RICHARD M. BURGESS ANTHONY R. CATRAMBONE W. LAYTON HALL GEORGE H. HENRY A. LEON HIGGINBOTHAM. JR.\nLOUIS P. HOYER PHILIP KLEIN J. HARRY LA BRUM JAMES J. LAPENTA. JR. LIONEL F. LEVY RT. REV. MSGR. E. M. REILLY JOHN B. ROBERTS\nABE S. ROSEN WILMER E. SHUE ALVIN A. SWENSON HON. JAMES H. J. TATE GRANVILLE S. THOMAS\nEDWARD F. TOOHEY ALLEN H. WETTER MRS. H. GILBERT WILSON\nLEWIS WE IN STOCK. ESQ., LEGAL COUNSEL"
}