{
  "id": "d1631-2",
  "text": "GENERAL\n^ KFME, Fargo (N.D.), has in production the first locally\nproduced college credit course. The series is being used by\nstudents on the Moorhead campus and the North Dakota\nState campus as well. Because KFME has no studio facilities,\narrangements have been worked out with a local commercial\nstation, WDAY, to record the course in their studios.\n^ More than 50 of the country’s top TV and advertising\nexecutives will explore the medium’s potential during the\nnext decade at a three-day seminar sponsored by Stanford\nUniversity under a grant from TV Guide magazine. The April\n25-27 meetings will include lectures by outstanding speakers,\nplus group discussions.\nUnder a USOE grant, researchers at the University of\nexas are exploring TV viewing as a means of continuing\neducation for Spanish-speaking families.\n^ Plans are nearing completion for the extension of ETV to\nall the elementary schools in Monterrey, Mexico, using morn¬\ning time donated by a commercial station. ETV in the city\nhas grown under a Ford Foundation grant and with the tech¬\nnological help from the University of Texas. (The project was\nreported in the July-August 1964 NAEB Journal.)\n^ Station Manager Colby Lewis, of Michigan State Univer-\nsity’s WMSB, in a recent program bulletin appealed to read¬\ners to let the station know what types of programs they\nwould like.\n^ Media is the name of the new monthly 24-page program\nguide listing offerings of Oregon’s KOAC-AM-TV and\nKOAP-FM-TV. The booklet is an enlargement of the former\nguide published for the radio stations.\n^ WJCT, Jacksonville, has acquired a new location to serve\nas combination station and fund-raising center. The new\nbuilding provides space for a studio sixty feet square, as well\nas a smaller studio and ample office space.\n^ Pennsylvania State University’s new station, WPSX-TV,\nbegan broadcasting last month with on-air hours of 10-3 :30,\nMonday through Friday. Later this year an evening schedule\nwill be added. Construction of a studio is scheduled to begin\nthis year, but local production of programs will precede its\ncompletion, as a mobile recording unit will be delivered earlier.\n^ As of July 1, Boston University’s WBUR-FM will be\ntransformed into the “Boston University Magazine of the\nAir,” featuring variety, depth, and responsiveness to the in¬\nterests of an intellectually demanding audience.\n^ Ron Polcari, station manager of WERS, Boston, reports\nan interesting phone conversation. A man called the station to\nfind out where to 'locate WERS on the dial. Upon being told\nthat it was an FM station, he said, “You mean you’re not on\nthe regular radio?” After an explanation that AM uses some\nairwaves and FM others, Polcari says that the man seemed\nsatisfied, but left him feeling that he was managing some kind\nof weird operation not on regular radio.\n^ KWSC-TV, Washington State University, is studying re¬\nquests from school districts and universities in the eastern\npart of the state, asking KWSC to relay its programs to those\nareas via microwave. If adopted, the new service would bring\nthe signal into some ten large and small cities not now served\nby ETV.\n^ William McCarter, of WETA-TV, Washington, assem¬\nbled and hosted a presentation last month of 16 ETV pro¬\ngram segments for viewing by 150 persons, mostly FCC per¬\nsonnel—for a better understanding of ETV.\nANNIVERSARIES\n15th—March 1, Boston University’s WBUR (FM).\n10th—January, WUNC, Chapel Hill, N. C., and WAIQ,\nUniversity, Ala.; April, WB1Q, Birmingham; August, WTHS,\nMiami.\nNAEB Headquarters: 1346 Connecticut Ave., N.W., Wash¬\nington, D.C., 20036. Phone 667-6000. Area Code 202. TWX 202-\n965-0299.\nRADIO STATIONS EXPAND BROADCAST HOURS\n^ KUT-FM, University of Texas, has extended its broad¬\ncast hours until midnight, seven days a week. Program Di¬\nrector Bill Giorda has scheduled a two-hour “Jazz Nocturne”\neach night from 10 p.m. to midnight.\n^ The Wisconsin State Radio Council hopes for a return\nto Saturday broadcasting. The hopes were sparked at a re¬\ncent finance committee hearing on the 1965-67 Council budget.\n^ WGUC, University of Cincinnati, has extended its time\non the air three hours every week day to provide more classi¬\ncal music. The station is now on the air from 10 a.m. to 11\np.m. week days and 12 :30 to 7 :30 p.m. Sundays. The operating\nstaff volunteered to take on the extra 18 hours without extra\npay.\n^ Michigan State University began separate FM radio pro¬\ngraming March 1. Instead of duplicating WKAR-AM fare,\nthe new WKAR-FM programing features a wide variety of\ncultural offerings—serious music, drama, contemporary jazz,\nfolk music, news, opera, Broadway and avant-garde music.\nPROGRAM NOTES\n^ John Henry Faulk, author of Fear on Trial, appeared as a\nguest on the WTTW (Chicago) Book Beat series.\n^ KUED, Salt Lake City, was one of six stations to give\na regional report on the anti-poverty program'- KUETD dealt\nwith the depressed economic conditions among the Indians,\nshowing three types of poverty conditions: Indians on iso¬\nlated small reservations, those on larger reservations (such\nas the LTte-Ouray), and those in satellite living circumstances\nnear cities or towns.\n^ Museum of the Plains is a six-program series produced\nat a unique South Dakota museum by KUSD, Vermillion, for\ndistribution on the Midwest ETV Network.\n^ WJCT, Jacksonville, won a citation from the local Cham¬\nber of Commerce for a 12-program series, Management TV\nJournal. The format featured films provided by the American\nManagement Association telecast at 4:15 p.m. for viewing and\nsubsequent discussion by supervised “in-industry” study\ngroups. At 10 p.m. the film was repeated for the study groups\nand the general public. Following this showing, a panel of\nthree local business leaders answered and discussed questions\nthat had been telephoned to the station by the study groups\nand the public.\n^ Alabama’s ETV series Americanism vs. Communism has\nbeen selected to receive a 1965 Freedom Award by the Free¬\ndoms Foundation at Valley Forge.\n^ In the first major production effort in the new Radio-TV\nCenter studios, Indiana University TV personnel have pro¬\nduced a two-hour full-scale videotape recording of the Puc¬\ncini opera Madame Butterfly.\n^ An hour-long self-portrait of Durand, Michigan, was heard\non WUOM Ann Arbor and WVGR Grand Rapids recently.\nRalph Johnson produced the radio program about the town\nwhich was a key division point on the Grand Trunk Western\nRailroad at the turn of the century. He hopes to produce\nother such programs about other towns and cities.\n^ WBAA, Purdue University, and a local newspaper and\nsymphony society are sponsoring Music Memory Contest. Mem¬\nbers of the symphony society choose the selections, for which\nprogram notes are printed in the paper, and which are broad¬\ncast on WBAA. Students who pass preliminary tests at their\nschools will go to the Purdue campus for a final test on May\n2.\n^ The Eternal Quest is the name of a new TV series about\nJewish history scheduled to debut April 4 on Chicago’s NBC\noutlet, WMAQ-TV. Studs Terkel will host the series, which\nis presented by the broadcasting commission of the Chicago\nBoard of Rabbis. Almost a year in the making, the series is\nsaid to represent one of the most ambitious programs of tele¬\nvised education ever undertaken by a religious organization.\n^ KWSC, Washington State University, is preparing broad¬\ncast reports on the progress of two young teachers in their\nnew school assignment in Zambia. The teachers, formerly of\nWashington State, are employed by the American Friends\nAPRIL, 1965\n3"
}