{
  "id": "d1419-1",
  "text": "Page 2i\n*\n?sychc logically-* trained interviewer. A proposal for a \"Surveys Branch®\ns already before the Iowa state administration. Meanwhile* It is\nnecessary in order to conduct current college surveys such as the one\non \"Livestock Morbidity15 to hire commercial Interviewers for slsglc\nprojects at rates much in excess of what a permanent Iowa State employed\nand administered field force would cost* Such s field force could be\npermanently on call for many, survey-interview duties©\n2- A Workable Plan for Audience-llcactlon Studies at\nJL, Facilities ■— A continuing series of audicmce^reaction studies could readily\nbe designed and administered through the present resources of the Iowa State\nStatistical laboratory* (1) T© completely carry on studies such as those\nindicated in #1, would require the addition of a \"surveys crew\" or a group\nof psychologically® trained Interviewer** This would constitute a -permanent\n\"field force'* to enable Iowa State to do It* can interviewing rather than\n\"contracting out\" the interview portion of the survey job as now. (2) A\nmemorandum describing the details and requirements of such a force for thi#\nand other projects* not involved in the present discussion, has already been\nforwarded to the administration by My* Arnold ling* .\nB« Dftreflffioa -** The newly-formed \"Information Oeamittee* could undertake direction\nof the studies * (I) The areas and media to b@ studied and the r-rdsr in which\nthe studies itd#t be pursued would be left to the discretion of the cossaittec*\n(4 An initial project might well be a study of the magazine, M3M, SC I MCI,\nand a peracnal^lnterwiew check survey on the recent WOX mil survey of far©\naudience* (3) This committee* representing press* radio, bulletins* and\nvisual aids* would be guides! by Mr. Arnold King* who would act as consultant©\nC» p^anplng Essentially the committee would be \"nuclear\" ■» then depending on\nthe area involved ««**• press, radio* or bulletin (1) additional representatives\nfrom commercial publications, radio stations, and film producers, would b©\ncalled in* Wallace* & Farmer and Successful Farming would be represented a»\nwould be the Dos Moines Beglatcr i the i«Ui£ an^\nbroadcasting stations* WHO and WMT.\nDo Length of study — We feel an audience-reaction study of th© kind described\nehcuV actually be a continuing gf^ew^i^^fiadlg** C$ Studies should\nprobably be m & quarterly basis with a different area in the press* radio^\nbulletin^ or visual aids fields to be surveyed each time* and over a minimum\nof 3 yearsc, (a) Continuity for the sake of comparison i* one of the vital\nelements of such a study©\nS« Coat *»» We estimate a reasonable expenditure for such a series of studies\nwould amount to $12*000 a year over a 3-year period* (2) Since the direction\nof the studies would be an \"Information Committee function\"* and the\nadministration* a \"Statistical Laboratory function\"* he funds should logically\nbe assigned to the \"Statistical Laboratory\"* (d) This annual figure represents\napproximately f$ of the total annual information expenditure©"
}