{
  "id": "d172-136",
  "text": "-6-\nsuggested the experiment to Dr. Eugene Johnson, coordinator of the Community Educa¬\ntion Project in San Bernardino. The Community Education Project enthusiastically\nassumed responsibility for local direction of the experiment. The Fund made the\nsum of two thousand dollars available to San Bernardino for local promotional and\nincidental expenses.\nFirst Steps.\nSecuring the cooperation of the San Bernardino Sun-Telegram - an outstanding\nnewspaper and the only one serving the entire San Bernardino Valley - became the\nfirst task. This was arranged in an interview with Mr. James A. Guthrie, Sun-\nTele gram publisher. This publisher, with a long record of distinguished service\nto the community, listened to one of the programs and liked it. He visualized the\npossibility of developing new channels of communication for bringing important\nproblems to the consideration of the people. As detailed later in this report, the\nSun-Telegram gave generously of \"white space\" both to print the discussion guides\nand to carry news stories relating to the Experiment.\nRadio Station KFXM was next approached as offering one of the best listening\npublics in the area. The station management auditioned the program and volunteered\nnot only a choice and convenient listening time (8:30-9:00 p.m. Thursday) but\nagreed to aid in the promotion of listenership and individual participation.\nThe support of one other key organization was deemed essential. This was the\nChamber of Commerce, which auditioned one of the programs at a breakfast meeting\nof its Board of Directors. After listening to a presentation of the whole philos¬\nophy behind the Experiment, with particular attention to its significance as a new\ncommunication technique, the Chamber gave enthusiastic endorsement to the Experiment\nand aided considerably in its local promotion.\nThus the Fund for Adult Education joined with the San Bernardino Sun-Telegram,\nthe Lee Brothers Broadcasting Corporation (KFXM), the San Bernardino Chamber of"
}