{
  "id": "d172-139",
  "text": "-9-\nTHE PREVIEW\nThe Preview, held in the Valley College auditorium two nights prior to the\nfirst broadcast, was arranged with recruiting of group organizers clearly in mind*\nArrangements were handled largely by a volunteer committee of the Community Educa¬\ntion Project, consisting chiefly of people who had participated in previous discus¬\nsion groups arranged by the Project.\nThe agenda of the Preview was designed to produce the maximum audience parti¬\ncipation. The total program was explained, Dr, C-oldschmidt described the develop¬\nment of the radio series, and exoerpts from several of the programs were played.\nEight people, drawn from participants in previous discussion programs, staged\na demonstration of a home discussion group in action* It was announced that an album\ncontaining all of the Ways of Mankind recordings would be awarded at the end of the\nseries to the first ten groups to (l) organize, (2) register with the Community\nEducation Office,(3) continue to exist throughout the series, and (4) submit weekly\nevaluations of the programs. Finally,the entire audience was divided into small\nunanswered\nbuzz groups of six or seven people to formuhte/questions about forming home discus¬\nsion groups. Reporters from these buzz groups came to the stage and presented their\nquestions to a panel of \"experts\" (persons with considerable previous experience in\ndiscussion groups.)\nAt the conclusion of the meeting, special manuals giving detaibd instructions\non how to organize Ways of Mankind listen<-and-talk gmups were distributed to all in¬\nterested persons* On the way out of the auditorium those intending to organize\ngroups were invited to register their groups and thus become eligible for the prizes.\nShe Preview generated a remarkable amount of enthusiasm and audience partici¬\npation was almost one hundred per cent. Subsequent analysis showed that vdth the\nexception of a chain of groups organized by the County March of Dimes Committee, all\ngroup organizers were people who attended the Preview* The importance of this"
}