{
  "id": "d172-149",
  "text": "-19-\nAs concerns the San Bernardino area, it can be seen that television has long\nsince outstripped radio in becoming a major source of at-home evening entertainment.\n(The Community Education Project at San Bernardino Valley College is now planning\nto develop a TV series, using the techniques of the \"Ways of Mankind\" experiment.)\nOf course the method of survey, the sample selected, and the very mde of\nquestioning can all be challenged. However it would seem that the formula applied\n(the selection of each 100th residential telephone listed) and th. number of calls\nmade, would compare more than favorably with the performance of commercial radio\nlistening survey teams that from time to time have been employed to investigate\nlistenership in San Bernardino.\nProjecting the one percent sample to the total population of San Bernardino,\na listening audience of roughly 2,500 is obtained. Since the population in the\narea covered by the experiment is approximately four times this, a very rough pro¬\njection of the San Bernardino sample yields an estimated listening audience of\n10,000 people who enjoyed the \"Ways of Mankind\" program. It might be pointed out , i\nthat the sample, if it errs, is on the conservative side. It obviously does not\ninclude the people who were avra.y from their homes because they were participating\nin discussion groups. Nor does it include people who may have listened to a re¬\nbroadcast of the program on Sunday afternoons. (The rebroadcasting was arranged\nfor people who could not get the program in the evening but could during the day\nbecause of differences in the transmitting angle of the station.) A third factor\nwas the mail response to the program. Mail response was considerably higher from\ncommunities where TV reception is non-existent than in San Bernardino where TV\nreception is good in most parts of the city. The radio audience was unquestionably\ngreater in the non-TV areas, but it was impossible to check this.\nEVALUATION TECHNIQUES\nWeekly Report Sheets. These were submitted by most of the groups registered. The\nsheets furnished data on the quality of the discussion, the topics discussed."
}