{
  "id": "d172-162",
  "text": "January 26, 1953\nTHIRD REVISED MEMORANDUM CM TOCQUEVILLE PROJEC'\nBy Phillips Bradley, SyracuseUniversity\nRobert E. Streeter, University of Chicago\nGeorge E.Probst, University of Chicago\nPurpose: (l) To communicate some of Tocqueville9s significant\nideas on the relationship among equality, democracy, and liberty, and\nhis enduring social and economic observations. (2) To bring to the pre¬\nsent the counsel of the wisdom of Tocqueville. (3) To convey a sense of\nhistory as something as living as the immediate present.\nScheme; This series of half-hour dramatic programs will\nroughly follow-the course of Tocqueville9s journey to and in America in\n1831-32. The series will begin and end in Paris. The background and\nmotivation will be the hope of finding a peaceful and evolutionary path\nfor political and social change. He is in search of an alternative to\nthe French revolutionary, destructive violence by the mass of the people\nagainst the entrenched rights of property. America is seen as the per¬\nsonification of the equality that he sees as inevitable for France and,\nindeed, all Europe. Tocqueville travels to America to seek the knowledge\nthat will give intelligent guidance for the conservative who is interested\nin securing liberty and safety from the tyranny of the majority.\nIn a series of dramatic episodes, Tocqueville will be revealed\nin the process of accumulating experience and insight into the strengths\nand weaknesses of the American society. It is a developmental series,\nfor Tocqueville will possess initially the misconceptions of the French\naristocrat. He will come to a full integration of his new view of America\nover a period of time. The simple experiences and plain concepts will be\nput first in the time of his experience. (E.g., it is in September in\nBoston, after landing in New York in the previous May, that Tocqueville\ncomes to the view that the American experiment would not soon fail, as\nhis family and friends believed.) The more elaborate notions will be put\nlater in the series and emphasized in a recapitulation of central ideas\nafter his return to Paris.\nFor illustrative dramatic material, contemporary novels, news¬\npapers, letters, books, will be drawn upon to secure the \"capsule inci¬\ndent\" which depicts Tocqueville9s generalization. Anything may be used\nthat Tocqueville could have witnessed, read, or fceard reported.\nFictitious interviews with people Tocqueville did not meet are not ac¬\nceptable. Tocqueville is the narrator, and at the same time a partici¬\npant in the dramatic episodes as seems necessary. Contemporary relevance\nto 1953 is to be achieved (l) through a choice of the most appropriate\nmaterials of the 18309s in America which are still significant; and (2)\nthrough a simplicity and directness in Tocqueville9s words which achieves\nuniversality. Where necessary, Tocqueville9s words in Democracy in America"
}