{
  "id": "d172-164",
  "text": "-3-\nthe best traditions of noblesse oblige, he is a charming and often witty\nconversationalist: the enthusiastic impression he made on many Americans\nattests this quality# Although his main intellectual contacts and sources\nof information were among the upper levels of American society, he met\nall types—frontier families, etc. (although perhaps not many workers\nexcept among the prisoners with whom he talked). He has a great interest\nin all kinds of people. He has an extraordinary memory for them, and for\nhis conversations with them. He has a great ability to persuade—when\nhe chooses—as is evidenced by the great number of memoranda he solicits,\nand elicits, from Americans who he believes can help to clarify facts or\nopinions.\nHe is primarily an acute observer of his environment and with\nequal acuteness he reflects upon his observations: he is a political and\nsocial thinker rather than a practical politician or cur£ leader. He is,\nin fact, considered today as a pioneer in modern sociological method, as\nis evidenced by the range and scope of his organized analysis of American\nprisons and, more broadly, of American political, social, and economic\ninstitutions. He has a deep sense of responsibility to his work (with\nregard to prisons for the French government, and on democratic ideas and\ninstitutions for his own project of writing an interpretive work on\nDemocracy). He is meticulous in note-taking, with a flair for the well-\nturned phrase. He is a remorseless questioner. He is capable of being\nastounded—does not pretend to cynicism or sophistication.\nDespite his physical frailty, he is an early riser, a good\nhorseman, and teaches his friend Beaumont to swim. Together they tra¬\nvelled about 7,000 miles by stage, river boat, and horseback—to Quebec\non the northeast. Green Bay on the northwest. New Orleans on the south¬\nwest, and so to Washington cross-country, landing in New York in May, 1831.\nThey spent about ten months in their travels and observations. Tocque-\nville is always polite, and genuinely appreciative of the many assistances\ngiven him by his new American friends. He is affable and approachable;\nhe has a good deal of equanimity, and does not protest over the irritations\nof the journey.\nTocqueville*s loyalty to his ideal of mediating between democra¬\ntic ideas and institutions and those thinkers still imbued with the con¬\ncepts of the Ancien Regime, is matched by his personal loyalties. When\nBeaumont is dismissed from his judicial post by the new government of\nLouis Philippe, Tocqueville resigns in protest.\nMeans: (2) Beaumont is to be used as the occasion requires. Es¬\nsentially he is like Tocqueville. A difference lies in his artistes abil¬\nity to seize on the uniqueness of the moment. The two are very good and\nloyal friends. They agreed to divide the field of American subject matter\nbetween them, with Tocqueville taking all things political, except for the\nslavery problem. They traveled everywhere together. Beaumont sketches\nthe various scenes.\nMeans: (3) See Pierson pp. 782-786 for the list of well-known\nAmericans who can be used in the episodes with Tocqueville."
}