{
  "id": "d172-87",
  "text": "(RELEASE #10)\nFROM: RADIO STATION WXXX\nADDRESS\nPHONE FOR RELEASE: (DATE)\nNEW PROGRAM DRAWS PARALLEL’S IN NAEB'S “WORLD RENEWAL\"\nThe Yurok Indians, living a rich life in the small villages along the\nbanks of the Klamath River of Northern California, believed that sins formed\na cloud of pestilence and that they must perform a ten-day dance or World\nRenewal ceremony to drive back this miasma of sin.\nA story of how these early people sought within the beliefs and\nframework of their stone-age culture to drive back evil and keep from\nconstant open tribe-warfare is unfolded in “ World Renewal\", a new half\nhour broadcast presented as an adult education project by the National\nAssociation of Educational Broadcasters,\n“World Renewal\", written by Charles Israel and produced by\nAndrew Allan, is part of the NAEB second series on \"The Ways of Mankind\",\nThe program, which also is the last of four presentations devoted to a\nstudy of Yurok culture, will be heard at (time) -- on -- (date) -- over\nradio station -- (name).\nDr. Walter Goldschmidt, anthropologist of the University of\nCalifornia, served as project director for the entire \"Ways of Mabkind\"\nseries, and Alfred L, Kroeber, Professor Emeritus of Anthropology of\nthe University of California, was special consultant for the four programs\non the Yurok.\nAs we learn in this final Yurok program, these early Indians were\na proud people, tense andrestrained. They were anxious to be well\nthought of. But pride can lead to suspicion and this in turn to quarrels.\nThe Yurok took no insult lightly, were not a peaceful people. Nor could\nthey live up to the strict rules of conduct their culture demanded. Sins\nwere committed.\nSo all was tense during the ceremonies of World Renewal, as radio\nlisteners will learn from this description of one. All was tense in the\nremembrance of hatreds and sins that made the ceremony necessary, tense\nin the rivalry that existed in the display of wealth by the rich, tense in the\nfear that some fresh outbreak might prevent the purpose of the dance.\nTo the radio listener will be pointed out that perhaps these early\npeople, primitive though they were, had a glimpse of the truth. For preservfcig\nthe ritual meant successful cooperation and the resolution of conflicts. This\nindeed might be an eternal secret, for all time and ages, of World Renewal."
}