{
  "id": "d172-90",
  "text": "STATION KSLH (91*5 M.C.)\nST. LOUIS PUBLIC SCHOOLS\nDIVISION OF AUDIO-VISUAL EDUCATION\n1517 SOUTH THERESA AVENUE\nV]3]7Dja]3 j71L7]]\nSeries I\nFirst Year French\nGrade 2\nx\nx\nx\n-x\n■x\n-x\nx\nx\nx\nx\nx\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX\nX X X X * X X X X X X X X X X X X X X X X X X X X X\nX X X X X -X X X X X X\nX\nNOTE TO NAEB STATIONS\nThe broadcasting of foreign language programs to elementary schools\nis in the experimental stage in St. Louis* VI3IT0NS MIMI was begun\nin fall 1953*\nAs a result of thorough evaluation of the first semester*s broadcasts\nthe St* Louis foreign language radio planning committee strongly re¬\ncommends that VISITONS MIMI, series I, be used as suggested by teachers\nnow using it* This means that each program is to be broadcast during\ntwo consecutive weeks. (In St. Louis VISITONS MIMI can be heard at\nfive' different times'-within the weekly schedule.)\nThis arrangement of broadcasting the same program for two weeks per¬\nmits pupils to hear the lesson at least twice; it results in better\nlearning and reduces the burden of drill for the classroom teacher.\nUsed as recommended, the series of fourteen programs covers the entire\nyear of instruction. A Christmas program is included as an extra\nbetween lessons VI and VII; it can, however, be used elsewhere if con¬\nvenient or be omitted entirely.\nPrograms in this series are each ll*:30 minutes in length, exclusive of\nthe opening and closing KSLH announcements*\nOpening cue: This is KSLH, your school station in St* Louis,\nClosing cue: VISITONS MIMI originates in the studios of KSLH, the\nBoard of Education station in St. Louis,\nIn St. Louis we plan to make the following live announcement after\ncertain programs.\nLive announcement:\nAnd now may I remind the teachers who are using\nthis series that each program is being broadcast\nfor two consecutive weeks.\nPlease let us know your reactions to this experi¬\nment*"
}