{
  "id": "d1918-2",
  "text": "^ Robert Summers has joined the staff of the School of Dra¬\nmatic Art and Speech at Ohio University. He will be re¬\nsponsible for the academic curriculum in radio-TV.\n^ New chief engineer at WFSU-TV, Tallahassee, Florida, is\nThomas B. Brask of NET. Other new staffers are Thomas\nH. Welch, producer-director, and David L. Doney, produc¬\ntion assistant.\nAndrew C. Allen, new operations engineer at WDCN,\nashville, leaves WLTV, Bowling Green, Kentucky. Mrs.\nBetty Doak Elder has just joined the WDCN staff as secre¬\ntary to the general manager.\n^ Cyril Braum has recently returned to Washington follow¬\ning site visits to Juneau, Fairbanks, and Anchorage for an\nHEW study to determine the feasibility of a statewide ETV\nsystem for Alaska.\n^\".Norbert H. Nathanson has been appointed an associate in\nETV with the New York State Division of Educational Com¬\nmunications. He comes from the faculty of New York Uni¬\nversity.\n^ Michael Collins, WNED-TV, Buffalo, was recently elected\npresident of the New York State Educational Radio and\nTelevision Association, replacing Halas Jackim.\n^ Fred L. Christen, instructor in radio-TV and chief engineer\nfor radio-TV-film at Texas Christian University, has taken\na leave to earn his Ph.D. at Syracuse University in instruc¬\ntional communications.\n^ George C. Johnson, director of the Indiana School of the\nSky for more than 17 years, has been named acting chairman\nand director of the Indiana University radio-TV department\nand service. He replaces Elmer G. Sulzer who resigned to\ndevote full time to teaching and research.\n^ Kenneth Harwood, professor of telecommunications at the\nUniversity of Southern California, represented the AAUP in\nceremonies marking the golden jubilee of Jesuit higher edu¬\ncation in Los Angeles.\n^ Karl Haas, director of fine arts for WJR, Detroit, is re¬\nturning to the station after serving 13 months as resident di¬\nrector of the Ford Foundation cultural program in Berlin,\nGermany.\n^ Walter Emery left his post at Michigan State University\nin October to spend a year’s sabbatical studying European\nbroadcasting.\n^ Roy Vogelman, WHA news and special events director,\nUniversity of Wisconsin, is spending October and November\nstudying newscasting and the broadcasting of controversial\nissues in England, Germany, and France.\nREGIONAL AND STATE\n^ Four commercial television stations have joined with\nKUSD-TV, Vermillion, the state’s only active instructional\nstation, to serve the South Dakota Instructional Council\n(ITV), a group of public and parochial schools who have\npooled financial resources. The service could provide TV in¬\nstruction for some 9,000 grade school children in the eastern\nhalf of the state.\n^ The Maryland Board of Education has voted approval for\nthe establishment of a state-wide ETV service in Maryland.\nThe plan provides for the utilization of seven UHF trans¬\nmitters and a state-wide microwave network to allow both\nnormal broadcast and CCTV program exchange.\n^ Delaware has approved an ETV network patterned after\nSouth Carolina’s. The system will provide three CCTV chan¬\nnels to the state’s 300 schools.\n^ A quarter-million-dollar federal grant has been received by\nthe ETV Association of Metropolitan Cleveland for con¬\nstruction of an educational TV station, thus bringing Ohio’s\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN.W., Washington, D.C., 20036. Phone 667-6000. Area Code 202.\ntotal received to $626,499. Ohio is one of only eight states\neligible for the $1 million dollar ceiling on grants to a single\nstate.\n^ The TV subcommittee of Wisconsin’s Coordinating Com¬\nmittee for Higher Education met in September to view a\npresentation by the telephone company of a proposed inter¬\nconnection system for the state. The committee is planning a\nrequest for presentation to the 1965 Legislature.\nINSTRUCTION\n^ This fall begins the second decade of Canadian ITV. This\nseason’s schedule includes programs on Shakespeare, physics,\npoetry, physical education, history, current events, careers,\nscience, oceanography, social studies, French, and zoology.\n^ Ampex is offering foreign language instruction courses in\ntape format. The cost per course—developed by Cortina In¬\nstitute for Language Study and consisting of 40 lessons on\ntwo reels of tape, plus a hardbound text and 5,000-word dic¬\ntionary—is $9.95.\n^ The fall 1964 enrollment for Chicago’s TV College is the\nlargest yet in the nine-year history of the TV extension of\nthe Chicago City Junior College and the Chicago Teachers\nCollege.\n^ Miss Virginia Biggy, specialist in ITV, was the guest\nspeaker for WQED-WQEX, Pittsburgh, ETV demonstrations\nscheduled during the Allegheny County Teachers’ Institute\nand Western Pennsylvania Education Conference.\n^ A new evaluation form for ITV programing has been dis¬\ntributed to faculty members of the University of Texas and\nother TEMP participating institutions. The form’s purpose\nis to permit students and professors to express their reac¬\ntions to televised material. These reactions will provide a\nguide for future decisions concerning course offerings and\ncourse revisions.\n^ The new teaching methods and materials of the Physical\nScience Study Committee, founded at MIT in 1957, are\nbrought to Alabama physics teachers in a new ETV series,\n“Physics for Teachers,” presented by the University of Ala¬\nbama over the Alabama ETV Network.\nGENERAL\n^ Early last month, KQED, San Francisco, began regular\nSaturday broadcasts.\n^ The Television Information Office will co-sponsor a four-\nday TV festival at the 54th Annual Convention of the Na¬\ntional Council of Teachers of English, November 25-28 in\nCleveland.\n^ The Greater Washington ETV Association has just been\ngiven a $516,510 grant by the Ford Foundation for three-year-\nold WETA.\n^ KVCR-TV, Channel 24, San Bernardino, California, is now\nalso Channels 70, 72, and 75. A system of three translators\ncarries the signal 100 miles over the San Bernardino Moun¬\ntains to Barstow, as well as to Lake Arrowhead, Ontario,\nRedlands, and Riverside. The station now reaches 96.4% of\nSan Bernardino County’s school children with instructional\nprograming. The translators are made possible by the Inland\nTelevision Advisory Committee.\n^ KWSC-TV, Washington State University, Pullman, has\nbegun programing Sundays from 3 to 5 p.m. That makes nine\nU. S. educational stations now broadcasting on Sunday.\n^ Stanford University students have received an FCC license\nto operate a 10-watt FM station, KZSU.\n^ WPSX-TV, Clearfield, Pa., plans December tests and\nJanuary programing.\n^ FCC Commissioners Frederick W. Ford and Robert E. Lee\nare participating in what is to be an annual Forum on Broad¬\ncast Controls at Indiana University.\n^ Annual figures compiled by Roderick Rightmire, Michigan\nState University placement officer, show job opportunities\nfor radio-TV graduates between June 1963 and June 1964\nNOVEMBER, 1964\n3"
}