{
  "id": "d1366-1",
  "text": "G U E S T I T O Rr 1 A L\nWHOSE FOOT ON THE BRAKE?\n\"Possibly 500'o\" said John Studebaker bravely.\n\"Do you mean 500 educational FK stations in five years?\nstudebaker stuck to his figure. He saw the need, W^?Lr»‘'woSd crfch’’^\nsaw the magnificent opportunity ahead. He was conxidcn\nthe visionj too.\nThe scene was a hearing room of the f L“sSt:d\nwas the FM reallocations hearing in the WR. L ’id he re-^rved for edu-\nS'a^iS' “L“fow'tle°rLStr'rot fiv:! norfi?Lon, but twenty Flf channels\nreserved for education! Enough frequencies for hundreds of stations.\n'Tas U.S. Oomissioner of Education Studebaker being unrealistic, up\nthere t the witness stand, l^/as he of ufwhr*\nhe was expressing the optimism, tne nopes, the piano o ^ ^,,«o+inn\nlere thorL He kept seeing the awesome -f^tional\nsparked, speeded, and spread by radio, tod he insistee, los, p\nFM stations in five years. It can be done.\nWell-so three years have passed, and 41\nstruggling to make themselves heard and felt. Not 200, or 300. but 41.\nt-liere are those dosens of community stations in Michigan Joe Maddy used\nto tairabout'’ And that 50,000 watter at the University in Ann Arbor?\nwLvfh:ppen;d Connecticut’s plans? And Virginia’s? And olumbia\nTTniversitv’s’ How many educational FM stations are opei citing _ 9\nSlofM ;id flithm WBOE in Cleveland? Hhat’s Minnesota f\n:^^hing? And for that matter, how far along is that state network of\nseven stations ^Visconsin has been talking so big about.\nSu... .. »n .11 ..Pl.l. .1. J.l» l» ™\ndeliberate hold-up in converting to F..... .re.istan ^ have\ninterests...opposition from tel-iaion. .sto ka of componen ^\nto be cleared first...time required to re-design...n3 i. p\nfew listeners...limited coverage...Petrilio... ano so on.\n—siSafsssr ”:s:s “e “‘.sx..-\nout on a silver platter?\nVfhat arc we waiting for? In our race against indifference, ignorance,\nMaybe it’s our own.\nHo Bo McCarty, Director v'HA—-^iTHA-FM\nPnra+.-PrGGident NAEB"
}