{
  "id": "d980-49",
  "text": "Professor Gale R. Adkins, Director\nBureau of Research in Education\nby Radio-Television\nUniversity of Texan\nAustin, Texas\nDear Profoasor Adkins:\nTour letter to Professor Leo A* Hi\nAERT membership desk at the Deuhler-Hij\n1 regarding arrangements for the\nhas been referred to me.\nRegarding tables, chairs, and so on, I have written to Dr. Tyler revest¬\ning him to arrange for these facilities. Professor Ilartin seemed to think\nthat Dr. Tyler would be the logical person to contact on this. I m enclosing\na carbon of that letter. Since time is getting short, may I suggest you con¬\ntact Dr. Tyler directly if you think we will need anything further as far as\nfurniture is concerned* You see, I an somewhat ignorant of just what the\nideal arrangement should be in view of the fact that this will be my first\nconvention this year.\nRow a» I understaffed it, you will see that the membership desk is adequate¬\nly staffed every day, Tuesday through Friday. If you can get me a list of\nall those who will be working on the membership desk ... including full name\nand title, such as Doctor, Professor, Krs., etc. ... by, say, no later than\nApril 6, I will arrange to have name plates made up to display on the desk\nduring the period that each person is on duty. I think this might help\npersonalise the operation a bit, particularly as far as new members are con¬\ncerned.\nIn reading the copy of ray letter to Dr. Tyler, you will note that I have\nreferred to a publicity desk. I feel very strongly that we must embark on a\ncomprehensive publicity program this year. For this reason, I am planning to\nrelease a \"home-toun' story on each AERT member who is in attendance. Since it\nwill be necessary to talk to each of these people very briefly, I would like to\nhave a publicity desk set up in conjunction with the membership desk. In that\nway we can shuffle people from one desk to the other with a minimum of time and\neffort. Thlle I plan to oversee the operation of the publicity desk, I expect\nthat I’ll be a little short-handed. Is It possible, do you suppose, that we\nmight impose further upon two of the ,fwinsosae young ladies\" fro® AKBho to help\nout in this respect, too?\nWe have arranged to have five-hundred copies of the April issue of the\nAERT Journal in Col tubus to use as handouts. I expect to have some other\nduplicated material available, too. As far as signs and display cards are\nconcerned, I will have those made up here in Boston and properly transported\nto Columbus."
}