{
  "id": "d980-74",
  "text": "PRECIS OF THE \"CONDITIONS\" ENUNCIATED BY MR. SCHOOLEY OF THE NAEB AT\nCONFERENCE WITH COMMITTEE OF BOARD MEMBERS OF AERT - U/16/^6\n10 All members of the AERT shall become immediately AFFILIATE MEMBERS of the NAEB,\npending later clarification of membership status within the NAEB framework®\n20 Dues already paid by members of the AERT shall be honored with full credit through\nthe terminal date of their membership (and subscription) period.\n3® Dues for all members will probably be raised to 07*50 after the expiration of the\nterminal date* but this rise will include distribution to such members of the NAEB\nNewsletter together with the AERT Journal.\nho The AERT Journal will be continued until June 1956, and (pending recommendations\nto be made ty a~conrnittee which will study the delineation of areas of interest ^in\nAERT Journal vis-a-vis the NAEB Newsletter, and the determination of the fora of\nfuturFpublication of the Journal), will be guaranteed publication through next\nyear.\n5<> The Journal, under whatever form it is to be published, will be identified for at\nleast one year after integration with the subtitle \"FORMERLY THE AERT JOURNAL\".\nSo The NAEB will continue the \"Utilization and Evaluation Day\" (now known as the AERT\nDay\"). This will be maintained either at the annual sessions of the NAEB Conven¬\ntion; or with half a day at the NAEB Convention and half a day or a full day at\nfuture IERT meetings. Possibly some time will be maintained at both meetings, to\nprovide opportunity for a spring and a fall meeting in diverse locations, to per¬\nmit more AERT members to participate in annual meetings.\n7. The NAEB Board of Directors will study and recommend the type of representation\nthe AERT will have on the Board: possibly a third vice-president, (charged with\nutilization and evaluation studies), or a special board memberc\n8. The NAEB ?dll handle all administration, — e.g., membership files, membership\npromotion, collection of dues, billing, and distribution of publications from\nits Headquarters.\n9o The NAEB President will form a Utilization Committee, (probably made up of AERT\nmembers), immediately.\n10. Research projects will be inaugurated and pursued by and for both memberships,\nNAEB and AERT.\n110 It is recommended that until all details are worked out and accepted ty both\nassociations, the AERT keep its corporate identity. It should keep such identity\nif possible and feasible in order to continue its claim and right to maintain its\nmembership on such committees as the UNESCO, JCET, etc.\n12. There will be four regional meetings of the NAEB membership before June 2$, 1956.\nAERT members are invited to attend and participate in these meetings, to familiar¬\nize themselves with NAEB members and policies.\nApproved\n(signed) R* F* Grady, S.J.\nTreasurer AERT"
}