{
  "id": "d720-3",
  "text": "-h ~\nBY-LAWS\nArticle I - Membership\nSec. 1. Active Membership. During the membership year for which his dues are paid,\nan active member is entitled to the following privileges: (a) to vote for officers\nof the Association, for members-at-large on the Board of Directors, for the\nregional director in the region in which he resides, and in referendums; (b) to be\nelected to any of the offices for which he is entitled to vote; (c) to attend\nmeetings of the Association if he complies with their registration requirements;\nand (d) to receive each issue of official publications of the Association.\nSec. 2. life Membership. life members of the Association are active members\nShose chies' are paid up\"for life. They are entitled to all of the privileges of\nactive membership.\nSec. 3* Associate Membership. High school and college students, whose individual\nstatus is-attested by an active member, may become associate members • They shall\nhave all the privileges of active members except the right to vote and to hold office\nin the Association.\nSec. i*. Institutional Membership# Radio stations, educational institutions, and\norganizations engaged in educational broadcasting may become institutional members.\nEach institutional member in good standing may designate one individual who shall\nhave all the privileges of active membership in the Association as its representative.\nSec. 5* Membership Year. The membership year shall be one year from the date of\njoining the\" Association.\nSec. 6# Dues. The amount of dues by class of membership is as follows:\nActive Member $ 5-00 Annually\nAssociate Member $ 3 #00 n\nlife Member $25*00 w\nInstitutional Member (a) National Organization $50.00 - Annually\n(b) Regional and Local Organization - $15.00 - Annually\nChanges in the amount of dues of any class of membership shall b® by a two-thirds\naffirmative vote of tie Board of Directors#\nSec# 7# Local Chapters# Local and regional chapters, upon certification by the\nNational Board of Directors, shall be required to hold\"a minimum of three meetings\na year. They shall collect annual du©3 and deduct 50 wonts per member for their\nlocal treasury, before forwarding to the national treasury. They shall deposit\nwith the national secretary a roster of officers and will keep the secretary advised\nof all changes in personnel.\nSec. 8. Subscription to Publications# College and school libraries, and public\nlibraries, may withoui becoming' members of the Association, subscribe to the\nofficial publication of the Association. The subscription price to the current\nofficial publication of the Association i $3 *00 annually. Subscription rates\nmay be changed by an affirmative vote of two-thirds of the Board of Directors."
}