{
  "id": "d720-39",
  "text": "ASSOCIATION FOR EDUCATION BY RADIO-TELEVISION\nOffice of the President\nBoston, Massachusetts\nThe Association for Education by Radio—Television is a non-profit, educa¬\ntional organization, incorporated under the laws of the State of Illinois, and\ndedicated to both the utilization and evaluation of educational radio and^\ntelevision materials, both in the commercial and non-commercial broadcasting\nindustry.\nAs stated in its constitution, the broad purpose of the Association is to\n\"extend and improve the educational use of radio and television\"*\nAERTrs membership is nation-wide, and includes educators on all levels,\ncommercial broadcasters, religious broadcasters, civic leaders, parents and\nrepresentatives of many leading community groups.\nAdvantages of membership are many. They include:\n..The AERT Journal, published in eight monthly editions during the\nacademic year, containing articles on utilization and evaluation\nof educational radio and TV, Articles are solicited from the\nmembership.\n..Privilege of attendance at the Association’s annual national\nconvention, held each Spring in conjunction with the Ohio\nState Radio and Television institute in Columbus, Ohio*\n..Opportunity of participating in the expanding activities of a\nnational professional association, organized and dedicated as\nAERT is,\n..Exchange of ideas, research, methods and materials,\n..Privilege of voting in AERT elections, participating in committee\nwork, and holding office in the Association.\n..Opportunity of joining with other AERT members throughout the\nUnited States to advance the cause of educational radio and TV.\nAERT serves as one of the sponsors of the National Tape Recording\nCatalog and Re-recording Service, a project set up in cooperation with\nthe Department of Audio-Visual Instruction of the National Education\nAssociation.\nAERT is one of the organizations which sponsors the Joint Committee\non Educational Television. In this way, AERT endorses JCET activities which\nhave to do with trends, statistics, developments across the'nation in the\nestablishment of stations, scheduling workshops, engineering, and program\ndevelopments, and so on in the ETV field."
}