{
  "id": "d720-66",
  "text": "TO: LAM\nFROM: JAR\nMX RE: Attached AERT Convening Letter^ o .\nFebruary 5# 1956 - At Home\nWell .••my bid for literary fame as the composer of this year's\nconvention pitch is attached* I guess maybe it's net very\nfeminine* But then ••• as I give it some thought ••• maybe it\nshouldn't be. After all, yeurre not a very feminine guy.\nSo, with this thought in mind, 1 tried to make it somewhat\ninformal, but I went out of my way (at least, I think I did2) to\ntry to avoid making it the gooey sort of thing that Gertrude B.\ndashed off last year.\nMy suggestion is to make the mailing a three-page affair. I think\nthe letter will fit on one page if we do it on a typewriter that\nhas small type (this one has big type). That's the top page.\nPage two would be a formal program, laid out S in much the same\nway that Stasheff did it.\nPago three would be a form to be filled out by the recipient and\nreturned to this office, to indicate:\n1. -attendance at AERT Day sessions\n2. -attendance at the Luncheon at the Maramor\n3. name, address, position, etc.\nI Question. Do all these people make their own hotel reservations,\nor should we send them a page listing rates, or what?\nIf nothing has been done in the past, I suggest it might be wise,\nPR-wise that is, to at least Include another page listing rooms\nand rates available at the Deshler-Hilton. I don't want to get\ninto the reservation business, and so we oould stick a blurb on\nthis proposed page suggesting that contacts be made directly with\nthe hotel. I Just think it would be a good way for us to provide\nthe members with a service of sorts ... or, at least, what might\nappear to be a service.\nAnd so to bed.\nJar\nP.S. Letter from Stasheff, which you requested be returned to you\non Tuesday, is attached. I have made a copy of the program.\nP.P.S. I had to do something, in the course of writing the proposed\nletter, about indicating time ntfrjfft for these things. We\ncan change all that, as necessary."
}