{
  "id": "d720-74",
  "text": "with NBC. Once we get a decision on the fee for that, then we can go after the\nother nets. Suggest the fee be $100 for these national business organizations\n(after all, it’s deductible from their corporate return), $50 for national non¬\nprofit organizations (like General Federation of Womens Clubs, f’r instance),\n$50 for regional business firms (or firms that operate locally, but in several\ndifferent places at same time, like Westinghouse Broadcasting Co.), $15 for\nregional and local non-profit institutions, and $5.00 for individuals. Now, you\nspoke of possibly jacking up some of the rates. If such is done, I suggest it be\ndone only with individual memberships. The rest, as given above, is high enough\nas it is.\nSec. 7 - Local chapters - At present, I don’t believe we get much In the way of a\nreport from local chapters. According to the by-laws, they must have a minimum\nof three meetings a year. Shouldn’t they report these meetings to the national\norganization in a regular manner? After all, it doesn’t seem to me that we’re in\na position to really know what those people are doing ... if anything. Also, as we\nhave discussed, local chapters are only authorized to withhold $. 50 from the over¬\nall membership fee for local needs. We have one chapter that is withholding $.75.\nRegardless of whose feelings may be hurt, somebody’s gotta give. Just between you\nand me, I don’t see that we’re making any money on a membership fee that nets us\n$h.25 ... or even possibly $li.50. Why can’t the chapters add their fee on the top\nof the five bucks, so we get the full amount?\nSec. 8 - Subscription to publications - According to this section, we’re not\nsupposed to be selling subscriptions to individuals ... only to ’’college and\nschool libraries, and public libraries.*’ Yet wc have many individuals who subscribe\nbut do not belong. Also, according to the by-laws, the subscription price is\nthree bucks annually, but we’re presently charging four. Suggest that the board\ntake necessary action to correct both of these aspects of section eight.\nXMz Art. II - Duties of officers - Sec. 6. - Board of directors. Small technicality.\nXX Annual meeting of the board of directors should be open to all the members. We\nhaven’t notified the members of the time and place of the meeting of the board, so\nthey couldn’t attend if they wanted to. Small point, but nonetheless a situation\nwherein we’re acting contrary to the by-laws.\nArt. 17 - Annual Election - Well, I don’t know. It’s beyond me. Somewhere ... some¬\nwhere there must be an easier way. It doesn’t make much difference now, but let’s\nface it, we’re gonna run into this mess a year from now. Suggest a special committee\nbe formed to propose revised election rules prior to election next year. Let’s do\nit the easy way.\nRandom thought- Let’s get this membership stuff straightened out. And let’s get the\nregional directors on the ball. I have a feeling that they all think the job is\nhonorary ... at least some of them apparently do."
}