{
  "id": "d1626-0",
  "text": "August, 1955 I\nTHE PRESIDENTS PAGE\nDear NAEBers:\nOne advantage many of you may have when this issue comes to . your off ice\nIS THAT YOU WON*T BE AROUND TO LOOK FOR THE PRESIDENT*S PAGE* BUT, AS\nTHEY SAY, THE FIGHT MUST GO ON* ANOTHER MONTH, ANOTHER ISSUE* - * \"\nBesides, Mm on vacation, too. Or, I will be just three hours from\nTIME THIS PA6E IS FINISHED* YOU SEE, THERE IS AN EARLY DEADLINE FOR\nTHE PRESIDENTS PAGE*\nHeard the needs of educational television, and the same goes for radio\nI ASSUME* DESCRIBED AS BEING (l ) PROGRAM, (2) PROTECT I ON, ($') PROFES¬\nSIONAL, AND (ij.) PROMOTIONAL. NOT A BAD BRIEF SUMMATION, AND i BOW TO\nA SAGE IN EDUCATIONAL CIRCLES.\nJim Wiles of WBAA and Purdue, where John BeCamp hangs out too, was in\nChampaign-Urbana for Fourth of July celebration. While here Jim\ntalked NAEB and WBAA business with Skornia, Schooley and Hill** Eliza¬\nbeth ano Ricky were along, too.\nLeo Martin, along with wife and son Mike, were campus visitors in mid-\nJuly. Leo is collecting data for a book which is to be compiled ano\npublished. Leo is one of five data collectors. He, or someone else,\nWILL HAVE to TELL YOU DETAILS. Mm SURE YOU REMEMBER LEO AS AERT\nPRES I DENT .\nAnother recent campus visitor was W. McNeil Lowry of Ford Foundation,\nwho was inquiring about my good health, your good health. Yep, he*s\nstudying problems of educational television. Your boss tried to be\nas informative, helpful as possible.\nOh, I haven* t been home all of the time either. i attended an invita¬\ntional MEETING ON EDUCATIONAL BROADCASTING IN NEW YORK LATE IN JUNE•\nLater in June, in fact it was June 27 and 28, Skornia and Schooley\nATTENDED THE 1N-SCHOOL TELEVISION SEMINAR IN WASH INGTON, D. C. COIN¬\nCIDENTALLY, Schooley attended meeting of JCET, too.\nJCET, along with NAEB* is acting with concern regarding the Rib Moun¬\ntain case in Des Moines, Iowa. Every good NAEBer ought to be concerned\nabout the common good, and the interests of educational broadcasting\ninvolved in this case.\nI hope everyone noted Raoio and TV Program reports with last issue of\nthe Newsletter. Bill Harley and Ken Wright committees are right on\nthe 8all . And, Bob Sch e nkk a n * s committee is busy too, and it*s having\nhelp from Gale Adkins of Texas on radio side of a study.\nAll you former visitors to Robert Allerton Park, take note. We*re now\nshooting juice out of that tower. WILL-FM is now operating with tower\nand transmitter at that site. Surprised? How about me!"
}