{
  "id": "d1626-1",
  "text": "-2-\nThe following is the second in a series of \"profiles\" on agencies with which\ni'JAEB is affiliated or which are working in our area of interest.\nThe Educational Media Council\nThe Educational Media Council, an incorporated non-profit association, was formed\nin i960 to coordinate efforts among professional, governmental and industrial organ¬\nizations in the educational media field.\nEducators and the producers of educational materials and equipment in the media\nfields are confronted with many mutual and complex problems. Solutions to such prob¬\nlems in the best interests of education frequently call for the combined efforts of\na number of national organizations.\nNAEB along with 11 national professional and business organizations, each with\na primary concern in the educational media fields, initially created the Educational\nMedia Council to answer this need.\nThe Council meets four times a year\n.to discuss problems relating to the educational media\n.to plan research, conferences, and seminars\n.....to arrange for the dissemination of information required for the more effective\nuse ana development of the educational media\n.....to invite leading representatives from related fields and programs to contribute\nto the thinking and planning of the Council\n.and to undertake appropriate action programs through working committees.\nThe EMC enters into contracts, assuming obligations and accepting funds for pro¬\njects consonant with its objectives. It is as a contracting agent that the EMC\nreceives its basic financial support. The U.S. Office of Education has contracted\nwith the EMC for two major projects:\nEducational Media Index...The current urgent need for bibliographic control of\nnew educational media has been expressed by educational and library leaders through-\nat the United States. A National Directory Project Committee was appointed to plan\nand execute the production of the Educational Media Index for initial publication in\n1962 and continued annual maintenance or revision.\nDissemination Program...The EMC is initiating a series of publications designed\nto provide school administrators, teachers, school boards and others with well-\nillustrated, readable information on educational media. This program is being planned\nby a Dissemination Projects Committee."
}