{
  "id": "d1626-3",
  "text": "-4-\nNational Association of Educational\nBroadcasters\nNational University Extension Association,\nDivision of Audio-Visual Communications\nUniversity Film Producers Association\nWilliam G« Harley, President, National\nAssociation of Educational Broadcasters\nLee W. Cochran, Executive Assistant,\nExtension Division, State University of\nIowa\nJohn Mercer, Chairman, Department of\nPrinting and Photography, Southern\nIllinois University\nClose Call for ETV Supplemental\nLast week after the House, which was expected to he the only source of opposi¬\ntion, had approved the appropriation of $12 million for funding the ETV facilities\nact for the balance of fiscal ’63, the Senate Appropriations Committee knocked it\nall out.1 Reason: the Subcommittee was given to understand that HEW would not be\nable to get out the rules and regulations governing applications for grants until\nJune 15--only two weeks before the end of the fiscal year! Accordingly, Senator\nPastore and his colleagues felt there would be insufficient time in which to spend\nthe money in ’63 and recommended that no supplemental appropriation for ETV be made.\nActually, HEW has had the rules and regulations all typed up, approved, and read\nto go for months; it could not get them printed or distributed in advance, because\ntechnically the HEW-ETV Administration isn’t \"in business\" until Congress appropri¬\nates funds.\nSecretary Celebreeze immediately addressed a letter to Senator Magnuson, with\na copy to Senator Pastore, explaining the situation and indicating that HEW stood\nready to distribute the rules and regulations within 24 hours.\nSenator Pastore agreed to accept a motion to restore the amound recommended by\nthe House and today (Wednesday), in the absence of Senator Magnuson, Senator Humphrey\nmade the floor speech and requested that $l|- million be added to the Supplemental\nAppropriations Act for 1963. His proposal carried the endorsement of Senators\nDodd, McGee, Magnuson, McIntyre, and Cotton.\nThe total bill, of which ETV is a part, will now go to conference*and, with\nluck, might reach the President’s desk for signing this weekend.\nMany ETV people, who communicated their concerns to their senators, can share\nthe credit for helping to bring off this salvage job.\n*The Senate session differs in that it allocates $40,000 rather than $75*000 for\nstaff salaries."
}