{
  "id": "d1049-0",
  "text": "N-Ar-H-B ANNUAL MEETING — October 26, 1947 — CHICAGO, ILLINOIS\nOFFICIAL MINUTES\nNAEB Business Meeting\nMinutes: Meeting Sunday, October 26, 1947, Hotel Sheraton, Chicago, Illinois\nThe meeting was called to order by President Harold A, Engel. John\nHenderson, WBaA, served as recording secretary for the meeting.\nElection of officers: The report of the nominating committee (Milford\nJensen, Chairman, H. B. McCarty and Jim Miles) was submitted. The following\nnominations were offered:\nPresident\nRichard B,\n, Hull, WOI\nVice President\nJohn Dunn,\n, WNAD\nTreasurer\nW. I. Griffith, WOI\nExecutive Committee (6 members)\nRegion I\nSeymour Siegal\nWNYC\nRegion II\nGraydon Ausmus\nWUOA\nRegion III\nFrank E. Schooley\nWILL\nRegion IV\nCarl Menzer\nWSUI\nRegion V\nRalph Steetie\nWLSO-JM\nRegion VI\nWilliam Sener\nKUSC-FM\nIn considering the nominations it was voted to hold the elections over\nuntil the Monday morning meeting, in order that additional nominations might\nbe submitted if members desired to do this.\nThe matter of appearances at the clear-channel hearing's by NAEB\nrepresentatives was discussed informally. A separate meeting was scheduled\nfor Monday by representatives of the stations directly affected... /Statement\nto be issued in name of NAEB at clear--channel hearings read and approved.\nThe meeting was adjourned.\nMinutes: Meeting Monday, October 27, 1947 Chicago\nMeeting called to order by President Harold A. Engel. John Henderson\nserving as recording secretary.\nI. Election of Officers: (carried over from Sunday meeting)\nThe slate of nominees submitted by the nominating committee was\nagain presented, with the addition of the name of Irving Merrill as\nExecutive Committeeman for Region IV.\nNovik moved that a vote be taken on all offices, except Region IV\nwhere a contest existed. Motion passed.\nUnanimous vote for all these nominees.\nVote on Region IV Executive Committeeman?\nMenzer 7, Merrill 4. Menzer elected.\nNewly elected President Hull took to chair."
}