{
  "id": "d1049-3",
  "text": "VII.\nRadio Training Program for German Personnel\n1\nAn outgrowth of a voluntary meeting in August (Skornia, Hull,\nNovik and Engel) was a plan for the training in the U. S. by NAEB of\nselected German nationals who would then go back to their own land to\ndevelop educational broadcasting activities over the German stations.\nThe plan was explained by Engel and a letter from the army endorsing\nthe plan was read. The matter was discussed.\nMoved (by Schooley), seconded and passed that NAEB officially endorse\nthe program and that efforts be made to put it into operation. Engel to\nfollow-up on negotiations on the matter.\n('Copy of plan appended hereto)\nVIII.\nTreasurer’s Report\nTreasurer Griffith submitted a detailed report which was read in\nhis absence, (appended hereto) A balance of $1,372,83 is in the treasury.\nMoved, seconded and carried that the treasurer's report be\naccepted as read.\nIX.\nConstitution Committee's Report\nColeman, speaking for the committee, read proposed changes in the\nconstitution. These were discussed and changes recommended.\nMoved, seconded and passed that the committee revise its proposals\nin accordance with the decisions made and submit them for inclusion in\nthe News-Letter.\nX.\n1948 Meetings\nIndiana extended an invitation for NAEB to hold its fall meeting\nat Bloomington.\nMoved, seconded and carried that the Executive Committee take the\nmatter under advisement and make a recommendation.\nXI.\nNews-Letter Editorship Remuneration\nMoved, seconded and passed that $100.00 be paid Engel in appreciation\nof his efforts in getting out the News-Letter in 1946-1947.\n(Over Engel's objections that the action was breaking precedent, because\nthe Executive Secretary normally was so rewarded.)\nXII.\nMoved, seconded and passed that the retiring officers be given a vote of\nthanks for their sevice tnroughout the past year.\nMeeting adjourned 11;52 AtM. Monday, October 27, 1947\n-Recorded, by John Henderson,\n- 4 -"
}