{
  "id": "d181-3",
  "text": "Stats Educational Tteler/isloft and/or Radio Agencies\n4\n(1) By definition, a “State educational television agency*' and a “State\neducational radio agency** mean, with respect to television broadcasting\nand radio broadcasting respectively:\n(a) a board or commission established by State law for the purpose of\npromoting such broadcasting within a State,\n(b) a board or commission appointed by the Governor of a State for such\npurpose if such appointment is not inconsistent with State law, or\n(c) a State officer or agency responsible for the supervision of\npublic elementary or secondary education or public higher educa¬\ntion within the State which has been designated by the Governor\nto assume responsibility for the promotion of such broadcasting.\n(2) There are several ways in which the Act provides for the participation\nof a State educational television or radio agency in the Educational\nBroadcasting Facilities Program:\n(a) Such State agencies are assumed to have responsibility to “assure\nproper coordination of construction of noncommercial educational\nbroadcasting facilities within each State...\" To that end, each\napplicant is required to file a copy of each application with such\nState agency, and the State agency will be notified of the disposi¬\ntion of each such application. (Section 392(c) (1) and (2).)\n(b) State educational television or radio agency may itself be an\napplicant for a facilities grant under P.L. 90-129.\n(3) By letter dated October 15, 1968, the Commissioner of Education has re¬\nquested each Governor to inform his office of the agency officially designa¬\nted to act as the State educational television or radio agency. In order\nto assure efficiency in planning and coordination of educational broadcasting\nprojects at the State level, the designation of a single agency with responsi¬\nbility for both radio and television has been encouraged.\n(4) The counsel and comments of many State educational television agencies\nhave proved invaluable in past administrative experience during the life of\nthe original ETV Facilities Act (P.L. 87-447). As telecommunications needs\nand demands for spectrum space increase throughout the country for a multitude\nof communications purposes, the role of a State educational broadcasting\nagency assumes increasingly greater importance. In the administration of the\nEducational Broadcasting Facilities Program (Title I, P.L. 90-129), State\nplanning conducted by such agencies, and the counsel of such agencies\nwith respect to the merits and priorities among applications from a given\nState will continue to be given serious consideration in the determination\nof grant awards. In addition to fulfilling the requirement that applica¬\ntions must be filed with the appropriate State agency, applicants are\nencouraged to coordinate television and radio planning and Federal grant\nrequests with such agencies."
}