{
  "id": "d181-48",
  "text": "-3-\nIf you hope to run a strong race, you must submit to vigorous\npreparation* One of the 5 assurances, as specified in the Act, is that\na Radio project must include evidence that you have participated in\ncomprehensive planning for broadcast facilities and services in the area\nyou propose to serve or are serving, and additionally that you, as an\napplicant, will make the most efficient use of the frequency assignment.\nYour project will be evaluated according to the degree it meets the criteria\nwhich determine the priority of applications. Careful study of the factors\nto be evaluated is mandatory if you want to get started on the right track,\nI shall highlight only the 2 criteria which are specifically mentioned in\nthe act pertaining to Radio;\n(1) equitable geographical distribution of educational radio broadcasting\nfacilities throughout the States;\n(2) provision of educational radio broadcasting which will serve the\ngreatest number of persons, and serve them in as many areas as possible,\nand which are adaptable to the broadest educational uses. All the criteria\nwhich will apply can be found in Section 60.13 of the Regulations, a copy\nof which you'll receive along with the official Application Form and the\naccompanying Instructional Manual early in 1969, To receive these forms\nyou must send us a written request if you haven't already. You will then be\nplaced on the mailing list to receive all our publications as soon as they\nbecome available. Our address is on page 1 under Instruction C of the\nworking draft Application Form in the packet you have received.\nIn view of the content of many of the letters of intent to file radio\napplications received thus far, I deem it prudent to stress fehe fact\nthat the Title I hardware .program is limited by statute to the business\nof granting financial support to public broadcasting educational stations\nin the fullest sense of the term public broadcasting. One of the axioms"
}