{
  "id": "d181-86",
  "text": "4\nPotential radio applicants are reminded of the requirement that\nassurance must be provided \"...that in the case of an application\nwith respect to radio broadcasting facilities, there has been\ncomprehensive planning for educational broadcasting facilities\nand services in the area the applicant proposes to serve and the\napplicant has participated in such planning, and the applicant will\nmake the most efficient use of the frequency assignment (Section\n392(a)(5) of the Act).\nTEMPORARY RESERVATION OF FUNDS\nIn order to provide for equitable funding of projects within the\npriorities listed above, it has been determined that from the amount\nappropriated for fiscal year 1969, ($4,000,000), funds will.be reserved as\nindicated below:\na) $400,000 will be initially reserved for funding approvable\nnoncommercial educational radio projects. In the event\nthat insufficient approvable radio applications are received,\nany balance of funds from this reserved amount will become\navailable for ETV grant purposes;\nb) of the balance of the appropriation ($3,600,000):\n-65Z ($2,340,000) will be initially reserved for grants\nin support of projects to activate new ETV channels, and\n-351 ($1,260,000) will be initially reserved for grants\nin support of necessary projects to expand ETV stations.\nMAXIMUM STATE LIMITATION\nThe maximal amount of Federal funds which may be awarded for grants\nunder PL. 90-129 in any one State in fiscal 1969 is $340,000 (8%% of the\n$4,000,000 appropriation). In determining project costs and priorities\nwithin States, both radio and television projects must be taken into\nconsideration under this maximum.\nCUT-OFF DATES\nFor Pending ETV Applications\nCut-off dates have been established for submission of applications\nor amendments in certain categories, as indicated Below.\nMarch 15 is the cut-off date for responses to EBFP from applicants\nhaving applications pending which were submitted under P.L. 87-447.\n(Such applicants are reminded that response in one of three categories,\ndescribed in Program Bulletin No. 1, will be required of each applicant\ncurrently on file. Any application on which no response has been received\nby this cut-off date will be returned to the applicant.)"
}