{
  "id": "d181-87",
  "text": "5\nFor New ETV and Radio Applications\nApril 15 is the cut-off date for filing new applications under P.L. 90-129\nwhich request consideration for funding in fiscal year 1969. New applications\nfor ETV or educational radio station projects which are received after this\ncut-off date may be \"accepted for filing,\" but will be deferred in consider¬\nation for funding until the next fiscal year.\nIn the cases of both pending and new projects, applications\nwhich request consideration for funding in fiscal 1969 must be\ncomplete by the announced cut-off date. The limited time which will\nbe available for staff review of application will not allow for\nexchange of correspondence soliciting missing information. Therefore,\napplications which are not complete by the cut-off date - for reasons\nsuch as missing exhibits, missing or inadequate assurances, or\nunresponsiveness to criteria - will be deferred or returned to the\napplicant, depending upon the extent of incompleteness.\nApplicants who request deferral of consideration for funding\nuntil another fiscal year may also defer submittal of such assurances\nas would not be relevant until that year. (For example, a deferred\napplicant need not supply the assurance that matching or operating\nfunds will be available until the future cut-off date for the year\nin which he requests consideration.)\nFor State Agency Recommendations\nMay 1 is the cut-off date for the submittal by State Educational Radio\nor Television Agencies of recommendations for priorities among competing\napplications from within a State. (Please note that this is a deadline for\npriority designations only. It is not intended to conflict with Section 60.10(b)\nof the Regulations, which allows 30 days after acceptance for filing for\ninterested parties to \"comment\" on an individual application.)\nGRANT AWARD DETERMINATIONS\nIn determining, from among applications requesting consideration for\nfunding in fiscal 1969, which projects will be awarded grants from funds\navailable in fiscal 1969, the Commissioner will take into consideration:\n1) The completeness of an application, and its consistency with\ngoals and criteria set forth in the Act and in Section 60.13\nof the Regulations;\n2) the counsel of expert consultanta with respect to timely\npriorities as indicated above, and the relevancy of proposed\nprojects to those priorities;\n3) the relationship between amounts requested in Federal funds\nin an application and the State maximum limitation;\n4) the readiness of the applicant to proceed with and complete\nthe project promptly;"
}