{
  "id": "d1462-1",
  "text": "- 2 -\n1957 MEMBERSHIP REPORT\nIn addition to the fourteen paid up 1937 memberships recorded in the February\nNews Letter, five more stations have been added to the list, Treasurer Brackett\nreports. They are:\nKFKU University of Kansas\nWRUF University of Florida\nKOAC Oregon Agricultural College\nKWSC Washington State College\nWCAL St. Olaf College\nAnother report will be made in the April News Letter.\nSHORT FLASHES FROM THE FIELD\nKUSD - University of South Dakota. A forward step is reported here:\nUnder the supervision of Dr. B.B. Brackett, director of radio and Dr. W. H.\nJordan, head of the department of physics and chief radio operator, the new trans¬\nmitter for KUSD has been completed and is now broadcasting regular programs for the\nUniversity of South Dakota. The station has been off the air since November IS,\n1936, while this work has been in progress.\nThe plans for this transmitter were worked out in detail by Robert E. Rawlins,\nstudent.from,Pierre. S,.D.\ndiate direction of Rawlins,\nConstruction work has been carried out under the imme-\nassisted by NYA students.\nWhile economy has been necessary, only the very best material has been used,\nand much shopping about has been done to secure the best material and parts that\ncould be found for the prices paid. All outside construction work was according to\ndefinite specifications, and exact production required. The completed transmitter\nis a beautiful piece of work. If purchased assembled it would have cost well over\n$6000.00. Mth much of the l$bor not charged to the radio station, we fcave spent\nonly about $<.000.00. The equipment now not only meets the present .requirements of\nthe F.C.C.; but we believe, anticipates future requirements of the Commission and\nfuture developments desired by our own people.\nWith a fine new studio and with new microphones and new speech control and\nmixing equipment, we expect to be able to put on the air broadcasts of great fidelity\nand excellent quality.\nThe regular schedule for the present will be two full hours each week day, ex¬\ncept Saturday, with the Sunday broadcasts not yet fully determined.\nCleveland College, Western Reserve University. A new series of programs,\n\"Biology; Yesterday, Today, and Tomorrow\" is reported by Mrs. Grazella P. Shepherd.\nDone by Dr. J. Paul Vesscher, of the biology department, the broadcasts deal with\nspontaneous generation, heredity, photosynthesis, evolution, and environment.• They\nare heard over WHK, Cleveland.\nWNAD, University of Oklahoma. A clipping from Oklahoma* s \"Sooner Magazine\" for\nFebruary does a neat bit of publicity for MAD. Two pages are devoted to the student¬\ntraining phase of the station’s activity. The article \"WNAD’s Graduates Are Making\nGood\", by Homer Heck, gives information and pictures of the station’s former student\nworkers. It is an impressive story of the vocational training value of student radio\nactivities."
}