{
  "id": "d1462-2",
  "text": "- 5 -\nWESG. Cornell-University. Charloo A. Taylor comes through with this informa¬\ntion about the radio activities of Now York State College of Agriculture, at Cornell.\n\"During the past year and a half one of the regular features on the farm program of\nWESG has been a topic entitled \"As Farmers See It\". This is a regular Saturday noon\nfeature and about seventy-five different farmers have spoken in the series. We have\nbeen delighted with the response which these people have had, and we propose to con¬\ntinue the series indefinitely.\nEach one of these farmers has carte blanche to come to the studio and paint the\nthing as he sees it. They seem to like the experience and I think it is a good\nthing for our program.\nIn choosing farmers to invite, we consult with the extension specialists in\nthe various departments of the college and they have been careful to pick farmers\nwho have been successful in their own communities and are respected there. Such\nfarmeru are not hard to find, of course, in this state.\"\n\"The Cornell Radio Guild is nearing the completion of its second year on the\nair. This is a weekly program presented by the Cornell Radio Guild which is a reg¬\nularly organized student activity at Cornell University. It has the unusual feature\nof having been organized and operated by the students, especially those interested\nin dramatics, public speaking, and various musical organizations on the campus. It\nis, of course, aided by faculty advice when that advice is sought. The participants\nin the Radio Guild are chosen competitively, and it is noted that about one and a\nhalf times as many students try out for the Guild as try out for football.\nWestern State Touchers College. Kalamazoo. In a brief letter W. G. Marburger\nsays: \"We are putting on two fifteen minute broadcasts a week over WKZO, a local\ncommercial station. The programs are varied in nature, drawn from the fields of art,\nmusic, history, economics, science, liter*ture, etc. Approximately one-third of\nour programs are put on by students generally under faculty direction. The others\nare put on by different faculty members.\nWe are experimenting with the use of recordings on these programs. Our first\ntranscription programs were given on Feb. 11 and March 9. Another will occur on\nMarch 50. If we are as successful with these as we hope, it will be possible for\nus to present on our radio programs some of the outstanding personalities who come\nto our campus from time to time. Because of the inconvenience of our broadcasting\nperiod, we cannot do this at present.\"\nW1XAL, Boston. Massachusetts (International, short-wave, educational, non¬\ncommercial station). The microphones of W1XAL have entered the class-rooms of\nHarvard University. Short wave listeners may now hear regular University classes. A\nliterature and history lecture is being used in the experiment. An early .issue of\nthis News-Letter will report the results of the venture.\nWith this News Letter is included a copy of President McCarty*s talk \"The\nUniversity Station Director Faces His Problems\". Let’s have your comments. How does\nit fit your case? McCarty needs your guidance in planning his Ohio Institute state¬\nment on \"Why The Educational Station?\" Write him*.\nS.O.S. - Send On Some NEWS! Many station activities are\nnot being reported. Send the news-notes and Exchange Packet\nmaterial to H*A. Eng@l, Radio Hall, Madison, Wisconsin. Don't\nkeep your accomplishments a secret — share them!"
}