{
  "id": "d710-123",
  "text": "-23-\nmay make a conditional grant to the Hew York group*\nObviously, much more remains to be done than has been accomplished. The National\nCitizens Committee and Dr. Henry and his colleagues cannot do the job of es¬\ntablishing a station alone. Public-spirited citizens must pitch in and acquire\nan understanding of the almost awesome educational potentialities of the new TV\nmedium. And the more civic groups that apprise Dr. Henry of their interest and\nenthusiasm, the easier his job will be.\n(New York Times. May 24, 1953)\nTV VIEWING HABITS REVEALED IN STUDY\nTelevision was found to have a greater effect on the living habits of adults\nthan children, on rural familes than city dwellers and on \"blue collar workers\"\nthan on \"white collar workers\" according to results of a three—year study just\ncompleted by Dr. Frank L. Sweetser, associate professor of sociology at Boston\nUniversity. Video*s major effect was found in the allocation of time, with\nadults more radically altering their normal activities following set installation\nThe study shows that time has been diverted to TV from radio listening, movie\nattendance, reading, attendance at sports events and parties, visiting, sleeping\nand hobbies.\nConducted among 1,076 individuals in 254 TV familes equally divided into rural\nand urban areas, the study revealed that 93.8 per cent of adults over 21 years\nold listened to the radio less with the advent of TV, while only 74.1 per cent\nof the children between three and six years decreased radio listening, and\n93.3 per cent of those in the seven-to 20-year-old group listened less. Figures\non the number of hours used viewing TV programs showed outlying suburban listeners\nspending more time than all others, with 14.1 hours between Monday and Friday\nspent before the video screen. White collar workers, regardless of where they\nlived, spend only 11.7 hours for the five-day periods of watching TV, while blue\ncollar workers, regardless of residence, watch for an average of 13.9 hours\nduring the same period.\n(Radio-Television Daily. June 19, 1953]\nEDUCATORS DOING SPRING FOR SLICE OF TELE.PIE\nWith educational institutions exhibiting a terrific burst of speed in applying\nfor TV channels reserved for education, it now looks as tho there may be 100\neducational TV stations on the air or applied for in the next 12 months. Already\n45 applications nearly 20 per cent of the 244 TV channels earmarked for edu¬\ncation, have been filed with the Federal Communications Commission, while two\nothers propose non-commercial operations on unreserved channels. Seventeen of\nthe applicants have received construction permits, one grantee, KUHT, Houston,\nis already on the air and a number of others are all set to go.\nFifteen applications were received by the FCC between May 25 and June 2, and\nRalph Steetle, executive director of the Joint Committee on Educational Tele¬\nvision, expect that 50 more will be field by next June.\nIn a letter this week to Harold E. Fellows, president of the National Association\nof Radio and Television Broadcasters, Steetle described as \"particularly hearten¬\ning\" the fact that most of the educational applications \"show solid financial\nand community support.\"\n(Billboard. June 13, 1953)"
}