{
  "id": "d710-126",
  "text": "-26-\nGRANT BRINGS nFREEDOM11 TO WHOM\nII017 does one go about producing a 06,000 radio series?\nThis was the question which confronted WUOM last fall when it was presented with\na grant-in-aid by the Fund for Adult Education, a subsidiary of the Ford Founda¬\ntion.’'\nEarlier in 1952 the National Association of Educational Broadcasters had re¬\nceived a large sum of money to be given to its members in the form of grants-\nin-aid for adult educational broadcasting. It was specified that no grant\nshould exceed 07,000.\nThe NAEB asked each of its 90 members to submit ideas and budget for types of\nradio shows they would like to produce if they had the money to undertake the\nprojects.\nWUOM had been considering for some time presenting a radio series depicting the\nevents which led to securing many of our academic freedoms. This idea was sub¬\nmitted, approved by the NAEB and in October, 1952, the \"Freedom to Learn\" series\ncame into being.\nThe series, which at present is in the process of being tape-recorded, includes\n13 original scripts concerning the problems encountered by some of the little-\nknown champions of academic freedoms.\nStarting next fall.the shows will be broadcast locally by WUOM.\n(Ann Arbor. Mich- News. May 26, 1953)\nSTAFF TURNOVER HEAVY. BUT N.U. STATION GROWS\nWMJR, 10 watt FM station on the Northwestern University campus, has nurtured\nabout 350 students preparing for radio and TV careers in three years of broad¬\ncasting.\nThe small but eloquent community voice which broadcasts 26 hours each weeks\nhas a turnover of 93 per cent of its staff each summer and about 33 per cent\neach quarter. A staff of 45 works in various jobs to maintain the station.\nWhen WMJR first broadcast in May, 1950, 30 students handled the 10 hour broad¬\ncasting week. Their one shelf of records was owned by the students who took\ntheir collections with them when they left. Today WMJR belongs to the National\nAssociation of Educational Broadcasters tape network, has purchased a transcrip¬\ntion library of 5,500 selection, subscribes to the Capital long play library, and\nhas collected 2,400 73 r.p,m. records thru donations.\nThe largest percentage of air time is filled with music. But it is not the usual\ndisk jockey chatter with platters which you might expect. The record spinners are\nspecialists in classic, jazz, or folk music. One of the most unusual record\nprograms'was Call It Primitive. Anthropologist Dick Waterman played trans¬\ncriptions of the music of natives in remote parts of the world.\nAll aspiring talent is given an opportunity for expression. Graduate music\nstudents perform regularly. Sports announcers practice during the football\nand basketball seasons.\n(Chicago Tribune. June 7, 1953)"
}