{
  "id": "d710-127",
  "text": "-27-\niiemngck hails first educational video station\nThe opening of Educational TV station, KUHT, University of Houston, Tex., not\nonly marks a milestone \"hailing a highly significant achievement in the building\nof the first non-comiaercial education station,\" but it \"formally opens one of\nthe great frontiers of modern times,\" FCC Commissioner Frieda Hennock declared\nin an address prepared for delivery here last night.\n\"1 am more than gratified and deeply honored,\" Miss Hennock said, \"to meet with\nyou and to address you on the occasion of the formal dedication of station KUIIT\nof the University of Houston, the first non-commercial educational tv station.\n\"Here today,\" she added, \"we perform a dual function. We mark a milestone, hail¬\ning a highly signficant achievement ... At the same time we look forward and\npledge ourselves to ever-widening horizons for educational TV in general. . . .\nFor this dedication of the University of Houston’s TV station formally opens one\nof the great frontiers of modern times. By virtue of it, the eyes not only of\nTexas but of the entire country are focused full upon you ... .1 am certain\nthat those eys will be rewarded xvith an enlightening and inspring sight.\"\nMiss Hennock pointed out that \"here in Houston\" begins the practical realization\nof the \"tremendous benefits that television holds out to education. With TV,\nthe walls of the classroom disappear: every set within viewing range is a po¬\ntential classroom.\"\nAt the same time, she said, \"educational TV cannot, of course, be considered a\nsubstitute or replacement for our traditional educational system. It is rather\na . . . strong ally for it.\"\n(Radio-Television Daily. June 9, 1953)\nCHICAGO MAH NAMED TEACHER\nMilton Mayer of Chicago, former director of \"Voice of Europe\" program of the Na¬\ntional Association of Educational Broadcasters, will be a member of the Spokane\ninstitute of international relations faculty this year.\nHe will participate in several sessions of the institute, scheduled for the Uni¬\ntarian church, June 5,6, and 7, according Frances McIntyre, program coordinator.\n\"Once a newspaper man in this country and Europe, Mayer has served as assistant\nprofessor in adult education for the University of Chicago and as national\ndirector of the Great Books foundation,\" she said\n(Spokane, Washington, Chronicle, May 30, 19\nPLAN EDUCATIONAL STATION FOR SAIT ANTONIO AREA\nU.W. Jackson, vice chairman of the state board of education, has been named chair\nman of the San Antonio Council of Educational Television. The group will make\napplication for TV channel 9 which has been allocated to the city for educational\npurposes within the next 30 days.\nA group of ten educational leaders have been named as a steering committee to\nprepare the application for the outlet. The new council was informed that a\nminimum of $150,000 for equipment and facilities, exclusive of building, will\nbe needed to put the station on the air. It will cost an additional $25,000\nannually to operate the educational TV station.\n(Radio-Television Daily. June 3, 1953)"
}