{
  "id": "d710-144",
  "text": "O >\nX Q)\nll\n* i al\noo ?£\nBackground: Milton Mayer interviews a man who lives\nand works in a city in southeastern Germany, very close\nto the Soviet Zone of his country. His work is intimately\nconnected with the situation of the German soldiers,\nwho, more than 7 years after the end of the war, are\nstill held as prisoners all over the world. Dr. Schmidt\n— this is not his real name — was a Nazi and a fervent\nNazi. But he lost his faith in Nazism as he saw it develop\nduring the war, and, in effect, became a traitor. In the\nhalf-destroyed city of Hanover, Germany, the city which\ngave England a family of kings, Milton Mayer visits the\nhome of Rolff and Hilda Pabst. a young couple married\n2Vi years ago. Hilda Pabst, who has never visited Eng¬\nland or America, speaks better English than he- ' us-\nband, and, as befits the modern woman, she sp« or\nboth of these young German liberals. - _ .\nO\n>\nBackground: In the city of Manchester, England, the head¬\nquarters of the Cooperative Society of Great Britain,\nMilton Mayer interviews Mr. Headley Whitehead who is\nwarden of one of the three residential youth centers\nmaintained in different parts of the country by the co¬\noperative movement. Mr. Whitehead, at the age of 35,\nis secretary of the Cooperative Youth Centers Society\nof Britain. He says that he grew up in the philosophy\nof the cooperative movement. He was the son of an\nengineer in the city of Sheffield. His mother had been\na village school teacher. After finishing high school and\nworking as an office boy in a law firm and then in a\nfactory and then as a secretary in a trade union, he\nentered the movement as a full-time worker.\nn ii\nce «£ •=■\n.S« •§-£\n0) 3 >\na> o ,= ==\n«§.§ SJ\ne e s s ~\n0.2 8 £ m\nBackground: In Helsinki, the capital of Finland, Milton\nMayer interviews Professori Lauri Posti, professor of\nlinguistics in Helsinki University. Miss Irmeli Viherjuuri\nis information director of the leather and shoe industry\nof Finland. But it isn't leather and shoes that Milton\nMayer discusses with her. Instead they talk about the\nFinnish sauna, for she is an expert on that subject.\nHer father, a teacher, wrote the definitive book about\nthe sauna, a book which has been translated into many\nlanguages, including English.\nBackground: Milton Mayer interviews a man whom he\ncalls \"Professor Schmidt,\" an unemployed professor of\nlanguages somewhere in the East Zone of Germany, a\nman who believes that everyone in East Germany is\nready to wage war against the Communists. In this\nprogram we hear two opposing views of conditions be¬\ntween East and West Germany. Somewhere in Germany,\nMilton Mayer interviews a woman whom he calls \"Frau\nMargarete Lehmann,\" although this is not her real\nname. Frau Lehmann lives outside a small town in the\nRussian occupied zone of her native land. Frau Lehmann\nis lame in one leg and walks three quarters of a ur\nto work every morning and back every night,_.ie\nage of 68.\nS*\n■o o\nJ>ei\n; j § -\n«c 55 55 i\nu 0) o\n■t C C I\nj* 0 o I\no T5 T3 1\nC C I\nE\nBackground: In December, 1949, Indonesia, after 3'/2 cen¬\nturies as a Dutch colony, obtained its independence,\nfollowing 4 years of negotiating, bloody fighting, more\nnegotiating, more fighting, and finally the intervention\nof the United Nations. Nona Suminah Kamil is an In¬\ndonesian school teacher whom Milton Mayer interviews\nin Bentveld, Holland. She is on her way home after a\nyear of study at the University of California in Los\nAngeles. Dr. P. J. Koets was Director of the last Dutch\nCabinet of Indonesia. He went there in 1929 as a school\nteacher, with his wife, a physician. Their six children\nwere all born there. He entered the Indonesian govern¬\nment in 1939. During the Japanese occupation of the\ncountry. Dr. Koets was a prisoner of war in Burma and\nSiam."
}