{
  "id": "d710-152",
  "text": "On Pacifism and On public opinion On refugees and On Finland and On the situation today\nVeterans in Britain refugee passports the Finns in Vienna and Austria\nHerr Kaspar Mayr and Duke of Bedford and Lord Adams Frau Waltraut Skupin and Herra Aarnio and Dr. Vaartaja Herr Johann Hannak and\nMajor Jan Linzel Herr Odd Nansen Dr. Kurt Rothschild\nBackground: Like the g\nHannak is a chess p .\nchess. He has a few s\npolitical editor of the Arbiter Zeitung, the official news¬\npaper of the Socialist Party of Austria and the largest\nnewspaper in the country. In 1938 he was seized by\nthe Nazis but after a year in the concentration camps\nof Daohau and Buchenvald, he was able to go to\nAmerica. Now, since 1946, he is back in Vienna. Dr.\nKurt Rothschild, born in Vienna, the son of a '\"'m-\nmercial agent, attended Glasgow University it \\-\nland from 1938 to 1940 and served as lecturer at\nUniversity in economics from 1940 to 1947. He is-nbw\neconomist for the Institute for Economic Research of\nVienna, one of these mixed bodies so frequently found\nin all European countries, maintained jointly by the\ngovernment, by industry and by the trade unions.\nDr. Rothschild himself is not a member of any political\nparty.\nBackground: Herra Aarnio is 33 years old and a lathe\nturner in a silver factory as his father was before him.\nAt the age of 13 Herra Aarnio left school and at 15\nwent to work. At 22 he was called up in the Finnish\narmy at the time of the so-called Winter War, the\nRussian invasion which began in December, 1939. For\n3 years he fought in Russia against the Russians and\nreturned home at the armistice in 1944 after a total of\n5 years in his country's army. During this time he\ntaught himself English. Next Milton Mayer interviews\nDr. Vaartaja on the subject of the loss of part of\nFinland to the Soviet Union.\nBackground: In the stable of the family of Hans Skupin\nand his wife Waltraut, Milton M.ryer had a conversa¬\ntion with Dolly. Dolly is now a cow. When she left\nBend, Oregon, on her way to Falkenbach, she was a\nheifer, a calf carrying her first calf. It was the heifer\nproject originated by the Brethren Service Committee\nof the Church of the Brethren which brought Dolly and\nsome 12,000 other animals; goats, cows and bulls, to\nstricken farmers — refugees —• all over the world, in\nAsia as well as here in Europe. Dolly is doing well,\nas we shall soon hear when Milton Mayer speaks with\nFrau Skupin. An occasional letter still comes to the\noffice of architect Odd Nansen in the city of Oslo,\naddressed simply: Nansen, Norway. Odd Nansen's\nfather, Fridtjof Nansen, the Professor of Oceanography\nwho invented the Nansen Passport, received thousands\nand thousands of such letters. Architect Odd Nansen\nhimself is considerably more famous as a humanitarian\nthan he is as an architect. He has worked all his life\nfor refugees, and he is President of the Norwegian\nsection of the World Movement for World Government.\nBackground: The Bedford family name is Russell and\nthe first Russell was elevated to the peerage of Eng¬\nland in the year 1539. The present Duke's great\ngrandfather* incidentally, was the grandfather of\nBertrand Russell, the philosopher. Jack Adam' s\nfour years old in 1894 when his father was kille i\ncoal mine in Cumberland County, on the west crdst\nof England. Today Jack Adams is secretary of the\nCumberland Development Council, a private agency,\nand general manager of the West Cumberland Devel-\nopment_ Corporation, a government agency. Tn these\ncapacities he is one of the men, the man, according\nto all the rest of England, who changed West Cumber¬\nland, one of the worst of England's so-called De¬\npressed Areas, into a flourishing economy. He isn't\nJack Adams anymore. On January 1st, 1949, the King\nof England elevated him to the peerage. The Cumber¬\nland miner's boy is now Lord Adams of Enerdale, but\nhe still looks c \" - ' ‘\nBackground: In interviews recorded in Austria and in\nHolland, Milton Mayer speaks with a Pacifist and a\nDutch war veteran."
}