{
  "id": "d710-182",
  "text": "11.\naudition room, but storage space immediately adjacent to studios\nshould be provided for microphones, sound effects, music racks,\ncollapsible chairs, etc. The diagrams hereafter shown indicate\nsome arrangements.\n4. Offices\nOffices should be separate from studio space, but preferably adjacent.\nPrivate offices should be provided for as many key personnel as\npossible. And secretarial and clerical staff should be supplied for\nthe radio station exclusively.\n5• Miscellaneous\na. Adequate cloakroom space for personnel and visitors.\nb. Independent outside entrance and parking space.\nB. Planning Equipment Facilities\n1. Transmission Equipment\nThere can be no specific recommendation on transmission equipment.\nEach community offers a somewhat different problem which must be\nsolved by the consulting engineer employed. The power of the trans¬\nmitter, the height of the tower, and related problems, as well as\nthe engineering involved must meet the standards established by the\nFederal Communications Commission. In general it is recommended\nthat a low power unit be capable of acting as exciter unit for a\nstation of greater power to provide for growth. In general it is\nrecommended that transmission and studio facilities be located in a\nbuilding permitting expansion both of radio and television facilities.\n2. Studio Equipment\nIt must be remembered that the following recommendations are tenta¬\ntive. They are.based upon a survey of present equipment. The sur¬\nvey did not seek to find out whether the amount of equipment was\nconsidered adequate.\n\"Cheap\" equipment cannot be recommended. Success in broadcasting\ndepends upon the quality of the transmission equipment, its per¬\nformance standards, its signal quality, as well as program quality.\nEngineering advice should be sought when purchasing; standard pro¬\nfessional equipment or its approved equal should be specified.\na. Microphones\nThe number ranged from 4 to 13 per station. The average was\n7, the mode 8. The types most mentioned were:\nRCA 44 BX (Velocity)\nRCA 77 D (Polydirectional)\nRCA 88 A (Pressure)\nRCA 74 B (Velocity)\nWestern Electric 639-A (Cardiod)\nWestern Electric (Dynamic)\nWestern Electric 63O-A (Eight-ball)"
}