{
  "id": "d710-258",
  "text": "-14-\nwindow-display card size for publicity display at that time?\nANSWER; A new series of NAEB maps will be prepared for distribution by November\n1. Each map will include areas of FM and AM coverage, with population data.\n(Schooley)\nANSWER; Coleman of WKAR is preparing individual maps for individual stations.\nThey will be sent to stations in a couple months for a check on accuracy. (Miles)\nQUESTION; Can NAEB provide evaluation forms to measure the impact of programs?\nA form of evaluation already exists in the \"standards\" set up for network\nacceptance of shows, but stations want to know what happens to the programs they\nsubmit.\nCOMMENT: Doesn’t Headquarters itself want to know what stations think about pro¬\ngrams? The reaction to them? What makes a good radio program? It would help\nanswer that question if we could agree, nationwide, on criteria of a good edu¬\ncational broadcast. Production details should be a part of those criteria.\nAN3WER: We should devise an evaluation form for acceptance of programs for the\nnetwork, use it, and then amend it as conditions warrant.\nCOMMENT: Headquarters should begin long-term program planning. Programs must be\nthe best education can offer. NAEB should make a survey for finding the best\npeople and the best areas for programming, and then commission the programs to\nbe done. Coleman’s research into program—lengths and McKown’s suggestions\n(RE: program evaluation) would be a starting point for a long-term plan. It\nshould be a program planning committee instead of simple acceptance or rejection\nof some specific series. (Harley)\nDISCUSSION: This long range planning is necessary in NAEB’s relations with\nFoundations. Previous grant-in-aid were awarded tc the best programs offered\nat the time. No commissions were made for their production.\nQUESTION: Are all tapes available to DAVI? (Department of Aduio-Visual In¬\nstruction, nea)\nANSWER: No. DAVI will select about 100 programs and will have dub masters made.\nState libraries will distribute and handle the problems of clearance. (Miles)\nQUESTION: How about clearance of performance rights on recordings used on tape...\nand subsequently dubbed by an AV center? Who is liable for action with respect\nto violation of performance rights? (Stegath)\nANSWER: The AV center...unless it has a copyright license...is liable for the\nreproduction. You aren’t. (Harley)\nQUESTION: What can NAEB do regarding newspaper publicity for stations?\nANSWER: Can't do too much for you. You've got to sell yourself. (Miles)\nCOMMENT: Experience with ’’Youth Forum” showed they received better coverage in\nsmall papers. Big papers take only the unusual. Writing know-how is of extreme\nimportance (McMahon)"
}