{
  "id": "d710-54",
  "text": "Reprinted from the Hollywood Quarterly\nVOLUME V • NUMBER 3\nAllerton House 1949,1950\n_ ROBERT B. HUDSON\nROBERT B. HUDSON, Director of University Broadcasting at the University of Illinois,\nhas been active in the fields of both education and radio. After some years of work in adult\neducation, he organized and served as director of the Rocky Mountain Radio Council, an\nassociation of thirty colleges and universities which, since 1939, has been cooperating with\ncommercial radio stations in presenting public-service programs. More recently, he was\na radio consultant to the OWI, and from 1945 to 1950 was director of Education and\nOpinion Broadcasts for the Columbia Broadcasting System.\nThe seminars on educational broadcasting held at Allerton House, a conference center\nof the University of Illinois, were the outcome of conversations between John Marshall of\nthe Rockefeller Foundation and Wilbur Schramm of the University of Illinois. Dean\nSchramm served as the director of the 1949 seminar, and Mr. Hudson as the general\nchairman of the seminar in 1950.\nAt long last educational broadcasters have discovered that they\nare not faint, isolated whispers in the broadcasting world. They\nhave discovered for the first time that they are a part of something\nof great significance in America. Furthermore, among them is a\ngeneral recognition not only that their role is important (they\nhave always believed it to be), but that now there is some prospect\nof their controlling their own destiny.\nFor a group which has been broadcasting more or less regularly\nsince the early ’twenties, and whose members stood with their few\nstations against economic and political buffeting in competitive\nseas better charted and more efficiently navigated by commercial\nbroadcasters, such a discovery warrants a bit of looking into.\nThe discovery that things were not what traditionally they\nseemed to be was made by a relatively small group of men meeting\nunder circumstances which were hardly extraordinary. About\ntwenty directors of educational radio stations and university\nprogram-producing centers were invited to Allerton House for\ntwo weeks in the summer of 1949 for a stocktaking of educational\nbroadcasting. These men knew each other well—as a matter of\nfact they had been meeting together at conventions for years—\nand they had some acquaintance with the other fellow’s problems.\nBut common problems were usually overshadowed in these meet-"
}