{
  "id": "d710-55",
  "text": "238 HOLLYWOOD QUARTERLY\nings by peculiarities of their specific application. The men who\ngathered at Allerton House were accustomed, too, to their “step¬\nchild” role in American radio, and knew that not infrequently\neducational radio was accorded similar status on their home cam¬\npuses as well. They had watched, during three postwar years, as\ncommercial networks and stations dropped all pretext of educa¬\ntional broadcasting, substituting for it mainly the Advertising\nCouncil’s public service formula—calls to action with little pre¬\nmium on understanding.\nBut commercial radio and its practices were not on the Allerton\nHouse agenda. Here was a chance for educational broadcasters\nto think cooperatively and consecutively about noncommercial\nradio. No one was present to sell them on a program or to draw\nthe grand design. Their advisers were not there to remind them\nof a mission in life. Even the representatives of the radio industry\ncame to be counted and to talk theoretically of free speech, rather\nthan to recommend courses of action. They were on their own,\nand there was adequate time for soul searching.\nThe daily sessions of the seminar, planned in advance by a\nsteering committee, tended to be overprogrammed for fear that\ntime might hang heavy on the hands of a group of active radio\nmen who found themselves suddenly set down in the heart of the\nRobert Allerton Park and almost literally withdrawn from the\nworld. But before two days had passed, the agenda was scuttled\nand the whole group was aflame over the central question: “What\nis the job of educational broadcasting?” What is it doing? What is\nit not doing which it should be doing? What properly should be\nexpected of it? What is its role in American life and culture?\nWhat is it waiting for? Questions like these completely consumed\nthe attention of the group in its scheduled meetings, in rump ses¬\nsions, in committees, at meals, in the Monticello tavern, and in\ncountless bull sessions. As the group buckled down to its task, it\nseemed that suddenly a great truth had been revealed which long\nhad haunted every man present but which had seldom escaped"
}