{
  "id": "d710-83",
  "text": "COAST TO COAST WITH NAEBers\nProf. Henry L. Ewbank of the University of Wisconsin speech department has\nwritten with Prof. Sherman P. Lawton of the University of Oklahoma a new basic\ntext, Broadcasting: Radio and Television which has already been adopted by\nmany universities and colleges. The book is published by Harper and Brothers,\nNew York.\nKSLH, St. Louis, celebrated, quietly, its third birthday on April 13*\nKeith Nighbert,director of KUSD, University of South Dakota, addressed the\nannual meeting of the South Dakota Tuberculosis and Health association on April\n19. His topic: \"Radio and Television in Health Education.”\nEvidence of thn appeal of educational broadcasting is shown in one instance\nwhen recently, a listener called up KUOM, the University of Minnesota radio\nstation and asked for the frequencies of half a dozen educational radio sta¬\ntions from Minnesota to New York City. The listener said he planned a vaca¬\ntion trip and refused to listen to commercial broadcasting while driving across\ncountry. He also added that he was looking forward to the three-four days of\ndriving as an opportunity to enjoy hours of NAEB and local educational program¬\nming.\nWBEZ, broadcasting facilities of the Division of Radio and Television, Chicago\nPublic Schools, celebrated its tenth anniversary of frequency modulation oper¬\nations on April 14th. WBEZ presents more than 100 programs weekly, directed\nto schools and to the general listening audiences.\nNote the special Associate Membership page in this issue. Data were collected\nby H. Barrett Davis, Lehigh University,at the suggestion of Jim Miles. Watch\nfor later pages of special interest to Associates.\nIn keeping with the Easter season, KUOM, the University of Minnesota, presented\nits second annual Lenten Music Festival, a series of twelve programs, including\ntwo five hour presentations. Wagner's \"Parsifal” was broadcast in full, in a\nfive hour program. Bach's \"The Passion of Our Lord According to St. Matthew,”\nand his \"Chorale” from the \"Easter Cantata” were featured in the second five\nhour musicale. Palestrina’s \"Sicut Servus,” and Shutz's \"Seven Words From the\nCross” were the other two works on the second program. The annual Lenten\nMusic Festival, broadcast this year from March 7 to April 4, presented some of\nthe great religious music of Christianity in observance of the Easter season.\n\"Animals are Fun” is the title of a new TV series inaugurated recently by New\nYork University over WPIX, New York.\nThe University of Rochester began a 12-week course in applied French over WHAM-\nTV during March.\nRadio Production classes announce over the Toledo high school public address\nsystem, produce skits over it, and each class is responsible for broadcasting\na minimum of one serial over WTDS-FM, the radio station of the Board of Educa¬\ntion.\nWFIU is the subject of a two-page spread in the March issue of the Indiana\nAlumni Magazine."
}