{
  "id": "d710-85",
  "text": "-5-\nMargaret McKeegan is author of a thesis written in partial fulfillment for the\ndegree of Master of Science at Iowa State College. Subject of'the thesis is\n\"Techniques and Problems of Presenting Homemaking Television Programs.\" For\nmore detailed information the thesis may be borrowed from Iowa State College\nLibrary through inter-library loan, for a small charge.\nTexas Technological College of Lubbock, Texas, made its debut on television\nover KDUB-TV, Lubbock commercial station, with five hours of programs in as\nmany consecutive days from April 13 through April 17. The programs in the\nseries titled \"A Look at College*’ were beamed to high school audiences and the\ngeneral public from eleven to noon each day. High schools with the coopera-*\ntion of local dealers within the viewing area were able to have assembly rooms\nespecially equipped with television receivers particularly for the benefit of\nthe senior students. Notices and letters were sent to 750 different high\nschools by both Texas Tech and KDUB-TV. These were sent out far enough in\nadvance of the telecasts so that the schools within KDUB-TV* s signal range .\ncould make preparations to receive the programs. Follow-up questionnaires\nare now being prepared for an actual count and recorded responses from the\nhigh schools.\n#****##*#**\nKUOM PRODUCES SECOND PROGRAM FOR VOA\nFor the second successive year the facilities of KUOM were used to record a\nmusical exchange program for the Voice of America aimed at strengthening\nEuropeans* understanding of America. The program, recorded by the University\nof Minnesota*s radio station for the Voice, was this season’s final Minnea¬\npolis Symphony Orchestra concert. It will be broadcast over the Swedish\nnational radio network in June.\nA special intermission feature with commentary in Swedish was part of the\nrecording and included interviews with Mayor Eric G. Hoyer of Minneapolis,\nthe president of the American-Swedish Institute, the acting Swedish counsul, a\ndelegate from the Swedish consul in New York in charge of cultural affairs,\nand a Swedish exchange student now at the University of Minnesota.\nThe Swedish broadcast will be part of Stockholm’s 700th founding anniversary\ncelebration. Carl Albert Anderson, president of the Stockholm city council,\nhad promised to complete the exchange with a transcription of Swedish music\nfor a Minneapolis broadcast.\nLast year’s civic radio program was produced by KUOM for the Voice of America\nfor broadcast in the city of Florence, Italy, with prominent Italo-Americans\nas guests.\nCHAIRMAN HYDE SAYS NO TIME LIMIT ON EDUCATIONAL 17 CHANNELS\nWashington, (AP)—The newly-designated chairman of the Federal Communications\nCommission—Rosel Hyde—has assured senators that there is no time limit on some\n242 television channels set aside for educational use. Ifyde testified before\nthe Senate Commerce Committee. It had been assumed in some circles that\nchannels for video education would be set aside only until next June 2. The\nCommittee chairman, Senator Charles Tobey of New Hampshire, expressed pleasure\nat this statement from Hyde. He indicated it is his belief that such channels\nshould be set aside indefinitely for educational purposes."
}