{
  "id": "d710-94",
  "text": "TV CRITIC FINDS \"SEVEN YEAR ITCH\" A SIGHT TO BEHOLD—HAS COLOR. NO TUBES. 3-D\nAND NO COMMERCIALS by Jack Gould\nStrange things are happening. The owner of a television set obtained leave of\nabsence on Saturday from the Federal Communications Commission and by chance\ndiscovered a revolutionary development in the entertainment world. It is called\nlegitimate theatre.\nThe temporary pass from the FCC permitted entrance to a place called the Fulton\nTheatre on Forty-sixth Street west of Broadway. It turned out to be a studio\nwith walls. There was a show called \"The Seven Year Itch,M starring Tom Ewell.\nIf what goes on at the Fulton is typical of the theatre, it’s time television\nand Hollywood really got worried.\nLiterally hundreds of people went to all the trouble of seeing the show. So\nfar as a careful survey showed there wasn’t even one man in his undershirt or\none housewife in a pair of slacks. In response to inquiry, an usherette said\nalso that it was not obligatory to smoke a mild, king-sized cigarette or go\nto the refrigerator before the curtain went up. How long has this been going on?\nThe size of the screen was huge, even by Dr. DuMont’s definition. It looked\nabout forty feet across and thirty feet high. But that is not alii No doubt\nit will come as a terrific shock to David Sarnoff that the whole show was in\nfull color and the producer didn't even use one tube.\nThere’s also bad news for Spyros Skouras. He doesn't have to worry any longer\nabout three-dimensional show business; the bloomin' thing is here now. Even\nwithout glasses all the members of the cast of ’’The Seven Year Itch” looked\nwell-rounded, especially Miss Vanessa Brown in the lavender negligee. The\ntechnical innovations were startling. The volume of the sound was just right\nand a viewer could see three actors at once without changing the focus control.\nMr. Ewell and Miss Brown not only acted superbly, which was to be expected\nafter their experience in television, but they were on stage for better than\ntwo hours without pausing for a timely word from either Ben Grauer or Richard\nStark. There was not even any station identifications no one at the Fulton\nTheatre was told that he was at the Fulton Theatre, which did seem carrying\na revolution just a bit far.\nAs might be expected, the intermissions were something of a trial. Without\nmiddle commercials the audience had nothing to do but wander around, talk a\nlittle and smoke a cigarette. How lost can you get?\n(New York Times. April 20, 1953)\nNEW TV OFFERED TO BOSTON\nAn offer of \"at least $500,000” for equipment a non-commercial television sta¬\ntion in Boston was made today to Gov. Christian A. Herter by representatives\nof five private foundations. The announcement was made by State Senator Chris¬\ntopher H. Phillips,chairman of a special legislative commission on educational\ntelevision. Mr. Phillips said the foundations, largely established by Edward\nA. and Lincoln Filene, Boston merchants, had stipulated that other funds for\noperating and maintenance must be made available.\nThe FCC has reserved Channel 2, in Boston, until June for educational purposes.\nAt present Boston has two commercial channels. Western Massachusetts, which\nlacks a local channel, may have two from the Federal agency for educational\npurposes, if there is any demand.\n(New York Times. April 15, 1953)"
}