{
  "id": "d710-98",
  "text": "-18-\nBibliography (Con't)\nLegman, Gershon. Love and Death. New York, Breaking Point Press, 1949,\nViolence and sex. in relation to the content of comics, r adio, motion\npictures and literature. -\nKingson, Walter K, ’’Measuring the Broadcast Audience,” Quarterly of Film,\nRadio and Television 7:3, Spring 1953* P* 291*\nLardner, John, ”So You Think You See the Fights on TV.,n Saturday Evening Post\n225:44, May 2, 1953* P*-32.\nManvell, Roger. \"A Head Start in Television,” Quarterly of Film. Radio and\nTelevision 7:3, Spring 1953. p. 246.\nPaulu, Burton. Factors in the Attempts to Establish a Permanent Instrumental¬\nity for the Administration of the International Broadcasting Services of\nthe United States. New York. New York University. 1950.(Ph. D. disser¬\ntation).\nFactual account of proposals regarding international broadcasting from\nthe end of World War II to 1948, with an evaluation in terms of the ob¬\njectives laid down by the U.S.. Information and Educational Exchange Act of\n1948.\nNobel, Milton. The Municipal Broadcasting System: its History. Organization,\nand Activities. New York, City College, 1953. (M.A. thesis).\nDevelopment of one of the two municipally owned broadcasting systems\nin the United States, from its organization in 1922 to date.\nShayon, Robert Lewis. ’’The Center for Mass Communication.” Saturday Review\n36:12, March 21, 1953• P* 30.\nDiscussion of the radio and TV programs put out by Columbia University's\nCenter for Mass Communication.\nSiepmann, Charles. Television and Education in the United States. Paris,\nUNESCO, 1953.\nAttempt to describe and assess what has been accomplished by educational\ntelevision in the U.S. Gives program experiments, data on personnel and\ncosts involved, and on training and programming problems.\n**»«*-*«***\nNEW COPYRIGHT SOCIETY TO SIFT LEGAL PROBLEMS IN RADIO. TELE. VIDPIX\nIn'an attempt to map a path through the legal brambles that have sprung up\naround TV, radio and telefilm, papers will be filed this week for a new corpor¬\nation called the Copyright Society of the U.S.A., to be headquartered in the\nnew Law Center of New York University.\nA main object of the society will be to take over the bi-monthly publication\nof the Experimental Bibliographical Bulletin, a magazine which has been issued\nsporadically by the Copyright Office of the Library of Congress. At a sub¬\nscription cost of $L0, the publication would record all the latest legal de¬\ncisions and legislation in the U.S. and around the world, dealing with TV,\nradio and allied show biz copyright fields.\n(Variety, April 22, 1953)"
}