{
  "id": "d1811-1",
  "text": "- 2 -\nOne of the services which finds itself urgently in need of additional\nfrequencies is Non-Commercial Educational FM (frequency modulation)\nBroadcasting. While only four city school systems and two universities\nhad established FM broadcast stations before the war, information\nreceived by the Radio Service of the U.S. Office of Education indicates\nthat several hundred school systems, colleges end universities, and state\ndepartments of education expect to construct educational FM broadcast\nstations, and that, in 31 different states, plans are being made,\nalready, to provide educational FM program service to every school and\nschool home, by coordinating the services of proposed state-owned stations\nand of stations that are being planned by individual school systems,\ncolleges, and universities.\nIt is evident, then, that the five channels of the 42-to-43 megacycle\nband that was allocated, four years ago, for non-commercial educational\nbroadcasting will not be enough to mdet the demand that is to be antici¬\npated within the next few years. From an analysis of educational FM\nplanning activity in three heavily-populated regions, which was made by\nthis Office about ten months ago, Commissioner Studebaker estimates that\na band of 13 consecutive 200-kilocycle FM channels will be required in\norder to meet the needs already in sight, end that, even with 15 channels,\njudicious planning will be needed in order to fit enough stations into\nany given region embracing several adjoining states to insure program\nservice to every school and school homel\nIn a letter, last January 1, to FCC Chairman, James Lawrence Fly,\nCommissioner Studebaker made a formal request that (1)' 15 consecutive\nFM channels be allocated exclusively for non-commercial educational\nbroadcasting, (2) that each of these channels be 200 kilocycles in\nwidth (the width required for the use of the Armstrong Wide-Swing System\nof Frequency Modulation currently used by the FM stations already in\noperation), *and (3) that this band of 15 consecutive channels be assigned\nimmediately adjacent to and continuous with the commercial FM band, so\nthat school homes equipped with standard commercial AM-FM receiving-sets\nwill be able to receive the school-station broadcasts. (He also requested\nthat education be guaranteed access to whatever relay-transmission fre¬\nquencies might be required for the linking of educational FM stations, and\nfor access to television channels, if and when education might ever find it\neconomically possible to do this type of broadcasting.)\nPresent indications are that we are likely to be challenged, at the\nhearings, on all three cf these major requests. Hence, the primary emphasis\nof our testimony should probably be directed toward these three points.\nFirst, in order to justify our claim that education must have a minimum\nof 15 consecutive channels, we must be able to show that a substantial\nnumber of schools, colleges and universities, and state departments of\neducation ACTUALLY INTEND to establish educational FM stations as soon\nafter the war as possible. It would probably strengthen our case, also,\nto be able to show that a substantial number of professional educational\ngroups and organisations, not immediately concerned with constructing FM\nstations, ARE, nevertheless, genuinely interested in the creation of such\neducational program services, either from the standpoint of producing pro¬\ngrams for broadcast over proposed educational FM stations, or from the\nStandpoint of making sure that such program services are available for\nlocal use in schools or ay adult listeners."
}