{
  "id": "d1811-5",
  "text": "Office of Education witnesses will undertake to show the estimate of\n15 consecutive 200-kilocycle FM channels as the absolute, irreducible.\nminimum number of channels needed by public education was derived.\nUsing the Atlantid coastal region from Massachusetts to Virginia as\nillustrative of the situation that will be found in several of the more-\ndensiy populated regions, we can show tha.t a band of somewhere between\ntwenty end thirty channels would be required (in this particular region)\nif every' \"school system, college, end university that would like to have\nits own FM station wei'e to be licensed to construct onei We can shovtf,\nalso, that it will’be possible (by eliminating from con-sideration\nproposed school-owned stations which would duplicate the services of\nothers in the same respective areas, by planning stations to be programmed\nby two or more school systems wherever possible, and by spacing station\nlocations in such a way that the- boundaries o.f their service areas would\ntouch, but overlap as little as possible) to provide state-wide and\nregion-wide service within this same area with a minimum of 15 continuous\nchannels, BUT that complete coverage cannot be obtained with fewer than\nthis number.\nWitnesses appearing for the Ohio State Department of Education can show,\nfrom their state plan, that every single channel within a 15-channel v.\neducational FM band wnich can be assigned in that state without causing\ninter-station interference will be used. These witnesses can show, also,\nthat, ideally, the State of Ohio should have about three times the number\nof stations shown on their state plan, since many of the school systems and\ncolleges now planned to serve merely as program-producing centers for re-‘\ngional stations would be better served by having stations of their own.\n(Actually, the State of Clio might be able to have a few more than the IS\nstations it is now planning, but this would necessarily deprte substantial\nareas lying near the boundaries between it find the surrounding states of the\nopportunity to develop their own educational FM services.)\nWitnesses for the State of Michigan (State Department of Education and\nthe University of Michigan) can show that 15 consecutive channels is\nthe -very least they must have in order to provide for the four high-and\nmedium-power 1!network-service\" stations and the twenty or more fractional-\nkilowatt local school-system stations they are planning.\nWitnesses for the State of Connecticut can show that the four stations\nneeded there will require a total of four alternately-,spaced channels,\nwhich, considering the fact that the nin-betweenn channels could not be\nused in thaw State, would actually represent a band seven channels wide.\nHowever, Connecticut’s problem does not end there. .One medium-power\neducational FM station is being planned for the State of Rhode Island;\nthere is a reasonable certainty that at least two will eventually be con¬\nstructed in the State of Massachusetts, within interference distance of\nConnecticut stations; New York City already has one educational FM\nstation, and it is likely that there will soon be pressure for t,wo addi¬\ntional ones (Columbia University and New York University); Floral Park,\nLong Island already has an application on file with the FCg for a station^\nand another station is being planned for a location at the approximate\ncenter of Long Island; arid it is probable that still another New York\neducational FM station will be wanted, either at Pough-k‘eeps.ie, or on\nthe Palisades just west of that cityl It is fairly obvious, then,"
}