{
  "id": "d1811-7",
  "text": "- 8 -\nv.. of channels he believes education should be allocated. In some\ncases, it may be possible for witnesses to prepare exhibits to support\ntheir verbal presentations, or to present still other arpments than\nthose that have been suggested to show the need for additional FM channels.\n1 , , we need to show that the channels allocated for educational FM\nbroadcasting must be assigned immediately adjacent to and continuous with\nthe commercial FM band. Since this point has already been covered.in\nsome detail on Page 4 of this memorandum, there is no need for additional\nelaboration as to the kind of testimony wre will need to present.\nWitnesses for State Departments of Education and for colleges.and uni¬\nversities would do well to emphasize their interests in producing pro¬\ngrams intended for out-of-school listeners. It would be well for them,\nalso, to submit, as exhibits, samples of proposed program schedules, or\ndescriptive outlines of some of their proposed program series and program\nservices.\nWitnesses for professionsl educational organizations should be in a pos¬\ntion to explain types of program services for out-of-school listeners\nwhich would be desirable, and to emphasize the importance of having\nthe educational channels located adjacent to the commercial FM band, in\norder to make sure that these broadcasts could be received on standard *\nhome AM-FM receiving-sets.\nWitnesses representing city school systems should be able to explain, in\nsome detail, the values of reaching school homes with school broadcasts,\nadult-education broadcasts, and school public-relations broadcasts. It\nwould be well, also, for these witnesses to document their presentations\nliberally with actual illustrations from their past experiences, (certain\nmaterials of this kind might well be submitted in the form of exhibits.)\nIn addition, it would probably be desirable for all of the educational\n-witness to affirm their belief in the importance of program services for\nout-of-school listeners, of the types listed on Page 4*\nFourth, we need to show that educators are substantially agreed that, in\norder to be maximally effective educationally, school FM broadcasting must\nbe able to transmit the widest possible range of audible frequencies and\nthe widest practicable range of intensity, with the minimum obtainable\namount of distortion, AND that it must offer the same freedom from static\nand other background noises as our present system of FM transmission offers.\nfn other words, we need to make it clear that educators are generally\nCognisant of the superior service which FM brings to the listener —\nthat we honestly believe this superior performance offers important\neducational values — and that we don't want any technical changes to be\nmade in the present system of frequency-modulation transmission which\nwould, in any way, impair either its tone quality or its noise-elimination\ncharacteristics!) (What we specifically and emphatically DO NOT WANT TO Dq\nis to permit ourselves to be maneuvered into the position of having to o\ndefend the existing 200-kilocycle channel width on an engineering basis!)"
}