{
  "id": "d1811-8",
  "text": "- 9 -\nOnce we have established our position, as stated above, THEN, we shall\nhave some of the frequency-modulation engineering specialists recalled to\nthe stand for cross-examination, and LET THEM establish the fact.that, in\norder to meet the conditions of tone fidelity and noise-elimination we\nhave specified, a channel—width of 200 kilocycles is essential.\nAs to the types of evidence we might employ to substantiate our position\non this 'point, we shall probably have to depend mainly on the type of\npro.ff characterized, on Page 5> ns ’’considered opinions of accredited\nspokesmen for recognized groups, etc.” Actually, there is a small.amount\nof experimental evidence to support the hypothesis that the educational\neffectiveness of radio-listening DOES increase, proportionately, as the\ntone quality of the radio-reproduced (or phonographically-reproduced)\nprogram approaches the tonal accuracy which would be heard at the actual\npoint of program origin. (This will be mentioned in the Office of Educa¬\ntion testimony.) In addition, some of the experimental.studies reported\nby Cantril and Allport comparing the effectiveness of different types of\npresentation present conclusions that admit of interpretations that\nmight be used to support our position. Some of the educational witnesses\nmay know of still other evidence of an objective nature that could be used\nalso. It will probably be advisable for each of us to cover this point,\neven though our evidence is only \"considered opinion\", since, after all,\nopinions do seem to add upI\nEXHIBITS AND DOCUMENTARY MATERIALS:\nCertain types of exhibits have already been suggested in the preceding\nsection of this memorandum. Other types will, no doubt, occur to each of\nthe individual witnesses.\nIt goes without saying that State Department of Education witnesses\nshould file photostat copies of any state maps they have showing station\nlocations, station spacing, suggested frequency assignments, and the like.\nIn addition, these witnesses would do well to bring with them the original\nmaps or charts from which the photostat copies were made, and to use these\noriginal copies, at the time of their appearance, for purposes of refer¬\nence. Other State Department of Education exhibits might include such ,\nmaterials as (1) sample schedules of programs showing the types of program\nservice that are intended, (2) tabulations showing the extent to which\nradio is already used, (3) listings of programs that have already been\nproduced by schools and colleges, either over school-or state-owned stations\nor over commercial stations. (4) graphs, spotmaps, tabulations, etc.,\nshowing distributions of local interest in developing educational FM\nprogram service, local interest in the use of radio programs of various\ntypes, or percentage of station time to be allocated to educational pro¬\ngram services of different types.\nWitnesses representing existing school system, college, of State Depart¬\nment of Education stations (either AM or FM stations) can, of course,\nsubmit copies of past program schedules, descriptions of program content\nand emphasis, explanations of the educational purposes of these programs,\ntogether with spot—maps, graphs, charts, or tabulations showing such facts\nas extent of program use, effectiveness of programs in accomplishing\ntheir intended purposes, specific listening audiences served, and the\nlike."
}