{
  "id": "d1658-2",
  "text": "In its June, 1945 allocations, the Federal Communications Commission set\naside 20 channels for non-commercial education FM broadcasting and has con¬\nsistently refrained from licensing commercial stations in these channels.\nState educational networks offer an effective means of carrying educational\nprograms to schools and communities throughout the states. Such educational\nnetworks would supplement the work of the individual educational stations by\nmaking it possible for these stations to exchange information and programs and\nthus fill out a well-rounded schedule of programs throughout the maximum hours\nof the day. Such educational networks would not only offer a way for the\neducational broadcasting stations to supplement the programs of each other,and\nthereby provide a statewide coverage for many excellent programs which could\nbe heard in schools not equipped with their own educational broadcast stations\nor facilities.\nAccordingly, we have encouraged, through our own efforts and through\ncooperation witn the Departments of Education and others, the setting up of\nsuch educational networks. It has never occurred to us .that educational\nstations could be, in any way, a threat to commercial broadcasting. In fact,\nit is my personal opinion that educational broadcasting stations would be a\ntremendous impetus to broadcasting generally and would encourage and assist\ncommercial stations through developing listening habits and greater audiences.\nTo my way of thinking, the opposition indicated to the California\nEducational Network by current stories in the press, is exceedingly ill-advised\nand short-sighted. I sincerely hope that these articles do not represent\neither the attitude of the California commercial broadcasters or of the\ncommercial broadcasters generally.\nI appreciate your calling this matter to our attention.\nSincerely yours,\nPaul A. Walker\nCommissioner\nJETT CONCURS\nCommissioner E. K. Jett comments on Commissioner Walker's letter and says,\n\"I concur with his views\".\nAER TAKES STAND\nIn the March 1947 issue of the AER Journal the lead article entitled, \"Is This\nCooperation, Hr. Broadcaster?\" by Editor Tracy F. Tyler, is devoted to the situation-\nquoting from it:\n\"It is hard to believe that any member of the commercial radio\nindustry would have any other feelings than those of gratitude to find\neducators, showing such a deep interest in radio and its non-commercial,\neducational, and public service possibilities. Especially should they\nwelcome the entrance into the radio field of the public educational\nauthorities. Yet BROADCASTING February 3 (page 6l), reports that\nNorthern and Southern California Broadcasters Associations are opposing\nthe entrance of California into FM. The reason for this reported\nopposition, according to BROADCASTING, is because broadcasters are\n'conscious of this threat to freedom of expression as well as implied\ncompetition,'\n\"Surely commercial broadcasting in California is not in such a\nprecarious position as to cause any of its members to fear networks\noperated by the public educational authorities. (Can it be that\neducation is a threat to business? When have educators been.convicted\nof suppressing free speech?)"
}