{
  "id": "d1658-3",
  "text": "-4-\nYet such opposition can lead only to the conclusion that California\nbroadcasters are suffering from fear-have developed feelings of\ninsecurity, of inadequacy.\n\"In any event, it is to be hoped that the officers of the\nNational Association of Broadcasters will take cognizance of this\nunfortunate move on the part of the California radio industry.\nAn NAB investigation should result in an official statement\nimmediately in full support of California’s proposed state\neducational FM project. Only in that way can the NAB convince\nAmerican educators of commercial radio’s sincerity in its pro¬\nfessions of friendliness.\n\"Is there an ulterior motive behind this commercial opposition?\nCould it be the hope that if states are prevented from establishing\neducational FM stations, the twenty channels would be thrown open\nto commercial exploitation? Perhaps an FCC investigation might\nbring to light some interesting data. It is conceivable that, if\nthe facts warranted, a public statement of the findings might be\nreleased widely for public comsumption. The least that could be\ndone by the FCC would be to issue an official statement deploring\nthe irresponsible attitudes which the article in BROADCASTING\nreports, and to make sure that this statement received wide\npublicity.\" -Tracy F. Tyler, Editor.\nThis will bear watching. Members are urged to make known any information they\nmay obtain which has a bearing on the matter.\nNEUTRAL. SAY BROADCASTERS\nIn a wire to NAEB, Hale Sparks, Director of Radio at the University of\nCalifornia, says (Feb.24): \"OFFICIALS BOTH NORTHERN AND SOUTHERN DISTRICTS NAB\nINSIST THEIR POSITION NEUTRAL. PROSPECTS FOR FM BILL HARD TO ESTIMATE NOW-- »\nThe apparent anonymity of the news releases is confusing to Sparks, who\nfollows his wire with a letter saying, \"-I was trying to run down the source of\nthe blasts in both Variety and Broadcasting, but got nowhere*-It was like shadow-\nboxing-.\"\nSomeone may have spoken out of turn. At best, this provides an excellent\nopportunity for those broadcasters to demonstrate in a practical way whether public\ninterest or private advantage dictates their actions.\nHITS AND MISSES\nHEADLINE OF THE WEEK\n\"Soap Operas Fare Poorly in Butte, Des Moines Surveys\"-Variety, Feb.22, 1947.\nConfession is good for the soul'.\n\"It’s (radio's) prime ingredients should be intelligence and respect. There is\nstill considerable room in radio for both elements\". —\n.The Saturday Review of Literature\nCommenting on the storm of protests on the Blue Book by certain broadcasters,\nFM BUSINESS (February,1947) says, \"Significantly, however, no broadcaster has\nchallenged the Commission’s right to look into program structure\".\nA bill introduced in Congress by Representative Hoffman(R. Michigan) would make\nit a criminal offense to interfere with the production or transmission of broadcasts.\nFines and imprisonment are specified for violations interfering With \"the freedom\nof speech and a free press\". Where does interference begin?--*-with the writer,\nsponsor, director?"
}