{
  "id": "d703-125",
  "text": "DAVI-ASCD (Association for Supervision and Curriculum Development)\nPaul Witt, Chairman\nAppointed January 1957 (ad hoc)\nThis joint committee was appointed to explore with the representatives of the\nAssociation for Supervision and Curriculum Development the possibility of\ncollaborative action by the two groups®\nDAVI-ACRL-AASL (Association of College and Reference Librarians - American Associa-\n* tion of School Librarians)\nExpires 1957\nThis joint committee (7 DAVI and 7 library) was appointed in 1956 and has held\nthree meetings. The purpose of the joint committee has been to (1) explore ways\nand means whereby the three organizations through their professional membership\nand professional activities might make a more effective contribution to the im¬\nprovement of instruction; (2) to consider the areas where the professional services\nof the organizations overlapped, duplicated, or were in conflict and to explore\nways and means whereby these might be lessened; and (3) as a result of this study\nand exploration to make recommendations back to the respective governing bodies.\nThe Committee is continuing its work examining the present programs of the organi¬\nzations in terms of the needs of teachers.\nPublic Relations Brochures - DAVI-AV Commission on Public Information - NSPRA\n(National School Public Relations Association)\nAppointed January 1957 (ad hoc)\nChairman to be elected by committee\nThis committee was appointed to develop a series of brochures on public relations\ntechniques and methods for the audio-visual director.\nRadio and Recordings Committee (DAVI—AERT) Association for Education by Radio—TV\nRalph Hall, Chairman\nExpires at the 1957 DAVI Convention\nPublished a 1957 Catalog which includes all tapes in the National Repository® This\nCatalog contains information on 86 series composed of 1059 individual programs..\nOver 12,000 tape recorded programs have been dubbed to fill requests since the\nRepository started in December, 195h« Details being developed for a better system\nof evaluation for tape recordings accepted for the Repository.\nSchool Facilities Council\nDAVI called a meeting in Chicago, on July 1, 1955* on.the problems of school building\nconstruction. This meeting was attended by over 100 invited architects, educators\nand industrial representatives. The group voted to organize. The period irom Jul^ 1,\n1955 to February i6, 1957 was one for organization and program development.^ During\nthis period the SFC oromoted joint conferences of architects and educators in.some\n11 states and issued*some brochures. A constitution was developed and accepted and\nput into operation in December 1956® At the annual meeting of the membership on\nSunday, February 16, 1957* the following officers were‘elected: President, Paul.\nMisner, First Vice President, Zephryin Marsh, Second Vice President, Gates Beckwith,\nChairmen of Standing Committees; Finance, Charles Stock, Program, A. J. Foy. Cross,\nMembership, William Widerman. Many members of DAVI are also on the newly elected\nBoard of Directors. These meetings have been highly successful in developing better\nunderstanding and promoting a wider development of buildings equipped for more effective\ninstructional uses® Membership is open. Dues are $5*00."
}