{
  "id": "d703-13",
  "text": "Audio\nM. McCabe Day\nDIRECTOR\nTELEPHONE; 1006\nIfie. ^l/oias. of the. <sSell ooti of cHuntincjton\nNaeb HefeSJ\nm 5 1956\n„\nSCHOOL CITY OF HUNTINGTON\nHUNTINGTON. INDIANA\n« M\n?/?/#/;\nMarch 3, 1956\nOFFICE: ROOM 220\nSTUDIOS: ROOMS 213, 2I;5. 217\nHUNTINGTON HIGH SCHOOL\nDr. h* J. Skornia, Ex. Dir. NAEB\nlU Gregory Hall\nUrbana, Illinois\nDear Harry:\nYou may be aware that there is a dispute within DAVI of NEA concerning the\norganizational scope to be followed and comparative emphasis to be given to\naudio-visual materials, as indicated by the name of its new publication,\nInstructional Materials. Recently I heard that NAEB has been approached to\nconsider affiliation with, or at least to lend its support to, DAVI, and it\nwas reported to me that NAEB has been holding for this change in DAVI to\ninclude all areas of instructional materials, and to include many groups of\neducational workers, including librarians. For one, I am disturbed to hear\nthis.\nIf I can analyze the situation correctly, and put together my experience as\na member of both DAVI and NAEB, I am inclined to think that this attitude, if\nit is the attitude of NAEB leadership, comes from the experiences on some\nuniversity campuses *diere there has been little cooperation between the radio\nand the audio-visual departments. There may be a fear in the minds of some\nNAEB leaders that joining DAVI might tend to place them UNDER audio-visual\nleadership, while a broadi inclusion of many instructional materials groups\nwould tend to reduce the audio-visual leadership and place all on a common\nbasis. I can understand how this feeling may arise among some university\nbroadcasters.\nHowever, some of us in the field of public instruntion believe that audio-\nvisual needs individual emphasis, apart from some other instructional mater¬\nials, if for no other reason than that experience seems to indicate that\n'‘‘\"audio-visual utilization has largely been developed by those who were not\nlimited in their thinking to the traditional instructional materials. For\ninstance, the most extensive utilization of radio series in any of the public\nschool radio stations in Indiana has come in New Albany and Huntington where\nradio has been accepted as a part of audio-visual and has been promoted by the\naudio-visual center. The stations that are failing to serve the classrooms,\nand therefore are having a more difficult time adjusting themselves and jus¬\ntifying themselves, are those without this strong audio-visual approach. An\nexception may be made of Gary, where the station is a part of the audio-visual\ndepartment, but the misfortune was that it began largely as an individual\nschool station and the Gary plan has tended to centralize grade schools around\ntheir associated high school. Furthermore, 10 watts was not enough power\nfor Gary.\nMEMBER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS (NAEB)\nEDUCATIONAL FILM LIBRARY ASSOCIATION ( E F L A )"
}