{
  "id": "d703-14",
  "text": "Dr* j. Skornia\nPage 2\nThe thing I am trying to point out is that DAVI mar emascnlfite its position\nof leadership in AV by tlying to take ^ so .many areas, largely for the pur¬\npose of increasing revenue through more memberships. Actually, I would say\nthat DAVI has little to offer NAEB. Of the two, I have been much more im¬\npressed by NAEB. DAVI has had quite ineffective leadership much of its\nhistory, since it was mainly a stepping stone for someone out of a good job\nand looking for a good job. It has served several of its executive secretaries\nwell in this respect. Its lack of membership has probably been due to lack\nof program or service. It has still not found any particularly effective means\nof serving the AV field, although it has made greater attempts in recent years.\nJet the group within DAVI that is trying to make this \"broad\" approach to\ninstructional materials is also the group that was responsible for trying to\nminimize the importance of educational television under the argument that there\nwere still not enough projectors in schools, so audio-visual people should not\nthink of radio or television until schools had enough motion picture utiliza¬\ntion. Now, however, the pressure to increase the membership of DAVI has sug¬\ngested the inclusion of as many groups as possible.\nMany of us in the audio-visual field also know the efforts being made by\nschool library leadership to \"take over\" the audio-visual field by this device\nof \"instructional materials center,\" with the certification requirement that\na person trained in library science shall be in charge. That has been done\nin some places, and we in Indiana have tried to meet such an attempt in this\nstate by setting up an audio-visual certificate. The problem is still not\nsettled, however.\nThe audio-visual people have been \"deaf\" in the past to the value of radio®\nNot until the advent of television could some of them \"see\" the place of\nbroadcasting in instruction. Similarly, many radio people thought of broad¬\ncasting merely as a means of cultural service to their university community\nand as a laboratory for the training of persons in the vadio department. The\naudio-visual people, who had ignored radio, thought they would assume control\nof television because the medium used projectors. The radio people, because\nthey had had long experience in broadcasting, assumed they would continue with\ntelevision, and in the main they were correct and it has turned out that way.\nBut this, too, has sometimes led to apprehension on the part of the foimer\nradio people concerning what audio-visual might tiy to do. On the university\nlevel, this is an important matter, involving prestige, position, and salary.\nOn our public school level, many of us have sensed that the important thing\nis to consider broadcasting as essentially a teaching tool, the same as we do\nprojected material.\nPerhaps it is difficult for you to understand just exactly how some of us feel\nin this matter. The new Audio-Visual handbook, just distributed by our state\ndepartment, has more emphasis upon broadcasting than I think you will find in\nany other such publication, or any publication by any other group interested\nin other instructional materials. That is due to the influence of McXown and\nme, since our use of broadcast material in our schools could not be ignored,\neven by those not yet committed to such use."
}