{
  "id": "d1718-1",
  "text": "A very comprehensive radio survey made among educational institutions\nfor the National Committee on Education by Radio, under the direction of the\nCommittee’s research diroctor. Dr. Tracy Tyler, has been put into manuscript\nform. The manuscript was gone over by a committee of the Association of Land\nGrant College sand Universities which met in Washington on November 16, and a\nsimilar group representing the National Association of State Universities,\nwhich likewise met in Washington on November 18. These committees have ap¬\nproved the manuscript and have expressed a desire to see the survey printed.\nAt a meeting of the National Committee held in 'Washington on November\n18, unanimous approval of -the survey was made and the chairman was authorized\nto proceed with the printing. Dr. William John Cooper, Commissioner of Edu¬\ncation, has been asked to prepare the preface to the report.\nAlmost any question one would care to ask about educational broadcasting can\nbe answered as a result of the survey and it will go down as a very important\nhistorical document in this field. It is evident from a perusal of the report\nthat out of it will grow the need of further studies along several lines. This\nwill be brought up at a future meeting of the National Committee,\nThe National Committee on Education by Radio adopted the following reso¬\nlution at its November mooting, which facts were givon to the press the fol¬\nlowing day*\n(1) In view of the reports recently submitted to Congress in response to\nSenate Resolution 129, calling for information regarding certain aspects of\nthe radio question,\n(2) In viow of the facts just presented in the report of the survey of radio\nin land-grant colleges and state universities^,\n(3) In view of the discussions attending the re-organization of radio broad¬\ncasting effected in Canada, in 1932, and\n(4) In view of questions raised at the International Radio-telegraph Conference\nat Madrid,\nRESOLVED, that the National Committee on Education by Radio urge upon °ongross\nthe need of a general investigation at this time of the whole subject of radio\nbroadcasting by a committee of Congress created for \"that purpose.\n* * # *\nArmstrong Perry, Manager of the Service Bureau of the National Committee,\nhas been at the Madrid Conference since it opened and is sailing for the United\nStates, together with Judge Sykes of the Radio Commission, and others of the\ndelegation, on November 30, Much of the information gathered during the con¬\nference is not for public consumption, but undoubtedly a comprehensive report\nwill bo forthcoming in the near future and will be placed in the hands of our\nAssociation,\n* * * *\nThe National Association of College Broadcasters has been asked to do a\nvery important piece of work by tho NCER, the matter of which is confidential\nat the present time. The ^resident of -the Association has takon the matter up\nwith the other officers and the whole work will, of course, be made public after\nit has been completed."
}