{
  "id": "d950-104",
  "text": "(2)\nI mist say that Hall won ry respect at this nesting. Thor© were pressures\nfrom iaanar there to w this program far a®y from research, lie resisted\nthose admirably. As a matter of fact# I bol±©v© that he would like to make\ntills core research oriented than the bill will really allow Mr to do.\nikiyray, tills is a thing to keep in mind in the UAEB dealings with him.\nThis moating presented many opportunities for ps cho-annlysie of interesting\nreactions * l iich dsfensiveneos —— ©specially on the part of John Scanlon of\nthe tm -— and «?© of the people representing teaehorfs colleges# Hie\nDA.VX people wore not completely happy either. bish yon could ham witnessed\nall of tide — interesting spectacle of each of the bested interests vising\nto make it easier to get their hands on this money — but none wanting to\nseen too overt about it* Scanlon eonstoatly wanted to remind erntyono that\nthe rm has already gotten most of the tnemrs. I thought that Kan Harwood\nacquittal the IU$& quite well with ids report — in spite of the loos\nof j&yeteiX might — he threw i#mt he hod around quite well and did a good\njob. Our jCHend X’oefcey was one of the mm influential people at this\nmeeting. Behan of Perm II. probably ran him a close second.\nSo wadh for the gossip# newr on to acre business. Hi® Dept of Bd is supposed\nto sond you a batch of tho lotto' inviting research requests whieh you\ncai forward on to all H4B3 morijoro. They prcb^bly will not ©Ml you enough\nbut you ham their pomission to delicate it 1f neeesemy* (I assume Uxat\nyou already haem on© copy.)\nThera wore a nuabor of cnaggestione for pmssll which, were n--.de at\nthe v meeting. I SOI would not octsali himself moh but I believe that the\nfoU^ing poijntoi are considered Jhfwtant by hist\n1*. The research proposal ahoaM be aimed at anspmsring a sigirliicant\neducational problem — it sltould deal with eentraX odadltibnaT ;\n.natters.\n2. Research should promise a conceptual leap in how students loam.\n(There ms constant talk of a fW©^te-4duPou^ ? in our knoSBedge.\nAgain# 1 tlank this is Important for future dealing© with Congress.)\n3. Ideally# research projects should grow out of something which theec\nproposing it are already doing.\nli. m the research proposal#. It is important to stor that it is a\ncooperative off©rt of Tocision maker© and vesearchere — rather tlian\nsis-ply one or tho other- decision makers who should know their\ngoals* and problems# researchers who can do a good job of testing\nMother the goals fir© achieved.\n5* 3h the proposal# b© sure to include a rational© for wly It Is important\nto research the particular prbblan proposed*\nI realise that all of these do not pertain to th© etox&es Hall suggested\nfor the KA31B# but they dhould bo kept in tdxtd*\nBy the may# 1 m& enclosing the vouchors. 1 took ®y oarf I h op© that that is\nall right* ' % doing this# anti adding % mDes of driving# I avoided iaeqlni^its*\nhotel MIX# I slept in Baltimore T&th sobs© frixsnds. Dmn without th© ;\nsavings on hotel bill# this && only &Li|$it2y more than plane far© would ham\n\\mm, to esy no-thing of cabs to and from airports* or lirwuaines. A njr-oy#\nanything which cm feel should not be allowed# just strike off the voucher*\nt h d planned to pay for the trip# as you know# so it was groat news to\nfind that tine IIAE8 tod willing 'to pay for ©van part of it.\nI think that* s about it. If there is other tfifanoatl on whicli you want#\nplease let me know. How what???\nBest\nSamel L. Booker"
}