{
  "id": "d950-11",
  "text": "MICHIGAN STATE UNIVERSITY\nOF AGRICULTURE AND APPLIED SCIENCE • EAST LANSING\nTELEVISION STATION • WKAR-TV\nJuly 10, 1958\nMr. Sam Becker\nDirector of Radio-Television Instruction\nState University of Iov/a\nIowa City, Iowa\nDear Sam:\nI have carefully re-read the NAEB announcement of Grant s-in-Aid, and have\nalso read your memorandum. While I agree with Harwood that we need higher\nquality rather than more research, the statement of the purpose of the\nGrant s-in-Aid makes it clear we are after quality. Tannebaum*s comment\nregarding making research funds available for any worthwhile project does\nnot seem practical vdthin a \"trade association\" framework such as ours.\nI think we would not spend our money properly unless the subject of the\nresearch was limited to educational broadcasting.\nAs to the Columbus meeting we had David A. Traylor, Account Executive,\nA. C. Nielsen Company, discuss \"Status of Commercial Broadcast Research\nToday\". Kumata discussed \"The BAEB Seminar on Educational Broadcast\nResearch\". Si Yassin, Research Sociologist, Audience Research Division,\nCanadian Broadcasting Corporation, discussed \"Using Survey Techniques to\nStudy Effects of CBC Informational Broadcasting\". I gave a research paper\non one of our recent projects. Traylor, Kumata, and Yassin gave excellent\npresentations which are available on tape recording. I was personally\nvery disappointed in the size of the audience which did not run much beyond\ntwenty-five, and I do not see how we can bring people all the way from\nCanada to talk to that number of listeners. I think it is significant\nthat no ETV station manager attended the session. I think this fact has\nreal implication for our move to get a director of research for the NAEB.\nAs a matter of fact, I do not recall having seen a station manager at the\nresearch session in the past several years. We may have considerable\ntrouble getting board approval for such a position. That is my first\nreaction. Also, the education job of the research director, if we get him,\nmay well be his most important activity. This is my second reaction.\nAnd now congratulations on receiving a grant for post-doctoral study in\nNew York. You are the kind of live wire individual v/ho will really make\nthe most of this opportunity. Again, my congratulations."
}