{
  "id": "d950-16",
  "text": "June 20, 1958\nProf. Percy Tannenbaum\nInstitute of Communications Research\nUniversity of Illinois\nUrbana, Illinois\nDear Percy:\nCertainly appreciate your detailed letter of May 8th.\nIn spite of myself, I find 1 must agree with most of your\npoints. 1 am afraid that my trouble is that I am more of an\nauthoritarian type than you are. I realize that this is a\nweakness, but what are you going to do??? I agree with your\npoint, in general, that scholarship and good research flourish\nin a free atmosphere. However, 1 become so discouraged at the\nwaste of time and money by so many \"researchers\" in broadcast*\ning who don't know what in the devil they are doing. It is a\nterrible temptation to say \"Damn it, do this.\" As I said, though,\nI realize this grows out of a lack of patience, etc. The solu¬\ntion to this, 1 think, is to see that our announcement gets into\nthe hands of good people. I think we need to support more re¬\nsearch in basic processes. I feel that we tend to waste a lot\nof time often studying, for example, the effects of some medium\nor stimulus on learning or attitude change* What we need to\nstudy at this time is rather the process of learning or the pro¬\ncess of attitude formation and change. The media and stimuli\nwill come into it — but we are starting at the wrong end when\nwe start with them.\nI also agree with you on the Columbus report. This, I am\nafraid, is what comes of writing by committee. Things get\nwatered down too much and all the solid substance becomes lost.\nFor next year I have a Mass Communications (whatever that\nmeans) grant from the Fund for Adult Education. I will be\ndoing some post-doctoral work at Columbia University with Paul\nLazarsfeld (if he hangs around there long enough at a stretch)\nand 1 will be working on some of the research projects at the\nBureau of Applied Social Research. Hope to get some background\nto Improve my own research and my teaching and direction of re¬\nsearch."
}