{
  "id": "d950-3",
  "text": "Prof. S. L. Becker\n-2-\nMay 8, 195>8\nsoon—I still don't know what our function is, but if my guess is half-way\ncorrect, we will accomplish next to nothing unless we get the ball rolling\nreal soon. For the most part, research in radio and TV has followed rather\nthan led; it has been a posteri rather than a priori. Maybe we can do\nsomething about changing this state of affairs, since it does seem to be a\ncase of cart-before-the-horse, and all that jazz.\nAbout some of your other comments: I don't think we should go into the\npublishing business. The need now is for good research and not so much the\ndissemination of not-so-good completed research. Similarly, I regard our\nresponsibility more along the lines of initiating or stimulating research\nrather than teaching station managers how to use it. If they ask for it,\nOK, but let us not try to push it on them. And even if they ask, I am not\nso sure we know what to tell them at this stage.\nAgain, on Ray Cheydleur's remarks, my feeling is that we should neither\nfavor applied or basic research, or anything else. It would be false and\npresumptuous for us to do so, I think. However, if we do have to make a choice,\nI obviously lean more toward the basic, not only because I do this kind myself\nbut also because we have ample evidence that the applied without the basic is\nlike building a bridge without any knowledge of structural factors, etc.\nRe *Irv's suggestion to the Census Bureau, fine and dandy—every little\nbit helps certainly. However, if I had a choice of ti-jo questions to add to\nthe already overlong census forms, I personally would not put in these two—\nwe already know quite a bit about set ownership and their correlates (the\nfact that Qk% of the population has a TV set today brings us to the near\nsaturation point, and who cares about the others); I would like to know more\nabout the people than their demographic characteristics. However, this is\nobviously a personal bias of mine, so make of it what you will.\nThat's my contribution—lengthy perhaps, but probably amounting to next\nto nothing. I may be off-base on all this, but I am still in the dark\nregarding the function of the NAEB researcn committee. Perhaps you can\nenlighten me when you have the chance.\nSorry to sound off so hard and long, but you asked for it, remember.\nAnd while I am in this mood, let me add my keen disappointment at the contents\nof the report of our NAEB research meeting in Columbus. I thought we did\ncontribute a little more in the way of specific suggestions and creative ideas\nthan the report reflected. As it is, it reads, to me at least, like a primer\nfor any introductory course in research methods. I don't see it much as a\nstimulus for new research, which I thought was the aim.\nGlad to hear you people are using the SD in some of your work. If\npossible, please keep me in touch with further developments on this—what\nkinds of problems, how used, etc. We do like to keep on top of such develop¬\nments and applications."
}