{
  "id": "d950-58",
  "text": "(U - Telep hone Coincidental Study)\nIf possible* private lines should be secured from which interviewers\ncan make their calls. Most stations have two or three lines which can be\nused for this purpose. Often* when students are used as interviewers* some\nwill have private phones available for their use. If the calling is to be\ndone in the evening or on weekends, permission can often be obtained to\nuse office phones in some of the local business establishments which are\nclosed during these periods.\nInterviewers^ should be instructed to have an eraser and three or four\nsharpened pencils handy so that time will not be wasted sharpening pencils\nor looking for another pencil. Mach should have a watch carefully set to\nthe correct time so that he will not be making calls during program changes\nand so that he makes his calls during the prosper periods. Interviewers\nshould be told to make themselves as comfortable as possible. It is even\na good idea for each to have a glass of water handy to quench a dry throat.\nThe more that one is able to foresee and .forestall’ any interruptions in\nthe calling process, the more calls you will have completed within your\nlimited time periods.\nTabulation and Analysis of Results\nAfter the data have been collected* the tabulation process begins.\nStart by stacking the check sheets into piles representing each of the\nsmallest time segments into which you plan to organise your data. These\nira.gnt be by hours of the lay or by segments of the day such as morning*\nafternoon* evening. In some cases* you might be interested only in the\naudience for one program, and, so all of your calls’ were made during the\nperiod of this program. In this case, you will have only one pile, within\neach time segment* add the checks in the TV columns* the radio columns* aid\nthe none columns. Add the no answer responses to the none column since it\nis a fairly safe assumption that there was no radio or television listening\nin that household since* nepne answered the telephone• The uBusy\" phones*\nthe discontinued service cases* and the respondents who refused to give any\ninformation should be deleted from the sample since it is difficult to infer\nlistening or viewing activities in these households. (The result of this\ntreatment is the same as dividing this group proportionately among the radio\nlisteners* television viewers* and non-listeners or viewers* through the\nsample base is not raised accordingl y)\nAn estimate of the percentage of homes in the community which are tuned\nto your station during each period can be obtained by talcing the number\nof homes in which someone has reported a set tuned to your station and\ndividing this by the total number of calls made during this period (after\nsubtracting from this total the calls which resulted in busy signals*\nrefusals* or notification that service has been discontinued). \"The\nresultant ratio should be multiplied by 100 to convert it to a percentage.\nSimilar estimates can be made for the other stations in your area* if you\nwish. For each period in which you..thus obtain an. estimate of your audience*\nyou should calculate the possible error jyr the a given earlier* using\nthe numbers above. Possible error *\nrtioo’\nThe p -within the\nsquare root sign is the percentage of homes which you found tuned to your\nstation during the particular period. * The N is the same figure used in ithe\ndenominator of the ratio by which you determined the percentage. The error\nterm should be added to and subtracted from the obtained percentage in order\niftK to show the range within which your !!true’* percentage of listeners\nprobably falls. To be more precise* the chances are 9lS out of 100 that the\npercentage of households in the community which were tuned to your station\nfell within this range."
}