{
  "id": "d950-61",
  "text": "Harry J. Skomia\nExecutive Director, NAEB\nIII. Gregory Hall\nUrbana, Illinois\nsMt+cf:\nIfy- secretary forwarded the copy of the letter which you\nsent to Keith Tyler. Yfell done!II I have been meaning\nto ask you for some time the proper path to pursue to\nfacilitate this business. Hope that the report will soon\nbe forthcoming.\nhe are now settled in NYC — a block from Columbia University.\nHave a wonderful view of the Hudson Diver from our sixth floor\napartment. Perhaps we will see you here one of these days?\nOur address is U64 Riverside Drive, Apartment 61, New York, 27>\nN.Y. I would speed matters up if mail concerning the research\ncommittee would be sent to me here. After Feburaiy 1, our address\nwill be on Morning side Drive-but I will write prior to that\ntime with the specific address.\nT he past summer at Iowa was certainly a hectic one — I have\nnot quite recovered yet. The last two wee1 s were completely\ndevoted to finishing the analysis and write-up of our research\nfor the Fund for the Advancement of Education. -Am still working\nwith some of the data which are concerned with some side issues\nwhich we investigated.\nYou might be interested in a special research meeting which the\nETRC held a few weeks ago in Chicago, if you have not already\nheard about it. I$r Crary called it — had Bruce Jestley from\nWisconsin, Merril from MLch State, Withy (spelling?) from the Survey\nResearch Center at Michigan, and myself. Some people from WTTW\nwere there on and off. The Center was simply seeking ideas and\nadvice on the research directions which it might pursue. It wants\nto provide more research service to its stations. I take it that\nthis is something for the future-as money is tight with the\nCenter this year. However, it is something which the NAEB should\nkeep in contact with and work cooperatively on, it seems to me.\nTheir concern is only with the television stations but most of the\nideas which we brought up apply equally well to the educational\nradio stations. The major problem the Center faces — as does the\nNAEB research committee, in ray opinion, - is the lack of interest\nor even antagonism to research on the part of management, that is to\nsay station managers and production people. This does not worry me\nexcept for the many kinds of studies in which the cooperation of\nstations is needed.\nHope that you received the suggested form for the grants-in-aid\nannouncement and that it was satisfactory. Hope also that we see\nyou in NYC one of these days.\nBest\nSam L. Becker"
}