{
  "id": "d950-7",
  "text": "Wc\\t Jjlorxfra jltatg pxxtoersxtg\nUNIVERSITY BROADCASTING SERVICES\nJune 25, 1958\nDr* Sam L. Becker, Chairman\nNAEB Research Committee\nDivision of Radio, Television, Film\nState University of Iowa\nIowa City, Iowa\nDear Sam:\nThe proposed announcement looks good!\nCould we have some sort of statement asking the institutions to show what\nthey are contributing to the project? —I don't say this should be on a\nmatching funds basis but I would like to see something contributed in the\nway of IBM cards, use of equipment, etc.\nWhere do we stand with the report from Ohio? Didn't Keith say that we could\nexpect the finish of the project long before this?\nSeems to me that if we're ever going to get out of the penny-grant business and\nreally get into some dollar-grants, this study better be finished in a hurry.\nThen, too, the Board isn't going to pay for a $12-$l5,000 Director until this\nhas been nailed down.\nI appreciate your offer to help me, Sam. Really, I'm glad to get out of here.\nI'm so sick of the dishonesty and the dirt that has piled up in the last three\nyears I'm mighty glad to leave the department. The school is okay, but that's\nabout all one can say. Almost everyone is looking for somewhere else to go.\nOur Music Director just accepted a position at Wayne University. Lee DrefUss\noffered him also twice as much as what he's being paid here.—I did Lee a favor\nby telling him about this good man, and ^they've got a bargain.\nBy the way, we also have an excellent fim man here wanting to leave as soon as\npossible. He's done about sixty films, several taking first prize. If you have a\nspot or know of anything, a reasonable offer would get him. I can put my personal\nstamp of approval on this man, however, the quality of his work speaks for itself.\nI take a vacation for a month, not having had one in two years, and after this\nweek you can reach me at l58i± Lee Avenue. In August I go to the new Manatee College\nbeing built by the State at Bradenton, and will head their Speech Dept. We hope\nto get into ETV there just as soon as the Florida TV Commission can push its\ndevelopment.\nThank goodness on my new job I won*t have to sneak around trying to get research\ndone or will try to hide what I've been doing with NAEB, as I have had to do here"
}