{
  "id": "d950-75",
  "text": "- 2 -\n*V\n^5\nKhoaer, Franklin He Professor of Speech and Chairman, Interdepartmental Committee\nm Communication, Ohio State University. Research and publications in\npsychology and Industrial assets of ccssniunicatlon. Resource Person.\nKunata, Hidoya. Associate Professor, Conmunications Research\" denier, College of\nCoBuxunication Arts, Michigan State Ttolversity. Research and publications\nin communication.\nLazarsfaid, Paul F. Chairman, Deparfcaont of Sociology, Coluribia University. Re¬\nsearch and publications in Ms!*! phenosmna indLudlng ccranunlcatiomu Resource\n«f Speech, Olio Stats ttetvewity. Research In\nKail, nU* Assceiate\nbroadcasting* Rssource Fsiw-\nKarqn*VC?**?9r\"- *SaSFWfOrM« OMMlopMii, Chicago Sdtcatlooal Telavision\nAssociation, Brooiteart production and promotion.\nMcL^ai, tofiall. Chairman, Culture aid Coammicationa Seminar, University of Toronto.\nMerrill, Irving R. Director, Television Research, Michigan State University. Re*\nsearch and publications in the mass media, NAEB Research Committee.\nMillard, William J., Jr. Director, Millard Research Associates, Pelhamlianor, N. T.\nResearch and publications in social phenomena including broadcasting. Resource\nPerson. \"\" —\nn Moore7^S5y. Department of Sociology, University of Texas.\nNeldt, Charles 0* Chairman, Department of Educational Psychology and Measurements,\ntfaiversity of Nebraska. Research Director, Nebraska In-School TeOLevisicn-\nCorrespcndence Study Program. Research and publications in education and\npsychology.\nNetjconfo, Theodore M. Chairman, Doctoral Program in Social Psychology, University of\nMichigan. Research and publications in social psychology. Resource Person,\nw^arssy, John. National Project in Agricultural Coraaunications, l53iiian’\"Slate University\nPeters, Frank R. Director, Measurements and Evaluation, University Counseling and\nTesting Center, Ohio State University. Research and evaluation of educational\nbehavior. Resource Person.\nRowland, Howard.\" Associate Professor of Sociology and Director WQED Audience Research\nProject, University of Pittsburgh. Social research.\nScanlon, John J. Deputy Director of Research, Fuad for the Advancement of Education.\nResource Person.\n^ ScodelV Alvin. Associate Professor of Psychology, Ohio State University. Resource Person\nfl^Seibsrt, Warren F. Television Programs Research Consultant, Purdue University.\n'Shepherd, John R. Assistant Professor of Speech, and Coordinator of IBaiversity of\nOregon Productions on Station K0AC-T7, University of Oregon. Television production,\nresearch and publications*\nShimberg, Benjamin. Assistant to the President, Educational Testing Service, Prlnca-\n/?/ ton, N. J. Educational research; evaluation of educational broadcasting.\nSiegel, Laurence. Assistant Director, Experimental Stu$y in Instructional Procedures,\nI Miami University, Oxford, Ohio. Research and evaluation.\nSkomia, Harry J. Executive Director, National Association of Educational Broadcasters ©\ni/Sloane, Frank. Director, Research and Information, Board of Public Instruction,\nDade Comty (Miami), Florida. Educational and administrative research.\ni^Smmra, Harrison B. Professor of Speech, Ohio State University. Research and publi¬\ncations on broadcast audiences. Resource Person.\nTaxmeribaura, Percy H« Assistant ProfessorjnSS^EuSe\"of Communications Research,\nUniversity of Illinois. Mass media research and publications.\nIfrler, I. Keith® Professor, Bureau of Educational Research and Service and Director,\nRadio and Television Education, Ohio State University. Research and publications\nIn mass media. Seminar Director."
}