{
  "id": "d950-92",
  "text": "-7-\nexperience as more economical or effective. (See Fact Sheet IV, 4, based on\nPhiladelphia Public Schools Annual Report of Television and Radio activities;\nand #11, 5, as attached.)\n\"We have also been interested in TV-Radio correlation possibilities (part\nof a course broadcast by TV; part by radio), as illustrated by the TV Program\nReport, No. 5 of January 1956, a copy of which is also attached. The above\nexamples will indicate the general interest of the NAEB in comparing the effective\nness of different media, rather than short-sightedly forcing any given media to\nperform functions for which they may be most inefficient.\nNAEB Research Seminar:\nUpon the urging of educators, research scholars, and broadcasters alike,\nthe NAEB held a National Educational Television and Radio Research Seminar at\nthe Ohio State University December 9-13, 1957. This meeting was attended by\nindividuals in charge of research at the educational TV and radio stations of\nthe U.S. More significantly, it was also attended by some twelve distinguished\nAmerican educators concerned with U.S. education broadly, rather than only with\nradio or TV as such, and by the best research scholars we could assemble for\nthis basic first such meeting.\nAt this seminar the NAEB*s responsibility for helping to meet the need for a\nresearch coordination center and clearing house not only for the U.S., but also\nto meet international needs, became inescapable. One of the resolutions drafted\nby this Seminar states:\n\"N&tionally, an appraisal of the impact of educational broadcasting\nand its role in the total educational picture awaits development of a\ncomprehensive, integrated, country-wide research program which can\nbe systematically implemented over a period of years. Locally, re¬\nsearch personnel connected with educational radio and television\nstations and production agencies face frustrating problems resulting\nrom significant and complex needs on the one hand, and inadequate\nfinancial and human resources on the other.\""
}