{
  "id": "d496-138",
  "text": "* 9 -\nrid itself of the present homey, casual, house-organ characteristics.\n35. Hull described the need for a publication which could be es¬\ntablished as the central source of all educational broadcasting acti¬\nvities, a top-flight vehicle possibly along TV Digest or Edgar Dale\nland-grant newsletter lines. It was recognised tnefc such a newsletter\ncalls for a top-flight editor.\n36. The Board discussed possible space in KETA for a national pub¬\nlicity office, the need for a national address and telephone, the need\nto dramatise the movement for the public, the need for HAEB public re¬\nlations and promotion, and HAEB obligation to assume this responsibility\nof promotion for the entire movement. Bronson moved that the President\nand officers of HAEB be instructed immediately to make an attempt to\nsecure funds for the establishment of a full-time public relations pro¬\ngram designed to improve public understanding of educational broadcast¬\ning. Schenkkan seconded and approval was unanimous•\n37. Discussed also were other possible measures of action* activa¬\ntion of an HAEB Public Relations Committee to transmit regular materials\nto a Hew fork area association member for processing to leading critics,\ncolumnists end syndication people; the similarity of the public relations\nproblem and need on the part of the local station; the need eventually\nto move HAEB Headquarters to Hew York; the fact that public relations\nfor the movement is in the long run dependent on the programming.\nSchooloy pointed to the possibility of approaching several founda¬\ntions for advice in meeting this critical public relations problem*\nVogl suggested that broadcast equipment manufacturers might be ap¬\nproached by HAEB for donations to implement the public relations plan.\nSuch might b© mutually advantageous.\n38. Station Activation Report. On behalf of the fid hoc Station\nActivation Comittee, lull read fibs final report*\nMans* ©rsof ETV stations attending the 1957 Allerton House ETV\nManagement Seaainar unanimously voted rapid and wide-spread activation\nof additional LTV stations throughout the U»S. as one of ETV's most press¬\ning needs. This concept, formalized in are solution and illustrated by\na proposal {colling for four resident consultant-managers assigned to\nfour potential \"ETV cities\" and budgeted at $80,000-#100,GOQ per year)\nwas referred through the HAEB Television Operations and Development Com¬\nmittee for action by the HAEB Board of Directors at its mooting in St.\nLouis. Following the TV Operations and Development Committee’s unani¬\nmous r©commendation that the HAEB take action on station activation, the\nBoard, impressed with the seriousness of the problem, placed the item\nhigh on the agenda of its forthcoming special Board meeting in Chicago\nwhere it could b© studied in detail, apart from the routine business of\nthe annual meeting, and receive the special attention it was felt to de¬\nserve.\nSubsequently, the ETV Project of the Southern Regional Education\nBoard petitioned the HAEB to devise plans and offer assistance for acti¬\nvating ETV stations not only in specific cities in the Southern States"
}