{
  "id": "d496-199",
  "text": "m\n0\np\nY\nMr, Jack McBride -2-\nb. No merely human organization can do all the above things well and\nthe NAEB, to my knowledge, has not received any Divine Sanction.\nIn fact.\nc. The NAEB appears to feel that there is no conflict between the\ninterests of its radio and its TV members. This is nonsense. Each\nnew ETV station diminishes the importance and influence of every\neducational radio station within its range. Naturally this is re¬\nsented. By the same token each dollar spent by a community on\neducational radio diminishes the potential income of an LTV station\nThis conflict Is of long standing and will become more, rather\nthan less, bitter in the future.\nd. The NAEB vote structure is such that radio can easily outvote\ntelevision whenever a conflict arises.\ne. The NAEB is geographically loaded in favor of the Middle West.\nThis is also the area of greatest activity in radio. This and\nd (above) mean that Mid-West radio operators can always dominate\nan NAEB vote. When c (above) Is considered it means that LTV\nhas no real chance to promote its interests in the NAEB except\nby sufferance. It has no right to elect an officer or board\nmember, or pass on matters“aITecting ETV. What has been done by\nthe NAEB to help ETV has been done through the charity of the\nradio members. In my opinion this is a hell of “a way to run a\nrailroad.\nf. Ever since I have known NAEB it has insisted on playing politics\nwith foundations and others to the detriment of aomplementary\norganizations. One would sometimes suspect from NAEB actions\nthat the chief enemy of the United States wa3 neither imperial\ncommunism nor apathetic ignorance but rsfiier the JCET. This is\nboth childish and dangerous.\ng. NAEB action tends to be slow, cumbersome and frequently In¬\neffective. Its personnel bear some responsibility for this but\nits organizational structure is chiefly to blame.\nh. A good public relations program for the numerous (and amorphous)\nfunctions listed in a (above) is impossible to execute. Hence\nthe PR side of NAEB has been ridiculous.\ni. NAEB does not provide any real help toward the activation of\nnew ETV stations.\nj. NAEB does not provide any real help for functioning ETV stations.\nk. There are a lot more things wrong with NAEB but this is a start\n(although a very small start at that).\nMay I how propose some remedies for these grievous faults.\na. Create two separate but equal organizations which might share\ncertain functions in the Interest of economy but which cannot\nblock each other*s projects. I doubt this can be done within"
}