{
  "id": "d496-231",
  "text": "INTERNATIONAL MUSIC\nLC/SZG/lii\n15 Hay 1959\nONSEIL INTERNATIONAL DE LA MUSIQUE\nOUNCIL\nMAISON DE L'UNESCO\n♦, PLAd oi rotmmcrt - taib ito)\nTflltfMONI : SUrPKIN »*-(>•\nA4r. UUpr. , C. L U. UMISCO PARIS\nDear Sir*\n1. Ctoe of the fortunate results of the Congress on Opera in Radio,\nTV and Film which was held at Salzburg in August 195&, within the framework\nof the Festival, was the decision of the City of Salzburg to award an Opera\nPrize. The purpose of this Prize is to ehoowxage the. creation of ope ratio\nworks’conoeived primirily in terms of TV but adaptable, aesthetically and\neconomically, to the modern operatic stage. The TV studios of a number of\ncountries are producing works which they will have commissioned especially\nfor this occasion and the international Jury which will meet in Salzburg in-^\nAugust 1959 to award the Prize will base its judgment not only on the score\nand the text but also on a telerecorded production of each work submitted.\n2, To mark the award of the Salzburg Opera *rize, a second Congress\nwill be held in the Kongresshaus, Salzburg, from Sunday 23rd to Saturday 29th\nAugust 1959. It will be devoted to \"Opera and Ballet in TV and Film and\n^ill be organized by the TV Service of Austrian Radio (Osterreichischer\nRundfunk) and the International Music Council,\nAs you will see from the draft programme attached, the 1959 Congress\nwill give participants the opportunity of comparing methods used by the TV\nand film producers of many countries in presenting opera and ballet (includ¬\ning, in the case of the former, classical operetta and, in the case of the\nlatter, the classical dances of oriental countries). Illustrations will be\ngiven of the various degrees in the adaptability of a stage-work to TV,\nincluding t\na) relay of a normal performance from a theatre;\nb) relay of a stage performance specially prepared for TV purposes;\nc) stage production transferred to a TV studio;\nd) TV production of a work written for the stage;\ne) TV production of a work conceived for the medium.\nWherever possible, examples will be taken from different productions of the\nsame scenes and comments invited from stage and TV producers concerned.\nParticular consideration will be given to the following questions!\na) the suitability of existing works for TV and the creation of new forms\nof entertainment (incorporating opera, dance, mime, etc..) peculiar to TV,\nb) artistic and technical problems raised by dubbing, playbaok, ghosting,\nsynchronization and similar procedures,\nd) cooperation between music schools and TV in the training of stage\nartists in TV technique.\nMr. Burton PAULO\nBramley Cottage\nlinks Road BBAMLST Surrey"
}