{
  "id": "d496-256",
  "text": "-2-\nmofni?g also brings me a carbon copy of Larry's very interesting\nletter to Harry of November 10. I was much impresse d with his re or t of\nwork accomplished and in progress. So far Graham Hovey tesn'ts ent me f\nany carbons of his reports, so I cannot react to what he is do ire but\nlatvy surely is off to a good start. Unfi r-tunateLy ^ project teU less\n+h progra” output to report, and I find myself so mew-hat at an\nimpasse at the moment; heme the paragraphs whicj* follow.\n®SfeT hZ Say +hft al'th?U6h ? ^ve been over here for seven or eight\nf ^ yft t0 receive eitle r an up-to-date report on curie nt NAefi\nP?^cy ** rega- d to BBC, or anything- like an official review of cSrre£t\nThS materSlshnn l flI>.regara *2 fUch thinSs as ^e $56,000 for BBC shows.\n^ S 1 have reached me if dispatched, since air mail letter <\nfritestht hhr5Le °r f+UI> days.from almost any part of the USA. Harry\nauested^Th^ ?*! ff me various pamphlet aid book material wi ich I re-\n\\h S not arrived—no fait of his, of course. i'he NAEB\nc°me’ ^ sre ln Customs while I wrestle with the\ngovernment d epartments involved to get an import licens e. ■‘■test should be\nthen teleph0n\" CallS -d persona^visits^6\ngeneralDroiwersatiore\"\\;ithaBBC^£b out°program6exchanges 1 ^notwat^\nf:l^fti0nr°n NASf POliCiee fromPBBir Yeer^er;duced°to0tthafun-0\n?f+?eWLfr0m ^ome s0°n begins. So far I've tsL kea with\nthe^Transcnption Service, Stewart—Home Service Con-\n“*?■??5 Adams--Light Controller,and Pelletier who now works with him,\nas well as with folks in TV and Third. Next week I go to policy staff\nmeetings with Talks and Transcription Service. And f shall met again\nonThP^P^t^1^ 5Jgh1Gr?ene>.wh0 seems to be their first contac t man\n^era^lons.Je vel v»aavis NAEB. But without discs to play them\n(which of course is entirely a Customs problem on this end). I can’t\nstuff; and m thout reports from you as to genera policy\nd?re^ionf1Sing activities’ 1 transact mucn business IS the o^r\nfollowing requests (jto be overlooked if already done, of\ncourse. Monday*s mail ma^.1 provide me with all tie answers.*\nJj, ? Harr?T ^asp*t done so—and I*ve not mentioned this item yet—I*d\nlikeseveralc opies of the Jeffersonian script book.\nProm Graydon, please, the following:\na# £ run down on the Convention. I don't wat Greene, Conner and\nPelletier to hear more dD out this from Thornton than I get from\nyou. I ve received rather detailed outa de reports that it was\na lively sessions in many ways; just what went cn?\nb# ?n.BBC situation: has the Board accepted the $56,000\nis comln£ thru from BBC program-wise now? If the\nq>oo,u00 request stands, are we trying to get it lowered? If so\ndo you negotiate with Thornton, me with the folks here, or w hat?\n(I trunk it important we har e a well organized plan here, rather\nthan working mdepdently of each other.) Xf we must get that\namount of money, where will it come f© m? What progress is being\n2."
}