{
  "id": "d496-257",
  "text": "-3-\nc. Clarification of communication lines. Ahus, in nis letter of\nNovember 10 Larry refers to our having NAEB press earcfc , and\nstates \"isuppose Siegel isthe man for this question.“ He also\nrefers to a possible Home meeting in the phrase, \"If we are\nauthorized by Skornia to har e our tnree g et-togethers. . , .«\nIt seems to be the decision on ending that money must be made\nby the Board, and the treasurer authorized to pay it there¬\nafter.\nThis matter of channels is not of eaifch-shaking imports ce, but\nIthink time (ad perhaps fellings, too) will be saved in the\nloig run if we clarify lines of communication. It seems to me\nwe should write to Ausmus on policy matters (with maybe carbons\nto Skornia and any other p© pie involved), Skornia in regqrd to\nope? ations already cleared by Augjmus.\n(A to a Home session®: round; trip fare from here is about\n$150. This does not cover meals, hotel, and the like, how-\never.)\n3. From Harry\na. Please check on my magazine subscriptions. Nothing las come\nyet. And how long ago did you send me any packages (excepting\nthe records)? So far, nothing has come from you exceptseveral\nletters, the last beiig that of N0v. 5.\nNothing said above should lead to the conclusion that I have been wl thout\nplenty to do.1 I*m busy every day, and to good result^ I think.\nFirst, I‘ve been trying to learn asmuch as I can about the BBC, and in th is\npursuit the BBC itself las been most helpful. They hare an excellent\nlibrary, which even has volumes aid volumes of carefully pasted up news¬\npaper clippings, so that in a f ew hour si can review press re© tion, both\ngood aid bad, to their activities in any special categripy into which I\nwish to inquire. Alraostevery book or article ever written about them—\naid this includes thecritical stuff too—is here. I can come and go as I\nlike in that library, and i s all proving most worthwhile, In, a few more\nweeks I should har e read most of the books written about them, and have\ngone through most of the Parliamentary papers, in m ich is© ntal ie d a\ntremendous amount of data about their operations both domestic and foreign\nHhe BBC staff continue to be very accessible. So far I*ve met and\ntalked to the heads of Overseas depa? tments, Controllers of Horned Light,\naa d Third, and manyothbers in both radio and TV.\nAnd of course I've done much listening and viewing. The Hadio Times lis ts\nall the programs in details, so its not hard to choose vh ich ones to\nhear. I cidetnaLly, I think Home may offer us more than Third, an opinion\nwhich Maliolm Frost also offered to me. Third tend s to be tad retio fey\nUS standard® (except for drama), whereas Home (aid Light) utilize more\nof a competetitve approeh."
}