{
  "id": "d496-27",
  "text": "March 7, 1957\nTO: NAEB BOARD OF DIRECTORS\nFROM: Burton Paulu\nSUBJECT: Resignation of WQED, Pittsburgh, From NAEB\nLike you I have read with great interest the exchange of communications\nbetween Jack White of WQED and Harry Skornia relative to WQED9s withdrawal\nfrom NAEB® The last of these which I have seen is V/hite*s letter of\nFebruary 20th in reply to Harry*s communication of January 30.\nLast week in Boston, at the Westinghouse Broadcasting Company*s confer¬\nence on Public Service Broadcasting, I had an opportunity for a short talk\nwith Jack. I got the impression that WQED probably would have resigned from\nNAEB in any event, and that this business of the engineers* salaries was\nthe occasion rather than the basic reason.\nFirst off, let me say that I personally believe that Bidlack was\nproceeding in accordance with both precedence and good procedure in dissemi¬\nnating this information. Had this been an NAEB survey, based on confidential\ndata from station managers, the results should have been distributed to\nstation managers to be handled locally as they chose. In this case, however,\nwe were merely quoting information from elsewhere, which engineers who read\ntheir own trade journals would already have acquired.\nI should also take issue with Jack when he objects to Harry*s statement\nthat we have ,fto develop a generation of engineers who are also educators\nat heart.” This may be a difficult objective to obtain, but after some\n20 years of educational station management I sincerely feel that interesting\nengineers in the program objectives of the station is one of our important\nassignments. In some cases we at KUOM have succeeded in this and in some\ncases not; but it certainly is a worthy objective.\n% own conclusions at this point «*- and these are merely personal —\nare as follows. In the first place, I don*t think anything will be gained\nby further communications between NAEB and Jack White on the subject of his\nwithdrawal. He, of course, Is entitled to his opinions and to the expression\nof them, but I don*t think that continued exchanges of this kind will\ncontribute — in the immediate future at any rate — to the desired objective\nof bringing WQED back into NAEB. In fact, it could have the opposite results,\nand might even win for White a certain amount of support from other edu¬\ncational television stations which may not be sold on NAEB.\nThe big problem, of course, Is not NAEB and WQED, but rather NAEB and\nall educational television stations« As I have talked to educational\ntelevision staffers at NAEB meetings and elsewhere, I realize that the\nproblem of getting new educational television stations to take an active\nrole in our organization, and of holding those which are already involved,\nis a considerable one. Traditional NaEB members have been stations oriented\naround educational institutions; many of the new stations, however, are\ncommunity stations, and they naturally take a somewhat different approach\nto things, and they do not feel impelled to join us just because many\neducational institutions are members. The managers of the stations too,"
}