{
  "id": "d496-47",
  "text": "EDUCATIONAL TELEVISION AND RADIO CENTER\n1610 Washtenaw Avenue\nAnn Arbor, Michigan\nApril 16, 1957\nMr* Purton Paulu, President\nNational Association of Educational\nBroadcasters\nStation KTJOM\nUniversity of Minnesota\nMinneapolis llj., Minnesota\nDear Burton:\nThis is a follow-up on your letter of April !{. and our tele-*\nphone call of this morning. As I understand it, you will get in\ntouch with tiie other members of your Committee, suggesting\nthat we meet for luncheon Tuesday noon. May Uj., and as long as\nis necessary through the afternoon. This is in lieu of a possible\nmeeting at the Ohio Conference, which you and I agreed probably\nwould be better under the circumstances.\nI»ll not attempt to respond to the comments in your letter,\nsince we'll have an opportunity to talk when you are here, except\nfor two items: In the first place, I do not believe it is good for\nthe Committee to meet apart from the President of the Center,\nI agree with you in your general definition of the role of\nthe Committee and it is an emerging one, to be sure. There is\nno occasion for the Committee to meet in advance of board meet¬\nings because the role of the Committee is sufficiently different\nfrom that which originally was envisioned as to make it unnecessary\nfor such arrangements to taku place, We have assumed that a\ncouple of meetings a year, plus the opportunity to correspond\nwith the Committee or talk with them by telephone in the interim,\nis sufficient. All this of course can be reviewed, if you like,\nwhen we meet.\nI would suggest you indicate that the Committee plan to meet\nat the Center building, 2320 Washtenaw Avenue, at 12 o'clock noon\non Tuesday, and we *11 either have our lunch here or go to some\nnearby spot for these activities. It will be good to see you at that\ntime.\nWhy don't you come to the Affiliates* Meeting as the repre¬\nsentative of the NASD at this time rather than have Harry Skornia\ncome? V/e are getting a pretty good-sized group, and 1 think there\nrolfSht just be a possible misunderstanding if we added too many\nobservers from any group, Don't misunderstand this, but it occurs\nto me that it might be possible for you to substitute for Harry at\nthis session if you care to do so*\nLet me know when you're coming in and your need for room\nreservations in connection with the meetings.\nSincerely yours,\nM. Newburn\nKKNsmjl President"
}