{
  "id": "d496-52",
  "text": "MEMORANDUM\nMay 21, 1957\nTO: Members of NAEB-ETRC Liaison Committee\nCC: Harry Jo Skornia\nPROM: Burton Paulu\nIn the paragraphs below I have tried to set down what seem\nto me the things agreed upon in our meeting with Harry Newburn\nIn Ann Arbor on May l!j.0\n10 Though no formal action was taken, I believe there was a\nconsensus of opinion that this committee might better be referred\nto as the NAEB«ETRC Liaison Committee than to continue under Its\npresent title of Advisory Committee to the President of the ETRC*\nSince Newburn clearly does not seek advice from us. It seems\npresumptuous that we should designate ourselves to provide him\nwith somei Therefore, I suggest that in the future we refer to\nourselve.s as the NAEB«ETRC Liaison Committee*\n2* There seemed to be agreement among us of HA SB that the\ncontinuance of such a committee Is necessary. There is not only\nthe question, of relationships between HAEB and the Center in the\nmatter of television, but there also are the radio activities of\nthe two groups, as well as the jurisdiction of the NAEB and the\nETRC in such matters as funds for In^training which we discussed\nat our meeting on Tuesday®\n3a There would also seem to be agreement on the need for\nsome kind of committee to represent the affiliates in their\nrelationships with the Center, particularly as a way to channel\ntheir ideas and complaints to the Center. Such a committee might\nbe one set up by the Center itself; it-might be a committee set\nup by the affiliates; or it m*gjht be an NAEB committee appointed\nby me, with the advice, consent and approval of the affiliates, to\nrepresent them In this liaison capacity* However, Newburn*s ^\nstatements at our meeting, taken together with the-. Sunday night\nand Monday noon sessions of the affiliates In the absence 'of any\nrepresentatives of the Center, would seem to indicate the need\nfor such a group®\n1*. The principal question in this would seem to be whether this\nnew affiliates~ETRC Liaison Committee should be the present NAT2B-\nETRC Committee; a separate NAEB committee; a committee set up by\nthe affiliates acting apart from NAEB; or one set up by Newburnc\nInvolved here, of course, is the whole question of whether NAEB\ncon easily and properly represent the affiliates in this matter.\nIt would seem to me that these and related matters should\nbe explored at and in connection with the television management\nseminar which we will hold at A Her ton House in August®"
}