{
  "id": "d496-88",
  "text": "•\nMEMORANDUM /?4; ; \"\nTOs Members NAEB Board of Directors £ September 179 1957\nccs Harry J. Skoraia, Leonard Marks\nPHOMs Burton Paulu ‘/J ijj/\nLike all vacations, mine had to end too. After three wonderful\nweeks of driving some 4200 miles from Minneapolis to Oregon and\nback (taking in the Badlands, Black Hills, Big Homs, Yellowstone,\nGrand Tetons, a ranch, and Glacier Park), I’m back at the office\nagain.\nThings are busy here, as they must be for you too. During\nthe week of September 9 through 13 I attended an excellent seminar\nin Washington on Instructional Television tinder DAVI auspices\n(with Fund for the Advancement of Education funds). This week is\nthe hectic—but good—first week of broadcasting over KTCA«TV.\nWith the University of Minnesota contributing an hour a day from\nits own studios, we’ve been plenty busy (along with a lot of other\nNAEB members and non~members who also have been doing Channel 2\nprograms.)\nAs you know, the NAEB convention will meet in St. Louis on\nOctober 30 and 31, and November 1. Board meetings are scheduled\nfor Monday, October 28, from 4*0° to 6s00 and 8s00 to exhaustion,\nas well as Tuesday, October 29, from 9*00 to 12s00 and Is30 to\n5s00. (The opening convention session will be held Tuesday night,\nOctober 29•)\nI hope you all can be there for all Board meetings. If you\ncan’t make it, would you drop me a line to that effect right away?\nWhether or not you can come, would you send in suggestions\nfor the agenda? Harry and the headquarters staff are getting up\nan agenda book to facilitate our consideration of those matters\nrequiring documentation, and in addition will send us advance copies\nof some materiel so that we may read it before the meeting convenes.\nThere, of course, will be the usual reports, headquarters and\notherwise; but I hope we can devote the major portion of our time\nto long range planning and policy problems.\nOn my temporary agenda list are the followings (1) lesi®lative\nproblems (such as Magnuson and Eberharter bills, tax relief for\nUHF) (Lennie Marks will be on hand to guide us here); (2) other\nlegal problems (including insurance); (3) FCC probisms (current\ndevelopments on which we should be informed, and on which we may\nhave to take positions); (4) ETRC and JCET relationships and\npolicies; seminar plans; regional meetings; constitutional problems;\npermanent financing problems.\nWhat else? May I hear from you?\nBPskis"
}