{
  "id": "d172-0",
  "text": "PEOPLE UNDER COMMUNISM\nPEOPLE UNDER COMMUNISM is produced by the NAEB under the terms of a grant from the Fund\nfor Adult Education, established by the Ford Foundation • The grant was administered by\nMr, Ralph Lowell at the direction of the Adult Education Coisaaittee of NAEB, ©onsisting of\nGeorge Probat# Director# University of Chicago Roundtable# Chairman} Richard B, Hull,,\nDirector of Station WOI~AM-FM-TV, Iowa State College| H, B« McCarty, Director of Station\nWHA and the Wisconsin State Network} Seymour N« Siegel# Director of Station WNYC, City of\nNew York} Parker Wheatley# General Manager of Station WGBH# Boston. Program coordinator\nfor all series is William Harley of Radio Station WHA, Madison Wisconsin•\nThese programs are a sincere# thorough and searching investigation of Soviet Russia\nhighlighting its strengths and its weakness. In dramatic form and authenticated with\nthe advice and assistance of the following distinguished American Scholars!\nProfessor Phillip E, Moseiy of Columbia University\nProfessor Merle Fainaod of Harvard University\nProfessor Harold H. Fisher of Stanford University *\nProfessor Ernest J. Simmons of Columbia University\nProfessor Alex Inkeles of Harvard University\nwith Dale Fuller as Project Supervisor\nThese are the titles of the seven programs on PEOPLE UNDER COMMUNISMi\n1. “Terror as a System of Power*1 - Written by David Driscoll# narrated by Alex\nScourby, produced and directed by Frank Pappi based on documented evidence\nand expert knowledge in the possession of Dr« Merle Fainaod# original music\ncomposed and conducted by Wladimir Selinsky,\n2. “Musi© to Order* « Script prepared with help of materials and counsel, provided\nby Dr, Ernest J, Simmons, Produced and directed by Frank Papp* original\nmusic composed and conducted by Wladimir Selinsky. Guests are Deems Taylor,\nHenry Cowell and Nicolas Slonimsky,\n3 c “The Men Who Make the Migs* - Written by Ralph Tangney? produced and\ndirected by Frank Papp, script based on materials supplied by Dr, Alex\nInkeles, original music composed and conducted by Wladimir Selinsky,\n4, “Drama to Order*® - Written and narrated by Dr, Ernest Jo Simmons# produced and\ndirected by Frank Papp, original music composed and conducted by Wladimir\nSelinsky,\n5, “Literature to Order5® - Materials for broadcast and narration by Dr, Ernest\nJ, Simmons, produced and directed by Frank Papp, original music composed\nand conducted by Wladimir Selinsky.\n6, “Pattern of World Conflict* - Written by Joseph Mindel on basis of material\nsupplied by Dr. Philip E, Moseiy# produced and directed by Frank Papp,\noriginal music composed and conducted by Wladimir Selinsky,\n7, “The Musi© and the Dream* - Written by Milton Geiger, narrated by Arnold\nMoss, original music composed and conducted by Wladimir Selinsky# produced\nand directed by Frank Papp, Materials and counsel for broadcast supplied\nby Dr. Harold H. Fisher,\nThese programs may be used once on a sustaining basis by commercial stations, (The\nNational Association of Educational Broadcasters, is composed of universities, colleges,\nschool systems and public service agencies which are engaged in noncommercial edn»\ncational broadcasting through their own Institutionally-owned AM, FM, or Television\nstations# or through the facilities of ccmsoercial stations,)\n$25,00 per album from NAEB Headquarters, 14 Gregory Hall, Urbana, Illinois,\ni»a~54"
}