{
  "id": "d172-111",
  "text": "LET’S FIND OUT\nScience\nSeries VIII\nGrades 1-2\nPurpose\nForeword\n\"Let’s Find Out\", a series of fourteen science broadcasts has been planned to\nhelp young listeners (1) to accurately observe the things about them; (2) to enable\nthem to identify some common objects and to recognize a few characteristics of\nthese; (3) to provide opportunity to gain some skill in simple manipulation of\nmaterials within their ability to investigate*\nEquipment and Supplies Needed\nNumerous items, not already on hand in some schools may be needed in carrying\nout the experiments. Most of these can be secured through regular channels of the\nschool system, or can easily be gotten by the pupils from their homes.\nTeachers are urgently requested to plan far enough ahead so that any materials\nneeded from the Supply Department or the Division of Audio-Visual Education can be\nordered and delivered in time for the broadcasts without departing from the usual\nschedules for such delivery.\nContent\nThe programs are arranged in units which follow as nearly as possible the\nchanges in seasons and which are correlated with the course of study for the primary\ngrades•\nPreparation for Broadcasts\nPreparations for each program should be made in advance so that the pupils,\nindividually, in groups, or by demonstration, will carry out the experiments as the\ndirections come to them over the air.\nUse of the Broadcasts\nWe hope you will think of this series of science broadcasts as\nto be used only if it can in any way enrich your science teaching,\nabout which we will welcome your critical comments if you listen to\nthe series.\na classroom aid\nIt is a program\nany or all of\nSubmitted by: Members of the Elementary Science\nRadio Planning Committee\nMost KSLH series are planned by Radio Planning Committees and are based on the\nCourses of Study of the St, Louis Public Schools, They are designated for specific\ngrade levels; however, this does not preclude their use in other grades -? ’ i-\ntribute something worthwhile to the listeners."
}