{
  "id": "d172-134",
  "text": "-4-\nis a natural geographic unit, rimmed by high mountains, and lying about forty miles\ninland from the Los Angeles Metropolitan area of Southern California. It is a com¬\nmunity of communities transitional from an agricultural (citrus orchards and vine¬\nyards) to a machine and distribution type economy. The city of San Bernardino has\na population of seventy-six thousand; the metropolitan area, one hundred and thirty-\nfive thousand; and the San Bernardino Valley area exposed to the program, upwards\nof two hundred and fifty thousand. San Bernardino has been a lusty frontier town\nand is only beginning to turn to the critical examination of its future, emphasis\non its cultural progress, and the development of harmony among its diverse popula¬\ntion.\nSan Bernardino is one of the eleven cities participating in the Test Cities\nProject of the Fund for Adult Education. San Bernardino Valley College (a public,\ntax-supported junior college) cooperates with the Fund in this project and has\ncreated the Community Education Project as the administrative arm of the College to\ncarry on this ■vrork. The Community Education Project had the responsibility for the\nWAYS OF MANKIND Experiment.\nMATERIALS USED IN THE WAYS OF MANKIND EXPERIMENT\nThe experiment was built around a radio series bearing the common name of\nWays of Mankind. The series consisted of thirteen programs, each of a half hour’s\nduration, developed by the National Association of Educational Broadcasters, under\na grant from the Fund for Adult Education. Dr. Walter Goldschmidt, anthropologist.\nUniversity of California at Los Angeles, had over-all responsibility for developing\nthe radio series. Nine of these programs were chosen for the Experiment.\nThe series constituted an introduction to basic anthropology. Educational in\nnature, the programs also represented American radio at its best. They were skil¬\nfully done, highly dramatic, interest-sustaining, and executed m th humor and the\nlight touch of top radio craftsmanship. Each program is different in format and"
}