{
  "id": "d172-142",
  "text": "-12-\nThe experiences of groups drawn from the ranks of the same formal organiza¬\ntion were varied. In general, however, these groups lacked the intensity of in¬\nvolvement of the friendship groups and their discussions tended to drag. There were\nseveral outstanding groups in this category, however.\nNo attempt was made to organize groups under trained leaders and open to\nthe general public in meeting places such as schools. These so-called ”cross-\nsectional groups” rarely are that, Where they appear to be, case studies have shown\nthey ccrne chiefly from one social level with persons from other levels usually turn¬\ning out to be social isolates more interested in being with pe ople than in the actual\nsubject of discussion.\nWhile variables other than the organizing principle affected the success of\nall groups, some important inferences from the disparity between these three kinds\nof groups can be made. Sweeping generalizations on the basis of this one experience,\nof course, would be unwise, but these factors should be considered in planning future\nprograms of this kind:\n!'• In friendship groups, there is a feeling of freedom and tolerance which\nfrequently is h. eking in other groups. People relax more easily with each other and\ntalk more readily about controversial subjects. Members of this kind of group can be\nbrought together more easily. Intellectual exercise becomes an enjoyable pastime,-\nResearch has also shown that fundamental attitude changes are more likely to occur\nin this kind of group than in others; for opinion tends to be a group product,,\nshared by all group members, and a shift in the group norm is likely to be followed\nby shifts in individual opinion.\n2. Block groups (consisting of people living in the same block or immediate\nneighborhood) are.not natural groups and in this Experiment did not tend to develop\ninto natural groups. The reasons for this are varied but some contributing factor's\ncan be identified. In a modern urban setting, friendship ties are only by accident"
}