{
  "id": "d172-148",
  "text": "-18-\ninterest, recruit, and direct original activities, but it must be considered a\nquestionable source of straight discussion data in this type of operation,\nRADIO SURVEY\nA survey to determine the size of the radio listening public not participa¬\nting in discussion groups as such was carried on during the seventh broadcast in the\nseries. The sample consisted of one per cent of the 26,000 names listed in the San\nBernardino city telephone directory, a corps of volunteers was recruited and trained\nto conduct the survey.\nDuring the broadcast a total of 260 calls were made to residences within\nthe city limits j 183 were completed, 109 homes were watching one of seven TV chan -\nnels receivable in the area, 22 were listeneding to radio. Of the 22 radio listening\nother\nhomes, 10 were listening to the \"Ways of Mankind\" program, 19/persons answering\nhad listened to previous \"Ways of Mankind\" broadcasts and could identify individual\nprograms. 23 more persons expressed some familiarity with the series but were\nrather hazy when asked for specifics. In no case was anyone identified with a\ndiscussion group contacted.\nRunning these data through one radio survey formula, we will note that the\n\"Ways of Mankind\" broadcast captured roughly 9.2$ of the total radio and television\nsets in use. On the other hand if we \"hooperize\" the radio sets-in-use figure\nalone, we discover that the program had built itself a 44.4$ share of the radio\nlistening audience. This, in the face of the program competition of three separate\n(and with good reception) national network stations (two in Los Angeles, one local)\nplus the looal fare of eight independent stations,\nA number of conclusions can be supported directly by these figures. First of\nall that there is an audience for well-produced educational radio, whether or not\nthe programs are shored up with organized receptor groups. What portion of this\naudience was attracted by the extensive promotion given the \"Ways of Mankind\" series,\nwhat portion grew out of previous listening habits, or dial twisting encounter with\na given broadcast is impossible to assess."
}