{
  "id": "d172-151",
  "text": "-21-\n3. The chief enjoyment came from the people they were with. Over and over\nagain, this was cited as the factor most enjoyed. Several school teachers who par¬\nticipated in one group reported they decided to stay in the community rather than\naccept offers of employment elshwere, because they enjoyed the friendship of the\npeople brought together through their ’’Ways of Mankind” group.\n4. The participants rediscovered, in many cases, radio as a valuable way of\nspending leisure time.\n5. The stimulus to think. Many people reported they had \"gotten out of the\nhabit” of thinking or talking about serious matters. They found the intellectual\nexercise enjoyable. One woman said;\n\"Before this experiment started I used to talk to my neighbor over\nthe fence on my left about her flower garden. I used to talk with\nmy neighbor on the right over the fence about our children's diets\nand the condition of their \"b.m.’s”J Now at last I have something\nI really want to talk about.”\n6. a growing appreciation of the people of other cultures. One man reported\nhe had never before \"understood anything about the people of other societies.\" He\nhad thought them \"different\" and therefore, \"odd\";\nCONCLUSIONS\nThese appear to be the main experiences gained from the \"Ways of Mankind\"\nExp riment.\n1. Radio and newspaper can work effectively together to stimulate the organi¬\nzation of discussion groups and to nurture those which come into existence. The\nlong-cherished dream of integrating mass media and discussion groups is practical.\n2. Natural friendship circles appear to offer the best basis for organizing\ndiscussion groups when this kind of \"remote ccntrol\" approach is employed.\n3. It is not necessary to sacrifice the quality of discussion in order to\nachieve quantity. A carefully selected radio program, designed to touch off the\nnatural well-springs of human interest and concern will lead to discussion as vital\nand penetrating as that of a carefully organized graduate seminar."
}