{
  "id": "d172-2",
  "text": "f The Tape Network Acceptance Committee submits t’-~ for\nrecommendations for the approval of the NANB Board:\n1. Submission of Projects\nBefore submitting tap©3 for consideration tho offerer should\nrequest forms from Headquarters. Six copies of the submission\nbe,pJ;ovldod for each series. The forms request\nthe following information:\nSubmitting station or organization\nTitle of series\nNumber of programs in series\nhongth of oach program\nTitles of individual programs\nTypes of programs (drama, etc.)\nSummary of sample tape submitted\nContent and purpose of series\nAvailability of supplementary material (scripts.etc.)\nstatement of clearance of music and talent, who should\nbo contacted in connection with program.\nS°nmrS5erTpJ of, a 3a'nPle program and the forms the manurer of\nthe Jape I.ptwork at Headquarters shall audition each tnoc and\nsena his ©valuation of the program with one of the forms to\neach member of tho Acceptance Committeee If the Committee'\nwishes further study of the proposed program, any member may\nra « comittoe vote on the program'. If the project ll\n\"h10 »tap° i3^fc° °® refcurned within one week\nalter Committee haa been informed of Headquarter’s decision.\ntiLnO^bj0Oti,On,.tO m° decision of the Headquarters\nman^ex, the offerer shall be informed of the acceptance or\nrejection with a statement of the reasons for rejection.\nfo^i’.f snd others submitting proposals shall be responsible\nfor clearance - copyrights, union, and talent.\nflLj0 be lnformed concerning the disposition of\nhis proposal within one month.\n2* fepresentativeof NAE3 shall have the authority to contract\nwith any organization or individual for the production and\nrecording of a program or series without the consent of the\nNetwork Acceptance Comnittee or its authorized representative.\n3* r^ffL13 n° ?bli.'iation upon the part of the Tope Network to\nextend a series of programs beyond a fixed number of broadcast\nuDonrthe’<.-™o0hf°itlnUinp!: ssries must he submitted for aooroval\nupon th© same basis as a now series.\nk* we ~i fche Tupe N°twork Acceptance Committee arc concerned\nA. .^°4.0XCeS,JB-f nxmbor of rejections which state that tho\ncannot be approved because of the lack of tapes. This\nin conjunction with the tabulation of 83 Tape Hamers .\nthe Committee to recommend that some system of penalties be\nprovided to assure better return service."
}