{
  "id": "d172-82",
  "text": "(RELEASE H)\nFROM: RADIO STATION WXXX\nADDRESS\nPHONE FOR RELEASE: (DATE)\nPRIMITIVE LAW 13 EXPOUNDED IN NAEB'S \"LION BITES MAN”.\n\"Lion Bites Man\", latest in the second \"Ways of Mankind\" series\nproduced as an adult education project by the National Association of\nEducational Broadcasters, is a half-hour program exploring a primitive\nmethod of practicing law as done by the early Ba-Ila tribe in Northern\nRhodesia in the heart of Africa.\nPresented under the supervision of Dr. Walter Goldschmidt,\nanthropologist of the University of California, the new offering will be\nheard at -- (time) -- on -- (date) - - over Radio Station -- (name). Lister\nSinclair wrote and Andrew Allan produced \"Lion Bites Man\" which is one\nof a subseries of six programs on Law and Justice which in turn is part\nof the over-all \"Ways of Mankind\" series.\nSpecial consultant for the Law and Justice subseries was Dr. E.\nAdamson Hoebel, Professor of An thropology and Dean of letters and\nScience at the University of Utah.\nThe story of \"Lion Bites Man\" details how Shako, a successful\nlion hunter of the Ba-Ila tribe, sought satisfaction when he suffered an\narm-wound fighting a lion while Shako was defending cattle belonging\nto his friend Nabotu. Shako argued, and first tried to prove on a rnan-to-\nman and tribe-to-tribe basis, that Nabotu owed him \"damages\" for the\narm wound.\nUnsuccessful in his quest, Shako made a case-at-law of the affair,\ntaking his argument before the Chief of the Tribe, who sat as judge. But\nhere Shako had to be represented by \"counsel\", an elder of the tribe.\nIndeed, Shako won his case and a \"c©u$taward\" of three calves. But\nhis victory was an empty one, for the \"attorney\" took two of the calves\nas his fee .\n\"Never employ a representative\", says one of the moralist member\nof the tribe, at the conclusion of the program, \"for he may get more out of\nthe case than you do. The fearsomeness of the anthill is the long grass\nupon it; it may hide a leopard, No man knows what he will find in the law\nuntil he steps into it. \"\nm m"
}