{
  "id": "d172-88",
  "text": "r\nFROM: RADIO STATION WXXX ( RELEASE #12)\nADDRESS\nPHONE FOR RELEASE: (DATE)\nWEST AND EAST BLEND ON BALI ISLE, NAEB SAYS\nOn the Island of Bali, the Western world of imagination and the\nEastern world of reality meet and blend. For Bali has the sound and\nfragrance, the beauty and the people of our traditional South Sea Island.\nThe island is never silent, for the Balinese love music more than anything\nelse -- except perhaps a cockfight -- and somewhere an orchestra is always\nat practice on a xylophone, flutes and stringed instruments.\nSuch is the setting for \"The Coming Out\", the second of three\nradio programs prepared to offer the listener the experience of living as the\npeople of Bali live within the framework of their traditional culture. The\nthree Bali programs will be the final broadcasts in the over-all second\nseries on \"The Ways of Mankind\" presented as an adult education project by\nthe National Association of Educational Broadcasters.\n\"The Coming Out\", written by Walter Newman and produced by\nAndrew Allan, will be heard over Radio Station -- (name) -- at -- (time) --\non -- (date).\nFor the series on Bali, Colin McPhee selected and made available\nthe recorded music from the Island of Bali and acted as special consultant\non the script. Miss Claire Holt served as consultant. Margaret Mead of\nthe American Museum of Natural History advised on planning the Bali scripts.\nThe new broadcast presents the simple story of a young Balinese wife\nexpecting a child. We must push beyond the pageant of tropical market and\nstone temple and examine the Bali of every-day life, we are advised in an\nintroductory narrative by Dr. Walter Goldschmidt, anthropologist of the\nUniversity of California, who supervised the \"Ways of Mankind\" series.\n\"To the Balinese\", Dr. Goldschmidt says, \"this island is no exotic\nplace, but the very center of the world. People are born and die, families\nlive their lives within walled compounds, men go the rice fields to work, share\nfor share with th4ir neighbors,, they propitiate gods and ward off evil; they\nlove, they fear, they hope, they cherish. Now we learn just what they feel\nand how they express these feelings.\"\n### m m"
}