{
  "id": "d172-89",
  "text": "(RELEASE #13)\nFROM: RADIO STATION WXXX\nADDRESS\nPHONE FOR RELEASE: (DATE)\nMUSIC INTER WOVEN INTO LIFE OF BALINESE, NAEB EXPLAINS\nThe meaning that music and their own native orchestras have for\nthe people of the Island of Bali is explored in \"The Fighting Cock Refrain\",\na broadcast which concludes the second \"Ways of Mankind\" thirteen weeks’\nseries presented as an adult education project by the National Association of\nEducational Broadcasters.\nOne of a subseries of three programs devoted to the Balinese and\ntheir culture, \"The Fighting Cock Refrain\" will be heard at -- (time) -- on -\n(date) - - (name).\nDr. Walter Goldschmidt, As eociate Professor of Anthropology and\nSociology at the University of California, supervised the entire Ways of\nMankind series. For the Balinese scripts, Colin McPhee collected and made\navailable recorded music from the Island of Bali. Consultants included Miss\nClaire Holt and Margaret Mead of the American Museum of Natural History.\nWalter Newman wrote \"The Fighting Cock Refrain\" and Andrew Allan\nproduced it.\nThe story of \"The Fighting Cock Refrain\" tells how a Balinese\nmusician falls into disgrace through divulging secrets to the musicians of a\nrival village, but even at the height of his humiliation jubilantly plans a\nmusical \"comeback\".\nLife for the Balinese peasant is lived largely within his village.\nHis village is governed by a council of all married men, who apply the\ntraditional regulations to preserve order and maintain the cooperation\nnecessary for irrigating and working their rice fields.\nVery nearly every village, too, has its orchestra club, the pride\nand focus of its social life. To the Balinese, the love of music is the love\nof playing it. and night after night they will practice out of sheer pleasure,\nuntil without notation they can create and reproduce intricate symphonic\nmasterpieces. \"The Fighting Cock Refrain\" seeks to give a true under¬\nstanding of the meaning that music and their orchestras have for the people\nof the Island of Bali."
}