{
  "id": "d1453-0",
  "text": "OFFICERS\nEXECUTIVE COMMITTEE\nPRESIDENT! JOS. F. WRIGHT, WILL\nVice-President: W. I. GRIFFITH, WOI\nSecretary-Treasurer\nB. B. BRACKETT, KUSD\nVermillion, South Dakota\nOffice df Executive Secretary\nT. M. BEAIRD, WNAD\nUNIVERSITY OF OKLAHOMA\nNorman, Oklahoma\n\"JRe. A'\nof\nCollage and LiruVai^ily\ndealing\nFirst Zone: DANIEL E. NOBLE, WCAC\nSTORRS, CONNECTICUT\nSECOND ZONE: G. R. FAINT, WJBU '\nLEWISBURB, PENNSYLVANIA\nThird Zone: GARLAND POWELL, WRUF\nGAINESVILLE, FLORIDA\nFourth Zone: H. g. INGHAM, KFKU\nFebruary 6, 1933\nFifth Zone: H. V. CARPENTER, KWSC\nSTATE COLLEGE OF WASHINGTON\nPullman, Washington\nAT LARGE: R. C. HIGGY, WEAO\nOHIO STATE UNIVERSITY\nColumbus, Ohio\nSPECIAL BULLETIN\nTO ME! TEES\n' of\nTHE ASSOCIATION OF COLLEGE AND UNIVERSITY BROADCASTING STATIONS\n(and educational officials cooperating with the Association)\nSome weeks ago your executive secretary contacted eight men in the\nfield of educational radio work and asked that each supply a five\nhundred word article dealing with educational radio work in the past\nfive years.\nIt was asked that, in these discussions, problems considered of para¬\nmount interest be listed for a series of eight bulletins to be released\nto the members of the Association of College and University Broadcast¬\ning Stations,\nWe take pleasure at this time in releasing the first of this series, an\narticle entitled, \"THE NEEDS OF EDUCATIONAL BROADCASTING,\" prepared\nespecially for the Association by DR, F. H. LUMLEY, RESEARCH ASSOCIATE,\nRADIO- DIVISION, OHIO STATE UNIVERSITY, COLUMBUS,\nSince these men, prominent in the field of education by radio, are giving\ntheir time and energies to this special series, station managers and\nprogram directors throughout the entire country will find some very valu¬\nable material in these articles.\nAs the articles are released from this office, please drop notes of ap¬\npreciation to the men presenting them.\nVery truly yours,\n/,1. i'J.r dj\nT. M. Beaird, Executive Secretary"
}