{
  "id": "d1132-1",
  "text": "NAEB NEWS LETTER.;.........,..Page 2........ .. .March l, 1944\nIf you are interested in the series of 10 scripts, 15 minutes each in\nLENGTH, PLEASE ADVISE ME WRITE DIRECT TO Mr. RflCHARD W. LlEBAN, CHINESE\nNews Service, 201 North Wells Street, Chicago 6, Illinois.\nWILL OFFERS SERIES TOR TEACHERS\nWILL, University of Illinois, is broadcasting a weekly series of programs\non Saturday morning, designed especially to aid the school teacher.\nMembers of the College of Education faculty, assisted by administrators\nAND TEACHERS, ARE GIVING THE SERIES. It IS DfeSlGNEO TO GIVE TEACHERS\nINFORMATION CONCERNING CURRENT PROBLEMS CONFRONTING THEM IN THE SCHOOLS,\nTOGETHER WITH INFORMATION CONCERNING NEWER INSTRUCTIONAL PRACTICES ANO\nmaterials, Called \"New Vistas in Education,\" each program is planned on\nTHE BASIS OF A BRIEF TALK, WHICH IS FOLLOWED BY A DISCUSSION OF THE TOPIC\nBETWEEN THE SPEAKER AND MEMBERS OF A PANEL.\nSSCONO TEACHERS1 SERIES ON W U A D\nWith the co-operation of the University College of Education, the University\nof Oklahoma Director of State Service and the Oklahoma State Department\nof EDUcation, WNAO is now presenting the second series of To The Teacher\nprograms, broadcast from 10 to It a«Mo each Saturday.\nTo The Teacher programs are a part of In-Service Education. \"There ?s\nnot a great deal of time for directed study to keep teachers growing in\nTHEIR PROFESSION,\" W. B, RaGAN, ASSOCIATE PROFESSOR OF ELEMENTARY EDUCATION,\nEXPLAINED. \"This is especially true during wartime when many are teaching\nFOR THE FIRST TIME IN MANY YEARS AND NEED NEW TRAINING.\"\n\"Therefore, through these broadcasts we hope to contribute to teachers*\nGROWTH 8Y FURNISHING LATEST AND NEWEST TEACHING METHOOS AND BY EXPLAINING\nPROBLEMS WHICH ARISE IN THE COURSE OF TEACHING.\"\nFITNESS SERIES ON W H A\n\"NOW LIE ON THE FLOOR IN FRONT OF YOUR RADIO\" MAY BE WHA•8 THREE-TIMES-A-\nWEEK GREETING TO ITS LISTENERS IN THE FUTURE.\nFor AN OUTSTANDING physical educator, consultant of THE WAG’S PHYSICAL\nCONDITIONING DIRECTORS, PROF. RUTH GlASSOW, HAS BEGUN A PHYSICAL FITNESS\nPROGRAM OVER THE WISCONSIN STATE STATION, MONDAY, WEDNESDAY ANO FRIDAY,\nAT 8 2 30 A.Me\n\"Setting up\" exercises which were a pioneer type of radio program, will\nprovide a skeleton which Miss Glassow will surround with a complete\nPROGRAM OF ADVICE WH1CH CAN BE TAKEN VERY PERSONALLY, ON WEIGHT, DIET,\nPOSTURE, STRENGTH AND ENDURANCE o\nShe will give listeners facts and figures on results of the Army's\nCONDITIONING PROGFAM, AND INDICATE HOW THEY MAY TELL WHAT BENEFIT THEY\nRECEIVE FROM FOLLOWING HER INSTRUCTIONS0 MEASUREMENT OF ACHIEVEMENT IS HER\nSPECIAL FIELD. SHE IS THE AUTHOR OF A BOOK ON THE SUBJECT AND ONE ON\nFundamentals of physical education.\nWHA WILL SELL\nILLUSTRATEQ,\nLISTENERS THE WAC’s PHYSICAL CONDITIONING BOOKLET, PROFUSELY\nWHICH WILL BE THE GENERAL OUTLINE MlSS ClASSOW WILL FOLLOW."
}