{
  "id": "d1729-3",
  "text": "I. duPont Awards dinner last spring may be obtained by\nwriting to: Curator, Alfred I. duPont Awards Foundation,\nWashington and Lee University, Lexington, Virginia.\n• Michigan State University has published the eleventh\nvolume of the National Compendium of Televised Education.\nLawrence McKune edited the 350-page book of tabulations\nfrom over 7500 sources. Copies may be ordered for $4 each\nfrom The University of the Air, Kellogg Center, East Lans¬\ning, Michigan.\n• Education of Homebound or Hospitalized Children, by\nFrances P. Connor, has been published by Columbia Univer¬\nsity’s Teachers College. $1.75 each.\n• Cross World Books & Periodicals, 333 South Wacker\nStreet, Chicago, has issued a catalog of teaching tools used\nin Russian schools from kindergarten through college. Ask\nfor Catalog #25, Audio-Visual Educational Materials from\nUSSR.\n• The American Research Bureau has published a 48-page\nbook, Television Audience Research Basics. ARB’s address\nis Ammendale Road, Beltsville, Maryland.\n• The Overseas Service of Belgian Radio and TV has pub¬\nlished a revised catalog of transcriptions they can supply free\nto broadcasting organizations. For information, write: Direc¬\ntion des Emissions Mondiales, Radiodiffusion Television Beige,\n18, Place Flagey, Bruxelles 5, Belgium.\n• NAEBer Blake Hunter wrote an article on classroom TV,\n“Too Much Too Soon,” which appeared in TV Guide for\nOctober 10, 1964.\n• Robert F. Lewis, an NAEBer and electronic engineer for\nBell Aerosystems, has written a manual of design and con¬\nstruction practices for builders of radio and electronic equip¬\nment, covering all phases of construction practices from pre¬\nliminary layout procedures to final testing. The illustrated\nmanual is available from the publisher (Radio Publications,\nInc., Wilton, Connecticut) at $2.95 plus 15c postage, or from\nmost electronic parts and equipment dealers. Lewis was for¬\nmerly chief engineer for WFBE-FM, Flint, Michigan.\n• The EBU Review for November is a special educational\nbroadcasting number and contains much information from the\nTokyo school broadcasting conference last spring, including\na. write-UD by NAEB Board chairman Richard B. Hull on\ncorrespondence courses in association with sound and TV.\n• Audio-Visual Materials. Selected Resources Annotated for\nRecreation-Education, Activity Programing and Leadership, a\nselected list of audio-visual materials for use as a therapeutic\nrecreation service for the chronically ill, the aged, and the\nhandicapped, is available from Comeback, Inc., 16 West 46th\nStreet, New York 36, N. Y., for 25c in coin.\n• A Parent’s Guide to Children’s Education by Nancy Lar-\nrick, author of A Parent’s Guide to Children’s Reading and\npast president of the International Reading Association, is\nnow available in paperback from the Benjamin Company, De¬\npartment 275, 600 Fifth Avenue, New York, N.Y., 10020.\n• Two new bulletins, Young Children and Science, concerned\nwith the awareness and understanding of elementary science\nconcepts of children from two to eight, and Science for the\nEights-to-Twelves, are available from the Association for\nChildhood Education International, 3615 Wisconsin Ave., N.W.,\nWashington, D.C., 20016, for $1.25 each.\n• The 3M Visual Products Accessories Catalog is available\nfrom 3M Visual Products, St. Paul, Minnesota, 55119.\n• Instructional Television in Western Pennsylvania, edited\nby C. Walter Stone, is available from the Graduate School of\nLibrary and Information Sciences, University of Pittsburgh,\nPittsburgh, Pennsylvania, 15213. 93 pp.\nPLACEMENT\nPOSITIONS AVAILABLE\n(For information, write Miss Bonnie Decker, Placement Service,\nat the NAEB office in Washington. In order to be considered\nthrough these channels, the reader must be an Individual Mem¬\nber of the NAEB, with credentials on file with the NAEB\nPlacement Service. Non-members can save time by sending\nthe $10 annual dues and $5 Placement registration fee at the\ntime of inquiry.)\nF-l Southwestern university communications department seeks\nproducer-director in TV and film for graduate and sen¬\nior student original scripts, on-campus closed-circuit ITV\nand city-wide, 2400 me 4-channel ETV. Possibly teach\nmedia theory and history. Teaching experience necessary:\nMA preferred. $8,000-$10,000 full-time. Rank dependent\nupon degree and experience.\nF-2 Producer-director for large Eastern university with rapidly\nexpanding ITV division. Duties include direction of closed-\ncircuit courses in new studio and possibly open-circuit\ndirection of tele-courses. MA and two years experience\nrequired. Begin July I, 1965. $6,000 to $7,000.\nF-3 Sales engineer for leading lighting and control equip¬\nment manufacturer. Some experience in TV lighting and\na technical background in mathematics and electricity\ndesirable. Salary and further details upon receipt of ap¬\nplicant's resume.\nF-4 Midwestern university seeks two producer-directors to be¬\ncome involved in expanding broadcast and closed-circuit\nactivities. Excellent opportunity for creative and ener¬\ngetic individuals. Experience and MA degree preferable,\nbut not essential. Salary commensurate with experience\nand education. Open immediately.\nF-5 Middle-Atlantic ETV station desires experienced creative\ndesign director to take charge of design department.\nMust be thoroughly qualified to administer department.\n$7,500 to $8,000.\nF-6 Director of radio-TV broadcasting for private Southern\ncollege, to be responsible for developing physical fa¬\ncilities, programing, radio-TV production, and supervis¬\ning FM radio station personnel. Background in speech\nand/or drama and teaching experience necessary. Sal¬\nary and rank depend upon candidate's degrees and ex¬\nperience.\nF-7 Protestant film producer located in major southeastern\ncity has imminent openings for one/two cinematograph¬\ners/film editors. Must be well-versed in all phases of\nfilm production. Salary open, but comparable to private\nindustry standards.\nF-8 Set designer and graphic artist for ETV operation. Re¬\nquires good concept of visual display, set design, stag¬\ning, interior decorating. Midwestern college of 10,000-\nplus enrollment. $5,000 per year; good fringe benefits.\nF-9 Young man to teach undergraduate radio-TV courses and\ndot as producer-director on open and closed-circuit TV\nfor well-established Midwestern university. Ph.D. pre¬\nferred but MA considered. Position to begin June or\nSeptember, 1965. Salary open.\nF-10 Position available September, 1965, for individual to\nsupervise new lOw educational FM station at large\nMidwestern university. Experience in educational radio\nbroadcasting mandatory: coimmercial experience help¬\nful. May teach fundamentals of speech section. Rank\nand salary open. Background in creative production\nand/or research desirable.\nF-l I Northeastern state college has imminent need for a di¬\nrector of institutional resources to develop A-V and TV\nfacilities and equipment for use in the instructional pro¬\ngram. Ph.D. or Ed.D. required: college teaching ex¬\nperience and administrative ability desired. $ 13,950-\n$16,010 for 12 months.\nF-12 Same institution seeks top-flight producer-director to\nwork with faculty in preparing televised instructional\nprograms for CCTV system. Ph.D. or Ed.D. preferred;\nexperience in college teaching and in TV production\nnecessary. Salary open.\nF-13 New ETV station in south-Atlantic state seeks two ex¬\nperienced staffers: a TV cameraman and a traffic/con¬\ntinuity writer. Both positions offer great potential. Prefer\nexperienced woman for latter, but will accept qualified\napplicant with writing ability. Salaries open.\n4\nNEWSLETTER"
}