{
  "id": "d1511-7",
  "text": ". F'esruary f, 1946\nNAEB NEWS LETTER.3.\nALL THINGS COME TO THOSE WHO WAIT\nThree years is a long time to vait for a copy of a radio talk* but that is\nexactly Y'HAT tGNA?IO CqmO OF OeTROIT, MICHIGAN DID,\nDuring January, l942> Prof. David M. Young of the University of Kentucky\nSTAFF broadcast FROM THE UNIVERSITY STUDIOS OVER THE NETV'ORK OF THE MUTUAL\nentitled \"The Geography of the Pac\nfi SERIES WAS OVER CqmO DECIDED TO WRITE IN AND SECURE THE\nSET. bEFORE HE COULD TAKE HIS PEN IN HAND, HOwryER, UnCLE SaM INTERVENED\n^OMO HAS AN HONORABLE DISCHARGE AND\nIS STARTING TO PICK UP V'HERE HE LEFT OFF, ONE OF HIS FIRST THOUGHTS\nBEING TO SECURE COPIES OF THE RADIO TALKS GIVEN THREE YEARS PREVIOUSLY.\nKWSC REPORTS ON Sa;.£ OF ITS ACTIVITIES\nA LETTER FROM GlEN JqNES OF KWSC CONTAINS A NUMBER OF INTERESTING ITEMS\nABOUT OPERATIONS AT THAT WeST COAST EDUCATIONAL OUTLET. Th£ STATION IS\nTHAT OF TRAINING STUDENTS IN RADIO OPERATIONS,\nAND THAT OF PROVIDING EDUCATIONAL AND CULTURAL PROGRAMS FOR THE LISTENERS\nIN THE 5>TATE OF WASHINGTON. ThERE ARE NO REGULAR STAFF MEMBERS TO PUT\nPF^EPARE THEM. ThE FULL TIME STAFF MERELY ACTS IN AN\nAuVISORY CAPACITY.\nThe current project at the station\norganization, a MATTER OF FILES, FI\nAND coordination.\nIS solidifying the office end of the\nNANCES, RECORDS, PHONES, RECEPTION,\nOne OF THE NEV drogram features is a book review orogram by the Extension\nlibrarian, which is a genuinely critical review, ano not an Omnibook\ntype of summary with \"cuttings ano readings.\" This is but one feature\nprogram at KWSC which features the best classical and light\nclassical music. Many of the other evening features are in the process\nof development and V’ILL be reported on AT A LATER DATE.\nW8£2 PROGRAM PREVIEWS\nSchools equipped v-ith Frequency Modulation receivers will be able to hear\nA series of special pre-view broadcasts of second semester in-school broad¬\ncasts produced by the Radio Gquncil on W8£Z. These programs will be val¬\nuable for both teachers ano children as they are designed to arouse the\nchildren s interest in the broadcast ano suggest to the teachers ways in\nV'H ICH THE PROGRAM MAY BE USED IN SEVERAL GRADES AND SUBJECT AHEAD.\nIriE PUROU£ UNIVERSITY OF THE AIR\nHere are some interesting figures set forth by Jim Miles of WBaa in a\nRECENT LETTER TO PARTICIPANTS IN THE PuFOUE UNIVERSITY ScHOOL OF THE A|r,\nOn THE BASIS OF QUESTIONNAIRES SENT OUT TO SCHOOL PRINCIPALS IN THE STATE\nANO SOME STATISTICAL EXTRAPOLATION HE ARRIVES AT A TOTAL OF 93,000 STUDENTS\nLISTENING TO ONE OR MORE ScHOOL OF THE A|p PROGRAMS. ThEN PUTTING THIS\nON A DOLLARS AND CENTS BASIS USING THE BUDGET FACTS AT HAND HE ARRIVES AT\nA COST OF II C“NTS PER STUDENT CONTACT. NqT BAD, EH?"
}