{
  "id": "d1719-2",
  "text": "■*2'\nUndoubtedly two or three addresses on the program of the 1933 Radio\nInstitution at Ohio State University will be based on the findings embodied\nin the survey of Radio Education which was made by Tracy Tyler of NCER, Al¬\nthough a date for this meeting has not been set, it will undoubtedly be much\nearlier than has been the case heretofore - probably in May - and now is a\ngood time for all of us to start formulating plans to attend this meeting.\nRemember that if you can tfcako homo only one or two good points your time, energy\nand md'noy have been well spent,\nCarl Menzer of TlilSUI is considering the possibility of constructing a record¬\ning ult which ho has successfully developed after five or six years of experimental\nwork* Those of us who have heard some of his records feel that they are far\nbetter than anything available on the market. Love ring Tyson, of the National\nAdvisory Council on Radio in Education, has said that he will attempt to fi¬\nnance the construction of this unit if the cost is not too great, A committee\nof the Educational Broadcasters Association has been considering for three years\nthe obtaining of a successful recording unit to be used in a sort of round robin\nfashion,- It would bo sent to one institution where eight or ten hours of pro¬\ngrams - outstanding music and faculty talks - would be recorded, and then the\nmachine would be dismantled and sent on to the second institution. In this\nfashion quite an extensive library of recorded programs would be available for\nthose stations who cared to used them. Such a plan might prove extremely help¬\nful, especially during the summer months for those stations who find it neces¬\nsary to stay on the air during that period*\nCarl Menzer has also sent copies of blue prints of such a unit to some of\nus with the thought that perhaps each individual station might care to build its\nown outfit so that it would always bo available for recording purposes. The\nwhole matter is still hanging fire but rapidly coming to a head, and we hope to\nreport some very definite action within the next few weeks,\n* * * *\nCommissioner Lafount is said to have expressed the opinion recently that\nhe favors -the increase of power of regional and local stations five fold. Such\na move would bo a big help to a lot of us*\n* * * *\nProfessor Jansky, well known radio engineering authority of Washington,\n£>* C,, made a very interesting talk at the St#- Louis meeting of the National\nAssociation of Broadcasters in which he upset the argument which has always\nbeen prevalent in certain circles since the mooting of this organization a year\nago. At tho previous mooting the report of the engineering committee said, in\nshort, that all frequoncies were about on the same level when it came to broad¬\ncast efficiency. Professor Jansky pointed out very clearly that there is a\ngreat difference in frequencies and that -the lower frequencies are far better\nthan the higher ones. Most any college radio engineer has known for a long\nlong time that this was the true picture,\n* * * *\nTho NAB people discussed at some length the advisability and the possibili*-\nties of appointing a paid president who would act ^s a czar or dictator of the\nbroadcasting Industry, No agreement was reached but it is a safe bet that this\nmove will be made as soon as tho industry can see its way clear to finance it."
}