{
  "id": "d713-41",
  "text": "&rnsrruj2i7\nfe AD QUARTERS\n14 Gregory Hall\nUrbana, Illinois\nAll definitions are, of course, subject to further revision as additional com¬\nments are received and developments warrant.\nDefinition of Responsibilities of NAEB Committees\n(NOTE - An asterisk (*) preceding any definition indicates^that it was formu¬\nlated largely (and in some cases, entirely) on the basis of standards set up\nby previous committee chairmen,)\nAWARDS AMD CITATIONS COMMITTEE — Each year determines whether NAEB Awards and\nCitations should be made, and if so to whom, for outstanding contributions to\nNAEB and to the general field of educational broadcasting. Committee recommen¬\ndations are subject to approval by the Board of Directors, Presentations are\nmade by the Committee on behalf of NAEB, The Committee shall be guided by stand¬\nards for selection, established by the Committee, and approved by the Board*\nThis Committee also may nominate, for consideration by the Board of Directors,\npersons the committee feels worthy of Honorary Membership in NAEB, (Revised,\nFebruary 6, I960.)\nCONSTITUTION COMMITTEE — This committee is responsible for keeping the NAEB\nBy-Laws and Constitution up-to-date, in order that these documents may reflect\nthe growth and interests of the Association. The committee may make recommen¬\ndations for changes to the Board of Directors (either as a result of its own\ndeliberations or as a result of suggestions from NAEB members), or may be called\nupon by the Board to prepare amendments desired by the Board, for submission to\nthe membership for approval, (This committee works closely with the NAEB legal\ncounsel.)\nCONVENTION COMMITTEE — This committee, so far, has been appointed each year\non an annual basis, with members largely or wholly from the host city. Some\nthought needs to be given to a pattern which would also allow more continuty,\nassistance, and guidance to the host convention committee each year.\nDEVELOPMENT COMMITTEE — This committee shall have as its primary concern the\ndevelopment and maintenance of a firm and sound basis of support for the Asso¬\nciation. The committee shall concern itself with the long-range problems of\nNAEB growth and development. It shall, in co-operation with the President and\nthe Board of Directors, explore new and continuing support for NAEB. It shall,\nwhen deemed advisable, secure such support, in concert with the President and\nthe Board. (Revised February 6, I960.)\nENGINEERING COMMITTEE — *This committee has formulated the following statement\nof objectives: A) To investigate new technical developments and ideas and their\npotential application to educational broadcasting; B) To reviex* proposed FCC\nrules and regulations and legislations affecting or likely to affect operations\nor activities in which NAEB members are or might be engaged, and to make recom¬\nmendations; C) To analyze, study and evaluate technical problems of NAEB or\nIndividual members and to supply advice and counsel and make recommendations\nconcerning their solution; D) To provide a continuing program to upgrade the\nproficiency of technical personnel; E) To promote increased interest and parti-\ncipation. by taohniofil personnel in NAEB jaf. fairs, activities, conventions and"
}