{
  "id": "d394-6",
  "text": "- 2 -\nUoS. DEPARTMENT OF STATE (continued)\n$ 80,000„00\nContract SCC-29153 for the period July 1, 1961, through December 31,\n1963, to provide funds to enable the Council in assisting the Department\nin its cultural exchange program by providing certain services in carrying\nout a program designed to bring to the United States selected foreign\nleaders and specialists for programs of travel, consultation and observation\nwhich will bring them in contact with influential Americans and representative\norganizations; to provide a better understanding of the United States in\nother countries, and to increase mutual understanding between the people\nof the United States and the people of other countries.\n593,839,00\nContract SCC-28050, Amendment No, 3, to provide additional funds to\nenable the Council in assisting the Department in carrying out a program\ndesigned to bring to the United States selected foreign leaders and\nspecialists for program of travel, consultation and observation which\nwill bring them in contact with influential Americans and representative\norganizations.\n250,000,00\nContract SCC-29X85, for the period July 1, 1961 through June 30, 1962,\nto enable the Council in assisting the Department in carrying out a\nprogram of assistance to American-sponsored schools in the other\nAmerican Republics to the end that they may better serve as demonstration\ncenters for educational methods and practices employed in the United\nStates.\n4,000,00\nContract SCC-28052, additional funds in further carrying out a program of\nassistance to American*-sponsored schools in the other American Republics.\nOFFICE OF ARMED FORCES INFORMATION AND EDUCATION\nDEPARTMENT OF DEFENSE\n62,900,00\nto provide funds for the operations of the Commission on Accreditation\nof Service Experiences for maintaining liaison between the Office of\nArmed Forces Information and Education, Department of Defense, and civilian\ninstitutions and accrediting agencies.\nContributions - American-sponsored schools in Guatemalan\n$ 25oOQ W. Wo Stroup, Guatemala,, Guatemala\nContributions - American-sponsored schools in Mexico?\n$ 200.00\n10,00\n10,00\n100.00\n5.00\n5.00\n25.00\n100.00\n5.00\n10.00\nKold Kist, Inc.\nManuel P. Servin, La Puente, California\nVirginia. Rath, Swarthmore, Pennsylvania\nC.A. McDaniel, Uvalde, Texas\nGertrud Rath, Farmington, Connecticut\nSelma Shuster, Santa Fe, New Mexico\nCapt. and Mrs, W, J0 Lahodney, Jr,, U.SoN., Arlington, Va.\nJames M, Ayres, Los Angeles, California\nEsther Bonnet, M,D., San Antonio, Texas\nEdith M. Bonnet, San Antonio, Texas"
}