{
  "id": "d573-109",
  "text": "November 13, 1956\nNwmkbFj OMriOloma\nMr, Thomas B, Madin, *\nThe-Unlvei si by uf Cjklal\nDear Mr. Maclins\n^jcc=L\nV\nReference is made to your letter of August 20, 1956 requesting information\nabout membership in the Association for Education by Radio-TV.\nRecent action taken by the mersiberships of the AERT and the National Associa¬\ntion of Educational Broadcasters has resulted in a merger of the two organi¬\nzations and former members of the AERT are now classified as Individual mem¬\nbers of the KAEB.\nI am enclosing some descriptive material about the NAEB and we would be\npleased to have you join the Association as an individual member. For 1957\nIndividual dues are 45,00 for which you would receive the NAEB Journal\n(formerly the AERT Journal) and the NAEB Newsletter. In addition you would\noccasionally receive some of the reports, surveys, etc. that we publish.\nDue to action taken by the membership at our 1956 convention Individual dues\nwill be raised to $7,50 per year beginning in 195S.\nUnder separate cover I am sending you recent issues of the Journal and the\nNewsletter, plus a list of the various publications we have for sale. If\nyou would care to order any of these publications at the time you apply for\nmembership, we will be glad to fill such an initial order at one-half the\nlist price. This, of coiirse, depends upon the availability of the publica¬\ntions and does not apply to the albums listed. This special price applies\nonly to the order accompanying your application for membership, and any\nfuture sales would have to be at the full list price.\nIf you would care to join the? Association, will you please write a Grief\nletter indicating such desie and setting forth your present position and\nmailing address and enclose a check, made out to the National Association\nof Educational Broadcasters, for |5*00. If you have any flirther questions\nabout the Association, please let me know.\nSincerely,\nHarold E. Hill\nAssociate Director\nHEHjarp\nEnclosures/\n^ *5-3,"
}