{
  "id": "d573-13",
  "text": "March 7, 1956\nPresident H. E. Williams\nSouthern Baptist College\nWalnut Ridge, Arkansas\nDear President Williams:\nReference is made to your letter of February 7, which was addressed to\nWashington, D.C., and has just been forwarded to national headquarters\nhere in Urbana.\nWe are very pleased to learn that Southern Baptist College will soon apply\nfor a CP for an educational FM station. Under separate cover, I am send¬\ning some materials which I hope will be helpful to you in planning the station\nand putting it into operation. Also, as the association of educational\nstations in the United States, we feel that you will be interested in learn¬\ning something about our organization and the services it provides to members.\nIncidentally, better than 90$ of all educational radio and television sta¬\ntions in the United States belong to the NAEB.\nI am enclosing some material which will give you more details about the\nAssociation, and in the materials being sent under separate cover I am\nincluding samples of the reports, surveys and other services we regularly\nmake available to member stations.\nAnnual dues in the Association, including a subscription to our monthly\nNewsletter and the above mentioned materials, are based on rated transmitter\npower, as follows:\nClass A - 5 kw and over - $50.00\nClass B - 1 - 4*9 kw - 25.00\nClass C - Less than 1 kw - 15.00\nIn addition to the above, member stations enjoy the benefits of our Place¬\nment Service legal counsel, help in meeting day-to-day problems, the op¬\nportunity to meet, in seminars, conferences and conventions, with other\neducational broadcasters to consider mutual problems, and for the payment\nof an additional assessment fee, the use of our tape network.\nThe NAEB Network, which distributes over 4C0 hours of programming, via\ntape recording, per year, is open only to members of the Association.\nThrough the Network you have an opportunity to broadcast some of the best\neducational programs from all over the country as well as a chance to have\nsome of your better programs receive wider distribution. In addition, being\nable to rely on the Network for eight or more hours of programming per week\npermits your staff to spend more time on the development of outstanding\nprograms."
}