{
  "id": "d573-150",
  "text": "OFFICE OF THE DIRECTOR OF PUBLIC\nRELATIONS AND ALUMNI AFFAIRS\nMr. Harry J. Skornia\nExecutive Director\nNational Association of\n14 Gregory Hall\nUrbana, Illinois\nWOFFORD COLLEGE\nSpartanburg, S. C. /IiXi1\nHi\nember 15, 1956d\n4\nEducational Broadcasters\nDear Mr. Skornia:\nDuring the latter part of last summer I wrote to you concerning\nsome information about the NAEB and also for suggestions concerning\nour television series. Perhaps you do not recall the correspondence\nnow, however I thought perhaps you would be interested in the progress\nwe have made with our series up to this time. We were fortunate in\nsecuring Class A time for the program and I have had much cooperation\nfrom the faculty and staff of the school. Because this was the first\norganized production of television or radio at the school I was\nparticularly happy about the outcome of the first three programs In\nour regular series and the one special program we produced.\nThe local station, WSPA-TV has been more than generous with their\ntime and effort in helping us promote the show and produce it. We\nhave several promotion slides and a sound-on-film promotion for the\nregular series. All I need do before each program Is supply copy for\nthe slides. In conjunction with the radio and tv promotion we send\nadditional copy to the newspapers in the viewing area.\nI have enclosed two of our broschures which we sent to alumni\nover the state of South Carolina. The blue folder gives the schedule\nfor our regular series, while the yellow one is for a special one-time\nshow we just finished on WBT in Charlotte, N«C#, and over the local\nstation. The latter program was produced for the purpose of climaxing\nour annual alumni fund drive.\nIfm not trying to attach a particular significance to our series\nof programs, nor am I saying they are the best to be found. They are,\nhowever, the first for this school and so far have met with successful\nresponse from the alumni and friends. Next year we wish to produce\na series with more public significance and less Wofford centered.\nI would appreciate very much your criticisms or comments about\nthe programs and anyone else who wishes to comment may do so. It is\nour desire to produce programs that use the medium to the best possible\nadvantage.\nA\nIf the fact that this is the first program series for the school\nhas any Newsletter value, you may use any of this material. And, if\nyou wish any further information please let me know and I will be happy\nto furnish it."
}