{
  "id": "d573-59",
  "text": "June 26, 1956\nDirector of Radio\nStation KXLU\nLoyola University of Los Angeles\nLos Angeles, California\nDear Sir:\nWe are very pleased to see that Loyola University of\nLos Angeles has been granted a CP for a new educational\nstation. The forces of educational broaocasting are growing\nSTRONGER EVERY DAY, AND, AS THE ASSOCIATION OF EDUCATIONAL\nstations in the United States, we feel that you will be\nINTERESTED IN LEARNING SOMETHING ABOUT OUR ORGANIZATION AND\nTHE SERVICES IT PROVIDES TO MEMBERS. INCIDENTALLY, BETTER\nTHAN 90% OF ALL EDUCATIONAL RADIO AND TELEVISION STATIONS IN\nthe United States belong to the NAEB.\nI AM ENCLOSING SOME MATERIAL WHICH WILL GIVE YOU MORE DETAILS\nABOUT THE ASSOCIATION, AND UNDER SEPARATE COVER AM SENDING\nSAMPLES OF THE REPORTS, SURVEYS AND OTHER SERVICES WE REGULARLY\nMAKE AVAILABLE TO MEMBER STATIONS.\nAnnual oues in the Association, including a subscription to our\nmonthly Newsletter and the above mentioned materials, are based\nON RATED TRANSMITTER POWER, A3 FOLLOWS 5\nClass A - 5 kw and over -\nClass B - 1 - k*9 kw - 25.00\nClass C * Less than 1 kw - 15.OO\nIn ADDITION TO THE ABOVE, MEMBER STATIONS ENJOY THE BENEFITS\nof our Placement Service, legal counsel, help in meeting day-\nto-day PROBLEMS, THE OPPORTUNITY TO MEET, IN SEMINARS, CONFER¬\nENCES AND CONVENTIONS, WITH OTHER EDUCATIONAL BROADCASTERS TO\nCONSIDER MUTUAL PROBLEMS, AND, FOR THE PAYMENT OF AN ADDITIONAL\nASSESSMENT FEE, THE USE OF OUR TAPE NETWORK.\nThe NAEB Network, which distributes over I4.OO hours of program¬\ning, VIA TAPE RECORDING, PER YEAR, IS OPEN ONLY TO MEMBERS OF\nthe Association. Through the Network you have an opportunity\nTO BROADCAST SOME OF THE BEST EDUCATIONAL PROGRAMS FROM ALL OVER\nTHE COUNTRY AS WELL AS A CHANCE TO HAVE SOME OF YOUR 8ETTER\nPROGRAMS RECEIVE WIDER DISTRIBUTION. In ADDITION, BEING ABLE TO\nRELY ON THE NETWORK FOR EIGHT OR MORE HOURS OF PROGRAMMING PER\nWEEK PERMITS YOUR STAFF TO SPEND MORE TIME ON THE DEVELOPMENT OF\nOUTSTANDING PROGRAMS."
}