{
  "id": "d573-60",
  "text": "KXLU\n•2*\nJune 26, 1956\nBy recent action or the NAEB Executive Committee, new members\nARE ALLOWED TO JO IN THE NETWORK WITHOUT PAYING THE FULL ASSESS¬\nMENT FEE* A GRADUATED SCALE HAS BEEN SET UP WHEREBY NEW STATIONS\nDO NOT PAY THE FULL FEE UNTIL THE THIRD YEAR. ANNUAL NETWORK\nASSESSMENTS ARE BASED ON THE SAME POWER CLASSIFICATIONS AS\nMEMBERSHI PI\nClass A\nClass B\nClass C\n1ST YEAR 2ND YEAR\n#1|00.00 $>600.00\n250.00 375.00\n150.00 225.00\n5rp year\nIHOO.OO\n500.00\n300.00\nIN ADDITION, MEMBER STATIONS MUST PAY POSTAGE BOTH WAYS ON TAPES\nSHIPPED TO AND FROM THE NETWORK. FOR A STATION IN YOUR AREA THIS\nWOULD AMOUNT TO APPROXIMATELY #200.00 A YEAR IF YOU AVAILED YOUR¬\nSELF OF ALL THE PROGRAMS MADE AVAILABLE BY THE NETWORK. (THERE IS\nA STRONG POSSIBILITY THAT THERE WILL SOON BE CONGRESSIONAL ACTION\nTO LOWER RATES FOR EDUCATIONAL RECORDINGS, WHICH WOULD MAKE POSTAGE\nPAYMENTS CONSIDERABLY LOWER.) EVEN WITH THE POSTAGE CHARGES YOU\nSEE THAT THE COST PER HOUR OF PROGRAMMING (FOR ij.00 HOURS, OR MORE)\nIS VERY LOW.\nIn ADDITION TO THE REGULAR NETWORK SERVICE OESClRBED ABOVE (A SAMPLE\nNetwork offering is included in the material being sent separately),\nWE MAKE AVAILABLE IN-SCHOOL PROGRAMS TO THOSE STATIONS WHO DO IN-\nSCHOOL BROADCASTING. FOR THIS SERVICE A STATION PAYS AN ADDITIONAL\nFEE OF ONE-FOURTH OF THE REGULAR ASSESSMENT, OR #2.00 PER REEL,\nWHICHEVER IS LESS. HOWEVER, SINCE MANY IN-SCHOOL STATIONS ARE NOT\nON THE AIR DURING THE SUMMER MONTHS, SUCH STATIONS ARE ALLOWED TO\nSUBSTITUTE THE IN-SCHOOL PROGRAMS FOR REGULAR PROGRAMS THEY WOULD\nRECEIVE OURING THE SUMMER, AND THUS PAY NO ADDITIONAL FEE FOR THE IN-\nSCHOOL SERVICE. IF A STATION OWNED AND OPERATED BY A SCHOOL OR SCHOOL\nSYSTEM PREFERS TO SUBSCRIBE TO ONLY THE IN-SCHOOL PROGRAMS, THEY MAY\nDO THIS UNDER A MODIFIED AGREEMENT. IN THIS CASE, THE STATION GETS\nALL IN-SCHOOL PROGRAMS, PLUS ONE HOUR A WEEK FROM THE REGULAR NETWORK\nOFFERINGS, FOR ONE-HALF THE FEE THEY WOULD NORMALLY PAY FOR THE FULL\nSERVICE. OF COURSE, THE CONDITIONS REGARDING POSTAGE PAYMENTS REMAIN\nTHE SAME.\nIf, AFTER YOU*VE HAD AN OPPORTUNITY TO LOOK OVER THE MATERIALS l*M\nSENDING, YOU HAVE ANY QUESTIONS ABOUT THE NAEB, PLEASE LET ME KNOW,\nAND WE * RE LOOKING FORWARD TO THE OPPORTUNITY OF SERVING YOU.\nS» ncerely.\nHarold E. Hill\nAssociate Director\nHEHsmk\nEnclosures 3"
}