{
  "id": "d573-68",
  "text": "Director of Radio, KGAC\nPage 2\nJuly 17* 1956\nscale has been set up whereby new stations do not pay the full fee until\nthe third year. Annual Network assessments are based on the same power\nclassifications as membership*\n1st year 2nd year 3rd year\nclass a tu&CTT ii>6roar ibrar\nClass B 250.00 375.00 500,00\nClass C 150.00 225.00 300.00\nIn addition, member stations must pay postage both ways on tapes shipped\nto and from the Network. For a station in your area this would amount\nto approximately $90.00 a year if you availed yourself of all the programs\nmade available by the network. (There is a strong possibility that there\nwill soon be Congressional action to lower rates for educational recordings,\nw ich would make postage payments considerably lower.) Even with the\npostage charges you see that the cost per hour of programming (for 4OO hours,\nor more) is very low.\nIn addition to the regular Network service described above (a sample\nNetwork offering is included in the material being sent separately),\nwe make available in—school programs to those stations who do in—school\nbroadcasting. For this service a station pays anadditional fee of one-\nfourth of the regular assessment, or $2.00 per reel, whichever is less.\nHowever, since many in-school stations are not on the air during the\nsummer months, such stations are allowed to substitute the in-school\nprograms for regular programs they would receive during the summer, and\nthus pay no additional fee for the in-school service. If a station owned\nand operated by a school or school system prefers to subscribe to only the\nin—school programs, they may do this under a modified agreement* In this\ncase, the station gets all in-school programs, plus one hour a week from\nthe regular Network offerings, for half the fee they would normally pay\nfor the full service. Of course, the conditions regarding postage payments\nremain the same.\nIf, after you've had an opportunity to look over the materials I'm sending,\nyou have any questions about the NAE. , please let me know, and we're\nlooking forward to the opportunity of serving you.\nSincerely,\nHarold E. Hill\nAssociate Director\nHEHtfflk\nEnclosures 3\nv"
}