{
  "id": "d573-94",
  "text": "1% 1956\nHr. U S. Immtoro\n133 Glen flmzi Hoad\nHSiAr Jinwn 13, taMsit\ni*®r **• tanlm\nI hasten to answer your letter of -eptaT&ar 17. sail to eangratulate you an your\nawodnt*#Bfc m Pmgram Dimeter of Puerto Rico’a : station VOfiaf,\nto mob oo the ateUon faooams a fuU TV letim mmt»r (application fame\nenclosed) which ooota 1100.00, you am eligible for the aewy oorvloos no provide\nfirm of charge to umber stations.\nOn Arae 15, our Associate Wmetor, Karoid I, iSill, wrote Hr. R. belgado-?toqi»E\nNoting firm hie letter«*ln reply to your letter of Juno 5, I am happy to tell\nyou 5 earn of the artmnUgm of expanding your rum mabsrehip to include your\nnew TV station.\n\"The greet mjaeity of wertofeops and seminars sponsored !y the mm in meant\nyears heee hem in the area of telerlaion. Ue ham conducted three ertneetienel\ntelevision Production Workshops, two TV inglaaerlng Workshop*, s TV Station\n•tewameat aaBdJW'. a 3mtamte to \"clarify and appraise the cmtrihution that\neducational television stations cm make to the service of the Sraarioan poonle.\"\nand hem awardad marly 100 srtmUrahlpa to persons engaged in vto^aotil\ntelevision to permit than to attend regular institutional workshops sad academic\nsessions. All of them projects bom hem designed to enable personnel at r»EB\nmsfier Institutions to inorease their profmeionsl anilities, and atlittla or\nno ooet to such persoonal or the institutions. This earner we am planning to\nhold a TV Pmgrm Planning leadaar and a TV Staging and lighting Uartcahep, and\nm tarn osponded mm Educational Television . dholarmip program as ia evidenced\nHr to* mm\n-i '- i'v, V ; ST1-* £/:• Ui »*.« TO-\nyou mod m&tomvtng adwtm9 cwr W Ktqptoeer. %•\nomm to mm to help yen, at m wqpmm to\nget yen* station an the air.\nmil IdlfKJk, wUl he glad to\nyour argardssati<»»\n.. ' ■. ■■■ Ol\"'-: X-i-Ol .\nperiodically, oemriac the latest roooaroh In the area of adueattanal television,\nttaw feneptag oar TV nmhees abromt of all demlapwitts in such fields ae the"
}