{
  "id": "d573-95",
  "text": "• I*# s*\n1% vm\n.__ , ^ 1 tool, offtetlw»aa of W, etc. Other publications\ndevoted espeoiaUy to ,T', such os the detailed roperto of the wca*shac» and\nindicated above which seew no valuable reference works on nroduotton\nand engineering. Also, we haw several ocmituwa wc*fctog on preporatton of TV\nwperta, and aery of> tfaw haw UwAr been published, such as •tonpmeation of\naealty 'bofrare far TV AR-seraneoa,* *Satosy .Scales of vdueational TV Stations,*\n■student and Staff Tretotog,0 ate. .-boh studios depend for their value on the\n“ of and traefulneoB to one TV ambers, of ocuvae.\n•This fell we hope to offer a\npamit then to carry on specific\nwith the Institute of '\nETV research projects.\nto amber inotitutions to\nprojeota In BW. Jo «toe cooperate\nat the ttatosrelty of EUtooto to\n*1 trust that thto brier reruns of our eotivittos to the tetoviaton field will\nprovide the tofenaction you requested, and under separate cover 1 m tmiAZae you\na «w we^loo of son, of theptoll-Am asattoartSeo. If you hWTSr\ntorthsr ^jsattons, please lot as knew, end we trust that you feel our ssrvtoea\ndtartogthe period iten you are getting your stetton on the air, and tharoaftor,\nwl'J™* n 8tatira>* 1 Bl0A. *“ that\ne^« • CT CP, to to ^oairtloalS*^ ^1S^^^,a^UtonSd^rttoce\nff® aetlw nenbartt to status and daw am baaed on the facility operated, owewr,\nrto»e you are not as stow to our operation, due to your location, end therefore\n*“8«t not aa were of the advantages of TV mriMrahto, or our procedures we tbour>rt\nwe should explain the situation to you now fully.”\nIt the licensee of WtHUTV is In Ol reapeeto the turn as that of Wim (am), no\nnew approval fur nmaharahto to neoeassnr, though we’d still to have ou\nblaniM miod out for listing of teohnioal facilities, staff, end for <*r\ntelevision Maker files. If the Itoawsee to not the sow, a separate npeiict-tm,\nto definitely necessary a*2 will be submitted to our Jw^Srshto^itSlnd\nteord for what I would ejqwet to be paraqpt approval.\nI£I nay add a Uttto to what nft wrote, I eight also (juste trm a totter\nfirm syself to aaether station! •Several stations have sent as easy aa 8 or 10\nstaff ambers to VIS) ;.-Ugtoa«rteg or Production ^ckahopo. werth as auoh aa\n.2,000.00 or *3,000.00 la Owenses, at no coot to them.*\n*i* ®* ehanael through which a dosan Foundotlona how channeled their funds\nfer services to educations! hraadoaettog (wn n,2SO£COM) so far.\n!f* **• P*1** a*\"* to «» fornatton of the JUSffi .’lieu\n1>tok 51111 **» «• «rat toncutlw Mraotor and iUBMnUw\nfialph Steatto the nest. It wee an IMS reemasndatton to tin fW \\/tAoh\nto the foraatien of the STRC. Uv fool that their strength and ours dtondoa\neach other, tfe haw felt that when • specialised group needed creating to do a\nspecialised job, we should so reoonroad, raaoiidtag ourselves the pmwaorit\npratoaslonel aaoociaUo«. »w dawlcpoents to the prafeoaional nsaociettan\nwill aloe soon he announced. flag are of son"
}