{
  "id": "d784-106",
  "text": "PROPOSAL ELABORATION\nNAEB—KELLOGG PROJECT\nJim Miles\n(NOTE:- I will put down in narrative form the arguments for and against\neach proposal — or the alternatives — and then state at the end which\nproposal I favor* and if I feel I can add anything, why I favor it.)\nNAEB TAPE NETWORK\n1. - One of the growing discussions centers around the exact service the tape net\nshould perform. There are several proponents for placing emphasis on the\n\"network1’ idea and all it implies — particularly immediacy and flexibility.\nThere is at least one exponent for even more advance planning than the net¬\nwork does at present — saying in effect why not plan a whole year in advance\n— or at least four months. This of course means that the network more\nclosely resembles a transcription ”service”. I111 not take sides in this\nargument for as a station manager I could use it either way. I would like\nto point out the economics of the situation. We are operating on a set\nbudget — to get the most out of that budget requires planning, planning the\nbest use of facilities and manpower. The best plan would call for 100$\nuse of time and facilities — this of course is impractical because it\nallows for no breakdowns or sicknesses. I would suggest therefore that we\nplan at about 1% capacity and allow the remaining 2$% of the time to take\ncare of breakdowns, sicknesses and for immediacy shows.\nPROPOSAL:- THE NETWORK MANAGER, SUBJECT TO THE APPROVAL OF THE EXECUTIVE DIRECTOR,\nSHALL DETERMINE WHAT QUANTITY OF TAPES CAN BE TURNED OUT AND SHALL PLAN ROUGHLY\nTft ON A \"SERVICE” BASIS AND 2% ON A ’’NETWORK” BASIS.\n2. - One of the knottiest problems connected with the network is the matter of\nprogram acceptance. The only solution seems to be a network acceptance\ngroup. This group should meet at least four times a year — and should\nhave mechanics set up for auditioning shows between meetings. The question\nhere is to get someone with mature judgment and the time to listen. Past\nacceptance committees broke down because we chose busy people — people who\ncould not take the time to listen. I suggest we take good program directors\nfor this assignment — three should do it.\nPROPOSAL:- THE EXECUTIVE DIRECTOR SHALL RECOMMEND TO THE PRESIDENT FOR APPOINT¬\nMENT TO THE NAEB TAPE NETWORK PROGRAM ACCEPTANCE GROUP REPRESENTATIVES OF THREE\nMEMBER INSTITUTIONS WHO ARE ACTIVELY ENGAGED IN PROGRAMMING.\nTHIS CROUP SHALL OUTLINE IN WRITING THE QUALIFICATIONS IT DEEMS ESSENTIAL\nFOR NETWORK ACCEPTANCE. THESE SHALL ALSO CONDUCT A STUDY TO DETERMINE % OF\nVARIOUS TYPES OF SHOWS TO BE OFFERED. THESE SHALL BE SUBMITTED TO THE NAEB\nBOARD OF DIRECTORS FOR APPROVAL."
}