{
  "id": "d784-114",
  "text": "DISTRIBUTION\nAs far as the network is concerned, you will receive THE JEFFERSONIAN HERITAGE\nas a part of the weekly shipments from headquarters* As you know* under the\nsystem headquarters mil serve directly each station of the network and all st&Uons\nWill return tapes to network headquarters© PLEASE DO NOT CONFUSE PACKAGE $9 WITH\nPACKAGES #7 AND #8 WHICH WILL CONTINUE TO BE BICYCLED UNTIL IHET HAVE COMPLETED\nTHEIR PREVIOUSLY ARRANGED SCHEDULESo\nPackage #9 will leave headquarters on or about September S' for each member station©\nIt is for use by you during th© week of. September lit© Subsequent mailings will be\nmade from headquarters at weekly intervals© This applies to the entire package of\nwhich THE JEFFERSONIAN HERITAGE is a part©\nAs George Prdbst has said. THE JEFFERSONIAN HERITAGE is an tfenduring program©rj\nHe means by this that it csn be played five or ten years from now and have as.\nraucli meaning as it does today* This undoubtedly means that you will want to keep\nTHE JEFFERSONIAN HERITAGE as a part of your permanent tape library©\nThere was no money available in the FAE grant, to enable us to give you these\ntapeso The cost of giving you these tapes from headquarters Is* of course*\nprohibitive (70 x 13 x $3,00-$2730)© We* therefore, have* only these tm\nsolutions i First* you keep the ’tape you receive from the NAEB Tape No.wrk md\nreplace it with a new Scotch taps from your supply^ or, second- you to to your\nown tape this series of programs and return th© tapes you get from the network to\nheadquarters©\nBecause of the large number of tapes headquarters must handle mch week. It »U1\nbe impossible for us to keep many of the records we have kept in the past, On#\nrecord, however, will be faithfully kept. We will know how may ty.es have bey\nsent to each stati.cn and tow many tapes have been returned. Should any station\non the network fail to return the tapes promptly after using then* we mXl ax\nnecessity have to discontinue service to that station until the tapes are returned,\nOTHER USES OF THE JEFFERSONIAN HERITAGE\nHAEB Tape Network stations my make THE JEFFERSONIAN HERITAGE tapes available for\nnon-broadcast use. This mens they may baooi® a part of your local tape library®\nend they may be used before civic groups, assemblies, or in individual classrooms.\nAny broadcast use of THE JEFFERSONIAN HERITAGE tapes on non-NAEB Tape Network stations\nis strictly prohibited© Such broadcast rights can only be authorized from head¬\nquarters and will only b© granted to those non-NAEB Tape Network stations which\npurchase from NAEB a sat of Columbia l«p© transcriptions of the ®eilaa© 'Ihose\nsets will be sold at the nominal price of $2^,00© These will not be avails .\nbefore mid-October or early Novenber© Hence* the only release of the series at\nthis time will be on NAEB Tape Network stations*"
}