{
  "id": "d784-119",
  "text": "Mr. Jim Miles\n2\nAugust 11, 1952\nIn reviewing the annual report materials in light of the original\nproposal we could not help but wonder what progress has been made toward\nthe accomplishment of Purpose 3 as stated on Page 14, i.e.,\n\"3. To improve the management and upgrade the personnel of educa¬\ntional stations:\nIt is proposed to help the educational broadcasters, by means\n^ of conferences, fellowships, and related devices, to train ade¬\nquate personnel;\n, It is proposed to concentrate some expert attention on the\n\\problems of educational station management;\nIt is proposed to help these stations develop audience on\nthe effect studies by which to judge their performance and\nredirect their planning.,”\nIn studying the distribution of the stations now participating in\nthe tape network it is not clear as to why so few in the New England\narea and the Southern region are participating. Is there a relationship\nbetween the stations participating and the contacts made directly or\notherwise by the staff? We are pleased to know that the staff will be\nable to circulate more widely this year.\nWe hope you will not misunderstand this next question, but feel\ncompelled to raise it with you: Is there any possibility that the central\nstaff of NAEB is likely to become so involved in the \"many and varied ac¬\ntivities\" of the (NAEB) Board that it will fail to accomplish the ob¬\njectives agreed upon in the original proposal to the Kellogg Foundation?\nYou may feel that this is^a valid question but it stems from a concern\nthat we have about this program. In the original proposal we were concerned\nwith the development of a cooperative relationship involving radio, publi¬\ncations and extension service with the view of bringing to rural people a\nbetter and more varied kinds of educational offerings. We hope this par¬\nticular purpose might be worked on in great detail in the years ahead\".\nThe financial statement as of May 31, 1952 submitted by the Uni¬\nversity of Illinois has been received and is approved by our auditor on\ncondition, of course, that we receive, when the final figures are available,\na supplementary report to coincide with the University fiscal year closing\nas of June 30, 1952. Acting on the request made in the annual report, we\nare enclosing a check in the amount of $50,500.00, which fulfills the\nFoundations commitment for the second year of the program:\nWith all best wishes.\nSincerely,\nXrsSP-'\nEnc.\nHBM\nRVD\nHugh Masters\nRobert Van]\n_"
}