{
  "id": "d784-121",
  "text": "MEMO\nSw>\nTO: Robert VanDuyn, W. K. Kellogg Foundation\nFrom: Frank E. Schooley, Treasurer, NAEB\nRe.: Proposals to expand the W. K. Kellogg Foundation support\nto N. A, E. B. for 1953-5**# either by transferring funds\nfrom the 1954-55 budget, or by supplying new funds.\nNew Tape Duplicator for the NAEB Tape Network $ 9,900.00\nThe Network has grown to such size that it is\ndifficult to give satisfactory service to all\nmembers at all times, and Network size continues to\nincrease. Specifically, it is proposed to secure\nanother Tape Duplicator, same size as the present\nmodel, to (1) expand the program offerings\nby about 50%9 (2) to give greater flexibility to\nmembers in selecting programs for use, (3) to have\nfacilities for special timely programs which is not\npossible under present capacity operations, and (4)\nto provide for emergency operations, should the one\nand only present Duplicator need repair.\nAdditional Tape Supply for the NAEB Tape Network 5#000.00\nThe growth in size of Network and amount of\nservice rendered has far exceeded the original\nestimates. The Network has never had ample supply\nof tapes for efficient operation. This has been\nsimply an underestimate of needs for such type of\nservice.\nAdditional staff for Headquarters to give service\nto increasing demands of educators and educational\ninstitutions in both radio and television. 18,400.00\na. Associate Director - To provide program and\nstation management consultation services to the\nstations now operating, (2) to arrange further\nexchange of ideas between stations, (3) to\nencourage development of new educational stations,\nand (4) to encourage the educational utilization of\neducational radio programs by schools. ($8,000)\nb0 Arsociate Director - The same type of services\nfor television as indicated in *a* above. This is\nan area where service is needed, where NAEB must\nfill the gap. This person would place emphasis upon\nprogramming needs. ($8,000)"
}