{
  "id": "d409-10",
  "text": "NATIONAL ASSOCIATION\nOF EDUCATIONAL B\nROADCASTERS\nBox 2002\nUniversity, Ala*\nDr* Laurence F. Kinney, Coordinator\nMemphis Adult Education Center\nSouthwestern Ctmpus—2000 North Parkway\nMemphis 12, Term*\nDear Dr* Kinneyi\nMarch 30, 19$k\nMl K 1 lbo4\nam\nrj o v PM\n11VI i(i®11,11121112| 8| 4| SjG\ni\n1 am without a secretary today, but shall answer your letter on\nmy own*\nTour problem appeals to me—making models of possible programs for\nuse as samples in your drtve— and I think it a wonderful idea;\nhowever, NAEB has no funds for this type of project* Actually,\nnone of the organisations working in this field has funds for such\na project—though we might wish to make grants for this purpose*\nI know how helpful it would be to have some home-made samples to\nshow*\nEarl Wynn and the communications staff at the University of North\nCarolina, through the chancellor and president, no doubt, secured\na donation of #12,000.00 from one of the commercial broadcasters\nin the state to rent kinescope recorder* and television cameras\nfor the same type of project you have in mind* Da less than two\nweeks they recorded thirteen fifteen to twenty minute programs and\nused them as samples of what they could do on TV* Tou might try\na similar approach in your state—ask for funds from a coimercial\nbroadcaster or from some other source* I just don't know of any\nfoundation or branch thereof which would consider a request of this\nkind, but you should be able to secure a small grant from someone*\n(I always believe that money can be found for worthwhile projects*)\nThe JCET, the NCCET, the Southern Regional Education Board, and the\nNAEB could all provide you with free consultation service for a\nlimited time in your drive—such as the kick-off day and night—\nSS aald\navailable oo help you plan the campaign! however, from xry conversations\nwith Nighbert and Price, I'd say your plans are very soundly laid\nalready. Please, let me know if NAEB can help.\nThis Is not too helpful, but I did want you to know that I think the\nidea is very sound indeed and that I believe funds can be found in\nthe state to do the dcib. Have you canvassed the local, small\nfoundations? Sometimes these little foundations have ten to twenty\nthousand dollars with which to support a local project and they\nare easier to interest than the national ones*\nSincerely yours."
}