{
  "id": "d409-139",
  "text": "The Legend of\nSleepy Hollow\nAnother literary classic, this one from the capable\npen of Washington Irving, is presented in full\nanimation. Ichabod Crane, the Headless Horseman\nand the other characters of this well-known story\ncome alive once again. This program includes an\naccurate biography, also in animation, of the\nauthor, one of our first important\nAmerican writers.\nMan and the Moon\nLast year’s television program, “Man in Space,”\nset the stage for this picturization of one of man’s\nlong-standing dreams. The earlier program\ndetailed the establishment of a man-made satellite.\nThis program goes on from there to show man\nfully accomplishing the dream—a visit to the Moon.\nThese programs are known as “Science-Factual”\nproductions for the subject matter is based upon\nthe most accurate research available.\nUncle Remus\nAnother great American literary figure and high¬\nlights from his best known works will make this\nprogram a memorable one. An animated biography\nof Joel Chandler Harris serves to introduce some\nof his marvelous fables as told by Uncle Remus.\nThe years go by and the activities of Brer Rabbit,\nBrer Fox and the others become oft-told tales,\nbut never have the basic morals of these stories\nbeen more apt or more current than they are today.\nThe Olympic Elk\nThe mist shrouded high country of the Olympic\nPeninsula in Washington is the setting for this\nAcademy Award winning True Life Adventure\nnature drama. Here is the home of the majestic\nOlympic Elk and here is his story. Certainly few\ncreatures of nature enjoy the respect of man as do\nthese handsome animals. Their annual hazardous\ntrek to the high country in search of food is the\nkey sequence to this nature drama.\nRobin Hood\nAnother literary adventure classic—itself a collec¬\ntion of near-legends about a near-legendary figure-\nserves as the basis of two programs. Filmed in the\noriginal Sherwood Forest with English players,\nmany native to the area, Robin Hood once again\nis afoot to right the wrongs of a cruel, conniving\nEnglish king. The Disney production crew drew\nheavily upon British archives to insure accurate\nreference material about the times and\ncustoms of Robin’s day."
}