{
  "id": "d409-140",
  "text": "Another of the famous legends surrounding this\nAmerican historical character is the epic keelboat\nrace down the Mississippi. Mike Fink, “king” of\nthe keelboat captains who plied the Ohio and\nMississippi Rivers, is Davy’s stalwart opponent in\nthis hectic race from Maysville, Kentucky, to\nNew Orleans. Here is an unusual race, for only\nsuch greats as Davy and Mike would attempt\nto put the heavy river cargo boats into\na competitive contest.\nFilmed in the Kentucky bluegrass region, “Stormy”\nis a factual story about a horse who “didn’t\nbelong.” Foaled, by a trick of nature, at the wrong\ntime of the year, this little thoroughbred was\ndenied the glory of the racetrack but proved his\nworth and breeding as a polo pony. This is the story\nof a colt who overcame his inferiority complex\nand the understanding people who recognized\nhis true worth.\nFew Disney classics have warmed more hearts\nthan has the story of the little elephant with the\ntremendous ears. His rise from the depths of\nridicule to the pinnacle of success is a circus story\nof rare charm. The shrewd guidance of his friend,\nTimothy the mouse, and the deep enduring love\nof his mother combine to assist Dumbo over every\nobstacle in his rise to fame. This program is\nproduced in full animation.\nThe directors of the True Life Adventure series are\ncontinually impressed with the importance of\nthe problem of survival in nature. This program\nhas been prepared especially to study this theme.\nLife itself is the hero of this program which falls\ninto three sections. First, there is the struggle for\nfood and shelter—then come the wars between\nthe species—and finally, nature’s insurance for\nsurvival, the birth of new generations.\nJiminy Cricket, himself a Disney star, tells the\nall-cartoon story of Bongo, the bear. No routine\nbear is Bongo, star performer of the circus. He\nlongs to leave the bright lights, the roar of the\ncrowds, and return to his natural surroundings in\nthe peaceful woods. But civilization has taken its\ntoll and Bongo finds himself ill-equipped to readjust\nto what should be his natural environment."
}