{
  "id": "d409-144",
  "text": "International\nNewsreel\nForeign\nCo rrespondents\nThe Scamp\nWhat I Want to Be\nSeries\nCartoon\nof the Day\nThree times each week a bona fide newsreel for\nyoung people will appear. Utilizing the many\nDisney photographic teams already in many\nparts of the world on nature film assignments\nand augmenting these with other special newsreel\nexperts, the “International Newsreel” will pic-\ntorially report the world of young people—\nchildren at work and play, doing things, accom¬\nplishing things all over the world. We hope\nthese pictorial reports will tend to increase our\nchildren’s understanding of children in other\nparts of the world.\nThe MICKEY MOUSE CLUB has its own\nforeign representatives. First in this series are\nreports from the “foreign correspondent”\nstationed in England. From London an American\nboy, son of an American diplomat, takes his\nviewers on a tour of this famous city. His report\ncovers the Wax Works of Madame Tussaud,\nthe changing of the guards at Buckingham,\nCovent Gardens and all the other wonderful\nthings in this historic city. Similar reports will\ncome from “correspondents” based in Japan,\nItaly, Spain and other countries.\nThe role of a “working sheep dog” in connection\nwith sheep raising is an important one. This\nis the real story of one particular collie we call\nThe Scamp. The willingness to be trained and\nthe intelligence shown by these “working dogs”\nis underscored in this series of films which will\nbe presented as four 15-minute segments.\nNUMBER 2. THE DAIRY FARMER\nThe second “CAREER” story in the “WHAT\nI WANT TO BE” series will deal with the\nmodern dairy farmer. Farming, today, is a highly\nspecialized vocation requiring many skills.\nNo type of farming better represents this situa¬\ntion than the modern dairy farmer who must\nhave a knowledge of weather, soil care, animal\nhusbandry, mechanical equipment and many\nother subjects. Ten 15-minute units will be\ndevoted to this story.\nCertainly, room must be found for Donald Duck,\nPluto, Goofy and the other colleagues of Mickey\nMouse who have so many friends throughout\nthe world. This portion of the program provides\nthis opportunity.\nEach day, from a remarkable “Treasure Chest,”\na group of Mouseketeers will select a short\ncartoon, a particular favorite of theirs, to share\nwith their viewers.\nTWO-GUN I\nl MICKEY#"
}