{
  "id": "d409-150",
  "text": "Over-all Format:\nIn this series Jiminy Cricket presents facts about the human body and its 5 SENSES which\nrelate to the 5 TITLES listed below. Interesting examples of the way the senses function in some\nanimals and insects are included also.\nJiminy Cricket’s “Discovery:”\nJiminy says, “Do you know how I know all these things? I get them out of books. You can find\nanything you want to know from books.”\nJiminy Cricket’s Song:\ni^n\nf£«.l\nJEl.\n'ioo\nJ .\nmi . MAL! -\na?£\n^(7D(T)\nN j \na 1 j -x\nVf 'Psi A* noi \"Wff-V\nfan Sod A p£\nON. lS\n ffi)\ntT>)\n!.J J j 1 I 1 J IfiJ j • J J -\"-f.v~z^=\nft. Nl. MAI _ VINO CAN lUtNtl, MO CAN TEA. SON, MO CAN T£Ab‘-\nThe Human Animal:\nProgram: You’re a human animal, a special kind of animal. There are some things other ani¬\nmals do better than you. Some see better. Some hear better and some are stronger, but you’re\ndifferent. You can learn to think and reason, to speak and sing. A bird can sing, too, but you\ncan learn to read music and form words. A bird can’t do that.\nScientists call the human animal “Homo sapiens”—wise man. Through native intelligence\nman learned to train and make use of animals for his own benefit. Man can live almost any¬\nwhere because he can adapt to his surroundings. Also, you have a remarkable hand with a flex¬\nible thumb. Man, with his workable hand —using intelligence and imagination —can make tools,\nbuild homes, factories and space ships and yo-yos.\nThe Five Senses:\nProgram: Did you know you’re an animal, a human animal? You are and you’ve got\n“auditus,” “olefactUs,” “gustus,” “visus” and “tactus”! But don’t worry about it—’cause in\nEnglish that means the five senses, HEARING, SMELLING, TASTING, SEEING and\nTOUCHING.\nOther animals have five senses, too, but you use thought and reason along with your five\nsenses. In most cases, man’s sense of HEARING isn’t as well developed as other animals. But\nman has created a radar system for his own protection. Man’s sense of SMELL is far less\ndeveloped than most animals, but only man has a nose projecting out of his face. Man has the\nmost cultivated TASTE of all animals. He likes his food to look good as well as taste good.\nSIGHT is man’s most important sense. Through inventions such as the periscope, man has\nincreased his power to see. The sense of TOUCH helps man and other animals to live more safely.\nAll of this suggests another sense — not one of the big five — but very important —\nthe sense of humor. Don’t ever lose it.\nThis “Tele-Digest” has been prepared by Mrs. Margaret Divizia, Supervisor\nin Charge, Audio-Visual Section, Los Angeles City Schools.\nCopyright 1955 Walt Disney Productions\nAll Rights Reserved Printed in U.S.A."
}