{
  "id": "d409-154",
  "text": "TELE-DIGEST*\nfor “THE OLYMPIC ELK”\nA TRUE-LIFE ADVENTURE NATURE DRAMA\nOther Animals Shown: BEAR, MOUNTAIN GOAT, MARMOT\nWild Flowers Shown: LILLIES, BEAR GRASS, VIOLETS,\nINDIAN PAINTBRUSH, DAISIES, AVALANCHE LILLIES\nProgram Content:\nIn the northwest corner of the United States, jirtting out from the coast of Washington, the\nOlympic Peninsula separates Puget Sound from the Pacific. Here in this vast, virgin wilderness\nlive the Olympic Elk.\nEach spring these majestic animals migrate from their winter home in the lowlands to their\nsummer grazing grounds high among the topmost peaks.\nThe Olympic range is as rugged as any in the world. The winter snows are extremely heavy.\nWith the coming of spring, the air is filled with the sounds of rushing water. Now, instinct reminds\nthe elk it’s time for their trek to the high country.\nThe bulls usually leave about two weeks before the rest of the herd. The cows wait until the\nnew calves, which are generally born in June, are strong enough for the strenuous trip. As the\nherd gathers for the long trip each calf stays close to its mother and each family has its place\nin line.\nThe long and hazardous journey takes about a month. When at last the goal is in sight the herd\nfinds a new burst of energy. Mothers and youngsters alike scamper gaily across the snow fields.\nStrangely enough, this alpine country is a wonderland of wild flowers which are uncovered by\nthe melting snows. During the summer the herd will graze and rest on the quiet, remote slopes.\nMeanwhile, the arrival of the cows and calves has left the bull elks quite undisturbed in their\nbachelor quarters along the high ridges. There is plenty of grass and water and so for the\nmoment at least, they are satisfied. So the summer passes\npleasantly for all.\nBut; with the approach of autumn, the tranquil scene\nchanges for the mating urge drives the bulls out of seclu¬\nsion. There’s tension in the air. Soon the mountains echo\nwith the wild bugling of the Olympic Elk. Now, each\nmale begins to round up as many cows as he can find and\nto fight to try and protect his harem from the challengers\nwho begin to gather. Sometimes, in the grim battles that\nensue, both the challenger and challenged die.\nSoon, winter begins to take possession of the high\ncountry. The excitement of the mating season passes, and\nnow the Olympic Elk begin their long trip back to their\nwinter quarters in the lowlands.\n* This “ Tele-Digest” has been prepared by Mrs. Margaret Divizia, Supervisor Copyright 1955 Walt Disney Productions\nin Charge, Audiovisual Section, Los Angeles City Schools. A11 Ri^hts Reserved Printed in U- S-A."
}