{
  "id": "d409-156",
  "text": "' * — ^\n— jpa\nA'\n^Jisncijland\nPROGRAM\nSCHEDULE\nSeptember 14, 1955, through January 25, 1956\nNotes: (1) The nature of television is such that even \"firm\" program schedules on occasion\nare changed sometimes for reasons beyond anyone's control. We suggest this schedule be\nused as a guide but also urge that specific program dates be confirmed by referring to local\nnewspaper TV Logs or by contacting the ABC television station in your area. (2) A memor¬\nable book is worth rereading, and an unusual story is worth retelling, and a notable TV\nprogram is worth reshowing. This we have learned from our viewers. And this explains\nwhy, on occasion, some of the more popular Disneyland television productions\nare brought back.\nPROGRAM 1. SEPTEMBER 14, 1955\n\"DUMBO\" Special television version of the cartoon\nfeature \"DUMBO\"—the story of a baby elephant who\ndiscovered he could fly.\nPROGRAM 2. SEPTEMBER 21, 1955\n\"THE OLYMPIC ELK\" and \"BEHIND THE TRUE-\nLIFE CAMERAS\" Disney naturalist photographers\nfocus on strange desert ants and African game animals.\nOn the same program, \"THE OLYMPIC ELK\" premiered\non television.\nPROGRAM 3. SEPTEMBER 28, 1955\n\"BONGO\" Jiminy Cricket tells the all-cartoon story\nof Bongo, the performing bear who seeks to return to\nhis native haunts.\nPROGRAM 4. OCTOBER 5, 1955\n\"TIBURON,\" \"MOROCCO\" & \"SARDINIA\" A\nfactual program, offering selections from several films\nin the \"People and Places\" series. These films depict\nthe daily life of little-known people in isolated places.\nPROGRAM 5. OCTOBER 12, 1955\n\"ADVENTURES OF MICKEY MOUSE\" A retrospec¬\ntive review of the career of a great Disney character.\nHighlights and high points in Mickey's march to success\nconclude with him starring in \"Jack and the Beanstalk.\"\nPROGRAM 6. OCTOBER 19, 1955\n\"STORY OF THE SILLY SYMPHONY\" The Ameri¬\ncan public has always been particularly fond of that\nspecial group of Disney theatrical shorts known as\n\"Silly Symphonies\" which rely heavily on music (rather\nthan dialog) to support the picture.\nPROGRAM 7. OCTOBER 26, 1955\n\"THE LEGEND OF SLEEPY HOLLOW\" Washington\nIrving's literary classic involving Ichabod Crane, the\nHeadless Horseman and the other characters who\npeople this famous tale.\nPROGRAM 8. NOVEMBER 2, 1955\n\"THE OLYMPIC ELK\" and \"BEHIND THE TRUE-\nLIFE CAMERAS\" An opportunity to see, or to see\nagain, this Academy Award winning nature drama.\nPROGRAM 9. NOVEMBER 9,1955\n\"ROBIN HOOD\" This film, produced in England with\nan English cast of players, will be presented in two\nparts. Part I appears on this program.\nPROGRAM 10. NOVEMBER 16, 1955\n\"ROBIN HOOD\" Part II of the daring exploits of\nthe ruler of Sherwood Forest. Joan Rice and Richard\nTodd are respectively, the fair Maid Marian and the\nbrave Robin.\nPROGRAM 11. NOVEMBER 23, 1955\n\"DAVY CROCKETT AND THE KEELBOAT RACE\"\nA legendary contest staged by Davy Crockett and\nMike Fink. An unusual race which requires all the\nstrength and ingenuity these two stalwarts possess.\nPROGRAM 12. NOVEMBER 30, 1955\n\"STORY OF THE ANIMATED DRAWING\" By uti¬\nlizing especially selected sequences from screen\nclassics Disney traces the evolution of the animated\ndrawing from cave walls to present times.\nPROGRAM 13. DECEMBER 7, 1955\n\"THE GOOFY SUCCESS STORY\" Fired with ambi¬\ntion, Walt Disney's cartoon hero. Goofy, succeeds in\nachieving screen stardom from a standing start.\nPROGRAM 14. DECEMBER 14, 1955\n\"DAVY CROCKETT AND THE RIVER PIRATES\"\nDavy and Mike Fink join forces to clean out river pirates\nalong the Ohio in another legendary Crockett tale.\nPROGRAM 15. DECEMBER 21, 1955\n\"DUMBO\" A chance to enjoy the heartwarming story\nof the little elephant with the king-size ears.\nPROGRAM 16. DECEMBER 28, 1955\n\"MAN AND THE MOON\" A \"science factual\" story\ndetailing man's accomplishment of a long-standing\ndream, a space flight to the moon.\nCopyright 1955 Walt Disney Productions\nAll Rights Reserved Printed in U. S.A."
}