{
  "id": "d409-36",
  "text": "con\n<Ljb>epartment op 4udio -\nNATIONAL EDUCATION ASSO\ni.o°te\nOfficers and National Delegates\nLEE W. COCHRAN, President\nWALTER A. WITTICH, Vice-President\nDirector, Bureau of Audio-Visual\nInstruction, University of Wisconsin\nJljj}llWWlllM4ltt lo-'\nMEMORANDUM TO:\nMarch 30, I!\nMembers of Buildings and Equipment\nCommittee and Consultants\nVisual Communication Review\nWILLIAM H. ALLEN, Editor\nUniversity of Wisconsin\n1312 West Johnson Street\nMadison 6, Wisconsin\nPAUL W. F. Win, Past President\nProfessor of Education, Teachers\nCollege, Columbia University\nA. J. FOY CROSS\nDirector, Personnel Services,\nNew York University\nFROM:\nSUBJECT:\nAnna L. Hyer, Director of Studies\nBrochure No. lj, Audio-Visual Service in Colleges\nand Universities\nIRENE F. CYPHER\nteWfc^fEducation' Thank you very much for your criticisms and suggestions on the second\nrough draft of the proposed brochure on audio-visual service in col-\namodebernardis leges and universities. You will note that a rather complete revision\nPortland1 (o!?e.)°Pubhe\"schoois has been made in an attempt to incorporate your ideas.\nCARLTON W. H. ERICKSON\nDirector, Audio-Visual Aids Center,\nUniversity of Connecticut\nELIZABETH GOLTERMAN\nDirector, Division of Audio-Visual\nEducation, St, Louis Public Schools\nL. C. LARSON\nDirector, Audio-Visual Center\nIndiana University\nFRANCIS W. NOEL\nChief, Bureau of Audio-Visual\nEducation, California State\nDepartment of Education\nNational Staff\nj. j. McPherson\nExecutive Secretary\nANNA L. HYER\nDirector of Studies\nFLORENCE IH-CHI FAN\nAdministrative Assistant\nMARY C. WELCH\nAdministrative Assistant\nEnclosed is a copy of the third rough draft. Actually, this is a\nthird draft of Parts I, II, and IV and a first draft of Part III and\nthe Appendix. In fairness to the consultants who have prepared spe¬\ncial sections of Part III, it should be stated that they had not had\nan opportunity to study the complete second draft or, in some cases,\nthe preceding brochures in the series.\nThis is your last chance to criticize this manuscript. The writing\ncommittee will make one more revision following the DAVI Convention,\nwhich will be held in Los Angeles, April 18-22. The committee expects\nto go to press very shortly after this date.\nPlease read Hie manuscript carefully and feel free to state your\ncriticisms and suggestions frankly. As it stands, the publication\nTilth the illustrations which are planned will run to about 1^0 pages.\nThis is very long. If you think that parts should be omitted, so\nindicate. The committee hopes that you will give the Bibliography\nand other parts of the Appendix special attention, since this is\nyour first and last chance to comment on this part of the manuscript.\nMany of you have submitted pictures. An analysis is now being made\nto see what picture needs have not been met* Any of you preparing\npictorial case studies of your audio-visual service should notify us,\nso that this information can be included in the Bibliography.\nYou may write your criticisms directly on the rough draft and return\nall or parts of the draft. Please send in your criticisms by April 2£.\nALH :MMS\nEnclosure"
}