{
  "id": "d409-45",
  "text": "8\nthe place of use and returned following use. Once back in the center, the ma¬\nterial is inspected and, if need be, repaired. It is then placed in ready-\nstorage for the next Customer.\"\nMost centers prefer not to make direct charges for the use of materials\nor equipment to college faculty or their departments. The university as a\nwhole accounts for this service as it does for its library, and only necessary\ninternal accounting records are kept within the center itself. The advocates\nfor ’’free” campus service say that the requirement of complicated booking re¬\nquests, which involve instructors with the red tape of campus purchase orders;\nbills; statements; and invoices, tends to discourage use of audio-visual ma¬\nterials and equipment® Per unit cost of distribution is also increased.\nA center, planning off-campus circulation of materials, must provide some\nstaff and facilities beyond that needed for campus service. A more conplicated\nsystem for confirming orders, a more extensive shipping and receiving department,\na billing and accounting procedure, and more correspondence is involved.\nProduction\nMany materials needed in college curriculums are so specialized that it is\nnot economically sound for commercial firms to produce them. Many other needed\nmaterials, such as charts; graphs; and posters, are expendable. The college is\nfaced with the alternatives of using materials not specifically designed for\nthem, he king their own, or doing without.\nThis situation points to another rapidly expanding service area of college\naudio-visual centers. The center staff, with the help of the instructors and\nstudents concerned, are increasingly called upon to plan and produce material\nthat exactly fits a particular instructional need.\nProduction should not be viewed as necessarily an expensive undertaking.\nMany inexpensive materials can be easily prepared which are excellent teaching\ntools. In starting production services, it is best to introduce only services"
}