{
  "id": "d409-47",
  "text": "10\nclassroom instruction and in research.,\nFurthermore, it is now recognized that the development of simple skills\nin the production of audio-visual materials is an important part of the pro¬\nfessional education of teachers. The use of the center’s production facilities\nand guidance in the development of these skills by the center’s staff is an\nessential part of the laboratory experiences in the preservice education of\nteachers®\nGraphic Arts Service - The graphic arts service is probably the least\nexpensive and the most versatile part of the production service. The demand of\nteachers and student body groups is increasing for professional help in the\npreparation of inexpensive materials involving wet and dry mounting; layout and\nproduction of bulletins, brochures, and displays; brush and airbrush retouching;\nposters, graphs, and charts; illustrations, general art work, and lettering;\nplanning and production of handmade slides; titling of motion pictures; and\nnumerous other activities.\nAudio Service - Production facilities in the audio area are also essential\nto the functions of the center. Good quality portable tape recorders permit\nthe recording of instrumental and vocal music, lectures and group discussions,\nvoice correction exercises, foreign language practice, stenographic exercises,\nscripts to accompany locally-produced slide sets or filmstrips, and the like.\nAltho much of the material recorded on tape is of short-term usefulness,\nsome is of long-term value. Many institutions are developing tape recording\nlibraries of such programs. The demand for re-recordings, from ’/the masters in\ntape libraries is expanding rapidly. Many colleges now are offering re-reeord-\ning service at a nominal fee to organizations within their service areas.\nCenters in some institutions have found it advantageous to install some¬\nwhat more elaborate equipment and facilities, such as those which will permit\nhigh fidelity recording or the production of sound tracks for motion pictures"
}