{
  "id": "d409-51",
  "text": "Ik\nassistants for routine clerical work, for equipment and materials maintenance,\nfor projectionist work, for equipment deliveiy, and for assistance in specialized\nareas, such as graphic arts and photography.\nLarger colleges and universities must add to this basic staff, personnel\nwith special competencies, such as photographers; radio technicians; television\nproducers; graphic artists; film librarians; booking clerks; bookkeepers;\nequipment repairmen; motion picture cameramen; and others*\nRegardless of the size of the center or the scope of its operations, the\ndirector should be a dedicated, dynamic educator. He should be professionally\ntrained in the audio-visual field and should have had practical intem-type\nexperience as a part of his graduate work in a training center or as a director\nin a city or county audio-visual program (_, __). The professional prepara¬\ntion required of the director, as well as the salary, workload, and academic\nrank assigned him, should be comparable to other leadership positions on campus.\nExperience has shown that this is essential if the college is to realize the\nmaximum gain from its investment in an audio-visual center.\nTwo decades or more of trial, success, and error have determined certain\ngeneral characteristics of the competent audio-visual director. Other special\nqualifications, knowledges, and skills are demanded, depending on the nature\nand purposes of the college and upon the staff which assists him.\nEducational Leadership\nThe director should be a professional leader who makes the most of every\nopportunity to enhance the creative abilities and skills of the faculty by\nmaking readily accessible a rich supply of carefully selected instructional\nmaterials. He is alert to the possibilities for service to the instructional\nprogram of the college and community.\nIn his role he must be a democratic leader who inspires confidence and\nstimulates others to action. The kind of service rendered by the staff de¬\npends upon the spirit of service which motivates the director. The honest"
}