{
  "id": "d409-53",
  "text": "16\nOrganizational Patterns\nIt is important that the audio-visual center and its director be directly\nresponsible to the president of the institution rather than to any one college\nor college department* In large universities the director may report to the\ndean of instruction, the vicepresident, or a council of deans rather than di¬\nrectly to the president. Of the several possible administrative relationships,\nsuch a pattern is the one which largely eliminates interdepartmental difficul¬\nties and is the one most likely to enhance the service function of a center.\nThe history of audio-visual centers in colleges has been relatively short.\nEarly centers rather grew up like Topsy under the supervision of whatever de¬\npartment was most interested at the time in better instructional practices or\nbest able to finance the center. The administrative practices fell most fre¬\nquently into these four types: audio-visual center under (a) extension divi¬\nsion, (b) institution president, (c) school of education, (d) library. Experi¬\nence shows distinct advantages in having the center directly under the presi¬\ndent.\nOn many campuses there will be special instructional facilities, involv¬\ning audio-visual equipment and materials; for example, modern language, read¬\ning improvement, speech, and instructional materials laboratories. Because\nthese facilities are tied to the teaching function of specific departments or\nschools, they are usually not under the administration of the audio-visual\ncenter. The center director may, however, be consulted concerning equipment,\npurchases, and installations. Some of these specialized facilities are de¬\nscribed in Section III.\nII. HOUSING BASIC SERVICES\nEven a skilled leader cannot adequately discharge his responsibilities\nunless the administration and faculty are also interested in providing the\nbest learning environment for students. The administration must provide\nsufficient personnel with sufficient time to carry out the service objectives."
}