{
  "id": "d409-63",
  "text": "26\npart of these tables. A number of electrical outlets and radio and television\nantenna outlets should be located conveniently near these tables.\nThe facilities needed in the equipment storage and repair area will include:\nexhaust fan; tool kit; test equipment for tubes and meters with racks or shelves\nfor storage; drawers of different sizes; metal shelving; work tables; film clean¬\ning machine; electrical tools; seilloscope; test films; film splicing and rewind\nequipment; visual or location record board; film sound detector.\nRecommended space allocation for storage, maintenance, and distribution of\nequipment: an area of 1600 sq, ft. is adequate for a school of 1000 students.\nd. Shipping and Receiving - The center should have adequate shipping and\nreceiving facilities. The space for shipping and receiving should be on the\nground floor, be near the materials and equipment storage areas, and have ready\naccess to the rear exit of the building. This rear exit should open onto a cov¬\nered porch or platform from which deliveries and shipments may be made in all\nweather with a minimum of lifting and carrying and with maximum protection of\nshipments. The platform should be the height of the vehicles used for transpor¬\ntation and have ramps for hand trucks. Some centers are built to allow delivery\ntrucks to drive directly into the shipping area.\nThe centers shipping and receiving area must accommodate such activities\nas with drawing materials and equipment from the storage areas upon receipt of\nrequests or booking slips; easy and quick transfer to the shipping area; wrap¬\nping or boxing for shipment; preparing and affixing shipping labels; weighing,\ncalculating, and applying postage; keeping complete records of outgoing orders;\nchecking and initiating follow-up procedures on overdue shipments; checking\nmaterials and equipment in; and transporting it to the inspection and repair\narea.\nThe following types of equipment and facilities are needed in the shipping\nand receiving areas storage for shipping cases; file for shipping records;\npostal scales; hand cart delivery trucks or wagons; storage for supplies; large"
}