{
  "id": "d409-79",
  "text": "such equipment is necessary for the smooth operation of reading clinic\nclasses or small group work. If the clinic serves a large percentage of the\nstudent body over a yearly period, certain equipment should be permanently\nhoused in the clinic. Diagnostic instruments, such as a telebinocular or\northovater for visual screening, should be owned by the clinic. Becorders\nare important pieces of equipment in individual instructional situations, as\nwell as with larger groups. Because it is often necessary to keep the tapes\nfor some time and to play them back at short notice, the clinic often prefers\nto own its own tape recorder.\nIf the clinic provides opportunity for students and adults to take\ncourses in reading improvement which include the use of any of the various\nreading instruments, these should be considered permanent equipment in the\nclinic. A room for permanently setting up these instruments or adequate\nstorage space is necessary. A room especially reserved for this equipment is\nmore desirable than storage space, since moving the equipment about would re¬\nquire staff time to recheck the timing of some of the instruments. Also,\npermanently set up equipment provides an opportunity for students to practice\nunder supervision at hours convenient to them and in addition to the class\nhours.\nThe initial purchase of equipment and other teaching materials is depend¬\nent upon (l) the number of students to be served at any one time and (2)\nwhether or not the emphasis will be upon individual or group instruction or\na combination of both group and individual instruction. Some training in¬\nstruments, such as tachistoscopes, can be used either individually or in\nsmall or large groups. Others, such as pacers, can be used by only one person\nat a time.\nThe initial investment to establish a reading clinic, exclusive of\nstaff, can range from $£00 upwards. In many clinics a nominal fee is charged\nfor comprehensive diagnosis, remedial instruction, or classes in reading-study"
}