{
  "id": "d409-90",
  "text": "S3\ncontributions each type can make to the learning situation. It is safe\nto assume that the trend toward increased demand for professional services\nof the center’s staff will continue and ■will affect all aspects of the cen¬\nter’s activities.\n2. The college audio-visual center is becoming less and less a\n’’depository” for materials and more and more a resource center and clearing¬\nhouse for ideas, information, and consultant service.\n3. Altho materials and equipment for general campus use will continue\nto be administered from a centralized source, the staff of the center will\nprobably in the future spend more time helping and encouraging academic\ndepartments to organize pools of specialized instructional materials and\nequipment within their departments and to bring about the widest and most\neffective use of these materials and installations.\nU* More courses are being offered in the production and use of audio¬\nvisual materials, in radio and television, and in the general mass media\nand communications areas. Enrolled in these courses will be persons inter¬\nested in teaching; adult education; fundamental education; production of\neducational teaching materials; government work, such as FOA and UNESCO;\nadvertising; business; military service; journalism; supervision of city,\ncounty, and college AV services; and the like.\n£. The audio-visual center is providing more opportunity for labora¬\ntory and internship experience in the various phases of work of the center.\n6. Colleges are greatly expanding their production services. This\nexpansion in photography, audio, radio and television production is neces¬\nsary to provide desired teaching and public information materials and to\nprovide training facilities for those students desiring to develop compe¬\ntencies in production field.\n7. The audio-visual staff is devoting more time to leadership activi¬\nties and consultative service among educational, church, business, and adult"
}