{
  "id": "d409-94",
  "text": "57\n13, Guss, Carolyn. \"How Universities Evaluate and Select Films.” Educational Screen 32§\n- '21*5-21*7; Summer 1953*\n111. Henry, David D* \"The Educational Film, 1955-1975*” Educational Screen 33 s Ul6—Ul75\nDecember 195U*\n15. Jensen, Herbert. A Plan for an Audio-Visual Center for Columbia University. New Yorks\nDoctor’s Thesis, Columbia University, 1951- 195 p. (Typed)\n16. Kinder, James S. \"An Audio-Visual Service in a Small College.\" The Audio-Visual Reader.\nDubuque, Iowa: William C. Brown Co., 1951** p. 21*9-50*\n17. Kinder, James S. Audio-Visual Materials and Techniques. New Yorks American Book Co.,\n1950. p. 51*9-51.\n18. Ku‘th, Clarence. A Survey of the Audio-Visual Program in Schools of Education of\nSelected Midwestern Universities. Bloomington, Indiana: doctor's Thesis, Indiana\nUniversity, 1951. 285 p. (Typed) . -\n19. Lemler, Ford L. \"The University or College Film Library.\" Film and Education. New\nYorks Philosophical Library, Inc., 19U8® p. £01-21.\n20. Moore Business Forms, Inc* Systems for Audio-Visual Libraries. New York: Moore\nBusiness Forms, Inc., Pacific Division. '~Z Bp. “\n21. National Audio-Visual Association. The Audio-Visual Equipment Directory. Evanston,\nIllinois: the Association, 1955* 179 p.\n22. Olney, Benjamin. \"Acoustics of School Buildings,\" School Plant Studies. Washington,\nD. C,: American Institute of Architects, 1952. 1* p®\n23. Pryor, Richard W., editor* The Audio-Visual Equipment Directory. Evanston, Illinoiss\nNational Audio-Visual Association, 1953. 11*0 p.\n21*. Radio Corporation of America. Broadcast Equipment. Camden: the Corporation, 1952*\n12 p.\n25* Roberts, Harold B., and Norberg, Kenneth D. \"Magnetic Visual Control Board.\" Educational\nScreen 33s 330-31J October 1951*.\n26. Rufsvold, Margaret I. Audio-Visual School Library Service. Chicago: American Library\nAssociation, 191*9. 116 p.\n27. Rust, G. C« \"Administration of A-V Materials in the Liberal Arts College.\" The Audio-\nVisual Reader. Dubuque, Iowa: William C. Brown Co., 1951*. p® 252-51*.\n28. Schofield, Edward T. A Guide for Film Evaluators. New York: Educational Film Library\nAssociation, . 12 p.\n29. Simmons, R. H. \"The A-V Director in the Small Teachers College.\" Educational Screen 33s\n16-19; January 1951**\n30. Swartout, Sherwin George. Administrative Practices in Selected College and University\nAudio-Visual Centers. Columbus, Ohio: Doctor’s Thesis, Ohio State University, 1950*\n317 p. (Typed)"
}