{
  "id": "d1923-0",
  "text": "n\n■N a e b\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 29, NO. 11\nNOVEMBER, 1964\nn\nn\nNAEB Begins New Billing Procedure\nInstitutional members will note a change this winter in bills\nfor NAEB dues and fees. The new system will eventually\ncombine all dues and division fees into one sum and shift to\na fiscal-year basis from the present calendar-year basis.\nNAEB-ETS (TV Division) members will soon receive\nbills for NAEB dues and division fees for the six-month\nperiod January 1 to July 1, 1965. Later they will be billed for\nthe full year July 1, 1965 to July 1, 1966—thus putting them\non a fiscal basis.\nNAEB-NER (Radio Division) and Instructional Division\nmembers will soon receive bills for the calendar year January\n1 through December 31, 1965. A year from now they will be\nbilled for only half a year—putting them also on a fiscal\nbasis as of July 1, 1966. (This will be especially helpful to\nnetwork members, who already pay network fees on a fiscal\nbasis).\nAs rapidly as administratively possible, the procedure\nwill provide for each member to be billed for all services in\none sum—combining TV, radio, and instructional division\nbillings when applicable. When members request that their bill¬\nings be broken into more than one payment a year, this will be\ndone.\nAll questions about NAEB bills should be addressed to\nHarold Hill, NAEB vice president, Washington office.\n16 Stations Represented at Music Meet\nSome 22 official registrants at the NAEB-NER music per¬\nsonnel conference last month at the U. of Minnesota repre¬\nsented 16 different NER stations/institutions. Except for Re¬\ngion VI (Far West), someone attended from every NAEB\nregion.\nThe group plans to continue the meetings, begun two\nyears ago as a Region III (Midwest) activity.\nNew NAEB Institutional Members\nRADIO DIVISION\nGeorgetown College, Station WRVG, Georgetown, Kentucky;\nThe St. Lawrence University, Station WSLU, Canton, New\nYork (also Network member); University of Wisconsin at\nMilwaukee, Station WUWM, Milwaukee (also Network mem¬\nber).\nINSTRUCTIONAL DIVISION\nDelaware Educational Television Board, Dover; University of\nPittsburgh, Pennsylvania.\nEDUCATIONAL ASSOCIATE\nBingham Associates Fund, Boston, Massachusetts.\nSUSTAINING MEMBER\nKODA-AM-FM, Houston, Texas (commercial); RTA In¬\nternational, Inc., New York.\nINDIVIDUAL MEMBERS\nDuring the past three months, 108 new Individual Members\nhave joined the NAEB.\nDo You Read Czechoslovak?\nThe NAEB publications office has received an offer from\nCzechoslovak Radio to exchange the NAEB Journal for the\nquarterly Studie a uvahy, winch features articles about the\nproblems of sound broadcasting “in the widest sense,” accord¬\ning to the head of their research department. If any NAEBer\nreading the language would like to receive the quarterly to\nreview for the Journal, please write the publications office in\nUrbana.\nNAEB Publishes Research Report\nThe NAEB Research Committee has published a report of a\nsurvey of research currently in progress, research personnel,\nand publications. Presley Holmes, who directed the survey\nand who is research editor for the NAEB Journal, reviews\nthe report in the Fact Sheets for the November-December\nJournal. Copies of the full report are available from the\nNAEB Washington office for $1.50 each.\n\"Your Appearance on TV\" Available\nWilliam E. Parke, Jr., TV production specialist at Penn\nState, has written a concise, simple manual for first-timers\non TV. He says they at Penn State have found that it does\na good job of laying groundwork for a producer-director\nfaced with teaching a new teacher about TV. Copies of the\n15-page mimeographed write-up may be obtained from the\nNAEB publications office for 50c each for duplication and\npostage (25c each for orders of six or more mailed to one\naddress at one time).\nNAEB-NER Offers \"News from Dallas\"\nLater this month NERN stations will broadcast The News\nfrom Dallas, a one-hour documentary featuring comments by\nAmericans who were abroad on November 22, 1963. Using\nNAEB grant funds from the National Home Library Foun¬\ndation, the Radio Division produced the programs through\nWUOM, University of Michigan, in collaboration with John\nF. Lewis Associates, Washington, D.C.\nPublications\n• The Research on Programed Instruction, an annotated\nbibliography of the research on programed instruction con¬\nducted in this country since 1954, is available for 50c from\nthe Superintendent of Documents, United States Government\nPrinting Office, Washington, D. C., 20402.\n• The New York University Department of Television,\nMotion Pictures and Radio has begun publishing the TMR\nAlumni Newsletter, which it plans to issue once or twice a\nyear.\n• “New Voices in a Democracy,” John E. McMillin’s study\nof television editorializing, prepared under a grant from the\nTelevision Information Office, is featured in the Summer\nissue of Television Quarterly.\n• Report of the five-year Hagerstown study is published in\nthe Washington County Closed Circuit Television Report, 80\n1"
}