{
  "id": "d1252-0",
  "text": "NEWS NAEB LETTER\nNATIONAL ASSOCIATION «■ EDUCATIONAL BROADCASTERS\nFrank E. Scliooley, Editor, Station WILL, Urbana, Illinois\nNovember I, 1941\nW H AFQSTERS_THg AMERICAN WAY OF LiF£\nLike other stations W H a, at the University of Wisconsin, re¬\nceives A FLOOD OF SPOT ANNOUNCEMENTS, INTERVIEW COPY, AND STOCK\nSCRIPTS UNDER THE \"NATIONAL DEFENSE*1 LABEL* SOME OF THESE ARE.\nUSED AS RECEIVED, A NUMBER ARE RE-WRITTEN, AND MANY CANNOT BE\nUSED* With numberous agencies supplying such material the\nQUANTITY RECEIVED IS GREAT, AND THE QUALITY IS NOT ALWAYS GOO.*\nIv. THE BELIEF THAT IT IS THE DUTY AND PRIVILEGE OF EVERY RADIO\nSTATION IN THE UNITED STATES TO WORK TOWARD A GREATER APPRECIATION\nOF AND SUPPORT FOR THE AMERICAN WAY OF LIFE? W H A IS OFFER I /JG A\nSERIES OF PROGRAMS WITH DEFINITE OBJECTIVES IN RELATION TO NATIONAL\nDEFSNSEo\n1 n—School Listening—-The Stobv of_Ame3J£A.\nIn RESPONSE TO SPECIFIC REQUESTS FROM SCHOOLS FOR HELP IN THi\nTEACHING OF DEMOCRACY AND AMERICANISM, THE STATION SS THIS YEAR\n(1941-42) PRESENTING \"THE STORY OF AMERICA,*' THE BULLETIN DESCRIBES\nit:\n\"THE ADVENTURE OF UNCLE SAM---THAT88 THE NEW SERIES\nOF SOCIAL STUDY PROGRAMS OFFERED BY THE WISCONSIN SCHOOL\nOF THE AIR FOR INTERMEDIATE AND UPPER GRADE TEACHING OF\nAmerican history and democracy*\nVivid narration, highlighted by dramatized episodes,\nTELLS THE STORY OF THE DYNAMIC GROWTH OF THIRTEEN COLONIES\nINTO OUR MIGHTY NATION OF TODAY«. EACH OF THE EIGHT UNITS\nFT. AT UR p 8 LIVES OF FAMOUS MEN WHO SHAPED HISTORY IN THEIR\nTIME* ~FCR THE FIFTH AND SIXTH GRADES THIS( OFFERS STIMULUS\nTO FREE AND V'IDE EXPLORATION OF SOCIAL STUDIES AND DIRECT\nCORRELATION WITH REQUIRED LITERATURE, ART, AND MUSIC^STUDYo\nFor THE UPPER GRADES, it PROVIDES MOTiVatsoh for INTENSIVE\nDRILL AND REVIEW OF FACTUAL MA TER!A L *\"\nThis «S no hysterical, flag waving series*- Instead, it is a care¬\nfully, organ I ZED AND LOGICALLY PLANNED PRESENTATION OF BASIC CON¬\nCEPTS WHICH THE RISING GENERATION NEEDS TO HELP IT UNDERSTAND\nWHAT IT IS THAT IS NOW BEING \"DEFENDED*\" WITHOUT THIS BACKGROUND\nTHERE CAN BE NO LASTING SUPPORT FOR THE DEMOCRATIC WAY OF LIVING*"
}