{
  "id": "d1918-0",
  "text": "February, 195&\nThe Presidents Page\nDear NAEBers:\nSeems like there is less time in-life as 1 grow older* At least,\nI FIND IT DIFFICULT TO GET THINGS DONE AT TIMES. HAROLD HlLL IS MAD\nAT ME NOW BECAUSE THIS PAGE WASNJT HANDED IN A DAY EARLIER. Gan’T SAY\nI BLAME HIM. i.. HATE PEOPLE WHO, CAN’T GET THINGS DONE ON TIME, DON* T-\nyou? . . . . : - ; ' ''\nT HERE 1 S A' THING OR TWO ON MY MIND, THOUGH, l*D LIKE TO DISCUSS\nwith you* First, I’d like to consioer with you some possible changes\nin the NAEB Radio Network operations. This isn’t an offer, -and it\nisn’t a suggestion on which I have a definite fixed vi-ew, but it’s one\nI’ve been tossing around in my mind for sometime.\n•• Seems to me that we sometimes don’t get programs distributed by\nthe Network, when some of those very programs are the ones wanted by\nSOME OF OUR STATIONS. I COULD PROVIDE SOME DATA OF PROOF, BUT THAT\nISN’T PERTINENT AT THE MOMENT. 1 COULD EVEN REPEAT MY NORMAN REMARKS,\nWHERE I EXPRESSED OPPOSITION TO COMMITTEE ACCEPTANCE, NOT BECAUSE l\nHATE COMMITTEE- MEMBERS, BUT BECAUSE THE MACHINERY ALWAYS CAUSES' TROUBLE\nAND DELAY. 1 WON’T BELABOR THAT POINT EITHER,* I GIVE IN TO DEMOCRACY.\nIf things are working all right, why can’t they be better. Why\nNOT TRY-, ANYHOW?*\nThe thought or idea: Why not provide something like 80 per cent\nOF PROGRAMS APPROVED BY THE ACCEPTANCE COMMITTEE. ON IN-SCHOOL PRO¬\nGRAMS, DO THE SAME, SAY ABOUT 80$. THEN FOR OTHER 20 PER CENT OF SER¬\nVICE OFFERED, LET STATION MEMBERS SELECT FROM ADDITIONAL OFFERINGS\nPROGRAMS THEY DESIRE.\nTO PUT IT ANOTHER WAY, WHY NOT HAVE BASIC AND BONUS OFFERINGS BY\nthe Network. Basic might; be the 80$ selected by the Acceptance Commit¬\ntee, and by School Acceptance Committee. Bonus program, comprising\nABOUT 20$ OF ‘THE- SERVICE, WOULD; BE SELECTED BY STATIONS UPON OFFERING\nby Network. ,\nThe Bonus programs, if idea is worthy of consideration or perhaps\nADOPTION, WOULD BE PROGRAMS MADE AVAILABLE TO THE NETWORK, BUT WHICH\nWOULD BE, FOR ONE REASON OR ANOTHER, NOT IN SAME GROUPING AS THOSE SE¬\nLECTED for Basic. This doesn’t always mean quality is involved* some¬\ntimes QUALITY WOULD BE INVOLVED, LET’S FACE IT. BUT MY JUDGEMENT OF\nQUALITY ISN’T THE SAME AS YOURS. ANO YOURS ISN’T THE SAME AS MINE.\nAnd GEOGRAPHY HAS BEARING UPON INTEREST AT TIMES.\nHere, add Jim Miles* contribution. For each series of programs\nOFFERED BY THE NETWORK IN THE FUTURE, BASIC OR BONUS (SOME WAY WILL\nSAY* WHAT B&B ON NAEB, WELL), A BRIEF CRITIQUE WOULD ACCOMPANY OFFER¬\nING. We’d get some working NAEB critics. We wouldn’t have to ioentify,\nBUT IF WE IDENTIFIED AS X, Y, OR 2, WE’D SOON HAVE A BASE OF REFERENCE*"
}