{
  "id": "d1918-3",
  "text": "more than doubled the number of jobs listed for the corres¬\nponding 1960-61 period.\n^ The City College of San Francisco broadcasting depart¬\nment has recently added two Sony PV 100 Videocorders to\nits TV-radio system.\n^ The movies and how college students learn about them as\na contemporary art form were discussed at a three-day semi¬\nnar at Lincoln Center, in conjunction with the Second New\nYork Film Festival. Part of a special study by the American\nCouncil on Education, the seminar brought together some 60\npersons—university professors, other professional leaders in\nthe arts, humanities, and social sciences, and representatives\nof the motion picture industry.\n^ During the month after WFSU-TV, Tallahassee, aired\n“The Dream and the Challenge,” a three-part series on the\nhandicapped, hiring of the handicapped in the area rose five\nto ten per cent.\n^ Indiana University’s FM station, WFIU, got back on the\nair with full power in September. The station had been oper¬\nating at reduced power for several months, after a fire\ndestroyed part of the old transmitter. The new RCA trans¬\nmitter has an effective radiated power of 75-thousand watts,\nand will be remote controlled from the new Radio-TV Center\non campus.\n^ KUHT, Houston, Texas, has resumed programing from\nnew studios and with major improvements in equipment.\n^ KDPS, Des Moines, has installed a new GE transmitter and\na second tape recorder.\n^ KUSD-TV, Vermillion, has begun its second year of 1TV\nprograming for the South Dakota ITV Council.\n^ Through a public service grant given by the Pittsburgh Na¬\ntional Bank, “The Special of the Week,” a series of hour-\nlong TV documentaries, has returned for a second year at\nWQED.\n^ Participants at an NEA conference at Stephens College\nlast month discussed suggestions for design and structure of\nITV in the nation’s schools.\n^ Groundbreaking for the new Chicago ETV Center oc¬\ncurred October 15, marking beginning of construction of the\nnew permanent home of WTTW/WXXW. Mayor Richard\nDaley wielded one of the shovels at the ceremonies. The\nbuilding will cost $963,945—financed in part by a gift of $200,-\n000 from the Harris Foundation of St. Paul, the rest to be\nobtained through an intensive private campaign already un¬\nder way. Completion of the building is scheduled for June\n30, 1965.\nINTERNATIONAL\n^ Professional and educational broadcasters in ten Pan-Amer¬\nican countries have ordered approximately 50 Ampex portable\nVR-660 Videotape recorders.\nSTATION ANNIVERSARIES\n^ WIAN (FM), Indianapolis Public Schools, celebrated its\ntenth anniversary October 31. It started as a 250w station\nand now transmits a lOkw signal as Indiana’s most powerful\npublic school station.\n^ WRVG, Georgetown College, Kentucky, began broadcast¬\ning a year ago this month. In a report on the 10-watter’s first\nyear, Prof. L. Lane Wells writes that informal responses in¬\ndicate that a number of residents, both on campus and in the\ncommunity, are familiar with the new station and have heard\nsome of the programing; local appliance stores reported a\nrise in the sale of FM table radios; and the number of stu¬\ndents enrolled in broadcasting courses increased 96% over\nthe previous year. To help increase the number of FM re¬\nceivers in the community, receivers are being sold this year at\nthe college bookstore, by the station staff, as a non-profit\nmaking drive. The student-operated station is adding a pub¬\nlicity department this year also.\nPROGRAM'S\n^ “L’Historie du Soldat” (The Soldier’s Tale), was aired\nOctober 27 over KUED, University of Utah, after three\nmonths of work by the drama and modern dance department\nand 214 weeks of actual taping.\n^ WBUR, Boston University, geared major musical presen¬\ntations to performance of Shakespearean plays in its unique\nmonth-long Shakespeare Festival last month. The series\nbegan the first week with a Sunday performance of “Othello”\nfollowed on Wednesday by Rossini’s operatic treatment of the\nplay and on Friday by Verdi’s operatic version.\ny “E T Variety,” a new weekly evening series over South\nCarolina’s WNTV, Greenville, and WITV, Charleston, fo¬\ncuses on a potpourri of state matters of interest, such as his¬\ntorical places, hobbies, art, wildlife, and music.\n^ Detroit’s multi-cultured community has inspired the “De¬\ntroit’s Ethnic Groups” series on WDET, Wayne State Uni¬\nversity’s FM station. The six largest nationality groups in\nDetroit are highlighted, focusing on the art, literature, and\nmusic of the country featured, with audio in the native lan¬\nguage and English synopses.\n^ WGTV, University of Georgia, Athens, sent Sylvan Meyer,\neditor of The Daily Times, Gainesville, to cover the national\npolitical conventions, focusing upon the Georgia delegation\nand issues relevant to Georgia.\n^ WTTW, Chicago, each month feaures a great silent film on\nits series, “The Toy that Grew Up.” Last month’s was the\n1918 production of “Tarzan of 'the Apes.”\n^ WMHT, Schenectady, New York, is locally producing “The\nLively Arts,” a weekly series devoted to current and coming\nevents in music, drama, dance and the arts of the area.\n^ Associate Professor Robert L. Bannerman, Indiana Uni¬\nversity, is at work under a $21,000 contract from the National\nAeronautics and Space Administration to produce thirteen\nradio actuality documentaries on space medicine, to be na¬\ntionally distributed by NASA.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Miss Julie Hunt, Placement Service,\nat the NAEB office in Washington.)\nNovember I Supervisor of major university's centralized TV\nservices, married, two children. Graduated through all\nlevels of ETV and radio to present academic-adminis¬\ntrative position. Last 4 years in charge of ETV, ITV,\ncurriculum and motion picture staff of 60, and two\nstudio operations. Interested in position as manager or\nassistant manager to develop new or existing operation,\nor as supervisor of special projects requiring adminis¬\ntrative and production ability. Present salary $11,000.\nSignificant references.\nNovember 2 Experienced producer-director, married, 34. B.S.\nin radio-TV, I I years experience all phases TV produc¬\ntion, studio and remote, lecture, music, drama, and all\ntypes art and science demonstrations. Desires creative\nopportunity. $8,000 minimum.\nNovember 3 Married male producer-director in commercial\nTV, 25, B.S. in TV, wants out because of too many com¬\npromises with social conscience; looking for same posi¬\ntion in ETV. Earning $7500; will settle for same with\npeace of mind.\nNovember 4 Mature male, 24, with marriage intentions, M.A.\nin speech and communications (radio-TV), and 5 years\nITV, ETV, and commercial TV experience, plus 2 years\nof ETV directing, seeks mature $7200 to $7500 per\nyear producer-director's position. Willing to travel.\nPOSITION AVAILABLE\n(In order to be considered through these channels, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nNOV-1 Large Midwest university educational radio station has\nimmediate opening for experienced producer. Must be\nable to produce mature, imaginative programs for adult\naudience. No teaching, strictly production. Full-time po¬\nsition. Salary open.\n4\nNEWSLETTER"
}