{
  "id": "d613-131",
  "text": "« i -\nc\n0\np\nY\nASSOCIATION FOR PROFESSIONAL BROADCASTING EDUCATION\nNovember 5, 1956\nMr* James S* Miles\nPurdue Uni versity\nLafayette, Indiana\nDear Mr. Miles:\nI AM WRITING YOU IN MY CAPACITY AS A DIRECTOR OF THE\nAssociation For Professional Broadcasting Education. As you\nKNOW, PROFESSIONAL BROADCASTERS, AS WELL AS EDUCATORS, ARE\nREPRESENTED ON THE BOARD OF THIS NEW ORGANIZATION.\nThe APBE has been growing and developing in very fine\nFASHION. I BELIEVE THAT IT HAS A MOST USEFUL PURPOSE TO\nSERVE IN EFFECTING CLOSE LIAISON BETWEEN PROFESSIONAL BROAD¬\nCASTERS AND THE INSTITUTIONS WHICH PREPARE PEOPLE FOR ENTRANCE\nINTO THE FIELDS OF TELEVISION AND RADlOo As A BROADCASTER,\nI KNOW THAT AS TIME GOES ON, THE NEED OF OUR INDUSTRY FOR\nPEOPLE WITH SPECIALIZED TRAINING BECOMES MORE AND MORE IM¬\nPORTANT. That is why I have been interested in working with\nAPBE. As a representative on APBE*s Board of the National\nAssociation of Radio & Television Broadcasters, which\nORGANIZATION CONTRIBUTES GENEROUSLY TO THE SUPPORT OF APBE,\nI KNOW THAT OUR TRADE ASSOCIATION IS ALSO EXTREMELY INTERESTED\nIN THIS PROJECT.\nI HOPE THAT YOUR SCHOOL CAN SEE ITS WAY CLEAR TO AFFILI¬\nATE with APBE. The benefits are many; the cost is low.\nSo THAT YOU MAY HAVE SOME INFORMATION ON THIS SUBJECT, I\nAM ASKING THAT YOU BE SENT, UNDER SEPARATE COVER, A MEMBERSHIP\nAPPLICATION, A COPY OF OUR CONSTITUTION, A BRIEF HISTORY OF\nAPBE, AND I THINK, TOO, THAT YOU WILL BE INTERESTED IN SEEING\nA LIST OF THE CURRENT MEMBERS, AS WELL AS SAMPLES OF THE TYPE\nOF NARTB PUBLISHED MATERIAL WHICH IS NOW BEING MADE AVAILABLE\nTO MEMBERS OF APBE AND WHICH MANY SCHOOLS TELL ME IS EXTREMELY\nVALUABLE TO THEM. SOON THE FIRST ISSUE OF THE JOURNAL OF\nBroadcasting will be published and I have asked that you be\nSENT INFORMATION ON THAT SUBJECT, AS WELL AS OTHER ACTIVITIES\nWHICH ARE BEING PLANNED.\nI HOPE WE CAN COUNT ON PURDUE UNIVERSITY AS ONE OF THE\nMEMBERS OF WHAT WE ALL FEEL IS A VERY SIGNIFICANT AND IMPORTANT\nORGANIZATION.\nSincerely yours,\n(Sgd) Lester W. Lindow\nDirector, APBE\n1771 N Street, N.W.\nWashington 6, D.C.\nDecatur 2-9300"
}