{
  "id": "d613-136",
  "text": "A^- /*/'<- &/=>&\nLe> v\nOctober 7, 1957\nMr. James S. Miles\nStation WBAA\nPurdue University\nLafayette, Indiana\nDear Jim:\nI guess I goofed, huh ? I agree completely with Stew that everything we send out deal¬\ning with the Convention should repeat the dates over and over, because there will still\nbe people that won't know when or where — of course they won't come anyway, but I\nagree they should be told.\nNow — even though I agree with the principle set forth, I also think every dog should\nhave his day, so I'll tell my side. The letter (from Harley) to which Stew refers was\nnot a promotion piece for the Convention (still agreeing that everything sent out is a\npromotion piece in some sense of the word) strictly speaking. It was sent only to the\nbosses at stations and production centers and had only one purpose, and that was to\nelicit their aid in the program for Thursday night (October 31—in St. Louis). These guys,\ntheoretically at least, were interested and didn't need the dates again, especially since\nthis wasn't urging them to come, and since they'd already received at least two earlier\nmailings complete with dates. Also, as an afterthought, we didn't write the thing here—\nHarley wrote it—although I agree we could easily have added the dates.\nSecond point—I have carefully checked a copy of every piece that we sent out in con¬\nnection with the Convention and there isn't another one that doesn't have a date of some\nsort (except for the map of St • Louis which was furnished by the Chamber of Commerce\nand which we didn't feel needed an overprint). I mention this because Stew says he has\nreceived two promotion pieces without dates. Even the hotel reservation sheet we sent\nout has a date on it. Some of the promotion pieces for special functions, such as the\nGrant's Farm tour, had only the dates of the special event, and not all the dates for the\nConvention, but each such piece was accompanied by another piece giving complete dates.\nPlease believe that I am not making excuses—I still say that Stew is right—I merely\nwanted to show you and Stew that we do take pains to check on any and all complaints that\nwe receive—that's the reason I went through all the stuff after your letter came. Just to be\nsure we hadn't goofed worse than it at first appeared."
}