{
  "id": "d613-156",
  "text": "REPORT OF THE NAEB PUBLIC RELATIONS POLICY COMMITTEE\nOctober 1, 1955\nThe NAEB Public Relations Policy Committee, as a result of its meeting in Chicago,\nIllinois, June 28th and 29th, 1955, is pleased to forward the following recommenda¬\ntions to the Board for their consideration and action:\n1* We recommend that the Board of Directors take steps to establish a written\nstatement of the goals of NAEB. We further recommend that the Board take\nappropriate action so that these goals are restated and brought up to date\nperiodically.\n2. We recommend that the Board assign to the Executive Director public relations\nas a prime responsibility. We recommend further that as soon as funds will\npermit a full or part time writer be hired and attached to the Executive\nDirector’s staff in Urbana, Illinois.\n3. We recommend that the Board ask the Executive Director and his staff to:-\n(a) Direct all future publications to a definite audience\n(b) Prepare an explanatory publication on the NAEB, giving full details\non its cost, membership, why the NAEB exists, and other factors that\nwould effect membership\n(c) Prepare articles on educational broadcasting for use in professional\njournals other than journals connected with speech and broadcasting\n(d) Prepare basic information that could be utilized with foundations\nasking for grants (including 3B, 3C and 3^)\n(e) Take steps to establish uniformity in all publications including\nletterheads, Newsletters. etc.\n(f) Develop the current Newsletter item which is labeled “Station Pro¬\nfiles\" to a one-page dossier of the member stations and production\ncenters of NAEB, describing their resources in the way of equipment,\nphysical plant, and personnel—whether professional or student, full\ntime or part time\n(g) Establish a definite pattern for the letters (correspondence) that\nemanate from Headquarters in order that the public relations efforts\noutlined by the Board may be furthered.\n4. The Public Relations Policy Committee has made several recommendations directly\nto the Executive Director and his staff regarding the Newsletter. Several of\nthese have been taken under consideration and a few have been acted on. It is\nthe belief of this Committee that again we need to direct this publication to\nthe audience for which it is intended. Inasmuch as this audience is so varied\nit seems wise that we recommend to the Board that they request the Research\nCommittee to carry on a poll of the members, attempting to find out what items\nthey like or dislike in the Newsletter and what items should be added or deleted."
}