{
  "id": "d613-35",
  "text": "Purdue University\nSTATION WBAA\nLAFAYETTE. INDIANA\n18 February 1955\nMr. Harry J. Skornia,\nExecutive Director, NAEB\n14 Gregory Hall\nUniversity of Illinois\nt?l?l?|iP(U|12| !,2|3|4|5|ji\nA M\nFEB 21 1955\nUrbana, Illinois\nDear Harry:\nThanks very much for your letter of February I I and subsequent\ndates. 11ll try to answer the various things as I COME TO them.\nFirst, we have read Bidlack’s comments on the Kear ano Kennedy\nMATTER AND AGREE WITH HIM A HUNDREO PERCENT. I DON1T BELIEVE YOU HAVE\nSTILL ANSWERED MY QUESTION AS TO WHETHER WE ARE GOING TO TAKE ANY\nFORMAL ACTION IN THIS REGARD. CAN COHN AND MARKS DO SOMETHING ABOUT IT?\nI HAVE BEEN NOTICING THE NEW HEADINGS ON THE VARIOUS PLACEMENT\nService, etc. and they look very, very fine. You sent us a box of head¬\nings BUT IT WAS THE BLANK MATERIAL, THE ONE YOU MARKED ”TO FILL IN AS\nNEEDED”, RATHER THAN THE RED ONE LABELED ”NEWS”. WAS THIS AN OVERSIGHT\nOR HAVEN’T WE GOTTEN THE ”NEW$” ONES YET?\nji HOW DO YOU FEEL ABOUT PRESS RELEASES ON THESE INDIVIDUAL THINGS\nYOU SENT ME? FOR EXAMPLE, THE RESEARCH PROJECT, THE NEW ENGINEERING\nNewsletter, the new Siebert Piece, etc? If you think there should be a\nSTORY, — A SHORT ONE, ON ALL OF THESE THINGS IN THE GENERAL PUBLICA¬\nTIONS, I WOULD BE HAPPY TO ATTEMPT TO GET THEM OUT. WHEN IS A GOOD\nQUESTION BUT I’LL WORK ON IT.\nJohn Henderson has kept me informed on the grants-in-aid develop¬\nments. Hence, I had seen most of that material. It looks to me like\nTHEY ARE PROGRESSING IN FINE FASHION. THE MATERIAL ON WORKSHOPS AND\nSCHOLARSHIPS WOULD DO, AND AGAIN, I THINK ARE COMING ALONG VERY, VERY\nWELL. I SEE NOTHING IN ANY OF THIS THAT I WOULD COMMENT ADVERSLY ON.\nRegarding your memo to the Executive Committee under February 9.\nYOU HAVE CERTAINLY GONE INTO SOME HOT AREAS HERE. I RATHER REASON\nTHIS way: If we have been unable to explain what to us is a relatively\nsimple procedure regarding the Kellogg Foundation and its relationship\nTO OUR NETWORK ASSESSMENT FEES, THEN HOW IN THE WORLD ARE WE GOING TO\nEXPLAIN A COMPLICATED PROCEDURE SUCH AS THE ONE YOU OUTLINE FOR THOSE\nSTATIONS WHICH SUBMIT PROGRAMS? PERHAPS PART OF MY CONFUSION STEMS FROM,\nI BELIEVE, AN ERROR IN YOUR ITEM II, SUB-NUMERAL (l). QUITE POSSIBLY\nYOU MEANT TO SAY HERE \"CLASS A STATION”, BUT YOU HAVE ’’CLASS C” INSTEAD.\nI DON’T SAY THIS CAN’T BE DONE BUT I AM STILL UNCONVINCED OF THE\nNECESSITY FOR DOING SO. I AM NOT AT ALL CERTAIN THAT YOU WILL SECURE\nBttJBKWg Q WBAAc»»>"
}