{
  "id": "d613-55",
  "text": "[Of\nC\nm 27# 1955\nMr. Hugh M* Mix, Acting lUrector\nEducational Broadcasting Service©\nRadio Station mm\nUniversity of Oklahoma\nHojrian# >. kZahoma\nDear Bttgfct\nI ssa afraid your letter sod article have arrived to© late to maim this\nTfcwflettor in ary case* 1 talked to Schooley about it# and am giving\nlilK a copy of this reply*\nI hasm recently returned f*om Kansas City where# as at many other meet¬\ning®# I have had to enoaor questions by suspicious hreadeasters i&©\nthink that educators wit to get channels which they will then use for\nentertainment broadcasting# which would constitute competition for them*\nTherefore they feel that they should oppose educational television and\nradio. I would be a little reluctant at this tine to carry the sort\nof story that would result in a resurgence of this ©position.\nAlso your article sounds like a reply to David Bamy. Since he didn«t\nask to have copies of his speech distributed# and since he is laying\ntcTsaooth the water© at a level different from that at which m oper¬\nate# I once again do not fool that it would be fair to him now to seem\nto contradict bin. I*© sure you don't want educators to tel1 us about\nbroadcasting* On the other hand the perspective which many educators\nhave of the problem woUl have in cur school® Is, 2 believe# more valid\nthen ours educationally* Whether m like it or not, the schools des¬\nperately need1' tools *&:relievo pressures for space ©to* for direct In¬\nstruction, among other things.\nIha sure neither he nor any rsaponsiblB educator ws'd endorse would\nrecccraeiid dullness as synax$naous with education* Z prefer interest¬\ning to dull professors, m m all do* But if and when tfe: mod pro-\nfeasor is replaced by the “hen#\" I think we have to begin tiTESai\nstock again-—and that sometime® happons* And when the professor be¬\ngins to do tlm equivalent of song, dance or quia routing to keep it\nentertaining# coos again I can't think you'd want that# though I'm\nnot sure that the tons of your statement aright not leave itself open\nto that interpretation."
}