{
  "id": "d613-73",
  "text": "-2-\nV. Distribution\nA. Hot news to press services, plus mailing list of nation5 s outstanding radio\ncolumnists.\nBo News plus features to radio trade publications, both educational and commer¬\ncial, domestic and foreign,\nVI, Budgetary Requirements\nA, Pay for PR man\nBo Office expenses of paper, postage, mimeographing work, envelopes, mats,\ncuts, and photographs\nVII. Policy Requirements on Clearances\nA« All questions of clearances should be taken to NAEB president\nBo General policies should be set by NAEB president to avoid too many trips\nC, Materials sent directly to PR man from members should be cleared in all\ncases with President\nDiscussion of Item 1\nNeed more publicity on new matter programs.\nDo we need full-time PR man? or part-time? Or can we use someone else who is\nadequately trained?\nThere was a general discussion of the pros and cons of having program releases\ncome from a central source or from the local stations including a consideration\nof the inclusion of broadcast time. Sulzer and Bender favored central distribution\nbecause otherwise the item is not really news. -\nHowe raised the question of whether or not we could cover public relations on\nall educational broadcasting whether NAEB or not. Amsey reported Stoddard be¬\nlieves FAE is going to finance two major fie Ids in ETV 1) promotion 2) production,\nArmsey feels we must distinguish between publicity of NAEB activities and'general\npublic relations and promotion for the whole field of educational broadcasting.\nSulzer; feels we should confine ourselves to NAEB and not all educational broad¬\ncasting, af least at the present. Might find ourselves in very embarrassing situ¬\nations.\nSulzer: The PR man could help the stations by sending them ideas for local\npublic relations.\nHowe: We could use a half-time man in Urbana—NAEB to take the other half.\nExecutive Director should probably handle PR and get a straight news writer as\na publicity man.: •\nGeneral discussion of poor PR of 195>ii Convention and what should be done. Need\nPR Committee member on all planning committees.\nArmsey: PR Committee should have two functions:\n1) that it be concerned with the total policy and function of the NAEB\n2) a member of the PR Committee serve as ex officio member of every\nother committee."
}