{
  "id": "d613-78",
  "text": "-7-\nMiles: Better not to use committee lists etc. on the back sheet*\nSulzer: Cut down to about 1/3 present, size and print it. Suggested depart¬\nmentalization? a) Strictly HAEB news that/members really need to know, b) news of\nnew programs condensed to about two or three lines* c) cut station profiles to a\ncouple of pages* d) book reviews—brief notice (li or 5 lines) of new books.\nOpinions of reviewer of no value to us. Cut out all triviality stuff, including\nreprints from other publications except as fillers. If must use* put it back.\nBrevity is the main thing.\nMies: Scans headlines to see what he wants to read. Favors brief reprints.\nBender: Smaller stations need reprints* but boil them down.\nHill: Suggested that PE Committee poll the membership to see what they want\nin the^Hewslotter.\nMies: Used to have brief type of Newsletter. Baring Hull era the feeling\ngrew that we wanted to get somewhere between a monthly news sheet and a quarterly\nmagazine. It also got information out to members about the growth and changes\nthen taking place in -the organization. Compare Newsletter to NPAC publications\nAgricoin, and Agrisearch. Some things could be put out as separate items at different\ntimes* \"but tHs is not as good as one publication. Present method exposes entire\nstaff to other areas of interest than their own. Departmentalization might defeat\nthis purpose.\nSulzer: regarding Miles* comment above* lack of departmentalization may pre¬\nvent reading of anything if they canst readily find what they want.\nBender: It has to be something that people like to read.\nMies: Enjoys looking at the book reviews because it does give him an idea\nof what^tHe reviewer thinks.\nConsensus: Tighter writing* more condensed* some departmentalisation* pending the\npoll.\nMies will recommend to the Board that the Research Committee conduct such a\npoll during the school year this fall.\nAGENDA ITEM 6.\nSee brief mention of this matter in Item 1 above.\nGeneral Discussion of Public Relations\nMiles: The Public Relations Committee wants a resolution from the Board rec¬\nognizing the public relations responsibility of the Executive Director as the chief\nPR person in the organization of a continuing nature. The Board should also recog¬\nnise that general PR policy of the Association should be established by the PR\nCommittee,"
}