{
  "id": "d613-87",
  "text": "REPORT OF THE PUBLIC RELATIONS POLICY COMMITTEE\nOctober 1, 1956\nThe NAEB Public Relations Policy Committee met during tHte 1955 NAEB Convention\nand agreed to renew those of its recommendations made at this time last year\nwhich have not been activated. These are as followsi-\n1. We recommend that the Board of Directors take steps to establish a\nwritten statement of the goals of NAEB. We further recommend that the\nBoard take appropriate action so that these goals are restated and\nbrought up to date periodically.\n2. We recommend that the Board assign to the Executive Director public\nrelations as a prime responsibility. We recommend further that as soon\nas funds will permit a full or part time writer be hired and attached\nto the Executive Directors staff in Urbana, Illinois.\n3. We recommend that the Board ask the Executive Director and his staff tos-\n(A) Direct all future publications to a definite audience\n(B) Prepare an explanatory publication on the NAEB, giving full\ndetails on its cost, membership, why NAEB exists, and other\nfactors that would effect membership\n(C) Prepare articles on educational broadcasting for use in\nprofessional journals other than journals connected with\nspeech and broadcasting\n(D) Prepare basic information that could be utilized with foundations\nasking for grants (including 3B, 3C and 3F)\n(E) Take steps to establish uniformity to all publications including\nletterheads, newsletters, etc.\n(F) Develop the current newsletter item which is labeled ’’Station\nProfiles” to a one-page dossier of the member stations and\nproduction centers of NAEB, describing their resources in the\nway of equipment, physical plant, and personnel—whether\nprofessional or student, full time or part time\n(G) Establish a definite pattern for the letters (correspondence)\nthat emanate from Headquarters in order that the public relations\nefforts outlined by the Board may be furthered.\n4. The Public Relations Policy Committee has continued to make recommendations\ndirectly to the Executive Director and his staff regarding the Newsletter •\nMany of these have been acted on. It is our feeling that the Newsletter^\nis now more adequately serving the audience for which it is intended•\nRespectfully submitted byi\nPUBLIC RELATIONS POLICY COMMITTEE\nJames Armsey\nWilliam Bender\nLarry Frymire\nStewart S. Howe\nLynn Poole\nElmer Sulzer\nJames S. Miles, Chairman\nCopied at NAEB HQ, 10/8/56dc"
}