{
  "id": "d1817-0",
  "text": "OFFICERS\nEXECUTIVE COMMITTEE\nPresident: R. C. HIGGY, WEAO » *\nOHIO STATE UNIVERSITY (\nVice-President: CARL MENZER, WSUI\nSTATE UNIVERSITY DF IOWA\nIOWA CITY, IOWA\nSecretary-Treasurer:\nB. B. BRACKETT, KUSD\nVERMILLION, SOUTH DAKOTA\nKV\nof\nCollege. ay\\A Umv'eY^ily\ncabling\nFirst Zone: DANIEL E. NOBLE, WCAC\nCONNECTICUT AGRICULTURAL COLLEGE\nStorrs, Connecticut\nSecond Zone: d. B. HASS ELM AN, WKAR\nMICHIGAN STATE COLLEGE\nEast Lansing, Michigan\nThird Zone: GARLAND POWELL, WRUF\nUNIVERSITY DF FLORIDA\nGainesville, Florida\nFourth Zone: W. I. GRIFFITH, WOI\nIOWA BTATE COLLEGE OF AGRICULTURE\nOffice of Executive Secretary\nT. M. BEAIRD, WNAD\nNgrman, Oklahoma\nFifth Zone: H. V. CARPENTER, KWSC\nSPECIAL BULLETIN\nRelease Date January 29, 1932\nAT Large: CHARLES A. CULVER, KFMX\nTO MEMBERS\nof\nTHE ASSOCIATION OF COLLEGE AND UNIVERSITY BROADCASTING STATIONS\n(and a special request mailing list in addition to members)\nIMPORTANT COMMENTS LISTED BELOW FROM BOTH LETTER AND TELEGRAM NEED YOUR IMMEDIATE\nATTENTION AND THOUGHT, Please rush answers and suggestions to this office by\nreturn mail•\nThe following letter has just been received from Mr. J. C. Jensen, Director and\nEngineer, Station WCAJ, Nebraska Wesleyan University, Lincoln, Nebraska. (You\nwill note that the letter raises some very important questions relative to recent\norders of the Federal Radio Commission which affect college and university stations\nmaterially. Kindly read carefully and rush your decision relative to bringing this\nmatter to the attention of the Commission at the earliest possible date.) The\nletter is as follows:\n\"If you have noticed the recent orders of the Federal Radio Commission which add\nvery greatly to the present inflexibility of program schedules, I believe you will\na!Tree with me that we ought to cooperate among ourselves as college stations for\nthe purpose of getting certain changes in the new rules. College stations are con¬\nstantly being confronted with such situations as athletic games and other college\nevents which make necessary changes in program schedule. A rule which requires\nthat the Commission be given three days1 notice prior to the effective date of the\nproposed change in schedule may save the Commission some time and trouble but it\nwill work endless hardships on college broadcasting stations. I can not understand\nwhy the Co'mission should object to changes that are agreeable to both parties con¬\ncerned where two stations divide time, and where the change can not create inter¬\nference with any other station. In other words, if WCAJ and WOW together have full\ntime on 590 KC, no more harm can come from an exchange of hours on the part of these\ntwo stations than would come were WOW to interchange its nine and ten o’clock pro¬\ngrams on some evening.\n\"If the Commission wishes to reduce the expense of hearings they might establish a\nrule by which the station which applied for a hearing must pav the expense, if the\ncause of the hearing we.s disagreement in time sharin?:. This would permit stations\nwhich are already giving a cooperative service to continue with their cooperation\nand act as a b8r to those which tend to increase expenses.\n\"Do you think it is possible for our organization to make a united demand for a\nmodification of the present rule? It has already worked hardship in our case.\""
}