{
  "id": "d1351-2",
  "text": "(5 U E S T I T Q R I A L\nFOR BETTER SERVICE\nFor Gcvsral years I have been identified as the \"v/atch dog of the Treasury\",\nin my official capacity as Treasurer of N.AoE.B. I take your money<,\nThrough the years we have seen improvements made in educational broadcasting,\nboth with respect to the technical equipment used, and the development of well-\nconceived programs worthy of the educational institutions initiating them.*\nSome of us have looked with \"green-eyed envy\" at the funds available to\ncommercial stations and forgotten that these funds are derived from the sale of\ntime for advertising the v/ares of sponsors* Vifithout entering into an argument\nabout the merits or lack of merits of commercial announcements, the fact remains\nthat because our programs are free from advertising, we are in the good graces of\nmany listeners who are quite \"fed up\" on the sponsor’s sales talk* Without\n\"knocking\" the way in which commercial broadcasters operate, or patting ourselves\non the back for not advertising, we must carry on. -'^e can build loyal audiences\nof regular listeners for culturally significant programs.\nNo one station, or program of an associate member over a commercial station,\ncan expect to claim the attention of all of the listeners all of the time. How¬\never, it is reasonable to expect that we v/ill be able to claim and hold the\ninterest of discriminating, substantial, individuals who like v/hat we have to\nsay and the way we say it. That audience is waiting-unsatisfied.\nThe path of the members of the Federal Communication Commission'is not.\n\"strewn with roses\". Though they are conscientious gentlemen who take their job\nseriously, they are subject to pressure from groups whose interests are opposed to\nthose of educational stations. We owe it to ourselves to keep the FCC informed\nof our opinions and v^ishes on controversial issues* The greatest need of the\nN.A.E.B., in that respect, is to have a representative in ’\"ashington D.C. where\nradio decisions are made. Call him executive secretary or bestow another title.\nWe need him. His duty it would be to see that our interests are guarded, and\nthat v/e are kept informed as to policies and procedures as they are developed.\nHe v/ould direct our respective efforts to a common goal*\nThe services of such a competent representative will cost money, but it will\nbe worth it. Unless a \"Santa Claus\" to provide the funds is found in the very\nnear future, we should seriously consider ways of reusing the necessary funds\nthrough our members. Increased dues from those who are already members, membership\nof a number of new FM educational stations, and associate memberships from\ncolleges and universities carrying on activities in the field of radio are possible\nsources. Though such expenditures may be a hardship, the greater services to be\nrendered by NAEB will pay off. The efforts of new members need the guidance of\nmem’oers who have through years of experience developc3d know-how v/hich can be\n+o’.?:nsf erred.\n..... oW. I. Griffith, Treasurer of N.A.E.B.\nWO 15 Ames Iowa\nNext Month's Guestitorialist£ H* B. McCarty,"
}