{
  "id": "d996-1",
  "text": "A/S /I e-t Q » k C\nJanuary 25f 1955\nMr. Jack K. Westbrook\nChairman, NAEB Acceptance Committee\nRadio Station WUOT\nUniversity of Tennessee\nBox 8540\nKnoxville, Tennessee}\nDear Mr. westbrookt\nn\nI should like to vote yes for continuing the following series*\nSTORIES N STUFF, University of CHICAGO ROUNDTABLE, and CHILDRENfS\nCIRCLE. I think ROUNDTABLE and CIRCLE are particularly valuable to\nthe network. We dropped STORIES N STUFF at KUSD chiefly because\nwe wished our children's programs to have more local interest. They\nare too, I believe, -just a trifle precious *\nI should like also to vote ypm/toT the series SCHOOLS TODAY.\nThe two I heard indicated sound planning and production on the part\nof the people doing the series. I think it has enough universality\nin the problems discussed to make thi#/#eries of value to the entire\nnetwork. ^\nI am entirely in sympathy with the idea behind the program RARE\nEDITIONS. Unfortunately, the treatment in the program I heard was a\nlittle dull. It seems to me that a- subject of this kind could be\napproached from another more entertaining way and still achieve the\nsame result. I have ajso been opposed to assertoric groups discussing\nsomething close to their heart# in a way that lacks broad appeal.\nFor the time being, I wil^ have to say no on RARE EDITIONS.\n- THE AMERICAN TRADITION OF ART gets a yes vote from me but with\nsome reservations. Here again, the talk tends to bog down occasionally\nFurthermore, I would like some sort of introduction other than the\none provided on the tape. Possibly, each station is to provide its\nown. Nonetheless, I was unable to discern any sort of introduction\nand I think it should have one. Finally, I believe the treatment is\njust a little dull and the longer I listened, the more this fellow\nsort of grew on me. The subject is of real merit and while his\npersonality grew on me slowly, it grew steadily. I think this brings\nme up to date. Best wishes.\nSincerely,\nJS/eg\nc.c. to John Holt\nJim Slack\nManager, KUSD"
}