{
  "id": "d996-74",
  "text": "-2-\n6. POSTAL CHARGES, Stations belonging to the Network are now billed every quarter\nfor postage charges. The amount that a station is billed depends, of course,\nupon the number of tapes ordered and the station*s distance from the Network\nHeadquarters, As reported elsewhere, the Association Headquarters has been work¬\ning to have educational tapes so classified in postal law that they may be billed\nat a more equitable rate# The postal-charge billings have been instituted as\npart of the Network*s effort to maintain itself without outside support#\n7. NETWORK OUTPUT. Well over a thousand tapes are being mass-duplicated and indi¬\nvidually dubbed each week# Since the middle of September, a minimum of twenty-\nfive master-tapes have been mass-duplicated each week, and we are using every\ntape available. The Network has tried very hard to emphasize individualized\nservice during the past year, but requests for special single dubs and programs\nseveral months old have made the regular work at times most difficult. Again,\nthe Network Headquarters requests that orders for new series be returned before\ndeadlines# In spite of our continuing need for tape, we would actually prefer\nstations to order possibly unwanted series and later cancel their orders than\nto order series after deadlines and request programs already distributed# We\nare even shorter on time than on tape.\n8. PROGRAMMING. The submission of the much desired quarter-hour programs has been\nencouraged with good results, but once again the supply of these short programs\nhas dropped off. We hope you will take this as your cue to submit a series of\nquarter-hour programs to the Network# BBC series are once again available from\nNetwork Headquarters, after being distributed on a \"bicycle-leg” system from the\nBBC office in New York for the last several years. The programs are now being.\nshipped directly to the stations from Urbana; they are not being bicycled. This\nmakes a wealth of fine material more immediately available to our member stations.\n9# SURVEYS. The Network Headquarters has sent out two questionnaires for the Net¬\nwork School Committee and one questionnaire of its own on distribution. The\nresults of this latter survey have already been reported, but we would like to\nrepeat here that we have found the survey most useful* Two of the most import¬\nant findings were confirmations of things we were already fairly certain of: the\nNetwork membership as a whole prefers a four-season system, and it prefers short¬\ner programs, as noted in the paragraphs above. Within the range of the mate¬\nrial available, the Network Headquarters has done all it could to comply with\nthese preferences. Of course the acceptance of any programs for the Network\ndepends on the various Network committees* judgment of the individual series*\nworth for Network distribution.\n10. SCHOOL PROGRAM WORK. The Network Manager has had four formal meetings with vpi-\nous members of the Network School Committee since the last NAEB Convention. Two\nof these meetings were held in Urbana, one in Columbus, and one in Chicago. As\npreviously reported, these meetings have resulted in a new method of handling in-\nschool programs. The somewhat painful period of change-over to the new system\nis about complete, and the new procedure will be followed hereafter. Very brief¬\nly the new system works like this: In-school series will be offered in the late\nfall or winter and distributed twice. The first time, in the spring, they will\nbe distributed in packages of complete series at a rate of one series a month#\nThe second time, the following fall, all the series will be distributed with\nthe general program offering, a reel from each series every couple of weeks#"
}