{
  "id": "d1428-2",
  "text": "3\nFACILITIES A^ID SERVICE EXCFJ^NGE\nFrank Sohooley (VaLL) and Bob Higgy (WOSU) set a pattern for cooperation\nwhich other members may be able to use to good advantage. „„n-l-hpv\nThe idea is for one member to provide equipment and operating help for anothe.\nin making pickups from the former's home territory—as in football and other\nspecial fvLts. Charge for this service is billed at cost to the station being\n''^''^^Thls eliminates tho necessity for carrying heavy equipment and extra personnel\naround the country. Several members have already expressed their willingness to\nplay ball with otLrs on such arrangements. T.rite directly to the member you want\nto work with.'\nMEMPERSEIP DRIVE\nThis is the opportune time for bringing us the 1947 memberships. Old members\nwill receive their Les statements from Treasurer Griffith. There are \"'any in¬\nstitutions now eligible for membership which need a bit of encouragement and an\ninvitation to join. So. let's start a personalized campaign-every member get\na member! An application blank accompanies this llews-Ietter. tore are available\n-o.. ...\nnow active in educational broadcasting, consider the ™ ‘ ^\ngood prospects who need NAEB-and who are needed by HAEE in the united front\neduoahonh broadcasters must have to adequately represent their interests.\nFACILITIES AND FCC\nAATX (University of Michigan). Applied for extension of time for completion\nof construction. (December 2)\nKSAC (Kansas State College) —granted CP to increase power to 5 to/., install\nnew transmitter and vertical antenna. (November e2)\nOklahoma City Board of Education—granted CP for a new non-oommeroial\neducational FI.i station to operate on 90.7 Ec. 700 watts, 500 ft. antenna.\n(November 21)\nKUSC (University of Southern California)— Formal (dedication ceremonies\nheld on De<3ember 5, 1946 (EM, 91.7 me.) (Capt. Allen G. Hancock, Hancock Foundation)\nGrant Union High School and Teohnioal Collep, North Sacramental, California—\nFCC granted request for cancellation of appli.cation (July , ) or non\ncommercial educational FIJI station, (November 29)\nOUR NORTHERN NEIGHBORS LISTEN , . _. ,. „ _\n-The Nontreal Gazott5~slVs of ^.3. Radio—\"An appalling overcrowding of the\nentertainment ether and excessive advertising has made selective radio listening\nan exasperation and has forced those who like to pick their programs to fo\ntheir luck with local stations\", hell, that should help to build audiences for\neducational stations.\nJAHUARY 1-TII.1E FOR 1947 DUESJ"
}