{
  "id": "d1428-5",
  "text": "STATION REPORTS\nUniversity of Michigan--Ann Arbor.\n-Yj a Ido Abbot repor’oi the extension by the FCC of the completion date for its\nFM station to June 16, 1947. Equipment for the new m station is being received\n\"every few days\". The Civilian production Authority issued a building permit for\nthe construction of a building to house the transmitter at Peach Mo'.;ntain. ^The^\nbuilding is to be approximately 50 x 35 feet-two stories (as it us on a hillside,\nunc story will be partially a basement). The first story inc.udes adages, boiler\nT'.s.;m, switch room and transformer vault for the Edison Company, sh-p, store room,\niiie main floor will include the transmitter room, transcription and announcer’s\nDooth, operator’s lounge, small lobby, repair shop#\nKv'.'SC-^TrYashington State College, Pullman.\n-The station is getting from and ‘giving to \"cyclical programming\" a great deal\nof publicity. A station operator in a nearby state says it has resulted in\"a‘ much\nsnappier schedule than most coppege stations\".\nKY^SC is attempting to develop new regional talent and shows in the Pacific\nNorthwest. In this direction it presents a v;eekly broadcast \"The Lamplighters\"\nfeaturing a 20--voice choir and a nev/ format.\nThe news releases issued regularly by the station serve as a record for future\nreference (and give current informations-thanks). More stations should get out\nsuch summaries of current happenings. KYYSC also publishes lists of the current\naddresses of its \"alumni\" .\nIndiana State Teachers College-Terre Haute.\n-\"The Hoosier Schoolmaster of the Air\", Clarence Morgan, writes asking for a\nstatement for his 1947 membership dues—and so sets a record I He reports the\nfollowing as a year-end summary:\nThe twelfth consecutive year of broadcasting by I.S.T.C. over YvBCY'v saw many\nsignificant contributions made to radio education. In the course of a year the\ninstitution presented 315 broadcasts (4,720 minutes) on the air.\nThe U.S. Office of Education established a transcription lean center in the\nRadio Division of I.S.T.C.\nThroughout the war, a four-page mimeographed bulletin entitled \"Radio Ramblings\nwas sent to men and women who entered the armed forces of the United States. This\nbulletin contained items of current interest concerning campus rad_c activities\nand extracts from letters received from those in the serwice. Approximately three\nhundred of these bulletins v/ere mailed each month from the campus studios.\nTo acquaint listeners of the Y^'abash Valley with broadcasts being presented by\nIndiana State Teachers College over YYBGfY, three thousand post cards were printed\nand mailed to listeners. These cards carried notices of regular program.s and\nannouncements of special broadcasts or the introduction of a new series of programs.\nWKAR-Michigan State College, East Lansing.\n-’^Yhat's' The GooOord\" is a program which is attracting attention because it\nincludes information on the derivation, pronunciation and use of words in a\nfunctional language. It is on the air vJeekly through the speech department.\nBob Coleman reports listeners protesting the shortening of the broadcasting\nday due to earlier sundown sign-off time. Present schedule: 8:00 AM - 5:00 PM.\nYYHA-University of YYi scons in, Madison.\n-in cooperation with the Y,i scons in \"Aeronautics Commission and^the U.S. Yveather\nBureau at Truax Field, the station will present tv;o broadcasts daily of weather in¬\nformation for flyers and travellers. The broadcasts will be done by the meteor¬\nologist directly from the field. These are in addition to the daily general broad¬\ncast frotn the YJeather Bureau on the campus*"
}