{
  "id": "d1000-40",
  "text": "NAtSB\nReport\nRadio Network School Committee\nNovember * 54 - November 9 55\nNAE8\nThe last RNSC formal report to the President was mad© in April, 1955,\nAn interim report was made in April, 1955, for the Columbus meeting,\nA year ago the Committee was enlarged to 9 members and new chairmen appointed.\nSince November, 1954, the Committee has met once (Columbus, April, 1955) with\nnearly all members present. Two meetings with Committee chairmen, and one other,\nwere held on February 10, 11th and September 26, 27th.\nActions of the Committee:\n!• Following the N. Y, Convention, seven program series were selected and pre¬\npared for Headquarters4 offering.\n2. Advised the Grants-in-Aid Committee on school program types for possible\nfuture consideration.\n3. Held special meeting at Urbana, February 10-11, of Chairman and two Sub¬\ncommittee Chairmen. This meeting resulted in the following actions taken\n(with full Committee participation and approval by mail):\na) Set up a new system of submitting, offering, and distributing\nschool programs;\nb) Added new type of school program, to be solicited from and\noffered to Association members;\nc) Revised previously circulated memo sheets describing and advising\nmembership on the school program service;\nd) Set up list of new duties-responsibilities for Committee members\nunder the new reorganization (November, 1954).\n4. Discussed, outlined, and proposed to the President and Board that a change\nbe made in the Network program service fee charged a station subscribing\nto school programs. There was full Committee participation by mail.\n5. Readjusted to the resignation of J. J. Stillinger of Cleveland and to the\ntemporary loss of active services of George Johnson of Indiana University.\n6. Held a special meeting in Chicago, September 26-27, of the Chairman, Vice-\nchairman Marguerite Fleming, and the Acceptance Subcommittee. This meeting\nresulted in the following actions:\na) Acceptance Subcommittee resolved the selection of the October, 1955,\nprograms for Network use;\nb) Outlined plans for program selection criteria and their publication;\nc) Devised and produced new announcement sheets for program offerings\nat the Chicago Convention;\nd) Revised and produced information sheets for school program submitters\nand for program subscribers;\ne) Resolved to do something about setting up policy for handling requests\nfor previously and currently offered school programs on the Network;\n7. Surveyed Network subscribers to school programs on use made of the service\n(in progress as of this date);\n8. Prepared fact sheets on Committee work and the school program service."
}