{
  "id": "d1000-41",
  "text": "NAEB\npage 2, Radio Network School Committee Report\nNAEB\nSubJecta/iterns of Committee concern or under Committee consideration:\n!• ^ethods of evaluating programs after use on Network stations.\n2. How, when, and if to help up-grade the production and use of good\nschool broadcasts within the Association.\n3. How to encourage and bring about the production of school program\n\"durables\" under the Grants-in-Aid program of NAEB.\n4. The problem of how to inculcate the fact that the RNSC is dedicated\nto the proper and wider use of good school broadcasts that are service¬\nable throughout, that the Committee is not an Oscar-awarding board, and\nhow to do this without incurring needless personal or professional ill\nfeeling.\n5. The distribution, exchange, and use of school programs outside the NAEB\nand the NAEB Network and the relation this has to the general health of\noar Network school program service.\nThe Committee earnestly makes the following recommendations:\n1. That the Acceptance Subcommittee be enlarged to seven members.\n2. Since the development of school programming in NAEB and within it3 Network\nhas brought about increased interest in and use for programs on a nation¬\nal basis; and further, since the number of individual and direct requests\nby station operators, schools (public'and independent). Associate NAEB\nmembers, and commercial stations for current and past Network program\nofferings has grown to present what seems to be an unsolvable problem,\nnamely, how to regulate, distribute, and administer fairly school Dro^rams\nthrough Headquarters and the Association; the Committee recommends that\nthe Board and Headquarters'* officials study the problem and establish\npolicy and procedure for handling such direct requests for school program\nseries which have been or are currently being used on the NAEB Network.\nHumbly and sincerely submitted.\nRADIO NETWORK SCHOOL COMMITTEE\nJohn Henderson, WBAA\nChairman\nOla Hiller, WFBK, Vice-Chairman\nArlene McKellar, WHA\nMarguerite Fleming, KSLH, Vice-Chairman\nMcCabe Day, WVSH\nMarie Scanlon, WBGO\nGeorge Johnson, IfVFIU\nVernon Bronson, WTHS\nOctober 1, 1955"
}