{
  "id": "d1879-1",
  "text": "mediately placed in service. Ampex has announced\nthat it will deliver more than 100 units of the pro¬\nduction model videotape recorder by April in time\nfor Daylight Savings Time operation. It has also\nannounced that a new unit to convert its mono¬\nchrome recorder to color operation will be available\nand delivery of prototype models of this device is\nexpected to begin in June.\nOn October 21, RCA demonstrated a prototype\nmodel of its color video tape recorder. NBC expects\ndelivery of six of the new color recorders in April\nand will install color “tape centrals” in both its New\nYork and Burbank studios. Prototype models of the\nRCA color recorders will sell for $96,000 with de¬\nlivery expected to begin in September of 1958. RCA\nalso has announced that it expects to have produc¬\ntion models of both color and monochrome video\ntape recorders available for delivery in December\n1958. Prices have been set at $63,000 for the color\nrecorder and $49,500 for the monochrome version.\nWith the TV networks expecting to furnish pro¬\ngrams to affiliates on a clock time basis by the use\nof magnetic tape recorders, the era of video tape\nwill truly begin with the advent of Daylight Savings\nTime in 1958.\n*****\nIt is with deep regret that we must inform you of\nthe death of Clement E. LaFond, Chief Engineer of\nWKNO-TV in Memphis. He was stricken with a\nheart attack and died at his home on December 21.\nHis untimely death at 43 was a shock to his family\nand associates.\nMr. LaFond was one of the first members of the\nstaff of WKNO-TV and designed the stations en¬\ngineering facilities. He engaged' in every type of\nactivity as well as engineering to help activate Chan¬\nnel 10 in Memphis. He was formerly employed as an\nengineer at KTJHT, the pioneer ETV station at the\nUniversity of Houston. He received his BA in Radio\nand Television at the University of Houston in 1951\nand his MA there in 1953.\nMr. LaFond is survived by his wife and a daugh¬\nter, Michelle.\nDid you see -\nSpecial Report on ETV Broadcasting Nov. I I\nPCC Mobile TV Monitor Broadcasting Dec. 2\nNew York State Seeks Channel 13 Broadcasting Dec. 9\nRCA has announced that it is developing new\ntype fm broadcast transmitters and complementary\nmultiplexing equipment. By late 1958, they expect\nto have a complete line of fm transmitters designed\nfor multiplex operation. The line will include the\nfollowing: a 10 w exciter-transmitter; a 250 w fm\ntransmitter; a 5kw fm transmitter, and multiplex\nsubcarrier generator equipment for use with RCA\nmultiplex exciters.\n*****\nThe FCC has authorized a TV translator station\nat Redwood Falls, Minn, to rebroadcast the pro¬\ngrams of KTCA-TV St. Paul’s educational TV sta¬\ntion.\n*****\nGeneral Electric has announced a new and smal¬\nler type of live color TV camera at the opening of\nits new WGY-WGRB (TV) broadcast center in\nSchenectady.\nThis new camera uses three image orthicon tubes\nbut weighs 75 pounds less than most models. It is\nabout ten inches shorter, three inches narrower and\nan inch lower than current cameras. Printed circuits\nand transistors have been used to cut down size. A\nnew optical system eliminates many glass surfaces\nand special circuitry, it is claimed, insures truer re¬\ngistration of colors with no blur or run over into\nother colors.\nA pre-production model was demonstrated, how¬\never GE expects to put the new camera into produc¬\ntion soon. The expected price is around $50,000 com¬\npetitive with other makes.\n*****\nFCC on December 18 proposed rule making un¬\nder Docket No. 12274 to permit daytime stations to\nget longer operating hours. The Daytime Broad¬\ncasters Association has proposed operation from 5\nAM or local sunrise (whichever is earlier) to 7 PM\nor local sunset (whichever is later) instead of pre¬\nsent sunrise-sunset only provisions. Comments on\nthis proposal are due March 18, reply comments 30\ndays later. For complete text see Federal Register,\nDec. 24, 1957.\n*****\nVorce C. McIntosh, Chief Engineer, University\nTV and Radio, The University of New Mexico at\nAlbuquerque, is looking for an RCA Type TC-4\nAudio-Video Switcher. If you have one for sale\nplease contact him.\n*****\nJust before deadline, we received a communica¬\ntion stating that WRTI-FM, Temple University in\nPhiladelphia, has installed a new 500 watt fm trans¬\nmitter. It is the first transmitter to be manufactured\n2\nENGINEERING NEWSLETTER"
}