{
  "id": "d1448-2",
  "text": "NAEB NEWS LETTER\nPage 3\nMay I, 1945\nIf NAEB members feel they NEED SOME INSPIration, I CAN recommend that\nTHEY SPEND AN HOUR OR TWO WITH MaC AND JUST TALK EDUCATIONAL BROADCAST INGo\nIt*s worth a trip to Madisono\nWHA IS REALLY ONE OF THE PIONEERS NOT ONLY IN EDUCATIONAL WORK BUT IN\nRADIO BROADCASTING AS WELL, It STARTED OPERATING IN FEBRUARY > 919» AND\nI BELIEVE MANY EXPERIMENTAL POWER TUBES WERE TRIED OUT IN THE ORIGINAL\nWHA TRANSMITTER, As WE ALWAYS ASSOCIATE WHA AND McCaRTY> LETJS START IN\n1929 WHEN Mac FIRST made HIS APPEARANCE as THE COMPLETE STAFF AND CARRIED\nON A DAILY PROGRAM OF I| HRS,, FIVE DAYS PER WEEK, I 8ELIEVE STUDIOS\nWERE IN THE ^LECTRICAL ENGINEERING BUILDING AT THAT TIME. The STORY OF\nWHA UNDER MaC*S DIRECTION IS ONE OF PHENOMINAL EXPANSION WAS FORMERLY A\nMINING ENGINEERING LABORATORY BUT WITH SOME WPA HELP IT NOW IS ONE OF\nTHE MOST ATTRACTIVE ANO USEFUL RADIO BUILDINGS l8VE HAD THE PRIVILEGE OF\nVISITING. IF YOU HAVEN8T RECEIVED WHA BULLETINS, WR) TZ ANO ASK FOR 9DME.\nThey contain pictures and descriptions of the studios, as well as a\nRATHER COMPLETE PROGRAM SCHEDULE, WHA OPERATES FROM 7?30 A.M. TO LOCAL\nSUNSET SIX DAYS PER WEEK AND FROM NOON TO 5:45 P.M, ON SUNDAYS, IT USES\nA 5 KW TRANSMITTER LOCATED AWAY FROM THE STUDIOS, ANO AS IT IS OF A\nCOMPOSITE NATURE, WILL BE REPLACED AS SOON AS EQUIPMENT IS AVAILABLE.\nMost of the studio equipment was constructed by Chief Engineer John\nStIEHL and IS VERY SATISFACTORY, A GREAT DEAL OF RECORDING IS DONE AT\nWHA AND FOR THIS PURPOSE, A SPECIAL RECORDING ROOM HAS BEEN CONSTRUCTED,\nPlans for a Wisconsin State FM network include the installation of seven\n10 KW transmitters but as yet no construction permit application has\nBEEN SUBMITTED, ANOTHER 5 KW STATE STATION (WLBL) fS LOCATED AT STEPHENS\nPoint, about 120 miles north of Madison, and carries an average of four\nPROGRAMS DAILY FROM WHA AS FED BY TELEPHONE LINE, ThE STAFF OF WHA\nINCLUDES TWENTY-FOUR FULL TIME EMPLOYEES AND SOME EIGHT PART TIME STUDENT/\nWORKERS, That is a staff anmone of us would like to have! Much of the\nSTAFF TIME IS SPENT ON THE WISCONSIN SCHOOL OF THE A|R ANO THE RESULTS\nARE INDEED GRATIFYING, MAC CAN SUPPLY ANY NUMBER OF FIGURES TO PROVE\nTHIS FEATURE IS ONE OF THE MOST SUCCESSFUL, If YOU WRITE TO HIM, ASK\nHIM FOR A COPY OF HIS ANNUAL REPORT - FEBRUARY 5, 1945, It CONTAINS A\nLOT OF INTERESTING MATERIAL TOO LENGTHY TO INCLUDE IN THIS BRIEF REPORT.\nMAC HAS ALSO TAKEN ADVANTAGE OF SOME GOOD NEWSPAPER PUBLICITY ANO GAVE\nME CLIPPINGS FROM THE M i LWAUKSE, JOURNAL AND OTHER EVIDENCE THAT HE\nBELIEVES IN ADVERTISING A FINE BROADCAST PROGRAM, HfS IS ONE EDUCATIONAL\nSTATION THAT BROADCASTS POLITICAL TALKS BY CANDIDATES FOR PUBLIC OFFICE AND\nMANY OF US COULD LEARN MUCH FROM HIS ASTUTE WAY OF HANDLING THIS FEATURE,\nNo MATTER HOW HE DOES IT, I GET THE FEELING THAT THE PEOPLE OF WISCONSIN\nNOT ONLY LISTEN TO WHA, BUT THINK OF IT AS ONE OF THEIR FIRST LISTENING\nchoices. That is an accomplishment when we consider all the commercial\nCOMPETITION IN LOWER WISCONSIN.\nHere is a brief commercial — WHA is holding an FM Educational Radio\nInstitute July 29 - august II. The fee is very reasonable and after\nLOOKING OVER THE PRELIMINARY OUTLINE, IT LOOKS LIKE ONE OF THE BEST I 8VE\nEVER SEEN,\nCHICAGO RA0I0 COUNCIL ORIGINATES TELECAST\nOver WBKB, Chicago Television station, the Radio Council will present\nA PROGRAM IN COOPERATION WITH THE Art DEPARTMENT, AS PART OF THE WESTERN\nArts Association meeting, Friday, May II, 8:00-8:30 p.m."
}