{
  "id": "d1448-6",
  "text": "NAEB NEWS LETTER\nRage 2\nMay I, 1946\nRELIABLE SOURCES AVAILABLE AND STUDIED CAREFULLY. 0N THE 6ASI8 OF THIS\nSTUDY A TELEGRAM WAS SENT TO CHAIRMAN PAUL PORTER OF THE FCC» The CONTENT\nOF THIS TELEGRAM HAS NOT BEEN RELEASED FOR PUBLICATION BECAUSE THE NAEB\nIS INTERESTED ONLY IN ASSISTING THE FCC IN ITS DELIBERATIONS ANO NOT IN\nBECOMING A PARTY TO ANY OF THE PUBLIC DISCUSSIONS OF THE ISSUES INVOLVED,\nTHE CLEAR CHANNEL HEARING\nExtreme interest in the opportunities for educational stations in the\nFORTHCOMING CLEAR CHANNEL HEARINGS WAS IN EVIDENCE IN THE MEETING,\nReports from the stations represented gave background material for the\nDISCUSSION OF THE PROBLEM• BECAUSE THE FCC HAS GIVEN INDICATIONS THAT\nTHERE ARE SUB-MARGINAL AREAS WHICH DON8T RECEIVE SATISFACTORY RADIO\nSCRVICC, AND BECAUSE NON-COMMERClAL STATIONS ARE IN A POSITION TO GIVE\nSERVICE TO SUBMARGINAL AREAS IT WAS OECIOED THAT THE NAEB SHOULD STUDY\nTHIS PROBLEM CAREFULLY AND DO WHAT IT COULD TO PROMOTE THE INTERESTS\nOF ITS MEMBERSHIP, PrESIOENT ScHOOLEY APPOINTED A SPECIAL COMMITTEE TO\n8TUOY THIS PROBLEM ANO TO MAKE RECOMMENDATIONS FOR APPROPRIATE ACTION*\nThe committee: McCarty, Chairman, Menzer, and £bel. A questionnaire\nWILL BE SENT to THE MEMBERS OF NAEB IN THE NEAR FUTURE TO GET ACCURATE\nDATA ON THEIR PRESENT OPERATIONS ANO FUTURE PLANS TO PROVIDE A BASIS\nFOR ANY UNIFIED ACTION WHICH MIGHT BE CONTEMPLATED*\nMISCELLANEOUS\nTHE GROUP IN ATTENDANCE RECOMMENDEO THAT THE NAE8 PUT ON A DRIVE TO\nOBTAIN THE MEMBERSHIP OF ALL THE NEW FM STATION WHICH WILL BE ERECTED\nBY EDUCATIONAL INSTITUTIONS AFTER THE WAR# YOU CAN HELP IN THIS EFFORT\nBY PERSONALLY CONTACTING ANY APPLICANT KNCWN TO YOU.\nPresident Tyler of the A£R appointbd Schooley -Chairman, Men2Er, and\nMcCarty as awLva*son committee for the development of cooperation between\nthe A£R and NA£8.w The membership at this meeting of NAE8 recommended\nthat President Schooley appoint a committee for naEB to work on this\nUNDERTAKING. PRESIDENT ScHOOLEY APPOINTED THE SAME COMMITTEE LISTED\nABOVE TO REPRESENT NAE8. It SEEMS THAT ,5LlAlSONH IS ALREADY TAKING PLACE.\nA REPRESENTATIVE OF THE RMA WAS ASKED TO RECOMMEND TO THAT ORGANIZATION\nof Radio Receiver Manufacturers that all FM receivers manufactured\nSHOULD TAKE IN THE ENTIRE BAND INCLUDING THE EDUCATIONAL PORTION WITH\nAN OVERSHOOT ON EITHER END TO PROVIDE FOR IMPROPER ALLIGNMENT OF THE\nRECEIVER AND THE RESULTING SHIFT IN DIAL READINGS.\nPrexy Schooley9s ribs are still sore. «t seems that he loused up the\nCALL FOR THE MEETING SO THAT THE MEMBERSHIP COULD HAVE ASSEMBLED ON\nANY DAY BUT WaSHINGTON*S BIRTHDAY ANO STILL BEEN WITHIN THE ACCURACY\nOF THE CALL» JENSEN OF WCAL WAS THE ONLY MEMBER TO OUR KNOWLEDGE WHO\nGOT CAUGHT IN THIS TANGLE OF MIXED DATES AND HAD TO COMMUNE WITH HIMSELF\non Friday. In behalf of the membership of NAEB, Mr. Jensen, I apologize\nFOR OUR PRESIDENT,\n—Ebel"
}