{
  "id": "d1502-1",
  "text": "AUTOMATIC LOGGING £ INSPECTIONS\nSince the release of the new regulations pertaining to inspections and\nautomatic logging, the FCC has received several petitions asking for reconsideration,\nespecially from 10 v FM educational stations which have indicated that the inspections\ncalled for in the new regulations would work a considerable hardship on them. We\nanticipate that favorable consideration will be given this matter by the FCC and that\n10 w stations may be exempted from the more stringent requirements.\nNEW EDUCATIONAL STATIONS PLANNED\nThe Arkansas ETV Commission (Tom Tyler, Chairman) has applied for a new ETV\nstation on Ch. 2, Little Rock. ERP: V - lOOkw; A - 50kw; Antenna height - 1014;\nunlimited hours. The last General Assembly of Arkansas appropriated the funds for\nconstruction of one station and its operation, presuming said funds could come from\nsurplus revenue. On June 17 Gov. Faubus informed Chm. lyier that the funds are\navailable.\nEastern Washington State College (Cheney) applied (May 31) for a CP for a new\nnoncommercial educational FM station to be operated at 10 w on 89*9 me.\nFILING OF FCC REPORTS\nSeveral members have requested information about dates for filing the various\nFCC reports. License Renewal (FCC Form 342) must be filed every three years, based on\na geographic distribution as outlined in Bart 3* Vol. Ill of FCC Rules and Regulations.\nHerewith the next filing dates for the various states: 8/1/63 - Del. & Ba; 10/1/63 -\nD.C., Md., Va., W. Va; 12/1/63 - N.C. & S.C; 2/l/64 * VlM - Ala. & Ga;\n6/1/64 - Ark., la., Miss; 8/l/64 - Ind., Ky., Term; 10/l/64 - Mich. & Ohio; 12/1/64 -\nIll. & Wise; 2/1/65 - Mo. & Iowa; 4/l/65 - Colo.,Minn., N.D., S.D., Mont; 6/1/65 -\nKans., Okla., Nebr; 8/1/65 - Texas; IO/1/65 - N.M., Wyo., Ariz., Id., Nev., Utah;\n12/1/65 - Calif; 2/1/66 - Alaska, Hawaii, Ore., Whsh; 4/l/66 - Conn., Me., Mass., N.H.,\nR.I., Vt; 6/1/66 - N.J. & N. Y. Subsequent renewals fall every three years thereafter.\nOwnership Reports (FCC Form 323 E), three-year periods filed at time of License\nRenewal or to be filed by licensees or permitees within 30 days after the consumation,\npursuant to FCC consent, of a transfer of control, or an assignment of license or the\ngrant of an original CP; or by licensees or permittees within 30 days after changes in\nthe information called for by this form (changes in boards of trustees, directors, etc.).\n(See Sec. 1.343 (e), Vol. I, Bart 1, Subpart D, FCC Rules and Regulations.)\nFinancial Report (FCC Form 324), annual report due April 1, each year. Mailed\nout by FCC during second week of February at latest. NAEB members are urged to pay\nmore attention to this form. It is our understanding that the manner in which members\neither neglect to respond or file incomplete forms is a matter of concern at the FCC\nand they are quite shocked by the attitude of the educational broadcasters to wham they\nhave tried to give every \"break.\"\nFCC AUTHORIZES NEW EDUCATIONAL STATIONS\nGranted (ifey 17) to Glassboro (N.J.) State College, CP for new Class D\nnoncommercial educational FM station on 89.7 me with 10 w.\nGranted (June 3) CP to Georgetown (Ky.) College for a new Class D noncommercial\neducational FM station to operate on 90.1 me, 10 w.\nGranted (June 5) licenses for the following noncommercial educational FM stations\nWHCL-FM, Clinton, N.Y., WGSU, Geneseo, N.Y; and WRRH, Franklin lakes, N.J.\nGranted (June 14) CP to Bowling Green (Ohio) State U. for a new noncommercial\nETV station to operate on Ch. *70; ERP 10.1 kw visual & 5*5 £w aural; antenna height\n170 ft."
}