{
  "id": "d1426-4",
  "text": "news Letter\nPage 5\nAUGUST i.946\nrr.W PARIN G! PATEP IN ONLY ONE BROADCAST* PUPiLS FROM West LAFAYETTE HhIH\nSchool were selected from speech classes^ those from St* Francis from\nSOCIOLOGY CLASSES# AND AT JEFFERSON ^IGH SCHOOL PARI i CD PANTS WERE TAKc'v\nFROM THE rLASS \"CURRENT PROBLEMS\",? ThE STUDY CONTENT OF THIS CLASS ATf\nJefferson was based on the oiscuss{of4 subjects used sn the programs broad¬\ncast*\nThe program is produced and oirectel by John Henderson, WBAA»s Educational\nSupervisor.\ni B.K V IS ON THE A!R THRICE WEEKLY.\n'•SKY {S 0^ THE A;R EVERY MONDAY, WEDNESDAY# AND FRIDAY NIGHT, FROM SEVEN\nTO NINE PvM,. I HOPE YOU ARE LISTENING REGULARLY* ThREE WEEKS AGO THE\nfirst pOSr-vYAP FM SETS REACHED THE LeXINGTON MARKET AND WERE QUICKLY SOLD*\nPlease li me know the names of FM set owners who are not getting the\nBULLETIN, AND MAY WE HEAR FROM YOU REGARDING OUR STATION SAYS ELMER G.\nSULZER.\nFCC act:ONs\nThe APPLICATION OF !owa State College# Ames, Iowa, for a construction per¬\nmit FOR A NEW NONCOMMERCIAL, EDUCATIONAL BROADCAST STATION WAS AMENDED\nTO CHANQi FREQUENCY TO 91*5 MEGACYCLES, CHANGE TYPE OF TRANSMITTER AND TO\nMAKE changes in ANTENNA SYSTEM* APPLICATION WAS ACCEPTED FOR FILING ON\nJULY 10:.\nThe FCO granted a conditional construction permit to the Providence Bible\nInstitute, PrOvioence, Rhode Island, for a mew station on Channel No, »\n(38^1 megacycles). Action was taken by the Commission on July 12*\nWCAL, St. Olaf College, Northfield, was granted petition to dismiss without\nPREJ-JDCc ITS application FOR MODI Fi CAT I ON OF LICENSE (OOCKET 7532;\n8229) * Action was taken by FCC on July 13*\nKUOM, University of Minnesota, Minneapolis, was granted peition to dis¬\nmiss VYITHOUT PREJUDICE ITS APPLICATION FOR CONSTRUCTION PERMIT* ACTION\nWAS TAKEN ON JULY 13*\nThe application of WNYE, Board of Education, New York City for a con¬\nstruction PERMIT TO SPECIFY FREQUENCY TAS ChaNP^IEL 219, 9S*7 MEGACYCLES, TO\nchange power to 10 KILOWATTS, AND TYPE OF TRANSMITTER AS WELL AS CHANGE\nIN ANTENNA SYSTEM, WAS ACCEPTED FOR FILING BY THE FCC ON JULY 13*\nThe APPLijCATioN OF W80E, Cleveland Board of Education, was accepted for\nfiLiNi;?* ApoLTCATION REQUESTS CONSTRUCTION PERMIT TO SPECIFY 90*5 MEGA¬\nCYCLES, POVER TO 3 KW, and change OF TYPE OF TRANSMITTER AND CHANGE IN\nANTENNA SYSTEM* APPLICATION WAS ACCEPTED ON JULY 53*\n%'SUI, State University of Iowa, was granted permission to reduce hours of\nCPE.-ATI ON TO A MINIUMUM OF SIX (S) HOURS DAILY 8N ORDER TO OBSERVE-THE\nUniversity summer vacation, August 7 to Septebber 23* Action was taken\nON July 17*"
}