{
  "id": "d979-24",
  "text": "February l£, 1956\nMiss Jean Silenius\n123 North Walnut Street\nRavena, Ohio\nDear Miss Sileniusj\nI have just had forwarded to me the letter dated April 25# 195>3>, which you\nsend to Mr. George Jennings, our business manager, who is located in the national\noffice of the Association for Education by Radio-?eletoision in Chicago.\nMr. Jennings indicated that he answered your letter last spring and apparently\nsent you the information on the use of radio as a teaching divice, which you re¬\nquested.\nIt occurs to me that you may well be interested in becoming affiliated with\nAERT yourself. Since it is an organization which is dedicated to a program of\nexpanded utilization and evaluation of educational radio and television materials,\nboth in the commercial and non-commercial broadcasting industries. The national\nmembership of AERT includes teachers and administrators on all levels of education,\nin addition to commercial broadcasters, religious broadcasters, parents, civic\nleaders, and representatives of many other business and professional groups.\nThe officers and directors of the Association are embarking upon a program\nof expanded activities which, if successful, will be rewarded in the future\nsignificance of the Association in the field of educational radio and television.\nWe feel that AERT has a vital function in our society, and we would like to in¬\nvite you and your colleagues to join with us in this important work.\nI am enclosing a sample cope of the AERT journal, which is published eight\ntimes during the academic year and contains many significant articles prepared\nby members of the Association.\nI am also enclosing a copy of our membership blank which contains a complete\nstatement of the objectives and advantages of membership in the Association.\nI hope you will favorably consider this invitation, and further, that I will\nhave the pleasure of meeting you at our national convention in Columbus, Ohio in\nApril.\nSincerely,\nJARjle\nEncs.\nJohn Adams Rourke\nNational Membership Chairman\nAEHT"
}