{
  "id": "d979-77",
  "text": "N\"CH,e\nMICHIGAN STATE UNIVERSITY\nOF AGRICULTURE AND APPLIED SCIENCE • EAST LANSING\nCOLLEGE OF COMMUNICATION ARTS • DEPARTMENT OF SPEECH\nSeptember 17, 195^\nDear Frank:\nI have digested the General Not for Profit Corporation Act of the State\nof Illinois and have arrived at the answer to the required procedure for\ncorporation consolidations. You will note, from the enclosed letter to\nArlene KcKellar, that implementation is under way toward the calling of a\nmeeting in Atlanta during the NAEB Convention, If all goes well, we should\nbe able to bring the proposal to an AERT vote at that time.\nWill you have a copy of the list of AERT Members and their addresses\nsent to Arlene right away so that she can begin the preparation of the\nmailing prior to October 1. Of, if you prefer to mail from Urbana, let her\nknow and she will send the mailing materials to you. In order to save time,\nplease communicate directly with her and make whatever arrangements you\nprefer. No need to include the subscribers to the JOURNAL who are not\nmembers nor the associates; only the actives and the institutional.\nHere are the legal procedures in Illinois which both AERT and NAEB will\nneed to follow. The law specifies that the Boards of Directors of each\norganization to be involved in the consolidation shall adopt a resolution\napproving the proposed plan and directing that it be submitted to a vote\nof the members. Written or printed notice setting forth the proposed plan\nor a summary thereof must be given to the membership of each association\nnot less than five days nor more than forty days before the date of the\nmeeting. In the Articles of Consolidation, we will need to sign a notarized\ndocument verifying that a quorum of the members of our respective associations\nwas present at the meeting when the proposition was voted upon and that the\nplan received at least two-thirds of the votes entitled to be cast by members\npresent or represented by proxy at such meeting. I trust that you will\ntake care of the procedure in so far as NAEB will be involved. If we can\nget at least 10f0 of our AERT membership to attend or designate proxies^ and\nthis we should be able to do, we apparently can proceed with a vote in Atlanta.\nWill you also make arrangements for the Presidents and Secretaries of\nthe two Associations to meet with a notary following the two membership\nbusiness meetings in Atlanta, in the event of affirmative membership voting\non the proposal, to finalize the action legally? I'll bring the Articles\nwith me. We will need the corporate seal for NAEB and signatures of the four\nofficers before the notary. The signing ceremony should call for newsmen\nand photographers, don't you think so?\n\"IT IS FOR US THE LIVING\nTO BE DEDICATED HERE TO THE UNFINISHED WORK\nLINCOLN"
}