{
  "id": "d1476-3",
  "text": "These new features are: adequate cueing facil¬\nities, convenient switching devices, ready syn\nchronization with other studio apparatus, tape inter\nchangeability among recorders, ease in making du¬\nplicate copies of taped programs and easy editing.\nWhile all of the above features are of interest tc\nETV engineers, this is the first mention that Ampex\nhas made of “duplication” of videotape recordings\nOfficials of the Ampex Corporation have been verj\nconservative in their statements regarding theii\nvideotape recorder. They now forsee three steps in\nthe evolution of monochrome videotape: 1) Strictlj\nfor delayed broadcast, 2) Prerecording of TV shows,\n3) Syndication and multiple release of taped pro\ngrams for TV.\nTV TECHNICAL TIPS NO. 30\nIn the February Newsletter we led off this column\nwith a story about the revised NAEB Technical Di¬\nrectory. If you anticipated receiving a copy of the\nDirectory before this, it isn’t lost in the mails.\nAs I write this, stencils are being cut, and we\nhave a promise that it will be in the mail the first\nweek in March. The Test Equipment Inventory has\nbeen completed; the stencils cut, and it, too, should be\nmimeographed and in the mail that week.\nThe Technical Directory will go to the complete\nEngineering mailing list; the Test Equipment In¬\nventory will be sent only to chief engineers.\n* * * *\nWe’ve had a note from John Brugger, chief en¬\ngineer for the closed circuit TV experiment conducted\nby the Board of Education of Washington County at\nHagerstown, Md., in conjunction with the Radio-\nElectronics TV Manufacturers Association and the\nFund for the Advancement of Education.\nHe states that during the summer months from\nJune to September they will be expanding their tech¬\nnical facilities. He will need extra technical help for\nthese months and will be happy to employ at least\nthree and possibly six persons to help with this work.\nIf any of our readers are available for the sum¬\nmer and are interested, you can write direct to John\nin care of the Board of Education at Hagerstown,\nMd.\n* * * *\nHere’s a tip from Robert F. Lewis, chief engineer\nof WFBE (FM) Flint, Michigan, which may foster\nbetter engineering-production relationships.\nDue to the difficulty in cueing microgroove rec¬\nords and their susceptibility to damage, WFBE\n(FM) does not use them directly for program pro¬\nduction work, such as in themes, bridges, etc. In¬\nstead the music for each production is tape recorded\nin proper sequence in advance. The tape is then used\nduring the production.\nThis method cuts down the error potential to\npractically zero, plus reducing wear and tear on discs.\nFor playback a fast-starting tape unit, such as the\nMagnecorder PT6 series, works very well.\n* * * *\nFifty thousand engineers are expected to attend\nthe 1957 Convention of the Institute of Radio En¬\ngineers and the Radio Engineering Show in New\nYork City at the Coliseum and Waldorf Astoria,\nMarch 18-21. The program includes 275 papers re¬\nporting new developments with 840 exhibits of new\napparatus covering all four floors of the Coliseum.\nWe hope to meet some NAEB engineers there\nand will be checking the bulletin board near the reg¬\nistration desk to find out how we can get together.\n* * * *\nAnother date to remember is the NARTB En¬\ngineering Conference and broadcast equipment dis¬\nplay at the Conrad Hilton in Chicago April 8-11.\nThe past two years through the cooperation of\nNARTB we have provided educational station en¬\ngineers who wished to attend with NAEB identifica¬\ntion cards. This card entitled them to register for the\nEngineering Conference sessions only, and also per¬\nmitted' entrance to the equipment exhibits by pay¬\nment of a daily or reduced registration fee for the en¬\ntire meeting.\nWe hope this privilege will be extended for the\nApril meeting. A further notice will be forthcoming\nwhen definite approval of this procedure has been\nobtained.\n* * * *\nWe have occasional inquiries about the avail¬\nability of used equipment member stations may have\nand are not using. This is especially true of used fre¬\nquency modulation transmitters. The most recent\ninquiry asked where a used 10 watt FM transmitter\nmight be obtained.\nWe realize many tax supported stations find it\nvery difficult to dispose of unwanted equipment. But\nif any of our readers have serviceable equipment\nwhich might enable an institution to get on the air,\nwe’d be glad to help buyer and seller get together.\n* * * *\nPage 4"
}