{
  "id": "d1476-3",
  "text": "ETV station, KCET, a booth at the show, from which clips\nof fall programs were shown. Also, proceeds from ticket\nsales to the Home Show on its opening night were given to\nKCET.\n^ WJCT-TV, Jacksonville, filmed highlights of the 1964\nFlorida Polio Conference, and the films will be available to\nany TV station in a community which is promoting oral polio\nvaccination clinics.\n^ Memphis State University has expanded its speech and\ndrama department to include a radio-TV curriculum. Classes\nwill be conducted in association with WKNO-TV, with the\nstation’s general manager, Howard Holst, becoming a part-\ntime faculty member.\n^ After an audience survey, Nashville’s WDCN-TV reports\na 650,000 potential, with 48.4% of the homes occasionally view¬\ning ETV.\n^ The Atlanta Journal recently devoted a full page to a\nspread on WETV-TV’s weekly teenage current events dis¬\ncussion telecast, Our World Today.\nINTERNATIONAL\n^ Tess Thomas writes that the government of Jamaica is\nsetting up ETV for elementary schools, with an on-air target\ndate of September. Mrs. Thomas and Mrs. Joyce Lalor have\nbeen in training at New York University to undertake work\nwith the new station as producer-directors.\n^ The first school TV program in the Netherlands was aired\nlast October 22. It featured the city of Basel, Switzerland.\nSucceeding programs through the fall, as reported in Tele-\nvisie Nieuws, were also geographical in nature.\n^ Ham radio operators in Japan will soon be allowed to set\nup amateur TV stations. They will use the 430-440mc band.\nRadio Japan News reports that there are 52,000 amateur radio\noperators in Japan, second only to the U. S.\n^ Seventeen thousand Japanese educationists and citizens at¬\ntended their 14th National Convention on Education Broad¬\ncasts this year, which was held at twenty sites. Major topics\nwere broadcast education in the home, the role of broadcast¬\ning in developing imagination, ethics, and intellect in chil¬\ndren, the relation of school broadcasts to classroom education,\nand expansion and control of broadcast facilities. Over 72\nper cent of Japanese families own a TV set.\nf Mexico, which spends far more on education than for de¬\nfense, is turning to television as a weapon against illiteracy.\nWith mechanics handled by the communications industry and\nprograms supervised by the Education Ministry, the special\ntelecasts will be beamed from Mexico City at first, to Mexico’s\ncentral area. Later they will be extended to every corner of\nthe country.\n^ Japan has displaced the United Kingdom as the second TV\ncountry following the U. S., reports TV Digest. At the end\nof 1963, Japan had 14 million sets and 80 stations. Of the\ncountries just beginning to have television last year, half\nwere African.\nPLACEMENT\nPERSONNEL AVAILABLE\n[For information, write Miss Julie Hunt, Placement Service,\nat the NAEB office in Washington.)\nAugust I Management, organization, planning, development,\nprograming. Just completed 10 years overseas develop¬\ning TV in Middle East and Africa; 8 years as producer/\nprogram director including network and small station\nexperience. Emphasis ion personnel, utilization, training.\nAugust 2 Married male with long experience in broadcast\nproduction and engineering now seeking responsible\nleadership position where over-all knowledge of TV is a\nmust. B.A. in radio and TV, license. Salary $10,000.\nAugust 3 ETV producer-director, 23, married, I-year-old child.\nMaster's in radio-TV, Temple U. B.S. in communications,\nSouthern Illinois U. Experience as director with GCTV,\ncorrelator with WHYY-TV, WSIU-TV. Currently employed\nby NBC-TV. Wife holds M.S. in elementary education,\nso we understand problems of educational and instruc¬\ntional telecasting at all grade levels. Salary: over $6500.\nLocation open.\nAugust 4 I'm young, creative, ambitious, and experienced.\nIf these are qualities you seek in TV directors, then I'm\nyour man. Requirements for M.A. almost completed, but\ncan go to work now.\nAugust 5 Married man, 28, expects to receive M.A. in radio-\nTV in August. Three years commercial experience in\nmajor Midwest market with news, sports, and public af¬\nfairs directing experience. Extensive background in docu¬\nmentary film production and writing. Desires position\nteaching radio-TV, or responsible and challenging writ¬\ning-production position.\nAugust 6 Single man, 29, B.A. (cum laude) in public rela¬\ntions. One year experience radio news writing, two\nyears PR and publicity/promotion writing with national\ntrade association. Desires public relations or script/news\nwriting position. $7800 per year. Prefers Washington,\nD. C., or Philadelphia area.\nAugust 7 Single man, 33, at present employed by one of the\nmajor North-American production centers. Six years of\nprofessional experience in all possible phases of effec¬\ntive ETV production, and in planning and supervision of\nfilm production (16mm), editing, etc. Excellent refer¬\nences. Would like to work with an ETV station with\nthe emphasis on complex and creative programing. Pro¬\nducer-director starting salary at $7200.\nSingle broadcaster, 26, with 5 years of radio experience,\nassociated with R'/TV Omdurman, Sudan, with a good\nbackground in radio and TV courses from US/AID train¬\ning program. Anxious to spend three to five years in\nU. S., to study and qualify in telecommunications. De¬\nsires position on production and programing with an\nR/TV educational institution or organization, program¬\ning grants, job or scholarship. Has been an announcer\nfor 5 years at S.B.S. News reader in both radio and TV,\nSudan; supervisor of several radio programs.\nPOSITIONS AVAILABLE\n(In order to be considered through these channels, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nAUS-I Immediate ETV openings at major eastern university:\nAUG-2 I. TV transmitter supervisor. 2. TV studio technical\nAUG-3 supervisor. 3. Broadcast electronic technician. Posi¬\ntions require recent experience in commercial or ETV\nproduction. Maintenance and operation of transmitter,\nvideotape recorders, IO cameras, mobile recording unit\npart of responsibilities. Many benefits including one\nmonth paid vacation, paid holidays, educational priv¬\nileges for you and your family. An Equal Opportunity\nEmployer.\nAUG-4 Upper Midwest university seeks experienced educa¬\ntional broadcaster to plan a new ETV station, work with\ncommunity ETV station, and supervise student radio\nstation. Temporary l/4-time teaching of TV production\nand utilization courses. Excellent long-range opportuni¬\nties; 12-month position; salary open. Master's required,\nPh.D. preferred.\nAUG-5 Midwestern station seeks experienced ETV producer-\ndirector. IO/2-month contract; $4500-5500. August open¬\ning*\nAUG-6 Southeastern university seeks combination TV and\nfilm producer. $7500 for 10 months. Rank of assistant\nprofessor. Ph.D. preferred. Will teach TV production\nand film humanities also. September I.\n4\nNEWSLETTER"
}