{
  "id": "d1476-4",
  "text": "ATTENTION GAIN GRINDERS!\nElectronic fuel injection for automobiles will\nmean the end of mechanical linkages for accelerator\ncontrol (no carburetor). Instead, a potentiometer\nwill accomplish the function of present day accelera¬\ntors. Wonder if they’ll ever rate automobiles in dbh\n(db above one horsepower).\n* * * *\nIRE Transactions for February, 1957 contains a\npaper by Duane Weise, chief engineer of WTTW,\npresented at the Sixth Annual Fall Symposium of the\nIRE Professional Group on Broadcast Transmission\nSystems. It describes the WTTW studio facilities in\nsome detail and contains other practical papers of in¬\nterest to TV engineers.\nKeith Ketcham, chief engineer of WOI-TV, has\nprepared a resume of a paper by E. D. Goodale of\nNBC on “Phase., Amplitude and Aperture Correction\nin TV systems.” We have reproduced this resume and\nsent it to chief engineers of ETV stations and pro¬\nduction centers. Additional copies are available upon\nrequest to NAEB.\n* * * *\nNOW WE'RE IN PRINT\n—by Mrs. Judith Stevens, Editor\nThe radical face-lifting given the cosy old NAEB\nNewsletter stems from the many more copies now\nbeing distributed. Since the AERT-NAEB merger is\nofficially consummated this month, the Newsletter\ngoes to 1500 persons and/or institutions. Printing is\nless expensive than mimeographing when working\nwith this quanity, and here we are.\nMany differences are at once apparent. By set¬\nting our news in type, we use about one-fourth as\nmuch space as we did before, so the new Newsletter is\nquite thin. It’ll be much easier to keep copies, as\nloose leaf notebooks can accommodate far more issues\nnow.\nNow that we’re in print, photographs can be\neasily incorporated in our news. So when you send\nus news releases, send pictures, too. Make sure the\nphotos are clear, not fuzzy, and preferably of persons\ndoing something, not just staring at the camera.\nWe feel the Newsletters “new look” is becoming.\nHope you agree.\nA nice-looking reprint of the KETC St. Louis\narticle in Broadcast News (January Newsletter,\npage 8) is available from RCA, Commercial Elec¬\ntronic Products, Camden 2, New Jersey. The title of\nthis slick publication is “TV and the Crisis in Edu¬\ncation,” and it contains some excellent photos of\nKETC facilities and personnel. ,\n* * * *\nA gift of broadcast equipment valued at more\nthan $43,000 was made by Storer-owned WJBK-TV,\nDetroit, to the local educational WTVS. Equipment\nincludes film chains, control panel, power supplies,\nmonitors, amplifiers and relays.\n* * * *\nWe hope more of you will follow Howard\nAndreasen’s example and drop us a note telling of\nyour plans. The Independent School District of Des\nMoines was granted a CP for Channel 11 on Dec¬\nember 12, 1956. They plan to operate at their present\nKDPS studio until their new TV studio is finished in\nlate summer of 1958.\nPresent plans call for regular programming to\nbegin in late September, 1957, with 10 kw ERP.\nPower will be increased to 50 kw when the new trans¬\nmitter site is completed.\nBOX SCORE\nYou probably notice the figures this month\nhave changed considerably, some up and some\ndown. For months we have been plagued with the\nfact that everyone prints or quotes different figures\non the number of TV, AM and FM stations. No\none knew who was right, so we wrote FCC. The\nfigures this month are the ones the FCC sent us.\nFrom now in we’re using these, which, incidentally,\nare the same as the ones the NARTB uses.\nTotal TV stations — 511 (includes 22 non-commercial)\nTotal AM stations — 2987 (includes 37 non-commercial)\nTotal FM stations — 654 (includes 126 non-commercial)\nSince we needed copy to fill out this page, we\nlifted two items above from the January Newsletter.\nWe haven’t changed editors, Judy does the general\nNewsletter and I paste up her work every three\nmonths. We too, feel that printing is a big improve¬\nment. The engineering mailing list now has over 400\nnames so we save too on postage. Now that we can\nuse pictures and photographic reproductions of\nschematics or line drawings, we echo her words “send\nthem along.” CSB\nPage 5"
}