{
  "id": "d1647-1",
  "text": "Dr, Arthur G-. Crane\nPage 2\non that radio continuously.\nWe believe there has been a growing dissatisfaction with some forms of present\nbroadcasts. We believe there has been a growing demand for the privilege on the\npart of listeners to turn on their dials to things of substantial interest and\nworth. We feel that possibly the present programs have under-estimated the level\nof America’s interests, I was disappointed the other day in hearing a man prominent\nin the radio world and speaking, I suppose, with some authority, state that in his\nopinion in the future radio broadcasting in America would become solely enter¬\ntainment, and then he added that the entertainment would be at the street level.\nI think that demeans the American public. We want entertainment, but there are\nalso times when we are interested more deeply and more keenly in things of more\nsubstantial worth.\nThe National•Committee on Education by Radio has persistently during its\nfour years of study sought a solution for America's problems which would cause\nthe least disturbance to our present system. The Committee has continuously sought\nfor some solution that would give us in America the benefits of the public systems\nand private systems, so, anything I say should not be construed as ill-tempered\ncriticism of the existing system.\nThere are some inevitable limitations to the present system; they are ob¬\nvious. It is controled privately; it exists for the purpose of making money for\nits owners (It must if it persists and continues). Its revenue is chiefly de¬\npendent upon advertising; therefore, the advertiser inevitably has the final word\non many things.\nBeing dependent upon income from advertising, it necessarily must seek the\nlargest audiences of possible customers wherever they may be, whatever their\ngrade of intelligence and taste may be. This results in over-broadcasting in the\nthickly settled areas and the scarcity of privileges in the less thickly settled\n(MORE)"
}