{
  "id": "d1647-2",
  "text": "Dr. Arthur G. Crane\nPage 5\nareas of our country.\nWe propose a combination plan in which there shall parallel the present\nprivate commercial system a government system. Notice I said \"paralleling;”\nin other words, supplementing but not supplanting, not displacing, the present\nsystem; not creating any undue interference with the present system; not jeopardi¬\nzing the investments that have been made in the present system; but a government\nchain that will give programs for public interest, that will be independent of\nthe necessities and limitations of producing income from advertising; a govern¬\nment system that shall select its programs solely from the standpoint of public\nnecessity and public welfare.\nThis combination plan, we believe, will give America the advantages of the\npresent private system and the advantages of the public system; where one system\ninevitably is limited and cramped, the other system may be strong; one will sup¬\nplement the other and the combination will be the best the world possesses in\nbroadcasting.\nUnder the plan we propose, all public service stations, that is, stations that\nare nonprofit in character, that are endeavoring to put out programs for public\nwelfare exclusively, will be assured the privileges of hookup with the government\nsystem. That overcomes one of the great handicaps under which local individual\nstations have been working in the past.\nWe believe that that privilege, together with some otheis that will accrue\nin the system, will stimulate the establishment and promote the maintenance of\nlocal public service stations. If that be true, then the combination which we\nare proposing is three-fold; it is the present system with all its advantages\nand inevitable disadvantages; a government system paralleling that with its ad¬\nvantages, and perchance its disadvantages; and also a system of local stations\nlargely independent. With that three-fold system we hold that we can depend upon\n(MORE)"
}