{
  "id": "d1647-8",
  "text": "♦\ni\nDr. A. G. Crane ffa£e, .9.\n\"The system shall be available for public business, for public forums,\nfor adult education, for broadcasts to schools, for public service by nonprofit\nwelfare agencies, and for other general welfare broadcasts.\n\"Nonprofit welfare stations shall be assured the right of affiliation\nwith the federal system.\n\"The system shall ultimately be extended to provide satisfactory coverage\nof the continental United States, including remote rural sections as well as\nmore densely populated urban areas.\n\"The provision of funds and the allocation of suitable broadcasting\nchannels necessary for the effective operation of the system shall be made\nby the federal government.\n\"Recordings of programs of general significance shall be made and shall\nbe available for broadcasting from nonprofit stations.\n\"A continuous program of research shall be maintained by the public\nboards to study the desires of the people, the preparation of programs, the\ntechnique of broadcasting, and the results of the broadcasts.\"\nThe National Committee on Education by Radio does not have unlimited resources,\nbut we have some very good resources of a technical nature on the engineering\nstaffs of our colleges and universities. We have investigated just far enough\nto believe that the proposed plan is eminently practicable, and that there are\nseveral ways in which it could be introduced and thus give an accurate demonstra¬\ntion of the validity of the plan. Our investigation leads us to believe that there\nwill be practically no serious interference with the rights of present broad¬\ncasters.\nOur study of European conditions and plans leads us to believe that this\ncombination which we suggest will give America the best system in the world, a\nsystem where the defects of one particular portion are counterbalanced and offset\nby the advantages in another part, and we ask you in behalf of the American lis¬\nteners to give this proposal most serious consideration.\nWe believe that radio is a resource more potent for the welfare of America\nthan anything that has appeared since the establishment of printing. This re¬\nsource is greater in its implications, in its reach, in its possible effect upon\nthe information, the attitudes, and the judgments of the people, than even the\npress. We believe that the same principles which were adopted by America in assur¬\ning the freedom of the press should be adopted in this new means of communication.\n00000O00000"
}