{
  "id": "d1556-3",
  "text": "the best program—as decided by a panel of\njudges. There was also a special viewers’\naward for the program voted most populai\nby the audience. The station received a ci¬\ntation from the Buffalo Council on World\nAffairs for the festival, which was cited\nas a fine example of the concept of promo¬\ntion of world understanding.\n^ KQED broadcast “The Gentle Savages”\nin connection with the 100th anniversary of\nthe birth of Grace Hudson, early painter\nof Indian pictures. The program dealt with\nthe Pomo Indians and included Mrs. Hud¬\nson’s paintings and anthropological films of\nPomo Indian 'life today.\n^ KTCA-TV, St. Paul, produced an orig¬\ninal sacred ballet, based on the passion and\ncrucifixion of Christ, for telecast on June\n17, the Feast of Corpus Christi. The ballet\nversion of “Los Seises” (Dance of the Six¬\nes) was choreographed by Mrs. Anna Ad¬\nrianova Andahazy in collaboration with\nJohn Schwarzwalder, who was given a pri¬\nvate showing of the dance in Seville, Spain,\nlast spring. Richard J. Carter directed the\nproduction in the Cathedral of St. Paul.\nLos Seises is derived from an ancient Span¬\nish dance traditionally performed by altar\nboys in the Cathedral of Seville.\n^ Magazine is a new bi-weekly one-hour\nseries in which KQED will integrate whim¬\nsy with stark realism, amusing trivia with\nexpositions of important issues of the day.\nThe series began July 7, and an early pro¬\ngram featured pre-Columbian art, a motor¬\ncycle race, puppets, and St. Francis of As¬\nsisi.\nGENERAL\n^ WPSX-TV, Pennsylvania State Univer¬\nsity, has begun evening telecasts. This is\nthe second in a three-step plan for ETV\nfor central Pennsylvania. The first step, in¬\nstructional programs for schools, has been\nin progress for one semester. Development\nof a community service through locally pro¬\nduced programs will be the third step.\n^ This fall will see completion of inter¬\nconnection of Mobile’s-ETV station with the\nAlabama network. Since the station began\nbroadcasting last November, it has telecast\nthe network programs on a one-week delay\nbasis.\n^ An Alabama survey reports that 160\npublic schools which did not provide stu¬\ndents with access to ETV last year will\ndo so this fall. The most popular course\nwas “Let’s Learn More,” viewed by 31,479\npupils.\n^ Omaha University has concluded its\nsixth TV workshop for teachers and ad¬\nministrators. The classes were started a\nyear ago when plans were being drawn for\nan ETV station for the Omaha area; the\nstation is scheduled to go on the air Octo¬\nber 1.\ny WTTW, Chicago, has begun its move\nto new studios at 5400 N. St. Louis Avenue.\nThe station will go off the air for final\ninstallation and equipment testing August\n14 to September 6.\nSTATE AND REGIONAL\n^ The state superintendent of public in¬\nstruction has named Lewis A. Rhodes chair¬\nman of Michigan’s State Advisory Com¬\nmittee on ETV. Other NAEBers on the\ncommittee include: Stephen All, William\nBallard, John McArthur, Anthony Reda,\nPaul B. Rickard, Charles S. Ruffing, and\nVerne Weber.\n^ New York’s legislature has approved a\n$625,000 budget item to enable the State\nUniversity of New York to establish a mic¬\nrowave network linking units of the uni¬\nversity. Part of the new network is ex¬\npected to be in operation by September. The\nfunds were cut by the 'legislators in April,\nbut public opinion caused them to be re¬\nstored in a supplemental budget.\n^ The ETV Council of Central New York\nhopes to have a UHF station in limited op¬\neration by October and in full operation\nby February. The station will serve a nine-\ncounty area 30 to 40 miles around Syra¬\ncuse.\n^ Community leaders of eight Kentucky\ncounties met recently at Murray State Col¬\nlege to discuss ETV. Maurice D. Bement,\nexecutive director of the Kentucky School\nBoards Association, said ETV is the fast¬\nest growing medium of education. In point-\ning out Kentucky’s slowness in developing a\nstate network, he asked, “Can everyone\nelse be wrong and Kentucky be right?”\n^ Nebraska’s state ETV network hopes to\nhave its third link—Channel 26 at Omaha—\non the air by October 1. Total cost is bud¬\ngeted at $223,449. The CP has been received,\nand design work is in progress on the 407-\nfoot tower. RCA will supply the transmit¬\nter, tower, and antenna. The state’s pro¬\nposed ETV network will have seven chan¬\nnels.\nINSTRUCTION\n^ KFME, Fargo, N. D., has contracted\nwith Concordia College, Moorhead, Minn.,\nto produce and broadcast the major por¬\ntion of the college’s freshman and sopho¬\nmore English courses in the coming year.\nTo assist in the production, the Louis W.\nand Maude Hill Family Foundation of St.\nPaul has awarded the college a grant of\nnearly $50,000.\nPLACEMENT\nPOSITIONS AVAILABLE\n(For information, write the Placement Service, at the NAEB office in Wash¬\nington. In order to be considered through these channels, the reader must be\nan Individual Member of the NAEB, with credentials on file with the NAEB\nPlacement Service. Non-members can save time by sending the $10 annual\ndues and $10 Placement registration fee at the time of inquiry.)\nAug I Major midwest university has immediate opening for competent television engineer.\nMinimum of five years experience with all phases of television operation and main¬\ntenance required. Excellent opportunity.\nAug 2 Programing operations manager for developing radio, television and motion picture\ndepartment for major eastern Land Grant university. Responsibilities will include on-\nthe-air, recording, and closed-circuit production supervision, and associated program¬\ning. Scope of job includes future production for planned state-wide network. M.A. re¬\nquired in communications or closely-related field. Experience with major college or\nuniversity valuable. Salary open.\nAug 3 A state educational television network seeks television curriculum personnel, television\nteachers, engineers and technicians, and operations and production personnel for its\nnew production center to serve public schools with a three-channel closed-circuit tele¬\nvision system.\nAug 4 Midwestern university has September opening for operations-production manager.\nM.A. degree with significant production experience in educational television required.\nWill supervise professional and student producer-directors and such operations as film\nand tape utilization, traffic, staging, lighting, and graphics. Appointment is for 12\nmonths with one month vacation.\nAug 5 Midwestern university has September opening for producer-director. Requires M.A.\ndegree with ETV production experience as well as experience in teaching television\nand/or radio production courses. Will direct programs and telecourses on closed-cir¬\ncuit; will work with student producer-directors in developing programs for broadcast;\nand will teach one three-hour course in radio or television production. Appointment is\nfor 12 months with one month vacation.\nAug 6 Midwestern university has September opening for staff engineer. Must have first-\nclass license and experience in radio and television broadcasting operation and main¬\ntenance.\n(The last three positions are in a university 'which is an Equal Opportunity Employer\nand as such will give consideration for employment without regard to race, color,\ncreed, religion, or national origin.)\nPlacement has had many requests for positions ton engineers. If you are interested in\nemployment in this field, register with the Placement Director.\n4\nNEWSLETTER"
}