{
  "id": "d796-53",
  "text": "July 24, 1962\nMr. Loren B. Stone\nManager, KCTS-TV\nUniversity of Washington\nSeattle 5, Washington\nDear Loren:\nThank you very much for sending along a carbon copy of your letter to Hy\nGoldin. I am especially pleased because it so cogently affirms some things that\nboth Vernon and I have been telling Hy and John By strom, who will head up the\nadministration of the ETV legislation. Hy was rather startled and upset that we\ndid not embrace the idea of a national inter-connected ETV network as the major\ngoal of educational broadcasting. Bystrom, on the other hand , readily agreed that\nthe major emphasis—particularly if we are to have a viable ETV development-\nmust be on the state and local level.\nI am also pleased to find myself in complete agreement with you again. I have\nbeen a bit uncomfortable that we have not seen eye to eye, as has usually been our\nwont, on the involvement of NAEB in ETV production. Actually, I have not been so\nfar apart from you as might appear. Your first memo was worded in such a way as to\nsuggest that this was a personal enthusiasm of mine. Not so. My interest, from\nthe first, has been merely to free NAEB from an absolute restriction. I never contem¬\nplated the Association going into any large-scale production or distribution activity\nand certainly not in the sense of competing with the Center. However, i would like\nto be in a position to at least consider an occasional production opportunity if and\nwhen it arises. The authorization by the Board to conduct two experimeri s in package\nproduction provides that opportunity. This is merely authorization and it may well be\nthat we may never do any. Nevertheless, since the Board gave me the responsibility\nfor carrying out this activity, I felt I had the responsibility to explain this action;\nconsequently, 1 was necessarily placed in the position of a special advocate.\nI know you feel very strongly about this matter, but I am frank to say was rather\nirked by your unilateral action as a director of a particular region in distributing the\nmemo to the entire NAEB membership. In a way, this unilateral procedure, it seems\nto me, is as lacking in democratic behavior as Brother Schwarzwalder’s precipitate\nexist from the Board meeting when a vote went against him. I agree that insufficient\nconsideration of this matter was undertaken in advance of the Board meeting, but"
}