{
  "id": "d796-55",
  "text": "Dr, Hyman Goldin\nFederal Communications Commission\nWashington 25, D, C,\nJuly 13, 1962\nfP\nb\nDear Hy:\n1 was pleased to receive the copies of the new FCC forms for educational\nbroadcasting which Keith Engar sent, and am highly pleased with the job\nyou and he have done in drafting forms which sommuch better fit the\noperation of non-commercial educational broadcasters.\nI would prefer to see the Commission identify NETRC and NAEB programs as\ncoming from a \"national or regional program source\" than from a \"network\",\nfor neither of these organizations, nor the program service they offer\ntheir \"affiliated\" stations are networks in the sense the Commission has\nused in its study of or dealings with networks.\nj\nIn Sec. 3.658 of the Rules, reference is made to Ch, VII,J, of the Report\non Chain Broadcasting. I don*t have a copy of that report currently at\n0hand, but the balance of Sec, 3.658 discusses network control over stations\nas falling into such matters as: Exclusivity of Affiliation; Exclusivity\nof Territory; Term of Affiliation; Option Time; Right to Reject Programs;\nNetwork Ownership of Stations; and Control of Station Rates. None of these\nmatters are in any way related to the program service offered by NETRC or\nJ NAEB to the stations.\nI know that NETRC is attempting to create for itself an image of the \"4th\nNetwork\", but I am in complete disagreement with them on this, for they\nare not, nor do I think they wil ever be a network in the accepted trade\nsense. I think there is great danger to the proper development of a\nnon-commercial educational service to encourage, in any way, the network\nconcept, with its implied control over programs. The network concept is\nbeing promoted by NETRC in their desire to find commercial underwriting\nfor their programs -- and I think this is most inimical to the development\nof a non-commercial service.\nThe program services available to the stations from NETRC or NAEB are, in\nmy opinion, no different than the program packages available to commercial\nstations from non-network sources. I do not mean, in any way, to imply a\ndissatisfaction with the NETRC programs, but their service is not \"network\".\nI do not want NETRC or the stations which use their service to be marked with\nthe stigma whitah is growing up around \"network programming\"\nMrs. Stone joins me in our best regards to you. We thoroughly enjoyed your\nvisit and the opportunity to become better acquainted.\nSincerely,\nLoren B. Stone"
}