{
  "id": "d1141-1",
  "text": "-2-\nyear. With this in mind, I suj!;/j;ested to the member stations at Colvonbus, Ohio, that\nwe will be very glad to be of service to pny station who wants to start a Radio Book\nClub. We pioneered this idea and have made some mistakes that other people need not\nmake if they will profit by our example. However, we do feel very well satisfied with\nour effort. V<e now have nearly 700 members and within the last year have circulated\nabout 5,000 volumes. The club is self-supporting and is proving to be a real service\nto our rembers. About 509^ of our early members have renewed their membership. As the\nwinter season comes on when farmers are not quite so busy we expect this percentage to\nincrease.” (N0TE--I feel quite certain that a nmber of our member stations mil be\ninterested in this valuable suggestion by Mr. Griffith and will be pleased to have de¬\ntails relative to the Radio Book Club. TilNAD is interested in this project and we wish\nto secure the Book Club catalogue and a little of the history of the movement, rules,\netc., under which TfOI operates this additional service. Vfill all other directors who\nare interested in the project kindly write to Mr. Griffith for the same materials.)\nFROF PROFESSOR J. C. JENSEN, DIRECTOR MD ENGINEER, RADIO STATION WCAJ, NEBRASKA\nTOSLEYAN UNIVERSITY, LINCOLN, comes the following: ”We have two double-faced records\nof our Glee Club and quartette which we will be glad to loan to other college stations\nin return for similar m^aterial. We are contemplating the installation of equipment\nwhich will make it possible for us to record addresses by faculty members, etc., which\ncould also be made available on an exchange basis.” (N0TE--Again we ask Mr. Jensen\nfor details relative to cost of installation of equipment, best types, etc., so that\nthese findings may be passed on to the entire membership.)\nMR.JENSEN OONTINUESj ”We are installing equipment capable of giving 1000 watts power,\n1009^ modulation. 0\\jr license does not permit us to use all this power immediately,\nbut we think that permission will be granted soon. The other stations on our frequency\nare all applying for 5000 watts power. This will be particularly bad for us if the\napplications are granted because KHQ has been interfering with us seriously in north¬\nwestern Nebraska with 1000 watts. Do you believe that we could get the backing of the\nAssociation of College and University Broadcasting Stations in opposing the granting\nof any more power to W0T<, KHC^, and WEEI.” (N0TE--As executive secretary of our organi¬\nzation I am unable to answer this question and will ask that each director correspond\ndirectly with Mr. Jensen relative to this matter. As Director of YffiT/iD at the University\nof Oklahoma I most assuredly will help him in any way possible in opposing the granting\nof any more power to WOW, KH^, and Y®EI.)\nFROM DIRECTOR D. E. NOBIE, Y^CAC, CONNECTICUT AGRICULTURAL COLLEGE, STORRS, comes the\nfollowing: \"Your letter regarding the phonograph record exchange is very interesting.\nThis year we expect to find it necessary to fill in time by use of phonograph records.\nWe have just ordered forty new electrically cut Victor phonograph records and we expect\nto order more later,” (NOTE—I am exceedingly interested in having a list of the records\nordered by Mr, Noble and any detailed information he may have to give so that I may\npass it on to our members.)\nMR. NOBLE FURTHER STATES: ”We should certainly be pleased to cooperate in any exchange\nsystem which might be evolved. At present we are having some trouble in arranging our\nschedule with our time sharing station. Later when our winter program is started we\nshall be glad to write you about our activities,” (N0TE--As Director of YflJAD I am\nhappy to report that a most pleasant situation has always existed between our station\nand KGGF of Coffeyville, KWsas, our sister station with whom we share time. I will\nbe pleased to write a personal letter to any of our members if we may offer any sug¬\ngestion that will be of value to them as to how we work out our time sharing plan. I\nam sure we have more members of the Association who are in a position to offer valuable\nadvice along this line.)\nFROM DIRECTOR A. A. APPLEGATE, STATION KFDY, SOUTH DAKOTA STATE COLLEGE, BROOKINGS:\n\"Station KFDY owns no musical records, but has depended entirely upon local stores in\nthe city.” (N0TE--We would be pleased to have details as to the type of record pro¬\ngrams KFDY has sponsored in order that our membership may be advised.)"
}