{
  "id": "d1141-1",
  "text": "NAEB NEWS LETTER\nPage\n2\nNovember I, 1942\nPOLITICAL EDUCATION VIA VVHA\nWisconsin believes that oiscussions of politics ate of interest and\nIMPORTANCE TO ITS PEOPLE, FOR THAT REASON FREE TIME ON STATE\nStation WHA is granted to recognizeo parties and candidates for the\nPRESENTATION OF CAMPAIGN ISSUES,\nIn the Pre-Primary campaign 31 quarter hour periods of time vere\nASSIGNED TO THE PRE-PRIMARY POLITICAL EDUCATION FORUM, EaCH QUAL¬\nIFIED CANDIDATE RECEIVEO A PERIOO, SELECTED BY THE DRAWING OF LOTS,\nThe regular election Forum finds 35 quarter-hours extending over\nTHREE WEEKS DEVOTED TO POLITICAL BROADCASTlMG• HERE THE SPEAKERS\nARE ASSIGNED QY THE PARTY ORGANIZATIONS, The STATION DOES NOT\nEXERCISE CENSORSHIP OVER SPEAKERS (NOTE THE COMMUNICATIONS AqT) AND\nEACH ASSUMES FULL RESPONSIBILITY FOR HIS STATEMENTS,\nThe success of these Forums is dependent upon careful advance\nPLANNING TO ANTICIPATE DIFFICULTIES WHICH MAY ARISE—AND MEETING\nTHEM BEFORE THEY DO ARISE* IT MEANS KEEPING SEVERAL STEPS AHEAD\nOF THE POLITICIANS,\nHOW1S YOUR COfvi HTTEE?\nOne COMMITTEE, AT LEAST, WHICH TAKES ITS ASSIGNMENT CONSCIENTIOUSLY\nis the University of Wisconsin Radio Broadcasting Committee, which\nCOUNSELS IN THE MANAGEMENT OF WHA. THAT 8-MAN COMMITTEE HAS A\nLUNCHEON MEETING EACH TUESDAY NOON TO TRANSACT ITS 8USINESS* T\nBRINGS TO THE STATION STAFF THE BENEFIT OF VARIOUS POINTS OF VIEW—\nAND GIVES THE STATION A CLOSER LINK WITH THE FACULTY. NEVER BEFORE\nHAS V/'HA ENJOYED SUCH LOYAL FACULTY SUPPORT AS AT PRESENT—AND THE\nCommittee has helped to bring that about,\nWOSU COURSES ARE ANNOUNCED\nOhio State University provides the opportunity for Ohio citizens\nTO \"ATTEND\" COLLEGE THIS FALL OVER ITS OWN STATtON, WOSU•\nThe SCHEDULE OF FREE COURSES OFFERED IN THE RADIO JUNIOR COLLEGE,\nAS DESCRIBED IN A NEW BULLETIN NOW BEING DISTRIBUTED BY .OSU,\nINCLUDES! \"SIGNIFICANCE OF THE W'ARW, A LECTURE SERIES TUESDAYS AT\n4 p»mo; Spanish lessons, daily at \\ p.m,; French lessons, daily\nat 10:30 a.m,; \"The Classic Period in Music , oaily at 10 a.m,;\n\"An Introduction to Literature\", Tuedays at 2 p.m.\nTeachers in the schools also have received schedules for the\nautumn semester in the \"Ohio School of the Air/ to be broadcast"
}