{
  "id": "d1236-1",
  "text": "PLACEMENT SUPPLEMENT\nOctober I — Desires to manage ETV station. MFA Speech and\nDramatic Art. Taught five years in university, followed\nby six years in all phases of commercial TV. Male, 38,\nmarried. Will locate anywhere for a good opportunity.\n$8000 minimum. Employed as program manager of TV\nstation.\nOctober 2 — Ph.D. candidate, married, age 30, winner. of\nFAE Mass Media Leadership Training Award, desires\nposition with a future. Experience in production, pro¬\ngraming, and administration in radio and TV. Four\nyears director of broadcasting for northeastern uni¬\nversity. Open location and salary.\nOctober 3 — Single young man, MS, seeking employment as\nprogram or music director. Experienced in both classical\nand jazz, and has fine personal record library. Stereo\nbroadcasting expert. Skilled announcer, recording engi¬\nneer, editor, writer. Willing to go anywhere. $5200.\nOctober 4 — Qualified, versatile, creative veteran, 25, single,\nwith B. S. in speech and five years of experience in\nradio, wants responsible position in educational broad¬\ncasting. Can do anything but engineering. Will go\nwhere opportunity is. $5200.\nOctober 5 — Single man, 27, M. S. in communications, looking\nfor ETV producer-director position. Year and a half of\nexperience, also some technical operations and engi¬\nneering. Will teach, go anywhere, $5000. Loyal, hard\nworking and responsible.\nOctober 6 — Married man, 33, with Ph.D. in music and\nteaching experience, as well as experience with A-V\nequipment. Holds first-class commercial radio telephone\nlicense. Searching for engineering or management posi¬\ntion, or music director, in educational radio or TV\nanywhere. $6000 minimum.\nOctober 7 — Eight years part-time and full-time experience\nin radio and TV staging, acting, writing, producing, and\nlighting. Looking for position on production staff of\nETV station, preferably in western United States. Single\nman, 27. $5100.\nOctober 8 — Married man, 27, with master's degree and major\nin Educational Broadcasting, seeking position as pro¬\nducer-director, announcer, program director, camera¬\nman, or news director in ETV or radio. Will locate\nanywhere. $5000 minimum.\nAttention Employers and Employees: Please let your Place¬\nment Office know when you hire one of our applicants,\nor when you wish to be placed in the inactive files.\nJOB NEEDED\nMiss Astrid Walter, a sound technician and tape editor for\nRIAS (Radio in American Sector) in Berlin wants a year of\ntraining employment in the U. S. in the technical side of\nradio. Interested persons should write or telephone John\nWiggin, at the Voice of America, 330 Independence Avenue,\nSW, Washington, D. C.\nOPPORTUNITY IN EDUCATIONAL COMMUNICATIONS\nThe New York State Department of Civil Service will conduct\non January 21, 1961, an examination for Associate in Educational\nCommunications. Salary $8220-$9870. Four vacancies in Education\nDepartment. Open to any qualified citizen of United States.\nRequires a master's degree and specialization in educational\ncommunications education and five years of experience in edu¬\ncation including two years in educational communication educa¬\ntion. Completion of the requirements for a doctoral degree in\neducational communications education may be substituted for\nsome experience.\nFor details contact the Recruitment Unit, Box 4M, New\nYork State Department of Civil Service, The State Campus,\nAlbany, N. Y.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. $5.00 a year, edited by Betty M'cKenzie.\nMeetings\nOctober 12-14: Conference of representatives from\n20 states on educational use of TV, Ohio State Uni¬\nversity. Sponsored by North Central Association of\nColleges and Secondary Schools under contract with\nU. S. Office of Education.\nOctober 16-22: 5th international congress on high¬\nspeed photography, Washington, D. C.\nOctober 27-28: Teaching with TV — an institute\nfor medical educators, University of Florida, Gaines¬\nville.\nNews of Members\nGENERAL\n► The University of Wisconsin this fall has in¬\naugurated a new long-distance CCTV course in elec¬\ntrical engineering. Three classes will meet simulta¬\nneously — one in Madison and two in Milwaukee.\n► Kenneth Harwood, head of the department of\ntelecommunications at the University of Southern\nCalifornia, and R. A. Collison, librarian of the BBC,\nare planning an international association of research\nlibraries that specialize in radio and TV. As a fol¬\nlow-up on these plans, the BBC has presented rare\nbooks on TV and radio to the University of Southern\nCalifornia library. Among them were two 5-language\ndictionaries of radio published in 1924.\n► On September 26, KQED, San Francisco, went\noff the air for an hour, advising viewers to watch\nthe Nixon-Kennedy debate on the commercial chan¬\nnels.\nPROGRAMS\n^ NAEBers may well want to watch “The Thread\nof Life” on NBC-TV on Friday, December 9. It is\nan hour-long colorcast discussing the work of scien¬\ntists in the field of genetics, and “it shows a dis¬\ntinctive technique in the presentation of scientific\ninformation on TV.”\n^ WTTW, Chicago, this fall is presenting for its\nyoung viewers a book review program illustrated\nwith shadow puppets. Also on WTTW is a program\nfeaturing foreign guests who are visiting Chicago\nunder an adult exchange program. The visitors will\ndiscuss the way of life in their countries, compared\nwith the American way, and the disadvantages and\nadvantages to be found in both cultures.\n^ The Alabama ETV network is broadcasting a 17-\nweek electrical telecourse primarily for home owners.\nThose taking the course should be able to immediately\nstart repairing their small household appliances.\ny WEDU, Tampa, is presenting a series of in¬\nstruction on horseback riding.\n^ KQED, San Francisco, recently broadcast a dis¬\ncussion between the owner-teacher of a Berkeley\nnursery school and the chief deputy director of the\nNEWSLETTER"
}