{
  "id": "d1236-2",
  "text": "California department of social welfare, which had\nordered the nursery school closed because of tech¬\nnical violations.\nPERSONNEL\n^ Gregory Heimer has become general manager of\nWJCT, Jacksonville, Florida. Jay Rayvid, formerly\nwith WTHS, Miami, is the new production director.\n^ Lewis A. Rhodes is the director of TV at Central\nMichigan University; he remains assistant director\nof the Central Michigan ETV Council.\n► Blair McKenzie is production manager at Central\nMichigan’s TV production center. He was formerly\nwith commercial WVEC-TV, Norfolk, Virginia.\n► Two new staff members have joined the Arizona\nState University bureau of broadcasting preparatory\nto activation of an ETV station this fall. Phillip\nRock, TV producer, was formerly with commercial\nKVAR, Phoenix. Jack Daniels, TV studio engineer,\nwas formerly an engineer for WOSU-TV, Ohio\nState University.\n^ Robert F. Schenkkan, radio-TV director at the\nUniversity of Texas, served as a special consultant\nfor the Ford Foundation to the Congress of the\nInternational Association of Universities this week\nin Mexico City. He discussed the use of videotape in\nteaching by TV.\n► William Bender, Jr., head of Health Sciences\nRelations at the University of Michigan Medical\nCenter, and former NAEB public relations committee\nchairman, recently won honorable mention in the\nMacEachern PR Awards sponsored by the Amer¬\nican Hospital Association.\n► Don C. Smith has been appointed associate pro¬\nfessor of telecommunications at the University of\nSouthern California. He was formerly at the Uni¬\nversity of Alabama, as associate professor of radio\nand TV.\n► John M. Kittross has been promoted to assistant\nprofessor in the department of telecommunications\nat the University of Southern California.\n► Laurence C. Blenheim, senior announcer at com¬\nmercial WMGM, New York, has joined the Temple\nUniversity radio and TV faculty as assistant pro¬\nfessor. He will direct the university’s two radio\nstations and supervise the courses in announcing.\nPRESIDENT'S COLUMN\n—H. J. Skornia\nThis is my last column as NAEB president. It\nwill not be unduly sentimental. It will also not con¬\ntain my “farewell” message. I prefer to deliver that\nin person at San Francisco.\nEvents of the last year — in commercial broad¬\ncasting, foreign affairs, educational technology, and\nNAEB affairs — have come so rapidly that looking\nback makes one a bit giddy.\nIn all these developments, 1 have increasingly\ncome to think how fortunate it is that there has\nbeen an NAEB, however inadequate those of us\nwho have been responsible for its administration may\nsometimes have felt in implementing its objectives\non your behalf.\nThe past year has been particularly replete with\nreview and decision. Possible mergers with other\ngroups were considered, and finally dismissed for\nnow. There was much remembering of Disraeli’s\nfamous words: “Centralization is the death blow of\npublic freedom.”\nPossible terms for turning over the operation of\nthe NAEB Radio Network to the NETRC were\nconsidered. At this writing, although this problem\nhas now been submitted to the full institutional vot¬\ning membership (Actives and Associates) for de¬\ncision — with discussion and voting scheduled for\nOctober 18 and 19, respectively, at our convention at\nSan Francisco — it appears unlikely that such a\ntransfer will be made at this time. Here, too, the\nfactor of diversity of offering is a powerful one\nin influencing the feelings of your officers and board.\nAfter years of calling for attention, it is sur¬\nprising and unexpected to many radio and TV “be¬\nlievers” to have spotlights turned on the tools we\nhave believed in and worked on in musty basements\nthrough lonely nights and in the face of all sorts\nof accusations about our being gadgeteers.\nHere, we read, is a new movement; you and I\nknow that it is not really so new, after all, since\nmany of us have been in it twenty years or more.\nYet we must try to behave like gentlemen to those\nnewcomers who feel that they have invented all that\nis now known, or who believe that all that is old is\nbad.\nAs of now the membership of the NAEB is\nsomething over a thousand in all categories. Soon\nit will number 2,000, 3,000, 5,000, 10,000. What\nshould these members expect to get from it? Is the\nNAEB a slot machine into which members pay their\ndues in the hope of hitting the jack pot? The answer,\nof course, is No. The NAEB is what members\nmake it, by giving to it as well as receiving from it.\nIs it only a “technical assistance” organization,\nlimiting itself to helping stations to get on the air,\nand hire and train staffs and grind out a given\nnumber of hours a day of something which will\nqualify for the educational label? I don’t think so.\nAre we to help people, with these instruments, to\ndo the educational job of today and yesterday? Not\nin my opinion. For the mere presence of these tools\n— and the effects they have on our culture, whether\nOCTOBER 1960\n3"
}