{
  "id": "d1236-4",
  "text": "-5-\nThis meeting and the proposed May conference are a part of an attempt to talk\nover this whole matter of restructuring with the important elements of the NAEB\nmembership. In March I will meet with the ETV station managers group in connection\nwith the NETRC-Affiliates meeting. I will also attend meetings of Regions II and III\nand the Western Radio Television Conference. Perhaps a separate meeting of radio\nstation representatives will be desirable so that adequate soundings may be made\nacross the entire range of membership interests and concerns.\nDates and Events of Interest\nFebruary 13 Broadcasters Club reception for Commissioner E. William Henry, Broad¬\ncasters Club, Washington.\nFebruary 16-2 0 American Association of School Administrators, Atlantic City.\nFebruary 21-23 Western Radio and Television Association, 16th Annual Conference on\nEducational Uses of Electronic Media, Ambassador Hotel, Los Angeles.\nMarch 6 International Radio & Television Society Banquet, Waldorf Astoria Hotel,\nNew York.\nMarch 15 Deadline for comments on FCC proposal .allowing daytime stations to go\non at 6 AM or sunrise, whichever is earlier.\nMarch lb Reply comments to FCC’s proposed FM allocations table.\nMarch 17-19 NAEB Region III Conference, Chicago.\nMarch 20-22 NETRC Affiliates Meeting, New York.\nMarch 29-3 0NAEB Region II Conference, Tampa.\nWashington Rumor Market\nAmong the reports making the rounds here recently: Minow will shortly step down\nas FCC Chairman, with Commissioner-elect Ken Cox stepping in to his spot and\nMinow taking a top post in the new Space Communications Corp. Governor Collins,\nnow that he has had his NAB contract renewed, is no longer regarded as a likely can¬\ndidate for a top Space Corp. job.\nA much more assured development calls for Dr. Hyman Goldin, now Chief of the\nResearch and Education Division (which includes the Educational Broadcasting\nBureau) to move into the position of Assistant Chief of the Broadcast Bureau. Larry\nFrymire will stay where he is as head of the education activity and a new man will\ntake over Goldin’s former position.\nDr. Seth Spaulding, now de facto head of the Educational Media Branch of the\nUSOE, (no replacement has yet been appointed for Walter Stone, who left last June)\nis being pressured by the Peace Corps to join them in connection with foreign ETV\ndevelopments. Peace Corps, already committed to a project in Colombia, is said to\nbe considering operating ETV projects in several Latin American countries and Ethiopia."
}