{
  "id": "d1597-0",
  "text": "A E B\nms\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL\nNAEB COMMITTEES ANNOUNCED\nPresident Burton Paulu has announced the NAEB\ncommittees for 1958. In making the announcement,\nDr. Paulu pointed out that all chairmen have been\ncontacted and have consented to serve, but problems\nof secretarial help and time made it impossible to\ninquire of each committee member whether or not\nhe or she was willing to serve. It is assumed, there¬\nfore, that committee members are willing to accept\nthese assignments unless Dr. Paulu hears from them\nto the contrary very shortly.\nPresident Paulu also called attention to the re¬\nstructuring of the television committees, stating that\nthis was done in order to make the greatest possible\nuse of NAEB television members in bringing all of\nof the NAEB skills to bear on television problems.\nWith minor exceptions the television committees were\nrestructured along the lines recommended by the\nformer TV Development Committee.\nCommittee appointments for 1958 are listed on\npage 7.\nNAEB REGIONAL DIRECTORS ELECTED\nE. A. Hungerford, Jr., director of operations, Metro¬\npolitan ETV Association, New York City; William\nHarley, program director, station WHA, University\nof Wisconsin; and Robert Schenkkan, director of\nradio-television, University of Texas, have been\nelected directors of NAEB Regions I, III, and V\nrespectively in the mail election just completed. An¬\nnouncement of the results was not possible earlier be¬\ncause the first round of voting, for all Regions, re¬\nsulted in a plurality only, whereas the by-laws re¬\nquire a majority. The resulting run-off election at\nfirst resulted in a tie in Region V, causing still further\ndelay.\nURBANA, ILLINOIS\nNAEB Newsletter\nVol. XXIII, No. I\nJanuary, 1958\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14 Gregory\nHall, Urbana, III. $5 a year, edited by Hans J. Massaquoi.\nGREETINGS FROM THE PRESIDENT\n—Burton Paulu\nI have attended a great many meetings of the NAEB\nBoard of Directors since first becoming an officer of\nthe Association in 1949. By all odds, however, the\nbest of these were the meetings at the St. Louis con¬\nvention on October 28, 29, and 30, and in Chicago\non December 6, 7, and 8.\nThese sessions were devoted to the basic problems\nof educational radio and television broadcasting.\nThis fact is important in itself, since it is always easy\nto lose the “grand design” among the minutiae. But\nwhat impressed me even more was the way in which\nthe Board concentrated on the overall problems of\neducational broadcasting, and never on those of the\nNAEB alone.\nAt the St. Louis meeting we became very much\naware of the recent emergence of new problems in\neducational broadcasting. We also realized that it\nwould be impossible to discuss these adequately\nduring our short time together: too many routine\nmatters were pressing for action; furthermore, the\nConvention itself was at hand. Accordingly, we de¬\ncided to hold a special meeting in Chicago on Decem¬\nber 6, 7, and 8.\nThere the Board of Directors was joined by other\nNAEB members chosen to make the session widely"
}