{
  "id": "d1597-11",
  "text": "One of the country’s leading experts on space\nmedicine, Dr. Hubertus Strughold, adviser for re¬\nsearch, School of Aviation Medicine at Randolph Air\nForce Base in Texas, appears on all 13 programs.\nFormerly director of the Physiological Institute of the\nUniversity of Heidelberg, Germany, he has been con¬\ncerned with space medicine since the 1920’s.\nGuests on various programs are a number of other\nscientists and two pilots who have tested high-flying\nmachines. Host is Dr. John Rider, physics professor\nat the University of Houston.\nThe series was produced by KUHT-TV’s John\nMeaney. Living geography and history are presented\nto Lansing area students through a weekly TV pro¬\ngram, “You Are Here,” which originates live from\nWKAR-TV, the Michigan State University station.\nTV TECHICAL TIPS\n—Cecil S. Bidlack\nA Ford Foundation grari^f will permit NAEB to hold\na Video Recording Workshop for technical personnel\nMay 5 to 9, 1958 at the WTTW studios in Chicago.\nA sub-committee of the NAEB Engineering Com¬\nmittee met in Chicago on Dec. 16 to make tentative\nplans for the workshop and to discuss details of the\nprogram. The committee was aided in its discussion\nby the response to an inquiry mailed Nov. 11, 1957.\nThis inquiry went to all NAEB ETV stations on the\nair, all stations under construction and to television\nproduction centers, asking for nominations of partici¬\npants and for program suggestions.\nThe program of the Video Recording Workshop\nwill cover primarily kinescope recording since the\nproblems being encountered in this method of re¬\ncording are immediate and timely. However, intro¬\nductory technical details of video tape recording will\nbe presented, since it is expected that within the next\ntwo years ETV stations may be in the process of\nconversion to videotape.\nAlthough the date and place of the workshop have\nbeen set, many details of the arrangements are yet\nto be completed. Within the next month persons who\nhave been selected will be notified and their names\nwill be published in a future Newsletter.\nX A ^ tv ^\n“Kinescope Recording Made Easy” is the title of\na four page paper by Richard Helder of the WTTW\nstaff which we mailed in November to chief engineers\nof ETV stations and production centers. Actually\nthis isn’t a treatise on kinescope recording but is the\ndetailed procedure for the operation of the WTTW\nkinescope recorder. We realized when we duplicated\nit that many of the items apply only to the WTTW\noperation, however we believed that it might be of\nvalue to others in setting up a routine for their own\nkinescope operation. We have additional copies for\nthose who didn’t receive it and will mail it upon re¬\nquest.\n*****\nIn a late mailing we also announced the avail¬\nability of used image orthicon tubes type 5820 and\n6474 from the National Broadcasting Company.\nThese tubes have been mostly retired for lack of\nsensitivity or sticking. NBC is offering them to edu¬\ncational TV stations and production centers at $25.00\neach. They will be shipped express collect with no\nguarantee of life.\nIf you wish to purchase some of these tubes write\nto:\nThomas H. Phelan, Manager\nTV Maintenance and Plant Facilities\nNational Broadcasting Company, Inc.\nRCA Bldg., Radio City\nNew York 20, New York\nYou may specify either 5820 or 6474. The latter\ntype is used in color television and designed for\noperation below the knee of the characteristic as\ncontrasted to the 5820 operation above the knee. Mr.\nPhelan states that individual records have been kept\non these camera tubes and that NBC will make\nevery effort to see that only serviceable tubes are\nshipped.\n*****\nThe first Ampex production model Videotape Re¬\ncorders were delivered in late November to KING-\nTV, Seattle and KGW-TV, Portland and were im¬\nmediately placed in service. Ampex has announced\nthat it will deliver more than 100 units of the pro¬\nduction model videotape recorder by April in time\nfor Daylight Savings Time operation. It has also\nannounced that a new unit to convert its mono¬\nchrome recorder to color operation will be available\nand delivery of prototype models of this device is\nexpected to begin in June.\nOn October 21, RCA demonstrated a prototype\nmodel of its color video tape recorder. NBC expects\ndelivery of six of the new color recorders in April\nand will install color “tape centrals” in both its New\nYork and Burbank studios. Prototype models of the\nRCA color recorders will sell for $96,000 with de¬\nlivery expected to begin in September of 1958. RCA\nalso has announced that it expects to have produc¬\ntion models of both color and monochrome video\ntape recorders available for delivery in December\n1958. Prices have been set at $63,000 for the color\nrecorder and $49,500 for the monochrome version.\n12\nNEWSLETTER"
}