{
  "id": "d1597-3",
  "text": "Scanlon and G. D. Wiebe.\nConsiderable time was spent in closely studying\nthe matter of effects, and the seminar felt that “there\nis a very real danger of considering only those effects\nwhich correspond to the intentions of the broadcast¬\ner.” It was also aware that there exists a broad\nrange of “unintended or incidental effects which will\nmerit investigation.” Specifically, the participants\nconsidered the effects of educational broadcasting\nunder the following categories: action, psycho-motor\nskills, involvement, cognitive behavior, affective be¬\nhavior and ancillary effects.\nMany pertinent suggestions came out of the\nweek-long discussions. These are now being edited\nby Dr. I. Keith Tyler, who was chosen by the NAEB\nResearch Committee as best qualified' to handle this\nphase of the, work. Some of these recommendations\nmay be mentioned at this time: the appointment of\na full-time NAEB director of research, the soli¬\nciting of assistance and cooperation with all govern¬\nmental and non-governmental agencies which might\ncontribute to the national advancement of research\nin educational broadcasting, and the enlargement of\nthe present research committee to include outstand¬\ning specialists from the other disciplines.\nNET WORK NEWS\n—Bob Underwood\nWith January of the new year well under way, a look\nat the past year is in order. We here feel that 1957\nwas a pretty good year for the network, and perhaps\na few statistics will make the point for us: during\n1957 the network made some 1,373 programs avail¬\nable for broadcast; the total time of these programs\ncame to 586 hours and 25 minutes, and, by figuring\nthe orders received for the programs a fair guess\nwould be that the American public heard approxi¬\nmately 16,799 hours of NAEB Radio Network pro¬\ngrams during 1957.\nLast year also found a great deal of new equip¬\nment coming into our office: a new Ampex, some new\nspeaker systems for checking tapes, many new mail¬\ning boxes to protect the tapes in the, mail, and numer¬\nous instruments for checking the efficiency of our\nequipment. All of these have contributed to the gen¬\neral improvement of network services.\nAlso, I feel that the quality of network programs\n(technically and content-wise) maintained a stand¬\nard of intelligent programming for which the network\nhas become known. This is borne out by the marked\nincrease in inquiries as to the availability of network\nprograms for both classroom use and public service\nbroadcasting over commercial stations. Also, as an¬\nother story in this issue indicates, network programs\nare assisting in bringing the true “American story”\nto peoples far removed from our shores.\nSo much for last year; how about 1958? From\nwhat I have seen, I believe 1958 could be our biggest\nyear program-wise. The future series scheduled for\ndistribution this year are very promising. Many\ngrant-in-aid series will be made available, but they\ncannot fill our schedule. That is why we need sub¬\nmissions from all member stations. Don’t feel dis¬\ncouraged if your first submission is rejected. Go out\nand produce a better series, and then submit that\none!\nWe must have better tape returns during 1958.\nSince our recent memo to all stations regarding tape\nreturns, we have been amazed by the response. How¬\never, this response must continue on a year-round\nbasis, not for a few weeks. Please keep the tapes\ncoming regularly, we do.\nOne final note: we have a new telephone number.\nOur number now is: EMpire 7-6611, Extension 3394.\nIf you will use this number it will help speed up long\ndistance calls to us.\nThanks for the many Christmas cards, and a\nHappy New Year to all.\nPUBLICITY AND PUBLIC RELATIONS\n—William Bender, Jr.\nWZJOM, University of Michigan\nThis launches a new, possibly regular, column in your\nNewsletter. Generally, we shall cover publicity, pro¬\nmotion and/or public relations, but the particular\ncontent of each column is going to be determined\nlargely by what you have sent in when the monthly\ndeadline arrives.\nWe therefore start with this invitation: Send us\nyour favorite case histories of effective publicity or\npublic relations activities — stunts, stories, tech¬\nniques, campaigns, etc. that have worked for you.\nWrite them as concisely as possible, and' we shall\nprint them in this column. In this way we hope to\nstart a long-needed information exchange devoted to\nour specific situation as educational broadcasters.\nIt has been suggested we also devote some space\nto examining our common problems in promotional\nwork. But what are they? Lack of manpower to pro¬\nduce station publicity? Newspaper editors that hate\n4\nNEWSLETTER"
}