{
  "id": "d1597-9",
  "text": "versity of Minnesota’s educational radio station.\nThe purpose of the workshop is to familiarize,\nparticipants with the history, principles and opera¬\nting problems of educational broadcasting and TV.\nEquipment to be used includes image orthicon and'\nvidicons, cameras, kinescope recorders and the\nU. S. C.’s FM radio station.\nEARLY ON-THE-AIR OPERATION\nPREDICTED FOR N.M. TV STATION\nA prediction that channel 5, the new TV station\nbeing set Up by the University of New Mexico and\nAlbuquerque Public Schools, will be on the air early\nnext year, was made by Dr. Harold 0. Hied, director\nof extension, summer session and community services.\nDetailed information concerning the workshop\nmay be obtained by writing Mr. Harwood at the\nabove address.\nDIRECTORY CHANGES\nP. I 96 Associate Members\n63 Affiliate Members\nP. 2 Delete:\nVice President: Mr. Richard Hull\nStations WOSU-AM-FM-TV\nThe Ohio State University\nColumbus 10, Ohio\nAdd:\nVice President: Mr. Jack McBride\nStation KUON-TV\nUniversity of Nebraska\nLincoln, Nebraska\nDelete:\nSecretary: Mr. Jack McBride\nStation KUON-TV\nUniversity of Nebraska\nLincoln, Nebraska\nAdd:\nSecretary:\nP. 21\nAdd:\nP. 30 Add:\nP. 32 Add:\nMr. Haskell Boyter, Dir.\nRadio and TV Education\nAtlanta Board of Education\n740 Bismarck Rd., N. W.\nAtlanta, Georgia\nDuvall County\nBoard of Public Instruction\nMr. O. P. Kidder, Jr.\nTelevision Coordinator\n605 Ocean Street\nJacksonville, Florida\nTelephone: EL-6-7121\nCompton College\nMr. Foster Davidoff\nI I I I East Artesia Blvd.\nCompton, California\nCranbrook Academy of Art\nand Institute of Science\nMarion H. Bemis, Director\nPublic Relations\nCranbrook Institutions\nBloomfield Hills, Michigan\nMontana (Region VI)\nMontana State College\nDr. Erling S. Jorgensen\nActing Director\nUniversity Studios\nMissoula, Montana\nDr. Ried said that the station expects to be oper¬\nating shortly ofter the second semester begins Feb. 3.\nLatest step in the studio’s progress toward going\non the air was the, FCC’s approval of installation of\nthe studio transmitter link carrying the micro-wave\nfrom the studio to the crest of Sandia Mountains. The\nnecessary equipment has been promised about the\nmiddle of January.\nDr. Bernarr Cooper, professor of speech and di¬\nrector of TV and radio, said approval of the com¬\nmunication circuit between the transmitter and the\nstudios is still pending. He added that several other\napplications are pending, including two with the\nforestry service that supervises occupancy of govern¬\nment lands on the crest.\nRECOMMENDED READING\nTelevision in Education, an excellent reference\nbooklet as well as an excellent story of the role both\nradio and TV can play in U. S. education, has just\nbeen published by the U. S. Department of Health,\nEducation, and Welfare.\nCo-authors of the work are Dr. Franklin Dunham,\nchief, educational uses of radio and television, Dr.\nRonald R. Lowdermilk, specialist for technical phases\nof educational radio-television; and Mrs. Gertrude G.\nBroderick, specialist for program research phases of\nradio-tele vision.\n“What is being done in Educational Television,”\n“How a Community Can Plan for Educational Tele¬\nvision” and “Exploring the Practicability of Direct\nTeaching by Television” are among the subjects dis¬\ncussed in the booklet.\nIn addition, the, work’s appendixes bulge with\nvital information ranging from a listing of closed\ncircuit ETV installations to one of foundations\nmaking grants to ETV stations. Also included are a\nnumber of “Typical ETV program schedules.”\nThe booklet is now available for 55 cents through\nthe Superintendant of Documents, U. S. Government\nPrinting Office, Washington 25, D. C.\n10\nNEWSLETTER"
}