{
  "id": "d1260-1",
  "text": "amount of money requested from the NAEB and the\nspecific purpose for which it is to be used, (11)\nevidence of the school’s ability to conduct a work¬\nshop whether or not a grant is forthcoming, and (12)\nany other pertinent information that might aid the\nselection committee in making a decision (the com¬\nmittee may later ask for more detailed information\nof one sort or another.\nThe application should be accompanied by a\nstatement signed by a responsible administrative off¬\nicer of the institution, signifying the school’s willing¬\nness and ability to accept and administer such a grant\nand to make an accurate accounting to the NAEB of\nthe funds expended.\n1958 NAEB CONVENTION\nThe NAEB’s national convention will be held\nat the Sheraton-Fontenelle Hotel in Omaha, Neb.,\nfrom Tuesday, Oct. 14 through noon Friday,\nOct. 17.\nNETWORK NEWS\n— Bob Underwood\nAt this time the program offering for the second\nquarter of this year is in distribution. This offering\ncovers the period April through June, Issues #14-26.\nThere are two new grant-in-aid series being dis¬\ntributed with this offering: “Man Is A Thing,” a\nstudy of Freud’s influence on contemporary thought,\nand “One Nation Indivisible,” a study of the rise of\nnationalism in various countries. We believe you will\nfind these series particularly interesting.\nIn addition, we have exclusive broadcast tapes of\nthe Peninsula Music Festival conducted by Dr. Thor\nJohnson of the Cincinnati Symphony Orchestra, and\na series on Sweden In Music; another series is de¬\nvoted to The French Story, a comprehensive 39-week\nseries on the history of France.\nOne of our continuing series, “Carnival Of Books,”\nhas won the Thomas Alva Edison Foundation Award\nfor the best children’s radio show. We wish to con¬\ngratulate Mrs. Ruth Harshaw, producer of the series,\nfor gaining this notable distinction. Thirteen pro¬\ngrams of “Carnival Of Books” are included in the\nsecond quarter offering.\nMay we again request that all stations send in\ntheir orders for this second quarter offering well in\nadvance of the deadline date? It is important that\nwe have your order as soon as possible. Thanks for\nyour help.\nThe. tape return balance sheets are out now, and\nwe have received some letters of complaint about the\nbalances shown. We here know that the figures given\nfor 1957, if not always exactly correct, are almost so.\nThat is, we are never off by a hundred or so in count¬\ning any given return shipment.\nThe main basis of the misunderstandings seems\nto be the original tape return balance as of Dec. 9,\n1956 on which all subsequent balances have been\nfigured. We are not going back and change these ori¬\nginal figures. All stations had the opportunity to de¬\ncide their tape inventory balance when the new re¬\ngulations were announced in 1956, and almost one\nyear ago, February 1957, every station then on the\nnetwork received a letter informing it of its tape bal¬\nance. In that letter we invited questions, comments,\ncomplaints, etc. about the balance. That is when\ncomplaints about the balance should have been raised,\nnot now, a year later.\nTape is the blood of our operation, so we urge\nyour increased cooperation in getting tapes back to\nus as quickly as possible. The regular return of tapes\nis what keeps us going. Please do your part.\nThis month concludes the employment of Mrs.\nPeggy Enderby as network Traffic Manager. Begin¬\nning March 1 she will be replaced by Miss Barbara\nStevens, a graduate of the University of Illinois. We\nwould like to acknowledge Peggy’s fine work and\nwish her good luck in the future.\nPUBLICITY AND PUBLIC RELATIONS\nWilliam Bender, Jr.\nWUOM, University of Michigan\nOne of the most potent relations activities you can\nconduct is usually called “Visitations.” It is the prac¬\ntice of welcoming strangers into your studios and\nbroadcast facilities, a hospitality tour. You can cata¬\nlog visitations under three general headings: those\nwho “just stop in,” pre-arranged group tours and\nthe more formal Open House.\nIn each case, the individual visitor will gain a\nstrong impression of you after his tour and he will\npass on this impression to his circle of friends with the\nmost powerful “publicity instrument” ever develop¬\ned: word-of-mouth. Depending on your own pub¬\nlic-relations planning, the attitude the visitor takes\nwith him will be good or bad; it will rarely be indiffer¬\nent.\nHere are some random notes to help you assess\nyour own practice in handling visitors:\n1) Avoid any slavish “routine”; find out what the\n2\nNEWSLETTER"
}