{
  "id": "d1260-5",
  "text": "lying the project and of program areas which can\nbe profitably and appropriately explored in pursuit\nof the goals which have been established.\nThe Grants-in-Aid Committee of the NAEB, on\nthe basis of the achievements and experience of the\nfirst year of programming under the three-year theme,\nis prepared to offer certain supplementary sugges¬\ntions to those who are preparing applications for\ngrants-in-aid. Thus, for example, it will be noted\nthat of the 10 grants-in-aid awarded last year, six\nwere for series in the general area of the social or\nbehavioral sciences, two for programs dealing with\nthe arts, one for an essentially religious series, and\none for a series concerned with science. Recent de¬\nvelopments in world science, combined with a concern\nfor a substantial balance among the major areas of\nknowledge, suggest that program proposals in the\nfield of science will be particularly welcome this\nyear. Similarly, programs dealing with the human¬\nities, philosophy, religion, and moral values in con¬\ntemporary life will, all other things being equal, re¬\nceive enthusiastic attention from the Committee. At\nthe same time, it should be clear that significant,\nauthoritative, and attractive program projects in\nthe social sciences will continue to be regarded as en¬\ntirely appropriate for grants-in-aid.\nThe experience of recent years prompts the Com¬\nmittee to call particular attention to certain aspects\nof the program application which, if neglected, en¬\ndanger the success of any proposal. Chief among\nthese is the requirement that all budget proposals\nspecify explicitly — in dollars and cents — the char¬\nacter and extent of the applicant’s willingness to\nmatch, or exceed with his own funds the financing\nsupplied by the grant-in-aid. It is not, that is, suf¬\nficient merely to enumerate in general terms the\nservices, facilities and materials which will be in¬\nvolved in producing the proposed series; it is nec¬\nessary, on the contrary, to reveal the willingness of\nthe applying institution to draw upon its own funds\nfor an amount at least equal to that provided by\nthe grant-in-aid, although this latter way be par¬\ntially services and facilities expressed in monetary\nequivalents.\nApplicants are, in addition, again reminded that\nthe Committee cannot properly assess any proposed'\nseries upon the basis of a general “idea” alone or\nupon a fragmentary “sample topics” which fail to\nreveal a well-planned, topical outline for a total ser¬\nies of radio programs. Indeed, applications not ac¬\ncompanied by cdl materials and details specified in the\nprinted announcement of grants-in-aid are, at the\nvery least, under grave disadvantage when com¬\npared with other proposals which are not thus im¬\npoverished. This is particularly true of the “pilot\ntape,” since, in the past, the Committee has found\nsuch recordings the most eloquent evidence of the\ncharacter and quality of the proposed program ser¬\nies.\nAt a time when prospective applicants are still\npresumably engaged in preliminary planning, it may\nbe useful to disinter for quotation here the report of\nthe NAEB Grants-in-Aid Committee for the year\n1957. That report contained (as the pious minority\nwho read reports may remember) the following state¬\nment of four general objectives which seem, to the\nmembers of the committee, to govern its judgements.\nThey are:\n1. To achieve valid and important educational\ngoals in terms of genuine needs on the part of the\nlistening public or clearly defined segments there¬\nof;\n2. To provide for educational broadcasters — and\npossible secondary users — recorded materials\nwhich can be enthusiastically and profitably\nbroadcast.\n3. To encourage, through financial support and\ninterest, the production by an increasingly\nlarge and diversified group of educational\nbroadcasters of programs designed for distrib¬\nution through the NAEB network;\n4. To support the production of programs which\nconstitute, in themselves distinguished speci¬\nmens of the broadcaster’s art.\nOver the past few years there has been an as¬\ntonishing increase in the number of grants-in-aid\napplications received as well as in the care, wis¬\ndom, and imagination with which proposed series\nhave been planned. There is every reason to suppose\nthat the Grants-in-Aid Committee will, in 1958, be\nfaced with delicate and difficult choices among an\nunprecedentedly large number of excellent propos¬\nals. In this highly competitive situation, applicants\nwill be well-advised to be as informative as possible\nand to reveal clearly the relevance of their proposals\nto the goals of the total three-year project.\n6\nNEWSLETTER"
}