{
  "id": "d747-13",
  "text": "COPT OF LETTER\nstate mtvimin of imi\nim& cm, m>A\nJanuary 29, 1951\nMr. Richard L, Rider\nManager, MAH Tape Met work\n119 Gregory Ball\nUniversity of Illinois\nUrb&na, Illinois\nPear Mr. Rider;\nAm writing in order to get your reaction, or the program\nacceptance committee’s reaction, on the possibility of our presenting\nto the MAES net @ special one-time broadcast of a word description\nof an atomic defense field test heir at the University of Iowa.\nLast Saturday, January 2?th, the University of Iowa\nculminated a. semester course entitled * Defense Measures With\nSpecific .Emphasis on Radiological Effects*, with an atomic defense\nfield test. As we understand it, this ie the first of its kind\nheld in the middlewest. The class members actually went on the\nfield with atomic energy instruments in an attempt to show bow a\ncivilian defense corps would operate should an atomic bomb be\ndropped.\nWSUI made an on-the-spot recording of this field test.\nThis is an half-hour documentary ty>e program. It has been broad¬\ncast on our stations and it is h >ped that many Iowa stations will\ncarry it.\nIt is true, whan making the recording that we didn’t\nthink in terms of the net. and consequently it is quite localised\nwhich is a point against it. I believe, however, atomic energy\nand thought on the advisability of making this recording av liable.\nThere is gre t possibility that we, her® in Iowa, have\ndone the obvious thing of over-emphasising its importance and think\nthat we have something that should be interesting to everyone and\nworth their while to listen to. If, from this description,you or\nthe committee are interested, we would be happy to send the tape,\nbe do want the network to have it if it la' worth while. ' © have\nreceived much satisfaction from doing it, and if the ■ uality is of a\nhigh enough caliber and It should be shared by others we cert inly\nwant to share it.\nWill appreciate hearing from you as soon m possible.\nTours very truly\nRichard C. bettsrborg\nProgram Director\nRSC$»lm"
}