{
  "id": "d1318-0",
  "text": "SUMMARY STATEMENT OF TV AND RADIO RECORDING RIGHTS\n(As first discussed at the Educational Television and Radio Center s Program Man¬\nagement Conference, March 17, 1954)\nBy Fred S. Siebert, Director\nSchool of Journalism, University of Illinois\nA RADIO OR TELEVISION PROGRAM CONTAINING COPYRIGHTED MUSIC AND/OR NON-DRAMATIC\nLITERARY MATERIAL, MAY BE RECORDED ON TAPE, FILM OR KINESCOPE WITHOUT CONSENT OF\nTHE COPYRIGHT OWNERS. SUCH RADIO OR TELEVISION PROGRAM MAY BE REPRODUCED FOR\nBROADCAST OR FOR OTHER PURPOSES PROVIDED SUCH REPRODUCTION IS NOT A PUBLIC PERFOR¬\nMANCE FOR PROFIT.\n1. The above statement does not apply to programs containing \"dramatic or\ndramatico-musical\" copyrighted works. Such works must be cleared for all types\nof performances.\n2. Anyone may make a recording (transcription, film or kinescope) of copy¬\nrighted music or non-dramatic literary material so long as the purpose of such\nrecording is not \"public performance for profit.\"\n3. A broadcast of such recording by a licensee of an educational station is\nnot a \"performance for profit\" and does not require clearance.\n4. A broadcast of the same type of program by a profit-making organization\no r institution requires clearance. (It is still questionable whether a non-pro¬\nfit educational institution holding a commercial license must clear the above\ntype of programs.)\n5. The use of such recording for other types of presentation by non-profit\norganizations such as in schools, etc., does not require clearance.\n6. The right to use tapes, films or kinescopes set out above may be limited\nor restricted by contracts between the broadcaster and a source of program mater¬\nial and also by contracts or arrangements between the broadcaster and performing\nartist.\n7. All broadcast stations are required to comply with the Sec. 325a of the\nCommunications Act of 1934 prohibiting rebroadcasts without the express consent\nof the originating station.\nCopyright\nNAEB HDQ.\nApril 3, 1954"
}