{
  "id": "d1850-4",
  "text": "-5-\nIV. The Operation and Direction of the University Radio Station.\nThe University Itedio Station will \"be in charge of a Director who will \"be\nthoroughly conversant with the public, educational, and technical uses of radio.\nHe will \"be a person who understands and is devoted to the whole conception of a\nUniversity: that it is a social corporation dedicated to the public welfare and\nthe ascertainment of the good, the true, and the beautiful.\nTo this extent, the University Eadio Station must remain impartial in spe¬\ncific political, economic, social and cultural discussions. It must be free of\nany tendenciousness, whether in politics, art, or science. At the same time it\nwill be recognized that the University, as a public institution chartered by\npublic authority and devoted largely to the education of youth for service and\ncitizenship in a democracy, will give special attention to the presentation and\ninculcation of American ideas and ideals. The authority, therefore, must be re¬\nserved to refuse to permit the use of the University Eadio by any person or\norganization soliciting time when, in the opinion of the Committee, such an of¬\nfering would not be of sufficient public and educational interest to justify its\npresentation.\nThe same impartiality will guide the actions of the various staffs of the\nUniversity Eadio Station.\nThe Director will be generally responsible for the conduct of the University\nEadio Station and the preparation of its programs. In his selection of speakers\nand programs he will be guided by canons of good taste and will exercise the ma¬\nture and intelligent judgments of a person associated with a University activity.\nHis responsibility should not and cannot go beyond this point. The speakers them¬\nselves, and the university faculties, departments and offices sponsoring them,\nmust assume responsibility for their own statements and the programs they prepare.\nTo realize the general ends and specific purposes for which the University"
}