{
  "id": "d1711-0",
  "text": "Volume V Number 12\nAugust l4, 19 5jj~\nCOMMISSION TO HEAR ORAL ARGUMENT ON MPATI PROCEEDING\nBecause of the numerous comments filed in the rulemaking proceeding concerning\nallocation of UHF channels for the MPATI operation, and as a result of a request by\nMPATI, the FCC issued notice on July 24 of a scheduled oral argument. The argument will\nbe held at the Commission's offices in Washington, D.C., on October 9.\nThe FCC has advised that parties interested in participating in the argument\nshould notify the Secretary of the Commission, Ben F. Waple, in writing on or before\nSeptember l8, briefly stating whether or not they will support or oppose the Petition,\nand the approximate amount of time they wish to use in argument. After these various\nrequests have been received, the amount of time allowed to various parties will be\nspecified by further Order, which will also set forth the order of presentation.\nThe proceeding involves MPATI's petition that its present experimental operation\n^ be authorized on a regular basis and that six UHF channels be provided for that purpose.\nIn the June 15 Washington Report (Vol. V, No. 9), the NAEB announced its filings on the\nMPATI proposal. Copies of the filings are available at the Washington office.\nCOPYRIGHT REVISION BIUS INTRODUCED IN CONGRESS\nOn June 20, identical bills proposing a complete revision of the copyright laws\nwere introduced in the Senate and the House. The bills were drawn up under the direction\nof Abraham L. Kamenstein, Register of Copyrights, and copies are obtainable from the\nHouse Judiciary Committee or the Senate Judiciary Subcommittee on Patents, Trademarks,\nand Copyrights.\nThe Bill largely ignored the recommendations of the Ad Hoc Committee formed\nlast March to coordinate the interests of education as users of copyrighted materials.\nThe proposed revisions would not even permit limited copying for educational purposes\nand would only permit the telecasting of \"live\" performances over closed-circuit systems.\nThere is no exemption whatsoever for educational programing over the air.\nOn August 5, in New York, representatives of the Ad Hoc Committee held a press\nconference at which Dr. Fred Siebert, Chairman of the NAEB Rights Committee, indicated\nthe ways in which the proposed revision adversely affects education, elimination of\nthe exemption which permits non-profit organizations to use non-dramatic copyrighted\nmaterials; failure to permit recording of educational programs in the form of sound\nrecordings, films, kinescopes or videotapes; and limitation of the use of copyrighted\nmaterials to the classroom and to \"live\" broadcasts for reception solely within educa-\ntional institutions."
}