{
  "id": "d1842-1",
  "text": "mittees of the American Council on Education and\nother professional organizations.\nThe first meeting of the Office of Education and\nthe NAEB, eight years ago, resulted in the organiza¬\ntion of the Joint Council on Educational Television\nand the reservation of frequency space for educational\nuse. This was followed by the establishment of the\nETRC and other organized efforts designed to guide\nthe use of television and radio as educational tools.\nSimilar long-range plans are expected to result from\nthe present conference.\nMEMO FROM THE\nEXECUTIVE DIRECTOR\n—Harry Skornia\nIt was very pleasant indeed to see so many of you at\nthe IERT. At such times my principal regret is that\nwe can’t be in several places at once, since Board\nmeetings, committee meetings and many other things\nhave a way of running simultaneously.\nThe NAEB Board meeting was one of the most\nsatisfying in years. A solid record of accomplishment\nwas reviewed, including NAEB participation in hear¬\nings on the Magnuson bill, plans for constitutional\nchanges for greater consistency and clarity, plans for\nthe Washington meeting, which will have been held\nby the time you receive this, Foundation relations\nand certain other items mentioned elsewhere in this\nissue.\nI was particularly gratified at the reaction to\nour “NAEB sessions” and the luncheon as well. Dr.\nBrish’s talk will be carried in the fall issue of the\nJournal, where any who missed it will have an op¬\nportunity to enjoy it.\nWe are also happy to be able to report the NAEB’s\nfirst Industrial Associate. At the NAEB luncheon\nMr. Philip Jacobson, Manager of Instructional Tele¬\nvision of Motorola Inc. presented President Paulu\nwith a check for $500.00 as Motorola’s way of con¬\ntributing to the development of those things the\nNAEB stands for. We hope to have others to mention\nas time goes on. This is a natural and gratifying de¬\nvelopment, in line with the NAEB’s efforts to broaden\nthe base of its support. Our thanks to Motorola.\nSeveral people have urged me to repeat for the\nbenefit of all the gist of a few remarks I was called\nupon to make at our luncheon. I’m very glad to do\nthis, and I also want to thank those who took the\ntrouble to write their appreciation for last month’s\n“editorial” as contained in this column. The remarks\nwhich follow further elaborate on that theme—\nspecifically illustrating with a brief description some\nof the ways in which we proceed to achieve what we\nthink should be the goals of an association which as¬\npires to be something more than a group of tech¬\nnicians.\nA great many NAEB members have had applica¬\ntions, recommendations and nominations for grants-\nin-aid and scholarships, and the many seminars and\nworkshops we run, returned because they were not\nin complete form, or because they were not submitted\nin the proper number of copies.\nIt is difficult for most people to realize the volume\nof such applications which pile up seasonally. And\nmany do not understand the reason why we are so\ninsistent on receiving all these in the number of copies\nspecified.\nLet’s answer the first question first. The NAEB\nis democratically operated. No member of the Head¬\nquarters staff decides who will attend any workshop\nor seminar, or who will receive a program or work¬\nshop grant, or a scholarship. These decisions and\nselections are all made hy committees of your peers—\ncommittee members who serve as appointed, con¬\ntributing thousands of man hours each year to the\nNAEB, because they believe in it.\nWhen an application is received in six copies, for\nexample, the original is sent to the Chairman of the\ncommittee, who may be in Boston. One file copy is\nkept here. The other four are distributed to the\nother members of the committee. In a typical dis¬\ntribution of committee members, one might be in Ala¬\nbama, one in Wisconsin, one in Texas and one in\nBoston. That is why we must have the specified\nnumber of copies.\nWhy don’t we just make the extra copies in such\ncases? A few years ago we did. But the volume is\nnow so great that we no longer can. Secretarial staff\ndoes not permit typing copies, many of the type¬\nwriter ribbons used won’t photograph on our photo\nmachine, and of course it’s really the responsibility of\nthe applicant anyway. If the application is in the\nright number of copies, but the recommendations, or\ncertifications required are in only one copy, we must\nstill return them. For the entire committee needs to\nhave the full data on each person. No one of us here\nat Headquarters can even begin to read nearly all the\napplications.\nFrom the above illustration you might visualize\nonly a single committee at work. Actually, at any\ngiven time, applications may be coming in which must\nbe distributed to from six to eight different com¬\nmittees. Within the last few weeks applications or\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 14 Gregory Hall,\nUrbana, III. $5 a year, edited by Jane Lombard.\n2\nNEWSLETTER"
}