{
  "id": "d1842-3",
  "text": "What does this mean? It means that here are\nclose to 1500 NAEB member representatives who will\nnever be quite the same. While each of us has had\nhis respective nose to the grindstone, a new profession\nhas been born. The management of television and\nradio stations has begun to attract distinguished edu¬\ncators, college and university presidents, distinguished\npublic-spirited industralists. The number of people\nin the movement who have PhD’s, Master’s degrees\nand long lists of distinctions to their credit, is multi¬\nplying.\nOur some 135 active member stations alone have\non their staffs between three and five thousand edu¬\ncational broadcasters who have chosen this as a\ncareer. Some 94 associate members account for an ad¬\nditional 1000 or more. Some have staffs of only three\nor four—with many student trainees and student di¬\nrectors. Others, even associates, have staffs of close to\n100. Several scores of aspiring educators and former\ncommercial broadcasters have been helped to find\npositions in this new “movement” by the NAEB\nplacement service or at NAEB conventions or\nregional conferences.\nI find this exciting. For the NAEB I find it most\nsatisfying. To contribute to the birth of a profession\n—dedicated to making newer, better and nobler uses\nof our electronic media—is a proud experience. New\ntypes of research are being developed—measuring\nthe impact of various kinds of programs on children\nand adults in a way commercial research has never\ndone. New and higher types of talent and programs\nare being developed, some of which we each year\nproudly see transferred to the commercial media—\nwe hope and believe with many of their ideals and am¬\nbitions intact. New production, lighting, engineering,\nwriting and teaching techniques are being developed,\nwhich contribute to the national and international\ngrowth of higher and better standards. Slow as it is,\nprogress is ours. I hope you share with me the sense\nof pride I have in this new service for America. This\nis part of what the NAEB believes in and stands for.\nNETWORK NEWS\n—Bob Underwood\nI was thankful for the opportunity to see and talk\nwith some network people at the recent IERT meet¬\ning in Columbus. I sometimes wonder if the common\ninterests and problems of network members don’t\nmerit a special “clinic” or discussion group session at\nthe NAEB Convention each fall. The IERT meeting\npresents little opportunity for such a meeting, except\non a most informal basis. It seems reasonable to me\nthat a network of some 80 stations should have at\nleast one annual meeting to bring network and' station\npersonnel together. Perhaps something along this\nline can be arranged for the October NAEB Conven¬\ntion if the demand from network members is strong\nenough.\nAt the recent IERT meeting the Radio Network\nSchool Committee met and selected a new in-school\noffering which will be distributed beginning in Sep¬\ntember. This new offering is for the 1959-60 school\nyear, and, frankly, I believe the offering is a pretty\ngood one. All members of the committee deserve to\ntake a bow for hard work well done.\nThere, was an unusually large number of in-school\nsubmissions this year. This was interpreted as an en¬\ncouraging sign of increased awareness of this import¬\nant field, and I certainly hope such is the case. On be¬\nhalf of the committee and myself, “Thank You” to all\nthose who submitted' programs. Your interest is ap¬\npreciated, and we hope to receive submissions from\nyou again next year.\nAnother matter of import is the network’s\ndistribution of Dr. Albert Schweitzer’s latest state¬\nments on the general topic of “Peace or Atomic War.”\nTo our knowledge, we are the only network in this\ncountry to distribute these statements, and we wish\nto thank WSUI for preparing and making available\nthis program. The network will continue its service\nof providing outstanding special programs like this to\nits members.\nPUBLICITY AND PUBLIC RELATIONS\n—William Bender, Jr.\nWUOM, University of Michigan\nOne of the more difficult (and more successful) pub¬\nlicity campaigns for an educational series is that con¬\nducted by N. W. Ayer and Son, Inc. for the Bell Sys¬\ntem Science Series.\nIt is a series in name only. The random appear¬\nance of the telecasts prohibit the usual “audience\nbuild-up” you would expect with a regular weekly\nprogram. Only four programs, “Our Mr. Sun,”\n“Hemo the Magnificent,” “The Strange Case of the\nCosmic Rays,” and “The Unchained Goddess,” have\nbeen telecast to date, plus re-runs of the first two.\nDonald C. Thompson, supervisor of the public\nrelations department at Ayers, has sketched for us\nsome of the many activities they conduct to draw an\naudience for each of these random telecasts:\n“In publicizing each telecast, the Bell Companies\ndirect their information programs through various\nmedia to reach: 1) the general public, 2) customers,\n4\nNEWSLETTER"
}