{
  "id": "d1842-6",
  "text": "BOARD SETS NEW\nPUBLICATION POLICY\nA new policy was determined at the recent NAEB\nBoard of Directors meeting in Columbus, 0. affecting\na change in the number of Newsletter and Journal\ncopies sent to members, on the basis of their member¬\nship dues.\nEffective this month, members paying $100 or\nmore in membership dues will receive three copies of\nboth the Newsletter and Journal; those paying from\n$50 up to but not including $100 will receive two\ncopies; those whose dues are less than $50 will receive\none copy. The publications will be sent to one ad¬\ndress in the case of each membership.\nAdditional subscriptions for member institutions\nfor any address has also been changed to $3.25 a year.\nREGION I MEETING\nSCHEDULED\nA meeting for all members of Region I is slated for\nthe weekend of September 19 in New York City. The\ntheme of this meeting will deal with better integration\nof radio and television as companion media in further¬\ning education’s total responsibility.\nResponse to a questionnaire sent to all members\nin the region indicated a preference for a September\nmeeting rather than one in October, and most people\nseemed to prefer holding the session in New York\nCity. Information on the program and accommoda¬\ntions will soon be sent to all members.\nMETA FACES\nPOSSIBLE SHUT-DOWN\nEd Note: At press time, META’s financial position\nhas been brightened considerably by a gift of $5,000\nfrom WMCA, New York AM station. However, ad¬\nditional individual donations amounting to “several\nthousands of dollars” and the ETRC summer pro¬\nduction contract still do not insure META’S resum¬\ning live programming.\nEmergency financing, chiefly through contractual\narrangements with the ETRC, has enabled the\nMetropolitan Educational Television Assn. (META)\nto insure its operations as a production center through\nthe summer, according to an announcement by Dr.\nAlan Willard Brown, META president.\nLast month, Dr. Brown announced that META\nwould be forced to suspend its programming activities\nbecause of lack of funds. He said that the organiza¬\ntion needs $200,000 to continue operations from June\n1st through December 31st. Dr. Brown indicated\nthat the need for this amount is still acute, but that\nMETA will not have to close down completely, a pos¬\nsibility which was averted as a result of “realistic\ngrants from private and independent sources” which\nhe was not at liberty to disclose.\nAccording to the May 26 issue of Broadcasting, an\nintensive 6-week fund raising drive brought the as¬\nsociation $6,000 and three grant-supporting founda¬\ntions jointly pledged $100,000, but the pledge will re¬\nmain unfilled until 1959. Dr. Brown’s estimate of\nMETA’s needs for the next six months is half of\npresent annual budget. It derives funds from founda¬\ntion grants, revenue from production of kinescopes\nfor the ETRC and public contributions.\nExisting under a charter of the New York Board\nof Regents, META’s plight represents a lack of\nfinancial and civic support. In his announcement last\nmonth, Dr. Brown placed the situation squarely be¬\nfore the people of New York as he said, “It is dif¬\nficult to believe that a city such as New York, one of\nthe world’s greatest cultural centers, should be with¬\nout educational broadcasting. I call upon citizens of\nthe metropolis to guarantee the future of educational\ntelevision in New York by contributing generously\nto META. We cannot expect foundations alone to\nprovide this support.”\nNEW ENGLAND PLANS\nETV NETWORK\nPlans for a New England ETV network are being\ndrawn up by representatives of the six state area who\nmet recently at WGBH-TV, Boston. Daily open cir¬\ncuit telecasts would include programs for elementary\nand secondary schools, for high school pupils who\nwish advanced standing for college credit, and for a\ngeneral adult audience.\nThe regional network would use educational and\ncommercial TV facilities where they exist, with the\nexpectation that further educational outlets would\nbe developed where there are none.\nKNME-TV ON AIR\nIN RECORD TIME\nNew Mexico’s first educational TV center has\nachieved an unofficial record in “getting on the air.”\nKNME-TV, sponsored by the University of New\nMexico and the Albuquerque public schools, started\nbroadcasting on open circuit May 1, just over six\nmonths after its original permit to construct was\ngranted by the FCC.\nAlthough a station’s application is not usually ac¬\ncepted for one to three years after the construction\npermit is granted, the station has been granted\nJUNE, 1958\n7"
}