{
  "id": "d839-26",
  "text": "Systems Vary\nBut ethical systems also vary from one culture to another. Let's take an ex¬\nample. We have a saying: \"Honesty is the best policy.\" To lie is to go counter\nto our basic ethical ideas, and ve would think it impossible to have a code of\nethics in which this idea is not basic. But there are many African tribes where\nthe principle is: Tell a person what he wants to hear, no matter whether it is the\ntruth or not. They believe it is more important to say what is expected than to\nbother with the truth. We sometimes do this about women's hats and the boss's\nideas, and excuse them as \"white lies\".\nThese people sometimes have another rule: It is wrong to say anything about\nanybody else, no matter if it is the truth. Telling stories to them doesn't mean\nlying, but merely saying something that might discredit somebody else. It is just\nas wrong to \"bear witness\" as to \"bear false witness\". The underlying ethical\nprinciple is that a person's feelings must never be hurt by anything that is said.\nWe do not know if there are any ethical principles that are found in every\nsociety. Some appear to be. In all societies there are regulations against murder\nor injury of others, though there always are special exceptions where killing and\npunishment may be allowed. Property rights of one kind or another are always re¬\ncognized, though the form these rights take may vary. For instance,the Eskimo owns\nanything he makes, but if somebody needs a thing the owner isn't using, he may take\nit without permission or penalty.\nBasic Rules\nPerhaps we can understand ethics best by saying that they are the basic rules\nby which the rights of the individual and the needs of society are compromised.\nFor a society must regulate the conduct of its members to preserve its own exist¬\nence, and therefore must curtail the actions of its members. Each society has its\nown solutions to this recurrent problem.\nThe Yurok Indians of California had a system of ethics which recognized that\neach person had the full right to his own property but it was his responsibility\nto see to it that the right was respected. A part of the ethical system was that\n30"
}