{
  "id": "d1518-1",
  "text": "Page 2\nFebruary 17, *945\nORGANIZATION BY APPROVAL OF THE EXECUTIVE COMMITTE, AND A TVO-\nTHIRDS AFFIRMATIVE VOTE OF ALL ACTIVE MEMBERS OF THE ASSOC I AT I ON,\nt-ACH MEMBER INSTITUTION OR AGENCY SHALL BE ENTITLED TO ONE VOTE.\n(b) Amy INDIVIDUAL, EDUCATIONAL INSTITUTION, OR PUBLIC SERVICE\nAGENCY ENGAGED IN EDUCATIONAL BROADCASTING MAY BECOME AN ASSOCIATE\nMEMBER OF THIS ASSOCIATION 8Y APPROVAL OF THE EXECUTIVE COMMITTEE,\nAND A TWO-THIRDS AFFIRMATIVE VOTE OF ALL ACTIVE MEMBERS OF THE\nassociation. Associate members shall have all the privileges of\nACTIVE MEMBERSHIP, EXCEPT THAT THEY SHALL NOT BE PERMITTED TO\nVOTE OR TO HOLD OFFICE.\nAmendment PROPOSAL No* 2:\nThat Article ! shall be amenoeo further by adding to Proposal\nHO. I THE FOLLOWING WORDING*\nThis amendment shall become effective Arrh., 1945, but\nshall not change the status of any member in any class¬\nification held on December 31, 1944*\n*n reply to my letter of January 5, a couple of youse guys came back\nWITH COMMENTS, WHICH I THINK SHOULD BE PASSED ALONG . I TAKE THE\nLIBERTY OF QUOTING, BRIEFLY, FROM ONE MlKE HANNA, WHCU:\n\"May I POINT OUT THAT, BY THE RESTRICTION AS STATED, THE ASSOCIATION\nIS PLACING EMPHASIS NOT ON THE PURPOSES OF OPERATION OF A STATION, BUT\nRATHER ON THE MEANS USED TO RAISE FUNDS FOR THAT OPERATION,. In OTHER\nwords, if an educational station or a station owned and operated by a\nUNIVERSITY OR OTHER EDUCATIONAL INSTITUTION GETS ITS MONEY THROUGH\nTAXATION OR THROUGH SOME ENDOWMENT, IT IS ELIGIBLE FOR MEMBERSHIP,\nUN THE OTHER HANO, IF A UNIVERSITY-OWNED STATION, SUCH AS THE C0RNELL\nSTATION, OERIVES ITS OPERATING FUNDS FROM THE SALE OF TIME, THEN THAT\nSTATION IS NOT AN EDUCATIONAL STATION UNDER THE IMPLICATIONS OF THE\nPROPOSED AMENDMENT.\nThat may be your intent. If so? my argument is of no standing. If,\nHOWEVER, THE PURPOSE OF THE NAt.8 IS TO JOIN TOGETHER THOSE STATIONS\nOVNED AND OPERATED BY EDUCATIONAL INSTITUTIONS AND DEVOTED TO EDUCA¬\nTIONAL PROGRAMS AND PUBLIC SERVICE, THEN IT WOULD SEEM TO ME THAT THE\nSOURCE OF OPERATING FUNDS BECOMES IMMATERIAL, OR AT LEAST ENTIRELY\nSECONDARY TO THE PHILOSOPHY AND PURPOSE UNDER WHICH THE STATION IS\nOPERATED.*\nNow, quoting Elmer Sulzer of th^ University of Kentucky:\n»»1\nAM COMPLYING WITH A REQUEST IN YOUR LETTER OF JANUARY 5 TO TAKE MY\nPEN IN HANO AND EXPRESS MY OPINION REGARDING THE PROPOSED RAISE IN\nDUES. As YOU KNOW, I FALL INTO THAT RATHER QUESTIONABLE CATEGORY\nKNOWN AS AM ASSOCIATE MEMBER 1 HAVE PR08A3LY ALREADY EXPRESSED MY¬\nSELF SUFFICIENTLY IN REGARD TO THE LO’* REPUTE IN WHI CH THOSE BROAD¬\nCASTING OVER COMMERCIAL STATIONS ARE HELD BY THE ASSOCIATION, SO WE\nWON T GO INTO THAT. HOWEVER; SPEAKING FOR MYSELF, AND MYSELF ONLY,"
}