{
  "id": "d1201-2",
  "text": "NAE8 NEWS LETTER -3- October I, 1941\nWNYC TO BROADCAST METROPOLITAN COLLEGE TALENT SHOW\nBelieving that a welath of radio talent is blushing unseen on the ten or\nA DOZEN COLLEGE CAMPUSES DOTTING THE FIVE BOROS, WNYC, NEW YORK’S MUNI Cl-\nPAL STATION, IS GOING TO PRESENT A WEEKLY SERIES IN WHICH COLLEGE MUSICAL,\nDRAMATIC, COMIC AND VOCAL TALENT WILL BE USED EXCLUSIVELY*\nThe series gets under way Ocotober 8 with Or. Harry N. Wright, Acting\nPresident of City College, and Dr.^Mal Stevens, NYU football coach as\nguests. Titled ‘’Tomorrow’s Edition,” the program will follow the format\nOF A TYPICAL COLLEGE NEWSPAPER IN THAT NEWS OF COLLEGIATE SPORTS, ENTER¬\nTAINMENT, AND SPECIAL EVENTS WILL BE FEATURED.\nNorma Market., former Hunter College student, is producer and M. C. for\n'’Tomorrow’s Edition,” and Mitchell Grayson will direct.\nBandsmen from half-dozen metropolitan colleges will comprise the orchestra\nHEARD IN THE FIRST BROADCAST, WITH EDITH, HUNTER COLLEGE VOCALIST, AND\nMilton Moss, NYU comic, taking solo spots.\nWNYC TO DRAMATIZE WORLDS GREAT NOVELS\nThe cat-and-mouse battle of Raskelnikov and the police of Petregrad, the\nTRAGIC LOVE OF CAMILLE AND ARMAND DUVAL AND THE STRANGE PSYCHIC WANDERINGS\nOF Dr. JEKYLL-HYDE WILL BE AMONG THE STORIES DRAMATIZED IN A NEW SERIES\nTO BE PRESENTED OVER WNYC, BEGINNING FRIDAY, OCTOBER 17. PRESENTED IN\nCOOPERATION WITH THE NEW YORK PUBLIC LIBRARY, THE SERIES TO BE KNOWN AS\n’’Great Novels” will offer adaptations of the world’s great literature in\nTHAT MEDIUM.\nThis is the second series bn which the city’s station and the Public\nLibrary have cooperated. Last year ’’Life and Works” presented drama¬\ntizations OF THE LIVES AND THE MOST FAMOUS WRITINGS OF GREAT AMERICAN\nAUTHORS o\nMitchell Grayson will direct the series which will open with Hudson’s\n’’Green Mansions,\" followed by \"Camille,” ’’Crime and Punishment,” and\n”Dr. Jekyll and Mr. Hyde.”\nBANKING EXPERTS TO BROADCAST ON WNYC\nExperts from the city’s largest banking and investment houses will be the\nspeakers on a new series to be broadcast by WNYC, New York City’s Own\nStation in cooperation with the American Institute of Banking and the Board\nof Education. The program entitled ’’Behind the Teller’s Window,” will be\nheard on Wednesday, beginning October 15th, at S0?45 a.m.\nPHIL. COHEN JOINS STAFF OF NEW YORK CITY STATION\nPhil Cohen, well-known radio director and producer, has joined the staff"
}