{
  "id": "d1430-16",
  "text": "Mr. Niles Trammell, president of the National Broad¬\ncasting Co., has stated:\n“Another reason for the use of sustaining programs\nwas the voluntary recognition on the part of broad¬\ncasters that programs of certain types, such as religious\nprograms, informative programs furnished by various\ngovernmental agencies and certain programs involving\ndiscussions of political principles and other controver¬\nsial issues, were not suited to advertising sponsorship.\nThe use of high types of sustaining programs also\ncreates goodwill for the station and induces people to\nbecome accustomed to listening to certain stations in\npreference to others.”* * 6\nThe Code of the National Association of Broadcasters\nsimilarly recognized, until 1945, that the presentation of\ncontroversial issues (except forums) should be exclusively\nin sustaining programs. While the Commission has re¬\ncently held that an absolute ban on the sale of time for\nthe discussion of public issues may under certain cir¬\ncumstances not serve the public interest,7 it is neverthe¬\nless clear that such broadcasts should be primarily of a\nsustaining nature.\nThe Commission has never set forth and does not now\npropose to set forth the particular types of program\nwhich, for one reason or another, must remain free from\ncommercial sponsorship. It does, however, recognize\nalong with the stations and networks themselves that\nthere are such programs.8 Self-regulation consonant with\npublic sentiment, and a responsible concern for the public\ninterest, can best insure a suitable interpretation of the\nbasic principle which the industry itself has always recog¬\nnized, that some programs are by their nature unsuitable\nfor commercial sponsorship. Public interest requires\nthat sustaining time be kept available for such broad¬\ncasts.\n(3) Significant Minority Tastes and Interests\nIt has long been an established policy of broadcasters\nthemselves and of the Commission that the American\nsystem of broadcasting must serve significant minorities\namong our population, and the less dominant needs and\ntastes which most listeners have from time to time. Dr.\nFrank Stanton, in his testimony before the House Com¬\nmittee on Interstate and Foreign Commerce in 1942,\npreviously cited, set forth this function of the sustaining\nprogram as follows:\n“There is another feature of sustaining service which\ndifferentiates it from commercial programs. While the\nCBS sustaining service recognizes the broad popular\ntastes, it also gives attention to smaller groups. It is\n8 Affidavit of Niles Trammel, in National Broadcasting Co. v. United\nStates in the Supreme Court of the U. S., October Term, 1941, No. 1025,\nTranscript of Record, p. 228.\n7 In the Matter of United Broadcasting Co. {WHKC), decided June 26,\n1945.\n8 For example, one station has recently stated its refusal to exploit the\nproblems of returning veterans on commercial programs, preferring pro¬\ngrams devoted to veteran problems on a sustaining basis. Variety, for\nMarch 14, 1945, reports:\n“WMCA FEELS VETS WOULD RESENT COM’L\nEXPLOITATION OF REHABILITATION SHOW.\n“Plans for the production of a new program helping returning GIs re¬\nhabilitate themselves, and to aid their families in the readjustment period,\nare being planned by WMCA, N. Y. Move further reflects the industry¬\nwide consciousness of the vital issue. * * *\n“Show will not be for sale, station feeling vets would resent having solu¬\ntion of their problems made the subject of commercial exploitation. As re¬\nsult it’s going on as a public service'show.” ,:\nknown that the New York Philharmonic Symphony\nOrchestra, the Columbia Work Shop, Invitation to\nLearning, Columbia Broadcasting Symphony, and\nmany other ambitious classical programs never reach\nthe largest audience, but Columbia, nonetheless, puts\nthem on year after year for minorities which are grow¬\ning steadily.”\nMany sustaining programs, originally designed for\ncomparatively small audiences, have proved so popular\nthat they have subsequently acquired commercial spon¬\nsorship. “Of Men and Books,” for example, was a\nsustaining feature of a literary nature for more than\nseven years, from May 26, 1938 to September 8, 1945,\nbefore a sponsor was obtained. When such a program\nbecomes sponsored, the way is open for devoting sustain¬\ning time to still other types of programs having less than\nmaximum audience appeal.\nBut even if they may not be able to compete, initially\nor ever, with Fibber McGee and Molly in size of audience,\n“sponsor identification index,” and “product use index,”\nsuch programs are essential to a well-balanced program\nstructure. It is no doubt partly due to recognition of\nthis fact that time has always been reserved from spon¬\nsorship for the carrying of such programs on a sustaining\nbasis.\n(4) Service to Non-profit Organizations\nA well-balanced program structure has always been\ndeemed to include programs devoted to the needs and\npurposes of non-profit organizations.\nSection 307(c) of the Communications Act of 1934\nspecifically directed the Commission to “study the pro¬\nposal that Congress by statute allocate fixed percentages\nof radio broadcasting facilities to particular types or\nkinds of non-profit activities,” and to report to Congress\nits recommendations. The Commission undertook pro¬\nlonged hearings on the question, at which witnesses for\nnon-profit organizations, networks and stations were\nheard at length. Such organizations as the National\nCommittee on Education by Radio, individual educa¬\ntional institutions, representatives of many religious\norganizations, the American Federation of Labor, the\nWomen’s National Radio Committee, the Farmers’ Union,\nand many others testified concerning the importance of\nbroadcasting to their organizations and the services which\ntheir organizations could render to the public through\nbroadcasting. Networks and stations, in turn, testified\nwithout hesitation to their willingness to assist and to\nsupply time for the non-profit organizations.9\nThe Commission, in its report to Congress pursuant\nto Section 307(c) of the Communications Act, recom¬\nmended that specific percentages of facilities not be re¬\nserved by statute for non-profit organizations, specifically\non the ground that existing commercial stations were\nready and willing to carry programs of non-profit or¬\nganizations and that non-profit organizations would bene¬\nfit thereby. Said the Commission:\n9 Merlin A. Aylesworth, then president of the National Broadcasting Com¬\npany, testified in particular: “We know if we do not render a public\nservice, the Commission will give the license to others who will render\nbetter public service.” {Hearings pursuant to Sec. 307(c), p. A23.)\nWilliam S. Paley, until recently president of the Columbia Broadcasting\nSystem, similarly testified: “We hold our license by serving the public\ninterest, convenience, and necessity. And only by adequate cooperation\nwith all public spirited groups can we be deemed to perform the conditions\nof our contract.” {Ibid., p. 11151.)\n[15]"
}