{
  "id": "d1430-17",
  "text": "“It would appear that the interests of the non-profit\norganizations may be better served by the use of the\nexisting facilities, thus giving them access to costly and\nefficient equipment and to established audiences, than\nby the establishment of new stations for their peculiar\nneeds. In order for non-profit organizations to obtain\nthe maximum service possible, cooperation in good\nfaith by the broadcasters is required. Such cooperation\nshould, therefore, be under the direction and super¬\nvision of the Commission. ... It is our firm intention\nto assist the non-profit organizations to obtain the full¬\nest opportunities for expression.” (Pp. 6, 9-10; em¬\nphasis supplied.)\nCooperation between networks, stations, and non-profit\norganizations has always been present in greater or less\ndegree, and it may be noted that many outstanding pro¬\ngrams, both network and local, have resulted from such\ncooperation. Among the programs honored at the 9th\nAnnual Exhibition of Educational Radio Programs, 1945\n(the Ohio State University Awards), for example, were\nthe following:\n“GROUP I—REGIONAL WEB, REGIONAL OR\nCLEAR-CHANNEL STATION\n“RELIGIOUS BROADCASTS: First Award, ‘Salute\nto Valor’ series, planned and produced by National\nCouncil of Catholic Men, WEAF, New York, and\nNBC. Honorable Mention: ‘Victorious Living’\nseries, planned and produced by International Coun¬\ncil of Religious Education, widely used over regional\nand clear-channel stations.\n“CULTURAL PROGRAMS: Honorable Mention:\n‘Words at War’ series, planned by Council on Books\nin Wartime, WEAF, New York, and NBC.\n“PUBLIC DISCUSSION PROGRAMS: First Award,\n‘University of Chicago Round Table’ series, planned\nand produced by U. of Chicago, WMAQ, Chicago,\nand NBC.\n“PERSONAL AND FAMILY LIFE PROGRAMS:\nHonorable Mention: ‘The Baxters’ series, planned\nby National Congress of Parents-Teachers, WMAQ,\nChicago, and NBC. Special Mention: ‘Alcoholics\nAnonymous’ series, WWJ, Detroit.\n“PROGRAMS FURTHERING WAR, PEACE: First\nAward: ‘The March of Minnesota’ series, planned\nand produced by Minnesota Resources Committee,\nWCCO, Minneapolis, and special state network.\nFirst Award, ‘Russian War Relief Presents’ series,\nplanned and produced by Russian War Relief, Inc.;\nproduced by members of Radio Directors Guild of\nNew York City; released to many stations.\n“CHILDREN’S PROGRAM, OUT-OF-SCHOOL:\nFirst Award, ‘Books Bring Adventure’ series, planned\nand produced by Association of Junior Leagues of\nAmerica.\n“IN SCHOOL PROGRAMS, PRIMARY CHIL¬\nDREN: First Award, ‘Your Story Parade’ series,\nplanned and produced by Texas State Department\nof Education, WBAP, Fort Worth, and Texas Qual¬\nity web.\nf 16]\n‘GROUP II—LOCAL STATION OR ORGANIZATION\n“CULTURAL PROGRAMS: Special Mention: ‘New\nWorld A-Coming’ series, planned and produced by-\nstation WMCA in cooperation with Citywide Citi¬\nzens Committee on Harlem; WMCA, New York.\n“PUBLIC DISCUSSION PROGRAMS: First Award,\n‘Free Speech Forum’ series, planned and produced\nby WMCA and New York Newspaper Guild;\nWMCA, New York.\n“NEW INTERPRETATION: First Award, ‘History\nin the Making’ series, planned and produced by Uni¬\nversity of Colorado and Rocky Mountain Radio\nCouncil; KVOD, Denver.\n“CHILDREN’S PROGRAMS, OUT-OF-SCHOOL:\nFirst Award, ‘Story Time’ series, planned and pro¬\nduced by Colorado State College of Education and\nRocky Mountain Radio Council; KLZ, Denver.\n“IN SCHOOL PROGRAMS, ELEMENTARY CHIL¬\nDREN: Honorable Mention: ‘News Today—His¬\ntory Tomorrow’ series, planned and produced by\nRochester Public Schools, WHAM, Rochester, N. Y.\n“IN SCHOOL PROGRAMS, JUNIOR - SENIOR\nHIGHS: First Award, ‘Our America’ series, planned\nand produced by Radio Council of Chicago Public\nSchools; WBEZ, Chicago Public Schools.”\nThe Peabody and Variety awards similarly feature such\nprograms as the WTIC temperance series prepared in\ncooperation with Alcoholics Anonymous, “Worcester and\nthe World,” broadcast by station WTAG in cooperation\nwith the United Nations Information Office; programs\nof the American Jewish Committee; “Assignment Home, ’\nproduced by CBS in cooperation with Army Service\nForces, etc.\nSuch programs as these have done much to enrich\nAmerican broadcasting. It may well be that they have\nkept in the radio audience many whose tastes and in¬\nterests would otherwise cause them to turn to other\nmedia. Radio might easily deteriorate into a means of\namusing only one cultural stratum of the American pub¬\nlic if commercially sponsored entertainment were not\nleavened by programs having a different cultural appeal.\nJust as the programs of non-profit organizations benefit\nfrom being aired along with the mass-appeal programs of\nadvertisers, so, it may be, the programs of the adver¬\ntisers reach a larger and more varied audience by reason\nof the serious sustaining programs produced in coopera¬\ntion with non-profit organizations. The furnishing of\ntime and assistance to non-profit organizations is thus\nnot merely a responbility of networks and stations, but\nalso an opportunity.\nSpecial problems are involved in connection with pro¬\ngram service designed especially for farmers—market re¬\nports, crop reports, weather reports, talks on farming, and\nother broadcasts specifically intended for rural listeners.\nThe question of programs particularly adapted to the\nneeds of rural listeners has been made an issue in the\nCommission’s forthcoming Clear Channel Hearings\n(Docket No. 6741) and surveys of rural listeners have\nbeen made for the Commission by the Division of Pro¬\ngram Surveys, Bureau of Agricultural Economics, De-"
}