{
  "id": "d1430-33",
  "text": "(7) Statistics of Network Sustaining Programs\nMore striking even than the dearth on some stations\nand during some hours of sustaining programs gen¬\nerally, is the dearth of network sustaining programs.\nThe five-fold function of sustaining programs, earlier\noutlined, has particular significance as it applies to net¬\nwork sustaining programs. These are unique in charac¬\nter. They command resources of talent, of writers, ac¬\ntors, producers, beyond the capacity of all or at least\nmost local stations to offer. They cover many issues and\nsubjects, treatment of which can best be given in the\ngreat metropolitan centers where network headquarters\nare situated. Even more important, the network sus¬\ntaining program is the primary channel through which\na nation-wide audience can be reached for treatment of\nthe subjects earlier referred to as the peculiar province\nof sustaining programs. It is the very essence of network\nservice that it should reach a nation-wide audience. Any\nfactor intervening to prevent this militates against the\nprinciple of network operations.\nThe failure of American broadcasters to provide nation¬\nwide distribution for even outstanding network sustain¬\ning programs can be illustrated by a few examples.\nThe Columbia Broadcasting System describes “Invita¬\ntion to Learning” in these terms:\n“Distinguished scholars, authors, and critics meet\ninformally on this series to discuss the outstanding\nclassics of literature. The summer and fall schedules\ninclude a series of 31 great books to bring the total\nnumber discussed on the program to 285.”\nOn Sunday, April 2, 1944, the most recent date for\nwhich data are available, 39 CBS stations carried this\nprogram, while 97 refected it.\n“Transatlantic Call: People to People” is described\nby CBS as follows:\n“On alternate Sundays the British Broadcasting\nCorporation and the Columbia Broadcasting System\nshake hands across the ocean. In this half-hour pro¬\ngram, British and American audiences are presented\nwith a picture of the national characteristics and at¬\ntitudes of the two countries. The audiences of the\ntwo nations learn the reasons for the apparent differ¬\nences between them, at the same time realizing the\nbasic similarity of their attitudes and behavior.”\nThis program was carried on Sunday, April 2, 1944,\nby 50 CBS stations and refected by 86.\n“Columbia’s Country Journal” is described by CBS\nas follows:\n“The farmer’s role in war time, his ‘food for victory’\ncampaign, and his daily problems form the weekly\ntheme of Charles (‘Chuck’) Worcester’s ‘radio farm\nmagazine.’ Originating in Washington for national\nfarm news, it frequently switches to various farm\nregions of the country highlighting local problems.\nOccasional reports from abroad and native folk music\nare regular features.”\nOn April 8, 1944, this program was carried by 53 and\nrefected by 83 CBS affiliates.\n“Words at War” is described by NBC as follows:\n“WORDS AT WAR, a weekly series of dramatiza¬\ntions of current books relating to the war, is presented\nby NBC in cooperation with the Council on Books in\nWartime. This series served as the summer replace¬\nment for ‘Fibber McGee and Molly,’ and four times\nin eight months was cited by the Writers’ War Board\nfor its programs. Among the outstanding books\ndramatized on ‘Words at War’ were: ‘Der Fuehrer,’\nby Konrad Heiden; ‘The Veteran Comes Back,’ by\nDr. William Waller; ‘Assignment U. S. A.,’ by Selden\nMenefee; ‘War Crimes and Punishment,’ by George\nCreel;” etc.\nThis program was carried on Tuesday, May 2, 1944,\nthe last date for which data are available, by 52 NBC\nstations and refected by 61. It was broadcast over the\nnetwork at 11:30 p.m., E.W.T., when listeners are com¬\nparatively few, and has since been discontinued alto¬\ngether.\n“The NBC Inter-American University of the Air” is\ndescribed by NBC as:\n“presenting an integrated schedule of programs of\nhigh educational and cultural value * * * Its 1943\nschedule included Lands of the Free, Music of the\nNew World, For This We Fight, The Editors Speak,\nand Music at War—each a series of stimulating pro¬\ngrams that proved the worth of radio as an educational\nmedium. Programs of the NBC University of the\nAir are now ‘assigned listening’ in more than 100 col¬\nleges and universities throughout the United States.\nSchool teachers taking the ‘in-service’ training courses\nof the Board of Education of the City of New York\nreceive credits and promotion based upon their study\nof Lands of the Free and Music of the New World.”\nThe only two programs of the Inter-American Uni¬\nversity of the Air noted during the week beginning Sun¬\nday, April 30, 1944, were “Lands of the Free,” broad¬\ncast from 4:30 to 4:55 p.m. on Sunday, April 30, and\n“Music of the New World,” broadcast from 11:30 to\nmidnight on Thursday, May 4. “Lands of the Free?’\nwas carried by 24 NBC stations and refused by 114;\nllMusic of the New World” was carried by 66 and re¬\nfused by 6032\nThe NBC labor program was described by the network\nas follows:\n“Labor for Victory brought authoritative speakers\nto discuss labor’s role in the war effort, in programs\nproduced by the American Federation of Labor alter-\nating with the Congress of Industrial Organizations.”\nThis program was carried on Sunday, April 30, 1944\nby 35 NBC stations and refected by 104.\n“The Reviewing Stand” is an MBS program described\nby the network as follows:\n“Roundtable discussion of current problems under\nauspices of Northwestern University.”\nIt was made available by MBS on Sunday, April 23,\n1944 to its full network of 216 stations. Of these, only\n40 MBS affiliates carried it.\n“Halls of Montezuma,” a Marine Corps series from\nthe U. S. Marine Corps base at San Diego, featured the\n“One station broadcast only the second half of “Music of the New\nWorld”. For the first half it substituted a participating program of spot\nannouncements interspersed with transcribed music.\nC 32]"
}