{
  "id": "d1430-36",
  "text": "Name of CBS\nSustaining Program Description13\nMONDAY AND FRIDAY\nENCORE APPEARANCE “The program offers further oppor¬\ntunity to the new singers who have\n6:30—6:45 p.m. given outstanding performance on\nCBS’ ‘New Voices in Song.’ They are\nWEDNESDAY accompanied by the Columbia Con¬\ncert Orchestra.”\nWILDERNESS ROAD\n8:45-6:00 p.m.\nMONDAY THROUGH\nFRIDAY\n“A dramatic serial of a pioneering\nAmerican family that went through\nthe hazardous Cumberland Gap in 1783\nwith Daniel Boone as their guide. The\nstory recreates that adventure-filled\nperiod in American history when every\nfrontier presented a challenge to the\nNew World settlers.”\nINVITATION TO\nLEARNING\n11:30—12 noon\nSUNDAY\nTHE PEOPLE’S\nPLATFORM\n6:16-6:45 p.m.\nSATURDAY\n“Distinguished scholars, authors,\nand critics meet informally on this\nseries to discuss the outstanding classics\nof literature. The winter schedule in¬\ncludes a new series of 30 great books\nto bring the total number discussed on\nthe program to 254.”\n“The vital issues of today and the\npostwar world are analyzed weekly on\nthis program, one of radio’s most in¬\nteresting forums. Four eminent guests\nand Lyman Bryson, CBS Director of\nEducation, who acts as moderator\ngather informally for these sessions.”\n13 Quoted from “CBS Program Book—Winter, 1945.”\nWCAU Program Substituted\nPhonograph records sponsored by\nGroves Laxative Bromo Quinine.\nMonday—Music by Eliot Lawrence\ninterspersed with commerical spot an¬\nnouncements for Rinso (5:48:20-\n5:49:20): Bell Telephone (5:51:15-\n5:52:15): and Household Finance Com¬\npany (5:55:40-5:56:40). Tuesday\nthrough Friday—similar music inter¬\nspersed with spot announcements.\n“Children’s Hour,” local commercial\nprogram sponsored by Horn & Hardart.\n“Listen to Lawrence,” local com¬\nmercial music program sponsored by\nSun Ship Company.\nA special case of failure to carry a network sustain¬\ning program is to be noted on Sunday from 2:55 to 3:00\np.m. Beginning at 3 p.m., Station WCAU carries the\nNew York Philharmonic program sponsored by U. S.\nRubber. This program is preceded over CBS by a\n5-minute introductory talk by Olin Downes, the well-\nknown music critic, on a sustaining basis. WCAU car¬\nried the symphony for which it is paid, but rejected\nthe sustaining introduction to the symphony in favor\nof a five-minute commercial program, “Norman Jay\nPostscript,” sponsored by the Yellow Cab Company.\nFor a similar analysis of network sustaining programs\nnot carried by Station WBAL, an NBC affiliate, see\npp. 8-9.\nIt has been urged that the network sustaining pro¬\ngram is doomed by reason of the fact that a network\naffiliate can carry local programs only during network\nsustaining periods, and that station owners quite properly\nreject network sustaining programs in order to leave some\ntime available for local programs of great public in¬\nterest. Station owners, on this view, should be praised\nfor eliminating network sustaining programs from their\nschedules, since in this way they make possible local\nservice to their own communities.\nPrior to the enactment of Regulation 3.104, when\nmany stations had all or substantially all of their time\nunder option to the networks, this viewpoint had some\ncogency. Chain broadcasting Regulation 3.104, how¬\never, allows each station freedom to reject network com¬\nmercial programs for two hours out of each five. Thus\nthe individual station licensee’s choice is not between\nbroadcasting local live programs during network sustain¬\ning hours and not broadcasting them at all. On the\ncontrary, a licensee is free to present during each seg¬\nment of the broadcast day a well-balanced schedule of\nnetwork and local, commercial and sustaining programs\nalike (except to the extent, that the network fails to\ndeliver a reasonable proportion of network sustaining\nprograms). The choice is not between network sustain¬\ning programs and local programs; rather it is between\na balanced program structure and one which lacks such\nbalance.\nIn recent months, the Commission before renewing\nthe license of a broadcast station has compared the per¬\ncentage of commercial programs actually broadcast dur¬\ning a sample week with the percentage which the sta¬\ntion stated that it would broadcast in its original applica¬\ntion. Where a serious discrepancy was noted, and where\nthe proportion of sustaining programs appeared to be\nso low as to raise a question concerning the station’s\noperation in the public interest, the station’s comments\nwere requested. The replies received indicate several\n[35]"
}