{
  "id": "d1430-37",
  "text": "widespread misconceptions concerning the basis of Com¬\nmission policy respecting commercial and sustaining pro¬\ngrams.\nFirst, many station licensees stated that they, saw no\ndifferences between a commercial and a sustaining pro¬\ngram, and a few even stated their belief that a station\ncould operate in the public interest with no sustaining\nprograms. The need for sustaining programs as a balance-\nwheel to make possible a well-balanced program struc¬\nture, as a means of broadcasting programs inappropriate\nfor commercial sponsorship, as a service for significant\nminority tastes and interests, as a service to non-profit\norganizations, and as a vehicle for program experimenta¬\ntion has been set forth on pp. 12-36).\nSecond, a number of stations pointed out that many\nof their commercial programs were clearly in the public\ninterest. The Commission is in full accord with this\nview. The fact that some advertisers are broadcasting\nprograms which serve an important public interest, how¬\never, does not relieve a station of its responsibility in\nthe public interest. Broadcast licensees properly con¬\nsider their status to be very different from the status of\na common carrier, merely providing physical facilities\nfor the carrying of matter paid for and produced by\nothers. Broadcasters rightly insist that their function\nin the community and the nation is of a higher order.\nThe maintenance of this independent status and sigmfi-\nance, however, is inconsistent with the abnegation of\nindependent responsibility, whether to a network or to\nadvertisers. The conceded merit of many or most pro¬\ngrams broadcast during periods which a broadcaster has\nsold to others does not relieve him of the responsibility\nfor broadcasting his own programs during periods which\nhe has reserved from sponsorship for public service.\nThird, a few licensees have alleged that they are unable\nto estimate the amount of time which they will devote to\nsustaining programs hereafter because they cannot pre¬\ndict how much demand for time there will be from\ncommercial advertisers. Such licensees have obviously\nabdicated to advertisers the control over their stations.\nThe requirement of a well-balanced program structure,\nfirmly founded in the public interest provisions of the\nCommunications Act, is a responsibility of the station\nlicensee. To permit advertisers to dictate either the pro¬\nportion of time which the station shall devote to sustain¬\ning programs or any other major policy decision is\ninconsistent with the basic principles of licensee responsi¬\nbility on which American broadcasting has always rested.\nIn their replies, many licensees have pointed out that\na comparison of promise and performance with respect to\nsustaining programs and other categories is difficult or\nimpossible without uniform definitions of what constitutes\na commercial program, a sustaining program, etc. To\nmeet this difficulty, the Commission is promulgating\nherewith uniform definitions of various program cate¬\ngories. (See “Uniform Definitions and Program Logs.”)\nB. THE CARRYING OF LOCAL LIVE PROGRAMS\nAll or substantially all programs currently broadcast\nare of four kinds: (1) network programs, including\nprograms furnished to a station by telephone circuit from\nanother station; (2) recorded (including transcribed)\nprograms; (3) wire programs (chiefly wire news, syn¬\ndicated to many stations by telegraph or teletype and\nread off the wire by a local announcer); and (4) local\nlive programs, including remote broadcasts. For defini¬\ntions of these four main classes, see “Uniform Definitions\nand Program Logs.”\nNetwork programs. The merit of network programs\nis universally recognized; indeed, the Commission’s Chain\nBroadcasting Regulations 3.101 and 3.102 were designed\nin considerable part to insure a freer flow of network\nprograms to the listener. In January 1945, approxi¬\nmately 47.9% of all the time of standard broadcast\nstations was devoted to network programs.\nTranscriptions. The transcribed or recorded program\nhas not had similar recognition. As early as 1922, the\nDepartment of Commerce by regulation prohibited the\nplaying of phonograph records by stations having the\nbetter (Class B) channel assignments except in emergen¬\ncies or to fill in between program periods; and later in the\nyear it amended the regulation to prohibit even such use\nof records by Class B stations. Through the years the\nphonograph record, and to a lesser extent the tran¬\nscription, have been considered inferior program sources.\nNo good reason appears, however, for not recognizing\ntoday the significant role which the transcription and the\nrecord, like the network, can play in radio programming.\nFive particular advantages may be cited:\n(a) Transcriptions are a means of disposing of radio’s\nmost ironic anomaly—the dissipation during a single\nbroadcast, in most cases for all time, of all the skill and\nlabor of writer, director, producer, and cast. Trans¬\ncriptions make possible the compilation of a permanent\narchive of the best in radio, comparable in other types of\nprograms to the recorded symphony or chamber music.\nGood programs with timeless interest can thus be re¬\npeated not once but many times.\n(b) Transcriptions make possible the placing of pro¬\ngrams at convenient hours. For example, a network\nbroadcast may either be inconvenient in time for listeners\nin a given time zone or may conflict with a station’s\ncommitment to its locality. By transcribing the program\nat the station as it comes in on the network line, the pro¬\ngram can be made available at another and still conveni¬\nent hour.1\n(c) Transcriptions make possible the sharing of pro¬\ngrams among stations not directly connected by wire\nlines. Several New York stations, for example, are cur¬\nrently making their outstanding programs available via\ntranscription to stations throughout the country. Simil¬\narly, non-radio organizations can produce and distribute\nprograms via transcription, as in the case of the award¬\nwinning children’s transcription series of the Junior\nLeague.\n(d) Transcriptions offer to the writer, director, and\nproducer of programs the same technical advantages that\nthe moving picture industry achieves through cutting-\nroom techniques. Imperfections can be smoothed out;\nmaterial recorded at different times and places can be\nblended into a single program, etc. While the basic ad¬\nvantages of this more plastic technique may not yet be\nfully utilized, recent developments in the transcription\n1 Conversely, however, some stations appear to use the transcription\ntechnique for shifting an outstanding network public service program from\na good hour to an off hour when listeners are few and commercial programs\nnot available.\n[36]"
}