{
  "id": "d1430-45",
  "text": "the length and number of commercials on the air to\ntest our programs, invariably their Crossley ratings go\nup. * * * When making these tests, we load the pro¬\ngrams to the limit under NAB rulings with commer¬\ncials that precede, interrupt, and follow these broad¬\ncasts. And we know from the results that any arbi¬\ntrary curtailment of commercials would seriously im¬\npair the audience value of these shows.”\nThis view does not appear to be universally held; and\nevidence is available that lengthy commercials result in\nlisteners tuning out a program. Thus Variety for May\n2, 1945, reported:\nto expect a commercial plug to intervene. Conversely,\nthe listener who has heard one or more commercial an¬\nnouncements may reasonably expect a program to inter¬\nvene. Listed below is a series of commercial spot an¬\nnouncements broadcast by Station WTOL in Toledo, on\nNovember 14, 1944, during the dinner hour, without\nprogram interruption:\n6:39:30 p.m. Transcribed spot announcement.\n6:40:00 Live spot announcement.\n6:41:00 Transcribed spot announcement.\n6:42:00\n6:43:00 “ “ “\n6:44:00 “ “ “\n“TOO MANY PLUGS COOL ‘ROMANCE’\n“Colgate’s ‘Theatre of Romance’ is going way over¬\nboard on commercial spiels each week, CBS execs\npointed out to Sherman, Marquette agency chiefs on\nFriday (27)—and it must stop immediately for the\ngood of the program and the web’s rating, they added.\n“A chart-check over a two-month period shows that\nthe commercials on ‘Romance’ run anywhere from\nthree minutes and 15 seconds to four and one-half\nminutes. CBS’ ruling on the commercial’s time-limit\nfor 30-minute sponsored shows, proved over the years,\nis three minutes. Over that, according to researchers\nat the network, listeners become restless, continuity is\nuneven and the stanza suffers in rating.\n* * * * *\n“Charts show that the drama picks up rating shortly\nafter going on the air, and that every time a commer¬\ncial is spieled, the rating sags. On ‘Romance’, too, for\na full two minutes before it goes off each week during\nwhich the surveys were taken, ratings drop as much as\nthree points. And on many shows, besides the Col¬\ngate blurbs, the announcer pitches in with a govern¬\nment-agency plug as well.\n“Sherman, Marquette will have to hold the com¬\nmercials within the three-minute limit, or less, from\nhere on in, CBS has informed them.” 5\nA study of the six Washington stations for Friday,\nJuly 6, 1945, from 8 a.m. to 11 p.m. suggests that com¬\nmercials one minute or more in length are quite common.\nMore than 150 such announcements were noted on the\nsix Washington stations during that period.\n(b) Number of commercials. The extreme case of an\nexcessive number of spots noted to date is Station KMAC,\nwhich broadcast 2215 commercial announcements in 133\nhours on the air during the week beginning January 21,\n1945. This was an average of 16.7 spots per hour.\nSpot announcements in excess of 1,000 per week have\nbeen noted on a number of stations.\n(c) Piling up of commercials. The listener who has\nheard one program and wants to hear another has come\n6 Television may bring still longer commercials. Variety for March 14,\n1945, reports:\n“A new venture in video experimentation, as far as a Chicago station is\nconcerned, will be tried Tuesday (20) when a 3)4-minute commercial is\naired over WBKB, Balaban & Katz station here. Designed to fill in the\nair time between studio programs, the package is completely canned and\nis composed of slide film, synchronized to a recorded musical background\nand narration with the video part entirely cartooned.\n“Set up as a Red Heart dog food commercial, it was produced by\nDavid W. Doyle, associate radio director of the Henri Hurst & McDonald,\nInc., agency; written by Betty Babcock and narrated by Ray Sober Fol¬\nlowing tests here it may later be used on WNBT (NBC) and WABD\n(DuMont), New York.\"\nThis programless period occurred each weekday din¬\nner hour during the week of November 13, 1945,\nexcept on Thursday, when Station WTOL interrupted its\nspots to broadcast one minute of transcribed music.\nSuch series are not unique. The “hitch-hiker” and\n“cowcatcher” on network programs, now rarer but not\nyet exterminated, have at times meant that a listener de¬\nsiring to hear two consecutive network programs must\nsurvive five intervening commercial plugs—the closing\nplug of the first program, a “hitch-hiker” plug for another\nproduct of the same sponsor, a local plug in the station\nbreak between programs, a “cowcatcher” for a minor\nproduct of the sponsor of the second network program,\nand finally the opening commercial of the second pro¬\ngram.\nProfessor C. H. Sandage, in his survey of radio adver¬\ntising by retailers, has pointed out that excessive spot\nannouncements may even destroy advertiser confidence\nin broadcasting:\n“There is real danger that excessive use of spots\nwill drive not only listeners away from a station but\nalso a number of advertisers whom some refer to as\nthe more respectable. A Midwest jeweler who op¬\nerated a first-class, noninstallment credit store re¬\nported that he had cancelled his use of radio because\nhe felt that radio management in his city had allowed\nthe air to become too crowded with spot announce¬\nments. He also believed that many announcements\nwere purchased by firms selling cheap and shoddy\nmerchandise. Another advertiser reported: ‘Radio\nannouncements are O. K. for loan sharks but not for\nme.’ Similar comments were sufficiently frequent to\nindicate that this factor had kept a number of re¬\ntailers from using the facilities of radio.” 6 * 8\n(d) Time between commercials. Listener satisfaction\nmay depend in part upon the length of the _ intervals\nbetween commercials. The National Association of\nBroadcasters may have been recognizing this feature of\nthe commercial when in 1929 it banned commercial an¬\nnouncements between 7 and 11 p.m., thus affording four\nhours of listening uninterrupted by commercial advertis¬\ning_as distinguished from announcement of the name\nof the advertiser and of his product.\nSome stations and some advertisers are becoming\naware of the value of uninterrupted listening. Thus the\nWOL program on July 9, 1945 from 7:30 to 7:58 p.m.\nmade a point of announcing that the four movements of\na symphony would be played “without interruption.”\na Sandage, Radio Advertising for Retailers, p. 186.\n[44]"
}