{
  "id": "d1430-5",
  "text": "up of 156 popular and 10 semi-classical records and\nwere accompanied by 258 commercial announcements.\nTen minutes were devoted to the lost and found pet\ncolumn. On December 27, 1938, 165 popular, 12 semi-\nclassical records, 10 minutes of the lost and found pet\ncolumn and 199 commercial announcements made\nup the day’s schedule. During these 3 days, which\nrepresented a total of 36 hours of broadcast time, only\n23 minutes were devoted to programs other than rec¬\nords and commercial announcements.4 The alleged\npolicy of the station had been to limit commercial\nannouncements to 160 announcements for each 10-hour\nday but it appears that the manager, employed on a\ncommission basis, permitted a greater number to be\nbroadcast. Even if the station’s definition of a ‘com¬\nmercial,’ which excludes time signals and introductions\nin the name of the sponsor, is accepted, the number of\ncommercial programs on the dates recorded would be\nfar in excess of those originally proposed.\n“Further examples of the divergence between promise\nand performance are found in the following record\nfacts. For a period of over a year no regular news\nwas broadcast over the station. Little effort was made\nto promote any programs other than those character¬\nized by purely commerical continuity. The musical\nportions were composed almost entirely of popular\nrecords. Each 5-minute program contains at least one\ncommercial announcement and some recorded music.\nWhile the licensee made its station available free of\ncharge to civic, charitable, fraternal, and educational\norganizations, it expended no substantial effort actively\nto assist and aid such organizations in the preparation\nand production of programs. As a result, programs\nof this character became in most instances mere an¬\nnouncements for such organizations.” (8 F.C.C. 207,\n208-209.)\nThe Commission’s decision, dated September 25, 1940,\nset forth at some length its views with respect to “the\ndisparity between the proposed service and the programs\nactually broadcast,” It stated:\n“In the Commission’s view the licensee of Station\nKIEV did not make a reasonable effort to make its\nprograms conform to its representations. The dis¬\nparity between the proposed service and the programs\nactually broadcast indicates such a disregard of the\nrepresentations made as to cast doubt on their sin¬\ncerity in the first instance, and, therefore, on the\nqualifications of the licensee. Furthermore, false state¬\nments of talent expenditures were made in successive\nrenewal applications. The Commission, in the alloca¬\ntion of frequencies to the various communities, must\nrely upon the testimony of applicants and upon the\nrepresentations made in original and renewal applica¬\ntions, to determine whether the public interest will be\nserved by a grant of such applications. Faced here by\nsuch a disregard for representations so made, particu¬\nlarly upon the question of service to the public, the\nCommission is satisfied that a denial of the renewal\n4 In originally urging that its own application be granted and that the\nrenewal application of Station KGIX be denied, Cannon System, Ltd., had\ncalled attention to the fact that the KGIX programs were 75 percent tran¬\nscribed or recorded, and had characterized this as “reprehensible and in¬\nexcusable.” It appears, however, that the Cannon System programs on the\nthree days monitored were more than 98 percent recorded.\napplication might well be justified. It should be noted\nthat the emphasis is here placed upon the question of\nthe truth of representations made to the Commission\nas a basis for the grant and renewal of a broadcast\nlicense. No adverse criticism is directed at the use\nof a proper proportion of high quality records or\nelectrical transcriptions.\n“Upon all the facts, however, it has been concluded\nnot to deny the pending application. The record shows\nthat attempts to improve programs have been made.\nAn additional member has been placed on the staff\nwith the duty of arranging programs of a civic, educa¬\ntional and charitable nature. The percentage of time\ndevoted to recorded music and to commercialization\nhas been much reduced, and the remainder of the pro¬\ngram schedule dedicated to diversified nonrecorded\nprogram material. News programs have been added\nand a 5-year contract entered into with the United\nPress. Religious programs are being prepared by the\nMinisterial Association. Local civic and fraternal or¬\nganizations are being more actively assisted in the\npreparation of programs. To a substantial extent the\npublic has come to utilize the transmitting facilities\nand the broadcast service.\n“There is, therefore, ground for urging that we may\nexpect the present trend of improvement in program\nservice to be carried forward. With some reluctance\nthe Commission concludes that this application may\nbe granted. The facts developed in this proceeding\nwill, however, be given cumulative weight in dealing\nwith any future questions involving the conduct of this\nstation.” (8 F.C.C. 207, 209-210.)\nDespite the additional representations made in connec¬\ntion with its 1940 renewal, the KIEV logs for the week\nbeginning April 23, 1944, show that more than 88 per¬\ncent of its program time was still being devoted to\nmechanically reproduced music. Less than 3.7 percent\nof its program time—or 30 minutes a day—was devoted\nto the “talent” which the applicant assured the Com¬\nmission was available in the community. This consisted\nof one singer who sang for 15 minutes 6 times a week,\none pianist for 15 minutes on Saturday, one 15-minute\nschool program, and a devotional program daily except\nSunday from 6:30 to 6:45 a. m., when audiences, of\ncourse, are small. U.P. news was broadcast. The sta¬\ntion’s programs were still being interspersed with spot\nannouncements on an average of one every 5.5 minutes.\nA total of 1042 spot announcements were broadcast dur¬\ning the week, of which 1034 were commercial and 8 were\nbroadcast as a public service. A search of the week’s\nlogs fails to disclose any “duets, quartets, excerpts from\noperas, cuttings from great poems,” or other special fea¬\ntures originally promised when the Cannon System, Ltd.,-\nwas seeking a license at the expense of Station KGIX.\nNor does it reveal an adherence to the representations\nmade in connection with its renewal granted in January\n1940.\nB. COMPETING APPLICATIONS: STATION WSNY\nIn the Cannon System case (KIEV), there was an ele¬\nment of competition between applicants, since the Cannon\nSystem proposed that the license of an existing station\nnot be renewed. In the Western Gateway case (9\n[4]"
}