{
  "id": "d1430-57",
  "text": "is awake and listening. The time devoted to sustaining\nprograms, accordingly, should be reasonably distributed\namong the various segments of the broadcast day.\nFor the reasons set forth on pages 32-36, the Commis¬\nsion, in considering overall program balance, will also\ntake note of network sustaining programs available to\nbut not carried by a station, and of the programs which\nthe station substitutes therefor.\n(2) Local live programs. The Commission has always\nplaced a marked emphasis, and in some cases perhaps\nan undue emphasis, on the carrying of local live programs\nas a standard of public interest. The development of\nnetwork, transcription, and wire news services is such\nthat no sound public interest appears to be served by\ncontinuing to stress local live programs exclusively at the\nexpense of these other categories. Nevertheless, reason¬\nable provision for local self-expression still remains an\nessential function of a station’s operation (pp. 36-39),\nand will continue to be so regarded by the Commission.\nIn particular, public interest requires that such programs\nshould not be crowded out of the best listening hours.\n(3) Programs devoted to the discussion of public is¬\nsues. The crucial need for discussion programs, at the\nlocal, national, and international levels alike is uni¬\nversally realized, as set forth on pp. 39-40. Accord¬\ningly, the carrying of such programs in reasonable suffi¬\nciency, and during good listening hours, is a factor\nto be considered in any finding of public interest.\n(4) Advertising excesses. The evidence set forth\nabove (pp. 40-47), warrants the conclusion that some\nstations during some or many portions of the broadcast\nday have engaged in advertising excesses which are in¬\ncompatible with their public responsibilities, and which\nthreaten the good name of broadcasting itself.\nAs the broadcasting industry itself has insisted, the\npublic interest clearly requires that the amount of time\ndevoted to advertising matter shall bear a reasonable\nrelationship to the amount of time devoted to programs.\nAccordingly, in its application forms the Commission will\nrequest the applicant to state how much time he proposes\nto devote to advertising matter in any one hour.\nThis by itself will not, of course, result in the elimina¬\ntion of some of the particular excesses described on\npp. 43-46. This is a matter in which self-regulation\nby the industry may properly be sought and indeed ex¬\npected. The Commission has no desire to concern itself\nwith the particular length, content, or irritating qualities\nof particular commercial plugs.\nC. PROCEDURAL PROPOSALS\nIn carrying out the above objectives, the Commission\nproposes to continue substantially unchanged its present\nbasic licensing procedures—namely, the requiring of a\nwritten application setting forth the proposed program\nservice of the station, the consideration of that applica¬\ntion on its merits, and subsequently the comparison of\npromise and performance when an application is received\nfor a renewal of the station license. The ends sought\ncan best be achieved, so far as presently appears, by ap¬\npropriate modification of the particular forms and proce¬\ndures currently in use and by a generally more careful\nconsideration of renewal applications.\nThe particular procedural changes proposed are set\nforth below. They will not be introduced immediately\nor simultaneously, but rather from time to time as cir¬\ncumstances warrant. Meanwhile, the Commission invites\ncomment from licensees and from the public.\n1. Uniform Definitions and Program Logs.\nThe Commission has always recognized certain basic\ncategories of programs—e.g., commercial and sustaining,\nnetwork, transcribed, recorded, local, live, etc. Such\nclassifications must, under Regulation 3.404, be shown\nupon the face of the program log required to be kept\nby each standard broadcast station; and the Commission,\nlike its predecessor, has always required data concerning\nsuch program classifications in its application forms.\nExamination of logs shows, however, that there is no\nuniformity or agreement concerning what constitutes a\n“commercial” program, a “sustaining” program, a “net¬\nwork” program, etc. Accordingly, the Commission will\nadopt uniform definitions of basic program terms and\nclasses, which are to be used in all presentations to the\nCommission. The proposed definitions are set forth below.\nA commercial program (C) is any program the time\nfor which is paid for by a sponsor or any program which\nis interrupted by a spot announcement (as defined below),\nat intervals of less than IS minutes. A network program\nshall be classified as “commercial” if it is commercially\nsponsored on the network, even though the particular\nstation is not paid for carrying it—unless all commercial\nannouncements have been deleted from the program by\nthe station.\n(It will be noted that any program which is interrupted\nby a commercial announcement is classified as a commer¬\ncial program, even though the purchaser of the interrupt¬\ning announcement has not also purchased the time preced¬\ning and following. The result is to classify so-called\n“participating” programs as commercial. Without such a\nrule, a 15-minute program may contain 5 or even more\nminutes of advertising and still be classified as “sustain¬\ning.” Under the proposed definition, a program may be\nclassified as “sustaining” although preceded and followed\nby spot announcements, but if a spot announcement\ninterrupts a program, the program must be classified as\n“commercial.”)\nA sustaining program (S) is any program which is\nneither paid for by a sponsor nor interrupted by a spot\nannouncement (as defined below).\nA network program (N) is any program furnished to\nthe station by a network or another station. Transcribed\ndelayed broadcasts of network programs are classified as\n“network,” not “recorded.” Programs are classified as\nnetwork whether furnished by a nationwide, regional, or\nspecial network or by another station.\nA recorded program (R) is any program which uses\nphonograph records, electrical transcriptions, or other\nmeans of mechanical reproduction in whole or in part—\nexcept where the recording is wholly incidental to the pro¬\ngram and is limited to background sounds, sound effects,\nidentifying themes, musical “bridges,” etc. A program\npart transcribed or recorded and part live is classified as\n“recorded” unless the recordings are wholly incidental, as\nabove. A transcribed delayed broadcast of a network\nprogram, however, is not classified as “recorded” but as\n“network.”\n[56]"
}