{
  "id": "d1691-0",
  "text": "n\nIn a i b\nm\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 29, NO. 2 FEBRUARY, 1964\nr\nTaverner Elected to Board\nDonald V. Taverner, general manager, WQED-TV, WQEX,\nPittsburgh, has been elected to the NAEB TV Board of Di¬\nrectors, replacing Hartford N. Gunn, who resigned. Other\nmembers of the Board are listed in the enclosed Washington\nReport.\nRegion II NAEBers to Meet\nNAEB Region II’s annual conference will be April 9, 10,\nand 11 at the Wade Hampton Hotel in Columbia, South Caro¬\nlina. Lynn Kalmbach, general manager, South Carolina ETV\nCenter, is chairman of the conference, and he has appointed\nArch Lugenbeel of his staff to handle conference matters for\nthe host operation. Conferees will be able to see outstanding\nprograms from throughout the region over closed-circuit tele¬\nvision. Any Region II member who has not received a con¬\nference announcement should write to Lugenbeel, 2712 Mill-\nwood Avenue, Columbia, to be placed on the mailing list.\nInstructional Division to Meet\nOrganizational meetings of the NAEB’s Instructional Divi¬\nsion will take place at the University of Missouri March 2-4,\nin conjunction with a national conference co-sponsored by the\nNAEB and the university. Announcements and registration\nblanks were mailed to all NAEB members last month. Any\ninterested reader who did not receive a copy may do so by\nwriting to the NAEB Urbana office.\nFM Stations May Obtain Programs\nWTHI-FM, CBS affiliate in Terre Haute, Indiana, is pro¬\nducing a series of six half-hour programs on prison life and\nprisoner rehabilitation. Each show is an open-end discussion\nof a specific topic such as juvenile delinquency, parole, and\npost-release experience. Tapes will be available to any FM\nstation interested in carrying the programs. Producer of the\nscries is Sheldon Fisher, operations director for WTHI-FM,\nwith the cooperation of the warden and associate warden at\nthe U. S. Penitentiary at Terre Haute.\nFellowships Available for 1964-66\nNDEA Fellowships for doctoral study in instructional tech¬\nnology are again available beginning in September at Michi¬\ngan State University, University of Southern California, and\nSyracuse University. The fellowships pay $2000, $2200, and\n$2400 for the first, second and third years respectively, plus\n$400 for each dependent. Completed applications must be re¬\nceived by March 16. Write to respective program directors\nfor forms and further information: Dr. Donald Ely, Director,\nAudiovisual Center, Syracuse; Dr. James Finn, Professor of\nEducation, University of Southern California; Dr. Charles F.\nSchuller, Director, Audiovisual Center, Michigan State Uni¬\nversity.\nNASA Offers Free Materials\nMaterials available for free loan to ETV stations and CCTV\nsystems from NASA include film clips, still photos, audio\nsound effects and audio highlights of all major NASA space\nprograms, in addition to more than 40 films. Catalogs of\nthese aids may be obtained from National Aeronautics and\nSpace Administration, Code AFEE-4, Washington, D. C.,\n20546.\n“Space Story,” a weekly five-minute taped report on space\nactivities, is available free to all radio stations. Send requests\nfor the series to NASA at the above address.\nPublications\n• A 40-page booklet has come out of the New York exhibit,\n“Television U.S.A.: 13 Seasons,” of The Museum of Modern\nArt Film Library. Shown in the exhibit are fifty-four pro¬\ngrams, major past works ot the television art, “to give the\ntelevision industry, its artists, and its audience a much needed\nopportunity to stand back and gain a fresh perspective on the\nmedium and its accomplishments—an evaluation devoid of\ncommercial consideration.” The booklet gives summaries and\ninformation on each program, shots from many of them, a\nmention of best-uuue commercials, and a short history of the\nmedium by Gilbert Seldes. The Museum’s address is 11 West\n53rd Street, New York 19.\n• A new source of information about university research in\njournalism and mass communication is Journalism Abstracts,\nedited by Professor Wayne A. Danielson of UNC. This first\nedition of what is to be an annual paperbound summary of the\nPh.D., M.A., and M.S. theses written at U. S. universities\ncontains abstracts of 158 theses accepted at 27 universities\nduring the past year. $2.50 from the School of Journalism,\nUniversity of North Carolina at Chapel Hill.\n• A new four-page, two-color bulletin from Ampex Corpora¬\ntion describes and illustrates the Videotape Minicruiser, a new\ncompact mobile television studio in a Studebaker station wa¬\ngon. Features of the Minicruiser are described along with its\nkey component, Ampex’s VR-660 broadcast Videotape tele¬\nvision recorder. Ampex Corporation, Mail Stop 6-1, 401 Broad¬\nway, Redwood Cuy, California.\n• TIO Is circulating a rebuttal to Stanford psychologist Al¬\nbert Bandura’s October 22, 1963, Look article, “What TV\nViolence Can Do to Your Child.”\n• With its fall, 1963, issue, N.E.T. News has ended publi¬\ncation. The staff time thus freed is to be used in “direct ef¬\nforts to build the audience for [N.E.T.] programing.”\n• Motion Picture Production Facilities of Selected Colleges\nand Universities, a survey by the University Film Foundation\n1"
}