{
  "id": "d1691-58",
  "text": "57\n9c HA possible note might be added for the advertising agencies who handle\nthe promotion of FM sets and set-ups,,,„„ A lot more public Sty along these\nlines is certainly needed if FM is to sell. Most people who were con¬\ntacted, had either never heard of it„ or didn’t know much of Its operation.*\n10o \"Several complained about the commercials. One said that they were\nwritten\"' for eight-year-old children.\"\nli. \"After.i asked Sf the person thought radio better or worse there was\nalways a pause and he would nearly always admit that he had never thought\nabout It before.*\n12 \"Their biggest complaint was COMMERCIALS. They were not complaining\nabout having to listen to Jthem; but'were more annoyed at the type or\ncommercial that was forced upon them.\"\n13, “It seemed to me that many of them felt that radio was a thing that’s\njust ‘there1, like the air we breathe, it's there for our convenience,\nand they don’t give any thought to It. There's little they feel they can\ndo to change the situation.'1\n14, *i had the feeling, and!I received the comment from many that they\nhadn’t given any thought to the subject of many of the questions.*\n15 \"By and large it is- for entertainment that the average listener turns\non his radio. This came as rather a surprise to me, mainly because }\nhave been reminded so often this semester that radio also offers great\nopportunities in the educational field Evidently the public knows\nnothing about this potentiality. They should be Informed-'1'\n16 * 1 found several women who strongly objected to murder stories on\nchildren s programs. These women believed that this particular type\nof program could be detrimental to a child s mind.*\n17, ffn the majority were those people who believe radio is Improving and\nprogressing They seemed to think that most programs are selected with\ncare and good taste,*\n18, \"Very few people offered any objection to radio programs and the way\nthey are conducted; One lady even enjoyed the commercials.*\n19, wa lady when asked if she had a principal objection, answered,\nEjection, — heavens no, we are lucky to have a democratic country\nand a radio conducted in a democratic manner.® That set me to think¬\ning and too surveying my own reactions prior to taking this radio\ncourse,n\n20, One lady said she had no objections to radio. I asked her If she\nliked the commercials and she replied ‘They're necessary, otherwise\nwe would have to (pay more taxes; so at our house we don’t look down on\ncommercials, but instead we’re thankful that we have'em,5'1 ! also liked\nthis comment£,, what: j like about radio Is the way the announcers\nand people talk to you, just as though they were In your own home,®\"\n21, ®0ne woman went to gieat length to tell me that neither she nor her\nhusband drank or smoked and therefore would not listen to programs\nwhleh glorified the habits by advertising them with high sounding\nwords. She said she regretted not being able to listen to Red Skelton\nand wayne King s programs, but refused to support their products by\nlistening.*\n22, “The surveys left me with the impression that many people ate rather\nvague concerning their desires in programs. They seem to accept the\ninevitability or being \"pushed, around,» hoping, perhaps, that radio\nwill contain enough variety to allow them to find preferred programs.\nOnly a few were emphatic about their likes and dislikes.*\n23, Mn my opinion, the average listener does not think seriously about\nradio. He accepts it without question. He has very few suggestions\nand less criticism. On the whole he Is guided Instead of being the\nguide,\"\n24, *The popul at Ion around Bloominglon favors religious programs very\nmuch. Even though Bloomington is In the southern part of indianap\nmodern and classical music take precedence over the hillbilly style.\nThis fact surprised me very much.*"
}