{
  "id": "d1691-59",
  "text": "58\n25=\n26 =\n27.\n28 =\n29.\n30 =\n31-\n32=\n33 =\n34=\n\"Musical programs seem to be the great favorite, is it because they are\nrelaxing and are not an intrusion on our thoughts? But radio cannot hold\nits own with music.\n\"One man stated, *we would have the radio going all day if we had good\nreception= *\"\n\"Those few who had a definite opinion as to their objections, were really\ngood, and having such a definite answer as the question was popped to\nthem, I think shows they have given considerable thought, to the subject\nbeforehand.11\n\"One fellow objected to commercials, condemning their ‘moronic*level as\nif 1 isteners were a bunch of_=\"\n•One man expressed himself quite well when he stated that he didn't mind\ncommercials at the beginning and end of a program, but he hated it when\nthey interrupted the middle of a program for one.\"\n»| received a big charge out of the people who thought l was calling for\na quiz program. They actually seemed surprised when I offered no\nreward.•\n-One woman was listening to a program she did not like, in the hopes\nthat two singers who came at the end of the program,- would sing a\nreligious song= *\n•Most people said they liked to have the radio on while they were doing\nother things and: I think that is why so many were interested m musical\nprograms,*\n•One man was peeved because his reception had been interrupted by a\nshort wave operator in his neighborhood He aiso objected to the\n•outlandish and confusing titles* given programs in the newspapers.\"\n\"As in the case of high school students, adults are not as discriminatory\nas they should be, I contend that teachers should start now to working\nwith studentson radio listening,*\nSUMMARY OBSERVATIONS\nA. The Telephone Survey as a Method\nThe first observation we should like to make :s that, unless a minimum\nof ten to twelve thousand completed calls are made forany given week\nin a given area, it would seem to us that the dependabi1ity of such\nsurveys for rating program popularity is dubious and that far too much\nimportance might easily be attached to their results, unless omy a\n1imited number of program periods are involved.\nin our survey last year, every telephone in Bloomington was called.\nYet. even with the 5 481 completed calls made, only two or three listeners\nwere found.for some pet iods. Percentages based on such figures would\nseem to have doubtful validity. There are 196 half-hour periods sn the\n0,00am to 10;00pm broadcast week. There are also many periods 01 the\nday when survey calls should be made every quarter-hour, to have signifi¬\ncance, although undoubtedly calls only once each week for Monday through\nFriday daytime programs are fairly adequate, and reduce the total periods\nit is necessary to call by perhaps forty periods. |f forty persqns aie\ncalled during, for example, only 150 periods during the week,(which seems\na fair compromise) for a total of 6,000 calls, ten cal.ees(or 25*) may\nhave their radios'on. Three may not know what program or station they\nare listening to, Percentage charts based on the remaining seven listeners\nfor' a qiven period when a dozen or moie stat.ons are frequently available\nfor listening as new stations go on the a:r wouid seem to have dubious\nval id:ty in determining what a nation wants in radio fare. c+i ! are\nnot compiled for non-network stations and programs, much of the true\nJ^tur/is also lost, It is partly in order to show how small a am\nwe~really have for listening preferences for many given Pen0JSrJ\" ^pite\nof the large number of total calls, that totals in actual numbersare\nfrequently indicated in the present survey in many cases. Although the\nsamples w£ have based on a total of 4 120 calls, are frankly too smal1\n+ pnnu i nr.p us of the i validity as to l.sten.ng p.eferences for any\n9ivenHpePiod^with1^' poll ibi^exceS?ion®of jisSay evening, and although\nwe recognize\nthat a telephone survey may not be the ideal type for securing"
}