{
  "id": "d1181-2",
  "text": "-3-\nC. E. Lyon, University of South Dakota, Vermillion, South Dakota.\nR. L. Davidson, Jr., University of Missouri, Columbia, Missouri.\nL L, Hilton, Univorsity Extension Division, University of Arkansas, Fayetteville,\nArkansas,\nF. Arthur Cable, University of Arizona, Tucson, Arizona.\nA,. A, Reed, Director of University Extension Division, Lincoln, Nebraska.\nBrooks Quimby, Director of Bates College Debating League, Bates College, Lewiston,\nMaine,\nC. Stanton Belfour, University of Pittsburgh, Pittsburgh, Pennsylvania.\nMilton Badger, Secretary-Treasurer, Colorado High School Debate League, University\nof Colorado, Boulder, Colorado.\nMrs. Adela Bittner, University of Indiana, Bloomington, Indiana.\nJ. C. Wardlaw. Director of Extension Division, University of Georgia, Athens,\nGeorgia.\nLouis Clifton, Extension Division, University of Kentucky, Lexington, Kentucky,\nMiss Almore Scott, Department of Public Discussion, University of Wisconsin,\nMadison, Wisconsin.\nW. C. Bl'assingame, Director of Extension Division, University of Alabama, University,\nAlabama,\n0, E. Smith, Executive Secretary, Minnesota High School Debate league, Anoka,\nMinnesota.\nJ. H, MeBurney, Manager, Michigan High School Debate League, University of Michigan,\nAnn Arbor, Michigan,\nF. C, Lowry, Director of Extension Division, University of Tennessee, Knoxville,\nTennessee.\nFred S. Sorrenson, Manager, Illinois High School Debating League, State Normal\nUniversity, Normal, Illinois,\nA, H. Yoder, Director of Extension Division, University of Ncrth Dakota, Grand Porks,\nNorth Dakota.\nBruce Mahan, University of Iowa, Iowa City, Iowa.\nD. R, Parker, President, Montana High School Debate League, University of Montana,\nMissoula, Montana.\nH. G. Ingham, Director of Extension Division, University of Kansas, Lawrence,\nKansas.\nD. K. Rilov, Manager, Ohio State League, Ohio State University, Columbus, Ohio.\nT. M. Boaird, Director, State Public Speaking Leagues, University of Oklahoma,\nNorman, Oklahoma•\nE. A. Cortex, University of New Hampshire, Durham, New Hampshire."
}