{
  "id": "d1157-1",
  "text": "N.A.E.B* News better\nMarch 15, 1939\nPage 2\n“Public Opinion,** by Professor William Albig is just off the press\n(McGraw-Hill, 34). It has a special chapter on radio. In th# little\ntime I ha'te had an opportunity to read, I have found much that should\ninterest anyone In broadcasting.\nIf your recording engineers haven*t seen the booklet on “Practical\nv/ax Recording,“ by Everette K, Barnes, they might find many practical\nhints therein. It may be purchased from Universal Microphone Co.,\nInglewood, Calif. It cost me tvo bits.\nRADIO IN THE CLASSROOM\nThe National Association of Broadcasters has published: “How to Use\nRadio in the Classroom,'* which, according to Norman Woeffel of Ohio\nState University, “is intended to be introductory and provocative rather\nthan comprehensive and conclusive.*• The materials for this handbook\nwere gathered in the course of a six weeks* radio education seminar\nheld in connection ’with the Progressive Education Association*s Eastern\nWorkshop at Sarah Lawrence College, Bronxville, New York, during the\nsummer of 1938.\nCORRECTION OF LA GUARDIANS FCC APPLICATION\nDirector M. S. Novlk of the r^nlcipal Broadcasting System, New York, is\nconsidevabl* disturbed, and rightly so, about the item carried in the\nJanuary 1st issue of the News Letter. The letter explains the situation\nthoroughly and we are glad to give the correct Information here:\n“I was extremely disturbed by a report in the January 1st \"News Letter*\nin connection with the application of Mayor LaGuardla'e* *The Mayor’s\"\npetition also asked that the Commission amend Its rules which prohibit\nhigh frequency and international broadcast stations which are in an\nexperimental status, from making any charge directly or indirectly,\nf*r the transmission of programs.®\n“Unfortunately the original press release of the FCC did not. interpret\nthe Intent of th* application filed by Mayor LaGuardia. Upon receipt\nof same I advised Chairman McNinch of the obvious error and to make\ncertain a ?. *mal modification was made on January 18, 1939.\n“It ca-talnly should have been obvious to anyone at the FCC that it\nwa& -not the intent of Mayor LaGuardi* to ask the Commission to modify\nexisting rules governing international broadcasting so that they\nmay be opened up for commercial uses.\n“I do hope that you will give this matter your consideration so that\nall who read the *News Letter* will be acquainted with the facts and\nnot in any way lose hope in the Ideals of non-commercial radio.**\nMONTANA STATE UNIVERSITY SALUTES KGVO\nParticipating in the dedication of the new studios and office building\nof KGVO, Missoula, Montana, on February 14 were the 60-tfoioe men*a\nchorus and President Simmons of Montana State University."
}