{
  "id": "d1157-3",
  "text": "N.A.E.B. News better March 15, 1939 Page 4\nAmong the series are;\nOld Tales and New from Many Lands\nThis program has been designed with special attention to the age level\ninterests of pupils In the primary grades. The stories were chosen by\nMiss Marian Latta, who will be the narrator, and Mies Nelth E. Headley,\nhead kindergarten teacher and Instructor in Child Welfare at the Uni¬\nversity of Minnesota.\nCountries and titles Around the World\nThese programs will consist of stimulating presentations which will\nenoourage the students to read for themselves about these foreign lands.\nThis series will not only give information about far-away countries,\nbut will also endeavor to develop a new understanding of the peoples\nand customs of foreign lands.\nGerman and French\nThis series will supplement high school and college class work in German\nand French. The programs will include readings, songs, and plays in the\ntwo languages. The texts of the French and German material ussd will be\navailable to schools and to adult listeners at cost upon request. These\nprograms are approved by the American Association of the Teachers of\nFrench and the Department of German of the University of Minnesota.\nCurrent Events\nThis series is designed to bring to the younger students the important\nnews of the week. The presentations will help pupils take an active\nInterest in the news of the state, the nation, and the world.\nRepresentative Authors\nThis series will consist of readings and dramatizations from great litera¬\nture selected principally from the recommended and supplementary lists\nprovided in the State Course of Study.\nGuidance for the Future Worker\nToo often, it is chance, not fitness, mental achievement, or character\nthat counts in the selection of vocations. This course is designed to help\nstudents cut down this chance element, and to obtain for themselves the\nposition or Job -which will give them the greatest outlet for their abi¬\nlities, and the maximum amount of vocational happiness. These programs\nhave been claimed esoecially for high school seniors, who are soon to be\nconfronted'with the question of vocational choice, but in many cases\nyounger stuients will be interested also.\nEpisodes in American History\nThese programs are discussions from the standpoint of America today, of\ninteresting and important episodes and developments in American history\nbetween 1810 and 1900. “ource material to supplement these Friday lectures\nwill be presented every Saturday morning at 11:15. The series is pre¬\npared and presented by Burton Paulu of the HLB staff."
}