{
  "id": "d336-30",
  "text": "UNIVERSITY RETIREMENT SYSTEM OF ILLINOIS\n305 ADMINISTRATION BUILDING\nOFFICERS OF THE BOARD\nRoyal A. Stipes, Jr., President\n17 Taylor Street\nChampaign\nEdward S. Gibala, Secretary\n305 Administration Building\nheMS^to. parser, acting comptroller\nUrbana\nMerwin Q. Lytle, Treasurer\nHarris Trust and Savings Bank\nChicago 90\nURBANA, ILLINOIS\nTelephone: 7-6611, Extension 541\nMarch 19, 1954\nProfessor Frank E. Schooley\n504 West Springfield Avenue\nChampaign, Illinois\nDear Professor Schooley:\nMr. R. A. Stipes, President of the Retirement Board indicated that\nhe recently discussed with you the problem of hiring and certifying to the\nRetirement System, persons who are over age 55 or who are physically\nhandicapped. This problem has been considered by the Retirement Board\nat various times since the System was established in 1941. In 1945,\nthe Board suggested that persons who were rated risk not acceptable or\nwho were over age 55 at time of employment not be given permanent and\ncontinuous employment in order that they would not be eligible for\nparticipation in the Retirement System.\nThis suggestion by the Retirement Board resulted in refusal by\nEmployers to offer permanent employment to those persons who were\nphysically handicapped and to those who had attained age 55. Mr. Stipes\nrecognized that continuation of this policy was not desirable so in\nMarch, 1953* he suggested the following amendments to the Retirement\nAct in order that Employers would be free to hire physically handicapped\npersons and those over age 55 without throwing the risk of excessive\nliability on the Retirement System:\n1. Provide that those persons certified to the Retirement\nSystem after age 58 would receive Retirement Benefits\nbut would not be eligible for Additional Death Benefits\nor Disability Benefits.\n2. Provide that the System should not be liable for death\nor disability which is a result of a condition which\nexisted on the date the Employee became a Participant.\n3. Provide a waiting period of one year before an Employee\nis eligible to be certified to the Retirement System.\nIt was the opinion of Mr. Stipes and many of the heads of the\ninstitutions covered by the Retirement Act that it was better to provide\nemployment for such people with Retirement? Benefits and to deny death\nand disability benefits than to continue under the past policy of\ndenying permanent employment with a resulting loss of all benefits."
}