{
  "id": "d336-69",
  "text": "Mr. Harry Skornia\nJune 15, 1954\n2\nHEADS, —NOT NECESSARILY THOSE ON THE BOARD AT THAT TIME — TO DISCUSS WHERE\nWE WERE GOING. I BELIEVE I COULD DRAW OUT SOME OF THE QUESTIONS THAT I WANTEO\nTO HAVE THIS GROUP GIVE ITS BEST ANSWERS TO. IT WAS A SMALL GROUP, — I\nTHINK I ONLY SUGGESTED SOME SIX OR EIGHT, — AND I SUGGESTED THAT THEY MEET\nFOR A WEEK. THE BOARD TOOK EXCEPTION TO MY INITIATIVE AND SAID THAT THE INI¬\nTIATIVE IN THIS REGARD SHOULD LIE WITH THE PRESIDENT AND THE THEN PRESIDENT\nSiegel did not want to do a thing about it unless he personally was involved.\nThen we got into the hassle as to whether the Kellogg Foundation should pay\nFOR BOARD MEETINGS AND HE DIDN’T FEEL HE WANTED TO CALL LESS THAN A BOARD\nMEETING TO MAKE ANY SUCH A POLICY DECISION AND SO CONSEQUENTLY WE DROPPED THE\nENTIRE MATTER. I THINK THAT HAD WE BEEN ABLE TO WORK OUT SOMETHING AT THAT\nTIME WE WOULD BE ON MUCH SOUNDER FOOTING TODAY.\nNOW IT SEEMS TO ME THAT IT IS ENCUMBENT UPON YOU AND THE OTHER PEOPLE\nTO TAKE THE BULL BY THE HORNS, CALL SUCH A MEETING, AND NOT GET SIDETRACKED\nWITH DETAILS OF DAY TO DAY OPERATIONS OF THE ASSOCIATION, BUT TO SPEND FULL\nTIME ON THIS SORT OF A POLICY DISCUSSION WHICH WILL SERVE AS A GUIDE FOR US\nOVER THE NEXT TEN YEARS. HOW MANY OF THE OUTSIDERS WE NEED TO INCLUDE I AM\nNOT PREPARED TO 8AY• YOU WOULD KNOW THIS BETTER THAN I BECAUSE YOU’RE CLOSER\nto it. However, undoubtedly we are going to have to put some of these people\nIN SO THAT WE CAN COUNT ON THEIR COOPERATION IN THE FUTURE.\nYOU MORE THAN LIKELY MADE A START IN THIS DIRECTION WITH THE MEETINGS\nYOU HAD WITH THE JCET, NCCET AND OTHERS. THIS ONE MUST BE CARRIED ON.’ MAYBE\nTHE EARLIEST YOU CAN DO ANYTHING IS AT THE FALL CONVENTION WITH THE MEETING\nwhich Wynn mentions to the President. However, I think we ought to do some¬\nthing BEFORE THAT TIME. YOUR REDRAFT OF THE OLD OBJECTIVES MENTIONED FIRST\nat the Ames Meeting is a good place to start. Maybe some of this could be\nCARRIED ON WITHOUT FACE-TO-FACE MEETINGS. I WOULD BE WILLING TO SIT DOWN HERE\nWITH THE EDIPHONE AND GIVE YOU SOME DETAILED IF RAMBLING REACTIONS TO THOSE\nTEN OR TWELVE POINTS YOU MENTION. PERHAPS SOME OTHERS COULD DO THE SAME AND\nYOU COULD COMPILE THEM AND COME UP WITH SOME SORT OF A SYNTHESIS OF DESIGN.\nIf you could get Probst, McCarthy, Hull, Ausmus, Siegel, Wynn and perhaps one\nOR TWO OTHERS TO DO THE SAME UNDOUBTEDLY YOU WOULD COME UP WITH SOME BETTER\nAPPRECIATION OF THE WHOLE PROBLEM.\nNeedless to say, you really came up with the $64 question when you\nQUESTIONED THE SUPPORT OF THE TOTAL EFFORTS AFTER THE END OF THE KELLOGG GRANT.\nThis has worried me since day one as far as the grant was concerned. We were\nUNREALISTIC ABOUT IT THEN, -- WE ARE UNREALISTIC ABOUT IT NOW. I POINTEDLY\nASKED OR. HOVDE ABOUT THIS WHOLE MATTER A LITTLE WHILE AGO AND HE SAID: ’’WELL,\nWOULD YOU RECOMMEND IT? WOULD YOU RECOMMEND TAKING A THOUSAND OR TWO THOUSAND\nDOLLARS FROM YOUR OPERATING BUDGET TO SUPPORT SUCH A NATIONAL CAUSE”? I TOLD\nHIM THAT I WOULD HAVE SERIOUS DOUBTS ABOUT IT BUT THAT MORE THAN LIKELY I\nWOULD SUGGEST SOME SUCH. HE SAID THAT ANY APPRECIABLE AMOUNT WOULD OF COURSE\nBE SUBJECT TO RATHER CLOSE SCRUTINY. He INDICATED THAT THE UNIVERSITY AS SUCH\nWOULD NOT MAKE AN ADDITIONAL APPROPRIATION TO SUPPORT A NATIONAL OFFICE AND\nTHAT THE TRUSTEES HAD SPOKEN ON THIS MATTER MANY TIMES IN THE PAST. HE AGREED\nWITH ME THAT THERE WAS ABSOLUTELY NOTHING WRONG WITH BUYING A PROGRAM SERVICE\nOF THE TAPE NETWORK. HENCE I AN CONVINCED THAT THE ONLY WAY WE CAN SUPPORT\nthe National Headquarters is by this tape network assessment fee. Conceivably\nTHIS CAN BE MADE GREAT ENOUGH TO SUPPORT THE REST OF THE STRUCTURE AND IT WILL\nBE A PART OF THE NETWORK. THIS MAY SEEM LIKE GOING AROUND ROBIN HOOD’S BARN\nBUT I SEE NO OTHER WAY TO ACCOMPLISH THIS SUPPORT PROBLEM WHICH IS SO IMPORTANT\nTO OUR FUTURE EXISTENCE. FOR THIS REASON l HAVE STRENUOUSLY OBJECTED EVERY"
}