{
  "id": "d336-76",
  "text": "To The W. K. Kellogg Foundation\nPROGRESS REPORT\n(July 1953-June 1954)\nfrom the\nNational Association of Educational Broadcasters\nGeneral Statement\nThe year 1953-54 has been one of increased growth and activity for the NAEB.\nServices to members and non-members in educational radio and television have\nbeen expanded during the year, and the membership of the NAEB has increased by\napproximately 16 per cent.\nOne of the areas in which progress is most difficult to describe or report,\nof course, is the area of function, in cooperation and frequently competition,\nwith the growing list of organizations in the field. However, a part of the\nstory of its broadening and increasingly significant functions is apparent in\nthe list of new services now available from the NAEB, as indicated later in\nthis report. As the oldest organization in the educational radio and television\nfield, and the only membership-based one, the NAEB has felt it imperative to\npursue the two-fold objective of serving its members, and exerting its positive\ninfluence to create higher-level programming and broadcasting wherever radio and\ntelevision are used.\nProbably never was a period more challenging in the communications area.\nNo groups or individuals can predict the outcome of the interaction of the many\nsocial, economic, political, and educational forces and problems which will\nincreasingly determine the adequacy or inadequacy of public support, which, from\nthe NAEB’s point of view, is only too often synonomous with the ability of NAEB\nmember stations to pay membership fees, network assessments, and operating\nexpenses.\nThe NAEB, like other professional associations is in the center of forces\nin ferment during a period when educational methodology, shortage of classroom\nspace, the testing time of educational television, (sometimes to the detriment\nof educational radio) and many other crises and problems are still working them¬\nselves out.\nThe most positive fact that has been determined is that flexibility and\nopen-mindedness have to be preserved. If the NAEB does not perform the functions\nneeded by its members, others, with less experience, are only too willing to\nattempt to do so. Each year the last year’s definitions and functions have to\nbe recast. The NAEB’s budget and staff problems this year, requiring both\nrequests for additional funds and fairly serious cutbacks in various plans for\nfurther expansion of services, were recognized, after careful investigation of\nthe Board, as evidences not of mismanagement, or waste, or aimlessness, but of\nthe unyielding pressure for services to meet new problems and needs of an order"
}