{
  "id": "d336-80",
  "text": "-5-\nOne of the strengths of the NAEB is revealed in the fact that probably no\norganization has had the amount of representation both in America and abroad\nthat the NAEB has had, for the financial outlay incurred. The entire cost to\nthe NAEB, for all the above, was less than three thousand dollars for the year,\nwhich reveals the advantages of the strategic locations of NAEB members, and\nthe values of having, as NAEB representatives, various people who are members also\nof other professional organizations and societies.\nThese representational contacts (and many important examples have been\nomitted), together with the exchanges of publications, persons, ideas and pro¬\ngrams, and the constant, inspired work of the International Relations Committee,\nillustrate what we believe are very substantial prestige gains by the NAEB during\nthe last year. And as this was being written, we have taken time out to discuss,\nwith an Exchange of Persons representative of the State Department, what we hope\nwill be even more significant gains during the next year as the NAEB*s role in\nthe planning of exchange programs, and the selection of persons, is recognized\nand implemented.\nMembership\nAt the present time, the NAEB has 235 members, an increase of approximately\n16 per cent over one year ago when the membership totaled 202. This increased\nparticipation and interest in the activities of the NAEB speaks well for the\nservices that are being rendered to the membership. The current membership is\nmade up as follows 2\nActive members\n113\nRadio\n105\nTelevision\n8\nAssociate members\n97\nRadio\n95\nTelevision\n2\nAffiliate members\n25\nTwo years ago the NAEB created a special category, the Honorary Membership,\nso that persons deserving of special recognition might be honored. The first\nsuch membership was granted to Mr. Paul Walker, retiring chairman of the FCC.\nDuring the past year, the second such honor ever bestowed by the NAEB was\ngranted to present FCC Chairman Rosel H. Hyde, who, in his new duties, has been\na great friend of educational broadcasting, and bulwark, with other fine FCC\nmembers, against the loss of channels reserved for Educational Television. A\ncopy of the Honorary Membership Certificate developed for this award is attached.\n(Exhibit 5). A Recognition Certificate was also presented to Mr. Ralph Lowell.\n(Exhibit 6)"
}