{
  "id": "d336-85",
  "text": "-10-\ncalling all these groups together for a discussion of the problems of educational\nbroadcasting and organizational functions in order, as far as possible, to\neliminate duplication in the field, and to insure maximum possible coordination\nof educational effort.\nAmong the groups represented on this committee are the national commercial\nnetworks, the Joint Committee on Educational Television (JCET), the Speech\nAssociation of America (SAA), the American Council on Education (ACE), the\nAmerican Educational Theatre Association (AETA), the Educational Television and\nRadio Center (ETRC), the National Citizens Committee for Educational Television\n(NCCET), the Council of National Organizations (CNO), the Adult Education\nAssociation (AEA), the National Association for Better Radio and Television\n(NAFHRAT), the Department of Audio-Visual Instruction (DAVl), the U. S. Office\nof Education, the National Project in Agricultural Communications (NPAC), the\nAssociation for Education by Radio-Television (AERT), the University Film Pro¬\nducers Association (UFPA), and the Southern Regional Education Board (SREB).\nPROFESSIONAL ADVANCEMENT COMMITTEES This committee*s purpose is to help\nplan the improvement of professional trainings i.e. educational offerings and\nprograms in radio and television at colleges and universities. It is working on\nthe setting up of general qualifications for educational radio and television\npersonnel and also campaigning to get proper credit given to faculty participants\non programs.\nPUBLICATIONS COMMITTEES This committee has been working out procedures to\nassist the NAEB Headquarters staff in the editorial preparation of the many\nreports and studies that have been prepared during the year, but not released,\nbecause of shortage of editorial staff and budget stringencies. It is currently\nworking on a report of the Region VI Conference which should be available in the\nnear future. Since this is also not a wholly satisfactory method of solving this\nsort of problem, the duties of such a committee being at their best in a general\nadvisory and scrutiny rather than specifically editing one, it is hoped that the\nNAEB*s request for publications and editorial assistance may be given consider¬\nation.\nPUBLIC RELATIONS COMMITTEES Under the enthusiastic leadership of Chairman\nSeymour N. Siegel, this committee has obtained over 30,000 lines of publicity\nfor the NAEB during the past year. Stories on the NAEB have appeared in the New\nUnion Bulletin. the RAI (Italian! Weekly. and various BBC and CBC publications,\nnot to mention numerous domestic newspapers which have picked up the stories\nfrom the wire services. Releases were issued on such items as the Grants-in-Aid,\nthe NAEB workshops and scholarships, seminars, the Placement and Engineering\nServices, and others, such releases generally being released from the New York\narea for maximum coverage.\nRADIO NETWORK ACCEPTANCE COMMITTEE; This committee has auditioned 80\nseries of programs for possible use over the NAEB Network. This is of course\nbeyond the work of the In-School Program Committee whose activities it does not\nduplicate. This means that approximately 800 reels of tape have gone out from\nNetwork Headquarters to the members of the committee for auditioning only. Dur¬\ning the past year, the committee has approved 43 of these proposed series and\nseveral special programs for the Network."
}