{
  "id": "d336-86",
  "text": "-11-\nThe work of this committee also includes acknowledgement of audition series\nsent. In a new function exercised through the Network Manager, constructive\ncriticism of all series submitted is passed on to the submitting institution for\nthe improvement of future series. This has undoubtedly been the hardest-working,\nor at least one of the hardest-working, of all NAEB committees.\nRADIO PROGRAM PLANNING COMMITTEES At their August 21-22 meeting in\nWashington, D. C., this committee discussed several prospective series to be\nproduced by the NAEB alone or in cooperation with other agencies. Some film\nseries were also discussed. Since that time general liaison has been maintained\nbetween this committee. Headquarters, and the Acceptance Committee, in order to\nachieve more coordinated offerings on the NAEB Network.\nRESEARCH COMMITTEES This committee conducted a survey of pay scales in\neducational stations and prepared a report based on the findings. (Exhibit 17)\nCoverage maps (Exhibit 18) have been prepared and will be distributed soon. This\nmap shows the extent to which educational stations blanket a great portion of the\ncountry. An Interviewer Manual (Research Committee Report #l) was recently\ndistributed to all members. (Exhibit 19) The committee is currently engaged\nin studies of the \"manpower\" resources of educational broadcasting, the impact\nof the NAEB Network, the potential population coverage of NAEB member stations,\nand other significant projects beyond the coordination of the policy behind such\nstudies as the TV Monitoring Studies. It is hoped that the results of the first\nof these studies will enable the NAEB to provide members with a list of experts\nin the various fields of broadcasting whom they can call upon for advice and\nconsultation. This will be on a regional basis, so that the best men in each\nfield will be readily available for consultation without a great deal of travel\nand expense being involved. The need for a study of the Network*s impact over\nthe past three years, also in progress, is equally essential.\nTELEVISION OPERATIONS COMMITTEE: This committee conducted a series of six\nstudies into educational television organizations and activities on the part of\nmember institutions. These studies were combined into a report (attached as\nExhibit 20) which was distributed to all groups planning educational television\nstations. This report has been rather heavily borrowed from by other organiza¬\ntions, as a tribute to its excellence and usefulness. The committee is currently\ngathering information for another report dealing with the important problem of\npolicies governing compensation for faculty members who participate on educational\ntelevision programs.\nIN-SCHOOL SEMINAR AND WORKSHOP AND SCHOLARSHIP PLANNING COMMITTEES: These\ntwo committees have recently screened applicants, respectively, for the NAEB\nIn-School Writer*s Seminar and applicants for the NAEB Summer Session Scholarships\nand the NAEB Second Television Production Workshop. Applicants for the NAEB\nTelevision Engineers* Workshop in New York are being screened by the Engineering\nCommittee. These procedures are designed to insure the fairest possible pro¬\ncedures in the selection of recipients of all sorts of grants and awards by the\nNAEB.\nStaff: Headquarters and Network\nDuring the summer and fall of 1953 the entire Headquarters staff changed,\nand all except two persons on the Network Staff (John Holt and Rosaline Biason)\nalso changed. This period was a difficult one for the new Executive Director."
}