{
  "id": "d336-88",
  "text": "-13-\nA system of monthly account checking and posting, by the classifications\nused in W. K. Kellogg Foundation requests were instituted, together with\nquarterly fiscal reports to the Board of Directors. The phone arrangement was\nsimplified for greater efficiency and economy; rewiring of the Headquarters\noffice space eliminated the need for the numerous and sometimes dangerous exten¬\nsion cords. Improved shelving and filing and storage systems were added. All\nconditions were developed, as far as possible within the space available, to\nmake for more desirable and more efficient working conditions.\nOther Projects\nIn addition to the various new services instituted this year, as outlined\nabove (placement, engineering consultant, management consultant), the NAEB last\nyear administered a grants-in-aid program for eight radio and six television\nprogram series. The $80,000.00 grant for this project was made by the Educa¬\ntional Television and Radio Center. Since all these funds were distributed to\nschools, colleges and universities producing educational programs, it is felt\nthat these grants were of considerable financial aid to NAEB stations. They\nwere of particular advantage to the NAEB, however, because of having the program-\nproducts (several of which were national award winners) as attractions and\nfeatures for the NAEB Network.\nAs this is written, announcements for another (the third) series of grants-\nin-aid, this time in Radio only, are being prepared for mailing, with the NAEB\nhandling this $40,000.00 grant project also.\nThe NAEB was given the funds and responsibility of carrying out its seventh\nTV Monitoring Study (the fourth of the New York area alone). With these studies\nthe NAEB has won world recognition for the establishment of the only adequate\nseries of benchmarks known in the development of the TV medium in America or the\nworld, helping to establish and maintain its emphasis on valid research, partic¬\nularly into program content and impact.\nLast summer, with other funds secured specifically for this purpose, a\nTelevision Production Workshop and a Management Seminar were held at member\ninstitutions, and at year*s end the NAEB was also given the responsibility and\nfunds for administering another TV Production Workshop, a program of forty\nscholarships to help develop and train personnel for educational television,\nand an Engineering Workshop-Seminar to be held in cooperation with RCA, GE,\nDuMont, General Precision Laboratories and CBS, in the New York Area, in con¬\njunction with the NAEB Fall Convention.\nAt the time of the Fall Convention plans have also been made and invitations\nissued to selected Public School Superintendents, College and University Pres¬\nidents, and other educational leaders, to meet with the NAEB Board to help\nfinalize the NAEB*s role, and clarification thereof, in the problem of function\nand direction as outlined in the opening section of this report.\nNone of the above projects could have been administered or implemented, of\ncourse, without the Headquarters and Network mechanism provided by the Kellogg\ngrant. The inter-relationship and inter-dependence of the sum total of all its\nincreasingly crystallizing services and responsibilities, as outlined above, are\nbelieved to be increasingly obvious."
}