{
  "id": "d1080-11",
  "text": "have safeguarded it in our post office where it is merely communication by letter.\nWe have safeguarded it in this way, that we have kept control of it as a Govern¬\nment matter even in the face of large annual deficits. We have extended the post\noffice facilities to the remotest hamlet, and we have kept that line of communica¬\ntion open even at great expense. We have declared that telephone and telegraph\nshall he public utilities for the general service of the American public.\nNow, here comes something that is more universal, more potent than any of\nthese, communication by the human voice to young and old, literate and illiterate\nalike, and instantaneously over the entire nation. We must preserve this new\ninstrument because of its great possibilities in American life.\nWe have safeguarded the freedom of speech in the press where we permit abuses\nrather than place the slightest danger of censorship upon the press, and through\nthe multiplicity of newspapers here, there, and yonder, we find assurance that the\ntruth will get out. No matter how skillful the conspiracy may be to conceal it,\nsomebody will get it, and it will appear in some newspapers. It is by that diver¬\nsity that we get security. We contend that in this plan of radio broadcasting\nprivate, public, and local broadcasting stations—we have a diversity which offers\nsimilar security.\nMay I read the formal statement of the plan as proposed by the National Com¬\nmittee on Education by Radio? It will take but a moment because it is in brief,\noutline form:\n\"The National Committee on Education by Radio, concluding four years\nof study and investigation, recommends to the President, the Congress, and\nto the people of the United States a plan for an American system of radio\nbroadcasting to serve the welfare of the American people.\n\"The people of the United States shall establish a broadcasting system\nto supplement but not to supplant the present private system, and to make\navailable to American listeners programs free from advertising and presenting\nentertainment and information to promote public welfare. Such supplemental\npublic system should meet as far as practicable the following specifications.\n\"The management of such public broadcasting system, including the deter¬\nmination of program policies, shall be vested in a series of boards—national,\n-12-"
}