{
  "id": "d1080-12",
  "text": "regional, and state-with suitable powers to insure service to both national\nand local needs. These boards should be nonpartisan, the members careful y\nselected from leaders active in fields of public welfare, such as agriculture,\nlabor, music, drama, schools, religion, science, medicine, law, the arts,\nand other civic interests. It is suggested that appointments to the national\nboard and to the regional boards be made by the President of the United\nStates, confirmed by the United States Senate, and to the state boards by the\nrespective governors, in all cases the appointments to be from lists of eligible\npersons nominated by the supreme courts of the several states.\n\"The system shall be available for public business, for public forums, for\nadult education, for broadcasts to schools, for public service by nonprofit\nwelfare agencies, and for other general welfare broadcasts.\n\"Nonprofit welfare stations shall be assured the right of affiliation\nwith the federal system.\n\"The system shall ultimately be extended to provide satisfactory coverage\nof the continental United States, including remote rural sections as well as\nmore densely populated urban areas.\n\"The provision of funds and the allocation of suitable broadcasting\nchannels necessary for the effective operation of the system shall be made\nby the federal government.\n\"Recordings of programs of general significance shall be made and shall\nbe available for broadcasting from nonprofit stations.\n\"A continuous program of research shall be maintained by the public\nboards to study the desires of the people, the preparation of programs, the\ntechnique of broadcasting, and the results of the broadcasts.”\nMr. Chairman and members of the Commission, the National Committee on Educa'\ntion by Radio is presenting to you today the result of their four years of study,\nthe result of the infoiraation that has come in to them through their various\nagencies, their knowledge of American sentiment and desires. We are presenting\nthis with the request that as a commission you interest yourselves in this plan\nsufficiently to have it given the most thorough and complete investigation. You\nhave at your command the technical expert advice that is necessary for a definite\nand immediate discussion and consideration of such plan. We urge that you take\nthis proposal with sufficient seriousness to proceed with such a study.\nThe National Committee On Education by Radio does not have the resources that\nyou have, but we have some very good resources of a technical nature on the\nengineering staffs of our colleges and universities. We have investigated just\n-13-"
}