{
  "id": "d1080-5",
  "text": "of democratic discussion, study, and information. We believe that in this new\nmeans of communication we need,if possible, to preserve some of those same\nWe need also\nprinciples.,/the opportunity for a man with ideas, even though he be in the minority,\nto get those ideas before the people and in an orderly way through discussion and\npersuasion, finally to make them the ideas acceptable to the majority.\nIn this three-fold combination system, then, we do not have government\nmonopoly. Therefore, many of the arguments which have appealed to you as being\nsound objections to a government system, do not apply because this is not a\nmonopoly system; this is a proposal, in fact, to change the present monopoly\nsystem into one that is not a monopoly.\nOther advantages that would accrue to the smaller local stations would be\nthe research in radio broadcasting that we propose would be conducted by this\ngovernment system, research in listener responses, in the preparation of programs,\nin the technique of broadcasting, and by this close touch with the American people\nsuch a system would give us valuable guidance material.\nA vital thing in a government system or any other system of communication\nwhich so intimately reaches every man’s fireside is the question of control. Who\nshall control it? Who shall manage it? Who shall guide it?\nIt is obvious that America must guard the sources of general information,\nmust be assured that the sources of general information shall be correct, that\nthere shall not be suppression of vital facts, that there shall not be vicious\npropagandizing, that the control shall be honest and courageous and shall be ani¬\nmated T?ith a desire for public welfare. It is not wise for America to permit any\nsystem of communications by any chance to come under the too complete domination\nof any parties, however fine and commendable those parties may be. We feel that\nthis question of control, then, is vital.\nThe proposal that we are making is that the control shall be vested in a\nseries of boards; first, a national board to determine national policies; advising\n-6-"
}