{
  "id": "d993-1",
  "text": "- 2 -\nDEBATE ON HIGHWAY One source of opposition to the Kelley bill has been the attitude\nBILL SIGNIFICANT of Representative Barden of North Carolina and those of his\ncolleagues who wish to remove the minimum wage requirement\nfrom the bill. However, on April 27, the House passed a $50 billion highway bill in\nwhich, for the first time, the Davis-Bacon minimum wage act was made applicable to\nfederally-aided highway construction as it already is to many other kinds of federally-\naided construction. An amendment to strike out the Davis-Bacon clause failed by a\nstanding vote of 77 to 192. It seems likely that a similar fate would meet any attempt\nto strike the Davis-Bacon clause from the school construction bill.\nAlso of significance in the highway bill debate was the lack of any attempt to attach\nan anti-segregation amendment even though the Supreme Court has recently handed down\na decision affecting segregation in intra-state transportation.\nGENEVA MISSION AFFECTS Between May 25 and June 9, two of the men who would\nTIMING OF DEBATE have primary responsibility for managing HR 7535 on\nthe floor of the House must leave for the meeting of the\nInternational Labor Organization in Geneva to which they are delegates. They are the\nauthor of the bill, Representative Kelley, and the ranking Republican member of the\nEducation and Labor Committee, Representative McConnell. Although other members\nof the Education and Labor Committee could act as floor managers, the absence of\nRepresentatives Kelley and McConnell would have a definitely unfavorable effect on the\nchances of getting HR 7535 passed. Hence it would appear that if the bill is going to\nbe favorably acted on it should reach the House floor by the third week in May.\nWHC COMMITTEE REPORT URGES On April 6, Chairman Neil H. McElroy\n’EMERGENCY’ SCHOOL CONSTRUCTION of the Committee for the White House\nAID Conference on Education submitted to\nPresident Eisenhower the Committee’s\nfinal report including a summary of the discussions of the November 1955 White House\nConference on Education and the state conferences on education. The main body of the\nreport consisted of recommendations by the 34-member conference committee.\nOn the subject of federal aid to education, four members of the committee led by former\nPresident Frank Sparks of Wabash College, Indiana, filed a dissent against any kind of\nfederal assistance for education except long-term, low-interest loans to the states. Two\nmembers of the committee, NEA First Vice-President Martha A. Shull of Oregon and\nPresident Albert J. Hayes of the International Association of Machinists, filed separate\nstatements pointing out that the need for federal aid for education was not limited to the\nschool building emergency and suggesting that the committee should have defined federal\nfinancial responsibility for education in broader terms. As it was, the report of the\nWHC committee cautiously skirted the question of federal aid for current operations in¬\ncluding teachers salaries, noting that the state conferences and the White House Conference\nhad reported a great division of opinion on this subject. The Committee's report did\nrecommend federal aid to all the states for school construction purposes but went on\nto say ’’the Committee believes that Federal aid to all the States can be justified, how¬\never, only on a temporary basis to meet an emergency situation such as the present\nschool building emergency.\""
}