{
  "id": "d993-12",
  "text": "6.\nconnected with formal education. On the other hand, the Institute has established\na high level Committee on Educational Interchange Policy which is preparing\nstatements affecting the whole field of exchange of persons. It was the sense of\nthe meeting that with respect to projects or activities lying in this indeterminate\narea between the two centers of interest, the officers of the Institute and of the\nCouncil should consult and appraise each new activity on its merits with respect\nto the agency best equipped and qualified to carry on the work successfully.\nLikewise, it was understood and agreed by all present that the executive\nofficers of the Institute and of the Council should be zealous in carrying on\nfrequent consultation on matters of mutual concern in order that the staffs of\neach organization may be fully informed of the activities of the other and the\nreason leading to the undertaking of these activities. The president of the American\nCouncil on Education has always been elected a member of the Board of Trustees of\nthe Institute of International Education.\nFinally, it was agreed that this memorandum should be circulated to all of\nthose present at the meeting and that, if it met with the approval of each of\nthem, its substance would be submitted to the Board of the Institute and the\nExecutive Committee of the Council for ratification as a memorandum of agreement\nof cooperation and coordination to supersede any previous understanding, explicit\nor implicit, and to serve as a firm policy guide for the future activities of\nboth organizations.\n(j) A review of the Council's participation in the Joint Committee\non Educational Television was presented, together with recent developments, in¬\ncluding the creation of the Joint Council on Educational Television, and the\ndesirability that the American Council on Education participate in the Joint\nCouncil on Educational Television. It was pointed out that because of the Council's\npolicy not to join other organizations, approval by the Executive Committee is\nnecessary for it properly to participate in the program of the Joint Council.\nThe Committee was reminded that the Council was the fiscal agent for the funds\nrecently provided by the Ford Foundation for the support of the Joint Council and\nthat in the nature of the case more than fiduciary responsibility was indicated.\nDr. Adams therefore requested the Committee to ratify the participation of the\nAmerican Council on Education in the Joint Council on Educational Television.\nIT WAS VOTED that an exception be made to the existing policy\nand that the Committee ratifies and approves the participation of the American\nCouncil on Education in the Joint Council on Educational Television.\n(k) The members of the Committee were reminded that a mail vote had\nbeen taken on a proposal, submitted by the Committee on Equality of Opportunity\nin Higher Education, for a Study of Career-Attitude Development, to attempt to\ndiscover, among other things, factors which motivate individuals for college and\na career. A favorable mail vote had been received from the members of the\nExecutive Committee.\nIT WAS VOTED to ratify the mail ballot approving the proposal\nfor a study of career-attitude development and its submission to a foundation for\nfinancial support.\n(l) The attention of the Committee was called to a memorandum in\ntheir hands on \"the problem of governmental control of higher education\". At the"
}