{
  "id": "d993-21",
  "text": "3.\nThe Policy Committee held a two—day meeting in September to prepare\nrecommendations with regard to Commission policies and procedures, which were\nthen presented to the full membership of the Commission at its last meeting. As\na result, many existing policies of the Commission were clarified through\nmodification or amendment, other policies were reaffirmed and new policies were\nadopted.\nDuring the period of this report the project of restandardizing the high\nschool level battery of the Tests of General Educational Development was completed.\nThis project was financed by the Office of Armed Forces Information and Education\nof the Department of Defense by contract with the University of Chicago, At the\nlast meeting of the Commission, members voted to ask the President of the American\nCouncil on Education to appoint a committee to evaluate the 1955 GED Normative Study\nand to make recommendations to the President of the Council, who in turn would\nrefer the report to the Commission for consideration in reaching conclusions\nconcerning the implementation of the I955 data. This Committee has been appointed\nand held its meeting on December 14, 1955,\nThe Veterans1 Testing Service of the American Council on Education, which\noperates under the policy direction of the Commission on Accreditation, now has\nin operation 589 official testing agencies in 44 states, the District of Columbia,\nHawaii, Guam, Puerto Rico and Mexico, This is the largest number of agencies which\nthe VTS has ever had in operation. These agencies are established only upon the\nrequest of, and with the approval of, appropriate officials of state departments\nof education.\nCommittee on Evaluation of the Tyler Fact-Finding Study\nAs reported at the last meeting of the Executive Committee of the American\nCouncil 6n Education, this Committee was appointed by the President of the Council\nto evaluate a fact-finding study of the testing program of the United States Armed\nForces Institute, which has been completed by fir, Ralph W0 Tyler, The Committee\nheld its first meeting in May I955 at which time it olanned its procedures to\nevaluate the Study and voted that an analyst be employed to prepare an analysis\nof the Study, In this connection Mr, Thomas A, Kenefick, Counselor, Springfield\nMassachusetts Public Schools was appointed to prepare the analysis.\nThe second meeting of the Committee was held on October 19-20, 1955, The\nCommittee met first in full session to discuss procedures for the evaluation of\nthe Study, and then the members met in subcommittees to analyze the Study and pre¬\npare recommendations for the four areas of general interest5 namely, higher education,\nsecondary education, tests and testing techniques, industry and vocational education.\nOn the basis of the subcommittees’ recommendations the full Committee prepared final\nrecommendations concerning the Study, These recommendations have been incorporated\ninto a final report by Mr, Kenefick, This report is now in the hands of the\nCommittee members for comment and final approval. Upon approval of Committee members,\nthe report will be submitted to the Office of Armed Forces Information and Education,\nDepartment of Defense at which time a decision will be reached concerning publi¬\ncation of the report."
}