{
  "id": "d993-22",
  "text": "Committee to Evaluate the 1955 GKD Normative Study\nThis committee was appointed by the President of the American Council on\nEducation at the request of the Commission on Accreditation and held its meeting\non December 14, 1955. A list of the Committee members follows:\nGeorge P. Tuttle, Director of Admissions and Records, University\nof Illinois, Urbana, Illinois; CHAIRMAN\nPaul E. Elicker, Executive Secretary, National Association of\nSecondary School Principals, National Education Association,\nWashington, D. C.\nCharles E. Friley, President Emeritus and Professor of Education,\nIowa State College, Ames, Iowa\nAblett H. Flury, Assistant Commissioner of Education, State Depart¬\nment of Education, New Jersey (representing F0 M. Raubinger,\nCommissioner of Education)'\nGalen Jones, Director, Council for Advancement of Secondary Education\nNational Education Association, Washington, De Ce\nFrank B. Lindsay, Chief, Bureau of Secondary Education, California\nState Department of Education, Sacramento, California\nWilliam J. Sanders, Superintendent of Schools, Springfield,\nMassachus etts\nG. W. Smith, Supervisor of Instruction, State Department of Education\nMontgomery, Alabama (representing A. R. Meadows, Superintendent of\nEducation)\nEugene S, Thomas, Principal, Central High School, Kalamazoo.., Michigan\nDarrell J. Inabnit, Deputy Director, United States Armed Forces\nInstitute, Madison, Wisconsin\nColonel Miles Rc Palmer, Chief, Education Division, Office of\nArmed Forces Information and Education, Department of Defense,\nWashington, D, C.\nArthur S„ Adams, President, American Council on Education; ex officio\nThe 1955 GED Normative Study was completed under the direction of Dr0\nBenjamin S. Bloom, University Examiner, University of Chicago, through contract\nbetween the Office of Armed Forces Information and Education, Department of Defense\nand the University of Chicago. The Study was undertaken to determine whether or\nnot the normative data obtained in 1943 was appropriate for 1955 high school seniors"
}