{
  "id": "d993-68",
  "text": "AMERICAN COUNCIL ON EDUCATION\nConstituent Member Meeting\nMayflower Hotel, Washington, D. C.\nMarch 19-20, 1956\nOffice\n1785 Massachusetts Avenue, N.W,\nWashington 6, D. C.\nTelephone: HUdson 3-6620\nPaper prepared for delivery\nMonday, March 19\nat 10:00 A.M.\nEDUCATIONAL OPPORTUNITIES BEYOND HIGH SCHOOL\nDEMANDED BY THE AMERICAN PEOPLE AS A WHOLE\nHelen D. Bragdon\nGeneral Director, American Association of University Women\nOf the six sub-topics assigned to the theme, \"Higher Education and American\nSociety,\" it is evident that Topic I, \"Educational Opportunities Beyond High School\nDemanded by the American People as a Whole\" is intended to cover a broad base.\nLet us assume first that the phrase \"American people as a whole\" means just\nthat. From a job classification point of view, our topic would then include the\ndemands and recommendations from the unskilled and the skilled, the semi-\nprofessional and the professional, the unpaid and the paid workers. What will\nthey, as parents, demand in education beyond high school, whether they are high\nor low salaried, below average or gifted, whether elevator operators or nuclear\nphysicists? Whether the individual is being reconsidered by a Washington cab\ndriver or by David Riesman, there will be definite ideas forthcoming on the kind\nof education needed in the future for secretaries, electronic engineers, photo¬\ngraphers, teachers, architects, house wives, pharmacists, public administra¬\ntors, beauty operators, philosophers, social workers, TV artists, diplomats, and\nso on—all of whom will be people and American citizens first of all.\nLet us assume secondly that \"education beyond high school\" means just that.\nThe field would then include, I gather, not only the university with its gradu¬\nate schools, the four-year liberal arts college, and the state four-year degree\ninstitutions, but also the junior college or the community college, as well as\nother needed types of adult public education such as institutes, or accelerated\nrefresher courses.\nEven if we assume that individuals demanding these types of education\npossess ability to profit by them, we should nevertheless be aware of certain\ninequalities of opportunity which may be a growing hindrance in the future.\nA poor educational region or poor individual schools may prevent or damage\neducational opportunities beyond high school. Robert C. Story, in a 1951 study,\nshows that there were then whole sections of the United States with only 1C$> or\n13$ of 18 to 21-year-old non-veterans in college. Lack of funds or lack of\ninformation about available scholarship aid very often confine able boys and\ngirls to whatever education is available within commuting distance of their\nhomes. Minority groups - whether Mexicans, Orientals, 'French Canadians, Indians,\nor Negroes, may in certain regions encounter inequalities in educational oppor¬\ntunities based upon differences in ethnic background. Women are sometimes in a\nminority group classification in regard to entrance into certain curricula.\nLast of all, as Dr. John Perkins points out in the lead article of the March 17\nSaturday Evening Post, \"What Is a High School For?\", it may be the college"
}