{
  "id": "d993-70",
  "text": "3.\nand for community service. The recent Maryland study,!/ while emphasizing the\npre-transfer function of the junior college, states also, \"The junior college\nmay he regarded as an effective means our society has invented for adjusting\neducation costs and services to the financial ability, the educational potential,\nand the occupational objectives of those aiming at service on the technical and\nsemi-professional levels.\"\nAs we mention occupational objectives, we remember the predicted techno¬\nlogical changes which may render many jobs obsolescent almost over night, and\nmay produce new occupations such as those demanded by automation. Therefore,\nwill not a careful guidance and counseling program be needed and demanded to\nhelp the individual create a planned response to these sudden changes, and to guide\nin the quick adjustment of interests, knowledge and skills? I like also Dr. Malcolm\nMaclean’s emphasis in the Yearbook of the National Society for the Study of Educa¬\ntion^/ that all these changes indicate as well \"an impelling need for the educa¬\ntion of youth and adults in both the liberal and cultural heritage of the past,\nand, through general education, in how to come to grips with current and future\nproblems.\"\nThe probable development of a shorter work week brings the probable twin\ndemand a providing what someone has called \"models of competent leisure\" for the\nfuture, together with the requisite education for different patterns of leisure.\nMany of you are familiar with David Riesman's essay on leisure in \"Individualism\nRecons ideredL’3/ He points out that the combination of a shorter work week and\nwork without much mental or physical strain will leave much energy and restlessness\nfor the leisure periods. On the other hand, automation may bring new tensions\nbecause of responsibility for automated equipment. Professional people will need\nrelief from another kind of tension: constant exposure to interpersonal situations\nwhich may demand re-creation before any creation in leisure time. All this means,\ndoes it not, that needed future education for leisure will be complex rather than\nsimple, and must recognize differences in work patterns as well as differences in\nindividuals.\nAnother important question in relation to these demands for post-secondary\neducation is the expected role for women. A girl high school graduate who marries\nis likely to enjoy in the future an increasingly shorter house management week\nbecause of prepared foods and labor-saving devices. At the same time, she will\nacquire a more time-consuming list of home and family responsibilities, because\nthe home and home environment more and more include the community as an enlarged\nhome. For these and other reasons women are going to demand more general educa¬\ntion to keep pace with the thinking, awareness, concerns and activities of husbands\nand children. If at any period she adds to her responsibilities part-time or\nfull-time gainful employment, she may then demand a short term training for the\njob, a full and thorough course of preparation, or - if formerly trained - the\nopportunity for a refresher course.\nThe girl of high ability, capable of securing a bachelor’s degree, may not\nhave the cordial reception which she has at times enjoyed from admissions com¬\nmittees of coeducational institutions. Dr. Eleanor Dolan of our staff has\nasked the following questions of our membership concerning the college education\nof women: \"Will girls be able to compete freely for college admission?\nl/ The Needs of Higher Education in Maryland, 1955 - P- 62.\n2/ The Public Junior College, NSSE Yearbook LV Part I, 1956, P- 30\n3 Riesman, David - Individualism Reconsidered: Some Observations on Changes in\n~~ Leisure Attitudes."
}