{
  "id": "d993-76",
  "text": "2.\nA recent survey covering more than 300 ROTO units of the Army, Navy, and\nAir Force, indicates that within the past five (5) years (1950-1955) the ROTC\nprogram has furnished at least 13*4-, 000 commissioned regular and reserve officers\nof the Armed Services; that its current enrolment is at least 2*4-1,000. Based\non present construction costs, ROTC accounts, on a full-time basis, use at\nleast $l80 million dollars worth of space on college campuses, including office\nspace for approximately 7*000 full-time personnel, and storage space for at\nleast $68 million of military equipment, at present value. The Federal Govern¬\nment has for some years followed the policy of sharing the cost of construction\nof Reserve and National Guard facilities, but has not thus far done anything\nabout sharing the cost of facilities for training the officers of the Reserve,\nNational Guard, and a substantial portion of the regular components.\nDefense-Related Research and Development\nResearch and Development expenditures of the Department of Defense were\napproximately $30 million in 19*4-0. In 19*4-5* they were approximately $600\nmillion. For the fiscal year 1957* the budget estimates are nearly 1.5 billion\ndollars. In 1952, Department of Defense research funds to the extent of nearly\n$178 millions were expended through non-profit institutions, chiefly colleges\nand universities. Another $122 million was expended In this way by the Atomic\nEnergy Commission.\nThe Atomic Energy Commission, which, of course, did not exist in 19*4-0,\nhas an appropriation of $575 million in fiscal year 1956, and its estimates for\nfiscal 1957 are for $1,672,000,000. Of this amount, $235 million is for reactor\ndevelopment, including some research and training; nearly $66 million for\nphysical research; and $31«5 million for biology and medicine.\nThese huge figures have no particular meaning in and of themselves in re¬\nlation to the problem before this meeting. They would have to be translated\ninto terms of the number and levels of training of personnel involved. For\nexample, we do know that in 1952, thirty-two (32) colleges and universities\nsurveyed by the American Council on Education reported 1*4-,000 people on their\nstaffs employed full-time and part-time on government research, and that the\npercentage of government-contract employees in these institutions ranged from\na low of one (l) to two (2) per Cent and a high of more than fifty (50) per cent,\nthe latter obviously in an institution operating a large specialized research\ncenter strictly on government work.\nThese figures do have meaning for us, however, in illustrating the tremen¬\ndous demands for scientific personnel trained in colleges and universities, for\nwork on problems directly related to national security, for which the Federal\nGovernment clearly has primary if not almost exclusive responsibility. The\nGovernment does pay for defense research. It does not, however, except to a\nvery minor extent, assume any responsibility for the undergraduate or graduate\neducation and training of the personnel required. Some may question the logic\nof a situation in which it is assumed that (l) national defense is a Federal\nresponsibility, (2) the training of career officers for the armed services\nthrough government academies is a Federal responsibility, (3) the training of\nregular and reserve officers outside Federal academies is only to a minor extent\na Federal responsibility, and (*4-) the training of scientists, engineers, and\nothers for defense related research is no Federal responsibility at all.\nMedical and Health Services\nIn recent years, the Federal Government has taken increasing responsibility\nfor medical research, and to a lesser extent for medical and health services"
}