{
  "id": "d993-80",
  "text": "6.\nacademy; a technical assistance academy; an engineering and science academy, or\nseries of academies; and many scholarship proposals of various kinds. One may\ndoubt the necessity of establishing new national academies in view of this\ncountry’s vast resources in higher education.\nAlthough I have pointed out the impact of certain national programs on\nour colleges and universities, and some inconsistencies in Federal assumption\nof responsibility, you will be relieved to know that I offer no panacea. I\nthink it neither possible nor desirable that the national government should\nhave a well-organized, centralized, administratively streamlined \"program” for\nhigher education.\nI do believe that the President’s Commission on Higher Education can usefully\ntake a look at the extent and impact of these programs, and at the inconsistencies,\nand make recommendations for improvement of national policy. For example, through\nthe work of a committee of the American Council on Education and of the National\nScience Foundation, considerable progress has been made toward getting a con¬\nsistent government policy on the payment of overhead costs to colleges and uni¬\nversities doing governmentally-financed research. Korean veterans legislation\nrecognizes, for the first’time, that when the government asks colleges to perform\nadministrative services for government scholars, not required for -fother students,\nsome payment for these services is equitable. A realistic look at the respon¬\nsibilities in the ROTC program might result in more realistic provisions for its\ncosts. Credit assistance for college housing needs may take on a different light\nif viewed in terms of the problem and the possibilities of solution, rather than\nthe impact on the budget in a given year. I even venture to suggest that the\nexperiences of the Land-Grant College system may show that it is possible for\nthe national government to operate to strengthen research in all parts of the\ncountry, rather than toward increasing concentration of strength in a few areas.\nIn short, my thought is that the President’s Commission should approach its\ntask by first accepting the fact that we have nationally taken major responsibility\nfor certain programs which have a heavy impact on higher education; second, that\nit look for the ways in which the national government has moved and can move to\nstrengthen rather than weaken our colleges and universities; and third, recommend\nsteps which osught to be taken in the light of those findings."
}