{
  "id": "d993-87",
  "text": "- 2 -\nThe situation is even tighter -when we remember that by no means all persons\nearning doctors8 degrees go into teaching* We are in competition with business* with\nthe governmental agencies* with social agencies* Nor should we forget that many\npublic school systems* with attractive salary schedules and retirement provisions\nare competitors also for the services of many people who in by-gone days might\nvery possibly have entered college teaching*\nAt present about forty per cent of our college teachers hold doctors8 degrees*\nIt seems very likely that we will have to content ourselves with a lower degree of\nacademic achievement* Whether this is good or bad is not the question* It is just\na matter of elementary mathematics.\nProbably most of us will agree that the competition with industry is largely a\nmatter of money and we may as well admit that. We can never compete with industry\nfinancially on and equal basis* Large schools with great resources of endowment or\nannual gifts or tax support can come closer to competing than can the hundreds of\nsmall* independent colleges* but even they are not in a truly competitive position*\nOur only approach must be in providing an opportunity for men and women to work\nunder satisfying conditions* But there are sill many people who do not place a dollar\nvalue on happiness and satisfaction* We will have to pay decent salaries* But more\nimportant* we will have to give assurance of academic freedom* of reasonable teaching\nloads* of acceptable working conditions* We will have to rely upon people who enjoy\nworking with yound people* who wish to lead an intellectual life* to whom the\natmosphere of a college campus is of itself attractive. We will have to see that\nour retirement policies provide at least reasonable security for old age* that help\nis provided faculty members in the education of their children* that library and\nlaboratory facilities are adequate for continued study and research* In other\nwords we must compete with industry not on the basis of the kind of life one may\nlead in our profession*\nThat does not mean that salaries are a negligible item. Two years ago the\naverage top salary of the colleges #iich are members of the Pennsylvania\nFoundation of Independent Colleges was under $5200. It Is slightly better now*\nbut salaries in most of those colleges are still too low. Those of us who are in\nadministrative positions must see to it that every dollar which can go into the\nsalary budget will go there* but even our best efforts will never permit us to\ncompete with industry dollar-wise* We will have to rest our case upon the joy\none finds in teaching* and I think we have often understated that case."
}