{
  "id": "d993-89",
  "text": "h\n* ' All of this, manifestly, does violence to the idea that a one to nine, twelve, or\nfifteen pupil“teacher ratio - whichever figure you select - must be preserved. But who\nhas ever proved that a one to ten ratio produces a better college than a one to any other\nfigure? It is a matter of assumption, and we are going to be forced to reexamine a\nnumber of our assumptions.\nAnther source of help may be in reexamining the theories governing compulsory\nretirement. It has always seemed anomalous to me when I see a man who has been forced to\nretire, because of his age, from one college, teaching in another college as a visiting\nprofessor. We will grant that a fixed retirement age is a handy device which few of us\nwould care to relinquish in toto, but a degree of elasticity in applying the rule would\npossibly make available at least some effective teachers who still have some years of\nusefulness left in them. In a not wholly similar but not entirely dissimilar vein,\nit is at least possible that we could borrow an idea from the public schools and try\nto get back into service mothers who dropped out of teaching to be mothers, but are again\navailable.\nSome time back I spoke of the shortage of candidates holding doctorates. It seems\ninevitable to me that this means that instead of k0% of our college teachers holding\ndoctorates, we will have to be satisfied with a smaller number. It seems to me also\nthat this situation is going to demand of colleges that they pay much more attention\nto in-service training of their teachers. Department heads and deans will have to help\nsuch teachers considerably. Coupled with this will probably have to come a reconsideration\nof at least certain promotion standards. Those of‘us who now demand the doctorate for\npromotion beyond the rank of instructor may find ourselves caught in a squeeze. The\nsame is true of the demand that before a man be promoted he must publish books or\narticles. The emphasis cannot be both upon teaching and upon research. This does not\nmean that research is to be discounted or abandoned, but it does imply a kind of emphasis.\nThe requirement of publication as a pre-requisite for promotion is by no means\nuniversal, but it has more than infrequently deterred young people from entering or\ncontinuing in teaching. Many young men and wqpien who want to teach, who feel that\nteaching is in itself a worthy end, feel frustrated and blocked if they are made to\nfeel that promotion cannot be achieved through good teaching but must be earned through\npublishing research the prosecution of which, many of them feel, might subtract from\nthe effectiveness of their teaching.\nThis paper has raised more questions than it has answered, but at least it is hoped\nthat it will be agreed that before too long most of us will have to provide at least\nsome kind of answer to all of them."
}