{
  "id": "d993-9",
  "text": "3°\nThe outgrowth of the conference was a belief that the American Council on Education\nhad a function to perform in this -area, namely, to inquire into ways in which\neducation and industry might cooperate in all matters except the solicitation of\nfundso It was recommended that the Council appoint a committee to gather\ndocumentary evidence on the various forms such cooperation might take, the report\nof the Committee to be discussed at a second meeting,\n(c) Dr, Adams stated his belief that the Council’s policy of\nholding small conferences on special problems, attended by specially qualified\nindividuals, results in a clear and early identification of issues involved and\nthe discovery of relevant data of real value in the broad consideration of areas\nunder discussion.\n(d) At this point the members of the Committee took a ten-minute\nrecess to read a statement in their hands on the activities of Council committees\nsince the meeting of the Executive Committee on October 5> 1955 (see Attachment A).\nThe following additional comments on the committees were made by Dr, Adams, as\nindicated:\n(e) The annual meeting of the Council on Cooperation in Teacher\nEducation was a new departure in its activities in that representatives of\nscholarly groups attended to discuss the problems of teacher preparation with\nprofessional workers in this field. Dr. Adams and President Walter E. Hager,\nwho had been Chairman of the CCTE at the time of its annual meeting, commented on\nthe enthusiasm shown by \"professional educators\" and \"scholars\" at the opportunity\nto discuss their mutual problems. The CCTE plans to continue to consult representa¬\ntives of the \"scholarly groups\" in an attempt to discover areas of mutual interest\nand agreement.\n(f) The recommendation to the Executive Committee from the Committee\non Religion and Education (Attachment A, page 8) was discussed after which\nIT WAS VOTED to approve the recommendations of the Committee\non Religion and Education, with the provision that Items #2 and #3 should be\ninterchanged, to make the proposed conference the first order of business; and\nthat the proposal for financial support of the conference be broadened to include\nadditional groups which are interested in the relation of religion and education.\n(g) Dr, Adams commented on his attendance at the White House\nConference on Education and the subsequent announcement of the proposed White\nHouse Commission on Higher Education, He voiced his understanding that the\nWhite House Commission on Higher Education would act as a central receiving\npoint for varied and many Issues in the field of higher education and that the\nCommission would recommend desirable governmental policies relating to higher\neducation, which policies might eventually find expression in legislative\nproposals. In his statement, Dr. Adams pointed out that because Federal policies\naffect institutions of higher education in a different manner than they affect\nelementary and secondary education, it may prove to be a more desirable circum¬\nstance that the field of higher education will have separate consideration Instead\nof having been discussed at the White House Conference on Education in November\n1955. ’He also stated that in his opinion the most valuable result of the White\nHouse Conference on Education was the demonstration of the reality of the concern\nof the general public for the welfare of the schools. It is hoped that a\ncorresponding interest in higher education may be generated thru the White House\nCommission on Higher Education."
}