{
  "id": "d993-95",
  "text": "The Director of the Office of Defense Mobilization, on the\nother hand, raised considerable doubt as to the ability of the\nmanpower pool to absorb a program of this size and at the same\ntime sustain the Active Forces at authorized strengths. He\nsuggested that as a first step the Department of Defense submit\nto the National Security Council recommendations as to the size\nand composition of reserve forces needed in the light of present\nand future national security requirements, and programs for the\nestablishment, training, and mobilization of such reserve forces.\nThese recommendations were developed in the Department of\nDefense with an eye on certain fundamental objectives. As Secretary\nWilson mentioned earlier, our Reserve Plan is a part of the over-all\nprogram for the security of the nation. Therefore we in the Depart¬\nment of Defense felt that first consideration should be given to the\neffects that the proposed plan would have on the Active Forces.\nThe primary objective to be achieved with respect to the Active\nForces is to maintain them at the required level and at the highest\nstate of combat effectiveness.\nThis involves the maximum utilization of long-term volunteers\nto realize the greatest returns of productive service from the Costs\nof procuring and training the individual. It also involves the\nmaintenance of a hard core of career personnel qualified in leader¬\nship or technical skills to insure the stability of our Active Forces.\nFinally, the Active Forces require a manpower pool of sufficient\nsize to support long-term enlistments. This pool will also provide\nan untapped source of available manpower to meet initial mobilization\nrequirements.\nWith respect to the Reserve Forces, they must be maintained at\nrequired size and composition and in the necessary Btate of readiness.\nA principal problem in the reserve forces is how to get men\nto engage in reserve training. It is a delusion to have a lot of\nmen in a group labelled ’’Ready Reserve\" if they are not really feady.\nReadiness demands training.\nAlso, there must be processes of screening and selective recall\nto assure a proper division of critical skills between the military\nforces and supporting civilian activities.\nLast, there is the important objective of equity of military\nobligation which applies to both the Active and Reserve Forces. I\nwant to stress the fact that the plan we propose provides maximum\nequity.\nI would like to expand a little on the first objective. The\neffectiveness of modern military forces depends on a hard core of\nmen trained in leadership and specialized skills. It takes years\nto complete the training of many of the men handlihg new equipment .\nAnd this need is not lessening.\nThe Navy and Air Force particularly, must rely on long-term\nenlistments. The other services also need long-term enlistments,\nbut not in as great proportions, although tl^eir need in this\n2"
}