{
  "id": "d993-98",
  "text": "However, if the young man is willing to undertake a 10-year\nobligation, we are making two other programs available to him. These\nare subject to quota controls and at present we expect to let 100,000\na year volunteer into these programs to meet requirements of the\nArmy and Marine Corps.\nTo repeat, this is essentially a volunteer program for men\nbetween the ages of 17 and 19, and it is expected that men will be\naccepted in the same manner as enlistments in the Active Forces.\nYoung men entering this program will be required to undergo a\n6-months period of active training. Graduates of this training will\nhave a nine and a half year obligation in the \"Service Callable\nReserve\" in either the National Guard or the Army or Marine Corps\nReserve. This can be reduced to seven and a half years by fully\nmeeting all training participation requirements.\nQuite apart from the need for additional reserve training due\nto the short period in the Active Forces, we think it is only fair\nto give the men in this program a longer obligation than those who\nhave served on active duty. So long as he participates in such\nreserve training as may be required, the six months trainee will be\ndeferred from the draft.\nYou will note that standard rates of pay, based on the Career\nCompensation Act, prevail for active service in the five columns\non the right.\nThe rate of pay for the trainee while undergoing the six months'\ntraining will be $30 per month as was previously recommended in Public\nLaw 51. Veterans' benefits will not accrue to the man who follows\nthe 6-months training course.\nRates of pay for members of the \"Service Callable Reserve\" when\ndrilling or attending summer camp will be at standard incentive rates.\nThere have been expressions of concern that the method of dis¬\ncharging the military obligation represented by the two lefthand\ncolumns is either too tough or not tough enough.\nWe believe we have struck an equitable balance.\nFor those who think this is too tough, we point out that the\nlength of reserve service should bear some relationship to the length\nof active training or service.\nYoung men entering this program are away from home for only six\nmonths. They have a choice of service and reserve component.\nAlso, we believe this program offers an improvement over present\nstatutory provisions for direct entry into the National Guard under\nwhich young men receive no active training but undertake, in effect,\na 17 or 18 year obligation.\nTo those who think this is not tough enough, we summarize the\nfollowing provisions:\na. Unavailable to men 19 years or over.\nb. Ten-year obligation.\n5"
}