{
  "id": "d993-99",
  "text": "c. $30 per month for the 6-months1 training period.\nd. No veterans benefits.\ne. Liability for an additional 18 months of active\nservice for failure to participate in required\nreserve training.\nf. Lowest priority for transfer to the Selectively\nCallable Reserve through operation of the\nscreening process.\nA final note that applies to all columns involves qualitative\ndistribution of personnel. In other words, each Service receives\nits fair share of men of each category of aptitude.\nAs already mentioned, we have provided a performance incentive\ntechnique which is illustrated by this overlay chart. It shows that\na man having a reserve obligation can by more active and complete\nparticipation shorten the period that he is obligated to participate\nin the training program.\nLet us go back for a moment to the manpower pool.\nThere has been a good deal of misunderstanding and concern about\nthis manpower pool. It is a reservoir with a continuing fresh intake\nas men become liable and with a continuing outgo as men move into the\nServices. As we use the term, the manpower pool is limited to able-\nbodied men without previous training who are draft eligible, and\nboth physically acceptable and available for military service.\nThis chart shows that even if the size of the pool is kept\nfairly constant over a number of years, the particular individuals\nwho are in the pool move out into the Armed Forces and are replaced\nby others.\nAs illustrated by the Class of 1935, that is, men born in that\nyear, the class is drawn down over a four-year period by enlistments,\ninductions and appointments, while in each succeeding year, new classes\nenter the pool. If this chart were continued, the green area would\ndisappear completely as the men in the Class of 1935 enter the Service\nbefore passing beyond the age of military eligibility.\nEveryone in the Class eventually is called on to serve, includ¬\ning students deferred through the years of their undergraduate and\ngraduate work.\nIf the National Reserve Plan should be discontinued at any given\ntime, there obviously will be a large number in the pool who have had\nno training. But this would be the result of discontinuing any program\nthat concerns itself with the training of an increasing population.\nThe point is that we simply cannot foresee all the problems that\nwill arise 5 years from now. We cannot foresee today what kind of\ntraining will be required after 1959 in view of the weapons and\ntechniques that may be developed in the interim, and the soundness\nof the plan cannot be judged by what may happen if it is altered after\n1959* Therefore, this plan is designed only for the next four years.\nHowever, we believe that the principles adopted could be applied to\nproblems which might develop in subsequent periods. The plan must\nnecessarily be re-examined not only at the end of four years but also\n6"
}