{
  "id": "d1008-1",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nUKBANA, ILLINOIS\nBeverly Hotel\nNew York, N. Y.\nJanuary 22, 1952\nFOR IMMEDIATE RELEASE\nNEW YORK TV REVISITED\nThe quantity of drama on New York televisions stations and the number of\nprograms identified with educational ifastitutione both’.shone* a «harfc- * increase- com-\npared to a year ago, according to the preliminary results of a survey released to¬\nday by Dr. Dallas W, Smyth©, Director of Studies of the National Association of\nEducational Broadcasters.\nThese were highlights of the study of all New York TV programs for the\nweek of January 4-10, 1952, the second such annual inventory conducted by the\nEducational group*\nThe present study was directed by Professor Dallas W. Smythe, as Director\nof Studies of the National Association of Educational Broadcasters* The President\nof the National Association of Educational Broadcasters is Mr. Seymour N. Siegel,\nDirector of WNYC. The study was made possible by a grant from the Fund for Adult\nEducation established by the Ford Foundation. Release of preliminary results at\nthis time parallels release of the 1951 study. The purpose of the study is to\nprovide information concerning television programming for the benefit of the tele¬\nvision industry, government agencies, educational institutions, civic organizations,\nand the general public*\nThe 1958 study was located at The Biblical Seminary in New York. Thirty\nfive monitors were recruited from among graduate students in psychology and sociol¬\nogy at Columbia University and New York University. Eight 22-inch TV sets (loaned\nfor the study by the Zenith Radio Corporation^ New York office) were equipped with\nheadphones and a ninth set was provided for supervisory purposes* The equipment\nused by the monitors included stopwatches and two Western Union eleotric clocks.\nDuring the study week all of the program time of the seven TV stations\nserving the New fork area was observed and studied. Independent double monitoring\nfor reliability-check purposes was conducted on the eighth set.\nIn addition to the preliminary results released today, a later report will\nprovide additional information including a study of the amount, kind and context of\nviolence in TV programming, and a special analysis of (1) programs appraised favor¬\nably and unfavorably by TV critics, and (2) programs standing high and low in audi¬\nence acceptance, according to program rating services.\nSome highlights in the attached summary statements are as follows:\nTime On The Air:\nThe seven stations provided 11.3 percent more program time in the study"
}