{
  "id": "d1008-105",
  "text": "^JLAJL^y\\ {UL-Jk\nP 'd\nSTATION PARTICIPATION And Program DISTRIBUTION\nWhen the network ratx operation wasjnoved to the University\nof Illinois in January of 1951;there were 41 stations\nparticipating in the service. One copy of each program\nwas circulated among a selected number of these stations.\nBecausdbi/the limited facilities it was not possible to\noffer all programs to all stations. At fch« this time the\naverage monthly production of tapes was 17 reels, and the\naverage monthly air time was 11$ hours.*\nShortly after January 1951 an effort was made to\nincrease the network’s output. Four i \"legs”, or groups\nof stations^were established. It was intended that four\ncopies of all programs would be made and a copy circulated\non each of the four \"legs’1. This increased the average\nmonthly production of tapes to 53 reels, and the average\nmonthly air time to 167 hours. This also made it possible\nto offer all programs to all stations. Such was the network,\non June 1, 1951, the starting date of the grant from the\nW.K. Kellogg Foundation.\nThe first steps taken under the grant were the purchase\nof recording equipment and tape, and the hiring of\nadditional personnel. The numb®* equipment purchased\nwas so selected that it could serve in the duplicating\nprocess while the search for a large duplicating machine\nwas The number of isgx \"legs\", or groups\nof stations, was increased to 3. The number of stations\nparticipating increased to 52. Four months after the\nstart of the grant the average monthly tape production\nhad jumped to 427 reels, and the average monthly air\ntime to 1,032 hours. These figures represent a significant\nimprovement in the service. More programs were being\ndistributed to more stations in less time.\nWithin a few months the number of stations increased\nto 70. The annual NAEB convention was held in Biloxi,\nMississippi, in November, 1951. At this meeting the fex®\nNAEB Board of Directors took up the problem of levying a\nfee on stations using the network. It was deemdd wise\nto put to the test the willingness of stations to support\nthe network operation. A schedule of assessment fees\nwas devised and the matter was put to the membership for\na vote. (See Appendix \"C\".) The membership approved the\nplan. Thus, prior to the need for income from the stations\nto augment the annually decreasing funds from the Kellogg\ngrant, the member stations agreed to pay a substantial\nannual assessment fee. The results of this action have been\nhighly encouraging. Eight stations felt they could not\nafford to continue the service on a paying basis. This\nleft a total of 62 stations. Since then some have returned\nto the network and a few new stations have joined.. The\npresent total of paying stations is 65. Three additional\nstations have asked for the service indicating that with\nthe next assessment period, beginning July 1, 1952, there\nwill be 63 paying participants in the network.\nxsiy"
}