{
  "id": "d1008-119",
  "text": "• - RESEARCH- REPORT\nBy Dallas Smythe\nNAEB Director of Studies\nUniversity of Illinois, Urbana'\nA steady increase in the amount of Drama, led by Crime drama, and a rise in -\nthe amount of violence on television were highlights of the third in a series of\nannual content analyses of New York television programs.\nThe NAEB has just released- preliminary results of the study of all programs\nbroadcast by seven New York television stations in the week of January 4-10, 1953,\ntogether with a detailed report analyzing the data obtained in the studies con¬\nducted in the comparable weeks cf 1952 and 1951- The report on the first two\nyears’•studies was written by the-Director of Studies and contains an ihtroductipn\nby Professor Robert K. Merton of Columbia University. The 1952 and 1953 studies\nwere conducted by the NAEB with funds provided by the Fund for Adult Education,\nestablished by the-Ford Foundation. ' -\nIn addition to the preliminary results released from the 1953 study, a lhter\nreport will analyze it in detail. A special feature of this later report will be\nthe analysis of character portrayals. The purpose of this portion of the study\nwas to analyze objectively certain aspects of stereotyping in character portrayal\nin drama produced for television broadcast. Such analyses were performed for 160\nprograms, totalling 71 hours and 42 minutes of program time, of 23 percent of all\nDrama program time. Of this total, 131 programs totalling 60 hours and 2G minutes\n(or 20 per cent of all Drama time) were drama programs apparently produced for\ntelevision broadcast, while 29 programs, with 11 hours and 22 minutes were drama\nprograms composed of film apparently produced for theatrical exhibition. In what\nis termed indigenous television drama, a total of 337 characters were indepen¬\ndently analyzed by three monitors each. An additional 160 characters were anal¬\nyzed by less-than three monitors apiece. Of these totals, 56 characters analyzed\nby three monitors and 25 characters analyzed by less than three monitors appeared\nin serial dramas which were studied on more than one day. ■ ■\nNoteworthy features in the 1953 preliminary release are as follows:\nTime on the air. In 1953, the 7 New York stations broadcast 39,104 minutes\nor 651 hours, 44 minutes. This was an increase of 3.9 per cent over 1952 and\n15.5 per cent over 1951. Station signals in the 1953 week were off the air unin¬\ntentionally for:155 minutes,- presumably because of storm conditions. If this\ntime had been filled with' broadcast signals, the total 1953 program time would\nhave been 39,259 minutes, or 4*3 per Cent more than'in 1952.\nThe increase in time on the air has all taken place in the network stations\nWCBS-TV,- WNBT, WABD, and WJZ-TV. In the aggregate these'stations broadcast 11.9\nper cent more time in 1953 than in 1952, and 40.1 per cent more than in 1951.\nThe three non-network stations — W0R- TV, WPIX, and WATV each decreased its pro¬\ngram time in the'past three years. In 1953 their total time on* the air was 7*8\nper cent less-than in 1952, and 11.6 per cent-less than' in 1951.\nProgramming by Class of Program. -Drama programs in general were'higher in\n1953 than the year before for the second successive year. In 1953 they were 47.0\nper cent of the total time; in 1952, 42-4 per cent; in 1951, 33.2 per cent. Within\nthe total field of Drama there were opposite trends apparent."
}