{
  "id": "d1008-120",
  "text": "Drama programs for the general audience increased for the second year in\na row* In 1953 they were 43*1 per cent of total time; in 1952, 35.7 per cent;\nin 1951, 25.4 per cent.\nOn the other hand. Drama programs for the child audience declined for the\nsecond successive year. In 1953 they were 3.9 per cent of total time, in 1952,\n6.7 per cent; in 1951, 7.8 per cent. This classification does not include all\ndrama presumably a vailable to children. Thus, the drama programs (general as\nwell as children's) broadcast in the children-hours (5-7 PM weekdays, and sign-\non to 7 PM Saturday and Sunday) were 57.2 per cent of total time in 1953, 55.9\nper cent in 1952, and 55.7 per cent in 1951. General Drama programs in these\nhours were 50,5 per cent of total time in 1953, 34.9 per cent in 1952, and 25.3\nper cent in 1951. Children’s drama in these hours were 6.7 per cent of total\ntime in 1953, 21.0 per cent in 1952 and 30.4 per cent in 1951.\nThe largest sub-class of drama, Crime Drama, was 15.3 per cent of total\ntime on the air in 1953; in 1952 it was 14.8 per cent; in 1951, 10.0 per cent.\nThe second largest sub-class of drama. Western, totalled 7.3 per cent of\nall program time in 1953, as compared with 8.3 percent in 1952 and 7.8 per cent\nin 1951.\nLittle change has taken place in Comedy Drama which stands at 6.0 per cent\nin 1953, 4*3 per cent in 1952 and 5.3 per cent in 1951.\nThe fourth largest sub-class of Drama, Domestic Drama, has increased sub¬\nstantially. In 1953, it is 5.8 per cent, in 1952, 4.0 per cent, in 1951, 1.1\nper cent.\nDeclines have taken place in Sports, in Quiz, Stunts and Contest programs,\nand in Personalities programs. Sports programs fell from 10.1 per cent of total\ntime in 1951 to 8.4 per cent in 1952 and to 6.8 per cent in 1953. Quiz, Stunt\nand Contest programs were 5.7 per cent in 1953 as compared with 7.0 in 1952 and\n7.2 per cent in 1951. Personalities programs were 2.7 per cent in 1953, 2.4\nper cent in 1952 and 4.2 per cent In 1951.\nSlow growth is registered by Popular Music programs which aggregated 4.2\nper cent in 1953, 3.7 per cent in 1952 and 3.4 per cent in 1951.\nVariety programs as a whole were slightly more numerous in 1953 than in\n1952 (11.9 per cent as compared with 10.9 per cent) but in both 1953 and 1952\nthey were less common than in 1951 (18.4 per cent). While Variety programs for\nthe general audience fell from 13.6 per cent in 1951 to 6.2 per cent in 1952 and\nto 3.5 per cent in 1953, both Children’s Variety and Domestic Variety programs\nwere much more abundant in 1953 than in either 1952 or 1951.\nThe ’’informational” program classes which increased their relative share of\ntotal time over the past year were:\nNews - up to 6.6 per cent from 5.9 per cent. This is due to the increase\nin the ’’Special Events and Features” section of News, and largely because of the\naddition of the Dave Garroway ’’Today” program within the past year. The proportion\nof News Reports actually fell (from 5.7 to 4*3 per cent).\nCooking - up to 2.8 per cent from 2.0 per cent.\nPersonal Cafe - up to 0.8 from 0.5 per cent."
}