{
  "id": "d1008-122",
  "text": "THE NAEB TAPE NETWORK\nMm KELLOGG FOUNDATION\nm, 1952\nINTRODUCTION\nThe NAEB Tape Network came into being in January of 1950 when the\nseries/WE HUHAN BEINGS/ was offered to 19 stations. In January of 1951 the\nheadquarters of the tape network operation was moved from WNYC in New York to\nthe University of Illinois. There it was operated under the guidance of the\nDivision of Communications. In June of 1951 the network began operations under\nthe grant from the Kellogg Foundation. To indicate fully the progress made by\nthe tape network, this report summarizes its activities from the beginning in\nJanuary, 1950.\nSTATION PARTICIPATION AND PROGRAM DISTRIBUTION\nWhen the network operation was moved to the University of Illinois\nin January of 1951, there were 1*1 stations participating in the service. One\ncopy of each program was circulated among a selected number of these stations.\nBecause of the limited facilities, it was not possible to offer all programs to\nall stations. At this tine the average monthly production of tapes was 17 reels,\nand the average monthly air time was 118 hours.#\nShortly after January, 1951, an effort was made to increase the net¬\nwork^ output. Four \"legs” or groups of stations were established. It was\nintended that four copies of all programs would be made and a copy circulated\non each of the four \"legs\". This increased the average monthly production of\ntapes to 53 reels, and the average monthly air time to 16? hours. This also\nmade it possible to offer all programs to all stations. Such was the network on\nJune 1, 1951, the starting date of the grant from the W. K. Kellogg Foundation.\nThe first steps taken under the grant were the purchasing of recording\nequipment and tape, and the hiring of additional personnel. The equipment pur¬\nchased was so selected that it could serve in the duplicating process while the\nsearch for a large duplicating machine was conducted. The number of \"legs** or\ngroups of stations was increased to 8. The number of stations participating\nincreased to 52. Four months after the start of the grant the average monthly\nair time/to 1,082 hours. These figures represent a significant improvement in\nthroughout this report \"air time\" indicates the following confutation* total\nrunning time of all programs distributed multiplied by the number of stations\nusing the programs. Includes only regular series. Does not include extra\nprograms or in-school programs."
}