{
  "id": "d1008-131",
  "text": "M Al B RADIO... AUDIO ENGINEERING SEMINAR\n\\lle:rton House, Monticello, Illinois, May 27 - June 1, 195&\nThe National Association of Educational Broadcasters will hold the First Radio and\nAudio Engineering Seminar at Allerton House, Monticello, Illinois, May 27 - June 1,\n1956, This seminar is made possible from regular W. K. Kellogg Foundation funds.\nPARTICIPATION. The number of participants will be limited to 30 representatives of\nNAEB member AM or FM stations, provided the applicant is considered a full-time\nemployee or is a member of the regular staff, and expects to remain there at least\none year. Participants must be actively engaged in the technical operation of the\nstation and will be selected on the basis of their radio or related experience, but\nprimarily on the basis of need and likely benefit to their station’s technical oper¬\nation. Technical personnel from smaller NAEB stations and members of the NAEB Net¬\nwork will be given preference. It will be noted from the attached agenda that\nemphasis will be placed upon studio and tape recorder operation and maintenance rather\nthan transmitting equipment.\n1. Selection of applicants will be made by the NAEB Engineering Committee.\n2. Participants will be reimbursed for all reasonable travel expense to and from\nMonticello from their place of residence as well as for food and lodging at\nAllerton House which will cost $3.00 per day. Travel will be tax exempt; no\ntransportation tax can be paid.\nAPPLICATIONS. Applications should be submitted in seven copies and should specifi¬\ncally include the following information:\n1. Institution Represented: Name, station call letters, transmitter power, number\nof technical employees full time and part time.\n2. Applicant: Name, title if any, present responsibilities, duties, and qualifica¬\ntions, likely activities and duties for the next two years.\n3. Recommendation of Superior: Name, title, and signed letter of recommendation\nstating that applicant has a) definite responsibilities and duties of the nature\nwhich will be emphasized in the seminar. If there is more than one applicant froc\na station, a priority shall be assigned including information as to how this\npriority was established, b) The background and experience of the applicant is\nsuch that the seminar will be of definite help to him in discharging his duties,\nc) The need of the institution or station is such that attendance at the seminar\nwill be a definite help.\n4- The following statement signed and dated by the applicant: \"If accepted, I agree\nto attend for the full period of the Seminar. I understand that the NAEB’s con¬\ntribution to the expenses involved shall include transportation, which I estimate\nnot to exceed $_ plus $40.00 to cover meals and lodging at Allerton House.\nAll personal expenses beyond this will be borne by me or my institution.”\nApplications should be mailed to Mr. Cecil S. Bidlack, NAEB TV Engineer, 14 Gregory\nHall, Urbana, Illinois, and must be received not later than May 2, 1956. Successful\napplicants will be notified by May 15, 1956."
}