{
  "id": "d1008-135",
  "text": "; 29 '\nThose which decreased from 1952 to 1953 were:\nInformation (general) - down to 2.3 in 1953, from 2.9 per cent.\nInformation (children) - down to 0.8 in 1953, from 0.9 per cent.\nArts, Crafts and Hobbies - down to 0.4 in 1953, from 1.2 per cent.\nShopping and Merchandise - down to 1.4 in 1953, from .3.5 per cent.\nThe ’’orientation” program classes which increased their share of total time\nbetween 1952 and 1953 were:\nReligion - up to 1.7 in 1953 from 1.0 per cent.\nPre-school entertainment - up to 0.5 in 1953, from 0.1 per cent.\nThose which decreased were:\nPublic events - from 1.4 per cent to zero\nPublic issues - down to 1.5 in 1953, from 1.9 per cent.\nPublic institutional - down to 1.2 in 1953, from 1.6 per cent.\nPersonal relations - down to 0.5 in 1953, from 1.0 per cent.\nViolence: The number of acts and threats of violence a s defined in our\n1952 study in all television programs (except Sports, News, Weather,. Public .\nIssues and Public Events ) rose from 2*970 in the week in 1952 to 3,539 in the\nweek in 1953. This is an increase of 19 per cent. ; The number of acts and\nthreats of violence in the Children-hours rose by 10 per cent, fromd.,. 278 to\n1,412. In the remaining time segments they increased by 24 per cent, from\n1,692 to 2,127. *\nWhen the acts and threats of violence are related to the amounts of pro¬\ngram time one finds that there were 5.8 acts and threats per hour for all pro¬\ngram time in 1952 and 6.3 (preliminary) in 1953, an increase of 9 per cent. For\nthe Children-hours there were 9.6 acts and threats; per hour In 1952, and 9.2 in\n1953. For the other time segments, there were 4.4 in 1952 and 5.2 in 1953.\nAs is plainly stated in the full report on the 1952 study, these data on\nviolence bear absolutely no implications as to. either the effects or the aesthetic-\nvalues involved.\nPrograms identified with educational institutions: In 1953, a total of 14\nprograms were identified with educational institutions. This was an increase of\none over the 13 found in 1952, and of 13 over the one observed in 1951. The\ndistribution of these programs by stations was as follows:\n1953\n1952\n1951\nWCBS-TV\n3\n1\n0\nWNBT\n0\n0\n0\nWABD\n2\n2\n1\nWJZ-TV\n1\n1\n0\nW0R-TV\n1\n0\n0\nWPIX\n3\n3\n0\nWATV\n4\n6\n0\n14 13 1\nTotal"
}