{
  "id": "d1008-151",
  "text": "To: NAEB Board of Directors, Research Committee, Executive Director\n)\nlo The contract has beer, awarded to Purdue Opinion Panel, with H. Ha Rammers.\nDirector, for bid of $1O045O.\n2S The award was made m atesflis of comparative bidding, and POP was the lowest\nfine bidder*\n3o Approval of the contDact award was made by the >5xecutive Committe®, by\nunanimous vote, after Bob Coleman had forwarded all bids to the Executive\nDirector for use of the Executive Committeee At all times we conferred with\nthe Chairman of tfo» Committee*\n4o brief you, tho bids came down to POP and Dallas Snythe. I talked at some\nlength with Dal/.as. He was unwilling to submit a fin\\ bid, h© said, because\nhe was not operating a commercial research organization. He would take it\non the basis cf th® past studies, and while indicating to me the fee was not\na major consideration, in writing to Coleman he had indicated he thought\nprevious fee joo small. He was unwilling to agree to any period less than six\nmonths for supplying manuscript report for printer. In evaluating the factors,\nit was agrem (with Coleman concurring) that Dallas should be given the task,\nother thing* being equal. The Executive Committee decision !n favor of POP\nwas made on the two factors I have indicated, but largely because of the six\nmonths for preparation,\n5. Other bid? were in amounts of (1) $12,000 plus, (2) $19,075, and three\ndeclinations. One institution did not reply,\n60 This decision was mad© hy the Executive Committee, by telephone veto, and\nwith ea«h member voting without knowing how others were voting until his vote\nhad been cast. I immediately informed Coleman, who concurred, and also\nadvised Remmers and set up conference with him for Monday, December 7.\n7. Coleman is to advise the Research Committee members of »n actions and\nprocedures. I have previously sent soma information to Directors. Thit\nsupplements the previous information, which I got out under pressure ii\norder to expedite.\n8. May I urge you to kern tils award In confidence. It ia most desirable Urnt\nthis not become general information until after the monitoring is done. 1\nshall suggest to Rammers that he see Si Siegel on his first trip to New\nYork. Remmers is planning an early trip to New York.\n12-7-1953"
}