{
  "id": "d1008-152",
  "text": "Mexico’s rural radio\n417\nestablished for one villager to hear something on the radio and\nthen repeat the information to a friend. In 1926, Redfield found\nthat Tepoztecans made very little use of the stored experiences of\nother groups. In the 1940’s, Lewis found an increase in such\nusage. One road, a few movies, traveling teachers, and radio have\nbegun to broaden the cultural horizon of Tepoztlan.\nConclusion\nIn the United States, each month finds television coming to\nsome community for the first time. In Mexico, radio is still experi¬\nencing a status of novelty in at least one locale each month. Some\nMexican broadcasters, though unfortunately still few in numbers,\nrealize the tremendous opportunity their transmitters represent\nto attack two ancient ills of Mexico—isolation and its resulting\nignorance. For example, Enrique Max Gomez Blanco, manager\nof station XEBL in Culiacan in the state of Sinaloa on Mexico’s\nPacific Coast, has never forgotten his prebroadcasting days as a\nschoolteacher. XEBL’s microphones have devoted time to edu¬\ncational broadcasting and still have been quite successful com¬\nmercially. Student forums, contests in conjunction with the\npublic schools on various subjects, and graduation ceremonies are\nworked into XEBL’s broadcasting schedule. Nearby communi¬\nties, devoid of the few newspapers that are distributed in Culia¬\ncan, rely on one daily newscast to learn about the outside world.\nMicrophones in the hinterland can be instruments of the social\nreform for which Mexicans have fought in other ways.\nMexico has employed land reform and rural education for the\npast forty years to carry out a social revolution. The primary\nproblem has been to integrate the Republic, to escape from the\ncommunications dilemma of a nation divided between a minority\nliving in a modern urban world and a majority living in an\nisolated, primitive rural world. Radio is certainly one of the in¬\nstruments of integration in Mexico."
}