{
  "id": "d1008-157",
  "text": "422 THE QUARTERLY\n4. In the children hours, violent acts and threats occurred at the\nrate of 9.6 per hour for both years. The children hours contained two\nfifths of the acts and threats of violence in 1953.\n5. Live programming decreased from 1952 to 1953, especially on\nthe variety, information, religious, public institutional, and personal-\nrelations programs.\n6. Advertising continues to increase. The proportion of total time\ndevoted to it was 18 per cent in both 1952 and 1953 as compared with\n14 per cent in 1951. Advertisements which interrupted the flow of\nthe program (primary advertisements) were 22 per cent more numer¬\nous and took 27 per cent more time in 1953 than in 1952. Secondary\nadvertising (which either accompanies or is the program content) was\n10 per cent less in 1953 than in 1952, though still about two-and-one-\nhalf times its 1951 level.\nThe results of the study of “stereotyping”—a category of anal¬\nysis appearing for the first time—are more difficult to summarize\nbriefly. The purpose here was to obtain a picture of the person¬\nality characteristics of the characters portrayed in the dramatic\nprograms which were prepared specifically for TV. To do this\nthe monitors made use of a series of seven-step scales which de¬\nfined a selected list of character traits such as happy-sad, clean-\ndirty, generous-miserly, quick-slow, kind-cruel, or smart-dumb.\nIn addition, the monitors catalogued the characters relative to\nsex, age, occupation, respect for law, whether heroes or villains,\nnationality, and so on.\nThe results are interesting. For example, people in the TV-\ndrama world are predominantly white American males, in the\ncourting and child-bearing ages (i.e., at the peak of their pre¬\nsumed sexual attractiveness), who work, especially as managers\nand service people. This last is especially interesting since it\nreflects a culture which places a high value on managerial and\nservice activities and in which physical-production work rates\nlow. Housewives make up the largest single occupational category\nfor women in the TV-drama world, as in the real world. In the\nhero roles, males outnumber females two to one and are pre-"
}