{
  "id": "d1008-159",
  "text": "424 the quarterly\njustify (rationalize) our conduct in relation to that category ”2\nThe frequency with which TV characters manifest certain traits\nmay reflect that the producers of the drama (or the writers) are\nsensitized to certain group stereotypes which exist in our culture,\nand have built up their characterizations accordingly. Certainly,\nthe mass media are among the important agencies which transmit\nstereotypes. But there are no data in the present study which\nshow this, and the trait scales used for the ratings are not neces¬\nsarily those which might reveal stereotypic traits. The testing for\nstereotyping, as defined above, in TV drama might not be as\ncomplicated as Mr. Smythe seems to feel. There are already\nmany data regarding the existing stereotypic traits attributed to\nvarious groups, especially ethnic groups (Allport reviews this\nliterature); and the problem would be to monitor TV-drama\nprograms for these traits. The procedures would not be any more\n“subjective” than those used in the present study.\nThese mild strictures do not invalidate or render less inter¬\nesting the findings of the study regarding the characterology of\nthe TV world. The use of the Osgood semantic-scaling techniques\nis interesting and ingenious. The particular set of character di¬\nmensions developed for this study appear to reveal socially sig¬\nnificant aspects of the characters, but certainly they do not ex¬\nhaust the possibilities.\n•o~ -O* -O\nAccording to the statement on the dust cover, Television in\nSchool, College, and Community by Jennie Waugh Callahan\n(McGraw-Hill, New York, 1953, $4.75) is the first book in the\nfield to deal exclusively with educational television. If so, it is\nan excellent first attempt. The “bright new field,” as the author\ncalls it, is presented in attractive colors, with enthusiasm, and—\ninterestingly enough—with extensive documentation. The book\nis divided into three parts. The first part is concerned with the\n2 The Nature of Prejudice (Cambridge, Mass.: Addison-Wesley Publishing Company,\n1954)> PP- 191 ff- The italics are in the original."
}