{
  "id": "d1008-163",
  "text": "428 THE QUARTERLY\nThe following are the specific subjects discussed by the con¬\ntributors: “The Role of Mass Communication in American\nSociety,” Fred S. Siebert, School of Journalism and Communi¬\ncations, University of Illinois; “The Social Functions of the\nPress,” Theodore Peterson, School of Journalism and Communi¬\ncations, University of Illinois; “Motion Pictures in Relation to\nSocial Controls,” Robert W. Wagner, Ohio State University;\n“Freedom and Access to Broadcasting,” I. Keith Tyler, Ohio\nState University; “Procedures and Effects of Mass Communica¬\ntion,” Wilbur Schramm, Division of Communications, Univer¬\nsity of Illinois; “Procedures and Effects of the Printed Media,”\nCharles E. Swanson, Institute of Communications Research, Uni¬\nversity of Illinois; “Social Impact of the Mass Media of Com¬\nmunication,” Franklin Fearing, University of California; “The\nContent and Effects of Broadcasting,” Dallas W. Smythe, Institute\nof Communications Research, University of Illinois; “The Class¬\nroom and the Newspaper,” Per G. Stensland, Texas Technolog¬\nical College; “Teaching Discrimination in Motion Pictures,”\nEdgar Dale, Ohio State University; “The Citizen and the Mass\nMedia,” R. J. Blakely, Fund for Adult Education, Ford Founda¬\ntion. The editor of the volume is Nelson B. Henry, University\nof Chicago.\n■0*0-0\nThe titles on the Mentor and Signet Key book lists (New\nAmerican Library of World Literature, 501 Madison Ave., New\nYork 22, N.Y., 25 and 35 cents each) continue to be astonishing.\nCurrent titles are The Shaping of the Modern Mind by Crane\nBrinton, Greek Civilization and Character by Arnold J. Toyn¬\nbee, The Sea Around Us by Rachel L. Carson, How to Make a\nSuccess of Your Marriage by Dr. Eustace Chesser, Gandhi by\nLouis Fischer, The United States Political System and How It\nWorks by David Cushman Coyle, The Song of God Bhagavad-\nGita with an introduction by Aldous Huxley, Basic Selections\nfrom Emerson (edited by Eduard C. Lindeman), and Speak Better\nWrite Better English by Horace Coon."
}