{
  "id": "d1008-188",
  "text": "10-10-10\nGeneral Scholarships - Applicant must have bachelor8s degree or equivalent.\nMust give evidence of written acceptance from the institution or workshop of his choice\nprior to acceptance of application for scholarship. Give fewer scholarships, but\nwith more money* Sliding scale of awards according to the length of the workshop of\nsummer session, as follows: $75 for a week (5-6 days); $150 for two weeks (10 - 12\ndays); $200 for three weeks (15 - 21 days); $250 for a summer session of 6 or 8\nweeks; $300 for a session of 9 or more weeks. Application form to include more back¬\nground of candidate (with particular stress on educational background). A sub¬\ncommittee (of the Professional Advancement committee) to meet and pass on all ap¬\nplicants at one time. The list then will be distributed to the entire committee for\nviolent objections, “Miscarriage of justice” claims, etc., with a definite deadline\nfor return of same to sub-committee chairman. This scholarship program to start in\n1957 and run for five years subject to review at the end of two years. At least 50%\nof summer session courses taken by a scholarship winner must be in radio and/or TV.\nExchange Fellowships - Recommend that exchange fellowships in radio and TV be\nset up between NAEB member stations, for six months or a year. Each exchange person\nwould continue to draw his pay from his “home” institution, with special funds pro¬\nvided by the NAEB for travel, etc.\nGeneral discussion of sub-committee recommendations - No definite policy should\nbe established about the eligibility of a previous scholarship winner to be awarded\nanother. This should be decided on the merits of the individual case. Question\nraised as to whether or not the work a scholar can take should be restricted as to sub¬\nject matter. Martin said he was opposed to the financing of skills development —\nseems we should, instead, be developing leadership. Winnie felt that there is need\nfor seme development of skills* Garrison pointed out that the NAEB probably couldn®t\njustify a foundation request for funds for providing general education. (This dis¬\ncussion led to the inclusion above of the requirement that 50% of the courses\ntaken must be in radio and/or TV.)"
}