{
  "id": "d1008-192",
  "text": "14-14-14\nFoundation will be started. After which, based on informal reactions, formal written\nrequest will be made.\nWynn - After he has received corrected minutes from committee members, he will\nwrite to Board urging that the recommendations be approved. After requests, in order\nof priority, are made to Foundation, if changes have to be made, should amendments\nbe made by Headquarters staff or the committee? It was agreed that, if there was time,\nthe committee should be contacted - if not, staff and Schooley will make the decisions\nwithin the broad sense of the recommendations of the committee. Schooley may contact\nthe Board if time allows. In case Schooley and staff need some help from the committee,\nthe committee will be glad to provide help as needed and in form requested.\nRickard - Suggested that any major deviations from the committee recommendations\nbe passed on to the committee. Wynn agreed that in such a case he would get in touch\nwith the committee, by phone if necessary.\nAgenda matters not fully handled were then reviewed briefly.\nPersonnel Exchange »Sub-Con2nittee on Scholarships agreed that exchange of personnel\nwith Networks might be hard to work out, therefore their recommendation confined this\nprogram to member institutions. However, the special study grants might cover study,\nor internship, at Networks. Adkins pointed out that we might have our own people\nwork in Networks for a year, on a grant. Rickard challenged the thesis that Networks\nhave the answer to our problems in educational broadcasting. Wynn pointed out that\nthere are members of the Networks who might be very valuable in helping us. Garrison\npointed out that this had largely been taken care of in the provision for Specialists\nin Residence.\nProfessional status - Wynn pointed out that the best way we can improve our pro¬\nfessional status is in terms of what we have done in this meeting. General agreement.\nGarrison - we might want to encourage our members to submit to other professional\njournals, and encourage faculty program participants to contribute complimentary articles\nto journals in their own professional field - this will increase professional status."
}