{
  "id": "d1008-203",
  "text": "-3-\nCo Any of the above named institutions, agencies, organisations or associations\nnot eligible for active or associate membership, but which are interested in\nor seek to promote broadcasting for educational and cultural purposes may be\nelected to AFFILIATE MEMBERSHIP.\ndo Any individual who holds a baccalaureate in education, or in the arts and\nsciences with an emphasis on radio and television and who has had at least five\nyears experience managing or directing a radio and/or television station and who\notherwise meets the requirements of the association as to character, reputation\nand professional integrity may be eligible for nomination as a FELLOW in the as¬\nsociation\nSo Any individual who holds a Master0s degree or better in education, or in the\narts and sciences with an eiiphasis on radio and television and who has had at\nleast three full years experience managing or directing a radio or television\nstation and who otherwise meets the requirements of the association as to char¬\nacter, reputation and professional integrity may be eligible for nomination as\na FELLOW in the association0\nfo Any individual whose academic attainments are judged to be adequate by the\nBoard of directors, and who has had at least ten years experience managing or\ndirecting a radio or television station, and who otherwise meets the require¬\nments of the association as to character, reputation, and professional integrity\nmay be eligible for nomination as a FELLOW in the association\ngo Any individual who has a four-year college degree in education, arts and sci¬\nences or engineering and who has had at least three years experience as a pro¬\ngram director, technical director, producer, engineer, or major department head\nin a radio or television station and who otherwise meets the requirements of\nthe association as to character, reputation and professional integrity may be.\neligible for nomination as a * JUNIOR MEMBER,\nho Any individual whose academic attainments are judged to be adequate by\nthe Board of Directors and who has had at least seven years experience as pro¬\ngram director, technical director, producer, engineer, or major department head\nin a radio or television station, and who otherwise meets the requirements of\nthe association as to character, reputation and professional integrity may be\neligible for nomination as a JUNIOR MEMBER.\nio Any individual who has made outstanding contributions to the advancement of\nbroadcasting for educational and cultural purposes, or who has made significant\ncontributions to the advancement of the profession of educational broadcasting\nmay be eligible for nomination as an HONORARY MEMBER. Such nomination must have\nthe unanimous approval of the Board of Directors before it is submitted to the\nmembership at the annual meeting.\nARTICLE II\nOFFICERS:\nThe officers of the association shall consist of a President\nThe officers of the association shall consist of a President, Vice-President,\nSecretary, treasurer. Director for JUNIOR MEMBERS, and a Board of Directors con¬\nsisting of one from each authorized district; in addition there shall be an"
}