{
  "id": "d1008-221",
  "text": "REPORT OF NAEB ENGINEERING\nCOMMITTEE MEETING\nChicago Illinois, January 7, 1956\nPresent: Brugger, Higgy, Holmberg, Ketcham, Kratt, Menzer.\nAlso present were: Mr* C,S. Bidlack, NAEB Engineer; Mr. CcM. Braum, JCET Engineer;\nand Mr. Harry Skornia, NAEB Executive Director.\nThe NAEB Engineering Committee met in the Sherman Hotel, Chicago, Illinois, from\n9:00 am to 5:00 pm on January 7, 1956. A smaller group met during the evening of\nJanuary 6. There was considerable discussion as to the work this committee should\nbe dohig as well as to planning for future activities. It was fortunate that Mr Skornia\nwas able to meet with the group and answer questions regarding NAEB policy. The\ncommittee feels that his presence at all NAEB committee meetings would be equally\nbeneficial, hi order to distribute the committee work so there would be less of a burden\non individual members, various projects were assigned to subcommittees at one or\nmore members. It is expected that these individuals will utilize the services at their\nown staff and it is hoped that such an arrangement will result in more effective action.\nTopics discussed were as follows:\nlc Tape recording tests. Quality control. Standards.\n2„ Tape network quality improvement. 15 in. per sec.?\n3. Review of NAEB Engineering Workshops. Future plans.\n4. Video recording. Work with ETR Center.\n5. NAEB radio network: AM, FM, Microwave, Wire lines. Multiplex.\n6. Pool of test equipment. Listing of equipment for trade or purchase.\n7. Professional recognition of technical personnel. Job Classification. Wage scales.\n8. Use of roster of technical personnel. Promoting interest in NAEB.\n9. Engineering Committee reports and publications. News Letter.\n10. Regional technical meetings.\n11. Discussion of FCC actions.\n12. Future meetings.\nA brief report of the discussions, progress and recommendations covering the\nabove list follows:\n1 Tape recording tests, duality control. Standards: In order to assure the release of\nhighest quality tape recordings two steps should be carefully controlled. One, the\nrecording of master tapes and Two, the duplication of tapes. A third step, that of\nplayback, is equally important but cannot be controlled by NAEB. It should be assumed\nthat station engineers are capable of properly adjusting and operating their play-back\nunits. However, this committee has published some instructions covering such\nadjustments and will continue to help whenever possible^ by correspondence and by\npublished papers. Mr. Holmberg lias agreed to handle any requests for information\nregarding maintenance and testing of playback equipment.\nhi the recording of master tapes,. NAEB can exercise some measure of control and\nprovide assistance. With this in mind the committee has set up a testing program which,\nif followed, will assure high quality master tapes. A detailed explannation of this\ntesting procedure is outlined on an attached sheet. It is recommended that all those\nsubmitting master tapes for duplication first send in a test tape for evaluation. This\ntest will determine whether or not the equipment is capable of producing the results\nnecessary for high quality recording. If the tests indicate inferior results, they are\ndesigned to show what steps should be taken to correct the situation. There will be no"
}