{
  "id": "d1008-229",
  "text": "SUB~CCMMITTEE REPOST\nOF mm RADIO PROGRAM FLANNI1G MEETING\nDEL PRADO HOTEL, GHIG4G0\nDECEMBER 3^ i$S5\nTO; Frank Schooley\nHarry Skox*nia (multiple copies)\nHaroM Hill\nJohn Holt\nWaldo Abbott\nMembers of the Subcommittee\nFROM; Kenneth D* Wright, Suh-Garnmittoe Chairman\nSUBJECT: Report and Recommendations of Network Program Planning Sub-Coamittee*\nCommittee members presents\nLee Eit^en\nDick VogpL\nKenneth Wri&t\nHarry Skornia, consultant\nCommittee member absent;\nBarnard Buck\nThis report trill bo informal, concise , but not brief* Any formal report\ndesired will b© written from this material upon request* W© think of this re¬\nport as going to the above only5 it is not written for any other purpose aid\nshould fee polished if intemed for any otter distribution*\nThus, toe peroration. From hero on* my so marks rill be taken from notes\nof the on© day meeting prepared, ty Dick Vogi and from actions that 1 have taken\nsince the msetirg at the group’s suggestion* To orient you: we concentrated\non three general topics! (1) a review c£ past and present net programming,\n(2) a discussLcn of 1$ to 20 program ideas that seemed to off®* network quality\ncontent, and (3) from these ideas, a discussion of throe scries to bo recom¬\nmended for large budget production, a la Ways of Mankind*\nREVIEW OF NETWORK PROGRAMMING\nLong history of groups like this one meeting to dLsctsss network programming\nneeds and ho tv to ail then. Many good things have been ten© by individuals, but\nless by organised committee* Skomia reported on one such meeting, held in\nWashington cn two Augisb days, 1S>£3, which served as a guide to present group*\nAt the X?53 meeting were George: Probst, Frank Sdiooley, Parker Wheatlqr, and\nGraydon Ausmuso The group outlined very sketchily some 20 ansas for series 5\nsome wore ultimately produced, most wore not. We used s cm© of this material\nas a starter for our n&etRD& needs—-revi sited1- meeting of 195>5.\nSkomia reainded us of a letter from him to Bob Hudson of November 17,\nISZky copies of which aLl of us had earlier, which further mentioned msay pro-\ngram series ideas from various people. We used these, too, in our final de¬\nliberations.\nSomewhat less ancient was a memo from Skomia to the Grants, School, and\nProgram. Planning Committees, members of the NAEB Board, and to Dr. H. K« New-\nbem of tte Educational Television aid Radio Center, dated February 2, 1\n(p\n-\nrrC^JLi/Tr^"
}