{
  "id": "d1008-231",
  "text": "Radio Program Manning—3 *\nto interpret our mores, economic philosophies* political find so dal character¬\nistics in terms of our industrialized society*\nSkornia reported on a series called What Is A Good School? which would be\nan attempt to coop are the basic concepts oF'sl&oalsi private* parochial,\nAmerican versus European, progressive, trcditional ■>\nFinally, Skornia reported on a discussion with a Mr« Birch about a series\non the three branches of U« S» government.\nThe seven d© Tocqueville scripts were given much attonticn . All members\npresort had read all or most of thm and a lengthy discussion culminated in tho\ndecision that these programs did not larraat a “prestige” production budgets We\nrealize that there is a considerable investment in the scripts, and it should\nbe r a claimed by having the programs produced for network distribution on a\nsmall budget by on© of the NAEB members* The Universities of Minnesota, North\nCarolina, and Wisconsin were suggested as possible producing agencies® A ceil¬\ning of $5000 was agreed upon as the price of production if possibles I pro¬\nposed an idea that the oammittee accepted for future reference? to follow the\n6fj Tocqueville programs wi th a 20th Century do Togquevillo to comment on the\nAmerica of today, f ollcwirg seme of the paths taken by thrforiginal d© Tocque™\nville. Alistair Cooke was mentioned as a possible central figure®\nPaul Street of Nation si Education Association has suggested a series tied\nin with the NEA Centennial of 195?, The theme would b© \"An Educated People\nMoves Freedom Forward’5, ard hie aim of the series would be to interpret the role\nof education in a democracy. This has been dene, so the approach would have to\nb® fresh and creative* The committee felt that the information in 'the oropjosal\nwas too sketchy, aid instructedeme to write for flirfcher details, (Letter to\nStreet attached.)\nWe discussed two current books that might b© us©d as bases for tore series*\nOne isWoston LaBarreto Th© Human Animal on anthropological, development, and the\nother is They Thought by Milton Meyer, a study of the Gemm\ncitizen in a maTTTcrmunHer ihe ifazls® It was the thought of the committee\nt^iat the books would simply serve as a catalyst to gat such series underwsy\nwith other research to be used. No action was taken on these ideas»\nFrom Glenn Starlin cam© the proposal to use Dr* Caste 11 on me or nor©\nseries on these subjects; (1) From Puritanism to Pragmatism, tracings of\nAmerican thought, (2) a prognm de’alKg'wi^li gfroaF\"cidsas in the history of\nthought, (3) Every Man His Own Moralist, dealing with elementary ethics, and\nva) in Mod'errT^^iCciezy> Also\"\"Starlin suggests that Dr* Caste 11 might\nbo willing ¥ resiiae im> former series. Invitation to Read aid Window/ on the\nIvory Tower* The comities reacted very favorably to all suggestions,”Tu¥ex-\npres sea preference for the programs in the order listed above. I was instructed\nto urite Starlin an affirmative answer. (Letter to Starlin attached.)\nJames A* Sweet of the .Library of Congress proposed the Library wsekly\nchamber music cai certs, complete with 15 minute book reviews during hit emission*\nThe usual net mill: duplicate g tro'Jbles with music discouraged the committee from\nrocommsiding this, but the ‘thought was that member stations might like to get\nche tapes direct from WGMS, Washington, for a small fee* Bernie Buck sent word\nthat he had used these tapes, and found the music excellent but the reviews\nAOl* I was instructed tc inquire of Mr,, Sweet if the tapes are still avail¬\nable for individual stations* (Letter to Sweet attached. )"
}