{
  "id": "d1008-254",
  "text": "Annual Report (1955-56) to the\nW. K. Kellogg foundation\nfrom the\nNational Association of Educational Broadcasters\nGeneral:\nAs we look back over the past five years of accomplishment, as made possible\nby grants from the W, K# Kellogg Foundation, we feel a certain pride. It is our\nhope in this fifth year report of our relationship to convey some of our enthusiasm\nregarding the developments during this period so Foundation officials may share\nour pride and pleasure.\nQrgaplzfltepnal RtiUUQPE*\nAs the year began, the Boards of the various organizations concerned with\neducational broadcasting were meeting to assess needs and resources, (the latter\nin terms of both funds and organizations needed to carry out necessary activities).\nFrom these discussions resulted a new definition of functions and several\norganizational changes. The National Citizens Committee for Educational Tele¬\nvision, as a staff organization, was dissolved. A one-year grant was made to\nthe Educational Television and Radio Center to carry cm those of the NCCET's\nnational promotional activities generally on behalf of educational television and\neducational broadcasting which the various groups found still essential. As a\ncommittee of voluntary educational and civic leaders, the NCCET is now advisory\nto the other groups active in the field.\nThe Educational Television and Radio Center received an additional grant for\nboth television and radio program development and TV network operation. Television\nprogram contracts and distribution are handled by the Center directly. Radio\nprogram grants are administered only on recommendations from the NAEB, whose Net¬\nwork is the sole distribution mechanism for educational radio. Some 40,000.00\nper year in funds secured by the Center and made available for program grants-in¬\naid, is regularly distributed to NAEB Radio member stations for the production of\noutstanding radio series. Several special grants, amounting to some (>36,000.00\nare now pending. Grants to NAEB member television stations for the production of\nseries for National Educational Television, both educational and (on a secondary\nbasis) canmercial stations (as is also increasingly the case in radio), have so\nfar totaled over (1,000,000.00. These grants have been of great assistance to\nmember stations in the development of increasingly higher standards and staffs,\nsupplementing the Research and Staff—training programs of the NAEB mentioned\nlater in this report.\nThe third organization active ip the national educational television movement,\nthe Joint Committee on Educational Television, has been changed to the Joint\nCouncil on Educational Television. Its base has been broadened by the addition\nof other organizational groups such as the PTA. Its functions have been limited"
}