{
  "id": "d1008-258",
  "text": "-5-\nAt a recent joint UNESCO-NEA Research meeting and workshop at which the\nExecutive Director appeared, representatives of some twenty countries found this\nservice uniquely useful. Consequently we have a considerable international\nmailing list for these, in addition to our subscription and TV member station\ndistribution. In exchange, results of experiments in other countries are now\nforwarded to us as a matter of course, making this service more complete.\nUnfortunately the staff and funds for carrying out such a growing service,\nare not presently available. In view of the great need, research clearing-house\nfunctions in the program area are beginning to be developed and shared increasingly\nby the Center. Present plans, however, do not call for any reduction in our Fact\nSheet Service.\nOne of the largest projects undertaken in the area of TV for direct teaching\nduring the past year was worked out cooperatively with the Institute of Communi¬\ncations Research at the University of Illinois. The results now being received\nin answer to questionnaires sent to all school administrators and radio-TV\ninstallations, are being tabulated, as this is written, and will be published and\ndistributed within the next few months. With this project as the spear-head, it\nis our hope that hereafter a central card-file of all research projects in\neducational uses of radio and TV may be maintained here on a current basis as a\nsource for other scholars and groups needing them for legitimate educational\nstudies. Although all research-related activities are coordinated by the NAEB\nResearch Committee, much of the implementation involved must of course be carried\nout by the NAEB staff.\nAs the year ended, plans were drawn for use of Kellogg grant funds earmarked\nfor Research for a modest program of grants-in-aid to assist and stimulate research\nin both radio and television at member institutions in the nation. A copy of the\nannouncement of this project will be forwarded to the Foundation as soon as it is\nfinalized and printed for distribution.\nFinally, although they may not be precisely research in its true sense, the\nactivities of various other NAEB Committees have resulted in tabulations of\nquestionnaires in operational problems and areas such as practices regarding the\nreimbursement of faculty and staff for broadcast courses and appearances, etc.,\nas listed in our Appendix Section under Publications, These materials, though\nnot widely distributed, are found to meet critical needs at frequently critical\ntimes, when member or prospective member institutions call for them. Various\nreports to us indicate that such objective materials as these and our Fact Sheets\nhave been responsible for swaying decisions many times in favor of greater use\nof radio and television on behalf of American education generally, and in many\ninstances for securing the activation of both radio and television frequencies\nInternational Relations:\nIn addition to the international contacts and activities referred to in the\nOrganizational Relations section above, NAEB international relations have grown\nalso through increasing exchanges of broadcast programs, publications, and"
}