{
  "id": "d1008-263",
  "text": "-10-\noffering of high fidelity recordings for the exclusive use of our members. The\nfall season will also bring our members the premier recording of Arthur Honegger*s\ncantata, KING DAVID, plus twenty-nine other series of varied educational, cultural,\ninformational programming.\nIn the past year the Network has increased its output by over two thousand\n(2000) hours (see Appendix). During the year 7/1/55 - 6/30/56 the total air time\nof Network programs (regular and in-school) broadcast over member stations was\n(in hours and minutes) 17,l£2jUO, a substantial increase over the figure for the\nyear 7/1/5U - 6/30/55, which was 15,087:20. At the present time the Network can\nsupply eight and one-half (8|) hours per week of quality programming to each\nmember station.\nThe most sweeping changes having a bearing on Network operations was made\nby the NAEB Radio Network School Committee at a recent meeting in Urbana. This\nCommittee, upon reviewing past efforts in this area, discarded old methods of\nselection, offering and distribution of in-school programs and substituted new\nsystems designed to increase the number of programs to be offered and to offer\nthem in such a way that the stations may select programs from various categories.\nAlso, the Committee, upon the advice of the Network Manager, discarded past\nmethods of handling distribution of in-school programs and substituted a method\nwhereby the Network can ship more programs in less time, can keep accurate records\nof shipments and can get programs to the stations when they want them for proper\nreview prior to broadcast.\nFrom the above evidence it may be concluded that the Network is constantly\nimproving. Naturally, no operation is perfect and there remains much to be done\nto improve many areas of our work. At the present time the Network staff is hard\nat work developing plans for increasing our efficiency, our output in quality\nand quantity, and our membership.\nConclusioni\nAlthough each year brings new problems which tax the resources of the staff\nand the Association, we believe the past year has been one of unusual accomplish¬\nment. It has seen a growing number of distinguished educators of the order of\nArthur Compton, John White and other former college presidents, vice-presidents\nand deans joining our ranks as station directors and members of educational radio\nand television agency staffs* As the year closes we feel that the frequencies\nreserved for education in the FM and TV bands are now being used adequately\nto insure their continued preservation.\nThis feeling- is strengthened by the replies received from members of the\nHouse, the Senate, and the members of the Federal Communications Commission, to\nwhom we sent copies of resolutions of the Association on behalf of such preserva¬\ntion. It is also strengthened by the number of closed-circuit and school uses of\nTV, a new interest in low-power stations, and the growing support of Associations\nof Administrators, Teachers and Colleges and Universities generally, many of which\nfind that these tools offer promise of relief in the days of crowded enrollments\nand facilities which loom ahead."
}