{
  "id": "d1008-3",
  "text": "- 3 -\nInformation\n(general)\n1951\nt\n3,3 percent\n1952\ns\n2,9\nn\nInformation\n(children)\n1951\nl\n1,0\nn\n1952\nl\n0.9\nn\nPublic Issues\n1951\nt\n1.4\nw\n1952\ns\n1.9\nit\nPublic Events\n1951\n.\n0,9\n»\n1952\n•\n1.4\ntt\nNews\n1951\n5\n5.5\ntt\n1952\n:\n5,9\nit\nWeather\n1951\nJ\n0,4\nH\n1952\n:\n0.4\nft\nEffect of disintegrating mixed types of programs\nThe bulk of the analysis is on the assumption that a program may be classi¬\nfied, Per SQ» as a unit. For certain programs which have a heterogeneous content,\nsuch as Variety, Popular Music, and Quiz, Stunts and Contents, it is of interest to\ninquire what would be the effects of treating each entertainment unit in such programs\nas if it were a whole program. Such an analysis is offered in the table dealing with\nthe amount of program time in various classes of programs before and after the dis¬\nintegration of these mixed program classes. The highlights of this analysis are as\nfollows :\nThe program classes which show increased amounts of time after disintegra¬\ntion of the mixed classes are:\nPopular Music (which gains 306 minutes and becomes 4,5 percent\nof total program time rather than 3,7 percent);\npersonalities, (which gains 93 minutes and becomes 2,6 percent\nrather than 2,4 percent);\nSports programs, (which gain 69 minutes and rise from 8,4 percent\n8,6 percent);\nLight Music (which gains 26 minutes and becomes 0,1 percent\nrather than 0 percent);\nSerious Music (whioh gains 18 minutes and becomes 0,6 percent\nrather than 0,5 percent).\nThe classes of programs related to information showed no significant change\nas a result of the disintegration. Public Events and Weather were unchanged. Infor¬\nmation (General) increased 11 minutes. Childrens Information increased 5 minutes.\nPublic Issues programs increased 10 minutes. News programs increased 4 minutes.\nAs a result of the disintegration, Dance, whioh had previously had no\nprogram time, acquired 11 minutes. There is no change in program time assigned to\nFine Arts, which stands at 29 minutes, or o.l percent."
}