{
  "id": "d1008-62",
  "text": "N.A.E.B. Broadcast Revolving\nPage Three\nPurchasing Division as a non-cash transaction by deleting the item\nfrom one control account and adding it to another, provided the\ntransfer involves a new custodian. The inventory section is not\nconcerned with transfers within a college or department when the\njurisdiction or responsibility is the same. Only cash transac¬\ntions are reconciled with the Accounting Division each month.\nAt the time of our audit the Broadcast Revolving inventory con¬\nsisted of 18 items of equipment costing $1 6ll 50. Of this amount\n$987 35 was originally charged to a special appropriation. Navy\nPier Recording Studio Equipment. This equipment is located in\nChicago. The balance of $624 15 was originally charged to the\nRadio Station appropriation account. If the N.A.E.B. Broadcast\nRevolving funds are not State funds, then the ownership of the\nabove equipment possibly should be clarified.\nOur audit also revealed that equipment costing $27 731 36 was de¬\nleted from the State inventory in September, 1954 and added to the\nKellogg Radio Foundation inventory. The executive director of the\nN.A.E.B. requested the transfer and approval was granted by the\nState Auditor. However, included in the transfer were two items\n^ costing $945 which had originally been charged to Kellogg Founda¬\ntion-Tape Network account and later the charge was transferred\nto the Radio Station appropriation account. Also, another item\ncosting $9 600 00, which was originally charged to the N.A.E.B.\nBroadcast Revolving account, was included in the transfer.\nSince these three items no longer appear on the State inventory\nand since they were originally charged to accounts classified as\nState funds, in our opinion, an adjustment should be made by the\ntransfer of $10 545 from the Kellogg Foundation-Tape Network ac¬\ncount with $945 going to Radio Station and $9 600 to N.A.E.B.\nBroadcast Revolving, or by transferring this equipment back to\nthe original account.\n4) The original agreement with the Kellogg Foundation authorized\nthe University to collect overhead equal to five percent of the\nexpenditures from the Kellogg Foundation-Tape Network account.\nHowever, instead of basing the charge on five percent of the ex¬\npenditures, the University has made a levy of five percent on\nmoneys received, which in effect charges overhead on overhead.\nAssuming that all of the moneys received through January 31, 1955\nwill be expended, overhead collections based on expenditures (ex¬\ncluding overhead expenditures) would total $11 588 10, °r $579 40\nless than the $12 167 50 actually charged.\nApproved\nSenior Accountant\nStanley\nAuditor\nHTK:ml\nApril 25, 1955"
}