{
  "id": "d976-110",
  "text": "D. Space Problems: In many areas television and radio are already serving\nas powerful and economical forces in helping to meet what used to be con¬\nsidered as purely a space shortage. In some cases educational television\nis proving useful for relieving the strain for new buildings, by making it\npossible for students, away from the university's campus end buildings, to\ntake courses with no loss in quality of instruction. The new role which\ncorrespondence and extension courses can play, now that television and radio\nara being “discovered,** is an Important one.\nIn other cases television is able in effect to “remodel** antiquated\nspace arrangements: complicated meters, dials and other Instruments which\nneed to be seen or read at the same time, or used together for Instruction,\ncan be made to appear side by side on the same screen, saving on sometimes\nprohibitive costs of transportation, remodeling or redesign.\nStudies Into the effects of proximity of students with each other. Into\nproblems of and alternatives and solutions to, feedback and talkback--these\nara a few of those problems which need Intensive continuing study If space,\nas we have previously thought of It, Is to appear In Its proper perspective\nin future educational planning—and If it Is to be weighed properly against\nother solutions In the educational system of tomorrow.\nIt is for these reasons that both the Research and Engineering Services\nsections of this request are so concerned with study and service in this\narea—in cooperation with school facilities councils, archItectural organi¬\nzations and school planners. It Is In this area that the usas of radio and\ntelevision may Indeed be most dramatic In their impact.\n6. local Development Balance Needed\nIn spite of the disadvantages which local differences and control of\neducation In the U.S. bring with them, few educators today would wish to\nreplace this system with one of strong central or national control.\n• 7 •"
}