{
  "id": "d976-17",
  "text": "4\nITEM: Not relying solely on the black syndrome, WBFO moved on to\n\"Nation Within a Nation\", a series on the Iroquois Confederation (many\nof you used that series); it is still available and timely.\nITEM: A request for foundation depth funding of a ghetto studio\nto be staffed by black broadcasters was denied. WBFO is moving ahead\nanyway using existing university facilities and staffing the operation\nwith black students who work at the station. Working with the University\nUrban Extension in a new Store Front Center, WBFO hopes to begin ghetto\noriginations within the current year. Black students at the University\nview the idea as something with meaning to them, something they can\nparticipate in and learn from. This is an answer to those stations that\nsay they canTt really get involved without foundation support. Is it\nreally the money? Or is it a question of priorities and imagination?\nThink about it.\nITEM: \"Focus Intercity\" hit the air two weeks ago as an open-\nended series on Saturday afternoons. It Is geared for and by the black\ncommunity. Primarily soul-folk music at the moment, the show includes\na one-hour segment called \"Youth Speaks\" with black kids hitting the\nhard questions about themselves and about Whitey. ItTs an interesting\nexperiment. The Man is hearing blacks discuss him rather than the other\nway around.\n\"Focus Intercity\" will talk to anyone relevant, will take on any\nissue that is a part of whatTs happening. One segment, still on the\nboards, will reach for the Puerto Rican Community in Buffalo in Spanish.\nMaybe WBFO is approaching some sort of millenium with white manage¬\nment hiring a black producer who includes on his series Puerto Rican\naffairs in Spanish.\nCONTACT: William H. Siemering, General Manager\nON TRAINING . . .\nSpecial attention is called to the 1968 URBAN BROADCASTING WORKSHOP\nto be held at the American University, Washington, D. C. during the month\nof August.\nSix Washington, D. C. broadcasters and the Department of Communication\nat American University have developed a program to attract and train\npromising urban and minority group students for work in radio-television\nindustry. The plan Is simple and effective:\n1. Select high school juniors of promise (with aid of school\ncounselors, NAACP, Urban League, etc.)\n2. Provide a tuition free, intensive workshop for them during\none month in the summer.\n3. Select the most promising of the students for eventual decision¬\nmaking positions in broadcasting; keep In touch with them\nduring their senior year of high school, motivate them, encourage\nthem to do their best during their last, crucial year of high\nschool."
}