{
  "id": "d976-176",
  "text": "-13-\nThe January 3 Cambridge show features a town with a problem* Before this town can\ntake any action it must come to a decision on that problem* If its decision is to\nparticipate in some form of reorganization it must then get together with neighboring\ntowns and draw up a formal proposal which can be accepted or rejected by a vote of the\ntowns* In drawing up this proposal it would be given assistance by the county board\nof education which has taken various surveys and constructed a tentative county wide\nplan of reorganization* Our second show* on January 10, will consider the prcblem of\nthe county wide plan* For this show we will go into Hardin County where the county\nboard has made no preliminary surveys or plans* Twelve people from this county will\ndiscuss the problems of drawing up such a plan, probably with a guest from the Hardin\nCounty Board of Education. Our third show, on January 17, will feature representatives\nfrom three towns in Story County—Story City, Gilbert and Roland—and one town in\nHamilton County—Randall. There has been a specific proposal made that these four\ntowns form a reorganized district* Story City, having gone through the Cambridge\nprocess some years ago, has decided that it is for such a reorganization. The other\nthree towns are generally against it. This third program will give each community an\nopportunity to explain its position and try to win over the other towns.\nIn this block of three programs, we start with a town with a problem, and end\nwith a discussion of a specific proposal for a four district reorganization.\nOur next block of programs will deal with the problems of Economic Interde¬\npendence. In this series of discussions we hope to continue our present format by\nusing as participants people from Iowa towns who have personal stakes in problems\ninvolving Economic Interdependence. We may, for example, invite Iowa dairy farmers\nand cheese processors to discuss the problem of the importatior^pf Banish cheese. In\nthis case we would ask them to define the real issues, consider the alternatives and\ncome to decisions, as individuals with specialjinterests and as citizens with national\nresponsibilities.\nIn future weeks. The Whole Town1s Talking will take up other Iowa community\nproblems which have considerable national significance. Juvenile delinquency,\ngambling and law enforcement, re-apportionment, housing, are a few of the subjects\nwhich will be considered.\nWe have made in the last two months a small beginning. We have gotten five whole\ntowns, Cambridge, Story City, Randall, Roland, and Gilbert talking about the problem\nof schools. We are in the process of getting all of Story County to talk about the\nproblem of schools* What we have done in these towns, what we are doing in Story-\nCounty, can be done in every oounty in Iowa. Given sufficient time and staff there is\nno end to the job which can be done by The Whole Tcw^s Talking.\nIn our trips around the state, we have discovered many individual groups, com¬\nposed of capable, sincere people attempting, with limited resources and limited\nknowledge, to improve the functioning of democracy in Iowa. It is possible to make\nThe Whole Townes Talking a focus for the activities of all public spirited organiza¬\ntions in Iowa* Perhaps the best thing this Fund for Adult Education project can show\nthe country is not format formula, or kinescope performances, but rather a method, a way\nto make television serve, in every community, the processes of our democracy*"
}