{
  "id": "d976-177",
  "text": "It is impossible for us to gauge the effect our project will have on the people\nof Iowa* Only after exhaustive research and study will anyone be able to say what\nwe have done. We know that there a_*9 people in Cambridge who are frankly disturbed\nover what is happening to the town* It is not eaqy to get people to think about\ntheir problems without exposing insecurities* We have, however, at this early stage,\nand in an informal manner, gathered up some talk. Let me give two examples*\nWhen we asked Professor Martelle Cushman of the Iowa State College Department\nof Vocational Education to comment on the project as he has seen it operate, both\nas an advisor and as a man deeply concerned with adult education, he wrote:\n“In the first place, the procedures you have used have certainly stimulated\nthinking in a number of specific local communities and when the show is\nactually produced on the air it will stimulate the thinking of many people,\nnot only those closely affiliated with and affected by the communities whose\npeople will appear on the show, but also many other people within the whole\nWOI-TV listening area.\n“In the second place, the program is certainly developing a better under¬\nstanding of the whole series of complex problems that constitute the total\npicture of school district organization in Iowa and in the nation* The\nproblem is extremely complex and it requires the dissemination of a great\ndeal of factual data before people have enough to think with. When the\npeople have an understanding of the basic facts and issues they are in\na position to look at their own situations more objectively and to re&ck\nwhatever decisions they may ultimately have to reach with greater validity\nin terms of improving educational opportunities for the children, youth\nand adults of the state.\n\"In the third place, I am very much interested in the project becauss of its\npromise particularly as an economizer of time and energy* I have given a\ngeneral talk on the basic fundamentals on school district reorganization in\nmore than 30 counties in Iowa, usually to an audience of 100 to 300 people.\nAltogether in five years I have not reached as many people as it is possible\nto reach in an hour or two over WOI-TV.\"\nOr, as Harry Cairns, banker of Cambridge, Iowa, said after our first community\nmeeting:\n\"This is the best thing that’s ever happened to our town.\"\nmyo Simon\nFund for Adult Education\nWOI-TV"
}