{
  "id": "d976-179",
  "text": "-2-\nBasic Survey\nIn order to plan and carry out research objectives 1 and 2, it was necessary\nfirst to take an inventory of the WOI-TV audience* The research staff devoted\nnearly two months to the planning of this survey* Survey sampling and field work\nwere supervised by the Iowa State College Statistical Laboratory* At present survey\ndata is being tabulated and analyzed.\nThe survey covered the territory within a f>0-mile radius of the WOI-TV trans¬\nmitter. Approximately 1000 personal interviews were completed with a cross-section\nof families; another 1000 interviews with a cross-section of individuals was\ncompleted.\nCopies of the survey questionnaires are attached and will indicate the kinds\nof information which the survey will yield.\nIn addition to providing a great amount of basic information about the WOI-TV\naudience, the survey will serve another function. Families and individuals inter¬\nviewed in the survey will later serve as audience panels for study of audience\nreaction and program effects.\nContinuing Study of Audience Size and Characteristics\nTwo techniques tested and proved by radio industry experience will be em¬\nployed to measure the size and characteristics of the audience for the discussion\nprograms.\nCoincidental with the airing of programs, telephone surveys will be made of\nTV Homes In the areas. A representative cross-section of TV homes will be called.\nIn each telephone interview we will find out (1) whether anyone in the family is\nviewing the program, (2) how many persons (if any) are viewing, and (3) if no one\nis viewing, what activity is going on in place of viewing the program.\nTo get a mare generalized measurement of family TV viewing habits and prefer¬\nences as they may or may not relate to viewing of the F.A.E. programs, a panel of\nTV families will keep a diary of viewing. These diaries will include a record of\nall viewing over a period of time. Analysis of diary data will permit a stucty of\nchanges in viewing habits as they may be related to viewing of the discussion\nprograms.\nAudience Reaction to Discussion Programs\nResearch in this area will be of primary interest to the production staff. Having\ndetermined how many and what kinds of people do and do not view the programs, we will\nfollow up with attests to answer the question ’’why?”.\nThree kinds of audience panels will be used for this measurement. The first\nwill be an audience cross-section panel. Coincidental with viewing of the programs,\nthis panel will make a minute -by-minute appraisal of its interest in the show. In\nour pre-test work this fall we have developed a method by which we can obtain\nvalid interest responses for various elements of a program. With the data provided\nby this panel, a graph of interest in the program will be constructed. The graph\nwill indicate points of high and low interest. Reference to these interest graphs\nwill enable the production staff to make appropriate changes in future programs."
}