{
  "id": "d976-2",
  "text": "v_ . -\nDRAFT\nGeneral Statement;\nThis request is made in ita present form after the most serious and mature\ndiscussion in several meetings of the NAEB Board of Directors, and consultation\nwith nur roua reoognizod educational leaders, both nationally and internationally\nknown*\nIt is baaed on the premise that half-measures are inadequate if this nation\nand its educational and leadership responsibilities in an atomic age are to be\nmet adequately, and if the uses made of television and radio by education are to\nbe wise, informed, and responsibly and educationally balanced and oriented*\nIt is our belief that the next five to ten years will be critical ones, both\nfor American education and educational broadcasting* Nothing less than an adequately\ncoordinated, adequately financed oggacisatieaat effort in tbe fiold we represent\ncan accomplish the ta3k which must be done* (/This effort can be done only by an\nexperienced organization, sledged to full cooperation with dll others, national and\ninternational, regardless of organizational effects as such, upon itself.7\nRequest of the National Association\nof Educational Broadcasters/^\nInternationally*, neither the NAEB nor any other educational broadcasting\norganization has so far been able to provide the world leadership which must be\nprovided* The NAEB has been the aost active of the organizations actise in this\narea through the years, through ita international relations cocmitteo, its member¬\nship relations with the International University of the Air, the European Broad¬\ncasting Union, the Prix Italia Committee and other such groups, and through its\nconsultative assistance to the Paris UNESCO office audits representation on the\nD* SP National Commission for UNESCO* However, iMfiiga&a-*resources have made\nall these efforts inadequate when measured against the needs and the\nJ requests reaching us from our own government for international use, as well as\nI from the numerous international organizations themselves* \\\nIn Its recent report UNESCO points out the desperate need for a clearing\nhouse for materials in the educational broadcasting field, and the urgent need for\nsome association in the U. S* which might serve that need. UNESCO Itself hopes\nfor a center “to consist mainly of national co-ordinating committees or associations • *\nNo U. S. organization is now equipped to serve as such a coordinating group in the\neducational broadcasting field*\nNben we requested an official spokesman of UNESCO to address the last NAEB\nAnnual Convention, Director General Luther Evans delegated the Director of UNESCO S\nDepartment of Hass Ccranrunications for this responsibility*\nSpeaking before the Convention, Dr. Tor Gjesdal first paid tribute to the NAEB\nwhich “has won international fame, because it is a unique institution. Your aims\n*>nH achievements have won you respect and provided inspiration to others. His\nfirst challenge to the NAEB was “to continue your work and expand it — to continue\nletting UNESCO know about it.*.Your experiences are of international importance.\""
}