{
  "id": "d976-5",
  "text": "-6-\n\"Power\". . . . which studied powerlessness, discussing problems\nof housing, employment etc. for people who have no political\nor social power to help themselves.\n\"Black Power\". . . . which studied militancy.\n\"What To Do\". . . . which attempted to resolve basic issues\ndividing and distorting blacks and whites in Detroit.\nIN YOUR OWN INTEREST provided an excellent example of public tele¬\nvision hit in the face with a problem with time running out. . . . and solving that\nproblem with grace and intelligence.\nWTVS has two other series in the mill at the moment. . . a local version\nof BLACK JOURNAL tearing up local issues from the two viewpoints of black\nand white and trying to bring the two somehow closer together. The second\nseries will provide black students from Wayne State University a forum in which\nto dig into their own thinking about being alive and being black.\nOn employment. . . . WTVS has three blacks on permanent staff. ... a clerk,\nan engineer and a jack-of-all-trades who is Assistant Traffic Manager, writes\ncontinuity, is a camerman, and is being trained in cinematography.\nCONTACT: J. N. Christianson, General Manager\n* * * *\nWOED, Pittsburgh has begun two series and is in production on a third. . .\nall three aimed at the black community.\nItem: BLACK HORIZONS digs into Negro life in Pittsburgh. ... it is an\nexclusively local series, going after the facts peculiar to Pittsburgh's problems\nand projects.\nProduced by Negro Ralph Proctor, the half-hour weekly devotes each\nprogram to a separate topic. For example, #1 was made up of film segments\nfrom the \"Black Arts Festival\" held on the U. of Pittsburgh campus earlier this\nyear. Other issues are following with gospel music, black youth, child develop¬\nment, Negro survival and other topics. The musical score of the series is\noriginal and is composed and played by the Jazz Iconoclasts, a local group.\nA series of forums has begun co-sponsored by the Junior Chamber of\nCommerce and CURE. The latter organization, Communicators Urging Racial\nEquality, is made up of private individuals working in radio, television, news¬\npapers and advertising in the greater Pittsburgh area. They speak for themselves\nalone and do not necessarily reflect the opinions of their separate employers.\nThey are concerned men and women who want to be a part of racial aspects of the\nurban crisis in their city."
}