{
  "id": "d976-97",
  "text": "NAPSAE: The National Association of Public School Adult Educators\nA year ago some concern was expressed by younger members of this\ngroup regarding the conservative attitude prevalent in it toward the uses of\nETV and radio for its activities. We therefore consented to provide materials\nand participate in its next annual convention to suggest ways in which these\ntools could be useful to NAPSAE objectives and workers. (This illustrates a\nfrequent function of the NAEB, which we try always to fulfill with tact, educa *\ntional integrity and only when genuinely invited and needed, to insure against\nany charge of propagandizing or pressure.)\nNARTB: The National Association of Radio and Television Broadcasters\nRelations with this, the association of commercial stations and networks\n(though educational stations may hold membership and several do) continue\non an increasingly useful and friendly basis. Both groups are represented at\nthe others’ conventions, several professional groups like the CNO have been\nassisted in projects by the NARTB and the NAEB jointly, and there is an exchange\nof publications between the two groups. The NARTB is also represented on\nthe NAEB Organizational Liaison Committee.\nNCCET: The National Citizens Committee for Educational Television\nThis group, which operated for several years under grants from the\nFAE, was discontinued two years ago as a staff operation, its national ETV\npromotional activities being taken over by the ETRC on a grant from the Ford\nFoundation. It is still in existence as a national committee, however, being\nrepresented on the ETRC and other Boards. The NCCET is represented on the\nNAEB Organizational Liaison Committee and serves a useful advisory function\nto the NAEB in its areas of special competence and national citizenship repre¬\nsentation .\nNEA: The National Education Association\nSince 1957 marks the Centennial of the NEA, the NAEB has been espe¬\ncially active in dramatizing and promoting the accomplishments of the NEA\nand the objectives of American education. The Executive Director is a member\nof the NEA, and various NAEB individuals assist DAVI, AVCPI and other groups\nof the NEA as outlined under those organizations.\nNMC: The National Music Council\nAn exchange with this group began when former NAEB President Schooley\naddressed the Music Educators' National Convention in 1956. So far, however,\njoint projects likely to result from planning with the NMC, the MENC, and\nthe International Music Council, with which NAEB relations also began during\nthe year, are indefinite and will require more time to develop."
}