{
  "id": "d1563-3",
  "text": "HAEB NEWS LETTER...Feb. 15, 1949...Page 4\ndyaamic range due to the inherent noise level of the low level\namplifiers and mixing circuits. Frequency and amplitude response\ncan be made very excellent, but in order that microphones be made to\nrespond to a wider frequency band it can be shown that the sensitivity\nis reduced correspondingly which further limits the dynamic range at\nthe lower levels. In the studio the room noises place a definite\nlower lovel bn the transmitted sound if the program is to be kept out\nof the wmudM.\nOne other link which has not been considered is that of telephone\nlines. Their limitations as to frequency response and noise level\nare well known and may be considered as a bottle neck for either\nsystem. Much better quality may be had by using radio frequency\nrelays.\nFrom the above discussion of the transmission system it can be seen\nthat the advantages of F. M. as to high fidelity are partially\nnullified by the limitations of the other elements of the transmission\nsystem. There is no doubt but that improvements can be made but they\nwill have to be very drastic to be effective. The fact remains that\nA. M. can give much higher fidelity reception than it now gives.\nThere can be no question but what wide band F. M# is an outstanding\ndevelopment and will be utilized a great deal in the future. X can\nsee nothing to equal it for connecting links between broadcast trans¬\nmitters since it is so far superior to telephone lines and can be\nretransmitted many times by virtue of its very low noise level and\nhigh fidelity characteristics. Xhe question remains however, will it\nreplace or supplement Amplitude Modulation for broadcasting. What\nare your Ideas?\nBIBLIOGRAPHY\nArmstrong, Ec H.: A Method of Reducing Disturbances in’Radio Signalling\nby a System of Frequency Modulation, Froc. I.R.E.. (May,\n. 1936). ....\nCrosby, M. G.: Frequency Modulation Noise Characteristics, Prop. I.R.E..\n¥25, n 4, p. 573 (Apr. 1937).\nCrosby, M. G.s Frequency Modulation Properties and Characteristics,\nFree, I. R. E.. ¥ 34, n 6, p. 898 (June 1936).\nCarson, John R.: Notes on Theory of Modulation, Proc. I. R. E,. V 10,\nn 1 (Feb. 1922).\nCarson, J. R,, Fray, Thornton, C.s Variable Frequency Electric\nCircuit theory of Frequency Modulation, Bell System\nTechnical Journal. V 16, n 4\nDunlap, 0. E., Jr.,: A Pioneer Among Pioneers, New York Times,(Feb. 4,\n1940)."
}