{
  "id": "d537-95",
  "text": "Network Report — 2\neach season of in-school distribution, the week-to-week distribution rises in order\nto take advantage of our tape supply. However you look at it, the flow of weekly\nseries programs is uneven; at one time a station may receive twenty-two tapes a\nweek from Headquarters, at another only 15, and having once had the larger number\nof tapes made available to them, they must be inclined to expect them in the future\nand to plan their programs accordingly. The Network had hoped to have more equip¬\nment by early this fall and to so increase its output that this rise and fall would\nbe relatively insignificant. As it is the Network must devise a way of evening out\nthe week-to-week flow of general radio programs and still circulate the in-school\nprograms in a satisfactory manner,\n4) ^PROGRAMMED\" RECORDINGS. In the past Network Headquarters has taken a great\ndeal of \"raw\" tape-recorded material, written opening and closing announcements,\nrecorded, dubbed, edited to size, cut timely references, etc. In short the Network\nhas taken raw material and created programs. It now has no time to do this work.\nStations have been urged to submit complete packages, ready for duplication, and\nmore of these have been received; but still a great deal of time must be spent on\nthe preparation of recordings for duplication.\n5) .HEADQUARTERS AUDITION OF PROGRAMS. Network Headquarters was long ago asked to\naudition every program before releasing it. This was attempted but in time proved\nto be completely impractical: Auditing plus the attendant editing often cut our\n\"desk\" staff down to less than one full-time worker. (See Conclusion: Stations.)\n~) DRAMA. PROGRAMS. The Network still lacks the drama programs which many have\nrequested. We have the BBC programs scheduled by the Network, of course, and the\nWAYS OF MANKIND series at present affords drama of a sort. We may get a small\namount of good drama from the FAE grant-in-aid material. But on the whole the\nNetwork distributes very little of any kind. Stations ask for it: they do not\nsupply it. We are sure the Network Acceptance Committee will welcome good drama.\nQUARTER—HOUR PROGRAMS. The Network seldom has more than one quarter-hour\nprogram series running at a time. At present it is the PAYNE COMMUNICATIONS AWARD\nprograms produced through the facilities of Radio Station WILL at the University\nof Illinois. Previously it ran an assortment of programs from UNESCO. Unfortun¬\nately quarter-hour programs of quality seem to be more rare than one might think.\nIt*s a difficult length to work within. Since four quarter-hour shows (good ones)\ncan be put on two half-hour reels, Headquarters would like nothing better than\nlots of good 14:30 programs to distribute.\nCOMMITMENTS TO DISTRIBUTE PROGRAMS. The number of programs from member sta¬\ntions which the Network is distributing is low. A number of such programs are\navailable at the present moment. But it must be remembered that various represen¬\ntatives of the Association have been commissioned to acquire programs from outside\nsources. The Network is committed to the distribution of these programs, and, of\ncourse, such obligations must be fulfilled: series from members must take second\nplace. We hope that expansion of Network production facilities in the near future\nwill allow us to widen the ratio of member station—produced programs to programs\nfrom outside the association. (From outside sources: the several French series,\nthe Interlochen series, and soon some Italian programs.)\n9) MUSIC FROM INTERLOCHEN. This fall the Network carried four hours a week of\nMUSIC FROM INTERLOCHEN for eight weeks. Admittedly, this is too much. Originally,\na lighter load including a couple of half-hour series, which Headquarters never\nreceived, were scheduled. It was decided after some consideration the Network\nwould run all Interlochen series immediately, thus fulfilling the Networks commit¬\nment and freeing time and tape for the distribution of in-school programs. Unfor-"
}