{
  "id": "d1470-0",
  "text": "NEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 28, NO. 11 NOVEMBER, 1963\nConvention Offers Variety for Wives\nWives of NAEBers attending the convention in Milwaukee\nmay choose to participate in all, or some, of the activities\nplanned for them by the local convention committee. Following\nis an outline of the schedule:\nMonday afternoon, November 18—Tour of Mayfair Shop¬\nping Center. Tea at Marshall Field’s Tea Room.\nTuesday afternoon, November 19—Luncheon at a rustic\ncountry inn in Thiensville, Wisconsin. Looking and shopping\nin the exclusive shops there.\nWednesday morning, November 19—Tour of the Greek\nOrthodox Church designed by Frank Lloyd Wright. Con¬\nducted tour of exhibition at the Milwaukee Art Center on\nthe shore of Lake Michigan. Lunch in the Victorian dining\nroom of the stately Hotel Pfister.\nTickets will be available in the registration area.\nSmith Replaces Sylvester at Convention\nDavid A. Smith will address the NAEB convention in Mil¬\nwaukee in place of Arthur Sylvester, Assistant Secretary of\nDefense for Public Affairs, who will be unable to attend.\nSmith, who is from Sylvester’s office, will speak on “Broad¬\ncasting Public Affairs” at the November 20 general session.\nHe will also address a luncheon co-sponsored by the NAEB\nand the Milwaukee Radio Television Council.\nMusic Directors Meet\nIndiana University’s radio-TV department hosted a confer¬\nence of Midwest educational broadcast music directors Octo¬\nber 22 and 23. Representatives from ten radio stations in seven\nstates attended. They appointed a committee, chaired by Harry\nB. Welliver, WUOM, University of Michigan, to start plan¬\nning for next year’s conference, and also to petition for quasi¬\nofficial NAEB status for the group.\nThis was the directors’ second meeting, the first having\nbeen in November, 1962, at the University of Michigan. The\nnext one is scheduled for October, 1964, in Wisconsin.\nMrs. Kathryn Fraser, WFIU, arranged the program, which\nconsisted of several discussion sessions and a tour of the new\nradio-TV building at I.U., as well as individual speeches.\nWalter Kaufmann, of the I.U. music school, talked about\nsome aspects of broadcasting music in India, and Ross Allen,\nstage director for opera at the music school, presented exam¬\nples by some of the students in the school. Don Gillis, cur¬\nrently working on a series about the legend surrounding Tos¬\ncanini, talked about the man and the legend.\nElmer G. Sulzer, director of radio-TV communications at\nI.U., and Ted Grubb, music director, Station WHAS, Louis¬\nville, led a discussion of music clearance problems. Those on\nthe panel discussing music programing for educational radio\nwere Herbert Seitz, program supervisor, Indiana University;\nHarry Welliver, music director of WUOM; and John White,\nof the I.U. School of Music.\nOn the panel at the session on technical problems involved\nin recording classical music for broadcast were Louis R. Bur¬\nroughs, vice president of broadcasting and recording for\nElectro-Voice, Inc.; George Gaber, I.U. School of Music;\nand William H. Kroll, technical supervisor, WFIU.\nBurroughs also demonstrated different kinds of micro¬\nphones. A problem session was chaired by Kenneth Cutler,\nsupervisor of music, WILL, University of Illinois.\nHighlighting the conference was a radio recital by the Berk¬\nshire Quartet, in residence at the university, featuring com¬\npositions by three composers in residence. The composers and\nMrs. Elvis Stahr, wife of the president of Indiana University,\nwere guests at the conference dinner.\nFCC Approves Form 330P\nOn October 24, 1963, the FCC approved the form for “Appli¬\ncation for Authority to Construct or Make Changes in an\nInstructional Television Fixed Station.” Authorization estab¬\nlishing this new class of ETV service for the transmission of\ninstructional and cultural material to multiple receiving loca¬\ntions on channels in the 2500-2690 me band was granted by\nthe FCC on July 25. Forms are now available.\nConventioneers to Hear Reorganization Plan\nNAEBers who attend the convention and the business meeting\non Monday, November 18, will hear details on the proposal for\nreorganization of the NAEB. The proposed structure calls for\nfour semi-autonomous divisions — Radio Station Division, Tele¬\nvision Station Division, Instructional Division, and Individual\nMember Division. Each division would elect its own board and\nthe four divisional boards would constitute the NAEB Board\nof Directors.\nAll members will be allowed to comment on the proposal\nduring the business meetings, but existing by-laws provide that\nonly Active and Associate members can vote on the recom¬\nmendation. They will vote at the final business meeting, on\nWednesday, November 20. Active and Associate members have\nalready received the specific proposed amendments to the by¬\nlaws and constitution, based on the structure approved by the\nBoard of Directors at its meeting in June.\nNAEB Member Directories\nIndividual members of the NAEB will be listed in the January-\nFebruary issue of the NAEB Journal. Please send any address\nchanges — and Zip Codes — before December 1 to Mrs. Dotty\nTempleton, at the Urbana office.\nCopies of the Directory of Institutional Members were mailed\nin September to all NAEB institutional members. Following\ntheir release, the following have come to light: Zoel J. Par-\nenteau should be listed as Program Manager at Kansas City’s\nKCSD-TV. The University of Denver should be listed among\nthose members who operate CCTV. Roy J. Johnston should be\nlisted as Director of the Division of Communications Services\nat the University of Miami.\n1"
}