{
  "id": "d1470-1",
  "text": "Instructional Broadcasting Book Mailed\nCopies of the book of proceedings of the NAEB Instructional\nBroadcasting conference at the University of Illinois last May\nhave been mailed to all paid registrants for the conference.\nAdditional copies are available from the Urbana NAEB office\nfor $2 each. Included are papers on the application of principles\nof learning to instructional broadcasting, uses and utilization of\nTV, creative production for instruction, technical sessions,\nfaculty rights and compensation.\nPhotographs Needed!\nRequests from textbook publishers and others have practically\nwiped out the photo files of the NAEB. We especially need\nglossies showing the use of TV in the classroom — preferably\nshowing students (all grade levels are needed) watching the TV\nset. Good studio shots that are obviously television can be used\ntoo. (We do not need close-ups or shots of the stage only, which\ncould be motion picture or stage productions just as well as\ntelevision.) Please send any photos you are willing to release\nfor general ETV promotional use with an NAEB credit line\nto the NAEB Publications Office, 55 East Armory, Champaign,\nIllinois, 61803.\n* Slides showing instructional TV in operation can be used too —\nbut please send those to Harold Hill, NAEB vice president, at\nthe Washington office.\nNAEB Network Gains 14 Stations in Year\nA year ago, NAEB Radio Network members operated 120\nstations. They now operate 134 noncommercial stations, plus\nthe 10 stations operated by the five commercial affiliates of the\nnetwork. Since June 1, the following have joined the network:\nEastern Mennonite College, Station WEMC (FM), Harrison¬\nburg, Virginia; Mankato State College, Station KMSU-FM,\nMankato, Minnesota; Northern Michigan University, Station\nWNMR, Marquette; University of Idaho, Station KUID (FM),\nMoscow; University of Pennsylvania, Station WXPN, Phila¬\ndelphia; and University of Wichita, Station KMUW-FM,\nWichita, Kansas.\nEmployment in Broadcast News Surveyed\nGale R. Adkins, director of radio-TV research and associate\nprofessor of journalism at the University of Kansas, is con¬\nducting the first nationwide survey of employment in broadcast\nnews, for the Radio Television News Directors Association.\nEvery radio and TV station in the country has been contacted\nwith a request for information. Adkins estimates that the study\nwill take a year to complete.\nMary Somerville Dies\nMary Somerville, British broadcasting pioneer, died in Bath,\nEngland, on September 1 at the age of 65. She had made several\ntrips to the United States, and her world-wide professional and\npersonal friendships included many with NAEB members here.\nIn the late forties, she attended the Institute for Education by\nRadio in Columbus and visited several educational broadcasting\ninstallations in this country. Her professional life centered on\nthe BBC, which she served for thirty years, being successively\nEducational Assistant, Director of School Broadcasting, Assis¬\ntant Controller of Talks, and finally Controller of Talks.\nNew NAEBers\nACTIVE\nUniversity of Wichita, Station KMUW-FM, Wichita, Kansas.\nASSOCIATES\nEdinboro State College, Edinboro, Pennsylvania; Loyola Uni¬\nversity of Los Angeles, Los Angeles, California.\nSUSTAINING\nWHOF (Commercial), Canton, Ohio.\nINDIVIDUALS\nPaul Baron, New York; Mrs. Marye Benjamin, Austin; Ah\nIhsan Beyhan, Bahceli Bor, Turkey; Mrs. Mary Ann Budding-\nton, Washington; Don Louis Burgess, Auburn, Alabama; Mor¬\nris W. Butler, Columbus; Ralph Cable, Salisbury, Southern\nRhodesia; Bonnieta L. Cone, Columbus; George L. Cranford,\nLouisville; Sidney Dash, New York; Thomas J. Dolan, Jr.,\nFort Monroe; Loretta R. Doyle, Evanston; Jack B. Frank,\nClarkson, New York; Bob Friedman, San Francisco; F. H.\nGillespie, Monticello, Indiana; Natalie Ann Gordon, Hinsdale,\nIllinois; Thomas S. Griffin, St. Albans, New York; George B.\nGrills, Jr., Chapel Hill; Frank Irvine, Downey, California;\nAlan B. Jester, Milwaukee; Virginia W. Kassel, Cambridge,\nMassachusetts; Peter Kerner, San Francisco; Richard R.\nKrepela, Atlanta; Loy K. Landers, Evanston; Joseph R. La-\nPorta, Valley Stream, New York; Efrat Lavry, San Fran¬\ncisco; Harold A. Layer, Bloomington, Indiana; John A. Leif-\nheit, Yorktown Heights, New York; Leanna Levy, San Fran¬\ncisco; Herbert Lieberman, Forest Hills, New York; Donald R.\nLow, Elmhurst, Illinois; Lynn L. Lucchetti, San Francisco;\nRev. Joseph F. Lynn, O.S.F.S., Wilmington, Delaware; Richard\nM. Mall, Columbus; H. Lee Marks, Charlotte, North Carolina;\nLyle M. Nelson, Stanford; Ralph G. Nylen, Santa Monica;\nA. H. Partridge, Toronto; Donald H. Paynter, Morgantown,\nWest Virginia; Mrs. Frances M. Plude, Boston; Karen C.\nPrindle, Poland, New York; Lee Reaves, Little Rock; Paul B.\nRickard, Detroit; W. Boyd Rooney, Jr., Lincoln; Mary Jane\nRudolph, Chicago; Donald L. Sandberg, New York; Joan\nRebecca Scott, Raleigh; Sally Smith, Detroit; Corey Thom¬\nson, Verdun, Quebec, Canada; Thomas H. Welch, Columbus.\nNews Notes\nPERSONNEL\n► William Grigaliunas has replaced E. Dana Cox at Central\nMichigan University. Cox has become station manager at the\nnew ETV station in Newark, Ohio, WGSF.\n► Judy Haubens, former community-program producer at\nWMHT, Schenectady, is now acting program manager of the\nstation. She has been with WMHT since May, 1962.\n► David Markham has been appointed assistant professor of\nspeech at Northern Illinois University, where he will teach\nradio-TV and general speech and engage in experimental\nresearch.\n► Richard Estell has been named manager of Michigan State\nUniversity’s radio station WKAR. He had been serving as\nacting manager since September of 1962, when Lawrence Fry-\nmire went on leave from the managerial post to serve as chief\nof the Educational Broadcasting Branch of the FCC. Frymire\nrecently resigned from MSU to accept the FCC position on a\npermanent basis.\n► John M. Kittross has been promoted to the rank of associate\nprofessor in the department of telecommunications of the Uni¬\nversity of Southern California. He has been on the USC faculty\nfor four years, and is editor of the Journal of Broadcasting.\n► Wayne State University’s WDET has announced the appoint¬\nment of Phil Jones as producer. He has worked at commercial\nWLWI, Indianapolis, and WFIU, Indiana University, where\nhe received his M.A. in radio and television.\n► Luke F. Lamb, formerly associate director of ITV at the\nUniversity of Missouri, is now director of educational media\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Phone 333-0580. Area Code 217.\nReporters:\nRegion I —Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\nRegion II —Shirley Ford, WUOT, University of Tennessee, Knox¬\nville.\n—Lou Peneguy, AETC, 2151 Highland Ave., Birming¬\nham, Ala.\nRegion III —McCabe Day, WVSH, School City of Huntington, Ind.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}