{
  "id": "d1470-3",
  "text": "integral part of a new 50-million-dollar campus. Every one of\nthe 700 classrooms is wired for CCTV and 108 teaching stations\nand all sports areas are wired for two-way TV signals. Other\nstaffers are Jacob H. Wiens, director of “College of the Air”;\nDouglas Montgomery, station manager; and J. F. Morgan,\nstation engineer.\n► Ampex Corporation has announced its new VR-660 videotape\nrecorder, which weighs just under a hundred pounds and is\npriced at $14,500. Deliveries will begin early in 1964: it was\ndemonstrated for the first time in September.\nAmpex has also issued an eight-page directory of the Ampex\nVTR’s in service throughout the world. The ETV stations and\nfacilities listed with more than one are KQED, San Francisco;\nWUFT, Gainesville, Florida; WTHS, Miami; WFSU, Talla¬\nhassee; WETV, Atlanta; WSIU, Carbondale, Illinois; WTTW,\nChicago; Johns Hopkins University, Baltimore; WGBH, Cam¬\nbridge; WMSB, East Lansing; KTCA, St. Paul; KETC, St.\nLouis; KUON, Lincoln, Nebraska; WOSU, Columbus, Ohio;\nWHYY, Philadelphia; University of Texas; KCTS, Seattle;\nand MPATI and NET. Copies of the booklet are available\nfrom Ampex.\n► Minnesota Mining & Mfg. Co. has established a program to\nprovide 1.5 million dollars in visual aid teaching equipment for\n5,500 classrooms in the nation.\n► WGVE, FM school station in Gary, Indiana, announces the\ninstallation of a 250-watt transmitter this fall, at which time it\nis also celebrating its tenth birthday.\nState and Regional Activities\n► The first of four planned interconnected ETV stations for the\nstate of New Jersey is WNJE-TV, Glen Ridge, which hopes\nto begin early in 1964.\n► WVAN-TV, Savannah, Georgia, began operations in Sep¬\ntember; it’s the second of four planned by the state board of\neducation. WXGA-TV, Waycross, was the first.\n► The North Carolina ETV bill passed by the state assembly\nseveral months ago gave the University of North Carolina one\nand a quarter million dollars for the construction of trans¬\nmitters and microwave links for WUNC, plus another quarter\nmillion for operations for the period 1963-65.\n► ETV stations in the Phase One plan of the Ohio ETV Net¬\nwork are making applications for Federal aid under the ETV\nFacilities Act. Expanded facilities will enable the stations to\nbe interconnected by microwave, and programing on the net¬\nwork will follow interconnection.\n► The governor of Illinois has signed a bill for a study of the\nfeasibility of establishing, maintaining, and operating a system\nof ETV in Illinois. Robert M. Shultz, supervisor of ITV in the\nstate office of public instruction, says it is expected that legis¬\nlation calling for the approval and appropriations necessary to\nbuild a state ETV network will be submitted and successfully\nacted upon by the 1965 Illinois General Assembly.\nPROGRAMS\n► A producer and a cameraman from the University of Mich¬\nigan’s TV center will go to the Antarctic in the Navy’s Opera¬\ntion Deep Freeze ’64. Mack Woodruff and John Alley will\ngather still and motion pictures for a series on the Antarctic,\nthe programs to be produced in cooperation with the university’s\ngeology department.\n► “Time for Science,” a series of films produced by WETA-TV,\nWashington, and the National Science Foundation for elemen¬\ntary and junior high school use, is now available for purchase\nor rental from Norwood Films, 926 New Jersey Avenue, N.W.,\nWashington, D.C.\n► WNYC-FM, New York City, this month begins a series of\nforeign language dramatic productions. Named “International\nTheatre,” the weekend series will present drama, prose, and\npoetry, along with indigenous music, in Spanish, German,\nFrench, and Italian.\n► Wayne State University announces the sixth season for\n“Musicale” on WTVS. It is billed as “Detroit’s oldest continuing\nclassical music series on TV.”\n► New York University and the public affairs department of\nWNBC-TV are cooperating in the presentation of a new series\nof twenty television essays, “Master Builders of America.”\nINSTRUCTION\n► For its fifth annual TV utilization workshop, the Central\nMichigan ETV Council presented most of the content in three\ntelecasts rebroadcast through facilities of four commercial sta¬\ntions around the state. This was followed up in regional meet¬\nings in several different areas of the state, in which classroom\nteachers could discuss problems, procedures, and techniques\nwith TV teachers and teachers experienced in TV utilization\nand team teaching. Since 1959, the Council has served about\n800 teachers in its summer workshops on the campus of Central\nMichigan University. This was the first time the workshop had\nbeen organized in the manner of ITV lessons, and several par¬\nticipating teachers mentioned the value of experiencing, in the\nrole of a student, good TV teaching and utilization.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Miss Julie Hunt, Placement Service,\nat the NAEB office in Washington.)\nNovember I—Radio-TV administrator, teacher, producer-direc¬\ntor desires challenging, creative opportunity in broad¬\ncasting administration, teaching, and/or production.\nEight years university teaching experience; currently di¬\nrector of radio-TV-film. Ph.D. (speech, radio-TV); male,\n32, married, prefers urban community. Salary minimum\n$9,000.\nNovember 2—Young man, 30, married, A.M. English, with\nbroad experience in education and publishing wants to\nwork as writer/script editor in educational television.\nNew York, Connecticut area; California also acceptable.\n$8,500.\nNovember 3—Top-notch production assistant with two years\nETV experience desires responsible position. Single male,\n25, with a broad international background. Presently em¬\nployed, completing thesis in broadcasting research for\nM.A. in speech. Can handle any assignment from inde¬\npendent producer to floor director; willing to teach\nbroadcasting, math, geography, or dramatics. Location\nand salary open.\nNovember 4—Writer/producer for TV and/or radio programs.\nOver 20 years of staff and free-lance experience (plus\ntheatre background); writing, contact, administration,\npersonnel and creative assignments—also public speak¬\ning and public relations. Age 51, male, single. B.A.\n(English-speech), plus special courses TV and theatre.\nPrefers Northeast, Midwest or Northwest. Salary range:\n$6,500-$ 10,000.\nNovember 5—Agie 25, male, single; A.B. philosophy; 3 years\nbroad TV production experience. Seeks position as pro¬\nducer-director in ETV. Prefers West Coast or East Coast;\nminimum salary $125 per week.\nNovember 6—TV or radio production. Editing/writing. Has 3\nyears in TV programing with advertising agencies; 2\nyears of Peace Corps experience teaching English and\nwriting and editing scripts for elementary radio and TV\neducational programs. Interested in ETV in or out of\nschool programs, preferably with creative work. Single,\n30, female, B.S. Prefers West Coast, but will consider all\nareas. Minimum $5,200.\nPOSITION AVAILABLE\n(In order to be considered by these institutions, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nN-l Experienced transmitter operator. Central Texas, maximum\npower educational VHF, new installation, RCA TT50\ntransmitter. Open immediately.\n4\nNEWSLETTER"
}