{
  "id": "d975-14",
  "text": "National Educational Radio\nA DIVISION OF THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue N.W. Washington D. C. 20036 Telephone 667-6000\nEXECUTIVE DIRECTOR\nROBERT A. MOTT\nJuly 25, 1968\nFirst Report, Radio Programs for the Disadvantaged\nKen Clark, Project Director\nInformation about what you are all doing at your stations in the\narea of Programs for the Disadvantaged is trickling in. LetTs open\nthe flood gates. Gentlemen. National exposure of your program ideas\ncan only benefit your station in the long run. More important, sharing\nyour experiences, no matter how modest, could be of real help to your\ncolleagues.\nI know youTre out there ...somewhere...but I still dontT hear the\ndrums. However, several stations have evidenced a deep commitment to\nthis kind of programming. LetTs take a look.\nKDPS, Des Moines: Dwight Herbert wrote his philosphy which bears\na reprint here:\n,TWe must agree that to program effectively for any minority audience,\na station must have guts, and a complete reorientation of traditional\nthought concerning non-commercial (or educational or public or\ncultural, if you wish) broadcasting. It cannot be a \"token” effort,\nsandwiched in between \"Evening Concert\" and the \"Classical Hours.”\nBelieve me, it doesnTt work. All you get in that situation is the\naudience with the education, and unless you are trying to reorient\nthe educated mind, you serve no purpose to the ghetto audience. \"\nMakes harsh sense, doesnTt it? A \"reorientation of traditional\nthought” is one step ... the first step ... but the most important step.\nKDPS programs each week eveing from 9:00 - 10:00 PM with a low\nkey, potent series called \"Soul Session.” Featuring paid, part-time\nstaffer Ezell Wiggins, a Negro high school senior, the show goes after\nits audience with appropriate soul music as a hook.\nIn between musical numbers, one to two minute vignettes of an edu¬\ncational, cultural or philosophic nature are dropped in. These spots,\nwritten and produced with imagination, talk about job futures, drop-outs,\nhistory, etc. with a soft sell approach directed to teen-agers (mainly\nNegro). The program also includes a fifteen minute news summary. Does\nit all work? KDPS thinks so, and they ought to know."
}