{
  "id": "d975-18",
  "text": "5\n4. Provide scholarships and loans for the students selected so\nthey can attend college.\n5. Provide summer broadcasting employment for the students selected.\n6. See that students are placed in a broadcasting job upon graduation.\nThe plan suggests what can be achieved by cooperation between broad¬\ncasters and a local university. This is the second year of the project.\nCan any of you in other parts of the country start a similar workshop?\nIT11 be passing along reports of related ideas, experiments, and\ntraining and hiring efforts by other educational radio and television\nstations as they come in. Several stations have reported a sincere desire\nto hire blacks but point to a lack of preparedness on the part of job\napplicants. The Urban Workshop suggests one possible answer.\nNov; what about you and your station? Silence doesnTt necessarily\nindicate inactivity, but if you are involved, then why not take that next\nlogical step and involve yourself where the good things you are doing can\nbe shared at the national level? Let me ask you the following:\nWhat programs for, by or about Disadvantaged citizens is your\nstation working on?\nWhat ideas are on the drawing board?\nCan you share funding solutions with other NER stations?\nWhat good program ideas failed in their production and why?\nHow have you \"plugged in\" to the inner city on the rural ghetto\nin your part of the country?\nWhere do you find most support for such programming? Municipal\ngovernment? School Boards? Church organizations?\nAre you training anyone from Disadvantaged groups in communication\nskills with a view toward staff employment?\nHave you found hiring Negroes on your staff facilitates a more\nmeaningful station approach to this programming? If so, in what ways?\nWhat is the value of a black production unit?\nDo any of your programs get replay on local commercial stations\nwhere such stations have a larger coverage pattern than your own?\nThese are only a few of the questions. You are raising others every\nday as you decide your own stationTs approach to programming for the\nDisadvantaged. It is your answers, based on your own first hand experience\nthat I hope you will share with us."
}