{
  "id": "d975-2",
  "text": "-3-\nstation has taken on part-time a cinematographer who is Negro who works with\nother staffers on ghetto film segments.\nOUR PEOPLE is promoted by advertisements weekly in four Negro papers\n(paid for by the series' underwriters), and radio announcements. Feedback, in\naddition to community organization reaction already averages 200 individual\nresponses (telephone and mail) each week.\nHosted by Jim Tilmon, a former Columbus, Georgia radio announcer,\nwho currently flys as an American Airlines pilot, OUR PEOPLE hits the viewers\nwith their own thing. . . .the personalities, the issues, the questions that hurt as\nblack citizens. OUR PEOPLE is produced and directed by Peter Strand assisted\nby Elizabeth Straus and Dolores Brown, and is written by Doris Saunders.\nOUR PEOPLE is the hot production at WTTW at the moment. But that\nisn't all. Hopefully, the station will get a grant renewal to carry this exceptional\nseries well beyond the present terminal date of October 31st. But that isn't the\nonly action by any means. A series on Negro Youth and another aimed at Negro\nteenagers are both being readied for late Fall.\nWatch WTTW. It's a station that is in the movement with intelligence,\nforesight and real follow-through ability.\nCONTACT: Edward L. Morris, Director of Programming\n* * ❖ *\nKOED, San Francisco has whomped into the middle of what its all about\nwith\"BLACKS, BLUES, BLACK!\" a ten week color series featuring Maya Angelou\nof Ghana.\nLet me take a stab at that provocative title. In going back to the roots of\nthe American Negro, the program searches the African heritage, or the heritage\nof the \"Blacks. \" The period of slavery (including intellectual slavery of the 20th\nCentury) found expression in the \"Blues\" a medium of expression that recorded\na peoples' history and served as a steam valve. \"Black!\" (and note that excla¬\nmation point) says the beauty, power, in fact the whole summed-up-significance\nof Black America's new identity. The three words then, \"BLACKS, BLUES,\nBLACK!\" offer an historical and anthropological survey of Blackness.\nMiss Angelou, a citizen of the U. S. and a resident of Ghana is a singer,\ndancer, actress, reporter and playwright. In the series, Miss Angelou develops\nand demonstrates the history, heritage and habits of Blacks and how their mores\nand values have been preserved and assimilated into the society.\nMade possible by a public service grant from the Olympia Brewing\nCompany of Tumwater, Washington, the series made its debut to warm viewer\nreception on July 8th."
}