{
  "id": "d975-200",
  "text": "-6-\na eulogy to Dr. King as reported in the first addenda to \"ETV in the Ghetto”.\nAs reported by Av Westin at the NET meetings in April, PBL began\nthis spring to experiment with some of the stations to use PBL\nmaterial as the core of locally produced broadcasts about community problems.\nSix stations have received a print of an expanded version of the PBL report about\nthe O. I. C. job training for Negroes in ghetto areas. It's hoped stations can\nlaunch an effort to supplement the PBL material with a locally produced program.\nProblems and solutions to hard-core unemployment in the United States\nwere probed on \"Help Wanted, \" this month on two dozen stations of the Eastern\nEducational Network with an audience potential of 33 million viewers. A teenager\n(who is currently serving on the Security Patrol at Resurrection City), a man with\na police record in his later 20's and one over 45 related their experiences in\ntrying, and failing, to obtain work. They participated in a live, inter-city dis¬\ncussion with three representatives of the National Alliance of Businessmen's\nJOBS program. The program presented a realistic picture of the hard-core\nunemployed, and found out what business is doing to alleveate the condition. The\n90-minute broadcast was produced for EEN by WETA, Washington, D. C. , (with\nassistance from WHYY, Philadelphia, and WNED, Buffalo) through a special grant\nfrom the Carnegie Corporation.\nAnother EEN broadcast (90 minutes) featured teenagers from six metro¬\npolitan areas producing their own visual commentary on the cultural activities\nof inner-city teenagers. \"The Visual Generation\" included the arts and doc¬\numentaries, and analysis of the films by the teenagers who talk about their work\nwith professionals. There was a drama on Negro life in Syracuse (WCNY) produced\nby Youth Opportunity Unlimited; a color sound film about a teenager who becomes\na drug addict filmed by Mobilization for Youth (WNDT, New York); a concert by\nthe Oliver High School Entertainers in Pittsburgh (WOED); a photographic essay\non a Negro Ghetto in Allentown (WITF), a documentary on rural poverty by\nteenagers from Orono, Maine (WMEB), and a film by the Mission Rebels showing\nthe work of San Francisco's (KQED) Performing Arts Workshop. The program\nwas produced for EEN by WCNY, Syracuse, with assistance from the other stations\nmentioned.\nOn June 26, another ninety-minute special on EEN (\"Talking Black\") will\ndiscuss the cultural and social aspects of the ghetto -- the cultural ties that do or\ndo not bind blacks in America's cities. Negro reporters in New York City (WNDT),\nBoston, (WGBH) and Pittsburgh (WQED) will show filmed reports on the cultural\ninstitutions in Harlem, Roxbury and the Hill, and will join in a discussion of their\ninte r r elati on ship s.\nPerhaps the first nationwide instructional TV project to date on this subject\nhas been \"One Nation Indivisible?\". It's a series of eight programs for teachers\nand for junior and senior high school students across the country in racial conflict\nin the U. S. WGBH, Boston, cooperated with the Education Development Center in\nNewton, Massachusetts, to produce three special programs for teachers, prepa¬\nratory to the five-day student programs that followed. The student series included"
}