{
  "id": "d975-3",
  "text": "-4-\nThe first program in the series concerned the positive African cultural\nheritage in current Black American life (because this was basic introduction,\nthis program was repeated three separate times). The second in the series\ntook up the negative aspects of the \"cultural carryover\". Aired on Mondays,\neach segment will automatically be repeated on the following Saturday.\nThrough songs, dances, games, lectures and drama, Miss Angelou deals\nwith the survival as well as revival of African culture in America. What does\nthat mean? Well, for instance, on program #1 the survival of such African\ngames and manners as patti-cake, tag, jacks, finger pointing, vocal sounds and\nintonation changes, good luck symbols, \"southern hospitality\", religious and\nrhythmic expressions and white female affectation are analyzed and exhibited.\nThe series provides the San Francisco Bay Area community with a com¬\nprehensive television exposure of black culture void of white interpretation,\ncondescension or white interposition. It exhibits the viable, on-going culture\nof generations of Black people in their individual and distinctive facets of language,\ndress, cooking, family relationships, recreation. . . . the whole order of human\nexistence. Jon Rice, KOED Program Director says that though the series is\naddressed to the Negro community, it offers white audiences \"a unique opportunity\nto penetrate and observe a mystique which they know exists but which they have\nnever experienced. \"\nThe remaining eight segments of \"BLACKS, BLUES, BLACK!\" go after\nthe following:\n\"The Positive Aspects in Teaching African History\"\n\"Negative Aspects in Teaching African History\"\n\"Researchers in African and Afro-American History. . • ,\nTheir Motives; Their Results\"\n\"Aspirations of Black American Youth in Education\"\n\"Avoiding Useless or Non-Applicable Education\"\n\"Violence in Black American Life\"\n\"Containment, Sublimation, and Releases of Violence\"\n\"Summary\"\nAssisting Miss Angelou are Blondell Breed and Danny Duncan, interpretive\ndancers from the Zack Thompson Dance Studio of San Francisco and musicians\nKenyu Randu on drums and Alphonso Mitchell at the piano.\nThe series is produced by Tony Batten; the sets designed by Darryl\nClegg; and the cinematographer is Allen Willis. . . . all three Negroes.\n\"BLACKS, BLUES, BLACKS!\" doesn't preach. A team of gifted, articulate\nblack artists simply tells it like it is.\nCONTACT: Jonathan Rice, Program Director\n)jC Sfc"
}