{
  "id": "d975-4",
  "text": "-5-\nV/TVS, Detroit recently performed a real public service to the people of\nsoutheastern Michigan in the nature of a ’’rescue operation, \" and, in the process,\nsuggested one more reason why non-commercial broadcasters must treat with\nprograms for the Disadvantaged. . . . because they can do so honestly and without\ncommercial pressures which can be very real.\nIN YOUR OY/N INTEREST, a black-white discussion format, was planned\nas a five part, half-hour series designed to make the white community aware of\nwhat is happening to the ghetto residents of Detroit. A local blue-ribbon organiza¬\ntion called the Interfaith Action Council of Detroit came into being as a result of\nlast summer's riots; its leadership included top religious and civic people.\nAs Executive Producer, the Council hired Arthur Alpert who was given\nleave from the Public Broadcast Laboratory. Next the Council was given the\ngreen light on Use of production facilities and prime time by a local commercial\nstation WYTJ-TV.\nThe;first two programs went on as scheduled. Then prior to the broad¬\ncast of segment three, the management of WWJ advised the Council that it would\nno longer carry the program at 7:30 PM Monday evening because it \"lacked prime\ntime quality. \" Y/’Y/J offered to air at 5:00 PM Saturdays or 3:30 PM Sundays.\nGhetto time for ghetto programming? It didn't make sense to the Council.\nThe Council felt that the whole project was now in jeopardy because some\n6, 000 groups had been carefully organized by churches and others to view the\nprogram at the previously scheduled time. To change in the middle of the series\n.. you understand. Appeals to WWJ were turned down, so the Council decided\nto withdraw the project from the station.\nWTVS, Channel 56 with the agreement of WWJ had previously scheduled\ntwo rebroadcasts of the entire series subsequent to the initial airings on YfWJ.\nAt this critical point in the project WTVS offered air time and studio facilities\nto produce and broadcast the remaining three programs in the series.\nThe series was reportedly viewed by 60 to 100 thousand in group situations\nplus thousands more as individual viewers.\nCo-produced by Tony Brown, a local free lance public relations specialist\nand Joe Strickland, a news reporter with The Detroit News, both Negro, the series\nblocked out the following topics:\n\"Alternatives to Fear\". . . .which explored self-determination\nfor the black community.\n\"Them\". . . . which tore into myths the black and white communities\nhave about each other. (This program was the crucial one. . .it\ntook up police brutality and made the point that local news media,\nboth print and visual, did not report objectively on an earlier\nrace incident)."
}