{
  "id": "d975-42",
  "text": "FOOTHILL C03L3LEG^^|g^\n12345 EL MONTE ROAD • LOS ALTOS HILLS, CALIFORNIA 94022 ^ O*\nK pj d ^ ff?$7o\n'• (#/r,\nTELEPHONE 948-8590\nJuly 3, 1968\nMr. Kenneth Clark\nNational Assn, of Educational Bdcstrs\n1346 Connecticut Avenue\nWashington, D.C.\nDear Ken:\nWelcome back! I’m delighted to hear of your new appoint¬\nment with NASB. Things keep getting better and better for you. This,\nlatest assignment certainly sounds like you1re going to be involved\nin something very crucial and at the same time very exciting (not\nthat your prior work abroad wasn't significant as well).\nTo business first. I was.very interested in the details of\nwhat you’ll be trying to 'do with-•programming- for the culturally and\neconomically disadvantaged. Like many other educational media people\nI’m anxious to have a hand in this ‘challange. And perhaps KFJC-FM\nin its own way can make a contribution. Enclosed is a copy of an\ninitial proposal for programs that we could air starting in the Fall.\nActually, the ground-work for ..this activity was initiated last Spring,\nanticipating as it were the-kind of committment that you and NAEB\nseem to be making'. , .\nCal Flint suddenly awoke to the general seriousness of the\nsituation and budgeted $50,000 this year to implement a program at\nFoothill. This amount, while not an overwhelming sum for this kind\nof program nonetheless is-quite significant when one considers the\nvery \"tight” financial situation which now prevails over our rather\nexpensive 2-campus operation (Foothill is no longer acting like the\nrich College of a few years back). Flint has appointed two full¬\ntime directors to the program who've set up a committee to investigate,\nadvise and assist in the set-up for our district. Right now the\ninformation is just starting to come in. Questions as to whom exactly\nare we trying to help, and just how can Foothill provide them with\nhelp are naturally utmost in everyone’s mind. What will be the most\neffective way to get the show on the road (once it’s decided what\nwe can do) must also be resolved.... all the kinds of questions, I’m\nsure, that you’re confronting right now. It shall be interesting indeed\nto see what response is forthcoming to our overtures.\nJust how the radio broadcasts will fit in to the overall\nscheme is anyone’s quess right now. I came up with 2 program ideas\n(see the enclosure) which can be easily, and I think effectively\nproduced. Naturally they'll have to be well-publicized and run long\nenough for a word-of-mouth kind of publicity to materialize. The\nquestion of our audience — what’s it’s size'and are there enough FM"
}