{
  "id": "d283-110",
  "text": "3.\nare attached for your information. It should be pointed out that this budget is handled\non a calendar year basis - since the primary source of income is from dues which are\non a calendar basis - while the Trust: Kellogg and Ttust: NAEB funds, which are\nhandled through the University of Illinois, are on a fiscal year basis, July 1 - June 30.\nFinally, for those cases when you do travel at NAEB expense, we might avoid confusion\nby explaining those procedures.\nTHIS Information is only for future use. Simply file attached items 4 and 5 for now.\nDon't use or send us either the tax exemption certificates or vouchers attached until\ntravel at NAEB expense is authorized.\nWhen you travel cm NAEB business, you will (unless specifically informed otherwise,\nthat it's from NAEB general and administrative funds, which must be specifically appro¬\npriated in advance by the Board) be travelling tax exempt. Reimbursement is made\nfollowing our turning in for you a University of Illinois Voucher. Payment is made on\nthe basis of actual expenses incurred — not on a per diem basis. If you use your car,\nas is practical for short distances, reimbursement is on the basis of 6£ per mile.\nIn order for you to purchase tax exempt transportation, you'll need University of\nIllinois tax exempt certificates (sample attached). On these you list yourselves as\n\"NAEB Board.\"\nI'm also attaching for each of you (for information only, at present) a set of travel vou¬\nchers . When expenses are authorized you sign these at the top right where it says\n\"Signature of payee,\" on both copies l.and 2, and return all copies to us. We can't\nget payment of hotel bills, sleepers or extra fare reserved seats (on trains) unless you\nsend in stubs and/or receipts. For any miscellaneous item for over $3.00 you must\nalso turn in a receipt. This is the State of the recent Hodge scandals - - so account¬\nants are tough.\nHowever, you only sign the voucher (copies 1 and 2). Don't type or write anything else\non it. We hold it here until you send in, in a note or letter with receipts attached, the\nstatement of your expenses. We then type it up for you on your signed vouchers. That\nway if there are problems or \"bugs\" in what you send in we can work it out without the\ndelay of sending it back to you.\nOther items will begin coming to you regularly. These will Include a proposal, still in\ndraft, to Kellogg; another to Hill-Elliott; our final report to Ford, etc. I have also asked\nformer Secretary Boyter for either the ditto stencils or additional copies of the minutes of\nthe last Board meeting. As soon as these are received. I'll get copies to you. If we have\nto cut new stencils on these, there may be some delay.\nWith what Bill Harley will be passing on to you I hope we'll soon have you feeling that\nyou know the background you need on our current status. If not, please let us know.\nWe'll do our best to answer any reasonable questions."
}