{
  "id": "d283-112",
  "text": "COPY\nU.S. DEPARTMENT OF HEALTH, EDUCATION, AND wELFA$g\nOffice of Education\nCONCERNING TITLE VII,\nNATIONAL DEFENSE EDUCATION ACT OF 1958\nThe program established in the Office of Education to implement\nTitle VII of the National Defense Education Act of 1958 (P.L. 85-\n864) is making progress. A New Educational Media Branch has been\nestablished within the Division of Statistics and Research Services;\nstaff recruitment has begun; and the Advisory Committee on New\nEducational Media has been appointed. At its first meeting held\nDecember 17-18, 1958, the Committee established basic policy and\nprocedures, gave preliminary attention to research proposals thus\nfar submitted, and approved a number of initial steps necessary to\nimplement certain dissemination activities. February 1, 1959, was\nestablished as a cut-off date for proposals to be considered at the\nsecond meeting of the Committee, scheduled for March 5-6, 1959.\nAll applications now on hand, along with those submitted before\nFebruary 1, 1959, will be carried forward to the next meeting, and\nwill be eligible for formal action at that time. Proposals submitted\nlater than February 1, but before April 1, 1959, will be scheduled\nfor evaluation at the third meeting of the Advisory Committee to be\nheld on May 11-12, 1959*\nThe main purpose of this letter is to bring to your attention\ninformation which you may find helpful in the preparation of\napplications for grants for the support of research projects. This\nis contained in three attachments as follows: (a) instructions for\nthe Preparation of Applications for Grants, (b) Criteria for the\nEvaluation of Proposals for Research, and (c) Some Questions and Answers\nRelating to the New Educational Media Program* These documents\nhave been reviewed by the Advisory Committee. Also included in this\nmailing is a press release, dated December 3, 1958. Although some¬\nwhat dated, this contains pertinent information regarding the organi¬\nzation of the New Educational Media Program and the names of the\nmembers of the Advisory Committee.\nWe feel very keenly the urgency of getting information to the\nfield. For this reason, we are indebted to the many organizations\nand individuals who have assisted in distributing information which\nhas been available thus far. We are also grateful to many colleagues\nin the field for raising questions and suggesting needed information.\nWe hope the accompanying attachments will be helpful.\nEnclosures\n1-59\nKenneth D. Norberg\nProgram Consultant\nNew Educational Media"
}