{
  "id": "d283-121",
  "text": "2\n9* Will any Title VII funds be granted for the purchase of equipment\nor production of new materials?\nAns. - Under certain conditions, limited funds may be allowed\nfor the purchase of special equipment or the production\nof new types of materials on a pilot run basis where such\nexpenditures are necessary and integral to the completion\nof significant research or experimentation. However,\nTitle VII funds will not be provided for capital outlay\nexpenditures, nor for the purchase of equipment that\nwould normally outlast the experiment or be used for\npurposes other than experimentation.\n10. How soon will regulations be published?\nAns. - It is anticipated that a statement of policy and regula¬\ntions governing the Title VII Program will be issued in\nJanuary 1959.\n11. What information will be published regarding proposals submitted?\nAns. - It is planned to issue a list of proposals approved\nfollowing each Committee meeting.\n12. Will any listing be published for proposals received, but not\napproved?\nAns. - It is not anticipated that any listing of proposals not\napproved by the Committee will be issued.\n13. What deadlines have been established for submitting proposals?\nAns. - Proposals may be submitted at any time. In order to be\nplaced on the agenda for any given meeting of the\nAdvisory Committee, proposals must arrive at the Office\nof Education six weeks in advance to allow for preliminary\nprocessing. Deadlines set for the current fiscal year\nare February 1 and April 1, 1959*\n14. How does Title VII provide for dissemination of information on\nthe New Educational Media?\nAns. - Part B of Title VII charges the U. S. Commissioner of\nEducation with responsibility for making studies and surveys\nto determine information needs; for preparing and pub¬\nlishing catalogs, reviews, abstracts, etc.; providing\nnecessary advice, technical assistance, and demonstrations\nto State or local educational agencies and institutions of\nhigher education undertaking to use the new media for\neducational purposes."
}