{
  "id": "d283-3",
  "text": "1* All local arrangements shall be made by the Convention\nCommittee but such arrangements shall be subject to\nthe approval of NABB Geadquarters.\nZ0 Convention program arrangements shall be made by the\nNABB Headquarters staff»\nSo All printing and mailings shall bo handled by the NABB\nHeadquarters staff*\nThis proposal was approved unanimously* Harley made the motion -\nSohenkkan seconded*\n12. Report of Secretary*\n\"The Secretary of tho National Association of Educational\nBroadcasters has attended all meetings of the Association and\nits Board of Directors and submitted minutes thereof to the\nBoard of Directors for approval.\nOn two occasions the Secretary represented NAEB upon the\nrequest of headquarters, on behalf of the President. These\nmeetings were a workshop session at Florida State University,\nTallahassee, Florida, and the Conference for World Literacy at\nMemphis, Tennessee.\nAll matters pertaining to this office are in order as of\nthis date.\"\nHarley moved adoption of the report with a second by Broderick®\nMotion carried.\n13* Report of Citations Committee^ The Awards and Citations Com-\nmlttee report recommended that citations be presented to\nFranklin Deaham, Chief, Educational Uses of Radio - Television,\nof the U. S. Department of Health, Education and Welfare, Office\nof Education, and the firm of Cohn and Marks, legal consultants\nfor the National Association of Educational Broadcasters, who\nhave consistently provided a significant service to Educational\nBroadcasting. Coleman moved acceptance of the report and Harley\nseconded. The motion was carried. (In the absence of the chair¬\nman of the Awards and Citations Committee, Miss Judith Waller9\nHarold B. MoGarty presented the citations at the annual NAEB\nbanquet in typical McCarty style.)\n14* Report on Nominations for Directors of Regions II, IV, and VI,\n^esTdeivI; Sofooley reported on malT nom~\ninailons oi* places to be filled on the Board of Directors in\naccordance with provisions of the Constitution and By-laws.\nThe following were nominated in the areas concerned®\nRegion II Lee Franks\nRaymond Hurlbert\nKeith Nighbert"
}