{
  "id": "d283-57",
  "text": "7\neducation journals and the publications of the various educational associations\nof the U. S., such as the NEA, the AACTE, the ACE and the AASA.\nVI. Personnels A Training (or Workshop) Director, with experience in the\nplanning and conduct of workshops, will be employed to direct this project.\nIn addition, an assistant.will be employed, as will a person with editorial\nexperience (preferably combined with research background) to edit the workshop\nreports, and secretarial assistance. It is impossible at this time to give\nthe names of specific individuals because it is neither possible nor txroper\nto discuss employment with prospects when it has not yet been determined that\na grant will be received. It is our belief that these people could be employed\nand on the job within 60 to 90 days after receipt of the grant. The project\npersonnel will be assisted by the MSB Headquarters staff and the NAEB Utiliza¬\ntion and Professional Advancement committees which have been instrumental in\nplanning and carrying out the Association's earlier professional advancement\nactivities (as enumerated in section VII).\nifecilities. The National Association of Educational Broadcasters is\neminently qualified to administer a project of this nature. The Association\nhas been extremely active in professional advancement activities in the educa¬\ntional broadcasting field* In addition to those discussed in section TV above,\nthe NAEB has conducted 21 seminars and workshops, since 1949, for educational\nbroadcasting personnel, teachers, etc. The Association has also awarded over\n100 scholarships to permit such individuals to pursue an independent course of\nstudy in the broadcasting field or fields relating to it. During the last\nthree years grants-in-aid have been made to several institutions to permit\nthem to upgrade the caliber of their own broadcasting workshops and som roars,\nand to stimulate the development of courses in educational uses of television\nFunds for continuance of such activities, are now :\\c longer available*\nHowever., inis experience has enabled the NAEB to establish good relations"
}