{
  "id": "d283-8",
  "text": "Item 5 - To provide for a new o&tsgory of membership to he known as\nTnSua^ial Associate, :\n71 * For 4 m. Against CARRIED\nItem 4A - To clarify wording to indicate that representatives of\nActiw members may act in matters pertaining to \"the business of tio\nAssociation,11 rather than the present wording which indicates the/\nmaj not in \"matters pertaining to the mutual welfare of the Member\nand the Association*1*\n75 ~ For 2 - Against CARRIED\nItem 4B - Same as 4A* except that this amendment pertains to Associates*\nOn this item one ballot* representing osut vote* was left blank*)\n72 - For 2 - Against CARRIED\nItem 4'C - Sam© as 4A* except that this amendment pertains to Affiliates*\n0x2 this item on© ballot, representing one vote, was left blank*)\n72 - For 2 ** Against CARRIED\nItem 5A - To permit any staff member of an Active or Associate member\nTolfoXd office in the Association* Present wording indicates that\nonly the duly designated representative of the member should hold\noffice. (NOTE - On this item one ballot, representing two votes, was\nleft blank.)\n69 - For 4 - Against CARRIED\n/\nItem 6 - To clarify the present, somewhat garbled, wording specifying\nl^iT^cTutiea of the President*\n76 - For 0 - Against CARRIED\nItem 7 * To provide that the Vice-President shall serve as chief\naSSSSTstrative officer of the Association in any interim period be-\ntween the time a vacancy night occur in the office of President and\nthe time a new President is duly selected.\n70 - For 5 - Against CARRIED\nItem 8 - To provide fbr three Vice-Presidents*\n52 - For 23 « Against CARRIED\nItem 9 - To provide for a change in the method of selecting Convention\nITl^esT .Amend* fil would leave unchanged the present section (which\nindicates that Conventions shall be held in the Mid-Vfost two of ©very\nthree years with the Convention in the third year being held, in ro¬\ntation* in the West, the Fust and the South} except to delete specific\nreference to which states comprise tfco Mid-Best* Amend. $2 would pro¬\nvide for holding the Convention in the Mid-West in odd-numbered years"
}