{
  "id": "d283-96",
  "text": "-8-\nsimilar groups, to insure responsible educational standards] jaaff insure\nagainst any unilateral projects which might dislocate responsible efforts\nalready being made by other groups] and to avoid steps which might crystallize\nopposition to the uses of, or the development of training in the uses of,\nthese new electronic media* It was felt desirable to eeoure the reactions\nof the Deans of Education, or the responsible heads of teacher-training\ninstitutions which might he called upon to cooperate with the KABB in this\nnationwide pilot project. Which we hoped would set standards for courses\nin hundreds of such institutions within the next ten years*\nAt the time of this early December meeting, it was the\nconsensus that the HAEB sheK. Kellogg Foundation, with its\nbackground in the broad educational area, convene a small meeting of\nselected Deans and others who would be involved, to discuss with representa¬\ntives of the Foundation and the NAEB the full implications of this project,\nincluding its acceptability and the various pitfalls which it should avoid.\nAs an alternative to this step, if the W. K. Kellogg Foundation preferred^\nthe NAEB would itself seek to secure (possibly from the Foundation) funds\nto hold such a meeting, with representatives of the Foundation and distin¬\nguished educational leaders, of the typo described above, to serve the same\npurpose* The meeting described would precede grant consideration by$e\nFoundation, and would go over the proposal step by stop to insure maximum\nlikelihood of success.\nHowever, in view of tbs time which has been required to bring\nthis project to its present state* tie suggestion by Dr. Seay of the\nFoundation that it should be submitted by ^>prcximste2y February lj and\nthe favorable reactions received to date to our proposal from the various\nresponsible educational leaders to whom it has been submitted, it is our\ndueling that, if necessary, it could be submitted without waiting tov the"
}