{
  "id": "d1096-11",
  "text": "■12-\nRADIO SCHOLARSHIPS SET UP IN SOUTH DAKOTA\nAn award of $100 to be used as a scholarship in the radio department has been made\nto the University of South Dakota by state health organizations.\nThe scholarship, which was set up to encourage high school seniors to enter the field\nof radio and television at the University, will be awarded in late June, according to\nKeith J. Nighbert, director of the department of radio at the University.\nAwarded on the basis of academic standing, speech and writing activities, character,\nand financial need, the tuition scholarship will be given to a South Dakota high\nschool senior wishing to major in the four year course in radio at the University.\nA scholarship committee composed of members of the health organizations will make\nthe decision as to the scholarship recipient.\nThose making the scholarship include the following South Dakota associations:\nTuberculosis; Mental Health; Dental; and Medical. The South Dakota departments\ncontributing include: Public Instruction; Vocational Rehabilitation; and Health.\nOthers contributing to the fund are: the South Dakota Division of the American Can¬\ncer Society; the National Foundation for Infantile Paralysis; the State Mental hospi¬\ntal; the Office of Civilian Defense; the South Dakota Society for Crippled Children;\nthe University School of Medicine; and Robert Dean, manager KOTA, Rapid City.\nBANK USES TV TO MATCH SIGNATURES AT A DISTANCE'\nA private television link enabling Glyn Mills & Co., a London bank to compare signa¬\ntures on checks instantaneously with authenticated specimens in its archives twelve\nmiles out in the countryside had its first public demonstration on April 22. The\nbank moved its records from London during the war.\nThe television device gave a clear image of checks, contracts and deeds on a screen\nabout three by five inches. Its receiver took up only a small space on a bank\nclerk's desk. From time to time the image was enlarged to show details. The\narchivest was informed by telephone of the documents wanted. The British postal\nauthorities who control wave lengths authorized a narrow beam for the bank. The\nmanufacturer said it would be virtually impossible for anyone else to poach on any\nsecrets during transmission.\nInstallation is still experimental.\nPHILADELPHIA SCHOOLS IN-TRAINING RADIQ-TV COURSE\nThe Philadelphia public schools have scheduled radio and television workshops for\ntheir teachers during June and July. With the objective of demonstrating the plan¬\nning, production and use of radio and television for educational purposes, the radio\nworkshop is scheduled from June 27 through July 15, and the television session from\nJuly 16 through 31. The staff will consist of the following Philadelphia schools'\nfaculty: Bess Barg; Kathryn Bovaird; Josephine D'Onofrio; Abner Miller; Gertrude\nNovokovsky; Virginia Sheller, and Martha Gable."
}