{
  "id": "d1096-16",
  "text": "-XT-\nCLOSED CIRCUIT COLOR TELEVISION IN SURGERY\nA Report Prepared by-\nBurton Paulu\nUniversity of Minnesota--Minneapolis\nThe News-Letter editor recently spent two very.interesting days at the University of\n'“Kansas as guest of Ed Browne, director of Radio and Television at that NAEB member\ninstitution. High point of the visit was the half day spent in the University of\nKansas medical center in Kansas City where, with Dr. Paul Shafer, Dean of the Univer¬\nsity of Kansas medical school as guide, he inspected the closed circuit color tele¬\nvision installation in their hospital. What follows is strictly a layman's account\nof what he saw.\nFacilities Described\nThe heart of the installation is the one camera mounted directly above the operating\ntable in one of the medical center's operating rooms and the small adjacent control\nroom. For viewing there is one receiver in a classroom seating twenty students, to¬\ngether with three other receivers which can be placed in either of two small audi¬\ntoriums for larger groups. The accompanying sound system makes it possible for the\noperating surgeon, the control operator and the viewing groups to communicate with\neach other while operations are in progress. Before long another television set and\ntwo-way sound system will be set up in the office section of the surgery department\npermitting easy and quick conferences between the operating surgeon and other members\nof the hospital staff.\nThe television engineer can adjust the camera's position and focus from the control\nroom, and can also select which of the two lenses is to be used. (The camera, how¬\never, is sufficiently above the table so as to be out of the surgeon's way at all •\ntimes.) The lighting used for the operation is sufficient for good television re¬\nproduction.\nCBS Color Used\nThe viewing screen very satisfactorily reproduces the operation in progress. In\nfact, a comparison of the view of the operating table through the control room win¬\ndow with the picture on the screen leaves no doubt of the great superiority of the\ntelevision picture over .such direct-viewing as can be done from the cat-walk- orig¬\ninally provided for medical students when the hospital was first built. The CBS\ncolor used is very satisfactory. Dr. Shafer reports, although the monochrome system\noriginally tried gave inadequate definition.\nTo this editor’s unpracticed eye the two operations observed were reproduced with\nexcellent fidelity. On the only previous occasion he had been in a hospital operat¬\ning room when an operation was in progress, the editor himself was the patient—end\nvery much asleep; so all this proved a new and fascinating experience. The teaching\npossibilities of such an arrangement are clear: in addition to seeing so clearly,\none can hear the surgeon comment on the operation as it proceeds; the doctor can talk\nto the listening students as he works, pointing out the problem of the mdmerit and\nexplaining how to deal with it; and the students can view the operation alohg with a\nstaff member who can make additional Comments. The operating surgeon can also\nsolicit advice from other members of the staff if he so desires."
}