{
  "id": "d1096-17",
  "text": "-13-\nExpansion of Facilities Planned\nDr. Shafer, the enthusiastic young (under 40) Dean of medical sciences at KU—himself\na noted heart surgeon—handles television's technical terms better than do most\nbroadcasters as he describes the installation and outlines plans for its future. He\nwould like additional cameras in operating rooms plus portable cameras for use in\ndiagnosis and other non-surgical situations. He also wants micro-wave relay links\nbetween this and other hospitals in Kansas City as well as with the University's main\ncampus in Lawrence some forty miles away.\nOther points at random: the operating surgeons have taken to television in a big\nway and find it to their liking; the students prefer screened operations to watching\nin old-style amphitheaters; the simultaneous viewing of operations interests the stu¬\ndents much more than do films even though the films may be more perfect technically\n—and for the same reason the at-home audience prefers like television to kine:\nthere's always the chance for a fluff (or should we say, a slip?) on a live show;\nthe patients--who sign a release before going on TV--seem to like it too, and are\nsometimes disappointed when their surgery is done without benefit of camera.\nOther TV Developments in Kansas\nThe editor also spent a day and a half as Browne's guest on the main campus of the\nUniversity in Lawrence. Shortly KU's FM station will take to the air from attractive\nnew studios. Television planning at KU is in a very active stage, and the institu¬\ntion's Chancellor and many staff members are earnestly exploring the potentialities\nof on-the-air television.\nTHE NAEB TAPE NETWORK\nPrepared by Richard Rider\nNAEB Tape Network Manager\nUniversity of Illinois, Urbana\nGENERAL STATEMENT\nThe tape network has made much progress during the past year. However its full\npotential will not be realized for at least another year. The addition of adequate\nequipment, the inception of planned program production, the refinement of program\npolicies, the planning of the school programs committee, and the experience of a\nyear's operation with some financial support will yield a vastly improved service.\nThe network has safely survived the first shocks in the road to self-support.\nThere has been no significant loss in participation because of the levying of\nannual assessment fees. Recently, in fact, we have experienced considerable\ninterest from prospective members. We have continued to grow.\nIn short we have just broken the ground. Perhaps we have even harrowed a bit. The\nreal harvest, however, still lies ahead."
}