{
  "id": "d1096-19",
  "text": "-20-\nRESEARCH REPORT\nby Dallas Smythe\nNAEB Director of Studies\nUniversity of Illinois, Urbana\nWHAT TV PROGRAMMING IS LIKE*\nI should like to approach this problem as a social scientist. My first obligation\ntherefore is to state my basic assumptions.\nTwo Basic Assumptions\nThe first of these is that the broadcasting industry as a whole—including its\nsponsors, is responsible for the indirect social consequences of its over-all program\npolicy. This is a responsibility over and above its more readily reassured responsi¬\nbility to its owners to operate profitably. This principle has these three sub¬\nprinciples: (1) The broadcasting industry Is fairly to be held accountable for\nrecognizing, and serving the unique needs of the many minority audiences which go to\nmake up the total audience for TV, and especially the needs of large minority audi¬\nences such as those of children and housewives. (2) It may be held accountable for\nusing local program talent and resources, including the abilities of the station\nmanagement as innovators of programs. (3) The industry is responsible for limiting\nthe extent of advertising.\nThe second assumption relates to society as a whole: our society has a responsi¬\nbility, acting through Congress and its administrative agencies, to provide an edu¬\ncation of its young which passes on to them the enduring cultural values of the past\nand which equips them to cope, with the best chance of wise decision making, with the\nproblems their generations must face. The possible sub-principles under this head\nare legion, but here are several of the more obvious. First, there is the responsi¬\nbility of all our means of communications — including within this term the mass\nmedia as well as the educational institutions of the country — to maintain and to\nserve the Miltonian concept of the free market place of ideas. Second, there is the\nresponsibility which we have traditionally placed on our educational institutions to\ntransmit from one generation to the next and to nourish those valuable portions of\nour culture which lack aggressive commercial exponents. And third, there is what we\nmight call the \"nothing is too good for the American child\" tradition. By this I\nmean the tradition of pride in our educational system. We want the best there is, —\nof health, food, clothes, recreation and education -- for our children. If televi¬\nsion is so superb an instrument for communicating with children and their parents in\nthe home (and I am sure it is), then how do we proceed to guarantee the use of TV\nfacilities by our educational system?\nFour Monitoring Studies Described\nThe first NAEB monitoring study was supported by the Joint Committee for Educational\nTelevision. Later studies were financed by the Fund for Adult Education of the Ford\nFoundation, The NAEB has brought to these studies the best professional skills\navailable. We obtained the advice of experts in content analysis from such univer¬\nsities as Columbia, Chicago, Illinois, Michigan, Ohio State, UCLA and USC, to single\nout the principal institutions involved.\n*This month’s Research Report is an adaptation made by the News-Letter editor of the\ntalk given by.Dallas Smythe before the Institute for Education by Radio-Television on\nApril 17, 1952. Space limitations have required the editor to abbreviate and rewrite\nmuch of the original text."
}