{
  "id": "d1096-3",
  "text": "-4-\nNetworks Now Earning More From TV Than From Radio\n\"Last year, with only 14/000,000 sets in existence and only 108 stations in opera¬\ntion, the television industry had an income -- before Federal taxes --of more than\n$43,000,000. The 93 independent stations retained 30 cents in income (before Federal\ntaxes) on each dollar of revenue. The networks derived a greater proportion of their\nrevenues from the newly-established television than they did from their 30~year-old\nAM radio.\n\"You must explain the need for action to your boards of education, to your boards of\ntrustees, and to your state legislatures.\n\"Do not neglect sources of endowment. In this connection, I was interested in a news\nreport of yesterday. It was announced that an alumnus had willed his alma mater a\nbequest appraised at $9,000,000. I will not identify this educational institution\nbeyond noting that it is a leading state university which has expressed more than\npassing interest in non-commercial educational television -- and that it is located\nin the capital of an up-and-coming midwestern state.\nDo Not Lose These Reservations \"By Default\"\n\"Do not, I beg of you, let these reservations of 1952 go by default. Exercise your\nknowledge, your courage and initiative to persuade your authorities of the serious¬\nness of this situation. They must not be penny-wise and pound-foolish or they, too,\nwill be haunted by their negligence.\n\"On the other hand, if the utilization of these valuable assignments for education\nis furthered with the same zeal and foresight demonstrated by you in your efforts to\nobtain the assignments, I have every confidence that education will both keep its\nassignments, and contribute immeasurably to the well-being of the American people\nthrough television.\n\"I hope with all my heart that you who have fought so brilliantly for the 242 educa¬\ntional television assignments now reserved will rally your forces this afternoon to\nfight on to preserve the victory you have so nobly won.\"\nNAEB BOARD OF DIRECTORS MEETS AT COLUMBUS\nThe NAEB Executive Committee and Board of Directors held meetings in connection with\nthe Columbus Institute for Education by Radio-Television. Among the principal busi¬\nness transacted was a review of NAEB activities during the. period since the Board's\nlast meeting in January and the extension of the appointment of James Miles as\nExecutive Director for a second year.\nPublic School Broadcasting Seminar Set Up\nThe Board approved the holding of a seminar on public school broadcasting problems at\nthe University of Illinois' Allerton House from June 15 through 25, and voted $5000\nof Kellogg project funds to cover its cost. It was agreed that seminar members\nshould be chosen from the following groups in the priority order indicated: NAEB\nschool stations; non-NAEB school stations; school of the air personnel from NAEB\ncollege stations not represented at either of the earlier Allerton House meetings;\nand school of the air personnel from NAEB college stations which were represented\nat either of these meetings.\nFurther information about the seminar will be issued from NAEB Headquarters in the\nnear future."
}