{
  "id": "d1096-4",
  "text": "-5-\nMiles Appointment Extended\nThe Board of Directors voted to extend the appointment of James Miles as Executive\nDirector for one year. Since Miles’ present appointment expires August 31, 1952, the\nnew action therefore will assure continuity in the position of Executive Director\nuntil August 31, 1953*\nStatus of Executive Committee Defined\n^The great increase in NAEB activities resulting from the several grants made to the\norganization during the past year has required the setting up of an Executive Com¬\nmittee made up of the four elected officers* This group has been meeting monthly\nsince the Biloxi convention. In order to more clearly define the powers and duties\nof this committee the Board passed the following resolution:\n\"Since the Board of Directors is empowered by the National Association of Educational\nBroadcasters' by-laws to direct its officers to do all things necessary to carry out\nBoard policies; therefore,\n\"Be it resolved by the Board of Directors, that, when the board is not in session,\nthe Executive Committee - consisting of the President (chairman), Vice-President,\nSecretary and Treasurer - shall have the management and control of the Association,\nand of its affairs, and for that purpose shall have and exercise all the powers\nnecessary and proper for such object, except insofar as the Board may reserve such\npowers to itself. The Board may at its pleasure revoke any powers granted at any\ntime to the Executive Committee.\n\"The Board of Directors sets certain limitations on the powers of the Executive\nCommittee:\n\"Section 1. Said Executive Committee shall meet whenever the chairman, or three mem¬\nbers thereof, shall find it necessary for the transaction of any business which is\nurgent and cannot be postponed to a regular meeting of the Board.\n\"Section 2. Said Executive Committee shall possess all the powers of the Board when\nin session, provided that it shall not overrule, revise, or change the previous acts\nof the Board, or take from regular or special committees any business referred to\nthem by the Board. The Executive Committee shall not have power to lease, sell or\npurchase real estate unless previously authorized by the Board in session or a\nmajority of the members individually in writing.\n\"Section 3* The Executive Committee shall make a record in writing of all its trans¬\nactions and submit it to the Board at its next regular meeting, signed by all the\nmembers agreeing thereto. Such a record shall thereupon be incorporated in the\nMinutes of the Board as an integral part thereof.\n\"Within these limitations, the actions of the Executive Committee are final.\"\nNew Members Approved\nThe following institutions were accepted as active members: The University of\nMassachusetts, Amherst, Massachusetts; San Diego City Schools, San Diego, California;\nUniversity of North Carolina, Chapel Hill, North Carolina; And Wayne University,\nDetroit, Michigan. The following were accepted as Associate Members: Loyola\nUniversity, Chicago; Akron (Ohio) Schools; Central Michigan College of Education,\nMount Pleasant; Marshall College, Huntington, West Virginia; and South Dakota State\nCollege of Agriculture and Mechanics Arts, Brookings."
}