{
  "id": "d1096-6",
  "text": "-7-\nCommissioner Webster on International Frequencies\nThe \"large and powerful nations\" must accept their responsibilities before the\n\"chaotic condition\" of international broadcasting can be improved, said FCC Commis¬\nsioner Edward M. Webster addressing an Institute work-study group session devoted to\n\"Broadcasting to Foreign Countries.\"\nCommissioner Webster said that the \"planned use of international broadcasting fre¬\nquencies to avoid interference with other countries\" had become inoperative by 19%\n^-because the number of international stations throughout the world had increased to\n\"fantastic proportions.\" He outlined the successes and failures of a series of\ninternational conferences called since World War II to examine the problem. These\nconferences met in Atlantic City in 1947; Mexico City in 1948; Paris in 1949;\nRapallo, Italy, in 1950; and Geneva in 1951*\nInternational broadcasting was in a \"rather restricted and chaotic condition\" in 1947,\nhe said, and today \"might even be considered worsened.\" This is no reflection on the\nconferences in Mr. Webster's opinion, but is \"due, among other things, to the fact\nthat ... frequency demands of virtually all nations have far exceeded the spectrum\narea available ... and the countries thus far appear to have been unable collectively\nto tailor their demands to the restricted space.\"\nGreatest single achievement of the series of conferences, he said, is the realization\nby most nations that \"chaos cannot and will not give way to order until a single in¬\nternational organization is empowered to plan individual station assignments on an\ninternational basis.\"\nMr. Webster does not expect a satisfactory solution to the problem \"in the near\nfuture\" because the Atlantic City frequency agreement was set up as a peacetime meas¬\nure not intended to \"provide for the international broadcasting requirements of a\ndeeply troubled world using high frequencies as a means of engaging in a heated\npropaganda battle.\"\nThe large and powerful nations have had to assume world leadership in radio, he said,\nwhere technical knowledge is of prime importance. \"However, they appear reluctant,\"\nhe added,- \"to accept the responsibilities that go with leadership. In my opinion, it\nis the obligation and the duty of the powerful nations to set the pattern in this\nconnection and see to it that the high frequency broadcasting problem is equitably\nresolved.\"\nMusic Still a Radio Staple Says Walberg Brown\nSerious music can compete effectively with other programs for radio listeners,\nWalberg Brown, general manager of WDOK, Cleveland, said in a talk on \"Serious Music\nProgramming.\"\nBrown described WDOK's \"Afternoon Concert,\" an hour-long daily recorded program of\nserious music which, he said, \"as our answer to the network soap operas, and the\nlocal disc jockeys,...collects all those listeners who do not care for these stand¬\nbys of daytime radio.\"\nA pulse survey conducted in Cleveland in October and November 1951.showed \"Afternoon\nConcert\" tied with the NBC station for the fourth largest audience of the city's\neight radio stations at 1 p.m. daily, he said. Brown said that \"we aren't naive\nenough to think our classics will ever attract more of the public than 'Young Dr.\nMalone' or 'Ma Perkins.' We are pleased to note, however, that our 'Afternoon Con¬\ncert' has already topped the disc jockeys competing with it for the audience 1-1:30\neach afternoon. In other words, we have proven it to be a strong and effective\n'local' daytime device for winning friends and gaining listeners to WDOK.\""
}