{
  "id": "d1096-7",
  "text": "-8-\nInternational Broadcasting Research\nInternational communications research is a new field requiring a combination of skills\nrarely found in one individual, Leo Lowenthal, chief of the Radio Program Evaluation\nDivision of the Office of International Broadcasting, Department of State, in New\nYork, told an Institute special interest group on \"Communications Research.\"\nLowenthal described field studies conducted in the Near East where he said the Voice\nof America commands a faithful regularly listening native audience. The studies, he\nsaid, posed a number of difficult questions concerning national attitudes toward such\nmatters as broadcasts of readings from the Koran, overtly political programs and\n\"propaganda.\"\nThe mere posing of these questions, he said, suggests the over-all problem. Valid\nanswers to such questions can be provided, according to Lowenthal, only by a combina¬\ntion of a thorough knowledge of cultural psychology, and a body of opinions drawn\nfrom a wide and representative national sample. The two requirements are interlocked,\nhe said--the opinions must be obtained by some process which is not culturally offen¬\nsive, and culture-bound meanings of the opinions must be made manifest to the com.-,\nmunicators of Western Culture.\nLowenthal observed that the individual capable of performing the research apparently\nwould have to be a cultural anthropologist who has specialized in Near Eastern soci¬\neties, who is semantically adept in the local languages, who is furthermore a\nspecialist in public opinion measurement, and who is trained in experimental design\nand ingenious at adapting scientific techniques to use under new and trying condi¬\ntions .\nCech Reports on Teaching by Television\nA program series believed to have been the largest single \"teaching-by-television\"\nproject ever attempted by a single station was described by Richard Cech, of Ames,\nIowa. Cech, production director of the U.S. Department of Agriculture’s television\nresearch project at Iowa State College, who spoke before an Institute work-study\ngroup session on \"Agriculture Telecasts.\"\nThe teaching series was aired in February over WOI-TV at Iowa State, in cooperation\nwith the Agricultural Extension Service there. It included 10 half-hour films, pro¬\nduced specifically for television and showing all details of making a dress, from\nselection of pattern, measurements, and sewing procedures to modeling.\nCech said some 3,000 Iowa women, urban and rural, enrolled in the course and con¬\nstructed garments according to the semi-weekly TV lessons. At the end of the series,\nsome IT women selected from WOI-TV’s primary coverage area modeled their dresses in a\nlive program and discussed features of the \"Make-A-Dress\" TV project. A follow-up\nsurvey now is under way, he said, to determine audience reaction. Preliminary re¬\nports indicate an audience of 20,000 women, according to Cech.\nHe said that television authorities at Iowa State, and educational authorities also,\nbelieve the success of the project presages ultimate large-scale attempts to direct\nboth general and specific educational lessons and projects to the TV audience,\nparticularly in the field of agriculture and home economics."
}