{
  "id": "d893-117",
  "text": "time this year. Other millions need to be reminded to\nfile their returns before the March 15th deadline.\nTax-filing this year is expected to set a brand-new\nrecord of 55 million returns. Accordingly, the Bureau\nof Internal Revenue again requests the assistance of\nall radio stations in reminding taxpayers to file. Sug¬\ngested short announcements have been mailed to all\nstations by the Bureau.\nAd Council Network Campaigns Are Listed\nThe following public interest campaigns have been\ngiven top priority on network and national spot allo¬\ncation plans during the week of March 15-21, 1948,\nby The Advertising Council. Copies of individual fact\nsheets and schedules showing exactly what messages\nwill be carried daily by the programs of the network\nwith which your station is affiliated may be obtained\non request from George P. Ludlam, radio director,\nThe Advertising Council, 11 West 42nd Street, New\nYork 18, New York.\n1948 Red Cross Fund-March 1-31\nMarch is the month for the annual fund drive of the\nAmerican Red Cross. To finance this year’s expanded pro¬\ngram a goal of 75 million dollars has been set. . . . The\nRed Cross reaches into every community in this country,\nas well as overseas wherever American troops are sta¬\ntioned. It has continuing responsibility, under its con¬\ngressional charter, for disaster relief and rehabilitation;\nit maintains an extensive program for U. S. servicemen\nhere and abroad and for veterans of all this nation’s wars.\nIt must continue its health and safety programs, Volunteer\nServices and the Junior Red Cross whose value has been\ndemonstrated in peace and war. In addition, the Red\nCross this year embarks on a huge new project: the Na¬\ntional Blood Program to provide blood and blood deriva¬\ntives, without charge for the products, to the entire nation.\nThe American Red Cross depends on the public for its\nsupport. With the Red Cross back on a peacetime basis,\nthe people will want to know the reasons for the 75 mil¬\nlion dollar goal for 1948. The answer lies in the magni¬\ntude of the Red Cross program. To insure success of the\ndrive, the work of the Red Cross and the “WHY” of its\nmajor types of service must be explained. 1. DISASTER\nSERVICE. When disaster in any form strikes a com¬\nmunity in the nation, or its possessions, the Red Cross\ngoes into action at once to provide the basic needs of\nshelter, food, clothing and medical care. After the emer¬\ngency is over Red Cross assists in rehabilitation of victims\nneeding further help, by repairing and rebuilding homes,\nsupplying household furniture and equipment, providing\nlong-term medical and nursing care. Catastrophes in 1947\nseriously depleted Red Cross disaster funds. These must\nbe replenished. 2. THE NATIONAL BLOOD PROGRAM.\nThe use of blood and plasma during World War II proved\nconclusively the vital importance of blood in saving lives\nand combating disease. Modern medical treatment de¬\npends to a great degree on ready availability of adequate\nsupplies of blood and blood derivatives. The National\nBlood Program of the American Red Cross is being or¬\nganized to provide sufficient quantities of these, without\ncharge for the products, to the entire nation. 3. SERVICE\nFOR VETERANS, (a) In Veterans Hospitals a paid\nstaff is assigned to coordinate and promote the work of\nRed Cross volunteers in serving hospitalized veterans,\n(b) Red Cross Claims Service, another major service\nfor veterans, operates at points of separation where\nARC field directors assist men and women in filing\nclaims; in Red Cross chapters where Home Service\nworkers assist veterans and dependents of deceased vet¬\nerans; and in every regional and branch office of the\nVeterans Administration, and in its central office, where\nfield directors represent claimants before VA officials, (c)\nThe Home Service program provides assistance for service¬\nmen, veterans and their dependents. 4. SERVICES TO\nTHE ARMED FORCES, (a) Camp Service has its field\ndirectors wherever American forces are stationed to help\nwith personal and family problems of servicemen and to\nbring them into closer contact with civilian life, (b) Hos¬\npital Service covers the social services provided by Red\nCross in military and naval hospitals, at the request of the\nSurgeons General, to supplement the care given by medical\nofficers. 5. SERVICES TO THE COMMUNITY. (A)\nNursing services; (B) Nutrition service; (C) Safety serv¬\nices, (D) Volunteer special services. Urge listeners to\ngive generously. It is their Red Cross . . . they are the\nRed Cross . . . serving humanity through their contribu¬\ntions. . . . (Fact Sheet No. 14-B)\nOur American Heritage—“Freedom Is\nEverybody’s lob!”\nToday, many nations stand at the crossroads between\nfree government and dictatorship. In numerous places the\nodds are heavily against freedom. Exhausted and un¬\nnerved by want and insecurity, millions have lost the\nimpulse, incentive and hope for liberty. In despair, the\nindividual has become willing to give himself up to\nmechanisms of political power over which he has no\ncontrol. Those who still aspire to political, economic and\nreligious freedom look to America as a beacon and as an\nexample. Therefore, what Americans do during the\nmonths ahead can greatly influence the decision that the\nwar-exhausted peoples will make. That their decision\nshould be in favor of freedom is of the utmost importance\nto us. Since we cannot escape being affected by what\nhappens in other parts of the world, our own future lies\nin the balance. We must face the fact that should the\nUnited States become one of a very few islands of free\ngovernment in a world of dictatorships, our own rights\nand liberties would be seriously endangered. The survival\nof freedom as we know it thus depends on our providing\nan example of the superiority of free government. To\ndo this we must make our form of government work better\nthan it ever has before—and this depends on raising the\nlevel of active citizenship in the United States. 1. Make\nevery American aware of—and determined to defend—the\nindividual rights and liberties he enjoys in the United\nStates. The Bill of Rights section of the United States\nConstitution protects his freedom of speech and press;\nhis right to assemble and to petition the government; his\nright to be secure in his person and property against un¬\nlawful searches and seizures; his right to speedy trial\nby jury, etc. 2. Arouse his pride in the past of his country\nas the land of the free which has achieved the most com¬\nplete expression of individual liberties, civil rights and\npersonal dignity—pride in the American men and women\nwho shed their blood for liberty—make him think of this\nas the Year of Rededication. 3. Inspire a more active\nparticipation by all citizens in the processes of free gov¬\nernment, in the nation, state and community—and in\nevery group activity—so that our heritage of liberty may\nbe the code of our daily conduct. Freedom demands that\neach of us carry out to his fullest ability his duties as a\ncitizen: to vote in an informed way so that the best man\nis placed in public office; to serve on juries, since only\nby such service can the right to trial by jury be main¬\ntained; to take an interest in public issues and participate\nin community, state and national affairs, such as school\nboards, primaries, etc. 4. Lead him to recognize that we\nhave an obligation to the world to maintain our free in¬\nstitutions. By making our form of government work\nbetter here, we strengthen democracy everywhere—\nthrough providing an example of a free government pre¬\nserving the rights and dignity of the individual. This\nAmerican Heritage campaign is taking place during the\nYear of Rededication sponsored by the American Heritage\nFoundation, which is signalized by the visits of the Free¬\ndom Train to cities throughout the United States and the\nlocal observance of Rededication Weeks. The slogan of\nthe campaigns is “Freedom Is Everybody’s Job!” (Fact\nSheet No. 40-A)\nMARCH 8, 1948-187"
}