{
  "id": "d893-121",
  "text": "Surety Broadcasting Co., Charlotte, N. C.—Dismissed as\nmoot petition for continuance of hearing in re application\nfor CP. (BP-6088)\nAmerican-Republican, Inc., Waterbury, Conn.—Granted\npetition to dismiss without prejudice its application for CP.\n(BPCT-280; Docket 8775)\nCorn Palace City Radio Corp., Mitchell, S. D.—Granted\npetition for leave to amend application for CP to specify a\ndifferent daytime DA system and change technical data\ncorollary thereto; accepted said amendment. (BP-5742;\nDocket 8195)\nBlackhawk Broadcasting Co., Sterling, Ill.; WTAX—\nWTAX, Inc., Springfield, Ill.—Continued consolidated hear¬\ning on applications (BP-5409, Docket 8179; BP-5588, Docket\n8180) to March 18, 1948.\nKTKC—Tulare-Kings Counties Radio Associates, Visalia,\nCalif.; KFRE—J. E. Rodman, Fresno, Calif.—Granted peti¬\ntion for continuance of hearing on applications (BP-3909,\nDocket 760L and BP-3757, Docket 7125) ; continued hearing\nto May 6, 1948.\nKOY—Salt River Valley Broadcasting Co., Phoenix, Ariz.\n—Granted petition for continuance of hearing on application\n(BP-5733; Docket 8480) ; continued hearing to March 23,\n1948.\nAri-Ne-Mex Broadcasting Co., Clayton, N. Mex.—Granted\npetition for continuance of hearing on application (BP-5879;\nDocket 8502) ; continued hearing to June 7, 1948.\nThe Farmington Broadcasting Co., Farmington, N. Mex.—\nContinued hearing on application (BP-5713; Docket 8725)\nto March 19, 1948.\nThe Midwestern Broadcasting Co., Toledo, Ohio—Granted\npetition for leave to amend application for CP (BP-6421;\nDocket 8685) to revise technical dlata with respect to photo¬\ngraphs of proposed antenna site, interference with exist¬\ning stations, and population and area proposed to be covered ;\naccepted said amendments.\nKIEV—Cannon System, Ltd., Glendale, Cal.—Granted li¬\ncense covering installation of a new transmitter. (BL-2948)\nBenlee Broadcasting Co., Patchogue, N. Y.—Granted peti¬\ntion for late acceptance of its written appearance in pro¬\nceeding on application for CP (BP-6150; Docket 8673.)\nThe Connecticut Electronics Corp., Bridgeport, Conn.-—\nGranted petition for continuance “for a reasonable period of\ntime” of consolidated hearing on its application (BP-5375;\nDocket 8239) and application of Westco Broadcasting Corp.,\nWhite Plains, N. Y. (BP-5899; Docket 8240) ; continued said\nhearing to April 5, 1948 at Bridgeport, Conn., and April 6,\n1948 at White Plains, N. Y.\n1200 KC.\nWHLD—The Niagara Falls Gazette Pub. Co., Niagara\nFalls, N. Y.—Adopted order dismissing amendment to WHLD\napplication (BP-3879, Docket 8825 to change from 1290 kc.,\n1 KW, day, to 1200 kc., 1 KW, limited time) to increase\npower to 10 kc., install DA and change transmitter site;\ndesignated application requesting 1200 kc., 1 KW, limited\ntime, for hearing in consolidated proceeding with applica¬\ntions of Erie Broadcasting Corp., Buffalo, N. Y. (BP-6206,\nDocket 8495) and Concord Broadcasting Corp., Niagara Falls\n(BP-5825, Docket 8223) and made WHAM party to pro¬\nceeding. Continued consolidated hearing to April 7 and 8,\n1948.\n1600 KC.\nBaker Broadcasting Co., Fresno, Calif.—Granted petition\nfor leave to amend application for CP to specify 1600 kc..\n1 KW, daytime only, in lieu of 1600 kc., 1 KW, unlimited\ntime, using DA; accepted said amendment, and removed\napplication from hearing docket. (BP-6140; Docket 860(4)\nAM—Applications Accepted for Filing\n560 KC.\nKMON—Montana Farmer Broadcasting Corp., Great Falls,\nMont.—Modification of construction permit (BP-5866, as\nmodified, which authorized a new standard broadcast sta¬\ntion) for extension of completion date.\nWFIL—Triangle Publications, Inc. (The Philadelphia In¬\nquirer Division), Philadelphia, Pa.—Modification of construc¬\ntion permit (B2-P-4303, as modified, which authorized in¬\ncrease in power, installation of new transmitter and direc¬\ntional antenna for day and night use and change transmit¬\nter location) for extension of completion date.\nWGAI—The Advance, Inc., Elizabeth City, N. C.—Con¬\nstruction permit to change hours of operation from daytime\nto unlimited time, increase power from 500 watts day ,to\n1 KW day and 500 watts night and install directional an¬\ntenna for day and night use.\n590 KC.\nWEEI—Columbia Broadcasting System, Inc., Boston, Mass.\n—Modification of license to adjust the directional antenna\nsystem.\n620 KC.\nKNGS—Hanford Publishing Co., Hanford, Calif. (Stanley\nS. Beaubaire & W. Keith Topping)—License to cover con¬\nstruction permit (B5-P-4869, as modified) which authorized\na new standard broadcast' station.\nKNGS—Hanford Publishing Co., Hanford, Calif. (Stanley\nS. Beaubaire and W. Keith Topping)—'Voluntary assign¬\nment of construction permit from Stanley S. Beaubaire and\nW. Keith Topping d/b as Hanford Publishing Co. to Stanley\nS. Beaubaire and Samuel H. Beaubaire d/b as HanforlL\nPublishing Co.\n646 KC.\nWHKK—United Broadcasting Co., Akron, Ohio—License\nto cover construction permit (BP-6502), which authorized\nto install a new transmitter.\nWHKK—United Broadcasting Co., Akron, Ohio—License\nto cover construction permit (BP-6503), which authorized\nto install old main transmitter at present location of main\ntransmitter, to be used for auxiliary purposes with power\nof 1 KW, employing directional antenna.\n666 KC.\nKSKY—Sky Broadcasting Service, Dallas, Tex. (a partner¬\nship composed of A. L. Chilton, Leonore H. Chilton and\nJames Ralph Wood)—Construction permit to make changes\nin vertical antenna and mount FM antenna on top of AM\ntower.\n696 KC.\nWTOC-—Savannah Broadcasting Co., Savannah, Ga.—\nConstruction' permit to change frequency from 1290 to 690\nkc., change hours of operation from unlimited to daytime\nand increase power from 5 KW to 10 KW, install new trans¬\nmitter and new vertical antenna, and change transmitter\nlocation from Anderson Road, 3% miles West by North of\nSavannah, Ga., to: to be determined in or near Savannah,\nGa. AMENDED to change hours of operation from daytime\nto unlimited, install directional antenna for night use and\nchange transmitter location from: to be determined Savan¬\nnah, Ga., to Silk Hope Farms, Lot 160 on Ogeeche Road,\nU. S. Route No. 17 approx. 6 miles west of Savannah, Ga.\nKBGS—Radio St. Louis, St. Louis, Mo. (Edwin Wiley\nGrove, III, James Henry Grove and William Blum, Jr., a\npartnership)—Voluntary assignment of construction permit\nfrom Edwin Wiley Grove, III, James Henry Grove and\nWilliam Blum, Jr., a partnership d/b as Radio St. Louis\nto Radio St. Louis, Inc.\n716 KC.\nKMPC—KMPC, The Station of the Stars, Inc., Los An¬\ngeles, Calif.—Modification of construction permit (B5-P-\n4065, as modified, which authorized increase in power, in¬\nstallation of new transmitter and change in directional\nantenna for night use) for extension of completion date.\n866 KC.\nKTOW—Sooner Broadcasting Co., Oklahoma City, Okla.—\nLicense to cover construction permit (BP-5950), which au-\n(Continued, on next page)\nMARCH 8, 1948 —191"
}