{
  "id": "d893-122",
  "text": "thorized a new standard broadcast station and change studio\nlocation.\nKBUH—Samuel L. Stephens, Sr., Brigham City, Utah—\nLicense to cover construction permit (BP-5721, as modified),\nwhich authorized a new standard broadcast station and\nauthority to determine operating power by direct measure¬\nment of antenna power.\n850 KC.\nWXKW—Champlain Valley Broadcasting Corp., Albany,\nN. Y.—Modification of construction permit (Bl-P-4740, as\nmodified, which authorized a new standard broadcast sta¬\ntion) for extension of completion date.\n900 KC.\nNorthwestern Theological Seminary and Bible Training\n(School, Minneapolis, Minn.—Construction permit for a new\nstandard broadcast station to be operated on 900 kc., power\nof 1 KW and daytime hours of operation. AMENDED re\nofficers and directors.'\n910 KC.\nWPFB—Paul F. Braden, Middletown, Ohio—Modification\nof license to change hours of operation from daytime to\nunlimited time and change power from 1 KW to 1 KW day\nand 100 watts night.\nNEW—William C. Grove, Denver, Colo. (P. O. 2110 Park\nPlace, Cheyenne, Wyo,)—Construction permit for a new\nstandard broadcast station to be operated on 910 kc., power of\n1 KW, and hours of operation sharing time with KPOF.\n920 KC.\nKRAM—Boulder City Broadcasting Co., Las Vegas, Nev.—\nConstruction permit to change hours of operation from day¬\ntime to unlimited time, increase power from 1 KW day to\n1 KW day and 500 watts night and install directional an¬\ntenna for night use.\n930 KC.\nNEW—Valley Broadcasting Corp., Holyoke, Mass. (P. O.\nBox 924, Holyoke, Mass.)—Construction permit for a new\nstandard broadcast station to be operated on 930 lcc., power\nof 500 watts and daytime hours of operation.\n950 KC.\nWAAF—Drovers Journal Publishing Co., Chicago, Ill.—\nConstruction permit to change hours of operation from\ndaytime to unlimited time, install a new transmitter and\ndirectional antenna for day and night use and change trans¬\nmitter location and change power from 1 KW night, 5 KW\nday, to 5 KW. AMENDED to change directional antenna\npatterns.\n960 KC.\nKOVO—KOVO Broadcasting Co., Provo, Utah—Modifica¬\ntion of construction permit (B5-P-3667, which authorized to\nchange frequency, increase power, install new transmitter\nand directional antenna for night use and change transmitter\nlocation), for extension of completion date.\n970 KC.\nNEW—Lincoln Broadcasting Co., Springfield, Ill. (Gordon\nSherman, Alexander Buchan, Melvin Feldman, Sol Binkin\nand Robert Weiner) (P. O. 1931 South Glen wood Ave.) —\nConstruction permit for a new standard broadcast station\nto be operated on 970 kc., power of 1 KW and unlimited\nhours of operation.\n980 KC.\nWHWL—Radio Anthracite, Inc., Nanticoke, Pa.—Con¬\nstruction permit to change frequency from 730 to 980 kc.,\nincrease power from 1 KW day to 500 watts night, 1 KW\nday, change hours of operation from daytime to unlimited\ntime, install new transmitter and directional antenna for\nnight use and to change transmitter location from on SW\nside of U. S. Highway 11, approx. lVz miles N. 30° E of\nNanticoke, Pa., to: near the intersection of Garfield and\nDeitrich Streets in the Honey Pot Section of Nanticoke, Pa.\n1610 KC.\nWINS—The Crosley Broadcasting Corp., New York, N. Y.\n—Modification of construction permit (Bl-P-3026, as modi¬\nfied, which authorized change in frequency, increase in\npower, change hours of operation, installation of new trans¬\nmitter and directional antenna) for extension of completion\ndate.\n1056 KC.\nKRKL—East Side Broadcasting Co., Kirkland, Wash.\n(F. L. Thornhill)—License to cover construction permit\n(B5-P-5363, as modified), which authorized a new standard\nbroadcast station.\n1080 KC.\nKWJJ—KWJJ Broadcast Co., Inc., Portland, Ore.—Modi¬\nfication of construction permit (BP-5690, as modified, which\nauthorized to increase power, install new transmitter and\nnew directional antenna for day and night use and change\ntransmitter location) for extension of completion date.\n1100 KC.\nWLBB—Carroll Broadcasting Co., Inc., Carrollton, Ga.—\nConstruction permit to reinstate construction permit (B3-P-\n5645, which authorized the installation of new transmitter)\nto be operated on 1100 kc., 250 watts and daytime hours of\noperation.\n1130 KC.\nKYOR—Silver Gate Broadcasting Co., San Diego, Calif.\n(Albert E. Furlow, Frank C. Forward, Roy M. Ledford,\nFred H. Rohr and Mary W. Hetzler)—Modification of con¬\nstruction permit (B5-P-5438, which authorized to increase\npower, change hours of operation, install new transmitter\nand directional antenna for day and night use and change\ntransmitter location) for extension of commencement and\ncompletion dates.\n1150 KC.\nWTYC—Tri-County Broadcasting Co., Rock Hill, S. C.\n(W. G. Reid and O. Frank Thornton)—Modification of con¬\nstruction permit (BP-6409, which authorized a new standard\nbroadcast station) to change type of transmitter, for ap¬\nproval of antenna and transmitter location at Corner High¬\nway 21 A and Tucker St., Rock Hill, S. C., and to specify\nstudio location as Marshall Hotel, Rock Hill, S. C.\nWDEL—WDEL, Inc., Wilmington, Del.—Construction per¬\nmit to make changes in directional antenna and mount FM\nantenna on AM tower and change transmitter location from\nN.E. Boulevard-Bellevue Ave. and 35th Street, 1.6 miles N.E.\nof city, Wilmington, Del., to 5 miles north of Wilmington,\nNew Castle, Del.\n1170 KC.\nKPUG—Bellingham Broadcasters, Bellingham, Wash.\n(Jessica L. Longston, Edward J. Jansen, 0. V. Zaser and L.\nBerenice Brownlow)—Modification of construction permit\n(B5-P-4893, as modified, which authorized a new standard\nbroadcast station) to make changes in directional antenna\nsystem.\n1190 KC.\nNEW—Cotton Belt Broadcasting Co., Greenville, Miss.\n(David M. Segal) (P. O. % David M. Segal, % Radio Station\nKTFS, Texarkana, Tex.)—Construction permit for a new\nstandard broadcast station to be operated on 1190 kc., power\nof 1 KW and daytime hours of operation.\n1230 KC.\nNEW—Kenneth D. Juhlin and Mary I. Juhlin, Long Beach,\nWash. (P. O. Box 814, Seaview, Wash.)—Construction permit\nfor a new standard broadcast station to be operated on\n1230 kc., power of 250 watts and unlimited hours of opera¬\ntion. Contingent upon KAST being granted a change of\nfacilities.\nWNOK—Palmetto Radio Corp., Columbia, S. C.—License\nto cover construction permit (BP-6504) which authorized\ninstallation of new transmitter.\nWLOG—Clarence H. Frey and Robert 0. Greever, Logan,\nW. Va.—Authority to determine operating power by direct\nmeasurement of antenna power.\n(Continued on next page)\nMARCH 8, 1948-192"
}