{
  "id": "d893-125",
  "text": "Lindsay)—Construction permit for a new standard broad¬\ncast station to be operated on 1050 kc., power of 250 watts,\nand daytime hours of operation.\n1080 KC.\nNEW—Southland Broadcasting Co., Atmore, Ala. (a part¬\nnership composed of Cyril W. Reddoch and J. B. McCrary)\n—Construction permit for a new standard broadcast station\nto be operated on 1080 kc., power of 250 watts, and daytime\nhours of operation.\n1090 KC.\nNEW—San Benito Broadcasting Co., San Benito, Texas\n(R. A. Huffhines)—Construction permit for a new standard\nbroadcast station to be operated on 1090 kc., power of 250\nwatts, and daytime hours of operation.\n1170 KC.\nWJJJ—Southern Broadcasting Co., Montgomery, Ala.\n(Joseph G. Mathews, E. Judkins Mathews and John C.\nMathews)—Voluntary assignment of license from Joseph G.\nMathews, E. Judkins Mathews and John C. Mathews, d/b as\nSouthern Broadcasting Co., to Southern Broadcasting Co.,\nInc.\n1190 KC.\nNEW—Texas Trade School, Dallas, Texas—Construction\npermit for a new standard broadcast station to be operated\non 1190 kc., power of 1 KW, and daytime hours of operation.\n(Contingent on KLIF change in frequency.)\n1230 KC.\n1300 KC.\nNEW—Missouri Valley Broadcasting Co., Marshall, Mo.\n(Harold T. Fisher and Carl T. Fischer, a partnership) —\nConstruction permit for a new standard broadcast station\nto be operated on 1300 kc., power of 500 watts, and daytime\nhours of operation.\nKOME—Oil Capital Sales Corp., Tulsa, Okla.—Modifica¬\ntion of construction permit to change the proposed trans¬\nmitter location and modify the directional antenna system.\nKAGH—Rose Bowl Broadcasters, Pasadena, Calif. (An¬\ndrew G. Haley)—Modification of construction permit to\nchange hours of operation and install directional antenna.\n1340 KC.\nWGNI—General Newspapers, Inc., Wilmington, N. C.—\nConsent to assignment of license to New Hanover Broad¬\ncasting Co.\n1350 KC.\nWEEK—West Central Broadcasting Co., Peoria, III.—\nAcquisition of control of licensee corporation through trans¬\nfer of stock from E. K. Gaylord and associates to Robert S.\nKerr and associates.\nWNLK—Norwalk Broadcasting Co., Norwalk, Conn. (Sam¬\nuel R. Sallick, Lillian K. Johnpoll, Melvin Dresher, and Ben¬\njamin Ginzberg, a partnership)—Modification of construction\npermit to change hours of operation from daytime to un¬\nlimited, power from 500 watts day to 500 watts unlimited,\nand install directional antenna for night use.\nNEW—Belen Broadcasting Corp., Belen, N. Mex.—Con¬\nstruction permit for a new standard broadcast station to be\noperated on 1230 kc., power of 250 watts, and unlimited\nhours of operation.\nKGON—John H. Fitzgibbon, Roy Jarman and Temple V.\nEhmsen, Oregon City, Ore.—Consent to voluntary assign¬\nment of license to Clackamas Broadcasters.\n1360 KC.\nWOBS—Southern Radio and Equipment Co., Jacksonville,\nFla.—Modification of construction permit to change hours\nof operation from daytime to unlimited, using power of 1\nKW and install directional antenna for day and night use\nand approval of the antenna and transmitter location.\nNEW—Rib Mountain Radio, Inc., Wausau, Wis.—Con¬\nstruction permit for a new standard broadcast station to be\noperated on 1230 kc., power of 100 watts, and unlimited\nhours of operation.\n1240 KC,\nWDIA—Bluff City Broadcasting Co., Ltd., Memphis, Tenn.\n(E. R. Ferguson and J. R. Pepper) ^-Construction permit to\nchange frequency from 730 to 1240 kc., and hours of opera¬\ntion from daytime to unlimited.\n1250 KC.\nWSKB—McComb Broadcasting Corp., McComb, Miss.—\nModification of construction permit to increase power from\n500 watts night, 1 KW day, to 1 KW night, 5 KW day, and\nmake changes in the antenna system.\nWLPO—The La Salle Co. Broadcasting Co., La Salle, Ill.\n(F. F. McNaughton and Louis F. Leurig, a partnership)\nConstruction permit to change hours from daytime to un¬\nlimited, frequency from 1220 to 1250 kc., increase power\nfrom 250 watts to 500 watts, install a new transmitter and\ndirectional antenna for day and night use, and approval of\nantenna system and transmitter location.\n1380 KC.\nNEW—Armstrong County Broadcasting Corp., Kittan¬\nning, Pa.—Construction permit for a new standard broad¬\ncast station to be operated on 1380 kc., power of 500 watts,\nand daytime hours of operation.\nNEW—The Reorganized Church of Jesus Christ of Latter\nDay Saints, Independence, Mo.—Construction permit for a\nnew standard broadcast station to be operated on 1380 kc.,\npower of 5 KW, and daytime hours of operation.\n1390 KC.\nNEW—Neponset Radio Corp., Norwood, Mass.—Construc¬\ntion permit for a new standard broadcast station to be\noperated on 1390 kc., power of 500 watts, and daytime hours\nof operation.\nWLAN—Peoples Broadcasting Co., Lancaster, Pa.—Modi¬\nfication of construction permit to change from employing\ndirectional antenna day and night to directional antenna\nfor night use only.\n1400 KC.\n1280 KC.\nNEW—Wachusett Broadcasting Co., Fitchburg, Mass.\n(Donald L. Coleman, Jr., Albert E. Keleher, Jr., J. Gordon\nKey worth and James L. Spates)—Construction permit for\na new standard broadcast station to be operated on 1280 kc.,\npower of 500 watts, and daytime hours of operation.\nWOV—Wodaam Corp., New York, N. Y.—Consent to trans¬\nfer of control from Arde Bulova and Harry D. Henshel to\nGeneral Broadcasting Corp.\n1290 KC.\nKGVO—Mosby’s, Inc., Missoula, Mont.—Construction per¬\nmit to change power from 1 KW night and 5 KW day to 5\nKW; install a new transmitter and change the transmitter\nlocation and install directional antenna for day and night\nuse.\nNEW—Cleveland County Broadcasting Co., Norman, Okla.\n(Tol Dickenson, William S. Morgan and Howard DeMere,\na partnership)—Construction permit for a new standard\nbroadcast station to be operated on 1400 kc., power of 250\nwatts and unlimited hours of operation. (Request facilities\nto be vacated by KTOK.)\nNEW—Francis J. Drake, Saginaw, Mich.—Construction\npermit for a new standard broadcast station to be operated\non 1400 kc., power of 250 watts, and unlimited hours of\noperation. (Contingent upon WSAM change in frequency.)\nKTOW—Sooner Broadcasting Co., Oklahoma City, Okla.—\nModification of construction permit to change hours of opera¬\ntion from daytime to unlimited, frequency from 800 kc. to\n1400 kc., using power of 250 watts, unlimited. (Request\nfacilities being vacated by KTOK.)\n(Continued on next page)\nMARCH 8, 1948-195"
}