{
  "id": "d893-127",
  "text": "type transmitter, change transmitter site from: To be deter¬\nmined, Santa Monica, Calif., to Mt. Wilson, Los Angeles,\nCalif., studio site from: To be determined, Santa Monica,\nCalif., to: To be determined, Los Angeles, Calif., and change\nClass of Station from A to B and make changes in antenna\nsystem.\nKFVD-FM—Standard Broadcasting Co., Los Angeles—\nModification of construction permit (B5-PH-146, as modified)\nwhich authorized a new FM broadcast station for extension\nof completion date.\nKVSM-FM—San Mateo County Broadcasters, San Mateo\n(Edmund Scott, Gordon D. France, Merwyn F. Planting and\nHugh H. Smith, a partnership)—Modification of construc¬\ntion permit (B5-PH-1029) which authorized a new FM broad¬\ncast station to change studio and transmitter location from\n5th and B Streets, San Mateo to 3rd Ave. at Seal Creek,\nSan Mateo, Calif., ERP from 380 watts to 713 watts; antenna\nheight above average terrain from 180 feet to 54 feet, and\nmake changes in antenna system.\nKVSM-FM—San Mateo County Broadcasters, San Mateo\n(Edmund Scott, Gordon D. France, Merwyn F. Planting and\nHugh H. Smith, a partnership)—Modification of construc¬\ntion permit (B5-PH-1029, which authorized a new FM broad¬\ncast station) for extension of completion date.\nConnecticut\nWBIB—The Colony Broadcasting Corp., New Haven—\nModification of construction permit (Bl-PH-982, as modified)\nwhich authorized a new FM broadcast station for extension\nof completion date.\nDelaware\nWDEL-FM—WDEL, Inc., Wilmington—Modification of\nconstruction permit (Bl-PH-177, which authorized a new FM\nbroadcast station, to change transmitter location from Hwy.\n#13, South of Wilmington to 5 miles North of Wilmington,\nchange type of transmitter from Westinghouse FM-3 max. 3\nKW to Western Electric, 504-B2 3 KW, antenna height above\naverage terrain from 555 feet to 358 feet, ERP from 15.3\nKW to 39.1 KW and make changes in antenna system.\nDistrict of Columbia\nWOL-FM—Cowles Broadcasting Co., Washington—Modi¬\nfication of construction permit (Bl-PH-639, as modified)\nwhich authorized a new FM broadcast station, for extension\nof completion date.\nFlorida\nWJNO-FM—WJNO, Inc., West Palm Beach—Modification\nof construction permit (B3-PH-713, as modified) which au¬\nthorized a new FM broadcast station for extension of com¬\npletion date.\nGeorgia\nWAGA-FM—Liberty Broadcasting Corp., Atlanta—Modi¬\nfication of construction permit (B3-PH-449, as modified)\nwhich authorized a new FM broadcast station to change\nmake and type of transmitter.\nWSAV-FM—WSAV, Inc., Savannah—Modification of con¬\nstruction permit (B3-PH-660, as modified) which author¬\nized a new FM broadcast station for extension of completion\ndate.\nWBGE-FM—General Broadcasting Co., Atlanta (Mike\nBenton)—Modification of construction permit (BPH-1184,\nwhich authorized a new FM broadcast station) to change\ntransmitter site, make changes in antenna system; and\nchange commencement and completion dates.\nIdaho\nKIDO-FM—KIDO, Inc., Boise—Modification of construc¬\ntion permit (B5-PH-371, as modified) which authorized a\nnew FM broadcast station, for extension of completion date.\nIllinois\nWTAX-FM—WTAX, Inc., Springfield—Modification of con¬\nstruction permit (B4-PH-690, as modified) which author¬\nized a new FM broadcast station for extension of completion\ndate.\nWTAD-FM—Lee Broadcasting, Inc., Quincy—Modification\nof construction permit (B4-PH-133, as modified) which\nauthorized a new FM broadcast station, for extension of\ncompletion date. ; ■ '■ >\nIndiana\nWJOB-FM—South Shore Broadcasting Corp., Hammond—\nModification of construction permit (B4-PH-224, as modi¬\nfied) which authorized a new FM broadcast station to change\ntransmitter location from 447-449 State Street to Indi¬\nanapolis Blvd. and 165th Street, Hammond, Ind., and make\nchanges in antenna system.\nKansas\nKWBB-FM—The Wichita Beacon Broadcasting Co.,\nWichita (Louis Levand, Max Levand, John Levand)—Modi¬\nfication of construction permit (B4-PH-635, which author¬\nized a new FM broadcast station) for extension of comple¬\ntion date.\nKentucky\nWCJT—WHAS, Inc., Louisville—License to cover con¬\nstruction permit (B2-PH-88t as modified) which authorized\na new FM broadcast station.\nWCMI-FM—Ashland Broadcasting Co., Ashland—Modifica¬\ntion of construction permit (B2-PH-39, as modified) which\nauthorized a new FM broadcast station for extension of\ncompletion date.\nLouisiana\nWBRL—Baton Rouge Broadcasting Co., Inc., Baton Rouge\n—Modification of construction permit (B3-PH-1062, as modi¬\nfied, which authorized a new FM broadcast station) to\nchange type of transmitter, change ERP from 51 KW to\n15.3 KW and change commencement and completion dates.\nMaryland\nWMCP—Belvedere Broadcasting Corp., Baltimore—Modi¬\nfication of construction permit (Bl-PH-782, as modified)\nwhich authorized a new FJN1 broadcast station for exten¬\nsion of completion date,\nW7GAY-FM—Tri-Suburban Broadcasting Corp., Silver\nSpring—License to cover construction permit (Bl-PH-873,\nas modified) which authorized a new FM broadcast station.\nWFBR-FM—The Baltimore Radio Show, Inc., Baltimore—\nModification of construction permit (Bl-PH-133, as modi¬\nfied) which authorized a new FM broadcast station, for\nextension of completion date.\nMassachusetts\nWBRK-FM—Greylock Broadcasting Co., Pittsfield—Modi¬\nfication of construction permit (Bl-PH-194) which author¬\nized a new FM broadcast station for extension of completion\ndate.\nWTAG-FM—WTAG, Inc., Worcester—Modification of\nconstruction permit (BPH-1101, as modified) which author¬\nized changes in FM broadcast station to make changes in\nantenna system.\nWHDH-FM—Matheson Radio Co., Inc., Boston—Modifica¬\ntion of construction permit (Bl-PH-142, as modified) which\nauthorized a new FM broadcast station to change studio\nlocation, change type of transmitter, change antenna height\nabove average terrain to 543 feet and to make changes in\nantenna system.\nWGTR—The Yankee Network, Inc., Boston—Modification\nof construction permit (Bl-PH-593, as modified) which au¬\nthorized a new FM broadcast station for extension of com¬\npletion date.\nWBZ-FM—Westinghouse Radio Stations, Inc., Boston—\nModification of construction permit (Bl-PH-1112, as modi¬\nfied) which authorized a new FM broadcast station for\nextension of completion date.\nWEIM-FM—Mitchell G. Meyers, Ruben E. Aronheim and\nMilton H. Meyers, Fitchburg—Modification of construction\npermit (Bl-PH-688, as modified) which authorized a new\nFM broadcast station for extension of completion date.\n(Continued on next page)\nMARCH 8, 1948 —197"
}