{
  "id": "d893-131",
  "text": "NEW—The Lubbock Television Co., Lubbock (C. C. Wood-\nson)—Construction permit for a new commercial television\nbroadcast station to be operated on Channel #6, 82-88 me.,\nERP of visual 1.85 KW, aural .59 KW.\nNEW—City of Dallas, Texas, Dallas—Construction permit\nfor a new commercial television broadcast station to be\noperated on Channel #10, 192-198 me., ERP of visual 24.84\nKW, aural 12.48 KW.\nMISCELLANEOUS BROADCAST\nStudio Link Application Accepted for Filing\nNEW—John F. Easley, Ardmore, Okla.—Construction\npermit for a new ST Link broadcast station to be operated\non 940.194 me., power of 25 watts, emission special for FM,\nand unlimited hours of operation.\nNoncommercial Educational Application Accepted for\nFiling\nWDTR—The Board of Education of the City of Detroit,\nDetroit, Mich.—License to cover (B2-PED-84, as modified)\nwhich authorized a new noncommercial educational FM\nbroadcast station.\n.FTC ACTIONS.\nCOMPLAINT\nThe Federal Trade Commission has alleged unfair compe-\n. tition against the following firm. The respondent will be\ngiven an opportunity to show cause why a cease and desist\norder should not be issued against them.\nFir Door Institute—Combination and conspiracy to sup¬\npress competition and create a monopoly in the interstate\nsale of Douglas Fir doors and overhead garage doors desig¬\nnated “CrawFIRdors” are charged in a complaint issued by\nthe Federal Trade Commission against Fir Door Institute,\nTacoma, Wash.; eight companies which are or have been\nmembers of the Institute; and three other corporations.\n(5528)\nCEASE AND DESIST ORDERS\nEunice Mail Order House—Benjamin Rosenberg, trading\nas Eunice Mail Order House, 197 Division St., New York,\nhas been ordered by the Commission to cease and desist from\nmisrepresentation in the sale of wearing apparel and other\nmerchandise, including used, worn or secondhand clothing.\n(5170)\nD. J. Lane Co.—False and misleading advertising of me¬\ndicinal preparations intended for use in the treatment of\nasthma and hay fever is prohibited in a cease and desist\norder issued by the Commission against Lewman A. Lane,\ntrading as D. J. Lane Company, St. Marys, Kans., and his\nadvertising agent, Frank E. Whalen, 15 West Tenth St.,\nKansas City, Mo. (5252)\nLyons and Co.—Mervin E. Lyons and Clarence B. Lyons,\ntrading as Lyons and Co., 118 Duane St., New York, have\nbeen ordered by the Commission to cease and desist from\nrepresenting that “KIWI” shoe polish will make shoes\nwaterproof. They are specifically prohibited from using on\ncontainers or in advertising material the word “waterproof”\nor any other term which represents that the product is\ncapable of rendering shoes impervious to water. (5207)\nSheffield Farms Co., Inc., New York, one of the nation’s\nlargest distributors of fluid milk and cream, has been\nordered by the Commission to cease and desist from unfair\ncompetitive practices in connection with its purchase of milk\nproducts from organizations of milk producers, such as pro¬\nducer cooperative associations. (4647)\nMARCH 8, 1948-201"
}