{
  "id": "d893-139",
  "text": "102\nEDUCATION ON THE AIR\nthis is particularly true in the so-called “small market” sta¬\ntion category.\nIf you will pardon a few personal experiences, let me tell\ntell you something of the editorial projects which we have\nundertaken at my station in western Colorado.\nAbout a dozen years ago, the people of our area were in¬\nformed we would have to share our water resources with the\ncities of what is known as “the eastern slope,” in other words,\nthe area to the east of the Continental Divide of the Rocky\nMountains. Since the annual snow-fall on the western slope of\nthe range is customarily higher than on the east, diversion\ntunnels were planned which would tap our water supply at\nthe head-waters of the Colorado River. Any of you folks who\nare familiar with western history are aware of the tremendous\nimportance of water, and not a few bloody battles were fought\nover this prize resource in the pioneer days.\nStation KFXJ secured the best possible legal counsel, con¬\nferred with officials of the Reclamation Bureau, and employed\nconsiderable research to get at all the facts. We found that it\nwould probably be futile to simply oppose the diversion scheme.\nWhile in area our section comprised the largest part of the\nstate, and was the richest from the standpoint of natural re¬\nsources, we were hopelessly outnumbered in population by the\neastern slope, which encompasses the City of Denver. KFXJ\nlaunched an editorial campaign calling for the construction of\ncompensatory reservoirs that would impound water during the\nflood season of early spring and thus assure an even annual\nflow of water down the Colorado River during the season when\nwater was needed by our farmers and ranchers. It would thus\nprovide, also, for diversion of badly needed water to our neigh¬\nbors across the mountains without entailing any sacrifice to\nwestern Colorado water users.\nOur campaign met with instant success. Newspapers in both\nareas of the state enthusiastically supported our campaign and\nthe reservoirs were built. Radio, by its ability to reach out over\na wide area and inform, thus averted a great deal of sectional\nstrife among our people and aided materially in expediting a\nworthwhile project. KFXJ had to be an advocate, in this case.\nWe advocated a specific plan. We also asked for other sugges¬\ntions and would gladly have publicized them had we received\nany. We could probably have employed someone else to de¬\nliver some speeches about it over the radio, but the point is,"
}