{
  "id": "d893-147",
  "text": "IIO\nEDUCATION ON THE AIR\nof the principles of balanced programming, against the censor¬\nship of ideas, and for equal treatment of opposing views on\ncontroversial issues. In the union’s proposed FM stations,\n800,000 auto workers are confident they can demonstrate the\nsoundness of these principles for radio in a democratic society.\nTo those who advocate that radio have an editorial policy,\nlet them examine some of the implications of that position.\nIn radio, as in other media of mass communication, the\ndominant interests are the large corporations and powerful\nbusiness interests. The purpose of editorializing is to mold\npublic opinion.\nThe power of radio to sway people’s attitudes, opinions,\nand beliefs is universally recognized. Ideas are sold over the\nradio as well as products. Now it is one thing for an idea to\nbe sold by survival in competition with conflicting ideas. It is\nsomething else for an idea to be sold because there is no other\nidea to be purchased.\nDoesn’t editorializing by radio station owners mean the\nmolding of public opinion to those views and opinions which\nare preferred by the large powerful corporate interests in the\ncountry?\nThere are undoubtedly some persons who actually believe\nthat private property in radio channels is desirable, and also\nthat it is desirable that the views of large corporate interests be\nbrought to the public in preference to the views of other seg¬\nments of the community. The fact that a frank statement of\nsuch a position would very likely be unpopular should not re¬\nstrain such advocates. The open support of that position might\nwell clarify this whole issue.\nIf, as I believe, editorializing by radio station owners is not\nin the public interest, is there then any improvement that can\nbe made in present radio policy? I think there is.\nThere can be a greater recognition of the value of the pres¬\nentation of controversial public issues, a more energetic effort\nto include on radio programs representatives of underprivileged\ngroups in radio. Specifically, I might mention working farm¬\ners, Negroes, labor, and such non-profit organizations as co¬\noperatives. Additional improvement would result if a diversity\nof groups was represented in radio station ownership and if the\ntrue role and function of the FCC were recognized.\nOther speakers have urged you to listen critically to radio\nprograms, local and network. I wish to join my voice with"
}