{
  "id": "d893-151",
  "text": "EDUCATION ON THE AIR\n114\nThis adds up to a very great danger for radio broadcasting\nin general. To me it means that broadcasters should exercise\nrestraint and pinch themselves to see whether they are awake\nor sleeping when they decide they want to lead the procession\nin saving the world through broadcasting editorials. Frankly, I\nam convinced that only a small minority of broadcasters would\ngo in for editorializing even if the Congress enacted a law and\nthe Federal Communications Commission made a rule specifi¬\ncally permitting such activity. Most broadcasters are men of\ngood judgment and all honest commercial broadcasters freely\nadmit they are in broadcasting for the reason, among others,\nof making an honest dollar. Some short-sighted bigots actually\ntake the position that profit is the only thing which motivates\nbroadcasters, but any such assertion is based either upon ig¬\nnorance or depravity.\nI take the position that although neither the Congress nor\nthe Federal Communications Commission has the right to\nrestrict the right of free speech, and the Commission does not\nhave the right to censor programs or make rules or render deci¬\nsions which would do the same thing, broadcasting should con¬\ntinue to grow and fill its great destiny as a transmitter of intelli¬\ngence rather than trying to be an interpreter of that intelligence\nor a proselyter of the public. I repeat—the public is able to\nunderstand facts and is quite capable of reaching correct con¬\nclusions. Let radio give them the facts.\nDISCUSSION\nI. KEITH TYLER,6 Presiding\nChairman Tyler:\nThe first period of this discussion will be among the people on the\npanel. We hope to sharpen up some of the conflicts, if there are conflicts.\nMr. Alan Griffin:7\nI am disturbed by the line of thought which says that constitu¬\ntional freedom of speech is a major issue in this discussion. It seems\nto me that limitation of freedom of speech would come if we said\nto broadcasters, “You cannot have the same access to public facilities\nas other people.”\nI see no reason why a broadcaster who represents a group that is\ndiscriminated against or is not being heard should not have a right to\n8 Ohio State University.\n7 Ohio State University."
}