{
  "id": "d893-155",
  "text": "118\nEDUCATION ON THE AIR\nunethical. I think we all agree on that. Newspapers have a separate\nsection for editorials and I think radio should follow that pattern.\nMr. David R. Mackey:9\nI would like to ask Mr. Spearman a question. The wording of the\nFirst Amendment is exactly the same now as it was when the Bill of\nRights was inserted in the Constitution. Do you believe the meaning\nof these words has changed? When we say “free speech” now, does\nit mean exactly the same thing that it meant then?\nMr. Spearman:\nIf there has been any change, it has been in application because of\nnew mass means for communicating to people. There has been a change\nin the interpretation of the courts on a lot of the provisions of the Con¬\nstitution. But I still think free speech means free speech, and I do not\nthink Congress has any right to restrict it or abridge it. Obviously, if\nCongress does not have that right it cannot confer the power to\nanybody else.\nMr. Thomas J. Page:10\nI would like to inquire a little further with Mr. Spearman regarding\nthe definition of free speech. As a person, an individual may stand on\na soap box or stump and sound off at his pleasure. But when he has a\nmicrophone and his voice reaches an unnumbered group of people, then\nhe becomes an institution. While the Constitution may deny the right\nto prohibit the free speech of an individual, I think it has been well\nestablished that organizations are in a very full sense susceptible to con¬\ntrol. Certainly that must be true of the owner, manager, or other\nresponsible official of the broadcasting station.\nWould Mr. Spearman care to speak to that?\nMr. Spearman:\nI will have to give you the answer of one of our law partners. He\nis one of the numerous people who disagree with me. He takes the\nposition that since the radio frequencies belong to all the people, Con¬\ngress is the regulatory body to determine how the people’s property\nshall be used. Therefore, Congress does have the right to put certain\nlimitations on the use of the people’s property which it would not be\npermitted to invoke if the frequencies were not the property of the\npublic itself.\nI do not go along with that. I do not think Congress ought to\nmonkey around with free speech. My law partner agrees with the\nimplication of your question entirely, and he goes further. He thinks\n9 Northwestern University, Evanston, Ill.\n10 Station WNBC, New York."
}