{
  "id": "d893-157",
  "text": "120\nEDUCATION ON THE AIR\nMr. Spearman:\nMr. Chairman, on this question I have taken the position, ever since\nI joined the staff of the Radio Commission in 1929, that the only ex¬\ncuse for the existence of a radio station was to carry programs, and that\nthose programs ought to be such as would serve the public interest.\nIf substantial groups are denied the right to present their views, in\na decent way, by competent people who know the answers, I think,\nfrankly, that is a failure on the part of the station. It ought to be\nchalked up against the station.\nMr. Sayler:\nIt seems to me that broadcasters, educators, and the general public\nneed to understand the true role of the FCC and the fact that radio\nchannels are public property. The only way this can come about is\nthrough some specific language of the FCC, spelling out public interest\nand what public interest means in the ownership and operation of the\nradio channels.\nWe need to have opposing views broadcast on all live controversial\nissues that affect the public. In the past year, if there had been some\nspokesman on the radio who was heard regularly every night on the\nissue of price control, taking a point of view opposed to that of Fulton\nLewis, I believe we would not be in some of the trouble we have today\non the matter of high prices.\nMr. Leigh:\nI would suggest there is a special function of the broadcaster in our\nsociety. He must serve both as a judge and interpreter. It would be\nworthwhile for our society to have the 1,000 or more people in charge\nof radio trained to perform that function well. I believe this would be\na more valuable function than that of partisan advocacy, which obviously\nstation managers could do as well as the people they hired.\nMr. Schechter:\nMr. Sayler, will you answer one question? There was a little mat¬\nter of a coal strike recently. The head of the coal association wanted\ntime on the air but John L. Lewis wouldn’t talk. What do you rec¬\nommend in such an issue?\nMr. Sayler:\nIf the question is an important controversial issue, one side should\nnot be able to bar the other from the air by refusing to participate.\nMr. Erik Barnouw:14\nI would like to pursue further the question of what an organization\ncan do if refused time on the air. The only answer so far is that at a\nlater time, possibly three years away, it could fight against renewal of\n14 Columbia University, New York."
}