{
  "id": "d893-158",
  "text": "SOCIAL RESPONSIBILITY OF RADIO 121\nthat station’s license. Does any member of the panel see a possibility\nfor developing a more rapid solution?\nMr. Leigh:\nI believe that the rather awkward system we have also has its\nadvantages. The FCC is not likely to deal with a specific program as\nthis might tend to approach censorship. It is an accumulation of griev¬\nances that might bring action by the FCC.\nMr. Spearman:\nThis system of ours is called cumbersome. But I would rather have\nit than the system in some countries, where all you have to do is hand\nso much coin of the realm to the officer in charge of communications to\nget what you want. I will take the old American way. I don’t know\nof any problem that is of such great importance you would have to\ntear down the door.\nMr. Griffin:\nDoes that mean that groups denied access to the air really can\ndo nothing much except wait three years to protest about renewal of\nthe license?\nMr. Spearman:\nThe answer is, No. The Commission’s licensing procedure is such\nthat if you want to apply for somebody’s facilities you don’t have to\nwait until that fellow’s license expires. The Commission can decide the\nwhole business in 30 days and revoke a license. I am not saying it is\ndone with regularity, but it is possible.\nMr. Harold Wakely:15\nSpeaking as chairman of the Tri-City Radio Council, I wish to out¬\nline a problem facing us. We have a religious news commentator who\nsimply reads the report from a competent religious news service. The\nprogram is non-partisan. It represents news of all faiths. However,\nour program is censored by the station. All of the items that relate to\ncontroversial subjects are deleted. We have to maintain good relations\nwith the station. We cannot make an appeal to the FCC for a hearing\nin this case. Yet we would like to have a specific statement from the\nCommission so that we could approach the station manager and say:\n“Here it is. We would like to have a better deal.”\nMr. Spearman:\nYou apparently want the Commission to make a rule you can use\nas a club to force on the program something you say the station has\nbeen censoring. You refer to this as a censorship of things which\nare controversial.\nOne of the worst things that can happen in any community is\n“Troy, N. Y."
}