{
  "id": "d893-16",
  "text": "- 2 -\n5. Even If the Commission could attach prospective conditions upon the\nlicensee's right to editorialize, such conditions should not'he couched in am¬\nbiguous terms'» Further, the Administrative Procedure Act and the Rules and ‘\nRegulations of the administrative Committee issued pursuant to .the,Federal\nRegister Aot (.44 USC Subchapter 8B) require policy s tatoments to be published ...\nin codified,form. Since I- have come to these conclusions in disposing of the\nright of licensees to editorialize,'I- ora constrained to state my-reasons\ntherefor as follows*\n6* neither the questions here presented nor their resolution can be\nadequately understood without a discussion of the case of Mayflower Broadcasting\nCompany, 8 FC.C 333. In tho Mayflower case, the-Commission had before It\nsituation-;whore a licensoo had used the facilities of his station to promote\nideas and political candidates of his own choosing. The Commission, in review¬\ning the licensee's operation, hold that a licensee could not, under any circum¬\nstances, consonant with the public interest, act as an advocate, ihe Commission\nsaid \"a truly free radio cannot bo used to advocate the causes of the licensee.\n... it cannot be devoted to the support of principles he happens to regard most\nfavorably. Ir: brief, the broadcaster cannot bo an advocate•” 8 FCC at 340.\nTJhilo some question has boon raised from time to time as to whether those broad\nstatements constituted only dictum, examination of tho Commission's disposition\nof the .proceedings in that case makes it clear that the broad language of tao\nCommission prohibiting advocacy by lieu .sees over their facilities was intended\nto be part-of the'ratio decidendi* Thus in concluding to grant the application\nfor renewal of station\" Muhi’s license, the Commissiph expressly relied upon the\nlicensee's unequivocal representations that no editorials had boon broadcast\nsince September 1938, that the licensee did not intend to depart from this\nuninterrupted policy and that the station had no editorial .policy. In glow of\nthe language :of;the Mayflower decision and the Commission's basis of disposi-.\ntion of the .proceedings, I cannot see how the Mayflower decision can bo read in .\nany 'other way but as a square holding that, a licensee cannot, use his microphone\nfor personal advocacy. The Commission, in my opinion, fully and completely\nsuppressed and prohibited the licensee from speaking in the.future over his\nmicrophone in behalf of any cause.\n7. It is true that protests were heard .outside of tho Commission,’ s mooting ,\nroom, but for 7 years no one formally challenged the decision of the Commission-/\napd tho Commission took no steps to disclaim the ban created on edit or 1aliz ation\nl/ This decision of the Commission has hung like Damocles’ sword over every\n\"station licensee to silence the licensee as on advocate. vJhilo it is true that\nany licensee in defiance of the Mayflower decision might personally have ex¬\npressed editorial opinions and thus put his station license in jeopardy, tho\nfact remains that no one challenged the governmental authority in this instance.\nI realize, of course, the dangers that a licensee would have boon required to\nface had ho challenged the Mayflower decision. Nevertheless radio should\nremember tho history and experience of newspapers in their fight for freedom of\nthe press. That battle should servo as a guide to the broadcasting industry on\nhow to combat current abuse of governmental authority."
}