{
  "id": "d893-162",
  "text": "equal'opportunity for the presentation to the public of all sides of public\nissues. Indeed, as one licensed to operate in a public domain the licensee\nhas assumed the obligation of presenting all sides of important public\nquestions, fairly, objectively, and without bias. The public interest -- not\nthe private --is paramount. . . 55\nSince WAAB had discontinued editorials in September 1938, and filed an affidavit\nwhich undertook not to resume them, the Commission renewed its license.\nNevertheless, these two paragraphs of the Decision established an important\nprecedent.\n* * *\nThe question was: What did they mean? Did they mean that broadcasters must\ngive access to the microphone to all views except their own; or did the second\nparagraph qualify the first and establish the principle that all views, insofar as\npossible, should be heard over the air, including the broadcasters’ view?\nIt doesn’t seem reasonable that the Commission could have meant the former;\nif it had, it is hard to see how the courts could have upheld it; but even if such\nmeaning had been intended, and if it were sustainable on review, a test case\nwas indicated, for -- as far as I know, and I believe I am familiar with all the\ncases -- neither the Communications Commission, nor its predecessor, the\nRadio Commission, has ever, in 22 years, withheld renewal of license on the basis\nof such a technical violation as this would then have constituted, when coupled with\na showing of bona fides.\nWhy wasn’t there a test case ? The reason seems to be that the broadcasters\nwe re tit’t particularly interested in the responsibilities of editorializing. The\nvast majority of them were primarily businessmen. They were chiefly interested\nin selling time. Hence, little was said about the Mayflower Decision. What was\nsaid was largely favorable.\nIn 1946 the Commission issued a report which became famous (in the radio\nindustry, infamous) as the Blue Book. It reminded broadcasters that there were¬\nn’t enough channels in the air to permit everyone who wanted to do so to broad¬\ncast wherever he wanted, at whatever power he wanted, in whatever directions\nhe wanted. (Actually the air over the whole country accommodates less than\n3.000 of our 140,000,000 people, far more than half of these have the only avail¬\nable channels in their respective communities, and less than 30 enjoy choicest\nfacilities.) It reminded them that, since this was so, Congress had declared\nradio channels to be public property, in which no one could acquire a property\ninterest; that radio could be used only on license, and that licenses were to be\ngranted not for private benefit but for benefit of the public; that the Commission,\nbefore granting new licenses or renewing old ones, was to scrutinize promises\nor performances to see if they were “in the public interest, convenience, or\nnecessity,” and to grant or withhold accordingly.\nThe Blue Book then went on to suggest that the Commission might have difficulty\nin finding that a station which sold nearly all of its time for “commercials”,\nwhich didn’t have a balanced schedule of religion, education, news, good music,\netc., was operating in the public interest.\n2"
}