{
  "id": "d893-181",
  "text": "LIMIT POWER OF RADIO STATIONS\n92£\n&PQR; J« C. Leo, K2KM; Eugene Wo Lee, KFXK~FM; Ernest L. Spencer, KOCS; Jerene\nAc Haraish, XOCS-FM; Ernest Lo Spencer, KVOE; Wallace So Wiggins, KVOE«FM; Gen®\nWUHams,KFRQ; Riley Gibson, XREQ; Dayle lo Osman, KXO; Carl Phillips, KPASj\nJames Guthrie, KEMT^FM; California Rural Network by Charles Gibson, KPOR; Glenn\nDunham, KROP; Charles Love, KXGO; Carl Hyman, KOTO,’ S. Kim Gerrald, KRNO; Stan\nReynolds, BPCMX; Bob Wareham, KtJCB; Richard Williams, KARO; Woodrow Miller,\nXCSB; B. Co Boatright, KWTC.\nMr. Hullo It may be of interest to note—and this is one of the major areas,\nif not the major area of our concern—that with us WOI presents more market news\nto its rural listeners than any station in the United States, according to the\n'Department of Agricultural Records; it provides more good music to Iowa listeners—\nand I will say paranthetically that farmers appreciate music of a high caliber as\nwell as other people—-than any other station in the State, and more farm and\nmarket information,,\nWOI follows a policy of what we call alternative listening; that is, provides\na contrasting and special-program service with respect to the offerings of other\nradio stations in the same area, believing that listeners deserve a choice in\ntheir program tuning, and the opportunity, if they desire, to hear something other\nthan soap serials. WOI tries to give them a balanced program cro3s«~scheduled\nagainst other regional stations. In other words, we adhere to the idea that the\nlistener should be able to choose what he gets, and have an opportunity to make\nthat choice„ The comments we get from listeners resulting from that policy are\nnumberless.\nI want to give only excerpts from two to show what I mean. Mr. and Mrs. Ho\nReeves, from Cedar Rapids, Iowa, wrote us that*\nWe are extremely happy about your new schedule for your market service.\nThere has not been for years, if ever, a radio source which afforded such fine\nand up-to-1&e«©inute market information0 Keep it going. We like it.\nThan this other significant statement which underlies the policy of our\nstation and all NAEB stations. Mrs* Emma Lou Heusinveld, from Guthrie Center,\nIowa, writesg\nI will take WOI at Ioxm State College, WSUI at the university, WNAD at the\nUniversity of Oklahoma, or the station from the Concordia Seminary at St. Louis,\nMo.; those stations are doing the job Marconi meant for radio to do—good music,\neducational pregrams, classroom broadcasts, and so forth, with emphasis on the\ngood music.\nAll of those stations, I might add, are noncommercial educational stations.\nIowa State College has long felt WOI0 s inability to broadcast at night was\na severe handicap. As any commercial broadcaster will tell you, the largest radio\naudience is available at night when the entire family is at home.\nIn 1945 an Iowa College survey showed 65 percent of Iowa farmer s wanted farm\nprograms at night. This was true despite the statement of Victor Sholis, who,\nspeaking for the clear channels, had previously stated the contrary. His opinion,\nif I recall correctly, was simply that farmers did not want programs at night."
}