{
  "id": "d893-19",
  "text": "- - 5 -\n62 F. 2d 650, cort, don. 288 US 599. 3/\n12. Thus, it is clearly within the scope of the Commission’s authority\nto refuse to grant a renewal of license to one whose operation is extensively\nconducted in his personal interest rather than the public interest. Cf. KFKB\nBroadcasting Association v. Federal Radio Commission, 47 F. 2d 670. Likewise\"\nthe Commission does not deny freedom of speech by refusing to renew the\nlicense of.one who in an irresponsible manner has abused the privileges con¬\nferred upon him by broadcasting defamatory and untrue matter and has obstructed\nthe administration of justice by attempting by means of radio to impose his\nwill upon the courts. Trinity Methodist Cnurch, South v. Federal Radio Com¬\nmission, 62 F. 2d 850, cert. den. 288 .US 599. ~ •\n13. Thus, the poxvers of the Commission and the responsibilities of the\nlicensee have, without any necessity for violation of the policy against\nprevious restraint, been defined by the courts on a case to case basis where\nthe necessity for such decision has been presented. I am in complete agree¬\nment with the standards of licensee conduct imposed by these decisions. I\nwould not, however, deviate from the past method of procedure in handling\nsuch problems on the basis of adjudicatory proceedings arising out of individual\nfactual situations. I cannot subscribe to the action of the Commission in\nexpressly imposing prospective conditions on the exercise of the licensee’s\nright to use the facilities of a station for purposes of editorialization.\nI would not say to the licensee as does the Commission’s decision, ”Y©u may\nspeak but only on the prospective conditions that are laid down in our report.”\nFor my part, I would merely say to the licensee, \"You may speak,”\n14. However, even if I were willing to adopt the approach which places\nexpress prospective conditions on the right to editorialize, I could not sub¬\nscribe to a condition as vague as the concept of the duty to be fair. For\nwhere constitutionally valid conditions are imposed on speech by governmental\nauthority, the standards by which one is required to act should be stated in\nsuch a way as to be clearly ascertainable. Cf. Winters v. New York, 333 US\n507. I do not believe that the conditions imposed here are made\"\"cTear enough\nto serve .as an adequate guide to the conduct licensees will be required to\nfollow if they are to avail themselves of the right to editorialize. Insofar\nas the doctrine of fairness has been announced and applied in particular cases,,\nthat doctrine may well have concrete meaning. Cf. In re thiited Broadcasting\nCompany (ViHKC), 10 FCC 515. But outside the- context of particular circum-\nstances, I do not believe that an a priori standard so broad and vague has\nsignificant meaning. We all, of course,, can agree that licensees should be\nfair in the operation of their stations. But in the absence of past examples\nof the. application of the standard fairness to particular situations involv¬\ning editorialization by licensees, I do not see how licensees will be in a\nposition'to ascertain the meaning of the. doctrine .of fairness as it must be\napplied to. the myriad of factual situations which arise in connection with\n3/1 I should, however, like to make completely clear that I; believe the Governmer\nhas full authority by proper measures .to prohibit the. use of radio in connection\nwith activitiesjArhich it may under the police powers prohibit. Cf. Shenck v.\nUnited States, 249 US 47. Hence Congress has prohibited the utterance of any\nobscene, indecent or profane language by means of ..radio communication (Sec. 1364\nof thVu.S.Criminal Code (18 USC 1364; 48 Stat. 1091)., formerly. Sec. 326 of the\nCommunications Act) and-the broadcast of Lottery information (Sec. 1304 of the\nU.S, Criminal Code (18 USC 1304; 48 Stat. 1088), formerly Sec. 313 of the Communica¬\ntions Act)."
}