{
  "id": "d893-194",
  "text": "LIMIT POWER OF RADIO STATIONS\n935\nMr. Walter Tiscri?\nMr. Tison. Hera.\nSenator Johnson. Mr. Tison, yon may insert your statement in the record\nand give us oral testimony with respect to it, and with respect to th® bill*\nSTATEMENT OF WALTER TISON, OWNER AND MANAGER, RADIO STATION WALT, TAMPA, FLA.\nMr. Tison. Yes, sir. % name is Walter Tison. I am th© owner} *nd manager\nof Station WALT, in Tampa, Fla., which is assigned to a daytime allegation of\n1110 kilocycles and operating now on 1,000 watts.\nMy station is comparatively new, although I have been in th-3 business\nsince 1922. In this particular station that I am operating I bj competing in\nthe city of Tampa, Fla., with two full-time network-affiliated newspaper-owned\nradio stations.\nWhen I decided to put in this particular station that I now own and operate\nmyself I was confronted with the problem of being able to f.4nd a suitable fre¬\nquency upon which to make the application for the station. A survey of the fre¬\nquencies disclosed that I could possibly apply for a daytime station which was\nthe only frequency that would be available under any conditions in the city of\nTampa, Fla.\nOur situation in Tampa and over most of th© State of Florida is that all\nof the frequencies that are in use outside of the so-called clear channels are\nlikewise used by Cuban and Mexican stations.\nIn the city of Habana, Cuba, alone there are some 12 transmitters. Most\nof these transmitters are separated by 30 kilocycles, and aach of them can be\nheard at times very clearly in Tampa. As a matter of fact, we hear Mexican and\nCuban jabber running on most of the frequencies all day long, with the exception\nof the so-called clear channels.\nThe situation in the Tampa area further is that in Cuba when our delegation\nnegotiated the last treaty or the last understanding., they actually placed some\n15,000-watt stations on so-called regional frequencies on which the maximum\npower that can be used is 5,000 watts. As <i result, those 15-kilowrit stations\nthat are operating in Cuba are heard vary clearly in the State of Florida."
}