{
  "id": "d893-3",
  "text": "- 4 -\nAnd the courts ;ha,ve. conq.iatently upheld Commission action- giving recognition\nto and fulfilling- that intent of Congress* ~KFA3 Broadcasting Association .\nv. Federal &*dlp, Commission* 47 F. 2d 670; Trinty Iie^thodist Church, S~outh\nv* Federal .Badio Commission. 62 F. 2d 850, certiorari denied. 288 U.S. 599-,\n6.It is axiomatic thht one of the most vital questions of mass\ncomuiiier.ticr* in a democracy is the development of. an. informed public opinion\nthrough the public dissemination of news and ideas concerning the vital-public\nissues of the day. Basically, it is in recognition of the great contribution\nwhich r-\\clic can make. in. the' advancement of this purpose that portions of the\nradio spectrum are allocated t.o. that form-of radio communications known as\nradio-broadcasting. Unquestionably, then, the standard of public interest,\nconvenience and necessity as applied to radio-broadcasting must be inter¬\npreted in the light-of this basic purpose. The Commission has consequently\nrecognized the necessity for licensees to devote a reasonable percentage of\ntheir broadcast time to the presentation of news and programs devoted to\nthe consideration and discussion of public issues of interest in the com¬\nmunity. served by the particular station. And we have recognized, with re¬\nspect to such programs, the paramount right of the public in a free society\nto.be informed and to have presented to it for acceptance .or rejection\nthe different attitudes and viewpoints concerning those vital and often\ncontroversial issues which are held by the various groups.which make up the\ncommunitysr' It.is this right of the public to be informed,, rather than\nany right; on the part of the government, any broadcast licensee • or- any\nindividual:- member, of the public’ to broadcast his own particular views on\nany matter, which is the foundation stone of the American system;of broad¬\ncasting. . • a-\n2/cont l'd.\nt.he recent radio conference met this issue squarely. It\nrecognized'that in the present state of scientific develop- ■\n, Hcnt there must bo a limitation .upon the number of broad¬\ncasting stations- and it recommended that licenses .should\nbe issued .only to those stati ns whose operation would\nrender h benefit to the public, are Accessary i;i the. pub¬\nlic interest or would-co'htributc to the development of .\nthe art. -. This 'principle was approved by every'witness\n•before your committee.' Ue have written it into the bill.\nIf. enacted- into law, the broadcasting' privilege will .\n. .0 , rij^ht, of. self ishness. It will rest upon an\nassurance of nu\nadded)\nAnd this view that the interest of the 1:’stoning public rather than the\nprivate interests of particular licensees was reemphasized as recently\nas June 9, 1948 in a unanimous report eff the Senate Committee on In¬\nterstate and Foreign.:-Commerce on S, 1333 (80th Cong.), which would have\namended the present Communications Act in certain respects. See S. Bep't\nNo. 1567, 80th Cong,, 2nd Sess,,'pp. 14-15,\n1/ Thornhill v. Alabama, 310 U.S. 88, 95, 102; Associated Press v.\nUnited States 326 U.S. 1, 20."
}