{
  "id": "d893-5",
  "text": "- 6 -\nmay not be particularly apprcpm.ate or advantageous, moreover, in many\ninstances the. primary H controversy0 will he whether or not the particular\nproblem should he disc-us-sed at all; in such circumstances) where the licensee\nhas determined-that the subject is of sufficient import to receive broad¬\ncast attention,, it. would obviously not be in the public interest for spokes¬\nmen for one of the' opposing points of view to be able to exercise a veto\nmower oyer -the entire presentation by refusing, to broadcast its position.\nFairness, in such circumstances might require no more than that the licensee\nmake a reasonable effort to secure responsible representation of the particular\nposition and, if it fails in this effort ., to continue to rake available its\nfacilities to the spokesmen for such position in the event that,.after the\noriginal programs are broadcast, they then decide to avail themselves of a\nright to reply-to present their contrary opinion. It should be remembered,\nmoreover that discussion of public issues will not necessarily bo confined\nto questions which are obviously controversial in nature, and, in many eases,\nprograms initiated with no thogght on the part of the licensee .of their\npossibly controversial nature will subsequently arouse controversy and op¬\nposition of a substantial nature which will merit presentation of opposing\nviews. In such cases,, however, fairness can be preserved without undue\ndifficulty since the facilities of the station can bo made available to the\nspokesmen for the groups wishing to state views in opposition to those ex¬\npressed in the original presentation when such opposition becomes manifest.\n. 9..Wo-do not believe, however, that the licensee *s obligations to\nservo the public interest can be met merely through the adoption of a\ngeneral policy of not refusing to broadcast opposing’ views whore a-demand\nis made of the station for■broadcast time. If, as we believe to be.the\ncase, the public interest is best served in a democracy through the ability\nof the people to hear expositions of the various positions taken by re¬\nsponsible groups and individuals on particular topics and to choose between\nthem* it is evident that broadcast licensees have an affirmative duty gen¬\nerally to encourage and implement the broadcast of all sides of controversial\npublic issues over, their facilities, over and beyond their obligation to make\navailable on demand opportunities for the expression of opposing views. It\nis clear that any approximation of fairness in the presentation of any con¬\ntroversy will be difficult if not impossible of achievement unless the licensee\nplays a conscious and positive role In bringing about balanced presentation\nof the opposing-viewpoints.\n10. It should be recognized that there can be no one all embracing\nformula which licensees can hope to amply to insure the fair and balanced\npresentation of;all public Issues. Different issues will inevitably re¬\nquire different techniques of presentation and production. The licensee\nwill in each instance be called upon to exercise his best judgment and good\nsense in determining what subjects should be considered, the particular\nformat of the programs to be devoted to each subject, the .different shades\nof opinion to be presented, and the spokesmen for each point of view. In\ndetermining whether to.honor specific requests for time, the station will\ninevitably be confronted with such questions as whether the subject is worth\nconsidering, whether the viewpoint of the requesting party has already re¬\nceived a sufficient amount of broadcast time, or whether there may not be"
}