{
  "id": "d893-7",
  "text": "issues or to ,rend,er ineffective the available ''safeguard? /of that oye?g,ll^\nfairness which is th:e essential .element of operation in the'nublic’interest.\nWe id* not Relieve .that any such consequence’Is • Either inevitable or.probable,\nand we have \".'therefore come to the conclusion that overt-licensee editor iali-\nzat-ion, within reasonable limit's and subject'to the •genial.requirements\nof fairness, detailed above, is not contrary to the public interest.\n• . . • . j .\n14. The Commission has given careful consideration to corftent-ions\nof those witnesses at the hearing who stated their belief.that any overt\neditorializ.ation or advocacy by broadcast licensee is per se contrary\nto the public interest* The main arguments advanced by these witnesses\nwere that overt editorialization by.broadcast licensees would not be con¬\nsistent with the attainment of balanced presentations since therevwas a ‘\ndanger, that the institutional good will and the production resources‘ at\nthe disposal of broadest licensees would inevitably influence public opinion\nin favor of the positions advocated in the name of the licensee and that,; '\nhaving taken an open stand on behalf of one position in a given •controversy,\na licensee is'not likely to give a fair break to the opposition. vWe be¬\nlieve, :howevef, that these fears are largely misdirected, and that- they\nstem/from a‘confusion of the question of overt advocacy in the name-of the-\nlicensee, 5 with ‘the broader issue of insuring that the station's broadcasts\ndevoted to the consideration of public issues will provide the listening\npublic with a fair and .balanced presentation of differing viewpoints oh \" •;\nsuch issues, without regard to the particular views which may be'held or\nexpressed by the licensee. Considered, as we believe they must be,' as- - \"'\njust one-of several types- of presentation of public issues, to be afforded\ntheir appropriate-and non-exclusive place in the station's total, \"schedule '\nof‘programs devoted to balanced discussion and consideration-of public issues,\nwe’ do not believe-that programs in• which the licensee's personal opinions'\nare expressed are intrinsically more or less subject to abuse than any other\nprogram devoted to public issues* If it be true that station good will and\nlicensee prestige, where it exists, may .\"give added weight to opinion'ex¬\npressed by the 1'icensee, it does not foilov; that such opinion should be‘ ex¬\ncluded from the air any more than it should in the case erf any individual\nor institution which over a period of- time has built up a reservoir of good\nwill or prestige in the community. In any competition for public acceptance\nof ideas; the skills and resources of the proponents, and opponents will\nalways have some measure of effect in producing the results sought. But it\nwould not be' suggested that they should be denied expression of their opinions\nover the air by reason of their particular assets. Uhat is. against the pub¬\nlic interest is for the licensee \"to stack the cards\" by a - deliberate- selec¬\ntion of spokesmen for opposing points of view to favor one viewpoint at the.\nexpense'of the other, whether or-not the views of those spokesmen are id^nti-\nfiedlas the views of the licensee or of others. Assurance of fairness must in\nthe final analysis be achieved, not by the exclusion of particular 'views ,\nbecause of the,source of the views, or the forcefulness with which the view\nis expire so od, but by making the microphone available, for the'presentation\nof contrary- views-without deliberate restrictions designed'to imped'e' equally\nforceful presentation. ’ /• ■"
}