{
  "id": "d1389-3",
  "text": "to circumscribe your thinking by so much as mention\nof possible subject areas. Look for the kind of teacher\nwhose lectures students would flock to even if they\nweren’t registered in the course—avoiding, of course,\nthe ham who does it with comedy rather than humor,\nwho offers glittering puffballs rather than serious\ncontent.\nSubmit these programs in the usual way realizing\nthat few can be chosen at any one time but that making\na number of promising lecturers so available will\ncontribute mightily to Network programing and to\nthe importance and prestige of the Network here and\nabroad.\nMoreover, you will find excellent use on your own\nstation for any such programs the Network cannot\nfit into its schedule at this time.\n• Recommendation 2: Again, there is hardly a\ncampus where a great number of faculty and visiting\nfaculty and guest lecturers do not make many out¬\nstanding talks to special groups on special occasions.\nThere is hardly an educational broadcasting establish¬\nment that does not record many of these talks. An\nevaluation of how good each is must necessarily follow\nthe talk, for in such special cases even a known\nteacher may perform in an unexpected way. Many\noutstanding talks are recorded in this manner, but\nbecause of their one-time nature they tend not to\nfind their way to the Network unless the speaker is\nvery important.\nHere is a plan for tapping this treasure. You will\nreceive shortly a set of very brief questionnaires asking\nthat you return a completed one on each occasion\nwhen you have taped what you consider a truly out¬\nstanding talk feature and when the talk is not topical\nand you are in a position to save the tape. The\nquestionnaire will elicit information regarding the\nsubject, length, editability, etc. From this information,\na file will be built up categorizing these program avail¬\nabilities according to general subject area (or accord¬\ning to other categorizations that may suggest them¬\nselves once returns start coming in). When a category\nis sufficiently built up, the related programs will be\ncalled for and a series announced and presented to\nthe Network.\n• Recommendation 3: Many of you are doing well\nwith adult education programs which are really non¬\ncredit audit courses. This is to recommend that\nmember stations share the most successful of these\ncourses where manuals and/or other supplementary\nmaterials are available.\nWe want to solicit from those institutions which\nare having success with such courses information re¬\ngarding these courses, and whether the tapes and\nmanuals could be provided and at what price. At the\nsame time, we will have to know whether stations\nwould be interested in presenting tried and tested\ncourses of this nature, in a foreign language for\nexample, for which a fee would have to be charged.\nListener enrollees would pay for the printed matter\nwhich accompanies the courses.\nIt would be an opportunity to affirm audience in¬\nterest in the most concrete of ways.\nMay we have reactions on this question? And\nyour reactions to, and further thinking on the entire\nquestion of Network programing. The vitality, the\nvery existence, of the Network is absolutely depend¬\nent on the active participation of every member.\n—O. L. Press\nPublications\n• The Ford Foundation has issued a 68-page pic¬\ntorial report on the growth of educational television.\nCopies are free on request from the Ford Foundation,\n477 Madison Avenue, New York 22.\n• The Television Information Office has reprinted\nthe first four chapters of Television and the Child, the\nstudy published in 1958 by the Nuffield Foundation.\n• Indiana University’s A-V center has released a\n1961 supplement to its 1960 Catalog of Educational\nMotion Pictures. There are 650 new titles in the sup¬\nplement, making a total of more than 7,000 new films\nnow available from the film library. Information re¬\ngarding the supplement is available from the Circula¬\ntion Department, Audio-Visual Center, Indiana Uni¬\nversity, Bloomington.\n• The National Association of Broadcasters has is¬\nsued a 5-page reprint from the American Bar Associa¬\ntion Journal urging a revision of Canon 35 to permit\nbroadcasting and television courtroom proceedings.\n• RCA and Lowry Technical Training Center at\nDenver have issued another brochure, this one called\n“Technical Training by Televised Instruction.”\nPLACEMENT SUPPLEMENT\nMay I — Producer-director. MA, Annenberg School of Com¬\nmunications; experience teaching and as ETV producer-\ndirector in many subjects and at different levels. Married.\n$6,000.\nMay 2 — ETV director, manager, or coordinator. MS; educator\nat all levels, electronics and systems engineer, systems\nmanagement specialist; 3 years of business management\nexperience. Location open. $10,000.\nMay 3 — ETV producer-director. MA, University of Michigan;\nexperience with MPATI, 5 years of teaching in high\nschool and university, 4 years in all phases of ETV.\nPrefers university or ETV station. Married. $6,500.\nMay 4 — Director. BA, University of Michigan; TV production\nexperience in commercial direction. Location open.\nMarried. $5,500.\nMay 5 — TV writing and directing. BA in communications; 7\nyears of experience in radio and TV, (both commercial\nand educational TV). Single. $5,000. Location open.\nMay 6 — Station manager/producer-director. BA in journalism;\n10 years of commercial TV experience. Desires to enter\nETV. Married. Location open. $10,000.\nMay 7 — Film work. BA in English. Prefers editing or directing\nwith films. Single. Prefers New York City location.\nSPECIAL: SUMMER EMPLOYMENT ONLY — Junior journalism\nmajor, Rutgers University. Directs public affairs for\ncampus station, part-time in news department for local\ncommercial station. Desires work in ETV for summer.\n4\nNEWSLETTER"
}