{
  "id": "d1389-7",
  "text": "Mary marries Lord Bothwell who rescues her from the revolt\nfollowing the victory of the English forces over the Scots. Mary\ndecides to go to England to ask peace, but the escort sent out\nto meet her takes her to jail instead of to the Palace.\n*No. D43-50. Napoleon Bonaparte.\nPart I. The Coronation of Napoleon. Coronation setting. Part\nof the ceremony. Napoleon refuses to kneel before the Pope to be\ncrowned. Seizes the crown, puts it on his own head, and strides\nout of the Cathedral of Notre Dame. Upon his return to the\nPalace, he calls Josephine to witness the execution of a very close\nfriend of hers, Count Eric von Steinwaldt. Napoleon declares\nwar on Austria. Part II. Napoleon Attempts Come-Back. After\nhis escape from Elba, Napoleon raises a small army and attempts\nto reconquer France. Addresses his troups. Is captured after his\ndefeat at Waterloo. Breaks his sword before giving it to the Duke\nof Wellington. Granted permission to see his wife and son before\nbeing banished to St. Helena. His wife spurns him.\nNo. D45-48. Napoleon Bonaparte.\nPart III. Decides to Consolidate Gains. Youth attempts to stab\nNapoleon at a victory parade. The youth refuses to ask forgive¬\nness in return for his life. Napoleon awakens to the hate which\nfollows his conquests. Realizes he must retrench and consolidate\nhis gains by peaceful means. He tells Josephine he is going to\ndivorce her so he can remarry and have a son of royal blood.\nPart IV. Napoleon Conquered. Marie, the new Empress, dis¬\ncusses the impending birth of a child with Napoleon’s mother.\nBoth regret Napoleon’s lust for power. A son is born. In a sur¬\nprise attack, Paris is taken by a coalition of armies. Napoleon is\ntried and banished to Elba. Makes his farewell address to his\ntroups.\nD71-77. Johann Strauss.\nPart I. Strauss a Good Business Man. Linker and Strauss work¬\ning on a waltz. Discuss the composition. Mention Sigrid von Eld\nwhose singing can be heard. Herr Hoffmeyer, Strauss’ publisher\ninterrupts bringing a new contract for Strauss to sign. Strauss re¬\nfuses until the sum offered has been multiplied many times.\nPart II. Johann Left at the Wharf. Johann and Sigrid start to\nrun away together. Johann very unhappy. She leaves him un¬\nexpectedly. Meets Count von Friedorff on the dock and tells him\nhow to locate Sigrid. Linker and Poldi discuss Johann.\nr\n*No. D72-76. Johann Strauss.\nPart III. Strauss Goes to Vienna Woods with Mme. von Eld.\nFame and fortune comes to the Strausses. Plan a picnic, but Mme.\nvon Eld calls and invites Strauss to go with her to the home of\nCount von Friedorff. She takes him to the Vienna Woods. She\n8"
}