{
  "id": "d1436-12",
  "text": "-12-\nCALIBRATION OF TV STUDIO MATERIALS\nty\nHarold Wright, Canadian Broadcasting Corporation\n(This paper is reproduced with the permission of the Canadian Broadcasting\nCorporation. Mir. Wright, who is Supervisor of Technical Instruction in the\nNational Operations Office of CBC in Toronto, Canada, presented the paper at\nthe Sixth Annual Conference of the Western Association ©f Broadcasters, held\nat Vancouver, B.C. March 2, 1956)\nINTRODUCTION\nIn the design of settings for monochrome television programs the\nrelative reflectances of the various paints, fabrics and other materials\nmust be known in advance if the original concept of the design is to be\nmaintained. A constant problem is the confusion of color contrast with bright¬\nness differences. Two colors of quite different hue, but each having the\nsame reflectance will be reproduced as a single shade of gray and the tonal\nseparation between the two will be lost. This has happened many times in\ntelevision studios, usually to the embarrassment of the designer and others.\nThis points up the need for an easy means of determining the relative\nreflectances of the various materials used.\nEARLIER METHODS\nOriginally, the method for calibrating materials required two or\nmore cameras together with studio facilities and the RETMA gray scale. Samples\nof paints and fabrics were placed under flat light and the nearest matching\ngray scale step was chosen with reference to the control room picture monitor.\nThis was a cumbersome system with too many variables to ensure high accuracy.\nLighting, video control, camera tube age etc. all combined to produce at times\nsomewhat misleading results. It was felt that if all materials could be\nmeasured by a single instrument, results would be much more uniform.\nREFLEGTOMETER APPROACH\nThe reflactometer, a device seldom found outside of research laborator¬\nies, will satisfy these requirements provided the instrument’s color response\nmatches that of the camera tube. One of the simplest of these devices is the\nBaumgartner Reflectometer. A ten inch hollow metal sphere with a three inch\nopening in the bottom is fitted with a pair of light-sensitive cells and a\nsmall microammeter. The inside of the sphere is painted with a highly reflect¬\nive matt white paint so that it functions as a lifht integrating device. The\nlight source is in the form of a small projector unit with lamp, condenser\nlens and objective lens. The main barrel of the unit is mounted on an offset\nswivel so that the light beam from the projector may be made to strike the\nwall of the sphere or bounce off a test sample under the bottom opening. These\ntwo conditions are illustrated in Fig 1 (a) and 1 (b). The brilliancy of the\nlight source may be adjusted by means of a rheostat."
}