{
  "id": "d1436-2",
  "text": "2\nThe paper states that video tapes may be spliced or edited\nlike audio tape recordings. They will be interchangeable from\nmachine to machine. They can be erased and new material recorded\nmany times. ’’However, so much of the machinery and electronics\nare common to both record and play back functions that no substan¬\ntial cost reduction is in sight for a play back only machine, and\nindeed no production is planned for equipment solely for play back\npurposes.” (Direct quote from Mr. Ginsberg’s paper.)\nCBS, NBC, and Ampex will participate in the application\nexperiments. Ampex officials expect that the production models\nwill benefit greatly from these experiments and as a result they\nare leaving many operational standards open in order to benefit\nfrom this trial use. It is hoped that on production models perfect\nsyncronization of picture and program sound may be effected which\nwill greatly facilitate editing.\nAmpex officials make no claims that video tape will replace\nhigh quality 35 mm film. They state that the best video picture\nquality is not comparable with good original film. However they\ndo forsee an application in motion picture production. Sequences\nmay be shot simultaneously on film and on tape and the tape im¬\nmediately played back for review without the delay necessitated by\nprocessing. This should result in a considerable monetary saving\nin motion picture production, although for this application too\nthere are many problems to be solved.\nMr. Snyder stated that a full engineering report, display and\ndemonstration of the Ampex Video Tape Recorder will be presented\nby Mr. Ginsberg at the Fall Convention of the Society of Motion\nPicture and Television Engineers which will be held in Los Angeles,\nOctober 8-12, 1956.\n#####\nFrom reports received from 31 engineers attending, the NAEB\nRadio and Audio Engineering Seminar was an unqualified success.\nOne of the indications of its success was the desire, expressed\nby practically all of those present, that future seminars of a\nsimilar nature be held annually or at least every two years.\nMany indicated a willingness to pay their own expenses to future\nmeetings."
}