{
  "id": "d1436-5",
  "text": "5\nn\nThis raises the question, \"How do I get to know the other\nNAEB engineers ?\" To date, there have been two NAEB-sponsored\ntelevision engineering workshops and the recently concluded radio\nengineering seminar at Allerton Park. This makes a total of 80 NAEB\nengineers who have had an opportunity to get acquainted with those\nwho attended a workshop or seminar. Another way would be for engin¬\neers to take a more active part in NAEB activities by attending NAEB\nregional meetings and the annual NAEB Convention held in October\nof each year.\nThe Engineering Committee has spent considerable time dis¬\ncussing professional advancement and recognition of technical per¬\nsonnel . They have done something about technical advancement through\nthe workshops and seminars. Recognition is something else, and the\nwriter believes this is something which has to begin with the person\nconcerned. We believe progress is made along this line. We see\neducational station engineers at annual meetings of the Institute of\nRadio Engineers, Society of Motion Picture and Television Engineers\nand the Audio Engineering Society. Many attended the equipment\nexhibit at the recent NARTB Convention in Chicago. To us this is an\nindication that our engineers are advancing professionally. Their\nstation directors and managers know attendance at such meetings is\nstimulating and worthwhile. We know of one instance where an in¬\nstitution pays its chief engineer's professional society annual dues.\nThe point is obvious. They must believe it is worth the expenditure.\nWell, it looks as if we took the long way around to say you’re\ngoing to receive a questionnaire asking what test equipment who have\nand what you’d like to use on a loan basis. We ask your cooperation\nin completing the form we send and promptly returning it,\n********\nA new 16-mm test film that measures registration; aperture\nsize, resolution, shutter timing, centering of the image, steadiness\nof its own test image with respect to the perforation, and also pro¬\nvides a \"thousandths scale\" for measuring film movement in double¬\nexposure testing of printer steadiness has been announced by the\nSociety of Motion Picture and Television Engineers. Providing in"
}