{
  "id": "d1157-2",
  "text": "March Lb, 1939\nPage 3\nN«A.E.B, News better\nRUTGERS AND WOR FACSIULATE\nThe Agricultural Extension Service of Rutgers University is cooperating\nwith WOR in the presentation of a aeries of printed pictures and lessons\non amateur gardening. The series is scheduled to start soon.\nNEW RADIO WORKSHOP FOR KWSC\nA. A. Cleveland will be in charge of a new Radio Workshop wh&ih will\ngive teachers attending the State College of Washington, Pullman, an\nopportunity to engage in practical radio work.\nNEW COURSE AT UNIVERSITY OF KENTUCKY\nA course in radio broadcasting, to be taught by Elmer Sulzer with\nassistance of the WHAS staff, has been scheduled for the first term\nof the University of Kentucky summer session. Elmer explains that -\nthe course will give teachers, especially, an opportunity to learn about\nthe techniques of preparing and broadcasting educational programs.\nRADIO SHORT COURSE FOR LEGISLATORS\nLimiting enrollment to 20 men, WHA, held a \"Radio Short Course\" for\nWisconsin legislators recently. Three nestings were held with the\nlawmakers. Subjects treated were: radio speaking, radio writing, and\nyour voice in wax, or the study of voices by the recording process.\nHEARINGS POSTPONED\nThe WSUI hearing on application for CP to increase\n5 KW daytime, and 1 KW nighttime, with dlreotional\nhas been postponed from March 27 to April 17.\npower from 1 KW to\nantenna at night,\nThe WHA request for facilities of WMAQ, and the use of 50 KW, unlimited\ntime, has been postponed to May 1st.\nMINNESOTA SCHOOL OF THE AIK\nAmong the features offered the schools and citizens of Minnesota by\nthe University of Minnesota Radio Station WLB are the programs of the\nMinnesota School of the Air. The Minnesota School of the Air comprises\nthe formally organized Instructional broadcasts presented by nL3. Among\nthese are seven programs planned especially to supplement classroom\nwork. During the past semester osfrer 17,000 Minnesota students have\nlistened to the Minnesota School of the Air broadcasts. In addition\nto the classroom broadcasts, the School of the Air offers organized\ninstructional programs for the general public, altho a number of these\nare adaptable for classroom use also.\nThese urograms are approved by the State Department of Education and\ntheGRadlo6^ommittee of the Minnesota Education Association, and are\nintegrated with the approved state courses o^ study."
}