{
  "id": "d1325-1",
  "text": "PAGE 2\nSelection or next convention site and dates-\nElection of officers-\nThe opening session will be held at 9:30 a.m« local time (which will 8e\nSTANDARD TIME FOR MiCHIGAN) ON MONDAY, SEPTEMBER 30o\nNAEB LUCHEQ?! AT SBC\nThe NAEB Executive Committee has voted to ho» o a luncheon in with\nTHE School Broadcast Conference at the Conti r c;>4TAL Harrt^’ CHiCArio, on •^ondoY^\nOctober 2f- Details will be announced later-\nThe School Broadcast Conference, the tenth annual, will be held October 21,\n22, AND 23, George «^ennings, Director of the Conference, predicts attendance\nWILL TOP ALL PREVIOUS RECORDS- LAST YEAR, MORE THAN 300 DELEGATES FROM ALL\nPARTS OF THE COUNTRY ATTENDED- The CONFERENCE WILL TREAT WITH THE VARIOUS\nUSES OF RADIO IN EDUCATION- One SESSION WILL BE DEVOTED EXCLUSIVELY TO\nPROBLEMS OF THE VETERAN AND RADIO, A NEW EQUIPMENT EXHIBIT, INCLUDING\nTELEVISION, FACSIMILE, AND RECOROlO, WILL BE ONE OF THE FEATURES, TOO- HOTEL\nRESERVATIONS SHOULD BE MADE EARLY-\nSEORGE also wants me to SAY THAT MEMBERS OF NAEB ARE INVITED TO SEND STATION\nAND PROGRAM PROMOTIONAL MATERIAL TO THE S3C FOR DISTRIBUTION. MATERIAL 3HOUI.\nBE ADDRESSED TO GeORGE ^ENNINQS, SCHOOL BROADCAST CONFERENCE, HOTEL CONTI¬\nNENTAL, Chicago, It should arrive no later than Saturday, October 19,\nGREETINGS FROM KENT\nThe editor has had a note from Colonel Harold W- Kent, President, Kamehameha\nSchools, Honolulu, T, H, Harold promises to write more fully later of the\nVERY magnificent PLANT AND A STORY OF SOME CF THE SCHOOL*S P^ANS TOR THE\nFUTURE.\nLEARNING FOR LIVING\nThat*s the title of Waldo Abbot*s annual report for 1945-46, covering activiti\nOF the Bureau of Broadcasting at the University of Michigan. It’s quite a\nSTORY AND WE NOTE WITH PLEASURE PLANS FOR THE MICHIGAN FM STATION .‘vATX.\nSENER AT SOUTHERN CAL\nBill Fcner, formerly of Iowa and Minnesota, has assumed his new duties as\nDIRECTOR OF BROADCASTING FOR THE UNIVERSITY OF SOUTHERN CALIFORNIA. USC\nHAS PLANS FOR PUTTING AN FM STATION ON THE AIR SOON, BUT B«LL PROMISES TO\nSEND FULL DETAILS LATER, SO WE’LL LEAVE THAT ITEM FOR ANOTHEFI IGSUL,\nDOTS AND DASHES\nAllen Miller, Director of the Rocky Mountain Radio Council, Fv^.ns to attend\nTHE Chicago SBC and to attend the NAEB luncheon-Carl Mene^r and Acting\nProgram Director John Hightower or/^UI will attend the NAEB meetinvG at\nEast Lansinq,...fW- 1- Griffith says it is doubtful if he*ll get to East\nLANSI NG* , - . . A'HA STAFF |3 RECOVCRIN^^ FROM ITS TWO-WEEK iNf'iiJTE'"
}