{
  "id": "d1103-11",
  "text": "12\nIndiana University News-Letter\nproperty of substances. If one wishes to make an elastic substance\nlike rubber, it is necessary to find out how the atoms are combined,\nthe nature of the combinations, and how many of the units must\nbe stuck together. Studies with ozone, ultracentrifuges, spectro¬\nphotometers, all these and many more, contributed their part\ntoward the production of synthetic elastomers—so good that they\nare better than nature’s own product. The point to be emphasized\nis that these recent war developments are merely an emergency\ndiversion of thousands of peacetime investigations. The purpose\nof these investigations was not for war—but for peacetime use.\nMany of these studies were merely inspired by intellectual curi¬\nosity and their purpose was to add to our knowledge and raise our\nstandard of living.\nSince 1939 the number of new inventions and of new funda¬\nmental discoveries has markedly dropped because chemists have\nbeen so busy applying old information that they have not had\ntime to investigate new projects.\nIt is clear that all of the new developments call for clear\nthinking on the part of carefully trained chemists in many differ¬\nent fields. It is the function of the teaching staff in the Department\nof Chemistry at Indiana University to provide proper instruction\nin the fundamental fields of chemistry, both for undergraduate and\ngraduate students. It seems very probable that chemical research\nand application will develop to an even greater extent following\nthe close of World War II than it did following the close of\nWorld War I. The opportunity is here both for new students and\nfor returning veterans.\nRalph L. Shriner,\nChairman of the Department\nof Chemistry.\nBusiness\nQT\nHEN the enemy hit America in 1941 America went to work\nand performed a production miracle.\nAnd our armed forces who are conquering Europe and Japan\nbear witness to this production miracle in the endless miles of\ntanks, the long railroad trains of guns, the flying fields carved out\nof every corner to hold the overflow of planes."
}