{
  "id": "d1103-13",
  "text": "14\nIndiana University News-Letter\neffective switch-throwers—advertising and selling. Mass produc¬\ntion depends upon mass consumption. Mass selling creates mass\nconsumption. Take mass selling out of the picture and mass pro¬\nduction would serve only to fill warehouse space.\nLittle do most people realize that distribution is inextricably\nbound up with that miracle called the American standard of living,\nbleakly, but forcefully, expressed by the presence in every 100\nAmerican homes of 89 radios, 79 passenger cars, 68 bathtubs, 40\ntelephones, all of which were not brought into use by spontaneous\ndemand!\nAt the end of the war—which has made distribution a govern¬\nment problem—it is. estimated that no less than 50 per cent of the\nsalesmen formerly employed will have to be replaced. In many\nwar plants, an entirely new sales organization will have to be\ndeveloped.\nWhile distribution methods in general will not change much\nin the postwar era, it is reasonable to assume that the sales task\nahead of distribution managements will call for tremendously\ngreater effort. Accordingly, the quantity and quality of distribu¬\ntion personnel will have to be larger and better.\nIt is our belief that colleges and universities can aid business\nenterprises whose sales organizations have been depleted and which\nhave to rebuild a marketing staff from scratch.\nA man who wants to be a lawyer, a doctor, or an engineer\nhas the choice of numerous institutions, that will prepare him for his\nprofession; up to 1920 a student who wanted to train for a business\ncareer had few institutions worthy of the name.\nTo help lift the level of business as a profession, Indiana Uni¬\nversity employed the formula that raised the levels of medicine,\nlaw, dentistry. In 1920 they established a school of commerce so\nthat college-minded high school youth possessing a vocational interest\nin business would have a place to go for university training, and\nyouth not sure of the field they wanted to enter as a life work\ncould be exposed to the opportunities of a career in business.\nThe increasing extent to which business executives and gov¬\nernment officials look to Indiana University for young persons\ntrained in the various fields of business is evidenced by the fact that\nthe School of Business has been enlarged three times since its\nestablishment in 1920. The present building, opened in 1940, is\nconsidered one of the best equipped in the country. Curricula"
}