{
  "id": "d1103-2",
  "text": "Indiana Looks Ahead\nIL3 OR the fifth time in the last century and a quarter educational\nreadjustment following a major period of conflict becomes\nthe problem of those who hold that social, economic, and cultural\nadvancement is based on teaching and training. In the immediate\nfuture this problem holds the attention in a more intense way than\nin any of the previous periods of postwar change.\nPrimarily this is true because the success of our armed forces\nin the active preparation and progress of the war has proved\nagain that the trained man and woman are the ones upon whom we\nmust depend. This emphasis on training will be carried over into\nthe period following the war. Naturally, it will not be the\nintensive accelerated type.\nOur colleges and universities have made such a contribution\nto the war effort that much time must pass before the entire\nstory can be told. As we worked with and for the army and\nnavy we, too, learned many lessons which will be translated\ninto teaching programs after the war.\nThe returning veterans will seek the advantages of the best\nin education that we can give them. We cannot forecast how\nmany men and women will take the opportunities offered but we\ndo know that the number who will enroll in our educational\ninstitutions will be astonishing. Every estimate which I have\nseen has indicated that facilities for teaching will be strained to the\nlimit. Side by side with the veteran will be the young man and\nyoung woman who have found formal education interrupted by\nwork in industry.\nFrom these students in the next few years must come the\nphysicians, the lawyers, the dentists, the teachers, and the com¬\nmunity leaders, both in city and on the farm. Practically every\nfield of professional endeavor faces a deficit of trained men and\nwomen.\nHere in the heartland of our nation, the great valley of the\nMiddle West, we have not developed to its fullest extent our\ngreatest natural resource. The fine minds of our boys and girls\nconstitute a greater potential contribution to our country than\nall the coal and oil and products of the soil. Too few of these\n(3)"
}