{
  "id": "d1103-22",
  "text": "Indiana Looks Ahead\n23\nIndiana has been parsimonious in its support of health agencies.\nWe are one of the few states among the eastern states which still\nuses part-time health officers; we spend far less money on our health\ndepartments than do most states; our death rate is definitely above\nthat of the United States as a whole. Even more to the point, it is\nabove that of the surrounding states. We are embarrassed to say\nthese things, but they are true. Only those persons who have done\nnothing about these facts need feel ashamed. Those who have\nfought hard for the healthful way of living can hold their heads\nhigh even though they wish the story were different.\nThe future must be better. We have done well in lowering\nour death rate here in the Hoosier state, but we have not done well\nenough. We must do better from now on. Such being the case,\nas a representative of the State Board of Health, I am proposing a\nsix-point program for the consideration of the people in this\nmomentous year, 1944.\n1. We should increase state and local appropriations for\nhealth. It is said that the war this year will cost $98,000,000,000.\nIndiana’s proportionate share would be about $3,500,000,000. Now\none-tenth of one per cent of this sum would be $3,500,000. In other\nwords, one year of killing and destruction will cost Indiana as\nmuch as one thousand years of health administration with its\nsaving of life and health. Does that seem extravagant? It is\nonly one dollar for every man, woman, and child. Health is a\npurchasable commodity to a very large extent. It is our most\nvaluable asset. We must buy all of it that can be had. It is a\nbargain.\n2. The health laws of Indiana have been slowly collected\nover a period of seventy years; these laws are often obsolete, often\ncontradictory, frequently ridiculous, and always hard to find in\nthe law books. A commission should be appointed to study, rewrite,\nand codify all the health laws and have such a code ready for the\nlegislature of 1947 to pass. This will require an act of the legisla¬\nture of 1945 to set up such a commission. Immediate action is of\nthe utmost importance to the health program of Indiana.\n3. The State Board of Health is in much need of reorganiza¬\ntion. As it now operates, it is essentially (except for size) as it\nwas fifty years ago when there were but two full-time employees.\nThis reorganization should be worked out in harmony with the\nhealth code mentioned earlier so that it may implement that code."
}