{
  "id": "d1103-9",
  "text": "10\nIndiana University News-Letter\nPhysics\nITH its possibilities as a factor in the future treatment of\nsuch a dread disease as cancer, as well as leukemia, the\ncyclotron naturally ranks high among the marvels of physics.\nWith the cyclotron the physicist adds parts to the atom and takes\naway parts. He changes one atom into another with different\nchemical and physical properties. These artificially produced\nchemical elements are a new tool in the hands of all branches of\nscience, and their effect upon the future course of scientific develop¬\nment is beyond the range of prophecy.\nStanding near the cyclotron in recent physical marvels is the\nelectron microscope which permits magnification fifty times greater\nthan is possible with the most powerful optical instruments. This\nmicroscope has revealed to man for the first time that common\ncolds are caused by a virus, an organism more minute than the\nsmallest bacteria ever observed by any other process.\nOther marvels of physics in recent years are: television, in\nadvanced stages of development; radar, an almost superhuman aid\nto the military forces in detecting and locating enemy craft; the\n200-inch astronomical telescope now being constructed in southern\nCalifornia; cosmic rays coming in from space, possibly announcing\nevents which man has never observed; refinements in the airplane\nand radio; and others, many of which are still concealed under the\ncloak of military secrecy.\nWithout any reference to the divine, we often speak of these\nthings as miraculous, perhaps because they are so recent. However,\nliterature shows that radio-activity, X-rays, and the telephone were\nconsidered equally miraculous in the days of their discovery and\ndevelopment. Before them were the telegraph, railway, steamship,\nmicroscope, telescope, electricity, magnetism, and other marvelous\ndevelopments and discoveries without end.\nIn looking ahead, all of us are wondering how long the list\nof miraculous discoveries in physics will continue to grow.\nThe unanimous feeling of physicists on theTndiana campus is\nthat the opportunity for physical research was never so promising,\nand that, with a sufficient number of competent workers in the\nfield, the harvest will continue to grow more and more abundant."
}