{
  "id": "d659-133",
  "text": "M\"/7\nNAEB HEADQUARTERS (/\n14Gregory\nUrbana, Illinois\nTO:\nMembers, Research Comalttee\nFROM:\nH. J, Skoraiajf^/ f\nSUBJECT:\nFact Sheets ^\n1\nDATE:\nSeptember 6, 1957\ny/.£. MUa.\nAt the tins of the Research Committee meeting in Chicago, August 7 and 8\n(or in sene cases previously), the foilwing Individuals were given the\nfollowing Research Documents or reports on which to do Fact Sheets,\n(Robert Coleman was given none because of the very heavy burden of reports,\naccounts, etc, he has as NAEB Treasurer, and his agreement to serve as\na member of the Committee with that understanding).\nIrving Merrill - BBC: Hurt ffind study*\nClarence Flick - CBC Reports,\nGale Adkins - Anne Durham Robinson°s thesis,\nKenneth Harwood - The Thayer (Ohio State, Research Grant-dLnUid) Study,\nKeith Tyler - The FAE (Glenn Burch) Study*\nRaymond Cheydleur - 2 ETRC studies (Fact Sheets on both already received).\nSam Becker - The Ed Browne Thesis (for evaluation and^ possible Fact Sheet\nreport).\nKenneth Harwood also still has the Hew York University study for fact Sheet.\nSince various other reports have nw been received, t am sending the\nfollowing persons the following second reports on the? same basis:\nGale Adkins - (Since he (you) did the preliminary study report)S fand\nfor the Advancement - Purdue Uni varsity Study,\nClarence Flick - The (Schramm Stanford; \"Audience for ETV in the San\nFrancisco Bay Area\" (July 1957).\nIrving Merrill - Thesis (20 pp., by Frances Jewell.(4^7 Norwood Ave.,\nBuffalo)/: \"The Training of Teachers to Teach on Television\".\nSam Becker - \"The WQED Audience\" study, by Howard Roland.\nAs others come in, 1*11 ship to Harwood, Tyler, and Cfoeydleur, in that\norder*\nI know it's a lot to ask, but to avoid strewing these out, it would certainly\nbe nice to have these by about September 23, so we could get them run and\nlist them in the October (convention issue) Newsletter, as the committee\nsuggested. Otherwise they*11 have to wait tUTtfeUovember issue, pretty\nlate to help people who need them as soon as possible, I know we°re all\nburning midnight oil, but there* s very little value to these unless they\nare current."
}