{
  "id": "d659-47",
  "text": "BOARD OF EDUCATION OF WASHINGTON COUNTY\nHagerstown, Maryland January 16, 1957\nCLOSED-CIRCUIT TELEVISION\nPROJECT NOTES\n\"Good morning members of the twelfth grade English classes of Hagerstown. This is a unique\nand important occasion for all of us. You are participating in the first lesson to be telecast\nin the Washington County Closed-Circuit Television Project. I am now looking straight into\nyour eyes and into the eyes of each of the 900 members of this class. Our class work is con¬\ncerned primarily with the art of communication and we are using the most recent and spectac¬\nular development in the field of mass communication—television—to enable us to work to¬\ngether. Our closed circuit is-— \"\nThe speaker was Mr. Edward C. Kercheval, instructor in senior English. The time was 9:10\nA. M., September 11, 1956, the second day of the 1956-57 school year. The first televised\nlesson was on the circuit. The anxious faces of the group that had been working to initiate\nthe project began to relax. Plans were becoming a reality. At intervals during the day the\nprocess was repeated with general science, geometry, and United States History. Newspaper\nreporters in the schools recorded the reactions of pupils and teachers and agreed that here was\na great potential for the improvement of the educational program.\nThe events of this first day of telecasting were the results of many months of planning and\nworking together that had developed much enthusiasm in all who were working on the project.\nThis background included the preparation of the proposal by the Board of Education and staff\nof what the project would include; c six-weeks summer workshop which developed the teach¬\ning procedures to be used; the installation of 12.5 miles of coaxial cable which connected the\nschools participating in the first stage of the project; the development of a television center\nto provide the facilities for preparing and transmitting the lessons; the orientation of all\nteachers in the system to the use of television in the instructional program; and the utili¬\nzation of the press, radio, demonstrations, and public meetings to acquaint the public with\nthe plans for the project.\nThe first lessons were televised from a makeshift studio with mobile equipment. Lack of equip¬\nment restricted the program to the four high school instructional areas for the first several\nmonths of operation. Gradually permanent equipment replaced the mobile temporary equipment\nand a television center was developed. By December 1956 the elementary school classes were\nstarted and the full program was in operation.\nInterest in and enthusiasm for the project have continued to mount. Teachers are suggesting\nways of improving the program and requesting opportunities to use television for supplementing\nregular class instruction. The project has awakened a general interest in the instructional\nprocess throughout the entire system. It has set off a chain reaction that is stimulating the\nprofessional growth of teachers. The television project has been a means for developing\ninterest in the total educational program."
}