{
  "id": "d659-49",
  "text": "of county Parent-Teacher Associations, and Board of Education and Staff. The press\nannouncement was carried by the Associated Press and the United Press wire services.\nThe story received favorable nation-wide publicity including editorial comment in a\nnumber of instances. *•\nWASHINGTON COUNTY CLOSED-CIRCUIT TELEVISION PROJECT PROPOSAL\nThe proposal presented to The Fund and to RETMA was broad in scope and general in\nnature with the idea that it would be implemented and organized as a continuing pro¬\nject through planning with school personnel and interested citizens of the community.\nA five year project was proposed under the direct control of the Washington County\nBoard of Education.\nThe formal proposal follows:\nThe Washington County School System is interested in making a thorough study of\nthe ways closed-circuit television may be used by a public school system as an\nintegral part of the regular program of instruction and in making an evaluation of\nthe various methods that are developed. It is proposed that the project will be\ncarried on over a period of five years beginning in September 1956, in the follow¬\ning important areas:\n1 . Direct instruction of pupils in the basic subject matter offerings of the curriculum\n2. Supplemental motivation and enrichment of the program wherever feasible\n3. Extension of the in-service training program of teachers\n4. Interpretation of the school program to the public\n5. Improvement in the quality of the school program\nData will also be gathered to evaluate the effectiveness of television in meeting\nsuch current educational problems as:\n1 . The enhancing of the status of teaching\n2. The relation of pupil-teacher ratio to the quality of instruction\n3. The continuation of rapidly increasing enrollments\n4. The lack of adequate classroom space\n5. The shortage of properly trained and certified teachers\n6. The organization of the school system to effect savings in personnel\n7. The distribution of the finances available for the school program\n8. The greater use of school, community, and county resources\nEmphasis will be placed on developing ways that closed-circuit television may be\nused under normal conditions. Careful records of what is done will be kept for\nrestudy and eval uation.\nDuring the initial operation of the project the emphasis will be on exploration, try\nout, and development, to discover the most effective ways of using closed-circuit\ntelevision. From these experiences it will be possible to study experimental areas\nwhere tests, measurements and the details of research seem appropriate. The pre¬\nliminary experiments will, therefore, grow out of the developmental phases of the\n-3-"
}