{
  "id": "d659-5",
  "text": "MSB Headquarters\nlii Gregory Hall\nUrbana, Illinois\nMay 23, 19#\nMr* Gala Adkins, Director\nBureau of Research in Education\nby Radio-Television, U* of Texas\nAustin, Texas\nDear Gale:\nTour letter is well-taken, (Incidentally how ls the Fact Sheet you*re to do\nfor us coming? If you become a contributor (or editorTTHTHgear up your\nchock),\nI*ve been asked »vjhy not radio and TV?\" before* If you or someone else can\ndig us up comp arable stuff on radio, we'll bo glad to make the switch* But\neveryone I've begged to do this has let mo down end I can't invent it* And\nI don* t think the Fact Sheets should unearth too ancient materials from pre-\nTV days on radio* So, \"Barcas ie willin'\"—-but where do m get this in an\nago of scores of grants to TV for such studies but none for radio?\nYou'll note that I (subtly?) try to infiltrate the TV Fact Sheets whenever\nI can with mentions of radio (as I did in review of Akflf \"'^oumaT, BBC materi¬\nals and Philadelphia School reports) to keep readers reminded not to by-pass\nradio* Until I get more, that's all I can do*\nIf we send those TV Fact Sheets to radio-only people, they'll ask the same\nquestion you've askeB, only'louder, and I'll have several hundred more let¬\nters of explanation to write*\nNevertheless, in our new rate proposal to come up at Atlanta for vote. If the\nrecommended increases in dues are made, everyone will get these as a part\nof membership service* Frankly the service was starred to gat evidence for\npeople to present to their Boards, where ::TV Channels were in danger. Nigh-\nbert called to sey these saved the day for him. It was not visualised as a\nmember service as such. The subscription charge has winnowed out those who\nmerely threw thorn sway, so far. And whenever anyone has really needed, and\ncouldn't pay, wo0ve not turned them down.\nIf you, or the Research Commlttse, or anyone you know, can get ms digests of\nthe \"useful studies in Radio Research” we'll change the title of the service\nand issue thorn promptly. Since I've now been riding herd on this alone,"
}