{
  "id": "d659-51",
  "text": "All teachers directly and indirectly connected with instruction by television will\nhelp to evaluate results in working with problems such as:\n1 . Defining aspects of subject matter areas most suited to the use of television\na. Developing interest and motivation, providing information, performing\ndemonstrations\nb. Identifying areas that do not seem to be suited to television procedures\nc. Probing the contribution of television to such areas as guided study, in¬\ndividual problem solving and group discussion\n2. Adapting mass presentation to the varying needs and abilities of individual\npupils\n3. Exploring the possibilities that television can provide for more individual in¬\nstruction through the redeployment of teacher assignments and redistribution of\nteacher responsibilities\n4. Adapting the use of telecasts so that the initiative of individual class groups to\nshare in planning their learning experiences will be preserved\n5. Identifying barriers to the acceptance of this medium and suggesting ways to\novercome them\n6. Establishing communication among teachers concerning the use of telecasts so\nthat procedures may be improved through pooling and sharing\n7. Demonstrating the ways that the use of television will effect savings\na. in the total number of teachers needed\nb. in teacher effort\nc. in resources\n8. Establishing limits of tolerance for television instruction through observation\nof pertinent factors such as:\na. attention span\nb. physical limits - eyestrain\n9. Discovering the extent of planning that must be done to orient a school for the\nutilization of instruction by television\n10. Establishing a basis for determining the nature and type of television equipment\nmost suitable for school use\n11 . Identifying the problems involved in installing, operating and maintaining\nequipment\n12. Discovering the kinds of specialized and technical personnel needed for the\nsuccessful operation of instruction by television\n-5-"
}