{
  "id": "d659-63",
  "text": "EXPLAINING THE TELEVISION PROJECT TO THE PUBLIC\nThe Closed-Circuit Television Project has been explained in demonstrations to:\nw\nParent Teacher groups - regular meetings (10)\nService Clubs - regular meetings (6)\nCounty Teachers Association\nAmerican Association of University Womeh\nJaycettes\nCounty Council of Parents and Teachers\nPUBLIC USE OF SCHOOL TELEVISION RESOURCES\nThe facil ities of the circuit were made available to the C. and P. Telephone Company for\nthe ceremonies connected with the change over to the new dial telephone system on\nDecember 9, 1956.\nEVALUATION\nIn order to determine the effectiveness of television as a medium of instruction, it is\nimportant that careful evaluation be a part of every aspect of the project. It was felt\nthat this evaluation should not be rigidly pre-determined but grow out of the experiences\nof the first year's work in orienting teachers and trying out ways of working with this\nnew medium. As a result of the summer workshop experience and the actual participation\nin developing televised instruction, data are now being collected to provide a basis for\nevaluating along such lines a;\n1 . Surveying and summarizing community reactions to the use of the television medium\nas judged by pupils and parents\n2. Registering the desire or the lack of desire of regular classroom teachers to function\nas television teachers\n3. Studying the success of pupils in large classes under the leadership of capable class¬\nroom teachers\n4. Studying the achievements of pupils of varying ability and contrasting the results with\nprevious records and with other pupils not participating in the television project\n5. Studying the results of standardized tests in subject matter areas as well as those tests\nthat are constructed by television teachers\n6. Reassigning teachers in such a way as to enable them to make their greatest contri¬\nbution to the teaching process by performing those phases of the procedure for which\nthey are best suited because of interest, training and experience\n7. Recording the special ways in which the learning skills of questioning, observing,\nlistening, assigning, etc. are employed\n-16-"
}