{
  "id": "d1400-3",
  "text": "4\ncarry on. When the anticipated support was not forthcoming, LRI dropped the\nlaboratory and devoted nearly all of its efforts to planning and preparation of\ncollege credit courses for national telecasting. In cooperation with NBC, it\ndeveloped and presented nationally for credit: Atomic Age Physics, Contem¬\nporary Mathematics, and Modem Chemistry. During Midwest Airborne’s\nformative years, LRI personnel, headed by John Ivey, assumed the responsibility\nfor the production of its taped courses.\nAfter some disagreement on costs with NBC, LRI switched in 19 61 to CBS\nfor its network distribution but was unable to get NBC to relinquish the Con¬\ntinental Classroom title. NBC continued to use the name and to re-run the\nHarvey White series; LRI was obliged to adopt the title College of the Air for\nthe CBS series. It broadcast ‘The New Biology’ on this network and currently\nit is presenting ‘The American Economy’ on lb2 CBS stations and 54 ETV\nstations. Three hundred sixty-three colleges are giving credit for this course,\nand 110 school systems are giving teachers in-service training credits.\nSome 25,000 study guides have been sold in connection with this course, which\nwas actively promoted by the Joint Council on Economic Education. A finance\ncommittee, headed by Edward Ryerson, raised $1,53 6,000 from Ford ($833,000)\nand from more than 100 corporations ($703,000) to underwrite the series —\n$61,000 over the budget!\nIn February, LRI worked out an agreement with NBC whereby LRI, in return\nfor $34,232, was assigned title to the Continental Classroom Physics,\nChemistry, and Mathematic series; it then gave NETRC the kinescope and\ntapes and exclusive right to distribute these series in North America . It has\nalso agreed to turn over all rights to ‘The American Economy*’ to NETRC.\nLRI, which has moved its office to the NETRC headquarters at 10 Columbus\nCircle, also entered into an agreement with the NETRC to not engage in future\nproduction of instructional television programs and was about to go out of\nbusiness at the end of the 19 62-63 fiscal period. However, because uncer¬\ntainty arose as to the future of nationwide instructional TV, it could not be\ndetermined what organization should logically succeed to the LRI activities\nand assets.\nAt one point, it had been anticipated that NETRC would enter into instruc¬\ntional TV. Subsequently, when the Ford self-study move developed, questions\narose as to whether NETRC, Airborne, or some group was the most appropriate\nfor developing instructional television. Consequently , no final decision has\nbeen made as to whether or not to liquidate the corporation.\nPending the outcome of this matter, LRI will continue and is considering\nthe feasibility of transmitting scrambled medical education programs over ETV\nstations. It has authorized $5 0,000 for such a study to be made."
}