{
  "id": "d1215-0",
  "text": "Washinj U w eport\nThe National Association of Educational Broadcasters\nVol. II No, 2 ' Dupont Circle Bldg., Washington 6, D. C. February, 19&L\nFEDERAL AID FOR ETV\nProspects appear good for enactment during the 87th Congress of some form of\nfederal aid to ETV. Four bills have been introduced similar to those introduced by\nthe same authors in the last session. H.R. 132 j by Rep. Roberts (D.-Ala.) author¬\nizes federal matching grants of up to $1 million for each state, D. C., and Puerto\nRico, for construction of TV facilities for educational purposes. Prerequisite to\napplication for funds is submission of a state survey, for which grants up to\n$10,000 would be made. Principal changes: matching grants are now required of the\nstates'\"Tor the survey; the application for survey funds must be made solely by a\nduly constituted state ETV agency (former bill included an officer responsible for\nsupervision of public education). H.R. 645 by Rep. Boggs (D.-Ia.) is similar and\nH.R. 965 by Rep. Harris, Cbm., House Commerce Committee, is identical to the\nMagnuson bill. This latter, which has passed the Senate at the last two sessions,\nwas reintroduced by Sen. Magnuson (D.-Wash.), again co-sponsored by Sen. Schoeppel\n(R.-Kan.). Since its introduction it has gained bi-partisan support by adding two\nmore sponsors: Sens. Metcalf (D.-Mbnt.) and Cooper (R.-Ky.). This bill would make\noutright grants up to $1 million for establishing or improving ETV broadcasting\nfacilities in each state and D. C.\nSen. Nhgnuson has set the hearings on his bill before the Senate Inter¬\nstate and Foreign Commerce Committee for March 1 and 2.\nOptimism among supporters of ETV concerning passage of ETV legislation stems\nfrom: pledge of support by President Kennedy (\"I will actively back legislation\naimed at this objective at the next session of Congress.”); plank supporting ETV in\nthe Democratic platform; sponsorship of an ETV bill by the Chm. of the House\nCommerce Committee; the prospect of a reorganization of the House Rules Committee\n(where bills have died at the last two sessions); and a general atmosphere in the\nCongress more favorable to federal aid to education. Furthermore, veteran\nWashington observers point out, it usually takes a bill almost three sessions to get\nsufficiently well known and to gather enough support to make it all the my.\nPETITION FOR RULE MAKING\nPennsylvania State University has requested the FCC to amend rules so as to\nallocate VHF Channel 3 to State College, Pa., and reserve it for educational use at\na separation of 157 miles from WRC-TV, Philadelphia, and 163 miles from WSVA-TV,\nHarrisonburg, Va.\nWILSON HEADS AMERICAN COUNCIL\nAt a meeting here on January 25 of its members (of which NAEB is one), the\nAmerican Council on Education elected Dr. Logan Wilson, now chancellor of the\nUniversity of Texas, to be president of the Council. Under Dr. Wilson’s administra¬\ntion the University of Texas has embarked upon a plan to link by microwave 11\ninstitutions of higher learning for cooperative use of instruction and has taken the\nlead in organizing the Southwest Texas ETV Council, which has a CP for Ch. 9 in. the\nAustin-San Antonio area.\nDr. Arthur Adams, who is retiring as president of ACE this spring, ms the\nprime mover in setting up the JCET, organized the first national seminar on ETV\n(Penn State, 1952), and has been a constant friend and supporter of the ETV move¬\nment."
}