{
  "id": "d1215-1",
  "text": "mOW TO HEAD FCC\nNewt on M. Minow, a member of Adlai Stevenson* s law firm, has been named by\nPresident Kennedy to be chairman of the FCC. He succeeds Fred Ford, who will continue\nas a commissioner. In an interview Mr. MLnow, a sergeant in the Signal Corps in\nWorld War II, said, \"I prefer the information and educational type of programing,\nbut I like everything.'* He told Broadcasting: \"ETV? The country needs it badly.\nVery badly.\" MLnow is counsel for the Midwest Airborne Television Project.\nAdjectives that have been applied to him by the trade press: liberal, bright, active,\noutgoing, and civic-, political-, social-minded.\nTV ALLOCATIONS AND ETV\nIndustry trade press is tailing notice of NAEB's national survey project to deter¬\nmine education*s needs for TV frequencies. Dec. 26 issue of TV Digest: \"Basic to\nFCC's allocation thinking is the all-channel set. In fact, belief is that such sets\nmust be fairly well distributed before a true decision can be made. However, a new\nand important factor is about to enter picture — ETV and its potential hea-vy UHF\nrequirements. If ETV requests and gets substantial number of exclusive UHF channels,\ncommercial interests mil begin to worry about lebensraum any time anyone talks of an\nultimate shift of all TV to UHF. Earlier this year, FCC Chmn. Ford, in an off-record\ntalk to educators, chewed them out for not having a long-range nation-wide allocation\nplan. They took words to heart, intend to come up with recommendations. Question is\nwhen. Ford apparently expects it soon, to be considered in whole TV picture . . . .\"\nASSISTANT TO NAB PRESIDENT HAS ETV EXPERIEI\\[CE\nJohn L. Perry, former Florida newspaperman and administrative assistant to Gov.\nLeroy Collins of that state, has been named assistant to the president of the National\nAssociation of Broadcasters. Formerly he wag assistant to the president of Learning\nResources Institute and assistant to the president of the Midwest Council on Airborne\nTelevision Instruction. Mnst recently, during October and November, i960, he served\nas public administration consultant for the planning of a permanent interstate\norganization for the MPATI.\nJCET DEVELOPMENTS\nAt a meeting January 3 of the Board of JCET, preliminaiy steps were taken\nlooking toward a reorganization in which the council would continue as a policy¬\nmaking group representing the educational community in matters relating to ETV but\nwith staff services assumed by others and made available to the council. This deci¬\nsion followed report that only $20,000 had been pledged of the $4^0,000 needed for\ncontinuing long-range support. In preparation for the next meeting (February 3),\nthe NETRC and NAEB are to develop a joint plan for carrying on staff services and a\nstatement on JCET's functions in such a relationship is to be prepared by the newly-\nelected officers: Chm. Lawrence Dennis, vice pres., Penn State University; Vice Chm.\nEdgar Fuller, exec, sec., Council of Chief State School Officers.\nMPATI, NAEB VISIT USOE RE TITLE III\nA delegation from the Midwest Airborne project and NAEB conferred recently with\nOffice of Education officials concerning the admission under Title III of antennas,\nconverters, and amplifiers as integral parts of TV receivers.\nAirborne people emphasized importance to project of outside antennas and master\nantenna systems equipped with converters for reception of the Airborne UHF trans¬\nmission. NAEB supported the MPATI plea and indicated importance to whole ETV move¬\nment of improving reception in fringe areas and for coping with set conversion\nproblems in UHF areas.\nUSOE people showed sympathetic interest; agreed to consider the matter and\nissue a directive in the near future.\nGroup included Wayne 0. Reed, Deputy Commissioner; John R. Ludingfcon, director\nof state and local branch; Jim Miles, project manager, MPATI; Wayne Watson, assoc,\ndir., MPATI; and NAEB President Harley."
}