{
  "id": "d1215-7",
  "text": "ACTIONS (Frequency Modulation)\nBoard, of Education of the City of Atlanta, Atlanta, C-eorgia\nGranted CP for a new station: Channel: 90.1 me. (Ho. 211); 400 watts:\nantenna 200 feet. (BPED-35)\nRural Radio Network, Inc,\nThis group received conditional grants for six new PM stations to serve\nrural Hew York State areas. This is the maximum number of PM stations which\ncan be operated by the same interest.\nThose initially authorized Class B stations, each to operate with 1 IT* power\nare to be located at places and on FM channels as follows: Hewfield, H.Y.\n(Channel 236, 95.1 me); Be Tuyter, H.Y. (Channel 286,015.1 me.); Cherry Valley,\nH.Y. (Channel 270, 101.9); Highmarket, H.Y. (Channel 299, 107.7 me.); South\nBristol, H.Y. (Channel 270, 101.9); and Wethersfeld, H.Y. (Channel 299, 107.7).\nPlans call for operating the 6 stations as a network, programs being origina¬\nted at each station from time to time, but allstations will carry the same pro¬\ngrams. The method would be to relay program materials from any station to the\nothers, each of the latter simultaneously receiving and transmitting the particu¬\nlar program. Programs will be designed for localrural and agricultural listeners,\nfeaturing weather and market reports, religion and jnusic, agricultural talks and\ndiscussions, quiz and children’s programs.\nRural Radio Hetwork, Inc., is a Hew York corporation wholly owned by Rural\nRadio Foundation, a non-profit group comprising nine farm organizations — the\nHew York State Grange; Hew York State Farm Bureau Federation; Cooperative Grange\nLeague Federation Exchange, Inc.; Hew York State Federation of Home Bureaus;\nNew York State Poultry Council; Hew York State Vegetable Growers* Association,\nInc.; Hew York State Horticultural Society, Inc., and Hew York Artificial Breeders\nCooperative, Inc.\n(COMMISSIOHER JOHES VOTES FOR A HEARING)\n’■SEZ-Board, of Education, City of Chicago, Chicago, Ill.-Granted modification\nof CP for Extension of completion date to 5-1-48. (BMPED-87)\nUHA-FM- State of Wisconsin, State Radio Council, Madison, Uis.- Granted modi¬\nfication of CP to extend completion date to 2-1-48. (BHPED-89)\nKVRF - School District #4, Lane County Oregon, Eugene, Oregon - Granted modi¬\nfication of CP to extend completion date to 12-1-47. (3MPED-88)\nTB0E- Cleveland City Board of Education, Cleveland, Ohio - Granted modifica¬\ntion of CP to extend completion date to 2-29-48. (BMPED-SO)\nWFITJ - The Trustees of Indiana University, Bloomington, XU. - Modification\nof construction permit (B4-PED-29), which authorized a new noncommercial education¬\nal broad'ast station for extension of completion date.\nBoard of Education, City of Buffalo, Buffalo, H,Y. - Adopted an order vacating\nthe Commission’s action of January 27, 1942, granting application (BPED-24) for a\nnoncommercial educational FM station and dismissed the application without pre¬\njudice for failure of prosecution."
}