{
  "id": "d1461-10",
  "text": "jpage 11 - Bulletin - I \"arch 27\nStation WILL, University of Illinois, Urbana, have a very interesting array o'f talent,\nand make this suggestion in bold-faced type - \"Please Post.\" We suspect that these\ntwo words save a good many leaflets from the waste basket and result iti serving many\nlisteners *\nStation KSAC at Kanhattan, Kansas, have a unique program, known as Young People’s Hour.\n>n this is duscussed such topics as, \"Who should go to college?\" \"Why I came to\ncollege\" \"The Present status of engineering\", and many other topics of interest to\nprospective students and their parents#\nStation WRUF, Gainesville, Florida, are broadcasting a series of farm radio programs\nfor Florida# In order to make sure of covering the state this information is also\noroadcast by WQAT, Tiami; WBDO, Orlando; WSUN, St# Petersburg; WCOA, Pensacola; and\nW3R, Jacksonville#\nStation WSUI, University of Iowa, Iowa City, Iowa, are presenting an unusual program\ncnown as the Speech Clinic of the Air# It is of service for the listeners who have\nspeech defects and discusses the problems involved in correcting these defects# Another\nprogram that is proved to be a real service is the one prepared by the Iowa Federation\nof Women’s Clubs# This has been running since October# Approximately 150 clubs arc-\nusing the broadcast as a study course with at least 300 known individuals who are not\nmembers of the club* A series of constructive and timely topics are being discussed\nby prominent individuals on the faculty and elsewhere in the state who are recognized\nauthorities in their respective fields#\n.TOSU, Ohio State University, continue to broadcast a constructive program. We note\nthat they have invited the private and denominational schools of the state to make use\nof the University station* We are sure that this is a courteous thing to do and makes\nmany friends for the University.\nAn additional feature being added to the WNAD work this Spring is a cooperative project\nas developed by WOSU of Ohio State, and WHA of Wisconsin* Last week WNAD released its\nfirst announcements of the first annual radio play tournament for Junior Colleges and\nSenior High Schools of Oklahoma# Later we hope to have a Senior College group. The\ndates for the Junior College assembly are April 4, 5 and 6# The announcements had\nbeen in the mail only three days when we received our first five entries in the'Junior\nCollege division* The Senior High School tournament will be staged on April\"25, 26\nand 27. Both of these contests are under the co-sponsorship of Phantom Ia.sk, WNAD,\nand the Oklahoma State Forensic Association, in which all the groups are participating\nas' enroled members. We are receiving a universal cry for printed material on sugges¬\ntions as to how to broadcast radio plays. In our libraries we have some ’book’ mater¬\nial. What we need is a release of some 8 or 10 mimeographed pages that will give con-\nlensed suggestions, directly to the point, dealing with this phase of educational\n/ork# Will some station official come to our rescue and supply us with such material\nit the earliest possible date?\n’he annual WNAD play writing contest, sponsored for the laymen of this state, has just\n)een brought to a close# Plays were submitted from all sections of Oklahoma by indi¬\nviduals in various walks of life—lawyers, doctors, college students, and even a bar¬\nker. From the list received, a state committee selected the 9 best# From this list\n9, a group of three judges selected the 3 best# These 3 are being submitted to\n># P. Tenser, production manager, N.B.C., Chicago; Trs. Vida R. Sutton, director of\nWlagic of Speech Hour’, N*B#C#, New York; and William Friel Heimlich, director of drama¬\ntics, Ohio State University. The three judges will announce first, second, and third\nchoices of the plays submitted# We shall be very happy to supply all information as\n;o how we conduct this contest in this state to any interested person# Write to direc-\n;or T# II. Beaird, WNAD, Norman, Oklahoma, if you would like to receive copies of the\nrules governing radio play tournaments sent to Junior Colleges and High Schools. The\nsuggestions and regulations can well be adapted to fit any community#"
}