{
  "id": "d1461-11",
  "text": "12\nBRITISH & GERMAN GUESTS VISIT N-A-E-B CENTRAL OFFICE\nA touring delegation from the bi-zonal area of the British and American zone in\noccupied Germany, studying agriculture information methods via press and radio\nin the U. S. spent an afternoon at N-A-E-B central office (WOI, Iowa State College,\nAmes) during the course of their tour.\nThe group includes Dr. Hans Schlange-Schoningen of the German Bi-zonal Dept, of\nFood, Agriculture and Forestry Military Service in Frankfurt; Guy E. Hughes,\nBritish Representative, who is Deputy Chief of the Agricultural Section in the\nBritish area and Gwynn Garnett, Executive assistant to the Chief of the Food,\nAgriculture, and Forestry Division in Germany.\nJUDGE HAS RIGHT TO OFFER RADIO EXCLUSIVE\nA Federal court ruling in los Angeles has upheld the right of a judge to\ncontrol his courtroom by granting a radio station exclusive permission to\nbroadcast judicial proceedings. A $150,000 suit by KFI against Superior\nCourt Judge Kenneth Morrison and station KVOE of Santa Ana was dismissed by\nFederal Judge Ben Harrison. It was charged civil rights had been violated when the\nhome town (Santa Ana) station had been given exclusive rights over a murder trial\nshutting out KFI in Los Angeles from broadcasting the proceedings.\nTEN BROADCASTERS MAMED TO DEFENSE PANEL\nTen broadcastersaesigna^e(^by Justin Miller, NAB president, to form an advisory\npanel on civil defense, will meet in Washington Friday, July 9, to discuss with\nSecretary of Defense Forrestal’s office the preparation of plans for any future\nnational emergency.\nChosen to represent AM. FM. and television, in an over-all group touching all\nparts of the broadcasting industry, the committee will meet with Herbert\nSchroll. communications advisor of civil defense planning.\nThe radio figures named to the panel were:\nJ. Harold Ryan, vp, The Fort Industry Co., WSPD, Toledo, Ohio; John Fetzer,\npres., WKZr9, Kalamazoo, Mich; James LeGate, gen mgr., VfICD, Miami, Fla.;\nEdward Breen, president, KVFD, Ft. Dodge, Iowa; Everett L. Dillard, pres.,\nKOZY, Kansas City; John Shephard III, chairman of the board, Yankee\nNetwork, Boston; Leonard Asch, president, WBCA, Schenectady, N. Y.;\nJ. R. Poppele, WCR, New York; Carlton Smith, television mgr., NBC, New York;\nand William Eddy, WBKB, Chicago. Robert K. Richards, NAB Public Relations\ndirector, will represent the NAB staff on the committee and serve as liaison*\nFIRST FCC REVOCATION ACTION IN TELEVISION HISTORY\nThe Federal Communications Commission instituted the first revocation proceedings I\nin television history against station WTVJ in Miami, Florida. The FCC alleged\nin its order that the station’s owner Southern Radio and Television Equipment\nCompany ’‘knowingly concealed from the Commission facts relative to its ownership ;\nand financial status and has, in addition, made affirmative misrepresentations\nof facts” to the Commission. The FCC ordered WTVJ’s construction permit revoked !\nAugust 30, 1948 unless a request for a hearing on the charges is made by August 20.)"
}