{
  "id": "d1461-12",
  "text": "13 -\nFEDERAL COMMUNICATIONS COMMISSION\nJuly 1, 1948 (Educational) July 31, 194&\nNEWS—APPLICATIONS—ACTIONS\nSPECIAL TEMPORARY AUTHORIZATION ABOLISHED—AUGUST 15\nSpecial temporary authorizations for AVI operation will end August 16, 1948\nthe FCC announced July 28 as a result of proposed rule-making announced February\n6,\nThe FCC notice said the FCC \"noted a general trend by AM stations to use STA’s\nto operate beyond the hours for which they are licensed, many resorting to this\npractice over extensive periods of time.\"\nThe FCC added that the number of STA’s granted to more than 450 daytime or limited\ntime stations had increased \"to such a degree that night service by fulltime\nstations is suffering considerable degradation\"\nThe FCC notice excepted emergency operations for which it pointed out adequate\nauthority in Section 2*63 of the rules. It said that new service (refers to FM)\nshould take care of such night broadcasting.\nEspecially noted by many industry representatives in the report and order was the\nFCC sentence referring to the program revie?/ s\n\"In this connection it may be pointed out that in the future, complaints that\nexisting fulltime stations failed to devote a reasonable amount of broadcast\ntime to such programs (programs for which STA’s were requested) will be carefully\nconsidered by the Commission in connection with renewal proceedings relating to\nsuch stations?*\"\nWOI CHARGES FCC FAILED TO FOLLOW EVIDENCE IN STA CASE\nN-A-E-B station WOI (Iowa State College) charged the FCC with going contrary to\nrecord facts in issuing its order abolishing AM special temporary authorization.\nIn petition filed by Marcus Cohn, Washington counsel, WOI asked the FCC to set\naside its order and either call further hearings or refuse to adopt the rule.\nNoting that nobody appeared in hearing to support the rule, while nine attorneys\nappeared against it, the petition continued:\n\"As the Commission's Report and Order stands, it is public notice that irrespective\nof the testimony introduced or the argument made at any.proposed rule-making pro-\nceeding, the Commission may disregard completely the record before it and come to\na conclusion diametrically opposed to the unanimous record of facts set forth in\nthe record?\"\n\"Elementary notions of administrative processes, fair play, and due process, make it ■\nmandatory that the Commission give consideration and weight to, and base its conclu-\nsions upon the record it its rule-making proceedings* Had the Commission itself pre-.\nsented testimony at the proceeding or had its general counsel made argument, at least]\nthere would have been something in the record on which the Commission could base its !\nproposed rule. The result of the Commission's proposed rule-making in this matter isj\nto make the entire proceeding a sham and an empty gesture at compliance with the Ad- f\nministrative Procedure Act and elementary concepts of due process,\" ;\n------—--- i"
}