{
  "id": "d1461-16",
  "text": "_-U-_\nFCC APPLICATIONS & ACTIONS (TELEVISION) COLLEGE & UNIVERSITY\nApplication for Construction Permit\njNew York: NEW—Cornell University, Ithaca—Construction permit for a new\n•;commercial television broadcast station to be operated on Channel #4, 66-72 me.,\njEPP of visual 13.6 KW, aural 6.8 KVA\nApplication for Completion Date Extension\nI Iowa; The Iowa State College of Agricultural & Mechanic Arts, Ames, Iowa—\n(Application for the extension of completion date for television station accepted\nI for filing (Kile Ho. BMPCT-275).\nSECTIONS OF FCC RULES MOVED INTO NEW PABT\nEffective immediately, the FCC has ordered that certain sections of the Pules and\nPegulations dealing with low-power (radio-frequency) devices, Sections 2.101-2.104,\ninclusive, be transferred into a new part of the Pules and Pegulations, to be\nentitled \"Part 15—Pules Governing Pestricted Padiation Devices.\"\nThese sections are to be temporarily designated as Section 15.1*-15*^i inclusive,\nor Part 15. The old Part 15, covering stations in the war Emergency Padio Service,\nwas deleted effective July 1, 1948*\n—.-.-.—..—i\nHOUSE HEAPINGS ON FCC BEGIN AUGUST 5th\nA special House committee investigating the communications commission will open\na hearing August 5 cm the Commission's recent Fort Huron\"decision. Committee\nChairman Forest Harness of Indiana said the decisionholds that a radio station\nhas no right to censor any broadcast for possible libel or slander, even though\nunder state law the station might be prosecuted for~ criminal or civil libel.\nThe republican congressmen told a reporter the committee will “explore and get~\nboth sides of the question.11 He said members of the commission~and representatives\nof the radio industry will be asked to appear,,\nThe Port Huron decision came in a ruling last month on license renewal for\nstation WKLS of Port Huron, Mich. The station license was renewed for three years.\nThe Harness committee was authorial by the house in June to determine if the\ncommission is acting \"in accordance with law and the public interest.11\nThe initial hearing, expected to last two days, will be confined to the Port Huron\nruling, Harness said. Later, he added, extensive hearings will be held on other\nphases of the investigation, including a study of license grants.\nThe resolution creating the committee authorized it to check whether the\ncommission has licensed or proposes to license stations owned or controlled by\ncommunists or connected with subversive organizations.\nHarness said radio stations and broadcast companies generally are \"greatly\ndisturbed\" over the Port Huron ruling.\nFrank T-. Bow, Committee Counsel, said a federal court at Houston, Texas, will\nconsider the Port Huron case Friday, July }0, The Houston post has asked an\ninjunction ordering that it be set aside, he said."
}