{
  "id": "d1461-2",
  "text": "JJU^U u\nTexas; Norman S. Case, Providence, Rhode Islhnd; Paul A. Walker, Oklahoma City,\nOklahoma; and George H. Payne, New Yo^k, New York.\nThe Federhl Communications Commission was created by Act of Congress approved June\n19, 1934* President Roosevelt appointed Judge Sykes as chairman. The Commission\nhas the power to regulate interstate and foreign communications by wire or radio\nand is composed of three subdivisions; namely, the broadcasting division, the tele¬\ngraph division, and the telephone division. Judge Sykes is chairman, and Commission¬\ners Case and Prall are members of the broadcasting division of the Federal Communi¬\ncations Commission.\nWORK OF THE NATIONAL ADVISORY COUNCIL IN RADIO EDUCATION\nWe suggest that you keep on your desk a supply of the programs made available over\nchain stations by the National Advisory Council in Radio Education. We find it\nvery convenient to put one of these in letters addressed to our faculty who are\nsometimes inclined to feel that there is nothing worth while on the air. We believe\nin recognizing good .programs whenever and wherever presented. If you do not have\nthis material we suggest that you communicate with Dr. Levering Tyson, Executive\nSecretary of the National Advisory Council in Radio Education, 60 East 42nd Street,\nNow York City, and it may be well to ask for a list of the monographs that have\nbeen issued by this council on many topics that will be of interest to broadcasters#\nThey are comparatively inexpensive and are very well worth roading.\nTHE RADIO INSTITUTE OF AUDIBLE MTS\nWo have had considerable correspondence with Mr. Pitts Sanborn, Director of the\nRadio Institute of Audible Arts, 80 Broadway, New York City. This institute was\nfounded by the Philco and Radio Television Corporation. The purpose as announced\n\"is to cultivate a broader appreciation of the audible arts, and generally to ad¬\nvance from a broader social standpoint the effective utilization of radio today.\nThe Institute will attempt to stimulate public recognition and appreciation of the\nbest in radio. It hopes in this way to create a wider demand for good music, news\nbroadcasts, dissemination of opinion, and educational programs, thereby encouraging\nthe public to reap the fullest benefits from existing radio broadcasting, ff The\nRadio Institute of the Audible Arts can quicken public interest in worth while\nradio programs,the enormous influence of the radio for good may be realized.\"\nON WISCONSIN\nOur good friend, H. B. McCarty, Program Director of WHA, Wisconsin State Station,\ninforms us that:\n\"State Capitol Broadcasts\" originate in the WHA studio in the Wisconsin State Capi¬\ntol building in Madison. This series presents on the air each afternoon a senator\nor assemblyman who discusses some problem confronting the legislature. All'legis¬\nlators are invited to use the radio to speak directly to their constituents, and\nthe voters of the state at large. The lawmakers are enthusiastic about this plan\nwhich makes it possible for them to convey their messages without fear of misinter¬\npretation. Time is provided without charge#\n\"In addition to being heard over WHA, \"State Capitol Broadcasts\" are rebroadcast\nby WLBL, owned by the Wisconsin Department of Agriculture and Markets, and'three\ncommercial stations, WIBU, Poynette, WCLO, Janesville, and WTAQ, La Crosse, Wis#\n\"Operating jointly with the state-stations, the University School of Education\nand the Extension Division are presenting \"teachers1 roundtables\" for teachers in"
}