{
  "id": "d1461-3",
  "text": "-page 4 - Bulletin - March 27\nservice* These are virtually weekly tehchefs ihstitutes which make available to the\nregular school faculty meetings; discusfciohs of the newest developments in education.\nThey are broadcast after school, at 4*00 on Tuesdays, so teachers are able to listen*\nEach half hour program is then mimeographed and sent to all who request it* Approxi¬\nmately 1000 copies are distributed each week* If you want a copy - you may get it\nby asking.\nVOCATIONAL GUIDANCE\nA number of the member stations have broadcast some very worth while courses along\nthe line of vocational guidance. One of the most effective ways of presenting this\nmaterial is by use of a dramatic skit. Twenty-three such skits are being given this\nyear by the American School of the Air* One such skit entitled, ”Do you like to\nwork out-doors?’1 written by Marion 17. Towner and two splendid articles on different\nphases of vocational guidance by Dean Wn* F* Russell and John M* Loughran are found\nin March, 1935, issue of Occupations, the vocational guidance magazine.\nThe best part of the story is that Director Franklin'T. Keller of the National Oc¬\ncupational Conference, 522 5th Avenue, New York City, says that we may not only\nbroadcast the skit published in the March issue of Occupations, but plans are being\ncompleted for financing cu plan whereby we not only may use the material but are\nurged to do so, by making the proper courtesy announcement* If this interests you\nwrite to Mr. Keller at the address given above for further details.\nWORLD FEDERATION OF EDUCATIONAL ASSOCIATIONS\nAnnouncement is being made of the next meeting of the World Federation of Educa¬\ntional Associations at Oxford, England, August 10-17* If you or any of the faculty\nmembers of your institution are planning to attend, have them give special attention\nto the programs of the British Broadcasting Corporation, and furnish us a copy of\ntheir report for use next September*\nMOTION PICTURE PROGRAM MATERIAL\nWe have received the script of five splendid radio addresses prepared by Dr* Edgar\nDale, and broadcast as a part of the Ohio School of the Air over WLW* These talks\nare on the general subject ,fTho Motion Picture as a Leisure Time Activity.” The\nspecific titles ares\n1. Learning how to use your leisure time.\n2. How do high school students choose their movies?\n3. What standards do high school students use in judging movies?\n4. Animated cartoons; an interview with Walt Disney.\n6* How to enjoy a motion picture*\nThe best part of this is that Dr. Dale who is recognized as an authority on this\nsubject, generously offers all member stations of the NAEB the privilege of broad¬\ncasting the material he has prepared. Address him c/o Bureau of Educational Re¬\nsearch, Ohio State University, Columbus, Ohio.\n300th ANNIVERSARY OF FOUNDING OF THE AFRICAN HIGH SCHOOL\nHas your station presented any programs in celebration of the 300th anniversary\nof the founding of the American high school? If not, you may receive'helpful sug¬\ngestions for programs by addressing Publicity Chairman M. R. Robinson, editor\nof Scholastic, the national high school weekly, 801 Chamber of Commerce Building,\nPittsburgh, Pa•\nFUNCTION OF THE NATIONAL COMMITTEE ON EDUCATION BY RADIO\nMost of you are familiar with the organization and work of the National Committee"
}