{
  "id": "d1461-5",
  "text": "£ago 6 - Bulletin - l.iarch 27\nThis Meeting is a wonderful place to exchange ideas*\nNCER RELEASES\nAre you receiving and using the NCER Educational and Science releases? Both series\nrepresent a good deal of time spent in the preparation of the material. If you are\nnot getting then may we suggest that you ask for them, consider them carefully, and\nuse them if you can do so to advantage*\nIOWA HIGH SCHOOL BASKET BALL TOURNAI ENT\nIn Iowa, 820 high schools entered basket ball teams in the first contests. All\nbut sixteen teams were eliminated in the county and sectional tournaments. JOI ^\nbroadcast the daylight games by remote control from Cedar Falls, Iowa, with \"Andy\nWoolfries at the mike. This is a service much appreciated by the high school.stu¬\ndents and friends of athletics and education* Between halves and gomes a series of\nshort three-minute talks were given in behalf of the cause of higher education in\nthe state.\nNEXT NESTING OF NATIONAL COMMITTEE ON EDUCATION BY RADIO\nThe committee arc meeting Ponday, : arch 25, to consider the.report of the subcom¬\nmittee oh definite future procedure. The subcommittee consists of President urthur\nG. Crane, University of Wyoming, representing the National Association of State\nUniversities,; Father Charles A. Robinson, S. J., St* Louis University, represent¬\ning the Jesuit Educational Association; and J. 0. Keller, Pennsylvania State Col¬\nlege, representing the National University Extension .association. This is expected\nto be an important session and we will be able to report more details in the April\nbulletin*\nSHORT WAVE BROADCAST\nWr. Wm. I-. Barber, Educational Director of the Nfcrld ''.Tide Broadcasting Corporation,\nUniversity Club, Boston, -ass., invites us to listen to the educational programs\nbroadcast over IHXAL. This is a 5000 watt station operating on 6040 k. c. There\nis a possibility of your being able to receive the short wave programs and re¬\nbroadcast them. If interested, correspond with : r. Barber*\nIn correspondence received from the German Short Wave Broadcasting House, Berlin,\nthey are very much interested in having amateur stations in America listen to the\nbroadcasting of their station DJC which operates on 6020 k. c* They state that\nthe short wave international programs were \"instituted with a double purpose; In\nthe first instance, and more particularly, to furnish our German kinsmen overseas\nwith a pleasant means of re-establishing or maintaining associations with the old\nhomeland, and further, with a view to affording radio listeners generally the op¬\nportunity, through the musical programs and news bulletins and other items pro¬\nvided, of a directer contact with life and amenities in this country, and the\npresent aims and aspirations of its people, than would normally be possible in\nany other way. It was hoped that they might thus help also to further mutual\nunderstanding and friendly intercourse between our two nations.\"\nThe program showing the material available from day to day contains the following\nstatement from a speech delivered by Adolf Hitler:\n\"In the shaping of its relations with other countries the German Govern¬\nment sets out from the principle, that it is of course immaterial what\nsort of constitution and form of government it may please nations to be¬\nstow upon themselves. The determining of its life within its own borders"
}