{
  "id": "d1461-7",
  "text": "p&ge 8 - Bulletin - larch 27\nINCREASED POSTER AT WSUI\nCarl I'enzei*^ Diredtoi* WSUI, Iowa City, Iowa, reports regarding the WSUI grant of\na power increase to 1000 watts day and continuous hours of operation; it is diffi¬\ncult to give anything like an exact statement of the increase in primary coverage\nwithout field strength measurements* Tie do know, however, that our daytime service\narea has been definitely increased and better reception is reported from other points*\nExclusive of Sunday we operate twelve hours daily as a minimum* On some days the\ntime runs as high as fifteen hours. It may interest the fraternity to know that\nWSUI is enjoying excellent frequency stability by the use of a new type \"A” cut\ncrystal* Our maximum deviation seems to be less than one-half cycle* A cathode ray\noscillograph as described in one of my prints available to N*A.E.B, members some\ntime ago is an integral part of monitoring equipment* Station directors should ob¬\ntain some form of cathode ray monitoring equipment as it is extremely valuable*\nWSUI operates in conjunction with television station W9XK to broadcast a program of\nboth sight and sound on regular schedule twice each week* These programs are trans¬\nmitted on Tuesday and Thursday evenings at 7:30 o'clock* W9XK is now using a power\nof 100 watts on a frequency of 2050 k* c* The scanning equipment utilizes a 45 hole,\n3 spiral disc* Experimental work is being conducted with a view to adding a 5 meter\ntelevision transmitter to the system*\nDEBATING AT WOI\nFor several years WOI, Iowa State College, Ames, Iowa, has offered a series of radio\ndebates with other colleges* The response has always been good. This year as one\nof the debates an Iowa State College team debated Kansas State College over radio\nstation WOI on February 7 on the question of the feasibility of adopting the uni¬\ncameral legislative system in the State of Iowa* A number of members of the General\nAssembly listened to the debate by radio* I-embers sponsoring such measures in both\nthe House of Representatives and the Senate wrote to station WOI for copies of the\nmanuscripts, and asked that an intercollegiate debate be sent to the floor of the\nAssembly* As a result of this request, a debate was held before a joint session of\nthe two houses on larch 6, Iowa State College asking for adoption of a single body\nlegislature, Kirksville (Wissouri) State Teachers advising against such a change* A\nlively open forum followed the debate. The Judiciary Committee of the Senate, which\nhas the bill under consideration, called a meeting immediately after the discussion*\nThe chairman of that Committee promised the debaters that the bill would not be\nkilled in Committee, but would be brought to the floor of the Senate for general dis¬\ncussion and vote.\nOn the Sunday following the debate before the legislature, the editor of the Des\nI-oines Register commented on the debate in his editorial column to the effect that\nmore debates should be held on other vital subjects, and that the college debaters\nhad more time to find material about proposed legislation than do the senators and\nrepresentatives* The editor stopped before becoming involved as to their comparative\nabilities to use the facts*\nNEW YORK\nC* A. Taylor, in charge of agricultural radio programs at WESG, Ithaca, New York,\nsays: \"The annual Farm and Home Week at the New York State College of Agriculture\nduring February had a registered attendance of more than 8,000* That necessitated\nthe use of public address system in several large rooms on the campus so that all migh\nhear some of our principal speakers, including -T rs • Franklin D. Roosevelt and Govern¬\nor Herbert H* Lehman. By remote control these addresses andt hose of Some of our\nother principal speakers were picked up and broadcast from our station, WESG, 1000\nwatts•"
}