{
  "id": "d212-76",
  "text": "-2-\nF ^\nother very important servicess audience surveys, up dating station\nstaff personnel, clearing house functions in various fields, and, final\n179 and I think this is important, the Headquarters function (more on\nthis later under item 10)* The Network is but a service of NAEB*\n2* The idea of offering one year free network service to new\nmember stations is excellent* After all, the old stations have had\nthe equivalent of one year’s free Network service* »\nThe matter of NAEB membership carrying with it a sliding scale of\nfree programs must be balanced against two facts; (a) The NAEB must\nassume the full load of Network operation within five years and an in¬\ncreasing load each succeeding year before the full load* This, the\nNAEB obligated itself to when it accepted the Kellogg Grant. If the\nsliding scale will allow the acceptance of the terms of the Grant then\nit deserves consideration* (b) But now we come to the matter of largo\nstation carrying the small station de facto--and they have to live with\ntheir administrators 12 months a year too* It’s a matter of each sta¬\ntion carrying its own share of the burden, if the ability to carry is\nsmall then the share must be small* None of us is so rich that he can\nafford to carry someone else share of the burden*\nNAEB membership must offer other services to justify membership_\nso I think we had better examine the sliding scale with great care and\nin the light of the above facts.\n3, 4, and 5* We have a similar trouble in programming Network\nshows as to local needs. But let’s face it; no national network can\never meet a strictly local program need! And if you’ll tell me what\na \"grass-roots\" TYPE of program is I’ll buy it. But lets assume you’vo\nfound a \"grass-roots\" TYPE, John; it is per se and by definition a mid\nwestern \"grass-roots\" TYPE, not southern, and certainly not a New York\nTYPE. I think the Network is going \"grass-roots\" in that it is now dis-"
}