{
  "id": "d212-80",
  "text": "3» We are under the impression that vie are being asked to gear our operations to\nthe network without the network finding out how we operate. Now I know it’s\ntrue that the network can’t satisfy everybody, • But surely there must be a\ncommon basis of approach to the solution of our problem. To begin with, I\ndon’t recall that there has ever been even a simple study made as to just how\nmember stations do program-program periods, length of program periods, etc.\nFurthermore, there is a wide difference between the small operation which is\non the air only 20 to 30 hours a week (and which depends on the network for\nprobably 50fo of their programs as is the case with the University of Tennessee,\nWUOT-FM) and the stations which program and broadcast 60 to 100 hours a week.\nCertainly, we here at WNAD are not going to abandon a scheme of programming\nwhich has built a tremendous listening audience for us over a period of years\n(and I can hear voices shouting now, \"we don’t expect you to do so\"),\n4, Let me illustrate what I have been saying: we program three times a year with\neach program period lasting four months and roughly paralleling the semesters\nof the academic year. We’ve found ice had to do this in order to accommodate our\ntalent. We have seen no reason why we should be bound to the old traditional\n13 week idea of commercial radio. Then, too, each program period sees some 20\nto 30 NEW and CHALLENGING series offered to our listeners. They like itJ\nFurthermore, we PLAN our programs for each period some three months ahead of\nthe actual starting date of that period. This enables our talent to organize\ntheir program and be ready when the time comes to work with us* They are all\nbusy people and our thoughtful attitude has really paid off with faculty and\nstaff cooperation. Then, too, we program tightly, leaving few or no gaps with\nthe exception of several quarter hours which may be used for emergencies or\nspot programs.\nNow, after this has been done and we1 re all set for a program periodoo 00along\ncomes th® NAE3 Tape Network with an offer of a wide array of program series for\nwhich we have no room on our schedule at all. This means that we must either\ndub them for future use (tying up hundreds of tapes) or ship them on to the\nnext station in the leg.\nIt seems to us that we should know FAR ENOUGH ahead of time what programs will\nbe available so that we can program accordingly. We simply can’t throw out a\nlocal series which we have worked long and hard to get to accommodate the NAEB\nNetwork, Our responsibility is FIRST to the local groups5 second to the network.\nWe are planning NOW for our in-3chool broadcasts for the school year of 1952-53*\nIn this we work very closely with the State Department of Education, If the NAEB\nTape Network should offer the finest in-school programs in the world AFTER we\nhave set up our programming for the entire year of 1952-53, we simply would have\nto pass them by,\n5, Next, there has been no real effort made to find out what the \"grass roots\" need\nin TYPES of programs. It appears that programming of the network too often has\nbeen a catch-as-catch-can affair. We have the feeling that things are offered\nus that we do not need and that do not fit in so easily with program plans. In\nother words, network programming has been from the top rather than the bottom."
}