{
  "id": "d212-81",
  "text": "Music programs should be really distinctive—things which are not available on\nrecords or ET’s. We need more short dramatic shows (such as Cavalcade, of Amer¬\nica) , BBC offerings are fine, but they are so terribly long that all but the\nmost enthusiastic \"draymuhtist\" get a wee bit tired. We would like to see more\nprograms dealing with literature in all of its various aspects and science programs\nthat are off the beaten track. Next to good music, we have found these have tre¬\nmendous appeal. Discussion programs are fine, We’ve found rural and small town\naudiences eat ’em up. But for goodness sake, keep them within half-hour limits,\nChicago Roundtable and London Forum do a bang-up good job in half-hour limits.\nPersonally, I think we need more SHORT programs—quarter hour especially.\nWhether we like it or not, people—our listeners, bless them—have been brought\nup on short quarter programs for daytime listening. That’s one of the reasons\nwhy soap operas, etc,, have such an appeal to the daytime listeners. Since so\nmany of us are daytime operations, we*re* faced with the problem of programming\nfor daytime listening when people for the most part are busy, A good deal of our\nsuccess as an educational station has been due to the use of short program forms.\nOur network has improved greatly in this respect these last several months but\nwe need to do more,\n6, While I know it sounds good to say that a program is being broadcast simultaneously\nby umpteen NAEB stations, I’m not so hepped on that idea. To do so may satisfy\nsomeone93 ego but actually the listener in Bov/legs, Oklahoma, doesn’t give a whoop\nwhether or not he hears it at the same time it’s being done in Pullman, Washington,\nAnd to expect member stations to always hew the line is again being no better\nthan our commercial networks (and even they are getting away from the idea).\nCertainly, I think it should be left to the judgment of the member stations as\nto when and how they can best air network programs—something which our package\nidea doesn’t allow.\nAgain, I propose that master copies of programs which are not dated, be kept at\nTape Network headquarters for a limited period of time—say six months or one\nyear. Periodically, a mimeographed catalog of these program offerings might be\nmade available to member stations. Then those of us who’ve had to pass up a\nprogram series might pick it up for use,\n7, We here at WNAD are NOT afraid of controversial issues provided they are handled\nin the RIGHT way. Just because we do not offer facilities to political candidates\nis no criterion to judge by. We pass up the politicos because here in Oklahoma\npolitics is a rough and tumble game and our judgment simply dictates we should\nleave it alone. As a matter of fact, we have handled some of the hottest local\nissues with very good results,\n8, I agree with Si that we should cooperate with governmental agencies when those\nagencies have a message for the people of the United States that’s worthwhile.\nAll of us have been doing it and I see no reason why we should suddenly assume\na holy attitude about the matter. Certainly government agency offerings should\nnot conflict with basic program policies of the station (I’m thinking here of\nOPS which sometimes uses hillbilly programs as vehicles for their messages),\n9, With a little financial assistance, regional headquarters would be in a position\nto dub programs and dispatch to members with that region more cheaply and quickly\nthan otherwise, I agree that something should be done in this respect."
}