{
  "id": "d1218-4",
  "text": "5 -\n\"thrilled\" with the novel experience, and amateur performers\nanxious to share their musical and dramatic talents with others*\nThere i_s this rich source of talent and potential talent, need¬\ning only guidance and training. But to give training, to main¬\ntain a high and continuing standard today, next month, next\nyear, and the year after, the director is forced to admit that\nhe needs a staff, and a big staff. He needs announcers, pro¬\nduction men, writers, program planners, researchers, and secre¬\ntaries. He needs technical operators, construction engineers,\nand experimenters. And sooner or later he faces the hard fact\nthat volunteer, transient help will not provide the specialized,\nexpert service his program standards require. So he seeks a\ngood staff of highly skilled workers and an expanding salary\nbudget to retain them and to meet growing needs*\nAmong our university stations in America there are\nsome without any independent operating budget whatever. Others\nhave as little as $600 to $3000 specifically appropriated for\nbroadcasting. They operate with services and facilities loaned\nor donated by other departments, and how they manage to keep\ngoing at all is a wonder. There’s really something sort of\nnoble about the unselfishness and the economy which sustain a\nradio service with little or no money for direct financing.\nBut there’s something timid about it, too, something\nmeek about the acceptance of radio service as a donation from\nother university departments or agencies. For the sake of ex¬\npediency in the face of budget slashes and a narrow concept of\nthe importance of radio, we have all experienced an attitude of\ncaution in requesting funds* But the station director must now\ndare to seek generous appropriations for his work. We must all\nquit boasting about or bemoaning our \"limited means\"* We should\nrefer with shame instead of pride to our \"lack of funds’’. We\nmust remind ourselves and others that public education in the\nAmerican democracy is a democratic responsibility, that it is\nconducted at public expense, and that education by radio is pro¬\nperly a part of public education. Depend upon it, radio educa¬\ntion costs money, and we, the people, must pay for it. It will\nnever come as a gift from commercial broadcasters.\nWanted, then: more courage on the part of university\nstation directors in requesting funds for radio education, and\nmore appreciation of radio values on the part of public admin¬\nistrators and legislators. To make this need known and under¬\nstood is part of the university station director’s job.\nIn Wisconsin WHA is at present operating on a budget\nof $20,000 annually, providing a broadcasting service of nine\nhours daily the year round with a staff of eight full-time and\nfour part-time workers. This does not include generous"
}