{
  "id": "d1218-7",
  "text": "- 8\nWe come now to Problem Number Four: Promotion.\nIndirectly I have already touched upon this topic, I believe.\nI have referred to attitudes of indifference which must be\novercome, to inadequate funds due to a lack of support, and\nhave mentioned some means of establishing public backing for\neducation on the air. In a way the director who regards this\nas his key problem is right. Other obstacles hinge upon the\nproblem of promotion. Certainly, faculty members and other\neducators will not participate unless they are convinced of\nthe wisdom of university broadcasting. Certainly the legis¬\nlature will not lay any money in our lap until we have inter¬\npreted and demonstrated the extent of our public service.\nAnd assuredly the Federal Communications Commission will not\nvoluntarily offer improved facilities. These goals must be\nreached through promotional efforts of a high order.\nIt is not enough that a university station director\ndevise and present a superior radio program service. These\nprograms must be publicized. Their results must be interpre¬\nted. Faculty, listeners, and the general public must be kept\ninformed of developments. Newspaper listing and description\nof programs are essential, for we might as well admit that we\nall have the habit of looking in the newspaper to see what we\ncan find on the radio. People must be told and told repeat¬\nedly of what we are doing. It!s queer, of course, how much\npeople will believe when told often enough in print or over\nthe radio. I freauently think of how the name of an ordinary\nviolinist has been ballyhooed into a national by-word, and it\noccurs to me then that we in educational broadcasting have a\ngreat deal to learn about publicity.\nI think I shall not go into detail about promotion\nmethods and devices. Everyone is familiar with the desira¬\nbility of forming participating relationships with various\norganizations, and I have mentioned a few of these groups al¬\nready. Let me report just briefly on two or three recent ac¬\ntivities at the University of Wisconsin. Last month we had as\nguests in our studio one evening the faculty members of Sigma\nXi, honorary society of scientists. Some sixty members, in¬\ncluding wives and husbands, were there. We gave them a tour\nof the broadcasting plant and a brief.explanation of the en¬\ngineering aspects; we recounted the rich background of early\nradio exploration by university scientists; we described and\ninterpreted current programs and aims; we auditioned and re¬\ncorded the voices of a number of those present. It was a de¬\nlightful evening, resulting in new friends and a better\nunderstanding of the place of radio on a university campus.\nNow, of course, we have had similar meetings for other groups\nin the past, many of them, in fact. But we were impressed by\nthis opportunity to demonstrate and interpret to a group of\nscientists something of the social uses of radio. Naturally,"
}