{
  "id": "d1593-11",
  "text": "SATURDAY EVENING\nSECTION MEETINGS\nAll Groups Meet at 8:00 p. m.\nCollege Public Relations Broadcasting\nProgram Arranged by American College Publicity Association\n8:00 p. m., Birch Room, Neil House\nChairman, Elmer G. Sulzer, Director of Public Relations, University of Kentucky\nOn-Campus Relations through Radio Programs. Kenneth Bartlett, Director,\nRadio Workshop, Syracuse University\nRadio as a Medium for Educational Public Relations. Elmer G. Sulzer\nPublic Relations through Scripts. Harold Schellenger, Director of Public Rela¬\ntions, Ohio State University\nPublic Relations with Stations and Networks. Waldo Abbot, Director of Broad¬\ncasting, University of Michigan\nPossibilities of the Newer Radio Techniques (FM, Television and Facsimile). Frank\nSchooley, Program Director, Station WILL, University of Illinois\nThe High School Radio Workshop\n8:00 p. m.. Garden Room, Neil House\nChairman, Ola B. Hiller, Director of Radio Education, Pontiac Public Schools\nTopics\nWhat Are the Purposes of a High School Radio Workshop?\nWhat Should Be Taught in the Workshop?\nWhat Are Some Major Workshop Problems?\nWhat Are the Benefits To Be Derived from the Workshop by Student, School and\nCommunity ?\nParticipants\nDorothy Blackwell, Chairman, Committee on Radio Education, St. Louis Board of Education\nMarguerite Fleming, Director, Drama and Radio Workshop, South High School, Columbus\nEdwin F. Helman, Coordinator of Senior High School Broadcasting, Cleveland Board of\nEducation\nWilliam Ladd, Chairman of Audio Aids, Seattle Public Schools\nKathleen Lardie, Supervisor of Radio Education, Detroit Public Schools\nMadeline Long, Radio Coordinator, Minneapolis Public Schools\nOlive McHugh, Chief of Radio Evaluation, Toledo Public Schools\nNadine E. Miller, Director of Public Information Service, Kansas City, Missouri, Public\nSchools\nRuth Weir Miller, Radio Assistant, Philadelphia Public Schools\nHarold H. Rowley, Director, Drama and Radio Workshop, Redford Union High School,\nDetroit"
}