{
  "id": "d1593-3",
  "text": "Program\nRegistration\n9:00 a. m.-8:30 p. m., Daily, Main Lobbies, Deshler and Neil House\nEveryone is requested to register promptly upon arrival\nOfficial Convention Rooms\nHeadquarters: Rooms 221-4 (near the Ballroom), Deshler; and South Mezzanine,\nNeil House. Open daily, 9:00 a. m.-9:oo p. m.\nPress: Rooms 227-8, Deshler. Representatives of newspapers, press services and\nmagazines covering the Institute are requested to report to the Press Rooms\nfor registration. Zenith Gross and William Rounds, Institute Press Representa¬\ntives, In Charge.\nAudition Rooms: Rooms 229-30, Deshler. Open daily, 9:00 a. m-ii:oo p. m. Selected\nrecordings entered in the Tenth American Exhibition of Educational Radio Pro¬\ngrams will be available for auditing. Other entries may be heard by special\narrangement.\nFRIDAY AFTERNOON\nFriday, May 3\nPRE-CONFERENCE MEETINGS\nImproving International Understanding Through Youth Discussion\n2:00-3:45 p. m.. Ballroom, Deshler\nPresiding, Allen Y. King, President, Junior Town Meeting League\nWhat Does Youth Think of World Government?—A Demonstration of an Inter¬\nnational Junior Town Meeting\nThis is a culmination of a series of six two-way transatlantic broadcasts of discussions by\nhigh school youth in the United States and Great Britain. The series was arranged by the\nJunior Town Meedng League and the British Broadcasting Corporation in cooperation with\nthe public school systems of Toledo, Cleveland, Des Moines, Rochester and Baltimore; and\nradio stations WTOL, WGAR, KRNT, WHEC, and WBAL. An interesting part of the\ndemonstration will be the two-way transatlantic cue-channel conversation preceding the\nactual broadcast. The broadcast will take place from 2:30 to 3:00, EST, and may be heard\nlocally over Station WOSU.\nParticipants\nSally Minet, Abbey School, Malvern Wells, Worcestershire, England\nHarold Steele, Mill Hill School, London, England\nGeorge Vogel, James Ford Rhodes High School, Cleveland, Ohio\nEdward Voss, Woodward High School, Toledo, Ohio\nC. W. Pettegrew, National Moderator, Junior Town Meeting League, Moderator in Columbus\nRooney Pelletier, British Broadcasting Corporation, Moderator in London\nCritique of the Demonstration\nI. Keith Tyler, Trustee, Junior Town Meeting League, Chairman\nWilliam J. Adams, Program Director, Station WHEC, Rochester, New York"
}