{
  "id": "d1593-9",
  "text": "SATURDAY AFTERNOON\nRadio Councils\n2:00 p. m., Room 1540, Deshler\nChairman, Robert S. Stephan, Radio Editor, Cleveland Plain Dealer\nRadio Councils—In the Public Interest\nDwight Herrick, Manager of Public Service, National Broadcasting Company\nDorothy Lewis, Coordinator of Listener Activity, National Association of Broadcasters\nWhat Are Radio Councils Doing? An Exchange of Ideas among Representatives of\nCouncils throughout the Country\nClella Darby, Director, Des Moines Radio Council\nEdna Gellhorn, St. Louis Radio Council\nMrs. George V. Goodbold, Greater Cleveland Radio Council\nLuella S. Laubin, Co-Chairman, General Federation of Women’s Clubs, New York City\nAllen Miller, Director, Rocky Mountain Radio Council\nRadio Research\n(Saturday only)\n2:00 p. m.. Walnut Room, Neil House\nChairman, Kenneth H. Baker, Director of Research, National Association of Broad¬\ncasters\nProgress of the Broadcast Measurement Bureau. Philip Frank, Executive Secretary,\nBMB\nSome Aspects of the Problem of Audience Measurement. Hans Zeisel, Central\nResearch Department, McCann-Erickson, Inc.\nSome Comments on Current Audience Rating Controversy. Hugh Beville, Research\nDepartment, National Broadcasting Company\nSchool Broadcasts\n(Saturday only)\n2:00 p. m.. Room 1337, Deshler\nChairman, R. S. Lambert, Supervisor of Educational Broadcasts, Canadian Broad¬\ncasting Corporation\nWhat Is School Radio Doing, or Planning To Do, About World Citizenship? Is it\nconsciously being used\n(a) to counteract the personal aggressiveness which is the psychological basis, in\nthe individual, of the urge to war?\n(b) to strengthen the individual’s sense of responsibility towards the community to\nwhich he belongs?\n(c) to train in the younger generation an attitude which is free of narrow or\naggressive nationalism ?\n(d) to prepare the way for acceptance of international institutions capable of estab¬\nlishing and maintaining world order?\n(e) to develop a better understanding of the life, customs and habits of the peoples\nof other countries?"
}