{
  "id": "d644-107",
  "text": "THIS LETTER TO JAMES C. HEALEY ALSO\nMOHAWKHUDOON COUNCIL ON EDUCATIONAL TELEVISION\nRlVKMIOC SCHOOL - PROMT STRMT. SCMINRCTAOY «. NCW YORK\nPRANKUN 4-SSS1\nMarch 50, mi\nHonorable Lm V. O'Brien\nCommittee on Interstate cad Foreign Commerce\nloom 1354, House Office Building\nWashington. B. C.\nBeer Congressmen 0*Brian:\nI hops that tha evidence you have scan adds up to tha aaad for passage\nof tha educational televiaion aid legislation (Msgnaaoo-Sehoeppel\nOur experience lm Hair York State has been that this aid la needed desper¬\nately If educational television la going to be able la the foreseeable\nfuture to begin to make the kind of gains for education la Men York State\nthat it has in tha easy other states throughout the country that bane\nbrought the ouaber of educational tdl'ovlalon stations on tha air te\nfifty-five in Just eight years.\nr-A **\nAm President of the New York State Kducetlocal ledlo and Television .\nassociation and Manager of the Mohavk-Hudson Council on Educational\nTo 1 avia ion I have had an Opportunity to a as tha statewide picture as\nveil es know intimately the problems thst have caused educational tele-\nv here in the Cepital Bistrlet.\nThere is no question but what teachers, principals, superintendents end\nparents went educetlocal television. The qneetlos le how do you get\nover the first hurdle, that of buying the necessary equipment end hiring\nthe necessary personnel la order to gat on the air. It has takas us\nsight years to try to gat over this hurdle in the Oepital District end\nalthough we have much of oar equipment, unless we can obtain additional\nfunds vs will net be able te be an the sir by September 1 to serve dose\nffe 100, #00 student, s In the public end rsTOchJSl' school^ of »»hi« ar»sT .\nThroughout the State the situation la pretty much tha same as far as\nmoving ahead with educational television is concerned. The establishment\nof n station appears to bo so formidable that eddettera end administrators\ntone to sit beck end welt far something to happen.\nMs would have no interstate highways without Peddml help. Certainly the\ndrive toward excellence In education le no lest important.‘ Interstate\nhighways cost fl million's nils. An educational television station\nserving in-•choc1 and adult populations throughout s thirty to fifty\nmil# radios car be set* up end oporetbd for e wholo year for half of what\nit coats for e eingle alls of highway."
}