{
  "id": "d644-185",
  "text": "I. THE PLAN\nSynopsis of Proposed Network for Kentucky\nThis network proposal is based on several assumptions. The\nmost significant assumption holds that any state effort in educational tele¬\nvision should provide service to the greatest possible number of Ken¬\ntuckians. The second assumption is that flexibility in operation be pro¬\nvided so that a variety of needs can be served. Also assumed is inter¬\nconnection of the transmitters by microwave radio relay.\nThe first assumption is least open to question since general\ntax revenues would be expended on a State-sponsored ETY system. The\nsecond assumption* raises the cost of the proposed network, since savings\nin buildings and production equipment would be possible were Lexington\nand Louisville made the only programming enters. Also, if single di¬\nrection transmission along the network of only one program at a time were\ndesired, microwave network costs could be significantly reduced. The\ntype of microwave interconnection set forth here meets the criterion of\nflexibility and with small additions makes possible significant contribution\nby the system to higher, education in Kentucky.\nThe assumption of microwave interconnection is made so that\ndescriptions of operations and cost estimates can be made. Other methods\nof interconnection should be studied carefully by qualified persons before\na final decision is made on the actual system (whether microwave, video¬\ntape, or other). The system described here, however, should work and\nshould be reliable. It is designed to provide service to the University\ncenters as well as the public schools. It is suitable for providing dual\nchannel open circuit telecasting should this be desired in the future.\nExperience of UHF stations in Lexington shows that a radius\nof 45 miles of good coverage is possible, especially if sufficient tower\nheight is provided. Such a radius is assumed for the Madisonville, Somer¬\nset, and Lexington transmitters. Murray, Bowling Green, Morehead,\nLouisville, Pikeville, and Hazard are assumed to reach 40 miles; Ash¬\nland and Covington are assumed to reach from 25 to 30 miles. At least\n90 percent of Kentucky’s population would be covered."
}