{
  "id": "d644-195",
  "text": "A microwave system built primarily to interconnect a state ETV\nnetwork might have other valuable uses. The Kentucky State Police have\nrecently had completed for them a study of a possible microwave network\nover the state. They envisioned a system whereby government agencies\nother than their own could make use of it for necessary communications.\n. Consideration should be given to building any microwave system\nfor ETV in such a fashion that it can be adapted to multiple uses. For a\nsmall additional cost, the system described here can be extended and its\nequipment designed so that it could link the University campus with the^\ncenters. This possibility depends, however, upon the design of the basic\nsystem for the regular network.\nExcept for the antenna system, the equipment at a microwave\ntower can carry a signal in only one direction at a time. In order to have\nsimultaneous two-way transmission, the sending and receiving equipment\nat each microwave installation must be duplicated. Unless all programming\nfor the network that is done at Bowling Green, Murray, and Louisville is\nto be put on video tape and shipped to Lexington for showing from there, a\ntwo-way microwave installation is advisable. At relatively low cost, one\nreceiving-^ ending system at each'piicrowave installation-can be equipped\nwith a \"switcher.'1 This is a mechanical device that, upoti a signal from the\ncentral network controls, changes one receiving-sending system so that\nthe part that formerly received from the East now transmits to the East and\nthe one that formerly transmitted to the West now receives from the West.\nAfter this switch is made all down the line, transmission of two signals in\nthe same direction is possible.\nWith the system operating in two directions, «a program for\nsixth-grade geography might be going out along the network from Lexington;\nthe studio at Murray could at the same time be transmitting a program to\nLexington for tape recording. If the set of microwave equipment trans¬\nmitting into Lexington is later switched, two programs can be sent out from\nLexington-simultaneously. A course in college physics might thus be\nbeamed out to the University centers from Lexington at the same time that\nan elementary school program is going out to the network transmitters.\nA two-way microwave system is suggested ta embrace Louis¬\nville, Lexington, and the network West from Lexington. At such time as\nan originating facility is developed at Morehead, a two-way system would\nbe necessary between that installation and Lexington. A double track\n(without switching equipment) leading from near Campton toward Hazard\nwould not be excessively expensive.\n- 11 -"
}