{
  "id": "d644-197",
  "text": "The decision to install these repeaters should not be made\nuntil the main transmitters are in operation and their actual coverage has\nbeen closely analyzed. Assuming that the repeater type of equipment will\nturn out to be useful for filling in dead spots, they can be purchased as\nexperience shows the need for them. Local funds might well be used to\nprovide them.\nDual Channel Operation\nBecause of the normal six-hour length of the school day, a\nmaximum of 12 thirty-minute in-school telecasts per day is possible.\nThis amounts to one per grade level for the public schools. If ETY is to\nhave maximum impact on educational quality, an hour per day probably\nshould be available for students in the fourth through twelfth grades. This\nwould require nine hours of programming or 50 percent more than are\navailable from a single channel. Twenty-minute daily programs for the\nthree primary grades would demand another hour per day, making a total\nof ten hours.\nTo provide ten hours of telecasting per school day would\nrequire simultaneous use of two broadcast channels covering a specified\narea. An alternative method would be the use of closed circuit trans¬\nmission that would allow simultaneous use of several channels. Cable\nis very expensive* however, and its range is limited. Kentucky's school\npopulation is relatively .widely dispersed. Operation of two channels\nprobably would give coverage at a cost lower than closed circuit cable.\nLack of sufficient ETV experience in Kentucky dictates that\nthe two-channel system not begin until several years of operating experi¬\nence in the statewide network have been gained. Expansion to dual channel\noperation would be cheaper than setting up the basic system since few new\ncameras, studios, lighting systems, etc. , would be necessary.\nCommon Carrier Microwave Facilities\nAlthough Kentucky would almost certainly have to construct,\nown, and maintain-transmitter facilities, such is not the case with micro-\nwave interconnecting facilities. Lease of common carrier microwave\nfacilities is one alternative to owning such facilities. Another alternative\nis to contract with a private company for construction and operation of the\nfacilities without being bound by common carrier rates or restrictions.\nAt such time as the location of transmitters is decided, bids or estimates\nshould be taken from common carrier operating companies that will give\na basis for deciding whether to own or to lease microwave facilities.\n- 13 -"
}