{
  "id": "d644-198",
  "text": "III. ADMINISTRATION FOR IMPLEMENTING THE PLAN\nProvision of facilities for ETV, although the most expensive\npart of any ETV system is not necessarily the deciding factor in the quality\nof the product that is sent into the schools. People can not merely be\n\"turned loose\" with the equipment and expected to do a proper job.\nBecause of the amount of State money that would go into such\na system as outlined in this report, control at the State level of the oper¬\nations seems both logical and inevitable. Properly developed, the mech¬\nanism established for control and operation of the network can maintain\nthe political integrity of the network as well as provide for programming\nthat meets some of the pressing needs of education in Kentucky. This is\nnot the whole story, however. The programs that are telecast are no\nmore effective than their use in the classrooms and in the home. Concern\nfor proper utilization of telecasts should result in a very high ratio in\nreturns in educational value to dollars spent.\nAdministrative Organization\nETV Commission\nA commission-type of governing body at the head of an\nindependent state ETV agency seems advisable. An ETV network would\nhave uses far broader than the responsibility of any existing state depart¬\nment. In-school programming at the elementary and secondary levels,\nadult education for persons not enrolled in schools, uses at and beyond the\ncollege level, and general cultural programming are all possible with such\na network. Generally accepted in administration is the fact that a new\nextensive program frequently will require flexibility of operation that it\nmight not have if placed within an existing agency to compete there for\nexecutive attention,, budget, and internal services. The basic reason for\nindependence, however, remains the bVeadth of possible uses for ETV.\nAgencies and institutions responsible for the narrower aspects\nof education that are noted above must be brought into the administrative\nprocess. How this may be done will be pointed out subsequently. The\ncommission itself should be an instrument of public policy and should be\nfree from domination by persons who make their living as educators but\nshould be very receptive to their special knowledge. The commission\nshould set forth broad guidelines both as to the utilization and development\nof the physical facilities and as to the needs which should be met through\nprograms televisedv The? commission should be able to contract, sue, hire,\netc., as a body corporate. Its main function would remain that of general\npolicy direction. It would be responsible for facilities and for program¬\nming but should operate more along the lines of the State Board of Educa¬\ntion than of an ordinary administering board.\n14"
}