{
  "id": "d644-202",
  "text": "Operating at the same level after more than one programming\nfacility is in operation, should be a supervisor of production who would be\nresponsible for maintenance of high standards of production,, He would\nhave no authority with respect ot content, but would analyze studio presen¬\ntations with a view to improving production quality and give advice on this\npoint. He would also be the person responsible for the review, editing,\nand showing of films. As noted elsewhere, any film making up a complete\nprogram unit (thus excluding film clips used briefly) should be televised by\nthe central program unit. This will prevent the duplication and repetition\nthat have occurred on the Alabama network.\nAn information or public relations person would probably be\nneeded to develop and maintain an informational program to answer inquiries\nand to handle press releases. If originating stations were allowed to control\ntheir own informational programs, difficulties would arise in uneven cover¬\nage and maintenance of uniform policies.\nAdvisory Program Board\nThe choice of programs to be televised is, of course, a critical\nfactor in the ability of an ETV network to act as a significant aid to the\nclassroom teachers in improving the quality of education. The decisions\non whether or not to provide televised instruction in individual cases must\nbe made by educators. Income ways the ETV network will exhibit some\norganizational aspects similar to those found in a Kentucky school district.\nGeneral policies will be in the hands of citizens in accordance with the\nAmerican democratic theory of placing control of education in the hands of\nthe people. However, as in the case of a good school board, non-experts\nshould not interfere* in areas that are properly the province of educators.\nFor this reason, an Advisory Program Board made up of professional\neducators is suggested. >\nA problem with a board such as the one proposed here is that,\nin order to achieve desirable representation, its size can be made unmanage¬\nably large. Keeping this problem in mind, its membership might properly\ninclude:\na. Superintendent of Public Instruction\nb. „ President of the University of Kentucky\nc. r, President of one or more of the State Colleges\nd. An independent school district superintendent\ne. A county school district superintendent\nf. Two high school teachers\ng. Two elementary school teachers\nh. A representative of a private college in the state.\n-18 -"
}