{
  "id": "d644-204",
  "text": "who makes a good television instructor might not be an extremely out¬\nstanding classroom teacher, for the teaching job has many aspects. In\nany fairly large group of classroom teachers, these many aspects will\nshow up in different degrees among different people.\nOne teacher may have a talent for making her children want to\ndo things, but is able to accomplish this only with close personal contact\nwith these students. Another may understand the emotional needs of\nchildren very well and be able to make her classroom a place for emotional\nas well as intellectual development. Because humans are varied, the\npossibilities are numerous. No one person can be strong in all.\nBecause of its cost, and because'of the fact that it will be\naffecting thousands of children, the televised presentation must have the\nbenefit of the special talents and capabilities of many teachers. Relying\nupon the television teacher to develop by herself or in consultation with a\nfew college specialists, the whole televised course may mean that many\nimportant elements will be missed or will be only partly covered. Where-\never possible broad participation by all involved teachers in course develop¬\nment should be fostered.\nIn a network situation as many as a thousand teachers in\nindividual classrooms mhy receive and use a particular course presentation.\nBringing all of them together at once and having each of them assist in the\ndevelopment of the course may not be possible. Travel and other problems\nwould prevent this. What is probably most important is that any course\nhave the benefit of the thinking of a cross-section of the teachers who will\nbe using it. With as many as four to six television production centers in\neventual operation programming both for consumption in their own region\nand some portion of- the state-wide presentations, cross-sections should\nbe feasible.\nIn a particular year, the studio at Murray might be given the\nresponsibility for developing for the network a program on sixth-grade\ngeography. A good television teacher should be found three to six months\nbefore the course is to be presented, whether live or taped. The TV teacher\nshould then prepare & basic course outline. With this outline as a starting\npoint for discussion, the TV teacher should then engage in a series of\nmeetings or work-shops with the sixth grade teachers, supervisors, and\ncurriculum specialists in the area to develop the material to be covered,\napproaches to various subjects, the schedule of presentation, types of\nvisual aids to be used, methods of evaluation, etc. For a regional presen¬\ntation, the program should be tailored to what the classroom teachers of\nthat region feel are the basic needs there.\n- 20 -"
}