{
  "id": "d644-206",
  "text": "let alone a network, a method of convenient, rapid communication between\ntelevision and classroom teachers must be provided. This has become known\nas \"feedback. \"\nIn cases where a large city has its own ETV station, classroom\nteachers are able to telephone the TV teacher should there be suggestions\nabout, or criticisms of the TV presentation. Without such feedback, the TV\nteacher can go his oton way and not provide lessons that are as useful as they\nshould be,\nIn a network situation where large areas are involved, telephoning\nis expensive. But comment forms (feedback sheets) may reach the TV\nteacher only several days after the classroom teacher has decided to tell\nthe TV teacher that '\"the discussion of the Amazon River was too fast, please\nspend some time in review, \" or some similar comment. Provision for rapid\nfeedback is necessary. At the same time, continuous training for classroom\nteachers in methods of utilizing the TV classes should be carried on. Work¬\nshops would do this as well as pamphlet material and in-service training\nsessions, possibly over TV.\nBudget Implications\nConsultation with large numbers of teachers, curriculum\nspecialists, administrators, etc., costs money* The donation of time on\nweekends, during summers, or at night should not always be expected from\nthose involved in T.V course planning. Some provision should be made to\npay, at a minimum, the travel costs of those involved. Should much summer\nwork be involved for classroom teachers, a per diem might be necessary.\nCommunication concerning the course as it is being presented can\nalso be expensive when large numbers of teachers are involved. Especially\nduring the early stages of a network, very extensive consultation should be\nplanned. Many meetings will usually be necessary. Study guides, outlines,\nfeedback sheets, and other materials will have to be printed. Perhaps a\nlarge telephone cost item should be budgeted so that classroom teachers can\ncall about ETV.\nBecause no ETV program is worthwhile unless it is used, a\nlarge expenditure will be justifiable if it increases the scope and effective-\nness of ETV utilization in the classroom. Should a network be built and a\nTV set be placed in every classroom, use of the programs would be limited\nin quantity and qualify unless individual teachers felt that the programs were\n\"by, for, and of\" them as they operate In the classroom.\n- 22 -"
}