{
  "id": "d644-221",
  "text": "-2-\nexpansion of the donation program would unduly delay and increase the cost of\nmanaging and disposing of surplus property. Furthermore, we believe property which\nhas been purchased with funds provided by taxpayers throughout the country should\nbe donated only for purposes that are compelling in the national interest and should\nnot be diverted for local activities that are primarily the responsibility of local\ncommunities.\nThe Government has had very unsatisfactory experience under statutes in\neffect prior to 19^9 which authorized donations for a wide variety of purposes.\nSince the various eligible donees frequently wanted and claimed the same surplus\nproperty it was necessary to establish priority systems under which first one and\nthen another potential claimant reviewed the lists of available surplus. That\nprocess delayed the disposal of surplus property for long periods, sometimes for\nyears, while the Government continued to incur the cost of custody and storage and\nthe losses due to deterioration in stock. In the end, only a very small portion of\nthe available surplus property was claimed by any of the eligible donees. These\nconditions led the first Hoover Commission to recommend repeal of the various\ndonation statutes and in 19^9> with President Truman*s approval, most of the\nstatutes were repealed. Donations for educational purposes were authorized, how¬\never, and later amendments to the Federal Property and Administrative Services Act\nauthorized donations for public health and civil defense purposes.\nThe volume of surplus property and the administrative problems involved in\nits disposal are still formidable and we believe it would not be in the public\ninterest to complicate the problem again by adding new categories of eligible\ndonees.\nSincerely yours,\n/s/ PHILLIP S. HUGHES\nAssistant Director for\nLegislative Reference\n.0.\nEXECUTIVE OFFICE OF THE PRESIDENT\nBureau of the Budget\nWashington 25,D.C.\nJuly lb, 1961\nHonorable John L. McClellan\nChairman, Committee on Government Operations\nUnited States Senate\nWashington 25. D. C.\nDear Mr. Chairman:\nThis is in reply to your request for a report on S. IO69, a bill \"To amend\nthe Federal Property and Administrative Services Act of 19^9 to authorize the\ndisposal of surplus property to certain welfare agencies.\"\nTo the existing statutory authority for the donation of surplus Federal\npersonal property for purposes of education, public health and civil defense, S.\nIO69 would add certain tax supported or tax exempt welfare or recreation agencies.\nAs defined in the bill, the term \"welfare or recreation agencies\" could include such\nagencies as the Salvation Army, YMCA, YWCA, Travelers Aid, homes for the aged,\nyouth centers, adoption centers and other similar organizations. Though we do not\nquestion the worthiness of these agencies and organizations we would be opposed to\nthe enactment of S. IO69.\nWe wish to reaffirm our opposition to any general or piece-meal expansion\nof the donation program to include additional categories and purposes. Disposal\nof Federal surplus property is a very difficult administrative task and further\nexpansion of the donation program would unduly delay and increase the cost of\nmanaging and disposing of surplus property. Furthermore, we believe property which\nhas been purchased with funds provided by taxpayers throughout the country should\nbe donated only for purposes that are compelling in the national interest and should\nnot be diverted for local activities that are primarily the responsibility of local\ncommunities.\nThe Government has had very unsatisfactory experience under statutes in\neffect prior to 19^9 which authorized donations for a wide variety of purposes.\nSince the various eligible donees frequently wanted and claimed the same surplus\nproperty, it was necessary to establish priority systems under which first one and\nthen another potential claimant reviewed the lists of available surplus. That\nprocess delayed the disposal of surplus property for long periods, sometimes for\nyears, while the Government continued to incur the cost of custody and storage and"
}