{
  "id": "d644-250",
  "text": "The Industry Information Digest is a\nservice of\nAmerican Women in Radio and Television\n75 East 55th St., New York City\nEditor, Elizabeth Wright Evans, Seattle\nEditorial Committee: Marianne Campbell,\nGallipolis, Ohio; Doris B. Brown, North\nWilkesboro, N. C.; Virginia F. Pate, Havre\nde Grace, Maryland; Jane Angel, Margaret\nStrickland Parks and Gertrude Broderick,\nWashington, D. C.\nNAB CONFERENCES\nBy VIRGINIA F. PATE\nPresident and\nGeneral Manager\nChesapeake\nBroadcasting Co.\n(WASA AM-FM)\nThe keynote of the\nNAB fall conferences\nhas been in the descrip¬\ntion of a series of serv¬\nices promised for the\nvery near future in the\nfields of public relations, labor relations, vocation¬\nal training, engineering, and management tech¬\nnique. To call this proposed series of service\n“new” would be to give them a misnomer; in real¬\nity, they are an extension of services previously\noffered but with a new emphasis on practicality\nand a recognition of station services as a definite\nand continuing need. It is a down-to-earth drive\nto make a tangible product better by offering\nmore attractive services to the radio and televi¬\nsion members of NAB.\nFirst of all, in order to give coordination and\ncontinuity to this program, the Station Services\nDivision was created by grouping certain service\ndepartments under one operating head. NAB has\nlong been known for providing both valuable and\nindividualized service on labor problems, wage\nhour matters, financial problems, traffic, editori¬\nalizing, engineering matters, and the like. An in¬\ntense effort is being made now in the collection\nand dissemination of useful information pertinent\nto all these subjects in order to bring them com¬\npletely up-to-date. More time is being devoted to\nthe educational side of broadcasting with the\npreparation of booklets on “Careers in Radio”\nand “Careers in Television,” to be published by\nthe end of the year. Already three Executive train¬\ning seminars have been held at Harvard Univer¬\nsity for owners and managers. Plans to hold simi¬\nlar seminars on various other aspects of station\nmanagement are in the making.\nAn announcers’ training manual is in prelimi¬\nnary stages; this is one that will enable members\nof NAB to train good announcers to be better\nand also give announcers an opportunity to train\nthemselves. The revised wage-hour guide has just\ngone to press. There are plans for a technicians’\ntraining manual and still others as needs may in¬\ndicate. Complete information, with pictures, on a\nrevolutionary logging system pioneered at WMAL\nin Washington and now in use by some sixty sta¬\ntions will soon be available. Its very adaptable\nuse for the program, sales, and billing departments\nholds great promise for both time and economic\nsavings to broadcasting stations. A survey of em¬\nployees made sometime ago will soon be in the\nhands of management. Twenty-three hundred\ncompleted questionnaires from managers on down\nprovide a wealth of information on educational\nbackground, training, positions held, attitudes,\nlikes and dislikes, etc.\nThe Engineering Department of NAB is in the\nprocess of field testing operations in a number of\nselected television stations. At the conclusion of\nthe tests, based on findings, the FCC will be re¬\nquested to approve an amendment authorizing\nremote control of television transmitters. This\nwould provide a considerable savings for 385 tele¬\nvision stations which, at the present time, cannot\nhave unattended operation. Manuals on automa¬\ntion and stereophonic operation of FM stations,\nConelrad alerting, and the latest techniques in\nthe engineering field are contemplated.\nThe Public Relations Department is engaged in\na never-ending effort to persuade radio and tele¬\nvision to do a better job of informing the people\nof the service rendered by broadcasting. NAB\nproposes to provide broadcasters with hard-hit¬\nting speeches to refute charges raised and spread\nby competitors in other media who capitalize on\nthis industry’s occasional misfortunes. Such in¬\nformation could also be employed for individual\non-the-air editorials. Initial steps have been taken\ntoward preparing a Public Relations Manual for\nBroadcasters, one that will enable stations to be¬\ncome more forceful influences in their communi¬\nties. Such a manual has never been published be¬\nfore and may be two to three years in prepara¬\ntion. There is a proposal to establish an annual\npublic service clinic in Washington for 60 top\nstaff members of national service and philanthro¬\npic groups which use radio and television to assist\nthem.\nAll of this adds up to practical and intelligent\ninformation that should promote maximum effi¬\nciency with cost-saving ideas and simplified busi¬\nness approaches to enable each station to occupy\na strong and competitive position in its commu¬\nnity—another example of NAB’s ready cognizance\nof broadcasting needs and constant vigilance to\nprovide the services management wants."
}