{
  "id": "d644-35",
  "text": "-2-\nThe record of educational television's contributions to education at all\nlevels is an impressive one. But it exists in all too few spots to provide the\nnational assistance our educational effort requires now. Well over 50% of the\npeople in this country live in areas not served by educational television. All\nbut some 25 of the great universities of the United States have no television\nstations. All but some 200 of the 40,000 school systems of the nation are years\naway from access to this electronic miracle unless federal assistance is provided.\nWithout federal support there may well be considerably fewer than 100 educational\ntelevision stations in the nation for many years, while 150 to 175 other frequencies,\nallocated for education, lie fallow. With few exceptions, potential state,\nregional and national networks will remain unrealized dreams unless and until\nfederal funds are made available. It is not necessary to remind this Committee\nhow precarious is the position of the channels allocated for educational tele¬\nvision. Commercial broadcasters, industry, the armed services, and others\nremind the Federal Communications Commission periodically of the ‘unused\nresource* contained in these channels. This pressure is daily increasing as the\ncompetition for more room in the spectrum intensifies. This legislation, if\napproved, would give great impetus to educational station activation. In many\nstates, the use of public funds to develop educational television stations has\nbeen delayed, or prevented, by the belief that, if state funds are to be used to\nsupport educational television, the service must be available to the entire state -\nnot merely to those fortunate few who are within the service area of the university,\nor school system, or proposed organization seeking to launch it. Funds of the\norder proposed by the bill, though not sufficient to solve this problem fully,\nwould break this deadlock, by making state systems . capable of service to"
}