{
  "id": "d1048-34",
  "text": "Fabxtmary 7# 19^4\nHr. ISioeas Clmaem, CSbdef\nBducfitlonaX HeNHa Bmnc^\n0.S. Office of saueatioEt\nwai^lngton S^, B.O*\n33ear d&mmt\nIfe bm@ r^celvea a detailed tHidget prt^o«y. from tbe llEdverslty of fiemB\nfor the produoti<m of six utiHaatloo fume to be Included as part of tbe\nt^llimtlG«a Kits are beiog developed by the MEB under contract vlth\nthe l^ted States Cfflce of Bfiucation.\nUse propcHsals are based cai script trmtaients prepared by Mrs. Iferye\nBenjamin at the tMveafslty of l^aKas# and a subsequent iseiaorandum dated\nJanuary W in idilch Mm. Benjamin described suggesticms for changes nhich\nwill be incorpomtod into tUa© final scripts.\nWe have given considerable thou^ to the feasibility of having this\nproduced at various educaticmal film inoducers around the countaty, and\nidiile we agree that we might find other film producers as competent as\nthose at the Iftiiversity of Tmcaa, the fact that the writer is located\nthere and the inspection cf their film wost^ has held under careful\nscrutiny, has led us to the ocsaclusion that it would be wise to contract\nwith the IMiverslty of ferns to produce the utilisatian films. Ws feel\nthat the sltuatltm there provides a mucdJ more efflclaab and eccmomical\nrelationi^p than we would have tmder any other circumstances.\nW& would appreciate having authorisatlcm from your office to sub^contract\nwith the Uoiversity cjf feaeas, to produce color films for these kits for\na total of $60,000. Conditions outlined In Mrs. Benjamin’s January memo-\nrandum and obligatioas accepted by the iMverslty of fssms, outlined in\nMr* Sari Miller’s letter of Janawy JO, are considered to be part of the\nccsxtractual cmrrang^aent. we plan to contlmie Mrs. Benjamin as writer of\nthe scrlptM in a separate commitment which m have directly with her.\nm wculd appreciate hearing from you as soon as possible. If any questicwis\nabout the details of this airangement need to be answered, we know you will\nbe in touch with us.\nSincerely,\nwmmc\nInclosures\nWilliam 0. Barley"
}