{
  "id": "d1048-60",
  "text": "Because the differences in production between film and television are so basic,\nit was not possible to continue work on the development of scripts until the\nnegotiations with the Office of Education were concluded and a firm contract\namendment assured that it would be possible to produce these materials on film.\nThis step delayed the schedule for the project by about four months, but there\nis no question among all parties concerned that the delay was unavoidable and\nwill result in a much more useful and effective library of utilization materials.\nBetween September 15 and the present time, work has proceeded on the develop¬\nment of script treatments and associated materleU-s that would be included with\nthe kits. A November meeting with the U.S. Office of Education staff and\nmembers of the Project Advisory Committee resulted in helpful suggestions for\nmodifications of the script treatments, and other meetings of the project\nstaff have proceeded to the point where most of the filming has already been\ndone for one of the approved scripts.\nDuring this period, however, oi^ other delay was encountered that makes it\nnecessary to modify the schedule for the contract. After script treatments\nwere reviewed by the Project Conanlttee and the Office of Education staff, it\nwas agreed that instead of further development of the treatments themselves,\nthe best use of time would be to proceed on the preparation of scripts. A\nmemorandum from the writer, Mrs. Marye Benjamin, outlined the changes she\nIntended to make between the treatment stage and the shooting script stage,\nand on this basis it was agreed that the recommended changes could appropriately\nbe handled within the next phase of the script prepeiration—development of\nshooting scripts.\nBefore shooting scripts could be developed properly, however, it was agreed\nthat it was necessary to contract with a film producer in order that the\nproducer and writer could work jointly on the shooting scripts. Because\nthe film production phase involved a sub-contract between the NAEB and another\norganization, this required further negotiation with the Office of Education\nwhich was conducted between January and April, 1964. On February 26, a\nspecific request from the NAEB asking that a sub-contract be authorized was\nsubmitted to the Office of Education, and on April 23 after further discussion\nand evaluation of the NAEB*s request, permission was granted to enter into\nsuch a sub-contract.\nSince that time work has been proceeding on schedule with the development of\nthe films. Script number 5 has been approved by the Office of Education and\nwill shortly be available for consideration at the \"interlock” stage. The\nnext film to be produced is awaiting final approval of the shooting script,\nand should be underway within the next two weeks.\nREQUEST FOR AN AMENDMENT AND EXTENSION\nThe original contract was scheduled to end on August 31, 1964. The NAEB\nrequests now that the contract be amended to extend this period until"
}