{
  "id": "d1048-61",
  "text": "- 3 -\nOctober 31, 1965 • A small budget extension to cover personnel costs during\nthis peilod is the only additional expense involved, and there is reason to\nbelieve that the benefits to be derived from extending the project are\nsubstantial,\nIhis request for amendment is necessitated by roughly seven months of\nnegotiations on earlier contract changes etnd amendments that were requested\nby the Advisory Committee, and in principle, felt by the Office of Education\nto be worthwhile suggestions* The delays were not the fault of any one of\nthe parties to the contract, but a result of the lengthy discussion and\nnegotiation which is required to assure that changes are necessary and that\nthey are being presented and executed in an effective manner. The delays have,\nhowever, made it necessary to adjust the schedule of the project and it is for\nthis reason that this request is being submitted*\nThe Office of Education has already approved, in principle, an extension of\nthis project to cover at least the period of time during which the films will\nbe produced. By agreement with the Office of Education, the University of\nTexas, and the National Association of Educational Broadcasters, the last film\nto be produced should be finished on April 1, 1965* Ibis alone would require\nan amendment to cover the time between August 3I, 1964, aiid April 1, 1965* An\nextension to October 31> 1965, however, is requested to allow for an evaluation\nof the materials, which was listed as part of the original contract.\n!Ihis evaluation was contemplated as a period of time during which the materials\ncould be used, users could provide reactions and comments about the material,\nand a detailed evaluation report could be made by the Advisory Committee on\nthe usefulness and effectiveness of the kits. Because the summer months\nprovide a particularly fertile period for the use of such materials in workshops\nand short courses in educaxjional television, it is requested that the project\nbe extended through the summer period to allow for concentaiated use and\nevaluation of the kits and for a short time beyond that to allow for preparation\nof a report*\nBUDGET\n(See Attached Sheet)\nSUMMARY\nThe NAEB is requesting an extension of its contract #0E 3*16-007 and an\namendment of the budget to carry out the requirements of the contract. Because\nof various delays in the development to date, the extension is required to\ncover the period during which films will be produced, and the distribution\nand evaluation of the films can be made#\nThe request calls for an extension of the contract from August 31, 1964, to\nOctober 31, 1965, and requires a total budget amendment involving a total\nof $23,851.00."
}