{
  "id": "d1048-67",
  "text": "James Fellows, July 4, 1964, page 2\nBecause I feel that respect for the model as a form of communi-\ncation is the one thing which binds us together irrevocably, I am\nenclosing one*, It represents the dilemma into which I, myself, got\nmyself, with my own stipulations as to payments, and out of which I\nwant to get.\nIn stipulating one third of the fees in advance, one third upon\nconclusion of the rough drafts, and one third upon completion of the\nfinished materials, I hop-headedly overlooked the fact that the writing\nin this instance doesn’t proceed along those lines. We are doing a\nrough draft....then a finished script...then a rough draft..then a\nfinished script, etc. Under this arrangement, the rough drafts won’t\nbe completed until almost the same time the finished scripts are com¬\npleted. All of which would be immaterial if I were John D. Rockefeller.\nBut I am Chub Benjamin,..in need of cash.\nTherefore.,.the model, indicating that somewhere between the\nfirst and the middle of August (because of interruptions in writing\nbrought about by measles, travel, production chores, preparation of\noutline, etc.) I shall probably have finished three rough drafts\nand three finished scripts.involving more tim.e and effort than\nsix rough drafts.\nAs of now, I have completed two rough drafts and two finished\nshooting scripts.which constitute two-sixths or one-third of\none-third and two-sixths or one-third of another one-third,, ..and\nsome of the kit^materials for these films. This is roughly the\nequivalent of two-thirds of one-third.,,orr roughly two times\n$645...which is $1,290. If possible, I’d like to get something\napproximating that amount now, as there are some things on the\nfamily financial horizon (notes, tuition, books, son’s car pay¬\nments and repairs, family vacation trip) which it appears I must\n^ake care of...and inthe summer my income from the University is\n/reduced considerably.\nscript\nWhen Film No. 6/is completed--!! it’s agreeable, I’d like to\nget another one-third of the third...which would then correspond\nto the payment due for completing all the rough drafts...though\nactually we would have cogipleted three rough drafts and three\nfinished scripts.\nThe kit materials I am planning to prepare, insofar as I can,\nas we do the films, so the packages will be ready to go out as\nsingle entities ahead of the full series package, in case you\nwant to distribute them that way.\nI’ll be very grateful (and scjwill a few other peoplel) if you\ncan see your way clear to revamping the payment schedule to this\nsomewhat more applicable approach.\nAm looking forward to seeing you at the July meeting (whenever\nand wherever it may be.Jf I’m celebrating the Glorious Fourth and\nFifth at the office, catching up on correspondence and working on the"
}