{
  "id": "d1048-71",
  "text": "- 2 -\nBecause the differences in production between film and television are so\nbasic, it was not possible to continue work on the development of scripts\nuntil the negotiations with the Office of Education were concluded and a\nfirm contract amendment assured that it would be possible to produce\nthese materials on film. Ihis step delayed the schedule for the project\nby about four months, but there is no question among all parties concerned\nthat the delay was unavoidable and will result in a much more useful and\neffective libraiy of utilization materials.\nBetween September 15 and the present time, work has proceeded on the\ndevelopment of script treatments and associated materials that would be\nincluded with the kits. A November meeting with the U.S. Office of\nEducation stsuff and members of the Project Advisory Committee resulted in\nhelpful suggestions for modifications of the script treatments, and other\nmeetings of the project staff have proceeded to the point where most of\nthe filming has already been done for one of tne approved scripts.\nDuring this period, however, one other delay was encountered that makes\nit necessary to modify the schedule for the contract. After script treat¬\nments were reviewed by the froject Committee and the Office of Education\nstaff, it was agreed that instead of further development of the treatments\nthemselves, the best use of time would be to proceed on the preparation\nof scripts. A memorandum from the writer, Mrs- Marye Benjamin, outlined\nthe changes she intended to make between the treatment stage and the\nshooting script stage, and on this basis it was agreed that the reccmmended\nchanges could appropriately be handled within the next phase of the script\npreparations—development of shooting scripts.\nBefore shooting scripts could be developed properly, however, it was\nagreed that it was necessary to contract with a film producer in 03rder\nthat the producer and writer could work jointly on the shooting scripts.\nBecause the film production phase involved a sub-contract between the\nNAEB and another organization, this required further negotiations with\nthe Office of Education which was conducted between January and April,\n1964. On February 26, a specific request from the NAEB asking that a sub¬\ncontract be authorized was submitted to the Office of Education^ and on\nApril 23 after further discussion and evaluation of the NAEB*s request,\npermission was granted to enter into such a sub-contract.\nSince that time work has been proceeding on schedule with the development\nof the films. Script number 5 lias been approved by the Office of Education\nand will shortly be available for consideration at the \"interlock\"\nstage. The next film to be produced is awaiting final approval of the\nshooting script, and should be underway within the next two weeks."
}