{
  "id": "d1356-0",
  "text": "The National Association of Educational Broadcasters\nVol. II, No. 4 DuPont Circle Bldg. / Washington 6, D.C.April 19 61\nHEARINGS ON FEDERAL AID TO ETV\nMarch 20 - 23 hearings were held before the House Subcommittee on Communi¬\ncations and Power on a half-dozen bills designed to provide Federal support to\neducational television. As with the hearings earlier in the month on the Magnuson\nbill, the NAEB arranged for witnesses from various sections of the country where\ndefinite progress has been made in planning for ETV. These witnesses testified as\nto the vital need for Federal funds for capital expenditures in order that plans\nmight proceed without delay for the establishment of ETV stations in areas not now\nserved.\nWitnesses scheduled to testify on behalf of the legislation included:\nRaymond Hurlbert, General Manager, Alabama ETV Commission\nMrs. Maxine Scoville, President, Kansas Congress of Parents and Teachers\nT. E. Tyler, Chairman, Arkansas State Committee to Study Educational\nPossibilities of Television\nEdgar Fuller, representing the JCEB\nJohn W. Leston, Supt. of Schools, Atlanta, Ga .\nLogan Wilson, Chancellor, University of Texas\nHilton C. Buley, representing the American Council on Education\nRobert Anderson, Executive Vice President, Auburn University\nArmand Hunter, Director of Broadcasting, Michigan State University\nJohn C. Crabbe, General Manager, KVIE, Sacramento, Calif.\nClifford Erickson, Dean of TV Instruction, Chicago City Junior College\nLloyd Elliot, President, University of Maine, representing the American\nAssoc, of Land Grant Colleges and State Universities\nMrs. Elizabeth Campbell, President, GWETA\nWilliam Schmidt, Supt., Prince Georges County (Md.) Public Schools\nMiss Martha Gable, representing the AAUW\nDuring the Senate hearings favorable testimony was given by, among others,\nnew FCC Chairman Newton N. Minow, FCC Commissioner Rosel Hyde, RCA Presi¬\ndent John Bums, and CBS-TV President James T. Aubrey. Said Chairman Minow:\n“I believe . . .thata widely available and adequately financed non-commercial\neducational television service is vitally necessary to improve our educational and\ncommunications system. . . .In view of the present lack of funds in many areas to\nmeet station construction costs, I believe that Federal aid is needed, particularly\nto advance the date of construction and to permit extensive rather than minimal\noperation.I do wholeheartedly endorse the use of Federal funds to aid in\nestablishing or improving educational broadcasting facilities.”"
}