{
  "id": "d1356-1",
  "text": "Commissioner Hyde said that ETV has impact, is economical, and is flexible,\nand that he has no doubt “as to the importance of television techniques to educa¬\ntion.” Further, he said he was “optimistic enough to believe that it can even\neducate the people to demand of commercial television something better than a\nsurfeit of cowboys, private eyes and give-aways.” And speaking of a “world com¬\npetition of cultures,” Commissioner Hyde said, “If we had an educational TV\nservice available in every good-sized city of the United States, this would cer¬\ntainly enhance our image in the world and assist in the fight against the communist\nsystem. ”\nNAEB President William Harley presented not only a strong statement in support\nof the legislation, but also inserted into the record the letters from President\nKennedy and former Vice President Nixon, reflecting their favorable attitude toward\nFederal support for ETV, which were originally presented at the NAEB convention\nlast fall.\nGET YOUR FM STATION WHILE YOU CANl\nFM frequencies, both commercial and non-commercial, are becoming scarcer,\nas the interest in FM mounts across the country. Latest FCC action in the educa¬\ntional FM band:\nLicense granted - Knox College, Galesburg, Illinois, lOw, 88.1mc; Walla\nWalla College, College Place, Wash., 160w, 88.1mc.\nApplications filed - Duluth Branch, Univ. of Minnesota, lOw, 89.1mc; Wheaton\n(Ill.) College, lOw, 88.1mc; Marshall Univ., Huntington, W. Va ., lOw, 88.1mc.\nFCC ITEMS\nThe FCC has refused the University of Illinois’ request that UHF Ch. 37 be\nallocated for the exclusive use of radio astronomy, pointing out that many services\nare requesting spectrum space and that the needs of radio astronomy do not tran¬\nscend other needs . The decision also indicated it would be premature to make\nsuch allocations pending outcome of the long-range allocations study.\nThe FCC has issued a looseleaf volume including the Communications Act of\n1934 (with amendments), the Administrative Procedure Act, sections of the Crim¬\ninal code pertinent to broadcasting, and the Judicial Review Code, which may be\nobtained from the U. S. Printing Office for 5 0£.\nThe FCC denied petition of 1st Presbyterian Church of Seattle (KTW) to dismiss\napplication of KWSC (Washington State Univ.) for exclusive nighttime use of fre¬\nquency shared with KTW. KWSC’s application is included in hearing on renewals\nfor both KWSC and KTW.\nThe FCC denied petition of National TV Assoc., Inc., to dismiss application\nof WHYY, Inc. (Philadelphia), forCh.12, Wilmington, Del.\nLATEST ETV APPLICATIONS\nBoard of Cooperative Educational Services, Williamsville, N.Y., UHF Ch. 29;\nERP: V-lkw, A- 3 0 Ow.\nMohawk-Hud son Council on ETV, Inc., Schenectady, N.Y., UHF Ch. 17; ERP:\nV-23 .99kw, A-10.47kw.\nAT DEADLINE - The Senate passed the Magnuson bill 67 - 13 on March 21."
}