{
  "id": "d1701-3",
  "text": "In fact , it is felt that the component organizations that constitute\nthe N?C?E.R• should contribute all qv a part of the funds needed to\ncontinue the work beyond the close of the present calendar year* The\ncontinuance of the work of the D.C.E.F. Involves not only the employ¬\nment of Mr. Lohnes as general legal adviser , but also the publication\nof the the bulletin, \"Education by jjjadlo\", various special reports, re¬\nprints of important articles on edyjjjational broadcasting, etc.\nAt 11:40 a.m. , a paper sent in by jPr. McKinley, ( place and school\nmissed) was read in his absence. His experience had been that of sup¬\nplying short programs to be broadcast o\\'er a local, 100 watt commercial\nstation. He found it difficult to get the talks contributed by members\nof his stuff* reduced to 15 minutes and confined to essential facts ;\nand he also found it difficult to convince his traeher that any one\nlistened to the broadcasts.\nat 19:00 noon, a recess was declaired untill 1:30 p/m.\nDuring the recess, the delegates attended a luncheon in the large\nauditorium of the Memorial Union. Th© luncheon was In honor of the\nUniversity of Iowa football squad, coaches and athletic authorities.\n/dl the service clubs of Iowa City, alumni and friends of the Universit\nto a total of hundreds were In attendance. Dr, Mahan presided,made a\nbrief* address that was broadcast over a hookup of about six Iowa statio\nThe athletic coaches were introduced, the members of the football\nsquad and others, including the officers of our association.\nAt11:30 p.m. , our regular sessions were resumed, with Carl Mrnzer of\nW3TTI reporting for the \"Committee on Short Wave Transmission Between\nEducational Stations\". He reported that a tabulation of answers to in¬\nquires or the subject showed that at this time not enough equipment\nwas owed by our members to justify tests in short wave transmission.\nThis condition , he thought, might be changed later, and if so tests\nmight be made then.\nIt was moved and passed that the report be accepted, and the committee\nbe continued, if the personal should be approved by the incoming pres¬\nident.\nA similar motion was passed relative to the \" Committee on federal\nand Educational Program Development\", **rank E. Schooley, Chairman,\nLike action was taken on \"Committee on Proposed Recorded Programs of\nGovernment Material\", T.M.Beaird, Chairman.\nIt was moved and approved that President Griffith and Dr, Tracy Tyler\nbe made a committee to negotiate with Mr. Horace Lohnes and if possible\ncomplete an arrangement whereby Mr.Lohnes would continue to advise the\nmembers of our Association , provided such an arrangement can bo made\nunder terms that will be possible for us to meat them.\nAt 2:oo p.m., Mr. F. L. Whan, Instructor In Debating at Iowa State\nCollege, presented an address on \" Are Intercollegiate Radio Debates\nJustified ?\" He said It might be asked first whether people listen,\nand then who listen ? Some debates on subjects intended for woman have\nhad women listeners, m effort Is made by us to get subjects that will\ninterest some specific class and then put that subject on at an hour\nwhen that class can listen.\nThe objection Is made that students have bad radio voices and use bad"
}