{
  "id": "d1871-3",
  "text": "Publications\n• The NAEB has received a copy of the general report of\nthe Second International Conference of Broadcasting Or¬\nganizations on Sound and Television School Broadcasting in\nTokyo in April. Anyone may obtain a photocopy of the 13-page\nreport on request by sending $1 for copying and handling\ncosts to the NAEB Urbana office.\n• A four-page brochure listing zoom lenses “from Angenieux\nto Zoomar” has been issued by S.O.S. Photo-Cine-Optics,\nInc., 387 Park Avenue South, New York City.\n• A sample of favorable and unfavorable correspondence\nreceived by Arizona State University station, KAET, Phoenix,\nis presented in its Three Years on the Air.\n• Team Teaching—Bold New Venture, edited by David W.\nBeggs, III, 192 pages with annotated bibliography, index,\nand appendices, is available in a cloth-bound library edition\nfor $4.95 from the Unified College Press, 3600 Washington\nBoulevard, Indianapolis, Indiana.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Miss Julie Hunt, Placement Service,\nat the NAEB office in Washington.)\nJuly I Writer-producer, 30, married, B.S. English, desires posi¬\ntion in writing, production or public relations and pro¬\nmotion. Minimum salary $6500. Experience with largest\nclosed-circuit ETV network in U. S.\nJuly 2 Married man, 25, receiving M.A. in radio, television\nand motion pictures, with emphasis on TV production,\nwishes to work in busy and creative station. Would like\nto be able to use background in drama and design to\nfull advantage in the development and direction of new\nprograms. Location open; minimum salary $6000.\nJuly 3 Desires position in Midwestern college town with start¬\ning salary of $5000 to $5200 per year with possibilities\nfor advancement to administrative level. Three years\nexperience as newscaster and general announcer. B.A.\ndegree from University of Wisconsin; wishes to con¬\ntinue education. Would also like to get into TV on the\nannouncing, production and direction levels.\nJuly 4 Married male, 30, with Ph.D. in communication-drama,\nM.A. in theatre-TV design/production, teaching experi¬\nence on university level and general secondary teaching\ncredentials seeks position combining research into values\nand problems of governmental involvement in theatrical\nTV with development of programing of interest to edu¬\ncational and cultural institutions. Minimum salary de¬\npendent upon professional opportunities and local cost\nof living.\nPOSITIONS AVAILABLE\n{In order to be considered through these channels, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nJuly I Midwestern university has opening for Ph.D. fellow in\nTV production as half-time producer-director. Experience\nrequired in either broadcast TV or ITV. $2300 for 9\nmonths plus full tuition waiver. $500 in addition for sum¬\nmer if available. Tuition also waived for summer. Job\ncontingent upon admission to graduate school.\nJuly 2 Closed-circuit TV producer for university in Great\nPlains area. Requirements: Master's degree; ITV produc¬\ntion and direction experience; basic knowledge of ETV\nclosed circuitry; knowledge of academic life at the uni¬\nversity level; ability to confer with departmental chair¬\nmen and faculties re use of TV for resident instruction;\nclassroom teaching experience. Responsibilities include:\nproduction and quality control of CCTV lessons; assist¬\nance to academic departments in proper use of TV for\nresident instruction; development of new ITV uses at\nuniversity; development of the campus system; coordi¬\nnation of CCTV program with university operations. 12-\nmonth academic/administrative appointment which in-\n• NBC is offering on request “Teacher’s Guides” to NBC\ntelevision shows suitable for school use. Write NBC Teacher’s\nGuide, Room 787, 30 Rockefeller Plaza, New York, N. Y.,\n10020.\n• The Ohio University USAID teacher-training team in Ni¬\ngeria is publishing a newsletter, Nigerian Outlook, to Amer¬\nican associates, the Nigerian education ministry, and project\nalumni informed about the project.\n• A new book published by McGraw-Hill explains the basic\nprinciples and ideas involved in masers and lasers. Masers\nand Lasers: How They Work, What They Do, by M. Broth-\nerton, $8.50.\n• The New Book Society of India has published the first\nedition of New Educational Directory of the World, contain¬\ning over 10,000 entries of universities, colleges, and institutions\nin all countries of the world. $12 to U. S. buyers, from the\nSociety, at 6A/53, W.E.A. Pusa Road, New Delhi 5.\neludes one-month vacation. Salary $7000 to $9500, de¬\npending upon background, experience and academic\ntraining.\nJuly 3 Opening at a southwestern university for young man,\npreferably with Ph.D. or one near completion, for joint\nappointment in radio-TV and journalism. Individual pri¬\nmarily responsible foir continued development of cur¬\nriculum in broadcast journalism and film production,\nwith additional opportunities in development of educa¬\ntional programing in radio and/or TV. $6000-$8000 de¬\npending on experience, for 9-month appointment, with\nadditional compensatioin for summers.\nJuly 4 A northwestern university has opening in the fall for\na radio-TV instructor to teach basic undergraduate radio\nand TV courses and laboratory work. He will also teach\none or two sections of fundamentals of speech. Appli¬\ncant should have Ph.D. or close to it. Person with tech¬\nnical radio-TV certification preferred although noj^rTfec-\nessary. Riank: instructor or assistant professor depending\non qualifications. Salary also depending on rank and\nqualifications.\nJuly 5 Wanted immediately: producer-director. Minimum\nbachelor degree for major large northeastern ETV sta¬\ntion. lnstructioinally oriented, experienced, imaginative.\nMust have professional competency and ability to uti¬\nlize highly trained professional staff.\nJuly 6 Southwestern university desires film room technician\nand audio man with general knowledge of television.\nOpen immediately. Salary approximately $5200.\nJuly 7 Assistant director, ETV, for a university educational\ncommunications center. Male, minimum a master's de¬\ngree, preferably a doctorate. Heavy practical experience\nin ETV production and knowledge of audiovisual, film,\nprogramed learning, etc. Supervise all closed-circuit/\nopen-circuit instructional and public affairs programs\nand plan a “system\" approach to media utilization in\nuniversity instruction. Instruct educational media courses.\nAssistant or associate professor rank. $10,000 for II\nmonths. Open September I.\nJuly 8 Southern university medical center seeks experienced\nperson to help with administration, producing and\nscripting educational films and video tapes; extensive\nTV and A-V facility in department of psychiatry. Salary\ndependent upon degree and qualifications. Position open\nfall, 1964.\nJuly 9 Senior producer-director for New England ETV sta¬\ntion. Must have practical training in development and\nproduction of all forms of programs, especially in the\nareas of classical music, remote broadcasts, adult fea¬\ntures, plus in-school work. Prefer also experience in com¬\nmercial field and film production. Salary $7000 up. Job\nbegins September, 1964.\nJuly 10 Producer-writer for public affairs at West Coast VHF\nETV station. Must have experience in film and/or TV\nproduction. Available late summer. Salary $6900.\nJuly II Producer-director for West Coast VHF ETV station.\nMust have directing experience. Prefer knowledge of\nfilm shooting and editing and knowledge of music and/oir\npublic affairs. Available late summer. Salary $6900.\n4\nNEWSLETTER"
}