{
  "id": "d1265-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue, N.W., Washington, D.C., 20036\nFebruary 18, 1965\nVolume V Number 3\nJCEB REPRESENTATIVES MEET WITH HEW OFFICIALS\nNAEB President Harley and other representatives from the Joint Council on\nEducational Broadcasting met last week with Dr. John By strom, HEW, to communicate\nofficial recommendation of the January 27 conference in Washington bn channel\nallocations. Although the specific recommendation was for the development of a\ncabinet level commission to provide continuing data on educational needs for radio\nand television frequencies, the discussion resulted in a broader suggestion that such\na commission be formed to relate television planning to a number of important problems\nnow receiving attention in Washington such as poverty, manpower retraining, and\nvocational education.\nHEW APPOINTS TWO NEW STAFF MEMBERS\nEffective February 24, two new staff members will be reviewing applications for\nfederal funds under the Educational Television Facilities Act. Mr. William Smith,\nformerly Chief of Television for the Air Force Systems Command in Washington, will\nassume the post of Educational Research and Program Specialist. Mr. Ian Wheeler will\nalso join the HEW staff as a program analyst. Mr. Wheeler has been Program Director\nof WETA-TV in Washington, D.C.\nJCEB MAKES AVAILABLE DRAFT OF COMMENTS ON DOCKET 14229\nThe Joint Council on Educational Broadcasting has made available to NAEB members\nand other members of the JCEB, draft copies of its proposed filing with the FCC on\nDocket No. 14229. The comments of the JCEB strongly support the NAEB proposed UHF\nassignment plan which has been filed with the FCC. A limited number of copies of this\ndraft are available and will be sent from the Washington office to NAEB members who\nrequest them. The date for filing comments on the proposed FCC Table has now been\nextended to April 3, and the Reply Comment period has been extended to June 3.\nCIVIL LIBERTIES UNION AND AMERICANS FOR DEMOCRATIC ACTION FILE ON DOCKET 14-229\nThe American Civil liberties Union filed a comment this week with the Federal\nCommunications Commission urging that \"policy considerations as well as the need to\nsafeguard the public interest in the free, competitive, and diverse system require\nthat the broadest opinion be expressed before the Commission’s thinking on this issue\nis crystallized.\n\"The Union urged the FCC to extend the time for public study of these problems\nboth locally and nationally, if necessary, beyond the current April 3 deadline; to\nfurther publicize the premises of this and alternative allocations plans, in relation¬\nship to the policy questions proposed, through the press and other communications"
}