{
  "id": "d1265-1",
  "text": "media and through public hearings; to solicit the views not only of communications\nexperts but of all interested public groups and organizations; and to 'reconsider on\nthe basis of the expanded hearings whether the proposed rule making might be improved\nto reach the result of diversity of communications, before allocating the entirety of\nthe authorized television broadcasting spectrum. *\"\nThe Americans for Democratic Action several days before charged that the present\nproposal of the FCC is \"unsound, premature, and of doubtful legality. It is unsound\nbecause it licenses out the remaining two-thirds of all television broadcasting\nchannels without safeguarding provisions in the public interest; premature because\nthe rule-making procedures are being conducted with lack of public awareness and\nwithout due process of hearings, deliberations, and debate; of doubtful legality\nsince the unstated, underlying, but governing considerations of public policy should\nbe enacted by the Congress.\"\nThe full text of the American Civil liberties Union comments are available from\n156 Fifth Avenue, New York 10, New York. The Americans for Democratic Action comments\nare available at 1341 Connecticut Avenue, N.W., ^.shington 6, D.C.\nSANDLER APPOINTED BY NAEB RADIO STATIONS DIVISION\nJerrold Sandler, Production Manager of WUOM at the University of Michigan, will\njoin the NAEB staff on ftkrch 1. At its recent meeting in Chicago, the Radio Division\nBoard instructed President Harley \"to conclude contractual arrangements with Jerrold\nSandler on a 12-month basis beginning March 1, 1964, as Project Director of the\nproposed Educational Communications System research project. In the event that ECS\nproject funds do not become available, Mr. Sandler is to assume the duties of\nexecutive director of the Radio Stations Division of NAEB for the same period.\"\nNAEB SUGGESTS METHOD FOR STATIONS TO HELP WITH UHF SET PROMOTION\nIn order to increase buyer interest in the all-channel television sets which will\nsoon be required by law, the Electronic Industries Association is planning to print\n1,000,000 brochures explaining UHF. These will be distributed to set dealers all\nover the country for them to give to their customers.\nEducational UHF stations can help tremendously in this promotion by giving each\ndealer in their areas a number of copies of their program schedules so that the dealer\nmay show the prospective buyer the kinds of programing he will have available on UHF\nfrom the local educational station. EIA will alert their dealers to the fact that\nUHF ETV stations in their areas may be sending such materials. This joint NAEB-EIA\neffort offers UHF ETV stations an excellent opportunity to build good public relations\nand also help increase the number of all-channel receivers in their reception area."
}