{
  "id": "d1172-2",
  "text": "two years of college and take advanced and graduate courses\nover this service of the Chicago Board of Education.\n^ Beginning this fall, Minneapolis-St. Paul residents will be\nable to earn University of Minnesota credits for courses to be\noffered over KTCA-TV, the Twin Cities ETV station. The\nprogram offers four freshman-level courses; next fall addi¬\ntional frosh courses will be added, as will a series of courses\non the sophomore level.\n^ WETV, Atlanta, has concluded that its experimental ITV\nseries last semester for seventh-graders on the molecular na¬\nture of matter stimulated student inquiry and excitement.\nThe station now plans more programs of this nature for the\ncoming school year.\n^ Five hundred new schools have registered to receive\nMPATI telecasts this fall. Total membership is now approxi¬\nmately 1800 schools enrolling 700,000 students. MPATI is\noffering 25 courses.\n^ The School of the Air of the University of Wisconsin re¬\ncently sent out approximately 36,000 radio and 8,000 TV bul¬\nletins to schools all over the state, announcing sixteen radio\nprograms (the most in the School of the Air’s 33-year his¬\ntory) and ten TV series.\nGENERAL\n^ A choice of four instructional channels plus commercial\nChannel 7 has been made available at the University of Texas\nthrough the installation of a new TV distribution system. In\naddition to use in nine classroom buildings, the new system\nwill also operate in the Student Union Building.\n^ Of the 45 school systems participating in the KLRN (Aus¬\ntin) ITV operation, four are newcomers this year: Round\nRock, Llano, Burnet, and Taylor.\n^ A collection of nearly a thousand historic recordings from\nmore than 40 years of broadcasting has been “placed in de¬\nposit” with Miami University, Oxford, Ohio, for research\nand educational broadcast purposes, by the Crosley Broad¬\ncasting Corporation. The collection includes transcriptions\nfrom historic statements of world figures in major news\nevents of the past four decades plus recordings of WLW per¬\nformers who have become major figures in entertainment or\nnews coverage.\n^ The Mohawk-Hudson Council ETV station, WMHT, has\nresumed Sunday programing because of a grant from the Al¬\nbany Times-Union and Knickerbocker News. Programs from\nthe Eastern Educational Network, NET, and quality com¬\nmercial network shows will be included in the Sunday fare.\n^ The University of Illinois Medical Center radio-TV sec¬\ntion is currently producing two documentary films. One is on\nthe university’s cooperative program in Chiengmai, Thailand,\nand the other is cm the work that university ophthalmologists\nare doing in Haiti for Project Focus.\n^ A recent survey shows that TV viewers tend to switch to\nanother channel if a program is sponsored by a religious or¬\nganization. Research teams interviewed persons in Philadel¬\nphia, Houston, and Westchester County (N.Y.) in the study\nconducted by William J. Millard, Jr., a University of Texas\nresearch associate.\n^ KVIE’s test pattern appeared mysteriously on all three na¬\ntional networks recently. While preparing for coverage of the\nRepublican National Convention in San Francisco, a crew\nwas trying to pick up a microwave signal from a helicopter;\nbut each time the attempt was made, the KVIE signal was\nall that came through. It turned out that the signal was from\nthe microwave transmitter on top of Mt. Diablo used to relay\nKVIE programs to KQED in San Francisco. KVIE agreed\nto shut down the network for the duration of the Convention.\n^ A new line of professional audio equipment for recording\nstudios, auditoriums, theaters and other installations requir¬\ning high-quality sound reproduction has been announced by\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN.W., Washington, D.C., 20036. Phone 667-6000. Area Code 202.\nthe RCA Broadcast and Communications Products Division,\nwhich will now concentrate its business activity in sound in\nthe professional audio field and no longer will market a broad\nline of sound items for use in “engineered sound” systems.\nKUHT, University of Houston, has begun its fall schedule\nfrom new studios and with major improvements in equipment.\n^ KCET, Los Angdes, has completed work on its Mount\nWilson transmitting facilities and was to begin regular broad¬\ncasting September 28. It has a capital investment of $1,300,000\nin its facilities, and a power of 1,200,000 watts ERP.\n^ WQED, Pittsburgh, on its tenth anniversary recently, dedi¬\ncated a historic marker commemorating its having been the\nfirst community-sponsored ETV station in the United States\nand the first ETV station to bring TV teaching to elementary\nclassrooms.\nPROGRAMS\n^ “The Right to Question—Freedom’s Foundation,” a pro¬\ngram produced by the South Carolina ETV Network for\nthe South Carolina Young Lawyers Conference, won a first-\nplace award from the national Young Lawyers Conference.\nThe 30-minute program consisted of a panel discussion on the\nnational system of law and justice between prominent South\nCarolina attorneys and students from A. C. Flora High\nSchool in Columbia.\n^ “A Foreign Student—An American Campus,” a documen¬\ntary radio program produced at the University of Minne¬\nsota’s KUOM, was recently broadcast world-wide by the\nVoice of America. The 30-minute program, produced by\nKUOM program supervisor Bob Binkley, portrays the U.\nof M. as seen through the eyes of a Filipino student, Boni¬\nfacio Bangcaya, a graduate student in agricultural economics.\n^ A 13-program how-to-do-it series, “Home Handyman,”\nis being shown this fall over WQED and WQEX, Pittsburgh.\nThe series was made possible through a public service grant\nfrom the National Lumber Manufacturers Association with\nmaterials furnished by the Pittsburgh Lumber Joint Action\nCommittee No. 179.\n^ “The Spanish-American Hour,” a KQED, San Francisco,\ntelevision series aimed especially at the Bay Area’s large\nSpanish-speaking audience, profiles the artistic and cultural\n'life of the Spanish-speaking countries, variously spotlighting\nballet, drama, opera, literature, music, painting, and sculp¬\nture. Although titles, commentary, and song are all in Span¬\nish, Berkeley attorney Ricardo Callejo, acting as series host,\nintroduces the programs and annotates the proceedings in\nEnglish as well as Spanish. The series is derived largely from\na regular Mexico City television feature, “La Hora de Bellas\nArtes.”\n^ Milwaukee’s educational VHF station, WMVS, made its\nfirst Saturday telecast on the 4th of July to cover the re¬\nputedly longest circus parade in the world, part of the cele¬\nbration “A Day in Old Milwaukee.” Congratulatory mail about\nthe parade coverage this year was among the heaviest the\nstation has ever received. A year ago the station videotaped\nthe parade for NET’s “What’s New” series.\n“Information for the Blind,” a new radio series on the 2nd\network of NHK, Japan, is also drawing very heavy con¬\ngratulatory mail. The half-hour weekly program provides both\npractical and vocational education. In addition, NHK since\n1952 has offered its program listings in Braille and has co-\noperated with schools for the blind on instructional radio.\n^ A high school teacher and four German-born professors\nfrom the University of California, Santa Barbara, recently\ndiscussed “Germany Today” over KCOY-TV, Santa Maria.\n^ WHYY, Philadelphia, recently telecast live the first Jesse\nOwens Olympic Development Track Meet, the first Saturday\nbroadcast in the station’s history.\n^ Performing artists in dance, piano and song are being seen\nthis fall over WTTW, Chicago, in a four-program series,\n“University of Nebraska Artists,” featuring the Ann Lishner\nDance Group, pianist Audun Ravnan, and operatic singer\nOCTOBER, 1964\n3"
}