{
  "id": "d1655-0",
  "text": "A E B\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXIII, NO. 8 URBANA, ILLINOIS AUGUST, 1958\nPLANS UNDERWAY\nFOR NAEB CONVENTION\nThe 34th annual NAEB Convention, scheduled for\nOctober 14-17, will be held in the Sheraton-Fontenelle\nHotel in Omaha, Neb.\nThe agenda will include business meetings, general\nsessions, clinics, committee meetings and several\nspecial events, the details of which will be revealed\nlater.\nPlans are being made to give a maximum of in¬\nformation, conviviality, and entertainment at a\nminimum of strain on the pocketbook, according to\nConvention Chairman Jack McBride, director of\nETV, station KUON-TV, University of Nebraska.\nSpace will be provided for displays so stations\nwishing to have theirs included should begin plans\nsoon. Members are also urged to bring their wives,\nsince an interesting program is being planned for\nthem.\nAdditional information on the convention pro¬\ngram will appear in following Newsletter issues.\nNOMINATING COMMITTEE\nINVITES SUGGESTIONS\nNAEB members having suggestions for Association\nPresident, Vice-President, Secretary, or Treasurer\nare asked to write Graydon Ausmus, chairman of\nthe NAEB nominating committee, Box X, Uni¬\nversity, Ala.\nA slate of nominees will be presented at the\nConvention by this committee. This will not, how¬\never, include nominees for Regional Directors, who\nare nominated and elected by mail by the members\nof each Region.\nATTENTION AWRT MEMBERS:\nMembers of the Assn, for Women in Radio-Tele¬\nvision are invited and urged to attend the 1958\nNAEB Convention in Omaha, Neb. We would be\ninterested in hearing how many NAEB women are\nalso associated with the AWRT; and incidentally,\nhow many do plan to attend the NAEB Conven¬\ntion, with the thought that a special gathering\nmay be arranged.\nP.S. Station Managers: please make sure the\nladies on your staff see this announcement.\nETV STATION MANAGERS\nMEET IN MADISON\nThirty-six station managers from twenty-three states\nand Puerto Rico will meet in Madison, Wis. this\nmonth for the Second NAEB Educational Television\nStation Management Seminar.\nThe August 24 - 27 meetings will give managers\nan opportunity to study the current problems and\nfuture of educational TV stations through talks and\ndiscussion periods.\nGeneral areas that will be investigated include:\nfinancial matters such as budgets, fund raising, and\nincreasing appropriations; implications of national\nlegislation; the role and future plans of national or¬\nganizations such as the JCET, the ETRC, and the\nNAEB; relations with faculty, teachers, and other\ntalent; and the relationship between televised in¬\nstruction and general educational programming.\nGuests and consultants for the seminar will in¬\nclude: Mr. Donald Brondyke of Lybrand, Ross\nBros, and Montgomery, Detroit, Mich, accounting\nfirm which has been conducting study for the ETRC;\nMr. Leonard Marks, of Cohn and Marks, NAEB\nlegal consultants, Washington, D. C.; Mr. Ralph\nConvention Days\nl"
}