{
  "id": "d1505-1",
  "text": "-2-\nFor the basic importance of the inseparability of politics and edu¬\ncation is not the fact that public money supports public education but\nwhat that fact represents: that the education of its youth is a primary\ninterest of the nation. And the nation has many legitimate concerns--for\ndefense, health, highways, and welfare, as well as education. The equi¬\ntable allocation of resources in support of these interests is an extra¬\nordinarily intricate—and political—business.\nThe Quarterly also reviews a book called \"National Politics and Federal Aid to\nEducation,\" (Syracuse University Press), which makes some points relevant to the ETV\nfacilities legislation and the problems of rallying support for the authorization of\nthe appropriation.\n\"One of the problems in pushing legislation has been that although\nwidespread public opinion favors federal aid, it is only mildly interested\nin it; it is not a hot vote-getting issue. Masters and his colleagues find\nthe same phenomenon at the. state level and remark that, although everybody\nis \"for\" the schools, legislators who champion the cause feel that they\nmake little political hay out of their efforts.\n\"in the presence of wide public support and the absence of loud pub¬\nlic noise for legislation, the burden of pushing it has of course fallen\n(as it does on every issue really) on the particular groups interested in\nthe subject and the allies they are able to rally within the government.\n\"Many people have feared that federal aid would lead to undesirable\nforms of control over the content of education—the worst of their fears\nbeing that political figures or parties could use the educational system\nfor ideological indoctrination. These fears persist among some people\nalthough virtually all advocates of aid, within and without the govern¬\nment, have specifically denied the wish to control or even to influence\neducation.\"\nAs you know, the ETV bill specifically forbids the Federal government to inter¬\nfere with or have any part in the formulation of programming for the ETV stations;\nFederal involvement is limited to providing funds for equipment.\nAll of this may seem to you like warming over well-cooked material, but the fact\nis that the fight for Federal assistance for ETV is far from won. The arguments\nwhich were used to oppose enactment of the legislation will be brought up to prevent\nthe appropriation and those who favor this assistance are going to have to answer\nsuch arguments and, in addition, point out in cogent fashion the importance and wprth\nof this program to education and our society.\nOn The Shores of Lake Mendota\nRadio \"old timers\" will remember that years ago the University of Wisconsin\nused to hold an annual summer institute on educational radio. People came from all\nover the U. S. and Canada to talk with and listen to such people as Andrew Allen,\nDirector of Drama for the CBC, Ed Kobak, then President of Mutual, and Cliff Durr,\nthen FCC Commissioner. These were important meetings during the early growth of\neducational radio."
}