{
  "id": "d1505-2",
  "text": "-3-\nOn a recent visit to Madison, I talked with H. B. McCarty, the organizer of the\nInstitute, and about convinced him* that the time is ripe to reactivate the Institute\n—-at least for one session.\nIt seems to me that the radio people are ready and eager to move, to act, to\ntake initiative. For a spell they have been rocked back by the sudden burgeoning of\ntelevision in education. But now it’s time to take stock; to mutually assess and\ndocument the special capabilities and economical virtues of radio; to develop new\napplications of radio to education; and to map out its development as a complement\nto or in conjunction with ETV.\nI maintained that NAEB radio people would be willing to come to such a meeting\nin Madison this summer without grants or scholarships--either at their own or their\ninstitution's expense. Mac has agreed to consider hosting such a meeting and has\nassigned WHA Program Supervisor Cliff Eblen the task of investigating dates, facili¬\nties, etc. If his findings are favorable, the appropriate NAEB Committees will be\nturned loose on developing arrangements and agenda.\nNAEB Meets with FCC\nOne afternoon, recently, the main hearing room of the FCC was taken over for an\nNAEB presentation on its digital computer analysis of the UHF spectrum. At the\nsuggestion of Hyman Goldin and Larry Frymire, of the FCC Research and Education Divi¬\nsion, NAEB brought in its engineering consultant, Oscar Reed (Jansky & Bailey) and\nKenneth Heisler and James Kallenborn (Atlantic Research), who programmed the computer,\nto explain the procedures which had been followed and to answer questions. A group\nof about 25 people were present, including, in addition to the NAEB group, the\nengineering assistants to all the Commissioners and Ivar Parker, of the Rules and\nStandards Division.\nAt the conclusion of the three-hour session, Parker complimented the NAEB on\nna pioneering achievement\" and indicated that the findings would be invaluable to the\nCommission in its over-all restructuring of the assignment table..\nMore importantly, the FCC,impressed with the possibilities of the computer in\nspectrum studies, has (l) moved to acquire one of its own, and (2) gone of its own\nvolition to the USOE to request that it give further funds to NAEB to add to its\noriginal study the tabus occasioned by international agreements with Canada and\nMexico regarding frequency assignments along our national borders.\nHearings on ETV Appropriations\nThe word is that the House subcommittee on Deficiencies and Supplemental (see\nPresident's Memo for February) will take up the request for the $2 million ETV faci¬\nlities appropriation within the next two weeks.\n^Letters from NAEB radio people would be persuasive; if you think this is a good\nidea, send a note to Mac."
}