{
  "id": "d1505-7",
  "text": "► What is design? A TV series presented by the\nIllinois Institute of Technology, Chicago is attempt¬\ning to answer this question by showing its influence\nin areas ranging from contemporary shelters to por¬\ntable boats. The seven-week series is being presented\nover WBBM-TV’s new Orbit show every Saturday\nthrough April 13.\n\"Authors and American Thought,\" a program series showing\nthe influence of American literature on the thought of our\nnation, is being presented over WILL, University of Illinois\nradio station. Selecting books for the 13-week series are (I. to\nr.) Kevin Wheeler, WILL Production Supervisor; Dr. Robert W.\nRogers, Professor of English and Acting Head of the Depart¬\nment; and Dr. Edward H'. Davidson, Professor of English.\n► The Social Security Administration has released\na new documentary radio series titled “The Unfore¬\nseen.” The 14 transcribed programs present Ray¬\nmond Massey in interviews with some of the almost\n10 million people who are receiving old-age and sur¬\nvivors benefits Under the social security law.\nThese people tell in their own voices their own\nstories, including the times when social security pro¬\nvided a weapon against “the unforeseen.” Each pro¬\ngram includes a closing word of advice on social\nsecurity by the Commissioner of Social Security.\n^ Julie Harris, Ed Begley and Janies Daly per¬\nformed exclusively for ETV audiences March 11 as\ndramatic readers on “Literature: The American\nScene,” one of the five series of ETV programs pre¬\nsented live from New York by NBC and the ETRC.\nHouse Speaker Sam Rayburn, Justice Harold H.\nBurton and Senator J. William Fulbright also ap¬\npeared on the series called “American Government:\nPursuit of Happiness.” This series began March 14.\nTV TECHNICAL TIPS NO. 31\n—Cecil S. Bidlack, NAEB TV Engineer\nThis column is being written on the road in order to\nmeet the deadline. It seems each month the deadline\ndates move closer together. Perhaps it is because it\ntakes a while to get the Newsletter into print, and by\nthe time it’s out, copy for the next one is due.\n# * * #\nI have been honored by membership on Panel 4\n(Propagation Data) of the TV Allocations Study Or¬\nganization. TASO’s function is limited to technical\nstudy, fact finding and investigation, and interpreta¬\ntion of technical data. This information will be made\navailable to the FCC so the Commission may be able\nto determine the soundest approach to TV channel\nallocations. Panel 4 held its first meeting in Washing¬\nton on March 13, with 20 of the 26 members present.\nThe standardization of field strength measure¬\nments is one of the first objectives under study by the\npanel. The Association of Maximum Service Tele¬\ncasters now has two mobile field strength measuring\nunits in operation. Two other units, a CBS unit and a\nWestinghouse unit, will soon be in the field. UHF\ntransmission is also of primary concern; however,\nVHF measurements are also needed' over different\ntypes of terrain. Please contact me if you have field\nstrength data available.\n* * * *\nThe Institute of Radio Engineers held its annual\nConvention in New York March 18-21. Fifty-five\ntechnical sessions were held during this period, rang¬\ning in topics from airborne radar to ultrasonics. The\nradio engineering show filled four floors of the New\nYork Coliseum with 840 exhibitors taking part.\nFrom an organization of radio engineers having\nits beginning in 1912, the IRE now has grown to\n55,494 members. Due to this growth, 24 professional\ngroups have been formed which cover specialized\nfields of interest. For instance, most radio and TV\nengineers will be found in the Professional Group on\nBroadcast Transmission Systems.\n* * * *\nI can’t close this column without mention of a\nvisit to Boston. While there, I watched the program¬\nming of WTGBII-TV for two evenings. Many times\nwhen visiting ETV stations, I am unable to watch a\nstation’s programming for various reasons; and I was\nimpressed by the smoothness of WGBH-TV opera¬\ntions, and the contrast of its programming with that\nof commercial stations. Sometimes this contrast is\nnot too evident with educational programming. Per¬\nhaps we may pattern too much after commercial TV\nproduction.\nAPRIL, 1957"
}