{
  "id": "d633-28",
  "text": "EDITOR FOR THE NEWSLETTER AND JOURNAL, WHO WOULO ALSO DEVOTE TIME TO\nA CAREFUL PERUSAL Of THE RESEARCH ANO OTHER PUSLICAT IONS IH THE f I ELD\nAND WOULD SEE THAT SUCH PUBLICATIONS WERE DISTRIBUTED TO THE PROPER\nAUDIENCES. DlSESTS OP PERTINENT RESEARCH WOULD BE PU8L IWMCO (AN\nEXPANSION OP THE PRESENT MAE® RESEARCH FACT SHEET SERVICE), FREE\nSUBSCRIPTIONS TO THE JOURNAL AND MCWSLCTTCR WOULD BE PROVIDED TO\nLCAOING EDUCATORS AND OTHER OPINION LEADER S, AND A GENERAL CLEARING\nHOUSE FOR THE DISTRIBUTION OF PERTINENT PUBLICATIONS WOULD BE ESTABLISHED.\nAn IMPORTANT RC9ULT EXPECTED FROM THIS PROJECT IS THE STIMULUS IT\nWOULD GIVE TO EFFORSS OF THE MA£8 TO BECOME MORE AND MORE SELF-SUPPORTING.\nOne of the most likely sources of annual revenue is the sale or our\nPERIODICALS AND OTHER PUBLICATIOMS. THIS GRANT WOULD PERMIT THE UP-\nGRADING OF THESE MATERIALS TO SUCH AN EXTENT THAT THE DEMAND FOR THEM\nWOULD INCREASE,THEY WOULD BECOME MORE WIDELY KNOWN AND GENERALLY\nACCEPTED. THE INCOME FROM SUCH PUBLICATION AMD DISTRIBUTION EFFORTS\nCOULD BECOME A VERT IMPORTANT FACTOR IN THE NAE8 BUDGET. HOWEVER, TWIG\nWILL TAKE SEVERAL TEARS AND CAN NOT BE DONE WITHOUT SOME wPUMP—PRINI NS*\nFROM SPECIAL FUNDS.\n(3) INTERNATIONAL RELATIONS: THE NAEB MAS BEEN VERT ACTIVE IN\nTHE FIELD OF INTERNATIONAL EXCHANGE OF BROADCASTING PERSONNEL, INFOR¬\nMATION AND PROGRAMS, AND IT IS FELT THAT ACTIVITY IN THIS AREA MUST BE\nINCREASED IN VIEW OF THE GROWING NEED FOR I NTERNAT I ORAL UNDERSTAND ING•\nThe activities SO FAR engaged in have hardly scratched the surface\nAND HAVE ONLY BEEN POSSIBLE THROUGH THE GENEROSITY OF FOREIGN BROAD¬\nCAST ING SYSTEMS (MANY Or WHOM PROUDLY DISPLAY MAES CITATIONS IN THEIR\nOFFICES) AND THE AVAILABILITY FOR SEVERAL YEARS OF FuLBRIGHT SCHOLARS,\nREPRESENTING EDUCATIONAL BROADCASTING, WHO WERE ABLE TO REPRESENT THE\nMAEB AT IMPORTANT INTERNATIONAL BROADCASTING MEETINGS. ALTHOUGH THE\nNAE8 HOLDS MEMBERSHIPS IN THE EUROPEAN BrOAOCASTING UNION, THE INTERNATIONAL"
}