{
  "id": "d1629-0",
  "text": "NEWS NAEB GETTER\nNATIONAL ASSOCIATION “ EDUCATIONAL BROADCASTERS\nFrank E. Schooley, Editor, Station WILL, Urbana, Illinois\nApril 1, 1943\nNAEB ANNUAL MEETING IN OOLUMBUS, MAY 1\nThe annual meeting of the National Association of Educational Broadcast¬\ners will toe held May 1 in Oolumbus, Ohio; in conjunction with the\nOhio State University Institute for Education for Radio.\nOffioers of NAEB have decided that because of the times and conditions\nit would be well to eliminate the necessity for another meeting this\nFall. It is hoped that all NAEB members will make a speoial effort to\nbe present.\nHAVE YOU PAID YOUR PUEBt\nTreasuser W. I. Griffith reports reoelpt of payment from a number of our\nmembers and also first papers from others. Payment has been received\nfrom »SUI, WILL, WHAZ, WHCU, VJSAJ, WBAA, WKUL, WOI, KFJM, and KWLC and\nassociate dues from Syracuse. Payment has also been started by WNAD, KFKU,\nKW9C, WRUF, and Indiana University, Others please check to see that\npayment reaches Griffith before our annual meeting.\nWHS and EOAO (U. OF K.) WIN PEABODY AWARDS\nThe 1943 George Foster Peabody Radio Awards, the so-called \"Pulitzer\nPrizes\" of radio, were given to the following; Charles Collingwood,\nColumbia Broadoasting System, \"Outstanding Reporting of the News;\"\n■The Man Behind the Gun,\" Columbia Broadoasting System,\"Outstanding\nEntertainment in Orama;\" The Standard Syraphohy, National Broadoasting\nCompany (Pacific Coast Network), \"Outstanding Entertainment in Music\";\n\"Afield with Ranger Mao,\" Radio Station WHA, Madison, Wisconsin, \"Out¬\nstanding Educational Program* \"Our Hidden Enemy - Venereal Diseases,\nRadio Station KOAC, Corvallis, Oregon. (University of hentuoky Production\n- ask Allen Miller. Or should we say, ask Elmer Sulzer). \"Outstanding\nPublic Service Program By a Looal Station - 1,000 Watts or Under;” u\n\"The Home Front,\" Radio 3tation WCHS, Charleston, West Virginia, \"Out¬\nstanding Publio Service Program By a Regional Station - up to 10,000\nWatts.\"\nFirst awarded in 1941, the Peabody Radio awards are administered Jointly\nby the Henry W* Grady sohool of Journalism, University of Georgia, and\nthe Rationed Association of Broadcasters, They are designed to give\neducational recognition to merltorous public service by broadcasters\nand to perpetuate the memory of George Foster Peabody, benefactor and\nlife trustee of the University."
}