{
  "id": "d1265-12",
  "text": "232 Gregory Hau\nUrbanaj, Illinois\n.June 7, I960\nDear Fellow NAEBer;\nThe undersigned has been delegated* as chairman or the\nCOMSTITUT IQMAL COMMITTEE, BY THE NAEB IN CONVENTION AT ANN ARBOR,\nin session at Columbus, Ohio, and by authority or the MAEB Exe»\ncut$ve Committee9 to submit for adoption or rejection* in whole\non $h part, proposed amendments to the NA£B Constitution and Bv«\nLaws.\nThis the official notice of at least 30 days, being\nSIMPLY A REPETITION OF PREVIOUS NAEB ACTION® THEREFORE, YOUR\nBALLOT MUST BE CAST AND POSTMARKED NO LATER THAN JULY 15« IT MUST\nBE SIGNED AND SENT TO THE NAE8 SECRETARY, BURTON PAULU, UNIVERSITY\nor Minnesota* Minneapolis* Minnesota,\nIn BRIEF* YOU MAY VOTE FOR RETAINING WAT WE HAVE* OR\nchange ey substituting proposals from the Constitutional Committee,\nIn one particular case* however* you are given a specific alter¬\nnative. The alternative is submitted for article V in the By-Laws.\nFor youk information* the proposal is based upon work of the\nFinances and Dues Committee* headed by Harry Skqr.nia* at the Ann\nArbor Convention* The Alternative is based upon a proposal of the\nConstitutional Committee.\nFor your further information* the writer ran two ®?est\nRUNS* OK WHAT INCOME FROM EACH OF THE TWO PROPOSALS WOULD BRING,\nIn one run at Columbus* figures indicate proposal of Skornia\nCommittee would bring in revenues to MA£C§ from present membership\nor $2S§f«28; from the alternate proposal (the so-called Schooled\nreport)* $2230, On the second run* with revised data, THE SKOftNlA\nPLAN PRODUCED $1950; THE SCHOOLSY PLAN* $2005* YOU CAN SEE THAT\nESTIMATED TOTAL REVENUES ARE RELATIVELY THE SAME UNDER EITHER\nPLAN. THE REASON FOR THE TWO ESTIMATES IS THAT ST HAS SEEN DIFFI¬\nCULT TO GET TRANSMITTER RATED POWER FOR THE ERP LISTINGS WITHOUT\nA LOT OF WORK. I BELIEVE THE TWO TEST RUNS ARE FAIR* AND ALL\nCOME CLOSE TO THE ORIGINAL ESTIMATE OF $2000 MADE BY SHORN8 A.\nI SHOULD SAY THAT THE PROPOSALS MAY NOT BE THE UNANIMOUS\nOPINfON OF OUR COMMITTEE ON ALL POINTS AND ISSUES* IT MIGHT NEVER\nBE SO* EOT WE CAN MAKE ADDITIONAL CHANGES LATER.\nOne other thing. Mm suggesting that you do not cast\nYOUR BALLOT BEFORE JUNE 16, IN ORDER THAT ANYONE WISHING TO COMMENT\nmay send them to you before you vote.\nCordially® /p\nFrank b. SchoolsY\nManager* WILL Sr WiUC"
}