{
  "id": "d1265-4",
  "text": "PERSONS REGISTERED UP TO JULY 1st AT INSTITUTE FOR EDUCATION BY RADIO\nc\n¥\nAnderson, Cleland H. — Ohio State Journal, Columbus\nArnold, E. J. — Supt. of Schools, Bremen, 0.\nAshbrook, W. A. — Dept, of School Administration, Ohio State Univ.\nBeaird, T. M. — Station MAD, University of Oklahoma, Norman, Ok la.\n“Bidlack, Cecil S. — Station WEAO, Ohio State University\nBrackett, B. B. — Station KUSD, University of South Dakota\n\"BuckFr^lrTe^ School of Education, Western Reserve University\nCaldwell, F. C. — Dept, of Electrical Engineering, Ohio State Univ.\nCavanaugh, Robert E. — Extension Division, Indiana University\nChambers, M. M.“ -.-“136 Chittenden Ave. , Columbus\nCharles, Ann — Station WEAO, Ohio State University\nCharters, Jessie A. — Dept, of Adult Education, Ohio State University\nCharters, W. W. — Bureau of Educational Research, Ohio State Univ.\nColeman, Robert J. — RCA Victor Co., Camden, N. J.\nCorbett, E. A. — University of Alberta, Canada\nCram, W. B. — Station WNAD, University of Oklahoma, Norman, Okla.\nDale, Edgar— Bureau of Educational Research, Ohio State University\nDear, Don — 199 E. Broad St., Columbus\nDarrow, B. H. — Ohio School of the Air, State Dept, of Education\nDondineau, Arthur — 135^ Broadway, Detroit, Mich.\nDunlam, Franklin — Radio Music Co., New York City\nDusthemier, 0. L. — Station WTAM & Baldwin-Wallace College\nDykema, Peter W. — Teachers College, Columbia University\nElliott, N. R. — University of Kentucky, Lexington, Ky.\nEllis, A. Caswell — Cleveland College, Cleveland, 0.\nElwood, John W. — National Broadcasting Corp., New York City\nEswine, H. E. — Ohio State University\nEvans, S. H. — 1 Madison Ave., New York City\nEwbank, H. L. — University of Wisconsin, Madison, Wis.\nFrew, James E. — Prin., Junior High School, Logan, 0.\nFrutchey, Fred P. — Bureau of Educational Research, Ohio State Univ.\nFuller, Ceorgia — Station WSUN, st. Petersburg, Fla.\nGibson, Herman — Hudson Ave., Newark, Ohio\nGibson, Mrs. H. R. — 5^0 Hudson Ave., Newark, Ohio\nGill, Jessie — Ohio State University (student)\nGlenn, C. B. — Dept, of School Administration, Ohio State Univ.\nHansen, Irene L. — Graduate Student, Ohio State University\nHarrison, Margaret —Teachers College, Columbia University\nHedges, W. S. — Station WMA$, Chicago, Ill.\nHewitt, Harvey — Ohio Wesleyan University, Delaware, 0*\nHier, Ruth — Ohio State University (Student)\nHiggv. R. C. — Station WEAO, Ohio State University\nHoelzlcV 'Elmer G. — American School of the Air, New York City\nHornback, Florence M. — Dept, of Adult Education, Ohio State Univ.\nHughes, B. L. — 212 University Ave., Ithaca, N. Y.\nHughes, Royal1 D. — Dept, of Music, Ohio State University\nJackson, M. H. — State Dept, of Public Instruction, Madison, Wis.\nJarvis, E. D. — Fort Recovery, 0.\nJenkins, Gwendolyn — Station WEAO, Ohio State University\nJensen, J» C. — Nebraska Wesleyan University, Lincoln, Nebr.\nLTHEnson, Helen — American School of the Air, New York City\nKeith, Alice — American School of the Air, New York City\nKeller, Edith M. — State Dept, of Education, Columbus, 0.\nKnepper, William E. — Station WEAO, Ohio State University"
}