{
  "id": "d143-10",
  "text": "The third part of the lesson is the presentation of the main body of the idea—\nthe concept, the demonstration, the explanation, the totality of verbal and non-\nverbal communication that allows the substance of the lesson to be transmitted\nto the students in the classroom.\nThe fourth part of the lesson is the reinforcement activity. The reinforcement\nactivity takes place in the classroom, but it is not the responsibility of the\nclassroom teacher in this system to plan for this. The television teacher and\nthe instructional team are responsible for the lesson and they must assume the\nresponsibility for detailing the activity that follows a lesson. Such activity has\nonly one purpose and that is reinforcement.\nReinforcement is a necessary and important part of the total lesson. Reinforce¬\nment may consist of practice or drill under certain circumstances, or it may be\nan activity that is concerned with self-identification on the part of the learner--\nthat is, activities designed to allow the learner to identify himself with the learn¬\ning. It is clear that no functional learning can take place unless the learner can\nin some way identify himself, his needs, his sensory satisfactions, his aspira¬\ntions and his well-being with the subject. Reinforcement may also include\nactivity designed to establish the relationship of various subject areas. It is\nimportant to all learning that the learner understand in clearly defined terms\nthe relationship between the various categories of learning and the effect that\nthe learning of one subject has upon the learning of another. The television\nteacher and his team plan the fourth part of the lesson as they do all the other\nparts, but the effective application of the reinforcement techniques must depend\nupon the initiative and creative ability of the classroom teacher, and the Class¬\nroom Instruction Supervisor.\nIn the plan of this system no provision was made for the storing of lessons on\ntape for re-use in another semester or in another school year, because the plan\nrecognized that to be increasingly effective this system must be continually sub¬\nject to modification. Each new lesson in each subsequent term is built upon the\nmistakes and inadequacies of the lesson in the previous term, and each lesson\nin each sequence of lessons must be built upon the subjective evaluation of the\nlesson immediately preceding in the sequence. The subjective evaluation must\nbe based upon the responses elicited from the learners as reported by the\nteachers and supervisors in the classrooms, and the critical review of the\nlesson by the television teacher and the instructional team.\nIn order to accomplish such evaluation, and to effect necessary modifications\nand improvements, as little time as possible must elapse between the presentation\nof a lesson and its evaluation. It naturally follows, that in order to accomplish\nthis, as little time as possible must elapse between the planning and recording\nof a lesson and its presentation in the classroom. The initial plan envisioned\nthat a lesson would be recorded and presented on the same day. Further con¬\nsiderations indicated that it was more practical to plan and record a lesson on\none day and present it in the classroom the following day. In any event it is\ndisastrous to the plan of instruction to have more than two days elapse between"
}