{
  "id": "d143-12",
  "text": "-11 -\nlesson one day and presenting it in the classroom the next day becomes much\neasier to cope with. It is at this planning session that the insert lessons ought\nto be planed and such provisions made for breaks in sequence that are the re¬\nsult of emergencies or contingencies. The time given over to planning in the\nsummer months was never intended to be a period in which a number of lessons\nwere permanently recorded in sequence and the program be prepared weeks in\nadvance. This period was originally designed to be a total school year planning\nperiod. A period in which the total program in total sequence and in the pre¬\nscribed scope and depth was to be planned for the entire 180 days of the school\nyear. It is essential to the instructional plan that the design be followed.\nThe Instructional Team\nThe plan initially called for one teacher to be responsible for the instruction at\neach grade level in the elementary schools. This was later modified so that the\nteachers were assigned to specific subject areas, and were responsible for sev¬\neral grade levels. Regardless of the assignment of teaching responsibilities to\nthe individual television teachers, the fact remains that this system is still a total\nteam effort. It is a co-operative system that in order to be effective requires\nthat each person within that system performs as precisely as possible his par¬\nticular function in co-ordination with all the other members of the team. The\nplan of instruction in the system is such that it can tolerate no Maverick, nor any\ntangential activities, whether in the classroom, in the studio, or in supervision.\nThe first part of the instructional team is that group which works with the televi¬\nsion teacher in the education center. In addition to the television teacher this\ngroup consists of the Research Teacher, the Producer-Director, the Production\nSupervisor, the Research Librarian, the Subject-Matter Supervisor and/or the\nAssistant Director, the Film Editor, the Artist, the Photographer, and the engi¬\nneering staff. Each of the persons filling these positions have a specific job to\ndo and a specific responsibility, and they are expected to have special skills that\nenable them to do the assigned job. There is a definite working relationship\namong these people which must be adhered to and respected by everyone in the\ngroup if the co-operative system is to work as it is designed to work.\nBASIC POSITIONS IN THE DEPARTMENT OF EDUCATION\nThe following will define as precisely as possible the functions of each of the\nprescribed positions and indicate their relationship to the other positions on the\ninstructional team:\nThe Television Teacher\nThe Television Teacher is the person who presents the lesson on television.\nThis person is also responsible for the planning of the lesson and for its basic\ncontent and for its academic excellence. The Television Teacher is the core\nof the instructional team but is assisted by the other members of the team in"
}