{
  "id": "d143-14",
  "text": "- 13 -\nThe Research Teacher becomes responsible after the lesson is planned for such\nverification of content information as may be necessary or indicated. This\nperson also has a prime responsibility for the initial selection of such collateral\nmaterial that is needed to demonstrate or otherwise visualize the lesson presen¬\ntation. The Research Teacher would work with the Producer-Director to find\nsuch film clips, slides, maps, charts, drafts or other materials as may be\npertinent or necessary to the development of the lesson prfesentation.\nIn the elementary grades especially, and to some extent in all grades, it is\nexpected that the Research Teacher will also be a back-up teacher when neces¬\nsary and on occasions make actual presentations on the air, if the necessity\narises. However it must be remembered that the primary job of the Research\nTeacher is to do the research that is necessary to keep the instructional program\nup-to-date, authoritative, and in proper sequence. The assignment of a research\nteacher to work with a particular teacher or with teachers is the responsibility\nof the Assistant Director in charge of elementary or secondary education.\nThe Producer-Director\nThe Producer-Director is an important member of the instructional team. He\nis administratively responsible to the Supervisor of Production and is assigned\nby him to a particular teacher or team. However the Producer-Director is re¬\nsponsible to the Television Teacher and to the Assistant Director in charge of\nelementary or secondary education for the quality of the lesson and the effective¬\nness of the production that is turned out. The Producer-Director serves two\nfunctions. First, he is the producer and that means that he is the man who gets\nall of the elements of the production together. He is concerned with the proper¬\nties, with all the visual materials, of getting the necessary people in the right\nplace at the right time, and organizes the general material aspects of the pro¬\nduction. As the director he takes on a more intimate relationship with the\ninstructional program and with the individual lesson. As a director he must be\nconcerned with the visual and oral aspects of the production, and particularly\nwith the non-verbal communication involved in the production. There is often a\ndifference of opinion between the Television Teacher and the Producer-Director\nbecause of their basic backgrounds. The Television Teacher, as a teacher is\nprimarily in the business of verbal communication and feels that he is superior\nin that particular area. The Producer-Director is more concerned with visual\nand non-verbal communication and usually feels superior in this area. This is\none of the problems of the team operation. The business of producing a lesson\nin all of its aspects requires a team approach.\nIn the final analysis the Director makes the selection of views or of visual con¬\ntact that actually reaches the learner in the classroom. He sees the Television\nTeacher in a way in which the Television Teacher cannot see himself, therefore,\nfull weight must be given by the Television Teacher to the suggestions and the\ncriticisms of the Producer-Director. The Producer-Director must be respon¬\nsible for the lighting of the production to be sure that full lighting values are"
}