{
  "id": "d143-15",
  "text": "- 14 -\nobtained in presenting the visual material. He must be responsible for the\ncamera work and the quality of camera work as well as for the speed and\nsmoothness with which the program moves from one scene to another. The\nProducer-Director is also responsible for the pace of the program, that is,\nthe smoothness and ease with which the television teacher or other persons\ninvolved in the lesson move across the stage and present the various aspects\nof the lesson. Timing in motion, and the amount and kind of material that\ncan be visually shown in the course of one lesson is also a major responsi¬\nbility of the Producer-Director. He likewise has responsibility for the quality\nof sound in all of its aspects as used in the production. The engineering de¬\npartment must be responsible to the Producer-Director for the quality of\nrecording that is made, because the quality of the recording will be the ulti¬\nmate determiner of the quality of the production that the Producer-Director\nhas achieved.\nThe Production Supervisor\nThe Supervisor of Television Production is the administrative and operational\nhead of the production department. He has general supervision over the Pro¬\nducer-Directors and the studio crews and he is the person who assigns the\nProducer-Directors and the studio crews to their various jobs. He also has\noverall supervision of the art department and the photographic department.\nThe personnel assigned to these departments work very closely with the Pro¬\nducer-Directors, with the Television Teachers and with the Assistant Directors\nin charge of instruction, but operationally they are under the direction of the\nSupervisor of Television Production.\nThe Supervisor of Television Production is also responsible for the film and\ntape library. It is his responsibility to assign someone to do the physical work\nconnected with the editing and inspecting of film and tape. It is his direct re¬\nsponsibility to be sure that the film, film clips, slides and tapes are properly\nstored, properly catalogued and properly referenced and annotated where anno¬\ntations are needed. It is the direct responsibility of this person to see that a\nfilm clip library is established, and that each film clip is properly inspected\nand replaced after its use and each film clip has the proper head and tail on it\nand is properly catalogued and annotated. The Supervisor of Television Produc¬\ntion is also responsible for all properties that may be used in the various\nproductions. This includes models, mock ups, demonstration equipment, and\nsuch real or live materials that may be used from time to time.\nIt is the responsibility of the Supervisor of Television Production to see that\nall studios are ready for production at the time that they are needed and that\nthey are scheduled in such a way that maximum use can be made of production\nfacilities. It should be noted here that the plan of use of the production facili¬\nties did not intend for the production facilities to be used just during the eight\nhours of a normal school day but working assignments were to be made at any\ntime during the day or evening hours that maximum use could be made of the\nfacilities, and of the production and instructional personnel. It is the"
}