{
  "id": "d143-18",
  "text": "Research Librarian\nThe Research Librarian must be a professional librarian and is to be in total\ncharge of the research library in the production center. This person has a\nresponsibility for the accession of all books and materials in this library, for\ncataloging them, cross indexing them and annotating the catalogue cards. He\nis to be responsible for the physical layout of the library so that it will be\nefficient and easily usable by the Research Teachers and the Television Teachers.\nThe Research Librarian also has a prime responsibility to help the Research\nTeachers and the Television Teachers find the material that they need in the\nlibrary, and to order such materials and discover needed materials as may not\nbe in the library. In other words, a research librarian is a major resource\nspecialist in the field of academic and technical research. The Research\nLibrarian is directly responsible to the Head Librarian, however, he has an\noperational responsibility to the Assistant Directors in charge of the various\nareas of instruction and to the teachers.\nThe Elementary Classroom Teacher\nThe Elementary Classroom Teacher, where possible, is to be at least a gradu¬\nate of the Feleti Teacher Training School. The Elementary Classroom Teacher\nis a native Samoan and has a responsibility to co-operate in every way to in¬\ncrease his or her academic and pedagogical skills. Proficiency in the use of\nthe English language is one of the first requisites of a good Elementary Class¬\nroom Teacher. The Classroom Teacher is to receive a lesson plan for each\nlesson during each day which will tell him precisely what to do in relationship\nto the lesson, both before and after, and they have a responsibility to read such\ndirections and to follow them as closely as possible. In the event that the direc¬\ntions are not clear to the teacher they are to seek the help and advice of the\nAmerican principal who is in charge of the school. During the telecast of the\nlesson the Classroom Teacher is to participate in the lesson with the children.\nIf a response is required she must give the response, if an action is required\nthey must lead the children in such action or activities. In the matter of drill\nin the use of the English language and practice in the articulation of English\nsounds the Classroom Teacher is required to participate with the children.\nWhen the television lesson is over the Classroom Teacher must follow the direc¬\ntions for reinforcement activities as closely as possible, and where help is needed\nshe is to go to the American Principal and request such help. In no event is the\nSamoan Classroom Teacher expected to re-teach the lesson that has been taught\non television, nor to teach any additional ideas or concepts or information, other\nthan that which has been given in the telecast. However they do have the re¬\nsponsibility of helping in such practice or drill as may be required, the organiz¬\ning and playing of any games that might tend to reinforce such drill or practice.\nThey have the responsibility to help the children identify with the subject matter,\nwith the information that has been given, with the ideas that have been established\nso that they fully understand that there is a direct relationship between their\nneeds, their desires, and their own environment and the lesson. The teacher\nalso has the responsibility to indicate a relationship between one lesson and another\nin terms of the interrelationship of subject matter."
}