{
  "id": "d143-19",
  "text": "- 18 -\nIn addition to these activities the Samoan Classroom Teachers, particularly\nthe Elementary Teachers, have a special responsibility to learn along with\nthe children, to increase their knowledge of subject matter and of teaching\ntechniques, and they are to co-operate with the Principal in using intern\nteachers in the classroom as assistants, and in developing effective in-service\nteacher training sessions after regular school hours. The Elementary Class¬\nroom Teacher also has the responsibility to assist the Principal in keeping the\nschool in good order and in caring for the facilities of the school.\nElementary Consolidated School Principal\nThe Elementary School Principal is in total charge of his school and is directly\nresponsible to the Supervisor of Elementary Schools and through him to the\nAssistant Director in charge of Elementary Education. It is the responsibility\nof the Elementary Principal to be in the classrooms, from one to the other,\nduring the entire school day. The Elementary Principal is, in effect, the\nPrincipal Teacher and it is his job to see that the Classroom Teachers under¬\nstand directions written in the daily lesson and that they follow those directions\nas nearly and as well as they can. He is to assist the Classroom Teachers in\nunderstanding those areas of the instruction which they do not understand and\nhe is to supervise the activities of each one to carry out in answer to the direc¬\ntions they receive in the lesson plan.\nThe Principal Teacher is directly responsible for the quality of activities and\nreinforcement activities that occur in the school. He is the school*s contact\nwith the curriculum committee and with the instructional team. It is his re¬\nsponsibility to make regular reports to the Assistant Director in charge of\ninstruction relative to the responses which he receives from the children and\nfrom the teachers to each of the television lessons. He is to evaluate these\nresponses and he is to add his own subjective judgment to the effect that each\nlesson has upon the various grade levels in his school.\nThe Elementary Principal is responsible for the in-service teacher education\nof his faculty and also for the constant supervision and in-service training of\nsuch teacher-interns as may be assigned to him from time to time. He is also\nresponsible for the physical plant in his school and for the general administra¬\ntion. Each Elementary Principal will have a Samoan Assistant Principal to\nhelp him in handling the administrative affairs of the school, especially prob¬\nlems involving school and village matters.\nThe Assistant Principal may teach a regular schedule of classes if the school\nis small enough to allow this. If anything mechanical or electronic happens to\ndeprive the school of any lessons, it is the responsibility of the Elementary\nPrincipal to immediately advise the Assistant Director in charge of Elementary\nEducation or the Supervisor of Elementary Schools, and it is especially impor¬\ntant that he request such lessons as are missed or in some way deleted from\nfrom the sequence of the school schedule be rebroadcast at another hour and that\nhis children have the advantage of going through this particular lesson."
}