{
  "id": "d143-20",
  "text": "- 19 -\nIt should be the responsibility of the Elementary Principal to be sure that no\npart of the sequential program is precluded from the teaching schedule in his\nschool.\nIt is particularly important for the Elementary Principal to be sure that con¬\ntinuing feedback information goes to the instructional production center so that\nthe instructional staff will be able to modify the subject matter and adjust the\npace and the content of the lessons and the schedules to meet the demonstrated\nneeds of the pupils. It should be remembered by the Elementary Principal\nthat such co-ordinated feedback information enables the Principals to continu¬\nally evaluate the instruction in their schools.\nSecondary Classroom Teacher\nSecondary Classroom Teachers, where possible, shall be native Samoans\nwith college degrees and secondary school certification. They shall be directly\nresponsible to the Secondary Classroom Instruction Supervisor to which they\nare assigned. Secondary Classroom Teachers are to receive a lesson plan for\neach lesson during each school day which will advise them precisely what to\ndo before the telecast, during the presentation and after the telecast for rein¬\nforcement. They have a responsibility to read the lesson plans and follow, the\ndirections as closely as possible. If the directions are not clear to them, they\nare to consult with the Classroom Instruction Supervisors and seek their help\nand advice. During the television presentation the teachers are to participate\nwith the students and lead such actions or activities as may be required. They\nare not ever to re-teach the lesson, nor to teach any additional concepts beyond\nthe lesson content, but rather to amplify and reinforce the ideas and informa¬\ntional content of the presentation, according to the plan. They are to participate\nin regular in-service teacher education programs, and are to concentrate on\nlearning and practicing large-class techniques. Where ever possible all sec¬\nondary school subjects are to be taught in large classes -- that is, all students\nin a particular grade level in each school are to be assembled and taught in a\nsingle class, under the guidance of a single teacher, and, where necessary, an\nassistant teacher. In every way possible they are to encourage student response\nand total student participation in reinforcement exercises and activities. The\nSecondary Classroom Teachers must assist the Secondary Classroom Instruc¬\ntion Supervisors in feeding back evaluative information to the Instructional\nCenter and make an effort to report in a valid manner the responses of the\nstudents to the lessons and procedures.\nThe Elementary School Supervisor\nThe elementary school supervisor has direct charge of all elementary schools.\nIt is his job to see that the principals are on the job and in the classrooms as\nthey should be, to see that the needs of the schools for facilities and materials\nare met, and to see that an adequate complement of teachers are available at\nthe school. He is to be the person in direct charge of the school plant and\nresponsible for effecting any necessary repairs or maintenance that needs to"
}