{
  "id": "d143-22",
  "text": "- 21 -\nOTHER POSITIONS\nHead Librarian\nThe Head Librarian will be directly responsible to the Director of Education.\nHe will be in charge of all the libraries in the school system of American\nSamoa. His immediate and main concerns will be the high school libraries\nat Utulei* Leone and Manu’a, and the Eastern District High School when it is\ncompleted. He will also be responsible for setting up and supervising such\nlibrary facilities as may be required in the elementary consolidated schools.\nHe will suggest to the Principals ways in which library materials ought to be\nhandled and will suggest methods of assigning personnel for handling materials.\nThe Television Research Librarian will be under the direct supervision of the\nHead Librarian* who will have the responsibility of assisting the Research\nLibrarian in finding and procuring such materials as may be indicated by the\nrequests from the instructional department. It will be the responsibility of\nthe Head Librarian to set up a qualified cataloging system and see that all\nmaterials are cross-indexed and properly annotated. The Head Librarian will\nbe responsible directly to the Director of Education* but will have a working\nresponsibility with the Principals of the various schools and with the Assistant\nDirectors in charge of Elementary* Secondary* and Adult Education.\nSupervisor of Tests and Measurements\nThe Supervisor of Tests and Measurements will be responsible for working\nwith the Assistant Directors in charge of Elementary and Secondary Education\nand with the Principals and Teachers to develop a valid series of tests for\ndetermining educational achievement and relative learning rates. He will be\nresponsible for adapting any existing testing standards to the Samoan environ¬\nment and to the level of the Samoan children. He will establish some valid\nmeasurement criteria and assist the teachers in applying such tests and\nmeasurements. He will be directly responsible to the Director of Education\nbut will work co-operatively with other members of the instructional team.\nWhere specific classroom materials are used, he will attempt to have such use\nserve the double purpose of being an instrument of learning reinforcement as\nwell as an instrument of measurement.\nSupervisor of Guidance\nThe Supervisor of Guidance will work directly under the Director of Education\nand will be responsible for such personal guidance programs as may be estab¬\nlished in the secondary schools and will have direct charge of the Guidance\nCounselors who will be native Samoans. His primary responsibility will be to\nestablish a valid program of selection for the scholarship program* to admin¬\nister this program in all of its ramifications* and to make such efforts as may"
}