{
  "id": "d143-23",
  "text": "-22 -\nbe necessary to procure other scholarships in the United States for such\nSamoan children as may be able to take advantage of them. He will also coun¬\nsel with, and guide, those Samoan children who are advanced enough to go to\ncollege, and feel that they have an opportunity to profit by a scholarship in an\nAmerican college or university.\nSupervisor of Adult Education and Evening Programs\nThe Supervisor of Adult Education and Evening Programs shall be directly\nresponsible to the Director of Education. He will take charge of booking and\nhandling all contracted materials for entertainment in the evening and shall\nevaluate the materials in terms of the objectives which they are to serve. He\nwill be responsible for the content and for the appropriateness of the materials\nthat go on the evening program. In addition to this he is expected to organize\nregular adult classes and to provide casual educational material as will meet\nthe objectives previously set forth in this manual. He is to call upon the Super¬\nvisor of Television Production, the Assistant Directors for Elementary and\nSecondary Education and all other members of the instructional and engineering\nstaff for whatever help is necessary in order to carry out his responsibilities\nof providing an adequate evening and adult education program.\nAdministration and Supervision\nThe educational system of American Samoa is administered by a Director of\nEducation. He has complete authority for the entire administration and super¬\nvision of the educational system. He is a member of the governor's staff and\nthe head of the department of education.\nThe Director of Education has on his staff five assistant directors for the fol¬\nlowing areas* 1) Administration, 2) Engineering Services, 3) Secondary\nEducation, 4) Elementary Education, and 5) Management of Instructional\nResources Center.\nThe administrative and supervisory responsibilities of these five assistant\ndirectors are outlined in the organization chart of the department of education.\nThey are all directly responsible to the Director of Education and together they\nmake up his administrative and supervisory team. It is important that each\none of these staff assistants keep the Director informed of all the instructional\ndevelopments within the system. It is especially important that any material\ngoing out from the Department of Education representing to be indicative of or\ndefinitive of the educational system be channeled through the Director of Educa¬\ntion.\nIn addition to these five Assistant Directors, the Director of Education has on\nhis professional staff five Supervisors that are directly responsible to him*\n1) Supervisor of Television Production, 2) Supervisor of Guidance, 3) Super¬\nvisor of Adult Education and Evening Programs, 4) Supervisor of Tests and\nMeasurements, and 5) Head Librarian. These people work co-operatively"
}