{
  "id": "d143-24",
  "text": "- 23 -\nwith all other members of the team, but they are directly responsible to the\nDirector of Education.\nThe Director of Education also acts as ex officio chairman of the Elementary\nCurriculum Advisory Committee and the Secondary Curriculum Advisory Com¬\nmittee, and the Joint Committee that works toward the articulation of subject-\nmatter through the twelve grades.\nGENERAL POLICIES\nIt is the policy of the system, and has been previously set forth in other writ¬\nten outlines of the plan, that as nearly as possible all equipment of all kinds\nused in any area of the system be standardized. It is clear that the more\ndifferent kinds of equipment we have the more maintenance problems we will\nhave, the more difficulty we will have in supplying and maintaining parts and\ncomponents for the equipment. Materials that are used, such as paper, or\nphotographic paper, or film, or chemicals, or tubes, or any other stock\nmaterials, must be carefully evaluated and standardized, so that there will\nnot be a large diversity in the kinds and quality.\nIt is important that one area of administration and supervision be totally re¬\nsponsible for all the maintenance of all equipment and for the inventory control\nof all equipment. Because of this the responsibility has been assigned to the\nengineering department and will be the direct responsibility of the Assistant\nDirector in Charge of Engineering. It will be his responsibility to see that, as\nnearly as possible, equipment is standardized; and that adequate parts are\nmaintained for the equipment in the event of breakdown so that there will be\nno stoppage of production. All repair and maintenance requests will be chan¬\nneled through the Assistant Director for Engineering. This includes mechanical\nequipment as well as electronic equipment or electrical equipment. The Assis¬\ntant Director for Engineering Services will also have the responsibility for\ninventorying all equipment, and for keeping an up-to-date inventory file that\nwill show the distribution and the location of all the equipment. He will also\nmaintain a file on all parts and components to be carried in stock, for all\nequipment - mechanical, electronic, and electrical.\nIt is important to the instructional plan that definite values be established for\nproduction of instructional materials. To this end it is the policy that all\nlesson presentations shall be as visual and as non-verbal as possible, con¬\nsonant with good communication and good teaching. When demonstrations\nare to be made, and it is possible to have live demonstrations, with real\npeople and real things, it is the policy of this system that such procedures\nbe followed. When it is not possible to have live demonstrations, it is essen¬\ntial that the next best thing be used, which is moving pictures. To this end"
}