{
  "id": "d143-26",
  "text": "January J, 1963\nDear Dick:\nWe still haven't toy more word on the Nigerian proposal we submitted - and I had\nput off writing you in the hopes that we might know something by now. We're hope¬\nful, but can't seem to find ou# anything.\nIncidentally, before I forget - Anas wrote me (enclosing same material)about a\nfrigid who was coming to this country and would like to get tied in with a speakers'\nbureau. I checked here (both commercially and with NEA, etc.) as George had asked\nme to do, and could find no one. I so wrote to George, but later got another\nletter from him saying that he hadn't heard from me. We then wrote and asked if\nhe'd like for us Just to try to find someone in NYC who might have any interest -\nhe wrote %$ck \"Yes'* (that was the extent of the letter, incAdisntly), so we are\nnow going to try that. Will you please inform him that we haven't forgotten him -\nthat we are still trying - and that we're sorry we don't keep him better informed,\nbut we can't seem to keep up with any of our correspondence.\nThe NAEB has Just signed a contract with the Government of American Samoa to\nand supervise the installation of an ETV system in the islands, using three VHP\ntransmitters with receivers in all the schools (fed by '’community-type\" antennas),\nlife had done a feasibility study on this last January and they got almost $2 million\nfrom Congress to get it started (our contract naturally isn't for that amount since\nmost of it is for equipment, buildings, etc., and we Just write the specs for those\nand help the government evaluate the bids - they then enter directly into the\npurchase contracts - we do, however, have to do all the design and systems engineering,\nhire five of the permanent staff - who will work for us the first year - help train\npersonnel, teachers, etc.). We have originally recommended six channels, but they\ncould get only enough money to buy equipment for three, but all of our planning,\nthe building, the tower, etc., have to be planned for six, because they expect to\nexpand as soon as possible. Bronson and I leave for about two-and-a-half weeks\ndown there on January 16 to start the ball rolling *&we will take with us Cec\nBidlack (whom you should remember) who works for Smith Electronics in Cleveland\nand we have subcontracted with them to do part of the engineering design work under\na project engineer we are hiring direct. Also, we hope to hire and take with us\nthe man who would be the chief engineer for the station. Alan Jester, whom you\nshould certainly remember, is flying in tomorrow to talk to us about it - I cer¬\ntainly hope he takes the Job. He's fairly excited about the great possibilities\n(and he had told me earlier that he was interested in getting back into ETV), but,\nof course, we ’ re not giving him much time to make up his mind and prepare for the\nmove - although Tannis and the kids could come down later.\nI would appreciate any further information you can give me about Davis' unhappiness\nwith our handling of the Sudan - if that 'w what you meant. I agree, if he is un¬\nhappy, that we should work it out with him, but I also agree that now would not he\nthe best time, I fear."
}