{
  "id": "d143-28",
  "text": "STAT E S\n\\Jfi' r'7£<>\n-far INTERNATIONAL DEVELOPMENT\nT E LE PHONE\n2 5 9 5 1 - 6\nDear Harold:\nA.I.D. MISSI ON TO N IGERI A.\nEMBASSY • P.O. BOX 2182 • LAGOS, NIGERIA\nREGIONAL OFFICES:\nE N U G U\nI B A 0 A N\nDecember 5, 1962 kaduna\nI, too, will write a personal letter, mostly because there is nothing of an\nofficial nature that I can say at the moment.\nOur \"unhappy” reaction to the NAEB response is perhaps a little over-described.\nGeorge and I thought that it was not quite as positive and vigorous as might have\nbeen. Under the circumstances, I can see why. Although why you did not hear\nfurther and sooner from Davis, I can’t imagine. They seem to be taking their own\nsweet time in this process. Part of the diffculty I am sure is the ridiculous way\nin which Gerry Winfield got his you know what in a sling over the purchase of the\ntransistorized TV receivers. As a result, everything relating to this area seems\nto get a thorough going over before anyone will make a move. are\nAs things now stand, we (that is the Mission here in Nigeria) is out of the\nprocess. next moves are up to Washington. We have asked, urgently, to\nbe advised as to what is cooking, but thus far, no response. It can only lead\none to assume that nothing is happening, so I am glad to receive word through\nother channels that at least one proposal is in hand. I cannot tell you whether\nyour proposal is the first one, the only one, the last one, or what, because\nI know nothing. As usual, we in the field are beginning to chafe at the delaj.\nOld Gorgeous George has done well in preparing the ground work, and we are ready.\nThe Nigerians are beginning to wonder if all the things we promised ®re ever going\nto show up.\nOh yes, before I forget it. Another minor factor may be that Davis seems to\nhave gotten a warped view of what happened in the Sudan vis-a-vis Head et al. It\nmight be well to do a little cultivating there, but I suppose it isn’t a very\nopportune time just now.\nI still believe, and with some reason, that this will be a marvelous opportunity\nfor a contractor. Unless things go seriously wrong, there is a world of possibility\nfor this activity in Nigeria. Hence, I hope you whomped up a really shattering\nproposal.\nI would appreciate, on a personal basis, anything in the way of information\nwhich you might pick up, for it will come faster that way than through the usual\nchannels. I will tiy to do the same, in so far as I can without violating the\nlaw regarding the awarding of contracts.\nOtherwise things go quite well. The only sour note turned up Saturday morning\nwhen I received a cable from Vienna saying that JoLee had appendicitis and asking\nmy permission to operate if necessary. Since then, not a damned word. I have\ncabled the Embassy asking for details and a report, but no word. Ada calls me\nabout every ten minutes. No great worry really, but one likes to know. Especially\nparents.\nOne small favor, if time permits. In many drug stores you will find small\nboxes of \"Excello\" plastic cigar holders. I think they are about 39 or 49 cents\nfor a box of a dozen or so. I could use three or four boxes. I have a good\narrangement for getting El Producto cigars on a duty free basis, so have been"
}