{
  "id": "d143-4",
  "text": "- 3 -\nThe plan requires that each elementary school have at least one assistant\nprincipal who is a native Samoan. Where possible, it also requires that each\nclassroom teacher in the elementary schools be at least a graduate of the\nFeleti Teacher Training School.\nIn secondary schools all basic subject-matter shall be taught in large-group\nclasses, which shall be presided over by a qualified college-trained teacher,\npreferably a native Samoan. These large-class secondary teachers shall be\ntrained by the instructional staff in the techniques of large group instruction,\nand in the method of conducting each class session according to the lesson\nplan provided by the instructional resources center. The day-by-day training\nof the secondary classroom teachers, and the direct supervision of the work\nof these teachers in the classroom shall be the responsibility of the Classroom\nInstruction Supervisor. These Supervisors will be responsible to the Assistant\nDirector in charge of secondary education for their academic procedures and\ninstructional techniques. For general administrative purposes they shall be\nresponsible to the Principal of the high school, who shall be in direct charge of\nthe entire school program and responsible for general administration.\nThe Curriculum\nThe basic curriculum of the total system shall consist of the four major sub¬\nject areas - languagerarts, mathematics, science, and social studies. To\nthese basic subject areas there shall be added such ancillary subjects as may\nbe necessary to meet the specified objectives of the system, and as may be\ncompatible with the instructional schedule.\nIt is basic to the plan of the system that educational objectives be established\nover a twelve year period, and that each subject area be planned in proper\nscope and sequence from grades one through twelve. This articulated schedule\nof instruction requires careful co-ordination between each grade level over\nthe entire twelve year program. In the teaching process, this means that\nlearning must be functionally demonstrated by the learner, and that, whenever\npossible, teaching must be subjective and functional.\nThe demonstrated needs of the Samoan people have indicated that the plan\nrequire that the central subject area of the total curriculum shall be the\nEnglish language.\nRequisite to learning in all other areas is comprehension and facility in the\nuse of the English language. Therefore the plan requires that in all subject-\nareas that major emphasis be placed upon the use of English, the thorough\nunderstanding of English and the development of the ability to communicate\nin English speech and writing. This does not mean that other basic subjects\nare to be neglected at any grade level, but it does mean that instruction in\nall the other basic subject-areas be geared to the use and comprehension of\nthe English language. In this regard, in grades one through twelve, we are"
}