{
  "id": "d143-46",
  "text": "CONTRACT\nThe following agreement,entered into this 2nd, day of January, 1964, shall constitute\na contract between The National Association of Educational Broadcasters,hereinafter\nreferred to as the party of the first part, and William J. Kessler,P.E., hereinafter\nreferred to as the party of the second part.\nThe Parties hereto do hereby mutually agree and covenant to the followings-\nThe party of the first part retains the engineering and consulting services of the party\nof the second part for an indefinite period of time,which shall in no case extend beyond\nDecember 31>1964, to perform certain act^and services as shall be hereinafter enumerated.\nThe Part/of the second part shall act as project and consulting engineer for the\nEducational Television Project in American Samoa during the year 1964* In this capacity,\nthe party of the second part shall satisfactorily perform the following services in\nrelation to the said project within the specified limitations:\n1. Furnish all required engineering rel#ative to the television and\nmicrowave propagation and reception problems involved in the said project,\n2, Locate site on the island of Ofu. for the necessary translator^awfeca.\n3.Supervise the preparation of an inventory of all equipment.\n4. prepare a filial report for submission to the Government of American\nSamoa with a detailed layout of the installation.\n5. Furnish a report of all special tests made of equipment,and a report\nof all tests made relative to propagation and reception in the system.\n6. Supervise the scheduling of the necessary artisan labor during the\ncritical stages of the installation,\n7. Break in the operational crew,and check out the operational phases\nof the completed installation.\nS. Coordinate the installation of receiving systems at each school\nand village site.\n9. Avise the representatives of the party of the first part on all\ntechnical and engineering matters pertaining to this project.\n10. Supervise final system test and performance evaluation.\n11. Furnish to the party of the first part a 6ertificate of Completion.\nFor the faithful performance of the above listed acts and services at such times as are\nexpedient and mutually agreeable, the party of the first part shall pay to the party of\nthe second part a sum of six thousand dollars ($6,000.00),an in addition shall furnish\nsuch transportation as may be necessary to carry out the specified duties,together with\nnecessary per diem allowance for living expenses, providing that such travel and such\nexpenses do not exceed the standard set by regulations of the U.S. Government.\nThe party of the second part may employ any other qualified engineer to assist him in\ncarrying out the above acts and services,providing such engineer or engineers work under\nhis direct supervision,and further that the party of the second part assume full\nresponsibility for any fees or salaries resulting from such employment.\nIt is mutually agreed that the party of the second part is not relieved of repsonsibility\nfor any of the above enumerated acts or servic es regardless of the time of the payment\nof the stipulated fee by the party of the first part; however if acts beyond the control\nof the party of second part caused by the party of the first part shall prevent the\ncompletion of the terms of this agreement during the yeear 1964,then the contract shall\nbe construed as having been completed and the obligation discharged.\nSigned:\nWm.J. Kessler,P.E.\nWm.G. Harley or\nH.E. Hill"
}