{
  "id": "d143-5",
  "text": "t\n- 4 _\ncommitted to the development of competency in the English language through\nthe use of the structural system as developed by Dr. George Pittman and\nmodified to the needs of American Samoa.\nThe plan calls for a program of functional arts and manual skills to prepare\nthe great bulk of the Samoan children to live and work in Samoa. It is allowed\nthat all children need a basic education in the four major subject-areas, and\nsome will prepare to go on to college and perhaps do some advanced work in\nother vocational areas, but the great majority will remain in Samoa living\nwithin the normal Samoan economy. The economy is basically agricultural.\nTo this has been added some very small industrial development such as the\nfish packing plants and the service industries, and in the future there must\nbe expected a certain amount of tourist industry will accrue to the islands.\nHowever, it is clear that these outside forces have certain definite limitations\nand that the basic economy will remain agricultural for the bulk of the people.\nTo meet the general needs a modified skills program has been made a require¬\nment for all children in the ninth and tenth grades. For the boys this means\nthat there will be a general shop program based on the idea of home mainte¬\nnance within the Samoan village. A program of this nature will be conducted\nat each of the high schools. The shop instructor will be a native Samoan, but\nall related information will be given to all grade levels at the same time in\nlarge classes through television instruction. By related information here we\nmean such things as, the use of measuring tools, the use of hand tools, the\nnature of woods and metals, the nature and use of paints and chemicals and\nother materials that may be required in the repair and maintenance of homes\nin Samoa.\nFor those students who show a particularly high aptitude for manual skills and\ntechnical understanding there will be an opportunity for continuing advanced\nwork in this field in the tenth and eleventh grades. A highly selective class in\nvocational skills will be taught at Utulei High School; and those who are suc¬\ncessful in being selected for continuing into specialized vocational skills will\nbe brought into Utulei for their eleventh and twelfth grade work in this area.\nOne of the main points that will be considered in selecting the boys for advance¬\nment into the vocational skills class beyond the tenth grade will be English\ncomprehension, and ability to communicate in spoken and written English, as\nwell as demonstrated aptitudes in particular manual skills.\nThe vocational skills in the selective training class at Utulei shall be divided\ninto three separate areas;: 1. Woodworking, 2. Metalworking, and 3. Elec¬\ntricity and electronics.\nFor the boys in addition to the home maintenance skills that are required in\nthe ninth and tenth grades and the possibility of selection for the vocational\nskills class in the eleventh and twelfth grades, there will be an opportunity to\ngo into a vocational agriculture. It is part of the plan that every effort be made\nto enhance the agricultural knowledge and skills of those students who have an\naptitude or indicate a desire beyond their normal academic training. Initially,"
}