{
  "id": "d143-6",
  "text": "- 5 -\nthe vocational agricultural classes will convene at Leone High School, and\nwill have their laboratory and farm work and farm shop work at the govern¬\nment experimental farm.\nThey will receive their related instruction by television in the regular class¬\nroom at the Leone High School. These classes in vocational agriculture will\nbe under the general supervision of the Assistant Director in charge of sec¬\nondary education, but will have the advice and help of the personnel at the\nexperimental farm, and will be under the direct teaching supervision of the\nvocational agricultural teacher. There will also be a course in vocational\nagriculture and in agricultural shop work at the Manu’aHigh School. This\nwill be under the direction of the vocational agriculture teacher, who will do\nboth the agricultural training and the agricultural shop training, and be a\nsupervisory assistant to the Principal of Manuka High School.\nThe amount of vocational agricultural training and agricultural shop training\nthat can be achieved in this system must be determined by experience in the\ninitial two or three years, and in terms of the response of the students, and\nthe villagers to this type of activity.\nFor the girls there will be required homemaking education in the ninth and\ntenth grades. In these grades most of the work will be done by television, and\nthe girls will assemble in the laboratory areas of the high schools for their\nclasses when it is practical to do so. At this point there will be very little\nlaboratory practice.\nThe major subjects to be taught in the homemaking classes in the ninth and\ntenth grades will have to do with personal hygiene, family hygiene, sanitation,\ncare of children, relative nutritional value of foods, and simple home economy.\nThe main laboratory practice at this point in the curriculum ought to be in the\narea of sewing. Related instruction in sewing will be given by television to all\nclasses at the same time; but the actual laboratory sewing experiences will be\ndone in the homemaking areas of each high school and under the supervision of\na native Samoan teacher. Homemaking education may be carried over into\nthe eleventh and twelfth grades on a selective basis, to be determined by the\njoint curriculum committee and compatible with the experiences, responses\nand indicated needs of the students and the Samoan people in the villages.\nLimited business education shall be offered in the eleventh and twelfth grades\nto both boys and girls. Entrance into business education classes shall be\nbased primarily upon demonstrated proficiency in the comprehension and use\nof the English language. Initially the main skills to be offered in business\neducation will be typing. Typing will be taught by television to all the classes\nin all of the high schools simultaneously. Typing will be supplemented by an\nintense course in Business English, which will also be taught by television to\nall members of the typing classes."
}