{
  "id": "d1547-2",
  "text": "“It first discusses satisfactory monochrome and\ncolor television signals as they appear in standard\noscilloscope and picture monitor representations.\nVarious types of test signals are also discussed. The\nmajor types of video signal impairments are then\nlisted and each type is considered separately. Sig¬\nnificant features, as they appear to monitoring ob¬\nservers in both oscilloscope and picture monitor pre¬\nsentations, are illustrated and discussed. Finally, a\nglossary of video terms is presented.”\nWe will have available only enough copies for\nchief engineers. Others who wish copies of this highly\ninformative booklet may address their requests to:\nMr. F. R. Mac Farland, Division Commercial Man¬\nager, American Telephone and Telegraph Co., 250\nPark Ave., New York 17, N. Y.\n* * * *\nThe April 1957 Journal of the Society of Motion\nPicture and Television Engineers contains three pa¬\npers on Video Tape Recorder Design. They constitute\nthe first published technical discussions of the Ampex\nvideo tape recording system. Various problems en¬\ncountered in the development are discussed and the\nsteps taken toward solutions are described in detail.\nTitles of the papers are “Comprehensive Description\nof the Ampex Video Tape Recorder,” by Charles P.\nGrusberg; “The Modulation System of the Ampex\nVideo Tape Recorder,” by Charles E. Anderson;\n“Rotary Head Switching System in the Ampex Video\nTape Recorder,” by Ray M. Dolby.\nIn the same issue of the SMPTE Journal, there is\nan excellent discussion of “Techniques of Television\nLighting,” by David Thayer of the Television Center,\nState University of Iowa, Iowa City, Iowa.\n#■ * * *\nAn interesting paper in the July 1957 SMPTE\nJournal describes a system of “Wide Screen Tele¬\nvision,” by Seymour Rosin and Madison Cawein. In\nthis system, known as “Scanoscope,” the conventional\n4x3 television aspect ratio is changed to an 8 x 3\npresentation. A “Scanoscope” lens is used on the\ncamera to squeeze the image on the image orthicon\nfrom which it is transmitted over a 9 me bandwidth\nsystem. At the television monitor, the image is un¬\nsqueezed electronically.\nThe July SMPTE Journal also contains a listing of\nU. S. colleges and universities offering courses in\nmotion picture introduction. This report by Desmond\nP. Wedberg, editor of Film and A-V World magazine\nalso gives a detailed listing of M-P courses. A future\narticle will cover television instruction.\nRobert F. Lewis of WFBE at Flint, Mich., sends\nalong a tip on installing coaxial connectors on\nRG59/U cable. He states that he has found it un¬\nnecessary to solder the shield of the cable when using\nPL259 plugs and UG176/U reducing adapters. Here\nis his method:\n“After stripping the outer polyethylene jacket\nfrom the cable, comb out the shielding, then cut it off\nso that it extends about %\" from the inside of the\nouter jacket. After folding the combed shielding back\nover the outer jacket, force the cable into the reduc¬\ning adapter. Next strip the inner polyethylene jacket\nfrom the inner conductor, insert inner conductor in\nthe center pin of PL259 plug, and screw adapter into\nplug. Solder inner conductor.”\nMr. Lewis states that he has used this method for\nyears and has never experienced a mechanical or elec¬\ntrical failure. It facilitates the re-use of coax con¬\nnectors since it is a simple matter to unsolder and\nclean the solder only from the center pin of the plug.\n* * * *\nThe New Castle, Henry Township School Cor¬\nporation of New Castle, Indiana, has a 10 watt Gen¬\neral Electric FM transmitter for sale. If you are in¬\nterested in its purchase, contact Mr. Bernard T. Han¬\nley, A-V Director.\nETV STATIONS ON THE AIR\nKCTS\nSeattle, Wash.\n9\nKETA-TV\nOkla. City, Okla.\n13\nKETC\nSt. Louis, Mo.\n9\nKLSE\nMonroe, La.\n13\nKQED\nSan Francisco, Calif.\n9\nKRMA-TV\nDenver, Colo.\n6\nKUHT\nHouston, Tex.\n8\nKUON-TV\nLincoln, Neb.\n12\nWAIQ\nAndalusia, Ala.\n2\nWBIQ\nBirmingham, Ala.\n10\nWCET\nCincinnati, Ohio\n48\nWGBH-TV\nBoston, Mass.\n2\nWHA-TV\nMadison, Wis.\n21\nWILL-TV\nUrbana, Ill.\n12\nWKAR-TV\nEast Lansing, Mich.\n60\nWKNO-TV\nMemphis, Tenn.\n10\nWOSU-TV\nColumbus, Ohio\n34\nWQED\nPittsburgh, Penna.\n13\nWTHS-TV\nMiami, Fla.\n2\nWTIQ\nMunford, Ala.\n7\nWTTW\nChicago, Ill.\n11\nWTVS\nDetroit, Mich.\n56\nWUNC-TV\nChapel Hill, N. C.\n4\nWYES\nNew Orleans, La.\n8\nSEPTEMBER, 1957\n3"
}