{
  "id": "d462-106",
  "text": "-10-\nwithout Impairing the economic strength of American business in the\nslightest. And it would be money well invested. It would come back\nin increasing long-term profitability, in holding down the tax\nburden, and in assuring an environment for business growth and\nprosperity.\nNow, a word about the private-public sector relationships.\nI think it is obvious that business and government must develop the\nsame kind of effective partnership in social problem-solving that\nhas been achieved in wartime. This will be helped enormously by\nbusiness organizing itself for effective action on those aspects\nof the problems it can best handle — by being quite clear about\nwhat it will take in the way of reasonable profit incentives <\nand by measuring the results of its social investments. We must\ninsist that government do likewise — develop an effective\norganizational structure out of the present hodgepodge of agencies,\ndefine its areas of greatest competence, and also measure its results.\nGovernment, for example, should pay the bills for general\n3nu tO'jLsq nisitco u - ; ;i /i.nr:?x bvl&t H tout\neducation and other functions of general benefit to the community.\nIt must maintain the conditions — particularly of high employment\n. son t V’OJt 9W !. y oo vmi n;\nand steady growth — under which the private sector can function\nJt •: • .*\"j OO? :*?l. / m ~S: i U: i • ', 7 i\\ :.• i /•; \\ .y: -r.-. V\neffectively. It is precisely in this area of private-public\n, aiivgl-’. i ivio . rcacw two ;griv loo ■ no i. dud L-sidoa Ibc-xJ i-to orkt\nsector relationships and performance that CED has made its\ntOi /irsv .iasX aelss Monisud :r,JoT .ameldoiq Cenoiiaoubs bus\ngreatest contributions.\n. f Brftf lo tma-j toq wet a iaul- , noi.l£.td 00©?; isdi J- iom e-tow , elqmBxe\nMy remarks have been an attempt to indicate some of the ways\nbehhi ,asaadaiaud\nin which the great and critically-needed resources of private enterprise\n33 -\ncan be applied to public purposes. And I hope I have stimulated your\neonsxolt ib wia?trn n odam binow , tnomno’S'ivxr© in rsoe wo evow mi\nown thinking about the role of the business economist in this process."
}