{
  "id": "d462-110",
  "text": "k\nlO.WHYV-l’hllBdelohla Warren Kraetzer reporta that they\nattempted a trainee pro/; ram for minority persona last year but\nran Into difficulty with the union In regard to production and\nengineering assignments. However, they intend to try again this\n11 .i”yxz-,pv - Cleveland Oettv Cope reports that they have tried\ntbe e roense of training negroes but finds It pretty4\nfrustrating whan after 6 months of Investment of time andeffort\nthe commercial stations woo them away with higher pay. She wishes\nthere was some way to guarantee the loyalty of those she train* *\nbut with educational salaries this la difficult.\n. ^aa^Yllle - Bob Shepherd reportxthat thev -\no1 c°m?oro lal )hroadoaa tors-have accepted'” 7\ngroups of 8 - 12 students from high school. The program goes\nthrough the year, apparently In non-class hours aboutThfurS\ntSkefS 8b°Ut 12 8M8lon8 *\" *** \"eourse*. Each station\nxSMSTtFSS n*K“* 8B”tt° r**ia”“ »»««i* «*\nthaw Htl ^~PS F^,and TV DasMolnes. John Montgomery reports that\n*hoy«• gently working In cooperation with the Dee Moines\nareas Of rarti8 ln .6||8 ti,8l\"lne °f high school students In the\nele«tr^nin*dl° 8\"d tfievlslon production, communication\nelectronics,c ommerold art, etc. The Input Is mutl-raclal\nalthough he Implies no special effort to recruit minorities.\nwherahv%KsffiW as51*1* \" B°b Chllttaler reportra training program\nneeMes Part-time employment and Job training to young\nS council.*' 8 tlra8* Al8° WOrMnK \"lth 10081 8“w!\ni081188 B°b '\"tl8°* report that as he takes over fee\ngoes on^say\" mf,mbol‘8 of “Verity groups on his staff. He\n. .. MAs a result I have undertaken an active carroai&n\nand^osltlons°oferesp”nslbllltynby1ChannelP13f°l havensn^kP0St'*°n8\ns'everlfof ?h° ™>8“ L^oSch^h '°\nwhlthfi f®ople we a^o now writing and determining\nwhether they could come to work for the station,, S\ncoIIacao <rt”Jvsh8Ve not yet had the chance to contact Negro\ncolleges In the area, though this will be done within the nerk\ntwo weeks« The school X think we would especially develoo\na great working relationship with is Bishop College."
}