{
  "id": "d462-119",
  "text": "- 4 -\nWFSU, Tallahassee had great success this summer with BETTER LATE -\nTHAN NEVER, a series offrank and honest discussions of social problems\ndirectly affecting the stationTs coverage area. The series was so\nwell received that it has niched a permanent place in the Fall sched¬\nule.\nExploring such topics as junior and senior high students and\nrace relations, drop-outs, civic leaders, thechirch, and the college\nstudent, BETTER LATE - THAN NEVER offered a vent, an outlet to anger\nand expression that could have taken less positive courses. Clayton\nA. Roehl, Program Manager, says, \"WFSU-TV has found that people will\ntalk if given the chance - that most people - white or black, have\nsomething to say - something that they consider to be important, and\nwhether they say it over a medium, such as television, or with a brick\nthrough a store window, depends largely upon which opportunity is\npresent at the time’.’\nWFSU believes what it has learned from BETTER LATE - THAN NEVER\nand, as a consequence, is readying two new series for Fall which are\nin essence an oblique approach to racial tension programming.\nTallahassee is the home of two universities, Florida State\n(predominantly white) and Florida A & M (predominantly black). WFSU\nnow proposes to give a voice to A&M. FAMU FORUM, a weekly quarter-\nhour new program - for community audience - will be written, edited\nand presented by Florida A&M students who will also fill all produc¬\ntion positions including that of Director. WFSU will closely super¬\nvise production at the outset and will continue to train the produc¬\ntion crew as the series evolves. It is hoped that those students who\ndemonstrate competence will then be hired as part time staff as are\nFlorida State students.\nFlorida A&MTs football team is a perennial winner, in the South¬\neast, yet the total coverage of the games is a weekly 6 minute report\non the local commercial station. WFSU plans to produce a weekly half;*\nhour program with ASMTs football coach, hoping the show will add to\nlocal Black pride in showcasing this type of accomplishment through\nsports.\nMAYBE TOMORROW offers a black boy and a white girl as principal\ncharacters in a program about children in the three to five year old\ngroup. The program is stated from the viewpoint of this age of inno¬\ncence and is figuratively seen through their eyes. What is seen is\na world in which the only race is the human race and all people are\nbrothers and sisters. It is what the world could, should and will\nbe at some time in the future - maybe tomorrow. MAYBE TOMORROW is\na quiet quarter hour statement of values that can use constant re¬\nstatement. Original music scored for the program underlines the\ntheme."
}