{
  "id": "d462-128",
  "text": "3\n6. \"Madison Human Interaction\"\nan hour program that discussed a project in which\nminority group children from Indiana, Mississippi,\nWisconsin and Illinois visited Madison area- host\nfamilies. The purpose of the program: to see how\nthe visits influenced race relations.\n7. Again WHA-TV teamed with the state educational\nradio system to carry live the entire session\nof public hearings conducted by the Wisconsin\nState Legislative Council Advisory Committee\non the Kerner Report.\nThe station clearly has a commitment to promote human under¬\nstanding and interaction with these and other series being planned.\nCONTACT: Thomas Rogeberg, Program Supervisor\n*****\nWVIZ-TV, Cleveland is doing an interesting follow-up to NETT s\nBLACK JOURNAL. Beginning with the initial \"Journal\" program, WVIZ\nfollowed live with BLACK JOURNAL - CLEVELAND RESPONSE. The pro¬\ngram ,iis; hosted by a Black and black guests are determined by the\ncontent - art, medicine, law etc. Following discussion of local\nattitudes, the phones are opened to the home viewer. WVIZ reports\nsolid response to RESPONSE.\nNext month, a new series premiers called BLACK PEOPLEHOOD.\nWritten and produced by members of the Cleveland black community,\nthe series will expose their interpretation and evaluation of blacks\nin politics, religion, education, science and medicine, the arts,\nlabor, business, the community, civil rights, and as innovators.\nEach major topic on BLACK PEOPLEHOOD will get ah in-depth treat¬\nment of 10 one-hour programs. Each program has a steering committee\nfrom within the core city appointed by black producer Chuck Richardson.\nWVIZ has found that open cooperation with the black community\nhas permitted a workable atmosphere good for everyone. The station\nis trusted because it leaves show content up to the blacks. WVIZ\nnever decides who will speak on what. As a result, the station is\n\"plugged in\" and has no problem with feedback.\nA black cameraman and black crew chief are regular staff members,\nbut there is no effort to create an all black production unit, although\nthe station suggests it would not object should such a unit come about.\nNot just for blacks but for anyone interested in learning, a\nseries titled WOMENTS WORLD taught basic nutrition, child care, how\nto shop etc. Viewing sessions with follow-up discussion leaders were"
}