{
  "id": "d462-131",
  "text": "6\n\"Headstart\" was staged with imagination as the kids were seen\ngoing through a number of activities that included singing, story\ntelling, language training and art. Then a scene with two youngsters\nvisiting a Nurse was shown. A puppeteer showed how his puppet was\ngiven an ear examination by the Nurse.* Then the Nurse examined the\nhearing of the two children (who had never even seen a Nurse, let\nalone undergo an examination).\nNext came a brief scene showing mothers of the children in group\ndiscussion with an 0E0 psychologist talking about discipline and other\nchild-oriented problems.\nOperation Headstart is an enrichment program that gives under¬\nprivileged kids a broader vision of life around them before they start\nschool. \"Headstart\" as done by WITF explained that program with deft\ncreativity.\nIf Hershey, Pennsylvania and WITF can do all of that and more\none would suppose larger stations in larger cities could at least equal\nthe record. How do you stack up?\nCONTACT: Lloyd Kaiser, General Manager\n*****\nThink about WHA*s, WVIZ*s and WITFTs total-community approach as\nyou consider these words from John W. Gardner, Chairman of the Urban\nCoalition:\n\"I still encounter bedding Citizens who say, *Why try to\nget all those people into the act? Why don*t a few of us\nget together quietly, and try to solve some of these problems?*\nIt’s a reasonable suggestion, but hopelessly old-fashioned.\nIt won*t work for long in- any modern city. We wonTt re¬\nestablish stability in our cities until we bring into the\nsame conversation all significant leadership elements in\nthe community.\nThese elements in the community who are used to exercising\npower have to learn that paternalism is dead and that the\nsearch for solutions must be shared enterprise. All elements\nthe community have to learn to collaborate rationally in\nseeking solutions, each yielding some of its pet views.\"\nNEXT WEEK: The South Carolina Educational Television Center\n•and\nThe Alabama Educational Network"
}