{
  "id": "d462-142",
  "text": "page five\nPrograms for the Disadvantaged\nAugust 27, 1968\nUNIVERSITY OF WASHINGTON MARTIN LUTHER KING MEMORIAL One program.\nPANEL ON PRESS AND RACE RELATIONS Taken from the Spring meeting of\nthe Washington State Association of Broadcasters. One program.\nNEGRO-AMERICAN INTEREST IN AFRICA Dr, John Hope Franklin, the nation’s\nleading Negro historian; University of Chicago.,\nTHE NEWSMAN AND THE RACE STORY Four programs sponsored jointly by\nthe University of Washington, City of Seattle, and the United\nStates Department of Justice. Topics:\nThe Newsman and the Race Story. Edward P. Morgan,\nChief Correspondent, Public Broadcast Laboratory.\nReporting the Race Story. Panel with Walter Hundley,\nDirector, Seattle Model City Program; Orvill Luster,\nExecutive Director, Youth for Service of San Francisco;\nand Edward J. Devine, Symposium Vice Chairman.\nDecision-Making During a Riot. Panel with Ben Holman,\nDepartment of Justice; Irving Margolis, WRC-TV and\nRadio, Washington, D. C.; Ron Pinkney, WOL Radio,\nWashington; Gilbert Gimble, Police Department, Wash¬\nington.\nSEARCH FOR A HISTORY Alex Haley, author who assisted in \"The Auto¬\nbiography of Malcolm X.\"\nINTERVIEW WITH WILLIAM PULLIAM Dissertation by, and interview with,\nMr. Pulliam, who has an original idea for political organi¬\nzation and a slate of candidates for each proposed office.\nBRINGING A LITTLE COLOR INTO OUR LIVES Panel featuring Dr. Charles\nOdegaard, President of the University of Washington; Dr. Brink,\nDean of Social Work; Frank Byrdwell, Student Counsellor; and\nthree students.\nPROGRAMS PRODUCED BY KUOW\nBEARING INDIRECTLY ON RACE RELATIONS\nWAR ON POVERTY — WHOSE WAR? Speakers: Walter Hundley, Seattle\nattorney Jim Munn and others. One program.\nTHE PROBLEMS OF THE SOUTH Alabama Attorney General Richmond Flowers.\nOne program.\nHASSAN HAMAD A Negro student from Egypt, attending the University\nof Washington, looks at America's race problem. One program."
}