{
  "id": "d462-161",
  "text": "page three\nProgram for the Disadvantaged\nAugust 12, 1968\nSomehow, there ought to be time at the November convention to\nhear the story in detail of Milwaukee's WHA and its INNER CORE week of\nmulti—media, saturation broadcasting. Target: the plight of the\n180,000 plus minority race residents of Milwaukee's ghetto neighbor¬\nhoods o\nRalph Johnson, General Manager, kicked off the prelude in\nNovember of last year* Going out into the black community, he recorded\na great number of conversations, letting the people themselves tell it\nlike it iso That initial series ran every Sunday afternoon with a\nrepeat on Thursday evenings through the end of April.\nOn Monday, April 29 of this year, the intensive broadcasts began,\na cooperative venture with WHA—TV and WMVS—TV that lasted through\nFriday, May 3rd.\nBeginning at 8:00 AM, excerpts of the earlier \"conversations\"\nwere aired on the twelve station radio network (which covers the\nstate). Every hour throughout the day a different program piece\nwas played, most in the conversation format, but also discussions and\nreadings by Dick Gregory were heard. These daytime segments varied in\nlength, and listeners to any of the radio stations in the statewide\nhookup could find something every hour.\nAt 8:30 in the evening, the simulcast began. A studio audience,\nprimarily black, and numbering from 25 to 60 persons, came to the.\nWHA-TV studio, prepared to fire the hard questions at a panel chaired\nby Chancellor of the University of Wisconsin Extension, Donald R.\nMcNeil. Panel guests included representatives of the \"establishment\"\n...a true cross section of successful citizens of Milwaukee. The.\nMayor's office, invited to send a representative to all five evening\npanels, declined after Program No. 1. Businessmen, civic leaders,\neducators, NAACP people, realtors, insurance brokers all came in their\nturn and listened as Milwaukee's poor spoke of a very different sort\nof life in their city.\nThe first evening program ran hours; the remaining four went\nto 90 minutes. All were factual, open, spirited and revealing. After\ninitial remarks by the invited guest experts, audience members (and\nthey changed every night) came forward to a number of floor mikes down\nfront to start the questioning. Each evening was devoted to a\nseparate primary topic such as housing and education. An effective\nperipheral touch was added in the series' theme music (piano and bass)\ncomposed by a black student at the University and played by him and a\nwhite foreign student from Norway.\nThe purpose of the series was to show \"What it means to be Black\nand live on Milwaukee's North Side.\" Did it all succeed? Here are\nexcerpts from only a few of the printed reactions:"
}