{
  "id": "d462-176",
  "text": "-9-\nThe second major area that I propose to discuss with you today is that\nof educating the majority society. In the vernacular, it is \"doing our own\nthing*\" White America, the majority population, has always been the major\nfactor in determining the status and activity of black America. This is\nchanging. It is a significant change. It is a change that recognizes the\nkind of independence, self-determinism and self-realization that the American\nManagement Association, for example, is dedicated to. Paternalism and handouts,\nin no matter what form of altruism or sincerity, are not the answer many\npeople once thought they were. Black Americans more and mere want to do their\nown thing, want the pride and self-respect of making their own progress.\nSomething casing right now at the Dalton School here in New York may\nprovide some insights into what is happening. The Parents-Teachers organization\nof this private school of good reputation, located in the affluent Park\nAvenue and 89th Street area, sponsored a program to bring parents of children\nat that school and parents of special school 201 in Harlem together to learn\nhow to help their children learn to read better. \"A more satisfactory way than\nwriting checks,\" one of the sponsoring parents said* The $26.40 costs paid by\neach Dalton parent were not charged the parents from Harlem. What disappointment\nfor the white parents, then, when only 13 of the expected 40 parents from\nHarlem showed up—13 out of a total of 100 adults in the program! How to\nexplain this? Rationalization? Condemnation? Frustration? Listen:\nA recent article in The New York Times quoted one young man as saying\n\"We don’t say keep whites out of our lives, but we say make black people so\nstrong they can do their thing--whatever their thing is--by themselves.\"\nAnother was quoted as saying: \"Black people want black control of their\nlives and activities more than anything else. If they make mistakes, let\nthem be black mistakes~**we*re tired of white mistakes in our lives.\""
}