{
  "id": "d462-18",
  "text": "PROJECT SUMMARY REPORT:\n\"PROGRAMS FOR THE DISADVANTAGED\"\nThe self-imposed mandate public broadcasting has placed upon itself\nto invest in minority interests is being met. I think my reports of progress,\nwhich at best represents a scant beginning, suggest a professional and per¬\nsonal commitment that daily changes the terrain and sub-strata of public\nbroadcasting in America. We are an industry in motion. We care. We are\nshouting down a history of indifference, of prejudice, of ignorance. It is\nclear that black Americans, Mexican-Americans, poor white Americans,\nAmerican Indians, the urban-disadvantaged and the rural-deprived have a\ndeep pre-occupation with us, the public broadcasters; we have a reciprocal\nbind to them. We are all joined together in an arena of social change. Our\ncharge: to utilize the personnel and technical resources of the electronic\nmedia in every possible way toward a betterment of the human condition.\nIt is easy to settle in self-congratulations over what has been done,\nand that is not a small effort. It is more difficult to assess what our failures\nare through co-mission and omission and gauge what still needs to be done.\nTelevision and radio stations throughout the nation are engaged in\nprogramming for, by and about disadvantaged peoples. The semantics of\nthe effort change frequently. \"Disadvantaged\", \"culturally different\", \"ghetto\ndwellers\", \"inner city\" and \"inner core dwellers\" - these are some of the\nphrases applied to \"the people left behind\". Basically, we are talking about\nanyone, of any age, who has been held back from an enriching education, who\nhas been on the receiving end of police over-reaction, who lives in sub¬\nstandard housing, who is over-charged for goods and services, who is under¬\npaid for his employment, who has unequal legal protection, who is trapped\nin the demoralizing encirclement of welfare, who is judged first by racist\nprerequisites and only second as a Man. We are talking about millions of\nAmericans who look around themselves and know the shuddering reality of\nnot belonging to the abundant land. We are talking about people deprived of\ntheir own historical heritage. They are the have-nots in a nation unable to\njustify their predicament.\nAn historical glance at our development as a concerned industry shows\nthat Whites talking to Whites about Blacks gave way to Whites talking to Blacks,\nand then to Blacks talking to Blacks about Blacks. Now the Blacks are talking\nabout the Whites and we’ve come full circle. But the time for talk and more\ntalk is behind us. Black Americans may still mention \"Charlie\", but note\nthey no longer address him as \"Mister\". \"The Man\" is being fairly met, sized\nup and acted upon. In this dramatic confrontation, clear in its political-\nsociological-economic implications, is found the will to do something. That"
}