{
  "id": "d462-183",
  "text": "Robert L. Hilliard\nI had intended to speak here today, for an overview of what is to\ncome this morning, on the technological revolution that has taken place\nin the world and on the revolution that has not taken place in education;\non a philosophy of pragmatism that has seen the developments in communi¬\ncations, transportation and energy create a new mode of living and think¬\ning and on an existing philosophy and practice of education that has by\nand large continued to divorce itself from the real world and remain\nfirmly fixed in the 19th century.\nI had intended to stress, not as an ending point, but as a starting\npoint, the concept that many of you have heard me present in recent\nspeeches: that we must cease using educational technology to reinforce,\nto reflect outmoded educational curricula, technique and administration,\nand that wemust use the media to affect education, just as these media\nhave affected the world outside of the classroom, including students and\nteachers. I had intended to list specific changes in education necessary\nfor it to take full advantage of and give full measure to the world it is in.\nIn fact, I have that particular speech written. But I am not going to\ngive it.\nThe events of the past several weeks have made it clear to me that any\ndiscussion of education and technology at this time has got to relate itself\ndirectly, sharply, unhesitatingly to the urgencies in our society, to a\nbroad concept of education that is the here and now of the practical and\nnot only the then and there of the theoretical.\nI believe we must assess educational media, particularly television,\nnot only for their critical importance, but also for their importance in\ntimes of crisis.\nIn making this speech change virtually at the last minute, just before\ncoming to New York for this conference, I should say that my comments here\ntoday, therefore, do not necessarily reflect the position or endorsement of\nthe Federal Communications Commission.\nNewark, Detroit, Milwaukee, East Harlem are more important in reveal¬\ning our failures and potentials in the field of education, in educational\ntechnology and in communications than are all the experiments and applica¬\ntions in industry and in the schools and colleges.\nWe must take a deep breath and give deep thought when we look at recent\noccurences. How desperate a person must be to be willing to destroy every¬\nthing he has—including his very life.' What hopelessness and despair force\npeople to acts of self-destruction.' What a tragic cry for help is an inward\nact of violence.' What a forsaken wilderness of education and communication\nis revealed between the total society and .large segments of its people.'\nBetween the lines of hysteria and behind the pictures of fear two\nconsistent points continue to appear: education and communications. A"
}