{
  "id": "d462-28",
  "text": "page three\nPrograms for the Disadvantaged\nOctober 11, 1968\nconsulting organization employing students from the high school's\nVocational Electronics Department and the WRHS staff. Plans are\neven underway to establish a high school radio network which will\nlink together a large number of Appalachia schools.\nWRHS is now on the air from 7:55 a.m. to 7:15 p.m, Monday through\nSaturday, pursuing extended education pragmatically and with imag¬\nination.\nCONTACT: Henry W. Lamb, Jr., General Manager\nWDTR-FM, Detroit Public Schools has reported in again. Of parti¬\ncular interest is the fact that Program Director Dorothy F. Patterson\ngot immediate response to the Program Report dated September 27th.\nTwo other stations expressed interest in the Detroit station act¬\nivities - one asking for information about its workshop program,\nthe other querying the availability of WDTR's \"The Negro American\"\nseries. This best illustrates the value of program information\nsharing. We have so much to learn from each other.\nWDTR has produced additional segments for its \"On Alert\" series.\nFirst, the station will offer a three part series titled \"The\nCouncil and the Citizens.\" Dorothy Patterson reports a need to\nexamine the controversial question of the existing system of\nelecting Detroit’s Common Council (now elected from the city-at-\nlarge). The system has come under fire in recent years, principally\nfrom members of 'Detroit's black community. Careful investigation\nof the issues will be treated in three parts: \"Proposals for\nChange,\" \"Representation and Race,\" and \"Political Power and the\nNegro in Detroit.\"\nThe second addition to \"On Alert\" takes up the controversial issue\nof black history - commission and omission in American history text¬\nbooks. Who has the right to interpret history? Can it be quest¬\nioned? Changed? This section, titled “Teachers and Textbooks\" con¬\nsiders this very real battle that is being waged. An article\npublished by the Michigan State Department of Education, A Report\non the Treatment of Minorities in American History Textbooks offers\nthe following position:\n\"Blacks from various points on the civil rights spectrum\nhave shown uncommon unity in launching attacks on one\nsegment of the education front - the content and select¬\nion of textbooks in United States history. The attacks\nhave been singularly effective. Typically, they have\nsent social studies curriculum experts scurrying into"
}