{
  "id": "d462-3",
  "text": "BLACK ON BLACK—page 2\nWCNY-TV, CHANNEL 2b\nwere indicated ’’for not having shown understanding and appreciation of—and\nthus having not communicated—a sense of Negro culture, thought, and history.\nThe ’’Black on Black” programs will seek to challenge this” he added, ”by\nstressing the positive and constructive by searching for a reasonable solution\nto existing conditions through the improvement of communications between the\nblack minority and white majority and the substitution of fact and informed\nopinion for fiction and propaganda.”\nMong the many community organizations which have pledged their continu¬\ning support of the ”Black on Black” series are the Human Rights Commission,\nOrganization of Organizations, P.E.A.C.E., N.A.A.C.P., Dunbar Center, Urban\nLeague, Poor Peoples’ Campaign, the Society of Afro-American Students, Comm¬\nunity Help Association, The Liberated Voice, Home Town News, Ltd,, Alliance\nfor Progress, Debutantes, Syracuse Public School District, Roosevelt Junior\nHigh School, Syracuse Neighborhook Health Center, Neighborhood Youth Corpora¬\ntion, Central City Businessmen's Association, Hopps Memorial Church and\nA .L .E *R. T .\nThe preview program of the \"Black on Black” series will include a film on\nthe Dunbar Center Summer Camp at Bradley Brook, with an interview of\nReginald Gary, Executive Director of the Center. In addition, there will\nbe a look at the community calendar; a brief film segment on the opening\nof the newly-established Texaco station—a cooperative business venture by\nthe black community—which was a tended by Mayor Walsh, County Executive\nJohn Mulroy, and Congressman James M. Hanley; interviews whith Thornton Jones\nowner of the Ebony Market, and Dave McDonald, Director of Employment for the\nUrban League, on the role of the black businessman; and a short film featur¬\ning a poetry reading by Elinor Russell.\nThe ’’Black on Black” series will be produced on a continuing basis and\nwill be broadcast, beginning December 6, on alternate Fridays at 7?30 p.m.\nDirector for the series is Art Irons, and executive producer is Robert\nW. Thomas.\n-mr-"
}