{
  "id": "d462-39",
  "text": "6\neducational broadcast application forms. As the Commission knows,\neducational applicants utilize application forms for construction\npermits, licenses and renewals which require significantly less\ninformation and detail than comparable forms for commercial applicants,\nand unless and until the Commission’s complaint procedures develop\nthat significant discriminatory employment or programming practices\noccur in non-commercial educational broadcast operations, these\nseparate application forms should not be complicated by further paper\nshowings of compliance with non-discriminatory standards. In this\nconnection it is to be noted that the bulk of educational station\nlicensees are grantees of Federal matching funds from the Department\nof Health, Education and Welfare, and must, as a condition to such\ngrants provide assurance inter alia, in Form HEW-OE-4152 that\n\"The applicant will incorporate into any contracts exceeding\n$10,000 for the construction of an antenna-tower system or\nmicrowave-tower systems, the provisions for equal employ¬\nment opportunity for all qualified persons without regard\nto race, creed, color or national origin, as prescribed\nby Executive Order No. 10925 (March 6, 1961) and amended\nby Executive Order No. 11114 (June 22, 1963). (The agree¬\nment of the applicant and the language to be inserted is\nthat contained in the regulations of the President’s\nCommittee on Equal Employment Opportunities, Title 41,\nCode of Federal Regulations, Section 60-1.3(b).)”\nand also that\n”In determining community participation in the activities of\nthe educational television station involved in this project,\nthere will be no discrimination against any individual or\norganization on account of race, creed, color, or national\norigin of any individual.’’\nCopies of these applications are already required to be filed with\nthe Federal Communications Commission, so that this Commission already\nhas a continuing record of the licensee’s assurances respecting non-\ndiscriminatory employment and programming practices. Any further re¬\nquirements by the Commission in this area would be needlessly duplicative\nand time-consuming."
}