{
  "id": "d462-48",
  "text": "r ajl\nXECUTIVE DIRECTOR\nROBERT A. MOTT\nNational Educational Radio\nA DIVISION OF THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue N.W. Washington D.C. 20036 Telephone 667-6000\nSeptember 27, 1968\nSeventh Report, Radio Programs for the Disadvantaged\nKen Clark, Project Director\nFrom a statement made to employees by Ohio Bell President\nFrederick R, Eckley:\n\" <»»ooWe are moving away from the past with its out¬\nworn philosophies and policieso We have set our sights\non a goal that is criticized by some, but is morally\nright, that is sometimes hazy and indistinct but we\nbelieve attainable.,\nThe decision has been made and we have begun.\"\n* * * * *\nWDTR-FM, Detroit: Under a Title I grant this past summer,\nthe Detroit Public School System, through WDTR, ran a radio workshop\naimed at and designed for kids from Detroit's inner city, The\nresponse was good. Two groups of twenty students each spent six\nweeks learning radio from ground zero up. Technical training,\nprogram elements and administrative details were discussed and\npracticed by the two groups. Then Title I funds were expended.\nHowever, WDTR, dedicated and caring, decided to keep the\nworkshop idea alive and invited all those who had not graduated\nto continue the experience. Again the response has been positive.\nThe kids will continue and now begin the nitty-gritty job of\nwriting, producing and directing on—air programming.\nNo doubt some of the workshop students will get involved in\nWDTR's projected series of student interviews with black leaders\nof Detroit an idea that is scheduled for early Spring airing.\n. Perhaps one of the most useful projects the primarily in-school-\noriented station has undertaken is a thirteen part series on\nblack history-titled THE NEGRO AMERICAN. A brief explanation: In\nFebruary of this year, an at large invitation was extended to all\nhigh school students in Detroit (twenty three schools) to attend\na °f lecturfs delivered by Professor Benjamin Quarles,\nnoted black historian. The series was sponsored by the Social"
}