{
  "id": "d462-50",
  "text": "page three\nPrograms for the Disadvantaged\nSeptember 27, 1968\nWBOE-FM, Cleveland, representing the Cleveland Public Schools\nhas tied into the movement in another way0 Two lectures and two\ninterviews have particular relevancy,.\nUnder a grant from the Martha Holden Jennings Foundation and\nthe Cleveland Board of Education, WBOE mounted a series titled\n\"Visiting Scholars\", an undertaking that brought outstanding\nAmerican and European scholars in contact with Cleveland students„\nTwo such \"visits\" were conducted with black historian Dr. John\nHope Franklin, Chairman of the American History Department at the\nUniversity of Chicago,, His credentials are impressive: he\nformerly taught at Cambridge University, Fisk and Howard Univer¬\nsities and Brooklyn College, and studied higher education in\nNigeria on a U, S* State Department grant,,\nPart One of the Dr«, Franklin talk considered new interpretations\nof the Reconstruction Period in American history as they relate\nto the Negro; to consider his economic, political and educational\nproblems in the 1865-1877 period.\nPart Two examined advances of black Americans in the 1920-1967\nP^^iod and considered many of the unsolved problems remaining\ntoday. Segregation and discrimination in housing, employment and\neducation, and the Northern urban migration were highlights of the\nBoth talks were broadcast to Cleveland schools on fourteen separate\ntime segments, allowing for the widest possible listening audience.,\n* * * *\nNext, WBOE pursued two interviews with Dr„ Samual D0 Proctor\nformer college president and currently President of the Institute\nfor Services to Education where he is developing curriculums for\nuse at fifteen Southern Negro colleges. Author of \"The Young\nNegro in America, 1960 - 1980\", Dr. Proctor was formerly Director\nfor the Northeast Region for 0E0 and Director of the Peace Corps\nin Nigeria.\nThe interviews analyzed current social and curriculum problems\ninvolved in the education of black Americans.\nThe Franklin talks were available through NER last year; the\nProctor interviews will be an NER offering in 1968-69.\nCONTACT: Cecilia Evans, Senior High Radio Coordinator\nCleveland Public Schools"
}