{
  "id": "d462-59",
  "text": "-2-\nAmidst all the shouting and slogans and signs, BRYAN BEAVERS: A\nMOVING PORTRAIT presents a hushed statement on human relations worth\nconsidering.\nCONTACT: John C. Crabbe, General Manager\n* * * * *\nWMHT, Schenectady has been wailing strong for five months on the\nMonday evening show: BLACK TELECON, the station's phone-in discussion\nseries.\nMonday nights are turned over to Mrs. Audrey Harvey, the black,\nbright hostess who translates her activities with the Schenectady Community\nAction Program to a lively television arena. Her primary aim is to help the\npoor and to air the ideas and feelings of many on both sides of the poverty line.\nShe usually chooses panel guests who know poverty from first hand experience.\nHer guests aren’t always Black, but those who are White inevitably turn out to\nshare common problems with the Blacks.\nMrs. Harvey has a no-nonsense approach and cuts through to the very\nsoul of an issue efficiently and with perception. After igniting her panel and\nsetting the general discussion in motion, telephone calls are encouraged. In\nthe five months Mrs. Harvey has handled the program she has entertained\nthousands of questions and opinions.\nMany of the programs have rich currency in that the topics are wrenched\nout of the living history of our times. The Poor People's March, Racism in\nthe State Legislature, Education and the Negro and a crisis in the local Head¬\nstart program represent what Mrs. Harvey calls \"Now!\" problems.\nOther subjects treated have a less timely, though no less important\napproach. For example: the Negro middle class, the Human Rights Com¬\nmission, Negro History - and some of those lined up for the immediate future -\nthe Negro church in society. What Negroes Call Themselves and Why, The\nNegro and the Peace Movement.\nBLACK TELECON tries to reach both Black and White communities, to\nestablish some rapport between the two, to bridge the gorge of misunderstanding.\nMrs. Harvey hopes are basic - that the programs will stimulate people to do\nsomething about the problems.\nViewer response has been highly pro, as well it should be for a series\nof programs that is imaginative, provocative, very tuned in.\nDonald E. Schein, General Manager of WMHT explains why his station\ngot involved in the BLACK TELECON undertaking."
}