{
  "id": "d462-6",
  "text": "WCNY-TV, Black on Black Page 2.\nBlack on Black will also provide a cultural showcase for:\nNegro artists, craftsmen, journalists, and others.\nCharles Anderson, who is education director for the Syracuse\nUrban League, has been given release time to produce the Black on\nBlack series, as well as acting as host. A radio-television graduate,\nAnderson has considerable experience in producing television informatior\nprograms in the U.S. and Africa. \"To add diversity to the series,\nblack presidents and/or directors of community organizations represen¬\nting a broad cross section of black opinion, will be constantly sought\nout for guest editorials and appearances,\" Anderson said. \"Our series\nwill seek to present to the over-all public the problems, aspirations,\nobjectives and accomplishments which predominate in the black commun¬\nity,\" he said.\nTo accomplish its multiple purpose, Black on Black is designed\nas a magazine format series with some continuing elements. It will\nfeature a regular host with local guests, artists, and officials as\nwell as occasional national and international visitors. As often as\npossible, interviews and features are to be filmed on location in the\nNegro neighborhoods using the station*s mobile unit or film crews.\nOccasionally, a locally produced documentary may be shown to dramatize\nor illustrate subjects or issues under consideration.\nNegro leaders, journalists, and spokesmen representing a broad\ncross section of black opinion will be constantly sought for guest\ncommentaries appropriate to local events, stimulating community dis¬\ncussion and deliberation.\nWhatever the focus, Black on Black programs will tend to stress\nthe positive, the constructive; seeking the reasonable solution to\nexisting conditions; improved communications between the black minority\nand white majority; substitution of fact and informed opinion for\nfiction and propaganda; to expose rumors, misinformation and misunder¬\nstandings; the creation and development of leadership qualities and\n\"legitimization\" of the \"natural\" neighborhood leader; and providing\nfor the purposeful involvement of black people behind and in front of\nBlack on Black cameras.\nThomas Petry, President and General Manager of WCNY-TV, pointed\nout that while many other ETV stations around the country had already\nundertaken similar programming, he wanted to acknowledge that the\nChannel 24 staff working together with almost every neighborhood and\ninstitutional group dealing with human relations and urban problems,\nhad been preparing the new series for almost two years.\n-MORE-"
}