{
  "id": "d462-60",
  "text": "-3-\n\"We need to communicate with the black community\nevery bit as much as they need to have a means of\ncommunicating with us - and we need an emotional\nawareness of their problems before we can begin to do\nthe things that must be done.\nWe might not like what they say. We might not under¬\nstand their frustrations. But we need to listen. \"\nCONTACT: Don Schein, General Manager\n* * * * *\nAuburn Television, over the Alabama Educational Network is readying\nits initial programming for the rural disadvantaged for early 1969 airing.\nTentatively titled \"KATIE'S HOUSE, the twice weekly, quarter hour\nprograms will try to \"reach the unreached\", the rural homemakers who fall\ninto a lower socio-economic-educational level - women who have not been so\nfar exposed to TV teaching that is designed expressly for their capabilities.\nThe series is being produced by Auburn staff Producer-Director John\nBrockway. The \"Katie\" of the program will keep the approach to basic,\nelementary information breezy and informal.\nDudley Williams, Program Director, states the following objectives for\nthe series:\n1. To help young homemakers improve the health of their families.\n2. To aid the viewers in becoming more intelligent consumers.\n3. To assist in understanding the community and its resources and\nthus to be better equipped to participate in social action processes.\n4. To urge the homemakers to develop respect for themselves and\ntheir homemaking roles.\nThe series, produced by Auburn Television in cooperation with the\nAuburn and Federal Extension Services, is conceived as an experiment. The\nExtension Services will mail companion pieces of informative literature to\nthe housewives that will complement their viewing on particular subjects.\nTen pilot counties representing a cross section of Alabama rural living, will\nparticipate in a on-going study to evaluate the effectiveness of the series, con¬\nsidering publications, methodology and equipment."
}