{
  "id": "d462-69",
  "text": "5\nSome people say there has been enough talk; it is time for action. WBAA*s\napproach suggests actions, preceded by thoughful deliberations and prepa¬\nrations is a sounder approach.\nCONTACT: Jane Root, General Manager\n* * * * *\nWLIB, Harlem, is a commercial station. We report it here because of\na very special series titled WHAT MUST BE DONE now being offered by the\nNER Program Service in the October-December quarter.\nThis most unusual series of thirteen half-hour programs was produced\nin cooperation with NEWSWEEK Magazine and was inspired by the award¬\nwinning issue of that publication titled \"The Negro in America: What\nMust Be Done.\"\nSam Chase, Vice President of WLIB, Harlem Radio Center, created\nand produced the series in an effort to show listeners what they can do\nas individual, private citizens. WHAT MUST BE DONE suggests there is\na great deal of action and considerable options open to the individual\nwith a willingness to try.\nThe Host-Moderator for the series is Manhattan Borough President\nPercy Sutton. Each program is kicked off at the top by NEWSWEEK Editor\nOsborn Elliott who relates the researched facts of the particular problem\nto be discussed.\nAn eminent panel of distinguished Blacks and Whites, representing\nboth Militant and Moderate points of view, discuss the problem, offer\nsolutions, define roadblocks to those solutions, and then explain how\nlisteners can help break down the barriers.\nWLIB, when first airing the programs, followed each with a phone-\nin. Enormous listener participation was achieved as WLIB phones \"rang\noff the wall\". The public clearly felt personal involvement in the\nseries, wanted to do something, and in many cases had clear cut sug¬\ngestions to offer.\nSo far, 250 other stations have carried the series, many of them also\nutilizing the phone-in follow-up.\nThe panel list and topics are included in Enclosure #1.\nFor any station interested in top flight discussions of the most\ncritical domestic issue of this decade, consider WHAT MUST BE DONE.\nCONTACT: Robert Underwood, Manager, NERN, 119 Gregory Hall,\nUrbana, Illinois 61803\n*****"
}