{
  "id": "d501-117",
  "text": "•3-\nII. From Dick Vogl (¥01)\n\" My sincere regrets for the delay in answering your memo of September 2k,\nregarding recommendations for future NAEB radio programs. I thought perhaps\nwe could devote a portion of our Region IV meeting to a discussion of this\ntwo weeks ago. Failing in that, however, I do have a number of recommenda¬\ntions projected from our experience here at ¥01.\n\"To tackle the most difficult area first, I would like to see more quality\ndrama offered to the network. Specifically, I have in mind something of the /'\nquality and stature of the BBC ¥orld Theater, but of 30 minute duration.\nThese could be complete unrelated plays, such as dramatization of short\nstories, or serialized productions of longer worts. What they must defi¬\nnitely not be, however, is \"amateur radio drama.\"\n\"In the area of history on the adult level, I think of several approaches.\nI would welcome series in both American and European history and I think par¬\nticularly appropriate at this time, the histoiy of Russia. On a more spe- j\ncialized level, the history of American industry and the history of labor f\nin America would also be desirable and acceptable.\n\"I think that a thorough study of America* s ethnic groups; a sectional sur¬\nvey of our country, showing the differences in life in New England, the\nSouth, the Southwest, the Midwest etc., and a study of the \"American\" lan¬\nguage would also offer interesting program material.\n\"I do hope these suggestions are not too late to receive consideration and\nI appreciate the opportunity to make iry wishes known in the matter.\"\nIII. From Northrup Dawson, KUOM\n\"A quick note to say I*m very much in favor of all of Dick Vogl’s sugges¬\ntions for future network offerings.\n\"I concur that we need some really good drama of shorter lengths.\n\"The first problem, of course, is to find some top-calibre scripts, either\noriginals or non-copywright adaptations. ¥e at KUOM arenU currently geared\nto provide the above, but if some enterprising outfit can make a project\nof turning out the scripts, I think we at KUOM can offer some reasonably j\nhigh-level production and performance. If you can prevail on some member- j\nunit to gat going on a script project, we *11 volunteer to produce *em. /\n\"Burton, incidentally, points out that in England, the BBC offers a good\nmany long, light plays plus a good many half-hour dramas and serializations\nof standard fictional dramatized work. He wonders whether these might not\nbe available to the network.\n\"By all means let*s have some European history, and some treatment of Russian\nhistory in particular would be of real value in helping to understand what\nmakes them tick."
}