{
  "id": "d501-128",
  "text": "DATEi June 16* 195#\nTOs Bernard Buck } _\nLee Eitzen ) ^\nREFERENCE COPIES TO: Fj\nr£\\Vt®\nPlanning Subconmittee\n;o'3\nSkomia\nWaldo AbboJ^^adio Network Committee CM rmai\nFROM: Ken Wright* Subco^^to^ ^lilxrisan\nSony that TV* vacation* and increasing paver of YflJDT with new con¬\nst lection has delayed me so long on the following* Perhaps we can still\nsalvage something*\nTwo letters from Frank S* for ns to considers\n\"Will the Program Placing Committee accept the responsibility for\nproviding headquarters with a Radio Program Idea each month for inclusion\nin the Newsletter? Submit one idea each month on one page* two sheets or\nless* so this can be passed along to program directors*11\nBuck and Eitzen* will you help me provide such ideas? How about\nsending me at address below* fairly complete exposition of any ideas you\nthink member stations can use? I will submit them once a month to head¬\nquarters for inclusion with tbs Newsletter* These are needed at once* of\ncourse* Please tiy to think of three or four each and I will do the sane*\nand we’ll start this project rolling*\nSeccnd letters\n\"Can you have the Committee survey thoroughly the area or areas in\nwhich good programs are needed and which probably are not now available\nor will not be forthcoming from the 1956 grants-in-aid? I would like a\nrecommendation of three moh series with order preference indicated and\nalso prelim nary budgetary costs along with possible sources of material\nand possible production center or centers*n I*m sure Fnank realises ha?\ntough it will be to conduct such a business by mail, but we can try* Gould\neach of you* Buck and Slbzezuand any, .others who have ideas* make some\nsuggestions tome along iteTlnes SghooleyJunctions above? (Frank* let us\nknow more about i^he DeTocquovi.Ue^Bcripts if you want 'than considered*)\nOur own analysi.s ofTKcdrr^ill be a subjective one$ perhaps He research\ncommittee* Frank* has or will gather sane information from members about\ntheir individual needs so we can get a more complete samplijng of needs*\nW| surely need to fill in gqps in programming and perhaps our efforts here\nwill be worth while * Fleas© let me hear from you as soon, as you can*\nKenneih Wright\nDirector of Broadcasting\nBos: 8!#0\nThe University of Tennessee\nKnoxville* Tennessee"
}