{
  "id": "d501-137",
  "text": "COPY\nTHE UNIVERSITY OF TENNESSEE\nDIVISION OF UNIVERSITY EXTENSION\nBOX 8540. UNIVERSITY STATION\nKNOXVILLE\nOctober 7# 1965\nRadio Station WUOT\nMr* Waldo Abbot\nStation WUOM\nUniversity of Michigan\nAnn Arbor# Michigan\nDear Waldos\nEven after hearing your last two reports verbally# X en-\njoyed reading them again. Your oral delivery add*\nthe bite, I might add. Anyway, I'll be looking forward to\nhearing your report again now that you have two pnaeee to\nreport8on. I know nothing of the Acceptance Sub-Committee,\nand the Planning group hae done very little.\nYou can say that Wright, Eitaen, and Buck have conferred\nby mall on program ideaa for the network. We recommend con¬\nsideration of a prestige aeriea such as Ways of Mankind was,\nand suggested that the he Tooqueville sorlpts be considered.\nWe are further agreed that trying to originate programming\nconcepts, specific areas for programs, and specifio programs\nto fit the areas for a network is not a job to be undertaken\nby three people in Iowa City, Hew York, and Knoxville. Pro¬\ngramming by committee is a big fat headaone, of course, even\nif the committee can get togetherl it's nearly impossible\nwhen the committee doeanH meet*\nWright attended a meeting in Chicago with Chairmen of the\nGrant-in-Ald# Acceptance, and In-School Acceptance Committees,\nalong with hkornia and Bob Hudson to discus* this *L?5»2*\nin aid program# The master title of AM1H1CA XM THE TftENTikTH\nCANTUHY for the grant applicants was suggested by Wright, so\nour committee can claim credit for originating it*\nWright has also submitted a monthly radio program idea as\nper t-chooley's suggestion for the MAEB Mews Letter for about\nthree or four months now. This will continue, since I » getting\na few suggestions from members. Beyond this meagre activity,\nthe Sub-CoLlttee has been vague about it. function, its modus\noperendl, and its future course. Any ideas you have will be\nappreciated. I believe it is our fault wc haven't done morel\nsure i^itaen. Buck, and I oould come up with some concrete\nprograming principles if we could get together, hut lack of\ntime and budget hae prevented this so far. I bop* *®°a\"(“®et\nin Chicago if w® are to comprise the sub-committee next year*"
}