{
  "id": "d501-175",
  "text": "U. S. INFORMATION AGENCY\n1778 Pennsylvania Avenue, N. W\nWashington 25, D. C,\nNovember 1953\n(BACKGROUND INFORMATION)\nSummary\nThe U, S. Information Agency, which was created August 1, 1953 by the\nPresident's Reorganization Plan No. 8, consolidates the foreign information\nactivities of the U. S* Government into one program* It comprises all of\nthe foreign information activities formerly carried on by the International\nInformation Administration of the Department of State, the Mutual Security\nAgency, and the Technical Cooperation Administration* The exchange of\npersons program which was conducted by IIA, the predecessor agency, will\nremain in the State Department,\nThe Secretary of State will be responsible for providing the Director\nof the new Agency with full guidance concerning the foreign policy of the\nUnited States, In addition, the Department of State retains the responsi-\nbilitjr for controlling the dissemination of statements of official U. S.\npositions on foreign policy issues*\nField operations—the heart of the program—are conducted at informa¬\ntion posts which are part of the U. S. Embassy tesms directed by the U. S,\nChiefs of Missions, These operations are serviced by five communication\nmedia in the headquarters of the U. S, Information Agency, namely, radio\nbroadcasting, press and publications, motion pictures, the book and library\nprograms, and private enterprise cooperation. Through the last-named\nactivity, emphasis is being placed upon securing direct cooperation from\nprivate American organizations, such as industrial, fraternal, and non¬\nprofit groups, to facilitate non-Goveriment action designed to further\nthe overseas objectives of the information program.\nThe new Agency is responsible to the President' through the National\nSecurity Council, The Director of the Agency is Mr. Theodore C. Streibert,\nformerly Chairman of the Board of the Mutual Broadcasting System and\nPresident of Radio Station WOR, New York City.\nCongress has made available 080,249,716 for the foreign information\nprogram in the current fiscal year*\nIn the White House press release (July 30) announcing Mr, Streibert’s\nappointment as Director of the new Agency, the President said;\nnOur overseas information service never carried a heavier\nresponsibility than it does now. The service must clearly and\nfactually present to the world the policies and objectives of\nthe United States, It is not enough for us to have soond\npolicies dedicated to goals of universal peace, x'reedom, and"
}