{
  "id": "d501-176",
  "text": "progress* These policies must be made known to and understood\nby all peoples throughout the world. That is the responsi¬\nbility of the new United States Information Agency.\"\nAuthority\nThe basic law for the foreign information program is Public Law 402\n(SOth Congress): the \"United States Information and Educational Exchange\nAct of 1948,\" sometimes called the Smith-Mundt Act. That law states the\nbasic objectives of the program in Section 2:\n\"The Congress hereby declares that the objectives of this\nAct are to enable the Government of the United States to promote\na better understanding of the United States in other countries and\nto increase mutual understanding between the people of the United\nStates and the people of other countries,\"\nReorganization Aims\nThe creation of a separate agency, as accomplished through Reorganiza¬\ntion Plan No, 8, will foster a greater flexibility, a singleness of purpose,\nand a centralized responsibility and administration. Specifically:\n(1) The Director of the Agency will be responsible under the\nNational Security Council to the President, and to the\nCongress for the performance of the overseas information\nfunction.\n(2) Responsibility for overseas information operations will be\ncentered in one place.\n(3) A single informs-tion agency will mean one information program\nwhich, by fiscal year 1955, can be provided for through one\nappropriation,\n(4) Coordination of operations will become an intra-agency matter,\nand responsible subordinate officials will answer directly to\nthe Agency Director.\n(5) At the inter-agency level, coordination will become a matter\nof bringing together the policy concerns of the several\ninterested agencies in terms of basic policies, plans, and\nprograms for execution by the information agency.\n(6) In the field, the role of the U. S. Information Service will\nbe clearly identified as an integral part of the diplomatic\nmission, functioning at a level with the political and economic\ncomponents.\n(7) As an independent operation, the information agency will be\nin a position to establish the kinds of administrative sup¬\nport, operating methods, and procedures necessary to the\nproper execution of the fast-moving information function.\nThese will not conflict with the kinds of administrative"
}