{
  "id": "d501-18",
  "text": "Tot Mr. Thcraas Parrish\nNovember 13* 1953\n- 2 -\nThe tapes received introduce several problems!\n1* Length. One cause for very strong complaints by member stations\nis programs which do not conform to standard lengths (14$30$\n29*30$ etc.) and series the programs of which deviate from the\nstandard length established for the series.\nThe Series in Literature programs vary from seven to thirty-two\nminutes. Could not programs fil (T. Nashe) and #2 (Book of Job)\nbe combined to make a sing&e half hour program? Programs #3\n(John Bonne) and #4 (Thomas Browne)?\n2. Programming. Network stations expect complete \"package\" programs\nfrom their headquarters* Unfortunately none of the programs which\nwe have received are complete. With two exceptions (\"The Hour\nGlass\" by Yeats and \"Samson Agonictas\" by Milton) them none of the\nprograms has opening announcements. As the functions of the net¬\nwork were discussed at the recent Oklahoma Conference, openers* closers\nand editing can not be done here If we are not to neglect the specific\nfunctions we have been directed to do* More and more, we hwve been\nreminded, we are a distribution center, rather than a production or\nediting agency. Studio or Station*\n3« Network scheduling. We had hoped to distribute at least two,\nperhaps more, reels of Chicago-FAE material each week, for broad¬\ncast beginning the first full week in January (our next general\nrelease of programs). This will entail our knowing definitely\nby Wednesday, November 18, exactly what we will be able to schedule\nfor at least tho first thirteen weeks of the new year* (For instance?\n^>r the first nine weeks, followed by\nVadLteg at Work .which might, incidentally, combine Conrad and Fitz¬\ngerald programs. First three weeks, M2\nweeks four through seven.What is Modem Poetrvsveeks eight through\neleven IJmt We Laugh Atg weeks twelve through fifteen, Scene American\nIlorfthloss etc. This is an impromptu listing, intended only to be\nsuggestive.) Ve will need the completed tapes for the first week*3\nrelease of programs by November 30 at the latest* The foil wing\nweeks* releases should follow week by week, sooner if at all possible*\nCan you complete the programs on the schedule noted above? If not, we can\neither release the programs as they are, with probable very low acceptance, or\nwe ©an delay their release two or three weeks in order that they may be complete.\nNeither of which we wish to do—-and we may not be able to delay release* Ve\nwould like to have at least one series to releases the quarter-hour series on\n'■tae AaerlcaiLleagBage sounds like a likely prospect."
}