{
  "id": "d501-184",
  "text": "-10-\nIn 1947, this residual effort was reduced to little more than a stand-by\noperation.\nWith American military control established in Germany, Austria and\nJapan, extensive information programs were carried on in those countries\nunder the supervision of the Armed Forces. Successively, these functions\nwere transferred to the Department of State, but under appropriations\nseparate from those of the Office of International Information and Cultural\nAffairs. The Japanese public affairs program was later incorporated into\nthe appropriation for International Information and Educational Activities,\nwhile\" the German-Austrian Programs were continued under separate appropria¬\ntions.\nSince 1947, the fact of Soviet design, the advances of international\ncommunism, the severe political-economic-social strains of postwar re¬\nadjustments, the emergency of many new nations from former colonial status-\nall these and other factors have had a direct impact upon the organizational\nstructure of the Departments concerned with international affairs, such as\nState and Defense. These developments have resulted in the creation of new\nagencies, such as the Central Intelligence Agency, and successively the\nEconomic Cooperation Agency, the Mutual Security Agency, and the Foreign\nOperations Administration. In the case of ECA and carried over into ISA,\nlarge-scale related information operations were authorized. And within the\nDepartment of State, the Technical Cooperation Administration was created\nwith certain overseas information activities attached to it.\nThe United States Information and Educational Exchange Act was passed\nin early 1948. The Office of International Information and Cultural Affairs\nin State underwent a series of changes in structure and purpose, leading to\nthe basic 1949 reorganization under the Hoover Plan. At the beginning of\n1952, a further major change resulted in the establishment of the Inter¬\nnational Information Administration within the Department of State, with a^\nsemi-autonomous status comparable to the Technical Cooperation Administration.\nEach of these organizational changes in the foreign information\nprogram since 1947 has been in response to needs growing out of the\ninternational situation. Each has led further toward the concept of\nintegrated operations within a single and separate agency. Reorganization\nPlan°No. 8, creating the U. S. Information Agency, thus was the end product\nof operating experiences accumulated since 1940 in situations ranging from\nwartime to peacetime to present tensions.\nOffice of Information\nEEpublic 7-8340\nExt. 2796 - 2611"
}