{
  "id": "d501-192",
  "text": "Radio Program Planning—2.\nThis ccncexnsd arses for which granis-in-aid might be giver, the thought being to\nstrive for soma unity and direction out of the rather heterogeneous grant pro¬\nposals* Six general program areas ns re listed—-Hoots of* American Culture, The Good\nLiifp, The Great Ideas3 America and the World, ThaTStite ~aP the World, and Trie\nEight T^^r'LiTetliDo. BewFiI\"Ho2e‘a~more specTEEc subjecrt^areas with no over-all\npattern were~<&scueS®d briefly. AH of these ideas were ccnsidsred in the final\ndecision recommending a distinctive series.\nSkomia offered as background the following info 3m alien on the grants-in-aid\nprogram:\n19$?., the first year, 9 grants wore mad©5 h good series resulted\n1953* eeccnd year, 8 grants produced 3 good seri.es\n19$h» third year, 9 grants were made5 all series fairly good to excellent\n1955, fourth year, 9 grafts, with results yet to come in\nSkomia concluded with some comments from John Holt3 to wit, a recommenda¬\ntion for a unified objective to integrate the work of the Progran Planning,\nAcceptance, and Grants Conmdtteos. H@ thought perhaps a Lia#ieoa Committee\nmight be necessary, with representation of the three mentioned groups, as wgH\nas a member frem tbs School, Engineering, International, and Fublie Halations\nCommittees* Holt also stated that tbs offering for th© Winter of 1956 will\namount to 8§ hours per weds of non-school programming. This in elides only three\nseries from MSB members for which no grants were given. Holt points out, via\nSkomia, that th© only open area of programming is material submitted by member\nstations from their om resources* We can use more of this material apparently,\nwhereby the giant 3-in-aid programs and outside sources are pretty m 11 explored.\nSkomia proposes that the separate in-school package be dropped, and ihsfc a\nsingle general package be offered up to 15 hours per week with members selecting\nabout 10 hours of nateriaX best suited to their needs* In-school programs would\nbe included, a? course, as part of the general, package.\nThe above material served th© committee well as background, and in the\nsection on comments, I will giv© the committee1 s views on sane of th© ideas*\nmooim IDEAS\nfollowing ar© the specific program series ideas which wore discussed at\nlength by th® Sub-Ccamittoeu\nSkomia presented in detail a proposal prepared in November, 1953 cn Geron¬\ntology* The plan was for 13 half hour programs with top professional production\non a budget of somethin like $125,COO. This proposal was used extensively in\nour final work on tils series*\nSkomia submitted an idea that had can© to him on a scries called The hiving\nDocument which would utilize the almost unending resources of the nation^sH’*’’”*\"’\nmuseums, libraries, universities, government archives, aid many other units to\nproduce a continuous aid progressive' development of history. Subjects would\ninclude such things as folklore, transportation, Lincolnian a, natural resources,\nand researdi would b© done cn one subject in all of it!® available places to\nfairly well exhaust the subject. Various series, of course, could be produced\nover a period of 10 to 20 years or longer. Tj*e first series budget was es¬\ntimated at $95,000.\nSkomia reported on an Mo a called roughly Industrialization in America,\nwhich would explore what democratic capitalism meins tolls and wouH attempt"
}