{
  "id": "d501-207",
  "text": "THE UNIVERSITY OF TENNESSEE\nDIVISION OF UNIVERSITY EXTENSION\nBOX 8540. UNIVERSITY STATION\nKNOXVILLE\nJanuary 10, 1966\nCOPY\nMr, Paul Street\nNational Education Association\n1201 Sixteenth Stract, N. W.\nWashington, D, C,\nDear Mr, Street*\nI was pleased to talk with you on the telephone the other day, and\ngratified at your obvious deep interest in doing a series for the NAEB.\nAfter oheoking several sources, however, I find that it does not seem\nadvisable for me to visit Washington this month or next for a session\nwith you.\nIn the first plaoe, I must say that the NAEB Program Planning Com¬\nmittee has not shown enough interest thus far to warrant going into the\nmatter too deeply just yet, I personally feel, as I told you, that we\nshould have a series in 1957 on the NEA and the theme of your Centennial,\nand I think the Committee will go along with that. But during the next\nthree months, we will be entirely engrossed in trying to promote a series\non industrialisation in America with the Educational Television and Radio\nCenter. May I suggest, then, that perhaps we can get together in the\nmiddle of March or early April when the press of work will be lessened?\nI realise that you and Dr. F&rley want to plan many months ahead and\nmust, indeed, do this in order to get your job done, so I hope this\nthree month delay will not be fatal. I might suggest that if Frank\nSchooley or Dr. Harry Skomia should be in Washington on other business,\nyou might be able to talk with either or both of them about this before\nwe go over it in more detail, I will send them a copy of this letter\nwith a note giving the background, hoping that one of them will contact\nyou if occasion takes them to Washington before March.\nI hope your proposal that I come to Washington will still be active\nin mid-March, since I would very much like to come. Thank you again for\ncalling me.\nSincerely,\nKenneth D. Wright\nDirector of Broadoasting\nKDWjes\nco* Frank Schooley\nDr. Harry Skomia"
}