{
  "id": "d501-211",
  "text": "PRESENT TRENDS IN RADIO PROGRAMMING AND THEIR PORTENT\nby Northrop Dawson, KUOM, University of Minnesota\nIf you’ve been following the trade journals in the past year or so, you’re probably\nnoticed a surprising trend. Radio, which many expected would take a back seat with\nthe advent of Television, appears to be booming.\nA lead article in Broadcasting Magazine last August reported a survey by Radio-\nElectronics TV Manufacturers Association, showing that....\n1) In the Tj* years since World War II, U.S. radio production passed\n110 million sets-mere than the number manufactured in the preceding\n21 years.\n2) And for each of the past 9 months, production of radios has topped\nthat of the same month the year before-and has doubled the output\nof TV sets.\nIn June, John Blair and Company-a national station representative organization\n-published the result of a survey they made in 12 major cities-all of which\nwere mature television markets-where TV was well established.\nThey survey knocked the spots out of the earlier prediction that, once television\nbecame established, radio would be pretty much a daytime-only medium. The Blair\nstudy revealed that more people were listening to their radios between 6 and 9 at\nnight than were listening between 6 and 9 in the morning.\nLast week Variety reported that New York City radio stations are piling up their\nbiggest revenues in years, with waiting lists for class ”A\" time. So let’s label\nthis ’’Trend Number One\"-it looks as though radio is here to stay, possible even\nbigger And better than ever. We need no longer be afraid that television is going\nto put radio comparatively out of business.\nit*####*#*##\nNow for \"Trend Number Two\"-and this one is even more to the point. Have you been\nlistening to network radio lately? To be sure, there’s still a lot of the same old\nstuff Ma Perkins is still perking, Life Can Still Be Beautiful, and Carleton\nMorse even has a soap opera at night now....\nBut as I listen at random, I’m more and more frequently surprised at what I hear...\nFor example, there’s an ABC network series called \"Heritage\"-a program which\ntraces the development of Western civiliztion since the Renaissance. Another ABC\nseries last summer featured contemporary poets reading and interpreting their\npoetry. Have you heard CBS series with the deceiving name of \"Crime Classics\"?\nGranted, it deals with crime, but take a listen sometime. You might hear, for in¬\nstance, the story of how Nero attempted to kill his mother, Agrippina, told with\nmature, subtle dialogue, top drawer production, elegant performance, and a lot of\nfascinating and accurate historical detail.\nIn short, \"Trend Number Two.\" It’s becoming increasingly evident that the network\nradio boys are raising their sights. There is a very evident trend toward better\nquality, higher standards, and more interest in what you could loosely call \"educa¬\ntional and cultural\" radio material than there's been since the days when CBS, thanks\nto Bob Hudson, was regularly broadcasting educational and cultural programs of a\nhigh order.\nit it it % a a n it it a"
}