{
  "id": "d501-37",
  "text": "I\n0\np\nY\nTHE WHITE HOUSE\nWashington\nDecember 11, 1953\nDear Governorj\nThe mounting toll of death and injury on our highways long ago reached a\npoint of deep concern to all of us. It stands before America as a great\nchallenge — humanitarian and economic — and must be met by urgent action,\nI have examined the nAction Program for Highway Safety” which you and the\nother Governors have developed in cooperation with interested organizations\nand public officials having Jurisdiction over highway safety. It is a sound\nand workable program, but effective citizen leadership is needed to help you\nput this great crusade into organized action on a scale far bigger than ever\nbefore.\nAccordingly, I have called a Conference on Highway Safety for Washington next\nFebruary seventeenth, eighteenth and nineteenth. The Conference will serve\nto focus more public attention on the problem and stimulate active leader¬\nship in every community.\nI should appreciate your designating an appropriate group of your outstanding\ncitizens as a delegation to represent your state. Since the Conference pro¬\ngram will be built around seven basic groups — labor, agriculture, business,\nwomen, public officials, media of public information and other organizations\n(service, fraternal, religious, veterans, etc.), I would hope that your dele¬\ngation will include representatives from each of these categories.\nWill you please forward the names of your state's delegates to the Conference\non Highway Safety, Room 1107, General Services Building, Washington 25, D, C.\nSecretary of Commerce Weeks, General Chairman, will send you detailed back¬\nground information on the Conference shortly.\nNaturally, we would be happy to have present all Governors whose schedules\nand responsibilities would permit attendance. At any rate, I am depending\non your active cooperation and support to make this Conference most effective.\nSincerely,\n/s/ Dwight D. Eisenhower\nThe Honorable Robert B. Crosby\nGovernor of Nebraska\nLincoln\nNebraska"
}