{
  "id": "d501-49",
  "text": "DARTMOUTH COLLEGE\n! • department of \"Philosophy \\ •\nHANOVER • NEW HAMPSHIRE\nBOX 724\nRECEIVED\nNAEB HEADQUARTERS\nFEB 17 1954\nl\nMy dear Doctor Skornia:\nMr. Siegel of station WHYC advised me to write to\nyou. I had written him concerning the HAEB and the\npossibility of our contributing to its programs.\nI am presently engaged here at Dartmouth in a\nproject centered around the work of Bugen Rosenstock-\nHuessy, professor of social philosophy. Part of\nthe work is the preparation of LP records and tapes\nbased on the lectures he gives in class, i.e. rough\nrecordings are made in class)as Erofessor Huessy\nspeaks extemporaneously^ and then from these he\nrecords a corrected copy. The idea is to have (1)\na permanent record of his class work, (2) a selected\ngroup of recordings suitable for outside groups and\nindividuals, (3) stenographic transcript for use as\nfirst draft on two contemplated books.\nProfessor Huessy when he first came to this country\nwent to Harvard where he gave a series of the Lowell\nLectures- which have subsequently become his book,\n\"The Multiformity of Man\". We are planning to record\nin part a new \"edition\" of these lectures as they were\ngiven almost twenty years ago and there are many new\nthings to be added. We are in the process of making\na recording which will include an \"Introduction to the\nPhilosophy of History\" and \"Teaching & Learning, the\nunderstanding of two generations.\" We have just\ncompleted a two and one-half hour recording entitled,\n\"Make Bold to be Ashamed, on freedom, growth and\nself-Knowledge\" which is available on both tapes and\nLP records. (see enclosure)\nThis project is conducted with the consent of the\ncollege but it is completely a private venture in that\nI am financing the whole program myself because.as a\nstudent of Professor Huessy's some years ago.I felt\nthat what he said should be saved and preserved for\nothers outside Dartmouth to hear* Mr. Siegel indicated\nthat our participation in your program would be welcomed\nif feasible. I hope that these lectures may interest\nyou and that I may have the pleasure of your reply.\nRussell Keep"
}