{
  "id": "d501-5",
  "text": "RECEIVE©\nRADIO STATION\nJUL 31 '8 35 All 1953\nJuly 29, 1953\nWILL & W1UQ ;\nl^lVlXSlTY er »UiU.MS •\nMEMORANDUM TO; NAEB EXECUTIVE COMMITTEE\nNAEB ADULT EDUCATION COMMITTEE\nSUBJECT; CONVERSATION WITH MR. GLEN BURCH OF THE FUND FOR ADULT\nEDUCATION PASADENA STAFF IN CHARGE OF DISCUSSION PROJECT\nIn a pleasant one-hour conversation Kith Mr. Glen Burch\ntoday, I learned some items of interest;\n(1) The San Bernadino discussion group*s use of the ”Ways\nof Mankind” series has been phenomenally successful.\n(2) Mr. Burch has been talking with Professor Dumas\nMalone about the possibility of building an adult discussion\ngroup around the \"Jeffersonian Heritage” series. I encouraged\nMr. Burch in this undertaking. He agrees with me that it\nwould be a good idea to have Mr. Malone select some additional\nsupplementary readings from Jefferson, Adams, and Hamilton,\nand develop a series of about ten sessions in this Jefferson\ndiscussion project. I think this is a most important further\nuse of our radio series on American history.\n(3) Mr. Burches report on the use of the USSR series in\nadult education work is that the materials are so horrendously\nheavy and overpowering in their indictment of the USSR system\nthat it is very difficult to organize and conduct a satis¬\nfactory discussion around them. The tone of the radio programs\nis one that results in a feeling of pessimism and depression\nin the people who hear them, as they see what the tactics and\nnature of the USSR system is. Mr. Burch is very much in favor\nof further radio programs about the USSR and an effort to\nachieve some programs that will be more successful in provoking\ngroup discussion and thought about Russian civilization. I\nthink we have learned a good deal about the problems of pre¬\nsenting radio programs on Russia, and I think that, using this\nexperience, we ought to try to go ahead to create a series\nthat has greater audience effectiveness than the one we have\nthus far produced.\nSincerely yours,\nGeorge E. Protest, Chairman\nAdult Education Committee, NAEB"
}