{
  "id": "d501-60",
  "text": "- 2 -\nRadio and Television Committee\n1. The radio and television broadcasters here convened enthusiastically\naccept President Eisenhower's challenge to undertake an action program o\nbring about a new sense of public responsibility for, and interest * ,\nreduction of highway accidents, and do pledge their fuU support to local,\nregional and national efforts to accomplish the aims projected by the 195h\nTvtfhite House Conference on Hi^iway Safety.\n2, To secure maximum efficiency with resulting positive action,\nthe radio and television broadcasters will undertake to fully coordinate\ntheir local efforts in behalf of hi^iway safety promotion with all local\nand national safety agencies, both public and private, and with all media\nso that public information will focus in a united fashion on critical\nneeds.\nsound enforcement procedures, in good engineering practices.affecting t e\npublic highway, and in spreading understanding, of proven scientific equip¬\nment designed to protect life and property moving m traffic.\n), The radio and television broadcasters recognize a need for more\nreaiism in broadcfs? \"ntinuity and visual presentations dealing with safety\non the highway, and to this end there will be greater emphasis on presenting\nactual accident detail, and less generalization of a broad education nature.\nr In order that the individual radio and television stations can\nthe best results from operations pertaining to highway safety\n?J .^ ct!^ons and in relation to interested groups, every broadcast\nmanager in the country will be asked to name an informed and interested\nSer of his sta« as \"contact man\" for all highway safety matters.\n6. Recognizing that public confidence has already teen established\n. a-r, own television urograms and personalities now on the air, the\nge sir\nbring maximum exposure to listeners and viewers in a setting readily\nunderstandable to them®\n7. .. . “srLss\"\n.°r8r“.w“»r* r\n£ill be set up for radio and television broadcasters by theNational\n. • on of Radio and Television Broadcasters. Broadcasters m all\nparts of the countiy will be invited to interchange their experience through\nthis facility."
}