{
  "id": "d501-63",
  "text": "- 5 -\n10. Reconmend that kits of material, including accident and\nsafety pictures or mats, be supplied the weekly press for illustration\nof good driving and other highway safety practices.\n11. Recommend that legislation be sponsored requiring that\nconvictions in traffic law violations be reported to the newspapers.\n12. Encourage the teaching of safety in schools from the first\ngrade through high school.\n13. Encourage courtesy in drivers and pedestrians.\nlU. Sponsor programs to give recognition to courteous safe drivers\nand to towns and counties with gpod safety records.\n15* Work toward securing adoption by towns and States of the\nUniform Vehicle Code and Model Traffic Ordinance and the use of uniform\nsigns and signals.\n16. Encourage the conduct of mandatory safety classes for\nyouthful traffic law violators.\n17. Explore the idea of promoting individual safety pledges and\ndisplay of safe driving emblems.\nRespectfully submitted, H. V. WELLS, JR., Chairman\nMagazine Committee\nMagazine editors in attendance expressed full support of CRUSAEE\nFOR SAFETY, and urged that a full but concise section in the proposed\npromotional brochure or booklet be devoted to Magazines and their impor¬\ntance to the Crusade, with stimulating suggestions as to the infinite\neditorial variety in this subject and how they may get help in developing\nmaterial from it.\nEvery editor, it was recognized, will campaign with his own\nreadership in mind. But to prove to an editor that there is lively and\ninteresting material in the Safety subject indicates a need for help from\nsuch organizations as the National Safety Council, AAA, Automotive Safety\nFoundation, etc.\nEditors would be helped by closer contact with these agencies and\nexperts in the problem; it is recommended that magazine editors request\n(if they are not now getting it) the full reports from these agencies,\nscan them thoroughly, then indicate to the public relations men of the\nagencies the sort of special category of the problem that interests them."
}