{
  "id": "d501-64",
  "text": "- 6 -\nTIP SHEET; Hope was expressed that these organizations, or some\ncentral public relations group working for them, give more thought to\nMagazines and the kind of stories they use—not magazines as a whole but\nspecific ones, with specific approaches to the problem.\nOnce this is established between an editor and a P.R. man, the\nlatter should be able to fbrnish an editor with tips on news events,\npersonalities and developments in the Safety field which, with a little\nimagination, could be made the basis for articles.\nThat calls for more magazine consciousness on the part of the various\nsafety organizations—the ability to smell a magazine piece in.some person\nor event, and the time taken to call an editor’s attention to it.\nON THE EDITORS’ PART: The following points for action were suggested:\nIt was urged that every magazine editor carefully study any list of sources\n(such as the Safety organizations) for agencies whom he can contact or even\nmake a liaison with for story material.\nCall his staff together immediately and discuss the particular angles\nof the traffic problem that best lend themselves to exciting and instructive\ninterest to his readers.\nThen lay out a year’s program for varied but regular articles dealing\nwith phases of the problem. Make it one of the ”musts’’ in his editorial\nprogram for the year that a given and specific amount of space be devoted\nto the subject.\nBut above all, and first of all, give the subject enough thought\nhimself to prove to his own satisfaction that a rich mine of material lies\nvirtually untapped—and all he needs to do is go after itl\nAssign a staffer or alert free-lancer to the interest he has in this\ntype of material, and count upon this person or these persons to become\nexperts in the field.\nPresent as much as possible the positive view—playing the success\nor achievement angles, with plenty of ”How you can do it too” emphasis.\nUse strongly the ”you’» approach in order to bring articles, of\nwhatever kind or slant, directly home to the reader.\nRemember that there are sound sources not only for story material,\nbut the countiy’s best experts available to check same for factual statements\nDiscover what are the salients the experts have agreed upon as most\nimportant in this Crusade, and exercise his imagination in developing\narticles around them."
}