{
  "id": "d501-8",
  "text": "3\n■to have a series on what has happened to the American Indian and do\nfield recordings from different reservations here and in Alaska,\nForeign English-speaking colonies could also be included.\n2. Illustrations of aspects of our own culture. It might be\npossible to show the meaning of rituals and institutions of modern\nAmerica* Contrariwise, it might also be interesting to get at the spe¬\ncial values and attitudes of occupational groups in America. (This\ngets over into sociology.)\n3. The anthropologist at work. Follow various types of anthro¬\npologists—the archeologist, the physical anthropologist, the ethnolo¬\ngist—into the field situation in dramatic form. One should here show\nMm going from background data, to idea about the material, to special\ninvestigation. That is, here too you should concentrate on the ideas\nof anthropology and their modes of solution rather than merely be con¬\ncerned with how the anthropologist works.\n4. Problems of underdeveloped areas. My investigations of lasu\nstammer showed that it was not possible to dramatize the function of the\nanthropologist in solving world problems. I do believe, however, xc\nwould be possible to demonstrate the cultural involvement of such prob¬\nlems in underdeveloped areas. You might here be interested in illustra¬\nting some of the problems raised in the 1951 Merman Wait Harris Founda¬\ntion lectures. Bert Hoselitz edited the volume. This would be a rather\nexpansive and involved program because it would require a specialist 1or\neach separate country involved* and very likely travel to that country.\nIt would, however, be a most useful thing to do, and I believe advisable.\nThere are some anthropologists in the State Department who would be vail¬\ning and able to work with you.\n5. The story of man. It might be possible to do in radio form\nsomething of th® kind that George Stewart did in ”Man, an Autobiography.*\nIt would be possible to present data of man’s biological development\nand cultural history. But a warning here: don’t try to dramatise the\nlife of the Neanderthalese; that way lies headaches.\n6. The repetitive treatment of any of the topics included in\nthe basic memoranda. I am thinking, of course, of the model supplied ^\nby the subseries on Lav/ and Justice. You could readily do a whole series\neach on family life, food getting, cooperation and work, religious be¬\nlief and ritual, social and political organization.\nYou might find it advisable to be entirely experimental in your\naooroach, with new formats and the like. There were good suggestions\nearly in the planning of the project of having field recordings, aca¬\ndemic discussions, and the like. It might even be possible to do a\nshow after the fashion of t?What in the World?” but give it some meaning!\nA 10 or 15 minute dramatization of some aspect of a primitive culture\nmight be followed by a discussion by two or three anthropologists as to\nthe meaning and involvement of the activities illustrated. In a way,\nssStand-in for a Murderer” offers a model for this—but with several"
}