{
  "id": "d501-87",
  "text": "mi mnmmzn m mmm\n19 mrm umtm ?rmm\nSh% John ft. Eirfc\n^341 S.\nChicago 15, Illinois\nCHICAGO 3,\nlb*, John U>lt 28 Ksy, 19%\ngo Work Manager\nMetionsl Association of MmmttmaX Breedens tore\n14 Gregory BaH\nUniversity of Illinois\nUrbana* Illinois\nDost Mr# Haiti\nXt was a pleasers to neet you on 7 May during cy brief departure IV«w the\nseating* of the iiasrloftii Philosophies! Association convening there. sines\nay return to Cta&vgo X have given thought to the \"Philosophy Series* which\nmi discussed, and this lottor concerns those thoughts so they haw no*?\ncrystallised.\nPhilosophy eon. ho eomsdlr gly dull# So can history# And the dullness is not\ninfrequently compounded in tho history of philosophy# Still, msm sort of\nchronology loads dress or story-quality to & subject that eight otherwise\nprove fersldahily abstract*\nI tees sought* therefore* to avoid the Seylla of abstraction ard the Chsryhdls\nof historicity hr choosing s theue which has been of continuing interest since\nthe hsgiimings of pfdloeaply, Basely, the search for certeiaty* Hie theme\nhas psychological undsrtorMs-^nd even of s Fraudiar- Uni* to these X shell five\nonly passing allusion* Xh the mr text of phiXesepiy, however* the theme lies\nin that branch vith the jmiMaesking label ’cplsteMology* or ’ theory of\nknowledge1* Xt touches m such questions set How do we knew what we fc owf\nHow is knowledge possible? X plan to follow this important strand of\nphilosophising free Heraclitus in Ancient Greece to faamp and ~\nof oontemporary America, visiting* on the way* such notables as Benoeritus*\nLeueipims* Plato, Bacon* Galileo, Hew ten, mine, and Kant.\nX realise that m are not yet in that stage where you mn reader a fir*\nooenitmsnt* hut X would greatly appreciate it were you to glares at the\ninclosed list of proposed programs and tell ne whether they look attractive\nenough for your purposes to warrant the tie© and energy that X oust expend\nto polish then to your own very high standards*\nPlease eenvuy ay kindest regards to Hr* Sfceeui* m\nwish for yomalf and your important work*\nlour kind letter of this date just Sincerely yours,\narrived, end X thank jm for its /g/ John K* Risk\ncontents. Is the Inclosed outline John ft. Kirk\nof one envisaged series in\nsufficient dffteHf\nW*M*"
}