{
  "id": "d501-90",
  "text": "Proposal for an\ngHasaiftuaL JEsaasrafl\nThe purposes of the proposed committee arei\nTo giro the various committees whose functions pertain to the MSB\nNetwork opportunity to better coordinate those functions.\nTo do long range Network planning, make recommendation# for the\nadvancement of Network service, give over-all direction to the Network oper¬\nation, give adviee and assistanee to the Network Headquarters*\n(In short, this committee win be a policy, coordination, and advisory groups\na steering cosndttee. It is not intended to supplant or usurp the functions\nof any other committee, nor does It reduce the status or role of any other\ncommittee*)\nasHfltofflL.\nThe conaittee will consist of one appointed chairman plus five or six\nmembers.\nThe Itobers will be the chairmen of those committees whose work bears\ndirectly on the Istwork project* At present these committees are the Network\nAcceptance, In-School Program, Radio Program Planning, International Relations,\nPublic Relations, and Engineering Committees,\nThese members are to understand that they are not appointed as ^personal!-\nties*| they automatically become members of the NASI Network (Operations?)\nCommittee by virtue of being chairmen of the cosoittees listed above* Should\na member leave his chairmanship, his successor will automatically replace him\nas a member of the MA1B Network (Operation*) Committee*\nShould the work of other committees (eg* Qrant-in-Aid, TV Program Planning,\netc*) come to bear on the Network operation, their chairmen will become members\nof the MSB Network (Operations?) Committee. Whether or not such e ooaadt tee's\nwork justifies itv chairman's membership in the proposed committee will be\ndetermined cooperatively by the president of the MSB, the chairman of the NAEB\nNetwork Committee, and the MSB Headquarters of floe*\nThe Chairman of the NABB Network Committee will not be the chairman nor\na member of any committee whose chairman Is automatically a member of the\nproposed committee* He will be the only member of this committee who is\ndirectly appointed by the preside nt of the MSB, rather than assuming his\nposition by virtue of another appointment *"
}