{
  "id": "d1855-3",
  "text": "NAEB NE..S LETTER\nPage 4\nMay 15, 1942\n1RNA DISBANDS\nINDEPENDENT *<AD I 0 NETWORK AFF 8 L 8 ATES • . . . A GROUP OF INDEPENDENTLY\nCWVED RADIO STATION USING NETWORK SERVICE» ..VOTED MAY 11 TO DIS¬\nSOLVE ITS ORGANIZATION* It ADOPTED A RESOLUTION SAYING THAT IT\nBELIEVED IT HAD SERVED THE PURPOSE FOR WHICH IT WAS CREATED* Sa«D\nTHE statement; “The time has come for FRACTIONAL organizations in\nTHE BROADCASTING INDUSTRY TO TERMINATE FOR THE SAKE OF UN»TY AND\nTO STRENGTHEN THE ONE ORGANIZATION, THE NA8, WHICH SHOULD ACT FOR\nALL BROADCASTERS•” THE MEETING WAS HELD IN CONJUNCTION WITH THE\nANNUAL CONVENTION OF THE NAB IN CLEVELAND.\nWNVC TO PRESENT A “CORWIN CYCLE”\nFor THE FIRST TIME IN THE HISTORY OF RADIO, THE WORK OF ONE RADIO\nWRITER WILL BE REVIVED IN A SPECIAL SERIES. THE WRITER IS NORMAN\nCorwin, and the series, to be presented over WNYC, will se called\n“Corwin Cycle.” It will be heard on Wednesday evenings with Mitchell\nGrayson as director*\nThe programs to be revsed include scripts that were written as early\nas 1934 and come down the present day. They were chosen by Corwin\nhimself as the most representative of his works. Included in the\n“anthology” of programs will be \"The Odyssey of -(umyon Joines”, “They\nFly Through the Air With the Greatest of Ease”, “Descent of the\nGods” and many others. As far as possible, the actors who created\nthe rules will play them in revivals.\n“HANDS ACROSS TIVORIES” ON KWSC\nUsing his nationally known patriotic ballad, \"Song of Allegiance,”\nas a theme song, Russell Danburg, pianist-composer, presents a\nweekly half-hour program over K'/jSC, the radio service of the State\nCollege of Washington, according to station director Kenneth Yeend,\nthe feature is produced for the special benefit of Air Force Signal\nCorps troops stationed on the campus. Mr. Danburg, a member of the\nfaculty of the School of Music and Fine Arts, is assisted by Max\nAgather, a KftSC staff announcer.\n“riANDS ACROSS THE IvORIES,” AS THE PROGRAM IS TITLED, IS BOTH EDUCA¬\nTIONAL AND HIGHLY ENTERTAINING. EACH WEEK A DIFFERENT GUEST FROM\nAMONG THE TALENTED MUSICIANS IN THE ARMY GROUP IS INVITED TO APPEAR.\nVocalists, an accordsanist, a harmonica player, pianists and others\nHAVE BEEN FEATURED. In ADDITION TO THE ENTERTAINMENT FURNISHED BY\nTHE GUEST ARTIST, SviR. DANBURG PLAYS A NUMBER OF SELECTIONS DURING\nEACH PROGRAM, SOME OF WHICH ARE ORIGINAL COMPOSITIONS.\nCm.il SS10\\ RELAXES RULE 3.71\nIn KEEPING WITH ITS POLICY TO RELAX BROADCAST OPERATING RULES '\"HERE\nDEMANDS OP* THE WAR REQUIRE, THE COMMISSION TODAY ADOPTED A GENERA..\nOrder which waives Section 3.71 on minimum operating schedules."
}