{
  "id": "d1270-0",
  "text": "N-A-E-B NEWS - LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nEdited by Richard B. Hull, President\nStation WOI, Iowa State College, Ames, Iowa\nJUKE 30T 1948\n\"CONSCIENCE OF THE BROADCASTING INDUSTRY—CLIFFORD J. DUBR”\nOne of the most controversial, conscientious, and forthright figures in American\npublic life left officialdom on June 30th when Commissioner Clifford J. Durr,\nretired from the Federal Communications Commission. Guided by a tough and\nbrilliant mind and illuminated by conscience and a sense of duty which knew no\ncompromise, Durr has left a record of public service and principle which few\nhave courage or the capability to duplicate*\nClifford Durr assumed his duties with the FCC, equipped with a tough and vital\nphilosophy rooted in a literal interpretation of the Bill of Rights and founded\nin a liberal faith born in the 19tfr century, maintained with difficulty in the\ntechnology of the twentieth. A casual knowledge of the difficulties and pro¬\nblems of a particular branch of that technology—radio broadcasting—quickly\nbecame for this Commissioner a comprehensive knowledge. And that knowledge—\nand its application gave American radio a system of principles and policies,\nwhich despite outraged protests and bitter objections--sometimes honest, often\ncalculated—remain a basically unassailable ethic in this age of communications*\nIn a very real sense Clifford J. Durr gave radio back to the people who own it—\nthe citizens of the U.S.— and he pointed out the way—through the \"Blue Book\"\nfor U. S. Radio operators to maintain the freedom and the independence which\nthey so loudly claim—and so often forfeit*\nHIGHLIGHTS IN THIS ISSUE\nDEWEY QUESTIONED ON RADIO... 2\nSTRAT0VISI0N—A SUCCESS. 2\nHENNCCK APPROVED FOR FCC..... 3\nMICHIGAN U.—TV REPORT....... 4\nCOI SPEECH AT CINCINNATI. 7\nCOLUMBIA HAS NEW PLATTER.10\nPOLITICAL BDCST STUDY—OSU.... 11\nFCC EDUCATIONAL ACTIONS.13\nLOW-COST FM A REALITY....17\nMICHIGAN STATE—TV REPORT.18\nN-A-E-B SALUTES 25TH ANNIVERSARY CF NEW YORK’S VJNYC\nCulminating a quarter-century of non-commercial, public service broadcasting\none of the most unique and successful broadcasting operations in the U.S. .\nmarks its 25th anniversary on July 8th. Key unit in the New York City Muni¬\ncipal Broadcasting System, N-A-E-B station WNYC, under the direction of Seymour\nSiegel, will receive special tributes from all over the U.S. and from many\nmember nations of the United Nations.\nMayor O’Dwyer and other city officials will take part in a day-long celebration\nheralded by tributes from all N.Y. stations, from the BBC, the United Nations\nat Lake Success, and from friends and well-wishers the world over.\nVice-President\nJohn Dunn\nWNAD, University of Oklahoma\nNorman, Oklahoma\nTreasurer\nW. I. Griffith\nWOI\nAmes, Iowa\nExecutive Secretary Executive Committee\nM. S. Novik Seymour Siegal, WNYC, New York Graydon Ausmus, WUOA-FM, Alabama\n30 Rockefeller Plaza Carl Menzer, WSUI, Iowa Ralph Steetle, WLSO-FM, Louisiana\nNew York, N. Y. Frank E. Schooley, WILL, Illinois William Seneh, KUSC-FM, California"
}