{
  "id": "d1270-1",
  "text": "»2-\nGOVERNOR DEWEY QBE6TIQNNED ON RADIO REGULATION\n(Radio Daily-June 28) \"Reasonable regulation\" is the role of Government in the radio\nfield* according to GOP presidential nominee, Thomas E. Dewey, He said last week\nin Philadelphia that development of FM and video \"is up to private enterprise\"\nand that they represent \"great potentials for service to the public and the stim¬\nulation of business,\"\nthe FCC\nThe New York governor has not studied /hor its practices closely, but he is con¬\nvinced that the Commission should in no case have power to \"regulate program\ncontent,\" Nor does he think Congress should legislate in any wav affecting the\nobjectiveness of news broadcasts, he told a reporter. Repeating his frequent\nstatements in the past that Government ownership of radio is repugnant to him,\nDewey said, \"Radio in this country made its greatest advance as an integral part\nof our American enterprises. The Government no more belongs in this field than\nin the field of the newspaper and the magazine.\"\nHIGH-SCHOOL GRADUATION FOR VJHOLE U.S,\nThe National Association of Secondary School Principals arranged a national high\nschool graduation for broadcast over the Mutual Broadcasting System on the\nevening of June first. Speaker was David E, Lilienthal, chairman of the Atomic\nEnergy Commission who spoke on \"Youth in the Atomic Age.\" The program originated\nfrom Gettysburg High School in Pensylvania.\nSTUDEBAKER, U. S. EDUCATION HEAD. RESIGNS\nDr. John 71. Studebaker. United States Commissioner of Education, prominent figure\nin the public forum and radicTfield, resigned from his federal duties to become\nVice-president and Chairman,of the Editorial Board of Scholastic Magazine. Resig¬\nnation becomes effective July 15th after 14 years of service. IJidely known in\nradio broadcasting for his Interest in radio and radio education Studebaker was\none of the champions of FM broadcasting for schools and universities.\nSTRATOVISION SUCCESSFULLY DEMONSTRATED IN OHIO\nJestinghouse Electrical Corporation and the Glenn L. Martin aircraft company\nmade a striking demonstration of \"stratovision\" in Zanesville, Ohio, on the\nnight of June 23. An airborne transmitter, crusing at 25,000 feet above Pitts¬\nburgh, Pa., broadcast pictures of the G.O.P. convention in Philadelphia to\nviewers up and down the East Coast and to the special viewers in Zanesville,\nOhio, stationed there for the experiment. Thirty-three newspaper men viewed the\nprogram from the Zanesville Country Clfib* The press viewing culminated three\nyears of planning and experimentation. Actual broadcast got under way at 8:55\nEDT when the plane carrying experimental station WI0KX3 on Channel 6 rebroadcast\nfrom the East Coast TV network. Pictures v/ere received with exceptional brilliance\nand clarity0\nThe experiment heralds plans of Westinghouse and Martin engineers for a coast to\ncoast \"stratovision\" network based on a basic service area of 500 miles in dia¬\nmeter. System would link New York and Hollywood which would broadcast five FM\nprograms and four TV programs in a linkage requiring only eight planes flying\nabout 400 miles apart. Addition of six planes to the \"stratovision\" network\nwould provide added coverage in the Southeast and Northwest. This coverage\nwould include 51 percent of the U. S. area and 78 percent of the U. S. population*"
}