{
  "id": "d1270-10",
  "text": "STATION POLICIES—POLITICAL & RELIGIOUS—STUDIED AT OHIO STATE\nDr. Harry B. Summers, in charge of radio division, Department of Speech at Ohio\nState University, reports completion of an extensive study of radio station\npolicies with respect to political, religious, and other controversial program\nsituations.\nLARGE STATIONS \"CONSERVATIVE\"\nLarge stations were reported as much \"tighter\" in applying policy restrictions\nthan smaller stations. Only 19% of the 50 kw stations will accept dramatized\npolitical programs as compared with 42% of the 5-kw stations. 67% of the 1-kw\nstations and 78% of the 250-watt stations. However, 96% of all stations queried\nannounced they expected to sell political broadcast time during the 1943 campaign.\nDr. Summers, formerly public service director of both NBC and ABC and pioneer\nin rural radio survey work, queried 158 full-time AM stations during the first\nweek of June, 1948* The project, undertaken by the radio division of the\nDepartment of Speech included a comprehensive sampling of 50 kw, 1 kw, and 250\nwatt stations with respect to geographical distribution, city size, etc.\nWILLING TO SELL RELIGIOUS TIME\nSixty-five percent of those queried will sell time for religious programs but\nan additional 9% qualified their \"yes11 response, and 26% refused to sell time\nfor religious programs. Sixty-four percent refused to selltime to an athesist\norganization but 13% replied “yes” to the question and 17% t>ye3tl with qualifi¬\ncations. When asked if time would be sold to a known Communist at times other\nthan a! political campaign 95^ of the stations replied nyesn. 21% llyes) with\nqualifications. 62% replied \"no\" and 9% did not answer.\n!,Neww Stations Less Liberal\nA comparison of policies of unewn and \"old” stations (\"new\" stations are those\nlicensed since the end of the war) showed surprisingly enough that the ’’new11 statior\nare somewhat less liberal in accepting paid controversial programs than the \"old\"\nstations.\nGeneral Acceptance Folicy Excludes nChurch Raffles11 & Bingo. Games\nOther portions of the study dealt, with commercial policies in general and the\nacceptability of products and sponsors in general to the stations questioned. Such\ntopics as acceptance of “telephone participation11 shows, the acceptance of mortuary\ntavern, or fortune telling, etc,, accounts were studied. Rejected with the most\nunanmity were “church raffles\", bingo games. \"hard\" liquor, palmists, and fortune\ntellers.\nKUSD DIRECTOR ELECTED TO S.D. RADIO ASSOCIATION j\nIrving R. Merrill, director of N-A-E-B station KUSD(University of South Dakota) j\nis the newly elected secretary-treasurer of the South Dakota Broadcasters Associ-j\nation. At their June 13 meeting a constitution was adopted, a state-wide radio j\nnetwork was discussed, and other plans laid for future cooperation and develop- •\nment. Association president is A. A. Fahy, manager of KABR(Aberdeen); vice- j\npresident is Robert Tmcher, manager of MAX (Yankton). ,"
}