{
  "id": "d1270-12",
  "text": "•13-\nFEDERAL COMMUNICATIONS COMMISSION\nMay 31, 1948 (Educational) June 28, 1948\n^ NEWS--APPLICATIONS—ACTIONS\nNOTICE CF FM ALLOCATION PROPOSAL GIVEN\nNotice of proposed rule -making which Y/ould amend the Revised Tentative Allocation\nPlan for Class B FM stations was given last week by the FCC. The amendment Y/ould\nadd Channel 233 to Sandusky, 0., allocate Channel 277 to Coram, N.Y.\nInterested parties of the opinion that the proposed amendment should not be\nadopted,the FCC said, may file written statements or briefs with the Commission\non or before June 28, 1948.\nTELEVISION CHANNEL HEARING IS CONTINUED\nAt a meeting of the FCC June 8, the hearing in the matter of Amendment of Section\n3.606 (table showing allocations of television channels to metropolitan districts\nin the United States) of the Commission’s Rules and Regulations v/as continued\nto June 29, 1948 at 10:00 a.m., at the Commission’s Headquarters in Washington.\nThe continuation of this hearing date resulted from the numerous notices of appears,\nance Y/hich had been filed and the fact that the Commission staff had not had\nenough time to study the statements filed v/ith notices of appearance.\nThe Commission also ordered that interested persons who wish to present testimony\nin opposition to or in support of any proposal submitted by other interested per¬\nsons on or before May 28, 1948, Y/ill be permitted to do so if notices of appear¬\nance are filed by such persons not later than the close of business on June 18,\n1948, except that no nev/ proposals will be accepted,\nSUN TABLE ADDED TO ENGINEERING STANDARDS\nThe Federal Communications Commission on May 27 issued an order, effective\nimmediately, amending Section 26 of the Standards of Good Engineering Practice\nConcerning Standard Broadcast Stations so that the reference to Mimeograph 85120\n(FCC number) is deleted and in place thereof there is inserted a table (revised\nand enlarged) containing average sunrise and sunset times.\nIt is understood that copies of this table are not available from the Commission.\nHov/ever, the table appeared in the Federal Register of Saturday, June 5, 1948,\nand v/ithin the next few Y/eeks will be available in printed form from the Superin¬\ntendent of Documents, Government Printing Office, Washington 25, D.C.\nAPPLICATIONS (AMPLITUDE MODULATION) COLLEGE, UNIVERSITY. INSTITUTIONAL\n1250 KC - CP Modification\nKPAC-Port Arthur College. Port Arthur, Tex.-Modification of construction permit\n(B3-P-5125), as modified, which authorized increase in pov/er, install nev/ trans¬\nmitter and change transmitter location) for extension of completion date.\n1030 KC - SSA Extension\nKOTBU-Baylor University, Corpus Christi, Tex.-Extension of Special Service Authori¬\nzation to operate on 1030 kc poY/er of 50 M using non-directional antenna, during\nthe hours from local sunrise at Boston, Mass,, to local sunset at Corpus Christi,\nTex., for a period not to exceed 12 months."
}