{
  "id": "d1270-3",
  "text": "TELEVISION REPORT—UNIVERSITY OF MICHIGAN\nMr. Wesley Romaine of the American University of Washington, D.C. currently\nengaged in a survey of educational television programs throughout the country,\nhas accorded top-ranking position to a University of Michigan program.\nThe Sunday evening series, broadcast over WWJ-TV at 6:15, is a public interest\nprogram intended to inform the TV audience on subjects of science or culture\nin which there is a high current interest, or a lasting educational interest.\nThe series in its present form has been made possible largely through the\ncooperation of the University of Michigan. From his findings and observations,\nMr. Romaine has stated the program is the ’’most ambitious and impressive he\nhas seen.”\nMr. Romaine has been connected with the American University educational broad¬\ncasts from the Dumont Laboratory in Washington. His present survey to obtain\nan over-all picture of this radio field is the result of the recent proposal\nof the Carnegie Foundation to provide funds for education by television along\ncertain lines.\nUniversity of Michigan faculty members appearing on the program have included:\nProfessor Ralph A. Sawyer, Dean of the Horace Rackham Graduate School; Professor\nEdward T. Vincent, Mechanical Engineering; Professor William Kynoeh, Wood\nTechnology; Professor Leslie A. White, Anthropology; Carlaton W* Angell, artist;\nProfessor Walter E. Lay, Mechanical Engineering; Colton Storm, Curator of\nManuscripts and Maps, Clements Library; Professor R, McMath, Director, McMath—\nHulbert Observatory; Wilma T. Donahue, Director, Psychological Services Bureau;\nProfessor Otto LaPorte, Physics; Professor Wilford J. Eiteman, Finance.\nSubjects televised, utilizing foregoing authorities included: (l) Peacetime\nUses of Atomic Energy; (2) Jet Propulsion; (3) Wood Technology; (4) Man's\nControl of Energy; (5) Sculptoring as an Educational Tool; (6) Automotive\nResearch for the Comfort of the Driver; (7) Original Source Americana for the\nHistorian; (8) The Sun Explodes; (9) Mechanical Aids for the Blind; (10) Rela¬\ntivity; (11) Money.\nEvery possible angle of showmanship and visual aid is utilized on the one-\nhour program to clarify the subject to the listener. In addition to these\ninterview and roundtable programs, the University presents occasional dramatic\nshows featuring students in broadcasting classes.\nWWJ-TV officials state that the excellent response to the program warrants\nrepetition of certain of t he broadcasts. These University of Michigan programs\nmay be picked up by over 6000 television sets in the Detroit area and well\nover 150 in Ann Arbor. The continuously increasing number of sets in the area,\nhowever, will make it worthwhile to rebroadcast talks on subjects of keen\ncurrent interest.\n... Waldo Abbot\nDirector of Radio"
}