{
  "id": "d1270-5",
  "text": "NBC -NORTHVJESTERN U. SWMER RADIO INSTITUTE HITS NEW HIGH\nAnnual summer radio institute sponsored jointly by Northwestern University and\nthe National Broadcasting Company opened at Evanston, Illinois, on June 28.\nEnrollment of nearly 100 students from 28 states found more than 50% of the\nenrollees are professionals regularly employed in broadcast stations.\nJudith Waller, director of public affairs and education for NBC's central division,\nsaid other enrollees were persons seeking employment in radio and registrants\nfrom colleges and universities.\nTwelve courses of instruction covering almost all non-technical phases of radio\nare being offered, including a course in radio management. Faculty includes\nmembers of NBC's central division, personnel from Northwestern University's radio\nfaculty, and station managers from large and small stations throughout the\ncountry who will instruct enrollees on the basis of practical experience.\nABC PUBLIC SERVICE DIRECTOR CITED IN \"NEWSWEEK''\nNewsweek Magazine, week of June 7th, presented a detailed account of ABC policy\nwith respect to public interest radio programs. The article, described philosophy\nof 37-year old Robert Saudek (vice president in charge of public affairs for ABC)\nwith special reference to his handling of ABC documentaries.\nSaudek's belief is that ’’documentaries should do more than present the facts by\npresenting conclusions and practical ones too\" on the problem being examined.\nPolicy of intensive research preceding presentation of a documentary was examined\nand illustrated by description of activity going into preparation of the ABC\ndocumentary, \"Communism-U.S. Brand\" which required more than a year of ground work\nin preparation.\nFEDERATED WOMEN'S CLUBS HAIL NAB RESOLUTION\nThe General Federation of Women's Clubs meeting in Portland, Oregon, passed a\nformal resolution commending the National Association of Broadcasters for its\nrecent statement urging broadcasters to give more coverage to UN activities,\nnot only through headline news but through planned programs of discussion.\nCBS REGIONAL DIRECTOR NAMED SPEECH HEAD AT MINNESOTA U.\nDr, E* W. Ziebarth, director of education for CBS Central Division and VJCCQ\n(Minneapolis) has been named Chairman of the Department of Speech at the University\nof Minnesota, Confirmation and announcement of Ziebarth*s new duties came from\nthe University Board of Regents. In addition to his new task at the University,\nZiebarth will continue with his CBS air duties.\nDr. Ziebarth has been associated with the University of Minnesota as a faculty mem¬\nber since 1936. He has served as director of the school of the air for N-A-E-B\nstation KUOM, owned and operated by the University and also as a member of the\nDepartment of Speech. Prior to his coming to Minnesota, he was associated with\nI9HA and the Department of Speech at the University of Wisconsin in Madison."
}