{
  "id": "d1270-7",
  "text": "VOICE CF AMERICA RECEIVES ANOTHER SENATORIAL KICK\nThe Voice of America, Stato Department overseas shortwave information project,\nis still receiving what soma rogard the-slings and arrows of outrageous fortune-\nin any evont the blunt and hardy criticism of Senator H. Alexander Smith.\nSenator Smith told the Senate in mid-June that \"final and unmistakeable respon¬\nsibility\" for the alleged blunders by the Voice of America rests upon the Department\nof State. He further states \"an important collateral responsbility for the fail¬\nure of the programs rests with the National Broadcasting Company.» Senator Homer\nFerguson voices the same opinions as his colleague, stating both senators wore\ncommitted to continuing study of the program.\nMeanwhile NBC and CBS foreign broadcast sections, who had been producing programs\non contract for the \"Voice\" severed relations as of October 1, disclaiming any\nfurther willingness to assist in the project.\n\"SEMI-ANNUAL\" INVESTIGATION OF FCC—HOUSE\nInvestigations of the FCC, like the seasons, seem to roll around periodically.\nCurrent examination by the House Rules Committee was approved in mid-Juno. A\nresolution by Rep. Forrest Harness of Indiana called for a special committee to\ninvestigate the FCC between now and the coming winter.\nSubjects for investigation are the controversial \"Blue Book\" and the FCC's right to\nissue it; the question of possible Communist favoritism by the FCC in license-grants^\npossible FCC influence over programming; charges that of concentration of licenses\nin a limited number of persons or corporations, rather than a distribution of such\nlicenses on a more equitable basis, geographically end ownership-wise.\nRep. Harness, 53-yoar old Kokomo lawyer, member of the House Rules Committee,\nwho at one time blamed the FCC for \"Voice of America\" programs, would probably\nchair the investigation committee* Some observers believe charges by Rep.\nEdward Hebert that Edward Lamb. Toledo, Ohio (licensee of WTOL and holder of TV\npermits in Columbus, Ohio and Erie, Pa.) had worked with the Communist Party,\nwas basis of resolution for investigation.\nPLANS PROCEED FOR BAPTIST FM NETWORK IN TEXAS\nWith the recent grant by the FCC of conditional approval for a local FM outlet\nfor the San Antonio Baptist association, developing plans for a Southwest\nreligious web took further shape. This is one of a number of grants made to Baptist\ninstitutions in Texas. Others include Howard Payne College (Brownwood), First\nBaptist Church (Beaumont), Buckner’s Orphan's Home (Dallas), Wayland Baptist\nCollege (Plainview) and the Southwestern Baptist Theological Seminary (Ft. Worth,\nTexas).\nOHIO STATER WINS KDKA SUMMER APPOINTMENT\nRalph L. Hamilton, Ohio State University, was winner of one of three KDKA (Pitts¬\nburgh) summer appointments to that station's farm department. He will \\7ork with\nKDKA's agricultural director, Homer Martz."
}