{
  "id": "d656-119",
  "text": "^ ^*7^ y**' 4\nSc t Mu* /^u+S sr*ft'—+ >jLA** *\n(TO BE READ WITH EDITORIAL)\nThe following editorial was originally presented by Radio Station WJAY in\nMullins, South Carolina. It has been edited, and it is being distributed\nto member stations by the South Carolina Broadcasters Association.\n7^\nThe Carnegie Commission on Educational TV has spent a half-million\ndollars on just putting the proposal into a tangible form. A half-million\ndollars \"ain’t hay\", even to the Carnegie Foundation. And, the idea has\nPresident Johnson7s unqualified approval. And, it does not cost the Federal\nGovernment one penny. The money to pay for the thing would come from a\nsmall tax on TV set purchases. That would provide $ 104-mi 1.1 ion a year to\noperate the thing. The thing is a new television network - one that would\nhave NO commercials. The new television network would have 380 stations,\ncoast-to-coast — all paid for out of the tax on your next TV set purchase.\nWho would run the thing? Six men would be appointed by the President, con¬\nfirmed by the Senate - and, these six men would get six more. The twelve\nmen would run this TV network of 380 stations on the $104-million collected\nfrom the special tax on TV set purchases. Then, the public on the public7s\nown television network would get \"good\" non-commercial programs, programs\ndesigned to educate you like the Carnegie Foundation wants you to be edu¬\ncated. Perhaps the President, whoever he is at the moment, would have some\nsmall say-so about the education you would get on the public7s own non¬\ncommercial television network. Why wouldn7t the President have a say-so?\nAfter all, the President appoints six of the men who run the thing —\napproved by the Senate, of course - which makes that absolutely non¬\npolitical and non-partisan - and, these six get six more which makes that\nabsolutely unbiased about the war in Vietnam, the debt ceiling, your Social\nSecurity tax which gets bigger while the dollar gets smaller. Medicare’s\nexpansion. Civil Rights, the United Nations, the next deal with Moscow —\nyou see that the six men chosen by another six would assure you education\non these things that is absolutely unbiased.\nWho started this thing? Dr. James R. Killian, Jr. is chairman of\nthe Carnegie Commission on Educational Television. Dr. Killian is, also,\nchairman of the board of Massachusetts Institute of Technology. Massachu¬\nsetts Institute of Technology is, also, the former base of operations of\nDr. Walt W. Rostow, chairman of the President’s National Security Council,\nappointed by the late President Kennedy and retained by President Johnson.\nDr. Rostow is the author of the \"Russia is mellowing\" theory on which U-S\nforeign policy is based and by which the United States proposes to trade\nwith the Reds while they kill off U-S young men at the rate of 8,000 a year\n(currently) and kill off U-S currency value at the rate of $24-billion a\nyear - $24-billion, spelled with a \"B\".\nDr. Killian, the Carnegie Foundation, President Johnson, Dr. Ros¬\ntow have this thing all worked out except for one thing. They need a bill\npassed by Congress to tax your next TV set. If Congress passes that bill,\nyou’ve had it — you, and your children. A Federal Government TV network\nof 380 stations would eventually control your decisions just like Hitler\ncontrolled the German people’s decisions. It does seem like such a good\nidea, until you look again. The Carnegie Foundation has made its move.\nIt’s your move, now."
}