{
  "id": "d656-137",
  "text": "April 3, 1967\nSubject:\nSenate Bill 1160\n\"Public Television Act of 196?\"\nThe Honorable Stuart Symington\nUnited States Senator\nSenate Office Building\nWashington, D» C.\nDear Senator Symington:\nThe provisions of S.lloO are so significant for rad.1 o educational broad¬\ncasting generally and in the metropolitan area of Kansas City, that I\nwrite in behalf of this :<ill. Hitherto, television has fared well in\npublic support, but public support of radio has bon neglected.\nI hope the title? itself can bo amended to read \"Public Broadcasting Act\nof 1967\", for the reason that the text of the Bill, as it should, applies\nto both radio and television.\nEducational radio bore has made extensive contributions to our cultural\nlife. And this without having had a strong base of financial support.\nHie stations concerned arc as follows* Kansas University, Lawrence,\n100,000 ; atto, FV, TV? University of Missouri in Kansas City, 20,000\nWatts, FM; Uazarene Theological Heninary, Kansas City, 10 Vatfca, FMJ\nCentral Pisscuri State College, Warrensburg, 10 Watts, Ff.\nThe University of Missouri at Columbia, I understand is applying for an\neducational band, bus is now confine a to a commercial TV station.\nThe programs of the above stations are not available from any other source.\nThey are vital to the educational work of the institutions with which they\nare connected. They include lectures on various subjects, addresses, course\nwork for enrolled or extensions students; &usie, both classical and modem,\nan well as othar natters, and roach a wide public.\nFor your information I enclose the ' arch 19, 1?67 supplement to the Kansas\nCity Star. This is entitled \"The nuns as City star TV Scene\" (an amendment\ntheiv* is in order, ,too). Your attention is culled to p tges for?, 5>U and 6H,\nwhere articles appear respecting educational radio locally and in Missouri.\nThey are by Joyce T'agner, and I think you will find then interesting aral in¬\nformative.\nIn ry experience I find educatiw i ru io performing a useful public function."
}