{
  "id": "d656-34",
  "text": "liAJJD\nMarch 17, 196?\nKyron Curry, Director\nKA'JP ;r Closed Circuit TV, The University of North lairota\nr’uelic Television Act of 1^6? (Senate bill t 1160)\nlitre is the information i mentioned, to you Thursday evening in regard to the\n\"Public Television Act of ... , j7V! The following items are enclosed:\n1, The AeparU&at of health, hducation, and •• elf are (USOT ) suiasary\nof the background of 1*TV and Idueational hadio, r>tatin; the essential\nassets of the proposed act (J .1160).\n2. A cop;, of Senator Warren Pagnueon’s reaarfcs in the Congroeciccal\nhecord. ;vrch 2, iyo?, when the Senator subwittec the bill for referral\nto the Senate Comoro® Caaioittee of which he is chnirn&n#\n3* A detailed muamry of the Act itself.\n4. A copy of an article by television critic Jack- Gould in the\n0 .76, *\nDon't isadio#* as you knew, ^r. Gould is a lony-est&blished\ncclunnlst (whose column, incidentally, if syndicated, would net a\nwide readership if it could be included in the hhs)).\n5. A cony of the Autumn, iy66 issue of the H1B Ite porter ttubli shed by\nNational Vncational Nadio.\nlilBifieuMMi of Senate bill 1160. it could have\na&ny highly vuiuable implications for bvrth-Dakota wfavrs our citisene are eo\nseparated by geographic distance and, weather condition? and where &i&ny\ndesirable aspects of education and culture, available to the schools and\ncltlsens at large in more urbanised areas, are unavailable. Could this not\nbt: one mean® of helping to retard the exodus of North Dakota’s population to\nother areas?\nIf the Grand Tories lu raid were to adopt an editorial stance on the subject\nof developing educational television and radio (naturally a favorable stance\nis hoped for) I a© sure that it would assist in assuring a favorable attitude\non the part of North -aitota’s Congressional legislators.\nAt the sane time, if the herald wore to favor modification of the Act’s title\nso as to read, \"Public broadcasting Act of 1967#\" it would help to point toward\nthe desirability of creating a document whose substance and title are consistent\nwith each other.\nIf ; wish to have more Information, I can supply it; for example, the olnne\noi ’ r suttee for developing broadcasting facilities. I hope that the\n!**• v.rial provided here* itllhwill be useful, whether you decide to editorialize,\nwrit n fee tv*re article, or set it aside#\nSincerely,"
}