{
  "id": "d391-44",
  "text": "MISCELLANEOUS MATERIAL\n1\nPubic\nNo.\nQ-8 The NAEB Radio-Television Bibliography - Burton Paulu\nA listing of books and articles on all the nontechnical aspects\nof broadcasting covering the period January 1, 19U9 to June 30,\n19#. 129 pp. Paper. $2.00\nD-5 NAEB Director of Members\nThe location, call letters, power and frequency, names and\ntelephone'numbers of all NAEB members. July 1, 1956 (revised\nJanuary 1, 1957)* pp* Paper. $2,00\nQn-lj. Clearance Rights and Legal Problems of Educational Radio and Televi¬\nsion Stations -\" Fredrick S. Siebert\nA brief summary covering such points as \"Common-Iiaw Portection,\"\n\"Copyright Protections,\" \"Use of copyrighted Literary Materials,\"\n\"Recording Rights,\" \"Unfair Conpetition,\" \"Privacy,\" and \"Con¬\ntractual Obligations.\" February, 1955* 6 pp. Paper. 50\nD-7 Technical Directory - Cecil S. Bidlack, Editor\nListing of technical personnel at educational radio-and tele¬\nvision stations, and production stations. February, 1957*\n26 pp. Paper. 50$\nP-5 NAEB Newsletter\nThe official monthly periodical of the National Association of\nEducational Broadcasters. Approximately 10 pp. Paper. $5® 00\nper year. (Back issues 50$ when available).\nP^6 NAEB Engineering Newsletter\nA quarterly publication giving latest news in the technical field\nof interest to educational technical personnel, including \"Techni¬\ncal Tips,\" news of personnel, equipment needed'and for sale,\ntechnical reports, etc. •Approximately.6 pp. Paper. $2.00 per\nyear, (Back issues 500 when available).\nP-7 NAEB Journal\nA professional journal devoted to articles prepared by leaders\nin the field of education and concerned with the utilization of\nradio and television for education, as well as the specific field\nof educational broadcasting. (Beginning with January, 1958, issue\nincludes NAEB STV Fact Sheets formerly sold separately. These Fact\nSheets are an effort to digest and centralize available research,\nprincipally on the effectiveness of radio and television as directly\ninstructional tools. Includes research into techniques of presenta¬\ntion, production principles, and content and audience research.)\nPublished eight times a year (monthly except June, July, August and\nSeptember). Approximately 50 pp. Paper, 00 per year. (Back\nissues 500 when available.)"
}