{
  "id": "d391-53",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BRO\n14 GREGORY HALL\nURBANA, ILLINOIS\nMarch 22, 1?59\nThrough the diligent efforts of most of the members of the\nNAEB Research Cornraittee, and the cooperation of all of the\nwould-be broadcast researchers who failed to submit applications,\nthe first task of our committee for 195? was dispatched in record\ntime. 1 am still not sure why we have failed to get a better\nresponse to our grant®^2in#«id program, Admittedly, $500.00\nis small pickings when compared to some of the money floating\naround these days but, unlike most such grants in broadcasting,\nours are available for graduate students working under capable\ndirection, this should certainly be an inducement. Also,\nour notices went out much earlier this year than they have\nfor a mnfeer of years. We tried to place them in the hands\nof stations and departments Just after the opening of the\nacademic year. As Irr Merrill has indicated, if any of you\nhave ideas for the improvement of this grants program, please\noffer them.\nEqually important, w© would appreciate ary suggestions which\nyou have for ways in which you feel our committee might\nserve educational broadcasting research. This is not to say\nthat I think we ought to look for something to do to keep\nbusy, simply because someone has designated us as a oosisaittee.\n(I am certain that none of you needs additional suggestions\nfar ways to keep busy 1) However, if there is a need which we\nmight fill, l think that it should be considered by the comittee.\nThe NAEB currently has two or three proposals before the\nDepartment of Health, Education, and Welfare (under Title VTI\nof the HiU-Flliot bill), if one or more of these goes\nthrough, there will certainly be a need for advice and\nassistance from laesfcers of the research committee.\nI am looking forward to hearing from you. I can be reached\nat the address below or at the Bureau of Applied Social Research,\nColumbia University.\nSamuel L. Becker, Chairman\nNAEB Research Committee\n106 Momingside Drive\nUrn York, 2?, N.X."
}