{
  "id": "d391-68",
  "text": "July 13, 1959\nMr* Fernand Terrou, President\nInternational Association for Mass\nCommunication Research\n27, Rue Saint-Guillaume\nParis VIIE, France\nDear Sir\nYour letter and documents of June 12, 1959, addressed to the\nNational Association of Educational Broadcasters in this country,\nhave been forwarded to me for reply* As chairman of the research\ncommittee of the NAEB, it was felt that I might best respond* The\nmembers of my committee would be the ones most interested in the\nresearch and bibliography sections of the proposed Bulletin and\nwould provide most of the information from here for the Bulletin.\nBefore we can proceed, however, additional information would\nbe helpful. You mention documentation cards. It is not clear to\nme whether these refer to the forms on which we are to submit in¬\nformation to you, or whether these are duplicate sets of information\nitems which will appear in the Bulletin. It would be helpful if we\nknew which they were and how much they would cost us. If the docu¬\nmentation cards are the actual bibliographical items, I would guess\nthat many libraries in this country would be interested in receiving\nthese as they come out* I would like to know then how much these\nwould be for non-members of the association or how much a subscrip¬\ntion to the Bulletin would be, since it would also contain all of the\nsame information*\nI would assume that we could probably be of most help here by\nappointing a different member of our research committee to be re¬\nsponsible for submitting information for each section of the Bulletin.\nWhat would you think of this? When do you want to start getting\nitems? How far in the past should we go for the bibliographical\nitems?\nIn regard to your questionnaire on which sections of the Associ¬\nation most interest us, is it possible for different members of the\nNAEB to be listed as members of different sections? If not, I suppose\nthat, as chairman of our research committee, I should be listed for\nall sections so that we have a complete file of the Association\nactivities."
}