{
  "id": "d391-70",
  "text": "Dear Harry:\nCOPY\nIrv Merrill and Hide Kumata have suggested that the research\ncommittee meet with Marshall McLuhan on the 9th and 10th\nof September in Cincinnati. The American Psychological\nAssociation is meeting there from September 3-9# Scheduling\nour committee meeting at that time would make it more likely\nthat we could get the committee together because many will\nbe at that meeting. It would also mean that some who might\nnot otherwise go to APA would go and, as Irv put it, \"take\nin the pertinent sessions of the convention to stimulate\nour experimental thinking.”\nI think that this is a pretty good idea. The only problem\nis that this comes in the middle of the vacation period for\nall academic persons, who are generally off until about the\nl£th or 20th of September. Whether some of the committee\nwill be off vacationing someplace at that time, I do not\nknow. I am still not sure of my plans for this period but\nwill probably be available by the 9th.\nAnyway, what do you think. Will Mac be back from Vancouver by\nthen?\nI am happy to say that I believe that I am going to have more\ntime to devote to my own research and the supervision of graduate\nresearch in the future. I have gotten the Provost to agree to\nlet me delegate most of the responsibility for production\nsupervision to other people - though the ultimate responsibility\nwill still have to be mine. I am going to have Winnie take over\nmost of the responsibility for our in-wchool\nand public relations programs, another fellow take over responsility\nfor our \"creative” experimentation in production — drama, etc.,\nand a third take over responsibility for film production. Unfortunately,\nI cannot yet shuck any administrative work - but at least this is\na step in the right direction* and I am much encouraged.\nNothing else new here. let us know what you think of the possible\ndates. We probably ought to let the committee know before too long\nso that people can make appropriate plans.\nccs Merrill\nBest\netc.\nLetter typed and mailed on July 27, 1959,\nto Dr. Harry Skornia, Executive Director,\nNAEB, 14 Gregory Hall, Urbana, Illinois.\nCopy to Dr. Irving R. Merrill mailed 7/27/59."
}