{
  "id": "d1490-5",
  "text": "-6-\nis of the opinion that a most needed form of activity in radio education is to\nencourage high schools to equip themselves with receiving sets and to help them de¬\nvise ways and means of how to do so* Few high schools in that area have as yet\nbecome radio-minded.\n\"One interesting development of this service is the broadcasting of addresses\nby notable men before convocation of the students at the State College of Washing¬\nton from time to time*\n\"Another factor being emphasized at Washington State is the radio ’high\nschool report* that is planned as a feature of the Thursday afternoon High School\nActivity Hour, to which as much as fifteen minutes may be devoted in telling the\nworld some of the interesting things that the high schools of the Northwest states\nare doing*\n\"Effective cooperation between the educational radio and the press is most\ndesirable. There is need of a constant campaign of education among the papers of\nmany states in which there is an educational radio station, to get the press to dif¬\nferentiate between educational stations, whose interests are practically identical\nwith those of the press, and the commercial stations which have for years been\ntaking from the papers a large part of their revenue—that derived from advertising.\n\"Many editors, thinking 'a radio is just a radio*, are unwilling to discrimi¬\nnate between broadcasting stations that help them and those that hurt them. Sta¬\ntion KWSC has for some time carried on persistent campaigns for the education of\nthe newspapers in the State of Washington, and results are beginning to come in.\nCertain of the largest dailies in the state now give KWSC’s programs in a regular\nplace in their columns. In a number of other instances, items of news interest are\nprinted, thus building up this logical and strong relationship.\"\n#\nThe Ohio State University representative in N.A.E.B., R.C.Higgy, Director\nof WOSU, and long a faithful servant of the educational broadcasting group, tells\nwhat's going on in the Buckeye State:\n\"A series of programs, known as the Emergency Radio Junior College, completed\nthe first year of formal class instruction of college level by radio. The interest\nint hese classes has been phenomenal, and the size of the registered audience is\ngrowing steadily.\n\"The cooperation of the Ohio Emergency Schools Administration, a division of\nthe State Relief Commission, has been most helpful, and has contributed approximately\n$2,000 each three months for office help, postage and printing, and the preparation\nof supplementary test materials. The class enrollment, during the present quarter,\nfor each of eight courses, averages 400*\n\"A few broadcasts have been conducted directly from university class-rooms,\nthe radio audience hearing the part of the class hour devoted to straight lectures\nin one course, and in another hearing the complete class discussion. Radio listen¬\ners, who fill out a registration card, receive, free of charge, supplementary test\nmaterials, varying from the 120 page mimeographed \"book\" used as a text in the\nFrench course, to a 12 page syllabus giving an outline and suggested references.\nStudents, following the French and Spanish courses, have later enrolled in the Uni¬\nversity and been able to carry advanced courses, securing credit, after a proficiency\nexamination had been given covering the radio course.\n\"Many of the radio courses parallel regular university courses. In these\ncases a student is informed that should he later enter the University he may take\na proficiency examination and receive credit for his radio work, if satisfactory."
}