{
  "id": "d35-3",
  "text": "COPY\nCOPY\nWDTR\n90.9 FM Radio\nDETROIT PUBLIC SCHOOLS\nDEPT. OP RADIO-TV EDUCATION\nDivision of Instruction\n93^5 Lawton Avenue - TYler 4-4l88\nDetroit 6, Michigan\nWTVS - Channel 56\nUHF Television\nFebruary 8, 1961\nMT. Harry D. Lamb, Director\nRadio Station WTDS\n1901 W. Central Avenue\nToledo 6, Ohio\nDear Harry:\nI have the copy of your letter to Mr. Harley relating to your accepting the chair¬\nmanship of the Radio Network School Committee. I do hope that you have accepted\nthis honor, because if anyone can bring it to new life you can do it.\nI have always believed that HAEB was expecting a great deal from this particular\ncommittee, inasmuch as there never was a fund to enable the group to have adequate\nmeetings and to prepare necessary materials for the membership. I know that this\nservice is the life blood of many of the smaller stations, and I am sure they\ncould not operate without the aid they have received through the tape service.\nIt would be wonderful if stations would be willing to prepare the series that are\nneeded; but, frankly, I don't think some people really know what they want. All\nthe programs offered come from stations in full operation and are offered by these\nindividual stations because they meet the individual needs of the community. It\nis quite possible that they meet the needs of other areas also.\nI don't agree that the judging was \"not objective,\" because we really took this\njob seriously. I know that in my own case, our entire staff gave critical appraisals\nof all series. Then, we observed groups receiving the programs (these were the\nage group of the intended audience) and based our judgment on these reactions.\nIn no case did I ever form a judgment about the program because it came from a\ncertain station. We certainly hope and expect that programming will improve year\nby year in every area.\nThis is just a note to wish you good luck in your endeavors and to give you my\nblessing on your new job.\nSincerely,\n/•/\nKathleen N.Iardie, Director\nDepartment Radio-TV Education\nKNL:vh"
}