{
  "id": "d35-7",
  "text": "-COPY\nCOPY\nSTATION NTDS\n1901 WEST CENTRAL\nTOLEDO 6, OHIO\nMarch 23, i960\nMrs. Kathleen N. Lardie\nManager, Station WDTR (FM)\nDetroit Public Schools\n93^5 Lawton Ave.\nDetroit 6, Michigan\nDear Kay:\nNeither of us is a shrinking mimosa type, but after the Omaha meeting in which\nthe University of Oklahoma cowboy rode roughshod over the in-school contributors,\nparticularly WNYE, I can readily understand why no one wishes to submit a\nseries to the same type of attack. I mention this because your point one,\nasking for a listing of criteria, reminded me that whatever criteria we, as\na committee, establish may not be the criteria employed by university and\ncollege broadcasters who also try to serve elementary and secondary school\naudiences. In-school criteria should be the product of the broadcasters of\nin-school materials. The critic*s role is too easy if there is no responsibility\non his part to determine the criteria of acceptability except ex post facto.\nWhat is the record—does it show a drying up of submissions before or after the\nOmaha meeting?\nEncouraging people to submit programs, point two, can be done by grants-in-\naid, perhaps, but I question whether this is really a factor. A friendly\nclimate of opinion is more desirable than funds. If we could establish by\nquestionnaire the needs of all member stations for in-school program series, then\nwe might be able to commission or solicit certain stations to produce a series\nor at least part of a series. As an ice-breaker, we might establish a format on\nCities of the U.S.A. and ask every station to produce a program (or programs)\ndealing with its home city or a neighboring city it knows well or could easily\nresearch. I*d suggest that for the sake of stimulation that we offer every\nsubmission in such a series without comment. If our format is foolproof we\nwon't be risking much. There are stinkers in well mounted commercial series,\ntoo.\nYes-to point three: preview-tryouts; and yes, to point four. I do plan to sub¬\nmit a series of twelve programs for the third grade—it*s a continuation of the\nHow You Talk speech series by Dr. Hawk which was accepted by the network. The\ncontinuation deals with vowels.\nI'm also submitting this year*s version of Making Friends with Music. This\nseries, with different talent, has also in past years been on network. The\nhandbook is the best we have ever had, the planning is the best, but our music\ndepartment personnel responsible for the planning feel that the execution falls\nshort of the promise. This may be true, but the classroom use of the series\nhas been extensive and enthusiastic in spots. In a lean year it may suffice."
}