{
  "id": "d910-137",
  "text": "-6-\nD* Publication Plansg\nA printed report of some 1,800 copies 'will be made available to those\nmentioned above* Publication in educational journals and trade\njournals of various parts of the report may also be expected* Dis¬\ntribution through the National Association of Educational Broad¬\ncasters or other organizations may also be a possibility*\nVI* Personnel?\nAs Chief Consultant we propose Dr* John C* Schwarzwalder* Dr* Schwarz-\nwalder was founder and first Manager of KUHT in Houston, the nation*s first\nnon-commercial educational television station* He is now General Manager\nof KTCA-TV in Minneapolis-St* Paul which he also established* He is\nuniquely familiar with both institutionally-owned and community ETV\nstations* He will be able to obtain leave of absence from his work to con¬\nduct the project. He is in his third term as a Director of the National\nAssociation for Better Radio and Television and his second as a Director\nof the National Association of Educational Broadcasters. The most\nrecent of his numerous articles, \"The Promise of Teaching by Educational\nTelevision,\" appears in the current issue of College English*\nAs Engineering Consultant we propose Mr. Berten Holmberg, Video Tape\nProduct Control Engineer, Minnesota Mining and Manufacturing Company* Mr*\nHolmberg, who can obtain leave of absence for the project, is a graduate\nengineer with eighteen years of broadcast experience* He has served as\nChief Engineer for KTCA-TV and prior to that as Chief Engineer for KUOM*\nHe has been a member of the National Association of Educational Broad¬\ncasters Engineering Committee for eight years.\nAs Programming Consultant we propose Mr* Paul Owen, now Assistant Manager\nof KTCA-TV and former Assistant Manager and Manager of KUHT* Mr* Owen is\nwidely experienced in commercial broadcasting and is a pioneer in educa¬\ntional television. Leave for him can also be arranged*\nVII* The office and fiscal facilities of KTCA-TV are available to support the\nproject without cost* An engineering truck with equipment is available for\nthe engineering survey*\nVIII. Durations Total amount of time required? Eight months including preparation\nof report*"
}