{
  "id": "d910-166",
  "text": "MICHIGAN STATE UNIVERSITY\nOF AGRICULTURE AND APPLIED SCIENCE • EAST LANSING\nTELEVISION STATION • WKAR-TV\nOctober 22, 1958\nMr. William Harley\nProgram Director, WHA-TV\nRadio Hall\nUniversity of Wisconsin\nMadison, Wisconsin\nDear Bills\nIn answer to your inquiry concerning the availability of the Kellogg Center\nfor a proposed regional 3 meeting in January, the only Thursday and Friday\ndates available would be January 22 and 23* However, no conference rooms\nwould be available at this time due to other conferences and programs already\nscheduled.\nThere are two weekends available: Friday and Saturday, January 9 and 10,\nand Friday and Saturday, January 16 and 17* Conference rooms and all the\nnecessary facilities are available on these dates.\nSingle rooms are $7*50, double rooms are $8.50; the latter making it $1n25\nfor each person in a double. All rooms are capable of double occupancy since\neach room contains twin beds. The price of meals, in case you would like to\narrange for luncheons or dinners for the group, are as follows: luncheons,\n$1.90 to $2.75; dinners, $2.70 to $U*75* The menu you select would determine\nthe price.\nThis is about all the information I can give you at this time. The Center\nwould like to know how many meeting rooms you would require; for example,\n2.-/.T// how many rooms you would like for small group meetings and if you would like\none large room for a meeting of the entire group. If you can supply this\nXyu information, please communicate directly with Tunis H. Dekker, Assistant\nDirector, Continuing Education Service, Kellogg Center, Michigan State Univer¬\nsity, East Lansing, Michigan. Dekker can give you an estimate on registration\nfees to cover services and conference room requirements as soon as he knows\nhow many such rooms you need and what the nature of the services would be.\nYou don*t need a middle man on this. If you think that the weekend dates\nwould be acceptable and you would like to consider nailing them down, write\ndirect to Dekker, who will handle the arrangements for you through his\noffice•"
}