{
  "id": "d910-60",
  "text": "AND TELEVISION SERV\nINDIANA UNIVERSITY\nBLOOMINGTON, INDIANA\nRADIO BUILDING\nAREA CODE 812\nTEL. NO.\nSeptember 30, 1963\nEnthusiasm for the rapidly approaching Conference\nfor Midwest Educational Broadcast Music Directors is\nbecoming harder to contain here at WFIU, and we would\nlike to pass on some of the reasons why.\nAs you know, the Conference is set for October 22\nand 23 on the Indiana University campus which, at that\ntime, should be a lavish Autumn spectacle,\nA significant event will be the premiere performance\nof \"Quintet for Oboe and Strings--1963n by Bernhard\nHeiden, Professor of Composition at Indiana University.\nThe work was written to celebrate the opening of the new\n$2,500,000 Radio-TV Production Center. The featured\nsoloist will be Jerry Sirucek, who came to the music\nfaculty from the Chicago Symphony Orchestra, Last\nspring Heiden saw his first opera, The Darkened City,\npremiered by the Indiana University Opera Theater. His\nwork is not only familiar to our campus, but has been\nperformed by many of the jnajor symphony orchestras and\nchamber groups in America,\nAlso to be heard are quartets by the Chilean composer,\nJuan Orrego Salas, who now heads the Latin American Music\nCenter here, and Thomas Beversdorf, resident composer*\nOprego Salas’s work, commissioned for the 1957 Inter-\nAmerican Festival, was premiered in Washington, D, C, by\nthe Julliard Quartett The quartet by Beversdorf was\ncomposed in 1952 andhas been performed several times\nthroughout the country. The Berkshire Quartet which\nwinters In Indiana and summers on Music Mountain Is the\nperforming group and includes Urico Rossi, first violin;\nAlbert Lazan, second violin; David Dawson, viola; and\nFritz Maag, cello.\nOur key speaker, hopefully, will be Samuel Chotzlnoff,\nGeneral Music Director of the National Broadcasting Company.\nWe say hopefully because Mr, Chotzlnoff, although enthused\nabout the invitation and especially eager to see the Music\nSohool, is presently recovering from an illness. The\nprospects of his appearance, however, are bright.\n\"Tympani and Tape’* is the title of a workshop to\nbe given by George Gabor, widely recorded percussionist\nand campus wit, and Louis R. Burroughs, Vice President\nof Broadcast and Recording Equipment of Electro-Voice, Inc,"
}