{
  "id": "d1623-0",
  "text": "NAE8 NEWS LETTER\nUrsana, illino{s\nMay I, 1946\nNAEB MEETS AT COLUMBUS\nThe Natconal Assocsatson of Educational Broadcasters will hold meet¬\nings Frida morning and afternoon»-and EVENiif4G^ ir necessary— at\nColumbus on Friday, May 3^ The sessions Af?E rcHEOutED for the Walnut\nRoom at the Neiil HousEo Problems facing ihe AseociAiiON and edu¬\ncational RADIO WILL BE DISCUSSED,\nFCC URGES ALL TO PROCEED WITH FM CONSTRUCTION\nThe Federal Communications Ccmmissicn on April 5 officially denied\nA NEWS AGENCY REPORT QUOTING AN ALLEGED FCC SPOKESMAN AS SAYING \"THAT\nSN VIEW OF THE VERY FEW FM SETS TO BE PRODUCED THIS YEAR, IT IS NAROlY\nWORTH WHILE FOR THE BROADCASTERS TO CONTINUE WITH STATION CONSTRUCTION\nPLANS,\"\n\"Mo person in ANY RESPONSIBLE POSITION IN THE AGENCY HAS MADE SUCH.A\nSTATELU^NT, \" THE COMMISSION DECLARED, \"ThE STATEMENT DOES NOT REPRESENT\nTHE VIEWS OF THE COMMISSION, !t IS ERRONEOUS AND GRAVELY MISLEADING,\n\"Far FROM DISCOURAGING BROADCASTERS FROM CONTINUING YH TH THEIR STATION\nCONSTRUCTION PLANS, THE COMMISSION URGES ALL OF THEM TO PROCEED WITH\nTHEIR PLANS WITH THE GREATEST POSSIBLE SPEED,\n\"The views of the Commission are set forth in an official news release\nISSUED Wednesday, April 3, Thus release shows that 85 manufacturers\nREPORTING IN AN FCC SURVEY ESTIMATE THEY WILL PRODUCE 1,LOO,000 FM\nSETS f! N 1946o Particular ATTENTION ns called to the last sentence of\nthis official release;\n''llN THE LIGHT OF THE RAf^'iD PROGRESS BEING MADE FOR\nTHE DEVELOPMENT OF FM ON sHE STATION SIDE,, THE\nCommission hopes that manufacturers may revise their\nPRODUCTION SCHEDULES TO INCLUDE A GREATER PROPOR*\nTION OF FM RECEIVERS,’\"\nGRirriTN TFt-TIFIES AT CLEAR CHANNEL HEARING\nThe Feoerai- Communications Commission has been urged to allow educational\nSTANDARD RADIO STATIONS TO OPERATE DURING EVENINGS ON CLEAR CHANNEL\nFREQUENCIESc REPRESENTATIVES OF TWO SUCH STATIONS TOLD THE COMMISSICN\nON ApRm. 26 THAT IN ORDER TO GIVE EFFECTIVE EDUCATIONAL SERVICE THEY\nMUST Have evening time and SUFFliCIENT POWER TO REACH THEIR LISTENERS,\nOne of the witnesses was W, J, Griffith, Director of Station W-0-!\nY/HjCH !S OV^NED AND OPERATED BY ! OWA STATE COLLEGE OF AtSRI CULTURE AND\nMechanic Arts, The other was Jo M, Naulty, Extension Director of the\nUniversity of Minnesota, which operates station K-u-O-M, (See encl^sukv.\nFOR Griffith’s testimony)."
}