{
  "id": "d1623-3",
  "text": "NAEB NEWS LETTER,\npage 4. ♦. •.. • April 1» 1943.\nAt the present time, listeners are requested to write in and tell how they\nreceive W39% in various parts of the city. The transmitter is located\natop the Municipal Building...540 feet above City Hall Parle. The Municipal\nBroadcasting System goes to the Metropolitan Opera House beginning April 1\nto bring WNYC and W39Ny listeners the music of the Ballot Theatre's\nSpring Season performances9 with the Ballet Theatre1s Orchestra oonduoted\nby Antal Dorati. Broadcasts over both municipal cutlets will begin at 8:30\nfor eaoh performance carried. However# WNYC must leave the air at 9:00P.M.\nand thus its listeners will hear the opening works of each performance\nonly. But city listeners will Frequenoy Modulation sets will be able to hear\ncomplete performances with W39NY carrying Ballet Theatre programs from\nstart to finish during the evenings on which the Municipal Broadcasting\nSystem has them scheduled.\nWNYC HONOflS THOMAS JEFFERSON\nOn Friday, April 2nd, WNYC clebrates the 200th anniversary of the birthday\nof Thomas Jefferson by presenting scenes from Sidney Kingsley's hit Broad*»\nway play \"The Patriots\"'with the original members of the cant. The Father\nof the Declaration of Independence's birthday is actually Tuesday, April\n13th, but WNYC is celebrating the event a week earlier in order that stud¬\nents in the New York City high schools and elementary schools may be able\nto tie this broadcast in with their current studies. The scenes deal with\nten vital years in the life of Thomas Jefferson, and will be enacted by\nRaymond Edward Johnson, Edwin Jerome* and House Jameson—who play the roles\nof Jefferson, Washington, and Alexander Hamilton respectively in The Patriots\nWNAD GETS U.P. WIRE SERVICE\nClimaxing two years of negotiations by Extension Division and other Univer¬\nsity of Oklahoma officials, final arrangements were made early in Maroh for\na United Press news service for radio station WNAD*\nAnnouncement of the additional service which the state* s educational station\nwill carry was made by Joseph A. Brandt, University president. The news ser¬\nvice which will give 24-hour coverage on international, national and state\nnews, will be the first direct wire service into Norman. Emerson Titus,\nVniversity senior and WNAD staff member# was appoihted student in charge of\nnewsroom to process the news for eaoh broadcast. Regular WNAD staff announcers\nwill read the news. Miss Hawk said.\nIn addition to use in spot news reports, the United prass service will be\nused for laboratory purposes by a radio class taught by Joe Holland,\njournalism instructor, and for the Headline Parade program, a dramatisation\nof news by John Dunn, drama professor.\nUNIVERSITY OF MICHIGAN ON WEAR\nOn February 17, the University of Miohigaa began a weekly hour of programs\nover WKAR# Originating on the oampus in Ann Arbor, the programs will b4\nheard eaoh week from 2:00 to 2:00 p.m. Scheduled at 2:00 o'clock is James K.\nPollack, Professor of Political Science, who will comment on the news of the\nweek. At 2:15p.ra. Community in Action will be heard. At 2:30 p.m. Palmer\nChristian, nationally known organist, will play from Hill Auditorium, and\nat 2:45 Dr. Herman Riecker will discuss some phase medeolne and health."
}