{
  "id": "d1129-1",
  "text": "NAEB NEWS LETTER\nPage 2\nJanuary, 1946\nMaooy also is a Professor of Radio Music Instruction at the University\nOF Michigan in Ann Arboro He has engaged in numerous verbal exchanges\nWITH THE HEAD OF THE MUSICIANS* UNION, JAMES PETRILLOo\nNow, MaDOY says, he has RECEIVED A TELEGRAM FROM THE UNION TELLING HIM\nFORMAL CHARGES HAVE BEEN FILED AGAINST HIM. ThE CHARGES ALLEGE MaDDY*S\nACTIVITIES AT THE MUSIC CAMP HAVE BEEN DETERMENTAL TO THE UNION. SAYS\nMaddy:\n“I HAVE been a MEMBER OF THE MUSICIANS* UNION FOR 37 YEARS—-LONQER\nTHAN Mr. Pe-TRILLO HAS BEEN AFFILIATED WITH IT—-AND I CERTAINLY WELCOME\nTHIS SHOWDOWN ON THE QUESTION OF WHETHER ONE MAN CAN DICTATE THE UNION*S\nPOLICY,\"\nFCC WILL RECONSIDER FM ALLOCATIONS.\nThe Federal Communications Commission has agreed to consider a request\nFOR MORE AIR SPACE FOR FREQUENCY MODULATION BROADCASTING.\nThe Commission ordered a hearing January 16th,, on a petition by the\nZenith Radio Corporation, which requested the band 42 megacycles to 50\nmegacycles BE ASSIGNED FOR F-M BROADCASTING. THIS WOULD BE IN ADDITION\nTO THE 88-TO 108 MEGACYCLE BAND, ALREADY ASSIGNED TO FM.\nThe Zenith Corporation said the 42 to 50 megacycle Band permits coverage\nIN AN AREA TWO AND ONE HALF TIMES LARGER THAN IS POSSIBLE IN THE HIGHER\nBAND. The petition said the GREATER COVERAGE WAS DETERMINED IN TESTS\nCONDUCTED BY THE MILWAUKEE JOURNAL*S F-M TRANSMITTER, WHICH OPERATED IN\nBOTH BANDS.\nUnless the additional 42 to 50 megacycle band is assigned to FM, the\nPETITION SAID, MOST RURAL AREAS WILL BE UNABLE TO HEAR STATIC-FREE FM\nBROADCASTS.\nW N Y C PLANNING SEVENTH ANNUAL AMERICAN MUSIC FESTIVAL.\n\"Programs are currently being planned and scheduled to make the seventh\nannual WNYC American Music Festival as complete and comprehensive a\nREVIEW of American music as has ever been attempted by a radio stationj,\"\nDECLARED SEYMOUR N, SlEQEL, WNYC PROGRAM DIRECTOR, MR. SiEGEL BASED\nHIS REMARKS ON THE PAST HISTORY OF THE ANNUAL WNYC AMERICAN MUSIC\nFestivals which in the words of New York Times Music Critic, Mark A.\nSCHUBART \"is one OF THE MOST VALUED CONTRIBUT IONS RADI 0 HAS MADE TO THE\nCURRENT MSUICAL SCENE.\"\nTHREE MORE NON-COMMERCIALS GRANTED.\nThe FCC on December 6th granted the Trustees of Columbia University a\nCONSTRUCTION PERMIT FOR A NEW FM STATION. ThE STATE UNIVERSITY OF\nOklahoma at Norman, Oklahoma and the Board of Supervisor of Louisiana\nState University and Agricultural and Mechanical College at Baton Rouge,\nLa., were GRANTED CONSTRUCTION PERMITS FOR EDUCATIONAL NEW STATIONS.\nTo DATE, FREQUENCIES HAVE NOt YET BEEN ASSIGNED BY THE COMMISSION.\nReporting as of December 6th, 1945, there were six licensed nonOcommer-\nCIAL EDUCATIONAL BROADCAST STATIONS AND SIX OUT-STANDING CONSTRUCTION\nPERMITS IN ADDITION TO THE THREE NOTED ABOVE. AnD THERE WERE 25 AP-"
}