{
  "id": "d981-0",
  "text": "NiiEB IS^QUMTERS\n14 Gregory Hall\nUrbana, Illinois\nTot Members of Foundation and Financing Committee\nFraat H. J. Skonda\nDatot Jsooaxy % 1958\nGentlemen*\nPresident Paulu suggested that, before vs meet, I pull together some¬\nthing from which we might start* Although it has been done hastily, and\nwith the realization that what finally comes oat will possibly be quite\ndifferent, here it is*\nThis is an attempt to reduce to wilting some or all of the ideas previously\ndiscussed* Without clarification by discussion, this is of course only\na tentative start, for discussion and revision by the Foundations anti\nFinancing Committee, first; possibly by the Board (aeybe by mail) then for\ndiscussion, in tentative form, with Kellogg and Ford* Since the Kellogg\ngrant is made on the condition that we remain “independent1* and at the\nUniversity of Illinois through Juno 30, 1959, discussion with them is a\nnecessity*\nThese figures are perhaps day-dreaming. We have compromised for so long\nwith reality that I decided to put down what we really need if we're to\ndo the job we ssgr we need to do. Cuts can always be made if we are told,\nor if you feel, that we must reduce to “realistic1* am&, After years of\nsaying we should “shoot the works**, however, I could not bring myself to\nsubmit for discussion anything but a really realistic budget. Even in\nthis, as I look it over and discuss vita Hill, Bidlack and others, I find\nI've not included the approximately $30,000.00 we need to get new Asperses\nto replace our worn-out network duplicators with something of good quality.\nI'll appreciate your suggestions regarding where and how to include this.\nThere may be other oversights as well. If so, please don't hesitate to\npoint cut. I'll have some by meeting time too, I expect, as will the\nstaff hare, to whom I'm also distributing (Hill, Bidlack and Underwood).\nSome might be less frank, and expose our souls and concerns less openly.\nI personally feel that honesty usually pays, and have proceeded on that\nbasis.\nIncidentally, workman's compensation, retirement and other figures here\nwill all have to be revised since I've not corrected in this draft. Such\ndetails will all be subject to careful checking in the final “document*\nwhich “comes out“ or “goes in.“"
}