{
  "id": "d981-100",
  "text": "-12-\nUSIA: The United States Information Agency\nThanks to patient efforts on the part of the NAEB, particularly its\nNetwork Manager, and a reorganization within the USIA, more progress was\nmade during the past single year in cooperation with this group than had been\nachieved in several years preceding. The NAEB is now providing a consider¬\nable flow of programs to the USIA for broadcast around the world. Some of\nthese are specially produced for this purpose. Others are regular series.\nWe are gratified, as is the USIA, by the belief that these programs reflect\ngreater credit on the U. S. than some of those which the USIA for various\nreasons was previously forced to use.\nWRH: World Radio Handbook\nIn reply to our criticism of the inaccuracy with which American broad¬\ncasting generally, and educational broadcasting in particular, were presented\nin past issues of this world-wide publication, we were invited to write these\nsections for the WRH. The current issue now presents an accurate picture of\nthese U. S. services, as prepared by the NAEB staff.\n******\nNot listed above are various other organizations and foundations, such\nas the Edison Foundation, various school building councils, planning associa¬\ntions, and other very special groups, with which we have sporadic relations\nor to which we have occasional representation. There are also a considerable\nnumber of organizations with whose objectives we do not care to associate\nourselves, and various pressure groups with whom we courteously decline to\nhave any type of interchange. Naturally, all possible assistance is regularly\ngiven the U. S. Office of Education and various cabinet. Senate, and Executive\nrequests for information from the Federal Government.\nBasically, although we do feel that a great deal of time is required by\nthis type of organizational relations, we also feel that education must be a\ntotal and coordinated effort, and to that end provide assistance to responsible\norganizations with honorable objectives, whenever it lies within our power to\ndo so, while still maintaining our regular services to our members."
}