{
  "id": "d981-11",
  "text": "10,\n/,\nWith such a permanent office, it is oar belief that the significant service\nof educational broadcasting in this nation msy, for the first time, become\nfamiliar to the general and educational public of the U. S„ This should\ngreatly assist also in the long-run efforts to secure an adequate financial\nbase for the permanent use of electronic media as legitimate and indispensable\ninstruments in the TJ. S. educational. system.\njicjuLo^y\nStation Activation /__——$100,000.00 per year\n\"-- *500,000.00 total\nSo far, numerous off arts have been tried, to activate the national educational\nresource contained in the frequencies presently, but only temporarily, reserved\n> educational television and BM radio. Both of these resources are still\njeoparsfy. And America* s educational systems, ftm coast to coast, which\ndesperately need them, have had no one agency to turn to to provide the kind\n~ practical assistance needed, on the spot.\ngrants, on a matching basis, have helped. Indeed, without them there\n‘ undoubtedly be no reserved frequencies today, and no possibility such as\nhare outline.\nThe JCET has done yeoman service in carrying out a holding operation in\ndefense of TV frequencies. In fact it has accomplished an almost impossible\ntask during the past five years in the largely defensive efforts it has\nexerted to preserve frequencies that have been allocated.\nThe NCCET and the EjTIC have also contributed heroically to the development of\na general awareness of this resource, as well as securing substantial industry\nsupport. This latter, together with the labor support which the NAEB has\nbeen able to rally, thanks to grants of the FAB and the Ford Foundation for\na Management-labor Consultant, represents wise and solid progress.\nBut the fact remains that many frequencies in communities generally desirous\nof activating them, need the kind of assistance, on the spot, which none of\nthe above organizations is qualified to provide? consultants who can, on\nrequest, report , to tbs desired location* On the basis of the experience of\ntbs consultant, in each case, who will be selected precisely because of his\nexperience in putting stations on the air in such areas, vague and confusing\nprocedures will be reduced to workable plans, and educational stations can\nbecome realities in many locations which will otherwise lose them. The interest\nis already present. Only the precise know-how (available richly in the managers\nof NAEB stations fresa coast to coast) is lacking.\nThe present proposal then, will bring the human resource, in the fossa of a\nqualified expert, to the areas which need them. He will stay on an win-residence*\nbasis, until a staff is selected and trained, end the station on the air.\n(Here we* 11 add necessary e:\nnot now available — and go\nBudget requested\nFor consultant fees, expenses and travel, on a *1,000\nper month plus expenses basis\ntent on the project, from various dociaaents\n*100,000.00 per year"
}