{
  "id": "d981-113",
  "text": "Research as essential. This item is therefore central to the experimen¬\ntation, fact-finding and interchange of research findings which are\nneeded If available funds are to be wisely spent.\nThe NAEB1s responsibility for helping to meet the need for a research\ncoordination center has become inescapable. At the recent NAEB Research\nSeminar, attended by some twelve distinguished educators as well as those\nresearch specialists who are In charge of research for the ETV projects\nand stations of the U.S. and Canada, this obligation was firmly put to\nthe NAEB. One of the statements drafted by this Seminar:\nNationally, an appraisal of the impact of educational broadcasting\nand its role in the total educational picture awaits development\nof a comprehensive. Integrated, country-wide research program which\ncan be systematically Implemented over a period of years, locally,\nresearch personnel connected with educational radio and television\nstations, production agencies, and closed circuit developments,\nface frustrating problems resulting from significant and complex\nneeds on the one hand and inadequate financial and human resources\non the other.\nReacting to a rising tide of requests from college, university and\npublic school radio-television departments, BAVl, UNESCO, and others,\nthe NAEB Research Seminar, through the NAEB Research Committee, ceiled\nupon the NAEB to set up a Department of Research, headed by a qualified\nResearch Coordinator. This request is responsive to that need.\nThis Research Department will coordinate and consolidate the results\nand significance to education of all studies in closed and open circuit\nTV and radio; in credit, enrichment and general adult education; In\nImpact and effectiveness In the broadcast discussion, public affairs and\ninstructional areas rather then merely in audience size; in utilization\nas well as In production; in specific techniques and formats as well as\nin general uses; In teacher and administrator problems as well as In\nprogramming; In International as well as national applications. The\n- 10 -"
}