{
  "id": "d981-12",
  "text": "It is our belief that each activation will cost, in consultant manpower and\nexpense, some 6 months to 1 year, at an estimated $15,000*00-120,CXX).00 per\nstation* Five to ten stations per year should be possible of activation on\nthis basis, or a total of 50 to 100 additional STV stations within the next\nfive years*\n(additional comments to be added)\nSsBda&sg-ggMaa.*\nIn order that the NAEB may be wholly frank and honest regarding its fiscal\nmatters, copies of all grants to date are enclosed herewith (Committee* these\nare in Annual Report; please bring it along!)\nAlso enclosed is a copy of our annual budget based on fees received from\nNAEB members* (Bob Coleman may have to prepare a special one for this\npurpose —. to show use of funds to make up Journal and newsletter deficits\netc)* As will be noted, these funds are used essentially for NAEB Legal\nCounsel; NAEB memberships in the ACE, European Broadcasting Union, Prix\nItalia, International University of the Air, Council of National Organizations,\netc* The modest balance in this budget was also rather seriously depleted\nrecently for travel funds needed for emergency NAEB Board meetings and other\nexpenses for which funds were not available from either our Kellogg or Ford\ngrant budgets* ETRG grant funds are used principally for expenses of the\nNAEB'S (ETRC) grant-in-aid committee, and are largely liquidated each year.\nIn spite of valiant efforts to become self-supporting, the NAEB still has\nfar to go. Each increase in dues and/or network fees inevitably results in\nsame drop-outs, so thinly budgeted are most stations, principally radio. In\nthe educational broadcasting movement*\nAs stated earlier, the NAEB stands ready for ary scrutiny, or discussions\nregarding any possible recombination of organizations and functions* The\nsurvival and advancement of the total movement are far more vital to American\neducation than the survival, as such, of the NAEB, However, it is our belief\nthat its thirty-three year history and accumulated experience and human\nresources can be invaluable in any steps or recombinations to be considered*\nSince the NAEB is the sole organisation representing radio as well as television,\nand since it believes firmly that radio will com© into its own, with television,\nas a widely used, economical instructional tco?4 insurance that radio uses\nwill be developed and promoted, as adjuncts ana, sometimes^stepping stones, to\ntelevision, would also be moat strongly ireis^d^u^aa*^\nThis is not to say that the NAEB does not recognize the greater urgency of\nthe crisis in television than in radio* As far as they are divisible, at\nleast 75% to 80$ of the funds requested above would be expended on television,\njust as the greater proportion, by far, of present energies are devoted to\ntelevision. But in some cases, radio may be usefully promoted, and educational5s\nonly frequencies in radio, which are 5M, are also in jeopardy. Therefore the\nNAEB would wish not totally to neglect radio, in the proposed service, all\nthe other agencies at present being wholly or almost wholly television only\nin their emphasis*"
}