{
  "id": "d981-145",
  "text": "April 29, 1958\nmay\ni\n2\n■ 5 /,• ;\nMl\nHarry J. Skornfa, Executive director\nNational Association of Educational Broadcasters\n14 Gregory Hall\nUniversity of Illinois\nUrbane, Illinois\nCn\\\nAs you know, after receiving your April 25th letter In re progress of\nNAEB-Ford Foundation relationships \"since John Weiss' death and McBride's\nword that Faust has been . . . Ill\" I called you to report the following:\n(I) I have talked with Or. Alexander Stoddard on two different\noccasions since the Weiss tragedy. The first meeting was a\nday or so after the accident at which time Stoddard reported\nrather complete confusion in the Ford offices and concern\nthat the multitude of projects (which Weiss with his virtuoso\nskill had kept in balance) could be properly re-assigned\nadministratively. The difficulty—one man who could duplicate\nthe performance.\nThe obvious possibility that no such man would be found\nquickly and that the various tasks would probably be \"distri¬\nbuted\" led me to call you and ask that you and Schooley prepare\na \"short-time, minimum request\" (equivalent to last years) on\nthe basis of an interim period would occur and that we should\nbe ready if such proved to be the case.\nThursday in Washington, D.C., Stoddard advised that Or. Alvin\nEurich would have general supervision of this area and he\ntherefore represents the prime contact.\n(2) Saturday afternoon I received a letter dated April 25th from\nLester W. Nelson, Executive Associate, The Fund for Advancement\nof Education (copy attached) noting the NAEB-FF negotiations\nand suggesting a discussion in New York on May 7th or May 9th.\nFollowing our conversation, I discussed the matter with Paulu. We tentatively\nagreed to have an NAEB representative meet with Nelson in New York on May 9th\nand I have written Nelson to this effect. Since Eurich now enters the ^\nequation. It might be advisable to leave a line open so that Paulu as presl- ^\ndent could independently contact him If this seems advisable. Meanwhile, I\nsuggested to Paulu that an Interim budget be drafted and ready to submit If \\\nthis should seem advisable.\nSincerely,\nRBH/mh\ncc: Paulu,\nRichard B. Hull, Director\nRadio and TY Broadcasting\n<i/\n1 ey,'Chadeayne, Miles\n/"
}