{
  "id": "d981-168",
  "text": "-5-\n* ,*\nBefore the meeting we had been told that no one in the town would talk about the\nschoolo It was too much of a ”sore spot*” And if there was talk it would certainly\nbe confined to careful expressions of majority opinion* We would hear no dissident\nelements, we we re told.\nIt is easy to imagine our pleasure, therefore, when the first man to speak said\nhe was in favor of some kind of school district reorganization, a viewpoint which,\nto say the least, is not very popular in Cambridge. It took some time to get a general\ndiscussion started* And it is true that most of the talk skirted the real issues* But\nthe people of Cambridge, the typical apathetic community, the community which did not\nwish to be reminded of its problem, did get up and for two hours did talk about the\nproblem of their school* And at the end of the meeting they voted 55 to 1 to appear\non our television program*\nA few days later we viewed the film of the meeting. We watched the men and women\nof this town stand up and talk about their school and their community* We saw their\nnervousness, their hesitation, their embarrassment. It had probably been a long time\nsince anyone had asked them what they thought — and stayed for the answer. When\nLarry Gardner got up and cracked his knuckles and said — ”A man came around here\na couple of years ago and said all the whistle stops will have to go* Well, I don’t\nbelieve that; I don’t believe that’s true at all” — when we saw this, we were seeing\na magnificent bit of acting by a man who had spent a lifetime preparing to play\njust one part — himself.\nWe found prejudices in Cambridge, and much misinformation. But above all we\nfound honesty and simplicity and great dignity — all material for a new kind of\ntelevision program.\nI have tried to describe in some detail our experience with the town of Cambridge.\nI have tried to give some idea of the excitement of these first events as we lived\nthem and as we feel they will appear on the television screen • But I have spoken at\nthis length becase we of the Fund for Adult Education project feel that we have found\nmuch more than just the material for good television. We believe that we have found\na method which, if properly exploited, can become a new and tremendously effective\ntool in the re-education of a people in the processes of their democracy.\nWhen we entered Cambridge, we found an apathetic dispirited c annum! ty, afraid to\ndiscuss its problems. In the past few weeks we have watched a ferment grown in this\ntown. We have watched people as they began to talk about their problems — in the\nopen — for the first time. This talk need not — must not — end with the television\nprogram* At this moment we do not know what direction this process of involvement\nwill take. But this much we do know: By using the glamour and the excitement of present\nday television, we can — literally — start a whole town talking.\nNow that I have given soma idea of the material out of which we hope to create\nThe Whole Town’s Talking, let us consider the project’s second responsibility.\nEach week our program must present the facts about a particular subject — in our first\nshow it is the problem of the|rural high school. This means there must be a clear\ndefinition of that problem and statements of the alternative ways in which it may be\nsolved.\nWe do not pretend that television can alone cariy the full burden of subject matter\npresentation* Perhaps the greatest thing television can do is to stimulate the viewer"
}