{
  "id": "d981-171",
  "text": "These four people, then, were brought to give Cambridge the benefit of their\npersonal ejqperienees and the experiences of their towns insolving a problem similar to\nthe one Cambridge now faced: declining enrollment, limited curriculum, rising per\npupil costs. They did not meet with the Cambridge people until dinner an Thursday\nevening, and then only socially* To increase the spontaneity of the broadcast, there\nwas no discus si on of the school problem until the program itself began, 3a ter that\nevening.\nWith the exception of a half hour warm up period just before the start of the show,\nwe had now gone through all of our pre-show tactics. Before I go into a discussion of\nthe actual production, I should like to consider the last element in the development of\nour total pre-show process: outside involvement.\nPresent at our first town meeting in Cambridge was Carlyle (huger. Story County\nExtension Agent. After the meeting he spoke to us, saying that he was interested in\nforming a group to discuss public affairs issues. He thought that the film showing\nCambridge people talking about their community problems could be used to get people in\nother parts of Story County interested in forming such a group. We suggested to him\nthe possibility of assembling a group to watch our television broadcasts and hold dis¬\ncussions based on what they had seen, examining the problems as they appeared in\ntheir own communities. Mr. Gouger was very enthusiastic about this idea and promised\nhis full cooperation. At 8:00 on the night of Noventoer 15, 35 men and women from all\nover Story County took seats in front of a monitor in Studio A of Station WOI. They\nknow little of what they were about to see. They had, in fact, no idea that a television\nbroadcast was about to take place in a studio just across thehall.\nWe hoped to learn a gsod many things from tbs reactions of this first of our\n’’town-talk\" groups. But basically the problem was this: Cambridge was talking about\nits problem. Would this talk, on television, start other communities discussing their\nown similar problems?\nII — Production: The Dry-Run\nWQI-TV television truck going down highway 65.. .Turns left on to gravel road.•.\nTurns lefFa^n past road sign: CamhHdie, ! mile...Drives through railroad under¬\npass. • .As it pulls up in front of school house, sign on truck side gomes into focus:\nThe Whole Town*a Talking\nTown Toni^it: Cambridge, Iowa\nSubject: School Reorganization\nModerator: Ralph Imes\ndissolve into school room"
}