{
  "id": "d981-172",
  "text": "The show begins on film* The impression is simple: WOI-TV is bringing television\nto the towns• The dissolve takes us into our studio school room set* Fifteen people,\neleven from Cambridge, four from other towns, are seen at desks talking to one another*\nOn the walls of the roan are drawings and posters from the Cairb ridge school* George\nWashington looks down from one corner, a safety poster from another* On the floor and\non chairs at the sides are children from Cambridge* The television eye moves slowly\naround the roan, comes to rest on a middle aged man with glasses, his hand cocked to\nhis ear as he listens to the woman next to him*\nA voice says: Well, I see O.M. Lewis made it* Glad to 3ee him here tonight*\nHe*s still got his com to get in. Com1 s late this year and O.M.’s a little\nworried about it. If he’s left his farm to come and talk about the school problem,\nit really must be' important to him* ~\nA sign is superimposed over Lewis* face. It reads: O.M. Lewis, Faun Bureau\nMember* The sign is tacked on a mail box. A hand reaches into the box and pulls\nout a letter* The studio set fades out* We are back into film again. We see O.M.\nLewis in his work clothes, walking to his tractor with the letter stuffed in his\npocket. Later we see his daughter and a bit of his farm. The voice explains where we\nare. It explains that Lewis* daughter goes to the Cambridge school as a tuition stu¬\ndent. Twice a year, Mr. Lewis gets a tax receipt in the mail and that starts him\nthinking: Is his dau^iter getting the best kind of education in Cambridge? (says the\nhidden voice). Some of\" his nei ghborsT^e^lazklns, the \"lees, the Heggens, have sent\ntheir kids to larger schools nearby. They' say' they get a better education thereo\nThe function of this film sequence, and two others—one on the town banker,\nanother on a student—is to show the school problem as a personal problem of the people\nin the studio* First, we demonstrate their reality as people by showing them dressed\nin their ordinary clothes, doing their ordinary tasks* We show the banker walking his\nchildren to school, and then at the teller’s window cashing a check* This man—Harry\nCairns—has wo iked hard to become a success. If the Cambridge school closes, his\nbusiness may be hurt* At the same time, he is concerned about the education his\nchildren are receiving in that school. When Harry Cairns speaks in the discussion, we\nwill listen carefully to what he says because wa know he is faced with a real problem*\nIf we were acquainted with Cambridge and its people, we would need no introduction\nto them and their problem* But we are strangers* We willjonly see these people for a\nhalf hour. It is necessary, therefore, to meat at least some of them quickly, to find\nout who they are and what their personal stake is in the problem of the town* If we\nknow these things, then their discussion will gain in interest and meaning, and the\npresent half hour will encompass some of the values of ten, or twenty, or thirty years\nof life in an Iowa small town*\nAfter the four minute film introduction we meet our moderator* He explains that\nthe people of Cambridge are here tonight because they have a problem* They*re going\nto talk about it, and then they*re going to make some decisions about it* But before\nthey can make decisions, they’ve got to know something about the alternatives. He\nasks four cambers of the group to give the good aid bad points of each of the four"
}