{
  "id": "d981-180",
  "text": "->\nA second panel will be composed of \"expert\" judges. It will include specialists\nin television production and in the subject matter area under discussiono Members\nof the expert panel will be asked to write critiques of the program.\nA third appraisal method will employ \"buzz groups.” A group of 30 to 50\npeople will be assembled to view a discussion program. Following the program the\ngroup will be divided into several sub-groups of 5 to 8 persons. Each sib-group\nwill be assigned one particular element or aspect of the program for an intensive\ndiscussion and evaluation. Each sub-group will be asked to reach a concensus on\nthe point it was assigned to discuss.\nThe entire group will then be reassembled and each sub-group will report its\nfindings. The entire group will discuss the findings of the sub-groups and, with\npreliminary work accomplished by the sub-groups, the whole group will arrive at\nsome concensus regarding the program aspect being evaluated.\nThe buzz group technique provides both a systematic and comprehensive group\nevaluation of the program. It complements the other audience reaction procedures\nexplained above.\nRecapitulation\nUp to this point we have outlined the procedures we expect to use in accomplishing\nresearch objectives 1 and 2. For the most part, the techniques proposed have\nbeen developed and tested by long experience in the radio and television industries.\nThey are routine techniques which serve important functions. But they are not\nadequate for measurement of the really crucial effects we expect the discussion\nprograms to have on the viewers.\nTo accompliresearch objectives 3, therefore, we are proposing a series of\ncommunity case studies using a number of intensive rather than extensive techniques\nof effect measurement.\nProgram Impact\nThe F. A. E. television discussion program project has a unique opportunity to\nmake outstanding contributions to the field of educational broadcasting. The project\nas an educational television pilot plant operation can make many obvious contri¬\nbutions to knowledge in the area of production-—techniques, costs, etc.\nBut there is a more striking contribution which this experiment in educational\ntelevision can make. It can demonstrate exactly how and to what extent television\nas a medium can be used as a tool to stimulate and facilitate democratic action.\nEducational television stations, in particular, are admirably qualified to use\ntelevision to this worthwhile end. Resources of the institutions they represent-\nspecially trained personnel, authorities and facilities—are ready and anxious to\ntake advantage of the stimulation provided by the television program, furnishing\nguidance and leadership in the democratic solution of community problems."
}