{
  "id": "d981-181",
  "text": "-1*-\nIt will be fine if our research shows that many people view our discussion\nprograms; it will be still better if we find that they enjoy them® But our research\noperations cannot stop at this point l\nWe must find out to what extent our programs are more than half hours of\nentertainment* What is their impact? Do they make people think about their prob¬\nlems? Do they cause people to talk about their problems? Does television directly\n(or indirectly) deliver the impact which leads to democratic action?\nIf the answer to these questions is f,yes” we will have turned up facts of\nexceedingly great significance for the future of educational television® Research\nwhich finds answers to these questions is certainly worth doing®\nCommunity Case Studies\nOne of the two series of discussion programs is entitled ”The Whole Town*s\nTalking*” Programs in this series will present discussion of typical local com-\nraunity problems l^y people from Iowa communities where these problans exist® Per¬\nsons from one or two specific communities will carry on each discussion®\nFor example* community A»s problem will be the subject of one program.\nPersons representing various points of view in community A will appear on the\nprogram and it will be A*s problem they discuss® However* A»s problem is also\na problem in many other communities®\nIf the theory behind this program format is sound, the discussion should get\n'the whole town (community A) talking” about its problem. IJoreover* communities\nB, C* D* etc. with the same kind of problem should also be stimulated to begin talk¬\ning about their problem®\nCommunity case studies are being planned to measure to what extent the program\nfeets the whole town talking* thinking and acting® Towns which are represented on\nthe programs as well as similar non-program towns will be studied.\nThe programs* impact will be measured in terms of such factors ass (1) the\nkind and amount of “talk\" and discussion stimulated, (2) the kind and amount of\nlearning which takes place, (3) changes in attitudes and opinions with respect to\nthe problems* and (1*) communications behavior relevant to the problem, e.g.* read¬\ning about it* listening to programs about it* etc*\nIn addition, careful observations will be made of (1) newly organized com¬\nmunity activity with respect to the problem, (2) press reports of community senti¬\nment and action, (3) activity of governmental units where appropriate in handling\nof the problem* and (h) direct action by the community which leads to a resolution\nof the problem* e.g®* regular and special elections* ordinances* reorganizations*\netc.\nConclusion\nDuring the period of the present grant it will be possible to do a consider¬\nable amount of research to accomplish objectives 1 and 2 of the research plan*"
}