{
  "id": "d981-42",
  "text": "Page 2\n6) If those objectives are to b© achieved* oar Association must be\ntransformed into a nation-jwide sxrvsaasnt and effort* guided by and listening\nto th© best Kinds in our nation* As educators and educational leaders\nwe naist here propose* and resolve to perform* In a Banner worthy of the\nmodes of our age —» or abdicate to others who can and will do so.\n7) We need to counteract the concept of education* now so often falsely\nconceived of as odd bits of infaraatlon or culture* or \"success gimmicks\"\nainasd at increasing the individual0 s inccmia-earning potential or popularity.\nWe need to resist the concept of science as essentially \"vocational\neducation.\" We need to thjrfr of education as an organized* life-long\neffort* to enable to realize as richly and fully as possible* his\nfull fcusan potential for citizenship in a free society.\n8) Th® eyes of millions of people in new-born and backward nations are\non us. They look to us for leadership.\nHow we use mass media in our present situation will in part determine\nwhether or not we as a nation deserve or continue to exercise world\nleadership. The influence which educational television and radio (if\nadequately developed) can exert in this total problem should not be\nunder-estimated •\n9) Though far b^hfad us in this area now* within the next ten years* it\nis our belief that Russia will be illustrating to th© world what can be\ndone with radio end television as a part of their educational system.\nWe would hope that it will not take a Sputnik in this educational are©\nas well* to awaken us* and cause us to beccsa© organized in making maxim®\nuse of our presently superior electronic resources.\nID) There can be no serious question in the minds of intelligent people\nregarding the superiority of democracy* based on belief in the importance\nof the individual. But, to quote Woodrow Wilsons \"Democratic institutions\nare never done-*— It is a strenuous thing this of living the life of a\nfree people3 and we cannot escape the burden of our inheritance.\"\nHowever the part we can plsy in meeting th© educational needs of\nour nation bod the world may be* we must onset it wisely* courageously*\nand promptly.\nHJS/dc\nJanuary 17* 1958\nMSB Headquarters"
}