{
  "id": "d981-8",
  "text": "Pago 7\n\"Nationally, an appraisal of the impact of educational broadcasting end its\nsole in the total educational picture awaits development of a cemprehanBive,\nintegrated, country-wide research program which can he systematically imple¬\nmented over a period of years. Locally, research personnel connected with\neducational radio and television stations and production agencies face\nfrustrating problems resulting from significant and complex seeds on the\none hand, and inadequate financial and boson resources on the other.*\nIn its closing aesaiaMU xhs^flwrtliar of Research leaders of tbs U. S. and\nCanada called upon the HUSB to set up a Department of Research, beaded bar a\nqualified Research Coordinator.\nThis request is responsive to that need Us well as to the needs, referred to\nearlier, from UNESCO, the European Broadcasting Union, and educators and\nbroadcasters both in the U. 3. and abroad. Such a department will solicit the\naid of, and cooperate with, \"all governmental and non-goveiTBaental agencies\nwhich might contribute to the national advancement of research in educational\nbroadcasting. * ^\nThis Research Department will coordinate and consolidate the results of all\nstudies t in dosed and open circuit TV and in radio* in credit, enrichment*\nand general adult education* in impact and effectiveness rather than merely\naudience size* in utilisation as well as production; in specific techniques\nand formats as well as in general uses* in teacher and administrator problems\nas well as in programming.\nThe tradition and record of the HAEB in fundamental research is well known\nand respected. The benchmark studies of U. S. television done under the\ndirection of Dr. Dallas Scythe and others illustrate the quality of research\nand publication envisaged.\nInitiative as well as coordination will he a function of the Coordinator of\n—> Research. C This function will not conflict with the functions of the ETRC or\nother organisations in research. In fact it will welcome the continuing\n^activities of the Center in the national program and audience areas, as it\nwill welcome Increased research on the part of the many other organisations\nwhich must engage in various specific types of research to guide them in their\nown planning. Unlike the ETRC, however, which generally sponsors rather than\nitself conducts research, the MSB will conduct national studies Itself when\nneeded, as well as sponsoring seminars and workshops in this area.-T\nThe budget proposed for this NAEB function ie atf follows s\n$]i,ooo.oo\nL, '5,000.00\nCoordinator’s salary\nv—Editorial Assistant\nStenographer\nRetirement and W.\nTravel\nSupplies and Expenses\nResearch Grants-ln~Aid\nSeminars and Wj\n'Publications'\nTotal\n. ^,600.00\n> 2,000.00\n2,000.00\n4*000.00\n20,000.00\n20,000.00\n5,000.00\n§73,400.00\nSuch a research <*!»****>£ house function will insure that the breaan and financial\nresources now going into the movement are coordinated, and reported so they may\nall be used to bsst advantage."
}