{
  "id": "d981-98",
  "text": "-10-\nNPAC: The National Project for Agricultural Communications\nNAEB relations with this project are well known for their cooperative\nand friendly nature. We assist members of the NPAC staff whenever we can\nbe of help in planning or conducting seminars, studies or other projects in\nthe wireless media, and exchange publications, materials and ideas with them\nregularly.\nNUEA: The National University Extension Association\nEach year, including 1956-57, the NAEB has accepted the NUEA invitation\nto be represented on appropriate panels and committees at its national conven¬\ntion. The NUEA is also represented on the NAEB Organizational Liaison Com¬\nmittee .\nRFE: Radio Free Europe\nWe have cooperated with this group during the year in its Crusade for\nFreedom, though less intensively than with the official U. S. Information Agency,\nthe Department of State, and other official offices of the U. S. Government.\nRAI: Radio Italiana; the Italian Broadcasting System\nWe exchange publications with RAI and the Newsletter and Tournal are\nheavily quoted in each issue of the RAI Tournal. We have also received several\nfine program series from RAI, which has provided a splendid office overlooking\nthe Tiber, in its new Broadcasting House, for an NAEB representative each year,\nso far provided through the Fulbright program. RAI also sponsors the Prix Italia\nfor those classifications in which it does not have programs entered, has twice\nwon first awards, and NAEB past president Seymour Siegel was last year’s\nchairman of the Prix Italia conference.\nRDTF: Radiodiffusion-Television Francaise; the French Broadcasting System\nRDTF has spared no effort or expense to produce \"tailor-made** pro¬\ngrams requested and needed for the NAEB Radio Network. Like RAI, it is a\ngenerous and gracious host to the NAEB’s annual Fulbright scholar who is also\nthe NAEB Liaison representative on the spot to the RDTF. The RDTF’s Madame\nPaz, a distinguished author as well as broadcast official, who is in charge\nof the NAEB-RDTF program exchange, was a keynote speaker at the 1956 NAEB\nConvention, and has indicated her interest in returning for the 1957 conven¬\ntion .\nSAA: The Speech Association of America\nThe Executive Director has been a frequent speaker at national conven¬\ntions of the SAA. The NAEB Associate Director, Engineer, and other representa¬\ntives have also this year appeared on the programs of various regional and\nstate conferences of the Speech Association."
}