{
  "id": "d1433-0",
  "text": "March, 195^\nPresident’s Page\nEvery month presents some new problem in getting this page ready\nfor' The press. This is being written in Columbus, Ohio, home of WOSU-\nAM-FM-TV. It just happens that your president is here to see the Illi¬\nnois ‘- Ohio State basketball game, and to see th-at our broadcast goes\no,k.' This was to have been written in Urbana yesteroay. My notes are\nTHERE, LEFT IN HASTE TO CATCH A TRAIN WHEN THE WEATHER TURNED UNFAVOR¬\nABLE FOR FLYING, FROM HERE I GO TO lOWA ClTY TO ATTEND THE AMERICAN\nCouncil on Education’s Closed Circuit Television Conference.\nThat’s one meeting. There are others coming up. Some are sched¬\nuled. Others are to be scheduled.\nYour prexy will attend meeting of the Joint Council on Educational\nTelevision in Washington, March 28. Actually, he expects to see Ex¬\necutive Director Ralph Steetle before that date. Ralph will be in Iowa\nCity, too. So will Center president, Dr, Harry K. Newsurn.\nKeith Tyler’s Institute is coming up in mid-April. Dates are\nabout April 17, 18, and 19, if I recall correctly. Center affiliates\nWILL BE MEETING APRIL 15 AND l6. THE NAEB BOARD OF DIRECTORS WILL\nBE MEETING APRIL l6 AND 17. THERE»LL BE AN NAEB MEETING DURING THE\nInstitute, probably a luncheon. Details later.\nThat same week the Music Educators National Conference will be\nheld In St. Louis. Your president is on the MENC’s Commission. He’ll\nFIND IT DIFFICULT TO DIVIDE THE BODY BETWE’EN COLUMBUS AND St. LOUIS.\nMarguerite Fleming ano gang in St. Louis are working on special NAEB\nEXHIBIT FOR THAT CONFERENCE.\nThere are thoughts and plans being given to the NAEB National\nConvention which will be held mid-October in Atlanta. By this time\nNEXT MONTH, WE OUGHT TO HAVE SOME MORE DEFINITE DOPE FOR NAEB MEMBERS.\nAlso within this year there’ll be some NAEB sponsored seminars\nAND WORKSHOPS, IN BOTH RADIO AND TV, WE OUGHT TO HAVE SOME MORE DEFI¬\nNITE DOPE ON THEM, TOO, A MONTH FROM NOW. AND, TWO OR THREE REGIONAL\nCONFERENCES. WE’LL KEEP YOU POSTED, AND TRY TO GET YOU DOPE AS SOON\nAS POSSIBLE.\nYour president spent sometime with NAEB’ers in Lansing in mid-\nFebruary. Had chance to talk over problems and progress with guys\nlike NAEB Treasurer Bob Coleman, Armand Hunter, Irving Merrill and\nothers .\nIncidentally, responses to B&B proposal for NAEB Radio Network,\ncarried on this page a month ago, have all been good. Barring fil¬\nings OF MAJOR OBJECTIONS, WE’LL NOW PROCEED TO GIVE SUGGESTION FUR¬\nTHER STUDY, AND IF POSSIBLE ACTIVATE THE B&B FOR THE NETWORK MEMBERS.\nI REALLY BELIEVE SUCH A PLAN CAN BE OF GREAT HELP TO NETWORK MEMBERS."
}