{
  "id": "d1797-11",
  "text": "NASB NEWS LETTER,.... SEPT 15, 1940 o..,Page 12\nJuliet Forbes, Radio Council, Chicago. Illinois\nLavinia S* Schwartz, CBS, Chicago, Illinois\nKay Searles, Northwestern. Evanston, Illinois\nWaldo Abbot, University of Michigan, Ann Arbor, Michigan\n0* J» Neuwerth, Radio Council, Chicago, Illinois\nKaryl Kanet Chipman, WHA, Madison, Wisconsin\nJack Stiehlg WHA, Madison, Wisconsin\nWerdell Pa Loveless, Vi/MBI, Chicago, Illinois\nHarold L. Lundquisfc, WMBI, Chicago, Illinois\nHarold a. Engel, WHA, Madison, Wisconsin\nW0 Do Boutwell, U*S» Office of Education, Washington, DoC*\nS. Ho Evans, NCER, New York City\nMarge Kertes, Joliet, Illinois\nIOWA TO HOLD RADIO CONFERENCE\nThe State University of Iowa has announced plans to hold the First\nAnnual Radio Conference in Iowa City on October 17-190 The conference,\ndealing with problems of applied radio, will be of interest to\nrepresentatives of independent and network stations, to educators,\nadvertising agencies and various organizations and individuals intereste\nin radio•\nFOURTH SCHOOL BROADCAST CONFERENCE\nA tentative program schedule for the Fourth School Broadcast Conference\nwhich will be held December 4-6 in Chicago, has been announced by\nHarold W. Kent, Director of Chicago’s Radio Council* You5IX all\nreceive data direct from Harold and later Information will also appear\nin the News Letter^\nINCREASED POWER PERMIT\nThe long sought improvement of KOaC, the state-owned radio station at\nCorvallis, has been brought a long step nearer realization through the\ngranting by the federal communications commission of the petition to\nincrease the KOAC power from 1000 to 5000 watts daytime service, accord¬\ning to officials of Oregon State college, licensee of the station,,\nApproval of the power boost opens the way for the state board of higher\neducation to make use cf the appropriation made by the 1959 legislature\nfor the construction of a new and modern transmitter on college property\nseveral miles north of Corvallis* The appropriation has been unused\npending action by the commission on the long fought effort of the state\nstation to protect its wave length and modernize Its facilities*\nRegarding the wave length, the comission had previously ruled that an\nArizona station, K0Y, would be permitted to use the 550 kilocycle band,\nbut limited that station to 1000 watts and promised that \"if objection*\nable interference should develop* »,. * •the commission will enter an\norder requiring appropriate protection*\"\nKOAC engineers submitted four complete engineering plans before all\nobjections of the navy department and others to the proposed expansion\nwere removed* The plan accepted calls for a directional antenna to\nprotect the Tongue Point naval base* This design will be a real benefit\nto most KOAC listeners, however, as the daytime signals to the north,\neast, and south, where most of the population is, will be increased\nabout five times, while the modern equipment and increased power will"
}