{
  "id": "d1797-14",
  "text": "NAEB HE'./S LETTER.. ..SEPT 15, 1940... .Page 15\nThis executive committee will then set up a central office with a staff\ntrained in all phases of radio, and with studios and recording equipment\nfor the purpose of producing programs for broadcast. Standards for such\nprograms will be kept high for we must admit that we are, whether we\nlike it or not, in competition for the listener against programs of a\nhigh entertainment quality. While some of these programs will undoubt¬\nedly be carried overV/NAD at the University, it will also be the aim of\nthe council to make programs available through transcription to other\nstations of the state in order to secure wider listening audiences«\nOrganizations that become members of the council do not in any way lose\ntheir freedom of action in broadcasting other material. The council\nwill simply serve to give wider circulation to exceptional programs and\nwill see to it that any program bearing its stamp of approval shall\nhave a high degree of excellence.\nIf such a council is eventually organized for Oklahoma, undoubtedly the\nUniversity will play a prominent role along with other major educational\ninstitutions of the state in carrying out its functions; and it is\nbelieved that such a progressive program would result In tremendous\nimprovement of the quality of public service broadcasting now carried\non by various agencies throughout Oklahoma in a desultory and largely\nunsatisfactory manner.\nAt a recent meeting^ August 15, of the planning committee a program of\nthe next conference to be held on October 22 and 23 in Oklahoma City\nwas planned and the details of the inventory were worked out\niflTHOU, CORNELL U. . IYAS WE SO\nMichael R« Banna, General Manager of V8HCU* wrote President Ingham:\n\"Both Professor Charles A. Taylor and myself regret very much our\ninability to attend the N.A.E.B. Annual Convention. I am sure that all\neducational broadcasters, especially at this time, will gain much from\nthe work you will do this week.\n\"',fe are now building new studios for V/HCU and this task, together with\nthe many duties connected with the organization of this‘set«up, of\nnecessity confine me to Ithaca.\"\nAlthough JHCU, which was formerly iVESG, has always been owned and\noperated by Cornell University, the major portion of the time alloted to\nthe station was sold by the University to the Elmire Star-Gazette for\nabout seven years, 1933-1940. During this period, the principal studios\nof the station were located in Elmira, the station’s transmitter remain¬\ning in Ithaca®\nOn June 3rd, 1940, Cornell’s radio station acquired a new status® In\nan effort to coordinate the important university functions of radio\nbroadcasting, a cancellation of all contractual relations with the\nElmira Star-Gazette was effected as of that date, and the studios of\nthe station moved back to Ithaca.\nCornell University has long been cognizant of the fact that day by day\nradio grows in its significance in the general field of human relations.\nThe University has noted, too, that well over two hundred educational\ninstitutions in the United States have built their own radio stations\nand made radio educational broadcasting an Integral part of their\neducational activities® The University has long realized that every"
}