{
  "id": "d1797-18",
  "text": "NAE3 NEWS LETTER....SEPT 15, 1940....Page 19\nThree other institutions were previously licensed, to use AM (amplitude\nmodulation) on the channels set aside for non-commercial educational\npurposes. Th©3r are the Mew York City Board of Education, the Cleveland\nBoard of Education, and, more recently, the University of Kentucky.\nENTER RADIO AT TEXAS U*\nA key is being forged at the University of Texas to unlock the door of\neducation for every man, woman and child in Texas.\nThat door is radio, and the key is the indexing of Texan’s radio listening\nhabits now being charted by University educators.\nHaving found the Southwest in the lowest bracket of the country’s regions\nin quality and quantity of radio programs of an educational nature, the\nUniversity has set about to remedy the shortcomings.\nFirst step in the long-range undertaking was the establishment in\nSeptember of Radio House, a campus studio, at the University of Texas,\nfrom which one twelve-week series of educational broadcasts originated\nalong with other individual programs of an educational nature. Other\ncolleges in Texas likewise broadcast programs during the year of an\nimproved educational quality.\nThe second step was the completion of the University’s Bureau of\nResearch in Education by Radio of a scientific analysis of Texas listening;\nhabits made under controlled oonditions.\nThe survey was taken by Dr. A. L. Chapman, director of the Bureau,\nusing the university-produced series of twelve broadcasts on Texas\nnatural resourses - '’Frontiers of Progress\" - as the control program.\nListeners, totaling 11 per cent of those queried by the survey, almost\nunanimously reported to Dr. Chapman that the series piqued their interes ;\nin the development of the State’s resources.\nThe poll revealed that listeners; (1) feel a need for such educational\nbroadcasts as the \"Frontiers of Progress” in their radio diet; and\n(2) that, they believe the University should continue to push education\nby means of the radio.\nIn laying a broad foundation for further program production, Dr.\nChapman found;\n1. At least 75 per cent of the listening audience for the \"Frontiers of\nProgress\" series was composed of adults.\n2. Of these listeners 5 to 50 per cent were professional and business\npeople.\n3o Approximately 40 per cent of the persons notified of the broadcasts\nthrough printed announcements listened to one or more programs.\n40 Eighty-seven per cent of the listeners preferred that all or part of\neach program be dramatized.\n5. Approximately 30 high school teachers used the series in their classes."
}