{
  "id": "d1797-3",
  "text": "NAKB NEWS LETTER.....SEPT 15, 1940 „...Page 4\nof 22 news letters, appearing at LaGuardia hearing before FCO;\nsolicitation of prospective members; negotiations with FOG on possible\nmodification of FCC annual financial report forms and use of trans¬\ncribed and recording announcements, and the usual routine of corres¬\npondence.\nOpening the convention program with a few \"remarks'* President Harold\nG. Ingham rang the keynote of the meeting with a challenge to educational\nbroadcasters to accept the burden of educating for democracy in a\nworld war-weary and in turmoil. Quoting it. S. Novik, he said, M,that\nhere we have a democracy in which, radio can educate, can be a force\nfor the common good.1 ,f\nJohn Chancellor, adult education specialist of the American Library\nAssociation and Parker Wheatley, radio director for Northwestern\nUniversity, presented an informal discussion of problems confronting\nboth public service agencies. Ways and means of supplementing radio\nprograms were offered and criticized. Out of the discussion came a\ngenerally expressed feeling of speakers and audience that service of\nboth could be greatly increased with greater cooperation through\nactive joint organization.\nEDUCATIONAL SCRIPT '\"KITING\nBy George Jennings, Continuity Editor, Radio Council, Chicago publlc\nSchools\nThe position of the educational script writer is almost that of my\nlittle girl, who is just at that age where she loves to pretend that\nshe is someone else,4 particularly when she has pulled a boner or has\ndone something she shouldn't have. Her present alter ego is a Liss\nJones, or Jonesey. ,,,?e had just completed painting a bedroom and before\nthe paint was fairly dry Barbara did a little artistic work of her\nown on the wall with a spoon. VJhen her uncle ?jent in to view the\ndamage Barbara, on the defensive at once remarked, \"Pm Jonesey* .Barbara\ndid that. If you catch he© give her belli\"\nWhile my analogy may not altogether holdij too many writers are inclined\nto think particularly about educational scripts, that X m a writer.\nAn educational scriptwriter did that If you catch him give him\nhell.11 There’s no need for this feeling about script\nmany educational writers do not think of themselves as professional\nwriters in other words they confuse the term \"proiessional” and\n\"comrexciai\" And too many educational script writers, yes, even\nthoaerhoare working eveiy day at a kind of script writing have\nnever been trained. There is a fallacy in modern education that a\nSS'o.‘Si4Si,S1mii5IS1‘S5otSk!of S'&iSE SSS\nall experienced this. After every summer school course we offer in\nwriting...a six weeks course mind you, in which even the best of\nteachers could only hope to touch, on the major aspects Oj. v/riting,\nthe office is flooded with scripts and former students wanting to\nwrite. And when questioned about experience, training and the like,\nevery applicant says, ,fI have taken a course.M"
}