{
  "id": "d1797-7",
  "text": "NAE3\nNEWS LETTER.... SEPT 15 , 194C....Page 8\n(So far, so good=) and are chatting with a neighbour about the\nsecuring of a cook or a housekeeper, for the neighbour, when a\nman and three women come from, one of the apartments using\nprofane language and threatening violence» Jane and Joe ask\nthem to leave the premises (Joe probably also profane) and a\nfist fight ensues between the stranger and Joe. Jane, in an\neffort to stop the fight pretends to call the police and when\nthe ruse has no effect she actually calls the police. Neighbors\nfrom some of the other apartments come out into the lobby to\nsee what the noise is all about, two of the men ask Joe to\nlet the third man up and theyMl help throw him into the\nstreet, Joe let’s the man up, he pulls on his clothes, threatens\nJoe and leaves\nThat isn’t the synopsis of a thirteen weeks serial....that’s the first\nscene of a fifteen minute drama. That’s what I mean by knowing your\nmedium. The only thing good is that it had action!\nTo get back to adaptations, the writer Of adaptations has a peculiar\nobligation to the original author.• •.his adaptation must retain every\nbit of the flavor of the original story or book or play. To write\nsuccessful adaptations of great plays or great books for the air, the\nscript writer must steep himself in the sjyle of the original writer...\nthe adaptor will necessarily have to re-writ© scenes, add new dialogue,\ncut here, put the first scene at the close...he may do all of these\nthings...the play or work he is adapting become clay under his hands.0.\nhe must bend it to a new medium....but in so doing, he must never lose\nthe flavor of the original.... this makes the adaptor’s Job more\ndifficult than that of the original writer...he must create a comnlete\nview style for every work he adapts...... if he doesn’t, every bool;\" or\nevery story he adapts will sound like Joe Monk, script writer, and\nnot the original author.\nMy time is about up....we’d like to have some discussion from the floorG.\n..i see a number of writers here who no doubt can add from their\npersonal experience, much that I have forgotten to mention. In closing\nthere are two cardinal points I’d like to leave with you,...first of\nthat any radio program, must be a pleasureable experience;\n?5=jsit‘'oras*fi»,s;?r.“ssaaMj:i1‘ihSsrs.^?« m\na* script writer re-evaluated his position and his importance«...\nInstead of thinking of himself as an amateur writer who. with kind of\na deprecating tone of voice, is doing scripts for an educational station,\nand only waiting for the big break when Lord and Thomas or some other\nagency will assign him or her a strip across the board on ell three\nnetworks...he must begin to think of himself as a professional writer...\nafter all we make our living at it don’t we...a profassjona! writer\nwho can satisfy himself by doihg his Job better than it has ever been\ndone beforeQ..a writer who is playing and must play an ever increasing\npart in doing a real service for thousands and thousands of listeners\nwho, if they only know it, are wanting Just such material, such inform¬\nation, such programs.,.programs with imagination, sincerity, \"stuff”,\nand it’s a job, that the writer, since he is the source of all material\ngoing on the air, must bring these attributes too....he must have a\nbackgrounds..in literature, art, music, journalism, world affairs,\npsychology...the educational script writer, and this wouldn’t hurt\nmany of our commercial writers, either, must first of all be an educated\nman ->"
}