{
  "id": "d1479-1",
  "text": "liEws Letter\nPage 2\nFebruary 1846\nALSO COVERED BY OTHER STATIONS BE AFFORDED PROTECTION ONLY FOR THEIR EX¬\nCLUSIVE AREAS* Bob HiGGY made a TECHNICAL PRESENTATION AT THE HEARING\nWHICH WILL BE REPORTED LATER WITH OTHER TECHNICAL MATERIALS.\nThe statement made by your editor at the hearings is enclosed* Of\nINTEREST IN THIS CONNECTION WERE SEVERAL QUESTIONS ASKED CONCERN ING THIS\nMATERIAL BY MR* CaLDWELL* He FIRST INQUIRED WHETHER I KNEW OF ALL THE\nEDUCATIONAL STATIONS WHICH HAD FALLEN BY THE WAYSIDE* ThE ANSWER WAS\nAFFIRMATIVE, ThEN HE ASKED WHAT ASSURANCE THERE WAS THAT THE SAME THING\nWOULD NOT HAPPEN AGAIN IF INCREASED FACILITIES WERE ASSIGNED, ThE ANSWER\nWAS THAT FOR YcARS EDUCATIONAL STATIONS HAVE HAD TO STRUGGLE FOR FUNDS\nWITH WHICH TO OPERATE, NOW THEY HAVE TO STRUGGLE TO GET THE FACILITIES\nTO USE THE FUNDS WHICH ARE AVAILABLE. The OTHER INTERESTING AND POINTED\nQUESTION WAS THAT IF ONLY THRU SUPER POWER AND CLEAR CHANNELS COULD THE\nLARGE RURAL AREAS BE SERVED WOULD WE BE IN FAVOR OF SUCH OPERATION, THE\nANSWER TO THIS ONE WAS THAT IF THAT WERE THE ONLY POSSIBLE WAY SERVICE\nCOULD BE GIVEN WE WOULD BE IN FAVOR OF IT BUT WE DIDN*T THINK THAT WAS THE\nONLY possible WAY—THAT'S WHY WE WERE REPRESENTED AT THE HEARING,\n^ N A D REPORTS TQ N A E _B.\nJohn Dunn has just come thru with one of the nicest reports on station\nACTIVITIES WE HAVE SEEN,\nW N A D HAS UNDERGONE CONSIDERABLE CHANGES IN THE TWELVE MONTHS JUST PAST,\nThe full-time staff now numbers twelve, with part-time student assistants.\nIn addition, plans are now under consideration FOR A separate RADIO build¬\ning TO house nine studios plus a Radio Theatre and ample administrative,\nrehearsal, technical and RECREATIONAL SPACE, USING A QUARTERLY BASIS\nFOR PROGRAM PLANNING WHICH STILL CONTINUES TO BE A BIG FEATURE DOWN IN\nOklahoma, a total of fifty-three new program series will have been in¬\nstituted BY THE BEGINNING OF SUMMER, |n ADDITION TO THIS A NUMBER OF\nYEAR-ROUND SUSTAINING PROGRAMS ARE CARRIED. PROGRAMS IN THE NEWER SERIES\nCOVER SPEECH, HISTORY, SOCIOLOGY, MARKETING, GENERAL SCIENCE, LANGUAGES,\nEnglish and several oTHER^t. At present German, Spanish, French and\nPortugese classes are being taught by radio. Extensive use of live music\nis AIRED, drawing FROM UNIVERSITY ORGANIZATIONS, UNIVERSITY LABORATORY\nSCHOOLS, AND NORMAN, OKLAHOMA PUBLIC SCHOOLS, AnD IN ADDITION TO ALL THE\nABOVE ACTIVITIES, U. OF OKLAHOMA HAS BEEN GRANTED A CONDITIONAL CONSTRUCTION\nPERMIT FOR A 3,000 WATT F M STATION TO BE OPERATED IN CONJUNCTION WITH\nW N A 0—ALL OF WHICH SHOULD KEEP JOHN AND HIS BOYS BUSY,\nMAQDY OUT OF AFM\nThe founder and director of the National Music Camp at Interlochen, Michi¬\ngan—Dr, Joseph E. Maddy has been expelled from the American Federation\nOF Musicians Union,\nHe had BEEN charged with \"teaching music in Interlochen and thereby engaging\nIN ACTS detrimental TO THE UNION,\"\nMaddy had been a member of the union for 37 years. His expulsion was made\nBY unanimous vote OF THE EXECUTIVE BOARD,\nJames C. Petrillo, AFM president, did not participate in the decision."
}