{
  "id": "d1805-5",
  "text": "RECOMMENDED READING\nGeography via Television, by Jewell Phelps, George\nPeabody College, Nashville, Tennessee.\nThis is the first in a series of “Do It This Way”\nbooklets to be published by the National Council for\nGeographic Education. It is directed to the attention\nof persons who, with little or no training and experi¬\nence, may have occasion to become actively engaged\nin television work. The booklet begins with a few\nbasic considerations and then launches into a dis¬\ncussion of the television program. It concludes with\na list of useful references and sources of royalty-free\nmaterials.\nThe booklet sells for $1.00 a copy. Orders should\nbe sent to John W. Morris, Secretary, National\nCouncil for Geographic Education, University of\nOklahoma, Norman, Oklahoma.\nMass Communication and Education, by the Educa¬\ntional Policies Commission of the National Educa¬\ntion Association of the United States and the Ameri¬\ncan Association of School Administrators.\nThis book is intended to serve as a guide to the\neducator in his thinking about, and study of, the\nfield of mass communication. The consideration of\nthe nature of the mass media, the methods and some\nof the accomplishments of communication research,\nand the broad social changes which have gone along\nwith the development of mass communication make\nup Part One as the background of this study. Part\nTwo deals directly with the educational implications\nof the revolution in communication—with the effects\nof communication changes upon students, teachers\nand administrators, and suggests some courses of\naction which these changes seem to make desirable.\nFour broad assumptions underlie this analysis:\n1. Mass communications has helped make a new\nkind of society.\n2. It has given the teacher a different kind of\nstudent to teach.\n3. It has modified the role of the teacher and the\nadministrator.\n4. It has provided educators with new tools which\ncan improve teaching and increase learning.\nEach of these four assumptions is explored at length.\nThis book is a paper-back which sells for $1.50\na copy. There are discounts for quantity orders: 2-9\ncopies—10%; 10-100 copies—20%. Special discounts\nare available for quantities in excess of 100. For\nbookstores or other agencies for resale purposes there\nis a 20% reduction. Orders not accompanied by a\nremittance are subject to transportation charges.\nMake checks payable to the National Education\nAssociation, 1201 16th Street, N. W., Washington 6,\nD. C.\n—N A E B—\nDecember 7, the day which symbolizes the need\nfor defense preparedness, has been designated na¬\ntional Civil Defense Day. Most broadcasting stations\nand educational institutions will be called on, through\ntheir regular Civil Defense channels, for cooperation.\nPlease give all the help you can.\nWORKSHOP REPORT ISSUED\nLast December, WGN-TV Studios was the loca¬\ntion of a radio and television workshop for rabbis.\nA report of this workshop has been issued recently\nprepared by Henry H. Mamet, Executive Director\nof the Chicago Rabbinical Association’s Radio and\nTelevision Committee and Dr. Walter P. Zand, Area\nDirector, North Central Area, American Jewish Com¬\nmittee. The report is entitled “Pulpit, Camera and\nMike.”\nSome of the speakers were: Betty Ross West,\nWMAQ and WNBQ-TV, Supervisor, Public Affairs\nand Education; Sid Atlass, WBBM-TV, Director of\nPublic Affairs; Dr. Preston Bradley, Pastor, Peoples\nChurch of Chicago; and James Robertson, WTTW-\nTV, Program Director.\nWLS SCHOOL TIME DISCONTINUED\nChicago radio station WLS, which pioneered in\nradio education, has this fall dropped SCHOOL\nTIME - a program series for in-classroom listening\nwhich has been on the air since 1937.\nIt is with much regret that WLS announced the\ndiscontinuance of this educational service to Mid¬\nwest classrooms. The decision was made after efforts\nfailed to find a suitable sponsor to share the in¬\ncreasingly high cost of production. Because the pro¬\ngram was beamed to the classroom, the field of spon¬\nsorship was narrowed to educational or institutional\ntype promotion such as that presented by the Pure\nMilk Association for the past five years. Rather than\nchange this policy, which would admit direct product\nadvertising into the schools, WLS decided to take the\nprogram off the air.\nIn bringing SCHOOL TIME to a close, WLS\nwishes to thank the thousands of teachers, educa¬\ntional supervisors and Parent-Teacher organizations\nfor their loyal enthusiastic cooperation during the\ntwenty-one years this program series has been on the\nair.\nREPRESENTATIVE ROGERS\nTELLS ETV PROBLEM\nDemocratic Representative Walter Rogers of\nTexas said in Washington recently that it is regret¬\ntable that lack of money is retarding the construction\nof more educational television stations. “Once a sta¬\ntion is built and on the air,” he said, “money usually\n6\nNEWSLETTER"
}