{
  "id": "d1805-7",
  "text": "PROGRAMS\n► A new type of instruction has been added to the\ntraining offered inmates of the Draper Correctional\nCenter—ETV. Assistant Warden John Watkins\nsaid a special room has been set up and a number of\ninmates are now taking courses offered on Alabama’s\nETV network. The institution, which has approxi¬\nmately 640 first offenders, most of them teenagers,\noffers classes in a wide variety of subjects.\n^ ETRC and NBC are presenting a new ETV\nseries for young people of all ages, entitled, “Ad¬\nventuring in the Hand Arts.” This is a series about\npeople and things—primitive people living today\nin remote corners of this atomic world—and the\nbeautiful, useful things they make with their own\nhands. The films show how and why these people\nmake pottery, jewelry, baskets and cloth. The Girl\nScouts of the U. S. A. is the major producer, work¬\ning closely with ETRC and NBC.\n^ The United Nations Day concert performances\nby the world famous cellist, Pablo Casals, and the\nBoston Symphony Orchestra, with Charles Munch\nconducting, was telecast live from the General As¬\nsembly auditorium of the United Nations, Friday\nOctober 24. This program was presented under the\nauspices of META (Metropolitan Educational Tele¬\nvision Association) in conjunction with United Na¬\ntions Television. It is said to be the first time Mr.\nCasals has consented to play for an American tele¬\nvision audience. The concert was broadcast on radio\nto 48 countries to celebrate the 13th anniversary of\nthe U.N.\nThe international broadcast, as announced by\nthe Office of Public Information of the U.N., opened\nin New York with the Boston Symphony in a per¬\nformance of Honegger’s Fifth Symphony. Secretary-\nGeneral of the U.N., Dag Hammarskjold, delivered\na brief U.N. Day message, followed by Casals and\nMieczyslaw Howzowski playing Bach’s Sonata No.\n2 for cello and piano.\nThe program then switched to UNESCO in Paris\nto pick up Yehudi Menuhin and David Oistrakh\nplaying Bach’s Double Violin Concerto. Climaxing\nthe concert was the performance of the final move¬\nment of Beethoven’s Ninth Symphony by the Or¬\nchestra de la Suisse Romando, conducted by Ernest\nAnsermet, which originated in Geneva, Switzerland.\nBeethoven’s Ninth has become a tradition in U.N.\nDay observance.\n^ Miss Betty Adams, back from a tour that took\nher into Poland, Turkey and the Soviet Union, is\ndirecting the first course for college credit to be pre¬\nsented by a TV station in New England, WJAR-TV,\nProvidence, Rhode Island. Miss Adams made films\nand tape recordings in Paris, Warsaw, Ankara, Is¬\ntanbul, and Moscow. They will supplement a TV\ncourse on the philosophy of communism.\n^ A television course in Basic Russian is being\ngiven by META and St. John’s University in New\nYork City. Dr. Alan Willard Brown, META’s presi¬\ndent, said that the course in the Russian language\nwould be fascinating as well as useful.\n^ There is a dilemma in some offices of WCBS-TV,\nNew York, concerning the future of syndication of\n“Sunrise Semester”—not so much a case of not\nwanting to or that stations will not desire the educa¬\ntional series, but what method will be used for dis¬\ntribution. This year’s courses are on videotape, with\nthe resultant problem being to store the expensive\ntape in the vaults for a year for future syndication\nor to erase the programs and thus have the tape\navailable. No decision has been announced.\nPERSONNEL\nWe have two more “pioneers” to add this month.\nThey are: Milford Jensen, Director, WCAL, St. Olaf\nCollege, Minnesota and Michael Hayward, Chief, Op¬\nerations, Radio and Visual Services Division, Of¬\nfice of Public Information.\nTV TECHNICAL TIPS\n—Cecil S. Bidlack\nIn our last column, we mentioned October meet¬\nings of interest to educational broadcasters. We\nthought the 34th Annual NAEB Convention in\nOmaha one of the best. Of the 227 persons registered,\nonly five were engineers: Carl Menzer of WSUI-\nKSUI, Bud Phillips and Bob Stumme of the Univer¬\nsity of Iowa TV studio, Clarence Deal of KOKH,\nOklahoma City and the writer. While this isn’t a\nlarge representation, it’s the best yet.\nWith next year’s convention in Detroit, in the\ncenter of NAEB station concentration, we trust\nmore engineers will be there. With the three studios\nof the Detroit ETV Foundation, as well as a number\nof educational radio stations, it isn’t too early to\nbegin plans for a one-day technical program. Ann\nArbor is near, where the University of Michigan has\nthree TV installations, as well as ETRC headquarters.\nWe could make up an interesting tour and see how\nthe Detroit area stations operate. I’m sure the 1959\nConvention committee would' appreciate your sug¬\ngestions. You can send them to me and I’ll see that\nthey reach the right persons. In the meantime, you\ncan begin working on the boss to take a carload of\nhis staff to Detroit.\n—NAEB—\nWe’d like to pass along the four points made by\n“Jim” Ebel, Vice-president and general manager of\nKOLN-TV, Lincoln, Nebraska, and former chief en¬\ngineer of WILL, at the Wednesday afternoon panel\nsession of the NAEB Omaha Convention. If I were\nan Educational Broadcaster, I would:\n8\nNEWSLETTER"
}