{
  "id": "d1027-1",
  "text": "Dr. Hour ice «*• Secy, Page 2, January 21, I960\nessence asked to give up our network (to the Center), and nay have to, since\nthey could squoosG us out with tho huge funds at their disposal (for programs\nwhich tlxoy could distribute for far lees than we must charge, end of higher\ntechnical quality)* Tho plum which cm be held out to our Network ambers\nfor a better service than wo are now funded to provide is a powerful factor*\nBesides our resistanao to giving up a /jollocg-f inched creation to a J;'card-\ncreated complex, wo have a more serious concern* wo don't think United States\nEducation should be shaped too much by e Ford-dooiofiod pattern (Airborne, con¬\ntinental classroom, tho Center, etc*)* TJo have several rosorvations about this*\nOne* it's bad for ooesaanitiss to say \"let Ford do it,0 and the local tax-roots\nsupport for education dry up, instead of being developed* Second* local sta¬\ntion development Is greatly hampered by this* Duluth plans for an educational\nT / station, well along, have now bam dropped, thanks to the \"droaa* of Airborne\nT7. And I fear \"education* from a single financo-base, in this case, the Foun¬\ndation, \"steers*, picks staff and determines direction aore than X feol justi¬\nfied* vis selection of White as President, etc*, etc.\nIn the complex also is John Ivey (whom 1 like) and the Learning Resources Insti¬\ntute*\nAs I stated in my first note to the 3oord, In my new role as President, \"I don't\npropose to preside over the liquidation —♦* ULat ve have is groat loyalties,\na sound grass roots base in education itself, the confidence of most professional\nassociations, the Office of Education, etc* But ire don't have money* That's now\nwhat we're working on*\nAt a time when we wore invited in by Ford for a conference (far cmounccnent of\nconsolidation* BAA to the Center $ funds to tho Center for Radio network, etc*)\nif Harley end I hed willingly end promptly given up our ?!etvork, I think ve could\nhave gotten a million or two* TTow, because of our (“stupid*?) foot-dragging, end\n\"independent* attitude .7 fear there's no more money likely from them. This is\npart of the background*\nAfter reading the fine Kellogg Report on Continuation Centers (and it was a mar¬\nvelous report of a moot significant Kellogg contribution to United States Edu¬\ncation) I was tonptod to write you, proposing that Kellogg consider a grant far\na national Center building far un in Washington, in which would be housed our\nLegal, Research, Teacher Development, Professional Standards, Engineering, Publi¬\ncations, and otiier service departments* Frankly, I didn't have the nervo, in\nview of all you've already done for us. But this is what wo need* capital, plus\nan endowment so wo ore not always fighting for survival.\nBut the attitude of so neny^fthat ST7 (and even radio, for which Ford has vir¬\ntually no interest, except as it re la too to the Center) is brd's field, end\nthoy don't want any part of it. T3xo danger of being swallowed up in Ictar Ford\ncreations, as our Network new is in danger of being, doesn't make it easy. It\nis (wily our ethics or stubborn convictions about United States Education which\nhave prevented our getting lots of Ford money, I believe. Hut that's a tough\none to explain to someone we don't laiow as well as we know you*"
}