{
  "id": "d481-1",
  "text": "ME3 HEA2QUAETEHS\n13^6 Connecticut Ave.\nWashington 6, D. C.\nKEMDRAMEOM\nTO: NAEB Board of Directors\nFROM: Harold E. Hill\nBATE: December 27, 1961\nIn accordance with Board approval (at the meeting of the Board on Oct.\n22-23, 196l), a part-time 'bookkeeper has been hired for the V&shingfcon\noffice and an orderly transfer of accounting procedures will begin as of\nJanuary 1, 1962. In this connection, the MSB General Fund, on deposit\nwith the First National Bank in Champaign, Illinois, will be closed out\nand a General Fund opened with the Ifational Bank of Washington (DuPont\nCircle Branch). In order to accomplish tills, we must follow the procedure\nprescribed for the opening of all corporate accounts. Thin requires\nBoard approval of a resolution authorizing the opening of the account\nand the authorized signature of the responsible officer. Although this\nwas the intent of the Board authorization (to employ a bookkeeper and trans¬\nfer accounting activities from Urbana to Washington), the actual record\nof the Board meeting will need to include the resolution quested in the\nattached so that a copy may be given to the bank so that the account may\nbe opened.\nAs was the case with the General Fund in Champaign, the Administrative\nVice President, as the only bonded officer of the corporation, will be\nthe only one authorized to sign cheeks on the General Fund (the President\nmay sign checks on the existing \"Petty Cash\" account in Washington - where\na balance of $5,000 is maintained - and the Network Manager is authorized\nto sign checks on the Urbana \"Petty Cash\" account in which a $2,000 balance\nis maintained and which will be left in the Champaign bank).\nSince the approval of the resolution is to be made a part of the record\nof the recent Board meeting, this memo is being sent to the Board as then\nconstituted and not to those newly elected members who will take office\nJanuary 1, 1962. Two copies of the resolution are enclosed. Please send\none to the Secretary, R. Edwin Browne, Director, KFKU, EES Building, Univer¬\nsity of Kansas, Lawrence, Kansas, since Ed has to sign the formal resolution\ngiven to the bank and Till need, on file, evidence of your approval. Please\nsend the other signed copy to me for our official files. Please send the\ncopies, to both Ed and me, lay return airmail."
}