{
  "id": "d481-103",
  "text": "-2-\n3. Washington is the most s’contact conscious3’ community in the world.\nWhile not subscribing fully to the local value system, I list the following, among\nmany, as meetings that result from our being in Washington and potentials for\nadvancing our interests.\nToe Baudino - Vice-President, Westinghous. Broadcasting Company.\nHe has promised to explore possibility of acquiring for NAEB Tape Network special\npublic service radio series produced by Westinghouse for its own stations.\nCarl Runoe - Former assistant Dean of Law School, University of\nWisconsin, newly appointed Assistant Secretary of Defense for Manpower. He\ncalled to say he has whole training program of armed services under him and wants\nto consult with us about uses of radio and TV in this connection.\nRobert Dudley - Secretary of Electronic Teaching Laboratories. This\ncompany is especially interested in developing and furnishing devices for aiding\ninstructional programs in newly developing countries. He is setting up a meeting\nwith some of their staff for exploration of mutual areas of interest and support.\n4. Len Press (on leave from WBKtf, Ky) is working hard to get our radio\nversion of the Washington Report off the ground. We want to do it well so it's\ntaking some time to get the right person and format.\nMeantime, he is also active in searching out and pumping other program wells\nin the area • We are now obtaining on a regular basis the major speeches given at\nthe National Press Club, the President's press conferences and those of cabinet\nmembers; he is negotiating for a series of lectures on world affairs being given by\nDr. Charles Malik; and has talked with the State Department cm series of taped\nresponses from critical areas abroad to lists of questions we might send as basis\nfor background programs.\n5. Because of the pressure from the Sudanese government for immediate\naction ik providing assistance in its radio expansion, we were obUged to launch Informal\nrecruiting for the leader of the mission even before the contract could be signed.\nWe are most fortunate in securing Syd Head, Director of Broadcasting and Film\nServices, University of Miami, to accept this two-year assignment. Due to the\nneed to get somebody on fee job, it may be that Syd will have to leave early -\neven this month - before the rest of the team is assembled. The others are to be\na transmitter and a studio engineer."
}