{
  "id": "d481-111",
  "text": "February 10, 1961\nMr. Carl H. Menzer, Station Director\nWSUI and KSUI,\nState University of Iowa,\nIowa City, Iowa.\nDear Carl;\nAs you say, we’ve made a start towards a new basis of mutual understanding of\nNAEB and NETRC functions but, despite good intentions on both sides, such\nefforts have failed before. However, I have some reason to believe that we’ve\ngot rid of some of the emotional underbrush and are right down to the bedrock\nof realistic agreement now.\nWith reference to your question about the paragraph on station activation, I\nthink the key word in the paragraph is the initial one; ’’primary**. We have\ntried to divide functions, in general, into network activities and trade\nassociation activities. Hence, the major role in activating stations and\ninterconnecting them has been given to the Center. However, NAEB, as a\ntrade and professional association interested in all aspects of the educational\nbroadcasting will, naturally, continue to do planning, exploration, and\nresearch in all areas that will advance the good of the movement.\nIt would seem to me that the live network committee and the engineering com¬\nmittees of NAEB will continue to operate as they have before, but now there will\nbe a good deal more coordination with the Center's activities. If things work\nout the way we hope, the staff work of Cy Braun and Dave Stewart will now\nbecome equally available to NAEB. Cy’s work, for example, in allocations is\nalready being made available to Vem Bronson and Oscar Reed in their spectrum\nsurvey. Jansky and Bailey, NAEB's Engineering Consultants, are going to be\nemployed by the Center to do some further investigating of the kinds of pre¬\nliminary planning done by the live network committee of NAEB, etc..\nIn effect, the paragraph to which you refer means that the Center is going to\ntake over the responsibility in providing the sort of staff service to stations\nformerly provided by JCET. We have neither the money or staff to carry on this\nkind of day to day service function. If we did, I would have long ago moved\nin to take over JCET operation, This present arrangement is really an acceptance"
}