{
  "id": "d481-116",
  "text": "February 8, 1961\nDr. Harry J. Skomia,\nSchool of Communications,\nGregory Hall,\nUniversity of Illinois,\nUrbana, Illinois.\nDear Harry:\nI want to take up with you a number of things that have accumulated and can't\nwait until your delayed arrival here.\nOne, how do you feel about the possibility of substituting Tony Partridge, of the\nCBC, for one of the previously nominated members of the International Relations\nCommittee? Tony has had lengthy conversations with Cam expressing his\ngreat interest in our heightened activity in the international area and I talked\nwith him in my office and later on the phone about this. He is diffident about\npushing himself but integrates a very earnest interest of this kind of activity\nand willingness to participate if we should want him. Evidently he has worked\nin broadcasting in several foreign countries and he is as dedicated to the use\nof broadcasting media in foreign countries for general enlightenment as any of us«\nHe has also indicated the likelihood that CBC would be willing to take out a\nnetwork membership in NAEB and will check this out with Gene Holman within the\nnext couple of days. If CBC was a member of NAEB there would, of course, be\nno question about the propriety of one of its officers accepting a committee appoint¬\nment. If this did not come to pass, however, it would seem O.K. to me that\nhe take out an individual membership and accept an appointment upon a personal\nbasis. What are your thoughts on this?\nTwo, apparently as a result of some of Cam's representations, we have been\ninvited by the International Telecommunications Union to participate in the\nInternational Television Symposium to be held as a part of the First World\nTelevision Festival in Montreux, Switzerland, May 17-21. The arrangements in\nthe United States are being coordinated by Florence Dowling, whom I'm sure you\nknow. She has asked that we give some thought to organizing the Symposium on\nEducational Television and give them the benefit of our thinking about this.\nI include copies of all the correspondence so you know as much about it as I do.\nI would think, however, we would want to suggest something other than just\npresentation of papers. Perhaps we would want to consider putting together a\nhalf-hour documentary film on ETV as it is operating in the United States, utilizing"
}