{
  "id": "d481-126",
  "text": "William G. Harley\n-2-\nJamiary 4, 1961\nWilmington, Delaware and with separate staff and program responsibilities, in\naccordance with a written agreement between WHYY and the Delaware Educational\nTelevision Association. The WHYY By-Laws were changed for the purpose of providing\nfor six additional members, three from Delaware and three from New Jersey. Two of\nthese new members, interestingly enough, are public school superintendents, and one\nis both a faculty member of the University of Delaware and President of the Delaware\nEducational Television Association.\nIn order to cut to the very heart of the interest of Delaware educators in seeing\nChannel 12 assigned to education, I direct your attention to the list attached hereto\nof educational and other organizations and agencies in that State who exclusively endorse\nthe WHYY application. In reading this list, it is important to bear in mind the factor\nof exclusivity in the instant proceeding. An exhibit has been prepared for each organ¬\nization, setting forth a detailed account of our discussions with them in connection\nwith program planning and including a program planning format sheet authenticating\nthe respective program. In addition •— and this in the thrust that I hope will strike\nhome in the conscience of you and my fellow beard members — each such exhibit is\naccompanied by a notarized affidavit signed by the chief executive officer of each\norganization, specifically endorsing the WHYY, Inc. application to the exclusion of\nall others.\nLeonard Marks states in paragraph two of his report upon the Wilmington,\nDelaware, case that he believes the station should remain in Delaware; and, further\nthat he will be \"glad to withdraw from any case inimical to the best interests of\neducational broadcasting but that in this situation no conflict of interest is involved\nsince this is a commercial channel, not one reserved for educational use.\"\nIn view of the facts set forth above, I leave the conclusions in this matter\nto your own intelligence and good judgement . The opportunity here for educational\nbroadcasting to serve one of the most important population centers in the country,\nrich in educational, cultural and public affairs resources, is one to invigorate the\nimagination and determination of every person in our profession. It certainly provides\na unique and dramatic opportunity for the National Association of Educational\nBroadcasters to stand up and be counted.\nSincerely yours,\n/s/ Dick\nRichard S. Burdick\nEnel.• .1"
}