{
  "id": "d481-128",
  "text": "COPY\nW H Y Y\nCOPY\nEducational Radio and Television\nRichard S. Burdick\nManaging Director\nJanuary 18, 1961\n1622 Chestnut Street\nPhiladelphia 3, Pa.\nMr. William G. Harley\nPresident\nNational Association of Educational Broadcasters\n1346 Connecticut Ave. , N. W.\nWashington, D. C.\nDear Bill:\nI am enclosing for your information a reprint from the Philadelphia Inquirer in\nrespect to a request by the Goverar of -Delaware to the General Assembly for a joint\nresolution to support the education! application for Channel 12 . In my letter to you\nof January 4, 1961 I listed the significant number of educational, cultural, and public\nservice organizations who are exclusively endorsing the WHYY, Inc. application. I\nwould appreciate it if you would include the information in respect to Governor Carvel's\nrequest in the memorandum whim I staked that you distribute to members of the Board.\nThe position of the Governor, stated so forcefully in his inaugural acceptance speech,\ndramatically underscores thp Its ten official attitude concerning the award of this channel.\nIn the feackgrov'J °f the support of the educational applicant are the commercial\napplicants, militant* seeking to defeat the edcuational broadcasters in establishing a\ngreatly needed, greatly wanted, unique and dynamic service to upwards of six million\nadults and chil-en' 80 that an independent local commercial operation may be instituted\nin an area -ady adequately served by the three major networks. The attitude of the\nNAEB in iM matter is at least ambivalent by implication, in view of the fact that the\nfirm of fcS general counsel is representing one of the commercial applicants. The\nsigr -icance is readily apparent when you contemplate the traditionally expected\nq* Piousness of a congratulation to the attorney for a victor in a license application\nproceeding, If the Rollins Broadcasting Company were to be the victor in the present\ninstance, and if the announcement of the decision were to be made on the day of an\nNAEB Board meeting, would we all merrily thwack Leonard Marks on the back and drink\na toast to the hard sell and soft soap?\nCordially,\n/s/ Dick\nRichard S. Burdick\nEnc.; CC: Mr. Richard R. Hull"
}