{
  "id": "d481-148",
  "text": "January 3, 1961\nMr. John Dunn\nThe Oklahoma Educational Television Authority\nP.0. Boot 2005\nNorman, Oklahoma\nDear John:\nSchenkkan’s TV station will actually be licensed to the Southwest Area\nETV Association, I gather, and they currently are not on the air, accord¬\ning to our records. If it turns out that they are finally licensed to\nthe University, they will automatically become a member station and the\nUniversity’s dues adjusted accordingly. However, if the Southwest Area\nETV Association becomes the final licensee, it will require a separate\nmembership, and I would appreciate it if you would contact Bob on this\nmatter, since they are eligible for Active NAEB membership even while in\nCP status.\nKURA-TV, Dallas, has presented somewhat of a problem. They were members,\nbut at the time the bills for 1961 dues went out, Martin Campbell wrote to\nsay that they would like to hold up paying their dues until they were sure\nthat membership in the NAEB gave them what they wanted from such membership.\nBe further indicated that they did not feel that the NAEB should be repre¬\nsenting ETV stations in the effort to get Federal aid to ETV legislation\npassed (this, of course, was an isolated opinion).\nAt any rate, we agreed to keep them on the mailing list, and this summer\nCampbell had a long talk with Barley and me while he was in W&shington\non another matter. At that time, he indicated (we thought) that the NAEB\nwas doing a good job and they’d stay in the fold.\nHowever, when the bills for 1962 dues were sent out a couple of weeks ago,\nhe Indicated that they were \"on the fence'* and asked that they be dropped,\nat least temporarily (and that ’s the reason they were in the Directory —\ncompiled last fall — but also on the list of non-members, compiled more\nrecently). He did indicate that the major problem now was finding the money,\nin their limited budget, to pay the NAEB dues.\nWe had no recourse but to drop him, but wrote him a letter indicating that\nwe hoped they would cone bade in as soon as possible* If you have any ideas\non how to bring them in again, we’d appreciate it — or anything you can do."
}