{
  "id": "d481-27",
  "text": "(#\n(3) PRESIDENT'S MEMO\nAugust 17, 1961\nposed to turning over that third station to the educational interest. In other words, the\nFederal Agency hes said that it is better for American people to have an opportunity to\nview more of the same Idnd of stuff they are already receiving from two commercial than\nit is to provide ar. opportunity for viewing a different kind of programming which might\nbe available over an ETV station. Specific aspects of this principle were the FCC*s\ndecisions allocating new television channels to Rochester and Grand Rapids. In so\ndoing the FCC denied a bid to use the third channel in Rochester for ETV and added\nanother commercial channel to Grand Rapids at the expense of a request for reservation\nof an ETV station at Cadillac, Michigan necessary to the Michigan state-wide plan\nfor ETV. The JCE3ss position will be that the FCC’s indicated preference for more\nnetwork commercial programming discriminates against educational and cultural tele¬\nvision and deprives large segments of the public of any presently forceeable opportun¬\nity for realistic choice of program fare. The petition is to be presented on August 30th\nand it will be preceeded by press conferences in New York and Washington.\nMeanwhile NAEB is preparing to file on comments out he proposed change in the\nFM rules, on the program forms, and on other aspects of the July decisions, designed\nto foster the improvement of the URF part of spectrum.\nCONVENTION FLANS - 1963\nConvention plans are actively moving ahead. Chairman Newton Minow ox the\nFCC will present the keynote address on Monday evening. Senator Gale McGee of\nvVyondng will present the luncheon speech on Tuesday. National Convention Chairman\nJack McBride is developing four special clinic sessions which are geared not only to\nthe presentation of scholarly papers on specific subjects of importance to at least\n< cnefacet of NAEB membership, but also to involve as many NAEB members as possible.\nY/ith the present plans 32 NAEB members will be actively participating in these sess¬\nions . Under the guidance of the Army Signal Corps there is a special session on\ninstructional TV by the three Armed Services.\nPresident Kennedy has received an invitation to address the banquet on Wed¬\nnesday evening, and at this time, is holding the invitation in abeyance for further\nconsideration during September. Exhibitors now number 18 utilizing all but four of the\nallocated 33 booths, Plans are also in progress for the Voice of America to present a\nspectacular story entitled “The World-Wide Battle for Radio,J .And we anticipate that\nMr. Edward R. Murrow will open this session with a brief report on the work of his\nagency.\nWGH\nmmm"
}