{
  "id": "d481-29",
  "text": "(2)\nThere is apparently a groat deal of new activity la the South/ and we hope to\nhe able to extend the BAEB benefits to now stations and production centers.\nAs you know from your wfperlence here, one of the greatest hopes is a greatly\nexpanded Individual aembership. tfe feel that our best method of attaining such\njataabership is through personal contact by Begioaal Directors, therefore/ when\nyou are at other meetings, or asked to give talks, etc.,$fc would be well if\nyou were to try to push Individual membership.\nAs you know, Raymond Eurlbert of the Alabama Educational Television Ccmaisslon,\nis the Television Director for your Begioa. In the foregoing I have mentioned\nnot only radio by television members, and I am sure that there would be no pro¬\nblem, so far as Raymond is concerned, if you were to push for both kinds of\nmembers. Obviously, I suppose you should concentrate on radio and he on tele¬\nvision, but it would be sort of Silly to do this exclusively. Under separate\ncover, I am sending you several brochures regarding the $&E8, both for Indi¬\nvidual membership and for general membership. If, at anytime, you are going\nto he at a meeting where you think a supply of these brochures might be help¬\nful, just let me know and we will send them to you.\nThe other majoy function, I would suppose, of a Regional Director is the gene¬\nral promotion of the MASB as an Association and as the national organisation\nrepresenting educational broadcasters. This, of course, you do anyway, but it\nmay carry a little more weight now that you have an official position with the\nAssociation.\nShe next meeting of the Board of Dtrectors of the HAEB will be Skid in connec¬\ntion with the Convention— just prior to the start of the Convention—and you\nwill be sent particulars regarding this meeting and an agenda well in advance\nof the meeting.\nPerhaps this letter has not been very definitve or very helpful. You know that\nI will be happy to provide you with any information or materials you feel would\nhelp you do a better job as a Begional Director.\nDove to U1 and to tho baby, and I trust all of you are getting along beauti¬\nfully.\nRegards,\nHarold E. Sill\nAdministrative Vice President\nHEB/mlm"
}