{
  "id": "d481-57",
  "text": "Mr. William G. Harley\n20 April 61\nPage 2\nfP\nP\n¥\nHowever, it is my belief that, at least in part, it is a dis¬\ntrust of the unknown that is being personalized and vocalized as a\ndistrust of White. This thought first struck me in Milwaukee when\nI was returning to our hotel from the morning board meeting with\nfour other members of the NAEB board. In the belief that I must\nbe the only one who didn't know the answer, I asked who would now\nbe Jack White's boss with Scott Fletcher gone. NOBODY PRESENT\nKNEW. I then asked who was on the NETRC board. NOBODY PRESENT\ncould name one. I asked if any of them were broadcasters. NOBODY\nPRESENT knew.\nNOw, if five members of the NAEB board couldn't answer any of\nthe three questions, I wonder how many of the rank-and-file members\nof NAEB know the answers?\nI am convinced that the NETRC and the NAEB can't work together\nharmoniously in the interest of educational broadcasting as long as\nthere is deep-seated distrust between organizations. And I am\nconvinced that this distrust will remain until NAEB members know\nwho and what are behind Jack White, and what their motives and\nmotivations are.\nAlong this line, I suggest that near the beginning of the Co¬\nlumbus board meeting, some explanation of the NETRC hierarchy be\ngiven. This should include the role and influence of the NETRC\naffiliates' committee.\nAlso, if the Allerton meeting is held this summer, I strongly\nurge that some NETRC board members be invited to attend at least\nfor a couple of days so that NAEBers can meet them. Few people\nturn out to be the ogres, in person, that our imaginations can make\nof them when they remain unknown.\nI believe these would be constructive steps toward NETRC-NAEB\nagreements. Until formal agreements have actually been made, and\nafterward, in the Interpretation of broad general agreements, our\nrespective presidents and their staffs can be expected to arrive\nat Informal working agreements between themselves.\nHowever, I think any agreements on general policy, such as the\nproposed letter of agreement, should be made between the boards of\nthe two organizations. I doubt that the NAEB board is ever likely\nto enter into a formal agreement with the President of the NETRC.\n(This definitely applies to Jack White, but also to anybody else\nwho might succeed to his position.)\nIf we can eventually dispel the cloud of doubt that hangs over\nour negotiations, I believe then that NAEB can enter into solid\nagreements with the NETRC with great confidence, and without fear\nof weakening our organization. For, despite the NETRC's money."
}