{
  "id": "d481-80",
  "text": "PROPOSED ICA POLICY 6n TELEVISION\nGeneral Background\nThe ICA policy for support of television projects is based on a\nmemorandum from Gerald F. Winfield to Dr. D. A. FitzGerald, dated October 28,\n1955. (Summary attached.)\nDuring the five years since that memorandum Was written, the number\nOf. non-commercial, educational television' stations in the United States has\nincreased to 52. There are more than 200 closed circuit instructional television\n.systems in use• More than 800 eleme^t^ry and secondary schools, and colleges,\nare, .offering television instruction* ’;Thefs is in progress, a. massive project\nto -distribute televised lessons to pupils in six states through the use of\n•airborne transmittersA substantial body of reputable research establishes\nbeyond question that for most types of -learning, television teaching is equally\n-.as effective as conventional methodsIn some specialized fields, such as\nmedecine, dentistry, veterinary medecine, and certain aspects of the biological\nand physical sciences, television is more effective than traditional methodso\nAs Dr. Wilbur Schramm of Stanford University has said, \"There is no longer any\nreasonable doubt that television can teach as many facts and skills as the.same\nlecture given in the classroom.\"2/\nIn the countries in which ICA is operating, there are 86 television\nstations. A number of other countries are actively planning stations.^ The\nFord Foundation is supporting an extensive experiment in the educational use\nof television in India. There is rapidly growing interest in Europe in the\nuses of TV for educational purposes .2/\nIn and of itself, television has no capacity to teach or to cause\nlearning to occur, but the logistics of the medium permit a broad extension\nin the use of available teaching and learning resources. With modem\nrecording methods, magnetic tape and film, practical means are available for\nthe maximum extension of these resources.\nThe informative programs of ICA in the fields of health, agriculture,\nand education, and the dissemination of basic economic, social, and political\nknowledge cannot penetrate deeply into a population, nor can they be effectively\nsustained over a long period of time without the orderly development of the\nmass media of communication. Progress is being made in the other media, but\nin regard to television, ICA’s posture has been largely one of reticence.\nIndeed, the use of television in the underdeveloped countries poses major\neconomic arid technical problems, but they are problems that can, and must,\nbe faced and solved.\nIt is essential that ICA expend its resources on developmental\nprojects which are practical and beneficial. If at the same time, such\nprojects have the capacity to fire the imagination of great numbers of\nPhe populations of the emerging countries and to provide dramatic evidence\nof our desire to help people at the individual level of aspiration, so much\n-2-"
}