{
  "id": "d481-82",
  "text": "«entury phenomenon. It cannot be less than inevitable in the underdeveloped\ncountries where the maximum possible multiplication of teaching and learning\nresources consistent with desired results must be the objective0\nTelevision has application to^>th in-schopl and out-of-school edu¬\ncation and training*, Its special contributions may be considered under four\nbroad headingsi (l) Its ability to extend and expand the use of all existing\nteaching and learning resources; (2) Its visual capacity which permits the\npresentation of materials requiring \"seeing” as-part of the learning process;\n(3) Its ability to present persons and resonppep HQt? noppftlly available\nthe educational situation; and (4) ?he fact,that television<|s not totally,\npop primarily, dependent Upon verbal communication.\nThe multiplication in use of teaching resources resulting from\ntelevised education occurs in several ways® Qualified teachers can reach\nmany more learners with no measurable loss in resultant learning. Through\nthe\"use of recordings, this increased utility can be repeated or extended\neven furtherJ Television has achieved marked success in training teachers0\nThere has beeh a demonstrable increase in teaching performance accruing as\na by product of televised instruction® Television provides an efficient\nchannel for the distribution of films and other prepared materials which\nare a major supporting bulwark to an educational system lacking trained\nteachers. Since there is a gigantic lack of trained teachers, the broad\nuse of prepared teaching materials is essential.\nTelevision’s visual capacity makes it particularly useful in the\nteaching of the sciences, in the training of skilled workers such as book¬\nkeepers and mechanics, and in other fields where it is useful to show\nObjects or processes. Again,, such showings and demonstrations can be\n©hared on a wide base.\nBecause they can be shared by a large number of learners, persons\nof special qualification or importance, and materials that are either diffi¬\ncult or expensive to obtain can be introduced into the learning process\nthrough television.\nA ©mall fraction of populations of the emerging countries possess\nthe necessary verbal skills to gain imximum benefit from education presented\nin the traditional form of talk and,,books. Thus, a medium such as television\nwhich is not primarily dependent on\"verbalized communication has a special\nutility in any broad educational effort_\nWhen an objective is vital to survival, and when the time for accom¬\nplishing it is limited, cost is not necessarily the critical factor. It is\nobvious that the emerging countries mtzst achieve a vastly improved;educational\nprogram if they to Survive ig iree societies. While the absolute cost of\nsuch an improved educational system is not the most critical factor, the cost\nmust be within the financial capacity of the country concerned or the objective\nwill not be accomplished.\n-4-"
}