{
  "id": "d481-98",
  "text": "Mr o h Schwarxwalder\nthat I did not know of a totter* sent before I assumed office* asking NAEB for\nsupport.\nThis information* plus the misinterpretation of our position* convinced me that\nsome sort of special earnest was needed to demonstrate our good faith.\nAccordingly* I reassured Dick in person of our backing and offered to provide\nwhatever help he might ask. He said that the deadline for exhibits (12:00 noon*\nFeb. 17) was about to expire* but that he would see what could be done.\nOn Monday I supplemented my verbal statement with the following telegram:\n9‘Though deadline passed if there is anything NAEB can do to support\nWHYY-TV application Rollins Radio (Coins & Mark8 s client) will permit\nits introduction • Again emphasise Association emphatically on your\nside and glad to go on record to that effect\".\nThis* in no way invalidates the policy position which was reiterated in connection\nwith the involvement (months in advance of the educational applicant) of the firm\nof our general counsel in behalf of a commercial client of long standing; it does\nacknowledge that* because of misrepresentation or misinterpretation of our position*\nthat we needed to make it crystal clear that NAEB always is behind the educational\ninterest in broadcasting.\nWith the reorganisation of the JCET* NAEB is now taking over a role* which by\nagreement* had been JCET’s preserve; namely the active representation of\neducation’s interests in matters of allocation policy snd the vigorous defense\nagainst any attempt to delete a reservation or proceed against an educational\nassignment. Moreover* wherever in the future a local applicant petitions for\na rule making procedure to have a channel made educational* the NAEB will\nactively support such a move (as it offered to do in Wilmington).\nIn view of these developments and because I am confident that we share in a\ncommon and passionate concern for the acquisition for education of adequate\nTV channels to do the job* it is most regrettable that you have asked me to accept\nyour resignation as consultant to the \"Television Spectrum Space Survey\"\nbeing conducted by NAEB. We need your competence and intimate knowledge of\nyour area to help us In this vital undertaking. I hope* that as you consider the\ngreater good to be served by your participation* you will reconsider your decision.\nSincerely yours\nWilliam G. Harley\nP.S. I have no objection to letting Chris and Dick present your views at the Board\nmeeting. Though I don°fc agree with your position on JCEB~NETRC~NAEB cooperation*\nI certainly agree that our support of ETV stations has no relevance - nor has it ever\nto the interests of Cohn and Marks.\nc.c.: NAEB Board\nHarold Hill\nLeonard Marks"
}