{
  "id": "d712-24",
  "text": "Membership Committee\nRaymond D* Birlbert, Chatman, Manager, Alabama Educational TV Commission,\nBirmingham. Alabama\nGertrude Broderick, Sub-Chairman, Individuals & Affiliates, Office of\nEducation, Washington 25, D. C.\nHugh Mix, Sub-Chairman, Actives & Associates, Station WNAD-AM, Bhiversity\nof Oklahoma, Homan, Oklahoma\nJack D. Summer field, Sub-Chairman, Industrial Associates & Sustaining,\nButler Hall, Heir York, Heir York\nKenneth A0 Christiansen, Director of TY, University of Florida, Gainesville\nFlorida\nLee Dreyfus, Station WDET, Wayne State University, Detroit, Michigan\nHerbert Hake, Radio-TV Department, leva State Teachers College, Cedar Falls\nleva\nEdvard G* Sheer bums, Department of Visual Communications, University of\nCalifornia, Berkeley, California\nGerald J* Willsea, Department of Radio & TV, Denver Public Schools, Denver,\nColorado\nProfessional Advancement Committee\nVernon Bronson, Chairman, Station WTHS-TV, Board of Public Instruction of Dade\nCounty, Miami, Florida\nMartha Gable, Division of Radio & TV, Philadelphia Public Schools, Philadelphia\nPennsylvania\nPatrick Hazard, Armenburg School, Bhiversity of Pennsylvania, Philadelphia,\n. jpennsylvania\n( Carl Mrrnsrrr, Stefrfftn WSBI, State Bhiversity of leva, lava City, lava\nRoberESohenkkan, Director of Broadcasting, Bhiversity of Texas, Austin, Texas\nLoren B« Stone, Manager, Station KCTS-TV, Bhiversity of Washington, Seattle,\nWashington\nEarl tfynn. Director of TV, Bhiversity of North Carolina, Chapel Hill, Worth\nCarolina\nPublications Committee\nFrank E, Sohooley, Chairman, Director of Broadcasting, University of Illinois*,\nBSrbana, Illinois\nGertrude Broderick, Office of Education, Washington 25, D. 0*\nWalter Emery, Michigan State Bhiversity, East Lansing, Michigan\nPhilip Leads, Board of Education, Chicago 1, Illinois\nEd Stasheff, Department of Speech, Bhiversity of Michigan, Ann Arbor, Michigan\nElmer Sulzer, Director, Broadcasting Services, Indiana Bhiversity, Bloomington,\nIndiana\nTracy Tyler, University of Minnesota, Minneapolis 14, Minnesota"
}