{
  "id": "d712-43",
  "text": "-3-\nPROFESSIONAL DEVELOPMENT COMMITTEE — * Since the NAEB is the sole professional\nassociation in the area of educational broadcasting, it is incumbent upon it\nto assume responsibility for the maximum professional and educational develop¬\nment of radio and television as educational instruments* The achievement of\nthis goal depends almost entirely upon the caliber and qualifications of the\nresponsible personnel* The maintenance and improvement of standards depend\nupon an organized program for professional advancement* Such a program must\nbe long-range* It must be current, far seeing and flexible* It must include\nopportunities ranging from the improvement of skills to the re-thinking of\nbasic philosophies. It must provide opportunities for both recognition and\nadvancement* It must develop leadership* Such a program depends upon dif¬\nferent types of approaches: Centralized, on-going services must be provided,\nas in the case of continuing placement, engineering, and other assistance;\nwhere mechanisms do not exist elsewhere, the NAEB must itself operate intensive\nworkshops and seminars; to meet individual needs not otherwise provided for,\nscholarships, consultation, and other more flexible types of support must be\nprovided; and always there must be constant review and evaluation* (The fore¬\ngoing is from a \"Statement of Purpose and Objectives\" developed by the NAEB\nProfessional Advancement Committee, which exists to advise the President and\nBoard on the matters listed, and to suggest specific steps to be taken, and\nmeans to implement them*)\nPUBLIC RELATIONS COMMITTEE — This committee is charged with general PR res¬\nponsibility; it should remain sensitive to the Association’s current PR posi¬\ntion and provide guidance, constructive criticisms and suggestions for the\nAssociation’s PR operations* This committee advises the President and Editor\non all such matters and is expected to recommend activities ranging from day-\nto-day \"publicity\" to long-range promotional goals*\nPUBLICATIONS COMMITTEE — Primary responsibility shall be that of the overall\npolicy and co-ordination of the NAEB Journal and the NAEB Newsletter* In this\nrespect the committee shall function as advisory to the President and Managing\nEditor. Also, the committee shall assist in the preparation and procurement\nof materials for publication in the Jcarnal and Newsletter. The committee,\nshall also advise the President and Managing Editor with regard to other NAEB\npublications when such advice is requested, or seems desirable by the com-\nmittee, ( Revised February 6, I960.)\nRADIO NETWORK COMMITTEE — This committee is directly responsible for the\nselection of programs to be distributed by the NAEB Radio Network, other than\nin-school programs. In addition, this committee advises the President and\nNetwork Manager on matters pertaining to the NAEB Network, and conducts research\nboth on its own initiative and at the request of the President or the Network\nManager (such as the questionnaire designed to determine subscribers’ opinions\nregarding the Network and its operation, a study of the program service pursuant\nto establishing a realistic cost figure for every program distributed by the\nNetwork, etc).\nRADIO NETWORK SCHOOL COMMITTEE — This committee has the same responsibilities\nregarding in-school programs as enumerate above for the Radio Network Committee\nin relation to non.~in - r.ohool programs*"
}