{
  "id": "d429-109",
  "text": "342\nMarshall McLuhan\nof moving from the segmental, lineal space of literacy into the\nauditory, unified field of electronic information is quite unlike the\nreverse process. But today, while we are resuming so many of the\npreliterate modes of awareness, we can at the same time watch many\npreliterate cultures beginning their tour through the cultural phases\nof literacy.\nThe phonetic alphabet, which permits the translation of the\naudible into the visible, does so by suppression of meaning in the\nsounds of the letters. This very abstract technology has made pos¬\nsible a continuous one-way conquest of cultures by the Western\nworld that is far from finished. But it would seem that with the\ncommercial use of the telegraph during more than a century we\nhave become accessible to Eastern art and technology as well as to\npreliterate and auditory cultures in general. At least, let us be\nprepared to consider carefully the formally auditory character in\nthe telegraph and in subsequent electronic forms of codifying\ninformation. For the formal causes inherent in such media operate\non the matter of our senses. The effect of media, like their “message,”\nis really in their form and not in their content. And their formal effect\nis always subliminal so far as our ideas and concepts are concerned.\nIt is easy to trace some of the effects of phonetic writing since they\nare coextensive with the most familiar features of the Western world.\nThe phonetically written word, itself an abstract image of a spoken\nword, permits the prolonged analysis of process but does not greatly\nencourage the application of knowledge to action beyond the verbal\nsphere. It is not strange, therefore, that the ancient world should\nhave considered applied knowledge under the mode of rhetoric. For\nwriting made it possible to card-catalogue all the individual postures\nof mind called the “figures” of rhetoric. And these became available\nto all students as direct means of control over other minds. The\noligarchic reign of these figures was swiftly liquidated by printing,\na technique that shifted attention from the audience to the mental\nstate of the individual reader.\nWriting has given the means of segmenting many phases of\nknowing and doing. Applied knowledge by the lineal segmentation\nof outward motion comes with print, which is itself the first\nmechanization of an ancient handicraft. And whereas writing had\nfostered the classification of the arts and sciences in depth, print gave\naccess to the arts and sciences at high speed and on one plane at\na time. While manuscript culture required gloss and commentary to"
}