{
  "id": "d429-111",
  "text": "344\nMarshall McLuhan\nThe movie, which has so little in common with television, may be\nthe last image of the Gutenberg era before it fuses via the telegraph,\nthe telephone, radio, and television, and fades into the new world\nof auditory space. And as the habits of reading print create intense\nforms of individualism and nationalism, do not our instantaneous\nelectronic media return us to group dynamics, both in theory and\nin practice? Is not this shift in media the key to our natural concern\nwith the concept and relevance of myth today?\nPrinting evoked both individualism and nationalism in the sixteenth\ncentury, just as it will do again in India, Africa, China, and Russia. For\nit demands habits of solitary initiative and attention to exactly repeat-\nable commodities, which are the habits inseparable from industry, and\nenterprise, production and marketing. Where production precedes\nliteracy, there is no uniform market and no price structure. Industrial\nproduction without well-established markets and literacy makes\n“communism” necessary. Such is the state of our own ignorance of our\nmedia that we are surprised to find that radio has very different\neffects in an oral society than it had in our highly literate culture.\nIn the same way the “nationalism” of an oral world is structured\nquite differently from the nationalism of a newly literate society.\nIt would appear that to see one’s mother tongue dignified with the\nprecise technology of print releases a new vision of unity and power,\nwhich remains a subliminal divisive force in the West even today.\nUnawareness of the effects of our media these past two thousand\nyears and more would seem to be itself an effect of literacy that\nJames Joyce designated as “ab-ced” or absent-mindedness.\nThe sentiment of spatial and territorial nationalism that accom¬\npanies literacy is also reinforced by the printing press, which provides\nnot only the sentiment but also the centralized bureaucratic instru¬\nments of uniform control over wide territories.\nPerhaps we tend to define myth in too literary a way, as something\nthat can be verbalized, narrated, and written down. If we can regard\nall media as myths and as the prolific source of many subordinate\nmyths, why cannot we spot the mythic aspect of the current hula-\nhoop activity? Here is a myth we are living. Many people have\npuzzled over the fact that children refuse to roll these hoops on\nroads or walks. A mere thirty years ago a hoop was for rolling.\nToday children reject the lineal use of the hoop in an external space.\nThey use it in a nuclear mode as a means of generating their own\nspace. Here, then, is a live model or drama of the mythic power of"
}