{
  "id": "d429-119",
  "text": "-2-\nKJ\nbeen recognized, and nearly every teacher is asked to serve partly as an\nEnglish (i#e. print-based language) teacher# Good courses in this area\nrecognize the interaction between the passage read and the reader.\nEssentially these courses assume print-based patterns of thought and behav¬\nior, as well as communication#\nEach medium not only provides transportation but also patterns for\nthoughts, as rigid in their deepest respects as railroad rails. These\npatterns are imposed not only on educations in the lineally-devised text¬\nbooks, c*sra»icula, and classrooms set up in rows, with student-by-student\nrecitation — but also on industry with its production lines. They tax\nthe ability of teachers and all others of us, who are the products of a\nprint-based education and culture system, to cope with non-lineal impressions\nand messages.\nIn classrooms today, most teachers called upon to guide and control\nuses of radio and television, do so as if these were merely extensions of\nprint and lineal methods and approaches based on print — or merely additions\nto the tools available. Through no fault of their own, they are largely\nunaware of the fundamental characteristics of media themselves, as media#\nlet profound and worried scholars have found that, in the case of\ntelevision for instance, the medium itself, without regard to content,\naccounts for by far the largest part of its total effect# Scholars who have\nstudied monopoly-BBC uses, uses in the USSR, uses by commercial broadcasters\nof the U# S#, and uses for education, find that television^ most profound\neffects are common to all systems and uses, regardless and independent of\nmessage, content, method, use, or intended effect# The most profound charac¬\nteristics of media, as media, have not been recognized by American education\nat the fundamental level at which we must start to study them if utilization\nof, and education in, these media, for teachers and students alike, are not"
}