{
  "id": "d429-120",
  "text": "to be merely gadget-orientecU Unless we recognize the deeper powers and\nimplications of all media, and the role (which we must ourselves delimit)\nof new media, our old print-based educational system may be swept away,\ncarrying with it many elements which desperately need to be preserved.\nThe new media herald a break-through from print-based culture which, if\nnot understood and controlled, can sweep away the classroom itself* Print\ndid equally drastic violence to older educational systems* Television and\nradio already reveal the power to do this to our present print-based system\nof education* The new media will not indefinitely do only the old jobs in\neducation — but also many jobs which could not have been attempted, or even\nconceived of, without the new media*\nIn classrooms today, teachers trained largely on and in print-based\nprocedures, themselves conditioned by and having their entire professional\ninvestment in a lineal, print-based culture, confront children who have\nlearned most of what they know from, and have been subliminally conditioned\nin a way they are not aware of, by electronic, non-lineal media* The role\nof the teacher, and that of print media themselves, are both undergoing\ndrastic changes that have not yet been adequately identified*\nThe principal characteristics of radio, and of television particularly\nare non-lineal, all-engulfing, simultaneous* They involve the whole person?\nkinesthetically, subliminally, emotionally, through all the senses except\nthe sense of smell, in an overwhelming impact that lineally-educated\nteachers, with step-by-step thought processes, find difficulty in adjusting\nto, understanding, or controlling. The misunderstandings which arise are\nnatural. For the new media are, in effect, new languages, no longer lineal\nbut nuclear or spherical in their characteristics and effects. They cannot\neven be adequately analyzed on a lineal basis or in terms of lineal logic*\nTheir effectiveness cannot be tested by lineal, print-based tests, which"
}