{
  "id": "d429-128",
  "text": "as the end-products of this project#\nPublication plans# The present project visualized distribution\nonly to cooperating organisations and agencies and to other research\nand educational specialists# We would be glad to discuss with the\nU# S# Office of Education whether it would itself prefer to publish\nthe results, or would prefer to have them published by the NAEB or\nthe consultant# In 'view of the widespread interest in and need for\nthis type of material and the already distinguished international\nreputation of the proposed consultant as a scholar of the media, no\ndifficulty in securing commercial publication is anticipated if\nthat procedure is preferred#\nV# Personnel# As consultant we propose Dr. Herbert Marshall McLuhan,\nProfessor of English at the University of Toronto^,co-editor of Explorations\nmagazine, and distinguished media specialist, lecturer, and author who has\ndone much work in the field of relating media study to educational procedures#\nVie know of no other individual qualified as well to undertake the profound\ninter-media development outlined here# He is prepared to undertake this\nproject and to finalize the findings into publishable form, supplemented by\nmaterials to be made available on tape and film# Briefer base-line experi¬\nments in inter-media values have already been conducted and reported on in\nExplorations, published by the University of Toronto# The following recent\narticles by Dr# McLuhan illustrate the type of studies he has already done,\n-which have aroused wide interest in many countries;\n(Book) The_l^chanical J3rid@; Folklore of Industrial Man: Vanguard Preaa\nNew York, 1951 -- & 9\n“Notes on the Media as Art Forms,\" Explorations No. 2. Universitv of\nToronto Press, 1954, pp. 6-13 -\nTNew M3dia as Political Forms,\" Explorations No. 3, University of\nToronto Press, 1954, pp. 120-126\n\"Space, Time, and Poetry,\" Explorations No# 4, University of Toronto\nPress, 1955, $p. 56-64\n\"The ABCDE-minded \" Explorations No. 5, University of Toronto Press,\n1955, pp. 12-18 9"
}