{
  "id": "d429-132",
  "text": "<K\nRECEIVED\nNAEB HEADQUARTERS\niViAK 1 7 1959\n** p»\n7|819|10[11,12| 1|2|8|4|5|§\nDear Harry, i\nLet me mention right off some useful break-throughs of the\nlast few days by way of preface to my effort at new draft\nof\"procedure\" section. Perhaps these doodlings may provide\nyou with some clues to tactics that I shall have missed •\n(Was at the Chicago conference on Higher Education. Kerry\nSmith is rather keen on my approach, I may ad^d , in case\nhe can be of help to NAEB in this project. I ran into some\nopposition from the audio-visual groups, naturally. Let\nus say, then, that, whereas print led the world from \"status\nto contract\", today print has become status itself, and\nelectronics are now leading us from status to contact. Our\nmedia now must be contact-oriented ,rather than protective\ndevices for private prestige.)\nBreakthrough No.Is\nDetribalization of backward countries we carry out\nvia literacy^assembly line, industrial culture. Result is\nIndividualism and nationalism in these areas, as it was with\nus in the 16th century,etc. Meantime we via electricity are\nretribalizing ourselves. That is, we create a global village\nin which every event vibrates with every other event— including\nthe violent effects of swift detribalization. But retribal-\nization evokes new yearning for stability, security, and\nequilibrium in the old centers of technological innovation.\nTribal^simultaneous world s oral-aural. When everything\nhappens at once nobody wants anything to happe^n. The young\nbecome arch-conservatives today. \"Conformity\" is very mis¬\nleading here, because it looks back to earlier i^deals of print\nculture^ plot <rj , t\nBreakthrough No.2:\nThis one is simpler and smaller, perhaps. Reason\nwhy kids \"canft read\" is because they instinctively now read\nin depth— not forward. Like return to manuscript,which was\nread almost statically and at several levels at once, with\nglosses, illuminations, etc., like comic book or Life mag.\nBy the same token, high-brow paperbacks can sell to ordinary\nreaders who formerly read forward at gallop in narrative style.\nSerious books can appeal to ordinary readers when read slowly.\nLibrarians report decline of kid interest in fiction. New\npreference for fact books. Same in the big mags. The fact\nthat article done in cinematic style supplants fiction i n\nSaturday Evening Post.\nBreakthrough No.5;\nTV hobby shows donft lead to kids making things at\nhome. Why? Because they have Hftde * em alread y via TV image\nPoint is this, you are the se&lpel or Chisel on TV, but not\n29 Wells Hill Avenue\nToronto 10, Ontario,Canad a\nMarch 14, 1959"
}