{
  "id": "d429-133",
  "text": "*\nwith movie. TV image includes consumer as co-producer alike\nin Dick Clark show or surgical/operation show. ^Finally,\nBeading Perception by Wm. H. jBe Is on? an d Hadley Cpntril^\n,fA Transactional Approach”. \"I think they come closer to\nour media view than anybod-y else. nTransac tion” amounts\nto simultaneous interacting field. Let me suggest that we\nkeep in mind that the impact of media forms has always been\nsubliminal and nonverbal until hoicked up into daylight by\nartists. Most people seem to feel \"safe” so long as their\nassumptions are unspoken and non-verbal. Artists as blabs and\nrevealers of inner postures and attitudes used to be a nuisance\nNow they are indispensable. From ivory-tower-to-contro 1-\ntower sort of thing.\nOne theme, Harry, of which I am increasingly aware is the new\nproblem of coptinuitv in a world of accelerating change.\nDrucker points out that in the business world the awareness\nthat technicological change could put them , any of them, out\nof action in afew years has led to capital investment in\nresearch as by far the heaviest item of expenditure. In other\nwords, don't wait for change, rather become change and control\nit from wi thin.\nNow educationally our idea of positional ”warfare” is as\nobsolete as the assembly-line, or delegated authority structures\n(cf. Drucker, p.96). We shal 1 have to institutionalize\nchange educationally just as Business has done. And this\nmeans spending ,perhaps, ten times our total present budgets\non research. We must effect a means of continuous transition\nat all levels and in all age groups simultaneously. So that\nwe must abolish our present idea of education as that done for\nthe voung. In our kind of electric technology education becomes\ninclusive of all ages and all interests. The global community\nof learning can be nothing less than that literally. For\nhundreds of years we have gloried in the discontinuities and\ndestruction caused in society an^ *ts institutions by innovation.\nIn the age of simultaneity this becomes intolerable.\n£« vl*U oJlv a juc c* ^\n) &] ia/U^A ^ & k*\n^ Mj A lA-'f / ycl rfvjL-r\nQXiMurf V'-'-<rXAI a-j ji ^ . <S\\ ^ yUA CL«?- f\n£ . 'X <Lo—^ fp^e # ixCva-yj ^ c r\nTk fccrSfc Wv .v\\..j lo^i ^\nU c C-j v V*-f U> icn$~)c cT^ <XX^'~e"
}