{
  "id": "d429-135",
  "text": "1\nPROCEDURE:\nAs Pet9r Drucker insists at the outset in his recent Landmark s\nof Tomorrow,we have moved out of the modern age in the past\ntwo decades into one for which we have yet no name or concept•\nThe new media are themselves the image and motive-power of\nthis new age. So that Understanding Media must become a book\nby the same means and procedures that necessitat e such a book,\nfollowing the contours of the new reality. In the electric\nage of simultaneous data from many fields ,there is an over¬\nwhelming drive back to the human dialogue as the instrument\nof discovery and awareness. Understanding Media will show\nwhat we already know about media and their action upon human\ninstitutions by setting up the basis for dialogue between student\nand teacher, student and student, expert and expert. Since\nmost of usllivein and through the new media all our waking lirves,\nwe already share *th all age groups the implied-t non-verbal\nknowledge and experience which education seeks always to make\narticulate verbal and explicit. The discovery of the&ealth\nof such shared experience via dialogue and utterance is a\nperennial creative experience which,since the fifteenth\ncentury,book culture may have done something to diminish.\nBut Understanding Media will proceed to show the unique\nproperties of older media including the book in a variety of\nways. For example, the older mediaof book and press are now\ndetribalizing many backward countries where it is easy to\nstud y the effect some of these media once had on\nourselves in the Western world • Our contemporary world is,\nfrom a technological point of view, almost a continuous historical\nmovie of episodes from the Western past, ^nd our own past\nachievements are revealing monuments to the shaping powers of\nphonetic script and print in the development of human freedoms\nand our own patterns of culture. The transforming effect\nof the TV image on habits of reading in depth , the relation\nof radio to habitsof study, and of the typewriter upon habits\nof thought ,speech, and writing, are nowhere gathered together/^\nin one place for thoughtful inspection. But they have been\nknown to scattered students for some time. To get most of\nthis kind of knowledge and insight into Understanding Med la\nwould entail a variety of procedures in presentation, followed\nby detailed questions for discussion and readings and audio¬\nvisual materials to aid such discussion.\nPerhaps one desirable form of presentation could be handled\nby kinescopes which could be available to the users of the\ntext. The GBG in Toronto &as offered to script and make\nseveral (perhaps a dozen) half-hour kinescopes to promote\nscrutiny and understanding of the principal med ia of the\nWestern world. Now since te]s vision seems to be the medium\nwhich most seeks and reveals the creative process and the\nlearning process itself, it would be easiest to use television\nto explain the origins and roles of various media in the so&ial\nand historical process. Since, historically the^nedia usually\noverlap, it becomes natural to use the method of comparison\nand contrast as between train, car, plane, or manuscript."
}