{
  "id": "d429-137",
  "text": "3.\ndivision of the CBC,are close friend s and colleagues, both\nPh.d.f s in English literature\nWith the use of films, tapes, and kinescopes it will be possible\nto test the materials and media biases in several geographic\nareas and grade levels at once. And many people have expressed\ninterest in testing such experimental materials in their schools\nand colleges. Here the results achieved, with different orientations,\nfrom various types of projects, of different grade levels, and\nin different geograohical locations, a working document will\nbe prepared on thejrfabasis of which the organization of material\nfor subsequent re-checking and final reporting, editing and\ndistributing, will be developed.\nIn other cases different groups will be used in agiven location.\nWhere possible,control groupings alread y available for on¬\ngoing studies will be used. In other cases such groupings will\nhave to be established on the basis of known sex, intelligence\nand reading readiness, emotio nal and parental back ground,\nreligion, and other data available.\nIn all cases emotional, sensual, kinesthetic, attitud inal,\nand subliminal ,as well as purely intellectual and fact-transmission\nchanges willbe sought outin the new testing techniques to be\nevolved. Attitude and inter-action effects, among students,\nand between students and teacher, will be observed and recorded\nfor later study, analysis and elaboration in the texts being\ndeveloped.\nCooperation in developing testing materials has been offered\nby various stations and institution s in the U.S.,as well as\nby the CBC, which has offered its facilities, and research\ndepartment cooperation, without charge, for this purpose. Tantative\nlocations for demonstration-experiments, from which invitation*\nhave already been received, now include St.Paul, Boston, NewYork,\nand Urbana, as well as schools in Canada. Cooperation in\npreparing materials has also been offered by Andr^ Girrard ,\ndistinguished artist, who is now experimenting with word and\nimage at CBS and NBC.. This project has also been submitted,\nin draft form, to various other media experts, including Dr.Henry\nCassirer, of UNESCO, who is preparing a book o n educational\ntelevision. The enthusiastic cooperation of these scholars\nis also assured."
}