{
  "id": "d429-14",
  "text": "-2-\nhave an overwhelming impression of the words as being audible, and are\nquite surprised to learn at the end that there was no sound track. He\nis experimenting constantly with the relation of word, movement and\nimage in TV and film, and is eager to pursue these experiments in any\nway that would help in the Understanding Media, project. This Life\neditor and I went on to Philadelphia to meet Gilbert Seldes andHarry\nSkomia. Seldes simply said, \"Understanding media, grammars of the\nmedia, that*s what we're here to do, so naturally wefre tremendously\ninterested.” I thlricwe 3 an count on a full and hearty cooperation\nfrom Seldes in this effort. There1# no occasion for rivalry or\nJealousy at this stage in such a project simply because the territory\nis so vast, and the available insights which haven1t been garnered\nfrom various sources are so numerous that nobody could possibly feel\nvery greedy about this.\nI talked at considerable length with Arthur Wells Poshay, who as you\nknow is an enthusiast for this 1 medium is the message • approach, and\nwe talked about the possible ways of testing such a factor in percept¬\nion, supposing it were validly there, and albeit subliminal, and he\nwas quite agreed that the motivational research methods would be rel¬\nevant and valid in tackling this problem, he was agreed that the\npresent methods of testing content would be a waste of time. He felt\nthat the Amheim, Ames, Gantrll, Ittelson group of Gestalt, Transact¬\nional psychologists probably had more to offer in the way of method,\nat this stage at least, than anybody. Actually, the Transactional,\nGestalt, configurational approach to perception is merely one which\nassumes that it is possible to pay attention to more than one thing\nat a time, that a kind of field of perception is normal, so that If\nany factor enters the scene which fosters or favors a one-thing-at-a-\ntims approach, it will necessarily drive the rest of the field of per¬\nception into She so called subliminal area. That makes it possible to\nsuggest that from the beginning of alphabetic writing, you have the\nbeginning of the one thing at a time method of attention, fragmentation\nof fields of perception*\nThe alphabet itself, at least 2500 years ago, set up this fragmentation\nof the field of attention, and automatically therefore released the\nbeginning of the process of pushing all except one thing at a time into\nthe subliminal area, so that as James Joyce puts it. literary cultures\nare \"Abced-minded , the puns absentmindecJ and ab-said minded are rel¬\nevant. It is literally true to say that a literate culture is schizoid*\nIt has to be In order to achieve the ends it sets itself of applied\nknowledge, of breaking things up into bits so that it can master them\nand hold them statically for analytic purposes - such a culture inevit¬\nably disintegrates itself systematically, organized disintegration of\nperception is the very technique of such a culture, and such has been\nthe course pursued in the Western world for 2500 and more years. Now\nin our own time, the past century at most, since the commercial use of\nthe telegraph in 1850, we have moved into an all-at-once world, in so\nfar as electronic means permit a simultaneous field of information to\nexist, whether in the newspaper, or now on the TV image - and what is\nso obvious about this revolution is that it is an all-at-once rather\nthan a one thing at a time field of perception which is offered for\nhuman attention. This, as I have suggested many tines, many places,\nis also to say that our western culture has shifted from a visual\nanalytic stress, to an auditory, synthetic integrating stress - for\nthe simple reason that an all-at-once field, mosaic of items, possesses\ninevitably an auditory space character."
}