{
  "id": "d429-15",
  "text": "►3«\nAuditory apace, as the psychologists have shown us for a long time, is\nsimply a simultaneous field of relations which is created by the very\nstructure of auditory perception, namely that we hear from all direct¬\nions at the same time, thus creating in the very act of hearing a field\nwhich is spherical, and yet without boundaries, is contained in nothing\nand contains nothing, in short a non-visual field. This non-vlsuallzable\naspect (note the silly visual metaphor in aspect) is what gives the\nRussians their easy advantage over us in modern physics and mathematics,\nnamely that they do not find the same urgency to visualize experience\nor problems that we do in the west. It was Lobachevsky in 1830 who hit\nupon non-Euelidian mathematics, but all Oriental peoples have an equal\nfacility in non-Euelidian mathematics, and therefore a kind of affinity\nfor modern physics and electronics, which will shortly give them a huge\nadvantage over the Western world. This strictly concerns the role of\nvarious media in our future educational programs - not to understand\nthe dynamics of this situation would be quite fatal. For example, the\nUnited States in 1750 took over the latest European technology, namely\nthe printing press, and allowed it the fullest play technically and\neducationally, and politically. Industrially * because there were no\nstrongly established institutions and vested Interests based on an\nearlier technology, so that the Europeans were hopelessly hindred in\ntheir exploitation of print technology by their huge backlog of estab¬\nlished culture, whether feudal and oral, or architectural, institution¬\nal. We on this continent, being without such previous achievement,\nwere free to exploit the new. Such is the case even in Switzerland\ntoday, where their lack of massive industrial backlog gives them a\ngreat advantage over General Electric and Westlnghouse in using the\nlatest electronic technology, and the Japs also, and all parts of\nthe world that we list as undeveloped countries* Their lack of pre¬\nvious Investment in massive industrial technology will shortly appear\nas a great advantage in the electronic age.\nThis applies equally to education, because the subliminal backlog of\nliteracy when it meets the conscious, or overt technology of the\nelectronic or photographic even, is deeply puzzled and bewildered by\nthe confusion of Imagery and confusion of configuration* This raises\nthe question, or the systezy as it were, of why literacy should be\nItself the major cause of unconsciousness of media. It's very import¬\nant to discover why literacy in itself has created vast areas of\nInattention and unawareness ana insensitivity In human sensation,\nand in human judgment* This kind of blackout, or brainwashing, is\nsomething which we can see happening today, in areas in which a new\nmedium of communication overrides an older medium. In the Arab world\na recently commenced literacy has been overwhelmed by the arrival of\nradio. Such may also have been the case In Germany, Italy, Spain and\nother countries in the 1920's when radio revived their tribal mores\nand attitudes* Perhaps it was just because literacy and Industrial\nforms had been so recently acquired that they were so easily rubbed\nout, or overridden, by radio. I'm here suggesting that we could well\nafford to study radio as a powerful retrlbalizing factor* I've already\nsuggested that we study the whole of the electronic in this respects\ntriballzlng in the sense of once more reviving a sense of urgent need\nfor forms of human association which are family and clan patterned, and\nrubbing out as quickly as possible the conractual, the written and the\nlegalistic - the very form of the citizen as understood in Roman law,\nin favor of a return to the family tribal pattern.\nWhen the world becomes a global village, by virtue of the Instantaneous\nconfiguration of information, daily, hourly, when everything happens"
}