{
  "id": "d429-158",
  "text": "-2-\nare unaware of the fundamental or basic characteristics and affective effects of media\nas such.\nSuch individuals necessarily concern themselves in teaching solely with superfi¬\ncial and obvious uses which grow out of an essentially amateur approach. If maximum\nuse of these media is to be made it is urgent that a body of information be developed\nwhich will provide a solid foundation for such courses, not based on guesswork or\nassumed transfer of common elements among the various types of media.\nSerious scholars now recognize that a large proportion of the effects of television and\nradio are often unintentional or unintended ones. A large part of the impact of these media\nis not dependent on the content transmitted. Scholars of educational, commercial,\ngovernment-controlled, and other systems in the world, in other words, are beginning\nto discover that most of the cumulative psychological and conditioning impact of televi¬\nsion and radio is independent of the message communicated. In many respects, in fact,\nthe medium itself is the message or a large part of it.\nThe number of elements which characterize the effects of the use of these media as\nsuch, regardless of their content, their message or the system under which they are\noperated, illustrate the need for research in depth and experimental evaluation on the\nbasis of which the teaching of procedural and methodological uses.of a socially and\neducationally responsible type can be soundly based. Without such a foundation, many\nunintended effects and “side-effects** will continue to result, and more accidental suc¬\ncesses and abuses are likely to occur than soundly-based maximum effectiveness uses.\nToday the movement of informs tion around the clock and around the globe is perhaps\nthe largest industry in the world. Our classrooms take little note of the fact that\nstudents receive by far the largest part of their information in forms about which the sfcuderrt\nunderstands as little as the\nteacher. T\nThe icon world of the photograph and the advertise-"
}