{
  "id": "d429-159",
  "text": "3\nnent has its own language capable of 5 ‘total statements without lineal syntax” as \"William\nIvins has expressed it. Yet the concept of \"'audio-visual aids”, or television and radio\nas variants of such aids, ignores their real nature as new forms of communication. Mot to\ngrasp and teach the peculiar properties of these media, as we must understand the true\nnature of print as having distinct characteristics, strengths and weaknesses, is to ex¬\npose all media to the attrition of the new media rather than enrichment in concert with the\nnew media. The telegraph, telephone, radio and television create patterns of attention\nquite alien to print, and put our huge cultural stake in the printed work in jeopardy by\n*\nindifference and inattention in the classroom.\nTo teach the special powers of these new media in the context of manuscript culture.\nprint, pictorial Journalism, the movie, and all other sources of information, education and\nconditioning, is to begin a realistic educational program of training in media literacy.\nUntil now, few individuals other than a very few poets, painters, musicians and certain\ncommercial uses have sefously tried to cope with the new art forms involved in these new\nmedia. Education has generally not examined their true nature and possibilities. Yet\ntoday the new media have become an integral factor in our global co-existence, for which\neducation should be training our citizens •\nHI. Objectives: To develop a manual and syntax for basic training of media perception\nand judgement in the schools, with emphasis on television and radio. Since all media,\nfrom the phonetic alphabet to television, are inseparable from the development of the arts,\nsciences and social institutions, it will obviously eventually be necessary to correlate\nmedia training with almost every aspect of the existing curricula and the procedures asso¬\nciated with them, much as reading, writing and English are treated today, particularly in\nelementary and secondary education. All current experiments with these new media would\nbe useful and relevant to the preparation of such a book or syllabus. It would be a means"
}