{
  "id": "d429-16",
  "text": "everywhere at the same time, then the dimension of global village Is\nautomatically conferred upon the world situation, and all the strange\npsychological patterns of village behavior seem to be rediscovered and\nreemphasized by men.\nI found your essay on Research in the Newer Educational Media of great\nhelp, and reading it makes it appear even more obvious to me, that the\nobsession with content analysis in psychological testing of media is\nitself a subliminal factor carried over from unconscious patterning of\nmind from print technology. One has only to say this in order to see\nthat a mind which has accustomed itself to codifying experience vis¬\nually, on the page, becomes completely unaware of the packaging device\nso employed, and thinks of content as a completely dominant fact, and\nof vehicle and container as unimportant, relatively, as features*\nI think my Gutenberg book will offer a sufficient quantity and continuity\nof testimony on the effects of the forms of writing and printing to make\nthis completely convincing, because one has only to consult the changes\nin the arts of poetry, and prose, and painting under the impact of var¬\nious developments in print technology, to trace the exact lines of\nforce which that technology exerts* This raises a very basic question\nabout media research*\nI mean the factor of translation from one language .into another as a\nrevealer of the properties of both, so that as Rene Clair put it in a\nTv show a few months ago, when two people appear on the stage, it is\nnecessary that the dramatist motivate and explain their presence there.\nWhereas the movie camera can look at anything, or follow any group in\naction without the slightest need for an explanation of why it chooses\nto do so* The grammar of the camera eye, what it includes and excludes,\nis best scene when it encounters another medium. The same is true of\npoetry and painting. The problem of arranging images verbally, of\ncreating time and space situations, and point of view, tone and attir\ntude is quickly revealed when a poem attempts to present some of the\neffects of a visual composition* In other words, if the new media\nare also new languages having specific and limited powers of statement\nand codification, these are most quickly revealed in their profiles\nor grammars, or lines of force and reality by Juxtaposition and inter¬\npenetration. Thus the movies have learned fast about themselves through\nhaving to produce for TV purposes. Radio learned about its unique\nproperties, and its Indispensable contribution only after TV smacked\ninto it. From this point of view, may it not prove feasible for me\nby questionnaire and interview to extract from the technicians in the\nvarious media a testimony of what has been revealed to them concerning\ntheir media since the impact of rival media. In short, why can we not\nsift the innumerable anecdotes from within the media world as a kind\nof Involuntary evidence concerning media contours*\nAs a final overall observation, is it not plain that understanding media\nmeans the raising of the subliminal levels of all media experience for\ninspection and scrutiny. Is it not equally plain that our century as\nan all-at-once century has accepted the challenge of the elimination\nof the subliminal on all fronts. This of course is what is meant by\nsaying the medium is the message” because it is only by abstraction\nof the specific literate type that we ever came to think of the message\nas separate from the vehicle. In an all at once world of Ulanovas and\ngijcel Marceaus, it has become Impossible to fragment experience in"
}