{
  "id": "d429-165",
  "text": "s\nqualifications, and the springboard to this project. Th© foUowing recent articles by Dr.\nMcLuhan illustrate some of the preparatory work which he has already -engaged ins\nVII.\nIhe Mechanical Bride; Folklore of Industrial Man; Vanguard Press, NY, 1951\n“Notes on the Media as Art Forms”, Explorations No. 2, University of\nToronto Press, 1954, pp. 6-13\n\"New Media as Political Forms”; Explorations No. 3, University of\nToronto Press, 1954, pp. 120-126\n“Space, Time, and Poetry”; Explorations No. 4, University of Toronto\nPre^s, 1955; pp. 56-64\n“The ABCED-minded” Explorations No. 5, University of Toronto Press,\n1955; pp. 12-18\n“The Media Fit the Battle of Jericho”;Explorations No. 6; University\nof Toronto Press, 1956, pp. 15-21\n“Classroom Without Walls”, pp. 22-26\n“Jazz and Modem Letters”, pp. 74-76\n“Effect of the Printed Book on Language in the Sixteenth Century,”\npp. 99-108\nExplorations No. 7, University of Toronto Press, 1957\n“Television Murders Telephony”\n* 'Verbi-voco-visual99\n“People of the Word”, etc., pp. 1-75\nExplorations No. 8; University of Toronto Press, 1957\n“The Electronic Revolution in North America” in The International iUterarv\nReview, No. 1, pp. 165-170; John Calder, London, l95%piZ$,30^34^\n“Culture Is Our Business: The Meaning of the New Electronic Media”NAEBTpurnal 12/58\nFacilities: Dr. McLuhan would have to travel a good deal in order to consult with—\na wide variety of persons in all phases of media work today and to use as resources many\nprojects in progress, both in the U.S. and Canada. He would also need to set up several\noriginal text experiments and demonstrations for testing the intelligibility, teachability\nand validity of the materials developed.\nSeveral firm offers of cooperation have already been received to cooperation in this\nproject, including invitations from Boston University; Educational TV Station KTCA on behalf\nalso of the Public Schools of St. Paul, Minnesota; and St. David's School in New York.\nOther bases of experimentation and demonstration can be made available through members\nof the NAEB and various experimental schools and laboratories in the U.S. and Canada, as\nsuggested in Section V above. The gratifying recognition by virtually all with whom this has\nbeen discussed that it Is basic to an intelligent development of valid courses, valid utilization"
}