{
  "id": "d429-189",
  "text": "HI\nR. CASSIRER.\nNorth 20th Place\nArlington 7, Va.\nDr. Harry Skornia\nNAEB\nGregory Hall\nUrbana, Ill.\nRECEIVE\nNAEe\nJAN 2 2\nJan. 20th, 1959\nDear Harry,\nI have read your draft proposal with much interest.Be fore\ncommenting on the paper itse f, I should like to make a few observations:\n1) I doubt that it is practicable to isolate the \"electronic11\nmedia for study and to contrast them with print. This leaves oyt the\nfilm, photography and to a certain extent graphics. It is significant\nt at much of your bibliography refers to the film. I think tha.t-y.Qn\nmust take these \"new\" media globally and then analyse them separately\nin greater detail but that any study which leaves out the film, in par-\ntTcuTaF, will fail to build on acquired knowledge and be arbitrarily\npartial. I realise the limitations in the area which is the responsibility\nof the NAEB, but do not think thi3 limitation should be applied to\nsuch a project.\n2) I think a study of these media is essesriial from an educa¬\ntional point of view not merely to teach the student*'but to teach the\ntifffHtt~ vjliM,Tr other words, the pro.1 ect\nobjectives: proper media utilisation and proper media apprSclarfonT\nThis will have an immeuiately practical result for educational broad¬\ncasting.\n3; Any study of this kind should take note of considerable\nthought ana experience on this subject in other countries. I refer in\nparticular to the work of the British Association of Film Teachers,\nthe work of \"filmologlsts\" in France and elsewhere, and reports in\nvar ous Unesao publications on the use of audio-visual media in school,\nadult and fundamental education.\n4) A distinction should be made in the use of these media for\nthe purposes of education, their utilization as tool* of the learning\nprocess and the appreciation(critical, analytical on the one hand,\na source of positive experience' on the other) of these media when used\nTQr general communication (entertainment, information, advertising etc.).\n5) I would have welcomed a^very concrete passage under a sepa¬\nrate s ction entitled: Method. There are references to this nnder\nProcedure and Facilities, and elsewhere, out method is neither one nor the\nother, and the project is liable to oe judged to a considerable degree\non the convincing explanation of the practical work it implies.\nI have underlined the paragraphs which seemed to me especially\npertinent, tho gh others might be added. I also raised some marginal\nquestions. As far as the lead* para is concerned, its version would depend"
}