{
  "id": "d429-201",
  "text": "- u -\nwhether one regards the number of networks, or the number of program producers*.\nPossibly the most striking evidence of the importance of this view of broad¬\ncasting is offered by the industry terminology,. They speak of the industry\nexisting on the basis of \"time sales\"« The station sells the use of its trans¬\nmitter for clock«hours of time at prices which reflect the probability (derived\nfrom audience surveys) that stated numbers of persons will devote the same\ndock-hours to attending their receivers,, Negative evidence of the authori¬\ntarian implication of broadcasting comes from the absence of capacity for the\nviewer or listener to \"feed-back\" his reactions to the broadcaster. In\ndesigning our broadcast plant the engineers were not called on (as they might\nhave been) to build into it capacity for \"feed-back\".\nThe policy of the business organization which operates our TV and\nradio system and motion picture industry is essentially the same as that of\ncultural industry^ as a whole. Nor is this surprising, for whether it is\nadvertiser-supported (as presently is true for TV and radio) or supported by\ncustomer payments (as is true of motion pictures) the same economic considera¬\ntions prevail,? Elaborate technology and heavy capital investment in both\ncases demand that there be mass production and mass consumption. For this to\nhappen there must be constant pressure to capture the largest possible audience.\nInevitably homogenization results. A recent and clear statement on this point\ncomes from Richard S„ Salant, Vice president of Columbia Broadcasting Systems\nInc. I\n\"What we in the business must remember if we are to survive,\nand what our severest critics, iPnot our best friends, push\nunder their mental rugs, is that network broadcasting serves all\nthe people*, Unlike a newspaper, it does not have the comfort of\na local or regional audience bound together by the common values\nf/ By \"cultural industry\" I mean the business organization and policy for prod¬\nucing and marketing all consumer goods and services, including the products\nand services of the mass media."
}