{
  "id": "d429-34",
  "text": "Grant letters will contain a minimum of conditions which upon accept¬\nance by the grantee will consummate the grant. Acceptance of the grant\nby the grantee should be indicated by an authorized official of the insti¬\ntution signing a copy of the grant letter in the space provided and re¬\nturning this copy to the New Educational Media Branch, Office of Education,\nDepartment of Health, Education, and Welfare, Washington 25, D. C.\nPayments\nThe first payment on a grant will be made within approximately two\nweeks after receipt by the Office of Education of the signed letter of\nacceptance. Subsequent payments will be made quarterly, semi-annually,\nor otherwise, as designated on the dates specified in the grant letter.\nWhere future support is contingent on subsequent appropriations by Congress,\ngrantees will be informed by letter of the additional amounts authorized\nand the dates on which payments of the funds will be made.\nNo invoices for payment need be submitted by the grantee inasmuch\nas payments will be made automatically in accordance with the schedule\nindicated in the grant letter.\nIf, during the life of the grant, fiscal reports indicate that the\nactual rate of expenditure will deviate materially from the estimated\nrate, the Office of Education may consider it desirable to reschedule the\nremaining payments. In this event, the opinion of the grantee will be\nsought regarding the contemplated adjustment and, on the basis of such\ninformation, a change in the schedule may be made. Conversely, the Office\nof Education will at any time be glad to consider a request initiated by\nthe grantee for a revised schedule of payments.\nChecks will be made payable to the grantee institution, attention\nFiscal Officer. The grant number will appear on each check immediately\nfollowing the address of the grantee.\nAny funds paid to the grantee in excess of the actual cost of the\nresearch conducted under and chargeable to the Office of Education grant\nmust be returned by check to the U. S. Office of Education. Such repay¬\nment should accompany the final fiscal report.\nAccounts and Records\nThe grantee shall maintain books and records which will show all\ncosts incurred under the grant, in accordance with generally accepted\naccounting principles. The grantee shall, at all reasonable times dur¬\ning the period of the grant and for a period of three (3) years after\nfinal payment under the grant, make available for inspection by authorized\nrepresentatives of the Office of Education and the General Accounting\nOffice, at the office of the grantee, all books, documents, and other\nevidence bearing on the income, costs, expenses, and operations of the\ngrantee in connection with the research conducted under the grant."
}