{
  "id": "d429-47",
  "text": "29 Wells Hill Avenue\nToronto 10,Ontario,Canada\nJune 10, 1950\nThis may have over-all relevance for PR in this project:\nLocally people say when they hear: \"McLuhan must have\nbeen right about media all along,w\nSame pattern might be workable elsewhere.\nNow the Edgar Dales are simply working on media content.\nThey have never faced media as media. How can we scare\nthem into an experimental effort and critical examination\nof their own assumptions? Does he know the Transactional\nSchool of psychologists? Could we get somebody to write\na letter of inquiry to his New3 Letter asking whether\nArnheim, Ames, Piaget, Contril, and Ittelson types of\napproach would be more valid for media study than fee\ncontent analysis? That is, the configurational rather\nthan the fragmentary.\nI have written to Foshay, Max Goldberg, and. others asking\nthis question. I am now working on the structural linguists\nfor the same information about media as languages. They\nwill be helpful.\nLet*s not be scared, Harry! But what we are talking about\nhere is a far jigger and more radical change than Dewey ever\nthought of. But events are even more with us than they\nwere with him. So it will go. We will win.\nLet*s keep in mind that general theory isthe dynamic or live\nmodel./that produces all the mechanical test models; e.g.,Dewey* s\n\"learning by doing\". \"Medium isthe message\" is just as\nradical and reveals the subliminal structures in learning\nand ability at a glance. Associated with this dynamic model\nis the factor of learning saturation via ads, radio, movie,\nTV by the age of three or four, as with mother tongue.\nSaturation creates subliminal backlog steadily, just as we\ngo dead on all the live metaphor in our language very quickly.\nTo switch £ moment. It should be easy to collect data from\ntechnicians about the changing problems of relating sound to\nimage in (a) talkies vs old silent pix; (b)TV vs talkie;\nre Girrard would help here.\nIt is by division of labor that pre-literate man moves\ntowards the dissociation of his senses,which leads to\nwriting— thevisual form of the audible. Today we go backwards"
}