{
  "id": "d1199-1",
  "text": "/•\nNAE3 NEWS LETTER\nU\n,..B©o»\n15, 1939\npage 2\nWe hope to have net;8 tor 1 • ter. Those stations represented\nwho felt they migjti reb? : ;. f programs of WRUL were advised to\napply to the FOG for pei • : i. It is thought such action might\naid the pending application of Mayor F. H. LaGuar&ia.\nIn\nMr, William D* Bomwell of the United Statef? Office of Education\nm&c an informal resort on i valuable assistance given education\nby radio throughout the Uni•; b States in co-operation with the\nOffice of Eduoatior A formal report was promised by Mr,.\nBoutwall for a late ’ fo.to. '.ban it is prepared you. will be eient\na copy,\nSOW,„ABOUT .FREfliESO KOjkUJl-jR\nI hate to harp on thlr ~u ?.tf but I*m going to do eo whether\nyou like it or not- Just fc:>: your own. good* Already about\ntverty-five applicatiefn?» for this type of broadcasting have been\napproved by the FCC and every station on the air has reported\n\"remarkable success,M Some already feel that frequency modulate-m\nis beyond the experimental - c«tage* For your further Information\nyou fiiight ears to read the October \\mm$ of \"Fortune* and the\nNovember ic«euo of Electronics, * Just in eofie you m? have risked\nthese articles.\nWHAT DO YOU WANT?\nBusy Waldo Abbot of the University of Michigan has sent your\nsecretary copies of a number of things vsbich he sends out to men\nteaching broadcasting. Included in hia packet were; Educational\nPrograms Heard in Detroit; Choral Speaking Bibliography; Recommended\nReading for Students of Non-Technioal Broadcasting; Urinal Exssiaation\n^Broadcasting, Speech 153; Outline of Speech 151, Fundamentals of\nBroadcasting; Lette . ants in Speech 152 Radio Speeches;*\nScript©, on Writing Play, Development of Oommunc?.tions,\nand History of Radi- : on The Santa-Fe- Trail and Tee Pirate\nDor* Burke of Dowdec, 'ling; First Pronunciation Hurdles\nfor Good’ Hadir Spec-, h; suggested these titles on broadcasting,\nThose marked (*) wi .a&ed in a future NAEB packet. Others,\nI*m sure Waldo will be. , to send you upon request,\nRADIO .ACTIVITIES aql at:m caroliha_-\nMr. R. K. Director of the Extension Division of the\nUniversity of North Carol lnaf Chapel Hill, North Carol inn {) hoc\nrecently made an extensive tour studying the radio broadcast\nsituation within many of the nation* $ leading education insti¬\ntutions, He tells us that North Carolina is going to make more\nextensive use of radio in -be future*"
}