{
  "id": "d1791-6",
  "text": "Network Questionnaire Mailed\nE. G. Burrows, chairman, Network Acceptance com¬\nmittee, has recently mailed to all Network members a\nquestionnaire requesting information about their pro¬\ngraming needs and desires.\nThe questionnaire seeks to learn more about the\ntypes of programing wanted by member stations, in\nvarying time lengths and covering various subject\nmatter. This information is essential if the Network\nis to serve the members in the manner they desire,\nand all members are urged to fill out the questionnaire\nand return it to Burrows promptly.\nPublications\n• Radio Transmitters, by Laurence Gray and Rich¬\nard Graham, is a new technical guide to engineering,\noperating, and maintenance aspects of radio trans¬\nmitting. The 480-page book is published by McGraw-\nHill and costs $12.50.\n• NAFBRAT has surveyed crime on TV before\n9 p.m. A pamphlet giving the results is available for\n45 cents from NAFBRAT, 882 Victoria Ave., Los\nAngeles 5, California.\n• The 15th edition of World Radio Television\nHandbook is ready for distribution. Published by\nWorld Publications in Denmark, the book can be\nordered through booksellers.\n• Barron’s Guide to the Two-Year Colleges, by\nSeymour Eskow, is a 320-page directory of junior\ncolleges. It is priced at $2.98 paperbound and $4.95\nclothbound.\n• The St. Louis Post-Dispatch quoted on the editorial\npage of its February 5 issue Rod Serling’s article on\ncontroversy which appeared in the January-February\nNAEB Journal.\n• The Television Business, by Warde B. Ogden,\ntells of TV’s unusual accounting problems and weighs\nthe pros and cons of various possible solutions. Pub¬\nlished by The Ronald Press, the book sells for $6.\n• Donald Tarbet, associate professor at the Uni¬\nversity of North Carolina, writes that his book, Tele¬\nvision and Our Schools, is off the press. It deals\nwith the utilization of TV for in-school viewing and\nfurnishes information about programing, facilities and\nequipment, and administrative problems. The book is\npublished by The Ronald Press and sells for $5.\n• Philip Jacobson from Motorola headed a task\nforce which prepared an ETV equipment manual\npublished by McGraw-Hill. The book sells for $4.95\nand covers the technical applications of such facili¬\nties as translators, videotape, and CCTV library refer¬\nence systems.\n• Printed copies are available from the NAEB of\nFCC Commissioner Robert E. Lee’s speech on “UHF:\nThe Answer to TV’s Big Question,” which he de¬\nlivered before the Kiwanis Club of Harrisburg,\nPennsylvania, December 29, 1960. The booklet, printed\nby the Keystone Stations, contains Lee’s analysis\nof the allocation dilemma and his solution via an all-\nUHF system.\n• Television and Education is a bibliography avail¬\nable free of charge from Department NA, Television\nInformation Office, 666 Fifth Avenue, New York 19,\nNew York.\n• Adler Electronics Inc., One LeFevre Lane, New\nRochelle, New York, has issued a free brochure\ndescribing how communities and school systems can\nuse TV translators to receive programs from distant\nETV stations.\nNew Products\nGPL Division of General Precision, Inc., has an¬\nnounced a small, low-cost microwave relay link\nideally suited to the linking of pickup and viewing\nlocations in CCTV systems. The Type 420A is a 0.1\nwatt 5 me bandwidth system operating in the 10,500\nto 13,200 me frequency range for point-to-point FM\ntransmission of TV signals, one-way voice communi¬\ncations channels, and data channels. A descriptive\nbrochure is available on request from GPL, 63 Bed¬\nford Road, Pleasantville, New York.\n• The Advance Products Company, P. O. Box 2178,\nWichita, Kansas, has announced a TV table designed\nspecifically for classroom receivers. The new stand\nwas developed through close cooperation with Clif¬\nford D. Miller, coordinator for audio-visual education\nfor the Wichita public schools.\nMeetings\nApril 6-7: 3rd annual meeting, Council on Medical\nTV. National Institutes of Health, Bethesda, Mary¬\nland.\nApril 21-22: NAEB Region II annual meeting. Hotel\nThomas Jefferson, Birmingham, Alabama.\nApril 26-29: IERT, Columbus, Ohio. NAEB luncheon\nFriday, April 28.\nOctober 23-26: NAEB annual convention. Willard\nHotel, Washington, D. C.\nGrants and Awards\nThe Ford Foundation has granted nearly $60,000 to\nthe Southern Regional Education Board to encourage\nETV in 16 southern states. The grant will be used\nover a three-year period to help development of state¬\nwide networks.\n• 3M of Canada has granted $10,000 worth of\nvideotape to the Metropolitan ETV Association of\nToronto.\n• A grant from the Ford Foundation will allow\nCanadian educators to visit ETV stations throughout\nNorth America prior to a national ETV conference\nin May in Toronto.\n• The NETRC has announced receipt of nearly 2\nmillion dollars from the Ford Foundation to equip\nnew ETV stations with videotape recorders.\nMARCH 1961\n3"
}