{
  "id": "d1791-7",
  "text": "Capital To Have ETV Station\nWashington, D. C., expects to go on the air on UHF\nover Channel 26, under the administration of the\nGreater Washington Educational Television Asso¬\nciation Inc.\nGWETA, organized in 1953, has been actively\nprograming over a commercial station, reaching more\nthan 50,000 children in 18 school districts throughout\nthe metropolitan area.\nThe breakthrough looking toward an ETV station\ncame with a grant of $50,000 from the Old Dominion\nFoundation. In announcing the grant, Monroe Bush,\nof the Foundation, said: “There is an urgent need for\nan educational television station in Washington. The\nOld Dominion Foundation, recognizing this, congratu¬\nlates the Greater Washington Educational Television\nAssociation for its careful persistence in pursuing\nthis goal. The experience gained by the association,\nthrough limited in-school telecasting on commercial\nstations, will prove invaluable. The plans that have\ncome to a head are completely realistic.\n“For these reasons, the Foundation is glad to be\nable to make a grant of $50,000 to assure the early\nestablishment of an independent educational station.\nWe are confident that the Greater Washington com¬\nmunity will meet the challenge of this opportunity\nwith the sort of continuing financial support that is\nessential.”\nThe $50,000, plus additional funds which GWETA\nis expecting from other sources, is for capital expend¬\nitures, and will be used to purchase used UHF\nequipment. The Washington group also has leased a\ntower in nearby Arlington, Va., the only remaining\ntower in the area suitable for wide-range broadcasting.\nGWETA hopes to be ready for in-school pro¬\ngraming when the new school term begins in Sep¬\ntember, with minimum programing of four hours a\nday, five days a week. In addition, sample programs\nfor adult viewing will be broadcast.\nOperational financing will be provided by the\nschools. Currently participating schools are support¬\ning the program over the commercial station to the\nextent of $60,000 for only half an hour a day, and\nMrs. Edmund Campbell, president of GWETA,\nhopefully anticipates that they will be able to support\nan extended program of $150,000.\nTHE PRESIDENT'S SAY\nSome wag has said that a camel is something\ncreated by a committee; right now I feel like a\ncommittee created by a camel. I have been recently\nsubjected to a series of mild buffetings and kicks,\nnudges and shoves, and just generally stepped upon.\nWhat is more, I brought it all on myself.\nIn my innocence, I addressed a friendly little\ncommunique to the membership a while back inviting\npeople to write and tell me if they would like to be\non an NAEB committee, and, if so, to list their pref¬\nerences in order: 1, 2, 3.\nIt was my feeling, I explained, that there were\nmany who were willing to serve but were often in¬\nadvertently overlooked. Evidently, many agreed.\nI expected a modest response; certainly I was\nnot prepared for a mail return of about 90%. Not\nonly did you answer the questionnaire with indica¬\ntions of your preferences, but almost a fourth of you\nappended letters indicating the reasons for your\nchoices, recounting your background, or indicating\nwhy you should be chosen.\nActually, I was pleased and warmed by this whole¬\nhearted response. This had been a call for assistance\n(“not honor or glory ... a lot of hard work”) and, as\nalways, the NAEB responded.\nBut this reaction, while helping to place more in¬\nformation at my disposal did make the task of se¬\nlection more difficult and time-consuming. More than\never I wanted not only to get the best people to do\ncertain committee jobs, but I wanted, so far as pos¬\nsible, to give them the jobs they preferred. This care¬\nful sifting and winnowing has taken many days—and\nnights. Obviously, the results will not please everyone;\nthere are not enough assignments to go around to give\na job to all who offered their services and certain\ncommittees were “over-subscribed” by as much as\n4°°%.\nThis year, in order to insure a continuous flow of\nnew blood into the committee system, while yet pre¬\nserving continuity of experienced personnel, I am\ninitiating an arrangement of staggered terms for\ncommittee members. After the initial two years, mem¬\nbers will serve three-year terms, with three new mem¬\nbers being chosen each year to replace three members\nwho rotate off. The small numerals opposite the\nnames on the committee list indicate the length of\nterms for each appointee. In general, these terms\nrelate to the service record of individuals, with veteran\ncommitteemen being assigned the shorter terms. Com¬\nmittee chairmen are subject to reappointment and\nreplacement each year.\nThree committees, because of the “ex-officio”\ncomposition of the membership, do not come within\nthe “stated term” system: the Executive committee\n(chairmen of TV and Radio Boards and the presi¬\ndent), the Grants-in-Aid committee (chairmen of the\nRadio Network, Radio Planning, and School Net¬\nwork committees), and the Awards and Citations\ncommittee (composed exclusively of those who them¬\nselves have been awarded citations.)\nIt is my belief that the arrangement of fixed\nterms will provide for a regular infusion of new\nblood, prevent any tendency toward ingrownness, and\ndevelopment of special empires or group monopolies;\nit is my hope that the membership will welcome this\nplan as a means of affording greater opportunity for\nwider participation in the work of their association.\n—Bill Harley\n4.\nNEWSLETTER"
}