{
  "id": "d83-0",
  "text": "f\n$kQrnla,3- lecture in Communications g?!.- Tot;#, ht 19GqI.^ , ^\n‘ mew ie that anything like ^dia,.is ^..X-u^c.^gn,.oi: h£s-\n..r?*K • Broadcasting started with Wilaon. The oppoaite ,3^pf;Q3£b,,\ny?TnhfliSt0-y is junction or the : media i3 tag. point }oX.tXwt^,‘^nd\nicLuhan. innis m a historian. History and,war,s .arid, li¬\nteracy -are somehow products of the ,media,#. t\nThese ^ men seem to have understood the nature and meanings\nand power 01 communication:-. media in many respect a better than\n-nnis sees .connunicanions media as shapers, not-\n°hSr,3-“ent fTd oultur'-r :!e 3^-3 >11 media as biased\nii. epace ar.d in ;!e sees or identifies mass media ar satu-\nral resources* i-aSer on he be-an to have some other feel4n-a\nwhen he became ilJ, He became increasingly anti-Aaerican'aM v.\nwas concerned particularly with American journalism practices\n. especially an advertising which were endangering national survival.\nCommunications media since the advent of printing have\npressed for nationalism ar.d war rath .r than peace.\n~ Cnly rarely do other media counteract, bias.\nSifflpiify, aestem civij.ii.ation ham been profoundly shaped. by\ncommunication* Communication has shaped the very life we live*\ncharacteristics?*081*0* °£ a certain metiiua’ dominance of certain\n* o 4... .\n. 'oX ^ fiPac* reflect the significance of media\nto piviliza^ion. xhe media that emphasize time are those which\nare durabie in character, like parchment, clay, stone. The.media\n- that emphasize space are apt, to be less durable like paper. They'\nare suited tp wide spaces and trade. Lecentralisation and hie¬\nrarchical - time; centralization - space.\nWith TV we have an evanescent medium. It has no duration\nhh+U™’ h*7 •1'n 8pa<:?* ,£? as u civilization we begin to neglect\nhistory, time-oasec disciplines, ar.d be concerned with soace-\nbased concerns. 1\n1 writing war. oral or tribal culture# The cha-\nracterof Socrates was through spoken word, Ke was the last\nthreat exponent of the oral tradition. Aural and oral media -\npressed for change, but the print media press for status QUO\nresists change. H *\ncuj com^-n^ papyrus, shift from absolute nonarchy#\nShift from stone. Secularization of writing. Spread of writing\ndestroyed oral tradition. writing\n■?n . .\nThe lessons of the oral culture are what w.e should. be read¬\ning in a print culture in order to. know what steps to. take#\n*>/ Secretaries used to be religious. Now business#\nPaper supported the growth of trade and of cities.\nWhenever a .v.w me Hum comes ilon- it starts out with what"
}