{
  "id": "d83-174",
  "text": "TEENAGERS AND TO0CHABILXTY\nVarious people have noticed the way in which the movie\ngeneration of the 20* a became extroverts. Now in the 509s\nand 6o*s we are watching the formation of a new generation\nof introverts.\nThe movie viewer is a \"camera\". The TV viewer is a\n\"screen.\" With the TV camera pointed at the viewer* the view¬\ner tends to turn inwards. You see this on the Dick Clark\nshow. The audience is the show. The audience is shy* dead¬\npan* inward. <\nStrengthening this tendency toward deep inwardness is\nthe very new and striking feature of the TV image; namely*\nits sculptural depth which results from the fact that it is\nformed by numerous points of light. Any image produced by\npoints and dots has a sculptural contour and depth rather\nthan boundry lines* and this contour produced by dots and\npoints is primarily and very strongly tactual in its Impact\non the viewer.\nWithout going into this basic aspect of TV* which is\ntechnical and artlatic* we can note at once numerous conse¬\nquences of this strong touch character of the TV image in\nour lives. In the small car with its wrap-around space* in\nthe pocket book with its flexible* adaptable qualities* in\nour new fascination with the world of textures for our homes\nand kitohens* in the great development of eolor sense* we\nfind one set of qualities related to touch rather than sight\nor vision.\nThe new world of hobbles* of do-it-yourselfness* the\ngreat vogue of amateur painting and carving* and weaving*\nall so strikingly new and definite in the extent of their\nacceptability from anything of 15 years ago. In all these\nthings we have one side of the new world of tactual values.\nThe other side of the tactual is also associated with\nthe sculptural; namely* sound* music and depth. Because\nsculpture lives on the world between sight and sound and is\nthe voice of silence.\nIn recent years* the overwhelming tendency toward\nstudies in depth* whether of language* motives* markets* cul¬\ntures or psychology* testify to the new power of the tactual\nand sculptural values that the electronic world In general has\nbeen fostering* but which since TV have taken on new Impetus*\nPerhaps the major manifestation of depth awareness is most\neasily seen in the new cult of the deadpan*\nto iKarlon Brando and amongst the teenagers tMafiei\nabandoning of private countenance and expresses# i\nthe tribal mask.\nMAR 21 I960\n?|8|»|lp,ll|l2|i|2|3|4|^i"
}