{
  "id": "d83-177",
  "text": "Skornia - 2\n4/*\nWhat I have said applies directly to Hypotheses No. 4.\nHigh definition (HD) in the program material may easily\nbe at war with the LD of the television medium. A too\ndefinite type of person is unacceptable as a television\npolitical candidate, or entertainer and this applies equally\nto concepts and ideas. Strongly ^demarcated materials are\nunacceptable as T.V. programmings\nThis is only to say that fixed point of view yields\nto field and to dialogue structure, basic in all electric\nmedia.\nOne of the most promising and perhaps testable of\nthe hypotheses is No. 6. Recently watching the McCracken\nexperiment in action at the Old Orchard School here in\nToronto, I was struck by the multiple transformations of\nthe print media when projected by film strip. The inter¬\npersonal relations of the class and the teacher are utterly\nchanged, and the dim room is only one of the turnings inside\nout, as it were, of the printed word. For speech as con¬\ntained within the visual code of print (the reverse by the\nway of telegraph) creates not only that dream world which we\ndesignate when we contrast \"literature and life\", but also\nthat subliminal image of \"content\" which I have been trying\nto track down for several years. So that film impact com¬\npletely re-structures the print-reader relationship. And\nnew media, like film, radio and television, have by the con¬\nflicting demands of their Subjective Completion (SC) made\nthe low definition of the print image with its complex SC\nalmost impossible for many to cope with. McCracken has\nhappened upon the use of the film medium as a translator of\nthe old print medium. Other translations are possible and\nwould produce quite different effects.\nFinally got the Vanishing Adolescent by Friedenberg.\nIt provides an open-shut case for“tHe new cultural oral\nproblera# Adolescence was a weigh—station in a print culture,\nfriedenberg says, there is a new kind of adult for which\nh -CW* adolescence is not a preliminary. The kids on the other\n* ha?d.cS? b?y mos5 of adult life on the installment plan with-\nout bothering with adolescence. In a word, oral \"field\" has\nsupplanted sequence. ' nas\nA\njfr. Am sending copies of this letter, and the Hypotheses,\nv Trvnr* Ff\\rwn%A 4-+*a/«n s-n ^3 4____ n. c 9\n/Ts,\naJ-\nto our Committee, and to Warren Seibert.\nVery best wishes. ftyi fc\nl/M / (C £ if a g —izA\n5 Am rtitk? <f\nHMM/RN fr', voA*. </t* <4j Marshall MoLuhan.\nEnclosure. j t p . „\nft rU / ^"
}