{
  "id": "d83-213",
  "text": "January 20th, i960.\nDr. Harry J. Skomia,\nNAEB,\n14 Gregory Hall,\nUrbana, Ill.,\nU.S.A.\nRECEIVED\nNAEB HEADQUARTERS\nJAN 2 2 1960\nA M\nDear Harry:\nlT|?|9|iplll|12|l|2|3|4i?|?\nThe enclosed is a draft of a paper to be given in Cincin¬\nnati the first week of March at a NEA Seminar. Please tell me\nwhether I should send a copy to Warren Seibert.\nA propos of the Pat Hazard memorandum which I also en¬\nclose, let me point out that the communication field just as\neasily includes politics and economics as it does literature.\nSt. Louis for example, obsessed by its river system of com¬\nmunications resisted the telegraph, in 1850, and quickly lost\nout to Chicago. In the Same way as Dallas-Smythe pointed out\nin his book on the telegraph (please try to obtain a copy\nof his history of the telegraph for me. It is a University\nof Illinois publication which has been out of print) the\nsemaphore telegraph on the continent preceded the electric\ntelegraph by fifty years. The continent had such a large in¬\nvestment in the older form of telegraph that it was most\nunwilling to play with the new electric telegraph, so England\nand America which had not had the older telegraph were better\ndisposed to try the electric, and so left the continent behind.\nThis type of situation is with us globally to-day in\nrelation to new media and new education.\nA recent discovery in relation to media reversal concerns\nthe obsolescence of the scribe when print was new. Par from\nwriting ceasing to be important, everybody became his own\nscribe, and the age of printing was also the age of scribbling.\nThat is to say, the old scribes* consumers became producers.\nIn the past fifty years when printing has become obsolescent\nin the presence of new dominant forms, there is more printing\nthan ever before. The typewriter enables the reader and the\nwriter to fuse in an instant act of publication. Again the\nconsumer of print becomes the producer.\ncontinued..."
}