{
  "id": "d83-216",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPROJECT IN UNDERSTANDING NEW MEDIA\nNAEBj\nPROJECT DIRECTOR\n96 Saint Joseph Street\nToronto 5, Ontario, Canada\nDr. Harry J. Skomia,\nNAEB,\n14 Gregory Hall,\nURBANA, Ill.,\nU.S.A.\nDear Harry:\nJanuary 14th, I960.\nREC\nIST«fc ►'!\n1A 9 !\n■ KS\njP A\n?l?l VlVlll|12| 1|2|8|^|6|6\n&\nHave just finished my first meetings with a Grade XI class,\nhere in Toronto. I met four times with them, and found them\nmuch more accessible than any adult audience so far. They were\nready and eager to get down to details. One lad, a propos of\nthe question whether the Orson Wells* radio hoax about visitors\nfrom Mars could have been perpetrated by mean3 of newspaper, simply\npointed out that the new audience, built up by the disc-jockey,\nwas more detached and critical than the old radio audience.\nI enclose the sheets I used at this meeting. We simply\nwent through the items, in order, in 45 minutes, and there was\nlots of discussion. Their teacher (it was an English class)\nsaid that he thought a Grade IX class could have done just as\nwell with the same material. But I would be glad to hear your\ncomments. The teacher of the class reported (after the first\nmeeting) that he thought the class was somewhat baffled, but that\ninterest and awareness grew steadily. He understood that my\naim was not total instruction, but to test whether it was pos¬\nsible to reach students of this age with these materials. And\nhis conclusion at the end of the run is enthusiastic positive.\nNext week I shall repeat the performance, in another Grade\nXI English class, in a school of quite different character where\nthe students are all children of executives, junior or senior.\nI cannot imagine why I should encounter any less result in any\nGrade XI class whatever. You said you think I should do at\nleast eight such runs at points scattered around the continent.\nIf you have a specific Grade XI possibility in your area for me\nto exploit, I would be very glad to meet them soon.\ncontinued..."
}