{
  "id": "d83-220",
  "text": "Canadian Grade XI happened to be studying Oliver Twist when the TCV*\nproduction occurred so I was able to ask them to write on the following\nquestions inter-relating book, T.V., and, films\nTELEVISION, MOVIE SURVEY -\n1. What effect. If any, does a telecast or a movie based on a book\nhave on sales and library circulation?\n2c How does the novelist determine what you shall think, and feel,\nand see? What different means are available to the camera eye?\n3* What changes of plot, episode or character, are likely in making\na movie of Oliver Twist? What changes would occur in a telecast\na® compared with a movie? Why are these changes necessary?\n4. Bo movie, or radio, or television presentations change the\noriginal characters in the novel?\nCompare how the characters are Introduced in a book with how\nthey are Introduced in a telecast and a movie. What can a book\ndo In this matter of characterization which movie and television\ncannot do?\n6„ Does TPVe pin-point attention on the characters more than the\nmovie? Why or why not?\n7. Why does the movie have great advantage over television In build¬\ning, up historical atmosphere? How would this affect the approach\nof the television producer to Oliver Twist? Why Is the movie\nproducer of a historical film compelled to be very accurate in\nhis presentation of past situations? Why is the novelist under\nmuch less pressure to be accurate?\n8. Hake a shooting script for T.V. and another one for movie of\na single episode from Oliver Twist.\n9o Unlike the photographic or movie image, the T.V. Image is not\na still shot and It is made up of a mosaic of luminous points.\nThe amount of information included in such a mosaic Is much less\nthan in a movie shot. T.V. would seem to suggest, rather than\nstate. Would this tend to make T.V. a richer and more Imaginative\nmedium? Would It tend to make the viewer more of a participator\nin the action than the movie spectator? Doctors say that when\nwatching an operation on T.V. you become the scapel, as it were.\nYou do not merely see an operation—you do It. How would this\naffect the relation of the actor to his role on T.V? T.V. actors\nsay that there has to be a very much tighter relation between\ntheir expression and their actions and words than when they are\nacting In a movie or in theatre. Would this be because of*the\npeculiar character of the T.V. image? That is, if the T.V. image\nsuggests more than it says because of Its mosaic character does\nthis bring the viewer into the actor8o role more than is the case\nwith movie and theatre? Why have some great names in radio, and\ntheatre, and movies, never been able to get into the television\nact?"
}