{
  "id": "d83-238",
  "text": "I\nDEPARTMENT OF HEALTH, EDUCATION, AND WELFARE\nOffice of Education, Washington 29, D. C.\nJanuary i960\nInstructions for the Preparation of Forn No. OE-FM-22\nFiscal Report\nTitle VII, P. L. 89-86U\nGeneral\nForn No. OE-FM-22 shall be used to report expenditures incurred for\ngrants awarded under Title VII of the National Defense Education Act of 1993\n(P.L. 89-861].). Reports shall be prepared within 30 days after the end of\neach fiscal quarter — September 30, December 31, March 31, and June 30 —\nand a final report shall be submitted within 30 days after the end of the\nproject. An original and two copies of each report shall be forwarded to:\nFiscal Management Section\nU. S. Office of Education\nDepartment of Health, Education, and Welfare\nWashington 29, D. C.\nReports shall be submitted on a cumulative basis and shall only include\nfunds received from the Office of Education. For the purpose of quarterly\nreports, \"expenditures\" shall mean actual payments, obligations, fim commit¬\nments, or accrued expenditures, depending upon the accounting system used by\nthe grantee. The final report shall show the actual cost of the project\nfinanced from Office of Education funds. All amounts reported should be rounded\nto the nearest dollar.\nThe statement of \"Policies, Procedures, and Guidelines\" for grants made\npursuant to Title VII of the National Defense Education Act of 1998, dated\nJune 19, 1999, a copy of which was provided grantees with the grant letter,\ncontains general information on allowable costs. Information as to specific\nitems of a3.1owable costs is contained in the budget for each grant, which was\nalso orovided grantees with the grant letter. These documents are called to\nthe attention of persons orenaring fiscal reports for their information and\nguidance.\nHeading\nFor the Fiscal Quarter Ending: Enter the ending date of the fiscal\nquarter for which the report is made. When submitting the final report, enter\nthe words \"Final report\" in this space.\nGrant Number: Enter the number assigned to the original grant even though\nthere nay be supplements or amendments to the grant which reflect different\nsuffix numbers*\nFrom; Enter the name and nailing address of the grantee.\nSubmitted by: Reports should be signed by the individual responsible for\nthe fiscal operations of the grantee and his title should be indicated*"
}