{
  "id": "d1882-0",
  "text": "□□□□«*\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL \" URBANA, ILLINO^\nn\nNAEB DIRECTORS ELECTED\nFor the first time, a NAEB Director-at-Large was\nelected by individual members of our organization.\nMrs. Gertrude Broderick, Radio-TV Section of the\nU. S.Dept. of Health, Education & Welfare, will rep¬\nresent all individual NAEB members, most of whom\nare former AERT members who joined with us in\nthe merger.\nElections were held in Regions II, IV, and VI.\nThis is the first group of directors nominated and\nelected by mail from their regional members only.\nFormerly Regional Directors were nominated at Con¬\nvention and elected there by all members voting.\nVernon Bronson, Station WTHS-FM-TV in Mia¬\nmi, Florida, is the new director for Region II. He\nsucceeds Earl Wynn of the Communication Center at\nthe University of North Carolina.\nNew Region IV Director is Richard Vogl, WOI-\nAM-FM at Iowa State University, who succeeds Bur¬\nton Paulu of KUOM, new NAEB President.\nEdwin Adams, School of Communication at\nthe University of Washington in Seattle, succeeded\nhimself for another term as Director of Region VI.\nAn election was held in Region V to fill the one-\nyear vacancy caused by John Schwarzwalder moving\nfrom Region V to Region IV. Robert Schenkkan,\nDirector of Radio-TV at the University of Texas, took\nover the one-year post.\n—NAEB—\nASSOCIATION NEWS\nGREETINGS FROM THE PRESIDENT\n—By Dr. Burton Paulu\nThe president of the National Association of Ed¬\nucational Broadcasters holds a challenging position.\nHis task is difficult because of the many important\ndevelopments in educational broadcasting with which\nNAEB is involved. Yet it is satisfying: educational\nbroadcasting is important, and NAEB members are\ndevoted to its cause.\nNAEB Newsletter\nVol. XXII, No. I\nJanuary, 1957\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14 Grego-y\nHall, Urbana, III., $5 a year, edited by Mrs. Judith Stevens.\nApplication for 2nd class mail privileges pending at Urbana,\nIllinois.\nOurs is a democratic organization. We share\nour problems, and proceed cooperatively towards their\nsolution. The President, therefore, is never alone.\nNevertheless, like committee chairmen, he inevitably\nmust bear more responsibilities than do most mem¬\nbers of the organization.\nYour judgment of my performance will be severe\nbecause of the high standards set by my immediate\npredecessors. Frank Schooley, Graydon Ausmus, Sey¬\nmour Siegel and Richard Hull - - to name only the\nlast four incumbents - - displayed ability and devo¬\ntion of a high order.\nFortunately, these and other recent officers are\nstill available for counsel and assistance. Frank\nSchooley, the able and popular retiring president,\nwill continue to be much involved in NAEB, since\nhe automatically became a member of the Board of\nDirectors on January 1. Also I can call upon the\nknowledge and experience of our executive director,\nHarry J. Skornia, and of the entire headquarters\nstaff.\nTo prepare for my new duties, I recently visited\nUrbana, Washington, New York, East Lansing and\nAnn Arbor. I talked to retiring president Frank\nSchooley; treasurer Robert Coleman; executive direc¬\ntor Harry J. Skornia, and members of the headquart¬\ners staff.\nI called upon representatives of the JCET, the\nU. S. Office of Education, the BBC, RTF, and the\nETRC, and talked to NAEB members at WNYC,\nNew York University, the University of Illinois,\nMichigan State University, and the University of\nMichigan.\nNEWSLETTER\nPage I"
}