{
  "id": "d1882-3",
  "text": "Thus, the staff here is going to devote much of\nits time to compiling and keeping accurate records.\nWe have begun this campaign with the most impor¬\ntant file, the tape inventory file.\nNow, a few words on the response to our plea for\na clearing up of the tape inventory records. Your re¬\nsponse as of this date (12/19/56) has been most\ngratifying, as we have received statements from 50\nstations for a 63.3% return. We asked for and ex¬\npected a 100% return, although provision was made\nfor those not responding (and I assure you this pro¬\nvision will be enforced). As a matter of fact, all pen¬\nalties mentioned in the recent memo covering tape\nreturn and inventory will be strictly enforced.\nWhile the numerical response to our inventory\nhas been comparatively good, some of the statements\nreceived indicate many stations are not familiar with\nthe meaning of our serial numbers, the methods by\nwhich we distribute tapes, etc. Therefore, we will at¬\ntempt to produce during 1957 an explanation sheet\nconcerning the Network, its composition, operational\nprocedures, services, etc. When this information ap¬\npears, we trust all station personnel will take the op¬\nportunity to give it their serious attention.\nEvery inventory statement received will be con¬\nfirmed. However, since some difficulties have arisen,\nthis confirmation job has become an awesome task.\nWe request your patience and continued alert book¬\nkeeping.\nWe feel we have made tremendous strides on the\ntechnical aspect of our operation, thanks to the efforts\nof Mr. Jess Trump and Mr. Cecil Bidlack. Jess has\ngiven his untiring efforts to the improvement and\nmaintenance of our equipment, and Mr. Bidlack has\nkindly given of his time in a consultation role. We\nthink you will agree with us that these two gentlemen\nare producing some good results.\nAnother area in which we feel progress has been\nmade is programming; but we do regret that most Net¬\nwork programming is provided by so small a number\nof member stations. If it is at all possible, why don’t\nyou make a New Year’s resolution to produce and sub¬\nmit at least one series to the Network during 1957?\nWe’ll be glad to have it, and we know all your fellow\nNetwork members will be pleased at the opportunity\nto hear what you can do.\n—NAEB—\nNOW WE'RE IN PRINT\n—by Mrs. Judith Stevens, Editor\nThe radical face-lifting given the cosy old NAEB\nNewsletter stems from the many more copies now\nbeing distributed. Since the AERT-NAEB merger is\nofficially consummated this month, the Newsletter\ngoes to 1500 persons and/or institutions. Printing is\nless expensive than mimeographing when working\nwith this quantity, and here we are.\nMany differences are at once apparent. By set¬\nting our news in type, we use about one-fourth as much\nspace as we did before, so the new Newsletter is quite\nthin. It’ll be much easier to keep copies, as loose leaf\nnotebooks can accommodate far more issues now.\nNow that we’re in print, photographs can be\neasily incorporated in our news. So when you send us\nnews releases, send pictures, too. Make sure the\nphotos are clear, not fuzzy, and preferably of persons\ndoing something, not just staring at the camera.\nWe feel the Newsletter's “new look” is becoming.\nHope you agree.\n—N A E B—\nREPORT FROM PARIS\n—By Keith M. Engar\nFulbright Student In Paris\nAt the present time, the French Broadcasting\nSystem’s Cultural Exchange Office, headed by M.\nMichel Robida, is preparing a new series for NAEB\nentitled “Seeing Paris.” Madame Magdeleine Paz,\nwhom many of you met at the recent convention, is\nproducing the series. While the title implies this is a\nradio travelogue, Madame Paz has made the series\nmuch more than that. Her writers have incorporated\nthe history and atmosphere of Paris within the frame¬\nwork of well-known landmarks.\nYou would surely be impressed as I am with the\nemphasis the French Broadcasting System is giving\ncultural exchange. Not only are programs prepared\nfor NAEB, but for many European and South Ameri¬\ncan countries as well. As the name implies, it is a two-\nway proposition, and the French Broadcasting System\ncarries many TV and radio programs of the participat¬\ning countries. Thus far to my knowledge, America\nis lagging behind other nations in this most important\narea of international cooperation. When one is away\nfrom home, one is naturally more aware of our impact,\nor lack of it, on the mass media abroad. In the long\nrun, cultural exchange will do far more to cement\nfriendships than propaganda releases ever could.\n—NAEB—\nTEACHING BY TV\n“Type Right,” a TV series in beginning typing,\nis currently being presented by the Denver Public\nSchools over KRMA-TV, Denver’s educational Chan¬\nnel 6. Approximately 700 handbooks for home study\nhave been sold for this 18-week series.\nPage 4\nNEWSLETTER"
}