{
  "id": "d1882-6",
  "text": "TV TECHNICAL TIPS NO. 28\n—By Cecil S. Bidlack, NAEB TV Engineer\nBig news of the month, as far as the Engineering\nService is concerned, is the publication of the report\nof the 1955 NAEB TV Engineering Workshop held\nat East Lansing, Michigan in September, 1955. This\n189 page report was placed in the mails the second\nweek of December and should be in your hands as\nthis is written, barring delay due to the Christmas\nrush.\nWe regret it has taken so long so get this report into\nprint. The task of transcribing the talks from the tapes\nand the necessity for a great deal of editing required\nfar more time than anticipated. By the time the\nreport was ready for the printer, we bumped into a\nbacklog of text book printing. Late as it is, we hope\nyou’ll find it helpful and worth while.\n* * * *\nWith the collaboration of Dick Lawson of the\nWILL-TV staff we have also published the first of\nwhat we hope will be a series of Staging, Lighting and\nGraphic Arts Newsletters. These have been sent to\nthose who attended the NAEB Staging and Lighting\nWorkshop at Ann Arbor last August, and to managers\nand directors of all ETV stations and production cen¬\nters. We know our list of staging, lighting and graphic\narts personnel is far from complete. We hope to reach\neveryone concerned, so if we missed you please write\nand ask to be added to our mailing list.\nIncluded in the mailing to managers is an SMPTE\npaper “An Inquiry Into Standards for Television\nSlide Production” and “Preliminary Specifications for\nthe Ampex VR-1000 Videotape Recorder/Reproduc¬\ner.” We’ll be glad to supply these upon request.\n* * * *\nCBS-TV has placed its two protoype models of\nthe Ampex Videotape Recorder into daily use for\nWest Coast repeats of the Douglas Edwards News\nprogram. Picture quality is reported far superior to\nkinescope quality and compares with the best 35mm\nfilm with superior contrast range.\nObservers report occasional appearance of fine\nwhite lines in the picture attributed to “tape drop\nout.” This is caused by the texture of the magnetic\nmaterial on the tape base. It is accentuated when\nthe magnetic oxides are not evenly flowed onto the\nplastic base. Tape suppliers have been giving special\nattention to this problem, with pre-testing of each\nreel of tape slated as one possible method of whipping\nthis problem.\nNBC-TV in Hollywood has received the first of\nits Ampex Videotape Recorders; but until tests have\nbeen completed no plans have been made for “on the\nair” use. Delivery of the second' recorder is expect¬\ned soon with a third to go to New York Network fa¬\nPLACEMENT SUPPLEMENT\nThe following gentleman registered with us last month.\nAnyone wishing further information or wishing to register\nwith the NAEB Placement Service contact Mrs. Judith\nStevens, 14 Gregory Hall, Urbana, Illinois.\nMale, married, M.A., 29, wants producer-\ndirector, or program director position in\neducational broadcasting. Now employed\nas radio announcer and supervises produc¬\ntion of TV spots for an ad agency. Has de¬\ngree in radio-TV and welcomes a chance to\nteach. Location open. $5,000.\ncilities. We regret we can’t give a first hand report\nof the use of videotape on the air. We’d appreciate\nhearing from our West Coast readers with their com¬\nments on reception.\nThe way we figure, it may be a long time before\nwe “corn pickin’’ middle westerners see programs on\nvideotape. If possible, Ampex officials have promised\nto advise in advance of coast-to-coast broadcasts on\ntape.\n* * * *\nAn interesting application of the use of infra-red\nreflecting glass is outlined in a story on page 89 of\nthe December 10 Broadcasting-Telecasting. This glass\nreflects radiant heat but transmits more than 75%\nvisible light. Rectangles of glass, 12 x 16 inches, were\ninstalled on frames in front of the spotlights used'.\nThe glass was held at an angle of approximately 45\ndegrees to reflect heat towards the ceiling and away\nfrom the light fixture itself.\nThis method was used for WSM-TV telecasts from\nRyman Auditorium in Nashville (which is not air\nconditioned). WSM officials believe at least 50% of\nthe heat from the spotlights was dispersed, which\nmade it possible to televise “Grand Ole Opry”\nthroughout the summer. They were so impressed they\nplan to install heat reflecting glass in the regular\nWSM-TV studio (which is air conditioned). In ad¬\ndition to cutting down heat, they also believe a re¬\nduction in the amount of infra-red light improves\npicture quality.\n* * * *\nOn our visit to KCTS in Seattle, we picked up\nan idea which may be helpful. In order to cut down\non their inventory of 16mm reels, they use a split\nreel in conjunction with a plastic core and a brass\nhub which they designed and built. This way they\nare able to store film in cans on the plastic core\n(used for bulk film) and operate with a small num¬\nber of split reels. The illustrations show the parts of\nthe brass hub separated and with the hub in the plas¬\ntic core.\nNEWSLETTER\nPage 7"
}