{
  "id": "d1882-7",
  "text": "processor is attached at the start of each hour’s un¬\nexposed film. The special core contains a slot just\nwide enough to accommodate the thickness of the\nfilm. In threading the magazine, the end of the\nleader is folded over so the leader won’t pull out of\nThe film is processed backwards, that is, from\nend to beginning. When the exposed film has run\nthrough the processor and pulled the leader through\nto the end, the tension stops the processor, threaded\nwith leader.\nKCTS is fortunate in being able to have the\nhubs made at a trade school at no other cost than\nthe 1 inch brass stock. They also buy the inexpen¬\nsive reels, take them apart and install the brass hubs,\nthus making a very reasonably priced split reel. We\ndon’t have a working drawing for the hub, but be¬\nlieve you all have the important dimensions available\nto have these made, if you wish to adopt this practise.\n* * * *\nWe also picked up a tip from Ross Scroggs at\nWUNC-TV which has a more limited' appeal since it is\nfor use with a film processor.\nWUNC-TV has been making kinescope recordings\nof the University of North Carolina football games.\nThey built a film magazine which holds an hour’s film\nso it is possible to reload the magazine in the 20\nminutes between the halves of the game. The kine is\nthen edited and shown on WUNC-TV on Sunday\nevening.\nWUNC-TV does its own film processing. Ross\nhas a special metal core he uses to make sure he does\nnot pull the film leader through his film processor,\nand avoids the necessity for rethreading the processor.\nHe uses a metal core as the take up hub in the\nkinescope recorder magazine. Sufficient leader for the\nWe have just received the 25th Anniversary Issue\nof Broadcast News, a publication of the Radio Corpo¬\nration of America. Among other articles it contains\na 13 page, well-illustrated description of KETC, The\nSt. Louis Educational Television Commission station.\nThere is also a short story devoted to WHYY-TV of\nthe Metropolitan Philadelphia Radio and Television\nCorporation.\nHUNGARIAN TECHNICIANS\nNotice of the availability of two technically trained\nHungarian refugees has come to our attention.- With their\nwives, they fled from Hungary on November 20, and are\nnow in Salzburg, but they expect to come to the U. S.\nBela Julesz, born 18/2/1928\nAndor Gabor, born 30/7/1923\nBoth these men hold the degree \"Candidate in\nTechnical Science,\" equivalent to. our. degree of. M.'Sc.\nGabor's dissertation dealt with Modulation Suppression and\nThreshold Signals. Julesz's dissertation was on the Correla¬\ntion of Statistical Methods applied to the Tranmission of\nTV Signals. He has since then been preparing a university\ntext-book on communications theory.\nAnyone interested in employing these gentlemen, or\nknowing of positions they might fill, please contact Mrs.\nJudith Stevens, Placement Officer, NAEB Headquarters, 14\nGregory Hall, Urbana, Illinois.\nA gift of broadcast equipment valued at more\nthan $43,000 was made by Storer-owned WJBK-\nTV, Detroit, to the local educational WTVS. Equip¬\nment includes film chains, control panel, power sup¬\nplies, monitors, amplifiers and relays.\nPage 8\nNEWSLETTER"
}