{
  "id": "d1524-3",
  "text": ". .. . ...... VV:.» ; ■ ~4- ..... .\nspot anno once merits which are the only-type of spot announcements used, on WNYC.\nThese :are not paid- fen •hy any sponsor, and they are devoted to non-profit causes\nfor social and health.agencies for the municipality, for the state and federal\ngo ve.rnment s,- and for the\"armed services,. . WNYC1 s Weekly Public Service P.acket\ncontains an average of .forty announcements. These are \"broadcasts regularly over\nOTC-an average of four, times a week. '.This packet is prepared in full conformance\n-with the federal Communications Commission Aeport under Public Service Responsi¬\nbility ;of broadcast Licensees' of march 7, 1946. No other station in New York\nCity utilizes non-'commercial public service announcements to the extent or in the\nareas, which WNYC do.es,. ‘The effectiveness of these public service announcements,\n.however, would be sharply. curtailed were it not for .the , special temporary ..service\nauthorization under which we have been operating.\nwhat, is most-vital, however,, .for the purposes .of Municipal-Broadcasting,\nhas been the :availability of nighttime operation during times of emergency, of\nwhich last year, for inst.unce, seems to . have had more than a normal share. Three\ntimes during the year transit tie-ups threatened,.. Last winter’s ten day tugboat\nstrike was a-very definite .reality. The dislocating Staten.Island ferry boat\nfire, the prolonged paralysis of the trucking strike and the coal strike are all\nexamples of emergencies which required the -nighttima use..of the City Radio Sta¬\ntion:, .Through-all these unforeseen disruptions to the.normal life of New York\nCity the\"Manicipal Broadcasting System broadcast developments, announcements,\nand bulletins as well as the voice of the Mayor of the City of New York repeatedly\nSuch, immediate broadcasting service was not available on any of the commercial\n.radio stations in New York City. The reassurance of the public,.and the protect¬\nion of life and property by the use of this great medium of communication .could\nnot have been accomplished without the Special Service.Authorization permitting\nnight time operation .for WNYC. , . .\nX' have attempted to describe in some small measure some o.f the programs, and\nservices which are of a unique character which are rendered by WNYC, . In ..addition\nto this type of programming the audience of WNYC has been sustained by program\nservice of a high-entertainment value including dramatic programs and good music.\nDuring the past five years night time service has been conducted on a\ncontinuous basis..under temporary Special Service Authorizations utilizing a\ndirectional antenna. But these Authorizations have been sometimes on a month\nto month basis. • We would like to terminate the uncertainty which besets us from\n• month to month in. our program planning. Permit me to point out also, that there\nis no record, so far as I know, of any complaint of interference.during WNYC1s\nspecial night time operation. Perhaps from an engineering viewpoint, upon accept¬\ned engineering figures, a condition of interference in some secondary- service\narea of the dominant station on our frequency should or could exist. Whether it\nactually does or not is not borne out by complaints from the radio public.\nWe would like to continue to enjoy the same privileges extended to us by\nour Special Temporary Service Authorization, but on a permanent basis.\nThe City of New York has never sought to benefit in any way, if such bene¬\nfit caused inconvenience to r-dio listeners in any part of the United States.\nIn Docket No, 5705, .Matter of The Application of the City of New York, decided\non October 19, 1942, it appeared then that regular.night time operation of WNYC\nwould not have caused any inconvenience except, to a small northeastern part of\nWisconsin, Against this, however, might I point out the opportunity for service\nto the eight million:people of the City of New York, of programs of undisputed\neducational and cultural content,"
}