{
  "id": "d827-46",
  "text": "-2-\nffo\nassign the responsibility to the new education division of the FCC — which\nwasn’t in operation when Roberts drew up his plan — or failing that, assign\nit to the Secretary of HEW, as your bill provided. I hope you will find\ntime to discuss this matter with Harley and Leonard Marks — they have a\ngood feel of the problem here.\n5, We are concerned about the \"closed-circuit” provision in the House bill —\nthe amendment that was tacked on — for we don’t know just what it means or\nhow it could be interpreted. If there is only to be $25,000,000 we think the\nclosed-circuit provision should be entirely stricken, and that the funds should\nbe required to be used to activate reserved broadcast channels. All the funds\ncould be piddled away by every high school and junior high school wanting to\nget into broadcasting by seating up their own closed-circuit system, at the\nexpense of good production and coverage of rural areas by broadcast trans¬\nmitters.\n6. Finally there is the matter of the \"community\" stations. I have a somewhat\ndifferent opinion, personally, than do most of my cohorts on this one. While\nI do not want the existing \"community\" stations deprived of assistance, I\nwould not like to see the creation of many more. There is nothing in the\nSixth Order and Report which permits or contemplates licensing such entities,\nand I believe that if the FCC had \"hung tough\" the educational institutions\nin several areas where community stations were developed would have taken on\nthe responsibility — and we would have more responsible operations than some\nof the \"community\" stations present. I do not wish to detract from the fine\nprogramming job done in San Francisco, Pittsburgh, Boston and Chicago, but the\nlack of financial responsibility by the educational community makes comething\nof these operations other than \"educational\" stations, a good part of the time.\nI would not like to see the door opened any wider to these types of operations,\nfor I think ultimately the stations are going to have to be supported by the\neducational part of the community — not by charity.\nI was in Washington a couple of days the latter part of last week, attending a\nmeeting which the NEA called to discuss the Rights and Responsibilities of the\nteaching profession in educational television — seeking answers to the problems\nof compensation to teachers for television broadcasting, and the rights of the\ntelevision teacher when programs are recorded and rebroadcast. I called your\nhotel Saturday afternoon, but found you were away for the week-end. I would\nhave liked to chat about these things, but perhaps this letter will convey my\npoint of view.\nYou will, if you have not already, hear from Lenny Marks and Bill Harley who\nwant to talk about these matters with you. I had lunch with them on Saturday.\nAgain, my personal thanks and best regards^ y\nStone"
}