{
  "id": "d827-83",
  "text": "\"(4) that such television broadcasting facilities\nwill be used only for educational purposes*\n\"(b) The total amount of grants under this part for the\nconstruction of educational television broadcasting facilities\nto be situated in any State shall not exceed $1,000,000.\n\"(c) In order to assure proper coordination of construction\nof educational television broadcasting facilities within each\nState which has established a State educational television\nagency, each applicant for a grant under this section for a\nproject for construction of such facilities in such State,\nother than such agency, shall notify such agency of each\napplication for such a grant which is submitted by it to the\nSecretary, and the Secretary shall advise such agency with\nrespect to the disposition of each such application.\n”(d) The Secretary shall base his determinations of\nwhether to approve applications for grants under this section\nand the amount of such grants on criteria set forth in\nregulations and designed to achieve (1) prompt and effective\nuse of all educational television channels remaining avail¬\nable, (2) equitable geographical distribution of educational\ntelevision broadcasting facilities throughout the States, and\n(3) provision of educational television broadcasting facilities\nwhich will serve the greatest number of persons and serve\nthem in as many areas as possible, and which are adaptable to\nthe broadest educational uses.\nn(e) Upon approving any application under this section\nwith respect to any project, the Secretary shall make a grant\nto the applicant in the amount determined by him, but not\nexceeding (1) 50 per centum of the amount which he determines\nto be the reasonable and necessary cost of such project, plus\n(2) 25 per centum of the amount which he determines to be the\nreasonable and necessary cost of any educational television\nbroadcasting facilities owned by the applicant on the date\non which it files such application; except that (A) the\ntotal amount of any grant made under this section with respect\nto any project may not exceed 75 per centum of the amount\ndetermined by the Secretary to be the reasonable and necessary\ncost of such project; and (B) not more than 15 per centum of\nany such grant may be used for the acquisition and installation\nof microwave equipment, boosters, translators, and repeaters\nwhich are to be used to connect two or more broadcasting\nstations. The Secretary shall pay such amount, in advance or\nby way of reimbursement, and in such installments consistent\nwith construction progress, as he may determine.\n-3-"
}