{
  "id": "d827-88",
  "text": "STATEMENT OF THE MANAGERS ON THE PART OF THE HOUSE\nThe managers on the part of the House at the conference on\nthe disagreeing votes of the two Houses on the amendments of\nthe House to the hill (C.205) to expedite the utilization of\ntelevision transmission facilities in our public schools and\ncolleges, and in adult training programs, submit the following\nstatement in explanation of the effect of the action agreed\nupon by the conferees and recommended in the accompanying\nconference report:\nThe bill as agreed to in conference is in form and for the\nmost part in substance the same as the amendment of the House\nto the Senate bill. The differences between the House amend¬\nment and the substitute agreed to in conference are set forth\nin the following outline, except for incidental changes made\nnecessary by reason of agreements reached by the conferees and\nminor or clarifying changes.\nThe several important changes which have been made in the\nHouse amendment have the common objective of expediting as much\nas possible the construction of additional educational television\nbroadcasting facilities. The construction of such additional\nfacilities has been long overdue. At present the Federal\nCommunications Comission has reserved 273 educational television\nchannels of which only 62 are in use. Only through the\nestablishment of additional educational television broadcasting\nfacilities and the activation of noncommercial educational\ntelevision broadcasting stations can the goal of creating an\nadequate television system to serve the needs of all the people\nin the United States be accomplished. The conference agreement,\nthus, must be considered an integral part of a broader\nlegislative program now under consideration in the Congress\nwhich is aimed at expanding and imoroving television service in\nthe United States.\nCHANTS FOR SURVEYS.-- In order to accomplish this objective,\nthe conference agreement omits all provisions for the preparation\nof State surveys of educational television needs which were\ncontained in the louse amendment. Educational television\nlegislation was first considered during the 85th Congress when\nit was passed by the Senate and was reported favorably to the\nHouse of Representatives by the Committee on Interstate and\nForeign Commerce. Between that time and the present extensive\nnational studies have been undertaken by educational television\norganizations of educational television broadcasting needs.\nThese studies show a minimum need of 1,197 television channels\nfor educational broadcasting stations. Therefore, the time for\nadditional surveys has long since passed and the time has\narrived to take prompt action to get the needed additional\neducational television staticns on the air as promptly as\npossible,\n-8-"
}