{
  "id": "d1379-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVol, IV, No. 1 DuPont Circle Building, \"Washington 6, D.C. January 10, 19^3\nNEW EDUCATIONAL BROADCASTING FORMS\nThe new forms recently authorized by the FCC for noncommercial educational\nbroadcasters (Docket 14690) will be available as follows: New renewal forms (Form 342)\nwill be sent to licensees with June 1, 1963 renewals by January 15, 19^3* The remaining\nnew forms should be available early in February. These are: Form 340 for application\nfor CP for new or changed facilities; Form 34l for application for initial license;\nForm 323E for ownership reporting. Until the new forms are available, noncommercial\neducational applicants and licensees should continue using the old forms.\nIn announcing adoption of the new forms, the FCC stated that they would be\napplicable to all noncommercial educational stations, and not just those operating on\nreserved channels, in line with the recommendations of the NAEB. However, they declined\nto accept the NAEB’s contention that the showing of a detailed balance sheet by private\ninstitutions is unduly burdensome and that an annual budget, with specific showing\nas to the applicable source of funds, should be acceptable instead. Therefore, the new\nform still requires this information, although certain minor revisions have been made\nin the interest of clarity.\nANNUAL FINANCIAL BEPORT REVISED\nThe FCC has announced that a somewhat revised Annual Financial Report form\n(324) will become effective February 1. Noncommercial stations, deriving no revenue\nfrom the sale of station time, are required to fill out only a few sections of the\nreport. These require the following information: Total broadcast expenses, number\nof full time and part time employees, and total cost of tangible property (broken down\ninto land and Buildings, Tower and Antenna System, Transmitter Equipment, and All\nother property).\nWILMINGTON GETS CH. 12 FOR ETV\nOn December 27, the FCC announced that it had granted the application of\nWHTC, Inc., for a new TV station to operate on a noncommercial educational basis on\ncommercial Ch. 12 in Wilmington, Deleware. The Commission had announced its intent\nto make such a grant in an Initial Decision last September 27.\nNAEB PROTESTS MOBILE USES OF CHS. l4 & 15\nThe NAEB has filed a statement with the FCC opposing the petition of the Land\nMobile Communications Section of the Electronics Industry Association for the deletion\nof ^television Channels 14 and 15 from TV broadcast use and their assignment' for\nmobile land uses. The NAEB pointed out that there are 12 stations operating on these\nchannels, and two more are under construction, five of which are noncommercial\neducational stations (KTSM, San Mateo, Calif., WFPK-TV, Louisville, Ky., WIET, Ithaca,\nN. Y., WMUB-TV, Oxford, Ohio, and WHRO-TV, Hampton-Norfolk, Va.). It was further"
}