{
  "id": "d1716-0",
  "text": "OF EDUCATIONAL BROADCASTERS\nRepresenting non-commercial, educational AM, FM, and TV broadcasting stations, workshops,\nand production centers, owned and operated by colleges, universities, school systems, and public service agencies.\nFEBRUARY-MARCH 1952\nOFFICIAL NAEB ACTIVITIES\nNAEB BOARD OF DIRECTORS, EXECUTIVE COMMITTEE AMD ADULT EDUCATION COMMITTEE MEET IN NEW\nYORK ‘ “ “ •\nThe NAEB Board of Directors* Executive Committee and Adult Education Committee held a\njoint meeting in New York * s Gotham Hotel on January 18* 19 and 200 The Kellogg and\nAdult Education Projects provided the main points for discussion.,\nDescription of These Three Groups\nThe NAEB Board of Directors is made up of the organization's four elected officers\n(president* vice-president* secretary and treasurer) plus the six district directors<>\nThe Executive Committee* made up of the four elected officers* is empowered to act be¬\ntween meetings of the full Board* with its actions subject to subsequent veto or ap¬\nproval by the Boardc The Adult Education Committee—formerly called the Committee of\nFive—was set up by the Board to implement the several grants-in-aid received from the\nFund for Adult Education established by the Ford Foundation. (Membership of these\nthree groups is given on the back page of the News -Letter-)\nFirst Program of \"Jefferson\" Series Heard\nThe work of the Adult Education Project to date was fully reviewed by program coordi¬\nnator William Harleyo Currently being developed were programs on contemporary Russia*\na series on the Ways of Mankind* and a group on The American Heritage»\nThe Russian series* to be based largely on new and unexplored material at Harvard\nUniversity* was being developed as five full-hour programs <> Production was to be done\nin the studios of the CBC in Canada$ individual program advisors are listed with\ntopicss (1) Occupations in the Soviet (Inkeles)5 (2) Ideological Control in the Arts\n(Simons)| (3) Preventive Repression and Secret Police (Fainsode)$ (U) Corrmunist Di¬\nplomacy in Action (ifcsely)j and (5) What Attracts People to Communism (Fisher)„\nIN THIS ISSUE\nOfficial NAEB Activities\n- Other NAEB News\nAnnouncement from the Editor—Burton Pauluo...»• °.. ..«.... - ° • • • • ° • • • • • ° • ° - •»• »\n\"Monitor\" and \"Saturday Review\" Salute WHA AND KUOMo.... <>..«»..»• - • °»• • • • °»• ° °\nNAEB Tape Network—Richard Rider* „«.......°..... •«. <».«. o..»»... ° °»° •°• •«» ° °\nResearch Report—Dallas Snythea«,0o0o0.o<,<,»ooo»00ooooooooooo<,00.o<,o0,,oo000o»oo\n1-11\n12 - 30\n30\n31 - 33\n3h - 35\n35 - 37\nThe N-A-E-B NEWS-LETTER, published monthly, is distributed from\nthe national headquarters office at the University of Illinois. N-A-E-B\nmembers and associate members receive the NEWS-LETTER as part of\nmembership service. Non-members may obtain the publication at a\nsubscription rate of $5.00 per year. All inquiries regarding subscriptions\nand distribution should be addressed to: NAEB, 119 Gregory Hall,\nUniversity of Illinois, Urbana, Illinois. Editorial copy and inquiries\nconcerning editorial matters should be sent to the Editor, Burton\nPaulu, Station KUOM, University of Minnesota, Minneapolis 14,\nMinnesota."
}