{
  "id": "d1716-10",
  "text": "-11-\nNAEB REGION v CONFERENCE, MARCH 26-30, IN NORMAN, OKLAHOMA\nMarch 28* 29 and 30 are the dates set for an NAEB Region V Conference in Norman, Oklahoma,,\nThis meeting is being set up as a pilot plant session to experiment with the development\nof regional conferences as a part of the Kellogg project being administered by NAEB.\nThe conference is being held at the University of Oklahoma in Norman. The NAEB Executive\nCommittee and the Executive Director will be in attendance. Travel and maintenance\nexpenses of one delegate from each active member institution will be paid from NAEB-\nKellogg funds. Additional representatives from active members and all associate member\ndelegates are invited to attend at their own expense.\nThe tentative program includes (in part): \"The State of Educational Broadcasting in the\nUSA,\" Seymour Siegel; \"Public Relations for Educational Broadcasting,\" George Churchill,\nDirector Public Relations, University of Oklahoma; \"Bringing NAEB Up-To-Date for Regional\nMembers,\" Burton Paulu; \"NAEB Headquarters and NAEB Tape Network Operation,\" James Miles;\n\"The Free World vs. Communism,\" M. L. Wardell, Professor of History, University of\nOklahoma; \"Production Standards for Educational Broadcasters,\" Homer Heck, NBC, Chicago;\nand \"A University Administrator Evaluates Educational Broadcasting,\" G. 0. Cross,\nPresident, University of Oklahoma.\nNAEB BY-LAWS AMENDED TO HAKE IMMEDIATE PAST PRESIDENT BOARD MEMBER\nThe NAEB membership has voted to amend the organization’s by-laws to make the immed¬\niate past president of the organization a member of the Board of Directors. The pur¬\npose behind this change is to provide a greater degree of policy continuity by in¬\nsuring the membership of the immediate past president on the Board of Directors.\nThis change was proposed orally at the NAEB Biloxi convention in November 193>1* There¬\nafter, in accordance with Article XII of the By-Laws, written notice of the proposed\namendment was sent to all active members, the voting being done thirty days or more\nthereafter. At the time the News-Letter went to press 67 ballots had been returned,\nof which 59 were marked \"Yes\" votes, and 3 were unmarked.\nThe secretary has officially declared the amendment approved. In accordance with\nBy-Laws provision it therefore will take effect thirty days hereafter or, on April\n10. Article VI, Section 2 of the By-Laws therefore has been amended to read as\nfollows:\n\"Classification, Number and Election. No person shall be qualified to serve as a\ndirector of this association unless he is a duly certified representative of any act¬\nive member. The Board of Directors shall include six elected directors, the immed¬\niate past president of the Association, and all duly elected officers of the Associa¬\ntion, hereinafter specified. There shall be one director elected from each of the six\ndistricts. TirBctors from Districts one, three and five shall serve two years, be¬\nginning with section in odd-numbered years; directors from Districts two, four, and\nsix shall serve two years, beginning with election in even-numbered years.\"\nPOSITION WANTED COLUMN\nCollege radio director with two years experience considering other offers. Background\nincludes varied production, news, continuity, and teaching assignments. Some metro¬\npolitan and commercial experience. Strong on creative writing. Graduate degree in\nmusic and radio from leading university. For name and further details about applicant,\nwrite to the News-Letter editor. Station KUOM, University of Minnesota, Minneapolis."
}