{
  "id": "d1716-28",
  "text": "-29-\nKUDM JUST ABOUT-—PUT NOT QUITE—MENTIQNED IN \"SHOW BIZ\" VOLUME\nThe current best-seller about Show Biz from Vaude to Video* by Abel Green and Joe\nLaurie* opens its Chapter 55 (\"Upheaval in Radio”) with the following paragraphs\n\"Emerging from the war as the nation*s No. 1 news coverage source* radio strove to\nhang on to its haloso One of its biggest scoops of 19h& was its eye-witness broad-\ncasts on the dramatic demise of Hermann Goering and the execution of 10 Nazi leaders.\nIt also demonstrated its use as a public service in Minneapolis* when at outbreak of\npolio caused schools to close. Classes were held as usual via radio.**\nTo all of which the editor—resuming his more usual role of KUOM's Manager—can only\nsayg Its nice to be almost mentioned (since it was KUOM that did the broad¬\ncasting during the polio epidemic for which Variety awarded, a Showmanagementship\nPlaque Award), But what company to be thrown in with—Goering and the executed Nazi\nwar criminals^\nELIZABETH MARSHALL OF WBEZ RECEIVES \"McCALL'S\" AWARD\nElizabeth Ec Marshall was named \"Top Radio-Television Woman\" of 1951 by McCall's\nmagazine in its January 1952 issue.\nMrs. Marshall is assistant director of radio and television education for the Chi¬\ncago Public Schools and radio-TV chairman of the Illinois P. T. A.\nShe received the award for her program \"Lady Make Believe*\" heard over WBEZ* WIND*\nand WJJD (Chicago)* which is used as a basis for in-class instruction and.for her\noutstanding work in organizing the radio and television facilities of Illinois be¬\nhind the State Parent Teachers Group.\nUNIVERSITY OF MIAMI HAS ACTIVE QN-THE-AIR SCHEDULE\nThe University of Miami (Coral Gables* Florida) Radio and Television Department hit\na new production peak in mid-February with nine series of radio and TV programs on the\nair over five Greater Miami commercial broadcasting stations. The new total was reach*\ned when \"The Sunlit Years*\" a 13-week sequence of dramatizations of Florida history\nsponsored by the Florida Power and Light Coirpany was added to the Sunday schedule of\nWVCGe\nSunday also is the day for \"The Magic Carpet*\" a weekly children*s dram series at\n12* 15 noon on WKAT* and the weekly University of Miami \"Television Workshop\" series\nat U p.m. on WTVJ.\nOthers on the Radio and Television Department's weekly schedule are \"The Choraleers*\"\na mixed octet directed by William Lee on WIQD* \"University of Miami Round Table\" on\nWGBS g five programs of \"UM News\" on WVCG; and three series over WTVJ £. \"Conversational\nSpanish*\" a telecourse taught by Philip De la Rosa of the Evening Division*.\"Practical\nPhotography,\" a telecourse taught by Verne 0, Williams of the Evening Division* and\n\"University of Miami Newsreel.\"\nThe department's production schedule also includes a regular tape recording of the\nUniversity of Miami Symphony Orchestra concerts for the \"Voice of America\" and local\nstation WVCG. Besides this basic routine of production* such special events as the\nannual University of Miami intercollegiate debate tournament and speeches by visiting\ndignitaries are produced for broadcast over Greater Miami stations."
}