{
  "id": "d1716-32",
  "text": "-33-\n'Station 60*,J let us be frank* is not typical of college broadcasting. It is an accident.\nWere it net for the fact that last year the University of Minnesota celebrated its one-\nhundredth anniversary, and a special centennial grant of $13*000 was made available to KUOM\nfor thirteen programs* this broadcast would never have been done. Colleges do not have\n$1*000 per broadcast to play with* except* perhaps* every hundred years, I have not heard\nthe other twelve in the series* but am informed by a reliable authority that 3Station 609\nwas the Cinderella of the package. Glass slippers are not accessories to ten-dollar\nscripts—-the going rate on the representative campus,\n\"Be that as it may* the significant question raised by this documentary is what becomes of\ntalented student-writers like Mayo Simon after fortune's wheel has delivered him one brass\n- ring at Minnesota? At the moment* the Ford fortune's wheel is enabling him to do a short¬\nterm turn at Iowa State, Then what? Does this talent* with no taste for the standards of\ncommercial broadcasting* take the soapy plunge anyway—to the point of personal no return,\nand the broadcasting art's loss? Does it hide its light -under a collegiate bushel? Or\ndoes it take to writing novels* looking back on radio scripts as wistful, juvenilia?\n\"Coming out of the sheepskins each academic year there must be* if not a hundred* at least\na score of Mayo Simons and Northrop Dawson* Jrs, And each academic year the score either\ngoes commercial for the undeniable incentives offered by the networks and the advertising\nagencies* or it is curtained by obscurity,\n\"Educational broadcasting* now in its crisis of naissance or mediocrity* has nc national\nlocus* no prestige* no incentive* no tradition. Here and there* an individual campus’-'™\nsparked by some rare individual—manages to throw up a roman candle or two* but for tue\nmost part a penury and a pallor hang over the ivy. The new NAEB* on a brave shoestring,\nis doing stout work in assembling* on tape* series and one-time programs^that can ughv\nup the darkness* but the broadcasts are mostly music* or discussion or else they are\nproduced by the British or Canadian broadcasting'corporations,\n\"There is no heirarchy in educational broadcasting* no social structure coup arable to that\nof the commercial world. Isolated* each of the universities and colleges* which lead the\ncollegiate broadcasting parade* do what they can* and attempt to pool their outpu.-, It j.s\na beginning* but too small. Percolating in the experiences of.the small group of^educa¬\ntional broadcasters who are currently tapping the foundation tills is the realization that\nwhat is needed is not a distributing but a production center—a headquarters where the\nstrongest of the educational broadcasters* plus those who would be attracted to- them from\nthe commercial field* could set up a permanent entertaining and effective social and\ncultural broadcasts,\n\"Under inspiring administrative leadership* freed from the hampering restrictions imposed\nby legislatures* campus politics* and low budgets* such a production center could become\na mecca for young hopefuls. Graduate students of promise could come* under scholarships,\nfor a year of training* not in theory* but in actual production* absorbing the philosophic\nand social approach of non-commercial broadcasting* and being exposed to production\nconcepts* skills* and practice. Nor would the opportunity be confined to the^untried.\nMen of stature in allied fields could find a hearthstone and tools. The distinguished\npoet Archibald MacLeish wrote in radio's dimly recalled experimental days a memorable\nbroadcast* -The Fall of the City,* The. city fell* there are no MacLeish broadcasts any¬\nmore, Perhaps* in a national educational production center there would be,\n\"The year 19^2* says the Federal Communications Commission* will be television's lifting-\nof-the-freeze year. Two hundred non-commercial licenses are expected to get the gresri^\nlight. Who will program for the educators? Only modestly can they hope to serve local\nneedso The big impact must be made by a national production and training center\ndistributing major program series on film. With the promised advent of TY magnetic tape\nrecording to cut cost and improve quality* and with the possibility of box-office v>ele™\nvision, the fata morgana of such a center needs only the enterprise of the educators and\nthe vision of the foundations to become a reality,\""
}