{
  "id": "d1716-5",
  "text": "NAEB Ne.’.S LETTER\nPage 6\nFebruary 15, 1942\nthe City or New York Municipal Bhoaocastinc System »<j increase the hours\nOF OPERATION OF ITS STATION# VWYC, ON THE FREQUENCY Of 830 KC. T TM ITS\nPRESENT POWER OF I KW. TmS CITY SOUGHT TO OPERATE ITS STATION TM>#\n6 A.M. TO II P.M., USING DIRECTIONAL ANTENNA# INSTEAD OF \"OAVEUIC UNTIL\nSUNSET AT MINNEAPOLIS\" AS AT PRESENT•\nIN ITS PROPOSED FINDINGS OF FACT ANO CONCLUSIONS# THE COMMISSION IS OF\nTHE OPINION THAT SUCH A GRANT WOULD NOT SERVE THE PUBLIC INTEREST# CON¬\nVENIENCE ©NO NECESSITY.\nUnoer Commission rules, the City of New York has 20 days in which to file\nexceptions. In the FCC VOTE, Commissioner Payne oissenteo.\nWNAD ENERGIZES PROGRAf,! SCHEOULE\nDirectly serving doucational interests of the state is a series of pro¬\ngrams, OESIGNEO FOR STUDENTS AND ADULTS ALIKE, WHICH IS BROADCAST OVER\nWNAD EACH WEEK*\nTHE GENERAL SCIENCE PROGRAM# WHICH IS 15 MINUTES LONG# IS BROADCAST AT A\nDIFFERENT TIME ON EACH SCHOOL OAY IN OROER TO ACCOMMODATE THE SCHEDULES\nOF SCHOOLS OVER THE STATE. ^T IS INTENDEO TO SUPPLY SUPPLEMENTARY MATERIAL\nNOT COVERED IN TEXTBOOKS OR IN CLASS INSTRUCTION.\nLessons in each language are given twice a week. Stephen Scatori# pro¬\nfessor of Romance languages, teaches elementary Spanish Monday ano tri-\n0AY# SUPPLEMENTED BY A LESSON IN THE ADVANCE COURSE ON WEDNESDAYS.\nThe German lessons are given on Tuesday and Thursday by W. a. Aillibrano#\nPROFESSOR OF MODERN LANGUAGES, AND MISS 8ESSE CLEMENT# PROFESSOR OF\nRomance languages# teaches French on Tuesday and Thursday.\nThe program, \"Your music\" broadcast Monday ano Wednesday, is ocsicned\nFOf: RECEPTION IN THE CLASSROOM IN CONNECTION WITH MUSIC APPRECIATION\nCOURSES.\nA PROJECT OF THE SPEECH DEPARTMENT TO ASSIST DEBATE STUDENTS IN HIGH\nSCHOOLS AND JUNIOR COLLEGES IS THE PROGRAM PRESENTEO WEDNESDAY. NATIONAL\nQUESTIONS ARE ANALVZEO AND TREATED WITH VARYING SPEECH TECHNIQUES.\nDuring the spring semester two new courses will be broadcast from the\nCLASSROOM. The COURSES HAVE 8EEN AOOED TO THE CURRICULUM AS A PART OF\nTHE UNIVERSITY’S DEFENSE PROGRAM.\nM\n\"The Pacific Basin,\" to be taught by professors of government# history,\nANTHROPOLOGY, GEOGRAPHY, GEOLOGY ANO ECONOMICS, IS BROADCAST At 9:15 A.M.\nMONDAY, VnEONESOAY AND FRIDAY. \"CONFLICTING POL ITACAL ANO ECONOMIC SYSTEMS*\nA COMB I NED COURSE OF THE DEPARTMENTS OF GOVERNMENT ANO ECONOMICS, IS PRE¬\nSENTED at M:15 a.m. Monday, Sconesay and Friday."
}