{
  "id": "d613-25",
  "text": "1\nI\ni\nNAEB COMMITTEE REPORTS\nBelow are excerpts from the committee reports turned in at the NAEB Convention\nin New ‘York City, October 27-30, 1954.\nASSOCIATE MEMBERS COMMITTEE\nTwo surveys were undertaken by this committee during the year. One was a survey\nof the Associate members to determine the concensus regarding voting status, dues,\nand the extent of interest in using some of the NAEB Tape Network series over\ncommercial stations under educational sponsorship. The findings of the first sur¬\nvey show that Associate member institutions are producing and distributing a con¬\nsiderable number of educational programs. There is also a considerable interest\non the part of Associate members in having a vote in the NAEB, even at the expense\nof higher dues. There is also much interest in carrying the Network programs\nover commercial stations under educational sponsorship.\nThe second survey was a canvass of the Network producers to ascertain what restric¬\ntions, if any, stand in the way of use of Network series over commercial stations.\nResults of the survey show that Network series producers show a great deal of in¬\nterest in having Associate members use their programs. Enough series seem to\nbe available to Associate members to justify setting in motion the channels through\nwhich these programs could be made available.\nENGINEERING COMMITTEE\nThe most important accomplishment- of this committee was the screening of appli¬\ncants for the job of NAEB Television Engineer. As you know, Mr. Cecil S. Bidlack\nwas chosen for the position. Another major accomplishment was the planning and\nexecuting of a technical workshop. The first NAEB TV Engineering Workshop was\nheld October 19-27 in the New York area. Several technical publications have\nbeen prepared and distributed to members. Among these publications were sugges¬\ntions for improving the tape network service.\nIN-SCHOOL PROGRAM COMMITTEE\nMember stations of the NAEB are urged to scan their library and submit samples of\nseries that have definitely met the needs of pupils and teachers. A letter, in¬\ncluding this request, will be sent to all member stations by the committee. Such\nsubmissions whould be sent to John Holt, NAE3 Network Manager, immediately. Mem¬\nbers of the committee will receive tapes to audition, and will cast their ballots\nby mail. A list of selections will then be sent the stations by Network Hdq,, with\nthe promise that each series selected will be sent complete in one shipment, and\nall series for the 1955-56 school year will be distributed by the end of April,\n1955.\nNETWORK ACCEPTANCE COMMITTEE\nSince the last Convention, this committee has audited 148 submissions, running\nfrom a single program to four programs in each submission. The committee has ap¬\nproved 52 submissions.\nPUBLICATIONS COMMITTEE\nThe committee recommended that this committee be disbanded."
}