{
  "id": "d613-26",
  "text": "COMMITTEE REFORTS—2\nPROFESSIONAL ADVANCEMENT COMMITTEE\nThis committee, newly formed this year, accomplished its most important objective\nthrough its sister committee, the Workshop and Scholarship Planning Committee. This\nlatter committee screened applicants who desired to upgrade themselves professionally\nby participation in summer study, including workshops, in the field of radio and\ntelevision broadcasting in the summer just passed. The most important accomplish¬\nments of the Professional Advancement Committee functioning by itself were the\ndevelopment of a definition of its purposes and objectives, and the development of\nrecommendations for studies calculated to assist in the accomplishment of some of\nthese objectives.\nAs presently defined the purposes of the committee are as follows;\n1. The upgrading of staff and personnel of NAEB stations and production cen”\nters.\n2. The evaluation and development of ;job qualifications of personnel involved\nin educational broadcasting.\n3. The discovery of areas of weakness in the standards for personnel and the\ndevelopment of recommendations for the correction of these weaknesses,\nincluding recommendations for short courses of instruction for personnel\nneeding such instruction.\n4. The study of instruction currently available for professional advancement\nlooking toward the bringing together of those in need of certain help and\nthose who already offer that help.\n5. The improvement of the lot of the professional broadcaster among his col¬\nleagues in education, on the campus, in the school system, etc.\nRESEARCH COMMITTEE\nBelow are listed research projects which have already been accomplished by the\ncommittee or which will soon be finished.\n1. A study of audiences to include a compilation of the potential within the\nservice area of each station.\n2. A study of the Network from the standpoint of its effectiveness by reason\nof acceptance by station managers, their reasons for accepting or reject¬\ning programs and the effect of NAEB programs on local station attitudes.\n3. An analysis of the program structure of member stations.\n4. A coverage map, showing the actual service areas of' member stations.\n5. An inventory of human resources which can be developed into a Who’s Who\nin Educational Broadcasting.\n6. A manual containing the fundamental background for handling a research\nproject.\n7. The fourth New York television monitoring study.\n8. The Research Committee has acted as the clearing house for the distribu¬\ntion of reports of research wherever it is done and when it has signifi¬\ncance for members. Three such reports have been distributed (l) Inter¬\nviewers Manual (used by WOI in a coincidental study); (2) 'Some Compari¬\nsons Between British and American TelevisionMby John Suchy; and (3)MThe\nAdministrative Problems of the 10 watt Educational FM Station\"by Lowell\nPerry."
}