{
  "id": "d613-37",
  "text": "£\nMARCH7’ 1955 RECEIVED\nNAEB HEADQUARTERS\nTO THE NAEB PUBLIC RELATIONS COMMiTTEE: . R^ ^ ^955\nP»\nGentlemen *\n* have been asked under date of March 4 by Present\nSCHOOLEY TO PREPARE A REPORT OF THE PUBLIC RELATIONS COMMITTEE\nfor the Board of Directors Meeting in Columbus in mid-April,\nAs YOU ARE ONLY TOO WELL AWARE, l AM AFRAID WE HAVE DONE\nVERY LITTLE, I HAVE COUNSELED WITH HEADQUARTERS UPON SEVERAL\nOCCASIONS AND WE HAVE DONE A FEW THINGS. [ AM SENDING TODAY\nSOME NEWS RELEASES ON THE SCHOLARSHIP AND WORKSHOP PROGRAMS\nFOR WHICH THE FAE GAVE US MONEY* IHESE ARE BEING SENT TO THE\nFAE FOR FINAL APPROVAL BEFORE BEING RELEASED. We ARE REFURBISH¬\nING the old UNESCO NAEB Display which you may have seen a number\nof years ago. It will be a much more usable device when we get\nDONE WITH 3 T, WEIGHING SOME (00 POUNDS INSTEAD OF THE TOO IT\nUSED TO WEIGH, EASIER TO SHIP AND EASIER TO HANDLE BY TWO\nmen. Undoubtedly there will bs other chores that can be performed.\nHowever, Frank raises a most interesting question and one\nU#QN WHICH S FEEL QUITE STRONGLY, AND THAT gSl SHOULD THE NAME\nof this Committee not be changed to Public Relations Planning\nCommittee? St is extremely difficult for me or you to prepare\npress releases away from the Headquarters operation. They know\nso much more about THESE THINGS than we could ever hope to learn\nTHAT THEY UNDOUBTEDLY SHOULD DO THE MECHANICS OF THE WORK. |F\nTHIS ES TRUE, THEN THE PUBLIC RELATIONS PLANNING COMMITTEE AS\nPROPOSED, SHOULD GET TOGETHER AND DETERMINE THE FORM OF THESE\nRELEASES AND THg NEED FOR DISPLAYS, PLANTED STORIES, ETC. ALONG\nTHIS LINE SCHOOLEY SENT ME A DIGEST OF A SPEECH MADE BY HAROLD\nFellows in Hartford, Connecticut on March 3. Among the things\nHE MENTIONED IS THE FOLLOWING*\nftMR. Fellows also advocated a program of positive public\nRELATIONS AND A DM ON S SHED • ,f Su 7 WE MUST REMEMBER THAT PUBLIC\nRELATIONS, LIKE ADVERTISING,* IS NOT A !tONE«SHOT?? PROPOSITION.\nIt MUST BE CONSISTENT* IT MUST HAVE CONTINUITY* IT MUST BE\nWELL-ORGANIZED* AND THERE SHOULD BE CONTINUING FOLLOW-THROUGH.\nA DEFINITE FACTOR IN SUCH ORGANIZED PUBLIC RELATIONS SHOULD BE\nA PLAN, TOO FREQUENTLY (|N THIS INDUSTRY, AS |N OTHERS) THE HEAD\nOF AN ASSOCIATION APPOINTS A PUBLIC RELATIONS COMMITTEE AND LETS\nIT GO AT THAT. ACTUALLY, SUCH A COMMITTEE SHOULD PROPERLY BE\nDESIGNATED A PUBLIC RELATIONS PLANNING COMMITTEE, FOR NO VALUABLE\nRESULTS WILL BE ACHIEVED UNLESS OBJECTIVES AND MEANS TO ATTAIN"
}