{
  "id": "d613-48",
  "text": "Mr* Hugh H* Hlx, Acting Director\nT.uttcotionel Broadcmurtdiif* Service©\nRadio Station WXAD\nUniversity of Oklahoma\nHerman, Oklahoma\nDear Hugh*\nI am afraid your letter and article have arrived too lata to make this\nfleweletter in aay case* I talked to Schooley about it, and m giving\nhim a copy of this reply*\nI have recently returned from Kansas City where, as at many other raeet-\ninga, I have had to answer questions by suspicious broadcasters who\nthink that educators want to gat channel® which they will then use for\nentertainment broadcasting, which would constitute competition for them.\nTherefore they feel that they should oppose educational television and\nradio, I would be a little reluctant at this time to carry the sort\nof story that would result in a resurgence of this opposition*\nAlso your article sounds like a reply to David Usury* Since ha didn't\nask to have copies of his speech distributed, and since ha is tiying\nsmooth the waters at a level different from that at which we oper¬\nate, 1 once again do not feel that it would be fair to him now to seem\nto contradict him. I'm sure you don't want educators to tell us about\nbroadcasting* On the other hand the perspective which many educators\nhare of the problem we'll have in our schools is, I believe, more valid\nthan ours educationally, /bother we like it or not the schools des¬\nperately need' iodls ‘¥o relieve pressures for space etc. for direct in¬\nstruction, among other things*\nI'm sure neither he nor any responsible educator we'd endorse would\nrecommend dullness as cynofnymaus with education* I prefer interest¬\ning to dull professors, as we all do* But if and item tte good pro¬\nfessor is replaced by the *hs%\" I think we have to begin telaks\nstock again—and that centimes happens. And when the professor be¬\ngins to do the equivalent of song, dsno© or quia reutin s to keep it\nentertaining, once again I can't think you'd want that, though I'm\nnot sure that the tone of your statement might not lease itself open\nto that interpretation*"
}