{
  "id": "d613-53",
  "text": "RADIO STATIONS\nAM\n64O KILOCYCLES\nFM\ngo-9 MEGACYCLES\nTHE UNIVERSITY OF OKLAHOMA\nNORMAN • OKLAHOMA\nMay 31, 1955\nJUh 4 J3oo\nMr. Harry Skornia\nExecutive Director, NAEB\n19 Gregory Hall\nUniversity of Illinois\nUrbana, Illinois\nDear Harry:\nNo, you don’t have to use my little piece for the Newsletter either now\nor in the future. If you think you may be able to use it later, either\nin its present form or rewritten, fine. Mainly, I had something I wanted\nto say and I wanted you and Schooley to see it.\nThe trouble is, I know too many educational radio directors who feel like\nwe ought to keep EDUCATION wrapped in a cocoon. They don’t realize that\nwe have a product to sell, and if we don’t sell it nobody will buy it.\nIf you want to get an idea how hard it is to sell education, talk to any\ncounty agent about how many years it took to convince hard-headed farmers\nof the benefits of contour plowing, ground cover and the other recognized\nconservation measures. It’s a battle that's still going on, and will\nfor the next hundred years.\nDid Shakespeare write \"McBeth” for posterity. Hell, no. He did it to\nmake a living. Did J.S. Bach write \"The St. Matthew Passion\" so RCA\nVictor could record it on a Hi-Fi long playing record. Certainly not.\nIt was because he had twenty hungry mouths to feed.\nThe question, then, revolves not around whether we should sell education\nor why. It revolves around the methods. And if we have to resort\noccasionally to the \"ham\" in all of us to get the message across—well,\nso what? Was Lincoln a ham? Absolutelyl He knew he was on a stage and he\nplayed his part for he was worth. The atrocious drawl and speech he affected\nwere all a part of his role. He coulct use better grammar than you’or I\nwhen he wanted to. I don't think anyone would argue whether or not Franklin\nD. Roosevelt had ham in his soul. And President Eisenhower has a professional\nstage manager to handle his press conferences.\nWith all the competition there is these days for the eyes and ears of the\npublic we can no longer afford merely to scatter education to the four\nwinds and hope someone finds it useful. If we do, we'll soon be lost in"
}