{
  "id": "d613-59",
  "text": "-2-\nthe normal home are such that it would be impossible to get a message across to\na listener without such stimulation. But aside from that we have certain knowledge\nthat not even intellectual listeners will stay tuned to a program that is dull and\nuninteresting.\nI know it is fashionable these days to blaspheme the operations of commercial\nbroadcasters. But while we may deplore their methods, we must certainly admire\ntheir results. They do educate, in the sense that people listen and respond.\nThe population of Norman, a university town, is without a doubt as well educated\nif not more so than the rest of the state on the average. During a recent random\ntelephone survey (February 1955), we asked the question: “What is your favorite\neducational radio or television program?” We made no attempt to define the word\n\"educational,\" because we wanted the listener’s own ideas of what he considered\neducational.\nNaturally, many truly educational programs were named. But among those high on\nthe list of television programs were, Dragnet, Ding Dong School, Disneyland, You Are\nThere, Toast of the Town and Twenty Questions. In radio such programs as Meet the\nPress, Weekend, Hit Parade, Groucho Marx and Lux Radio Theater were mentioned.\nSome aspects of commercial radio disgust me. No doubt about it. But not nearly\nso much as those who maintain that to be educational a program must be dull or un¬\ninteresting. I do not intend to imply that all program*presented on WNAD are new\nand exciting and unique. But if we had the necessary staff, they would be. Nor\ndoes lack of money keep us frcm striving for that end.\nAnother aspect of this argument that puzzles me is the idea that an educational\nradio station must broadcast to a highly exclusive group—a minority composed\nprimarily of the intelligentia. This is a little like saying that only good Christians\nbelong in church on Sunday morning. If this were true most of the churches of this\nnation could be rented out to operators of hock shops and grocery stores."
}