{
  "id": "d613-64",
  "text": "Harry J. Skornia\nJune 9, 1955\n2\nMix. Maybe I am just getting old but I am afraid that Hugh is\n►JOO MUCH OF A FIGHTER FOR ME RIGHT NOW. I AM NOT TOO WORRIED\nIftBOUT THE POTSHOTS THAT A FINE GUY LIKE DAVE HENRY WOULD TAKE\nSat EDUCATIONAL BROADCASTING EFFORTS. As YOU KNOW MY EYES HAVE\n[Been bad so I haven’t really had a chance to read Dave Henry’s\nSPEECH YET, BUT I WILL DO SO. PERSONALLY, I JUST WOULDN’T DO\nANYTHING ABOUT IT. I THINK THAT YOU MIGHT CONCEIVABLY AT\nSOME TIME IN THE FUTURE AFTER YOU GET TO KNOW HENRY, GET M|X\nINTRODUCED TO HIM AND LET THEM DISCUSS IT INFORMALLY SO THAT\nHenry will get a better idea of what one broadcaster thinks\nOF THE STRICT EDUCATIONAL APPROACH. I KNOW THAT YOU WILL RE¬\nMEMBER HOW CERTAIN PEOPLE HAVE MELLOWED OVER THE YEARS. I, FOR\nONE, REMEMBER HOW JOHN DUNN USED TO POP OFF AT CERTAIN THINGS\nBUT I GUESS HE’S GETTING A LITTLE OLD TOO, — AT LEAST THINGS\ndon’t bother him so much any more. Others, like Ken Wright\nAND OUR FRIEND JOHN YOUNG AND BOB SHENKEN DOWN AT NORTH CAROLINA\nUSED TO DO THE SAME THING. I GUESS THE BEST POLICY WITH ALL\nOF THESE REALLY GOOD GUYS IS TO KEEP QUIET FOR THE TIME BEING\nUNTIL THEY ACTUALLY PUT IN ENOUGH YEARS TO REALIZE THAT THINGS\nARE NOT EXACTLY LIKE THEY WOULD LIKE TO HAVE THEM, AND THAT\nSHOUTING IS NOT GOING TO HELP THE SITUATION ONE WHIT. NOW I\nKNOW l*M GETTING OLD PUTTING OUT SUCH ADVICE AS THAT, BUT NEVER¬\nTHELESS THERE IT IS.\nI AGREE WHOLEHEARTEDLY WITH YOUR HANDLING OF THE SITUA¬\nTION. I STRONGLY URGE THAT YOU DO NOT USE THE ARTICLE KlX HAS\nSUBMITTED. I THINK THAT AS HE INDICATES IN HIS LETTER THAT THE\nLETTER HAS SERVED ITS PURPOSE IN THAT HE MERELY WROTE IT, AND\nTHAT SOMETIME WHEN HE IS IN THAT YOU COULD HIM TO HAVE LUNCH\nwith Henry to express himself in a respectable way so that both\nMEN WOULD ENJOY THE GET-TOGETHER.\nThis has been long but it has\nLAST WROTE YOU. WHAT ARE PLANS FOR T\nYOU AND THE FAMILY MIGHT GET OVER THI\n^BERRIES BY THE BUSHEL AT THIS MOMENT\nAND OTHER PRODUCE FROM THE GARDEN BEF\nSHOULD ARRANGE A CORN ROAST ON MAYBE\nGANG COULD DROP OVER THIS WAY. ARE Y\nATTEND OUR PUBLIC RELATIONS MEETING\nHAVE YOU SENT THE TAX EXEMPTION SUPS\n)the Public Relations Committee as I a\nor so ago.\nBEEN QUITE AWHILE SINCE I\nHE SUMMER? ANY CHANCE THAT\ns way? We’ve got straw-\nAND WE’LL HAVE LOTS OF CORN\nORE TOO LONG. MAYBE WE\na Sunday when you and the\nou or Schooley planning to\nn Chicago? Along this line\nAND OTHER INFORMATION TO\nSKED IN MY LETTER OF A MONTH\nOne OTHER THING ON A PERSONAL BASIS. Is THE COMMUNITY\nPLANNING TO HOLD ITS FOURTH-CF-JULY CELEBRATION IN THE STADIUM OVER\nTHERE AGAIN THIS YEAR? IF IT IS, I THOUGHT IT MIGHT BE A_^N I C E"
}