{
  "id": "d613-72",
  "text": "Rough Draft of Minutes of Meeting of NAEB Public Relations Committee,\nDrake Hotel. Chicago, Illinois, June 28-29. 195$«\nThose attending the meeting were: James Miles^WBAA, Chairman; Larry Fzymire,\nWKAR; James Araisey, New York University! William Bender, WHOM! Lynn Poole, Johns\nHopkins University! Stewart Howe, Illinois Institute of Technology; Elmer Sulzer,\nWFIU; and Harold Hill representing NAEB Headquarterso\nTentative Agenda Prepared by Miles:\n1) Establishment of standard operations procedure for origin, preparation,\napproval and distribution of all PR items by NAEB (Sulser). 2) Need for publication\nand revision of promotion items—History of NAEB, list of members. Constitution, etc.\n(Bender) o 3) Need for special release3 and publication for future requests for\nfunds (Poole )o k) Ditto above for improved academic and economic stature of our\nmembers. (Azmsey). 5>) Suggestions for possible revision for content and sty3.e of\nNewsletter. (Frymire). 6) PR liaison with other NAEB committees and the Board of\ndirectors' (Howe). 7) New items from committee members (all).\nAGENDA ITEM 1\nFollowing outline prepared by Sulaer.\nCHECK LIST OF POSSIBLE ROUTINES FOR DISTRIBUTION OF NAEB NEWS\n1. Basic Purposes of Releases\nA. To inform public\nB. To inform members\nII. Qualifications of PR Man\nA. Must know news and news procedures\nB. Must be adjacent to headquarters\nC. Must know NAEB policies and traditions, or be in position to learn them\nD. Must be \"sharp”\nIII. Possible Source of PR Man\nA. Use of News Writer in U.I. News Bureau\nB. Part-time use of some present NAEB headquarters employee (endowed with II-A)\nC. Employment of free-lance person from Urbana or Champaign.\nD. Use of U.I. School of Journalism staff man on part-time basis\nE. Full-time outside man.\nI¥. Sources of News\nA. Board of Directors, Executive Committee, Convention Committee, and NAEB\nbusiness meetings. (PR officer should attend all these)\nBo Information forwarded to PR man by NAEB president\nC. Information forwarded to PR man by NAEB headquarters staff\nD. Leg-work and original digging by PR man\nE. Material sent directly to PR man by NAEB members."
}