{
  "id": "d613-74",
  "text": "-3-\nSulaer: PR Committee member, should sit in on every Board of Directors* meet¬\ning o He should also report to the membership on the meeting,,\nMile a— Summary: Committee feels that Executive Director has, at this stage\nof the game as one of his prime functions public relations for the NAEB, As soon\nas economically feasible hire a publicity man to handle news stories etc, This man\nto be selected and hired by the Executive Director,\nAGENDA ITEM 2\nFollowing outline prepared by Bender,\nNEED FOR PUBLICATION & REVISION OF PROMOTION ITEMS\nHistory——List of Meioibers~—Constitution^etc„\nI, PROBLEM: Promotion items must be directed toward a definite goal; too much time\nand money can be'poured into a publication to permit us the luxury of an indefinite\ntarget. Once this purpose ±3 defined, we must determine the “audience\" to be reached\nto achieve that purpose.\nContributing to this matter is the whole complex of problems centered on the ques¬\ntion, “Who will read it?\" This may be worth exploring by the PR committee. To date,\nI have personally £a£Xed to hear any complaints that the materials put out by NAEB\nfor the members were insufficient. On the other hand, I have heard that -there was\n“too much,n A special effort may be desirable to build readership of existing pub¬\nlications,\nII, DISCUSSION: In the absence of an official statement about the goals of NAEB, we\nwill make some tentative assumptions as to what they might be:\n1, Create a general climate of stature and importance in\n(a) Education (Primary)\n(b) Broadcasting (Secondary)\n2, Achieve wider acceptance of network programs by member stations and the\nlistening public,\n3» To achieve acceptance of NAEB as the spokesman for Educational Broadcast¬\ning in America,\nWe might then define our target audiences for publications and promotion as\nfollows:\na) The general public\nb) Specialised publics; Educators of all fields; funded agencies; NAEB mem-'\nbers and potential members,\nIII, SUGGESTIONS:\n1) For the general public:\n(a) Effort to get coverage in national magazines. Stories and pix showing\nNAEB stations at work; what they are doing, why they are doing it, etc."
}