{
  "id": "d613-77",
  "text": "-6-\nDiscussion of Item k\nArmsey: Within this framework an entire PR program is highly desirable intern¬\nally as~well as externallyo Possibly external even more important,\nf\nMiles: Didn8t really* mean tenure. Meant getting realisation that the radio\nstaff is as important as any academic position,\nSulaer: Broadcasting curriculum needs to be sold to administrators, It®s an\nimportant PE problem to get recognized stature and prestige,\nArmsey: Need to de-emphasize the trade school aspects of the curriculum, es¬\npecially for internal relations, and show more sociological aspects etc.\nBender: Might it be possible, maybe through the Newsletter, to give the mem¬\nbership certain \"themes\" and then practical examples of hand53ng*at certain insti¬\ntutions, Articles, or editorials, in serialized form, all of this aimed at helping\nmembers find means of increasing recognition and stature,\nMiles asked Bender to write 3 to 6 articles (can be editorial in nature) on\nthis for the Newsletter,\nMiles: Might we devise promotional slogans that the station could use with\nstation breaks: \"A service to the people through education,\" \"Educators who\nbroadcast,\" This might have salutary effect on making the membership more PR\nconscious, A nationwide use of promotional efforts. Each member of the Committee\nis to think up k to 6 and send to Miles,\nAGENDA ITEM 5,\nGeneral Discussion of Item 5\nMaybe Skomla and Hill should delegate some of their travels to committees\nand spend more time on the Newsletter, Maybe the proposed PR man could handle the\nNewsletter, Try to get articles from members, even assigned, that can be used.\nQuestion was raised as to whether or not there was a need for other internal\npublications. Miles gave brief history of Newsletter, It was pointed out that the\nmain need is to build up and improve the Newsletter before we try to do too many\nother things. One suggestion was for a folder giving description of the coverage\nof member stations.\nFrymire: Suggestions for improvement. Newsletter now takes too long to\nread because there are so many items not interesting. Suggested box index for\nsections on the cover, with following suggested departmentalization a) radio\nb) TV c) in-school d) Associate members e) Headquarters news f) general\nNAEB information g) news clips. Suggested possibly using different colors for\nthe different sections.\nSulzer: Put engineering material in back pages or as a separate unit so it\ncan be detached and given to engineers.\nBender: Presently news is intermixed with publicity items. Suggested depart¬\nmentalization: a) general NAEB news (awards, features, honors, scholarships, es¬\npecially stuff that other people can use, coming events), b) program news (new\nshows, girmnicks, twists), c) new equipment and methods, d) features (station pro¬\nfiles, by-lined reports, book reviews, etc,). All covers should present Newsletter\ncontent, \"—~"
}