{
  "id": "d613-93",
  "text": "14 G-egory Hall Urbana, Illinois Phone 7-6611, Ext. 3394\nDr* Kenneth McFarland, educational consultant and lecturer for General Motors, will\nbe the luncheon speaker Friday, October 28, at the 31st national convention of the\nNational Association of Educational Broadcasters, Del Prado Hotel, Chicago. An¬\nnouncement of the speaker was made here today by Alfred E. Partridge, NAEB Conven¬\ntion Chairman.\nDr. McFarland is a native Kansan; graduate of Pittsburg State College in Kansas;\nobtained his Master’s Degree from Columbia University; and earned his Doctor’s\nDegree in Education at Stanford University. During his twenty-four years experience\nas a school administrator he became widely recognized as a leader in that field.\nThe modern McFarland Trade School, which he designed and built at Coffeyville,\nKansas, is named in his honor.\nHe probably has addressed as many important meetings of educators as any other\nAmerican. His interpretations of the philosophy of education and the requirements\nfor its proper administration have met with enthusiastic response. Through the\nyears, he has become increasingly identified with business, industry, agriculture,\nand civic organizations throughout the country. As a result, he is in constant\ndemand as a speaker for large groups in these fields.\nProbably a secret of his -unusual appeal as a speaker is that his audiences sense his\nsincerity of purpose and his ardor in helping them solve their problems and they are\ncarried along by his well chosen humor skillfully used to illustrate as well as to\nentertain. When the nation’s trade Associations were requested by the United States\nChamber of Commerce to name the speakers who had addressed their annual meetings or\nconventions, Dr. McFarland’s name headed the list of the ten most frequently men¬\ntioned.\nProbably few, if any speakers in America travel more or fill so many important speak¬\ning engagements. A trans-continental airline awarded him a certificate as being\n\"America’s No* 1 Air Passenger\" and said, \"Dr. McFarland sees more people in more\ndifferent places in the United States and Canada, and does it in shorter periods\nof time, than any other American.\" This gives him the advantage of \"on-the-spot\"\nreporting and observation.\nHis lectures in meetings of management groups in General Motors are an important\npart of his service to that organization. To a limited degree he is sponsored by\nGeneral Motors as a speaker for outside groups.\nDr. McFarland lives on his 140-acre \"city farm\" adjoining Topeka, Kansas, where,\nin addition to raising polled Hereford cattle, his farm has produced some of the\ntop prize winning Tennessee Walking horses. His friends refer to him as \"A PhD\nwith horse sense.\""
}