{
  "id": "d613-95",
  "text": "Kouafa Draft of Minatea of_lfe9tlng_a£\nDel PratoJoteJ.. Ghiea^\nThis was a luncheon meeting held in conjunction with the NAEB National\nConvention* Those attending were: Jamas Miles, WBAA, Chairman} Larry\nFrymire, WKAHj James Armssy, Now York University} Waldo Abbot, VJUOM (Sub¬\nstituting for William Bender)} Lynn Poole, Johns Hopkins University}\nStewart Howe, Illinois Institute of Technology} Elmer Sulser, WFXU; and\nHarold Hill representing NAEB Headquarters.\nChairman Miles reported that the rec csmaendati©ns of the committee to\nthe Board of Directors had been referred to the Executive Committee and\nhad, therefore, in effect, been tabled. lumbers of the ccesaittae expressed\ndisappointment and consternation, soma pointing out that, if the c<emittoe0s\nwork was to be ignored, tho committee might as well disband.\nThe Chairman asked for comments on the recent news releases and\nbrochures which had been put out by Headquarters. There was general agree¬\nment that, with the exception of the McFarland release, tho releases had\nbeen at least satisfactory. The brochures were given general approval,\nand several members of the committee suggested that more might be printed\nso that stations desiring several hundred could order them from Headquarters\nand pay for them*\nOn the general topic of news releases the committee agreed to recant-\nmend to the Board that the various NAEB ccaisaittee chairmen be instructed\nnot to release any news releases on their own responsibility. All such\nreleases should be handled through Headquarters and should be forwarded\nthere by ccenmitte© chairmen.\nThere was again general discussion of the NAEB Newsletter. It was\ngenerally agreed that certain improvements bed been made since the Chicago\nmeeting of the committee, but that there is still need for changes and\nimprovement• The new cover was generally approved, but the reaction to\nthe new type-face was varied with the majority expressing dislike.\nArmsey pointed out that the Newsletter still did not have the appear¬\nance of a really professional journal nor did it reflect a professional\norganisation. ,!The more we give the Newsletter a professional appearance,\nthe better it reflects on the NAEB.*8\nThere was general discussion, as at tho previous meeting, as to\nwhether or not the Newsletter should continue to be primarily a ^family18\npublication, containing quite a bit of news about member stations and\ntheir personnel, or whether it should eliminate such rtgossip{8 items and\nconfine itself to truely professional items. Miles and Abbot favored"
}