{
  "id": "d135-116",
  "text": "William A. Belson\n37\nlittle continuity of viewing, viewers having seen on the average only 1 -6 of the\"\"\nfour ‘ Bon Voyage ’ programmes. The absence of continuity also meant that the\nintended summary and repetition in the last of the four programmes did not,\"\"^\nin fact, operate as such to any marked degree. Of course, the tests were carried\nout several days after the broadcast of the last programme, so that quite a lot of\ntime had passed since the first broadcast. This must mean that an appreciable\namount of forgetting of French words and phrases and of facts had occurred\nbetween their presentation and the delivery of tests, so that what remained at ^\nthe time of the tests was of a relatively durable nature. From a practical point\nof view this is as it should be, for the study was concerned with practical effects—\nthat is, with more or less useful learning rather than lightly held impressions\nwhich fall away fairly readily. And for the same reason, it means that the\nassessment actually applied constituted no easy or generous test of the pro¬\ngramme’s effectiveness.\nDespite these important qualifications, the gain, considered in any absolute\nsense, is small and the educationist will want to evaluate that gain against other\ncriteria—-perhaps against formal instruction. In doing this, however, one thing\nwhich it is important to keep in mind is that for most of the housewives\nreceiving instruction through this programme, the only real alternative was no\ninstruction at all.\nTurning to changes in attitude produced by the programme, it may be\ntaken that the pre-broadcast score of +17 -65 represents a relatively confident\nand favourable attitude towards making a visit to France, and that a drop in\nscore to +11 -80 is a fairly substantial drop—though that final score still\nrepresents a somewhat favourable attitude.\nLooked at in greater detail, the evidence indicates that, prior to seeing\n‘ Bon Voyage,’ some 78 per cent, agreed that “ you don’t need to know much\nFrench to ‘ get by ’ on a short visit to France,” whereas only 55 per cent, were\nin agreement with this after seeing the programme. In the same way, the\nprogramme appears to have produced a 20 per cent, increase in the number of\nviewers who felt that they “ knew so little about French money that they\nwould probably be swindled.”\nThere was appreciably less belief that “ the arrangements for going to\nFrance were quite straightforward,” slightly more apprehension about “ what\nto order in a French cafe,” and more uncertainty about the ‘ interestingness ’\nof French food. Apprehensions concerning what to do about tipping were\nsubstantially increased. Confidence in ability to cope with the French transport\nsystem and with French money was somewhat reduced and there was an\nactual reduction in the proportion who had a “ strong desire to spend a holiday\nin France.”\nWhile the direction of these changes may at first occasion some surprise\n(i.e., an increase rather than a decrease in apprehensions), it is easy enough to\nunderstand them and there is some profit of a general kind in trying to do so.\nThe main effort in this programme went into the provision of useful pieces\nof information aimed at helping the traveller to solve her difficulties and to make\nher visit a smooth and enjoyable one. This was done vividly and in an interesting\nway, but nonetheless a solution or a tip generally presupposes a difficulty, and\nunless the viewer is already aware of the difficulty' the outcome is likely to be\nthe creation of apprehensions and worries rather than an allaying of them.\nIn fact, what the evidence suggests is that far from being conscious of difficulties,\nthe bulk of this audience had not, prior to the broadcast, given any informed\nthought to what actually would be involved in such a visit. Thus, prior to the\nbroadcast, the great majority of them knew little French, had not been to France,"
}