{
  "id": "d135-117",
  "text": "38\nLearning and Attitude Changes\nand yet were reasonably confident that the visitor could ‘ get by ' without\nknowing much French. In fact, what the programme seems to have done is to\nintroduce the viewer, vividly and realistically, to the new and bewildering\nsituations in which she would, as a foreigner in France, find herself. Language\ndifficulties assumed their real importance as did cultural and other differences\nand, perhaps for the first time, she saw something other than a travel agent’s\nversion of France. The change, then, is not really surprising. What it does\nsuggest, however, is that there are some real hazards inherent in any attempt\nto provide a mass audience with an informational service of this particular kind.\nV.—Summary.\n1. —‘ Bon Voyage ’ was a television series designed to teach the viewer, in an\ninteresting way, some French words and phrases and some general facts of the\nkind likely to be of use to the English visitor to France. It was hoped that the\nprogramme would also serve to reduce such apprehensions as the intending\ntraveller might have about an inadequate knowledge of the language. This\nstudy was designed to find out to what extent the aims of the programme were\nachieved. Paper and pencil tests were used.\n2. —For various reasons, it was inadvisable to try to deliver the necessary\ntests both before and after exposure to the programme. The method used was to\ncompare, after the broadcast, two groups of people, one of them being viewers\nwho had seen all or part of the ‘ Bon Voyage ’ series and the other being made\nup of non-viewers who had not seen any part of it. Special adjustments were\nthen made to the scores of the non-viewers to eliminate that portion of the\ndifference in test scores between the two groups which arose out of conditions\nother than the exposure of the viewers to the programme (i.e., pre-broadcast\ndifferences). The exposure of the viewers to the programme had been quite\nnormal, had taken place at home and had occurred without any knowledge on\nthe part of the viewer that she would be tested subsequently. The results\nindicated that the programme had produced an increase in viewers’ knowledge\nof the words and phrases, and of the facts presented, but that this was accom¬\npanied by an increase in viewers’ apprehensions about language difficulties and\nabout visiting France generally.\n3. —It is suggested that such an increase in apprehensions is one of the\nhazards inherent in an educational broadcast of this kind."
}