{
  "id": "d135-118",
  "text": "CONTENTS\nPAGE\nP. E. Vernon :\nEditorial .......\ni\nA. W. Wolters :\nThe Journal .......\ni\nL. B. Birch :\nList of Publications by C. W. Valentine .\n3\nCyril Burt :\nThe Contributions of Professor C. W. Valentine\nto Psychology ......\n8\nS. C. Richardson :\nSome Evidence relating to the Validity of\nSelection for Grammar Schools\n13\nA. B. Fitt :\nAn Experimental Study of Children’s Attitude to\nSchool in Auckland, N.Z.\n25\nWilliam A. Belson :\nLearning the Attitude Changes resulting from\nViewing a Television Series “ Bon Voyage ” .\n3i\nDavid Schonfield :\nSpecial Difficulties at a Reading Age of 8+\n39\nM. F. Cleugh :\nThe Reaction of Adult Students to a Written\nExamination ......\n5i\nJames N. Oliver :\nAn Analysis of the Various Factors Associated\nwith the Assessment of Teaching Ability in\nPhysical Education . ....\n66\nSummaries of Researches Reported in Degree Theses . . 78\nThe Effect of the Title on Performance in English Composition.\nAn Investigation into the Vocabulary of Glasgow Children at the Control Stage,\nin Schools of Varying Socio-Economic Status.\nBook Reviews.. ♦ .82\nOther Publications Received.83\nThe British Journal of Educational Psychology is issued by the British Psychological Society and the\nAssociation of Teachers in Colleges and Departments of Education once a term, in February, June and\nNovember. The subscription is £\\ a year post free, payable in advance, or 10s. each number.\nSubscriptions and Orders should be sent to “ The Manager, B.J.E.P. Department, Methuen and Co., Ltd.,\n36, Essex Street, Strand, London, W.C.2.” Members of the British Psychological Society and members of\nthe A.T.C.D.E. receive the Journal on special terms through the Societies.\nPapers for publication should be sent to Professor P. E. Vernon, London University Institute of Education,\nMalet Street, London, W.G.l. Contributors receive twenty-five copies of their papers free. Extra copies may\nbe had by authors at cost price if the order is given when the proofs are returned. The Editor is unable to\npublish articles which have been or are to be published elsewhere. .\nAll papers should include a contents analysis and a “ summary of results and conclusions.”\nThe sending of these with the paper in the first instance may avoid the return of the paper to the author.\nAuthors are advised to make explicit references to previous publications on the topics with which they deal,\nand in particular to any previous relevant articles in this Journal.\nThe British Psychological Society also issues quarterly the British Journal of Psychology, and the British\nJournal of Medical Psychology. Subscriptions, 40s. per annum for either journal, should be sent to the\nCambridge University Press, Bentley House, Euston Road, London, N.W.l. Papers for publication in the\nformer should be sent to Professor J. Drever, The University, Edinburgh, those for publication in the\nBritish Journal of Medical Psychology should be sent to Dr. J. D. Sutherland, 2, Beaumont Street, London, W.l.\nThe British Journal of Statistical Psychology is issued twice a year, in May and November ; Subscription\n30s. per vol. (postage extra) should be sent to The Aberdeen Univ. Press, 6, Upper Kirkgate, Aberdeen, Scotland ;\nor to any bookseller. Members of the Brit. Psych. Soc. should send subscriptions (30s.6d. post free) to the\nSecretary, Brit. Psych. Soc., Tavistock House, London, W.C.l. Papers for publication should be sent to\nSir Cyril Burt, 9, Elsworthy Road, London, N.W.3.\nAll Books for Review for the British Journal of Educational Psychology should be sent to Professor Vernon,\nat the above address. Advertisements and Subscriptions for this Journal should be sent to Manager, B.J.E.P.\nDepartment, Methuen and Co., 36, Essex Street, Strand, London, W.C.2.\nPublished by\nMETHUEN AND CO., LTD., 36, Essex Street, Strand, London, W.C.2.,\nfor the British Journal of Educational Psychology, Ltd.\n(Registered Offices : 42, Hill Street, Birmingham, 5. This address should not be used for letters or books\nintended for the Editor, Authors, or the Publishers.)\non behalf of The British Psychological Society and the Association of Teachers in Colleges and\nDepartments of Education.\nAll rights reserved.\nPRINTED BY THE BIRMINGHAM PRINTERS, LTD., 42, HILL STREET, BIRMINGHAM, 5."
}