{
  "id": "d135-121",
  "text": "FURTHER STUDIES OF THE USE OF TELEVISION 201\nbelieved that even with greatly increased college enrolments, a\ndecrease in instructional effectiveness cannot be tolerated. Rather\nan improvement in effectiveness of instruction is greatly to be\ndesired, in terms of academic achievement and personal growth,\nand development.\nAppropriateness relates to the question of the suitability or\nlack of suitability of television for presenting various kinds of\ninstruction, for instruction in different curriculums and courses or\neven in parts of courses. It relates also to the use of television in\nlaboratory instruction, for the administration of tests and other\nspecialized uses. Included in this concept is the idea of the recip¬\nrocal adaptation of courses to television and television to courses in\norder to maximize teaching and learning.\nFeasibility includes problems of capital, operational and main¬\ntenance costs, and personnel requirements. In this area Penn State\nhas made a basic approach by using relatively low-cost vidicon\ntelevision equipment, by using standard classrooms with minimum\nadaptation for originating and receiving the televised instruction,\nby employing student personnel for engineering and camera opera¬\ntion, and by insisting on a teacher-centered approach to the\ndevelopment of instructional presentations over the television\nsystems.\nAcceptability, finally, includes studies of the acceptance of\ntelevised instruction on the part of students, faculty members,\nadministration, and the university’s larger constituency.\nRESEARCH PROJECTS—SPRING 1955\nEmphasis is being placed on an experimental approach to the\nsolution of defined problems. During the first semester’s research\nin the spring of 1955 the principal comparisons made were between\nthe usual methods of presenting instruction and methods of pre¬\nsenting the same unmodified instruction via television. These com¬\nparisons were made in three different courses: General Psychology,\nGeneral Chemistry, and Psychology of Marriage.\nA detailed account of this work has been published2. Briefly\nthe general results were that in 12 out of 13 tested comparisons\nno significant differences in student achievement were found.\n, carpenter, c. r. ; green hill, l. p.; and others. An Investigation of Closed-Circuit Television\nPS University Courses. Instructional Television Research Project Number One.\nUniversitjr Park: Instructional Film Research Program, Pennsylvania State University, July 31,"
}