{
  "id": "d135-128",
  "text": "208\nAUDIO-VISUAL COMMUNICATION REVIEW\nsion. This study was repeated in two different class sequences with\nsimilar results.\nA non-experimental comparison was made in the Economics\ncourse. For the first half of the semester the instructor presented\na 40-minute lecture each day which was followed by a 10-minute\ndiscussion and problem-solving period led by graduate students.\nThe principal instructor visited a different class each day during\nthis 10-minute period. During the second half of the semester the\nprincipal instructor gave two 50-minute lectures a week over the\ntelevision system and a third 50-minute period was used for discus¬\nsion and problem solving under the leadership of graduate as¬\nsistants. A poll of student preferences indicated that the latter pat¬\ntern was preferred over the former in proportion of 7 to 3. It was\nbelieved that the longer period gave a better opportunity to work on\nproblems or to develop discussion to a fruitful stage.\nRotation of students into and out of the TV Origination room.\nThe professor who taught the Business Law course preferred to\nhave a large audience in his origination room. In this course it was\npossible during the first four weeks to have 50 students continu¬\nously in the origination room, 50 continuously in a receiving room,\nwhile two other groups spent two weeks in the origination room\nand two weeks in receiving rooms. Comparisons of achievement\nrevealed no significant differences among any of the groups.\nDuring the next four weeks the TV-room and originating-room\ngroups changed places and the other two groups continued their\nfortnightly rotation. Thus at the end of eight weeks comparisons\ncould be made between groups that rotated fortnightly or monthly.\nAgain, no significant differences in achievement were found.\nThe use of a “free choice” as an indication of students’ atti¬\ntudes towards the value of televised instruction. Some difficulty has\nbeen experienced in obtaining what are considered to be valid indi¬\ncations of students’ attitudes towards televised instruction when\nattitude questionnaires are used. A study of student responses\nindicates a confounding of attitudes toward the instructor, toward\nthe course, as well as toward the methods of presentation. Further¬\nmore, unless students have experienced the same course from the\nsame instructor by both methods—face-to-face and via television—\nit is difficult for them to make a judgment about which is better.\nAlso, doubts are often raised about the validity of verbal responses."
}