{
  "id": "d135-129",
  "text": "FURTHER STUDIES OF THE USE OF TELEVISION 209\nIn the General Chemistry course an experimental design was\ndeveloped which permitted students to make a free choice after\nperiods of instruction via television and face-to-face. This experi¬\nment was replicated in two different class sequences. Since the\nprocedures and results were identical only one sequence will be\ndescribed here.\nIn this class sequence 312 students enrolled for the lecture-\ndemonstrations were randomly divided into two equal groups. One\ngroup received direct instruction in the origination auditorium for\nthe first five weeks of the semester while the other group simulta¬\nneously received the same instruction via television in five smaller\nclassrooms in a different part of the building. The laboratory and\nrecitation periods were not televised.\nAfter an examination the groups exchanged places for a\nsecond five weeks. Following a second examination all 312 students\nwere brought into the auditorium where the instruction was origi¬\nnated, and were randomly assigned to seats. After two lecture-\ndemonstration periods under this condition they were told that they\nwould be free to retain their present seats or move to a television\nroom. This free-choice opportunity was given for three periods.\nPrior to the last free-choice period the students were told that on\nthe next class day the seat and room they chose would be perma¬\nnent for the remaining four or five weeks of the semester.\nThe third period, then, was an important choice point which\nrequired definite action. Unfortunately circumstances did not per¬\nmit of the prior collection of verbal attitude responses which could\nbe validated against actual behavior. This step is being taken in\ntwo courses of the current semester.\nThere was much speculation at the time as to how many\nstudents (if any!) would elect to go back to the television receiving\nclassrooms.\nBy actual count 109 students went to TV rooms on the first\nfree-choice day, 106 on the second day, and 104 on the final free-\nchoice day when the choice became permanent. In total this con¬\nstituted about one-third of the students. If the 18-row classroom is\ndivided at the ninth row it can be seen that slightly more than 50\npercent left from the rear half of the room and nearly 20 percent\nleft from the front half. (Figure 1.) The choices were very stable\nfor the three free-choice days, with only a few students vacillating\nback and forth."
}