{
  "id": "d135-65",
  "text": "Telephone, Executive 3-8100\nCONFERENCE BOARD OF ASSOCIATED RESEARCH COUNCILS\nCOMMITTEE ON INTERNATIONAL EXCHANGE OF PERSONS\nMailing address: 2101 Constitution Avenue, N.W., Washington 25, D, C. NOV 1 0 1958\nOffice address: 1785 Massachusetts Avenue, N.W., Washington 6, D. C.\nTo Members of the Advisory Selection Committee for: EDUCATIONAL RADIO AND TV\nDorothy R. Smith, Chairman\nGertrude Broderick\nWalter B. Emery\nKathleen Lardie\n_Harry J. Skomia\nAmerican Council on Education\nRadio-TV Educ. Specialist, HEW\nMichigan State University\nDetroit Public Schools\nUniversity of Illinois\nAttached are copies of applications for review by the Advisory Selection\nCommittee of which you are a member. In view of the relatively small number of\napplications in your field, it has been decided to complete the review of appli¬\ncations by mail.\nYou are requested to comment upon the qualifications of the applicants and\nthe merits of their proposals in accordance with the enclosed instruction sheets.\nPlease note especially the remarks concerning Sub-Group A and Sub-Group B appli¬\ncants .\nIn the case of some applications one or more reports of references may be\nmissing. Such omissions should not be considered prejudicial to the applicants\nconcerned. The missing reports had not been received in the office of the Con¬\nference Board Committee at the time of mailing the applications, and incomplete\napplications are included rather than delay unduly the reviewing procedure.\nIn some instances, applicants have applied in response to announcements of\nspecific opportunities at designated institutions abroad. A copy of the announce¬\nment of specific opportunities for 19£9-60 was mailed to you previously. It\nshould be kept in mind, however, that applications in any subject for any of the\nparticipating countries are accepted and considered by the Conference Board Commit¬\ntee. You may also find it helpful to examine the enclosed partial list of grantees\nselected by the Board of Foreign Scholarships for the academic year 19E>8-5>9\nIt is requested that you complete your review of the applications at the\nearliest practicable date, forwarding your report to the Chairman or Coordinator\nof the Advisory Committee not later than_November 21_•\nThe Chairman or Coordinator is requested to prepare, on the basis of the reports\nof the other members and his own, a collective report for submission to the Confer¬\nence Board Committee assigning a combined rating to each applicant with a brief\ncomment on his professional and personal qualifications. This consolidated report\nshould be received in the office of the Committee not later than November 28\nIn this connection, the Committee has prepared a special form to lighten the work\nMailing Committees"
}