{
  "id": "d135-78",
  "text": "Since the General Information booklet is intended primarily for the\napplicant, additional points are noted for the information of members of\nthe advisory screening committees:\n1. Variations in Academic Requirements Abroad.\nIn the countries of Asia, the Near and Middle East, and Latin\nAmerica, the need is more frequently for competent lecturers\nat the relatively non-specialized level. The grantees should\nbepreparedto assume a fairly heavy teaching load. Flexibility\nin academic approach and teaching methods is highly de sirable.\nConversely, in European universities, the courses offered by\nvisiting Fulbright lecturers will not generally form an inte¬\ngral part of the university program of instruction. There may\nbe as few as three or four regular lecture hour s per week with\nconsequent opportunity for individual research, or invitational\nlecturing in other institutions in the country.\n2. Variations in Country Programs.\nThe number of openings for visiting lecturers and advanced\nresearch scholars is limited by the program budget for each\ncountry. Since the number of applicants is considerably\ngreater for some countries than for others, the same basis\nof selection cannot be applied in all cases. Candidates may\nnot be accommodated in some country programs even though\ntheir qualifications are superior to those of candidates selected\nfor grants to other countries . There is likelyto be consider¬\nable misunderstanding and evenmistrust of the selection pro¬\ncesses unless this is clearly understood.\n3. Importance of Scholarship.\nSince the recipients of awards must by law be attached to edu¬\ncational institutions abroad, scholarship should be one of the\nprimary considerations. Scholarship, however, is only one\nof the yardsticks and not necessarily the goal of the program,\nwhich should be viewed as the total contribution or impact of\nan individual's stay abroad to international good will and\nunderstanding.\n4. Personal Suitability.\nExperience has shown that personal suitability is as important\nas scholarship in determining a grantee's success as a visit¬\ning lecturer or research scholar. This generalization is es¬\npecially applicable to scholars going to \"sensitive\" areas or\nto institutions in which they will be expected to play a leading\nrole in the development of the educational program. Mem¬\nbers of the screening committees are asked to give special"
}