{
  "id": "d135-79",
  "text": "attention to and to weigh carefully any evidences of personal\nsuitability or non-suitability and to indicate whether or not\nthey know a candidate personally.\n5. Other Factors.\nWhile the Conference Board Committee will be dependent\nprimarily upon the guidance of the Advisory Screening Com¬\nmittees in preparing the final panels for the Board of For¬\neign Scholarships, it may be necessary to consider a number\nof factors not enumerated before which might be decisive in\nmany cases. Thus, in the interest of achieveing wide partici¬\npation, sympathetic consideration will be given to an adequate\nrepresentation from less renowned institutions, or from\nsections of the country which otherwise might not be repre¬\nsented.\nIn cases where all other factors appear equal, preference\nwill generally be given to younger scholars; to those who\nplan to remain in the country designated for a full academic\nyear of nine months (except where there is sufficient justifi¬\ncation for shorter periods); and to those who demonstrate in\nadvance that their participation in an assignment or cooper¬\native undertaking would be particularly welcomed by their\nforeign colleagues or by the sponsoring institutions. In the\nlast instance, this does not, however, mean that candidates\nwho have assurance of appointments in foreign universities\nwill, on that account alone, be given more favorable con¬\nsideration.\nSPECIFIC RATING PROCEDURE\nCategory and Subgroup Classifications\nAll applicants are designated as being in either the Lecturing or the\nResearch category. Although the distinction is not always sharp, it is\nnecessary to retain it for administrative and tax purposes.\nGrants in both categories are divided intotwo groups, A and B, based\non academic rank or experience. Recent recipients of the Ph.D. (or\nother equivalent degrees), who are still within their first few years of\nprofessional activity or who have not yet attained advanced rank on the\nfaculty of an American institution, are considered for group B grants,\nwhich ordinarily provide a maintenance allowance of approximately 80\npercent of the amount provided for senior scholars. In general, more\ngroup B awards are made in the research category than in the lecturing\ncategory. The applicants in each group are rated in relation to each\nother, and are not regarded as being in competition with applicants in\nthe other group.\nThe initial classification of applicants in Subgroup A and B is made"
}