{
  "id": "d135-80",
  "text": "by the staff of the Conference Board Committee, but can be changed\nduring the screening and selection process.\nDetermination of Numerical Ratings\nMembers of the advisory committees are sometimes in doubt as to\nwhether an applicant should be rated in relation to the particular group\nof applicants under review or in relation to the whole body of scholars\nin the applicant's field. Evaluation should always be in terms of the\napplicant's standing in his profession as a whole. Unless this principle\nis observed by all screening committees, it will be very difficult for\nthe Conference Board Committee to compare and make equitable use of\nthe various screening committee reports.\nApplications are to be rated in one of these classifications:\nI - Recommended as Outstanding\nII - Highly Recommended\nIII - Recommended as Acceptable\nIV - Not Recommended\nApplications receiving a rating of IV are reported to the Board of\nForeign Scholarships on \"negative panels.\" An explanation for the\nrating must be given in each case, and can be designated in one of the\nfollowing ways:\n1. Insufficient professional qualifications.\n2. Not representative of American Scholarship.\n(This phrase is intended to describe scholars who have very\nrecently obtained citizenship, have received all or most of\ntheir academic training abroad, and who are obviously more\nrepresentative of other cultures.)\n3. Project proposal not significant in academic sense.\n. Personal non-suitability.\n5. Age in relation to the project or program.\n(This may be applied to very young applicants who are con¬\nsidered too immature to lecture or undertake research at\nthe advanced level, or to candidates of advanced age whose\nprofessional activity would be unduly limited.)\nPriority Ratings\nIf two or more candidates applying in the same subject for the same\ncountry are given the same rating (e.g. two or more Subgroup A appli¬\ncants for research in physics in the United Kingdom are rated in classi¬\nfication I), it is requested that the applicants be placed in rank order.\nSince the Conference Board Committee may not be able to include all\napplicants having the same rating in the final panel of recommended\ncandidates, it is essential to know which of the applicants should be\ngiven priority."
}