{
  "id": "d1856-1",
  "text": "2.\nIn view of the requirement that the restriction serve a useful\ncommercial purpose it is clear that, although the restricted use notic<\nwill bind a purchaser to refrain from a commercial use of the record,\nthe principles laid down have no application to non-commercial broad¬\ncasting stations whether publicly or privately owned.\nWe conclude therefore that as such a restriction applied to a\nnon-commercial station serves no apparent useful commercial purpose it\nis ineffective and inapplicable and that the attempt to bind such a\nstation by notice is invalid under the common law rule,\nWhile a copyright proprietor can reserve to himself any right\ngranted by the copyright laws, an attempt to go beyond the act and re¬\nserve to himself rights merely incidental to ownership is void, andif\nthis is attempted by means of contract and notice, the contract is in¬\neffective.\nTherefore we conclude that insofar as the notice given purports\nto reserve the exclusive right to perform publicly for profit, it is\nbinding on. all commercial broadcasters, but insofar as it attempts to\ngo beyond the statutes and reserve all right of public performance,\nirrespective of profit, it is ineffective as to non-commercial broad;\ncasters,\nWe believe that this discussion disposes of the several questions\nraised in your request.\nVery truly yours,\n(Signed) Orland S. Loomis\nORLAND S. LOOMIS\nAttorney General.\nWHR:AG\nCAPTION: 1. Phonograph record manufacturer has no interest in its re¬\ncords which would enable it by the device of a restricted use notice\nto control such use in the hands of the ultimate purchasers;\n2. Recording artist may not, through a restricted use notice\nlegally prevent non-commercial broadcast of the record; same is true\nof copyright owner.\nUSE OF COPYRIGHTED NOVELS\nBy F. S, Siebert\nAssociate Professor of Journalism\nUniversity of Illinois\nAlthough copyright protection has been on the statute books of\nthe United States ever since the opening of the nineteenth century and\namendments and revisions have been added periodically, it h£s been im¬\npossible for legislation to keep up with the tremendous developments m\nthe field of communication which have taken place during the .last 20\nyears. Being a right created-by statute, changes in the methods of\ncommunication are generally far in advance of changes in the acjt it¬\nself. The present act was passed in 1909 and amended several times,\nbut none of these amendments is particularly directed toward the solu¬\ntion of the innumerable problems in copyright which have grown out of"
}