{
  "id": "d1856-2",
  "text": "3.\nthe development of radio communication.\nThe right to reproduce copyrighted dramatic and musical composi¬\ntions through radio transmission is fairly well settled, but the right\nto reproduce literary material through the new medium is still confusec\nAt the present time it would seem that the copyright act does not pro¬\nhibit the reading of copyrighted novels over the air.\nThe present act guarantees to the owner of the copyright the right\nto \"print, reprint, publish, copy and vend the copyrighted work. \". The\nonly phrase in this series which might be applied to radio dissemina¬\ntion is \"publish\" which may mean either \"print and publish\" or merely\n\"offered for sale,\" Reading a novel over the radio, at least over\nstations of an educational character would come under neither phrase.\nThe act definitely prohibits the reading over the radio of copyrighted\nlectures, sermons, addresses, or similar productions, but nothing is\nsaid of other types of literary work in this connection.\nThe act prohibits the dramatization of a novel but it is difficult\nto see that a mere reading could be interpreted as a dramatization.\nFor most broadcasters the best method in most cases would be to seek\nthe permission of the copyright owner in order to avoid any friction\nwhich may arise. The act, however, directly prohibits dramatization\nof a non-dramatic work or the conversion of a drama into a story over\nthe air.\nHOW MUCH WILL YOuR STATION PAY?\nEducational stations must be on the alert. Now is the time to\nwrite your congressman. Why? Congressman Thompson, Democrat, Illinois\nhas announced that a House subcommittee will hold hearings in March on\na bill introduced by Congressman Boylan, Democrat of New York, to tax\nradio stations. As introduced the measure calls for an assessment of\n$1 per watt on stations under 1,000 watts; $2 per watt on those up to\n10,000 watts, and $3 on those in excess of 10,000. If you think edu¬\ncational stations should be exempted from this tax, you?d better say\nso now. NAEB officers are acting, but here is something for every\nmember to do.\nCRAVEN POINTS OUT EDUCATION RESPONSIBILITY.\nCommissioner T. A. M. Craven told the NAEB Convention recently\nthat the allocation of high frequencies for use of public and private\neducational systems \"does not relieve broadcasters from their continu¬\ning responsibility to use their facilities for educational purposes.\nBecause of the propogation characteristics of these frequencies state¬\nwide coverage cannot be expected from an individual station. Licensee&\nof regular broadcast stations still have the duty to their communities\nand to the country at large to continue the efforts that already are\nunder way to develop suitable programs that will contribute to the\ncultural advancement of our people.\"\nTWO NEW FREQUENCIES FOR W1XAL\nThe FCC has held that the proposed programs of the World Wide\nBroadcasting Corp. are suited to meet the needs and taste of Pan"
}