{
  "id": "d1019-14",
  "text": "Mr. Petssr Go«let\nDecerabtr 7, 1959\ncable*, or we may begin with open broadcast. But In any event, we will ad¬\nhere to our baelc goal - which 1. to carry the course. to the phy.tcian in\nplace* of hi a convenience.\nA- the „ame time, oar major effort ie being d- ,oted to the immediate\nproditcuon of six pilot program*. Some pf there program, will provide the\npractitioner with the general information that every phyeician should know,\nother program, will be de.igned te inrrea.e hi. sklT, m direction, where\nexporionce ha* lad him to realise ha haj nead.\nTo be worth subscribing to, the program meat be on a regular con¬\ntinuing baeig, and wherever poe.ible, the teach.,, ehould be the beat authorl-\ntl©* OW fh<! fidv*r* So sTiEr**4 H s „,4 „»\n-Tg*|~>iiriHliiun in -\"W-PMP*e>- .*» ~ i - - «g --«» . . — —■ if - a y-| a\nin otter part, of the country, w. hope to enli.t the collaboration of out.tending\nteacher, from the faculties of other medical echoole.\nTHE NEED for EVALUATION of MEDICAL TELEVISION\nAs you know, a significant portion of information i» communicated\nmost effectively by visual means and this i. especially true in medicine.\nHowever, my experience i» that many teacher, and admini.trator. who have\nsucceeded well through skilful use of verbal communication, seem unaware\not the visual element in communication, and often, therefore, show a lack\nof enthusiasm for new visual devices. This situation haa hampered ade¬\nquate development of the medical audio-visun. field. I am hopeful that we have\nan opportunity here for enlisting the support of these teachers and adminis¬\ntrators not only by visual demonstration of the superior effectiveness of\nmotion pictures and television for communicating certain kind, of medical\ninformation, but also that their efiectivsne.. can be further proven by a\nwell-documented program of evaluation When convincing proof of the value\n*7 nnedical television has been offered .he administrator, of medical schools,\nthe fscte.lt> members who are asked to give the>r fame and teaching efforts\n-i^-jf£-errgr«Ty. »r* ■whr'4-,,T'4vjr;|? ‘,. 1§ audience\nto aiva their timet *n** fViMaw i*. . . ’A!*\" * \"\"' \"J-'mmrnmmmmmm—J**,\nto givo their time end money to\" sibJTcribe loathe prograin,\" they will be not\nonly willing but anxious.\nThere is also need for evaluation during the formative period of tho\nprogram, to guide us in developing the most effective and economical approaches\n.o the use of television for continuing medical education. I hope to demon¬\nstrate appropriate formats for different kinds of teaching and help define the\ndifferences between verbal and visual communication. The first three pilot\nprogram, being produced have been chosen to illustrate the use of television\nlor presentations ranging from a predominantly verbal communication to one\nJ™* lirgely Program t 1 is a lecture on New Ors] Dr.gs fer\nTreatment of Diabetes,\" Program I 3 demonstrates \"Self Help Devices far\nPatisnt. with Arthritis, « and the intermediate Program # 2 is an Ulu.tr.ted\nlecture on the \"Bielogy of the Skin Surface and its Clinical Implications,\nPart I - Introduction, Th« Barrier Zona and Dlaturb^ncaa in Sweating.*'"
}