{
  "id": "d1019-25",
  "text": "-4-\n-\nPublio Relations Committee\nElmar Solzer, Chairman, Director, Broadcasting Services, Indiana University,\nBloomington* Indiana\nWilliam Bender, School of Medicine, University of Michigan, Ann Arbor, Michigan\nMarye D. Benjamin, Radio-TV Department, University of Texas, Austin, Texas\nFranklin Bomrsma, Detroit Educational TV Foundation, Detroit 28, Michigan\nRaymond D. Cheydleur, Department of Speech, Manatee Jr* College, Bradenton,\nFlorida\nLou Poneguy, Alabama Educational TV Commission, Birmingham 3, Alabama\nSeymour Siegel, Director, Ifcmioipal Broadcasting System, flow York, New York\nReverend R„ C. Williams, Director of Ccrammioation Arts, Creighton University,\nOmaha, Nebraska\nRadio Network Committee\nRichard F„ Vogl, Chairman, Manager, Station WOL.AM-BM, Iowa State University of\nScience & Technology, Ames, Iowa\nRobert Boyle, Station KTJOM, Uhivorsity of Minnesota, Minneapolis, Minnesota\nEdwin G. Burrows, Station WHOM, University of Michigan, Ann Arbor, Michigan\nMyron Curry, Station KFJM-AM, University of North Dakota, Grand Forks, North\nDakota\nClifford Eblen, Stations WHA-AM-FM, University of Wisconsin, Madison, Wisconsin\nJohn Ehle, Communications Center, University of North Carolina, Chapel Hill,\nNorth Carolina\nBurt Harrison, Station KWSC, Washington State University, Pullman, Washington\nKen Eager, Station ICUOW, University of Washington, Seattle, Washington\nDonald R. Quayle, Station WOSU, Ohio State University, Columbus, Ohio\nJohn Regnell, Station WILL, university of Illinois, Urbana, Illinois\nJack Summerfield, Butler Hall, New York, New York\nPhilip Thompson, Station WUCT, University of Tennessee, Knoxville, Tennessee\nWayne G. Wayne, Stations tyKAR-AM-FM, Michigan State University, East Lanaing,\nMichigan\nRadio Network School Committee\nKathleen N. Lardie, Chairman, Station WDTR, Board of Education, Detroit, Michigan\nAinslie Brioker, Station KUHF, University of Houston, Houston, Texas\nMcCabe M. Day, Station WVSH-FM, Huntington City Schools, Huntington, Indiana\nDorothy Klook, Station WXNE, Board of Education Station, New York, New York\nHarry L*mb, Station WTDS-H4, Toledo Public Schools, Toledo, Ohio\nL:Ilian Lee, Station WABE, Atlanta Board of Education, Atlanta 9, Georgia\nAivjne MsKellar, Station WHA, University of Wisconsin, Madison, Wisconsin\nJeanne Hinge, Station WNPS, Orleans Parish School Board, New Orleans, Louisiana\nClaude Bo Smith, Director of Radio & Instrumental Misic, Evansville School\nCorporation, Evansville, Indiana"
}