{
  "id": "d1761-1",
  "text": "NAEB\nPage 2\nSeptember 1, 1945\nReport of OrptCEFS\nReports of Committees\nNew Business\nElection of officers\nCLASSROOM TELEVISION IN NE'A' YORK\nLaunching by the New York City Board of Education and the Television\nDepartment of the National Broadcasting Company op a comprehensive ex¬\nperiment IN THE adaptation OF TELEVISION TO CLASSROOM EDUCATION WAS\nannounced by John E, Wade, Superintendent of Schools, and John Fo Royal,\nNBC Vice President in charge of Televisiono\nArrangements for the experiment, which will begin with the re-opening\nOF school in the Fall have been made by Superintendent Wade and Mr.\nRoyal.\nDuring the experiment school officials and television experts will\nbroadcast a weekly program over WN8T with a view to determining the\nTYPE OF television PROGRAM MOST SUITABLE FOR EDUCATIONAL PUF^POSES.\nPupils and teachers will evaluate these programs at the National Broad¬\ncasting Company’s studios. The first programs will be in the field of\nscience and the initial broadcast will deal with the science of tele¬\nvision itself. Students and their instructors will learn first-hand of\nTHE MEDIUM WHICH IN THE FUTURE IS EXPECTED TO BE A MAJOR TEACHING AID.\n-See you in Chicago, September 17 and 18-—\nCLEAR CHANNEL HEARING POSTPONED\nThe FCC has announced that the Clear Channel Hearing scheduled for Sept¬\nember 5, 1945 has been postponed till October ;?3, I94£«, The change was\nnecessitated by a conflict with the Third Inter-American Radio Converence\nwhich is to be held in Rio de Janerio, Brazil, on September 3, 1945.\nEducational station operators will be interested to note that the whole\nClear Channel Problem will come up for discussion before the NAEB con¬\nvention September 18th«\n—See you at the LaSalle——\nSCHOOL BROADCAST CONFERENCE IN OCTOBER\nThe Ninth Annual School Broadcast Conference has been announced for Oct¬\nober 22-23 IN THE Morrison Hotel in Chicago. In connection with this\nCON.FERCNCE THE SIXTH ANNUAL CLASSROOM USE OF RaDIO COMPETITION WILL BE\nHELD. Entries, due October 1st, 1945, will be judged by a committee\nAPPOINTED by the SBC EXECUTIVE COMMITTEE. UTILIZATION Am'ARDS AND CITA¬\nTIONS WILL BE MADE AT THE CONFERENCE. FOR FURTHER INFORMATION WRITE\nTHE SBC Information Editor, Room 708, 228 North LaSalle Street, Chicago\nI, Illinois."
}