{
  "id": "d238-15",
  "text": "THE OHIO STATS UNIVERSITY\nColumbus 10\nRBH-S9\nCOPY\nMarch 21 , 1949\nMr* Richard B» Bull* Manager\nStation WO I\nIowa State College\nArnes, Iowa\nDeer Dicks\nThis letter is in response to your request for reaction to the proposal of\nReverend R. Alton Reed, of the Baptist General Convention of Texas, to ask the federal\nCommunications Commission to permit churches to operate low-power FM stations on the\nfrequencies set aside for education*\nI think we ought* rather than to oppoee this proposal, to suggest instead that a\nnumber of definite restrictions be placed on such broadcasting. In other words, tnat\nthe churches be encouraged to use these frequencies if they can meet certain standards\nthat would operate in the ’’public interest, convenience and necessity,** It would be\npossible for the Commission to spell out standards that would safeguard the use of\nthese channels from misuse* I think the NAJBB might well get together a committee to\npropose what such standards might be. I would suggest some of the following!\n1. Thefe the broadcasting be principally of an educational nature rather than\nof evangelism,. The churches have an educational program and call it ^religious\neducation” so that the PM station might well be thought of as a part of the educa¬\ntional arm of the ohurch0\n20 Th© broadcasts should be of a general religious education nature with no\nattacks permitted on other faiths or denominations0 In other words, the kind of\nattacks upon other branches of the church that is characteristic frequently of so-\ncalled ’’fundamentalist* groups would not be permitted,, A general educational program\ntoward better religious living would bo encouraged.\n3. Provisions for the discussion of controversial issues should be similar to\nthose that operate in the case of regular radio stations* If a station finds itself\na party to a controversial matter, it must give equal time lor reply as is now the\ngeneral case*\n4o Engineering standards should be similar to those that have been set up lor\nother low-power stations. This, I believe, is a good deal lighter than the require-\nmanta for regular PM stations but there is still a safeguarding of engineering stand¬\nards. I do not believe the commission should remove standards in the way indicated\nin Mr. Reed*e proposal*\n5* I would not encourage the matter of shared time between church stations and\nschool stations. It would seem to me thet this would have bad implications* Certainly\neducational AM stations in th© past have had their trouble with shared channels and\nwe do not want to duplicate those mistakes, fthen there is a contest for limited fre¬\nquencies in a community, the group that could make the best case for using the facilities\nshould reaeive the facilities.\nThere are probably other and better standards that could be developed by an MHB\ncommittee which would safeguard these channels from exploitation and careless use. Other\nthan that, 1 see no real objection to letting these channels be utilised by religious\ngroups., I would assume, of course, that a standard would be included wnioh would inter¬\npret \"non-oomnieroial” to mean th«t solicitation of funds over the air was banned.\nThese are offhand reactions* but 1 trust they may be helpful*\nSincerely*\n/s/ I* KEITH TYLER"
}