{
  "id": "d238-2",
  "text": "RHI W\nSeptember 10, 1948\nMr, T» J* Slowie, Secretary\nFederal Communications Commission\nNew Postoffice Building\nWashington, D. C,\nBear Mr* Slowie:\nThe National Association of educational Broadcasters is very much interested and con¬\ncerned in the forthcoming hearings on television allocactons before the Federal Communi¬\ncations Commission,\nI am certain the organization will wish to make a statement with respect to the alloca¬\ntions plan, and the possibility of reserving some noition of the TV spectrum for educa¬\ntionally-owned video outlets, perhaps on somewhat the same basis as the present FM chan¬\nnels set aside for educational and non-commercial use*\nThe information I presently have, states that the TV hearings begin on September 21, 1948\nbefore the FCC, I have also heard it reported that becsuse of the amount and kind of\ntechnical data squired, that these healings may open and recess for later continuance*,\nMy difficulty is that 1 cannot re uest an appearance for the September 21 date, or any\ntime shortly thereafter, for she reason that the National Association of Educational\nBroadcasters does not ha”e 5.*.s annual business meeting until October 12, and I will be\nunable to get authorization for an appearance or a statement until that time* Nonethe¬\nless, several of our membe s have indicated an interest as 1 suggest above, and it seems\nimportant that a statement be made*\nN-A-E-B is concerned that FCC and other interested parties do not misconstrue the lack\nof positive acti n in the television field as a case of college and university standard\nbroadcast \"history repeating itself,\"\nN-A-E-B does not regard the situations as analogous, While colleges and universities\nfailed to ent ;r as vigorously as they should have into the AM broadcast field, it was\nmore a matter of lack of perception than cost. In the case of television, the funr a-\nmental barrier is excessive capital investment in a communications field, rhich can still\nfor all practical purposes, be regarded as experimental.\nIt would indeed be unfortunate if education in the U, S„ at some future date, were to be\npermanently penalized for ailure to \"prove out\" channe.. facilities in a field which is\nexcessively costly to enter and vhich is in many respects still in the developmental\nfield,\nI will appreciate hearing from you.\nKichard B, Hull\nPresident - NAEB\nec"
}