{
  "id": "d238-7",
  "text": "it Ip our plan to help all of the pastors who are granted low power PM\nchannels in every way possible, W© intend, to have a, school to instruct\nthem in the type of programming that will he of interest to not only their\ncongregation hut to everyone, It is our aim to show them how they can use\ntheir hoys and girls in type broadcasts that will he of interest to the\nchildren and the parents. Such broadcasts will cause mothers and fathers\nwhose children are on these broadcasts to buy an FM set and listen to this\nfreeuency.\nIt seems to me that here is an opportunity for us to work: with your organi¬\nzation, and that the two of us combined can make FM a coming type of broad¬\ncast over the entire t:,S„ area. Those of ns who are familiar with FM know\nthat it is the best type of broadcast and that the only reason it has not\nsucceeded is because w3 have not had enough FM sets in the homes and be¬\ncause 111 stations have not done a real job in -programming.\nWe have considerably over 200 churches who have already signed up to make\napplication for low power PM* This is a very small start on the number\nthat will want to make application when they know about it„ It can be a\ntrem ndous thing for FM in the future, I K>uid like for your organization\nto have a. complete understanding of what we are setting out to do, I would\nbe happy to come sod rauet with you or some of your executive officers that\nwe might sit around ths table and discuss these plans and any problems that\nmight arise, 1 am positive the FCC will get in touch with your organisation\nwhen our petition has been presented, I want you to have a complete picture,\nand when you have that picture I believe that you will see it will work to\nthe advantages of the schools and colleges as well as tc the churches.\nThanks for sending ms a copy of your S„AJ3*B, News Letter, I would like to be\nput on your mailing list If that is possible.\nTours very truly,\n/»/ R, ALTO!’ RS3D\nDirector"
}