{
  "id": "d353-100",
  "text": "2\nbotenen Waffen zu eigen zu machen, Sie haben nSmlich mit einer bei\nihnen immer starker offentlichen Meinung zu rechnen, die daftir nicht\nzu haben ist,\nEs wSre von grosser Bedeutung, wenn Amerika in dieser\nSchicksalsstunde der Menschheit sich entschliessen konnte, einzig an\ndie Notwendigkeit des Verzichts auf Atomwaffen und an die der nur\ndadurch ermoglichten Vermeidung eines Atomkrieges zu denken. Die\nTheorie der Aufrechterhaltung des Friedens durch Abschreckung des\nGegners vermittelst atomarer Aufrustting kann ftlr die heutige Zeit\nder so gesteigerten Kriegsgefahr nicht mehr in Betracht kommen.\nXXX\nEin lichter Schein im Dunkel. Im Dezember 1957 machte der\npolnische Aussenminister Rapacki (von sich aus, nicht, wie man anneh-\nmen v/ollte im Auftrag der Sowjetunion) den Vorschlag, dass Polen, die\nTschechoslowakei, Ost- und Westdeutsci ]b.nd von Atomwaffen cfrei bleiben\nsollten, 'A'ird auf diesen Plan eingegangen und wird der atomfreie Raum\nin Europa noch dadurch erweitert, dass angrenzende LSnder dieses\nPrivileg f!ir sich in ..nspruch nehmen und zuerkannt bekommen, so ist\ndamit viel ftir die vorlfiufige Erhaltung des Friedens erreicht*\nDer ..nfang des Verjagens des Gespenstes der Einkreisung der Sowjet¬\nunion ist gemacht.\nMit diesem so verntinftigen Vorschlag ist die offentliche\nMeinung Europas durchaus einverstanden, Sie ist in den letzten\nMonaten zur Erkenntnis zum Entschluss gelangt, dass Europa in keiner\nifeise zum Schlachtfeld eines zwischen der Sowjetunion und Amerika\nausbrechenden ..tomkriege werden darf. Davon Ifisst sie sich nicht mehr\nabbringen. Die Zeiten sind vortiber, wo dieser oder jener europSische\nStaat noch heimlich planen durfte, seinen Rang als Grossmacht darin\nzu bekunden, dass er ftir sich selber atomwaffen herstellen wtirde.\nAngesichts der Haltung, die die offentliche Meinung Europas einem\nsolchen Unternehmen gegentiber einnehmen wtirde, hat es keinen Sinn\nmehr, heimliche Vorbereitungen auf seine Verwirklichung h±r/we±ter zu\nbetreiben*\nXXX"
}