{
  "id": "d353-101",
  "text": "- 3. -\n.Wie steht es nun um die Verhandlungen, die zum Verzicht auf\ndtomwaffen fUhren sollen ?\n' Man hort und liest, dass da's Gelingen der geplanten Konfe-\nrenz auf hochster Ebene gana davon abhSlngen soil, dass aie in alien\nEinzelheiten aufs genaueste diplomatisch vorbereitet wind.\nDie beste Diplomatie ist die Sachlichkeit•\n11s sachliche Vorbereitung dieser Konferenz kSme in Be-\ntracht - wenn ehrerbietige, gut gemeinte Kritik als erlaubt gelten\ndarf - dass die Staatsmtoner und die Personlichkeiten ihrer nSlheren\nund fernen Umgebung von der undiplomatischen Irt, mit der sie zur\nZeit miteinander verkehren, wieder zur diplomatischen zurtlckkehrten,\nViele unnotige, unbedachte, unliebenswtirdige, torichte und ver-\nletzende Bemerkungen sind in den letzten Jahren, bei offiziellen\nund inoffiziellen nlStssen, miindlich und schriftlich zwischen ihnen\nbin und her gegangen, was der politischen ...tomsphare nicht zutrSg-\nI.f'b war,\nSachlich ist, dass nun endlich einmal diejenigen mitein¬\nander verhandeln sollen, die Vollmacht haben, Verantwortung auf sich\nzu nehmen, nicht nur dem Mamen nach Bevollmfichtigte, die keinen Finger\nbreit von den erhaltenen Instruktionen abweichen durften.\nSachlich ist, dass man mit der Konferenz vorausmache.\nIfber vier Monate lang ist liber sie, zwischen Ost und West hin und her\ngeredet und hin und her geschrieben worden, ohne dass etwas tiber die\nZeit ihres Statthabens und ihr Arbeitsprogramm- festgelegt worden ist.\nDie offentliche Meinung allenthalben hat Mtihe sich damit abzufinden\nund fSngt an sich zu fragen, ob eine Konferenz, die so ins Dasein\nhineinhinken kommt, nach Hoffnung auf gutes Gelingen erlaubt.\nSachlich ist, dass als Ort der Konferenz einzig eine Stadt\nin einem neutralen Lande Europas, also Genf, wie 1955> in Betracht\nkommt.\nSachlich ist, dass auf dieser Konferenz nur Fragen, die es\nganz direkt mit dem Verzicht auf Atomwaffen zu tun haben, zur Ver-\nhandlung kommen sollen,\nSachlich ist, dass sich auf der hochsten Ebene nicht zu-\nviele Leute einfinden, Platz nehmen sollten auf ihr nur die hochsten\nPersonlichkeiten der Regierungen der drei AtommSchte mit Experten\nund Beratern, die ihnen mit AuskUnften beistehen,\nZutritt konnten allenfalls noch Vertreter der Volker haben,\ndie mit den AtommSchten, wie die Natoiander mit Amerika, in Atomver-"
}