{
  "id": "d353-102",
  "text": "” 4' “\nbindung stehen, urn bei diesen ihre Ansicht tiber die auch ffir sie so\nfolgenschwere in Frage stehende Entscheidung geltend zu machen.\nNur in ganz willkUrlicher Weise kdnnten von den andern\nVolkern dieses oder jenes beanspruchenauf der hiochsten Ebene mit\ndabei zu sein, Entweder sind sie able dazu qualifiziert, oder keines..\nUbrigens lehrt die Erfahrung, dass unndtige Vielkopfigkeit einer Kon-\nferenz nich zum Vorteil gereicht. Die Konferenz auf hochster Ebene\nist also in kein.er Weise eine internationale oder halbinternationale,\nobwohl ihr Entscheid ftir die ganze Menschheit von so grosser Bedeutung\nist.\nDie„drei ..tommSchte, und sie allein, entscheiden von sich\naus, im Bevnist-sein ihrer Verantwortung ihren Volkern und der ganzen\nMenschheit gegentiber, ob sie auf Versuchsexplosionen und Verwendung\nvon Atomwaffen verzichten wollen, oder nicht.\nWas die so geplanten Verhandlungen angeht, ftihlt sich die\nSachlichkeitjbewogen, eine Bemerkung vorzubringen, Sie erktihnt sich,.\ndie Feststellung zu machen, dass die bisherigen Verhandlungen unsach-\nlich geftihrt wurden und darum ergebnislos verliefen. Sie hegt die\nBefUrchtung, dass es denen auf hochster Ebene ebenso ergehen konnte,\nwenn sie in derselben V^eise statthSlten.\nVforin unterscheiden sich in dieser Angelegenheit die Un-\nsachlichkeit und die Sachlichkeit ? Sie tun es in der Beantwortung\nder Frage: Auf Grund von was entscheiden sich die drei Atommachte ,ob\nsie auf die Versuchsexplosionen und auf die Anwendung von Atomwaffen\nverzichten woHen oder nicht ?\nDarauf antwortet die Unsachlichkeit: Sie werden es tun,\nwenn sie fiber ein Abrtistungsabkommen, auf Grund dessen sie es tun\nzu konnen glauben und tun wollen, eins geworden sind.\nDiese Logik ist falsch. Sie nimmt an, dass man zu einem dem\nOsten und zugleich dem Westen befriedigenden /.brlistungsabkonmien ge-\nlangen kdnne. Die bisherigen Verhandlungen haben aber erwiesen, dass\ndies nicht zu erwarten ist. Sie sind gleich in den AnfSngen stecken\ngeblieben, weil der Osten und der V/esten sich nicht einmal fiber die\nBedingungen, unter denen die Verhandlungen in Gang kommen sollten,\neinigen konnten,\nUberhaupt aber ist das in Aussicht genornmene Verfahren\nschon an sich, seinem Vvesen nach, unsachlich.. Es beruht auf einer\nfalscher Logik, Die zwei ftir die Existenz der Menschheit so notwen-\ndigen Entschlfisse - dass die Versuchsexplosionen aufhdren und- die"
}