{
  "id": "d353-104",
  "text": "m\n- .6 -\nZeit, wieder ViJirklichkeit, werden und in ihre Rechte treten.\nDie iitomwaffen verleihen einem Fernkrieg die Firkung eines\nNahekrieges. Die Sowjetunion und ..rnerika konnen sich heute, trotz\nder zwischen ihnen liegenden Entfernung, mit mSchtigen, weit abliegende\nZiele in ganz kur:zer Zeit erreichenden Atomgeschossen in so furchtbarer\nWeise bedrohen, als Idgen sie nebeneinander, Weil sie so Nachbarn\ngeworden sind, mtissen sie jede Minute urn ihre Existenz bangen,\nKommen aber itomwaffen nicht mehr in Betracht, so konnen\nsie sich, auch bei Benutzung von Raketen, nur noch mit Gestihossen, die\neine viel geringere Zerstorungskraft besitzen, angreifen. Die die\nExistenz bedrohende Nachbarschaft hat aufgehdrt.\nSind Raketengeschosse keine ;.tomwaffen mehr, kommt auch\nEuropa als Schlachtfeld zwischen der Sowjetunion und Amerika nicht\nmehr fUr einen Fernkrieg mit dem Effekt eines Nahekrieges in Betracht.\nHeute ist Amerika mit seinen in Europa aufstellbaren\nBatterien von ferngelenkten Raketenatomgeschossen militSrisch mit\ngrosser Macht in Europa gegenwfirtig, Europa ist zu einem Zwischenland\nzwischen Amerika und der Sowjetunion geworden, als wSre ..merika, wie\nin einer Kontinentverschiebung, an es herangekommen.\nKommen Raketenatomwaffen nicht mehr in Betracht, so nimmt\ndiese unnatdrliche Situation ein Ende, Amerika wird wieder ganz\nAmerika, Europa wieder ganz Europa, der Atlantische Ozean wieder\nganz Ozean, eine zwischen Kontinenten r^iumliche und zeitliche Distanz\nschaffende Wasserfl^che,\nDamit ist dann auch der Anfang des i.ufhorens der mili-\ntSrischen Gegenwart Amerikas in Europa eingeleitet. Sie ist durch\ndie beiden Weltkriege geschaffen worden. Unvergessen bleiben die gros¬\nser Opfer, die /*merika Europa im zweiten Weltkrieg und der auf ihn\nfolgenden Jahre gebracht hat, unvergessen die so grosse und so\nmannigfache Htilfe, die Europa von ihm empfing, unvergessen der Dank,\nden es ihm schuldet.\nAber die auf die zwei Kriege zurUckgehende unnatUrliche\nSituation seiner dominierenden militSrischen Gegenwart in Europa kann\nnicht in alle kommenden Zeiten Ubernommen werden. Sie muss nach und\nnach zu bestehen aufhoren, sowohl Suropas wegen als auch ..merikas\nwegen.\nXXX"
}