{
  "id": "d353-117",
  "text": "QUEEN OF BATTLE\nSERIES TWO\n14- -PACK MULES OF THE SKY\nhelicopters are playing an ever-increasing role in the mobility\nof the Army, carrying everything from troops to weapons to blood.\n15- -THE DEFENSE OF THE NATION\nlike a football team, each member of the Army team is assigned\nboth an offensive and defensive role\n16- ADVANCED NONCOMMISSIONED OFFICER SCHOOL\neven the “old-dogs” of the Army must learn new tricks. For\nthis, the Army’s NCO’s go to school\n17- -THE RANGERS\nthe toughest fighting men in the world are the Rangers. This\nis the story of their training and what it means to be a Ranger\n18- -THE HOME OF THE RIFLE\nFt Benning is the home of the infantry. And whether in training or\nin combat, the infantryman is never without his rifle\n19- -THE ARMY’S PROVIDERS\nthe Quartermaster Corps is responsible for insuring the truth of\nthe adjectives best fed, best equiped and best clothed Army in the World\n20- -THE 29TH--THE ARMY’S ACTORS\nFt Benning’s 29th Infantry demonstrates combat techniques to\nthe Army’s future leaders attending the Infantry School\n21- -NORTH ATLANTIC TREATY ORGANIZATION\nNATO spells security in Europe through teamwork. A close-up\nview of how “mutual defense” is organized and coordinated\n22- -HISTORY OF FORT BENNING\na telegram sent from a World War I combat by General Pershing\nsparked the beginning of Fort Benning’s exciting story\n23- -THE WOMEN’S ARMY CORPS\nWAC’S carry a heavy load of noncombat soldier duties, enjoy\nenriching and satisfying careers, and add to the national security\n24- -THE CANINE CORPS\nman’s best friend has played important combat roles throughout\nmilitary history. They perform the impossible in team with the GI\n25- -THE CHAIN OF COMMAND\nefficiency in accomplishing the Army mission depends on each link in\nthe chain of command. The Army runs smoothly with its “chain” drive\n26- ARTILLERY\nthe world’s finest weapons, plus men who know and excel in their\njobs, give the infantry an indispensable supporting ally\n14:12/14:22\n14:20/14:30\n14:05/14:15\n14:08/14:18\n14:25/14:35\n14:07/14:17\n14:05/14:15\n14:13/14:23\n14:08/14:18\n14:04/14:14\n14:00/14:10\n14:13/14:23\n14:08/14:18\n1"
}