{
  "id": "d353-119",
  "text": "QUEEN OF BATTLE\nSERIES FOUR\n40—SOUTH EAST ASIAN TREATY ORGANIZATION 14:20/14:30\nthrough SEATO the United States has assumed a major interest and\nresponsibility for preserving peace and freedom in the Far East\n41-THE NATION’S GIBRALTER 14:20/14:30\nthe story of the West Point cadet, his life, his training, the\ntraditions he upholds, and his role in the Army\n42— COMMUNICATIONS 14:10/14:20\nlifeline for military coordination, building and maintaining the\nArmy’s communications system is an important and difficult task\n43— THE ARMY’S ANSWER 14:03/14:13\nthe Army prepares to meet and defeat the enemy on any front. This\nis our answer to the Communist challenge\n44— MARKSMANSHIP TRAINING 14:15/14:25\nessential weapons for the combat infantryman, the rifle and\nmachinegun dominate much of the soldier’s training time\n45--MILITARY RESEARCH 14:00/14:10\nPh. D’s perform an Army mission indispensable to the national\nsecurity as they close the gap on future “dream” weapons and training\n46- -THE CORPS OF ENGINEERS\nin war, in peace, the engineers work hard to keep America\nstrong and a better place to live\n47- FORTY-EIGHT AND TWO\ntraining with the reserves, in weekly meetings and summer encamp¬\nments provides the Nation a large and ready second line of defense\n48- -SO YOU MAY LIVE\nwith the help of Conelrad and Civil Defense guidance, a family\nheeds the warning and survives an enemy attack\n49- TO TEEN-AGERS AND THEIR PARENTS\na military obligation is part of the lives of most young men. A\nteen-ager visits the military recruiter to get the lowdown\n50- -SOLDIER’S SERVICES\nlegal assistances officers, the Inspector General, Adjutant General,\nand the Red Cross have a single purpose, to offer service to the GI\n14:24/14:34\n14:14/14:24\n13:54/14:04\n14:10/14:20\n14:10/14:20\n51--THE MORALE BUILDER 14:18/14:28\nmorale building is the job of Army Special Services. They accomplish the\nmission with libraries, service clubs, hobby shops, and entertainment\n52--JOINT CIVILIAN ORIENTATION CONFERENCE 14:25/14:35\nJCOC shows civilian leaders from all walks of life a firsthand\npicture of Army and other service capabilities\n20935 Army-Ft. Benning, Ga. 13 Sep 57 500"
}