{
  "id": "d353-18",
  "text": "Pfesldent Lynn White, jr., Barnard Forum, 2/8/58 -- 2\nbecame between the two World Wars* The self-styled purists who grumble that even\ntoday too many people are going to college and that half of them should be booted\nout, are irrelevant to our times*\nWhat can the independent colleges and universities do to help meet the\ninevitable and vast increase of enrollment which is already beginning? Let's look\nat the context of the question*\nOur thinking must start, 1 believe, from the fact that we ere going to be faced\nwith a horrifying dearth of competent professors* In the first decade of this\ncentury, many professors were reasonably well paid in relation to the general\neconomic level* But the great inflation which was a byproduct of the First World\nWar saw little compensatory increase in faculty pay-checks* The boom of the '20's\nwill go down in academic history as a disgraceful era when trustees and regents\nfilled our campuses with lavish pseudo-Gothic and pseudo-colonial buildings, but\nforgot their professors* Then came the inflations of the Second World War, and of\nthe Korean War* By this time the effect of four decades of academic starvation\ncould scarcely be disregarded: it became clear not only that Ph.Dt's had long been\nleaving our faculties in a steady stream, but that economic conditions of life in\nthe academic world were so abysmal that bright young people, even when they got the\ndoctorate, were often going immediately into other kinds of employment.\nNow at last — thank GodJ -- the professor is getting into a seller's market*\nAnd, believe me, he is going to make the most of it* Graduate study is a fearfully\nlengthy process, and there is no possibility that it can be speeded up sufficiently,\nor expanded quickly enough, to meet the need which is already painful in the sciences\nand which will shortly be equally so in all fields of learning* We shall, of course,\nbe forced to systematic recruitment of professors from Europe, Latin America and\nAsia, where there are considerable reservoirs of Impoverished scholars. The recent\nrecord of academic exiles in this country gives us great hope for enrichment from"
}