{
  "id": "d353-21",
  "text": "President Lynn White, Jr«, Barnard Fomin, 3/8/58 •• 5\ndoes not expect to be a £ull»time worker while the children are young, she is\ndetermined not to present her husband-to-be with the inverse dowry of her own college\ndebts. While I firmly believe that there ought to be economic and vocational\nimplications in the education of every college girl, as of every college boy, 1 do\nnot believe that the primary reasons for sending either a girl or a boy to college\nare vocational. To put great onphasis on loan funds, and on college as a financial\ninvestment, would create a cultural atmosphere which would lead to disaster. If\nthe private institutions adopt this tactic, the spiritual elements in American\neducation will quickly be drained off into the state institutions and the former will\ndegenerate into trade schools pure and simple.\nHowever, undoubtedly independent institutions are going to find themselves\nforced to raise their fees to levels which make us shudder to contemplate. Whereas\ntoday the total fees of a resident undergraduate in a good Independent college run\nin the neighborhood of $2,000, it is my bet that within a decade such fees will\namount to at least $3,000, in terms of the present value of the dollar. In no other\nway can independent colleges hold or secure adequate fac^ltiess 1 believe that even\nat such levels there will be a considerable constituency for the independent\ninstitutions. Mills, I regret to say, at $1900 is the most expensive college on the\nPacific Coast, and yet we operate, in terms of defensible admissions standards, only\neight miles from the University of California at Berkeley where the fees for a\nCalifoimian are negligible, the standards of admission high, and the faculty\nacademically superb.\nAll of our independent institutions are going to raise their fees drastically,\nand will still find students. But won't they also be pricing themselves out of so\nlarge a segment of the market that quantitative expansion would be folly?\nParents, you see, are not merely having more babies, they are.shaving them in\nterms of a new demographic pattern^ Young people are marrying earlier than ever"
}