{
  "id": "d353-218",
  "text": "All radio stations want to give their\nlisteners good and varied programmes.\nWhen it concerns music, a symphony, a\npopular concert or a jazz programme all\nstrive to obtain the best possible orchestras\nand the best possible quality.\nThe cost for such programmes is high, as\nthe remuneration paid to the required num¬\nber of musicians is heavy. Therefore, the\nquality often suffers, since one avoids\nengaging more musicians than are absolutely\nnecessary. Frequently, just those extra in¬\nstruments which provide the full richness\nof tone in the music are missing.\nExchange of progfammes\nRadio stations have been used to exchanging\nprogrammes between themselves. However,\nthis only results in an equation of 1: 1.\nThis has reduced the cost for just these\nprogrammes and thus enabled the use of\nlarger orchestras.\nProgramme costs can be reduced and\nthe quality improved!\nSwedish Radio and TV Programme Service\ngives all radio stations the opportunity to\nprovide programmes of music more cheaply,\nwith larger orchestras and of improved\nquality, and thus the possibility of increased\nmusical programmes of the highest quality.\nGramophone recordings can be reduced and\nreplaced by live programmes.\nOur programme service supplies at low\ncost programmes of all kinds of music,\nrecorded by the best orchestras. These\nprogrammes can be bought for l/lO to 1/20\nof what a broadcasting station would have\nto pay to produce such a programme itself.\nNot only this. Every radio station can in\nexchange for a first class recorded pr^\n’ gramme obtain up to 10 programmes against\nthe usual 1: 1. The condition for this is\n\"rhaf a rompiete orchestra ot a high standarST\n.Js used for their own recording and that\ndre result is ot high technical quality. Such\na recorciing is made at the same time as\nthe broadcast. The programme is sent to\nWhat does a\nus. and after the quality has been approved.\nlip tn in programmes of a similar kind can\nbe ordered from us for the cost of only\nthe tane.-\nWe reserve to ourselves the right, however,\nof final decision. A team of good judges of\nmusic and skilled technicians listen to the\nincoming programmes before they are accep¬\nted. Every programme must bear details of\nthe name and size of the orchestra, the\nname of the conductor and soloist, if any,\nthe date and place of recording together\nwith the contents of the programme, length\nof playing time and standard NARTB or\nCCIR. As soon as a programme is approved,\nit is added to our list, which is sent out\nat regular intervals to all radio stations.\nprogramme cost?\nIn this way every radio station has the\nopportunity to obtain a wider choice and\ngreater variety of musical programmes and\nevery country’s typical and special music\ncan be sent from one broadcasting station\nto another — and at l/lO to 1/20 of the\nnormal production cost.\nThis exchange system also improves the\nposition of the musicians concerned, since\nlarger orchestras than formerly can be\nused and several programmes can be\nproduced at a lower total cost for the\nbroadcasting station.\nOur activities are inter-continental and the\norganisation is under expansion with offices\nin several places all over the world.\n. Recording of Scandinavian music.\nAt present there is a number of recordings\nof typical Scandinavian music by Scandina¬\nvian composers. There is a choice of sympho¬\nnic as well as popular light music. Famous\norchestras and perfect technical equipment\nhave been used.\nOur technical equipment is of the highest\nquality and of the most modern type. There\nis a, complete Ampex recording outfit, a\nlarge and a small music studio. Copies are\nmade on an Ampex copying machine and\nthe qualities listed on next side can be\nguaranteed for every programme we supply:\nBoth NARTB and CCIR standards can be\nobtained. A programme coming in to us\nin one of these standards can be transferred\nto the other without any loss of quality.\nProgramme copying is carried\nout by us.\nIt you need to obtain a copy of a tape\nrecording for some purpose, we undertake\nsuch work at low cost, Sw. Kr. 2: 50 per\n1200 ft. Such copies can be obtained at the\nsame speed and standard as the original, or\nat any other speed from 60 to 3%\" per\nsecond with retained or transferred stan¬\ndard. Tapes for copies can be supplied\neither by you or by us. In the former case\nwe can, through a special agreement, obtain\nthese tapes free of customs duty to and\nfrom Sweden, and in the latter case the tape\nis supplied at prices in accordance with the\nattached list.\nWe shall be pleased to supply any further\ninformation and will send a sample tape on\nrequest. These contain partly a recorded\nfrequency curve, and partly extracts from\ndifferent recordings, from which the quality\ncan be judged. 'These trial recordings are\nmade from copies already issued, so that\nthey completely correspond to the quality\nwhich is to be found in all programmes\nissued by us.\nContact us for further information and for\nrequisition of lists of programmes and\nprices."
}