{
  "id": "d353-226",
  "text": "Music OH moving tape...\nThe activity of MASKIN & ELEKTRO CO. LTD has not\nstopped at selling taperecorders and equipment. For half a\nyear now the company has been producing prerecorded tape\n»Swedish Phonotape». This new type of »music in the home»\nhas become very popular in a short time in U. S. and also\nthe European market evidences great demand.\nCompared to grammophone records, the prerecorded tape\nhas many great advantages.\nThe tape can be played indefinitely without any deterioration\nof any kind, whereas a grammophone- record loses the diigh\nfrequences after playing a few times. Very few homes have\na record player of high enough class to reproduce the highest\nfrequences. A good taperecorder however has a frequency\nresponse giving all frequences audiable to the human ear.\nPrerecorded tape therefore gives greater possibilities of re¬\nproducing music in the home.\nFurthermore the tape is practically proof against wear out.\nIf and when the owner is tired of a recording, he just can\nuse it for a new recording. A grammophone record, when\nit is out — well it is out.\nPHONOTAPE\nEvery owner of a taperecorder has the opportunity to make\nhis own recordings by microphone or radio, though there\nare great difficulties in ensuring the highest sound quality.\nThe radio transmitters have a limited frequency range and the\nreceivers are sensitive to different kinds of distortion. Re¬\ncordings by microphone are a little scientific. Of course\neverybody owning a taperecorder can make a recording from\nan orchestra and get good reproducing but in order to get a\nperfect recording of the highest class, expensive microphones\nand acoustically balanced studios must\nbe used. The prerecorded tape has\ntherefore met a great demand all over\nthe world. The very best orchestras and\nthe most high class equipments are used\nand clever technicians arrange the placing\nof the microphones in the acoustically\nbalanced studios when prerecorded tape\nis produced. Furthermore the taperecor¬\nder owner is offered his choice from\na large tape library including those\npieces of music he is most likely to\nwant.\nPHONOTAPE\nIn order to produce high classed pre-'\nrecorded tape M & E has built a recor¬\nding studio. This studio was constructed\nto the high standards with help of the\nprogress evolved by the most recent\nacoustical research.\nLa. the sound is moderated by special\ntreatment of the ceiling and the walls.\nAn echo chamber is connected to the\nstudio, so that the acoustical balance can\nbe regulated as desired. A complete set\nof professional recording equipments is\ninstalled in the technician’s room, where\nare employed Ampex professional record¬\ning machines, mixers and amplifiers\nof different types. An Ampex dubbing\nmachine is used to produce the copies.\nPHONOTAPE\nAmpex dubbing equipment in the studio"
}