{
  "id": "d353-25",
  "text": "President Lynn White, Jr,, Barnard Forum, 2/8/58 -- 9\nvery dangerous to lay dovm guide-lines for all of them; for some might be deceived\nabout their special situations. While possibly certain changes in the tax laws,\ngreater generosity on the part of national corporations, and the like, may assist\nthem as a group, I am certain that each campus must survive and prosper In terms of\na lucid understandnng of Its own distinctive qualities and of the support which may\nbe found in Its own distinctive constituency. Many of our greatest Independent\ncolleges and universities have been carried through the decades not only by a certain\nexcellence but by a momentum of unexamlned public acceptance. We are now In a new\ndemographic, economic and academic context in which this momentum cannot be counted\non indefinitely. Each institution must ask itself. In its own terms, where it\nstands, what it has to sell, and to whom.\nWhile scarcely a campus does not have committees now debating the.matter, It is\nmy personal belief that very few Independent institutions will decide to attempt to\ngrow quantitatively to any great extent; for, since students will continue to cost\nmore than they can possibly pay in fees, quantitative expansion will only rarely\nhelp to maintain quality. The exceptions will chiefly be found in those Roman\nCatholic establishments where a very high proportion of the faculty consists of\nunpaid clergy. It may be also that the large. Independent, urban, non-resident\nuniversities which make no pretense of maintaining a low student-faculty ratio, and\nwhich are not burdened with the overhead costs of residence facilities, can grow\nconsiderably. But most of the typical American residential liberal arts institutions\nare going to find that, if they are to maintain their academic quality, they must\nincrease fees to the point where their part of the market is so small that expansion\nis impossible.\nThis same crisis hit the private elementary and secondary schools of America\nin the nineteenth century when the public schools became a major national enterprise.\nSuch ^Independent schools serving the earlier years of education continue to be a"
}