{
  "id": "d353-27",
  "text": "Address of Dr, Lewis Webster Jones, President of Rutgers, The State\nUniversity, at the Tenth Annual Barnard Forum, Saturday, Feb. 8, 1958,\nWaldorf-Astoria Hotel, New York, N. Y.\nPUBLIC HIGHER EDUCATION FACES THE FUTURE\nI am glad to have the opportunity to take part in this distinguished\nprogram. The Barnard Forum has contributed a great deal to enlightened\npublic discussion and Barnard College is to be congratulated for its\nleadership.\nMy assignment is to discuss public higher education. This includes\n3- Is-rge and varied array of junior colleges, teachers colleges, miinicipal\nand state universities, -- any institution, in fact, which takes the student\nbeyond high school and which gets the bulk of its support from tax revenues.\nBut the most characteristic American public institutions of higher learning\nare the state and Land-Grant universities, and most of my remarks will\nrelate to them, as does my own experience.\nThe first and most obvious fact is that the role of these public\nuniversities is likely to increase, both absolutely and proportionately.\nAlready, they educate more than half the college population. I doubt that\nthe private institutions, with the best will in the world, can expand\nrapidly enough, or on a large enough scale, to take care of the predicted\ndoubling of college enrollments in the next ten or fifteen years. Some of\nthem prefer not to expand, believing that they are now at their optimum\nsize. An even larger share of the greatly increased educational load\nmust therefore be assumed by the tax-supported universities.\nIf any of you feel that this is a disastrous trend, I hope I can reassure\nyou. It will not mean the end of free private enterprise, nor a lowering of\neducational standards, nor any necessary loss of the freedom of teaching\nand research.\nUntil eleven years ago, my own experience as student, teacher and\nadministrator was exclusively in private institutions: Reed, Columbia,\nBrookings, Bennington. When I moved into state universities, first in\nArkansas and then in New Jersey, I did not find myself in a different\nacademic world.\nThe important question to ask about a university is not \"Where does\nit get its money?\", but \"How good is it?\" There are strong and weak\nexamples in both the public and the private categories; and the standards\nof excellence are the same for both, American universities attract stu¬\ndents from all over the world. Among the foremost are California, Michigan,\nWisconsin, Minnesota and other state universities, as well as Harvard,\nYale, Princeton and smaller private institutions. As other nations\ndemocratize their educational systems, or begin the attack on illiteracy,\nit is to American public education that they most loften look for a model."
}