{
  "id": "d353-28",
  "text": "Barnard Forum -2\nBut the categories, public and private, are neither clear-cut nor of\ndecisive importance as they apply to American higher education.\nIn their origins, many of our outstanding private colleges received\npublic support. Harvard is an example. Many state universities, like the\nUniversity of North Carolina, were established in part by private bequests,\nCornell is hard to classify, since it is a private university which is also\nthe Land-Grant College of the State of New York, M.I, T, is another Land-\nGrant institution. So is Rutgers, which is also the eighth oldest of the\ncolonial colleges, and the state university of New Jersey, All colleges\nand universities are chartered by government and enjoy tax exemption.\nIn their financial support, the differences are again a matter of\ndegree. Public as well as private universities depend in part on gifts and\nendowments. Almost all public institutions charge tuition. Government\nand industrial research contracts go to public or private universities\nwithout distinction. And every institution of higher learning in the country\nis finding it increasingly difficult to get enough financial support to do\nthe enormously important, vastly expanded job which they must collectively\ntackle in the immediate future.\nNor do the private and public institutions differ markedly in the\nmatter of control, I remember the heartfelt remark of the president of\na church-supported college, who said to me: \"You state university pre¬\nsidents think you have your troubles, dealing with trustees who claim to\nrepresent The People, How would you like to deal with a board which\nclaims to represent God?\"\nThe fact is that all our educational institutions are controlled,\nsometimes wisely, sometimes not so wisely, by lay boards, on which\nbusinessmen and lawyers predominate. And all must also try to explain\nthemselves to, and seek support from, a wider public. This is the\nAmerican system, and I think it has much to be said for it as a democratic\ninstrument.\nWe may look wistfully at Oxford and Cambridge, and the other\nBritish universities, receiving the bulk of their support from government\nthrough the University Grants Committee, They are subject to none of\nthe direct public control exercised in this country. They are free from\nthe constant money-grubbing which burdens the lives of American college\nand university presidents. No such system is likely to be adopted here.\nSo that every American university, whether public or private, must con¬\nstantly strive to explain its aims and educate the general public to some\nextent. It must withstand distorting pressures and strengthen and defend\nthe freedom of teaching and research which is necessary to the unique and\nessential functions of universities in American civilization,\nI don’t think it is realistic or useful, therefore, to put public and\nprivate higher education in sharply separate categories; and I deplore\nany disposition to put them in opposite or competing camps."
}