{
  "id": "d353-282",
  "text": "2\n> From a statement issued by the sub=committee of the\ni'jnerican Atomic Energy Commission I quote the following phrases;\n^'Within the framework of scientific and military requirements, it is\nadviseable that nuclear tests are limited to a minimum, -\nThe necessary steps should be taken to correct the present confusion of\nthe general public. - The present and potential effects on heredity\nfrom the gradual increase in radioactivity of the air are kept within\ntolerable limits, - The possibility of a harmful effect which people\nbelieve to be outside control, has a strong emotional effect. - The\ncontinuation of nuclear tests is necessary and justified in the\ninterest of national security.”\n^Aliat is meant by ”the confusion of the public” is the fact\nthat people are becoming increasingly aware of the dangers resulting\nfrom nuclear tests.\nThe meaning of the obscure statement that ”the effect on\nheredity of the increase in the radio-activity of the air is kept\nwithin tolerable limits” is that,that the number of deformed children\nthat will be born as a result of the harm done to the sexual cells,\nsupposedly will not be large enough to justify the stopping of the\ntests I\nThe view of the scientists that feel called upon to reduce\nthe danger of radioactivity to what they believe to be its right pro¬\nportions, is expressed by a Central European scientist who concluded\na speech on this subject with the; following bold, prophetic words;\nI ”If the tests are carried on with the same frequency as in the last\n3^ears, the radioactive poisoning will be four times stronger in I983\nthan at present, and about six times stronger around the year 2010 •\nEven that strength would be small compared w’-ith natural radiation.\nIt can be stated categorically that the risk for mankind involved in\nnuclear tests is small. That is not to say that there is no risk.\nIn this context I should like to quote the words of the American\nphysicists and member of the Atomic Energy Commission, Professor\nDr. Libby. ”The risk of radioactive poisoning must be balanced against\nthe risk to which the entire free world be exposed if nuclear tests\nwere abandoned before a safe international disarmament •. agreement\nhas been brought about* The tests are necessary if the United States\nof America are not to be left behind in the developement of nuclear\nweapons”-^"
}