{
  "id": "d353-30",
  "text": "Barnard Forum-4\ncrammed with larger and larger cars, but leading only to larger and\nlarger mental hospitals. In any case, the proportion of state revenues\navailable for higher education has fallen, rather than risen, and I know\nof few state universities which are not feeling the pinch. Almost all\nare inadequately housed and staffed, even for today*s relatively manage¬\nable enrollments.\nMost states and municipalities have faced the problem of the coming\nexpansion, at least to the extent of estimating the needs for new buildings\nand staff during the next decade. But there is danger that they will wait\nuntil would-be students actually find the doors of the state universities closed\nto them before the necessary revenues will be voted.\nIt is not the easiest thing in the world to educate the general public\nto the needs of higher education. Many otherwise intelligent people seem\nto think of it as a natural good, even a natural right, without costs of\nproduction. Legislators have no difficulty in understanding that the highway\nprogram needs more money, as population grows and costs rise. But some\nof them are shocked when an academic building, postponed for several\nyears, has also gone up in price, or is already inadequate because of in¬\ncreased enrollments. Small classes come under indignant scrutiny; but\nit is impossible to run an honors program, or a graduate program, without\nsome individual instruction. Higher education is expensive, and it gets\nmore expensive the higher it goes.\nUniversities must of course do all they can to make the professor go\nfurther, through such devices as TV, large lectures with sectional discus¬\nsion groups, adequate secretarial help, and so on. Economies can be\nmade through fuller use of facilities, better scheduling, and perhaps some\nrevision of the academic year. Both the quality and the efficiency of edu¬\ncation might be improved by putting more responsibility on the student to\nlearn, and treating him less like a schoolboy. But even the brightest and\nmost mature students must have their work individually criticized and\ncorrected and explained. Most of the possible time-saving devices are\nalready being discussed and tried, I am continually ?.mpressed with the\ningenuity of faculty members in making do with less, and stretching the\nacademic dollar to its limits. The hard fact remains that buildings, equip¬\nment and instruction are expensive, and likely to get more rather than\nless so. Economies which result in bad educational practices can be the\nmost expensive and wasteful of all devices.\nThe real challenge of Soviet Communism is this; can capitalist\nAmerica allocate the necessary resources to education and research? Can\nwe find ways to channel a large enough stream of our vast wealth into an\ninvestment in education and trained intelligence--the only possible basis for\nsurvival in the modern world?"
}