{
  "id": "d353-4",
  "text": "RADIO STATION\nOWNED AND OPERATED BY\nTHE STATE COLLEGE OF WASHINGTON\n5000 WATTS - 1250 KC\nPULLMAN, WASHINGTON\nPROM: Burt Harrison\nTO:\nMEMORANDUM\nBob Underwood - Dick Vogl\n/yhi\nSUBJECT: Vote on Program Submission:\nScience and Society\nPairleigh Dickinson U.\nA On the basis of the audition tape, I have little choice but to\n/ vote for the rejection of this one. The show is slow moving,\n< stuffy, and amateurish to an exteme. On top of all that, the\nI recording quality is very bad.\n/ On this last point, I hate to vote on the basis of recording\nquality when I have only heard a single tape-since there is\n/ always the possibility that I received a bad dub, or that my\n/ playback machine is at fault. I checked this one on three\n. machines, however—two Berlants and an Ampex—and it always came\nout with a 15 percent noise level, low frequency response, and\nseveral annoying burbles which sounded as if the original master\nhad had some bad splices in it.\n/ Disregarding the recording quality, this was not a good show\nupon which to Judge the series. In case you haven't heard it,\nthe audition submitted was the opening show of a fifteen show\nseries. We start off by killing 40 seconds establishing the\nfact that the series of I5 “Science and Society\" programs we are\n\\ about to hear is part of a larger series called \"This is\n) Pairleigh Dickinson University,\" or some such. The moderator\nthen shoots another minute and 10 seconds with an outline of what\nis to be discussed and how during the next four months.\nThe discussion. Itself, when we finally get into it, is pretty\n- contrived and gives evidence of having been scripted and re¬\nhearsed down to the last comma—and you know what scripted\n^/' discussion sounds like.\nActually, however, I hate to vote for complete rejection without\nhaving heard one of the later shows in the series. The list of\npeople from industrial firms Involved in the later shows is\n^ Impressive and suggests that there might be some truly Interesting"
}