{
  "id": "d353-53",
  "text": "THI UNIvmSITY or connscticut\n•TOUR*. CONMKCTICUT\nMarch 10, 195«\nKr* Hyland Crary\nEiiucationai Telerisiwi and Radio Cantor\n2320 Waabtrnaw Avenua\nArj-i Arbor, Michigan\nDear Mr. Crary:\nIn a recent convarsation with Phil Waas of tha Connacticut Council\nfor the Advancement of Kconcnic Education, I learned of your connection\nwith the Gentler. Wa hare recently conpleted a 13-week radio aeries\nentitled \"Stretching Tour Family Income\" on WTIC in Hartford* Tha res¬\nponse to offers for free copies of tha script was very encouraging. We\nhad nearly UOO requests for these coplee, one of which is tnclosed. As\nfor content, I will not attempt to go into this In detail, but will refer\nyou to the enclosed publication,\n1 am also encloeing a copy of the first program as it was taped.\nWe are eapecially interested in having the Center make use of this series\nfor distribution to as many educational radio stations as would be\ninterested. There will be absolutely no cost to the Center or any radio\nstations using the series. If you are able to take the series and act\nas a national distributor, we will edit the opening and closing, or if\nyou prefer, you could cut the present opening and closing and make one\ncf your own. Otherwise, we must ask that the tapes not bs edited In mny\nother way.\nThese recordings were mads on a Magnecorder with an RCA 77-D\nmicrophone. Aa I am quite sure you will discover when lieterdng to the\ntape, the quality is good both from a tsehnieal and performance stand¬\npoint.\nDr, Bilkey has considered many phaeet in this area which have not\nbeen explored to any great degree, at least in this area, and I feel that\nhe has made a significant contrib»itlon to the Job of glrlng the public a\nbroader understanding of the practical aspects of eCfonomics, I wiU be\narodous to hear your rsaction to this proposal, Ws are especially\ninterested in having the series used as soon as possible.\nIncidentally, this series will be offered to other cossaercial\nstations in Connecticut, but we hope to limit the usf of the. series to\neducational radio O'ltlets, Thank you for your consideration.\nSincerely yours,\n- t.H, *\nDon Neleon\nRmdip-Tv Supervieor\nDN:bk"
}