{
  "id": "d353-58",
  "text": "Avenue\n■ ' l/t^ c «\nNetwork Program Director\nNational Association of\nEducational Broadcasters\nUrbana, Illinois\nDear Sir\nI am sending under separate cover, five tape recordings done\nduring a summer trip to PrnHce, Italy and Yugoslavia last year,\nI believe they have p^irticular interest for a college age\naudience since they are interviews with American,French, Italian,\nand Yugoslavian students, iind they do go into some detail on a\nprogram for college age youth and young adults known as \"Exper¬\niment in International Living,\" which this year is observing\nits 25th anniversary.\nOver the past 25 years this organization has placed 40,000\nyoung people in family homes in foreign countries to spend\ntheir summer vacations and to gain greater insights into the\nway other people live and think and feel.\nI have enclosed a description of each tape r, s well as suggested\nopening and closing announcements.\nThe trip was made independent of the EXPERIMENT office, but\nthey were extremely helpful in assisting me to meet and talk\nwith their groip s.\nI wrote your office before Imade the trip last summer, and\nwas told that there would be interest in auditioning these\ntapes.\nAfter you have reviewed them would you be kind enough to let\nme know if this is sujtible material for programming through your\norganization, and what the Association would be able to pay for\nthis m pterial.\nI also would like to have these tapes returned to me when you\nhr,ve finished using them.\nIf five tapes are not sufficient I shall be able to supplement\nthese with interviews with American students from around Boston,\nwho made these trips liust year concentrating on their memories\nand experiences in actually living as a member of a foreign\nfamily for the summer, and I can also arrange interviews with\nyoung people getting ready for similar trips this suraiper. Perhaps\ncombining a young student preparing to go go a specific country\nwith someone who was there last year might make interesting\nprogram material."
}