{
  "id": "d353-77",
  "text": "ST, ALBANS The National Cathedral School for Boys\nMOUNT ST. ALBAN, WASHINGTON 16, D.C.\nCanon CHARLES MARTIN, Headmaster\nMr, Robert Underwood, Jr,,\nNAEB Network Manager,\n14 Gregory Hall,\nUrbana, Illinois\nDear Mr, Undervrood,\n8, 1958\nI am enclosing a \"Network Program Submission Form” given me by\nMr, Jack Summerfield of VIGBH-FM in Boston, I talked with Mr,\nSummerfield this last week in Boston regarding broadcast by\nWGBH of a program held here at St, Albans on March 23 entitled\n\"Science and Secondary Education,” of vrhich I am enclosing a\nprinted transcript.\nWe have both edited and unedited versions of this program, I left\nan unedited tape with Mr, Summerfield which VGBH duplicated for\nan edited broadcast on May lyth at 4:00 PM,\nAt that time he told me of the NAEB and the method of submitting\nprograms for possible distribution by the netv/ork. He offered to\nedit the tape down to 59 minutes and also provide openers and\nclosers for it, and also to handle anything else regarding the\ntape as required by NAEB, Unfortunately, we do not have such\nfacilities readily available here.\nThis program, or symposium, was the first of a series of such\nsymposia exploring the problems of secondary education to run\nthrough June 1959. St, Albans, by virtue of its location and\nstrong support in the nation's capitol. is particularly able to\nhold such programs with ease. This particular program created\na great deal of interest, obtaining national news coverage as\nwell as mention in LIFE, TIME, and NEWSWEEK, ¥e feel the tapes\nare especially\" suited for educational radio stations.\nSince Mr, Summerfield did not have many submission forms, he\ncould give me only one. If you would send me a supply of them^\nI would be glad to provide you with the required number. Also,\nplease inform me if there is anything else I must do in order to\ninsure expeditious audition procedures and, I hope, network\nacceptance, I am forwarding a copy of this letter xo Mr. Summerfield\n^ssell EVOi^enter\nDevelopment Director"
}