{
  "id": "d353-88",
  "text": "Das Dntegreifliohe an der Propaganda fur die\nFortsetzung der Versuchsexplosionen ist, dass sie es fertig\nbringt, sich tiber alles hinweg zu setzen, was den Biologen\nund .ATZten zufolge, auf grand der auf die heutige Menschheit\neinwirkenden Radioaktivitat in kommenden Geschlechtern an\nUnbeil zu erwarten ist. Das Manifest der 9235 Wissenchaftler\ntut gut daran, auf diese G-efahr eindringlioh aufmerksam zu\nmachen,\nwir konnen die Verantwortung dafiir nicht auf uns\nnehmen, dass, weil wir ihr nicht geniigend Beobachtung\nschenkten, einmal Kinder mit schwersten korperlichen und\ngeistigen Sohaden zu Tausenden auf die Weld kommen werden.\nNur solche, die nie dabei waren, wenn eine Missgeburt ins\nDasein trat, nie ihr Wimmern horten, nie Zeugen des\nEntsetzens der Mutter waren, konnen die Behauptung wagen,\ndass die Fortsetzung der Versuchsexplosionen ein Risiko sei,\nzu dem man sich unter Umstanden entschliessen konne. Der\nbekannte franzosische Biologe und Erbf«rscher lean Rostand nennt\ndas Fortsetzen der Versuche »das auf die Zukunft hin veriibte\nVerbrechen”(le crime dans l^avenir). Dafur einzutreten, dass\ndiese Versundigung an der Zukunft nicht statthabe, sind in\nbesonderer Weise die Frauen berufen. An ihnen ist es, die\nStimme zu erhaben. Sie m5gen es vernehmlich tun.\nxxxxx\nMerkwiirdigerweise ist bisher ganz ausser\nBetracht geblieben, dass die Frage des Weitergehens Oder\nAufhbrens der Versuchsexplosionen nicht etwas ist, dass nur\ndie Atomwaffen erzeugenden Lander angeht und uber das sie\nmiteinander nach G-utdiinken zu beschliessen haben. Wer gibt\ndenn diesen Landern das Recht, in Friedenszeiten Erprobungen\nvon Waffen vorzunehmen, die sammtliche Lander der Welt in\nschwerster Weise zu schadigen vermogen? Was sagt das in\nunserer Zeit hoch gepriesene und von den Vereinigten Nationen\nauf den Thron erhobene Volkerrecht dazu? Sieht es aus dem\nTempel, in dem es thront. nicht mehr in die Welt hinaus? Man\nhole es heraus, dass es sich in ihr umsehe und seines /mites\nwalte."
}