{
  "id": "d353-91",
  "text": "•V,\n• , Zweiter Vortrag. Teil I.\nSendezeit: I9. Mai Friede oder Atomkrieg.\nurn I93O-I95O Uhr yon Dr. Albert Schweitzer.\nVerzicht auf Atomvraffen-.\nWir mdssen heute mit der drohenden Mdglichkeit eines\nzwischen der Sowjetunion und Amarika ausbrechenden Atomkrieges reclinen.\nVermieden kann er nur werden, wenn die beiden MSlchte sich mitein-\nander entschliessen, auf Atomwaffen zu verzichten.\nWie Sind wir in diese Lage gekommen ?\nIm Jahre 1945 gelingt Amerika die Herstellung der auf der\nKernspaltung von Uran 235 beruhenden Atombombe. Diese Ifisst es am\n'sechsten August 1945 auf Hiroshima und am neunten August auf Nagasaki\nabwerfen,\nDer Besitz dieser Atombombe verleiht ihm eine einzigartige'\nmilitarische IHberlegenheit ttber alle Volker.\nVom Juli 1949 an verfUgt die SoiAfjetunion auch fiber eine\nAtombombe. Und zwar ist deren Mirkung ebenso gross wie die der Zwischen\nI94S und 1949 vervollkommneten amerikanischen Bombe. Zwischen beiden\nMMchten ist nun der Friede insofern gewahrt, als jede Respekt vor den\nBomben der andern hat.\nAm 3* Oktober 1952 bringt England auf der Insel Montebello,\n(an der Nordwestkfiste Australians) , seine erste Atombombe zur Expli-\nsion.\nUrn aufs neue eine Uberlegenheit zu erringen, entschliesst\nsich Amerika, Edward Teller an die Herstellung der V/assers toff bombe\ngehen zu lassen, von der man erwartet, dass sie der bisherigen Uran-\natombombe urn ein Vielfaches flberlegen sein werde.\nEin erster Versuch wird mit ihr im Mai 1951 in Bniwetok auf\ndem Pazifik-Atoll Elugel&b im Oktober I952 gemacht.- Am ersten MSrz\n1954 wird auf Bikini - einer der Gruppe der Marschalinseln im Stillen\nOzean angehorigen Vulkaninseln - die vervollkommnete Wasserstoffbombe\nzur Explosion gebracht. Dabei stellt sich heraus, dass ihre Spreng-\nwirkung noch viel stMrker ist als man auf Grund der Berechnungen er¬\nwartet hatte*\nGleichzeitig mit Amerika hat sich aber auch die Sowjetunion\nmit der Herstellung von Wasserstoffbomben abgegeben.- Die erste bringt\nsie am 12. August 1953 zur Explosion."
}