{
  "id": "d353-92",
  "text": "Einen weiteren Fortschritt machen die beiden Mfichte auch\nmiteinander. Es ereignet sich namlich, dass der Erfindung der Atom-\nbombe, mit der Amerika im zweiten Krieg besch^!ftigt gewesen ist, die\nder Raketengeschosse, mit der sich Deutschland damals abgegeben hat,\ndienstbar gemacht wird. Nun ist man nicht mehr ainzig darauf enge-\nwiesen, dass mSchtige Fluzeuge Bomben bis Uber den Ort, an dem sie\nexplodieren sollen, befordern. Man verftigt jetgt tiber ferngelenkte\nRaketen, die von Abschussrampen aus auf genau eingestellte feme\nZiele entsandt werden konnen.\nRaketengeschosse s4nd solche, die durch sine Rakete be-\nfordert werden, das heisst einen Flugkorper, der den Triebstoff, durch\nden er fortbewegt wird, in sich tragt, Dieser besteht aus Stoffge-\nmischen, die Verbrennungsgase erzeugen, die mit einer ausserordentlich\ngrossen Ausstrdmungsgeschwindigkeit durch eine dUsenfdrmige, verengerte\nOffnung entweichen, Fortgesetzt ist man damit besch^ftigt, noch\nleistungsfahigere und einfacher zu handhabende Triebgemische zu ent-\ndecken.\nDas von der Rakete beforderte Geschoss, kann ein gewohn-\nliches sein oder eines, das einen Uranbombensprengkopf oder Wasser-\nstoffbombensprengkopf besitzt,*\nDie Sowjetunion soil tiber Raketen von bis zu 1000 Kilo-\nmetern Reichweite verftlgen, zu denen demnSchst solche von l800 Kilo-\nmetern kommen, wenn sie nicht schon bereits existieren. Amerika soil\nschon tiber solche von bis zu 24OO Kilometern vReichweite verftlgen ,\nOb die sogenannten interkontinentalen, den Atlantischen\nOzean zu tlberfliegen vermogenden Rakete von fiber 8OOO Kilometer\nReichweite schon existieren, ist nicht ausgemachen. .'Anzunehmen ist,\ndass die Probleme ihre Herstellung Idsbar sind und dass man im Osten\nwie im Westen mit ihr beschSftigt.ist, wobei der Osten einen Vorsprung\nvor dem Westen zu besitzen scheint.\nObgleich es wohl noch keine interkontinentalen Raketenge¬\nschosse gibt mus Amerika doch schon darauf gefasst sein, dass im Falle\neines Atomkrieges seine Stadte vom Meere aus bis weit ins Innere hin-\nein durch von Unterseebooten auf sie entsandte Raketengeschosse ge-\ntroffen werden konnen.\nDie Raketen sausen mit einer ungeheuren Schnelligkeit\n? dahin. Die erwartete interkontinentale/soil, urn tiber den atlantischen\nOzean zu setzen, nicht einmal eine halbe Stunde brauchen und dabei\nNutzlasten von 1 bis 5 Tonnen befordern."
}