{
  "id": "d353-96",
  "text": "- 6 -\nNunmehr sind die bisher nicht vorhandene Voraussetzung\nftir einen zwischen Amerika und der Sowjetunion auf europ^ischem Boden\nmit Atomwaffen zu ftihrenden Landkrieg gegeben.\nVon Westdeutschland aus kann das Gebiet der Sowjetunion\ndurch ferngelenkte Mittelstreckenraketen bis zu 24oo Kilometer Reich-\nweite, bis Moskau und Kharkov hin beschossen werden. Die Mittel¬\nstreckenraketen, die die Ttirkei und Iran eventual zu ihrer Verteidi-\ngung gegen die Sowjetunion von Amerika annehmen wtirden, vermochten\nStadten der Sowjetunion bis weit ins Innere gefahrlich werden.\nSo kann sich die Sowjetunion in der Lage ftlhlen, ein gegen\nsie, auf Grund der Vorhandenseins von Raketengeschossen unternommenee\nSinkreisungsmanover abwehren zu miissen.\nDie strategische Michtigkeit des mittleren Orients bringt\nes mit sich, dass sowohl die Sowjetunion als auch nmerika sich dort\nVolker zu verpflichten suchen, indem sie ftlr sie eintreten, sie mit\nGeld untersttitzen und ihnen Waffen (vorerst gewohnliche) zukommen\nlassen. In alien dort entstehenden Streitereien treten sie offen ver-\nsteckt gegeneinander auf. So konnen Geschehnisse irn mittleren Orient\nftir das Weiterbestehen des Friedens verhSngnisvoll werden, Der Mitt-\nlere Orient hat die Rolle libernommen, die vor dem ersten Krieg der\nBalkan inne hatte.\nXXX\nDie durch das Aufkommen von atomaren Raketenwaffen ge-\nsteigerte Kriegs gefahr wird grosser noch dadurch, dass der ;.tomkrieg\nwohl kaum auf Grund einer Kriegserkl^rung von Seiten einer Atommacht\nstatthaben wird, sondern durch irgend ein Vorkommnis zufSllig zum\n.-usdruck kommen wird, Schuld daran ist die nunmehr dem Faktor Zeit\nzukommende Bedeutung,\nDer pldtzlich ..ngreifende wird sich dem Angegriffenen\ngegentiber in eimen Vorteil befinde, der ihn eine fast den Sieg be-\ndeutende Dberlegenheit verleiht. Er wird ihm ermoglichen, dem Gegner\ngleich zu i.nfang Verluste bei zu bringen, die dessen KampffShigkeit\nausserordentlich herabsetzen.\nSo ftihlt man sich htiben und drtiben genotigt, des Dberfalls\ntSglich und sttindlich gewftrtig zu sein, urn ihn durch eine augenblick-\nlich erfolgende kraftvolle /.bwehr soviel wie mdglich zu vereiteln."
}