{
  "id": "d353-98",
  "text": "ihm nicht verliehen. Seine Sntscheidung ist rasch. 3ie besitzt aber\nnicht die Gr.ttndlichkeit und die ZuverlSssigkeit des M.enschlichen,\nIfberdies ist das Elektronenhirn noch ganz davon abhSngig, dass in seinem,\nso komplizierten-Funktionieren alles bis ins Kleinste in bester Ord-\nnung ist.\nAn Mdglichkeiten, dass wir einmal durch irgend einen Zufall\nauf die blodeste Art in einem Atomkrieg hineinstolpern, fehlt es also\nnicht,\nXXX\nAuch eine andere, noch zu erwartende Verschlechterung unserer\nLege darf nicht ausser Betracht bleiben, Sie hat es mit der Tatsache\nzu tun, dass Amerika dazu fortgeschritten ist, Atomwaffen an andere\nVolker zu vergeben, Es vertraut sie solchen an, von denen es glaubt\nannehmen zu dtirfen, dass sie keinen eigenwilligen oder unvorsichtigen\nGebrauch davon machen. Den beiden anderen ritommachten steht es frei,\ndasselbe zu tun. b'er aber garnatiert,dass unter den so begltlckten\nVolkern nicht einmal auch unwUrdige sein werden, die, wenn sie in Be-\nsit.2 solcher Waffen gelangt sind, damit machen, was ihnen gut dtinkt ,\nohne sich urn die Folgen zu ktimmern ? Wer kann sie daran hindern ?\nWer kan sie bewegen, auf den Gebrauch ihrer Atomwaffen zu verzichten,\nwenn die verntinftig gewordenen Volker den Beschluss gefasst haben\nv/erden, dies miteinander zu tun ?\nDer Damm hat ein Loch bekommen. Nun heisst es wachen, dass\ndies nicht einen Dammbruch zur Folge hat,\nDass Sorgen dieser Art zum Greifen nahe liegen, ergiebt\nsich aus der Erkiarung, die die 9^35 Wissenschaftler am 13. Januar\n1958 der U N 0 in Sachen des Aufhdrens der Versuchsexplosionen zugehen\nliessen. In ihr figuriert der Satz: ^’So lange die Atomwaffen in den\nHSnden der drei GrossmMchte sind, ist ein i.bkommen tiber ihre Kontrolle\nmoglich. Wenn die Versuche weitergehen und den Besitz dieser Waffen\nsich auf andere Regierungen ausdehnt, ist das Risiko des durch die\nTat eines verantwortungslos Machthabers verursachten Ausbruch eines\n..tomkrieges viel grosser.\nIn jeder Hinsicht ast also die Gefahr eines kommenden\nAtomkrieges so gross, dass eine dringende Notwendigkeit des Verzichtes\nauf Atomwaffen besteht.\nXXX"
}