{
  "id": "d492-1",
  "text": "-2-\nSCHNEIDER:\nRICHTER:\nSCHNEIBER:\nto Chicago, Kansas City, Los Angeles and San Francisco.\nEverywhere we went we carried with us a tape-recorder\nAND A LIBERAL SUPPLY OF RECORDING TAPE. DURING THE\nCOURSE OF THESE TRAVELS, WE COLLECTED INTERVIEWS WITH\nMORE THAN A HUNDRED PERS0NS. . . C0LLEGE PROFESSORS, JOURN¬\nALISTS, PUBLIC FIGURES, AUTHORS, PROFESSIONAL SOCIAL\nWORKERS. All of these people had one thing in common...\nAN INTEREST IN WHAT MANY PEOPLE FEEL IS THE SOCIAL PROB¬\nLEM OF THE CENTURY . . . THE PROBLEM OF RACE RELATIONS.\nDuring the weeks to come, we will have the opportunity\nOF LISTENING TO A GREAT DIVERSITY OF COMMENTS FROM MANY\nOF THE PEOPLE WHOM WE HAVE INTERVIEWED AS WE EXPLORED\nTHE WORLD OF \"THE LAST CITIZEN”. OUR PURPOSE IS TO TRY\nTO GIVE A3 OBJECTIVE AS POSSIBLE A PICTURE OF AMERICAN\nLIFE AS IT AFFECTS THE NEGRO IN THIS COUNTRY. AND TO\nHELP US IN THIS TASK WE ARE VERY FORTUNATE TO HAVE Qr.\nLouis Schneider, Professor of Sociology at Purdue Uni¬\nversity, WHO HAS HAD A LONG STANDING INTEREST IN OUR\nSUBJECT.\nI THINK IT MIGHT BE WELL TO MENTION WHY WE SELECTED THE\nTITLE THAT WE DID FOR OUR SERIES, WALT...THB LAST ClTlZE\n’ ■“ FHL~ THAT. | .. \"\nWell, we felt that, in a way, the Negro can be looked on\nAS OUR LAST IMMIGRANT. BECAUSE, DESPITE THE FACT THAT\nHE'S BEEN WITH US FOR MORE THAN THREE HUNDRED YEARS HE\nIS STILL FACING MANY OF THE PROBLEMS FACED AND LARGELY\nRESOLVED BY EUROPEAN IMMIGRANTS WHO ARRIVED MUCH MORE\nRECENTLY ., .HE IS STILL FIGHTING THE BATTLE WHICH WAS\nWON LONG AGO BY EVEN OUR MOST RECENT I MM I GRANTS . . .THE\nBATTLE FOR FIRST CLASS CITIZENSHIP. AND THIS IS ESPECIA¬\nLLY REMARKABLE SINCE NEGRO MIGRATION TO THE UNITED STATE'\nENDED MORE THAN ONE HUNDRED YEARS AGO, WHEN THE STATUTES\nFORBIDDING THE IMPORTATION OF SLAVES WERE FINALLY EN¬\nFORCED. And so, we speak of him as our \"Last Citizen\nOne out of every ten citizen© of this country is class¬\nified as a Negro. But who is he, this tenth man...this\nAmerican Negro...this ”Last Citizen”? As in describing\nANY INDIVIDUAL THERE ARE MANY ANSWERS TO THIS QUESTION,\nSO IT IS WITH THE NEGRO. PERHAPS THE SIMPLEST REPLY IS\nTHAT HE IS A DARK-SKINNED AMERICAN OF AFRICAN ANCESTRY.\nBut this is only a fragmentary answer. With the aid of\nDr. Schneider, let's explore other possible answers.\nThe Negro is the unknown man. Many of us are still rel¬\natively POORLY INFORMED ABOUT HIS MODE OF LIFE, HIS\nASP I RAT I ONS. . .OR EVEN THE NATURE OF HIS STATUS IN AMER¬\nICA. T HE WALL OF SEGREGATION ITSELF, JUST BECAUSE OF\nWHAT SEGREGATION IS, MEANS THAT IN MANY AREAS OF THE"
}