{
  "id": "d492-101",
  "text": "-9-\nRICHTER:\nSCHNEIDER:\nFABRIC TO WEAVE WHITES AND NEGROES TOGETHER. WHAT I ’\ntalking about is really a problem of bringing Negroes\nAND WHITES WITHIN THE SCOPE OF ONE GENERAL CIVILIZA-\nTION OR SOCIETY.\nThis is another problem that sounds as though it won’\nBE SOLVED OVERNIGHT. 3UT, LET’S RETURN FOR A BIT TO\nSOME OF THE THINGS WE WERE SPEAKING ABOUT EARLIER IN\nTHE PROGRAM. THE INTERNATIONAL MIGRATIONS WITH WHICH\nWE BEGAN....THE MIGRATIONS FROM EUROPE TO AMERICA OF\nIrish, Germans, Scandinavians, English, Poles, Ital¬\nians, AND OTHERS, AFTER ALL, LANDED VAST NUMBERS OF\nPEOPLE OF THESE NATIONALITIES IN OUR LARGER URBAN\nCENTERS ALSO. I T ’ S ALL VERY WELL TO SAY, AS WE’VE\nDONE, THAT THE NEGRO IS THE LAST MIGRANT. But I TAKE\nIT THAT THERE ARE SPECIAL FEATURES OF HIS MOVEMENT TO\nAND RESIDENCE IN, THE LARGE CITIES THAT DISTINGUISH\nHISSITUATION FROM THAT OF THE OLDER MIGRANTS, WHO MUS\nHAVE BEGUN WITH A SITUATION MUCH LIKE THE NEGRO’S.\nYes, certainly they did. But these older migrants\nLACKED WHAT ONE OF THE OLD-TIME CHICAGO SOCIOLOGISTS,\nRobert £. Park, called '’high visibility.1’ At least\nTHEY LACKED THE NEGRO’S HIGH VISIBILITY. WHEN I WAS\nDISCUSSING THE NEGRO MIGRATION MATTER IN THE PERSPEC¬\nTIVE of the Old and New Migration, I might h^ve ind¬\nicated THAT, AS THE CHICAGO SOCIOLOGISTS OF A GENERA¬\nTION AGO ALREADY KNEW VERY WELL, THERE IS SOMETHING\nTHAT IS QUITE DISTINCTIVE ABOUT THE NEGRO MIGRATION,\nWHICH I MIGHT PUT IN THIS WAY; WHEN OLDER MIGRANTS\nCAME | N--OLDER THAN THE NEGRO THAT IS—CAME INTO THE\nCENTERS OF OUR LARGE CITIES, JUST OUTSIDE THE FACTORY\nDISTRICTS-WHERE THEIR HOUSING WAS POOR, THEY WERE\nA 3 LE TO MOVE IN TIME. It MIGHT PERHAPS TAKE A COUPLE\nOF GENERATIONS, MAYBE THREE GENERATIONS EVEN, OR FOUt\nFOR, LET’S SAY, A TYPICAL POLISH FAMILY TO MOVE FROM\nJUST OUTSIDE THE LOOP IN CHICAGO TO ONE OF THE SUBUR¬\nBAN AREAS, WITH PERHAPS A COMPLETE NAME CHANGE AT THE\nEND OF THE PROCESS, AND VERY CONSIDERABLE INCREASE OF\nINCOME ON THE PART OF THE LATEST MEMBER OF THE PARTI¬\nCULAR Polish family, but. the point is that the white\nDID MOVE OUT. THEY VERY DEFINITELY TENDED TO MOVE\nOUT, AND THEY COULD MOVE OUT. ^ND THEIR NATIONAL\nORIGIN WAS — SHALL I PUT THIS SOMEWHAT ARCHLY? — THEIR\nNATIONAL WAS, IN MANY WAYS, FORGIVEN THEM. It WASN’T\nHELD AGAINST THEM TOO MUCH. ThEY SIMPLY MOVED OUT,\nTHEN, WITHOUT ANY OVERWHELMINGLY ANTAGONISTIC IDENTI¬\nFICATION OF THEM BY OTHERS, AS POLES, IRISH, GREEKS,\nand so on. But the Negro was not capable of doing\nTHIS, AND IS NOT CAPABLE OF DOING IT TODAY. ThE\nNEGRO HAS THE PARTICULAR PIGMENTATION HE HAS, AND TH>\nIS AN IDENTIFYING MARK HE DOES NOT READILY LOSE, AND\nIS UNDOUBTEDLY ONE OF THE THINGS OF TREMENDOUS IMPOR'"
}