{
  "id": "d492-102",
  "text": "-10-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nance that have tended to keep him where he often\nORIGINALLY LANDS....IN THE BLACK BELTS OF OUR LARGER\ncities. This doesn’t mean that the Negro doesn’t\nmove AT all. It doesn’t mean that he moves only\nTHROUGH THE EXPANSION OF THE BLACK BELTS. HE MAY\nTAKE IT ON HIMSELF TO MOVE, NOT WITH THE MASS PRESS¬\nING ON THE EDGES OF THE BLACK BELTS, BUT ON OTHER\nlines. However, there are black blocks everywhere.\nYet, wherever the Negro moves, he has to weave in\nand’out among different segregated areas in cities\nAND SUBURBS.\nDy the way, is it true that the earleer migrants live\nUNDER MORE OR LESS THE SAME SLUM CONDITIONS WHICH THE\nNegro now experiences in the centers of the bigger\ncities, and weren’t charges levelled against the\nolder European migrants that are levelled against thl\nNegro today? Ch rges of slovenliness, disease, and\nUNDESIRED SOCIAL QUALITIES IN GENERAL?\nI THINK IT’S QUITE ACCURATE TO ANSWER THE QUESTION 1\nTHE AFFIRMATIVE. I MENTIONED ROBERT E. PARKS BEFORE\nAND I MIGHT RECALL THAT AN OLDER GENERATION OF ChIC/\nSOCIAL SCIENTISTS PRODUCED A NUMBE OF RATHER VIVID\nWORKS ABOUT THEIR CITY, MAKING POINTS THAT HAVE A\nCERTAIN RELEVANCE TO THE CASE OF THE NEGRO TODAY.\nThe Chicago sociologists noted the tendency of new\nIMMIGRANT GROUPS TO CONCENTRATE JUST OUTSIDE THE\nFACTORY AREA OF THE CITY,...0UTSIDE THE LOOP, IN THE\ncase of Chicago. They used to remark the high indi-\nDENCE OF VARIOUS SO-CALLED PATHOLOGIES JUST OUTSIDE\nthe Loop area....pathologies exemplified by high sui\nCIDE RATES, HIGH RATES OF CERTAIN KINDS OF MENTAL\nillness, and so on. Successively, as various immi¬\ngrant GROUPS MOVED OUT FROM THE CENTER OF THE CITY..\nPoles or Greeks, or Irish, or whoever it might be,\nTHEY DID NOT CARRY THE HIGH RATES WITH THEM. The\nHIGH RATES CHARACTERIZED THE AREA AND NOT THE PEOPL-\nTHIS SUGGESTS THAT IF THE NEGRO ENJOYED THE SAME\nRELATIVE EASE IN MOVING OUT AND OBTAINING HIGHER\nINCOME, BETTER JOB SITUATIONS, BETTER RESIDENCES,\nMORE ELEVATED STATUS, HIS EXPERIENCE WOULD DUPLICATE\nTHAT OF THE EARLIER IMMIGRANT GROUPS. ONCE AGAIN,\nthe Negro’s movement is decidedly more restricted a;\nDIFFICULT, AND TO THE EXTENT THAT THIS IS SO, THE\nNegro is simply not given the chance to demonstrate\nthat in his case, too, the pathologies may NOT BE\nPROPER TO THE PEOPLE, BUT TO A CERTAIN TYPE OF LI V1\nARE A .\nI NOTICE AN INTERESTING THING, LOU, ABOUT THE PROB¬\nLEMS WE’VE BEEN DISCUSSING FOR THE PAST TEN OR FIF¬\nTEEN MINUTES. V’J E ’ V E MENTIONED THIS MATTER OF HIGHE'"
}