{
  "id": "d492-103",
  "text": "SCHNEIDER:\nRICHTER:\nSCHNEIDER :\nRICHTER:\nSCHNEIDER:\nRICHTER:\nINCOME AND LESS PREJUDICED WHITES MOVING TO THE\nSUBURBS, LEAVING LOWER INCOME AND MORE PREJUDICED\nWHITES IN THE C|TY. -E’VE STRESSED THE ISOLATION OF\nNegroes from whites, and along with that the absence\nof a social fabric binding whites and Negroes togeth\nWITHIN THE SAME GENERAL CIVILIZATION OR SOCIETY.\nV'/E1 VE JUST NOW STRESSED THAT THIS MATTER OF THE PATH\nOLOGY OF THE AREA HAS SOME APPLICATION TO THE CASE C\nTHE PRESENT DAY NEGRO. Now, IT SEEMS TO ME THAT ONE\nCOULD EASILY BECOME QUITE PESSIMISTIC ABOUT THE ENTI\nPICTURE WE’VE PAINTED TODAY. THESE DON’T LOOK LIKE\nPROBLEMS THAT ARE EASY TO RESOLVE. ThEY HAVE TO DO\nWITH MAJOR FORCES AND CHANGES IN OUR SOCIETY. ^OW\nIS ONE TO RESOLVE THEM?\nThe point is extremely well taken, a/alt. I wish I\nCOULD DISCUSS IT IN DETAIL. I CAN MAKE TWO GENERAL\ncomments, however. One is that these and other pro::\nLEMS OF SOCIAL POLICY. THEY CAN’T BE READILY RESOLV\nBY INDIVIDUAL GOOD WILL, ALTHOUGH INDIVIDUAL GOOD\nWILL WILL NEVER HURT. ThEY REQUIRE GOME DEGREE OF\nPLANNING, THEY REQUIRE POLITICAL ACTION, THEY REQUIR\nATTENTION PRECISELY TO SOME OF THE MAJOR REALITIES C\nOUR PRESENT DAY AMERICAN SOCIETY. THEY REQUIRE IMA¬\nGINATION, AND SKILL, AND COURAGE. THE OTHER COMMEN\nOF A GENERAL NATURE THAT I WOULD LIKE TO MAKE IS TH\nAS WE BEGIN TO PENETRATE THESE THINGS AND UNDERSTAND\nTHEM BETTER, THE P R 03 LEM S THAT THEY PRESENT MAY GET\nTO APPEAR SIMPLER. It MAY BE, FOR EXAMPLE, THAT THE\nINTERDEPENDENT-SPIRAL PHENOMENON TO WHICH WE’VE\nREFERRED BEFORE WILL 3E ILLUMINATING AND APPLICABLE\nIN MORE WAYS THAN WE NOW REALIZE.\n*N OTHER WORDS, SOME OF THE ELEMENTS IN THE URBAN\nSITUATION AND URBAN PROBLEMS, WHEN WORKED ON IN A\nCERTAIN WAY, MAY f’P U L L UP1’ OTHER ELEMENTS AND AFFECT\nAN ALL-AROUND BENEFICIAL CHANGE WITHOUT OUR HAVING\nTO SWEAT OUT EVERY SINGLE DIFFICULT PROBLEM ON ITS\nOWN GROUND, AND EXCLUSIVELY ON ITS OWN TERMS. AND\nWE MAY GET TO SEE THAT THIS KIND OF THING HAS EVEN\nLARGER SCOPE THAN WE NOW BELIEVE.\nYes, THAT IS THE SORT OF THING I HAD IN MIND.\nIt IS REASONABLE, THEN, TO SAY THAT THOUGH THESE\nMATTERS WE’VE BEEN DISCUSSING TODAY PRESENT THORNY\nQUESTIONS, YOU’RE NOT READY TO YIELD TO PESSIMISM?\nIT IS REASONABLE.\nOn that note let us end our discussion of migration\nAND URBANIZATION OF THE NEGRO, AND BE PREPARED TO\nMOVE INTO OTHER AREAS IN FOLLOWING PROGRAMS. NeXT"
}