{
  "id": "d492-105",
  "text": "THE LAST CITIZEN\nProgram 7^I 0\n\"The City \" Part 2\n(Negro Labor)\nL0G'\\N :\nToday the outlook of the Negro worker is consider¬\nably brighter than it was at the beginning of this\nCENTURY.\nSOBEL:\n. . .AND BY HOLDING THE NEGRO DOWN INTO UNSKILLED\nAREAS, WE ARE RAPIDLY, IN MANY MAJOR AREAS, RENDER IN\nthe Negro unemployable, or at best employable on onl\na CASUAL, but not a permanent basis.\nMUSIC:\nSTINGER\nANNCR :\nThese are a few of the comments you will hear during\nTHE NEXT HALF HOUR AS WE EXPLORE THE SITUATION OF TH\nNegro worker in \"The City,'* in discussing \"The Last\nC1T1 ZEN .\"\nivlUS I.C.:\nSTINGER\n\\NNCR:\nThe Laxst Citizen: The Negro in America. A series 0\nprograms devoted to the extension of our knowledge c\nTHE LARGEST MINORITY GROUP IN THE UNITED STATES, ITS\nPROBLEMS, AND PROBLEMS IT POSES TO ALL AmE 1 CANS.\nThe Last Citizen is produced by Radio Station W3AA,\nPurdue University, under a grant from the Education/,\nTelevision and Radio Center, in cooperation with the\nNational Association of Educational Broadcasters.\nThe discussants are the Producer of the Series, E.\nRichter, and Dr. Louis Schneider, Professor of Soci¬\nology at Purdue University. Today’s program: \"The\nCity and the Worker.\"\nRICHTER:\nOne of the points we have continually stressed\nthroughout our series has been the interdependence c\nTHE VARIOUS FACETS OF THE SOCIAL LIFE OF THE NEGRO.\nWe KNOW, FOR EXAMPLE, THAT THE NEGRO’S HOUSING, HIS\nEDUCATION, HIS INCOME, HIS POLITICAL ASPIRATIONS ARE\nAFFECTED BY HIS EMPLOYMENT 0PP0RTUN1T1ES....JUST AS\nALL THESE THINGS AFFECT ONE ANOTHER. TODAY WE TAKE\nUP THE QUESTION OF NEGRO EMPLOYMENT,.,.A CRUCIAL\nFACTOR IN THE INTERRELATED FACTORS THAT SET THE\nNegro’s conditions of life.\nSCHNEIDER:\n1 WOULD SUGGEST, Wa LT , that we TREAT THIS CONSIDER¬\nABLE TOPIC BY TOUCHING ON SEVERAL MAIN THINGS. A\nBRIEF HISTORICAL INTRODUCTION TO THE SITUATION OF\nTHE PRESENT-DAY NEGRO WORKER WOULD BE A USEFUL THING\nThen, 1 think, it would be a good idea to turn to ti"
}