{
  "id": "d492-107",
  "text": "-3-\nRailway Brotherhoods, would not permit Negroes to\nENTER UNDER ANY CIRCUMSTANCES. ONE OR TWO, LIKE THE\nStevedores, even in New Orleans, had mixed, or what\nWE TODAY CALL INTERGRATED, UNIONS. A FEW LIKE THE '\nCARPENTERS, THE PAPERHANGERS, AND THE LIKE, ORGANIZE\nNegroes in separate trade unions. But again at the\nBEGINNING OF THIS CENTURY, LABOR ITSELF WAS NOT\nSTRONG-POLI T ICALLY OR ECONOMICALLY OR AS A PRESSURE\nGROUP .\nToday the outlook of the Negro worker is conside\nA 3 L Y BRIGHTER THAN IT WAS AT THE BEGINNING OF THIS\nCENTURY. NOW, TWO OF THE PRINCIPLE REASONS FOR THIS\nIMPROVED OUTLOOK OF NEGRO WORKERS, WHETHER HE BE IN\nORGANIZED UNIONS OR NOT, ARE THE CONSEQUENCES OF THE\nFirst andSecond World Tar. Perhaps a million Negroe\nMOVED FROM THE SOUTH ATLANTIC STATES, PARTICULARLY,\nINTO THE INDUSTRIAL CITIES OF THE NORTH. LARGE\nNUMBERS MOVED FROM RURAL AREAS IN THE SOUTH TO URBA'\nareas. Their conditions of living were generally\nBETTER THAN THEY HAD BEEN IN THEIR PREVIOUS HOMES.\nDuring world War H I and afterwards, perhaps another\nMILLION MOVED, THIS TIME PARTICULARLY FROM THE\nSouthwestern states up along the Pacific Coast.\nAlready in 1935 there had been organized the Congreo\nof Industrial Organizations, the CIO. For various\nREASON THE CIO WAS MORE LIBERAL IN ITS MEMBERSHIP\nPOLICY THAN WAS THE AMERICAN FEDERATION OF LABOR EVE\nAT THAT TIME. AS THE CIO INCREASED IN NUMBER AND IN\nPOWER BECAUSE OF THE LARGE NUMBER OF WOMEN WORKERS\nand Negro workers, the A F of L began to liberalize\nITS POLICIES.\nOn June 25, 1941, President Roosevelt issued\nHIS FAMOUS EXECUTIVE ORDER, 8302, DESIGNED TO PRO¬\nHIBIT DISCRIMINATION IN THE WAR INDUSTRIES ON ACCOU;\nOF RACE, COLOR, RELIGION, OR NATIONAL ORIGIN. TraD\nUNIONS THEMSELVES BEGAN TO TAKE A MORE LIBERAL\nATTITUDE TOWARD NEGRO WORKERS. THEN, JUMPING DOWN\nTO A PERIOD OF JUST ABOUT THREE YEARS AGO, THESE TW\nGIANT FEDERATIONS, THE AMERICAN FEDERATION OF LABOR-\nand the Congress of Industrial Organizations, merge\nOne of their first objectives was to increase membe\nSHIP FROM FIFTEEN MILLION TO THIRTY MILLION. THAT\nOBJECTIVE HAS NOT BEEN ACHIEVED LARGELY BECAUSE OF\nADAMANT OPPOSITION ON THE PART OF WHITE WORKERS,\nINCLUDING SOME IN THE TRADE UNIONS IN THE SOUTHERN\nSTATES. ON THE WHOLE, HOWEVER, ONE MAY SAY THAT\nmore Negro workers today, absolutely and comparative\nLY, HAVE BETTER JOBS, AT HIGHER SALARIES, WITH BETTE\nOPPORTUNITIES FOR PROMOTION, THAN THEY HAD EVEN\nBEFORE THE OUTBREAK OF iORLD WAR II, AND THERE ARE\nTHOSE WHO BELIEVE THAT THE NEGRO WORKER WILL CONTIN\nTO IMPROVE HIS POSITION."
}