{
  "id": "d492-108",
  "text": "-4-\nSCHNEIDER:\nRICHTER:\nOr. Logan ends on a rather optimistic note, althougi\nHIS ENTIRE STATEMENT IS SUCH AS TO SUGGEST SOME\nMISGIVINGS ABOUT THE GENERAL EMPLOYMENT SITUATION 0\nthe Negro. In fact, at present and taking into\nACCOUNT THE SITUATION THAT HAS PREVAILED SINCE THE\nend of World War II, there is a good deal of evidenc\nto show that very serious problems attend the whole\nQUESTION OF NEGRO EMPLOYMENT. LET ME GIVE ONE SOME'\nWHAT ARBITRARY, BUT I THINK SIGNIFICANT,EXAMPLE OF\nTHE KIND OF THING I MEAN. I TURN TO A FEW FIGURES\nfrom the San Francisco-Oakland standard metropclitai\nAREA IN 1950 - FIGURES RECENT ENOUGH FOR OUR PURPOSE\nTODAY. I USE DATA COMING FROM THE U. S. CENSUS. If'\nTHIS EXTREMELY IMPORTANT WEST COAST AREA, OF TOTAL\nEMPLOYED MALE WORKERS (MINORITY AND NON-MINORITY) U\n1950, 10.7$ WERE IN PROFESSIONAL, TECHNICAL, AND\nkindred jobs, but only 2.1$ of Negro workers had sue\njobs. Again, 13.9$ of the total employed male\nworkers were non-farm managers, proprietors and\nOFFICIALS, BUT ONLY 2.6$ OF THE NEGRO WORKERS WERE\nOCCUPIED. On THE OTHER HAND, 8.4/0 OF the total male\nWORKERS WERE LABORERS (EXCEPT ON FARMS AND IN MINES\nWHILE 36$ OF THE NEGRO WORKERS WERE LABORERS. It*S\nINTERESTING, ALSO, THAT FOREIGN-BORN MEXICANS HAD A\nJOB DISTRIBUTION PATTERN SOMEWHAT LIKE THAT OF NeGR\nFlLlPINOES ALSO HAD VERY LOW REPRESENTATION IN THE\nBETTER JOBS?? AND WERE HEAVILY EMPLOYED AS SERVICE\nworkers. Chinese were likewise heavily employed as\nSERVICE WORKERS, BUT THEY WERE STRONGLY REPRESENTED\nIN THE CATEGORY OF MANAGERS, OFFICIALS, AND PROPRI¬\nETORS, AND WERE THREE TIMES AS WELL REPRESENTED AS\nNegroes in the category of professional, technical\nAND KINDRED WORKERS. NOW, OF COURSE, SOME OF THESE\nTHINGS REFLECT «*EST Co.ST PECULIARITIES. It WOULD\nBE INTERESTING TO TURN ASIDE AND LOOK INTO THEM IN\nDETAIL. BUT THE MAIN THING FOR US TO NOTICE IS THE\nSPECIAL SITUATION OF THE i^EGRO BY COMPARISON WITH\nTHAT OF THE TOTAL EMPLOYED POPULATION. NOTICE A G A I\nNegroes were only 1/5 as well represented as the\nTOTAL POPULATION IN THE HIGH LEVEL PROFESSIONAL AND\nRELATED JOBS. THE WERE 1/5 AS WELL REPRESENTED IN\nTHE CATEGORY OF MANAGERS, PROPRIETORS, AND OFFICIAL\nThey were more than four times as ’’well'* represente\nIN THE CATEGORY OF LABORERS. No MATTER HOW FAR FRO\nFINAL, FOR CERTAIN PURPOSES, THE STORY THAT FIGURES\nLIKE THESE MAY TELL US, THE FIGURES THEMSELVES YET\nARE, ONE MIGHT SAY, MOST ELOQUENT.\nThat is a significant set-up in a local area. Now,\nlfD LIKE TO ARRANGE WHAT PHOTOGRAPHERS CALL A BLOW¬\nUP. 1 BELIEVE THE SITUATION YOU’VE DESCRIBED IS\nGENERA LIZAOLE. Let’s GET IN SOME OF THE DIMENSIONS\nOF THE LARGER PICTURE. IN THE SUMMER OF 1958, Or.\nIrwin Sobel, economist at Washington University, in"
}