{
  "id": "d492-109",
  "text": "-5-\nSOBEL:\nSCHNEIDER:\nSt. Louis, Missouri, made the follwcing comments to\nthe annual Institute of Race Relations at Fisk\nUniversity.\nNow although the Negro has made advances in the last\nFIFTEEN TO TWENTY YEARS SINCE L.rlO WAR ||} it MUST\nOE REMEMBERED THAT THE ENTIRE WHITE POPULATION HAS\nBEEN UPGRADED CONSIDERABLY. IN OTHER WORDS, IF WE\nTAKE OUR CENSUS CLASSIFICATIONS WE’LL SEE THAT THERE\nHAS BEEN A TREMENDOUS MOVEMENT OUT OF THE UNSKILLED\nAREAS EVEN A TREMENDOUS UPGRADING AT ALL LEVELS INTO\nTHE SO-CALLED HIGHER OCCUPATIONAL BREAKDOWNS. Now,\nIF WE COMPARE THE NEGRO IN A VACUUM, WE CAN SAY THAT\nTHERE HAVE BEEN SUBSTANTIAL ADVANCES. If WE COMPARE\nthe Negro to the White advances, then, at best, the\nNegro is holding his own. ^nd he is still in the maj\nCONCENTRATED, ABOUT SEVEN OUT OF TEN NEGROES, ARE\nCONCENTRATED IN THE LAST TWO OR THREE OCCUPATIONAL\nBREAKDOWNS AS OPPOSED TO LESS THAN TWO OUT OF TEN\nWhites in these particular areas. \\nd the great dang\nOF THIS DEVELOPMENT IS THIS! THAT THE UNSKILLED LABOR\nAND THE UNSKILLED LABORER IS INCREASINGLY BECOMING AN\nUNSALABLE COMMODITY IN THE AMERICAN BY HOLDING THE\nNegro down into the unskilled areas we are rapidly, i\nMANY MAJOR AREAS, RENDERING THE NEGRO UNEMPLOYABLE,\nOR AT BEST EMPLOYABLE ON ONLY A CASUAL, BUT NOT A\nPERMANENT, BASIS.\nThe Negro is still the first fired and the last\nHIRED AND I INDICATE TO MY STUDENTS THAT RATHER THAN\nATTEMPT TO DEVISE ELABORATE BAROMETERS OF THE LEVEL\nOF BUSINESS ACTIVITY AND TRYING TO FORECAST TRENDS\nJUST WATCH WHAT IS HAPPENING TO THE EMPLOYMENT OF\nNegroes, and you'll find that three or four months\nbefore we are aware of any general downturn, employ¬\nment of Negroes already has started to turn down.\nIncidentally, the unemployment rate of Negroes even\nIN THE PROSPEROUS PERIOD (’55, '56 TO JUNE ’57) WAS\nAT ALL TIMES A LEVEL OF EIGHT PERCENT HIGHER THAN THE\nWhite unemployment rate; today in the recession about\nSIX AND A HALF TIMES PERCENT. So THAT NEGROES, EVEN\nIN PROSPEROUS TIMES, EXPERIENCE A LEVEL OF UNEMPLOY¬\nMENT THAT BY OUR OWN BUREAU OF LABOR STATISTICS SEEMfe\nCRITICAL. .NY AREA WITH OVER SIX PERCENT UNEMPLOYMEN\nIS AN AREA OF LABOR SURPLUS AND OVER El GMT PERCENT\nWOULD PUT THEM INTO THE SUBSTANTIAL LABOR SURPLUS ARE\nSo, IN THAT CONTEXT, MINORITY GROUPS SUFFER PERMANENT\nRECESS I ON.\n>S LONG AS WE’RE ENGAGING IN THE PHOTOGRAPHIC PROCESS\nOF <T BLOWING UP,;f I’D LIKE TO ADD THAT THE FIGURES FOR\nSan Francisco which I gave before, were really not\nSERIOUSLY OUT OF LINE WITH THE FIGURES FOR THE WHOLE\nNATION. ...AGA IN ACCORDING TO 19 50 CENSUS DATA. THUS,"
}