{
  "id": "d492-114",
  "text": "THE l 'ST CITIZEN\nProgram I I\n\"The City, Part 3\"\n’\\ Place to Live\nBUgGS :\n1 don’t think there’s any question but what housing\nIS THE GREAT UNSOLVED PROBLEM AS IT RELATES TO THE\nNegro .\nHOTDEN :\nBut there are certain institutionalized practices in\nPRIVATE HOUSING WHICH STILL CONSTITUTE BIG BARRIERS.\nJONES:\nThat a' Negro family moves into an all-White neighbor\nHOOD DOESN’T NECESSARILY MEAN THAT VALUES ARE GOING\nTO GO DOWN AND PRICES ARE GOING TO BE DEPRESSED.\nEICHLER:\n• THINK ONE OF THE REASONS FOR THE....AND 1 MIGHT\nMODESTLY CALL IT A SUCCESS OF OUR METHOD IN DEALING\nwTTH M1 NORfTY* GROUPS,! IS THAT WE TREAT EACH INDIV1DU\nTHAT COMES IN TO BUY A HOUSE IN A SORT OF A MATTER 0\nFACT OR A MATTER OF COURSE MANNER .\nMUSIC:\nSTINGER\nANNCRt\nYou HAVE JUST HEARD EXCERPTS FROM COMMENTS YOU WILL\nHEAR AS THE QUESTION OF HOUSING IS TAKEN UP IN THE\ndiscussion of \"The Last Citizen.\"\nMUSIC:\nSTINGER\nTNNCR :\nThe Last Citizen: The Negro in mmerica. ' series c\nPROGRAMS DEVOTED TO THE EXTENSION OF OUR KNOWLEDGE C\nTHE LARGEST MINORITY GROUP IN THE UNITED STATES, ITS\nPROBLEMS, AND THE PROBLEMS IT POSES TO ALL AMERICANS\nThe Last Citizen is produced by Radio Station JB^a,\nPurdue University, under a grant from the Education/\nTelevision and Radio Center, in cooperation with the\nNational Association of Educational Broadcasters. T\ndiscussants are the Producer of the Series, l# >V.\nRichter, and Or. Louis Schneider, Professor of Soci¬\nology at Purdue University. Today’s program: \"The\nCity, A Place to Live. Here now, is Mr. Richter.\nRICHTER:\nA CENTRAL PROBLEM THE NeGRC FACES IN THE CITY IS\nTHAT OF HOUSING. THE USUAL PROBLEMS OF DISCRIMINAT’\nAND SEGREGATION APPEAR IN THE FIELD CF HOUSING, BUT\nHOUSING FOR THE N EGR 0 . .D.OE S ' fl A VE SPECIAL AS-\npects. Let’s start by reminding ourselves that sinc\n1914 THERE HAS BEEN A GREAT IN-MIGRATION OF NEGROES\nINTO OUR LARGER CITIES, AND THIS AGAIN PROVIDES US\nWITH A SIGNIFICANT BACKGROUND FOR DISCUSSION."
}