{
  "id": "d492-115",
  "text": "SCHNEIDER:\nRICHTER:\nBUGGS:\n-2-\nI THINK WE’RE PRETTY WELL ACQUAINTED WITH THE GENER.\nCITYWARD MOVEMENT OF THE N£GRv, «ND WE’VE DISCUSSED\nLEAST SOMETHING OF WHAT THAT MOVEMENT MEANS. R|GHT\nNOW, PERHAPS, AS WE GO INTO THE AREA OF HOUSING, WE\nMIGHT SIMPLY DEAR IN MIND SOME OF THE DETA I LS--S0ME -\nTHE NUMERICAL DETAILS OF THE N EGRO’S MOVEMENT TOWAR\nTHE DIGGER CITIES. LET ME CITE A FEW CENSUS FIGURES\nCONFINING MYSELF TO THE DECADE OF 1940 TO 1950. IN\n1940 Chicago had a non-White population of over\n280,000, and, as usual, non-:'hite overwhelmingly mea\nNegro, a decade later, in 1950, the city had a non-\nWhite population of over 500,000. Corresponding\nfigures for Detroit are about 150,000 for 1940 and\nsomewhat over 300,000 for 1950. -nd Washington, l).C\nrises from under 200,000 to nearly 300,000... . so tha-\nyou have approximately 50$ increases of the non-whit\nPOPULATION IN THESE LAST TWO IMPORTANT CITIES. LITT\nAlameda, California, almost quintupled its non-White\npopulation in the decade, 1940 to 1950, and dig Los\nAngeles more than doubled its non-White population.\nSigns of the times, no doubt, for here we see in a\nparticular sphere, that of sheer population increase\nTHE INCREASING TENDENCY FOR THE WEST COAST CITIES TO\nBE AFFECTED BY THE NATION’S OUTSTANDING MINORITY\nPR OBLEM.\nWell, since you stress non-White population on the\nWest Coast, let’s listen for a few moments to Mr.\nJohn Buggs, Executive Secretary of the Los Angeles\nCommittee on Human Relations. Speaking against the\nbackground of experience in lies Angeles, Mr. Buggs\nHAS THE FOLLOWING TO SAY.\nI don’t think there’s any question but what HOUSING\nTHE GREAT UNSOLVED PROBLEM AS IT RELATES TO THE NEGR\nI HAVE A FEW STATISTICS THAT WOULD PROBABLY BE VERY\nINTERESTING TO YOU. RECENTLY, THE LCS * NGE LE S C|TY\nPlanning Commission released a set of statistics wit\nRELATION TO THE INCREASE IN POPULATION IN CERTAIN\nCOMMUNITIES IN THE CITY OF LOS mNGELES, AND AT THE\nSAME TIME THEY RELEASED STATISTICS WITH RESPECT TO T\nINCREASE IN HOUSING IN THOSE SAME AREAS’* IN THOSE\nAREAS IN THE COUNTY, IN THE CITY, RATHER, THAT HAVE\nA HIGH CONCENTRATION OF MINORITY GROUP PEOPLES, PART\ncularly Negroes and Mexican-Wmericans living in them\nWE DISCOVER THAT THE RATIO OF NEW PEOPLE—NET INC RE A,\n--TO NEW HOUSING BETWEEN FEBRUARY OF 1956 AND OcTCBE\nOF 1957, WERE AS FOLLOWS*. IN ONE COMMUNITY 12 ADDI¬\nTIONAL PEOPLE FOR EVERY ADDITIONAL HOUSE MADE AVAIL¬\nABLE. IN ONE COMMUNITY 1,491 PEOPLE WERE ADDED TO T\nPOPULATION AND THEY LOST FIFTY HOUSING UNITS BECAUSE\nOF THE ENCROACHMENT OF INDUSTRY. IN ANOTHER, 44 FOR\nEVERY ADDITIONAL HOME. NOW, THESE ARE IN AREAS THAT\nHAVE BEEN HISTORICALLY NEGRO AREAS, OR iVlEX I C A N-WmER 1"
}