{
  "id": "d492-117",
  "text": "RICHTER:\nHO VDEN :\n-4-\nletts look into some of the ways in which this\nOPPOSITION AND HOSTILITY OPERATE. AND HERE, I THINK\nIT IS WELL TO BE QUITE SPECIFIC ABOUT AT LEAST A FEW\nOF THE VITAL ASPECTS OF THIS HOUSING PROBLEM._ Let’s\nDRAW ON THE EXPERIENCE AND REFLECTION OF MR. EDWARD\nHoWDEN, FORMER DIRECTOR OF THE SaN FRANCISCO COUNCIL\nfor. Civic Unity, and at present Executive Director\nof the San Francisco Commission of Equal Employment\nOpportunities. Mr. Howden discusses practices in th\nFIELD OF PRIVATE HOUSING WHICH MAKE FOR VERY REAL\nDIFFICULTIES FOR THE NEGRO.\nBut there are certain institutionalized practices in\nPRIVATE HOUSING WHICH STILL CONSTITUTE BIG BARRIERS.\nThese, in quick general summary form, are as follows\nTHE PRACTICES OF MOST REAL ESTATE BROKERS (THESE\nPRACTICES CONSISTING MAINLY OF EITHER REFUSING OR\nCERTAINLY HEAVILY DISCOURAGING THE SALE OF HOMES TO\nOTHERWISE QUALIFIED BUYERS WHO ARE NON-WHITE AND WHO\nARE ATTEMPTING TO BUY A HOME IN A NEIGHBORHOOD THAT\nIS STILL ALL-4HITE.) Now, AS A GENERALIZATION, AND\nFORTUNATELY THERE ARE SOME EXCEPTIONS, REAL ESTATE\nBROKERS, CERTAINLY IN THE SaN FRANCISCO BAY AREA,\nCERTAINLY IN CALIFORNIA GENERALLY, AND I GUESS IN ML\nOF THE REST OF THE NATION, ARE RELUCTANT OR OUTRIGHT\nUNWILLING AND REFUSING TO SELL IN A BLOCK WHICH IS\nSTILL ALL-UHITE TO A NON-AN ITE FAMILY.\nA SECOND KIND OF BARRIER, OF COURSE, HAS TO DO\nWITH WHAT INDIVIDUAL SELLERS WILL DO—PERHAPS * SHOU\nHAVE MENTIONED THIS FIRST. IVIOST REAL ESTATE BROKERS\nWHEN YCU QUESTION THEM ABOUT THEIR PRACTICES WILL,\n\"We dontt decide this. This is entirely up to the\nSELLER OF A HOME,’’ WHETHER HE BE A HOME BUILDER OR A\nHOME OWNER WHO IS RE-SELLING HIS HOME. N OW , THIS OF\nCOURSE DOES APPLY TO SOME INDIVIDUAL SELLERS, UNDER\nPRESSURE FROM NEIGHBORS, UNDER FEARS, OR FOR OUTRIGH\nPREJUDICIAL REASONS, WILL REFUSE TO SELL TO NON-vHIT\nAND WILL SO INSTRUCT THEIR BROKERS. ThE QUARREL OF\nMANY OF US WORKING IN I NTERGROUP RELATIONS, THE QUAR\nWITH REAL ESTATE BROKERS IS THAT THEY TEND TO SUPPOR\nTHIS PRACTICE AND TEND TO ENCOURAGE IT; GENERALLY\nSPEAKING. *F A SELLER DOESn’t RAISE THE QUESTION,\nTHEY MAY RAISE IT FOR HIM AND T H E < E I S--WE* RE AFRAID\nIN MANY CASES A KIND OF A ’COMING BETWEEN1 THE SELLF\nAND THE BUYER WITH SOME DISCRIMINATORY IDEAS. AND\nTHIS COMING - BETWEEN HAPPENS, UNFORTUNATE LY, OFTEN\nON THE PART OF THE BROKER.\nNow, ANOTHER BIG AREA OF RESISTENCE OR A KING\nOF BARRIER, HAS TO DO WITH HOME FINANCING. GENERALL\nSPEAK t-WG, THE NON-OH I TE HAS A LOT MORE TROUBLE GETTI\nA GOOD LOAN ON THE HOME HE WANTS TO BUY DESPITE HIS\nFINANCIAL QUALIFICATIONS, DESPITE HIS EDUCATIONAL AN\nCULTURAL STATUS, DESPITE HIS ESTABLISHED POSITION IN"
}