{
  "id": "d492-118",
  "text": "-5-\nTHE COMMUNITY; HE MAY HAVE GREAT TRCUOLE GETTING\nCONVENTIONAL FINANCING OR GETTINGFHA TYPE FINANCING,\nWHICH means on setter terms, and therefore LOWER COS\",\nTO HIM OVER A LONG PERIOD, OR WHICH ACTUALLY MIGHT\nMAKE THE DIFFERENCE BETWEEN HIS BEING ABLE TO OUY THE\nHOME OR NOT. BECAUSE ON THE SIZE OF THE LOAN YOU CAN\nGET WHEN YOU BUY A HOME, OF COURSE, MAY DETERMINE\nWHETHER YOU CAN GET IT AT ALL. I F YOU HAVE ABOUT T H F\nAVERAGE AMOUNT OF DOWN PAYMENT THAT THE NEXT GUY\nHAPPENS TO HAVE, AND THEREFORE YOU NEED A LOAN OF A\nCERTAIN SIZE IF YOU’RE GOING TO MAKE A PURCHASE, AND\nIF YOU CAN’T GET THAT SIZE LOAN, IF THE DANK WILL OFF\nYOU A LOAN OUT ONLY HALF THAT SIZE, THEN IT MAY MEAN\nTHAT YOU JUST CAN’ T BUY-PER I OD. So FINANCING IS ST,\nA VERY SERIOUS PROBLEM.\nThe OTHER SORT OF PROBLEM HAS TO DO WITH THE\nPRACTICES OF LARGE-TRACT BUILDERS, HOME BUILDERS,\nGENERALLY SPEAKING. N D , UNFORTUNATELY, WITH NOTABLE\nEXCEPTIONS, HOME BUILDERS GENERALLY ARE NOT YET SELL¬\nING to Negro families. Some in this area are selling\nto Oriental families, but not to Negroes. .\\W this\nTHE HOME BUILDER’S OWN DECISION AS TO 'WHAT IS IN HIS\nBEST BUSINESS INTEREST, RIGHTLY OR WRONGLY CONCEIVED\nAND THIS IS STILL THE KIND OF RACE BARRIER THAT HE\nTHROWS UP.\nSCHNEIDER: I suppose Mr. Howden’s statements could be fairly\nINDEFINITELY ELABORATED. BUT SOME OF THE CRUCIAL\nPROBLEMS UNDOUBTEDLY DO CENTER AROUND THE ACTIVITIES\nOF REAL ESTATE PEOPLE , SELLERS, FINANCIAL AGENCIES\nAND HOME BUILDERS. Yet, THERE ARE VARIOUS SPECTRES,\nGHOSTS THAT HAUNT THE PREMISES. THE SPECTRES OR GHOS\nI HAVE IN MIND RELATE TO MANY OF THE THINGS THAT AU¬\nTHORITIES ON HOUSING REFER TO AS FALLACIOUS NOTIONS •\nNOTIONS ABOUT WHAT WILL HAPPEN WHEN MEMBERS OF MINOR¬\nITY GROUPS MOVE INTO PREVIOUSLY AL L- ■ ‘ HIT E AREAS, AND\nABOUT WHAT THE MEMBERS OF THE MINORITY GROUPS MOVING\nIN ARE ACTUALLY LIKE. LET ME STRESS THAT YOU CAN GE*\nTHAT YOU HAVE GOTTEN, PANICKY ACTION BY WHITES IN AN\nALL-^HITE NEIGHBORHOOD IN SITUATIONS IN WHICH THERE\nWAS NO WARRANT WH.TEVER FOR FRIGHT OR FOR FLIGHT. I:\nHAVE HERE A STATEMENT FROM THE NOVEMBER, 1957, ISSUE\nof Social ctipn: ^ magazine of Christian Concern.\nTHAT PUTS VERY COGENTLY THE SITUATION I’M THINKING 0\nSpC I AL C T I ON NOTES THAT BEL I EF THAT VALUES WILL FAL\nIS AN ,fAGENT IN A CHAIN OF RESPONSES WHICH CULMINATE.\nIN A CONVICTION THAT THE NEIGHBORHOOD IS LOST.\n. Jh E N THIS ATTITUDE REACHES THE STAGE OF NEAR-PANIC,\nFAMILIES MOVE OUT AND DUMP THEIR PROPERTIES ON THE\nMARKET. Then ACTUAL DEPRECIATION CF PROPERTY VALUES\ndoes occur. Real Estate-financing institutions, and\nMARKETING AGENCIES RESPOND TO THIS FORM OF BEHAVIOR.\nSuddenly a large supply of houses becomes available"
}