{
  "id": "d492-120",
  "text": "-7-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nWITH THE WHITE, POPULATION. THIS COMES IN TO COMPLi\nCATE THE RACIAL FACTOR. ...WHICH MAY 3E VERY UNFORTUN\nATE, BUT IT IS STILL THE CASE. It IS MERELY HONEST\nAND REALISTIC TO RECOGNIZE IT, AND IT CAN QE DAMAG IF\nTO OVERLOOK IT. I’VE JUST QUOTED MR, ABRAMS, AND\nTHE LAST SENTENCE I QUOTED INDICATED THAT THE LAND¬\nLORD’S FAILURES ARE AUTOMATICALLY IMPUTED TO THE\nNegro’s has its. Immediately after this, Mr. 03 rams\nREMARKS, ”No ALLOWANCE IS MADE FOR THE FACT THAT A\nNEWCOMER FROM A BACKWARD REGION MAY NEED TIME FOR\nADJUSTMENT.'’ PRECISELY. BUT, HOWEVER UNFORTUNATE 7\nFACT IS THAT THE NEGRO MAY NEED TIME FOR ADJUSTMENT,\nAS MR. vBRAMS PUTS IT, THE FA CT REMAINS.\nIt SEEMS TO ME THAT IT WOULD 3E VERY EASY FOR YOU T\nQE MISUNDERSTOOD ON THIS, LOU, CERTAINLY YOU’RE NOT\nSUGGESTING THAT LOW INCOME, POORLY EDUCATED NEGROES\nSHOULD BE DISCRIMINATED AGAINST IN HOUSING?\nNothing could be more removed from my mind. I woul\nTHINK THAT WHAT I AM SUGGESTING SIMPLY INDICATES TH\nNEED FOR SOME DEGREE OF P L A N N I N G 3 Y U R 3 A N AND H 0 U S I v\nOFFICIALS, MORE UNDERSTAND I NG ON THE PART OF WHITES.\nAND, INDEED, A REALIZATION THAT WHERE THE NEGRO HAS\nWHAT MAY 3 E VIEWED AS SHORTCOMINGS, THEY ARE SHORT¬\nCOMINGS, IF THAT IS WHAT THEY ARE, WHICH ARE PECU LI\nTO A CLASS SITUATION, AND HAVE NOTHING DIRECTLY TO O\nWITH RACE.\nThus you would say that these '’shortcomings” would\nHOLD TRUE NOT ONLY FOR NEGROES FROM BACKWARD AREAS,\nbut for whites as well who have similar class back¬\ngrounds.\nYes. Yet, in the case of the Negro the matter is\nCOMPLICATED 3Y RACIAL PREJUDICE. RACIAL PREJUDICE\nALONE IS INVOLVED WHERE NEGROES ' COM ING INTO WHITE\nNEIGHBORHOODS ARE AT LEVELS OF EDUCATION AND INCOME\nCOMPARABLE TO THOSE OF THE WHITES WHOM THEY ARE SA I 0\nTO BE”INVADI NG” . I MIGHT ADD, THAT THERE IS SOME\nEVIDENCE TO SU G G E ST THAT PREJUDICE IS LIKELY TO QE\nLESSENED WHEN THE PREJUDICED MUST SUSTAIN CONTACTS\nWITH THE OBJECTS OF THEIR PREJUDICE, J_F — AND HERE I\nQUOTE FROM A RELEVANT STUDY BY OEUTSCH AND GoLLINS--\n1F ”THE BEHAVIOR OF OBJECTS OF PREJUDICE IS SUCH AS\nTO 3 E AT VARIANCE, OR NOT TO CONFORM WITH THE BELIEF\nOF THE PREJUDICED. THAT IS, THE N EGROES WITH WHOM\nTHE PREJUDICED PERSON HAS CONTACT MUST BE ’LAZY,\nIGNORANT, DELINQUENT, ETCETERA’.” CERTAINLY THIS\nONCE AGAIN SUGGESTS THE NEED FOR SOME KIND OF PLANN.\n/AND FURTHER, IT SUGGESTS THAT IF A CERTAIN MINIMUM\nSTRATEGIC PLANNING IS CARRIED THROUGH, INTEGRATED\nHOUSING CAN BE A FACTOR OF MAJOR SIGNIFICANCE IN\nREDUCING PREJUDICE."
}