{
  "id": "d492-122",
  "text": "-9-\nRI CUTER:\nJONES:\nRICHTER:\nEICHLER:\nRICHTER:\nE I CHEER:\nRICHTER:\nElCHLER:\nAnd since real-estate agents are mentioned, let us\nLISTEN TO iVlR. MADISON JoNES OF THE New YORK HOUSING\nAuthority, as he describes the operations of some\nreal estate agents.\nThe fact that a Negro family moves into an all-white\nneighborhood doesn’ t necessarily mean that VALUES are\ngoing to go down and prices are going to be depressed\n/hat happens is this. That if a Negro does move in,\nBY AND LARGE, THE REAL ESTATE BROKERS-—AND THIS GOES\nFOR BOTH WHITE AND NEGRO BR0KERS-THEY WILL START A\nCAMPAIGN OF HAiiRAS SME N T OVER THE ENTIRE COMMUNITY.\nTelling that the Negroes h.\\ve come in and quote '’You\nKNOW WHAT’S GOING TO HAPPEN'’ ENQUOTE, AND LITERALLY\nSCARE THE DAYLIGHTS OUT OF PEOPLE AND FINALLY PUSH\nTHEM INTO SELLING THEIR HOUSES, PICKING THEM UP FOR\nVERY LITTLE MONEY, LET’S SAY, BECAUSE PEOPLE ARE SELL\nING IN A PANIC. THE SAME BROKER WILL TURN AROUND AND\nOFFER THE SAME HOUSE TO A NEGRO FAMILY AT MANY, MANY\nTIMES MORE TIMES A FIGURE THAN HE PAID FOR IT. So\nHE MAKES A KILLING BOTH WAYS. He BUYS IT CHEAPLY\nAND HE SELLS IT EXPENSIVELY.\nAND INCONCLUSION, LET US TURN TO THE CASE OF A MAN\nWHO IN HIS OWN WAY IS MAKING A CONTRIBUTION TOWARD\nALLEVIATING THE NEGRO’S HOUSING PROBLEM: iVlR . JOSEPH\nElCHLER, AN IMPORTANT HOME BUILDER IN THE SaN FraN-\ncisco Bay area....builder of Eichler Homes.\n‘JELL, MY I EW IS THAT ANY AMERICAN IS ENTITLED TO\nPURCHASE A HOME UNDER THE GOVERNMENT GUAR NTEED FIN¬\nANCING PROGRAM WHICH IS THE PROGRAM UNDER WHICH WE\nOPERATE, AS LONG AS HE IS FINANCIALLY QUALIFIED AND A\nLONG AS, IN OUR OPINION, HE WOULD MAKE A GOOD NEIGHBC\nELL, DO YOU PUT PROSPECTIVE OWNERS OF YOUR HOMES\nTHROUGH A SCREENING PROCESS?\nM E DO, YES.\nOn what basis?\nv'ELL, WE NATURALLY TRY TO ASCERTAIN WHETHER THEY HAVE\nTHE FINANCIAL QUALIFICATIONS AND THEN, WE GET THEIR\nBACKGROUND AND SO ON. WE CAN PRETTY WELL DETERMINE\nWHETHER PEOPLE WILL MAKE GOOD NEIGHBORS OR NOT. /E\nMAKE OUR JUDGMENT BY TALKING TO THEM AID SO ON. I\nMIGHT STATE THAT WE HAVEN’T BEEN ONE HUNDRED PERCENT\nACCURATE IN OUR JUDGMENT, WE HAVE HAD, FROM TIME TO\nTIME, PEOPLE WHO HAVE TURNED OUT TO BE NOT GOOD\nNEIGHBORS. -'N D THIS HAS CAUSED FAR MORE TROUBLE THAN\nANY OF THE...THAN ANY MEMBER OF ANY MINORITY GROUP."
}