{
  "id": "d492-123",
  "text": "-10-\nRI CUTER :\nEICHLER:\nRICHTER:\nEICHLER:\nRICHTER:\nEICHLER:\nRICHTER:\nEICHLER:\nRICHTER:\nHave you never had any repercussions from people who\nWANTED YOU TO BUILD THEM A HOUSE?\n■'/ELL, NATURALLY WE’VE HAD SOME REPERCUSSIONS — THERE\nHAVE BEEN PEOPLE WHO’VE REFUSED TO BUY HOUSES IN OUR\nVARIOUS DEVELOPMENTS BUT, BY AND LARGE, WE’VE MANAGEl\nTC SELL ALL THE HOUSES THAT WE BUILD AND ALSO THAT TH\nRESALE VALUES OF OUR HOUSES HAVE INCREASED VERY SUB¬\nSTANTIALLY. In fact, I WOULD THINK, in MOST of our\nSUBDIVISIONS THAT THE RESALE VALUE HAS BEEN ABOVE\nAVERAGE. I THINK ONE OF THE REASONS FOR THE...AND I\nMIGHT MODESTLY CALL IT THE SUCCESS OF OUR METHOD OF\nDEALING WITH MINORITY GROUPS...IS THAT WE TREAT EACH\nINDIVIDUAL THAT COMES IN TC BUY A HOUSE IN A SORT OF\nMATTER OF FACT OR A MATTER OF COURSE MANNER. A MAN\nCOMES IN, HE WISHES TO BUY A HOUSE. No QUESTION EVE'.\nARISES, NO DISCUSSION IS EVER ENGAGED IN, AS TO HIS\nRACE, OR HIS COLOR, OR ANY OF HIS PERSONAL CHARACTER¬\nISTICS.\nUR EVEN HIS ATTITUDES?\n’kVELL, I DON’T KNOW WHAT YOU MEAN BY HIS ATTITUDES.\n■ELL, MANY PEOPLE HAVE RATHER STRONG ATTITUDES RELA¬\nTING TO RACE AND DO YOU TRY TO FIND OUT WHETHER A\nPERSON MOVING INTO ONE OF YOUR DEVELOPMENTS Has AMY\nFEELINGS AGAINST NEGROES IN THE COMMUNITY?\n\"J E DO NOT. JE DON’T GO THAT FAR, AND WE HAVE DONE\nTHIS ON MANY OCCASIONS: PEOPLE HAVE FOUND OUT WHEN\nTHEY WERE BUYING A HOUSE FROM US THAT THEY WERE GO I N'\nto have a Negro neighbor and they felt, some felt\nDISTURBED ABOUT THIS, BUT IN NEARLY ALL CASES WE’vE\nMANAGED TO CONVINCE THEM THAT THIS, THAT THESE PEOPL\nWERE DECENT PEOPLE AND THAT THEY WOULD MAKE GOOD\nNEIGHBORS AND THAT THEIR FEARS WERE UNFOUNDED. k»E\nHAVE HAD A FEW OCCASIONS WHERE WE’VE HAD TO REFUND\nPURCHASER’S MONEY, AND TAKE THEIR HOUSES BACK AND\nRESELL THEM. ^UT THESE HAVE BEEN VERY, VERY FEW IND\nIN OTHER WORDS, YOU WOULD SAY THAT IN GENERAL THE\nMATTER OF INTEGRATION IN THE COMMUNITIES WHICH YOU’v\nHELPED TO CONSTRUCT HAS GONE ON UNEVENTFULLY AND\nSUCCESSFULLY.\nThat is correct.\nThus we see that in testing certain of the theories\nREGARDING INTERRACIAL HOUSING WHICH ARE PREVALENT\nAMONG REAL ESTATE BROKERS AND BUILDERS, MR . ElCHLER\nDISCOVERED AT LEAST A FEW FALLACIES. ToDAY WE TOUCH\nON SOME OF THE HIGHSPOTS OF THE NEGRO’S PROBLEM OF\nFINDING A PLACE TO LIVE. NeXT WEEK OUR SUBJECT WILL"
}