{
  "id": "d492-125",
  "text": "THF I AST CITIZEN\nProgram ff\\ 2\n■’The City, Part 4”\nNegro Crime\nSCHNEIDER:\nOur criminal statistics, by and large, leave a great\ndeal to be desired. They are technically in many\nWAYS FAULTY. ANO'WHEN IT COMES TO THE NEGRO, VERY\nMANY QUESTIONS ARISE REGARDING THE MEANING OF STATIS¬\nTICS. So MANY, IN FACT, THAT WE CAN’T DO MORE THAN\nI NO I CATE A FEW OF THEM IN THIS PROGRAM.\nMUSIC:\nSTINGER\n\\NNCR :\nCrime and\ntopic IS\nNegro in\nMUSIC:\nSTINGER\nCRIMINALITY AMONG NEGROES. LISTEN AS THIS\nINVESTIGATED IN ANOTHER DISCUSSION OF THE\n>meriCA_\"The Last Citizen.\"\nANNCR:\nThe Last Citizen: The Negro in America. a series\nOF PROGRAMS DEVOTED TO THE EXTENSION OF OUR KNOWLEDG\nOF THE LARGEST MINORITY GROUP IN THE UNITED STATES,\nITS PROBLEMS, AND THE PROBLEMS IT POSES TO ALL AMER¬\nICANS. The Last Citizen is produced by Radio otatu\n;3 t/a Purdue University, under a grant from the\nEducational Television and Radio Center, in coopera¬\ntion with the National association of Educational\nBroadcasters. The discussants are the Producer of\nthe Series E. W. Richter, and Dr. Louis Schneider,?\nProfessor of Sociology at Purdue University. oday\nprogram: The Negro, The City, and Crime. Here now\nis Mr. Richter.\nRICHTER:\nThe criminality attributed to Negroes looms large i\nTHE THINKING OF MANY PEOPLE. TODAY WE TAKE UP THIS\nsubject of Negro crime. In the first place, Lou,\nit’s my understanding that such statistical materia\nas we have, seems to show that, for example, in\ncities Negroes are criminally inclined far cut of\nproportion to their representation in the populate\nSCHNEIDER:\nI’M GLAD YOU’VE PUT THIS IN SUCH A CAUTIOUS WAY BY\nSAYING '’SUCH STATISTICAL MATERIAL AS WE HAVE, AND\nTHAT THIS MATERIAL ’’SEEMS TO SHOW’’ HIGH CRIMINAL\nINCLINATION ON THE PART OF THE NEGRO. OUR CRIMINAL\nSTATISTICS, BY AND LARGE, LEAVE A GREAT DEAL TO BE\nDESIRED. They are technically in many ways faulty,\nN D WHEN IT COMES TO THE NEGRO, VERY MANY QUESTIONS\nARISE regarding the meaning of the STATISTICS. So\nmany IN FACT, THAT we can’t DO MORE THAN INDICATE\nA FEW OF THEM IN THIS PR0GRAM . . . .ONE MIGHT CONTEND\nTHAT THE ESSENTIAL STORY OF THE NEGRO IN RELATION T"
}