{
  "id": "d492-126",
  "text": "-2-\nRICHTER:\nSCHNEIDER:\nCRIME IS REALLY A QUITE CLEAR, FORTHRIGHT THING. THE\nNegro is far more readily arrested than the white man\nTHE ORDINARY POLICEMAN IS FAR LESS AFRAID OF ARREST I r\na Negro, particularly in the South, than he is of\nARRESTING A “HITE MAN. He to F \\ . LESS FEARFUL OF\nOVERSTEPPING THE DOUNDS OF WHAT HE MAY LEGALLY DC WHE\nHE DEALS WITH NEGROES THAN WHEN HE DEALS WITH WHITES.\nIt’s hardly a secret that judges and juries are fre¬\nquently PREJUDICED AG \\ INST THE NEGRO. It WOULD NOT\nBE AN EASY THING TO CALCULATE THE DIMENSIONS OF WHAT\ni MIGHT CALL RACIALLY D I S P L A C E D CRIME. 3y WHICH\nI MEAN CRIME COMMITTED BY WHITE PERSONS FOR WHICH THE\nNegro is punished. 3ut there has undoubtedly been a\nGREAT DEAL OF IT. The NEGRO HAS BEEN HANDICAPPED IN\nCONNECTION WITH PAROLE. ONE MIGHT SAY, BY ANALOGY\nWITH THE PHRASE THAT HAS BECOME SO FAMILIAR TO US IN\nAPPLICATION TO THE LABOR MARKET, NAMELY 11F I R S T FIRED,\nLAST HIRED, THAT IN THE SPHERE OF CRIME AND PUNISH¬\nMENT THE SITUATION OF THE NEGRO CAN BE SUMMARIZED IN\nSOME SUCH WORD AS ,?FIRST ARRESTED, LAST RELEASED.'’\nNecessarily I omit much but this is really the gist\nOF THE STORY WHATEVER THE DETAILS, THE ELABORATIONS,\nAND THE EXPLANATIONS THAT A FULLER STORY MIGHT HAVE\nTO PRESENT.\nI GATHER, THEN, THAT PARTICULARLY IN THE CASE OF THE\nNegro, you would question crime statistics insofar a\nANYONE MIGHT CONTEND THAT THEY WERE A TRUE REFLECT 10*'\nof actual Negro criminal behavior. But suppose, for\nINSTANCE, THAT NEGROES WERE ARRESTED ON CHARGES OF\nRAPE TEN TIMES AS FREQUENTLY AS WH ITES . . . .TAK ING l NT\nACCOUNT DIFFERENT PROPORTIONS OF NEGROES AND WHITES\nIN THE POPULATION. iOULD THIS JUSTIFY ANY STATEMENT\nsuch as: Negroes are ten times as likely to commit\nRAPE AS WHITES?\n'E LL , I WOULD BE VERY DUBIOUS OF A STATEMENT LIKE\nthat! There would be difficulties, anyway, in takin\nINTERPRET ARRESTS AS INDICES OF CRIMINAL BEHAVIOR IN\nGENERAL. Out, IN THE CASE OF THE NEGRO MORE ESPECIA\nL Y , TO INTERPRET ARRESTS FOR RAPE AS ANYTHING LIKE A\nINDEX OF ACTUAL BEHAVIOR ON THE LINES OF RAPE WOULD\nBE ALMOST UNSPEAKABLY HAZARDOUS. 'NY NUMBER OF\nCRIMINOLOGISTS HAVE INDICATED FULL AWARENESS OF THIS\nOne, for example, says in a standard and widely used\nTEXTBOOK, I T MUST BE EMPHASIZED THAT MERE FORNICAT!\nBETWEEN A NEGRO MAN AND A WHITE WOMAN IS APT TO BE\nDEALT WITH AS RAPE IN THE SOUTH. ON THE OTHER HAND\nWHATEVER MAY BE THE TRUE ATTITUDES OF NEGRO WOMEN\nTOWARD SEXUAL RELATIONS WITH WHITE MEN, AND WHATEVER\nPRESSURE MAY BE BROUGHT TO BEAR UPON THEM TO SU3MIT\nEVEN WHEN UNWILLING, IT IS ALMOST IMPOSSIBLE FOR A\nWHITE MAN TO BE CONVICTED OF THE RAPE OF A NEGRO\nWOMAN.\" AS AN ASIDE, LET ME REMARK, THAT THE CASE i"
}