{
  "id": "d492-127",
  "text": "-3-\nRICHTER:\nSCHNEIDER:\nM \\N I :\nSCHNEIDER:\nFlorida in 1959 in which several white men were given\nLIFE SENTENCES FOR THE RAPE OF A NEGRO GIRL SHOWS THE\nBEGINNING OF CHANGE IN REGARD TO THIS LAST MATTER, BU\nTHAT IS SOMETHING ELSE. It DOES SEEM PRETTY CLEAR\nTHAT TO TAKE AT FACE VALUE, AS SHOWING, LET’S SAY, A\nTEN TIMES GREATER PROPENSITY TOWARD RAPE FOR NEGROES\nTHAN FOR WHITES, ARREST DATA WHICH INDICATE THAT •'\nNegroes are ten times more frequently arrested for\nRAPE THAN WHITES (IN RELATION TO THEIR REPRESENTATION\nIN THE POPULATION) IS PURE FOOLISHNESS,\nI THINK THE THINGS YOu’vE MENTIONED SO FAR, LOU, SIMP\nTHOUGH THEY BE, SHOULD BE DOCUMENTED. Let’s FIND SOM\nCOMMENTARY ON THESE MATTERS. CAN WE RE-ENFORCE AT\nLEAST SOME OF THESE STATEMENTS YOU’VE MADE?\nVe CAN DO THAT QUITE EXTENSIVELY. LET ME START WITH\nAN EXTRACT FROM AN ABLE DISCUSSION BY THE SOCIOLOGIST\nGuy 3. Johnson, of \"the Negro and Crime\". The passag\nI SELECT HAS REFERENCE TO THE POLICE.\nThe police have an especially strategic position in\nTHE ADMINISTRATION OF JUSTICE. VARIATIONS IN THEIR\nACTIVITIES CAN PRODUCE FLUCTUATIONS IN ARREST STATIS¬\nTICS WHICH HAVE NO RELATION TC THE NUMBER CF OFFENSE';\nACTUALLY COMMITTED. By MISTREATMENT OR BRUTALITY\nTOWARD ANY GROUP OR CLAWS OF PEOPLE THEY CAN EVEN\nPROVOKE OR STIMULATE THE COMMISSION OF CRIME. The\nNegro is more exposed to the misuse of police power\nTHAN ANY OTHER GROUP.\nThe police custom of arresting Negroes on slight\nSUSPICION OR OF STAGING MASS ’ROUNDUPS’ OF ^EGROES IS\nDEFINITELY RELATED TO THE NEGRO’S LACK OF SECURITY\nAND HIS INABILITY TO EXERT PRESSURE AGAINST SUCH\nabuses. Police pretty generally feel that in making\nARRESTS, HANDLING WITNESSES, AND OBTAINING CONFESSION\nTHEY CAN USE BRUTE FORCE AGAINST NEGROES WITH IMPUNI\"\n....In THE INTERPLAY OF BEHAVIOR BETWEEN THE POLICE\nand the Negro suspects there is a reciprocal expect¬\nation OF VIOLENCE. The POLICE TOO QUICKLY USE GUN 0;\nCLUB, AND I^EGRO ES--ESPEC I A LLY THOSE WITH REPUTATIONS\nAS ’BAD NIGGERS’-ARE KEYED TO A DESPERATE SHOOT-FIRS\nOR-YOU’LL-GET SHOT PSYCHOLOGY. THUS, WHAT STARTS OUA\nTO BE MERELY A QUESTIONING OR AN ARREST FOR A MIS¬\nDEMEANOR MAY SUDDENLY TURN INTO VIOLENCE AND THE\nCHARGE OF MURDER AGAINST THE NEGRO.\"\nThe experiences of Negroes as victims of police mis¬\ntreatment MUST GIVE RISE TO CONSIDERABLE BITTERNESS,\nAND A FEELING THAT THE LAW IS UNJUST. THESE EXPER¬\nIENCES AND ATTITUDES DESERVE CAREFUL STUDY, FOR THEY\nARE UNDOUBTEDLY CONTRIBUTORY TC BOTH THE REAL AND THF\nAPPARENT CRIMINALITY OF NEGROES."
}