{
  "id": "d492-128",
  "text": "RICHTER:\nPOOL:\nRICHTER:\nDELANEY:\nLet us add to this statement a comment made bv Cecil\nPool, Assistant .District ttorney in San Francisco.\nThere are various areas in which it must be said that\nthe Negro receives more than his share of attention •\nfrom law enforcement. Obviously, of ten persons\nWALKING DOWN MONTGOMERY STREET BELOW US HERE, A NEGRC\nSTANDS OUT. He IS, HE IS IDENTIFIED—HE IS NOT AMOR¬\nPHOUS LIKE THE OTHER NINE, LET’S ASSUME THEY ARE\nwhite. Therefore, if any suspicion attends the actl\nOF ANY OF THESE TEN PERSONS, THE ACTIONS OF THE I DEN'\nifies Negro will stand out as if he were lit up in\nneon. Therefore, he’s a more easy, a readier target\nFOR POLICE ATTENTION. He GETS PICKED UP EASIER. ...HE\nHAS FEWER RESOURCES, BOTH FINANCIALLY, ECONOMICALLY,\nAND VERY OFTEN MENTALLY BECAUSE OF HIS RELATIVE,\nRELATIVELY, LOWER ACADEMIC AND EDUCATIONAL AND SOCIA'\nBACKGROUND. THEREFORE, HE TENDS TO BE MORE OF A\nCUSTODIAL AND POLICE PROBLEM FOR A LONGER PERIOD OF\nTIME AND TO HAVE LESS PROPORTIONATE CHANCE OF SO-\nCALLED BEATING THE R.,P THAN WOULD HIS FELLOW WHITE\nPR I SONER.\niND TO THIS STATEMENT BY IVIR. POOL LET US ADD SOME\nCOMMENT MADE BY HUBERT DELANEY ON THE BACKGROUND OF\nHIS EXPERIENCE AS A JUDGE IN THE NEW YORK MUNICIPAL\ncourts. In an informal chat Mr. Delaney made it clf^\nTHAT HE ALSO THOUGHT THAT THE NEGRO ISMORE QUICKLY\nAND READILY ARRESTED THAN TIE WHITE MAN, MORE READILY\nCONVICTED, AND LIKELY TO RECEIVE A LONGER PRISON\nTERM. ON THIS OCCASION, HOWEVER, WE WANTED TO GET\nBEYOND THESE THINGS, AND WE A.SKED WHY, IN MR. QELANE\nopinion, the Negro received the differential treat¬\nment.\nI think there are two reasons* One, and probably th\nGREATEST REA ON, IS THE REASON THAT MORE POOR WHITE\nPEOPLE ARE MORE FREQUENTLY ARRESTED AND MORE FRE¬\nQUENTLY CONVICTED AND GIVEN LONGER SENTENCES THAN TH\nSO-CALLED ’WHITE-COLLAR’ OR WEALTHY PERSON. A PERSC\nWHO HASN’T GOT A JOB CAN BE ARRESTED FOR DISORDERLY\nCONDUCT, OR HE’S MORE LIKELY TO COMMIT AN OFFENSE\nAGAINST SOCIETY IN ORDER TO EAT OR TO BE ABLE TO CAR\nFOR HIMSELF IF HE CAN’T GET A JOB. That’S ONE R E A S C\nI THINK WE HAVE BEEN REARED TO HAVE LESS SYMPATHY F<\nTHE SO-CALLED POOR, BE HE WHITE OR BLACK. I THINK\nIT’S A PART OF OUR CULTURE, UNFORTUNATELY, THAT WE\nTEND TO LOOK OFF THE END OF OUR NOSE AT THOSE WHO\nHAVE NOT HAD THE SAME OPPORTUNITIES THAT THOSE OF US\nWHO HAVE HAD THE GOOD FORTUNE TO BE EDUCATED AND TO\nHAVE ACULTURAL BACKGROUND HAVE. The OTHER REASON IS\nTHAT THERE IS SO MUCH PROPAGANDA AGAINST NEGROES, TH\nSTEREOTYPE PROPAGANDA THAT NEGROES ARE INNATELY LI A"
}