{
  "id": "d492-130",
  "text": "-6-\nRICHTE ; :\nSCHNEIDER:\nNegro community. In a less poverty-stricken communit\nTHEY MIGHT BE LOOKED AT ASKANCE BECAUSE OF THE SHADY\nOR ILLEGAL WAY IN WHICH THEY MAKE THEIR MONEY. ‘‘HERE\nthe Negro does not lock askance at Negro racketeers,\nHE IS IN a SENSE BEING A TRUE 'M E R I CAN . He IS ADMIR¬\nING THE SUCCESSFUL MONEY MAKER. iND, IT IS PERHAPS\nTOO MUCH TO EXPECT THAT HE WILL ALWAYS MAKE THE RESEA\nVATION THAT THE SUCCESSFUL MONEY MAKER MAY NOT HAVE\nCOME BY HIS GAINS LEGITIMATELY. THAT SORT OF RESERVA\nTICN, IF Y 0U WILL, IS A BIT OF A LUXURY, You CAN\nEXPECT IT MORE READILY IN A LESS POVERTY-STRICKEN\nCOMMUNITY. 3UT WE CAN SEE IN ALL THIS THE NEGRO’S\nVERY REAL CULTURAL INVOLVEMENT. H|S CRIMINALITY AND\nHIS ADMIRATION FOR AT LEAST SOME KINDS OF CRIMINAL OR\nQUASI-CR INI I NAL BEHAVIOR ARE DEFINITELY BOUND UP WITH\nTHE CULTURE IN WHICH HE LIVES AND MOVES AND HAS Hi'S\nbeing;\nThis matter of the Negro’s cultural involvement is\ncertainly an interesting thing. How else would you\nSAY CULTURAL FACTORS ARE BOUND UP WITH THE NEGRO'S\nCRIMINALITY?\nW'ELL, THERE’S A VARIETY OF THINGS TO BE SAID IN THIS\nCONNECTION. For ONE, THE NEGRO IN ->M E R I C A EMERGES\nfrom the South, and it is well known that the South\nHAS A LONG‘TRADITION OF RELIANCE ON VIOLENCE. CON¬\nSISTENTLY, FOR EXAMPLE, RATES FOR HOMICIDE HAVE BEEN\nCONSIDERABLY HIGHER FOR THE SOUTH THAN FOR OTHER\nREGIONS CF THE NATION. FRONTIER CONDITIONS AND THE\nPECULIARITIES OF THE SLAVE INSTITUTION NO DCUGT'CON¬\nTRIBUTE HEAVILY TO THIS SITUATION. ilLBUR CASH, IN\nHIS The MIND OF THE S C U T H . IN ONE OF HIS NUMEROUS\nREFERENCES TO VIOLENCE IN THE SOUTH REMARKS,\"HOWEVER\nCAREFUL THEY MIGHT BE TO WALK SOFTLY, SUCH MEN AS\nTHESE OF THE SOUTH WERE BOUND TO COME OFTEN INTO\nCONFLICT. .\\ND BEING WHAT THEY WERE — S I M P L E , DIRECT,\nAND IMMENSELY PERSONAL—AND THEIR WORLD BEING WHAT I,\nWAS, CONFLICT WITH THEM COULD ONLY MEAN FISTICUFFS,\nTHE GOUGING RING, AND KNIFE AND GUNPLAY.” FRONTIER\nLAWLESSNESS, AND THE DEFENSELESSNESS OF THE NEGRO, H,\nMUCH TO DO, IT’S BEEN SUGGESTED, WITH THE UNAMl ABLE\nTENDENCY TOWARD LYNCHING. Of COURSE, THE NEGRO WAS\nOFTEN THE VICTIM OF LYNCHING, ALTHOUGH HE WAS HARDLY\nALONE in THIS. The propensity to take the law INTO\none’s OWN HANDS MADE MANY OTHERS BESIDES THE NEGRO\nVICTIMS OF LYNCHING. HOWEVER, WHAT I WISH TO PROPOSE\nIS THAT THE NEGRO HAS SUFFERED FROM THE LYNCHING TEND\nENCY, IF I MAY TaKE THAT AS SYMBOLIC OR INDICATIVE, ’\nOTHER WAYS THAN AS THE DIRECT VICTIM OF THE AGGRESS I C\nIT REPRESENTS. HE HIMSELF HAS BEEN INFLUENCED BY THE\nENTIRE VIOLENCE PATTERN. KNIFE TOTING, GUN CARRYING,\nAND READINESS TO ENGAGE IN VIOLENCE AND LAWLESS OUT¬\nBURSTS HAVE GOTTEN INTO THE HERITAGE OF THE NEGRO, Ai\nHAVE LANDED HIM IN TROUBLE BOTH INSIDE AND OUTSIDE Th\nSouth."
}