{
  "id": "d492-131",
  "text": "-7-\nR i CHTER: Now I want to stop you on this, Lou. You speak of th\nNegro's knife toting, gun carrying, and proneness to\nENGAGE IN VIOLENCE AS GETTING HIM INTO TROUBLE . Vi ELL\nWOULDN'T YOU HAVE TO MAKE AT LEAST ONE QUALIFICATION\nTO BEGIN WITH9 THAT IS THAT A GREAT DEAL OF NEGRO\nLAWLESSNESS HAS BEEN CONDONED IN THE ^OUTH AS LONG AS\nIT’S BEEN DIRECTED TOWARD OTHER NEGROES. I UNDERSTAN\nTHAT THERE'S BEEN A GOOD DEAL OF THIS KIND OF THING.\nSCHNEIDER: 1 think you’re quite right. The qualification is a\nNECESSARY ONE. The RELEVANT LITERATURE IS FILLED WIT\nACCOUNTS, FOR EXAMPLE, OF NEGROES WHO ARE AT THE SAME\nTIME GENTLE AND SELF-HUM0LlNG IN THE FACE OF WHITES,\nBUT UNRESTRAINEDLY AGGRESSIVE IN RELATION TO OTHER\nNegroes. and such Negroes frequently get protection\nFROM WHITE PATRONS WHO WILL MINIMIZE THEIR FAULTS....\nAND EVEN ALLOW THEM TO GO SCOTT FREE WHEN THEY HAVE\nBEHAVED FELONIOUSLY. IN THE ARTICLE BY GuY JoMNSCN,\nWHICH WE'VE ALREADY QUOTED TODAY, JOHNSON MAKES THIS\nPERTINENT COMMENT:\nlVL\\N I: Too MANY CASES FIT INTO THE FOLLOWING PATTERN. THE\nsporty Negro butler for a wealthy white man is cir¬\ncumspect IN HIS WORK, BUT IS CONSIDERED SOMETHING OF\n\"menace'’ by his fellow Negroes. He deliberately\nMURDERS A NEGRO GIRL WHO HAS SPURNED HIS ATTENTIONS.\nBeing ably defended by his employer he receives a\nLIGHT SENTENCE FOR MANSLAUGHTER, AND HE HAS SCARCELY\nBEGUN TO S E A V E THIS WHEN HIS EMPLOYER OBTAINS HIS\nPAROLE BECAUSE HE IS ANXIOUS NOT TO LOSE THE NEGRO’S\nSERV ICES.\nRICHTER: \\n interesting pattern. I can't help wondering what\nTHIS MUST DO TO THE WHITE MAN’S OWN RESPECT FOR LAW\nWHEN HE FLOUTS IT IN THIS WAY FOR THE BENEFIT OF\nfavored Negroes whose crimes have \"only” been against\nother Negroes.But now, another matter, Lou.\nWouldn’t this tendency toward violence, even if it ha\nbeen in the heritage of the Negro, also be bound up\nWITH CLASS9\nSCHNEIDER: Yes. Of course, I wouldn’t want to be misunderstood,\nand I'm glad you bring this point up. There are\nmiddle class Negroes whose behavior is as discreet an\nlaw abiding as that of anyone, and I don’t mean eithe\nthat all lower class Negroes are ncn-law-abiding.\nBut the evidence we have does suggest that the tend¬\nency toward direct violent action is bound up with\nPOSITION IN THE CLASS STRUCTURE.\nRICHTER: ^nd that, in turn, I suppose, suggests the entire\nbackground of cities and slums. But now, let's see\nhow some of the things we've been speaking about may\nreflect themselves in the concrete life of the indi-"
}