{
  "id": "d492-132",
  "text": "-8-\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nvidual. In other words, let’s look at Negro crime as\nIT MIGHT APPEAR, SAY, IN THE WORK OF A NOVELIST, OR\nIN THE CASE WORK OF A SOCIAL WORKER. CAN WE GET SOME\nTHING OF A VIVID, DETAILED PICTURE OF AN INDIVIDUAL\nOFFENDER, LOU?\nI DON’T DOUDT THAT WE CAN; THERE ARE CASE STUDIES\nGALORE THAT APPEAR IN THE DOCUMENTS OF CRIMINOLOGISTS\nAND SOCIAL WORKERS, AND THERE* S PLENTY OF FICTIONAL\nMATERIAL WHICH RINGS AS TRUE AS ANYTHING THAT YOU MAY\nFIND IN THE CASE STUDIES. If WE WANT TO □E VIVID AND\nCONCRETE, THERE’S LITTLE, I SUPPOSE, THAT WOULD FIT\nOUR DILL BETTER THAN THE VIRTUALLY CLASSIC DESCRIP¬\nTION of Digger Thomas which Richard Bright presented\nin Native Son. Let me draw on my memory of the novel\n’•-HAT ESPECIALLY STANDS lUT NOW, MANY YEARS AFTER MY\nREADING THE BOOK, IS SCENES LIKE THESE: Bl.'GER FACES\nAND KILLS A DANGEROUS RAT IN THE VERMIN INFESTED\nDWELLING IN WHICH HE LIVES. BlGGER, AND A NUMBER OF\nFRIENDS, LOOK INTO THE SKY AND WISTFULLY WATCH AIR¬\nPLANES WHICH THEY KNOW, OF COURSE, ARE PILOTED BY\nWHITE MEN. ONE OF THE BOYS MAKES SOME COMMENT TO THE\nEFFECT THAT IT WOULD BE A WONDERFUL THING FOR A NeGRC\nBOY TO BE ABLE TO PILOT ONE OF THOSE JOBS. BuT THIS\nBRINGS ONLY SAD, CYNICAL RESPONSE. Th^SE BOYS--KNOW\nTHAT THEY ARE CUT OFF FROM SUCH POSSIBILITIES....\nBigger has killed a white girl. This murder has to\n3 E SEEN AGAINST THE BACKGROUND OF WHAT HIS LIFE HAS\nBEEN. ...A LIFE OF POVERTY, AND A LIFE THAT GRINDS\nEVERY ONE OF HIS ASPIRATIONS INTO THE GROUND. 'ND\nBigger finally sees it in this way. .*nd to the utter\nHORROR OF HIS LAWYER, A WHITE MAN, HE TAKES SATIS¬\nFACTION IN HIS CRIME. IT IS AS IF HE WERE SAYING THI\n’Here, now, all my life I’ve sought for outlets, for\nWAYS OF BEING MYSELF. BuT I WAS NEVER ABLE TO FIND\nANYTHING THAT WOULD REALLY MEET MY NEEDS. AND YET I’i\nBigger Thomas. I’m an ”1,” I’ve got t.o express mysel.\nsome way. The act of killing this girl was something\nTHAT I DID. It EXPRESSED SOMETHING OF ME. It HAS A\nGENUINENESS THAT I WON’T REPUDIATE. I CAN TAKE\nSATISFACTION. The ACT HAS MY MARK ON IT. WHATEVER\nYOU MAY SAY, I CAN’T BE SORRY I DID IT. If CREATIVIT'\nMEANS ANYTHING THIS WAS MY CREATIVE ACT.\n>S I UNDERSTAND IT, THROUGH THE BLOCKING OF, SHALL WE\nSAY, NORMAL OUTLETS, THIS BOY’S INDIVIDUALITY AND\nCREATIVITY EXPRESSED THEMSELVES IN THE UTTERLY PERVER\nFORM OF MURDER.\nYes. I think this is what ..'right was trying to tell i\n' N D THE IMPLICATION IS THAT IN A DIFFERENT, MORE CON¬\nGENIAL, MORE ACCEPTANT MILIEU OR SET-UP, BlGGER ThCMA<\nMIGHT WELL NEVER HAVE COME TC THE KIND OF ACTION IN"
}