{
  "id": "d492-137",
  "text": "SCHNEIDER:\nRICHTER:\nSCHNEIDER:\nNegroes were given Christian dapt ism from the begin¬\nning OF THEIR HISTORY IN THIS COUNTRY. THERE WERE\nSOME DIFFICULTIES ADCUT CHRISTIANIZING THE NeGRC\nBECAUSE , AS 'WE ALREADY KNOW FROM PREVIOUS DISCUSSION\nNUMDERS OF MEN WERE UNCERTAIN AG CUT THE COMBINATION\nOF THE STATUSES OF CHRISTIAN AND SlAVE. SuT THESE\nDIFFICULTIES TENDED TO DISAPPEAR AND IT WAS SOON A\nSIDELY ENOUGH ACCEPTED NOTION THAT THE NEGRO COULD\nGOTH SLAVE AND CHRISTIAN. IN THE I8TH CENTURY VAR 10\nChristian groups exercized influence over Negroes,\nincluding Presbyterians, Quakers, Catholics, and\nMoravians. But it was the Baptists and Methodists\nWHO REALLY MADE A POWERFUL IMPRESSION UPON THE NeGRC\nPEOPLE. aND THIS IMPRESSION REALLY BEGAN TO BE A\nNOTABLE ONE A F T E . THE REVOLUTIONARY WAR. THE BaPTIT\nand Methodist groups are the gre ,t Negro denominate\nAL GROUPS TODAY.\nLet ME INTERRUPT TO ASK ABOUT THE RELATIONS OF THE\nNegroes to whites in connection with this matter of\nreligion. During the slave period did Negroes part.\nCIPATE IN THE RELIGIOUS ACTIVITIES OF THEIR MASTERS‘\nThere was a good deal of participation in the reli¬\ngious LIFE OF THE MASTERS. CHURCH SERVICES WERE\nOFTEN CONDUCTED TO WHICH EVEN NEGRO HOUSE-SERVANTS\nWERE GRANTED A 0 MI S S I ON. . . .THEY WERE SERVICES,\nTHEREFORE, WHICH WERE CARRIED NOT FOR WHITES AND\nNegroes together. .*t the same time it’s true that\nNUMBERS OF NEGRO PREACHERS WERE ALLOWED TO CONDUCT\nSERVICES AMONG THE SLAVES. THERE WAS SOME FEAR OF\nTHIS SORT OF THING ON THE PART OF WHITES, AND ITfS\nWORTH REMEMDERING THAT THE VIRGINIA INSURRECTION OF\n1831 WAS LED BY Nat TURNER WHO WAS A 8 I BLE-READER , .\nmystic, a Baptist. whites wanted to make sure that\nNOTHING THAT MIGHT SOMEHOW LEAD TO REBELLION WAS\nGENERATED WITHIN THE ALL-NEGRO CHURCH MEETINGS. Bu\nTHIS IS SOMEWHAT BY THE WAY. I STARTED BY SAYING,\nIN ANSWER TC YOUR QUESTION, THAT THERE WAS MUCH\nPARTICIPATION ON THE PART OF NEGROES IN THE RELIGIC\nLIFE OF THE WHITE MASTERS. THIS PARTICIPATION HAS\nBEEN DOCUMENTED AGAIN VERY RECENTLY BY W| L LI S D.\nVEATHERFCRD IN A VOLUME ON AMERICAN CHURCHES AND TH\nNegro. Weatherford inclines to think that there\nWAS WIDESPREAD DEEP SYMPATHY AND SOLICITUDE FOR THE\nSLAVE AS A CHILD OF GcD. THE NEGRO WAS UNDER SLAVE\nACCORDING TO God’s PLAN, BUT HE WAS NONETHELESS A\nchild of God. Weatherford asserted ,’’The ante-bellu\nwhite Christians looked upon the Negro as a pcssibl\nson of God who had a right to every privilege of th\nCHURCH, AND IT DID NOT OFFEND THEM TO SEE HIM PAR¬\nTAKING OF ALL THESE PRIVILEGES; GUT POLITICALLY AND\nECONOMICALLY THE SLAVE RESTED UNDER THE CURSE AND"
}