{
  "id": "d492-138",
  "text": "-3-\nRIGHTER:\nSCHNEIDER:\nRICHTER:\nOEMS:\nHAD NO STANDI NG.’’ WEATHERFORD GOES ON TO SAY,'TAE\nOF THE PRESENT TIME HAVE REVERSED THE ATTITUDE. RE\nCLAIM THAT THE NEGRO HAS FULL RIGHTS TO ECONOMIC,\nCIVIL AND POLITICAL FREEDOMS, GUT WE ARE SURE THAT\nSOCIALLY AND RELIGIOUSLY HE MUST DE COMPLETELY SEPAR¬\nATE AND SEGREGATED. T I’M NOT QUITE SURE WHOM AE A T H E\nFORD MEANS DY ’wE'*, AND I’M SOMEWHAT INCLINED TO\nTHINK, IF • MAY SAY SC THAT HIS CONTRASTS ARE TOO\nSTARK. For ONE THING l THINK HE UNDERPLAYS THE FORC'\nOF THE WHITE MAN’S MOTIVATION TO KEEP THE NEGRO IN A\nSUBMISSIVE STATE, EVEN IF THERE WAS, AS WITHOUT DOUG'\nTHERE WAS, SOME GENUINE SINCERITY IN SEEKING TO IMDU\nthe Negro with Christianity sentiments. Yet, 'Jeathe\nFORD DOES REMIND US THAT THERE WAS AN IMPORTANT\nPRACTICE AND TRADITION AMONG SLAVEHOLDERS OF ADM ITT I\nthe Negro to the white mants worship.\nCan we switch? /hat; about- the character cf the\nNEGR O* S RELIGION?\nNegro religion in the United States has deen charac¬\nterized BY A GOOD DEAL OF EM 0T I < NAL1 SM. . . .0Y ECSTATI\nBEHAV I OR. . . .BY SH0UTING. . . .BY POWERFUL CONTAGION OF\nFEELING. This, once again, is probably connected\nWITH THE GENERALLY LOW EDUCATIONAL AND ECONOMIC\nLEVELS ACHIEVED 3Y THE NEGRO. It HAS BEEN A GENUINE\nTENDENCY, MEVERTHELESS, FROM NEGRO RELIGION CF NEGRO\nINTELLECTUALS. /ANOTHER THING ONE MIGHT MENTION, OF\nTHOSE THAT COME TO MIND, IS THE CIRCUMSTANCE THAT,\nHOW SHALL I\" PUT IT?.SO MUCH HAS BEEN DEMANDED\nAND F OUND BY THE NEGRO IN HIS RELIGION. HlSTORlCALL\nTHE CHURCH HAS BEEN TREMENDOUSLY IMPORTANT IN THE\nNegro community and Negroes have looked to it not\nONLY FOR GUIDANCE IN RELIGIOUS MATTERS BUT IN A\nTHOUSAND AND ONE OTHER THINGS. Of COURSE, THIS WOUL\nBE TRUE TO AN APPRECIABLE EXTENT FOR SOME WHITE\ngroups. But I think it’s correct enough to say that\nIN THIS MATTER OF SEEKING FOR SC MUCH--FOR SO MANY\nKINDS OF SATISFACTIONS AND CUTLETS IN HIS RELIGION,\nthe Negro is, in ivlyrdal’s phrase, \"an exaggerated\nAmer I CAN?t.\nInterestingly enough, we have some comments here by\nOr. Paul Deats of the School of Theology at Boston\nUniversity, which dear pretty directly on what ycu’v\nJUST SAID. I THINK IT’S WORTH CUR WHILE TO LISTEN\nBRIEFLY TO Or. DEATS.\nSome people have argued that the Negroes have a gen¬\nius FOR RELIGION. lfM NOT QUITE SURE AT ALL THAT\nNegroes are more emotional by nature, are more reli¬\ngious BY NATURE. BUT THEY’VE CERTAINLY IN THIS COUN\nTRY BEEN MUCH MORE RESTRICTED IN THEIR OPPORTUNITIES\nAND THIS RESTRICTION MEANS THAT IN THE CHANNELS THAT"
}