{
  "id": "d492-139",
  "text": "-4-\nARE OPEN TO THEM THEY HAVE MADE FULL USE OF THESE\nCHANNELS. AND RELIGION HAS OFFERED THEM A TREMENDOU\nOPPORTUNITY FOR SELF-EXPRESSION, FOR RECREATION,\nFOR RELEASE OF THEIR INHIBITIONS IN OTHER AREAS. It\nOFFERED THEM HELP IN ADJUSTING TO CRISES., THEY WERE\nISOLATED FROM THE GENERAL LIFE OF >ME:ICA IN A LOT c\nWAYS, AND ONE WAY IN WHICH THEY COULD ASSERT THEIR\nEQUALITY AND DEAL WITH THEIR PROBLEMS WAS TO DO IT\nIN THE CHURCHES. MOTHER THING, THEY ORGANIZED\nSEPARATE CHURCHES FOLLOWING THE ClVIL R, ALONG\nABOUT THIS PERIOD. ONE REASON THEY DID THIS WAS\nBECAUSE THEY FOUND EQUALITY IF THEY HAD A SEPARATE\nCHURCH——THEY WERE SUBORDINATE MEMBERS IF THEY WERE\nMEMBERS OF A LARGER METHOD I ST OR BAPTIST CHURCH. Bl\nTHEY HAD EQUAL STATUS IF THEY WERE MEMBERS OF THEIR\nOWN CHURCHES. THIS IS ONE WAY OF PROTESTING AGA INS'\nWHITE DOMINATION AND WHITE LEADERSHIP. ^ ND THE\nSECOND ONE, IT SEEMS TO ME, IS THAT THIS OFFERED THE:\nTHE OPPORTUNITY TO FIND LEADERSHIP EXPRESSION IN\nWAYS THAT WERE DENIED THEM IN THE GENERAL CULTURAL\nLIFE. YOU STILL FIND MORE NEGROES TURNING TO TEACH!\nAND THE MINISTRY, AS YOU HAVE FOR A GREAT NUMBER OF\nyears. These are the two main avenues of profession\nAL LIFE THAT ARE OPEN TO NEGROES. *ND ONE REASON\nYOU HAVE, IT SEEMS TO ME, WHAT YOU REFER TO AS THE\nWILD RELIGIOUS MOVEMENTS, HAS BEEN THAT THIS IS THE\nONE WAY THAT THE AGGRESSIVE LEADERSHIP OF THE NEGRO\nCOULD EXPRESS ITSELF, AND THE RESENTMENT OF THE NeG,\nCOULD EXPRESS ITSELF, IS IN THE ORGANIZATION OF NEW\nCHURCHES, OF NEW SECTS, OF NEW COMMUNITIES OF\nFOLLOWERS OF A PARTICULARLY OUTSTANDING OR, MAYBE\nYOU WANT TO SAY PARTICULARLY FRUSTRATED, INDIVIDUAL\nRICHTER: Now, I believe that is helpful in understanding\nSOMETHING OF THE CHARACTER OF NEGRO RELIGION, BUT I\nLIKE US, IF WE CAN, TO GET A SOMEWHAT MORE INTIMATE\nVIEW OF AT LEAST SOME ASPECTS OF IT. vVe MIGHT, FOR\nEXAMPLE, TOUCH C N THE MATTER OF W HAT THE NEGRO\nPREACHER HAS BEEN LIKE.\nSCHNEIDER: As you might expect, on the whole Negro preachers\nHAVE HAD VERY LITTLE EDUCATION. THEY HAVE TRADI¬\nTIONALLY BEEN RECRUITED ON THE BASIS OF THEIR CAPA¬\nCITY TO FEEL A \"CALL'* RATHER THAN ON ANYTHING RESEM\nING THEOLOGICAL EDUCATION. ' N D THE POINT IS, THAT\nTHE \"CALL’’ ALONE HAS TENDED TO BE EMPHASIZED. THEY\nHAVE FREQUENTLY, VERY FREQUENTLY, PREACHED A RELI¬\nGION THAT FITTED IN NEATLY WITH WHITE DESIRE THAT T\nNegro’s attention be fixed on the \"beyond\" and the\nTRANSCENDENT, RATHER THAN ON THE INCONVENIENT AND\nFRUSTRATING THINGS OF THIS WORLD. THESE AGAIN ARE\nNOT CHARACTERISTICS OF TENDENCIES PECULIAR TO THE\nNegro preacher, but if, for example, white Southern"
}