{
  "id": "d492-14",
  "text": "-4-\nSCHNEIDER:\nRICHTER:\nSMITH :\nRICHTER:\nSivl I TH :\nNow IVIYRDAL, IN EVALUATING THE POSITION OF THE NEGRO\nin American society uses this creed as a yardstick..*\nEVEN THOUGH HE REALIZES THAT CONDUCT BASED ON THIS :\nCREED DOES NOT ALWAYS PREVAIL IN AMERICAN LIFE*.*\nThat Americans don’t always live up to the creed.\nThe writer, Lillian Smith made quite a point of this,\nLou, when we visited her at her home in Clayton,\nGeorg i a :\nEven when I was very young,although I was sheltered\nAND PROTECTED, I BACAME AWARE OF THE FACT THAT I LIVE;\nIN A TOWN WHERE THERE WERE INVISIBLE WALLS, AND THAT\nTHOSE WALLS MEANT A GREAT DEAL TO EVERYBODY IN THE\nTOWN. I THINK I FOUND OUT IN CHURCH, WHEN I WAS QUITE\nSMALL, WHEN I REALIZED THAT MY LITTLE COLORED PLAY¬\nMATES - AND EVERY SOUTHERN CHILD HAD COLORED PLAY¬\nMATES - THAT THEY DIDN’T GO TO MY CHURCH. THAT IN\nMY NICE BIG CHURCH THERE WERE ONLY WHITE people-white\nFACES. NOW, I DIDN’T TALK TO MY SELF ABOUT IT IN\nWORDS - I DON’T THINK A CHILD DOES THAT. I ... I FELT\nIT. AND I WONDERED ABOUT IT. ...I ALSO REALIZED THAT\nTHESE INVISIBLE WALLS WERE UP, WHEN AFTER PLAYING WITH\nMY LITTLE COLORED FRIENDS FREELY, BUT ALWAYS IN THE\nBACK YARD, I WAS TOLD THAT I WAS TOO OLD TO HAVE L\nLITTLE COLORED FRIENDS, AND.\nAt what age did this occur?\nOh, it must have been about nine or ten I’d say. And\nI remember saying ”why Mother, Why Dad, Why is this\nTRUE0”...AND ALWAYS THE ANSWER WAS . . . ”Y0U’ RE TOO YOUN,\nTO KNOW, BUT SOMEDAY YOU WILL UNDERSTAND THAT IT’S\nIMPOSSIBLE FOR YOU TO CONTINUE TO SEE YOUR LITTLE\nPLAYMATES”. AND THIS DEEPLY TROUBLED ME. It HURT ON\nA VERY PERSONAL LEVEL OF MY LIFE. ..THE LEVEL OF :\nfriendship. And I didn’t understand it...I didn’t\nKNOW WHAT IT WAS ABOUT, BECAUSE AT THE SAME TIME THAT\nTHESE INVISIBLE WALLS WERE BEING CONSTRUCTED BETWEEN\nME AND THE WORLD... AND AS MUCH OF THE WORLD I WAS ALSO\nBEING TRAINED TO BE A GOOD LITTLE AMERICAN. I WAS\nALWAYS TOLD THAT DEMOCRACY IS A WONDERFUL THING. And\nI WAS ALSO TOLD THAT YOU MUST TREAT EVERYONE DECENTLY\nAND WITH COURTESY BECAUSE ALL PEOPLE ARE HUMAN BEINGS\nAnd although I was told that, and also that as a\nChristian one believes in kindness and brotherhood..,\nAND SO I WAS LEARNING THE LESSONS OF THE CHRISTIAN\nRELIGION, AND THE LESSONS OF DEMOCRACY, BUT AT THE\nSAME TIME I WAS LEARNING THE LESSONS OF SEGREGATION\nBETWEEN THE TWO RACES."
}