{
  "id": "d492-145",
  "text": "-10-\nFORTHRIGHT STAND ON THE MATTER, FROWNING ON SEGREGATI\nIN CHURCHES. THE FEDERAL COUNCIL OF CHURCHES, (NOW\nknow as the National Council of Churches of Christ in\n• merica) pledged its constituent denominations in\n1946 TO WORK FOR A N0N-SEGREGATED CHURCH IN A NCN-\nSEGREGATED SOC I ETY. . . .WH I CH IS SURELY SOME KIND OF\nINDICATION OF THE PROTESTANT DIAS AT THE NATIONAL\nLEVEL. Leading PROTESTANT theologians, like Rheinhol\nNieduhr, allow no doubt of their STaND which is\nUNAMBIGUOUSLY A NT I-SEGREGAT I ON I ST. \\ N T1-SEGREGATI ON\nLITERATURE IS BEING WRITTEN BY CLERGYMEN WHO ARE WELL\nINFORMED ON VARIOUS FACETS OF THE RACIAL PROBLEM.\nGOOD EXAMPLE OF THIS IS A RECENT VOLUME BY KYLE HAZEL\nden on The Rac i al Problem in Christian Perspective.\nYet, this is all accompanied by great difficulties.\n>T LOCAL LEVELS, MEN DO STAND IN DANGER OF LOSING\nTHEIR PULPITS IF THEY COME ;UT FORTHRIGHTLY AGAINST\nSEGREGATION IN THE CHURCHES, AND SOME HAVE ALREADY\nLOST THEIR PULPITS. The IDEA OF DESEGREGATION IN THE\nCHURCHES IS NOW, FOR MANY IN THE SOUTH, AND FOR THAT\nMATTER IN THE NORTH AS WELL, A RELATIVELY NOVEL ONE.\n' L S 0, W E ’ V E GIVEN SOME STRESS IN THIS PROGRAM TO HOW\nMUCH HIS CHURCH HAS MEANT TO THE NEGRO. I DON* T THIN'\nTHERE’S ANY DOUBT THAT THE NEGRO WANTS TO FEEL FREE T\nGO WHERE IT PLEASES HIM TO GO, WANTS TO FEEL FREE TO\nATTEND WHITE CHURCHES IF HE IS SO INCLINED, AND WOULD\nWELCOME THE OPPORTUNITY TO DC SO....AT LEAST WHEN THE\nMOOD TO DO SO COMES UPON HIM. NEVERTHELESS, I CAN\nCONCEIVE THAT THE NEGRO MAY WELL CONTINUE FOR SOME\nTIME TO SHOW STRONG ADHERENCE TO HIS OWN CHURCHES. I\nHOPE THIS WON’T BE MISUNDERSTOOD, AND I TRUST I’M\nBEING PERFECTLY CLEAR ON THE POINT THAT NEGROES DO NO'\nWANT PREJUDICE OR DISCRIMINATION TO BE SHOWN THEM IN\nTHIS AREA ANY MORE THAN IN ANY OTHER,\nRICHTER: 'Gain, it’s not so much the desire of the Negro to\nBECOME A PART, AN INTIMATE PART OF THE WHITE C OMMUNI T'\nAS IT IS HIS DESIRE TO MEET NO PREJUDICE OR DISCRIMIN\nATI ON FROM MEMBERS OF THAT COMMUNITY. 'T THE POINT\nI’D LIKE TO REVERT TO THE COMMENT BY H. RlCHARD NlEBU\nWHICH I MENTIONED AT THE BEGINNING OF TODAY’S PROGRAM\nTO THE EFFECT THAT THE CHURCHES HAVE BEEN UNABLE TO\nWEAVE A SINGLE GARMENT OF CHRIST TO FIT THE SEAMLESS\nVESTURE OF H|s SPIRIT. THIS IS SOMETIMES BROUGHT HOM\nTO US WITH SPECIAL POIGNANCY. I’D LIKE US TO LISTEN\nFOR A MOMENT TO THE REVEREND l)aN VhITSETT, AN ALABAMA\nPASTOR WITH WHOM I SPOKE ABOUT THE SEGREGATION PROBLE\nIN THE CHURCH IN THE SUMMER OF 1958. REVEREND ^HIT-\nSET T ’ S STATEMENT SERVES TO REMIND US OF SOMETHING THA'\nI THINK WE NEED TO BE CONSTANTLY REMINDED OF....NAMEL\nTHAT >M E R I CAN ACTION IN RELATION TO THE NEGRO IN ANY\nSPHERE, IS LIKELY TO BE ATTENDED TO BY PEOPLE IN THE\nMOST REMOTE PARTS OF THE WORLD,"
}