{
  "id": "d492-146",
  "text": "-II-\nHITSETT:\nSCHNtiDER :\nRICHTER:\n\\N ANNUAL CONFERENCE MET IN MONTGOMERY AG CUT THREE\nYEARS AGO AND PASSED A RESOLUTION UPHOLDING SEGREGA¬\nTION. The very next day, that story was printed on\nTHE FRONT PAGE OF ONE OF THE LARGEST NEWSPAPERS IN\nSouthern Rhodesia. I heard from that missignary--sh\nWAS FROM >LADAMA—AND SHE STATED THIS IN HER LETTER\nTHAT THE PRGPLE WITH WHOM SHE WORKED CAME TC HER WIT.\nTHIS NEWS ACCOUNT AND SAID ”<HY IS IT THAT YOU TELL\na gout Christ, and that we are one in Him, but your r\nchurch in Alabama has passed a resolution that ur\nPEOPLE COULD NOT EVEN WORSHIP WITH YOU?” ^ ND THE\nMISSIONARY SAID, ” I FRANKLY HAVE NO ANSWER,” I HAD\nNO ANSWER. i N D THEN LAST FEBRUARY I HAD A RETURNED\nMISSIONARY FROM.... TO SPEAK IN MY PULPIT HERE. He I\nNOW RETIRED AND COME BACK TC THE STATES TO LIVE. He\nRELATED AN INCIDENT IN A NEARBY STATE WH E*R E THERE WA\nA LARGE SETTLEMENT OF CHINESE. 3UT THE NEAREST\nCHURCH WOULD NOT ALLOW ONE OF THE CHINESE TO COME l>\nAND WORSHIP WITH THEM. <ND THEN HE SAID,”IN MOST CF\nYOUR CHURCHES YOU W ULD NOT PERMIT ONE NEGRO TO C(ME\nIN AND WORSHIP WITH YOU.” 3UT WHAT IMPRESSED ME WAS\nWHEN HE BOWED HIS HEAD AND SAID, ”iVlY GoO, HAVE I\nGIVEN MY LIFE IN VAIN? I SPENT 17 YEARS IN CHINA AND'\nthe Far East and three years in \\frica telling those\nPEOPLE TH \\T God WAS THE FATHER OF US ALL, ,.ND THAT W\nARE QRCTHERSAND SISTERS IN JESUS CHRIST AND THEN I\nCOME TC MY OWN HOME AND FIND THAT WE DC NOT PRACTICE\nWHAT WE PREACH.” NoW THAT’S BOUND — HE RELATED THAT\nSTORY—THAT’S BOUND TO BE EFFECTIVE IN CUR OWN MINDS\nAND HEARTS WHEN WE SEE THE INCONSISTENCY.\nThere are re verber at i ons in the world, .and the Unit\nStates itself is undoubtedly in the process cf chang\nIN RESPECT TO THE NEGRO PROBLEM. Pe.HAPS WE CAN DO\nBETTER, AS REGARDS THIS PRESENT PROGRAM, THAN TO END\nIT WITH THE REPETITION OF A PHRASE THAT fVlYRDAL USED\n1944, WHICH MOST CERTAINLY HAS AS MUCH FORCE TODAY A\nWHEN HE EMPLOYED IT. It IS VERY SHORT AND TC THE\npoint: ”The Negro protest is still rising.*’ -hen\nONE HEARS A PORTION OF A SPEECH SUCH AS ’E HEARD A\nFEW MINUTES AGO FR ' M THE REVEREND, THE IMPRESSION TH\nTHIS STATEMENT IS TRUE IS SIMPLY REINFORCED.\nToday, then, it seems clear that the Negro, increas¬\ningly, NO MORE WANTS DISCRIMINATION AGAINST HIM IN\nTHE CHURCH NO MORE THAN ANYWHERE ELSE. H|S PROTEST\nDEFINITELY EXTENDS TO THIS FIELD, AND THE PROTEST IS\nRECEIVING SUPPORT, AT THE VERY LEAST, AT THE LEVEL 0\nTHE PRINCIPLES AND RESOLUTIONS OF NATIONALLY IMPORT¬\nANT WH IT E CHURCH BODIES. 0 N C E MORE, IT APPEARS THAT\nMAJOR NATIONAL AGENCIES, IN THIS CASE NOT THE GOVERN\nMENT BUT THE CHURCHES, ARE IN PRINCIPLE DEDICATED TO\nthe Negro’s cause, ,/e invite you to j in us next\nweek as we continue to discuss the Negro in America,\n’’The Last C i t i zen . ”"
}