{
  "id": "d492-148",
  "text": "THE L ST CITIZEN\nROGRAM i! I 4\n'■The Negro Society and\nCulture'’\nJournalism and Hrt\nPR\\TT1S:\nSegregation deprives Negroes of a developing life\nEXPERIENCE. The JOURNALIST, AND NEGROES IN MOST\nPROFESSIONS REQUIRING THE SKILL AND KNOWLEDGE THAT\nCOME FROM EXPERIENCE AND ASSOCIATION, SUFFERS FROM\nTHIS SEGREGATION. The NeGRC JOURNALIST STARTS OFF\nWITH THE ODDS WEIGHTED AGAINST HIM.\nFORD:\nNow HE HATED DIALECT. He DID NOT WANT TO WRITE DIA¬\nLECT. But the public expected that, and they felt\nTHAT THAT WAS THE KIND OF NEGRC GENUINE STYLE, AND IF\nHE DID ANYTHING ELSE IT WAS ENTIRELY IMITATIVE.\nMUSIC:\nSTINGER\n.\\NNCR :\nOUR GUESTS TODAY ARE THE PUBLISHER OF A NEGRO NEWS¬\nPAPER AND A PROFESSOR OF ENGLISH, AUTHOR, AND EDITOR\nOF A NUMBER OF BOOKS OF INTEREST TO STUDENTS OF NEGRO\nLl TE .ATURE, AS WE TAKE UP THE MATTER OF NeGRC JOURNAL\nism and Negro art in fur continuing discussion cf the\nCulture of the Negro in -merica, ‘’The Last Citizen.5’\nMUSIC:\nSTINGER\nNCR:\nThe Last Citizen: The Negro in \\merica. A series of\nPROGRAMS DEVOTED TO THE EXTENSION OF OUR KNOWLEDGE OF\nTHE LARGEST MINORITY GROUP IN THE UNITED STATES, ITS\nPROBLEMS, AND THE PROBLEMS IT POSES TO ALL AMERICANS,\nThe Last Citizen is produced by Radio Station i3\nPurdue University, under a grant from the Educational\nTelevision and Radio Cente;, in cooperation with the\nNational -association f Educational Broadcasters. Tl\ndiscussants are the producer of the series, E. W.\nRichter, and Dr. Louis Schneider, Professor of Soci¬\nology at Purdue University. TodAvY’s program: Negro\nJournalismAnd Negro \\rt. Here, now, is Mr. Richter.\nRICHTER:\nToday, in examining Negro culture we want to look in-\nTHE SPECIFIC FIELDS OF JOURNALISM AND THE ARTS. J'Efl\nSPEND MOST OF OUR TIME ON JOURNALISM, BECAUSE IT,\nTOGETHER WITH ITS SUB-ARTS, SUCH AS THE ART CF CARTC\nING, 1S SO CLEARLY SOMETHING DESIGNED FOR WIDE-SPREAD\nPOPULAR CONSUMPTION. NcW, IN ANY CF THE THINGS WE* LI\nBE SPEAKING ABOUT TODAY, DISCUSSION COULD GO ON INDE¬\nFINITELY. Our only hope of getting s me sort of ne¬\ncessary LIMITATION IS TO CONFINE URSELVES TO PARTI¬\nCULAR THEMES. -'HAT THEME MIGHT WE ADDRESS OURSELVES\nTO, WOULD YOU SAY, LOU, IN DISCUSSING JOURNALISM?\nSCHNEIDER:\n1 THINK IT WOULD BE MOST ADVISABLE TO ADDRESS OURSEL'"
}