{
  "id": "d492-15",
  "text": "-5-\nSCHNEIDER:\nI think Miss Smith makes the fact of a certain dualit\nin American life quite vivid for us. Against a back¬\nground OF THIS DUALITY...ON THE ONE HAND COMPLETE\nADHERENCE TO THE AMERICAN CREED, AND ON THE OTHER\nCOMPLETE REJECTION OF IT.WITH MOST OF US FALLING\nIN OUR BEHAVIOR, SOMEWHERE IN BETWEEN...LET ME TRY TO\nEXTEND WHAT MyRDAL HAS TO SAY ABOUT THE AMERICAN CREE\nIN RELATION TO TYPES OF PERSONALITY AND IN TERMS OF\nprejudice. This way, perhaps, we can understand why\nit is that \"nice people1' are prejudiced. Let’s first\nOF ALL CONSIDER THE ONE SIDE OF THE DUALITY - THE\nUNEQUIVOCAL ACCEPTANCE OR THE VALUES EXPRESSED IN THE\nAmerican Creed. Now, if we could find a person who\nGAVE THESE VALUES UNEQUIVOCAL ACCEPTANCE, HE WOULD,\nIDEALLY BE I NCAPABLE . . .COMPLETELY I NCAPABLE . . .0F PRE¬\nJUDICE. IF SOMEONE WERE TO PRESENT THIS PERSON WITH\nA THEORY. ..A RACIALISTIC THEORY, REPLETE WITH ’’PROOFS\nSUPPOSEDLY SHOWING BEYOND A DOUBT THAT THE NEGRO WAS\nI NFER I OR. . .TH I S PERSON WOULDN’T FIND ANY ATTRACTION\nIN SUCH A THEORY, EVEN THOUGH IT MIGHT APPEAR TO JUST\nI FY PREJUDICE AND DISCRIMINATION. He MIGHT WELL RE¬\nSPOND BY SAYING, ” I F THE NEGRO DOES NOT HAVE OUR CAP¬\nACITIES IT IS OUR DUTY TO SEE TO IT THAT OUR UNFORT¬\nUNATELY HANDICAPPED BROTHER IS GIVEN SPECIAL OPPOR¬\nTUNITIES AND PROTECTION.1’ GoiNG TO THE OTHER EXTREME\nOF THE DUALITY WE FIND THE PERSON WHO IS IN NO WAY\nINVOLVED WITH THE VALUES OF THE AMERICAN CREED. He\nTAKES FROM LIFE AND THE WORLD WHAT HE WANTS AND CAN\nGET WITH NO REGARD TO ANYONE ELSE, AND WITH NO QUALMS\nOF CONSCIENCE WHATEVER. JUSTICE, DEM 0CRACY . . . SUCH\nWORDS HAVE ABSOLUTELY NO MEANING FOR THIS PERSON.\nIN THE CASE OF THE NEGRO, HE’LL MAKE WHATEVER GAINS\nHE ICAN AT THE N : EQRo’ S EXPENSED';. IT1 S CONVENIENT\nENOUGH TO SAY ECONOMIC, SEXUAL, AND PRESTIGE GAINS.\nBut REGARDLESS OF WHAT GAINS HE MAKES OR WHAT HE\nMAKES OR WHAT HE DOES TO MAKE THOSE GAINS, HE DOES\nWHAT HE DOES WITHOUT A S|NGLE THOUGHT ABOUT THE RIGHT\nNESS OR WRONGNESS OF HIS ACTS. NOW, WOULD SUCH A PER\nSON... IF SUCH A PERSON EXISTED, ..BE AT ALL ATTRACTED\nBY THE RACIALIST THEORY WE SPOKE OF EARLIER? THE\nTHEORY THAT PURPORTS TO SHOW THAT THE NEGRO IS BORN\nTO BE THE WHITE MAN’S SERVANT AND SUBORDINATE? THE\nANSWER, I THINK, IS NO. He HAS NO NEED FOR SUCH A\nTHING. TO MAKE MY POINT CLEARER, LET’S COMPARE THIS\nCONSCI ENCELESS , EXPLOI TAT I VE PERSON WITH A GREAT JUNGL\nCAT THAT MAKES A FINE LIVING FROM THE HUNTING OF DEER\nOne day this cat is visited by man...a man who has\nWRITTEN A BOOK. AND THE BOOK PROVES ’’THAT ALL ANTE¬\nLOPES WERE CREATED FOR THE SPECIAL PURPOSE OF PROVID¬\nING SPORT AND NOURISHMENT FOR THE GREAT CAT”. JhAT’s"
}