{
  "id": "d492-150",
  "text": "-3-\nThat is what happens to the Negro, except in exasper\nATINGLY FEW INSTANCES, IN THE IMPRISONMENT OF PHY¬\nSICAL, SOCIAL, AND CULTURAL SEGREGATION.\ni/hy don’t Negroes have daily newspapers? Some of tk\nANSWER TO TH;\\T QUESTION IS FOUND IN THE PROD LEM OF\nORGANIZING OF CAPITAL FOR ANY ENTERPRISE, In THE\nFIRST PLACE, THE NEGRO IS MORE OR LESS IMPOVERISHED\nIS A MORE CR LESS IMPOVERISHED SEGMENT OF THE AmER'C\nCOMMUNITY. '-HITES WHO REPRESENT THE GOING CULTURE ,\nTHE CULTURE THAT FLOWS FREELY AMONG THEMSELVES AND\nOTHER SIMILAR PEOPLES, HAVE THE MONEY THAT COUNTS.\nJY ANY STANDARD OF MEASUREMENT, THE NEGRO IS POOR,\nVery poor. If he determines to go into any kind of\nBUSINESS UNDERTAKING, HE MUST DEPEND UPON HIS CWN\nMEANS AND THOSE CF HIS FELLOWS,, IN AS MUCH AS HE\nDOESN’T HAVE MUCH AND HIS FELLOWS DON’T HAVE MUCH\nAND HIS FELLOWS DON* T HAVE MUCH, HE CAN NEVER ASSEMD\nMUCH CAPITAL, • ITH A SMALL CAPITAL INVESTMENT COM: N\nFROM WITHIN HIS SEGREGATED COMMUNITY, ANY BUSINESS\nUNDERTAKING HE STARTS MUST DE SMALL. It REQUIRES\nMUCH MORE CAPITAL THAN NEGROES CAN REASONABLY DE\nEXPECTED TO PROVIDE TO START A DAILY NEWSPAPER,\nEVEN IF THEY GOT TOGETHER SUFFICIENT CAPITAL FOR SUCI\nA VENTURE, THE RISK WOULD 3E GREAT. - \\ N Y SUCH PROMC'T\nWOULD HE IN COMPETITION WITH THE GREAT QA||_!ES„ He\nWOULD HAVE PROJECTED HIMSELF INTO THE LARGER FIELD.\nThen he would find several things happening, all the\nRESULT CF SEGREGATION. THE NEGROES WOULD DE SLOW TO\nPURCHASE HIS PAPER DECAUSE, SEGREGATED AS THEY ARE,\nTHEY HAVE BECOME ACCUSTOMED TC EXPECT THE PRODUCT OF\nTHE DOMINANT CULTURE TO DE BETTER. THE WHITES WOULD\nNOT BUY HIS DAILY DECAUSE IT IS NATURAL FOR THEM NOT\nTC EXPECT A PRODUCT PRODUCED DY A NEGRO TO DE AS\nGOOD AS A SIMILAR PRODUCT PRODUCED DY WHITES- Thus\nthe Negro daily newspaper publisher, if he chance to\nFIND SUFFICIENT CAPITAL TO START A DAILY, WOULD SOON\nFIND HIS CIRCULATION, AND CIRCULATION INCOME, JEOPAR¬\nDIZED DY DL1GHTFUL MIND-SETS WHICH ARE CHARACTER I ST:\nOF THE PATTERN OF SEGREGATION. THIS NEGRO PUDLISHER\nOF A DAILY NEWSPAPER WOULD 3E EVEN WORSE OFF WHEN HE\nTACKLED THE PR CD LEM OF REVENUE FROM ADVERTISING.\nMost Negro businesses are so small and of such a\nNATURE THAT THEY CANNOT AFFORD TO ADVERTISE IN A\ndaily. Therefore, our Negro publisher would have to\nTURN TO WHITES. OUT THEY ADVERTISE IN THEIR OWN\nPAPERS, THEY HAVE ONLY SO MUCH MONEY TO INVEST IN\nADVERTISING. The NEGRO PUDLISHER WOULD BECOME A\nCOMPETITOR CF WHITE PUBLISHERS FOR THAT UNEXPANDAOLE\nMAXIMUM. RHEN THE WHITE PUBLISHERS GOT THROUGH WITH\nIT, ENJOYING THE BENEFITS OF SOCIAL AND OTHER EQUAL I \"\nTHAT THEY DO, THERE WOULD BE PRECIOUS LITTLE LEFT FOP\nthe Negro publisher. The Negro publisher would fail\nThe whites would say that the Negro publisher did no-\nHAVE THE KNOW-HOW, IN WHICH THEY WOULD BE PARTLY R!GI\n■ \\nd the Negroes who had lost their money, dubious"
}