{
  "id": "d492-154",
  "text": "-7-\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nDell, there’s Langston Hughes, the famous Negro write\nwith his perhaps equally famous creation, '’Simple,*’\nwho has enlivened the Defender, Here, on November 8,\n1958, we find Simple discussing the subject of cats a\nand dogs. His arresting theme is that Harlem has\nhardly enough room for humans, much less for cats\nand dogs. On March 21, 1959, Simple tells us what he\nWOULD DO IF HE WERE PRESIDENT. AND HERE, THERE DOES\nSEEM TO BE SOME IMPLICIT CRITICISM OF THE ADMINISTRA¬\nTION, AND PERHAPS, ALSO, A TINGE OF PROVINCIALISM.\nIn any case, Simple would pay some attention to home\nrace problems. Instead of talking about a conference\nat the ‘’Summit, l? how about a conference at the '’ootto-\nwhich is Little Pock? On another accasion, Simple\ncontemplates becoming Moslem. He thinks to progress\nfrom N TO ivl-N STANDS FOR NEGRO, M FOR MAN, BuT THE:;\nwould be practical difficulties which stay him....\ndifficulties like getting his Baptist wife to accept\nTHE CHANGE.\n■ ANOTHER writer whose material has appeared in the\nDefender is Enoch P. Waters. Under the title ,,<-'Dven¬\ntures in Race Relations'* on November 8, 1958, Mr.\nRaters notes that with schools closed, Negro and\nWHITE CHILDREN ARE FINALLY GETTING THE SAME THI NG — Nr\nEDUCATION AT ALL. On FEBRUARY 28, 1959, Mr . v'ATERS\nDIS USSES THE FORMS OF RATIONALIZATION NEGROES HAVE\nDEVELOPED ABOUT THEIR RACE TO HELP THEMSELVES ACCEPT\nTHE FACT THAT THEY ARE BLACK. ^N APRIL 4, 1959, IT\nAPPEARS THAT THOUGH NO NEGRO FIGHTER HAS BEEN KNOWN\nBY A COLOR NICKNAME IN RECENT YEARS, ^ATE RS EXPECTS,\nIN KEEPING WITH THE TIMES, FOR ONE OF MIXED PARENTAGE\nTO BE NAMED ” I N T E G R A T E D‘* KQCKEY JOHNSON. On OeCEMBE,\n6, 19 58, Mr. Baters tells the story of a Negro U.S.\nMarshall, a story intended to show that if you are a\nNegro you have a racial problem, no matter what your\njob .\n1 don’t soubt that you could go on, Lou, but I think\nWE NOW HAVE A PRETTY GOOD NOTION OF WHAT THE MATERIAL\nYOU’VE BEEN DISCUSSING IS LIKE. WOULD YOU CARE TO\nGIVE US A ORIEL STATEMENT OF HOW YOU THINK NEGRO\nNEWSPAPERS FUNCTION FOR THEIR READERS?\nI’D LOVE TO BE ABLE TO ANSWER THAT QUESTION WITH\nFULLNESS AND PRECISION. 1 CAN’T DO SO, AND l*LL\nLIMIT MYSELF TO SOME OF THE MORE OBVIOUS ’’POSITIVE*’\nKINDS OF THINGS. EVIDENTLY NEWSPAPERS LIKE THESE\nCONSTITUTE A MEDIUM OF EXPRESSION. THEY PRESENT\nSYMBOLICALLY SIGNIFICANT FIGURES LIKE OUR FRIEND\nSimple to speak for the Negro They fight for the\nNegro’s rights, they sharpen his understanding, they\nRALLY HIM TO THE SUPPORT OF AGENCIES THAT ARE HELPFUL\nTO HIM. ON THE WHOLE, I WOULD BE INCLINED TO SAY TH\nTHEY ARE EFFECTIVE IN BUILDING UP NEGRO MORALE IN TH\nFIGHT AGAINST SEGREGATION, SI SCR IM I NATI 0N AND PRE-\nJUDICE."
}