{
  "id": "d492-155",
  "text": "-8-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nFORD:\n. v; E NOW HAVE SOME UNDERSTANDING OF THE LIMITATIONS\nplaced on Negro journalism in te ms of structure and\nCONTENT. ...AND TURNING FROM THIS, WHAT WE MIGHT CALL\nPRACTICAL, ART FORM TO THE FINE ARTS, WHAT CAN WE SAY\nABOUT THE NEGRO’S CONTRIBUTION IN THE LATTER AREA?\n'HAT SORT OF LIMITATIONS HAVE BEEN PLACED ON THE\nNegro, and how have these limitations affected his\nARTISTIC EFFORTS?\nThe Negro has made significant contributions in the\nSPHERE OF THE ARTS. He HAS SHOWN DEFINITE POETIC\nTALENT. His contribution to music,as is well known,\nIS DISTINCTIVE AND VERY HIGHLY PROVOCATIVE. ALMOST\nANY COMPREHENSIVE REVIEW OF THE WORK OF THE NeGRO IN\nTHE ARTS WOULD ALSO FEATURE CONTRIBUTIONS IN THE NOVC\nTHE DRAMA, THE DANCE, FOLKLORE, PAINTING, SCULPTURE0\nSUT THERE HAVE, WITHOUT QUESTION, BEEN LIMITATIONS.\nOne of the outstanding ones, I would say, is simply\nthis. The Negro in the United States has been, by a\nkind of social necessity, so preoccupied with the\nRACIAL PROBLEM AS SUCH, THAT A VERY, VERY GREAT DEAL\nOF HIS WORK IN THE VARIOUS FIELDS OF ART HAS CONCEN¬\nTRATED UPON SPECIFICALLY RACIAL THEMES. ONE MIGHT QP\nWITH REGARD TO THIS, THAT THERE HAVE BEEN MANY TALEN\"\nMEN AND WOMEN WHOSE ABILITIES MIGHT HAVE BEEN CONCEN\nTRATED UPON MATTERS OF INTEREST TO ALL ARTISTS, AND t\nCONSUMERS OF ART, BUT WHO WERE SOMEWHAT TRAGICALLY\nCONFINED TO RACIAL SUBJECTS ALONE. PARTLY THE PRE¬\nOCCUPATION COMING OUT OF SOCIAL NECESSITY, WHICH 1TVE\nMENTIONED, IS RESPONSIBLE FOR THIS. PARTLY, ALSO. I\"\nHAS BEEN DUE TO EXPECTATIONS ON THE PART OF WHITES\nWHO HAVE TENDED TO THINK THAT THE NEGRO SHOULD BE\nEXCLUSIVELY CONCERNED WITH T I IF THINGS OF THE NeGRO.\nPartly it has been bound up with the attitudes o>\nNeGRO PUBLICS WHICH, CONSTRAINED AND PRESSURED BY THf\nSAME GENERAL MILIEU WHICH HAS CONSTRAINED THE A R TI ST _\nHAVE ALSO EXPECTED, OR EVEN DEMANDED, THAT THE NEGRO\nARTIST CONFINE HIMSELF TO THE VITAL RACIAL THEMES.\nYOU SPEAK ABOUT WHITE EXPECTATIONS, LoU, AND I NOTICE\nALSO THAT ONE OF THE FIRST THINGS YOU MENTIONED WAS\npoetry. Some time ago I had the opportunity to spea;\nwith Nick Aaron Ford, head of the Department of\nEnglish at iviorgan State College at Baltimore, Marylai\nAND AUTHOR AND EDITOR OF A NUMBER OF BOOKS OF INTERE5\nTO THE STUDENT OF AMERICAN NEGRO LITERATURE. Dr0 Fo'\nSHOWS US HOW, IN THE PARTICULAR CASE OF ONE NEGRO\nPOET OF ABILITY, STEREOTYPED EXPECTATIONS ON THE PAR\nOF OTHERS LED TO A DEEP PERSONAL HURT »\nDuring the post-Civil War period up to World Aar M--\nthink we might stop there, because after World vVar I\nTHINGS CHANGED CONSIDERABLY,--BUT IF WE TAKE THE POS"
}