{
  "id": "d492-156",
  "text": "SCHNEIDER:\n_g_\nCivil /ar period, one of the major limitations on the\nNegro’s artistic contributions was the refusal of thf\n'ME! 1 CAN PUBLIC TO ACCEPT AS GENUINE ANY ARTISTIC\nCREATION THAT DID NOT CONFORM TO THE NEGRO STEREOTYPE\nThe tragedy of Paul Laurence Dunbar, a talented Negro\nPOET WHO DIED AT THE AGE OF 34, IS A GOOD EXAMPLE.\nDuring the 12 year period from his 22nd birthday to\nHIS DEATH, HE WROTE 4 VOLUMES OF POEMS, 4 VOLUMES OF\nSHORT STORIES, AND 4 NOVELS. BUT DESPITE THE HIGH\nQUALITY OF HIS INTELLECT AND HIS CRAFTSMANSHIP, THE\nCRITICS AND THE PUBLIC INSISTED ON JUDGING HIM EX¬\nCLUSIVELY BY HIS DfALECT 'PIECES. NoW HE HATED\nDIALECT. HE DID NOT WANT TO WRITE IN DIALECT. 3uT\nTHE PUBLIC EXPECTED THAT, AND THEY FELT THAT THAT\nWAS THE KIND OF NEGRO GENUINE STYLE, AND IF HE DID\nANYTHING ELSE IT WAS ENTIRELY IMITATIVE. In FACT,\nLouis Untermeyer, in his anthology of ^me ican Poetrv\nSince 1900, says, and I’m quoting....I’d like to\nQUOTE HIM HERE, BECAUSE I THINK IT’S VERY IMPORTANT\nTO SEE HOW THESE ATTITUDES HAVE PERSISTED. LoUIS\nUNTERMEYER SAYS, ” I N PURELY CREATIVE WORK THE NeGRO\nSEEMS TO SUFFER FROM AN INHIBITION THAT PREVENTS HIM\nFROM EXPRESSING HIS OWN EMOTIONS. INSTEAD OF GIVING\nFREE REIN TO A VISION SHARPLY DIFFERENTIATED FROM TH,\nOF HIS WHITE COMPATRIOTS, HE IS TOO OFTEN CONTENT TO\nAPE'THEIR GESTURES, THEIR INFLECTIONS, TOO ANXIOUS T\nIMITATE WITH A STAMMERING COMPLACENCE THEIR OWN IMIT¬\nATIONS. Instead of being proudly race conscious, he\nis too often merely self-consc i ous .Unquote. Now,\nTO ILLUSTRATE HIS POINT OF VIEW. UNTERMEYER PRAISES\nAS '’NATIVE AND GENUINELY EMOTIONAL” A DEATH SONG BY\nDunbar which is only a rhythmic jingle in dialect,\nOVERBURDENED WITH SENTIMENTALITY, WHILE HE CONDEMNS\nAS MAUDLIN AND IMITATIVE :,J>H|PS THAT PASS IN THE\nNight1’ by the same poet, a poem of universal appeal\nTHAT MAKES A POWERFUL APPLICATION OF IDEAS TO LIFE,\nBUT ONE WHICH IS WRITTEN IN LITERARY ENGLISH RATHER\nTHAN DIALECT. THE HEART-BROKEN POET, DYING FROM\nTUBERCULOSIS, EXPRESSED HIS FEELING ABOUT SUCH AN\nATTITUDE IN THE FOLLOWING LINES: ”He SANG OF LIFE,\nSERENELY SWEET/ WITH NOW AND THEN A DEEPER NOTE/ Fr0I'\nSOME HIGH PEAK, NIGH, YET REMOTE/ He VOICED THE WORLL\nABSORBING BEAT./ He SANG OF LOVE WHEN EARTH WAS YOUN=\nAnd love itself was in his lays/ But ah, the world i\nTURNED TO PRAISE/ ' JINGLE IN A BROKEN TONGUE./” You\nSEE, THAT WAS HIS REACTION TO BEING FORCED TO WRITE\nDIALECT.\nI know that Dr. Ford is well aware that there has bee\nSOME MITIGATION OF THIS SITUATION. He AMD OTHERS\nMIGHT MENTION CASES LIKE THAT OF WlLLARD MOTLEY, A\nNOVELIST WHO HAS BROKEN QUITE FREE OF LIMITATION TO\nNegro themes. Cases like that of the writer Fr ,nk\nYerby, also a novelist, who has broken free of racia"
}