{
  "id": "d492-16",
  "text": "-6-\nRICHTER:\nSCHNEIDER\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER\nREACTlON OF THE CAT? He1S SIMPLY NOT INTERESTED.\nHe reflects briefly that the deer do make good\nSPORT AND ARE GOOD TO EAT, BUT THEN HE FEELS HUNGRY,\nAND WITHOUT WASTING TIME ON JUSTIFYING HIMSELF BY A\nSUPPOSED PHILOSOPHY, EliT.HER, R OUNCE'S- ON THE NEXT' OH&E'R,\nTHAT -COM.es ALONG ,--0-.R. F-CR-*WA'.NT OFi THE DEER' EATS' TH'EAJVIAN\n(TO HI'M, FRESH MEAT IS FRESH MEAT. AND THAT1 S SOME*\nTHilN.G LIKE THE CASE OF OUR SECOND CATEGORY OF PERSONS\n^W-Pj WITHOUT THE SLIGHTEST QUALMS OF CONSCIENCE EX¬\nPLOIT the Negro...or anyone else that comes along...\nIN ALL WAYS POSSIBLE WITH NO ATTEMPT TO RATIONALIZE\nBEHAVIOR BY INSISTING ON THE SUPPOSED INFERIORITY OF\nTHE I R VICTIM.\nYour point then is that most of us fall somewhere\nBETWEEN THE TWO EXTREMES THAT YOU’VE JUST DRAWN. We\nMAY BE EXPLOITATIVE, BUT WE HAVE A NEED TO JUSTIFY\nTHIS EXPLOITATIVE BEHAVIOR,\nExactly. Our third category of individuals is made\nUP OF the ‘’nice people ’.. .the people who are at\nLEAST PARTIALLY IMBUED WITH THE VALUES OF THE\nAmerican Creed...who believe in justice and democracy\nBUT ARE AT THE SAME TIME WILLING TO MAKE THE GAINS WE\nSPOKE OF AT THE EXPENSE OF OTHERS...IN THE CASE OF\nOUR DISCUSSION, THE NEGRO.\n’.A/ELL, I THINK, PERHAPS, YOU MIGHT CLARIFY WHAT IT IS\nTHAT YOU MEAN BY GAINS, LOU.\nI’ll give examples of each type. And economic gain\nMADE AT THE EXPEN - E OF A NEGRO MIGHT COME IN THE\nFORM OF GREATER PROFIT TO A PLANTER OR MANUFACTURER\nwho hires Negroes for less pay than he could anyone\nELSE OR IT MAY BE THAT A HOUSEWIFE CAN AFFORBTO HAVE\nNegro servants because she doesn’t have to pay Negro:\nMUCH. A PRESTIGE GAIN IS MADE, AGAIN BY WAY OF EXAM¬\nPLE, BY THE SOUTHERN POOR-WHITE, BECAUSE HE CAN FEEL\nsuperior to Negroes...all Negroes, regardless of the;\naccomplishments. Sexual gain is probably declining\nNOW. ..BUT CERTAINLY IN THE PAST NO SOUTHERN WHITE M A\nNEEDED TO FEAR LEGAL ACTION, OR EVEN CENSURE, IF HE\nMOLESTED A NEGRO WOMAN.\nAll right. Assuming for the moment that people in\nOUR THIRD CATEGORY, THE ” N I C E PEOPLE1’ OD MAKE SUCH\ngains. What’s your argument about them?\nWell, if they were like persons in our first category\nTHEY WOULD REPUDIATE PREJUDICE AND DISCRIMINATORY BE¬\nHAVIOR AS BEING COUNTER TO THE AMERICAN CREED AND\nTHEY’D HAVE NO USE FOR RACIALISTIC THEORIES. If THEY\nWERE LIKE PERSONS IN OUR SECOND CATEGORY, THEY WOULD"
}