{
  "id": "d492-161",
  "text": "RICHTER:\nother Negroes in the process and it’s a type of mass\nEFFORT TO REGISTER, HE MAY HAVE DIRECT FORMS OF INTI¬\nMIDATION PLACED IN HIS WAY — THE SHOOTING OF THE NEGRO\nLEADER IN MISSISSIPPI AD OUT TWO YEARS AGO, I THINK IS\nAN EXAMPLE, THIS KIND OF DIRECT ACT OF VIOLENCE. OUT\nOF MY OWN EXPERIENCE, I REMEMDER WHEN I WENT TO THE\nCOURTHOUSE IN MY HOME TOWN IN BIRMINGHAM, ALADAMA, TO\nREGISTER. This TIME I WAS TEACHING IN COLLEGE. It\nTOOK ME ADOUT AN HOUR AND A GALF TO GO THROUGH THE\nPROCESS OF FILLING OUT A SINGLE BLANK SIMPLY DECAUSE\nTHE CLERK AT THE COUNTER DID NOT AGREE WITH THE INTER¬\nPRETATION THAT I MADE OF THE ITEMS ON THE DLANK THAT\nI HAD FILLED OUT. Now, UNDERSTAND, THAT NO DIRECTIONS\nWERE GIVEN ME AS TO WHETHER OR NOT THE ITEMS I HAD\nFILLED OUT WERE CORRECT OR NOT. The DLANK WAS SIMPLY\nGIVEN BACK TO ME SAYING, '’That’s NOT RIGHT.” So I WOUL\nSCRATCH ME HEAD AND I WOULD TRY TO GIVE ANOTHER INTER¬\nPRETATION AND GIVE THE BLANK BACK. It WOULD BE RETURNE\nTO ME JUST AS CURTLY, ”That’s NOT RIGHT, YET.” AND\nYET, BESIDE ME HERE WAS A CLERK, NOT ONLY INTERPRETING\nTHE ITEMS TO WHITES WHO WERE SEEKING TO REGISTER, GUT\nIN MANY CASES ACTUALLY FILLING OUT THE BLANKS FOR THEM.\nNOW THIS ACT FOR ME TOOK A GOOD PART OF A DAY, A HALF A\nDAY. IT WAS AN ACT, IN SO FAR AS THE WHITE PUBLIC WAS\nCONCERNED WHO WERE IN PROCESS OF REGISTERING, IT TOOK\nONLY PART OF FIFTEEN OR TWENTY MINUTES WITH ALL KINDS 0\nASSISTANCE. NOW, IF YOU MULTIPLY, IF THIS WAS DlFFlCUL\nFOR ME, AT THAT LEVEL, WITH THE DEGREE OF EDUCATION\nWHICH I HAD AT THAT TIME, YOU CAN CONCEIVE OF HOW DIFFI\nCULT IT WOULD BE FOR THE MAN WHO HAS ONLY A FIFTH GRADE\nEDUCATION, AND WHO IS NOT KNOWLEDGEABLE ABOUT WHAT HIS\nRIGHTS ARE, IN THIS KIND OF SITUATION. ThIS EXPLAINS,\nMORE THAN ANYTHING ELSE, I THINK, WHY YOU HAVE ONLY\nABOUT SAY A MILLION AND A HALF, PROBABLY, OR MAYBE TWO\nmillion Negroes, voting, actually equipped to vote am\nREGISTER AT THE PRESENT TIME. THIS IS THE BASIC QUES¬\nTION THAT, THAT THE C| V I L RIGHTS COMMISSION, THESE\nTACTICS, THESE MEASURES, ARE THE BASIC MEASURES THAT\nHAVE TO BE GOTTEN AT BY THE PRESIDENTS C| VI L R|GHTS\nCommission. If there’s going to be any substantial\nCHANGE IN THE EXERCISE OF THE NEGRO TO THE RIGHT TO VOT\nIT IS A PATTERN OF INTIMIDATION, SUBTLE, IT IS A PATTER\nOF INTIMIDATION WHICH FREQUENTLY IS NOT SUBTLE. It IS\nPATTERN OF SABOTAGE, REFUSAL ON THE PART EVEN OF PUBLIC\nofficials. This is the thing that has to be attacked,\nIT SEEMS TO ME, IF THERE IS TO BE A FULL EXTENSION OF\nTHE RIGHT TO VOTE TO THIS LARGE SEGMENT OF THE AMERICAN\nPUBLIC.\nPerhaps we might extend this illuminating statement by\nDr. Long. As you look over our wealth of materials on\nTHIS ENTIRE MATTER OF I NTIMI DAT I 0NK WHAT SEEMS TO YOU\nAPPROPRIATE, LOU, AS SOMETHING TO ADD IN ORDER TO PIECE\nOUT. ...AGAIN IN DETAIL AND VIVIDLY AND CONCRETELY....\nTHE STORY OF INTIMIDATION IN REGARD TO THE NEGRO VOTING\nin the South?"
}