{
  "id": "d492-162",
  "text": "-5-\nSCHNEIDER:\n1 THINK PERHAPS THE STORY OF GUS COURTS IS AS VIVIDLY\nILLUSTRATIVE OF INTIMIDATION IN CONNECTION WITH VOTING\nAS ANYTHING WE HAVE. LET ME EXPLAIN THIS MUCH: IN\nTHE SPRING OF 1956 A NATIONAL LEADERSHIP COUNCIL ON\nCivil Rights was told adout what had deen happening\nto one Negro citizen in the state of Mississippi, a\nman named Gus Courts, in connection with his efforts t\note. Courts lives in a county in Mississippi in\nWHICH THERE ARE ADOUT 17,000 NEGROES AND LESS THAN HAL\nTHAT NUMDER OF WHITES. COURTS ASSUMED A ROLE OF LEADE\nSHIP IN THE EFFORT TO HAVE NEGROES VOTE IN HIS COUNTY.\n'HEN HE HIMSELF FIRST ATTEMPTED TO VOTE NO NEGROES WER\nREGISTERED TO VOTE, AND COURTS TRIED TO REGISTER IN\n1953. 1 think AT THIS POINT WE MIGHT LET HIM AND HIS\nQUESTIONER AT THE COUNCIL IN 1956, TAKE UP THE TALE.\nCOURTS :\n-ELL, WE STARTED IN 1953. WE WENT TO THE SHERIFF’S\nOFFICE AND TRIED TO PAY OUR POLL TAX, WHICH ’E WERE\nREFUSED. • FT E R WE WERE REFUSED A FEW OF US GOT TO¬\nGETHER AND GOT UP, WE RAISED, ADOUT $300 AND HAD AN\nAFFIDAVIT DROUGHT AGAINST THE SHERIFF AND HAD HIM\nDEFORE THE FEDERAL GRAND 0 U R Y TO MAKE HIM, FORCED HIM\nTO OPEN THE DOOKS, IN OTHER WORDS TO LET US PAY POLL\nTAX. .'HICH THEY. ...AND OF COURSE MYSELF AND i^EVEREND\nGeorge a. Lee was one of the leaders and several other\nWAS SUMMONED DEFORE THAT GRAND JURY. >ND THE SHERIFF\nGOES UP AND MAKES HIS APOLOGY, THAT IF THEY DIDN’T\nINDICT HIM HE WOULD GO DACK AND OPEN THE 300KS AND LET\nUS PAY POLL TAX AND ALSO LET, SEE THAT THE NEGROES .\nTHERE WERE REGISTERED.\nM \\N :\nAh, how many of you paid the poll tax9\nCOURTS:\n^ell, when they opened UP THE....WHEN we got the DOOKS\nOPENED UP ADOUT 400, WE SUCCEEDED IN GETTING ADOUT 400\nNegroes in Humphreys County to pay their poll tax.\nivi \\N :\nNow, THIS 400 WHO PAID THEIR POLL TAX, DID YOU GET ANY\nOF THEM REG 1 STEREO?\nCOURTS:\nAe SUCCEEDED IN GETTING ADOUT 94 REGISTERED.\nM\\N :\nVHEN WAS THAT?\nCOURTS:\nThat was in 1954. Then the legislature passed a law\nAND MADE IT SO RIGIDY, THAT THE NEGROES AND NODODY E L S\ncouldn’t register in the state of Mississippi, unless\nTHE REGISTRAR WANTED THEM TO DO SO.\nM \\N :\nIn OTHER WORDS THE requirements were applied only to\nthe Negroes and not to the whites, is that correct9\nCOURTS:\nA ELL. •..THE WAY THAT IT WAS PUT OUT, IT WAS FOR THE"
}