{
  "id": "d492-163",
  "text": "-6-\nNegroes, ano some of them raised a question and said,\n’' W E L L , THE REGISTER UNDERSTANDS, HE KNOWS NOW TO DO\nTHAT . ”\nM \\N :\nCOURTS:\nM \\N :\nCOURTS:\nM\\N :\nCOURTS:\n-•ell, now, of the 94 people who registered in 1954\nWHEN DID THEY FIRST TRY TO VOTE?\nI 9 .... IN ’55.\n•'‘ELL, WHAT HAPPENED WHEN THEY TRIED TO VOTE IN 1955?\nRELL, JUST PRIOR TO THAT, I MUST SAY I H,,VE TO MAKE\nTHIS STATEMENT, IN 1954 THE CITIZENS’ COUNCIL WAS\nORGANIZED. iHEN WE FIRST HAD THE SHERIFF UP TO*...\nDEFORE THE FEDERAL GRAND JURY THE CITIZENS’ COUNCIL\nwasn’t organized in Humphreys County. They got organ¬\nized in ’54. Mnd it so did....they organized like one\nday. The next day they had me up defore the Citizens’\nCouncil Committee, to tell me what they had done, .and\nTHEY TOLD ME ”WE HAVE ORGANIZED A C|T|ZENSt COUNCIL\nhere in Humphreys County, a/e understand that you’re\nLEADING THESE NEGROES AND TEACHING THEM TO VOTE. Not\nONLY THAT 3 U T YOU’S THE PRESIDENT, THEY TELL US, THAT\nYOU ARE THE PRESIDENT OF THE NV\\CP BRANCH, AND WE’RE\nNOT GOING TO LET IT OPERATE HERE IN HUMPHREYS COUNTY\neither.1’ They asked me, ” :as l°” I say I certainly\nam. I’m the president of the N.VaCP.” '’well, you....\nHOW MANY MEMBERS DO YOU HAVE DELONG TO THE N\\XP°‘’ *1\nSAID, \"WELL, THERE ARE....I CAN’T TELL YOU.” He SAID,\n•’Vhy? aren’t you THE PRESIDENT9” I SAID, \"All I know’\njust me. I’m the president of it.” They said, they\nSAID, THEY ASKED ME, ”a/ELL, HOW ABOUT GOING AND GETTIr\nYOUR BOOKS AND TURNING THEM OVER TO THEM?” I ASKED TH\nTHEM, I SAID, \"ARE YOU FORCING ME TO DO THAT?” ”No,NC\nwe’re NOT FORCING YOU TO DO THAT.” I SA I D , '’Tell , I ’\nREFUSE TO DO IT.” THEY SAID, ” •* E L L , THERE AIN’T NOTH!\nWE CAN DO ABOUT THAT.” BUT SAID, ”^e’RE GOIN1 TO TELL\nyou this: you Negroes in Humphreys County: the N:\\ACP\nIS NOT GOING TO OPERATE HERE, AND YOU ARE NOT VOTE IN\nHumphreys County, so you’d just as well to go and get\nYOUR NAME OFF, IF YOU CD N ’ T YOU’RE GOING TO BE PUT OU ;\nOF BUSINESS.” I WAS OPERATING A STORE, A BUSINESS\nDOING ABOUT $25,000 B U S I N ESS A YE ,R .\nVHAT DID THEY DO ABOUT YOUR STORE WHEN YOU TOLD THEM\nYOU WOULDN’T GET OFF THE REGISTER?\n-ELL , WHEN I TOLD THEM THAT I WASN’T GOING TO GET OFF,\nTHEY SENT THE REPRESENTATIVE DOWN DAY OR TWO AFTER\nTHAT AND HAD ME BACK BEFORE THE COMMITTEE. THIS TIME\nTHE....THIS FELLA, HE WAS A MEMBER OF THE CITIZENS’\nCouncil, he told them that they would be able to buy\nME IN, AND HE WOULD GO DOWN AND GET ME AND BRING ME"
}