{
  "id": "d492-172",
  "text": "-4-\nSCHNEIDER: I agree. Ie should pay some attention to Garvey. His\nIS CERTAINLY A SIGNIFICANT STORY. LET ME DRAW ON\nCrONON’ S STUDY ENTITLED, SlACK IVIOSES. WHICH GIVES THE\nstory of Garvey and his association. The story is\nSIGNIFICANT PARTLY BECAUSE GARVEY’S PROTEST INVOLVE.S\nA RADICAL REJECTION OF THE WHITE WORLD AND A PROGRAM OF\nextreme Negro nationalism or racialism. This is no\nLONGER THE FORM OF PROTEST OF THE NEGRO LEADERSHIP TOD;\nBY ANY MEANS, AND GaRVEY IS, IN A SENSE, A TREMENDOUS\nCONTRAST-FIGURE. He WAS BORN IN JAMAICA IN 1887,\nEVIDENTLY OF UNMIXED NEGRO STOCK. He WAS NOT WELL\nEDUCATED, BUT ALWAYS YEARNED TO $E .CONSIDERED AN.'EOUCAT\nPERSON, AND THE EQUAL OF HIS, Or . Du^OlS. He APPARENTL\nBECAME ACUTELY CONSCIOUS OF THE EXISTENCE OF RACE\nPREJUDICE IN HIS NATIVE JAMAICA IN HIS EARLY TEENS. Hr\nALSO DEVELOPED AN ANTIPATHY AND DISTRUST TOWARD MIXED-\nBLOODS OR LIGHTER SKINNED NEGROES. In ENGLAND, SHORTLY\nBEFORE THE -.‘ORLD JAR, HE ABSORBED FROM CERTAIN ASSOCI¬\nATES A GOOD BIT OF AFRICAN NATIONALISM; AND ALSO DEVE¬\nLOPED, OR INTENSIFIED, ASPIRATIONS TO BE A RACE LEADER,\nIn the summer of IS14, going home to Jamaica, Garvey w\nALREADY FILLED WITH THE NOTION OF ;?UNIT|NG ALL THE\nNegro peoples of the world into one great body, to\nestablish a country and government absolutely their\nown. if He had a vision of ,?a new wfrld of black men,\nNOT PEONS, SERFS, DOGS, . ND SLAVES, BUT A NATION OF\nSTURDY MEN, MAKING THEIR IMPRESS ON CIVILIZATION, AND\nCAUSING A NEW LIGHT TO DAWN UPON THE HUMAN RACE.'1\nRICHTER: Didn’t Garvey found his Universal Negro Improvement\nAssociation in Jamaica?\nSCHNEIDER: Yes he did and once he had gotten it started there he\nproceeded to Harlem, in New York, early in IS16, to\nOFFER HIS PROGRAM OF RACE IMPROVEMENT TO AMERICAN\nNegroes. Garvey made his most powerful appeal, and got\nHIS GREATEST SUPPORT FROM THE MASS OF POORLY EDUCATED\nNegroes who had migrated from the South during the\nWAR BOOM, AND WHO WERE FINDING CERTAIN DISAPPOINTMENTS\nIN THE SHAPE OF THE POST-WAR WORLD. It SHOULD BE\nRECALLED, ALSO, THAT EXISTING NeGRO IMPROVEMENT GROUPS\nHAD GIVEN LITTLE ATTENTION TO LOWER CLASS NEGROES. ONE\nMAY SAY THAT THE BLACK MASSES WERE READY FOR A MoSES.\nIn 1919 and 1920, Garvey’s organization grew rapidly,\nALTHOUGH IT PROBABLY NEVER GREW AS RAPIDLY AS HE\nclaimed. You’ve mentioned Garvey’s nationalism, and\nTHE APPEAL IT HELD FOR LOWER-CLASS AMERICAN NEGROES.\niOULD YOU LIKE TO GO INTO A BIT MORE DETAIL ON THIS?\nSCHNEIDER: It’s worth recalling how strongly affirmative of the\nGOODNESS OF THINGS ’’BLACK7* GaRVEY WAS. THIS WAS AN\nEMOTIONALLY POWERFUL ELEMENT IN HIS TEACHING AND\npersonality: this willingness to invert, conventional"
}