{
  "id": "d492-173",
  "text": "-5-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nivn N I :\nAMERICAN COLOR VALUES, AND ASSERT UNEQUIVOCALLY A KIND\nOF EQUATION OF BLACKNESS AND GOODNESS. As YOU KNOW\nalso, Garvey sought to work out a ,?back to -frica,? move\nMENT, WHICH LOOKED ORIGINALLY AS IF IT WOULD GET WARM\nSUPPORT FROM THE LlBERIAN GOVERNMENT. I MUST MAKE SHOR\nAND SIMPLE A LONG AND I N V 0 L VE D STORY AND SAY THAT\nLiberia finally withdrew every kind of support from\nGarveyism. Garvey denounced Liberian officials, who1\":\nHE THOUGHT HAD FAILED HIM, AS * R A C E - T R A 1 TORS, 'f AND\nCONCENTRATED MUCH HATRED UPON DyBot)S, WHO IN HIS MIND\nEVIDENTLY HAD BECOME THE MASTER VILLAIN RESPONSIBLE FOR\nFAILURES IN AMERICA AND AFRICA, AND WHOM GARVEY CALLED,\ni?PURELY AND SIMPLY A WHITE MAN’S NlGGER.\"\nI UNDERSTAND THAT THESE YEARS OF THE MID I 920T S BEGIN 7\nSEE THE DECLINE OF GARVEY’S MOVEMENT.\nYes, He was sent to the Atlanta penitentiary in 1925\nFOR FIVE YEARS AFTER AN APPEAL OF MAIL-FRAUD CONVICTION\nWAS REJECTED. He WAS PRDONED IN 1927, AND DEPORTED TC\nJamaica. He started to rebuild the UNIA, the Universal\nNegro Improvement .association, in Jamaica and had some¬\nthing LIKE A BRIEF RENEWAL OF FAME AT THE END OF THE\n20’s. Certainly the 30’s inaugurated a period of obscu'\nITY FOR HIM. The depression generation evidently had\nLITTLE INTEREST IN GARVEY’S AMBITIOUS SCHEMES FOR NeGRC-\nsalvation. He died in London in 1940.\nYou?ve repeatedly said that Garvey and his movement\nWERE SIGNIFICANT IN THE WHOLE PICTURE OF NEGRO PROTEST,\n^ 0 U L D YOU PERHAPS OUTLINE THIS SIGNIFICANCE AS YOU SEE\nI T?\nI THINK THE MOVEMENT SHOWED THE SHEER EAGERNESS OF THE\nBLACK MASSES TO ACQUIRE A FEELING OF PRIDE, SOME KIND\nOF CONSIDERABLE SELF-RESPECT. CERTAINLY GaRVEY SPOKE\nAS IF HE WERE MAKING A TREMENDOUS ANSWER TO SUCH AN\nappeal. Consider this, which 1 find quoted from a\nVOLUME EDITED BY AMY J. GaRVEY, ENTITLED The PHILOSOPHY\nand Opinions o^f marcus Garvey :\n3ut when we come to consider the history of man, was\nnot the Negro a power, was he not great once? Yes\nhonest students of history can recall the day when’\nEgypt, Lthiopiaand Timbuctoo towered in their civiliza¬\ntions, TOWERED ABOVE EUROPE, TOWERED ABOVE ASIA. WHEN\nEurope was inhabited by a race of cannibals, a race of\nsavages, naked man, heathens and pagans, Africa was\npeopled with a race of cultured black men who were\nMASTERS IN ART, SCIENCE, AND LITERATURE; MEN WHO WERE\nCULTURED AND REFINED; MEN, WHO, IT WAS SAID, WERE LIKE\nthe gods. Even the great poets of old sang’in beauti¬\nful SONNETS OF THE DELIGHT IT AFFORDED THE GODS TO BE"
}