{
  "id": "d492-174",
  "text": "-6-\nSCHNEIOER\nRICHTER:\nSCHNEIDER:\nIN COMPANIONSHIP WITH THE ETHIOPIANS. >HY, THEN\nSHOULD WE LOSE HOPE? 3lACK MEN, YOU WERE ONCE GREAT*\nYOU SHALL DE GREAT AGAIN. LOSE NOT COURAGE, LOSE NOT\nFAITH, GO FORWARD. The THING TO DO IS TO GET ORGANIZED\nKEEP SEPARATED AMD YOU WILL BE EXPLOITED, YOU WILL QE\nROBB'ED, YOU WILL 3 E KILLED. G Ej ORGANIZED AND YOU WILL\nCOMPEL THE WORLD TO RESPECT YOU. If THE WORLD FAILS\nTO GIVE YOU CONSIDERATION BECAUSE YOU ARE BLACK MEN\nBECAUSE YOU ARE NEGROES, 400m ILL IONS OF YOU SHALL *\nTHROUGH ORGANIZATION, SHAKE THE PILLARS OF THE UNIVERSE\nAND BRING DOWN CREATION, EVEN AS SAMSON BROUGHT DOWN TH\nTEMPLE C)N HIS HEAD, AND UPON THE HEADS OF THE P h I LI_\nS T J N E S .\n;ND again Garvey declaims: '”,Vakd up Ethiopia’, wake up\nAFRICA’. Let us work toward the one glorious end of a\nFREE REDEEMED AND MIGHTY NATION. LET AFRICA BE A BRIGH\nSTAR AMONG THE CONSTELLATION OF NATIONS?’\nThus is Garvey eloquent, not to say flamboyant, on the\nSUBJECT OF THE AFRICAN BACKGROUND AND THE Negro’s\nprospects. Historically, I think this effort to inspir\npride OF Race and background is most significant. How¬\never THE METHODS OF NEGRO LEADERS TODAY MAY DIFFER AND\nHOWEVER DIFFERENT THE TURNS THEIR ELOQUENCE MAY TAKE\nMANY OF THESE LEADERS UNDOUBTEDLY STILL WISH TO INSTILL\nPRIDE AND MAGNIFY SELF-RESPECT IN THE NEGRO PEOPLE. In\nBRIEF, I WOULD SAY THAT THE GARVEYITE MOVEMENT GETS SOM\nOF ITS SIGNIFICANCE FROM THIS: IT HELPED, THROUGH ITS\nGAUDY FAILURES, TO MAKE NEGROES SUSPICIOUS OF BLACK\nCHAUVINISM. It prompted a re-thinking of the feasi¬\nbility OF VARIOUS KINDS OF NEGRO ASPIRATIONS. It\nSTIMULATED CONTRAST CONCEPTIONS AMONG MANY WHO DREW\nfrom Garvey’s activity the lesson that major hope for\nNegro aspirations lay not in the aggressive repudiation\nOF THE WHITE MAN AND THINGS WHITE, BUT RATHER IN FORTH¬\nRIGHT APPEALS TO THE WHITE MAN BASED ON THE WHITE MAN’S\nOWN, AT LEAST PARTIAL, ADHERENCE TO DEMOCRATIC OUTLOOKS\nand Christian principles.\nYou’ve indicated Garvey’s opposition to Dubois. And\nWE VE ENCOUNTERED 0 U 3 0 I S ’ S NAME EFORE AS AN OPPONENT\nof 3oo ker T. Washington.\n0u3ois HAS LOOMED LARGE ON THE AMERICAN SCENE AS A\nNegro leader. In the context of protest, we might\nMENTION HIS PART IN THE NIAGARA MOVEMENT WHICH MERGED\nwith the NAYCP. The Niagara movement was launched\nFIFTY ODD YEARS AGO WHEN A NUMBER OF NEGRO INTELLECTUAL.\nmet at Niagara Falls. They hoped to establish a nation\nPROTEST ORGANIZATION. BOOKER T. WASHINGTON OPPOSED\nTHE MOVEMENT AND CALLED FORTH OuBoiS’s STRONG CRITICISM\nUNDER THE IMPACT OF SUCH CRITICISM WASHINGTON, TOO,\nMOVED TOWARD MORE OF AN AGGRESSIVE, FORTHRIGHT, PROTEST\nPOSITION. \\ND HERE, ALSO, WEfD BETTER OMIT NUMEROUS"
}