{
  "id": "d492-176",
  "text": "RICHTER:\nWlLKIN3:\n-8-\nCLAUSE OF THE I4TH AMENDMENT AND THE EQU&L PROTECTION\nCLAUSE, AND FOR NEGROES ON JURY SERVICE AND ALL THE\nOTHER THINGS IN COURTS. THESE WERE CARRIED ALONG. Th\nEAR L I ER ... REPORTS OF THE \\ S S 0 C I A T I 0 N - - T H E Y COULD 13 E\nSTUDIED-WOULD SHOW A RATHER DALANCED PROGRAM WITH\nHEAVY EMPHASIS ON LEGAL DEFENSE AND ANTI-LYNCHING WORK\n3 U T NOT AN I NSENS I D I LITY TO THE OTHER ELEMENTS OF THE\nprogram. Later these came in and came to de more\nPROMINENT, ESPECIALLY LEGISLATIVE WORK AND POLITICAL\nACTION. OF COURSE, POLITICAL ACTION AND LEGISLATIVE\nWORK FOR EFFECTIVENESS, HAD TO AWAIT ONE OF TWO THINGS\nEITHER THE ENLARGED ENFRANCHISEMENT OF THE NEGRO IN\nthe Southern state or the migration of the Negro to\nNorthern states where he could exercise the franchise\nWITHOUT RESTRICTION. N0 W, THIS DIDN’T HAPPEN OF COURS\nUNTIL AFTER VoRLD WAR I, HEAVY MIGRATIONS TO THE NORTH\nIN THE TWENTIES, AND THEN INCREASING MIGRATION FOLLOW¬\nING THE NEWS THAT WENT SACK AND THE TRANSFER OF RELATI\nAND THE CRINGING OF THIS. MN D THEN ECONOMIC CHANGES,\nAND LATER WoRLD WAR II AND WHERE THE POPULATION SPREAD\n.and the Negro thus decame a political factor in certai\nSECTIONS OF THE NORTHERN STATES. HMD THEREAFTER LEGI¬\nSLATIVE WORK, AND PRESSURE FOR THE ATTAINMENT OF THE\nGOALS OF THE NA,\\Cr THROUGH POLITICAL ACTION OR THROUGH\nTHE USE OF POLITICAL INFLUENCE, LET’S SAY, OR VOTING\nPOWER, DECAME MORE EFFECTIVE DECAUSE THEY HAD MORE\nVOTES TO 3ARGAIN WITH.\nIn recent years, the N V.CP has really come into the\nCONSCIOUS LIFE OF THE AMERICAN PUDLlC DECAUSE OF ITS\nACTIVITY IN THE AREA OF LEGISLATION, IN THE AREA OF\nLEGAL PROTECTION, THE FIGHTS IT* S DEEN MAKING IN THE\nSEGREGATION CASES, IN THE SCHOOLS, AND SO FORTH. Is\nTHIS JUST ONE PART OF THE N\\ >CP PROGRAM OR DO YOU HAVE\nAN EDUCATIONAL PROGRAM, OR OTHER PROGRAMS AS WELL?\nYes, we have, we have in our minds and on paper a\nVERY DROAD PROGRAM, AND WE DO EDUCATIONAL WORK. YE\nMAINTAINA WASHINGTON OFFICE, FOR EXAMPLE, FOR DEALING\nDIRECTLY WITH THE HlLL AND WITH THE GOVERNMENT AGENCIE\nAND IN OUR EDUCATIONAL PROGRAM WE DO THE SAME THINGS\nTHAT OTHER ORGANIZATIONS DO IN ORDER TO WIN SUPPORT FO\nTHEIR POINT OF VIEW—WE HOLD MEETINGS, AND WE ISSUE\nPAMPHLETS AND FILM STRIPS AND RADIO SCRIPTS, AND WE\nHOLD CONVENTIONS AND CONFERENCES AND E LECTURE TO\nCOLLEGES AND FORUMS, AND CLUJS AND WE TRY TO INTEREST\nOTHER ORGANIZATIONS AND GET THEM TO COOPERATE ON OUR\nPROGRAM AND WE IN TURN COOPERATE ON THEIR PROGRAMS, SC\nTHAT WE USE ALL THREE OF THESE ACTIVITIES. Of COURSE,\nTHE MOST SPECTACULAR HAS DEEN OUR LEGAL WORK. PEOPLE\nHAVE TENDED TO THINK OF THE NA\\CP AS A LEGAL DEFENSE\nORGANIZATION, DUT IN RECENT YEARS -EGINNING IN NINETEE\nIN THE MID-THIRTIES, EARLY THIRTIES, REALLY, THE NV'.CP"
}