{
  "id": "d492-177",
  "text": "-9-\nHAS BEEN INCREASINGLY ACTIVE IN THE POLITICAL ARENA. We’rE\nA POLITICAL ORGANIZATION, BUT NOT A PARTISAN ORGANIZATION.\n.'E HAVE MEMBERS OF ALL PARTIES IN OUR ORGANIZATION, BUT WE\nDO HAVE POLITICAL ACTION.\nAnd OUR EDUCATION program hasn’t been as effective as\nWE WOULD LIKE, WE HAVE AN IDEAL FOR IT, ALTHOUGH SOME PEOPLE\nSAY IT HAS BEEN EFFECTIVE. I THINK IT’S BEEN EFFECTIVE\nLARGELY BECAUSE OF THE ISSUES THAT WE HAVE SPONSERED AND\nTALKED ABOUT—-BECAUSE THEY THEMSELVES HAVE HAD EDUCATIONAL\nVALUE AND HAVE PENETRATED THE PUBLIC. ^UT WE COULD DO A\nBETTER JOB WITH A LITTLE MORE MONEY, OF COURSE, THIS IS THE\nCRY OF ALL 0RGAN | ZATI 0NS, . ESPECI ALLY VOLUNTARY ONES WHERE\nYOU HAVE NO ENDOWMENT AND WHERE YOU HAVE NO DRAGOONING OF\nMONEY. V'i £ DON’T HIRE ANY PROFESSIONAL FUND RAISERS TO RAISF\nMONEY FOR US, WE PAY NO COMMISSIONS ON MEMBERSHIPS OR ON\nSOLICITATIONS AT ALL, WE COMPLY WITH ALL STATE REGULATIONS 0\nTHE COLLECTION OF FUNDS. It’S PURELY A VOLUNTARY OPERATION\nAND THIS KIND OF OPERATION HAS TROUBLE RAISING MONEY.\nRICHTER: Does the NAACP feel that it has the general support of all\nNegroes?\n'ILK INS: Ve feel that we have; in fact, we know that we have the mora\nSupport-. <e jo-n^t .have the FrtNvrN'C it\\ l su fp o rtt' a! no we do'n,’-t\nT\"H EMEMBERSH I P SUPPORT. A GOOD MANY PEOPLE ASK VERY FRANKLY,\nI THINK YOU ASK IT VERY DISCREETLY, HOW IS IT THAT YOU SAY\nTHAT YOU REPRESENT THE ASPIRATIONS OF 15 OR 17 MILLION\nNegro citizens, and you only have 300,000 members? If you\nREPRESENTED THEIR ASPIRATIONS, WOULDN’T YOU HAVE AT LEAST\nA COUPLE OF MILLION MEMBERS? AND 1 THINK THAT’S A GOOD\nQUESTION. The answer is, that in a voluntary association,\nlargely NON-PROFESS I ON AL--WE HAVE a SMALL PAID STAFF--YOU\nDON’T GET MEMBERS, PEOPLE don’t JUST JOIN BECAUSE THEY\nBELIEVE IN A MOVEMENT. RECENTLY THE CATHOLIC PlGEST WITHIN\nTHE LAST 6,8, 10 MONTHS CONDUCTED A SURVEY-SAMPLI NG—IN\nWHICH THEY FOUND THAT ABOUT 93% OF THE NORTHERN NEGROES\nSUPPORT THE PROGRAM OF THE NAACP IN THEIR MINDS AND IN THE I l\nHEARTS, AND 94% OF THE SOUTHERN NEGROES AGREED WITH THE\nNAACP PROGRAM. I’d like to have the dues of all those\nPEOPLE. It WOULD CERTAINLY MAKE THE JOB EASIER.\nRICHTER: iv,r. Wilkins went on to explain that white membership of the\nNAACP RANGES FROM 10# TO 15# OF THE TOTAL. BEFORE THE RECE\nPRESSURE OF SOUTHERN GOVERNMENTS ON THE NAaCP, HE ALSO\nPOINTED OUT, ABOUT 607° OF THE MEMBERSHIP WAS IN THE SOUTH.\nThis has shrunk. But Mr. also indicated that he expects\nTHAT A RECENT SUPREME COURT DECISION WHICH HOLD THAT THE\nNAACP WAS NOT COMPELLED TO GIVE UP OR MAKE PU3LIC MEMBERSHI\nLISTS, SHOULD AID REVIVAL OF MEMBERSHIP IN THE SOUTH. AFTER\nTHIS SURVEY OF THE NATIONAL ASSOCIATION OF THE ADVANCEMENT\nof Colored People, let’s turn again to you, Lou. Would you\nGIVE US A LIGHTNING SUMMARY OF NEGRO PROTEST?"
}