{
  "id": "d492-178",
  "text": "-10-\nSCHNEIDER:\nRICHTER:\n■viUS I C :\n\\NNCR :\nMUSIC\nThat’s all it could possibly be. m/e started with\nVIOLENT PROTEST, BEGINNING CENTURIES AGO, AND MARKED\nFOR THE PERIOD BEFORE THE ClVlL 'V AR BY THE SLAVE\nREVOLTS OF GABRIEL PROSSER, DENMARK VESEY, AND Nat\nTurner. We touched on Negroes in the abolition move¬\nment. We described the activity of Marcus Garvey, an;\nsought briefly to assiss its significance. We then\nTURNED TO THE NA-CP. ONE OF THE CLEAREST THINGS IN\nTHE WHOLE MOVEMENT IS THIS: IN BROAD PERSPECTIVE THEF\nHAS BEEN CONFLICT BETWEEN A PRINCIPLE OF SEEKING S A L V,\n. TION THROUGH ACTIVITY THAT RESTS N0_ HOPE ON THE\nWHITE MAN, OR ON HIS CULTURE...AND A PRINCIPLE OF L\nLOOKING FOR MAJOR ALLEVIATION OF THE NEGRO’S PROBLEMS\nTHROUGH APPEAL TO DEMOCRATIC AND RELIGIOUS PRINCIPLES\nTHAT ARE IMBEDDED IN THE WHITE MAN’S CULTURAL BACK¬\nGROUND. The latter principle has clearly won the day.\nAgain, let me emphasize that we have touched only the\nHIGHSPOTS OF THE STORY OF NEGRO PROTEST. ThE NAACP\nJ_S THE MOST FAR-REACHING OF THE NEGRO’S PROTEST ORGAN-\nI ZAT I 0NS . . . .0NE THAT IS NATIONAL IN ITS ACTIVITIES,\nHowever, there are other local and regional protest\nGROUPS AT WORK. FoR EXAMPLE THE MONTGOMERY ImPROVEME;\nAssociation which, again through peaceful means,\nCARRIED ON THE MUCH PUBLICIZED MONTGOMERY Bus BOYCOTT:\nthe Tugkegee Civic Association whose fight for voting\nRIGHTS FOR NEGROES IN TySKEGEE HAS BEEN GOING ON FOR\nMANY, MANY, MONTHS NOW....BUT A FIGHT THAT IS AGAIN A\nPEACEFUL ONE.\nThere is also a host of organizations dedicated\nTO FURTHERING THE NEGRO’S CAUSE THROUGH O0CIAL WORK,\nEDUCATION, AND DISCUSSION WHICH, TO DIFFERENTIATE THE:\nFROM WHAT WE HAVE CALLED ’PROTEST,? ORGANIZATIONS, WE\nWILL CALL '’CefENSE*' 0 RG A N I Z A T I 0 N S . . . . Th E S E WILL BE OUP\nSU3JECT FOR DISCUSSION AS WE TAKE UP ’DEFENSE'’ NEXT\nWEEK IN INVESTIGATING THE PROBLEMS SURROUNDING \"ThE\nLast C i ti zen .,f\nTHEME UP \\M) UNDER\nYOU HAVE BEEN LISTENING TO Dr. LOUIS SCHNEIDER, PRO¬\nFESSOR of Sociology at Purdue University, and the\nprogram’o producer-director, E. $. Richter, as they\ndiscuss ’’The Last^ C i t i zen .i? This program was produced\nAND RECORDED BY Py/BAA , PURDUE UNIVERSITY, UNDER A GRAN,\nfrom the Educational Television and Radio Center and\nIS BEING DISTRIBUTED BY THE NATIONAL ASSOCIATION OF\nEducational Broadcasters.\nTHEME UP TO FINISH\nANNCR :\nThis is the N\\E3 Radio Network."
}