{
  "id": "d492-181",
  "text": "-3-\nRICHTER:\nGRANGER :\nRICHTER:\nGRANGER:\nRICHTER:\nGRANGER :\nIS PROFESSIONALLY DIRECTED AND ADHERES TO THE STAND¬\nARDS OF PROFESSIONAL SOCIAL WORK. -E, THEREFORE,\nCAN’T CLAIM TO BE A MASS ORGANIZATION REPRESENTING\nNegro opinion; in fact, \\aje make no effort to repre¬\nsent Negro opinion as such.\nDo you deal with individual cases?\nNo, THE POINT I’m making is that our opinions, our\nPOLICIES, ARE THE RESULT OF INTERRACIAL CONSENSUSES\nARRIVED AT THROUGH OUR BOARDS AND COMMITTEES. OuR\nEMPHASIS IS NOT WITH THE INDIVIDUAL CASES, BUT WITH\nCOMMUNITY EDUCATION, ORGANIZATION, AND ACTION. <E\nBLUEPRINT THE SOCIAL NEEDS, AND THE ECONOMIC NEEDS\nof the Negro community. \"!e deduce from the facts\nGATHERED CERTAIN KINDS OF ACTION. JE INTERPRET THE\nNEEDS AND THE PROPOSED ACTION TO THE COMMUNITY. ^E\nFIND INDIVIDUALS AND ORGANIZATIONS WILL EITHER ENLIS\nUNDER OUR BANNER TO GET CHANGES M D E OR GO ON THEIR\nOWN TOWARD THE GOAL THAT WE ARE POINTED TO AND USING\nTHE METHODS THAT WE’VE USED.\nThe Urban League well-represented in the South, isn’\nI 7°\nIt is reasonably well-represented considering the\nfact that a local Urban League must support itself.\nAnd its support with practical considerations, must\nCOME FROM THE COMMUNITY CHEST 9.VER A LONG PERIOD OF\nTIME. And in view of the fact that THERE IS MORE\nRELUCTANCE ON THE PART OF A SOUTHERN COMMUNITY TO\nACCEPT THE KIND OF THING THAT THE URBAN LEAGUE STAND\nFOR, I THINK we DO WELL TO HAVE SET UP 18 URBAN\nLEAGUES IN SOUTHERN AND CLOSE BORDER STATES.\nNOW, WE WANT TO GET DOWN TO CASES. V E ASKED *vIr .\nGranger for concrete instances of the work of the\nLeague. He spoke as follows of the activity of the\nLeague in connection with the Negro population of\nPortland, Oregon.\nlvlow I think, for instance, of Portland, Oregon,\nWHERE BEFORE THE WAR THERE \"ERE 1800 NEGROES. AfTER\nTHE WAR, AT THE PEAK OF THE WAR, THERE WERE 18,000.\nAnd Portland had always been a town of intense,\nTHOUGH NON-LEGAL PREJUDICE--H0TEL ACCOMMODATIONS,\nRESTAURANT ACCOMMODATIONS, AND SO FORTH. ThE PRE¬\nFERRED JOBS WERE BARRED TO NEGROES; THE 3ULK OF\nNegroes lived across the river in the Van Port, the\nJERRY-BUILT TOWN, THE WAR INDUSTRY TOWN. HEN THE\nFLOOD, THAT TOOK PLACE AROUND 1945, 1946, WIPED VAN\nPort out, that cut down a large amount of Negro\nRESIDENCE AND IT SENT NEGROES FROM VAN PORT OVER INT"
}