{
  "id": "d492-186",
  "text": "-8-\nTO GIVE SOME ESTIMATION OF ACTUAL ACCOMPLISHMENT. AND\nHE ANS 'EREO AS FOLLOWS I\nFLEMING: Well, we’re very sensitive to the fact that you can’t\nMEASURE THESE THINGS WITH A YARDSTICK. I T * S VERY DIFF\nCULT TO MEASURE CONCRETE ACHIEVEMENT IN THIS FIELD\nBECAUSE YOU’RE DEALING WITH PEOPLE AND WITH PROCESSES.\n3UT THERE ARE THINGS THAT WE FEEL WE CAN VALIDLY SAY\nTHAT OUR ORGANIZATION HAS ACCOMPLISHED OR HAS CONTRI¬\nBUTED TO IN AN IMPORTANT WAY. FoR EXAMPLE, THERE’S\nBEEN SOME VOLUNTARY CHANGE IN RACIAL PATTERNS IN THE\nSouth. The opening of private institutions of higher\nlearning, many of them church related in the South, to\nNegroes for the first time. The Council undertook,\nSOME Y.'ARS AGO, TO FURTHER THIS VOLUNTARY TREND, TO\nMAKE THE FACTS AVAILABLE TO THE ADMINISTRATORS, TRUST¬\nEES, AND FACULTY MEMBERS OF THOSE INSTITUTIONS, TO\nPOINT TO WORKING PRECEDENTS ELSEWHERE. The SAME THING\nIS TRUE IN A VARIETY OF OTHER FIELDS. PROFESSIONAL\nASSOCIATIONS WHICH INCREASINGLY HAVE OPENED THEIR\nMEMBERSHIPS TO QUALIFIED NEGROES; THE USE OF NeGRO\nPOLICEMEN IN THE SoUTH WHICH HAS PRACTICAL ADVANTAGES\nAS WELL AS SIMPLY BEING CIVICLY DESIRABLE; AND THE\nVOLUNTARY DESEGREGATION OF BUSES IN SOME CITIES. FoR\nEXAMPLE, AT THE HEIGHT OF THE CONTROVERSY OVER MONT¬\nGOMERY and Birmingham’s transit systems, we were a3le\nTO POINT OUT TO THE SOUTH AND TO REoT OF THE COUNTRY,\nTHAT A NUMBER OF SOUTHERN ClTIES, AND WE NAMED THEM,\nHAD QUIETLY AND WITHOUT CONTROVERSY, DROPPED SEGREGA¬\nTION ON THEIR BUSES, THE TRANSITION HAD GONE SMOOTHLY,\nA LOT DEPENDS SIMPLY ON DEMONSTRATING WITH THESE THING\nCAN \"E DONE. THAT THE MYTHS AND THE FEARFUL PROSPECTS\nWITH WHICH PEOPLE ARE HAUNTED—THE FEAR THAT CHANGE\nmeans disaster in the racial field, can be dispelled\nBY THE JUDICIOUS USE OF FACTS AND PRECEDENTS IN THIS\nFIELD. AND A LOT OF OUR ACTIVITY HAS BEEN IN THAT\nDIRECTION. . V E ’ V E ALSO SUPPLIED SKILLED SPECIALISTS AG\nCONSULTANTS TO SCHOOL BOARDS WHO.ARE GRAPPLING WITH\nQUESTIONS OF POLICY, HOW THEY SHOULD PROCEED, TO\nOTHER KINDS OF COMMUNITY LEADERSHIP AS WELL, OTHER\nPEOPLE IN DECISION MAKING POSITIONS OR OTHER PEOPLE\n'HO ARE IN POSITION TO PLAY A PART IN THE DECISION\nMAKING PROCESS. THERE AGAIN, THE CALM AND CONSTRUCTIV\nEFFECT OF, LET US SAY, A SCHOOL SUPERINTENDENT FROM\nKentucky who’s been through this experience, who has\nBEEN THE PROCESS OF DESEGREGATION WORK, AND WHO CAN\nBRING TO HIS COLLEAGUES IN A MORE TROUBLED AREA DEEPER\nSouth, very specific, practical advice and assurance\nAND KNOW-HOW. THIS, IT SEEMS TO US, IS THE KIND OF\nVERY VERY BEDROCK ASSISTANCE THAT AN ORGANIZATION LIKE\nTHIS CAN MAKE POSSIBLE. A GOOD MANY OTHER EXAMPLES\nI COULD CITE-—THE OPENING UP OF PUBLIC LIBRARIES IN\nthe South to citizens of both races; our work with the"
}