{
  "id": "d492-187",
  "text": "RICHTER:\nSCHNEIDER:\nMASS MEDIA, NOT ONLY IN THE 80UTH, BUT IN THE REST\nOF THE COUNTRY, BECAUSE BASICALLY WE FEEL THAT IT IS\nJUST AS IMPORTANT WHAT CITIZENS ELSEWHERE FEEL ABOUT\nTHIS QUESTION AS IT IS IMPORTANT WHAT SOUTHERNERS FEEL\nThis is, after all, a national and even international\nproblem. The welfare of the whole United States is at\nstake. Ve can expect no wiser decisions, nationally,\nTHAN THE INFORMATION AVAILABLE TO THE AMERICAN PEOPLE\nmakes possible. An organization like ours, with people\nWORKING IN IT ALL OVER THE SoUTH, WITH THE INSIGHTS\nAND EXPERIENCE AND UNDERSTANDING THAT SOME FROM LONG\nYEARS OF EFFORT IN THIS FIELD, WE THINK CAN PROVIDE\nSOME INTERPRETATION, FACTS, ANALYSIS, UNDERSTANDING,\nTHROUGH THE MASS MEDIA, THAT MAY FACILITATE THE NATIONAL\nSOLUTION TO THIS PROBLEM IN THE END. /AND WE PUT IN A\nGOOD DEAL OF OUR TIME AND EFFORT ON THAT; IF TIME\nPERMITTED, WE COULD SPELL OUT A GOOD MANY EXAMPLES,\nINSTANCES, IN WHICH WE THINK THIS HAS BEEN EFFECTIVE.\nI’M AFRAID NOW TH T JUST AS iViR . FLEMING IS CONSCIOUS\nOF OMITTING A GOOD DEAL IN HIS DESCRIPTION OF THE\nWORK OF THE SOUTHERN REGIONAL COUNCIL, WE’LL HAVE TO\nOMIT A GOOD DEAL AS WELL. LET US, HOWEVER, EXAMINE\nONE MORE ORGANIZATION — A LOCAL ONE. l)0 YOU HAVE A\nSUGGESTION, LoU9\n.7 EL L , I HAVE HERE A REPORT FOR THE YEAR ENDING April\n1358, OF THE CO,, ITTEE ON Huv.AN RELATIONS OF THE CoUN'r\nof Los Angeles.a report submitted by the commi¬\nttee’s EXCUT I VE SECRETARY, iVlR . JOHN A? BuGGS. I’D\nLIKE TO PRESENT SuMETHING OF THE CONTEXT OF THIS REPO\nFOR IT WILL GIVE US AN IDEA OF THE SCOPE OF THE ORGAN¬\nIZATION’S ACTIVITIES. Some INTERESTING data are pre¬\nsented ON THE HOUSING PROBLEMS OF MINORITY GROUPS IN\nLos Angeles, and in fact, the report begins by noting\nTHAT THE SINGLE GREATEST AREA OF DISCRIMINATION TODAY\nIS IN THE FIELD OF RESTRICTIONS AGAINST MEMBERS OF\nMINORITY GROUPS IN THE SALE OF HOUSES. The REPORT GC\"\nON TO DISCUSS TENSIONS IN THE SCHOOLS, PROBLEMS OF\nEMPLOYMENT, DIVISIVE FACTORS IN THE COMMUNITY IN\nGENERAL, AND THE WORK OF THE COMMITTEE ON HUMAN\nRelations. In connection with the Committee’s specifi\nACTIVITIES, ONE FINDS THAT IN THE COURSE OF THE YEAR,\nIT HELD OVER THREE HUNDRED CONFERENCES WITH INDIVIDUAL?\nAND GROUPS. ... CONFERENCES RELATING OF COURSE, TO\nMINORITY GROUP PROBLEMS. NUMEROUS SPEAKING ENGAGEMENT.\nWERE FILLED. CONFERENCES WERE HELD,TOO, WITH LAW\nENFORCEMENT AGENCIES. CONFERENCES WERE HELD WITH\nINDIVIDUALS CLAIMING DISCRIMINATION IN EMPLOYMENT\noutside of County Government. There were radio and\nTELEVISION APPEARANCES ON THE PART OF THE EXE CUT I. VE\nSECRETARY IN DISCUSSION OF MINORITY GROUP CRIME AND\nDELINQUENCY, DISCRIMINATION IN HOUSING, AND SO ON."
}