{
  "id": "d492-188",
  "text": "RICHTER:\n5UGGS:\nSCHNEIDER\nRICHTER:\nThis is out a very partial listing of activities.' Also,\nit’s noteworthy that the committee has devoted a good\nDEAL OF TIME TO ADULT EDUCATIONAL ACTIVITY, A MAIN\nINSTRUMENTALITY OF THIS QEING A TEN SESSION RASIC STUDY\nCOURSE IN HUMAN RELATIONS. AND THE COMMITTEE HAS\nSPONSORED CONFERENCES FOR ’ ’ AL L THE CHAIRMEN OF LOCAL\nHUMAN RELATIONS COMMITTEES WITH WHICH IT WORKS THROUGHOUT\nTHE COUNTY/’ THERE WERE TWO SUCH CONFERENCES FOR THE\nyear ending April 30, 1958, Again, the committee has\nPREPARED '’INFORMATIONAL BULLETINS, STATISTICAL REPORTS,\nAND OTHER MATERIALS DESIGNED TO ACQUAINT THE PUBLIC WITH\nCERTAIN FACTS REGARDING THE PROBLEMS AND PROGRESS IN THE\nFIELD OF HUMAN RELATIONS.\nI KNOW THAT YOU’VE GIVEN US ONLY A PART OF THE STORY OF\nthis Los Angeles County Committee on Human Relations.\nBut now we can do no more than to allow the Lxecutive\nSecretary, Mr. Buggs, a few words of his own on how the\nCommittee came to be formed.\nIt grew out of the zoot suit riots that took place in\nLos ANGELES IN 1944. YOU MAY RECALL THE CONFLICT SITU¬\nATIONS THAT DEVELOPED BETWEEN MARINES THAT WERE STATIONED\nHERE AT THAT TIME AND THE iVlE X I C A N-Am E R I C A NS THAT WORE THE\nZOOT SUITS, SO-CALLED AT THAT TIME. ThE COUNTY BoARD OF\nSupervisors felt that the county government had a RESPOf'\nIBILITY IN THE AREA OF HUMAN RELATIONS, PARTICULARLY AS\nIT RELATED TO CONFLICT AND TENSION. AND THEY ESTABLISHED\nTHIS COMMITTEE FOR THE PURPOSE OF WORKING IN THE AREA OF\nTENSION AND CONFLICT IN ORDER THAT THEY MIGHT DEVELOP A\nPROGRAM LOOKING TOWAD THE ELIMINATION OF IT.\niE HAVE, THEN, REVIEWED QUICKLY AND TO A CONSIDERABLE\nEXTENT IN THE WORDS AND PUBLICATIONS OF THEIR FUNCTION IN\nOFFICIALS, THE WORK OF THREE ORGANIZATIONS ENGAGED IN\nACTIVITIES DESIGNED TO FURTHER THE INTEREST OF THE NEGRO,\nACTIVITIES WE LOOSELY LABELLED DEFENSE. W E HAVE INCLUDE'\nREFERENCE TO A N A TI Q N A L ORGANIZATION, TO AN IMPORTANT\nREG IONA L ORGANIZATION, AND TO ONE PARTICULAR LOCAL ORGAN¬\nIZATION. The concrete and illustrative nature of today\nPROGRAM IS EVIDENT ENOUGH. It IS OUR FEELING THAT\nAmericans wish to, and should, know about the work of\nSUCH ORGANIZATIONS AS THESE. BEFORE WE COME CLOSE TO AN-\nGENUINE '’SOLUTION1’ OF THE SO-CALLED NEGRO PROBLEM, IT\nMAY WELL PROVE NECESSARY THAT AN APPRECIABLE PORTION OF\nOUR CITIZENRY BE DIRECTLY OR INDIRECTLY, AT ONE LEVEL OR\nANOTHER, INVOLVED IN WORK OF THE KINDS THAT WE’VE\nDESCRIBED.\nNext week will bring us to the final program in this\nseries. In this program, we will briefly review some of\nTHE FACTS AND PRINCIPLES WITH WHICH WE HAVE BEEN CONCERN\nDURING THE PAST WEEKS. We’ll TAKE A LOOK AT WHAT THE"
}