{
  "id": "d492-195",
  "text": "-6-\nSCHNEIDER :\nVIDUAL IN THE SOCIETY THE SAME RIGHTS WHICH HE HAS.\nNOW, THE PECULIAR, CONTRADICTORY BACKGROUND OF THE\nNegro as a slave in a country that was founded upon\nTHE PRINCIPLE THAT ALL MEN ARE CREATED FREE AND EQUAL\nHAS SET UP A CONSTANT CONTRADICTION WITHIN THIS YOUNG\nraw American democracy of a gap between its principle\nAND ITS PRACTICES. And HAVING SELECTED THE MOST DIFF\nICULT OF POLITICAL THEORIES UPON WHICH TO FOUND OUR\nCOUNTRY, WE HAVE WITHIN OUR OWN CITIZENSHIP EVERY\nCOLOR AND KIND, IN A SENSE, OF MANKIND THROUGHOUT THE\nWORLD. The LARGEST, SINGLE MINORITY GROUP BEING THE\nNegro. Therefore, the Negro has acted as a barometer\nof democracy, a measuring rod: How effective are\nWE AS A DEMOCRATIC COUNTRY9 HoW NEAR ARE WE TO A C HIE\n|NG THIS GOAL OF DEMOCRACY WHICH WE BELIEVE IS THE\nBEST POSSIBLE POLITICAL ORGANIZATION IN THE WORLD?\nThe preoccupation of the Negro with the implementatio\nOF DEMOCRACY HAS KEPT AFRICANS SENSITIVE TO THESE\nFounding Principles, and sensitive to the goal which\nwe hope to achieve in the long run. And the second\ngreat contribution of the Negro which I think is\nPARTIALLY COMPREHENDED BY MANY AMERICANS IS THE\nSPIRITUAL QUALITY WHICH HAS GROWN OUT OF THIS EXPER¬\nIENCE OF OPPRESSION AND SLAVERY. THAT IS THE ABILITY\nTO PATIENTLY WORK TOWARD FIRST-CLASS CITIZENSHIP\nWITHOUT CONTINUOUS VIOLENT REBELLION. ThESSELF-\nRESTRA I NT AND THE DISCIPLINE WHICH NEGROES BY AND\nLARGE HAVE SHOWN THROUGHOUT THIS LONG, LONG STRUGGLE\nFOR HUMAN DI G A I TY-AND I THINK THAT THIS HAS BEEN\nPARTICULARLY DRAMATIZED IN THESE INCIDENTS IN RECENT\nYEARS IN THE SOUTH: IN THE MONTGOMERY BOYCOTT, FOR\nEXAMPLE, AND IN THE EXEMPLARY BEHAVIOR OF THE NINE\nLittle Rock, Arkansas, students and of ivirs. £ates,\nTHEIR LEADER, IN FACING VIOLENCE, IN FACING HUMILIA¬\nTION, WITH ALMOST SUPERHUMAN DIGNITY AND RESTRAINT.\nAnd when you interviewed these people and talked with\nTHEM, YOU FOUND THAT THEY WOULD SAY, fAe PRAYED 3EF0P\nWE LEFT HOME IN THE M OR N I NG , ,f AND THAT nWE HAVE A\nGREAT BELIEF IN GoD, AND 3 UT FOR OUR FAITH IN God, WE\nNEVER WOULD HAVE MADE IT.'* /AND I THINK THAT EVERY\nCOUNTRY, IF IT IS GREAT, MUST HAVE GREAT SPIRITUAL\nroots. And I think Negroes have been forced to\nDEVELOP THIS SPIRITUAL QUALITY AND I THINK AMERICA\nIS THE RI CHER FOR IT.\nThis two-fold political and religious appeal comes\nUP TIME AND AGAIN IN THE INTERVIEW MATERIALS YOU GA¬\nTHERED. I RECALL THAT WHEN YOU ASKED GeNJAMIN MAYS,\nTHE WELL-KNOWN NEGRO EDUCATOR, WHAT THE FUTURE HOLDS\nfor the Negro in the United States he, too, reverted\nTO THESE CONSTANTS: APPEAL TO POLITICAL PRINCIPLE,\nAPPEAL TO RELIGIOUS PRINCIPLE. TH|S IS EXTREMELY\nIMPORTANT, IT SEEMS TO ME, AS REVEALING NegRO HOPE\nand Negro sentiment."
}