{
  "id": "d492-196",
  "text": "-7-\nRICHTER:\nMAYS:\nSCHNEIDER:\nR I CHTER :\nSCHNEIDER:\nLet’s listen to Dr. Mays then, as he answers our\nQUESTION, ” -HAT DOES THE FUTURE HOLD9'*\nNOW YOU HAVE ASKED THE TOUGHEST QUESTION OF ALL. I\nTHINK WHEN, WHEN WE GET A CHANCE TO LOOK AT OURSELVES,\nwe’ve got to move on. You see, Never’s a long time.\nAnd I don’t believe any man is wise enough to predict\nTHAT there’ll NEVER BE ANY DESEGREGATION IN HIS STATE.\nVi! hen A MAN TALKS LIKE THAT he’s A, he’s ASSUMING THE\nROLE OF God, AND I don’t THINK THAT ANYBODY HAS A\nRIGHT TO PLAY GOD. I THINK THAT WE WILL INEVITABLY\nMOVE TOW1 ARDS DESEGREGATION IN EVERY AREA OF AMERICAN\nLIFE. HOW LONG WILL IT TAKE? I DON’T KNOW. <F WE\nDO NOT MOVE THAT WAY, WE SHOULD GIVE UP OUR LEADERSHIP\nIN THE WORLD AS A, AS A GREAT DOMOCRACY; AND WE SHOULD\nstop talking to the people in Asia and Africa about\nFREEDOM, AND ABOUT DEMOCRACY. 'NO WE SHOULD STOP\nTRYING TO EVANGELIZE THE HEATHENS. Do OUR, OUR MORAL\nleadership in the world is...is...is at stake. And\nAS LONG AS WE HOLD ON TO THE AMERICAN CONSTITUTION\nAND AS LONG AS WE PRAACH CHRIST, AND TALK ABOUT GoD\nBEING THE FATHER OF ALL MANKIND, WE CAN’T, WE CAN’T\nSTOP WORKING ON THIS PROBLEM TO MAKE IT POSSIBLE FOR\nevery American to have the right to grow, and to\nDEVELOP UNHAMPERED IN KEEPING WITH HIS ABILITIES AND\nHIS POWERS. A £ , WE CAN’T MOVE ANY OTHER WAY UNLESS\nWE ARE GOING TO BECOME A FA8C!ST STATE, AND THAT,\nAmerica can’t afford.\nLet me come in again at this point to note that our\nSTRESS HAS BEEN THAT THERE ARE CERTAIN GROUNDS FOR\nOPTIMISM ABOUT THE NEGRO’S CAUSE IN THE UNITED STATED\nThe last general matter we’ve 3EEN discussing in thid\nCONNECTION IS THE MATTER OF DEMOCRATIC PRINCIPLES.\nAND WE’VE JUST NOTED THAT THE NEGRO HAS HOPE IN, AND\nMAKES APPEALS TO THEM.JUST AS HE APPEALS TO\nRELIGIOUS PRINCIPLES. THERE IS ALSO SOME GROUND FOR\nHOPE FOR THE NEGRO’S CAUSE IN THE EXPECTATION AND\nCRITICISM OF PEOPLES ABROAD. A T-IOUSAND AND ONE\nWITNESSES TESTIFY TO THE FACT THAT CRITICAL EYES\nFOCUS ON THE UNITED STATES, ESPECIALLY IN RESPECT OF\nthe Negro problem ajb conn-f ctej31j,v i th the democr at f c\nface the United States wishes to turn to the world.\nI THINK THAT THIS MAY USTIMATELY BE OF SOME IMPORTANCE\nIN ‘’FIRMING UP'* MORE DEMOCRATIC TREATMENT OF THE\nNegro...\nAnd yet, wouldn’t you admit that some segments of the\nWHITE POPULATION OF THE UNITED STATES MIGHT BE WILLING\nTO PAY THE PRICE IN ILL-WILL AMONG NATIONS ABROAD FOR\nCONTINUING TO PRACTICE DISCRIMINATION AGAINST THE\nNegro?\nOf COURSE I ADMIT SUCH POSSIBILITIES. THERE ARE HARD"
}