{
  "id": "d492-197",
  "text": "-8-\nCHOICES TO BE MADE IN CONNECTION WITH THE NEGRO, AND\nTHERE IS NO GUARANTEE THAT THEY WILL ALWAYS 3E MADE\nas the Negro would like to see them made.\nRICHTER: I notice that you used the phrase \"hard choice.'*\nInterestingly enough, wir, Harold Fleming, Director\nof the Southern Regional Council, developed this noti\nIN A QUICK REVIEW of AREAS IN WHICH SOUTHERNERS DO\nface HARD CHOICES, '’HEN WE SPOKE WITH HIM IN ATLANTA\nSOME TIME AGO* MR. FLEMING STRESSES SEVERAL THINGS\nWE’VE ALREADY STRESSED IN TODAY’S PROGRAM, AND ADDS\nONE OR TWO THINGS TO WHICH WE MIGHT WELL HAVE PAID\nMORE ATTENTION.\nFLE.vilNG: Let us say the South is committed at the moment, its\nOFFICIAL LEADERSHIP IS COMMITTED TO TWO THINGS: It’S\nCOMMITTED TO THE ADVANCEMENT OF THE SOUTH’S ECONOMY—\nTHE GROWTH OF THE MODERN URBAN~I NOUSTR I AL COMPLEX IN\nthe South; and iTfs devoted to the preservation of\nSEGREGATION AS A KIND OF ABSOLUTE . VV E BELIEVE, AND\nI THINK A GOOD MANY STUDENTS OF THE QUESTION BELIEVE,,\nTHAT THESE TWO THINGS ARE INCOMPATIBLE, AND SOONER\nOR LATE , IN EVERY GIVEN SITUATION, THE DOCTRINE OF\nHARD CHOICES MAY DE EXPECTED TO OPERATE. ThAT IS,\nA COMMUNITY OR STATE IS GOING TO HAVE TO CHOOSE WHETH\nTO ADVANCE ITS ECONOMIC PROGRESS, ITS INDUSTRIAL\nGROWTH, AND THE ORDERLY GROWTH AND FUNCTIONING OF ITS\nCITIES, OR WHETHER TO DEDICATE ITSELF TO A, AN UN¬\nYIELDING, ABSOLUTIST ADHERENCE TO SEGREGATION. ThIS\nIS TRUE FOR A VARIETY OF REASONS, BUT TWO THINGS MAIL\nTHAT IS, THE INSISTANCE OF NEGROES THEMSELVES, WHICH\nDON’T THINK WILL GO AWAY, THAT THESE CHANGES COME\nABOUT; AND SECONDLY, THE INCREASING, THE MOUNTING\nPRESSURES IN TERMS OF LEGAL AND ADMINISTRATIVE ACTION\nWITHIN THE NATIONAL GOVERNMENT. THERE IS ALSO THE\nOPINION OF THE REST OF THE COUNTRY AND THE REST OF\nTHE WORLD THAT HAS TO CONSIDERED IN THESE CHOICES.\nThat’s one example. There are a number of hard\nCHOICES INVOLVED—SOME OF THEM OF THE EHTICAL OR MORA\nNATURE. IF IT BECOMES APPARENT THAT THE ONLY WAY TO\nRESIST THE ADVANCE OF DESEGREGATION IS BY VIOLENCE OK\nILLEGAL MEANS, OBVIOUSLY THE GREAT MAJORITY OF WHITE\nSoutherners would be loathe to resort to these method\nAND LIKE PEOPLE ANYWHERE, WOULD VERY MUCH, BE VERY\nMUCH OPPOSED TO THE BREAKDOWN OF LAW AND ORDER.\nAgain, you see, a doctrine of hard choices. Similar!.,\nthe South is referred to as the Bible Belt and there\nIS A GREAT DEAL OF RELIGIOUS ACTIVITY, RELIGIOUS\nCOMMITMENT IN THE SOUTH. AGAIN, RELIGIOUS VALUES AS\nAGAINST THE TRADITIONAL FOLK VALUES OF THE SOUTH IN\nTHE FIELD OF RACE-THAT IS ADHERENCE TO SEGREGATION--\nARE IN CONFLICT BASICALLY. AND WHEN THAT CONFLICT\n3EC0MES VERY SHARP AND VERY IMMEDIATE, THESE VALUES"
}