{
  "id": "d492-198",
  "text": "_o_\nREALLY HAVE TO BE WEIGHED AGAINST EACH OTHER AND A\nCHOICE MADE WHICH IS MORE IMPORTANT. AND THOUGH IT\nMAY NOT SEEM SO AT A DISTANCE, THERE IS TERRIFIC INNE\nCONFLICT \"'I THIN THE SOUTH TODAY, THAT IS WITHIN THE\nINDIVIDUAL WHITE SOUTHERNER AND WITHIN THE WHITE SOUTH\nAS A GROUP, BETWEEN INDIVIDUALS WITHIN THE WHITE SOUTH\nThere’s a great deal of conflict, a great deal of\nDISTRESS OF SPIRIT, AS THESE VALUES CLASH AND HAVE TO\n3 E SELECTED AMONG.\nSCHNEIDER: The last assertion of Mr. Fleming to the effect that\nTHERE’S A GREAT DEAL OF CONFLICT AND DISTRESS OF\nSPIRIT IS PERTINENT. GIVEN THE WAY OUR DISCUSSION\nHAS GONE TODAY, I THINK IT1S WORTH REMARKING THAT\nTHERE SEEMS LITTLE DOUBT THAT THIS KIND OF CONFLICT\nMOTIVATES DESIRES TO PROCEED ”GRADUALLY ' ’ . I FEEL WE\nSHOULD SAY SOME THINGS ABOUT GRADUALISM IN GENERAL.\nFor one thing, the watchword \"gradualism” tends to\nDECOME A SLOGAN FOR PEOPLE WHO BELIEVE THEMSELVES TO\nBE THINKING WISELY WHEN THEY REFLECT OR SAY, \"WELL,\nSOMETHING LIKE THIS JUST HAS TO BE DONE GRADUALLY .\nThis kind of thinking, if thinking is the word for it\nIS REALLY QUITE USELESS. GRANTED, THERE MAY BE FACTCP\nIN VARIOUS SITUATIONS THAT REQUIRE A SLACKENING OF\nPACE, JUST AS THERE MAY BE FACTORS, FOR THAT MATTER,\nIN OTHER SITUATIONS, ON THE BASIS OF WHICH ONE COULD\nCOUNTENANCE A SPEEDING UP OF PACE. '3UT WE HAVE TO\nUSE OUR HEADS, AND IT BECOMES SAD WHEN ALL WE CAN\nFIND IN THEM IS SLOGANS. LET ME ILLUSTRATE WHAT i\nmean. Those who like gradualism as such, and persua,\nTHEMSELVES THAT THEY HAVE CAUGHT ON TO A PHILOSOPHY,\nARE VERY LIKELY TO BELITTLE ?’ E X TR EM I SM\" . OnE WONDERS\nIF THEY HAVE EVER THOUGHT THROUGH WHAT ’’EXTREMISM1’ IN\nTHIS CONTEXT REALLY MEANS. I THINK VERY APT, IN THU\nCONNECTION, SOME WORDS BY vVlLLlAM PETERS, AUTHOR OF\nThe Southern Temper, an able journalistic survey of\nTHE PRESENT DAY SOUTH. kiR . PETERS WRITES AS FOLLOWS,\n■’But who are the ’extreme’ desegregationists0 martin\nLuther King, with his doctrine of non-violent resist¬\nance0 Thurgood Marshall, with his reasoned arguments\nBEFORE THE SUPREME COURT? CATHOLIC ARCHBISHOP JOSEPH\nRUiviMEL, WITH HIS STATEMENT THAT RACIAL SEGREGATION IS\nMORALLY WRONG AND SINFUL? ONE LOOKS IN VAIN TO FIND\nDESEGREGATIONIST WHO HAVE USED OR EVEN ADVOCATED\nVIOLENCE OR UNLAWFUL MEANS TO ATTAIN THEIR ENDS.'\nRICHTER: If I understand you then, you are making an appeal t\nUS REALLY TO THINK ABOUT THESE PROBLEMS. SLOGANS ANL\nPHRASES SUCH AS \"'H E’VE GOT TO DO THIS THING GRADUALLY.\nAT LEAST WHEN THEY ARE NOT TIED CLOSELY TO ANALYSIS Or\nAND THINKING THROUGH OF, REAL SITUATIONS SOUND QUITE\nHOLLOW *\nSCHNEIDER: Quite"
}