{
  "id": "d492-21",
  "text": "RICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nAnd it’s generally hard to argue with such people\nABOUT SUCH THINGS. . i HAT THEY* VE SEEN AND EXPERIENCED\nIS FREQUENTLY MUCH MORE VALID TO THEM THAN THE OB¬\nSERVATION AND EXPERIENCE OF OTHERS. ..AND SOMETIMES\nEVEN THEIR OWN SUBSEQUENT OBSERVATION AND EXPERIENCE\n|j’S NO USE PRETENDING THAT THIS IS AN EASY THING TO\ncombat. People will generalize on the basis of very\nSPECIAL KINDS OF DATA. HOWEVER, THE SITUATION ISN’T\nHOPELESS .. .THERE ARE SOME CORRECTIVES SEEPING THROUGH\nTO THE GENERAL POPULATION THROUGH THE WORK OF SOCIAL\nSCIENTISTS, PSYCHOLOGISTS, AND OTHERS. BuT THIS RE¬\nMAINS AN IMPORTANT FRONT TO FIGHT ON...A FRONT THAT\nWE CAN BE FAIRLY CERTAIN WON* T DI SAPP EAR OVERNIGHT.\nWhat you say brings to mind a conversation I had not\nLONG AGO WITH A MAN WHO EMPLOYS NEGROES. In HIS ES¬\nTIMATION, AND TO HIM THIS HAS BEEN BORNE,OUT BY HIS\nEXPERIENCE, A NEGRO IS INCAPABLE OR UNWILLING TO TURi\nOUT AS MUCH WORK AS A WHITE PERSON IN THE SAME JOB.\nAND I BELIEVE THIS MAN WAS SINCERE IN THIS BELIEF.\nAfter all, he had had Negroes working under him for\nMORE THAN TWENTY YEARS. AND I SUPPOSE THIS ALSO\nCOULD BE AN EXAMPLE OF THE BAD SAMPLE PHE3 NOMENON .\nIt might well be. However, we often produce or help\nTO PRODUCE IN THE OBJECTS OF OUR PREJUDICE AND DIS¬\nCRIMINATORY BEHAVIOR ATTRIBUTES WHOSE CAUSATION WE\nCONVENIENTLY FORGET. IN THIS CONNECTION l*D PART¬\nICULARLY LIKE UP TO PAY ATTENTION TO WHAT THE SOCI¬\nOLOGIST Robert K. Merton has called the self-fulfill\nI NGPROPHESY . YOU MAY REMEMBER THAT GENERAL PHIL\nSheridan used to say that the only good Indian was\na dead Indian. Suppose white men act on this premis\nand treat Indians accordingly. Vhat happens then?\nVell, I’ve seen enough westerns to make a good guess\n’/HE NEVER A WHITE MAN COMES ON AN INDIAN HE’LL IMMED¬\nIATELY WANT TO MAKE HIM A GOOD INDIAN. AND THEN THE\nIndian, finding himself shot at whenever he encount¬\ners A WHITE MAN, IS GOING TO TURN AROUND AND TRY TO\nKILL WHITE MEN WHEN EVER HE SEES ANY OF THEM.\nYes, and thereby Sheridan’s observation would be\nSEEM TO BE VERIFIED. THAT THE ONLY GOOD INDIAN IS\ndead Indian, for after all, white men would say,\nnYOU SEE, WHENEVER YOU COME ACROSS AN INDIAN HE TRIE\nTO KILL YOU. Any MAN OF GOOD SENSE CAN TELL THAT\nTHE ONLY GOOD INDIAN IS A DEAD ONE.” ThIS ILLUS¬\nTRATES THE MECHANISM OF THE SELF-FULFILLING PROPHESY\nOF COURSE, WHAT THE WHITE MAN QUITE OVERLOOKS AS HIS"
}