{
  "id": "d492-24",
  "text": "THE LAST CITIZEN\nProgram H3\nf? I t . orks Both .'ays 11\nSMITH: A person who is always reminded that he is second\nCLASS...AND OF COURSE HE ISN’T SECOND CLASS...BUT Wh\nIS TOLD THAT HE DELONGS TO A SECOND CLASS GROUP...HE\nMUST ALWAYS BE PUSHED BACK A BIT...HE MUST ALWAYS Si\nAT THE BACK OF A STREETCAR, OR SIT AT THE BACK OF TK\nBUS, OR GO IN THE SIDE ENTRANCE CALLED COLORED. THAT\nPERSON IS DEEPLY INslURED PSYCHOLOGICALLY. NOW, THE\nPERSON WHO DOES THAT TO HIM IS INJURED PSYCHOLOGICAL\nLY, TOO. It WORKS BOTH WAYS.\nMUSIC_STINGER\nANNCR: Prejudice effects both the Negro and the white. Ho'\nDOES IT DO THIS? LISTEN AS WE EXPLORE THE EFFECTS C\nPREJUDICE IN DISCUSSING \"THE LAST CITIZEN11\nMUSIC_STINGER\nANNCR: The Last Citizen: The Negro in America. A series of\nPROGRAMS DEVOTED TO EXTENSION OF OUR KNOWLEDGE OF TK\nLARGEST MINORITY GROUP IN THE UNITED STATES, ITS PRC\nLEMS, AND THE PROBLEMS IT POSES TO ALL AMERICANS. T}\nLast Citizen is produced by Radio Station VVBAA, Purl\nUniversity, under a grant from the Educational Tele¬\nvision and Radio Center, in cooperation with the Na¬\ntional Association of Educational Broadcasters. The\ndiscussants are the Producer of the Series, E.W.\nRichter, and Dr. Louis Schneider, Professor of Soci¬\nology at Purdue University. Today’s program: \"It 'Vof\nBoth .Vays1’ Here now, is Mr, Richter.\nRICHTER: During the course of our program last week we explof\nTHE NATURE OF PREJUDICE AS WELL AS THE NATURE OF PEC\nPLE WHO ARE PREJUDICED. But AN IMPORTANT QUESTION W!\nWHICH WE DIDNOT DEAL IS W KiT DOES PREJUDICE DO TO\nPEOPLE? vVHAT HAPPENS TO THE PERSON AGAINST WHOM PRE¬\nJUDICE IS DIRECTED? I N THIS INSTANCE, THE NEGRO. A N D\nWHAT DOES IT DO TO THE PERSON WHO HOLDS PREJUDICE\nOP I NI ONS?\nSCHNEIDER: Let me say, walt, that I think it will be a good ide\nIN THIS PROGRAM TO HAVE IT UNDERSTOOD THAT WE ARE U£\nI NG THE TERM PREJUDICE IN .A VERY WIDE SENSE INDEED.\nLast week it was important for us to distinguish pre\nJUDICE FROM DISCRIMINATION. AND WE MIGHT EVEN FURTHE\nDISTINGUISH SEGREGATION AS A PARTICULAR FORM OF DIS-\nCR I M I NATORY . BEHA V I OS . ’SuT WW5TC W E •; A R E P S E E K 1 ffl G B <P R A"
}