{
  "id": "d492-26",
  "text": "-3-\nRICHTER:\nCLARK :\nRICHTER:\nSCHNEIDER:\nVIEW OF ONESELF.\nAnd the formation of a self-image begins in earliest\nchildhood. Dr. Kenneth Clark, a noted Psychologist,\nand his wife, have done research on this question in\nregard to the Negro child. ';hen we visited him in hi\nHarlem office Dr. Clark described his findings for ui\nThe Negro child, very early in his life, I would say\nAROUND THE AGE OF 5 OR 6, THE NEGRO CHILD OF NORMAL\nINTELLIGENCE, LEARNS NOT ONLY THAT HE IS DIFFERENT\nFROM THE PREDOMINANT SOCIETY IN TERMS OF SKIN COLOR\nBut he also learns that the larger society evaluates\nhis skin color negatively. That because of his diff¬\nerence IN SKIN COLOR HE IS SEEN AS INFERIOR. He LEA!\nTHAT HE IS GENERALLY RELEGATED TO AN INFERIOR STATUS\n...THAT HE IS REJECTED BY THE LARGER SOCIETY. Aj\nTHIS AGE THE CHILD SEEMS TO BE CONFUSED ABOUT THIS\nPATTERN IN THE LARGER SOCIETY OF REJECTING HIM IN TEk\nOF HIS OWN SKIN COLOR, AND HE TENDS TO ADOPT THE VALL\nOF THE LARGER SOCIETY, THAT IS, HE TENDS TO REJECT\nHIMSELF. IT IS NOT UNCOMM0N . . . INFACT, I WOULD SAY,\nTHE BASIS OF OUR RESEARCH, OVER TWO THIRDS...OR TWO\nTHIRDS, OR APPROXIMATELY TWO THIRDS OF NEGRO CHILDRE'\nAT THE AGE OF 5,6, AND 7 HAVE CLEAR, DEMONSTRABLE FEE\nINGS OF INFERIORITY ABOUT THEIR STATUS AS NEGROES,\nThey feel inferior and they believe themselves to be\ninferior. They reject themselves they consider them¬\nselves. ..DIRTY, OR...INADEQUATE. ThEY WONDER, THEY\nRECOGNIZE THAT THE LARGER SOCIETY DOES NOT GRANT THE\nTHE SAME RESPECT WHICH IS GRANTED TO WHITE CHILDREN\nI WOULD SAY THAT WE HAVE ACCUMULATED A GREAT DEAL OF\nEVIDENCE THAT.. .POINTS CONCLUSIVELY TO THE FACT THAT\nNegro children, growing up in our society, which mak\nPERFECTLY CLEAR THAT THEY ARE SECOND CLASS CITIZENS.\nTHAT THEY ARE NOT GIVEN THE RESPECT THAT OTHER CHILD\nREN ARE...UH, THEY HAVE TERRIBLE PROBLEMS IN SELF¬\nESTEEM, FOR THE MOST PART.\nThus Or. Clark gives us an idea of>the dilemmas and\nPROBLEMS THE NEGRO CHILD FACES IN EVALUATING HIMSELF\n...IN BUILDING HIS SELF-IMAGE.\nThere have been certain technical criticisms of the\nINVESTIGATIVE PHASES OF Dr. CLARK’S WORK. But IN TH\nSTATEMENTS FROM HIM WHICH WE HEARD, HE PUTS FORTH\nVIEWS THAT SEEM TO BE GENERALLY COMPATIBLE WITH SUCH\nINFORMATION AS WE HAVE. ThEY WOULD SEEM, AT LEAST,\nHIGHLY PLAUSIBLE IN THE LIGHT OF MUCH CONTEMPORARY\nPSYCHOLOGICAL THOUGHT."
}