{
  "id": "d492-29",
  "text": "-6-\nRICHTER:\nCL'XRK:\nHELPS TO GENERATE SOME OF THE DISTINCTIVE NEGRO CUl\nTURAL CONTRIBUTIONS, FORCED TO STRUGGLE WITH THIS\nPROBLEM OF SELF-I MAGE , MANT A NEGRO MAY PUSH HIMSEL\nTO ACHIEVEMENTS DESIGNED TO PROVE ONCE AND FOR ALL\nHIS ULTIMATE WORTH. ON THE OTHER HAND, I CAN READ!\nLY CONCEIVE THAT IN MANY OTHER CASES THE OUTCOME\nWOULD NOT BE ONE FAVORABLE TO ACH I EVEMENT. . . ART I ST ’\nSCIENTIFIC, AND THE LIKE. THE TR0UBLESOMENESS OF\nSTABILIZING THE SELF-IMAGE, I SHOULD CERTAINLY THIS\nMIGHT LAY DOWN PSYCHOLOGICAL DISPOSITIONS TO THING'\nLIKE DELINQUIENT OR CRIMINAL BEHAVIOR. ToRTURE, I\nSUPPOSE, MAY LEAD TO CREATIVITY. BUT IT MAY ALSO\nLEAD TO WHAT OUR SOCIETY MUST REGARD AS CULPABLY\nDEVIANT, EVEN CRIMINAL, BEHAVIOR.\nOr. Clark, too, has some words on this subject, he\nCONTINUES TALKING ABOUT NEGRO CHILDREN.\nAS THEY GET OLDER SOME OF THEM MAY DEVELOP PROTECT\nDEVICES AGAINST THIS ASSAULT ON THEIR PERSONALITY.\nSome of them, particularly working class or lower\nclass Negro childrenresent this so deeply that\nTHEY BECOME AGRESSIVE, ANTAGONISTIC, HOSTILE, TOWA,\nTHEMSELVES, TOWARD OTHER NEGROES, AND TOWARD MEMBE\nOF THE DOMINANT GROUP. THESE CHILDREN WILL SOMETI\nACT OUT THEIR HOSTILITY IN THE FORM OF ANTI-SOCIAL\nAGRESSIVE BEHAVIOR WHICH THE LARGER SOCIETY CALLS\ndelinquent. This is a kind of self-destructive wa\nOF REACTING 10 THE BASIC PROBLEM IN SELF ESTEEM,\nBUT I THINK AS LONG AS THE INJUSTICE PERSISTS, SOC\nETY WILL HAVE TO PAY THIS COST IN TERMS OF HUMAN B.\nBEINGS REACTING TO THIS INJUSTICE IN ANTI-SOCIAL\nforms. Middle class Negro children are not as pro>\nTO ACT OUT THEIR BASIC FEELINGS OF INFERIORITY IN\nTHIS DIRECT, AGRESSIVE WAY. MANY TIMES THEY SORT\nTURN THEIR AGRESSION INWARD, AND BECOME DISTURBED\nABOUT THEMSELVES, AND RATHER PUNITIVE TOWARD THEM¬\nSELVES, AND RATHER PUNITIVE TOWARD THEMSELVES.\nThey feel that their problems are inevitable becau\nthey are Negroes. They sometimes blame lower class\nNegroes for their difficulties, Uh, sometimes, uh\nNegroes are abl to deal with this basic problem o\nSELF-ESTEEM BY WHAT THE PSYCHOLOGISTS CALL COMPEN¬\nSATORY activity. That is, they engage in a pattern\nof outstanding achievement. They insist upon bein:\nEXCELLENT OR VERY GOOD. Uh, THIS IS PARTICULARLY\nTRUE, I THINK, OF CHILDREN WHO ARE FORTUNATE ENOUGH\nTO HAVE PARENTS WHO GIVE THEM GUIDANCE THAT MIDDLE\nCLASS PARENTS ARE EXPECTED TO GIVE. ..TO MAKE THEM\nREALIZE THE IMPORTANCE OF EDUCATIONAL ACHIEVE¬\nMENT UH, WHO VERY EARLY IN THE LIFE OF"
}