{
  "id": "d492-30",
  "text": "-7-\nSCHNEIDE\nRICHTER:\nMORRO\nRICHTER:\nTHE CHILD THE PARENTS MAY TELL THEM THAT THE ONLY\nWAY TO OVERCOME THE HANDICAPS OF BEING NEGRO IS BY\nEXCELLING IN CERTAIN ACTIVITIES, PARTICULARLY ACAD¬\nEMIC activities. These children are , in a sense,\nREQUIRED TO WALKING STEREOTYPES...! MEAN WALKING\nREFUTATIONS OF THE STEREOTYPES. THEY ARE REQUIRED\nTO EXCEPTIONALLY CLEAN. . . EXCEPTI 0NALLY HONEST, EX¬\nCEPTIONALLY BR I GHT ... BECAUSE THEIR PARENTS, I PRE¬\nSUME WITH SOME JUSTIFICATION, BELIEVE THAT THIS IS\nTHE ONLY WAY THAT THEY CAN FIGHT AGAINST THE PRESSU\nOF INFERIOR RACIAL STATUS WITHOUT BEING SELF-DESTRU\nTIVE. I THINK THIS MAY HAVE MADE TO VARIOUS ASPECT\nOF AMERI CAN LIFE.\nI think Or. Clark exempIifies every well what can\nhappen in various types of personality because of\nTHIS CONFLICT OF SELF-IMAGES OF WHICH WE HAVE BEEN\nDISCUSSING.\nIn connection with what we have been speaking abou\nLOU...ItVE BEEN CONSTANTLY IMPRESSED WITH THE FEEL¬\nING OF RESPONSIBILITY TOWARD THE GROUP ON THE PART\nof those Negroes who have achieved-broken free-in\nSENSE - FROM THE LIMTIATJONS IMPOSED ON THE GROUP\nThis was brought out rather eloquently by Dr. E.\nFrederick Morrow, assistant to President Eisenhower\nPerhaps his comments will give us another clue to\nTHE MATTER OF SELF-IMAGE.\nWell, a Jackie Robinson or Ralph Bunche, or any\nPERSONS WHO HAVE BEEN FORTUNATE ENOUGH TO RISE TO\nSTATURE. ..TO RISE TO POSITIONS OF PROMINENCE IN TH !\nCOUNTRY, THERE IS ALWAYS THIS BURDEN OF 17 MILLION\nOTHER PEOPEL WHOM YOU CARRY ALONG BECAUSE OF RACE\nPRIDE AND BECAUSE OFTREMENDOUS INTEREST IN HAVING\nYOUR RACE DEVELOP AND BECOMING RECOGNIZED IN THE\nHUMAN FAMILY. THIS IS SOMETHING THAT MOST OF US ARE\nTAUGHT AT OUR PARENTS’ KNEE. ..THAT IF YOU SUCCEED\nTHAT IS NOT ENOUGH. ..YOU MUST REACH DOWN AND HELP\nOTHERS RISE, TOO, BECAUSE ONLY WHEN MANY OF US HAVi.\nBEEN ABLE TO ACHIEVE THE TOP AT WILL WE BE ABLE TO\nLOOK BACK WITH ANY DEGREE OF PRIDE, OR WILL WE BE\nRECOGNIZED IN THE HUMAN FAMILY AS A GROUP OF PEOPLE\nWHO HAVE ACHIEVED AND WHO HAVE ARRIVED. THIS IS 8 CM\nTHING THAT IS WITH US EVERY WAKING MOMENT OF THE D\nAND IT KILLS A GREAT MANY OF US BECAUSE IT IS A\nTREMENDOUS RESPONSIBILITY. AND EVERY MOVE WE MAKE,\nEVERYTHING WE DO, EVERY ACTION WE TAKE, WE MUST RE¬\nMEMBER THAT THIS IS GOING TO AFFECT THE DESTINY AND\nTHE FUTURE OF 17 MILLION OTHER PEOPLE.\nDO YOU FIND THIS AT ALL A LIMITATION UPON YOUR ABILI\nTO JUST BE A PERSON ?"
}