{
  "id": "d492-31",
  "text": "-8-\nMORRO'-'/:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nUh, that’s a pretty good question. Maybe it prevents\nUS FROM RELAXING AS MUCH AS WE WOULD LIKE TO RELAX.\nThere’s always a sort of a tensen ss...there’s always\nA DEMANDING NECESSITY OF DOING ONE’S BEST AT EVERY Tl\nNO MATTER HOW SIMPLE THE OCCASION OR HOW SIMPLE THE\nOPERATION, BECAUSE WHAT YOU DO MAY DETERMINE WHAT HAP\nHAPPENS TO SOMEONE ELSE, SO, IT’S A PRETTY TENSE LIFE\nTHAT ONE LIVES WHO HAS HAD THE GOOD FORTUNE OR THE\nMISFORTUNE UH, TO ACHIEVE A LITTLE BEYOND THE ORDINAL\nI THINK THAT WE CAN SAY THEN THAT THE WHITE MAN WHO\nEXCELS, ACHIEVES, REACHES A DISTINGUISHED POSITION\nOR THE LIKE, MAY WELL HELP HIS SELF-IMAGE BY HIS . .\nACHIEVEMENTS - AND THAT IS THE END OF THE MATTER. Not\nso for Mr. Morrow. He is constrained. He is con--\nSTRAINED TO INCLUDE IN H|fc SELF-IMAGE THE PICTURE OF\nA PERSON WHO, HAVING ATTAINED SOMETHING, MUST FURTHER\nIDENTIFY HIMSELF AS A REPRESENTATIVE OF A DISADVANTAG\nGROUP, WHICH HE CANNOT ’LET DOWN*' OR MUST SOMEHOW CON\nTINUE TO AID. ALL THIS REPRESENTS A TENSION, IN CONN\nEOT ION WITH SELF-IMAGE, THAT IS PECULIARLY ATTACHED T\nbeing A Negro in present day America.\nAnd Mr. Morrow is not an isolated individual...! foun\nHIS SENTIMENTS ECHOED AMONG THE GREAT MAJORITY OF\nNegroes prominent in public and academic life;. And I\nthink, Lou, that we might even consider this as being\nAN INDIRECT POSITIVE RESULT OF DISCRIMINATION AND\nprejudice and segregation. For it is these things\nWHICH MOTIVATE- ALMOST FORCE THE CAPABLE NEGRO TO\nBECOME A LEADER. ..TO WORK ACTIVELY FOR THE ADVANCEMEN\nof the Negro. Thus, prejudice helps to sow the seeds\nOF ITS OWN DESTRUCTION.\n! don’t think I’d quarrel with you. But do we not\nHAVE A RATHER PARADOXICAL AND TRAGIC SITUATION HERE?\nIT SEEMS TRUE ENOUGH THAT PREJUDICE, DISCRIMINATION\nAND SEGREGATION AROUSE OPPOSITION AMONG NEGROES AND\nSTIMULATE LEADERSHIP TO GET RID OF THESE VERY THINGS.\nBut<IEcTHESE.THINGS HADN’T EXISTED IN THE FIRST PLACE\nTHERE WOULDHAVE BEEN NO STIMULATION OF THE KINO YOU\nREFER TO. ONE CAN’T HELP FEELING, THAT THERE IS HERE\nAN UNHAPPY WASTE OF ENERGY.\n.Ve’ VE LOOKED AT A FEW OF THE MORE IMPORTANT ASPECTS\nof the Negroes psychological problems which are gen¬\nerated BY PREJUDICE, DISCRIMINATION AND SEGREGATION.\nBut what of the prejudiced person - does he go scot\nFREE IN THIS SITUATION? I’M REMINDED OF THE OFT-"
}