{
  "id": "d492-34",
  "text": "RICHTER:\nSCHNEIDER:\nRICHTER:\nGOLDEN:\nIn this situation it seems that everybody GETS CHE\nED PSYCHOLOGICALLY-THE NEGRO WOMAN FINDS HERSELF\nDEGRADED ... TREMENDOUSLY DEGRADED IN ORDER TO EXPLAi\nTHE WHITE MAN’S SUCCUMBING TO HER. THE WHITE WOMAN\nIS FANTASTICALLY IDCULIZED TO THE POINT WHERE SHE\nMAY FIND IT DIFFICULT TO BEHAVE LIKE AN ORDINARY\nHUMAN BEING - WHO COULD POSSIBLE LIVE UP TO A PIC¬\nTURE OF SUCH VIRTUE^ AND THE WHITE MAN CHEATS HIM¬\nSELF IN TURN BY BUILDING A COMPLETELY FALSE PICTURE\nOF BOTH WOMEN - THE NEGRO AND THE WHITE. AND THIS\nWOULD SEEM TO BEAR OUT WHAT MlS S SMITH SAYS ABOUT\nTHE KIND OF \"GUILT THAT IS VAGUE, FOR WHICH NO NAME\nCAN BE FOUND, AND W W |:C.H CUR I OUS RATIONALIZATIONS ARE\nMADE.\"\nMoreover, we should not forget that there is also\nINVOLVED WITH ALL THIS A CERTAIN FEAR OF RETALI¬\nATION...A FEAR THAT THE NEGRO WILL \"GET DACK' AT\nTHE WHITE MAN FOR WHAT THE LATTER HAD DONE TO HIS\n...the Negro’s woman .\nHarry Golden, author of the best selling book, \"On,\nin America\" commented on this very point when he\nADDRESSED A JEWISH LABOR GROUP IN THE SUMMER OF\n1958. Perhaps we could let him have the last word\nThe white man has slept with Negro woman in the\nSOUTH FOR TWO OR THREE HUNDRED YEARS. ..AT WILL.\nFirst place, she was under his control. And he\nFEARS RETALIATION, SUBCONSCIOUSLY, THAT’S WHAT HE\nfears. Retaliation. He fears...when he looks at\nHIS WHITE WOMAN AND HE BEGINS TO...HE HAS GNAWING\nDOUBTS ABOUT HER. THIS IS A GREAT TRAGEDY. IT S\nA GREAT INSULT TO THE WHITE WOMEN OF THE SOUTH.\nDON’T UNDERSTAND HOW THEY COULD STAND FOR THIS,\nTHEIR WHITE MEN WORRYING ABOUT. ..JUST BECAUSE IF\nPERMIT THE NEGRO TO PARTICIPATE AS A FULL FLEDGE\nCITI ZEN . . .WHAT HE’S REALLY SAYING IS THAT HIS WOM.\nWILL FALL INTO THE NEGRO’S ARMS. JELL, WHY SHOULD\nTHEY? A/ H Y SHOULD THEY? BuT NO ONE SEEMS TO GET\nTHE POINT. NO ONE SEEMS TO BE INSULTED BY THIS\nthing. If you let a man vote, and give him equal\nJOB OPPORTUNITIES, EQUAL EDUCATIONAL FACILITIES,\nAUTOMATICALLY your white woman will fall for them -\nVhy should they? But this is his gnawing fear...\nSEX. .\"BIG BUCK NIGGER1’, HE ALWAYS SAYS, \"BIG BUCK\nnigger\". Sex."
}