{
  "id": "d492-37",
  "text": "-2-\nSCHNEIOER:\nRICHTER:\nLOGAN :\nCESS OF DOING SO WE WILL ATTEMPT TO TRACE CHANGES IN\nTHE IMAGE OF THE N EGRO FROM THE TIME OF HIS FIRST\nAPPEARANCE ON THE NORTH AMERICAN CONTINENT TO THE\nPRESENT.\nThe reason we can speak of the Negro as the unknown\nMAN AS WE DID IN OUR FIRST PROGRAM, OF COURSE, IS\nTHAT MOST OF US KNOW LITTLE, IF ANYTHING, ABOUT HIM.\nFor example, while we have a fairly good idea of the\nHISTORY OF OTHER EHTNIC GROUPS IN THE UNITED STATES,\nTHE BACKGROUND OF THE NEGRO IS PRETTY WELL SHROUDED\nIN MYTH AND MISCONCEPTION. If WE THINK ABOUT THE\nNegro's background at all, we’re likely to think of\nSLAVERY. ..OR OF A DIM SORT OF SO-CALLED \"BARBARIC\"\nbackground preceding the time of slavery. Therfore,\nONE OF THE THINGS WE MAY USEFULLY DO TODAY IN EXAM I Nr\nINGTHE CHANGING IMAGE OF THE AMERICAN NEGRO IS TO D I 0\nA BIT INTO HIS HISTORY. THE NEGRO SLAVE FIRST CAME\nNorth America in 16i9 from Africa. And before then\nthe Spaniards had used slaves in the Carribbean and\nLatin America. But what was the background of the\nNegro? Vas it a \"barbarian\" background...in the sens\nin which some people might take this word? A back¬\nground, THAT IS, OF SCREAMING WILD MEN WITHOUT THE\nRUDIMENTS OF SOCIAL 0RGAN i ZATI 0N. . „0R WHAT SOME MIGH‘\nCALL C I V I LI ZATI ON?\nA VISIT WITH THE AUTH0R-HI ST0R I AN, Dr . RAYFORD LoGAN\nProfessor of history at Howard University, revealed\nthis in format ion:\nSome persons would be skeptical when they hear what\nI AM NOW ABOUT TO SAY, AND SO IT WOULD BE WELL, PER¬\nHAPS, TO COMMENT BRIEFLY ON THE CREDIBILITY Of’tHE\nwitnesses. There were three major African kingdoms\nFROM ABOUT 700BC TO THE END OF THE i6TH CENTURY.\nEvidence as to'thejexistence of those k;ngd9ms, and\nAS TO THE DEGREE OF CIVILIZATION WHICH THEY ATTAINED\nRESTS PRIMARILY ON THE EYE-WITNESS ACCOUNT? OF HOSTlL\nTRAVELERS, ESPECIALLY ARABS. THE THREE KINGDOMS WHI\nI PARTICULARLY HAVE IN MIND, (THERE WERE SOME SMALLER\nONES) WERE, IN THEIR CHRONOLOGICAL ORDER, GHANA, LIKE-\nTHE NEW STATE OF GHANA, iVlELLE, AND SoNGHAY. The\nMEDIEVAL KINGDOM OF GHANA DID NOT OCCUPY THE SAME\nTERRITORY NOW OCCUPIED BY THE NEW STATE OF GHANA, BU~\nIT IS HELD BY MANY HISTORIANS THAT PEOPLE LIVING IN\nmedieval Ghana migrated to the present state of Ghana\nAND THAT THEREFORE THERE IS JUSTIFICATION FOR THAT\nNAME. IT IS THE CONSIDERED JUDGEMENT OF MANY COMP¬\nETENT HISTORIANS, ESPECIALLY EUROPEAN HISTORIANS,\nTHAT THE STATE OF CIVILIZATION ATTAINED BY THESE MED¬\nIEVAL African kingdoms was at least comparable to"
}