{
  "id": "d492-4",
  "text": "-5-\nLOGAN:\nRICHTER:\nSCHNEIDER:\nIn 1944, Professor Logan edited a book entitled, What\nthe Negro Wants.\nThere were fourteen contributors, including myself, the\neditor. Some of the contributors are well known: Dr,\nW.B. DuBois, the late Mrs. Mary Mcleod B ethune, A.\nPhillip Randolph, Roy v/i lk i ns-Secretary of the N AACP,\nAND OTHERS. As EDITOR, I ALLOWED EACH CONTRIBUTOR TO\nEXPRESS HIS OWN POINT OF VIEW. PERHAPS THE MOST SUR¬\nPRISING RESULT WAS THAT ALL FOURTEEN OF US WANTED THE\nSAME TH1NG... NAMELY, WE WANTED THE OPPORTUNITY FOR\nNegroes, along with other Americans, to have the equal\nCHANCE TO FULFILL THEIR RESPONSIBILITIES AND TO EXERCISE\nTHEIR RIGHTS UNDER THE CONSTITUTION OF THE UNITED STATES\nTHE LAWS OF THE STATE, IN ACCORDANCE WITH DEMOCRATIC\nPR I NCI PLES,\nON FIRST EXAMINATION, THIS.CERTAINLY SEEMS SIMPLE ENOUGH\nA GROUP OF CITIZENS WANT ACCORDED TO THEM THE SAME\nR I GHTS , RESPONS I B I LITIES, AND PRIVILEGES THAT THE\nOTHER CITIZENS OF THE NATION HAVE.\nAnd yet, in almost every area of endeavor the Negro\nin America is handicapped in the achievement of this\nSEEMINGLY SIMPLE GOAL. He HAS DIFFICULTY GETTING A\nGOOD EDUCATION, GETTING A GOOD JOB, GETTING A DECENT\nPLACE TO LIVE, AND SO ON. The NEGRO!S OPEN, AND ONE\nMIGHT SAY OBVIOUS, DEMAND FOR WHAT WE USUALLY CALL EQUAL\nITY AND JUSTICE IS COMPLICATED BY A GREAT MANY MATTERS..\nI THINK THIS MATTER OF THE COMPLICATION OF WHAT INITIALI.\nA PPEARS TO BE SUCH A SIMPLE THING IS WORTH OUR CLOSE\nATTENTION. TAKE THE MOST RUDIMENTARY ELEMENTS OF WHAT\nMOST OF US WOULD BE INCLINED TO CALL EQUALITY.,. •!\nEQUALITY UNDER THE LAW...OR PERHAPS JUSTICE. THESE\nELEMENTS FROM THE VERY BEGINNING GET TANGLED AMONG\nTHEMSELVES. FOR INSTANCE, iViYRDAL NOTES THAT THERE IS\nGENUINE INTERACTION AMONG THE ELEMENTS THAT FINALLY GO\nTO MAKE UP WHAT WE CALL EQUALITY, JUSTICE, AND OPPOR¬\nTUNITY. Let us cite housing in this connection: T he\nNegro’s housing does not stand by itself. If he doesn’t\nGET A \"FAIR SHAKE” ON THE HOUSING MARKET, HIS COMFORT,\nAND EVEN HEALTH, MAY BE SERIOUSLY AFFECTED. ThIS, IN\nTURN, IS LIKELY TO AFFECT HIS JOB CHANCES AND HIS CHANCE\non the job. Excessive absenteeism, due to illness, will\nNOT HELP THE INDIVIDUAL NEGRO’S CAUSE ON THE JOB MARKET,\nIn TURN, HIS CHANCES FOR HIGHER EDUCATION CAN BE AD¬\nVERSELY AFFECTED BY HIS LOW ECONOMIC STATUS, WHICH\nTHEN TWISTS ON ITSELF TO AFFECT THE STARTING POINT OF\nTHE WHOLE DOWNWARD SPIRAL . . ,NAMELY, THE HOUSING SITUA¬\nTION."
}