{
  "id": "d492-40",
  "text": "-5-\nRICHTER •\nSCHNEIDER:\nTHE RESISTANCE TO SLAVERY WHICH HE MANIFESTED AT\nEVERY HAND. ..HE NEVERTHELESS DID NOT SUCCUMB, UNDER\nTHESE CONDITIONS, BUT BEAT BACK AND ADJUSTED AND\nDEMONSTRATED THAT IT WAS POSSIBLE FOR THE WHITE MAN\nTO ENSLAVE HIM AND FOR HIM TO SURVIVE. THERE WAS ALS\nANOTHER CONSIDERATION, THAT IS THAT EUROPEANS WERE\nAT LEAST IN PART TROUBLED BY THE PROBLEM OF ENSLAVING\nPERSONS WHO WERE WITHIN THEIR PROGRAM OF CHRISTIAN¬\nIZATION AND OF CIVILIZATION. THEY REGARDED LARGE\nNUMBERS OF ASIAN AND EVEN NORTH AMERICAN PERSONS AS\nPERSONS WHO SHOULD BE BROUGHT UNDER THEIR EVANGELICAL\nINFLUENCE. THEY DID NOT SEEM TO HAVE THE SAME ATTI¬\nTUDE. TOWARD Africans, certainly not in the early\nperiod. But the point is Europeans seem to have felt\nthat Africans were, somehow, outside,uh, the pale.\nThat they were not fair subjects to be, uh, Christ¬\nianized. So that they could in good conscience, uh,\nenslave Negroes and at the same time not feel that\nTHEY HAD BETRAYED THEIR EVANGELICAL PROGRAMS.\nIn other words, the Negro was enslaved in great part\nFOR REASONS OF EXPEDIENCY*. A GREAT AMOUNT OF LABOR\nWAS NEEDED IN THE NeW WORLD TO EXTRACT WEALTH FROM\nTHE LAND, OTHER METHODS HAD BEEN TRIED AND DIDN’T\nWORK. ..AND THE NEGRO WITH HIS PARTICULAR CULTURAL\nBACKGROUND, IDENT I FI AB I LI TY, AND INITIAL EXCLUSION\nFROM THE RELIGION OF THE WHITE MAN OFFERED THE BEST\nAVAILABLE TOOL.\nAnd at this point we begin to see the emergence of am\nAmerican image of the Negro. It would be well to\nremember that the slave trade itself had been the\nPROVINCE ENTIRELY OF THE EUROPEANS. ThE FIRST EURO¬\nPEAN NATION TO ENGAGE IN 3USINESS OF SELLING MEN WAS\nPortugal. Later, commercial battles were fought\namong the Dutch, French, English, and Portuguese, fo'\na monopooy control of this lucrative business. In\nfact, it was a Dutch ship that left the first Negro\nslaves in Jamestown in 1619. The point that wetre\nGETTING AT IS THAT ALTHOUGH SOME NEGROES CAME TO\nNorth America as indentured servants, as Dr. Frankli\nSAYS, THE MAJOR EXPERIENCE THAT THE WHITES HAD OF\nthe Negro was in meeting him as a slave...with no\nEXPERIENCE WHATEVER OF HIM IN HIS ORIGINAL AFRICAN\nSURROUNDINGS. IN A SITUATION SUCH AS THIS IT WOULD\nBE QUITE EASY FOR A PERSON TO FORGET THAT THE NEGRO’0\nCONDITION HAD, IN THE FIRST PLACE, BEEN IMPOSED UPON\nHIM, AND WAS NOT A FACT OF ’NATURE'’ . I BEL f EVE WE\nDO OFTEN TEND TO TAKE FOR GRANTED AND AS SOMEHOW\n■’NATURAL” WHAT WE SEE ACTUALLY PREVAILING. ONE MIGHT\nEVEN SUGGEST THAT JUST BECAUSE WHITES SAW THE NEGRO\nENSLAVED, LARGE NUMBERS OF THEM WOULD HAVE BEEN IN¬\nCAPABLE OF CONCEIVING WITH ANY CLARITY THAT HE MIGHT\nBE OTHER THAT A SLAVE. BUT AT THE SAME TIME, THIS\nWAS CERTAINLY NOT TRUE FOR ALL WHITES. lfM THINKING\nparticularly of the Quakers and iViennon i tes who began"
}