{
  "id": "d492-42",
  "text": "-7-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nTHORITY, ACTUALLY MORE CHILDLIKE AND IN NEED OF COM¬\nPLETE SUBORDINATION IN THE INTEREST OF GENERAL WELFAK\nAnd it was mentioned earlier that the image the early\nwhite American had of the Negro was influenced by hip\nIGNORANCE OF THE NEGRO’S BACKGROUND.,\nAnother factor in the negative image of the Negro was\nTHAT, UNDER SLAVERY, OF COURSE, HE COULDN^T POSSIBLY\n* LOOK VERY GOOD’’ IN A NUMBER OF RESPECTS. LEGALLY,\nHE WAS FORBIDDEN TO LEARN TO WRITE AND SOMETIMES A\nmaster would help him in this despite laws, or at\nLEAST NOT STAND IN HIS WAY. BUT GIVEN THE CIRCUM -\nSTANCESHE WAS NOT LIKELY TO BE IMPRESSIVELY LITERATE\nAlong with this idea of the institution of slavery\nITSELF PROFOUNDLY INFLUENCING THE IMAGE OF THE NEGRC\nDr. Franklin also pointed out to us that Negroes, whe\nGIVEN RESPONSIBLE POSITIONS UNDER SLAVERY, PERFORMED\nVERY CREDITABLY. 'V HEN THEIR MOTIVATION WAS LOW, ON\nTHE OTHER HAND, AS IT OFTEN WAS, THEIR PRODUCTIVITY\nSUFFERED AND THE EFFICIENCY OF THE SLAVE SYSTEM WAS\nREDUCED .\nDespite this, however, the Negro of the pre-war South\nSEEMS TO HAVE PRODUCED A FAIR AMOUNT OF WORK, AND\nNUMEROUS HISTORIANS MAINTAIN THAT SLAVERY REMAINED\nA PROFITABLE INSTITUTION UNTIL THE VERY END. MORE\nIMAGES OF THE NEGRO THAT WE MIGHT TOUCH ON. ..IMAGES\nCERTAINLY CONNECTED WITH THE SLAVE PERIOD. ..ARE THOSE\nof the Negro as an immoral individual, the Negro as a\nBUFFOON, AND THE NEGRO AS A TREACHEROUS CREATIVE.\nFirst, the question of immorality: Since, as a slave\nthe Negro was a piece or property, and since nothing\nLIKE REAL BUTTRESSING OF MARRIAGES OF NEGROES UNDER\nSLAVERY BY THE WHITE M A N? S LA EXISTED, IT WAS POSS¬\nIBLE, AS IS WELL KNOWN, FOR MAN TO BE .S'OLD AWAY’G FROM\nWIFE, AND MAN OR WIFE TO BE SEPARATED FROM CHILDREN.\nIf some Negroes were consequently apathetic about, or\nINDIFFERENT TO, THE MARRIAGE BOND, ..AND THIS WAS\nUNDERSTANDABLE...THERE WERE NEVERTHELESS WHITES READ'\nTO CONDEMN THEM AS NOT FIT FOR MARRIAGE. THE NEGRO /'\nBUFFOON IS A COMMON I MAGE . . . APPEAR I NG, FOR EXAMPLE,\nAmerican films until quite recently. This is tied in\nWITH THE ENTIRE CONCEPT OF THE NEGRO AS A HAPPY, CAR;\nFREE SIMPLE INDIVIDUAL. ACTUALLY, HOWEVER, THE NEGRO\nDISCOVERED, EARLY IN HIS SLAVE EXPERIENCE, THAT tUFF\nOONERY PAID OFF. A MASTER WHO WAS MADE TO LAUGH WAS\nLIKELY TO GRANT FAVORS OR INDULGENCES, OR EVEN LIGHT¬\nEN THE WORK-LOAD OF THE AMUSING SLA VE. . .PARTLY AS A\nREWARD FOR BEING AMUSING, AND PARTLY AS A REWARD FOR\nRE-ENFORCEMENT THE IMAGE OF THE CHILDLIKE SLAVE. THfc."
}