{
  "id": "d492-44",
  "text": "RICHTER:\nSCHNEIDER:\n_o_\nOF SLAVERY. THERE SEEMS LITTLE DOUBT THAT THE LARGE\nSLAVEHOLDERS, AT ANY RATE, WERE ON THE WHOLE STRONGLY\nCOMMITTED TO SLAVERY, AND APPARENTLY A GOOD MANY OTH¬\nERS WHO EITHER HAD VERY FEW SLAVES OR NONE AT ALL WE;\nWILLING TO GO ALONG WITH THEM. It’S MY UNDERSTANDING\nTHAT FROM THE THE END OF THE COLONIAL PERIOD UNTIL\nABOUT 1820, SLAVEHOLDERS, WHILE OF COURSE THEY FAVORE\nSLAVERY, WERE RELATI VE LY MILD ABOUT THEiR DEFENSE OF\nit. But after 1820, the defense became much more\nACTIVE AND AGGRESSIVE. THE FAMOUS SENATOR FROM SoUTi\nCarolina, John C. Calhoun, was one of the most promi¬\nnent OF THOSE IN THE PERIOD AFTER 1820 WHO EXPLICITLY\nDENIED SLAVERY WAS AN EVIL, AND ASSERTED, ON THE CON¬\nTRARY, THAT IT WAS A POSITIVE GOOD. He ASSERTED THAT\nIT HAD PROVED *?A GREAT BLESSING TO BOTH OF THE RACES'\nTHAT IT HAD BEEN ’THE GREAT STAY OF THE UNION AND OUT\nFREE INSTITUTIONS ,? , AND FURTHER, THAT IT HAD BEEN\n’ONE OF THE MAIN SOURCES OF THE UNBOUNDED PROSPERITY\nOF THE WHOLE'1. FINALLY, FROM 1830 TO i860 PRO-SLAVE;\nthinking in the South had achieved its perfection.\nArguments ere polished and completed, and the South\nwas stating the pro-slavery case in a thoroughly\nFORTHRIGHT MANNER.\n.'OULD YOU CARE TO OUTLINE SOME OF THIS PRO-SLAVERY\nTHOUGHT, LOU?\nA/ ELL, I’d PARTICULARLY LIKE TO MENTION THE WORK OF\nJosiah Clarke Nott which has been reviewed by Jenkin'\nthe Historian PFo»8fc*9EAVEFrtfoUttwrGWT irNET®iLDOLau$eiUT\nNott was a physician from Alabama, who was actively\nENGAGED IN THE 1840’S AND SUBSEQUENTLY IN SUPPORTING\nTHE VIEW OF THE DIVERSE ORIGINS OF MANKIND. NoTT HA\nDEFINITELY DECIDED THAT THE i\\j E G R 0 WAS OF A DIFFERENT\nSPECIES FROM THE WHITE MAN...IF YOU LIKE, A DIFFEREN\nKIND OF ANIMAL. FOR SOME YEARS HE WAS MORE OR LESS\nALONE IN HIS VIEWS, BUT HE FOUND ALIES BEFORE VERY\nlong. According to one historian, Nott was writing\nby 1850, !,M Y GREAT OBJECT FOR SEVERAL YEARS HAS BEEN\nTO GET THE WORLD QUARRELLING ABOUT NIGGEROLOGY AND 1\nHAVE AT LAST SUCCEEDED, AND SHALL SIT ON THE FENCE N\nAND ENJOY THE FIGHT*7. I DON’T WANT TO GIVE THE IM¬\nPRESSION THAT Nott simply wiped out all opposition ~\nhim. He did not. There were strong defenders of th\nthesis of the unity of all mankind. But it’s true\nTHAT THEORIES LIKE THOSE OF OR. NoTT LEFT A LASTING\nIMPRESSION ON THE SOUTH. IN ONE F^RM OR ANOTHER THE\nHAVE CERTAINLY SURVIVED UNTIL THE PRESENT DAY, AND\nTHEY CONSTITUTE A KIND OF INTELLECTUAL CAPITAL ON\nWHICH SOME PEOPLE DRAW TIME AND AGAIN IN PERIODS OF\nCRISIS WHEN ARGUMENTS AGAINST THE NEGRO, AND AGAINST\nHIS FRIENDS WHO ARGUE FOR EQUALITY FOR HIM, ARE NEEP"
}