{
  "id": "d492-46",
  "text": "SCHNEID :S:\nBut we mustn’t allow ourselves to be overwhelmed.\nThis is only one man speaking, and most certainly\nSouthern opinion wasn’t solidly with him.\nRICHTER:\nTo SUMMARISE VERY BRIEFLY THE MATERIAL 'ITH WHICH\nWE’VE DEALT TODAY: WHENEVER THE NEGRO HAS RECEIVED\nUNFAVORABLE TREATMENT, THE IMAGES OF HIM HAVE TENDED\nTO DE UNFAVORABLE.\nSCHNEIDER :\nAnd to exteno the matter a bit, we’re really making\nTWO POINTS HERE. ONE IS A KIND OF BEHAVIORISTIC ONE,\nNAMELY THAT OUR IMAGES ARE CONDITIONED DY OUR ACTIONS.\nvVe treat the Negro 3aQly; hence he doesn’t ‘’look very\nGOOD1’ J HENCE WE REGARD HIM AS INFERIOR. The SECOND\nPOINT IS THIS: ONCE YOU TREAT THE NEGRO UNFAVORABLY,\nINSOFAR AS YOU HAVE INNER MORAL QUALMS ABOUT THIS,\nYOU FEEL IMPELLED TO JUSTIFY THE UNFAVORABLE TREATMENT,\nThen you begin to pile insult on injury, something\nwe’ve noted before. Since you’ve treated hIm unfavor¬\nably IN THE FIRST PLACE, YOU MUST ’PROVE1* THAT HE DE¬\nSERVES IT, OR THAT IT’S GOOD FOR HIM, OR THAT THAT IS\nWHAT Goo planned since the foundations of the world\nwere laid. Which brings us full circle back to the\nMECHANISMS WE’VE ALREADY BEEN OPERATING IN OUR GENERAL\nDISCUSSION OF PREJUDICE AND DISCRIMINATION.\nRICHTER:\nAnd with this final foint it is necessary for us to\n3 R E A K OFF OUR DISCUSSION OF THE CHANGING IMAGES OF\nTHE AMERICAN NEGRO UNTIL NEXT WEEK. UOIN US AGAIN\nNEXT WEEK AS WE CONTINUE EXPLORING THE ’’CHANGING\nIMAGE'* AS WE DISCUSS ”ThE UNKNOWN CITIZEN”.\nMUSIC\nTHEME UP NO UNDER\nANNCR:\nYou HAVE BEEN LISTENING TO OR * LOUIS ScHNEIDER, PRO¬\nFESSOR of Sociology at Purdue University, and the\nPROGRAM’S Producer-0 1 RECTOR OF THIS PROGRAM SERIES,\nE. W. Richter, as they’ve discussed ‘’The Last Citizen’*\nThis program was produced and recorded by Purdue\nUniversity, under a gr.nt from the educational televi¬\nsion AND RADIO CENTER, AND IS BEING DISTRIBUTED BY\nthe National association of Educational Broadcasters.\nMUSIC:\nTHEME UP TO FINISH\nANNCR:\nThis is the N'.EB Radio Network."
}