{
  "id": "d492-49",
  "text": "-3-\nuprising at Christmas\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nNegroes would stage a general\ntime.\nThus we can see how difficult it must have been for\nthe Southerner to adjust to the new situation. And\nIT CAN EASILY BE IMAGINED THAT SUCH A SITUATION WOUL\nCREATE AN ATMOSPHERE FOR THE DEVELOPMENT OF MORE UN¬\nFAVORABLE IMAGES OF THE NEGRO, FOR FEELINGS AGAINST\nHIM MUST HAVE RUN HIGH.\nAnd feelings certainly help to mold images. Inci¬\ndentally, I don’t mean to imply that all Southerners\nFELT THE SAME WAY ABOUT THE NEGRO, OR THAT VARIOUS\nFEELINGS WERE EVENLY DISTRIBUTED IN THE VARIOUS\nLAYERS OF SOUTHERN SOCIETY. THERE ARE TESTIMONIES IN-\nRECONSTRUCTION DOCUMENTS THAT IT WAS FOR THE MOST\nPART THE POOR WHITES, AND GENERALLY THE SO-CALLE\nLOWER CLASSES OF SOUTHERN SOCIETY, NOT THE UPPER\nCLASSES, WHO HAD THE LARGEST ANTIPATHY TO THE NEGRO.\nI SUPPOSE THAT THE POORWHITE’S ANTAGONISM WAS, AT\nLEAST IN PART, LOU AROUSED BY THE FEAR OF COMPETITION\nFROM THE NEWLY FREED SLAVES - COMPETITION IN AN OPEN\nLABOR MARKET.\nThere is certainly good ground for such a supposition\nBesides, poor whites h d not only already experience:\nCOMPETITION FROM THE NEGRO, BUT HAD THEMSELVES OFTEN\nBEEN DESPISED BY THE NEGROES, AT THE SAME TIME THAT\nTHEY '’DEPENDED'’ ON THE NEGRO TO BE ,?LOW MAN ON THE\nTOTEM POLE’’.\nWell, here we’ve already hit on two images: the\nIMAGE AS A COMPETITIVE WORKER, AND THE IMAGE OF THE\n'’LOW MAN ON THE TOTEM pole”.\nAlright. Now let’s explore this matter of images\nFURTHER. I HAVE HERE A VOLUME THAT REPRODUCES A\nLETTER FROM C. G. MEMM I NGER , THE CONFEDERATE SECRE¬\nTARY of the Treasury, written to President Johnson\non September 4, 1865. Iviemminger writes: ’’the coun¬\ntry SEEMS PREPARED TO ASSIGN TO THIS (NEGRo) RACE\nAN INFERIOR CONDITION...” He WRITES OF ’’THE VICES\nOF AN INFERIOR RACE”, AND OF ’THE NATURAL INDOLENct\nOF AN INFERIOR RACE1’, AND OF ” TH E NATURAL INDOLENCE\nof the African race”, and of ’’the necessity of train¬\ning THE INFERIOR RACE”. He DOES SPEAK OF THE P' 0 S S I -\nBILITY THAT NEGROES WILL PROVE CAPABLE, AS HE PUTS\n| t , 0*F STANDING ”UPON THE SAME PLATFORM WITH THE\nWHITE MAN”, BUT IN THE CONTEXT OF HIS LETTER, IT\nHARDLY SEEMS THAT HE TAKES THIS VERY SERIOUSLY.\nRICHTER:\nWould you say that this view of the Negro ...this"
}