{
  "id": "d492-5",
  "text": "-6-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nOf course, by the same reasoning, wouldn’t a ”shot in\nTHE ARM” AT THE RIGHT POINT OR POINTS BE LIKELY TO CREATE\nAN UPWARD SPIRAL?\nYes, if we hit the delicate balance of forces at a stra¬\ntegic P 0 I NT ^ WE MAY, AT RELATIVELY SMALL COST, START A\nRAMIFYING UPWARD MOVING SPIRAL DEVELOPMENT. But, WHETHER\nTHE SPIRAL MOVES UP OR DOWN, WE CAN ALREADY RECOGNIZE\nTHE EXISTENCE OF A CERTAIN COMPLEXITY IN THE WHOLE SO-\nCALLED Negro problem.\nBut wouldn’t such an upward spiral bring about new prob¬\nlems?\nIt would indeed. Suppose, for the sake of argument, an\nUPWARD-MOVING SPIRAL OF THE TYPE SUGGESTED WERE GOING\nALONG HANDSOMELY, LET’3 SAY, IN A SPECIFIC COMMUNITY...\nDepending upon the community and its traditions, there\nMIGHT BE A GENUINE DANGER THAT ANGRY, INSECURE, JEALOUS\nWHITES WOULD INTERVENE TO STOP THE UPWARD MOVEMENT.\nSeeing growing self-confidence and increasing achievement\non THE PART OF THE NEGRO, THEY MIGHT WELL DECIDE; '’THESE\nNiggers are getting too damned uppity,” and one might\nTHEN WITNESS A WAVE OF REFUSALS TO HIRE NEGROES TO JOBS\nWHICH UP TO THAT TIME THEY HAD BEEN GETTING WITHOUT DIFF-\nICULTY.\nWe suggested before that there is a certain seeming sim¬\nplicity ABOUT THE NEGRO’S DEMAND FOR JUSTICE, EQUALITY,\nAND SO FORTH BUT, WE CAN ALREADY SEE THAT IT ISN’T A\nSIMPLE MATTER AT ALL.\n|N A VERY REAL SENSE, IT ISN’T. TAKE THE MATTER YOU’VE\nJUST MENTIONED OF THE NEGRO’S DEMAND FOR JUSTICE, EQUAL¬\nITY AND SO FORTH. It MIGHT APPEAR A SIMPLE QUESTION\nWHETHER THE NEGRO SHOULD RESIST ENCROACHMENTS UPON WHAT\nHE AND MANY OTHERS BELIEVE TO BE HIS RIGHTS. PERHAPS\nEVEN THE MANNER OF HIS RESISTANCE WOULD APPEAR TO POSE\nRELATIVELY SIMPLE QUESTIONS. But AGAIN, A LITTLE RE-\nFLECTION, AND SOME CONTEMPLATION OF THE AMERICAN SCENE,\nWILL SOON CONVINCE US THAT THESE PROBLEMS, TOO, ARE MANY-\nSIDED. There are still, for example, some Christian\nMINISTERS WHO BELIEVE THAT THE NEGRO IS BEING SINFUL IF\nHE LITERALLY REFUSES TO TURN THE OTHER CHEEK. ON THE\nOTHER HAND, THERE ARE RESENTFUL NEGROES WHO WOULD NEVER\nDREAM OF TURNING THE OTHER CHEEK. If RESISTANCE IS TO BE\nMADE, WHAT KIND OF RESISTANCE SHALL IT BE? SHALL ONE-\nTENTH OF A NATION RISE UP IN VIOLENCE AGAINST THE REST\nAND SEEK TO WIN WHAT IT CONCEIVES TO ’ETE ITS RIGHTS BY"
}