{
  "id": "d492-54",
  "text": "RICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER :\nMATTER, THE INDIAN, REVERTS SHORTLY TO HIS ANCESTRAL\nGRADE OF CULTURE. In OTHER WORDS , IT IS THE INDIVI¬\nDUAL, AND NOT THE RACE THAT IS AFFECTED BY RELIGION,\nEDUCATION, AND EXAMPLE. NEGROES HAVE DEMONSTRATED\nTHROUGHOUT RECORDED TIME THAT THEY ARE A STATIONARY\nSPECIES, AND THAT THEY DO NOT POSSESS THE POTENTIAL¬\nITIES OF PROGRESS OR INITIATIVE FROM I T H I N . PROGRES\nFROM SELF-IMPULSE MUST NOT BE CONFOUNDED WITH MIMICRY\nOR WITH PROGRESS IMPOSED FROM WITHOUT BY SOCIAL\nPRESSURE OR BY THE SLAVER’S LASH't.\nG R NT’S IDEAS 8 E EM TO BE PRETTY MUCH IN LINE WITH THE\nPRO-SLAVERY THOUGHT WE TALKED ABOUT IN OUR LAST PRO¬\nGRAM - THOUGHT THAT IMPUTED PROGRESS TO THE NEGRO\nUNDER THE SYSTEM OF SLAVERY.\nThat’s entirely correct. And, as if to confirm what\nyou’ve just said, my eye falls on another passage\nWHICH IS MOST PE TINENT. GRANT SAYS, ’THE ’NATIVE\nAme ican’ has always found, and finds now, in the\nblack men willing followers who ask only to obey and\nTO FURTHER THE IDEALS AND WISHES OF THE MASTER RACE,\nWITHOUT TRYING TO INJECT INTO THE BODY POLITIC THEIR\nOWN VIEWS, WHETHER RACIAL, RELIGIOUS, OR SOCIAL.\nNegroes are never socialists or labor unionists and a\nLONG AS THEY REMAIN IN THE SAME RELATION TO THE WHITE\nAS IN THE PAST, THE NEGROES WILL BE A VALUABLE ELEMEN\nIN THE COMMUNITY. BUT ONCE RAISED TO SOCIAL EQUALITY\nTHEIR INFLUENCE WILL BE DESTRUCTIVE TO THEMSELVES AND\nTO THE WHITES'’.\n*N OTHER WORDS, GRANT COMPLETELY IGNORES THS MANY\nSLAVE REVOLTS IN WHICH SLAVES SHOWED THAT THEY WERE\nANYTHING BUT SATISFIED WITH THEIR SITUAT I 0N. . .HE\nIGNORES SUCH POLITICAL LEADERS AS STEPHEN DOUGLAS\nWHO WAS A POWER IN THE ABOLITIONIST MOVEMENT.\nYes... IN FACT HE IGNORES AND PUSHES ASIDE WHATEVER\nMIGHT INTERFERE WITH A THEStS THAT ACTUALLY AMOUNTS\nTO THAT GOOD OLD BROMIDE ‘’THE NEGRO’S ALL RIGHT AS\nLONG AS HE’S KEPT IN HIS PLACE’’.\nGrant’s work then...his racist writings,...seem to be\nAN EXTENSION OF THE POPULAR LITERATURE PUBLISHED IN\nTHE EARLY YEARS OF THE CENTURY.\nYou CAN CERTAINLY LOOK AT IT THAT WAY. At THE SAME\nTIME WE SHOULD NOTE THAT GRANT’S WORK DEFINITELY HAD\nFOUNDATIONS IN A EUROPEAN RACIALIST THOUGHT, AND IN\nHIS ADVOCATING OF THE SUPERIORITY OF THE SO-CALLED\nNordic race, which he extolled as a race of ’’rulers,\nORGANIZERS, AND ARISTOCRATS'’, GRANT’S THINKING HAS"
}