{
  "id": "d492-56",
  "text": "-10-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nHOMES OF THAT ENTERPRISE. ACUTE PROBLEMS OF HOUSING,\nAND PROBLEMS ARISING FROM THE PROXIMITY OF SETTLEMENTS\nof Negroes to white residents of cities, came very\nMUCH TO THE FORE IN THIS PERIOD.\n'E MIGHT MAKE THE INFERENCE, THEN, FROM THESE VARIOUS\nTHINGS, THAT THERE WAS, IN THE MINDS OF MANY AMERICANS\nWHO WERE NOT WRITERS OR EVEN READERS OF BOOKS OF\nRACIALIST THEORY, A CONCEPTION OF THE NEGRO AS AN\nUNWANTED INTRUDER. ..A MENACE TO THE WAY OF LIFE OF\nTHE WHITE MAN...AN AL»EN WHO THREATENED TO TAINT THE\nCOMMUNITIES INTO WHICH HE CAME. ..AND AN ALL AROUND\nUNDESI RABLE .\nYes, but we have to remember, too, that this represent\nA DEVELOPMENT OF NORTHERN CONCEPTIONS, WHICH IS, AS IT\nWERE, PILED ON THE TOP OF THE CONTINUING, GENERALLY\nUNFAVORABLE IMAGE OF THE NEGRO ENTERTAINED IN THE WHIT\nSOUTH.\n'ELL, SO FAR IT SEEMS THAT WE HAVE A PRETTY UNRELIEVE A\nNEGATI VE I MAGE OF THE NEGR0 ,N TH| S PERIOD FROM 1890\nUNTIL AFTER OoRLD YaR ONE. VhAT ABOUT FAVORABLE IMAGE\nof the Negro during this time?\nFAVOR AB L E\nWE HAD TO INF:\n■ “ E OFTEN HAVE TO INFER THE EXISTENCE OF\nIMAGES JUST AS, IN AT LEAST SOME CASES,\nTHE EXISTENCE OF UNFAVORABLE ONES. ONE LINE OF EVI¬\nDENCE THAT IS PERTINENT IS THE EVIDENCE THAT COMES\nfrom Supreme Court decisions from about the time of\nZorld a'ar One on. I think it's fair to say that in\nGENERAL THE COURT HAS PROVED FRIENDLY TO THE CAUSE OF\nthe Negro during the past several decades. By this\nI MEAN SIMPLY THAT THE COURT HAS PUT ITSELF ON THE\nSIDE OF THE AMERICAN CREED, ON THE SIDE OF CIVIL\nLIBERTIES FOR THE NEGRO, AND HAS GIVEN DECISIONS THAT\nHAVE GENERALLY GONE AGAINST DISCRIMINATION. Not ALL\nSupreme Court decisions during these years have seeme\nSATISFACTORY TO THOSE FIGHTING THE BATTLE FOR NEGRO\nCivil Rights, but it certainly seems fair to state '\nTHAT BROADLY THE COURT HAS ACTED DURING THE PAST FEW\nDECADES IN ACCORDANCE WITH EQUA LITARIAN DEMOCRATIC\nNOTIONS THAT IMPLY THE IMAGE OF A NEGRO AS A MAN WHO\nUNDER LAW, TO BE TREATED AS ANY OTHER MAN. FURTHER¬\nMORE, WE CAN SAY THAT WHILE THE GENERAL IMAGE OF THE\nNegro was an unfavorable one in this period, more\ninformed groups in the country were beginning to\nDEVELOP, OR HAD ALL ALONG, A FAVORABLE IMAGE. FoR\nEXAMPLE, THE NATIONAL ASSOCIATION FOR THE ADVANCEMENT\nOF COLORED PEOPLE WAS FORMED IN THIS PERIOD. ..AND\nFORMED PRIMARILY BY WHITES. LIBERAL EDUCATORS, PUBLI¬\nCISTS, AND OTHERS ...LI KE JOHN DEWEY, W|LLIAM DEAN"
}