{
  "id": "d492-57",
  "text": "RICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nHowells, and Oswald Garrison VIllard - who helped\nORGANIZE THE NA'XCP - ENTERTAINED AN IMAGE OF THE NEGRO\nBASED UPON EQUALITARIAN AND DEMOCRATIC PRESUPPOSITIONS.\nIN THIS SENSE, THEIRS WAS A DECIDEDLY FAVORABLE IMAGE.\nTell, around the time of the First world War, however,\nWERE THESE FAVOR BLE VIEWS, AS SUGGESTED BY THE ACTIONS\nof the Supreme Court and as demonstrated by the group\nOf WHITES YOU MENTIONED, ENOUGH TO CONVINCE THE NEGRO\nTHAT HE COULD FEEL SECURE IN A GENERALLY APPROVING\nCL I MATE?\n* WOULD THINK NOT. REMEMBER THE BACKGROUND OF SUCH\nTHINGS AS THE RACE RIOTS OF 1919. THE GENERAL IMAGE\nWAS STILL FAR FROM A FAVORABLE ONE.\nBut at least we find in this period the elements of a\nMORE FAVORABLE IMAGE DEVELOPING.\nYes, but let me remind you that throughout the history\nof the Negro in this country there had always been\nELEMENTS OF A FAVORABLE IMAGE. • V E MIGHT RECALL THE\nearly Quakers and abolitionists. As we found earlier\nIN OUR CONVERSATION TODAY, THESE ELEMENTS WERE PRETTY\nWELL TONED DOWN AROUND THE TURN OF THE CENTURY . . .AND\nTHE BEGINNINGS OF A NEW FAVORABLE IMAGE OFTEN HAVE TO\nBE i nferred in the period before World Wa,r One. But...\nIF WE MAY NOW MOVE FORWARD IN TIME, THE PERIOD OF THE\nTHIRTIES PROVIDES THE BACKGROUND FOR A REAL CHANGE IN\nTHE IMAGE OF THE NEGRO. DURING THE DEPRESSION THE\nNEGATIVE IMAGE WAS STILL MANIFEST IN THE ALL TOO\nFRE.^JENT APPLICABILITY OF THE FAMILIAR PHRASE n L A S T\nHIRED, FIRST FIRED*. BUT THE DEPRESSION ALSO, IN\nPART AT LEAST, HAD WHAT WE MIGHT CALL A KIND OF ?,REDUC-\nI NG EFFECT1'. IN MAKING TIMES TOUGH FOR SO MANY, BOTH\nNegro and White, it helped to stress the common human¬\nity OF ALL WHO WERE IN THE SAME BOAT AND NEEDED AID\nAND ENCOURAGEMENT. I*M OLD ENOUGH TO REMEMBER VIVIDLY\nscenes of Negroes and Whites sitting together in the\nSAME PUBLIC PLACES IN LARGE NORTHERN CITIES, WAITING TO\nAPPLY FOR RELIEF. The RISE OF FASCISM ABROAD, PARTI¬\nCULARLY the Nazi brand of fascism, showed Americans\nSOMETHING OF THE CONSEQUENCES THAT MIGHT BE EXPECTED 0:\nSYSTEMATICALLY PUTTING INTO PRACTICE IDEAS OF THE\nINFERIORITY AND WICKEDNESS OF VARIOUS MINORITIES.\nThere was a stir in people* s minds and, I think it\nLIKELYV AT LEAST SOME FAIRLY WIDESPREAD RECASTING OF\nthe image of the Negro. The Cold Var, finally, WITH\nITS VIRTUAL FORCING OF OUR ATTENTION ON THE INTER¬\nRELATIONSHIPS OF PEOPLES THROUGHOUT THE WORLD, HAS\nINEVITABLY MADE MANY OF US WHO PREVIOUSLY IGNORED SUCH"
}