{
  "id": "d492-58",
  "text": "-12-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nMORROW;\nSCHNEIDER:\nTHINGS, AWATE OF THE ASPIRATIONS OF COLORED PEOPLE IN\nOTHER LANDS, AND OF THE WAY IN WHICH THEY MUST REGARD\nunfavorable images of the Negro entertained in the\nU. S. AND THE DISCRIMINATION PRACTICED AGAINST HIM.\n;ELL, I THINK THAT THE CHANGE IN IMAGE IN RECENT\nYEARS CAN BE FAIRLY CLEARLY SEEN IN MANY WAYS, LOU..\nMotion pictures, for example, no longer present Negro\nCARICATURES AS THEY ONCE DID. AND THERE HAS BEEN A\nRISING RESPECT FOR OUTSTANDING NEGROES LW ICC HR a\\W HfEu N C H \"\nand Martin Luther King.\nYes, but one must not minimize the fact that the\nNEGATIVE IMAGES we’VE BEEN talking ABOUT STILL EXERCISu\nA STRONG INFLUENCE ON MANY OF US.\nNegative images...and expectations based on these\nIMAGES. We DO NOT EXPECT TO FIND THE NEGRO, EVEN\nTODAY, IN CERTAIN KINDS OF POSITIONS. THE EXPERIENCE\nof E. Frederick Morrow, administrative assistant to\nPresident Eisenhower, with whom we spoke in Washington\nWOULD SEEM TO BEAR THIS OUT.\nThere is always a great shock to most southerners,\nOR EVEN TO MOST WHITES WHO COME TO THE WHITE HOUSE\nTO DO BUSINESS WITH ME. We HAVE NOT PUBLICIZED THE\nFACT TOO MUCH THAT I AM HERE ON THE STAFF OF THE\nPresident. The very fact that my responsibilities\nARE SIMILAR TO THOSE OF ANY PRESIDENTIAL ASSISTANT,\nPEOPLE KNOW ME MERELY AS A NAME, AND WHEN THEY HAVE TO\nCOME TO THE WHITE'.HOUSE TO TRANSACT BUSINESS, IT SOME¬\nTIMES IS HUMOROUS, AND SOMETIMES ALMOST TRAGIC, WHEN\nTHE SECRETARY OPENS THE DOOR AND THE PERSON IS ESCORTE\nIN TO SEE ME. THERE ARE TIMES WHEN WE HAVE HAD TO\nQUIET PEOPLE DOWN WITH A GLASS OF WATER, OR WITH AN\nASPIRIN, OR BECAUSE THE SHOCK IS SO SEVERE. WHENEVER\nTHESE PEOPLE HAVE AN OPPORTUNITY TO SEE ME IN ACTION,\nAND TO TALK TO ME AT LENGTH, THERE IS GENERALLY A\nFRIENDLIER FEELING WHEN THEY LEAVE THAN WHEN THEY\nA R R I V E .\n(Chuckle) And I imagine that Mr. Morrow’s experience\nIS BY NO MEANS UNIQUE. WE ARE NOW ENTERING A NEW ERA\nIN WHICH THE SITUATION OF THE NEGRO IN THE UNITED\nStates is dynamic or changeful within an unprecedent¬\nedly DYNAMIC WORLD. It’S A VIRTUAL CERTAINTY THAT\nTHE PRESENT TIME OF CHANGE WILL BE FOLLOWED BY EVEN\nMORE CHANGE. THE SHAPE OF THE NEGRO PROBLEM IS IN\nREVOLUTIONARY TRANSFORMATION. AND WITHOUT ANY QUESTION\nA SIGNIFICANT PART OF THE TRANSFORMATION WILL HAVE\nTO DO WITH VERY RADICAL CHANGES IN THE IMAGE OF THE\nNegro ."
}