{
  "id": "d492-61",
  "text": "-2-\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nPREJUDICE, AND THE BACKGROUND OF MANY OF THE IMAGES\nof the Negro which we discussed have been provided\nBY RACIST THEORIES. ...THEORIES WHICH ASSUME A DIS¬\nTINCT RACIAL SEPARATION AMONG GROUPS OF MANKIND, AND,\nPERHAPS EVEN MORE IMPORTANT IN TERMS OF OUR DlSCUSSlOi''\nA NEGATIVE EVALUATION OF THE NON-WHITE SEGMENT \"OF\nOUR POPULATION. THE TERM NEGRO ITSELF APPEARS TO\nEVOKE AN IMMEDIATE IMAGE IN THE MINDS OF MANY OF US.\nToday we will attempt to answer two questions: 'That\nIS \"RACE1’? AND, VV HAT IS A NEGRO0 To ASSIST US WE\nHAVE WITH US TODAY D R. AlAN B. BuRDiCK, PROFESSOR OF\nGenetics at Purdue University, as well as our \"regular\nBr. Louis Schneider. However, before we turn to Or.\nBurdick, let us first explore, briefly, the layman’s\nIDEA OF WHAT A NEGRO IS. FlRST OF ALL AS IT EXISTS\nin the United States, and then as it exists in another\nAmerican nation, a large proportion of whose citizens\nare Negroes.\nIn the United States, especially where thought is\ninfluenced by southern outlook, a person is CONSIDEREl\na Negro if he has any African ancestry. This means\nTHAT EVEN IF A MAN IS MOSTLY WHITE IN HIS GENETIC OR\nBIOLOGICAL HERITAGE, AMERICAN CONVENTION WILL TEND\nTO M.aRK HIM AS A NEGRO.\nWell, would it be safe to say, Lou, that the term\n\"Negro\" as used in everyday conversation has a primar\nI LY SOCIAL SIGNIFICANCE, AND DOES NOT REPRESENT SCI¬\nENTIFIC USAGE?\nYes, that would be very safe. To exemplify the sociai\nCHARACTER OF THE DEFINITION OF THE TERM \"NEGRO\" I\nWOULD LIKE TO TURN TO THE PERSON OF COLOR IN BRAZIL,\nWHERE WE FIND A VERY INTERESTING SITUATION IN REGARD\nTO RACE.\nBut wasn’t the Negro broughtt into Brazil under differe\nCIRCUMSTANCES THAN INTO NORTH AMERICA?\nWell, he too was brought in as a slave to work the\nLAND. But THE BACKGROUND OF THE R E LATI ONSH I P OF THE\nNegro and the white was certainly different. For one\nthing, there was the long experience of the people\nof the Iberian Peninsula.Spain and Portugal....\nwith the Moorish conquerors. The Moors were evidentl\ndark-skinned people who had achieved a high degree\nOF CIVILIZATION. ALTHOUGH, AS CONQUERORS, THE MOORS\nMAY HAVE BEEN DISLIKED,STILL, THE PEOPLE OF PORTUGAL\nGAINED AN INEVITABLE RESPECT FOR THEM. AND BY THE\ntime the Moors were driven out of the country the"
}