{
  "id": "d492-63",
  "text": "-4-\nRICHTER:\n3CHNEIDE !:\nRICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER::\nRICHTER:\nSCHNEIDER::\nthe Negro or Preto tends to be a person of color who\nAPPEARS TO BE ALSO OF LOW STATUS.'\nBut let’s go back to something you said a moment ago.\nThat was that a rich Negro is white, and a poor\nwhite is a Negro. This would seem to imply that no\nINDIVIDUAL AND HIS DESCENDANTS ARE RELEASED IN PER¬\nPETUITY TO BEING EITHER ’’NEGRO1’ OR vtWHITE>f BUT THAT\nTHE CLASSIFICATION DEPENDS SOLELY UPON ACHIEVEMENT.\nI THINK YOU EXAGGERATE SOMEWHAT. COLOR STILL IS SOMF.\nTHING OF A HANDICAP, AND THINGS ARE NOT THE SAME IN\nALL REGIONS OF BRAZIL. BUT THE POINT IS THAT SUFFI¬\nCIENT ACHIEVEMENT CAN, IN GENERAL, GREATLY MODIFY THE\nFORCE OF THE COLOR HANDICAP. IN THE U.S., ON THE\nOTHER HAND, ONCE A NEGRO, ALWAYS A NEGRO....AT LEAST\nPRINCIPLE, ESPECIALLY IN SOUTHERN PRINCIPLE.\nHOW ABOUT AN EXAMPLE OF THIS BRAZILIAN PRINCIPLE OF\nBEING ABLE TO RISE ABOVE COLOR?\nWELL, ONE INVESTIGATOR MENTIONS THAT HE ASKED BRAZIL¬\nIAN WHITE GIRLS IF THEY WOULD BE INTERESTED IN MARRY\nING MEN OF COLOR.. .GENERALLY , THE GIRLS RESPONDED\nNEGATIVELY. BUT IF THE QUESTION TOOK THE FORM, ,THoW\nabout Dr. Raul Varella?1’.Dr. Varella being, let\nUS SAY, A FAMOUS PROFESSOR OF MEDICINE, WHOSE SKIN\nWAS QUITE DARK.THEIR RESPONSE WAS IMMEDIATELY\nREVISED.\nFor all practical purposes, then, despite his color,\nDr. Varella, because of his achievements, was a\n’WHITE MAN/’\nYes. ...ALL OF WHICH ILLUSTRATES WHAT SOCIAL SCIENTISTS\nSOMETIMES CALL THE THOMAS ThEORUM, WHICH STATES THAT\nIF MEN DEFINE A SITUATION AS REAL, IT IS R'AL IN ITS\nconsequences. Thus, it does’nt matter at all, in on,\nSENSE, THAT MANY AMERICAN NEGROES ARE BIOLOGICALLY\n7/8 OR MORE THAN 7/8 WHITE. ThEY ARE STILL LIKELY TC\nBE DEFINED IN THE AMERICAN SOCIETY AS NEGROES, AND\nHENCE BE TREATED ACCORDINGLY. IVi A N Y OF THE SAME\nPEOPLE, DEFINED AS NEGRO IN OUR COUNTRY, WOULD UN-\nD0U3TLY BE DEFINED AS WHITE, '’BraNCO1' IN BRAZIL.\nThus, the question of who is a ‘’Negro'* in this way\nis unequivocally a social matter, and depends solely\nON SOCIAL DEFINITION.\n'ELL, THIS SOC.I-.AL DEFINITION OF \"NEGRO1’ DEFINITELY\nPREVAILS, THEN IN THE UNITED STATES.\nYes. As we pointed out, the background of the early"
}