{
  "id": "d492-64",
  "text": "-5-\nRICHTER:\nSCHNEIDCR:\nRICHTER:\nRELATIONSHIPS OF WHITES ANO NEGROES IN BRAZIL WAS\nDIFFERENT FROM OURS. WE START WITH A DIFFERENT SET\nOF IMAGES OF THE NEGRO. EVEN TODAY WE ARE INCLINED\nTO DEFINE THE NEGRO NOT JUST IN TERMS OF SKIN COLOR,\nOR IN TERMS OF HiS OTHER MORE OR LESS EASILY PERCEPT¬\nIBLE PHYSICAL A TRIBUTES, BUT IN TERMS OF ATTRIBUTES\nTHAT HAVE NOTHING TO DO WITH BIOLOGICAL CHARACTER I STI\nR/E ARE INCLINED TO JUDGE THE NEGRO :N TERMS OF HIS\nBEHAVIOR. UJE CREATE A SOCIAL SITUATION IN WHICH MAN Y\nNegroes are virtually forced to behave in ways which\nWE JUDGE NEGATIVELY, THEN ATTRIBUTE THE BEHAVIOR TO\nTHEIR 3EING NEGROES... .AND FROM THIS, !N TURN. BUILD\nPOPULAR CONCEPTION OF NEGROES AS A .‘’RACE’’.\nWell, this brings us head on, then, to one of our\nTWO MAJOR QUESTIONS FOR TODAY! W H A T IS RACE? YoU\nJUST MENTIONED A POPULAR CONCEPTION OF RACE. A CON¬\nCEPTION BASED ON OBSERVABLE DIFFERENCES, NOT ONLY\nPHYSICAL BUT BEHAVIORAL. WhAT WOULD YOU SAY WAS\nTHE SCIENTIFIC CONCEPTION OF ’TRACE’\\ LOU?\nI WOULD SAY THAT WHEN THE TERM IS USED WITH SOME\nSCIENTIFIC CONSCIENCE IT SHOULD HAVE REFERENCE TO A\nBIOLOGICAL G R 0 U P I NG 0 F HUMAN BEINGS. N0W, : N T nE\nKIND SYSTEM OF C LA SSI Fi CATION THAT BIOLOGISTS CALL\nTAXONOMY IT HAPPENS THAT ALL LIVING INSTANCES OF MAN\nWOULD BE CLASSIFIED AS HOMO-SAP I ENS! GENUS! HOMO;\nSPECIES! SAPIENS. AND UNDER THIS SPECIES CLASSI¬\nFICATION YOU WOULD FIND EXISTING RACES OF MANKIND -\nIF THERE ARE SUCH THINGS. I SAY ”IF THERE ARE SUCH\nTHINGS’’. Let me say a word in explanation. !t’s\nTRUE THE TERM ,?RACE'f IS A VAGUE 0 N E - Q U f T E ■ A VAGUE\nONE. One can speak of races, one can speak of stock\nBreeds - ONE CAN USE ANY NUMBER 0 ^ SUCH TERMS. But\nUN SO FAR AS WE USE THE TERM RACE WITH ANY DEGREE OF\nSCIENTIFIC ACCURACY WE SHOULD STRICTLY MEAN BY IT\nA BIOLOGICAL GROUPING, TllERE HAVE BEEN CERTAIN CON¬\nVENTIONAL CLASSIFICATIONS OF RACES AMONG ANTHROPOLO¬\nGISTS. A FAVOR : T E ONE HAS BEEN THREEFOLD! N E G R 0 (!) D ,\nCaucasoid, and Mongoloid. This is useable for certa\npurposes. School books often still tell us that the\nRACES OF MANKIND ARE WHITE, BLACK, YELLOW, RED AND\nBROWN - A CLASSIFICATION OF VERY DOUBTFUL VALUE\nEXCEPT PERHAPS FOR AESTHETIC PURPOSES ,, I COME BACK\nTHE SAME THING. THE ESSENTIAL MATTER HERE IS THAT\nRACE IS SUPPOSED TO BE, AND IN STRICT USAGE IS, A\nBIOLOGICAL GROUPING.\nOr. Surdick... now we turn to you. Do you a gene¬\nticist, HAVE ANYTHING FURTHER TO ADD TO Or , ScHMEID’7\nCOMMENTS ... oOR ANY DISAGREEMENTS?\nBURDICK:\nI CAN’T OFFER ANY ESSENTIAL DISAGREEMENT WITH WHAT"
}