{
  "id": "d492-65",
  "text": "RICHTER;\nBURDICK;\nRICHTER:\n-6-\nLou Schneider has said. A race is a very ill define!\nENTITY DIO LOGICALLY,, rOR I N STANCE, ! CAN JUST AS Vi E 1\nTALK ABOUT THE ''RACE1' OF PEOPLE Vi H 0 LIVE ACROSS THE\nSTREET FROM ME AS I CAN TALK ABOUT THE '’RACE1' OF\nPEOPLE WHO LIVE ACROSS THE OCEAN FROM ME - IF I WISH\nAND CHOOSE TO DO SO., A RACE, GENERALLY SPEAKING IS\nA - IS A CONCEPT THAT RELATES TO TWO GROUPS THAT ARE\nLESS DIFFERENT THAN SPECIES ARE, SPECIES ARE GROUPS\nTHAT HAVE SOME BIOLOGICAL STATURE - THEY ARE USUALLY\nGROUPS THAT ARE NOT FREELY INTERBREEDING - THAT ARE\nDISTINGUISHABLE MORPHOLOGICALLY AND SEROLOGICALLY AN,\nBY OTHER CRITERION. BuT RACES ARE NOT 30 EASY TO\nDISTINGUISH, SOUNDLY, ON BIOLOGICAL GROUNDS,,\nWell, leaving this for the moment, let us accept tha\nTHERE ARE DIFFERENCES - VISIBLE DIFFERENCES - BET V D7\nVARIOUS GROUPS OF PEOPLE AROUND THE WORLD, HoW DID\nTHESE DIFFERENCES COME ABOUT? 1 F WE SAY THAT WE ARE\nALL OF ONE SPECIES THIS WOULD INDICATE, TO MY MIND\nAT LEAST, COMMON ANCESTRY. Is THIS TRUE?\nWell, yes, I think so. In fact, !,m sure of it. We\nCOULD ALL, IF WE COULD TRACE OUR ANCESTRY BACK TO A\nCOMMON SOURCE. THE PICTURE OF THIS NOT EXACTLY\nCLEAR, BUT ! CAN TELL YOU SOMETHING THAT A P P R OA r\" T\nWHAT THE TRUE PICTURE MIGHT BE. PERHAPS AS MANY AS\n50,000 YEARS BEFORE THE BIRTH OF CHRIST THERE WAS AL\nENTITY ON EARTH WHICH COULD HAVE BEEN CALLED HOMO-\nSAPIENS ~ COULD HAVE BEEN CALLED MAN,, So LET US SA\\\nTHAT MAN BEGAN BEING DISTINGUISHABLE BIOLOGICALLY\nABOUT 50,000 YEARS AGO. Th!S TOOK PLACE, NO DOUBT,\nSOMEPLACE IN THE M : D D LE LAST IN THE FERTILE CRESCEilF\nFrom this population then of primitive men there\nEVOLVED - EVOLVED SUB — GROUPS AS A RESULT OF CERTAIN\nMIGRATIONS - MIGRATIONS TO MONGOLIA, TO EUROPE, TO\nAfrica - hence to Australia, and from Mongolia to tk\nAmerican continents. Now ts-iese groups - these sub¬\ngroups OF MAN - BECAME DISTINGUISHABLE, ONE FROM\nANOTHER, AS A RESULT OF THE ACCUMULATION OF D i F F E R Ef>\"\nGENETIC CONDITIONS THAT HAPPENED TO EXIST IN THE ORi\nGINAL POPULATIO N. I GAN T CALL THESE GROUPS DiSTINC\nRACES AT THE PRESENT TIME, BUT ' CAN CONCEIVE OF A\nTIME WHEN MANY THOUSAND YEARS AGO WHEN THEY WERE...\nFOR EXAMPLE WHEN MONGOLOIDS HAD BEEN SEPARATED FROM\nthe Negroids in Africa for a period of 25,000 years,\n.... THESE GROUPS PROBABLY COULD HAVE BEEN D I ST ! iIA\nG UI SHED RELATIVELY EASILY AS FAIRLY DISTINCT BIOLO¬\nGICAL ENTITIES.\nYoU MEAN THAT INITIALLY THERE WAS NO DISTINCTION\nBETWEEN THESE TWO GROUPS, BUT THAT GEOGRAPHICAL\nSEPARATION OVER A LONG PERIOD OF TIME - CLIMATE AND"
}