{
  "id": "d492-67",
  "text": "RICHTER:\nBURDICK:\nRICHTER:\nBURDICK:\nRICHTER:\nBURDICK.\nRICHTER:\nBURDICK:\nSCHNEIDER:\n'Dell, thus far we've discovered that the term race\nITSELF IS A RELATIVELY VAGUE ONE, USED TO DESCRIBE\nGENETIC AND BIOLOGICAL DIFFERENCES BETWEEN GROUPS OF\npeople. Let’s now be specific. Dr . Burdick, would\nYOU LIKE TO GIVE US YOUR IDEA OF WHAT CONSTITUTES A\nNegro?\nIn! 0 , I WOULD NOT, BUT IF I AM ASKED TO DO SO, I CAN\nSAY LOOSELY THE NEGRO IS DEFINED AS ONE OF BLACK SKIN\nWHOSE BACKGROUND GOES BACK TO SOME CONNECTION WITH\nSLAVERY IN THE UNITED STATES.\nBut you would tack on the criterion of black skin9\nYes, they're almost all dark-skinned African Negroes\nNow, COULD YOU DISTINGUISH NEGROES FROM WHITES GENE-\nTI CAL LY?\nIf you give me enough criteria. For instance blood\nGROUP CRITERIA AND VARIOUS OTHER BIOLOGICAL CRITERIA\nGOOD SOUND GENETIC CRITERIA - I THINK I CAN DIST!'1'''\nIN PERHAPS 75$ OF THE CASES - A NEGRO FROM A C*UCASI/\nI CAN'T ALWAYS BE COMPLETELY ACCURATE - ! CAN'T DO !\nWITH MORE THAN A 75$ RELIABILITY i WOULD SAY - BUT\nI THINK IT CAN BE SHOWN THAT THERE 1 S A GENERAL SPEC¬\nTRUM, LET US SAY, OF GENETIC CONDITIONS IN THE NEGRO\nSOME V; HAT DIFFERENT THAN IT IS IN THE WHITE PERSON.\nWould you like to describe some of these differ¬\nences?\nWell, the Negro has a fairly high frequency of sicki-\nCELL ANEMIA WHICH IS A GENETIC CONDITION WHICH HAS T(\nDO WITH PROPERTIES OF THE BLOOD. He HAS A FAIRLY L 0\"\nPERCENTAGE, COMPARED WITH THE WHITES, OF Rh NEGATIVE\nGENES. He HAS AN ASTONISHINGLY HIGH FREQUENCY OF Rh\n0 GENES. HlS FREQUENCY FOR THE IVI BLOOD TYPE IS SL I G\nLY HIGHER THAN IT IS FOR THE WHITE. HlS FREQUENCY,\nFOR INSTANCE, OF AB 3L00D TYPES IS ABOUT 3 TIMES THA\nOF WHITE PEOPLE. HE IS LESS LIKELY TO BE GENETICALL\nCOLOR BLIND THAN A WHITE MAN IS. AND I COULD GO ON\nDOWN A LIST SUCH AS THIS TO SHOW \"THAT ACTUAL DIFFER¬\nENCES CAN BE ASCRIBED TO THESE TWO ETHNIC GROUPS.\nSO AS I UNDERSTAND IT YOU WOULD CONTEND THAT THERE\nARE DIFFERENCES WHEN YOU MAKE A KIND OF EMPIRICAL\nSTARTING POINT. ..YOU DISTINGUISH CERTAIN PEOPLE WHOS\nSKIN PIGMENTATION, LET'S SAY, IS RATHER DARKER THAN\nTHAT OF OTHERS. YOU FIND FURTHER THAT WHEN YOU EX¬\nAMINE THE GENETIC TRAITS OF THESE pp OPLE YOU DO GET"
}