{
  "id": "d492-68",
  "text": "-9-\nTHESE EMPIRICAL ASSOCIATIONS. AND THAT IS THE MEAN!\nOF SAYING THAT NEGROES DIFFER FROM WHITES IN RESPECT\nBURDICK:\nLET ME MAKE THE POINT THAT 1 CANNOT DISTINGUISH\nNegroes on the basis of skin color alone. Because\nTHERE ARE MANY OTHER GROUPS IN THE WORLD THAT ARE NO\nNegroes that have almost precisely the same skin\nCOLORAT1 ON.\nR1CHTER:\nVOULD YOU LIKE TO IDENTIFY THESE GROUPS?\nBURDICK:\nOh yes, the Melanesians and the Posynesians, and the\nAustraloid Aborigines, for instance, have the same\nskin pigmentation. Sometimes they’re darker than\nNegroes. Many Indians, Asian Indians, have almost\nPRECISELY THE SAME SKIN PIGMENTATION, YET THEY ARE\nNOT BY ANY MEANS NEGROES.\nRICHTER:\nVELL, WE’VE DISCOVERED THAT IT IS POSSIBLE FOR THE\nSCIENTIST TO DISTINGUISH BETWEEN GROUPS OF PEOPLE\nWHOM WE MIGHT LOOSELY CALL ;IRACES'’ ON THE BASIS OF\nGENETIC-BIOLOGICAL DIFFERENCES. THE SCIENTIST D E —\nSCRIBES THE NEGRO AS A BIOLOGICAL ENTITY. But P\"-r\nWOULD THESE DIFFERENCES LEND ANY VALIDITY TO THE\nBELIEF THAT ONE RACE WAS IN ANY WAY SUPERIOR OR INFE\n1 OR TO ANOTHER?\nBURDICK:\nNone whatsoever. Now, we can look at the Negro in\nTHIS SENSE. For instance, undoubtedly, the white\nman and the Negro both descended from apelike - not\nMIND YOU i DIDN’T SAY APE, BUT AN APELIKE - LET US\nSAY THAT BOTH MEN ANDAPES DESCENDED FROM A COMMON\nANCESTOR. This ANCESTOR, CHANCES ARE, HAD THIN L!P°\nTherefore the Negro with his thick lips represents a\nMORE ADVANCED TYPE OF EVOLUTION THAN THE WHITE MAN\ndoes. Furthermore, this apelike creature no doubt\nHAS HAIR ALL OVER HIS BODY. AND THE HAIRY WHITE MAN\nTHEREFORE REPRESENTS A LESS ADVANCED STAGE OF EVOLU¬\nTION THAN THE NEGRO WHO HAS VERY LITTLE HAIR ON HIS\nBODY. So, IN LOOKING AT IT THIS WAY 1 CAN ACTUALLY\nMAKE MY STORY THAT THE NEGRO IS MORE ADVANCED EVO-\nLUTIONARILY THAN THE WHITE MAN IS. HOWEVER, ! COULD\nDO THE SAME THING ON THE OTHER SIDE. 1 COULD D E S C R\nCERTAIN CHARACTERISTICS OF THE WHITE MAN THAT ARE\nSEEMINGLY MORE ADVANCED, AT LEAST FAR MORE REMOVED\nFROM APELIKE CHARACTERISTICS THAN THOSE POSSESSED BY\nthe Negro. My point is simply this - that in talkin\nABOUT MORE ADVANCED AND MORE PRIMITIVE TYPES OF PEOF\nWE’RE NOT TALKING ABOUT BIOLOGICALLY MORE ADVANCED 0\nBIOLOGICALLY MORE PRIMITIVE PEOPLE - THE MORE AD¬\nVANCENESS AND LESS ADVANCEDNESS HAS TO DO WITH CULT!'\nSTATUS OF THE PEOPLE ABOUT WHOM WE’RE TALKING."
}