{
  "id": "d492-69",
  "text": "-10-\nRICHTER: Well, in our last program we touched briefly on the\nMATTER OF INTELLIGENCE. WHETHER OR NOT INTELLIGENCE\nTESTS ARE ACCURATE AND REALLY MEASURE INTELLIGENCE,\nAND WHETHER THERE IS SUCH A THING AS A DIFFERENCE IN\nTHE INTELLIGENCE, SAY, OF A WHITE AMERICAN, AND A\ndark-skinned American, or Negro. What would you,as\nA GENETICIST, SAY ABOUT THIS, Or . BURDICK?\nBURDICK: Well, I’-d like to say this. If we take a group of\nAmerican Negroes and a group of American whites\nput them in the same room and give them an intell¬\nigence TEST WE WILL IN FACT FIND A DIFFERENCE IN\nTHEIR PERFORMANCE ON THIS INTELLIGENCE TEST. HOWEVER\nWHEN WE ATTEMPT TO ATTRIBUTE THIS DIFFERENCE TO EN¬\nVIRONMENTAL OR EXPERIMENTAL CAUSES AND INNATE OR\nGENETIC CAUSES WEf RE INCAPABLE OF DOING THIS-THAT IS\nJUST BECAUSE ONE GROUP SCORES LESS ON AN INTELLIGENCE\nTEST THAN ANOTHER GROUP DOES NOT ENTITLE ME TO SAY\nTHIS GROUP HAS LESS GENETIC INTELLECTUAL ABILITY\nTHAN THE OTHER, BECAUSE INTELLIGENCE IS REMARKABLY\nMODIFIED BY THE ENVIRONMENT. FOR INSTANCE, WE CAN\nTAKE TWO ENTITIES WHO ARE GENETICALLY IDENTICAL,\nNAMELY IDENTICAL TWINS, AND IF WE REAR THESE TWINS\nAPART UNDER DIFFERENT CONDITIONS AND AT SOME TIME\nLATER EXAMINE THEM FOR THEIR SO CALLED INATE INTELL¬\nIGENCE WE* L L FIND THAT THE TEST TELLS US THAT THEIR\nINNATE INTELLIGENCE IS QUITE DIFFERENT WHEN AT THE\nSAME TIME WE KNOW THAT THEIR GENETIC MAKEUP IS IDENT¬\nICAL BUT THAT THEIR PERFORMANCE ON THIS TEST RESULTS\nACTUALLY IN THEIR GIVING THE PICTURE THAT THEY ARE\nDIFFERENT. So l*M NOT OFFERING AN INDICTMENT OF\nINTELLIGENCE TESTS AS SUCH, BUT I THINK THEY'RE VERY\nGOOD AND VERY USEFUL THINGS. THEY DO MEASURE IN\nFACT WHAT SORT OF INTELLECTUAL ACTIVITY A PERSON CAN\nPERFORM BUT THEY DON’T BY ANY MEANS MEASURE GENETICAL\nINTELLIGENCE AS SUCH OR INHERENT DIFFERENCES IN INTEL\nIGENCE AS SUCH.\nRICHTER: But will you say that if you took a mean of each\nGROUP YOU MIGHT FIND A DIFFERENCE0\nBURDICK: Well, if I make the supposition that I have a test\nTHAT WILL MEASURE GENETICAL DIFFERENCES IN INTELLI¬\nGENCE...THIS IS PURELY A HYPOTHETICAL SITUATION...\nBUT IF I HAVE SUCH A TEST AND I EXAMINE A GROUP OF\nNegroes and a group of whites, I have no doubt what¬\nsoever SINCE THEIR GENETIC BACKGROUNDIS QUITE DIFFER¬\nENT...THAT THESE GROUPS WOULD SHOW A DIFFERENCE IN\nMEAN INTELLIGENCE. I*M NOT SURE, HOWEVER, WHICH\nGROUP WOULD HAVE THE HIGHER INTELLIGENCE. THERE IS\nNO INDICATION, AS FAR AS I KNOW, THAT WOULD INDICATE\nWHICH GROUP HAS THE GREATER INTELLIGENCE."
}