{
  "id": "d492-70",
  "text": "RICHTER :\nBIRDOCL'\nRICHTER:\nSCHNEIDER:\nWell, now, where does all this lead us? We’ve been\ntalking about race for quite a few minutes now. We’ve\nDISCOVERED FIRST OF. ALL THAT RACE CAN BE DEFINED IN\nTWO WAYS. We CAN DEFINE IT SOCIALLY, IN TERMS OF\nWHATPEOPLE AT LARGE WHO ARE NOT SCIENTISTS WOULD CALL\na race*’. The general American idea of what a Negro\nIS falls under this definition...this social defini¬\ntion...this SOCIAL DEFINITION, IF YOU WISH, fllE HAVE\nANOTHER DEFINITION WHICH IS SCIENTIFIC AND BASED ON\nBIOLOGICAL DIFFERENCES BETWEEN GROUPS OF PEOPLE.\nFurthermore, we have discovered that there are diff-\ne R E N C E S BET W E E N GROUPS O-F • R E 0 P L E . . B I 0 L 0 G I C A L ::D I F FE R E N :\nBUT THAT THESE DIFFERENCES DO NOT NECESSARILY IMPLY\nBIOLOGICAL INFERIORITY OR SUPERIORITY FOR ANY ONE\nGROUP. IN EXAMINING THE QUESTION OF RACE IN TERMS OF\nINTELLIGENCE, FOR EXAMPLE, OR IN TERMS OF BEHAVIORAL\nPATTERNS . WE HAVE BEEN UNABLE TO FIND ANY SOLID GROUK,\nON WHICH TO BASE AN ASSUMPTION OF INFERIORITY OR\nSUPERIORITY OF ANY GROUP OF HUMAN BEINGS. HAVE I\nSUMMARIZED THIS ACCURATELY? Dr. BuRDlCK.\nYes, I think so. You’re talking about the biological\nPOTENTIAL OF THESE GROUPS.AND NOT WHAT THEY ARE IN\nfact. Negroes are in fact brought up under different\nCIRCUMSTANCES THAN WHITES. IN THE SOUTH FOR INSTANCE.\nAnd when we go to measure intelligence of Negroes in\nthe South, and white people in the South, we do come\nUP WITH DISTINCT DIFFERENCES IN THEIR INTELLECTUAL\nCAPAC I TY . . . PRESUMABLY. BuT THIS. ..MY POINT HAS SIMPL\nBEEN THAT THIS DIFFERENCE IS A DIFFERENCE THAT MAY\nBE ALMOST ENTIRELY ASCRIBABLY OR ATTRIBUTABLE TO THE\nENVIRONMENT AND NOT TO HEREDITARY DIFFERENCES IN THE\nGROUPS.\nLoU, WOULD YOU HAVE ANYTHING TO ADD?\nYes. There are some contemporary anthropologists an.\nSOCI A LOG I ST S WHO, ■ ITH AN UNDERSTANDABLE BUT MISGUIDE;\nENTHUSIASM, CLAIM THAT THERE ARE NO DIFFERENCES AMONG\nRACES. It WOULD BE DENYING THE PLAIN EVIDENCE OF\none’s eyes for instance to say that Negroes have the\nSAME SKIN PIGMENTATION AS WHITES. BUT WHAT ARE DIFF¬\nERENCES EXTEND TO NATIVE HEREDITARY VARIATION IN\nINTELLIGENCE OR THE FACTORS THAT UNDER LIE IT, I\nSIMPLY DON’T KNOW. Dr . BuRIDCK THINKS THEY MAY WELL\nEXIST. I WON’T EVEN VENTURE THAT FAR. AND AS FOR\nTHE PEOPLE WHO MULL OVEK, AND RE-ARRANGE INTELLIGENCE\nTEST RESULTS FOR NEGROES AND WHITES, WITHOUT SEEKING\nTO BELITTLE THEIR ENDEAVORS, I’M CONVINCED THEY RE¬\nMAIN AS IGNORANT AS I AM.\nRICHTER:\nThank you, Lou Schneider, thank you, Or. Burdick"
}