{
  "id": "d492-73",
  "text": "-2-\nSCHNEIOER:\nRICHTER:\nFRAZIER:\nVARIOUS ELEMENTS IN THE SITUATION. PERHAPS, PARTI¬\nCULARLY IN A FIELD LIKE EDUCATION, IT’S USEFUL TO LOOK\nINTO HISTORICAL BACKGROUNDS. 3UT BEFORE WE DO, WE\nCAN’T HELP THINKING OF SOME THINGS THAT WE SHOULD EXPE\nALMOST ANYONE WOULD THINK OF SPONTANEOUSLY. The QUES¬\nTION of the Negro’s ability inevitably raises itself\nAGAIN AND AGAIN IN THESE PROGRAMS, AND I THINK IT MlGH\nBE INSTRUCTIVE FOR US TO LISTEN TO ONE MORE RELEVANT\nOP I NI ON. . . ,WHI CH WE SHALL DO IN A MOMENT.\nI THINK ALSO, vVa LT, IT MIGHT BE A GOOD IDEA FOR US TO\nHAVE AT LEAST SOME BRIEF STATEMENT OF HOW THE NEGROES\nBACKGROUND TODAY BEARS ON THE EFFORTS OF OTHERS TO\nHELP HIM IN HIS EDUCATIONAL ENDEAVORS AND ASPIRATIONS.\nGood enough. Let’s begin then, with a general stateme\nby Dr. E. Franklin Frazier, well known sociologist,\nand Chairman of the Department of Sociology at Howard\nUniversity, who gives us the following reflections on\nABILITY AND ASP I RAT I ON.\nVHEN IT COMES TO DIFFERENCES THAT HAVE ANY RACIAL MEAN\nING, I WOULD SAY THIS: FIRST THING I WANT TO SAY WHEN\nYOU’RE TALKING ABOUT THE RELATIVE ABILITY OF in1'GROES\nand Whites in the United States, you must always remem\nBER THAT WHEN YOU ARE SPEAKING OF AN AMERICAN NEGRO\nYOU ARE SPEAKING OF A PERSON OF MIXED ANCESTRY,\nProbably 90$ of the so-called Negroes in the United\nStates have white ancestors as well as Negro ancestors\nAND 27$ OF THE NEGROES IN THE UNITED STATES HAVE INDIA\nANCESTRY. So THE SO-CALLED NEGRO IN THE UNITED STATES\nIS, AS HAS BEEN CALLED, A SOCIOLOGICAL NEGRO AND NOT\nA BIOLOGICAL NeGRO. AND WHEN YOU ARE MAKING MEASURE¬\nMENTS OF ABILITIES, YOU’VE GOT T0....THERE’S NO WAY OF\nUNSCRAMBLING THE EGGS THAT ARE ALREADY SCRAMBLED. T0\nSAY WHICH PART OF HIM IS NEGRO, AND WHICH PART IS 'HIT\nAND WHICH PART IS INDIAN FOR SOME OF THEM. I HAVE\nTAUGHT ALL KINDS OF STUDENTS. lHAVE TAUGHT WHITE STU¬\nDENTS WHO WERE STUPID, I HAVE TAUGHT WHITE STUDENTS\nWHO WERE VERY BRILLIANT, I HAVE TAUGHT NEGRO STUDENTS\nWHO WERE STUPID, AND NEGRO STUDENTS WHO WERE BRILLIANT\nBUT ASIDE FROM SUCH SUPERFICIAL AND OBVIOUS DIFFERENCE\nI THINK THAT THIS IS VERY IMPORTANT IN DISCUSSING THE\nEDUCATION OF THE NEGRO. ONE MUST TAKE INTO CONSIDERA¬\nTION THE LEVEL OF ASPIRATION. WHAT DOES ONE ASPIRE TC\nMay I TAKE MYSELF AS AN EXAMPLE? a'elL, I CAN REMEMBER\nTHAT WHEN I FINISHED 8TH GRADE I WAS SENT TO A NEGRO I\nOUR COMMUNITY WHO WAS THOUGHT TO BE A GENIUS. ...OF\ncourse I’ve learned later he wasn’t....to advise me\nWHETHER I SHOULD TAKE LATIN OR GERMAN WHEN I ENTERED\nHIGH SCHOOL. AND HE SAID, ,J3|NCE YOU WILL NEVER GO\nTO COLLEGE YOU SHOULD TAKE GERMAN. AND I WENT TO HIGH\nSCHOOL AND TOOK GERMAN. i E L L, AFTER I GOT INTO HIGH\nSCHOOL I FOUND OUT THAT MANY OF MY TEACHERS DIDN’T\nHAVE ANYMORE BRAINS THAN I HAD, AND DIDN’T HAVE ANY"
}