{
  "id": "d492-75",
  "text": "-4-\nRICHTER:\nTEACHERS HAVE BEEN REARED IN A SHELTERED AND PROTECTED\nSOCIAL ENVIRONMENT, AND EXPERIENCE GREAT DIFFICULTY IN\nADJUSTING TO THE ENVIRONMENTAL CUSTOMS AND PATTERNS OF\nBEHAVIOR OF THOSE YOUNG PEOPLE FROM A LOWER ECONOMIC\nSOCIAL STATUS. THE DIFFICULTY IS MULTIPLIED WHEN\nPLACED IN AN ETHNIC FRAME OF REFERENCE WITH ALL OF THE\nSTEREOTYPES AND GENERALIZATIONS RACIALLY DEFINED. Vi/ | TH\nTHIS TYPE OF BACKGROUND THE GUIDANCE COUNSELLOR MAY BE\nFORCEDTO RE-EDUCATE HIMSELF, OR HERSELF, IN TERMS OF\nHIS OWN INDIVIDUAL ATTITUDES AND IDEAS. ThE NEGRO\nPOPULATION IS BECOMING AN URBAN POPULATION GROUP. ThE\nGROWTH IS SUBURBAN W RD TREND OF A LARGE SEGMENT OF THE\nnon-Negro population. This has meant that the Negro\nFAMILY HAS MOVED INTO AREAS TH \\T WERE IN THE PROCESS OF\nDETERIORATING, AND HAS BEEN MAINLY CIRCUMSCRIBED TO A\nLIMITED HOUSING MARKET. THERE NATURALLY FOLLOWED THE\nUSUAL SOCIAL-PATHOLOGICAL PROBLEMS ASSOCIATED WITH THIS\nTYPE OF LIVING AREA. T|THOUT ENTERING INTO MORE DETAILS\nOF THIS ENVIRONMENTAL CONDITION WITH WHICH YOU ARE\nPERHAPS FAMILIAR, I MENTION THIS SITUATION BECAUSE OF\nTHE SOCIAL PSYCHOLOGICAL PRODLEMS RESULTING WHICH HAVE\nAN E FFECT' UP ON THE- V OCATI ONA L GUIDANCE PROGRAM. ThIS\nMEANS THAT CHILDREN COMING FROM SUCH AN ENVIRONMENT MAY\nHAVE A LIMITED ECONOMIC HORIZON WHICH AFFECTS THEIR\nOVERALL SCHOOL SITUATION. To BE ABLE TO CONSTRUCTIVELY\nWORK WITH THIS TYPE OF STUDENT IT IS ONLY POSSIBLE\nTHROUGH A COMPLETE UNDERSTANDING AND RECOGNITION OF\nHIS GENERAL ENVIRONMENT. A GUIDANCE COUNSELLOR MUST BE\nMUST BE EVER CAUTIOUS OR MAKING GENERALIZATIONS, WHICH\nIS EASILY DONE, BECAUSE OF THE LIMITED HORIZONS OF SOME\nSTUDENTS. That IS WHY I STRESS THE INDIVIDUAL CONCEPT\nOF PROGRAMMING BECAUSE EACH STUDENT DESERVES THE\nOPPORTUNITY TO DEVELOP TO THE LIMIT OF HIS ABILITY. OUR\nNATION NEEDS, BEYOND THE SHADOW OF DOUBT, ALL THE\nQUALIFIED MANPOWER IN ALL OF THE VOCATIONAL CLASSIFI¬\nCATIONS. TO UTILIZE THE EASY METHOD OF GROUP GENERAL¬\nIZATIONS COULD BE A SERIOUS THREAT TO OUR FUTURE GROWTH\nAND SECURITY A COMPLETE LACK OF UPHOLDING THE MORAL\nRESPONSIBILITIES OF THE GUIDANCE PROGRAM, AND MAY RUIN\nTHE POSITIVE CONTRIBUTION WHICH MANY YOUNG PEOPLE COULD\nMAKE IN OUR SOCIETY.\nOr. Frazier thus gives us a sociologists opinion that\nthe Negro appears to shape up just as well as the white\nman in terms of ability. And he reflects that Negro\nASPIRATIONS ARE IN PROCESS OF CHANGE.THE NEGRO\nLIVES IN A SOCIAL WORLD THAT IS ITSELF CHANGING, AND\nHIS ASPIRATIONS ARE CORRESPONDINGLY AFFECTED. He AIMS\nTODAY AT EDUCATIONAL GOALS THAT HE WOULD NOT HAVE\nDREAMT OF A GENERATION AGO. AND Dr. HOLLAND GIVES US\nA CLEAR IDEA OF THE NEED FOR SHEER CONSCIOUSNESS OF THE\nNegro’s background on the part of those who want to deal."
}