{
  "id": "d492-76",
  "text": "-5-\nWITH HIM EFFECTIVELY IN THE EDUCATIONAL PROCESS. The\nthings Doctors Frazier and Holland point to suggest\nMUCH THAT HAS FIGURED PROMINENTLY IN THE HISTORY OF\nTHE EDUCATION OF THE NEQROIN AMERICA. CaN WE DEGIN TO\nGET A 3 I T OF AN OVERVIEW OF THAT HISTORY, LoU?\nSCHNEIDER: A brief exploration of the historical background of\nNegro education is furnished in a slim volume by\nDorothy tirling and Donald Gross, published in 1958,\nentitled Tender vVarriors from which I'd like us to hear\na passage.\nWOMAN ‘ I : * ’’ . ..* ONE-HUNDRED AND TWENTY YEARS BEFORE THE EMANCIPATI\nPROCLAMATION, THE COLONY OF GEORGIA DECREED PENALTIES\nFOR ANYONE 1 WHO SHOULD TEACH OR CAUSE SLAVES TO BE\nTAUGHT, OR EMPLOY THEM IN ANY MANNER OF WRITING WHATSO¬\nEVER.' MISSISSIPPI DECLARED IT UNLAWFUL FOR NEGROES\nTO ASSEMBLE FOR EDUCATIONAL PURPOSES. SOUTH CAROLINA\nFORBADE THE EMPLOYMENT OF NEGROES AS CLERKS OR SALESMEN\nand Georgia imposed a fine on those employing slaves\n'in setting up type or other labor about a printing shc\nREQUIRING A KNOWLEDGE OF READING OR WRITING.'\n?’By 1832, a Virgin : legislator was able to say, ' Ve\nHAVE AS FAR AS POSSIBLE CLOSED EVERY AVENUE BY WHICH\nLIGHT MAY ENTER THEIR MINDS. If WE COULD BUT EXTINGUIS\nTHE CAPACITY TO SEE THE LIGHT, OUR WORK WOULD BE .\ncompleted. They would be on the level with the beasts\n0 F THE FIELD.’\n'’Despite the vigilance of the masters, however, many\nSLAVES MANAGED TO ACQUIRE SOME EDUCATION. ThEY CRAWLED\nUNDER THE PIAZZAS OF THE B|G HOUSE TO EAVESDROP AS\nMASTER READ THE NEWSPAPER ALOUD TO MISTRESS. ThEY\n’borrowed’ YOUNG master’s SPELLER AND young mistress’s\nSLATE AND HELD SECRET SCHOOLS IN THE PlNEY WOODS OR\nIN THEIR CHEERLESS CABINS. THEN ASKED HOW HE LEARNED\nTO READ, ONE SLAVE REPLIED, ’ISTOLE IT IN THE NIGHT, J\nSIR.’\n,?Not all of the Negro’s education was stolen. Now and\nTHEN HUMAN FEELINGS BROKE THROUGH THE PROHIBITION AND\nA KIND-HEARTED MISTRESS OR A RELIG I OUS-MINDED MASTER\nPERMITTED A FEW PRIVILEGED SLAVES TO LEARN ONE OR MORE\nOF THE THREE R’S. MORE OFTEN IT WAS THE PLANTERS’\nCHILDREN, PLAYING SCHOOL, WHO TAUGHT THEIR COLORED\nCOMPANIONS THE RUDIMENTS OF ARITHMETIC AND THEIR\nABC’ S.J’\nRICHTER: *t appears then, that despite the laws, some slaves\nDID MANAGE TO ACQUIRE AT LEAST THE RUDIMENTS OF\nEDUCATION. Do WE, HOWEVER, HAVE ANY INFORMATION ABOUT\nNegro literacy about this time of the Civil Var?\nSCHNEIDER: Yes. And of course the data do show that the vast"
}