{
  "id": "d492-77",
  "text": "-6-\nRICHTER:\nSCHNEIDER:\nRICHTER:\nMAJORITY OF NEGROES WERE ILLITERATE. THE CENSUS OF\n1870 SHOWED THAT MORE THAN 80$ WERE ILLITERATE.\nBack to the laws again, Lou. That were the motives\nOF THE SLAVE-HOLDING WHITES IN WITHHOLDING EDUCATION\nfrom the Negroes?\nI DON’T DOUDT THAT ONE THING OF IMPORTANCE WAS THAT\nMANY WHITE SLAVE HOLDERS FELT THAT EDUCATION WOULD BE\nA USELESS DISTRACTION. MOST NEGROES H A 3 TO DO HARD\nWORK, AND CERTAINLY THE AVERAGE PLANTER COULDN’T HAVE\nFELT THAT A SLAVE’S ECONOMIC VALUE OR CAPACITY TO LABOR\nWOULD BE ENHANCED BY A KNOWLEDGE OF THE THREE R’S....\nEVEN THOUGH THERE WERE SOME SKILLED ARTISANS WHOSE WORK\nMIGHT WELL HAVE BEEN IMPROVED BY AT LEAST A RUDIMENTARY\neducation. However, in this matter of motives, also,\nTHE SOUTHERNER’S CLEARLY HAD CERTAIN FEARS. IN HIS\nvolume on The Education of the Negro in the American\nSocial Order. Horace iviann Bond quotes Senator Iverson\nof Georgia from the Congressional Globe of A^ril 12,\nI860, as follows: '’There is no law in any Southern\nState, so far as I know, that prohibits the education\nof black children. Even the slaves in the State of\nGeorgia are educated to that extent. They are not\nPERMITTED TO 3 E TAUGHT TO WRITE, BECAUSE THAT WOULD BE\nDANGEROUS, CERTAINLY; FOR THEY MIGHT THEN CARRY ON A\nCORRESPONDENCE AND COMBINE; BUT THEY ARE PERMITTED TO\nBE TAUGHT TO READ AND THEY GO TO OUR SUNDAY SCHOOLS.1’\nI WOULD SUGGEST THAT SENATOR IVERSON WAS BEING A LITTLE\nOVERENTHUSI AST I C . vE KNOW THAT AT THE TIME THE SENATOR\nSPOKE IN THIS WAY, GEORGIA HAD EXPLICIT LAWS F 0 R BID DI N(\nNegroes to write or read, But the Senator’s statement\nIS INTERESTING BECAUSE OF THE FEAR IT REVEALS THAT\nWRITING MIGHT LEAD TO CORRESPONDENCE AND VIA CORRE¬\nSPONDENCE TO CONSPIRACY AND REVOLT. IN FACT, IF THE\nSenator had been able to forsee that abolitionist\nliterature would be read by Negroes me ely capable of\nreading, he might have been far less inclined to take\nTHE INDULGENT ATTITUDE HE APPARENTLY DID TOWARD TEACH I L\nNegroes how to read . The insurrectionist, Nat Turner,\nHAD BEEN TAUGHT TO READ BY HIS MASTER. And OF COURSE,\nsince Turner’s activity became a symbolic focus of\nSouthern fears of rebellion, this literacy of his\ngreatly strengthened the hand of those who wanted laws\nagainst the education of Negroes.\n.'e have, then, the notions that education would be a\nUSELESS DISTRACTION FOR SLAVES ENGAGED IN HARD LABOR\nWHO HAD NO NEED OF ANY SUCH THING. WE ALSO HAVE THE\nMOTIVE OF KEEPING THE SLAVES ILLITERATE AND IGNORANT\nTO PREVENT THEM FROM COMBINING WITH ONE ANOTHER AND\nFROM BEING EXPOSED TO POSSIBLE INFLAMMATORY IDEAS."
}