{
  "id": "d492-79",
  "text": "-8-\nR1CHTER:\nCLARK:\nAside from the complicated politics of the matter\nTHERE WERE INEVITABLY MOTIVES IN OPERATION THAT TODAY\nMUST STRIKE US AS CURIOUS OR EVEN QUAINT. FoR EXAMPLE\nTHERE WAS THE PASSION MANIFESTED BY SOME NEGROES TO\nLEARN Greek and LatI n... . accomplI shment in the classica\nTONGUES WAS SOUGHT AS A SYMBOL OF THE STATUS OF THE\nEDUCATED GENTLEMAN. THIS IS, OF COURSE, IN SOME WAYS\nVERY UNDERSTANDABLE. THERE ARE ALSO UNAVOIDABLY SEEMED\nTHREATENING TO NUMEROUS SOUTHERNERS, SINCE IT SUGGESTED\nNOT THE KIND OF EDUCATION THAT WOULD MAKE THE NEGRO A\nBETTER SERVANT OR LABORER, BUT THE KIND THAT WOULD\nTEACH HIM TO RISE OUT OF HIS J?PLACE'?. YET, THE IDEAL\nOF THE EDUCATED GENTLEMAN WAS HARDLY ONE THAT WAS\nINVARIABLY HELPFUL TO THE NEGRO IN HIS URGENT NEED FOR\nKNOWING AND COMING TO TERMS WITH THE REALITIES OF THE\nReconstruction and post-Reconstruction world. I think\nmen like Booker T. Washington saw this quite clearly.\nWash i n g t o n * wanted to give the Negro wh,\\T he thought of\nas basic industrial skills. But Washington’s motives\nWERE ALSO MIXED. IN PART HIS INSISTENCE ON TRADE AND\nINDUSTRIAL EDUCATION VERY PROBABLY REPRESENTED A CON¬\nCILIATORY ATTITUDE TOWARD WHITES WHO WOULD HAVE REACTE'\nQUITE ADVERSELY TO A FORTHRIGHT ATTEMPT TO GIVE THE\nNegro a broad, liberal education which might point to ,\nSTATUS LIKE THAT OF THE WHITE MAN. THERE WAS ALSO, HO\nEVER, SOMETHING OF A REALISTIC MOTIVE IN WASHINGTON’S\nefforts. The Negro had to face certain primary necess¬\nities IN THE WAY OF MAKING A LIVING. This HASN’T\nspared Washington the criticism of many Negroes and\nWhites, who feel that he was altogether too concilia¬\ntory. Nor does it change the fact that much Negro\n'’INDUSTRIAL*’ EDUCATION WAS HOPELESSLY OUT OF DATE AT\nTHE VERY TIME WHEN IT WAS BEING GIVEN.\nWell, you’ve just said, Lou, that whatever his motives\nBooker T. Washington was criticized by many. Or.\nKenneth Clark, professor of psychology at City College\nof New York, who has done a great deal of research on\nTHE PSYCHOLOGY OF NEGR0ES . . . . 1 S ONE OF THOSE WHO IS\nVERY CRITICAL OF WASHINGTON. HERE ARE A FEW OF HIS\nCOMMENTS AS WE RECORDED THEM IN HIS NEW YoRK OFFICE.\nWell, as far as I can see, the education of Negroes is\nDEVELOPING NOW IN TERMS OF THE EDUCATION OF EVERYBODY.\nI THINK THAT THE MANiOR MISTAKE MADE BY BOOKER T.\nWashington was that he felt that there was some kind\nOF SPECIAL OR PECULIAR EDUCATION WHICH SHOULD BE\nPROVIDED FOR NEGROES, AND, IN A SENSE, i BELIEVE THAT\nBooker T. Washington was a personification of the\nULTIMATE IN SEGREGATED EDUCATION. ON THE OTHER HAND,\nDuBoiS IN HIS INSISTENCE THAT NEGROES SHOULD BE EDU*-\nCATED IN THE SAME ACADEMIC, INTELLECTUAL WAYS THAT\nWhites were being educated, I think posed a kind of"
}