{
  "id": "d492-8",
  "text": "-9-\nRICHTER:\nKING:\nRICHTER:\nMAYS:\nRICHTER:\nSM I TH :\nRICHTER:\nWARING:\nWe will hear Reverend Martin Luther King, Jr., whose\nROLE IN THE MONTGOMERY, ALABAMA, BUS BOYCOTT MADE OF HIM\nA FIGURE OF INTERNATIONAL IMPORTANCE:\nWell, in Montgomery the buses are thoroughly integrated,\nAND THINGS ARE MOVING VERY SMOOTHLY IN THAT AREA. IN\nFACT, I DON’T KNOW OF ANY REAL INCIDENTS THAT HAVE TAKEN\nplace on the buses since they were integrated with the\nEXCEPTION OF THE TRAGIC ASPECTS OF VIOLENCE THAT TOOK\nPLACE THE FIRST FEW DAYS. We HAD SOME SHOOTINGS ON THE\nBUSES AND THINGS LIKE THAT.\nAnd Dr. Benjamin E. Mays, President of Morehouse College\ni n Atlanta, Georg i a .\nI DON’T THINK THERE HAS BEEN ANY CHANGE IN HIS MILITANCY\nYOU SEE, IT WAS HIS MILITANCY THAT BROUGHT ABOUT THE\nMay 17, 1954, decision. I think the..where the Negro\nHAS BEEN DISAPPOINTED IS..ISN’T THAT THE MOOD TOWARD\nDESEGRATI ON HASN’T GONE AS FAST AS TT MIGHT HAVE GONE.\nI THINK WHERE WE ARE GREATLY DISTURBED IS, IS NOT BETWEE\nWHETHER DESEGRATI ON GOES TEN MILES AN HOUR OR SIXTY MILE.\nAN HOUR OR ZERO.\nWE WILL LISTEN TO THE READ WRITER, MlSS LILLIAN SMITH:\nEven when I was very young, although I was sheltered anc\nPROTECTED, I BECAME AWARE OF THE FACT THAT I LIVED IN A\nTOWN WHERE THERE WERE INVISIBLE WALLS, AND THAT THOSE\nWALLS MEANT A GREAT DEAL TO EVERYBODY IN THE TOWN. I\nTHINK I FOUND IT OUT IN CHURCH, WHEN I WAS QUITE SMALL,\nWHEN I REALIZED THAT MY LITTLE COLORED PLAYMATES, AND\nEVERY SOUTHERN CHILD HAD COLORED PLAYMATES..THAT THEY\nDIDN’T GO TO MY CHURCH. THAT IN MY NICE BIG CHURCH\nWERE ONLY WHITE PEOPLE, WHITE FACES.\nTO FIND OUT WHAT’S HAPPENING ON THE LEGAL FRONT WE WILL\nHAVE ACCESS TO THE VIEWS OF SUCH PERSONS AS THE DISTIN¬\nGUISHED, retired South Carolina Jurist, Judge J. Waites\nWaring in whose court the South Carolina White Primary\nElection was outlawed:\nWell, I feel it very important, Mr. Richter, that we\nDISCUSS THE EFFECT OF LAW AND THE IMPORTANCE OFLLAW ON\nTHE WHOLE RACIAL QUESTION. I KNOW IT’S COMMON TO SAY IT\nAND VERY OFTEN SAID, THAT YOU HAVE TO EDUCATE PEOPLE\nBEFORE YOU ATTEMPT TO PASS LAWS OR THEY WON’T OBEY THEM\nBut I WANT TO STRESS the fact that you’ve got to have\nLAWS UNDER WHICH MORALITY AND DECENT THINKING CAN OPER¬\nATE. YOU HAVE GOT TO REALIZE THAT WHILE YOU MAY NOT\nLEGISLATE MORALITY, YOU CAN,AND DO, MOST OF THE SOUTH-"
}