{
  "id": "d492-81",
  "text": "-10-\nRICHTER :\nSCHNEIDER:\nRICHTER:\nMUSIC :\nI TOLD YOU ALL ALONG.\" ThIS LOADING OF THE DICE IS SO\nCRUDE AND OBVIOUS AS TO REQUIRE NO FURTHER COMMENT....\nAgain, we*ve mentioned the spiral effect. In the syste\nOF MOVING ELEMENTS THAT CONSTITUTE THE SIGNIFICANT\nTHINGS IN THE SITUATION OF THE NEGRO IN AMERICA, EDU-\nCATlONIS SURELY ONE OF THE MOST SIGNIFICANT. IMPROVE\nthe Negro’s education, and you improve his health chanc\nTHROUGH THE KNOWLEDGE AND SOPHISTICATION THAT HE AC¬\nQUIRES. YOU ALSO MAY IMPROVE HIS OCCUPATIONAL CHANCES,\nYOU IMPROVE WHAT ONE MIGHT CALL HIS ’’SELF-PRESENTATI 0N,\nFOR HE IS LIKELY, WITH AN ADEQUATE EDUCATION, TO SPEAK\nMORE FLUENTLY AND ACCURATELY, TO MAKE ALL AROUND WHAT\nWE CALL COLLOQUIALLY A \"BETTER*’ IMPRESSION. AND SO YOL\nMAY STRATEGICALLY TOUCH OFF AN UPWARD SPIRAL.\nIt seems to me that an upward spiral such as you\nDESCRIBE, LOU, IS IN FACT IN PROCESS. I HAVE HEARD IT\nREPEATEDLY STATED ON GOOD AUTHORITY THAT THE PRESENT\nDEMAND FOR EDUCATED AND WELL-TRAINED NEGROES IS\nCONSIDERABLE AND THAT THIS IS ALREADY HAVING ITS EFFECT\nfor Negro welfare in a general way.\nThere are grounds for some optimism, I think, but let’s\nNOT FORGET A POINT THAT WE MADE IN AN EARLfER PROGRAM\nWITH RESPECT TO SPIRAL PHENOMENA. It’s STILL POSSIBLE\nFOR DISGRUNTLED WHITES WITNESSING WHAT IS HAPPENING TO\nTRY TO ARREST THE FORCES IN MOTION, AS IT WERE, FROM\nTHE OUTSIDE. I MAKE NO PESSIMISTIC PREDICTIONS, BUT\nTHIS IS SOMETHING TO WHICH WE SHOULD CERTAINLY BE ALERT\ned. Upward spirals can be interfered with. On the\nOTHER HAND, IT’S POSSIBLE, TOO, THAT UPWARD SPIRALS\nMAY WORK WITH SUCH POWER AND EFFECT THAT STEPPING IN OK\nTHEM AND REVERSING THEM MAY PROVE EXTREMELY DIFFICULT\nAFTER A TIME.\n/ELL, TODAY WE HAVE BEEN DISCUSSING THE MATTER OF\nOPPORTUNITIES AND MOTIVATION IN THE EDUCATION OF THE\nNegro. Our thanks this week to Dr. E. Franklin Frazier\nChairman of the Department of Sociology at Howard\nUniversity; to Dr. kenneth Clark of the City College of\nNew York; and Dr. Jerome B. Holland, president of\nDelaware State College, for their contributions to\ntoday’s program. Next week we continue with our\ndiscussion of Negro education, 3ut from the standpoint\nOF LEGAL ACTION LEADING ULTIMATELY TO THE SUPREME\nCourt School decision of May 17, 1954. Join us then,\nwon’t YOU, AS WE CONTINUE TO DISCUSS THE NEGRO IN\nAmerica, \"The Last Citizen.\"\nTHEME UP AND UNDER\nYOU HAVE BEEN LISTENING TO Dr. Lou I S SCHNEIDER,\nProfessor of Sociology at Purdue University, and the\nprogram’s PRODUCER-DIRECTOR E. ’i. RlCHTER, AS THEY’VE\ndiscussed \"The Last Citizen.\" Thts program was\nANNCR :"
}