{
  "id": "d492-83",
  "text": "THE LAST CITIZEN\nProgram #8\n,?The Second Schoolhouse5’\nPart 2\nVOICE: (SLIGHT ECHO) We conclude that in the field of public\nEDUCATION THE DOCTRINE OF ’’SEPARATE BUT EQUAL*’ HAS NO\npl \\ c e, Separate educational facilities are inherently\nunequal. Therefore we hold that the plaintiffs and\nOTHERS SIMILARLY SITUATED FOR WHOM THE ACTIONS HAVE\nBEEN BROUGHT ARE, DEPRIVED OF THE EQUAL PROTECTION OF\nTHE LAWS GUARANTEED BY THE FOURTEENTH AMENDMENT.\nThis disposition makes unnecessary any discussion\nWHETHER SUCH SEGREGATION ALSO VIOLATES THE DUE PROCESS\nCLAUSE OF THE FOURTEENTH AMENDMENT.\nMUSIC:_STINGER\nANNCR: These words are taken from the Supreme Court Decision\nof may 17, 1954: The School decision of the United\nStates Supreme Court. Today we hear a discussion of\nSOME OF THE BACKGROUND TO THIS DECISION, AND SOME OF\nITS EFFECTS, AND ITS IMPORTANCE TO THE EDUCATION OF\nThe Last Citizen, The Negro in America.\nivius I C :_STINGER\nANNCR: The Last Citize-n: The Negro in America. A series of\nprograms devoted to the extension of our knowledge of\nTHE LARGEST MINORITY GROUP IN THE UNITED STATES, ITS\nPROBLEMS, AND THE PROBLEMS IT POSES TO ALL AMERICANS.\nThe Last Citiaen is produced by Radio Station WBAA,\nPurdue University, under a grant from the Educational\nTelevision and Radio Center, in cooperation with the\nNational Association of Educational Broadcasters. The\nDISCUSSANTS ARE THE PRODUCER OF THE SERIES, E. W.\nRichter, and Dr. Louis Schneider, Professor of Soci¬\nology at Purdue University. Todays program: ;?The\nSecond Schoolhouse”, part 2. Here now, is Mr. Richter\nRICHTER: In last week’s program we delt with some of the prob¬\nlems that the Negro faces in attempting to get an\nEDUCATION. To SET THE SCENE FOR OUR CONTINUED DIS¬\nCUSSION of Negro education today I’d like to quote a\nVERY USEFUL SUMMARY STATEMENT FROM JOSEPH KAHL’S RECEN\nTEXT ON THE AMERICAN CLASS STRUCTURE. BASING HIMSELF\non a United States Information Agency pamphlet on\nThe Negro in American Life Kahl writes: ’’The educa¬\ntional ACHIEVEMENT OF THE NEGRO PEOPLE IN THE LAST\n50 YEARS HAS BEEN PHENOMENAL. At THE TURN OF THE\nCENTURY ALMOST HALF OF THEM WERE ILLITERATE. By 1950,\nTHE ILLITERACY RATE WAS APPROACHING 10 PER CENT. In\n1950 more Negroes graduated from college than had"
}