{
  "id": "d492-86",
  "text": "-4-\nRICHTER :\nMURRAY:\nRICHTER:\nMURRAY:\nPERFORMANCE. LIBRARIES ARE TOO BARE. In MANY CASES\nTHERE IS ADEQUATE SHELVING, BUT A FEW BOOKS. THE\nPLACE OF A LIBRARY IN INSTRUCTION IS NOT FULLY APPRE¬\nCIATED. Sometimes if you ask a teacher how many books\nTHEY HAVE, THEY’LL SAY, ,TW E LL A HUNDRED VOLUMES AND\nTHEY’RE ALL HYMN BOOKS.”\nThis, then, is some of the background against which\nthe Supreme Court made its decision on school segre¬\ngation on May 17, 1954. You recall, of course, that\nTHERE WAS A GREAT OUTCRY■FROM MANY SOUTHERNERS AGAINST\nTHIS DECISION WITH CHARGES THAT THE COURT W\\S ATTEMPT¬\nING TO DESTROY A SOUTHERN SOCIAL PATTERN OF LONG\nstanding. Miss Pauli Murray, a lawyer in New York City\nAN AUTMOR, AND A STUDENT OF LEGISLATION AFFECTING\nNegroes in the United States, has this to say about\nTHE ORIGIN OF THE ’’SEPARATE BUT EQUAL DOCTRINES'*.\n'/ELL, the SEPAR'*TE AND EQUAL DOCTRINE WHICH WE ARE\nSADDLED WITH TODAY, AND WHICH WE OVERTURNED IN LARGE\nPART WITH THE EDUCATION CASES BY THE SUPREME COURT IN\n1954, IS ONLY ABOUT A HALF-CENTURY OLD IN THE HISTORY\nOF LEGISLATION IN OUR COUNTRY. BEFORE 1896, THAT\nWAS THE PLESSY VERSUS FERGUSON DECISION WHICH ENUN¬\nCIATED the Separate but Equal doctrine, there was no\nUNIFORM SEGREGATION LEGISLATION IN THE SoUTH. THERE\nHAD BEEN NO NEED FOR IT UNDER SLAVERY, BECAUSE THE\nSLAVES OCCUPIED A CERTAIN CATEGORY, AND THE MASTER\nCLASS OCCUPIED ANOTHER CATEGORY. THERE WAS A GREAT\nDEAL OF INTERMINGLING OF THE RACES IN PUBLIC ACCOMODA¬\nTIONS AND IN PUBLIC PLACES. BUT , FOLLOWING THE C|VlL\nVVar, FOLLOWING THE ABORTION OF THE RECONSTRUCTION ERA,\nAND THE COMING BACK INTO POWER OF THE WHITE SOUTH,\nTHERE BEGAN TO BE THIS GRADUAL WHITTLING AWAY OF THE\nRIGHTS WHICH THE NEGROES - OR EVEN OF SOME OF THE\nOPPORTUNITIES WHICH THE NEGROES HAD ACHIEVED DURING\nTHE BRIEF PERIOD OF RECONSTRUCTION, AND THEN THE S T A\nBEGAN TO PASS LAWS REQUIRING SEPARATION. ONE OF THESE\nSTATUTES, NOT IN THE FIELD OF EDUCATION, BUT IN THE\nFIELD OF TRANSPORTATION CAME UP FROM LOUISIANA TO THE\nSupreme Court for interpretation. That was the Plessy\nV. Ferguson case, and in 1896, by a decision of 8 to I.\nthe Supreme Court said that so long as you had equal\nFACILITIES, THE FACT THAT THEY ARE SEPARATE FACILITIES\nIS NOT UNCONSTITUTIONAL, AND IS NOT INEQUALITY WITHIN\nTHE MEANING OF THE I4TH AMENDMENT.\nThis was specifically applicable to transportation.\nThis was applicable to transportation. This was the\nCASE UPON WHICH IT CAME TO THE SUPREME COURT. HOWEVER\nTHE CASE UPON WHICH, ONE OF THE CASES UPON WHICH THE\nSupreme Court relied in announcing this doctrine was a"
}