{
  "id": "d492-87",
  "text": "-5-\nRICHTE.7:\nSCHNEIDER:\nRICHTER:\nSCHNEIDIR:\nCASE COMING FROM MASSACHUSETTS IN 1849, WHICH HAD\nALREADY BEEN REPUDIATED AND REJECTED BY THE PEOPLE\nof Massachusetts, because their Supreme Court had said,\nin about 1849, that it was all right to exclude a\nNegro child from the common schools, and legislature,\nTHE NEXT SESSION, PASSED A LAW WHICH MADE THIS DECISION\nNULL AND VOID. BUT HERE WAS THIS OLD STATUTE HANGING\nTHERE ON THE BOOKS, AND THE SUPREME COURT kEmCHED\nback a half-century and took this old Massachusetts,.\nDEC I SI ON. . . DID I SAY STATUTE? I MEANT TO SAY THIS OLD\nDEC I SI ON. . .THE SUPREME COURT REACHED BACK AND TOOK\nthis Massachusetts decision to bolster its position of\nSEPARATE BUT EQUAL. Now, I THINK IT’S VERY SIGNIFICANT\nTO NOTE THAT THAT DECISION WAS AN 8 TO I DECISION.\nThe lone who dissented was Associate Justice John M\nHarlan, whose Grandson now sits on the Supreme Court.\nAnd this justice wrote a magnificent dissenting opinion\nPROPHESYING THAT THE VIOLENCE DONE TO THE RIGHTS OF\nHUMAN BEINGS THAT DAY BY THE SUPREME COURT IN ANNOUNC¬\nING THIS SEPARTE BUT EQUAL DOCTRINE WOULD CAUSE\nANGUISH AND PAIN FOR GENERATIONS TO COME. EVERY LAWYE\nFROM THAT TIME ON WHO HAS ATTEMPTED TO FIND A LEGAL\nBASIS FOR OVERTURNING THE SEPARATE BUT EQUAL DOCTRINE\nHAS GONE TO THAT DISSENTING OPINION OF JUSTICE...\nAssociate Justice John M. Harlan.\nLou, YOU SEEM TO HAVE SOME ADDITIONAL COMMENTS TO\nMAKE .\n1-ET ME OBSERVE THAT, IN THE SUPREME COURT DECISION OF\nMay 17, 1954, the Court said, \"Separate educational\nFACILITIES ARE INHERENTLY UNEQUAL.'’ THE COURT WAS\nCAREFUL TO POINT OUT THAT EVEN WHEN PHYSICAL FACILITIES\nAND OTHER SO-CALLED \"TANGIBLE5* FACTORS MAY BE ASSUMED\nTO BE EQUAL, THERE IS STILL NO EQUALITY WHERE SEGRE¬\nGATION PREVAILS. To SEPARATE CHILDREN IN GRADE AND\nHIGH SCHOOLS—JUST SEPARATE THEM-THE COURT SAID...\n\"To SEPARATE THEM FROM OTHERS OF SIMILAR AGE AND\nqualifications solely because of their race generates\nA FEELING OF INFERIORITY AS TO THEIR STATUS IN THE\nCOMMUNITY THAT MAY AFFECT THEIR HEARTS AND MINDS IN A\nWAY UNLIKELY TO BE UNDONE.\"\nIn other words, separation is in and of itself discrim¬\nination-AT LEAST IN THE SPHERE OF EDUCATION.\nYes, AND THE ARGUMENT OF THE SUPREME COURT IS HARDLY A\nNEW ONE...IT IS AN ARGUMENT THAT HAS FREQUENTLY BEEN\nMADE BEFORE BY PERSONS WHO HAVE RECOGNIZED THAT THE\nSEGREGATED GROUP, PRECISELY IN VIRTUE OF ITS SEGREGA¬\nTION, CONSIDERS INDIVIDUALS WHO ARE NOT CONSIDERED\n\"FIT ASSOCIATES\" OF THOSE FROM WHOM THEY ARE SEPARATED\nMoreover , we are aware that very often, it has not\nBEEN THE CASE THAT SEPAR TE FACILITIES HAVE BEEN"
}