{
  "id": "d492-89",
  "text": ".7 _\nROUTH :\nSouthern compliance, or non-compliance, with the\nDECISION.\nVELL, I THINK, OF COURSE, THE MOST IMPORTANT FACT IS\nTHE WHOLE FRAME OF REFERENCE, OR THE WHOLE FRAMEWORK\nUNDER WHICH RACE RELATIONS EXIST IN THE S0UTH, WAS\nCHANGED 3 Y THE SUPREME COURT DECISION OF !Vl A V 17, 1954,\nAnd those of us who work in this field in the South dc\nNOT BELIEVE THAT THIS WAS ANY RADICAL DECISION, OR TH\nIT WAS ANY GREAT CHANGE FROM WHAT WAS ALREADY DEVELOP¬\nING. If you trace the Court decisions starting back\nABOUT 1938, FROM THEN UNTIL 1954 YOU FIND THAT BIT BY\nBIT THE FLIMSY LEGAL BASIS OF PLESSY VERSUS FERGUSON,\nTHE SEPARATE BUT EQUAL DOCTRINE WAS BEING WORN AWAY.\nAnd by 1954 the only decision open to the court was\nTHE ONE IT MADE. 'ilE WERE OF COURSE PLEASED THAT IT\nWAS A UNANIMOUS DECISION. I THINK THAT THIS\nADDED A GREAT DEAL OF STRENGTH TO THAT DECISION, PART!\nCULARLY SINCE THERE WERE THREE SOUTHERNERS SITTING ON\nthe Supreme Court at the time. I think that it is\nSIGNIFICANT THAT FOUR YEARS LATER THERE ARE ONLY S E V E\nLEFT WHO ARE PRACTICING SEGREGATION AS THEIR OFFICIAL\nSTATE POLICY. If YOU STOP AND THINK, IN 1954 THERE\nWERE 17 STATES AND THE DISTRICT OF COLUMBIA THAT\nPRACTI CED ' SEGREGAT1 ON. TODAY THERE ARE ONLY SEMEN\nLEFT THAT PRACTICE IT AS OFFICIAL POLICY. THAT\nDOES NOT MEAN, OF COURSE, BY ANY MEANS, THAT IN ALL\nOF THE STATES THAT HAVE STARTED THE PROCESS IT’S\nANYPLACE NEAR COMPLETE-ITfS NOT, BUT IF YOU IGNORE\nTHE BORDER STATES-MARYLAND, DELAWARE, 'JEST VIRGINIA,\nMissouri, and such states as that--and concentrate on\nthe Southern states you’llfind that they have made an\nAMAZING ADJUSTMENT EVEN IN THIS BRIEF PERIOD OF TIME.\nIf you put them on a continuum from the state that\nHAS DONE THE MOST ABOUT COMPLIANCE TO THE STATE WHICH\nIS MOST IN DEFIANCE, I THINK IT WOULD RUN SOMETHING\nlike this: In Oklahoma, about 84$ of the school\nDISTRICTS IN WHICH NEGRO CHILDREN LIVE ARE IN THE PRO¬\nCESS of desegregation. In Kentucky, better than 80$\nTHE SCHOOL DISTRICTS IN WHICH NEGRO SCHOOL CHILDREN\nLIVE ARE IN THE PROCESS OF DESEGREGATION. THIS IS\nFOLLOWED BY TEXAS WITH BETWEEN 25 AND 30$ OF THOSE\nSCHOOL DISTRICTS IN THE PROCESS OF DESEGREGATION.\nNOW, THE REASON FOR SAYING 25$ TO 30$ IS THAT WE’v£\nDISCOVERED A NUMBER OF SCHOOL DISTRICTS IN TEXAS THAT\nHAVE DESEGREGATED THEIR SCHOOLS BUT FAILED TO TELL THE\nSTATE GOVERNMENT ABOUT IT BECAUSE THEY DIDN’T WANT\nTROUBLE OR INTERFERENCE FROM THE STATE GOVERNMENT.\nTexas is followed by Arkansas, iN which seven school\nDISTRICTS HAVE STARTED THE PROCESS OF DESEGREGATION.\nAnd then of course we come on over to North Carolina\nWHERE THREE CITIES, CHARLOTTE, GREENSBORO, AND 'HNSTOK\nSalem, have started the process of desegregation, and"
}