{
  "id": "d492-9",
  "text": "RICHTER:\nMARSHALL\nRICHTER:\nMRS. R:\nRICHTER:\n-10-\nERN STATES, LEGISLATE I MM0RAL1TYV D UNT1L TH08E . EAWS\nARE ABROGATED OR REPEALED BY COURT ACTION OF SOME OTHER\nFORM, YOU CANNOT EVER GET DECENT LIVING AND DECENT ACC¬\nEPTANCE of the American creed.\nWe will turn to Mr. Thurgood Marshall, attorney for the\nNational Association for the Advancement of Colored\nPeople :\nI dontt know of a single beneficial move toward benefit¬\ning Negroes in the South in their rights that came about\nOTHER THAN BY LAW SUITS. THEY VOLUNTARILY DID IT AFTER\nTHEY WERE UNDER AN INJUNCTION WHICH SAID IF THEY DIDN’T\nDO IT THEY WOULD GO TO JAIL. AND I CAN NAME ANY...YOU\nTAKE VOTING, THE BEAUTIFUL SCHOOLS THEY ARE BUILDING\nfor Negroes. Not a one of them was built until we start\nED THESE LAWSUITS, AND THERE’S NOTH!NG ELSE.TREY CAN\nPOINT TO IN THE SOUTH THAT DIDN'T COME BACK THROUGH\nBLOOD, SWEAT, AND TEARS OF THE NEGROES PAYING THE EX¬\nPENSES OF THEIR OWN LAWSUITS, AND ALSO THE EXPENSES OF\nTHE STATE'S LAWSUITS BY PAYING THEIR TAXES.\nWe’ll also be hearing from such public figures as Mrs.\nEleanor Roosevelt:\nWell, I think tolerance is probably a very disagreeable\nWORD,AND i don’t LIKE IT VERY MUCH. B U T. . .WHERE PEOPLE\nARE INTOLERANT, I SUPPOSE ALL YOU CAN DO IS TO HOPE THAT\nTHEY WILL BECOME MORE TOLERANT, AND LESS INTOLERANT.\nActually, things have progressed so far now, that I\ndon’t think you have to talk about the specific things\nTHAT NEED TO BE DONE AND DONE AS QUICKLY AS POSSIBLE IN\nDIFFERENT AREAS.\nThese people and many more...sociologists, social work¬\ners, PSYCHOLOGISTS, POLITICIANS. ..WILL HELP US TO EX*,\nPLORE THE MANY FACETS OF THE LIFE OF THE NEGRO IN THE\nUnited States, but also the nature of the dilemma in -\nWHICH THIS NATION FINDS ITSELF IN RELATION TO HIM. We\nHAVE MENTIONED THAT WE WILL LOOK, IN SOME DETAIL, INTO\nTHE VARYING PUBLIC IMAGES OF THE NEGRO. Dr, SCHNEIDER\nHAS GIVEN US SOME UNDERSTANDING OF THE COMPLEXITIES\nINVOLVED IN THE NEGRO’S SEARCH FOR EQUALITY AND JUSTICE.-\nOne of our aims in the coming weeks will be to unscram¬\nble SOME OF THESE COMPLEXITIES. AND, IN THE COURSE OF\nDOING THESE THINGS WE WILL TOUCH NOT ONLY ON THE NEGRO*\nPOSITION IN THE NoRTH AS WELL AS IN THE SOUTH, BUT ALSO\nWE WILL LOOK CAREFULLY AT THE QUESTION OF HOUSING, OF\nEMPLOYMENT, OF EDUCATION, VOTING, CRIME, PREJUDICE, THE\nCONCEPT, ORCONCEPTION IF YOU WISH, OF n R A C E , AND A NUM¬\nBER OF OTHER PHENOMENA."
}