{
  "id": "d492-90",
  "text": "-8-\nRICHTER:\nDONE SO ON A VOLUNTARY BASIS. THIS WAS NOT UNDER\nCOURT ORDER. I THINK THAT’S AN IMPORTANT DISTINCTION,\nThis is followed by Tennessee, where there are two\nCOMMUNITIES, OR THREE COMMUNITIES, DEPENDING ON HOW\nYOU LOOK AT IT. NASHVILLE HAS STARTED THE PROCESS\nWITH ITS FIRST GRADE LAST YEAR, WILL CARRY IT ON INTO\nTHE SECOND GRADE THIS YEAR. ClINTON, TENNESSEE, OF\nCOURSE, HAS ALSO MOVED INTO DESEGREGATION. OaK RlDGE\nIS THE ONE COMMUNITY WHICH SOME PEOPLE QUESTION. OaK\nRidge has desegregated its schools, but it is primaril\nA FEDERAL COMMUNITY. It?S UP, OF COURSE, WHERE THE\nGREAT ATOMIC ENERGY PROJECT IS AT OAK R|DGE. SuT\nNEVERTHELESS THIS WAS DONE, TOO, SO AT L- AST COMMUNI¬\nTIES THERE HAVE STARTED THE PROCESS. ThEN THERE ARE\nTWO STATES, VIRGINIA AND FLORIDA, OF THE REMAINING\nSEVEN WHO DO NOT BELONG IN WHAT WE CALL THE THaRD-CORE\nCATEGORY. VIRGINIA IS AN UPPER SOUTH STATE WITH A\nDEEP SOUTH POSTURE. AND THIS IS A POSITION DIFFICULT\nEITHER FOR A STATE OR AN INDIVIDUAL TO MAINTAIN. AND\nTHAT LEAVES FLORIDA OUTSIDE OF THE HARD CORE CATEGORY,\nand in Florida it would not be really difficult to\nDESEGREGATE THE OaDE COUNTY AREA — THIS IS Wl I AM I—OR Th\nPenellis County area, that’s around St. Petersburg.\nThose two areas tend to be liberal, tend not to be\nWORRIED ABOUT THIS TOO MUCH. ThE OLD SAYING TH,T THE\nFURTHER SOUTH YOU GET IN FLORIDA, THE MORE NORTH YOU\nARE, I THINK IS TRUE. I WAS RAISED IN F|_ORIDA, KNOW\nIT INTIMATELY OF COURSE, AND WENT TO GRADE SCHOOL AND\nHIGH SCHOOL IN THE MIAMI ARE’,, AND KNOW THE THINKING\nOF MANY OF THE PEOPLE THERE. I DON’T THINK RESISTANCE.\nWOULD BE HIGH. THAT LEAVES FIVE STATES IN THE HARD¬\nCORE*. Louisian.*, Alabama, Georgia, South Carolina,\nMississippi. And Mississippi will be the most diffi¬\ncult STATE, AT LEAST IN MY ESTIMATION, TO WORK OUT TR\nparticular problem. The one saving grace in Georgia\nis Atlanta, a great metropolitan center, a distribute\nCENTER FOR THE ENTIRE SOUTHEAST, A FINANCIAL CENTER\nFOR THE ENTIRE SOUTHEAST, AND A CITY THAT MIGHT WELL\nBE SAID TO BE ON THE MAKE. It’s A CITY THAT HAS A\nGOOD ADMINISTRATION, A 'CITY WHOSE MeGRO POPULATION VC'~\nIN INCREASING NUMBERS ,. AND WHO ARE -POL I- T l C A L L Y ART! —\nCU LATE . This has been a VERY HELPFUL \"THING f N THIS A :\nMississippi, on the other hand, is primarily a rural\nSTATE, AND IN MOST FEATURES IS NUMBER FORTY-EIGHT IN\nA LIST OF THE STATES OF THE UNION IN TERMS OF THE\nAMOUNT OF MONEY SPENT FOR ITS SCHOOLS, AND SO ON AND\nSO FORTH, AND IN TERMS OF ATTAINMENT OF ITS SCHOOLS.\nSO THE PROBLEM THERE IS BURDENSOME, MORE SO, FOR\nINSTANCE, THAN SAY, IN GEORGIA, OR OF THE OTHER HARD¬\nCORE STATES.\nThus Fred Routh, Assistant Director of the Southern\nRegional Council, paints a picture of progress up to"
}