{
  "id": "d492-91",
  "text": "-9-\nSCHNEIDER:\nRICHTER:\nSCHNEIDER:\nTHE SUMMER OF 1958 THAT IS FAR FROM ENTIRELY DISCOURAQ\nING. Now...Lou, Pm going to pose a thoroughly naive\nquestion: Why is this issue of education so terribly\nIMPORTANT FOR THE NEGRO?\n'■Ve ALL KNOW, IN A GENERAL WAY, THAT EDUCATION IS A\nVITAL THING TODAY. EDUCATION IS A BROAD HIGHWAY TO\nBETTER EMPLOYMENT AND ALL OF THE THINGS THAT GO WITH\nBETTER JOBS. T|ME WAS, WHEN THE D R E >M OF BECOMING A\nSMALL BUSINESSMAN MADE A KIND OF SENSE. ^M ALL\nBUSINESSMEN MIGHT, AND DID FAIL....BUT A MAN COULD\nSTILL HOPE, WITH SOME JUSTIFICATION, THAT IF HE SAVED\nA CERTAIN, NOT TOO GREAT, AMOUNT OF CAPITAL AND WENT\nINTO BUSINESS FOR HIMSELF, HE MIGHT MAKE A GO OF IT.\nMind you, there were always limitations tothis kind of\nThing, BUT TODAY I T ’ S MORE AND MORE THE CASE THAT,\nUNLESS A MAN IS VERY DESIROUS OF MAKING MONEY (AND\nEDUCATION NEEDN’T BE HANDICAP EVEN IF THIS IS THE CASE\nHIS BEST BET FOR A LIFE IN WHICH HE WILL HAVE A CERTAI\nAMOUNT OF SECURITY AND A SO-CALLED DECENT INCOME IS TC\nOBTAIN AN EDUCATION. The ROAD TO WHAT, IN GENERAL\nTERMS, WE CALL ’MIDDLE-CLASS’ POSITION, LEADS THROUGH\nSCHOOL AND COLLEGE, TO TECHNICAL AND PROFESSIONAL\nTRAINING THAT CAN BE OBTAINED ONLY BY SCHOOLING.\nSo THAT THE NEGRO’S FIGHT FOR AN EDUCATION IS NOT ONLY\nA FIGHT FOR BREAD AND BUTTER, BUT ALSO A FIGHT FOR\nDECENT HEALTH, FOR ATTAINING A STATE OF BEING REASON¬\nABLY I NFCRMED . . . .SOMETH I NG WHICH COMES MOST .\nREADILY FROM SCH00LI NG. . . . AND FOR AN INCOME THAT WILL\nREALLY HELP IN MEETING HOUSING EXPENSES, MEDIC.L\nEXPENSES. ...AND SO ON.\nYes, certainly. This is what the fight is about. In\nSTRIVING FOR AN EDUCATION ON A PAR WITH THAT OF THE\nWHITE MAN, THE NEGRO IS AT THE SAME TIME STRIVING FOR\nTHINGS TH.aT EDUCATION BRINGS WITH IT. ...A CERTAIN LEVE.\nOF KNOWLEDGE AND INFORMATION INDESPENSIBLE FOR-SHALL\n1 SAY?-LIVING ’WELL’ IN THE MODERN WORLD; AN INCOME\nLEVEL OF THE KIND WE CALL ’DECENT’; A CHANCE TO REDUCE\nDISEASE TO THE LOWER INCIDENCE IT USUALLY HAS AMONG\n/HITES...YOU MIGHT ALMOST SAY IT’S A FIGHT FOR LIFE,\nOR FOR A LEVEL OF LIFE COMPARABLE TO THAT OF WHITES.\nIn 1952, THIRTY PERCENT OF WHITE FAMILIES HAD A CASH\nINCOME OF OVER $5000,00, BUT LESS THAN EIGHT PERCENT\nof the Negro families did. Very nearly three-quarters\nof the Negro families earned less than $3000.00, but\nless than forty percent of the white families earned\nunder $3000.00. In occupations you get again exactly\nwhat you might expect. Negroes are, by comparison wit\nTHE WHITES, VERY POORLY REPRESENTED IN THE PROFESSIONS\nPOORLY REPRESENTED AMONG SALESMEN AND CLERICAL WORKER:"
}