{
  "id": "d492-93",
  "text": "THE LAST CITIZEN\nProgram //9\n\"The City--Part I\"\nMigration and Urbanizatic\nJOHNSON:\nWe believe that migration embodies two major factors.\nA PUSH OUT OF ONE ENVIRONMENT AND A PULL OUT CF ANOTHE\nENVIRONMENT. THE QUESTION MIGHT BE ASKED, \"^HY DOES\nthe Negro migrate?\" The question might be asked \"Why\ndoes the Negro not migrate?\" Well, this should be,\nof course, in the context of what makes most people\nMOVE, AND PEOPLE MOVE EITHER BECAUSE THEIR PRESENT\nSITUATION IS AN UNHAPPY ONE, OR BECAUSE THE PROSPECTIV\nNEW SITUATION IS A ROSY ONE, OR BCTH.\nMUSIC:\nSTINGER\nANNCR:\nThese words by one of our guests of the day serve to\nINTRODUCE THE TOPIC OF TODAY’S DISCUSSION*. MIGRATION\nand Urbanization of the Negro in the United States as\nWE CONTINUE WITH THE PROBLEMS OF \"ThE LAST CITIZEN.\"\nMUSIC:\nSTINGER\nANNCR :\nThe Last Citizen; The Negro in America, a series of\nPROGRAMS DEVOTED TO THE EXTENSION OF OUR KNOWLEDGE OF\nTHE LARGEST MINORITY GROUP IN THE UNITED STATES, ITS\nPROBLEMS, AND THE PROBLEMS IT POSES TC ALL AMERICANS.\nThe Last Citizen is produced by Radio Station W3aA?\nPurdue University, under a gr \\nt from the Educational\nTelevision and Radio Center, in cooperation with the\nNational Association of Educational Broadcasters, The\ndiscussants are the Producer of the Series, E. W.\nRichter, and Dr. Louis Schneider, Professor of Soci¬\nology at Purdue University. Today’s program: Migratic\nand Urbanization. Here now is Mr. Richter,\nRICHTER:\nThe Negro and the City. Our discussions of the past\nFEW WEEKS HAVE CENTERED AROUND PROBLEMS THAT ARE\nNATIONAL IN THEIR SC0PE . . . . PR0BLEMS THAT ARE NOT\nLIMITED TO ANY GIVEN AREA. FOR THE NEXT FEW WEEKS WE\nWILL BE DEALING WITH PROBLEMS CONNECTED WITH THE\nNegro in a specific area of population concentration.\n...the City. We’ll be talking about such things as th\nNegro and the labor market, the Negro and the housing\nMARKET, THE NeGRO AND CRIME, AND SO FORTH. TODAY WE\nDEAL WITH HIM AS THE \"LAST MIGRANT.\" OUR DISCUSSION\nWILL HAVE TO DC WITH THE REASONS FOR HIS MIGRATION TO\nTHE CITIES, AND, TO A CERTAIN EXTENT, WITH HIS SITUA¬\nTION ONCE HE REACHES THE CITY. IN OTHER WORDS, WE’LL\nBE DEALING WITH A COMPOSITE PROBLEM OF MIGRATION AND\nURBANIZATION. FOR A GENERAL BACKGROUND TO THE MATTER\nOF MIGRATION LET’S TURN TO LOU SCHNEIDER."
}