{
  "id": "d492-95",
  "text": "-3-\nRICHTER:\nJOHNSON:\nLIKE OURS THERE IS BOUND TO BE A GREAT DEAL OF INTERNAL\nMOVEMENT. It’S FASCINATING TC TURN BACK NOW TO THE\nHISTORY OF VARIOUS MODERN C0UNTRIES....FOR EXAMPLE,\nGermany .. .and note how, in the latter decades of the\n19th century, after Germany had begun its big industry\n‘'kick'’ from about 1870 on, the currents of internal\nmigration became extremely powerful. True, the U.S. h\nconsistently been a country of high internal mobility.\nBut as of today, our high mobility is undoubtedly\nsustained by the industrial and urban character of cur\ncivilization. And the Negro people are certainly im¬\nportant, VERY IMPORTANT, IN OUR INTERNAL MIGRATION.\nIt’s fairly accurate to say that our cities were hit\nSUCCESSIVELY BY PEOPLE LIKE GERMANS AND SCANDINAVIANS,\nBY PEOPLE LIKE ITALIANS AND POLES, FINALLY BY PEOPLE\nlike Negroes and Puerto Ricans. In view of the late¬\nness of the Negro migration, and the numerical import¬\nance of the Negro group,one might fairly call the\nNegro the last migrant.the last man in... ..and by\nno means the least important one. If you like, ,?The\nLast Citizen.’’\nAnd here we are squarely on our topic. In the case\nof this program we’ve deen even more emqarassed by\nRICHES THAN WE HAVE ORDINARILY BEEN. ThE AMOUNT OF\nMATERIAL AVAILABLE TO US IS OVERWHELMING, IN CASTING\nABOUT IN THAT MATERIAL, WE HAVE DECIDED THAT IT WOULD\nBE HELPFUL TO LISTEN FOR SOME FEW MINUTES TO Dr . PoBE.\"'\n3. Johnson, Director of Research of The National\nCouncil of Christians and Jews, whose following state¬\nment HAS THE VIRTUE OF TRAVELLING BETWEEN GENERALIZED\nAND PERSONALIZED COMMENTS . . . .DOTH OF WHICH ARE USEFUL\nTO BEAR IN MIND.\n■E BELIEVE THAT MIGRATION EMBODIES TWO MAJOR FACTORS.\nA PUSH OUT OF ONE ENVIRONMENT AND A PULL OUT OF ANOTHER\nENVIRONMENT. THE QUESTION MIGHT BE ASKED, ’’WHY DOES\nthe Negro migrate?'’ The question might be asked, w^hy\ndoes the Negro not migrate?'* '/ell, this should be,\nOF COURSE, IN THE CONTEXT OF WHAT MAKES MOST PEOPLE\nMOVE AND PEOPLE MOVE EITHER BECAUSE THEIR PRESENT\nSITUATION IS AN UNHAPPY ONE OR BECAUSE THE PROSPECTIVE\nNEW SITUATION IS A ROSY ONE, OR BOTH. THE EUROPEAN\nIMMIGRANT EXPECTED TO FIND GOLD IN THE STREETS, FOR SO\nREASON, WHEN HE CAME TO THIS COUNTRY. THE AMERICAN\nNegro in the South does not make much money. In the\nAREA OF THE DEPRESSION, I THINK, THE DOMESTIC USED TO:\nMAKE THREE DOLLARS A WEEK IN THE RURAL AREAS AND MAYBE\nSIX DOLLARS A WEEK IN THE URBAN AREAS. THE SHARE¬\nCROPPER SITUATION IS MANAGER OF THE PLANTATION USES\nWHAT THEY CALL THE CROCKED PENCIL—(THAT IS, HE ALTERS\nTHE FIGURES AND YOU CAN NEVER PROVE WHETHER HE HAS'\nPUT DOWN THE RIGHT FIGURES FOR WHAT YOU OWE OR NOT,)--\nTHEN YOU’RE ALWAYS IN DEBT, YOU CAN NEVER GET AHEAD,"
}