{
  "id": "d492-99",
  "text": "RICHTER:\nSCHNEIDER:\nRICHTER:\nSCHNEIDER :\nRICHTER:\nSCHNEIDER:\n-7-\nAnd what of another problem connected with the changin\nPOPULATION PICTURE OF THE LARGE CITIES? The MATTER OF\nTHE SUDURBANWARD MOVEMENT OF WHITES?\nWell, as the Negro population in the urban areas has\nGROWN....AS PROPORTION OF NEGROES IN THE CITIES HAS\nINCREASED, THERE HAS BEEN A PRETTY CLEAR TENDENCY FOR\nTHE PROPORTION OF NEGROES IN THE SUBURBAN AREAS OF THE\nLARGER CENTERS TO DECLINE IN RECENT YEAR S. 0 N E MAY\nSAY, GENERALLY, THAT THE MOVE TO THE SUBURBS WHICH IS\nVERY REAL, IS A WHITE MOVE. MOREOVER, IT IS A MOVE Of\nTHE PART OF HIGHER INCOME WHITES. The HIGHER INCOME\nWHITES TEND TO GO TO THE SUBURBS, THE LOWER INCOME\nWHITES. The HIGHER INCOME WHITES TEND TO GO TO THE\nSUBURBS, THE LOWER INCOME WHITES TO REMAIN IN THE C\nCENTERS OF THE CITIES. ThIS HAS MANY INTERESTING\nCONSEQUENCES. AMONG THE MOST IMPORTANT FOR THE NEGRO\nIS THIS: RELEVANT STUDIES HAVE INDICATED TIME AND AGA\nTHAT PREJUDICE AGAINST NON-WHITES IS MORE LIKELY TO BE\nENTERTAINED BY LOWER INCOME THAN BY HIGHER INCOME\ngroups. Hence, the increasingly Negro population in\nTHE LARGER CITIES INCREASINGLY FINDS ITSELF SIDE BY\nSIDE WITH THE RELATIVELY MORE PREJUDICED SEGMENTS OF\nTHE WHITE POPULATION. THIS IS SURELY ONE OF THE MORE\nSIGNIFICANT FACTORS IN THE NEGRO’S PRESNET DAY URBAN\nSITUAT I ON .\nYoUTRE WORKING ON THE NOTION, I TAKE IT, THAT IN THIS\nCASE PREJUDICE IS LIKELY TO GO ALONG WITH DISCRIMINA¬\nTION. That lower income prejudiced whites will prac¬\ntice DISCRIMINATION AGAINST THE NEGRO, TRY TO DEEP HI\nSEALED IN THE DLACK-BELT AREAS, AND SO ON.\nYES, I THINK IT’S A FAIR ASSUMPTION IN THIS CASE.\nLet’s return to the first and most general of the\nQUESTIONS THAT I ASKED A WHILE AGO ABOUT THE EFFECTS\nOF THE RAPID INCREASE OF THE NEGRO POPULATION UPON\nTHE CITIES.\nI’ll try to answer it in part. The Negro generally\nFACES THE PROBLEM OF HOUSING SHORTAGES, AS WE ALREADY\nKNOW; OF CORRESPONDINGLY VERY EXPENSIVE HOUSING; THE\nPROBLEMS GIVEN HIM BY HARD-POINTS OF BREAK-THROUGH TO\nFIND LIVING SPACE AND LIVING QUARTERS. THERE ARE A\nTHOUSAND AND ONE ADDITIONAL PROBLEMS HAVING TO DO WIT\nRELATIONS TO ONE’S NEIGHBORS; WITH RELATIONS TO SHOP¬\nKEEPERS, WITH SCHOOLING. AS THESE LARGE URBAN NEGRO\nAGGLOMERATIONS APPEAL, IT HAS BEEN OBSERVED THAT\nTHOUSANDS UPON THOUSANDS OF NEGROES GO THROUGH THEIR\nLIVES WITHOUT ANY SUBSTANTIAL CONTACT WITH MEMBERS OF\nTHE WHITE COMMUNITY. The EFFECT IS OFTEN THAT OF A\nRIVEN SOCIETY, A SOCIETY SPLIT ALONG COLOR LINES, A"
}