{
  "id": "d1919-1",
  "text": "pages, available on request from Mr. Frank M. Harlacher,\nCoordinator of Public Information and Publications, Board\nof Education of Washington County, Box 730, Hagerstown,\nMaryland.\n• Copies of a free illustrated catalog, which lists nearly a\nthousand filmstrips for all grade levels, plus information on\nfree bulletin board materials, are available from The Jam\nHandy Organization, 2821 East Grand Boulevard, Detroit,\nMichigan.\n• Harry Skornia wrote an article, “American Broadcasters\nAbroad,” for the fall issue of The Quarterly Review of Eco¬\nnomics & Business.\n• Employment Outlook in Radio and Television Broadcast¬\ning Occupations costs 10c from the Superintendent of Docu¬\nments in Washington. Ask for Outlook Handbook number\n1375-105.\n• “Television Ratings and Cultural Programs” by Peter Fox\ntakes another look at sample bias in the fall Industrial Man¬\nagement Review.\n• The 235-page Educational Communications Convocation\nProceedings, New York State, is available from Bernarr\nCooper, Chief, Bureau of Mass Communications, University\nof the State of New York, State Education Department, Al¬\nbany, New York, 12224.\n• Standards of Television Transmission calls for higher and\nmore appropriate technical standards for television. The 90-\npage report, done by the NAEB under a grant from the U. S.\nOffice of Education, is available for $2.50 from the NAEB\nWashington office.\n• Children and Oral Language, published jointly by several\neducational organizations, contains comments on the basic\ncharacteristics of listening and speaking and suggestions for\nhelping children learn to listen and speak. $1 from Association\nfor Childhood Education International, 3615 Wisconsin Ave.,\nN.W., Washington 16, D.C.\nObituaries\n• Paul C. Reed, 56, supervising director of instruction for\nthe Rochester, New York, public schools, died of a heart at¬\ntack October 4. He was a nationally known leader in audio¬\nvisual education, and since 1947, he had edited Educational\nScreen Magazine. He founded the Rochester School of the\nAir, which grew into the Empire State FM School of the\nAir. He had served, as president of DAVI andi as assistant\ndirector of the JCET.\n• Charles Hodges, 69, professor emeritus of international\npolitics at New York University and news broadcaster from\nradio’s earliest days, died October 8 of a heart attack.\nHere and There\n• University of Michigan journalism professor Dean C.\nBaker is re-creating the Dallas Assassination tragedy in the\nprinted words from 191 daily newspapers throughout the\ncountry. His research aims to see how the newspaper indus¬\ntry met its challenge of reporting the event as it was hap¬\npening.\n• A record number of more than 100,000 persons were in¬\nvolved in educational exchange between the United States\nand other nations in the 1963-64 academic year, according to\nstatistics in Open Doors 1964 released recently by the Insti¬\ntute of International Education. The publication, issued an¬\nnually by the HE, is based on surveys of participants.\n• The 1965 Study Conference of the Association for Child¬\nhood Education International will be held in New York City\nthe week of April 18 and is open to nonmembers as well as\nmembers.\n• The National Electronics Conference was held last month\nat McCormick Place, Chicago, where for the first time in\nits 20-year history the conference included sessions on the\nrole of electronics in nuclear research.\n• Temple University will have its 22nd Annual Reading In¬\nstitute January 25-29.\n• The Edison Foundation has announced that nominations\nare open for the tenth annual “National Station Awards for\nServing Youth.” The 'local TV and radio stations that best\nserved youth in their communities during 1964 will receive\nan Edison National Station Award, which carries a scroll\nand an Edison Scholarship of $1,000 to be used for college\neducation which the winning stations present to a high school\nsenior selected by an appropriate committee of local educa¬\ntors. Write to the Thomas Alva Edison Foundation, 8 West\n40th Street, New York, N. Y., 10018.\n• Beginning in 1965, the Institute of International Education\nand the Reader’s Digest Foundation will give five annual\nawards for distinguished service in international education.\nGrants of $1,000 each will be given to a selected college or\nuniversity, a private organization, a community and an indi¬\nvidual who have made outstanding contributions in the de¬\nvelopment of international understanding. For further infor¬\nmation, write the HE at 809 United Nations Plaza, New\nYork, N. Y., 10017.\n• Britain’s commercial Independent TV is sending educa¬\ntional programs into 1500 schools this fall, 400 more than last\nyear.\nNews Notes\nPERSONNEL\n^ Carleton Brookins has joined KFME, Fargo, North Dako¬\nta, as program director, after a year of graduate study at\nMichigan State University. He was formerly production\nmanager at KTCA-TV.\ny Carol Kittelson, also at KFME, has been promoted from en¬\ngineering supervisor to chief engineer.\n^ William G. Harley, NAEB president, was recently re¬\nelected vice-president of the Educational Media Council.\n^ R. C. Norris, formerly of the University of Texas, has\njoined Texas Christian University as head of radio-TV and\nfilm.\n^ Burton Paulu, University of Minnesota director of radio\nand TV broadcasting, will leave this November on a sabbati¬\ncal to study European radio and television in Geneva, Swit¬\nzerland. The study, supported in part by the Ford Founda¬\ntion, will be somewhat comparable to his two previous studies\nin the United Kingdom.\n^ Daniel A. Rose, formerly assistant producer at KCSD-TV,\nKansas City, has been appointed director of radio and TV\nprograming liaison at the State University of New York\nat Buffalo. He replaces Elizabeth L. Dribben who has gone\nto WKBW-TV.\n^ Jack F. Brown has left the Democratic National Commit¬\ntee, where he recently served as assistant radio-TV coordina¬\ntor at the convention, to be ETV coordinator for a Peace\nCorps project at the University of Nebraska.\n^ Calvin Stillman, of the New School for Social Research in\nNew York City, has been appointed vice president of the\nBroadcasting Foundation of America.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Editorial assistant: Skip Robinson.\nPhone 333-0580. Area Code 217.\nReporters:\nRegion I —Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\n—Shirley Ford, WRVR, 490 Riverside Drive, New York\nCity, 10027.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}