{
  "id": "d1094-4",
  "text": "5\ny-\nHITS AND MISSES\n-'To ask the minority (of listeners) to be satisfied with the time because\nit is a minority, as is now .generally the case, is only to indulge m intellectual\nJin Crowism. If the discriminating listener is to enjoy emancipation the primary\nresponsibility rests not on himself but on those who hold him m bondage.\n(Jack Gould in New York Tines, November 17,1946).\nNovelist Fannie Hurst commenting (November 7 1946) on daytime radio\nofferings said, \"The advertisers hand has become the whip-nand. It is plastering\npalm against radio's face, squashing its features, pulling its hair, gouging\nits eyeballs, threatening to poke its front teeth down its throat . That sounds\nmore like pro-wrestling than pro-radio.\nNow comes the U.S; Chamber of Commerce reporting, \"In a socialist or\ndictatorial regime of abridged freedom of speech and press, of predetermined\neconom\" action, and of prescribed education, these valuable\nthought and action are dammed up at the source. lessir h°d- AZ.\ntool It reminds us of the Dutch boy with his thumb m the leak m the dyke.\nBROADCASTING MAGAZINE (Nov. 25) editorializes on the proposals of stations\nto limit advertising and raise program standards. As for the grandiose gesture\ntoys-those idealists who believe advertisers will spend business dollars t\nreach a smattering of starry-eyed garret-dwellers—time will tell; time that\nisn’t sold.” That for the folks who live in the big house on the corne .\n*ti believe that much of our trouble comes from the circumstance that radio\nis so convenient and that it costs nothing to listen. As a result the listener\noften fails to appreciate the worth of what ho is getting and his demands become\nunreasonable”-■Vim. S. Paloy, CBS, Oct. <s2,1946.\nTjhy isn’t your activity reported in\nthis issue? Send news contributions\nnow. Copy deadline for January issue\nis December 25. Send to:\nt-t . a . Enge 1, WHA, Madi s on, M s c ons in\nEdited by-\nH. A. Engel\nRadio Vi HA\nMadison, Tj is cons in\nDecember 2, 1946"
}