{
  "id": "d710-105",
  "text": "-5-\nSTUDY GRANTS PROGRAM ANNOUNCED BY THE FAE\nThe Fund for Adult Education announced on June 28 a new program of fellowships,\nscholarships, and study awards in adult education, \"These awards,1' said\nC. Scott Fletcher, President of the Fund, \"are the beginning of a continuing\neffort to help meet the recognised need for additional and more highly skilled\nleaders in adult education.\"\nApproximately 100 awards will be made in the first year of the program's opera¬\ntion, involving academic study, supervised field practice, or combinations of\nthe two for the improvement and advancement of individuals concerned with the\nliberal or general education of adults. The pattern of the program will be\nvaried and flexible. Candidates, chosen from persons who are involved with\nthe functioning and fostering of liberal education for adults, may spend up to\none year, full-time, in learning-by-doing association with an agency whose\nprimary function is adult education. Or they may spend up to one full academic\nyear on a full-timebasis at an institution of higher education where there is\na curriculum appropriate to each grantee's training design. Shorter programs\nare also envisaged, as are training patterns combining formal course work with\nfield practice through an agency. The over-all purpose is to increase knowledge\nimprove skills, and develop general competence in liberal adult education.\nVolunteer leaders, professional educators, administrators and other categories\nof persons concerned with liberal education for adults are eligible for awards.\nMost of the awards will be made for the calendar year 1954 and the academic\nyear 1954-55, although work under this program may begin late in 1953.\nApplications are available to all who desire to be considered for a grant. The\nsole basis of selection will be the caliber of the person concerned and the suit¬\nability of the program of self-improvement proposed.\nThe awards will be divided as follows:\nGroup I. Fellowships for academic study for one academic year. Scholar¬\nships for full-time advanced academic study for less than an academic year,\nor for part-time advanced academic study for an academic year or less.\nGroup II. Study awards for supervised agency or field training, alone or\nin combination with academic study, for an academic year or less.\nEach applicant is asked to propose the program he desires to follow under an\naward. The National Committee on Study Grants will consider both the individ¬\nual candidate and his study proposal, but will but greater weight on the indiv¬\nidual's qualifications. An award will be made only when there is agreement\nbetween the National Committee, the candidate and the place or places where he\nproposes to train. It is the candidate's responsibility to discover whether the\nplace or places for training can and will accommodate him. So far as the Nat¬\nional Committee is concerned, any study consummated under an award may be used\nfor credit toward degrees. It is entirely the option of the grantee whether\nhe matriculates, works for or completes requirements for a degree.\nNo specific sums are designated for any type of award. Each applicant will be\noffered an award that is, in the National Committee's opinion, appropriate to\nhis or her particular situation and his or her study program. The award may\nor may hot be the amount suggested in the applicant's budget.\n(Continued on next page)"
}