{
  "id": "d710-106",
  "text": "-6—\nFAE GRANTS(CONTINUED)\nAll requests for application blanks, inquiries about the program, and other com¬\nmunications should bealdressed to the Fund for Adult Education, National Commit¬\ntee on Study Grants, 141 West Jackson Boulevard, Chicago 4, Illinois. Regional\nrepresentatives of the Committee will discuss study proposals with the appli¬\ncants in their regions.\nThe deadline for applications for study awards is October 1. 1953. Applications\nfor scholarships and fellowships must be in the hands of the Committee by\nNovember 1, 1953. The lists of the study awards scheduled to begin before\nMarch 1, 1954, and of the scholarships and fellowships awards to begin before\nJune 1, 1954, will be published on December 1. Tke lists of awards to begin\nlater in.the year will be published on March 1.\nEMPIRE STATE FM SCHOOL OF THE AIR\nEugene Foster sends us the annual 1952.report. Salient quotes:\n\"Our twenty -station network covers 95$ of the state's elementary school\npopulation. Our member schools and systems include over seven thousand full¬\ntime elementary teachers or more than one-quarter of all such teachers in the\nstate outside of New York City.\n\"Of special significance during the year was the Fifth Anniversary Banquet\nlast December when two hundred members and friends gathered to celebrate the\noccasion. Paul Walker, Chairman of the Federal Communications Commission (at\nthat time), spoke from Washington by special FM hookup after his plane was\ngrounded. He said in part, 'In the five short years of its existence the\nEmpire State FM School of the Air has created a unique place for itself in the\nschool life of New York and in the annals of educational broadcasting....With\neducators educated regarding education, America could have an unbeatable team\nbrought to bear on one of our gravest national problems—the preparation of\nour children for the heavy burdens that lie before them.' \"\nThe SCIENTIFIC AMERICAN of May. 1953.carries an interesting analysis by Angus\nCampbell, Gerald Gurin, and Warren E. Miller, entitled \"Television and the\nElection.\" This article presents the results of a part of the two-year study\nof political behavior financed by the Carnegie Corporation, and done by the\nSurvey Research Center of the University of Michigan last fall.\nIt is interesting to note the impact of television on political campaigning.\nThose interested in details of this survey should request it either from the\nSurvey Research Center at the University of Michigan or from Scientific Amer¬\nican.\nOne thing that is relatively definitely established in the article is that the\nprincipal sufferer of the inroads made by television in political areas is\nradio. To quote one sentence of the survey, \"On the whole the newspapers and\nmagazines so far seem to have held their ground, for their importance was rated\nas high in the Northeast, where TV sets are most, common, as in other regions.\"\n\"Two other sentences of interest: \"Magazine readers were considerably more\nRepublican.Stevenson did somewhat better among the television devotees\nthan among those who preferred radio or newspapers, but the difference may not\nbe very significant, as geographical and other factors also entered into the\nsituation.\""
}