{
  "id": "d710-107",
  "text": "-7-\nEISENHQWER SPEECH\nIn Bedford, Pa., on May 20, President of Pennsylvania State College, Milton\nS. Eisenhower gave a stirring talk to the Pennsylvania Association of Broad¬\ncasters. A couple of quotes:\n\"Our Interest, as a nation, in the potentialities of television is much more\nthan academic. TV has become part of our culture during an era of extraordin¬\nary unrest and of rapid social change. As a very effective medium of mass\ncommunication, it will undoubtedly play a critical part in charting the future\ncourse of human history. And, like atomic energy, its effect on mankind can be\nliterally catastrophic, or just as emphatically benign.\n\"Some progress, indeed remarkable progress, is being made when one considers\nthat educational television, as an independent movement, is less than five years\nold. Heal impetus to the movement came with the announcement on April 14, 1952,\nthat the FCC had reserved 242 channels for non-commercial educational use. Al¬\nthough some S00 colleges, universities, and public school systems across the\nnation had joined forces to foster just that end, they were unprepared for\naction when the announcement was made. So, on April 20-24, 1952, they held a\nnational Educational Television Programs Institute at Penn State under the\nadministrative and financial sponsorship of the American Council on Education,\n’To gain greater understanding of the role of television, both through educa¬\ntional and commercial channels, in the total educational process.'\n”We are, in short, doing everything we can to foster the .development of educa¬\ntional television as a full-fledged collateral of commercial television, so\nthat we might share with you the enormous responsibility for making maximum use\nof what can be a veritable boon to mankind.\n\"We in education have, for example, a solemn obligation to do something for the\n10 million adult Americans who are functionally illiterate. We cannot ignore\nthe implications in a recent report that, because of correctable educational\ndeficiencies, one out of every ten men now entering the United State Army\ncannot derive maximum advantage from his basic training. We know that juvenile\ndelinquency can be reduced by effective counsel.We know that farming can\nbe improved.We are deeply impressed by the terrible urgency of helping\npeople understand the bewildering changes now occurring in their everyday\nworld, and to recognize the importance of adapting to those changes with intel¬\nligence and self-assurance.\n\"All these opportunities for public service require us to reach vast numbers\nof people quickly and with a technique that is meaningful to widely diverse tem¬\nperaments and degrees of intelligence. If we fail in this urgent and expanding\ntask, we widen the gap between the knowledge of the few and the understanding\nof the many, and it is precisely that gap that the forces which are hostile to\na free society are quick to exploit.\"\nUNIVERSITY OF SOUTH DAKOTA RADIO SCHOLARSHIPS AWARDED\nScholarships amounting to $300 have been awarded to four students planning to .\nenter the departments of radio and radio engineering at the University of\nSouth Dakota next fall.\nThe South Dakota Broadcaster’s association, which is made up of all radio\nstations in South Dakota, donated $200 of the award money. The remainder of\nthe scholarship money was contributed anonymously."
}