{
  "id": "d710-108",
  "text": "-8-\nCLARK ADDRESS\nAmong outstanding Commencement and Baccalaureate addresses of the year, is the\nBaccalauerate address of Delbert Clark, Eastern Representative of the Fund for\nAdult Education at the 150th Commencement of the University of Georgia, on\nJune 8. Two quotations from this speech form good rules for educational broad¬\ncasters.\nn?he world is what you make it. Are you brave enough to violate a senseless\ntradition? Do you dare to stand up and fight for a sound tradition which is\nfor the moment unpopular? Are you willing to \"think otherwise\" in a genera¬\ntion to which conformity has become a sacred shibboleth? Are you prepared to\ntake a long,critical look at the world you are inheriting, and take on the job\nof improving it, even in a very small way?\n\"If you are — if you accept your years at the university as basic training and\nno more — if you recognize, in the words of H. G. Wells, that ‘human history\nbecomes more and more a race between education and catastrophe1 — if you under¬\nstand that education is an unending process whose purpose is to prepare us fa*\nthe enjoyment of life and the practice of responsible citizenship then you will\nhave earned the degrees you are about to receive. You will, in short, have\nmade a good start along the infinitely varied, tremendously exciting road\nwhich is liberal education.\n\"Too great reliance on know-how, indeed, plays directly into the hands of the\ntotalitarians, whether of right or of left, for it is they who have placed the\ntechnical expert upon a pedestal, who deny to anyone but the specialist the\nright to think at all. Some one once said, and wisely I think, that 'the ex¬\npert whould always be on tap, but never on top.1 Because a man is a highly\nskilled plumber, or even a highly learned professor, does that of itself give\nhim the right to tell me how I should order my life?\"\nAHA CRITICIZES RADIO AND TV \"DOCTORS\"\nThe Journal of the American Medical Association threw an editorial haymaker at\nradio and television programs that feature stethoscopes , white coats, and\nmedical claims in advertising. The Journal said it has received many complain¬\ning letters from physicians and others who \"assert this is a cheap attempt to\nmislead the audiences into believing that the claims have been proven medi¬\ncally.\" The Journal added, \"They also claim, and there seems to be an increas¬\ning accumulation of evidence to support this belief, that most of the audiences\nhave been exposed to so much of this drivel that there is not only suspicion\nand even disbelief but actual resentment when programs featuring such advertising\nare offered.\"\nThe A.M.A. house of delegates recently recommended a study by the A.M.A. board\nof trustees, a meeting of mutually interested parties in the radio and tele¬\nvision industry, and the consultation of county and state medical societies\nwith local radio and television stations \"to effect solutions for advertising\nprograms that affect the medical profession.\"\nLOWELL'S EDUCATIONAL TV BOSTON APPLICATION\nWGBH-Fm here filed application June 1 with the FCC to operate Boston's educa¬\ntional TV station channel 2. Ralph Lowell, head of the Lowell Institute Co¬\noperative Broadcasting Council said it would cost ^450,000 to set up the new\nstation and $200,000 to run it for the first year."
}