{
  "id": "d710-109",
  "text": "COAST TO COAST WITH NAEBERS\nPresident Graydon Ausmus is off to Europe right after the Wisconsin meeting.\nA report from him next time.\nIf you need help seeling your area on a 10-watt school station, write Vernon\nMcKown, of New Albany, Indiana Schools for The Story of WAS.\nRichard B. Hull, Director of WOI-AM-FM-TV, Iowa Sate College, is the author of\nthe article, \"Shall We Educate a New Species to Operate TV.\" in the July issue\nof The Quill, publication of Sigma Delta Chi. This issue is devoted to tele¬\nvision.\nThe WNYC Festival of Books continues to draw heavy praise and its significance\nis only now percolating down to many stations.\nMr. Benedict P. Cottone, General Counsel of the Federal Communications Commis¬\nsion since 1946, has resigned to join the Washington law office of ex-Senator\nScott W. Lucas. In accepting Mr. Cottone's resignation, Chairman Hyde wrote\nthe former General Counsel, UI wish to express appreciation for the skill and\ndevotion to duty which you have demonstrated in discharging the duties of a\nchallenging office since April 1946. Commendation of Mr. Cottonefs service\nalso was expressed by Comrs. Paul A. Walker and Frieda B. Hennock.\nA release from WOI-TV includes this encouraging paragraph:\n\"WOI-TV's service area now includes at least 135,000 home TV receivers.\nOur average morning audience is 75,000 - 100,000 including about 25,000\nclassroom pupils who regularly view 'Iowa TV Schooltime.' Our afternoon\naudience averages 100,000 - 250,000. In the evening the audience aver¬\nages 300,000 - 450,000.\"\nNeil H. Mehler, former television program supervisor for Chicago public\nschools, has been named manager of Illinois Institute of Technology’s radio .and\ntelevision activities. His appointment was announced by Stewart S. Howe,\nof Illinois Tech. Mehler was formerly program director of station WBEZ, Board\nof Education station in Chicago and chief producer for the experimental sec¬\ntion of the Fund for Adult Education TV project at Iowa State College.\nThe Rev. Leo P. McLaughlin, director of Fordham University's radio station WFUV,\nhas been appointed Dean of Fordham*s College of Arts and Sciences. The appoint¬\nment was announced by the Rev. Laurence J. McGinley, president of Fordham Uni¬\nversity. Father McLaughlin came to Fordham in 1950 as director of WFUV and in\nSeptember, 1952,was named chairman of the.department of communication arts.\nBorn in New York, Father McLaughlin enter the Society of Jesus in 1933 and was\nordained a priest in 1945.\nAmbitious in spite of the heat, is the W0SU (Ohio State) program bulletin for\nJuly. Space and time prevent quotes, but we recommend it.\nOur thanks, for NAEB, to the National Association for Better Radio and Tele¬\nvision (NAFBRAT) for its 1952 Radio Award to\"Jeffersonian Heritage,\" recog¬\nnizing it as the Program of the Year. ."
}