{
  "id": "d710-114",
  "text": "CHARLES E. WILSON OH EDUCATIONAL TELEVISION\nThe Secretary of Defense and former National Mobilizer and former president of\nGeneral Electric Co. expresses his views on educational TV. 11 .....I believe\nthat nationwide educational television is e conimically sound. Education is\nbig business, perhaps the biggest single business existing today. It adequately\ncan support the operation and programming of the 242 television channels now\nset aside for non-commercial educational purposes. If it increased the educa¬\ntional level only a few percentage points, and I feel it can do more than that,\nthe increase in the value and the product of increased skill and knowledge\nwould more than pay for its cost...•\n’’Educational television provides an opportunity for a fresh approach, for a\nnew consideration of the appeal to the eye as well as the ear, and perhaps even\nfor a revision of teaching methods....\n”1 urge the support of educational television by every man and woman who has\nserious consideration for this nation’s future and for the future of their\nchildren. ”\nTELEVISION COST\nFrom an AP dispatch: The cost of building a television station and operating\nit for two years was placed at 1-million dollars by an electronics engineer.\nBut the engineer, E. A. Hungerford, Jr. of Washington, D.C., told the National\nEducation Association that even at that cost, television is a bargain. He\nadded that while his estimate is a lot of money, the cost per viewer is ridic¬\nulously low. Hungerford said the 242 educational television channels reserved\nby the FCC are valuable franchises that—as he put it—have been handed to\nthe educators on a silver platter.\nALABAMA PASSES STATE NETWORK BILL\nThe Alabama' legislature, with only two dissenting votes in the House and three\nin the Senate, passed an educational television bill providing s?500,000 to\nput Alabama’s first station on the air and to help establish a statewide net¬\nwork. Channel reservations are available for Auburn, Birmingham, Mobile,\nMontgomery and University.\nAlabama is the second state to pass legislation providing for a state network\nof educational stations. Oklahoma was the first.\nGraydon Ausmus, director of the Radio Broadcasting Services at the University\nof Alabama and president of NaEB, commented, ’’Alabama has taken one of the most\nprogressive steps in the history of the state. It means, in effect, that the\ntotal educational resources of this state can be tapped for the education, in¬\nformation and cultural enlightenment‘of the total population. It menas that\nthousands of people who have had their education interrupted....will be able to\ntake for credit or non-credit actual high school and college courses.I will\nmean that our poorest and smallest rural school can have an art teacher, a music\nteacher, a mathematics specialist...It will mean that our state institutions\nwith their specialized skills and knowledge can be tapped and made available to\nthe whole population.\nJEFFERSONIAN HERITAGE, PEOPLE UNDER COMMUNISM, & WAYS OF MANKIND ALBUMS\nAVAILABLE FROM HDQ."
}