{
  "id": "d710-124",
  "text": "-24 -\nTV GROUP OUTLIES ACCOMPLISHMENTS OF E-DUCATgES\nIn a special summary, the National Citizens Committee for Educational Television\nreported today that there has been spontaneous citizen activity all over the\ncountry in behalf of educational TV. The special suinmary was prepared for Dr..\nMilton Eisenhower, president of Penn State, and Marion Folsom, honorary co-chair¬\nmen of the committee.\nIn the report, the NCCET listed 45 communities which have applied for non-commer¬\ncial licenses as of June 2, 1953> was the last day on which applications for non- .\ncommercial stations could be made, and points out that as a result of a direct\nrequest of the NCCET, the FCC on May 11 published a public notice in which it.\nsaid that ’’reservations of TV channels for non-commercial use • . . continue in¬\ndefinitely.” .\nThe report also states that foundations have already pledged about $8,000,000.\ntoward educational stations and have made possible the beginning of organizations\nthat eventually will build non-commercial stations.\nAmong those who have pledged monies are: The A. W. Mellon Educational and\nCharitable Trust; The ..rbuckle-Jamison Trust; The Allan Hancock Foundation; The\nTwentieth Century Fund; The Lincoln and Theresa Filene Foundation; Arthur B.\nBaer, president of Stix, Baer & Fuller ; The John Rich Foundation; Lowell In¬\nstitute; The Fund for Adult Education; The Rosenberg Foundation and The San\nFrancisco Foundation.\nI Radio-Television Daily. June 8, 1953)\nFUND SOLICITATION TO BEGIN HERE SOON FOR EDUCATIONAL TV\nSome of the community’s ablest people, experienced in fund raising, are being\norganized to conduct general solicitation of funds for Channel 9 educational\ntelevision station, Raymond H. Whittcoff retiring president of the Adult Edu¬\ncation Council of Greater St. Louis, said in an address last night.\nWittcoff, who also is vice chairman of the St. Louis Educational Television Sta¬\ntion Commission, spoke at the annual open meeting and assemoly of delegates of\nthe council at the Forest Park Hotel. Announcement of plans for the general\nsolicitation will be made ’’very soon” he promised.\nCharles Guggenheim, acting director of Channel 9, asserted that because.the\nSt. Louis station is a community project, if offers the greatest possibility,\nfor the production and direction of educational television programs of any city\nin the nation.\nHe predicted that because of its community setup, St. Louis may well be.known\nin five years as the program center of the nation for educational television.\nGoal of the fund-raising campaign, Wittcoff said, is $490,000, which would pro¬\nvide $130,000 per year for three years for evening adult programs, plus $40,000\nfor extra equipment. Twenty—one Boards of Education in this area have pledged\nappropriations totaling $150,000 per year, the amount needed to put on programs\nduring school hours.\n(St. Louis Globe-Democrat. June 12, 1953)"
}