{
  "id": "d710-134",
  "text": "I\nI\nII\nu\nII\nBackground: In a little apartment near the village of\nKappel in central Germany, Milton Mayer talks with\nPastor Herman Stauber. Pastor Stauber, who is 74 years\nold, has served the Evangelical Church, the state church\nof Germany, all his life, first as a missionary in India,\nand then for 30 years as pastor of the village of Kappel.\nHis son, Horst, was editor of his high school newspaper\nand a leader in outdoor sports and camping activities.\nMilton Mayer supposes, therefore, that he might be\ncalled typical of the young German leadership group\nof today.\nBackground: The biggest building in Rome is not the\nno.\nare not members of the U.N. itself. Next, in Geneva,\nSwitzerland, at the European Headquarters of the United\nNations, Milton Mayer interviews Dr. P. F. Noach, the\nchief medical officer of Israel to the World Health\nOrganization.\nUoiosseum. ine Diggesi ouiiamg in name is me ueuu-\nquarters of the Food and Agriculture Organization of the\nUnited Nations. Here Milton Mayer interviews Sir\nHerbert Broadley, the Deputy Director-General of F A O.\nwhich has GG member countries, including some which\n1\nI\nI\nBackground: Professor Paolo Sylos-Labini of the Econom¬\nics Department of the University of Rome, was born in\nRome in 1920. the son of a civil servant, was graduated\nfrom the University of Rome in 1942, and has been a\nmember of its Economic Faculty since 1944. In recent\nyears. Professor Sylos has been studying the problem of\nunderdeveloped areas. Signor Veniero Marsan is an\neconomist in the research department of a government\nfinancial institution in Rome where Milton Mayer inter¬\nviews him.\n£.5 <5\nBackground: In Geneva, Switzerland, Milton Mayer inter¬\nviews Dr. G. J. van Heuven Goedhart, the United Nations\nHigh Commissioner for Refugees. Dr. Goedhart is a\nnewspaper editor by profession. When his newspaper\nwas taken over by the Nazis with the invasion of the\nNetherlands, he began the editorship of an underground\nnewspaper which today is one of the largest newspapers\nin Holland.\nBackground: Milton Mayer interviews Dr. Martin Niemoller\nin the study of his home in Wiesbaden, Germany. Dr.\nNiemoller is certainly the most famous clergyman in\nGermany, is President of the Evangelical Church of the\nstate of Hessen and Nassau. He was in the first World\nWar a U-boat commander, in the second World War an\ninmate of a Nazi concentration camp."
}