{
  "id": "d710-136",
  "text": "On newspapers in On the Beveridge\nOn the \"neo-Fascist\" Germany since Report and economic What is Switzerland On heroism in Nazi\nparty in Italy the war conditions in Britain and Swiss Federalism Germany\nPrince Valerio Borghese Fraulein Dr. Renata Unkrodt Lord Beveridge Max Habicht Professor and Frau Carl Hermann\nBackground: In a cold water flat in the ancient university\ntown of Marburg, Germany, Milton Mayer interviews\nProfessor and Frau Carl Hermann, entirely surrounded,\nas Mr. Mayer describes it, by an assortment of cats,\nrefugees, children and other odd creatures. Dr. Hermann\nis professor of Physics at Marburg University, and as\nsuch, an eminent personage. He was not always as\neminent as he is now. nor was his wife always as re¬\nspected as she is now. Here is their story of life during\nthe times of Nazism in Germany.\nBackground: In what is perhaps the most international city\nof all. Geneva, Switzerland, Milton Mayer interviews a\ncitizen of Switzerland, Mr. Max Habicht, a Doctor of\nLaws from the University of Zurich and also from Har¬\nvard University. Mr. Habicht is a member of the Legal\nSection of the League of Nations Secretariat and is a\ndistinguished international lawyer and authority on in¬\nternational law.\nBackground: Lord Beveridge, the holder of some 13 hon¬\norary degrees from universities all over the world, was\nPresident of the Royal Economic Society of Great Britain\nfrom 1940 to 1943, and was the author of the Beveridge\nReport in 1942, on the basis of which he is generally\nregarded as the parent of present-day Britain. At the\nage of 73, this economist, administrator, civil servant and\nauthor is at work on another book in addition to his\nmanaging the affairs of this government development of\nthe village of Newton Aycliffe.\nBackground: Fraulein Dr. Renata Unkrodt, the daughter\nof a judge in Prussia, attended University in Marburg\nduring the Nazi period and because she was not a mem¬\nber of the National Socialist Party was never able to\nbegin her career as a journalist. In 1945 she had an\nopportunity to join the staff of the newly-revived news¬\npaper in Marburg in Germany and she is now the\nWomen's Editor and also editor for Arts and Sciences of\nthe Oberhessche Press, a small daily newspaper in the\ncity of Marburg.\nBackground: Prince Valerio Borghese, whom Milton Mayer\ninterviews in his office in Rome, is the head of the MSI,\nthe Movamento Sociali Italiano. Prince Borghese was\nborn in Rome in 1906 and is a member of one of the most\nfamous families in Roman history. His book: “The Tenth\nMass Flottilla\", published in Italy in 1950 and now in its\nfifth edition, is being published in England under the\ntitle: \"Sea Devil\"."
}