{
  "id": "d710-143",
  "text": "On how life has On conditions\nchanged for the Two religious figures The lives of two On the theater and between East\nwomen of Europe from Germany women of Europe cinema in Berlin and West\nMrs. Lucy Gable and Bishop Otto Friedrich Dibelius Mademoiselle Yvonne Brunoy Friedrich Luft and Dr. Mogens Fog and\nSignora Ines Zilli-Guy and Martin Stiencke (Tao Chun) and Signora Maria Comberti Wolfgang Staudte Mr. Gerald Bailey\nBackground: In Copenhagen, Milton Mayer interviews a\nCommunist professor. Dr. Mogens Fog, professor of\nneurology in the University of Copenhagen, was the\nleader — the leader, not a leader — of the Danish re¬\nsistance during the Nazi occupation of Denmark. As\npresident of the Council of Freedom, the Danish re¬\nsistance movement, he was a member of the first post¬\nwar cabinet of his country. In the peaceful English\ncountryside of County Surrey, Milton Mayer next inter¬\nviews Gerald Bailey, secretary of the East-West Rela¬\ntions Committee of the Religious Society of Friends, more\npopularly known as the Quakers. During the last few\nyears, Gerald Bailey has been concentrating on the\nEast-West problem. He organized and led the British\nQuaker Mission to Moscow in the summer of 1951, and\nis a member of the international Quaker team which has\nattended the recent General Assemblies of the United\nNations as observers.\nBackground: Friedrich Luft is a Berliner whose family just\nabout goes back to the beginnings of Berlin. As drama\ncritic of the newspaper Neuwetsitung and the Berlin\nradio station RIAS, Friedrich Luft is the only critic in\nGermany who, through both pen and voice, reaches all\nof his own countrymen. Wolfgang Staudte is one of the\nmost famous of Germany's new film directors since the\ninternational success of his The Murderers Are Among Us.\nBackground: Mademoiselle Yvonne Brunoy is a Paris pros¬\ntitute and is so registered with the Paris police. Like\nmany other members of her profession, she is usually to\nbe found in the vicinity of the world-famous \"Madeleine,\"\nthe church which bears the name of St. Mary Magdalene.\nThe voice of Madamoiselle Brunoy — this is not her real\nname but this is a real person — her's too is a voice of\nEurope and a voice of humanity. It might not be in¬\nappropriate to suggest that whoever would throw the\nfirst stone listen to the story of Yvonne Brunoy before\nshe entered her chosen profession. Everybody — maybe\nnot everybody, but everybody who has ever gone broke\nor otherwise got into difficulty in the city of Florence, in\nItaly, has heard of Maria Comberti. Maybe it's only\nbecause she speaks English, French and German as\n1 fluently as she speaks her own language, Italian.\nBackground: Otto Friedrich Dibelius of Berlin is not what\nwe would call a realist. In March, 1933, he was invited\nin his capacity as superintendent of the Prussian Diocese\nto preach the invocation at the first meeting of Hitler's\nnew Reichstag in Potsdam. He concluded his invocation\nwith these words: “The dictatorship of a totalitarian\nstate is irreconcilable with the will of God.\" That was\nan unrealistic thing to say in March of 1933 in front of\nthe German government. He was removed from office\nand forbidden to preach. In southern Germany, Milton\nMayer interviews a Chinese monk. This monk is named\nMartin Stiencke Tao Chun. The last part of his name,\nTao Chun, is his name as a Buddhist. The Martin\nStiencke is the name with which he was baptized when\nhe was born, the son of a tailor, in Potsdam, Germany,\nseventy years ago.\nBackground: Milton Mayer interviews first an Alsatian,\nMrs. Lucy Gable, who worked for both the French and\nthe Germans during World War II and was accused of\ncollaboration by both sides. However, her only thought\nwas to provide for her two daughters, and this is her\nstory. Signora Inez Zilli-Guy of Florence, Italy, is the\nwife of an official of a food company and the mother of\n3 sons: one a professor, one a physician, and one an\nengineer. In addition she has a few other full-time jobs.\nShe is vice-president of the Young Woman's Christian\nAssociation of Italy, and editor of the woman's maga¬\nzine Alii."
}