{
  "id": "d710-145",
  "text": "Herr Sven Lindquist Dr. Johannes Novrup and Herr and Frau Fent Dr. John Rawlings Rees and Professori Velli Merikoski and\nPeter Manniche Dr. Hans Hoff Dr. Arvo Puukari\nno.\nBackground: Professori Velli Merikoski of the Faculty of\nLaw in Helsinki University, Finland's leading authority\non the American common law, was born in Carelia, in\nthat part of the Finnish province which is now lost to\nthe Soviet Union. His wife is Swedish. Professori\nMerikoski was formerly Dean of the Law Faculty of\nHelsinki University and formerly President of the Finnish\nLaw association. The man in Finland who ought to\nknow more about fhe burden of war and its aftermath\nthan any other is Lysensait Arvo Puukari, lecturer in\neconomic administration at Helsinki University and\nHelsinki Business School. Lysensati Puukari's expert¬\nness is not entirely in the theoretical area of economics.\nHe was executive secretary of Finland's National Com¬\nmunity Chest, all of its relief work during and after the\nsecond World War.\nBackground: In 1948 the World Federation for Mental\nHealth was established in London, representing 69 pro¬\nfessional societies in 33 countries, and Dr. John Rawlings\nRees, one of England's most distinguished psychiatrists,\nwas elected its first president. He is now its director.\nDr,, Rees was a member of the staff of the Tavistock\nPsychiatric Clinic in London from its beginning in 1920\nand he was its director from 1932 until the second\nWorld War, in which he served as senior consulting\npsychologist with the British Army. It would be im¬\npolite, to say the least, to go to Vienna and not to\nobtain a psychiatric view of the world we live in in this\ncity of Sigmund Freud. The most distinguished member\nof the Vienna School of Psychiatry and Neurology is Dr.\nHans Hoff. Dr. Hoff is a Viennese himself, trained at\nthe University of Vienna.\nBackground: Milton Mayer interviews Herr Paul Fent, a\nplaywright, and Ingebourg Fent, his wife, a writer of\nfairy tales, to discover what has happened to \"Alt Wien\"\nand the spirit of Johann Strauss.\nBackground: For ten years Dr. Johannes Novrup was a\nteacher in the largest folk high school in Denmark, in\nthe town of Ansko. and then, for eight years, advisor\nfor adult education to the Danish government. In 1949\nhe was President of the World Conference on Adult\nEducation held in Denmark, and in 1950 he became prin¬\ncipal of his own folk high school in the town of Birkerod.\nBesides being the author of several books on the phi¬\nlosophy of education. Dr. Novrup is a member of the\nDanish national commission of UNESCO and President of\nthe governing board of UNESCO's international institute\nin Germany. In 1921 Denmark gave the world something\nnew in education. The principal of one of their folk\nhigh schools, or people's colleges, a college in Copen¬\nhagen for young workers, established the international\npeople's college in the town of Helsingor, in northwest\nDenmark. That man was Peter Manniche.\nBackground: In the pleasant little port city of Malmo, in\nsouthwestern Sweden, where, incidentally, a double\nmurder and suicide occurred the day before Milton\nMayer got there, he talks with Herr Sven Lindquist a\nSwedish business-man whose hobby is the world. His\nfellow Malmo-ans explain that he is so touch interested\nin the world that his business is going to pieces. Herr\nLindquist admits that this is the case. He admits it with\na dour smile. He is known far and wide in his own\nprovince as an extremely dour man. And that's why\nMilton Mayer wanted to talk to him."
}