{
  "id": "d710-150",
  "text": "On education, Fascism On Swedish-American On adult education\nand Communism exchange and Swedish movements in Sweden On the World Council On the experiences\nin Italy social legislation and Vienna of Churches of their lives\nDon Manetti and Fru Heilborn and Fru Rossel Dr. Air Ahlberg and Dr. Willem Visser t’Hooff Mile. Hedy and Maire Halonen\nProfessor Giovanni Pioli Frau Gertrud Magaziner\nthe Parisian existentialists were the caies of the Deux\nMagot and the Flore, on the Boulevard St. Germain\non the Left Bank. Mayer was told that if he wanted\nto find out about existentialism, if he wanted to see it\nalive, he should have to meet Mile. Hedy. And so he\nwent to the Bar Montana where he found a plump\nlittle girl who looked about 15 years old, with curly\nwild yellow hair, wearing blue jeans and a turtle-neck\nblue sweater and a flaming red jacket. Mile. Hedy.\nMaire Halonen is a Finnish girl from a small ‘ry\ntown in East Finland where her father, who in\n1932, owned a small sawmill. The Halonen fati=r-and\nsawmill are dated back to about 1550, as far as the\nchurch records go. The earlier church records, ac¬\ncording to Maire, were destroyed in one of the many\nwars between the Finns and the Russians.\nBackground: It is perhaps particularly appropriate to\nthis recorded interview that Milton Mayer should have\nmet a Dutchman in Sweden who lives in Switzerland.\nIn 1924, as a pastor of the Dutch Reform Church, Dr.\nWillem Visser t'Hooft became secretary of the World\nCouncil of the YMCA, and in 1931 general secretary\nof the World Student Christian Federation. In 1948\nthe first assembly of the World Council of Churches in\nAmsterdam selected him as its general secretary and\nin this capacity he turns up occasionally, he says, in\nhis office in Geneva, more often in Bangkok, Cape¬\ntown or Evanston, Illinois. In the city of Lund, Sweden,\nMilton Mayer interviews him.\nBackground: In the province of Dalecarlia, where the\nnorth of Sweden really begins, the forests open up\nnear the town of Ludvika, on Lake Vessman. The\nFolk High Schools here in Sweden, as everywhere in\nScandinavia, are supported by the state, but they are\nprivately directed and controlled. The principal of\nthe Brunnswig Folk High School is Dr. Alf Ahlberg\nwho has been its principal for 25 years, and vlhose\nname is synonymous with education, not only in\nSweden but in Scandinavia and in Europe. As befits\na Viennese, Frau Gertrud Magaziner is a musician by\nprofession and at heart, but her profession in the\ncourse of history got lost, she says. She was a social¬\nist, an old socialist, but not so very old. In England,\nshe served during the war as secretary of Prime\nMinister Chubashish of the Yugoslavian Government\nin Exile. In 1947 the Magaziners came back home to\nVienna. And now Frau Magaziner is associated with\nthe \"Verbant Weiner Folks Bildung,'' the adult edu¬\ncation system of the city of Vienna.\nBackground: In Stockholm, Milton Mayer interviews a\nlady who may be a Swede and who may not be. She\nis Fru. or Mrs. Adele Heilborn. Her husband is Presi¬\ndent of a publishing company in Sweden and she her¬\nself is director of the Swedish-American Foundation.\nShe is also President of the American Women's b.\nAlso in Stockholm, Milton Mayer interviews Fri Sa\nRossel of the Swedish Royal Labor Board, the co_.er-\npart of the United States Department of Labor. Fru\nRossel is President of the Swedish Business and Pro¬\nfessional Women and delegate of the Swedish gov¬\nernment to the United Nations Commission on Human\nRights.\nBackground: Don Manetti teaches religion in the Lyceo\nDante, one of the public high schools in Florence.\nIn the middle years of the 1930's there were only 12\nprofessors in all of Italy who refused to sign the\nloyalty oath to the Fascist Government. Professor\nGiovanni Pioli was not one of these twelve because\nhe had already long since been dismissed from his\nprofessorship. He is 75 now, a white-bearded man\nwho is one of Italy's most famous religious liberals.\nPerhaps it is necessary to add that in view of the fact\nthat Professor Pioli is critical in some respects of the\nRoman Catholic Church that when he was arrested\nand thrown into prison in 1939, after 4 months of\nsolitary contmement he was suddenly released from\nprison by the Fascists. It was long afterward that he\nlearned that his old classmate, the Pope of the Roman\nCatholic Church, had interceded on his behalf with\nthe Fascist dictator, Mussolini."
}