{
  "id": "d710-175",
  "text": "4.\nAt last report there were 109, more than a third of which were licensed since\n1950 and mostly to public school systems. A change in pattern is noticeable\nin these licenses, for the trend is toward cities of medium size and toward\nsmall communities where 10 watts of power adequately serves both a school\ncommunity and the host community. This encouraging growth and the special\nawareness of radio educators to the impact of television augur well for the\nuse of the television channels temporarily reserved for education by the\nFederal Communications Commission. Nevertheless much remains to be done to\ninterpret the function of radio and television as educational tools to\neducational administrators, to teachers, and to the community at large. These\npowerful and vivid media are two way transmitters: as originators of programs\nthey teach both students and1 the adult community, and by intelligent use of\ntape and disc recordings and films from many sources they extend their influence\neven more widely; by wise use of local resources and as transmitters of pro¬\ngrams from commercial stations, from other educational stations, from inter¬\nnational sources, they bring the world into the classrooms and the homes of the\nsmallest' communities. Learnings which are profitable in the classroom are\nshared immediately with any adult who cares to flick a switch.\nIdeally, educational radio and television should provide a broadcast service\nwhich\n(1) stimulates and enriches classroom instruction by developing new\ninsight, appreciation, and understanding through dramatizations,\nreadings, discussions, and lectures on the same subject of class¬\nroom instruction. (For example, a competent reading of Hamlet\nor a British Broadcasting Corporation production of it would do\nmore to explain the art of Shakespeare than any amount of classroom\nexplanation. Robert Frost or any competent poet or reader of poetry\ncould establish the meaning, significance, and value of poetry more\neasily than the classroom teacher and perhaps more effectively. The\nimmediacy of the communication from authority ...as from the President\n...the current leading atomic physicist...the foreign statesman...\nlends prestige*and value to a communication which may never achieve\nits function in print."
}