{
  "id": "d710-177",
  "text": "ADMINISTRATION\nEducational radio and television, as media of instruction, cut through all\ndepartments of instruction, seek to illuminate all fields of learning, and\nsince by their public nature they reach audiences additional to those of the\nclassroom they have the opportunity and responsibility to inform, educate, and\notherwise communicate with adult audiences. The philosophy and educational\nmerits of the school system are so clearly revealed in radio and television\nbroadcasts that the chief executive officer entrusted with the department of\nradio-television education should hold a rank coordinate with the chief\neducational officers immediately under the superintendent of schools so as to\nhave easy access to the superintendent and to be able to plan effectively\nwith other departments of instruction in making the most effective use of\nthese mass media. Heading the department and managing a radio and/or televi¬\nsion station is obviously a full time position. And in larger operations,\nimmediate station management might be delegated to a full time position. And\nin larger operations, immediate station management might be delegated to a\nfull time manager under the overall direction of the head of the radio-tele-\nvision department. School systems lacking their own radio-television facili¬\nties but using commercial facilities offer different problems, yet the volume\nof work involved and the public nature of that work justify a department of\nradio-television education under a full time head. As was pointed out under\nthe discussion of philosophy, radio and television belong together. Both are\nmass media sharing many of the same technical problems, subject to many of the\nsame rules and regulations of the Federal Communications Commission which\nlicenses both media, and requiring many of the same arts and skills in writ¬\ning and production.\nBroadly stated, the chief of radio-television broadcasting has the following\nresponsibilities:"
}