{
  "id": "d710-178",
  "text": "7\n1. He must formulate a basic educational philosophy in conjunction with\nthe chief school administrator. He must be aware not only of the\neducational goals of the system but keep abreast of changing educa¬\ntional patterns and find ways of using the media under his direction\nto achieve maximal educational benefits.\n2. The station manager must establish and maintain satisfactory relation¬\nships with all departments of instruction and with all groups of educa\ntional personnel to achieve curricular integration at the program\nplanning level and at utilization levels. He should therefore be rep¬\nresented on all major school committees having to do with educational\npolicies, planning, and curriculum.\n3. He must establish an adequate and properly trained staff, certified in\nteaching when the teaching function is paramount, or certified as\nengineers* or in their respective fields. Ideally, all radio-televi¬\nsion professional staff should be certified as teachers as well as in\nthe techniques peculiar to radio and/or television. If, in addition\nto adult staff, student staff is employed at the level of station\noperation as announcers, studio supervisors, librarians, console\noperators, tape and disc recorders, continuity writers, or any combina\ntion of these skills, the station manager must train them to the point\nof competence. If high school classes in radio writing and radio pro¬\nduction are established, the goals of education must be achieved not\nonly for these students but also for classroom listeners. The content\nprogram of study, and the use of student written scripts and student\nactors are decisions to be made by the chief of radio-television educa\ntion in cooperation with the chief school administrator. However\nvaluable the educative experience is for students participating in\nradio writing, production, and station operation, their use or non-use\nshould be based objectively upon the values to classroom listeners.\n(The question of “professional\" competence is bandied about in dis¬\ncussions concerning the use of students and the point is made that\nstudent actors must equal those of glossy network productions. The\nproponents of student actors argue that no network consistently pro¬\nduces radio or television series designed for classroom use, that few\nlocal stations do, and that the acting standards of those radio and\ntelevision productions regularly listened toby elementary school\nchildren can easily be achieved by high school student actors properly\ndirected. Dramatizations for high school listening are few— chiefly\nbecause scheduling is very difficult—and the situation rarely arises\nof non-acceptance of a student acted radio or television drama by a\nsecondary school audience familiar with the canons of good acting.)\nk. He must keep his facilities adequate to the work at the maintenance\nlevel and must expand to meet new needs and new developments.\n5* He must exercise imaginative and resourceful leadership in programming\nincluding selection, writing, production, and scheduling, keeping in\nmind the fact that the effect of education is greatest when it is\nachieved through an organized, integrated, and sequential experience."
}