{
  "id": "d710-184",
  "text": "13-\nMany stations have remote equipment in the form of portable recorders,\ndisc and tape. One station has ordered mobile relay equipment.\nStill others have booths and direct telephone lines to such places\nas the gymnasium, the athletic field, the band room, the auditorium,\nthe board room.\n6. Miscellaneous Equipment\nSeveral stations subscribe to a transcription service. Two stations\nsubscribe to a news service via teletype.\nC. Planning Reception Facilities\nThe acquisition of an adequate number of classroom radios is part of ade¬\nquate planning for school broadcasting. There has been no common procedure.\nObviously, however, there must be no difficulty encountered in obtaining a\nradio nor any difficulty in hearing the broadcast, else the classroom\nteacher cannot be expected to use radio as an educational tool. That means\nan adequate number of radios--ideally one for each classroom--of high\nquality.\nSome systems report purchases by the administration, but most report de¬\nvious ways of obtaining classroom sets. Schools use school funds raised\nby the student body, by mothers' club and parent-teacher activities, or\nreceive them as gifts. Logically it is the obligation of the school\nsystem which establishes a radio station to pay for the receivers to make\nthe broadcasts worthwhile.\nBut whatever the source of the funds for their purchase, they should be\napproved by the director of radio education as acceptable for classroom\nuse. Radio receivers must be capable of reproducing the quality inherent\nin FM broadcasting without distortion and in sufficient volume to be heard\nwithout effort in the classroom.\nCentralized sound systems, especially in large schools, are being used.\nIn general the individual classroom receiver is superior to a centralized\nsound system both for quality of reception and for ease in selecting the\nwanted materials of instruction. First of all, a central sound system uses\na wall type speaker with a limited audio range quite adequate for public\naddress and AM broadcasts, but not at all adequate in reproducing the FM\nfrequencies of sound. Unless a high fidelity speaker is used, the separate\nFM radio for each classroom is preferable. Then, too, problems of admini¬\nstration militate against the happy use of a central sound system. Arrange¬\nments must be made in advance with the central office to turn on the pro¬\ngram. If the central office fails to remember the broadcast there is a\nsense of frustration. One or two disappointments and interest in using\nradio as a classroom tool is dissipated.\nBecause high school schedules do not conform to the broadcast schedule,\nand vice versa, some schools record programs on tape recorders and broad¬\ncast them over the public address system or use them at the specific class\nlevel."
}