{
  "id": "d710-186",
  "text": "PROGRAMMING\n15.\nProgramming may be defined as the selection of programs to fill the broadcast\nday, week; and year of the educational radio or television station. Good\nprogramming; however, is more than filling the time slots in fifteen, thirty,\nor sixty minute segments. It is at the level of programming that the prac¬\ntical application of the philosophy, ideals, and high purposes of the educa¬\ntional station are revealed. Selection of suitable programs is not the rela¬\ntively passive shuffling of available materials to coincide with the class¬\nroom subjects and hours; rather, it is a matter of constant examination of\nthe expressed needs and wants and the unexpressed, unfelt needs or wants of\nthe educational system and then creating the program that satisfies those\nneeds or finding one from an outside source that satisfies those needs.\nAnswering the expressed needs is not especially easy, but genuine educational\nleadership is required to determine what unfelt needs exist and how best to\ndramatize them and satisfy them. For example, Professors Bloom and Smythe,\nconsultants at the Allerton Conference both discussed evidence indicating\nthat throughout the country \"authoritarian men\" are developing, men with a\nrigid pattern of personality revealing a tendency to think alike, a tremendous\nfear of the world and a desire to narrow its limits, a hostility to new ideas,\npersons, and minority groups which may be threatening, a desire to get closure\nunder all conditions, a desire for an authority to define the world rather\nthan self-realization, an avoidance of any challenge of ideas or the free\ninterplay of ideas, a fear of new learning situations, and a tendency to de¬\nmand answers from teachers by the lecture method rather than by independent\nsolution. An informed educational radio programmer would determine whether\nBen Bloom, Examiner's Office, U. of Chicago, and Dallas W. Smythe, Professor\nof Economics, U. of Illinois."
}