{
  "id": "d710-196",
  "text": "25-\nspecial knowledge, experience, background, and imagination to the creation of\nformats that will fully realize the revolutionary potentialities of television\nnot only as a new medium of mass communication but as a new and potent tool for\neducation. Recommendation: Successful educational formats developed through\nexperimentation and proved in practice should be filed with NAEB and JCET.\nWriting;\nWriting for educational radio and television must not only satisfy the stand¬\nards of good writing but it must also observe the standards of the media in¬\nvolved. First of all it must be based on a thorough understanding of sound\neducational theory and practice. But most important -- it must capture an\naudience and hold it and contribute its full share of those changes in the\nlisteners which are termed educational. This is a large order.\nSome school systems may find within their own ranks potential authors and\nwriters who will find radio and television writing an outlet. These are ideal\ndiscoveries because often within a single person all essentials are combined.\nOtherwise it is necessary for the educator to chart goals, outline teaching\nsteps, and to edit carefully any script produced by the writer, professional\nor otherwise, who is not a teacher. Other school systems may find teachers\nwithin their ranks who can be developed into good writers...dramatics, speech,\njournalism, and English are perhaps the most fruiful fields in which such\nteachers may be found. Successful teachers who use creative play techniques\nare also likely candidates. Radio and television writing is helped by a\ntouch of genius, but like most writing it is achieved by an understanding of\nthe desired goals, by a willingness to experiment and to revise, and by the\nexpenditure of considerable energy and imagination. The classroom teacher\nwith adequate study and training can contribute a great deal and can work very\neffectively into radio and television writing, for these media are largely\nmechanical extensions of the communicative arts already successfully employed\nin the classroom."
}