{
  "id": "d710-2",
  "text": "November 10, 1953\nMr © GeOTgo Frobst\nIn dll its thinking and in all the actions it has taken the Fund\nhas conceived of these two organizations as ccoqalimantary in the\nmost complete sense« The closeness of the working relationship\nthat the Fund has assumed would exist, is evidenced by the faot that\nthe sole Advisory Committee to the Center to date has been and is a\ncommittee of the MSB* There is the further consideration that one\nof the Bombers of the MSB Advisory Ccnsnittee is also a member of\nthe Board of the Center.\nIn giving support to both organizations, the HAEB and the Center,\nthe Fund has been completely convinced that each had a monumental\ntask in discharging its own special responsibilities toward the\ndevelopment of educational television and radio «® the one through\ndetermining and fostering thoroughly professional standards in all\nphases of educational broadcasting (and telecasting), and the otior\nthrough providing in the field of education the functional equivalent\nof a programing \"network\"* Clearly', both types of activity require\nfinancing and equally clearly the health of both organizations\nrequires that financing be from a variety of sources* Fund raising\nwill need to be a featured activity —• especially in the case of\nthe Center which obviously has to aim at very substantial sums if\neducational broadcasting in the United States is really to come into\nits own, and if it is to graduate from the meager and ineffective\nscale of activity that has characterized educational, radio during\nthe years of its existence *\nIn short, from the Fund5 s point of view, these two organizations\nwhich it is helping to support in the mass media field both have\nimportant and clearly distinct fund raising responsibilities * It\nwould be unwise and shortsighted in the extreme for either to make\nany effort toward preenpting the field of the other. What is called\nfor, then, is full assurance that no steps will be taken by either\nMSB or the Center in this extremely crucial area of fund raising\nwithout mutual consultation and clearance as between the two\norganizations. ¥e in the Fund are entirely confident that given such\nan arrangement there can be full and cacqslat© understanding at al\ntimes as to the fund raising activities for both organisations.\nI know that you fully share our feeling that the potential of tla\nmass media in education is too great to permit of any approaches that\nwould run the risk of weakening the common effort. Accordingly, what®\never specific decisions may be reached in individual instances il\nseems dear that the basic principle all of us have to adhere to is\nthat of joint consultation and joint effort in behalf of common vims.\nSincerely,\ngo\nCopy made, HAEB Headquarters,\nNovember 16, 1953®\nC. Scott Fletcher"
}