{
  "id": "d710-205",
  "text": "SCRIPT\nOne of the problems facing educational broadcasting is the preparation of\nworthy scripts for programs designed to achieve the objectives of education\nin elementary and secondary schools. Since the planning, research and writing\nof scripts demands many work hours and since so many have common educational\nobjectives, some definite plans should be formulated to exchange materials,\npublicize script sources, encourage participation in script contests that\nresult in publication of scripts in the public domain, and set up plans to\nencourage organizations to use funds for preparation of scripts in designated\nareas.\nThe warm response of broadcasters to the NAEB tape service demonstrates the\nvalue of co-operative effort on the part of educational broadcasters.\nIn view of the great need in this area it is suggested that:\n1. NAEB publish a list of all available sources of scripts that are not\nrestricted in use. This should include organizations such as the Office\nof Education, Public Service Agencies and books and magazines contain¬\ning non-royalty scripts. Sources for scripts useful for study purposes\nshould be listed separately.\n2. Educational Broadcasters encourage participation in writing projects\nsuch as Scholastic Awards, Payne Awards, AER Script Contest and simi¬\nlar projects that are the sources of non-royalty scripts.\n3. Individual members of the NAEB assume the responsibility of sending to\na designated center samples of what they consider good examples of\ndiscussion, interview, quiz and dramatic scripts for radio and/or T.V.\nto serve as standards for presentation of these types of broadcasts.\nIt is suggested that these scripts be stenographic transcriptions of\nbroadcasts.\n4. NAEB set up an Advisory Study Committee which shall have the responsi¬\nbility of collecting, screening and selecting scripts suitable for use\nby many educational stations. The committee shall suggest plans for\ndistribution of copies of scripts to NAEB members.\n5* NAEB be encouraged to set up plans for the development of documentary\nscripts that would be of vital use to educational broadcasters for"
}