{
  "id": "d710-225",
  "text": "In New York the Report of the Governor!s Commission has made things look dis¬\ncouraging on the surface and has undoubtedly had ill effects elsewhere, but New\nYork will go ahead with private funds and at least the report of the Commission\nand the accompanying minority reports have served the purpose of pulling the\nnewspapers behind educational television.\nEducators are now getting rolling all over the United States. For a while\neducational television was held up because educators kept the problem in the\nfamily. They held one meeting after another, but among themselves. The prob¬\nlem is now out in the open before the public, and public support has been good.\nEducation's constituency is more imaginative than we had thought.\nIn Alabama, the present plan is for the state to undertake one-half of the cost\nand the Commission to undertake the other half of the cost for two stations and\nfor the State Production Center which is to be created. Plans are to request\n$300,000 to $400,000 this year. But the problem is not costs, it is a problem\nof intelligence and the imagination with which we approach the problem. We\nhave to get everyone behind it, and the future of educational television de¬\npends not on the cost, but on the degree to which those stations which will be\non the air can develop public enthusiasm for educational television. At the\npresent time, one of the most remarkable phenomena of the whole effort is the\nspeed with which skeptics become enthusiasts.\nThere are two questions now which everyone would like to know the answers to;\nHowr many stations will be on the air? Will the FCC reserve the other channels?\nWe do. not know the answers to these questions except in these general terms: by\nJune 2 there will be enough stations so that education will have demonstrated\nits interest and intent in regard to this tremendous opportunity, and we are\nconfident that others will then get on the bandwagon.\n********'****\nMr. Ausmus, as dicussion leader, with a panel consisting of Seymour Siegel,\nFrank Schooley, and Jim Miles, then conducted the discussion: \"Closer Home.\"\nA question was asked about experience in planning multiple operations- whether\nthere was difficulty in religious and educational groups working together. Ik*.\nSiegel pointed out that educational stations must operate in the public interest,\nthat the democratic process will assure that they operate in the public interest\nor people will pull out, that this is not a problem about which we have to wor¬\nry now. The wonderful thing about educational television is how, at its very\nbirth, seven national organizations sat down together to solve the problems;\nthere is cooperation. In radio practically no one cared. The American Council\non Education feels thattelevision and the top administration in television are\ngoing to form the core of university planning for our children's children.\nThe question was asked if there was no legal way for public and parochial schools\nto get together. The answer was that the public schools may be the licensee,\nand the parochial schools may use the time.\nThe question was then asked about the separation of Church and State and the use\nof public funds. The reply was that in the Detroit plan a subscription ap¬\nproach will include all. In Los Angeles the Board of Control will be too large\nfor any single organization to control, and the problem will be handled in that\nway.\nHhenris the proper time to ask for television consultants? Any time you get"
}