{
  "id": "d710-226",
  "text": "- 9 -\ntwo or more people together, just write and ask. Of course you may be beyond\nneeding consultants. In many places local groups have gone so far on their own\nthat there is little the national organizations can do to help them. After a\ncertain point, it must be your baby.\nThe issue was then raised as to whether or not certain of the assisting organi¬\nzations were not overwhelming NAEB’S \"grass roots.\" Has NCCET really done what\nit was set up to do? In one locality it has promised to use its influence, but\nso far nothing has been done. It has sent down a handsome brochure, \"Greatest\nInvention Since Printing,\" but the brochure states that educational television\nwill cost $500,000 for the first year’s operation. This statement is enough\nto kill 200 potential applications by itself. Contact with NCCET on this point\nproduced only the answer that New York State had been embarrassed by under¬\nestimating costs. Finally, when a consultant came down, his attitude was \"Cost\ndoesn’t enter into this - you can sell it no matter what the cost.\" There is\na real danger that these self-constituted groups are going to \"love us to\ndeath\" unless they listen to us in the \"grass roots.\"\nMr. Ausnrus said he would convey to NCCET these three major suggestions: (l)\nthat it maintain closer liaison with local groups, (2) that it not distribute\nliterature without permission, and (3) that when it agrees to do something, it\ncarry out its pledge. It was further pointed out that consultants coming from\nthe national organizations to local communities must know educational philo¬\nsophy and processes else they will embarrass the cause of educational television.\nThe discussion turned to costs, and it was pointed out that on Channel 15, for\nexample, one could go on the air for $75>000 to $80,000 minimum, with a pro¬\njector and film operation, no cameras. However, the objection was raised that\nit is possible to sell in reverse and that when educational TV goes on the air\nit must be good in order to gain continued support. Of course commercial\nbroadcasters, to judge from reports of applications in Broadcasting, are going\nto go into television at all kinds of different investment levels.\nThe preliminary report on New Jersey’s plans was read. It was pointed out that\nboth Allen DuMont and Engstrom of RCA were members of the Commission drawing up\nthe report, and so the cost factor was likely to be accurate. They planned to\nspend $340,000 for technical equipment: Of this, $162,000 will be transmitter\nequipment, $165,000 studio equipment, and $31,000 video recorder. Annual oper¬\nating expense has been estimated at $190,000.\nFollowing this, the discussion turned from cost to purpose. One of the con¬\nsultants said that we must remember that we are educators; we need to be al\\/ays\nconscious of the philosophy of education in relation to mass communication. We\nneed to be ever critical of such advertising as tries to assume the responsibili¬\nty for education.\nA delegate rose apologetically, saying that he felt like a man approaching the\nAtomic Energy Commissiion to ask how he could get the best use out of his bow\nand arrow. His problems were: He has been on the air nine weeks with a staff\nof one and a budget of $800 a year. How does one get money? How does one get\nsupport and reach out to other people? A number of suggestions were offered:\nthat he bring the president or school superintendent into active participation;\nthat over a period of time he get every department involved; get the students\ninvolved; be helpful in the way of programming to the local stations other than\nhis own. The more participation - the more success, was the keynote of the\nreply. Particularly it was suggested that one get the participation of powerful"
}