{
  "id": "d710-228",
  "text": "- 11 -\nMr. Kay Kyser made the principal address: ,rA Pro Looks at Educational Televi¬\nsion.” He spoke with humor, wit, and deep sincerity to the group, relating\nfirst his own experiences with educational television.\nHe had gotten into the educational television picture when Mr. Gray called and\nasked if he would care to assist the University with some of its projects. His\nfirst educational TV experience was at the Penn State conference which he at¬\ntended with Mr. Gray. He went with misgivings; he felt, frankly, as a profes¬\nsional that he was f,going slumming” among all of these innocents who knew\nnothing of show business but were out ”bear hunting with cap pistols.” But\nthat conference was an awakening. He found that the educators had come to say\nthat they didn’t know about this medium, but that they had missed out on educa¬\ntional opportunities of radio and motion pictures and they were not going to\nmiss out on this opportunity if television could be used for educational pur¬\nposes. They were there honestly to learn. One of the most astounding facts\nwhich was brought to his attention at that conference was, that in the city of\nChicago, because of juvenile vandalism, the cost of window breakage in the\nschools was 1300,000 per year. A'his opened one’s eyes to cost factors in ed¬\nucation and to the possibility that education might actually cost less in the\nlong run if one could cut down on such things as juvenile vandalism. He began\nto see that educational television might take the world into the schoolroom,\nthat children with otherwise very limited opportunities might, through tele¬\nvision, see and hear and learn things that had theretofore been shut off from\nthem. Ho learned people were taking courses by television from Western Re¬\nserve University, getting up to 17 and 18 hours course credit toward a college\ndegree in Beginning Psychology the same course as given in Western Reserve\nclassrooms. There was an audience of 50,000 people from 9:00 to 9:30 each\nmorning for this show. True, this program was on a commercial station, but\neducators must take into account the possibility that commercial telecasters\nwill not always be able to give them the time. He saw such kines as Iowa\nState’s ”The Whole Town’s Talking” - entertaining, enlightening, and skillful¬\nly done, and, more important, a program with an effect on the life of the\nstate. As a result of this program, many things got done in Iowa.\nHe saw that educational television could create something for a minority aud¬\nience, that it could present the whole gamut of education. His horizons were\nwidened, and unlimited possibilities of which he had never dreamed before now\ncame into view.\nHowever, he went on to say, educators are going to have to remember that tele¬\nvision is merely a mechanical channel through which we can think and act.\nSuccess lies within our capacity, but we will never be better than our willing¬\nness to obey all the rules of showmanship required to make the medium effective.\nReferring to his own experience, Mr. Kyser said that whenever he had been suc¬\ncessful it had been on the occasions when he had used everything he had. If a\nman finishes a show and comes off stage saying,”Gee,what a sorry audience,” he\nis blaming the audience for his own ineffectiveness. He has not done a good\njob. ’’Effect has never controlled cause and never will.\" Ano this is true\nnot only of professional show business, but it is going to be equally true of\n’academic show business.’ At whatever audience level any given show is pro¬\ngrammed, we must aim for and hit the bull’s eye with that specific audience.\nWe cannot shut our eyes and shoot. It will be hard, too, in television because\nit is always hard when you are not rubbing shoulders with the audience. It is\nhard with movies to know how well you are doing. Having done that, too, this\ncould be said out of experience. Of course you can always go to see your mov¬\nies, but this can be too hard. When the audience is not out there in immediate"
}