{
  "id": "d710-235",
  "text": "-18-\nwhich are repeated several times and carries, in addition, 16 NAEB adult shows\nfor a total of 10 hours of programming a week. They also carry a number of\ntranscribed shows. Staff is as follows: Mr. Lent has a third class ticket;\nthere is a student with a third class ticket. It is difficult to get student\ninterest because there is a carrier current station on campus which operates\nwith no faculty supervision; the students have 1 carte blanche1 in programming\nand operation. Since last June, WUSC has been putting one program, HIE UNIVER*\nSITY FORUM, on a commercial station. In April they plan to go on commercial\ntelevision. The Junior League has kept radio alive in the schools in this com¬\nmunity. They have found an * angel’ to pay for program rentals and persuaded\nstations to donate time. A regular report form is in use among the schools and\nprepared manuals are available to teachers for NAEB shows. There are still\nserious difficulties in lack of receivers and usage of equipment.\nTelevision\nNot very much progress has been made with the 4 allocations for South Carolina.\nAlthough the Superintendent of Public Instruction has expressed interest, he\nfeels reluctant to approach the governor. A meeting has been called for the\nColumbia area on March 16 and 600 to 700 invitations have been sent out to per¬\nsons within a 60-mile radius of Columbia, an area including 900,000 persons—\n250,000 of them children. At this meeting an effort is going to be made to\narouse some real interest. The state has had an ^18,000,000 surplus, but the\ngovernor has already allocated these funds. It is not considered practicable\nto approach the present Assembly. The folks in Charleston have worked hard\nbecause the Charleston allocation is the most vulnerable one. It is too early\nto say whether they will be successful or not. It is hoped that the Columbia\ngroup will manage to arouse public support for a station in that area. No action\nis expected with the other two allocations.\nVIRGINA: Carroll B. Lusk, Virginia Museum of Fine Arts\nRadio\nThere are no educational stations in Virginia. The University of Virginia\noperates a carrier current station 18 hours a day. This is claimed to be the\nworld’s largest carrier current station, (Alabama: please note). The station\nhas a yearly staff of one hundred. Five courses in Radio are offered by the\nDepartment of Speech. New quarters for radio and recording and speech opened\nin January, 1953. Thu department now has three programs a week on commercial\nstations, three more planned, and has also planned a tape network.\nIn Arlington the school system has programs three times a week on commercial\nstations. The main object of these is pupil participation. They have been\nemphasizing the use of handicapped students as a remedial procedure and have\nhad remarkable success with students experiencing speech, hearing, and reading\ndifficulties, and also with mentally retarded students.\nTelevision\nThere is an educational television allocation to Charlottesville, but the\nUniversity of Virginia has no funds for such work, and as far as is now known,\nhas no plans. The Arlington school system put 6g- hours of television programs\non commercial stations last year and is this year producing a series on alter¬\nnate Saturdays. A series on school work has been planned for the spring. WNAL\nhas, however, reneged on the proffered time for this series. (All educational\nbroadcasters, please note). Arlington will offer the series to another station.\nThey have a high-powered Speech Advisory Council including persons from commer¬\ncial stations and Frank Durham of the U.S. Department of Education. The Council\nconsists of 15 persons who meet 6 times a year. They have found their public re¬\nlations program very helpful in the development of radio-television."
}