{
  "id": "d710-249",
  "text": "-5-\n\"GQAiLS And Accomplishments of NAEB\"'\nFrank Schooley, Executive Director and Treasurer\nSchooley began with a dissertation on the troubles beholden upon the job of\nExecutive director of NAEB. He then went on to report certain accomplishments.\nNAEB has been successful in helping outstanding persons obtain fellowships and\ninterneships in the radio and TV field. A committee which included Miles, S\nSchooley, and Coleman made recommendations to the State Department for the ex¬\nchange of three men with France, England, and Italy. There is a further aim\nof establishing fellowships (for Master aftd Doctoral condidates) for advanced\nstudy.\nNewsletter: The aim here is to increase the overall quality of the publication.\nThat depends in large measure on the material submitted by the members. Head¬\nquarters is also viewing the possibility of establishing a more professional type\nhournal: one which will serve the needs of a large audience in the field. While\nsuch a publication is not yet in the works, the need and the possibility has\nbeen recognized.\nQUESTION: Why are you having so much difficulty with \"tape-nappers\"?\nANSWER: Probably a combination of many reasons: slowness in getting the tapes\nback into the mail, delays in programming, etc. The strongest reason, I sus¬\npect, is that stations are not keeping adequate records of the tapes they have\nreceived and returned. We are working out a new form which will help simplify\nkeeping track of tapes. NAEB now has some 7,000 tapes. We need every one of\nthese and more. A delay becomes a mighty serious thing. (Schooley)\nQUESTION: Do you have any information to show that the stations to which tapes\nare sent are actually using the shows?\nANSWER: That doesn't seem to be the problem.\n###########\n\"NAEB RESEARCH\"\nRobert Coleman, Research Committee Chairman\nMost NAEB research thus far has been done with outside funds. Determined to\nprovide information of practical value to members. Members of Research Commit¬\ntee: Dallas W. Smythe, H. H. Remmers, Purdue; Larry Myers, WAER, Syracuse;\nMerritt Ludwig, W0I-TV; Kenneth Harwood, University of Alabama; and Robert\nColeman, WKAR, Michigan State College.\nVarious ways in which committee can be of service include:\n1) Cooperate in national studies.\n2) Assist local stations which do not have research facilities.\n3) Initiate studies on local level and build into national project.\n4) Make technical information available to members.\n5) Act as clearing house for competent studies by members.\n######## it it #"
}