{
  "id": "d710-256",
  "text": "feature article on FM. Abbot himself contacted some 45 radio manufacturers and\ndrew up what is probably the only existing comprehensive list of the types of FM\nsets available to the public* According to one Detroit distributor the sale of\nFM receivers increased over 90% during May.\n# # # £ £ ######\nCOMMENT: I think dealers are the key people in any such promotion. They are\nthe ones who place the sets—AM or FM—in the hands of the public, and they are\nthe ones who need constant follow-up (Engel)\nCOMMENT: Good results in Toledo (also tied up with the SE Michigan campaign).\nEstimate 50,000 FM sets in Toledo. (Lamb)\n###########\n\"General Session\"\n23 May — 2 p.m.\nThe general session was arranged to study the comments, questions and suggesticns\narrived at by the individual state sessions in their morning meetings. Sitting\non the \"panel of experts\" were: Burton Paulu, Robert Coleman, Frank Schooley,\nand Jim Miles• The questions, for the most part, were directed at the panel-eers.\nQUESTION: With the mass duplicator at NAEB Headquarters, can you somehow arrange\nto avoid the long, dead intro? (Ed. note: The duplicator makes dubs \"from back\nto front\" to avoid extra handling. On a short program, this results in a long\nlead of blank tape.)\nANSWER: Unavoidable. Suggest you use fast-forward to find the opening of the\nprogram. But by all means, avoid snipping off the lead.’\nQUESTION: How about an NAEB brochure on \"How to Splice Tape?\" A lot of bad\npractices are being used which result in sticky tape, poor joints, etc.\nANSWER: Adequate information on tape splicing on every box of tape. If you\nwon't read that, you won't read a brochure.\nQUESTION: About how much is an electronic splicer?\nANSWER: Presto-Seal is around <j>60.\nQUESTION: Can a wired-wireless pick up, say, the WU0M signal and rebroadcast it?\nANSWER: Sure. But only if you have the permission of the station.\nQUESTION: Legally speaking, is a wired wireless broadcast considered to be a\n\"public performance\"?\nANSWER: Yes.\nCOMMENT: The Ohio delegates f eel that NAEB should increase its interest and ser¬\nvices to the wired-wireless stations. You stand your best chance of recruiting\nnew \"active\" members from this group if you can help them gain the required stat¬\nus in their institutions.\nANSWER: There are approximately 250 wired-wireless stations in the nation. Com¬\npare this with the about 81 education stations. It would require an aLmost pro¬\nhibitive amount of effort to serve that group.\nQUESTION: What can combined Michigan s tations do to help themselves?\nANSWER: Produce special programs which are suitable for regional broadcast, and\nthen establish a central distribution point for these regional programs. However,\nit is questionable whether the \"state\" is a proper sort of boundary. Region III"
}