{
  "id": "d710-45",
  "text": "serious waste of a major national resource. In ad¬\ndition to these uses, radio broadcasting is capable\nof being an important instrument in the dissemina-\n'*>n of information, opinion, discussion, and inter¬\npretation essential to the solving of today’s complex\nproblems. Radio can also provide, and on a vast\nscale, meaningful cultural experiences. To this kind\nof radio broadcasting, the NAEB is dedicated.\nHOW DOES THE NETWORK OPERATE?\nTo date, programs used have been produced by\nmember stations, the British Broadcasting Corpora¬\ntion, the Canadian Broadcasting Corporation, the\nCooper Union, the Twentieth Century Fund, the\nLowell Institute, the Rocky Mountain Radio Council,\ncommercial stations and networks, university spon¬\nsored conferences and symposia, and various public\nservice institutions. The programs are selected by\na program committee composed of representatives\nof member stations in various parts of the country.\nThe programs are assembled at network head¬\nquarters, where they are checked, edited, and\nmade ready for duplication. Twelve copies are then\nmade of each program. As the name implies, the\nentire operation is carried on through the magic of\nmagnetic tape. The copies are “bicycled” around\ntwelve geographical “legs,” each made up of five\nor six stations. Early in 195 2, the network will\nhave a duplicating machine capable of reproducing\nten copies of a program per run-through, and at\nfast speed. This mass duplication will permit the\ndiscontinuing of the time-consuming bicycling tech¬\nnique. A copy of each program will be made for\nevery station, permitting a vastly expanded and\ncelerated operation.\nBefore the processing of the tapes begins, the\nstations are advised of what will be available and\nare supplied with complete information about the\nprograms. A tentative schedule is suggested, and\nit is modified into the final broadcast schedule on\nthe basis of acceptance by the stations. The indi¬\nvidual stations are free to accept or reject pro¬\ngrams on whatever basis they choose. There is no\noption time and no restriction or pressure on the\nstations in the use of available programs. On this\npurely voluntary basis, acceptance and use of net¬\nwork programs reaches a significant figure. Apart\nfrom specialized series designed for a certain seg-"
}