{
  "id": "d710-46",
  "text": "ment of member stations, and offered on a limited\nbasis, upwards of 90% of the stations use any\ngiven series of programs. This is indeed remarkable\nconsidering that educational stations are rather\nseverely limited in air time, and the inclusion ofw\nan hour-long program in the schedule is a major\ntask.\nThe tape network is governed by its member\nstations, since it is responsible to the board of\ndirectors of the NAEB, which is elected annually by\nrepresentatives of the stations.\nWHO PAYS FOR THIS NETWORK SERVICE?\nWhen the network was launched it was antici¬\npated that it would be mutually supported by the\nmember stations. While this is a sound and inde¬\npendent plan, it quickly became apparent that some\noutside help would be needed during the formative\nperiod. In June, 1951, it was announced that the\nW. K. Kellogg Foundation, of Battle Creek, Michi¬\ngan, had made a generous grant to the NAEB for\nthe general purpose of stimulating, expanding and\nimproving educational broadcasting. Included in\nthe grant were funds to assist in the establishing\nof an educational network. Funds for the first year\nprovided the necessary equipment to operate such\nan enterprise, and an adequate operating budget.\nIn the three succeeding years a diminishing propor¬\ntion of the annual operating budget is provided.\nDuring this period the member stations assume an\nincreasing share of this cost. Beginning with the\nfifth year, the membership undertakes full financial\nresponsibility.\nFrom estimates possible at this time, it seems^,\ncertain that member stations will be able to obtain\ntop-quality programs at a per-program-hour cost\nsignificantly lower than for any other acceptable\nprogramming. They will receive outstanding\nprograms which would be unobtainable on an\nindividual station basis. By incorporating the ready¬\nmade network offerings into their program sched¬\nules, the individual stations can devote a greater\namount of their precious time and money to their\nown productions. The net result will be a major\nimprovement in the scope, variety, and quality of\neducational programs."
}