{
  "id": "d710-56",
  "text": "ALLERTON HOUSE\n239\nfrom deep in his subconscious—the truth that educational radio\nnot only has a job to do, but it is capable of doing it. The sheer\nrelief in getting at this matter was electrifying; the wall of repres¬\nsion, buttressed by years of rationalizations and expediencies,\ncame tumbling down and educational radio, for the first time in\nits turbulent history, was on the move.\nThroughout the days which followed, a practical, forward-\nlooking operational pattern took form, but not before the group\npainstakingly reviewed and restated the nature and the goals of\neducational broadcasting.\nThe Allerton seminar asserted that the aims of educational\nbroadcasting are the broad aims of education; that education in a\ndemocracy has the responsibility of lifting the level of under¬\nstanding and appreciation of the people, of giving the individual\na knowledge of himself and his society and of the sources of ten¬\nsions and perplexities in each; that in a free society it is essential\nthat the individual have a continuing sense of belonging and\nparticipating, of keeping up with a complex and fast-moving\nworld; that it is the responsibility of education to foster and\nfurther that feeling of belonging and counting.\nThe seminar pointed out that educational broadcasting has\nbeen most clearly distinguished by its high concern for integrity\nin the selection and handling of materials, and by its consistent\ndedication to social purpose. This purposeful activity has taken\nseveral forms, among which are: (1) informing, (2) stimulating the\nindividual to organize and give meaning to information, (3) con¬\ntributing to the understandings that make for better human rela¬\ntions and adjustment, (4) broadening participation in the culture\nof our society, (5) acting as an outlet for the varied expressions of\nthe community which the station serves, and acting as a force\nwithin the community to help it solve its problems, and (6) lead¬\ning the way, by experiment, toward new forms and activities of\nbroadcasting. On this latter point the seminar gave appropriate\nemphasis to the truism that people cannot come to like what they"
}