{
  "id": "d710-61",
  "text": "244 HOLLYWOOD QUARTERLY\nMr. Siegel and his staff inaugurated the “bicycle network” in the\nfall of 1949. Its operation involved the routing of tape recordings\nof high-quality educational programs from station to station\naround the country. This practical demonstration of self-help\ncaught on quickly, and within the short space of one year the\n“bicycle network” is providing four hours of programs per week\nto twenty-eight educational stations from Boston to Los Angeles,\nand from Minneapolis to Baton Rouge.\nIn view of the encouraging and dynamic results of the first\nAllerton House seminar, its sponsor, the Division of Communica¬\ntions of the University of Illinois, proposed a second one. Again\nthe Humanities Division of the Rockefeller Foundation agreed\nto underwrite the out-of-pocket expenses of participants and\nvisiting staff. The National Association of Educational Broad¬\ncasters gave its enthusiastic endorsement to the proposal. Where\nthe first seminar was chiefly concerned with policy—what is the\njob of educational broadcasting?—clearly the 1950 Allerton\nHouse seminar should address itself to program content—what\nto say, and how to say it effectively.\nIt is worth noting in this connection that the end product of\nradio—the program—is the area most neglected by broadcasters.\nThere are literally no meetings of broadcasters in America where\nprograms are the central concern. Attention to them is confined\nto gross audience pull as it is reflected in ratings. Program content\nis examined only as a likely culprit in instances of low circulation.\nSuch other attention as programs may get is likely to be centered\non production techniques and the peculiar disciplines of the\nmedium, rather than on program content and meaningful com¬\nmunication.\nThe planners of the second Allerton House seminar turned\ntheir backs firmly on the studio-technique emphasis in produc¬\ntion, important though it is, and resolved that the seminar should\nconcern itself with “idea production,” or idea communication\nthrough the medium of radio. This time the seminar would be"
}