{
  "id": "d710-62",
  "text": "ALLERTON HOUSE\n245\ncomposed not of educational station executives as in the first in¬\nstance, but of program and production directors—the young men\nand women in educational stations who have the privilege and the\nresponsibility of building programs from their very inception,\ntaking them through their several stages of development and,\nfinally, through the actual air performance. These are the key\npeople in radio programming, and the 1950 seminar was con¬\nceived and organized on a basis calculated to help them take a\nfresh look at education’s resources, at the programmer’s problem\nof drawing significance from these resources, and at ways and\nmeans of effectively communicating that significance.\nIn lifting program people, for a fortnight, out of their day-\nby-day routine of broadcasting for the purpose of helping them in\ntesting and resetting their sights, the obvious and most promising\nmethod was to bring them into contact with fine minds, each of\nwhich was a specialist in a field educationally and socially im¬\nportant. Following this plan, guests of the 1950 Allerton House\nseminar, for a day or two each, included Allan Nevins in history,\nRobert Redfield in the social sciences, Kenneth Hudson in the\nfine arts, Wilbur Schramm in communications effects, Walter\nAgard in literature, Richard McKeon in philosophy, Dr. A. C. Ivy\nin medical sciences, Clifton Utley and Phillips Talbot in public\naffairs, Le Cronbach in educational psychology, O. H. Mowrer\nin mental hygiene, and David Randolph in music. Fred S. Siebert\nand Charles Sandage joined up for special sessions, respectively, on\ngovernment regulations as they affect programs and on audience\nresearch.\nThese men gave active leadership as the seminar explored sub¬\nject areas which, heretofore, have remained largely unworked by\nbroadcasters, and other areas not unfamiliar to radio listeners but\nin which the broadcasts have been conceived narrowly. The ses¬\nsions alternately took on the characteristics of a master-student\nrelationship and the pointed interrogations of a closed-circuit\n“Meet the Press.” Members of the seminar were hard taskmasters"
}