{
  "id": "d710-66",
  "text": "ALLERTON HOUSE\n247\ndirected, and incoherent. Radio should give to the study of litera¬\nture a more integrated continuity and should evoke in the listener\na sense of growth and achievement.\nThe seminar recognized three basic approaches to the presenta¬\ntion of literature on the air. One may present the literary work\nitself, either in its original form or through adaptation or con¬\ndensation. One may review the work, revealing what may be\nfound in the work. Or one may interpret, analyze, or criticize,\npresenting material which illuminates the work, evaluates it, or\nreveals its significance. Sometimes two or more of these methods\nmay be combined. Professor Agard argued that there is danger of\nlosing sight of the purpose when combining criticism with the\nwork itself on the same program. Presenting the work directly and\nwithout comment is effective in itself. Literature can stand on its\nown feet. It is provocative, and listening to it is an active process\nwhich results in a degree of learning at the listener’s level of\nunderstanding. Radio assists this process through its faculty of\nspeaking to the listener directly and personally. It relieves the\nlistener of the responsibility of the mechanics of the reading\nprocess, permitting greater participation.\nCriteria for selecting the form for presenting literary works by\nradio were observed by the seminar to include: (1) the validity\nof the form in which the author has chosen to cast his work,\nwhether novel, play, short story, poem, or essay; (2) the appropri¬\nateness of the form to the purpose of the program; (3) the suit¬\nability of the form to the medium of radio, and (4) the consistency\nof the form with the resources of the broadcaster. In the light of\nthese considerations, a play might be read by a single voice, a story\ndramatized, an essay rewritten as a panel discussion or a dialogue.\nHowever, a broadcaster may well consider the validity of the\nauthor’s choice of form the most compelling factor.\nThe seminar felt strongly on the point that purposive organiza¬\ntion of literary works and analytical comment into an integrated\n“course” or series of programs makes possible a greater sense of"
}