{
  "id": "d710-8",
  "text": "4.\nyear grant, of a quarter of a alllioa doUars, sad®\nVP of a national haadqasstos far tea HAE8. These ]\nlocated in Gregory Hell on tho essuus of the iMwm\n3» tho W. K, Kellogg Foundation, in a most ganarous five*\nporated© the sotting\nhs^deruartafire sse\no£ Stootoa t-M&h\n_ teHogg Foundation to edatei^ttesa funds lad\nprcnite the aaoounbing reraised. Boused at these headquarters are tho\nos^aral rerasto of tho MBS, «h» tope tejOteatcr teteh oakra possible the\ndVpUaatloa of sons 1,200 tapes maHy to serve HAEB Mfce* stations ia\nradio, suit both the safest hsadgoortora and mtomk staffs, ©assisting of\nthe fteMutiveiWreetor. Headquarters Secretary, the tape natws* Bireetcr,\nthe tape network Traffic Manager, end four other staff r *-\neffcrte are devoted to explicating,\nrecorda for the tape netMoeSc* The\nnerve imtar of the HA® is\nsente; of America.\ngpyj a&lgtqQinp# $£\nis published hew, sad the\nrand in this population\n„ . The Fuad for Adult Education, hspreessd hy the Obvious\nideals and abilities of the ffiffi3, has also contributed gensrously at\nravraal levels. Their original ©rant of 1430,000 mute possible the so-\nwiled \"Blr: San;11 settee, referred to earltert\nThe Jafforcatslaa IJeritago\nThe Wws of Mankind\nThe Votees of Europe\nPeople teter Ccmmiaa\nbrochures on aU of which are attached.\nThe odatoiBtrattea of these tends was handled by Mr. Ralph\n^ Lowell, aad production mbs omtracted f or the Lowell Institute of\nBoston, which has also provided generous support to HABS objectives,\nparticularly in its local situation, as the toodc Foundation tea daw\nin tho loo Angeles area. This fuad (tee FAB) has also sate possible tee\nholding of numerous workshops, seminars, and other training sessions,\nrefused to earlier, pins numerous study fellowship® for personnel who\nare to be responsible for tee many aspects of eduoational and eosmunity\ntatevislcn station oparattens. Finally, during the lest two yean, tee\nFund for Adult Education tee provided funds for ©rantswliwjia teieh have\nmate poeatefo a beginning of tee stimulation of local promotion of high\nquality. A sample of the loot anaounegaanfe for /yante-li*«Ad Is attached\nas Esfcibit F.\n5. Otters. Numerous other organisations have provided\ngsnaroue rapport to tee HAEB during tee past few years. The Hew Xca-k\nHerald Tribune has aborted tee distribution of its fawn prcgrauB, and\ntee repeatedly recognised tee value and uniqueness of the SMB's coverage.\nOther aeries have been mate poesUOe hy the generous rapport of Faerie\nGuggenheim (in music} and otters. The growing understanding and support\nof tee HAS by both jwblle-vsplaited foundations and organizations around"
}