{
  "id": "d710-82",
  "text": "-2-\nWGBH, Lowell Institute Cooperative Broadcasting Council, Boston, won a first\naward for the series \"Tomorrow’s Symphony” for, \"providing an unusual program\nservice\" and for filling \"the need of the listener for better enjoyment and\nunderstanding of the Boston Symphony Orchestra concerts broadcast over WGBH...\"\nFirst awards were also won by KUOM, University of Minnesota, Minneapolis, for\n\"Old Tales and New\"; WHA, University of Wisconsin, Madison, for the series\n\"Radio Almanac\"; WUOM, University of Michigan, Ann Arbor, for the series\n\"Radio Guild Laboratory Theatre\"; the University of Texas, Austin, for \"Polio\nPrimer\"; and KUSD, University of South Dakota, Vermillion, for \"Fun with Speech.\"\nHonorable mentions were earned by Western Reserve University, Cleveland, for\n\"Issues on Trial\"; WGBH, for \"News Report by Louis M. Lyons\"; WNYE, for \"Louis\nBraille\" and \"Say it in Spanish\"; WUOM for \"A Name to Remember\"; WNYC, Munici¬\npal Broadcasting Station, New York, for \"Campus Press Conference\" and \"Youth\nTalks it Over\"; KUSD for \"Candy Cane Lane\"; and WFIU, Indiana University, Bloom¬\nington, for \"Voice of the Campus.\"\nThe two special citations were earned by WILL, University of Illinois, Urbana,\nfor \"News Analyses by Quincy Howe\" and WNYC for its \"13th Annual American Music\nFestival.\"\n##########\nCALENDAR OF EVENTS\nMay 8-10 Education Writers Institute, New York City\nMay 22-24\nJune 22\nJune 29\nJuly 13\nNAEB Region II Conference at Ann Arbor\nNorthwest6rn-NBC Radio and Television Institute\nUCLA-NBC Radio Workshop\nSummer Television Institute, University of Detroit\nAugust 3-14 USC Seminar: The Role of Film in Educational Television\nAugust 3-21 Michigan State Cdllege Summer Television Workshop\nOctober 29-31 NAEB National Convention, Norman, Oklahoma\nNovember 8-14 American Education Week.\nFIRST EMERSON AWARD TO KUHT-TV. HOUSTON\nAP-i-President Benjamin Abrams of Emerson R&dio and Phonograph Corporation\nhas announced station KUHT-TV, of Houston, Texas, will receive a $10,000\nEmerson Award as the first non-commercial educational television station in\nthe United States.\nThe station is scheduled to operate on Channel 8. It is a joint venture by\nthe University of Houston and the Houston Independent School District.\nLast June, Abrams announced the first ten television stations to begin non¬\ncommercial educational broadcasting would receive grants of $10,000 each\nfrom the Emerson fund."
}