{
  "id": "d710-84",
  "text": "-4-\nThe WOI-TV news s taff conducted a Television News Workshop for the spring\nmeeting of the Iowa Radio News association at Ames on April 11 and 12.\nIndiana University has received its first radio and television scholarships\nas the gift of Mr. and Mrs. Sarkes Tarzian, owners of WTTS and UTTV, Blooming¬\nton, Indiana.\nWOUI, Ohio University, recently was the subject of an article in The Ohio\nAlumnus. ’’Behind these call letters (WOUI) of the university’s radio station\nis a fascinating history of pioneering and unique program of education for\nradio careers,” says the article.\nJ.J. Weed, president of Weed and Co., radio and television representatives,\nNew York, has established an annual $500 Weed Broadcasting Scholarship at\nIowa State College, Ames.\nThw American premiere of Paul Hindemith’s ’’Die Harmonie der Welt” Symphony,\nperformed Friday, March 13, was recorded by KUOM at the morning rehearsal and\nreplayed for Hindemith and members of the Minneapolis Symphony orchestra\nimmediately afterwards. Hindemith himself conducted the orchestra for this\npremiere. This was only one example of the way an educational station consis¬\ntently serves a symphony orchestra with which it cooperates in many other ways\nalso.\nWe’ve mentioned birthday previously in Coast to Coast. Here’s another# WOI-TV\ncelebrated its third anniversary this spring.\nExperimentation in television news techniques by Radio-Television Center,\nSyracuse University, will begin shortly under a research grant from the ^\nTwentieth Century Fund. WSYR-TV will cooperate with the University in conduct¬\ning the experiments, according to Kenneth G. Bartlett, Director of Radio-\nTelevision Center. The research project is the second major assignment to\nSyracuse University by the Twentieth Fund. Last year, Radio-Television Center\npresented a series of three programs over WSYR-TV which experimented with\nformats for the presentation of Fund findings. The newest grant is for the\npurpose of discovering the most effective ways of presenting news stories via\ntelevision released by the Fund.\nThe H.V. Kaltenborn radio scholarship will be awarded at the University of Wis¬\nconsin this year. The scholarship of $500 represents the income from the trust\nfund established by Kaltenborn in 1945 to assist deserving students interested\nin preparing for a career in radio broadcasting, with special consideration\ngiven those interested in newscasting and news analysis.\nThe Northern California Television Academy granted two awards late in March.\nOne went to Stanford University's \"People, Places, and Politics.” Congratulations.\nThe WAAM television fellowship for graduate study at Johns Hopkins University\nis ^warded to persons professionally engaged in television activities and carries\na stipend of between $4500 and $6000, depending on the family responsibilities\nof the Fellow.\nThe Radio, Television and Film Department of the University of Miami (Coral\nGables, Fla.) will offer two courses in television in the first session of its\nsummer school, Dr. Sydney W. Head, chairman, has announced. Classes begin June 17. w'\nWarren A. Kraetzer is author of an article in NYU's Alumni Bulletin on \"New Of¬\nfice Uses Chancellor, Deans, Students to Meet Educational Challenge of TV and\nRadio.\""
}