{
  "id": "d710-88",
  "text": "-8-\nUPA PRESENTS AWARD TO STATION, WNYC\nThe United Parents Associations of New York City presented an award to station\nWNYC for \"outstanding contributions in the field of Parent Education” April\n13 at a meeting of the parent federation delegate assembly at Washington Irving\nHigh School.\nThe parent federation award was made to WNYC in r ecognition of its contributions\nfor parent education and for ’’presenting new and broader horizons in education¬\nal broadcasting.”\nGREENWOOD OF KUOM RECEIVES ENGLISH-SPEAKING UNION AWARD\nMrs. J. Ward Greenwood, director adult education for KUOM, the University of\nMinnesota radio station, also was recently named as one of the eight recipients\nof a Better Understanding Award. Mrs. Greenwood was honored for her work in\nplanning and programming a number of radio series broadcast by KUOM last year\nwhich were designed to promote better understanding by Americans of British\nCommonwealth problems, both at home and abroad.\nCHICAGO EDUCATION TV INTEREST INCORPORATE\nA certificate of incorporation for the Chicago Educational Television Assn.,\na not-for-profit corporation formed by the heads of the Chicago educational and\ncultural institutions to make application for a license to operate a non-com¬\nmercial television station on Chicago’s Channel 11, has been issued by the\nIllinois Secretary of State.\nListed on the certificate as incorporators, acting in behalf of the heads of\n20 institutions sponsoring the proposed station, are: Dr. John T. Rettaliata,\npresident of Illinois Institute of Technology, who is chairman of the sponsor¬\ning group; Dr. Laurence Kimpton, chancellor of the University of Chicago, and\nDaniel Caton Rich, director of the Art Institute of Chicago.\nThe Chicago institutions have formed the new corporation to make application to\nestablish a station which is expected to cost $500,000 for construction and\nequipment, and which will expend approximately $300,000 during its first year\nof operation.\nThe stated purpose of the new corporation is stated, as follows: ”To obtain,\nand hold a television license pursuant to the rules and regulations of the\nFederal Communications Commission for the promotion of the cultural, educa¬\ntional and civic welfare of the citizens of Chicago and the surrounding area,\nsuch license to be for non-profit and non-commercial television broadcast service’.’\nThe corporation's sponsors include: Art Institute of Chicago, Chicago Histor¬\nical Society, Chicago Natural History Museum, Chicago Parochial Schools, Chica¬\ngo Public Library, Chicago Public Schools, College of Jewish Studies, Cook\nCounty Public Schools, DePaul University, Illinois Institute of Technology,\nJohn Crerar Library, Lake Forest University, Loyola University, Museum of\nScience and Industry, Newberry Library, Northwestern University, Orchestral\nAssociation, Rosevelt College, University of Chicago, and the University of\nIllinois.\nA public solicitation for gifts to finance most of the contemplated expenditures\nis to be launched at a public rally, April 23."
}