{
  "id": "d710-89",
  "text": "-9-\nKBPS OBSERVES 3QTH BIRTHDAY By Patricia L. Green. Manager\nMarch 23, 1953, Radio Station KBPS, “The Voice of the Portland Public Schools\"\ncelebrated its 30th anniversary of educational broadcasting. The day was an\nimportant milestone in the thirty-year history of this pioneer AM radio sta¬\ntion.\nKnowing that all “sister and brother\" NAEB stations throughout the nation (and\nNAEB officials) were up to their antennas in educational television plans, the\n“request for greetings\" was not made. Only KOKH-FM , Oklahoma City, picked up\nthe anniversary plans by radar and sent a greeting which astounded anddelighted\nthe KBPS student staff. The community of Portland responded in an enthusiastic\nway and all day long the city’s commercial radio stations and the one UHF-TV\nstation, KPTV, aired and telecast warm and gracious “30th birthday salutes.\"\nManager James Morris of KOAC, the Oregon State station in Corvallis, Oregon\nalso sent greetings.\nA special two hour evening ceremony broadcast over KBPS featured speeches by\nMayor Fred L. Peterson, Superintendent of Schools Paul A Rehmus, School Board\nChairman James Yeomans, President William McCready of the Oregon State Broad¬\ncasters Association, and other dignitaries representing the state, the commun¬\nity and the school system. Elementary and high school orchestras, bands, and\nchoral groups plus individual musicians contributed musical tributes. Each\nfacet of KBPS's varied program schedule was described through dramatic offer-\nings, interviews and panel discussions. Elementary teachers and principals\ntold of their use of KBPS programs in the classrooms, high school students\ndiscussed the role of the station in their lives, and parents with adult lead¬\ners of the community analyzed the contribution of KBPS to Portland's adult\nlisteners.\nRounding out the program, Manager Pat Green introduced her student staff who\ndescribed what they did in the operation of KBPS. The KBPS 30th \"birthday\nparty\" was a gala event covered by feature stories in both the city's news¬\npapers and in the radio and TV columns.\nKBPS is the second oldest radio station in the city of Portland, Oregon, and is\nunique in several ways. It is the only AM radio station in the nation which\nis owned by a school district and completely student-operated. KBPS is located\nin the Benson Polytechnic High School, an all-boys high school, and was pur¬\nchased from Benson student body funds thirty years ago on March 23, 1923. By\n1939, the use of the station by both the schools and the community of Port¬\nland had grown to such proportions that the Portland school district took over\nthe financial and administrative support of the station with the employment\nof the first station manager. The station now employs a station manager, an\nassistant, a traffic clerk and a secretary. Much student help is necessary\nto augment such a small program staff for the licensed operation of a twelve\nhour broadcast day.\nKBPS is technically operated by the boys of the Benson Polytechnic High School\nwho are majoring in radio. These students are trained in combination announcing\nand control board work and technically operate the station during its daily\n12 hours on the air. The station broadcasts only on school days.\nA chief engineer and transmitter operator are the only two paid technical em¬\nployees. Many Benson students learn transmitter operation and earn their first"
}