{
  "id": "d710-92",
  "text": "-12-\nSENATORS FAVOR MORE TIME FOR EDUCATORS\nAn obviously friendly Senate committee gave a lady commissioner a warm reception\nApril 16—but its wasn’t just chivalry. Members of the Senate Interstate and\nForeign Commerce Committee likedFCC Comr. Hennock’s project—extension of\neducational channel reservations beyond June 2—though they disagreed as to\ndetails of continuance. Importance of Senate committee's disposition to\nfavor more time can't be underestimated; when that committee makes its wishes\nknown, FCC usually accedes.\nAll remaining opposition by committee members to extension virtually melted\nas Senators Capehart (R-Ind.) and Johnson (D- Colo.) joined ranks of the sup¬\nporters, leaving Sen. Potter (R-Mich.) and Butler (R-Md.) as only known oppon¬\nents of blanket extension, now favored, at least in principle, by 13 members.\nUnder friendly guidance of Chairman Tobey (R-N.H.) and Sen. Bricker (R-0.),\nFCC Chairman Walker and Comr. Hennock, only witnesses, both cursaders for ed¬\nucational stations, gave forceful presentation of the case for extension on\ngrounds of \"public interest.\" But they themselves clashed over length of\ncontinuance.\nBroadcasters-telecasters are divided—the \"ins\" being perfectly content to\nkeep those channels in non-commercial hands, the \"outs\" eager to lay hands on\nunused channels. Realistic-minded veterans of the radio wars, however, are\ninclined to give the educators plenty of time, recalling how they muffed their\nopportunities in the far less costly radio and FM fields; noting, too, that\nof 14 CPs granted to education, only 2 stations look like they're being built\nat all (both unusually well heeled), that legislatures aren't rushing to\nappropriate for other grants, and that only 11 educational applications are\nstill pending after full year of the \"thaw.\"\n(Television Digest. April 18, 1953)\nANNUAL FESTIVAL OF BOOKS OPENS ON WNYC SUNDAY\nHighlighted by top literary personalities and covering all aspects of writing,\nproduction and appreciation of books, WNYC's first annual Festival of Books\nwill premiere Sunday, with close to 70 hours of air time continuing through\nApril 4. The varied programs, catering to all ages, tastes and interest, has\na two-fold purpose in paying tribute to New York as the publishing capital of\nthe world and stimulating interest in books as well as encouraging listeners\nto make fuller use of the city's libraries and book shops.\nOfficially opening at 3 p.m. by Mayor Impellitteri, WNYC director Seymour Siegel,\nand Harold Guinzburg, of the American Book Publishers Council, the series will\npresent all phases of the book world, and will be made available to education¬\nal stations throughout the country.\nProgram will be of varied types, including readings from famous works, inter¬\nviews with noted authors and poets, readings from well-known works, panels on\ndifferent topics associated with books and publishing, as well as several\nshows specifically for children. The special programs are scheduled for morn¬\ning, afternoon and evening throughout the week-long festival, which is pat¬\nterned after the station's award winning annual festivals devoted to American\nmusic, art, and Shakespeare.\n(Radio-Television Daily, March 26, 1953)"
}