{
  "id": "d710-95",
  "text": "-15-\nOWNER OF KSTP DENIES TRYING TO KILL TV BILL\nStanley Hubbard, owner of KSTP-TV, Wednesday denied trying to kill educational\ntelevision in the Minnesota legislature Tuesday night. He said his opposition\nwas to the particular bill which would have made the University of Minnesota\nthe licensee. Hubbard said he felt the license should be held by a state-wide\ncommission ’’because to control policy you have to control the license.”\nThe regents of the university had said they would relinquish policy control\nto a statewide commission, but Hubbard said ’’under federal law the commission\nwould be only advisory.” Hubbard said he also opposed the plan before the\nlegislature ’’because they planned to apply for commercial channels out in the\ncountry for educational TV. I didn't think we should take over these commer¬\ncial channels with state money. We still have a free enterprise system in\nthis country.” Hubbard said he was not opposing educational TV altogehter,\nand that he would be ”in the forefront of efforts to get some educational tele¬\nvision here.” He said he would recommend university operation of the station,\nbut not as licensee.\nEfforts to get $2,100,000 for three stations failed in the legislature. A\nmove to grant $100,000 for a commission to study TV proposals twice was de¬\nfeated Tuesday in the senate. The FCC announced recently that there is no\nJune 2 deadline for educational TV applications, however, indicating that the\nend of the legislative session did not end all hope for Minnesota stations.\n(Minneapolis Morning Tribune, April 23, 1953)\n\"DON'T MISS TV BOAT” KEYNOTES OHIO STATE'S 23RD EDUCATIONAL CONFAB\nBesides the general feeling that the educators gathered here at Ohio State U.*s\n23rd Institute for Education by Radio-Television were anxious for information\nin the ways to operate and program television, there was an additional feeling\nof urgency, that time is fast running out in which institutions have non-com¬\nmercial channels set aside for them.\nThis feeling was given substance in an address by Ralph Steetle, executive\ndirector of the Joint Committee on Educational Television. Steetle observed\nthat no one expected 242 educational TV stations to be built within the year's\ntime allotted by the FCC but \"surely everyone has been surprised that so much\nhas been accomplished in so little time.” Twenty-five educational institutions\nhave filed for channels and by the June 2 deadline, it is expected the number\nwill be close to 50. He cited nation-wide press support for educational TV\nand said public understanding and support is increasing daily.\nA majority of the Institute's \"special interest11 and \"work-study11 sessions were\ndevoted this year to ”how-to-do-it” themes that ran all the way from the actual,\ntechniques of educational TV to how to support the non-commercial station.\nThere were s essions on research (which \"can help educators sell worthwhile\ninformation and ideas just as it helps .advertisers sell soap and beer”), public,\nrelations, program quality, farm broadcasts and telecasts, religious TV pro¬\ngrams and community cooperation. (Variety, April 22, 1953)\nHYDE NAMED FCC CHAIRMAN\nPresident Eisenhower designated Rosel H. Hyde, long-time member of the Federal\nCommunications Commission, as FCC chairman for a one-year term, Hyde has been\na member of the FCC since 1946 and affiliated with either the FCC or its pre¬\ndecessor, the Federal Radio Board, since 1925*\n(United Press, April 18, 1953)"
}