{
  "id": "d1326-0",
  "text": "NAEB NEWS LETTER\nUR8ANA, Illinois\nSeptember I, 1946\nON TO EAST LANSING!\nThe annual convention of the National Association of Educational Broadcasters\nWILL BE meeting ON THE CAMPUS OF MICHIGAN STATE COLLEGE, EaST LaNSING, MICHI¬\nGAN, ON Monday and Tuesday, September 30 and October Io\nHotel headquarters will be Hotel Olds, LansinQo A reservation card is enclosed\nwith this letter, so make your reservations EARLYo\nThe Monday evening meal and meeting will be held at Hotel OldSo All other\nmeetings and eatings will be on the campus, or just off the campuSo Local\narrangements are being made by the chairman of the local arrangements com*\nmittee, Director R* Jo Coleman. On-campus meetings will be held in the\nSun Parlor of the Michigan State Union Building.\nYou reach East Lansing by rail or bus best via Chicago or Detroit. You\nrfach East Lansing by car, picking your own route. For your convenience\nwe'll enclose some road maps with this issue.\nThe program will be strictly informal, but businesslike\nNAEB. There'll be no formal program planned, except at\nusual formalities of welcome ano kick-off. And, I warn\npresident has time to prepare a speech you'll likely be\nI NSI ST.\nTopics which will be listed on the convention agenda include:\nEstablishing a service in Washington for educational stations*\nIncreasing membership of NAEB.\nOriginizing NAEB INTO regions by discussion of a constitutional amend¬\nment AND PROVIDING FOR MAIL VOTE ON THE PROPOSAL.\nEstablishment of a NAEB Program Service and the NAEB Legal Service.\nThe Development of FM by educational jnstitutions*\nThe granting of facilities in the noncommercial FM bands by the FCC\nTO religious institutions which, strictly speaking, are not EDUCATlONAu.\nThe publication of an NAEB brochure.\nThe FCC ruling on identification of records and transcrptions*\nOther which may be brought up by memberSc\nAnnual reports of president, executive secretary, and treasurer.\nand on business of\nthe opening the\nYOU IF the outgoing\nbored with one, I"
}