{
  "id": "d1326-1",
  "text": "NaEB NEWS LETTER ... March 15, 1941 . Page 2\nprogram, and what this work means to the citizens of a small\ntown. Thd multiplication of this type of radio in one locality,\nwhen multiplied all over the country, would do much to bring\nabout national unity.\n\"3 - We also would like to stress that your group could present\nlocal programs dramatizing the specific part a locality has\nplayed in the history of the country to further the conception\nof Democracy. For example, let the folks in Marietta, Ohio\nknow how their town is historically important in the creation\nof the Northwest Company, and how that historical event added\nto the solidification of democratic concepts. Or, let KWSC\nin the State of Washington,dramatically show the citizens of\nFullman how Ezra Meeker and other pioneers are linked to our\nproblem of fighting Fascism today.\n\"I have written at length because I feel very strongly about\nthis question of localizing radio for Defense, - decentralizing\nit, as it were. The small town and the small community in\nAmerica has always been a cornerstone of strength.\n\"We are preparing skeleton scripts which may be used by any\nradio station, and filled in by that radio station to explain\nthe Defense problems of the community that station serves. We\nare also preparing skeleton copies for State use.\n\"Our job is only to suggest and assist in any way we can.\nConsequently, if we can be of any further he3.p, please feel\nfree to write me.\" ,\nINTERNATIONAL STATION REBROADCAST POSSIBILITIES\nIn response to NAEB inquiries regarding possibilities of NAEB\nnon-commercial stations rebroadcasting programs of the Inter¬\nnational broadcasting stations, we have two replies..\nMr. J. M. McDonald, Assistant Technical Director, WLWO (Cincinnati)\nwrites.:\n\"We have been authorizing a number of stations in the United\nStates to rebroadcast the programs of our International Station\nWLWO, among these being one Educational Station.\n\"We have an established method for handling rebroadcast author¬\nizations which calls for the separate consideration of each\napplication.\n\"From our experience, we feel that £t is very improbable that\nany station can satisfactority rebroadcast our programs with the\nuse of an ordinary non-directive antenna such as is generally\navailable, and to rectify this, we have developed a design for\na high-gain directional antenna of the \"Rhombic\" type, which\ngives excellent results on the frequencies assigned for Inter¬\nnational broadcasting. We supply the requesting station with"
}