{
  "id": "d1326-2",
  "text": "PAGE 3\nCharles W* Dudley, formerly educational program director for WILL attended\nthat Institute*o.0«.Yes, he came to work on July and resigned on September\n4 TO ACCEPT POSITION AT EmERSON COLLEGE IN BOSTONo..oKNOW ANY GOOD APPLICANTS\nFOR THE JOB AT WILL? .WRITE WRIGHT (OR WRIGHT WrITE) OR SCHOOLEY.\nFCC ACTIONS\nOr, more SPECIFICALLY, SOME ACTIONS OF THE COMMISSIONS ARE SOME CASES 3EF0RE\nTHE FCC;\nWILL, University of Illinois, had its license renewed to May I, 1949, by\nACTION OF THE FCC ON JULY 26.\nKUSC, University of Southern California, was granted modification of its\nCONSTRUCTION PERMIT FOR A NEW NONCOMMERCIAL, EDUCATIONAL BROADCAST STATION.\nAction was taken on AuqustI,\nWBOE, Cleveland City Board of Education, was granted construction permit to\nSPECIFY FREQUENCY AS 90J MC (CHANNEL 2ll), AND TO MAKE OTHER CHANGES. ACTION\n^.»-S0 TAKEN ON THE FIRST DAY OF LAST MONTH.\nRelease or the FCC, dated August 8, announced renewal of licenses for WBEZ,\nChicago,; WBOE, Cleveland; WlUC, Urbana, and WNYE, Brooklyn.\nThe Comm ssion accepted for filing, on August Ie, the application of the\nBoard of Education of Newark for extension of completion date on its CP.\nSt, Louis University’s application for a CP for a new experimental television\nstation was accepted for filing on August 15,\nThe FCC accepted for filing the application of the Bible Institute of Lo3\nAngeles, Inc,, for a CP for a new noncommercial educational broadcast station.\nAccepted on August 15, (Editors note; Is it an educational inst tution?\nBe present at the NAEB convention,)\nThe Commission also accepted for filing the application of WNYC, Municipal\nBroadcasting System, New York, for extension of the Special Service Author¬\nization TO operate additional hours between 6 A.Mo AND 10 P.M,, EST.\nSWAN SONG\nFor some eight or nine years, now, yours truly has pounded out a number of\nNAEB News Letters, has served as executive secretary for a number of years,\nAND THE past YEAR AS NAEB PRESIDENT, TO ALL OF YOU WHO HAVE HELPED MAKE\nTHE work PLEASANT, THANKS, lT*8 BEEN MOST ENJOYABLE. To THE NEW OFFICERS,\nMY BEST WISHES AND PLEDGE OF CONTINUED ASSISTANCE, FOR I BELIEVE IN EDUCATION¬\nAL BROADCASTING, AND IN NAEB.\nSCHOOLEY"
}