{
  "id": "d1591-14",
  "text": "NAEB News Letter*0•Sept* 15* 1939 Png© 15\nresearch fellows assigned to them, during the past year and you might\n.be interested to hear a few words as to what those fellows are\nsupposed to accomplish, Their task is a three-fold one* They bring\nto th© station all the data dnd information which w© were able to\naccumulate at the Princeton Office of Radio Research* One© they ar©\nout in the field they ar@ supposed to do actual work for th© station\nto which they are assigned, and when they come back they write a\nreport and thus help in enlarging th© knowledge which is centralized\nand coordinated at our office®\n\"Our research work would vary considerably according to local conditions\nand th© special time at which a study is undertaken. Stilly it is\npos/sible to summarize a few general ideas by which we are guided in\nour efforts to help educational broadcasters through th© medium of\nresearch* I would likes to give you examples of th© following main\ntopics t\n(!) Clarifying th© goals of educational broadcasting and the ways\nof attaining these goals®\n(2) Finding th© general conditions of audience building,\n(3) Program improvement\n(4) Interpreting success and failure of specific programs*\n**(i) Obviously* each educational broadcaster has to decide for himself\nwhat goals he aims at® But in a general way you will agree with me\nthat there ar© three main groups of tasks among which he will choose\non© or more specific directives. Educational broadcasting will first\nwant to disseminate knowledge in th© seme sens© as our general school\nsystem tries to d© iti. Bui today w© are no longer satisfied with\nteaching th© three R’s, Th© complexities of modern life have forced\nus to pay much more attention to the way people get along one with\nanother and solve their own personal problems® So the dissemination\nof psychological insight has bocome a second major area of educational\nefforts® But not~evSn That is enough« There are tremendous social\nchanges going on just now which demand from, us a detached* rational\nattitude towards social problems as much as possible unbiased by our\nimmediate personal interests and habits of thoughts So th© dissemination\nof social perspectives become© a third are© of educational endeavor*\n\"How it seems to mo that w© research people have different functions\nin regard to your three tasks of disseminating knowledge* insight* and\nperspectives. As far as knowledge goes the main problem is to find .\nspecific program techniques where radio can be at its best. A good\nexample of this point is th© Professor quiz type of program. Our\nstudies have shown that th© success of this program type is partly\ndue to the fact that people look for additional education and feel\nthat they get it from th© Quiz programs in a painless way® All right,\nthem* why shouldn’t educational stations use this form* but us© it in a\nmore intelligent way than th© commercial stations go about it? In a\nregular Quiz program thes listener Is* ko us© a Shakespeare quotation*\n\"a snapper~up of unconsldered trifles*\" Why shouldn’t we try to\ndevelop quizz programs where on© question follows the next in a\nsystematic order so that in the end the listener has gone through a"
}