{
  "id": "d1591-15",
  "text": "NAEB News Letter* •«*S©pt* 15 , 195.9 Page 16\nchain of arguments back and forth and hae really enjoyed something\nwhich at the salt© time improves hie mind*, 1 am inclined to think\nthat such a program on the one hand and on the other hand really good\ndiscussions such ae the Chicago Round Table has* or hook talks as\nProfessor Frederick at Northwestern University puts them on the air*\nwill probably cover the different needs for information better than\nthe dramatizations of scion©© or history which sound so popular but\nare neither fish nor fowl* I sm not quite sure whether I am right on\nthis point* but it is a good example of the t]rp© of problems w©\nresearch people 'try to study for you in the knowledge division of\nyour educational problems*\n\"Now whan It comes to the dissemination of psychological insight*\nwe are in a slightly different position* It seems that the need for\nhelp in straightening out personal difficulties is so great that the\ncommercial broadcasters were forced into providing such far© just in\norder to .keep largo audiences* You have on the on© hand such very\nsuccessful self-improvement programs as the Good Will Hour on Sunday\nnight* and on the other hand the family serials * Th© great success .\nof all those family stories is partly due to the fact that women use\nthe experiences of families like th© Goldbergs and th® Kellys to\nlearn something in regard to their own hom© life* Professional\npsychologists frown on self-improvement programs with the-result\nthat educational broadcasters neglect thorn and lose part of their\npotential audience to commercial stations* What we try her© is to\nset up standards so that self-improvement programs can be developed\nwhich do a minimum of harm* We have not yet started similar work on\nfamily serials, but I think it is our duty to let you know that if\nLum and Abner mention a local rural library they probably do more\nfor making people road then many a speech by a librarian could do*\n\"I am embarrassed when I come to th© question of how to disseminate\nsocial perspectives over the air® Everyone is so cagey on this\nscore that there is practically no experience to report on® The^\nonly thing we research people can do is let you know that w© find\nher© a blank in the radio field and 'that we hop© you educational\nbroadcasters will find your way to being more out-spoken on. social\nissues than you have been so far* Summarizing this point, then, I\nmight say that this is what w© can do to help you clarify the goals\nand tools of educational broadcasting? We follow carefully the\ndiscussions of educe tors and keep in mlncTHSKa generaTTdeas on which\nlJE®y~seem^fo§^^T‘m Wen w® gllim’'TSiTwSole fieldHoT^roadoasting\nanS oinf^wEaY\"© o mlTTllS ' ten., ear anS'^ifhy theyufke ft®\nIjSSiT we 1 start * to\"tUTnlc wlia¥ change s’^ios© alfferent kind of^Tucc e is ful\nprog;: uHolr^o so tlYaTtffiey really serveriEigineral .goals\nofe’IucaTion* AnT^Sen wo tufiiHB:: m. ‘ over to* you for production!\nM{2) When you then go about producing such a program wa try to help\nyou make it successful in the sens© that people like to listen to It*\nTh© main technique we have developed h©r© is the listener panel. It\nis my conviction, which X cannot prove her© In detail, that if you\nget in contact with a small group of listeners, maybe as few as\nfifty, and ask them, to listen regularly to your program, you can get\na wealth of information to help you improve the program as> time goes\non* If you try it you will be surprised how much constructive\ncriticism listeners can give you on points which you are not likely"
}