{
  "id": "d1532-1",
  "text": "NoA8EoBc News Letter\nApril 15, 1939\nPage 2\n*Mr. Hale Sparks, Radio Adidinjitrator, University of California,\nBerkeley, California\n♦Director of Radio, Drake University, Dea Molnfes, Iowa\nMro Haloid K. Bergman, Director of WCAD, ‘St. LawrlSft$fe ‘University,\nCanton, New York\nMr, Elmer So Pierce, Principal, Seneca Vocational High School,\n666 East Delavan A ve., Buffalo, New York.\nDirector of KFGQ, Boone Biblical College, 924 West 2nd Street\nBoone, Iowa\nDireotor of KBPS„ Benson Polytechnic School, N. E. l2th A^e. &\nHoyt St., Portland, Oregon\n*Mr. Harold W. Kent, Director, Chicago Radio Council, 2^8 North\nLa Salle St., Chicago, Illinois\n♦Director of Radio, Eastern State Teachers College, Richmond,\nKentucky\n♦Associate Membership\nCopies of the constitution are available for any prospects* Please advise\nme and I shall be glad to forward oopifcs immediately.\nDRAMA HOLDS IMPORTANT PLACE ON WNAD\nRadio drama plays a big part in the program of \"the voice of Soonerland,\"\nstation WNAD. Some of these dramatic programs that appear regularly over\nthe station that brings the university into the home are The Family Life\nRadio Forum, WNAD Players, the Warren Family, and Jack Wilsort and Phyllis\nMarkley«s \"folda\" programs.\nHomer Heck, direotor of the station, is in charge of all dramatio produc¬\ntions. Heok has been program direotor of WNAD for several years but this\nIs his first year to assume the role of director. Henderson Leake is\ndireotor of production.\nBoasting the fact that it is the only non-commercial radio station in the\nstate,; WNAD serves as key station for the Oklahoma network at least once\neach week. The Family Life Radio forum, conducted by Dr. Alice Sowers,\nprofessor of family life education, is broadcast thru WNAD over seven\nOklahoma network stations.\nThe stations carrying the broadcast are KADA, Ada; KBIX, Muskogee; KCRG,\nEnid; KQME, Tulsa; KGFF, Shawnee; KTOK, Oklahoma City, and KVSO, Ardmore,\nThe station \"atop the Union tower on the campus of the University of Okla¬\nhoma\" broadcasts 14 hours eaoh week regularly and additional hours by\nspecial permission."
}