{
  "id": "d1532-2",
  "text": "N0a0E»Bo News better\nApril 15, 1939\nPage 3\n►\nDuring the 14 hours of broadcasting activities, about 140 students and\nfaculty members are Involved in the production*.\nWNAD is manned by a staff of three faculty members and 19 students* In\nthe March issue of the Sooner magazine, an entire page of pictures entitled\n\"Education by Radio\" gives a pictorial story of the station's work*\nThe most recent special-time broadcast by the station was held during the\nannual Junior college forensic association tournament when the radio-play\ncontests were broadcast two nights*\nWNAD shares time with KGGF, Qoffeyvllle, Kan. Special test broadcasts\nthat are conducted occasionally by student employes of the station have\nreceived letters from as far away as New Zealand.\nClyde L. Farrar, associate professor of Electrical engineering, is in\ncharge of the technical staff* Each year several students are graduated\nfrom the engineering school with the advantage of having had the exacting\nlaboratory experience that a broadcasting transmitter in actual operation\naffords*\nEDUCATION IN RADIO GUIDE\nMidwestern editions of Radio Guide now carry programs for the following\neducational radio stations* WBAA, Purdue; WHA , Wisconsin; WILL, 1111-\nnols; and WSUI, Iowa. The Issue for April 15th also carried an educational\nprogram classifier In the Listening to Learn section of the magazine.\nRADIO IN CLEVELAND SCHOOLS\nThe Klwanis Magazine for April carries an article by Karl Detzer on the\nuse of radio in the Cleveland public schools. It is worth reading. You\nmay find a condensed version in Reader's Digest for April, too.\nNAEB RECORDING COMMITTEE WORKING\nThe NAEB Recording Test committee Is now at work testing machines that\nhave been submitted by manufacturers In accordance with the NAEB invitation\nand the standards set up. A. J. Ebel, chairman of the committee and\nchief engineer for WILL, has announced that the date set for the con¬\nclusion of the tests has now definitely been set for August 1. The\nreport on the tests will be available at the annual convention, Septem¬\nber 1 and 2, In Ames, Iowa* Other members of the committee are Carl\nMenzer, WSUI, and John Stiehl, WHA.\nWQSU APPLIES FOR INCREASED POWER\nWOSU, Ohio State University, has applied for license to increase power\nfrom 750 watts night and 1 kilowatt day to 1 kilowatt for day and night\noperation."
}