{
  "id": "d1911-2",
  "text": "making role they nevertheless play. This breakdown\nin the constitutional order (in the early days of our\nnation people elected officials, but did not, by pres¬\nsure procedures, in effect make their decisions for\nthem) is the cause of the precipitate and catastrophic\ndecline of Western Society .... what we have seen\nis not only decay—but something which can be\ncalled an historic catastrophe.”\nIn our universities and schools are many men\nand women who are at least as wise as Mr. Lippmann.\nTo what extent are the dangers and concerns—and\npossible answers to our problems—being courageously\ndiscussed, as might be done with these resources over\nour facilities? Who will first bell the cat? I think we\nall must, together. For if we don’t provide courageous\nintellectual leadership and integrity, why do we exist?\nIn our intellectuals and historians, in universities\nand out, we have a great repository of unused wisdom\nand knowledge. The tragedy Mr. Lippmann wants\nAmerica to avoid is having our system disintegrate\nfor lack of use of these available ideas.\nWhat is important is to keep in people’s minds\n“the traditions of how the good life is lived and the\ngood society is governed. When they (these fabrics\nof society) come apart, as they have in the Western\ndemocracies, the result is tantamount to a kind of\ncollective amnesia. The liberal democracies have\nbeen making mistakes in peace and in war which they\nwould never have made were they not suffering from\nwhat is a failure of memory. (They) are like men\nwho have kept their appetites but have forgotten how\nto grow food. The aft of governing well has to be\nlearned.”\nQuoting the distinguished political scientist,\nFrancis G. Wilson, Mr. Lippmann reminds us: “‘The\ntransitions of society can be marked by the changing\ncharacter of the intellectuals” of a nation: lawyers,\nadministrators, executives, teachers, doctors, and the\nlike. “It is thrpugh them that doctrines are made to\noperate in practical affairs. And their doctrine, which\nthey, themselves, have learned in the schools and\nuniversities, will have the shape and the reference\nand the direction which the prevailing philosophy\ngives it.”\nPerhaps this suggests to us where we should get\nmuch of the “talent” for our programs. And per¬\nhaps, in an age when the principal philosophy dis¬\nbursed is that of advertisers, appealing to the\nindividual’s selfish, personal motives (prestige, pleas¬\nure, leisure) rather than society’s overall good . . .\nperhaps this suggests the counter-balance we should\nbe throwing into the scales, to help stem what Mr.\nLippmann sees as the “progressive barbarization”\nnow occurring.\nNext month, in the second and shorter part of the\narticle, using Mr. Lippmann’s book as a “consultant”\nI shall try to suggest more specific ways and tech¬\nniques in which we might attack this problem. Mean¬\nwhile, I should be glad to hear from any of you who\nhave anything to add or contribute.\n* * * * *\nA few weeks ago we. mailed to all institutional\nmembers of the NAEB (Actives, Associates, Affili¬\nates) a digest of information and guidance regarding\nTitle VII of the National Defense Education Act.\nIndividual members who believe they might qualify\nwill be sent a copy on request.\nWe should like to call the attention of our mem¬\nbers, however, to the fact that there may also be\npossible projects which might qualify for support\nunder Title III as well. This has to do with programs\nof instruction in Science, Mathematics and Modern\nForeign Languages instruction. From the wording of\nthe bill, fund's for equipment and minor remodeling\nas well as other expenses, seem to be available.\nSince these are administered through the respec¬\ntive State authorities, however, rather than on direct\napplication, this would require you to investigate\nthe channels and procedures set up for each state. A\nletter to your state education office (variously titled\n“Superintendent of Public Instruction”, etc.) would\nbe the best starting point. Because of this different\nprocedure, we are unable to give you as specific\nguidance as we are for Title VII. But we hope radio\nand television will be well represented in this group¬\ning as well.\nPLACEMENT SUPPLEMENT\nDecember I - Young family man, 27, with M.S., wishes re¬\nsponsible position with broadcasting organization.\nWell versed in broadcast production, research and\nadministrative functions. Licensed teacher. Versatile,\nimaginative, energetic. Will locate anywhere. $5200\nminimum.\nDecember 2 - Program director or manager with 8 years ex¬\nperience in VHF, UHF and closed circuit TV. For¬\nmer art and film director. M.A., married, 34, male.\nDesires position in open-circuit TV. Prefers New\nEngland but will consider other locations. $7500-8500.\nDecember 3 - B.A. and M.S. TV major. Four years as com¬\nmercial producer/director. Past two years as TV\nengineer in progressive ETV station. Seeking more\nresponsible position as station manager, production\nand/or program manager with ETV station or Univer¬\nsity. 44, married, male. Prefers West. $6500-8000.\nDecember 4 - Energetic young man, 21, with Associate in Ap¬\nplied Science degree in Telecasting. Seeking oppor¬\ntunity as director or floor manager. Single. Prefers\nMiddle-west. $75/week.\nDecember 5 - Production technician. B.A., 22, single male.\nExperience in commercial TV. Desires more experience\nand exposure in ETV production. Location of no\nconcern. $ 100/week.\nDecember 6 - Young married man, 21, desires position in\neducational broadcasting. Commercial experience.\nA.B. Can do most anything: announce, write, pro¬\ngram, music, art, produce, direct. Prefers East or\nWest. $300/month take home pay minimum.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 14 Gregory Hall,\nUrbana, III. $5 a year, edited by Nancy Whitmore.\nDECEMBER 1958\n3"
}