{
  "id": "d1911-8",
  "text": "her young viewers to think in French and to speak\nit properly. She repeats a great deal, and then pauses\nto allow the learner to repeat after her. At times\nthe camera moves in very close so that the shape\nof her mouth as she forms each syllable is clearly\nvisible. She makes the language simple and exciting\n.... for adult learners, too.\n► The Cincinnati public schools are finding that\ntelecasting to school screens has fine advantages for\nteaching. At present, the Board of Education is\nbeaming more than 12 hours of instruction a week\nto various grade levels, conserving on teachers while\noffering better preparation and elaborate presenta¬\ntions in such courses as Biology, Driver Education,\nand Home Economics.\nBiology is telecast to 70 junior and senior high\nschool students for a half hour three mornings a\nweek as part of a carefully designed combination of\nvideo and in-school instruction. Biology has par¬\nticular advantages for TV instruction. Interesting\nguest-lecturers who lack the time to appear at each\nindividual school can “visit” all involved via the\nWCET (Cincinnati) studios. Complex experiments\ncan be prepared ana more expensive materials used.\nAnd there’s no such thing as a bad classroom seat.\nThe TV camera gives everyone a good view as in¬\nsects are studied or fish dissected.\n► Chet Huntley, NBC award-winning news com¬\nmentator, has accepted a new role as host for the\nnew “Ten for Survival” series distributed by N.E.T.,\nbecause he feels that “People have so little realiza¬\ntion of the importance and urgency of what we’re\ndealing with in the nuclear age.” The series began\nNovember 13.\nWell-known stage and screen artists read from\nJohn Hersey’s “Hiroshima” in the first program.\nThe program, about the dropping of the first atomic\nbomb, showed with dramatic impact the effects of\nnuclear weapons, and man’s need to adjust to his\nenvironment in a way never before contemplated.\nTaking a completely new approach to the prob¬\nlem of opening men’s minds to the facts of nuclear\nwarfare, “Ten for Survival” will demonstrate in¬\ndelibly that, with knowledge, survival in a nuclear\ncrisis is possible. The series will underscore the fact\nthat the knowledge which is man’s surest means to\nsurvival is being rejected by the American public\nfor a variety of reasons. The series will document\nthe reasons for this rejection and lay the groundwork\nfor acceptance of the hard facts of nuclear weapons\nand radiation.\n“Ten for Survival” is presented by the National\nBroadcasting Company and the National Educational\nTelevision network. It was produced in cooperation\nwith the U. S. Office of Civil and Defense Mobiliza¬\ntion.\nPERSONNEL\n► Dr. Glenn T. Seaborg, Nobel Prize winning sci¬\nentist, has been elected to the Board of Directors of\nthe ETRC. Dr. Seaborg has pioneered in ETV as\nthe featured performer on the “Elements,” a N.E.T.\nscience series. The eminent nuclear scientist recently\nwas named chancellor of the University of California\nat Berkeley.\n► Edgar E. Willis of the University of Michigan and\nJohn Young of the University of North Carolina\nhave been appointed to the program staff of the\nETRC for one year. Willis, a member of the Mich¬\nigan faculty since 1952, formerly served with the\nRadio Department of the Detroit Public Schools.\nBefore joining the Michigan faculty he was professor\nof speech in charge of radio and television at San Jose\nState College in California. Young is on a leave of ab¬\nsence from the University of North Carolina where he\nhas been assistant director of the University Com¬\nmunication Center at Chapel Hill, and of Station\nWUNC-TV.\n► Two more pioneers have been added to our grow¬\ning list. They are: Dr. Clarence Morgan, Director\nof Broadcasting, Indiana State Teachers College,\nTerre Haute, Indiana; and Richard Hull, Director\nof Radio and Television, Ohio State University, Col¬\numbus, Ohio.\nTV TECHNICAL TIPS\n—Cecil S. Bidlack\nLast month we promised a mailing of the data on\nmodification of the galvanometer mounting platform\non the GPL kinescope, recorder. We don’t have this\ndata for you because the GPL and J. A. Maurer\nCompanies haven’t come to a definite decision on\njust how it’s to be done. Here is what is involved in\nthis modification.\nFirst, there’s no physical difference between the\nModel I and the I-Prime. The I-Prime is 3 db bet¬\nter at 7000 cycles, has 30% less distortion and gives\nbetter definition on the sound track. If your Model\nI galvo needs repair, an overhaul will cost you $120\nplus parts or it can be converted to the Model I-\nPrime for $300. One reason for the modification of\nthe mounting platform is to permit the use of an F-\nPrime (variable area) galvo. Since its snout is\nshorter, .270 inches of the shoulder of the platform\nmust be milled off to permit proper focus on the film.\nAt the same time this milling operation is per¬\nformed, Maurer representatives would like to see\nthe method of mounting the galvo changed. They\nhave machined the bottom of the galvo assembly and\nthreaded it to permit it to be fastened by two screws\nfrom below. They feel that it is desirable to have\nDECEMBER 1958\n9"
}