{
  "id": "d1399-0",
  "text": "1346 Connecticut Avenue, N.W., Washington, D.C., 20036\nJune 15, 19&n\nVolume V Number 9\nNAEB FILES REPLY COMMENTS ON UHF AND MPATI PROCEEDINGS\nOn April 3, the NAEB filed comments with the FCC supporting its original comment\ncalling for adoption of the NAEB UHF Assignment Plan. The comments pointed out that the\nNAEB plan was not only the most efficient plan that is available to the Commission, \"but\nit also provides considerable flexibility for meeting special needs that have arisen in\nvarious areas.\nIn a separate filing, the NAEB reiterated its opposition to the MPATI proposal for\nregularization and expansion of the Airborne operation. However, the comments indicated\nthat if a study shows that ground-based educational stations recommended in the NAEB plan\nand an expanded airborne operation are compatible for a short period of time, the FCC might\nconsider an extension of MPATI*s experimental grant. Copies of both filings are available\nat the Washington office.\nACE PUBLISHES SPECIAL REPORT ON FCC ASSIGNMENT OF UHF CHANNELS\nIn a special report issued last month, the American Council on Education published\na thorough and intelligent comparison of the FCC and NAEB UHF Television Assignment Plans.\nCopies are available from the Washington office of the NAEB.\nRECENT HEW GRANTS TO ETV STATIONS\nUniversity of Utah, Salt lake City, Utah, for the expansion of station KUED,\noperating on Channel 7, Salt lake City, Utah. Amount of Federal grant approved: $239,322.\nMilwaukee Board of Vocational and Adult Education, Milwaukee, Wisconsin, for the\nexpansion of station WMVT, operating on Channel 36, Milwaukee, Wisconsin. Amount of Federal\ngrant approved: $167, 475 •\nOffice of Education, a Department of the County of Santa Clara, California, San Jose,\nCalifornia, for the establishment of a new educational television station on Channel 54,\nSan Jose, California. Amount of Federal grant approved: $68,064.\nBowling Green State University, Bowling Green, Ohio, for the establishment of a new\neducational television station on Channel 'JO, Bowling Green, Ohio. Amount of Federal grant\napproved: $95,137•\nMetropolitan Pittsburgh Educational Television, Pittsburgh, Pennsylvania, for the\nexpansion of station WQED, operating on Channel 13, Pittsburgh. Amount of Federal grant\napproved: $166,968.\nUniversity of South Dakota, Vermillion, South Dakota, for the expansion of station\nKUSD, operating on Channel 2, Vermillion, South Dakota. Amount of Federal grant: $14,351.\nAlabama Educational Television Commission, Mobile, Alabama, for the establishment of\na new educational television station on Channel 42, Mobile, Alabama. Amount of Federal\ngrant approved: $242,658.\nDes Moines Independent Community School District, Des Moines, Iowa, for the expansion\nof station KDPS, operating on Channel 11, Des Moines, Iowa. Amount of Federal grant: $79,598*\nTwin City Area Educational Television Association, St. Paul, Minnesota, for the\nestablishment of a new educational television station on Channel 17, St. Paul, Minnesota.\nAmount of Federal grant approved: $154,255."
}