{
  "id": "d1399-1",
  "text": "Radio Programs in the Public Interest\nTHE most promising move for expanding the\nservice of radio to the public was made by the\nFederal Communications Commission in March with\nthe publication of a report on \"Public Service Re¬\nsponsibility of Broadcast Licensees.” After analyzing\nmany types of program structure the report sets forth\nstandards of \"public interest” which it will take into\naccount in the future in granting and renewing all\nradio licenses.\nThose standards are: first, that controversial ques¬\ntions should be fairly dealt with from all sides, and\nadequate time be provided for presentation of im¬\nportant public questions; second, that local issues and\ntalent should be adequately represented in radio pro¬\ngrams; third, that every station should put on a rea¬\nsonable number of sustaining programs, that is, those\nnot commercially sponsored, and at desirable listening\nhours; and fourth, that advertising excesses should\nbe minimized.\nThe Commission’s proposals have been intemper-\nately attacked by leaders of the radio industry mainly\non the ground that they constitute censorship. They\nargue that the Commission has no authority to con¬\nsider distribution of time on the air, and to do so\nthreatens later control of the content of programs.\nThey charge that the proposals abridge freedom of\nspeech and are thus unconstitutional. Their other\nmain objections are all covered in this leaflet.\nI HE ACLU, which would certainly be among the\nfirst to resist any threat of radio censorship, has\nwholeheartedly endorsed the report and the standards\nset. For years the Union has urged a provision in law\nto accomplish just this result by requiring every radio\nstation in return for its license to set aside non-com¬\nmercial time for discussion of public issues and for\nother programs of public interest. Congress itself\nagreed in principle in the 1934 act in referring such\na proposal to the Commission for study.\nIndustry spokesmen roundly criticize the ACLU\nfor supporting regulation of radio when the Union\nis so vigorous an opponent of regulation of the\npress and motion pictures. The ACLU would be\nin favor of equal freedom for radio if there were\nunlimited radio channels. Comparison with the\npress and motion pictures where facilities are the¬\noretically unlimited, is unsound as long as there\nmust be a choice *by a government agency between\napplicants for the limited number of wave-lengths,\nand a responsibility to see that conditions of li¬\ncenses are observed. The ACLU position does not\nfavor the principle of government regulation, but\naccepts it as a practical necessity."
}