{
  "id": "d1399-4",
  "text": "fusals to renew for minor matters. Licenses should\nbe revoked or denied only for serious offenses.\nAnswer. The present system is not working well,\nas evidenced by the volume of complaints of the over¬\ncommercialization of radio. Congress long ago or¬\ndered a study of public service programs with a view\nto allocating time in the public interest. It was made\nby the Commission. Nothing was done in view of the\nindustry’s promises to accomplish the same ends. The\npromises have not been realized. The FCC standards\nare preferable to requirements in law which would\nbe inelastic.\nFurthermore, this argument implies that station-\nowners are more or less free to operate without re¬\ngard to any positive standards of public interest. The\nlaw is clear to the contrary. Since there are many\napplicants for the limited wave-lengths, those who\nhold licenses should be held to fairly uniform stand¬\nards of performance. Applicants get their licenses by\npromising to maintain standards of performance in\nthe public interest. They should be held to them by\nreview every three years as is now provided by the\nCommunications Act.\nThe Commission has never revoked a license for\nfailure to live up to general standards of public in¬\nterest. The comparatively few revocations have all\nbeen for gross improprieties, and where challenged,\nhave been sustained by the courts and applauded by\nthe public and the industry. Upon findings of un¬\nsatisfactory performance, warnings by the Commis¬\nsion should be sufficient to secure compliance. In any\nevent the Communications Act provides an adequate\nmeans of review by the courts.\nObjection 7. Many commercially-sponsored pro¬\ngrams are quite as much in the public interest as non¬\ncommercial sustaining programs. The report falsely\nassumes that sustaining programs are more in the\npublic interest.\nAnswer. It is true that many commercially-spon¬\nsored programs are of high character and clearly in\nthe public interest, but most are geared to advertisers’\ninterests with only incidental considerations of their\npublic service. The requirement that sustaining time\nbe increased, local cooperation encouraged and ad¬\nvertising decreased would presumably force radio\nprogram-managers to take responsibility for improv¬\ning programs. With public response as the sole test\nthey would be far freer than now to devise means for\ngreatly enlarging the variety of radio audience appeal.\nObjection 8. One decision by the FCC prohibited\na radio station-owner from expressing his personal\nand editorial opinions concerning a political candi¬\ndate (the Mayflower case). Thus the Commission has"
}