{
  "id": "d1376-0",
  "text": "NAKB H tu Vi & L xi X T a H\niMivilOiMAL tizuGCLiU LOU OF JWudATIQJLJ^ BROADCASTER5\nA, James, £bel., k ■ tor, 3tail l r L# * • »\nDecember 1„ 19^5\n:h^:an a, msm taxes.fcc rK?uoA?xcmM« pcst\nWalter Bo Emery, who hae been Special Assistant u> Commiesioner Paul\nA. Walker lor the past two ana a hair years, was today appointee to\nthe legal staff of the Federal Communications Commi ssion. In his new\nposition he will specialise in legal matters pertaining to educational\nFM broadcasting.\nMr . Emery has been a memoer of the Oklahoma 3tate Bar since 1933> nno.\nrecently was admitted to practice before the United Bt&tes Supreme\nCourt, In 1935 he served*as Secretary to Commiscioner Walker ana in\n1936 was Special Attorney for the Commission uurin0 tiie Special Tele¬\nphone Investigation, t\nHe was Director of Radio Station WNAD at the University of Oklahoma\nfrom 1933 to 1935 where ne also taught courses in rauio speech and reaio\nlaw. He has haa wide experience in the field of radio education, bavins\nhad charge of many educational programs broadcast over numerous com-\nmeroial and non-commercial stations.\nHe holds an LL. B« degree from the University of Oklahoma ana a Pri. D,\ndegree from the University of Wisconsin* At the latter sonool he made\nspecial studies in communications ana toovernraent* and during a part of\nthe time while uoixio ^rauuate work there wat ictaxneu as t research\nman by tne Wisconsin Rower ana Li^nt Company<>\nHe has tau^nt at tne university of Ckl&ncma, University of Wiscon¬\nsin and Ohio otate University, and nae written for nuacr>-u.i educa¬\ntional journals; He is a member of the Raaio Committee of the National\nAssociation of Teachers of Speech, and last year was Editor of\nAdministration, the official journal of the society -.or personae, ad¬\nministration In Washington? D„ Go\nWBAA HOLDS LISTSNKR*S CONFERKNCK\nWBAA sponsored a Listener's Conference at Vest Ln.ayctoe on\nwhich we well attended, well managed, and imluable to all. Com Joh^\nton opened the meeting with a warm welcome to all participants on _\nhalf of Purdue, He stressed the importance end srowin* significance of\n!£L> 1. SS daily 11... ana ih. i.pa«aac. »« a tajo™..\nHe concluded with the hope that listeners coula be mox.c artic\nand listeners and operators be more understanding^ and nc .p.\nother* ‘\nSir. Lynn Miller, principal of Jefferson Hl»h School, Uaaystte, die-"
}