{
  "id": "d1376-6",
  "text": "LLTY&h* ,, ,v* y. . » .. 7, .,V*.... * December 1, 1, P;\ntrimmings a new control. console will be installed in Hfuaio B\nsa: t he Btudio B eqaipuert bo moved into ■ bo race- \\u ; - roc s which,\nslao serves as a contrek room for Studio G ana tor the - v Bau.aio C*\nThus with the two rots of control and recording, equipme i iu « bis\ncontrol room it becomes bo&eitole to record two separate u\"- inuous\nprograms simultaneously* or to broadcast from Studto I u;,ud'.c X\"\nwhile recording from a*\\y other of the studios Two ,isw =*cv. *. .«:.>• ascrip¬\ntion tables will be Installed in Studio B and \"■ he ore sent fall--, in\nStudio B will be moved to Studio 0 This will provide three control\nrooms for originating record or transcription ehows. All of these\nchanges look toward the expansion of FM operations on FM station WIUC*\nOn December gf the National Congress of Parent a anti Teachers presents\nits quarter-hour program series* The Baxters, for the fourth consecu¬\ntive yearn\nMarge ana Bill with their children* Bud* J&my and bandy* constitute\nan American family* 3the hundreds of thousands of real American\nfamilies from one end of this country t o the other, listener* for\nthe last four years J**ve found interest and inspiration in these prc~\ngrams which dramatise the homey* practical phases of family Xivt v;..\nwith the Joys and trials that crop up in the everyday task of tori tgi-ag\nup children to toe useful future oiti^ene.\nFro0raia titles for the first thirteen weeks are he follows, ’•What Can\nWe autos tituts for War*11 ’•Pad* s at .Home Wow* f‘ *(3ooa till Toward\nhen,* * The Baxters Air Their Views on Military Training,* 4 Bex Edu¬\ncation Is h&sential,* *»The Bo boy box Brigadek \"dhoula iandy Go to\nNursery Bcnooi? % p2 outju. Out of Line, * \"The Menace of Divorce, *\n“Uoott Manners Go peep, ** •Let's Get hi a of rrejuaioe* * * ow i'uoh\nHistory are Children Learning?11 ana \"Bua Bias for a Rai k *\nTHIS AND THAT\nVY3UI is the first station .In with their 19% WAEBauee.. ax chile\nto Mrs* Martin who keeps a check on these things for WSUI nnd to\nMen ter for having an efficient staff member like M re* &:^r',,.va> VCM\nAlso indicated they were on the verge of paying off- - tow ai*;ut you?, *\nJack Goodman, formerly of WNYC and now with KAI.L in 3slt Lake ci y.,\nsends some interesting information on the use of radio and a *v* re\nrecorder In the Ba.it Lake City schools* •. •, Glad to have -Ci ter hmsry\nwith us in the PCS* He has the background which will alio* pin *o\nappreciate the problems of the educational broadcaster., < i t>\na storm brewing on the Wood* s bill to require ft sc ester : m $ v *. n~\ngulsh between statements of news end opinions, * Jhe i nop--.gotion\nstorm ie not torn wing tout it hasn’t blown over o-.thei\nHea ru r-e\n»trong\nFCC measurements at Uiuial, Ktt^^are^to pradiutftd h'eW\ntola the IRE in Rcohester tfcat obMWucn«,\nflalh IntwdUH were not In accord wAte. omui\nv i non"
}