{
  "id": "d1346-1",
  "text": "- 2 -\n9. Grants will be made on the basis of your application; thus, completeness and\nunderstandability of presentation will be vital. However, no weight will be\ngiven to elaborateness or beauty of presentation.\n10. Deadline for first-round applications is September l£, 1952.\n11. Production on all projects must start during the calendar year 1952.\n12. A firm completion date must be given on all series.\n13. Adequate reports must be submitted at the coupletion of the series tellings\n(a) how the project was handled, and\n(b) how the money was handled.\nlii. A tape recording of each radio program produced with the help of these grants\nmust be sent to NAEB Headquarters for possible use on the NAEB Tape Network.\nl£. Where feasible, a film or kinescope of each TV program produced with the help\nof these grants should be sent to NAEB Headquarters for possible use by other\neducational institutions. Otherwise, the television program idea should be one\nwhich can be adapted to other localities and scriptsor other production aids\nshould be sent to NAEB Headquarters.\nApplication Form for NAEB - FAE Radio-Television Grants-In-Aid\n1. Attach as Exhibit »A» a description of the proposed radio or television program\nseries. This should be long enough to adequately describe the idea. It should\nbe accompanied by a 100-word brief descrition of the idea.\n2. Attach as Exhibit \"B\" the proposed budget for this project. This should be in\n' two parts: (1) the part you expect to contribute from your own resources and\npersonnel, and (2) the part you would expect to receive from NAEB.\n3. Attach as Exhibit ,,Cn some evidence of your ability to produce a series of\nprograms in this area. This might include* (1) tape or film which can be lis¬\ntened to or viewed; (2) background information on the production people you would\nuse; and (3) background information on the content authorities.\n4. Attach as Exhibit TtDM a statement of the willingness of your institution to accept\nthis grant, to abide by the stipulated conditions, and to make the necessary\nfinancial reports. This should be signed ty an administrative officer of your\norganization.\n-- ■ ■■ -...\nIN THIS ISSUE\nFoundation Grants and Special Projects......1-2\nEducational Tele vision......... 5 - 13\nEducational Radio ....... 1 h - 21\nThe 1952 NAEB Convention — Burton Paulu..... 21\nNAEB Tape Network — John Holt....... 22\nThe Third Allerton Seminar — Alvin M. Gaines............... 23 - 27\nEVERY NAEB-ER HIS OWN CONVENTION PLANNERJ SEE PAGE 21 FOR DETAILS"
}