{
  "id": "d1346-11",
  "text": "12 -\nWAYNE U* FORMS COMMUNITY TV COMMITTEE\nWayne University is encouraging community participation in planning for the .use\nof channel £6 reserved for education in Detroit* A general advisory committee, with\nrepresentation from all educational interests in the area, has been formed*\nIt is expected that the license will be held by a non-profit educational cor¬\nporation, basic policies of the station to be directed by a board of trustees of\nsome 15 individuals selected from the community. The facilities of radio station\nWDET, Detroit, have been presented to Wayne University by United Auto Workers (CIO),\nand will be adapted for. television broadcasting* Use of the radio station's land,\nbuildings,. and tower will cut construction costs for the Detroit educators*\nLIBRARIES AND EDUCATIONAL TV\nScheduled for the October issue of College and Research Libraries is an article\nby Robert W. Orr, Director, Iowa State College Library, on means by which libraries\ncan provide effective service to educational television broadcasting* The article,\nwhich is. entitled \"Television and the Libraiy at Iowa State,\" is a comprehensive\nreport on the utilization of college library materials by the WO I-TV staff in pro¬\ngramming and researching television shows, and on ways in vhich a college library\nstaff may be able to aid television stations on its own campus* The article should\nprove helpful both to members of college library staffs and television personnel.\nFORD FOUNDATION TO AIR 90-MINUTE CBS DRAMA-TIC SHOW\nThe Ford Foundation will make its initial entry into television programming in\nthe fall with a high-budgeted hour-and-a-half dramtic series Sunday afternoons, on\nCBS-TV* While plans are still in the earliest talking stages, the Foundation has\nnotified CBS of its intentions to program the show Sundays from k:30 to 6 p.m* start¬\ning Nov* £* Under plans set recently the series will be offered to five participat¬\ning sponsors, each of which, must be acceptable to the Foundation*\nProgram Schedule Set\nAlistair Cooke, chief correspondent in the U*S. for the Manchester Guardian and\nwinner of a Peabody Award this year, is to be emcee. Shows are to be both live and\nfilm. Now in the works, according to Workshop director Robert Saudek, are three\noriginal plsys by Maxwell Anderson; five short French ballets now being produced in\nParis; a special video series by maestro Leopold Stokowski; examples of how film is\nused in medical research and in industry; a series of plays by James Agee; plus\noccasional fims made by the American Museum of Natural History, the N*Y. Zoological\nSociety and other American and foreign institutions.\nIn addition to these, Richard de Rochemont, formerly producer of March of Time,\nand Jean Benoit-Levy, will present individual shows on \"Omnibus*\" Besides Saudek,\nthe permanent staff of the show include John Coburn Turner, Saudek*s assistant, and\nFranklin Heller, now on leave from CBS-TV. The initial \"Omnibus\" series Is planned\nfor a 26-week run*\n* \"People Act,\" meanwhile, completed the 26-week cycle for which it was originally\ndesigned. The Ford Foundation, however, 'is offering recordings of the show to. sta¬\ntions around the country for aid in helping other communities solve the type of\nproblems which the show spotlights*. Recordings will be distributed via the \"People\nAct Centre\" at Penn State College*"
}