{
  "id": "d1346-14",
  "text": "-1?\nHAEB STATIONS AMD BBC PROGRAM SERIVBS\nHere is a review of some services offered North American broadcasters by the\nBritish Broadcasting Corporation# ' •\nThe. BBC North American Service and the Transcription set-up provide the pick of\nBritish pro'grams available - at practically no cost to a station making use of them*\nSpecial events‘such as the recent Election and the forthcoming Coronation..•• speeches\nof major improtance by world figures...daily newscasts...a tremendous range of record¬\ned programs**.are buts ome of the offerings of these services.\nThe North'American -Service\nEvery day,, many Americans with special interest in Britain tune their short-wave\nsets, to the, BBC*s North American Service, some to listen to the newscasts, others to\nhear special documentary features of discussion programs, plays or coverage of cur¬\nrent events. ' •* :\nNo charge is made for such contributions If stations are able to arrange their\nown direct 'pick-ups#* In congested area, BBC is generally picked up through AT & T\nat the usual AT & T charges.\nFrequencies vary from month to month but the BBC New fork City office issues\nbulletins giving program highlights and necessary technical data together with per¬\nmission to pick up programs. *‘v-:\nOther BBC services include collaboration oh two-way trans-Atlantic,programs and,\nas far as possible; recording facilities for accredited American commentators visit¬\ning Britain.'\nIncidentally, section 3,1*08 of the FCC Rules and Regulations states that FCC\npermission is not necessary for BBC material to be rebroadcast in AmericaT\nThe Transcription Service\nThis service makes available-to stations throughout the world the best of BBC on\ndisks and’tapes* Some of the programs are taken from the Home and Overseas trans¬\nmissions; others are specially produbed*\nThe current catalog, issued last month,; makes good reading for program directors,\nparticularly in view of the very low cost of the programs - a charge that covers\nhandling and postage and which bears no relationship to the values offered. The\ncost to commercial stations is five dollars per program regardless of length.\nSMTTHE, PUBLISHES SURVEY ON \"COMPETITIVE” BROADCASTING\nAn analytical survey of radio and televis ion broadcasting which attempts, \"to\nmeasure several aspects of the' competitiveness of broadcast businessmen operating with¬\nin the framework of public licesning of their radio frequencies\" appeared in the May,\n19^2 (vol. lb, no. 2) issue of Current Economic Comment. The article is by Dallas\nW. Sirythe, Professor4 of Ecomonimcs, University of Illinois. The magazine, is published\nat the University of Illinois, from which institutions copies maybe obtained.\nHELP WANTED BY UNESCO\nFour specialists in the field of audio-visual education are needed for service\nin Ceylon, El Salvador, Iraq and Formosa. The pay scale ranges from $1*200 to $7200.\nFor further information write toj Miss I. Shepanski, Administrative Assistant,\nUNESCO, New York Office, N.Y.C."
}