{
  "id": "d1346-16",
  "text": "■17-\nSITUATIONS WANTED\nRadio and journalism major, with writing credits on CBS, MBS, and with experience in\neducational broadcasting ay Syracuse and Boston University desires position* Married,\nno children. B.S., Boston U., *50. Former instructor radio and TV writing. Marine\nCorps Institute. For a complete background please write to: Bernard Hirsch, 501\nHolstein Street, Tacoma Park, Maryland*\nFormer London representative of Mutual Broadcasting Sustem, news and special events,\nwould like position in educational broadcasting. Author of “Round-up of Inndon\nWeeklies’* series, special events broadcasts and documentaries for BBC since 19l*9.\nWrote for New York State*s Rural Radio Network, researched for Reader's Digest, and\nauthor of miscellaneous articles. American citizen, 30, married, with 2 children.\nPlease write to Norman Mchie, c/o Don Miller, RR2, Box 81, Ripon, Wisconsin for more\ncomplete information on background.\nAge 29, veteran (draft exempt). Education: BA St. 01af*s College, Minnesota, 19k9,\n(English-History teaching majors); graduate work U. of Iowa, Emory U, Denver U. Will\ncomplete all but the thesis for MA in radio in August. Experience: KUOM, U. of Minn*;\nWCAL, St. Olof College; 2 yrs. civilian anncr. Armed Forces Radio, Austria; cont.\ndir. WSUI, U. of Iowa; employed now staff anncr. KMYR, Denver* Please write to*:\nDick Stevens, 1251 Ogden, Denver, Colorado.\nFormer radio and TV assistant to the Director of Publicity, Boston U., with teaching\nexperience in radio speech, creative radio writing and radio production. Emerson\nCollege, Boston. B.S* *U7, Boston U.; M.S., *5l, Boston U., both degrees in radio.\nExcellent references from both University and radio and TV station administrators.\nAge 30, married, no children. Not in reserve. For more detailed information write.\nto: 0. Leonard Press, 5l Linden street, Allston 3h, Mass*\nGraduate of *52 from U. of Minn, with master's degree in music history desires position\nin music dept, of radio station. Excellent academic record with strong musical back¬\nground and some experience in dramatics and radio. Please write to Mss Connie\nMagnusson, Apt. 26, 727 15th Ave., S.E. , Mnneapolis, lU, Minn*\nRADIO SCHOLARSHIP OPEN AT U. OF WISCONSIN\nThe annual H.V. Kaltenborn radio scholarship at the University of Wisconsin is\nnow available for next year, the University of Wisconsin radio committee announced\ntoday.\nThe scholarship is supported by the income from a trust fund of $15,000 set up\nby the nationally-known radio commentator and amounts to approximately $500 for the\nacademic year. It was established to help d eserving students study and train for some\nphase of broadcasting with particular emphasis on training for the presentation of\nnews and news analysis.\nAny student of junior standing or above is eligible. Selection is made on the\nbasis of scholarship, special aptitudes and interest in broadcasting, evidences of\nplanning for a career which includes the use of radio, and financial need.\nInquiries and applications should be addressed to Prof. H. L. Ewbank, Ghairman\nof the University radio committee. University of Wisconsin, Madison. Prof. Ewbank\nasks that each applicant furnish a transcript of credits, a letter of application,\nand two or three letters of recommendation*"
}