{
  "id": "d1346-18",
  "text": "-19-\nHEALTH SERIES AVAILABLE\nThe Communication Materials Center of Columbia University announces the availa¬\nbility of a new radio series, “The Human Heart,*' sponsored by the Public Health Ser¬\nvice, Federal Security Agency, and prepared under the auspices of the National Heart\ninstitute and the American Heart Association* Produced by,the Center, the series con¬\nsists of eight transcribed quarter-hour dramatized reports on progress in the treat¬\nment of various types of heart disease* Individual programs feature such celebrities\nas Arlene Francis, Meivyn Douglas, Martha Scott and Arnold Moss in the leading drama¬\ntic roles* Each program concludes with a brief statement by a recognized authority in\n„he field of heart disease.\nThe series is available for local or statewide use on a fee basis* Address adeis\nand inquiries to Communicatioxi Materials Center, Ul3 W. 117th St*, New fork 27> N.Y*\n7ESTIVAI5 TO OFFER U*S. MUSIC PACKAGE PLAN\nA plan to build \"a bridge of music lovers\" between the United States and Europe\nhas been worked out by Ira A* Hirschmann, New York patron of the arts,' and the Assoc¬\niation of European Music Festivals with the support of their governments, the United\nStates State Department and the United Nations* Its primary aim is to organize Amer¬\nican attendance at European festivals on such a cheap and efficient basis that it will\nbe raised from the current figure of 30,000 to 150,000 within five years*\n.Mr* Hirschmann, who has Just completed arrangements to start the plan moving-in\nNew York early next year, said in an interview he hoped it would eventually mean\n^150,000,000 annually to dollar-starved western European economies and, more than that,\n\"a tremendous accrual of good will.\" He added \"it will mean Americans will be seeing\nSurope under the best of auspices and for the right reasons***They will be welcomed\nin the atmosphere which made Europe a world culture.\"\nParticipating in the plan at the moment are festivals of Aix en Provence, Bay-\nreuth> Berlin, Besancon, Bordeaux, Florence, Holland, Lucerne, Munich, Perugia, Stras¬\nbourg, Venice, Vienna and Wxesbaden. The main holdouts so far are Edinburgh and\nSalzburg, but efforts are being made to induce them to join*\nOrganizations of leading music lovers will be established in New York, operating\na bureau in conjunction with the European Association in Amsterdam* It is intended to\ncharter planes to bring music-minded American vacationists directly to the scenes of\nthe famous musical events. The plan hopes to provide round-trip transportation for\nabout $300, and it is calculated that concert tickets and other expenses will average\nabout another $300 a person. Arrangements with travel agencies will make it possible\nt,o include hotel bookings. The prospective \"musical tourist\" will be able to attend\nas many festivals as he wishes, assembled .into a rounded group*\nThe bureau will coordinate information about dates and programs and will dissem¬\ninate data through music schools public schools, musical organizations and radio sta¬\ntions. The New York bureau will even provide scores of works to be heard.\nThe plan includes a joint advertising campaign in United States newspapers fin¬\nanced by interested governments and festival groups. Mr. Hirschmann said, \"Once the\nolan is working, American music lovers will find it easy and inexpensive to spend sum¬\nmers at European festivals. These festivals—usually indoors because of the cool West\nEuropean climate—will attract Americans who are not satisfied with concerts under out¬\ndoor conditions and who wish contact with the tradition which these festivals have.\"\nHr* Hirschmann plans to meet in New York this fall with embassies of interested gov¬\nernments, the United Nations and others to launch the United States end of the venture."
}