{
  "id": "d1346-7",
  "text": "- 8 -\nCommissioner Rose! H* Hyde explained the principle of the educational, reservations on\nthe ’’Georgetown University Forum,” broadcast last April*\n\"We refer to the channel allocation as providing some 2,000 station assignments*. Of\nthat nunber 2k2 have been classified for use by non-commercial, educational institu¬\ntions* On an average, there are five such assignments to a state.**\n\"These channels, which have been allocated to be operated as non-commercial stations\nby educational institutions, are available on applications by applicants eligible\nunder,this classification without conpetition from other applicants* In other words,\nyou would not expect to find yourself in a competitive hearing with an applicant who\nwishes to establish a commercial station* However, that is not to say that these\nreservations are made in perpetuity* They are allocations made for service purposes\nand if they are to be used it will be because applicants take advantage of the oppor¬\ntunity to apply and construct and operate stations*\"\nCommissioner George E* Sterling defended the principle of educational reserations\nbefore the Mary Ian d-Dis trie t of Columbia Radio-Television Broadcasting Association\nat Ocean City, Maryland, last month*\n\"During the course of the hearing, the educators of America established by an over¬\nwhelming preponderance of the evidence, that a certain number of television channels\nshould be set aside for non-commercial educational television exclusively. You will\nremember that originally I dissented from the proposed establishment of educational\nreservations in the VHF with the thought that the educators were looking more toward\nfuture use of television for educational purposesthan immediate use* On the basis\nof the record I found that the educators could not be denied the use of VHF fre¬\nquencies for the purposes they desired*\"\nCommissioner Edward M* Webster reviewed his official stand-regarding educational\nreservations when he spoke at the Institute for Educational Radio-Television, Colum¬\nbus, Ohio, last April.\n\"After the publication of ny separate opinion accompanying the March, 195>1, Third\nNotice of Further Proposed Rule-Making concerning the Television Broadcast Service,\nwherein I stated that, on the basis of the record then made, I did not agree that a\nreservation of channels for non-commercial educational purposes should be made, I\nheard some rumors to the effect that some educators were shocked at my apparent\nantipathy toward the use of television as an aid to education. Of course, I was not\nand am not against the use of television for this purpose. I favor placing non¬\ncommercial educational television stations on the air at the earliest possible date\nand my statement so indicates..*.\n\"Everyone here has of course seen or heard about the Commission’s recently published\nfinal report* on the Television Broadcast Service. Despite the fact that I concurred\nwith the majority in reserving channels for future use for educational purposes, seme\nof you may feel that ny comments attached to t hat report are less than flattering to\neducators. Well, Imnt to say at this point that nothing in ny concurring remarks\nshould be construed as an attack upon you, because I think educators are engaged in\nthe most important work anyone can undertake.\"\nEVER BEEN TO A CONVENTION THAT WASN'T PERFECT?\nNEITHER HAVE WEI LET'S EXCHANGE IDEAS\nSEE PAGE 21 FOR YOUR INVITATION TO COMMENT"
}