{
  "id": "d320-0",
  "text": "FILM NO, 3, EXCERPTS FROM TEACHER'S GUIDE\nNOTE; This first excerpt has reference to the specific lesson\non which FILM 3 TELECAST is based. Because of objections\nby Clair and Jim to the TELECAST OBJECTIVE actually shown\nin the TEACHER'S GUIDE, this portion has been rewritten\nand the BLOW-UP OF THIS PARTICULAR PAGE will need to be\ntaken from here rather than from the actual GUIDE, How«\never, I suggest you refer to the GUIDE itself for page\ncomposition, typography, etc, in having the BLOW-UP pre¬\npared.\nThis is from PAGE 15 of the TEACHER'S GUIDE for 1963<-1964,\n(For Scene 36, page 11, Shooting Script 3)\nInvestigation No, 13, Jan, 14, 15, & 17\nTELECAST OBJECTIVE; The television teacher will show that man is\nable to survive in environments other than his natural human en^-\nvironmento In learning to live in the ocean, he may use a simu¬\nlated land environment, often based on observation of those\nliving things which are naturally adapted to life in the ocean.\nContinuing his observation, man finds the same interdependatlds\nbetween plants and animals existing in the sea and on land a\n(GENERALIZATION 4)\nRelated Activities\n1, Relate dry land topography to marine topography,\n2, Make a chart correlating the plant and animal l^fe cycle\n(fish which eat plants, big fish eating little fish, etc,T”foand\nunder the surface of the ocean,\n3, Make a seashell collection and discuss the type of life\nthat once inhabited the shells,\n4„ List some of the things we eat which come from the ocean.\nDiscuss what the scientists are learning about the ocean as a\nfuture food supply,\n5, Additional related concepts to be investigated; Conti¬\nnental Shelf, islands, ocean floor, pressure, depth.\nNOTE TO DIRECTOR; From Related Activities (ABOVE) on through the\nmaterial following, I feeTThis should be subordinated in type\nface and lighting. In your blow-up of this lesson segment of the\nTeacher's Guide, our emphasis is on the TELECAST OBJECTIVE, which\nwe should see bdld and close«up, with other material fading off\nat top and bottom of screen, I AM GIVING YOU THE MATERIAL FROM\nPAGES 7 and 8 from which to choose enough to cover the VOICE OVER\nSEQUENCE (Scenes 37 and 38, pages 12 and 13,) READ CAREFULLY the\ndescriptions of material to be seen in the GUIDE while Narrator\nis talking.\nIMPORTANT; BEFORE SHOOTING, MUST BE SURE TO ADD TEACHER'S\nMARGINAL NOTES IN HANDWRITING."
}