{
  "id": "d320-1",
  "text": "FILM 3 » EXCERPTS FROM TEACHER'S GUIDE (1963^1964)\nTO COVER VOICE-OVER SEQUENCE (BY NARRATOR) IN SCENES 37 and 38,\npages 12 and 13, SHOOTING SCRIPT (of May 27, 1964),\nFrom TEACHER'S GUIDE ^ page 8\nPREMISE^ Few things exist in isolation. One regularity in nature\nis the constant interaction of living and non-living things,\nGENERALIZATION 42 Interactions of things represent interdependence.\nNote in the Guide that each telecast investigation, with the\nexception of the summary programs, is followed by a generalization\nnumber. Although many times this may not be the only generalization\nthat could be used to present the material, it is the one on which\nthe content of the lesson will be constructed.\nThe generalizations will indicate to you how the television\nteacher will approach the lesson and what basic understanding will\nresult from the lesson.\nThe use of these generalizations in science will require a\ncooperative effort by the \"teara’»»-you and the television teacher.\nThe method of understanding science through generalized statements\ncan be of great significance to you, to the television teacher, and\nto your students. The memorization of the seven generalizations\nwill be of little or no value as such; rather, their development\nwill prove valuable to the student if he profits from them through\nthe analysis and interpretation of his own experiences.\nFrom TEACHER'S GUIDE - page 7\nPREFACE\nThe Use of Generalizations in the Teaching of Science\nand\nHow the Generalization System Relates to the KLRN Science Program\nMemorization of subject matter and mastery of unrelated facts does\nnot seem to be the appropriate way to grasp broad understandings of\nsubjects. This is true in almost all subject areas and especially in\nthe sciences. Science is constantly changing as new phenomena are ob^\nserved and discovered, but it is characterized by having a few basic\ngeneralizations which compose the structure of science. These generali\nzations do not exist in isolated vertical threads within a single area of\nscience. They are horizontal generalizations which extend across all\nscientific endeavor.\n(MORE)"
}