{
  "id": "d320-83",
  "text": "KIT NO, 3;\nLESSOHS LimCED TO NEED (How Television Prepares for the\nClassrocan) '*\nGENERAL STATEMENT ^ THE FILM;\nTwo vital prerequisites for effective utilization of television in\nthe classroom are (1) a real and existing classroom need and\n(2) television lessons carefully and thoughtfully prepared to answer\nthat needo This film traces the soundly-forged chain of events in\nthe preparation of television lessons linked to classroom need, a\nchain which links also the classroom teacher and the television\nteacher into a cooperative team# working together toward shared and\nmutually-understood goals.\nThe film reflects the dimensions of preparation# the number of people\ninvolved# the time# energy# care# and thought which they contribute to\ninsure that the television lesson will be a good product# of real\nvalue in the learning process# capable of performing a significant\nservice to teachers and students. The film reflects the bases for\ncurriculum decisions involving the use of television in the classroom.,\nthe processes through which ideas are developed# evaluated# and refined\nAs a specific lesson on oceanography is prepared for the fourth grade#\nthe viewer follows the conscientious planning essential to quality of\ncontent and meaningful sequence of subject areas. The viewer is\npresent also throughout the creative unfolding of a presentational\nidea# and visits the resulting imaginative studio production of\nunusual flair and impact.\nOUTLINE OF CONTENTS\nlo INTRODUCTIONS The chain of events which begins and ends in\nthe classroom# which represents steps in the\npreparation of a television lesson, which\njoins the members of the teaching team (class¬\nroom teacher and television teacher.)\nII. ON-SCREEN s Excerpt from the television lesson (fourth-\ngrade science teacher presenting a lesson on\n“Oceans8 Dividers of the Continents\")\nA. Teacher on ocean floor discussirg four areas of ocean¬\nography\nB. Teacher in diving suit indicating what diver would wear\nto go beneath the sea...and why...and pointing out what\nhe would see# once there.\nC. Teacher describing and pointing out the various levels\nof the ocean\nDo Teacher discussing food chain of living creatures at"
}