{
  "id": "d909-124",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nOFFICE OF THE REGIONAL DIRECTOR\nJanuary 22, 1959\nMr. William G. Harley\nStation WHA-TV\nUniversity of Wisconsin\nMad i son, Wisconsin\nDear Bill:\nThank you very much for your letter of January 19th and\nTHE ENCLOSURES.\nRegarding the Engineering Committee, Walter Emery has\nAGREED TO BE THE CHAIRMAN AND I HAVE HAD RESPONSE FROM\nALL OF THE MEMBERS WITH THE EXCEPTION OF TAFF OF MILWAUKEE. #\nA COUPLE OF CALLS FROM EMERY AND A CALL TO RALPH STEETLE\nHAVE SECURED THE SERVICES OF CY BRAUM. WALT PLANS, AT\nTHIS MOMENT, TO CALL A MEETING FOR THE WEDNESDAY NIGHT\nPRECEDING THE EAST LANSING CONFERENCE.\nI AM GOING OVER THOROUGHLY THE REGION IV PROPOSAL AND THEN\nWILL SEND IT ALONG TO WALT FOR DUPLICATION AND DISTRIBUTION\nTO HIS COMMITTEE.\nI HAVE NOT HEARD FROM THE CHAIRMEN OF THE RADIO PROGRAM\nCommittee nor the TV Program Committee. Perhaps these folks\nARE WORKING DIRECTLY WITH THEIR COMMITTEE. I HOPE SO, BUT\nIN ORDER TO PROD THEM I 1LL WRITE THEM TODAY.\nThe early part of last week I wrote to Jack White inviting\nHIM AND ANY MEMBERS OF HIS STAFF TO ATTEND THE CONFERENCE.\nThus I take it that it is a matter of internal communication\nat the Center. I don't think that your letter to Robertson\nWILL CONFUSE THINGS ANY.\nI HAVE HEARD FROM MAURICE SEAY THAT HE CANNOT ATTEND BECAUSE\nOF PREVIOUS COMMITMENTS. I HAVE NOT HAD ANY RESPONSE FROM\nJim Armsey or Bill Griffiths. I did hear from Elmer Sulzer\nREFUSING TO DO THE CHORE BECAUSE OF A PLANNED FLORIDA VACATION.\nHe suggested that George Johnson might represent him and I\nPERSONALLY CAN THINK OF NO ONE BETTER QUALIFIED TO ORGANIZE\nTHAT EXPERT SESSION THAN JOHNSON, HENCE I AM WRITING H|M TODAY\nAND ASKING HIM TO DO SO.\n1 HAVE HAD CONFIRMATION FROM LEE DREYFUS SAYING THAT HE WILL\nBE A DISCUSSION LEADER. HE ALSO ASKS FOR ADDITIONAL INFORMATION.\nThis is somewhat along the lines of your letter to McCarty,\nHENCE I SUPPOSE I SHOULD PREPARE A MODUS OPERAND I SHEET FOR\nBOTH THE DISCUSSION LEADERS AND THE CONSULTANT TEAMS. I WILL\nTRY TO DO THAT TODAY TOO."
}