{
  "id": "d909-87",
  "text": "«r'\nFebruary 19, 1963\nThe University of Chicago\nCbxcago 37, Illinois\nDear Region m NAEB Member:\nThis is your first peek it what we9ve been planning for the Regional\nConference which meeU in Chicago March 17-19, 1963.\nWe have been working diligently to organise a format which will serve\nthe broad memb/rship of the organization and which will do at a regional\nlevel those thins* which are done best regionally.\nThe keynote is to be that of informality ,.. there will be a minimum of\nformal presentations. Rather die emphasis will be on those ideas and\nproblem > which you bring to the meeting. It will be an opportunity for\nself-o’-amination of ourselves as individual broadcasters and of our organ*\nizat'un* the NAEB.\nThe meeting will be held in The University of Chicago9 s newly opened\nCenter for Continuing Education at 1307 East 60th Street. The phone is\nButterfield 8-2500. If you drive into Chicago there is plenty of room to\npark behind the building .. • and the location is ten minutes from the\nChicago Skyway or the Dan Ryan Expressway. If you fly, there is a\nreduced rate form enclosed so that you will be met at O Hare Field. Or\nif you fvain, the Center is 20 minutes away by cab.\ntUs\nc*ia\nQi\nA word about registration .. may I urge you to register now to aid us\nin our planning. A registration form, for both the Conference and hotel\nspace* is emlosed. The total registration fee of $12 for NAEB members\nincludes both itinch and dinner on Monday. W”e will admit students to alrjT\" A\nfor a total fee if $2. The Tuesday morning meeting ( see program) is\nNAEB members only*\n-_------—-^ \\mld*\nAs for the Tuesday morning session, \"The Membership Speaks.\" The\nquestions discus sea in this meeting are up to you. To give some form\nto the meeting and tc see that all aspects of interest are covered, we are\nasking you to send us in writing now (and later) those questions about the\nNAEB you would like t-> discuss - and might not want to raise from the\nfloor right off the bat. Please let us know your thinking when you return\nyour registration. In addition, questions may be deposited at the regis¬\ntration desk when you arrive for the Conference, and will be received as\nlate as 10 p.m* Monday preceding the discussion."
}