{
  "id": "d712-18",
  "text": "NAEB HE MK'UAKTKRS\n14 Gregory Hall\nUrbana, Illinois\nTO; All Hoard Members\nAll Chairmen of Committees Sub-Committees\nFROM; Harry J. Skornia\nDATE; January 29, 19b0\nSUBJECT: Comuiittoe function, definition, and structure revision,,\nFor the past several years it has been obvious that, .although, the\nvery foundations of the strengths of the NAEH must of necessity lie\nin committees -- as the most practical way of identifying and organ¬\nizing talents, problems and solutions on a national basis, and fre¬\nquently conducting or supervising necessary studies and advising on\nstaff efforts, this potential has never been more than minimally\nrealizedo\nPm sure that there are scores, if not hundreds, of fine people, who\nwould be glad to help, or who are being used as square pegs in round\nholeso\nI feel that committees also should offer individuals opportunities for\nrealizing their best talents, achieving recognition nationally for both\nthemselves and the NAEH, and providing a channel for their influence\nand talents to be exerted in a broader arena than would otherwise be\navailable*\nIn the interim since ray election, X have not had the time to do this*\nNovember and December (and now January) have been riddled with trips\nand meetings. Even though I have consulted with each proposed chair¬\nman, with the chairman of the Hoard, the NAEB staff, and various others\non committee appointments* this year*s committees, once again, are\nhaving to be appointed with less knowledge and care than they deserve\nand need* I feel this must not occur again*\nTherefore, 1 need^from each of you, your best reactions to the mater\nrials and problems presented here* Let me say, before I go farther\nthat I do plan to mail to every member of the NAEB, later on (after\nreceiving your reactions) a statement on NAEB Committees, a revision\nof the committee definition list attached, and a request for each\nperson to state his committee area interest, willingness to serve,\nspecial talents, etc."
}