{
  "id": "d712-19",
  "text": "-2-\nNow to the problems:\n1. Life-cj’cls of committees,\nT ha^ this year asked all or most chairmen to react to the\nidea of a possible three-vear rotation basis for committees.\nThis year’s chairman would retire next year, as would one\nthird of the members. Hach member would serve on a three-\nyear basis, in other words, with a rotating; chairmanship. A\nvice-chairmanship would groom the person who would become next\nyear’s chairman, normally.\nThis suggestion received mixed reactions. For this reason,\nand others given above, it was not implemented this year. How\ndo you fe^l about it?\n2. Below is a list of all committees and dr«aft definitions for\neacho Will all chairmen please react with a proposed redraft\nof the definition of his committee please? (We’ve been trying\nso many years — please do it now — and we’ll have it.) Will\nchairmen and Board members, in this connection, please also\nreact to:\na) Possible overlapping of functions between committees,\nwith suggested corrections, which may have escaped us.\nb) The size of committees.\nc) An idea of how much of the committee’s task can be done\nby mail and how much requires meetings 7-? How often?\nOther needs? (If funds, suggest magnitude’)\nd) Better ways of freeing chairmen, with initiative, to seek\nsupport on behalf of the XA,;B.\ne) What new committees do we need? In this connection, our\nold Liaison Committee has been dropped; the former Foun¬\ndation and/or Finance Committee is now the NAF.B Develop¬\nment Committee; legislative relations are handled by an\ninformal group, working with Leonard Marks; and the TV\nand Kadio Planning Committees are being continued tenta¬\ntively this year, on a trial run basis under the new\nkadio and TV Board structure in the hope that this will\nbe helpful to the respective Boards in getting needed\nprojects going. This was the opinion of the majority of\nthe members of the 1959 committee.\nf) Suggestions for good people we’ve missed, or people we’ve\nplaced in the wrong place this year.\ng) Other suggestions (such as for activation, so most com¬\nmittees become action or project or ’’program” committees)."
}