{
  "id": "d712-22",
  "text": "DRAFT* Pleas® suggest corrections in listing*\n*-Y ^\nNAEB C01MITTEES AND MEMBERS\nAwards & Citations Committee\nPrank E. Schooley, Chairman, Director of Broadcasting, University of Illinois,\nUrbana, Illinois\nVernon Bronson, Station WTHS-F&.TV, Board of Public Instruction, of Dade\nCounty, Miami, Florida\nFranklin Dunham, Chief of Radio-TV, Department of Health, Education & Welfare,\nOffice of Education, Washington, D« G.\nHo B« McCarty, Director of Broadcasting, University of Wisconsin, Madison,\nWisconsin\nIo Keith lyier. Office of Radio Education, Ohio State University, Columbus,\nOhio\nJudith Waller, Evanston, Illinois\nConstitution Committee\nJames S. Miles, Chairman, Director of Broadcasting, Purdue University, Lafayette,\nIndiana\nGraydon Auanus, Director of Broadcasting, Uhiveraity of Alabama, University,\nAlabama\nRichard Bell, Radio-TV Bureau, Arizona State university. Tempo, Arizona\nFranklin Dunham, Chief of Radio-TV, Department of Health, Education & Welfare,\nOffice of Education, Washington, D„ C,\nWalter Emery, Michigan State University, East Lansing, Michigan\nGarnet Garrison, Director of Broadcasting, University of Michigan, Ann Arbor,\nMichigan\nAnaand Hunter, Director of Broadcasting, Michigan State University, East\nLansing, Michigan\nLeonard Marks, Cohn and Marks, Washington, D. C„\nDevelopment Committee\nWilliam Harley, Chairman, Stations WIL/UAM*I*M-TV, University of Wisconsin, Madison\nWisconsin\nFranklin Bouwsma, Detroit Educational TV Foundation, Detroit 28, Michigan\nJames Etheridge, Florida Educational TV Commission, Tallahassee, Florida\nRichard Hull, Director, Radio and TV* Ohio State University, Columbus, Ohio\na, A0 tfengarferei, Jr,,, Hahi tcaek ttovwreity, Hour Xcvk„ lfew Xovk\nJames S« Miles, Director of Broadcasting, Purdue University, Lafayette, Indiana\nRobert Sohenkkan, Director of Broadcasting, University of Texas, Austin, Texas\nFrank E. Schooley, Director of Broadcasting, university of Illinois* Urbana.\nIllinois\nJohn Schwarzwalder, Manager, Twin City Area BTV Corporation, University of\nMinnesota, St* Paul, Minnesota"
}