{
  "id": "d712-42",
  "text": "-2-\nregional meetings; F) To keep MSB officers, committees and membership informed\nof committee activities through appropriate channels.\nEXECUTIVE ADVISORY COMMITTEE — An advisory committee to the President, for\nconsultation on matters in which consultation of the entire Board is imprac¬\ntical or impossible because of time pressure. The President would normally\nask, to serve in this capacity, the chairman of the Board, the chairman of\nthe Radio Board, the chairman of the Television Board, and possibly another\nperson if this appears desirable.\nGRAMS-IN-A ID COMMITTEE — When funds are available to permit the making of\ngrants-in-aid for the production of outstanding radio programs, this committee\ndetermines the standards to be established for such grants, arranges for proper\nnotification to members, carefully considers, and weighs the respective merits\nof, proposals for such radio programs, and then makes recommendations as to\nwhich proposals should receive grants, and the sums to be allocated for eac .\nINSTRUCTIONAL TELEVISION COMMITTEE — (Formerly the Closed-Circuit TV Committee)\nThis committee is concerned with television as used for direct instruction and\nadvises the President and Board on matters in this area, including possible\nAssociation activities (research, seminars, publications, etc.). Its functions\ninclude determination of needs in this area, investigation of new uses of T\nfor instruction, recruitment of instructional personnel members for the NAEB,\nand such other appropriate duties as called upon to perform.\nINTERNATIONAL RELATIONS COMMITTEE — * (The role of this committee may be sum¬\nmarized from a report prepared in 1959 in which the committee listed the\nposes of NAEB international activities.) Program imports for use on the NAEB\nRadio Network; program exports, to provide outstanding educational programs\nfrom NAEB stations to other nations, liaison with broadcast organizations in\nother countries, as reflected in representation at international broadcasting\nmeetings and similar areas; providing information to other countries through\nin-school kits, consultants and seminars; working with the State Department,\nUSIA-VOA (and such other groups as UNESCO, the UN and others) both in the area\nof supplying programs and in working with them for mutual exchange of programs\nand other materials with foreign countries, and the promotion of greater under¬\nstanding in the broadcast and education areas. This committee also large y\nhandles for the Association, on behalf of the President, numerous relations witn\nsuch organizations as the European Broadcasting Union, International Universi y\nof the Air, International Music Council, and foreign broadcast systems, and\nadvises with appropriate radio network committees on program acceptance and\nexchanges.\nMEMBERSHIP COMTTEE — This committee is responsible for promoting membership\nin the Association in all categories, taking part in the membership-approval\nprocess, planning and conducting concentrated membership drives, and advising\n•;,h3 President and Board or all tters pertaining io irorsnsing membership 'n\nlb? N.i. Tims year the . . mai . . 0 ha?, at tV-- re ; ->st o; ? ttuvcs\nsub-tveach of whom co-ordinates efforts for different clamJ-fications\nof membership."
}