{
  "id": "d1076-5",
  "text": "William Kitchen, from Hofstra College, Hemp¬\nstead, N. Y., who will attend a New York University\ntelevision workshop June 23 to August 1.\nRobert S. Metzler, of Millersville (Pa.) State\nTeachers College, who will attend Pennsylvania State\nUniversity, June 30 - August 29.\nJames Saunders, representing Ohio University,\nAthens, who will participate in the two-week training\nsession at KQED, San Francisco.\nMiss Kathleen R. Schoonmaker, of the Norfolk\n(Va.) City Schools System, who will attend the Uni¬\nversity of North Carolina August 4-22.\nMrs. Ursula M. Watson, representing Montana\nState College, Bozeman, who will complete her\nMaster’s degree in radio-television during the sum¬\nmer session at Indiana University.\nMr. Norman Weiser, of WBGO, Newark, N. J.,\nwho will attend the University of Southern California,\nJune 23 - August 1.\nSubsequent awards will be announced at a later\ndate.\n—NAEB—\nIERT CONVENES THIS MONTH\nThe 28th annual Institute for Education by Radio-\nTelevision will be concerned with broadcasting’s re¬\nsponsibilities in helping to meet the educational prob¬\nlems confronting America. The four-day conference,\nsponsored by Ohio State University, will meet May\n12 - 15 in Columbus.\nThe NAEB and four other national groups will\nhold meetings concurrently with the conference. The\nopening luncheon of the institute will be presented\nby NAEB, followed by two afternoon clinics on in¬\nstructional uses of radio and TV.\n—N A E B—\nWITNESSES TESTIFY\nFOR MAGNUSON BILL HEARINGS\nThe Senate Committee on Interstate and Foreign\nCommerce opened hearings April 24 on the Magnuson\nBill (S2119) for provision of federal grants for educa¬\ntional television. A list of witnesses was submitted to\nthe committee by Robert Schenkkan of the Univer¬\nsity of Texas, who coordinated testimony in support\nof the bill for the NAEB.\nAn early witness, Henry Chadeayne, executive di¬\nrector of the St. Louis (Mo.) Educational Television\nAssn., and coordinator of testimony for all ETV sta¬\ntions, told the committee of the success achieved by\nthe St. Louis community station, KETC. Using it as a\ntypical example of an ETV station, he said, “There\nis crying need for financial support by the government\nfor the operation of these educational TV stations\nthroughout the country.”\nDr. Alan Willard Brown, president of META in\nNew York City, stated, “With the tremendous pres¬\nsure on our schools to discharge an ever-increasing\nresponsibility, the wise and imaginative use of tele¬\nvision can do much to strengthen education. Tele¬\nvision can bring the great teacher into contact with\nmillions instead of hundreds.”\nCiting the situation in his own state, Dr. Brown\nsaid, “New York needs and wants more, television,\nbut thus far we have been limited by the time avail¬\nable on commercial channels, which is ordinarily time\nnot usable for commercial purposes. The plans and\nhopes of universities, schools, museums, and libraries\nin New York all point toward this pressing need . But\nwithout financial support, the task facing META\nand its constituency is difficult, if not impossible.”\nRichard B. Hull, management consultant on ETV\nat Ohio State University and vice-president and of¬\nficial spokesman for the NAEB, said passage of the\nproposed legislation may be the deciding factor in\nconstruction of statewide educational TV facilities\nin some states like Oklahoma, Ohio and Georgia.\nHull, who has made a nationwide survey of educa¬\ntional TV, said it already has proved a time-saver,\nprovides better instruction and new efficiencies.\nIn his testimony, Raymond D. Hurlbert, general\nmanager of the Alabama Educational Television Com¬\nmission, said that educational TV can provide great\nteachers’ facilities for reaching many students, that it\nreaches home-bound and disabled children, aids adults\nwho want to continue their education, and provides\nnew material that would otherwise be unavailable for\nclassroom use. He testified that the Alabama State\nBoard of Education is now the only one in the coun¬\ntry permitting public school credit for approved\ntelevision courses.\nDr. William Friday, president of the University\nof North Carolina, said that his state needs financial\nhelp to extend educational TV to all of its 100 coun¬\nties.\nDr. William Brish, superintendent of schools in\nWashington County, Maryland, said there are more\nthan 200 closed-circuit televised instructional projects\nin this country, including his own Hagerstown project\nnow in its second year. Citing this countywide project\nas an example, he testified that the cost of teacher\nservices per pupil for television instruction in music\nand art will be $1.71 compared to $16.78 for tra¬\nditional classroom instruction.\nOther witnesses asked to appear in support of the\nbill included Ralph Steetle, executive director of the\nNEWSLETTER"
}