{
  "id": "d1085-0",
  "text": "Washington Report\nThe National Association of Educational Broadcasters\nVol. I No. 1 Dupont Circle Bldg., Washington 6, D. C. October, i960\nTHE WASHINGTON OFFICE\nThe dream of a Washington office for NAEB has finally been realized. Situated\n11 floors up in the Dupont Circle Bldg., it consists of a three-room suite — and\nthis word is used advisedly. The building was formerly an apartment hotel; hence,\nour offices consist of a reception room (formerly a living room complete with fire¬\nplace) and two offices on either side (formerly bedrooms complete with baths).\nThe Dupont Circle Bldg, is conveniently located with respect to the headquar¬\nters of many of the educational groups located in Washington: ACE, Land Grant\nCollege Association, NEA, JCET, Chief State School Officers, etc.\nBy now the orange crates and paper cups have been replaced with furniture and\nash trays and we are ready to invite one and all (and so do) to \"come up and see us\nsome time.\" We would be pleased to welcome you.\nJCET STATUS REPORT\nAt a meeting of the Executive Committee Sept. 27, final approval was given to\na prospectus to be brought to the attention of various foundations as a means of\nsecuring long-range financing for the Council.\nJCET, supported for 9 years principally by Ford funds, had a terminal grant\nwhich expired June 30. At that time Ralph Steetle resigned as Executive Director\nand was replaced by David Stewart, who had been his assistant. Emergency funds,\ncontributed mainly by constituent members of JCET, will enable the staff to con¬\ntinue on a modest interim basis through October. Meanwhile efforts are underway\nto secure additional interim financing so staff may be kept on the job while a\ndrive is made to secure funds sufficient to insure a three-year continuance of JCET.\nFCC MATTERS\nNAEB, through its counsel, Cohn and Marks, has filed responses to two recent\nnotices of proposed rule making affecting educational broadcasters. One would re¬\nvise rules to permit noncommercial educational FM stations to engage in nonbroadcast\nactivities on a multiplex basis. NAEB petition strongly supported the proposal,\nwhich would provide opportunity for as many as 3 signals to be transmitted over\nsame facilities. NAEB and WGBH-FM petitioned FCC in June for such revision, point¬\ning out that 162 educational FM stations would be handicapped in networking devel¬\nopment, specialized program services, expansion of school broadcasts, etc. if\nauthorization denied. Additional petition was filed by AMA urging multiplexing\nby EFM stations to afford \"semi-private\" facilities for discussion of medical\nsubjects not suitable for airing to general public, citing success of postgraduate\ninstruction over Albany Medical College FM station, WAMC.\nNAEB also filed Sept. 30 comments on a proposal for reduction of mileage sep¬\naration on VHF channels. The proposal, strongly backed by ABC, would attempt to\nshoe-horn in a few more V's by reducing coverage of existing VHF stations, thus\nenabling net to achieve better competitive position vis a vis other networks via\ngaining outlets in most major markets.\nNAEB filing urged preserving integrity of existing VHF service, indicating\neducation has insufficient VHF outlets now without encroaching on areas currently\nobtaining educational service over ETV-VHF stations and that drop-in proposal\nfailed to solve the problem of UHF, in which education has nearly 2/3 of its as¬\nsignments. In fact, utilization of deteriorated VHF service will lessen effort to"
}