{
  "id": "d1080-0",
  "text": "Vol> III. No. 2? DuPont Circle Bldg., Washington 6. D.C. Sept* 21. 1962\nNAEB FILES ON BEHALF OF NEW FCC FORMS\nThe NAEB has filed comments supporting the FCC's proposal for new\napplication forms for educational stations. H&wevcr^ihe NAEB urged that\nthe use of the forms not be limited to applicants and licensees who operate\nor propose operations 4n reserved channels (as the FCC has proposed) . The\ncomments stated, \"It is respectfully urged that the choice of the application\nor reporting forms which are to be utilized should not be made to d epend on\nthe particular frequency involved. It nay Jf a\n9 commercial9 form is inappropr iate for a non-commercial EM educational FM\nstation which operates on a reserved frequency, it will be equally inappropri¬\nate for a non-commercial educational AM station operated by the same licensee,\nor for an identical FM or television operation which operates on a non-reserved\nchannel.\" The NAEB also urged certain modifications relative to submission of\nbalance sheets, oorta+n MDefinitions for Program Data,\" and the section dealing\nwith ownership. cA.—/ffo - 2.1 to /tyc\nNAEB_ SUPPORTS^ FCC PROIVSAL FOR mW ETV SERVICE S 0 ^c.\nThe Association has filed comments supporting the proposal of the\nCommission for a new ETV service! (Docket No. 14744)* However, no position was\ntaken as to possible location of the proposed service within the spectrum,\nbecause this problem is still being exploredin consultation with engineering\ncounsel and interested members. OurM&oMiwnts'wx regarding location within the\nspectrum will be filed as reply commentsIn initial comments, the NAEB\nurged the FCC to make very clear, as stated in its public Notice, that the\nnew service will be \"in the nature of a supplement to educational television\nbroadcasting, \"and that the \"Commission 9s determinat ion here is not to be con¬\nstrued as defining or limiting the future needs for and uses of educational\ntelevision broadcast stations. The latter is a national problem of the\nbroadest sweep and the greatest urgency,!beyond the scope of the instatt\nproceeding.\" \\nr jp ths ra\nA! rc KOWAVt\nNAEB ASKS FOR EXTENSION IN MICRWAVE HEARINGS\nIn order to permit further engineering study and consultation with\ni nterested member stations, the NAEB has requested the FCC to extend the\ndeadline for filing comments in the microwave proceedings to October 1\nAFTRA-WNDT NEGOTIATIONS\nThe NAEB has issued a \"position paper\" to all ETV stations relative\nto the recent AFTRA action against WNDT, New York City. The NAEB paper points\nout that there has always been a general recognition that ETV is, by its\nvery nature, different from commercial television, and that understanding\nof this basic difference must continue to influence the future course of"
}