{
  "id": "d1080-4",
  "text": "under which our educational stations have labored in the past has been the dif¬\nficulty in any given locality of producing a sufficient amount and variety of\nprogram material. In the large metropolitan centers only, probably do we have\navailable a sufficient talent to give the richest possible programs.\nUnder the plan we propose, hrrwever, all public service stations, that is,\nstations that are nonprofit in character, that are endeavoring to put out programs\nfor public welfare exclusively, will be assured the privileges of hookup with the\ngovernment system. That overcomes one of the great handicaps under which local\nindividual stations have been working in the past.\nWe believe that that privilege, together with some others that will accrue\nin the system, will stimulate the establishment and promote the maintenance of\nlocal public service stations. If that be true, then the combination which we\nare proposing is three-fold; it is the present system with all its advantages\nand inevitable disadvantages; a government system paralleling that with its ad¬\nvantages, and perchance its disadvantages; and also a system of local stations\nlargely independent. With that three-fold sys.tem we hold that we can depend\nupon getting the best over the radio that America can produce.\nIn passing I want to call attention to this, that the instant I mention\ngovernment system I see in your faces that you are set, some of you, for or\nagainst the government system. I want to call your attention to this, that we\nare not advocating government monopoly on radio broadcasting; we are not advoca¬\nting a monopoly by anybody on radio broadcasting. In fact, we are advocating a\nplan which insures diversification and establishes, instead of monopoly, a part¬\nnership.\nWe believe that the proposal we make is in strict accord with American\nprinciples. We believe that this American government has depended very largely\nupon the interplay of controversy and of ideas between minority and majority, has\ndepended upon checks and balances, has depended upon the turmoil, if you please,\n-5-"
}