{
  "id": "d1914-0",
  "text": "NEWS NACB LETTER\nNATIONAL ASSOCIATION •' EDUCATIONAL BROADCASTERS\nFrank E. Schooley, Editor, Station WILL, Urbana, Illinois\nJune I, 1942\nVICTORY PROGRAMS ON WSUI\nStation WSUI, at the University of Iowa, begins its summer radio\nSCHEDULE ON MONDAY, JUNE 80\n“Speaking for Victory”, faculty members of the State University of\nI OVA WILL APPEAR OVER WSUI EACH TUESDAY AT 7 P.M. CHOSEN FOR THEIR\nSPECIALIZED KNOWLEDGE, THEY WILL FOCUS NEW LIGHT AND EMPHASIS ON\nQUESTIONS OF THE PRESENT WAR IN WHICH YOU AND EVERY OTHER AMERICAN\nARE INTERESTED. THIS QUARTER-HOUR PROGRAM SPONSORED BY THE COMMITTEE\non Civilian Information and Training Service under the direction\nof Professor a. Craig Baird, chairman, will select topics to provide\na WELL-IntegraCed review of the cuases snd progrrss of the current\nWAR WITH SOME ATTENTION TO POST-WAR POLICIES*\nNavy Time - You don3t find salt spray in mid-western Iowa, but you\nCAN GET THE TANG OF NaVY LIFE ON THE SMOOTH-SAILING SERIES OF PRO¬\nGRAMS ON L'SUI CALLED ”NaVY Time” * FACH FRIOAY AT I2;45 P*M», STA¬\nTION STAFF MEMBERS CONDUCT INTERVIEWS DESIGNED TO ACQUAINT lOWANS\nwith the Iowa Pre-flight Naval Unit* Navy officers discuss such\nTOPICS AS THE MEDICAL SIDE OF THE PRE-FLIGHT PROGRAM, OBJECTIVES OF\nTHE UNIT HERE, THE PHYSICAL FITNESS PROGRAM AND INFORMATION CONCERNING\nTHE CADETS*\nProblems of the War and After - An RAF reserve commissioned pilot\nPRESENTS THOUGHTFUL TALKS ON ”PrOBLEMS OF THE WAR AND AfTER” EACH\nThursday at 7 p.m* over WSUI* He is Professor Hew Roberts of the\nUniversity College of Education, who discusses the geographical and\nPOLITICAL SIGNIFICANCE OF WqRLD WAR 2 AS WELL AS THE PROBLEMS ARISING\nWHICH WILL HAVE TO BE FACED WHEN PEACE COMES*\nVictory Bulletin Board - Fast-paced, clear-cut comments on the current\nREGULATIONS AND TIMELY SUGGESTIONS OF THE GOVERNMENT BUREAUS ARE\nPOSKED ON THE “VICTORY BULLETIN BOARD11 EACH MONDAY, WEDNESDAY, AND\nFriday at 3 p.m, Joe Shtrick of the WSUI staff explains just how\nCITIZENS MAY BEST CONTRIBUTE TO THE WAR EFFORT*"
}