{
  "id": "d1914-3",
  "text": "NAEB NEWS LETTER\nPage 4\nJune I, 1942\nFCC RELAXES RULES (cont^d)\nRELAXED ITS FULES TO GRANT OPERAT8 ON PERMITS TO PERSONS CERTIFIED\nBY STATION LICENSEES AS FAMILIAR WITH THEIR RESPECTIVE BROADCAST 8 NG\nequipment Holders of these restricted radiotelephone operator permits\nWOULD BE LIMITED TO OPERATIONS AT A SPECIFIED STATION AND WOULD BE RE¬\nQUIRED TO SHUT DOWN THE STATION IN TECHNICAL EMERGENCIES UNTIL SOME\nFIRST-CLASS OPERATOR REPAIRED THE TROUBLE. An ADDED REQUIREMENT PRO¬\nVIDES THAT PERSONS OBTAINING THE RESTRICTED PERMIT WOULD HAVE TO PASS\nWITHIN SIX MONTHS AN FCC EXAMINATION ON RADIO THEORY ENTITLING THEM\nTO ENDORSEMENT OF THEIR PERMITS BY THE COMMISSION FOR SIMILAR WORK AT\nANY STATION.\nRadio engineering experts declare that women could easily meet the re¬\nquirements NOW 8 N EFFECT FOR RESTRICTED RADIOTELEPHONE OPERATOR PERMITS.\nIt IS BELIEVED THAT PERSONS OF ###£# NORMAL INTELLIGENCE SHOULD BE ABLE\nTO PASS THE EXAMINATION FOR THE RESTRICTED RAD 101E.EPH0NE OPERATORS\nPERMIT AFTER 8 OR lO HOURS STUDY OF THE FCC STUDY COURSE FOR THIS EXAMI¬\nNATION. The Study Guide and Reference Material for Commercial Radio\nOperator Examinations may be obtained from the Superintendent of Documents\nGovernment Printing Office, Washington, D. C0 for the sum of 15 cents.\nThis latest action of the FCC war-time policy of coming to the aid of\nBROADCAST STATIONS ON THE MATTER OF OPERATOR AND OPERATION REQUIREMENTS\nIS SPECIFICALLY DIRECTED TO THE PROBLEM OF LOW-POWEREO BROADCAST STATIONS\nOPE RAT ING ON FREQUENCIES ASSIGNED FOR LOCAL SERVICE. THERE ARE 441\nLICENSEES BENEFITED BY TOOAY^S ACTION. EARLIER FCC RELAXATIONS OF\nOP£RATOR REQUIREMENT RULES WITH RESPECT TO BROADCAST STATIONS WERE MADE\non February 17, 1942 under Order No. 9! and again on April 21, 1942\nunoer Order No. 91-A.\nSCHOOL BROADCAST CONFERENCE SET FOR NOVEMBER ^\nThe Mid-West School Broadcast Conference will be held November M-13 in\nChicago, according to word received from George Jennings, Director of\nthe Chicago Radio Council.\nWHERE TO SELL RADIO SCRIPTS\nA brochure on ”how and Where to Sell Radio Scripts” has been compileo\nby Irene M. Stupp* author of ”i Got the Job” and is bring published\nby the Thesis Publishing Company, 108 Fulton Street, New York City.\nThe booklet sells for 25 cents.\nFCC ACTIONS\nWCAH, Board of Education, Buffalo, N„ Y0, applied for modification gff\nconstruction permit whkch authorized a new non-commercial educational\nSTATION. (5/19/42)\nWBKY, University of Kentucky, Beattyvslle, Ky., was granted renewal\nOF LICENSE FOR PERIOD ENDING MAY I, 1943. (5/19/42)"
}