{
  "id": "d1144-7",
  "text": "NA2B News Letter\nMarch 1, 1939\nPage Q\n“Oregon* Last spring the Oregon State Board of Higher Education appro-\npriated $1,500.00 for an extension from radio station KOAC, located on\nthe campus of Oregon State Agricultural College and operated under the\nExtension Division of the State System of Higher Education, to the Univer¬\nsity of Oregon campus. By remote control the University of Oregon\nbroadcasts one hour a day, five days a week. The appropriation was for\nthis year only, but it is hoped that the State Board will continue the\nexisting appropriation and perhaps fcncre&se the amount. Various schools\nand departments of the University are contributing programs, which are\nbuilt around a plan which gives some continuity and coherence to them.\nThere has also been introduced a course In Radio Broadcasting and Program\nBuilding. Considerable enthusiasm has been expressed by both faculty\nand students.\n“South Dakota. The regular weekly schedule of radio station KUSD is\nnow 12jHnours as compared to 8 two years ago. Almost all the time is\nfilled with scheduled programs, and transcriptions have not been used\nsince the first week of this year*8 activities.\n“Texas. In the summer of 1937 Texas University and Souther^ Methodist\nUniversity maintained radio courses in the summer school. ihese courses\nwere continued in the summer of 1938. The University is now establishing\na complete radio studio on the campus, fully equipped for broadcasting\nand for recording programs. Several fellowships for the study of broad¬\ncasting have been awarded by the Rockefeller Foundation.\n“Washington. For the last year principal Interest has been in the devel¬\nopment oF~a series of educational transcriptions and the installation of\nequipment for the making of the same. Plans for the future will Include\nsome attention to related fields of audio-visual education.\n“Washington State College, over its own station KWSC, has for years\nmaintained a very extensive broadcast program to Its region. A complete\nlocal organization is maintained, several staff raembers devote their time\nexclusively to radio programs, improvement has been made in broadcasting\nequipment .and studio quarters. Start has been made in regional cooperat¬\nion through the formation of public school committees.\n“Wisconsin. This pioneer station is steadily growing and Improving in\nIts service. In fact, there are two broadcasting stations, WHA in\nMadison with 5000 watts power day time on 940 kilocycle channel, and WLBL,\nStevens Point, 5000 watts daytime on the 900 kilocycle channel, ihe lack\nof evening time has made impossible adequate service to the adult llstenligg\ngroup, and WHA is now applying for permit to construct 50 kilowatt trans¬\nmitter to ooerate full time on 670 kilocycles cleared channel. If\nlicense is granted the 900 and 840 kilocycle channels will be relinquished.\nThe 670 kilocycle channel is now used by WMAQ, Chicago. The application\nis pending before the Federal Communications Commission. WHA has\ndemonstrated by programs over a period of years that this public service\nis highly acceptable to the listeners in this area, a demonstration of\ngreat value to the cause of civic broadcasting.\n“Wyoming. The University of Wyoming has just established a recording\nstudio on the campus. A suite of rooms has been fitted up to include"
}