{
  "id": "d1898-0",
  "text": "N A E B NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nFrank E. Schooley, Editor, Station WILL, Urbana, IlL*\nSeptember 5, 1944\nANNUAL CONVENTION* CHICAGO, OCTOBER gg and 23.\nA DECISION HAS BEEN MADE* THE ANNUAL CONVENTION OF THE NATIONAL ASSOC¬\nIATION of Educational Broadcasters will meet Sunday and Monday, October\n22 AND 23, IN THE MORRISON HOTEL, CHICAGO* 9| NCE A NUMBER OF THE MEMBERS\nEXPRESSED A WISH TO ATTEND THE SCHOOL BROADCAST CONFERENCE, IN ADDITION\nTO ATTENDING NAEB, IT WAS FELT DESIRABLE TO COMBINE TRIPS IN ORDER TO\nCUT DOWN TRAVEL AND TIME LOST*\nMembers are requested to send to the Executive Secretary suggestions for\nTHE MEETING. At THIS WRITING, THERE IS NO INTENTION TO HAVE ANY SPEAKER,\nUNLESS SOME ONE SPEAKER HAS REAL DOPE FOR U3. PLANS CALL FOR OISCUSSIONS\nOF PROBLEMS FACING NAEB AND ITS MEMBERS.\nFCC ORDERS HEARING ON POST-WAR FREQUENCY USES\nThe Federal Communications Commission will begin hearings September 28th\nTO OBTAIN INFORMATION FOR PLANNING POST-WAR FREQUENCY ALLOCATION POLICIES.\nThe announcement said representatives of industry and government will\nBE INVITED.\nThe Commission said a complete review of present frequency allocations\nIS NECESSARY BECAUSE OF RADIO ADVANCES MADE DURING THE WAR AND OF GREATLY\nINCREASED DEMANDS FOR THE USE OF RADIO.\nInformation obtained at the hearings will be considered in determining\nFREQUENCY REQUIREMENTS OF NON-GOVERNMENTAL RADIO SERVICES, THE ANNOUNCE¬\nMENT SAID, AND IN MAKING RECOMMENDATIONS TO THE STATE DEPARTMENT FOR\ninternational radio agreements and to the Inter-Department Radio Advisory\nCommittee on allocations to government radio services and to Congress*\nNA£B WILL BE HEARD AT FCC HEARING\nActing President Allen Miller named a special committee to arrange for\nHEARING BEFORE FCC ON POST-WAR USE OF RADIO SPECTRUM. ACTION WAS APPROVED\nUNANIMOUSLY BY ALL WHO VOTED IN THE MAIL BALLOT. CaRL MENZER WILL APPEAL\nAT THE HEARING*\nYOU MAY GET A SUPPLEMENT THIS MONTH, ASKING FOR HELP. If YOU GET IT,\nGIVE IT YOUR EARNEST AND PROMPT ATTENTION.\nThere will be a supplemental NAEB NEWS LETTER published under date of\nSeptember 15*\nROMANCE LANGUAGES ON WSU1\nAs LANGUAGES PLAY AN INCREASINGLY IMPORTANT ROLE IN THE WORLD TODAY,\nWSU19 University of Sow-a, will again offer several programs in romance"
}