{
  "id": "d1898-4",
  "text": "NAEB NEWS LETTER\nPage 5\nSeptember 1, 1944\nMore than 230*000 children listen to radio in the classrooms or Chicago\nSCHOOLS DURING AN AVERAGE WEEK OF THE SCHOOL YEAR, HANDBOOKS FOR TEACHERS\nGUIDANCE !N THE USE OF RADIO ARE PREPARED AND DISTRIBUTED TO EVERY CLASS¬\nROOM USING PROGRAMS a 20,000 SUCH HANDBOOKS ARE DISTRIBUTED TWICE A\nSCHOOL YEAR, Sq THAT TEACHERS MAY KNOW WHAT IS AVAILABLE FOR CLASSROOM\nLISTENING, THE RADIO COUNCIL PREPARES A WEEKLY PROGRAM BULLETIN WHICH\nLISTS ALL WBEZ BROADCASTS AS WELL AS THE SCHOOL TIME PROGRAMS OF OTHER\nSTATIONS AND NETWORKS, PM EQUIPPED SCHOOLS, OF WHICH THERE ARE NOW\nABOUT 125, RECEIVE A SPECIAL BULLETIN EACH WEEK, IN ADDITION TO THE\nSTANDARD PROGRAM BULLETIN,\nOperation of the school station is under the direction of George Jennings,\nSTATION MANAGER AND ACTING DIRECTOR OF THE RADIO COUNCIL? ELIZABETH £*\nMarshall, program director; Robert R, Miller, production head; and Emil\nH, Andresen, chief engineer,\nPAPPER URGES AIRING CONGRESSIONAL SESSIONS\nFloridans Democratic Senator Clauds Pepper, in August, introduced a\nresolution urging that the proceedings of Congress be broadcast. Pepper\nSUGGESTS THAT THE RADIO NETWORKS BE GIVEN ACCESS TO THE SENATE AND MOUSE\nFLOORSo\nIntroducing his proposal, the Florida Senator declared that millions of\nPEOPLE DEMONSTRATED THEIR INTEREST IN THE DEMOCRATIC PROCESSES BY\nfollowing the recent national political conventions by radio. Pepper\nASSERTED THAT, IN HIS OPINION, PUBLIC INTEREST WOULD BE SIMILARLY SERVED\nBY THE BROADCASTING OF CONGRESSIONAL PROCEEDINGS,\nHowever, he declared that the proposed broadcasting privileges would not\nEXTEND TO ANY GOVERNMENT-0WNEO RADIO FACILITIES,\nPepper*s resolution provides that the architect of the Capital install\nrecording or transcribing machines in the Senate and House chambers and\nTHAT COPIES OF THE TRANSCRIPTIONS BE MADE AVAILABLE TO RADIO STATIONS\nAND NETWORKS AT COST,\nPePPER8S PROPOSAL ALSO PROVIDES THAT NO RADIO STATION OR NETWORK BE\nREQUIRED TO BROADCAST ANY OF THE PROCEEDINGS AND IT ADDS THAT EITHER\nHOUSE COULD PROHIBIT BROADCAST OF ANY OF ITS SESSIONS AT ANY TIME,\n{\nCOMMISSIONER DURR PESSENTS\nFear that the radio industry may eventually be controlled exclusively\nBY SO-CALLED nWELL TO DOM PEOPLE IS EXPRESSED BY FEDERAL COMMUNICATIONS\nCommissioner Clifford Durr. As a reason for this apprehension, he points\nTO RECENT HIGH PRICES PAID FOR RADIO STATIONS.\nDurr explains his reasons for dissenting from the action of the Commission\nin approving without a hearing the purchases of stations WQXR in New\nYork, WINX in Washington, and others. He says that the prices paid\nWERE MANY TIMES MORE THAN THE NET WORTH OF THE STATIONS,\nAccording to the Commissioner, the price of about one million dollars\nPAID BY THE NEW YORK T«MES COMPANY FOR STANDARO STATION WQXR AND F-M"
}