{
  "id": "d1441-12",
  "text": "UNIVERSITY OF ILLINOIS\nJanuary 8, 1944\nFEDERAL INCOME TAX REPORTS FOR 1943\nTo Staff Members and Employees?\nEvery single person must file a Federal income and victory tax return\nfor 1943 if his gross income from all sources for the year ended December 31,\n1943 was $500 or more. Every married person, living with husband or wife during\nthe entire year 1943, must file a return if his or her gross income was more\nthan f624, or if their combined gross income was as much as $1,200 for the year.\nEvery individual who had income and victory taxes withheld from his wages during\n1943 should file a return even though he did not have as much as $500 gross in¬\ncome for that year, because he may be eligible for a refund and this refund can\nbe established by filing a return. Reports, if required, must be filed with\nthe Collector of Internal Revenue not later than March 15, 1944. Forms for\nthis report will be sent to individual taxpayers by the Collector of Internal\nRevenue or may be secured from local offices of Revenue Department agents.\nA limited supply of such forms will be available at the Bursar’s Office when\nthey can be secured, possibly within a week.\nSuggestions relating to the completion of these reports are contained\nin bulletins of the Business Office sent to staff members and employees under\ndates of December 11, 1942 and July 31, 1943. The suggestions contained in\nthese bulletins are still generally applicable. However, staff members should\nstudy carefully the new income tax fcrm and all instructions going with it,\nsince the form is considerably different and the Instructions more complete\nthan those of former years.\nNot later than January 31, 1944, the Business Office will send to\neach person in the employ of the University a statement of his compensation\nfrom the University for the calendar year 1943, and the amount of tax withheld\nfrom that compensation during the year. It is suggested that the completion of\nincome tax reports by individuals be delayed until these reports from the Busi¬\nness Office are received.\nAny questions concerning the amount of compensation or the amount of\ntax withheld should be taken up with the Bursar’s Office, first floor Admini¬\nstration Building, Telephone 161. ' All matters relating to payrolls and with¬\nholding tax are now handled by that office.\nThe Business Office will endeavor to answer routine questions con¬\ncerning income tax reports of University staff members and employees. Such\nquestions will be handled by H* 0. Farber, Senior Accountant in the Comptroller\nOffice, Room 354 Administration Building, Telephone 188. Dersons whose problems\nare in any way involved or which relate to matters other than University income\nor the more common expenses and deductions, such as questions relating to bus\nness operations or investments, should seek professional advice of local account\nants or tax counselors.\nIloyd Morey\nComptroller"
}