{
  "id": "d1441-21",
  "text": "•(2)-\nAs one of the issues scheduled for examination during the forth¬\ncoming hearings (Issue No. 7, DOCKET 6741)> the Commission proposes to\nconsider \"what new rules and regulations, if any, should be\npromulgated to govern the power and hours of opera¬\ntion of Class II stations operating on ’’clear chan¬\nnels’\".\nAll of the stations listed on the preceding page, as has been pointed out,\nnow operate on clear channels. Some of them, no doubt, would be in a po¬\nsition to provide an even more valuable service to their respective lis¬\ntening audiences if they were permitted to use higher power, or if their\nhours of operation were extended. For example, Station WOI, some years\nago, had developed an early morning program series designed specifically\nto serve the needs of rural listeners, but had to discontinue this series\nbecause of the fact that was causing interference in the service area of\nStation KFI in Los Angeles, where local sunrise time comes two hours later\nthan in Iowa. If the forthcoming hearings should result in increasing the\nhours of operation of Class II stations, it might become possible for\nStation WOI to reinstate this early morning series. In similar fashion,\nmost of the other educational stations listed would probably be able to\nbenefit, in one way or another, from any action of this kind by the Com¬\nmission. Conversely, of course, if power and hours of operation for this\nclass of stations were further restricted, the necessity for some addition¬\nal curtailment of educational-station services could be anticipated.\nAnother problem to be considered (Issues No. 3 and No. 4, DOCKET 6741)\nat the forthcoming hearings concerns the possibility of permitting dear-\nchannel stations to increase their power above 50,000 watts. If.this were\ndone, unless some other provision were made for educational stations oper¬\nating on the same channels, it is possible that the educational stations\nmight suffer serious interference from the high-power full-time stations\non whose respective ciear-channel frequencies they operate.\nStill another problem to be considered (Issue No. 5, DOCKET 6741)\nconcerns the possibility of moving some of the dear-channel stations to\nother locations. Presumably, this will mean moving them in from coastal\nlocations toward the center of the country. Inasmuch as most of the edu¬\ncational stations involved are located in the central portion of the\ncountry, moving the hig‘her-po:wer clear-channel stations into the same\ngeneral area might introduce problems of interference between the two.\nEspecially significant for educational stations operating on clear-\nchannel frequencies is Issue No. 2, DOCKET 6741> which relates to the\npossibility of placing more than one full-time station on each clear-\nchannel frequency. Affirmative action by the Commission in relation to\nthis issue might either operate to the further disadvantage of educational\nstations, or_ it might afford them an opportunity to improve their positions.\nTo illustrate one of the most likely unfavorable effects, it might\nbe possible, under Issue No. 2, to assign a 50,000-watt station on the Last\nCoast to operate on the 640-kiiocycle clear-channel frequency of beation\nKFI. At present, Stations WOI and WNAD are not permitted to go on the air\nin the morning until local sunrise time in Los Angeles, BUT neither are\nthey required to go off the air in the evening until sunset, Pacific Time."
}