{
  "id": "d1441-24",
  "text": "It will, of course, be necessary for us to fill orders\ncarrying proper government priority rating before\nany unrated orders, whether or not they are\nincluded in the listings under this plan. The opera¬\ntion of the plan will naturally be in accordance\nwith any government regulations and we reserve\nthe right to modify or change the plan if necessary\nin order to comply with such government regula¬\ntions or national policy.\nAs described above, we will prepare a listing\nof priorities (non-government) for various types of\nequipment. When we are able to manufacture\nbroadcast equipment under normal conditions, we\nwill advise you of the probable delivery date and\nfirm equipment prices. You may then send us your\nfirm order for the equipment. We will ask you at\nthat time to make a down payment of 10% of\nthe price of the apparatus. We will expect you\nto send us your order within 20 days after noti¬\nfication and if we do not hear from you within\nthat time, or if you advise that you do not wish to\nplace an order, we will remove your name from\nthe priority list and advance subsequent orders\ncorrespondingly. Having received your firm order,\nwe will provide you with a prompt acknowledg¬\nment and an indication of approximate delivery\ndate from production of apparatus allocated by\nthe Company for domestic sales. Acceptance of\nyour order will be in accordance with our\nstandard terms and conditions. It will be under¬\nstood that until such time as we have formally\naccepted your order, both you and RCA will be\nfree to cancel or decline to accept the order.\nPlease note that in providing us with the indi¬\ncation of your equipment needs you will not be\ncalled upon to make any deposit nor will we\naccept any payment until the time comes when a\nfirm order is to be placed. Your acceptance of\nthese conditions will be indicated by your signa¬\nture on the back of this form. For your convenience\nand so that you will know the details of the plan,\nwe are sending you an extra copy of this form\nwhich we suggest you retain in your files.\nWhat Kind of Equipment Will Be Offered:\nAs we have explained above, we are listing the\ntypes of apparatus which we believe will be most\nuseful to you for your immediate requirements. It\nis our intention to produce and deliver most\nurgently needed items as soon as we are in a\nposition to do so. However, you may, if you wish,\nindicate other items which you may expect to\nneed and we will be glad to consider these if\nwe can.\nIf you will consult the RCA 1941 Broadcast\nEquipment Catalog, which we believe you have\nin your files, you will find a description of the\nequipment items which we manufactured and sold\nprior to the war. We plan to supply, unchanged,\nitems which have proved under service conditions\nto be \"top-flight” designs; other units may be\nmodified to take advantage of recent develop¬\nments or improvements. We expect to keep you\nadvised from time to time of new equipment and\nwe will provide you with a description of the\napparatus we will furnish at the time we ask you\nto send us a firm order.\nInasmuch as you may not be able to indicate\nyour requirements in detail for Television or FM\nstudio equipment, we will provide you with a\nproposed listing of apparatus which you may\nmodify or change, prior to placing a firm order.\nIn case of conflicts between precedence listings\ncovering different groupings of apparatus, we\nreserve the right to use our judgment in making\nan equitable distribution of equipment.\nWe trust this plan will help you in formulating\nyour equipment requirements. Any questions which\nyou may wish to ask will be answered gladly at\nour regional offices or at our Camden, New\nJersey office."
}