{
  "id": "d1441-35",
  "text": "Federal Security Agency\nU. S, OFFICE OF EDUCATION\nWashington 25, D. C,\nJOHN DALE RUSSELL NAMED DIRECTOR OF HIGHER\nEDUCATION DIVISION, U, S, OFFICE OF EDUCATION\nJohn Dale Russell, former professor of education, University of Chicago,\nhas been appointed Director, Division of Higher Education, U. S. Office of\nEducation, it was announced today by Watson B„ Miller, Administrator of the\nFederal Security Agency. He will succeed Dr. Fred J. Kelly, who is retiring\nafter fifteen years’ service as head of the Division of Higher Education.\nDr. Russell was born in Bloomington, Ind., in 1$95. He received his\nA. B. degree from Indiana University in 1917, and his M. A. from the same\ninstitution in 1924, He attended the University of Kentucky and the Uni¬\nversity LT Chicago for graduate work on his Fh. D., wnich was awarded by\nIndiana University in 1931- He served in the Army overseas in World War I,\nDr. Russell’s career as an educator began in 1922 when he was assistant\nto the dean of the school of education at Indiana University, and also assist¬\nant director of the summer session. He left there in 1925 to become director\nof research and statistics in the Indiana State Department of Education, where\nhe remained two years. Then followed a year’s service as assistant professor\nof education and director of research at Ball State Teachers' College, Muncie,\nInd, In September 192? he became associate professor of education and assist¬\nant director of the Bureau of School Service, at the University of Kentucky,\nwhich post he held for two years. He then served for two years as assistant\ndirector of education on the Board of Education of the Methodist Episcopal\nChurch, in Chicago.\nSince July 1931 Dr. Russell has been professor of education at the\nUniversity of Chicago where he has been teaching classes in higher education,\nadministration, finance of higher education, and also supervising student\nresearch. During this period he has served as secretary of the Commission\non Colleges and. Universities of the North Central Association of Collegiate\nand Secondary Schools, which directs accrediting activities relating to in¬\nstitutions of higher learning. He. has si so served as counselor to 'the' 30D\nmember colleges and universities of the association and to a large number of\nother institutions seeking accreditation. He is widely known for his work\nin conducting surveys in the field of higher education, in which capacity he\nserved as research consultant to the New York State Education Department.\nIn June 1945, Dr. Russell was granted leave from the University of\nChicago to take the post of dean and academic adviser of the Biarritz Ameri¬\ncan University in France. In this capacity he was responsible for the selec¬\ntion of faculty members for Army university centers in the European theatre,\nand for supervising the academic program at Biarritz. He resumed his post at\nthe University of Chicago when he returned to this country this year."
}