{
  "id": "d1441-36",
  "text": "- 2 -\nDr. Russell has been a prolific writer in his chosen educational field.\nHe lias edited or is the author or co-author of more than 100 articles, bul¬\nletins or books. Some of his publications are:\nSome Factors Affecting t^e Scholastic Success of Teachers College Freshmen\n(.1927)\nReport of a Survey of Nine Baptist Educational Institutions of Kentucky (1929)\nEfficiency in College Management (193-1)\nStudent Fees as a Source of Support for Higher Education (1933)\nCollege Course Offerings in Bible and Religion (1933)\nThe Management of Endowment Funds (1933)\nPractical Methods for Reducing the Cost of Instruction in Higher Educational\nInstitutions (1934)\nThe New Accrediting Procedure of the North Central Association (1935)\nOrganization of Administration in Institutions of Higher Education (1937)\nWhat Is the Essential Nature of a Teachers College Instructional Staff?'(1938)\nCollege Accrediting Procedures,with Reference to Library Criteria (1938)\nGeneral Education in Liberal Arts Colleges (1939)\nThe Outlook for Higher Education (1939)\nThe Organization of Higher Education (1940)\nStudent Personnel Services in Colleges and Universities -(1941)\nNew Frontiers in Collegiate Instruction (1941)\nObjectives of the Master’s Degree in Education (1942)\nTerminal Education in Higher Institutions (1942)\nThe Colleges in Wartime (1942)\nEffective Utilization of the Time of Faculty Members Whoso Services Are\nNot Needed in the Wartime College Program (194.3)\nThe Financing of Higher Education in New York State (1945)\nThe Army University Centers in the European Theater. (1946)\nEmergent Responsibilities in Higher Education (1946)\nLessons from the Army Universities in Europe (1946)\nIn addition to his membership in numerous educational organizations.\nDr. Russell is a member of Phi Beta Kappa and Phi Delta Kappa.\nIn commenting on Dr. Russell’s appointment, John W. Studebaker, U. S.\nCommissioner of Education, said: \"John- Dale Russell once expressed a desire\nto be of wider service. I believe he will now have that opportunity/- in his\nnew position. I am confident that with his help this Office can provide\nincreasingly valuable assistance to institutions of higher learning. Cer¬\ntainly he has established an enviable record in his past connections, and\nwe are proud to welcome him to the nation-wide field of service.”\nDr. Russell will assume his position with the TJ. S. Office of Education\non July 1, 1946.\n(08-54317-6,300)"
}