{
  "id": "d1705-1",
  "text": "-2-\n\"VillEREASo It appears to this Society in annual convention assembled that\ncolleges, universities and other educational broadcasting sta¬\ntions have not in the past and are not now receiving fair and\njust treatment by the Federal Radio Commission, be it\nRESOLVED, That we declare ourselves positively in favor of the Fess amend¬\nment to the Radio act of 1927 to the end that 'Not less than 15\nper centum, reckoned with due weight to all factors determining\neffective service, of the radio broadcasting facilities which are\nor may become subject to the control of and to allocation by the\nFederal Radio Commission, shall be reserved for educational broad¬\ncasting exclusively and allocating when and if applications are\nmade therefore, to educational agencies of the Federal or State\nGovernments and to educational institutions charactered by the\nUnited States or by the respective States or Territories,”\nTHE QUESTION IS: WHAT IS HAPPENING IN YOUR STATE? HAVE ANY SIMILAR RESOLUTIONS\nBEEN PASSED BY ORGANIZED BODIES RELATIVE TO THE PRESENT UNPLEASANT SITUATION FAC¬\nING EDUCATIONAL STATIONS?\nIn the same letter Dr. Brackett sends a copy of a resolution adopted in November,\n1931, by the South Dakota Education Association in its annual convention. The\nfollowing is the essential part:\n\"That the South Dakota Education Issociation endorses the Fess bill protecting the\nradio rights of college and university radio stations and recommends its passage\nat the next session of Congress.”\nWe need more action ofthis kind. It behooves each of us to stimulate organized\ngroups to endorse resolutions recognizing the present serious situation. Your\nsuggestions and advice in regard to this problem are solicited.\nFROM R. D. MICHAEL, DIRECTOR OF BROADCASTING, VIRGINIA POLYTECHNIC INSTITUTE,\nBLACKSBURG, VIRGINIA: \"Replying to your rush bulletins of recent date, I am\nsorry to say that we have not received any questionnaire from the Radio Commis¬\nsion, If we do, I can assure you that we will let the Radio Commission know that\nalthough we are broadcasting over a commercial station, we pack our time full to\nthe gills with educational information. Our greatest wish is that we had more\ntime and money to extend our work along this line.\n\"Right now I am conducting a questionnaire survey over our radio audience, and the\nreplies I have received are more than gratifying. I had no idea that our education¬\nal material, limited as it is to certain specific fields, was in so much demand.\n”0f course our situation here at Blacksburg is one in which the Federal Radio Com¬\nmission is little interested; but I can assure you that everyone interested in\nradio work here on the campus is much in sympathy with the fight that educational\nbroadcasters are putting up. We only wish that we were in a better position to help\nfurther the cause.”\nFROM DEM H. M. CROTHERS, DIVISION OF ENGINEERING, SOUTH DAKOTA STATE COLLEGE OF\nAGRICULTURE AND MECHANIC ARTS, BROOKINGS, SOUTH DAKOTA: ”1 have your Rush Bulletin\nconcerning the inquiry received from the Federal Radio Commission. I ha.d already\nreturned these inquiries, ard I had indicated no time.on chain programs, no time\non local commercial and 100^ on education for Station KFDY.”\nFROM MR. E. B. McCARTY, PROGRAM DIRECTOR, STATION WHA, UNIVERSITY OF WISCONSIN,\nMADISON: \"Thank you for your rush bulletin on the questionnaire from the Federal\nRadio Commission."
}