{
  "id": "d1705-3",
  "text": "-4-\n\"May I suggest that a definite sum be contributed by each station receiving the\nmimeographed plays to cover the cost of mimeographing* I have no idea of the\nproper amount that should be charged, but, perhaps if each station would contrib¬\nute $5.00, the fund -would be adequate to carry on the work at the present.51\nFROM MR. CARL MENZER, DIRECTOR OF RADIO STATION TflSUI, STATE UNIVERSITY OF IOWA,\nIOWA CITY, IOWAt \"This will answer your letter of the 25th. I am very sorry that\nI have not prepared the paper on recording equipment as yet. I have been so busy\nwith our WSUI schedule, our new television station and the usual trouble with the\nFederal Radio Commission that I have not had time to work on it.\n\"Regarding the equipment, its cost complete would be in the neighborhood of $500.00\nThis includes a new unit complete with microphone for recording continuous programs\non either metal or celluloid and will record the full audio range required for\nmusic. It will of course be equipped with two recording lathes which are necessary\nfor continuous reproduction. If only speech is required, and that on wax cylinders\nsuch as are used in dictaphone recording, I have equipment which mil cost a great\ndeal less and will be entirely satisfactory.\n\"The above prices are approximate and are based on the production of a single unit.\nIf any amplifying material is available as well as microphone pick-ups, the cost\nof recording lathes only will probably not amount to more than $150.00 or $200.00,\"\nNOTE: This is a portion of a letter dealing with equipment for recording of radio\nprograms. All educational stations could use equipment sponsored on circuit. I\nam wondering how many stations would be interested in contributing to a fund to\nhave equipment of this type purchased for the Association in order that programs\nmight be recorded to send out over circuit of member stations. Please give re¬\nactions relative to the proposition. Mr. Menzer has promised to supply this of¬\nfice with an article he is writing at the present time dealing with the problem\nof recording. This will be sent out as a special bulletin to member stations as\nsoon as it is received.\nSEECIAL NOTE: Will you please supply Mr. 0. M. Eittreim of Radio Station KWLC,\nLuther College, Decorah, Iowa, with the information requested in the letter below.\nPlease give this immediate attention in order that he may learn of the experiences\nof other station officials relative to G. 0. 116. His letter reads as follows:\n\"Can you give us any information in regard to what the stations of your Association\nare doing in the matter of installing apparatus to comply with the provision of\nG. 0. 116 requiring a frequency monitor?\n\"Y*e had planned to build one at KWLC, but it seems from the latest bulletin of\nthe Commission regarding the basis on which such apparatus would be approved or\ndisapproved, that we are obliged to purchase a commercial unit. Any data you can\nsupply will be appreciated.\"\nFROM MR. H. IMBERGER, CHAIRMAN, RADIO COMMITTEE, ASSOCIATION OF LAND GRANT COLLEGES\nAND UNIVERSITIES, KANSAS STATE COLLEGE, MANHATTAN, KANSAS: \"I notice your special\nrush bulletin, ’The Question is Shall Educational Institutions Sell Time Commerce ■-\nly?\n\"Our institution has not to my knowledge been approached by commercial interests\nin an endeavor to get our station to divert time to commercial broadcasting. I\nam very much interested in -the letter of Director A. M. Harding of the University\nof Arkansas to Dean Paul L. Vogt of the University of Oklahoma. This is, in my\nmind, a most definite influence exerted by the Federal Radio Commission to give\npreference to commercial broadcasting."
}