{
  "id": "d1492-1",
  "text": "resulted in continual encroachment of\ncommercial stations on the privileges of\neducational stations, and the number of\nbroadcasting stations operated by gov¬\nernmental agencies or educational insti¬\ntutions has diminished from one hun¬\ndred and five in 1926 to fifty-eight in\n1931.\nFrequently the Commission declines\nto grant a license on the ground thaC it\nwould exceed the quota of facilities al¬\nlotted to the state or zone in which the\nstation is located, yet one zone is more\nthan one hundred percent over quota\nbecause of the number of commercial\nstations licensed.\nThe law states that radio facilities\nshall be divided equally among the\nstates and zones with respect to chan¬\nnels, time, and power, yet the Commis¬\nsion ruled that the power of a station\ncould be increased from 5000 watts to\n50,000 watts without affecting the quota\nof the state or zone. This favors the\nlarger stations, which already have clear\nchannels, and tends to drive out educa¬\ntional stations.\nReaction — The following reports\nfrom colleges show what has happened:\nOur station is sharing time on six hundred\nkilocycles with another station. The channel\nassigned would be quite satisfactory were it\nnot for the interference. A beat with the car¬\nrier of the other station vitiates all efforts to\nreach listeners beyond a radius of forty miles\nfrom the station.\nOur station has been on the air since 1922,\nbut during the past three years we have had to\nshare time with three other stations, two of\nthem being educational stations. We find that\nit has been very difficult to get a different fre¬\nquency assignment due to the fact that com¬\nmercial stations have been able to get the best\nwavelengths available.\nThe history of our 100-watt station has its\npathetic chapters also. We came on the air but\na few years after KDKA and therefore belong\nto the earlier group of stations, but we have\nbeen buffeted and shifted around until we find\nourselves in a frequency group where it is al¬\nmost impossible to be logged five miles distant\nafter seven PM. A recent order of the Federal\nRadio Commission compelled a considerable\nexpenditure of money which we could ill afford\nin order to prevent what seemed an inevitable\nrefusal of our license. That seemed like rather\ncurt and summary treatment of a station that\nshould at least have a few priority rights.\nWe have never complained to the Federal\nRadio Commission regarding assignments, be¬\ncause that is an expensive procedure, and we\ndo not have the funds to do so. Twelve hun¬\ndred and ten kilocycles is a very crowded\nchannel, and has made reception by alumni in\ndistant points (under best conditions, rare) im¬\npossible. Also, we do not find it nearly so con¬\nvenient to share time for the reason that we\nfrequently have good lecturers and musicians\ncome to our college on evenings that must be\ngiven over to the other station. Our program is\nseverely handicapped because of the necessity\nof sharing time.\nWhen the present Radio Commission took\noffice in March, 1927, we were assigned to a\nfrequency along with seventeen other stations.\nAbout May one, the same year, in the realloca¬\ntion our station was put on the same frequency\nwith another station, but with no requirement\nfor time division. The other station would not\ncompromise, hence, we heterodyned each other\nfor two months and then our station was\nshifted, dividing time with a commercial sta¬\ntion and with another station in the back¬\nground. On December 1, 1927, our station was\nrestricted to daylight operation because of in¬\nterference. On November 11, 1928, our station\nbegan the present time division with another\nstation, our station being allotted one-seventh\nof the time. This plan worked out quite satis¬\nfactorily until the other station asked for full\ntime. After three months of negotiations in an\nattempt to solve the difficulty without a hear¬\ning we were compelled to attend a hearing at\nWashington. No decision has yet been rendered\nnor has the referee made his report. In the\nmeantime, both stations continue to divide\ntime on the same basis. However, the after-\nmath of the hearing has been injurious to our\nstation. The other station is taking a very\nselfish attitude, refusing to grant the usual\ncourtesies and seemingly has adopted a pro¬\ngram of injuring us, so far as our radio audi¬\nences are concerned, and the flexibility of our\nprogram, at every opportunity.\nIn spite of the fact that the university radio\nstation is the only one belonging to the people\nof the state and is the only means that we\nhave of taking to the public the great wealth\nof material which is here in the form of educa¬\ntional talks and lectures, as well as the various\nmusical treats, athletic contests, etc., we have\nbeen handled worse than the proverbial foot¬\nball by the Federal Radio Commission.\nWe received our first license to broadcast in\nMarch, 1922. We used that frequency until\n1925, and then were assigned to another. When\nthe new broadcasting structure, to become ef¬\nfective November 11, 1928, was first proposed,\nwe were assigned to share time with two other\nstations. But before we could arrange a time\ndivision with those two, we received another\ntelegram from the Commission saying that we\nwere reassigned and would share with two\nother stations.\nWe were satisfied with this assignment, but\nimmediately three commercial stations applied\nto be placed on this frequency. In spite of the\nfact that a clear statement was made in our\nbehalf at the hearing in Washington and in\nspite of the fact that we require only on the\naverage of one and one-half to two hours a\nday, this frequency has been assigned to its\npresent holders, and we were put on a Cana¬\ndian frequency, just twenty kc away from\ntwo stations, and with only 250 watts night¬\ntime power. One of the stations uses 5000\nwatts and the other 50,000 watts. As a result,\nbecause the frequency on which we broadcast\nis so close to the one on which our powerful\nneighbors operate, we are overpowered by\nthem in many localities.\nSince the Radio Commission has been in\ncontrol, this station has been assigned to a\nnumber of wavelengths and in general each\n[92]\nwas less satisfactory than the preceding one.\nIn all cases we have divided time with com¬\nmercial stations. In some cases the commercial\nstations were given the preference in selection\nof time. . . .\n. . . The station has been kept going\nmainly in the hope that at some future time\nmore favorable treatment of college stations\ncould be secured.\nAll and all, we do not have much complaint\nto offer.\nIn our endeavor to better the position of\nour station we have kept up negotiations with\nthe Commission for over two years but so far\nwithout finding relief. . . .\nThe strategy of the industry was\ntraced. One of its dominant leaders had\nstated in a public address during the in¬\nfancy of broadcasting that eventually\nthere would be but half a dozen high-\npower broadcasting stations, which would\nserve the entire country. The fact that\nthe number of stations multiplied until\nthere were hundreds appeared to be re¬\nlated to the fact that this man’s com¬\npany found it profitable to manufacture\nand sell transmitting equipment as well\nas radio receivers, and to issue licenses\nto other manufacturers, for the use of its\npatents, on terms to which the licensees\nfrequently expressed violent objections.\nCommission yields—When there\nwere well over six hundred stations\nbroadcasting, the Commission yielded\nto the point of view of this dominant\nradio group and cleared forty of the\nseventy-nine broadcasting channels used\nexclusively in the United States, award¬\ning them to individual stations, the ma¬\njority of which were associated with this\ngroup. The college stations were among\nthe more than five hundred and fifty sta¬\ntions that were forced to crowd into the\nremaining thirty-nine channels. One of\nthe pioneer college stations found itself\non a channel with fifty-one stations\nbroadcasting advertising and amuse¬\nment.\nThere followed a demand for higher\npower from the stations favored by the\nforty clear channels. The maximum per¬\nmitted at the time by the rules of the\nFederal Radio Commission was 50,000\nwatts, and that was all these favored\nstations asked. When the engineers got\ntheir heads together, however, they\ntalked of powers of the order of 1,000,000\nwatts, which they expected to use as\nsoon as the rules of the Commission\ncould be changed. One station secured\npermission from the Commission to ex¬\nperiment with amounts of power far in\nexcess of 50,000 watts.\nA gentleman who, after a term of\nservice on the Commission, became affil-"
}