{
  "id": "d1492-2",
  "text": "3\nits inefficient use of the television spectrum, and its use by one\norganization of television frequencies that could be made avail¬\nable to many different educational groups throughout the midwest\narea. In October, NAEB presented its position in oral argument\nbefore the FCC.\nDuring the year, NAEB also filed comments* supporting\neducational reservations in over half a dozen communities, worked\nwith other national associations in developing procedures for the\nestablishment of television antenna farms, assisted the FCC in\ndeveloping procedures for an educational FM allocation plan, and\ncommented on the need to establish relationships between educa¬\ntional television stations and community antenna systems. An\nNAEB-ETS/NCTA Committee is continuing its study of this matter.\n*Specific filings;\nComments of the MAE3 in the matter of the Commission's Rules\nGoverning TV Broadcast Stations to Authorize the Use of Airborne\nTV Transmitters.\nReply comments of the WASH in the matter of the Commission1s Rules\nGoverning TV Broadcast Stations to Authorize the Use of Airborne\nTV Transmitters.\nComments of the NAEB in the matter of Fostering Expanded use of\nUHF TV Channels.\nReply Comments of tne NAEB in the matter of Fostering Expanded\nUse of UHF TV Channels.\nReply comments of the NAEB in the matters to govern the grant of\nauthorizations in the Business Radio Service for microwave stations\nto relay television signals to community antenna systems, and to\ngovern the grant of authorizations in the Domestic Public Point-to-\nPoint Microwave Radio Service for microwave stations used to relay\ntelevision broadcast signals to community antenna television\nsystems.\nOpposition of the NAEE to petition of the National Association of\nManufacturers Communications Committee in the matter of shared use\nof TV channels 14 and 15 by the Land Mobile Radio Services.\nComments of the NAEB in the matter of amendment of Table of Assign¬\nments, TV Broadcast stations, (Hot Springs, Arkansas).\nOpposition of the NAEB in the matter cf Amendment of Table of\nAssignments, TV Broadcast Stations (Evansville, Indiana and Hatfield\nIndiana-Owensboro, Kentucky)."
}