{
  "id": "d1492-3",
  "text": "4\nThe Association also participated in hearings before the House\nWays and Means Committee to advocate the elimination of excise\ntaxes temporarily on all-channel television receivers.\nPUBLICATIONS\nThe NAEB maintains an active publications program, and this\nyear provided its members and the educational community at large\nwith the following new materials:\nInstructional Broadcasting. Proceedings of the NAEB\nConference at the University of Illinois, May 13-15, 1963.\nStandards of Television Transmission (Factors affecting\nmicrowave relay and closed-circuit transmission of educational\nmaterials, June, 1964.)\nImprovement of Teaching by Television. Proceedings of\nthe National Conferenceo£ the National Association of Educational\nBroadcasters at the University of Missouri, March 2-4, 1964.\nUHF Television Channel Assignment Plan, October, 1963,\nand Supplement.\nReport of the NAEB Study on the Proposed Expansion of\nthe Midwest Program on Airborne Television Instruction, March,\n1964.\nAn Educational Television Plan for North Central, Iowa\nand South Central Minnesota, October, 196 4^.\nSix Journals, eighteen Washington Reports, President’s\nMemos on the Copyright Law Revision and twelve monthly Newsletters.\nMEETINGS\nThe NAEB staff spends approximately 60 per cent of its\ntime meeting with its members (individually and in groups) with\ngovernment departments, legal advisors, and executives of other\nnational associations. The meetings provide NAEB members with\ncurrent information about group activities in other areas that\npotentially support or inhibit the interests of the members, and\nthe meetings provide other associations with information about\neducational broadcasting’s needs and requirements.\nThis year, NAEB staff was involved in over 900 such meetings,\nin approximately 65 cities across the country, and in six other\ncountries. In Washington and New York, NAEB staff met with\nvisitors from over two dozen countries and assisted many of them"
}