{
  "id": "d1079-0",
  "text": "PROPOSAL FOR SUPPLEMENTAL PUBLIC RADIO BROADCASTING SYSTEM*\nI am appearing before the Federal Communications Commission this morning\nbecause of my position as Chairman of the Radio Committee of the National Associa¬\ntion of State Universities, representing that organization of educational institu¬\ntions. I am Vicechairman of the National Committee on Education by Radio, which\nexplains my appearance here this morning on behalf of that organization.\nThe National Committee on Education by Radio is composed of representatives\nof nine great educational associations that are national in scope:\nThe National Association of State Universities\nThe National Catholic Educational Association\nThe National Association of Educational Broadcasters\nThe National University Extension Association\nThe National Education Association\nThe Jesuit Educational Association\nThe National Council of State Superintendents\nThe National Association of Land-Grant Colleges and Universities\nThe American Council on Education\nYou will realize that these are great national agencies and that back of\nthem there are millions of American citizens interested in this thing we call\nradio.\nThis Committee was called into being at the suggestion of the United States\nCommissioner of Education. Those educators have long seen the implications and\npossibilities of talk at the nation’s fireside which reaches young and old,\nliterate and illiterate, reaches them all alike instantaneously and in very\nintimate fashion in their homes. We have seen in this an opportunity for great\nservice to America and particularly to America as a nation that is dependent upon\nthe accuracy of the general information received by the public, upon the attitudes\nof the public, upon the judgment made by the voters. We have seen that there are\ntremendous implications and possibilities in this new medium of communication.\n* Presented at the Hearings before the Federal Communications Commission,\nMay 16, 1935, by Dr. Arthur G. Crane, President, University of Wyoming; Chairman,\nRadio Committee, National Association of State Universities; and Vicechairman,\nNational Cbmmittee on Education by Radio."
}