{
  "id": "d1079-1",
  "text": "- FMBI VOL. 2, No. 16\nPage 2\nFM REQUESTS PASS I4.OO MARK\nNine new requests for FM stab ions, filed with the FCC this week brou^it the\ntotal of applications on file to 505. The new applications follow:\nLYNCHBURG BROADCASTING CORPORATION, Page street between Morgan and Mount.\nView, Lynchburg, Virginia, for the Lynchburg area. Studios, Allied Arts Building,\nLynchburg5 transmitter, high peak in Tobacco Row range, north of Lynchburg; fre¬\nquency/ 58,700 kc; coverage, 29,530 sq.mi.; max. rated power, lOkw(RCA); estimated\ncost, $55,500; link, wire line, 12 miles; antenna, six-bay turnstile (2.06) on 68-\nfoot tower or mast to height of 100 feet above ground, 3,033 feet above sea level;\nradiation, 50,300 watts; population, 1,10-0,567; applicant licensee of WLVA.\nREVIEW PUBLISHING COMPANY, 28-32 South Linden Avenue, Alliance, Ohio for the\nAlliance area. Studios, to be determined in Alliance; transmitter, two miles south\nof center of Alliance; frequency, 57,100 kC; coverage, 2,675 sq.mi.; max. rated power.\n250 watts (GE); estimated cost, $23,550; link, to be determined; antenna, two-bay\ncircular (1.29) on 100-foot tower to height of lU2 feet above ground, 1,367 feet\nabove sea level; radiation, 395 watts; population, 31$,657•\nWSK BROADCASTING STATION, Nashville Trust Building, Nashville, Tennessee,\nfor the Nashville area. Studios, same; transmitter, Draughon Mountain, Brentwood,\nTerm.; frequency/ 56,100 kc; coverage, 16,000 sq.mi.; max. rated power, 10 lew;\nestimated cost, $91,000; link, undetermined, 8,4 miles; antenna, four-bay circular\non 310-foot tower to height of 392 feet above ground, 1,592 feet above, sea level;\nradiation, 30,000 watts; population, same as WSM-FM.\nROANOKE BROADCASTING CORPORATION, Shenandoah Life Building, Roanoke, Virginia,\nfor the Roanoke area. Studios, 301 First Street, Southwest, Fcanoke; transmitter,\nwest side of U.S.Route No.221 near Airpoint, Va.; frequency, 57,100 kc; coverage,\n3U,350 sq.mi.; max. ratted power, 10 kw; estimated cost, $56,000; link, relay, 13\nmiles; antenna, six-bay turnstile(2.06) on 150-foot tower to height of 231 feet\nabove ground, 5,06l feet above sea level; radiation, 38,200 watts; population,\n1,969,900.\nTHE HAVERHILL,GAZETTE COMPANY, 179 Merrimac Street, Haverhill, Massachusetts,\nfor the Haverhill area. Studios, to be determined in Haverhill; transmitter, north¬\nwest of Haverhill; frequency, 56,500 kc; coverage, U,350 sq.mi.; max. raibed power,\n1 kw (WE); estimated cost, $28,725; link, wire line, 1.5 miles; antenna, four-bay\nturnstile (1.65) on steel tower to height of 325 feet above ground, 66h feet above\nsea level; radiation, 2,750 watts;- population, 678,650.\nEVERGREEN BROADCASTING CORPORATION, 2102 Smith Tower, Seattle, Washington, for\nthe Seattle area. Studios, same; transmitter, same; frequency, 55,000 kc(?); cov¬\nerage/1,865 sq.mi,; max, rated power, 3 kw(GE); estimated cost, $37,300; antenna,\nfour-bay circular (1.86) on 508-foot building to height of 558 feet above ground,\n588 feet above sea level; radiation, 10,350 watts; population, 626,700,\nJAMES R. DOSS, JR., P.O.Box 5, Tuscaloosa,Alabama, for the Tuscaloosa area.\nStudios, to be determined in Tuscaloosa; transmitter. Broad and 25th Avenue, Tus¬\ncaloosa; frequency, 56,300 kc; coverage, 3,560 sq.mi.; max. rated power, 1 kw(RCA);\nestimated cost, not given; antenna, four-bay clrcul-ar (1.86) on 200-foot building\nto height of 290 feet above -ground, 510 feet above sea level; radiation, 3,120 w.ntts\npopulation, 155,307. Applicant licensee WJRD,\n2 - 16 - 367"
}