{
  "id": "d1079-10",
  "text": "a choice between tweedle-dum and tweedle-dee? What choice have you unless you\ncan select from a wide range of programs? Many of the alleged surveys of listener\nreaction and choice have resulted in their saying, f,Yes, I like program A better\nthan programs B and C,\" but all they had to choose from was A, B, and C, and it\ndoes not at all approach the question of whether there might have been a program\nof some other kind that would have been preferred. Therefore, we believe that\nthis three-fold system of the private chains, the government chain, and the local\nstations will, in all probability, afford the richest variety of program material.\nCanada Coasts that one of the chief benefits of her system has been making\nknown to Canada her own resources in the talent and genius of her own people,\nthat it has raised and improved the unity of the Nation and given a clearer\nrealization of Canadian talent.\nIn America we want to bring to the top for the benefit of all the people the\nbest that America can produce in music, in statescraft, in information, in service,\nin all the material that can be put out on the radio. We want to do that in order\nto improve the listener’s choice, and I hold that the combination system is\nlikely to bring out more completely America’s genius than any single agency of\nbroadcasting.\nI wish to speak last of the safeguarding of the freedom of speech. America\nis trying an experiment. Other nations which have tried the experiment of popu¬\nlar government in the last decade have seemingly given up in despair and gone\nback to some autocratic form of government. America still persists in her effort\nand her loyalty to government of, for, and by the people, basing her faith largely\nupon, first of all, free thinking, the right of each man to think through and make\nhis own decisions on questions affecting himself and the public. However, free\nthought is of little value without the privilege of free speech, and what is radio\nbut free speech, an instrument which makes vocal the voice of a nation, and if that\nopportunity is not free than we have a restriction of the freedom of speech. We\n-11-"
}