{
  "id": "d1079-7",
  "text": "that have proven themselves trustworthy,\nI think that America at large has great respect for her judiciary, and I ask\nyou, is it not possible that in a thing as vital to American life as radio broad¬\ncasting we can be equally successful in selecting trustworthy officials?\nI wish briefly to call your attention now to the service which such a govern¬\nment system could render and also to call your attention to the fact that much\nof this service is difficult if not impossible of rendition at the present time.\nI am a public school man and consequently I am familiar with the public\nschool situation, but let me say this, that not only public but private schools\nare alike in this situation, and I speak for one as much as for the other.\nI can not forsee how America, judging by her past practice and standards can\npermit the entrance into the schools of radio broadcasting if it is sponsored by\nand paid for by advertisers. No matter how commendable the thing advertised may\nbe, the competitors of that particular firm are going to object to the exploita-\nand sale\ntion of a public institution supported by everyone’s taxes- for the promotion/of\nanybody’s product. If that is true, then the service to the schools, public and\nprivate, is largely denied any private broadcasting system, but a public system,\ncontroled by the same public that controls the schools, both public and private,\ncan very properly be permitted to enter those schools with school programs.\nIn the state of Wisconsin, where state broadcasts have been made to schools\nwith the idea of not supplanting the teacher but supplementing the teacher, with\nthe idea of vitalizing the study for the young people, it has been proven that\nclasses given the advantage of the vitalized stimulating effect of frequent radio\nbroadcasts progress twenty percent faster than control groups that did not have\nthe advantages of the radio broadcasts.\nMaster teachers present programs, current events come in, the students\nlistening to men of national note tie them at once to the living world about them.\nEducation has in the past been too much tied to the past, has been fearful of\n-8-"
}