{
  "id": "d1079-8",
  "text": "coming into the everyday present and using the things about it and around it.\nEducation in the schools needs broadening, and here is a vitalizing influence that\ncan come into the remotest rural school with its few pupils, out in some of our\nmountain canyons just as it can into your metropolitan areas.\nI have seen thousands of children gathered into a single auditorium listening\nto radio broadcasts of great current events, a magnifident service, and there are\n30,000>000 of American citizens in schools this year, 30,000,000 in round numbers\nof students in schools, public and private. Here is an essential service which\nalone is sufficient to justify a governmental system with all its attendant ex¬\npense and any difficulties that it may encounter.\nWhat are some of the other possible services? Health is one of them, public\nhealth, discussions of matters relating to public health. The nation’s health is\nof inestimable value. Our medical friends are willing and anxious to present\neducational health facts, but I fear that there are times that this would interfere\nwith and perhaps make inevitable a clash with the advertisers of particular remedies,\na clash which is very likely to keep from the public the facts and the truth re¬\ngarding health*\nAll of us realize the possibilities of service the governmental system could\nrender to public business. For example, on the train the other day I listened\nto the Governor of Nebraska explaining legislation and his explanations to his\npeople certainly were valuable whether you agreed with him or whether you did\nnot.\nOur own college stations, particularly those in the land-grant colleges, have\nbeen of inestimable value in the last few years in explaining to people the various\nagencies which the Government was putting in operation for the relief of distress\nin those communities.\nThe University of Wisconsin presents broadcasts each week by members of the\nstate legislature who discuss the happenings at their state capital.\n-9-"
}