{
  "id": "d1079-9",
  "text": "The University of Wisconsin last year offered free the facilities of the state\nstation to all political parties and all political faiths, and gave them equal\nopportunity on the air. They were told, \"Go home and fix your own programs in\naccordance with the ideas of your state organizations,\" and they claim it created\nand renewed a general interest in public affairs, and that there were no diffi¬\nculties connected with it.\nWith respect to adult education, we are coming more and more to understand in\nAmerica that education is a life-long process and that there is such a thing as the\neducation of adults that must be carried on after the formal school period is ended\nThis promises in a few years to be the greatest educational activity in America.\nToday several universities in America have more students off the campus than they\nhave on the campus. Adult educatipn is an influence on American citizens which\ntranscends even their interest in entertainment.\nHow about listener benefits? The National Committee has constantly studied\nthis whole problem from the standpoint of the listener, and I submit to you that\nthere is no other possible justification for any broadcasting system except the\nrights of the listener. He pays all the bills; his interest is paramount. Nothing\ncan be said that can, by any process, apply to the vested interests of any kind\nthat will take precedence over the rights and values to the listener.\nWe find that there are millions of American citizens who desire the privilege,\nif you please, of turning the dials on their instruments to the programs that they\nknow are put out solely for public welfare, regarding which they know there is\nno suspicion whatsoever of advertising control or influence. They want that\nprivilege for many reasons. They want the privilege of turning to that type\nof program when they wish. Probably the people to whom I refer are not in the\nmajority in America, but at least they are a large, substantial, and valuable\nminority.\nWe hear a good deal about listeners* choice. What is your choice if it is\n-10-"
}