{
  "id": "d810-46",
  "text": "SOME SERVICES TO MEMBERS\nMembership in the Association for Education by Radio will entitle you to:\n1. Receive each month the Journal of the Association. This will bring you all the news of educa¬\ntion by radio. It will contain reveiws of new educational radio programs, transcriptions, and\nbooks. It will be a guide to educational radio programs.\n2. Participate in meetings of the Association, regional and national, at which important problems\nwill be discussed.\n3. Receive useful publications and bulletins which will be issued from time to time.\n4. Receive information about job opportunities and scholarships open from time to time.\n5. Charter memberships will receive the Journal of the Association for eighteen months.\nCONSTITUTION OF THE ASSOCIATION FOR EDUCATION BY RADIO\nARTICLE I—NAME\nThe name of this organization shall be the Association for Education by Radio.\nARTICLE II—PURPOSE\nThe purpose of this Association shall be to promote the cause of education by radio.\nARTICLE III—OFFICERS\nSection 1 (A) Officers of the Association shall be a President, a Vice-President, a Treasurer, and\nan Executive Secretary.\n(B) These officers, the immediate past president, and six elected representatives, one\nfrom each region as described in the by-laws, shall constitute the Executive Committee.\n(C) Not more than one of the officers, excepting the Executive Secretary, shall be\nelected from the same state.\nSection 2—Elections—Officers and Representatives\n(A) Nominations shall be by mail canvass of all members two months in advance of\nthe annual meeting. Elections shall be held by mail one month before the annual meeting.\n(B) The election slate shall consist of the three candidates receiving the largest num¬\nber of nominating votes for each office excepting that of Executive Secretary and the two can¬\ndidates receiving the largest number of nominating votes for each region.\n(C) The regional representatives will be nominated and elected by individual members\nliving in the same region as the candidate.\n(D) The candidates for office or representatives receiving the plurality of votes shall\nbe declared elected.\nSection 3—Term of Service\nAll officers except the Executive Secretary shall be elected for a term of one year,\nand all representatives shall be elected for a term of three years, with two representatives' terms\nexpiring each year. (For the initial election, two representatives shall be elected for a term of\none year, two for two years, and two for three years.) The Executive Secretary shall be ap¬\npointed by the President and the appointment shall be approved by the Executive Committee.\n(Continued)"
}