{
  "id": "d1756-0",
  "text": "n\nA E B\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 28, NO. 12\nDECEMBER, 1963\nComputer Study Released to FCC\nOn November 5, 1963, the NAEB released its computer-\ndevised plan for some 2600 assignments of UHF TV chan¬\nnels. The study, for which funds were provided by the USOE,\ndemonstrates the feasibility of using digital computer tech¬\nniques for TV channel assignment. While there was consid¬\nerable preparation time necessary, the actual assignment pro¬\ncedure was conducted in a few hours. With the same basic\ndata, subsequent calculations can be made rapidly and pre¬\ncisely. Vernon Bronson directed the NAEB staff which con¬\nducted the study, and technical consultants were the Jansky\nand Bailey Broadcast-Television Division of Atlantic Research\nCorporation.\nEducational Media Council Elects\nNAEB President William G. Harley was elected vice-chair¬\nman of the Educational Media Council at its annual meeting\nOctober 7-9 in Washington. James D. Finn, DAVI repre¬\nsentative, was elected chairman, and Ben Edelman, Electronic\nIndustries Association representative, was named secretary.\nMargaret Gill, executive secretary of the Association for Su¬\npervision and Curriculum Development, was re-elected treas¬\nurer. Retiring chairman Charles F. Schuller had served in\nthat capacity since the council was organized in 1960. He\nwas re-elected member-at-large and member of the board of\ndirectors.\nPlaywriting Competition Announced\nThe Broadway Theatre League of Evansville (Indiana) an¬\nnounces its first annual playwriting competition, in which\n$1,200 will be awarded for the best full-length play submitted.\nCompetition closes March 1, 1964. Information from: Broad¬\nway Theatre League of Evansville, Inc., 116 Main Street,\nEvansville, Indiana 47708.\nScript Competitions Open\nBirmingham’s twelfth annual Festival of Arts will include\nradio and TV script-writing competitions open to amateurs\nand professionals. Radio prizes are $100 and $50; TV prizes\nare $300 and $100. No fees are attached. Entry deadline: Feb¬\nruary 15, 1964. Details from Evelyn Walker, ETV Studio,\n720 South 20th Street, Birmingham, Alabama, 35205.\nStanford Offers Graduate Scholarships\nStanford University’s department of communication is re¬\nceiving applications for graduate scholarships for 1964-65.\nJanuary 15 is the deadline for applications for the scholar¬\nships, which carry stipends from $1,410 to $2,850. Awards\n^ are for persons preparing for careers in editorial journalism,\nmass communications research, advertising and media research,\nand broadcasting and film. Write Executive Head, Depart¬\nment of Communication, Stanford University, Stanford, Cali¬\nfornia.\nNAEB Convention Postscripts\n• 814 persons attended—for the biggest NAEB convention\never. Highest previous registration was about 500 for the\n1962 meet.\n• Voting members unanimously approved the reorganization\nplan briefly outlined in the November Newsletter.\n• Representatives of the various groups under the new plan\nmet to set up procedures for election of officers for their\nrespective divisions.\n• The Individual Member thermometer at the NAEB booth\nregistered 1459 Individual Members at the close of the con¬\nvention, a gain of 55 over the 1404 shown on opening day.\n• Dates were set for the 1964 convention in Austin, Texas—\nOctober 25-28.\nEducational Radio Group to Meet\nThe University of Chicago will host a meeting on “The Fu¬\nture of Educational Radio” January 29-31, 1964, at the Center\nfor Continuing Education.\nIERT Schedules May Meeting\nThe 1964 Institute for Education by Radio and Television will\nbe May 22-24 at the Plaza Hotel in Columbus, Ohio.\nRegion III to Meet in March\nNAEB Region III members will meet March 22-24, 1964,\nin the new radio-TV building on the campus of Indiana Uni¬\nversity, Bloomington. George C. Johnson, of the I. U. Radio\nand Television Service, is general chairman of the conference,\nand two committees are planning the program and activities.\nIn addition to Johnson, members of the committees are. Local\n—Kathryn Fraser, Sidney Kraus, William Kroll, James Perry,\nand Richard Yoakam. Regional—Clifford Erickson, Chicago\nJunior College; William Ewing, Ohio State University; John\nHenderson, Purdue University; William Kroll, Indiana Uni¬\nversity; Vernon McKown, New Albany; John Regnell, WILL,\nUniversity of Illinois; and Buren Robbins, Southern Illinois\nUniversity.\nWisconsin to Host Music Directors\nMidwest educational broadcast music directors will meet at\nthe University of Wisconsin October 6 and 7, 1964. In mak¬\ning the announcement, Harry Welliver, chairman of the steer¬\ning committee planning the meeting, promised more details\nafter the first of the year. Welliver, music director at the\nUniversity of Michigan’s WUOM, was elected at the group’s\nrecent meeting at Indiana University.\nKansas, Texas, Utah: \"Alabama Not 1st\"\nThere was an item in the October Newsletter stating that\nAlabama claimed the nation’s first gubernatorial proclama¬\ntion of a state ETV week, September 9-13, 1963. Keith Engar,\ndirector of radio-TV services at the University of Utah,\nwrites that KUED enjoyed gubernatorial proclamations on\ntwo occasions—in 1958 and 1959—declaring a state educa¬\ntional television week. Harvey Herbst, station manager of\n1"
}