{
  "id": "d1756-2",
  "text": "faculty of the University of Michigan, and has been with\nUSIA.\n^ Ralph L. Rosnow has been named assistant professor of\ncommunication research at Boston University. He was pre¬\nviously a research psychologist with the Bureau of Social\nScience Research, Washington.\n► Thomas P. Robinson, executive director of New York\nCity’s office of cultural affairs, will become vice president\nfor university relations at New York University January 1.\nAmong the activities which he will coordinate are public\nservice radio and television programs.\n^ Sidney A. Dimond, associate professor of broadcasting at\nBoston University, has been named to the Advisory Commit¬\ntee on Education of the Governor’s Highway Safety Commit¬\ntee.\nHazen Schumacher, Jr., associate director of TV at the\nniversity of Michigan, has been appointed part-time TV\nconsultant for the university’s Center for Research on Learn¬\ning and Teaching. He will have special responsibilities for\nadvising the center on new developments in educational broad¬\ncasting and experiments with new ways for using TV for in¬\nstruction.\nSTATE AND REGIONAL\n^ WKNO-TV, Memphis, and WDCN-TV, Nashville, have\nestablished Tennessee’s “ETV network” this fall by a regular\nvideotape schedule inter-change. WDCN purchased the studios\nfrom commercial WSM-TV, Nashville, and moved in in Sep¬\ntember.\n^ The Nebraska ETV Commission assumed official status in\nOctober, at which time the nine members—representing various\neducational interests in the state—met to form plans for de¬\nveloping the seven-station state-wide network. Jack McBride\nwas named acting general manager of the Nebraska ETV\nNetwork. Licenses for all new ETV stations for which state\nfunds are used in activation are to be held by the Commission,\nthe group announced.\n^ Kentucky’s board of education has applied to the FCC for\nsix ETV stations—at Covington, Hazard, Madisonville, More-\nhead, Murray, and Bowling Green.\n^ New York State’s Division of Educational Communications\nhosted a meeting October 29 of the state’s nine ETV coun¬\ncils—to discuss the latest developments in the ETV plan. Coun¬\ncils are presently located in Buffalo, Rochester, Watertown,\nCorning, Syracuse, Binghamton, New York City, Schenec¬\ntady, and Long Island.\nINSTRUCTION\n► Radio programs, broadcast over WABE-FM, are being\nused to supplement the TV Spanish course for fourth-graders\nin Atlanta and Fulton County public schools. Short radio\nlessons review the vocabulary heard on WETV during “Nu-\nestros Amigos.” WABE broadcasts the radio programs in the\nafternoon and evening preceding the broadcast for classroom\nlistening.\n^ The Alabama ETV network had to print 5,000 extra in¬\nschool teacher study guides this fall, after the original 6,000\nsupply vras exhausted.\n► St. Louis University announces a complete self-improvement\nprogram of basic education over TV. Commercial KTVI broad¬\ncasts the courses in the mornings, and the educational station,\nKETC, broadcasts them in the afternoons.\n► This fall, for the first time, the Richmond, Virginia, schools\nused TV for the annual convocation of school personnel. Some\n1900 teachers, principals, supervisors, directors, and consultants\nviewed the program in sixty schools. Reactions have been\nfavorable, with such comments as: “Could hear every word\ndistinctly” (as opposed to difficulty in the large auditorium where\nconvocation has traditionally been) ; “Enjoyed close-ups of the\nspeakers and the feeling of intimacy such close-ups gave”;\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W„ Washington, D. C., 20036. Phone 667-6000. Area Code 202.\n“Saved so much time” (in not driving to the meeting and back\nto school).\n► Heath deRochemont Corporation has completed arrangements\nwith the Pasadena (California) board of education for rights\nto distribute their televised course in conversational Spanish,\n“Una Aventura Espanola.” The corporation is publisher of the\nnationally televised “Parlons Francais” course in conversational\nFrench, which begins its eleventh year on TV this fall.\n► More than 300 hours of classroom instruction are handled\nby CCTV at Indiana University this fall. Through a system\narranged by the telephone company, students on the I. U.\nIndianapolis campus are participating in six courses originating\non the Bloomington campus, and Purdue University students\nin Lafayette see three. Purdue teaches a course viewed in\nBloomington.\n► WHA-TV, University of Wisconsin, announces that its most\nimportant major CCTV project so far began this fall when\nproduction and tape recording of a course in zoology began.\n► The University of Texas announces that during a single\nweek this fall, videotape machines there are recording and\nplaying back a total of 212 instructional and educational pro¬\ngrams. Five years ago, the total for the entire year was 190.\nThe 212 figure does not include about 25 live productions to\nbe aired during the week.\n► Among its National School Telecasts this fall, CBC is pre¬\nsenting a five-part series for high school students on Shake¬\nspeare’s “Julius Caesar.” The TV version consists of five half-\nhour programs, each presenting one act of the play. BBC\nproduced the programs.\nGENERAL\n^ WFSU-TV-FM, Florida State University, had its first\nopen house October 16. Schools in the county sent representa¬\ntive groups to tour the facilities, and over 800 students came.\nNearly forty members of the press and presidents of local\ncivic and social organizations saw closed-circuit radio and TV\npreviews. The open house is slated to become an annual event.\n► The Alabama ETV network’s original Birmingham trans¬\nmitter, which was replaced last August, has been permanently\nloaned to the city’s vocational high school to permit senior\nstudents in the electronics department to gain practical main¬\ntenance and operational transmitter experience.\nWFCR (FM), Amherst, has a new studio in the School of\nducation at the University of Massachusetts. The station’s\nNovember program guide carried a questionnaire to deter¬\nmine preferences and listening habits of its audience. Oper¬\nators of the station plan to originate more programs in the\nfuture from its four supporting institutions—Amherst, Mount\nHolyoke, and Smith Colleges, and the University of Massa¬\nchusetts.\n► WTSC-FM, Clarkson College, Potsdam, New York, began\noperating in November on 2.5 watts—claimed to be the least\npower for any licensed FM station in the country.\n^ KFME, new ETV station in Fargo, North Dakota, received\nits Ampex videotape recorder a couple of months ago. The\nVTR was awarded by NET through a Ford Foundation grant.\nThe station also received $10,000 worth of videotape from 3M.\n► In an article in the Los Angeles Times, it is reported that\nthe Los Angeles ETV station will go on the air in May, with\na test pattern. Actual programing is scheduled to coincide\nwith fall school opening. NBC last month announced a\n$250,000 contribution to assist in construction of the station.\n)► KLRN-TV, San Antonio-Austin, announces that a number\nof its viewers have found do-it-yourself antenna kits of value\nin obtaining better reception in certain areas of the cities.\nNoyes W. Willett, chief engineer for the station, says his\nstaff has tested the kits, available for about $5, and found\nthem to be perfectly satisfactory.\n► The licensee name for KCUR (FM) has been changed from\nUniversity of Kansas City to University of Missouri at Kan¬\nsas City.\n► Plans call for activation of a city-wide ITV system in\nRochester, New York, during the coming year.\nDECEMBER, 1963\n3"
}