{
  "id": "d1756-3",
  "text": "(4) From 1900 to July 1907, there was a 70% increase in average weekly wages of radio\nstation staff employees while the cost of living of the United States advanced 57%,\nduring the same period,\n(5) The growth of the industry has made, and--will continue to make, for rapid personal\nadvancement for those who have the Personal qualifications and possess the earnest\ndesire to get ahead,\n(6) In addition to the large monetary rewards and opportunity for advancement, the\nradio industry offers a degree of employment security found in practically no other\nfield of American enterprise.\n(7) Few American industries can boast of the high degree of labor harmony found in ran\ndio. During the first six months of 1947, only about 80 employees were affected by\nstrikes throughout the Industry.\n(8) Among the stations themselves — and not including networks — nearly fl,000,000\nwas Paid out in bonuses, June 1906-June 1907, among 223 stations with an average Of\nbetter than $4,000 per station. In addition, a high percentage of stations have\nInsurance, health and employee benefit plans for their employees.\n(9) I he physical surroundings and working conditions generally prevalent in the indus¬\ntry are on a par with the best to be found in American business. Physical Strain,\nfatigue, unhealthy working environment, hazardous Jobs and Individual worker ob¬\nscurity arising from mass employment are virtually nonexistent In broadcasting.\n(10) I he comparatively small staff of the typical radio station permits flexible employee\nrelations practices and makes possible the recognition of employees as individuals\nwith personal problems and human traits,\nSECURITY IS A HATTER OF FACT IH RADIO\nMost people want some kind of security. This means simply that Individuals want rea¬\nsonable assurance that their work and Income will have continuity, in the radio Industry\nwe already possess a degree of total employment stability far In excess of that which is\ncommon In Industry as a >hole. There Is no earthly reason why broadcasters should not cap¬\nitalize upon this fact as a means of promoting better labor relations with their ovn employees.\nThere are several reasons why the radio Industry naturally offers Its employees greater\nsecurity than Is found In other fields of American business -- and these reasons are Inherent\nIn the Industry Itself.\nFirst, the rate of growth and expansion of broadcasting itself has been very substantial.\nAs a result, from 1937 to 1946, the total full-time employees In radio doubled In number. Du¬\nring the same ten years, full-time employment In all lines of private Industry advanced 25%;\nIn manufacturing S7%; In wholesale and retail trade 27% and In finance. Insurance, real es¬\ntate and allied lines only 19%.\nA second significant factor Is the relative absence of cyclical and seasonal fluctua¬\ntions. Unlike a shoe factory, a steel mill, an automobile accessory plant, or even a retail\nstore, a radio station doesn't run part time* or even close shop during dull seasons. More¬\nover, radio's Income Is largely geared to the advertising expenditures of producers and sell¬\ners of perishable consumer goods and these, by their very nature, have relatively smaller\nbusiness cycle fluctuations than are common to the construction, steel, autanoblle and other\nlines."
}