{
  "id": "d1756-7",
  "text": "These various employee benefit plans, when properly tailored to the financial structure\nand problems of Individual stations, constitute an Important phase of good employee relations\nunder management guidance.\nNAN DOES NOT LIVE BY BREAD ALONE\nSo far, we have stressed the monetary aspects of good employee relations. But man does\nnot live by bread alone. Workers want personal recognition. They want their gripes Ironed\nout, they desire to be treated like human beings. They want loyalty from management. These\nIntangible factors are Indispensable to good station morale and employee efficiency.\nIn the typical American enterprise, the employee possesses wily a \"timecard number\"\nIdentity. This situation Is not true of radio. In few. If any. Industries Is there the\ndegree of close human relationship that Is found In broadcast stations. The typical station\nmanager and his sub-executives are not only personally acquainted with staff members, but are\ngenuinely concerned with the welfare and the advancement of their employees. Within the dally\nframework of most stations all employees are business associates — they are Jim, Dick, Dave,\nDot, Virginia, Harry and Tam, each doing his, or her, Individual Job as part of a friendly\nteam. This type of work environment Is far more agreeable than that characteristically found\nIn other Industries.\nEven where no formal grievance machinery exists, there Is generally a full opportunity\nfor all employees to \"Iron out their gripes\". Sick leave plans — whether reduced to a for¬\nmula or Improvised to meet specific cases — are tailored to the varying needs of the em¬\nployee, or stretched a point or two so as to conform with the dictates of friendly human\nrelations.\nSeldom Is the \"pink slip\" given to station employees, and when such discharges are made\nthey are practically always the result of repeated and flagrant abuses or of downright In¬\nefficiency. The actual records show that during the past year the discharge rate In radio\nwas Just about the lowest to be found In any American Industry.\nSOME FUNDAMENTAL ASSUMPTIONS REGARDING SOUND EMPLOYER RELATIONS\nThe successful and profitable operation of any business depends upon continuous produc¬\ntion, high levels of efficiency and a proper balance between costs, prices and profits. To\nachieve these necessary goals, there must be harmonious team-work among all Individuals —\nmanagement, supervisors and employees — who perform the many Interrelated tasks which make\nthe business tick. In the long run. It Is sound business policy to adopt a healthy and pro¬\ngressive employee program which establishes a high morale and positive esprit de corps among\nthe persons who contribute to the successful operation of the company.\nGood labor relations cannot be achieved by legislative flat. We cannot expect — and\nIn a system of private enterprise we do not want — governmental regulation to supplant gen¬\nuine collective bargaining. However, If collective bargaining Is to work effectively. It\nmust be a two-way street with the traffic rules applying equally to all parties who travel\nthat way.\nBusiness and labor officials should realize that government edicts can't make people\nget along with each other. Although some legislative rules are necessary to \"establish the\nboundaries of fair play\" for collective bargaining, sound Industrial relations depend upon\nthe ability of individual management and labor leaders to work out mutually satisfactory\nagreements and to find ways of \"living\" under these agreements.\nThe potentialities of healthy employee relations are plentiful in the broadcast indus¬\ntry. Radio is a good p lace to ■ work. It pays its employees very well indeed; it offers\n-8-"
}