{
  "id": "d1860-1",
  "text": "Union High School District), a junior college (San Francisco\nCity College), a state college (San Jose), a university (Cali¬\nfornia), and an ETV station (KQED-TV, San Francisco).\nA systems approach will be taken. Television will be looked\nat as a means of instructional communications against the\nbroad context of educational communications and general\naudiovisual programs.\nFor information regarding the tape recordings, write to\nKen Winslow, Head, Television Office, University of Cali¬\nfornia, Berkeley 4.\nNew NAEBers\nACTIVE\nStation KSJS (FM), San Jose State College, San Jose, Cali¬\nfornia.\nAFFILIATES\nLivonia Public Schools, Livonia, Michigan; National Confer¬\nence of Canadian Universities and Colleges, Ottawa, Ontario,\nCanada.\nINDIVIDUALS\nGeorge L. Arms, Lagos, Nigeria; A. J. Briglia, Skokie, Illi¬\nnois; Stanley P. Brown, Augusta, Maine; Carl V. Bruce,\nJr., Terre Haute, Indiana; Tse-Han Chang, Taipei, Taiwan,\nChina; Dr. Hymen M. Chausow, Chicago; Richard A. Cobb,\nSyracuse; Kenneth L. Cutler, Urbana, Illinois; Mrs. Robert\nM. Dore, Brooklyn; Mrs. Leonore Elkus, Pittsburgh; Peter\nD. Freel, Windsor, Ontario, Canada; David M. Gallagher,\nNaha, Okinawa; Garnet R. Garrison, Ann Arbor; Francis\nR. Geigle, DeKalb, Illinois; Mrs. Carter Goodpasture, Wichi¬\nta, Kansas; Dr. George L. Gropper, Pittsburgh; Wiley F.\nHance, New York; William G. Hurley, Bridgeport, Con¬\nnecticut; Ralph M. Jennings, Wooster, Ohio; Miss Leontine\nRita Keane, Detroit; Robert L. Lamb, Pottstown, Pennsyl¬\nvania; Robert Larka, Milwaukee; William J. Lawler, Roches¬\nter, New York; Frank R. Leins, Michigan City, Indiana;\nRobert K. McLaughlin, Bangor, Maine; Ray B. McMartin,\nOmaha, Nebraska; Miss Camille Wold Marker, Philadelphia;\nMiss Mary Alice Mayer, Chicago; Miss Elizabeth A. Meagher,\nPhiladelphia; Miss Harriet Miller, Helena, Montana; John\nNance, Anaheim, California; R. V. Phillips, Burlington, Ver¬\nmont; Robert M. Ryan, Seattle; William M. Sarchet, West\nLafayette, Indiana; Miss Marie C. Scanlon, Newark, New\nJersey; Howard Odell Skinner, Auburn, Alabama; Dean\nF. Zuch, Long Beach, New York.\nMSU Lists Nation's ETV Courses\nMichigan State University has issued volume 9 of the Na¬\ntional Compendium of Telecourses for Credit and Other ETV\nActivities, compiled and edited by Lawrence E. McKune. Final\ntabulation of reports embracing 12,659 educational institutions\nlists 30,148 courses—8,764 science, 4,920 social science, 3,354\nlanguages, 3,194 art, 2,282 education, 2,118 English, 2,026\nmusic, and more than four thousand other designations.\nCredit enrollments totaled 2,776,984, with informal enroll¬\nments tabbed at just over 11 million.\nCompensation for teaching on TV varied greatly: 64 indi¬\ncated money, but specified no amount; 45 specified no extra\ncompensation; 38 allowed teaching load in a ratio of two\nregular classes to equal one TV class; 6, three to one; 2, four\nto one; 1, five to one-? 3, six to one; 1, fifteen to one. “Full\ntime” was designated by 6 as equal to one course on TV.\nThe 206-page book may be obtained for $4 from “The Uni¬\nversity of the Air,” Kellogg Center, East Lansing, Michigan.\nMake checks payable to Michigan State University.\nKentucky Moves Toward Statewide ETV\nThe Kentucky Authority for ETV has set in motion a plan\nwhich might make ETV available to every classroom in the\nstate by the end of 1963. O. Leonard Press, vice chairman\nof the Authority and head of the University of Kentucky’s\ndepartment of radio, TV, and films, reports that a survey\nhas been authorized to determine location of microwave sta¬\ntions for the proposed 11-channel network. $11,990 has been\nappropriated by the state for the survey, and the contract has\nbeen awarded to Collins Radio Corporation, Dallas. Cost of\nthe network has been estimated at 5.4 million dollars.\nUtah Works on ETV Plan\nA Ford Foundation grant to Dr. Keith Engar at the Univer¬\nsity of Utah underwrote a weekend conference on ETV in\nNovember, to assist the state’s educational institutions in\nworking out a coherent plan for using broadcast TV most ef¬\nfectively in education. Seventy representatives of industry,\nlabor, education, and government met for a day and a half\nof intensive discussion under the guidance of three consultants\n—James Day, general manager, KQED-TV, San Francisco;\nDr. Jack V. Edling, director of research for the Oregon\nState System of Higher Education; and Dr. Kenneth A.\nChristiansen, director of radio and TV at the University of\nFlorida.\nTotal cost of the Utah survey is estimated at $21,525,\ncounting services of personnel released from their duties at\nvarious Utah institutions to work on the survey. Engineer¬\ning research is being financed by the state department of pub¬\nlic instruction, which allocated $5,000 for the purpose. Chair¬\nman of the engineering committee is Boyd Humphreys, chief\nengineer of Utah State University television. A future con¬\nference will deal with the problems of financing ETV, under\nthe chairmanship of Dr. Arthur Browne, executive director\nof the Utah Coordinating Council on Higher Education.\nWisconsin Plans Statewide ETV\nA plan for developing and utilizing TV for education. in\nWisconsin is being considered by the state’s Coordinating\nCommittee on Higher Education. The plan provides for a\nsystem of transmitting stations, production centers, and micro-\nwave interconnections serving education at all levels. Five\nmajor transmitting stations would be added to the two now in\noperation, and two new production centers would be estab¬\nlished. Lee Dreyfus, WHA-TV general manager, chaired the\ncommittee which developed the plan.\nVOA Intern Deadline Next Month\nThe Voice of America’s intern program for 1953 is aimed\nat developing fully professional international broadcasters for\ncareers with the VOA. Positions are located at the VOA\nstudios in Washington, D. C., and are concerned exclusively\nwith the production in English or a foreign language of live\nradio broadcasts transmitted directly to foreign listeners and\nrecorded material for local rebroadcast in a foreign country.\nIn 1963, the VOA expects to hire about ten interns, at\ngrades GS-5 ($4,345 per year) or GS-7 ($5,355 per year), de¬\npending on training and experience and eligibility score on the\nexamination. Qualifications are: U. S. citizen; eligibility\nunder the 1963 Federal Service Entrance Exam; recent col¬\nlege degree in communications, journalism, foreign affairs,\ngovernment, foreign language and/or area studies, or other\nrelevant fields—preferably with an average of “B” or above;\nand a good working knowledge of a foreign language. Candi¬\ndates without the foreign language will be considered under\nsome circumstances. A voice suitable for radio broadcasting\nis also desirable. Applicants must file for exam on or before\nFebruary 28, 1963.\nINFORMATION AND APPLICATIONS\nWrite to Mr. Henry Loomis, Director, Broadcasting Service,\nUnited States Information Agency, Washington 25, D. C., for\nthe VOA Announcement of Intern and Trainee Programs for\n1963. This announcement gives detailed information on the\nprogram and specific instructions on how to apply.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. $5.00 a year, $7.50 including Washington Report.\nEditor: Betty McKenzie. Phone 333-0580. Area Code 217. Report¬\ners: Region I—Michael Ambrosino, Ruane Hill; Region II—Shirley\nFord, Lou Peneguy; Region III—McCabe Day: Region IV—Richard\nVogl.\n2\nNEWSLETTER"
}