{
  "id": "d1860-3",
  "text": "y Wisconsin School of the Air programs are to be used in\na training center in broadcasting which is being established\nby Kol Israel in Jerusalem. Arrangements stemmed from a\nvisit to Israel last August by H. B. McCarty, director of\nUniversity of Wisconsin stations WHA-AM-FM-TV.\nPROGRAMS ,\n^ This month sees the third anniversary of “Culvers Club¬\nhouse,” broadcast four evenings a week over Michigan State\nUniversity’s WMSB (TV). The series consists of a science\nlab portion on Mondays and Wednesdays, “animal corner”\nand “bookways” on Tuesdays, “scanascope” on Wednesdays,\nand a “fun time” on all three days. Thursdays, there is a\n“hobby shop,” “guest time,” and “mystery guest.” Aimed at\nchildren in upper elementary grades, the “club” has 8,000\nmembers in 28 counties in central Michigan, northern Ohio,\nand northern Indiana. About 500 letters a week are received\nfrom children under 14. Host-producer Jim Culver was film\ndirector for WMSB before he began devoting full time to the\nclubhouse series.\n^ A recent program on WTTW, Chicago, was “The Plot to\nAbolish Childhood,” presenting a panel of outstanding edu¬\ncators and child experts who discussed the pressures to which\nmodern youngsters are subjected by parents who want them\nto succeed on a social as well as an academic level. The pro¬\ngram was produced in cooperation with the University of Chi¬\ncago and the Reader’s Digest Foundation.\n^ WEDU, Tampa, this month will begin re-running its 30-\ntelecast series Americanism Versus Communism. The series\nwas first run in evening time during the fall semester. WEDU\ndeveloped the series during the summer, using a special guide¬\nbook prepared by the Florida State Department of Educa¬\ntion as the basis for the course. The guide had been prepared\nas a result of action by the Florida legislature in the spring\nof 1961 requiring the high schools of the state to present a\ncourse in the basic concepts and practices of Communism as\nthey affect the American way of life.\nI WTTW, Chicago, is telecasting a course in measurement\nand evaluation. Dr. Max Engelhart, director of the Chicago\nCity Junior College division of student examinations, covers\nthe construction and interpretation of educational tests, as\nwell as the problem of relating standardized and teacher-made\ntests to instructional objectives.\n^ Subsaharan Africa is the name of a series being offered\nover Michigan State University’s WMSB. Dr. Harm J. de\nBlij, internationally known authority on the subject and as¬\nsociate professor in geography at MSU, teaches the course,\nwhich is designed to allow Americans to learn more about\n“black Africa,” that part which lies south of the Sahara,\nwhich differs so vastly from Moslem Africa. Pictures, film,\nrecordings, and appropriate visuals—many prepared in Africa\njust prior to being used in the course—are used.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Mrs. Jacqueline Swain, Placement Serv¬\nice, at the NAEB office in Washington.)\nJanuary I—Producer-writer, with 9 years experience commercial\nradio-TV, and background in teaching profession, seeks\npermanent settlement in ETV. Because of international\nexperience with well-known radio news service, would be\ninterested in public affairs programming and teaching\nradio-TV journalism courses. B.A., Radio-TV-Journalism,\nhigh academic record; TV experience includes camera\noperation, video direction, writing and documentary pro¬\nduction. Married. Location open.\nJanuary 2—Experienced male in all phases of radio and tele¬\nvision including FCC coordination, engineering, program¬\nming, and promotion, seeks management position in\neducational television. Now producing1 Ohio State award\nwinning educational series for third year for commer¬\ncial television. Location open.\nJanuary 3—Production Manager commercial station wishes to\nget into ETV. B.A., Business Education; valid teaching\ncertificate; six years commercial experience including\nnetwork. Married, 25, family. Location open.\nJanuary 4—Radio-TV Director/Writer/Performer with 15 years\nexperience at large Eastern university desires opportu¬\nnity for position of creative challenge with appropriate\nincentives. B.A., Radio-TV; FCC First Class License; di¬\nrected and produced 15 minute network drama for past\n7 years (tape); management experience, capable of re¬\nsponsibility; 15 years on-air experience, teaching and\nstage production of classic plays and operas. Married,\nno military obligations. Prefers South or East, but will\nrelocate anywhere with right compensation; salary range,\n$8,000.\nJanuary 5—M. A. candidate in TV-Radio desires position in\nETV as producer-director, writer, any position with a\nchallenge. Age 24, single. Location open; salary mini¬\nmum $4,800. Available January 5, 1963.\nJanuary 6—News commentator and writer, as well as specialty\nannouncer seeks news (radio, TV) or specialty position.\nM.A., English Literature; speaks French, Swedish; 5\nyears experience in Europe including teaching, radio.\n37-year-old male, married. Prefers East Coast, but lo¬\ncation open; salary, $7,500 to $10,000.\nJanuary 7—ETV station manager or program director; director\nof university or board of education television operation.\nM.A., Radio-TV-Film; ETV studies at NYU Grad. School\neducation; presently employed as Director of ETV and\nAsst. Prof, at Midwestern university (includes adminis¬\ntrative, production, academic experience). Married,\nveteran. Location open; salary, $10,000 or growth po¬\ntential.\nJanuary 8—Single woman, mid-thirties, with M.A. (TV major),\ndesires position in educational broadcasting. Ten years\nexperience on camera and mike; has taught in class¬\nrooms and on air; writing, performance and production\nare areas of most aptitude and experience. Prefers ur¬\nban situation; will accept $6,000 if placed well.\nJanuary 9—Young man (22) desires work in educational tele¬\nvision. Currently working toward Masters Degree in\nTelevision Production; broad non-broadcasting experi¬\nence with children; some film production experience.\nLocation open.\nJanuary 10—ETV Producer-director, programmer, and/or col¬\nlege teacher. Recent M.S., Radio-TV. Male, age 27,\nsingle. Prefers Northeast, West Coast, or Southwest;\nsalary open.\nJanuary II—ETV program or production manager. B.A., radio-\nTV; five years experience in ETV including administra¬\ntion, public relations and \"live,\" film and video tape\nproduction. Male, age 29, married, military service com¬\npleted. Location open; salary, $6,500 minimum.\nJanuary 12—Married man, 43, wishes to make use of 20\nyears on commercial radio and 4 years in educational\nradio to return to educational radio or television field as\nmanager or assistant manager. B.A., radio broadcasting.\nPrefers West, Southwest, or Midwest; salary, $7,200 to\n$10,000.\nPOSITIONS AVAILABLE\n(In order to be considered by these institutions, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues at the time of in¬\nquiry.)\nJ-l Program Supervisor, Midwest 5,000 watt AM, 17,500 watt\nFM radio stations. Program planning, supervision and\nacquisition; coordinate all aspects of radio broadcasting.\nEducational broadcasting experience required. Midwest\nuniversity, immediate opening; salary dependent upon\nacademic background and professional experience.\nJ-2 Radio and Television Instructor to teach courses in In¬\ntroduction to Radio-TV, Radio-TV Production, Speech for\nRadio-TV; also to help plan a graduate program in this\nfield. Ph.D. required; experience in educational and/or\ncommercial radio-TV. Southern university; open Sep¬\ntember I, 1963.\nJ-3 Acedemic-Production Instructor. Instruction of three to\nfour classes, or production crews, which produce at least\ntwo half-hour TV programs per quarter for broadcast;\ninstruction of one or more sections of basic speaking\ncourse. M.A. required; commercial or educational tele¬\nvision directing and producing experience. Midwest uni¬\nversity, open September I, 1963; salary, $6,500 for nine\nmonths.\n4\nNEWSLETTER"
}