{
  "id": "d783-0",
  "text": "PRELIMINARY REPORT\nTO: Jim Miles\nFROM: Bob Johnston\nSUBJECT: NAEB Tape Network Engineering Group meeting, January 3 and k, 1952\nDATE: January 11, 1952\nGENERAL:\nThe Group meeting was quite successful, in fact, more successful than\nwe who organized it had originally expected. Much good was derived from the mere\nexchange of information, and closer cooperation in the future is, I believe,\nguaranteed. It was gratifying to observe the willingness on everyone8 s part to\nspend son© concerted time and effort in order to insure that the formulation of\nstandards for the Network will be the best possible standards which can b© de¬\nvised. Although practically everything that was proposed was agreed upon, many\nmore facets began to glow than were originally observed, and for this reason, a\ncomplete solution is not at hand. For instance, the area of electrical standards\nis very difficult to define practically, therefore there is still work to be done\non this point. On the other hand, the more simple basic standards were agreed\nupon in full. Many good recommendations came out of this conference and we can\nbegin work to carry these out® I believe everyone left the meetings much wiser\nthan he entered -them, and for this reason alone, the entire effort can be justified.\nRECOMMENDATIONS:\nEquipment: The equipment owned and the equipment on order for the NAEB\nTape Network came under discus si on 0 It was generally agreed that the quality of\nMagnecord tape recorders was not high enough to be used universally at the Network\nHeadquarters. It was thought that they were of good enough quality to be used\nin stations in the Network for playing back the Network tapes and in the Network\nHeadquarters for the more simple tasks. Therefore the continued use of Magneeord\ntape recorders for the duplication of masters and copies for the Network is\ndefinitely not recommended except where it can be justified as a delaying action\nor as a matter of expediency until some better equipment is available. Along\nthis same line of reasoning it was agreed that the use of Magnecorders for the\nmaster duplicating should be discontinued as soon as possible and better quality\nequipment be acquired. It was felt that this equipment be purchased even before\nthe acquisition of some permanent duplicating equipment, for the quality of master\nduplicating would have to be improved sometime and should be made immediately.\nIt was agreed that this equipment for master duplicating be the very finest avail¬\nable at this tin© fcr the following reasons:\nI. This is the first step in the process of making duplicates\nof a program submitted to the Network."
}