{
  "id": "d783-10",
  "text": "Mr* Seymour 8, Siegel\nVETO, Z-taicipal Broadcasting System\n2500 Municipal Building\n8«v fork 7# 8w York\nBear Syt\nSkis is to thank you for two things 1 for your willingness, and that\nof the other Executive Conmittae members, to have your setsting at i^r hotoe\nthat day when I was still convalescing from the flu; and for your invitation\nto the Borman seating. I want to case to that conference if I possibly can,\nbut it is going to be hard to do. I’m in a nesting up here the 28th and part\nof the 29th. If at all possible, 1*11 fly down for the latter part of the\nHoman meeting. These regional conferences appeal to me as idea and expert-\naont, and if X can help then in any way X shall.\nI remea&er vaguely promising to write you a letter after that\nFebruary 16 meeting at ay heme. Perhaps it isn’t necessary now, because\nBurton, so far as X can remember, reports accurately (in his minutes of the\nFebruary 15 end l£ meetings, page k) what was said. But let me say some of\nit again, a little more fully.\nThe University has no intention of trying to make policy for the\nKellogg project. That is clearly the right and responsibility of HAEB\nthrough its elected and appointed representatives. Just as clearly, the\nadministration of the project and of the project funds is the responsibility\nof the project director. He must follow and execute the policy designated by\nthe H&EB sta?ervisory committee. He must use financial procedures which the\nUniversity can audit and check, and than certify back to the Foundation.\nSo far as the University of Illinois is concerned, our intention is\nto do everything we can to make it easier — not harder — for the Mm to\nrun a successful project. If you ever find out that something the University\nis doing is making the project harder, then tell me at once. I don’t believe\nthere are any of these problem® that can’t be solved if we know and talk\nabout them.\nThe project looks to me as though it is gathering speed now and\nheaded in a direction that will make us all proud of it.\nVery best wishes to you!\nVSimh\nCCt Mr. Graydom Ausiais\nDr. Burton Faulu\nMr. Frank Schooley\nMr. Jams Mies\nSincerely yours.\n%\nWilbur Schramm\nDean"
}