{
  "id": "d1536-0",
  "text": "j N-A-E-B NEWS-LETTER\nI _ NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nJ Edited by Richard B. Hull, President\nStation WOT, Iowa State College, Ames, Iowa\n80th Congress & Radio Longer FK Licenses\n& the FBI liore Educational Stations\nTennessee radio for farmers DECT!SEP. 20, 1947 Salute to ICOAC\nCLIFFORD PURE'S CHICAGO SPEECH CAUSES DELAYED EXPLOSION\nPurrTs Remarks at Annual ff-A-3-3 Convention Cause of FBI-FCC Squabble\nCommissioner Clifford J. Durr, major speaker at the N-A-E-B annual meeting\nat the Hotel Sheraton in Chicago made a \"brilliant speech at the final convention\n\"banquet, pointing out the \"basic responsibilities that education and educators\nhavein this period of crisis to preserve the rights of free men, their basis liber¬\nties, and to extend the light of learning—a light which in some cases, has\nfailed.\nDurr expressed disappointment that colleges, universities, and schools were\nso slow about applying for the 20 educational FM radio channels set aside for\neducation’s use by the FCC, but stated his continued hope that educational\ninstitutions would seek facilities to provide more programs of education and\ninformation for the thousands of listeners to whom such radio service is not now\navailable.\nThe Commissioner also called attention to the rising tide of prejudice in\nthis country, the real and dangerous onslaughts on free press, free radio, and\nfree speech which have begun to make themselves evident. He distinguished between\nthose who cherish a genuine concern for free speech and human liberty and those\nwho falsely parade under those slogans.\nDurr pointed out that the FBI was furnishing the Federal Communications\nCommission with ’’unsolicited reports on individuals connected with radio.” He\ntold the audience that if he could tell them of the kinds of things contained\nin many of these reports ’’you would dismiss the information as baseless gossip”\nColumnist Marquis Childs Publicizes Durr’s Remarks & FBI Becomes Annoyed\nAfter an address to college students at Ames, Iowa, Marquis Childs, well-\nknown newspaper writer incorporated those remarks in his syndicated column, prais¬\ning Durr s Chicago remarks at the N-A-E-3 meeting, and characterizing him as\na champion of liberty, and describing the ’’unsoliticted” FBI reports to the FCC.\nEdgar Hoover then ordered the FBI to stop forwarding private information to\nthe FCC because Durr’s remarks made at Chicago, had not been ’’repudiated” by\nother commissioners or by the FCC itself.\n^ice-President\nJohn Dunn\nWNAD, University of Oklahoma\nNorman, Oklahoma\nTreasurer\nW. I. Griffith\nWOI\nAmes, Iowa\nExecutive Secretary Executive Committee\nM. S. Novik Seymour Siegal, WNYC, New York Graydon Ausmus, WUOA-FM, Alabama\n30 Rockefeller Plaza Carl Menzer, WSUI, Iowa Ralph Steetle, WLSO-FM, Louisiana\nNew York, N. Y. Frank E. Schooley, WILL, Illinois William Seneh, KUSC-FM, California"
}