{
  "id": "d1536-1",
  "text": "-2-\nThe FCC then in a letter by Acting Chairman Paul A. Walker on December 2\ndisavowed Durr’s recent statement, indicating that Durr’s statement was made\n\"on his own personal responsibility” and that he ”did not purport to be speak¬\ning for the Commission.” ”He has, himself, requested that we make this entirely\nclear to you,” Walker wrote on behalf of his fellow commissioners.\nFBI Resumes Sending Information to PCC\nHoover’s office announced that the practice will be resumed in view of\nWalker’s remarks. The FBI defended the practice as a vital part of its job and\nsaid it had been invaluable to other government agencies, citing as an example\nthe anonymous wartime letter accusing Major General Bennett E. Meyers of im¬\nproper financial deals when he was Deputy Air Force Procurement Chief,'\nHoover said the FBI ’’from time to time receives information that appears\nto be of interest to other federal agencies.” He emphasised that in forwarding\nit the FBI does not attempt to evaluate it or \"make recommendations or decisions\nas to the actions if any, to be taken thereon.”\nCapeheart Aks Probe of Durr-FBI Dispute\nSenator Homer Capehart’s statement was reported as follows by the Washington\nBureau of RADIO DAILY:\n\"Senator Homer Capehart (Indiana Republican) called for — and\nCommissioner Cliff Durr welcomed ~- a thorough investigation of the differences\nbetween Durr and the FBI, With the rest of the FCC attempting to remain\nneutral, Durr and FBI Director Hoover have engaged in a hitherto mild duel, which\nthreatens to become more heated if it is fanned by hot breaths from Capitol Hill.”\n\"The Country must be shocked as I am, by the brazen effort of\nClifford J. Durr to sabotage the FBI in its lawful duty and responsibility to\nuncover Communists and other disloyal persons,’ said the Hoosier Senator, a\nwealthy radio manufacturer and currently a member of the powerful Senate Inter¬\nstate and Foreign Commerce Commission. Capehart then declared that the parti¬\ncular information to which Durr referred as unsolicited from the FBI was actually\nsent over in response to a letter from Acting Chairman Charles Denny (since resign¬\ned) on November 27, 1946. ”\nDurr’s Reply\nDurr replied in a statement Friday afternoon that Capehart was not fully\ninformed, since the Denny letter was written only after receipt of a letter\nfrom the FBI venturing the charge that certain individuals seeking a radio\nlicense were Communists or supporters of the Communist cause. This information\nv/as later referred to by Durr as \"baseless gossip”,\nCapehart’s Rejoinder\n\"There are many angles to this smelly case that remains to be- cleared up\nif the confidence of the people in the FCC is not to be seriously impaired,”\nCapehart declared, charging that notall members of the FCC were shown the FBI\nreports when they arrived and dihat inadequate efforts had been made to substan¬\ntiate the reports.\nPoints To Money Spent Abroad\nThe Federal Government is spending billions to defeat Communism abroad, the\nSenator said, \"and yet the evidence unfolds daily that, in our own Government,\nhousehold Communists and their New Deal ’fellow travelers’ are being harbored"
}