{
  "id": "d1536-1",
  "text": "Presidents Page II\nNow I want to come to one matter that is a real one in our present situation,\nand one on which the Board puts high priority, and the president would like to be\nrecorded as indicating his high approval, too* That!s the matter of good programming\nfor the Network, both for regular service and for school programming. We must not\nonly keep up program standards, we must better them.\nThere are a number of things that will be done shortly, and that should lead\nto improved program service. For example, holding of engineers’ workshop-seminar\nlate this month should help in technical quality problems of recording, playbacks,\nand transmitting. The In-School committee is meeting here about same time to con¬\nsider ways and means of improving in-school programs.\nShortly, too, every member will be asked to contribute to one, two, or three\nprogram series that will be specially designed to give all an opportunity to share\nresponsibilities and glories. We’ve talked this over with Program Planning Chair¬\nman Ken Wright and we believe we can really do something about which there has been\nmuch talk, little done in the past. Now, I’m on record and you hold me responsible\nif things don’t happen.\nToo, Ken Wright will be with ETRC for a year, starting July 1, and President\nNewburn hopes to have Ken work a great deal in helping plan, produce and improve\nour Net programs. We have current grant-in—aids programs in production. We hope\nto have another series next year, too.\nIncidentally, we have some good program suggestions on file, those that have\ncome from members. You won’t need to refile, but if you have any recent, good\nsuggestions, please send them along to headquarters. It takes the help of all to\nkeep moving ahead, and I’m sure you want to do your share.\nI can’t here give a full report, that is a report in every detail. I’ve\ntried to pick out high points of Board’s considerations. Every such report runs\ninto dangers, such as failing to mention another item that is also important.\nRight you are. For example, we spent much time discussing professional advancement,\nthe status of members, improved services to members, and the possibilities of state\nand local organizations within NAEB. You, especially you who get to regional\nmeetings, can help a great deal if you’ll give consideration to such problems, too.\nI could go on and one, but we’re already past deadline, so I bid you adieu.\n—Frank E. Schooley"
}