{
  "id": "d1536-2",
  "text": "-3-\nin key positions where they can sabotage our nation’s policies. It is not surpri¬\nsing that they (the Communists) would like to control radio broadcasting stations.”\nHe called for ”a thorough investigation of the Durr affair.”\nDurr1s Pinal Statement (A repeat of his Chicago remarks)\nDurr immediately said he believed Capehart had ’’rendered a service in bring¬\ning into the open a few matters which would better have been in the open from the\"\nbeginning.” He called for full and open hearings on the whole matter. ’’Nothing\ncould be more dangerous for the American form of government” than the unwarranted\nsecrecy with which this and similar activities of the FBI are surrounded, he said,\nand added, ”if charges are to be made in secret against individuals, the accused\nindividuals should be given every opportunity to defend themselves publicly.”\n**** *****\n(REPRINTED HERE IS TEE STATEMENT ISSUED BY\nVARIETY TTEIT IT HADE A 1946 ATTARD TO DURR)\nClifford J. Durr is one of the few Commissioners in the\nhistory of the FCC who has been able to see the woods for the trees.\nBy contrast with the lawyers and engineers who have usually been\nhis colleagues, he has insisted that the decisive criterion of\nradio service is not primarily the. coverage pattern, the balance\nsheet, or the subtleties of a practitioner before the FCC Bar,\nbut what comes out of the loudspeaker; the program. It is pre¬\neminently Durr who has refused to lend his assent to Commission\ndecisions which might tend to corrode the foundations of a\ntruly free and unmonopolized radio. It is Durr who has struck\nout sharply against inflated sale prices for facilities which\nare primarily the property of the public. And finally, it\nis Durr who has not hesitated to state his position publicly\nand in lucid terms, stumping the country from end to end to\npreach the gospel of democracy in radio.\nTo the Great Dissenter of the present FCC; the guardsman of\nthe American people’s stake in the air they nominally own and\nthe most show-management-minded Commissioner on the FCC, ’’Variety”\nextends its esteem and its 1946 award."
}