{
  "id": "d1536-6",
  "text": "-7-\nKENTUCKY AFTER BACIC RADIO TAXES 0? $1,000,000\nThe State of Kentucky is seeking judgments of more than a million dollars\nin hack taxes from five radio networks and 16 broadcasting companies operating\nin the state. The state alleged that networks were public service corporations,\noperating in Kentucky, deriving income there, and that sums owed were due on\nfranchise rights, gross receipts and income taxes omitted from 1942 through 1S46.\nThe 16 Kentucky stations have paid their Kentucky income taxes but were held\nresponsible for unpaid franchise and gross receipt taxes.\nIT0‘: WE HAVE A CODE - HOW EE DON'T\nTwo commercial radio executives, Ed Breen (KVFD, Ft. Dodge, Iowa) and\nRalph Atlass (WIND, Chicago) announced that a secret ballot revealed 678 stations\nout of 1400 receiving questionnaires voted against the NAB Code of Practices\nannounced at Atlantic City.\nThe men said only 49 of those polled were in favor of the Code, and the\nremainder failed to respond. No comment has been received from NAB but their\nBoard of Directors plans to further consider the matter.\nThe NAB Code, regarded by many as \"whitewash\" job primarily for public\nrelations prestige of networks, was bitterly opposed by many small commercial\nstations who said it would put them out of business.\nThe NAB code set up standards of practice for broadcasting including time\nlimitations on commercial and bans on certain types of advertising. It was\nscheduled to go into effect February 1.\nMany critics, interested in a better American radio,felt the Code was\nessentially a negative action, and that many of the difficulties in American\nbroadcasting in a period of world crisis and bedlam ARE NOT THE SINS OF COMMISSION,\nBUT RATHER TEE SINS OF OMISSION. Bad taste in broadcasting is one thing, but\nlack of adequate public information and education is another.\nSAUL CARSON HAILS NSW YORK NON-COIEIERCIAL WNYC\nSaul Carson, formerly of Variety Magazine, currently writing the radio\ncolumn in the \"New Republic11 calls the New York City Municipal Broadcasting\nstation, WNYC, \"miraculously entertaining.\" He has recently hailed the BBC\n\"World Theater\" broadcasts over WNYC as \"the finest dramatic acting radio\nhas yet produced.\"\n*\nWNYC, under the supervision of N-A-E-B Region I Chairman, Seymour Siegel,\nagain has planned a steller winter season of musical broadcasts including the\nFrick Collection Concerts, the Julliard School Recitals, and many others,\nN—E-B station operators will do well to secure copies of WNYCs\n\"Masterworks\" bulletin for hints on make-up, sound programming, and excellent\narrangement of musical programs.\nREPORTS TIANTED ON STUDENT \"WIRELESS”STATIONS\nAn increasing number of colleges and universities report the operation\nof student-operated \"gas-pipe\" stations, \"wired stations,\" or \"wireless\"\nstations. They have proved to be a fertile training ground for future radio\nemployment in many instances. If your institution has such a project, let your\neditor know about it."
}