{
  "id": "d319-31",
  "text": "7\nThe Juries shall examine only entries Accompanied by a written\nstatement by which the Author* insofar as he is concerned* declares that,\nunder reserve of his moral right and for the sole purpose oi permitting\nthe broadcasting of his work by all the Organisations participating in\nthe Italia Prize, he authorizes tb© said Organisations, should his work\nbe awarded a prize, to proceed?\na) with the necessary translations and with the indispensable\nadaptations of the work;\nb) with the recording of the work by means of instruments suit¬\nable for the mechanical reproduction of sound with a view\nto the broadcasts provided for under c) hereunder;\ne) with two broadcasts of the work either by direct broadcast\nor in relay or by means of instruments suitable for mechanical\nreproduction. For each of these broadcasts the Author shall\nbe credited with the usual amounts paid by the Broadcasting\nOrganization for works of the same nature. No additional\namounts of any kind shall be claimable by the Author on\naccount of the fact that the work has been awarded a prise.\nIn the above mentioned statement, the Author must also declare that,\ninsofar as the entry is concerned, he is the sole owner of the rights\nof translation, adaptation, reproduction and broadcasting, otherwise he\nmust indicate the owner or owners of either one or of all of these\nrights. In the latter case, the Organization submitting the entry may\nrequest from the Author, making it a condition to be fulfilled before\nsubmitting the entry to the Juries, written authority from the said\nowners covering the points in a), b), and o) above.\n9\nShould the Jury consider that the quality of the works submitted\ndoes not justify the awarding of the prize, the amount shall be turned\nover to the reserve funds provided for in Art. 32.\n11\nAll Organizations participating in the Italia Prise are strongly\nrecommended to broadcast, if possible by their own production, the\nwinning entries, within the twelve months following the awarding of the\nPrize,\n12\nEntries submitted must have a minimum duration of 25 minutes and\nmust not exceed 85 minutes.\n13\nThe Juries for the Italia Prize and for the additional Prizes shall\nbe formed as follows?\nEach year the ordinary General Assembly, mentioned in Art. 24,\nshall form, for the following year, as many Juries as are the categories\nof entries to which the Italia Prize and the additional Prizes are to be\nawarded. The seats in the various Juries shall be divided among all\nthe Organizations participating in the Italia Prize. No Organization\nmay be appointed two years consecutively to attend on the same Jury."
}