{
  "id": "d319-9",
  "text": "COPY\nCOMMUNICATIONS RESEARCH PROJECT\nof the Broadcasting and Film Commission\nNATIONAL COUNCIL OF THE CHURCHES OF CHRIST IN THE UNITED STATES\nConducted under the supervision of Yale University Divinity School\n409 Prospect Street, New Haven 11, Connecticut\nAugust 7, 1953\nDr. George E. Probst\nUniversity of Chicago\nChicago 37# Illinois\nDear Georges\nI have just received from Dallas Smythe the report of the New Haven\ntelevision monitoring study. Naturally, I think it is a fine job\nsince my staff did it.\nThe purpose of this letter is to make sure we are entirely clear as\nto relationships between the NAEB and the Communications Research Pro¬\nject on the use of the content of this study. As you know, the Com¬\nmunications Research Project conducted and paid for the monitoring\nwork. We did this for our own purposes for use in the studies being\ncarried out in New Haven. At the close of the actual monitoring, the\nmaterial was turned over to Dallas Smythe who conducted the analysis\nand prepared the report. The Administrative Committee for the Gommun-\nications Research Project felt that since the NAEB had made all of the\nprevious monitoring studies, we should not seek credit along with your\norganization in the publication of this study. However, there was a\nfirm agreement between Dallas and me that all of the material in the\nfindings of the New Haven monitoring study shall be jointly the property\nof the Communications Research Project and the NAEB, and shall be open\nfor the use of the Communications Research Project both on a working\nbasis and for future publication in reports published by the Project.\nI have been expecting a letter from Dallas, or someone else in NAEB,\nconfirming our agreements. However, I have not had such an exchange\nof letters although I have written to Dallas outlining our understand¬\ning of the situation.\nNow we are about to begin issuing reports of the Communications Research\nProject and I do not want any misunderstanding to arise over the use\nof the data in the monitoring study. I will, therefore, appreciate a\nletter from you, written in behalf of the monitoring studies committee,\nsignifying your understanding of our mutual agreement.\nI do not suppose you get to New Haven very frequently, but if you come\nplease donH fail to drop in on me. I do not see much of Chicago either\nthese days.\nCordially yours,\nEVERETT C. PARKER, Project Director"
}