{
  "id": "d1484-0",
  "text": "U A t B H Z n S L £ J t E n\nIllinois\n<IUNE If 1946\nNAEB HOLDS IMPORTANT ^VISETir^G AT COLUMBUS\nThe Association held two business sessions irs oon'mection with the\nOPENING OF THE I 6TH ANNUAL INSTITUTE FO?I EDI CAT I ON BY RADIO AT COLUIv-iEUS\nON Fj^ioAY, May 3, in the Walnut Room til House.\nChief amount of topics considered was th^: cs: d for the expanded of\nTHE Association in behalf of all educat!of-L-y. Pv-iOADCASTERf. This need\nWAS pointed to by the report of THE .SPEGtAL QOJvC^fTTEE^ HEADED SY H.> Bo\nMcCarty of wha. It was echoed by'others of the AssocsatiO'-n, and by ctfESTs\ninvited to present their views on the PHESSIHG PROBLEP4S OF EDUCATIONAL\nRADlOo\nThe special committee headed by McCarty was thanks for its report, and\nOI8CHARQCO. IT WAS REAPPOINTED BV PRESIDENT SCHOOLEY TO CONTINUE IIS\nWORK, TO SEEK SOURCES OF FUNDS tO EXPAND THE WORN OF THE ASSOCIATION\nON BEHALF OF ALL EDUCATIONAL BROADCASTERS,‘AND CHARGED WITH REPORTING\nAT THE EARLIEST POSSIBLE DATE. COMMITTEE CONSISTED OF McCaRTY, MeN^ER,\nand Dunn.\nProposals made included those of establishing a central service office\nIN Washington, O. C^, of providing literature and consultation to all\neducational groups interested in using radio for education, of increas¬\ning MEMBERSHIPS AND FUNDS FOR CARRYING OUT THE WORK.\nThe Association also considered the propos-o rules of the FCC for the\nREGULATION OF THE NON-COMMERCIAL, EDUCATIONAL FM STATIONS* IT WAS\nAGREED TO SUGGEST ONE MINOR CHANGE IN THE CCu if. I 381 ON»S PROPOSED RULES,\nNAMELY CHANGING THE DEFINITION OF EDUCATIONAL INSTITUTIONS ELIGIBLE TO\nOPERATE SUCH A STATION TO INCLUDE GCVER^fL ilf TaL UNITS.\nMembers present included: Jensen, WGAi^ Ufold ^nqle, WHAj Morris,\nKOAC; Dunn, WNAO; Coleman, WKAR; Menzsr, WSUi^ Sandberg, KWSC; Griffith,\nWOl; Novik, New York Gi ty consultant; Paulu, KUOM; Miles, WBAA; Skornm^\nIndiana; Kent, WBEZ; Henocrson, WBAA; Miller (late of KOAC and presently\nWITH Rocky Mountain Radio Council), Leake, Oklahoma AltM; Miss Seaman,\nKFKU; Waldo Abbott, Michigan; Garweau, Kalamazoo; Siegel, WNYC|. Owen,\nMichigan; Russell Pottei^ Columbia University; Hull, WOI ; E'wiNSi, WOSU;\nAND SCHOOLEY, WILL (HELP, HELP, IF I.MiSSED YOUR NAMe).\nAlso, present during portions of the Association meetings were Commiss¬\nioner Durr, Walter Emery, and (Red) James of t:;e Commission; Franklin\nDunham and Ronnie Lundermilk, of the U. 3. Office of Education,\nDURR URGES USE OF fU\nFederal Communications Commissioner Clifford Durr says radio ^clings\nto old systems'* rather than exploit the possibiLi ties of such new\ndevelopments as frequency modulation."
}