{
  "id": "d1898-2",
  "text": "NA£8 NEWS LETTER..... ....PAGE 3..September I, 1944\n81,000; MUCH OF TH!S INCREASE CAN BE ATTRIBUTED TO THE RE—SCHEDULINQ OF\nPROGRAMS RELEASED ON STANDARD STATIONS ON STATION WBEZ AT A MORE CON¬\nVENIENT TIME FOR TEACHERS AND CLASSES.\nAttendance at lectures arranged with local Chicago service institutions,\nSUCH AS THE CHICAGO NATURAL HISTORY MUSEUM (Field MuSEUm), THE MUSEUM OF\nScience and Industry, and others which are planned to supplement broad¬\ncasts, increased from 456 for seven lectures to 1069 for eight lectures.\nMembers of the Radio Council Staff visited 308 Chicago schools and 16S\nschools participated in the Council's second semester evaluation of\nPROGRAM PROJECT. 564 DIFFERENT EVALUATION REPORTS WERE RECEIVFD ON\nCouncil broadcasts,\nNOV IK WORK AT WNVC PRAISED\nA CROWD OF 15,000 PERSONS, INCLUDING MAYOR LaGuARDIA AND FOUR FORMER CITY\nCOMMISSIONERS OF PLANT AND STRUCTURES WHO HAD SUPERVISED THE WORKS OF\nWNYC, or New York City, joined Monday night, August 14, in praising Morris\nNOV IK, DIRECTOR OF THE MUNICIPAQ BROADCASTING STATION, AT THE FOURTH\nAND FINAL EVENING OF WNYC's 20tH ANNIVERSARY CELEBRATION ON THE MaLL IN\nCentral ark. The program featured the symphony orchestra under the\nDIRECTION OF EDWIN MqArtHUR, WHILE GRACE CaSTAGNETTA, PIANIST, AND EnRIC\nMaDRIGUERA, VIOLINST, AS SOLOISTS, MaDRIGUERA, VfOLINST, AND HERMAN\nNeuman, WNYC music director, were guest directors of the symphony\norchestra.\nMayor La Guardi a stated in a brief speech that WNYC was always at the\nDISPOSAL OF THE PUBLIC AND THE PUBLIC INTEREST. The OTHER FOUR FORMER\nCITY OFFICIALS WHO PAID TRIBUTE TO NOV IK FOR THE QUALITY OF THE STATlON8 S\nPROGRAMS WERE GROVER A. W'HALEN, DIRECTOR OF CQVO; ALBERT GOLDMAN, POST¬\nMASTER of New York; William Wirt Mills, president of the Tax Commission:\nand Frederick J, H, Kracke, Chairman of the City Board of Assessors,-E5av*C\nDA jj LV\nCBS AIDS RAPIQ TEACHING PROGRAM AT MICHIGAN\nDave Owen writes from the campus of the University of Michigan: \"Saw\nMac's (McCarty's) hurrah about Wisconsin's radio doings. You might be\nINTERESTED IN WHAT i WAS ABLE TO DO AT MICHIGAN THIS SUMMER, (Of COURSE,\nWE RE INTERESTED DAVE), Gn FOUR ALTERNATE WEEKS C8S, NEW YORK, SENT\nOUT HERE TO Ann ARBOR, FIRST: Mr. HaRRY CLARK, STAFF ANNOUNCER; SECOND,\nMr. Mortimer Frankel, Associate Editor, Program Writing Department;\nthird, Mr, Charles Monroe, Staff writer; fourth, Mr. Robert Lewis Shayon,\nExecutive Producer-Director. These men lectured to our classes, and\nproduced plays of their own writing over Bob Coleman's WKAR0 Both the\nSTUDENTS AND THE FACULTY FELT THAT IT WAS A WORTHWHILE EXPERIMENT.\nWHCU WINS BILLBOARD RURAL JOB CITATION\nAnd we quote Billboard: \"Third slot among the special citations in the\nclear channel division went to WHCU, Ithaca, for doing A Rural Job in a\nCrisp, Commercial Fashion. Most small stations are satisfied if they\nCOVER THEIR OWN CITY AND THE CITIES DIRECTLY AROUND THEM, BUT WHCU\nPROVED THAT IT WAS PROMOTION-WSSE BY DOING ITS JOB IN EVERY AREA WHERE\nIT WAS LAYING DOWN A SIGNAL. TIED UP WINDOW DISPLAYS IN 60 STORES\nIN 27 COMMUNITIES AND PLACED S56 POSTERS PER STORE—WITH EACH POSTER"
}