{
  "id": "d1898-5",
  "text": "NAE8 NEWS LETTER,,.....•••.Page 6*...... September I, 1944\nSTATION WQXQ WAS ABOUT FOUR AND ONE-HALF TIMES THE NET WORTH OF THE RADIO\nSTATION CORPORATION,, He ADDS THAT THE PRICE WAS 33 TIMES THE NET PROFITS\nEARNED BY THE CORPORATION BEFORE TAXES*\nDurr refers to the five hundred thousand dollars paid by the Washington\nPost for W!NX0 He says this price was more than ten times the net worth\nOF THE STATION AND MORE THAN 24 TIMES ITS NET PROFITS BEFORE TAXES* H£\nMADE A SOMEWHAT SIMILAR ANALYSIS OF THE SALE OF STATION WJLD IN BESSEMER,\nAlabama» which was purchased for one hundred and six thousand dollars*\nSumming up his views on these various sales, Durr asks: \"Are these\nELEMENTS OF VALUE IN THE TRANSFERORS8 PROPERTIES AND BUSINESSES WHICH\nARE NOT APPARENT FROM THE INFORMATION CONTAINED IN THEIR APPLI CAT IONS?\nAnd the commissioner speculates whether the sellers are disposing of\nSOMETHING WHICH, AS HE PUTS IT, \"THEY DO NOT OWN AND HAVE NO RIGHT TO\nSELL, NAMELY, THE USE OF A RADIO CHANNEL,81\nRANDOM NOTES - Tracy Tyler, University of Minnesota, has been naive d\nEDITOR OF THE AER JOURNAL,. . ,W|B PETTEGREW, FORMER PROGRAM SUPERVISOR FOR\nWOSU HAS RESIGNED FROM HIS POSITION TO BECOME NATIONAL MODERATOR ©F THE\nJunior Town Meeting League***.Wib also has resigned as a member of the\nNAEB Executive Committee,***James Miles has succeeded Gibbs Williams as\nProgram Director at W8AA0,.„KSAC, Kansas State College, is looking for a\nfulltime radio program director** *oNat H„ Erwin, production director for\nWILL FOR PAST SIX OR SEVEN YEARS HAS SEEN NAMED MANAGER OF PRODUCTIONS\nfor WNAD, University of Oklahoma* Mat assumed new duties today,. *„Paul\nBoLMAN, CHIEF ANNOUNCER FOR WILL FOR PAST THREE YEARS HAS RESIGNED TO\nACCEPT PASTORATE OF THE OaK PARK, ILLINOIS CHRISTIAN CHURCH* PAUL 13 AN\nORDAINED MINISTER AND WHILE A MEMBER OF THE WILL STAFF PRESENTED A WEEKLY\nprogram, \"The Minister8s Scrapbook.\" Bolman will be succeeded by Nelson\nF* Norman of Harvard University on October 5o*.*Armida Koivisto of\nHibbing, Minnesota, and one of Dave Owen’s former students at the Univ¬\nersity of Michigan, will succeed Bette Nance Terry on the WILL staff as\nCONTINUITY WRITER*,•*MrS* TERRY LEFT WILL TO ENTER COMMERCIAL RADIO WITH\nWIZ£ at Springfield, Ohio.„* * John W. Dunn is now acting director of WNAD,\nUniversity of Oklahoma** *,Q»ck Hull is returning to W01, Ames, Iowa, as\nproduction director, after serving a term with Uncle Sam’s armed forces,\nDick has received an honorable d s scharge •••• Professor R, VV0 Beckman, who\nTEACHES RADIO JOURNALISM AT IOWA STATE, JOINS OWI .TODAY* « , (.TED MaNGNER,\nFOR SEVEN YEARS IN CHARGE OF THE ILLINOIS FARM HqUR ON WILL HAS TAKEN OVER\nTHE AG PROGRAMS FOR KMOX, St. LqUIS...* PAUL H. WaGNER, WHO HAS BEEN\nTEACHING RADIO JOURNALISM AT INDIANA UNIVERSITY JOINS THE FACULTY OF\nOhio University this fall*\n—Schooley"
}