{
  "id": "d183-109",
  "text": "3.- There have been many discussions regarding the type of communications head¬\nquarters should have with the general members* The Board in its wisdom saw\nfit to leave the editing of the News-Letter with the Secretaryo With this\nI have no objection at this time — later when and if we change secretaries\nit may be advisable to reconsider the whole matter. The secretary now sends\nthe copy to Headquarters for mimeographing and mailing. The Executive\nDirector has been issuing sporadically a \"Policy Letter”. This has gone\nto the Board and certain other members who have been involved with policy\ndetermination. These two approaches seem to me to be the only practicable\nones.\nPROPOSAL:- THE EXECUTIVE DIRECTOR SHALL CONTINUE TO ISSUE THE \"POLICY-LETTER”\nTO A RESTRICTED LIST. HE SHALL PREPARE A REGULAR MONTHLY PAGE FOR THE NEWS¬\nLETTER. ALL OTHER COMMUNICATIONS WILL BE IN THE NATURE OF SPOT NEWS, CORRESPOND¬\nENCE, SURVEYS, ETC., OR TO TRANSMIT SOME PUBLISHED DOCUMENT.\nNAEB KELLOGG PROJECT\n1.- All of the previous discussion of \"mechanics\" to make the association and\nnetwork run will go for naught unless we go to work at once on the listed\npurposes for which the grant was made. Briefly these are: 1. To improve\nthe quality of educational programs; 2. To improve educational station\nmanagement and to upgrade personnel; and 3* To help institutions become\nmore efficient broadcasters. The question that is left up to us is \"HOW?\"\nI re-submit the idea that the area is far too large for any one man to\nattempt an answer. It requires concentrated action on the part of a group\nfor several days. I re-submit that this group should be a visionary group\n— not too closely bound to the day to day operation of a station — and\nnot already encumbered with the responsibility of board membership. The\nNAEB Board is, in my opinion, an operational group. It should continue to\nconcern itself with the implementation of the plans we have already made\n— and leave the plans for the future to another group. Needless to say,\nany such group would be subject to Board approval before releasing their\nreport.\nPROPOSAL:- The EXECUTIVE DIRECTOR SUGGESTS THAT THE PRESIDENT APPOINT, AND THE\nBOARD RATIFY, THE FOLLOWING TO ACT AS THE PLANNING GROUP: LEVENSON, MCCARTY,\nTYLER, HUDSON, COLEMAN, AND MCCABE DAY. THIS GROUP SHALL SPELL OUT THE QUES¬\nTIONS — THE ANSWERS.TO WHICH WOULD LEAD TO THE IMPLEMENTATION OF THE THREE\nPURPOSES STATED ABOVE. THIS GROUP SHALL ALSO NAME, FOR PRESIDENTIAL RATIFICA¬\nTION, THE GROUPS WHICH WILL DISCUSS THE QUESTIONS SO SPELLED OUT. THE GROUP\nSHALL ALSO PLACE A PRIORITY ON EACH QUESTION SO THAT THE EXECUTIVE DIRECTOR WILL\nBE ABLE TO CALL FIRST GROUPS FIRST — AND GO AS FAR DOWN THE LIST AS MONEY\nWILL ALLOW. THOSE LEFT OVER WILL EE HELD FOR USE NEXT YEAR.\no- If the Board decides favorably on the above course there is one other bit\nof policy direction it should give the planning group. This in regard to\nregionally centered or nationally chosen groups. The point that must be\ndetermined is whether the following statement is true:- \"A group of\n2"
}