{
  "id": "d183-185",
  "text": "Mro Robert Co VanDuyn\nPage 2\nNovember 20, 1953\nCost of repair of the recorder 2^000<00\nCost of a new machine 10,000.00\nm ADDITIONAL SUPPLY OP TAPES0 Although the NAEB annual\nprovides for th© replacement of a large percentage of recording tapes\neach year, the tapes have continued to wear at a faster rate than\nanticipated and a constantly larger supply of tapes is demandedo It\n:1s imperative that the basic supply of tapes be increased*\nAmount requested for additional tapes »«■---*- 3*>000o0Q\nASSOCIATE DIRECTOR 0 The success of the tap© network has\nbeen so phenomenal and the growth in membership has been so rapid\nthat the demand and need for services has increased greatly. The\ninvolvement of NAEB with other national and international educational\norganizations, the increased quantity of material received by head-\nquarters for national distribution, and the ever-increasing general\ndemands upon the organization have far exceeded the ability of the\nheadquarters staff to perform. It is necessary, therefore, that NAEB\nadd a high caliber assistant to the Executive Director who would be\nresponsible for coordination of many of the activities currently be¬\ning handled by the Executive Director and by the President* (It\nshould be noted in passing that the President has devoted approxi™\nmately 95 percent of his time to the organisation during the past\n12 months and can 111-afford to continue to take that much time from\nhis own Institution.) Adding an associate director to the staff\nwould freemthe Executive Director from many routine operational\ndetails and permit him to concentrate on organizational business,\npublic relations, and professional development of th© educational\nbroadcasting constituency«\nYearly salary. Associate Director 8,000? 00\nTRAVEL FUNDSo During the past year, a greatly expanded\ncommittee system has been developed for increasing the amount of\nself-help or cooperative service within the organization,, The re¬\nport of committees at the spring Board meeting in Columbus, Ohio,\nlast Apr5.1 gave sure indication of the value of committee work and\nthis impression was further strengthened by committee reports at\nthe annual convention of the organization in October* The one great\nhandicap to committee activity, however, is leek of funds for com¬\nmittee meetings. Experience indicates that approximately $500c00\nis the minimum necessary for a two day meeting of either of the com¬\nmittees? Since all committees and the Board and Officers pay their\nown expenses to th© two national meetings of the year, it Is unfair\nto ask the institutions and the individuals to provide additional\nfunds for additional committee meetings and the result has been\nthat committee work has been hampered for lack of fundsQ A supple¬\nmental grant for this purpose would greatly increase the amount of\nwork turned out by the organization* Some additional funds will\nbe necessary also for travel of the Associate Director,.\nAdditional travel funds requested 2 p 000c 00\n- - - =># 25p000o00\nTOTAL AMOUNT REQUESTED"
}