{
  "id": "d1823-1",
  "text": "NAEB NEWS LETTER\nPage &<\nOctober 1, 1943\nPIONEER IN THIS NEW MEDIUM* A CONSIDERABLE PROPORTION OF ALL THE EARLY\nRADIO BROADCASTING LICENSES ISSUED WERE TO EDUCATIONAL INSTITUTIONS.\nOne sy one the majority of those EARLY EDUCATIONAL STATIONS have fallen\nBY THE WAYSIDE* THERE HAVE BEEN EXCEPTIONS; I NEED ONLY MENTION HAROLD\nMcCarty's Station WHA which has survived lean years and fat at the\nUniversity of Wisconsin* serving the state well throughout the years*\nAnd other- examples of survivors could be mentioned. But certainly you\nWILL HAVE TO LOOK A LOT FARTHER FOR A BONA FIDE EDUCATIONAL STATION IN THE\nSTANDARD BROADCAST BAND TODAY THAN YOU WOULD HAVE 15 YEARS AGO*\nSome persons have blamed the old Federal Radio Commission, predecessor to,\nthe present Communications Commission, for that tendency of educational\nSTATIONS TO FALL BY THE WAYSIDE. OTHERS HAVE PLACED THE BLAME ON MONO¬\nPOLISTIC POLITICS WITHIN THE BROADCASTING INDUSTRY WHICH HAVE ONE BY ONE\nEITHER OUSTED OR ABSORBED THE PIONEER EDUCATIONAL STATIONS* HERE AGAIN\nI WANT TO EXPRESS NO OPINION. 8uT I DO WANT TO SUGGEST, TALKING HERE TO\nA GROUP OF EDUCATORS, THAT EDUCATORS THEMSELVES WERE NOT ALTOGETHER FREE\nOF BLAME* As COMPETITION IN THE RADIO FIELD BECAME MORE ANO MORE INTENSE,\nAS EQUIPMENT BECAME BETTER AND THEREFORE MORE EXPENSIVE, AS PROGRAM\nQUALITY ROSE ANO THEREFORE REQUIRED MORE EFFORT, TOO MANY EDUCATIONAL\nSTATIONS TENOED FIRST TO LAG BEHIND, AND THEREAFTER TO ABANDON THEIR\nlicenses* After 1929, when educational budget problems became particularly\nACUTE, EDUCATIONAL RADIO STATIONS WERE AMONG THE FIRST TO FEEL THE AXE*\nALL THAT IS NOW ANCIENT HISTORY, AND FM OPENS A NEW CHAPTER. IT WAS\nGeorge Canning who said more than a century ago:\n\"I CALLED THE NEW WORLD INTO EXISTENCE TO REDRESS\nTHE BALANCE OF THE 0LOoh\nSimilarly it may be suggested that, at least as far as educational broad¬\ncast STATIONS ARE CONCERNED, THE NEW FM RADIO BAND HAS BEEN CALLED INTO\nEXISTENCE TO REDRESS THE BALANCE OF THE OLD STANDARD BBOADCAST BAND*\nThe Commission, I think I can fairly state, has now done everything in its\nPOWER TO REDRESS THAT BALANCE. IT HAS ASSIGNED A SUFFICIENT NUMBER OF\nCHOICE FREQUENCIES, AND HAS ESTABLISHED RULES AND REGULATIONS GOVERNING\nNON-COMMERCIAL EDUCATIONAL FM STATIONS WHICH SHOULD ALLOW AMPLE LATITUDE*\nIF IN PRACTICE ANY COMMISSION RULES OR PRECEDURES STAND IN THE WAY OF\nFURTHER EDUCATIONAL RADIO PROGRESS* I CAN ASSURE YOU THAT SUGGESTED CHANGES\nWILL BE GIVEN THE FULLEST ATTENTION OF THE COMMISSION*\nBut THERE ARE SOME THINGS WE CANNOT 00 FOR YOU* We CANNOT BUILD STATIONS\nFOR YOU. WE CAN'T OPERATE STATIONS FOR YOU. AND WE CAN1T SUPPLY PROGRAMS\nfor you* These are things education must supply for itself* And it must\nDO SO PROMPTLY IF ITS CHANNELS ARE TO BE MAINTAINED* FOR, AS I CANNOT TOO\nSTRONGLY SUGGEST, IF EDUCATION DOES NOT MOVE INTO THE HOME SET ASIDE FOR IT*\nTHERE WILL BE PLENTY OF OTHERS WHO WILL FIRST SEEK AND THEN DEMAND\nADMISSION TO THE VACANT ROOMS.\nGeorge Adair, who will bpeak later* will give you the technical details*\nHe'll sell you roughly how much a station costs to build and to run, what\nthe licensing procedure is, and so on* If you have any doubtful points,\nASK HIM QUESTIONS, EITHER NOW OR LATER. I*D LIKE TO PASS ON INSTEAD TO\nA FURTHER POINT - NAMELY WHAT TO DO WITH YOUR STATIONS AFTER THEY ARE BUILT*"
}