{
  "id": "d1823-2",
  "text": "NAE8 N EWS LETTER\nPage 3\nOCTOSOR I» 1943\nOn THE NEW FM BAND, LET ME ASSURE YOU, YOU* RE GOING TO BE TRAVELLING IN\nFAST COMPANY. YOUR PROGRAMS VILL BE COMPETING, SO FAR AS GENERAL LISTENERS\nAT LEAST ARE CONCERNED, VITH THE BEST THAT COMMERCIAL RADIO CAN OFFER ® ANO\nREMEMBER, 1T*S EASY TO PLAY HOOKEY FROM A RADIO SCHOOL® A MERE TWIST OF\nTHE DIAL WILL SHUT OUT I7TH CENTURY HISTORY OR TRIGONOMETRY ANO BRING IN\nJack Benny or the results of the World Series® I am myself a great\nBELIEVER IN COMPETITION, ANO l HAVE A NOTION THAT, IF EDUCATORS DO THEIR\nPART AND DO IT WELL, COMPETITION BETWEEN THE ADJACENT COMMERCIAL AND NON~\nCOMMERCIAL FM BANDS WILL RESULT IN IMPROVED PROGRAM SERVICE ON BOTH BANDS®\nIN ONE SENSE, OF COURSE, ALL RADIO IS EDUCATIONAL, FOP BETTER OR WORSE» The\nLOCAL COMMERCIAL STATIONS AND THE NETWORKS ALIKE ARE EDUCATING ^STENERS\nEVERY HOUR OF THE DAY AND NIGHT® I SUPPOSE THE SYMPHONY AND THE 0pCRA AR*\nMUSIC EDUCATION WHETHER THEY ARE TREATED IN THE CLASSROOM OR ARE SPONSORED\nBY A ROOFING COMPANY. SIMILARLY THE NEWS PROGRAMS WHICH HAVE OONE 80 MUCH\nTO MAKE COMMERCIAL RADIO AN INDISPENSABLE PART OF OUR DAILY LIVES ARE NO\nLESS EDUCATIONAL BECAUSE THEY ARE NOT CALLED COURSES IN CURRENT EVENTS®\nThe TECHNIOUES for REACHING AND impressing mass audiences so skillfully\nOEVELOPED BY COMMERCIAL RADIO CAN AND INDEED MUST BE APPLIED, THOUGH\nPERHAPS IN SOMEWHAT MODIFIED FORM, IF THE NEW EDUCATIONAL FM STATIONS ARE\nTO LIVE UP TO THEIR PROMISE.\nBy THAT I DON’T MEAN TO SUGGEST THAT SUCH SLOGANS AS MTHE SQUARE OF THE\nHYPOTENUSE IS EQUAL TO THE SUM OF THE SQUARES OF THE OTHER TWO SIDES\nSHOULD BE SET TO MUSIC AND PLUGGED HOME TO THE TUNE OF \"TWICE AS MUCH FOR\nA NICKEL, TOO —PEPSI-COLA IS THE DRINK FOR YOU**® BUT I DO WANT TO SUGGEST\nTHAT THE DRAMATIC AND NARRATIVE TECHNIQUES WHICH HAVE PROVED SUCCESSFUL\nIN COMMERCIAL COMPETITION ARE NOT WITHOUT THEIR LESSONS TO THE EDUCATOR\nSEEKING TO USE A NEW AND SENSITIVE MEDIUM® ^U6H PROGRESS HAS ALREADY BEEN\nMADE IN THE DIRECTION OF INTRODUCING ”LISTENER INTEREST” IN EDUCATIONAL\nPROGRAMS. IF THE NEW FM STATIONS ARE TO SUCCEED, THAT PROGRESS MUST\nCONTINUE®\nIT 18 CERTAINLY NOT TOO EARLY TO BEGIN PLANS FOR THESE FIVE EDUCATIONAL\n6HANNELS« DURING THE WAR PERIOD, OF COURSE, EQUIPMENT AND MANPOWER\nSHORTAGES ARE PREVENTING IMMEDIATE EXPANSION® AFTER THE W’AR» HOWEVER,\nEQUIPMENT WILL BE FREELY AVAILABLE; PLANS SHOULD BE LAID NOW TO GET GOING\nAT THE EARLIEST POSSIBLE DATE. For INEVITABLY, AFTER THIS THCRC W11-1-\nHAVE TO BE A RESHUFFLE OF FREOUENCY ASSIGNMENTS. WHOLE NEW PORTIONS OF THE\nSPECTRUM, FORMERLY DEEMED USELESS, HAVE BEEN OPENED UP THROUGH WARTIME\nRESEARCH, WHILE THE EXPANDING NEED FOR WORLD-WlOE COMMUNICATIONS AND\nESPECIALLY THE VAST NEW AVIATION USES OF RADIO, WlLL IN ALL . . ro\nCROWD THE POSTWAR ETHER EVEN MORE TIGHTLY THAN THE COMPARATIVELY SMALLER\nSPECTRUM WAS JAMMED BEFORE THE WAR® In SUCH A RESHUFFLE, THE FR ENDS OF\nEDUCATIONAL RADIO WILL CERTAINLY WANT TO ”°.L° T?o'wh?ch'EDUCATIONALFRE-\nIF LETHARGY PREVAILS, AND OTHERS SEEKING rDUCAT,0NAL STATIONS ARE GOING\nSrr^T^^^S S^CULT OR IMPOSSIBLE\nT0^C0NT*INUE THE RESERVATION OF UNUSED FREQUENCIES®\nI TRUST THAT THE MEETING HERE TODAY WILL ”^RDSETHETrULLESTNpOSSl’BLE\nutTuIAtJSS o^the'fm1 educational sand in the service of American education."
}