{
  "id": "d1823-3",
  "text": "Page 4,\nOctober If 1943\nNA£B NEWS LETTER\nMICHIGAN APPLIES FOR PM PERMtT\nThe University or Michigan plans to builo a broadcast station at Ann Arbor.\nUniversity regents have made application to the Federal Communications\nCommission for a non-commercial, educational station to be operated on\n42,900 KILOCYCLES. The MICHIGAN REGENTS ASK FOR UNLIMITED TIME.\nWNYC WINS FIGHT FOR NIGHT TIME\nNew York City ha9 won its battle of the airways. The Federal Communications\nCommission has granted the Municipal radio station, VjNYC, the right to\nBROADCAST UNTIL lOlOO, EASTERN */■»'AR T|ME, EACH NIGHT. Up TO NOW, THE\nstation which is used to keep New York City*s people alert to civic issues\nRANGING FROM TAMMANY HaLL TO THE PRICE OF EGGS HAS BEEN REOUIREO TO SHUT\nDOWN WHEN THE SUN SETS IN MINNEAPOLIS, MINNESOTA* THE SUN9ET HOUR WA8\nDESIGNATED BSCAUSE A MINNEAPOLIS STATION WCCO, 0PERATE8 ON THE SAME WAVE\nLENGTH AS WNYC _830 KILOCYCLES. THE COLUMBIA BrOAOCASTING COMPANY, WHICH\nOPERATES WCCQ, HAS WITHDRAWN ITS OBJECTIONS TO La GuaRDIa'S AFTER SUNSET\nBROADCASTS*\nflNVC^S SUN PAY SCHEDULE\n| T*S PRETTY GENERALLY ACCEPTED NOY'AOAYS — EVEN IN WARTIME, THAT SUNDAY IS\nTHE TT ADITIONAL DAY OF REST, THE DAY FOR TAKING IT EASY, AND IN THESE TIMES\nOF TRANSPORTATION DIFFICULTIES, THE DAY FOR STAYING HOME AND LISTENING TO\nTHE radio. New York's Own (Ounicipaw Station WNYC has taken this factor\nIN MIND IN PLANNING ITS WEEKLY SUNDAY BROADCAST SCHEDULE — MUSIC, NEWS,\nPUBLIC SERVICE, DEFENSE, DRAMA AND SPORTS HAVE ALL BEEN INCLUDED ON THE\nBILL OF FARE — wFOR THE INSTRUCTION, ENLIGHTENMENT, ENTERTAINMENT, RE¬\nCREATION, AND WELFARE OF THE INHABITANTS OF THE CITY**. (NEW YORK ClTY\nCharter outlining the purpose of WNYC).\nTake Sunday, September 19th, as an average example. At 7:05 a.m. early\nLISTENERS CAN STILL LIE IN BED AND HEAR THE SUNRISE SYMPHONY, FIFTY-FIVE\nMINUTES OF OUTSTANDING RECORDED CLASSICAL MUSIC INCLUDING THIS WEEK A\nMozart Symphony and a Handel Concerto. At eight theStar Gazer slenos\nAPPROPRI ATE POETRY AND.MUSIC UNTIL 8:45 WHEN WNYC BROADCASTS THE COMPLETE\nROUND-UP OF THE NEWS OF THE DAY. THE MASTERWORK HOUR AT 9:00 A.M. NEEOS\nNO INTRODUCTION TO LOVERS OF GOOD MUSIC, AS IT IS THE OLDEST PROGRAM OF\nITS KIND ON THE AlRWAVES, THIS WEEK PRESENTING THE WORKS OF SERGE PROKOFIEFF.\nThe Opera Hour at ten brings Metropolitan fans sixty minutes of scenes\nfrom Verdi ,s,,Higolettow as performed on records by the world's leading\nOPERATIC STARS. ELEVEN A.M. MARKS THE BEGINNING OF WNYC's LIVE MUSIC\nSCHEDULE FOR THE DAY WITH The YOUNG AMERICAN ARTISTS1 SeRlES FEATUR*NG AN\noutstanding American virtuoso (this week Edna Belgum, pianist, plays vorks\n2y Be£™JvenaS5B^nK The Sonata Series at 11:30 presents Harold Kohon,\nFollowing the Missing Persons Alarms from the Police Department at 12:03,\nA COMPLETE NEWS REPORT IS HEARD. At 12:15 P.M., ITS TIME FOR THE TREASURY\nHour Concert -forty-five minutes of outstanding music by distinguished\nartists presented in cooperation with the War Savings Staff of the United\nStates Treasury Department —music with a message, a message for all"
}