{
  "id": "d992-11",
  "text": "with similar interests. It has been, throughout its history, a center of cooperation\nand coordination for the improvement of education, with particular emphasis on higher\neducation. The Institute of International Education, with the approval of the Council,\nwas found in 1919 as the organization responsible for the field of international\neducation in the United States. In order to clarify their respective responsibilities\nin international education an agreement was signed in 1927 which in summary stated:\n\"The Institute should represent American education vis-a-vis the rest of the world\nadministering fellowships, and visiting professorships, welcoming foreign scholars,\narranging itineraries of foreign educational missions, holding conferences on problems\nof international education and conducting activities of a similar nature . in this\nway the major activities of international education have been concentrated in the\nInstitute\" and \"that the Council o .... discontinue ..... activities in the field of\ninternational education\".\n* The march of events since the signing of this agreement makes it clear that the\nagreement is no longer adequate and should be cancelled.\nWhile the Institute of International Education and the American Council on Educa¬\ntion should continue to concentrate primarily on the areas of their original interests\nthey should not feel that they are restricted exclusively to such activities. Parti¬\ncularly the Council with its organizational and institutional membership of colleges and\nuniversities and professional associations is and should be interested in the problems\nand policies of international education.\nAt a meeting attended by Messrs. Stoddard, Shuster, Wells, Heald, Holland and\nAdams at the Institute of International Education on July 6th, 19553 \"it was agreed\nthat the increasingly important role of education in international affairs required\noptimum coordination and cooperation of all of the voluntary agencies concerned. In\nparticular, it was recognized that with special reference to the Institute of Inter¬\nnational Education and the American Council on Education there are functions peculiar\nto each organization which it alone is best prepared to discharge\".\nThe development of the work of the Institute in cooperation with the exchange of\npersons programs of the Government and of other agencies has been impressive and clearly\nindicates that the Institute is and should be the agency to undertake and carry on this\ntype of work. The Council, which has membership from nearly all of the accredited\ncolleges and universities of the country, has channels of communication and relation¬\nships with institutions which present it with the Important responsibility of dealing\nwith institutional problems involved in the relation between education and internation¬\nal affairs. The Council’s activities in recent years have been largely addressed to\nthis sort of activity and it is clear that its work in this area supplies an important\nelement in the total effort.\nIt was agreed that the normal centers of interest of the two organizations are:\n(1) the Institute to stimulate, operate and coordinate exchange of persons programs\nand (2) the Council In its work in international education to concentrate on providing\nhigh level planning and guidance on international education in all its aspects using\nas a basis for its work, however, the information and operating resources insofar as\nth^r exist in already established agencies, i.e., the Institute in the field of exchange\nof persons.\nBetween these two clearly discernible centers of interest lie a numoer of\nactivities which it is difficult to categorize by putting in either one area of\ninterest or the other. An example of this is the conduct by the Council, under\ncontract with the Department of State, of the Leader's Program, a project not\n* A suggested amendment of this paragraph will be submitted for approval to the\nExecutive Committee of the Institute of International Education and the American\nCouncil on Education, respectively."
}