{
  "id": "d992-13",
  "text": "7.\nOctober 1955 meeting of the Executive Committee, Dr. Adams was requested to ex¬\nplore the possible interest of the Council in this area. In the course of the\nexploration a representative of the Council attended the meeting of the Associa¬\ntion of Governing Boards of State Universities and Allied Institutions, which\nhad the matter under discussion. Meanwhile, the subject has been before a joint\ncommittee representing the Executive Committees of the American Association of\nLand-Grant Colleges and State Universities, the National Association of State\nUniversities, and the State Universities Association. Because of the formation\nof the inter-association committee, Dr. Adams recommended that the American\nCouncil on Education postpone further action. The recommendation was accepted\nby the Executive Committee.\n(m) Dr. Adams presented a proposal from the Commission on Student\nPersonnel looking to the publication of a statement on student participation to\ncollege policy making. The statement is the result of a survey of the extent\nto which such participation is prevalent in institutions of higher education.\nThe statement has been prepared by Mr. Harry Lunn, Immediate past-President\nof United States National Student Association.\nIT WAS VOTED to approve the proposal for a publication on the\nsubject of student participation in college policy making and authorize the\nPresident of the Council to seek funds for its support.\nk. Financial Matters. Reports on the 1955 budgets of the Council for the\nperiod January 1 thru December 31? 1955? were discussed in detail by Dr. Adams\nand members of the Executive Committee. These reports covered the Council's\nGeneral Fund, Building Fqnd, Publications Fund, and Central Services Division.\nAt the conclusion of the discussion,\nIT WAS VOTED to accept and place on file the reports on the\noperation of the 1955 budgets of the Council, as presented by Dr. Adams.\nThe attention of the Committee was called to the desirability\nthat individual room air conditioning units be purchased and installed in the\noffices of the Council during the forthcoming spring. The 1956 budgets for the\nCouncil's Publications Division and Central Services Division provide for the\ninstallation of air-conditioning equipment in the quarters occupied by the\npersonnel of these divisions. It was pointed out that while the 1956 General\nbudget of the Council did not contain such provision, funds were available in\nthe Council's General reserve for the purchase of air-conditioning units for\nthe general offices of the members of the Council staff. Dr. Adams stated\nthat because of the number of very humid days of high temperature during the\nsummer in Washington, D. C., and the local custom of closing non-air-conditioned\noffices when the temperature reached 93 degrees with a 9®jo humidity reading,\nit was believed that the installation of air-conditioning would be an invest¬\nment in productivity. A survey indicated that the sum of $7?000 would be\nrequired to accomplish this purpose. After discussion,\nIT WAS VOTED to approve the recommendation that the sum of\n$7,000 be appropriated from Council reserve funds for the installation of air-\nconditioning units in the general offices of the Council, prior to the summer\nof 1956.\nThe Committee was reminded that at previous meetings the\nquestion of machine bookkeeping in the Council's accounting office had been\ndiscussed. A study is being made of the possibilities and while progress has"
}