{
  "id": "d992-14",
  "text": "been made, the matter has not yet been fully resolved. Dr. Adams therefore re¬\nquested that he be authorized to make the necessary expenditure, at the appro¬\npriate time, to procure the necessary equipment for machine bookkeeping for the\naccounting office.\nIT WAS VOTED to authorize Dr, Adams to continue to explore the\npossible installation of machine bookkeeping and to purchase the necessary\nequipment if and when it appears feasible to do so, the Funds for such expendi¬\nture to be appropriated from the Council’s general reserve account.\n5. Membership. Applications for Institutional Membership in the Council were\npresented from the following, each of which is accredited by the appropriate\nregional accrediting association:\n4-year Colleges and Universities\n‘ Anna Maria College, Paxton, Massachusetts\nAthens College, Athens, Alabama\nKing's College, Wilkes-Barre, Pennsylvania\nLong Island University, Brooklyn, New York\nMorgan State College, Baltimore, Maryland\nJunior Colleges\nDaniel Payne College, Birmingham, Alabama\nEdward Waters College, Jacksonville, Florida\n4-year Technical Institute\nPhiladelphia Textile Institute, Philadelphia, Pennsylvania\nProfessional School\nHartt College of Music, Hartford, Connecticut\nabove.\nIT WAS VOTED to accept the applications for membership listed\nIT WAS ALSO VOTED to accept the resignations of one Associate\nmember, three institutions of higher education, one secondary-school, and one\nstate voluntary association of colleges. All of the resignations were caused\nby the necessity for budget economies.\nIT WAS FURTHER VOTED to remove from the membership roll, for\nnon-payment of dues, one Associate member.\nWith these changes the membership of the Council on January 25,\n1956, follows: Constituent members, 77; Associate members, 62; Institutional\nmembers, 966; Total, 1,105.\nThe Committee was presented with a series of recommendations from\nthe meeting of the Committee on Membership held December 14, 1955• At that meeting\nthe Committee on Membership made the following recommendations to the Executive\nCommittee:\n(1) That in the future Constituent membership /Tn the American\nCouncil on Education/ be extended only to non-profit national and regional\norganizations whose primary purpose is the advancement of education.\n(2) That in the future Associate Membership in the Council should\nbe extended to national and regional non-profit making organizations which"
}