{
  "id": "d992-19",
  "text": "ATTACHMENT A\nREPORT ON THE ACTIVITIES OF COMMITTEES OF THE AMERICAN\nCOUNCIL ON EDUCATION SINCE THE MEETING OF THE EXECUTIVE\nCOMMITTEE HELD\nOctober 5, I955\nI* MERAL COUNCIL OPERATIONS\nProblems and Policies Committee\nAt the Annual Meeting Dean Margaret Habein, President Harry D. Gideonse\nand President J. W. Maucker were elected by the Council to fill the expiring\nterms of President Margaret Clapp and Professors Te R. McConnell and Peter Odegard.\nThe Committee met^October 5 and identified some twenty propositions around some of\nwhich its discussions will take place during the current academic year. The\nCommittee will meet at the Belleview-Biltmore Hotel in Belleair, Florida, January 31-\nebruary 1. It is anticipated that a portion of the earlier discussions of the\nCommittee will have been edited and readied for publication by early summer.\n.Committee on Relationships of Higher Education to the Federal Government\nChancellor Henry T. Heald of New York University became Chairman of the\nCommittee on January 1, 1956* succeeding President J. L. Morrill of the University\nof Minnesota.\nThis Committee has had one meeting since October 15. On October 31, it\nconsidered a number of items of which the following were most important:\n(1) Acceptance of the report of the Subcommittee to Correlate Basic Data\nfor a National Scholarship Policy prepared by Dr. Elmer D. West (Publication now\nscheduled for March 15, 1956)5 and\n(2) Approval of the request that the Council circulate a questionnaire\nconcerning needs for new ROTC facilities in the light of a proposal by the\nDepartment of Defense to ask Congress for authority to share the cost of such\nfacilities.\nThe next meeting is scheduled for the week of February 6, at which time\nseveral matters of pending legislation will be considered.\nPacific Coast Committee\nThe Pacific Coast Committee met at San Francisco State College on November 10\n1955. A two-day Conference on Higher Education on the theme ’’Higher Education\nand its Publics: Supports and Controls,” was held in San Francisco on November 11\nand 12, and was jointly sponsored by the Western College Association and the\nAmerican Council on Education, in connection with the Centennial of the University\nof San Francisco. To the Pacific Coast Committee goes must of the credit for the\nplanning and success of this Conference, which was attended by nearly 300 repre¬\nsentatives of institutions in states west of the Rocky Mountains."
}