{
  "id": "d992-60",
  "text": "AMERICAN COUNCIL ON EDUCATION\nConstituent Member Meeting\nMayflower Hotel, Washington, D.Co\nMarch 19-20, 1956\nOffice\n1785 Massachusetts Avenue, N. W*\nWashington 6, D. C,\nTelephones Hudson 3-6620\nPaper prepared for delivery\nMonday, March 19, at\n9s30 A.M.\nHIGHER EDUCATION AND AMERICAN SOCIETY\nFrank H, Bowles, Director\nCollege Entrance Examination Board\nThe purpose of this meeting is to discuss the future of American higher education*\nIn so doing, we will search the past for clues that may be transmuted into insights. But\nalways, our concern will be with an anxious future*\nThe purpose of this paper is announced in the program as a discussion of the role of\neducation in American society* Such a discussion, by its very nature, must begin with an\nexamination of the development of American education, since it is only through such an\nexamination that we can form any conclusions as to the relationships between society and\neducation which have controlled the developments of the past, and which may reasonably be\nexpected to control developments in the future.\nThis examination can begin, appropriately, with the observation that we are approaching\nthe end of a decade in American history when the entire complex of activities that we call\nhigher education has been the object of constant public attention*\nThe decade began when veterans1 legislation and the devevelopment of government-sponsored\nresearch programs established higher education as an essential eleihent in national policy*\nSince then we have lived through the veterans* rush which began by uncovering deficiencies\nwe had never realized, and ended by exciting us all over the prospect of reaching groups\nand problems that we had always thought to be beyond our reach* During this decade, we\nhave seen higher education given special status by the armed forces during the Korean War*\nWe have seen it become the pivot in a campaign to develop new mores for corporate giving.\nWe have seen tremendous increases in facilities and resources, particularly in the tax-\nsupported segment and have known wide public discussion of more facilities and resources.\nNow we are participating in the development cof a talent hunt, aided by the establishment\nof scholarship programs over which, curiously enough, higher education has no direct\ncontrol* And, as we are ending the decade, there is developing a recruiting campaign,\nwhich is in large part being conducted by government and industry, to increase the number\nof students in science, engineering, and mathematics*\nAnd, while all of these external pressures to take more scholarship students, to search\nout new resources of talent, to take more students of mathematics and science, are being\nexerted upon us, we still face the problem of apportioning the resources we have to care\nfor the students we have* Altogether, it has been a busy decade. But, busy as it has\nbeen, I am sure that we all know that this is only the beginning* From now on higher"
}