{
  "id": "d992-61",
  "text": "2\neducation is to be the concern, and in a sense the property of the whole nation, rather\nthan of any part of the nation. It is best that we recognize now that our business is\neverybody's business.\nIf the variety and duration of this attention is a new experience for us, the reason\nis, I think, largely to be found in the fact that during the first half of our century,\nthe bulk of the attention that has been given to education has gone to secondary education.\nIf so, this is entirely natural, for during those fifty years we have planned and built a\nsystem of secondary education complete with plant, teachers, administrators, and controlling\nphilosophy. It is a system which has developed from a spotty offering of education to some\n700,000 pupils in 1900 to the point where it is now, albeit with creaks, groans, and\ncomplaints, able to care for over 7,000,000 pupils and is in process of adjusting itself\nto hold and care for an even larger number. In terms of percentages, it took care of\n11^% of eligible pupils in 1900, while today it cares for Q0% of the eligibles.\nViewed over half a century, this seems an almost incredible accomplishment. In order\nto achieve it, it has been necessary to gain general acceptance for the concept that every\nchild is entitled to opportunity for education to the fullest extent of his abilities; to\ndevelop a curriculum which would implement the concept and a system of teacher education\nwhich would implement the curriculum. Naturally, these items have not been cared for in\nsuch a precise, neat pattern, but they have been cared for. The concept only began to\ngain general acceptance, and to assume control during the 1930Js, and its ultimate\nstatement as a matter of public record came only a few months ago in the report of the\nWhite House Conference on Education,\nThe system of teacher education has been developed from the point of granting\n600 degrees in education during the five years from 1901 to 1905 to the granting of\n198,300 degrees in education in the three-year period 195l»53» And the curriculum,\ndespite shortcomings that are often made sufficiently explicit by college teachers\ndiscussing the qualities of the freshman class, is nevertheless a remarkable achievement\nin compromising the requirements of the economy and of our society as a whole with the\nrequirement that the individual be given both maximum freedom and maximum opportunity.\nThere are, of course, many more remarks that might be made about this achievement,\nbut most of them would be tangential to the purpose of a paper that is centered on higher\neducation. However, it is appropriate, though probably superfluous, to point out that\nthe development of higher education in all of its size and variety has been both\nsupported and forced by the growth of tax-supported, publicly-controlled education.\nCertainly, had our colleges and universities continued to rely, as they relied\nhalf a century ago, upon a system of secondary education in which college entrance was\nboth the main objective and the criterion of student success, and in which the curriculum\nwas controlled by the university curriculum, they could not have grown as they have grown.\nThe intervening half century might well have been a far more comfortable one, and our\nmean standard of scholarship might well have been higher than it now is, but we would\nhave been denied the privileges of exploring new fields of education and the excitement\nof crossing new social frontiers.\nOn this point, the evidence on the development of secondary education and higher\neducation in Europe, and even in England, where secondary education has been maintained\nwith a controlling criterion of university entrance, and with a curricular control\nexercised by the universities through central ministries of education, is startling in"
}