{
  "id": "d992-73",
  "text": "2.\nIt is beginning to look as though the definition someone gave concerning marriage\ni£ a good one. It is said that marriage is just like a poker game. You start off\nwith a pair, he shows a diamond, she shows a flush, and they finish with a full house.\nNot only is the number of births each year the highest in our history, but the\nbirth rate is near our all-time peak, and our death rate is at our all-time low.\nDuring the last fifty years life expectancy has been increased a full twenty years.\nPerhaps we could be permitted a brief look into the future — undoubtedly, a\nfabulous future with another big population boom practically assured in the late\nI960?s and early 19709s when the tidal wave of births of the last ten years will\nresult in a tidal wave of marriages creating still greater needs and problems.\nIn our effort to plan for the education of this tremendous number of students\nevery consideration should be given to the utilization of facilities immediately\nat hand. Again, without stopping to enumerate the studies made from Florida to\nCalifornia and throughout the United States regarding the utilization of existing\nspace in our colleges and universities, it is generally agreed that we use no\nmore than 50 per cent of our rooms and 25 per cent of our student stations on\na forty-five hour week. This may be a luxury we can no longer afford and one which\nwe can hardly justify. It may be that we shall be forced to ask faculty and students\nalike to distribute their classes evenly throughout the entire day from eight until\nfive and perhaps on into the evening. Certainly we could increase our enrollment by\n50 per cent using present facilities if we would be willing to pay the price of more\nrigid scheduling of classes. This would mean that we would use the rooms 75 per cent\nof the time and the student stations less than hO per cent of the time. Other\nfactors affecting space utilization are the size of classes and the number of courses\noffered in relation to ihe size of the student body. In many studies it has been\nfound that from one third to one half of all classes taugit in the college or\nuniversity enroll ten students or less. In certain colleges it was found that as\nmany as one fifth of the classes enroll less than five students. Fragmentation of\nknowledge and provision for individual differences has really been carried to the\nextreme. The multiplicity of course offerings is another factor causing poor space\nutilization. A sample study of colleges in Ohio reveals that as enrollments increase\nnew curricula are offered until we find that for every five additional students we\nenroll we establish a new course. In some colleges the number of courses listed in\nthe bulletin is actually more than the number of students enrolled. Obviously, no\nbusiness or enterprise compelled to live on its capital could tolerate such conditions.\nIt should be recognized at once that there are many factors and influences which\nhave shaped our present policies and practices regarding the utilization of space\nin our colleges and universities. Courses have been established on the two and three\nhour basis rather than the five hour basis. There is really nothing sacred or funda¬\nmentally logical in the organization of courses which demand that they must be presented\nthree times a week for a quarter or semester rather than five times a week. Certainly\nby the use of a little imagination we could combine these fragments of subject matter\ninto an organizational pattern which would result in far better utilization of ourrphysical\nhave also attempted to recognize the needs of the working students,\nand they have been given specially arranged schedules. Provision has been made for\nextracurricular activities and for the commuting students. Provision has even been\nmade for accommodating the convenience and whims of faculty and students alike. We\nmust examine our scale of values and determine whether or not we can afford to\ncontinue the luxuries to which we have become accustomed.\nwe.sha1^ attest to solve our mutual problems by a combination of\nS + Tan ”°st appropriate to the immediate local situation. We shall\nbe forced to schedule uniformly larger classes more evenly througiout the day.\ntudents will most certainly be more carefully selected, fees will be raised^still"
}