{
  "id": "d992-78",
  "text": "In 1887, the first of a series of acts providing for Federal support of\nagricultural research in the Land-Grant institutions was adopted, since it seemed\nincreasingly clear that a scientific agriculture needed a scientific basis. The\nneed for bringing scientific information into practice on the farms resulted in\nthe rapid development, particularly after 1900, of extension and demonstration\nwork both by the Land-Grant colleges and by the Federal Department of Agriculture,\nsometimes on a cooperative and sometimes on a competitive basis. This resulted\nin the passage, in 1914, of the Smith-Lever Act, establishing the Cooperative\nExtension Service of the U.S. Department of Agriculture and the Land-Grant Colleges,\nsupported by Federal, State, and local funds. I stress here only the fact that\nprior to the development of the cooperative plan, the Federal Government had\nestablished and was rapidly expanding its own extension service, wholly with\nFederal support.\nIn fiscal 1956, the agricultural research appropriations of the Federal\nGovernment were approximately $83 million, of which approximately 24.75 million\ndollars goes to the State agricultural experiment stations as grants-in-aid.\nThe total research budget of the Department of Agriculture and the Land-Grant\nColleges is, however, approximately $l6l million. Thus, the Land-Grant\ninstitutions account for more than half the agricultural research conducted by\nthem and by the Department of Agriculture, and the Federal contribution to their\nresearch budget is only one-third of their total expenditures for this purpose.\nThe rest comes from State and other institutional funds. These figures do not,\nof course, include costs of buildings, etc., supplied by the States.\nThe budget of the Cooperative Extension Service for the fiscal year 1956\nwas approximately $112 million, of which $47.5 million was Federally-provided,\nthe remaining $64.5 million came from State and local sources.\nAgricultural research cooperation as between the Land-Grant Colleges and\nthe Federal Government is not gust a matter of some Federal funds and support.\nHundreds of Federal research workers are stationed permanently at the Land-Grant\nColleges, which provide their office space and facilities, and work side by side\nwith the research staffs of the colleges. Hundreds are jointly employed. Millions\nof dollars worth of buildings, facilities, land, and animals are available for\nagricultural research purposes at no cost to the Federal Government.\nAnother important Federal program involving agriculture is the vocational\neducation program, involving a Federal appropriation of about $30 million in\n1956, of vhich $19.5 million goes into agriculture and home economics education\nin the public high schools.\nIt is interesting to note that in other programs in agriculture, other than\nresearch and education, the Federal Government, rather than the States and local\ncommunities, has assumed most, and frequently the whole, of the responsibility.\nIn fiscal 1954, for example, Federal appropriations for aid to State soil con¬\nservation districts were about $56.5 million, while the States put $2.1 million\ninto the program.\nThe Forest Service of the Department of Agriculture currently employs about\n9,300 full-time people, the Agricultural Research Service 12,000, the Soil Con¬\nservation Service 13,500, the Agricultural Marketing Service 3,800, to name only\na few of the larger agencies. The Cooperative Extension program has about 13,000\nstaff members. There are about 11,000 full-time teachers of vocational agricul¬\nture in the country, and about 13,000 full-time teachers of vocational home\neconomics. All these activities are either wholly or partially Federally initiated\nand financed. The staffs employed in them must all be college-trained. A sub¬\nstantial proportion of them are educated in the Land-Grant colleges, though many"
}