{
  "id": "d992-84",
  "text": "What can be done here and now to enlarge the supply of qualified students? I for one\nwould hesitate to jump for the panacea of federal assistance. I am not yet convinced\nthat we need a federal scholarship program. I am not certain—for the facts have now been\ngiven me—that we have exhausted the facilities available through private programs and\nthrough public ones of a local and state level. Until I am convinced that these\nresources have been exhausted I do not feel we should call on the federal government.\nSince however we are talking about a nation-wide need there are some things for\nwhich I feel we have a perfect right to call on the federal government. I said earlier\nthat the West Report poirts to the need for a clearing house of up-to-date accurate\ninformation on scholatships. Could not the U.S. Office of Education act as such a\nclearing house. Actually it does—to a certain extent. What would have to be added\nwould be the facilities to keep the information up to date. Secondly* I think we have\na right to call on the U.S. Office of Education—first of al} to complete and publish\nstudies it is now making* and to plan and undertake orders that have a bearing on the impor¬\ntance subject of trained manpower.\nAnother thing that can be done now to help to ameliorate the situation—there should\nbetter and earlier identification of those who can profit by higher education. The\ncapable students should be given this information and they and their parents should be en¬\ncouraged to aim at colleges. By the same token* high school administrators and\ncounsellors should have the courage to hold up to less capable students the dignity\nand advantages of a technical career* demanding less than college preparation.\nThere should be more contact between the faculties of high schools and colleges.\nHow can high school teachers and counsellors do an adequate job of advising if they\nhave better or no contact with colleges.\nSince finances certainly loom large in the decisions of some capable high school\ngraduates who would like to go to college* and also in the decisions of parents—the\nassistance that would be afforded werethe tax-credit plan might be a substantiate\nhelp in determining a parent to send his child to college."
}