{
  "id": "d992-90",
  "text": "ACE St, Louis Conference ,\nNotes (November 15-16) £10\nA) John Dale Russell\n1) Sex: Though girls outnumber boys in graduating from high school by ratio\noF“3:2 or always at least 10$. In college 3;2 men to women.\nIn theology women are discriminated against. In education, top jobs mostly\noccupied by men.\n3i*$ of bachelor*s degrees granted are to women each year.\n33$ of master* s degrees granted are to women each year.\n10$ of Ph. D*s degrees granted are to women each year.\nHome Economics was introduced to take care of women for courses. Not\ntoo popular. Dormitories always for women first, yet women are fewer.\nOur mores still don*t believe in equivalent education for men and women.\n2) Vocations for which higher education is available.\nLiberal arts often thought of as a luxury or frill.\nAgriculture, English, Commerce, Business Administration, Nursing, Elementary\nEducation illustrate late-comers to higher educational circles.\nFor certain vocations, no equality of opportunity. Need adequate personal\nfinances in family.\n3) Institutional facilities and conditions\nElementary and high school experiences frequently discourage. No equality\nof opportunity in secondaiy education until equality below. Next to lack\nof financial resources is the lack of adequate guidance programs. The pro¬\ngram of required subjects kills off many. Lack of interest—arousing area.\nAbsence of adequate balance in college curricula, all set up from point\nof view of scholarship, rather than needs of student.\nArbitrary prejudice of individual professor against certain student or\ntype of student.\nAbsence of facilities in centers convenient to students. I.e. just plain\naccessibility nearby is important.\nHigh schools have solved this. Limited curricular offerings in local set¬\nups. Need to decentralize facilities contradicts and counteracts the need\nfor a wider variety of offerings.\nShortage of trained faculty in needed areas. Yet no standards (as for\nPh.D. for teaching) for administrators."
}