{
  "id": "d992-94",
  "text": "NATIONAL RESERVE PLAN\nBefore I attempt to describe the proposed National Reserve\nPlan, I would like to outline briefly the present reserve setup,\nso you can see what we are trying to accomplish.\nFirst, we have on our books legislation that makes every\nable-bodied man liable for two years of active service. This\nlegislation was adopted in 1951 in the midst of the Korean War,\nand will expire June 30, 1955.\nThe same statute provides for a total military obligation\nof 8 years for every young man who enters military service.\nAfter a man is inducted by the Selective Service System and\nserves two years on active duty, he still has 6 remaining years\nof reserve duty.\nThe total 8-year service obligation applies to officers\nand volunteer enlisted men, as well as inductees.\nUnder such a system it is apparent that the reserve will be\nconstituted in large part of men who have performed active\nservice.\nIt is also of interest to examine the present reserve\nstructure, as established by existing law.\nAs you know, we have at present two principal categories of\nreservists — the Ready Reserve and the Standby Reserve, These cate¬\ngories, rather than constituting specific forces, are essentially\ndesignations reflecting liability for involuntary service in\nemergency situations. Most important, we do not have within\nthese categories at present suitably trained and organized forces\nto meet the requirements of national security.\nIn August 1953y the President asked the National Security\nTraining Commission to report on (1) the inequities in the present\nmethod of securing men for the Armed Forces reserves; (2) the\nfeasibility of a training program to supply non-veteran reserves\nwhile at the same time continuing induction for service; and (3)\nthe relationship of such a program to the building of a strong\nand equitable civilian reserve. At the same time, he also asked\nthe Office of Defense Mobilization to report on the availability\nof manpower for military and civilian needs.\nAs a result of these requests, two excellent reports were\nprepared.\nThe NSTC pointed out inequities to reservists that had\noccurred during the Korean War. To preclude the recurrence of\nsuch inequities, the Commission recommended a program of National\nSecurity Training which would produce by i960 at least 1,000,000\ninitially-trained non-veterans.\n1"
}