{
  "id": "d631-22",
  "text": "V\n* WILLARD C. WICHERS\nDirector Midwestern Division\nXi. P. BOURDREZ\nDirector New York\nA\nTHE NETHERLANDS INFORMATION BUREAU\n(A Government Agency of The Netherlands)\nTHE NETHERLANDS\nCABLE ADDRESS: NETHINFORM\nTELEPHONE: 3174\nIND^ESJA\nWY \\\ng >*\nIN REPLYING PLEASE REFER TO\nNO- 10-387-WCW:BU\nNETHERLANDS ANTILLES and SURINAM\nMIDWESTERN DIVISION\nNETHERLANDS MUSEUM\nHOLLAND, MICHIGAN\nMr. Richard B. Hull\nWOI, Iowa State College\nAmes, Iowa\nDear Dick Hull:\n'•-a/,.v October 31, 1949\nI should be remiss if I did not express even this belated word of appreciation\nfor the kind reception accorded me at the recent meetings of N.A.E.B. Although\nit was impossible to attend the full session, I derived a good deal from my\ncontacts. You and your colleagues have been doing a most important work\nand I am happy that we can have the grand cooperation in scheduling so many of\nthe programs produced by our Bureau.\nWhile it may not exactly be within the province of N.A.E.B ., I do wish they\ncould refer to an appropriate committee, the suggestion I made about sending an\nexperienced broadcaster abroad, to produce educational type programs which would,\nI am sure, have wide circulation, among your affiliated stations. Certainly\nwe would enlist the active support of Radio Nederland, and I feel certain that\nthe Foreign Program, Departments of most Western European countries would give\nsurprising assistance.\nI have had a letter from Mrs. Broderick who is writing at your suggestion to\narrange for the deposit of transcribed programs for circulation to educational\ninstitutions regularly serviced by her agency. She suggests 50 copies as\na minimum.\nI am now in the embarrassing position of finding that the demand for these\ntranscriptions from educational institutions has absorbed all our back copies\nso that I cannot furnish anything immediately to Mrs. Broderick. I am\noffering her a script series, ’’Feminine Vignettes\" and reviewing other material\nwhich has been produced in the past.\nI am enclosing a copy of my letter to Mrs. Broderick, and meantime, I am very\nappreciative of your interest in our material.\nSincerely yours.\nWILLARD C. WICHERS"
}