{
  "id": "d631-48",
  "text": "Mr* George E* Protest\nAugust 11, 1950\nYou know he believes eventually AM radio will hav® to go high hat but\nthen in the transition period we will have to keep the light burning*\nib asked IT I thought the network night like to us© Invitation to\nLearning, the monthly productions of You Are There, and ©vstTWeTake\n%cwl*orflt, although ids special interest was in \"invitation* I? we are\ninterested, and despite previous difficulties abbut getting permission\nto broadcast CBS educatlonals over non-CBS outlets, he said trial if\nwe would writ© him a letter asking for permission and outlining our\nplan he believes he might get it through. l$r suggestion is that he be\naddressed at Teacher's College or at his betas, 1*50 Riverside Drive,if\nyou and others think this advisable. I asked him who would provide\nthe platters and he didn’t have an answer, but we might think about\nwhether or not CBS should do it if we should invite them aboard* He\nhave the interesting precedent of owned and operated WBSX here giving\npermission to broadcast CROSSROADS over MYC* WEEI certainly had to\nclear this with Hew York*\nA suggestion I made to Sy in Illinois I repeat in capitals - HE ifiJST\nGET A BW: OF OUR *KV39K MEMBERS AND Ilf FACT GF ALL THE EDUCATIONAL\nSTATIONS' IN THE COUNTRY, EVEN IF EACH HAS TO DO IT HIMSELF* There\nare reasons which I cannot tell you now but this is top priority and\nurgent it seems to m ~ for example, think what it might mean for\nthe Ford Foundation to know something about tii© potential audience of\nthe network - Iyraan estimated it at perhaps ten million because of\nthe population centers in which some of the stations are situated* I\nthink t*da is too high, particularly because of the limitations of FM\nset ownership* tfhy can’t this be an early fall activity of every\nstation member of the IJAEB?\nThe Hew Round Table distribution system sounds excellent*\nThis is enough for one shot* Let us all hear from one another*\nFSftnh\nLife clipping*\ncc: Seymour N. Siegel\nRobert B, Hudson\nRichard B« Hull"
}