{
  "id": "d631-75",
  "text": "RADIO STATION\n1\nWHOM\n^^7 , To*.\nUNIVERSITY OF MICHIGAN\nWALDO ABBOT. DIRECTOR OF BROADCASTING\nSeptember 6, 1950\nMr. Richard B. Hull\nStation W0I\nIowa State College\nAme s , Iowa\nDear Dick:\nIn re Siegelfs letter which you say you do not know anything\nmore about except receiving his answer to me—I criticized the\nmethod of selecting programs for the NAEB Tape Network* I\nhad written this: that because our TREASURES OFF THE SHELF\nwas not accepted by the board of WNYC it had been discarded\nas a program to be offered to the NAEB. It was my contention\nthat no single station in the NAEB should have the power to\ndetermine the programs for all the other stations. I pointed\nout to Siegel that because WUOM had decided not to use his\nmedical series was no reason why his medical series should\nnot be offered to the NAEB stations. I agree with you that\nhe has done a wonderful job in getting the thing started. I\nam enclosing a carbon copy of my letter to him; and since you\nhave his reply to me, you111 have the whole story.\nI am looking forward to Lexington and the meetings. I think\namong other things that should be considered down there is\nthe possibility of rotating or changing more frequently your\nExecutive Committee. For a couple of years now anyway we\nhave had the same people representing the various regions.\nI think it would be good to vary these and put in new members.\nI believe that this would interest more locations in the\nNAEB. Miles and Dunn and Morris have been in for two terms\neach. I think it would be good to vary them a little bit.\nWhat do you think?\nI will send you more dope on our video university. Thanks\nfor your suggestion of film. I will put it up to the committee.\nIf you consider that any of the programs are worthwhile, we\nwill film.\nI wrote to Paulu suggesting that we might have some exchange\nof cuts that could be used in bulletins by different members\nof the NAEB. I felt that my cut (which is for slick paper)\nof the educational FM stations might be used by someone else\nand that my cut showing the FM sound frequencies which was in"
}