{
  "id": "d631-78",
  "text": "UNIVERSITY OF ILLINOIS • DIVISION OF COMMUNICATIONS • URBANA\nMr. Richard B. Hull\nWOI\nIowa State College\nAmes, Iowa\nDear Dicks\nOffice of the Dean\nI have just got back from a tour of duty in Europe, and read your letter\nof August 22, together with the report to NAEB officers and directors dated July\n28. Our position on these questions can be stated simply and straightforwardly:\n1) We think that the exchange program network is far and away the most\nimportant project now facing educational radio in this country, and Illinois will\ndo everything in its power to help the project succeed.\n2) We don't want the network to be centered at Illinois unless NAEB\nwholeheartedly wants it centered at Illinois. Let me repeat that we don't want this\nfor ours elves; we want it only if NAEB wants us to do it. We are keenly aware of\nthe fine and pioneering job Sy Siegel has done on the network, and we notice with\npleasure that both Jim Miles and Harry Skornia are interested in housing the network\non their campuses. These men are our friends, and we have no interest in trying to\nget the network here rather than there. The question is simply, where does NAEB want\nthe network put?\n3) If NAEB votes Illinois its first choice for location of the network,\nthen we shall immediately proceed to seek funds to support the activity properly,\nand to step up the number of duplicates and the speed of change as quickly as equip¬\nment can be financed and supplied. We don't have funds for such improvement now,\nbut will seek them.\nU) In case Siegel should be called to active duty, we could take over\nadministration of the network, on a temporary basis, on a few days notice. I say\nthis to take care of an obvious worry that must be in your mind.\n5) Therefore, let's beware of falling over our feet from moving too\nfast. Let's get the right answer. NAEB should consider this fully and carefully\nat the Lexington meeting and decide what it considers the best thing to do. If it\ndecides on Illinois, then let us see what Illinois can do and if what it can do is\nsatisfactory to NAEB, then we can decide on the time and method of transfer. In the\nmeantime, we shall stand by to throw out a lifeline in case of such an emergency as\ndescribed in (U) above.\nYours sincerely.\nb\nWilbur Schramm\nDean"
}