{
  "id": "d631-95",
  "text": "October ST1950\nMr, Jim Miles, Manager\nRadio Station WBAA\nLafayette, Indiana\nDear Jims\nI do not w^nt yon to feel that I have neglected answering your\nletter of September 4th concerning the study you made about the HASS\nNetwork*\nFirst off, 1st n(i indicate that I think you have done a magnifi-\ncent job in collecting, tabulating and analysing the results. I m\nin a rather peculiar position concerning the study, however, and it is\nwith no small degree of chagrin and embarrassment that I m compelled\nto tell you that WHIG could not make any contribution whatever in the\nway of finance®* Our budget does net provide for any such expenditure,\nand it would take a tremendous amount of energy and, what is more im¬\nportant time to convince the City Fathers to deviate from a 25«\nyear policy, i*©*, not providing a single penny for talent*\nConsequently, this leaves m© sort of on the outside, and any\nsuggestions or criticisms that I might make would be somewhat academic\nfrom a personal point of view*\nOn the basis of cur experience in handling the network for th©\npast year, 1 do not believe that your budgetary figure® will b® suf¬\nficient! You will not be able to operate on two-fifths of a techni¬\ncian or \\two«fifthe of a clerk. Furthermore, the vast majority of our\nmailingsWive been in excess of $1*00, not 35 cents* Furthermore,\nyou have Aada no provision whatsoever for telegram® and telephone c&ll®\nwhich will\\ easily run $1000. a year at a very conservative estimate.\nOn your own figures, you will not be able to service 45 stations because\nyou will require at least two safeties of each of your programs, \\hich\ncuts your present number of stations to forty-three (43) and, likewise,\nlower© your contribution by 2/45ths0\nRooking at your 1-hour block under Item 2, while I am not too\nfamiliar with the content of the proposed program®, there is little\nrelationship among these in any one day to consider the® appropriate\nhack to back programs* Obviously, something Ilk© agricultural research\nwould not b© of major interest to Sener or myself. It is questionable\nin wy mind, therefore, (and this is based on the reaction we have bad\nfrom stations now participating in the network) whether you can option\nany time for more thru a single program* I know you must have in mind."
}