{
  "id": "d631-99",
  "text": "CONTENTS\n‘ Treason on Trial !\nAn Excursion into Suffolk\nEisteddfod Week in Wales\nG.B.S. Celebrates his 94th\nBirthday\nThis Week’s Listening..\nAll communications should be addressed to\nthe Editor. LONDON CALLING, Broad¬\ncasting House, London, W.l. Subscription\nrates and addresses to which subscriptions\nshould be sent are given on page sixteen\nBBC Radio Drama for U.S.A.\nRoyal Navy’s ‘ Shadow ’ F^eey\nBy Douglas Willis./. 3\nTHE N.A.E.B. (the National Association\nof Educational Broadcasters'), an associa-\nThe United Nations and Korea\nBy Viscount Cecil of Chehcood 4\nBy Jenifer Wayne. 5\nLondon Zoo Re-visited\nGeoffrey Boumphrey. 6\n‘These,The LivelyOraci.es of God'\nBy Professor J. Isaacs. 8\nWtorld Demands Scottish Tartans\nBy William Holt..\nOn the Enjoyment of Living \\\nBy Compton Mackenzie. 10\nX of Educational Broadcasters), an associa-\n! tion linking non-commercial stations throughout\nthe United States, has recently embarked on a\n1 new and ambitious development. Following\ndiscussions with the University of Illinois last\nyear, they have planned a wide programme of\ni broadcasts which are to be serious in content\nj and high in quality. They will be provided\ni to member stations in the form of recordings,\nand the first series was distributed in February.\nBy May this; year thirteen stations were already\n• carrying the programmes, and at least fifteen\n! more were expected to join shortly.\nThe programmes are distributed through\n| station WNYC, New York, whose director,\n] Seymour Siegal, is the moving spirit of the\nproject. Among those already carrying the\nj programmes, in addition to WNYC, are\n[j stations in Michigan, Washington, Ohio,\nf California, and Louisiana.\nA number of series have already been broad-\nX. 'cast. They have covered scientific, political\nThe Weekly Letter: by Richard\nHuson. 11\nBy Griffith Jones and\nMorgan Nicholas. 13\nIn Search of the ‘ Ashes ’\nBy John Arlott. 14\nBy Paul Holt. 17\nProgrammes for the W’eek... 20-27\nServices for Other Areas. 28\nand artistic topics, and have been collected\nfrom all kinds of sources.\nFor their dramatic series N.A.E.B. turned\nto the BBC, which has contributed thirteen\nprogrammes from among the classics of broad¬\ncasting in this country. This series will break\nnew ground in a number of ways. For one |\nthing, none of the programmes lasts less than\nan hour, and some are more than an hour and\na half, and it is very rare for a serious prOj\ngramme—even a dr a m a t i urtiO ctt\na length in the United States.\nBeginning on July 11 with The March of\nthe V5, D. G. Bridson's classic dramatisation\nof the Jacobite rising in Scotland in 1745, the ^\nprogrammes include such major works as The\nDark Toner by Louis MacNeice and The\nLady's Not For Burning by Christopher Fry.\nN.A.E.B. reports that the BBC series Js\ndrawing ‘ tremendous quantities of favourable\ncomment’ from their listeners. Later se ribs;\nwill be taken from the Canadian Broadcasting,\nCorporation and from the United Nations. j\nA Community of the Blind\nTHE Secretary of the British Empire Society\nfor the Blind, Mr. Tohn Wilson, left\nJ- for the Blind, Mr. John Wilson, left\nLondon by air for Africa to spend about two\nmonths there, mostly in Nigeria and the Gold\nCoast: parts of Africa in which there is a\ntragically high rate of blindness, and where, in\nfact, there are entire communities of blind\npeople. Mr. Wilson intends to travel among the\ntowns and villages to talk to the blind Africans,\nand he hopes that, being blind himself, he will\nbe able to establish a quick understanding\nwith them.\nSpeaking to G.O.S. listeners in ‘ Radio News¬\nreel,’ Mr. Wilson said: ‘ In Northern Nigeria,\nI hope to meet an African who calls himself\n“ The King of the Blind.” He is in charge of\na district in the native city of Kano, and in\nhis district practically everyone is blind. With\na few blind Elders, he runs this strange com¬\nmunity of blind men, women, and children, and\norganises its principal trade, which is begging.\nEach beggar has his own pitch in the city, and\nhe does fairly well amongst the pious people of\nKano. The blind women do the cooking and\nlook after the children. Many of the children\nare blind, too, for infection spreads easily.\n‘ Some of you may hav^ read that book by\nH. G. Wells, The Country of the Blind. There\nreally are such countries in Africa. I hope to\nvisit one of them, in the northern part of the\nGold Coast. It is a group of villages along the\nriver Volta, where one out of every thirteen\npeople is blind. An insect called the buffalo gnat\nbreeds in the rapids, and its bite cay^blindness.\n‘ The people have fled from some of the\nvillages, but in others they have organised their\nsociety on the assumption that it is normal to\nbe blind. Nobody knows how many blind people\nthere are in Nigeria and the Gold Coast: per¬\nhaps a quarter of a million, perhaps 400,000.\nIt is certainly an appalling number Surveys\nhave shown a proportion of blindness at least\nten times as high as that in Britain.\n‘ The British Empire Society for~fft£\"MJ7irfK\nwas formed this year to tackle the problem o\nblindness in all British Colonies. We work wi\nGovernments, with missions, and, perhaps mo\nimportant of all, with the local people themselvt\n‘ There is a great deal to do. It is believe\nthat eighty per cent, of Colonial blindness\npreventable. On the welfare side, schools, train\nin.g centres, and workshops have to be started\nMany of the native crafts are ideally suited to\nthe blind, and there is no reason at all why, with\nproper training, blind people should not make a\nvaluable contribution to their community instead\nof just being a burden to it. Books in Braille\ntype can be printed in every written language.\n‘ With UNESCO and with linguistic experts\nwe have just finished working out a system of\nadapting Braille to all. the tribal languages of\nAfrica. Of course, these ideas are new in the\nColonies, and the gravity of this Empire problem\nis not yet generally known. This year, our\nsociety is starting with a number of pilot schemes\nin preparation for a major campaign next year.’"
}