{
  "id": "d1135-0",
  "text": "r\n■\nN\nA\nE\na\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXIII, NO. 9 URBANA, ILLINOIS SEPTEMBER, 1958\nCBS PRESIDENT NAMED\nTO SPEAK AT CONVENTION\nMerle Jones, president of the Columbia Broadcasting\nSystem, will speak at the 34th annual NAEB Con¬\nvention, according to a recent announcement by\nConvention Chairman Jack McBride.\nProgram plans near completion and conventioners\nare urged to pre-register for the meetings which are\nscheduled for October 14-17 in Omaha, Neb. Head¬\nquarters for the four-day convention will be the Hotel\nSheraton-F ontenelle.\nAdditional speakers who have been invited to\nparticipate in the convention proceedings include:\nSen. Warren S. Magnuson, author of the Magnuson\nBill; Hon. Fred Seaton, Secretary of the Interior; C.\nScott Fletcher, president of The Fund For Adult Edu¬\ncation; Marshall McLuhan, editor of Explorations,\nToronto, Canada; Robert Saudek, executive producer\nof Omnibus, Robert Saudek Assoc.; Donald McGan-\nnon, president of the Westinghouse Broadcasting Co.;\nSylvester “Pat” Weaver, independent producer; and\nan FCC Commissioner.\nPre-convention activities include meetings of the\nNAEB Board, ETRC Affiliates and various NAEB\ncommittees, with the regular convention program\nfocusing on general and business sessions and individ¬\nual clinics.\nProgram highlights for the convention include:\n—President Jones’ speech the evening of Wednes¬\nday, October 15\n—A tour of Strategic Air Command Headquarters\nand underground war rooms with color television\ncommunications system, at nearby Offutt Air\nForce Base\n—Clinics showing practical demonstration treat¬\nments of radio and TV broadcasting problems\n^isuggested by members\n—Briefing sessions with capsule reports on major\nradio and TV projects across the country\n—Periods allocated for individual Regional and\ncommittee meetings\n—Opportunities to audition NAEB Network tapes\nand to screen ETRC kinescopes, both in-school\nand general\n—A special “What’s Your Problem?” hour with\nexperts in different areas available for individual\nconsultation\n—Broadcast equipment manufacturers’ displays\n—Election of officers; reports from Headquarters\nand from officers and committees\n—The NAEB Annual Banquet with an outstanding\nspeaker and program in the offing; entertain¬\nment following\nNAEB stations and production centers are invited\nto arrange for their own individual displays, as there\nwill be space provided to set them up.\nIn addition to the program planned for convention\nparticipants, a separate group of activities is planned\nfor the wives, so plan to bring them. Of interest to\nthe ladies will be a tour of Boys Town, a visit to the\nJoslyn Art Museum, a luncheon and style show, and\na special Women’s Hospitality Room.\nCo-hosting the Convention are three Nebraska\nWith apologies to John Heywood ....\nOLD PITCHERS\nHAVE BIG EYE (APPEAL)\n... so for an appealing decor at NAEB convention,\nwe’d like to use “old pitchers.” Any of our AM\nstations who can provide us with photos showing\nthe “then” and “now” of their operations are in¬\nvited to submit them to Headquarters. We’re also\nlooking for zany shots of NAEB members taken\nduring workshops or seminars.\nPlease send us anything that you think might add\nto the festivities.\n1"
}