{
  "id": "d1135-1",
  "text": "universities. The steering committee, composed of\nrepresentatives of each university, includes Jack\nMcBride, Vice-President of the NAEB and director\nof ETV at the University of Nebraska in Lincoln,\nDr. Aldrich Paul from the University of Omaha,\nand Rev. R. C. Williams, S.J., director of Communi¬\ncation Arts, The Creighton University in Omaha.\nMAGNUSON BILL STOPPED\nTHIS SEASON\nIn the final rush before last month’s Congressional\nadjournment, the Magnuson Bill lost its opportunity\nfor passage when it failed to reach the floor of the\nHouse, however it probably will be introduced at the\nfirst session of the 86th Congress next January.\nThe Senate-passed bill, giving federal aid to ETV,\nearlier was approved in an amended version by the\nHouse Commerce Committee. Voting 13-7 to report\nthe bill favorably, the House Committee amended it\nto (1) make local school districts and other govern¬\nment subdivisions—as well as states, Alaska, Hawaii,\nand the District of Columbia—eligible to receive fed¬\neral funds, but limit grants for colleges and uni¬\nversities to government-supported institutions; and\n(2) eliminate a provision that non-profit private\nETV organizations also could qualify for funds from\ngrants of up to $1 million to each state and territory.\nWhile the fate of this bill must wait until next\nyear, another measure was passed by the 85th Con¬\ngress which may be helpful to the educational broad¬\ncasting movement. The Hill-Elliott bill (S. 3187)\nprovides certain funds for research and experimenta¬\ntion in the new media, including radio and television.\nMEMO FROM THE EXECUTIVE DIRECTOR\n—Harry Skornia\nIt appears to me that we have generally overlooked\nthe encouraging, growing firmness of the status of\neducational broadcasting in the United States. We\nstill have to explain ourselves here and there, but\nmore and more people know what we’re talking about.\nI think I am not inciting overconfidence when I\ncall for still greater assurance on our part, and greater\ninitiative. Anyone who has read the Senate and\nHouse testimony connected with the Magnuson and\nother bills will find much strong support, at the high¬\nest levels, for what we stand.\nA few years ago we feared we’d lose educational\nTV frequencies. Today, where the need is great\nenough, we need not hesitate to ask for new ones, or\nfor VHF instead of UHF, where the better one is\navailable. We need no longer be apologetic, or be\nsatisfied with inferior facilities for education. Eventu¬\nally, I feel, the finest station in each community\nshould be education’s own station. It’s up to you,\nwho are responsible on the spot, to keep pressing for\nadequate financing ana adequate facilities, as well\nas recognizing the need for the highest moral and\neducational standards in all we offer.\nBroadcasting, as a public relations and advertising-\ninstrument, has played a powerful “social engineer¬\ning” role in American society. Radio and TV have\nhelped sell women on smoking, men on deodorants,\ntoiletries and cosmetics on dubious rather than\ngenuine qualities, liquor and bigger cars as “prestige”\nsymbols, etc. The time is here when these media\nshould be used to sell respect for integrity and educa¬\ntion, for whole truths instead of half truths or super¬\nficial treatments.\nThis too is our responsibility. How well we meet\nit will determine whether the respect, which we are\nbeginning to win, will increase or wane. Let’s make\nboth educational radio and television permanent and\ndependable oases in the intellectual and moral fron¬\ntiers of atomic-age America.\nNETWORK NEWS\n—Bob Underwood\nNetwork members can look forward to receiving some\nvery interesting “specials” from us during the coming\nweeks. Among these will be a discussion of “Science\nand Secondary Education” by Dr. James Killian, Rear\nAdm. Hyman Rickover and Dr. Merle Tuve; a con¬\nversation between Carl Sandburg and Frank Lloyd\nWright, with Alistair Cooke as moderator; a very\ninteresting panel on British relations with the United\nNations featuring, among others, Allen Nevins; Mme.\nChiang Kai-shek’s address at the University of Michi¬\ngan; and some special Christmas shows for use during\nthat season. In addition, we are arranging for some\nmore specials which you should find of interest.\nThese “specials” are in addition to our usual\nnine hours per week which may be had by full-time\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 14 Gregory Hall,\nUrban-a, III. $5 a year, edited by Jane Lombard.\n2\nNEWSLETTER"
}