{
  "id": "d1135-6",
  "text": "projector, 35mm slide projector and TV film camera\nworth $11,000.\nPROGRAMS\n^ The American Optometric Foundation has given\n$3,500 to Indiana University for the filming of a\nspecial TV series on vision and optometric science.\nThe series, titled “Let’s See,” involves five half-hour\nshows. Similar programs were inaugurated in the\nsummer of 1955 and additional productions were\nfilmed each of the two succeeding years.\nPERSONNEL\n^ Ernest C. Ball is the new managing director of\nWKNO-TV, Memphis, Tenn., succeeding Admiral H.\nM. Martin who resigned. For the past 22 years, Mr.\nBall was superintendent of Memphis schools and is\npresently a member of the State Board of Education.\nHe also served as a trustee and member of the execu¬\ntive committee of WKNO.\n► Harold B. McCarty, director of the University of\nWisconsin radio and television stations and the State\nBroadcasting Service, was recently honored in a\npersonality sketch published by The Wisconsin State\nJournal in Madison. Featured in its July 6 issue,\nthe article included a photo-sketch of McCarty and\nan account of his activities and success with the\nuniversity stations, WHA (AM), -FM, ana -TV.\n^ John E. Young, director of WUNC-TV, Chapel\nHill, N. C., started a year’s leave of absence this\nmonth to join the staff of the ETRC in Ann Arbor,\nMich. As program associate at the Center, he will\nconsult with ETV stations in the Midwest and radio\nstations throughout the country.\n^ Edward G. Sherburne, Jr. recently accepted a\nposition as head of the Department of Visual Com¬\nmunications at the University of California in Berke¬\nley.\n^ The appointment of Gregory G. Harney, Jr. as\nProduction Manager of WGBH-TV, Boston, became\neffective this month. During the past year, Harney\nwas retained by the ETRC as a consultant for several\nof the nation’s ETV stations. He has also just pro¬\nduced a film on TV lighting which will be used by\nETV stations on the air and by others as they begin\noperation. For the past eight years, Harney was\nlighting director for CBS-TV in New York.\ny Two administrators who were invited' to partici¬\npate in last month’s NAEB Station Management\nSeminar were unable to attend due to illness. John\nDunn of KUED, Norman, Okla., recently returned\nto his home after hospitalization. However, Vernon\nBronson, from WTHS-TV in Miami, is still seriously\nill and is confined to Jackson Memorial Hospital.\n\\t> Three more Broadcasting Pioneers claim their\nstatus. Since the last Newsletter, we’ve heard from\nGraydon Ausmus, Director of Broadcasting Services,\nUniversity of Alabama, University; John Groller,\nSecretary for Religious Broadcasting of the Board of\nNational Missions of the Presbyterian Church, New\nYork City; and Tracy F. Tyler, NAEB Journal Editor\nand member of the University of Minnesota faculty\nin Minneapolis, teaching radio-TV education to\nteachers ana prospective teachers.\nJames M. Morris, Director of Educational Radio and\nTV, Oregon State System of Higher Education, Cor¬\nvallis, Ore.; E. A. Hungerford, Jr., Director of op¬\nerations, Metropolitan Educational Television Assn.,\nInc, New York City; and Paul C. Reed, Director of\nInstructional Materials, Rochester (N. Y.) Board of\nEducation.\nTV TECHNICAL TIPS\n—Cecil S. Bidlack\nOn July 31, the FCC adopted a new policy regarding\nthe operation of private television microwave links.\nWe quote the new statement of policy:\n“Television broadcast station licensees will have\nthe option of operating their own private television\nintercity relay facilities or obtaining intercity tele¬\nvision transmission service from communications\ncommon carriers in all cases except those in which a\ndirect interconnection is desired with common carrier\nfacilities. Such relay stations are not to be used as\nintermediate links in common carrier intercity tele¬\nvision transmission facilities.”\nThe above ruling means that it will now be pos¬\nsible for educational stations to build state or re¬\ngional networks regardless of the fact that common\ncarrier service is available to serve the stations or\ncities interconnected. In the past, private facilities\nwere authorized, however once the common carrier\nfacilities were available to provide the service, they\nwere obligated to use it regardless of the fact that\ntheir own microwave links were providing a satis¬\nfactory service at a much lower annual cost.\nThe Commission, in announcing this policy,\nstipulates that “the use of frequencies for intercity\nrelaying shall be on a secondary basis and subject to\nthe condition that no harmful interference is caused\nto television pickup and television STL stations”.\nAt the present time, there are about 50 private MCW\nlinks in use including those at ETV stations in Ala-\nSEPTEMBER, 1958\n7"
}