{
  "id": "d1857-10",
  "text": "- O -\nto make experts1 opinions.\nOf the WAYS OF MANKIND, produced with Dr. Walter Goldschmidt as consultant by\ntalent from the CBC, it need only be said that the writing and producing are\nabsolutely tops, and that as an educational radio program, this one will be\nvery, very difficult for anyone to surpass.\nWe are now working on a series called THE PEOPLE TALK BACK. In most discussions\nthe listener has no chance to get his word in; the experts talk among themselves\nand the listener just listens. In this series, we are recording the experts\nopinions, playing them back to a group, and recording the groups comments and\ncriticisms.\nIn the field of international programming, there have been some real problems.\nThe director of the Third Program was invited to New York and also the director\nof the CBC for a week’s discussion on a program on foreign policy. Agreement on\nthe nature of the program seemed impossible. It was finally agreed that each\nnation would produce a program; then all would play them in London in Septem¬\nber and see if they could agree on which to use. Meanwhile, in Italy and France\nthe efforts of the NAEB produced a fine reaction. The plans to carry French\nplays in French, Italian opera, music programs about French composers were not\nonly fine international relations in themselves but represented real education¬\nal broadcasting at its best. The first French program to be carried on WNYC\nreceived immense publicity, a front page story in the Christian Science Monitor,\neditorials, etc. We are writing cultural history.\nThe State Department has called on us to place materials on foreign broadcast¬\ning systems. Since the Voice of America is considered a propaganda agency,\nforeign broadcasters are, understandably, reluctant to carry Voice of America\nshows. But we can do it, and so we have become the international force for our\ncountry. In return, we are getting a quantity of top-notch programs. NAEB has\nbecome a member of Prix Italia, an international affiliation which represents\nthe cieam of broadcasting efforts in 14 countries. The best musical and non¬\nmusical programs will become available to us through this affiliate. The NAEB\nhas been invited to a conference on April 20-24 to help discuss with Radio\nDiffusion Francaise what should go into their program, THE INTERNATIONAL UNI¬\nVERSITY OF THE AIR. This is a sort of ’’French cocktail” consisting of 10-\nminute talks by the world’s greatest scholars.\nHow can the members best help the international effort of NAEB? By giving these\nprograms the right treatment on our station, good time, plenty of promotion,\netc. And if we have any ideas for creating better understanding among the na¬\ntions of the Western world, this is our opportunity. We have available to us\nnow the great media of communication of the foreign nations themselves.\nThe next speaker, Graydon Ausmus: Subject - ’’What’s Happening in TV”; The sto~\nry begins with the JCET, an organization composed of 7 constituent members,\neach a major organization in education. These are the American Council on\nEducation, Association for Education by Radio-Television, Association of Land-\nGrant Colleges and Universities, National Association of Educational Broad¬\ncasters, National Association of State Universities, National Council of Chief\nState School Officers, and the National Education Association of the United\nStates. The original purpose was to get the channels set aside^ Now it is\nto get them used. The effort was first supported by $50,000 from NAEB, later\n$90,000 from The Fund for Adult Education. The current budget is even higher,\nand next year it will probably be close to $200,000. If we get only 10$ of the"
}