{
  "id": "d1857-24",
  "text": "-20-\nPUERTO RICO: Jose Buitrage, WIPR, San Juan\nRadio\nWIPR is the only educational station in Puerto Rico. It started as a commercial\nstation, government-owned, and operated for six months as such. Pressure from\ncommercial broadcasters caused suspension of commercial operations and forced\n..WIPR to go educational. A public broadcasting board was set up to govern sta¬\ntion operations.* This board met once and made three decisions: 1) it appoint¬\ned Mr. Buitrago manager, 2) instructed him not to carry political or religious\nprograms, 3) told him he had a year of grace. WIPR’s problems were unique.\nMr. Buitrago in herited a 51-man orchestra, a theatre seating 300 persons, pro¬\nfessional movie projection equipment, 8 remote units, 5 Brush tape recorders,\nand a vast collection of soap opera scripts. The staff had not been selected\nwith an eye toward educational operation. The station was committed to 15\nhours a day on the air, 6:45 a.m. to 11:00 p.m. Conversion to educational pro¬\ngrams was slow. A great deal of help was received from BBC, RDF, and Radio\nNetherlands with their programs in Spanish. The competition in Puerto Rico\nis •‘amazing\"; commercial radio there makes U.S. network fare look like the BBC’s\nThird Program. The station with the largest audience carries 19 hours of soap\nopera per day. The ethics of radio surveys made in Puerto Rico have been ques¬\ntionable: ratings have been given to WIPR when it was not on the air* WIPR’s\nmain interest is adult education, and now, after 3 years, it is well established\nand provides a yardstick against which commercial programs can be measured.\nTelevision\nThe television project has been approved in principle. Inhere will be only one\neducational channel in Puerto Rico, andit is planned to join commercial broad¬\ncasters on a common site with a common tower and full power. The government is\nputting up the money for development. Commercial stations will have no advan¬\ntage over WIPR, coming in at the same time, and it is felt that the commercial\npeople do not realize the complications which television will create. Commer¬\ncial operators are planning facilities for scene building, visual aids, etc.,\nand WIPR should be way ahead in its planning. There are special problems in\nPuerto Rico which will require special solutions. They are fearful but feel\nthey have no choice and will go ahead. Operation costs are a frightening factca;\nbut they hope that the central distributing agency of the NAEB will come through\nwith a good quantity of good programs.\nit it &\nIn the discussion period that followed, the first question which was asked was:\nWhat are the chances of extension of the June 2 deadline? The consultants\nreplied that if the community could show activity, the chances are good for\nextension. The deadline itself has been a good thing in making the educators\ngo ahead; however, it is likely that if pressure has kept a community from\nmaking progress thus far, the same pressure will get the asterisks removed from\nthe allocation lists.\nHas the report of the New York Commission hurt TV plans in the more progressive\nstates? It has, because construction permits had already been granted. But on\nthe other hand, it has served to crystallize support for educational television.\nIn one community in North Carolina we have the support of commercial operators\nand no opposition. We expect to be able to raise some money. Our production\npossibilities are not too great. If we had enough money for a projector opera¬\ntion, what would v/e be able to put on? The Chicago Center will be putting out\nfilms and kinescopes with an original goal of an hour a day within two years."
}