{
  "id": "d1857-7",
  "text": "- 3 -\nSiegel gave us national significance. For the first time people began to\nrealize that in .America we have a dual system of broadcasting, and he urged\nthat we stress this fact in our teaching and in our public approach. People\ncan no longer say ’’American Radio” and mean ’’Commercial Radio.” They must\ntake us into account, and we ourselves must be the publicists of the change.\nAnd now, as Mr. Siegel has pointed out, the NAEB has become internationally\nsignificant.\nWhat now? We need to do vigorous, far-reaching planning and thinking; we must\nstay out in front. We are a part of a very significant movement - one of a num¬\nber of organizations trying to extend education to the total population; a task\nwhich is staggering in its problems and immense in its implications. It may be\nthat the second half of this century will be known to history as the period in\nwhich education was extended to adult populations. We must not forget that we\nare radio-television, but we must remember that, first of all, we are educators,.\nWe can’t expect to be saviors, but we can play a very significant role...This is\nour dream.\nAnother goal must be a solidification of our organization and the utilization\nof the resources of our members. We must pull ideas out of this conference and\nothers like it. We need broader participation from our members. We need a\nwider use of the existing brain power.\nOther goals which we must strive for ares (l) expansion of headquarter opera¬\ntions which now operates 6-8 hours per day,(2) expansion of consultation serv¬\nices on the local level, (3) expansion of international relations (the new\nopportunity in regard to the Fulbrights is a good example of this)• Inter¬\nnational exchange of communications people is vitally important. This year 3\nof our folks id.ll go abroad. Next year, if we are successful, perhaps 6 or 8\nor 10. (4) we are beginning to expand through cooperation with the Voice of\nAmerica, with which we are now negotiating, (5) we must meet the needs of the\npublic schools with more programs and more ideas, (6) we must face the problem\nof the distribution of programs to the schools; the library of the U.S. Office\nof Education is about to die. Should the NAEB take over? (7) we must expand\nour membership. In the past it has been restricted to station operators.\nShould we include teachers of radio, or does The Association for Education by\nRadio meet this need? (8) we need to solve the problems of upgrading of per¬\nsonnel and of academic curricula, and (9) we need to examine the services\nprovided our associate members. Are we doing all we can?\nFinally, our greatest challenge is in educational television. What is our role\nto be? We are an advisory group to the Educational Radio and Television Center.\nDo we tell them what is needed? Are we a program, script, and film exchange?\nWe need to look for challenging visionary ideas such as a landline or relay-\nconnected educational network. Working together, we can advance the cause of\neducation, the cause of educational radio, and the cause of educational\ntelevision.\n# V< -K- % * % # % %\nEarl Wynn then led a brief discussion period. The question was asked, ”How\nabout a mobile television unit to act both as a central service and a demon¬\nstration device?” It was pointed out that as a central service it wouldn’t be\nneeded because the program center would probably solve the program distribution"
}