{
  "id": "d1206-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nU^bana, Illinois\nJuly, 1, 1939\nPROGRAM PLANS FOR CONVENTION\nPreliminary plans for the program of the annual convention of NAEB,\nwhich will be held September 1 and 2 in Ames, Iowa, have been com¬\npleted by the Committee of President Carl Menzer, NAEB Treasurer\nWo Ic Griffith, and Frank Schooley, Executive Secretary* The completed\nprogram will be announced in the News Letter for August 1* In the\nmeantime, make your plans for attending the convention.\nAt the Friday morning session there will be the welcome by the Presi¬\ndent of Iowa State and response by the NAEB prexy* It is hoped to\nhave reports of research on educational values of the use of radio\nand a report on what Is being done with radio by the Cleveland and\nChicago schoolSo\nThree nationally known figures in radio have been invited to speak\nat the Friday afternoon session, but until acceptances have been\nreceived from them, we deem it best not to overdo the publicity.\nAt 4s30 the seasion will adjourn in order that guests may view the\nWOI studios and transmitter site, etc.\nThe only organized food-meeting of the convention will be held at\n6 o'clock Friday evening In th© Ames Memorial Union Building.\nGriffith promises good food and a comfortable place to eat. Follow¬\ning the food, will com© facsimile and television demonstrations.\nThen, at 8sl5 p.m., the engineers who wish to discuss technical problems\nwill be steered (no pun) In a bull session by Chief Engineer Stewart\nof WOI*\nFriday's session will be open to all NAEB members and to the publio\nin general. However, Saturday's two sessions will be closed to all\nexcept NAEB representatives.\nLuke Roberts of KOAC will preside over the Saturday morning Roundtable\nsession, which will include a brief report by the recording test\ncommittee, and discussions on topics of importance to members. The\nfollowing topics have been suggested?\nWhat88 Wrong with Educational Broadcasting?\nWhat are Educational Stations Doing to Improve Their Programs?\nWhat Should Be the Objectives of Eiuoational Broadoasting\nStations?\nHow Can We Have better Programs with Monies Available?\nHow Are Members Getting More M ney to Finance Their Broadoasting?\nHow Can Facilities of Stations Be Improved?"
}