{
  "id": "d426-157",
  "text": "example, in Margery’s scripts, the teacher refers to the radio\naudience as \"students”. Since a large part of that audience\nvill be adults, many of whom will probably be teachers, I refer\nto them as \"our listeners\" or merely as \"all of you” or some such\nphrase# Probably the scripts wtfould be adjusted so that this\npractice is the same in all the scripts, and you people and Dr.\nGoodell should know which is best.\nA similar inconsistency is Margery's use of \"radio teacher*\nto refer to the teacher, as against my use of the word \"teacher”\nalone•\nA somewhat different inconsistency is the role we have given\nDonna. In my scripts, the teacher may ask the listeners to repeat\nsomething after Donna, but Donna herself never asks them. In my\nopinion it unduly complicates the lesson to have two people telling\nthe listeners what to do. Margery apparently feels otherwise (we\nhave not discussed this), because I see that she has Donna telling\nthe listeners to repeat things after her now and then. This is\nanother point that you and Dr. Goodell could probably settle better\nthan we can.\nOne convention that both Margery and I have used is PAUSE...\nREPEAT.. .PAUSE. This always follow a sentence that is said by\nsomebody and which the listeners have been told to repeat. It\nmeans that the sentence should be said by whoever is saying it\ntwiee, with a pause each time after he says it, so that the listeners\ncan say it twice, too. We do not know whether this convention\nshould be continued in the final form of the script or whether\nthe sentence whould be written out twice for the actor to read,\nwith a pause indicated after each of the sentences. Probably the\nVOA has some rule that would decide this question.\nHaving the scripts typed in Washington is complicating things\na little in one way—it is causing me to go back and clean up some\nof my drafts so that the tyjist won't have to ask any questions.\nHere I have not been too careful, because the typists could\nalways phone me. In some cases, as with lessoD 3, which I am\nenclosing, it is simplest for me simply to type the script up,\nbut in other cases, to save time, I will submit it in manuscript,\nas I have to the typists here.\nI am enclosing only three scripts herewith, nos. 1, 2 & 3.\nMargery has turned half a dozen more over to me, but I'm having to\ngo through them to make a few corrections—Britishisms, etc. I\nexpect to be able to send scripts 4 through 18 tomorrow.\nI enclose a copy of tjiis letter for Dr. Goodell. Please\nexcuse the typing.\nSincerely,\nn *■\n0. Dean Gregory"
}