{
  "id": "d426-167",
  "text": "2\n27-28* At Dr* Goodell*s urging, I am looking into the pos¬\nsibility of recruiting on* or more additional persons to\nassist me on this project in the future, particularly after\nMargery Morris*s departure* I have found several possibil¬\nities, but I have made no committments, pending notification\nof the definite availability of funds and of your instruc¬\ntions that on* or more additional persons be hired* Accord¬\ning to my understanding, Dr* Goodell expects to make funds\navailable for additional personnel*\n5* Personnel. During the month of June, I worked on\nthe 65-script series and, with Margery Morris, on the 39-\nscript series* Dr* M* h* Rosendal continued to work on the\npoetry series, but t had no contact with him, though Dr*\nGoodell did show me three of his analyses* Allan Kulakow\nprovided conversations for the first 14 scripts in the 39-\nscript series, and I am now sending him copies of our revi¬\nsions of these conversation and the problems which the\nremaining scripts will deal with* As you know, under the\npresent plan, we are using one conversation for every two\nlessons, or approximately 20 conversations in all* We have\nhad to revise Allan’s conversations substantially, but we\nwere generally able to use his situations and thereby save\na good deal of time* Miss Barbara Richardson, a graduate\nstudent, has been doing our iyping, and I \"will forward her\nbill when she has finished typing the first 13 scripts.\nShe charges the standard rate in this area—35/^ per page\nplus 5/- for each carbon* I have been having her make 3\ncarbons* I have contacted Dr* Stanley Saoon* but we have\nnot yet been able to make an arrangement for consultation*\nI am now preparing a letter for him, and I will send you a\ncopy.\n6* Expenses* Other than travel expenses, claims for\nwhich have already been submitted, expenditures for this\nproject have been confined to communications thus far. I\nenclose an itemized claim for these expenditures. They\ntotal $4*13*\nI am enclosing a copy of this letter for Dr. Goodell*"
}