{
  "id": "d426-183",
  "text": "III. Selected Cogent and Suggestions\nThere follows an edited selection of contents given by various posts to questions\n2. 3f 7 and 8 ©nd 4K comments and suggestions offered in response to question 12.\nPost comments are reported in alphabetical order following the questions to which\nthey refer.\nQ. 1 Of what potential usefulness and importance would you consider radio courses to be\nas a. .part of the . PSIB English teaching effort in. yqur area?\nBeirut! Ueeful if suppleaental to ITV \"Let's I*arc English,\" now playing here.\nCairo? Radio still the surest means of reaching scattered towns & villages comprising the\nbulk of the population. They complement and supplement direct teaching classes and\nEnglish by TV classes.\nCaracas: Useful in augmenting efforts of bi-national centers,\nColombo: Supplementary and complementary to teachers* seminars.\nPer es Salaam? Of little use in this British-oriented country.\nGuatemalai Same as Beirut.\nKabult Demand continues to exceed facilities.\nKhartoum: May be able to work out radio-teaching of English in nation's school system.\nPlacement of such a series would aid in placing other programs,\nDims,: Post doubts their value in the sense that they will teach English. Potentially\n** \"popular” though.\nMagadiscio? Demand for English instruction at USI8# AID and British Council exceeds\navailable facilities.\nManagua; Limited use as part of IBIS teaching services, 70$ illiteracy here.\nMexico City? Of great use in holding down requests of smaller localities for BMC*a.\nMontivedeo: Taped programs useful even if radio placement impossible! should build booths\nfor tape recorders in U.S, Information Center.\nMoscow? Contacts in beginning stagej can be disrupted anytime.\nOslo? Ho use, florwegians do an excellent job themselves.\nOuagadougou: BBC course discontinued! too complex, difficult; audience indifferent.\nPhnom Penh: Of value in building V0A listenership. Do not replace classwork for the\nseriously interested.\nPort-au-Prince: With 85-90$ illiteracy rate, radio teaching is most important.\nRangoon? English teaching and speaking on wave here. Still tremendous desire on part of\nyoung people to learn it."
}