{
  "id": "d426-184",
  "text": "Ill* (continued)\nRome: Marginal use at best.\nSan Jose: Compliment the U8IS courses.\nSan Salvador: Audience would lack drive and patience to persist* Willing to try it,\nSeoul: Has became a programming ”raust.\"\nTananarive: Use as part of center English teaching effort, even though it can’t be placed\non radio*\nTehrans Useful supplement to the BBC’s and BPAO’s*\nTokyo: We want conversational English, have enough student’s English*\nTripoli: USIS efforts specialized* Radio reaches far wider audience,\nUsumbura: .Minor importance insofar as linguistic results are concerned; great Importance\nin increasing interest in learning,\nQ, 2 So you consider that English-teaching radio courses must be broadcast locally in\norder to be effective, or do you feel that UOA short and medium wave would suffice?\nGeneral tenor of answers is for local broadcast, as it would enable posts to keep in\ntouch with students. Posts which replied \"VGA only” are* Stockholm, Beirut,\nHew .Delhi, WK, Damascus, end Phnom Penh, WWHKr, Tripoli, ’SaamMoscow, Warsaw,\nSalisbury. Most of these posts state the impossibility of placing programs locally and\nsay YOA is only recourse*\nh. 3 (Second half; Are there any conditions which might have to be observed?)\nCairo: Bo credits to DEIS or UOA3 material to be adapted by post to fit unique local\npolitical and social situation*\nConakry: Conditions would undoubtedly emerge during discussions with government officials*\nDjakarta: Probably will be conditions3 we’ll discuss them when we get programs,\nFort-de-Franees Ho attribution to USIS or UOA in scripts or distributed texts.\nHong Kong: Material free of herd propaganda content,\nKabul: Any such broadcasts must be ”non political,”\nKhartoum: Programs to be educational and not contain any political propaganda,\nMexico: Mon attribution to UOA,\nMexico City* Tapes ready for release without any local adaptation or English or Spanish\nvoicing. Permission to seel local sponsorship to pay for time. Unattributed lessons\nwill get wider use.\nMoscow: Delete all references to UOA or USIA, Ho negative reference© to communism of the\nSoviet Union."
}