{
  "id": "d426-194",
  "text": "ri3t@ question® which follow are based an suggest!©m developed as a\nmmeqpmc® of amslysing and interpreting the qpestlotmalre 8\n1, la developing the proposed English -teaching programs, might it\nlie , will to concentrate on large regional -targets, for exss^le,\ncan emmtrias, southeast Asia, the Middle Bast, etc. and\nvary production -mines accordingly t\n2* Bo the harrier® raised by Iron Curtain countries suggest use of\nVOA only on advanced or literary levels? She same applies to\nthe countries of northwestern Europe, if they can be expected to\nashe any use of such broadcasts?\n3. -Should a careful study of BBC program materials be undertaken to\ndetermine reasons- for their seeming lack of appeal in mm areas?\n1. Should special attention be given to the need for developing\ncosplementary texts and materials tor use in testing?\n% EhouM attention be given to ways of achieving appropriate\n’ feed-back\" regarding the results of local broadcasting of\nthe proposed lessons?\n6. Although limited in numbers of responses, there is a clear\nsuggestion that ITT would be preferred in mm place©. Might\na coi^sarison of radio versus TV' course result® be undertaken\nprofitably?\n7. Ehe meed to ovoid i^pcl&tabla \"propaganda\" in the broadcasts\ncannot be ovoxstressed.\n8. Bees the aversion to the English language in Malaya, etc.\nmake VOA short-wave broadcasting especially desirable in such\nplaces?\n% Should middle eastern effort® take into account the appomt\n4P& unusual sueees© of VOA modee?\n10. HiouM certain individual questiommiros and responses, for\nexample, the recotaasndation concerning certificates (received\nfrom Chile), the lack of local facilities is India, and the\ncouspXeteness of answers given by Cairo, be given more thorn\npassing attention?\n11. Should possible ignowsaee of those responding to questionnaires\nconcerning the effort® of local schools, colleges and govern¬\nments be explored? Bo the questionnaires reflect a true aware¬\nness of all activities under way"
}