{
  "id": "d426-203",
  "text": "years he was interested in the Bysterious and the occult; his poetry produced\ndaring this period reflects this mystical viewpoint.\nIn IB96, Yeats was attracted by the Irish Revolutionary movement and became\nactive in political life. With his friend Lady Gregory he founded the Irish\nLiterary Theatre and the Irish Academy, for which he wrote many plays. He\nwas acknowledged as the leader of the Irish literary renaissance which produced\nSynge, Joyce, and others.\nHe married in 1917 and with his family settled on the Irish seacoast.\nRetaining his interest in politics, he was for six years a member of the Irish\nSenate. During this period Yeats was drawn to aysticism and was much criticised\nfor his outspoken views on this subject. He produced the finest writing of his\nlong career Airing this period and won the Ifobel Prise for literature in 1923.\nCritics agree that he was one of the few poets whose later work was his best:\nelaborate, symbolic, ornamental poetry of his youth developed into the austere,\nobjective, beautiful work of his old age.\nIV. VOCABULARY NOTES\ndespair:\nTo be \"thrown into despair\" is a very serious situation. A complete\nloss of hope and discouragement in the extreme are characteristic of this\nstate. As used in this poem, the phrase, describing a young man in love,\ntore, has a lighter, less serious meaning and suggests the minor confusions\nand disappointments characteristic of a romantic love affair.\nramparts:\nThe comparison «f Anne’s hair with military barricades suggests that her\nyellow hair protects the girl fro® young men at the same time it attracts\nthem to her.\nyellow:\nYellow is rather an unusual word to describe hair, particularly because\nthere are several special English words which describe this color of hair.\nBlonde may be either adjective or noun (Blond is the masculine form of\nthesame word); Fair-haired Fair, light or emven golden-haired are common.\nYellow, used to describe a woman’s hair, gives plesant, almost playful\nspirit to the description/\nSUGGESTIONS FOR FURTHER STUDY\nEDITIONS OF THE POET’S WORK\nAutobiography of William Butler Yeats. New York: MaeMlllian Company, 1953.\nigsr \"lt-4 R-“1"
}