{
  "id": "d426-216",
  "text": "IH. ABOUT THE POET\nBorn 1886\nDied 1^61\nH.D.\nHilda Eoolittle is among the most skilled of the Daagist group of poets*\nBom in Pennsylvania, she vent to Europe in 19H and lived them for fifty\nyears, until she died. Although best known for her Daagist poetry, \"H.D.”\nas she was know, was a serious student of Greek Classical poetry and translated\nmany works into English. This early training provided her with the control and\nobjectivity which enabled her to produce some of the finest Daagist poetry. She\nhas been called \"the glacial sappho.*\nThe Dnagists rose to prominence in America about 1912-1914. Many American\npoets (Amy Lowell, Robert Frost, Carl Sandburg, Hart Crane, Wallace Stevens)\nwere attracted to the movement which embodied many of the techniques mid\ncharacteristics of Japanese poetry. The Daagist precepts of using common\nspeech, being free in the choice <xf subject, experimenting with rhythm, and\nsuggesting rather than completely stating an idea, are all evident in the\npoetry of H.D* Her best work illustrates the Daagist belief that \"concentration\nis the very essence of poetry\"*\nIV. VOCABULARY NOTES\ngreats\nShis word means big or large,, but has the additional implication of\nspecial significance, importance, nobility. As used to describe the massive\nwaves 0? green water spmsffijg onto the beach, great suggests the imposing,\neven noble quality of the sea.\nrocks:\nRocks may either be small or large. Da this poem, of course, they are\nare large. Stones and pebbles generally refer to rocks of relatively small\nsize, whereas*”boulders are large rocks.\nsea:\nOhis word has many connotations which the word ocean does not. Sea is\nan older word in the English language and suggests more poetic qualities than\ndoes ocean which is a more objective, scientific word.\nSUGGESTIONS FOR FURTHER STUD!\n(1) A SELECTION FROM TSE POET*8 KBf WORK:\nSelected Poems, \"H.D*\", New leak: Grove press, 1957*\nSelected Boons. \"H.D.\", Toronto: Collins, 1957*"
}