{
  "id": "d426-226",
  "text": "2\nIII. ABOUT THE POET\nWallace Stevens Bom 18T9\nDied 1955\nWallace Stevens was an individualistic poet. Neither his personal\nlife nor his work seemed to fit into any established groove. Educated\nat Harvard, he became a successful insurance lawyer. His poetic talent\ndeveloped late in his life - he was thirty-five when his poems were first\npublished - and his work was unique from the beginning. He was not influ¬\nenced by other poets.\nMost persistent in his poetry is the theme of the relationship between\nstark reality and reality to which has been added one's imagination and\nart. Stevens seemed to feel that emotion is vital to true rationality.\nStevendd elegant and ornamental language, used in ways that polish and\nenrich his themes, is particularly noteworthy. His poetry demands careful\nand attentive reading, and has therefore not been widely popular. Tat among\ncritics and discriminating readers alike, Stevens' work is admired for\nits opulence of language, its subtleties of connotation, and its power.\nIV. VOCABULARY NOTES\nceinturesi\nThe use of this word is limited to literary occurrences* A more com¬\nmon form is cincturei related words ares Cinch (noun and transitive\nverb)(a strap that encircles the body of a horse or other animal; to\nbind); frecinct (n.s.)(a space with definite limits or boundaries);\nand shingles (n. pi.)(thin pieces of material used to cover roofs and\nsides of houses).\ndisillusionment:\nThis word is central to the theme of the poem. It denotes \"the process\nof becoming free from illusion\" and connotes depression and disappoint¬\nment aa well.\nnightgowns;\nThis common noun is idiomatic in English. Notice the difference in these\nsimilar forms: evening gowns (long dresses worn for formal social\nevents) and bedclothes (sheets, pillow cases and blankets).\n. SUGGESTIONS FOR FURTHER STUDY\n(1) SELECTIONS FROM THE POET'S WORK\nCollected Poems. Wallace Stevens. New York: Alfred A. Khopf, 195^*\nOpus Posthumous. Edited by Samuel French Morse. New York: Alfred\nA. ltaop£, 19ifr\nV."
}