{
  "id": "d426-50",
  "text": "mrch 26, x96k\nA.P. Vktt and Son\nHastings House\nNorfolk Street\ntajdon W.C* 2, England\nA!OT; Permissions Bepartment\nBear Sir:\nm are requesting authorization from A.P. Watt and Son to use the following\npoems by W.B. Yeats for which we understand you hold the copyright: '’For\nAnne Gregory” and/or ’’Politics”.\nPermission to use these materials is being sought by the N.A.E.B. in\nconnection with an arrangement we have with the Voice of America to develop\nandEnglish through Poetry series, dhe 13 commentaries for those programs\nare being written by Professor M.L. Rosenthal of the New York University.\nShe Voice of America, in turn, working closely with Professor Rosenthal, will\nproduce 13 quarter-hour radio scripts on the basis of these commentaries.\nShe radio programs themselves are intended for broadcast to listeners\noverseas, and are being designed to appeal to the listeners interest in\npoetry in the English language.\nIn each script the poem will be read in its entirety, and the listeners\nwill also be invited to read the lines aloud in appropriate units after\nthe radio speaker.\nPermission is sought both for the broadcast by the Voice of America to\noverseas countries and for broadcast in countries where local radio stations\nmay receive the taped programs through the United States Information Agency.\nPermission is also sought for publication of the poems that might be\npublished in any given countyy (with the aid or supervision of U.S.IA.),\nand distributed free or at cost to radio listeners. Permission is also\nsought for eventual publication of the materials in a similar study booklet\nto be produced by U.S.I.A. for gratis distribution to overseas listeners\nwho request such booklets.\nVfe hope we will hear from you shortly and that authorization to use this\npoem in the manner which we have outlined will be forthcoming. If you would\nlike to have additional information about the use to which these poems frill\nbe put, may I suggest that you contact £r. Robert Goodell, Chief, Radio\nEnglish-Tcaching Branch, Voice of America, Washington, B.C., Phone WO 3-6378.\nSincerely,\nJAF:se\nJames A. Fellows\nAssistant Director"
}