{
  "id": "d426-71",
  "text": "April 23, l$6k\nmss Ruth Nivison\nHead Tide, Maine\nDear Miss Nivison:\nWe have requested and received publication rights from mss Youngstrum\nat Charles Scribner's Sons to use a poem by .E.A. Robinson, \"Richard\nCory.\" mss Youngstrum suggested that we contact you regarding per¬\nmission for the world-wide broadcast rights.\nremission to use these materials is being sought by the N.A.E.B. in\nconncetion with an arrangement we have with the Voice of America to\ndevelop an English through Poetry series. The 13 commentaries for those\nprograms are being written by Professor M I#. Rosenthal of Hew York\nUniversity. The Voice of America, in turn, working closely with\nProfessor Rosenthal, will produce 13 quarter-hour radio scripts on the\nbasis of these commentaries. The radio programs themselves are intended\nfor broadcast to listeners overseas, and are being designed to appeal\nto the listeners interest in poetiy and in the English language.\nIn each script the poem will be read in its entirety, and the listeners\nwill also be invited to read the lines aloud in appropriate units after\nthe radio speaker.\nPermission is sought both for the broadcast by the Voice of America to\noverseas countries and for broadcast in countries where local radio stations\nmay receive the taped programs through the United States Information Agency.\nPermission has been granted for publication of the poems in any given\ncountry (with the aid or supervision of U.S.I.A.) for distribution free\nor at cost to radio listeners, and for eventual publication of the materials\nIn a similar study booklet to be produced by U.S.I.A. for gratis distribution\nto overseas listeners who request such booklets.\nThis series of 13 different poems is an educational tool not only for the\nEnglish language, but for the enjoyment and enrichment of poetry itself.\nAt the present time we have heard from all but one publisher and we have\nbeen granted permission to use their material gratis or for a nominal fee.\nWe are hopeful that in view of the nature of this project, we may also\nreceive the broadcast rights under the same conditions."
}