{
  "id": "d426-81",
  "text": "March 18, 196k\nChatto and Windus Publishers\n1jO-42 William IV Street\nLondon W.C. 2, England\nACTS Rights and Remissions\nDear Sir*\nWe are requesting overseas authorization from the Chatto and Hindus Publishers\nto use a poem by Richard Eberhart, f*For A lmb,1 tor which we understand you\nhold the copyright. Wfe have already contacted the Oxford University Press in\nHew York for permission, which we received, but they informed us we must also\nobtain overseas permission from you.\nPermission to use this material is being sought by the H.A.E.B. in connection\nwith an arrangement we have with the Voice of America to develop an English\nThrough Poetry series. She 13 commentaries for those programs are being\nwritten by Professor M. L. Rosenthal of New York university. The Voice of\nAmerica, in turn, working closely with Professor Rosenthal, will produce 13\nquarter-hour radio scripts on the basis of these commentaries. The radio\nprograms themselves are intended for broadcast to listeners overseas, and\nare being designed to appeal to the listeners interest in poetry in the English\nlanguage.\nIn each script the poem will be read in its entirety, and the listeners will\nalso be invited to read the lines aloud in appropriate units after the radio\nspeaker.\nPermission is sought both dSBr the broadcast by the Voice of America to\noverseas countries and for broadcast in countries where local radio stations\nmay receive the taped programs through the United States Information Agency.\nPermission is also sought for publication of the poems that might be published\nin any given country (with, the aid or supervision of U.S.I.A.), and distributed\nfree or at cost to radio listeners. Permission is also sought for eventual\npublication of the materials in a similar study booklet to be produced by\nU.S.IAA. for gratis distribution to overseas listeners who request such booklets.\nWfe hope we will hear from you shortly and that authorization to use this poem\nin the manner which we have wutlined will be forthcoming. If you would like\nto have additional information, may I suggest you contact Dr. Robert Gooden,\nChief, Radio EngXish-Teaching Branch, Voice of America, Washington, D.C.\nSincerely,\nJames A. Fellows\nAssistant Director"
}