{
  "id": "d1912-1",
  "text": "They have kindly provided us with some so that we\nmay fill your requests for single copies. Just drop\na card to NAEB Headquarters.\n“NAEB Research Seminar”—a report of the\nseminar on educational broadcasting research held\nby the NAEB at the Ohio State University, De¬\ncember 9 - 13, 1957. Available to NAEB members\nfor 50c a copy (non-members, $1 a copy) from NAEB\nHeadquarters. (This report will soon be mailed to\nall Active, Associate and Affiliate members auto¬\nmatically.)\nMEMO FROM THE EXECUTIVE DIRECTOR\n—Harry J. Skornia\nAs explained in the November issue, this month’s\ncolumn contains the first part of a two-part approach\nto a problem that I would like to attack and' which\nmany of you have asked for: an effort to begin to\nevolve, with your help, a philosophy or definition of\nthe role of educational broadcasting in the U. S. The\nsecond part of this statement, together with any re¬\nactions you may have to this first part, will appear\nin the January issue.\nAt a time when commercial—and to some extent\nall—mass media are meeting with increased criticism\nfrom various sources, it seems to me that educational\noperators and users of these media have a unique op¬\nportunity to provide statesmanship and leadership\nin their uses. A few years ago, in answer to a chal¬\nlenge to do many of the things which commercial\nmedia can’t do—even though they are desperately\nneeded—we might have asked, “But what can we\ndo? We’re so few and so small.” With some 80 mil¬\nlion people within reach of educational radio stations\nand some 50 or so million within range of ETV sta¬\ntions, I don’t believe we can any longer use that ex¬\ncuse or rationalization. I believe the finger is\nsquarely on us to provide the kind of leadership our\nnation has a right to expect from a largely publicly-\nfinanced, educationally-based broadcasting service,\nco-existing with a commercial service. In other\nword's, I think we’re now big enough so we should\nbegin to evolve a philosophy, in a statement of which\nthe citizens of the U. S., as well as of other nations,\ncan find what we stand for.\nI do not presume to write such a statement here\nand now. It won’t come this way. But I would like\nto suggest the type of considerations which might be\ninvolved in such a philosophy.\nOne of the slogans used a great deal at election\ntime is “Vote!” Great sums of money are spent to get\nout the vote. Organizations are formed, and get\ngrants, to promote such slogans. I have lent my ef¬\nforts to such efforts myself, of course. But for many\nyears I’ve seen certain objections to simplifying\ncitizen responsibility this much. I wonder to what\nextent we should promote some such admonition as:\n“Vote! yes; but don’t vote without understanding the\nissues involved or having carefully studied, as if the\nfate of the U. S. depended on you, the qualifications\nof the candidates.”\nTo quote from a book I shall refer to presently,\n“there is a radical difference between the election of\nan executive and a representative. For while the ex-\ncutive is in honor bound not to consider himself the\nagent of his electors, the representative is expected to\nbe, within the limits of reason and the public interest,\ntheir agent.”\nIf one spreads such an awkward slogan as I men¬\ntioned above, of course, or even simplifies it to “Don’t\nvote till you know,” one has a considerable obligation\nto supply the facts needed before voters vote. Com¬\nmercial media operators say they can’t afford it. But\nI wonder if we couldn’t be doing more of this sort of\nthing than we now do? Objectively done, isn’t this\ncitizen education? And what media should qualify\nbetter for objectivity than publicly-owned ones, in\nwhich politics and commercial consideration aren’t\nso complexly related, or predominant?\nSeveral years ago I read Walter Lippmann’s De¬\ncline of the West and The Public Philosophy. Re¬\ncently I picked up the pocket version of these at an\nairport stand, and have reread them. Understanding\nwhat Mr. Lippmann means by the Public Philosophy\ninvolves the sort of fearless self-examination and\nself-redirection we should, I believe, be engaging in.\nHe began these books years ago, he tells us, be¬\ncause he felt “that there is a deep disorder in our\nsociety which comes not from the machinations of our\nenemies and from the adversities of the human condi¬\ntion but from within ourselves.” He sees this disorder\nof democracies as some kind of sickness, an “inca¬\npacity to cope with reality, to govern their affairs,\nto defend their vital interests—to insure survival as\nfree and democratic states.”\nWhat kind of leaders should we be educating our\nlisteners to select? Mr. Lippmann believes we need\nmen who must defy pressures and even “often swim\nagainst the tides of private feeling.” He traces the\ncauses of the demise of democracy in ancient and\nmodern nations. He traces, too, the decadence of\nthe executive power of decision in many nations\ntoday—yielded to “assemblies, which could not ex¬\nercise them, to the mass of voters—who (not being\nprepared for them) passed them on to the party\nbosses—and the magnates of the new media of mass\ncommunication.” He sees the people as now having\ndecision-making responsibilities and “power which\nthey are incapable of exercising,” and because of lack\nof available information and time for the decision-\n2\nNEWSLETTER"
}