{
  "id": "d1478-11",
  "text": "-10-\nWhat copyright problems will these groups run into in attempting to provide\nscripts or tapes for broadcast by these non-licensed organizations over wired-\nwireless or local commercial outlets?\n4) In what way can the operating stations help non-licensed groups gain support\nfrom their administrators and communities? Can the actives help by: granting\nreleases to rebroadcast programs off the air? Writing letters which the local\nbroadcasters could then bring to . the attention of his administrators? By\nvisiting the smaller organizations and lending support to get a station going?\nOHIO: (Harry D. Lamb, Chairman)\nIn general the Ohio Gang agreed that their problems were not peculiar to Ohio\nand that there would be overlapping with those from other states* The following\nproblems nevertheless wore considered of sufficient importance to bring before\nthe assembly.\nI. Problems centered on programs and programming.\n1. In-School Foundation Programs.\nFour programs for the use of public school radio stations were recommen¬\nded for writing and production through foundation g rant by the Kellogg\nSeminar lsast summer. What has been done about them?\n2. Should time limits be established for programs designed for in-school use?\nIt was thought that programs for primary grades should be limited to\nfifteen minutes because the audience span of attention was limited. Few\nschool programs should exceed half an hour in length; the longer the pro¬\ngram the more difficult to schedule and the less the audience.\n3. Can a better way of obtaining programs from member stations for network\ndistribution be established?\nThe group seemed to feel that the standards of judgement of programs\nsubmitted for network acceptance were unknown; that the present system\nof free offerings did not provide for a balanced diet of programs in\nareas on interest; and that some plan of operation should be devised\nthat would permit planning of programs and submission of programs in\nanswer to the expressed needs of the members. The following plan was\nsuggested as a possible solution:\na. Establish national program committees at each level of operation\n(college, public school stations) to determine the programs to sat¬\nisfy the greatest needs. These committees would meet regularly\nthroughout the school year to plan programs and to audition programs\ndeveloped within the organization or obtained from other sources\nwith a view to recoramending them for national distribution. It was\nfelt that regularly scheduled meetings were necessary rather than\nmerely the national meetings of NAEB or as attendant upon the Col¬\numbus Institute meeting. Travelling costs for these committee meet¬\nings should be defrayed by the NAEB.\nb. Writing and production of the programs decided upon would be farmed\nout to members on the basis of ability to perform the particular\nseries.\nc. Nothing in these suggestions prevents the free development of pro¬\ngrams of their own by member stations and submission of them for\nnetwork distribution.\nII. Up-grading of professional status.\n1. Can the NAEB help in raising professional status?\n2. Can NAEB help establish a climate of opinion in the administrations of\ninstitutions so that staff contributions or radio participation by pro¬\nfessors not on staff could be equated with scholarly publication?\n3. Could the NAEB establish the practice of informing top administration\nof the excellent programs submitted by their radio department or other\ncontributions by their radio or TV station? This could be done by letters"
}