{
  "id": "d987-0",
  "text": "American Council on Education\nWashington 6, D. C.\nSummary of Important Actions Taken by the Executive Committee\nat the Meeting on October 4, 1961, Washington, D, c.»\nThe Executive Committee of the American Council on Education\nmet on October 4, 1961 at the Mayflower Hotel, Washington, D. C ,\nbeginning at 9:30 a,m. '\nPresent were: C. Clement French; Edmund J. Gleazer, Jr., Secretary;\nDavid D. Henry, Chairman; Thomas H. Hamilton; 0.\nMeredith Wilson; Gaylord Harnwell; Logan Wilson,\nex officio.\nGuests: Margaret Habein, First Vice Chairman\nArthur G. Coons, Second Vice Chairman\nAbsent: 0. C. Aderhold\nIt was VOTED to adopt a resolution to effectuate the gift\nof real estate to the Meridian House Foundation. Meridian House\nwas purchased by the Council, with a grant of $500,000 from the\nFord Foundation, for use as headquarters of the Washington In¬\nternational Center and several related agencies. As of July 1,\n1961, the State Department contract for support of the operation\nof the Washington International Center was transferred from the\nCouncil to the Meridian House Foundation. At the same time the\nCouncil's Advisory Committee on Policy of the Washington Inter¬\nnational Center was disbanded.\nFinancial Matters\nRecommendations of change in Council's dues structure.\nThe Executive Committee had discussed (at a special informal\nmeeting in Chicago on August 31 Q-nd September 1) the necessity\nfor increasing dues' income. Consideration was given to further\ninformation which was called for by the committee. (l) It was\nnoted that an increase is long overdue. Dues have not been\nraised for more than ten years. (2) The revised structure\nis needed not only to increase income but to effect more equity\n\"* In this summary, reports of important actions are given without\ncomplete details; actions on routine matters have been omitted.\nAuthorized representatives of Council members may secure copies\nof the complete minutes by addressing requests to the President\nof the Council."
}