{
  "id": "d987-3",
  "text": "-4-\nit was VOTED that the following subscription rates be established for\nthe two following periodicals effective January 1, 1962:\nThe Educational Record\n$6.00 per year or $1.50 per issue\nThe HENA Bulletin - $5.00 per year for a single sub¬\nscription\n$4.00 per year for two to five\nsubscriptions to the same\n, address, and\n$3.00 per year each for five or\nmore subscriptions to one\naddress.\nCommittees and Commissions\nThe President reported that the Canada-United States Com-\nmittee on Education was discontinued as of July 24, 196I.\nThe President reported that the Committee on Language and\nArea Centers was discontinued on July 28, T961 after the comple¬\ntion of its study.\nThe President reported the appointment of a Special Com¬\nmittee on Council International Activities with the following\"\nmembership: 0. Meredith Wilson, Chairman]\" Fred C. Cole; David\nD. Henry; Katherine E. McBride; and Grayson Kirk. The purpose\nof this Committee was to meet with representatives of foundations\nto consider the relationship to the Council of the new agency in\ninternational education proposed by the Committee on the Univer¬\nsity and World Affairs. It was further reported that this Com¬\nmittee, having completed its assignment, was discontinued on\nSpetember 6, 1961.\nThe President of the Council was instructed to meet with\nthe members of the Pacific Coast Committee at an early date and\ndiscuss with them the reorganization plans of the Council with\nregard to continuance of this Committee.\nThe President reported that the Commission on the Educa¬\ntion of Women has been discontinued because funds are not availa¬\nble for further operations.\nHe further reported that the members of the Commission\nhave been invited to serve on a Committee for the Conference\non the Continuing Education of Women. A grant from the Carnegie\nCorporation will make possible a conference on this subject in\nthe summer of 1962. The committee will continue up to and through\nthe conference with responsibilities for conference planning.\nThe future role of the Council on Cooperation in Teacher\nEducation in relation to the American Council on Education was\ndiscussed. Mention was made of the valuable functions performed\nby the CCTE in recent years. It was VOTED that Council soonsor-\nship of CCTE be discontinued and that the Council’s concern in\nthe improvement of teacher education be transferred to other\nCouncil committees."
}