{
  "id": "d429-107",
  "text": "340\nMarshall McLuhan\ntion of experience collectively achieved by new work habits and inclu¬\nsive collective awareness. But when such a new codification has\nreached the technological stage of communicability and repeatability,\nhas it not, like a spoken tongue, also become a macromyth? How\nmuch compression of the elements of a process must occur before\none can say that they are certainly in mythic form? Are we inclined\nto insist that myth be a reduction of collective experience to a visual\nand classifiable form?\nLanguages old and new, as macromyths, have that relation to\nwords and word-making that characterizes the fullest scope of myth.\nThe collective skills and experience that constitute both spoken\nlanguages and such new languages as movies or radio can also be\nconsidered with preliterate myths as static models of the universe.\nBut do they not tend, like languages in general, to be dynamic models\nof the universe in action? As such, languages old and new would\nseem to be for participation rather than for contemplation or for\nreference and classification.\nAnother way of getting at this aspect of languages as macromyths\nis to say that the medium is the message. Only incidentally, as it\nwere, is such a medium a specialized means of signifying or of\nreference. And in the long rim, for such media or macromyths as\nthe phonetic alphabet, printing, photography, the movie, the tele¬\ngraph, the telephone, radio, and television, the social action of these\nforms is also, in the fullest sense, their message or meaning. A lan¬\nguage is, on the one hand, little affected by the use individuals make\nof it; but, on the other hand, it almost entirely patterns the character\nof what is thought, felt, or said by those using it. And it can be\nutterly changed by the intrusion of another language, as speech was\nchanged by writing, and radio by television.\nIs, then, what concerns us as “myth” today a photograph or “still”\nshot of a macromyth in action? As a word uttered is an auditory\narrest of mental motion, and the phonetic translation of that sound\ninto visual equivalence is a frozen image of the same, is not myth a\nmeans of static abstraction from five process? A kind of myth¬\nmaking process is often associated with Hollywood and with Madison\nAvenue advertising agencies. So far as advertisements are concerned,\nthey do, in intention at least, strive to comprise in a single image\nthe total social action or process that is imagined as desirable. That\nis, an advertisement tries both to inform us about, and also to produce\nin us by anticipation, all the stages of a metamorphosis, private and"
}