{
  "id": "d429-112",
  "text": "Myth and Mass Media 345\nthe new media to alter sensibility. For this change in child behavior\nhas nothing to do with ideas or programs.\nSuch a changed attitude to spatial form and presence is as definitive\nas the change from the photographic to the television image. In his\nPrints and Visual Communication (London: Routledge and Kegan\nPaul, 1953), William M. Ivins explains how the long process of cap¬\nturing the external world in the “network of rationality,” by the\nengravers fine and by ever more subtle syntax, finally reached con¬\nclusion in the photograph. The photograph is a total statement of the\nexternal object without syntax. This kind of peripety will strike the\nstudent of media as characteristic of all media development. But\nin television the striking fact is that the image is defined by light\nthrough, not by light on. It is this fact that separates television from\nphotography and movie, relating it profoundly to stained glass. The\nspatial sense generated by television experience is utterly unlike that\nof the movie. And, of course, the difference has nothing to do with\nthe “content” or the programing. Here, as ever, the medium itself\nis the ultimate message. The child gets such messages, when they\nare new, much sooner than the adult. For the adult instinctively\nretards awareness that will disturb a cherished order of perception\nor of past experience; the child would seem to have no such stake\nin the past, at least when he is facing new experience.\nIt is my point that new spatial orientation such as occurs in the\nformat of the press after the advent of the telegraph, the swift disap¬\npearance of perspective, is also discernible in the new landscapes of\nRimbaud in poetry and Cezanne in painting. And in our time Rouault\nanticipated the mode of the television image by decades. His use of\nstained glass as a means of defining the image is what I have in mind.\nThe mythmaking power of a medium that is itself a myth form\nappears now in the postliterate age as the rejection of the consumer in\nfavor of the producer. The movie now can be seen as the peak of the\nconsumer-oriented society, being in its form the natural means both\nof providing and of glorifying consumer goods and attitudes. But in\nthe arts of the past century the swing has been away from packaging\nfor the consumer to providing do-it-yourself kits. The spectator or\nreader must now be cocreator. Our educational establishment natu¬\nrally lags behind the popular media in this radical change. The\nyoung, when exposed to the television image, receive at once a total\norientation in spatial matters that makes the lineality of the printed\nword a remote and alien language. Reading for them will have to be"
}