{
  "id": "d429-163",
  "text": "7\nchanging methods and approaches to art and science and the humanities in recent decades.\nHere the many new avenues of awareness opened into traditional fields and subjects would\nbe related to the new media since telegraph and photography. As William Ivins shows, for\nexample, in his Prints and Visual Communication, engraving created new possibilities for\nscience and mathematics from the fiteenth century onward. The basic power of the print or\nengraving was exactly repeatable information. The 'network of rationality99 by which the\nengraver captured the external world offered a means of statement and syntax which hastened\nscientific advances. But with the photo the external world was captured completely, without\nlines or syntax. Syntax disappears into \"compostion\" and lay-out. The same has happened\nin mathematics and poetry and painting and music in our time.\nSuch a text would set up exercises of observation and analysis and a variety d means of\ndiscussion which would bring into play all that the students have experienced of this\nmedium . This would in turn be related to other arts and media by detailed comparisons and\ncontrasts.\nThe CBC in Toronto has offered to script, cast and produce many sections of the text\nwhen it is written. They will broadcast these programs and use their audience research divi¬\nsion to test reactions which can be made the means of improvement in the text. The kinescopes\nof these programs will then be used in many places throughout the continent for reaction and\n/\nsubsequent improvements in the text. Andre Girrard of CBS and NBC has agreed to make\nall of his experimental material in inter-relating movie and television available for the\ntext. Others, as listed under Section VII below, will provide facilities and cooperation as\nneeded.\nThe sort of work that Marshall McLuhan did in The Mechanical Bride , in understanding the\niconology of modem advertising, has already been used in many classrooms with success.\nThat book however, was not designed for classroom use. But it did lead to many contacts with"
}