{
  "id": "d429-195",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nNAEB\nnai*mmquaruIS\nAm\n13 7959\n14 GREGORY HALL\nURBANA, ILLINOIS\nJanuary 9, 1959\nDr. Harry Skornia 4\nNational Association of Educational Broadcasters\n14 Gregory Hall\nUrbana, Illinois\nDear Harry:\nI had planned to beat you to the draw this year on the appointment\nof the sub-committee to worry about the grants-in-aid. I thought\nof it two weeks ago but then got so involved in finishing up the\nlast draft of a research report for Iowa - my last major job\nfor the University until my return - that I never got the\nletters written. I am now writing to Merrill (whom I am asking\nto be chairman), Harwood, Ellery, Smythe, and Westley. I am sure\nthat Merrill, Harwood and Ellery have accepted Bill*s invitation\nto be in the committee. I am not so sure about Westley and\nSmythe. To be on the safe side with these, I am sending their\nletters to you to forward to them in the eventfc that they are on\ne committee. If they are not, or if you want to keep one copy\nat headquarters instead of sending all of them out, you can\ndrop the letter to the person who is not on the committee —\nor if one did not accept and it is all right to sand out all\ncopies of the proposal, I would add Evans (Whom I assume is the\nHouston Evans in psychology. Bill just said Evans.) This is\na very confusing sentence above but I hope that you get the gist\nof it. As you can see from the enclosed letters, I am asking\neveryone to send his recommendations to Merrill. It might be\na good idea to enclose one of the announcements to each of these\ncommittee members as a reminder of what we are looking for — in\nthe event that they have lost theirs. Not important for Harwood\nand Merrill but it is, I think, for the others.\nI just looked through my file and I cannot find a copy of the total\namount of money which we have to spend. I probably left it with\nthe Bulk of the files in Iowa City. You probably ought to include\nthis information with the proposals also. This will\"help the\ncommittee members in their decision making.\nA am enclosing a. list of all members of the Speech Association of\nAmerica (with addresses), who have indicated an interest in radio¬\ntv-film. Only a small percentage ever come to our conventions,\nthus, never received my little speech at the last convention.\n.ove worthwhile to send each a little notice, about\n‘.\" ‘ “ v\nmember shins -- except for those like'Adkins,\netc, whp^ar^. walrea%y'BiffjSfifbers .\nI think the latest draft of the Understanding Media proposal is a\ngreat improvement. I am still bothered by one major point —\nI am not certain of the limits of the proposal. It appears to me —\ndepending.on how I read it — that there are many issues raised which\nhave nothing to do with this proposal or else much more is being"
}