{
  "id": "d429-207",
  "text": "11\nattempts to regulate them appear as attacks on liberty and\nthe home® So long as men instinctively thought of these\ngreat organizations as individuals* the emotional analogies\nof home and freedom and all the other trappings of 8rugged\nindividualism8 became their most potent protection\" lg/\nHe argued that two essential supports of his notion of the corporation as a\nperson were the ideas that public taxation and government were malevolent*\nwhile private taxation and private corporations were benevolent o He explained\nthis part of our folklore in these terms;\n\"People grew to distrust service rendered them by that type of\norganization called the State, because they felt they would be\n8taxed* to pay for it® They preferred the services of great\nindustrial organizations because they did not consider their\n^nirr.ri m»y.i nnajvn b tmh. taxiatlSST*^ Men in America\nwere'so TiUfidTEioned that they felt’differently about taxes and \"\nabout prices 0'\"\"The fofaefWa ah Involuntary\"takings\" tHe latter\nA voluntary giving® Prices were something a person could pay\nor not pay as he chose®\n\"Thus all government activity became associated with a very un¬\npleasant symbol* that of forced contributions® Business activity\nwas correlated with the pleasant symbols of a free man going\ninto the market place and buying what he chose • • » « No one\nobserved t&£ obvioug that, nf\nindividual it mada_im_dirf£renc<: whether his mnnpv mant fqr prinea\nor taxes Men believed there was a dif f erence_hncaiise prices .\nwere automatically re^late^ bv the laws of supply anH Ham«nri-\nIT srny gji'eat fiorporateorganlzai o n charged too much, in the long\nrun it would be forced out of business by other corporations\nwhich did not charge so much. This might not be quite so true\nif the corporation had a monopoly* but our antitrust laws pro«\nteeted us from any situation like that (or if they didn*t it was\nthe fault of the politicians whr could always be removed from\noffice by right-thinking individuals®) 0 ® ® „\n\"The exact contrary was true with respect to taxes® Here men were\nat the mercy of politicians and no sound principle operated in\nthis field® Laws of supply and demand were constantly being set\naside by politicians® They were interested only in their own\npersonal profit® If it were observed at this point that the self¬\nishness of businessmen interested in their own personal profit\nmight have the same effect* the answer was that the selfishness\n12/ Arnold* Thurman* The Folklore of Capitalism* (New Haven, Isle University\nPrass, 193?), p. !¥."
}