{
  "id": "d429-22",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL\nURBANA, ILLINOIS\nJune 19, 1959\nMr. Marshall McLuhan\n29 Wells Hill Avenue\nToronto 10, Ontario, Canada\nDear Marshall:\nI am back at Iowa once again trying to adjust to working for\na living and to administrative responsibilities - neither of which\nsits well on me.\nI was quite interested in your last letter. I can appreciate\nthe problems which you are facing. First of all, though, I believe\nthat there may be some misunderstanding of what the Title VII people\nwant. I would guess that they are really asking not for the evidence\nwhich you hope to discover but rather for statements of the problems\nin researchable terms. In other words, since they have been promised\nan experiment, they are probably interested in an explication of your\nquestions in terms of observable behavior. For example, you talk\nabout non-verbal factors in attitude change. Attitude is obviously\nnon-verbal, though researchers often use verbal statements as indi¬\ncators of the presence or absence of the concept \"attitude.” I would\nguess they want to know what sort of indicators you plan to use if you\ndon't use verbal indicators. They probably want to know wfcwrt: your cri¬\nteria of such concepts as \"revealing character\" and \"coming into sharpest\nfocus\" and \"appearing most starkly,\" etc.\nI did a paper recently in Washington for the NEA which might sug¬\ngest. some approaches to you. I do not think that the particular approach\nexplained in the first part will help for the kind of thing you envisage,\nbut I do believe that the last part might. I am enclosing a copy for\nwhatever you might get from it. One of the problems of going about this\nsort of thing systematically is the danger of stifling insight. On the\nother hand, once insight is achieved, I believe that you might well try\nto reflect back, as I have suggested for educators, and try to explicate\nthe cues or indicators which made you feel that a particular medium did\none thing more than another medium. These cues or indicators need to\nbe defined clearly enough (if there is to be any experimentation) for\nother researchers to observe them and arrive at the same conclusions\nwhich you have."
}