{
  "id": "d429-38",
  "text": "6\nRevocation of Grants\nThe grantee shall advise the Office of Education whenever, in the\nopinion of the grantee, there is reason to believe that circumstances may\nnecessitate revocation*\nGrants may be revoked in whole or in part by the Office of Education,\nafter consultation with the grantee, due to the inability of the grantee\nto carry out the research for which the grant is made, or non-compliance\nwith the conditions of the grant.\nA revocation shall not affect any financial commitment which, in the\njudgment of the Office of Education, had become film prior to receipt by\nthe grantee of a notice of recovation. Thereupon, the grantee shall re¬\nduce, insofar as possible, the amount of outstanding commitments and repay\nby check made payable to the U. S* Office of Education the uncommitted\nbalance of all funds which shall have been paid to the grantee by the\nOffice of Education under the terms of the particular grant concerned.\nAllowable Costs\nIn determining the allowable costs for a research project, the Office\nof Education will consider all costs which are clearly attributable to the\nconduct of the research.\nDirect Costs\nThe Office of Education will consider as direct the costs which are\nspecifically identifiable as having been incurred in the conduct of the\nresearch. Direct costs which are applicable to (1) the research project,\nand (2) other projects, programs, or activities of the grantee, shall be\nequitably apportioned to the respective projects, programs, or activities\nto which they apply. Examples of items which may be considered as allow¬\nable direct costs are explained below.\nSalaries - This item includes the salaries of persons employed\non the research project for the time actually devoted to the research\nproject, including full-time and part-time staff, and consultants. Salary\nestimates should be based on the rates of pay normally paid by the grantee\nfor services of the same or similar nature as those to be performed in\nconnection with the research project, bhere any person works less than\nfull-time on the research project, current and reasonable estimates of the\ntime spent on the research project may be used in the absence of actual\ntime records in determining the part of the salary to be charged to the\nresearch project.\nEmployee Services and Benefits - This item includes the costs\nof employee services and benefits, such as insurance, pension payments,\nand social security, which are normally provided by the grantee to its\nemployees. Such costs for the personnel for whom salaries are included\nunder the above paragraph are allowable*"
}