{
  "id": "d429-66",
  "text": "29 Wells Hill Avenue\nToronto 10, Ontario,Canada\nJune 5, 1959\nRECEIVED\nNAEB HEADQUARTERS\nJUN 8 1959\n*M P»\n7|8|9|lplll,121l12|814|5|6\nDear |iarry.\nHave only just begun to recover inner equilibrium!\nI do think we ought to confer soon with Gilbert Seldes,\nwho is a good friend of mine. I respect his work, and\nhe does mine. He could use our whole approach, and we\ncould use his staff and facilities for shaping teaching\nmaterials collaterally to huge advantage. We need\nallies. I know we are going to put this job right out\nin front of national attention-- where it belongs.\nOne new concept for us: media are \"ideas* in action.\nThat is, any technological pattern or grouping of human\nknow-how has the mark of our minds built-into it. The\nmedia dynamics are, therefore, parallel to those of\nour ideas. But many of our ideas are feed-back sublim-\ninally from media. Jeep calling unto jeep.\nAnother basic fact: Men never hpve conscious grasp of\nany medium until it has beentranslated into another\nmedium. The Gutenberg era behind us was the subliminal\nphase of print. Now that we have translated print into\nthe electronic modes we begin to be conscious_of what n\nhad been subliiinal. Yet we have to j&a| with a professoriai\nthat remains subliminal in respect to print; ergo bloteked\nin respect to new media perception. This is not just\na nuisance, or regretable* It is dangerous t o our civilization.\nThe business world is more alert to dangers to Its interests\nthaiL we are. They would help us if they knew what we\nwere up to.\nTonight and tomorrow I confer 'with GBC brass about ways\nthey can help theproject.\nNothing has been announced here. But the college is booking\nfor adman to take my place. And I’ve told my friends that\nthe Seal1s on. What about motto: \"Let’s get the media\nout of the subliminal gulch\"? Let’s articulate ’em, hoick ’em\nup into daylight of consciousness. Let’s harness them, u jp/ai*\"\nTV A style, instead of letting them flood and gouge us. w***\"\nLet’s make ’em deliver music. Let’s orchestrate them like\nthe sections of a symphony. Let’s teach them the .score.\nLet’s score the media instead of letting them score.\nMuch appreciate your thoughtfulness about the travel\nexpense sheet. As ever, 9"
}