{
  "id": "d429-76",
  "text": "h>\nTHE OHIO STATE UNIVERSITY\nCOLLEGE OF EDUCATION\nBureau op Educational Research and Service\nMr. Harry J. Skornia\nExecutive Director, NAEB\nUniversity of Illinois\nUrbana, Illinois\nDear Harry:\n(f\nNovice G. Fawcett, President\nCOLUMBUS 10\nreceived\nKeb headquarters\njUN 1 1959\nF«\nMay 28, 1959\nI have gone over your-*proposal. Here follows my comment.\nI am for much more extensive research on the various types of media,\ntheir grammar and syntax.\nCommentary on the non-discursive character of pictorial materials has\nbeen well done by Susanne Langer in \"Philosophy in a New Key.\" You\nwill see the key arguments presented in chapter 4 titled, \"Discursive\nand Presentational Forms\" with especially pertinent material on pages 76,\n77 and 78. She makes the point on page 77 that \"photography, therefore,\nhas no vocabulary.\"\nI believe that photographic specialists would deny this, but it is certainly\ntrue that many of these experiences are of relatively instantaneous wholes\nrather than of additive parts.\nThis has long been true, however. One has merely to think of a savage\nor anyone else faced with non-discur sive situations. He had to take them\nall in at once, so we have been doing this for a long, long time. True,\nmotion pictures and television have forced us to think harder about it, and\nit is true that they themselves are more symbolic than the real life exper¬\nience. But I do not see anything essentially new in what has happened.\nMost experiences, whether television or photographs, have an accompany¬\ning verbalism. Really we have very few audio visual experiences. They\nare really verbal-audio visual experiences. Even a visit to a museum is\noften aided by some kind of catalogue which describes. I realize this is\nnot the basic experience, but nevertheless this is true. We classify, we\nname, and certainly this has a linear quality.\nI think we need more carefully controlled, laboratory experience on this topic.\nI don't see the value of a survey of the type you have outlined.\nED/be\nSincerely,\nEdJa^feileN\n13-B (jrage Hall, 65 S. Oval Drive."
}