{
  "id": "d928-17",
  "text": "they will not be deducted from the number of tapes owed as of December 8,\nas they should have been counted as returned. We will check the post¬\nmarks on incoming tapes, and all tapes dated after December 8 will be\ngiven tape return credit.\nNow, when making your listings, will you please follow this outline as\nmuch as possible? For example:\nSerial Number Title of Series Programs We Have\n53-1 Stories ’n Stuff #186-220\nWe know that all past disagreements on tapes owed have been honest ones,\nwith each station and the Network attempting to be completely fair. As\nyou all know, the Network has undergone numerous personnel changes over\nthe past year or so, and thus it is possible that some errors have been\nmade here, just as it is possible that some errors have been made at\nyour end. The important factor is that all errors have been honest ones.\nTo continue this policy of fair play and, at the same time, to remove a\ngreat amount of margin for error on both ends, we urge your cooperation\non this proposal. We trust that you will be fair with us when making out\nyour lists, as the Network would be in serious trouble should all members\nnot be absolutely fair and honest in this, since our budget for new tape -\nmoney which comes from your assessment fees - is more limited than we wish\nit were. Thus, if too many tapes are not accounted for, we will have to\npurchase new tapes to replace them, and the resulting expenditure will\nhave to be made up somehow.\nPlease have your lists in our hands before December 14» We know this\ndoesn’t give you much time, but we, too, must do quite a bit of work\nprior to then preparing for the proper recording of your lists.\nShould any station fail to respond to this request, we will have to use\nthe figure we now have in the books as our basis for future shipments,\nand that figure will have to be the basis of future record keeping. We\nwant to use your figures, so please get your listings in before December\n14, 1956.\nX X -X- X- X- X- X- X- x- X X X X- X X X\nTo further improve our shipment of tapes to you and eliminate some of\nthe apparent high rate of loss in the mails, we are studying the possi¬\nbility of either insuring all tapes or sending them by special handling.\nYou will be hearing more on this matter in the near future, and at that\ntime you will be invited to submit your reactions and suggestions.\nNovember 26, 1956 arp"
}