{
  "id": "d928-34",
  "text": "4\nTAPE SPEEDS\nFREQUENCY RESPONSE\nSIGNAL-TO-NOISE RATIO\nFLUTTER AND WOW\nPLAYING TIMES\nSTARTING TIME\nSTOPPING TIME\nPLAYBACK TIMING\nACCURACY\nREWIND TIME\nCONTROLS\nRECORD INPUT\nPLAYBACK OUTPUT\nAMPLIFIERS\nPLUG-IN HEAD HOUSING\nMONITORING\nPOWER REQUIREMENTS\nRACK SPACE\nMOUNTING STYLE\nTAPE SPEED\nTRACK WIDTH\nPOWER LINE FREQUENCY\nREMOTE CONTROL UNITS\n(Cat. #5763 and\nCat. #5763-1)\nFOUR CHANNEL MIXER\n{Cat. #3761)\nAMP!\nEX\nC ORPORATI O N\n934 CHARTER\nSTREET\nREDWOOD CITY, CALIFORNIA\nGENERAL PERFORMANCE CHARACTERISTICS\nAND SPECIFICATIONS\nEither 7>/2 and 15 in/sec. or 3% and 7'/2 in/sec.\n15 in/sec. ± 2 db 30 to 15,000 cycles/sec.\n7'/2 in/sec. ± 4 db 30 to 15,000 cycles/sec. (± 2 db 40 to 10,000 cycles/sec.)\n3% in/sec. ± 2 db 50 to 7,500 cycles/sec.\nMax. Record Level\nPeak Record Level\nSpeed\nto Unweighted Noise\nto Unweighted Noise\n7 5\"\nFull track 70 db\nFull track 60 db\nHalf track 65 db\nHalf track 55 db\n7'h\"\nFull track 70 db\nFull track 60 db\nHalf track 65 db\nHalf track 55 db\n3%\"\n60 db\n50 db\nThe peak record level is defined as that level at\nwhich the overall Iinput to output) total RMS har¬\nmonic distortion is 3% when measured on a 400\ncycle tone. Noise is measured when erasing a sig¬\nnal of peak recording level and in absence of new\nsignal. Thus, bias and erase noise are included\nas well as playback amplifier noise. All frequencies\nbetween 30 and 15,000 cycles are measured.\n15 in/sec.\n7Vi in/sec.\n3% in /sec.\nWell below 0.2% The flutter and wow measurements include all components between\nWell below 0.25% 0 and 300 cycles/sec. using an RMS meter calibrated to read the\nWell below 0.3% peak value of constant amplitude sinusoidal flutter.\nWith NARTB 10'/2\"\nreels (2400 feet of\ntape)\nSpeed\n15 in/sec.\n7'/2 in/sec.\n3% in/sec.\n2 hrs. 8 mi\n4 hrs. 16 n\nInstantaneous (tape accelerates to full speed in less than 1 /lO second).\nAt 15 in/sec. speed, tape moves less than two inches after pressing “Stop” button.\nit 0.2% (± 3.6 seconds in a thirty minute recording).\nApproximately one minute for 2400-foot NARTB reel; 30 seconds for 1200-foot RMA reel.\nTape motion controlled by four pushbuttons; Start, Stop, Fast Forward and Rewind. Separate Record button\nenergizes record circuits, which drop out when machine is stopped. Motor speed and electronic equalization\nfor various tape speeds are controlled by separate switches. Reel Size Switch provides proper tape tensions\nfor NARTB IOV2“ reels or RMA 5\" and 7\" reels.\nA switch allows recorder to accommodate either microphone level low impedance input or to bridge a 600\nohm + 4 VU line, balanced or unbalanced. Levels as low as minus 80 dbm. on the microphone input will\nproduce the recommended record level.\nPlus 4 VU output into 600 ohms, balanced or unbalanced. Will feed a high input impedance amplifier directly\nwith approximately one volt.\nSeparate record and playback amplifiers are used. Amplifier distortion at any operating level is negligible\ncompared to tape distortion, even using new high-output tapes.\nErase, record and playback heads are contained in a single plug-in head housing.\nIndependent record and playback systems allow tape to be monitored while recording. A phone jack is\nprovided to monitor either the record input signal before or during recording, or the output signal from the\nplayback head while recording or during playback. An A-B switch is incorporated in order that direct com¬\nparison can be made between the original program and the recorded program. The same switch transfers a\n4-inch VU meter for level comparison and monitoring. The VU meter is also used to read bias and erase\ncurrent.\nEither half or full-track machines require 2.7 amperes at 115 volts AC. Machines are available for either\n50 or 60 cycle operation.\nStandard 19 inch wide panel with commercial notching.\nTape Transport, 15% inches of rack space, weight 58 lbs.\nElectronic Assembly, 7 inches of rack space, weight 18 lbs.\nPower Supply, 3>/2 inches of rack space, weight 8 lbs.\nOPTIONS TO SPECIFY WHEN ORDERING\nConsole, rack-mount or two case portable_\n7V} and 15 in/sec. or 3% and 7'/2 in/sec_\nFull track or half track_\n60 or 50 cycle/sec_\nACCESSORIES\nControls Start, Stop, Fast Forward, Rewind and Record from a remote location. Catalog #5763 is mounted\nin a wooden case and is completely wired. Catalog #5763-1 is mounted on a flat plate for flush mounting\nin studio consoles and is not wired.\nHigh level mixer preamplifier for use with portable and rack-mounted recorders (mounts directly in elec¬\ntronics case of two case portable).\nDISTRIBUTED BY\nPrepared by Walther-Boland Associates • Printed in U.S.A."
}