{
  "id": "d928-37",
  "text": "DESCRIPTION\nThe BC-6A Split-Mixer Dual-Channel Audio Consolette is\ndesigned for operating convenience and ease of servicing-\nall amplifiers, control facilities and power supplies being\ncontained in a single housing which offers utmost access¬\nibility to all components. The unit is suitable for mounting\non a flat top desk, and is similar in styling and appearance\nto the RCA BC-2B, BC-3B, BC-5A, BCM-1A and BCS-11A\nconsolettes.\nAn etched panel contains all operating controls. It tilts for¬\nward for easy access to all contacts, switches, gain controls\nand other interior components. Two illuminated volume\nindicator meters are calibrated in VU's. They indicate level\non each output channel. Monitoring and network headset\njacks are supplied and headphones may be connected to\nthe output of the program channels, remote lines, or the\nincoming network. Talkback facilities are included and\npermit talking back to studios, announce booth or remote\nlines. An Over-ride-Remote cue switch is provided which\npermits the remote operator to call in on any of the\nremote lines and over-ride the program on the control\nroom speaker.\nHighest quality components are used throughout the BC-6A.\nInterlocked push-button switches are cam operated leaf\ntype, assuring years of trouble-free operation. Improved\nfast relay circuits for speakers reduce the possibility of\nkey clicks and audio feedback. The amplifiers are of a\nnew, compact design of modular construction having dip-\nsoldered etched wiring amplifier subassemblies similar to\nthose designed for the BC-5A consolette.\nThe BC-6A has two power supplies, each powers a single\nchannel and alternate pre-amplifiers thus providing greater\ncontinuity of service. Both are completely self-contained\nunits. The total power input required is only 300 watts,\n50 to 60 cps at 100 to 130 volts. The frequency response\nfrom any input to the line output is within ±1.5 db from\n30 to 15,000 cps. The total rms harmonic distortion is less\nthan 0.5% from 100 to 15,000 cps at a line output level\nof 18 dbm.\nServicing new BC-6A Consolette is greatly simplified by hinged front panel and removable cover."
}