{
  "id": "d928-39",
  "text": "CATALOG\nB.1102\nSTANDARD CONSOLETTE\nTYPE BC-3B\nFEATURES\n• Complete high-fidelity speech input system\n• Provides facilities for thirteen inputs\n• Modular construction, etched wiring sub-\nassemblies\n• Compact size—entirely self contained (in¬\ncludes all amplifiers and power supply)\n• Means for supporting script on front panel\n• Styling matches other RCA audio consol-\nettes and is compatible with TV terminal\nequipment\n• Maximum facility at new standard of\neconomy\nUSES\nThe new RCA Type BC-3B Standard Consolette provides\naudio amplification, switching, control and monitoring\nfacilities essential to the operation of medium size radio\nor television broadcast stations. This model incorporates\neight mixer positions, which control the thirteen inputs. It\nprovides sufficient flexibility to accommodate two studios,\nannounce booth, control room, transcription turntables and\nauxiliary input circuitry.\nThe BC-3B Consolette may be expanded by tying in the\nBCM-1A Auxiliary Mixer to provide additional microphone\ninputs, or it may be matched with a BC-5A audio con¬\nsolette to provide true dual channel master control oper¬\nation. The styling of the BC-3B is uniform with all other\nRCA audio consolettes. The unit provides maximum facil¬\nities at new low cost. It is also economical to operate, and\nhas been designed for operating convenience and ease\nof servicing.\nDESCRIPTION\nThe new Standard Consolette, Type BC-3B, is a compact,\nself-contained audio speech input system mounted in a\nsmartly styled housing of all-metal construction and finished\nin two-tone umber gray. A hinged front panel and remov¬\nable cover provide access to tubes, switches, gain controls\nand other interior components.\nAn etched panel contains all operating controls, an illum¬\ninated volume indicator calibrated in VU's, and a rack\ndesigned to hold script. Extremely flexible in operation,\nthe BC-3B will handle thirteen separate inputs with pro¬\nvisions for simultaneous mixing of any eight inputs. There\n5512B"
}