{
  "id": "d928-53",
  "text": "m* Mobert g. m&erwoo&j Jr.\nHetvork Manager, MAM\n119 Gregory Ball\nUrbaaa, Illinois\nBear Bob:\nInference i® made to Tony Barfcriage’s letter to yon of mrch 6, of\niddlch he ms kind enough to semi m2 a copy.\nI would hope that it would he possible for us to mite this series of\nprograms available to our members - if you can work out the details.\nTony1® suggested cost of #2-50 peer hour seems reasonable enough - at\nleast for sods of our stations - and it would probably be worthwhile\noffering to them, even if only a few took the program.\nIt seems that you could sake the met known to the member stations\nthat this series would be available at m additional cost, and see how\nmany of them are interested. I gather fra© Tony’s letter that it\ndoesn’t matter to CSC how many carry the programs - even if it is only\nhalf a dossea.\nIt seems to me that we could logically add a small sum for our expense\nof dubbing and shipping - since these program® would be in addition to\nour regular load * and thus charge our stations perhaps $3.00 or $3.50\nan hour - whichever you think would cover our costs.\nIt seems to me, at least from where 2 sit, that this is the sort of\nprogram possibility we bad ia mind when we adopted the mm procedure of\ntrying to make certain f*extmn things available to the Hetvork at a\nmodest surcharge. And the nice feature of Tony’s offer is that m mm\ncoosttteed to pay only for those stations carrying the program * those\nwe know will be paying for it ~ and thus we have no \"risk capital;t in¬\nvolved from our point of view.\n®£ course, there say be- problems that I don’t imediately see, but, if\nnecessary, we can discuss this when I’m in Urban® in a couple of weeks.\nIh the meantime, perhaps you cm give it some thought * m& cheek with\nM Burrows if you want to. tod certainly, as Tony suggests, if we have\nnailed it down before then, we- can all discuss it at Columbus.\nAt any rate, how about letting Tony have your reactions * with a copy"
}