{
  "id": "d928-7",
  "text": "-c\nDRAFT Equipment Requirements\n- HAEB Ifetwork\nIn ardor to improve the quality of network output the following proposal\nfor new and additional equipment has been prepared. Some of it could be used\nimmediately to improve efficiency and network quality. Part of it contemplates\nnew space which probably would be in a new location separated trm the WILL\nstudios and recording facilities. In this ©vent, a small speaker’s studio\nwould be necessary, in fact it could be used now in the addition of commentary\nto musical programs now being duplicated*\nThe receipt of the Madel 300 Arapex Magnetic Tape Recorder, now on order,\nwill allow a complete overhaul of present Ampex recorders, on© at a time.\nThere were purchased in March, 1953 and are in constant use.\nOne of the most pressing needs is for adequate monitoring facilities\nboth for the network manager in auditioning network offerings and also in the\nIijmmm duplicating room for checking the quality of duplicated tapes. At\npresent this is done on Magnecorders equipped with 5 inch speakers which makes\nit difficult to adequately judge tape quality. Magnecorders have a fast\nforward position which is only relative so that equipment with a really fast\nforward speed and adequate speakers and monitoring amplifiers are needed. The\nfollowing equipment will adequately provide for monitoring purposes*\n2 - Model 352 Ampex Tape reproducers t ® $1,000\n2 - RCA MI-11407A Wall Speaker Housing 6 $37.50\n2 - RCA SL-123 12« Loudspeakers 0 $33.35\n2 - Heathkit 20 watt Amplifiers @ $35.50\n$2,000.\n37.\n66.\n71.\n$2,212.\nPresent hi-fidelity music tapes now being bicycled on the network were\ndone on a contract basis. In order to take advantage of the additional\nfrequency response and other quality factors, present duplicating equipment\nin use since 1952 add 1953 should be supplemented with equipment which will\nduplicate tapes for playback at 15tt per second. Since present equipment\nwill not accomodate the 10 inch reels which are required to hold 30 minute\n3I83S8"
}