{
  "id": "d1464-32",
  "text": "Here's What Our Listeners Said:\n/ iwould like to compliment you upon . . excellent cultural and public service\nprograms . . . objective coverage of nevus and special events . . .\nE. S., New York 22, N. Y.\nYour objective program The Listener Talks Back . . . vuas very informative\n. . . no commercial radio interest vuould have been able or vuilling to present\nsuch a topic fairly . . .\nR. T., New York 2, N. Y.\nPlease accept my sincere thanks and appreciation for your broadcast of the\nU.N. Assembly meeting on the Palestinian problem . . .\nB. S., Asbury Park, N. J.\n1 vuould like to commend you upon the highest standards your fine broadcasting\nunit has attained and continues to uphold . . .\nH. J. M., Irvington, N. J.\nI have just become a citizen of this great country, and one of the first things I\nwish to do is to express my thanks to you for the many, many programs given\nover fVNYC which enabled me to gain a real knowledge and understanding\nof this country, of the American JVay of Life, and of national and civic affairs.\nM. P., New York 17, N. Y.\nThank you for the magnificent UN radio coverage — best thing that ever\nhappened in radio.\nFrances Gunther, Inside Place, Madison, Conn.\n... a few words of appreciation for the way the afternoon popular record hour\nis conducted . . .\nS. H., New York 25, N. Y.\nIVe want to express . . . particular appreciation of David Randolph’s Concerts\nfor Connoisseurs . . .\nW. T. G., New York 11, N. Y.\nThoroughly enjoy the piano concerts given from 8:00 to 9:00 on Sunday\nevening . . .\nA. H. S., Butler, New Jersey.\n. . . my thanks for and appreciation of your broadcast of the “Story of\nAmerica” ...\nI. J., New York 52, N. Y.\nYour presentation was immense ... let us have more of them . . .\nJ. P. P., Brooklyn 14, N. Y.\nBless you for your good taste and judgment in music!\nD. S., New York.\nCongratulations! I find I keep the city station on most of the day . . good\nluck ...\nR. R. L., Brooklyn 3, N. Y.\nI wish to inform you of my satisfaction with your coverage of this year’s\nelection . . .\nJ. B. B., New York 25, N. Y.\nI am proud that we have such an excellent city radio station . . .\nW. S., New York 21, N. Y.\nThis is definitely a fan letter . . .\nR. M., New York 19, N. Y.\n. . . I want to extend my heartiest endorsement of your programs both musically\nand socially . . .\nD. D. C., Brooklyn 2, N. Y.\n-31 -"
}