{
  "id": "d1790-0",
  "text": "1\nN\nA\nEJ\n1\nw\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. XXVI NO. 3 MARCH 1961\nNAEB Functions Transferred to Washington\nOn March 6, all NAEB member services except the\nnetwork and publications will move from Urbana to\nWashington. Servicing of present members, member¬\nship and general promotion, billings, handling of rou¬\ntine requests for information, liaison with other organi¬\nzations, committee relations, etc., will be handled\nfrom the Washington office.\nFor convenience, mailing lists, stocks of publica¬\ntions, etc., will be maintained in Urbana with publica¬\ntion and bulk mailings made from there. The Urbana\nstaff will consist of Bob Underwood and his net¬\nwork crew; Betty McKenzie, publications editor; and\nsome part-time secretarial assistance.\nr\\ Members are requested to direct all questions,\nsuggestions, and miscellaneous matters, not pertain¬\ning to the network or publications, to the Washington\noffice.\nNetwork Inaugurates New Programs\nBeginning March 29, the Network will inaugurate a\nnew service to members under the general title, Special\nof the Week. Each week Network members so re¬\nquesting will receive a half-hour program (in addition\nto the regular shipment). The plan is to have about\nthree of every four special programs originate in\nWashington with one show a month featuring talks,\ninterviews, etc., with prominent figures on subjects\nof national interest.\nEd Burrows, chairman, Network Acceptance com¬\nmittee, is beginning to build a backlog of programs of\nthe latter type which will come from member stations\nas they obtain such talks and interviews. In the event\na Washington program is not available during a given\nweek, a program from the backlog will be used. All\nof the Specials of the Week will be packaged at\nWUOM under present plans, and notice of the con¬\ntent of each special will be sent with the cue sheets.\nIn addition, beginning March 29, network mem-\nC bers will receive Report from Washington. This will\nbe either a five-minute or fifteen-minute program of\nbackground news or commentary; the exact length\nhas not been determined as yet. These programs will\nbe packaged in Washington under the supervision of\nO. Leonard Press and will be sent by airmail to\nnetwork headquarters in Urbana for distribution.\nThe content of both series should be good for\nabout three weeks after the initial recording. Thus, all\nmembers will have an opportunity to get it on the\nair before it becomes dated. These new programs are\na part of the additional service promised to network\nmembers at the time the network fee increase for\n1961-62 was announced.\nNetwork Needs In-School Submissions\nA reminder to Network members: Submissions for the\nnext in-school offering should be made within the\nnext two weeks.\nFull information regarding submissions and sub¬\nmission forms may be obtained from Network Head¬\nquarters in Urbana. Since this program service de¬\npends entirely upon the support of network members,\nwe would like to have a large number of submissions.\nHow Much TV For Education?\nJust what does education need in the way of tele¬\nvision channels, now and in the future? This is the\nquestion the NAEB hopes to answer in a project it\nhas undertaken under Title VII of the National De¬\nfense Education Act.\nThe survey has the blessing of the FCC, which has\nannounced as its No. 1 problem the proper allocation\nof TV spectrum space. Without specific evidence of\neducation’s needs, the FCC has indicated that educa¬\ntion might be seriously slighted in any redesign of\nthe TV allocation system.\nPiloted by Vernon Bronson, former director of\nradio-television education for Dade County (Fla.),\nthe project will start with a nationwide survey of\neducators to determine ETV space needs. This phase\nis expected to be completed by May.\nThe second phase (which will be completed by\n1"
}