{
  "id": "d1790-2",
  "text": "NAEB HifIV7S LETTER\n,.. ,May 1, 1941 . . Page 3\nKflSC one of the largest and most appreciative audiences in\nthe history of the station,.\n«A large amount of high fidelity equipment has been put into\noperation at the transmitter, all of which has improved the\nquality of our transmitting signal*.\n«Next week KWSO offices will expand into new quarters,. In\nthe new setup the floor space for offices will he tripled*’1\nKENTUCKY TO PRESENT M COMERS AT ION HOUR”\nIn an effort to develop a truly extemporaneous type of radio\ndiscussion about things of current interest, the University\nof Kentucky is dropping its nBehind the Headlines’* Sunday\nnoon thirty-minute program over WIIAS, Louisville, at the end\nof Anril, and will substitute a program entitled Conversation\nHour” according to E.G. Sulzer, director of U,K. radio activities,,\n”V?e have not been completely satisfied with our roundtable for\nsome time,” declared Mr. Sulzer, ”Uhile the performers have\nbeen completely capable and while the roundtable itself, i\nbelieve, has measured up favorably with other roundtables on\nthe air there has been too much microphone consciousness on\nthe part of the participants, and, perhaps, too much preparation.\nI would like the public to get the real views of the participants,\nnot the ones prepared for public consumption* Any kind ol radio\nforum should be frank, open, and presented with a complete lack\nof self-consciousness*”\nThe new \"conversation hour” will be a program designed to catch\nthe participants guard*”\nA complete rehabilitation of the equipment in the University of\nKentucky’s forty listening centers in southeastern Kentucky is\nplanned fox the near future because of a gift of 38 new battery\nand two electric radio sets to the University. The gift made\nby radio station 'mMS, Louisville,, as a part of their policy\nin furthering the University’s work in equalizing listening\nopportunities for those portions of Kentucky remote from radio\nstations will enable the University of Kentucky to replace\nevery one of the sets now in use by new ones of the most modern\ndesign.\nThe listening center system was started by the University of\nKentucky in 1933 for the purpose of providing facilities for\nlistening to educational and other worthwhile broadcasts. VJhile\nthe number of radio receivers in the Kentucky mountains has\nincreased several hundred fold s:.nce that date, the centers\nare still proving their usefulness as focal points for\neducational listening activities. Last fall a similar system\nof listening centers was started ia eastern Tennessee,"
}