{
  "id": "d1169-2",
  "text": "PERSONNEL\n^ Bill Utter will return to WMUB-TV, Oxford, Ohio, in\nJuly as program director following a year of graduate study\nat Ohio State University.\n^ Robert Falkner will become a producer-director at WOUB-\nTV, Ohio University, this summer. He is an Air Force vet¬\neran of 22 years.\n^ Richard Reinauer has been named executive director of the\nAcademy of TV Arts and Sciences Foundation.\n^ Paul Reed, editor of Educational Screen and Audiovisual\nGuide, has been elected chairman of the board of trustees of\nthe Empire State FM School of the Air. Reed, also super¬\nvising director of instruction for the Rochester Public Schools,\nfounded the one-station Rochester School of the Air which\nin 1947 became the statewide school of the air.\n^ Armand L. Hunter has been named director of continuing\neducation at Michigan State University, succeeding Howard\nR. Neville, who has been named provost of the university.\nHunter will continue as professor and director of broadcast¬\ning services; for the past year he had also been associate di¬\nrector of continuing education.\n^ M. McCabe Day, director of WVSH, Huntington, Indiana,\nannounces his retirement effective June 12. He completes 43\nyears in the Huntington schools, where he was a teacher in\nthe high school for 25 years before becoming full-time audio¬\nvisual director in 1946. Since 1950, the year WVSH went on\nthe air, Day has attended 13 of the 14 NAEB conventions.\nHe served for nine years on the in-school selection committee\nof the NAEB Radio Network, and was a participant in the\nschool managers seminar at Allerton House in 1952. Follow¬\ning retirement, he will become lay minister for the First\nMethodist Church in Huntington, where his father served as\nminister.\n^ George Gerbner, associate professor at the University of\nIllinois communications research institute, will become dean\nof the Annenberg School of Communications, University of\nPennsylvania, July 1.\n^ Former ABC vice-president Sterling Quinlan has joined\nthe executive staff of Field Enterprises, Inc., where he will\nsurvey the electronic communications medium for its possi¬\nbilities in education, communication, and entertainment. Field\nEnterprises publishes the Chicago Sun-Times and Daily News\nand the World Book Encyclopedia.\n^ Kenneth L. Clark has been appointed general station man¬\nager for KFJC, Foothill College, Los Altos Hills, California.\nHe will also serve as broadcasting instructor. Most recently\nhe was writer-producer for the ABC TV network in Holly¬\nwood.\n^ Murray R. Yaeger, who has been a visiting professor at the\nState University of Iowa this year, will return to Boston\nUniversity in the 'fall. He will serve as acting chairman of\nthe communication arts division of the School of Public Com¬\nmunication for the first semester, while D. Hugh Gillis is on\nleave of absence.\nJeffrey Field, student station manager of WERS-FM,\nmerson College, recently received the Tom Phillips Award,\npresented each year by the UPI Broadcasting Association of\nMassachusetts, to honor the best news stories, editorials, and\nfeatures broadcast by Massachusetts stations. The award, the\nfirst time that a college radio station has received such an\nhonor, was made for the program “Pornography and Youth.”\nThis was also the first time that a full-time student has re¬\nceived the award.\n^ Bob Shackleton has resigned from his post as assistant\nmanager of WKAR, Michigan State University, to become\ncoordinator of an athletic scholarship fund at the university.\nHe has been associated with WKAR nearly 19 years, where\nhe was a student announcer and, after graduation, the sports\neditor, a position he occupied until recently when he was pro¬\nmoted to assistant manager.\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W., Washington, D. C., 20036. Phone 667-6000. Area Code 202.\n^ Spindler & Sauppe, Inc., Los Angeles, has announced the\nretirement of George A. Sauppe, one of the firm’s co-found¬\ners. During the 40 years since the establishment of the firm,\nhe has participated in many improvements—introduction of the\nfirst 750w and 1200w 35mm slide projector, wide angle rear\nprojection techniques, the random access slide projector with\ninstant image retrieval, etc. He has attended many audiovisual\nmeetings through the years.\n^ William J. Moreland, general manager of NAEB Indus¬\ntrial Associate Conrac Division, has been elected vice presi¬\ndent of Giannini Controls Corporation, parent company of\nConrac.\n^ Hugh V. Cordier, head of the department of radio-TV at\nthe University of Illinois and chairman of the NAEB Publi¬\ncations Committee, has assumed the duties of president of the\nAssociation for Professional Broadcasting Education.\n^ WDCN-TV, Nashville, announces that Clyde Reaves has\nbeen appointed operating engineer; Steve Wolf, former stu¬\ndent part-time staffer, has joined the station as a full-time\nemployee.\nPublications\n• Comeback, Inc., has issued a report on its pilot demon¬\nstration on the potential of UHF for recreation-rehabilitation\nof the chronically ill and handicapped in metropolitan areas.\nDigests of the report are available free, and the complete re¬\nport for $1.25, from Comeback, Inc., 16 West 46th Street,\nNew York 36.\n• Articles: “ETV: The Uncertain Trumpet,” by Doris Wil-\nlens, February 1964 Television magazine. “Administrative\nGoals of ETV,” January 1964 American School & University.\n• A booklet describing the first decade of the Alabama ETV\nnetwork is available free from the ETV Commission, 2151\nHighland Avenue, Birmingham, 35205. The 16-page 46-picture\nbrochure is called “Ten Years of Service.”\n• The EMC is offering a directory of 1964 summer courses\non the educational media to anyone sending a stamped, self-\naddressed standard #10 business envelope to the Educational\nMedia Council, 250 West 57th Street, New York 10019.\nSummer ETV Workshops & Courses\nBoston University. Beginning July 15, 6-week workshop in\ncreation and utilization of ITV programs. Six graduate\ncredit hours in education or TV. Write Murray R.\nYaeger, School of Public Communication.\nUniversity of Colorado. Television in Education, three-hour\ngraduate or upper-division. Designed to provide expe¬\nrience for teachers in preparing and presenting materials\nvia TV. Richard H. Bell, June 29-July 17. Radio-TV\nProduction, three-hour undergraduate course in pro¬\nduction techniques and their application to basic broad¬\ncasting formats. James A. Dryden, June 15-July 17.\nFordham University. August 17-21, 5-day ETV conference.\nAlso three ETV courses July 6-August 14: Television\nin the Service of Education, credit; ETV Production,\ncredit; ETV Studio Operation, no credit. The three\ncourses designed to offer complete introduction to theory\nand practice of ETV, including special working ses¬\nsions arranged in cooperation with communications ex¬\nhibits at the World’s Fair.\nHofstra University. Summer TV Workshop for Teachers and\nAdministrators, June 29-July 17. Six-hour graduate.\nLimited enrollment. Write Frank Iezzi, Director, Sum¬\nmer TV Workshop.\nStanford University. A specialized ETV program involving\nmass communications study, noncommercial station op¬\neration, TV teaching and production. June 22-August\n15. Part of the 22nd Radio-Television-Film Institute.\nSyracuse University. Workshop in ETV, three credits. Cov¬\ners role of TV i'n curriculum, TV as medium of adult\nlearning, and preparation of materials for studio use.\nAugust 10-22.\nMAY 1964\n3"
}