{
  "id": "d1387-0",
  "text": "N-A-E-B NEWS- LET\nSEPTEMBER\nOCTOBER NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nISSUE Edited by Richard B. Hull, President\nStation WOI, Iowa State College, Ames, Iowa\nN0VE1 BER 1, 1943\nN-A-E-B DRA‘TS UP 1949 PLANS AT ANNUAL MEETING OH ILLINOIS U. CAIPUS\nOfficers, regional directors, station managers of the National Association of Edu¬\ncational Broadcasters met October 10,11,12 on the University of Illinois campus,\nhome of member station WILL and WIUC and the Institute of Communications Research,\nto discuss problems, and develop plans for the forthcoming year.\nMany States Represented\nThe 3-day session, attended by NAEB members and directors from the states of\nWashington, New York, Alabama, Kentucky, Indiana, Louisiana, Illinois, Iowa, ,0hio,\nWisconsin, Michigan, Missouri, Colorado, Oklahoma, Minnesota and South Da-.ota in¬\ncluded special representatives from the U, 3, Office of Education and the Federal\nCommunications Commission in Washington, D.C., along with trade representation xrom\nAssociated Program Service, Radio Music Corporation, General Electric Company, the\nOhio Institute for Education by Radio and the Rocky Mountain Radio Council*\nCottone and Schramm Speak\nHighlighting the sessions were addresses by Benedict P. Cottone, Chief Counsel xor\nthe FCC and Dr. Wilbur Schramm, Director Institute for Communications Research\nat the University of Illinois, both of whom addressed the group at its annual dinner.\n: New Officers\n1949 NAEB officers include Richard B.Huil, Iowa State College(WOI) as^president;\nJohn Dunn, University of Oklahoma(WNAD) as vice-presidentj and W, I. Griffith, Iowa\nState College(WOI) as secretary-treasurer. M. S. Novik, New York radio consultant\nwas ro-appointed as executive secretaryj 1949 directors include Seymour Siegel,\nMunicipal Broadcasting System(WNYC); Graydon Ausrnus, University of Alabama(WUOA);\nRalph Steetle, Louisiana State Univorsity(WLSU); Harry Skornia, Indiana University\n(WFIU)j Irving Morrill, University of South Dakota(KUSD)j and James 1 orris, Oregon\nState College(KOAC).\nCohn and Smytho Appointed\nMarcus Cohn of Corn & Marks, Washington, D.C* was appointed general counsel for\nNAEB, and Dallas Smythe, former economist with the FCC, now fellow with the Institute\nfor Communications Research at the University of Illinois, as director of studios.\nJJNo_ Ivory Tower”\nPlans for the forth coming year stressed basic job of setting up operation and pro¬\ngram standards for member stations, \"a descent from thq ivory tower\" with stress on\ncompetition for audiences and public support. A plan for linking NAEB FM and AN\nstations first by transcription and later by relay network is now under study.\nNAEB Objectives\nBasic objective of NAEB station activity for the 50 member stations, located in\nmany key population spots in U.S. is to provide, not long-hair programs for a\nso-called \"class audience\" but \"special service for the general audience.\" NAEB\nmaintains one-third of the U.S. is not served with special interest programs, pro¬\nposes to fill that gap through member station facilities.\nVice-President Treasurer Executive Secretary Executive Committee\nJohn Dunn W. I. Griffith M. S. Novik Seymour Siegal, WNYC, New York Graydon Ausmus, WUOA-FM, Alabama\nWNAD, University of Oklahoma WOI 30 Rockefeller Plaza Carl Menzer, WSUI, Iowa Ralph Steetle, WLSO-FM, Louisiana\nNorman, Oklahoma Ames, Iowa New York, N. Y. Frank E. Schooley, WILL, Illinois William Sener, KUSC-FM, California\nTER\nSEPTE1 EER\nOCTOBER\nI .SUE"
}