{
  "id": "d1387-1",
  "text": "-2-\nUFIVERSITY OF MINNESOTA'S KUOM BEGINS NEW DOCUMENTARY SERIES\nKUOM, FAEB outlet at the University of Minnesota, noting the need for better educa¬\ntional and documentary material, especially for local sta.tion outlets, and aware of\nits responsibility has announced two important 13—week series of transcribed puolic\nservice programs for 1943-49.\nWith the full educational and scientific resources of the University at its disposal,\nKUOM, under the direction of manager Ruth Sv/anson, will offer first a report on\ncurrent developments in science, education, and agriculture throughout the Gopher\nstate and second, a dramatic presentation of Minnesota’s rich and colorful history\nas recorded in actual grass-roots accounts by Minnesota pioneers. A wide local-\nstation useage is expected in addition to the KUOM originations.\nLast February, KUOM supplied 20 1 innesota stations with a series of 15 minute docu¬\nmentary programs entitled, ’’The University Reports to the People.” In lay this\nseries won The Billboard I agazine Special Award for Public Service_,Br^dcastin^in\ntheir first nationwide Annual Local Program Competition,\nADDITIONS TO KWSC STAFF IN WASHINGTON\nFrederic Hayward, manager of FAEB station KWSC, Washington State College, announced\nappointment to the KWSC staff of two new men—Hugh Rundell, radioman from West\nVirginia joined the station in September as director of sports and special events\nand Robert Baird, Idaho engineer, became chief engineer for KWSC imOctober,\nUNIVERSITY ASSOCIATION FOR PROFESSIONAL RADIO EDUCATION (UA~RE) announced plans for\nsetting radio teaching standards in American colleges and universities,.began oper¬\nation with 9 charter member institutions, and blessings of NAB, Emphasis is to _\ncreate professional atmosphere, offer professional level training to radio-minded\nstudents, and eliminate racketeering radio schools in U.S. which operate without\naccreditation.\nSCHOOL BROADCAST CONFERENCE IN CHICAGO HCFO ED GEO 1GE JENNINGS, PRESIDENT AMERICAN\nASSOCIATION FOR EDUCATION EY RADIO with Annual Award of Merit in Educational Radio.\nJennings is director of radio for the Chicago Public Schools, SBC viewed education¬\nal radio picture—both in and out of school broadcasting— critically and noted need\nfor realism, improved techniques, necessity of better reaching more people with\naccurate information re crucial world problems.\nWHAT IS FM & WHY\nStrongest FM enthusiasm exists in ’’static filled\" South and among AM stations\nwhich have poor standard broadcast frequencies.\nRecurring pattern of doubt re FI is strongest in East, and strongest in network\nand dominant station circ3-cs—in fact strongest wherever current A1 license .holder\nhas dominant position. Many ’’big” operations frankly admit their interest in FM\nis a \"hedge” interest, and their holding of CP, is to \"cover”.\nFact remains, despite high-fidelity argument, FM is merely a \"different and\nbetter\"way of doing what AM does. One broadcaster recently confided to FAEB\n\"a fifty-kilowatt station dominates my city market—why should they have FM?\nOn the other hand my own station has a lousy frequency and directional pattern.\nWe have a top FM installation, get a good pattern, better coverage—all we’re\nwaiting for is sets—and we believe they’re coming.”"
}