{
  "id": "d1387-1",
  "text": "Individual Member Board - Elected by Regions. The length of terms for this\nnewly elected Board are: Regions I and IV, One year terms; Regions II and V, Two year\nterms; and Regions III and VI, Three year terms.\nRegion I - Albert P. Fredette, Manager, Station WAMC-FM, The Albany Medical College\nRegion II - James P. Etheridge, Jr., Executive Secretary, Florida ETV Commission\nRegion III - Robert R.Suchy, Director, Educational Television Department,\nMilwaukee Public Schools\nRegion IV - W.D. Donaldson, KTCA-TV, St. Paul, Minnesota\nRegion V - Richard Bell, Director, Radio and Television, University of Colorado\nRegion VI - John Crabbe, General Manager, Station KVTE, Sacramento, California\nInstructional Division Board - Elected by Regions. Regions III and VI, One\nyear terms; Regions I and IV, Two year terms; and Regions II and V, Three year terms.\nRegion I - James F. Macandrew, Director of Broadcasting, New York Board of\nEducation\nRegion II - Roy J. Johnston, Acting Director, Div. of Communications, U. of Miami\nRegion III - Charles McIntyre, Coordinator of Instructional TV, U. of Illinois\nRegion IV - Walter Kemmerer, KTCA-TV, St. Paul, Minnesota\nRegion V - Bart Griffith, Director, Instructional TV, University of Missouri\nRegion VI - Richard B. Lewis, Audio-Visual Service Center, San Jose State College\nA Chairman of the twenty-four man Board will be elected by the end of January.\nMORE ETV GRANTS APPROVED\nThe following grants were approved,under the ETV Facilities Act, by HEW Secretary\nCelebrezze on December 9, 19^3:\nSchool District No. 1, City and County of Denver, Colorado (File #7). To\nexpand the facilities of KRMA-TV, Ch. 6, Denver, Colorado. $58,688.\nDuluth-Superior Area Educational Television Corporation (File #12). To\nestablish a new noncommercial educational television station operating on Ch. 8, Duluth,\nMinn. - Superior, Wise. $212,625.\nRegents for the University of Georgia (File #14). To expand the facilities of\nWGTV, Ch. 8, Athens, Georgia. $136,109.\nDelta College (File #17). For the establishment of a new noncommercial educa¬\ntional television broadcasting station, Ch. 19, Bay City, Michigan. $183,920.\nThe School District of Kansas City, Missouri (File #18). To expand the\nfacilities of KCSD-TV, Ch. 19, Kansas City, Missouri. $102,000.\nAPPLICATION FILED IN ITV - FIXED SERVICE\nThe FCC has received the first application in the Instructional Television-\nFixed Service. The application was filed with the Commission, on January 6, by\nthe Plainview-Old Bethpage Public Schools, Central School District #4, Plainview,\nN.Y. for Ch. B-l, 2506 - 2512 me.\nOTHER FCC ACTIONS\nOn Dec. 10, granted to the Office of Education, County of Santa Clara, Calif.,\nSan Jose, Calif., CP for new ETV station to operate on Ch. *54; visual, 25*10 kw -\naural, 13*50 kw.\nGranted CP to Central Virginia Educational Television Corp., on Dec. 18, for\ntelevision station to operate in Richmond, Va., on Ch. *23* ERP, 525 kw visual and\n263 kw aural. This brings the number of authorizations for noncommercial educational\ntelevision stations to 100."
}