{
  "id": "d1387-10",
  "text": "-11-\nCOY APPRAISES FUTURE OF AN & FI -—SEE TV AS SEPA^TE^ITITY\nSpeaking at an October mooting of the New York Radio Executives Club, Wayne Coy,\nFCC chairman, attracted industry wide attention with three predictions:\n1. Television will probably never replace sound broadcasting completely.\n2. Television will probably eventually operate separately from sound\nbroadcasting—either AN or FI..\n3. Sound programming which appeals to special groups will continue to\nhave an eager, if not a mammoth audience.\nCoy estimated that the next seven to eight year period will see 1000 television\nstations on the air. He pointed out, however, those stations will not cover the\nentire country, and that large areas will be unserved by television.\nFM was described as a service which is meeting the need in a real way with, com¬\nmunities of 30 and 40 thousand marking some of FI ls greatest success stories. Those\narc communities which have heretofore not had primary radio service of any kind.\nUQftLD HIC-H FREQUENCY CONFE MFCS ORGANIZES\nPreliminary work of the World High Frequency Broadcasting Conference, now in pro¬\ngress at Mexico City, D.F., continued last week with formation of committees,\nafter unresolved disagreements over seating of delegates.\nDisagreements arose when the Soviet Union objcctod to the seating of a delegate for\nJapan from, the Supreme Command, Allied Powers, and when Groat Britian objected to\nseating of a delegate from Israel. The Soviet Union also objected to an observer\nfrom UNESCO.\nBoth disagreements were referred to th.cCrcdcntio.ls Committee, ana the Conference\nproceeded to forme.tion of other committees o.nd the naming of ofiicons.\nGracia Lopez, Mexican 1 inistcr of Public Works, was elected honorary prcoia^nt,\nwith Niguel P^rcyra, of Mexico, as o.ctivc president. Lazaro Barrajas, also of\nMexico, was named vice president.\nTli§> draft of Rules of Procedure adopted was drawn principally from those used.in\nthe Atlantic City conferences. Four working languages, English,.French, Spanish,\nand Russian, wore adopted. Eight working committees were established.\nDAVY IN OREGON RADIO CENTER\nThe University of Oregon at Eugene has appointed Robert L. Davy to the staff\nof' the Speech Department. Davy is WHA (University of Wisconsin) product,\nhaving received his masters degree in Madison, June 19. At Oregon, he.will\ninstruct radio courses and take part in the supervision of.public service\nprograms. These programs, produced in the University studios, arc aired\nover state station K0AC, Corvallis, and commercial stations in Eugene and\nPortland.\nThe Speech Department is now building a new speech plant in Villard Hall,\nwhich includes a set of new radio studios and radio equipment. The new\nproduction unit is scheduled to be in operation by January 1."
}