{
  "id": "d1387-15",
  "text": "-16-\n\"Practicality First”\nleanwhile, wo arc trying to line1, ways to make television — with its very high\ntime value, and various programming \"extras” for visual materials, etc.—\npractical and effective for various levels of operation: Department, State\nagencies, county workers.\nOne of the many problems in programming is to find how to adapt the vast amount\nof economic reports and other current information to day-to-day news ana other\nShOWS•\n’fays and Moans\nIn our television research project financed under the Research and Marketing Act,\nwe are searching for effective ways to use television in promoting more efficient\nmarketing, greater use of farm products, and information for consumers. As we\ntest various program techniques, we will carry on program analysis at various\nlevels; information technicians, administrative and professional personnel,\ngeneral audience. As time and money permit, we expect to get into general audience\nsurveys, inclu ding a study of the effectiveness of television in changing\npractices and selling ideas,\nFARM RADIO 0IJIESR3JIIP IFCRBAlgS,\nBMB figures on radio ownership as of January 1943 show changes. Estimates of\nthe total number of United States families were made from census data in accord¬\nance with a formula developed in cooperated with the U, S. Census Bureau. .Per¬\nsonal interview surveys by private research organizations provided the radio owne±~\nship data. The figures show that a total of 37,623,000 United States families\nowned one or more radios in working order in January. According to the BIB state- -\nmont, radio ownership in urban districts rose slightly over that of 1946, from\n95.2 to 95.7 percent; rural nonfarm (village) ownership climbed from 87.4 to\n94.4 percent; and farm family ownership made the greatest increase of all, from\n76.2 to 88.7 percent. Massachusetts was top State in percentage of urban radio^\nownership, Utah ranked highest in village radio ownership, and Washington was.first\nin percentage of ownership among farm families. Details of the survey are being\npublished by BMB.\nNATIONAL^COUNCIL OF PARENTS & TBACHERS ASK FOR. STATE LAW ON C01 ICS-RADIO\nPTA!crs have demanded state laws be passed prohibiting objectionable comic\nbooks, and urged the formation of local committees to evaluate comics, radio\nprograms and motion pictures. Action was also requested on the national\nlevel. Resolutions were passed at a Chicago meeting in September,\nTho committee further suggested that studies in evaluation of radio programs\nand movies be included in school programs^"
}