{
  "id": "d1387-18",
  "text": "-19-\nS—WALES AND PLACES\nThree N-A-3-B stations have now compiled and made available to commercial station\nnews departments in their areas, accurate listing of town, city, and county\ndesignations together with river and lake names and pronunciations.\nStation WHA, University of Wiseonsiu,.IMJ^he^arade^m\nappeared in 193.8,1 and appears in new and,rpvlsM.i^jiL_a^of. I ayit,. 124°«\nStation WILL, University of IllinoisfollpvroXtkgJ^2^0^^\nFrank Schooley, assistant director of the, ,statipn^_arXa^J^\ndepartment.,.\nStation WSUI, University of Iowa, followed\n£rtehPv-lEza^i L-Elff news chief and stafdcp.artmcnt.\nITS!-I JUDGING PROCEDURE FOR 1949 OHIO IUSTXTUTEEXUIBIT\nOhio State University, sponsoring the annual Institute.for Education for Radio and\nthe annual Exhibition of Educational Radio Programs, will follow a new judging\nprocedure this year according to Dr. I. Keith Tyler, institute director.\nPrograms heard on nation-wide ne taorksJLn, the. fn-4 PJlMa^wil,3._c^gin_ JoJ^dgod\n55live*”\" by special cormnittces in. tho_ New York. arpa,_. Judging:.pX all. ot^piipnt^isp\nwill be handled by co’opcratiye.* ^ajpatAo^^ t^1G SfiBSSSZ*—-there\nwill be no preliminary local .screoning.\nUnder direction of competent authorities in radio evaluation each center will be\nresponsible for the entire process of evaluation and selection of awards for a\nparticular class of programs.-In that way all programs will bo considered the\nsame judges who make the final selections of awards and honors, olo mentions.\nAwards wi 11 be made., for ^h_oA144iI££E^\nTTf national networks. (21\"regional\nbroadcast over lc'al stations,\nDeadline for submitting entries is January 15, 1949. Awards will bo announced dur-\ning the Institute for Education b'- Radio, to bo held in Columbus, Ohio, Lay 5\nthrough o.\nROOKS FOR BROADCASTERS\nComplications in ISodorn Society. Fifteen studios of the mans media prepared\nfor~*tho' University of Illinois Institute of Communications Research, and.oditud\nby Wilbur Schramm, Director of the Institute. cl94S. 252 p. .A.00. Univer¬\nsity of Illinois Press, Urbana, Illinois.\nNotable research men in education, radio, journalism, psychology and public\nopinion conferred at the University of Illinois for an over-all discussion\nof the status of press, radio and motion pictures. Dr. ochramm fat that it\nwes time for communications men to look around, take stock, and ask.\ndo wc go from hero??1 Such questions as; ”What culture and value\nbeing presented by the media to the audiences wno give tnem ono-ufth ot tiicir\nwaking\"hours? How much bias, if any, are thsv introducing to the national\ntradition? What does mass communication do to an individual. As opposed t\ngovernment control and regulation, private administration ana responsibility\nof mass communications are facing a challenge of unrivalled opportum y*"
}