{
  "id": "d1387-19",
  "text": "-20~\n“THIS IS THE MUNICIPAL BROADCASTING_SYST^n\nEnromrintr is title of annual report. ofTO &\nthrTfiitv^of How' SST Prepared by. Seymour S^ql^djjoctor; and. J^m_I^P^oaga»\nmost dramatic reports of non^commorcial radiO_gSSaP.P Tot to aPKj^}--A--_. _ --.-r~\ntTito7TorTcTt.v officials and still .B:jJ3?lo.jag^^\nTo secure coyios or further informtion about this^rgeoila^^\ndirector IjrYU AKT) IMYC-FIi. i unicipal Building. Now Yprk_City.\nn UNEERSTATDING 0UR1ELVES\"\n--————-* centers\nAlabama College for Women, long one of MSB's loading production' has from tire\nto tiro released an excellent series of brochures covering various sene, of\nbroadcasts#\n''Understanding Ourselves\", a compilation of psychology broadcasts, previously\nnmowcod for distribution, has boon temporarily delayed due to —1 pressure\ninstitutions publications board. Detailed information may bo obtained from\nHelen Parrish, radio assistant, Alabama College, hontevallo, Alabama.\nWBAA OPERATION PORTFOLIO\nStation WBAA, Purdue University, is recognized as one of NAEB’s most efficiently\noperated ^ember^stations• At the request of NAEB headquarters WBAA director^ .\nJim Miles, prepared a portfolio covering detailed aspects ox iBAA operation from\nlogging to station break policies and procedure*\nInformation on the portfolio may bo obtained from Jim Kilos, director, Station\nIIBAA, Purdue University, LaFayctto, Indiana,\n1to'S~M~C0Y Olf EDUCATIONAL BROADCASTING\nThe FCC has given NAEB permission to duplicate and distribute the convocation\naddress of Wayne Coy, Federal Communications Commission Chairman, made at tho\nSecond Annuaf?onforJnco on Radio in Education at Indiana University last summer\nTho address is by no means an ordinary spooch--it_gmb^lps the caroful_£M\ntiTVou-A thinking of Ir. CoL-Wit^-?^^ oLoucstin_\ncalled up by_ pdiien^^nal^ public scrvlcc_arid^»\nVJhilo it aaaaot. nooo.ssnrilv be construedJ^o_rCErescnt_tho. XsffiSiSL-\nof tho FCC~.'~it is perhang the. Jgst.jj^ statpmont.maao—y—\nCommission representative,\n• ■ aTfw onFi-findS it to tilO very ulii'ux uo. q q~-—r . r—r „\ntSSr^dttSSstrativo heads of public, agency.\nan interest in radio_„biioadcr,stingy\nNAEB will distribute c^i^^^cjL.mcmberJ_aajiU haP^\n\"aT^yrTTn'Truest to non-members,\nT-JOI, Ames, Iowa"
}