{
  "id": "d1387-2",
  "text": "-3-\nSEPTEi BER-OCTOBER TRADE TOPICS\nRADIO I ANUFACTUREk!S PRODUCTION FIGURES BLASTED by FHA executive director, J. N.\nBailey, who criticized RMA production figures for the first 7 months of the year.\nCharges stated Rl'A figures did not release FI-television set production separately\nfror straight television sets, and pointed out thousands of TV set owners can and\ndo time in FI stations during many hours TV is not on air*\nFIA STATED THERE ARE NOW 607 C01IERCIAL FK STATIONS ON THE AIR, 22 non-commercial\nstations, and another 407 FK grants which have been issued by the FCC. During\nAugust 28 new FM stations went on the air.\nHARNESS ca FITTEE IN HOUSE OF REPRESENTATIVES HOUND UP INVESTIGATION of the\nFCC with \"Scott Decision\" as springboard, lashing at Commission’s \"airtime for\natheists\" first on basis of \"irreligion\" and second for FCC’s alleged failure to\nbe consistent in enforcing rules. Hearing sparked and punctuated by comments of\nhonest critics, cranks, censors, and politicans.\nNATIONAL ASSOCIATION OF BROADCASTERS QUERIES 1EMBERSHIP ON NEEDS, USES, AND LOCATION\nof relay bands for A1 , FK, and television, seeking information for UHF study and\nother hearings before the FCC later in the fall.\nFCC POSTPONES DATE FOR EQUIP!.ENT TESTS ONE YEAR EFFECTIVE AUGUST 1, 1949 pending\nappearance of needed equipment for performance measurements tests for AN & FK sta¬\ntions .\nTELEVISION LEADERS CALI ON FCC TO LAKE EVERY EFFORT to provide more low-band tele¬\nvision channels promising at the same time to make every effort to develop UHF area\nwhich is expected ultimately to be commercially feasible.\nRADIO NEWS DIRECTORS PLANS THIRD ANNUAL 1 EETING IN ST. LOUIS WITH TELEVISION news\ntechniques up for major consideration, along with special event handling, facsimile\nnews broadcasting, and general newscasting trends. Meeting November 12-14.\nTELEPHONE INTERVIEWS FEATURED IN NEW REPORTING TECHNIQUE with growing useage of two\nway telephone conversations now permitted by FCC. Telephone conversations may now\nbe recorded for broadcast if phone circuit contains warning \"beep\" signal.\nAR1 STRONG-PI'A PLEA FOR 44-50 1C. BAND RETENTION TURNED DOWN BY FCC with Commission\nexplaining low-band FM must go in interest of fixed and mobile services and national\nsecurity. Plea had called for 2-year extension of close-out date from December 1.\nNBC HOLDS ANNUAL 1EETING AT SUN VALLEY 'HERE NAB CODE IS BLESSED, TV CONSIDERED,\nWORRIED ABOUT AND APPROVED, AND AN GIVEN A VOTE OF CONFIDENCE FOR A DOUBLE DECADE\nCOLONIAL FI NETWORK, LINKING 5 NEW YORK STATIONS BEGINS OPERATIONS with a daily\n1-hour program service from 7:00 to 8:00 p.m*"
}