{
  "id": "d1387-20",
  "text": "-21-\nKOAC, Oregon State College, Corvallis wants a staff announcer by Hovenber 1. Pre-\nfers applicant to have college degree and genuine interest m educational broad¬\ncasting, and background in agriculture. Duties include announcing two farm shows,\nassisting KOAC agriculture broadcast director in planning farm broadcasts,\nduties include a routine announcing and newsschedule. Opportunity, it desiica,\nto work on music and dramatic programs. Starting salary >2/35. Applicant should\nsend statement of experience, photo, and voice transcription to James Horns,\nProgram manager, KOAC, Corvallis, Oregon.\nRADTO AND THE 1950 CENSUS\nOne vital miestion the 1950 oen3U£_gtud3r^ca^^sw«lJj_&3.^ta\nAll. end TV n_rap.nlvara owned and used by...gJl^citizeB.s,t__^e.^rg..?S£2iLJL——\nm-numbor of'‘sources including the. Bur.oau._of. Census itself tha.t_.no. such_guostion\nis~scheduled' for\" inclusion in. the. fa^aE^Pg-£SBSaa«\nFailure, to include..such A.jM^^^riouslx, tenyg.\ntho'7e;ct\"i o-year period. It is sw^ate^\n^^cata~ ttalryi nteT in the' natter, to.\nthe Congress.,_\nUNITED NATIONS KADIO PROGRAM HELPS\nFollow-up to project begun at Ohio Institute last May by Dorothy Lewis has result¬\ned in appointment of Olive McHugh, Toledo, Ohio, radio educator to develop and\ncoordinate a new UN radio service. This weekly radio kit will include.\n1 TTcevly news summary provided direct from, radio news bureau at lake\n# Success, edited for school use and integration in local.news programs.\n2. Background sheet giving information on various UN agencies and com¬\nmissions interpreted for students and the general listener.\n3. Script for use in schools and other radio education centers.\nProgram directors who wish to be put on the mailing list for the radio ..it, a\ndetailed listing of long and shortwave offerings from Lake Success, etc., -houl\nwrite RADIO DIVISION, UNITED NATIONS, LAKE 3UCCES-., N.Y.\nBC -Nil. ACADEMY OF IEDICINE SROADCASTS\nA special series, suunlonenting *° ^££4, ...\nV^b^grii'nomber. January and February. Topics,\nand Medicine.\" ''Endocrin03--tastorg_2Omsats».\n\"Sci'cnce Under\"thTpTctetorshiPS Criminal\nin Our Lidst.”\nNEW 11 LEST US' PARGET11 ET SERIES\n\"Stories to Remember\" is the 12th in a scries of \"Lest We Forget\" programs pro¬\nduced by the Institute for Democratic Education. Thirteen platters m the n w\nseries deal with general theme of intorgroup relationships featuring sue\nartists as Geraldine Fitzgerald, Raymond Massey, Ralph Bellamy, and iverett Sloan\nUSB highly recommends this series, suggests station managers make direct con¬\ntact with the Institute for Democratic Education at 415 Lexington ..venue,\nNow York 17. N.Y.___—— -—--- “"
}