{
  "id": "d1387-26",
  "text": "fcc~ actions’7fpj^ ~ Wi versity.,. iqtItutional\nGranted Construction Permit\nHULII-Loyola University., New Orleans, La, - Granted modification of CP to change\npower from’15.3 KPT to GO KvJ; antenna from 500 ft. to 380 ft. (BMPH-240S)\nGranted License Renewal\nWSHS-Board of Education. Sewanhaka High School, Floral Park, N.Y. - Granted renewal\nof non-commercial educational FM station for the period ending September 1,1951\nGranted CP Modification\nIGJGS-Tulsa, Okla. - Granted modification of CP for extension of Completion date\nto 2-0-49. (BliPED-142)\nLicense Renewal\nKSUI- The State University of Iowa. Iowa City. Iowa - Granted renewal of license\nfor non-commercial ediicational FM station to '.eptember 1, 1950. (BpED-C)\nGranted CP For New Station\nSyracuse University. Syracuse^ JL*X. - Granted CP for new non-commercial educational\nFM station; Channel 201, 88,~1 me.; transmitter power output 2.5 watts; estimated\ncost G2,088 exclusive of stuidos and equipment already installed for radio con¬\nstruction and training. This is the first low powered less than 10 watts non¬\ncommercial educational authorization. (BPED-93).\nCP Modification\nK5PS- San Diego Unified School DistrictSan Diego. Calif_._ - Modification of\nconstruction permit (BPED-CS) which authorized a new FM broadcast station, for\nextension of completion date.\nCP Modification\nUSOU-Seton Hall College, South Orange. N.J. - Modification of construction permit\nTbI-PeF-78, as modified) which authorized a new FK broadcast non-commercial\neducational station, to change ERP from 1 to 2 KM, and make changes in antenna\nsystem.\nConstruction Permit-New\nHew-Ithaca College, Ithaca, M.f. - Construction permit for a non-commercial edu-\ncational broadcast station to be operated on 91.7 me., Channel #219, with power\nof 10 KM.\nGranted CP\nThe Regent of the University of 1 ichigan, Ann Arbor. Mich. - Granted CP for New\nstudio link broadcast station*\nGranted Temporary Extension\nl-JFUV-Fordham University, New York, N.Y. - Granted temporary extension of license\nfor non—commercial educational. FM station to December 1, 194$, pending receipt\nof application for renewal*"
}