{
  "id": "d1387-6",
  "text": "FREDERIC HAYWARD RESIGNS\nFrederic Hayward, manager of* KWSC, NAEB outlet at Washington State College, ^re¬\nsigned his position early in October, Hayward is widely known in the Pacific\nNorthwest and recognized throughout the country as one of the most progressive and\nable educational station directors, A widely experienced radioman, Hayward came\nto KWSC in 1946 and brought the station from comparative obscurity into a national\n'prominence with training, public relations, programming, end engineering. He has\nmade no announcement of future plans.\nWNYC PROVIDES C0I PL5TE COVERAGE OF PARIS UN MCETING\nin Paris 7 The general sessions as well as important sub-cpmriMQQ-igp^4l^^MoJb£\"‘\ning, carried in their entirety whenever scheduled._WNYC broadc8,st the sessionS-ViO:\nthe c ontinuous circuit_ linking the United Nations. .J^GpdQuar\nth^ParTs ErocoedingLSj.. through an arrangement with, RCA and NBC._„Dinging, .this\n-period,\" TJNYCWs regularly s^hedialed local urograms were aired,, over,. iO£L~IL•\nUP I-FI; CONSTRUCTION PROCEEDS AT IONA STATE CPU DUPLICATION\nStation WOI, NAEB outlet at Iowa State College, is proceeding rapidly with con¬\nstruction of new FT facilities, and plans to be on the air with a complete schedule\nof programs sometime after the first of the year, WOI-Fh will broadcast on Channel\n211 with an ERP of 15,600 watts using a supporting towor 520 feet high.\nEngineering calculations indicate rural coverage area for the FIX outlet will be\n12,500 square mil-s embracing a population of 600,347, W0I-FN program plans\ncall for a broadcast schedule completely independent oi the WOI schedule. Officials\nfoel special programming, not otherwise obtainable, will be greater motivation in\nFM set\" purchase. The 11 Iowa Radio Audience Survey” indicated in.1 larch, 1948 that\nbetween\"? and 8 percent of Iowa radio homes are FI-equipped. Figure currently is\nthought to bo much larger with 24 FI. stations now on the air or soon to bo on the\nair.\nWOI—FI I construction elans embrace a throe—cart,, .plan.,_noTfj iya^sn^ttor_ I^use^s\nbeing construe tod J miles from present studio site, The.Jf;^^suoporting^ structure,\n520 feet in heir,lit is also.designed to serve as the AN antenna.andJ:he_^upporUng\nstructure*for TV. Studio-transmitter connection will,bo by radio relay link.\nStation will bo Collins-OQUiowcd throughout with exception,of..G^^rcOJIectric\nradio \"link. International Towor and Derrick Company is constructing the new tower.\nILIIN0IS BET.I TEIEPEOKE COKPAFY PREDICTS CROSS COUNTRY TVJIgT\nIllinois Bell Tolephono Company says a TV network, made up of channels in 1 cities,\nconnecting Chicago, St. Louis, Nilwaukoo, Toledo, Detroit, Cleveland, Buffalo,\nand Now York will bo in operation by Decomber. Part of the link is now connected.\nTV shows will bo sont by coaxial cable throughout the system except for tho\nTolcdo-Detroit leg and tho Chicago-Milwaukoc log where transmission will be by\nradio relay."
}