{
  "id": "d1729-2",
  "text": "and will probably be used by other USIS posts for seminars\nand conferences. Poems in English has been adapted for VO A\nbroadcast to Russia and will be used in teachers’ conferences\nin Belgrade and Manila.\nTEMP's Microwave Dish Stolen\nEarly in December a burglar stole one of the Texas Educa¬\ntional Microwave Project’s microwave receiving dishes from\nthe Hildebrand Water Tower in San Antonio. With a quick\nreplacement, there was no interruption in TV service, but\nTEMP personnel have been speculating on uses to which the\n4-foot diameter, 8-inch deep antenna might have been put.\nAmong the possibilities named were a garden fish pool, a\nholiday wassail bowl, and a chicken brooder.\nNews Notes\nPERSONNEL\n^ C. H. Logan has been named director of educational broad¬\ncasting, a new post at North Dakota State University. He will\nserve as NDSU coordinator in the development of a joint\nETV station with the University of North Dakota. Logan,\nformerly program associate and production manager of\nWMVS/WMVT, Milwaukee, is also an assistant professor\nof communications.\n^ Leonard Furman has joined the staff of WTTW, Chicago,\nas assistant to the director of development. Formerly he was\ndirector of publications for the Northwestern University\nTransportation Center.\n^ Richard J. Meyer has been appointed TV consultant and\nTV project director to the Great Neck (N.Y.) Public Schools.\n^ Lee Dreyfus, associate director of TV, University of Wis¬\nconsin, was elected chairman of the radio-TV-film section of\nthe Speech Association of America at its convention in Chi¬\ncago December 27-30.\n^ Robert W. Fox has resigned as instructional coordinator\nfor KLRN-TV, central Texas, to become TV curriculum di¬\nrector of Delaware’s new CCTV network. The three-channel\nETV installation will connect every elementary, secondary,\nand higher educational institution in the state and is scheduled\nto begin programing in September.\n^ Bruce Beale, production manager of Philadelphia’s WHYY-\nTV and WUHY-TV since 1962, has been named progrlam\ndirector, replacing John Twaddle, who resigned to direct a\nseries for WETA-TV, Washington.\n^ Dr. Dale Groom, associate professor of medicine at South\nCarolina’s medical college and a pioneer in medical post¬\ngraduate education by TV, has been appointed to the 10-man\nCouncil of Postgraduate Programs of the American Medical\nAssociation. In announcing the appointment, an AMA offi¬\ncial said it was made on the basis of his ETV pioneering\nwork.\n^ KFME, Fargo, N. D., has hired a new staff engineer,\nDonald J. Geiken, an audio specialist. He has his own record¬\ning business and was formerly with KVOX radio station as\nchief engineer.\n^ Rodney G. Thole, producer-director at WMVS, Milwau¬\nkee, has been named production supervisor, replacing C. H.\nLogan, who has accepted a position as director of educational\nbroadcasting at North Dakota State University.\n^ WMVS has hired Frank Strenad as producer-director. He\ncame from the CBS affiliate in Peoria, WMBD, where he\nwas a director-producer and production coordinator. In 1961-\n62 he was a director for CCTV at Michigan State University.\nGENERAL\n^ The University of Texas has announced that it will have\ngraduate internships for TV production in the coming academic\nyear. Stipends will be $2500 for twelve months.\nNAEB Headquarters: 1346 Connecticut Ave., N.W., Wash¬\nington, D.C., 20036. Phone 667-6000. Area Code 202. TWX 202-\n965-0299.\n^ WHA-TV, University of Wisconsin, production totals\nhave been on the rise for three months. December saw 83 pro¬\nductions completed in 20 working days, with several new\nseries beginning.\ny The New York City schools anticipate beginning broad¬\ncasts on their own UHF outlet by the fall of 1965. Initial pro¬\ngrams will be for classrooms and for teacher in-service train¬\ning. Later there are to be programs for the general public.\n^ Washington State University broadcasting students are\ninterviewing off-campus authorities via long-distance tele¬\nphone. The sessions are being taped for use in other classes.\n^ The newest link in the Wisconsin State Radio Council’s\nchain of noncommercial FM stations is WHMD, which began\noperating in December and takes the full service to the north¬\neastern section of the state.\n^ RCA announces a supply of used TV tape recorders avail¬\nable at bargain prices. Write RCA Educational TV News, 15-\n5, Camden, New Jersey, for information.\n^ WMSB, Michigan State University, has changed its sched¬\nule in its shared-time arrangement with WILX-TV for Chan¬\nnel 10. New evening hours and extended Sunday service are\nintended to increase the availability of educational programs\nto a family audience.\n^ The music department of Teachers College, Columbia Uni¬\nversity is conducting two research projects—one exploring the\npossibilities of using electronic devices in teaching and devel¬\noping musical performance, and the other studying what kind\nof conducting techniques can be demonstrated effectively by\nmeans of 8mm film.\ny Washington State University’s transcription service to 80\nradio stations in the northwest has been extended to TV, with\n7 TV stations broadcasting Mosaic, a program about univer¬\nsity research, teaching, student life.\n^ WHIQ are the call letters assigned to the Alabama ETV\nnetwork’s Huntsville station, scheduled for construction dur¬\ning 1965.\n^ University of Michigan journalism professor Dean C.\nBaker, who has been studying 191 daily newspapers from all\n50 states for their coverage of the Kennedy assassination, has\nconcluded that newspaper performance deserves far more\npraise than dispraise. He also reports evidence that, even with\nTV and radio giving the tragic event intensive and immediate\ncoverage, “newspapers were in great demand.”\nANNIVERSARIES\n10th—Alabama ETV network, January 3.\n10th—WUNC-TV, University of North Carolina, January 8.\n7th—KUED, University of Utah, January 20.\n2nd—WOUB-TV, Ohio University, January 4.\nPublications\n• NASA has released a revised catalog of Radio-Television\nProduction Aids, available for free loan to educational TV\nand radio stations, closed-circuit systems, and commercial\nbroadcasters. The catalog describes film clips, slides, photos,\nand audio tapes related to space exploration and aeronautics.\nCopies of NASA’s current free film and publications lists are\nalso available to TV-radio producers and teachers. Write Na¬\ntional Aeronautics and Space Administration, Television-Radio\nProgram, Code AFEE-4, Washington, D.C. 20546.\n• Arpad Bogsch’s The Law of Copyright Under the Uni¬\nversal Copyright Convention, 1964 edition, which makes a de¬\ntailed analysis of international copyright laws as they affect\neach of the 46 member countries of the Universal Copyright\nConvention of 1952, is available for $21 from R. R. Bowker\nCompany, which also offers for $3 A Copyright Guide by\ntwo prominent lawyers who give answers to “the 93 most-\nasked questions on copyright law and procedure” plus a brief\nbibliography of copyright treatises. Write 1180 Avenue of the\nAmericas, New York 36, N. Y.\n• Copies of the address, “And Now, A Message to the\nSponsor,” delivered by Newton Minow at the annual Alfred\nFEBRUARY, 1965\n3"
}