{
  "id": "d1404-13",
  "text": "-7-\nindefinitely. The general public will surely become satiated in time with the ex¬\ntravagant and exaggeratedclaims made for the very ordinary things that are now being\nsold through broadcasts so extensively at this time.\n\"I think it most unquestionably desirable that our educational stations avoid all\ncommercial entanglements with other stations. In almost no cases could there be any\nassurance of reasonable permanence in any such agreement. When any change comes the\neducational side will be the first one to suffer.\nMAt this time and under present circumstances, we may well look with suspicion upon\nthe so-called educational urograms of the large broadcasters. If the time should come\nthat these are not directly profitable and if there should be no more privileges that\ncan be stolen from the school-owned stations, I believe it certain that all progrars\nof this nature would disappear. Why should commercial broadcasters be expected to\nconduct schools of the air, unless they had some special object to attain by doing\nso, any more then storekeepers or manufacturers or bond salesmen?\nwIt is mv opinion that all school-owned stations should remain purely educational and\nstrictly non-commercial, if they can possibly do so; and further I think it desirable\nand imperative that every real educational station try to keep whatever license pri¬\nvileges it now has without regard to how many may be forced out of existence. As\nlong as there is a single school-owned educational station, it has a moral or ethical\nright to a certain amount of the broadcasting privileges, and I think there are those\nwho can get this fact before a public that will grant a hearing, even if most of the\nbroadcast stations should come under a monopolistic control that will censor anything\nnot pleasing to the owners of the big stations.”\nTWO LETTERS OF FEBRUARY 23 FROM DR. B. B. BRACKETT, UNIVERSITY OF S0IT7F DAKOTA, ARE\n.AS FOLLOWSj (l) ”0f course, if the commercial stations take music from the ballroom\nor a cafe and broadcast it, it makes a most wonderful program. if they braodcast the\nmost terrible kind of squeals and squawks - the most jazzy of jazz - it is fine,\nelevating and educating. If they present a mediocre vaudeville affair, it is one of\nthose things that give the imierican type of broadcasting its wonderful 'salesmanship.*\nNothing so fine and so wonderful has ever been produced anywhere in the history of the\nworld before* It would seem that the Federal Radio Commission agrees to all the above*\n'’However,.if any of our group should put on programs like the above, we would be\nbroadcasting the most unsatisfactory programs possible. If we should even approach\nsome of the methods used by the commercial broadcasters, it would be most dishonest\nfor us.\n”The claims made by the commercial broadcasters for their own programs are most\nabsurd and most ridiculous. The charges against and the criticisms of programs\nput on by stations outside their own group are disgusting, unfair and untrue.\nTo me, the most unethical and unfair thing the commercial groups and big chains are\ndoing just now is *The Spider and the Fly* act of pretending a very great interest in\neducational programs. There is not the slightest doubt in my mind that if the com¬\nmercial stations once get full control of all broadcasting privileges, it will not be\nlong before rone of their so-called educational programs will be presented unless\npaid for at full commercial rates. What is the fundamental purpose of a commercial\nbroadcasting company? To make money like any other commercial organization.\nWhat is the fundamental purpose of any school-owned broadcasting organization? To\neducate as many persons as possible and to disseminate as much accurate and reliable\ninformation as it can. The educational stations are not interested in selling cheap\nmedicines and ordinary tobacco products at high prices to a gullible public. We\ncannot possibly have any interest in misinformation and exaggeration that is so pre¬\nvalent in the commercial broadcasts.”"
}