{
  "id": "d1404-3",
  "text": "ARTICLE VII,\n■Amendments t\nThis constitution may be amended by a two-thirds vote of the active membership.\nNotice of any proposed amendment shall be submitted to the membership at least\nthirty days prior to the date of voting*\n#\nWHAT EDUCATIONAL STATIONS ARE DOING\nB* B* Brackett, Director of KUSD, University of South Dakota, writes:\n\"KUSD is just moving its main studio to a room on the fourth floor of the\nStudents Union Building of the University of South Dakota, The room is approximate¬\nly 35 by 51 feet and has walls and ceiling well finished with \"Celotex\" board,\nmaking its acoustic properties very excellent. It is probable that the roan will\nbe separated into twe rooms by a movable partition that will divide the large room\ninte rooms that will be one-third and two-thirds the size of the original room or\nallow the whole space to be used as one room when the partition is moved back. This\nwill make available three studios of relative sizes one, two, and three, though not\nmore than the two smaller ones can be used at the same time. The plan, however,\nwill give KUSD the first really good studios it has ever had, and we believe will\ngreatly improve the quality of our broadcasts.\n\"KUSD has plans under way whereby it is proposed to broadcast a half hour\nsample program each week over commercial station MAX of Yankton, South Dakota,\nYankton is thirty miles up the Missouri from Vermillion. WNAX expects to be\noperating soon with five kilowatts power and very fine equipment in every respect.\nIts new vertical antenna will be among the three highest in existence, and all parts\nof the transmitting apparatus will correspond.\nnWe expect to have the one-half hour per week without charge under the condition\nthat w© take our artists and speakers to the WNAX studios at Yankton, We understand\nthat our only expense for the programs will be the transportation by auto of our\npeople to Yankton and return,\n\"WNAX is affiliated with the Columbia Broadcasting System, and uses Columbia\nprograms during part of each day; but is willing to take this stated amount of the\nKUSD programs. \"\n#\nFrom KW5C we learn that fire destroyed a great deal of equipment on July 27,\nThe station is baok in the air with a full schedule however and daytime power was\nincreased from 2000 to 5000 watts. Director Nalder hopes to establish complete\nnew studios and offices in the near future*\nJos* F. Wright, Director of WILL, University of Illinois, sayss\n\"The most unusual program we have had this fall was the broadcasting of a\nchimes and organ concert, the pick up being from three different places. Our"
}