{
  "id": "d1404-6",
  "text": "program of study and listen to the radio broadcast* On Tuesdays in between they\nlisten t© the book reviews covering at least three carefully chosen books, A\ntrained librarian selects the books and prepares the reviews,”\n#\nWe hear from H. A. Engel, WHA, University of Wisconsin, Madison, as follows:\nH. B, (Mao) McCarty is still in England, Latest reports are that he is haw\ning an interesting experience. He is expected back in November, The next news\nletter, whioh will be sent out from Wisconsin in December, will have a report on\nhis investigation,\nWHA is broadoasting all the Wisconsin football games direct from the field.\nBy arrangement with WTMJ and the sponsor for the away-from-home games, WHA is able\nto take the report of the play, and cut out the advertising portion, thus making\nit non-oommeroial. The station pays nothing and receives nothing for the service.\nThe sponsor pays the wire toll from Milwaukee to Madison, as well as from the\nfield to Milwaukee,\nWHA now offers 23 broadcasts each week for schools through the Wisconsin\nSchool of the Air and the Wisconsin College of the Air. They range in level from\nKindergarten through high school. ^\nAt W5UI, the State University of Iowa, the fall program is now in full swing,\noccupying twelve hours daily.\nFive courses are broadcast regularly from the classroom - Classical Music,\nAdvanced Educational Psychology, Shakespeare, Goethe’s Faust, Business Organization,\nand General Astronomy - and four courses are broadcast from the studio - Elementary\nSpanish, Elementary German, Elementary French, and Fields of Psychology. The Speech\nClinic of the Air, Radio Adds for High Schools - including Events of the Week, Vo¬\ncational Guidance, The School Orchestra, Vocal Music, and High School Problems -\nthe Radio Child Study Club, and Radio’s Message to the Federated Clubs and to the\nIowa Congress of Parents and Teachers are continued this year. Great Speeches in\nAmerican History, Early American Plays, and a Forensio Forum are contributions of\nthe Department of Speech, Other features include: University News, Fine Arts\nNews, Educational News, Science News, The Book Shelf, Illustrated Musical Chats,\nPopular Ballads, Stories out of Iowa’s Fast, Social Work To-day, The Negr© in Lit¬\nerature, History in Review, and Citizen’s Forum.\nNew equipment at WSUI includes two W. E. non-directional dynamic microphones,\nas well as new lapel and velocity microphones for classroom broadcasts. WSUI is\nacting as key station for several statewide chain broadcasts.\nFOR YOUR INFORMATION\nA copy of the results of a Survey of the Kansas Radio Audience made by radifj\nstation KSAC has been received which is one of the most interesting papers to be\nbrought to our attention. The survey is too lengthy to publish in this bulletin,\nbut possibly copies may be obtained by writing to station KSAC. Some of -the topics\ndiscussed are Extent of Listening; Listening Hours; Type of Listening; Station\nPreferences; Program Preferences; (news broadcasts lead by a wide margin) Extent"
}