{
  "id": "d808-27",
  "text": "Dr. Ifeurioe F* Secy, Page 2* January 21, I960\nas3enoo asked to give up our Fatworl: (to the Center), and nay have to, since\nthey could squeeze uo out with the huge funds at their disposal (for protons\nwhich they could distribute for for less than we must choree* end of higher\ntechnical quality)* The plum which can be hold out to our Network members\nfor a better service than wo are now funded to provide is a powerful factor*\nBesides our resistance to Giving up a Follow-financed creation to a Ford-\ncreated complex, we have a more carious concern? we don't think United States\nEducation should bo shaped too much by a Ford-dooioned pattom (Airborne, con¬\ntinental classroom, tlx* Center, ©to*)* Ub have several reservations aTxut this*\nOmt it's bed for ccmmities to say \"let Ford do it,\" and the local tax-roots\nsupport for education dry up, instead of being developed* Second? local sta¬\ntion development is greatly hampered by this* Duluth plans far an educational\nT7 station, well along, have now been dropped, thanks to tlso \"dram** of Airborne\nT7. And I fbur \"education* from a single finance-base, in this case, the Foun¬\ndation, \"steers*, picks staff and determines direction more then I fool justi¬\nfied t via selection of White as President, etc*, etc.\nIn the complex also Is John Ivey (whom I lilt©) and the Learning Resources Insti¬\ntute*\nAs I stated in my first note to the Board, in my now role as President, *X don't\npropose to preside over the liquidation — ♦* Uhat we have 1s crest loyalties,\na sound Grass roots base in education itself, the confidence of most professional\nassociations, the Office of Education, etc* But we don't have money* That's now\nwhat we'ro working cm*\nAt a time when wo were invited in by lord for a conference (far announcement of\nconsolidation* TS.?l to the Center} funds to the Center for Radio network, etc*)\nif Harley end I hed willingly end promptly given up our Network, I think we could\nhave Gotten a million or two. TTcw, because of our (\"stupid\"?) foot-dragging, ®*d\n\"Independent* attitude 1 fear there's no more money likely from them* This is\npart of the background*\nAfter reading the fine Kellogg Report cm Continuation Context* (and it was a mar¬\nvelous report of a moat significant Kellogg contribution to United States Edu¬\ncation) I was tempted to write you, proposing that Kellogg consider a grant for\na national Center building far uo in Washington, in which would be housed our\nLegal, Research, Teacher Development, Professional Standards, Engineering, Publi¬\ncations, and other service departments* ifrankly, I didn't hove the nerve, in\nview of all you've already done for us. But ti ls is what we need? capital, plus\nan endowment so wo are not always fighting for survival*\nBut the attitude of so manythat ET7 (and even radio, for which Ford has vir¬\ntually no interest, except as it relates to the Center) is card's field, arid\nthey don* t want any peart of it. Tho danger of being swallowed up in later Foard\ncreations, as our ’Totwork now ia in danger of being, doesn't moke it oasy* It\nis only our ethics or stubborn convictions about United States Education which\nhave prevented our rotting lots of Ford money, I believe* But that's a tough\none to explain to someone we don't know as wo 11 as we know you*"
}