{
  "id": "d808-55",
  "text": "D.• Harry J. Gkornia\nPage 2\n6. So so conduct the affairs of the BAKB that its stature\nand leadership shall continue to grow, in importance,\nquality and respect, enabling this association to con¬\ntinue its contributions to education in our society.\n\\*e understand from your proposal submitted to us last October that you\nare seeking additional support from this Foundation in order to continue\nthe program 'which has been under way during the past three years and which\nhas had as its objectives the items listed above.\nIn your propoe,al you submitted two budgets - one which was labeled ’’Request\nHb. 1, Minimum Budget, and .another labeled ’’Request Ho. 2.\" This second\nbudget contained for each item a Vidnimum” and an ’’optimum” figure. I am\npleased to report to you that our Board of Trustees has acted favorably upon\nthe recommendation that another commitment be made to your organization.\n^ditional commitment, based upon the minimum budget cf Request Ho. 2,\nwith the item International Relations ($5,000)” omitted and with a reduc¬\ntion oi ^0.00in the item '.administrative Expense,” involves an annual\nbudget oi $55,965*00* We understand that you expect to receive from other\nsources tor use in this budget $9,165.00 for the year 1959-60, $1$, 165.00\n:or the/^xr 1960-01, and $29,165.00 for the year 1961-62. Your request\nFoundation, therefore, is for $^,80Q for 1959-60,\n10r ^960-61, and $^6,800 for I96I-62, or a total of $110,400 for\nthe three-year period. *\nIhe commitment which we made to your organization in February of 1956 for\na three-year program ends on June 30, 1959 and we understand that it is\nagreeable with you to begin this new program on July 1, 1959 and that the\nt iscal year or the new program will be from July 1st to June 30th.\nIf the terms listed below are acceptable to your Association, this Founda¬\ntion -ill make available to your association $110,400 as a three-year\ncocsaitment for the conduct of this proposed program:\n1. The lunds for this project shall be accounted for in a special\naccount -.hick will be set up in the business office of the\nAssociation and at the close of each fiscal year an official\nfinancial statement, certified to by the Association*schief\ndisbursing officer, will be submitted to the Foundation. This\nfinancial report will show the income and disbursements accord¬\ning to the items of the approved budget and will clearly indicate\nthe amount of cash balance, if any, on hand at the end of the fiscal\nAt the close of each fiscal year a written program report will be\nsubmitted to the Foundation concerning the activities and develop¬\nments that have occurred. *\n2."
}