{
  "id": "d808-78",
  "text": "March 12, 1959\nMr. Horace B. Powell\nPublications Director\nW. K. Kellogg Foundation\n250 Champion Street\nBattle Creek, Michigan\nDear Mr. Powelli\nSince you and I worked together last spring. Dr. Skornia has asked me to\nreply to your letter of March 5*\nWe are extremely pleased that the NAEB will be featured in the Education\nDivision’s chapter of the 1959 Annual Report of the W. K. Kellogg Foundation,\nand we will do everything possible to cooperate with you on this matter.\nAs you will recall from our conversations last year, the support of the\nFoundation has been vital to the operation of the NAEB Headquarters for the\npast eight years, and has made possible a tremendous growth and development\nin the field of educational broadcasting. Likewise, Foundation support made\npossible the establishment of the NAEB Radio Network, which is now self-\nsupporting. So far as specific projects supported by Foundation funds are\nconcerned, about all the information I can give you in addition to that given\nyou last spring is that we are continuing with our work and are still growing.\nThere is one major development made possible by Foundation funds which I be¬\nlieve we discussed last spring. In December, 1957 the NAEB held the first\nnational seminar devoted to an examination of research in the field of edu¬\ncational broadcasting, underwritten substantially by Foundation funds. The\nreport of this seminar has Just recently been completed and I am enclosing\na copy of it for your perusal. I believe you will find some information\ntherein that will be worth reporting in your Annual Report. The seminar\nwas well received and the report of it was reprinted almost in its entirety\nir the latest issue of Audio-Visual Communications Review.\nI am also enclosing a copy of our annual report for 1957-58 to the Foundation\nfor your information. This report covers the highlights of the preceeding\nyear and devotes considerable space to a discussion of the Research Seminar."
}