{
  "id": "d808-80",
  "text": "W. K. KELLOGG FOUNDATION\n250 CHAMPION STREET\nBATTLE CREEK, MICHIGAN\nHORACE B. POWELL March 5j 1959 PHONE WO S-8II8\nPUBLICATIONS DIRECTOR\nDr. Harry J. Skornia\nExecutive Director\nNational Association of Educational Broadcasters\n14 Gregory Hall\nUniversity of Illinois\nUrbana, Illinois\nDear Dr. Skornia:\nLast spring I made a trip to the Illinois Campus for the purpose\nof observing the headquarter activities of NAEB and, in your absence,\nreceived real aid and courteous treatment from Mr. Hill and others\nof your staff. At that time we were able to obtain much information\n(as well as several pictures) which we planned to use in a \"featurette\"\nto be carried in the 1958 Annual Report of the Foundation.\nUnfortunately, several featurettes had to be dropped from the final\nmanuscript of that particular Report because of lack of space and\nwe, therefore, did not run a NAEB story in the 1958 Report. Now,\nhowever, we definitely plan to run the story of NAEB as the only\nfeaturette in the Educational Division’s chapter of the 1959 Annual\nReport. This letter, therefore, is again to ask your help in the\nfollowing:\n1. Would it be possible for you or Mr. Hill to sketch for us the\nhighlights of the year which has intervened since I visited your\nheadquarters? This, of course, would bring my information up-to-\ndate on your activities, particularly those activities which have\nbeen aided by Foundation funds.\n2. One of the illustrations projected for the NAEB story was a\ndrawing or pictogram which, as I recall it, showed a radio broad¬\ncasting tower emanating sparks which carried the reader's eyes to\nsymbols of the various services extended by NAEB. One of the young\nladies in your organization sent the rough sketch of this pictogram\nto me and I later returned it with a suggestion or two for its\nrefinement. I would hope that this sketch could now be located and\nsent to us for likely illustrative use in the aforementioned featurette.\nWe have a May 1 date with the Foundation's Publications Committee\nfor review of much of the manuscript to go in the Annual Report and,\ntherefore, could use items 1 and 2 above as soon as you conveniently\ncan get them to us."
}