{
  "id": "d808-87",
  "text": "May 12, 1959\nDr. Maurice F. Seay, Director\nDivision of Education\nW. K. Kellogg Foundation\n250 Champion Street\nBattle Creek, Michigan\nDear Maurice:\nYou will recall that we have discussed the fact that our Associate Director\nand 1 have University faculty contracts which cover the period September 1,\n1958 to August 31, 1959, and that this will pose a special problem in rela¬\ntion to our new grant which begins July 1, 1959.\nSince the new grant is being made direct to the NAEB, rather than to the\nUniversity of Illinois, some arrangements will need to be made in order\nto permit Mr. Hill and me to complete our contract commitments to the Uni¬\nversity and to enable Mr. Hill to complete the tenth full year of employ¬\nment with the University, which is a pre-requisite to qualifying for retire¬\nment benefits ♦ This would mean that we two (but no other members of the\nstaff) would continue to * 'work for the University* * until August 31, 1959,\nand we would change over to the new budget (and be paid by the NAEB\nTreasurer rather than the University) beginning September 1, 1959.\nIt is probable that we will have a balance In our W. K. Kellogg Foundation\ngrant at the University, as of July 1, 1959, sufficient to pay our salaries\nfor July and August, in view of the fact that a sum of $4,100 was added to\nthe current year's operating grant by the Foundation at the time the check\nwas forwarded and is being held as a \"contingency item\" and is not in¬\ncluded in our regular operating budget for 1958-59. The funds needed to\npay the salaries for Mr. Hill and me for July and August are indicated\nbelow:\nSalary, Executive Director (2 months)\nSalary, Associate Director (2 months)\n$2,000.00\n1,533.34\nRetirement Benefits (8 .477%)\nWorkmen's Compensation (1%)\n299.52\n35.33\nTotal for July and August\n$3,868.19\nWe, therefore, request permission to use funds remaining from our current\nKellogg grant as of June 30, 1959, in the amount of $3,868.19, to pay the"
}