{
  "id": "d1141-2",
  "text": "NAE8 NEWS LETTER\nPage 3\nNovember I, 1942\nWOSU COURSES A\"£ ANNOUNCED (cont’o)\nOVER WOSU.\nFifteen-minute programs to be broadcast once a week for primary\nGRADES INCLUDE \"KINDERGARTEN Fun\", \"MUSIC TlME , STORY T|ME ,\nand \"Play Tjme.\" Broadcasts for intermediate grades include\n\"Boys and Girls of Booklano\", \"Science Club of the Air\", \"Time\nfor Music\", and \"News Review.\" Scheduled foe intermediate and\njunior high use is an historical series entitled \"What Used to\nBe,\"\n\"FOUR FREEDOMS\" ON WNVC-QUEENS COLLEGE, SJ^LI^S\nInternationally famous names stud the guest list of \"The Four\nFreedoms\", new radio series by Q,ueens College, heard over\nStation WNYC from 10:00 to 10:30 A.M. on Saturdays beginning\nOctober 10. The programs were planned by the Committee on\nRadio Education of Queens College in conjunction vmth the\nMunicipal Broadcasting System. Professor Henry Miller of the\nCollege heads the Committee.\nThe broadcasts are developing the theme of President Roosevelt s\n\"Four Freedoms\" as they are expressed in the literature of the\nFOUR LEADING UNITED NATIONS, THE UNITED -TATES, GREAT BRITAIN,\nRussia and China.\nWNYC BROADCASTS FRICK COLLECTION CONCERTS\nContinuing its policy of broaocastino the best in music for\nNew York’s citizens, WNYC, New York City's Own Station, is\nBROADCASTING THE FRICK COLLECTION CHAMBER MUSIC CONCERTS FOR\nTHE FOURTH SUCCESSIVE YEAR. THE CONCERTS ARE HEARD ON ALTERNATE\nSundays.\nOne OF THE FOREMOST CHAMBER MUSIC SERIES IN THE COUNTRY, THE\nCONCERTS ARE GIVEN FREE OF CHARGE IN THE AUDITORIUM OF THE rRICK\nCollection at 71st Street and Fifth Avenue. Among those who will\nBE HEARD IN PERFORMANCES BROADCAST FROM THIS POINT ARE:\nArtur Schnabel, Gregor Piatigorsky, Webster Aitken, The Busch\nQuartet, Coolidge Quartet, Budapest Quartet ano other outstanding\nchamber music organizations.\nU.K. BROADCAST MORALE PROGFAMS OVERJjUiyAL\nThree coast-to-coast\nentire network of the\nWEEKLY M0RALE-BU\\LOING PROGRAMS OVER THE\nMutual Broadcasting System are originating"
}