{
  "id": "d1141-3",
  "text": "NAEB NET.S LETTER\nPage 4\nNovember I, 1942\nU. K. BROADCAST MORALE PROGRAM OVER MUTUAL (Cont»o)\nIN THE STUDIOS OF THE UNIVERSITY OF KENTUCKV, LEXINGTON. THESE\nPROGRAMS* VHICH CONSTITUTE THE NETWORK *S ’’SCHOOL OF THE A|R,”\nREPRESENT THE FOURTH YEAR OF COOPERATION BETWEEN THE UNIVERSITY\nano Mutual.\nThe Tuesday series* entitled ’’Americans to the South,” furnishes\nA BACKGROUND OF THE GEOGRAPHY, HISTORY, SOCIAL AND POLITICAL LIFE,\nARTS, MUSIC, AND LITERATURE OF THE WESTERN HEMISPHERIC COUNTRIES\nTO THE SOUTH.\nOn Thursdays, the programs called \"Within America*s Gate,” takes\nTHE LISTENERS INTO THE HOME OF A TYPICAL AMERICAN FAMILY WHERE\nLISTENERS CAN OBSERVE HOW ITS MEMBERS MEET THE DAILY, CHANGING\nCONDITIONS OF LIVING WHICH COME TO A COUNTRY ENGAGED IN SUCH A V'AR\nAS THE PRESENT ONE. The WAY IN WHICH A|4;:rECA MEETS ITS orobLEMS\nDEPENDS IN GREAT PART UPON THE VALUES DEVELOPED V't THIN ITS FAMILY\nLIFE, SINCE THE STRONGEST FRONT THE UNITED STATES HAS IS ITS\nHOME FRONT.\nThe period on Saturdays is devoted to dramatized stories out of\nTHE LITERATURE OF THE UNITED NaTFONS. SOME OF THESE STORIES ARE\nFOLK LORE, SOME CLASSICS, AND SOME MODERN TALES OF THE PRESENT\nSTRUGGLE. THE GENERAL TITLE IS ’’STORIES FROM THE UNITED NATIONS.\nALLEN FILLER TO KQAC\nAllen Miller has taken over at KOAC where Luke Roberts left off\nWHEN HE MOVED TO PORTLAND TO BECOME PUBLIC SERVICE RECTOR FOR\nKOIN-KALE. Allen moved from KWSC to KOAC. At Washington State\nCollege in Pullman he held the post as Production Director, at\nKOAC he is Program Manager*. At Washington he was teaching all of\ntheir courses in radio speech. At Corvallis he is concentrating\nall his efforts on program work. Allen says that he s now a\nconfirmed Westerner. Incidentally, KOAC dedicated its new\nTRANSMITTER ON OCTOBER 16. (WE8VE MENTIONED TRANSMITTER BEFORE\nIN News Letter)., a new WE 5 kw transmitter is now in operation\nWHICH GIVES a COMPLETE COVERAGE OF OREGON ON A FREQUENCY OF 550.\nThe transmitter is located six or seven miles east of Corvallis\nat Granger, Ore*\nPA SERVICE FOR WO I AND V.'SUl\nIn messaged from Tom 0#Neil, News Editor of pa, were noted that\nV;SUI, Iowa State, and WSUI, University of Iowa, joined the news\nNETWORK ON OCTOBER 6 AND 12, RESPECTIVELY."
}