{
  "id": "d1738-0",
  "text": "February I960\ndumber 5\nSPEECH\nASSOCI ATI O N\n■ of America\nTHE WASHINGTON CONVENTION\nReport from the Chairman - James E0 Lynch, Indiana University\nBefore we move ahead to this new year, I would like to look back a bit and again thank\neveryone connected in ary' way with our Radio-Television-Film Interest Group section meet¬\nings at the Washington convention,, J. Jeffery Auer, Executive Vice-President of SAA,\nwanted me to offer congratulations to the four chairmen (Bob Summers of Southern California\nErnie Bormann of Minnesota; Bob Crawford of Queens College, and Sam Becker of Iewa) and\nthe director of local arrangements, Herb Seitz of Indiana, for their excellent work. In¬\ncidentally, attendance at all sessions was exceptional. Unofficial figures are as follows:\nThe Role of Broadcasting in Politics - 93? The Future of Mass Media Research - 65; The\nFCC's Role in Broadcasting - 185; The Selection and Training of Teachers for Television -\n45? the trip to Walter Reed Hospital - 380\nAs some of you know, the Voice of America recorded two of our meetings and they have been\ngracious enough to send me the tapes. I am slowly but surely getting them transcribed\n' in-to written form« The two sessions available will be: The Role of Broadcasting in Poll-\nancl lhg...jpC»s Role in Broadcasting. Send me a large 8x11 envelope and 8 cents in\nstamps - and you can have either one or both of them.\nflate in January, the Executive Vice-President of SAA received a rather urgent call from an\nFCC counsel asking for some sort of statement from the Speech Association to be presented\nbefore the special programming hearings of the Federal Communications Commission. With a\ndeadline in 6 days, the Executive Vice-President, J. Jeffery Auer, formed an emergency\ncommittee consisting of himself. Bob Gunderson, Vice-Chairman of Rhetoric and Public Address\nInterest Group, Herb Seitz, Advisory Committee, Radio-TV-Film Interest Group and your chair¬\nman. We labored for several days and came up with what we hoped was a representative\nstatement, (item enclosed at end of Newsletter)\nOur major task of the new year is now under way. Your Vice-Chairman, Bart Griffiths of\nMissouri, is busy making plans for the December I960 convention in St. Louis. I know he\nwill appreciate any and all help in the selection of topics, chairmen and participants.\nThis newsletter and a later one in the year will do much to fulfill another purpose of the\nGroup - an exchange of information among our some 500 members. I urge you all to keep the\nchannels open by providing a steady flow of news about research, publications, curriculum,\npersonnel, etc., to our very capable Newsletter Editor, Secretary Bob Crawford of Queens*\nCollege in New York."
}