{
  "id": "d1425-0",
  "text": "For Modification of License. )\nBY THE COMMISSION,\nBROADCAST DIVISION.\nSTATEMENT OF FACTS AND GROUNDS FOR DECISION\nThis proceeding arose upon the application of Georgia School of\nTechnology, licensee of Radio Station WGST, Atlanta, Georgia, for modification\nof license, to increase the station’s power from 500 watts, 1 kilowatt, local\nsunset, to 1 kilowatt, (its frequency of 890 kilocycles and its unlimited hours\nof operation to remain the same). The Commission was unable to determine from\nan examination of the application that the grant thereof would serve.public_\ninterest, convenience and necessity and designated the game for puolic hearing\npursuant to Secton 509 of the Communications Act of 1934, before an Examiner\nappointed by the Commission. Notice of time and place of hearing was given e\napplicant and other interested parties. Pursuant to said notice the application\nwas heard on October 14, 1935 before an Examiner who, on November 26, 1935, sub¬\nmitted his report (No. 1-145) recommending the grant of the application. There¬\nafter on January 10, 1936 the Commission issued its order granting the applica¬\ntion, conditioned on compliance with Rules 131 and 132 of the Commission’s\nRegulations, the order to become effective at 3 A.M. , Eastern Standard Time,\nMarch 3, 1936.\nThe record discloses that the Georgia School of Technology, the licensee\nof Station WGST, is an institution owned and operated by the State of Georgia.\nThe School is directly controlled by a Board of Regents of the University System\nof Georgia. The Board of Regents has designate^s^^\nPresident^of the Geor^ ’ Dr* ^SStSrMrm^tnr\nmanager he has control of the station s policies and ^ s P -- - ,\n' program material. The station is situated on the grounds of the School and\nits buildings. The licensee, the Georgia School of Tech¬\nnology, has heretofore entered into a contract with the Southern Broadcasters,\nInc., whereby the Southern Broadcasters, j becomes.the operating agency\nof the licensee. '^y^the‘‘terms of the contract, the operating ^agency provides\n\"all equipment^ pays all expenses of operation, absorbs any deficit that might"
}