{
  "id": "d265-113",
  "text": "These are not referred to in the radio programs hut they might be in the dis¬\ncussions .)\nInevitably, there is some reference in the recorded radio program to what\nJefferson regarded as a thoroughly justifiable political act, but our main concern\nhere is with the Declaration as a charter of rights. Its ideas and the ideas of\nits author, Jefferson, run like threads through the whole of American history and\ngive that history its most distinctive meaning. This is well illustrated by the\nsaying of Lincoln, in Independence Hall, Philadelphia, on Washington's birthday\nin-l86l when he was on his way to be inaugurated as President. Lincoln said that\nhe had \"never had a feeling politically that did not spring from the sentiments\nembodied in the Declaration of Independence.\"\nNow, nearly a century later, we can find in the Declaration and in Jefferson\nthe clearest and best statement of the difference between the American political\nfaith and that of the totalitarians. We can best find what \"Americanism\" really\nis by looking at its historic source. But along with this thought goes another\nand equally important one: these sentiments and ideas must be applied by each age\nfor itself. This truth is embodied in Jefferson's great saying: \"The earth be¬\nlongs always to the living generation.\"\nIn 1776 the central idea in the Declaration, to most people, was that of\npolitical independence, and Jefferson himself appears here as a promoter of re¬\nbellion against the British King. To him this King, and any king, was a symbol of\ntyranny; and his personal motto was \"Rebellion to tyrants is obedience to God.\"\nIn our own time the external form of despotism has changed. The question of re¬\nvolt against tyranny in any age is developed more fully in the program, \"The\nDemocrat and the Commissar.\" (important themes appear in more than one program,\nand the first program in particular partakes of the nature of an orchestral over¬\nture.) The series, like the history of the American Republic, begins with the\nidea that grave dangers have to be faced boldly and that intolerable ills have to\nbe resisted. Nothing was more characteristic of Jefferson than his preference for\nthe dangers of liberty to the peace of servitude; and we can perceive a sharp con-\n17"
}