{
  "id": "d265-122",
  "text": "this is from his first inaugural address.\nArgument\nNo American, except possibly Benjamin Franklin, illustrates so well as\nJefferson the scientific enthusiasm of the Eighteenth Century, and he stands in\nhistory as a major prophet of the scientific progress of the last century and a\nhnif which has been the glory of western civilization. He had supreme faith that\nhuman intelligence could unfold the physical secrets of the Universe and enable\nman to master Nature - if that intelligence could be fully liberated. Here is\none of the best clues to his lifelong struggle for freedom. By force of circum¬\nstances he had to spend most of his life trying to gain and maintain political\nliberty; but at m1 times he sought to remove from the human mind the fetters of\nignorance, superstition, and prejudice.\nThe radio script suggests his own scientific interests and achievements,\nwhich are fascinating in themselves and which are characteristically American in\ntheir emphasis on utility. The controversy with Buffon, which has many amusing\naspects, reveals him as an intensely patriotic American who defended the New World\nagainst the aspersions of the Old; but it also reveals him as one who deplored in¬\naccuracy and error and sought scientific truth in all fields. His defense of the\nAmerican Indians is specially significant. Not only did he resent the careless\ncomments on the aborigines based on hearsay evidence; he also resented these re¬\nflections on human nature. His faith in man extended to backward and undeveloped\npeoples.\nMuch of the criticism of Jefferson as a man of science in his own day arose\nfrom political opposition to him. The radio script suggests this, but it also sug¬\ngests that a prophetic scientist might be expected to arouse hostility on other\ngrounds. Science had not yet justified itself by its fruits to the extent that it\ndid afterwards, and many good people regarded the spirit of free inquiry as irre¬\nligious. Jefferson was an object of suspicion because he wanted to carry it into\nevery aspect of life, thought, and learning."
}