{
  "id": "d265-129",
  "text": "and caprices of their customers. Cajoling and catering to thfe public, in the spirit\nof modem advertising, would not have been a congenial task to a man of his spirit¬\nual independence. His early objections to manufacturing did not arise from his ob¬\njections to such processes, for actually he carried on much home manufacturing at\nMonticello. He was fearful, nonetheless, of the industrial revolution because of\nwhat it would do to the people engaged in it; he feared that it would enslave the\nworkers and at the outset it certainly did. But long before the end of his life he\naccepted American manufacturing as inevitable, and he arrived at last at the idea\nof a balanced economy. Most important of all was his assertion in the final words\nof the radio script that no axiom can be laid down for all time in such a compli¬\ncated science as economics. His own thought, as brought out in most of the present\nprogram, may seem to have more direct bearing on the problems of the undeveloped\nregions of the world, where the economy is still predominantly agricultural, than\nupon the highly industrialized and urbanized society of the United States today.\nBut it is exceedingly important in that connection, and his insistence that economic\ninstitutions, like everything else, must be judged by their value to human beings\nis appropriate in any society in any generation. Institutions change, as they must,\nbut the rights of man are everlasting.\nQuestions and Topics for Discussion\n1. What evils did Jefferson seek to correct by his land reforms in Virginia? What\nremedies did he propose?\n2. What were the chief differences between the land situation in France and in\nAmerica as he observed it? Were the remedies he suggested in the two places\ndifferent?\n3- What remedies do you think he would recommend for land reform in present-day\nIndia and China? How would they compare with Communist proposals?\n4. Which present land policies would you say are closer to the Jeffersonian ideal,\nthose of India or China?\n5- Do you think that equal distribution of land would solve the economic problems\nof those countries?\n35"
}