{
  "id": "d265-131",
  "text": "Program 5\nProgram Title: \"FREEDOM OF THE PRESS\"\nRecord Title: \"FREEDOM OF THE PRESS\"\nHistorical Background\nThere is little that is unhistorical in Jefferson's monologue except in the\nimaginary circumstances under which he speaks it. Nearly everything he says in\nit is taken from his own words as they remain on record. The strongest expres¬\nsions of his about freedom of' discussion come from his years in France, where the\ngovernment was autocratic in form, though in practice it was far less repressive\nof critical opinion than modern totalitarian states. The greatest danger in the\nUnited States came during what has been called the American Reign of Terror. It\nwas then that the Alien and Sedition Acts were passed (1798) and protested against\nby Jefferson and Madison in the Virginia and Kentucky Resolutions (not considered\nhere). Diplomatic relations with France had been broken off and the country was\non the verge of war. The mood was one of hysterical fear of foreign and domestic\nenemies - real or imagined - and the temper of the times has often been compared\nwith that of the early 1920's in this country and with that of our own period of\n\"cold war\".\nThe notorious Sedition Law forbade any person to \"write, print, utter, or\npublish\" - or cause or assist anybody else to \"write, print, utter, or publish ...\nfalse, scandalous and malicious writing\" against the government. Congress, or the\nPresident with \"intent to defame\" or bring them into \"contempt and disrepute.\" The\ndifficulty lay in the interpretation of these vague general terms by partisan offi¬\ncials.\nMost of the victims of the law were unattractive human beings and one of them,\nJames Thomson Callender (who figures more in a later program) was an unscrupulous\nscandal-monger. At first he was against the Federalists, but after Jefferson became\nPresident he turned against him. Most of the scandalous stories about Jefferson that\nExperimental Discussion Program Subject to Revision\n37"
}