{
  "id": "d265-135",
  "text": "There has been much less recourse to libel laws in this country than in Great\nBritain, but it is doubtful if anyone is wise enough to devise adequate legal means\nto prevent scurrilous personal attacks on public men. As Jefferson himself said,\nthe people who lap up the slander as it comes out bear a major responsibility for\nit, and as he saw, the only effective corrective of these abuses of freedom is that\nof public opinion. In our own minds a helpful distinction can be drawn between the\ndiscussion, on the one hand, of public measures and of statesmen in their public\ncapacity, and personal abuse and slander, on the other. The line may be faint at\ntimes, but there can be no doubt that the freedom of the press (and radio and tele¬\nvision) is supremely important in public rather than private matters. Personal\ndiatribe against high officers of the government may weaken its prestige at home\nand abroad, and bad manners are not a necessary accompaniment of political democ¬\nracy. On the other hand, the health of our political society is contingent on the\nfull and free discussion of all important issues. Advocates of popular causes and\nmeasures need little or no protection, but critics of these often do and there is\nno freedom of the press when critical voices are silenced - either by law or the\npressure of dominant political opinion.\nQuestions and Topics for Discussion\n1. What, in your opinion, was the fundamental reason for putting into the United\nStates Constitution, and the various state constitutions, a provision against\nabridgement of the freedom of the press?\n2. Can you see any reason why there should be any difference, in attitudes toward\nthe criticism of the officials, between a totalitarian government and our own\ngovernment?\n3. Why did Jefferson and his followers object to the Sedition Law of 1798? Did\nlack of patriotism have anything to do with it?\n4. The Sedition Law (1798) was never tested in the Supreme Court. Do you think\nthe present United States Supreme Court would judge it to be constitutional or\nunconstitutional?\n5. Can you see any similarities between the situation from which the Sedition Law"
}