{
  "id": "d265-141",
  "text": "program to center the discussion in the antithesis between tyranny and dissent and\nto apply this to political and international questions (rather than scientific or\nintellectual). This is the more appropriate because of certain striking analogies\nbetween Jefferson's age and ours. He also lived in an age when ideologies that were\nalleged to be foreign were greatly feared, and when the government had tried to co¬\nerce opinion in the name of national security. Furthermore, the attempts to sup¬\npress supposedly dangerous ideas were often motivated by political partisanship —\nas in the case of the Alien and Sedition Acts. The extreme Federalists really denied\nthe right to difference of political opinion. Because Jefferson and his followers\ndid not agree with them on certain matters of public policy they charged him with\nbeing unpatriotic — even subversive. This is an old political trick. They also\nturned on him the batteries of religious intolerance. His defense of Thomas Paine\nshows how far he would go in support of freedom of opinion, because Paine was ex¬\nceedingly unpopular in America by this time. He was sure that many people condemned\nPaine's book without having read it, and he was correct in saying that they did in¬\njustice to this writer. The point of the episode, however, is not that he himself\napproved Paine's methods or all of his doctrines.\nTne clue to Jefferson's attitude is given in the opening speech you will hear\nin the recording. He did not fear ideas, believing that \"error of opinion may be\ntolerated where reason is left free to combat it.\" He was confident that good ideas\nwould triumph in a free society because of their own merit. Coercion was quite un¬\nnecessary. Also, coercion was perilous because of the fallibility of the judgment\nof rulers. To him it was an axiom that the opinions of men did not fall within the\nprovince of government. He believed in the free competition of ideas. He regarded\ndissent as inevitable and desirable. To him \"Americanism\" comprehended a variety of\nideas, as the American nation comprises a variety of peoples. There are dangers in\nfreedom and diversity, but there are far greater dangers in coercion and uniformity.\nThus, the Jeffersonian philosophy, which he believed to be the historic American\nphilosophy, stands as the complete antithesis of that of the totalitarian state.\nIn a self-governing society, however,there is*danger of a sort of tyranny which\n48"
}