{
  "id": "d265-149",
  "text": "ism. In America the war was accompanied and followed by some economic and social\nupheaval, as is very often the case in wars. There were some domestic violence\n(for example Shay's Rebellion), but there was relatively little on the whole. A\nnumber of people, like Jefferson, hoped that there would be a closer approxima¬\ntion of equality of economic opportunity under independence; but he countenanced\nno violence in the achievement of social and economic ends, and the reforms of\nthis era were effected, not by violence, but by the orderly processes of legisla¬\ntion in a self-governing society. The chaos which so often follows wars did not\nlead to the establishment of a new form of tyranny. The Constitution followed the\nDeclaration of Independence, and George Washington became the elected President,\nnot a military dictator like Napoleon. Fortunately, no drastic changes were need¬\ned to cure the major ills of the time, and Americans were already schooled in\nself-government. This turned out to be a thoroughly constructive revolution.\nAs to the French Revolution, it started in the same way in that it was a re¬\nvolt against political tyranny. For that reason American lovers of liberty ap¬\nplauded it in its early stages. But it passed into far greater excesses, for\nreasons we cannot go into except to say that Jefferson thought it moved much too\nfast; he believed that the French people were unprepared for the same degree of\nself-government as the American. Chaos resulted and in the end Napoleon emerged\nas another kind of dictator. By that time the revolution had passed into French\nimperialsim, and in this respect it was like the later Russian Revolution, not at\nall like the American.\nThe Russian Revolution of our century can be compared with the American in\nonly its very first stages - in the original revolt against the Tsar, (in the\nradioscript, where this matter is discussed in negative terms, a false impression\nmay be given by Jefferson's comment at the top of p. 48. He would almost certain¬\nly have approved the overthrow of the old Russian tyranny.) From that time on, it\nassumed the mantle of class warfare; it looked forward to class conflict through¬\nout the world; it soon took on the form of a new tyranny; and it is now in the\nimperialistic stage. The Communists have created the most formidable tyranny and\n57"
}