{
  "id": "d265-16",
  "text": "FROM:\nTHE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n2500 Municipal Building New York 7, N. Y.\nFOR RELEASE: JULY 28th, 1952\nThe principles and ideas of Thomas Jefferson as applied throughout\nthe course of American history are to be depicted in a series of radio\nprograms on \"The Jeffersonian Heritage\", that soon will be presented\nunder the auspices of the National Association of Educational Broad¬\ncasters.\nIn announcing the new thirteen-week series, Seymour N. Siegel,\nPresident of the NAEB, disclosed that the broadcasts on Jefferson will\nbe the first of many sets of programs devised to give the radio-listening\npublic a lively insight into matters of historical and contemporary sig¬\nnificance.\nBroadly conceived to afford a perspective on significant topics that\nwill at once inform, entertain and educate, the new NAEB programs have\nbeen made possible under a $300, 000 grant from the Fund for Adult Ed¬\nucation established by the Ford Foundation.\nThe special adult education committee of the NAEB which has planned\nand will produce the new sets of radio program series consists of George\nProbst, of the University of Chicago, chairman; Parker Wheatley, Lowell\nInstitute Cooperative Broadcasting Council; Richard B. Hull, Iowa State\nCollege; Harold B. McCarty, University of Wisconsin, and Mr. Siegel,\nDirector of the Municipal Broadcasting System, New York City.\nThe forthcoming series will be broadcast by member stations of the\nNAEB Tape Network, a cooperative organization devoted to the dissemi¬\nnation of outstanding radio programs. The programs also will be made\navailable to United Nations Radio, The Voice of America, the British\nBroadcasting Corporation, The Canadian Broadcasting Corporation, the\nAustralian Broadcasting Company, and All-India Radio.\nThe member stations of the NAEB Tape Network are owned and\noperated by educational institutions, municipalities and other public\nservice agencies.\nThe programs will be made available to commercial station operators\non a sustaining basis and it is expected that at least one series of those to\nbe produced will be broadcast over a national network.\nThe sets of series are planned to fit into a broad pattern of four main\noutlines — The American Heritage, The Nature of Man, International\nUnderstanding and Public Affairs. Since the project is flexible, the ideas\nto be worked out in some of the later programs and their presentation will\ndepend in some measure on public response to the opening series.\nThe initial series on \"The Jeffersonian Heritage\" will seek to explore\nthe enduring ideas that are best summed up in our Declaration of Independence,\namong American historic documents and best exemplified and symbolized by\nThomas Jefferson as an individual. Avoiding any emphasis on biography,\nthe programs will seek to translate into living terms through dramatic\naction the Jefferson embodiment of the spirit which should animate men\nand the general principles which should guide them here and now.\nFrom the \"Living Declaration\", opening program of the first series,\nthroughout, this radio venture will seek to make real and vibrant the\nprincipal features of the American Heritage as passed down from Thomas\nJefferson through a national history richly endowed with his ideas. These\nfeatures are seen as: -- one rich, fair land, offering vast opportunities;\none diverse people, melted into a national unit; one background of knowledge\nand skills inherited from the many races of our ancestry, and lastly, the\nnew timeless and universal ideas of a new land."
}