{
  "id": "d265-35",
  "text": "‘ RELEASE NUMBER 12\nFROM: Radio Station WXXX\nAddress\nT elephone\n(Date of Release Issuance)\nFOR RELEASE: (DATE)\nJEFFERSON-ADAMS FAMOUS CORRESPONDENCE DRAMATIZED\nOVER STATION WXXX\nIn \"Nature's Most Precious Gift\", the twelfth and next-to-\nlast broadcast in the Adult Education Project series on \"The Jeffersonian\nHeritage\", presented by the National Association of Educational Broad¬\ncasters, there is dramatized the natural aristocracy of talent and virtue\nhighlighted by the friendship between Thomas Jefferson and John Adams.\nWith the celebrated motion-picture star, Claude Rains,\nagain in the role of Jefferson, the new episode will be heard -- (date) --\nover Radio Station -- (name) -- at -- (time) The script, written\nby Milton Geiger, is based on research, advice and writings of Dr.\nDumas Malone, Professor of History at Columbia University.\nMusic composed and conducted by Wladimir Selinsky again\nis adroitly employed not only to give a melodic background to the spoken\nwords, but also to \"bridge over\" from one thought to another to heighten\ndramatic effect. Frank Papp produced and directed the broadcast.\nThroughout the script of the new episode the famous\nJefferson-Adams friendship is discussed by them in their correspondence\nof old age. The program ends with the death of both men on July 4, 1826.\nIn one of his letters to his friend Adams, Jefferson writes:\n\"There is a natural aristocracy among men ... The arounds\nof this aristocracy are virtue and talents -- There is also an artificial\naristocracy founded on wealth or birth without either virtue or talents.\nThe natural aristocracy I consider as the most precious gift of nature\nThe artificial aristocracy is a mischievous ingredient in government and\nprovision should be made to prevent its ascendancy. \"\nAnd Adams said in reply to this\"\n\"Your distinction between natural and artificial aristocracy\ndoes not seem to me well-founded. Birth and wealth are conferred on\nsome men as imperiously by nature as genius, strength or beauty.\nWhen aristocracies are established by human laws, and honor, wealth\nand power are m<ide hereditary, then I acknowledge artificial aristocracy\nto comm«nr <=> \" 7\n30"
}