{
  "id": "d265-97",
  "text": "'(University of Chicago®\nROUND TABLE\nARTICLE FROM\nTHE NEW YORKER MAGAZINE\nOF JULY 18, 1953\nPAGES 63-4\nTITLED\n\"TELEVISION — MR. JEFFERSON\"\nBy Philip Hamburger\nGenerally speaking, historical dramas on television turn out\nto be fairly boring affairs. For one thing, the actors are usually\nencumbered -with such unfamiliar costumes that they find it hard to\nconcentrate on their lines, and have to spend a good deal of time just\ngetting on and off the sets without waddling or stumbling. Put the\naverage television actor into a pair of knee breeches, say, and hang\none of those Colonial collars around his neck, and give him a cost\nwith ruffles down around the wrists, and the poor fellow is about as\nmobile as Grand Coulee Dam. For another thing, the prose in historical\ndramas tends to be rather densely historical. People don’t knock on\nthe door of a house and say, nMay I come in?” They are more likely to\nsay, \"Good morning, Madaia. A fate far beyond my control, or, indeed,\nthe control of any mere mortal, has brought me on this fair eighteenth\nday of June, 1793—=® day filled with a significance far beyond our poor\nken—to your humble abode. Pray, may I enter?\" For still another\nthing, there is rarely any drama in a historical drama. People are\nalways on the verge of performing some immense feat of world-shattering\nimport, but they hardly ever get around to it. They just talk about\nit, historically.\nAll this is incidental to saying that there are exceptions\nto the rule, all right, and that one of the exceptions, a historical\ndrama called \"The Independent Mr. Jefferson,\" came along a week ago\nSunday, onHiB.C. \"The Independent Mr. ^efferscn” arrived under\nhighly respectable auspices. Filmed in Chicago, the program was pro¬\nduced by N.B.C. in collaboration with the National Association of Edu¬\ncational Broadcasters, which had, as I understand it, received a grant\nfor the project from the Ford Foundation. The program was distinguished\nfrom the average historical drama by the fact that a lot of fine things\nwere said about freedom to dissent and freedom to think as one wishes.\nThey were said boldly, clearly, and without equivocation, too."
}