{
  "id": "d1269-24",
  "text": "feet its nighttime operation would have on the areas where there may he\naudiences now receiving service from the dominant station, so that on a com¬\nparative basis in each case, a proper decision may he made as to whether the\npublic interest would he hotter served hy permitting such duplicate operation\n(R. 6035).\nIn this connection, it is the contention of the NAEB that program services\nshould he correlated as much as possible to the particular local needs of the\narea in which a station is located. The operations of NAEB stations are spe¬\ncially geared to fulfill this function.\nThe programs of clear channel stations which would he subject to inter¬\nference hy the simultaneous operation of an HAEB station nighttime, are not of\nparticular interest to the listeners residing in the areas of interference.\nListeners in these areas necessarily rely \"pon stations located in their im¬\nmediate vicinity for news, market, weather, other items of information, and\ngeneral entertainment programs —- network and non-network. A clear channel\nstation located hundreds of miles away cannot serve this function. Just\nas it is impossible for metropolitan newspapers to effectively cover the\nneeds of particular rural areas hundreds of miles away, it is impossible for\na clear channel station in Los Angeles, for example, to broadcast farm news\nof local interest to rural listeners in other states. This is evident from\nmerely inspecting a recent map of the Bureau of Agricultural Economics, De¬\npartment of Agriculture, which shows the diversity of agricultural pursuits\nin the various states (Ex. 384). Granted that clear channel stations do pro¬\nvide some general form of program service to distant areas, it is submitted\nthat the public interest would better be served by permitting an HAEB station\nto serve its own area with its uniqne type of service at the cost of depriving\nsome clear channel station of a comparatively small number of listeners in"
}