{
  "id": "d1269-4",
  "text": "PLEA FOR RADIO NEWSCASTERS IN N.Y. LEGISLATION\nMike Hanna, Manager of NAEB station WHCU (Cornell University) appeared before the\nNew York ^State Law Revision Commission together with E. R. Vadeboncour (WSYR),\nSyracuse,\" to plead that radio newscasters should be covered in proposed legislat¬\nion enabling reporters to protect their sources of information. Hanna is also\ndirector of NAB Region II.\n94.2% OF US FAMILIES OWN RADIOS-SAYS BMB\nBroadcast Measurement Bureau reports that 37.623.000 U.S. families own one or\nmore radios in working order as of January, 1943, New England is first among\nthe 9 geographical areas in the U.S.. and Massachusetts leads all states\npercentage -wise with 98.9% radio ownership. New York ranks highest numerically\nwith 4,001,700.\nUrban radio ownership rose slightly from 95.2% to 95.7%. Rural non-farm\n(village*) is up from 87.4% to 94.4% and rural farm ownership stands at 88.7%\nwhich is up from 76.2% in 1946.\nUtah leads all states in the percent of radio ownership among villages with\n98.6%. Washington is first in percent ownership among rural farm families\nwith 97.6%.\nAccording to the BUB estimates, every geographic area in the U. S. gained in\ntotal number of radio families except the Mountain area._This area despite a\nslight loss in total families, did show a rise in radio families due to an in¬\ncrease in percent ownership.\nUrban, village, and farm all gained both in total families and radio families\nwith villages showing the greatest gain—1^- million more families and 2 million\nmore radio families than in 1946.\nNumber of families were estimated by BMB from census according to a formula\ndeveloped in cooperation with and approved' by the U.S.Census Bureau. Radio\nownership was determined by personal interview surveys conducted by the Market\nResearch Company of America and Alfred Politz Research.\nNATIONAL ASSOCIATION RADIO NEWS EDITORS PLANS ANNUAL MEETING\nThe National Association of Radio News Editors will hold its 3rd Annual convention\nin St. Louis, Missouri on November 12, 13 and 14. Announcement comes from NARND\npresident, John F. Hogan, news director of station WCSH, Portland, Maine. Major\nemphasis in '4b meeting will be on news processing anci presentation m new media.\nIt is expected several television experts'will attend the meeting to present\ndemonstrations of television.news technique. (NARND was founded in 1946 at its\nfirst convention in Cleveland. Last year’s meeting was held in Washington, D.C.)\nCHARLES DENNY MADE NBC VICE-PRESIDENT\nThe 36-year old former head of the FCC has been made vice-president of the Nation\nal Broadcasting Company. Charles Denny moves up from the position of vice-presi¬\ndent and general counsel of the network. RCA president and chairman of the board\nin making the announcement said the promotion is ”in keeping with RCA policy for\nregular infusion of youth in management.” Denny is replaced by Gustav Margraf,\n33-year old partner in a New York law firm and by David Adams, former assistant\nNBC general counsel. He is 35."
}