{
  "id": "d881-16",
  "text": "NINTH\nINSTITUTE FOR EDUCATION BY RADIO\n(Registration Monday Morning, May 2, 1938)\nAinley, J. T. - Univ. Broadcasting Co.- 230 N. Mich. Deshier\nAldridge, Wm. 0. - Free Lance Writer and Producer, 54 Garden Road, Cols.\nAikin, W. M. - 0. S. U. , Columbus, Ohio\nBarbour, Henry S. - Univ. Broadcasting Council, Chicago, Ill. Deshler\nBartlett, Kenneth - Syracuse Univ. Radio Workshop Deshler\nBudersee, Pat — Nat*l Brdstng. Co. 285 Lincoln Place, Brooklyn Deshler\nBeier, L. W. - Allied Radio Corp. 833 W. Jackson Boul., Chicago, 163 E. Norwich\nBell, Hermine - W.O.S.U., 846 E. Broad St., Columbus\nBeville, H. N. Jr. - National Broadcasting Co., Radio City, N.Y. Deshler\nBibber, H. W. - Ohio State University, Columbus\nBlair, Geraldine - Student, 1489 Michigan Ave., Columbus\nBradley, M. E. - Clem son College, Clem son, S. C. Deshler\nBrownfield, W. W. - Extension Dept;, Townshend Hall, O.S.U.\nBuckley, H. M. - Bd. of Education, Cleveland, Ohio Neil House\nBurdin, Gray- Butler Univ., Indianapolis, Ind. Deshler\nBurtt, Harold E. - Dept. Psychology, O.S.U.\nBeier, Mrs. L. W. - Allied Radio, 7000 East End. Ave., Chicago, 163 E.Norwich\nCavat, Miss Inez M. - Federal Council of Churches Deshler\nCarpenter, Harry A. - School of the Air, 501 Genesee St. Rochester, Deshler\nCharters, W. W. - Ohio State University\nComfort, Dorothea - Detroit Public Schools 407 King Ave.\nCrews, A. R. - Northwestern Univ. School of Speech, Evanston Deshler\nCummings, James E. - Nat*1 Catholic Welfare Conference Dept, of\nEducation, 1312 Massachusetts Ave., Wash. D. C. Deshler\nDale, Edgar - Ohio State University\nDammon, Clarence E. - Radio Committee, Purdue Univ., Lafayette Deshler\nDarrow, B. H. - W B F N, Statten Hotel 1314 W. 3rd Ave.\nDawes, Robert Gates - School of Dramatic Art, Ohio Univ., Athens\nDunham, Franklin - Nat’1 Broadcasting Co., New York Deshler\nEhrensberger, Ray - Univ. of Maryland Deshler\nElliott, Geraldine - W J R, Detroit, Fisher Bldg. Deshler\nEngel, Harold A. - State Station W H A, Madison, Wis. Deshler\nEvans, S. Howard - Nat’1 Comm, on Ed. by Radio, 1 Madison Ave.N.Y. Deshler\nEwbank, H. L. - Univ. of Wisconsin, Madison Deshler\nEwing, W. H. - Muskingum College, New Concord, Ohio Mt.Sterling\nBelmont, Farley - NEA (Nat11 Education Association) Washington D. C. Deshler\nFafehbaugh, Robert - Student, Delta, Ohio 130 E. Woodruff Ave.\nFrench, Robert S. - Station WHKC, 22 E. Gay St., Columbus.\nFrutchey, Fred P. - Extension Service, U. S. Dept. Agriculture, 422 E.Lane\nGates, R. W. - Ohio State University 15 - 14th Av.\nGibbony, Hazel L. - Bureau of Educational Research\nGotham, Raymond E. - Univ. of Wis., 121 Bascom Hall, Madison\nGriffith, W. I. - W 0 I, Iowa State College, Ames, Iowa Y.M. C.A.\nGringle, Agnes M. - Cooley High School, Detroit Deshler\nHarley, William G. - WHA, Wisconsin State Station Deshler\nHarrison, Margaret - Progressive Education Assoc. New York City Deshler\nHarshbarger, H. Clay - State Univ. of Iowa, Iowa City Neil House"
}