{
  "id": "d881-18",
  "text": "Fort Hayes\nDeshier\nDeshier\nFort Hayes\nDeshier\nMitchell, Mrs. D. T. - Parent Teacher Assn, 1460 Republic Ave. Columbus\nMoreland, Wallace S. - Extension Service, Rutgers Univ. Deshler\nMorgan, Clarence M. - Indiana State Teachers College - 99 N. Huron Ave.\nNelson, Frank H. - Church - 17603 Franklin Bl., Lakewood Av. Y.M.C.A.\nNisonger, H. W. - O.S.U. College of Education\nNorris, Emory - Student, O.S.U.\nOerlein, Karl F. - State Teachers College, Indiana Pa. Chittenden\nOlmstead, John ~ WPA in Ohio, District # 6, 337 S. High St., Columbus\nOrndorff, Bernice - Nat* 1 Council Teachers of English,Indiana,Pa. Neil H.\nOtis, Lehman - The Columbus Citizen\nParker, Lester - Research Project in School Broadcasting,\nMadison, Wisconsin\nPettegrew, C. If. - I 0 S U, Columbus\nPhillips, Elaer S. - Cornell Univ., Ithaca N.Y.\nPhillips, Mary - Office Dean of Women, O.S.U.\nPooley, Robert C. - Univ. of Wisconsin, Madison, Wis.\nPore, 0. E. - State Dept, of Education, Columbus\nRadkey, Arthur A. - W L W - 146 W. McMillan, Cincinnati\nRamseyer, Lloyd L. - Bureau of Ed. Research, O.S.U.\nRankin, Paul T. - District Public Schools, Detroit, Mich\nReed, Paul C. - Rochester School of the Air 1810 Devon Road\nRies, Joseph -WLW-WSAI, Education Dept. Deshler\nRobinson, Francis - Radio Station W S M, Nashville Tenn. Deshler\nRoller, Larry ^IHK-lfCLE, Fort Hayes\nRoss, Anthony - W K B N - 80 6th St. , Campbell, Ohio 46 Chittenden\nRunyeon, Mrs. Kay - 182 Aldrich Road, Columbus\nRushworth, Thomas D. - K S T P, St. Paul, Minn. Deshler\nSanchinger, Cesar - Amer. Hist. Ass'n Radio Comm. Deshler\nSchooley, Frank E. - Univ. of Illinois, Urbana, Ill. Deshler\nSchreiber, J. V. - Grad. Ed., 3308 W. 110th St., Cleveland\nSeebach, Julius F. Jr. - Radio Station W COR, N.Y. City Deshler\nSheffield, Virginia - Nat'l Coam. on Ed. by Radio, 1 Madison Ave.N.Y.C.\nShield, Robert - WO S U, - 247 18th Avenue, Columbus\nShultz, C. L. - Minister, 162 N. Main St., Alexandria, Ohio\nSchwartz, Mrs. Lavinia - W B B M, Columbia Broadcasting System Deshler\nSkarry, Patricia - Allied Radio, Chicago, Ill. 165 E. Norwich Ave.\nSmith, Burton M. L. - Research Project in School Broadcasting\nW H A , Madison, Wis.\nSmith, Harley - Louisiana State Univ., Baton Rouge, La.\nSmith, Mrs. William L. - Columbus League for Hard of Hearing\nSprang, Ralph H. - Student, 69 - 14th Avenue, Columbus\nStanton, Frank N. - C B S, 485 Madison Ave.\nStephenson, Geneva - 242 - 13th Avenue, Columbus\nStevins, Arthur - Western High of Detroit, Michigan\n18 Griswold St., Delaware, 0\nStewart, Irvin - Comm, on Scientific Aids to Learning\n41 E. 42nd St., New York City Deshler\nSummers, H. B. - Kansas State College, Manhattan, Kans. Deshler\nTuttle, Warren W. - Div. of Public Assistance, State Office Bldg, Cols.\nTyler, I. Keith - Institute for Ed. by Radio, O.S.U., Columbus, 0.\nTyler, R. W. - Bureau of Ed. Research, O.S.U.\nTyler, Tracy F. - Univ. of Minnesota 1810 Devon Road\nVorpe, John T. - Stations WHK-WCLE Fort Hayes\nY.M. C.A.\nChittenden\nDeshler"
}