{
  "id": "d1305-1",
  "text": "WOSTJ Family Evening Hour — 2\nl4The Artist’s Nctebook”-«»to be presenter! by \"Hon. Blauhut, a radio student at\nOhio State University, in collaboration with the Columbus Gallery of Fine Arts.\nThe 15-minute broadcast to be hai*rd at 7sl5 p.m. on Wednesdays will feature\ndramatizations of lives of the great artists and how they came to paint their\nmasterpieces.\n’’Campus Symphony and Song”—weekly appearances of various campus music groups\nsuch as the famous Ohio State Marching Band and Symphonic Choir, to be hear#\nat 7 p.m. Thursdays.\n’’This Week**-~a 15-minu:*© news roundup by have Lattimer, popular WOSU news\nanalyst and history teacher at OSU, who will be assisted in the preparation of\nhis script by Paul Wagner, director of the WOSU newsroom. The program will review\nthe week’s news on the state, national and internaticnal levels. Aired at 6s45\np.m. Fridays. /\n’’High School Caravan” —High schools in and near Columbus will offer their\nchoral groups for a 15-minute broadcast at 7 p.m. Fridays. Scheduled thus far\nare Columbus North and Central, Chillicothe, Marion and Plain City.\nOther music programs to be included in the weekly family listening hour in¬\nclude a ”Muslc Forecast’5, 6:20 pr.m« Mondays, bringing Information about concerts\nsmd recitals available in fch© Columbus area and the personalities currently in\nthe music world news; ’’Operatic Favorites”, a presentation of the Columbus Grand\nOpera Club and featuring Fatti Cooper, an Ohio Staue University student, on the\nopening March 24 program at 7 p.m.\nMurray Lockard, well-known student vocalist at Ohio State University and a\nsenior in radio education, will present a ’’Twilight and Music” program at 7 p.m.\nTuesdays that will offer native American music, including Indian songs, early\n. *\nsettlers’ and colonial music*American revolutionary tunes, pioneer and westward\nplains songs, mountain airs. Civil war ditties* and spirituals.\nStill more music will come wafting from WOSU-tuned loud speakers during the\nWednesday 7 p.m. series, ’’The Greeks”. These will b© remote-control broadcast\n(MORE)"
}