{
  "id": "d1439-0",
  "text": "1\nN\nA\nEJ\nl\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL URBANA, ILLINOIS\nTHREE RESEARCH GRANTS AWARDED\nThree NAEB Research Grants-in-Aid were recently\nawarded to educational institutions. Ohio State Uni¬\nversity was given a grant to study the extent to\nwhich parents of children from five to ten or eleven\nexercise control or supervision over the TV programs\ntheir children watch.\nKUOM, of the University of Minnesota, received\na grant to survey audio-visual equipment of Minne¬\nsota schools and the audience of Minnesota School\nof the Air in-school programs immediately before\nthe initiation of ETV.\nA grant was awarded Michigan State Univer¬\nsity to help in research to determine which matched\na group controlled situation students will utilize ma¬\nterial more thoroughly when the material is pre¬\nsented primarily by sight (closed-circuit TV), by\nsound (radio), and in a control situation (lectures\nin a classroom).\n—NAEB—\nGREETINGS FROM THE PRESIDENT\nBurton Paulu\nThey used to begin by saying: “Of course I never\nlisten to the radio . . . . ” Later the customary open¬\ning became: “I don’t have a TV set . . . But in\neither case; such openings usually heralded some ill-\ninformed criticism of broadcasting.\nIt goes without saying that all mass communi¬\ncations — including both the older printed and the\nnewer electronic media — should be objectively ap¬\npraised. Their faults should be noted, so that im¬\nprovements may result. Their accomplishments need\nto be stressed, in order that desirable trends may be\nencouraged.\nThis requires that thinking, responsible people\nshould intelligently review the true state of broad¬\ncasting; and the knowledge essential to such informed\ncriticism is usually not possessed by radio and TV\n“resisters,” who pride themselves on seldom listen¬\ning to the radio and not owning TV sets.\nNAEB Newsletter\nVol. XXII, No. 3\nMarch, 1957\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14 Gregory\nHall, Urbana, III., $5 a year, edited by Mrs. Judith Stevens.\nApplication for 2nd class mail privileges pending at Urbana,\nIllinois.\nAs NAEB members have learned the hard way,\neducational administrators and teachers, as well as\nintellectuals generally, often stand apart from\nbroadcasting. Themselves atypical consumers of\nradio and TV, they may be unaware of the public’s\nenthusiastic acceptance of these media. Certainly we\nin colleges and universities have many such people\namong our friends. Their frequent complaints about\nlow program standards and advertising excesses sug¬\ngest that the faults of the American system may un¬\nderlie their attitudes.\nActually, these prejudices are characteristic of in¬\ntellectuals everywhere. In July 1954, for example,\nwhile attending a UNESCO TV conference in London\nwith representatives of a dozen other countries, I was\nsurprised to hear spokesmen from Europe telling\nsimilar stories, especially in regard to TV.\nYet it is vitally important that serious minded\npeople develop an adequate understanding of broad¬\ncasting. In the first place, they should appreciate\nits social and educational potentials. Because they\nare non-fre.quent users of radio and TV, intellect¬\nuals underestimate the attraction of broadcasting\nfor average men and women. The average person’s\nlimited exposure to serious material in all media\nmakes very important the information and ideas he\nacquires from the entertainment and escape pro¬\ngrams to which he often devotes upwards of 4-5\nhours a day.\nIn addition, intellectuals often need to be in¬\nformed about the number, variety and merit of the\nserious programs which they might enjoy if they\nNEWSLETTER\nPage I"
}