{
  "id": "d1439-5",
  "text": "PROGRAMS\n► Taxpayers who found their income tax forms\nread like Chinese puzzles were interested in the new\n5-program series that started February 4 over\nWKAR-TV, Michigan State. Visiting experts ex¬\nplain how to fill out the form, deductions, filing re¬\nquirements and exemptions.\n► Graduation exercises for the 760 adults learning\nto read and write via WKNO-TV, Memphis, were\nheld with a special TV ceremony February 16. The\nsecond phase of the literacy project began February\n18. Also, WKNO received a $2500 grant from the\nETRC to evaluate its first literacy course.\n► A landmark in musical and TV circles was made\nwhen the San Francisco Symphony Association and\nKQED, San Francisco’s ETV station, began to pre¬\nsent seven hour-long musical programs. Beginning\nFebruary 15, the series marks the initial presentation\nof a behind-the-scenes view of the San Francisco\nSymphony Orchestra on TV.\nTo prove that modern science is fascinating and a rewarding\ncareer for a youngster, Professor Jonathan Karas, producer-host\nof \"2000 A. D.,” WBZ-TV Boston, is willing to walk through fire!\nThis is not a trick camera stunt, but a live test of modern heat\nprotective clothing.\n—N A E B—\nETV received a welcome and unlooked for burst of\nattention in the February 16th Saturday Review. A\nheadlined article, “TV: Teaching’s Newest Tool”\nby Jack Mabley of the Chicago Daily News, told\nof the fine uses educators are making of TV.\nBroadcasting In America by Sydney Head. Uni¬\nversity of Miami, was mentioned as the source of in¬\nformation for Gilbert Seldes “TV and Radio” column\nin the same issue of the Saturday Review.\nTV TECHNICAL TIPS NO. 30\n—Cecil S. Bidlack, NAEB TV Engineer\nIn the February Newsletter we led off this column\nwith a story about the revised NAEB Technical Di¬\nrectory. If you anticipated receiving a copy of the\nDirectory before this, it isn’t lost in the mails.\nAs I write this, stencils are being cut, and we\nhave a promise that it will be in the mail the first\nweek in March. The Test Equipment Inventory has\nbeen completed; the stencils cut, and it, too, should be\nmimeographed and in the mail that week.\nThe Technical Directory will go to the complete\nEngineering mailing list; the Test Equipment In¬\nventory will be sent only to chief engineers.\n*•***•\nWe’ve had a note from John Brugger, chief en¬\ngineer for the closed circuit TV experiment conducted\nby the Board of Education of Washington County at\nHagerstown, Md., in conjunction with the Radio-\nElectronics TV Manufacturers Association and the\nFund for the Advancement of Education.\nHe states that during the summer months from\nJune to September they will be expanding their tech¬\nnical facilities. He will need extra technical help for\nthese months and will be happy to employ at least\nthree and possibly six persons to help with this work.\nIf any of our readers are available for the sum¬\nmer and are interested, you can write direct to John\nin care of the Board of Education at Hagerstown,\nMd.\n* * * *\nHere’s a tip from Robert F. Lewis, chief engineer\nof WFBE (FM) Flint, Michigan, which may foster\nbetter engineering-production relationships.\nDue to the difficulty in cueing microgroove rec¬\nords and their susceptibility to damage, WFBE\n(FM) does not use them directly for program pro¬\nduction work, such as in themes, bridges, etc. In¬\nstead the music for each production is tape recorded\nin proper sequence in advance. The tape is then used\nduring the production.\nThis method cuts down the error potential to\npractically zero, plus reducing wear and tear on discs.\nFor playback a fast-starting tape unit, such as the\nMagnecorder PT6 series, works very well.\n* * * *\nFifty thousand engineers are expected to attend\nthe 1957 Convention of the Institute of Radio En¬\ngineers and the Radio Engineering Show in New\nYork City at the Coliseum and Waldorf Astoria,\nMarch 18-21. The program includes 275 papers re¬\nporting new developments with 840 exhibits of new\napparatus covering all four floors of the Coliseum.\nPage 6\nNEWSLETTER"
}