{
  "id": "d1111-1",
  "text": "PAY TV\nFCC began hearings Oct. 24 on application of RKO General Inc. for authority\nto start subscription TV programming over WHCT-TV, Hartford, Conn. Applicant\nproposes to use Zenith’s Phonevision system. Opposing grant are NAB and 5 Hart¬\nford theatre owners. In England, British Home Entertainment, Ltd. proposes that\nnation’s third network be a pay system.\nETV GROWTH\nTV Digest (Oct. 17) noted: \"ETV may repeat its 10 new-stations 1959 record\nand wind up i960 with on-air total of 55 non-commercial outlets (including 17\nUHF) if following meet their target dates: KTPS Ch.62, Tacoma, Wash, with fall\ntarget; KCSD-TV Ch.19, Kansas City, Dec. 15; WIPM-TV Ch.3, Mayaguez, P.R., Dec.\nThis would leave but 15 cp’s outstanding for educators — J of them UHFs in New\nYork State...\" Publication then lists comparative growth record of educational\ncommercial TV stations after lifting of freeze:\nDATE\nETV\nCOMMERC]\n1953\n2\n229\n1954\n10\n91\n1955\n7\n52\n1956\n4\n4o\n1957\n6\n34\n1958\n8\n28\n1959\n10\n14\ni960 thus\n7\n12\nfar\n54*\n500\n*0nly 52 on air; KTHE, Los Angeles left air in 1954, WKAR-TV, East Lansing, in\n1958* Most recent ETV stations to come on: WGTE-TV Ch.30, Toledo; KWCS-TV Ch.l8,\nOgden, Utah.\nU. S. OFFICE OF EDUCATION NOTES\nDr. Roy M. Hall, Ass'st. Commissioner for Research and Statistics since 1958\nis returning to U. of Texas on Jan. 1. His work with 00E has been centered on the\ndirection of the Cooperative Research Program and the Title VII, NDEA program.\nDr. Franklin Dunham, Radio-TV Division, Educational Media Council has just\nreturned from 6-week Congressional world tour and participation in Interparlia¬\nmentary Union in Japan. Visits included Netherlands, Switzerland, Lebanon, India,\nTaiwan, and Japan. Highlight: attending inaugural of first ETV station and only\nTV station in India, at New Delhi. He also discussed broadcasting problems with\nthe Director General and his associates of NHK, the Japanese broadcasting union. A\ncomplete resume of the international broadcasting picture as seen by Dr. Dunham will\nappear in forthcoming issue of the NAEB JOURNAL.\nICA CONFERENCE\nOn Nov. 16, Chief Education Officers of ICA Mission around the world meet in\nWashington with afternoon session devoted to communications problems and pos¬\nsibilities. Speakers include: Gerald Winfield, Chief of Audio-Visual Section,\nICA; James Flynn, president of DAVI, and Richard Rider (on \"TV as a Teaching Tool\"),\nRadio-Television Officer, ICA Communications Media Staff. Conference planned in\nconjunction with NEA."
}