{
  "id": "d1476-1",
  "text": "Committee Invites Archives Proposals\nThe NAEB History and Archives Committee is seeking\nspecific proposals from institutions interested in becoming\nthe repository for the NAEB archives. Several agencies have\nindicated an interest, but the committee needs more specific\ninformation on how the institution proposes to collect, evalu¬\nate, and preserve the historical materials. Send proposals or\ninquiries to the committee chairman, Harold Engel, WHA,\nUniversity of Wisconsin, Madison.\nIndividuals May Obtain Certificates\nAt the suggestion of an Individual Member, the NAEB is\nnow offering certificates of membership to its Individual\nMembers, at a cost of $5 each. Members should order from\nMrs. Dotty Templeton, 119 Gregory Hall, Urbana, Illinois,\n61803—enclosing check and exact spelling of name for the\ncertificate.\nNew NAEB Institutional Members\nRADIO DIVISION & NETWORK\nAugustana College, WVIK (FM), Rock Island, Illinois.\nINSTRUCTIONAL DIVISION\nCommunity Television of Southern California, KCET-TV,\nLos Angeles; Kentucky Authority for Educational Television,\nLexington.\nINSTITUTIONAL AFFILIATE\nNortheastern University, Boston.\nWinthrop College, Rock Hill, South Carolina, has joined\nNERN as an Associate Member Affiliate.\nINDIVIDUAL ,\nIn the last two months, there have been 98 new Individual\nMembers.\nProject 2500 Described\nAn audio tape-filmstrip presentation describing developments\nin 2500mc TV broadcasting can be purchased for $10 from:\nDivision of Educational Communications, Bureau of Mass\nCommunications, State Education Department, Albany, New\nYork, 12224. Make checks payable to Regents’ Fund.\nConference Announced\nThose interested in electronic information handling will meet\nin Pittsburgh October 7-9 to discuss the problem and plan for\nthe future. The program will cover shortcomings of present\nsystems, large-scale systems under development, operational\nexperiences, and the end uses of information. Organizers of the\nconference are the University of Pittsburgh, Goodyear Aero¬\nspace Corporation and Western Michigan University. Fur¬\nther information is obtainable from: Knowledge Availability\nSystems Center, University of Pittsburgh, Room 270, Hotel\nWebster Hall, Pittsburgh, Pennsylvania, 15213.\nPublications\n• Broadcasting in Japan 1963-4 has been published by the\nJapan Broadcasting Federation, 10, 8-Chome, Ginza-nishi,\nChuor-ku, Tokyo. The 82-page magazine-type handbook has\nbeen issued to give readers throughout the world an idea of\nJapan’s broadcasting, telecommunications and electronics in¬\ndustries.\n• Screen Education: Teaching a Critical Approach to Cinema\nand Television is a new 100-page UNESCO publication. It’s\na study by A. W. Hodgkinson derived from an international\nmeeting in Norway in 1962 on film and TV teaching.\n• The Florida ETV Commission has issued an annual re¬\nport for 1962-63. The 27-page booklet contains a financial\nreport and highlights and activities for the year.\n• McGraw-Hill has announced publication of a book by\nMarshall McLuhan called Understanding Media. McLuhan\nconducted an NAEB-USOE project on the same subject sev¬\neral years ago.\nNews Notes\nPERSONNEL\n^ H. B. McCarty, director of the division of radio-TV edu¬\ncation at the University of Wisconsin, has announced a num¬\nber of promotions and administrative changes: Lee S. Drey¬\nfus becomes associate director of TV, after having served\nas WHA-TV general manager for two years. He will have\nspecial ITV responsibilities, and will continue to teach com¬\nmunications courses in the speech department. Steven Mark-\nstrom, WHA-TV assistant manager since October, has been\npromoted to station manager. George Schneidewind has been\nnamed program supervisor, and will carry on many func¬\ntions of Ted Nielsen, program director, who will be on leave\nto do graduate study. Gary Gumpert, senior producer-director,\nwill have increased responsibilities in developing closed-cir¬\ncuit ITV. Lee O’Brien has joined the directing staff.\ny On the WHA radio staff, the following were announced:\nCliff Eblen, former radio program director, has become\nWHA station manager. Karl Schmidt, WHA production\nmanager and WHA-TV special projects director, assumes new\nresponsibilities for developing special projects in radio as\nwell as TV. He will continue teaching in the speech depart¬\nment also. Kenneth Ohst is now WHA production super¬\nvisor.\n^ Robert M. Reed has resigned from WHA-TV to accept a\npermanent appointment at the University of Hawaii, where\nhe has been on leave of absence serving as associate director\nof the Communication Center and associate professor.\n^ Ronald Bornstein, program and production manager at\nthe University of Michigan, will take a leave of absence be¬\nginning in September to accept an appointment as production\nsupervisor of TV and assistant professor at the University\nof Hawaii.\n^ Robert C. Boston has left the KETC staff, St. Louis, to\nbecome assistant manager of WILL-TV and supervisor of\nTV service at the University of Illinois.\n^ Sheldon P. Siegel has resigned as station manager and pro¬\ngram director of KAET, Phoenix, effective September 1, to\nbecome station manager for the Lehigh Valley ETV Cor¬\nporation, which will activate a new ETV channel in early\n1965 in Allentown, Pennsylvania.\n^ Lawrence Frymire has resigned as chief of the FCC’s ETV\nbranch to move to Sacramento, where he is the California\ntelevision coordinator.\n^ M. Russell Jolly has succeeded the Rev. Robert Sanders as\neastern area director for the United Presbyterian TV-radio\ndivision. Jolly was a commercial broadcaster before he joined\nthe staff of the Wichita Council of Churches in 1959. He\nwas named executive director in 1960, a post he held until his\nresignation in July.\n^ Robert E. Summers will join the radio-TV faculty at Ohio\nUniversity in September as professor and department chair¬\nman. He is currently on leave from the University of Texas,\nmaking a world tour to study foreign systems of broadcast¬\ning—with focus on ETV in Nigeria.\ny James G. Saunders, former graduate student at Ohio Uni¬\nversity, will become an instructor in radio-TV there in Sep¬\ntember. He will also serve as administrative assistant to C. E.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Editorial assistant: Skip Robinson.\nPhone 333-0580. Area Code 217.\nReporters:\nRegion I —Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\nRegion II —Lou Peneguy, AETC, 2151 Highland Ave., Birming¬\nham, Ala.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}