{
  "id": "d1476-1",
  "text": "WSM-TV studio which is air conditioned). In ad¬\ndition to cutting down heat, they also believe a re¬\nduction in the amount of infra-red light improves\npicture quality.\n* * * *\nOn our visit to ICCTS in Seattle, we picked up\nan idea which may be helpful. In order to cut down\non their inventory of 16mm reels, they use a split\nreel in conjunction with a plastic core and a brass\nhub which they designed and built. This way they\nare able to store film in cans on the plastic core (used\nfor bulk film) and operate with a small number of\nsplit reels. The illustrations show the parts of the\nbrass hub separated and with the hub in the plastic\ncore.\nKCTS is fortunate in being able to have the hubs\nmade at a trade school at no other cost than the 1 inch\nbrass stock. They also buy the inexpensive reels, take\nthem apart and install the brass hubs, thus making a\nvery reasonably priced split reel. We don’t have a\nworking drawing for the hub, but believe you all have\nthe. important dimensions available to have these\nmade, if you wish to adopt this practice.\n* * * *\nWe also picked up a tip from Ross Scroggs at\nWUNC-TV which has a more limited appeal since it\nis for use with a film processor.\nWUNC-TV has been making kinescope record¬\nings of* the University of North Carolina football\ngames. They built a film magazine which holds an\nhour’s film so it is possible to reload the magazine in\nthe 20 minutes between the halves of the game. The\nkine is then edited and shown on WUNC-TV on Sun¬\nday evening.\nWUNC-TV does its own film processing. Ross\nhas a special metal core he uses to make sure he does\nnot pull the film leader through his film processor,\nand avoids the necessity for rethreading the processor.\nHe uses a metal core as the take up hub in the kine¬\nscope recorder magazine. Sufficient leader for the\nprocessor is attached at the start of each hour’s un¬\nexposed film. The special core contains a slot just\nwide enough to accomodate the thickness of the film.\nIn threading the magazine, the end of the leader is\nfolded over so the leader won’t pull out of the core.\n\\ I\nThe film is processed backwards, that is, from\nend to beginning. When the exposed film has run\nthrough the processor and pulled the leader through\nto the end, the tension stops the processor, threaded\nwith leader.\n* * * *\nWe have just received the 25th Anniversary Issue\nof Broadcast News, a publication of the Radio Corp¬\noration of America. Among other articles it contains\na 13 page, well-illustrated description of KETC, The\nSt. Louis Educational Television Commission station.\nThere is also a short story devoted to WHYY-TV of\nthe Metropolitan Philadelphia Radio and Television\nCorporation.\nPage 2"
}