{
  "id": "d1643-2",
  "text": "-3-\nrigid position than NAEB. In effect, NET says it agrees that the Corporation\ncan, for purposes of economy, arrange for long-term easing of interconnection\nfacilites but that should be the end of its responsibility re interconnection*\nThe Corporation must not be allowed to manage such an interconnection system\nitself and that NET may consider advocating a \"clarifying” amendment for\nsuch purpose.\nAll of us would agree that we can not permit any substantial disagreement\nto crop up in the \"family” that might conceivably jeopardize the legislation.\nThere is a continuing need for communication.\nHearings in the House have not been set, though we do know that these\nhearings will- be held before the full House Interstate and Foreign Commerce\nCommittee, under the chairmanship of Harley Staggers; they are expected to\nbegin v/ithin the next three weeks*\nMeanwhile, we have been assured by the President of NAB that it has no\nintention of pushing the particular formula advanced in its Senate testimony\nand, in fact, may not even testify in the House hearings. It would appear\nthat NAB certainly will not oppose the bill and, in fact, is very\nsensitive to any implications that it might do so.\nNAEB TASK FORCE\nRepresentatives of McKinsey & Co., the management firm retained to conduct\nthe special study of NAEB's organizational and administrative structure have\nbeen very busy interviewing a variety of people both within and without the\nmembership to gather their insights and suggestions for consideration in\ndeveloping a draft report, to present to the Executive Committee meeting.\nMay 26-27.\nOn the basis of the Committee's reactions and suggestions, McKinsey & Co.\nwill prepare a final report to submit to the full Board at its meeting,\nJune 5-6. To whatever extent the Board decides to accept recommendations\nwhich may.be made, certain procedures of an operational or management nature\ncould be instituted almost immediately? structural alterations requiring\nchanges in the By-laws would need to be submitted in writing to the member¬\nship 30 days in advance of the convention and be voted on at the convention\nin Denver, November 5-8,\n—ItfGH\nWGHimab"
}