{
  "id": "d1014-26",
  "text": "Flemming\n4\npublic and the private sector - they are thinking of governmental activities generally, they are\nthinking of public and private activities in the field of mental health and so on, The demand\nfor persons who are trained to occupy these positions is far greater than the supply. If you\nare acquainted for example with the case workers1 situation in the welfare field within your own\ncommunity you know that in most instances the case workers are carrying loads way beyond\nwhat they should be asked to carry simply because other persons cannot be obtained. You know\nthat in many instances there are persons employed as case workers who have had literally no\nprofessional training to help them in the carrying forward of these very important duties and\nresponsibilities.\nI am convinced that within our colleges and universities there are tens of thousands of under¬\ngraduates who are milling around without any clear idea as to what they want to do with their\nlives. I think that we could be of tremendous assistance to them if we would introduce into\nthis community service area the work study concept that Antioch College in Ohio has carried\nout so effectively in cooperation with industrial concerns. Programs could be developed\nunder which students would be residents for a given period of time, leaving the campus for\none of these community service occupations as an intern or as a trainee, then back in residence\nagain, resulting in a program that might take five years instead of four, but a program which\nwould provide some income and at the same time give them the kind of experience that would\nmake it possible to discover for themselves what it means to become involved in some of\nthese great service occupations of our day. Having discovered what it means, they could\nshape their educational program accordingly. I believe that it would be possible for our\neducational institutions to make available to the communities of our nation far more persons\nwho are motivated to become involved and are trained to become involved in an intelligent\nmanner in the great issues that confront our communities.\nWe now turn to the field of human rights. Civil rights is the law of the land. For this we are\nthankful but it is becoming increasingly clear that civil rights laws will be applied to specific\nsituations only if persons who are endowed with courage are willing to take risks and become\ninvolved in providing the leadership that is required if tliese laws are to be applied in a\nmeaningful manner. There is a tendency sometimes on the part of all of us to say that getting\nthe laws involved a terrific struggle. We can t expect these laws to change things overnight.\nIt takes a while to change human nature. This, of course is true, but at the same time we\nmust keep saying to ourselves, we have no right to ask men and women to be patient when\ntheir basic freedoms are at stake. I believe that if we are going to make the kind of progress\nin the civil rights field that we should make - be able to make - in the light of the laws that\nhave been passed, it will come about only if we at the community level are to be willing to\nbecome involved in the situations which cry out loud for leadership. The lack of that lead¬\nership can lead to the development of festering sores and explosions.\nIn another aspect of this field of human rights, the Supreme Court of the United States is\nmaking it clear that the rights of the individual cannot be set aside under our Constitution\neven in the interest of what some refer to as effective law enforcement. These decisions\non the part of the Supreme Court have stirred up a vigorous and at times a bitter controversy.\nHow do we approach this issue? Do we stand on the sidelines and at times even join with\nthose who abuse the Supreme Court for being unrealistic for being too soft? Or are we\nwilling to become involved in discussions and in movements designed to develop methods of\nlaw enforcement that are even more effective than the methods that we have been using and\nthat do not undermine our Bill of Rights.\nSurely we are not willing to approach this whole issue with a defeatist attitude and say that\nit is impossible at one and the same time to have a meaningful Bill of Rights and also an"
}