{
  "id": "d1014-38",
  "text": "Mr. James M. Morris October 20, 1964 Page 2\natives present (Crabbe, Engar, Lewis, Norwood, et al.), but to\nthe people (some of them, anyway) whom we've just heard from\nWashington. In general, then, does that seem an appropriate\ntack to take in the context of the new 1965 NAEB?\nIf you've read this far, you may be thinking that I've lost\nmy mind, talking about television from Washington, and direct\ntalk-back, diagonally across the nation, but I do have a rational\napproach to accomplishing all this.\nThe thirty minute(or even hour-long) TV \"star-studded spectacular\"\nwe pre-tape with a little cooperation from WETA-TV. With an\nelectronic editor, it would not even have to be done in a single\nsession. Witherspoon says he's willing to oversee that end of\nthings. As for getting it on five or six TV sets in Portland,\nit shouldn't be too difficult to enlist the cooperation of one\nof the exhibitors. If KOAP can clear the time in their schedule\nthat evening, the \"Report\" ought to make interesting viewing for\nthe general audience, as well, if given a proper introduction.\nIf time on KOAP is not possible, again I'd propose to go to an\nexhibitor or potential exhibitor (say Ampex, Sony, Dage, etc.)\nand have the original Washington tape dubbed down to slow speed\nhelical for playback for the session.\nAs for the talk-back, that follows the pre-taped session. What's\nnecessary is that we set up a conference call in advance which\nincluded all or most of the people who appear on the tape. If\nwe can gather them in some central place in Washington, such as\n1346 Connecticut, they can use a telephone amplifier on the\nconference table. In Portland, we do the same thing, or hook\ninto the meeting room PA system.\nAssuming that, under this plan, neither Bill Harley nor Harold\nHill will need to fly to Portland, the total bill for the set-up\nought to represent a net savings. Witherspoon is willing to work\nfree as producer of the tape, for the good of the cause, and I'd\nhope that we can get WETA's cooperation. Even if we have to rent\nstudio time to produce the Washington end, the cost should still\nbe less than two round-trip air fares, plus living expenses.\n(In fact, it seems to me reasonable that the NAEB front office\nought to underwrite the cost of project.) The phone link should\ncome in for less than $200 if we handle installation. . .at least,\nthat's my guess.\nAs for the Friday morning sessions, I have some ideas on what we\nmight do in Radio, and I'll query ;the NER-6 stations for their\nideas, via PL-6."
}