{
  "id": "d1014-62",
  "text": "n ie^ ^\nMeeting of pEg Region VI\nBellevue Hotel, San Francisco, California\nFebruary 18, i960\nPresent;\n\\\\\n3-\nU.\n5»\n6.\n7,\n8.\n9-\n10.\nu.\n12,\n13.\n111.\n35.\n16.\n17.\n18.\n19.\n20,\n21*\n22.\n23 0\n2k*\n25 •\n266\n27*\n28.\n29.\n30.\n31.\n32 c\n33.\n3U.\n35*\nBelling hair:,Mash6\nBell. Richard IL, Director, Radio-TV, Ariz. State, Temps, Aria.\nCassyd, Syd, ETV Consultant, U. of Calif, at Los *ngeles, Los Angeles, Calif,\nCrabhe, John C., General Manager, KVXE, box 1882, Sacramento, Calif.\nElliptt, Richard, Asst. Prof, of Radio-TV, San Jose State Coll., San Jose, Calif*\nEllis, Robert IL, Faculty Associate, Radio-TV Bureau, Ariz. State U., Terrrpe, Ariz.\nFlick, Clarence E., Superv., Occup. Currie, in Radio-TV, San Jose State Coll., San Jose,Cal.\nDormer, Stanley T., Dir, of Radio-TV, Stanford U., Stanford, Calif.\nEngar, Keith M., Manager, KURD, TJ. of Utah, Salt Lake City, Utah.\nEssman, Phil, A-V Consultant, Los Angeles County Schools, Los Angeles, Calif.\nHansen, Burrell F. , Chon., Radio-TV, Utah State U., Logan, Utah.\nHart, Richard, TV Coordinator, U. of Washington, Seattle 5, Washington.\nHarwood, Kenneth, Gen. Mgr., KUSC, U. of So. Calif., Los Ahgeles 7, Calif.\nEferbold, Paul E», Chmn., Radio-TV Committee, Western Washington State Coll,\nHill, Harold K., Admin. V.P., NAEd, Hj. Gregory Hall, Uruana, Ill.\nHopkins, .gill. Program Dir„, KVIE, pox 1882, Sacramento, Calif.\nJones, Jr., K. K., Dir. of broadcasting, San Diego State Coll., San Diego, Calif.\nJorgensen, Erling S., Dir., Radio-TV Studios, Montana State TJ., Missoula, Mont.\nKager, Ken, Operations Mgr., KUOW, U. of Washington, Seattle 5, Wash.\nKimball, Merle, Director, KTF5, 1101 S. Yakima Ave., Tacoma, Wash.\nLoper, James, Asst. Dir., Radio-TV Bureau, Ariz. State IT., Temps, Ariz.\nMerrill, Irving R., Office of TV Research, U. of Calif. Medical Center, San Francisco, Galif.\nMiner, pob. Manager, Market Planning, Ampex Corp., Redwood City, Calif.\nMorahead, Hubert, Assoc. Prof, of Speech and Drama, Long Beach State Coll., Long peach, Calif\nMorris, J. M*, KOAC-AM-TV, Corvallis, Oregon.\nNorwood, Frank W., Asst. Prof, of Speech, San Diego State Coll., San Diego, Calif.\nPike, Arnold, Radio-TV Director, Calif. Teachers1 Assn., So. Section, Los Angeles, CaLifo\nRice, John, KQED, San Francisco, Calif.\nRich, Owen S., Chmn., Radio-TV Committee, prig ham Young U., Provo, Utah.\nRobertson, Janies, Dir. of Station Relations, NETRC, New York, N. Y,\nRoman, Paul A., Program Dir., KSDS-PM, San Diego Jr. Coll., San Diego, Calif.\nRundell, Hugh A., KW3C, Washington State U., Pullman, Wash.\nSherburne, Jr., E. G., Coord, of ETV, U. of Calif., Berkeley. Cal if *\nStarlin, Glenn, Dir, of broadcasting, jj. of Oregon, Eugene, Oregon\nStone, Loren, Manager, KCTS, U. of Washington, Seattle 5, Wash.\nWalter, Roger L«, Idaho State Coll., Pocatello, Idaho.\nThe meeting convened at 1:10 P.M., and introductions were performed.\nIt was moved by Starlin and seconded by Kimball that action of members who met at Detroit\nin October b© affirmed and that the ilOO expense allowance for the present meeting b© allo¬\ncated to re-equi'pping the MAEb tape network. The motion won unanimously. ^\nHill reported plans for national NABfi seminars that may be held in summer of I960: live\nnational x-adio networking (Midwest), professional stand axis in educational broadcasting\n(Washington, D.C.), exchange of in-school TV programs (Midwest). He reiterated need of ^\nreplacing equipment of tape network and described recent meetings looking towards possibility\nof tape network b©ihg a part of NBTRC while HAEp would function as a trade association and a\nprofessional association but not as a network •\nIt was moved by Kager and seconded by Rundell that possible transfer of the NAEp taps\nnstwork to the National Educational Television and Radio Center is of vital concern to\nmembers of that when discussions between NAEb asset METRO have been reduced to specifics."
}