{
  "id": "d1743-2",
  "text": "- 3 -\nDUNHAM ANSWERS McCARTY\nIn a rebuttal to H.B. McCarty*s guestitorial last month, Franklin Dunham, radio\nchief for the U.S. Office of Education, has this to say:\n\"I read your Guestitorial in the current issue of the NAEB NEWS-LETTER. It\nis in your usual best style and is just what the doctor ordered-—and what the\ncountry needs*\" .\n\"Candidly, I don’t believe anyone*s foot is on the brake. I rather think\nwe are actually in second speed going up hill in a 1939 car which is doing\nvery well after 8 years of abnormally tough going in a very much confused\ncountry—and world* Like you, I would like to see us get a new 1948 model*\nI don't think it will be so changed that we will have to learn to operate\nit all over again* Personally, I don't care very much whether it will go\n80 miles an hour. I would settle for 40 and have it get me there* Perhaps\nit is time now to revise our ideas on how to sell the FM package. As old\nDoc Winship used to say 'Never get in a rut for all ruts run down hill'.\"\nFIQRELLQ LaGUARDIA\nThe final chimes have sounded for a fighter for the cause of public service,\nbroadcasting. \"The Mayor\" knew the importance of an uncontrolled radio and put his\nconvictions into action as he vigorously defended New York City's VNYC against those\nwho would prostitute its use.\nTo be remembered is his advice? \"Radio is all the American people have left.\nWe don't have the movies or the press. So the people had better hold onto to radio.\n'.•/BAA OPENS AIR SCHOOL\nThe Purdue University School of the Air begins its fourth year of organized\nschool broadcasts with 15 programs for elementary and high school grades. John\nHenderson, WBAA educational supervisor, who has handled all School of the Air\nplanning for the past three years, added two staff members, Eden Gray and Carole\nCarlson, to assist with the increased schedule this year«\nDramatic programs, using elementary school, high school, and college talent,\nare innovations this year. Auditions for very young actors and actresses brought\na deluge of youngsters to the station. Among the programs to be dramatized are*\n\"Lady Storyteller\", \"History Highlights\", \"Mathematics School\", and \"Your Indiana\".\nALABAMA COLLEGE PUBLISHES SCRIPTS >\nAlabama College for Women at Montevallo, has published a book of script digests\nfrom its \"Feature Page\" series of broadcasts over WAPI and stations of the Alabama\nNetwork between October 1945 and April 1947* Miss Maryland wilaflHa radio director\nfor the College, did the editing, and state history is the central thread around\nwhich the series is motivated. This is a good example of the unique type of pro¬\ngrams an institution can provide in the public interest\".\nALABAMA PROGRAMS n , .....\nThe University of Alabama will open its broadcasting week each ounday with the\n\"Alabama Roundtable\"—a half-hour discussion of state problems by experts. Week¬\ndays from 1:45-2:00 P.M. a variety of programs is to be offered? Monday—\"For the\nHornetHome Econ.)? Tuesday, \"The Peter T. Allens\" (FTA); Wednesday, \"Little Concerts\n(University Music Dept.); Thursday, \"Your University\"; Friday, \"Life and Health .\nAll feature state interest, according to Graydon Ausmus* report.\nWUOA are the call letters assigned to the University of Alabama for the\nprojected FM station on the campus.\nHAVE YOU MADE YOUR RESERVATIONS FOR THE NAEB CONVENTION\nIN CHICAGO? DON'T MISS ITS OCTOBER 25-26-27, 1947"
}