{
  "id": "d1743-6",
  "text": "- 7 -\nWE'LL SEE YGU IN CHICAGO\nThis month our annual fall meeting will be held in Chicago. The program\nis outlined on the next sheet. George Jennings and WBEZ will serve as member-hosts\nat this Convention which immediately precedes the 11th Annual School Broadcast\nConference.\nA top-notch program has been arranged----and we have considerable Association\nbusiness to take care of. To make the meeting a success a really big attendance\nis needed. Early reports indicate that this will be the largest NAEB meeting ever\nheld-even surpassing the record turn-out at Ohio l$st May. Several old-timers\nare bringing with them younger staff members. This is a splendid device for\nstrengthening a station staff by giving a better understanding of the over-all\npicture.\nLook at the program. Everyone should hear those speakers and become personally\nacquainted with our guests and fellow members. It still isn’t too late to make\nhotel reservations. Writes Sheraton Hotel (formerly Continental), 505 N. Michigan\nAvenue, Chicago, Illinois. This is the convention hotel where the meetings will\nbe held.\nHere you have an opportunity to attend two conventions on one trip. Take itS\nWe’ll see you in Chicagol\nKFKU PLANS EXPANSION\nDean Frank T.\"Stockton of the Extension Division at the University of Kansas,\nreports that efforts are being made to expand the operations of KFKU to full-time.\nHe says, \"I am anxious to make KFKU a strong and worthy member of the educational\nbroadcasting group.”\nMiss Mildred Seaman is program director for the station. Additional personnel\nis sought to help with the enlarged activities. Harold Ingham, who is known to\nmany NAEBers, is now engaged full-time in other activities.\nHITS AND MISSES\nThe \"curfew\" on crime shows on the air before 8*30 P.M. may keep the little\ndears up an hour longer to hear their \"favorite\" programs.\nBehind the 8-Ball may be a good description of the plight of \"kid-programs\"\nproducers if they adhere to Item $8 of the proposed NAB code which says? \"No\nprogram or episode should contain material, or end with an incident which will\ncreate in the child’s mind morbid suspense or other harmful nervous reactions.\"\nThings are slipping. It was recently noted that one issue of a well-known\n\"trade publication\" neglected to wave the \"freedom of speech\" headlinesl\nWhy, if the Blue Book is all wrong as its critics imply, do broadcasters con¬\ntinue to point proudly to their new activities along the lines recommended in this\nmuch maligned opus?\n\"E.Q.\"—that's the new enthusiasm quotient you'll be hearing about. Gallup\nradio surveys now under way will sample the \"qualitative aspects\" of radio to find\nthe EQ for radio performers.\nIntrospection is a good thing. If \"American Radio\" would stop arm v/renching\nthrough patting itself on the back and do a bit of spade work in the good earth of\nbasic values, the listeners-as well as the industry-would profit thereby.\nSP0TS-BEF0RE-Y0UR-EYES DEPARTMENT: Word has leaked out that more than 26,000,000\nspot announcements were broadcast last year by American radio stations. We thought\nit must be even more than thatl"
}