{
  "id": "d473-16",
  "text": "2:30- 3:30 p.m. . . AND A LITTLE CHILD SHALL LEAD THEM\".\nDR PETER B. NEUBAUER, Director, Council Child De¬\nvelopment Center, discusses a child's problem with\npsychologist, social worker and teacher.\n3:30- 3:55 p.m. \"STUYVESANT TOWN MAKES A SCHOOL — THE\nSTORY OF PS 40\". DR. FRED SHAW, Fir.st PTA Presi¬\ndent; MRS. NORMAN HALPER, Second PTA President;\nMRS. OLGA SPELMAN, Principal; MRS. DAVID ELROFF.\n5:00- 5:15p.m. \"TEACHING DOCTORS\" (Part I). DR. JOHN MUL-\nHOLLAND, Professor of Surgery; DR. SAMUEL STAND¬\nARD, Associate Professor of Clinical Surgery, NYU-\nBellevue Medical School.\n5:15- 5:30 p.m. \"AN EDUCATION FOR THE A RTIST\". LIONEL TRILL¬\nING, Professor of English, Columbia University.\n8:30- 9:00 p.m. UNIVERSITY OF CHICAGO ROUNDTABLE.\n9:00- 9:45 p.m. \"TEACHING DOCTORS\" (Part II). Seminar meeting\nwith DR. HARRY MOST Professor of Preventive Medi¬\ncine, NYU-Bellevue Medical School, and students.\n9:45- 9:55 p.m. \"THE EDUCATIONAL INSTITUTE — A PROGRESS\nREPORT\". JACOB JACOWITZ, Education Editor, World-\nTelegram and Sun.\n10:00-10:30 p.m. \"PUBLIC SCHOOLS — NEW YORK CITY STYLE\"\n(Part II). A dramatic presentation of the public school\nsystem — what it is and how it works. By JOHN\nBENJAMIN.\n10:30-10:55 p.m. \"PRIVATE SCHOOLS IN NEW YORK CITY\". Parent's\nLeague Panel with VIRGILIA PETERSEN, Moderator of\n\"Author Meets the Critic\"; ALFRED DELAIAGRE JR.,\nProducer of \"Voice of the Turtle\"; BEATRICE STRAIGHT;\nGOVERNEUR PAULDING, Associate Editor of The Re¬\nporter Magazine.\n8:00- 8:40 a\n10:30-10:55 a\n11:30-11:55 a.m.\n2:00- 2:15 p.m.\n2:15- 2:30 p.m.\n2:30- 2:45 p.m.\n\"Museums as a Part of the Education Process\".\n\"EDUCATION FOR HEALTH\". DR. LEONA BAUM¬\nGARTNER, Commissioner, Department of Health of\nNew York City talks with DR. I. H. GOLDBERGER,\nDirector, Health Education, NYC Board of Education\nand DR. IAGO GALDSTON, Executive Secretary, Medical\nInformation Bureau, New York Academy of Medicine.\nFOR THE LADIES. MISS RHODA POWER, one of the\nSenior Script Writers for Schools Broadcasting of the\nBritish Broadcasting Corporation interviewed by PETER\nGRAVINA.\nCOURAGE — ITS ROOTS IN FAMILY AND COM-\nUNITY LIVING\". Child Study Association conference\nuii parent education. DR. GUNNAR DYBWAD. Director;\nMRS. CLARENCE WHITEHILL, Chairman of the Board;\nMRS. GEORGE VAN TRUMP BURGESS, Vice-President.\n\"THE VANISHING REPORT CARD — LET'S TALK IT\nOVER\". DR. WILLIAM E. YOUNG, Director, Elementary\nEducation, New York State Education Department, Mod¬\nerator; DR. MYRA deH. WOODRUFF, Chief of Bureau,\nChild Development and Parent Education, State Edu¬\ncation Department; HORACE M. HAGAR, Director, Ele¬\nmentary Education, Amsterdam Public Schools; FLOR¬\nENCE D. MacNISH fifth grade teacher, Roeliff Jansen\nCentral School, Hillsdale; MRS. CHARLES S. WALKER,\nVice President, New York State Congress of Parents\nand Teachers; MARY E. DARDESS, Principal, Chatham\nHigh School; CLAYTON E. ROSE, Director, Public Re¬\nlations, New York State Teachers Association.\nSCIENCE AT OUR DOOR. BOARD OF EDUCATION.\nLET'S LOOK AT THE NEWS. BOARD OF EDUCATION.\n\"EDUCATION FOR LEISURE\". MARK McCLOSKY, Di¬\nrector, Bureau of Community Education, NYC Board of\nEducation.\n\"BBC: BROADCASTS TO SCHOOLS\". JOHN SCUPHAM,\nHead, School Broadcasting, British Broadcasting Cor¬\nporation.\n\"DOES EDUCATION TODAY MAKE EDUCATION FOR\nFREEDOM?\" MILLICENT MacINTOSH. President, Barn¬\nard College, introduced by DR. THURSTON J. DAVIES,\nDirector, Town Hall."
}