{
  "id": "d1368-0",
  "text": "r\nr\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nVOL. 28, NO. 5 MAY, 1963\nRosenheim to Keynote IERT\nProfessor Edward Rosenheim of the University of Chicago\nwill be the keynote speaker at the 1963 Institute for Education\nby Radio-Television, according to Ray Stanley, acting direc¬\ntor of the IERT. June 12-14 are the dates of the 33rd IERT,\nwhich will convene this year at the Nationwide Inn, 4101 W.\nBroad Street, Columbus, Ohio.\nThis year’s theme is “The Program: the Heart of Broad¬\ncasting.” Scheduled for discussion are changing needs and\nmotives, methods and techniques, the outlook and problems\nof instructional as well as general-interest program policies,\nand the relationship of personnel to programs. Other sessions\nwill be devoted to the status of Federal ETV legislation,\npreparation of people for careers in broadcasting, technological\nadvances in fields relating to program development, and state\nnetwork commission planning and problems.\nConferees will have an opportunity to see what others are\ndoing, based on the Ohio State awards to be announced June\n12. A complete schedule of projections will be included in\nthe registration packets.\nAdvance registrants can save $2 by sending a check for $23\nnow. This includes eight conference sessions, the annual din¬\nner, the IERT luncheon and the NAEB luncheon. Make\ncheck payable to the IERT, 2470 N. Star Road, Columbus 21,\nOhio.\nAdvance Nationwide Inn reservations will be accepted until\nJune 5. Uniform rates for the meeting are $8 single, $12\ndouble, or dormitory-type accommodations (three to a room)\nat $4.50 each.\nConference registration begins at 9 a.m. June 12. An ad¬\nvance registrant may pick up his book of tickets to all events,\nhis badge, and the conference program at that time. The con¬\nference fee will be $25 if paid June 12-14.\nNAEB Washington Has New Zone Number\nThe postal zone number for the NAEB office in Washington\nhas been changed from 6 to 36. The entire address is: 1346\nConnecticut Avenue, N.W., Washington 36, D.C.\nNAEB's Sudan Contract Extended\nNAEB’s two-year contract with the Agency for International\nDevelopment, scheduled to end this month, has been extended\nby AID until June of 1964. The contract provides assistance\nto the Sudan to improve its radio setup.\nWMU Seeks Campus Audio System Info\nWilliam C. Hight, instructor of broadcasting at Western\nMichigan University, writes that his department plans a mul¬\ntiple audio distribution system for the campus. The system\nwill include a series of dormitories, libraries, and classrooms\nlinked together through a network of wires providing six pro¬\ngram channels. At a central location they plan to have a bat¬\ntery of tape recorders capable of 24-hour operation. Via the\nsix channels, they plan to program continuous offerings in\nmusic, foreign languages, and various other educational ma¬\nterials.\nTo aid in plans, they would like information from any other\neducational institutions which have experimented with similar\nsystems. Please write directly to him at Kalamazoo.\nNAEB U+ilizafion Kits Due in Fall\nThe NAEB has received a contract from the U. S. Office of\nEducation for the development of a series of self-contained\ndemonstration kits illustrating effective utilization of instruc¬\ntional broadcasts. The contract provides for the development\nand production of six different kits covering the field of\nutilization; the making of multiple copies of these kits; the\nestablishment of a library service through which the kits can\nbe obtained; and a study of the use and results of this service.\nThis contract is an outgrowth of a feasibility study car¬\nried out under the auspices of the NAEB Utilization Commit¬\ntee and has been under consideration for the past two years.\nDr. Clair R. Tettemer, director of school programs for\nKTCA-TV, who directed the feasibility study, has been ap¬\npointed project director. Mrs. Dee Wolfarth is the assistant\nproject director and director of the library service. An ad¬\nvisory committee consisting of Elaine Afton, Charles Hettin¬\nger, Arlene McKellar, Wanda Mitchell, and Lewis Rhodes\nhas been appointed to work with the director. This committee\nmet in Chicago in March to draw up final plans for the kit\nmaterials.\nThe plans now call for these kits to be available by the fall\nof 1963. If you would like additional information about this\nservice, write to Dr. Clair R. Tettemer, NAEB Utilization\nProject, c/o KTCA-TV, 1640 Como Avenue, St. Paul 13,\nMinnesota.\nNAEB Samoan Project Moves Along\nHighlights of the NAEB Samoan Project to date are:\n9 December 22, 1962—Contract signed with Government of\nAmerican Samoa in connection with the installation of ETV\nin Somoa.\n• January, 1963—Exploratory trip by key NAEB personnel.\n• March, 1963—Henry Cronin, chief operating engineer for\nthe NAEB project, arrived in Samoa with his family, and is\nsupervising necessary preliminary construction.\n• About July 1, 1963—Four more NAEB technicians to join\nCronin. Recruitment is now under way for the entire staff\nfor later in the year. Project Engineer William Kessler has\nbeen busy with the design engineers and the engineering spe¬\ncifications are nearly completed and ready for bids.\nHarley Appoints Radio Seminar Committee\nNAEB President William G. Harley has appointed Cliff\nEblen, WHA, University of Wisconsin, as chairman of a\ncommittee to determine whether there should be a summer\nradio seminar this year and, if so, what its nature should be.\nOther members of the committee are Albert P. Fredette,\nWAMC, Albany Medical College; Lawrence Frymire, FCC\nstaff; Leonard Press, WBKY, University of Kentucky; Jer-\nrold Sandler, WUOM, University of Michigan; and Jack\nSummer field, WRVR, New York City. The idea of such a\nseminar received support at the recent regional meetings of\nNAEB Regions II and III.\n1"
}