{
  "id": "d1368-2",
  "text": "require some careful preparation in terms of rationale and\nmanner of billing. It was also pointed out that it would also\nhave to be a graduated fee structure.\nNews Notes\nPERSONNEL\n^ Dr. Philip Lewis has been promoted to the post of direc¬\ntor, Bureau of Research, Development and Special Projects,\nfor the Chicago Board of Education.\n^ E. G. Burrows, radio station manager at the University of\nMichigan, will narrate the world premiere of “Still Are New\nWorlds,” to be performed by the Philadelphia Orchestra and\nthe University Choral Union May 10 as part of the Ann Arbor\nMay Festival. Thor Johnson will conduct the orchestra, and\nGrant Johannesen will appear on the program as guest artist.\n^ Parker Wheatley, director of public affairs for commercial\nKMOX-TV, St. Louis, was honored by the St. Louis Argus\nlast month for “producing the calibre of programing at his\nstation that has had a wholesome impact on the total com¬\nmunity. Through the intelligent and judicious use of the in¬\nfluential medium of television, he is aiding the development\nof a better community through fair and objective presenta¬\ntions.” Wheatley, an Individual Member of the NAEB, was\nformerly in educational broadcasting in Boston and Chicago.\n^ Harold D. Gorsuch has been named director of engineering\nand technical services for Philadelphia-area stations WHYY-\nTV, WUHY-TV, and WUHY-FM. For the past eight years\nhe has been chief engineer for WOSU-TV, Ohio State Uni¬\nversity.\n^ Frank Kahn has been appointed lecturer and broadcast pro¬\nduction supervisor at Queens College of the City University\nof New York. His previous experience was in commercial and\neducational broadcasting and in market research.\n^ William L. Utter, program manager of WMUB-TV, Miami\nUniversity (Ohio), has received a year’s leave to accept a\none-year residency in the Graduate Institute for Mass Com¬\nmunications at Ohio State University. The year’s leave begins\nJuly 1.\nGENERAL\nUniversity of Houston’s KUHT-TV, first ETV station,\nwill observe its 10th anniversary on May 25.\n^ WOUB-TV, Ohio University, is enjoying aid from a local\nbookstore, Logan’s, which has offered to print the station’s\nprogram announcements without charge.\n^ As part of its expanding program of ETV utilization, the\nUniversity of Colorado has expanded its CCTV facilities to\ninclude the Denver extension center, linked to the Boulder\ncampus by a 28-mile microwave relay. Funds for the link\nwere authorized following a special ETV presentation in the\nfall fed from the. campus over a special microwave link to\nthe meeting of the university’s board of regents in Denver.\nThe system includes audio talk-back. Three courses are of¬\nfered via TV, with 452 students enrolled.\n^ KVIE, Sacramento, has begun telecasting the weekly press\nconferences of Governor Edmund G. Brown and the leaders\nof the California Senate and Assembly. KVIE is the first TV\nstation to carry the sessions on a regular basis.\n^ KSLH-FM staffers have hit the press recently. The St.\nLouis FM Guide carried an anniversary story by Ed Rothaar\nas the station began its fourteenth year of broadcasting on\nApril 13. The January issue of Audiovisual Instruction con¬\ntained an article by Ruth Cornelius, called “Radio, Impartial\nbut Personal.”\n^ Delivery is scheduled for this month for the transmitter\nfor WEIQ, Mobile, Alabama’s fifth ETV station.\n^ On May 6, KLRN-TV, Central Texas ETV station, will\nbegin broadcasting the “Operation Alphabet” series developed\nby the Philadelphia Public Schools to combat illiteracy. There\nare an estimated 50,000 functional illiterates living within the\nSan Antonio-Austin area.\n^ The Philadelphia board of education and WHYY jointly\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W., Washington 36, D. C. Phone 667-6000 Area Code 202.\nconducted an ETV workshop in April to acquaint administra¬\ntors and teachers with ETV. This was in preparation for the\nChannel 12 daytime instructional programing due to begin in\nSeptember.\n^ In line with scheduled hearings on legislative bills to es¬\ntablish a statewide ETV network, the front panel of KUON-\nTV’s program bulletin in April was devoted to “What Is\nETV ?” Listed, with illustrations, were: classroom instruction,\nadult education, teacher education, public affairs programs,\ncultural programs, and agricultural information.\n^ The Television Information Office of the NAB has an¬\nnounced seven new TV station sponsors—including noncom¬\nmercial WMUB, Miami University station at Oxford, Ohio.\ny “A Portrait of Mexico” has been accepted for showing at\nthe American Film Festival in New York May 1 to 4. The\ncolor film, by Harry Atwood, shows a University of Arizona\nclass touring Mexico on a history study tour with Dr. Rus¬\nsell C. Ewing.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Mrs. Jacqueline Swain, Placement Serv¬\nice, at the NAEB office in Washington.)\nMay I—Creative, imaginative young man desires position as\nproducer-director. M.A. in speech and dramatic arts\nJune 1963. Extensive experience in metropolitan ETV\nstation. Age 26. East or West Coast preferred, other\nlocations considered; salary not less than $6,000.\nMay 2—Producer-director position desired to gain essential\nexperience in ETV. History and political science majors.\nHas served 3 years at large ETV community station in\nfund raising, publicity, and executive producer capaci¬\nties; previous experience includes administrative, super¬\nvisory, civic, and legislative work. Male, age 34, mar¬\nried. Location open, though access to M.A. and Ph.D\ninstitution preferred; salary $5,500 up.\nMay 3—Married man, 39 years old, expects to receive M.A. in\nspeech (radio-TV) in August and desires to teach in\ncollege radio-television department, or work in ETV;\nwould consider teaching one or two general speech\ncourses. Experience: 10 years in collegiate and com¬\nmercial radio; 2 years as graduate assistant to instruc¬\ntor of radio and TV courses; presently supervising col¬\nlegiate carrier-current station. Location and salary\nopen.\nMay 4—ETV producer-director with 8 years experience in edu¬\ncational and commercial TV seeks position with a fu¬\nture; wants to develop full potentials of the job and self\nas broadcaster, instructor, or combination. M.A. in TV\nbroadcasting, plus general secondary teaching creden¬\ntial in speech-drama, radio-TV, and electronics. Married,\nfamily, age 29, military service completed. Location in\nthe eleven western states; $6,500 minimum salary.\nMay 5—Single female university graduate with B.A. in speech\nplus 7 years experience in TV field, interested in pro¬\nduction position. Acquainted with all phases of pro¬\nduction; experienced as talent for children's and wo¬\nmen's programs as well as production assistant; also has\nhad secretarial and public relations experience. Prefers\nEast, but will consider other locations; salary, $6,000\nminimum.\nMay 6—Dedicated broadcaster seeks ETV management or pro¬\nduction position with college or school district, open or\nclosed-circuit; welcomes teaching or research duties.\nM.S. in communications; completing course work for\nPh.D. Four years commercial broadcasting; 3 years\nschool district radio-TV; 2 years state ETV network.\nMale, 28, family. Prefers Western states; salary open.\nMay 7—Male, 30, married, completing Ph.D. in communica¬\ntions in education (ETV) desires opportunity with ETV\nstation or with school system utilizing ETV; programing,\nproduction, administration. Prefers N. Y., L. I., N. J., or\nConn. Will consider other locations if offers prove suf¬\nficiently attractive. Salary, $7,200 yearly minimum.\nMay 8—June college graduate desires position in educational\nbroadcasting. Will obtain a liberal arts degree with\nenough education \"courses to qualify to teach. Experi¬\nence gained in Ohio University's radio and TV stations\nMAY, 1963"
}