{
  "id": "d1368-3",
  "text": "in script writing, production, engineering, announcing,\nand teaching lessons.\nMay 9—Experienced broadcast executive seeks growth oppor¬\ntunity with new or established ETV-Radio. Graduate en¬\ngineer. Nearly 20 years experience all phases broadcast¬\ning with 50% of this time devoted to radio broadcast¬\ning and management. Presently employed overseas.\nAvailable late summer.\nMay 10—Single male, 23, draft exempt, interested in announcer-\ndirector position. B.A. in radio-TV and a good back¬\nground in journalism, music, and dramatics. Experience\nconsists of DJ work and news writing and broadcasting\non university stations; has worked as cameraman, A.D.,\nand floor director on both educational and commercial\nTV; also one year's experience directing on GCTV for\nthe university. Prefers West or Midwest, but will con¬\nsider all positions if there is good chance for advance¬\nment. Available in September.\nMay I I—Television and radio producer-director; prefers teach¬\ning and/or production. M.S. in speech (radio-TV); spent\npast year working on Ph.D. Four years manager of edu¬\ncational FM station; 2 years producer-director ETV.\nMarried, age 30, 5 children. Will consider any section\nof country.\nMay 12—Man, 43, commercial broadcast general manager,\nseeks new assignment in educational broadcasting and\nteaching. Will teach and assist in working out well-\nrounded broadcast curriculum geared to today's needs.\nM.S. in journalism from top university. Has 14 years\ncommercial broadcast experience, 9 as general manager.\nKnows commercial field as well as function of educa¬\ntional broadcasting. Will relocate anywhere, but pre¬\nfers West Coast; minimum salary, $10,400 plus expenses.\nMay 13—Male, 26, MAT in English from Wesleyan University,\nwith 4 years teaching experience, desires position leading\nto work as a producer. Free to relocate; salary open.\nMay 14—Seasoned administrator, with 20 years experience\nradio-TV all phases, available for top level job with full\nmanagement responsibility. Harvard MBA degree. Man¬\nagement and technical background tremendous value\nto state ETV network or top college or university station.\nMay 15—Television engineer and instructor with over 19 years\nexperience in electronics. B.S. degree. Designed ETV\nclosed-circuit and important commercial TV studio in¬\nstallations. Experience in ETV installation, operation,\nmaintenance, and repair, also in teaching technical TV\nand related subjects. Prepared material for FCC appli¬\ncations, purchased TV equipment for station construc¬\ntion and for day-to-day maintenance. Considerable suc¬\ncess in training students as technical aids. Prefers New\nYork metropolitan or nearby area.\nMay 16—Ambitious young graduate seeks challenging position\nas director, assistant director. B.A., radio-TV. Unique ex¬\nperience, willing to travel and relocate. Single, male.\nWill accept positions offering at least $4,700.\nMay 17—Male, age 29, married, seeks producer-director posi¬\ntion. B.A. English literature, Harvard. Location prefer¬\nence: New England or Pacific Northwest. Salary flexible\ndepending on location; $9,000 minimum.\nMay 18—Teaching and production opportunity desired by ma¬\nture young man with M.A. in communications. Desires\nposition as member of radio-TV faculty with some pro¬\nduction duties if possible. Extensive commercial and\neducational radio and TV experience. Recent experience\nas radio program director and ETV producer-director.\nMarried; available June 1963. Location open.\nMay 19—Producer-director. B.S.E. speech and English. Five\nyears commercial and 2 years N. Y. military TV experi¬\nence; all phases production experience. Military obliga¬\ntion complete. Location open; minimum salary $6,000.\nMay 20—ETV-Radio production or management and teaching.\nM.S. in TV. Commercial radio-TV experience; one year\nas university instructor radio-TV and program director\nER. Location open; salary $8,500.\nMay 21—TV-theatre-speech graduate seeks challenging produc¬\ntion work in ETV: direction, production assistant, floor\nmanager, or other creative position. Teaching. experience\nplus college TV and theatre experience. Available June\n1963. Location and salary open.\nMay 22—Experienced ETV broadcaster seeks position in the\nareas of children's programing (in or out of school)\nand/or studio to classroom, and studio to public coor¬\ndination. M.A. in communications. Six years experience\nin ETV as producer-director and classroom receiving\nteacher. Background includes curriculum development,\nwriting, all phases of production, and permissions and\ncopyright clearances. Preview material from taped series\navailable. Relocate in Northeast or upper Midwest; sal¬\nary $8,400.\nMay 23—IERT awards-winning producer-director with many pro¬\ngrams now on NAEB network series desires ETV posi¬\ntion of at least 48 weeks in administration, programing,\nor production, or ER administration. M.A. in radio-TV;\n7 years of educational, commercial, military broadcast¬\ning. Permanent teacher's certificate. More interested in\nchallenging position than location. Male, single, 29.\nMay 24—Presently chief administrative officer for state ETV\ncommission; formerly general manager radio-TV depart¬\nment at major state university. Designed and conducted\nstudy leading to blueprint for statewide network. Ten\nyears experience in all phases of ETV production, plan¬\nning, and administration at all levels of education. Avail¬\nable July I, 1963. Prefers West Coast, tropical climates,\nor overseas. . , .\nMay 25—Creative young man desires good position in ER\nproduction. B.A., radio-TV. Five years experience with\nleading ER station in midwest and with commercial pro¬\nduction firm. Good technical background. Married, age\n23. Location: Mid to far west but will consider others.\nMinimum salary $6,000.\nMay 26—Single man, 25, with B.A. m literature and music plus\nsupplementary courses in science and education, de¬\nsires position in programing or script writing. Preferable\nlocation New York, although not a major consideration.\nSalary, $5,000 minimum.\nPOSITIONS AVAILABLE\n(In order to be considered by these institutions, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues at the time of in¬\nquiry.)\nMA-I—Production manager. Responsible to the program man¬\nager for all production aspects at the facility. May\nhave to direct initial programs. M.A. required. Eastern\nstate ETV network; salary maximum for 12 months $7,500;\nopen July or August 1963.\nMA-2_Producer-director. M.A. required. Eastern state ETV\nnetwork; salary maximum for 12 months $6,000; open\nSeptember 1963.\nMA-3—Graphics specialist. Responsible for all artwork tor\nlocally originated ETV programs (slides, graphics, etc.).\nEastern state ETV network; approximate salary $5,000;\nopen September 1963.\nMA-4—Continuity writer. College graduate in liberal arts\nwith journalism or writing experience preferred. Practical\nworking experience at a TV or radio station as a con¬\ntinuity writer or traffic-continuity position is desirable.\nCollege training in TV studio operations and related TV\nwork is required. Western community TV station.\nMA-5—Production and teaching position in communications\ndepartment, man under forty. College teaching experi¬\nence and commercial broadcasting experience desired,\nor will consider college teaching and cinematography\nexperience. M.A. required. Far West university; minimum\n$7,250; Chairmanship open with salary of $7,800; po¬\nsition available July I. _\nMA-6—Assistant professor of speech in department of English\nand Speech. Teaching load is 12 hours per quarter, or\nits equivalent in production activities. Appointee should\nbe highly qualified in television direction and produc¬\ntion, and should have a background in commercial, and/or\neducational station experience. Midwest university; sal¬\nary, $7,000 minimum for nine months.\nMA-7—Instructor in radio-television education area. Respon¬\nsible for teaching courses in radio and TV involving\ntheory, operation, and techniques. Previous practical or\ncommercial radio-TV experience with a knowledge and\nunderstanding of AM-FM radio and TV operations.\nM.A. in communications with an emphasis on the radio\nand TV media. Midwest university; salary contingent up¬\non the education and experience of the applicant; open\nSeptember 1963.\n4\nNEWSLETTER"
}