{
  "id": "d283-106",
  "text": "Commentss\nBusiness sessions too cut and dried, special paper and project reports\nexcellent, sessions should be better timed, These are a few of the\nccaanents made in this section, Many expressed regret at not being able\nto stay far Mcluhsn-Ruhe talk due to travel r© ser vations o One man who\nwas to stay said that wthe MBlwhan-Rube session was worth the price\noFthe whole convention 0 n\n3o WHAT SUGGESTIONS WOUID YOU MAKE FOR IMPROVING FUTURE CONFERENCES?\nAlthough eleven didnflt answer, most everyone who did agreed that better\nspeakers would be a definite iaprovemento MsLuhan and Ruhe were specifi¬\ncally mentioned as being the type of speaker members would like to hear.\nIt was suggested that these two men speak in Detroit — on the FIRST day,\nnot the last,\nA few people suggested a shorter convention hut mare people it seems would\nprefer mare tiro. Thus, a more relaxed atmosphere could’ be maintained\nthroughout the entire convention\nNo concurrent sessions, avoid late evening sessions, mare consultant-table\nsessions, mere Auditioning time etc, Also, it was suggested that the\nHeadquarters people themselves available more frequently instead of\nbeing in constant meetingso An ia-school meeting was requested, newcomers\nfriinwifl be mere cordially received and so fertho\n4o WHICH DO YOU THINK ARE THE MOST EFFECTIVE?\n6J national conference 2J Regional conference 2 Undecided\n(The following paragraph is from last year8 a report 0 The feelings regarding\n+.m« question are exactly the same as they were one year ago,}\nnAs you can see, the annual convention has quite an edge over the regional\nconferenceo However, in nearly every instance, the person selecting one\nor another qualified his choice by saying that he thought it every bit as\nessential to have both, ifi^osaiblso\"\n50 HOW CAN WE MAKE THE EXPERIENCES OF THIS CONFERENCE MORE MEANINGFUL TO (TO\nORGANIZATIONS AND COMMBN1TIES?\nAs was the case last year, everyone stressed the publishing of the various\nreports and transcripts, Some suggested that this be done on tape and\ndistributed* Again soma commented on the need for more publicity before and\nafter the Convention, Better attendance was another point brought up. These\nwere all mentioned at last year's meeting too,\n„ pH) YOU FEEL PERSONALLY INVOLVED IN THE CONFERENCE?\n3O Yes j£ No 2 Didn't Answer\nThose who didn't feel personally involved in the convention were usually\nnewcomers, Che man ccnwented that it was HIS fault. He said as he was a\nnewcomer he should have tried harder.® I think it was up to the old-timers\nto all newcomers welcome ,, not up tic* the newcomers to make themselves\nwelcome.\n5<"
}