{
  "id": "d283-130",
  "text": "WUOA-FM-\nVV 91.7 ON YOUR FM DIAL * T *\n\"THE VOICE OF THE UNIVERSITY OF ALABAMA\"\nEXTENSION DIVISION\nUNIVERSITY OF ALABAMA\nThursday\nUNIVERSITY. ALABAMA\nBOX 2002\nR\nA\nD\nI\nO\nB\nR\nO\nA\nD\nC\nA\nS\nT\nI\nN\nG\nS\nE\nR\nV\nI\nc\nE\nS\nDear Frank,\nThank you for your confidential note of Nov. 18. If at any time you\nfeel like writing or calling me confidentially or otherwise and don't\ndo it, I shall feel that I've lost a friend—and you Hasbai need not\napologize or feel timid about doing so. Damn it, speak your piece at\nany time and all times and no feelings will get hurt. I'll get my\nfeelings hurt if you don't.\nI agree with you 100$ that we should have had a meeting of our group\nprior to the meeting with Fletcher and argued with Bob Hudsons to a\"\npoint of annoying him a bit that it should be done* however, he insisted\nthat such a meeting would damage the deal rather than help. Si, George”\nand Dick agreed that he was right, so I did not pursue the matter\nfurther. I bow to the superior judgement of that group, though I still\nthink we should have had the meeting.\nYou may be right about my inviting Dunn and not other members of the\nboard to a post-Fletcher meeting session. I thoughtl made the reason\nclear—Dunn represents, whether we care to admit it or not, a minority\nfaction on the Board and represents a down-t^-earth attitude of those\npeople which we need in all deliberations. Outside of the one or two\nbad letters he has written, Dunn's work on the Board has been positive—\nand one of the reasons he wrote bad letters was that he was not in\nenough to keep up with the thinking of the group. Pulling\nhim in will help us avoid those bad moments created by him. I still\nthink I'm right in asking him to come. I still appreciate your\nquestioning my wisdom in so doing, however, for such questioning will\nkeep me thinking hard before making a decision. Incidentally, I\nchecked this idea with Dick and Si before inviting him. Neither\nexpressed great enthusiasm for it but said if I thought it the thing\nto do, to go ahead.\nAs to Ludwig, that is an experiment and the idea grew out of the Friday\nnight meeting of the Board in Minn. Several people there felt that we\nshould have had \"someone like Merritt\"present to do what I propose for\nthe Chicago meeting. It may be a flopperoo—but we will have learned\nsomething from the experience.\nI will correct any doubt about the meeting of our group which is to\nfollow the meeting with Fletcher. Your raising the spat question makes\nme wonder at my ability to communicate. I did indicate that the meeting\nof our NAEB group will be following the meeting with Fletcher—which\nall but Dunn and Dudwig will attend--and assumed that we could agree\nat the time just where and when we'd get toxgethere I've told Dunn\nand Ludwig that we'd probably be free about U:00 P.M. xindx and\nindicated in the mimeo. letter to the executive committee and the\ncommittee of Five that we'd be in session the evening of the i|th.\nand the morning of the 5 th. I expect to leave shortly after noon\non the 5th. and assumed that understood* that noon was the deadline.\nMEMBER OF NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS"
}