{
  "id": "d283-52",
  "text": "very few indeed of the teacher-training institutions of the nation now offer.or\nhave plans for offering, courses in television and radio utilization as a part\nof their methods and procedures courses for future teachers*\nIt is apparent that, without a great deal of assistance, guidance autT stimu¬\nlation the normal rate at which teacher-training courses will be introduced la\nthe uses of television and radio as instructional tools will be too slow to keep\npace with developments at the production and output end of this chain, '.’here\nhas been great demand, and there have been many requests to the NAEB, from\neducational administrators, classroom teachers and educational broadcasters for\nintensive training sessions in which new methods of presenting subject matter\nby television, radio and other electronic media might be explored. Out of such\nworkshops, and from presently available knowledge, much guidance could be pro¬\nvided for experienced teachers called upon to use this new tool, as well as the\ngrowing number of new teachers entering the field. Unless both these groups, as\nwell as teacher-training institutions, can be assisted promptly on an intensive\nbasis, by example, demonstration and experimentation, conservative patterns and\nconcepts will greatly retard the best uses of these media.\nOut of lack of understanding of the true nature and uses of these media and\ntheir fullest educational potential, come irrational opposition and fear on the\npart of many teachers. Adequate understanding of how there instruments nay be\nused to help teachers in their teaching functions, without displacing th-m, will\ngo far to remove many of the \"blocks\" to the introduction and use cf television\nand radio by education^ s' x\n- ( jJ i\nHI* Collectives, To conduct a series of workshops and seminar; fcypersoimel\ninvolved,and soon tp. be iiT.'oive-^ in the use -si aid-riaoia., -?.;v\nstructional tools for pex'nonvisl who wIiLa. oc tiosux jig others tr» avih use?., so\nthe present limitation*, and weakness en’umeratc4 in Section II absvs might be\nalleviated."
}