{
  "id": "d283-71",
  "text": "2\nbecause tbs status of the agricultural extension editor is firmly established*\nby a long tradition* in his institution. Such expenditures are recognised as\nvalid, and are in fact provided for in Department of Agriculture grants to many\nLand Grant Colleges. Similarly, the NAB (the commercial broadcasting counterpart\nof the NAEB) must limitj its attendance, in spite of the fact that it charges\n£500*00 for two-week seminars in such areas as management and engineering. For\nhere too, travel end conference fbnds are available, and their legitimacy is\nrecognised.\nTeachers who attend such seminars as we offer, however, must as yet frequently\ndo so at their own personal expense, ;Juat as many must pay their own expenses (and\nsome must even use vacation time) to attend NAEB Conventions or Regional meetings*\nThat so many do this is, we feel, a tribute to the NAEB as well as to the devotion\nof such people* The status of both educational broadcasters (including teachers\nin closed circuit installations), and the NAEB itself, is not yet high enough, and\nhas not yet proved itself over a long enough period of time, to seem?© the recogni¬\ntion which leads to availability of funds. We are confident that this will happen,\nand has in fact already happened in many institutions.\nHowever, an additional subsidy would greatly facilitate this development, and\nwould enable us to phase cut gradually the assistance provided for such seminars,\nuntil, in a few years, an increasing number can be self-supporting• The fact that\nthe ^profession** is so new, NAEB efforts are so recent, the individual membership\ncategory so new, and the recognition of the possible values of tele vision and radio\nto all education is as yet so spotty, should not discourage us or surprise us. Out\nthey should illustrate the need for sob© additional outside assistance until the\nstatus visualised for both the instruments and the personnel involved is achieved.\nEach year new broadcast specialists leave the commercial field, many in\nfrustration, to become educational broadcasters. These people, too, need assistance"
}