{
  "id": "d283-95",
  "text": "role as the leader in the birth of a new profession requires at least the\nutmost in responsibility, even though already-existing recognition of its\nrole is a tribute to what it has done so far® How far there is yet to go\nis most apparent only to those in the EOT who are seeking to develop\nnecessary standards in time to meet the need. For this reason, not only\neducators of the United states but also those in such organisations bo\nUNESCO, and other international scholars are being consulted in the gradual\ndevelopment of what we hops will be a sound foundation for what we believe\nwill one day be a recognised, respected profession, policing itself as\nrigorously as the professions of medicine, dentistry or law. The possible\nindirect influences of such a development on the commercial media, as well,\nare obvious.\nIn the request presented herewith, we have attempted to\ndemonstate the responsibility incumbent upon us. Although the NAEB would\nbe the central, coordinating agency in the project proposed, the minds and\ncounsel required^ will be those from all the disciplines which education\njkt _£<jh\nencompasses, as well as (and perhaps principally) ^cooperative efforts-myth\ntefisher-training institutions on whom, eventually, must rest the burden of\ndeveloping in teachers the understandings and skills required to cope with\nthe advantages and strengths ^ as well as the limitationsy>£ electronic\ncommunications instruments as basic core educational instruments.\nAt a meeting December 5*6, 1958 of the HAEB’s Professional\nAdvancement Conmdltee, with the President-elect and the Executive Director,\nan effort was made to develop the steps to be taken in this project. At\nthat time it was felt that, in spite of the steps already taken, considerably\nmore pre-preparation was necessary prior to formalizing our request. It\nrequired careful discussion, for example, with responsible representatives\nof the American Association of Colleges for Teacher Education and other"
}