{
  "id": "d1133-1",
  "text": "NAEB NEV.S LETTER\nAugust 1,1942\n.».Page 2\nKOAC COMPLETES 5KW EQUIPMENT TEST\nMrSo Zelta Rodenwold, Chairman, KOAC Program Staff, writes ”that KOAC\nHAS COMPLETED ITS EQUIPMENT TEST ON 5000 WATSS AND SINCE JUNE 27 HAS\nBEEN ON THE 30-DAY PROGRAM TEST * $E ARE USING A DIRECTIONAL ANTENNA\nTO PROTECT THE TGNGUE POINT NAVAL StaTS ON IN THE NORTHWEST CORNER OF\nTHE STATE «> OuR SIGNAL NOW GETS INTO MORE OREGON TERRITORY THAN ANY\nother Oregon station - and is available to approximately 85 per cent\nOF THE STATE 8 S PQPULATI ON.\"\nSYRACUSE PRESENTS TVtO SUMMER SERIES\n'•Know Your £nemy\" and \"An American Looks at the British Empire” are\nTWO SUMMER SERIES BEING PRODUCED BY THE SYRACUSE UNIVERSITY, ACCORDING\nTO WORD RECEIVED FROM KfiN BaRTLETTo\nIOWA ON MUTUAL AND NBC\nCarl Menzcr tells us that Mutual picked up three programs from the\nIowa campus during the Fine Arts Festival and NBC carried one, On\nJuly II, the Summer Session Symphony Orchestra pressented a concert\nOVER MBS. A WEEK LATER, A PLAY WRITTEN BY Or, MARCUS BaCH, INSTRUCTOR\nIN RELIGION AT IOWA WAS ON THE CIRCUIT AND ON JULY 25, MUTUAL CARRIED\nA PROGRAM BY THE UNIVERSITY CHORUS, N3C8S PROGRAM WAS A CONCERT BY\nthe Summer Session Symphony, on which Dr, Philip Greeley Class, con¬\nductor of the Orchestra snd Head of the Department of Music, received\nthe Mahler Medal of Honor,, Heard the NBC show myself and can say it\nWAS A GOOD ONEo\nMUSIC ON WNVC\nWNYC lists a number of outstanding musical performances for July and\nAugust, including the Symphony Orchestra; New York Philharmonic;\nGoldman Band; City Amateur Symphony Orchestra; Naumserg Memorial\nConcerts; Katherine Bacon; Julliard Summer Festival; and Ernest\nHutcheson; and the Victory ConcertSo\nsky; pay and night for wsut\n”NAEB BULLETIN MIGHT L3KE TO KNOW THAT WSUI HAS BEEN GRANTED ITS LICENSE\nFOR FULL TIME OPERATION WITH 5,000 WATTTS BOTH BAY AND NIGHT, THE DI¬\nRECTIONAL ANTENNA IS EMPLOYED FOR FOR 80TH DAY AND NIGHT, AND THAT\nARRANGEMENT SEEMS TO WORK OUT QUITE SAT ISFACTORY.”\nHOW ABOUT A LITTLE POPE FOR THE NEWS LETTER?\nDO YOU HAVE ANY WORTHWHILE IDEAS, COMMENTS, OR CRITICISMS? WHY NOT\nWRITE SOMETHING FOR THE NAEB NEWS UetTER? WHAT ARE YOU PLANNING FOR\nthe Fall? What are you doing this summer?\n>—SCHOOLEY"
}