{
  "id": "d1133-1",
  "text": "NAEB RESEARCH GRANTS ANNOUNCED\nAwarding of the following research grants by the\nGrant-in-Aid Sub-Committee of the NAEB Research\nCommittee has been announced by Executive Direc¬\ntor Harry J. Skornia:\nFive-hundred dollars to station KUOW, Univer¬\nsity of Washington in Seattle, (1) “to isolate and de¬\nfine those characteristics that are believed to be found\nin a higher degree among opinion leaders than among\nthe population as a whole,” (2) “to design and ex¬\necute questionnaires that will provide a reliable and\nvalid measure of the probable prestige and social in¬\nfluence of a sample of the known audience of KUOW\nas compared to a similar number of respondents ran¬\ndomly sampled from the population as a whole.”\nFour-hundred dollars to the radio and television\ndivision, University of Minnesota, Minneapolis, for\n“a study of the impact of recently inaugurated in¬\nschool television program service on the radio audi¬\nence of the long-established Minnesota School of the\nAir.”\nOne-hundred dollars to R. Edwin Browne, direc¬\ntor, stations KFKU and KANU, University of Kan¬\nsas, Lawrence, for “a study of the attitudes of college\nand university presidents toward educational tele¬\nvision.”\nMEMO FROM THE\nEXECUTIVE DIRECTOR\n—Harry Skornia\nSince so many discussions and plans are at mid¬\npoint, there is less to report at this stage than I would\nwish.\nFollowing .meetings of the entire Board and later\nof the newly combined foundations and permanent\nfinancing committees, we have been drafting and\nredrafting requests and other documents for appro¬\npriate discussion and consideration. As soon as there\nare results to report we shall give them to you.\nUnfortunately this has meant that much of our\ntime has been spent away from the office for meetings\nin Ann Arbor, Chicago, New York and Washington—\nthe latter two several times during the past few\nweeks.\nIn all this discussion, I believe the directions in¬\ndicated for us are increasingly education-oriented in\nthe best sense. The radio and TV which we have as\nour responsibilities are becoming increasingly central\nand indispensable tools of our institutions. This\ncalls for greater knowledge on our part of curricular\nand other problems—and for a broader interest in\neducation as a national problem.\nMuch can be done, and is being done, by founda¬\ntions, industry, labor, and the national educational\ngroups. But, much of what needs doing must be done\nat the local level. Are you, in your position and loca¬\ntion, giving evidence of all the imagination, under¬\nstanding and initiative that our present needs call\nfor? The NAEB is asking such questions about it¬\nself. You may wish to engage in a little of the same\nsort of self-examination, individually.\nIs there any way in which we may help you in\nsuch an effort?\nFinally, numerous workshop, seminar, scholar¬\nship, and grant-in-aid deadlines and announcements\nare in the immediate offing. We hope you follow\nthem all to be sure you are not missing out on the\nmany advantages which the NAEB offers for self-\nhelp and self-improvement at both the institutional\nand individual levels.\n*****\nHans Massaquoi, NAEB Placement Officer and\nNewsletter editor, is resigning this month and will\nenter the Medill School of Journalism, Northwestern\nUniversity, to continue his graduate work. We believe\nthe Newsletter has improved since Hans became edi¬\ntor last spring, and we wish him well in his new pur¬\nsuits. The new Placement Officer and Newsletter\neditor will be Miss Jane Lombard, February graduate\nfrom the College of Journalism and Communications\nat the University of Illinois.\nPUBLICITY AND PUBLIC RELATIONS\n—William Bender, Jr.\nWUOM, University of Michigan\n“The participation in public relations activities by\neducational broadcasters is spotty. In general, com¬\nmunity-type stations exhibit more professionalism in\nPR than the others. The college stations would rank\nsecond . . .”\nThese are some of the conclusions reached in a\nstudy based on the questionnaire sent to you in No¬\nvember 1957. The report, written by Elmer Sulzer of\nIndiana University, will shortly be distributed to all\nNAEB member stations. “The Use of Promotion by\nEducational Broadcasting Stations” will be well worth\nstudying.\n* * * * *\nThe hometown release remains a foundation stone\nof publicity work. Humble though it may be, many\nof us broke into the PR field cranking out home-\n2\nnewsletter"
}