{
  "id": "d1133-2",
  "text": "towners, and the fascination lives on.\nA recurrent problem arises when you are distribu-\nting one story to 50 or 100 hometowns. To economize\non manpower in the PR office you may want to at¬\ntach a list of the names under the covering story.\nStewart Howe at Illinois Institute of Technology\ncautions that this practice is self-defeating.\nQuoth Howe, “Our experiments indicate that when\nthe same material is mailed without the attached list,\nand the names have been inserted onto the release,\nabout 10 times as many publications use the material.\nMuch better results recommend the extra time needed\nto individualize the releases . .\nHe continues, “I am also dubious of a system\nwhich asks the individual to distribute a story about\nhimself to the local press. Many will not know where\nto direct the material, nor how to evaluate the out¬\nlets available; often it leads to waste and duplication;\nand frequently people are hesitant to expose them¬\nselves in the role of seeking personal publicity.”\nOther views on hometowns, anyone?\n* * * * *\nOne of the finest brochures we have seen on a\nbroadcasting operation arrived recently from Japan.\nThis Is NHK gives a pictorial story of the Japan\nBroadcasting Corp. There are sections on Radio, TV,\nInternational Service, Facilities, Surveys. The im-\nportance of broadcasting in Japan is revealed in this\npage 1 statement: “NHK’s total staff numbers 9,314.”\n* * * * *\nKUHT, Houston, sends out form letters to 20\nlocal civic groups, offering to provide speakers for\nillustrated lectures on ETV.\n* * * * 45-\nKen Kager reports an effective seasonal tie-in\nused by KUOW, University of Washington. The sta¬\ntion taped the Council of Churches’ huge Christmas\nconcert Dec. 8 for delayed broadcast Christmas Eve.\nLive audience of 5,000 read about KUOW on the\nprinted program; most churches announced the up¬\ncoming broadcast repeatedly; the press carried stories;\nand the station had a fine broadcast with strong local\ninterest for Christmas Eve.\n* * * * *\nFrom John Sittig: WCBE, Columbus (Ohio)\nBoard of Education, placed an attractive two-color\nbrochure into each child’s grade card envelope. The\nbrochure contained pictures well chosen to reveal\nWCBE’s facilities and operations; the back fold car¬\nried a message from Supt. of Schools to 70,000 homes\nurging parents to tune in.\n* * * * *\nFrom KVSC at Utah State comes this reminder\nfrom Dr. Burrell F. Hansen: Much of your total pub-\nlicity-PR impact simply depends on making existing\nprograms available to the widest possible audience.\nHansen works in cooperation with commercial sta¬\ntions to extend his programs far beyond the range of\nthe school’s, own station. (And he’s got a powerful\nlot of geography to cover out thar, pod'ner!) He re¬\nports stations “very cooperative” and community\ninterest high.\nNETWORK NEWS\n—Bob Underwood\nAs an additional service to network members, we are\nconsidering serving as an ordering agent for any sta¬\ntions wishing to obtain either mailing cases, tape\nboxes or tapes.\nAnyone interested in purchasing such materials\nthrough the network is invited to contact us for fur¬\nther details. There is no obligation to buy simply be¬\ncause you inquire.\nThe mailing cases, which we have made to order,\nmay be obtained for approximately $2 each. The\ntape boxes run about 10c each, and the tapes about\n$2 each. Of course, we would not be able to quote\nfinal prices until we had some indication of the quan¬\ntity needed for each item.\nIf you are interested in this idea, please contact\nme stating your interest in either mailing cases, tape\nboxes, tapes or all or any combination of the three.\nWe will be pleased to take it from there. I look for¬\nward to hearing from you.\nPlease do not forget the tape returns.\nRADIO-TV PLACEMENT\nIMPROVES AT U. OF I.\nA notable upswing in radio-television job listings since\n1956 was reported by the Placement Service of the\nUniversity of Illinois College of Journalism and Com¬\nmunications.\nIn 1956, the service listed 42 radio-TV jobs as com¬\npared with 119 in 1957. Of these 119 offers, 37 were\nin the area of news, 24 in announcing, 18 in continuity,\n10 in production-direction, 8 in time sales, 6 in teach¬\ning and 16 in miscellaneous areas of broadcasting.\nPROMOTION IDEAS:\nWisconsin State Broadcasting Service provides\n2\" x 6\" bookmarks to libraries, book stores, etc. One\nside, lists Wisconsin State Radio Council stations. Re¬\nverse lists the day and hour of seven literature series.\nThey distributed 35,000 of these in one month!\nMARCH, 1958\n3"
}