{
  "id": "d1133-4",
  "text": "“evaluation centers” throughout the United States,\nwith each center responsible for judging all programs\nin a particular class. There are 10 program classes for\nradio and 7 for TV.\nAward winners will be announced May 12. The\nwinning programs will be available for review during\nthe 1958 Institute sessions May 12-15 in Columbus.\nFOUR WIN WRITING CONTEST\nThe four national co-winners of the Voice of De¬\nmocracy broadcasting scriptwriting contest have been\nannounced. They were selected from 750,000 10th,\n11th and 12th grade students from all 48 states,\nHawaii, Alaska, Puerto Rico and the District of Co¬\nlumbia. The co-winners received $500-scholarships to\nthe colleges of their choice and gold recordings of\ntheir broadcast scripts on the subject “I Speak for\nDemocracy.”\nThey are David Hardacre, Piedmont, Calif.; Shar¬\non McClelland', Portland, Ore.; Ross Fish, Phoenix,\nAriz.; and Barbara Mary Breaud, New Orleans, La.\nThe contest, now in its 11th year, is co-sponsored\nby the National Assn, of Broadcasters, the U. S.\nJunior Chamber of Commerce and the Electronic In¬\ndustries Assn.\nWE BEG YOUR PARDON!\nThe Production Centers Committee listed on page 7\nof the January Newsletter should have included the\nRev. R. C. Williams, S. J., Communications Arts,\nCreighton University, Omaha, Neb. Also, E. A. Hun-\ngerford, Jr. of the same committee should have been\nlisted in connection with the Metropolitan ETV As¬\nsociation, New York, N. Y. instead of with Creighton\nUniversity.\n*****\nSince the name of the TV Management Com¬\nmittee chairman was not available when the January\nNewsletter went to press it had to be omitted. Mean¬\nwhile President Burton Paulu has appointed to that\noffice Richard Rider, WILL-TV, University of Ill¬\ninois, Urbana.\n*****\nThe price of the World Radio Handbook is $2\nplus 20 cents postage and not 20 cents as listed in\nthe February Newsletter (p.7).\nBOX SCORE\nTotal AM stations -\n3210 (includes\n38\nnon-commercial)\nTotal FM stations -\n694 (includes\n157\nnon-commercial)\nTotal TV stations -\n575 (includes\n31\nnon-commercial)\nWASHINGTON UNIVERSITY\nGETS $150,000 GRANT\nWashington University in St. Louis has received a\ngrant of $150,000 from the Fund for Adult Education\nto conduct a three-year demonstation of a new ap¬\nproach to informal adult education in a metropolitan\narea, according to Chancellor Ethan A. H. Shepley.\nDuring the three-year period several series of TV\nprograms will be presented which are designed to\nstimulate discussion in small informal viewing groups\nof adults gathered in living rooms throughout the\nmetropolitan area.\nThe general theme for the demonstration will be\nthe nature and future prospects for the St. Louis\nmetropolitan area.\nAUSTRALIA CONDUCTS\nFIRST ETV EXPERIMENT\nLast month marked Australia’s entry into the ETV\nfield with the initiation of a twelve,-week experiment\nconducted by the Australian Broadcasting Commis¬\nsion (ABC) in selected Melbourne and Sydney\nschools. Two half-hours a week of “telerecorded” pro¬\ngrams are presented in state, parochial and private\nschools.\nIn each of the selected schools, a teacher and a\nclass of 13 to 15-year-olds were chosen to view the\nprograms and submit critical reports to the ABC.\nThe type of person presenting the program is con¬\nsidered an important element in the experiment. C.\nR. Bull, ABC director of youth education, thinks it\nimportant to have a person who appeals to children,\none whom they would like to have in the classroom.\nBull said the programs are designed to enrich the\nschool curriculum as a teaching aid, rather than to\nteach an examination subject or replace the teacher.\nPlanned programs include series on nature study,\nweather principles, social studies and current affairs.\nBefore starting the ETV experiment, the ABC studied\nthe use of TV in schools of the United Kingdom,\nEurope and the United States.\nTV STUDENTS' GRADES\n\"AVERAGE OR BETTER\"\nSome 85 per cent of the students who enrolled last\nsemester in New York University’s televised “Com¬\nparative Literature 10” received “average” or “better-\nthan-average” grades, according to their instructor,\nDr. Floyd Zulli, Jr.\nAbout 10 per cent received the grade of “A,”\nMARCH, 1958\n5"
}