{
  "id": "d1353-1",
  "text": "Dr. Burton Dies\nDr. May Elizabeth Burton, producer-director and assistant\nprofessor in the School of Journalism and Communications\nat the University of Florida, died unexpectedly at age 39 on\nJuly 28. She joined the broadcasting staff at the university\nin 1957, and for the past six years she directed a summer\nworkshop for TV teachers. She co-produced the series Far\nEastern Art and Religion and the Arts for NET.\nPublications\n• L. Lane Wells, assistant professor of speech at Georgetown\nCollege, Georgetown, Kentucky, writes that he will make\navailable to anyone considering establishing an educational FM\nstation a copy of the handbook developed for Georgetown's\nWRVG, which has been on the air since November, 1963. The\n53-page book contains details on the staff organization and\nsome of the basic premises under which WRVG operates.\n• Instructional Television in Western Pennsylvania is a new\npublication developed for the Center for Library and Educa¬\ntional Media Studies at the University of Pittsburgh with\nJack McBride as chief consultant. The publication is being\ndistributed by the university’s Book Center at $2.25 per copy.\n• Stephens College has published a 52-page report on the use\nof the telephone as a medium for interviews and discussions\nwith off-campus authorities. Details are included on how each\nof Stephens’ telephone lecture courses was planned, how inter¬\nviews were conducted, etc. Copies are available at $1 each (pay¬\nable to Stephens College) from: Office of Educational Devel¬\nopment, Stephens College, Columbia, Missouri.\n• Wireless Observation is the title of a pamphlet published\nby the Bureau of Publications, Teachers College, Columbia\nUniversity. Authors of the 32-page booklet are John Herbert\nand John Swayze. Price $1.\n• The TIO has published an annotated bibliography on tele¬\nvision in government and politics. Single copies free to li¬\nbraries, educational institutions, and religious organizations\nfrom Dept. NA, TIO, 666 Fifth Ave., New York 19.\nNews Notes\nPERSONNEL\ny Correction: In the August Newsletter an item appeared an¬\nnouncing that B. Eugene Koskey had left Northern Illinois\nUniversity to join the Peace Corps. This was in error, because\nKoskey is still fhe supervisor of radio and TV at Northern;\nthe Peace Corps position is in addition to his regular duties.\ny Marshall McLuhan, director of Toronto University’s Centre\nfor Culture and Technology, recently received the first an¬\nnual Fordham University Communications Award. The award\ncites him for his outstanding contributions to communications\ntheory.\ny Patrick Callihan has resigned his post at NET to become\npresident of a firm in real estate development in Lansing.\ny Thomas B. Petry has been appointed executive director of\nthe ETV Council for Central New York. Petry said he will\nseek to encourage and increase presentation of ETV programs\non local commercial stations. He will also take immediate\nsteps to activate a UHF channel in central New York. Petry\ncomes to New York from Washington, D.C., where he has\nserved as assistant director of the ETV program of the\nUSOE for the past year. Earlier he was acting general man¬\nager and program manager of WQED and WQEX, Pitts¬\nburgh.\ny Michael H. Pengra has recently joined the staff of KOAP-\nTV, Portland, Oregon, as a producer-director of educational\nprograms. For the past two years he has been a producer-\ndirector, writer, and cameraman at KLRN, Austin, Texas.\ny Boris Frank has returned to the University of Wisconsin to\nbecome production supervisor for WHA-TV. During the nine\nyears since he left WHA, Frank has been executive assistant\nto David Susskind; production supervisor and coordinator,\nTalent Associates-Paramount Ltd., New York; director of\nCaribbean Operations for Bartell Broadcasting, Inc.; and he\nhas helped produce various series, including one for the NBC\nnetwork.\ny Harris S. Greenberg has resigned as radio-TV production\nsupervisor for the Tucson public schools to accept an intern¬\nship in TV production while working for his master’s degree\nat the University of Texas and KLRN-TV, Austin.\ny Dave Berkman, director of public relations and education\nfor District 65, Retail, Wholesale & Department Store Work¬\ners, AFL-CIO, has left the union to become assistant profes¬\nsor of speech for radio-TV at Nassau Community College,\nGarden City, Long Island, New York.\ny Richard J. Meyer has left Kansas to work as a free-lance\nTV producer in New York City while completing his doc¬\ntorate at New York University. He was formerly director\nof ETV at Wichita University, and during the summer he\nserved as consultant for a group of citizens planning to start\nan ETV station in central Kansas.\ny David P. Allen has assumed the duties of the newly created\npost of director of engineering services at WQED and\nWQEX, Pittsburgh. He left a sales position with RCA.\ny Robert Whitnah has been named chief engineer for WQED\nand WQEX, where he has been a staffer since 1959.\ny Norbert H. Nathanson has left his post as instructor at\nNew York University to become an ETV associate in the\nstate education department’s division of educational commu¬\nnications.\ny Lee Frischknecht, manager, WMSB (TV), Michigan State\nUniversity, has left the station to join the NET staff as as¬\nsistant director of field services.\ny Anthony Cherubini, program manager of WNED-TV, Buf¬\nfalo, has left the station to become program manager for the\nEastern Educational Network, where he is in charge of pro¬\ngram exchange and station coordination. He is also in charge\nof production of a current affairs series for the network,\nfrom Washington, D. C. While EEN’s headquarters are now\nin Boston, there are plans to move to Washington in the near\nfuture. .\ny William J. Lesko has resigned as director of ETV at Saint\nLouis University to accept a position as coordinator of pro¬\nduction and distribution of instructional materials and services\nfor Pennsylvania’s public instruction department.\ny Colonel Robert E. Wood has been named chief of a new\nAir Force organization in which all responsibilities for TV\nhave been consolidated. He says his staff will be working\nclosely with civilian educators in all aspects of TV and mo¬\ntion pictures. Anyone requesting information may write to him\nas Chief, Audio-Visual Systems Group, Directorate of Oper¬\nations, Washington, D.C., 20330.\ny Harry Ratner, formerly of California State College, has\nbeen hired as producer-director of school projects for KCET,\nnew Los Angeles ETV station.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Editorial assistant: Skip Robinson.\nPhone 333-0580. Area Code 217.\nReporters:\nRegion I —Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\n—Shirley Ford, WRVR, 490 Riverside Drive, New York\nCity, 10027.\nRegion II —Lou Peneguy, AETC, 2151 Highland Ave., Birming¬\nham, Ala.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}