{
  "id": "d1353-2",
  "text": "Convention Supplement\nNAEB to Meet in Austin, Texas, October 25-28, 1964\nWhat to Expect Weatherwise\nAccording to the Texas state climatologist, the mean daily\ntemperature for Austin for October is 71 degrees. The latter\npart of October should be moderate, a little nippy at night,\ngenerally fair.\nAdvance Registrants Receive\nFree Insurance Coverage\nNAEB will pay the premiums on an insurance policy for ad¬\nvance registrants for the convention. Only those whose paid\nregistrations are received in the Washington office on or be¬\nfore October 1 will be covered.\nCoverage includes:\n1. $10,000 accidental death and dismemberment with\n$1,000 medical expense for accidents. (The first $25 expense\nis deductible.)\n2. You are covered three days before the NAEB con¬\nvention or whenever you leave home to travel to the conven¬\ntion, whichever period is shorter.\n3. You are covered all during the 40th annual NAEB\nconvention.\n4. You are covered three days after the convention or\nuntil you arrive home, whichever occurs first.\nIndustrial Associates Announce Plans\nCoinciding with the opening of convention exhibits on Monday\nmorning will be an industrial session to present new and im¬\nproved equipment in the educational broadcasting field. Rep¬\nresentatives of NAEB’s Industrial Associates have planned\nthe program.\nR. N. Vendeland, sales manager of the Conrac Division of\nGiannini Controls Corporation, will talk about the “Conrac\nAlmanac of Useful Approximates.” Stanley Lapin, director\nof the industrial products division of Adler Electronics, Inc.,\nwill speak on “The Role of 2500mc TV in Today’s Education.”\nDon Andersson, director of information for the National Com¬\nmunity Television Association, has named his talk “CATV\nin ETV—A Community Service.”\nFollowing the speeches, there will be a panel discussion by\nrepresentatives of 3M, Sarkes Tarzian, General Electric, and\nAT&T.\nWilliam S. Brown, Jr., chairman of the Industry Rela¬\ntions Committee, has coordinated the program. He is product\nmarketing supervisor for American Telephone and Telegraph.\nBystrom to Lead General Session\nJohn Bystrom, ETV assistant in the Department of Health,\nEducation, and Welfare, will be in charge of the last general\nsession of the convention, “Educational Broadcasting and Con¬\ntemporary Problems.” Among the problems to be discussed\nwill be welfare, poverty, retraining, adult education, and vo¬\ncational guidance.\nOTHER GENERAL SESSIONS\n• “Copyright”—A panel of people from the Copyright Of¬\nfice, a book publisher, music publisher, and a copyright law¬\nyer will discuss copyright.\n• “Educational Broadcasting and the National Purpose.”\n• Keynote session—Lester F. Beck, professor of psychology,\nOregon State System of Higher Education, currently on leave\nwith the USOE to complete a demonstration film about an in¬\nter-institutional approach to college teaching bj' TV. He has\nmade a number of other films and is on the editorial board\nof the AV Communication Review.\nDivision Day Programs Planned\nTuesday, October 27, will be “Division Day” at the conven¬\ntion, with sessions planned by the four NAEB divisions.\nThere will be division luncheons in the Stephen F. Austin\nHotel for the Radio, TV, and Instructional divisions. Other\nplans announced prior to press time follow.\nINSTRUCTIONAL DIVISION\nChairman of the day’s events is Hugh Greene, TEMP\nproject coordinator, University of Texas.\n9:00-9:50 a.m. “Learning Theory and Instructional TV,”\na presentation of papers and a panel discussion.\n10:00-11:30 a.m. Program excerpts and critique, kinder¬\ngarten through higher education.\n2:15-3:45 p.m. Concurrent sessions: “The 2500 me Band,”\n“Instructional Radio,” and “Tape Exchange and the Li¬\nbraries.”\nRADIO DIVISION\nJack Summerfield, chairman of the Radio Division board,\nsays that half of the day will be devoted to a business meet¬\ning and the other half to a panel session on “Radio Recon¬\nsidered.” He also says that there will be an “outstanding”\nspeaker for the division luncheon.\nINDIVIDUAL MEMBER DIVISION\nFor NAEB Individual Members who are not attending other\ndivision meetings, there will be special-interest sessions for\nsuch groups as engineers, music directors, military personnel,\nprofessional broadcast educators, medical groups, utilization\npersonnel, producer-directors, and promotion personnel.\nFrom 4:30 to 5:30 p.m., there will be a special session\nfor Individual Members who attend other division meetings\nduring the day.\nTELEVISION DIVISION\nThere will be a full day for Educational Television Sta¬\ntions to receive reports and discuss matters of national con¬\ncern. In addition, ETS has arranged with NET so that meet¬\ning times will be available for NET to hold sessions with\nthe managers of affiliated stations.\nAmong business matters already scheduled at press time\nfor ETS sessions are reports of discussions on the ETS pro¬\ngram exchange library, copyright matters, CATV and sub¬\nscription TV, and small tape recorders. The ETS finance com¬\nmittee report will receive special attention.\nSpecial-Interest Sessions Scheduled\nIn addition to the special-interest sessions on Division Day, the\nfollowing will be on the convention program:\n• Research. Presley Holmes, research editor for the\nNAEB Journal, will be in charge. Three papers are sched¬\nuled for presentation.\n• Educational Broadcasting Around the World. This will\nbe a summary of the international broadcast situation, with\npanel discussion of organizations active in educational broad¬\ncasting. Burton Paulu, chairman of the International Relations\nCommittee of the NAEB, will chair the session.\n• Educational Broadcasting and the FCC.\n• Educational Broadcasting and the NDEA.\n• Educational Broadcasting and the ETV Facilities Act."
}