{
  "id": "d1353-5",
  "text": "students under contract for ITV, a gain of 33% over last\nyear. The station will broadcast 22 student in-classroom se¬\nries plus three teacher in-service series.\nSTATION ANNIVERSARIES\n^ WKAR, Michigan State University, August 18, 42nd. The\nstation serves an area incorporating over 90% of the state’s\npopulation, and operates a state tape network providing 182\nrecorded programs to 90 other Michigan stations each week.\nCost to the individual taypayer for the station’s entire oper¬\nation is 2 l/3c annually. The station is staffed by 23 full¬\ntime employees and 10 to 15 part-time students.\n^ WNYC, New York City, July 8, 40th. Among its programs\nis the “Masterwork Hour,” the oldest continuous program of\nclassical music on the air. It also provides programs on pub¬\nlic events, receptions, parades, and unique coverage of the\nUnited Nations.\nINTERNATIONAL\n^ Nine staff members and three senior students from the\nUniversity of Texas radio-TV staff are in Monterrey, Mexi¬\nco, during August and September to assist in launching class¬\nroom TV at the Monterrey Institute of Technology. This co¬\noperative project is described in an article by R. C. Norris\nin the July-August 1964 NAEB Journal.\n^ Four Indonesian Army officers are winding up a nine-\nmonth study tour of the United States during which time they\nhave observed and studied educational broadcasting. When\nthey return to Indonesia, they will be starting almost from\nscratch in bringing TV to the people. There is only one TV\nstation, and educational broadcasting is only in the beginning\nstages.\nPLACEMENT\nPERSONNEL AVAILABLE\n(For information, write Miss Julie Hunt, Placement Service,\nat the NAEB office in Washington.)\nSeptember I Young creative person is seeking to become\npart of your educational system. Over 5 years experi¬\nence in commercial and educational TV. Currently work¬\ning in Hollywood with 4 years experience there. Seek¬\ning positions of producer, director, and teacher of tele¬\ncommunications. Male, single, 28, B.A. in theater-TV;\nminimum $6500 per year starting.\nSeptember 2 Female, 34, M.A. in art; graphic artist; profi¬\ncient in- hand-lettering, cartooning, set design, costume\nmaking, make-up, carpentry, model building. Minimum\nsalary $5,000.\nSeptember 3 Production and/or direction. M.S. in television\nfrom Syracuse University. Married male, 25, family.\nBackground in drama. Industrious. Creative. Will teach.\nSalary open.\nSeptember 4 Producer-director with 10 years experience in\ncommercial TV. Award winner. Familiar with all phases\nof TV operation—engineering and production. M.S. in\nTV-radio. Seeks position with educational broadcaster.\n$10,000.\nSeptember 5 TV producer-director, married, age 50, with 18\nyears experience in the broadcasting field (and 12 years\nin commercial theater) would like to get into ETV. Feels\nhe has a lot to contribute both in know-how and en¬\nthusiasm and is very sympathetic to aims of ETV. Saiary\nminimum $7800.\nSeptember 6 Learning resources, educational television, or\ncommunications position as director, dean, assistant\ndean, or comparable post. Ph.D. with broad educational\ncommunications background which includes I I years ad¬\nministrative experience in higher education and 7 years\ncollege teaching. Pioneer in ETV (author, general man¬\nager of community station, director of campus CCTV,\nchairman of department). Experience in A-V methods,\nin journalism and public relations and as library assist¬\nant. Prefers some teaching if possible. Prefers Southeast,\nbut open to other offers.\nSeptember 7 Creative artist with wide experience in TV pro¬\nduction. Wants creative position and hard work. Teach¬\ning experience. M.F.A., professional member of Pup¬\npeteers of America. Married. Prefers West Coast. Mini¬\nmum salary $8,500.\nSeptember 8 B.S. in journalism-public relations desires begin¬\nning position in ETV. Two years teaching experience, one\nyear as classroom teacher in TV situation. Two years\njournalism and public relations work. Interested in co¬\nordinating programs between studio and classroom.\nPOSITIONS AVAILABLE\n(In order to be considered through these channels, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nSEPT-1 Twelve engineering positions: transmitter, microwave\nsupervision, and design. Five positions are available im¬\nmediately with seven additional openings in from three\nto six mio-nths. Salary is commensurate with background,\neducation, and experience. Mid-Atlantic ETV network.\nSEPT-2 University seeks a director for its new central univer¬\nsity TV service—the first of its kind to be established by\na British university—for experimenting with the use of\nTV teaching and research. Appointment will be at a\nsalary within the professorial range and not less than\n3,400 pounds a year. Director's responsibilities will in¬\nclude development, organization, and administration of\nthe service, interesting and advising academic staff on\nthe uses of television, and investigating its place in\nuniversity education.\nSEPT-3 TV producer in the closed-circuit university TV service\nat a salary within the range 1,400 pounds + 85 pounds\n— 2,505 pounds. For an exceptionally well-qualified can¬\ndidate the salary may be within the range 2,400 pounds\n—2,850 pounds. Candidates should have had experience\nin TV production and preferably have a special inter¬\nest in ETV. An appointment might be made if desired\non a secondment basis.\nSEPT-4 Two creative producer-directors wanted by large Mid¬\nwestern university to work with faculty in constructing TV\nprograms out of educational subject matter. Facilities\ninclude three studios, VHF channel, film and mobile\nunit, videotape. Salary $7,500-$8,900 dependent upon\nqualifications.\nSEPT-5 Radio-television position at southwestern college. Some\nteaching in business and professional speaking or funda¬\nmentals of speech. Also involves sponsoring the staff of\nthe college FM station and supervising its operation.\nPrefers person with Ph.D., but for an interim appoint¬\nment would consider persons with master's degree and\nsome experience in radio station operation. Salary com¬\nmensurate with degree and experience.\nSEPT-6 Reporter-producer-commentator with local news-gather¬\ning and on-air experience wanted by metropolitan TV\nstation in northeast. Should have at least a B.A. in po¬\nlitical science or related field. Salary depends on quali¬\nfications. Open immediately.\nSEPT-7 Experienced TV electronics technician for southern uni¬\nversity medical center audio-visual department. Requires\nthorough knowledge of operational procedure with Am-\npex VRI 100 videotape recorder and similar video and\naudio equipment of professional broadcasting standard.\nSalary dependent upon experience and qualifications. Po¬\nsition open immediately.\nSEPT-8 Southwestern university has opening for radio station\nmanager January I, 1965. Bachelor's degree required,\npreferably in radio, radio journalism, or mass communi¬\ncations. One year of experience in radio managerial,\nplanning, and/or production experience; or, an equiv¬\nalent combination of education and experience. Salary\nrange $6,1 32-$7,404 per year.\n4\nNEWSLETTER"
}