{
  "id": "d992-0",
  "text": "WASHING\nREGE\nNAEB HEA!\nMAY 1 o 1956\n»m PB\n1819|10 ill 112! 11214t 5t6\nVol. in, No. 3\nDivision of Legislation and Federal Relations\nMay 1956\nDECISION IN SIGHT FOR THE SCHOOL CONSTRUCTION BILL\nAfter three months of delay during which Congress took a 10-day Easter recess,\nchances for the Kelley school construction bill (HR 7535) looked about 50-5(Tat the\nbeginning of May. Among the hopeful signs were repeated assurances from the Speaker\nof the House, Representative Rayburn of Texas, that the bill would be considered this\nsession, newspaper reports that opposition to the Powell anti-segregation amendment\nwas stiffening, and the rejection by the House of amendments to the federal highway\nbill that would have removed the Davis-Bacon minimum wage proviso.\nA new complication, however, is the announcement by Representatives Kelley\nand McConnell, both of Pennsylvania, that they will be part of the United States dele¬\ngation to the International Labor Organization meeting in Geneva, Switzerland, for\nwhich they will have to leave at the end of May. Much of the responsibility for manag¬\ning HR 7535 on the floor of the House falls on them. Their absence would handicap\nthe floor management of the-bill.\nATTITUDE OF SPEAKER As recently as April 25, Speaker Rayburn told NEA\nRAYBURN President J. L. Buford and other NEA officials that he\nwas in favor of the school construction bill and that it\nwould be considered this session. He expressed concern that adoption of the Powell\namendment in the House might stalemate the bill in the Senate. He accepted re¬\nsponsibility for the present status of the bill, but also expressed his earnest desire\nto get the bill out of the Rules Committee as soon as it is appropriate to do so.\nOPPOSITION TO THE Biggest question mark of all is whether a school construction\nPOWELL AMENDMENT bill can be passed in the House without the Powell anti¬\nsegregation amendment. (For pros and cons of amendment\nsee Supplement #3 to March 1956 Outlook). The New York Herald-Tribune lor April 29\nreported this unofficial sampling of the House vote on the bill and the amendment: If\nthe amendment is not adopted, the bill will probably get 230 votes for passage. This\nis slightly in excess of the 218 it must have to pass. The Herald Tribune story also\nreports 155 Democrats and Republicans \"committed\" to vote against the Powell amend¬\nment in addition to between 80 and 90 opposition votes from Southern members of the\nHouse."
}