{
  "id": "d992-15",
  "text": "cooperate with and have relationships with education and which are not eligible\nfor Constituent or Institutional Membership.\n(3) IT WAS VOTED to accept the recommendations of the Committee\non Membership set forth above as interpretation of the Constitutional provisions\nrelative to the character of organizations which should constitute the Constituent\nand Associate members of the American Council on Education.\nThe Executive Committee also voted to accept recommendations of the Committee\non Membership that the composition of the Constituent and Associate membership\nof the Council, as now constituted, should remain undisturbed, and that Constituent\nmembership should not be restricted to organizations in the field of higher\neducation.\nThe Executive Committee VOTED to accept and approve the definition\nof the Committee on Membership that educational departments of business and industrial\nconcerns are to be considered as non-profit-making in character and are thus declared\n#eligible for their appropriate class of membership in the Council.\nIT WAS ALSO VOTED that profit-making educational institutions and\norganizations are not eligible for membership in the American Council on Education.\nDr. Adams called attention to an amendment to the California State\nEducation Code which would permit school districts in California (and the institu¬\ntions operated by them) to become members of organizations for the advancement of\npublic or private education. Earlier the Code permitted the use of State funds for\nmembership dues in organizations for the advancement of publicly supported education\nonly. The Committee was informed that negotiations were under way with the California\nState Department of Education looking toward the approval of the American Council on\nEducation as an organization with which the publicly-supported junior colleges in\nCalifornia might affiliate thru membership. President J. Paul Leonard of San Fran¬\ncisco State College, Chairman of the Council's Pacific Coast Committee, volunteered\nto be of whatever assistance possible in these negotiations.\n6. Grants. A report of grants received by the Council since the meeting of the\nExecutive Committee on October 1955> as listed in Attachment B to these minutes,\nwas presented to the Committee.\nIT WAS VOTED to accept the grants so reported with an expression\nof appreciation.\n7. Publications. A report on publications since the last meeting of the Committee\nwas presented for the information of its members (Attachment C).\nIT WAS VOTED to accept and place on file the report on publica¬\ntions as presented.\nDr. Adams commented on various Council publications and their sales. He\nalso commented on the satisfactory settlement of editorial problems inherent in\nthe publication of American Universities and Colleges and American Junior Colleges\nresulting from the Supreme Court decision on racial integration in the field of\neducation.\nThe Committee was presented with a proposed agreement between the American\nCouncil on Education and the Cooperative Study of Secondary School Standards under\nwhich the Council would undertake the publication of material for the cooperative\nstudy on a royalty basis, rather than on the basis of publisher and distributor"
}