{
  "id": "d992-23",
  "text": "5.\nin view.of possible changes in the schools during the past 12 years, With the\ncompletion of this Study the following problems needed to be resolved:\n10 What minimum critical scores should be recommended by the\nCommission on Accreditation as a basis for issuance of a\nsecondary school credential by the appropriate accrediting\nauthority? &\n2. What recommendation should the Commission issue with regard\nto the appropriate use of the GBD tests as one instrument in\ndetermining college admission for those persons not having\ncompleted high school?\n3. How should pertinent information and normative data for regions\nand.the country.contained in the 1955 Study be disseminated to\ncivilian educational institutions and the military?\n4. How should the data collected for individual states be distributed?\nRecommendations for the Committee concerning these problems will be forwarded\nto the President of the American Council on Education, who in turn will refer the\nreport to the Commission on Accreditation for consideration in reaching conclusions\nconcerning the implementation of the 1955 normative data.\nCommittee on College Teaching\nThe Committee on College Teaching met in Washington November 7 and 8.\nUnder the leadership of its new Chairman, President 0. Meredith Wilson of the\nUniversity of Oregon, the Committee heard reports of current activities in the\ncollege teaching field from representatives of ten organizations, and turned its\nattention to ways in which it might supplement the efforts of others and undertake\nfunctions which the Council might be especially well equipped to perform. The\nCommittee concluded that its major efforts should be directed to the problem of\n\"quality in relation to numbers of college teachers,” Specifically, it proposed\nthat a small conference be convened January 19 and 20 to make plans and proposals\nrelating to three problems:\n1. Recruitment of talent for college teaching.\n2a Conserving for teaching the talenbwe do get — new and old.\n3. On the basis of analysis what \"teaching” is, can we discover and apply\nhuman or physical aids or administrative devices which will relieve the teacher of '\nduties less central to teaching and increase the \"quantity” of teacher-student contacts\nand the number of students reached?\nFunds have subsequently been obtained from the Fund for the Advancement\nof Education to support this work conference."
}