{
  "id": "d992-29",
  "text": "Committee on Institutional Projects Abroad\nSince October 1955* the Committee on Institutional Projects Abroad has held\ntwo regular meetings (November 18 and December 19)0 It has adopted a policy of\nrotation of membership, beginning January 1, 1956, and its new Chairman, Dr0 John\nA* Hannah, President of Michigan State University, will take active charge of its\nwork at its next regular meetingo\nThe Committee-sponsored Conference on Uniyersity Contracts Abroad was held\nat Michigan State University^November 17-18, 1955* Over eighty per cent of the\nuniversities holding active ICA contracts were represented0 Total attendance\napproached two hundred persons - university staff, government officials, foundation\nofficers, and other interested persons0 The principal addresses were delivered by\nthe Honorable Brooks Hays, Member of Congress from Arkansas, and by the Honorable\nGeorge V, Allen, Assistant Secretary of State, Attention was focussed not only\non operating problems affecting the contract program, but also upon basic policy\nissues confronting its participants currently and in the future. Resolutions passed\nat the Conference reaffirmed the support of our institutions for this program,\nbut called for a clear statement of government policy regarding the future of the\nprogram, and emphasized the importance of the partnership concept in the relation\nbetween government and our institutions cooperating in this enterprise.\nThe foregoing resolutions have been transmitted by President Adams to\nPresident Eisenhower, Secretary of State Dulles, and John B, Hollister, Director\nof the International Cooperation Administration, as a first step in post-conference\nimplementation. Copies of the resolutions are being made available, a summary of\nthe proceedings (in the form of a special issue of \"Education and Foreign Operations\")\nis about to be distributed, and the principal speeches and statements are likewise\nbeing edited for distribution. Next steps in the follow-up of the Conference are\nto be considered at the next regular CIPA meeting.\nAmong the primary problems currently under Committee consideration are:\n(1) recruitment of qualified scientists and technicians for overseas service,\n(2) the formal contract relationship between the universities and the ICA,\n(3) a proposal for regional training centers in underdeveloped countries, and\n(4) ways and means of assisting the universities in their efforts to raise the\nsights of their operation. The Office is being consulted, on a continuing basis,\nby President Morrill, Minnesota, during the course of his special study of State\nDepartment resources in the field of international educational exchange. Plans\nfor a small number of \"working group\" conferences on certain major program problems\nare under consideration.\nAdvisory Committee on Policy on Washington International Center\nThis committee met last on September 14, 1955*. The next meeting will be\nheld in February, 1956= Dr, Robert H, Reid has agreed to serve as Chairman\nsucceeding Dr, Russell I, Thackrey who has been Chairman since the Committee was\noriginally appointed in 1951* Dr, Thackrey will continue to serve as a member\nof the Committee,"
}