{
  "id": "d992-3",
  "text": "- 4 -\nATOMIC ENERGY COMMITTEE The shortage of scientists and engineers and the fact\nCONCERNED OVER MANPOWER that the Soviet Union is apparently outstripping the\nPROBLEM United States in the production of such personnel has\nbeen the subject of hearings before the Research and\nDevelopment Subcommittee of the Joint Committee on Atomic Energy headed by Repre¬\nsentative Melvin Price (D-Ill.). At the beginning of its hearings the Price subcommittee\nreleased a study of the scientific manpower situation prepared by Charles Collingwood of\nthe Legislative Reference Service of the Library of Congress. NOTE: The correct\nnumber of the science education bill introduced by Senators Kerr, Monroney, and\nMcNamara, is S 3271. See March 1956 Outlook for details.\nLIBRARY SERVICES On April 19 the House Committee on Rules reported a resolution\nBILL GETS RULE making it in order to consider HR 2840, the bill introduced by\nRepresentative Green (D-Ore.) which would authorize $7.5 million\na year for five years in grants to the states for development of rural library services.\nThe bill is expected to come up for debate during the second week in May.\nPOSTAL LEGISLATION The NEA has formally requested the Post Office Department to\nissue a commemorative stamp in 1957 honoring the centennial\nof the Association. A bill for this purpose (S 3644) has been introduced by Senator\nJames Duff (R-Pa.).\nThe House Committee on Post Office and Civil Service has taken no action on any of the\nbills before it to readjust the postal classification of educational and cultural materials.\nThere is a possibility that S 1292 or HR 5139 may be attached to the general postal rates\nbill as an amendment. The Senate Post Office and Civil Service Committee will probably\nbe agreeable to this step, since the Senate passed S 1292 without objection.\nFEDERALLY AFFECTED AREAS A subcommittee of the House Education and Labor\nLAWS UP FOR RENEWAL Committee headed by Representative Carl Perkins\n(D-Ky.) has held hearings on legislation to continue\nfederal grants for construction and operation of schools in federally affected areas. Pub¬\nlic Law 815, 81st Congress (construction) expires June 30, 1956 and amendments are\nneeded to Public Law 874 (operation) to correct some unforeseen inequities that have\ndeveloped. The Perkins subcommittee is writing an omnibus bill which will probably be\nreported late in May. A representative of the National Association for the Advancement\nof the Colored People (NAACP) urged the subcommittee to include an anti-segregation\namendment, but indications are that there will not be too much pressure for such an\namendment as long as the 815-874 program is not extended for more than 2 years.\nINTERNATIONAL On April 25 the House passed HR 10721, the State-Justice Depart-\nEDUCATIONAL ment appropriation bill for 1957 which includes $18,171, 000 for\nEXCHANGES international educational exchange programs. This is the same\namount as was appropriated for the current fiscal year (1956)\nexcept for the $171, 000 necessary for statutory pay increases."
}