{
  "id": "d992-55",
  "text": "THE STRENGTH TO MEET OUR NATIONAL NEED\nA statement approved by the Constituent Members of the American Council on Education\nMarch 20, 1956\n.e .expandii\n^ cJlW ^\nThe ^expanding economy of the United States, the complex social structure which\ncharacterizes its life, the demands of national defense and the insistent emphasis\nupon opportunity for the individual together with a dramatically increased birth rate\nin the last two decades — all combine to raise fundamental questions about the place\nof education beyond the high school in our society* Hence the American Council on\nEducation and its Constituent Member Organizations welcome the appointment by\nPresident Eisenhower of a committee on education beyond the high school* This action\nrecognizes that American education faces the greatest crisis and the greatest oppor-\ntunity in its history. JfrKAJuC^ J\nAn enormous demand for trained intelligence \\to meet a wide variety of require¬\nments must be satisfied if our people are to continue to fulfill their personal aspira'\ntions and to contribute effectively to national aims^^n enormous diversity of\nknowledge and skills is needed by our dynamic economy. The demands for trained\nintelligence come fromAbusiness and industry, from government, from agriculture^^\nand indeed from every identifiable segment of our society* To meet these demands\nopportunity must be given to every American citizen to attain the highest level of\neducation and training of which he is capable.\nWe must be concerned with individuals at all levels of ability. We must also\nprovide educational opportunities over a continually/increasing span of life. Hence\n* 4,\n/tf/haXa\nwe must continue to develop new educational resources; diverse types of institutions;\nadditional courses of study; and new techniques of instruction such as educational\nJk^c ,{JUaaaa&**>\ntelevision*\nHigher education will be called upon to supply an increasing number of persons\nwith a wide range of skills and abilities, many of these in new fields resulting from\nthe growth of technology, and from our nation's closer relations with the rest of the\nworld* Yet no matter how specialized their work, graduates of the future will have"
}