{
  "id": "d992-56",
  "text": "-2<\nto find their way in a more complicated society* and will be confronted with complex\nhuman problems requiring the broader training associated with the liberal arts« The\nneed for men and women trained in the various specialized fields and at the same time\nequipped with broad human understanding is certain to make a demand upon our society's\nreservoir of brains far greater than we ca-r^ supply a '\nOver and above the general claims of the American people and the economy* special\ndemands are made on educational resources by the Federal Government in areas for which\nit has direct responsibility* such as national defense* international relations*\nagriculture* and public health,, Military training programs* extending to more than\nthree hundred campuses* are dependent on facilities predominantly furnished by the\ncolleges. Research on problems directly related to defense makejjfurther heavy demands\non the colleges for trained manpower and use of facilities. The successful conduct\nof international relations requires the promotion of mutual understanding through\nstudy courses and exchange of persons* the provision of technical assistance to\nforeign countries* and the training of personnel for all kinds of overseas service.\nSince the first days of the Republic* agricultural improvement has been recognized as\na prime concern of the Federal Government. In recent years* medical research and to\na lesser extent public health services in general have been similarly regarded. In\nboth fields the colleges are expected to play a major role* especially in providing\nprofessional training for large numbers of people. These demands in total have a\nheavy impact on educational institutions.\nSince this country's resources of manpower are limited* particularly in the\neighteen to the twenty-four year age group which supplies^he students for institutions\nof higher learning* the welfare and security of our people as a whole may well depend\nupon the extent to which we are able to educate each young man and woman to his or\nher full capacity. It is a well established fact that at least one hundred thousand\nyoung men and women each year with high qualifications for college and university\neducation are not continuing beyond the high school."
}