{
  "id": "d992-64",
  "text": "5.\nHowever, as it happens, we have changed our educational pace0 Therefore, we are\ncurrently withholding six million from the labor force during a period when their pro¬\nductivity under training would have been below average, and, furthermore, are compounding\nthis benefit by relieving the employers of the burden of training those youth. Since\nthese youth enter the labor force already prepared to work at high productivity, there\nis, and has been, a steady increase in per capita productivity. And since per capita\nproductivity is a function, in fact a reciprocal function of the amount of the gross\nnational product available for reinvestment, the result has been the generation and input\nof additional capital stock for the support of still further increases in productivity.\nThe fact that the sums available for reinvestment have been still further increased by\nshifting the charges for education to the taxpayer, instead of absorbing them in production\ncosts, means that in addition to the general benefits of developing an educational system\nthere has been an excellent extra dividend, roughly related to the cost of running the\neducational system, available for additional investment.\nThe central fact which emerges from this analysis is that there is a deep-rooted\ninteraction between the educational system as a whole and the economy as a whole, which\nhas made it possible for our economy to expand by literally forcing the expansion of our\neducational system.\nHowever, the two expansions while basically related are not necessarily in phase.\nIt is to this point that we can look for explanation of the attention given to higher\neducation during the last decade. The reason is that higher education is now the only\nremaining segment of our educational system in which there yet remains any real room for\nexpansion which is perhaps another way of saying that higher education has gotten out of\nphase with the expansion of the economy. In order to demonstrate this it is necessary\nto have recourse to another set of statistics.\nIn 1900, as noted before, secondary schools were caring for 11-|$ of their age group.\nBy 191*0' they were caring for 72$, by now they are caring for 80$, and by 1965, according\nto projections, they will be caring for 83$ of the age group. Clearly, therefore, secondary\nschools are dealing now with a percentage of their age group that is about as large as it\nwill ever get to be. Perhaps it will reach 85$, but it does not appear that it will go\nbeyond that.\nIn other words, having set the most elastic definition of secondary schooling that\nwe now conceive to be possible, we have approached the point of providing maximum\nopportunity under that definition. Any further changes within our time will be small in\ntheir effect.\nOn the other hand, higher education dealt with k% of the age group in 1900, 15$ in\n19l|0, nearly 3)$ in 195US and is expected to reach between h0 and U6 $ in 1965.\nClearly, therefore, we have not reached our limits either in the definition of higher\neducation, or in providing maximum opportunity within that definition. Until we have done\nso, we cannot estimate the percentage of the age group that may seek higher education.\nWithin present definitions and opportunities, it may easily reach 50$. Under others, it\nmight reach as high as 60$,\nThe production of these staggering figures leads us naturally to an inquiry as to the\nreasons for the tremendous expansions in the demand for higher education. Here, obviously,\nthere is no one answer, but there may well be one answer that covers more territory than\nany of the others."
}