{
  "id": "d992-67",
  "text": "8o\nbe* nor how long it will take to reach it* but since we know that it took secondary educa¬\ntion fifty years to approach its apparant limit of 85$ of its age group* we are justified\nin assuming that it will take higher education forty years* taking 1940 as the starting date*\nto approach a probable limit of 6C$> of the age group.\nThird, The training of college teachers will be recognized as a special problem to be\nsolved by the development of special programs analagous to the secondary school teacher\ntraining programs now being developed by some of our leading liberal arts institutions.\nIt is even possible that some courageous institutions may undertake to orient themselves\nto the training of college teachers rather than continue the development of their present\nmulti-purpose programs.\nFourth; the additional increase in productivity will take place largely in highly\ntechnical fields and enterprises, relating to communication* transportation* and energy.\nThese are fields in which the help-wanted sections of every Sunday paper bear witness\nto the fact that expansion is limited only by the availability of educated workers at both\nprofessional and semi-professional levels.\nFifth; the further expansion of the economy will* like the additional increase in\nproductivity* be heavily concentrated in fields which are now waiting for additional\nmanpower to accomplish the expansion that is even now necessary just to enable them to\nkeep abreast of current needs and developments that are already in view.\nSixth; further expansion in the economy will in its turn generate a new cycle\nof demand for further extension of education* with all of the concomitant measures* problems*\nand results which we faced a generation ago with respect to the development of secondary\neducation* and which we face today with respect to the extension of higher education.\nFortunately for us, these further levels of demand do not concern us at present* but we\nmay be sure that they will exist* and that another generation must prepare itself to face\nthem.\nSpecifically therefore* we can look for the following developments in higher\neducation.\n1. The development of more new professions and semi-professions with supporting\nprograms of education leading to new degrees.\n2. Continued emphasis on technological education.\n3. Increase in graduate education for teacher education* the further development\nof advanced professional education* and probably some further development of existing\ngraduate education.\n4. Increased emphasis on talent searching* guidance* and placement for the better\nuse of both human and educational resources.\n5. Continued shrinkage* percentage wise* of the liberal arts groups within\nhigher education* counterbalanced* from the liberal arts viewpoint* by continued increase\nin the liberal arts content of professional education.\nHaving in this paper already ventured far beyond the safe limits of hypothesis and\n^peculation* it is obviously now too late for me to use the classical closing phrase of\n\"beyond this I dare not go\". The only precaution I can take is to remind you* in case\nyou need reminding* that these are only one man's guesses. I cannot vouch for their accuracy.\nBut I can note that* in the light of present knowledge we do not seem to have done much more\nthan to cross the frontiers of opportunity in the development and professional application\nof the social sciences and the sciences. Hence it seems a reasonably safe observation that\nwe can expect to spend the rest of our own professional lives in helping to support explora¬\ntions that will ultimately go far beyond those frontiers."
}