{
  "id": "d992-74",
  "text": "3*\nhigher* and additional sources of revenue will be sought and obtainedo Beyond\nthese minor adjustments certain fundamental changes in higher education may be\nfound to be necessary.. It may be necessary to estalish new schools and new types\nof schools such as two-year technical or semi-professional schools. Careful\nattention should be given to the location of new schools® It is well known that\na large portion of those who drop out of college do so during the first or second\nyear* With this in mind* it mi$it be well to establish any new colleges in centers\nof population where the potential students are living* Practically every dormitory\nroom in the United States is now filled* If colleges could be located in centers\nwhere students could commute* much additional expense for housing and feeding\ncould be avoided. Students could then live at home/1 begin their college education,\nchoose their educational and vocational objectives* and then* if Qualified* continue\non into the established four-year colleges and universities. This plan should\nbring enou^i students into these advanced and graduate classes so that enrollment\nin each class would be sufficient to justify its continuance* At the same time* it\nwould provide the opportunity for practically all capable students to attend a\ncollege or university* Parenthetically* it mi git be mentioned that when twice as\nmany children were bom last year as were born twenty-two years ago* twice as many\nbright ones were born and now only a little over one half of the upper quarter of\nour high school graduates are continuing on into college* Potentially* then* we\ncould more than double our present enrollment and maintain our present high\nacademic standards. Current trends indicate that this will be done within twenty\nyears.\nThe problem is* then* rather clearly placed before us. We now know the\nprobable number of students to be enrolled in our colleges and universities and\nwe know the time of their coming* It is now our responsibility to make preparation\nfor their coming* One obvious solution to the problem would be to double or treble\nour present physical facilities within the next twenty years* Intelligent planning\nand self discipline should make it possible to meet our developing needs without\nthe necessity of this tremendous expenditure of money and materials* The following\nprocedures are then suggested.\nFirst* we can unquestionably realize a better utilization of our present\nphysical facilities. This can be done by more uniform scheduling of classes\nthroughout the day and week.\nSecond* we can offer fewer courses eliminating the excessive number of small\nclasses and combine those courses now taugit one* two* or three times a week into\nlarger units of instruction scheduled five times a week.\nThird* new schools and new types of schools can be established to supplement\nour present system of higier education. Care should be used in the location of\n■these colleges to assure their placement in centers of population where no colleges\nare now operating.\nFourth* better cooperation can be realized among the many junior colleges*\nfour-year colleges* and universities in order that we may develop a truly integrated\nsystem of hi^ier education® This will require at least statewide planning and\nperhaps regional planning* These are only a few suggested procedures and devices\n\"which can be used in the years ahead.\nBy careful planning and action based on clear vision* I am confident we shall\nbe able to make adequate preparation for the added millions of youth now coming\nthrough our elementary and secondary schools in order that they may be given the\nsame high-quality educational opportunities it was our good fortune to enjoy."
}