{
  "id": "d992-75",
  "text": "AMERICAN COUNCIL ON EDUCATION\nConstituent Member Meeting\nMayflower Hotel, Washington, D.C,\nMarch 19-20,1956\nOffice\n1785 Massachusetts Avenue, N.W.\nWashington 6, Do C.\nTelephone: Hudson 3-6620\nPaper prepared for delivery\nMonday, March 19,\n3:^0 p.m.\nSERVICES REQUIRED AND REQUESTED OF HIGHER EDUCATION TO MEET\nNATIONAL NEEDS FOR WHICH THE FEDERAL GOVERNMENT HAS SPECIAL\nRESPONSIBILITY\nRussell I. Thaekrey, Executive Secretary\nAmerican Association of Land-Grant Colleges and State Universities\nThe question of whether or not the Federal Government has a \"special\nresponsibility\" for certain national needs, and not for others, is one which\ncould be endlessly debated. There is, for example, pretty clear evidence that\nthe Founding Fathers of this country regarded the whole area of higher education\nas one for which the Federal Government has \"special responsibility\nI shall shed more light, however, and perhaps generate less heat from\nsome quarters, if I confine the rest of my remarks to those fields in which it is\ngenerally agreed, or determined by specific expression of the Federal Congress\nin expressing the national intent and interest, that the Federal Government does\nhave a continuing and primary responsibility.\nPerhaps the first of these is national defense and security. Five (5)\ndepartments of the Federal Government maintain undergraduate academies for the\ntraining of regular and reserve officers of the armed forces. There are at least\ntwo (2) graduate institutions which have basic authorization to grant degrees.\nSuch other trained personnel as came into the military establishment, until\nthe passage of the Land-Grant Act of 1862, came largely from State and private\nacademies. The Land-Grant Act required \"military training\" as part of the\ncurriculum at these new Federally-sponsored institutions, and throughout the years,\nuntil the passage of the National Defense Act of 1920, the Federal Government\nprovided some aid for this instruction in the form of instructors and military\nequipment. More than 100,000 men with such training served in World War I,\n30,000 of whom became officers. Good figures are not available on World War II,\nbut General George C. Marshall Is authority for the estimate that our mobiliza¬\ntion would have been delayed at least six (6) months had it not been for the\navailability of the Officer Reserve. The national cost of such a delay in \"blood\nand treasure\" (to use Churchill's terms) cannot be estimated.\nThe 1920 Act provided a formal ROTC course of study through which reserve\nofficers could receive commissions on its completion. Military training was\nexpanded into a substantial number of colleges and universities in the 1920's\nand '30's, and into more than 300 since World War II. In this program, the\nmilitary departments provide faculty for the strictly military courses, text¬\nbooks, and military equipment. The colleges provide all facilities and their\nupkeep, storage space, and substantial other services."
}