{
  "id": "d992-77",
  "text": "generally. In 194(3, medical research expenditures in the United States were es¬\ntimated at $4-5 million. In 1955 * they were estimated at $24(3 million, of which\nforty-seven (47) per cent, or $113 million, was Federally financed.\nThe theeis of primary Federal responsibility was perhaps first clearly\nstated by the Appropriations Committee of the House of Representatives in 1953*\nin its report on appropriations for the fiscal year 1954, when it said: \"In\nkeeping with its belief that medical research is a field in which the Federal\nGovernment, rather than State and local government, does have the primary respon¬\nsibility, the bill includes more funds for these activities than were provided\nin the appropriations for 1953.” The appropriation for the National Institutes\nof Health of the U.S. Public Health Service then approved totalled $61.5 million,\nwhich was five and a quarter (5-4) million dollars more than the revised budget\nrequest. The House of Representatives has Just approved an appropriation for\nthis same activity of $135>525*000 for the fiscal year 1957* which was $9\nmillion above the budget request, more than $37 million above last year's\nfunds, and more than 100 per cent above the 1954 fiscal year appropriation re¬\nferred to earlier.\nThere now seems to be substantial agreement between Administration leaders\nand at least some leaders in the Congress both that health services are a major\nFederal responsibility, and that this responsibility, in part at least, includes\nhelping colleges and universities provide for the undergraduate education of\nhealth-field personnel. Secretary Marion B. Folsom, with the approval of the\nPresident, has proposed a program of matching grants for both construction and\nfacilities for public health schools, and for schools of medicine, dentistry,\nand osteopathy. Some Congressmen have sponsored bills calling for a larger pro¬\ngram.\nIt seems clear that this is an area in which increasing public interest\nand demand for the services of graduates of highly specialized and costly schools\nhas brought considerable acceptance of the idea that the Federal Government has\na responsibility that 'extends throughout the period of professional education.\nCuriously enough, the field of veterinary medicine, which provides the\npersonnel which do much of our Federal food inspection work of food coming from\nanimals or animal products, and whose facilities and other costs are similar to\nthose required in human medicine, has not as yet been included in this proposed\nprogram. Perhaps this is because a considerable segment of the vocal public\nthinks research done to keep milk pure and cattle healthy is done for the benefit\nof the animals involved and not for those who drink the milk and eat the meat.\nAgriculture\nThe belief that the improvement of agriculture and of the conditions of\nfarm people through research and education was a proper concern of the national\ngovernment is as old as the national government and was first expressed to the\nCongress by President George Washington.\nIn 1862, the Congress established what is now the U*S. Department of\nAgriculture, and in the same year it moved to create a national system of\ncolleges and universities which would emphasize \"agriculture and the mechanic\narts\" through offering grants of land to the several States which would agree\nto invest the funds derived in a permanent endowment to provide for instruction\nin these colleges. In 1890, 1907, and again in 1935* acts were passed to pro¬\nvide annual and direct Federal support for instruction in the Land-Grant colleges\nthus founded."
}