{
  "id": "d992-81",
  "text": "] .\nAMERICAN COUNCIL ON EDUCATION\nMarch 19, 1956\nHIGHER EDUCATION’S NEED FOR A LARGER\nSUPPLY OF QUALIFIED STUDENTS\nEdward Be Rooney, S. J®\nExecutive Director\nJesuit Educational Association\nI have been asked to speak on Topic VI at this conference of the Constituent\nMembers of the American Council on Education® The topic reads? “Higher Education’s\nConsequent Need for a Dagger Supply of Qualified Students”0\nIf I have anticipated correctly the development of the opening address, “Higher\nEducation in American Society “ and of Topic I “Educational Opportunities Beyond\nHigh School Demanded by the American People as a Whole,” I think I can take it for\ngranted that the demand for post-high school educational opportunity will go on\nincreasing. If my anticipation of the development of Topic II and Topic III, I\nthink I am right in assuming that the papers on the “Demands on Higher Education\nto Supply Skilled Manpower to Meet the Needs of Society” and the “Services Required\nand Requested of Higher Education to Meet National Needs for which the Federal\nGovernment has Special Responsibility” will have shown the real need for a continuing\nand growing supply of high school graduates®\nSince then previous papers will have made clear th&t there will be a growing\nsupply of high school graduates, and that there will be a need for these graduates\nif we are to meet the needs of our economy and of our society, I take it that it is\nmy function to emphasize the point that higher educational institutions are called\nupon to perform a service that they cannot perform unless they receive a larger\nsupply of better qualified students® I take it then that Topic TV is meant to\nemphasize quality since as far as quantity is concerned we shall in all likelihood\nbe faced with the embarrassment of riches®\nMoreover, I think we can take it for granted that institutions of higher educa¬\ntion will continue to have, as they have had in the past, a fairly good supply of\nqualified students — as well as their usual quota of unqualified ones who, like the\npoor, are always with us® Our problem then comes down to this? how shall we reach"
}