{
  "id": "d992-97",
  "text": "Now we would like to show you the various means by which a young\nman may fulfill his obligation. Many of these choices may be\nutilized by all services.\nConsider first the source of all available young men eligible\nand classified for military service.\nAt the age of 17* a young man may begin fulfilling his military\nobligation. First* we would like to show you how he may begin by\nentering upon active military service.\nAs you know* there are varying periods of enlistments availa¬\nble today. For example* a man may enlist for 3 years in the Army\nor Marine Corps* and for 4 years in the Navy and Air Force as well\nas the other services. In addition all services will accept enlist¬\nments for longer periods.\nCurrent manpower procurement procedures for the Active Forces\nwill be continued. This will include induction for two years of\nservice to the extent necessary to meet manpower requirements* and\ncontinuation of present deferment policies.\nUnder our plan the period of ’’Service Callable Reserve\" obli¬\ngation remaining after active service will vary in length according to the\ntime that he has spent on active duty. Thus* a man who has served\ntwo years of active duty will incur a six-year obligation in the\n\"Service Callable Reserve\". A man who has served for three years\non active duty will be obligated for four years in the \"Service\nCallable Reserve\" and one year in the \"Selectively Callable Reserve.\"\nLikewise* a four-year enlistment will result in an obligation\nfor two years in the \"Service Callable Reserve\" and two years in\nthe \"Selectively Callable Reserve.\" Five or more years of active\nservice result in immediate transfer to the \"Selectively Callable\nReserve.\"\nThe next columns that we will show represent ways by which\nyoung men may enter directly into the Reserve Forces* including the\nNational Guard.\nThe number of personnel entering the reserve directly will be\nsubject to strict numerical quota control by the President upon the\nrecommendations of the Secretary of Defense and the Joint Chiefs\nof Staff. This is necessary to take care of changing conditions*\nand to insure that the manpower pool is neither reduced below the\nlevel necessary to sustain recruiting programs for the Active Forces\nnor permitted to rise beyond a level at which some men might pass\nthe age of military liability without having performed military\nservice.\nIf, for example* a young man wishes to enlist directly into a\nreserve for an 8-year obligation* he may do so prior to reaching age\n19 with the understanding that he will be called to active duty within\ntwo years of his initial enlistment for a period of at least 2k months’\nactive service. Upon his release he resumes his obligation in the\n\"Service Callable Reserve.\" This program will be used particularly\nby the Navy and the Air Force* with the Air Force requiring four years\nof active duty. At this time the Navy plans to permit 30*000 men\nannually to enter this way.\n4"
}