{
  "id": "d1707-10",
  "text": "RADIO PROGRAMS\n11\nThese radio sketches, written by students of broadcasting and\nedited by Dr. Randolph G. Adams, Director of the Library, will\nbe based upon facts obtained from the letters, diaries, rare books\nand newspapers in the Clements Library. The principal source\nmaterial will be the papers of General Thomas Gage, commander-\nin-chief of the British forces in North America, 1763-75; the\npapers of Sir Henry Clinton, commander of the same forces, 1778-\n82; the papers of Lord George Germain, British Colonial Secretary\nduring the years of the Revolution; the papers of Lord Shelburne,\nprime minister at the close of the Revolution, charged with making\npeace with the colonies; the papers of Baron von Jungkenn, war\nminister of Hesse-Cassel, comprising the letters and diaries of the\nHessian officers employed by the British in the Revolution; the\npapers of General Nathaniel Greene, American commander in\nthe Southern campaign, 1780-82; and the papers of General Josiah\nriarmar, first commander of the United States troops guarding the\nNorthwest frontier, 1785-91.\nSingle copies of any of these sketches will be mailed free to\nany teacher desiring to use them for classroom purposes. The\ntentative schedule of programs from the beginning of the broad¬\ncasting year to Thanksgiving Day follows:\nOctober 13\nIntroduction to the series: Description of the Library’s Con¬\ntents and Nature of the Programs\nOctober 20\nDramatization of Burgoyne’s Surrender at Saratoga, the Turn¬\ning Point of the Revolution, October 17, 1777\nOctober 27\nCornwallis’ Surrender at Yorktown, Ending the War. October\n19, 1781\nNovember 3\nHarmar’s Return to Fort Washington. (Cincinnati), Novem¬\nber 3, 1790, after his Disastrous Expedition against the\nIndians\nNovember 10\nTreaty of Fort Stanwix, November 6, 1768, which set a\nboundary between the White Man and the Indian, tempo-\nrarily settling Indian Disputes and Ending Colonizing Schemes\nin the West\nNovember 17\nArticles of Confederation adopted by the Colonies Novem¬\nber 15, 1777"
}