{
  "id": "d1542-11",
  "text": "-12-\n2. NAEB will hold a general session on Copyright at the Austin\nConvention including representatives from the Copyright Office\nand book and music publishers.\n3. Educational users - including radio and television stations,\nproduction centers, and closed-circuit systems - will examine\nthe impact of the proposed law upon their present and planned\noperations and prepare documentation.\n4. NAEB will continue to participate in the activities of the Ad Hoc\nCommittee and keep its own membership fully advised of\ndevelopments.\nD. In general, there are three stages in the legislative process during which\nthere may be opportunity to have education’s views on copyright\nconsidered:\n1. The present period during which the Register is modifying his\ndraft Bill preparatory to submitting the new version.\n2. The Congressional hearings during which Committee members\nare making up their minds about whether or not to report out the\nBill and, if so, in what form.\n3. The period when the Bill comes to the floor of either house and\nduring which Congressmen may offer amendments.\nE. If education is unable to secure what it considers appropriate revisions\nin the law by the time the Bill comes to a final vote, it always has the\nprerogative of opposing the entire legislation and electing toHive with\nthe existing law.\nIX. PERSONAL OBSERVATIONS\nI am convinced that the Register is making a sincere effort to revise the Copy¬\nright Law, which all agree is outmoded, so as to achieve a law which will be\nfair and equitable. Mr. Kaminstein and his staff have spent nine years in\nresearch (including study of European copyright laws) and have held dozens of\nformal hearings and innumerable informal conferences. They have been\nreceptive to the expressions of sentiment of all groups, agencies, organizations,\nand individuals having a stake in the application of copyright law. They have\nmade a concientious effort to draw a bill which achieves a workable compromise\nbetween the conflicting interests in our society. This is a most difficult task,\nfor the issues are complex, the pressures from all sides severe.\nIn my judgment, however, the proposed bill, largely because it removes the\n“for profit” provision without substituting anything equally or even approxi¬\nmately beneficial, constitutes an unwarranted withdrawal of rights now available\nto education; furthermore, it appears to be especially and intentionally\ndiscriminatory against educational broadcasting. Obviously the Register has\nbeen impressed by the concern of publishers who are apprehensive about the\npossibility of unrestricted copying and widespread distribution of television"
}