{
  "id": "d1542-2",
  "text": "-3-\nSECTIONS OF THE BILL OF PARTICULAR CONCERN TO EDUCATIONAL\nBROADCASTING\nA. Section 1. Subject matter of copyright; in general..\nCopyright protection subsists, in accordance with this title, in\noriginal works of authorship fixed in any tangible medium of expression,\nnow known or later developed, from which they can be perceived,\nreproduced, or otherwise communicated, either directly or with the aid\nof a machine or device. Works of authorship include, but are not\nlimited to, the following categories: (1) literary works; (2) musical\nworks, including any accompanying words; (3) dramatic works, including\nany accompanying music; (4) choreographic works and pantomimes,\n(5) pictorial, graphic, and sculptural works; (6) motion pictures;\n(7) sound recordings.\nB. Section 5. Exclusive rights in copyrighted works.,\n(a) General scope of copyright. — Subject to sections 6 through\n13, the owner of copyright under this title has the exclusive\nrights to do or to authorize any of the following:\n(1) to reproduce the copyrighted work in copies or phono-\nrecords;\n(2) to prepare derivative works based upon the copyrighted\nwork;\n(3) to distribute copies or phonorecords of the copyrighted\nwork to the public by sale or other transfer of owner¬\nship, or by rental, lease, or lending;\n(4) in the case of literary, musical, dramatic, and choreo¬\ngraphic works, pantomimes, and motion pictures, to\nperform the copyrighted work publicly;\n(5) in the case of pictorial, graphic, or sculptural works,\nto exhibit the copyrighted work publicly.\n(b) Definitions of certain exclusive rights. —\n(1) To “perform” a work means to recite, render, play, act,\nor represent it, either directly or by means of any device\nor process, or in the case of a motion picture, to show\nits images or to make the sounds accompanying it\naudible.\n(2) To “exhibit” a work means to show a copy of it, either\ndirectly or by means of motion picture films, slides, or\nany other device or process."
}