{
  "id": "d1542-5",
  "text": "-6-\n3.\nc. Requiring the addition of extensive staffs to handle\ncomplex clearance procedures, bookkeeping, and owner¬\nship searches.\nd. Imposing the burden of royalty payments upon modest\nbudgets.\ne. Obliging educational broadcasters through these\nimpositions largely to retreat to the use of “homemade\"\nmaterials or to those in the public domain (outdated and\noften inappropriate), simply because they could be used\nwithout the burden of cost or clearance.\nSeparate educational broadcasting from education, because\nthe Bill:\na. Fails to recognize that education is education (whether\nit is disseminated in printing, by wire, or by air waves)\nand that educational broadcasting is an integral and\ninseparable part of the educational process.\nb. Fails to recognize that there is a distinction between\nnon-profit, non-commercial, educational broadcasting\nand entertainment-oriented, profit-making, commercial\nbroadcasting.\nDistinguish between exempted and non-exempted educational\napplications of modern transmission techniques on the basis of\nhow the content is distributed (open or closed circuit) and on\nthe basis of where the recipient is located (within non-profit\neducational institutions or in home, dormitory, factory, or\nhospital), thereby effecting a discrimination which:\na. Limits heretofore “free use\" of copyrighted materials\nby educational broadcasters to closed-circuit trans¬\nmission (by cable or microwave).\nb. Severely handicaps service to schools, since the\nmajority of instruction for elementary and secondary\nschools is provided via broadcasting.\nc. Severely diminishes educational opportunities via\nbroadcasting for those outside of school walls:\n(1) Students unable to attend or take\nresidence on campus,\n(2) Adults interested in continuing their\neducation by going to school at home via\ncredit or non-credit courses,\n(3) Psychologically and physically handi¬\ncapped,\n(4) -. Illiterates eager to learn to read and\nwrite in privacy of their homes but who\nare unwilling to attend school,"
}