{
  "id": "d1218-0",
  "text": "THE UNIVEhsiTY STATION DIRECTOR FACES HIS PROBLEMS'*\nHarold B. McCarty\nProgram Director, Radio Station WHA, University of Wisconsin\nPresident,' National Association of Educational Broadcasters\nSome time ago a noted educator whose name you all\nknow said to me, \"McCarty, you are in an enviable position.\nWhy, Ifd rather be director of a state radio station than\npresident of a state university. Think of your opportunityl\nThink of the greater number of people you have the chance to\nserve! The whole state, all ages, and all kinds to educate\nand improve.\"\nI smiled and thanked him for the encouragement. I\npassed off the remark as mere pleasantry. Yet I do think ser¬\niously of that opportunity he mentioned.' I think of it often\nwhen problems pile up, when the way seems uncertain.- For\nnaturally, such an opportunity is accompanied by obstacles.\nAnd I propose to hold before you today a few of the problems\nof the university station director, as I see them. This, by\nthe way, is not a survey of the opinions of others. For the\nmost part it is a personal analysis of experiences in the\ngrowth of one station. It may not be typical, for university\naims and administrative methods elsewhere may differ. But it\nshould be representative of stations operated by universities\nunder a broad concept of educational service to the entire\ncommonwealth.\nAs the station director faces his problems, he sees\nthat the first big job he has is that of convincing enough\npeople that a publicly-supported broadcasting service will\ngive them something they can get in no other way. Not many^\npeople, you must realize, are actively dissatisfied.with things\nas they are in radio. Not many see the quiet conflict between\neducation and entertainment, a competition in which education\nis generally, if not always, the loser. Few are aware^of the\ndenial of education’s rights in the licensing of facilities.\nThey are unaware of the half-hearted and shifting support\ngiven to educational programs by commercial broadcasters. They\nsee minor annoyances and complain of them, yes, but fundamental\nflaws are obscured by the gloss of great entertainment, fine\nmusic, and spectacular broadcasts from afar.\n•*Talk given at The National Conference on Educational Broad¬\ncasting, \"The University Broadcasting Station\" Section,\nWashington, D. C., December 11, 1936."
}