{
  "id": "d1218-2",
  "text": "3 -\nThe university radio directors first job, then, is\nto grasp and hold fast to an ideal of unselfish public ser¬\nvice, a radio service not possible where the chief and often\nthe sole objective is private gain. He must keep ever before\nhim a big concept of the complete job to be done by radio.\nGuided by this goal he sets out to select, adapt, and extend\nthe influences of the statefs educational agencies. And it\nis then that he encounters the specific problems of which I\nwant to speak now.\nFor simplicity and easy-remembrance I have classi¬\nfied these problems under four headings: (l) Facilities,\n(2) Finances, (3) Programs, and (4) Promotion.\nHow it!s easy to get into a circle with these four\nproblems. They chase each other around endlessly. One di¬\nrector will say, ’’Give us enough money. and we can get every¬\nthing else — facilities, time, talent, publicity - everything.”\nAnother says, ”How can you expect to get financial support\nuntil you get the facilities, a station powerful enough to\nreach the people to show them what you can do for them?”\n”1 disagree with you,” says a third director. ’’The\nprogram is the key to this whole thing. If we can only put\non educational programs to match the appeal of commercial en¬\ntertainment, then our problems are solved.”\n’’Maybe so, ” says a fourth, ’’But before you can get\nprograms or money, you’ve got to have the backing of people\nand organizations who believe in what you’re doing. You must\nwork out an effective plan of promotion to get support.”\nAnd so it goes — a pinwheel chasing itself in a\nwhirl. Which comes first? Which is most important - Facil¬\nities, Finances, Programs, or Promotion? I don’t know.\nPerhaps we had better line them up and try to keep them abreast\nin the race against all other opposition. Our cheering section\nis too small to be divided up anyway.\nThis much is certain. Money, talent, and publicity\nmust wait, at least at the start, for facilities. A transmitter\nand a license to use it must come first. And here the univer¬\nsity station director today bumps his head up against a big\nwall. ’’Sorry,” he is told, ”no facilities for reaching an en¬\ntire state left. Sorry, no night hours available.” Here is\nthat tight, unstretchable broadcast band rising up in front\nof the university station director. He must go through, around,\nunder, or over this obstruction — but how?\nProblem Number One, th-$n: To secure a broadcast fre¬\nquency and power assignment to enable the university station to"
}