{
  "id": "d1218-3",
  "text": "reach all the people of the state with dependable reception\nday and night.' No educational station director has yet com¬\npletely solved this problem. Against the physical limitations\nof the broadcast band, the obstacle of entrenched commercial\ninterests, and the disposition of the federal regulating body\nto make allotments without full consideration of social uses,\nthis is undoubtedly the greatest problem the university sta¬\ntion director faces.\nNow, anyone who knows anything at all about broad¬\ncasting assignments must recognize the difficult task before\nthe Federal Communications Commission and be sympathetic to¬\nwards the Commission’s efforts at achieving fair distribution.\nI would not presume to suggest a solution to this problem.\nThe recent allocation hearing which resulted in volumes of\ntestimony may help to do that. As wc know, there are plenty\nof reasons given for the limited place on the air now occu¬\npied by educational institutions. And educators themselves\nmust shoulder a good share of the blame for this poor showing.\nIt is often explained why it is so difficult to find or to^im¬\nprove frequency and power assignments for educational institu¬\ntions. The limitations of the broadcast band, the restrictions\nof natural laws of physics and engineering this is the chief\nexplanation.\nBut no one has fully explained why education, upon\nwhich everything else depends — our civilization, our culture,\nour prosperity — must take what’s left, or rather what isnt\nleft. It was thoughtless of education to come so late to the\nfacilities banquet, to find only crumbs left. But may I sug¬\ngest that perhaps some of the greedy guests who arrived early\nmay have stuffed their pockets with more than they need? Or\nthey may be too impolite altogether to partake longer of public\ncourtesy. Out of the October allocation hearing will come some\nhelp, we expect. At any rate the case for education on the air\nwas presented by representatives of the National Association\nof Educational Broadcasters and the National Committee on Edu-\ncation by Radio. We hope the basic questions they raised will\nnot be obscured by the major conflict within the industry be-\ntween super-power stations and regional stations.\nProblem Number Two, you remember, is: Finances. ^The\nuniversity station director must sooner or later face the fact\ntVnt good broadcasting is expensive, that his station must have\nmoney real mone^Hf has been spoiled by the unselfishness\nof faculty and student workers. He may have thought m the be\nginning that with a microphone, an operator, and perhaps a\nstenographer he could run a broadcasting station. He coulu\ntake advantage of the abundance of free help —teachers who\nrecognized the opportunity to extend their services, students"
}