{
  "id": "d1294-2",
  "text": "-3-\nSouth Dakota State College. S. W. Jonos sends this information*\n11KFDY ig justlv proud of its student operator, Evan Jensen, ■''\"'ho has the ability to\ngo through a radio transmitter and \"comh out the bugs\"—those imperfections in\nwiring, manufacture, hoak-up, etc. which contribute to noisv reception. He has\nconstructed several nieces of eouinment which saved the station the expense of\nbuving them readv made. His latest triumph is a remote amplifier into which may\nbe plugged as many two velocitv and one condenser microphone-all at the same\ntime- vet the amplifier is no larger than a brief cage and ig easily carried abound.\nKFDY has added considerable new eouipment this year, the latest being a new\nmonitor in the announcers' booth, three new velocity microphones, a new remote\namplifier, a new suitcase model public address system, and lastly, is wiring a\nnew small sound-proofed auditorium for use as a broadcasting studio for bands,\nglee clubs and other large units. South Dakota State! famous military band under\nthe direction of Professor Carl Christensen will inaugurate the new broadcasting\nauditorium with a series of concerts in May. KFDY also broadcasts the outdoor\nconcerts of this band plaved in the Svlvan Theatre on State College campus during\nthe last four weeks of the spring term.\n\"South Dakota State College is to furnish the Land Grand College Radio Hour\nprogram during the National Farm and Home Hour on the network, July 15, 1936, from\n11;30 to 12;30 c.s.t. S. W, Jones, manager of KFDY, is in charge of the program.\n\"Every Tuesday from 1:30 to 2:00 p.m. KFDY*s \"Little Theatre of the Air\",\nunder the direction of Earl James of the South Da.kota State College speech de¬\npartment, broadcasts a one act play.\"\nMEMBERS ON OHIO PROGRAM_Why 4-5-6\nThe meetings of the Ohio Institute on Education bv Radio win find sevaral\nrepresentatives of member stations taking part. Among them are Carl Menzer, WSUI;\nA. G. Woolfries, WOI; H. B. McCarty, WHA; Ralph H. Ojemann, WSUI; W. I. Griffith,\nWOI; and R. C. Higgv, WOSTJ.\nMany N.A.E.B. stations, it is reported, plan to be represented at the Monday\nevening closed meeting of the Association. Others say they a^e trying to arrange\nto have their people present. The inspiration gained at such a get-together will\nhelp to farther the cause of educational radio. Several subjects of real impor¬\ntance to the Association ^re due for consideration at our meeting.\nRemember the dates-Mov 4,5, and 6. Plan to attend if it is at all possible.\nOn to Columbus.1\nTHE EXCHANGE PACKET\nWhen you look oveT* the current exchange packet notice the splendid collection\nof material from WRUF. We can all get some apod ideas to ^it into our own situations\nThe same goes for the rest of the pieces aiso.\nStill we haven't had any contributions from a few stations. Remember---\npack up vour material now——25 nieces of each. The continuance of the exchange\npacket idea, depends upon your participation. Send the material to the Secretary,\nNews-Letter Headquarters: Radio Hall, Madison, Wisconsin.\nRECORDING EQUIPMENT\nCarl Menzer, chairman of the committee to investigate recording equipment and\nmake recommendations reports: \"Within the next few r?ayS expect to have available\nfor trial three or four complete units for instantaneous recording. It is hoped\nthat the best unit available win soon be secured for use by NAEB members and a.\nstart made to form a circulation library of recorded programs.\""
}