{
  "id": "d1294-7",
  "text": "SHORT SIGNALS FROM THE FIELD\nKffjffi-Univcrsitv. of Kcansas♦ Speaking: for Director Ingham, his Mssista.nt,\nMildred I. Seaman, sends these notes?\n\"The University of Kansas station is on the air such a limited time each day\nthat we arc unable to present many programs about which our listeners and potential\nlisteners have expressed an interest and which we should like to hear emanating\nfrom our station.\n\"We have a time sharing agreement with station WREN, located at Lawrence, and\nwe utilize a half hour each afternoon from Mondnv through Friday, and fifteen\nminutes on four evenings a week, with an additional fifteen minutes on Wednesday\nand Friday evenings* KFKU also has a half hour on six Saturday afternoons and an\nhour on six Sunday afternoons to permit us to broadcast the School of Fine Arts\nVespers.\"\nAmong the KFKU programs mentioned are lessons in Spanish, French and German,\nProblems of the Growing Child, Lawrence City Schools, Kansas information, and\nKansas Writers. Interesting plans for next year have been proposed.\nA,, and M. College of Texas. \"The Texas Farm and Home program goes out each\nweek-day over WTAW and the Texas Quality Network, composed of WFAA, KPRC, and WOAI.\nConsequently our Farm and Home Program covers the whole of Texas and a considerable\namount of Southwest United States besides,\n\"From the standpoint of the local staff, our best news-note is that a new\nHammond Organ is in prospect.\" So speaks Director E. P. Humbert, member of the\nN.A.E.B. Executive Committee.\nWSUI-,University of Iowa..\"WSUI hopes to open the season's program of outdoor sports\nbroadcasts with the first home baseball frame. Spring an^ summer sports broadcasts\nwill include both baseball and track events.\n\"A new Baldwin Masterpiece piano has just been placed in our Memorial Union\nstudio to replace the old instrument purchased some eight or te'Pvears ago.\nBaldwin pianos are used in the Old Gold and Union Studios, and Steinwavs in the\nMusic studios,\" says Director Menzer.\nUniversity of Florid. Director Garland Powell reports an expansion.\n\"Starting on April 1, WRUF goes on the air at 7;00 A. M. everTr we^k-dav an®:00 A,M.\non Sunday, and will broadcast continuously until sign-off, which is sunset Denver.\"\nWHA2- Rensselaer Polytechnic Institute\nDirector W. S. Williams sa.vs, \"At the end of the school year, we hope to\ncollect all the faculty talks broadcast over this station this year.\"\n\"This station is used to broadcast for six hours only each week. About eight\npercent of the time is used by our student musical organizations, including the\nsymphony orchestra, dance orchestra, band, glee club, and our student dramatic\nclub. About two percent of our time is used by the faculty for tal'^s of general\ninterest to the public in their special fiel^.\n\"The only thing new is a roun^ table discussion. The members of the 'discussion\ngroup are a professor of aeronautical engineering, a junior in the aeronautical\nengineering course, a. high school student interested in aeronautics, and one of our\nstudent announcers. The Rensselaer Polytechnic Institute .junior, and the high\nschool senior agk the professor ouestions relating to the material covered in the\naeronautical engineering course, and the kind of positions open to men who have\ncompleted a course of this kind.\n\"The purpose of these round table discussions is to answer the questions which\nna,turally occur to a high school student expecting to enter any particular en¬\ngineering field, and at the same time to give parents of such boys some general\ninformation so that the parent maw aggigt the bov in choosing his college course.\""
}