{
  "id": "d1791-1",
  "text": "September) will be an engineering study of allocations\nto meet the indicated needs and will be conducted by\nJansky & Bailey, Inc., NAEB’s engineering consult¬\nants.\nNOTED EDUCATORS SERVE AS ADVISORS\nOn the advisory committee for the survey are:\nA. J. Brumbaugh, director, Planning Commission,\nBoard of Control of Florida; C. Scott Fletcher, pres¬\nident, The Fund for Adult Education; L. D. Haskew,\nvice chancellor, The University of Texas; Robert M.\nFlutchins, president, The Fund for the Republic; Ken¬\nneth E. Oberholtzer, superintendent, Denver Public\nSchools; Benjamin C. Willis, superintendent, Chicago\nPublic Schools; and Paul Woodring, editor, Saturday\nReview Education Supplement.\nAssisting Bronson will be these regional consult¬\nants : William L. Bowden, associate director, Southern\nRegional Education Board; R. Edwin Browne, direc¬\ntor, Broadcasting Services, University of Kansas;\nRichard S. Burdick, director, Metropolitan Educational\nRadio & TV Corp.; John C. Crabbe, manager, Central\nCalifornia ETV, Inc.; Keith M. Engar, director, Ra¬\ndio-TV Service, University of Utah; Keith Nighbert,\nmanager, Station WENH-TV, University of New\nHampshire; Ray Stanley, TV project director, Uni¬\nversity of Wisconsin; John C. Schwarzwalder, man¬\nager, Station KTCA-TV, St. Paul, Minn.; and Ken¬\nneth D. Wright, director, Radio and Television, Uni¬\nversity of Tennessee.\nNew NAEBers\nThree new Active members joined the NAEB during\nFebruary: WNTH (FM), New Trier Twp. High\nSchool, Winnetka, Illinois (also joined the Radio\nNetwork); WFDD-FM, Wake Forest College, Win¬\nston-Salem, North Carolina (also joined the Radio\nNetwork); and KCSD-TV, School District of Kansas\nCity, Missouri.\nThere are also three new Associate members: Mer¬\nrill Palmer School, Detroit, Michigan (formerly an Af¬\nfiliate member); Colonial Williamsburg, Inc., Wil¬\nliamsburg, Virginia; and Brooklyn College, Brooklyn,\nNew York.\nAs has been the case for several months, Individual\nmemberships continued to come in during February.\nSPECIAL PUBLICATION OFFER\nEach month we will offer a special sale on a particular\nNAEB publication, at less than one-half the normal price.\nThis month's special:\nNAEB SECOND TV PRODUCTION WORKSHOP—99c\nA report of the workshop held at Michigan State Uni¬\nversity in 1954, this 133-page book is practically a textbook\nin ETV production. Edited by Edward Stasheff.\nPayment must accompany order. Send to: Special Publi¬\ncation, NAEB, I 19 Gregory Hall, Urbana, Illinois. THIS\nOFFER EXPIRES APRIL 15, 1961.\nACBB Luncheon at IERT\nMr. Louis Housman will discuss ways of increasing\naudiences for good programs at the American Council\nfor Better Broadcasts’ luncheon April 26, 1961, at\nthe IERT. The luncheon will follow a morning ACBB\nsession featuring a panel of high school students who\nhave had some training in evaluating programs. The\nACBB holds a program session and a luncheon each\nyear in connection with the IERT.\nAdvance reservations for the luncheon may be\nmade with Mrs. George Nelson, 329 North Randall,\nMadison, Wisconsin, up until April 20. Cancellations\nof earlier reservations will also be accepted up to\nthat date.\n* * *\nNAEBers are reminded of the NAEB luncheon at\nthe IERT on Friday, April 28, at which John Burns,\npresident of RCA, will speak. The NAEB Utilization\ncommittee is also planning a special session for Wed¬\nnesday afternoon, April 26, on use of radio and tele¬\nvision in elementary and secondary schools.\nPLACEMENT SUPPLEMENT\nMarch I — Syracuse University M. A. Married. Approximately\n2 years commercial TV experience, 4 years radio gov¬\nernment. Currently director-floor manager, seeking posi¬\ntion as television writer - director or communications\nteacher. Minimum $5600; any location.\nMarch 2 — B. A., radio-theatre. Married. Experience: 10 years,\nincluding operations and production manager, script\nand film editor, 5 years supervisory experience. Mid¬\neast or Southeast preferred, $5200 minimum. Desires\nsupervisory production position, ETV or film.\nMarch 3 — Engineer, married. Experience as technical director,\nlecturer in educational radio & TV; 12 years in com¬\nmercial radio-TV maintenance and operational engi¬\nneering. Northwest or West Coast preferred, $6000.\nMarch 4 — Radio or TV music director position desired. M. S.\nin communications; experienced in classical and jazz &\nstereo broadcasting. Skilled announcer, recording engi¬\nneer, editor, writer. Midwest or West, $5200.\nMarch 5 — Married, 26, M. F. A. creative writing, M. S. in\neducation, speech and hearing. Seeking position as\nproducer, writer, script editor. Location open; $5000.\nMarch 6 — Single, 26, B. S. Seeking position on beginning\nproduction level in radio-TV broadcasting. Completed\n2-year accredited terminal course in television produc¬\ntion. Slight preference for Southeast.\nVALPARAISO U. STARTS WVUR\nLooking toward an FM station some day in the future,\nValparaiso University has begun operating a wired-\nwireless station, WVUR. It is broadcasting 13 hours\na day and is run by a staff of 130 students. The signal\nreaches the dorms and some other campus buildings,\nfor a total audience of about 2,500.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. $5.00 a year, edited by Betty McKenzie.\n2\nNEWSLETTER"
}