{
  "id": "d570-103",
  "text": "-3-\nMr. Alex Sareyan, Executive Director, Msntal Health Materials Center,\n1790 Broadway, New York 19, New York\nDr. Charles Osgood, Institute for Communications Research, University\nof Illinois, Urbana, Illinois. (This organization is conducting a\nresearch study on Conmunication of Mental Health Information and has\ncome up with same interesting information about what the public does\nand does not know about mental health.)\nDr. James P. Maddux, The National Institute of Mantel Health, Room 200,\n69 W. Washington Street, Chicago, Illinois.\nFomat, and Series Length; This series would lend itself less than either of the\nothers mentioned, to wdrama.Some brief illustrative scenes might conceivably\nbe necessary. However, half-hour, or full-hour actualities and interviews are\nvisualized at this time, with careful professional guidance and analysis. The end\nresult should help to reveal what i§ good mental health, and how it may be achieved\nand maintained. Therefore, format as such should be entirely secondary, and be\ndictated by the problems and subjects at hand, combining techniques, as needed, as\nWE HUMAN BEINGS, STATION SIXTY and the recent series YOUR MENTAL HEALTH, which we\nhave secured and auditioned, from the U.S. Department of Health, Education and Welfare,\nall illustrate.\nIn this case a series of thirteen problems is visualized, organized in one of\ntwo possible ways: The first would include individuals and/or occupations into\nwhich problems are frequently divided: old age, adolescence, the criminal, marriage-\nrelated problems, children, etc. The second, and more likely organization, would\ninclude separate programs on aphasia emotional deafness, paranoia, kleptomania,\nhypochondria, emotional deafness, emotion-caused speech impairments, shock, the\nvarious types of dementia, psychomat-ic medical problems, diseases of the nervous\nsystem, etc., with probable consideration of the various treatments (psychoanalysis."
}