{
  "id": "d570-107",
  "text": "-3-\n4) The status of labor and the development of the labor movement would form\nanother major section of this series. Such coverage would include the role of the\nworker in our earliest society, child labor laws, the relation of the elimination\nof slavery to our interpretation of labor freedom and mobility (both horizontal and\nvertical) and other early manifestations of the desire and the need for labor to\nimprove its standards of living and working conditions.\nThe introduction of machinery and reactions to it would be studied. The\norigin of the ,rKnights of Labor** the secret group headed by Uriah Stevens, would\nbe traced. The 1873 depression, and the new leadership which emerged from it,\nfollowed by the 1886 '‘The Hay Market Riots,\" the difficulties in winning public\nopinion support, the phase during which labor organizations and leaders were looked\nupon as foreign-born anarchists* would complete this first section, with possible\nadditional illustrations from the Homestead Strike in Pittsburgh, and possibly the\nPullman Strike in Chicago. In both these cases, as in virtually all previous ones,\ngovernment and public opinion generally supported big business and capital.\nThe importance to the new approach which labor needed to win public support\nof Samuel Gompers would form another section. The recognition he provided of the\nfact that respectable methods were needed, and that responsible leaders needed\ndeveloping, enabled labor to begin to regain favor in the public eye. The story\nof present labor activities would complete this section.\nThe extent to which the farmer and the worker had to struggle to eliminate the\ninequalities which the industrial system brought with it, but also the fact that\nthey succeeded, show the problems and the possibilities of the capitalistic,\nindustrial system where democracy prevails.\n5) The corporations, their history, early ownership, and present ownership\nand public relations policies and labor relations would form the final section of"
}