{
  "id": "d570-18",
  "text": "C, FM Multiples and how it may he of use to HAEB: Heretofore FM Multiplex\nequipment has not been available* However* at the NARTB equipment display such\nequipment was shown and tested under actual operating conditions0 A complete\nreport is being submitted in the separate equipment report* Its. use by NAEB\nmembers is covered in this section under “ K - NAEB Network**.\nD* Improvements in NAEB Tape Network: & is recognised that the tape network is\none of the most important projects of NAEB and that the quality of this service\nshould be of constant concern. Improvements have been noted since Mr* Bidlack\nhas been supervising the maintenance cf the duplicator* With the installation of\nnew full “track heads* it i3 expected that duplication at headquarters will be of\nhighest quality* In order to maintain such quality it is necessary that equipment\nmaintenance be carefully supervised and that adequate test equipment be made\navailable for this purpose* If this is done* any degraded quality will be the result of\ninferior or poorly adjusted equipment used by members for either playback or\nthe recording of masters. The Engineering Committee therefore recommends that*\nas soon as possible* funds be made available to secure adequate test equipment\nfor this purpose* The Committee* through the Newsletter, plans to urge members\nto follow maintenance instructions according to the Engineering Committee\npublication covering this matter* In order to be assured of highest quality masters*\nit is proposed that each station submitting masters for duplication be. asked to\nsupply test tapes to the Committee for analysis and a report. Mr* Edward Kratt\nhas agreed to start this service in September 1955. If tapes are sent to Mr* Kratt*\nStation WNYE* 29 Fort Greene Place, Brooklyn* N*Y** he will make the analysis\nand report and return the tapes to the NAEB library* Such a procedure should assure\nus of high quality master recordings*\nTapes sent to Mr* Kratt should indicate the type cf machine on which they\nwere made and should be recorded as follows:\nTapes should be recorded at 7 1/2 inches per second*\nFor all tests the recording amplifier should be adjusted for normal operating\nlevel and not changed during the test recording. Normal operating level is\ndefined as 10 DB below the point where distortion reaches $% with a 400 cps\ntone*\n1* One minute of continuous 5000 cps tone followed by two minutes of\ncontinuous 7500 cps tone*\n(To check head alignment)\n2. Two minutes of continuous 400 cps tone*\n(To check distortion)\n3* Two minutes of no recorded sound (blank tape) accomplished by\ndisconnecting oscillator and terminating the input of the recording amplifier\nwith a matching resistor*\n(To check noise)"
}