{
  "id": "d570-20",
  "text": "Although the deadline for comments is close, it is expected that an extension of\ntime would be granted to clarify the situation,, The Committee felt that it did not\npossess sufficient data of a technical nature to submit comments and decided to\ntake no action at present but to follow the matter closely and be prepared to act\nif it becomes necessary.\nG. Progress of attempt to get professional recognition and advancement* discussion\nof wage scales, job classifications* wage equalisation, lack of personnel* etcc\nThe Committee has had these matters under study since the last meeting* The\nfirst step was to obtain a roster of technical personnel and this has been prepared\nby Mr. Bidlack* It is planned to continue the study with information regarding\njob classifications from various sources including information available from\nother NAEB committees* !h order to organise continuing work in the best\npossible way * the Committee decided to conduct-a pilot survey among Committee\nmembers* When this is completed it will allow m to better plan future action\ninvolving the membership as a whole*\nH. Funds for visits of TY engineers to other operating stations* This project was\ninvestigated by Mr* Bidlack through contact with Mr* Shilen of FAE and information\nreceived that the FAE is no longer offering scholarships through his office. It\nhas been indicated, however, that the Center is interested in such work and may be\nable to assist to a limited degree* This source will be investigated*\nL Study of NARTB Engineering Committee and future exchanger with this\ncommittee. It is thought that there might foe considerable value to both the NARTB\nand NAEB Engineering Committees if these two foodies could work cooperatively,\nespecially on certain special projects* Mr* Braum has agreed to discuss the\nmatter with Mr* Prose Walker of the NARTB Engineering Committee as soon as\nthe rush of the NARTB convention is over, and report to this committee* Through\nMr. Braum's efforts, Mr. Walker was kind enough to allow NAEB Committee\nmembers to register for the NARTB engineering conference although some\nwere not NARTB members.\nJ. Pool of test equipment* Many times tests of station equipment are necessary\nor desirable and proper test equipment is not available either because the\nindividual station cannot afford it or because its infrequent use does not justify\nthe expenditure. Such test equipment may be available at other member stations*\nThe Committee chairman expects to contact engineers at NAEB stations and\nprepare a list of such test equipment and its location along with information as to\nthe conditions under which it may be loaned or rented to other members* When\nthis list is completed it should be published and kept up to date.\nK. NAEB network - FM, AM, Line, Microwave, FM Multiplex* For some time the\nCommittee has been considering the feasibility f an NAEB network to supplement\nthe present tape network. Various methods, or combinations of methods, listed\nabove are being studied* A report on the practicality of using present educational FM"
}