{
  "id": "d570-21",
  "text": "5o\ntransmitters for a regional network covering the midwest was made* Due to lengthy gaps\nbetween key stations, this first plan does not seem feasible. Local networks were\ndiscussed and in some areas this plan would seem to offer possibilities. In order\nto secure more data on the use of wire lines for NAEB network purposes, information\nis now being collected which will outline the costs to join 10 major NAEB stations\nand perhaps several other branch outlets. The plan is arranged so each station can\ncontribute programs at any time* A report on this plan will bo submitted later\nWith the advent of FM multiples equipment it was thought that such a system might\noffer possibilities for a network* However, such a plan is faced with the same\ndifficulties as the FM network noted above: St may offer possibilities for a local\nnetwork but distances from key stations are too great for satisfactory operation as\na regional or national network. The Committee expects to continue work on this\nproject and perhaps, with a combination of all facilities, some practical scheme\nmay develop which will allow the formation of an NAEB network at a reasonable cost\nL# Standards for video recording. A sincere effort has been made to contact all\ninterested parties with a view of setting up standards for video recording. Thus\nmr a few offers to cooperate have been secured but in many cases those who should\nhave a stake in the project have shown little interest. Standards of this nature, to\nbe worth while, must have the complete cooperation of everyone. After much\ndiscussion the Committee agreed that it should keep the project alive but should\nexpend its efforts in the immediate future toward the following objectives:\n1. Continue the publication of papers on video recording.\n2. Consider the possibility of ‘preparing a “handbook” for video recorder\noperators which would contain all available information obtained from any\nreliable source, and to which supplements could be added as more information\nis secured*\nS. Arrange for a film to be produced by each of the operators of video recording\nequipment and submitted to processor (Ireland suggested) for processing\nby the same methods at the same time, information regarding lighting,\nkinescope settings, etc*, should also foe supplied* If this is done, an\nevaluation can be made which should be of considerable value to all operators.\nThe Committee will consider means of organising such tests as well as\nfinancing them.\nM. NAEB convention and attendance of NAEB engineers at tills and other meetings.\nThe results fisiF mm* __•>>•» **\nSeveral projects are underway to create interest among NAEB tec!\nand the Committee feels that this situation will improve with time."
}