{
  "id": "d570-22",
  "text": "61\nN Technical reports and contributions to NAEB Newsletter, It is the opinion of the\nCommittee that much valuable information suitable for use in the engineering\nsupplement of the Newsletter is available from NAEB engineering personnel. Also,\nthat this group is a potential source for technical publications Thus far such\ncontributions have been few. It is thought that the problem can be solved and me\nmethod is described in paragraph “O” which follows* Meanwhile, the Committee\nwill search for material for technical publications and Mr* Bidlack 1ms been doing\nan admirable job with the Newsletter supplement. These features should be\ncontinued and enlarged.\nO* Use of roster of technical personnel* The roster of technical personnel, recently\nprepared and published, is the first step in a rather ambitious project on which\nthe Engineering Committee hopes to spend considerable effort during the ensuing year*\nOne of the major objectives is to correct a situation which has been with the NAEB\nalmost since its organization. If NAEB can be thought of as a service organisation,\nits services, until recently, have been almost exclusively of a program or\nadministrative nature. Practically everyone associated with the organisation in an\nactive capacity has clone 30 from a program or administrative viewpoint. The new\nroster of NAEB technical personnel lists a comparatively largo number of engineers\nand with the exception of a* very few, none of them have ever taken an active part in\nthe organization. Many of them have an idea that they are not considered as being\na part of NAEB. The result lias been some dissatisfaction among this group and\nthe feeling that NAEB will spend its efforts programwlse but has nothing to offer\nfrom the technical angle. These people are potentially good active contributors to\nthe continued growth of NAEB and with the advent of television, their work assumes\na decidedly important position. The Committee feels that one of its duties is to\ncorrect this situation, to bring the technical people into closer contact with each\nother so they can exchange ideas, and to see that they take an active part in the\naffairs of NAEB in any way which will benefit the organization. In order to start\nthis project the Committee proposes to send a letter to each person listed on the\ntechnical roster explaining the function of the Engineering Committee, what it and\nthe NAEB may be able to do for them, and how they can help themselves as well\nas the organisation. This can be done by contributions to the Newsletter, technical\npapers, exchange of ideas, local or regional meetings as well aa other methods of\npromoting a better aquaintanceship and understanding, participation In NAEB\nactivities, better relationships with programming :: nd administration, etc., etc.\nIf we can reach this goal, many problems, and especially those of the Engineering\nCommittee, will be solved or certainly made much easier. We feel that if we can\naccomplish this one aim, the work of the Committee will be well rewarded.\nPa Subscription TV. As this is primarily an economic problem and on advice from\nNAEB attorneys, no action was taken by this Committee,\nQ. UHF Problems. This is another problem which is mainly economic in nature.\nIf engineering problems are involved, this Committee will act as they are brought to\nour attention. FCC Chairman McCoanaughey, hi - speech before the NARTL meeting,"
}