{
  "id": "d570-25",
  "text": "NAEB RADIO NETWORK\n, f\nI\nOFFERING SPECIAL NOTICE OFFERING\nRe: BBC Programs, Fall 19$$ and Winter 19$6\nTwo major improvements concerning the availability of BBC programs for NAEB\nstations have been made. First, we know you will be glad to hear that after a great\ndeal of effort on the part of Association Headquarters and our friends in the New\nYork BBC office, BBC programs are now available to all NAEB Network Stations regard¬\nless of whether or not they have the general ASCAP license. (However, \"conditions\nforms\" still must be returned to the BBC for you to receive these programs. If you\nare not certain that you have done this, check with the BBC immediately.)\nSecond, the BBC programs mil be distributed to member stations DIRECTLY FROM\nNAEB HEADQUARTERS in Urbana. They will NOT be bicycled. After the programs have\nbeen played, the tapes are to be returned to NAEB Radio Network Headquarters at this\naddress. They are NOT to be returned to the BBC in New York. (Of course, other\ntapes may be sent to the Network in exchange as usual.)\nIn May, Network Headquarters issued a tentative offering of programs. This\noffering may be regarded as final. If you have not ordered but wish to, use the\nenclosed order forms. If you have already ordered, but wish to change your order,\nuse these forms. If you have already ordered and do not return these forms, all of\nthe programs listed in this offering will be sent to you. PLEASE NOTE — THAT THIS\nOFFERING DIFFERS SOMEWHAT FROM THE TENTATIVE OFFERING WHICH WAS SENT TO YOU IN MAY1\nFour programs have been changed in the fall BBC drama series (THE BBC THEATRE)\nin order to make the series more completely drama and in order to put the two Shake¬\nspeare plays into the winter Shakespearean series (THE SHAKESPEAREAN THEATRE). The\ntwo talk series (MYTH OR LEGEND and WHAT NEXT) have been dropped for now, and an\neight-part serieal, THE BRIDE OF LAMMERMOOR, from Sir Walter Scott»s novel, has been\nadded,\nAugust 9, 19$!?"
}