{
  "id": "d570-30",
  "text": "Series 55-36\nPage 2\nTitle\nProg.\n5.\n6.\n7.\n8.\n9.\n10.\nIssue\n1*1* (Oct. 30) The \"Alcestis\" of Euripides - Richard Aldington*s translation\nof the play adapted for radio and produced by Raymond Raikes,\nwith music composed and conducted by John Hotchkis. It is\nthe story of Admetus, King of Thessalia, who in return for\nentertaining Apollo, the God of Healing, is promised a second\nlife if he can find somebody to die in his stead. Date of\nexpiry: June 29 *57. Time: 70:hh»\nU5 (Nov. 6) Defeat - The story of the disastrous Athenian expedition to\nSicily in l|l5 B.C. The great great historical event is re¬\ntold in the words of the exiled historian Thucydides who, re¬\nturning eleven years later to Athens, meets the former slave\nto General Nicias, who led the attack. Date of expiry: May 6\n*57. Time: 59:UO.\nh6 (Nov. 13) The Ship that Died of Shame - From the short story by.Nicho¬\nlas Monsarrat, dramatized for radio by Kenneth Langmaid, and\nstarring Trevor Howard and Noman Wool and. The ship of the\nstory is a motor gunboat, No. 1087, in which Bill Randall\nand George Hoskins served with distinction during the war.\nSix years later Randall, now unemployed, again meets Hoskins\nand reluctantly agrees to join his smuggling venture. Date\nof expiry: Mar. 26 *57. Time: 57:U7*\nhi (Nov. 20) Aucassin and Nicolette - Marius Goring stars in the thir-\nteenth-Century French musical fable, newly translated and\nadapted for broadcasting by Rene Hague. The music is ar¬\nranged from contemporary sources by Denis Stevens. Date\nof expiry: Aug. 5 *57- Time: 59:U6*\nU8 (Nov. 27) Captain Edward Riou - The story of two episodes in the life\nof one of Nelson*s fellow-officers, dramatized for broad¬\ncasting by Ludovic Kennedy from Riou*s own papers and other\ncontemporary documents. In 1789 Captain Riou was in command\nof the frigate \"Guardian,\" carrying stores and convicts to\nthe newly-established penal settlement at Port Jackson in\nNew South Wales. Twelve years later, aboard the \"Amazon,\"\nRiou was in command of the frigate squadron at the Battle\nof Copenhagen, where his gallantry cost him his life but\nalso played an important part in ensuring the victory of\nNelson*s fleet over the Danes. Date of expiry: June 21 *57.\nTime: 59:lU.\nh9 (Dec. U) The Law and the Prophets - Joseph Tomeltv and Liam Redmond,\nwith an all-Irish cast, in \"The Law and the Prophets\" by\nDonald MacDonagh, dramatized for broadcasting by the author.\nOvercome by strong drink, Myles Mongan, a traveling tinker,\nhits his wife. She is killed in falling as her head hits\nthe railings, and Myles is arrested. Round this plot the\nauthor writes his satire on legal procedure. Date of ex¬\npiry: Mar. 13 *57. Time: 59:17."
}