{
  "id": "d570-40",
  "text": "THE WASHINGTON COMPACT:\nAN INTEGRATED APPROACH TO\nEDUCATIONAL BROADCASTING\nDuring recent years several national organizations have collaborated in\nefforts designed to make educational television a reality, Now that this task has been\nachieved and the movement is well started, it is time to review the situation to deter¬\nmine in what manner modifications can be effected on the national scene to secure the\ngains made to date and to anticipate the needs of the future.\nTo this end the Joint Committee on Educational Television, the National\nCitizens Committee on Educational Television, the National Association of Educa¬\ntional Broadcasters, the American Council Committee on Educational Television and\nthe Educational Television and Radio Center have engaged in a series of meetings held\nduring the past year, The purpose of these conferences has been to determine what\nreorganization of present agencies, if any, should be suggested as a means of provid¬\ning more intelligent and imaginative leadership to the educational broadcasting movement\nin this country. The functions of the various agencies have been reviewed and the\nservices demanded in support of the enterprise re-assessed,. Questions of overlapping\npurposes and activities have been studied as have problems of providing services con¬\nsidered desirable but not now performed by any of the organizations. All of these items\nhave been considered within the framework of a desire to unify and strengthen the\nnational effort and have been directed at securing, maintaining and supporting an\neffective nation-wide program of educational broadcasting.\nThe latest of such meetings was held in Washington, D„ C. , on Wednesday,\nJuly 27, with the following persons in attendance:\nArthur S. Adams President, American Council on Education\nJohn C. Adams Chairman, Committee on Television, American\nCouncil on Education\nFrank E. Schooley\nPresident, National Association of Educational\nBroadcasters\nA„ No Jorgensen\nRalph Steetle\nGeorge Stoddard\nHe K, Newburn\nRobert D„ Calkins\nRichard B* Hull\nChairman, Joint Committee on Educational\nTelevision\nExecutive Director, Joint Committee on\nEducational Television\nChairman, Educational Television and Radio Center\nPresident, Educational Television and Radio Center\nMembers Executive Committee, Educational\nTelevision and Radio Center"
}