{
  "id": "d570-42",
  "text": "- 3 -\nPolicy Committee of the Joint Council on Educational Television outlined in (2) above, a\nsingle integrated Washington office with a single director to accept such functions and to\ncarry out such activities and services as are assigned to it by this committee. This\noffice will be responsible to the Policy Committee of the Joint Council and will be com¬\npletely unified in its staff and services. The staff will not be representative of any\nspecific agency but of the entire movement. This Washington office will become operative\nJanuary 1, 1956. It is assumed that the American Council on Education will accept the\nfinancial trusteeship for the enterprise.\nAmong the functions to be served by this integrated Washington office will\nbe those now carried by the present Joint Committee on Educational Television and\nthe Citizens Committee which the Policy Committee decides should continue to be\nconducted from Washington. Obviously, the relationships with the FCC and other divi¬\nsions of the national government must be cared for by this office. The extent to which\nfield services, publications, and other such matters will be assigned to the Washington\noffice will depend upon the analysis to be made by the PoliQy Committee and its ability\nto arrange for other agencies to handle such functions as are not essentially tied to\nWas hington.\nIt is recommended that this proposal be presented to the five parent organiza¬\ntions (or their responsible committees) for their approval prior to September 1, 1955.\nIt is further recommended that the three ex officio members of the Policy Committee\nmeet at the earliest possible date following September 1, 1955, to work out details of\nthe program, to prepare a budget and seek funds in support of the enterprise for a\nminimum two-year period beyond January 1, 1956.\nThis proposal was approved by the following persons in their capacities as\nleaders of the five organizations with the understanding that it will require in varying\ndegrees the official approval of their organizations in order that it be made effective:\nArthur S. Adams President, American Council on Education\nJohn C, Adams Chairman, Committee on Television, American\nCouncil on Education\nFrank E. Schooley President, National Association of Educational\nBroadcasters\nAc N. Jorgensen\nRalph Steetle\nChairman, Joint Committee on Educational\nTelevision\nExecutive Director, Joint Committee on\nEducational Television\nGeorge Stoddard Chairman, Educational Television and Radio Center\nH. K„ Newburn President, Educational Television and Radio Center\nNote: Raymond H. Wittcoff, Chairman of the National Citizens Committee on Educational\nTelevision, who took part in the early meetings of the five groups was unable\nto be present for this final meeting. Mr. Wittcoff, however, wishes to indicate"
}