{
  "id": "d570-57",
  "text": "TO:\nNAEB Members\nDATE: September 20, 1955\nFROM: Frank E. Schooley, President\nRE: 1955 Convention and related Association business\nI wish I had time and opportunity to talk with each of you personally, or at least\nhave a chance to exchange correspondence with you personally. I don’t see how that\npossible. So, I resort to this official document. I’ll number the items, so you\ncan check off your actions or reactions. If we get a good response to all items\nhere, we’ll have gone a long way toward saving good time at the convention.\n1. The Board of Directors of NAEB will meet at 10 a.m., and at 2 p.m,, Tuesday,\nOctober 25, at the Del Prado Hotel, Chicago. If you have any items on which the\nBoard should act, or consider, please mail them to me no later than October 8.\n2. The Advisory Committee to the President of the Educational Television and Radio\nCenter will be meeting Tuesday night. Board members not on the Committee will be\nmeeting with Region V members.\n3. Region V is meeting at 2 o’clock,and at 8 o'clock, according to Director\nMarguerite Fleming. Del Prado Hotel.\n4. Sites for the 1956 and 1957 conventions will be selected by the 1955 convention\nThe present committee, of which Burton Paulu, KUOM, University of Minnesota, is\nchairman, will make the recommendations to the convention on the opening day.\nActual selection by the convention will be made Friday morning, October 28. If you\nwish to be host to either the 1956 or the 1957 conventions, be sure your invitation\nreaches Burton Paulu no later than October 10. Invitations are already on hand for\nboth years.\n5. THE RADIO FESTIVAL is scheduled for 8:30-10:00 p.m., Wednesday, Thursday, and\nFriday nights. You are requested to make recommendations to Kenneth Wright, WUOT,\nUniversity of Tennessee, regarding any outstanding educational radio program which\nshould be played and discussed-evaluated at the convention. There will be three\nsuch shows scheduled for each evening. A half hour will be allotted to each show.\nShows which can be furnished on tape and for which a producer or director can be\npresent to discuss will be given priority or high priority by the Ken Wright\nCommittee. Send all suggestions, and all information to Ken Wright no later than\nOctober 5. Only those shox/s selected by Ken’s Committee will be listed for evalu¬\nation. Here’s a good opportunity to get into special, particular problems of\nplanning and producing good educational shows.\n6. THE TELEVISION FESTIVAL is also scheduled from 8:30-10:00 p.m., Wednesday,\nThursday, and Friday nights. You are requested to make recommendations to William\nHarley, WHA-TV, University of Wisconsin, Madison, no later than October 5* As in\nthe case of radio, three shows or parts thereof will be shown each evening. Avail¬\nability of film or kinescope, and of producer or director will be high on the\nrating scale of the committee. Selected programs from ETRC — the Center — will\nbe shown at the Festival. Here’s a good chance for program evaluations, too.\n7. Now we come to another important item, or items. Proposed changes for the\nconstitution and/or by-laws. These items will be treated in a separate document,\nDocument A if you want a label.\nFES:wc\nEnclosures"
}