{
  "id": "d570-58",
  "text": "DOCUMENT A\nPROPOSED AMENDMENTS to Constitution and By-Laws,\nNational Association of Educational Broadcasters\nSeptember 20, 1955\nConstitution: It is not proposed to amend. Each of you were furnished with a copy\nat 1954 convention, or supplied by mail. Constitution pertains to (a) Preamble,\nArticle I on Membership, Article II on Officers, and Article III on Amendments.\nBY-LAWS: Article I - NAME - which now reads: \"The name of this Association shall be\nthe National Association of Educational Broadcasters,” by substituting the following:\nProposal A. The name of this Association shall be the National Association\nof Educational Radio and Television Broadcasters.\nProposal B. The name of this Association shall be the Association of\nEducational Radio and Television Broadcasters.\nProposal C. The name of this Association shall be Educational Radio and\nTelevision Broadcasters.\nArticle III - Membership, Section la(3), which now reads: ’’Each Active\nMember shall be entitled to TWO votes. Where active membership is on the basis of\nboth a radio and television station or stations, the authorized representative of\neach such type of station or stations shall have ONE vote, and shall be entitled to\nparticipate in all affairs of the Association without reservation,” be amended to\nread:\nProposal D. Each Active Member shall be entitled to TWO votes, except\nthat members owning and operating three or more radio and/or television transmitters\nshall be entitled to three votes. Institutions holding Active membership may\ndesignate how the two or three votes shall be cast. Otherwise, the director or\nmanager of the radio and/or television station or stations of the Active Member, or\nother authorized representative or representatives, shall be entitled to vote and\nact for such station or stations of the member institution or body in all matters\npertaining to the mutual welfare of the Member and the Association.\nArticle III, Section la(4) which now is last sentence in paragraph immediately above.\nProposal E. Substitute for III, Sec. la(4) the following: (4) Each\nAssociate Member shall be entitled to one vote, provided, however, that no combina¬\ntion of votes (for Actives and Associates) shall give any one institution more than\na total of three votes. If the NAEB by-laws grant three votes to any such Member,\nsaid Member institution shall specify how its three votes shall be cast and by whcm.\nProposal P. Article III, Section lb(2) which now reads: ”An Associate\nMember shall not be entitled to a vote in the Association, excepting as its repre¬\nsentative may be a member of an Association committee, but otherwise may participate\nfully in the activities and receive the services of the Association,” be amended by\nstriking out ’’shall not be entitled to a vote in the Association, excepting as its\nrepresentative may be a member of an Association committee, but otherwise.”"
}