{
  "id": "d570-59",
  "text": "-2-\nArticle IV - Districts - which now reads: \"The areas served by Association\nmembers shall be divided into six districts, numbered one through six* The Board of\nDirectors shall, by resolution, designate the areas to compose each of the six dis¬\ntricts, and the Board of Directors may, by resolution, change such designations from\ntime to time”, to be amended to read:\nProposal G. \"The areas served by Association member shall be divided into\nnot fewer than six districts nor more than nine, numbered one through six, seven,\neight or nine as the case may be. The Board of Directors shall, by resolution,\ndesignate the areas to compose each of the districts, and the Board of Directors may,\nby resolution, change such designations from time to time.\"\nArticle VI. Section 2, which now reads, \"CLASSIFICATION, NUMBER AND\nELECTION. No person shall be qualified to serve as a director of this Association\nunless he is a duly certified representative of any active member. The Board of\nDirectors shall include six elected directors, the immediate past president of the\nAssociation, and all duly elected officers of the Association, hereinafter specified.\nThere shall be one director elected from each of the six districts* Directors from\nDistricts cne, three, and five shall serve two years, beginning with election in odd-\nnumbered years; directors from Districts two, four, and six shall serve two years,\nbeginning with election in even-numbered years,\" be amended to read:\nProposal H. No person shall be qualified to serve as an officer or\ndirector of this Association unless he is a duly qualified voting (Active or\nAssociate) member of the Association. The Board of Directors shall include the duly\nelected regional directors, the immediate past president, and the elected president,\nvice-president, secretary, and treasurer. Directors from Districts of odd number\nshall be elected to serve two year terns and shall be elected in odd-numbered yearsj\ndirectors from even—numbered districts shall be elected in even-numbered years and\nshall serve two years.\nProposal I. Amend Article VI, Section 2 further by adding 2a, which shall\nread: Associate Members shall be represented on the Board of Directors by election\nof an Associate Member to the Board by voting Associate Members only.\nArticle VII - OFFICERS - Section 4 (which pertains to election and quali¬\nfications of the Treasurer) be amended by adding:\nProposal J. Amend Article VII, Section 4 by adding: \"The term of office\nshall be the calendar year, starting the year immediately after election,\"\nArticle VII - OFFICERS - Amend by adding Section 5.\nProposal K. Add: Article VII, Section 5. Regional Directors shall be\nnominated and elected by voting members of the respective regions. Nominations and\nelections within each region shall be in accordance with rules and regulations\npromulgated by the Board of Directors, except that said nominations for office shall\nbe called for from members no less than 90 days prior to the annual convention, that\nall nominations shall be made known to all voting members within the region no less\nthan 60 days prior to the annual convention, and a vote of all voting members shall\nbe taken by mail no less than 30 days prior to the annual convention. A majority\nvote of those casting ballots, or a majority vote of those voting members in meeting\nassembled, shall be required for election to office of Regional Director."
}