{
  "id": "d570-67",
  "text": "14 Gregory Hall\nUrbana, Illinois\nNovember 11, 1955\nC\n0\nP\nY\nMr. W. McNeil Lowry\nThe Ford Foundation\n477 Madison Avenue\nNew York 22, New York\nDear Mac:\nYou asked for my reactions, the reactions of NAEB, to the request of the Joint\nCouncil on Educational Television for a sum of $195,065.00 for 1956 operations.\nI’m happy to record them here, although I think my opinions, which are subscribed\nto by the NAEB Board of Directors, are generally known, including members of JChi.\nFirst, let me say that I favor a united front. It was NAEB who requested\nPresident Arthur Adams of the Merican Council of Education to call a meeting of\nthe five interested groups to discuss possibilities of eliminating overlapping\nfunctions and services. This was some two years ago.\nI favor the elimination of overlapping operations, not only because educational\ntelevision will be better served, but also on account of the lack of realism in the\nspending of monies and energies, no matter what the source. I do not care that all\ndo not agree with me (with NAEB), and I do not believe that all should necessarily\nshare my views, but I submit no one can say that NAEB has not given every indica¬\ntion of its willingness to mutually agree to solutions of problems m educational\ntelevision broadcasting. I submit the NAEB-ETRC relations as an example and you\nmay check with President Newburn of the Center, or with the Executive Committee\nof the Center Board. This is not to indicate that problems haven t arisen, but\nwhen posed we’ve agreed to workable solutions.\nAs a matter of record this JCET request was agreed upon by a quorum (five) in\nattendance at a meeting in Washington on Wednesday, November 2. I was the only\nnon-Washingtonian in attendance. Others present were Belmont Farley, NEA:\nFranklin Dunham, AERT: Edgar Fuller, Chief School Officers; and Russell Thackery,\nLand Grant College Association. The JCET vice-chairman, Edgar Fuller, presided.\nIt is a matter of JCET record that I voted against the requested budget. These\nstatements should not be interpreted to indicate that President Jorgensen does not\nsubscribe whole-heartedly to the request. I’m sure he does.\nIt is also an acknowledged fact, or should be, that I stated to those present that\nI felt that the JCET attitude had been the most troublesome in the efforts to\nbring all interests together, that JCET did not go into the meetings aimed a\nsolving the common problem with the same spirit that other groups had entered sue"
}