{
  "id": "d570-68",
  "text": "Mr. W. McNeil Lowry\n- 2 -\nNovember 11, 1955\ndiscussions. When the question as to what the statement agreed upon by Jorgensen\nand Newburn (to which I was also a party) meant, I pointed out that it was intended\nto be a limiting statement regarding the functions of JCET. I also expressed my¬\nself as favoring a budget request in the neighborhood of present figures, $120,000\nto $150,000, having not had time to study carefully all details. I was a minority\nof one\nNAEB is willing, like the Executive Committee of the Center Board, to accept the\nJCET decisions pf October 6, as modified by the Jorgensen-Newburn statement, but we\nstill prefer the original Washington Compact11, although we would be quite willing\nto modify to inelude on the five-man policy committee representation of the NCCET,\nand one from the elementary-school group.\nAlthough indicating he was expressing only a personal opinion and would have to\nseek JCET concurrence. President Jorgensen agreed to the original Washington Com¬\npact, assuming insertion of the following sentence, \"It is anticipated that the\nfirst at-large members will represent land grant college and national citizeil inter¬\nests\" was not understood by him, although Newburn and I recall no objection to\nDr. George Stoddard*s suggestion. President Arthur S. Adams of the American Council\non Education also agreed to this Compact, (it is an interesting sidelight that\nalthough at least one other JCET member was sent copy of the Adams* letter support¬\ning the JCET request, I was not sent a copy by JCET.)\nHaving reviewed some of the problems and proposals, in particular in the current\nJCET request, I must say that I feel the \"merger of interests\" seems only partially\nattained at this time. I think other desirable steps remain. Such problems as\ncitizens* representation on the Council, the study and elimination of overlapping\nactivities or the clear definition of activities, for example, remain undefined\nexcept for the broad statements of Newburn-Jorgensen and the JCET statement with\nrespect to citizens’ representation.\nSo that you may have a proper basis for appraisal of my remarks, may I say that as\nNAEB president I have been given discretionary power by the NAEB Board of Directors\nto speak for and act for NAEB in handling this problem. This I have never said in\nmeetings, including JCET meetings, so that my position would not be misinterpreted\nby some when I happened to express viewpoints different than some others.\nThanks for the opportunity to express these views on the JCET proposal. I stand\nready to answer additional inquiries whenever required, and I*m quite willing to\ndiscuss these matters with all parties concerned.\nSincerely,\nFrank E. Schooley\nPresident\nFESicjf"
}