{
  "id": "d570-71",
  "text": "-2-\nto exhibit their own ignorance, I suspect this group was the majority*\nThis is not too healthy of a condition* The primary purpose of the work¬\nshop should be to help the lower echelon group, not to help the smart top\nbracket get smarter*\nHow, if we ere going to do all of this, how are we going to do it? I sug¬\ngest we deploy our own forces and use them for resource persons in their\nspecial fields and use resource persons from manufacturing companies only\nas auxiliary help* Let them be there and make them available on a person\nto person basis but limit their use of educational time for promoting\ntheir particular equipment*\nIn this manner we can have a planning session with all of the resource\npersons in advance of the actual workshop and iron out who will do what\nand do it with minimum overlap into somebody else2s territory. Conceiva¬\nbly this could be done in two days immediately before a three day workshop*\nAt the risk of sounding like a school marm, whether you are on the re¬\nsource people5 s level or at the level of a class participant, you do three\nthings* I, You talk about what you are going to do* 2* Yon do it,\n3o You evaluate what you have done so that you can do better the next\ntime,\nho Only complaint on physical set-up: The combination of heat, smoke filled air\nnot moving, darkened rooms (necessary if you are going to show slides) do not\nmake for maximum attention on the part of participants •\n5* When we actually get to the buying phase of kine recording we will certainly\ncall on NAEB or some of the more experienced engineers that it has been ny good\nfortune to meet at this 1955 workshop*\nWell, Gee, you asked for ideas. Herecs mine* Maybe you will think Ism shooting\nat the moon* In any event the purpose of ny preceding discourse is not to criti¬\ncise the past workshop but to suggest somewhat of an ideal for the future* May¬\nbe it csn?t be done at all. Maybe it would cost too much. Maybe our own experts\nwouldn*t be available as resource persons to conduct a particular block of the\nworkshop at a particular level of understanding. Maybe the whole thing should\nbe conducted on a regional basis splitting the country four or five ways. Any-\nhoo if everybody gives it as much thought as I have, you should come up with some¬\nthing out of these 30 or so reports,\nI certainly think the workshop was worthwhile for me sad it was a genuine pleasure\nmaking the acquaintance of the other engineers there. We»re a long way from no¬\nwhere out here.\nR, E, Baird\nWSUI—\nIn any evaluation of the 1955 NAEB TY Technical Workshop or a comparison with the\n1951* Workshop, consideration must be given to the following: The 1951* Workshop\nwas the first one ever held and it was expected that mistakes would be made which\ncould be corrected in following programs* Also the 1951* Workshop was planned for\nengineers with vastly different degrees of proficiency in the field of television.\nThe general program was designed to make them better acquainted with different"
}