{
  "id": "d570-72",
  "text": "manufacturers products and to give them an opportunity to study operational methods\nin the larger television installations,, By contrast, the 195& Workshop was planned\nfor those engineers who had a good knowledge of all equipment and of operational\nmethods as well* These engineers were carefully selected from applicants who were\nalready engaged in television work and represented the key people in each institu¬\ntion- It was expected that they would return and pass the information gained, to\nthose working under them. The program was planned to stress those problems which\nengineers in educational television stations found most difficult* For this reason\na major portion of the program was taken up with problems associated with kinescope\nrecording although adequate time was given for lectures, discussions and demonstra¬\ntions of other subjects>\nAlthough the term \"Workshop” indicates that participants would spend much time\noperating equipment by themselves, this was not the case during these sessions^\nEquipment was available, but in most cases, those attending had already stifficient\nexperience in such routine operation* Rather, the value was obtained through\nlectures given by experts in the various fields and opportunity to discuss general\nand individual problems with these experts* Numerous demonstrations were in¬\ncluded, using available equipment, which seemed entirely adequate*\nWith the above in mind, the selected number of twenty-five participants seemed to\nbe a good choice. With a greater number, the program would have been unwieldy\nand individual attention could not have been given* Likewise, the feeling of in¬\nformality, which is a great advantage, would have been lost, A lesser number\nwould not justify the effort expended in securing expert instructors, as well as\nfunds for other necessary items*\nThe program was planned so as to allow evening hours for informal discussions and\nquestions. This is always difficult to organise and conduct and a certain number\nof semi-forma! talks must be pre-planned in order to start discussion* While such\ninformal discussion seemed to be a minimum during these sessions, the fact that all\nparticipants were housed together in one wing of a dormitory, led to many healthy\ndiscussion periods during the later evening hours*\nAll sessions were started and ended reasonably well on time* There is a question\nas to whether more spare time could have been given participants but with the sched¬\nule as outlined it was necessary to start early and end late* It is thought that\nmore was gained than lost by this arrangement* The material could have been sched¬\nuled to cover several more days at a more leisurely rate, but with other demands\non participants8 time, it is thought that they would probably have lost something\nin enthusiasm and interest if the workshop had extended into the second week* Ac¬\ncommodations were excellent as were facilities for carrying out the program.\nAlthough this participant may be somewhat biased, having had a part in the prepa¬\nration of the workshop program, to him it seemed to be outstandingly successful*\nThe workshop was worthwhile if only for one phase—that of kinescope recording,\ninformation about which was badly needed by educational television engineers* A\ngreat deal of credit is due Mr* Cecil S, Bidlack for his capable and efficient\nhandling of all details connected with the workshop* It was a valuable and very\nmuch worthwhile experience*\nCarl H0 Menzer"
}