{
  "id": "d570-77",
  "text": "could be for three days over a week-end... Travel on this basis would not be\ntime consumingo The regional workshop would not be meant to replace the\nnational workshop but would be a supplement to it and help act as a clearing\nhouse for the annual national workshop*\nClement E© LaFond\nWTHS-FM-TV---\nThe following notes are respectfully submitted in compliance with the NAEB TV\nEngineers request. It is to be understood that the undersigned has had a tele¬\nvision station in operation only a relative few short weeks, and that TV experi¬\nence does not exceed this by much.\nComments are based only on my own reactions, for it would be impossible to have\nme reflect any normative opinion which might apply to all,\nlo I would like to see a program which, to a greater degree, was more sensitive\nto participants* requests** While any and all of the content was timely and valu¬\nable for me, the emphasis on video recording did not meet sy most urgent needs*\nUndoubtedly it is very difficult to provide the wide array of talent and expert\nence which graced the speakers platform., It is, and always will be true too,\nthat education must take the individual differences of the participants into ac¬\ncount o\n2, In 19U9 the writer was privileged to visit a radio conference which favora¬\nbly influenced his performance in setting up an fm operation for five years after¬\nwards e I looked forward to, and achieved the values hoped for in this second\nopportunity at Michigan in 1955. To state a few of these objectives? Chance to\nlearn of new equipment; new techniques, new theories; get acquainted with exist¬\ning principles and practices; gain an awareness of TV station progress, problems\nand people in NAEB.\n3c If at all expedient, there might be several “shop” segments of time allotted.\nActually, these would merely be a lab presentation of what was so admirably covered\nin our cirriculum for the week by lecture, by lecture-demonstration and by discus¬\nsion teaching methods- There would, however, be the opportunity for people who\nfelt the need for something. *. -to try their hands at it© Perhaps there might be\nprovided a two-hour period for \"shop\" where participants could enroll, in a limited-\nnumber activity© With several shops going at once, or the same one repeated over\na few nights, a \"rich experience\" could be had ty all.\nAll through the week I had the urge to climb the WKAR lighting grid to check the\nweld technique where the vertical supporting rods were secured to the pipes.\nAn opportune moment never seemed to present itself. (At this point I hasten to\nadd that I8m thankful for the opportunity to get the full lighting treatment, and\nto have spent five days exposed to a lighting system). Thus, a \"shop\" segment\nmight have entailed a lighting problem, a test equipment problem, a camera chain\ncheckout with new.©,.or just plain good...equipment.\nk> In spite of the item §3 comments, I wish to observe that a workshop need not\nnecessarily need to be an experience where work itself is accomplished., We can\nreadily talk about building a bridge (and utilize the audio-visual tools of educa¬\ntion which we \"tout\") in an exchange of knowledge and experience, and never once"
}