{
  "id": "d1227-29",
  "text": "27.\ncountries with 6 different languages: Great Britain, France, Belguim, Holland,\nItaly, Denmark, Switzerland, West Germany. Only six different languages were\nnecessary because Switzerland could use another language and the Flemish parts of\nBelgium could listen to the Dutch part of the broadcasts. Far more important was\nthe difference in standards, i.e. the English system was 405 lines to the picture,\nand France had 319 lines to the picture. It was a real headache for the engineers\nto arrange any kind of exchange, but working through the heads of the countries they\nfinally covered over 400 miles with 41 TV transmitters and 80 relay stations. In\nnone of these was coaxial cable used at all.\nHThe basic increment of programs of last July was the world soccer meets in\nSwitzerland. However, each country participating was going to give a program that\nwould be representative of the kind of material available in that country to the\nnetwork so all countries could see the program and have a commentary on at all times.\nA not inconsiderable problem as you can see, but I saw several programs and it did\nget across—not once was the wrong language used in the wrong country and each was\nconverted to the correct number of lines. The programs were astonishingly clear,\nalthough far from as good as a local broadcast. In Switzerland they had the yearly\nfestival of Narcissus; in Italy, a visit to the Vatican and an address by the Pope\nin five different languages; France gave several programs from Paris and Versailles;\nGreat Britain had a variety show; and from Glasgow there were track and field events\nand Queen Elizabeth reviewing the Royal Navy. Germany showed a summer evening on\nthe Rhine; Holland had a show especially for the children of displaced persons.\nFrom Copenhagen came the celebration of St. John’s Eve and in Brussels they had a\nsummer night on the Grande Place.\n“Not only were there engineering problems, but a week or so before the programs\nwere to take place, an added problem came up as there was a disagreement between the\nsponsoring countries and the International Federation of Musicians. It meant a\nnumber of programs had to be changed from music to other types.” (Shows additional\npictures of what was seen and the layout of the network.)"
}