{
  "id": "d831-16",
  "text": "(Kcwoosib departs)\nMERKELL t Shall ve do It Gaxxiner's way Assume we have X number of dollars^ as Gardner\nsuggests^ and oan usd it for a researoh program*\nAlXINSs Are our subheads under output given us the reseax*oh oommlttee OK?\nMEBRILLt HO* We will atten^t to catalog our problems after we suggest some* We oan then\nmake our own subheads*\nMOOBEt Are these questions We think juddtgfc ou^ to be researched?\nMERRILLt These are questions we think should be researched* Not hypotheses to be tested*\nWe oan suggest them as areas for researoh efen If we don*t have a hypothesis or prediction*\nListing of Problems for Researoh\nFLICKS 1* Attitudes by administrative soeaders towards the use of £17* The image of\nET7 bF the top executive who makes the decisions about it. Attitudes by the men from\nwhom the money comes*\nGARDNERS he executive sees the programs as a stimulus to act on somebody elese* He\ndoesn't want to watch them himself*\nThis leads into the examination of the natdre of the processes within the community\ngenerating pressures to contiol programs in texms q£ gtorxp interests by particular groups\nin the community*\nQuestioni Does program accomplishes the purposes of the group tliat gives the\nmoney of makes the dedson that puts it on?\nWe often have to subdivide the puzposes of the program into sub-purposes* It may\naooomplish seme purposesj net others*\nThe same gioiqp may have more than oae purpose^ different groups with different purposes\nmay be behind the same progrma*\nCHEIDIEUR:\n2* Find out what is the cost of a particular program* Now* We need a unifozm\ncost accounting procedure^ for accounting production natiomddCi comparing different\nstations*\nGARIli£Rt We need the same good accountant going around to different areas asking\nthe same cost questions in each station*\nCHALMERS: 3* Where will oontinuing long texm support oome from?\nU* How oan we effectively use other media to promote—publicize—stimulate the\npotential ST7 audience?\nHERRILIi: Are the major problems relating to money? Are they relating to content? Are\nthey: what is the purpose of the message?\nMERRILL—MARQUIS: 5* What are the different intents (purposes) of different ET7 stations?\nGARDNER: 6* What techniques are most appropriate in putting across scane particular purpose\n(e*g*, teaching)*\n7* What about problems of easting percons on camera*\n6* Qsestlons of visvial-aid techniques^etc* Presentation technique questions*\nMCX)R£t Here are some specific or detailed proposals:\n9* Prestige of the man who appears.\n10* Dsnotative (informational, directive) teaciiing versus oonnotative (indirect,\nSooratiw) teaching*"
}