{
  "id": "d831-21",
  "text": "Coimnitte® II 2\nSuch problems and the prbKLem of utilLiaing educational boroadcasrtlng to help\nalleviate the^ pressures are not new ones« At one tiiae^ propcments of educatioi^\nradio grappled with these probl^s and sugge^ed ideas for proceedingo The sta1:e\nof educational radio today should be| aiaol^ warn j ug | to those \"sdio are vitally\ninterested in seeing educational television take a prominent place in[So3lnr^^\neasing the pressure points in our sociel^o The recommendation of this\nconmittee is that as a first step we take a careful analytical look at the history\nof educational radioo Many of the pioneers of that movement are still with U8«\nThe ideas for audience research which ensue from this conference should be \"pre¬\ntested\" by inquiring Into what educational radio pioneers did in various areaso\nThe basic research on audience, we feel, is the tapping of areas of needo\nWe should take the potential and not the actual audience of educational broadcaj^ting\nas our populationo Pait of the objectives, indeed if not most, of educational\nbroadcasting should be based upon servicing the felt educational needs of the\npopulaceo If such felt needs could be drawn out throu^ research, then the whole\neducational broadcasting movement would have a firm basis upon which to ask the\ncommunity to support relatively expensive educational b roadcasting stationso\nThe audience \"needs\" oritentation involves both felt needs, potentially\nfelt needs, and perh^s some unfelt needso Felt needs are areas in which audience\nmembers consciously want programs, and are motivated enough so that they will tune\nin to them. Potentially felt needs are areas in which audience nestoers will rather quickly\nrealise an interest once the area is pointed out to thmo Unfelt needs are the\n\"educator areas,\" areas that we think people ought to be interested in althotigh\nthey don't seem to be. The burden of proof is on the educationaltroadcaster to\nshew that unfelt needs should be treated in any but a \"c«^ive” audience situatlono\nFelt needs and potentially felt needs will often h^umed yip by exploring\npressure and stress points in our culture, where one aspect of life has pulled aw^\nfrom other aapects."
}