{
  "id": "d831-38",
  "text": "Seminar on Research in Edicational Broadcasting\nSponsored hy the\nNational Association of Educational Broadcasters and\nState Tfetiverslly\nf PROSPSGTW\n0©6S6^3sr 2, 1957\nA Seminar on Research In Educational Broadcastings sponsored jointly by the\nResearch Coranltte© of the National Association of Educational Broadcasters and the\nCcranittee on Research in Coaiaunicatlons of Ths Ohio State Ifelversity is to he held\nat the Ohio IMon on the Ohio State I^Tersl^ can?5us. Decasaiber 9 throi^ 13, 1957,\nThe goal of this intensive conference Is tKO-foldt (1) to delineate a broad program\nof significant research in educational broadcasting and (2) to familiarise parti-\nc^nts with a wide range of available research tediniques can be ixtUtsed in\nthe stucly of local problems in educational broadcastings\nScope of the Seminar\nThe Seminar will eidbraca the research problems of educational radio and tele»\nvision stations, dosedocircuit television, and educational prograianing on coiEmercial\nstatlcsur and networks* It will bo concerned with levels eactondlng ftn© the pre-school\nage througdi dementaxy, secondary, college, and adult education.\nNationally, an appraisal of the iB?)act of educational broadcasting and Its role\nIn the total educational picture awaits devdopm^tit of a cosiprehensive, integrated,\n^ eountry<»wlde research program idilcdi can be systeraaticaHy iR^lemented over a period\nof years as resources become available. The Seminar will take a hard look at such\na program with partlcdar attentlcm to the need for clarifying areas of philosophical\nW confusion in the use of these media. Current research involving segments of this\nproblem by such agencies as the Fund for the Advancement of Education, the Educational\nTelevision and Radio Center, the National Associatitm of Educational Broadcaster®, t!ie\nNational Project on Agricultural Communications, and research centez^ in oducatlonal\ninstitutions will constitute a part of Vae Seminar review.\n[\nLocalOy, research personnel connected with educational radio and television\nstations and production agencies fbce frustrating problems resulting from significant\nbub coe^lex needs on the one hand srd inadeqisate financial and human resoui^es on\nthe other. The S^siinar will bring tc^ether these research persons from the stations\nand centers,and a^>ert8 from a variety of related social research fields for the\nexchange of ideas and methodology.\nObjectives of the Seminar\nThe Seminar has been planned to contribute to the following objectives!\nTo give a broad perspective to research efforts by presenting\nthe social (Climate in the TJhited States in whlc^ typical prob*\nlams of broadcasting are fostered.\nTo dellneat© the varied areas of reseandx appropriate to the\neducational radio or television station in its coverage area.\nTo delineate a series of significant problems of mutual concern\nto both coBsnercial and educational broadcasters which might be\ncooperatively studied and financed.\nli. To suggest critical coraiunlcation research studies of nationwide\nscope whi<di Toquire large-scale financing."
}