{
  "id": "d831-46",
  "text": "THE OHIO STATE MOTERSITr\nColumbus 10\nOf jplce of Radio^Televlslon Education\nDeceoibey 2, 1957\nTO: Participants in N/IBB Seminar on Research in Educational Broadcasting\nI am delisted to learn that you are to be a participant Sn the Seminar m Research\nin Educational Broadcasting xdiich is sponsored by Hie Natioml Association of Edu¬\ncational Broadcasters az3d The Ohio State IMiversity* The enclosed Psrospectus\nsiTOliss zttore cflo?>lete information about this intensive conference. The NAEB Research\nCoRmittee is roost hopeful that out of the Seminar may come a diallenglng program of\nresearch for the years ahead. It gives promise, too, of being stimuLLatii^ and helpful\nto participants in their own research activities throu^ the interchange of ideas and\nmethodology.\n(1) Enclosed are two tax exempt certificates for use in purchasiisg your\ntran^ortation. The Bhiversity of Illinois, whidi will reimburse you for\nyour travel, will not pay the transportation tax so be sure to use the\nexen^jtion certificate. If you need more blanks let me know immediately.\nIh filling out certificate, give your title as **NAEB Consultant.”\n(2) Wilte me imnediately your e^qpeeted arsdval and departure tin^s so\nthat we may make the appropriate hotel reservatitms at the De^er-Hiltcai\nHotel in ColuRd}us.\n(3) When you write, pl^se give name and title as you want it to appear ^\non the Seminar roster whicdi will be distributed to evexyone. Also send a\nbrief histoiy of your acadatnic and vocational achievementsi/j^rtisularly\nas thsy may relate to reseaztdi and broadcasting.\n(h) The Seminar will close early in the afternoon of Friday, December 13,\nso ‘Uiat most participants can plan to leave on late afternoon or early\nevaning planes or trains.\n(5) Seminar sessions, as w^ as luncheons and dinners,will take place in\nrooms 331-E-P-<} of the Ohio TMon on The Ohio State University caa^us.\nnorth High Street buses run directly fro® Broad and High Streets, where the\nDe^ler-Hilton Hotel is located, to 12th Avenue, the location of the Ohio Tfcion.\nWe have been fortunate in securing an outstanding gro\\:^} of participants and resource\npersons. I am sure that you win not only contribute to the thinking and planning of\nthe Seminar, but will find it a roost rewarding eoqparience. I look forward to working\nwith you.\nSincerely,\nIKTtbw\nends.\nI. Keith Tyler\nSeminar Director"
}