{
  "id": "d831-57",
  "text": "2o Invited but not yet heard Svcmt\nMr. Richard Husband, ELorida State TIniversilgr, Tallahassee, Florida\nMr. Herbert Gerjoy, Toledo Public Schools, 1901 W. Central Avenue, Toledo 6, Ohio\nMr. J* Stacy AdanSs Depasrtoent of Cominmicatlon and Journalism, Stanford\ntfniversity, Stanford, California\nDr. William MLndak, Assistant Professor, Ifaiversity of Minnesota, Saint Paul,\nMinnesota -f\n3« NAE3 Research Committee Members (excluding Coleman at his own req^st):\nDr. Sam I. Becker, Eicecutive Secretary, Television Center, Stats lhaiversity\nof Iowa, Iowa City, Iowa\nHr. Gale R« Adkins, Radio-TV Research, IhxLversity of Kansas, Lawrence, Kansas\nDr. Kenneth Harwood, Dept, of Telecommunications, Universiiy of Southern\nCalifornia, 3518 Ifoiversity Avenue, Los Angeles 7, California\nDr. Clarence ELick, 833 Ninth Avenue, Santa Monica, California\nDr. I. Keith Tyler, Director, Office of Radio-Television Education,. Ohio\nState University, Columbus 10, Ohio\nMr. TmHng R. Merrill, Director of Research, Station WKAR-TV, ^^chigan State\nUniversity, East Lansing, Michigan\nMp. R^mond D. Cheydleur, Assistant Director, Radio Station WFSU, The ELorida\nState University, Tallahassee, ELorida\n4. Alternates, some of whom it may yet be possible to invite, in order. (Mail\nnothing yet. If and as mailings are indicated, 1*11 call or wire to indicate\nto which) •\nJdhn Parsey, Lincoln, Nebraska\nMr. Lawrence l^rs. Radio Station WAER, Syracuse University, Syracuse, New Xork\nHoward Rowland\n«Mp. John K. Eoiger\nWairen 6. Findley\n*Mr. Louis Heid\n*Mr. Roy Carter \"\nStanley DeGraff, Producer, Experimental TV Program, Station KSDS, San Diego\nCity Schools, Education Center, Park Blvd. at El Cajon, San Diego 3, California\n«*Mr. Raljh Dailard\nProfessor Harry I^foore, Dept, of Sociology, University of Tems, Austin, Teocas\n•* Exact ^^iddress not available. We ahnii \"trace” and forward address if it becomes\nnecessary*\nOnly one from San Diego\nHJS/dc\nNovember 27, 1957"
}