{
  "id": "d831-80",
  "text": "Harold Hill\nPage 2\nKoveml^er 7# 1957\nfhe result of adding Crary, Sloan, Seldt and Bllery to\nthe ton twenty was to mish Hushand, Oerjoy, Parsey and Myers\nfrnrther down the list. Incidentally, Harry said at the first\nmeeting that 23 or 24 persons would irohahly be nossible—bat\nhe did not mean it as a promlsie or commitment.\nTou (or somebody) have the problem of disnosing of the\n’’leftover” T)eoiole in a way that can be defewied . Here’s what I\nsuggest. The St. louis subcomlttee recommended inclusion of\nHeidt and Ellery, but those two were not on the original ballot\nand more members voi^ on the ballftt than were present at St.\nLouis. I surest removing Crary, leidt, and Ellery and moving\n^sband, Cerjoy and Parsey uo. Sloan, I feel, sh'^uld stay be¬\ncause of his position on the original list. (Perhars somebody’s\nrefusal will open the d«or for larry ^^r6. Hope so.) Justifi¬\ncation for the action I suggest w^uld be ths't of settling contro¬\nversial cases by going back to the original mail vote and Hay’s\ntabulation.\nPlease understand I’m not doubting the accuracy of my\nown list or my interpretation of '>ur deliberations in the St.\nLouis meetings. However, since a decision Is needed, I suggest\nwe settle the controversial cases on the basis of the mall ballot*\nHeidt and 23.1ery c^uld be added to the list immediately followinjg\nMyers. Refusals might provide space for them axywsy.\nIncidentally, the difference in sequence of names on\nmine and Harry’s lists is not puzsling. He probably listed names\nin order of mention in our first meeting discussion. I arranged\nthe naJBes as much as possible to follow the sequence on Ifey’s\nlist of rankings. Also, Harry was n^t at our second meeting.\nFor my part, do feel free to reconcile the differences in\nany way you think best. I believe that all the members of the St.\nlouis subcommittee would feel that way about it. I did want to\nsuggest what I regard as a reasonable solution to the problem.\nBest regards,\n(Sale R. Adkins\nRadio-TV Research\naMskt\nP,S. Husband is at Florida State University,\ncc t Hay Cheydleur"
}