{
  "id": "d1412-4",
  "text": "-5-\nRadio Planning Conaalttee\nLawrence Frymire, Chairman, Station WEAR, Michigan State tfiaiversity, East Lansing,\nMichigan\nEdwin G* Burrows, Station WHOM, University of Michigan, Ann Arbor, Michigan\nHo Bo McCarty, Director of Broadcasting, Uhiversity of Wisconsin, Madison,\nWisconsin\nHugh Mix, Station WNAD-AM, University of Oklahoma, »an, Oklahoma\nBurton Paula, Director of Broadcasting, University of Minnesota, Minneapolis,\nMinnesota\nHarold Winkler, President, Pacifica Foundation, Berkeley, California\nResearch Committee 'fls'\nSam Becker, ^hajrro^, EjcewJjH^^Soea^tary, Television Center, State University of\n— ^iowa, Iowa City, Iowa\nCo Ro Carpenter, Pennsylvania State University, diversity Park, Pennsylvania\nJack Ellery, Wayne University, Detroit 2, Michigan\nRichard Evans, Department of Psychology, University of Houston, Houston, Texas\nFo Wells Foshay, Institute of School Experiiasntation, Teachers College, Colunibia\nUniversity, Hew York, New York\nKenneth Harwood, Station KUSC, diversity of Southern California, Los Angeles,\nCalifornia\nCharles F® Hoban, University of Pennsylvania, Philadelphia, Pennsylvania\nHideya Kumata, College of Ccsmnunioatian Arts, Michigan State University, East\nLansing, Michigan\nDallas Walker Scythe, Graduate College, University of Illinois, Urban®, Illinois\nBruce Westley, School of Journalism, University of Wisconsin, Madison, Wisconsin\nTV Planning Committee\nJack McBride, Chairman, Station KUON-TV, University of Nebraska, Lincoln, Nebraska\nJohn C. Crabbe, Station KVIE, Central California ETV, Sacramento, California\nWilliam Dempsey, Station WQED, Pittsburgh 13, Pennsylvania\nHertford N* Gusm, Itaager, Station WGBH-PM-TV, Cambridge 39, Massachusetts\nStephen C„ Hathaway, Miami University, Oxford, Ohio\nHoward Holst, Station WKNO-.TV, Msnphis, Tennessee\nBrice Howard, Station WMSB-TV, Michigan State University, East Lansing, Michigan\nJames Morris, Station KOAC, Oregon State College, Corvallis, Oregon\nRichard L« Rider, Director, Chelsea Closed Circuit TV, New York, New York\nPaul K® Taff, Station WMVS-TV, Milwaukee Vocational & Mult Schools, Milwaukee, Wisoc\nUtilisation Committee\nGale Adkins, Chairman, Radio-TV Research, University of Kansas, Lawrence, Kansas\nRadio Subcommittee t\nGeorge C. Johnson, Chairman, Station WFIU, Indiana University, Bloomington,\nIndiana\nGertrude Broderick, Office of Education, Washington 25, D. C®\nJames Pbllows, Empire State PM School of the Air, Syracuse University,\nSyracuse, New York"
}