{
  "id": "d1046-4",
  "text": "N-A-E-B ANNUAL MEETING — October 26, 1947 — CHICAGO, ILLINOIS\nSUMMARIES Of SPECIAL TALKS\nI. facilities, Budgets and Standards for the Educational Station...\nHarry Skornia.\nMr. Skornia based his report on information received from 17 members\nstations. The detailed figures are not of great significance, except\nas they reveal general trends and tendencies. The impression gained,\nhowever, is that educational stations are comparing favorably with\ncommercial outlets in the way of salaries and physical facilities.\nThe need is shown for a central clearing house which will have'more\ncomplete information available to actual and potential educational\nbroadcasters, Members would supply information which grows out of their\nown experience. This is an area for greater NAEB service.\nECC Services to Educational Broadcasting...harry M. Plotkin, f.C.C,\nMr. Plotkin reported that the F.C.C. machinery was, by the nature\nof things, geared to the operations of commercial broadcasters; but that\nevery effort was made to give educational broadcasters all possible\nassistance. He pointed out the opportunity available to potential edu¬\ncational broadcasters through the EM channels now reserved for nonr-\ncommercial use.\nThe dear-channel matter, as it affects educational broadcasters,\nis now under consideration, NANB stations are being heard, Plotkin\nsaid. Ample times will be allowed for all to be heard.\nOn the matter of the high-band vs, low-band FM problem, Mr. Plotkin\nwas of the opinion that no changes should be made now lest the public’s\nconfidence in FM be destroyed. Tampering now would be a misfortune at a\ntime when positive action is needed.\nEducational broadcasters can, by united action, assist the ±CC in\nbringing to its attention problems and recommended solutions. The\ncommission is anxious to act in the public interest, but needs evidence\nto support its stand. N'AEB representation, as a central office, in\nWashington would be highly desirable. Through such a central agency\na better impression could be assured at hearings and through interested\ngroups.\nU.S. Office of Education Radio Service...Dr. Franklin Dunham\nThe Office of Education has extended its services and work in the\nradio field. Its transcription and script libraries are available. Some\nmay be used for broadcasting by special arrangement. Dunham solicited\nthe aid of broadcasters in enlarging the collection.\nThe Office of Education has several projects under way, including;\nthe comparative values of audio-visual media in learning, evaluation of\nradio education work, standards of training in radio, registry of research\nstudies in radio, equipment survey, and further studies on Em’s place in\neducation."
}