{
  "id": "d1046-5",
  "text": "Dunham offered the facilities of the Office of Education to NAEB in\nextending pertinent information. He explained that the Office has contacts\nwith people in educational ports and can get a hearing when needed. The\nOffice, he said, can render a liaison service for educational broadcasters.\nThe Demonstrated Potentialities of PM for Darge-^rea Coverage...\nC. M. Jansky, Jr.\nMr. Jansky illustrated his talk with lantern slides, and referred\nhis audience to copies of a printed brochure with the same title as his\ntalk. This embodied maps and diagrams. It is available upon request to\nMr. Jansky, National Press Building, Washington 4, D.C,\nPN, Mr. Jansky predicted, will change radio in all departments because\nit removes the physical limitations formerly imposed by the scarcity of\nwavelengths. Educators, thus have a virgin field in which to work - just\nas they had when AM broadcasting was in its infancy, with tne reserved\nchannels set aside for education by the PCC there is every opportunity to\nstart using radio.\nThe competition in radio, said Mr. Jansky, is not between programs-\nbut rather between facilities. PM is \"lynamite\" in the radio structure\nof this country.\nPointing to PM projects under way he said \"The University of Wisconsin\nisn't gambling when going into PM. It is a sure thing,n He urged educators\nelsewhere to use the now available PM channels before the commercial\npressure to get them gets too strong. In PM, Jansky *said, educators can\nstart without the handicaps which plague commercial broadcasters.\nSpeaking of the high-fidelity characteristic of PM, Mr. Jansky said\nthat it was a by-product of the invention. What Major Armstrong, the\ninventor, really was after was the elimination of noise and interference\nfrom radio reception.\nIn response to a query about control over programs Mr. Jansky said,\n\"It isn't a question of whether we shall have program censorship or not —\nbut rather a question of who shall do it — the government, or the man\nfortunate enough to hold a broadcasting stations license.\"\nNAEB Service.. .Bichard B. Hull\nInstead of pointing to specific services which the NAEB could render,\nas might be expected from the topic, Mr, Hull referred to the over-all\naspects of the impact of educational stations on the radio situation in\nthis country.\n\"The good emanating from the use of these new media of communications\nis to be measured by the intelligence of the people who are handling them.\"\nThe philosophy of service, Hull contended, will determine what the quality\nof the radio fare will be.\nThere is now a tremendous opportunity to serve a large audience. While\nstudies show that two-thirds of the listeners apparently are satisfied with\ntheir radio listening one-third was not satisfied. This, Hull contended, is\na healthy minority and should not be neglected. In this group, he said,\nare the influential people in every community - the leaders and the thinkers,\nInfluencing this group will have a profound result.\n- 2 -"
}