{
  "id": "d1653-0",
  "text": "hAEB\nVQH\nv>-rq,f XTTT^IO'1\nv Present)\nf\\T<TIOT.P I\nMembership;\n(fa) \"Any col?, eye or university of recognized standing engaged\nin educational broadeasting nay be elected to Membership in this\norganization by approval of the executive committee, and r two-\nthirds affirmative vote of all active members of the association.\nEach member institution shall be entitled to one vote.\n(b) Individuals of faculties of recormized institutions who\nare interested in educational broadcasting riev become associate\nembers of this association by approval of the executive committee,\nand a two-thirds affirmative vote of .all active members of the\nassociation. Associate members shall have all of the privileges\nof active membership# ex cent that they shall not be permitted to\nvote or to hold office.\n(c) Any experimental or amateur station, owned and onerated\nby a recognized educational institution, may be elected to asso¬\nciate membership.\nARTICLE 11\nXJ L&w 5$ o - ^ «\nThe annual dues or registration fees of active members snail\nby $10, payable January 1 of each year. Dues of associate members\nshall be $2*50, payable January 1 of each year.\nSugpsted changes would have the Articles read as follows;\nARTICLE 1\n{Proposed)\nMembership; _\nta) Any university, college, or public school system ox\nrecognized standing engaged in educational broadcasting over a\nradio station owned and/or operated by it may be elected to\nmembership in this organization by approval of the executive\ncommittee, and a two-thirds affirmative vote of all active\nmembers of the association. Each member institution shall\nbe entitled to one vote.\n(b) Individuals, colleges, and public school systems or\nindividuals of ’faculties of recognized educational institutions\nengaged in educational broadcasting may become associate members\nof this association by approval of the executive committee, ana\na two-thirds affirmative vote of all active members of the\nassociation. Associate members shall have all the privileges\nof active membership, except that they shall not be permitted\nto vote or to hold office. Any experimental or amateur station,\nowned and operated by a recognized educational Institution, may\nbe elected to associate membership."
}