{
  "id": "d1653-3",
  "text": "' \"NAEB NEWS LETTER.... Fob. i* 1940... Pag© 4\nThose stations already designated for hearing* under this move* et\na date to be set later* are Westinghouse Electric & Manufacturing\nCompany licenses for WBZ and WBZA. both at Boston; EYW* Philadelphia*\nand KDKA* Pittsburgh: WGY* General Electric Company* Schenectady*\nN.Y.; WESG. Cornell university, Elmirafl N»Y,; WWL, Loyola University*\nNew Orleans; and WIFI; A1 abama Poly:fechnTc~‘lri81itute and University\nof Alabama* Birmingham* Ala*\nLONGER INTERVAL FOR ANNOUNCING RECORDS\nIn the interests of public service and radio station convenience*\nthe Federal Communications Commission today agreed that station\nannouncements of the us© of mechanical records can be made at\n30»minute intervals instead of the 15-$inute requirement as hereto¬\nfore. This is to avoid interrupting the entertainment continuity\nof a recorded series of records, or of the long records now quite\ngenerally used* particularly of recorded programs relayed by wire\nfacilities.\nAt the same time. Section 3.93(e) of the broadcast rules has been\nchanged to read:\n\"The identifying announcement shall accurately describe the type\nof mechanical record used* i.e., where a transcription is used it\nshall be announced as a ’transcription’ or an ’electrical trans¬\ncription* and where a phonograph record is used it shall be announced\nas a ’record’.”\nThe Commission added religious service to the types of continuous\nrecorded programs - speech* play, symphony concert or operatic\nproduction - of longer than half an hour for which the 30-minute\nannouncement rule is waived. This change is already effective.\nNEW TELEPHONE RATE REDUCTION STUDIES\nThe Federal Communications Commission has voted to institute\nstudies as to the possibility of further reductions in the long line\nrates of the American Telephone and Telegraph Company.\nCommissioner Paul A. Walker reported that figures before the\nCommission indicate a substantial saving to te?.©phone subscribers\nmight be made without reducing net earnings of the company below\na fair return on the reasonable value of the property used in the\ninterstate service.\nThe Commission will proceed under the order of September 9* 1936*\nauthorizing an investigation which subsequently was stayed by\nnegotiations with the company resulting in reductions.\n\"THE NEXT STEP FORWARD” TO BE DRAMATIZED OYER NBC STATIONS\nQuestions that touch as all in our daily living—such as \"Who pays\nour taxes?”* \"Can we do without the ’middle man’?,” \"Are sales\ntaxes fair?”, and a score of others—will be posed and answered in\na new series of dramatic radio programs called ”The Next Step Forward”\nThe Twentieth Century Fund, a non-partisan research foundation* is\ncollaborating with the Educational Division of the National Broad-"
}