{
  "id": "d1382-0",
  "text": "ir -\n%■\nI\nA-E-B NEWS - LETTE\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nEdited by Harold A. Engel, President\nStation WHA, University of Wisconsin, Madison, Wisconsin\nApril 1, 1947\nR\nI\n%\nt\ni\nI\nI\nI-\nI\ni\nANNUAL SPRING MTING MAY 3\nThe NAEB Spring Meeting will again be held in conjunction with the Institute\nfor Education by Radio at Columbus, Ohio on Saturday, May 3 in Room 337 of the\nDeshler-Vi'allick Hotel, ’•mmmmaBr\nA dinner meeting is planned, starting at 5:30, to be followed by a closed\nbusiness-meeting and program. There are a number of items on the agenda which\nneed our collective consideration. —\nMark your calenders-so you don’t run ihto conflicting session appointments:\nSaturday evening is NAEB eveningI\nLEBSTER Ng: FCC COMISSIONER\nE.M. Febster, retired coast guard commodore and District of Columbia resident\n(never has voted—so he’s a political independent) has been appointed to the\nFederal Communications Commission to fill the seat vacated by Paul Porter. He was\nFCC Assistant Chief Engineer from 1934 to 1942. His major contribution is expected\nto be in the field of international radio and communications.\nPROPOSE NON-COMMERCIAL NET\nThe Commission on Freedom of the Press has issued a report in the volume\n\"American Radio\" written by one of its members, Llewelyn V.hite (University of\nChicago Press) in w’hich it prescribes means by which radio in this country can be\nimproved. (SEE SECRETARY’S PAGE)\nIncluded in the report is the recommendation that radio service should be\ndiversified through the \"development of non-commercial or self-supporting stations\nunder the sponsorship of educational institutions, foundations, and state and local\ngovernments\".\nIt commends the reservation of facilities for this purpose by the FCC.\nAdvice given to broadcasters includes such items as;\n\"Stop dreaming of the day when there will be no regulation in radio.\n\"Stop cheapening the First Am^endment by invoking it every time the FCC issues\na routine ruling\",\nADAIR LEAVES FCC .\nGeorge P. Adair, FCC Chief Engineer so well known to NAEB’ers, has resigned his\npost to form his own consulting engineering service in Washington. His resignation\nbecomes effective April 30. George A. Sterling, assistant chief engineer in charge\nof the Field and. Research Branch of the FCC, has been named to succeed Adair.\nIndiana University-Bloomington,, ^ « -r ,. ,\n\"Flubs ’n Dubs\", a new radio ne?/s-letter for \"alumni\" and friends of Indiana s\nbroadcasting activity made its appearance in March, with Harry Skornia at the\nediting end. , . ^ , t_\nReported is a survey of radio listening in the Bloomington area. If you re\ninterested in the details write to Harry. This is a good job for a student group\nt.n handle.-- --\nVice-President\nRobert J. Coleman\nWKAR\nEast Lansing. Mich.\nTreasurer\nW. 1. Griffith\nWOI\nAmes. Iowa\nExecutive Secretary\nM. S. Novik\n30 Rockefeller Plaza\nNew York. N. Y.\nExecutive Committee\nWaldo Abbot. Michigan Milford C. Jensen. WCAL, St. Olaf\nJohn W. Dunn. WNAD, Oklahoma James S. Miles. WBAA. Purdue\nRichard B. Hull. WOI. Iowa State Russell Potter. Columbia"
}