{
  "id": "d1382-2",
  "text": "^ NAEB REGIONAL DIVISIONS PROPOSE!:.*\nPlans for the establishment of regional sub-divisions within the National\nAssociation of Educational Broadcasters have been proposed as a means of providing\ncloser working units for members needing help in their problems.\nJohn Dunn of WNAD gets the credit for the regional division depicted here.\nHe further proposes that as the organization grows it may be w/ell to break some\nof the larger districts up into smaller units. The reason for the six-district\ndivision is that it might be desirable to have that correspond wdth the number on\nthe Executive Committee as prescribed in the constitution.\nStudy the map and think about the recommendations you would make for persons\nto serve as regional chairmen.\nThis matter will be discussed at the Columbus meeting on May 3.\nSULZER TELLS FM PROCEDURE\nElmer Sulzer, writing in the February, 1947 issue of COLLEGE PUBLIC RELATIONS,\ntells the story of how an educational institution can set up an FM broadcasting\nstation. He draws freely upon his experience in establishing the University of\nKentucky Station TOKY.\nIn encouraging institutions to use the facilities the FCC has reserved for\nnon-commercial operation, Sulzer says, \"There is the danger that unless more interest\nis shown in these frequencies in the future, some may be taken away from educators\nand allotted to commercial interests, which are applying in great numbers for con-\nstruction permits on the other portions of the FM band\".\nIncluded in the storjT- is a good summary; of costs and physical requirements for\nsetting up a station. The steps for negotiating with the FCC are carefully outlined\nalsc He even suggests sources for transcriptions and other program material\nsuitable for use on the station.\n' LL BIEET YOU AT COLUMBUS i\nDon't forget---it’s a date for the NAEB meeting\nSaturday-May 3—Dinner meeting starting at 500 PM\nin Room 337 of the Deshler-V allick Hotel and\ncontinuing throughout the evening!"
}