{
  "id": "d1528-1",
  "text": "2.\nSEE YOU AT COLUMBUS?\nThe Ninth Institute for Education by Radio, held annually at Ohio\nState University, is set for May 2-4. Preliminary plans call for a\nmeeting of NAEB at that time. The tentative program now lists a\nclosed NAE3 meeting for Monday evening in the Deshler-Wallick Hotel.\nBetter be there!\nRADIO CONFERENCE IK THE HILLS OF KENTUCKY\nThe first annual conference for the University of Kentucky Mountain\nListening Center Directors will be held April 29, 30, and May 1 (we\npresume although Elmer Sulzer’s letter says April 31), at Carcassonne\nCommunity Center, Gander, Kentucky, which is a‘primitive location high\nin the hills of Letcher County. Plans call for the Listening Center\nDirectors to not only hear talks on the utilization of programs from\noutside, but the directors themselves may express their views and ex¬\nchange experiences. Featured on the program will be singing of moun¬\ntain ballads and performances of mountain drama and folk dances. Dir¬\nector Sulzer reports that many notables interested in this type of\nwork will attend. If any NAEB members care to attend Elmer will be\nglad to make proper arrangements. There will be a registration fee\nof $2.50, which includes two nights lodging and six meals.\nTAYLOR CRITICALLY ILL\nCharles A. Taylor, WESG, has been critically Ill with pneumonia, ac¬\ncording to word received from Elmer 5. Phillips, WESG. The doctor\nhas given definite word of encouragement concerning recuperation.\n(March 3). NAEB members hope by now Professor Taylor is well on the\nroad to recovery.\nFCC REVERSES EXAMINER KFUO RECOMMENDATION\nKFUO, Concordia Seminary, made a good case for itself and received\nthe recommendation of the FCC examiner for increased power and in¬\ncreased hours of operation. Opposing was the commercially owned and\noperated station, KSD. KSD appealed the case and after hearing the\nargument, the Commission has decided to leave things status quo.\nEither KFUO or KSD may appeal the decision, although The Reverend H. H\nHohenstein, Director of KFUO, says he doesn’t know what action will\nbe taken yet.\nMICHIGAN HAS OUTLETS IN DETROIT\nHaving no radio station of its own, the University of Michigan Broad¬\ncasting Service utilizes Detroit stations as outlets for its radio\nprograms. Radio Reading and Dramatics, Michigan Band, Relation of\nFederal Government to Education, the World Today, Forestry and Land\nUtilization, Elementary Singing Class were among the programs broad¬\ncast over WJR and WMBC during the week of March 7-13. Waldo Abbot is\nDirector of Broadcasting Service."
}