{
  "id": "d1528-5",
  "text": "FROM COUNTRY\nGENTLEMAN\n(Reprinted through courtesy of Country\nGentleman, February, 1946)\nFor almost a quarter of Iowa’s century\nof statehood, Station WOI has voiced the\noff-campus educational program of the\nAgricultural and Engineering Extension\nServices of Iowa State College. Tax sup¬\nported, it sells no commercial time.\nW. I. Griffith, director of the station\nfor 20 years, puts its policy in this nut¬\nshell: “To bring the best the college has\nto offer to as many people as possible.”\nThat best is programed by Dick Hull\nand produced by Ed Wegener, two young\nmen whose enthusiasm for radio is ex¬\nceeded only by their determination to use\non public-service programs the profes¬\nsional technique lavished on the big-time\nshows. WOI avoids either condescending\nto or back-slapping its audience. And it\nbelieves in widening dial choices available\nto Iowans by making its offerings contrast\n—rather than compete—with commercial\nprograms.\nDale Williams, WOI’s widely respected\nfarm editor, and others who present gen¬\neral information programs, can draw upon\nnearly 500 faculty members—experienced\nin radio technique—for authoritative dis¬\ncussion in their special fields.\nA major portion of livestock in the -\nworld’s heaviest producing hog area moves\nto market on R. C. Bentley’s round-the-\nclock market news service, which uses full¬\ntime leased wire facilities of the U. S. De¬\npartment of Agriculture plus the produce-\npoultry service of Western Union.\nMartha Duncan’s “Homemaker’s Half\nHour” attracts 150,000 yearly requests for\nrecipes and college bulletins—for Martha\nblends friendliness and information with\nrare skill. Her nimble-witted philosophy\nis known throughout the state and beyond.\nMusic comes in for a lion’s share of pro¬\ngram time and listener acclaim. Many\nan Iowan has grown up on the 20-year-old\nMusic Shop which goes on the air for an\nhour and fifteen minutes each morning at\n7:30 with programs ranging from Brahms\nto Victor Herbert. A single appeal for\nmail once brought in 7,000 letters from\nfolks who felt they owed their enjoyment\nof good music largely to this program.\n“Matins,” an early morning program of\nmusic and devotional talks, has for years\nhad its own large and loyal following,\nwhich increased further during wartime.\nGood reading hasn’t been overlooked\neither. The Radio Book Club, organized\nin 1930 as a nonprofit lending library of\nthe air, now totals 60,000 “subscribers.”\nSPRING SYMBOL\nNot just yet—but soon.\nIt won’t be long until the green fields of\nIowa corn start their climb from the earth\nto eventual ripening. Corn to feed the\nhungry of Europe and Asia. Corn for live¬\nstock all over the broad plains of America.\nThis year, however, Iowa farmers in the\neastern part of the state are facing the\nserious problem of corn borers again. This\nyear they’ve decided to do something\nabout it.\nIn the past 4 years, the borer has caused\ntotal destruction to Iowa corn which has\nrun to the alarming figure of 9 million\ndollars. That’s the equivalent of 9 million\nbushels of Iowa corn.\nOn April 27, farmers will learn how to\nplow clean to control the borer. This is\nthe one measure which appears to kill out\nthe borer most effectively. From April 21\nto 27, the state will observe corn borer\ncontrol week. WOI, through its farm edi¬\ntor, Dale Williams, will publicize this week\nand will continue to give tips on how to\ncombat pests which cost the farmer money\nevery year."
}