{
  "id": "d1349-10",
  "text": "THE SOCIAL ROLE OF THE EDUCATIONAL TELEVISION STATION\nwhich the participants exchange opinions with great glibness, and fail to get across the\nidea that their opinions are the result of careful observation and analysis of facts. The\nlay audience may become aware only of the opinion and not of the methods by which it is\ntested and disciplined. The physical scientist does not usually fall into this trap, since\nhe is likely to stay close to his laboratory or observatory. Ultimately the purpose of\ndescribing content is to investigate the response of the audience. But great care is need¬\ned to describe the programs themselves in significant ways, since content studies may\nshow on their face that the aims of the station are not being fulfilled.\nOne of our questions deals directly with the medium (\"in what medium?\"). All of\nus are concerned with discovering the relative role of television and radio, for example,\nin various communication activities. Consider instrumental music. Will there be a\npoint of diminishing returns on the televising of bald-headed string sections and pot¬\nbellied brass choirs in symphony orchestras ? Similarly what is the appropriate balance\nbetween viewing the session of a legislative body and summarizing it in words?\nThe \"to whom\" question concerned the audience. I suppose that if there’s anything\nmodern communication research has emphasized it is that social impact depends more\non the pivotal position of an audience than on its size. It is true that we may find it\nnecessary to say that vast numbers of people have been exposed to our programs (if it\nis necessary to impress an appropriations committee). But most of us would like to get\nsome results in addition to appropriations; and there is always the possibility of being\nable to share one’s full thought with an appropriations committee. (This, of course, is\na working definition of Utopia.) The point is that public opinion is a complicated process\nin which key leaders come to exercise a disproportionately strong influence on their\nfellow citizens on various questions. A man at the work bench may have travelled far\nand wide; and he may be listened to on foreign policy matters. The local banker may be\ngenuinely respected for his good judgment and civic mindedness, so that his word on\nhousing appropriations carries weight.\n- 8 -"
}