{
  "id": "d1349-101",
  "text": "ROBERT B. HUDSON\nproblem. It should also be noted that each individual finds himself in many and quite\ndifferent listening publics.\nThe seminar spent much time trying to think through and resolve satisfactorily the\n\"mass vs. class\" issue. Commercial broadcasters, now even more than in earlier\nyears, appear to be programming for the mass—or, perhaps more accurately, the\nlargest realizable minority—audience. While leaving the so-called mass audience to\nthe entertainment-centered commercial interests, the educational broadcaster must not\nfall equally captive to the class audience. The seminar reasoned it this way. one great\npurpose of the educational broadcaster is to render service to those publics which are\nnot otherwise being served. In creating a program for any public in terms of the need\nor interest that defines that public, the broadcaster will try to reach the entire public.\nWhen broadcasting is serving the interest of such publics, the size of the obtained\naudience is not to be measured against the size of the universal audience, but rather\nagainst the size of the public selected. When the public is small, the obtained\naudience will, of course, be small. If the need or interest served is important, the\nsmallness of the audience may be justified. But there is no merit in smallness of\naudience in itself. If the potential audience for the program is large and the obtained\naudience is small, the situation should be analyzed carefully to make certain that the\nsize of audience is not a result of poor audience promotion or lack of imagination and\nskill in program design.\nThe deliberations of the seminar went beyond the broad examination of purposes\nand the assessment of responsibility for serving audiences of various sizes and\ncompositions. Critical attention was given to the nature of noncommercial broadcast¬\ning. It was pointed out that our social structure recognizes both profitmaking and non¬\nprofit institutions. The school and the university have as c lear a place in our society\nas the small business and the corporation. Both profit and nonprofit institutions support\nthe American way of life.\n- 99 -"
}