{
  "id": "d1349-102",
  "text": "ALLERTON HOUSE 1949, 1950\nFurthermore, society requires different services from the two kinds of institut¬\nions . The educational institution and its broadcasting arm exist entirely to render public\nservice and to make education widely available. Their success is judged not by economic\nresults, but by achievement in reaching this educational objective. The noncommercial\nbroadcaster, no less than the commercial, is dependent upon proper financing, skills,\ntechniques, knowledge of his audience, and limitations of the medium. But the similar¬\nities of his operation to commercial operation are dictated by the requirements of the\nmedium, rather than by purposes and goals. Some educational institutions maintain\ntheir own facilities; others, through their production departments, use available time\non commercial stations; still others use both. Whatever the avenue used, these institu¬\ntions must meet professional standards of production. But whereas the commercial\nstation in its daily program design must emphasize the common denominators of public\ntaste, and reflect in many of its programs the widespread popular desire for relaxation\nand escape, the educational station operator can aim his programs at the wide variety\nof special needs and interests in his audience. He can program for unserved segments\nof the universal audience, for special areas or special needs. He can offer a service\nflexible enough to meet individual differences, and can reflect the total resources of edu¬\ncation in terms that will appeal, at different times, to all segments of the audience.\nEspecially if he has his own station, he can provide the continuity of programming which\nis so essential to the educational process, on a regular and long-time basis rather than\nthe limited and sporadic basis which limits the educational broadcasting of commercial\nstations. He can do this because his primary purpose is education. Whereas a\ncommercial broadcaster may highlight a public service or educational program with\ngreat production skill and for a large ready-made audience, the noncommercial broad¬\ncaster can design his entire program structure in the light of educational needs and re¬\nsources .\n- 100 -"
}