{
  "id": "d1349-103",
  "text": "ROBERT B. HUDSON\nFrom these general discussions of philosophy and objectives, the 1949 Allerton\nHouse seminar moved to some considerations of implementation. It outlined a program\nwhich the individual educational broadcaster might follow in assessing community needs\nand resources, developing new program techniques, building audiences, developing\nareas of research and \"pilot plant\" experiments, and training personnel. The largest and\nby far the most important step it took, however, lay in its spelling out what educational\nbroadcasters working together can do. The seminar recommended and indeed set in\nmotion plans for (1) a central service for sharing programs, by tape or transcription,\nand (2) a long-range plan for an educational network and a well-financed program-\nproducing center.\nThe single most important factor contributing to the slow growth and development\nof educational broadcasting over the years has been the unfavorable ratio of program\nstaff and resources to the number of hours in the broadcast day. It is obvious that a\nsimple exchange of the better programs produced by each educational station or univer¬\nsity program-producing center would not only relieve the pressure on each staff, but\nupgrade the program output as well. A central program-producing service would\nsupplement this exchange and bring exciting new resources and production skills to\nbear all along the line.\nThe 1949 Allerton House seminar adjourned on this note of hope and dedication.\nThe prologue had been written. The charge set off is still reverberating, firing\nimaginations, and igniting new actions in many quarters. A postseminar committee\nwhich included in its membership Richard B. Hull, director of the Iowa State College\nstation WOI (AM-FM-TV); George Probst, director of the University of Chicago Round\nTable; and Harold McCarty, director of the University of Wisconsin station WHA and\nthe Wisconsin State FM network, immediately began the task of formulating the long-\nrange plan for organizing a network of educational stations, developing a central pro¬\ngram-producing service, and exploring possible sources of financial support for the\n- 101 -"
}