{
  "id": "d1349-104",
  "text": "ALLERTON HOUSE 1949, 1950\nenterprise. Concurrently Seymour Siegel, director of the New York City stations WNYC\nand WNYC-FM, took the initiative in implementing the program-exchange proposal of the\nseminar. Mr. Siegel and his staff inaugurated the ’’bicycle network” in the fall of 1949.\nIts operation involved the routing of tape recordings of high-quality educational programs\nfrom station to station around the country. This practical demonstration of self-help\ncaught on quickly, and within the short space of one year the \"bicycle network\" is provid¬\ning four hours of programs per week to twenty-eight educational stations from Boston to\nLos Angeles, and from Minneapolis to Baton Rouge.\nIn view of the encouraging and dynamic results of the first Allerton House seminar,\nits sponsor, the Division of Communications of the University of Illinois, proposed a\nsecond one. Again the Humanities Division of the Rockefeller Foundation agreed to under¬\nwrite the out-of-pocket expenses of participants and visiting staff. The National Associ-\ncation of Educational Broadcasters gave its enthusiastic endorsement to the proposal.\nWhere the first seminar was chiefly concerned with policy—what is the job of education¬\nal broadcasting?—clearly the 1950 Allerton House seminar should address itself to pro¬\ngram content—what to say, and how to say it effectively.\nIt is worth noting in this connection that the end product of radio the program is\nthe area most neglected by broadcasters. There are literally no meetings of broadcast¬\ners in America where programs are the central concern. Attention to them is confined\nto gross audience pull as it is reflected in ratings. Program content is examined only as\na likely culprit in instances of low circulation. Such other attention as programs may get\nis likely to be centered on production techniques and the peculiar disciplines of the\nmedium, rather than on program content and meaningful communication.\nThe planners of the second Allerton House seminar turned their backs firmly on the\nstudio-technique emphasis in production, important though it is, and resolved that the\nseminar should concern itself with \"idea production,\" or idea communication through the\nmedium of radio. This time the seminar would be composed not of educational station\n- 102 -"
}