{
  "id": "d1349-105",
  "text": "ROBERT B. HUDSON\nexecutives as in the first instance, but of program and production directors—the young men\nand women in educational stations who have the privilege and the responsibility of building\nprograms from their very inception, taking them through their several stages of develop¬\nment and, finally, through the actual air performance. These are the key people in radio\nprogramming, and the 1950 seminar was conceived and organized on a basis calculated to\nhelp them take a fresh look at education's resources, at the programmer's problem of\ndrawing significance from these resources, and at ways and means of effectively com¬\nmunicating that significance.\nIn lifting program people, for a fortnight, out of their day-by-day routine of broad-\ncasting for the purpose of helping them in testing and resetting their sights, the obvious\nand most promising method was to bring them into contact with fine minds, each of which\nwas a specialist in a field educationally and socially important. Following this plan,\nguests of the 1950 Allerton House seminar, for a day or two each, included Allan Nevins\nin history, Robert Redfield in the social sciences, Kenneth Hudson in the fine arts,\nWilbur Schramm in communications effects, Walter Agard in literature, Richard McKeon\nin philosophy. Dr. A. C. Ivy in medical sciences, Clifton Utley and Phillips Talbot in\npublic affairs, Le Cronbach in educational psychology, O. H. Mowrer in mental hygiene,\nand David Randolph in music. Fred S. Siebert and Charles Sandage joined up for special\nsessions, respectively, on government regulations as they affect programs and on audience\nresearch.\nThese men gave active leadership as the seminar explored subject areas which,\nheretofore, have remained largely unworked by broadcasters, and other areasfriot un¬\nfamiliar to radio listeners but in which the broadcasts have been conceived narrowly.\nThe sessions alternately took on the characteristics of a mas ter-student relationship and\nthe pointed interrogations of a closed-circuit \"Meet the Press.\" Members of the seminar\nwere hard taskmasters and the discussions were vital and penetrating. Practicality was\nassured through the participation, in all sessions, of either Robert Lewis Shayon or\n- 103 -"
}