{
  "id": "d1349-106",
  "text": "ALLERTON HOUSE 1949, 1950\nHomer Heck, two of the abler and more experienced commercial network producers. The\n\"technical-consultant-in-residence\" role of these men contributed greatly in bridging the\ngap between theory and practice, and their evaluations for the medium of the scores of\nideas introduced from the several substantive areas was especially noteworthy.\nThe 1950 Allerton House seminar kept records of its discussions in abridged form.\nAll members of the seminar participated in drafting the summaries, and the combined\nreports of the daily sessions constitute an imposing document. Already these are being\ndrawn upon heavily in program planning by most educational stations. Obviously, these\ndaily reports cannot be reproduced here; neither can one do justice to major subject\nareas by thumbnailing the discussions of them. Suffice it for purposes of conveying\nsome insight into the nature of the seminar to give here a few excerpts from the seminar\nnotes on the discussions devoted to the problem of broadcasting literature, guided by\nProfessor Walter R. Agard.\nA literary work is basically a work of art, declared the seminar. It is also in\nits content a social document. It is a door to the comprehensive understanding of a\nwhole culture. \"Confronted by a work of art,\" as Alfred North Whitehead says, \"the\nindividual has an experience limited only by his own ability to respond to it in terms of\nthese three consecutive steps in learning” (1) romance, through awareness of its\ninterest, importance, and vitality; (2) precision, through the understanding of its tools\nand techniques; (3) generalization, through realization of its relation to the whole of\nlife.\" \"Educators,\" Professor Agard observed, \"too often begin with the second step;\nradio rarely goes beyond the first.\"\nThe seminar agreed that radio, so far, has tended to reflect the episodic nature\nof American life. Just as we live in \"fifteen-minute shots,\" so our approach to liter¬\nature has been fragmentary, undirected, and incoherent. Radio should give to the study\nof literature a more integrated continuity and should evoke in the listener a sense of\ngrowth and achievement.\n- 104 -"
}