{
  "id": "d1349-107",
  "text": "ROBERT B„ HUDSON\nThe seminar recognized three basic approaches to the presentation of literature on\nthe air. One may present the literary work itself, either in its original form or through\nadaptation or condensation. One may review the work, revealing what may be found in the\nwork. Or one may interpret, analyze, or criticize, presenting material which illuminates\nthe work, evaluates it, or reveals its significance. Sometimes two or more of these\nmethods may be combined. Professor Agard argued that there is danger of losing sight\nof the purpose when combining criticism with the work itself on the same program.\nPresenting the work directly and without comment is effective in itself. Literature can\nits own feet. It is provocative, and listening to it is an active process which\nresults in a degree of learning at the listener's level of understanding. Radio assists this\nprocess through its faculty of speaking to the listener directly and personally. It relieves\nthe listener of the responsibility of the mechanics of the reading process, permitting\ngreater participation.\nCriteria for selecting the form for presenting literary works by radio were observed\nby the seminar to include: (1) the validity of the form in which the author has chosen to\ncast his work, whether novel, play, short story, poem, or essay; (2) the appropriateness\nof the form to the purpose of the program; (3) the suitability of the form to the medium\nof radio, and (4) the consistency of the form with the resources of the broadcaster. In\nthe light of these considerations, a play might be read by a single voice, a story\ndramatized, an essay rewritten as a panel discussion or a dialogue. However, a broad¬\ncaster may well consider the validity of the author's choice of form the most compelling\nfactor.\nThe seminar felt strongly on the point that purposive organization of literary works\nand analytical comment into an integrated \"course\" or series of programs makes possible\na greater sense of continuity and achievement. The listener has a sense of \"going some¬\nwhere\" or of a deepening experience. Organization may be through a series of programs\nthe same day each week, or through programming an entire evening around different\n- 105 -"
}