{
  "id": "d1349-108",
  "text": "ALLERTON HOUSE 1949, 1950\naspects of a single unifying idea, if it is to accomplish this integrated effect. The\napproaches to literature around which a program series might be unified are many and\nvaried:\n1. A study of the growth of important ideas may be traced in the great literature\nof history, as in the currently popular Great Books series which, though stimulating, is\nnot truly integrated.\n2. A study of a particular idea, as developed by successive authors in literature,\nmay point up the idea of democracy or the problem of man and his environment. Just\nas the previous approach selects a group of authors and studies their ideas, this\napproach selects an idea and studies the authors who have advanced it. A kind of\nconcordance of ideas, The Syntopican, is being compiled by the University of Chicago,\nlisting the contributions of a large number of authors to certain ideas.\n3. Great single works, such as War and Peace, may be presented in installments.\n4. A chronological study of an author may be presented under a general subject,\nsuch as \"The Development of Ibsen as a Dramatist.\"\n5. The works of the same author may be approached through systematic study,\nsuch as \"A Three-Dimensional Appraisal of Ibsen as a Social Critic.\"\n6. Literature is an organic part of the whole culture which produces it, so a\nperiod or culture may be revealed through its literature.\n7. The origin, development, and uses of a particular literary form or type may\ndeepen the listener’s appreciation of the epic poem, social satire, or drama. An\nexample of this type is the WHA series, History and Myth in Drama.\n8. The development of an historic or legendary story may be presented as treated\nby different authors, such as Amphytrion or the Fall of Troy.\nThe same kind of analysis and systematic study which characterized the seminar’s\nattention to goals and techniques in broadcasting literature prevailed in all other dis¬\ncussions throughout the seventeen days at Allerton House. The examination of subject\n- 106 -"
}