{
  "id": "d1349-109",
  "text": "ROBERT B. HUDSON\nareas resulted in far more than the mere spelling out of new program series for edu¬\ncational stations. Program discussions included the program concept, selection and\ntreatment of materials, and knowledge of the wants and needs of selected audiences.\nThe benefits of the seminar cannot be generalized on a group basis or in terms of\nmere program-performance goals; its impact on the lives of the individual participants\nwas impressive but difficult to assess. In a letter written after the seminar, one\nparticipant put it this way: \"It was an extremely stimulating intellectual experience.\nI was made painfully aware M how slack I had been in continuing my education beyond\ncollege walls and college years. The shove this experience gave me has overcome my\ninertia and has given me sufficient impetus for a good hard program of continuing,\npurposeful self-instruction. The end result should be a better equipped program\ndirector.\"\nThe Allerton House seminars have been of immeasurable value to the cause of edu¬\ncational broadcasting. They provided stimulus when stimulus was needed, and they\nprovided a basis for coordinated action when combined strength was needed in seizing\nthe opportunities which beckoned. Today, to paraphrase a slogan, educational programs\nare better than ever. In addition, the \"bicycle network\" is rolling, a greatly stepped-up\ntape network operation is being established at the University of Illinois, progress is be¬\ning made on the long-range plan for a program-producing center, and education is mak¬\ning a unified bid for the reservation of an adequate number of television channels for its\nexclusive use. If educational broadcasting is on the move, and it appears to be gaining\nmomentum month by month, I believe it is fair to sum up the spirit and the singular\ncontribution of the Allerton House seminars in the words of Anatole France: \"Don't\nflatter yourself with teaching a great number of details. Put spark to the spirit and people\nwill catch fire where they are inflammable.\"\n- 107 -"
}