{
  "id": "d1349-11",
  "text": "HAROLD D, LASSWELL\nIt may be that educational broadcasters should aim at serving the public by giving\nspecial service to those whom the public takes with particular seriousness„ That is,\nthe aim of some programs may be to build up a listening or viewing audience of opinion\nmoulders o There is no need to say that other people are not welcome to listen in, and\nof course that would not be true. But the main point would be to make important material\naccessible to the most active and influential leaders. (This, by the way, was the princi¬\npal technique that our broadcasters cultivated during the War. Although one was nominal¬\nly talking to the whole enemy audience, the chief targets were often a thousand or even a\nsmaller number of decision and morale makers. In the name of a very large audience it\nis often wise to aim at a very small audience in fact.)\nOur last question about a process of communication concerned \"effect.” And of\ncourse the final test is what happens to the audience. But do we want any more than their\nattention and enough approval to keep in business?\nObviously, the answer is yes. As professionals in the field of educational\ncommunication we recognize a more serious responsibility than getting big audiences and\nmaintaining our gifts or appropriations. Our aim is to implement the ideal goals of\nAmerican life. What makes the challenge interesting is that is must be done with enough\nskill to win ultimate support. Non-commercial broadcasting must be something added\nto the raw fact of survival. This is the meaning of being non-commercial. The com¬\nmunity looks to the non-commercial facilities to provide a service which they dimly feel\nthey have not had. The non-commercial facilities must be more inventive and pace¬\nsetting in public service than the commercial facilities. The aim is not to discourage\nthe commercial facilities from competing, but rather to level up the service available to\nthe American public.\nIll\nLet us be more definite about objectives. What are wTe trying to accomplish in the\nname of the ideal values of American life? Obviously the goals must be stated in terms\n- 9 -"
}