{
  "id": "d1349-110",
  "text": "PARTICIPANTS AND RESOURCE PERSONNEL\nNAEB Educational Television Seminar\nUniversity of Wisconsin\nJune 21-27, 1953\nAdams, Edwin H., Division of Radio-Television, University of Washington, Seattle 5,\nWashington\nAdolfson, Lorentz T., University Extension, University of Wisconsin, Madison 6,\nWisconsin\nAusmus, Graydon, WUOA, University of Alabama, University, Alabama\nBarts, Miss Norma, Film Council of America, 600 Davis Street, Evanston, Illinois\nBoyter, Haskell, Station WABE, Board of Education, City Hall, Atlanta 3, Georgia\nCarter, Miss Margaret, Film Council of America, 600 Davis St., Evanston, Illinois\nCook, Denton L., Plant City Public Schools, Plant City, Florida\nConrad, Lawrence, Committee on Television in Education, State Teachers College,\nMontclair, New Jersey\nDale, Edgar, Bureau of Educational Research, Ohio State University, Columbus 10,\nOhio\nDunn, John W., WNAD, University of Oklahoma, Norman, Oklahoma\nEngel, Harold, WHA, University of Wisconsin, Madison 6, Wisconsin\nGarrison, Garnet R., University of Michigan, Ann Arbor, Michigan\nGriffiths, G. H., Fund for Adult Education, 914 East Green Street, Pasadena 1,\nCalifornia\nGulick, Frank, c/o Fund for Adult Education, 595 Madison Avenue, New York, N. Y.\nHadsell, R. S., Motion Picture Research Project, 51 Hillhouse Avenue, Yale University,\nNew Haven, Connecticut\nHarley, William, WHA, University of Wisconsin, Madison 6, Wisconsin\nHarris, Dale B., Department of Child Welfare, University of Minnesota, Minneapolis 14,\nMinnesota\nHodges, Mrs. Fletcher, 5812 Kentucky Avenue, Pittsburgh 32, Pa.\nHorton, Donald, Department of Sociology, University of Chicago, Chicago 37, Illinois\nHudson, Robert B., University of Illinois, Urbana, Illinois\nHunter, Armand L., Michigan State College, East Lansing, Michigan\nJones, John Paul, School of Journalism, University of Florida, Gainesville, Florida\nKing, William H., State Department of Education, State House Annex, Trenton 7, New\nJersey\nLardie, Mrs. Kathleen N., WDTR, Detroit Public Schools, 9345 Lawton Avenue,\nDetroit 6, Michigan\nLas swell, Harold, Law School, Yale University, New Haven, Connecticut\nLeenhouts, Grant, Fund for Adult Education, 595 Madison Avenue, New York 22, N. Y."
}