{
  "id": "d1349-14",
  "text": "THE SOCIAL ROLE OF THE EDUCATIONAL TELEVISION STATION\nSkill: Economists and sociologists study the various occupations and professions, and\nart historians deal with aesthetic standards and the creative operations involved in paint¬\ning, sculpture and other arts. Wealth: Obviously this is the province of the economist.\nWell-being: The specialists on public health are involved in this.\nIV\nWe can now return to the principal question: How do we relate ourselves to the\nsocial process ? It is clear that as skill specialists we function chiefly in the skill\ntransmitting and enlightenment activities of society. At every point we are confronted\nby the need of choosing among the many alternatives that confront us in terms of program\ntopic, personnel, and so on. And if we apply a professional viewpoint, it must be clear\nwhat results we are trying to get. What, indeed, are we after?\nThis is a delicate question in an audience of American educators, in particular,\nbecause a great many Americans think that being democratic is to state no moral prefer¬\nences, and to deny that you are trying to accomplish anything. I haven't time to go into\nthe pathology of this aberration. I can only challenge the idea as a danger to the American\ntradition. A free society needs free men, men who are voluntarily devoted to clarifying\nand applying the basic goals of the nation. As professional people it is our responsibility\nto state these goals, and to work at putting them into effect. What we do influences the\nshaping and sharing of values at the local and even the national level no matter how\nslightly. If we are to act rationally and with full rectitude we must do the best we can to\nsee that results are consistent with the underlying values of the American tradition.\nThe core of this tradition can be stated briefly. No doubt we have special ways of\nusing words about it. But luckily for those of us who have been reared in American\ncivilization there is consensus on fundamentals. I shall formulate my conception of the\nAmerican ideal (and my own goal values) in these terms: \"The fundamental aim is to\nachieve human dignity in theory and fact. To accomplish this is to achieve a community\nin which there is abundant participation in the sharing of all values.\"\n- 12 -"
}