{
  "id": "d1349-15",
  "text": "HAROLD D. LASSWELL\nNot many of us will reject the ideal of human dignity and thereby commit ourselves\nto a social order in which human indignity is the goal. But when we pass from the general\nformula to concrete institutions to be identified with human dignity, difficulties begin. But\nthese uncertainties are the usual problems of any healthy society. Human institutions are\nalways imperfect and even those which have served their purpose in the past may need\nrenovation. We do not expect to change our goals but we will often change our minds about\nthe specific practices that are most consistent with human dignity in concrete circumstances*\nYou and I do not have to have closed minds on such perplexing problems of institutions\nadjustment as these- What system of taxation best strengthens the economy without foster¬\ning monopoly and endangering the economic basis of popular rule? What adjustment of\ngovernmental and private agencies will best maintain the bodily and psychic health of the\nnation? What methods of exploiting oil and other national resources will contribute to the\nlong-run interests of the nation? What system of universal military training, if any,\nshould be inaugurated as a means of national security? What level of defense expenditure\nshould be sustained in this bipolarized world in which an armament race of unprecedented\nseverity is going on?\nI mention these sample questions as reminders of the point that the choice of insti¬\ntutional solutions is not the automatic result of a declaration of adherence to long-range\ngoals. But without the long-range goals we are left without a frame of reference that\nchallenges us to consider the side effects as well as the direct effects of any specific\nsolution. By learning to think of the social process as a whole, and to consider its\nrelationship to human dignity, we provide an inner discipline for the nation?s thinking.\nV\nIt is in this connection that our role as educators and communicators can be made\nmore definite. Observe that our commitment to the ideal objectives of the American\ntradition does not transform us into propagandists. If that is what educators are afraid\nof when they are asked to take a fundamental stand on values, they can relax. Our\n- 13 -"
}