{
  "id": "d1349-16",
  "text": "THE SOCIAL ROLE OF THE EDUCATIONAL TELEVISION STATION\nconcern for human dignity prevents us from playing the role of propagandists with the\nAmerican public. We are responsible for enlightenment, and in this role we operate a\nforum where it is true that propagandists may appear. But we run the forum. Others\nmake the propaganda. It is our job to give the propagandists full access to the channels\nof enlightenment, subject to the proviso that we are responsible to the audience for\nmaking it clear that they are propagandists. It is the unidentified propagandist who may\nget away with something; we can take a chance with the others.\nIf we are to foster the enlightenment function what must be done? Our programs\nneed to contribute to a comprehensive image of the whole social contexts\nThe goals of the community\nThe trends in the realization of these goals\nThe conditioning factors that have affected the realization of trends\nThe projection of probable lines of development into the future\nThe reporting and appraisal of alternative policies of action.\nIn this outline we are talking about our direct contribution to the opinion forming\nprocesses of a free society. It is a matter of projecting and clarifying the goal values\nof the community, which involves providing authoritative reminders of the great tradi¬\ntion, as incorporated in historic documents, historic deeds and historic figures. It is\na matter of keeping alive the consideration of fundamentals, together with efforts at re¬\ndefinition of alternative ideas in concrete terms. Here is where television can perform\na peculiarly important function, since television is a visual medium, and as such is\nable to provide the experience of a word and its referent at the same moment. The link\nbetween a sign and what is signified is a powerful engine of communication that we can\nemploy to unify the nation on fundamentals.\nWe spoke of trends. Here it is a question of keeping alive the appraisal of\nAmerican (and indeed global) life in terms of the goal values of human dignity. It is easy\nfor such fundamental frames of reference to drop out of sight in the dust of everyday\nevents, especially since it is nobody's job to report on whether we are moving nearer or\nfarther from some clear, though provisional, conception of democracy. We have people\n- 14 -"
}