{
  "id": "d1349-17",
  "text": "HAROLD D„ LASS WELL\nwhose business it is to say whether stocks are rising or falling, or whether the wheat\nacreage is expanding or contracting, or whether more or less money is being spent on\ncigarettes. But what this adds up to in terms of the strengthening or weakening of our\nfundamental institutions is more speculative, and calls for critical and careful evaluation\nof the available scraps of evidence.\nNo discussion of historical trend is as helpful as it ought to be unless it calls our\nattention to the conditioning factors that make it intelligible. No doubt you have seen\nDavid Riesman5s discussion of The Lonely Crowd in which he joins with the interpreters\nof modern culture who emphasize the alienation of masses of the people from a full sense\nof participation. He calls attention to a great many factors in modern industrial civil¬\nization that make these processes seem clearer. Certainly part of our responsibility in\nconnection with enlightenment is to make certain that such serious interpretations of\nAmerican life are accessible to all.\nAnother dimension of the problem of providing a community context is to develop\na common image of the future. Our choices always depend upon assumptions about the\nshape of things to be. We are always revising estimates of prosperity or depression, war\nor peace, and other contingencies. It is the great contribution of the media of communi¬\ncation to provide well-instructed guesses about the future.\nFinally, we come to the presenting and appraising of action alternatives before the\ncommunity. This is a question of policy analysis. In this connection the educational\nbroadcaster must win the confidence of the audience that he is performing a public service\nin a professionally competent manner. And this depends upon making it clear that in his\ncapacity as a public servant the broadcaster is under an obligation to report on what the\ncontroversial opinions are which are taken seriously in various decision making circles\nat home and abroad. Not only must he report the fact of controversy, but he is obligated\nto summarize the opinion. And the discussion of the pros and cons needs to proceed with¬\nout restrictions other than those which are necessary to the orderly operation of a forum.\n- 15 -"
}