{
  "id": "d1349-20",
  "text": "THE UNIVERSITY OF CHICAGO REPORT\nsystem, for example. It might also be profitable to have someone keep an account of\nwhat goes on and report to you periodically on different experiments conducted in the\norganization of stations and their operations.\nThere’s a third area of research. If we called the first ’’measurement of achieve¬\nment, ” and the second ’’operational research,” the third might be the general study of\nconditions under which you operate as educational broadcasters. This, of course, is an\nenormous area and it’s scarcely profitable even to talk about it without breaking it down\ninto a few tentative categories. In a very narrow sense, there is what might be called\n\"instrumental research”—research oriented very narrowly towards the use of tele¬\nvision as an instrument of communication. Wilbur Schramm has done a nice job of\nsummarizing some research of this kind in his memorandum \"What May We Realistic¬\nally Expect of Educational Television.\" He has summarized practically everything of\nsignificance in the field of experimental studies on the effectiveness of film, radio and\ntelevision, and I don’t need to say any more on the use of these media as teaching\ndevices.\nAnother type of research that you yourselves have sponsored—and you’ve pro¬\nduced more of this kind of research than anybody else—is what we might call the study\nof competitive conditions. I have in mind here your monitoring studies. These were\ndesigned to give a general overview of the commercial broadcasting situation which\nrepresents one of the major conditions under which educational television has come in¬\nto existence and will operate—the kind of competition it will have to meet. In particular,\nas you know, the objective in the monitoring studies was to show the lacks and gaps that\neducational television might be expected to fill.\nThere is probably room for a considerable amount of research on public opinion\nwith respect to television. You have already had many indications of public dissatis¬\nfaction with commercial television, and of an atmosphere of receptivity to the develop¬\nment of noncommercial educational stations. You may not need to bolster your own\n- 18 -"
}