{
  "id": "d1349-21",
  "text": "DONALD HORTON\nconfidence in your case by such research data, but I think you might some time consider\nundertaking a full-scale public opinion study, say along the lines of the Lazarsfeld study\nof people’s attitudes toward radio. I don’t know of anybody else who is going to do this.\nI doubt that the commercial interests will, and it seems to me that might be a very\nprofitable enterprise for you.\nResearch can make a still more fundamental contribution. In operating your sta¬\ntions and devising your programs, you will or should be relying on everything that’s\nknown scientifically about our society. That is to say, you should be drawing on all the\nresources of the social sciences. I'm thinking of the social sciences in particular because\nyour task is peculiarly a social task.\nThis kind of research information will be useful to you in at least two ways. In\nthe first place, you will need to know a good deal about the communities in which you\nare operating, so you will naturally draw upon all the systematic and scientific know¬\nledge that’s available with respect to the interests of the community. This is the kind\nof information that political scientists, sociologists and others will be able to provide.\nThen, on the other hand, in designing programs, you also will want to take into\naccount what is known with respect to their subject matter. I think, for example, of\nthe two-sided character of the problem faced when you consider producing programs,\nsay of special interest to adolescents. We now have a great deal of sociological know¬\nledge about the American adolescent, about his situation in American life, the kinds of\nproblems he faces, the way he deals with those problems, the special attitudes he\ndevelops, etc. If you were doing a program or a series of programs designed to appeal\nto adolescents or dealing with the problems of adolescents, you would have to draw on\nthis information. For that purpose, you’d bring in an expert in this field. You may also\nfind it profitable to sponsor new studies of the adolescents in your own community be¬\ncause there will be variations on the general American theme; and the more you know\nabout the concrete character of this problem in your community, the better you will be\n- 19 -"
}