{
  "id": "d1349-22",
  "text": "THE UNIVERSITY OF CHICAGO REPORT\nable to orient your broadcasting in this direction. And you’ll need the same experts to\nhelp you in constructing the program itself.\nIt seems to me that these are some of the major kinds of contributions research\ncan make. I might add that I think a very important contribution of research to the tele¬\nvision operation will be periodic assessment of the general public attitude toward your\noperation as a whole. You’ll want to know how you stand, not just with regard to parti¬\ncular programs, but what people think of your station and your service as compared with\ncommercial services. I think there are a lot of other aspects of the community response\ninto which you will want to inquire through systematic research. Measurement of\nachievement defined in this very broad way (the kind of operational research that I’ve\nsuggested), along with the great variety of studies that will, in one way or another,\ncontribute to the effectiveness with which you are able to use this instrument and to de¬\nsign a program schedule and specific programs for it, constitute the possible contri¬\nbutions of research.\nBut nowhere in this do I see anything that corresponds to the notion that research\ncan show the specific role of the educational television station.\n' ii\nNow as to the University of Chicago report. This was the work of a group of\nfaculty members brought together to advise the Chancellor on what the University could\ndo in educational television. Everything they said was limited by this perspective. The\nobject was, in every case, to think of this particular University, of its particular re¬\nsources, and of its particular role in regard to one educational television station.\nThe assumption was made that we were concerned only with what our University\ncould do. Therefore, other problems of educational television not properly the responsi¬\nbility of the University of Chicago were not discussed. We made the fundamental assump¬\ntion that an educational television station is a community station. And we thought of our¬\nselves at the University as playing a role among the institutions of the community that\n- 20 -"
}