{
  "id": "d1349-23",
  "text": "DONALD HORTON\nwould utilize this facility. In the background we had the notion that there were many\nthings we might conceivably do, but which other institutions in the community could do\nbetter. We never assumed that the work of such a station would be entirely devoted to\neducation in the narrow sense, but rather that it would serve in some way as a facility\nfor many institutions and groups in the community, and that their use of it would be\njustified by a very broad definition of the term \"educational.”\nWe took it for granted that this station would not only be used by the teaching\ninstitutions, the universities and schools, and by museums and historical societies, but\nthat it would probably develop programs in which many other groups would participate.\nFor example, in Chicago today groups are being organized all over the city for\nneighborhood improvement to counteract the rapid spread of slum conditions. We took\nit for granted that such civic organizations would, in one way or another, have access\nto the television facilities. If one tried to envision the total programming, the total\nschedule, the total function of such a station, it would be very much broader than any¬\nthing that we at the University contributed, and ours would only be a small part of the\ntotal.\nAnother of our basic assumptions appears rather late in the report and is intro¬\nduced rather casually, but in our own thinking about the problem of the University in\ntelevision this assumption was quite important: the educational television operation\nestablishes a new kind of relationship between producers, productions, and viewers;\nand this new kind of relationship should be thought about, developed and exploited. I\nwant to say a few words in explanation of this second basic assumption.\nHere we had to meet and deal with some objections we considered not well founded.\nWhen we talked to our colleagues we learned that many of them took the attitude that\nsome other medium could do a particular job better than television. We had to reply that\nalthough there were certain things we could probably do very much better with a daily\nnewspaper of national distribution, we at the University have no such newspaper and never\n- 21 -"
}