{
  "id": "d1349-24",
  "text": "THE UNIVERSITY OF CHICAGO REPORT\nwill have; but we did have the opportunity to participate in a community television station.\nThat's the fact and there's no use being concerned with ideal conditions that never could\nbe met.\nIt has been argued, for example, by some faculty members, that television is a\nvery poor medium for transmitting ideas because the best way to transmit ideas is\nconceptually in speech, written speech particularly, and that television with its visual\nemphasis is distracting and hampers this kind of communication. We simply had to say\nthat we had no better mass medium for this purpose, and that our problem was to experi¬\nment with television and improve it as a means of transmitting concepts.\nThe assumption that educational television establishes a new kind of relationship\nbetween producers, productions and viewers is suggested by the fact that educational\ntelevision is a local community enterprise. The institutions by which it is operated and\nwhich speak through the educational channel are local enterprises with which the viewer\nis already connected. He may be connected only as a taxpayer—a fairly remote\nconnection; but nevertheless, insofar as this is a local community enterprise, these\ninstitutions are in some degree responsible to him, and he is in one way or another\nconnected with them independently of television. This is not true, of course, in the case\nof the commercial broadcasting company.\nCommercial television assiduously cultivates the sense of a viewer's direct\nrelationship with the performers. All sorts of devices are used, as you know, in\nentertainment programs to create the illusion of a direct personal relationship between\nyourself as a viewer and the performers: the informality of manner that's been develop¬\ned in many television shows; the forms of direct address that are constantly used; and\nthe solicitation of response from the home audience, the studio audience or both. All\nof this sets up a situation which perceptually is one in which you seem to be in a face-\nto-face personal relationship with the performer.\n- 22 -"
}