{
  "id": "d1349-25",
  "text": "DONALD HORTON\nBut in commercial broadcasting, the producing organization—the commercial enter¬\nprise behind the scenes—is studiously ignored, one might even say concealed. The viewer\nknows that there is a commercial network or company, but he knows nothing about it. When\ndoes the viewer ever see the officers of the company or network? When is he ever given\nany insight into the operations of their organization? When is he ever treated to a candid\ndiscussion of their plans and their purposes in relation to himself, and of the problems\nthey face and are solving by the changes they make? When is he ever given any explanation\nfor a program going off the air or one coming on, or somebody being dropped, or a format\nbeing changed? All of this is none of his business!\nBut in the case of the community television station, we should expect a different\nkind of relationship with the audience, not only between the performers and the viewer,\nbut between the station and its personnel and the viewer, and between the viewer and the\ninstitutions which assume ultimate responsibility for the station. I should say, and I\nthink that in the background of the discussion of our committee this was recognized, that\nfrom our point of view this represents something new in television broadcasting.\nThe community station has nothing to conceal from its audience? that is, it has no\npurpose that cannot be frankly exposed and criticized, and itself made a matter of dis¬\ncussion in programs produced by the station. It rests upon a genuinely democratic\nfoundation. The institutions responsible for the station and its work are responsible\ndirectly as well as indirectly to the community that supports them; and the audience of\nthe community station has rights with respect to the programs broadcast that are not\nlimited to the right to approve or disapprove, and the right to turn the program off—this\ngreat fundamental American right that the commercial broadcasters tell us we have.\nThe audience of the community station, it seemed to us, has other rights than\nthese and much more significant ones. It has a right which I know it will assert (even\nif in these early days you find this right is not being asserted)—the right to take part in\nthe formulation of program policy, even to participate in program production through\n- 23 -"
}