{
  "id": "d1349-26",
  "text": "THE UNIVERSITY OF CHICAGO REPORT\nmembership in the sponsoring institutions. And it has a right, which I think will be\nexercised, to be given an accounting by those who serve as trustees of the enterprise.\nAs you all know, this will be the state of affairs that will produce most of the head¬\naches. If it doesn’t produce headaches, I don't know what will! But I wonder if we\ncouldn't accept the notion of the healthy headache. As I understand it, democracy is often\na very strenuous and painful condition. The painless kind is apt to be spurious? witness\nthe so-called cultural democracy of commercial broadcasting. This is painless demo¬\ncracy? all the decisions are made upstairs, all the information is collected by commer¬\ncial research people, and the audience doesn’t have to do anything except sit back and\nwait for the kinds of program that the great majority will approve.\nThe kind of democracy that will operate in the case of the community station is a\nmuch more strenuous and painful kind. But in it, of course, we see the possibilities for\nall kinds of developments, the progress and the creativeness that will make the com¬\nmunity station something to be proud of. In short, we think of the relationship between\nthe audience and the broadcaster in community television as one of actual or potential\ninvolvement in the work of the station itself; the audience does more than just view\nprograms.\nIll\nA third assumption which we all agreed upon may, in a way, be simply a corollary\nof the first. For community television the conception of the audience as essentially\npassive is unacceptable. Throughout our discussion we took it for granted that it’s an\nobjective of the community station to involve its audience in actual rather than vicarious\nactivities. So, for example, we have suggested that members of the audience might be\nable to take part in mass scientific experiments or observations. We had quite interest¬\ning discussions about this, and various scientists in the University suggested various ways\nin which large numbers of people might be able to make significant contributions.\n- 24 -"
}