{
  "id": "d1349-27",
  "text": "DONALD HORTON\nWe also emphasized in this report programs that would be directed toward the\nspecial interests of organized groups, and have underlined the possible coordination of\nbroadcasting with the distribution of printed material, the stimulation of group discussion\nand the like. You’ll find, for example, that we suggested one of the functions of the\nUniversity would be to produce programs for various professional groups, designed to\nkeep them informed on current scientific developments in their fields. It was pointed\nout that not only doctors and dentists, but lawyers and chemists and physicists employed\nin industrial plants, for example, all have the problem of keeping up with their fields\nand receiving explanations of the latest developments, and that one of the functions of the\nUniversity could very well be to provide, by prior arrangement with professional associ¬\nations, programs for this purpose.\nOf course, it’s obviously within the schools that this kind of coordination of broad¬\ncasting and group action will be the most highly developed. Robert Shayon out at\nWOI-TV, in his series, \"The Whole Town’s Talking,” has given us a brilliant demon¬\nstration of how this kind of relationship may also be worked out in the public sphere.\nWe cannot deny that for many programs the passive role is appropriate, nor that\nmany viewers will remain passive with respect to all programs. I can see that the con¬\ncept of action might easily be turned into a shibboleth just as the notion of passivity has\nbeen, and that we could go to the opposite extreme of emphasizing this, but my chief\npurpose here was to spell out another of the implications of my first assumption.\nOur fourth assumption was that the specific role of the University in the community\nstation is to provide a background of knowledge in depth for the understanding and enjoy¬\nment of life. I think that generally speaking we recognized two phases of this knowledge\nin depth.\nFirst we thought of knowledge in depth for an understanding of contemporary social\nand political problems, and we thought that the University had a special obligation in this\narea. The other might be called cultural depth. We got into a considerable amount of\n- 25 -"
}