{
  "id": "d1349-28",
  "text": "THE UNIVERSITY OF CHICAGO REPORT\ndiscussion about what would be acceptable to the public, particularly with respect to the\ngreat cultural resources of our civilization. To put it in the most obvious terms, a\ndiscussion of whether or not it’s profitable for a University to try to interest people in\nsuch subjects as French Literature of the Eighteenth Century or the Nineteenth Century\nEnglish novel. The discussion usually came down to whether the average American was\ninterested in such things or would pay any attention to them. The discussion led to a\nconsideration of what it takes to be able to enjoy these aspects of our heritage. Most\npeople, and particularly University people who deal with students who have already gone\nthrough a long course of education, tend to underestimate how much training and pre¬\nparation are necessary before one reaches the level of sophistication necessary for the\nenjoyment of the arts.\nSo one of our basic notions became this^ that one of the functions of the University\nin educational television would be to try to develop the kind of understanding of past\ncultural epochs that is prerequisite to the enjoyment of their arts and literature.\nIn the world of the commercial broadcasters there are really only two categories\nof citizens—the lowbrows and the highbrows—and from the broadcasters’ point of view\nthere are very few highbrows, insignificant from a commercial viewpoint, but there\nare great masses of lowbrows. This is the way the world is, they say, and under the\ndoctrine of cultural democracy this is the way we leave it; we simply provide programs\nsuitable for the lowbrows.\nNow the academic world is one of cultural responsibility, and as long as we\nbelieve—if we really believe—that there are profound human values in the arts and\nliterature of the past and of the high arts of our own time, as distinguished from the\npopular arts, we must assume responsibility for making them available to the great\nmasses of people. And that, our Committee assumed, is one of the basic functions of\nthe community television station. But in order to make them available, it will be\nnecessary to provide the cultural training that one must have in order to make sense\n- 26 -"
}