{
  "id": "d1349-29",
  "text": "DONALD HORTON\nout of Shakespeare or Michelangelo or Tolstoi. I think if we were all honest with our¬\nselves we would admit that one has to have a great deal of preparation for understanding\nthe works of these men.\nFrom a research point of view Fm rather intrigued by this particular problem—the\nproblem presented by the lowbrow-highbrow dichotomy in contemporary society; and I\nthink we ought to know a great deal more than we do about it. I don’t think we ought to\ntake the attitude that we have to find out what the public will accept, and then give them\nthat. What we really ought to be doing is finding out more about this public. We’re not\ngoing to learn much when commercial research shows time and again that highbrow pro¬\nductions get small audiences, and that’s the end of the matter. A few such productions\nmay&e kept on for prestige purposes, but it has become a cliche that these don’t have\nmass appeal.\nWe ought not take this for granted. We ought not take for granted that we under¬\nstand why this is so. As a matter of fact, if you think about it, it seems very peculiar\nthat it should be so. If it’s true that the kinds of programs the highbrow audience is\ninterested in express the highest values of our civilization, and that the people who\nappreciate them are the most cultivated people our civilization produces, why does it\nnecessarily follow that all the rest of the people should find them uninteresting and un¬\nacceptable? To me that seems to be a problem rather than something that’s obvious.\nWe ought to be asking what it is, from the viewpoint of the man in the street, that\ncharacterizes the highbrow in literature and art. What is it that he’s rejecting? Is it\nmerely that he lacks historical knowledge which, as I’ve suggested, is required for a\nfull appreciation of highbrow art in terms of its contemporary context? Is that all there\nis to it?\nOr does the man in the street identify the high arts with women’s interests and\nvalues, as some students of American life have suggested? Does he respond with some\nsense of guilt or attitude of rejection left over from his school days? Is his attitude a\n- 27 -"
}