{
  "id": "d1349-30",
  "text": "THE UNIVERSITY OF CHICAGO REPORT\nprotest against the social inequalities of education and taste that seem to be intrinsic to\nour present social class system? Is it particularly the quality of neurotic egocentrism\nthat runs through so much of modern art that he’s sensitive to? I pose these questions in\norder to suggest a perspective. The general problem is: why are quality programs\nrejected? I don't think we really know, and I think this is one of the things we should not\ntake for granted and which we should be inquiring into in every way we know how. If we\nare able to answer some of these questions about the attitude of the man in the street,\nthen I think that we would know better how to run community television enterprises\nsuccessfully.\nIV\nThe final assumption is one that I suppose is fairly obvious. It refers to what I\ncall the \"developmental perspective\" of community television. As we all know, the\nobjective of commercial broadcasting, as of all the commercial mass media, is to\nachieve stability, to set up a kind of system that can go on year after year, preferably\nin the same old routine, because the less change there is the less expense, the less\nbother, the fewer new problems, and the fewer difficulties to be faced. All the force of\nthese great enterprises is directed toward protecting these systems and keeping them,\nsofar as possible, in a state of equilibrium. Every new development that in any sense\nthreatens to upset the equilibrium of the system is opposed with tremendous energy just\nas community television is opposed.\nBut we take it for granted that community television assumes the risk of change,\nand that it assumes the responsibility for bringing its audience along with it instead of\nallowing any settling down into routine to take place. We made the assumption that this\nkind of operation must always and will always be experimental, creative, willing to\nassume risk, willing to make boners, willing to produce turkeys, and willing to produce\nprograms that will become controversial.\n- 28 -"
}