{
  "id": "d1349-31",
  "text": "DONALD HORTON\nWe also emphasized in our report--and we found this very important for discussion\nwith our faculty—that educational television will experiment with cumulative programming,\nwith programs in which it’s assumed, as it is in the classroom or in a lecture series,\nthat the audience will remain with the program and will learn from one production to the\nnext. That is to say, we shall have some possibility of developing our audiences.\nWe're assuming that schools will not simply be teaching by means of television, but\nthat they will be teaching the students how to evaluate television, what to expect from\ntelevision, how to look at it, and teaching them to accept programs at a level which they\nwould not otherwise be able to achieve. We assume cultivation of an audience through\ncollaboration with other organizations than schools. We're assuming, in other words,\nthat a process of education goes along with broadcasting.\nAll of this presupposes that we have a long term perspective, a perspective very\ndifferent from that of commercial broadcasting. We can think in terms of generations of\nviewers. Of course we're realistic enough to know that the state legislatures and others\nwho put up the money are going to be asking for results. Obviously we'll have results to\nshow them. But what we're talking about here is the maximum achievement of com¬\nmunity television, an achievement that will depend upon the gradual development of the\naudience.\nThere are other assumptions, more or less explicitly stated in the published report\nof our Committee, but I think I have discussed the important ones. It should be observed\nthat the assumptions we make have immediate implications for our criteria of success.\nThat is, defining what constitutes success depends upon these basic assumptions in which\nwe formulate what we’re doing and what we want to accomplish.\nFor example, our emphasis clearly should not be on sheer size of audience but on\ncumulative effect, and not on the effect of individual programs, but on changes and develop¬\nments in the audience over some considerable period of time. We should also consider a\ncumulative increase in involvement in the television work itself on the part of members of\n- 29 -"
}