{
  "id": "d1349-34",
  "text": "TELEVISION AND OTHER MEDIA\nelectricity can do in multiplying and sending messages. What we must now do is develop\nsocial inventions to use the mechanical inventions most skillfully.\nI\nI shall try to analyze what educational television is—what we might do with the\nmedium if we understood it, if we thought of it in its long-time possibilities. Let us\nforego for a little while the pressing, emergency problems of television and see if we\ncanst have a long-view as well as the ever-present close-up.\nTelevision may be considered both as a neutral vehicle for conveying a message—\nand also as specific educational material. When we think of books we concern ourselves\nnot only with printing as a way of duplicating words and pictures, but also with the\nsubject-matter in the books.\nIf I were to make only one statement about television as an educational tool, I\nwould emphasize it as a multiple-medium device. It is radio, it is the film-strip, it is\nthe photograph, it is the museum, it is the exhibit; it is a blackboard, a felt-board, a\nposter, a field trip, a demonstration. Sometimes it is reading as in the trade names or\nslogans, simple charts, blackboard material. It is all of these things singly and, far\nmore important, it is all of these things put together in an integrated way and served up\nwith a warm friendly personal voice.\nHow do these characteristics of television—and I have been inaccurately brief—\ntie in with the characteristics of effective communication? In his Seventh Letter Plato\nmakes the point that \"the core of his message cannot be written down, but can be trans¬\nmitted only from individual teacher to individual pupil, when teacher and pupil know each\nother intimately, from the experience of living and talking together. Under such condi¬\ntions the teacher can present his message in precisely the form in which it is appropriate\nto the mind of his pupil. All other forms and conditions of communication represent so\nmany declensions from this summit. There is a loss in precision, or effectiveness, or\n- 32 -"
}