{
  "id": "d1349-35",
  "text": "EDGAR DALE\nboth, as soon as the teacher commits his message to a fixed form of written words, or as\nsoon as the single pupil becomes a class of two or more.”*\nI think this theory of communication of two thousand years ago has relevance today.\nToday we have been committed to books as ways of learning and we would all agree that\nwithout books intellectual maturity is not possible. But Plato’s criticism of a book or a\nmonologue as fixed or inflexible does have relevance. Feed-back from the person spoken\nto may be absent. In schools certainly there is a tendency for memorization of books,\nfor repetition of the words of the writer.\nAnother weakness of an exclusively book approach is that emphasis is placed on\ngeneralizations instead of generalizing. I am all for the well-stocked mind—one does\nnot have to believe in faculty psychology to accept this idea—but in this inventive and\nchanging world it is singularly important that schools and colleges develop the art of\nlearning and a taste for learning. I do not say that subject-matter will take care of it-\nself--but subject-matter must not be communicated in such a way as to decrease the art\nand ability to learn nor to cause a distaste for learning. Every medium, and this includes\nbooks, can be abused.\nWe are moving away from the old idea of ”No more teachers, no more books, no\nmore teachers’ homely looks.\" Books are better than they ever were before. But I do\nwant to remind you that in Stanley Diamond’s citizenship study in Detroit he concluded\nthat very little problem-solving was being taught in any of the schools studied. Books,\nthe recorded experiences of people who have solved certain problems, have relevance\nbecause they can help someone else solve these problems. Television can motivate\nlearning by showing people with problems that some of the subject-matter needed to\nsolve these problems is in books but not all of it. I suggest strongly that television can\nhelp us understand that not all people who can read books are literate and that not all\n* Bambrough, Renford, \"The Philosophy of Broadcasting. ” The BBC Quarterly VII\n(Winter 1952-53), p. 223.\n- 33 -"
}