{
  "id": "d1349-36",
  "text": "TELEVISION AND OTHER MEDIA\npersons who cannot read books are stupid. Life is experiencing, it is generalizing, con¬\nceptualizing, it is a warm and intimate taking in of the initially unclassified experiences\nof life. Many of the answers to problems are partially contained in books. But the real\nproblems are those of persons living, breathing, sensient beings.\nII\nWhat does all this have to do with television? I see educational television often\npresenting life in its less organized, less classified form. Subjects, classified subject\nmatter, follow life far more often than they precede it. The Ding-Dong Lady, Frances\nHorwich, presents us with a suggested approach. She helps children realize that they\nhave fingers, noses, feet, eyes, and brains. They can make things out of pipe cleaners\nor just stuff around. Experience means to experiment.\nPerhaps television with it’s all-seeing eye can bring to us some of the experiences,\nthe experimenting, that meant so much to children who grew up twenty-five to fifty years\nago. They had lots of unclassified, unorganized experiences. Why not show grandpa\nand others making things—sometimes on their own, sometimes for children. Let\nchildren ask simple, naive questions about what is being made. Or maybe we could have\nadults watching other adults making things—weaving, whittling, cooking, painting, build- !\ning and so on.\nI am making the point here that viewing television need be neither passive nor\nlimiting as far as direct experience is concerned. It can involve the most active kind of\nlistening and viewing. It can move its viewers in the direction of more \"direct\" experi¬\nence. It can motivate, the key essential in learning.\nCertainly television can help us see problems more clearly, help us formulate\nthem. Maybe one of television’s greatest values for education will be in raising issues,\nhelping students see problems where they did not see them before, helping them pin point\nand nail down their own problems. Isn’t it true that the most important part of an edu¬\ncation is to discover what our problems really are in contradistinction to the ideas of\n- 34 -"
}