{
  "id": "d1349-37",
  "text": "EDGAR DALE\nwhat we initially think they are, or of accepting someone else’s idea of what our problems\nreally are.\nFor example, is the problem of the University of Wisconsin that of finding able,\ncreative young men and women to take the place of the older faculty now moving off the\nscene? If so stated, then one thinks of other colleges and universities that can be robbed.\nSo conceived Harvard robs Ohio State of its young, able economists, Ohio State robs\nKentucky and so on. But if one thinks of the problem in another way, we ask how can we\ncreate, not merely find, more able young instructors. In our search for talents are we\ndiscriminating against women, against Negroes ? How about more money for fellowships ?\nAnd so on.\nIs our problem as adults that of winning friends and influencing people? So stated,\nthen flattery, cajolery, salesmanship, being liked become central problems. But if the\nanalysis is wrong, if the problem is how to advance the purposes of inclusive groups to\nwhich we belong, then the problem must be stated differently. Can educational television\nmake its viewers more problem-analysis centered, less answer-dominated?\nIll\nAll of this preceding discussion may seem like running a mile to jump over the\ncreek. But television is in its formative stages. We can bend it to our purposes of hav¬\ning it be an instrument for presenting answers to problems—like a typical course—or we\ncan use television for the flexible thing that it is—a fluid, many-faceted, many-powered\ninstrument for communication.\nDo I mean, then, that we should not have formal courses on television. Of course\nnot. I think we should have them. But I merely ask is this the metier of television, the\nthing it does best of all? I don’t think so. I think television is a great showcase for life\nin its sentient, relatively unclassified, informal aspects. It is personal, friendly,\nengaging. It is the cracker-barrel rather than the formal course. It is an informal\n- 35 -"
}