{
  "id": "d1349-38",
  "text": "TELEVISION AND OTHER MEDIA\nfriendly visit, not a formal call. It is low-powered, relatively slowly-paced, not swift\nand high-powered.\nThe criterion I would set up would often involve the query: is it fun to watch?\nSuppose we do a little exercise in this. Here are some things that are fun to watch.\nIt's fun to watch children learning new skills. I just watched a four-year-old climb up\nand down on an out-door fireplace, take his kitty with him, jump off, climb up again. He\ndid it ten times. He had learned to use his rubber-soled shoes as a leverage device. It\nwas like the ten-month-old boy who did the same thing when he stood up. Both were\nterribly pleased when they succeeded.\nOrangutangs, chimps, most animals are fun to watch. It is fun to watch people\nmake things like cakes, or houses, or big holes in the ground. It is fun to watch how\nthings work—a speedometer, an adding machine, a pull-over stitcher for making shoes,\na pretzel-bender—old style and new. Not only is it fun to watch but television can\nstimulate action.\nIn 1952 over forty-one million visited our national parks—twice the pre-war re¬\ncord. State parks had over one hundred twenty million visitors. Television can bring\nthe Great Outdoors indoors and stimulate travel thereby.\nI have said that television is a many-faceted device—multi-dimensional. It has\ngreat powers of motivation. It does unusually well as an informal device which raises\nproblems, helps people think through their own problems. Indeed as we use education¬\nal television I would like to see its power to raise and analyze problems and motivate\nproblem-solving made use of.\nBy this I do not mean to criticize in the least the formal course. But when we\nhave the organized course, let’s exploit the possibilities of the medium. Sustained\nattention even in a classroom is hard to get. One study shows that college students are\npaying attention to the instructor and what is going on class-wise only about fifty per\ncent of the time. The television teacher may have a harder time.\n- 36 -"
}