{
  "id": "d1349-42",
  "text": "TELEVISION AND ADULT EDUCATION\nproblems. These two objectives are inseparable. Activities of adult education take place\nin a community, the world of first responsibility of people. The responsibility of indivi¬\nduals to their communities or citizenship is an important part of personality development.\nThe community then becomes the point of focus for adult education in order to make its\nopportunities available to all of the community’s people, in order to concern itself with\nthe development of the community, and in order to help increase the expression of\ncitizenship responsibility of individuals and their groups in cooperative action. But in\nthis modern world of expanding environment the responsibilities of citizenship also reach\nout to regional, national, and world affairs. Because we operate in the cultural frame¬\nwork of democracy its influence should be recognized in adult education goals, operations,\nand methods. Adult education should always be an experience in democracy. The use of\ninformation and logical reasoning is an essential in our modern civilization. Adult edu¬\ncation becomes more effective in carrying out its purposes as it helps people to increase\ntheir skill in the use of facts and logic. Adult education, however, needs also continually\nto apply the scientific method in the'evaluation of its own activities. Throughout all of its\noperations adult education faces a moral responsibility because at every point it is\ninvolved in change — individual change and social change. Such endeavors must be solid¬\nly based on a full appreciation of values and a sensitivity to their far-reaching impli¬\ncations. ”\nNow, in this context, why do adults seek education? Though there are many reasons,\nthe experts generally agree on four or five, and I should like to summarize these reasons\non the basis of Paul Essert's analysis in his recent book on adult education. Here then\nare five specific needs of adults that lead them to seek educational opportunities.\nIn the first place, adults are always looking for ways to improve their occupational\nor professional proficiency. The overwhelming number of adult education activities,\nclass as well as non-class, fall in this broad category.\n- 40 -"
}