{
  "id": "d1349-43",
  "text": "L. H„ ADOLFSON\nSecondly, adults are concerned with self-improvement in terms of general cultural\ninterests. Many people are constantly in search of truth and beauty, and I suspect that\neveryone in this group has at one time or another sought adult education courses for this\npurpose.\nIn the third place, adults seek educational programs that will help them fulfill their\nneeds for self-government. Men have always wanted to share in the making of the rules\nby which they live, and many men seek to improve their facility in helping to make these\nrules. The encouragement of this desire is especially important in a democracy where\nthe success of the government depends on the consent of the governed, which, in turn,\ndemands that people generally must be able to practice the art of self-government at a\nhigh level.\nThe fourth need that sends adults in search of education is the need for close\nfellowship. This need involves\\the desire to join with other people in a stimulating\nintellectual enterprise and represents an important motivation of adults in search of edu¬\ncation. I believe it likely has some very special applications to educational television.\nFinally, there is an adult need which may seem off hand, to be contradictory to\nthe need for close fellowship, namely, the need for intermittent solitude. This need is\nan important one in the present day world, because all people are under a great variety\nof group pressures almost constantly. We need, therefore, \"to get away from it all\"\noccasionally so that we can see our own lives and problems more clearly. Let me give\na concrete example from my own experience to indicate how adult education fills this\nneed for solitude. I lead a busy life that keeps me occupied for most of my waking hours.\nIn that workaday life I have relatively little time for extended reading or thinking.\nConsequently, I frequently do some work on a correspondence study course, or agree to\ngive a lecture in a field I have not touched for a long time, in order that I might be forced\ninto my study at home to work and think through solid subject matter problems again, out\nof which I invariably get a better perspective on what I am doing. Oddly enough, this type\n- 41 -"
}