{
  "id": "d1349-44",
  "text": "TELEVISION AND ADULT EDUCATION\nof motivation is strong in many kinds of adult education programs, and I am certain that\nit deserves some real consideration in planning television programming.\nIn addition to the five broad motivations of adults in seeking adult education, there\nare certain other characteristics of our society in terms of individual needs that edu¬\ncational television must take into account. Most serious students of our times agree\nthat one of the major characteristics of this era is the growing sense of individual iso¬\nlation experienced by great masses of our people. A great many people in our society\nfeel a genuine sense of isolation from their fellows. This isolation tends to lead to\npersonal frustrations, and the combination of the feeling of isolation with frustration pro¬\nduces many of the fears that are part and parcel of our society today. If you will excuse\na reference to my own state, I am not at all sure but that the roots of McCarthyism lie\ndeep in the basic fears and frustrations that have grown out of a growing sense of iso¬\nlation for great numbers of people.. Someone has said that the loneliness of the ordinary\nman is almost unbelievable, if you can really get to understand it. I am certain that this\nsituation will present peculiar problems for television programming for adults. Any\nmedium of communication that comes directly into the home, where people can be\nentirely alone, might well tend to exaggerate this particular feeling of people and thus\ntend to aggravate the social problems we face as a result of this mass psychological\nsituation.\nA second major characteristic of our society on which I should like to comment\nbriefly is its pluralistic nature. The decisions that keep our world operating are made\nthrough all sorts of groups in all sorts of places. As you well know, we are pluralistic\nin our government. We are pluralistic in our economic and social groupings. As a\nmatter of fact, it is probably true that the real strength of our democracy, the real\nsource of support for our freedoms, is the fractionalization of power in our pluralistic\nsociety that prevents any single group from getting hold of a major portion of that power.\n- 42 -"
}