{
  "id": "d1349-45",
  "text": "L. H„ ADOLFSON\nThis is one of the cardinal facts of our democratic politics, and it’s one with which adult\neducation has constantly to deal.\nMany adult educators, therefore, are concerned directly with seeking to develop\nprograms that fit the particular needs of all sorts of dissimilar groups in our society.\nInsofar as we as adult educators are successful, we enable many groups to survive and\nto provide services for their people. And as long as these groups can remain strong and\nviable, I am convinced that one of the real bulwarks of our democratic society will be\nsustained. Here again, it seems to-me, there are important implications for future tele¬\nvision programming for adults.\nII\nNow, let me turn to a more specific discussion of the educational needs of adults\nin terms of specific types of program activities. I think it should be said that while edu¬\ncators generally feel that television will change the nature of adult education, they dare\nnot put their whole emphasis on it. Many aspects of adult education must be handled on\nan individual or small group basis. However, in varying degrees adult educators agree\nthat the very nature of their work will undergo drastic change in the next decade or two\nas a result of television.\nI should like to add that television programming for adults must emphasize\ncontent; it must deal with the real problems of real people in a real world.\nAfter these generalizations, let me discuss four or five broad categories of pro¬\ngrams, in terms of both practice and theory, viewed from my own specialized experiences\nin adult education.\nFirst, it seems to me that television offers almost untold opportunities for the\nexpansion of formal education in the United States. In some ways, this is probably its\nsimplest task, a task that educational radio never licked. Despite the almost superhuman\nefforts of McCarty and others here at Wisconsin, we never completely licked the problem\nof offering college credit courses by radio.\n- 43 -"
}