{
  "id": "d1349-46",
  "text": "TELEVISION AND ADULT EDUCATION\nI am convinced that this problem will be overcome by television on a broad basis\nthrough the offering of well-rounded formal programs of both high school and college edu¬\ncation, though I am thinking here primarily of college education. I also believe tele¬\nvision will inevitably have a salutary effect on residence college instruction itself.\nThe need for an expansion of our formal college work is great. There are all sorts\nof statistics to document this need. Even today when a very considerable proportion of\nour young people are attending colleges and universities, there is still a large number of\nour ablest young people unable to begin a college education for economic and other reasons\nHere in Wisconsin, through a system of Extension Centers attached to the\nUniversity, we’re attempting to broaden this educational opportunity to many sections of\nour state, where adequate college opportunities are not close at hand. However, there\nare obviously definite limits as to how far we can go in providing this type of education on\na face-to-face basis. It is for this reason that I have no question but that a considerable\nportion of this kind of lower division college training will be provided through television.\nThis will not be too difficult, particularly if the television process can be combined with\nstreamlined home study methods, in which a great deal of experimentation is going on at\nthe present time.\nFor instance, we at Wisconsin are engaged in experimenting with receiving oral\nrecitations through the mails by using the new recording gadgets that are now available.\nIf you can tie together television, with its limitless possibilities for lectures, demon¬\nstrations, and discussions, with the most modern techniques of home study or correspon¬\ndence study, I believe that the effectiveness of this kind of training will be so great that\nit cannot be stopped. Make no mistake about it, there are serious problems here of both\ntechnique and internal University relationships, but I am confident that these can and will\nbe mastered.\nA second broad type of television programming concerns the enjoyment of and\nparticipation in the cultural arts. Programs of this type are fairly self-evident in music,\n- 44 -"
}