{
  "id": "d1349-47",
  "text": "L. H. ADOLFSON\nin drama, and in painting. Programs in this category will, on the one hand, be developed\nfor people simply to enjoy. But, on the other hand, they will also go far beyond mere\nenjoyment in assisting in the development of hobbies and skills that are related to the great\nleisure and recreation problems that our society faces at the present time. One of the\nimpressive coincidences of our era is that just when the problems of leisure and recreation\nare among the most difficult we face in our society, television comes along. And tele¬\nvision, if properly handled, can provide assistance for literally millions of our people on\njust these recreational problems. It seems to me that audience needs and desires are al¬\nmost limitless in this broad area of potential television programming, and I am certain\nthat here, too, television has an unusual opportunity to be of immense service to our\npeople. Incidentally, it may be that this is the marginal area between educational and\nentertainment television.\nThe third category of program possibilities is concerned with growth and partici¬\npation in the civic or citizenship arts. Programs in this field may take place on various\nlevels.\nOne area here has to do with the provision of training programs for government\nofficials, and particularly for local government officials. Especially in the rural areas,\nlocal government officials frequently know little about the technical problems of govern¬\ning, even though they may know a great deal about the political problems of their locality.\nThese officials eagerly seek training programs, and I believe that television can meet\nmany of their problems with unusual effectiveness.\nHowever, not only local officials need training programs of this type. State\nofficials and civil servants of all sorts are looking for training programs as well. Parti¬\ncularly if programs are developed nationally, there seems little question but that there\nwould be sufficient people throughout the country as a whole to support training activities\nof this kind.\n- 45 -"
}