{
  "id": "d1349-48",
  "text": "TELEVISION AND ADULT EDUCATION\nIn addition to programs dealing with the technical training problems of government\nofficials, there is a broad area of programs in the citizenship arts to be considered for\npeople generally. Programs of this type will range from straight reporting of important\npublic events to highly specialized programs on various aspects of domestic and inter¬\nnational affairs. And since the problem of face-to-fcace instruction in this field is\nextremely difficult, I am not sure but that television can actually do a much more\neffective job in this area than all adult education put together has been able to do up to\nthis time. It is in this sense that television has an absolutely unique opportunity, if used\nimaginatively and intelligently, to make an enormous contribution to what we generally\ncall \"the democratic practice.\" Certainly, if we are going to solve democratically many\nof the problems we face, we simply must provide our people as a whole with more\ninformation, sharper insights, and greater understanding of our problems than we have\never had before. Both public and private television can share in developing programs in\nthis field and thus can make a major contribution to the effectiveness of our society in this\narea of adult education.\nA fourth category of possible television programming has to do with the training of\nprofessional and technical people. We live, as you all know, in a time of extremely\nrapid scientific and technological change. For the first time in the history of man, it is\nliterally true that many types of jobs change completely within the lifetime of a single\nindividual. Moreover, in many of the professions change has come so rapidly that pro¬\nfessional people must continue to study and participate in refresher courses constantly\nif they are to keep on top of their profession. This is true of doctors, dentists, lawyers,\nteachers, social workers, and many others.\nRapid change in our society is having an increasing impact upon education. Insti¬\ntutions of higher education are, almost without exception, paying more and more\nattention to this kind of \"post-graduate work.\" Here at Wisconsin, for instance, since the\nend of World War II, approximately eight years, our programs in this area of Extension\n- 46 -"
}