{
  "id": "d1349-49",
  "text": "L. H. ADOLFSON\nwork have increased in the neighborhood of five hundred to six hundred percent, and we\nknow we have hardly scratched the surface. While many professional people can come to\nMadison or Milwaukee for short refresher courses, many others live in isolated com¬\nmunities where they alone serve a considerable area. The latter find it almost impossible\nto leave for a week or two of study away from their home base. Consequently, they are\ncoming to us for various kinds of special instructional aids, including home study. Here\nagain, it seems to me, television has an unusually rich opportunity to reach spot\naudiences with effective programs. I assume, incidentally, that educational television\nwill be concerned to a considerable degree with so-called spot audiences, rather than\nconcentrating entirely on mass audiences. If this is true, the opportunities for education¬\nal television in this area are almost limitless.\nin\nTo perform this kind of educational work effectively, you must bring together a\nwide range of experts. It is at this point that I believe television programming and edu¬\ncational programming, such as that of university extension divisions, should come to¬\ngether. By this I mean that effective programming in this area requires enormously\nrich resources and a facility for tapping those resources. University extension divi¬\nsions, in general, have developed the kind of facilities that reach both into the universi¬\nties themselves and out into the professions in order to utilize the best possible teaching\nskills to handle particular types of programs. Consequently, I believe that educational\ntelevision stations will have to become related, in one way or another, to the kind of\nadministrative instrument represented by university extension divisions. These divi¬\nsions have their roots in the subject matter departments of the university, on the one\nhand, and in business, industry, and the professions on the other, in order to take ad¬\nvantage of technical competencies wherever they may be found. In the long run, edu¬\ncational television will not be able to do its job effectively in this area unless it works in\nclose cooperation with a facility such as university extension.\n- 47 -"
}