{
  "id": "d1349-50",
  "text": "TELEVISION AND ADULT EDUCATION\nFinally, there is the broad category of potential programming for the so-called\ninformal adult education groups of our society. These groups include members of all\nsorts of community organizations — churches, service groups, the Red Cross, the Boy\nScouts and Girl Scouts, the YMCA, and the YWCA. We have literally thousands of com¬\nmunity organizations that are engaged in one way or another in informal adult education.\nTheir educational programs may involve activities for more than their own members.\nFor instance, the Boy Scouts and Girl Scouts offer widespread training programs for\ntheir adult leaders. In this sense, they are not reaching the boys and girls in terms of\neducational programs, but they are reaching the adult leaders who will have charge of\nthe boys and girls. Educational television will certainly have many opportunities in this\narea of adult education.\nAt this point, let me indicate a matter of process. Programs of this type must be\ndeveloped by and for a particular community or area, with the television station consider¬\ned as purely a resource for the community rather than the community being considered as\na resource for the station. This is a point we should keep perfectly clear — that the\nstation is simply a resource for all of these functional groups within the community and,\nas such, the station must incorporate community groups in its program planning.\nAs a matter of fact, it may be that in order to program effectively with these groups,\nyou will have to provide technical workshops on television for community leaders so that\nthey will have the necessary appreciation of the technical problems of television to enable\nthem to develop practical programs. Let me give a single illustration of this fact.\nI am chairman of the Council of National Organizations of the Adult Education Associ¬\nation of the United States. We have more than one hundred national organizations partici¬\npating in this Council at the present time. Among the things in which we, as a Council,\nare interested is that of the use of television by the local constituents of our national\norganizations. In an effort to try to determine our particular role in television, we decided\nto hold an experimental television workship for community leaders. This workshop was\n- 48 -"
}