{
  "id": "d1349-51",
  "text": "L. H. ADOLFSON\nheld about a month ago at the University of Southern California by our Council of National\nOrganizations, with the financial help of the Fund for Adult Education and with the\ncooperation of the Allen Hancock Foundation with facilities and personnel. I was not\npresent at the workshop, so I cannot report about it first hand. However, the reports I\nhave had indicate that this was an enormously exciting experience for the eighteen or\ntwenty key community leaders in the Los Angeles area who participated in it. They spent\na solid week on the sheer techniques of television, involving both the mechanical side and\nthe program development side. There was apparently a full interplay of ideas between\nthe technical people conducting the institute and the lay people who knew almost literally\nnothing about television when they began. By the time the workshop was finished, it was\nperfectly clear that lay people could absorb an enormous amount of technical information\nabout television in a relatively short period, and that they had a great deal to offer the\ntechnical people in television as to programming. The end result was that this group\nwas appointed the Advisory Committee on Local Program Planning for the Allen Hancock\nFoundation and its educational television station located on the campus of Southern\nCalifornia University.\nNow, I have been talking here chiefly about process. I want to underscore that if\nthis medium is going to be as effective as it seems potentially to be for the wide range of\norganizations in our society, these groups must be incorporated into the very process of\nthe development of television programs.\nI have covered briefly several areas that seem important to me in considering the\nproblems of educational television programming from the point of view of the needs of\nadult audiences. Let me conclude with two summary comments that have at least been\nimplicit in what I have already said.\nFi!rst, I am certain that if the experience of adult educators generally means any¬\nthing, then educational television must search constantly for methods of incorporating\nadult groups in their program planning and development. Only in this way can you\n- 49 -"
}