{
  "id": "d1349-54",
  "text": "TELEVISION IN THE CLASSROOM\nsecondly, we develop the experiences. For example, when we ask a group of primary\nschool teachers to revise a curriculum, we do not begin by organizing subject matter and\ndeveloping it sequentially. That’s the old-fashioned way of doing it. We begin with know¬\nledge of the youngster, his psychological profile. We want to know what his predilections\nare, his native interests. And only then do we fashion the experiences. The same process\nneeds to be followed with older children. What about this older boy? He likes, for\ninstance, to be up-to-date. He knows that when his teacher talks to him about vocational\nguidance, if the man hasn’t been in a shop for twenty years, that the guidance is out-of-\ndate, isn’t functional. That’s one contribution we can make with television. Our infor¬\nmation can be up-to-date.\nWe know that these youngsters will not learn unless they’re emotionally involved.\nWhen we involve people in an experience, they share in it, they learn from it more readi¬\nly. Good script writers have always known that. We say we like to have ’’sympathetic\nidentification” in our script; so does a good teacher. She likes to have a youngster\nidentified with the experience;. Thus we often have child contemporaries in a good\nschool script. We know that is sound psychologically because the child viewer transplants\nhimself into the dramatized situation. Unless he is a part of a process he remains a\nspectator, not a participant.\nIt is a truism that we learn more from direct experiences than we do from indirect\nexperiences. We cannot provide direct experience as we could by a journey to the farm,\nfor example. However, we can approximate it with some type of reality, more effective\nthan the spoken word, if we employ television effectively.\nWe know from a great many surveys that youngsters prefer programs that are\nhumorous and adventurous in just about that order. That knowledge means something\nto the script writer. He strives to incorporate some elements of humor in his classroom\nprogram. What does the need for adventure mean to the script writer? It means that\nwhether he is dealing with Norway or modern art it helps to have a story line . Whether\na narrator relates his personal experiences or whether the adventure element is\n- 52 -"
}