{
  "id": "d1349-55",
  "text": "WILLIAM B. LEVENSON\ncontrived, a good story supporting the program’s primary purpose is essential. Parents\nknow that youngsters at a certain age think they know all the answers. To educators this\nunderlines the need of constant challenge. When a classroom television program demon¬\nstrates that even experts can disagree on something that’s seemingly evident to the\nchild, he comes to understand there is some value in suspended judgment. That is an\nimplicit by-product of what television can do. Not what it does inevitably, but what it\ncan do.\nOf course, we know how natural it is for youngsters to become provincial. That\ncan be a fine thing if it is transferred to intelligent patriotism. But unbridled it can\nlead to mere jingoism. The modern teacher knows that with the aid of electronic\ncommunication she can open windows, so to speak, that her pupils may see the rest of\nthe world. That, too, is based on a native interest and need that youngsters have.\nWhen you are telecasting to junior high students you must recognize that during\nthe adolescent period, the coming of puberty, there is a native interest in the other sex.\nThus we incorporate that in our scripts. We have a program on etiquette. That is a\nnatural. Why? Because now the boys and girls are becoming a little concerned about\nhow they sit down in company. How to ask for a dance. There is an optimum time for\ncertain kinds of programs. A knowledge of children helps to determine the best time\nfor dealing with certain material. For example, if you broadcast an etiquette program\nto the third grader he doesn’t care. But if you wait awhile, and let the law of readiness\napply, and then present the information when he wants it, the child will learn more\nreadily. We begin, then, with the child in our programming. We do not begin with a\ngimmick. We do not begin with a script writer’s idea. That's too easy. Beware of\nthe fellow who comes around and says, \"I’ve got a swell idea for a show.” He may have\na swell idea, but not for classroom broadcasting. Titles are a dime a dozen. They\nmay look good on paper, but the pay-off is the impact on kids. One can’t emphasize that\ntoo much.\n- 53 -"
}