{
  "id": "d1349-56",
  "text": "TELEVISION IN THE CLASSROOM\nII\nThe classroom telecaster needs to know the school situation, as well—not only the\nchild, but the situation in which he learns. Fundamentally, we can’t teach a child any¬\nthing. All we can do is create a climate in which youngsters will learn—an emotional\nclimate, an intellectual climate. That television can do. I keep emphasizing ’’can” be¬\ncause there is an obvious gap between what it does and what it can do.\nTelevision in the school can help youngsters to integrate the knowledge they re¬\nceive. Years ago we used to assume that if you taught this child 45 minutes of English,\n45 minutes of science, and 45 minutes of math, that he would make the integration him¬\nself. It didn’t always follow. Today we know that we must help the learner to make the\nintegration, to associate meanings. We can do that with television very effectively. We\ngive them via television a series of related experiences so that they begin to sense that\nthere is a relationship between mathematics and music, science and mathematics, art\nand music. That, a good classroom program should do.\nTelevision can help a youngster to summarize units. It can give him sufficient\ndrill in a painless way. And that needs to be done soon because you will remember from\nyour psychology that the forgetting curve drops very quickly after knowledge is acquired.\nSo you catch it right after the learning with a series of drills pleasantly presented through\ntelevision.\nThere’s no substitute, of course, for personal activity. We do not just learn by\nosmosis. But we can stimulate people to want to learn, and that is our opportunity. In\nthe classroom situation we can help children to intensify their appreciation. To be sure\nwith too much analysis we can destroy the entire interest. Yet skillful broadcasters know\nhow to provide emotional reenforcement. Learning is more than an intellectual process.\nWe also learn emotionally. And very frequently, if we’re not careful, the emotion can\nbecome a substitute for the intellect. Our obligation, then, is to reenforce the intellect\nwith emotion and to relate them both to serve a common purpose. Thus the good script\n- 54 -"
}