{
  "id": "d1349-57",
  "text": "WILLIAM B„ LEVENSON\nwriter, recognizing that possibility, will work in that direction. In classroom telecasting\nwe can stimulate pupils to study further. Many teachers try that and fail. Learning be¬\ncomes a finite thing. The child stops studying when he can pass the examination. Here is\na unique opportunity for television. It can stimulate the child to want to go on, to give\nhim a springboard from which he can move forward to new knowledge.\nSometimes in the school situation one can use broadcasting to incorporate new areas\nof study that arise because of the complexities of life—safety education for example.\nEverybody says it’s important and yet too many leave it up to the other department to do.\nWith television we can develop a series of experiences for children through which they\nwill receive without being lectured at, some idea of safe living in a complex society. We\ncan do it intellectually and emotionally and we can do it without belaboring the point and\nwithout preaching. It depends on who is doing it and how well it’s being done. In the\nfield of health, I recall particularly, our use of Bob Feller, the baseball pitcher, to talk\nabout health. As the child’s idol, he could do more in a few minutes than many teachers\ncould ever achieve. By capitalizing on pupils’ native interests, their idols as well,\nlegitimate educational goals can be achieved..\nUnlike entertainment, when you re talking about classroom broadcasting and are\nreally serious about it, you don’t begin with gimmicks or fancy ideas, you start with a\npurpose.\nIn classroom broadcasts we need to be careful that we don’t straddle our program\nconcept and try to reach everybody at the same time. I am very skeptical when I pick\nup a teacher’s program guide and see a program planned for elementary grades. The\nassumption is that that program will be of equal value to all children whether they be\nfive or possibly fourteen. It just does not work out that way. You can't buy a suit to fit\nevery youngster five to fourteen. You cannot even buy one that will fit every youngster,\nfive, because of individual differences. So you have to begin to delimit and that under¬\nstandably is an expensive proposition in terms of loss of listeners and viewers when\n- 55 -"
}