{
  "id": "d1349-58",
  "text": "TELEVISION IN THE CLASSROOM\nusing a mass medium. But it is something you must do if you are going to be functional\nin terms of classroom broadcasting.\nIll\nEnough about the youngsters themselves. What about the teachers? They are part\nof our audience. They’re the ones who voluntarily decide to use your program, if you\nhave a democratic operation. If you haven't, they’ll ruin your program anyhow. If you\nforce them to take a program, all a teacher has to do is to look bored at the front of the\nroom or mark papers while the broadcast is on.and the youngsters will sense that. No\nscript writer is good enough, in my judgment, to overcome that. You must ’ sell the\nteachers too, or maybe first, so that the youngsters will get maximum benefit from tele¬\nvision.\nA basic decision you have to make, it seems to me, in terms of program structure\nis° do you want to use television to supplement what the teachers are doing, and that is\nvery desirable, and/or do you want to help them to do better that which they are doing,\nwhich is to teach? Consider a seemingly prosaic subject as a program on fractions.\nYou may have seen the fine film on the subject. If you could use that film on television,\nthere are certain values aside from the program that you must keep in mind. The\nteachers will sense immediately that you are helping them to do the job they're trying to\ndo. You have become an assistant and television is welcomed.\nIf all your programs are supplementary in nature, it may not be apparent to\nteachers that you are trying to help them. They may be less interested in using your\nprogram in the first place. Unless you can get them to realize that what is coming by\ntelevision is a help, they will not utilize it.\nWe went through that process in radio. I do not mean that we licked it, but if I\nmay, seemingly immodestly, I will call your attention to the use of WBOE programs.\nEstimating from control-room log sheets that we use in our central sound systems in\nthe high schools, forty to sixty percent of all of our high school classes that can take\n- 56 -"
}