{
  "id": "d1349-59",
  "text": "WILLIAM B. LEVENSON\nthe programs, use them. That is high in the secondary division because, as you know,\nyou have bell schedule problems to overcome. In the elementary schools, WBOE pro:-\ngrams run between eighty-five to one hundred percent. I believe that is good usage. A\nquantitative measurement, to be sure, but it is also a qualitative indication, for if this\nis not qualitative in terms of classroom needs, you probably do not have quantity of use.\nHow do you get wide-spread classroom utilization? I believe you need to have a balanced\nprogram structure. It has to be supplementary to the extent that you can show teachers\nyou are opening the doors of their classrooms and expanding horizons of knowledge.\nYet you must also have those programs that are so closely related to the teacher’s own\nday-to-day objectives, however prosaic, that they accept this television service as a\nfine contribution to their job. Unless you do that, classroom use of television will re¬\nmain limited.\nNow what are these values to the teacher? We will refer to our basic thesis.\nTeachers will not accept what you have to say about television unless they are disposed\nto believe what you tell them. Here you are selling—call it promoting, merchandising,\nuse fancy words and call it integration, it is all the same thing. You have to create a\ndisposition to believe that the service is valuable and that you will help them specific¬\nally in certain ways. For example, teachers often have a problem of meeting special\nday observances in the classrooms and you can help them that way. Here is a second\nillustration. Teachers in big cities are pressured too often with all kinds of contests\nand if you can help launch those and minimize the time lost from classroom work, then\nyou will be regarded not as a competitor for time, but rather as a time saver. That\nis sound psychologically and valuable educationally.\nTeachers will certainly accept the demonstration programs you may have. One\nof our proposed television programs is a period set aside specifically for demonstration\nof teaching methods to teachers on school time by outstanding teachers. Surgeons do it\nwith operations, in color. Why shouldn’t we, even in black and white? And we will,\n- 57 -"
}