{
  "id": "d1349-60",
  "text": "TELEVISION IN THE CLASSROOM\ncity-wide. These days with the shortage of teachers we are employing a great many sub¬\nstandard teachers. Probably some of these people should not be employed. In many com¬\nmunities they will have to be upgraded and this is one way of doing it. Those are some\ntelevision values that teachers will accept readily.\nThere will be some obvious advantages with the introduction of television. Unlike\nradio you have involved top level administrators in thinking about television. That is\nextremely important because as is natural, the teachers fall in line frequently with what\nthe men at the top believe. If the superintendents join in, as they have through the\nleadership of J. C„ E. T., in declaring that this is an opportunity for education, the teach¬\ners sense that. I do not mean that they follow blindly; however, they recognize that un¬\nless the leaders are behind them they will use television programs almost in clandestine\nfashion. If the whole administration is behind them, television programs will be used\nmore widely.\nOur teachers today recognize the values of mass media to a greater extent than\nthey did when radio appeared. They have been using visual aids and radio for some\ntime. They have a greater awareness now of the potential. Many of our people are\nyounger, obviously. They have grown up with radio. When classroom broadcasting\nappeared on the scene, most of our teachers had graduated from college before they\nheard the first commercial broadcast. It was difficult introducing radio as a teaching\naid. These new teachers lived withiradio, and you do not have to \"sell\" them television.\nYou will need to interpret to them how it can help them in their work, but they are aware\nof the potential and that will help immensely.\nThey have learned more about the use of these media because the use of film,\nradio, and television is about the same. Many have had audio-visual courses in college.\nSome of the states even require them for certification. They know that a good teacher\nmakes the best use of these aids as well and that a poor teacher can spoil the best pupil\n- 58 -"
}