{
  "id": "d1349-61",
  "text": "WILLIAM B„ LEVENSON\nexperience. More technically, too, we now possess a mass of available research that\ncan help us to analyze programming and measure results more effectively.\nIV\nThere are also disadvantages, however, that must be recognized. What may some\nteachers not like about television ? First of all, we are dealing with a conservative\nagency. Telling teachers about television, as stated before, isn’t enough. At the risk\nof exaggerating the negative, recognize their concern about cost. Remember that we\nare now in a period of inflation and their salaries never catch up. Couple that with ris¬\ning enrollments, with a shortage of housing, with a minimum of supplies, and a lot of\nthem begin to wonder.\nSome, very practically, will argue the question of receivers. They say we are\nconsidering group viewing. With radio we had portability. We could move the radio\naround quite easily. What about the portability of this television set? Are we claiming\nthere should be one in every room? Or are we going to move a group of children to\none room? Is that a learning situation? What about the central sound systems that we\nhave in our secondary schools? Is there a good central sight system, at a reasonable\nprice? Incidentally, the teachers are about the last ones to get television at home, not\nnecessarily because they do not have enough money, rather they have many other\ninterests. Thus frequently you will talk television to them and some do not know what\nyou are talking about.\nTeachers know, too, that the same limitations that handicap radio in the classroom\nalso limit television—the bell schedule, the need for presenting the program at about\nthe time the teacher is discussing the topic, course of study requirements, etc.\nOne can debate with the recalcitrant teacher that the important thing is not when\nthe experience takes place, but rather is it a good experience? Teachers in big city\nschool systems know there is the pressure of a crowded curriculum, examinations, etc.\nThey do have calendar dates to meet, and we must be aware of the realistic factors\n- 59 -"
}