{
  "id": "d1349-62",
  "text": "TELEVISION IN THE CLASSROOM\nwhich confront them. If one states we will repeat television programs, they question, why\ndon’t we use more films? And they will ask what is it that a good sound motion picture\nfilm cannot do that television can do better ?\nI believe one reason they have not used films more is, in the first place, because\neighty percent of our school faculties are composed of women. They are not mechanically\ninclined, if one can generalize, and they do not like to thread the projector, they are\nafraid they will tear the film and have to pay for it, etc. In spite of all the workshops and\nall the utilization classes we have, one goes into a school and asks how many can thread\na projector-one or two hands go up. You might argue that is enough. A skillful principal\nwill make use of that person to do all the work. Yes, a skillful one will. But there has to\nbe more than ordinate interest to get that done. The contribution of television, in this\nregard it seems to me, is its ease of distribution.\nAnother argument some teachers use against film is that there are fine films but\n\"we can't get them when we want them.\" That is another contribution that television can\nmake. We can more readily reach the time of optimum use because we broadcast the\nfilm en masse.\nSome teachers will say too many films are not functional, they don’t meet ihe\npurpose they have in mind. Too many films may deal with the Land of Liberty, with\nclips from the Coveredmgon and that kind of thing. Fine. But that’s not enough. The\nteacher is teaching fractions. Help her with that. At long last that type of film is\navailable. Television would be making a great mistake if it did not think in terms of\nsimilar audience needs.\nAs with films, teachers have to feel that the television programs are based on\nclassroom needs, and so we must involve them in participation. Long before the script\nis written, they can participate in discussions of what television can do and what it\ncan't do. Where in the course of study would you like to be helped by television .\nThere are some things that can be done better in the classroom. There are some things\n- 60 -"
}