{
  "id": "d1349-65",
  "text": "DALE B. HARRIS\noccurring in time, then we can make an impact on him that is either temporary or last¬\ning; but we are most interested in behavior influences which permanently affect the\nfuture course of his development. Unfortunately, some of what we call education has\nlittle permanent effect in this sense. If we are interested in behavior changes that are\nreasonably permanent, a lot of what we call \"education\" is not education; and a lot of what\nwe consider incidental or trivial is_educational, because it does effect behavior\npermanently. Many things happen out of school which are truly educational in this sense;\nwe must accept that! There is evidence that so-called entertainment media have a deep\nand lasting influence on children’s learning of facts, skills, and attitudes! *\nI\nWhat are some of the principles of child development which should concern edu¬\ncational telecasters? First, this medium—which combines vision and audition, and\nwhich portrays happenings directly and dramatically rather than indirectly or symbolic¬\nally—has a tremendous impact on children in plastic stages of development, an impact\nwhich certainly has permanent effect on behavior. The younger the child the more\nimportant is sensory experience to him—odors, visual patterns, sounds. Why is this?\nThe very young child has not developed an elaborate symbol system, a set of words,\nideas or concepts which are abstract. He deals in terms of immediate experience, and\nthe content of his immediate experience is made up of sensory impressions. These\nsense impressions have a stronger emotional significance than they have later on as he\nacquires ability for building abstract ideas and concepts. The young child also lacks a\nbackground of general experience in terms of which to interpret his immediate sensory\nexperience. The symbolic system which growing abilities and increasing background of\nexperience make possible for the child, overlays the substratum of emotional meaning\n* Holaday, P. W. and Stoddard, G. D., Getting Ideas from the Movies. New York:\nMacMillan, 1933.\n- 63 -"
}