{
  "id": "d1349-66",
  "text": "TELEVISION FOR CHILDREN AT HOME\nof direct sensory experience. However, we never lose the substratum. Thus, the audio¬\nvisual medium continues to have educational significance for adults. But for young child¬\nren it is inherently an exciting, dramatic, appealing, and influential medium.\nA second principle is that the real and personal—those experiences that duplicate\nin part the youngster’s own experience—have a particular fascination for him. While\nthis is true particularly of younger children, it is also true for adolescents and adults.\nIn many surveys of interests of children, we find that the so-called educational features\nwhich introduce much new material rank low on the interest scale, whereas those which\nintroduce only a little new material in the context of familiar items rank higher on the\ninterest scale. The adolescent may have more interest iii sheer drama and emotional\nexcitement than does the young child, but the adolescent, too, is most interested in\nprograms which deal with people, places, and problems which he has met or experienced.\nThus, to obtain an interested child audience, you must find certain anchor points for their\ninterest. Here are some such anchor points of interest.\nAge. Some characters should be of the same age as the group for which the pro¬\ngram is broadcast to obtain maximum interest.\nSex. Despite their fascination with the opposite sex, even adolescents are strongly\ninterested in actors of their own sex.\nExperiences known and understood by children. This point is often over-looked in\nprogramming. You may well ask: ’’Why should a child be interested in ordinary, every¬\nday things? Let’s give him something new!” Actually, he will not be as much interested\nin the entirely new as in something containing familiar elements. In order to have learn¬\ning take place at all, one must have attention and interest. If the youngster is not\ninterested, he is not learning, no matter how many new and desirable experiences he is\nbeing introduced to. He must participate psychologically in the experience providedhim.\nHence, include some familiar activities. The more intellectually mature child is more\nable to find parallel elements in his own experience, but he never quite escapes the\n- 64 -"
}