{
  "id": "d1349-67",
  "text": "DALE B. HARRIS\nneed for the familiar to bridge the gap to the new. So, educationally, let's introduce new\nelements and new ideas into a context that is familiar.\nFamiliar activity presented in an unfamiliar setting. A variation of this anchor\npoint is the portrayal of familiar values in people who are new to the child—people un¬\nfamiliar in dress or appearance but who are kind and helpful, or engaged in activities\nthe child knows well. An application of this point which must be handled carefully in this\nday of great concern about human relations, is to tap the child's own identifications with\ncultural or ethnic groups. If wisely and carefully done, a script writer might refer to a\nparticular group's origins, or he might appeal to interest in a group's own nationality\nand ethnic cultural backgrounds.\nThere is a television program up our way—Jimmy Valentine's children's program\non KSTP-TV—which interests me very much. By some educational standards you might\nsay this is pretty poor, but the children love it. Why? Jimmy has children on his pro¬\ngram, he talks with them, asks them riddles, and lets himself get stumped. Jimmy\nValentine has six young children of his own. He knows children and how to handle them,\nwith the result that when he puts on a television program, he becomes involved in such\na way as to hold a child audience in living rooms all over the city.\nMany television offerings, like the movies and radio, have to do with emotion or\nemotion-evoking situations, such as conflicts which must be solved. The appeal of such\nprograms for adults is well known. Adolescents, too, are intensely interested in people\nwho get into trouble, get all mixed up, and have difficulties solving their problems.\nMore than younger children, adolescents have experienced complex social and emotional\nproblems. People help them less than they do young children; they expect them to be\n\"grown up.\" Adolescents are also becoming aware of new interests in the opposite sex,\nin courtship activities and in such preliminaries to them as dating, what to talk about,\nand the propriety of kissing. The adolescent wants to be successful in his quest for a\nnew role. He won’t ask adults a lot about the characteristics of adolescence. He needs\n- 65 -"
}