{
  "id": "d1349-68",
  "text": "TELEVISION FOR CHILDREN AT HOME\nto be independent. In a society that doesn’t define his role very clearly, the adolescent\nmust do quite a bit of uncertain questing for roles and manners which will enable him to\ncross into adult life.\nAccording to the Payne Fund studies* the adolescent goes to entertainment media\nthe movies and television, and particularly to dramatic shows involving relationships be¬\ntween the sexes—to get a model of how he should act in his overtures to the opposite sex\nin the activities that will lead him into courtship and eventually marriage. So the\nentertainment medium becomes really a school for social experience.\nII\nOur third principle is this; if you try to capture interest with problem solving\nsituations or highly charged emotional situations, the younger the child, the simpler\nmust the problem be. The adolescent can handle complex problems involving social\nrelations which a younger child could not. For a child of nine or ten, you could portray\nchum relationships, a quarrel, or a problem of conduct involving a teacher or parent—\nbut keep the problem fairly simple. But an older child will want more complicated pro¬\nblems involving a greater variety of issues.\nWhen we pose problems for children, we should take care that they are realistic\nfor the intended age group, and that we offer some sort of solution. The younger child\nis not as capable as the older child of handling problems which are unresolved by the\nprogram. For example, morality for the younger child is much more a matter of black\nand white than it is for the older child. With the older child, one can pose a question\nand let him answer it. The younger child has some capacity for problem solving, but\nneeds more help by suggested solutions. He will be emotionally involved in any problem\npresented; but he does not have the capacity and experience for bringing it to solution.\nHe is more likely to worry about it, to be concerned and involved with it.\n* Blumer, H. , Movies and~Conduct. New York: MacMillan, 1933.\n- 66 -"
}