{
  "id": "d1349-69",
  "text": "DALE B„ HARRIS\nThe fourth principle, that reiterated ejq>eriences impress the child mind more deep¬\nly than isolated experiences, recalls the old law of frequency in the psychology of learn¬\ning. We have come through a period of twenty or thirty years of child study during which\nwe have emphasized the importance of the single dramatic or traumatic happening or\nevent which changed a child’s life. Modern child development studies are making us more\naware of the repetitive character of many of the experiences of childhood. Without in the\nleast denying the impact of highly emotional, single experiences, we are once more com¬\ning to recognize the cumulative effect of reenforcement learning.\nProfessor Roger Barker at the University of Kansas has been charting typical days,\nepisode by episode, for a sample of small town children. He is finding that learning situ¬\nations occur literally by the hundreds in each waking day for each child. He also reports\nthat specific episodes occurring hundreds of times in the life of one child may hardly\never enter into the experience of another. Small wonder then that attitudes take form\nearly and differ so much among children.\nI suspect that if we made content analyses of television programs as has been done I\nfor movies, we would find simple themes handled over and over again. The youngster\ngets a cumulation of impressions—a build-up far beyond anything we ever give him in\nschool. Many of the ideas, dramatic themes and types of emotional stimulation used in\ntelevision presentations appear over and over again. The impact of this repetitive experi¬\nence needs considerably more study than it has received. While the significance may\nvary from child to child, the over-all effect must be pretty important in shaping and\nperhaps \"standardizing\" children’s ideas, attitudes and values, particularly since so\nmany children are exposed through television to the same material.\nSince it is clear that entertainment devices have a marked educational impact, we\nmust be careful to make our materials factually accurate. We also have to make them\naccurate i:n emphasis. Do we portray something which is in truth unusual and unlikely,\nas something usual and typical? This is the old problem of propaganda emphasis. For\n- 67 -"
}