{
  "id": "d1349-7",
  "text": "HAROLD Do LASS WELL\nunifies the response of the community to the environmental challenge. The pedagogical\nfunction is to transmit the experience of the past to the next generation. Note that point A\nis outside the circle, which indicates the usual habitat of the community. The line from\nA to B stands for a message that originates with an outside observer of the environment.\nHe sends it back to someone inside the community. If B stands for a news or radio desk\na great many messages come streaming in and are relayed in various forms to the next\naudience, which often is a large one. The circuits are indicated by the line from B to C,\nwhich may represent broadcasts to listening or viewing audiences. The arrows on the\nline that connects B and C point both ways, suggesting that messages are moving from C\nto B as well as from B to C. The counter-movement is part of the total mobilization of\nthe community toward the information received about the environment. People talk to\none another, and initiate or support various policies toward the situation. The communi¬\ncation line from B to D shows the part of community response that takes the form of\ninstructions to D to sign or not to sign an agreement, for instance. The line from C to\nE stands for the pedagogical function. Some members of the community specialize in\ntransmitting current lore to youngsters or strangers, or in renovating the skill of adults.\nWe may let the diagram stand for a single living organism, in which case the in¬\ncoming messages are those which are supplied by specialized sensory organs, like the\neye or the ear. These agencies survey the environment in order to detect whatever\nconcerns the value position of the animal. The flow of messages to and from the\ncomponent parts of the organism are the acts of correlation in the course of which the\nanimal prepares to respond to the environment, whether by standing fast, reaching for\nfood, seeking to destroy an enemy, or fleeing from an overwhelming menace.\nThe social insects and the animals that move in flocks and herds reveal similar\nspecializations. Some animals post sentinels at short distances from the herd to sig¬\nnal when something suspicious occurs. The mobilization of the flock or the herd may\n- 5 -"
}