{
  "id": "d1349-70",
  "text": "TELEVISION FOR CHILDREN AT HOME\nexample, the Russians pick up lynching as an aspect of race relations in America, and\npresent as a common everyday occurrence something that rarely occurs. This is a dis¬\ntortion of emphasis. We have to be careful in programming for children lest we distort\ntoo.\nIn addition to supplying sensory experience in a dramatic and emotional way, the\naudio-visual medium also makes an important contribution to the child’s interpretation\nof his world. Television, movies and radio supply the child with content for imagination.\n\"Imagination” is the term we apply to the psychological process by which a child puts to¬\ngether elements of his experience in new ways, recombines things, and works out ideas.\nIn a sense imagination, like thinking, is a tool in problem solving, though it is not as\nsystematic or controlled a process as thinking. A child’s play is by this token part of\nhis imaginary life. Through play, the child experiments with materials, ideas, social\nroles and adds to his learning. We are well aware from extensive studies how children’s\nplay incorporates elements from the movies and radio, and current experience indicates\nthat this is just as true of television.\nThe role of imagination in the social behavior of adolescents has already been\nsuggested. The adolescent, identified with the hero or heroine, lives vicariously the\nexperiences of that person and thus explores possible modes of conduct for himself.\nAdolescents will frequently admit that in their social relationships, and in their \"amours,\nthey actually try out techniques they have observed. If the techniques don’t work, they\nare dropped. If they do work, they are retained.\nThe fantasy life of a child has another important function. It helps him come to\nterms with the impossible in his environment. A child wants to do something very badly\nbut is forbidden to do it. In his imagination he can punish the limiting adult and enjoy the\nactivities he would like to get into. This offers him a kind of emotional release or escape\nfrom the impossible aspects of this situation. Fantasy as a form of imagination has an\nimportant psychological escape function, then; but it can get out of hand. Ordinarily we\n- 68 -"
}