{
  "id": "d1349-71",
  "text": "DALE B0 HARRIS\nsay daydreaming is bad when it keeps a person from coming to grips with his problems.\nBut there are some intolerable situations which a child must daydream about if he is to\npreserve his psychological integrity.\nIll\nAnother principle is that the content and development of a child’s behavior is, in\npart, dependent op the level of his maturity and development. A child’s needs change\nwith age. Take, for example, the eight to twelve year group which is characterized by\nthe need for excitement, suspense, thrills and danger. Children do not actually require\npersonal danger, but they seem to seek the emotional thrill provided by reading about or\nseeing dangerous and exciting episodes portrayed. That is why the Western movie makes\nsuch a strong appeal to this age group. However, we find that around puberty a new\ninterest builds up—the erotic interest with psychological involvement in love-making\nscenes. Ask fourth graders what are the funniest things adults do and you will find that\nhigh on the list is kissing. But for sixteen year olds kissing has quite a different psycho¬\nlogical meaning.\nThe Dysinger and Ruc&mick studies* dealt with the physiological aspects of\nchildren’s emotional responsiveness to movies. Physiological reactivity to suspense and\ndramatic episodes builds up to a peak about eleven or twelve—and then begins to fall off.\nReaction to kissing scenes begins to build up around eleven or twelve, and reaches a\npeak at around sixteen or seventeen. There is a basic psychological involvement behind\nthe child’s changes of interest. This change occurs in part simply because the child\ngrows up—he is becoming a different organism through developmental processes. While\nthis isn’t true of all specific interests, it is true of the broad areas of interest discussed\nhere. When parents get upset by the child's insatiable appetite for television Westerns\n* Dysinger, W. S. and Ruckmick, C. A., The Emotional Responses of Children to the\nMotion Picture Situation. New York: MacMillan, 1933.\n- 69 -"
}