{
  "id": "d1349-72",
  "text": "TELEVISION FOR CHILDREN AT HOME\none can say that he will \"grow out of it,\" and be correct nine times out of ten. Other\ninterests will develop as he becomes a more mature organism.\nThere is another reason why this principle of age-relatedness of interests and experi¬\nence should be of concern to educational television specialists. It is very difficult for adults\nto project themselves into children’s interests, and-sitting in an armchair—to devise the\nkinds of programs that will really appeal to them. You and I can say, \"This ought to be\ninteresting to children.\" The chances are we will miss rather badly, unless we are very\nunusual adults or have done much observing of children. We lose touch with the develop¬\nmental character of our own earlier psychology. Research evidence shows that there is\nlittle correlation between what children say they like and what adults think they will like.\nWhile adult preference isn't a sure indication of child preference, adult conceptions of\nwhat a child ought to like are apt to be further off than selections made in terms of the\nadult’s own interests.\nFurthermore, what children want to see is more likely to affect what adults will\nview than vice versa. The influence goes up rather than down the age scale, according to\none study of movie choices. *\nEducators know, for example, that they can Influence parents by teaching children.\nTeach a girl the elements of furniture arrangement in high school and you may get a re¬\naction of distress from her mother! The girl goes home and tells her mother how things\nought to be done.\nIf this influence of children upon adults is quite pervasive, we simply must study\nchildren more than we have. If we cannot capture out of our own recollection of child¬\nhood adequate cues to what will interest children, then we must observe children directly.\nAdults can readily become sensitive observers of children. As they do so, they can\n* Fearing, F., 'Tnfluettce~of the Movies on Attitudes and Behavior.\" Annals-Of_the\nAmerican Academy of Political and Social_Science 1947, Vol. 254, pp. 70-79.\n- 70 -"
}