{
  "id": "d1349-73",
  "text": "DALE B. HARRIS\nrecapture more adequately the values of childhood than by sitting at a desk in a\nprogramming office and laying out what ought to be interesting to children. I plead as\nstrongly as I can that you and your staff go out and do some straight observing of child¬\nren, at school, at play, anywhere. Get acquainted with children first hand!\nIV\nWhat about the supposed harmful effects of television? I’m sure that educational\ntelecasters are not going to develop programs that will have deleterious effects, but they\nwill possibly meet parents who are concerned over this problem. We are a society in\nrapid change. Values are shifting. I suspect that the mass media of communication are\nmore likely to reflect a great variety of social and ethical values than we realize. While\nthis is upsetting to adults, it is not necessarily bad for youngsters. Not long ago I\nhappened to hear a conversation between two eleven year old girls. They were discuss¬\ning in a very mature way a romantic problem presented on television, with much under¬\nstanding of the implications of what they had seen. I am quite sure that would not have\nbeen true twenty or thirty years ago of children with a similar social background, because\ntelevision did not then exist, and they would not have been permitted to go to the movies\nwhere they might have seen such a problem. Furthermore, newspapers would not then\nhave carried references to sex behavior as they do now.\nA medium which portrays a variety of values also brings to children an awareness\nof conflicts in values. I would not argue for censorship of the medium because it might\npresent conflicting values to child audiences. Children do not inevitably acquire the poor¬\nest values and tastes from what they experience. Teachers and parents may need to\nhandle more wisely than in an earlier day the conflicts children face in a world in rapid\nchange. They can do so more readily through recognizing these conflicts than in trying\nto isolate children from them. It is a truism of child development that children learn to\nmake good choices by making choices. It also appears to be true that what children take\nout of experience bears some relationship to the standards they bring to that experience.\n- 71 -"
}