{
  "id": "d1349-74",
  "text": "TELEVISION FOR CHILDREN AT HOME\nAs there are many standards and experimental backgrounds, so there is no uniform impact\nof new experience on people,,\nChildren learn to make good choices by a cumulative process, each child gaining\nfrom a new experience in relation to and in a sense congruent with what he has already\nlearned. If children have the basis for good taste and have developed good principles for\nselection, they tend to absorb from new eiqperience the desirable aspects of that experi¬\nence. If they come with inadequate basis for judgment, they of course cannot make desir¬\nable choices. One may change that, however, by giving children a variety of experiences\nin order to build a basis on which the elements of good taste may be founded, taking care\nto reinforce desirable choices early in the process. There is some evidence that in early\nadolescence the ability to discriminate more aesthetic from less aesthetic materials does\ndeteriorate. But there is also evidence to show that it tends to return in later adolescence.\nThus, there is very real reason not to become unduly alarmed at the apparent lack of\ntaste in children ten or twelve to sixteen or so years of age.\nWhat is the relationship of television \"addiction” to personality adjustment, or good\nmental health? Some people are quite disturbed because many delinquent children are\nfrequent movie-goers, or comic book or television addicts. The presumption is that\naddiction to the medium results in too much emotional stimulation, and hence contributes\nto their behavior difficulties. It may well be just the opposite! Children who are making\nan inadequate emotional adjustment may completely immerse themselves in these media\nas a form of escape. Suppose we took away all comic books from a child who is a comic\nbook addict. He probably would immerse himself in something else. It isn’t the question\nof the bad literature making him bad; it is rather that, his own development being in¬\nadequate, his involvement with a series of tough emotional problems leads him to over-\nimmersion in an exciting, distracting medium,\nI have been personally most concerned over another feature of television, relating\nto the possible modification of the child’s interest patterns. What effect does twenty-\n- 72 -"
}