{
  "id": "d1349-75",
  "text": "DALE B. HARRIS\neight hours of television viewing a week have on a child’s other activities? After all, that\namounts to four hours a day when he could be doing something else. Results of two differ¬\nent studies* show that the average time per week spent with television by children with\naccess to sets, drops from about twenty-four hours at age nine to fourteen hours at age\neighteen. Boys view consistently more than girls, although the difference is not great at\nany age. The Lehman and Witty studies of play interests of children ** show a similar age\nrelationship. The number of different activities engaged in per week drops steadily from\nnine to eighteen years. As children grow older, they tend to become more selective and\nto concentrate on things of more value to them. Presumably the period of childhood\nexploration of many activities enables the adolescent to be more adequately selective\nconcerning the activities on which he concentrates.\nBut childhood, we find, is the period of greatest concentration of television. This\nconcentration may work to exclude the exploration of other interests and activities.\nCertainly one reason for this is the newness of the medium; it is clear that the second and\nthird year a family has a set, both adults and children spend less time with it than during\nthe first year. I believe that as television becomes a part of the child’s experience he\nwill put it in its place along with other things. Probably the impact on his interests is\nnot as serious as it is sometimes thought to be. Certainly the child who can be encouraged\nto develop a balanced program of activities and interests will not be unduly limited by tele¬\nvision.\n* Lewis» P., \"TV’s Impact on Teen-agers.” Phi Delta Kappan, Nov., 1951, pp. 118-121;\nInstitute of Child Welfare, University of Minnesota, unpublished survey.\n** Lehman, H. C. and Witty, P. A., The Psychology of Play Activities. New York:\nA. S. Barnes, 1927.\n-73 -"
}