{
  "id": "d1349-80",
  "text": "I. THE social role and significance of the educational television station\nCOMMITTEE REPORTS\n\"Promote, then, as an object of primary importance, institutions for the\ngeneral diffusion of knowledge. In proportion as the structure of a govern¬\nment gives force to public opinion, it is essential that public opinion should\nbe enlightened.\" — George Washington.\nCommunication remains man’s supreme achievement. His progress depends upon\nhis ability to transfer to others what he has seen, thought and believed -- and all this\ndepends upon his effective use of the means and instruments of communication.\nWith its combination of sight and sound, television is the most powerful communi¬\ncations instrument in existence for strengthening a common image of the values of\nAmerican free society. Therefore the educational television station has an important\nresponsibility in the task of assuring maximum progress for all men and of helping\ndevelop the well-informed and responsible citizenry so necessary for the security of\nour free society. Established primarily to disseminate information, increase the range\nof cultural choices, and promote free and critical inquiry into problems of general\npublic concern, the educational television station should make its facilities available, so\nfar as practicable, to any agency or individual having a contribution to make to the\npublic interest and welfare.\nFreedom of choice in the communications process is essential to a free society.\nIn order to make considered judgments on matters of public policy, citizens must have\naccess to a stream of intelligence on local, national and international affairs, as well\nas objective interpretation of their meaning and significance. The educational station is\nin the advantageous position of being able to draw heavily upon school, college, univer¬\nsity and community resources in developing programs to serve these objectives. It\nshould become, then, for reasons of both integrity and competence, a preferred source\nof information for those entrusted with making important decisions for the community.\nThe educational television station should be a community station rather than the\noutlet for a single institution or group of schools and public service organizations. But\n- 78 -"
}