{
  "id": "d1349-81",
  "text": "SOCIAL ROLE\nthis concept does not preclude its addressing special interest groups which at times may\nbe very small in number; often the general welfare can best be served by broadcasting to\na small group on the community’s behalf. A television program intended to appeal to the\nuniversal audience must be based upon interests common to everyone — and such\ninterests are rare indeed. But the universal audience includes a diversity of smaller\npublics distinguished by interests and needs which are less than universal. Many elements\ntend to limit the universal audience:; there are such personal factors as age, sex, edu¬\ncational background, occupation, economic status and place of residence; and there are\nsuch program factors as subject, format, and level of difficulty. One of the great\nassignments of the educational broadcaster is to render service to these special publics\nwhich, for the most part, are not otherwise served.\nFor education the development of this new medium of communication is of crucial\nsignificance. The educational television station can present high quality learning experi¬\nences to viewers of all age levels. It can enrich, enliven and extend existing educational\nservices. It can serve children in and out of school. It also can provide continuing learn¬\ning opportunities for adults at home. Television is to the public lecture or appearance\nwhat the printed book was to the manuscript. The number of persons who can see and hear\nan individual speaker or demonstration has achieved a new order of magnitude. Further¬\nmore, the singular flexibility of the camera and its capacity for detailed and direct\nobservation give television a qualitative as well as quantitative advantage over all other\nmedia.\nThe spirit of the educational television station in operation should be one of\nenthusiasm and confidence about our world. It should be prepared to help people under¬\nstand where they have been, where they are now, how they got where they are, andwhere\nthey are going. It should point out to viewers what might have been, as well as what is.\nIt must be inventive, expressive and creative rather than routine in programming, ready\n- 79 -"
}