{
  "id": "d1349-83",
  "text": "TELEVISION AND OTHER MEDIA\nintegral parts of new programs. Television not only utilizes this existing footage but\nrequires the creation of new film material to meet specific needs. Films of remote loca¬\ntions enlarge the scope of studio presentations. Time-lapse photography, stop-motion,\nphotomicography and other unique recordings are available to television only on film.\nThe basic techniques of the film medium, developed during the past half-century\nin the attempt to record successive moving images, are used in television: camera shots,\nshot continuity, story lines, editing and laboratory procedures. These and many more\nform the basis for techniques already modified and adapted to the new physical facilities\nand equipment of television.\nTelevision is responsible for a new form of film — the kinescope. This important\ndevelopment enables the medium to retain material in permanent form for record, re¬\nsearch and distribution, not only to television stations, but to film libraries throughout\nthe world. Films and kinescopes make it possible to develop a central library resource\nfor the interchange of television materials.\nTelevision therefore relies heavily upon the medium of motion pictures in achiev ¬\ning its unique potentialities. Both television and motion pictures will continue to serve\nimportant and separate communication functions, and each will draw from the other in\nits continuing development.\nTelevision has a different relationship to radio than to motion pictures. Radio\nprograms as such cannot be transmitted as television programs, because in television\nthe broadcast of sound is completely integrated with visual images. But in the develop¬\nment of television programming and transmission there has been and will continue to be\ndependence upon the personnel, experience and traditions of radio broadcasting. Some\neducational television programs will derive from successful educational radio program\nformats. But with the addition of sight, opportunity is provided for the presentation of\neducational content unsuitable as radio material.\n- 81 -"
}