{
  "id": "d1349-84",
  "text": "COMMITTEE REPORTS\nThis does not mean that radio is obsolete as a means for educational communi¬\ncation. Radio did not replace the printed word; and it is unlikely that television will dis¬\nplace either press or radio. Rather television is a powerful new tool. Its use may\nmodify the educational applications of radio and also may affect the size and nature of the\nradio audience; but for practical reasons there will continue to be listeners for edu¬\ncational radio programs. Some people like radio better than television. Others prefer\ncertain kinds of programs on radio. Some people live beyond the range of television\nstations, or else do not have ready access to television receivers. Most people with\naccess to all forms of communication will not use any one of them exclusively. In\npractice each medium will reinforce the others: newspapers, books and magazines will\nbe read; radios will be heard; and there still will be time for television viewing.\nFortunately all these media are available to the educator, and all should be used\nif the maximum audience is to be reached effectively. The recent experience of the\nNAEB with The Jeffersonian Heritage illustrates how multiple media may be used in\ncommunicating the same material. This series first was broadcast by tape recordings\nover a hundred or more radio stations. It now is available on phonograph records for\nuse in homes and schools or over radio. Recently the scripts were published in book\nform. One of the original radio broadcasts has been experimentally recreated as a tele¬\nvision program. This telecast was kinescope recorded so that it could be rebroadcast\nby other television stations or shown to groups of people as a motion picture. Surely the\nprojection of The Jeffersonian Heritage through all these media was far more effective\nthan would have been presentation through only one of them.\nIll EDUCATIONAL TELEVISION SERVICE TO THE ADULT POPULATION\nA considerable portion of the broadcast time of educational television stations will\nbe devoted to programs for the adult public. There are some seventy-five million or\nmore adults whose educational needs and interests — if they could be determined —\nmight be met through well-conceived telecasts. From an observation of the social and\n- 82 -"
}