{
  "id": "d1349-85",
  "text": "PROGRAMS FOR ADULTS\nintellectual habits of adult human beings and from the experience of school people in the\npast, we believe there is a place for educational communication on the adult level in each\nof the following areas; health improvement; economic welfare; cultural growth; citizen¬\nship and world understanding; social adjustment; moral and spiritual development; and\ngeneral educational advancement.\nPrograms for adults might fall into one of these two categories;\n-QTS_^nize<3 Courses of Study. Recommended here are orderly sequences of\nprograms, perhaps with accompanying study guides. In some cases these courses might\nbe certificated or accredited by training agencies, schools or colleges. In addition to\nbroadcasts on regular school subjects, telecast units could be prepared to increase\noccupational proficiency, develop useful skills, and provide citizenship training.\nCertainly mathematics, languages, and ceramics could readily be taught in this way.\nPresent experience with the types and kinds of courses effective on television is\nextensive enough to suggest an almost unlimited field.\n2• General Informational and Cultural Programs. Programs that do not consti¬\ntute courses of study or training but are nevertheless informational would be useful for\nthe adult audience. There could be news analyses, travelogues and descriptions of\nindustrial processes, as well as \"how to make it\" and other hobby shows. Their\npurpose could still be educational in the broad sense; and to prevent a haphazard and\nvalueless miscellany, programs with related subject matter or similar aims could be\nconnected in series. Here too the variety of topics is enormous, since anything that\nstimulated intellectual curiosity or made life more meaningful would constitute suitable\ntelevision material.\nPrograms in the arts, too, are well adapted to television, since each provides\nentertainment along with cultural benefits difficult to define although generally recog¬\nnized. Television has proved to be highly successful in bringing all the arts directly\ninto the homes of viewers.\n- 83 -"
}