{
  "id": "d1349-87",
  "text": "PROGRAMS FOR CHILDREN\nGood in-school telecasts may accomplish many purposes. They may provide a new\nmeans for teacher up-grading through furnishing examples of excellent teachers at work.\nSuperior teaching also should prove inspirational to pupils. The distinguished visitor or\nexpert may appear simultaneously in hundreds of schools, and scientific experiments or\ndemonstrations from a well equipped laboratory may be presented to pupils in schools\nlacking such facilities. In addition, kinescopes of outstanding educational telecasts and\nfilms from many parts of the world may be viewed in the local classroom with no more\neffort than the tuning of a television set.\nB. Telecasts for Out-of-School Hours. Educational telecasters should also pro¬\nvide children’s programs for out-of-school viewing. There of course will be intense\ncompetition for viewer attention after school hours, since that is the time for play, for\nprivate lessons, and for clubs and other activities. Furthermore, commercial stations\nschedule children’s programs with high audience appeal during these periods. The edu¬\ncational station's after-school broadcasts, therefore; must be interesting and appealing,\nor they will have few viewers. Educational television must meet this challenge by\noffering imaginative educational programs with a high level of audience appeal.\nTelecasts for out-of-school viewing probably will be less formal than those design¬\ned for in-school use and may appeal to a wider variety of interests. We should examine\nchildren’s needs in order to plan programs which will intensify old interests and develop\nnew ones. Some of these programs, for example, might deal with \"how to do\" and \"what\nto do\" techniques, involve creative participation in art and music, promote wholesome\npersonal relationships, and highlight \"good\" stories.\nC‘ Telecasts for Young People Outside the Formal Influence of the School. While\neducators are primarily concerned with young citizens in school, other young Americans\nalso look to them for help. The pre-school child and his parents should be prepared for\nfuture school experiences. In America, where only one out of two pupils completes the\nsecondary school, the problem of the \"drop-out\" must be considered. Help also should\n- 85 -"
}