{
  "id": "d1349-89",
  "text": "v* RESOURCES FOR EDUCATIONAL TELEVISION\nIn planning its program services a station should first examine the nature and deter¬\nmine the needs and interests of its audience. Then, using its own professional stqff and\nsuch other qualified contributors as may be available, it must develop programs utilizing\nall the resources at hand, at the same time building its audience in every way possible.\nA° A^.^igJce_Resources. Many people are eagerly awaiting educational television,\nconfident that their needs will be fully satisfied only when present commercial offerings\nare supplemented by programs from educational stations. These people — the unsatis¬\nfied customers and those who will turn to educational stations for additional enjoyment\nand education constitute one of educational television’s greatest resources and biggest\nchallenges.\nThis potential audience includes such groups as the aged, whose numbers are\nsteadily increasing and whose special needs suggest many program possibilities. It\nincludes children, both in and out of school, whose educational needs have multiplied\nmuch faster than they have been met. It also includes an eager-to-learn and receptive\nadult audience which desires participation in the process of educational communication.\nThe educational telecaster must study this audience before he can serve it effective¬\nly. Only through systematic research can he determine what to broadcast, and then\nsubsequently measure his achievement. His program of continuous research should seek\nto learn everything there is to know about an audiences what it likes and dislikes; the\nnature of its hopes, dreams and fears; and its program standards and values. In develop¬\ning research activities, educational television must go outside itself to tap the resources\nof psychology, sociology and the other social sciences.\nBut if this audience is to be more than just a potential, the educational station must\nattract it through a process of systematic audience development. Viewers will not be¬\ncome loyal to educational television as the result of good programming alone. They must\nconstantly be told when educational programs are available and how those programs will\nserve their needs. This may be done in such ways as promotion through other media,\n- 87 -"
}