{
  "id": "d1349-9",
  "text": "HAROLD D. LASSWELL\nThe first question concerning \"Who\" asks for the significant characteristics of\npeople with a controlling influence over the communications of a given community through\na specified period. In answering it is important to choose the characteristics which have\nan impact on what is selected for dissemination. For instance, who are the educational\nbroadcasters and telecasters? We can think of a number of traits likely to affect what\nthey put into programs. If they have been teachers they may be interested in particular\nkinds of educational courses. Now that Professor Lloyd Warner and his associates have\nmade everybody conscious about class, we also ask whether the educational communi¬\ncators are upper, middle or lower class, and how this is likely to influence their taste\nand sense of responsibility for public service. We ask about individual affiliations, tak¬\ning note of religious, fraternal and related connections. There are, of course, person¬\nality factors. Some communicators border on agitational activities, unless they have the\ngift to be agitated by noncontroversial matters. They sometimes sense that if they get\nexcited about aesthetics rather than foreign politics their days may be longer in the land.\nOr they may get inspired by gadgets, which are less controversial than social legislation.\nUp to this point we have been talking about the educational broadcasters as though\nthey ran the facilities. A more comprehensive analysis calls for a study of who provides\nthe money (with what expectations), who appoints whom, who is likely to fire whom under\nwhat circumstances, and the like. No one needs to be told that if educational communi¬\ncation is to succeed, it must have the sponsorship of control boards of respected citizens\nwho are genuinely devoted to the ideal values of American life and determined to imple¬\nment them as fully as practicable.\nThe question of \"what\" calls for an examination of the content of programs. We\nshall not have time to develop this point, but it is worth calling attention to the fact that\nsome of the most important content may not be planned. The image of the scholar and\nthe social scientist may be very distorted, for example, as a result of unconscious\nfactors in program and personnel selection. It is easy to have all ’’talk\" sessions in\n- 7 -"
}