{
  "id": "d1349-91",
  "text": "EDUCATIONAL TELEVISION RESOURCES\nand procedure. The station on its part should deal with organizations of related interests\nand resources in groups rather than individually. For example, when preparing pro¬\ngrams for women, a station should not work separately with each women's organization,\nbut should bring them all together so that the resources of each may be drawn upon as\nneeded and integrated into one carefully planned series. If possible, cooperating organi¬\nzations should contribute financially to the station's activities. This might take the form\nof cash contributions or of supplying special equipment not otherwise available. Careful\nrecords should be kept by all participating groups so that future program planners will\nhave access to data on man hours and costs.\nA series of workshops, ranging in complexity from simple talks to experimental\nlaboratory sessions might precede community cooperative program planning. Organi¬\nzation leaders would thus be brought face to face with practical television problems in\nterms of scripts, sets., props, lights, rehearsals and program types under the tutelage\nof professional television educators „\n• If there are to be television programs, there must be\npeople to plan and produce them. Educational television stations have three chief\npersonnel sources; 1) their own professional salaried staffs; 2) the faculties and students\nof local schools, colleges and universities; and 3) other interested and capable contri¬\nbutors in the community.\nStaff. No station can operate successfully without a full¬\ntime professional staff to serve as the chief source for program ideas,\nplanning and production.\n2° ^£^Qjs£. C°lleges and Universities. The educational television\nstation has a very important personnel asset in the faculties and students of\nthe schools, colleges and universities in its community. The staffs and\nfaculty groups are a reservoir of knowledge and wisdom. They include men\nand women with special competence in all fields of learning who are committed\n- 89 -"
}