{
  "id": "d1349-92",
  "text": "COMMITTEE REPORTS\nto transmitting their knowledge to others. Some of these will be qualified to\nappear before television cameras; others, who for various reasons will not\nor should not personally participate as program talent, can furnish valuable\nsource material for educational programs. School administrators should\nmake it possible for some members of their faculty to give substantial\namounts of time to television, remunerating them through release from other\nduties or additional salary allowances.\nStudents of all ages are a good potential source of both program and\nengineering talent. Institutions with television training programs should find\ntheir trained competent students an excellent manpower source.\n3. Other contributors. ■. It is difficult to list all the types of people\nin a given community who might contribute time and effort to an educational\ntelevision station. Examples would include: public officials; distinguished\nvisitors; public service organization leaders; subject matter experts; com¬\nmunity theater staffs and actors; and musicians and artists. As in the case\nof contributing groups, however, these persons must not assume that they have\nan automatic right to take part in broadcasts; the station should retain full\ncontrol over all personnel and should insist that partifcipation always depend\nupon potential program contributions.\nAn educational television service to all parts of the nation is about to become\na reality. Several educational stations are now on the air, and fifty construction permits\nare outstanding. Since the major centers of population — such as St. Loms, Chicago,\nBoston, Detroit, San Francisco, Pittsburgh, Philadelphia, Houston and Los Angeles —\nare included among these fifty communities, it is certain that this developing television\nservice will have the potential for reaching the majority of television homes in America.\nAn important factor will be the complete coverage of rural areas under such statewide\n- 90 -"
}