{
  "id": "d1349-97",
  "text": "ALLERTON HOUSE 1949, 1950*\nRobert B. Hudson\nDirector of Broadcasting\nUniversity of Illinois\nAt long last educational broadcasters have discovered that they are not faint,\nisolated whispers in the broadcasting world. They have discovered for the first time\nthat they are a part of something of great significance in America. Furthermore,\namong them is a general recognition not only that their role is important (they have al¬\nways believed it to be), but that now there is some prospect of their controlling their\nown destiny.\nFor a group which has been broadcasting more or less regularly since the early\n'twenties, and whose members stood with their few stations against economic and\npolitical buffeting in competitive seas better charted and more efficiently navigated by\ncommercial broadcasters, such a discovery warrants a bit of looking into.\n* Reproduced by permission of author and publisher from the Hollywood Quarterlv,\nVol. V, No. 3. The original version included the following descriptive note-\n\"Robert B. Hudson, Director of University Broadcasting at the University of\nIllinois, has been active in the fields of both education and radio. After some years of\nwork in adult education, he organized and served as director of the Rocky Mountain\nRadio Council, an association of thirty colleges and universities which, since 1939, has\nbeen cooperating with commercial radio stations in presenting public-service programs.\nMore recently, he was radio consultant to the OWI, and from 1945 to 1950 was director\nof Education and Opinion Broadcasts for the Columbia Broadcasting System.\n\"The seminars on educational broadcasting held at Allerton House, a conference\ncenter of the University of Illinois, were the outcome of conversations between John\nMarshall of the Rockefeller Foundation and Wilbur Schramm of the University of\nIllinois. Dean Schramm served as the director of the 1949 seminar, and Mr. Hudson\nas the general chairman of the seminar in 1950.”"
}