{
  "id": "d1349-98",
  "text": "ALLERTON HOUSE 1949, 1950\nThe discovery that things were not what traditionally they seemed to be was made by\na relatively small group of men meeting under circumstances which were hardly extra¬\nordinary. About twenty directors of educational radio stations and university program-\nproducing centers were Invited to Allerton House for two weeks in the summer of 1949\nfor a stocktaking of educational broadcasting. These men knew each other well—as a\nmatter of fact they had been meeting together at conventions for years—and they had some\nacquaintance with the other fellow's problems. But common problems were usually over¬\nshadowed in these meetings by peculiarities of their specific application. The men who\ngathered at Allerton House were accustomed, too, to their \"stepchild\" role in American\nradio, and knew that not infrequently educational radio was accorded similar status on\ntheir home campuses as well. They had watched, during three postwar years, as\ncommercial networks and stations dropped all pretext of educational broadcasting,\nsubstituting for it mainly the Advertising Council’s public service formula-calls to\naction with little premium on understanding.\nBut commercial radio and its practices were not on the Allerton House agenda.\nHere was a chance for educational broadcasters to think cooperatively and consecutively\nabout noncommercial radio. No one was present to sell them on a program or to draw\nthe grand design. Their advisers were not there to remind them of a mission m life.\nEven the representatives of the radio industry came to be counted and to talk theoretic¬\nally of free speech, rather than to recommend courses of action. They were on their\nown, and there was adequate time for soul searching.\nThe daily sessions of the seminar, planned in advance by a steering committee,\ntended to be overprogrammed for fear that time might hang heavy on the hands of a group\nof active radio men who found themselves suddenly set down in the heart of the Robert\nAllerton Park and almost literally withdrawn from the world. But before two days had\npassed, the agenda was scuttled and the whole group was aflame over the central\nquestion: \"What is the job of educational broadcasting?\" What is it doing? What is it\n- 96 -"
}