{
  "id": "d1349-99",
  "text": "ROBERT B, HUDSON\nnot doing which it should be doing? What properly should be expected of it? What is its\nrole in American life and culture? What is it waiting for? Questions like these complete¬\nly consumed the attention of the group in its scheduled meetings, in rump sessions, in\ncommittees, at meals, in the Monticello tavern, and in countless bull sessions. As the\ngroup buckled down to its task, it seemed that suddenly a great truth had been revealed\nwhich long had haunted every man present but which had seldom escaped from deep in\nhis subconscious—the truth that educational radio not only has a job to do, but it is\ncapable of doing it. The sheer relief in getting at this matter was electrifying; the wall\nof repression, buttressed by years of rationalizations and expediencies, came tumbling\ndown and educational radio, for the first time in its turbulent history, was on the move.\nThroughout the days which followed, a practical, forward-looking operational\npattern took form, but not before the group painstakingly reviewed and restated the\nnature and the goals of educational broadcasting.\nThe Allerton seminar asserted that the aims of educational broadcasting are the\nbroad aims of education; that education in a democracy has the responsibility of lifting\nthe level of understanding and appreciation of the people, of giving the individual a\nknowledge of himself and his society and of the sources of tensions and perplexities in\neach; that in a free society it is essential that the individual have a continuing sense of\nbelonging and participating, of keeping up with a complex and fast-moving world; that it\nis the responsibility of education to foster and further that feeling of belonging and\ncounting.\nThe seminar pointed out that educational broadcasting has been most clearly\ndistinguished by its high concern for integrity in the selection and handling of materials,\nand by its consistent dedication to social purpose. This purposeful activity has taken\nseveral forms, among which are” (1) informing, (2) stimulating the individual to\norganize and give meaning to information, (3) contributing to the understandings that\nmake for better human relations and adjustment, (4) broadening participation in the\n- 97 -"
}