{
  "id": "d1677-0",
  "text": "AEB\nms\nEngineering Newsletter\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL JUNE, 1957 URBANA, ILLINOIS\nTV TECHNICAL TIPS NO. 31\n—By Cecil S. Bidlack, NAEB TV Engineer\nThis column is being written on the road in order to\nmeet the deadline. It seems each month the deadline\ndates move closer together. Perhaps it is because it\ntakes a while to get the Newsletter into print, and by\nthe time it’s out, copy for the next one is due.\n* * * *\nI have been honored by membership on Panel 4\n(Propagation Data) of the TV Allocations Study Or¬\nganization. TASO’s function is limited to technical\nstudy, fact finding and investigation, and interpreta¬\ntion of technical data. This information will be made\navailable to the FCC so the Commission may be able\nto determine the soundest approach to TV channel\nallocations. Panel 4 held its first meeting in Washing¬\nton on March 13, with 20 of the 26 members present.\nThe standardization of field strength measure¬\nments is one of the first objectives under study by the\npanel. The Association of Maximum Service Tele¬\ncasters now has two mobile field strength measuring\nunits in operation. Two other units, a CBS unit and a\nWestinghouse unit, will soon be in the field. UHF\ntransmission is also of primary concern; however,\nVHF measurements are also needed over different\ntypes of terrain. Please contact me if you have field\nstrength data available.\n* * * *\nThe Institute of Radio Engineers held its annual\nConvention in New York March 18-21. Fifty-five\ntechnical sessions were held during this period, rang¬\ning in topics from airborne radar to ultrasonics. The\nradio engineering show filled four floors of the New\nYork Coliseum with 840 exhibitors taking part.\nFrom an organization of radio engineers having\nits beginning in 1912, the IRE now has grown to\n^ 55,494 members. Due to this growth, 24 professional\ngroups have been formed which cover specialized\nfields of interest. For instance, most radio and TV\nengineers will be found in the Professional Group on\nNAEB Engineering Newsletter\nJune, 1957\nNAEB Engineering Newsletter, a quarterly publication\nissued by the National Association of Educational Broad¬\ncasters, 14 Gregory Hall, Urbana, III., $2 a year, edited by\nCecil S. Bidlack. Application for 2nd class mail privileges\npending at Urbana, Illinois.\nBroadcast Transmission Systems.\nTV TECHNICAL TIPS NO. 32\nI finally made it—to Minneapolis, that is—and the\nhome of KUOM, NAEB President Burton Paulu,\nand KTCA. In addition to participating on a panel\non the “Use of Closed Circuit TV by Schools” at\nthe Central State Speech Association Conference\nApril 5, I was able to take a look at the facilities of\nKUOM and KTCA.\nKUOM occupies the 1st floor of Eddy Hall on\nthe main campus of the University of Minnesota.\nEvery square foot of this space is being utilized to\nprovide offices, three studios (one of which also\nserves as a TV studio), a combination video control\nand recording room, and a master radio control\nroom. They are presently converting their trans¬\nmitter to remote control operation.\nWe believe many ETV stations could benefit by\nthe procedures used by KUOM for checking and\naging miniature tubes used in TV equipment.\nUpon receipt, KUOM checks each new receiving\ntube on a mutual conductance type checker. Those\nwhich give a sub-normal mutual conductance reading\nor show other defects are immediately returned to\nthe jobber for replacement. In some instances as\nhigh as 20 per cent of the tubes received have been\nreturned.\nThe tubes which pass this first test are then\naged with rated voltages applied for 24 hours. A\nspecial aging device has been constructed which will\nage 24 tubes at a time. A plug and jack arrange¬\nment permits the application of appropriate voltages\nto the tube elements.\n1"
}