{
  "id": "d1677-1",
  "text": "n. , • ,I . „ , . rLa|L board used for a credit course at WUNC-TV, Chapel Hill, North Carolina. The chalk board is\n4 x 8'eand Mon^We^k that extends it 15\" from the wall. Due to the framework and a 5\" chalk tray, the person using the board\nstands at least 2' from the wall, facilitating back and key lighting and improving camera angles.\nAfter aging, the tubes are checked on a SECO\nGrid Circuit tube tester, which indicates control grid\nemission, grid to cathode shorts, cathode to heater\nshorts, and gaseous conditions. Another 5 to 10\nper cent of the aged tubes fail to pass this test and\nare returned for replacement. The remaining tubes\nare then placed in stock to be used when the occasion\ndemands.\nLarry Brogger, KUOM chief engineer, has pro¬\nmised to furnish us details on the KUOM tube ager\nwhich we will duplicate and pass on to you. He\nbelieves this equipment will pay for itself in a year’s\ntime by locating sub-standard “new” tubes, to say\nnothing of the maintenance time saved by knowing\nthat a tube is good before it is used in equipment.\nAlso as a result of the use of this procedure, he\nhas become convinced that an occasional routine\ncheck of tubes in operating equipment is advantage¬\nous in maintaining the equipment in peak operating\ncondition.\n* * * *\nOthers may be interested in the photo on this page\nwhich shows how WUNC-TV mounts a blackboard\nfor use on TV. Actually, the board isn’t black; it’s\ngreen. The framework was built by their staging\nfacilities people and holds the board away from the\nbackdrop. This feature makes possible the use of\nback light and also keeps the performer away from\nthe wall so back light is effective. The supporting\nframe is not covered, as it adds a very pleasing pat¬\ntern to the set.\nI spent some time with Berten Holmberg, chief\nengineer of KTCA, the Twin City Area ETV Corpor¬\nation station. The KTCA transmitter has been in¬\nstalled in the KUOM transmitter house, proof of\nperformance tests have been completed, and they\nhave had a test pattern on the air on Channel 2.\nPresent plans call for programming to begin in\nSeptember, 1957.\nKTCA offices are located at present in a tempor¬\nary building on the Agriculture campus of the Univ¬\nersity of Minnesota (which will also house live\nstudio and film equipment). Work is about to be\nstarted on the installation of studio equipment.\nBert has had his physical activity severely slowed\nbecause he tore a tendon in his left heel in an attempt\nto get away from the KTCA tower when a bolt was\ndropped. Now that the cast has been removed and\nthe crutches discarded, he hopes soon to be going\nfull speed ahead.\n* * * *\nThe NAEB Engineering Committee held a short\nmeeting in Chicago Monday, April 8, prior to the\nNARTB Convention and Broadcast Engineering\nConference. Six of the 10 committee members were\npresent.\n* * * *\nSpeaking of the NARTB Convention, I saw per¬\nhaps 20 engineers from educational radio and TV\nstations in attendance. No doubt there were others\nwhom I didn’t happen to meet or see. Total reg¬\nistration for the Convention was 2358, with 577 reg-\n2\nENGINEERING NEWSLETTER"
}