{
  "id": "d1677-1",
  "text": "- 2 -\nSHORT FLASHES FROM THE FIELD\nWSUI, University of Iowa\nCarl Menzer, Director, says, \"We are starting the second semester schedule which\nwill be ready in about a month. We hope to include in this schedule two periods each\nweek which will be devoted to the broadcasting of both sight and sound from tele¬\nvision transmitter W9XK and broadcast transmitter WSUI. It is hoped that some new\nequipment will be available for experiments in television transmission. I am won¬\ndering what other stations are doing in the line of regular television broadcastsJ*\nWhat about television experiments? Is your station carrying on any work along\nthat line? It is never too early to start, but after a while it may be too late*\nWBAA, Purdue University\n\"The most import- nt item during December was the Radio Conference held here at\nPurdue. I am enclosing a final program. All of the speakers did credit to the pro¬\ngram and there wasn't a sour note in the group. Over a hundred people were in atten¬\ndance and there was a very representative group of the various interests we wanted\nto bring together. I believe there will be some good results come out of this Con¬\nference,\" reports Clarence Dnmmon.\nThe conference was sponsored by Purdue University to bring together representa¬\ntives of civic organizations, public schools, colleges, commercial and institutional\nbroadcasters to consider mutual problems. It is hoped that this conference fostered\ncloser cooperation for the improvement of radio participation and more effective use\nof radio facilities in the state of Indiana.\nIn this Conference idea is something which many of our stations could well\nfollow-up on. Its advantages are self-evident.\nKFDY, South Dakota State College\nThough being limited to daytime hours, this station sought permission to broad¬\ncast a special evening program of state-wide interest. After requests to other sta¬\ntions on the frequency were of no avail, President Pugsley appealed directly to the\nF.C.C.\n\"The Commission gave us permission for our week of Farm and Home programs in¬\ncluding the evening program, in spite of the refusal of the Tennessee station to\ngive its consent. As a matter of fact, I assume that five other commercial stations\nrefused their consent since we heard nothing from them in reply to our letters\",\nsays H. M. Crothers.\n\"EDUCATIONAL STATIONS\"\nThis pictorial review of the country's leading educational stations is now off\nthe press. Doubtless you have received copies. The supply is very limited, so it\nis suggested they be preserved. Limited numbers of extra copies are available\nthrough the N.C.R.E. Be sure that your library receives one for its permanent files.\nThe NAEB members cooperated in the compilation of this book.\n4 YEARS OF NETWORK BROADCASTING\nIn the exchange packet you'll find a booklet by thcat title. If you have any\ndoubts as to the desirability of controlling facilities, read this record of the ex¬\nperience of the National Advisory Council on Radio in Education with the National\nBroadcasting Company. This little book, as might be expected, has popped off another\nlid, and will be a thorn in the side of those who are crusading to make educational\nbroadcasting a mere supplement to a major commercial plan."
}