{
  "id": "d1677-4",
  "text": "- 5 -\nIS RADIO LIVING UP TO ITS PROMISE?\nThat is the subject for the symposium held at the 5th Anniversary Celebration\nof the University of the Air over WEVD, New York, on December 18, 1956. It was pre¬\nsided over by Hendrik Willem Van Loon. U. S. Commissioner of Education John W.\nStudebaker, F. C. C. Commissioner George Henry Payne, and others took part.\nThe idea seems to be a good one for it gives educational broadcasters an op¬\nportunity to have presented to their listeners the facts and principles which underly\nnot only educational stations, but American radio in general. Why not plan a sym¬\nposium to air the whole thing impartially? (It is a safe bet such a program won’t\nbe duplicating anything offered under other auspices).\nCommissioner Payne spoke his mind. Here are quotes from his paper:\n\"What would have happened in the field of medicine, philosophy, law,\nscience, literature, politics or journalism if the first impulse'had been\nmoney-making? Alien we look back over the long struggle of humanity to\nachieve civilization and some surcease from the sorrow and the ills that\nilesh is heir to, how little would have been accomplished if there had not\nbeen, in all those fields, men and women ready to suffer and even to die\nthat humanity might benefit. What untold tragedies might have resulted if\nthe men and women who made all those sacrifices were actuated by a desire\nto make a million dollars rather than by a love of humanity.\n”A more disagreeable aspect, and a more sinister one, deterring radio\nfrom living up to its promise, is the fret that the radio lobby in Wash¬\nington has filled the radio ‘industry* with the novel idea that they control\ntho government.\n\"For two and a half years I have watched the operations of this lobby\nwhich has endeavored to dictate the actions of the Federal Communications\nCommission.\n\"When I speak of its contemptuous attitude toward educational and\ncultural matters I am not hazarding o.ny guess. I am speaking from facts.\nAn important broadcaster, a man who has acted as official of an organiza¬\ntion, sat in my office one day arguing ‘bout the perfectability of the\nradio program. We were naturally at different ends of the question — he\ndeclaring that the orogr ms as given today were perfect. Finally I drew\nout, some letters and extr cts from letters of many college presidents\nthroughout the country and showed him that they were far from satisfied\nwith the present set-up.\n\"His answer was, ’What the hell do then college presidents know*.»\n\"One argument, effective though unreal, that has'kept public opinion\nfrom forcing the production of better programs has been that tho pioneers\nof the radio art are entitled to a just share of credit and profits for\ntheir pioneering. But have the real pioneers had any sizable share in the\nprofits?\n\"Attacking every endeavor of the cultural and educational interests\nto improve the quality of radio programs is a most vicious lobby. It is not\na particularly intelligent lobby for, if it knew its business, it would see\nthat the educational and cultural interests ask so little that they could\nbe easily conciliated by small concessions. But, arrogant in its belief\nthat it controls the Commission, it is not inclined to concede anything.\nat is expected that a complete text of Commissioner Payne’s address\nwill be included in the February \"packet\")."
}