{
  "id": "d1524-1",
  "text": "-2-\nas a weapon of war to unhinge the rea&on'io'f one’s neighbors; now, here in New\nYork, radio can make the full..-tarn'andTuse its power to benefit all mankind.\nWithout exaggeration, the broadcasting.-‘of the U,N.. sessions represents perhaps ^\nthe greatest opportunity for public service that American radio has ever en¬\njoyed.... the major distinction of • Ik NYC is not sc much that it is ideally suited\nto serve as a local U. N. outlet as that it has. shown it can fill .the role with\nmature dignity and understanding,\" (N.Y. Tinies - April 7th, 1946)\nI should point out that no other radio station in the New York Area provides\nthis service, I should also point out that if nighttime operation were hot avail¬\nable to WNYC under Special Service Authorization this public service would be\ndenied to- the -eight million inhabitants of the City of New-'York*The attention\nof the Commission 'is respectfully invited to'the fact that WNYC1 s cover age’’of the\nUnited Nations Sessions in this fashion resulted this year in the presentation of\na hirst Award at the^Eleventh American-Exhibition of Education Badio Programs\nby the Institute \"for Education by Badio oi Ohio State University.\n. We have utilized the nighttime hours, between sunset Minneapolis and 10 P.hi.,\nEastern Standard Timeto educate and make known to the thousands of veterans\nresident in New York City, .their rights, privileges and responsibilities under\nthe-G.I. Bill of Bights. ' The Veterans’ -Admihistration has conducted regular\nprograms over our facilities under the general heading of \"Straight Pacts for'\n-Veterans\",. These programs have answered the many questions which arose Under ;\nvarious interpretations of' the statute. '• •••;•' •\nWe have originated various programs from the New-York City Veterans Center\nat 500’Park Avenue, outstanding of which has been the \"Careers in Small Business\"\n■series-broadcast from'-8:30- to -94-30 P.M., on Wednesday over WNYCB This program ^\nhas- been specially designed to utilize radio to distribute more-widely the bene¬\nfits -'of the New York.City Veterans Service Center’s information and guidance\nservices. Experts on certain types of small business such as Self-Service\nlaundries, Candy Stores and luncheonettes, Small Scale Export and Import business,\nBars and Grills, Gas Stations, etc., present to the Ex-GI, a pretty clear picture\nof- the elements necessary for success in a given type of business. The program\n-is a guidance project and represents a unique departure from ordinary radio pre¬\nsentations, This service is not available through any other radio station in the\nMetropolitan area and would not be available to the half million veterans in the\nMetropolitan area if it were not broadcast by WNYC.\nState and national conventions and meetings of various organizations such as\nthe American Legion, Veterans of foreign Wars and others have been given full\n■coverage by WNYC.' No other radio station in the City of New York devoted as much\ntime to the recent American Legion National Convention as did WNYC, We could not\nhave provided this s-ervice if we did not have the Special Temporary Authorization\ngranted to us by the Commission for:nighttime operation.\nThe Want Ad Column of the nir, broadcast- by WNYC, is a daily program designed\nto fill the needs of industrial activity involving employers, employees and the\npublic with'respect to current employment needs1 and opportunities for work and\ntraining in the New York City area. This program, which was previously prepared\nby the United States Employment Service,, is now under the supervision and control\nof the officials of the New York State Employment Service,. It is devoted to all\nemployment needs of large and small industrial plants in this area as well as to\nthe requirements of the federal,. State and Municipal Governments in the handling\nof the many phases of employment problems that present themselves.\nWNYC devotes large blocks of- evening time when it can reach the greater\nproportion of the citizens of New York for the broadcasting of- information on"
}