{
  "id": "d1407-1",
  "text": "of Urra„ : those population constitute* more than 57f of the total population.\nStation :rOXv • a the radio voice of the institution* hat a roar.if eat duty v> present\nthese researches and this special farm informations together with programs in the\nfield of adult education, to the citizens of this important agricultural state-\nlewa State College now has no re than 6100 students * end plans are being\nmade to accent 7500 for the qrarter opening in Septeiuber, -946, The staff of\nthe Io’*a Agricultural Kactensiv.. Service... college ana field agents, who masher\nmore than 300 in cooperation with resident staff of 600, w rk closely with the\nbroadcasting enterprise The college maintains and operates the Iowa Agri-\nc v .turai ^r.eriment Station, whose basic contribution? to American agriculture\nin the i'le-d* of livestock and crop improvement are veil known\n01 .8 one of the oldest broadcasting stations ia the United States, and\nV-v.' Momer station of Iowa in continuous ©per tion* It received its first\nlicet**\"© from Radio Division,; the United States Departaent of Commerce* in April,,\nle^» and bias operated continuously since that time, t was af signed day 1 ght\nfacilities on the clear channel 640 kilocycle frequency in November, 1929 aid\nhat 'v: l,e the best possible use of this time since than date\n400* vertical antenna was put in service Hard , 1939, A new 5 kilowa t\nP.-'.. fitter was put in service Sept • >*r 23.-, 1939, o the third floor of the\nIce vie* building., in rooms adjacent to up-to-date studios, lounge and offices.\nTb4* asderu equipment. efficiently installed and operated* has resulted In very\nsatisfactory daylight cor-rage throughout Iowa and j arts of neighboring states\nX if directly affected in this hearing* espec ally under the discussion\nMjrv.U-d ofi* It sue v\" of the points to bo ?on elder ed„ since UOI is a\n• . XI station assigned to and operating on a clear channel. It is not our\n- to<discus* th* technical or the engineering aspects of the case*, nor do\nr * ith to tfhtar into & general rancXvnsion for ir against the i:ain issue relative\nt> clear channels ,"
}