{
  "id": "d1407-11",
  "text": "- 10 -\nMarch 30, 1946\nLaMars* Iowa\n’’He wish, to express our appreciation for the broadcasts of the Iowa\nState High School Basketball Tournament, which was carried by your\nstation.\nEveryone la LaMars and the surrounding communities was especially\ninterested in the State Tournament this year* and being able to hear the\nbroadcasts from your station, was* we believe,, a great public service for\nthis community,**\nMr. Harner, President\nLEMARS CHAMBER OF COMMERCE\nMarch 25., 1946\nCenterville,, Iowa\nWX wish to express my appreciation for your broadcast of th© basketball\ngames at love. City, Reception in ^antarville* of the other stations which\nwere broadcasting, was almost negligible In the evening., WOX came in very\nsatisfactorily and revealed the fact that they should be permitted to\nbroadcast evening programs,\nB, V, Fannon Super intend ©it\nCBl'TTBRVILLB PUBLIC SCHOOLS\nThese 19 broadcasts of play-by-play description of high school and\ninter-collegiate basketball games during the winter months of 1941 and 1946\nwere a means of wholesome entertainment to students in the high schools\nof Iova« as well as the public in general and brought no letters or other\nword of disapproval from any listeners,, who may have experienced interference\nin getting the program of the dominant station on the 640 kilocycle assignment«\nwhich leads us to believe that more of the public will be served if* with\npropei* engineering safeguards,, the Special Service Authorizations could be\nmade permanent\nThe real value of a radio station, however, rests not so much In its\nunusual and special cervices as in the Impact and utility of its day-by^day\nprogram scheduled. The market news reported above6 as well as being a\nspecial serviceB Is a day-by-day service. Other Items of great value in UOI’s\nregular daylight schedule include Its program of agricultural information*\n(other than market newsK its broadcasts of local, regional* and national"
}