{
  "id": "d1407-13",
  "text": "- 12 -\nHowever ve are severely handicapped in serving-our listeners* both by the\nabsence of nighttime broadcast periods and by the variable sign-off period in\nthe winter months Me are always * by the denial of nighttime, denied a majority\nof male listeners^ and each time a successful summer program period is built up*\nits effectiveness must be terminated when the shorter days coo© This arrange¬\nment is incongruousa Much of VOI*s program material accrues from the college and\nkindred organizations. Thus* by far the greatest amount of program material is\navailable during those months when the college mid the schools are in session.,\nSeptember through May But under 1/01* c broadcasting assignment* and during the\nperiods of maximum listening, ve have the fewest hoars at the time when we have\nthe most programs® and inversely,, we have the most hours at the times when we\nhave the fewest college programs This is mantfsefely an unfavorable position,\nV01 feels that it la performing a needed and valued service for the citisena\nof Iowa* who support it financially,, MCI also feels that any success in its perform\nanoe only indicate© more clearly the limitations imposed by inability to operate\nat nighttime hours, VOI is forced to deny raany groups the privilege and right\nof appearing on the air because of sheer physical impossibility in terms of time\navailable, and furthermore* is unable to satisfy many general listener requests^\nfor services which are desired by men* as well as women, in the way of (l) special\nservices and (2) a listening choice at night.\nIt ie interesting to note that in soite of MOP© status as a daylight station*\nthat under War daylight savings time whan the evening hours were, in effects\nsomewhat extended for several months of the year, that • evaral programs of semi-\nclassical, classical music*, news and public affairs programs achieved sufficient\ninterest and listener following so that VOI shows up with considerable strength\nas a wnighttime station*’ in the 1945 Iowa Eadio Survey, conducted by Dr, Forest\nban and distributed by Station MHO. 1*01 ranked 8th among Iowa station© ’'heard\nregularly at nighttime”, ahov/ing 5„6£ of the response among the questionnaires.\nThis ranked MOI Humber 8 cut of a sequence of 14 Iowa stations regularly heard\n\\ night Ira©.© • # •"
}