{
  "id": "d1407-3",
  "text": "„ 4 -\nIf granted evening time, the college stations have demonstrated with the\nfacilities they already have; that they will use it advantagously., As tynical\nof such use, >,1)1 proposes to use erear.ng time for the pumose of presenting some\nof the Immediate needs of 1946, Todays the United States has a vital interest\nin supplying food to people suffering from malnutrition and starvation* in\nstimulating increased activity 'r the sharing of clot- ing for shivering and\nfreezing humanity* and in urging the public to share its housing facilities\nT7e do this not only for humanitarian reasons, but because we realize the lnrcor~\ntant role of food in restoring order and the significant investment in world\npeace.\nA revision of rules is desirable from the standpoint of Class II stations\non clear channel assignments* not only for she opportunity to render a service\nduring morning hours before sunrise, and during evening hour's after the evening\nmeal,, but to do it consletantly throughout the twelve months of the year- From\nthe standpoint of the ^interest* convenience and necessity* of the listener. It\nis mu h easier for him to be able to iune in the station of his choice month\nafter m-aih* expecting to find :he program of his choice, than to first consult\nhis calendar and then learn that Ans to the ever**changing hour of sunrise or\nsunset it has been necessary for the station of his choice to omit or change the\ntime of his favorite radio fea';ure» In order to provide protection to a station\nseparated by the distance of lialf a continent, that does not provide a satisfactory\nsignal in his area. Fixed radio habits can ultimately be broken* but the average\nlistener has difficulty in understanding why he cannot receive the material that\nhe wants, \"hen he wants it8 from the station of his choice * on an warotmd the\nclock* basis throughout the twelve months of the year,\nClaes II educatioral standard radio stations, operating on clear channels,\nserve their respective areas in manners not possible for networks or dominant\nclear channel stations to serve over wide areas, on account of the vide differ^\nonce# In vocations and industries."
}