{
  "id": "d1246-1",
  "text": "-2-\nRegarding the question of prerequisite for membership in the TV Division, the Executive\nCommittee feels that no division can set up eligibility requirements for another; this\nwould be the effect of the suggestion that all TV broadcast stations be required to\njoin the TV Station Division as a prerequisite to possible additional membership in the\nInstructional Division.\nThe Committee further takes the stand that membership in a Division can not be made\na prerequisite to membership in NAEB. Rather it must be the other way around: an\nactive membership in NAEB must be the requirement for membership in any Division.\nActually, it works both ways, for there is nowhere for an institutional member to go\nexcept into one of the three institutionally-based Divisions. A station cannot be an\nNAEB active member in limbo.\n2. “The ETV Board (6) would be elected nationally at large on a staggered three-year\nterm basis, with no member allowed to succeed himself for three years.\"\nThe Committee feels that the establishment of specific procedures governing the\nelection of Divisional Board members should be left to the Divisions themselves.\nHowever, setting up procedure for electing the initial set of Directors should be done\nby the temporary steering committees established for each Division.\n3. “The ETV Division would determine its own staff, budgets, and assessments,\nrelated to ability to pay, etc.” Agreed. Internal matter.\n4. “The Division head would be named President of the NAEB TV Stations Services\nDivision and would be a paid professional.\"\nThe Committee recommends that there be only one President in NAEB and that heads\nof Divisions be titled Executive Directors. Also, the Committee recommends that\nthe titles of the Divisions be written into the By-Laws as follows:\nTV Stations Division of the NAEB\nRadio Stations Division of the NAEB\nInstructional Division of the NAEB\nIndividual Members Division of the NAEB\n5. “ETV matters decided by the ETV staff and Board could not be over-ridden by the\nNAEB Board.\"\nThe Committee, while wishing to grant as much autonomy as possible to each\nDivision in its area of concern, feels that there must be some provision in the\nBy-Laws which indicates the over-all responsibility of the Association for matters of\nbroad concern affecting the entire broadcasting movement. If complete carte blanche\nwere to be the order, it would be possible for any Division to go off the deep end on\nsome matter which might cause grave injury to all of educational broadcasting\nbefore other Divisions would have an opportunity to review a precipitate and possibly\nshort-sighted action. Thus, though the TV Station Division may wish absolute"
}