{
  "id": "d1246-3",
  "text": "-4-\n8. “The Affiliates Committee should function as an interim Board for the TV Station\nDivision. “\nUnder the present Constitution, the existing NAEB Board members continue in office\nuntil January 1, 19 64 - when duly elected replacements take office (half of the Board\nis replaced each year)\nSince a totally new structure is being proposed, it would seem advisable to make a\ncompletely fresh start with a new Board to launch the new regime; but at the same\ntime means must be provided to assure an orderly and legal method for transfer of\nauthority to the new administrative structure - an NAEB Board composed of four\nDivisional Boards plus the President.\nAs the duly constituted authority, the present NAEB Board must continue to have\njurisdiction over each area of concern until such time as each Division has been\norganized and duly elected Directors installed so as to constitute the full new NAEB\nBoard. In the interim, the incumbent Board retains authority and has the responsibility\nto determine the manner of effecting the transition.\nThe Committee feels that the Board itself should appoint the “steering committees”\nas its representatives in determining procedures and conducting elections for the\nDivisions, and that members of the Board should be involved in the composition of\nsuch committees, together with appropriate NAEB committee chairmen, and that the\nPresident shall be a member of each steering committee. Because of the special\nsituation in TV, the Board accepts the Affiliates Committee, but with additions.\nSuggested make-up of such Steering Committees:\nTV: Affiliates Committee,present TV Board.\nRadio : Present Radio Board\nInstructional: From TV Instructional Committee: Greenhill, McIntyre; From Instructional\nRadio Committee: Lardie; Swenson, Johnson plus the two present Directors-at-large.\nIndividual: Professional Development Committee, plus Individual Member Director.\nAnother matter discussed in the Appy memo is dues for the TV Stations which it is\nsuggested should stay as they are in 19 63, with any increase in dues proposed by\nNAEB to take effect only upon approval of two-thirds of the members of the new\nDivision.\nWith reference to dues, the Committee makes these points:\na. Under the present constitution, the Board may set dues but they must be approved\nby the membership. At Milwaukee a new dues structure will be proposed by the Board\nand presented to the convention for approval."
}