{
  "id": "d1464-10",
  "text": "News Coverage...\nThe nerve center of any good radio station is its news room. Here, the station’s responsibility to the public is\nthe most critical and complex. WNYC is fortunate in that it carries private teletype lines from the three major\nnews services — The Associated Press, The United Press and The Trans-Radio Press. Late in the year WNYC\nwas cut into the Police Department’s teletype loop so that the WNYC newsroom had another additional news service.\nIn addition to the news summaries, collected from the three wire services, which are broadcast five minutes before\nthe hour every hour, WNYC also carries three complete official weather reports from the United States Weather\nBureau station at the Battery. These reports are supplemented by the weather forecasts supplied by the press services.\nAll together they represent the most complete weather news coverage given by any station in New York.\nThe functions of the newsroom staff are to collate, edit, and select items originating from all of the three wire\nservices. Their auxiliary function is to monitor the newscasts of other radio stations in order to check on the com¬\npleteness of their broadcasts.\nAll items used on newscasts are filed away and used for future reference.\nIn summation, the newsroom at WNYC aims for accuracy, completeness, impartiality in reporting the news to\nNew Yorkers. Listed below is a sample news schedule for one normal broadcast day.*\n6:55 AM\nNews Summary\n12:55 PM\nNews Summary\n5:55\nPM\nNews Summary\n7:55 AM\nNews Summary\n1:00 PM\nPolice Alarms\n6:45\nPM\nU.S. Weather Report\n8:55 AM\nNews Summary\n1:55 PM\nNews Summary\n6:50\nPM\nUN News\n9:55 AM\nNews Summary\n2:00 PM\nU.S. Weather Report\n6:55\nPM\nNews Summary\n10:55 AM\nNews Summary\n2:05 PM\nCity News\n7:55\nPM\nNews Summary\n11:30 AM\nBBC Radio Newsreel\n2:55 PM\nNews Summary\n8:55\nPM\nNews Summary\n11:55 AM\nNews Summary\n4:55 PM\nNews Summary\n9:45\nPM\nTop Talk of the Day\n* The schedule does not include bulletins or spot announcements.\n-9-"
}