{
  "id": "d1464-11",
  "text": "The Blizzard of \"47\nUnprecedented is the word most often employed to describe the snowfall of Friday, December 26, 1947. Unprecedented, too, was the job\nthat faced New York City’s municipal agencies in digging the snowbound City back to normality. From the first indication of the magnitude of\nthe storm, WNYC became the focal clearing point for the City’s superb efforts to extricate itself from the dangerous paralysis resulting from the\n25-inch precipitation.\nServing as radio representative on the Mayor’s committee on Planning and Operations, Seymour N. Siegel, Director of the Municipal Broad¬\ncasting System, placed the full staff of the City Station on a special basis and, channeling all activity through the Newsroom, kept all radio stations\nin the city advised of all important decisions of the Mayor’s Committee, and key municipal departments. An indication of the indispensibility of the\nCity Station’s snowstorm coverage was the permission granted by the Federal Communications Commission for WNYC to remain on the air\npast the 10 P.M. sign-off time for the duration of the emergency.\nMayor William O’Dwyer’s special talk on the snow removal problem on WNYC Sunday, December 28, at 6 P.M., was made available\nto all radio outlets in this area, which broadcast the emergency message either live or later via recording.\nThroughout the day of the storm, hourly broadcasts direct from the United States Weather Bureau at the Battery kept New Yorkers appraised\nof the direction and state of the storm, and transit reports, where available, were aired as received in summarized form each hour.\nFrom the first indication of the storm’s full extent, civic appeals, announcements and reports were relayed to snow-bound listeners, and\nWNYC’s Newsroom became the clearing center for all municipal news in relation to the storm.\nIn addition to the immediate airing of all news received from the city agencies most vitally concerned in the snow removal problem, WNYC\nbrought its listeners special broadcasts by its Director following meetings of the Mayor’s Committee, reporting on decisions reached, and special news\nreports direct from Police Headquarters and the Board of Estimate. Specific ways in which New Yorkers could co-operate in the emergency were\nrepeatedly broadcast, and the Mayor’s message of Sunday was re-broadcast twice during the evening. Appeals for snow-clearers were broadcast\nrepeatedly, and an up-to-the-minute record of the state of the city’s street-cleaning operations was relayed to listeners.\nIn short, WNlfC’s job during the snowstorm of 1947 represented a clear-cut example of the city station’s function of liaison agent between\nthe City government and the citizens of New York.\n- 10-"
}