{
  "id": "d1464-13",
  "text": "The 8th Annual American Music Festival\nEach year, for the past eight years, WNYC has sponsored and arranged an annual twelve-day American Music\nFestival. The eighth in the series, held during 1947, was one of the largest and most brilliantly successful thus far.\nAmong the festival’s main purposes is the intention to highlight the work of American composers and artists.\nAs always, the festival featured the premier performances of dozens of new works ranging from pieces as small as\nsongs to fully orchestrated concertos and symphonies. Mr. Herman Neuman, WNYC’s Musical Director, is almost\nwholly responsible for the job of arranging for music and artists for well over a hundred programs and the score of\nspecial concerts in music centers throughout the city.\nThe municipally owned and operated station, WNYC, has managed, year after year, to bring off this enormously\nambitious musical event with such success principally because it has always encouraged and aided young musicians.\nThe talent cost for such a festival, were it conducted commercially, would run well into the hundreds of thousands\nof dollars just for air time for the twelve day period. Some of the major events of WNYC’s 8th Annual American\nMusic Festival are listed below.\nParticipating Composers and Performers (partial listing) :\nSamuel Barber - Leon Barzin - George Antheil - Arthur Berger - William Bergsma - Leonard Bernstein - A. W. Binder - Remo Bolognini - Minuetta\nBorek - Carol Brice - Horace Britt - Olga Coelho - Aaron Copland - Henry Cowell - Paul Creston - Norman Della Joio - Rose Dirman\nLukas Foss - Anis Fuleihan - Roy Harris - Charles Haubiel - Walter Hendl - Alan Hovaness - Charles Ives - Frederick Jacobi - Philip James\nGeorge Kleinsinger - A. Walter Kramer - Paula Lechner - Ernesto Lecuona - Huddie Ledbetter - Douglas Moore - Yella Pessl - Susan Reed\n- Harold Rome - Reah Sadowsky - Alan Schulman - Robert Shaw - Elie Siegmeister - Leo Smit - Margaret Speaks - Randall Thompson - Winter\nWatts - Lazar Weiner.\nSpecial Concert Broadcasts (partial listing) :\nAmerican Music Festival Concert from the Museum of Natural History\nAmerican Music Festival Concert from Town Hall\nJuilliard Music School Festival Concert from Juilliard School\nAmerican Choral Concert from Town Hall\nAmerican Festival Concert from the Brooklyn Museum\nFrick Museum Concert\nPhilharmonic-Symphony Orchestra from Carnegie Hall\n-12-"
}