{
  "id": "d1216-0",
  "text": "j N-A-E-B NEWS-LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nEdited by Richard B. Hull, President\nStation WOI, Iowa State College, Ames, Iowa\nSpecial Issue November 15, 1947 Convention Reports\nRECORD ATTENDANCE AT ANNUAL N-A-E-B MEETING III CHICAGO\nThe three-day meeting of the National Association of Educational Broadcasters,\nOctober 25-26-27 attracted more than 50 educational radio-men from all districts\nof the Association. The N-A-E-B represents non-commercial, educational AM and\nEli radio stations, workshops, and production centers, owned and operated by\ncolleges, universities, and public service agencies. Sessions were held in the\nHotel Sheraton, Chicago.\nN A 3 B MEMBERSHIP HAS 100£ INCREASE\nHarold Engel, retiring president of N-A-E-B reported membership had more than\ndoubled in the past year, increasing from 31 to 65, with more membership applica¬\ntions arriving daily. Engel, who this year resigned as president, after leading\nthe organization for more than 3 terms predictedthat within the next 5 years\nseveral hundred educational stations would be on the air. More than 47 education¬\nal Ell applications have either been granted or are pending before the Eederal\nCommunications Commission.\nCONVENTION SPEAKERS ON EDUCATIONAL STATION PROBLEMS\nAddressing the N-A-E-B members Sunday were Harry Skornia, who discussed\n’’Facilities, Budgets, and Standards for the Educational Station.” Skornia,\nDirector of Radio at the University of Indiana, had just completed a nation-wide\nsurvey of non-commercial stations in an effort to appraise existent facilities\nand problems.\n”ECC Services to Educational Broadcasting”, was the subject of Harry M. Plot-\nkin, Assistant General Counsel to the Eederal Communications Commission. Plotkin\nexplained some of the procedures necessary in applying for and securing permission\nto operate an AM or EM radio station and counselled interested applicants not be\ndismayed by the seeming ’’red tape.”\nEranklin Dunham, Chief, Educational Uses of Radio in the U.S. Office of\nEducation, described radio services available in that office to stations operated\nby public school systems, colleges, and universities.\nJAHSEY KAILS LARGE-AREA Ell COVERAGE\nC. M.Jansky, Jr., Consulting Engineer, nationally-known radio expert, dis¬\ncussed experiments v’ith long-distance EM transmission involving stations at Alpine,\nN.J., New York City, and Atlantic City. Jansky described to delegates how the\nfrequencies between 88 and 108 megacycles may be used to deliver high grade,\nstatic and interference-free broadcast service over very large areas.\n—\nVice-President Treasurer Executive Secretary Executive Committee\nJohn Dunn W. I. Griffith M. S. Novik Seymour Siegal, WNYC, New York Graydon Ausmus, WUOA-FM, Alabama\nWNAD, University of Oklahoma WOI 30 Rockefeller Plaza Carl Menzer, WSUI, Iowa Ralph Steetle, WLSO-FM, Louisiana\nNorman, Oklahoma Ames, Iowa New York, N. Y. Frank E. Schooley, WILL, Illinois William Sener, KUSC-FM, California"
}