{
  "id": "d1216-1",
  "text": "-2-\nJansky, refuting 3 common misconceptions about HI, pointed out:\n1. tfhe range of an HI station is not limited to line-of-sight 'broadcast, it may\ncover 2 or 3 times this distance.\n2. It is. possible to cover large areas with an HI transmitter without using\ninterconnecting telephone circuits.\n3. HI sets are becoming increasingly available, and many of them at reasonable\nprices.\nH-A-E-B elects UEU OFFICERS\nHichard B, Hull (Station WO I, Iowa State College) was elected President for\n1947-48. Hew Vice-President is John Dunn (Station WAD, University of Oklahoma).\nRe-elected Treasurer is U. I. Griffith (Station UOI, Iowa State College).\nElected to the Executive Committee were Seymour Siegal (Station WiTYC, Hew\nYork City), Graydon Ausmus (Station UTJOA, University of Alabama), Frank Schooley\n(Station HELL, University of Illinois), Carl Menzer (USUI, University of Iowa),\nRalph U. Steetle (ULSU, Louisiana State University), and William E. Sener\n(University of Southern California).\nThe Executive Committee re-appointed Morris S. Hovik as Executive Secretary\nfor the Organization. Hovik, formerly Director of Station UHYC, Hew York, head¬\nquarters at 30 Rockefeller Plaza, Hew York City.\nGUEST OF HOHOR AT C01UPFTI0H\nDr. Lee dr Forest, the\"Father of American Radio,\"-inventor of audion tube,\nand sharp critic of present day commercial broadcasting in the U.S„ was guest of\nhonor at the annual H-A-E-B banquet Sunday night. Dr. de Forest, a healthy,\nhandsome elderly gentleman who has seen the full miracle of modern electronics\ndevelop in his lifetime, received a rising vote of tribute when he made his re¬\nmarks .\nDr. de Forest recalled his remarks, made the previous January on the occasion\nof the 25th anniversary of broadcasting in the U.S., when he criticized the\nradio industry for having made radio \"...a laughing stock of intelligence, surely\na stench in the nostrils of the gods of the ionosphere; ...of having cut time into\ntiny cubelets...wherewith the occasional fine program is periodically smeared\nwith impudent insistence to buy or try.11\nHe hailed the efforts of organizations such as the Rational Association of\nEducational Broadcaters as the only hope of redeeming from being \"cursed more\nand more, year by year.\"\nFCC COMMISSIONER DURR COFVWTIOH BAHQUET SPEAKER\nClifford J. Durr, hailed by VARIETY magazine as one of the few Commissioners\nin the history of the FCC \"who has been able to see the woods for the trees...\nwho has insisted that the decisive criterion of radio service...is not the\ncoverage pattern...or the balance sheet...but what comes out of the loudspeaker,\"\npointed out his disappointment and his still prevailing hope that the educators\nof the country, the great universities, and the foundation would recognize their\nobligations to the American listening public."
}