{
  "id": "d1216-5",
  "text": "-6-\nFEDERAL C OI'G iUlTI CAT IOH S COMMISSION\nHon-Commercial & Educational Station Applications and actions)\nCctot)er 15 - HovemBer 15, 1S4-7\nAPPLIGATIOITS (Amplitude Modulation)\nKFKU (1S50 KC) - University of Kansas, Lawrence, Kansas - Modification\nof license to increase night power from 1 KW to 5 KW, install new transmitter,\nand directional antenna for night use, and change transmitter location from\nsouth of Tonganoxie, Kansas, to On Highway 24, 1 mile- east of Grantville and 5\nmiles east of Topeka, Kansas,\nWHBQ, (550 KC) - Harding College, Memphis, Tennessee - Construction permit\nto change frequency from 1400 to 560 kc., increase power from 250 watts to 1 KW\nnight, 5 ICW day, install new transmitter and directional antenna for day and\nnight use (LA-2) , change transmitter location from Court and Heely Streets,\nMemphis, Tennessee, to 5 miles north of Memphis, Tennessee and change studio\nlocation from Hotel G-ayoso, Memphis, Tennessee, to 139 S, Main Street, Memphis,\nTennessee. Amended re change in directional antenna pattern and change\ntransmitter location from 5 miles north of lemphis, Tenn., to At Horton Hoad,\napproximately 5 miles north of the center of Memphis, Tennessee.\nUBBR (1330 IC) - Matchtower Bihle and Tract Society, Inc., Staten Island,\nU.Y. - Modification of construction permit (Bl-P-4807, which authorized increase\nin power and installation of new transmitter and directional antenna for day\nand night use) for extension of completion date.\nAPPLICATIONS (Frequency Modulation)\n(Noncommercial Educational)\nU30E - Cleveland City Board of Education, Cleveland, Ohio (Charles H. Lake, *\nSupt.) - Modification of construction permit (B2-PED-71, as modified) which\nauthorized changes in noncommercial educational Broadcast station, for extension\nof completion date.\nITHA-PM - State of Wisconsin-State Radio Council, Madison, Wisconsin -\nModification of construction permit (B4-PED-59, as modified) which authorized\na new noncommercial educational \"broadcast station, for extension of completion date.\nKPVM- School District #4, Lane County, Oregon, Eugene, Oregon - Modification\nof construction permit (B5-PED-68, as modified) which authorized a new noncommer¬\ncial educational \"broadcast station, for extension of completion date.\nWBEZ - Board of Education, City of Chicago, Chicago, Illinois -\nModification of construction permit (BPED- ^80) which authorised a new noncommer¬\ncial educational PM \"broadcast station, for extension of completion date.\nWJUH - Junto, Inc., Philadelphia, PA. - Modification of construction\npermit (B2-PED-63) which authorized a new noncommercial educational PM Broad¬\ncast station, for extension of completion date.\nFEW-KALE, Inct, Portland, Oregon (Box 31, Portland 7, Oregon) - Construction\npermit for a new remote pickup Broadcast station to Be operated on 2 frequencies\nwithin 152-160 me. Band power of 2 watts emission special for PM hours of operation\nin accordance with Section 4.403."
}