{
  "id": "d1216-8",
  "text": "-9-\nIB3E-FM BROADCASTS COMPREHENSIVE SCHEDULE\nWBOE-FM (N-A-E-B member in Cleveland, Ohio) broadcasts a remarkably complete and\nuseful system of broadcasts to the various public schools of Cleveland. Under\nthe direction of Edwin Helman, WBOE-FM transmits from the LaFayette school, and\nproduces programs in the Administration Building of the Cleveland Public School\nSystem.\nPrograms are keyed to age and grade levels throughout the school system, furnish¬\ning special supplementary material to the various courses of study, and are keyed\nin by teachers, trained in radio utilization, to add interest and authority to the\nregular curriculum.\nTypical of the approach is a program called \"The News: Places and People”, for\nJunior High School social studies classes. On April 14 in observance of^Pan-\nAmerican Day, four students, representing Latin America and the United States, set\nright common misunderstandings about the customs and the attitudes of their\nrespective nations. Participants included students with national backgrounos\nrepresenting Mexico, Uruguay, and other countries in North and South America.\nUNITED STATES DEPARTMENT CF AGRICULTURE IN TELEVISION RESEARCH\nWith a special grant of funds from the research section of the Hope—Flannagan\nBill, a nev; television research project has been set up to explore the possibili¬\nties of effectively presenting agriculture and homemaking subject matter by\ntelevision. Emphasis will be on effective programming within the cost limitation\nof Federal, State, and local agricultural agencies. As programming knowledge\ndevelops, field studies on audience reactions will begin and efforts will be made\nto devise video appeals of interest to both farm and non-farm views since USDA\nsubject matter interest is not confined to rural people. USDA * s _ new television man\nis. Tom Noone, whose record includes experiences with KFH, KFI, LHC and the Armed\nforces Radio Service._____\nRFD MEETING IN WASHINGTON\nRadio Farm Directors, organization of farm radio men, are meeting in Washing¬\nton April 27, 28, 29. Opening session is in room 3711, South Building, United\nStates Department of Agriculture, beginning at 9:00 a.m. sharp. RFD presi¬\ndent Charles Worcester, Station WMT, Cedar Rapids, Iowa, reports a visit\nto the White House has been arranged and meeting of great interest to both\ncommercial and non-commercial farm broadcasters.\nRADIO IN THE WEST\nWESTERN Radio Conference held its first annual meeting in San Francisco March 20\nand 21 and voted to hold its 1949 session in the same city. Two hundred delegates\nfrom California, Nevada, Colorado and Oregon, representing educators, network, and\nindependent radio operators attended.\nThe conference agreed that radio is a ’’must” in education and that radio must con¬\ntinue to produce programs beamed to the masses. Dr. Harold H, Fisher, chairman\nof the Hoover Institute and Library, Stanford U., characterized radio as the most\nadaptable medium to explain education to a critical public.\nWilliam Delmar formerly program director, KSMO, San Mateo, California, is quoted\nas saying, \"We plead with the educators to help us develop educational programs\nand to participate in them. Educators weren’t ready to meet the challenge."
}