{
  "id": "d1813-1",
  "text": "•will actually be built at Sneedville where Ch. 2 is reserved for ETV since only a\nUHF frequency is reserved at Knoxville, This station will have studios at both\nKnoxville and Johnson City and will serve all of eastern Tennessee. The appropriation\napproved by the legislature is not contingent upon the receipt of matching Federal\nfunds, although the state plan envisions requesting $1 million in Federal funds when\nthey become available.\nNAEB CONDUCTS SURVEY HE STATE ETV FUNDS\nIn view of the fact that the 1963 supplemental appropriations bill now being\nconsidered by Congress includes a request for funds to implement the Federal ETV\nFacilities Act during the current fiscal year (which ends June 30, 1963 )> the NAEB\nsent (on Feb. 18) a questionnaire to all State ETV Agencies to determine what funds\nsuch agencies have available (or can obtain for ETV construction) which would not\nbe available after June 30, and thus would be lost to them unless Federal matching\nfunds are forthcoming. The source of such funds was also asked. This information,\nwhen received, will be passed along to the HEW ETV office for their information.\nUHF CHANNEL RESERVED FOR ETV IN COTATI, CALIF.\nBy Report & Order (Feb. 13), the FCC finalized rulemaking in Docket 14779\nand assigned Ch. *16 for noncommercial educational use in Cotati, Calif., and\ndeleted that commercial channel from Pittsburg. This stems from a petition by the\nSonoma State College Foundation, Inc., of Cotati.\nMISCELLANEOUS FCC ACTIONS\nOn Feb. 6, Monterey (Calif.) Peninsula College requested institution of\nrulemaking proceeding so as to reserve Ch. 35 (Salinas-Monterey) for educational\nuse. (This reservation was recommended in the NAEB*s recent channel allocations\nstudy.)\nCarmel-Clay Schools (Carmel, Ind.) filed an application (Feb. 7) for CP for\nnew educational FM station to operate on 91*3 me, at 10 v.\nFCC granted (Feb. 8) CP to U. of Maine (Orono) for a new ETV station to\noperate on Ch. 12; ERP 299 kw visual and 150 kw aural; antenna height 990 ft.\nGranted (Feb. 13) CP to U. of Bridgeport (Conn.) for new Class D noncommercial\neducational FM station to operate on 88.1 me, 10 w.\nBowling Green (Ohio) State University filed an application (Feb. 13) for a\nCP for a UHF ETV station to operate on Ch. 70, with Visual ERP of 8.6l kw and Aural\nERP of 4.12."
}