{
  "id": "d1813-15",
  "text": "-16-\nSTATE RADIO COUNCIL REPORT FROM WISCONSIN\nThe December 20th report of the Wisconsin State Radio Council provides information\nabout the development of the Wisconsin FM, network and other matters of interest to\nNews-Letter readers.\nConstruction Proceeds in Spite of Bad Weather\nIn spite of severe weather, the V & E Concrete Construction Co., which was awarded\nthe contract for the Highland station, has gone right ahead. Transmitter house\nfoundations were completed some time ago, and wall blocks are now being laid. Tower\nfoundations have also been completed to the point of installing anchor bolts and\npouring concrete for the legs at the first sign of moderate weather. The tower is\nscheduled.for delivery during the first quarter of 19$2, and Westinghouse has been\nrequested to deliver the transmitter in March. Copper priorities may cause some\ndifficulty in procuring the transmission line, but this hurdle does not seem insur¬\nmountable.\nIn Brule an excellent cooperation working relationship has been established with the\nState Conservation Department, a relationship which will result in mutual advantage\nand economy.\nSite is Near Brule\nThe site selected by Technical Director Glenn Koehler and Chief Engineer John H.\nStiehl is about eight miles south of Brule, in the vicinity of a tower maintained\nfor forest fire prevention by the Conservation Department. The ^00-foot steel tower\nto be,erected for the FM station can provide higher observation facilities and im¬\nproved Forestry Conservation Communications through mounting an antenna and trans¬\nmission line on the radio tower. In return, the Conservation Department will build\nan all-weather road from Highway 27 to the site and assist in arrangements with\nDouglas County authorities for snow clearance. The Conservation Department is also\ncooperating in arrangements for a three-phase power line to the site.\nIdeco Division - Dresser Equipment Co., which has fabricated and installed all of\nthe other state FM towers, has agreed to provide the Brule tower at the same price\nquoted for the Highland tower plus only a small addition for the extra freight\ncharges. The necessary allotment of steel has been made by the NPA. Essentially\nthe same transmitter house and tower foundation specifications will simplify con¬\nstruction problems. Chief Engineer Stiehl is scheduled to make an early trip to\nthe northwest area to confer with builders and prospective bidders on the contract.\n. Broadening the Base of Program Participation\nWith the addition of DeAlton Neher as Program Coordinator in September, the radio\nstaff has been able to take significant strides forward in the extension of partici¬\npation in programming the state network. This is in line with one of our original\ngoals as defined in the 19h$ legislation which created the Wisconsin State Radio\nCouncil and listed as one of its functions: ,\n\"To coordinate the radio activities of the various educational and informa¬\ntional agencies, civic groups, and citizens having contributions to make to\nthe public interest and welfare."
}