{
  "id": "d1813-23",
  "text": "Complete Text of JCET Statement\nThe complete text of the JCET’s statement follows:\n\"The Federal Communications Bar Association has filed with the Federal Com¬\nmunications Commission recommendations relating to procedures to be followed\nin the processing of television applications. The Joint Committee on Educa¬\ntional Television believes that certain of those procedures, if adopted, will\nhave a most detrimental effect on the development of a nation-wide television\nservice, and for this reason, the Joint Committee is making its views on the\nsubject known to the Commission.\nOpposes FCBA Position\n\"The Federal Communications Bar Association has recommended that in a compet¬\nitive hearing all television applicants should be considered as requesting a\ntelevision facility rather than a specified television frequency regardless\nof the channel specified in the application nd that the Commission should\ndesignate the channel to be assigned to each successful applicant.. Such a\nprocedure would mean that in all communities where VHF and UHF assignments\nhave been intermixed, all applicants for both \"VHF and UHF channels would be\nconsolidated in the same competitive hearing.\n\"The JCET believes that there should be no consolidation between the two\ncategories of applications. If the VHF and the UHF applications are con¬\nsidered separately, it is conceivable that in large cities a number of UHF\ngrants could be made without hearing, thus stimulating earlier development of\nthe UHF service. Adoption of the Bar Association’s proposal would guarantee\nas a practical matter that no UHF grants could be made in any city of sub¬\nstantial size until the consolidated competitive hearing was concluded. Since\nsuch hearings may well take two or more years after the lifting of the \"freeze\"\nand another year or so would be required for construction, the JCET believes\nthat to delay the development of UHF service at the outset may well deliver\nit a blow from which it may never recover.\nIts Flan Would Hasten UHF, Says JCET\n\"The JCET is interested in the development of television on a nation-wide\nbasis to provide a well-rounded commercial and educational television service\nto the people of the United States. In its allocation report of 19h5 the\nCommission itself recognized that it would not be possible to establish a\nthoroughly nation-wide television service in the VHF band alone. Such a\nservice will not come into being until after the UHF band has been developed.\nWith respect to educational television stations, the Commission has proposed\nthe^reservation of seme 127 UHF channels for non-commercial educational\ntelevision stations. Educators may be naturally reluctant to move forward\nwith the necessary plans to develop television stations in the UHF band so\nlong as that service is considered experimental. The only effective way of\nremoving the experimental tag from the UHF band is to have as many UHF sta¬\ntions as possible on the air as quickly as possible. The operation of such\nstations, particularly in the large cities, will also give manufacturers the\nnecessary incentive to produce and market UHF converters and all-band tele¬\nvision receivers. Itfithout the mass, production of such UHF converters and all¬\nband receivers, the development of the UHF band might very well be inhibited\nfor many years. If proof on this point is required, one. need only look to FM\nwhere what hasbeen characterized as the finest aural broadcast service has been"
}