{
  "id": "d1813-6",
  "text": "-7-\ncasting can be an important instrument in the dissemination of information,\nopinion, discussion and interpretation essential to the solving of today’s\ncomplex problems. Radio can also offer, and on a vast scale, meaningful\ncultural experiences to the listener. To this kind of radio broadcasting,\nthe NAEB and KUOM are dedicated.\nOn the following page, we call your attention to some of the outstanding\nNAEB programs you will hear during the coming quarter. To the interested\nlistener, they will bring rich rewards in stimulating thought and high in¬\nspiration.\nWOSU Also ’’Plugs” NAEB\nThe January program bulletin of the Ohio State University Station WOSU also devotes\nmuch space to the tape network. The WOSU story begins:\nWOSU now broadcasts over six hours of NAEB programs each week. These programs\noriginate among the seventy-five NAEB tape network educational stations,\nBritish Broadcasting Corporation, Canadian Broadcasting Corporation,\nCooper Union, Twentieth Century Fund, Lowell Institute, Rocky Mountain\nRadio Council, commercial stations and networks, and university sponsored\nconferences like Ohio State’s Institute for Education by Radio and Tele¬\nvision.\nNAEB tape network disseminates outstanding radio programs produced by the\nabove listed resources by means of magnetic tape recordings. These programs\nare not intended to entertain. They provide information, opinion, discus¬\nsion, and interpretation needed to help solve today’s complex problems.\nCultural broadcasts such as the best in music and drama also are scheduled.\nCONNECTICUT TALKS WITH SOUTH DAKOTA VIA FM\nTwo members of the Stamford, Connecticut police department were recently tinkering\nwith their fifty-watt FM receiver when they suddenly found themselves party to a\nconversation with the Great Plains.\nThe New Englanders normally find their radio contacts within a radius of twenty\nmiles of Stamford but at 11:18 on the morning of December 16 they kept hearing\n’’South Dakota” and ”Minnesota” and descriptions of weather so cold it made them\nwonder if the temperature was not lower than 20 degrees right there in Stamford.\nMorristown, New Jersey, and Ithaca, New York, crackled into the chit-chat too. This\nwas not so unusual for Stamford, but the Western stuff was strictly new.\nPeculiar atmospheric conditions presumably combined to vastly increase the range of\nthe little set. No names were exchanged, but the two New Englanders insist they\nwere talking briefly with members of the sheriff’s office in Sioux Falls, South\nDakota, and with police authorities in Worthington, Minnesota. They have a clear,\nslightly shivery recollection that the temperature was said to be minus 13> in Sioux\nFalls and minus 20 in Worthington, a figure much more frightening to men from Con¬\nnecticut than it is to those from Minnesota I\nMorristown and Ithaca were equally surprised, although none of the Eastern listeners\nrecorded more than the fact that small talk about the weather was exchanged. But,\nas the local policeman put it, ”If it was twenty below where you were, what would\nyou talk about?”"
}