{
  "id": "d1752-0",
  "text": "The National Association of Educational Broadcasters\nVol. I No. 3 Dupont Circle Bldg., Washington 6, D. C. December, I960\nFCC\nRecent UHF TV channel assignment changes affect two ETV stations: Hanover,\nN. H. ETV channel has Been changed from Ch. 20 to Ch. 27- In Hartford, Conn.,\nthe Connecticut State Board of Education's station WEDH (Ch. 2k) has been ordered\nto show cause by Dec. 10 why its permit should not be modified to specify a site\nat 'least 20 miles from the proposed site of Ch. 20 - WATR-TV in \"Waterbary, Conn,\n(current short-mileage separation is 9 miles).\nBoard of Regents of the Universities and the State College of Arizona have\nbeen granted CP for a new ETV station to operate on Ch. 8.\nAllocations rule-making has been started on conflicting proposals to shift\nCh. 7 from Calais to Bangor, Me. for commercial use and the proposal of U. of\nInline to reserve Ch. 10 Augusta, Ch. 7 Calais, and Ch. 10 Presque Isle for ETV use.\nA challenge to the FCC's primacy in ruling on the equal time provisions of the\nCommunications Act has successfully been turned back by WGBH-TV Boston in the U. S.\nDistrict Court. Write-in Congressional candidate David Franklin from Mass. 5th\nDistrict claimed the station failed to afford him equal time on a news interview\nprogram on which Democratic and Republican opponents appeared. The argument was\nheard on a WGBH-TV motion to dismiss the complaint because Mr. Franklin had not\nfirst asked the FCC for relief.\nFUTURE OF HAGERSTOWN ETV EXPERIMENT?\nContinuance of the famous Hagerstown experiment, nation’s most ambitious ven¬\nture in classroom television, depends upon the people of Washington County which\nwill be obliged to underwrite the cost when the $1 million grant from the Ford\nFoundation expires next July. The 5-year program, carrying TV instruction into\npublic school classes at every grade level in the county has been a major showcase\nfor ETV and Hagerstown has been visited by thousands of educators, administrators,\ntrustees, school board members from all over the nation and the world.\nThe County Board of Education has asked the Commissioners to allocate sufficient\nfunds in next year's budget to continue the closed-circuit TV operation. It pointed\nout that it will cost more to drop the TV project than to continue it, since ending\ninstruction by TV would require hiring 25 additional high school teachers at a cost\nthat would wipe out any saving. Furthermore, another 105 teachers would be needed\nto provide music, art and foreign language instruction (which are now taught entirely\nby TV) at the elementary level.\nBarents and teachers will make their views known at a public hearing Dec. 1.\nTHE ELECTION\nIt is generally agreed that the Kennedy administration has a greater apprecia¬\ntion of the importance of broadcasting than any in history. President-elect\nKennedy’s answer to whether he could have won without the \"Great Debates\", was \"I\ndon't think so.\" Current study of regulatory agencies ordered by Kennedy to improve\n\"the effective dispatch\" of agency business and other indicators show that the admin¬\nistration will keep an extremely sharp eye on regulatory aspect of government.\nFCC will get a new chairman with Comr. Robert B. Bartley the probable selection.\nOther possibilities: Comr. Craven, Kenneth Cox, Seattle attorney; Ed Shelton, ABC\nvp; J. Leonard Reinsch, exec. dir. of the Cox stations. Chmn. Ford is expected to"
}