{
  "id": "d87-28",
  "text": "26.\nto convey the official greetings of the Commonwealth of Massachusetts as well as\nmy best wishes. The hosts for the meeting, the University of Massachusetts, the\nMassachusetts Board of Educational Television, and the WMETV, Inc., are to be\ncongratulated for bringing together some of our finest educational broadcasters and\nI know much of a constructive nature will be accomplished during your conference.\nThe future of ETV looms large and it is to persons of your background and know-how\nthat the public now leans for enlightenment and guidance.” Signed: Christian A.\nHerter, Governor of Massachusetts.\nMiss Daniel then introduced Mr. Lawrence Creshkoff, assistant director of pro¬\ngrams for WGBH-TV, and former NAEB-recommended Fulbright scholar in Paris. Mr.\nCreshkoff spoke as follows:\nnThank you, Miss Daniel, and thank you all. I'm not going to speak much tonight\nas I have some pictures and we've been thinking in terms of audio-visual education.\nWe all know one picture is worth 1000 words.\n’’Last year I was privileged by the opportunity presented to NAEB to spend 10\nmonths in France with the French Broadcasting System. For nine months, I had\nalmost no responsibilities and almost everyone I talked to would listen at least\nsympathetically for a while. One of the most interesting parts of the stay was the\nopportunity to observe the European TV Network in action. In 1952, for one week\nthe French and English Broadcasting Systems exchanged programs. Then, for the\nCoronation in 1953 the TV programs were sent to France, Belgium, Holland, West\nGermany, and Berlin. (Slides of maps, etc. illustrate these remarks.) The number\nof miles involved in transmitting was not much greater than from New York to the\nmiddle of Ohio, but with the problems of frontiers, language barriers and a different\nset of standards in the various countries, there were many problems. Last year\nplans were made to include, for a real European exchange of programs, 8 different"
}