{
  "id": "d87-44",
  "text": "NATIONAL ASSOCIATION\nof\nEDUCATIONAL BROADCASTERS\n14 Gregory Hall Urbana, Illinois\nSeptember 3, 1957\nFROM:\nRE:\nALL ACTIVE AND ASSOCIATE 1-EI.fBERS IN REGIONS I, III & V\nHarry\nrr/E AND ASSOCIATE MEMBER\nT. Skornia ^j‘\nNOMINATIONS FOR REGIONAL DIRECTORS\nAs you will recall the NAEB Constitution calls for Directors to be nominated\nand elected by the members within their respective regions. YOU ARE HEREWITH\nINVITED TO SUBMIT NOMINATIONS FOR REGIONAL DIRECTOR FOR YOUR REGION. Naturally,\nany nominee must be from a member institution within your region. (The states\ncomposing each region are listed in the front of the NAEB Directory.)\nAll nominees for the Board of Directors will be announced at the Annual\nConvention in St. Louis, and the election will be conducted by mail as soon\nas practicable after the Convention, to preclude the possibility of election\nof the same persons as officers and Board members.\nThe NAEB Board is in effect, with the officers, the organization^ policy\ncontrol committee. Persons of mature judgment are therefore essential.\nSince the NAEB is not able to pay travel expenses for all Board meetings,\npersons selected should be able to travel when necessary, which involves\na contribution by his institution or himself in both time and expense on\nbehalf of the Association. Since the membership is itself, in effect, the\nlegislative body of the Association, Board members are more nearly comparable\nto ’’members of the Cabinet” and as such should have a broad national outlook\ninstead of only a regional one. And finally, since good Boards are charac¬\nterized by dynamic group thinking and discussion, as originators of policy,\nrather than merely voting on individual items submitted to them for comment\nby the President, forthright, broad, educational thinking is an important\nqualification.\nDirectors who will be serving for another year are Vernon Bronson (il),\nRichard A. Vogl (IV), Edwin H. Adams (VI) and Gertrude Broderick (at large).\nNo nominations are called for in these spots until next year.\nPresent incumbents for the regions from which Directors are to be elected\nthis year are as follows: Region I - Mr. Arthur Weld, Jr., Station WAER-FM,\nSvracu.se University, Syracuse, New York; Region III - Miss Ola Hiller, Station\nWFBS-FM, Flint Public Schools, Flint, Michigan; Region V - Mr. Robert Schenkkan,\nDepartment of Radio-TV, University of Texas, Austin, Texas. (NOTE: Although\nMr, Schenkkan was elected only last year, he was elected for only one year to\nfill the vacancy created when John Schwarzwalder moved out of Region V.)\nNOMINATIONS MUST BE RECEIVED AT NAEB HEADQUARTERS NOT LATER THAN SEPTEMBER\n25, 1957. Please do not fail to send yours in,\nHJS/dfc"
}