{
  "id": "d1409-11",
  "text": "-11-\nNAEB Headquarters\nHi Gregory Hall\nUrbana, Illinois\nAn Experiment in Low-cost, Low-power Television\nBy W. Worcester Smith*\nThe Engineering Committee of the Western Massachusetts Educational Television\nCouncil has received various reports of experiments carried out by the Armed Forces\nin low power television broadcasting in isolated outposts. One of these is located\nin Limestone, Maine, and another in the Azores. Eventually these may spread to the\nfar corners of the world. Some of the reports sounded exciting and others contra¬\ndictory. Through the kindness of Dr. Hariy Lyle of the Massachusetts Board of Edu¬\ncational Television, and Mr. E. G. Sherburne of WGBH-TV, the writer was able to talk\nwith Major Peter 0. E. Bekker of the U. S. Air Force,who is in charge of the project\nin Maine. It is hoped that this report will clear up some of the misconceptions and\nshow how Major Bekker*s work will assist educational broadcasters.\nThe U. S. Air Force is operating a low-power television transmitter at the Lor-\ning Air Force Base in Limestone, Maine. In sharp contrast to the conventional tele¬\nvision stations that have an effective radiated power of nearly a quarter of a mil¬\nlion watts, this station has a ten watt transmitter and loses more than half of this\nin a long transmission line so that only four watts are actually radiated. This is\nabout one-ninth the power of one automobile headlight. Despite the low power, the\nstation has \"fans\" thirty to forty miles away. The nearest commercial station is in\nBangor, l£0 air miles away, and the nearest station on the same channel (VHF Channel\n8) is on the summit of Mt. Washington, almost 22 £ miles away.\nIt is important to keep in mind that this station operates on one of the unused\ncommercial channels that was set aside by the F.C.C. to serve the area. If a com¬\nmercial station were to apply for a license for this location, the Air Force station\nwould have to go off the air. There is nothing in this experiment that indicates\nthat the F.C.C. would authorize the addition of a low-power educational television\nstation in a state like Massachusetts where no VHF channels are going begging. On\nthe other hand, in more sparsely settled parts of the country there may be channels,\nso far unclaimed, that could offer a valuable service for a very modest expenditure.\nLimestone, Maine, is located on the Canadian border in the northeast corner of\nthat portion of Maine that projects up in between the provinces of New Brunswick and\nQuebec. Caribou, ten miles away, is the nearest large town. Its population is\n10,000. Presque Isle, which is double this distance, has a population of 11,000.\nIt was chosen for this experiment because it is so far away from other television\nstations that the conditions would be similar to those found in air force bases out¬\nside the continental United States, and yet close enough to major centers, such as\nBoston and New York, that supply and maintenance problems during the year«s trial\nphase would not prevent the completion of the project. Experience has shown that\nservice men and their families, living in remote bases, miss the television programs\nthey had at home. The tiny transmitter at Limestone has proved to be a powerful in¬\nfluence in sustaining the morale at the air base. It has also been a boon to the\ncivilians in the surrounding communities.\nThis experiment offers great promise to those interested in educational tele¬\nvision in places where VHF channels are available because the initial cost is low\nand the operating budget is minimum. The original studio was only eight by twelve\nfeet. A clever arrangement whereby a low priced (vidicon) camera could be swung\nto shoot “live1’ broadcasts through the glass window of the studio, or to a film or"
}