{
  "id": "d1409-3",
  "text": "-3*\nTV Technical Tips No. 7\n(April, 1955)\nCecil S. Bidlack, NAEB TV Engineer\nDeadline for copy for the April Newsletter passed last week while the NAEB TV\nEngineer was in New York attending the 1955 IRE Convention. As we write this on\nour return to the office (March 28), we*re not sure whether these engineering notes\nwill be stapled with the rest of the Newsletter or just be mailed in the same en¬\nvelope. At any rate, we hate to spoil our record and-miss an issue of the Newsletter\neven though the \"vital” information given in this column might not be raissecfl So “\nif this seems like an afterthought, it*s just that this month the deadline meant\njust that, especially since ”Roz\" Biason was leaving us for the Far East on the dead¬\nline date. This column wishes her a good trip, the best of luck and happiness in\nher new position.\nIt isn*t exactly news, but the announcement of the 1955 TV Engineering Workshop\nwas mailed March 25. We hope we missed no one who would be interested in attending\nthis year. Just as a reminder, the date is September 12-16 and the place is WKAR-TV\nin East Lansing, Michigan. If you didn*t see the announcement of the Workshop, drop\nus a card at NAEB Headquarters and we *11 see that you receive a copy.\nSpeaking of the Workshop, our trip to the IRE Convention provided an oppor¬\ntunity to discuss the program of the Workshop informally with representatives of\nequipment manufacturers. To date, all we have talked with have assured us of their\nwillingness to cooperate in the 1955 TV Engineering Workshop and we expect that\nothers will express the same willingness when contacted. Details of the program\nare yet to be worked out, but from the response so far, we feel that a very full\nand worthwhile program will result.\nAt the Institute of Radio Engineers Convention some fifty-five sessions were\nheld, at each of which some four or five papers were presented. Exact number in\nattendance is not available although some 1*0,000 were ejected to attend. Within\nthe membership of IRE, there is a subdivision according to major interest, of 23\nprofessional groups ranging from Aeronautical Electronics to Vehicular Communica¬\ntions. Consequently at the Convention there are papers presented of interest to\neveryone, even to a symposium on electronic controlled space stations. Of inter¬\nest to broadcast and television engineers were those sessions on video tape record¬\ning, and color television as well as one paper on a tricolor vidicon experimental\ncamera tube for color television.\nThere were 70U exhibits which filled the Kingsbridge Armory and overflowed into\nthe Kingsbridge Palace nearby. All available Convention papers will be published\nin the 1955 Convention Record. The Convention record is published in ten parts\naccording to subject, and will be available in June, 1955* For further informa¬\ntion write The Institute of Radio Engineers, 1 East 79th Street, New York 21, N. Y.\nJohn Klindworth, Field Engineer of the Allen B. DuMont Laboratories stopped\nduring the month. He reported 1*7 DuMont Multi-Scanners in use and this morning*s\nmail brought a card announcing installation of #i*9« This office has available a"
}