{
  "id": "d1409-3",
  "text": "Gleanings from Varied Sources\nTo the agricultural institute at Allahabad, the head of\nwhich is Dr. Sam Higginbottom, belongs the credit of estab¬\nlishing the first rural broadcasting service in India. The gov¬\nernment of India has just given to the institute a license to\nbroadcast its programs, but the local government will most\nprobably appoint a censor. Mr. Mason Vaugh, the engineer\nof the institute in charge of the broadcasting scheme, hopes\nto make the test transmissions by the end of this month or\nearlier. The formal opening of the broadcasting station of the\ninstitute is expected to take place on February 27, when a\n“farmers’ fair” will also be inaugurated, and the programs to\nbe broadcast for the first four days will be the evening pro¬\ngrams of the fair. It is proposed to put up, for the present, six\nor seven receivingsets in different villages in the Allahabad\ndistrict. Other centers will be selected as opportunity offers.—\nCorrespondence from India, Christian Century 52:374, March\n20, 1935.\nBy careful planning and selection it was found possible\nto cover the fundamental grammar topics of a complete ele¬\nmentary course in German, including a basic vocabulary of\napproximately 1400 words, in forty-eight broadcasts of fifteen\nminutes each. . . . From comments and inquiries which we\nhave received and from our own study of the best arrangement\nfor meeting the needs and desires of the greatest number of\ninterested people who want to take advantage of this educa¬\ntional opportunity ... the time for broadcasting “has been\nchanged to a more favorable hour. This year, therefore, the\nschedule has been changed so that the lessons will be broad¬\ncast three times a week, Monday, Wednesday, and Friday at\n6pm. This will enable us to complete the course in sixteen\nweeks.—E. F. Engel, professor of German, University of\nKansas.\nThe listening public should have up-to-the-minute news\nbroadcasts from reliable sources, uncolored by an advertiser’s\nsponsorship. They should be paid for out of the vast annual\nvalue of channel occupancy for advertising use and should not\nhave to be provided at the expense of newspaper publishers.\nOrganizing of additional news-gathering services to compete\nwith the established ones ought not to be necessary. For rea¬\nsons of economy, it should be preferable to arrange on an\namicable business basis for suitable bulletins to be supplied\nby reliable established agencies.—Chicago Civic Broadcast\nBureau, Brief, submitted to Federal Communications Com¬\nmission, November 24, 1934, p9.\nIt seems to me that purveyors of entertainment have no\ngreater responsibility than providing safe and stimulative play\nmaterial for the children of the race. No doubt there is a lot\nof apron-string nonsense current about the effects of robust\ngames, but it is also not to be doubted that certain vicious\npatterns drawn on the printed page, screen, or over the air\ncan disastrously influence children.—Marlen Pew, “Shop\nTalk at Thirty,” Editor and Publisher, March 16, 1935, p44.\nPatterns of Loveliness is the title of a series of character¬\nbuilding radio dramas given each Monday evening from 8:15\nto 8:30 thru the facilities of the Yankee Network. These\ndramas are prepared under the direction of Joseph B. Egan,\nauthority on character training, and master, Harvard School,\nCharlestown, Massachusetts. Each unit consists of a drama¬\ntization, prepared by professional writers, of some great\nmoment in biography, history, or legendary lore.\nAt our command we have the best the world has produced\nin science, literature, music, drama, and other wholesome\nentertainment. We must not fail to take advantage of this\ngreat opportunity. We must not turn radio broadcasting into\na grotesque side-show by producing obnoxious programs. . . .\nThe Federal Communications Commission looks to station\nowners, and not to the sponsors of advertising, to present and\nbroadcast programs in the public interest and therefore can\nonly hold station owners responsible. ... I would not care\nto have the impression go forth that we expect every adver¬\ntiser or every broadcasting station to go on the air with high-\npriced stars or symphonies. . . . We do expect, however, that\nregardless of the cost, or the variety, or the type of entertain¬\nment produced, it will be clean and wholesome.—Anning S.\nPrall, chairman, Federal Communications Commission, in a\nradio address, April 10, 1935.\nMisleading claims and deceptive advertising by manu¬\nfacturers, notably the “ethical” drug and pharmaceutical\nhouses, have led the public to purchase dangerously ineffective\nantiseptics and germicides and have created many erroneous\nimpressions regarding the potency and limitations of anti¬\nseptics and germicides in general. No advertising, not even\nthat in reputable medical journals, can be relied on in this\nrespect. As Consumers’ Research subscribers know, the weak\nand ineffective food and drug laws have no control whatever\nover advertising of antiseptics; consequently, the manufac¬\nturers can make all sorts of wild and misleading claims thru\nadvertisements in newspapers and magazines, billboards, car\ncards, and over the radio, that cesspool of shady advertising.—\nConsumers’ Research Bulletin 1:7, April 1935.\nThe University of Denver has recently installed a “lie\ndetector” in the speech department to aid students of speech.\nThe object is to check up on the nervousness of an individual\nwhen speaking, even tho he may appear outwardly very calm.\nThe galvanometer, then, will indicate any emotional changes\ndue to stuttering, untruths, lack of confidence, or other causes.\nThis same type of study has been used in the physics depart¬\nment of the university, and the findings show that the best\nspeakers had a minimum of emotional disturbance.\nEducation by Radio received on time. I hold up both\nhands to what you say in April 18 issue. I have a twelve-year-\nold boy. What haven’t I bought! I am told to “stick ’em up”\nat almost every corner. Some programs I have absolutely for¬\nbidden. It is hours sometimes before he goes to sleep. I find\nthe light on in the night—excuse—bad dreams. So it goes.\nThe appeal to children over parents’ heads is a real menace.—\nA New England School Superintendent.\nThe sustaining programs emerged with honors. They\nwere usually more thoughtfully planned and better chosen\nthan programs with a commercial sponsorship.—A. Walter\nKramer, editor, Musical America, New York Rimes, April\n14, 1935.\nSpeaking of books, authors, and newspaper publicity, it\nis said that much interest is being aroused in the Bible as a\nstorehouse of radio invective.—New York Times, March 15,\n1935.\nAn investigator reports that in Missouri and Arkansas\nhillbilly crime is decreasing. Probably not decreasing—just\ntransferred to the radio.—Providence News-Tribune.\n“Where there is no vision, the people perish.”\n[24]"
}