{
  "id": "d1409-8",
  "text": "-8-\nOne of the most interesting papers and demonstrations at the recent SMPTE Con¬\nvention was given by George Colburn of the George W* Colburn Laboratory, Inc. of\nChicago on \"Experimental Considerations for 8mm Kinescope Recording.\" Sounds\ncrazy, you say? That’s what most everyone thought until fir. Colburn demonstrated\nby showing one of his kines and everyone marvelled at the results.\nMr. Colburn photographed the pictured on an ordinary home receiver without modi¬\nfications. He built a special camera operated at 15 frames per second which\ncontained an optical viewfinder. By looking through the viewfinder, film and\ncamera lens at the TV screen, he was able to hand rotate the driving motor field\nso as to eliminate shutter bar. bound was picked up on a mike set in front of\nthe TV receiver speaker and recorded on a \"home\" type tape recorder at 3 3/4\ninches per second. To get sound on film, Mr. Colburn played the tape back on\nhis recorder, picked it up on another microphone and recorded it upon a magnetic\nstripe on the 8 mm film.\nThe results were amazing, I’ve seen many 16 mm kines with much poorer picture\nquality and in spite of the roundabout sound pickup through two loudspeakers, it\nwas surprising. The paper was presented in a very charming and droll manner with\nthe Mr. Colburn’s prize line being- \"Here is truly a \"low-fi\" Kinescope recording.\"\nttiiiiXXX-ycKXK\nCne of the features of this years Institue for Education By Radio-Television was\nthe presentation of diplomas to those who had attended the first Institute in 1930\nand who had demonstrated continued interest in educational broadcasting. Of\nthe nine persons who were present to receive their diplomas as \"Ohio Institute\nPioneers\" three were engineers; Carl Menzer, Director of USUI; Bob Higgy, Direc¬\ntor of UOSU, and Cec Bidlack, NAEB TV Engineer.\nOur only regret is this percentage of representation of engineers could not be\nmaintained for the Institute and also for the NAEB Convention as well. As a\nmatter of fact, with the exception of equipment representatives, we were proba¬\nbly the only engineers attending the Institute. True, there were no technical\nsessions listed on the program, however many of the sessions held interest for\ntechnical personnel. Engineers need to get away from their routine occasionally\nto broaden their outlook and to meet others in the field outside-the (Confines, of\ntheir own establishment. We know that travel funds at educational stations and\ninstitutions are limited yet we feel that more should be done by management to\nencourage technical personnel to make an occasional trip. We’d like to see more\nengineers at the Institute, the NAEB Convention or at technical societies conven¬\ntions such as the IRE, SMPTE or AES. There, they will meet fellow engineers,\nshare and discuss their mutal technical problems, as well as keep up with the\nprogress of the art by hearing the technical papers presented.\nWhile we’re on the topic of trips for technical personnel, why don’t you station\ndirectors or managers reading this encourage your technical personnel to apply\nto attend the 1955 NAEB TV Engineering Workshop to be held at WKAR-TV, East\nLansing, Michigan, September 12-16. This will not cost your institution anything\nexcept the time the engineer is away from his work. All travel expense will be\npaid as well as <$40.00 which will more than cover meals and lodging while there.\nThe benefits to be gained are many and include the increase in technical knowledge"
}