{
  "id": "d948-46",
  "text": "F\n%*ptmb*r 29, 1954\nMr. Robert VttnDuyn\nAaaociat# Director\nDivision of Education\nW. K* Kellogg Foundation\nBattle Creek, Michigan\nDear Bobs\n4a Dr. Seay My ham told you, I had tha pleasure of Mating hi* tad\nvisiting tha Kellogg Foundation for tha fir at tlM a weak ago today, whan I vaa\n<» nr way through BatUa Croak fro* othar Mating*. I'» aorry it waa at a tlae\nwhan you weren't yat back, but hopa X aay pm that way again noon. Although X\niMgina thia find* you atill in tha unpacking ataga, I thought it night ba daelr-\naUa aa aoeu a* poaaibla to gat bafera you one rathar 1 ini tad request whiah night\naffaot next year'a grant.\n^ Thla_ apaoifioally conoarna tha faet that wa now bar* an Aaaoeiata\nClraotor, ilarold E. Bill, aa a part of tha ragular Headquarters' ataff. By tha\nbaginning of the next fiaaal year, Harold will haw* bean with ua approriaataly\na yoar and a half. Howowar, unlaaa budgetary prowiaion for hla aalary aan ba\naddod to the oarUor approved Kellogg grant expeeted for the 1955-56 flaeal year,\nwa should haw* to drop Harold a yoar before the expiration of the reat of tha\npraaent Kellogg grant.\n_ _ J baUow* that by tha and of the year and a half h# will have aervad\nby the and of June, Harold wUl daaarwo a raise in aalary. I hop* to raecnand\nto the director* aa inaraaa# of com thing on tha order of #800.00, far an animal\naalwy of ,8,000.00 par year. Adding to thia tha 4623.20 ratiraaant and $120.00\nworkMn'a eoopanaation ehargaa which tha budget would alao haw* to earry, thia\nwould Mk* a total of #8,743.20, not including any adainlatratiwu charge, which\nX m aura we could absorb.\nXnaaMch aa X feel w* owe it to Harold to know what tha proapaeta are\nfor tha coring yoar aa aeon aa poaaibla, X hope you do not rind ay roquaat far an\nopinion an thia natter aa aaon aa possible. Granting it would not ba Interpreted\nas a decision on tha part of tha V, I. Kellogg Foundation to extend it* eomit-\nMKta beyond tha period already decided upon. For thia nor* basic problem X a*\nsure wa all agraa war* tlM and nor* fundamental examination of all the issues\nand poaaibilitiaa inwdwod will ba naesaaary."
}