{
  "id": "d1762-5",
  "text": "-7*\nconvinced of the value of these programs and it is feeing planned to extend them\nwhen located in the new building.\n\"We are in favor of the efforts feeing made of preventing the commercial stations *\nsqueezing the educational stations out of the broadcast band. A special educational\nband assignment is, I believe, very desirable.”\nFrom Mr. H. H. Gislason, University of Minnesota, Minneapolis, we have received\nthe fallowing summary as to information supplied members of Congress and others:\n\"In answer to your circular letter, we are giving you information below, as\nrequested.\n”1. Power, 500 watts. Frequency, 1080 kc. Wave length, 278 meters. (Prior\nto June 1927.)\n2. Po^’er, 500 watts. Frequency, 1220 kc. Wave length, 245.3 meters. (June 1927.)\n3. Power, 1000 watts. Frequency, 1250 kc. Wave length, 239.9 meters. (1929)\nWe have had this frequency since.\n4. Our University station, WLB, shares time with three other stations: WCAL,\nCarleton Collage, Northfield; EFMX, St. Olaf College, Northfield; WRHM,\ncommercial station, Minneapolis. These four stations have a full regional\nchannel both day light and evening time. On an average the commercial station\nhas used better than 100 hours a week and the three educational stations have\nused approximately 20 hours a week. Our own station is broadcasting about\n7 hours a week.\n5. We have had more or less difficulty all the time in dividing time with a\ncommercial station. About two years ago we requested the privilege of broad¬\ncasting our own bootball games Saturday afternoons. Commercial station denied\nthe request and we wired Commission at Washington. Commission ruled in our\nfavor. This is about the only clash that has come before the Commission.\n6. About a year ago WRHM signed an application with the Federal Radio Commission\nrequesting the time now used by the two Northfield stations but not requesting\ntime used by the University station. Later this application was amended by\nWRHM to include the time of all the educational stations so that WRHM should\nhave a free channel. The three educational stations have filed an answer to\nthis in the form of an application for modification of license requesting all\nthe time now used by WRHM so that the three educational stations will have the\ncomplete channel. This has not been set for a hearing so far, but we are\nexpecting the hearing to be set at any time.\n\"The radio situation here at Minnesota, we understand, is the subject of consider¬\nable talk in radio circles in Washington. Many believe that we would have an\ninteresting test case and we are going to see what the Commission does to us.\n\"I think this gives you the information you desire.\"\nFrom Mr. Joe F. Wright, Director of Station Y/ILL, University of Illinois, we quote\nthis summary of information supplied members of Congress and others:\n\"1. Value of land, buildings, and equipment as at June 30, 1931 (end of fiscal\nyear).$27,328,871.57 (Entire Uni versity).\n2. Value of Radio Station and equipment: Building and Furniture . . $14,106.63,\nTechnical equipment . . $38,939.65, Total . . $53,046.27.\n3. Radio licenses, frequencies, and power:\na. Under call letters of WRM, obtained first license in March, 1922.\nb. Used 833 K.C. (260 meters) until 1925.\nc. Were then assigned to 1100 k.c.\nd. Nov. 11 (on or before) assigned to 620 to share time with YrCFL and Y'JJD."
}