{
  "id": "d1373-3",
  "text": "NA£B NEWS LETTER,.... . , , PAGE 4.\n, >\\r °ch ! \" , ?.\ninstalled as President or the Association for Education v at\nITS RECENT SAN FRANCISCO MEETING, OTHER A£R OFFICERS : 5 J t . Oc\nBoutwell, U.S. Office of Education and 1. Keith Tyler * Ohio State Univ¬\nersity, Vice-Presidents; Elizabeth Goudy, Los Angeles County Schools.,\nSecretary; Robert Hudson, Rocky Mountain Radio Council, Treasurer; and\nHarold McCarty, University of Wisconsin, Regional Vice-President for\nDistrict III.\nWNYC IN ACTION\nNew York’s municipally operated radio station, WNYC, is making increasing\nefforts to bring residents of America’s largest city authoritative reports\non war and defense activities from British experts via direct BBC programs\nAND NEWLY TRANSCRIBED BBC FEATURES. V.'NYC AUTHORITIES FEEL THAT NEW YORK\nRESIDENTS CAN GARNER USEFUL INFORMAT»ON—PART ICULARLY CONCERNING CIVILIAN\nDEFENSE FROM LONDON SOURCES IN THE AIR-RAID AREA.\nThe FIRST DIRECT OVERSEAS BROADCAST FEATURE CARRIED ON A REGULAR SCHEDULE\nBY THE CITY STATION IS THE BBC “ANSWERING YOU” SERIES WNYC IS AIRING\neach Sunday* Meanwhile the city station is making increased use of tran¬\nscriptions MADE FROM BBC SHOWS OF PARTICULAR VALUE TO METROPOLITAN\nLISTENERS. THESE INCLUDE “(BRITAIN SPEAKS,” HEARD THROUGH WNYC AT 8 P. M.\neach Monday, and “Women of England,'* a series featuring reports on house¬\nhold “blitz” problems by Margaret Bidole, wife of'our Ambassador to\nEngland, The latter series is broadcast sy WNYC each Friday at S p.m.\nNew York's municipal station WNYC added a new series of consumer programs\nto ns growing schedule of “home front” broadcasts on w&gjfijtpAy. March Nth.\nMrs. Grace Allen Bangs, Chairman of the Women’s Division^ York City\nSalvage Committee will be the program guest for the initial broadcast,\ndiscussing “The Consumer Fights The War At Home.”\nThe March 15th broadcast in the new weekly series will .feature a repre¬\nsentative of the Office of Price Administration discussing “Patriotism\nIn The Budget”, while the third program, on March 25th, brings WNYC\nLISTENERS A DISCUSSION OF “PATRIOTISM In COMMUNITY HEALTH,”\nNEW PROGRAMS ON WSUi\nA NEW BULLETIN. TELLS ON NEW SECOND SEMESTER PTQGRAMS ON WSOf, Un}VERS 1 TV\nof Iowa, Among the series: \"Connie Kay,” on how housewives can serve*!\nBEST THEIR COUNTRY; “FAMOUS lOWANS,” WITH WILL I AM R0 BOYD; “The OTHER\nAmericas,” for a better understanding with our American allies, by\nPeter mousolite; \"You Never Know,” a safety series sponsored by Iowa\nDepartment of Public Safety; “Problems of the ivar and After,\" by Prof.:\nHew Roberts.\nF.C.C. ACTIONS\nwRUF, University of Florida, had its application for construction permit\nAND INCREASE OF HOURS OF OPERATION TO UNLIMITED SET FOR HEARING (3/3/42)\nKOAC, Oregon State College, applied for modification of its construction\npermit (3/4/42)\nWNYE, New York City Board of Education, informally applied for extension\ndate on its construction permit(3/4/42). WNYE formally applied (3/14/42)"
}