{
  "id": "d1745-0",
  "text": "Office of Executive Secretary\nUrbana, Illinois\nMay 1, 1939\nPOSITION OPED AT WQI\nWOI at Ames, Iowa is conteraolating adding a staff member. The position is\nsponsored jointly by the Department of Technical Journalism and the Radio\nStation. The work of the person appointed to the proposed position will\ninclude some announcing, presenting §ome news summaries, supervising some\nshorter periods of student handled news broadcasts, preparing some continu¬\nities, conducting some interviews with visiting celebrities. actual\nbroadcasts and in the oreparation of recordings for future nroadcasts*\nassisting in radio publicity material, and spending his Spare time In\npreparation and presentation of other radio material the party becomes\nacquainted with local eondiW®*^. Interested partners are invited to state\ntheir qualifications for the pas£t*o*u_\nFCC ACTIONS\nThe FCC has granted the aoollcatlon for construction permit and the change\nof frequency \"from 1260 to 1220 kilocycles and power from 500 watts daytime\nonly to 500 watts unlimited time, with use of a directional antenna at night.\nThis grant by the Commission to Port Arthur College (KPAC), Port Arthur,\nTexas, was made April 1?«\nThe aoollcatlon of W0SU, Ohio State University, for permission to increase\nits night power from 750 watts to 1 KW has been granted by the FCC,\nWNIO, municipal Broadcasting System, New York, has aoolied for\nof the FCC to modify its license from daytime operation to specified hours-\n§ a6pio to 11 p0iQo, Eastern Standard Time—on 810 KC*\nThe Federal Communications Commission on April 22 granted the petition of\nWHA to continue its hearing, on the application for a construction permit\nfor 50,000 watts and a change in frequency to 670 kilocycles, from *-*ay 1\nto August 1.\nSOUND EFFECTS LABORATORY_AT jVOSU\nWilliam Friel Heimlich, Production Supervisor of WOSU, Ohio State University,\nsays, ‘‘During the past year we have built up our sound effects laboratory\nuntil we now have means of'reoroduoing hundreds of effects. In fact, we\nlike to think our equipment a's good as any in the country for a station this\nslssCo Weekly sound rehearsals on mike are scheduled for the benefit of the\ntechnicians who are always coming up with a new effect. Our recorded library\nof sound is not large, including only about a hundred sounds,, Howaver, otr\ntechnicians have overworked themselves on ’gadgets'5. We have one full-time\nVVPA assistant working on this, and. three students*w"
}