{
  "id": "d1403-1",
  "text": "Officers for the ensuing year were elected as follows*\nPresident* H. B. McCarty, WHA, University of Wisconsin, Madison, Wis.\nVice-President: W. I. Griffith, WOI, Iowa State College, Ames, Iowa\nSecretary-Treasurer: B. B. Brackett, KUSD, University of South Dakota,\nVermillion, S.D.\nExecutive Secretary: Harold Engel, WHA, University of Wisconsin, Madison, Wis.\nCommitteemen t\n1st Zone —- C. A. Taylor, WESG, Cornell University, Ithaca, N.Y.\n2nd Zone — R. C. Higgy, WOSU, Ohio State University, Columbus, Ohio\n3rd Zone — E. P. Humbert, WTAW, Texas A. & M., College Station, Texas\n4th Zone — M. C. Jensen, WCAL, St. Olaf College, Northfield, Minn.\n5th Zone —- F. F. Nalder, KWSC, State College, Pullman, Wash.\nAt Large — Carl Menzer, WSUI, S#ate University of Iowa, Iowa City, Iowa\n#\nFrom the Executive Secretary comes the following communication, of interest\nto all NAEB members:\nA New N.A.E.B. Service -\nFor some time we have discussed the desirability of having a central distribut¬\ning agency to which we could send our bulletins, outlines, scripts, form sheets,\netc., and have them distributed to all of our members. Inasmuch as no action was\ntaken your secretary will take over the task and will hereafter get out a packet to\neach member regularly - provided the members remember to send in their contributions\nto be distributed.\nThis is a good chance to exchange ideas. Let*s send copies of our record\nsheets, file oards, players instructions, speakers suggestions, scripts, and any¬\nthing else in which our members may be interested.\nNow - your duty - please instruct your secretary to send 36 copies of everything\nyou get out to your secretary, Harold A. Engel, Radio WHA, Madison, Wisconsin. Do it\nnow, and we*ll have the first \"prize package\" in the mails in a hurry.\nCONSTITUTION OF THE NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPreamble:\nBelieving that radio is in its very nature one of the most important factors in\nour national and international welfare, we, the representatives of institutions of\nhigher learning, engaged in educational broadcasting, do associate ourselves to¬\ngether te promote, by mutual cooperation and united effort, the dissemination of\nknowledge to the end that both the technical and educational features of broadcast¬\ning may be extended to all.\nARTICLE I.\nMembership*\n(a) Any college or university of reoognized standing engaged in educational\nbroadcasting may be elected to membership in this organization by approval of the\nexecutive committee, and a two-thirds affirmative vote of all active members of the\nassociation. Each member institution shall be entitled to one vote."
}