{
  "id": "d1837-0",
  "text": "NATIONAL ' ASSOCIATION\nOF EDUCATIONAL BRQMDCnSTHaU\nService Report\nJane, 1947\nSETTING UP THU PM S T A T .1 0 N\nBy Ulmer G. Sulzer\nThe University of Kentucky\nTHU m PICTURE FOR EDUCATIONAL INSTITUTIONS :\nRight now, educational institutionshave an opportunity to get into\nradio and own their own stations, that may never oe duplicated again.\nWith the standard \"broadcasting \"band \"bursting at the seams, Frequency\nModulation is the collegeJs hope. Twenty channels, ranging from 88,100\nkilocycles to 91,900 kilocycles, with a two hundred kilocycle separation,\nare reserved for the exclusive use of non-commercial educational agencies.\nRules and requirements for such agencies are much less exacting than those\nrequired \"by the Federal Communications Commission of commercial Broadcasters.\nFurthermore, these educational \"bands are not crowded just now. There is\nthe danger, however, that unless more interest is shown in these frequencies\nin the future, some may he taken away from educators and allotted to\ncommercial interests, which are applying in great numbers for construction\npermits on the other portions of the FM hand,\nWHERE TO PLACE THU STATION\nFor truly efficient operation, the studios, transmitter, and antenna\nshould he located at the same point. The studios and transmitter should he\nlocated in the same layout (a) to avoid the maintenance of two sets of\nengineers and the occupancy of two sets of real estate, and (h) because the\nconventional telephone circuits used to transmit AM programs from studios\nto transmitter are inadequate for FM, and specially engineered circuits that\nwill retain the FM frequency range would he prohibitive in cost for the\nusual educational organization.\nThe antenna must he placed very close to the transmitter because there\nis a high loss in the co-axial cables used to convey the high frequencies\nbetween transmitter and antenna. While the losses vary according to power,\nsize of cable, etc,, it can be safely assumed that if the antenna is as\nmuch as 500 feet away from the transmitter, half the power of the latter will\nbe lost by the time it reaches the antenna. Since the co-axial cable must be\nlong enough to reach the antenna on the top of its tower, it stands to reason\nthat a transmitter and studio location at the base of the tower is ideal.\nIf your campus is located on a hill or even a hump, consider the use of the\nhighest building, or rather the highest floor, on the campus for your purpose."
}