{
  "id": "d1837-3",
  "text": "■4~\nNow for the type of antenna, let’s appeal again to that faculty\nengineer or graduate student. Can he not figure out the dimensions of a\nfour-rhay turn-s;tyle antenna and “build it himself? If not, try one of the\nengineers on your local radio station who’d like to make some extra money.\nHave him purchase some seven-eights inch copper refrigerator pipe with\nproper turn fittings. You ought to get the four-hay job done for $400\n($300 for labor and $100 for materials). In current radio magazines you 11\nsee advertisements for more kinds of I'M antenna system than you can dream\nup. Probably, all of them are serviceable, but the fact that they vary\nso widely in design is adequate proof that no one type is best, and for\ngeneral purposes I believes that tbs four-bay turn-style, engineered to the\nproper dimensions,, will give complete satisfaction.\nNow the transmission line, the gadget that connects the transmitter with\nthe antenna, remains. Ibr any powered PM .transmitter up and including 3,000\nwatts, simply buy some more seven-eights inch hard copper tubing, some one-,\nfourth inch flexible copper tubing, and some lava insulators. The electricians\nin your maintenance department can assemble this co-axial line as they put\nit up. Total cost of 100 feet, including materials and labor, should not\nexceed $100^\nTo recapitulate, the total cost, then, of setting up your PM station,\nexcluding remodeling of building and accoustical treatment, would be as\nfollows;\nTrasmitter, 250 watts\nCombination frequency and modulation moniter\nSpeeoh-input e quipment\nAntenna and tower\nTransmission line\n$5,500.00\n850.00\n3,300.00\n500.00\n100,00\nTotal\n$10,000.00\nOf course, if you already have radio studios, you can skip the speech-\ninput item. Now, if these items haven’t given you too much of a jolt, you\ncan read on.\nLICBNSE PROCHOURS\nYour next step is to send to the Pederal Communications Commission,\nY/ashington, D.C., for three copies of Porm 340, which is your application for\na station construction permit. You must submit two copies and you'll want to\nkeep one.\nLet’s study this form a little. Here are the questions that might\ntrouble you;\n1. Remember, the applicant is your institution, not yon.\n2. Here’s where you put your name.\n3. (c) This is for the name of your president. He’s your executive\nofficer.\nYou will note at the bottom of page 3 that your board of trustees or\nregents have to specifically authorize the application ior a station.\nBe careful to execute either Part II or Part III (whichever applies),\nbut not both."
}