{
  "id": "d1837-4",
  "text": "-5-\nBe sure to answer ’’yes\" to 18 (c)\nRelative to 22 (a), request the RCC to assign you a channel before you\napply.\nIf you are contemplating a transmitter built by a standard manufacturer,\nsimply give the make and model number under 24, and answer the rest of these\nquestions with the phrase \"On Rile with the RCQ.\" That goes for 25.\nQuestions 26 and 27 can be answered by whomever you purchase the frequency\nand modulation monitor from. Whoever builds your antenna can help you with 28.\nt have virtually answered 29. Your civil engineering department and bureau of\nbusiness research can combine forces on 30 and 31, and you can do the rest.\nOn page 20, the line under the date must be the name of your institution.\nYour president, as executive officer, should sign on the line after \"by\".\nIndicate in answer 34 that your station will be completed within six months\n(keep your fingers crossed).\nWhen you submit the application for the construction permit (Rom 340) be\nan optimist and request three copies of the Application for License Rorm.\nYou'll need this when your station is about ready to go on the air. Before\nthat time you'll also want to purchase from the Superintendent of Documents,\nWashington, at the cost of 10 cents each, copies of parts 2, 3 and 4 of the\nrules of the Commission, to avoid transgressing the RCC mandates.\nAfter submitting your construction permit application, some time may\nelapse before you get your grant, if it is in proper form, it will come\nthrough eventually. As soon as it does, write to the Civil Aeronautics\nAdministration, Washington, for copies of their Rorm ACA 117, You should\nfile this at once so you can be promptly informed as to how your antenna tower\nmust be lighted and painted if its height requires that,\nPROGRAMMING- PLANS\nYou will be very wise if you start operations of your RM station with a\nmodest schedule-one that you can maintain after the novelty for your talent\nhas worn off. Here are some ideas for programs, other than those you locally\nproduce, that you can obtain without charge;\nTranscriptions-—-Adventures in Science---supplied weekly by Westinghouse\nTranscriptions—American Medical Association\nTranscriptions-\"This is Puerto Rico\" from the U.S. Office of Education\nTranscriptions—-\"Alcoholics Anonymous\" from WJR, Detroit\nTranscriptions-—Army enlistment office-features movie stars\nTranscriptions—-\"The Treasury Salute\"—U, S, Treasury Department\nTranscriptions-Virtually all college AM stations have literally hundreds\nof transcriptions they will be glad to lend.\nRebroadcasts—Most AM radio stations willingly give permission to non¬\ncommercial EM stations to rebroadcast all of their non-network, sustaining\nprograms. Write for such permission to all AM stations within good hearing of\nthe projected RM station. Copies of the letters of permission must be filed\nwith the RCC.\nRebroadcasts-—t\"Write to the British Broadcasting Company in New York for\nsimilar permission to rebroadcast the BBC overseas service. You'll need a good\nshort-wave receiver to handle these programs.\n(Reproduced by the National Association of Educational Broadcasters from\nCOLLEGE PUBLIC RELATIONS by permission of the editor and author),"
}