{
  "id": "d1253-1",
  "text": "INSTRUCTIONAL TV \"FIXED SERVICE\" APPLICATIONS ACCEPTED FOR FILING BY FCC\nThree new ITV fixed service applications were recently accepted for filing\nby the FCC. These are:\nThe Roman Catholic Diocese of Brooklyn in Brooklyn, a CP for a new station on\nChannels F-l, F-2, F-3, F-4, 10 watts;\nThe Roman Catholic Diocese of Brooklyn in Jamaica, a CP for a new station on\nChannels C-l, C-2, C-3, C-4, 10 watts;\nUnion Free School District #10 at Mineola, New York, a CP for a new station on\nChannels G-l, G-2, 10 watts.\nFIVE MORE ETV GRANTS APPROVED\nApproval of a $200,000 grant to help activate educational television facilities\nin Hershey, Pennsylvania, was recently announced. The grant is made to South Central\nEducational Broadcasting in Hershey to activate reserved Channel 65* Total cost of\nthe project will be approximately $419,552. Coverage will include Harrisburg, and\nAdams, Cumberland, Dauphin, Franklin, Juniata, Lancaster, Lebanon, Perry and York\nCounties in Pennsylvania, serving a population of over 1.1 million.\nThe Board of Education in Ogden City, Utah received a grant for $56,297 to\nacquire two television tape recorders for station K0ET, Channel 9- The recorders will\nimprove service to some 400,000 persons, including an estimated 130,000 students enrolled\nat 180 educational institutions. Total cost of the project will be $75,067*\nA grant for amplifiers to improve transmissions of station KETC-TV, has been\nawarded to the St. Louis Educational Television Commission, for $100,092. KETC serves\nan area that includes 2-J- million persons, including 608,000 students in 1,092 schools.\nTotal cost of improvements will be $133,457*\nA grant for $307,40/ to the University of Washington at Seattle was made to\nacquire a transmitter, tower, antenna, and other equipment for station KCTS-TV. The\nimprovements will enable KCTS-TV to provide new service to 150,000 rural residents and\nbetter transmission to 60 per cent of 84l schools within the area. The additional\npower will extend service to 138 more schools and to a total of half million students\nover 11,944 square miles. Total cost of these improvements is $4l8,401.\nA giant for $71,606 to the Board of Public Instruction in Dade County, Florida,\napplies to station WSEC, Channel 17, and WTHS, Channel 2 in Miami. The grant will\nprovide new equipment to improve service to nearly T| million persons, including\n342,800 students at 332 institutions in Dade, Broward, Balm Beach and Collier Counties.\nWTHS ms the first educational television station in Florida and one of the first in\nthe country. Total project cost will be $95,475*\nThis brings to thirty-four the total number of grants approved since funds first\nbecame available in May, 1963* Thirty-five additional grants requesting a total of\n$7,689,051 have been accepted for filing and are awaiting further action.\nHEW APPLICATION ACCEPTED FOR FILING\nAn application from the Board of Regents of the Universities and State College\nof Arizona for $148,860 has been accepted for filing under the Educational Television\nFacilities Act. Funds will be used to expand facilities of Channel 8 at Tempe, Arizona.\nTotal cost of the project is $198,480."
}