{
  "id": "d1713-2",
  "text": "-3-\nproposed new facility, the question is more easily answered in view of these criteria,\nbut in the case of institutions and organizations already operating a facility, it is more\ncomplex.\nThe main thrust of the legislation is to activate new educational television broad¬\ncast stations, with provision also made for the expansion of existing facilities. It is\nclear that a proposal to activate one of the existing reserved channels by the construction\nof the necessary facilities would constitute a project; whether it would be an approvable\nproject, however, would depend on how closely it met criteria to be fully set forth in\nregulations.\nA proposal to expand or improve an existing facility would also have to meet certain\ncriteria which relate to the need for expanded service and the extent to which the project\nwould meet that need. What might expand the coverage of a facility? Certainly, increased\npower, new antenna, satellite station, and other projects which will make the signal avail¬\nable to more people over a larger area . Probably, projects to enable the station to extend\nsignificantly broadcast hours and reach different segments of the population.\nIt should be pointed out that the project consists of the acquisition and installation\nof transmission equipment and that both the Federal share and the local share of the cost\nof the project can be used only for that purpose. It is not possible, for example, to use\nall of the Federal share for acquisition and installation of transmission equipment and the\nlocal share for buildings and other things not included in the project.\nIt should also be made clear that the 2 5 percent credit provision does not mean that\nThe Secretary may pay 25 percent of the cost of apparatus previously acquired simply\nbecause it is owned. The 25 percent provision only applies if an application for a new\nproject is approved, in which case up to 25 percent of the cost of the apparatus already\nowned by the applicant may be added to the Federal grant, provided that the total payment\nwith respect to the new project does not exceed 75 percent of its cost.\nWhat constitutes transmission equipment? Transmitters, towers, transmission line,\nantennas, transmitter control consoles, STL systems, video recorders and associated\nequipment are surely eligible, as will be certain studio equipment (cameras, film chains,\nmicrophones, switchers, etc.). The regulations to be promulgated will clarify some of the\ndifficult questions that exist on borderline items. Buildings (which are excluded by law),\ndesks, chairs, files, typewriters, etc., would not be included. Land acquisition and\ndevelopment, architect’s fees and legal fees would not be legitimate parts of a project.\nAnother important aspect of program planning involves the role of State ETV agencies\nand State plans. The law provides that applicants shall notify the State agency of\napplications submitted to The Secretary, and The Secretary shall advise the State agency\nas to the disposition of the applications .\nWhile the law does not require the Department to observe in every instance the\nwishes of a State agency in considering applications from within that State, it is clear\nthat close cooperation with existing agencies is essential for prompt action “to assure\nproper coordination of construction.”\nRemarkable progress has been made in developing State and regional plans, and in\ncoordinating the plans of individuals and groups within States. It is anticipated that use\nwill be made of the important work of these agencies. It would be hoped that in those\nStates where an agency is not yet established or a plan is not completely developed,\naction would be taken to institute and complete the necessary steps. It will not be the\nintent of the program to bypass the State agency, if in fact that agency is prepared to"
}