{
  "id": "d1807-1",
  "text": "-2-\nlaboratories, and is creating general public interest. Although only a year\nold, the Council has demonstrated a practical means for cooperation between\nbroadcasters and commercial broadcasting stations of which there are 19 in\nColorado and YTyoming. The Council will be pleased to answer inquiries, send\ndetailed reports or give consultant service to any institutions desiring it.\nA. G. Crane, Laramie* Wyoming, is President of the Council, and Robert B.\nHudson, Denver, is Director,\nFEDERAL RADIO EDUCATION COMMITTEE\nUnder the leadership of Commissioner John W. Studebaker, the Federal\nRadio Education Committee has established active radio service. Members of\nthe association are undoubtedly receiving the service bulletin of the FREC\ndescribing the enlarged activities. This monthly periodical gives much valuable\ncivic broadcasting news. The Office of Education is also maintaining a useful\nscript exchange. Radio monographs and books are sold and distributed by FREC.\nA fine series of scripts, very opportune in these times, is available on radio\nand national defense.\nNATIONAL COMMITTEE ON EDUCATION BY RADIO\nThe Committee has continued its program this year. The bulletin,\n’’Education by Radio,” has been issued and distributed to a mailing list of ten\nthousand leaders in radio. The office in New York has been continued and\nserves as a clearing house for educational broadcasting information. The major\nobjective of the Committee in the past year has been the promotion of cooperative\nradio councils. The cooperative idea is spreading and councils are in process\nof establishment in many states and regions.\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nThe National Association of Educational Broadcasters continues its\nactivities and service. This organization maintains continuous contact with\nits membership, exchanging information, reports of experiments and devices,\nand in general serves as a clearing house for information among its members.\nRESEARCH\nIn many institutions research projects are under way. As institutions\nprogress in broadcasting, research is found necessary for guidance of programs.\nA new method for testing listener response has been developed in Wyoming through\nthe cooperation of the public schools. The results of his research have been\nreported in a recent volume by Dr. Paul F. Lazarsfeld. Radio is accumulating a\nlarge and useful library,\nUNITED STATES DEPARTMENT OF AGRICULTURE\nThe National Farm and Home Hour continues to be one of America*s\nleading broadcast series. Many of our agricultural colleges have cooperated dur¬\ning the past year and this cooperation will be extended."
}