{
  "id": "d701-124",
  "text": "RADIO STATION KFJM\n1440 KILOCYCLM\nUNIVERSITY OF NORTH DAKOTA\nGRAND PORKS\nAugust 29, 1957\nMEMBER NATL ASS N.\nOF EDUCATIONAL BROADCASTERS\nMr. garry J. Skomla\nExecutive Dlreotor, NAEB\n14 Gregory Hall\nUrbana, Illinois\nDear Harry:\nIn answer to your memo regarding data needed for research seminar\ndated August 9, 1957, here is our reply.\n1. We have no researoh director at present other than myself. My\nqualifications in research are based on ay doctoral work wherein\nI participated in several public opinion surveys to gather data\nfor ay dissertation. I do nbt believe it is likely that I could\nattend the seminar even if I were qualified.\n2. We are especially interested in several problems:\n(A) Information on educational program types most preferred at\ngiven hours of the broadcast day; for example, is 4:30 a\ngood time for children*s programs, reading programs, lectures,\nor disousslons.\n(B) When are the peak listening periods during the day.\n(C) Are there any better education program types aside from music\nmost preferred by listeners; for example, is drama a favorite;\nwhat about documentary, short talks. Interviews and so on.\n(D) Do educational stations tend to provide \"relief programs* in\ncontrast to the fare offerred by commercial stations.\n(E) Do educational program audiences tend to be cumulative; that\nIs, are there large numbers of different people reached at\ndifferent times; or does the educational program audienoe tend\nto be both small and unchanging.\n3. Regarding researoh, you may recall that Dr. Roslow suggested at the\nNAEB radio programming seminar that educational broadcasters might\nseek assistance in establishing educational research programs for\nschools of commerce, business administration, etc. Are there any\ncase studies or examples showing the advantages and disadvantages\nof such cooperative efforts.\nThat*s all I can think of at this moment.\nBest wishes to you and the gang at NAEB.\nSincerely yours.\nMyron M. Curry\nDirector, KFJM\nHMC:me"
}