{
  "id": "d701-138",
  "text": "KXEiO STATION\nKWSC\nPULLMAN, WASHINGTON\n&y\nOWNED AND OPERATED BY\nTHE STATE COLLEGE OF WASHINGTON\n5000 WATTS - 1250 KC\nSeptember 1957\nMr. Harry J. Skornia\nNAEB Headquarters\n14 Oregory Hall\nUrbana, Illinois\nDear Harry: _ _\nYour memorandum regarding the Research Seminar arrived during\nmy vacation. No harm occurred I Judge since you Indicate\nyour request for reply by September 15 and I will meet\nthat deadline. My answer will be very brief indeed since\nwe can lay no pretentions to having a research director\nresponsible for TV or radio research either at KWSC or at\nthe State College of Washington at the present time.\nA year ago, Mark Munn, now of WGN, Chicago, was with us\nconducting extensive \"nose counting\" research for us.\nHowever, he has moved tc'greener pastures in the commercial\nfield, and we have mad** no replacement providing for\nresearch. Munn's Job was not full time, or even primarily,\nresearch. As a result, we are in no position to nominate\nany one from Pullman for consideration at the December\nSeminar. This I regret very much because I have a long¬\nstanding conviction that more research has been needed in\neducational broadcasting for a great many years. This does\nnot lead me, however. Into a voluminous detailed list of\nsuggestions of research projects that I would like to see\ndone bv NAEB or by someone e’se fo whom the idea may be\nsuggested by NAEB.\nFundamentally, I would like to se^ motivational research in\ndepth made available to us for ktj! dance of our activities.\nI have heard rumors on numerous occasions of motivational\nresearch being done at the behest of advertising agencies\nand sponsors. Perhaps the projects don't Justify the\ndesignation of motivational research In depth. Perhaps\nthe information cannot be obtained in any event. Collation\nof material, however, would be highly valuable if it is\nextant and obtainable. Otherwise, is it possible for NAEB\nto get involved In research that can help us to find out how\nto capture and attract the attention of the listening public\nwith materials designed for serious purpose? Obviously,"
}