{
  "id": "d701-140",
  "text": "tounoio in iai»\n'liirhmond 2? Virginia\niugist U, 1987\nMr. Harry J, Skornia\nNAJSB Headquarters\n14 Oregory Hell\nUrbanna, Ill* /\nDeer Mr. Skornia,\nThank you for your letter of August 9 on behalf of the WAiqi k«*«areh\nCommittee requesting the name of the Research Director at our station\nand asking fbr the listing of any problems which it is desired that\nthe HAXB Research Seminar study.\nIt happens that I am the only research director at our station but I\nentertain no illusions that I should necessarily be considered for\nmaabership on an XAXB Research Seminar. It does happen that I shall be\non sabbatical leave during the next soholastio year and that I hare\nbeen employed to do radio and television research during my sabbatical —\nand that means I shall probably, in faot definitely, be asking you for*\noounsel and advice as I outline and carry through the research project.\nIn addition to my work here at the Seminary I am a member of the Board\nof Directors of the Riohmond Rouoational Television Association (whioh\nat present, is pushing an active local program that will eventuate, we*\nhope, in the setting up of our own ITT station), a member of the Conmittee\non Mass Conunmi oat ions of the iresbyterian Churoh, 0.3., and a member of\nthe Radio Committee of the Broadoaeting ana Film Connies ion of the\nNational Counoil of Churches.\nI have been engaged by the Committee on Maes Connunications of the\nFresh -terian Church, U,S. to make a study of our denomination's present\nuse of radio and television) of the anticipated long-term trends of the\nwhofield of radio and television) to rtudy the proposed uses of radio\nand television by other religious groups) and to recomnend ths course\nof action in regard to raaio and television the rresbyterian Churoh U.S.\nshould follow in the light of the above. '\nThe operating fund fbr this surrey will run in the neighborhood of 110,000.00\n*iloh underscores the faot that all concerned expect it to produce some\nreally worthwhile results. 1 do oovet your advice as I enter upon this\nundertaking ,—and if there is any investigation of mutual benefit to us\nboth that I could incorporate, I would be quite glad to do so.\nAs fbr problems for researoh study, one problem whioh oonoeras me in\nregard to our etation (IM) is the whole field of children's radio orocrwaa .\nthe extent to vhioh a listening audience of children can be built up *\nwhat kinde of programs are most effective, the best kind of promotion, etc.\nWith the hope that I may be able to confer with you personally in the not\ntoo distant future, I am\nSinoerely youra.\nRobert White Kirkpatrick\nDlreotor, Audio-Tisual Center"
}