{
  "id": "d701-144",
  "text": "NAEB RESEARCH COMMITTEE MINUTES\nAugust 7* 1957\nMeeting was called to order at 9*15 a.m0 in Room 1105, DelPrado Hotel,\nChicago by Chairman Cheydleur with members Adkins, Becker, Coleman (ex officio).\nFlick, Harwood, Merrill, and Tyler present. The committee was joined by Exe¬\ncutive Director Skornia who remained with the committee until the meeting was\ncompleted,, Cheydleur requested Merrill to be secretary for this committee\nmeeting®\nThe first item of business was a discussion of the function of the re¬\nsearch coKsaittee® Cheydleur requested Tyler to take the notes of the dis¬\ncussion (Appendix A-l, A~2) and prepare a final statement for Resident Paulu\nwhich when submitted later was accepted with minor amendments. A copy of the\nstatement is attached as Appendix A to the minutes. The next item of business\ndealt with the question of a member as to the relationship between the research\nactivities of the ETRC and the NAEB# Skornia pointed out that the official\npolicy of the Center at present limits its research activities to studies of its\nown programs and programing. The NAEB research committee after some discussion\nreached the decision that the research activities of the NAEB are broad in scope\nas indicated in the past by the NAEB monitoring studies, for example, and that\nthe committee can bast fulfill its function by spelling out a comprehensive\nlong range program of research. The NAEB research committee feels that our re¬\nsearch plans should be known to the Center as a matter of interest and that any\nconcurrent and cooperative action on the part of the Center would be welcome.\nOn a matter of funds the research committee has approximately $8,000 at its\ndisposal, it was reported by Director Skornia, which is arrived at as follows:\n$3,000 NAEB Research Seminar fund, 1957\n$3,000 NAEB Research Seminar fund, 1958 (approval to spend in 1957\nreceived from Kellogg)\n$2,000 Grants-Xn-Aid and other research budget\n$8,000 Total"
}