{
  "id": "d701-20",
  "text": "HERBERT GERJBOX\nBiographical Data\nDate of birth: April 22,1929\n\\_ Educational History:\nA. B. 19ii9, University of Southern California! major: Pre-Medical psychology!\nmagna cm laude with HI$i Honors in Psychology! Honors Advisor: Lo E. Travis\nHonors^ffiesis: Current trends in electroencephalography.\nMA« 1952, State University of Iowa! aajor: Experimental psychology! Masters\nCommittee Chairman* Gustav Bergmann! Masters Thesis: The role of historical\nlawfulness in classical British psychologya\nFhoD 1953# State University of Iowa! major: Experimental psychology! Doctors\nCommittee Chairman: Harold P® Bachtoldtj Dissertation: Primary generalization\nIn paired associate learning as a function of additional cues.\nProfessional History:\nResearch Associate 1953~5ii, State University of Iowa! ONR grant research with\nHarold P* Bachtoldt\nInstructor, 195ij-present, Department of Psychology, Indiana University Teaching\nPsychology* Introductory (freshman). Experimental (sophomore), etc*\nResearch Associate 1955-56, Indiana University Hearing and Communication Labora¬\ntory* Full time summer 1955, half time academic year 1955^56* Air Force\nProject research*\nw Clinical Psychologist summer 1956, LaRue Do Carter Memorial Hospital, Indianapolis\nIndiana*, Psychological intern©\nConsultant in Psychology 1956-present, Central State Hospital, Indianapolis,\nXndianao Consultant in clinical research design* Taught course in research\nmethods to hospital staff psychologists. Supervised research*\nConsultant, HumRRO, 1957 fall—\nConsult on research design, statistics, programing.\nClinical Psychologist summer 1957, LaRue D. Carter Memorial Hospital, Indianapolis\nIndiana. Psychological intern.\nPublications:\nI* \"Generalization effects in successive discrimination learning as measured by\nresponse similarity\" by Jervert Gsrjuoy and Harold PQ Bechtoldfc* Final Report,\nContract Nonr 1261-(00), Project NR I5i-15& Office Of Naval Research. Depart¬\nment of Psychology, State University of Iowa, March 8, 1955.\n2o \"Two and three item confusion matrices for a set of three English syllables\"\nby Herbert Ger juoy. Proceedings of the Indiana Academy of Science, 1956, 6£,\n3. \"Correlation between articulation scores for speech masked by noise and speech\nmasked by speech\" by James Pc Egan, Herbert Gerjuoy, and Edward J* Timing*\nTechnical Report Contract No* AF 18(600)«$71, AFCRC-TN-56-52, 1 May 1956, to\nOperational Application Laboratory, Air Force Cambridge Research Center, Air\nResearch and Development Command, Bolling Air Force Base, Washington 25, D. C.\nPublished by Indiana University Hearing and Communications Laboratory*"
}