{
  "id": "d701-25",
  "text": "Richard Fg Vogl, Manager, VOI Radio, Iowa State College of Agriculture and\nMechanic Arts, Ames, Iowa\nttA couple suggestions for seminar consideration? What does the American\naudience expect from Radio and TV with regard to program content, that\nis, how much sex, how much realism, how much religion and morality, ete0?\nTo what extent should the programing be directed to specific arid neces¬\nsarily minority audiences such as teenagers, doctors, teachers, business¬\nmen, lawyers? How can the value of such programing be most effectively\nmeasured?\nWhy doesn°t the committee poll the convention delegates for ideas in\nOctober?1*\nBurrell Fa Hansenj Director, KVSC, Utah State University, Logan, Utah\n**In regard to problems valuable for a Seminar discussion Dr® Hansen\nsuggests (1) that more general understanding and recognition of the\n1 commercial ratings0 is needed, (2) that a scholarly method of\nresearch design and reporting is needed, (3) that we need to penetrate\nmore deeply into the \"why93\" of audience reactions to audio and stimuli\n(as present in radio and tv presentation, (li) that while determination\nof differences as a result of differoing methods, styles, and forms\nof presentation are important, we need also work toward objective\ndiscovery of causes, (5) that much of our finding of \"no statistically\nsignificant difference\" is possibly due to our use of stimuli of too\ngross a nature, and of insensitive instruments of measurement**\nChalmers Marquis, Development Director, WTTW, Chicago, Illinois\n\"We at WTTW feel the need for much more information about the audiences\nand programs with which we work. We would specifically be interested\nin tiiese areas?\nlo What motivates particular educational television program\nviewing by individuals?\n2o What can be found out quantitatively as well as qualitatively\nabout total audiences for ETRC programs?\n3o What motivates community organisation participation in helping\nto produce educational television programs?\nObviously we approach these and all our other problems with a direct\ninterest in determining and applying a solution© We face these\nquestions daily, and we must provide answers daily* We recognise, however,\nthat most of our information about all of them is very incomplete© We\nare therefore vitally interested in whatever research your group may\nundertake which will prove of value to WTTW and to educational tele¬\nvision everywhere © *"
}