{
  "id": "d701-26",
  "text": "A© B. Roberts, Director, Audio-Visual Department, Western Illinois State\nCollege, Macomb, Illinois\n\"a0 more research on the relative effectiveness of regular class*\nroom instruction and'(I) closed circuit TV of same (ii) relative\neffectiveness of closed circuit TV classroom presentations and\nprograms specially prepared for TV presentation©\nb0 research on the optimum length of time for both closed circuit\nand broadcast TV educational presentations for subjects in\nvarious areas, i©e©, science, social studies, etc©\nCo A study of the elaborateness of closed TV educational pre¬\nsentations; this involves amount of preparation on part of\ninstructor, size of TV crew, lighting, etc© Recommendations on\nbasis of findings©\nIn addition to the above, I would include research on the effective role\nof closed circuit TV in observation experiences of laboratory school\ndemonstrations in teacher training©\"\nHarry D© Lamb, Director, WTDS, University of Toledo\n\"RESEARCH FROBLEMS\n1# The major need of neophyte broadcast researchers is the statement\nof method in audience surveys both for spread and impact, to¬\ngether with a statement of their reliability as indexes of program\nvalue© Not all broadcasters have staff available already trained\nin research techniques, and some of those trained in educational\nresearch are not trained in survey techniques used by radio and\ntelevision©\n2© A study of program structure in terms of time of broadcast, eon^\ntent of broadcast, and audience response in terms of extent and\nimpact©\n3© A bibliography of educational radio and television research\ntechniques, studies, and reports identified clearly as to methods\nemployed©\n2u A comparative cost study of educational films, radio and tele¬\nvision in terms of the 15 minute and 30 minute unit of time©\n5© A study of the composition of groups and contributors to edu¬\ncational television fund campaigns to determine why they give© Is it\na sociologically or psychologically different group from contri¬\nbutors to other causes? Is it a one time contributing group or an\nannual contributing group? (What are its dominant reasons for\ngiving? Tax exemption, interest in education, prestige, rivalry,\nmoral responsibility, in consideration of the gifts of others, etc©)\n(i©e©, does it support educational television in reaction against\ncommercial television for one year and then lose interest? If so,\nthat are the factors for non-support?)"
}