{
  "id": "d701-56",
  "text": "UNI VLt SIT Y COU t 01\nC All TON CUIMSH. Dl A\n0, lMICM September 12, 1957\nDr. Harry J. Skornia\nExecutive Director\nNAEB\n14 Gregory Hall\nUrbana, Illinois\nDear Dr. Skornia\nIn response to your letter of August\n9th regarding the research seminar, it is a pleasure\nto inform you that the Director of Research for\ntVSC (although no such title exists) is the station\ndirector. Dr. Burrell F. Hansen.\nDr. Hansen obtained his Ph.D. from the\nUniversity of Minnesota in 1953. His research was\nin the area of radio program and listener evaluation,\nand titled: \"A Critical Evaluation of a Documentary\nSeries of Radio Programs on Racial and Religious\nPrejudice.* The programs evaluated in the study\nwere in a series of six i-hour documentaries\nprepared and produced by radio station WCCO in\nMinneapolis. The study has been reported in the\nJOURNAL OF THE AERT and at the 1956 Convention of\nthe Speech Association of America in Chicago.\nFollowing the SAA Convention Dr. Hansen was named\nto the research committee of the radio-TV-film\ninterest group of the SAA.\nSince coming to this institution Dr.\nHansen has initiated several Master's degree\nstudies much as \"Listener preferences in \"sports\nannouncing,\" \"FM Ownership in Logan,\" and a \"Com¬\nparison of TV vs. Radio Announcing.\" For the Utah\nState Extension Service Dr. Hansen planned a study\n(now underway) on \"Rural Radio Listening in Utah.\"\nHe has also undertaken two annual studies of\nlistenership/viewership to this\"institution's\nTV and radio broadcasts.\nIn regard to problems valuable for a\nSeminar discussion Dr. Hansen suggests (1) that\nmore general understanding and recognition of the\n'commercial ratings' is needed, (2) that a scholarly\nmethod of research design and reporting is needed,\n(3) that we need to penetrate more deeply into\nthe \"why's\" of audience reactions to audio and\nstimuli (as present in radio and tv presentation,\n(4) that while determination of differences as"
}