{
  "id": "d701-72",
  "text": "RESEARCH PROBLEMS\n1. The major need of neophyte broadcast researcher* 1* the statement\nof method in audience survey* both for spread end Impact, together\nwith e statement of their reliability as indexes of program value.\nMot all broadcasters have staff available already trained in re*\nsearch techniques, and some of those trained in educational re¬\nsearch are not trained in survey technique* used by radio and tele¬\nvision.\n2. A study of program structure in terms of time of broadcast, content\nof broadcast, and audience response in terms of sxtent and impact.\n3. A bibliography of educational radio and televsion research tech¬\nniques, studiss, and rsports-identified clearly as to methods em¬\nployed .\n%\n4. A comparative cost study of educational films, radio, and television\nin terms of the 15 minute and 30 minute unit of time.\n5. A study of the composition of groups and contributors to educational\ntelevision fund campaigns to determine why they give. I9 it a socio¬\nlogically or psychologically different group from contributors to\nother causes? Is it a one time contributing group or an annual con¬\ntributing group? (Vhat are its dominant reasons for giving? Tax\nexemption, interest in education, prestige, rivalry, moral responsi¬\nbility, in consideration of the gifts of others, etc.) (I.e.■ does\nit support educational television in reaction against commercial\ntelevision for one year and then lose interest? If so, what are the\nfactors for non-support?)\n6. A study of audience reeponse in terms of prestige factors: source\nof program—university or other educational source, Educational Tele¬\nvision and Radio Center (Ford Foundation), kinsecope-film-livs,\nreligious or church group, oivio groups such as/symphony orchestra\nassociations, chamber of commerce, unions, N.A?m. Are there value\nJudgments attached to source or content that should be stressed?\n7. An exposition of the limits and values of the demographic picture of\nthe audience in comparison with the psychological picture, or a com¬\nbination of both, or refinements that could be made in applying\neither.\n8. A study of the viewing habits of audiences at varying educational\nlevels; at varying economic levels; at varying occupational levsls\n(teachers, doctors, dentists, lawyers, clerks, office workers, maohins\noperators, outdoor workers such as truck drivers and mall carriers,\netc.)"
}