{
  "id": "d701-77",
  "text": "■3-\nHerbert Qerjuoy\nProfessional Affiliation\nAmerican Psychological Association, Midwestern Psychological\nAssociation, Indiana Aeadesjy of Science, Marion County Psychological\nAssociation, Indianapolis Psychology Soainar, Psychometric Society,\nAcoustical Society of America (American Institute of Physics),\nSigma Xi, AAAS, AAUP, Psi Chi. A\nGraduate training!\nUniversity of Southern California! Physiological Biochemistry;\n*#mr0l°Corn*ll University (summer session)* Behavioral Anthropology;\nGroup Dynamic Techniques. . ... « .4i%¥<\nState University of Iowa* (Psychology Courses)* Action, Emotion,\n& Perception; Fourelations of Measurement; History of Modern Psychology;\nPsychology of Learning; Experimental Social Psychology; Systems of\nPsychology; Pro bless in Psychology; Conte«*orary Viewpoints in Psycho¬\nlogy; Quantitative Methods in Psychology; Factorial Analyaia; Advanced\nStatistical Methods; Seminar in Theoretical Psychology; Research in\nPsychology; Laboratory Techniques in Psychology; Correlation Methods;\nDesign of Experiments; Perception; Seminar in Behavior Theory; Seminar\nin Personnel Research Techniques; Experimental Methods in Clinieal\nPsychology; Experimental Study of Personality; Sensory Processem.\n(Courses in other Departments)* Philosophy of Science; Readings\nin Mathematics; Mathematical Logic; Blasents of Statistics; Advanced\nCalculus; Theory of Statistics; Statistical Hypotheses. *\nftieearch Assistant in Psychology f/52-9/53. (Primarily correla¬\ntional analysis of data; performing various statistical tests).\nTeaching Assistant, summer 1953. Taught conference section of\nIntroductory Psychology.\nCurrent Research*\n1. and Tau Compared* As Descriptive Statistics, and Testing\nthe Hypothesis' of Mo Association\n2. Interpreting Tests of the Significance of Rank Correlation\n3. (with Irma Gerjuoy) Human Probability Awoidanca Conditioning\nwith Reinforcers Similar to the Diacriminative Responses\n4. (with Marvin Zuckerman) Verbal Conditioning by Contiguity in\nResponses to Social Ideal Questionnaires\n5. (with Arnold Baas) Response Classest A Problem of Clinical\nResearch Methodology"
}