{
  "id": "d701-79",
  "text": "UNIVERSITY OF N I B II A $ K A TELEVISION\nKUON-TV\nLincoln •, Nebraska\nSeptember 13# 1957\nDr* Harry Skornla\nExecutive Director, NAEB\n19 Gregory Hall\nUrbane, Illinois\nDear Harry:\nThis will serve to recommend Dr* Charles 0. Neldt as a\nparticipant to the NAEB Research Seminar to be held at Ohio\nState, December 9-13# 1957. I am especially pleased to be\nable to present the name of Dr. Neldt, since I am sure his broad\nbackground in educational psychology, measurements, research and\neducational broadcasting would enable him to make a valuable con¬\ntribution to the seminar*\nAt 34, Dr. Neldt is professor and chairman of the depart¬\nment of educational psychology and measurements. Teachers College,\nUniversity of Nebraska. He is co-author of Statistical Methods in\nEducat tonal and Psychological Research, Apple ton-fientury-flross,\n1954• rife Ts the author of articles In such professional Journals\nas the Journal of Applied Psychology, Journal of Educational Psy¬\nchology , Journal\"\" of Educat Iona 1\"anorayehologl cal Measurements,\nReview of LducTTlonal Research, etc. fie has been the research con-\nsultantHTor such special projects as the Westside Community School*s\n\"Teaching Seventh Grade Spanish and Spelling with the Use of Tapes\"\nand the Department of Economicsi* j>rolect \"The Use of Counselors\nfor Improving the Lecture Method of Presentation*\"\nDr. Neldt is a member of the Nebraska State Committee on\nTeaching by Tele vis Ion-Correspondence Study. You will recall\nthat this project is co-sponsored by the Fund for the Advancement\nof Education and Involves more than 30 rural high schools and\nseven courses. In providing the total education for these high\nschool students through television and correspondence study, the\nNebraska project is unique among all the exp rimentation being done\nin ETV across the nation. As such the Nebraska project may well\nserve as the pilot for small enrollment schools in many states.\nDr. Neldt Is in charge of all research in connection with the project\ntelevision with a purpose"
}