{
  "id": "d701-94",
  "text": "Community Evening Colleg*\nCommunity Sorvico*\nExtension Clones\nCorrespondence Course*\nAudio-Visual Center\nEducational TV ond Radio\n'Division of 8\\tension , Summer Session and Community Services\nTHE UNIVERSITY OF NEW MEXICO, ALBUQUERQUE\n1/\nAugust 23, 1957\nDr* Harry J. Skoraia\nNAEB HEADQUARTERS\nill Gregory Hall\nUrbana, Illinois\nDear Harry Skornia:\nIn reply to your communication of August 9, 1957, \"SUBJECT!\nDate needed lor Research Seminar.\"\nThe University of New Mexico is now in the process of planning\nan educational TV station, which it hopes to have in operation\nthis fall. Research on the experiment in teaching university\nlevel courses via television to monitor-teacher classrooms at\nthe receiving end, and in various towns and cities in the state\nwill be under the Director of University TV and Radio, Bemarr\nCooper. The evaluationist with whom the Director will work is\nDr. William Runge, of the College of Education of the University.\nDr. Runge has been an educator for many years, received his\ntraining in secondary education, vocational education and tests,\nmeasurements and statistics.\nI have worked for many years in evaluation and teaching by radio\nand television, have had my training in mass conmunication at\nStanford University and before that was involved in educational\nactivities in both Korea and Japan, as well as in the United States.\nAs you know, I have recently worked quite closely with Dr. Charles\nManwiller who has charge of Curriculum Development and Research\nfor the Pittsburgh Public Schools. (See the forthcoming report on\nthe KAra sponsored workshop in In-Class Utilisation of the Educa¬\ntional Television Program.)\nOne immediate problem on which several of us would be interested\nto have more data would be the motivational factors involved in\nlearning by television. Not enough is known about the individuals\nwho take telecourses or their reasons for taking these. Research\nindicates unusually fine results are obtained by telecource en-\nrollees when they are subjected to the same type of examination in\na subject area as that administered in a controlled classroom\nsituation."
}