{
  "id": "d1690-1",
  "text": "reported by Don G. Williams and Luella V. Snyder, costs\n$1.25 from the U. S. Department of HEW (OE-51005).\nHere and There\n• Leonard Feist, president of Associated Music Publishers,\nInc., is chairman of a committee directing a fund drive to\ninsure the installation of a bust of composer Edward Mac-\nDowell in the Hall of Fame of Great Americans. Stephen\nFoster is the only other composer to have been elected to the\nHall.\n• A note for ITV thinkers: Of the nation’s 125,000 public\nschools, more than 25,000 have only one teacher.\n• Two notes for financial thinkers: “The total program cost\nof educational television stations nationwide is about equiv¬\nalent to one network series on commercial television.” “The\ntotal annual budget of most educational stations is far less\nthan the cost of a single commercial television ‘spectacular’.”\n—from a report to the U. S. Commissioner on Education\n• One inescapable weakness of ITV, according to Wilbur\nSchramm: “The absence of intellectual give and take ... the\nopportunity to adjust to individual differences, rates [of learn¬\ning] and needs.” ITV “doesn’t stop to answer questions. It\ndoesn’t readily permit class discussion. ... It tends to en¬\ncourage a passive form of learning rather than an active\nseeking.” (“Educational TV—What It Is, Where It’s Going,”\nChanging Times, February 1963. 1729 H Street, N.W., Wash¬\nington 6, D.C.)\nNew NAEB Institutional Members\nRADIO DIVISION\nOtterbein College, Station WOBN, Westerville, Ohio. (Also\nNetwork member).\nTELEVISION DIVISION\nClover Park School District $ 400, Channel 56, KPEC-TV,\nTacoma, Washington; Educational Broadcasting Corporation,\nChannel 13, WNDT, New York; South Carolina Educational\nTelevision Commission, Channel 29, WNTV, Columbia, South\nCarolina; University of Maine, Channel 12, WMEB-TV,\nOrono, Maine.\nNews Notes\nPERSONNEL\n^ George L. Follansbee, president of Shady Side Academy,\nhas been elected chairman of the board of directors of Metro¬\npolitan Pittsburgh Educational Television, WQED-WQEX.\nHe succeeds Leland Hazard. New president of MPET is\nDonald V. Taverner.\n^ Lloyd Kaiser, formerly with the Rochester Area Educa¬\ntional Television Association, Inc., has moved to Hershey,\nPennsylvania, to become general manager of the educational\ntelevision facilities due to open in September to serve south-\ncentral Pennsylvania.\n^ Warren S. Park, Jr., has been named program director of\nWOSU-TV at Ohio State University. He leaves the teaching\nof high school algebra and geometry at Pinkerton Academy,\nDerry, New Hampshire, where he has been for the past two\nyears.\n^ The FCC and “its Newton Minows and E. William Henrys\nwho haul out their guns and their swords and go into action”\nhave been sharply reprimanded by Assistant Professor Edward\nC. Obrist of Boston U. Writing to U. S. Senator Leverett\nSaltonstall of Massachusetts, he calls for legislative action\nagainst the “harassment of the industry” and for a “long-\noverdue analysis and revaluation of the FCC and FCA.”\n^ Recent additions to the television staff of the A-V center\nof the Elmira, New York, city schools, are Mrs. Ruth Bar-\nenthaler, producer-director; Mrs. Mary Mann and Norman\nHosey, teacher-directors; and Richard Fortune, technical di¬\nrector.\ny Mrs. Gertrude Hoffsten is to become station manager of\nKSLH (FM), in St. Louis, replacing Marguerite Fleming,\nwho is retiring to live in Columbus, Ohio.\n^ President of Adler Electronics Benjamin Adler has now be¬\ncome vice president of Litton Industries. Adler is also vice\npresident and director of the Electronic Industries Association\nand a fellow of the Institute of Electrical and Electronic En¬\ngineers.\n^ B. William Spiller, chief engineer and operations manager\nof commercial television station KATC in LaFayette, Louis¬\niana, has been appointed general manager of the Richmond\narea’s new ETV station, to be operated by the Central Vir¬\nginia Educational Television Corporation.\n^ William J. McCarter has become general manager of\nWETA (TV), Washington, D.C. He leaves NET where he\nhas been development officer.\n^ Walter E. Whitaker has recently been named director of\nthe Educational Television and Radio Program, National\nAeronautics and Space Administration. Prior to joining\nNASA, Whitaker was television coordinator for the U. S.\nArmy Signal School, Fort Monmouth, New Jersey.\n^ In Argentina, NAEBer Dinah Spindler is doing her own\neducational show for adolescents, translated as “The Arc of\nCaptain Tifon,” sponsored by book publishers over commer¬\ncial TV in Buenos Aires.\nSTATE AND REGIONAL\n^ Martin Busch, director of KUSD and KUSD-TV and\npresident of the South Dakota Educational Television Asso¬\nciation, reports that the state-wide ETV feasibility study made\nby a St. Paul ETV association has been completed and ac¬\ncepted by the SDETA and is now being printed. It will next\nbe presented to the South Dakota Legislative Research Coun¬\ncil for study and possible recommendation for legislative ac¬\ntion. If a state ETV network is established as indicated in the\npresent study, 96 per cent of the school population in South\nDakota could be reached by in-school ITV.\n{► Current address of the Kentucky Authority for ETV is:\nMedical Center, University of Kentucky, Lexington, 40506.\nStaffers are O. Leonard Press, executive director; Ronald\nStewart, chief engineer; and Ronald Russell-Tutty, adminis¬\ntrative assistant.\n^ The South Carolina ETV Commission plans to apply for a\nCP for an ETV station in the Midlands, R. M. Jefferies, Jr.,\ncommission chairman, announced recently. Two ETV stations\nare on the air in the state—Channel 29 in Greenville, which\nwent on in October, and Channel 7 in Charleston, which be¬\ngan broadcasts last month.\nj> The Alabama ETV Commission has filed with the FCC for\npermission to build a new ETV station in Huntsville. This\nwould be the sixth TV station to be operated by the AETC.\nINSTRUCTION\nThe ‘personal touch’ is the emphasis of Donald Bucklin s\nzoology course shown over University of Wisconsin’s WHA-\nTV. Instead of standing and lecturing from a blackboard,\nBucklin sits behind a desk with the camera close up, by which\nhe feels that the emphasis is placed on his teaching the indi¬\nvidual student rather than lecturing to an audience. To insure\nbetter effect, director of the series Theodore L. Nielsen runs\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Editorial assistant: Skip Robinson.\nPhone 333-0580. Area Code 217.\nReporters:\nRegion I —Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\nRegion II —Shirley Ford, WUOT, University of Tennessee, Knox\nville.\n—Lou Peneguy, AETC, 2151 Highland Ave., Birming¬\nham, Ala.\nRegion III —McCabe Day, WVSH, School City of Huntington, Ind.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}