{
  "id": "d1690-2",
  "text": "a full-dress rehearsal before each taping. This is UW’s first\nfull-scale TV course in undergraduate science.\n^ Several prominent Canadian school authorities who visited\nChicago’s TV College within the past year have become en¬\nthusiastic about the Chicago Board of Education’s success\nwith ETV. Canada is facing a college expansion crisis very\nsimilar to ours. On the authorities’ recommendation, a CBC\ntelevision crew has filmed a day in the operation of WTTW,\nthe TV College station, to be part of a CBC documentary on\nthe higher education crisis, showing one American response.\n^ Stanford University’s intern teachers from the school of\neducation are using videotape recordings of their high school\nclassroom presentations to view and improve their perform¬\nances, thanks to a Ford Foundation-supported project directed\nby Robert N. Bush. Two former teachers working toward\ntheir doctorates in education, Keith Acheson and Alan Rob¬\nertson, form the camera crew, which visits high schools where\nStanford interns are in action. The 20-minute recorded seg¬\nment of the class period is shown to the intern in private, after\nwhich he discusses his performance with his supervisors. An¬\nother use of videotape was to tape Richard Gross teaching a\ngroup of his intern teachers, to serve as the basis for a second\nlecture by Gross on his own methods of teaching captured on\nthe first film.\n^ A teachers’ meeting via closed-circuit television gave music\nteachers who receive the fine arts program on Austin’s\nKLRN-TV an opportunity to visit informally with TV teacher\nJanet McGaughey, professor of music at the University of\nTexas. Professor McGaughey was telecast from the KLRN-\nTV studios in Austin, where a group of Austin teachers had\ngathered. Another group of teachers watched in San Marcos\nat Southwest Texas State College, a third group saw the\nshow at San Antonio College. After Mrs. McGaughey’s pres¬\nentation, everyone was able to ask questions directly through\na specially designed talk-back system from the two receiving\nrooms.\n^ To help update mathematical thinking and teaching, Richard\nVinson, Huntington College professor of mathematics, is do¬\ning two series of telecasts over the Alabama ETV network,\none for teachers and another for classroom instruction. The\nneed for updating: present junior high subject matter was\ntaught 15 years ago only in grad school.\n^ WHYY-TV, E. R. Squibb and Sons, and the Philadelphia\nCollege of Pharmacy and Science have joined to bring the\n7,000 pharmacists in the area a ten-week half-hour series of\nseminars designed to inform them of the latest developments\nin pharmaceutical science and therapeutic progress. All of\nthe seminar lectures will be videotaped and made available to\nother ETV stations.\n^ Through her ETV program, Alabama teacher Alma Bates\nacts on her theory that student dropouts are usually ones who\nhave had early spelling and reading problems, with other\nlearning impeded more and more through each passing year\nbecause of this 'lack of skill. Her idea (that students, once\nthey become thoroughly confused by the tricky relationships\nbetween spelling and pronunciation, tend to fall further and\nfurther behind the class in spelling and reading, then in other\nsubjects as reading becomes the basis for study) led her to\ndesign a diagnostic spelling test which she annually gives dur¬\ning her now eight-year-old telecourse, “Improve Your Read¬\ning.” Classroom teachers grade the papers, make note of who\nneeds additional work, and forward the results to her. Al¬\nthough her telecourse, which emphasizes lower-grade speech\nstudy and letter-picture association charts, is geared basically\nto grades two through six, several high schools schedule it\nfor their students having English problems.\n^ Radio programs broadcast over WABE-FM are being used\nto supplement the televised Spanish course for fourth grade\nstudents in Atlanta and Fulton County public schools. Short\nradio lessons review the vocabulary heard on WETV during\nNAEB Headquarters: Suite 1119, 1346 Connecticut Avenue,\nN. W., Washington, D. C., 20036. Phone 667-6000. Area Code 202.\n“Nuestros Amigos,” the television Spanish course. WABE\nbroadcasts the radio programs in the afternoon and evening\npreceding the broadcast for classroom listening.\n^ Lee Dreyfus, general manager, WHA-TV, University of\nWisconsin: “I’m negotiating with the commercial people who\nhold the most popular programs to get some of them for for¬\neign language teaching. Almost all our top commercial pro¬\ngrams are being put out in a lot of different languages—like\nGunsmoke and Huckleberry Hound. And Father Knows Best,\nbut that wouldn’t work so well, it’s a ‘concept’ program. For\nlearning language fast you need a lot of action. I got this\nidea in Detroit, found the foreign-born were learning plenty\nof English from watching action programs—sporting events,\ncowboys. (I knew some Hungarians who always used the\nword ‘pardner’ for ‘friend’). We’re just going to reverse the\nprocess and use it for high school students. College too.”\nPROGRAMS\n^ The University of Wichita, in cooperation with the YMCA\nand the Community Committee on Social Action, began a\nseventeen-week non-credit course January 18 in contemporary\nrace relations entitled “Race: Myth and Reality.” The series,\nproduced by Richard J. Meyer, director of-ETV at the Uni¬\nversity of Wichita, will be seen over a special four-station,\nfour-city hookup.\n^ The European Broadcasters Union has chosen a new NET\n“What’s New” production as an outstanding example of U. S.\nchildren’s television programing. Directed by University of\nTexas’ Earl Miller, produced by KLRN-TV, Austin, and\nnarrated by Chill Wills, the three half-hour films explore\nthe Rio Grande through a thousand-mile filming expedition\nwhich left from Presidio, Texas, in small, flat-bottomed\nboats, and arrived at the Gulf of Mexico six weeks later. The\ncrew filmed such sights as pre-historic pictographs painted\nby unknown Indians, ghost towns on both the Mexican and\nAmerican sides of the river, and paintings and other records\nof the Alamo, as welll as their own record of how the ex¬\npedition was made.\n^ University of North Carolina faculty members are dis¬\ncussing Personal Finances over WUNC-TV. Directed at the\nNorth Carolina citizen of average means, the 16-program se¬\nries studies wills, estates, trusts, taxes, credit buying, invest¬\nment, savings, and the matter of getting one’s money worth.\n^ Music programing at WBUR is making a major shift to¬\nward thorough coverage of local performances by adding the\nlive broadcasts of Boston Symphony Orchestra concerts and\nthe Symphony Hall organ recital series, as well as the taping\nof 20 on-campus concerts and recitals for later broadcast.\n^ What is reported to be the first statewide diabetes public\ninformation TV program series in the U. S. is currently be¬\ning telecast over Alabama’s Channels 2, 7, 10, and 26. Orig¬\ninating in the network’s Birmingham studio, it is produced in\nassociation with the Alabama Diabetics Association and the\nUniversity of Alabama Medical College.\n^ “Spotlight on Schools,” a weekly radio series heard over\nWABE-FM, Atlanta, allows administrators from Atlanta and\nFulton County schools, on alternate weeks, to discuss the op¬\neration of the schools, curriculum studies, budget matters, ex¬\nperimentation, and general school needs. Plans are being made\nto release the tapes from this series to a commercial station\nfor rebroadcast.\nGENERAL\n^ Ampex Corporation is now offering its low-cost, portable\ninstrumentation recorder in a 7-channel version as well as the\noriginal 4-channel model to allow recording of a wider range\nof data. The SP-300 is one-sixth the size and half the cost\nof previous magnetic tape instrumentation recording systems\nof comparable performance and is designed for use in re¬\nsearch and applied areas of medicine, education, and industry.\n^ Two students at the University of Michigan have formed a\nRachmaninoff club to advance the music of the great classical\ncomposer. The club is issuing recordings of Rachmaninoff\nFEBRUARY 1964\n3"
}