{
  "id": "d1690-3",
  "text": "preludes to radio stations with a request that they be played.\nThe new, strictly non-profit, organization now has about 40\nmembers.\n^ Educational broadcasting in New York City celebrates its\nsilver anniversary this year. Twenty-five years ago, when the\ndaily school broadcasts began, there were only 62 radios in the\ncity schools. Today there are close to 5,000 radios plus 2,000\ntelevision sets. For the future, school officials see two main\nbroadcasting objectives about to become realities. One is the\ncompletion of the board’s $2,300,000 TV production center,\nwhich is under construction and which will permit the system\nto produce its own television programs. The other is ac¬\nquisition of a television station by the board for transmission\nof its programs.\n^ KVIE (TV) in Sacramento, California, is celebrating its\nfifth anniversary this February. Support for Central California\nETV began a dozen years ago.\n^ Among the recipients of this year’s National Safety Coun¬\ncil Public Service Awards for exceptional service to farm\nsafety are educational stations WKAR, Michigan State Uni¬\nversity, and KUOM, University of Minnesota.\n^ The A-V center at Syracuse University has a new name:\nCenter for Instructional Communications. Among the respon¬\nsibilities added to the center’s activities in the last few years\nare operation of a 195-position electronic learning lab, cus¬\ntom designing of classrooms for automated instruction, and\na program of research and experimentation in programed\nlearning, teaching machines, and computer-based instruction.\n^ Educational television tapes compatible with the Ampex VR-\n1500 portable videotape recorder are available for ETV sta¬\ntions and closed-circuit systems from two major tape libraries.\nThe Midwest Program for Airborne Television Instruction,\nInc., in West Lafayette, Indiana, and Great Plains Regional\nInstructional Television Library in Lincoln, Nebraska, are\nnow offering course material from their libraries on 2-inch\ntape for use by educational institutions equipped with the Am¬\npex portable videotape recorder.\n^ A massive 914-foot polished brass sculpture, created by the\nnoted Minneapolis artist, John Rood, was recently donated to\nKTCA-TV, the Twin Cities Area Educational Television\nStation. The sculpture, “From Telstar,” which is now mounted\nat the entrance to the KTCA-TV studio building and which\nis believed to be the first artistic creation of its kind inspired\nby and dedicated to an ETV station, is said to symbolize tele¬\nvision as an international cultural and educational force of\nworld-wide significance.\n^ KCET, Los Angeles’ long-awaited educational television\nstation, moved into its permanent studios early in January.\n^ A member-solicitation letter sent out during recent months\nby KQED, San Francisco, drew editorial comment from\nBroadcasting to -the effect that KQED seemed to be “anti¬\ncommercial” instead of non-commercial. In responding to the\ntrade magazine’s “finger shaking,” KQED Manager James'\nDa\\- said that KQED is not anti-commercial—that it was the\nintrusiveness, not the commercials themselves, that were ob¬\njected to. He also said, “Significantly, the solicitation letter\nwas the most effective ever sent out by KQED, and prompted\nsome of those solicited to write us ‘fan lletters’ on the letter\nitself, an almost unheard of phenomenon in fund raising.”\n^ Boston University’s School of Public Relations and Com¬\nmunications has announced the expansion of its undergraduate\nprogram from two to four years, with a thorough stiffening\nof its content. Now during the freshman year, students will\nbegin the program with twice-weekly seminars supervised by\neight senior professors.\n^ New York City’s Educational Broadcasting Corporation,\nwhich operates the ETV station, WNDT, has asked the FCC\nto assign Channel 14 for educational use. The plan is to oper¬\nate the second UHF station for adult illiterates and high\nschool drop-outs.\n^ New headquarters for the BFA have been established at\n52 Vanderbilt Avenue, New York City. Sdlveig Sletteland,\nformer station relations director for BFA, has been appointed\nacting executive director.\nPLACEMENT\nPERSONNEL AVAILABLE\n[For information, write Miss Julie Hunt, Placement Service,\nat the NAEB office in Washington.)\nFebruary I Returned Peace Corps volunteer, 26, who was a\nuniversity lecturer in Journalism (including a course on\nradio and television) at an African university, desires\nposition either as newswriter, reporter or production as¬\nsistant-researcher in public affairs division. Male, single.\nMaster's degree from an Ivy League institution in inter¬\nnational relations. Wishes to locate in or near large\nurban center or university town. Has experience in sev¬\neral of the journalistic media; radio ties go back to\ncollege days. Salary $90-125 per week depending on\ncost-of-living in community.\nFebruary 2 Program director or assistant operations director\nfor radio or television. Seven years experience in radio\nand television sales, administration, publicity, production,\nprograming, and personnel. For last four years has been\noperations director for FM station. Experienced public\nspeaker. A.B. in teaching of social studies. M.S. in tele¬\nvision production and direction. Both degrees from Uni¬\nversity of Illinois. Married. Two children.\nFebruary 3 Radio-TV engineer. Male, 38, single. B.S. in iV.\nFCC first class license. Location open; North preferred.\nSalary: $5-8,000.\nFebruary 4 Producer/director (British) with long experience\nof educational television in England would like similar\nassignment in this country, preferably in the Detroit\narea. Salary range $150-200 per week. Age 43, female,\nsingle.\nPOSITIONS AVAILABLE\n(In order to be considered through these channels, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nFEB-I Transmitter-control room operator for Midwestern uni¬\nversity radio station. First class radio-telephone license\nrequired. Starting salary $4700 per year plus group in¬\nsurance and hospitalization. Annual increases usual,\nthough not guaranteed.\nFEB-2 Rad io-TV writer-producer. University-based educational\nradio and TV station seeks individual with demonstrated\nability to write and produce programs for both media.\nPosition includes teaching basic courses in radio-TV.\nExperience in film and promotion helpful. Position in¬\ncludes faculty status. Optional health program and man¬\ndatory retirement program. One month vacation. Salary\n$7,200.\nFEB-3 Producer-director for new ETV station. Must be experi¬\nenced in commercial or ETV. Position open June I. Sal¬\nary determined by qualifications.\nFEB-4 Technician: Experienced man for operating and main¬\ntaining studio and transmitter equipment in new ETV\nstation. VTR experience desirable. Salary $6,000-$7,000.\nFEB-5 Middle Atlantic college desires a Ph.D. in radio and\ntelevision to teach undergraduate and graduate courses\nin these areas; to develop and supervise a program in\nthese areas. Rank and salary open. Position open Sep¬\ntember, 1964.\nFEB-6 Chief engineer with first class license and audio pro¬\nduction background. Salary $6,000 to $6,500 per year.\nFEB-7 Chief engineer for a large Eastern university. Will be\nresponsible for planning, designing, and engineering the\nETV station. Later will aid in electronic learning research.\nSalary in five-figure bracket. Open immediately.\nState Department Has Opening for ER Specialist\nWanted: Educational radio specialist to assist in Laos\nwith developing and writing course material at the ele¬\nmentary level. Should be able to train local educators\nin both writing and producing radio lessons which will\nbe designed to supplement the instructions presently\noffered in village schools. Fluency in French required.\nOne year assignment open immediately. Interested per¬\nsons should contact Miss Martha Seesa, Department of\nState, Washington 25, D.C.\n4\nNEWSLETTER"
}