{
  "id": "d577-134",
  "text": "Futures\n1. Until and unless the Ford Foundation and The Fund for the Advancement of\nEducation can achieve some basic policy resolutions and directions in the\nfield of educational communications, I think the future is bound to be dotted\nwith what sometimes seems (to some at least) to be random, capricious, unre¬\nlated and sometimes lrresponsible behaviour insofar as basic thinking in\neducational communications ic concerned.\nThe Fund for Adult Education which best understood the whole problem would\nappear to have been largely ignored to date in any such policy search. Hope¬\nfully (and wishfully) such would not be the case in the future, although I see\nno present basis for any such hope.\nUnless top-level Ford Foundation policy makers can somehow become aware or be\npersuaded to take an over-all view of the '‘whole’* rather than the ’’parts,“ I\nsee little hope for optimism from this quarter in a truly integrated approach\nto the problems of educational communication.\n2. Hopefully there will be favorable action on the NAEB short-term interim fin¬\nancing. If this transpites so that there is some \"breathing spell” 1 think we\nthen must think through and enunciate quite clearly our own notions of whatever i\ncomprehensive and structured approach to this problem Is—in terms ANYONE can\nunderstand for our benchmark as well as in soliciting support.\n3. New support from the Kellogg Foundation and others—if the NAE8 has a destiny,\nit may well be reatized by working toward this idea of total structuring.\nPaulu’s recent letter to the closed circuit television group now forming, is a\ncase in point. NAE8—if it becomes a professional organization—might take a\nleaf from the National Educational Association (maybe this was Schooley's\nrationale all alongt and set up a series of departments, e.g., AM radio, FM\nradio, VHF television, UMF television, closed circuit television, station activa¬\ntion, research, an adult broadcast network, an in-school broadcast network,\ninstitutional members, individual members, etc., and like the NEA embrace them\nall.\nIf coherence out of confusion is the objective, something like the foregoing\nmight be the framework.\nIf Kellogg is interested in breaking new ground, they might well pioneer where\nno other foundation has really ventured. And NAEB might well think of baskets\nas well as eggs tn dozens.\nWhat Is your thinking?\nRichard B. Hull\nEnclosures: Paulu letter\nSkornia letter"
}