{
  "id": "d577-163",
  "text": "2\n1949. First Allerton House (University of Illinois) Seminar (Rockefeller).\nFor Policy Officers and Station Directors. Goal setting. Twenty partici¬\npants plus 26 consultants, including such individuals as Dr. Donald\nHorton, Anthropologist; Dr. Paul Lazarsfeld, Sociologist; Dr. Howard\nMcClusky, education and adult education specialist; Dr, Justin Miller,\nthen President of the National Association of Broadcasters; and numerous\nresearch and communications experts.\nForeign specialists were also present from Denmark, Great Britain, Japan,\nKorea and the Philippines.\n19150• Second Allerton Seminar (Rockefeller). For Program Directors and\nStation Directors. Twenty-nine participants from the U.S. and Canada\nplus 23 consultants, including Dr. Walter Agard, Professor of Classics;\nDr. Kenneth Benne, Professor of Education and Adult Education; Dr. Lee\nCronbach, Professor of Educational Psychology; Dr. Kenneth Hudson,\nFine Arts Dean; Dr. Richard McKeon, Professor of Philosophy; Dr. O. H.\nMowrer, Professor of Psychology; Dr. Allen Nevins, Author and Professor\nof History; Dr. Robert Redfield, Professor of Anthropology; Robert Lewis\nShayon, Radio-TV Critic and writer-producer; Dr. George Stoddard,\nPsychologist and then President of the University of Illinois; NBC News\nCommentator Clifton Utley; and representatives of UNESCO, Research\nand other organizations.\n1952. Allerton: School Broadcast Seminar (Kellogg). For those responsible\nfor in-school broadcasting, principally radio. Twenty participants plus 16\nconsultants, including Dr. Harold Hand, professor of education; Dr.\nBenjamin Bloom, Examiner's Office, University of Chicago; Dr. Gordon\nHullfish, Educational Philosopher; Dr. Wilbur Schramm, Dr. Fredrick\nSiebert and other communications and research experts.\n1952. First Educational TV Workshop (jointly with the JCET; (Joint Com¬\nmittee on ETV) at Iowa State College (FAE: Fund for Adult Education). For\n(future) ETV Station Managers. Fifty-two participants plus some thirty\nconsultants, and members of staff of staff of WOI-TV (first educationally-\nowned TV stations, then on the air). Consultants included the Honorable\nPaul A. W'alker, chairman of the Federal Communications Commission,\nlegal counsel from the JCET, and production and administration specialists.\n1953. Lincoln Lodge (Madison, Wisconsin) Seminar (FAE). For ETV\nStation Managers, Directors, administrators, educational directors,\nfoundation representatives, and representatives of the ETRC (Educational\nTelevision and Radio Center) and the JCET. Direction-setting, policy\nand organization. Forty-five participants. Consultants included; Dr.\nEdgar Dale, Bureau Educational Research at Ohio State; Dr. Dale Harris,\nDirector of the Department of Child Welfare, University of Minnesota,\nDr. Harold Lasswell of the School of Law of Yale University, and other\ndistinguished scholars, whose guidance we sought."
}