{
  "id": "d577-167",
  "text": "THE FORD FOUNDATION\n<477 MADISON AVENUE\nN EW YORK 22, N. Y.\nTERMS OF GRANT\nGrantee\nNational Association of Educational\nBroadcasters\n14 Gregory Hall\nUrbana, Illinois\nDate: June 27, 1957\nAmount: $97 j 000\nPeriod:\nApproximately one year\n1. Expenditure of Grant Funds: The grant is for the purposes stated in the attached Letter\nof Grant Notification, and is subject to modification only with the Foundation’s approval\n2, Reversion of Grant Funds: The grantee will return to the Foundation any funds:\n(a) Not expended in accordance with the conditions of the grant and within the period\nstated;\n(b) If the grantee loses or is denied its exemption from Federal income taxation under\nSection 501(c)(3), formerly 101(6), of the Internal Revenue Code\n3. Reports to the Foundation: The grantee will furnish the Secretary of the Foundation\nwith a written report upon the completion of the project or program for which the grant\nhas been made. Where the period of the grant exceeds one year, the grantee will furnish\ninterim reports, as requested bythe Foundation, These reports will contain such informa¬\ntion as may be necessary for the Foundation to determine that its grant is being used for\nthe purposes intended and for the Foundation to fulfill its own public reporting responsibilities\n4. Public Reports: The Foundation makes routine public announcements of its grants,\ngenerally about ten days after each quarterly meeting of its Trustees. However, you\nare free to announce your grant at any time provided that you send a copy of the release\nto the Foundation’s Office of Reports for advance review. We should like also to receive\nprints of photographs showing activities made possible by the grant and copies of addi¬\ntional releases, announcements, film scripts, and similar materials relating to the grant,\n5. Commitment: This grant is made with the understanding that the Foundation has no\nobligation to provide other or additional support for the grantee, unless otherwise stated\nin the accompanying Letter of Grant Notification.\nFF-027\n(Revised 12/19/56)"
}