{
  "id": "d577-173",
  "text": "•rvyfc'\nJuly 25, 1958\ncowmmuL\nF.B.S.!\nThere* s sou» clarification of Ford position versus TV in letters from He aid,\nfollowing meetings of Heald, Armsey and Faust with Calkins, now serving as\nETRC Board Chairman,\nSeems Center may get up to U or 5 million more. But not for public information\nor in-school. They seem to feel much of in-school stuff can be done by corwnercial\ninterests (1).\nWant to urge strenthening local roots, and now seem again to facvor some adult\ned.\nThe three areas of support seem to be, for a whiles\n1) closed circuit.\n2) Development of EOT stations, still, for exchanges and Including general\nas well as school programs.\n3) Increased concentration of Center, solely as exchange of pgms. center.\nThis last Is somewhat of shock to them.\nThis from Hull, confidentially, by phone. As we finished, he agreed to By¬\npassing on to you, and will send some parts of letters, with salutations,\nletterheads, etc, cut off—as a policy statement only. This will I hope\nclarify ny hasty phone notes,\nHull feels he *11 be forced to react to suggestions (Wednesday ETRC Board or\nExecutive Committee u»eHng, July 30) growing out of WittSoff long-range\nplan draft, for possible consolidations. He wanted help and guidance.\nReminded him of Network as income-producing, and that we»d used quid-pro-quo\nmhmI, if we gave up. Concern exists about unecoraical use of radio funds.\nHe «s inclined to think stationing of an NAEB man at the Center iohsndle\nthis, on their staff might inprove it, if he*s full-time. Told him he might\ngelTthelr reaction, or see if the $100,000.00 could be turned over again to us\nto handle—-if there*s such concern, I doubt if the ETRC could do this.\nFor the rest, he*11 remind ETRC Board that only the NAEB Board, not he, could\nagree to ccauralidafcion, on a specific plan basis, worked out Jointly by the\ntwo Boards as equals.\nThis was the best I could do. You might want to call him to discuss.\nHope you had a good vacation. See you.\nHJStcmc\nHarry J. Skomia"
}