{
  "id": "d577-67",
  "text": "59\nAppendix 3\nREPRESENTATIVE STATEMENT BY RECIPIENTS OF\nPROGRAM GRANTS-IN-AID\nUniversity of Michigan — \" 'They Fought Alone* received a first award from\nu'iG Institute for Education by Radio In 1953 in the highly competitive 'regional*\nclassification,•,. Subsequent queries about the series from the Voice of\nAmerica resulted in 'They Fought Alone* being broadcast to all English-language\nareas in the world, Theodore Streibert, (then) chief of the U. S, Information\nAgency, publicly declared it to be one of the outstanding radio contributions\never to come out of educational circles. Ever since its production, programs\nfrom the series have been used as audio aids in University classes on the\nHistory of Education... The first such series, to our knowledge, ever to\nbecome a recognized part of a graduate-level course in this University,\n“The success of this series naturally reflected great credit upon the Univer¬\nsity of Michigan, and gave tangible proof to administrators and faculty alike\nthat radio broadcasting, adequately supported, could produce significant con¬\ntributions to academic and public life • This resulted in greater cooperation\nfrom both in the development and fulfillment of new program ideas, A grant-\nin-aid convinced the University administration that given adequate financial\naid the educational FM station is a powerful public relations and educational\nmedium which results in more liberal budget attitude\nStanford University (Regarding TV grant-in-aid at the time NAEB handled these\ngrants, prior to ETRC activation) — \"Because of the grant we were able (to\nproduce the type of) educational program which compared most favorably with\ncommercial programs. As a matter of record our program moved in popularity\nfrom third place to second and was bested only by the telecast of the fights\nfrom Madison Square Garden, New York. This we considered a monumental\nachievement in view of the nature of our serious discussion of geopolitics.,.\nTo sum up, I should say that with the grant-in-aid Stanford produced an edu¬\ncational television series that won local, national and international attention.\nThe grant made possible the joint effort of people knowledgeable in educational\ntelevision and the scholars of Stanford University,... We have shown that\neducational television can be made exciting with financial help.\"\nBoston University — \"This grant-in-aid (for the series entitled 'New England\nRenaissance*) increased the stature of Boston University’s Department of\nRadio in the Division of Communications Arts.... Nine organizations, ranging\nfrom the Universalist Church to the Thoreau Society offered active support in\ncreating contacts for material and in promoting the broadcasts. While the\nseries was being broadcast....tourist attendance at Brook Farm in West\nRoxbury rose by six hundred percent. After the series was released nationally,\nwe had letters from all parts of the United States asking whether or not the\nprograms and/or scripts might be used in the classroom for discussions on"
}