{
  "id": "d577-73",
  "text": "Appendix 6 (Continued)\nWTHS-TV, Miami, Florida, September 15 - 18, 1957. Consultant: Jack\nChenoweth, KETC, St. Louis, Missouri.\nEdgewater Park, Mississippi (Southern Region Planning), March 6 - 8, 1958.\nConsultants: Kenneth D. Wright, WUOT, University of Tennessee; Ed\nwegener. Auburn Polytechnic Institute, Auburn, Alabama.\nWHYY-TV, Philadelphia, Pennsylvania, April 7 - 9, 1958. Consultant: Fred\nRemley, University of Michigan.\nUniversity of Minnesota, Minneapolis, Minnesota, April 16 - 19, 1958.\nConsultants: I. Keith Tyler, Ohio State University; C. R. Carpenter, Penn¬\nsylvania State; Mrs. Hope Lunin Klapper, Flushing, New York; Dr. John VV.\nWakely and Dr. Anna T, Hampel, University of Minnesota.\nCentral California ETV Association, Sacramento, California, May 26 - 28,\n1958. Consultants: James Robertson, WTTW, Chicago; Charles Hettinger,\nPittsburgh Public Schools, Pittsburgh, Pennsylvania.\nUniversity of New Hampshire, Durham, New Hampshire, June 1 - 3, 1958.\nConsultants: William G, Harley, WHA-TV, University of Wisconsin; Jack\nMcBride, KUON-TV, University of Nebraska; Cecil S. Bidlack, NAEB TV\nEngineer.\nUniversity of Kansas City, Kansas City, Missouri, June 30 - July 16, 1958.\nConsultants: Gale Adkins, University of Kansas, Lawrence, Kansas; Clair\nTettemer, KETC, St. Louis, Missouri.\nAlabama Educational Television Network (for tests and network planning),\nNAP^St U \" 15' 1958# Consultants: cyril M. Braum, JCET; Cecil S. Bidlack,\nREPRESENTATIVE STATEMENTS FROM RECIPIENTS OF CONSULTATION SERVICE\nNebraska (George S. Round, Chairman, University TV Committee)\n-- This team was composed of outstanding individuals and rendered a high\nservice to the University of Nebraska. The team went about its lob inteUi-\ng^iiiy and came up with a report which I am certain will help guide our tele¬\nvision developments in the future.**\n(Robert C. Higgy, (then) Director, WOSU and\nv UbU-TV) — **.... I definitely feel that we have profited from this vis<t to\nan extent far greater than we can realize at this time.... Suggestions con¬\ncerning improved production practices were especially well taken Ly our staff"
}