{
  "id": "d577-74",
  "text": "66\nAppendix 6 (Continued)\nand will definitely result in improvements in the studio and in handling pro¬\ngrams*.. . The opportunity to discuss future plans was very valuable to us\nand we are all sure it will have a lasting effect upon our work.... I would\nlike to take this opportunity to express our appreciation to the team members,\nNAEB and all others concerned in arranging the visit for the opportunity\noffered through this visit. It has given confidence to our staff members\nthat is definitely noticeable as well as many practical ideas which we have\nalready put into operation.**\nDetroit. Educational Television Foundation (Dr. Paul B. Rickard, Director,\nRadio and Television, Wayne State University) — **The conference was an\noutstanding success. I am confident that it was both time and money well\nspent.... I think the consultation team as a group and individually were\nexceptionally competent people.... In general, I feel the (consultation\nteam visit) was most successful and that the idea of sending consultation\nteams to local areas is one that we should encourage and continue to support. ,**\n-(Henry D. Brown, Chairman, Operations Committee, WTVS) — 11 We\nare especially grateful for the cooperation of the Fund for Adult Education\nin making possible this grant through the auspices of the NAEB. It is uni¬\nversally agreed that all units of the foundation benefited..,.**\nMetropolitan Educational Television Association (New York City) (E. A.\nHungerford, Jr., Director of Operations) — “You certainly can chalk one up\nfor the NAEB service. We had a very fruitful conference.... It was really\nquite an experience to be able to ask questions of three of the top ETV\nleaders.... It was really a brilliant ‘seminar* • • • • All of us made copious\nnotes..• .and I am sure we will be discussing these subjects for a long time\nahead. Thank you ever so much for arranging such a helpful service to us.**\nUniversity of Utah (Harold W. Bentley, Dean, Extension Division) — “(Your\nconsultant) was extremely helpful and his talk last night before represen¬\ntatives of about one hundred organizations in the state more or less interested\nin educational television programs was especially appropriate.. *, (His)\nvisit here did precisely what we hoped it would do and we are very Indebted\nto both him and you.... I write to thank you in behalf of the Utah Educa¬\ntional Television Foundation and the University of Utah.**\n■University of Ngw Hampshire (Dr. Jere A. Chase, Director of Development) —\nI would like to take this opportunity to thank you... .for what we felt here\nwas a first class job. The report did exactly what we hoped it would do and\nthe Trustees, when we presented it to them, agreed to go ahead with the\nproject.,.. We appreciate your help on this and I can assure you that with¬\nout the study you people made I feel certain we would not have received the\ngreen light.**"
}