{
  "id": "d577-86",
  "text": "78\nAppendix 13 (Continued)\n^feibership Committee: Raymond Huribert, Alabama ETV Commission,\nh umingham, Chairman; Mrs. Gertrude Broderick, United States Office of\nv acation; Region I ~ Jack Summsrfield, Stations WGBR-FM-TV, Boston,\nMassachusetts; Region II - Kenneth Christiansen, University of Florida;\nRegion III - Lee Dreyfus, Station vVDET, \"Wayne State University; Region\nIV - Father R. C. Williams, S0J., Creighton University; Region V - Beruarr\nCooper, Station KNME-TV, University of New Mexico; Region VI - Mrs.\nPatricia Swenson, Station KBPS, Portland Public Schools.\nPublications Committee: Frank Schooley, Stations WILL-AM-FM-TV, Univer¬\nsity of Illinois, Chairman; Gertrude Broderick, United States Office of Edu¬\ncation; Philip Lewis, Board of Education, Chicago; Edward Stasheff, Univer¬\nsity of Michigan; Elmer Sulzer, Station WFIU, Indiana University; Tracy\nTyler, University of Minnesota.\n.Eafeiic .Relations Committee: Elmer Sulzer, Station WFIU, Indiana University,\nChairman; william Bender, University of Michigan Medical Center; Franklin\nBouwsma, Station WTVS, Detroit Educational Television Foundation;\nRaymond Cheydleur, Manatee Junior College; Milford Jensen, St. Claf's\nCollege; Rae Weimer, University of Florida,\n-B§dio Network Committee: Richard Vogl, Stations WOI-AM-FM, Iowa State\nCollege, Chairman; Robert Boyle, Station KUOM, University of Minnesota;\nE. G. Burrows, Station WUOM, University of Michigan; Myron Curry, Sta¬\ntion KFJM, University of North Dakota; Burt Harrison, Station KWSC,\nWashington State College; Kenneth Kager, Station KUOW', University of\nWashington; A. Paul Klose, Station WSOU, Seton Hall University; R. C.\nNorris, Station KUT-FM, University of Texas; Don Quayle, Station WC3U,\nOhio State University; John Regneil, Stations WILL-AM-F MI, University of\nIllinois; Jack Summerfield, Station WGBH-FM, Boston; Philip Thompson,\nStation WUOT, University of Tennessee; Wayne C. Wayne, Stations\nWKAR-AM-FM, Michigan State University,\nM^io Network School Committee: Mrs, Kathleen Lardie, Station WDTR,\nDetroit Board of Education, Chairman; McCabe Day, Station WVSH, School\nCity of Huntington; Mrs. Dorothy Klock, Station WNYE, New York Board of\nEducation; Miss Lillian Lee, Station WABE, Atlanta Board of Education; Mrs.\nElizabeth Marshall, Station WBEZ, Chicago Board of Education; Miss Arlene\nMcKellar, Stations WHA-AM-FM, University of Wisconsin; Claude Smith,\nStation WPSR, School City of Evansville, Evansville, Indiana; Mrs. Margaret\nTyier, Stations WOSU-AM-FM, Ohio State University; Mrs. Patricia Swenson,\nStation KBPS, Portland, Oregon."
}