{
  "id": "d577-92",
  "text": "-3-\n6. 1953, ETV Management Seminar (FAE) at Iowa State College. For ETV\nStation Manager? Policy, administration, organization. Nineteen partici¬\npants plus management, legal, public affairs, and program consultants.\n7. 1953. First ETV Production Workshop at the University of Illinois. (FAE)\nFor ETV station and production center producers. Seventeen participants\nplus production consultants.\n8. 1954. In-School Writers Seminar (Kellogg). For writers of in-school\n(principally radio) programs. At KSLH, St. Louis Public School Station.\nTwenty-one participants, plus consultants and KSLH staff. Consultants\nincluded Mrs. Gertrude McCance of the Canadian Broadcasting Corporation's\nSchool Service, and Professor Harold Hand, School of Eductation, University\nof Illinois.\n9. 1954. Second ETV Production Workshop (FAE). For Producers and Production\nSupervisors. At Michigan State University. Twenty-six participants from\nthe U.S. and Canada plus consultants and WKAR-TV (Michigan State) staff.\n10. 1954. First ETV Engineering Workshop (FAE). For engineers involved in\nETV station planning, installation, operation, and testing, and kinescope\nrecording. Held in the New York area (with cooperation of General Presi-\nsion Laboratories, RCA, Dumont and the commercial networks.) Twenty-\nseven participants plus industrial representatives and consultants.\n11. 1955. Third ETV Production Workshop (FAE). At State University of Iowa's\nTV and Film Production Center. Thirty participants plus production, light¬\ning, and graphics consultants and Iowa staff members.\n12. 1955. Second ETV Engineering Workshop (FAE). At Michigan State (WKAR-\nTV). Emphasis on operational and testing problems and kinescope record¬\ning. Twenty-five participants plus some 20 industry consultants and\nMichigan State staff.\n13. 1956. Radio Engineering Seminar (Kellogg). At Allerton Park, University of\nIllinois. Emphasis on tape recording and general installation, operation\nand testing procedures. Thirty-one participants plus consultants from such\nfirms as Minnesota Mining Co., and various engineering firms and schools\nand WILL staff members.\n14. 1956. ETV Staging and Lighting Workshop (Ford). At University of Michigan,\nfor individuals responsible for staging, lighting, visuals, graphics and\nrelated procedures. Twenty participants plus professional consultants and\nUniversity of Michig an Production Center staff."
}