{
  "id": "d577-93",
  "text": "-4-\n15. 1956. ETV Program Planning Seminar (Ford.) Held at University of\n'Wisconsin (WHA-TV). Basic balanced planning problems of individuals\nresponsible for ETV station program policy. Twenty-seven participants\nplus consultants and WHA-TV staff members. Consultants included Dr.\nClyde Kiuckhohn, Anthropologist of Harvard University; Jack McGiffert\nof CBS “Camera Three\"; Dr. Huston Smith, Professor of Psychology\nand Religion at Washington University, St. Louis; and Professor Peter\nYankwich, Department of Chemistry, University of Illinois.\n16. 1957. Radio Program Planning Seminar (Kellogg). Held at Allerton Park.\nSame as above, but in radio. Twenty-nine participants plus consultants.\nThe latter included Dr. Joseph Gusfield, Department of Sociology,\nUniversity of Illinois; Dr. Sydney Roslow, Director of the Pulse, Inc.,\n(research firm); NAEB Legal Counsel Leonard Marks; and Dr. Robert\nStreeter, Dean of the College, University of Chicago.\n17• i§t?. ETV Management Seminar (Ford). At Allerton Park. The second of con¬\ntinuing series of problem-solving and policy-developing seminars of\nETV Station Managers. Twenty-four participants plus representatives of\nJCET and ETRC and consultants, including research and subject area\nspecialists.\n18. 1957, ETV Research Seminar (Kellogg). This was the first bench-mark seminar\nfor individuals in charge of research in educational TV stations and\nclosed circuit installations. At Ohio State University. Twenty-three\nparticipants pli^s over twenty educational and research consultants and\nOhio State stari members. Consultants included such distinguished\nscholars and professors as Dr. Reuel Denny, Dr. Benjamin Bloom, Dr.\nRalph Tyler, and such Communication Research experts and directors as\nDr. Herta Herzog, Dr. Franklin Knower, Dr. Paul Lazarsfeld, Dr. John J\nScanlon, and Dr. Gerhart Wiebe.\n19. 1958. Children’s Program Seminar (Ford.) At Boston University, jiointly\nwith Agoos Foundation. Seminar for commercial station children’s pro¬\ngram directors. Twenty-one educational participants (from U.S. and\nCanada) plus consultants and Boston University and Lowell Institute\nstaffs. Consultants included such experts as Dr. Urie Bronfenbrenner,\nDepartment of Child Development and Family Relationships, of Cornell;\nDr. Arthur Lumsdaine* of the University of California; Dr. Frederick\nSheffield, Professor of Psychology at Yale; Dr. Alberta Siegal of Stanford,\nDr. Nathan Maccoby of Boston University; Dr. Eleanor Maccoby of\nHarvard; and Directors of Children's radio, TV and film programs from\nthe U.S. and Canada .\n20. 1958. TV Engineering Video Recording Workshop (Ford). Held in\nChicago at member ETV Station WTTW. Problems of kinescope and\npreparation for video tape recording problems. Thirty participants plus\nconsultants from all major industrial firms and WTTW staff members."
}