{
  "id": "d1830-2",
  "text": "NAEB members in the International Exhibition con¬\nducted in connection with it each year. We believe\nthis speaks well for the constantly rising quality of\nour output and efforts, as well as increasing rec¬\nognition of the service we provide.\nThe Individual Membership fliers sent out by\nFrank Schooley are beginning to bring in a significant\nnumber of new members from the staff of members\ninstitutions. Has your staff sent yours in yet?\nAs you have perhaps heard, Fred Siebert, Di¬\nrector of the School of Journalism at Illinois, and long¬\ntime NAEB friend, has resigned to accept a similar\nappointment at Michigan State. We shall miss him\nseriously here, but we’re glad to see that he’s going to\na good school (our alma mater), and we wish him\nGodspeed and all success. MSU is getting a mighty\nfine scholar and gentleman.\nWithin the next few weeks: UNESCO National\nCommission Meeting for new appointees, an ad¬\ndress at the Indiana University Audio-Visual Educa¬\ntion Conference, and then, we hope, vacation.\nOur thanks for the many kind words many of you\nhave taken the trouble to pass on to members of the\nstaff. They greatly appreciate them, as I do, and we’ll\nall try to continue to deserve the support of the fine\nmembership which “the NAEB” represents. Have a\ngood summer!\nNETWORK NEWS\n—Bob Underwood\nThe Radio Network School Committee has met and\nselected the offering for the 1958-59 school year. This\noffering will be distributed during the fall and winter\nof this year while the 1957 offering is being aired.\nThe Committee held its deliberations in the Del\nPrado Hotel, Chicago, May 31 and June 1, at which\ntime they discussed additional major points relative\nto in-school broadcasting. A report of the meeting\nand details of the new offering will be announced\nlater.\nWe were quite pleased at the number of sub¬\nmissions we had this year for the in-school offering.\nNaturally, not all of them could be chosen; network\nproduction capacity would not permit it. However,\non behalf of the School Committee, I want to thank\nthose who sent in series, and remind everyone that\nsubmissions for next year’s offering will be accepted\nat any time.\nIf you get your submissions in early, the Com¬\nmittee’s work will be easier, as will the Network staff’s\njob of dubbing your audition tape for listening by\nCommittee members.\nThe offering for the third quarter is currently in\ndistribution, and we trust those stations remaining on\nDIRECTORY CHANGES\np. I Active 125\nAssociate 87\nAffiliate 79\nTotal 292\nRadio-FM Only 86\nTotal Active Membership 125\nThese 125 members operate .... for 158 stations,\np. 5 Under Florida:\nWFSU Delete:\nAdd:\np. 7 Under Indiana:\nAdd:\np. 14 WAER {FM) * Delete:\nAdd:\np. 15 KFJM Delete:\nAdd:\np. 15 Under North Carolina:\nAdd:\np. 20 Under Virginia\nAdd:\np. 26 Under Indiana:\nDelete:\np. 29 Under Missouri:\nAdd:\np. 31 Under New York:\nAdd:\np. 37 Under Florida:\nDelete:\nAdd:\np. 46 Under Wisconsin:\nAdd:\np. 52 After WWKS:\nAdd:\nRadio-TV\next. 6661\nUniversity Broadcasting Service\nExt. 7-4831\nWPSR 90.7 me\n(Evansville)\nSchool City of Evansville\nClaude B. Smith\nDirector of Radio,\n200 N. W. 7th St\nEvansville, Ind. 4-5492\n76-5571\nGR-6-5571\n1440 kc\n500 w Night\n1370 kc\nWWWS (FM) 91.3 me\n(Greenville) 3 kw\nEast Carolina College\nMiss Roulston, Station Manager\nGreenville, N. C.\nWRFK (FM) 91.1 me\n(Richmond) lOw\nUnion Theological Seminary\nin Virginia,\nRobert White Kirkpatrick\nDirector, Audio Visual Center\n3401 Brook Road\nRichmond 27, Va.\nSchool City of Evansville\nSt. Louis Public Library\n(St. Louis)\nCharles B. Gilbert Television\nProducer 1301 Olive St.\nSt. Louis 3, Mo.\nState University Teachers\nCollege\n(New Paltz)\nWilliam L. Millard\nAss't Prof. Educ.\nNew Paltz, N. Y.\nRaymond D. Cheydleur\nExt. 4831 & 2351\nExt. 7-4831 & 7-2351\nMilwaukee Public Library\nSerials Section\n814 W. Wisconsin Ave.\nMilwaukee 3, Wise.\nBroadway 6-7578\nWWWS (FM) East Carolina\nCollege,\nGreenville, North Carolina\nthe air during the summer have placed their orders.\nWe attempted to maintain a full schedule for the sum¬\nmer months, although about one-fourth of the stations\nJUNE, 19$7\n3"
}