{
  "id": "d1830-4",
  "text": "FCC ACTIONS\n► The FCC has voted to consider a revised plan for\nauthorizing new TV stations. In general, the new plan\nwould disregard the present fixed city-by-city table\nof TV channel assignments.\nThe Commission said the assignment table, pub¬\nlished in 1952, had served its purpose of getting a\nnationwide TV system into operation in orderly steps,\nand that a more flexible procedure is now possible.\nThey, invited comment on the idea, to be submitted\nby June 3, after which they will proceed to final con¬\nsideration of the change.\nThe proposal would not affect any of the fixed\nchannel assignments reserved in specified locations\nfor noncommercial, educational outlets, and could\nnot. be applied to areas within 250 miles of the Can¬\nadian and Mexican borders where the assigned chan¬\nnels are tied to international agreements.\n► The University of Washington’s radio station\nKUOW, operating on educational FM channel 213,\nasked the FCC for authority to change over to com¬\nmercial channel 235.\nNEWS OF MEMBERS\nGENERAL\n► Expansion in TV teaching and rehearsing facilities\nhas been made in the Radio-TV-Film Department of\nthe University of Miami by installation of a Dage\nclosed-circuit vidicon TV system.\nThe University of Miami still has classes and pro¬\ngrams at elaborate commercial station WTVJ, but\nnew equipment on campus greatly facilitates handling\nthe present larger number of students in the depart¬\nment.\nMiami University hopes to start construction soon on a new\nhome for its radio-TV studios,'represented here by this architect's\nsketch.\n► WTTW, Chicago, telecast its 4000th show May 2\nwith the presentation of “Ticker Tape” a weekly series\non investments. Since, it began telecasting from its\nMuseum of Science and Industry studios in December,\n1955, WTTW has presented 4000 programs in co¬\noperation with 200 Chicago area organizations. The\nstation reaches an estimated' half million people with\nits current schedule of 49 hours a week.\n► Plans for an Ohio ETV council,, perhaps leading to\na network between 9 Ohio cities, were announced by\nUberto Neely, general manager of W7CET, Cincinnati.\nEventually, according to Mr. Neely, WCET should be\nexchanging programs with Akron, Athens, Bowling\nGreen, Cleveland, Columbus, Dayton, Oxford and\nToledo. It would give Ohio one of the largest ETV\nnetworks in the nation.\n► Full-time ETV broadcasting in New York City\nmoved one step nearer reality when the, META an¬\nnounced it will initiate a daily half-hour educational\nprogram over station WPIX in the fall.\n► KQED, San Francisco, has been cited as the lead¬\ning producer of programs for the ETRC. Notice ap¬\npeared in the May 17th New York Times to the effect\nthat KQED has 9 individual program contracts for\nTV series to be distributed nationally. Two or more\nadditional contracts are expected. The total will be\nabout 200 half-hour programs.\nKQED productions now being distributed by the\nETRC are: “Buckskin Bob, The Atom, The Ele¬\nments, Tempest in a Test Tube,” and “The American\nEconomy.”\n► The Junior League of Memphis, Tennessee, has\nbeen praised by their National Association for their\nexcellent assistance in establishing and developing\nWKNO, Memphis’ community ETV station. The\njob was accomplished by dint of much hard work and\ndonations over a 6-year period. May we add our con¬\ngratulations to Memphis Junior League!\nPERSONNEL\n► The appointment of Hartford N. Gunn, Jr., as\ngeneral manager of Boston’s WGBH-FM-TV, has\nbeen announced. Mr. Gunn, formerly assistant gen¬\neral manager, replaces Parker Wheatley, who has re¬\nsigned. Resigning at the same time as Mr. Wheatley\nwere E. G. Sherburne Jr., director of programs, and\nLawrence Creshkoff, assistant director of programs.\nMr. Gunn named three assistant general man¬\nagers: Paul Rader, Jack D. Summerfield, and David\nM. Davis.\n► Dr. Herman B. Wells, president of Indiana Uni¬\nversity, was elected for a 5-year term to the Board of\nDirectors of the ETRC. The Center’s Board elected\nJUNE, 1957\n5"
}