{
  "id": "d1830-6",
  "text": "kinescope recorder; Transvision, its classroom re¬\nceiver; Sarkes-Tarzian had a complete studio control\ninstallation and kinescope recorder; RCA displayed\nits new vidicon broadcast type camera with field type\ncontrol units; Zenith exhibited a hi-fi combination and\na remotely controlled TV receiver.\nA number of engineers were present to participate\nin the clinic on equipment for TV teaching.\n*****\nFor those of you who are contemplating the in¬\nstallation of a 10 watt educational FM station, Mar¬\nshall College has a 10-watt Gates No. B-F-E-10,\nMCty-3276, with one MO-3304 set of tubes, one JR-072\ncrystal and oven, operating frequency 88.1 me. In¬\ncluded in the package is 176 feet of new RG 18-TJ\ncoaxial cable and one FM-11, MO 3429 Single Bay\nBroad Band Ring Type Antenna for two and one-half\ninch pipe with mounting clamp.\nThis equipment has never been used and cost new\n$1,420.50. They offer the complete package for $1000.\nIf you are interested in purchasing this transmitter,\nwrite to Mr. Robert H. Maki, Gates Radio Company,\nQuincy, Illinois, since the transaction must be com¬\npleted through them.\n*****\nRCA has developed an electronic orbiting device\nto prevent “burn-in” on image orthicon cameras. This\nmodification kit is available for around $800 and can\nbe installed within present RCA cameras to ma¬\nterially increase the useful life of image orthicons.\n*****\nAnyone who has gone through the time-consuming\nprocess of installing coaxial connectors on RG-59/U\ncable should be interested in a time-saving connector\ndeveloped by Entron, Inc., Box 287, Bladensburg,\nMd. It’s a solderless connector which can be applied\nin a fraction of the time necessary to attach the con¬\nventional solder type connector. The solderless con¬\nnectors are less expensive and the two necessary\ncrimping tools sell at a very nominal price. Entron\nmakes a complete line of solderless connectors, also,\nfor RG-6/U, RG-8/U and RG-ll/U cables as well as\nthe tools necessary for their installation.\nThe NAEB Planning Committee for the TV Management\nSeminar met in Columbus atter the IERT to plan and im¬\nplement the up-coming seminar. All members were able to be\npresent except Raymond Hurlbert. Attending were: George\nArms, Jack McBride, Edwin Browne, Paul Rickard, James Robert¬\nson, ex officio Harry Skornia, Harold Hill and Don Feddersen,\nrepresenting the ETRC.\nWOI-AM-FM, Iowa State, and WKAR, Michigan\nState both celebrated a 35th anniversary this spring.\nIt’s 35 years since WOI’s call letters were assigned,\nand it marks 35 years of continuous service from\nWKAR to the people of Michigan.\nLETTER FROM ENGLAND\nThe following is excerpted from a letter to Editor Judith Stevens\nfrom Noel F. Brookes, 14, of Worchestershire, England. These are\nhis personal opinions of what he has seen on TV.\n“I don’t watch TV much, except Panorama and\nScience Review. I think the other stuff is sheer, un¬\ndiluted tripe!\n“In our home anyway, the family watches the\nchildren’s hour, then has tea and so misses most of the\n6-7 p.m. programs. They watch TV AUTO¬\nMATICALLY! It’s part of their life.\n“I like the educational films, what few there are.\nBut I think the approach is too crude for the modern\nchild. My brother, aged 12, remembers the more\nlurid incidents in the films and TV he watches. I\nthink the approach should be more subtle; say dis¬\nguise the lesson - have as an instructor a well-known\nfigure, a cowboy or a pirate, which will appeal to the\njuvenile, mind.”\nPLACEMENT SUPPLEMENT\nJune I - Male, single, 47, M. of Public Health, with specialized\ntraining and experience in public health, community affairs,\njournalism and dramatics. Can write, edit, adapt, announce,\ndirect and produce. Location open. $5,000.\nJune 2 - June radio-TV graduate, male, single, 28, desires\nposition in educational broadcasting,. At present is con¬\ntinuity writer for university station on hourly basis. Location\nopen. $3600.\nJune 3 - Producer-writer announcer for educational radio sta¬\ntion with 8 years professional broadcasting experience.\nWishes to be judged on basis of programming ideas and\naudition tape. Male, 32, single, B.A. Location open. $5500.\nJune 4 - Man and wife, Ph. D. and M.A., respectively, wish\neducational broadcasting experience. Male, 35, currently\nteaching and assisting with music program production. His\nwife, 32, is director of women's programs on educational\nradio station. Location open. $4500 and $2600.\nJune 5 - Radio-TV production coordinator with considerable\nengineering experience (1st class FCC license) wants pro¬\nduction position in educational broadcasting. Will teach.\nMale, 40, married, M.E. Location open. $5500.\nJune 6 - Experienced producer, script-writer, announcer for\neducational broadcasting programs, children and adults,\ndesires position in TV production work. Female, 31, M.A. in\nCommunications. Location open. $4500.\nJune 7 - Free-lance writer or editor on science and tech¬\nnology is available for assignments. Male, single, 50,\nChemical Engineer. Salary to be discussed. Prefers to work\nat home but will travel.\nJune 8 - Film and TV production man with heavy professional\nexperience wants ETV position. Will be glad to teach.\nHopes to complete graduate training. Male, married, 34,\nA.B. Location open. $450/mth,.\nJune 9 - Associate producer in commercial TV wants change\nto ETV as producer or director. Has experience in business,\nperforming and directing children and adults. Male, 38,\nmarried, M.A. Location, salary open.\nJune 10 - Director with commercial TV station desires ETV\nposition as producer-director. Interested in teaching. Male,\n23, M.S. (Syracuse), married,. Location open. $85/wk.\nJune I I - Producer-director and production manager for com¬\nmercial TV desires changeover to ETV. Trains personnel,\noften designs and builds his own sets. Male, 28, married,\nLocation open. $7000.\nThe Radio-TV Bureau of Arizona State College\nat Tempe ventured experimentally into color TV\nwhen they televised color slides on their “Campus\nForum” program over KTVK, in Phoenix. The stu-\nJUNE, 1957\n7"
}