{
  "id": "d957-107",
  "text": "Page 2\nMember-at-large, National Council, Boy Scouts of America\n(1940-1942)\nMember, Board of Directors, Greater New York Council, Camp Fire\nGirls (1941)\nMember, Advisory Council, School Broadcast Conference (Chicago)\n(1937-1942)\nPresident, St. Paul Junior Chamber of Commerce (1939-1940)\nNational Vice-Chairman, Radio Committee, U.S, Junior Chamber of\nCommerce (1940)\nMember, Board of Directors, St. Paul Area Council, Boy Scouts of\nAmerica (1935-1941)\nMember, Board of Directors, St. Paul Council of Camp Fire Girls,\n(1935-1941)\nEducation:\nSt„ Paul (Minnesota) public schools (1913-1925)\nUniversity of Minnesota (major in speech) (1925-1929) (left college\nbefore obtaining degree to begin radio work)\nRockefeller Foundation Fellowship, University of Illinois (1950)\n(international seminar on communications)\nAwards:\nDistinguished Servvice Award of Texas Western College (1951)\nPeabody Award (for distinguished radio production) (1939)\nFirst Awards from Institute for Education by Radio in 1939, 1948,\n1949, 1950, 1951 for the outstanding educational broad¬\ncasts of the year.\nVariety Magazine Award for outstanding service to education (1938)\nMiscellaneous:\nEstablished the radio workshop movement in Minnesota, with\n16 workshops in St. Paul and Minneapolis hi^i schools.\nProduced first television broadcast in Minnesota, an experi¬\nmental project in art education (1939)\nContributed to the Journal of the National Council of Teachers\nof English, the Association for Education by Radio\nJournal, and for two years editor of the radio-television\ndepartment of \"The National Parent-Teacher\", the PTA\nMagazine.\nProducer of the Texas School of the Air (fifty-seven stations),\nthe nation’s oldest and largest in-school listening\nproject confined to a single state.\nEstablished health education broadcast project in Texas which\nhas since been recognized as the outstanding radio series\nin that field by the U.S. Bureau of Public Health, and\nother national organizations."
}