{
  "id": "d957-115",
  "text": "H fi N S H ® 0^\nR\nA\nD\nI\nO\nR\nO\nA\nD\nC\nA\nS\nT\nI\nS\nEXTENSION DIVISION\nUNIVERSITY OF ALABAMA\n“THE VOICE OF THE UNI^RSITY\nOctober 2, 1952\nOF ALABAMA\"\n8 & m «\nWl1 i ■■\nMr. Frank Schooley U!'!r-R^r^ Y/1IJ^\nRadio Station WILL\nGregory Hall\nUniversity of Illinois\nUrbana, Illinois\nUNIVERSITY. ALABAMA\nBOX 2002\nDear Frank:\nYour very kind letter and card of October 1 and the sentiments\ntherein are deeply appreciated.\nAs to my interest in the Executive Director’s job of NAEB my\nanswer is still the same. I am not interested at this time or in\nthe forseeable future. If the University of Alabama does not pro¬\nceed with its TV plans, I shall consider moving to an institution\nwhere they are proceeding with TV, but I shall stay here and fight\nit through if it possible to do so. job here does not pay well\nand I have turned down several nice offers for the reasons that:\nfirst, I like to live in the deep South* second, I have put a great\ndeal of myself into this present job and am reluctant to leave this\nstate* third, my work here is personally mof^ gratifying and offers\nopportunity for advancement so long as I continue to butt my head\nagainst the obstacles we face. Furthermore, if I do make a move,\nI want it to be my last move. I am a strong believer in deeply-\nplanted roots. This job has never paid well and never will pay\nwell so I pay a high price for the privilege of living where I\nwant to live and doing what I want to do. If I should make a\nmove out of the deep South, I can think of no place I had rather\nbe and no group of people with whom lH?^d rather work than you.\nWill, Bob and the other fine people I have met at the University\nof Illinois. The fact remains, however, that leaving here is not\na probability that I face at the present time. How soon I may\nface that probability, I can't say.\nI apologize for such a lorg paroration, but your kindness\nI felt prompted a rather complete reply* so unless you come up\nwith some highly negative information concerning - and I\ndoubt that you will - I am calling a meeting which will include\nSi, Dick Hull, Burton Paulu, Wilbur, and me with Earl Wynn in\nWashington the evening of October 16 and the morning of October\n17th for a complete discussion of the possibilities of his going\nto work with us the first of January. I am convinced that he\nwill do a thoroughly outstanding job if we can arrive at an\nagreement.\nMEMBER OF NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS"
}