{
  "id": "d957-158",
  "text": "RADIO STATION\n91.7 MC\nWUOM\nUNIVERSITY OF MICHIGAN\nANN ARBOR. MICH.\nSeptember 3> 1952\nE. G. BURROWS, program director\nMr. Graydon Ausraus, Director\nRadio Broadcasting Services\nStation VUOA, University of Alabama\nUniversity, Alabama\nDear Graydon:\nArrived this morning in Ann Arbor after a two weeks vacation\nin the north woods. Pound your letter of August 2? concerning\nthe filling of Jim Miles’ shoes which I think is a great prob¬\nlem and an impossibility. Note your second sentence in which\nyou say \"we are in bad graces with both Foundations.\" I’d\nlike to know more about that. Why? And what evidence is there\nthat such a condition exists?\nReferring to your dittoed letter, I would prefer a top level,\nhigh-caliber man (1). It seems that we require a man who is\ndecidedly a diplomat, a contact man rather than a man who would\nbe merely serving the NAEB. Has either one of the^Foundations\na suggestion to make concerning an acceptable candidate? The\nonly person that I feel would be outstanding is Wilbur Schramn.\nBut he would be impossible to get, I’m afraid. Possibly, in\naccordance with your classification, I would be inclined to\nsupport Keith Tyler. ’Whatever became of Sterling Fisher? Do\nyou think that Walter Emory might switch from television? How\nabout Maurie Novik? Although his labor relationship might elim¬\ninate him. Ken Bartlett, of course, will not be available.\nWhy don’t you get Siepmann? I think he’s too theoretical but\nhis idealism might appeal to the Foundations. And that seems\nto be the prime prerequisite.\nFor a younger and less experienced man I still favor Jack Dunn\nalthough he, like myself and some other members of the Board,\nmight inadvertently offend the Foundations by expressing his\nhonest ideas. I have previously recommended Tom Rishworth but\nhis disagreement with the PTA might be offensive and I still do\nnot know exactly why he’s no longer at Texas. Alan Miller might\nbe good. I have two boys here at Michigan either of which would\nbe good and would fit into this category - William Bender, Jr.\nand Ed Burrows. I’d hate to see either one of them go. I\ncertainly would like to see you, Graydon, filling this position\n- God help you, but you’d do a good job. I hate to admit it,\nbecause I do not entirely agree with all of his philosophies^but\nGeorge Pro'bst would be a good man. There is certainly a problem\ninvolved and I think that it requires a great deal of thought\nand investigation before it is finally determined. I’m certainly\nglad that it is in your capable hands. I’ll probably write you\nagain on the same matter - sorry Ifve been delayed in getting\nthis letter off. Best regards. o~cl«£ o .\nWaldo Abbot\nDirector of Broadcasting\nWA/mm ‘"
}