{
  "id": "d957-168",
  "text": "2/\nIn either of the two cases above, this must be a contract for\nfour years, subject to review by the Board annually. It is\nimportant that we get the right man and that he continue on\nthe Job for at least four years.\nI do not wish to present arguments for either of these two possi¬\nbilities mentioned. I should like to state, however, that it\nwas the opinion of the majority of the members of the Board\npresent at Ames, that a man in the first category above is more\nto be desired than a man in the second category. The next\nyear or two will be the most critical that NAE has ever faced\nand we must operate more effectively than ever before. Mqy,, I ask\nthen that you give me:\n(1) Your most thoughtful reaction to the two alternatives\nsuggested above.\n(2) A revaluation of the relationship that should exist\nbetween the Executive Director and the Board. Please\noutline in detail your thinking as to the scope of the\njob of Executive Director. (For your benefit, I am\nenclosing a copy of those sections of the minutes\nof the Gotham meeting which refer to this subject.)\n(3) Send me a list of suggested names under each of the\ntwo categories above. Please include, in addition to\nthe address of each, a brief statement of his background\nand, briefly, your reasons for feeling he would be a\ngood man for this Jbb.\nWe must find the right man. Please give this the most serious\nconsideration you have given any subject that has faced you since\nyou became a member of the Board and let me have your replies by\nreturn airmail. By early next week, all replies will be in\nand we can move into step two of the search. I hope the\nCommittee can meet between the tenth and the fifteenth of\nSeptember and begin sifting the results of your reactions and\nstart screening possible candidates. This is a job which\nwill take several days of very intensive work on the part of a\nCommittee. Please reply within twenty-four hours of receiving\nthis if possible.\n/s/ Graydon Ausmus"
}