{
  "id": "d957-187",
  "text": "l\nUNIVERSITY OP MICHIGAN\nBroadcasting Service\nAnn Arbor,MIchigen\nAugust lij.,1952\nDear Cohorts:\nI received a telegram from Siegel this morning requesting that\nI wire my choice for executive director, stating that the choice\nShould be made without delay. I think we should be very careful\nin selecting a successor for Jim Miles. The executive director\nhe.3 as much, if not more, power as the president. He is really\nthe head of NAEB. He is our representative in the field and to\nthe various foundations. In my estimation, Jim hasboenvery\ncapable and efficient and I don't want anybody in that job who\ndoes not at least come up to his standard. I feel very strongly\nthat we should not be rushed into a decision and, while the gioup\nat Ames may make nominations, these nominations should be sub¬\nmitted, at least, to the Board of Directors and, if possible, to\nthe 1TAEB active membership for final selection. I am not\nto have two or three or even more persons at Ames choose a person\nfor this important post just in order to fill it In a hurry*\nWhoever gets in will be there a long time and we'll be stuck with\nhim.\nWhen I received Schramm's letter, I suggested as successor Jack\nDunn or Torn Rishworth, I would taka any one of the regional\ndirectors or officers but I am not at all satisfied wltn any of\nthe five suggested in Siegel's telegram. Harley mlgnt be alr-ignt,\nMerrill I don't feel is strong enough to be executive director.\nLudwig, I have merely a vague recollection of. Russell Porter\nsounds quite good. ICeith Tyler probably wouldn't take it and he\nhas not been active in NAE3. I think his activity with ASR and\nthe Institute would divide his interests.\nI've been reluctant to send out mimeographed letters to the Board\nbut, on this matter, I feel very strongly that wo should get the\nvery best man for the job - no quick choice. The pay is high so\nyou can get the best6\nCordially yours.\nWaldo Abbot\nDirector of Broadcasting\nWA/mm"
}