{
  "id": "d957-190",
  "text": "- 2 -\nThe procedure is for the MEB board, or far its executive committee\nacting for the board, to nominate a director for the project. The University\nwill, in almost ary foreseeable contingency, accept your nomination and\nappoint him to the directorship of the project. There is nothing legal that\nsays the Foundation must also approve, but we*re crazy if we don’t give them\na chance to. Therefore, I should be grateful, when you get ready, for the\nchance to talk over some of the candidates with you, and possible salaries, in\norder to help you forecast any possible difficulties.\nLet me make it perfectly clear, as I have in the past, that the\nUniversity of Illinois has no vested interest in this project, although it\nhas a deep interest which it has expressed in terms of a good many thousands\nof dollars and thousands of man hours. We are perfectly willing for you now\nto wash out the project, if you want to, or to try to move it elsewhere if\nthat now seems desirable — although in that latter case, you would have to\nmake your own peace with the Foundation. We want you to do what you consider\nbest for educational broadcasting in America, and if Illinois isn’t in that\npicture as you see it we* 11 bow out with no difficulty to you.\nBut supposing, in the absence of contrary evidence, that you still\nwant to continue the project, and at Illinois, I am willing to be helpful in\nany way I can to pull the project over this hung). I have to be with the Mr\nForce for the next few days (which is why you won’t see my own signature on\nthis letter) but on Monday 1*11 call Sy and talk over what steps to take.\nSupposedly, many of you will be at the Ames meeting. I hope you can have a\nmeeting there, at least an executive committee meeting, and if at all possible\ntake action at that time. That is one of ray weeks on special assignment with\nthe Air Force, but if you will set a day for that meeting I am willing to fly\nup to Ames for that day — if my being there will help you to make the plans\nand hurry the action needed.\nYou have the ball now, and Sy will call the signals. 1*11 talk to\nhim Monday aiyd check.\nBest wishes to you alii\nSincerely yours.\ntO £\nWilbur Schramm\nDean\np.s. The new tape duplicator seems to work like a charm.\nSt**Axfa."
}