{
  "id": "d957-194",
  "text": "EXECUTIVE DIRECTOR’S LETTER NO* 8\nFebruary Us 1952\nTHE MIDWEST LOOKS GOOD—With more than 3*000 miles oa ay car since 1 last saw\nUrbana I pulled in hero Wednesday morning to find the desk thoroughly covered.\nThree solid days of work have let me get down to at least a minimum oi working\nspace. Needless to say two weeks is plenty to spend amy from heme.\nMy visit with Kendall Crane at Duquocxie University oonvinoed me Nhat\nhere ms one area which we thought virtually dead but it actually is really full\nof life. Crane is a driver? ho has plenty of support from his administration and\nhas finally convinced the newspapers tiiat they should carry the YcDUQ program\nschedule, lie is making himself hoard in Pittsburgh. This is one area we can\ncount on in the future*\nLEHIGII UNIVERSITY, BETHLEHEM, PA.—I had ay first opportunity to visit an associate\nmember. Barrett Davis, the direotor, is doing a fine job with what he has. He\nhas many of our problems plus many added tasks which surround a relatively small\nindependent male college* He spoke very highly of HAEB and made two very fine\nsuggestions—one, that there be an \"ASSOCIATEfL PAGE” in each issue of the News-\nLetter and, two, that additional copies of the News-Letter should be available to\nthose members who wish to buy them at, say at a year. At last count, we\nhad Ul associate members. Undoubtedly, they should be considered more in our\noperational plan.\nI will not comment on the New York meetings. You were all there and have\nyour own ideas.\nPrior to the meetings I had a chance to visit Dorothy Lewis, U. IU Radio,\nwho gave plenty of promises of cooperation, following the meetings, I had a\nchance to do the New York work on seeing that our UNESCO exhibit got properly set up.\nfive days in Washington were put to good use. I was luohy and found\nLowdoroilk, Broderick, and Dunham all in at the USOE Radio Office* If you haven’t\nkept up with things these people are doing, it would be worthwhile to investigate.\nAlso visited with John Mieghor (pronounced Harr) of the Department of State Radio-\nTV Lais ion. lie is limning the ball for us on the new Voice of American radio\nseries. lie is also trying to secure permission for us to utilise in some manner\nthe tremendous backlog program material available at the Voice of America Library\nin New York.\nI had the opportunity to have a very fine dinner with Ralph Stootle and\nhis fine family and to hear more about the JCLT work* Also with xVonk Abbott of\nthe American Council, with further details on the forthcoming Pennsylvania meeting."
}