{
  "id": "d957-35",
  "text": "Roiirer , Hibeer 8c Replogle\n601 THOMAS BUILDING\n1314 WOOD STREET\nDallas 2,Texas\nPROSPECT 2754\nNTA • CHICAGO • CLEVELAND DALLAS • LOS ANGELES • NEW YORK\nOctober 27, 1952\nMr. Graydon Ausmus\nWUOA Station\nWUOA, University of Alabama\nUniversity, Alabama\nDear Graydon:\nI am sorry not to have answered your letter sooner. In our work we travel\nquite a bit, so I have just gotten around to giving you information concerning\nGale Adkins. As you well know, a letter can only give limited information.\nI will try to hit the important items. First of all, if I was choosing an\nexecutive director for the HAEB I would select Gale without hesitation.\nOn the strength side, I would mention first of all his human relation skills.\nDuring all the various upheavals and turmoil at Radio House, Gale has main¬\ntained the responsibility, good will, and admiration of all of the conflicting\nelements in the various Radio House controversies. Second, I think he has\nexcellent administrative ability. He plans a course of action and is able to\nadminister his plan effectively throughout the process of implementation.\nThird, he exhibits emotional maturity in his behavior. Fourth, he makes an\neffort to understand what makes people tick.\nOn the side of his limitations, I would list the following. Although in\neach instance when Radio House has been without a director, he has stepped\nin and filled the gap efficiently. .It is my opinion that he has given a\ndisproportionate amount of time to production of radio programs. This ties\nin with my opinion that he gives time to the operation of his job that might\nwell be used to further his personal welfare. For example, working on his\nDoctors dissertation for several years. It would have been to his advantage\nto get the thing written because he has finished all of his requirements\nexcept the dissertation. He tells me that he is just about to complete the\ndocument, but you know that the dissertation is not finished until you get\nyour signatures. Another limited characteristic is that he is not particularly\naggressive in pushing himself or his ideas.\nYou may wonder why it is that Gale is always selected to take over the operation\nof Radio House when someone leaves or an emergency arises, yet has never been\nmade permanent director. My analysis of this situation is that Gale has not\npushed himself and is considered by the Radio Committee as a \"local boy.\""
}