{
  "id": "d957-39",
  "text": "If I havc rambled sufficiently to indicate the job I haw\nin mind for this special committee, may I then propose the names of\nthose people® I should like to request that the following oeopl©\ngo through on that project immediately and meet ahead of our Board\nmeeting by six or eight hours* I should like to mm to that\nconmittoes Dick Hull, Frank Schoolcy, John Bunn, and George Frohst,\nwith Dick acting a® chairman* I would suggest that Dick consider\ninviting to this particular meeting on Sunday'afternoon Arndnd\nHunter or Garnet Garrison if he feels that either of them can contri¬\nbute some constructive thinking to the committee work* this is not\na renaming of Si8® television commltto© but is a specific assignment\ngroup for this one chore©\nBy way of an agenda for the Sunday evening November 2 meet¬\ning of the Board, I would suggest then that m approve the agenda and\nspend the remainder of that meeting hearing the recomaendations of\nthis committee* This committee and the resulting discussion will put\nua in a batter position to meet with representatives of other organize\ntions®\nAnd this brings m© to the point I mentioned above which is\nthat m should attempt at the pre-convention Board meeting to work\nout a coordinated and cooperative drive for the development of educa¬\ntional TV* I would suggest, therefor®, that th© Wednesday afternoon\nand Wednesday evening meetings be devoted to this problem. Certainly\nby Wednesday afternoon we will have integrated our thinking on th©\nmatter and will be prepared to discuss th© future of TTf and radio\nwith all of those who are active in it* I shall invite representatives\nof the two foundations with which w© have worked most closely, a\nrepresentative of the American Council on Education, JGET, and a\nnumber of other individuals ^ If any of you have ideas for groups\nwhich should b© invited, 1st me know immediately and the invitations\nwill b® sent*\nWith these two exceptions which are primarily organiza¬\ntional, I think th© agenda is complete® Unquestionably w® have a\nheavy week facing us and a very significant one for th® future of\nth® organization. I certainly wish it were possible for Si to be\non hand throughout 11a® entire session, but he indicates that he will\narrive about noon Wednesday and take over from there© I look forward\nto seeing all of you for the 0$p#au meeting Sunday, November 2©\nyours,\nOAipse\nP. S„^I\njust got through to Jim by telephone and h® will handle\nth® invitations to this meeting©"
}