{
  "id": "d1495-3",
  "text": "- 4 -\nWQI - Iowa State.College. W. I. Griffith sends us these notes concerning\na further extension of his station1s already impressive services?\n\"We now have the service of the United Press news wire and printer. The\nprinter is installed in a newly completed studio in a room adjacent to the\nclasses in journalism and we are broadcasting several news periods using as tal¬\nent students in a radio course conducted jointly by the Department of Journalism\nand Public Speaking,\n“We have two or three periods when we use more news items comparable to the\nordinary commercial station news broadcast. Then we have what would correspond\nto headline material that is broadcast each hour and is known as the \"news of\nthe hour on the hour”. We believe that this is an important service and that\nwe have many listeners to these items who stay tuned in for the program that\nfollows,\n“We are also rebroadcasting an emergency program released by KGHO at Des\nMoines, the police station operated by the Bureau of Criminal Investigation.\nWe receive this by short wave and broadcast it from 11:50 to 12:00 each week day\nmorning. The ordinary police call is broadcast by short wave to police officers\nand the public does not hear these broadcasts but the Bureau of Investigation\nmodifies this noon program somewhat so that the public can assist in locating\nmissing persons and apprehending criminals who have stolen cars or committed\nother depredations.“\nFACILITIES AND EQUIPMENT\nWSAJ - Grove City College. H. C. Harmon, acting director reports, \"Our\ntransmitter has been completely rebuilt since the opening of the semester, fully\nmeeting the latest requirements of the F.C.C. It is now being tested and we hope\nit will be on the air by January 1, 1957.\"\nKSUD - University of South Dakota. B. B. Brackett reports that his station\nhas been authorized to construct a new transmitter but the inability to get de¬\nlivery on parts from manufacturers will hold up the work for several weeks,\n&FKU - University of Kansas. \"We have installed a Universal Recorder which\nwas put into operation at the beginning of the school year,\" reports Miss Mildred\nI. Seaman? Asst, Program Director.\nWILL - University of Illinois. Jos. Wright reports: Permission to improve\nthe facilities of the University of Illinois broadcasting station has been grant¬\ned by the Federal Communications Commission. Beginning about December 1, station\nVALLL will operate on 580 kilocycles and will broadcast programs from 8 a.m. to\nlocal sunset. Extensive improvements in the transmitting equipment are now being\nmade to comply with the requirements of the F. C. C. Two new steel towers, ap¬\nproximately 325 feet in height, are being erected on the extreme south part of\nUniversity property. A now building at this site will also house the transmitter.\nWhen the construction is completed WILL will launch into an enlarged schedule of\neducational programs.\nKWSC - Washington State College. Radio station KWSC is growing up. After\noperating for years on 2000 watts power, the State College station soon will in¬\ncrease its power to 5000 watts. A new studio, improved microphones, revamped\ntransmitting equipment, and a new 224-foot single tower antenna (using one of\nthe newest principles of broadcasting) all are’ being combined to give KWSC a\nclearer and more powerful voice.\nA large part of the equipment being used was designed and installed by State\nCollege engineering students under the direction of Dean H. V. Carpenter."
}