{
  "id": "d1031-12",
  "text": "\"Letter, frog, KoyHc\"\nTuesday\nJanuary 26, 1954\nHarry—\nDick called yesterday in Houston, He had some worry about how to handle the\nthru npm at his meeting*—late yesterday—-I think I did give him some help—He will\nwrite me at Cuba—1*11 be in Miami Beach, Hotel Monte Carlo-Sendy 31 for 6 days and\nthen home—where I will give you full report,\nDick told me he called Bill in Pittsburgh for ideas—he suggested that Bill was\nmeeting with a group of Labor Peopleo.\nCalled him this morning—as an old friend^Pittsburgh was not on list of cities\nfor me to contact. Glad I did anyhow—he has a meeting set for this PM—with IA and\nAFTRA. Told him how to handle the problem. And lucky for our side I am meeting both\nHeller (AFTRA) and V&lsh 'TA.) in Miami,\nIt will 3aelp to know that Pitteburgh is IA Town* no XBEW in here—so It will be\neasier. Had a very fine session with Sener—And Day (SQF*)* Sener is by far ahead in\nhis contacts—lay©*! out his whole approach when he meets with them week of Feb, 1. He\nhas friendly relations with IA-NABET-IHEV. His problem will be when he has to formalize\nhis procedure—when he adds staff—and goes on for longer time,\nHe is completely satisfied that my formula,as explained to you, if I get it accepted,\nwill help him immediately to solve his future needs.\nDay, has a good relationship with HAHET-IBEW—Both want to keep IA—out— (strange\nas that may seem)* He agrees to formula—and it would solve his present and future needs*\nI am getting staff breakdown for him,,\nHouston was a real treat, lnspit© of all the vorrys. 1 got to watch my step* Texans\nare sensitive ate*, etc*, and he isn’t one of us ete<, etc* That\"s nonsense—he is—\nalert and willing to take suggestions * And frankly after first half hour be said, \"He will\nbe asking m for help—Rather then 71 so versa\".\nHis ia not an employment problem* There are no Unions in Town except Musicians—And\nI think I can help* Will talk to Petrillo next week. I urged that he stick closer to\nHAEB, He did attend Oklahoma Meeting* Maybe you saw him in N* I., He said he was at\nSpeech Cyrasstion..\nHe is outspoken in his school. Democratic tendencies and respected by School\nAdministration for it. Between us, I will try to help him with Mayor, Roy Hofheinz, an^\nold FM, Ass. Pres — Hope this will give you some idea of present set up*\nHarry, this in confidence, John Schwarzwalder wants help from Ford—from Centre Set\nUp, He needs some equipment* It’s amazing what he does with his little budget, I only\nsaw it on surface, I confess. He got the green light yesterday for a very good Kegro\nProgram-a tie-up with Hegro Univei-gity, He says every one is scared about his\nBut that he has not had any suggestion of what to do—or what not to do from that source.\nHe will be keeping in close touch with you.,\nAs Ever,\n/s/ Hovik\ncopy made 1/28/54"
}