{
  "id": "d1031-32",
  "text": "/ Thank you for your offer of help. I can’t think of any way we have\nneed pf your services at the moment but I can*t be sure that a need might arise\nalmost momentarily.\n/ Events of the past few months have put us on a fairly firm foundation#\nSeven leading businessmen have been elected tol our Board and have begun to make\nplains for a corporate fund campaign this Fall. Reaction to our modest program\nsei/vice of films from the Center has been good. 1 believe we are well established\nin/ the minds of our audience - thanks to the popular program, \"Shakespeare on TV.\"\nrot With respect to our relationship with unions, there has been very little\nactivity on this front during the past weeks. The musician’s union has indicated\n/their willingness to let us use their musicians at no cost. I doubt that they\ncould be more generous. IBEW is still willing to hold off until we get started\nwith live programming and then look the situation over. Their representative\nhere has been very considerate and I feel certain a mutually agreeable arrange¬\nment will be worked out when the time comes. Only AFT BA has presented problems.\nI feel sure this is due to the fact that there is an overly-zealous woman at the\nhead of the organization. Their own Board is beginning to show signs of bringing\nabout a change in policy. They have talked in t erms of a contract that would re¬\nquire \"normal membership fees\" for all of our talent, including teachers. I have\nresisted this on the grounds that teachers making occasional appearances an our\nprograms are not earning their living as television artists and are, therefore,\nnot within the jurisdiction of AFTRA. This happened at least three months ago\nand AFTRA has not been heard from since. I don’t think they are convinced but\nmay be confused.\n_I am enclosing a copy of our annual report which will tell the story\nof the 3QSXXX past year’s activities. We appreciate your interest in us and will\ndo our best to keep you posted on our progress.\nRegards,\nJames Day\nGeneral Manager"
}