{
  "id": "d944-70",
  "text": "h\nA tabulation of replies received revealed that considerably more than half\ndid think it feasible to attempt group planning of either the series on Canadian-\nAmerican Relations or on the Conservation of Natural and Human Resources. Accord¬\ningly, provision was made for group planning sessions, in the four-day advance\nschedule, with the understanding that if the projects did not work out, the time\noriginally allotted to them could be diverted to other activities.\nThe basic plan provided for an orientation session on the first evening of\nthe Seminar, at which the members of the group would meet the staff, their St.\nLouis hosts, representatives of the NAEB, and (most important of all) each other.\nIn addition, the Seminar would be addressed, at this opening session, by Professor\nHarold Hand of the University of Illinois, who had provided inspiration and enthus¬\niasm at opening sessions of other conferences.\nThereafter, the plan called for morning sessions from 9:00 a.m. to noon,\nwith approximately half the time devoted to talks by the Seminar staff or guest\nspeakers, and the remainder spent in question-and-answer periods or in discussion\nof the problems brought up by the talks. Afternoons were to be given over largely\nto continuation of the discussions, with a little over an hour reserved for work\non the two program series described above. Finally, evenings were to be devoted\nto auditioning the tape recordings of previously produced educational programs\nwhich both participants and staff members had brought with them, along with a few\noutstanding tapes from other sources. Analysis and discussion were to follow the\nplaying of each tape. As may be seen from the program schedule which was actually\nfollowed (Appendix 2), this plan was followed on the whole.\nDigests of Talks and Discussions\nWhile it is impossible, no matter how valuable and desirable it might be, to\nreproduce the thousands of words of good counsel and inspiring suggestion which\nwere spoken in the course of the Seminar, an attempt is made herewith to reproduce"
}