{
  "id": "d944-86",
  "text": "20\nway, we may leave the specifics of the curriculum to the teacher. Surely the\nstudents are in a better frame of mind to study if they have been stimulated by\na fine radio program.\"\nIn the discussion which followed, there was a good deal of exchange of opin¬\nions on this point. Most of the writers who had come from university stations\nagreed with this point of view, while those from stations operated by school sys¬\ntems inclined toward a program meant for one grade, or two at most, with closer\nlinking with the curriculum.\nThe guest speaker for the afternoon session was Dr. John Whitney, Consultant\nin Science at Harris Teachers College, Chairman of the Elementary Science Radio\nPlanning Committee of the St. Louis Public Schools, and Chairman of the TV Science\nPlanning Committee for station KETC, the St. Louis community educational tele¬\nvision station. Dr. Whitney spoke briefly on the experimental participation pro¬\ngram, which is the backbone of the science broadcasts produced by KSLH. As an\nexample of how radio can implement a new course of stucfy he discussed a new science\ncurriculum which had the purpose of increasing emphasis on simple experiments.\nRadio was used to encourage teachers to use the new course of study and three re¬\nsults had become apparent:\n1) The radio programs developed increased interest in the experimental\napproach to the study of elementary science.\n2) The radio listening had taken students and teachers away from a page-\nby-page study of science texts.\n3) The simple, yet interesting, experiments described and recommended in\nthe broadcasts had removed the fear some teachers had felt about per¬\nforming classroom experiments.\nThe second segment of the afternoon session was spent in hearing from various\nmembers of the Seminar who described particular problems in planning and writing\nparticularly successful series, and in listening to tape recordings of typical pro¬\ngrams from those series."
}