{
  "id": "d736-14",
  "text": "SAN FRANCISCO OFFICE\n105 MARKET STREET\nNEW YORK OFFICE\n270 PARK AVENUE\nTEL.: 27-5116/9\nCABLE ADDRESS\nFREE ASIA\nROOM 411-412 NIKKATSU INTERNATIONAL BUILDING\n1, YURAKU-CHO, TOKYO\nJune 9, 1953\ndear Frank:\nThis Committee’s policies change with every full moon. After\nthe ’’realignment” of the radio division, they've okayed a\nproposal to send me around to all the capitals of Asia (Manila\nexcepted) to do the proposed series on Asia and its problems.\nAll of which means the NAEB, if still willing, can get these\nprograms along the lines of correspondence of late. I can only\npresume the trek will start sometime in July, though it won't\nbe until August that the programs will start flowing to you.\nMy gawd, I hope you still want them!\nOne of the big bosses came out here Saturday from San Francisco\nand told me to get ready to fly around for about six months.\nMarg and I were all set to plunk down all the dough needed to\nget us to Europe. As is always the case in this accursed\norganization, they gave me no further details. Marg is going\nwith me, whatever they decide to do about paying her freight.\nIt would be an impossibility to maintain a house in Tokyo\n(or any city in Asia) and get along on what they offer in\nper diem money. This jaunt, I am told, can develop into a\npermanent ’’roving assignment” for me, though I'm not too sure\nI'll enjoy suitcase living for any extended period of time.\nI presume the Committee will contact you just as soon as I\niron out some bugs in the original itinerary, like the elimination\nof the Philippines, where the Committee got into a row by way of\nmanipulations with the Magsaysay group.\nNBC and the foreign diplomats in Tokyo are most pleased with the\nidea. I might add that NBC is Folster, who has offered us\nhis correspondents as moderators, p}us his friends with CBS\nand the agencies in the other parts of theworld. The foreign\ndiplomats have assured us of support, even rugged Indonesia,\nthough anything can happen to those people.\nI'm enclosing the stamps I forgot to enclose in the last letter.\nBy the time this tour is completed, we’ll have you and yours\nwell supplied with stamps.\nMaggie sends her love."
}