{
  "id": "d736-20",
  "text": "The Free Europe University in Exile is an exciting\nand dynamic part of this effort. FEUE provides 200\ncarefully selected young refugees with board, lodging\nand special seminars in their own tongues. It also\nenables them to attend the famous French University\nof Strasbourg. The Communists angrily denounce the\nproject as a “school for spies.” They fear the very\nexistence of these students who have sought asylum\nat FEUE to build together their own futures and,\nperhaps, the futures of their nations.\nIntellectual Cooperation includes many other proj¬\nects of long-range importance. It provides scholarships\nat American and European universities for 85 students\nfrom Central Europe who are also pledged to return\nafter their homelands regain independence. It prepares\ntextbooks to fill the educational vacuum that will exist\nafter liberation. It undertakes research projects to sup¬\nply the intellectual and factual background for the\neventual reorientation of the captive area. It maintains\ncurrent records of Communist publications and of the\nevolution of Communist law.\n3. RESEARCH & PUBLICATIONS\nAll the Committee’s activities require precise\nknowledge of current conditions in the captive coun¬\ntries. To meet this need the Research and Publications\nService is charged with assembling and distributing all\navailable data on the target area.\nInformation is derived from five primary sources:\na) 300 Communist newspapers and periodicals, b)\n40,000 words per day of refugee interviews, c) moni¬\ntoring 22 Satellite radio stations, d) 10,000 books and\npublications and e) reports derived from exile sources.\nThe RPS files contain over a quarter of a million items\nof information from these sources.\nVital to the Committee’s internal operations, this\ninformation also reaches the American public by\nspecial requests and through press and radio. A\nmonthly magazine, News From behind the Iron\nCurtain, is widely distributed to universities, libraries,\ninformation media and other groups. Over 175 re"
}