{
  "id": "d736-27",
  "text": "(NOTICE? The following is provided for the information of the addressee only.\nPublishing or further distribution of all or part of this material\nis prohibited without permission of The Asia Foundation.)\nCASE STUDI\nBOCK PROGRAM\nIntroduction\n\"A book may be as great a thing as a battle.M Benjamin Disraeli\n(I80ii-I88l)\nThe Asia Foundation believes Disraeli’s quotation to be as apt\ntoday as it was 100 years ago, if not more so. Because of this belief* the\nFoundation has accelerated its operations in Asia in the field of books. The\ndata given is for the information of publishers and other interested agencies\nwho* it is hoped5 believe as the Foundation does—that an enlightened Asia\nis America’s best ally.\nGeneral\nFoundation book programs have both long and short-range objectives,\ndetermined after an analysis of the requirements has been made in a given\nAsian country. Programs also are multiple and comple x§ multiple because of\nthe variety of approaches and conditions? complex because of such factors as\nthe age-old problem (in Asia) of distribution and the danger of being labeled\npropagandists by countries suspicious of any American assistance, to mention\na few.\nPolicy\nThe Foundation’s general policy is to support Asian groups and inci-\nviduals working for Asian objectives which parallel the long-term Interests\nof the free world. Application of this policy in the field of books, there¬\nfore, calls for a three-fold actions\nEncouraging the writing, publication, and distribution of Asian\nbooks which serve the above purpose?\nEncouraging a growing exchange of Ideas and experience among the\ncountries of Asia through this medium?\nincreasing the access of Asians to Western ideas through books.\nEmphasis is placed on the first two points, as ultimately being of\ngreater importance and because few other groups are active in this field, and\ntherefore, is the Foundation’s main contribution toward overcoming the strong\nposition of communist literature in Asian countries. However, the urgency\nof the situation in Asia in terms of the communist superiority in furnishing\nbooks has caused the Foundation to give more importance to the last point than\nit originally had planned.\nOperating Methods\nThese include capital investment, periodic general subsidies, sub-"
}