{
  "id": "d736-28",
  "text": "-2-\nsidies for particular books* royalty guarantee plans for authors* or straight\nsubsidy for authors* provision of newsprint* and occasionally guaranteed cir¬\nculation.\nAt all levels* the Foundation provides technical assistance* super¬\nvision* and encouragement? calculated to stimulate truly Asian effort and to\nproduce a continuing commercial operation independent of outside assistance.\nAsian Books in Asian Languages (Except Textbooks)\nCultural\nBecause of the truism that a cultural heritage can be a most cohesive\nforce in the unification of a nation* the Foundation constantly encourages any\nindications of a revival in this field* particularly as it applies to litera¬\nture. Thus* for example* in Korea the Foundation is giving modest* selective\nassistance to aid authors and publishers to continue work in a period of eco¬\nnomic uncertainties. The Foundation also is aiding a publishing company in\nbringing out a Modern Library Series* consisting mainly of the work of Korean\nscholars. This will, serve the dual purpose of providing Korea with non-\ncommunist literature and* at the same time* providing an economically profitable\noutlet for Korean authors and scholars.\nEducation\nTranslation of Asian Books into Other Asian Languages and English\nThis falls under a long-range Foundation objective of promoting cul¬\ntural exchange within Asia* particularly in relation to the humanities and\nsocial sciences. Books are only one means of pursuing this objective] others\ninclude international conferences* travel* international fellowships and\nscholarships* and international organizations of various sorts. Major obstacles\nto progress in this category include the present lack of interest among Asians\nin the culture of other Asian countries and language difficulties. In these\ncircumstances* translation of books from the original Asian language into\nEnglish for distribution in Asia seems to offer the most promising first step*\nsince English is the most international language in the area today. Publi¬\ncation in English in Asia will have the advantage of keeping the price down*\nwhile publication in America may serve to stimulate greater Asian interest\nand incidentally aid Foundation public relations.\nAlthough this is recognized as an important field for the Foundation,\nlittle has been accomplished to the present time. The Foundation is exploring\nthe possibility of establishing a Modem Asian Library which would provide a\nmedium for translation and publication of top Asian writings for distribution\nin various Asian countries and later, possibly* in the West. The Asia Foundation\nHong Kong is assisting to some extent in the publication in America of one Chi¬\nnese book. Usually* manuscripts with commercial possibilities are recognized\nby American publishers] the content of most, however* does not justify commercial\npublication in the United States. The Foundation is also interested in the\ndevelopment of cooperation between Asian newspapers in different countries,\npossibly through the International Press Institute. This cooperation might be\nextended into the book field* the first step being serialization of Asian\nbooks in various newspapers.\nTranslation of Western Books info Asian Languages\nThe Foundation's objective is to help remove obstacles to the trans-"
}