{
  "id": "d736-30",
  "text": "-Jl-\na very useful method of Foundation support to Asian groups or organizations. The\nFoundation is not in a position, however, to give substantial help in creating\nnew libraries or in adding to existing ones, except where this is part of an\nintegrated activity supported by the Foundation or seems to play a key role in\nmaking possible an undertaking which has substantial Asian backing and support.\nThe Foundation may give support to new libraries in the form of buildings as well\nas books but will investigate carefully to make sure that there is likely to be\nenough sustained effort over a period of years, independent of Foundation assis¬\ntance, so that necessary additions to keep the library up to date can be made.\nWhen aiding libraries to procure books, the Foundation tries to do so in the\nmost efficient manner, taking advantage of the facilities of other organizations\nin the field wherever possible.\nIn this field, the Foundation assisted a small library for students of\nthe refugee colleges in Hong Kong, which was expanded to become a substantial\nresearch library on Chinese culture, fulfilling an important need for the stu¬\ndents and intellectual community in Hong Kong and, at the same time, providing\na repository for many valuable and important works brought out of China by the\nrefugees.\nAid also was given, in another Asian country, to establish a reading\ncenter and lending library. This provided the Foundation with a means of\nworking with an influential Chinese group in that country, enables Chinese\nhigh school students and the general public to have easy access to appropriate\nreading matter, and helps to break down barriers between the Chinese and the\nnative citizens. It is intended that this library will be the foundation of\nfuture expansion into larger community libraries with attendant organizational\nfunctions.\nIn addition, books have been provided for small libraries in remote\nAsian villages| technical and books of political and general interest, in Eng¬\nlish, have been given to teacher-training colleges and military training\nestablishments! and selected books on world politics, journalism and other\nfields of writing, as well as aid in building a journalist association head¬\nquarters, have been provided.\nGifts of Texts and Other Study Material in English\nPrograms in this field are a necessary supplement to efforts to over¬\ncome the inadequacies of local publications and international commercial\ndistribution. The Foundation^ interest is to encourage and support efforts\nwhich are calculated to provide them in an efficient and inexpensive manner.\nSubsidiary objectives are to stimulate contact between Americans and Asians\nof like professional interests and to benefit Foundation public relations.\nThe Foundation is experimenting with a project to assist American\nprofessors in sending books in the humanities, social and natural sciences to\ntheir colleagues in Asia. The project was conceived originally with respect\nto Japan but is being applied to all countries within the Foundation^ field\nof interest. The Foundation provides purchase and mailing costs for a limited\nnumber of books which are sent by American professors to Asians with whom they\nhave some personal contact. The stimulation of personal, professional contact\nis an important aspect of the program, as well as the possibility of placing\nin the hands of key Asians books which relate to their interests and are not\nlikely to be considered propaganda. At present the project is being tried\nout in cooperation with the University of Washington and Stanford University\nand is under consideration by the University of California in Berkeley. It"
}