{
  "id": "d1712-1",
  "text": "Statements were also made by Harry Rosenfield, attorney for the Ad Hoc Committee;\nDr. Robert Shafer, representing the National Council of Teachers of English; and NAEB\nPresident Harley, who stated that the Bill makes no distinction between educational and\ncommercial broadcasting and \"by refusing to recognize educational broadcasting as an\nintegral part of education itself, effects a return to 19th century educational methods.\nRosenfield, speaking for the group, warned that unless drastic changes are made\nin the Bill so as to provide necessary and suitable protection for education’s rights,\neducation would be compelled to oppose enactment of this Bill.\nOn August 8 and 9, the Panel of Consultants to the Register of Copyrights met in\nNew York to allow interested parties to react to the proposed Bill. The same representa¬\ntives of education plus Gene Alleinikoff, counsel for NET, made vigorous statements\nabout the regressive and deleterious effects these strictures would have upon education\nand, in particular, upon educational radio and television.\nThe Register has stated that the present Bill was introduced for purposes of\nstudy and comment and no hearings will be held on it at this session. A revised bill,\ntaking into account the discussion at the August Panel Meetings, will be introduced\nearly in the 89th Congress.\nA thorough report on the copyright situation will be distributed shortly by the\nNAEB for the membership.\nHARLEY TESTIFIES AT EXCISE TAX HEARING\nPresident Harley appeared before the House Ways and Means Committee on July 28,\nwith television set manufacturers, retailers and commercial broadcasters, to urge the\nremoval of the 10 per cent excise tax on television sets.\nMr. Harley reaffirmed NAEB approval of the all-channel legislation enacted in\n1962 and put into effect this spring. This law requires that all television sets\nshipped in interstate commerce be able to receive all the channels, 2 through 83.\nHarley stated that \"if educational television is to develop its potential, it is clear\nthat UHF television must succeed.\"\nHe pointed out that the high cost of FM sets when they were developed in the\nmiddle 40's had resulted in a delay in demand for FM sets. \"This increased price (on\ntelevision sets) will have a significant deterrent effect upon the rate of set replace¬\nments.\" A relief from this price increase would result in softening \"consumer resistance\nin the new television set market, and by that fact encourage educators and community\ngroups to make the large investments necessary to enter the educational television\nfield,\" Harley stated.\nIn closing, the NAEB president urged that \"such legislation as the Congress\nenacts embrace the following: (l) Excise tax relief that does not exceed the cost of\ninstalling UHF tuners, and (2) Excise tax relief that is temporary but of not less\nthan two years' duration.\"\nCopies of Mr. Harley's complete testimony can be obtained from the Washington\noffice."
}