{
  "id": "d1809-3",
  "text": "First, there’s no physical difference between the\nModel I and the I-Prime. The I-Prime is 3 db bet¬\nter at 7000 cycles, has 30% less distortion and gives\nbetter definition on the sound track. If your Model\nI galvo needs repair, an overhaul will cost you $120\nplus parts or it can be converted to the Model I-\nPrime for $300. One reason for the modification of\nthe mounting platform is to permit the use of an F-\nPrime (variable area) galvo. Since its snout is\nshorter, .270 inches of the shoulder of the platform\nmust be milled off to permit proper focus on the film.\nAt the same time this milling operation is per¬\nformed, Maurer representatives would like to see\nthe method of mounting the galvo changed. They\nhave machined the bottom of the galvo assembly and\nthreaded it to permit it to be fastened by two screws\nfrom below. They feel that it is desirable to have\nthe galvo mounting platform machined so that the\ngalvo is set down on the plate, pushed forward\nagainst the milled shoulder and the screws tightened.\nSince the height of the center line of the optical\nsystem is fixed, and the azimuth of the track is fac¬\ntory adjusted parallel to the base, there is but one\nadjustment necessary, track position, when the galvo\nis changed. With the present system of mounting,\nsound track position, azimuth, and optical axis\nalignment with the center of the sound roller, may\nbe changed in an attempt to adjust any one of them.\nTo accomplish this improved method of mounting\nthe galvo, a filter condenser under the camera base\nmust be relocated and the necessary holes drilled\nfor mounting screws as well as access holes for\ntightening them.\nWe now have complete information on the ad¬\njustments necessary when the repaired or modified\ngalvo is reinstalled in the recorder. Three major\nadjustments are required, in addition to focusing;\n(1) alignment of center line of the optical system\nwith center of sound roller, (2) sound track position,\nand (3) azimuth. These are the adjustments for\nwhich a charge of $10.00 per hour is made at GPL.\nThe preferred way of making the azimuth adjust¬\nment requires the use of a special alignment tool,\ncosting $90.00. This is a slit mask which replaces\nthe mask normally used in the recording system.\nWe hope to have this information on its way to\nyou before this is published. While the cost of the\nalignment tool is high, a group purchase of a num¬\nber of these would bring the price down. When an\nimproved method of mounting has been settled, you\nwill be provided with the information so that it may\nbe done locally. Mr. Belcher and Mr. Kelley believe\nthat by performing the machining operation locally\nyou can save several hundred dollars as well as\nminimizing the time you are without the use of\nyour recorder.\n—NAEB—\nFor those of you who have film processors, the\nJ. A. Maurer Co. is making a nylon film roller for\nuse in processing machines. This newly designed\nroller has no metal parts and features sleeves and\nretaining rings of linen-base bakelite and glass ball\nbearings encased in nylon bearing cages. The rollers\nare unaffected by and will not affect industrial or\nprocessing solution or films. Prices and quantity\ndiscount schedules are available on request.\n—NAEB—\nWe want to call attention to a paper presented at\none of the briefing sessions at the NAEB Convention\nin Omaha, “Techniques of Off-the-air Pickup of\nTelevision Signals”. It was presented by Jack Beever,\napplications engineer for the Jerrold' Electronics Corp¬\noration. We are mailing these to Chief Engineers of\nall ETV stations. We have extra copies which will be\nsent to others interested up request.\n—N A E B—\nPatricia Green Swenson, manager of KBPS, the\nPortland Oregon Public Schools AM Station, sends\nus a report by her chief engineer, Harold Potter, on\nmethods they have used in combatting radio inter¬\nference caused by fluorescent lights. She also asks\nwhether the modernization of school lighting has\ncaused this same problem in other cities, and if so,\nwhat has been, is being, and can be done about it.\nKBPS has been using two types of filters which\nthey have found effective in four out of five cases.\nThey are the Cornell-Dubilier, Model IF-18 and the\nSprague, Model F-400. The major disadvantages\nof using the filters is their cost and the labor involved\nin installing them either on the receivers or in the\nelectrical outlets.\nHere is a chance for our readers to help in the\nsolution of this problem. Please send your comments\nand suggestions to KBPS with a copy to me at NAEB\nHeadquarters.\n—NAEB—\nAnother excellent paper was presented at a brief¬\ning session of the NAEB Convention in Omaha by\nRichard F. Vogl, manager of WOI Radio. Its title\nis “Three Years of Stereophonic Broadcasting at\nWOI.” The paper presents their experiences in\nstereophonic broadcasting and we believe, it is of in¬\nterest to all NAEB member stations. We’re having\nit mimeographed and are mailing a copy to all chief\nengineers of educational radio and television sta¬\ntions. If we miss any one, we’re sorry. If you’ll drop\nus a card we’ll be glad to mail you a copy.\n—N A E B—\nWe’ve had an inquiry from Marshall Gunselman,\nDirector, Audio Visual Center, David Lipscomb Col-\n4\nENGINEERING NEWSLETTER"
}