{
  "id": "d1805-1",
  "text": "Jack Summerfield, WGBH-FM, Boston, Mass¬\nachusetts\n(Note: Hartford Gunn, WGBH, and James Miles,\nWBAA, withdrew as nominees.)\nBecause William Harley, Director of Region III,\nand Robert Schenkkan, Director of Region V, were\nelected President and 2nd Vice-President, respec¬\ntively, at the recent Convention, nominations have\nbeen called for from members in these two regions\nto fill these two unexpired terms, and balloting, by\nmail, will be completed before the end of the year.\nCLOSED-CIRCUIT TV INSTALLATIONS\nGRANTED MEMBERSHIP STATUS\nInstitutions operating “closed-circuit television\nequipment regularly for direct instructional purposes”\nare now eligible for Associate membership in the\nNAEB under the terms of a Constitutional amend¬\nment adopted by the membership at the Convention\nlast month.\nJames Miles, chairman of the Constitution com¬\nmittee which presented the proposal to the member¬\nship, pointed out that there is a growing number of\nsuch installations currently in operation and that un¬\nless such an amendment was passed, institutions with\nonly closed-circuit operations would be eligible only\nfor Affiliate membership. The committee felt that\nthe growing importance of closed-circuit television\nentitled such institutions to voting membership in\nthe Association. It was also pointed out that giving\nthem a regular, voting membership, will make them\npart of the growing family of educators, concerned\nwith radio and television as tools, who find a role to\nplay in the NAEB.\nCONSTITUTION AND BY-LAWS AMENDED\nTen amendments to the NAEB Constitution and\nBy-Laws were approved by mail ballot just prior\nto the recent convention and three more were ap¬\nproved on the floor of the convention. Two of the\nlatter three had been included in the mail ballot but,\ndue to the fact that more than two choices were pos¬\nsible in each case, no single alternative received\nenough votes for passage, thus requiring reconsidera¬\ntion on the floor of the convention. The third a-\nmendment passed by the convention gave Associate\nmembership status to closed-circuit TV operations\n(for details see story elsewhere in this Newsletter).\nIn brief, the amendments approved by mail and\nat the convention provide for recognition of Individ¬\nual members in the Preamble to the Constitution,\nestablishment of an Industrial Associate category of\nmembership, three vice-presidents, possibility of dual\nmembership (both Active and Associate) on the part\nof institutions meeting certain requirements, and\nclarification of wording in several sections dealing\nwith participation of voting members in affairs of the\nAssociation. The changes also specify that the 1st\nvice-president shall act as the interim chief admin¬\nistrative officer of the Association in case a vacancy\noccurs in the presidency, that the convention shall\nbe held in the Midwest in odd-numbered years and in\nrotation in the West, East and South in even-num¬\nbered years, that any staff member of a voting mem¬\nber-institution may be elected to office, and clarify\nthe duties of the president and the definition of “im¬\nmediate past-president.”\nNew copies of the Constitution and By-Laws, re¬\nflecting all of the approved changes, will be sent to\nall members within a few weeks.\nCOHN & MARKS, FRANKLIN DUNHAM\nRECEIVE NAEB CITATIONS\nThe firm of Cohn and Marks, NAEB legal coun¬\nsel, and Dr. Franklin Dunham, chief, radio-TV sec¬\ntion, United States Office of Education, were awarded\nNAEB Citations at the annual NAEB banquet at\nthe recent Omaha convention.\nThe recipients were selected by the NAEB Awards\nand Citations committee consisting of Miss Judith\nWaller, chairman, H. B. McCarty, and Robert Cole¬\nman. The Citations were presented by McCarty in\nthe absence of Miss Waller who was unable to attend\ndue to prior commitments.\nCohn and Marks were cited “for their wise,\nfriendly counsel to the educational broadcasters of\nAmerica; for their distinctive representation of educa¬\ntional interests before the Federal Communications\nCommission and various committees of Congress; and\nfor their steadfast devotion to the development of the\nfinest possible broadcasting system in the United\nStates.” The award was accepted by Mr. Leonard\nMarks.\nDr. Dunham was honored “for his vision, opti¬\nmism, leadership, faith, and efforts in furtherance\nof the finest uses of broadcasting for educational and\npublic service for more than a third of a century.”\nMrs. Gertrude Broderick accepted the Citation in\nthe absence of Dr. Dunham, who had to leave the\nconvention early, as he said in a note to McCarty,\nin order to “continue intact my record of having spent\nevery wedding anniversary with my wife during 36\nyears of marriage.”\nThe practice of conferring special honors by the\nNAEB began at the New York convention in 1954\nwhen Miss Waller, McCarty and Richard B. Hull\nwere so honored. Recipients of NAEB Citations\nsince then have been: in 1955 - Frank E. Schooley,\nthe British Broadcasting Corporation, and the French\nBroadcasting System; in 1956 - Waldo Abbot; in 1957\nI. Keith Tyler.\n—NAEB—\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 14 Gregory Hall,\nUrbana, III. $5 a year, edited by Nancy Whitmore.\n2\nNEWSLETTER"
}