{
  "id": "d1805-2",
  "text": "I960 CONVENTION AWARDED\nTO SAN FRANCISCO\nThe 1960 Convention of the NAEB will be held\nin San Francisco, California. San Francisco was rec¬\nommended by the Convention Site Selection com¬\nmittee, and unanimously approved by the conven¬\ntion, after adoption of an amendment to the By-Laws\nproviding that conventions be held in the Mid-West\nin odd-numbered years and in the West, the East and\nthe South, in that rotation, in even-numbered years.\nAs previously announced, the 1959 convention will\nbe held in Detroit, Michigan, and further details\nabout this convention will be forthcoming from the\nConvention committee which consists of Mrs. Ivay\nLardie, chairman, Lee Dreyfus and Frank Bouwsma.\nMEMO FROM THE EXECUTIVE DIRECTOR\n—Harry Skornia\nPost-Convention greetings! It was one our finest!\nAnd it was a real pleasure to see and chat with so\nmany of you in person.\nThose of you who couldn’t get to Omaha missed\nsome excellent talks and discussions, and the best\nbusiness sessions I can recall in years. Convention\nsite rotation was clarified (every other year in the\nMidwest; e.g., 1959 in Detroit; 1960 in San Fran¬\ncisco; 1961 in the Midwest again); several other\nwordings and conflicts in wordings were resolved;\nand Associate status was granted to CCTV appli¬\ncants who meet the criteria to be established by the\nMembership Committee and the Board. The ma¬\nturity and statesmanship displayed on the floor, under\nPresident Schooley’s firm but fair hand, made me\nmore proud than I have ever been before of our\nNAEB.\nThe success of the convention was a tribute to\nthe thorough and careful devotion of the local ar¬\nrangements committee: Jack McBride of KUON-\nTV, Reverend R. C. Williams of Creighton, Dr. Aid-\nrich Paul of the University of Omaha, and their staffs;\nit was also greatly assisted in its planning and ex¬\necution by Bill Harley, Harold Hill, Richard Hull,\nand Frank Schooley, who comprised the National\nProgram Advisory Committee.\nI was also most proud of the mind-stretching\nchallenges given us by some our speakers. After read¬\ning many of his articles and his fine magazine, Ex¬\nplorations, and hearing him at our Washington Con¬\nference, I had suggested Dr. Marshall McLuhan of\nthe University of Toronto as one of the speakers\nfor the convention. This was roundly seconded by\nFather Williams of Creighton who had studied under\nProfessor McLuhan, and the rest of the committee.\nThe closing session, in which Professor McLuhan\n(as one of two speakers) challenged us to re-examine\nand try to understand the nature of these electronics\nmedia, was, according to many who spoke to us after¬\nwards, the most stimulating session we have possibly\never had.\nProfessor McLuhan reminded us that educational\nmethods are based on linear disciplines and tools (like\nprint: word by word, in a straight line, with meaning\ncoming gradually and not all at once in an all-en-\ngulfing impression) whereas we are living in a nuclear\nage, and working with a nuclear instrument, in the\ncase of television: nuclear meaning that the impres¬\nsion, as in a photograph, or painting, hits you as a\nwhole, all at once. Even films, being a succession of\nstill “shots”, are essentially linear in concept—there¬\nfore in their nature have little in common in their\nnature with television.\nAnother idea he developed: that the medium it¬\nself is (a large part, at least of) the message in radio\nand television. That is, the overall common effects\nof television, however used (commercial TV, ETV,\nBBC TV, USSR TV, or whether for drama, talk, or\nwhatever other purpose) far outweigh the messages\nor contents, collectively, in their impact on our civil¬\nization. (I was interested to note in a little volume,\nBroadcasting and Society, by Harman Grisewood of\nthe BBC, that he too sees many of the same dangers\nin monopoly (BBC) TV that we find in commercial\nTV, irrespective of content or system).\nThese are only a few of the basic and “upsetting”\nideas Professor McLuhan hit us with.\nNo less challenging, but more difficult to para¬\nphrase or provide a teaser of, since it was a combined\nlecture-demonstration, was the contribution of Dr.\nDavid S. Ruhe of the University of Kansas Medical\nSchool.\nThe remarkable balance provided by these two\nfine minds, coming from wholly different disciplines,\nmade this session, in the opinion of many, the best\nwe’ve had in many a year. In order that those of you\nwho couldn’t get to the convention, as well as those\nwho had to leave early, may read these fine presenta¬\ntions, they are scheduled to appear in the December\nissue of the Journal. I hope you’ll all take time to\nread both of them, as well as the many other fine\narticles which the Journal is offering more and more.\nBut a word of warning: some of the things we need\nto be learning these days are tough going. They can’t\nbe gotten by reading “once over lightly.”\nIn this column we would also like to express our\npleasure at the fine “bosses” you’ve given us for the\nyear ahead, in the election at the convention. Be sure\nyou cast your vote whenever you have an opportu¬\nnity. Only by your exercising your ballot can the\nNAEB be kept responsive to the needs you feel it\nshould be serving.\nNOVEMBER, 1958\n3"
}