{
  "id": "d1805-6",
  "text": "is forthcoming to finance the programs.” He added\nthat the big problem therefore, is to get the money\nto build and equip a station.\nRogers is a member of the House Commerce Com¬\nmittee, which considers legislation affecting the Fed¬\neral Communications Commission. Observing that\nthe FCC has set aside a share of the TV channels for\neducational purposes, and that a number of those\nchannels remain unused, Rogers said:\n“The failure to use these reserved channels is not\nthe result of lack of interest. Numerous problems\nmust be met in activating the channels, and it has\nbeen necessary in most local situations to organize\ndifferent segments of the community—civic, cultural\nand educational—to bring about operation of these\neducational stations.”\nHe said ETV is gaining prominence for two pri¬\nmary reasons: “The almost unlimited audience which\ncan utilize a televised classroom, and the growing\nrealization of the people of an ever-increasing need\nfor a broader education.”\nRogers noted there are 256 TV channels set aside\nover the nation for non-commercial educational pur¬\nposes. This comprises 12.7% of the VHF channels\nand 11.3% of the UHF stations. Thirty-three ETV\nstations presently are in operation.\nWERS CELEBRATES ANNIVERSARY\nWERS (Boston, Massachusetts), the FM station\noperated by Emerson College, begins its tenth year\nof educational broadcasting this month. Going on the\nair on November 2, 1949, with a power of 10 watts,\nWERS now enters its tenth successive year, pro¬\ngramming classical music, news, sports, educational\nand public service programs.\nManned entirely by students of broadcasting at\nEmerson College, WERS programs nine hours a day,\n2:00 p.m. to 11:00 p.m. The primary function of the\nstation is to give Emerson’s broadcasting students on-\nthe-job training under actual broadcast conditions.\nPLACEMENT SUPPLEMENT\nNovember I - Production Director: Six years experience in tele¬\nvision and film production. Thorough background in\nproducing-directing studio and remote operations.\n29, vet, single, willing to relocate. $300 - 435 per\nmonth.\nNovember 2 - Young man, age 24, interested in the production\nand direction of ETV programs in the field of science.\nHarvard graduate, two years experience as assistant\nproducer. Cornell Ph.D. in Biology. Available June,\n1959. Single. Over $3000.\nNovember 3 - Married man, 26, with BA, desires work in ETV\nor educational radio. Two years experience. Can do\ncamera, air or film work. Available in March, 1959.\nSoutheast preferred. $95 - $125 per week.\nBOX SCORE\nTotal\nAM\nStations\n3290\n(includes\n39\nnon-commercial)\nTotal\nFM\nStations\n71 1\n(includes\n164\nnon-commercial)\nTotal\nTV\nStations\n588\n(includes\n33\nnon-commercial j\nNEW MEMBERS IN NAEB\nThe last month has seen many new stations and\ninstitutions joining the NAEB. The staff at Head¬\nquarters and all members of NAEB would like to\nwelcome these new members, who are listed below.\nActive\nKVIE (TV) Sacramento, California\nWEDK (FM) Amherst, Massachusetts\nKNME-TV Albuquerque, New Mexico\nWYSO (FM) Yellow Springs, Ohio\nKUT-FM Austin, Texas\nKERA-TV Dallas, Texas\nAssociate\nUniversity of Connecticut, Storrs, Connecticut\nFlint Junior College, Flint, Michigan\nAffiliate\nChicago City Junior College, Chicago, Illinois\nWoodstock College, Woodstock, Maryland\nThe Chelsea School, New York, New York\nTransvision, Inc., New Rochelle, New York\nNEWS OF MEMBERS\nGENERAL\n► Keith Engar at KUED, Salt Lake City, Utah,\nwas recently visited by Mr. Mohamed Benali of Mor¬\nocco, who is in the United States under the auspices\nof the U.S.I.S. Mr. Benali said that it might be\nvery useful for Morocco’s plans in educational radio\nand television to have printed texts of some of our\nschool and university programs. If you have any\nmaterials you would like to send, address them to\nMr. Mohamed Benali, 86 Avenue de Temana, Ra¬\nbat, Morocco.\n► With the acquisition of a new $50,000 Ampex\nVideo Tape installation, believed to be the first on\na college campus, the University of Texas will have\none of the best-equipped ETV plants in the U. S., R.\nF. Schenkkan, Radio/TV director predicted. The\ninstallation was made around the first of October.\nVideo tapes are twice as good as kinescope films,\nwhich reproduce only half of the 525 lines on the TV\nscreen. Tapes are more expensive than “kine” film,\nbut they can be erased and used again. The Univer¬\nsity will use the tape both for closed-circuit teaching\nand distribution of programs to commercial stations.\n► Could you give us a hand? Many people ask\nus for a list of institutions which give courses in Ed¬\nucational radio and television. This includes courses\nfor teachers who are in classrooms, as well as edu¬\ncational production, etc. If your institution offers any\nsuch courses, please let us know so we may compile\na list.\nNOVEMBER, 1958\n7"
}