{
  "id": "d1805-8",
  "text": "1. Try to have the best possible technical facili¬\nties, operations, and operating and mainten¬\nance practices.\n2. Have a long range plan for technical improve¬\nment, which I would revise constantly.\n3. Sell my staff on my station and its program be¬\ncause this is one of the best and most effective\nways of promoting the station.\n4. Determine the type and tastes of the audience\nI am trying to reach and program accordingly.\nWe believe that the above points, applied to any\noperation, would do much to make it a successful\none.\n_N A E B—\nWe also want to mention a paper presented at\none of the briefing sessions at the NAEB Convention,\npresented by Richard Vogl of WOI, at Iowa State\nCollege. Dick outlined their experiments in stereo¬\nphonic broadcasting at Iowa State. He’s promised\nto send us a copy which we’ll mimeograph and dis¬\ntribute to you.\n—NAEB—\nA sub-committee of the NAEB Engineering Com¬\nmittee, and a committee set up by the Educational\nRadio and Television Center have begun work on\nthe suggestions made at the NAEB Video Record¬\ning Workshop in May on Kinescope Recording\nStandards. The NAEB sub-committee met Sep¬\ntember 29 in Chicago, with Carl Menzer, Keith\nKetcham and Cecil Bidlack representing NAEB and\nAllen DeLand representing ETRC. The following\nprojects were cited as needing study:\n1. A procedure for calibrating densitometers.\n2. Use of EIA grayscales in live studios and evalu¬\nation of their use for proper studio camera ad¬\njustment.\n3. An accurate technique for measuring print den¬\nsity ranges.\n4. Determination of optimum print density ranges\nconsidering affiliated ETV stations.\n5. Kinescope exposure adjustment including check\nlist for beginning kinescope operators.\n6. Standard film chain reproduction character¬\nistic.\nSince the ETRC Committee has been established\nas a short term project, while the NAEB Engineer¬\ning Committee is a continuing one, there appeared to\nbe work for both groups to accomplish both short and\nlong range projects with a minimum of duplication.\nConsequently it was agreed that both organizations\nwould work on item 1 above; that ETRC would also\nwork on items 3 and 4 since these are of immediate\nconcern to the Center and it is desired that they be\nbrought to a successful completion as soon as possible;\nthat NAEB would also work on items 2, 5, and 6\nwhich, while desirable, would take additional time\nwhich the ETRC Committee would not have.\nOn October 19, the ETRC Committee met in\nAnn Arbor, with representatives from the NAEB,\nETRC and its affiliates and film processing lab¬\noratories. It is hoped that within six weeks the three\nitems above assigned to the ETRC Committee, can be\nimplemented and sufficient data obtained to hold a\nsecond and final meeting to agree upon standards.\nThese projects are densitometer calibration, elec¬\ntronic measurement of print density range and\noptimum density range for ETV prints. Since two\nof these projects will require the production of ma¬\nterials for densitometer calibration as well as the pro¬\nduction of test prints with varying end points and\ndensity spans for evaluation on station film chains,\nthe cooperation and prompt action of all stations will\nbe necessary to complete the project within the de¬\nsired time. That is why we are mentioning this proj¬\nect so that you will be alerted and be ready to par¬\nticipate.\nIt is hoped that before this column gets into print,\nthe data for the modification of the galvanometer\nmounting in GPL kinescope recorders to accommodate\nthe I-prime galvo will have been secured, duplicated\nand made ready for distribution to kinescope oper¬\nators. We’ll keep you advised on further progress\nin the NAEB portion of this program.\n—NAEB—\nThe 84th Semi-annual Convention of the Society\nof Motion Picture and Television Engineers, just\nconcluded in Detroit, featured many papers on the\nuses of film and television in education. We believe\na new high mark was set in the attendance of per¬\nsonnel from educational stations and institutions.\nEducational television technical personnel made a\nsignificant contribution to the program of the con¬\nvention with papers presented by Keith Ketcham of\nWOI-TV, Fred Remley of the University of Mich¬\nigan, C. M. Braum of JCET and John Brugger of\nHagerstown, Maryland. Allen DeLand of ETRC and\nKeith Kossuth of Wayne University served as chair¬\nman and vice-chairman respectively for the evening\nsession October 23 while the writer served as chair¬\nman for the morning session on the same date. Eight\npapers were presented by representatives of film,\naudio-visual or instructional departments of educa¬\ntional institutions.\nCy Braum made history by presenting his paper\nvia closed-circuit TV. He read his paper from an ad¬\njacent room where the video signal from an RCA\nvidicon camera which was focused upon him was fed\nto a GianTView projection receiver providing a 6 x\n9 foot picture on the screen in the Crystal Ballroom\nof the Sheraton-Cadillac. His voice was carried over\nthe PA system. The demonstration was highly suc¬\ncessful. Both picture and sound were excellent.\nNOVEMBER, 1958\n9"
}