{
  "id": "d33-1",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL\nBROADCASTERS\nOFFICE OF EXECUTIVE DIRECTOR\nUNIVERSITY OF ILLINOIS\n119 GREGORY HALL\nURBANA, ILLINOIS\nJanuary 8, 1954\nHr, Robert VanBuyn\nAssociate Director\nDivision of Education\nV. K. Kellogg Foundation\nB-f ttlo Croak, Michigan\nDear Bob*\nThank e meat eincerely for the good wishes contained In your latter of\nJanuary 5* Th© umber of eervices which the SAEB hope# to provide, and the number\nof problems it hopes to solve, or help solve, do indeed premie© a challenging 1954*\nCounting on the funds mentioned in Graydon*s letter of November 20, 1953#\nvs have taken seme temp^ary action on the duplicator, He had to. The old one had\nbecome m worn ve felt we could no longer operate it without Impairing the quality\nand reputAliou of th® Network. In fact, ve had had 'to drop most of our music programs*\nHm machine had fe#«u need acre than ve bad anticipated In th® early operations. It*s\n' now being repaired.* Th® new on®' is .in operation at Headquarters. He had to take it\nnov, or wit several months for & new one to be built. During this waiting period we\nran a danger of a complete breakdown of service.\nIn answer to your inquiry about {space, our needs and problems are so\nnumerous that this particular mm ha® not been solved. The Baivarsity's own space\nproblem is critical and ve haven* t been able to discover anything. Me therefore are\nplanning to do our best is present quarter®, although the crowding doesn't always mean\nefficient operation*.\nMlth regard to the selection of the Associate Director, we have several\napplicants, but quite frankly vers awaiting availability of funds. Me had understood\nthat the funds requested would he specifically received either as a separate additional\ngrant or a® an advance against the 1954-55 allocation.\nIf th© above eta tamest does not fulfill the conditions of your request by way\nof explanation, please let me know.\nThe service demands m the office have, grown so that it appears it will be\ndesirable to make sow* adjustments in thi- year's budget. I hope the requested\nadjustments. If and when approved by our Board, can be made after m*m completed ^\ncurrent financial study and indicated needed changes."
}