{
  "id": "d33-100",
  "text": "-5-\neducators and the educated, the child and the adult, the stories of\ntrials—successes and failures, and examples of contributions to a\ndeveloping Democracy.\n\"Techniques: Basically, woven documentary and narration.\n\"Authorities: To be planned and produced by competent professional\npersonnel, under direction and supervision of professional producer,\naided by professional educator or educators as consultants. Example\nof possible consultants: Professor James Bartlett Edmonson, Dean Emer¬\nitus, College of Education, University of Michigan; Professor Ralph\nTyler, University of Chicago; Professor Edgar Dale, Ohio State Univer¬\nsity.\n\"Uses: (1) By NAEB Network stations, first choice; (2) commercial\nradio stations, on a non-commercial basis; (3) adult education groups;\n(4) in-school use; (5) libraries; and (6) the general public.\"\nIn further elaborating specific plans, it is now felt that the series\nmight best be implemented as follows:\na. It is proposed that three NAEB-Kellogg awards be offered for\nthe best, second best, and third best series in the field of Amer¬\nicanism, presenting examples of the American way of life at work\nand in evolution in the American educational system and in other\nwalks of life in America. The first award would pay $15,000.00\n(for the completed series with both commercial and educational\nrights); the second $10,000.00; the third $5,000.00. Twenty\nthousand dollars ($20,000.00) would be set aside for promotional\nexpenses, Producer-Consultant’s and judges’ fees, travel, and\nother expenses.\nFor this sum it is expected that three half-hour thirteen-(or\nperhaps 18) week series would be made available to American and\nforeign radio, through this joint effort and grant.\nIllustrating various possible chapters and approaches which might\nbe used, are the following suggested headings, some of which\nmight become entire series:\n\"What Makes a Good School?\"\n\"The Contribution of the Working Man (Labor) to American\nDemocracy\"\n\"The Contribution of the Farmer (Agriculture) to American\nDemocracy\"\n\"Industrialization: Its Meaning to a Dynamic Democracy\"\n\"The Social Structure of Modern American Society\" (With Dr.\nReisman and other University of Chicago sociologists\nwho are now studying this problem particularly).\n\"The God-Loving and God-Fearing Basis of American Democracy\"\n(\"Democracy and God\")\n\"The American Heritage in Folklore and Song\"\n\"Great American Elections’*\nAn additional $20,000.00 is also requested to provide for the se¬\nlection and production, from the results of this project, of at"
}