{
  "id": "d33-103",
  "text": "-8-\ngeneral use by national organisations.\nThis proposal grows out of the attendance of the NAEB Associate Direc¬\ntor at the recent CNO (Council of National Organizations) TV Workshop at\nToledo* Following the showing of the NPAC kinescopes at the Workshop, the\nAssociate Director met with part of the executive staff and the TV Commit¬\ntee if CNO. At this meeting, he outlined roughly the project being proposed\nhere and it met with immediate enthusiasm on the part of the CNO represen¬\ntatives* They felt that such a series of kinescopes would be of invaluable\nassistance to local chapters of the Various national organizations* It was\nagreed that the proposed kinescopes could follow the same general pattern\nas the NPAC kinescopes, but that the content would have to be of a more\ngeneral nature to be applicable to the many organizations that would want\nto use them.\nIf funds for this project are approved, the NAEB will commission one of\nits member stations to produce the series of kinescopes. (WKAR-TV might be\nthe logical choice in view of the experience of the staff in producing the\nNPAC series.) The planning for the series would likely be done in coopera¬\ntion with the CNO so that the community cooperation, philosophy, concepts,\nand procedures for the use of television for educational purposes developed\nby the CNO could be incorporated in the kinescopes and the guides for their\nuse.\nThe kinescopes would include material pointing out to local organiza¬\ntions the advantages of working together in the preparation and presentation\nof educational programs of mutual interest with mutual objectives. The ad¬\nvantages and the necessity of working together in their relationships with\ntelevision stations would also be clearly presented.\nPrinted booklets, describing how the kinescopes are to be used and en¬\nlarging on some of the material, will be prepared for distribution with the\nkinescopes.\nAfter the kinescopes are produced, 20 kinescopic copies of the series\nwould be made. These copies would then be made available, on a loan basis,\nto local chapters of national organizations.\nOrganizations using the kinescopes would be urged to use them as an\nintegral part of a training workshop rather than as a lone training vehicle.\nHowever, the kinescopes would be such that they could be used alone if neces¬\nsary.\nActual Production Cost: 4 kines @ $500.00 $2,000.00\nTalent (Expert consultant for planning series;\nscript preparation, rehearsal, talent, etc.) 1,600.00\nCost of recording 20 copies of the series\n(4 x 20 x $30.00) 2,400.00\nPreparation of booklets (including writing,\nprinting, etc.) 2,000.00\nDistribution 1,000.00\nAdministration {5%) A50.00\nTotal Requested $ 9,450.00"
}