{
  "id": "d33-28",
  "text": "TO: Ausinus From: Dunn Date: 3/16/54\nSchooley k\nHunter\nI am greatly disturbed by the financial condition of NAKB!\nSkornia’s latest report — divorced from late releases of funds from Kellogg and FAE\nwhich only tend to muddle the picture — indicates to me that we’re in a much worse\nfinancial condition than when we met at Ames. God only knows what the condition will\nreally be at the end of the fiscal year. This, too, despite the fact that we’ve\npractically drained the NAEB general treasury in a feeble effort to cover up some\nverv appalling deficit**\nThis financial crisis of NAEB calls for drastic action and top consideration by the\noff tiers of the Association, even if everything else has to go by the boards*\nYou will recall, gentlemen, that one of the nasty insinuations about NAEB a few years\nback Kas to the Effect that we were not a responsible organization* This latest fiasco,\nit appears, tends to prove that the accusations were right* All this despite the\nfact that we have had the University of Illinois financial watchdogs on guard.\nThe plain fact, gentlemen, is that WE HAVE SPENT MONEY WHEN WE DIDN’T HAVE IT TO\nSPEND* That, to put it bluntly, is gross maladministration on the part of someone*\nApparently, we go merrilv along, not stopping long enough to find out the REAL causes\nand fix the blame.\nNow there are two ways in which this deficit may be wiped outs (1) A special assess¬\nment against all active members of NAEB} (2) by dipping into or pinching ear-marked\nfunds that have been riven us in good faith by either Kellogg or FAE*\nMost of NAEB is made up of small operations, none of which is on too firm a financial\nfoundation or whoee relationships with their own administrations are none too stable.\nTo assess a blanket $100 against each active would theoretically get the lob done but\nmight leave us with few active members,\nI don’t believe we would be keeping faith with the foundations if we shortchange\nprojects for which money has been given specifically* If I were in charge of a foun¬\ndation that would be the last str*»w in my relations with NAEB*\nThere remains only one thing to do: admit our sins and humbly ask for help to pull us\nout of the red for I don’t believe that sufficient economy measures can be put into\neffect to do much good*\nThe damage has been done and apparently nothing has been done to nrevent the same\nthing from recurring. Overspending our budget MUST BE STOPPED AT ONCE even if some\nheads must roll. That's what budgets are for: to guide organizations in their ex¬\npenditures.\nTherefore, I shall insist at the Columbus meeting of the Executive Committee that\ncertain specific recommendations be made to the Board of Directors:"
}