{
  "id": "d33-32",
  "text": "March 23, 1954\nMr, Graydon Ausmu©\nBox 2002\nUniversity of Alabama\nUniversity, Alabama\nDear Graydoni\nVm afraid I’ve been sending you so mob that you didn’t notice that\nI was unable to see Van Duyn, If and when I have a reaction to the\nbudget revision sent him, I’ll let you know, tie are preparing the\nbudget proposal for Columbus now. As I read the various eosnaent®\non this year’s situation, and John Dunn’s suggestion, I get the iia-\npression that a number of people feel that we have this year been\nsomewhat extravagant or careless. I resent this implication a\nlittle.\ntihen I came on the job, we were ©omitted to the distribution of\nthe Laterlochen series, This cost us at least #3,000.00. Me in*\nincluding last year’s unpaid administrative cost\nof 13,800,00. The office expense item listed in the original Kellogg\ngrant from which this year’s budget was prepared, listed office e»~\npenses as #1,*>00,00 a year* tie are spending almost that per\nmmUx an postage, duplicating, telephone and telegraph alone. The\nannual total can be no less than #11,000,00* I do not mean to appear\nirritated on this point, but do feel that ar^y effort to prescribe\nt&ather we operate on an annual or a quarter-annual basis is com¬\npletely irrelevant in this instance and that I am perfectly capable\nof administering budget© without exceeding them once I have a part\nin making them out in the first place. I believe the budget pro*\nposal we will bring in for next year will make seme sense on this\nscore, but I do ©all attention to the fact that it will have to be\ncut down sharply on seminar and travel expenses in view of the size\nof fixed item® for daily expense.\nPlease note the attached letter with regard to our own secretarial\nsituation.\nAttached (or already mailed) are also copies of letters in which I\nsent our regrets. The last three weeks have been murder, as far as\ntravel is concerned, and I knew they would be. Normally this schedule\nis not this bad, and you may be sure that I will keep it to a minimum,\nIfy efforts to secure regional representation will be continued, al~\nthough they are not as often successful as I wish they were."
}