{
  "id": "d33-36",
  "text": "GOIiFIPOTIAL\nNAEB Headquarters\n14 Gregory Hall\nUr tana., Illinois\nApril 19, 1954\nMr. Graydon Ausmus\nRadio Station WUOA\nUniversity of Alabama\nUniversity, Alabama\nDear Graydon?\nHerewith the data for the request to Kellogg. In view of the heavy traffic\n(our phone calls you to me or vice versa run to an average of #15*00 each)*\nduplicating (TV Operations Committee, Research* Engineering), and Columbus\nexpenses (suite* exhibit* pictures) and various other items, our deficit\nwill as at present run to approximately $21*000.00 if we receive the\n#3*000.00 tentatively approved for transfer from Schooley. If we\ndon’t get this $3*000*00 the deficit will be around #14,000.00 at the\npres erst rate,, according to Harold Hill’s latest careful check. Many\nor most of these expenses are due to the feeling of all responsible that\nthe NAEB must \"stay in there* swinging. Committee reports, particularly*\nare piling up at a rapid rate for processing $ teoretarial handling,\nwhich prevents the staff reduction anticipated, (we had earlier counted\non having a secretary provided for in the FAB Engineer Grant* on the\njob to reduce the need for Kellogg-financed ones* which also accounts for\nBorne of the heavy load). So, for deficit for the years #14,000.00 if no\n#3,000*00 from Schooleyj #11,000.00 if we get the 33,000.00 (which does\ninclude Headquarters expenses for ■lews'’ sit u»(#l.000.00? printing, stationery,\ncalling cards, etc. #ls000.00j lettering membership certificates, mag¬\nazines, clipping service, books, reprints, etc. for Newsletter use, and\nChristmas cards another $500.00 or so? plus expenses for travel* mater¬\nials for, and shipments to Fulbrights of another $200.00 to $300.009 to\nmention only the principal expenses which come to mind).\nFor publications, in order to be able to give many of the Kellogg-financed\nactivities (committee reports, regional meetings, network and organiza¬\ntional brochures) the format and distribution they deserve, comparable to\nthat given FAE-sponsored projects which in each case provide adequate\nfunds for publication, the following estimates\nFor neat notebooks for members, dividers and printed heading report\npaper comparable to that of JCETs $2,000.00.\nFor publication of the following reports, the following estimates?\nTV Operations Committee report: $2^000.00\nNAEB Engineering Committee Reports $1,800.00.\nNAEB Research Committee Reports #1,500.00*\nNAEB legal and rights service brochures #1,100.00,\nRegion VI Conference Minutes (including talks by Castell, Newbum,\netc.) $2,000.00.\nNext two region reports* at $2,,000.00, total $4,000.00."
}