{
  "id": "d33-37",
  "text": "Mr. Graydon Ausmus\n-2-\nApril 19, 1954\nNAEB and network promotion brochuress $1,700*00.\nOther Committee reports for 1954-55, $3*000.00.\nTotal for printing and publications (not including distribution costs)\n$19,100*00*\nThese are realistic figures based on the costs of publication of FAE-\nfinanced TV Production Workshop ($1,300.00 plus editing fee to Stasheff)\nand comparable items. I think ve should avoid giving the impression\nthat we could do this for less, or much less, or we 'll be behind an\nincreasingly high 8-ball deficit.\nTotal, at the outside, in case of a consolidated request, $19,100.00 plus\n$14*000.00, or $33,000.00. I recall your saying that Van Duyn had indi¬\ncated that Kellogg would appreciate our coming to them first on such\nthings. Undram©tic as it may look. I think the steps which these funds\nwould enable the NAEB to take would definitely establish the organisation\nin the position it deserves and is achieving.\nPersonally, rather than requesting these funds on a piecemeal basis as\nanother extra grant I believe P'd be inclined to favor requesting all of\nthem as extra funds for next year, adding to the $50*500.00 sum we are\nnow scheduled to get (original agreement $40,500.00; Associate Director\n$8*000.00; plus increased travel funds $2,000.00). The consolidated\ntotalr to cover getting the NAEB on top of all these needs would then\nbe $83 $600.00.\nBelieve me, I did not expect to come up with this figure. But looking\nat the accumulation of fine material in the miserable form it9s now in,\nI thought I should get this to you in as honest and forthright a fashion\nas possible* Ac Committee reports come in, this does not provide for\npublishing alls only about two of the best each year.\nLet me know what else you*d like me to do on this. Will send to the\nDirectors as information, or for whatever you may want to call on them\nfor. This will still mean we*re running a lot more than JCET or NCCET\nfor a lot less money per year.\nSincerely,\nHarry Skornia\nExecutive Director\nccs NAEB Officers only\nHJSsmbh"
}