{
  "id": "d33-65",
  "text": "Hr. Graydon Aumm\n•4-\n4kns 9# 1954\nIMeh projects, whioh m propose, can b©ccm© \"revolving fteta* to support\nthe NAE3 without outside helps\n1. of network?\n2. of headquarter©?\nla mm cases? I f<alt It unfair to be throw in end espectad to develop\njoint (noa-agrloultursl) project© with the IMG, though I indicated our interest\nin closely working with them, What is needed from us is whet we’ve not had time\nor funds to dos\n1. Think? define, Unit, clarify (which in certain EXRG and other\nareae is tough)\n2. Consult with everyone else in the educational, broadcasting or\npublications business.\nOur tendency (mine particularly 1 aspect, with the pressure of daily details,\nrequests, deadlines) has bean preoccupation with j&ggg, details, \"Adeeming up\nrequests9, instead of setting base Hoes. I’ve asvsr had sore questions asked\nm that X couldn’t answer, or had sore sharp (though generally just) complaints\nagainst the *HA£8 Way of Life* then were today put to m.\nX don't know how may \"brass tacks* had been hit with Bob before, but X\ncertainly hit thee., and mm away a wiser and soberer nan. Can the MM correct\nthe impression Kellogg has that we’re ready to pursue ©very proposal anyone drops\nin our hopper, instead of soberly defining what we’re to do, within the limit of\nrninimm resources wa’re pretty msm to have?\nDigressing a little, X recall that Bill Griffiths, in a ascent Dhloggo\nConference with us, siso ©spressed consent over the mm thing©* I think\nGriffiths and ?an Buyn should hit it off well in common under@ta?ading with the\nHAEB, ^ftar we get the ^pswera reedy. Because both, being both smart and\neseenticily rood guys, ask fc&M questions.\nX*d fee glad—\n1. to collect and integrate the definitions of the KAS3 that come\nin and/or\n2. then arrange the meeting or whatever else you want me to do.\nX think both must oom as scon os possible.\nAnd, as I look over tbs above, I get two impressions* X note that our\nannual report to Kellogg shows much mm of what we’ve done than what we’ve\nthought (X mentioned that we ere perforce more doer© and broadcasters then"
}