{
  "id": "d33-77",
  "text": "-2«\nnot visualized when the NAEB's initial grant was requested. This is in no sense\na reflection on those making the intial computations, since the same people are,\nby and large, also involved in present requests and reports.\nSpecific illustrations of increased costs in such inescapable items as\npostage, tape, phone charges, and staff, will be found in later sections of this\nreport, and will be noted particularly in the official fiscal-year report, which\nwill be forwarded separately from the University of Illinois Business Office as\nsoon as possible after the close of the fiscal year. For use until it arrives,\nwe have enclosed herewith the Statement of the Status of the NAEB-Kellogg Budget\nat the end of the first eleven months. (Exhibit l)\nFor ease of reference and use, following this initial general statement,\nthis report is divided into separate sections, as follows:\nNewsletter, and Publications Exchange\nDuring this year, as always in the past, the pressures on the Executive\nDirector (and later on the Associate Director) have been such that the Newsletter\nhas not received the maximum or optimum attention it deserves. Nevertheless it\nis believed that it has been improved considerably. It now contains regular\nfeatures from the NAEB Fulbright Scholars in England, France and Italy, and is\ngenerally improved in both its international and local values. (Exhibit 2 and 2a)\nIn view of the international background and interests of the present Executive\nDirector, regular free exchanges of publications have been instituted with most\nof the nations in Western Europe. In a recent Journal of the Italian Radio\nSystem, distributed in Italian, worldwide, three out of the first five lead\nstories were quotations from the NAEB Newsletter. The other two were also from\nthe American Trade Press. The flow of materials in French, Italian, German, and\nJapanese, plus that from Australia, Canada, and Britain maintain an increasingly\ninformative and friendly illustration of one of the little-known facets of NAEB\nHeadquarters activity.\nThe use of NAEB materials (manuals, reports, scripts, recordings) around the\nworld is beginning to grow, and is being encouraged in spite of the problems of\nlanguage, customs and duties, and other hazards. We treasure especially highly\nthe thank-you notes reaching us from Pakistan, Egypt and other areas in which our\nmaterials are greatly sought after. And it is believed that NAEB Newsletter\nreaders are also being conditioned to interest in foreign programs and news of\nforeign countries and communications problems.\nThis expansion of international aspects has been carried out without neglect\nof local responsibilities. The largest problem, from this point of view, is still\nto secure significant news of NAEB activities from its membership. This will\nrequire more time than the present staff has available, before it is adequately\nsolved.\nDuring the last few months several new features (reviews of books of inter¬\nest to NAEB member representatives; regular personnel and placement news; and\nnews on joint projects of the .NAEB with other groups—such as the NPAC, American\nCouncil for Better Broadcasts—(Attached, (Exhibit_3), is a recent communication\non a TV program proposal, to illustrate the NAEB!s overall efforts to provide"
}