{
  "id": "d33-79",
  "text": "-4-\nFollowing the trip abroad of three NAEB representatives to attend the\nEducational Broadcasting Convention and to establish various NAEB contacts in\nEurope in 1952, and representation at the International University of the Air\nConvention in Paris, in April of 1953* Mr. Seymour Siegel, chairman of the NAEB\nInternational Relations Committee was able this year again, principally at his\nown expense, to represent the NAEB at Italian and other conferences last summer.\nWhile there he also served as a judge for the world-famous Prix Italia, which\nprovides world-wide awards for quality programming, and helped establish contacts\nand working relationships for Fulbright Scholars in England, France, and parti¬\ncularly in Italy. Following the audition of two NAEB entries experimentally, for\nthe first time, at the Prix Italia Conference, a new (educational program)\nclassification was established. As the year ends, the NAEB is on the point of\nselecting this year's entries, and has again been invited to provide a judge, this\nyear in the musical category. This it has hopes of doing, provided that properly\nqualified NAEB persons can arrange to be in Italy at their own expense, or nearly\nso, at the proper time this summer.\n(It is our hope that Dr. Burton Paulu, Fulbright Scholar to England, or\nsomeone equally qualified may provide this representation, which is equally\nimportant to the NAEB, educational broadcasting, and the United States abroad, as\nspokesmen from the Department of State and the U. S. Information Agency have both\nacknowledged.)\nDuring the past year, also, NAEB President Graydon Ausrnus, using principally\nfunds from a separate grant and private funds, represented the NAEB at the Inter¬\nnational Conference of Music Education for Youth and Adults, in Brussels,\nBelgium. While in the European area, he spent cue reek at the BBC, and in conference\nwith representatives of the French and other broadcasting organizations at a time\nwhen various conferences brought various key broadcasting people together. A\nbrief report on his visit, as well as that of Mr. Siegel and letters from abroad\nby our Fulbright Scholars, have been carried in various NAEB Newsletters. where\nfurther details can be found. Suffice it to say here that all the above trips\nwere richly rewarding in the contacts, understandings and exchanges established.\nThe NAEB is now the sole representative of American radio in the International\nUniversity of the Air organization, which it has officially joined, and in the\nnumerous other relationships developing in both Radio and Television, in a shrink¬\ning world.\nIn addition to the above foreign representation by the NAEB, the NAEB was\nrepresented as often as possible at dedications, conferences, workshops and other\nsimilar functions. The NAEB President visited new TV stations, and/or assisted\nin their dedications, at Los Angeles, Houston and other locations, as well as\nmaking well over a score of public appearances at various conferences. The NAEB\nwas represented by Mr. Frank Schooley at the Dedication of Station WQED-TV in\nPittsburgh. The Executive Director, following a whirlwind study-tour, using\nfunds from a special grant, to visit over 30 key NAEB members in all six Regions,\nwith the functions involved in various cities, also represented the NAEB at\nvarious TV Station dedications, University President inaugurations, meetings of\nthe TV committees and conferences of such organizations as DAVI, NPAC, the Adult\nEducation Association, the American Association for Better Broadcasts, the\nCouncil of National Organizations, the American Association of School Administra¬\ntors, the Film Council of America, etc. As the year ended part of this Head¬\nquarters representational travel was taken over by the Associate Director, who\nrepresented the NAEB at the recent Toledo CNO TV Workshop, the Film Council\nPlanning Committee Conferences, and others."
}