{
  "id": "d33-8",
  "text": "W. K. KELLOGG FOUNDATION\nBattle Greek, Mich.\nFebruary 4, 1954\nCOPY\nMr. Graydon Ausmus, Director , —\nRadio Broadcasting Services\nUniversity of Alabama\nUniversity, Alabama\nDear Graydon3\nI am happy to inform you that the Kellogg Foundation will increase its original\ntotal commitment of $245,350 by $32,000 upon the following conditions %\n$ 2,000\n10,000\n3,000\n5,000 $ 8,000\nCost of repair of the original recorder\nCost of a new machine\nAn additional supply of tapes\nAn associate director\nTravel funds (to include some funds for\nthe associate director, but especially\nfor the continuation of committee\nmeetings)\nTotal\n2. That all conditions of the original commitment are continued.\n3. That the Foundation reserves the right to withdraw completely\nfrom these agreements at any time NAEB might lose its autonomy\nor operate in actuality (or in effect) with purposes other than\nthose for which it existed at the time the original Foundation\ncommitment was made.\nUpon receipt of a letter of acceptance and a request for the $22,000\napproved for the fiscal year 1953-54, a Foundation check will be sent to\nMr. Lloyd Morey, Comptroller of the University of Illinois, as agent for\nthe National Association of Educational Broadcasters.\nWe believe that educational broadcasting is an Important part of\nimproving the life and well-being of the American people. The National\nAssociation of Educational Broadcasters has the opportunity as the pro¬\nfessional organization in the field of educational broadcasting to give\nthe leadership that will make a significant difference in the lives of the\nAmerican people. You have a responsibility that includes not only the college and\nuniversity stations but also commercial stations in setting the standards and\nleading the way toward better educational programming that will provide the kind of\nlearning experiences needed as we meet the issues of the world today. The Foundation\ntakes pleasure in helping to make it possible for the National Association of\nEducational Broadcasters to meet this challenge. What you do with this opportunity\nwill not only determine your own fate personally and as an organization hut will\ngreatly influence many other agencies and the well-being of the people who have the\nright to expect the wise use of a mass media entrusted to you.\nSincerely,\nRobert Van Duyn\nRVD/ms\nccs Mr. Harry SkorajLa"
}