{
  "id": "d33-82",
  "text": "-7-\nSeminars and Meetings\nDuring the past year another in the first ’’round” of six regional meetings\nwas held. This Region VI meeting was held in Eugene, Oregon, in October, 1953,\nwith approximately 40 representatives from member institutions in Region VI in\nattendance. The report of this meeting is now being edited by the Publications\nCommittee and will be transmitted as soon as available. Plans for a second\nregional meeting for the year (the fifth of the first round of six, one per\nregion, anticipated) for Region I (East Coast) were cancelled too late to enable\nreplacement before the fiscal year ended. This will have to be carried out next\nyear. Although this second Regional Conference was not held, evidence of\nRegional initiative in starting a new round of more informal regional meetings\nat member station initiative and expense was found in the June Region III meeting\nof NAEB member stations held at member WBEZ-FM, the Chicago School Station,\ncoordinated by its Director, George Jennings, and Regional Director, Dr. Paul\nRickard. Quoting from Mr. Jennings’ Report of June IBs\n”While the attendance was not all that we expected, those who\ndid arrive spent a full and interesting day.Those who\nattended were unanimous in feeling that such a meeting was\nhelpful and might well be continued on an annual or semi¬\nannual basis.”\nDuring the last month (June) the Kellogg Seminar for writers of in-school\nprograms was held in St. Louis, Missouri, under the leadership of Professor\nEdward Stasheff of the University of Michigan, with consultants from Canada,\nMinnesota and Wisconsin Schools of the Air. This seminar was the first for\nwriters of in-school programs and provided an intensive training session\nessential to general NAEB objectives of up-grading the broad level of programs\n(in this case those broadcast by member stations for in-school audiences) and\ndeveloping projects for new series of in-school programs. A report on this\nSeminar will be forwarded as soon as prepared, and as soon as funds are received\nfor the publication or duplication of the various reports now accumulating at\nHeadquarters.\nCommittee Activities\nCommittees of the NAEB continued to be increasingly active during the past\nyear. In this section complete reports are not possible, and some omissions\nwill undoubtedly occur. This section is, however, intended to be generally\nindicative of committee work in the NAEB.\nAll of the committees held meetings at the annual convention last October\nat Norman, Oklahoma, and carried on committee business throughout the year by\ncorrespondence. In addition, several of the committees were able to have\nadditional meetings during the year.\nASSOCIATE MEMBERS COMMITTEE: This year, as in the past, NAEB associate\nmembers have asked to be included in the program service of the NAEB Network.\nThe principal hindrance to this is the problem of rights and legal restrictions.\nHowever, steps are being initiated to determine the number and need of associate\nmembers in regard to program service. If the requests warrant it, some means\nwill be found to supply the want. (Please see attached letter to Richard Bell,\ndated April 19, 1954, Exhibit 10)"
}