{
  "id": "d33-83",
  "text": "-8-\nA second request from this committee is that the associate members have a\nright to vote in the affairs of the Association. Voting privileges are so far\nrestricted to active members. All reports are now in to the Constitution\nCommittee on this request, and this problem will be voted on at or before the\nOctober, 1954, New York Convention.\nCONSTITUTION COMMITTEE: This committee has spent a great deal of time on a\nre-evaluation and study of the NAEB Constitution. They have formulated changes\nin the Constitution which clear up ambiguities and suggest revisions in such\nmatters as dues, voting privileges and procedures, the qualifications of the\nnational officers, possible standards of accreditation of prospective NAEB\nmembers, dues revision, etc. The chairman of this committee has recently sub¬\nmitted to the members of this committee and to NAEB Directors a draft of the\nproposed constitutional changes which will be presented to the membership at the\nOctober convention for ratification. As soon as this is accomplished, and subject\nto the availability of funds, a new brochure will be issued which will carry the\nnew NAEB Constitution with the most recent changes and amplifications.\nENGINEERING COMMITTEE: This committee has been consistently active during\nthe past year. Under the leadership of Chairman Carl Menzer, Director of Radio\nStation WSUI, the State University of Iowa, the committee has made several\nvaluable contributions to the NAEB in the form of essential studies.\nAt the October Convention in Norman, Oklahoma, the committee reported on\nthe joint meeting of representatives of the NAEB, the Fund for Adult Education,\nand the Educational Television and Radio Center which met to discuss policy\naspects in connection with the establishment and maintenance of technical\nstandards for kinescopes. The committee also recommended that a full-time\nengineer be added to the staff of NAEB Headquarters and later screened applicants\nand selected the NAEB Television Engineer who begins his duties July 1.\nAt the Columbus, Ohio, meeting of the NAEB Board of Directors, the committee\nreported that it has made periodic reviews of the engineering situation and pub¬\nlished several reports which were distributed to all members. The following\nreports were published during the past years\nOperating Techniques for Video Recorders, by Keith K. Ketcham\nand Herbert T. Krajewski, July, 1953. (Exhibit 11)\nEngineering Operations Problems. Based on Three Years of\n(Television) Operation. November. 1953.(Exhibit 12)\nThe Theory of Video Recording. Joseph W. Belcher,\nMarch, 1954. (Exhibit 13)\nNAEB Tape Recording, by Carl Menzer, May, 1954. (Exhibit 14)\nMr. Menzer also made a (confidential) comparative technical study of\nmagnetic recording tapes in order to determine which would be the best and most\neconomical for use by the NAEB Network. (Exhibit 15)\nIN-SCHOOL PROGRAM COMMITTEE: This committee has auditioned 24 proposed\nseries and handled 231 reels of tape, which will give some indication of the\nincreasing volume of work and submissions surrounding the Network. The series\nfor broadcast during the 1954-55 school year were approved and are currently\nbeing distributed. The committee is currently auditioning series for broadcast"
}