{
  "id": "d33-84",
  "text": "-9-\nduring the 1955-56 school year. These series will be announced at the fall\nmeeting of the committee just prior to the NAEB Annual Convention.\nThe committee held three meetings during the year. One was a sub-committee\nmeeting held at Urbana, Illinois, where terms used for various \"school'* programs\nwere clarified. At the Columbus, Ohio, meeting in April the committee issued a\nreport of its accomplishments and a description of izs purposes and aims.\n(Exhibit 16)\nThe results of a survey by this committee, as reported in the May NAEB\nNewsletter. show that close to one million children listen to NAEB In-School\nprograms every week.\nINTERNATIONAL RELATIONS COMMITTEE: This committee has arranged this year,\nas in the previous year, for outstanding programs from other countries to be made\navailable to the NAEB Network* A total of 12 series, constituting 3,54*7 hours\nand 30 minutes of network program time were provided. Some of the series which\nhave been provided the NAEB include the Comedie Francaise. modem French plays,\ndramatic programs about great French poets, writers, and composers, musical\nprograms covering contemporary French music, Italian music, the French music\nfestivals, and the Prix Italia opera. Outbound with Columbus.\nThe work of this committee has undoubtedly done a great deal to bring to\nlisteners of these programs a better understanding of the language and culture\nof other countries.\nOur \"indebtedness1* to other countries program-wise, is, however, becoming\na source of some self-consciousness to the NAEB. The NAEB has been able to\nreciprocate with only a few programs. The Wavs of Mankind has been broadcast\nby the Canadian Broadcasting Corporation. A few programs of The Jeffersonian\nHeritage have been broadcast by the British Broadcasting Corporation, and the\nentire series has been translated into French and is currently being broadcast\nover Radiodiffusion-Television Francaise.\nFurther reference to the activities of the NAEB in this area will be found\nunder the headings NAEB Representation and Newsletter and Publications Exchange,\nin this report.\nMEMBERSHIP AND CREDENTIALS COMMITTEE* This committee has processed many\nmembership applications from various individuals and educational institutions\nover the country. Since last June, there has been an increase of 32 in member¬\nship. Approved were: 10 new active members, 14 new associates, and 8 new\naffiliates. Several candidates were turned down for inability to qualify fully.\nHowever, as the year ended it became apparent that procedures for still closer\nscrutiny of potential applicants, and improved statements of standards, will be\nnecessary. It is hoped these also will be ready for a vote at the fall conven¬\ntion, in connection with the constitutional revisions.\nORGANIZATIONAL LIAISON COMMITTEE: This committee, which, under the chair¬\nmanship of NAEB Director Allen Miller, consists of (usually non-NAEB) representa¬\ntives of various national educational and communication organizations, as an\ninformal advisory group, met April 9 in Columbus, Ohio, for a luncheon meeting\nwith the Chairman, and the NAEB President and Executive Director. A further\nmeeting is called for the October convention as the NAEB takes the leadership in"
}