{
  "id": "d33-89",
  "text": "-14-\nNo one who is not in close contact with the day-to-day activities of the\nNAEB Headquarters and Network Office, where committee reports, requests, for\ninformation and advice, complaints and occasional words of praise, converge,\ncan realize the scope or significance of the operation which this grant, three\nyears ago, launched on the .American Communications scene. Perhaps the principal\nproblems are the multiplicity of details involved, with the hundreds of interrup¬\ntions, together with problems of space, and other details, making difficult any\nopportunity for reflection, quality writing, or long-term planning.\nConclusion\nAt year's end the functions of the NAEB began to become increasingly\nsharply defined. (See \"Policy Statement: Draft,\" attached as Exhibit 23) This\nincreased clarification was recognized increasingly in the service areas referred\nto above: the NAEB is now indisputably the recognized association in educational\nradio and television. It is only in certain peripheral regions that the situ¬\nation is not yet clarified, and with the steps being taken month by month even\nthese areas are becoming more visible-as sharply defined as the pressures of\nthe times make possible, in any case.\nAlthough no one can predict with certainty (as retrospective consideration\nof early statements, by some of the wisest minds available, outlining the early\nrequests of the NAEB to the W. K. Kellogg Foundation so well illustrate) the\nexact future of the NAEB, it becomes increasingly clear that, if what appear to\nbe fundamental services are to be maintained, the need for a permanent annual\noperational budget of something of the magnitude of the present one, or slightly\nmore, must be faced, with special grants from time to time for special projects.\nSome of this can probably be on a self-liquidating or revolving fund basis, with\nfees and charges carrying at least a portion of this load.\nFirm predictions of a fiscal nature in this area can not be attempted by\nthe present writer, however, since during the single week this report is written,\nnews of projected new jeopardies to at least three educational and community\ntelevision stations plans have been received, one of our member (FM) stations\nhas turned in its license, and two member stations have already indicated doubt\nas to their ability to pay the new schedule of assessment fees. On such a base,\nfirm predictions are of course impossible.\nNevertheless, it would appear that just as educational broadcasting will\nalways need outside support, as a legitimate educational expense, so will the\nassociation of educational broadcasters, for the foreseeable future. The\nfinancial status of all but a very small number of members is too insecure at\nthe moment to expect them to increase their share of burden much further than is\nnow scheduled. Rather it is likely that during at least the next four or five\nyears, many members will need to rely even more heavily on the Association, if\nthe storms buffeting plans for an adequate educational broadcasting service are\nnot to sweep it away.\nTherefore Foundation support for the NAEB and projects both along lines\noutlined in the attached Supplemental Request, and as will emerge from forces\nstill at work and not yet defined, is expected to be necessary for some time, on\na considerable scale. It is not felt that any apology should be necessary for\nthe fact that the NAEB, as a responsible educational force, will continue to\nplace the legitimacy of educational needs ahead of the question of whether or not"
}