{
  "id": "d1767-5",
  "text": "TELEVISION IN OUR TOOT\nAs soon as Sarkes Tarzian goes on the air with station WTTV,\nBloomington can boast of being the smallest community in the United\nStates to h ve its own television station.. According to latest\nreports, operation is expected to begin within a very short, time.\nMr. Tarzian has already approached the Department with the idea of\nhaving us program two hours a day for him, which will really be an\nadvantage for students and staff alike to get in on the ground floor\nof the world’s newest mass media outlet.\n******* *\nCANADA CALLING\nWe were fortunate this su. mer in being able to borrow Len Peterson\none of CBC’s top script writers from the Writer*s Conference which was\nheld on campus during the time that our own Radio Conference was.going\non.. Mr. Peterson conducted a writer * s workshop in our studio which\nmany of the radio students attended.\n* * * *****\nPERSONALS—WHO’S DOIN’ WHAT AND -HERE\nWay back in May, ,Eldonna June, Poole married Frank P. May at\nSouth BendIndiana.\nPaul Boxell is now Public Relations Counsel for Hill and.Knowlton\nInc. and can be reached c/o Crosley Division, Avco Manufacturing Corp.\nCincinnati, Ohio,\nTom Custer’s new associated v ith Metropolitan Life Insurance Co. j\nAkron, Ohio, and his home address is 73 Eastgay Drive, Akron, Ohio. •\nNate Kaplan is now news writer at KNX, CBS in Hollywood, Cal.\nHis home is at 2302 Malcolm Ave., Los Angeles, 25, Cal.\nBrad De Marcus has a position with the Pearson Music Co. in\nNaptown.\nWe believe Jim Cathcart’s new address is 21A3 N. Lamer St.,\nBurbank-, Cal. (And Jim, we’re not do ng anything about television,\nbut dreaming.)\nLarry Fromer informs us that he has been doing some interesting\nwork adapting great novels for dramatization at at MOL in Washington,\nD.C.\nFoster Harmon is no longer at WKBN but can be reached c/o Harry\nFoster at E. State St., Athens, Ohio..\nLee Hall is with the Carter Advertising Agency, 912 Baltimore,\nKansas City, 6, Mo.\nBill Pierce informs us that he is now with the Sales Dept, of\nStandard Rate and Data, .333 N-. Michigan Ava., Chicago.\n(continued on page 8)\n-7-"
}