{
  "id": "d1767-6",
  "text": "INTRODUCTION\nRecently an educational group producing a program on the subject of\ndemocracy vent to considerable expense in time and money to bring a Greek\nchorus into the program. This feature undoubtedly added much to the artistic\nperfection of the program. Nevertheless, a feature analysis among listeners\ndefinitely indicated that the Greek chorus was generally disliked whereas the\nnarrator who had less prominence on the program proved a highly popular ele¬\nment.\nInasmuch as this particular program opened with the Greek chorus it\nis more than likely that its potential audience suffered considerably among\nthose impatient listeners who quickly turn to another program when they are\ndispleased. In addition, the message intoned by the chorus was largely lost\nupon listeners because their dislike for this form of presentation was a\nreflection of the mental confusion which it produced. Here is an excellent\nexample of a program production problem where advance research certainly would\nhave been of value to those interested in effectively presenting their message.\nThe type of research which produced the results cited above is just\none of the many varieties of research of value to those working with education¬\nal programs. However, such data as are now available or may become available\nfrom studies currently underway are not classified in such a way as to be of\nreal value to those who can make the most use of the results.\nThere is definite need for a classification of radio audience re¬\nsearch according to the users or potential users of research findings. Such\na classification should be a contribution to the important job of getting\nresearch results into the hands of those connected with educational broad¬\ncasting. Particularly is this so because it is quite evident that in most\ncases, those who have the greatest need for research findings lack either the\nknowledge, the time, the facilities, or the inclination to search the literature\nfor usable data.\nIt was suggested to the writers that a classification of this type\nmight be developed in the course of planning for the work study group on Re¬\nsearch and Educational Broadcasting at the Eleventh Annual Institute for\nEducation by Radio (held at the Ohio State University, Columbus, on May 1,\n19^0).\nThe object was to construct a time-saver that would permit any person,\nwhatever his connection with educational broadcasting, to find and apply more\neasily to his own work, the findings in this field. This classification is\ndeveloped solely for that purpose. There has been no intention to allocate\nparticular types of data arbitrarily to particular groups of people.\nThose connected with educational broadcasting may be broadly classified\nas producers, distributors and consumers of educational programs\n-1-"
}