{
  "id": "d1178-2",
  "text": "helpful information, and 115 felt that the exhibits\nadded to the convention. Most comments about the\nexhibits indicated that there should be more exhibits,\nwith more time allowed for visiting them.\nPLACEMENT SUPPLEMENT\nJanuary I — Experienced in programing, production-direction,\nadministration, all phases of in-school broadcasting.\nDesires permanent position in ETV or radio. Presently\nemployed as program director of 5000 w AM educa¬\ntional radio station. Family man, 29, MA in Radio-TV-\nFilm. Prefers East. $6300.\nJanuary 2 — College graduate, 30, now with major elec¬\ntronics company as management-trained educational\nmarketing specialist, desires position on public or sta¬\ntion relations staff of educational organization or station.\nHas had university radio workshop and announcing\nexperience. '\nJanuary 3 — Experienced instructor and ETV producer (male,\n38, single, MA in Radio—TV) seeking responsible posi¬\ntion in educational telecasting as ITV producer-director,\nmanager or administrator. Wide teaching background\nand ETV7~$6000 minimum; any location.\nPOSITIONS OPEN\nInstructor or assistant professor in radio-TV with\nprimary duties as program director for 10-watt FM\nand 250-watt AM university station. Teaching load\nof six semester hours in radio-TV and general speech.\nMA required, some work on doctorate desirable. Pro¬\ngraming experience, preferably in educational radio,\nessential. Salary and rank adjusted to training and\nexperience. Write to Dr. Claude E. Kantner, director\nof the School of Dramatic Art and Speech, Ohio Uni¬\nversity, Athens, Ohio.\nGraduate assistantships in radio-TV are also\navailable at Ohio University. Stipend $1800 for the\nacademic year, plus the waiver of tuition fees. Ap¬\nproximately 18 hours per week of service to the de¬\npartment, including some supervised teaching of basic\nspeech courses and assisting in either the campus radio\nstation or the TV laboratory.\nNew Midwest ETV Network Planned\nThe Midwestern ETV Corporation was organized in\nDecember to help carry out the plans outlined in the\nrecent NAEB survey. The survey was directed by\nJohn C. Schwarzwalder, director of KTCA-TV at\nthe University of Minnesota, under a grant from the\nHill Family Foundation.\nThe new network will be the first regional ETV\nnetwork of this size connected by electronic means.\nIn addition to the six ETV stations already operating\nin the six-state area (Iowa, Minnesota, Nebraska,\nNorth Dakota, South Dakota, and Wisconsin), an\nadditional 12 to 16 ETV stations are being planned.\nFunds are to be raised by the new corporation\nthrough donations from individuals, corporations,\nfoundations, and through federal and legislative\ngrants. Estimated capital cost of the network is\n$2,188,000, with annual operating costs of about\n$531,000. Costs are based on a 25-hour network week.\nNEWSLETTER IS FULL OF HOLES\nThis issue of the Newsletter has been punched to\nfit into a standard three-ring binder. This has been\nsuggested from time to time by various NAEBers.\nReactions pro or con will be appreciated.\nMeetings\nApril 21-22: NAEB Region II annual meeting. Hotel\nThomas Jefferson, Birmingham, Alabama.\nApril 26-29: IERT meeting, Columbus, Ohio.\nMay 7-12: Society of Motion Picture and TV Engi¬\nneers 89th semiannual convention. King Edward\nHotel, Toronto, Canada.\nOctober 23-26: NAEB annual convention. Willard\nHotel, Washington, D. C.\nNews of Members\nGENERAL\n► WHA-TV, University of Wisconsin, has received\n$70,000 worth of equipment from the Acme Equip¬\nment Company of Chicago. Acme acquired the equip¬\nment from the Capehart Manufacturing Company,\nwhich had used it to transmit video and audio signals\nfor test purposes. Some of the equipment will be used\nto supplement the WHA-TV broadcast operation. The\nbalance will provide a seven-channel CCTV system\ncapable of serving the campus at large.\n► Latest among a list of observers of the Alabama\nETV Network was Ed Schen, research director for\nthe Kentucky Legislative Committee to Study Edu¬\ncation. Kentucky is considering establishing a state¬\nwide ETV network. Alabama has hosted ETV ob¬\nservers from Florida, Georgia, Massachusetts, Cali¬\nfornia, Oklahoma, The Philippines, Burma, Sicily,\nthe British Isles, and New Zealand.\n► Boston University is offering 16 WGBH grad¬\nuate scholarships providing $1500 for the calendar\nyear. The scholarships were established^ byTKe Lowell\nInstitute Cooperative Broadcasting Council, and 15\nare in TV and one in FM radio.\n► WRVR, the Riverside Church station in New\nYork City, is promoting itself via ballpoint pens in\noutstanding colors (the one we saw was pink and reef).\nThe copy reads: “On the air in 1961. Riverside Radio.\nStation WRVR. 106.7 on your FM dial. Maximum\npower 20,000 watts.”\n► Adler Electronics has developed a VHF translator\nto provide high-quality TV reception in unserved\nareas. The VST-1 was designed to meet the recent\nFCC ruling which authorized the use of VHF transla¬\ntors for the first time.\n► The CPC News, publication of the Chicago Pro¬\nfessional Colleges of the University of Illinois, and\nUniversity Extension Reporter, of the University of\nCalifornia at Los Angeles, each recently devoted a\nJANUARY 1961\n3"
}