{
  "id": "d1178-3",
  "text": "major portion of an issue to instructional television\nas used at the respective institutions.\ny Programs produced by the Empire State FM\nSchool of the Air are being used in Europe through\nthe U. S. Army Dependents’ Schools in Europe and\nEthiopia.\n► On January 16 the University of Connecticut will\nstart construction of a new CCTV installation. While\nit will be designed specifically for CCTV operations,\nthe studio will also contain built-in facilities for pos¬\nsible external broadcasts emanating from the univer¬\nsity.\nPROGRAMS\ny WTTW, Chicago, this month inaugurates a TV\nseries on “Americans at Work,” in cooperation with\nthe AFL-CIO. The first programs will explore the\nwork and growth of the unions of pressmen, glass\nworkers, plumbers, bakers, potters, bookbinders, shoe¬\nmakers, and paper workers.\n^ The Wisconsin FM network is carrying a series\ncalled “Are the Angry Young Men Still Angry?” It\nwas planned and narrated by British theater director\nEric Salmon, who is working this year in Wisconsin.\ny At the request of the Voice of America, the Uni¬\nversity of Chicago recently completed production of\nthree half-hour radio discussions in Latin-American\nSpanish. The programs dealt with secondary education\nin this country, undergraduate education at the Uni¬\nversity of Chicago, and the graduate divisions of the\nuniversity. About six other universities are to pro¬\nduce such programs, using the University of Chicago\ntapes as pilot guides.\nPERSONNEL\n^ Hans Massaquoi, former NAEB staffer, was re¬\ncently promoted to the feature staff of Ebony maga¬\nzine, Chicago.\ny Edward Stasheff, professor of speech, and Verne\nWeber, staging supervisor, both at the University of\nMichigan, wrote a feature story on “Television Pro¬\nduction Design in the United States,” which appears\nin the November, 1960, EBU Review of the European\nBroadcasting Union.\ny Walter B. Emery, professor in the College of\nCommunication Arts at Michigan State University,\nspoke on “The Anatomy of Radio and Television” at\nthe golden anniversary convention of the National\nCouncil of Teachers of English, Chicago, November\n25, 1960.\nNYSERTA Meets\nThe New York State Educational Radio and Tele¬\nvision Association met in December to discuss plans\nfor the future of educational broadcasting in New\nYork. Commissioner Hugh Flick, of the state’s edu¬\ncation department, revealed a plan to be presented\nto the state legislature which calls for development\nof one or more of the educational UHF channels\nwhich the state has been holding since 1952. Harold\nHill, NAEB administrative vice president, challenged\nthe group to create a renaissance in the quality of\neducation through the resources of radio and TV.\nNYSERTA was officially formed in September,\n1960, with Donald E. Schein, director of the Mo-\nhawk-Hudson Council on ETV, elected'the first pres¬\nident.\nTV Fights Illiteracy\nCommercial WFIL-TV, Philadelphia, this month is\nbeginning a 20-week telecast of reading and writing\nlessons, hoping to reach 200,000 of an estimated 800,-\n000 illiterates who live within 70 miles of the city—\nin Pennsylvania, New Jersey, and Delaware.\n• WGTV, University of Georgia station at Athens,\nis telecasting reading and writing lessons three nights\na week. Some 550 adults have enrolled for supervised\nsessions of viewing in their communities.\n• The Italian government has begun a TV program\nto combat illiteracy among its population. There are\nestimated to be 2 million illiterates out of the adult\npopulation of 33 million.\nCommissioners Inspect Planes tor MPATI\nWith the flying classrooms slated to start January 30,\nFCC commissioners were briefed recently at the\nBaltimore Westinghouse plant by Westinghouse engi¬\nneers and Dr. John E. Ivey, Jr., on the airborne ex¬\nperiment. Dr. Ivey said that 526,518 pupils and 16,-\n221 teachers in 16,939 classrooms will participate in\nthe February-May test, with the full program to start\nin September.\nPublications\nThe title of the USOE booklet mentioned in the last\nNewsletter is “Radio and Television, A Selected\nBibliography.” Copies are 25 cents each, from the\nSuperintendent of Documents, Washington 25, D. C.\nThe pamphlet number is OE-34004.\n• “How to Live 100 Years Happily, a talk by Dr.\nJohn A. Schindler of the Monroe, Wisconsin, clinic\nwas carried over the NAEB Network several years\nago. It was so successful that it was condensed and\ncarried by the Reader’s Digest in 1949. The magazine\nof November, 1960, repeats this condensation — by\nspecial request of the president of the American\nMedical Association.\n• UNESCO has published & book, Rural Television\nin Japan, which describes an experiment in ETV in\nrural areas in Japan in 1956 and 1957. $3.50.\n• W. Mavrides, TV coordinator at the University\nof Akron, has prepared a 14-page “Television Instruc¬\ntor’s Reference Handbook.” The mimeographed book¬\nlet gives a brief, to-the-point description of equip¬\nment, personnel, and instructional aids to help the\nteacher new to the TV medium.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. $5.00 a year, edited by Betty McKenzie.\n4\nNEWSLETTER"
}