{
  "id": "d1657-0",
  "text": "N-A-E-B NEWS - LETTER\n.\n^ NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nEdited by Harold A. Engel, President\nStation WHA, University of Wisconsin, Madison, Wisconsin\nMay 7 9 ^947\nSPRING METING DRAWS CROWD . . .\n-The annual~spring Meeting of the NAEB held at Columbus, Ohio on may 3-4 in\nconnection with the Institute for Education by Radio was acclaimed by old timers\nin the organization as one of the most successful on record. Most of the active\nstation members and associate members were present to help lay the groundwork for\na broader scope of activities by the Association. . i . ,\nTwo business sessions, a banquet and numerous committee meetings combined to.\nround out the conference. Special emphasis was given to FK planning, with emphasis\nplaced on ways and means of extending the services to prospective as well as active\nFM applicants. President Engel appointed working committees. The recommendations\nand the action on them are reported here*\nREGIONAL PLAN SET UP\n-A committee consisting of Carl Menzer, James Morns and Larry Skorma was\nappointed and reported its recommendations received.\nIn line with a proposal by John T7. Dunn of MAD, Oklahoma University, for\nsetting up six NAEB districts, the plan was adopted and a temporary chairman\nappointed for each district. Such appointees are to serve until the annual fall\nconvention when the matter can be formally considered. ^ ...\nThe purpose of the regional plan is to provide a closer-working organization\nto which members and prospective educational broadcasters may turn for help. It\nwill also serve to stimulate the cause and strengthen NAEB by extending its\nmembership.\nThe regions, their temporary chairmen, ahd the states are as ionovs.\nREGION I —~ M.S. Novik, 3^ Rockefeller Plaza, New York, New York- Maine,\n\" yew Hampshire, Vermont, New York, Massachusetts, Connecticut,\nRhode Island, Pennsylvania, New Jersey, Maryland and Delaware.\nREGION II — Elmer Sulzer, MBKY, Lexington, Kentucky** Virginia, Jest\nVirginia, Kentucky, Tennessee, North Carolina, South Carolina,\nGeorgia, Alabama, Mississippi, Florida.\nREGION III - Jim Miles, Y7BAA, Lafayette, Indiana? Ohio, Michigan, Indiana,\nIllinois and Y/isconsin\nREGION IV - Richard C. Hull, r'0I, Ames, Iowa? Minnesota, Iowa, North\nDakota, South Dakota, Nebraska and Wyoming.\nREGION V --- John W. Dunn, Y/NAD, Norman, Oklahoma? Missouri, Kansas,\nColorado, New Mexico, Texas, Oklahoma, Arkansas and Louisiana\nREGION VI - James Morris, KOAC, Corvallis, Oregon? Montana, Idaho,\nWashington, Oregon, California, Nevada., Utah and Arizona\nVice-President\nTreasurer\nExecutive Secretary\nExecutive Committee\nRobert J. Coleman\nW. I. Griffith\nM. S. Novik\nWaldo Abbot. Michigan\nMilford C. Jensen, WCAL. St. Olaf\nWKAR\nWOI\n30 Rockefeller Plaza\nJohn W. Dunn. WNAD, Oklahoma\nJames S. Miles, WBAA, Purdue\nEast Lansing, Mich.\n-\nAmes, Iowa\nNew York. N. Y.\nRichard B. Hull. WOI. Iowa State\nRussell Potter, Columbia"
}