{
  "id": "d375-0",
  "text": "14 Gregory Hall\nTO:\nRE:\nUrbana, Illinois\nNAEB ACTIVE AND ASSOCIATE MEMBERS REGIONS III AND V\nELECTION OF REGIONAL DIRECTORS (BALLOT ATTACHED)\nPhone 7-6611, Ext. 3394\nDue to the election of William Harley, WHA, to the office of NAEB President, and\nthe election of Robert Schenkkan, University of Texas, to the office of 2nd Vice\nPresident, their former positions as Directors of Region III and V, respectively, will\nbe vacant as of January 1, 1959 when they assume their new offices.\nTherefore, by directive of the NAEB Board of Directors, elections by mail must be\nheld to elect new Directors for Regions III and V to serve for the 1959 calendar\nyear. All voting members were given an opportunity to make nominations, as\nannounced in an NAEB memo of October 21, 1958.\nSince voting members may vote only for the Director to represent the region in which\nthey are located, we have listed below the states in each of the regions concerned.\nVote only for the Director of your region.\nRegion III - Illinois, Indiana, Michigan, Ohio, Wisconsin\nRegion V - Arkansas, Colorado, Kansas, Louisiana, Missouri, New Mexico, Okla¬\nhoma, Texas\nMULTIPLE VOTES - All Active Members get two votes, plus an extra vote (for a total\nof three votes) if they operate more than two stations. Associate members get one\nvote. At the bottom of the attached ballot please circle the number of votes to which\nyou are entitled.\nSOMEMEMBERS WILL RECEIVE MORE THAN ONE BALLOT - Due to the fact that in some\ncases (e.g., officers) members have more than one name on our mailing list, some\nmembers will receive more than one ballot. PLEASE BE SURE THAT ONLY ONE BALLOT\nIS SUBMITTED FROM YOUR INSTITUTION (unless your representation is such that you\nwish to split your vote, in which case make sure the combined vote submitted does\nnot exceed that to which your membership entitles you. The By-Laws provide that no\nfestifotipn may have more than three votes under any circumstances, thus institutions\noperating more than two radio and/or television stations and, in addition, holding an\nAssociate membership are still entitled to only three votes.)\nDEADLINE FOR SUBMISSION OF BALLOTS, WHICH ARE TO BE RETURNED TO HEAD¬\nQUARTERS IS DECEMBER 1, 1958. (Ballots must be received at Headquarters on or\nbefore December 1.)"
}