{
  "id": "d375-56",
  "text": "OFFICE MEMORANDUM\nUniversity of Oklahoma\nRadio Stations WNAD and WNAD-FM\nMarch 6th, 1952\nRegional Conference\nMany thanks for the phone call, Hope we didn’t bust NAEB treasury talking so long.\nAppreciate your kind words about the program set up. I’ve had to plug up two holes\nas you will see by the enclosed program schedule which has gone out to all active\nand associate members. These are good people and will really inspire the gang.\nYou will note that I have purposely left you and Sy idle some. Thought you might\nwant to chinwag with certain folk from time to time. Conference rooms will be\navailable either for single or conference groups at any time.\nThe Extension Study Center and the Oklahoma Memorial Union are agreeable about\nbilling for hotel and all group meals. I will sign the tab and verify numbers, etc.\nBill will be presented to you before you leave or forwarded after.\nGetting nice response but we’re giving ’em no rest. Something will be going out from\nthis office to all of the actives and associates from now until conference time,\nconstantly reminding them of the conference, their part in it and how much it\nmeans to them to be here, etc. Maybe that's promotion but that's just the way we\noperate here at WNAD.\nBe sure to let me know when you will get here, etc. Certainly looking forward to your\ngetting in early. Many thanks for your generous attitude towards WNAD staff. They have\nasked me to express their thanks for your graciousness.\nQuestions from the field for the Saturday morning session are coming in pretty well.\nWill list these in a few days and send them on to you for perusal. I think we can\nget a number of \"live” topics around xwhich we can build an interesting and practical\nsession. I've tried to keep the \"cut end dried\" speeches down to a minimum for in\npreliminary bally to members I stressed the fact we would talk about the things which\nthey wanted discussed.\nFinal programs and material are going out to all members of the e xecutive committee\ntoday so that all the boys will know what their responsibilities are. Delighted that\nthe Executive Committee is to meet on the 27th.\nTo\nJim Miles\nFrom\nJohn W. Dunn\nSee you soon!"
}