{
  "id": "d375-69",
  "text": "PROGRAM SCHEDULE FOR REGIONAL CONFERENCE\nREGION V, NAEB, MARCH 28, 29 & 30., NORMAN\nFRIDAY, MARCH 28fch\n9*00 a.m. - 10:00 a0m<»\n10:00 a.m.- 12:00 noon\n10:00-10:05\n10:05-10:15\n10:15-10:20\n10:20-10:30\n10:30-11:30\n11:30-12:00\n1*45 P<>m*\n1:00—1:40\n2:00 p«m« — 4:00 pom*\n12:15 p.m* -\n2:00—2:45\n2:45—3:00\nS 3:00—3:45\n/ 3:45—4:00\nREGISTRATION, WNAD LOBBY, South Wing, Oklahoma Memorial\nUnion Building\nOPENING SESSION, Room 165 UNION, Regional Director John\nW. Dunn, presiding\nMeeting Called to Order by the Regional Director\nRoll Call for Active and Associate Members, Region Y\nWelcome to the University of Oklahoma - Carl Mason Franklin,\nExecutive Vice President, University of Oklahoma\nAnnouncements\n\"The State of Educational Broadcasting in the USA*1 - Seymour\nNo Siegel, WNYC, President, National Association of Educational\nBroadcasters\nQuestions and Group Discussion pertaining to President Siegel?s\nMessage to Active and Associate Members of Region ?«\nLUNCHEON SESSION, Dining Room 1 UNION, Vice President Graydon\nAusmus, WUOA, presiding\n“Public Relations for Educational Broadcasters” - George We\nChurchill, Director of Public Relations, University of Oklahoma\nAFTERNOON SESSION, Room 165 UNION. General Theme: NAEB\nComes to the Grassroots. NAEB Treasurer Frank Schooley, WILL,\npresiding\n“Bringing NAEB Up to Date for Regional Members\" - Burton\nP&ulu, HUGH, Secretary and News Letter Editor, NAEB\nQuestions from the Floor on NAEB\n\"NAEB Headquarters and NAEB Tape Network Operation” - Jim\nMiles. WBAA, Executive Director, NAEB__\nQuestions from the Floor on Headquarters and Tape Network\nNOTE: Since a great number of delegates in attendance will not have\nhad an opportunity to check in earlier, the afternoon session\nwill close around 4*00 p*m«\n6:30 p.m.\n• 8:30 Pom0\n7:30—8:15\nDINNER SESSION, Dining Rooms 2 & 3 UNION, Regional\nJohn Wo Dunn, presiding\n\"The Free World vs Communism\" - Dr. Mo L. Wardell,\nBoyd Professor of History, University of Oklahoma\nDirector\nDavid R<\nl08^\n8:30 p,m. - 10:00 p.m, WE GET ACQUAINTED, West Lounge of the Union\nWNAD OPEN ROUSE Coffee Served in Studio A"
}