{
  "id": "d1400-3",
  "text": "hibiting Congress from passing any law abridging\nfreedom of speech.\nAnswer. Freedom of speech is not abridged. It is\nencouraged. The standards fixed provide for more\nspeech, not less,—and more in the public interest.\nThey do not prescribe in any way the content of pro¬\ngrams, and therefore do not interfere with anybody’s\nspeech. To determine whether programs conform to\nthe requirements does not involve examining their\ncontents; merely their character.\nObjection 3. The standards constitute censorship of\nradio prograins.\nAnswer. Censorship is a big word but the answer\nabove should be sufficient. If the Commission should\nattempt to pass upon the contents of programs in\nestimating whether a station in fact presents public\nquestions or local issues, it could be resisted in the\ncourts under the clear Congressional proviso that\n\"nothing in the act shall be understood or construed\nto give the Commission the power of censorship over\nradio communications.”\nObjection 4. The FCC report assumes that the\nnumber of radio stations is physically limited by the\nnumber of available wave lengths, but the new \"fre¬\nquency modulation” system of broadcasting opens up\nso many new wave-lengths,—many more than the\nlikely number of applicants,—that selection will no\nlonger be necessary. Everybody desiring to go into\nbroadcasting can get a license.\nAnswer. This objection is academic. Radio is a long\nway from having unlimited FM wave-lengths, and\nmay never have them. If they should in time replace\nstandard broadcasting, the Commission may then find\nmuch less need for selection among applicants. But\neven if no selection should then be necessary na¬\ntionally, there doubtless would be a limited number\nof wave-lengths available in larger communities.\nObjection 5. Facsimile broadcasting of printed\nmatter is fast developing. If these standards are fixed,\nthe FCC may thus regulate the press. Television is\ndeveloping; that may be censored, too.\nAnswer. Nothing in the present report suggests\ncontrol of facsimile newspapers or television. When\nthat issue arises, it will be time to consider whether\nthe public interest would be served by requirements\nconcerning the amount of space or attention given to\nadvertising in relation to news and opinion. The\nPost Office Department now requires a distribution\nof reading and advertising in second-class and fourth-\nclass mail; and there is no more reason to fear cen¬\nsorship of facsimile newspapers and television than\nof second-class or fourth-class publications.\nObjection 6. The present system is working well.\nWhy change it? The report opens the door to re-"
}