{
  "id": "d1400-5",
  "text": "already assumed control of program content and may\nextend it. ■'\nAnswer. In the particular case cited, the station-\nowner used his license by employing radio \"tech¬\nnique” to support a particular political candidate\nfor office. The Commission prohibited this because a\nstation-owner has an unfair advantage in expressing\nhis own political views, since there is no adequate\nmeans for reply. Station-owners have sufficient lati¬\ntude in slanting news and programs according to their\nown concepts, and have never been interfered with\nby the Commission in doing so. The case cited was\nan isolated instance of gross impropriety and in 1938\nthe industry strongly approved the decision. Nothing\nin the decision justifies fear of any general censorship\nof program content.\nObjection 9. The Commission’s proposals involve\nfuture dangers which outweigh any possible present\nadvantages.\nAnswer. It is of course conceivable that any regu¬\nlations might be extended in future to a censorship\nof programs. But so could the F.C.C.’s inherent power\nof granting and renewing licenses in the \"public in¬\nterest.” Courts and public opinion would create pow¬\nerful obstacles to such an unlawful censorship, ex¬\npressly prohibited.\nAgainst this remote possibility the present ad¬\nvantages to the entire radio audience of setting aside\ntime in the public interest free from commercial\nconsiderations are clear in the light of the recognized\nabuses.\nThese are the objections and answers. We sub¬\nmit that they make out a clear case in support of\nthe Commission’s regulations in the public interest.\nWe urge all who support the position taken by the\nACLU to address the FCC, Washington 25\npromptly.\nCopies of a statement reprinted from the Con¬\ngressional Record on the FCC report by the Radio\nCommittee of the ACLU will be sent free on re¬\nquest, together with a reprint of a radio speech on\nthe report by former Judge Thurman Arnold,\nspeaking for the ACLU."
}