{
  "id": "d1085-1",
  "text": "The Cc^rrtission must determine whether the vnst educational potentialities of\ntelevision are to be left wholly in the hands of commercial operation or whether the\neducational forces of the nation are to be permitted to participate in the use of this\nmedium for the advancement of the level of education in this country so necessary for\nthe furtherance of democracy* hile commercial radio has heretofore attempted to\nachieve some program balance, such an attempt must be compatible with the fully\nrecognized and entirely ap >roved responsibility for making commercial radio net only\nself-sustaining but a profitable business operation. The JAKB respectfully submits\"\nthat telovision should not remain merely a branch of business to be devoted to the sale\nof goods or services, with educational benefits representing a by-product largely\nbeyond the control of the educational forces of the nation- If television in the\nUnited ...tat s is to be fully utilized by education to expand its benefits within\nand beyond the class-room to maintain a continuing and effective influence upon the\nmental and social development of our citizens, it is essential that the country’s\neducators have specific television channels reserved for their use.\n6., The need for the reservation of specific channels for non-commorcial tele¬\nvision broadcasting should bo obvious to the Commission-. To obtain funds necessary\nfor the large investment required by television will naturally be a slow process\nfor educational institutions* The private- entrepreneur seeking a sound business\nopportunity can enter into television much mere rapidly than can an educational\ninstitution* Consequently, if the Commission does not reserve specific channels\nfor non-commercial educational television, such channels will undoubtedly be usurped\nin many areas before educational institutions can compete with others to obtain them*\n:*oreovcr, the assurance by the Commission that channels will be available rail give\nthe necessary support to educational institutions for obtaining an allocation of\nfunds for television*\n7* The basic need for the allocation of television channels here requested has\nbeen stated simply above* The use of tele vision by educators would achieve, among\nothers, the following objectives;\nA* The imparting to students and all others a greater understanding\nof the importance to society of television broadcasting and a\ngreater aptitude for utilization and critical evaluation of\ntelevision programs.\n.Schools, colleges, and universities have increasingly recognized\nthe obligati oil of bringing the results of their teaching and research\nto the attention of the general public. The General Extension,\nAgricultural Extension, and Adult Extension divisions and programs of\nthese institutions is playing a major part in informing and educating\nthe general public in a complex technological world* Indio lias\nplayed an important part in this activity. Television should play\nan even more important role.\nC* The utilization of television for direct instruction in formal educa¬\ntion both as an adjunct to class-room stud;/ and as an extension of\nformal learning to the graduate and the general public. This is cf\nparticular importance at the present time because of the inadequacy\nof class-room facilities (as well as housing facilities) at many\ncollege-level institutions and the shortage of qualified teaching\npersonnel*\nD* The bringing cf regional and national educational resources to the'\nlocal centers of education.\nE* The improvement cf the quality of television programs*"
}