{
  "id": "d1085-2",
  "text": "- 3 -\nF« The providing cf television programs which appeal to and\nsatisfy the needs of significant minority groups. (Consistent\nv/ith sound business practice, such minority groups arc offered\na reasoiiable program fare meeting their specific needs only in\nmarkets where the large number of stations make it commercially\nfeasible to cater to those needs»)\nG. The providing of a diversity of programs by establishing new\ntelevision stations especially in those areas which will not\nobtain a diversity of television programs*\nH* The utilization of television for informal education in natters\nof general public education and culture.\nI* The furnishing of reliable and responsible news, news commentary\nand discussions of public issues,\nJ« The encouragement of distribution of television receivers in many\nareas, thus redounding to the advantage of commercial television\nstations in those areas.\nK. Cooperation with civic, religious and charitable organizations in\nfurthering their work*\nL* Cooperation in the exchange of program material with existing\nbroadcast stations, nctvrcrks, and organizations engaged in\ndomestic and international broadcasting.\nN* The conduct cf research and experimentation in new and improved\nmethods of utilizing television for educational and cultural\npurposes.\nho The conduct of research and experimentation in and to encourage\nthe technical improvement of broadcasting*\n0» The training of personnel (students and educators alike) in the\nutilization of television facilities both in the technical and\nprogram phase* A recent Veterans Administration report 3hcws\nthat 136,000 veterans are taking radio and television courses\nthrough the educational benefits administered by that agency-\nThis will provide through recognized colleges, ‘schools or\nuniversities accredited instruction of a type which trade\nschools are not able to supply,\nP» The utilization of television to publicize educational trends\nand projects, and to provide a greater interest in and support\nfor educational programs and objectives.\n% The coordination of television activities of educational\ninstitutions throughout the nation to provide a comprehensive\nplan for efficient and economical use thereof.\n3. Upon an allocation of the frequencies herein sought, the I1AK3\nwould offer its fullest cooperation to all individual institutions and\neducational organizations in undertaking to achieve the objectives set\nout above."
}