{
  "id": "d237-103",
  "text": "WAEB YEARLY PLACEMENT SUPPLEMENT\nThe following are descriptions of all persons now registered with the\nNAEB Placement Service. Further information concerning them may be\nobtained by writing Mrs. Judith Stevens, Placement Officer, 14 Greg¬\nory Hall, Urbana, Illinois. Also, anyone interested in registering\nwith us should contact Mrs. Stevens.\nJanuary 1 - Producer-director, 2 years experience in ETV, writing, prod¬\nuction, coordination. 6 years teacher at high school and college-level.\nSingle woman, 33, B.S. in Ed. Location open. $85/wk.\nJanuary 2 - Male, married, 32 , B.A., with 4 years TV experience with\nmajor network and solid film background, desires position as program\ndirector or producer-director. Has extensive managerial experience\n(supervised Japan's first TV network). Location open. $6000.\nJanuary 3 - Motion picture and' TV production technician. Good film ed¬\nitor and administrator. 6 years experience in educational motion pictures\nas production chief. Male, 31, married, B.A. Location open. $6500.\nJanuary 4 - Young man, married, 30, PhD., with 5 years college-level\nteaching in Radio-TV, administration experience, broad background in\nradio and some TV production experience. Wants an ETV administiation-\nteaching position. Prefers location in West. $5600.\nJanuary 5 - Male, single, 27, desires position as program or production\nassistant. 300 hours technical instruction in use and maintenance of\nstudio equipment; university courses in programming and production.\nPractical experience in municipal educational station. Location, salary,\nopen.\nJanuary 6 - Experienced announcer, also has written, produced-directed\nnow in commercial recording, wishes position in ETV as production\nmanager or announcer. Location open. $80/wk.\nJanuary 7 - Creative director-producer with 18 years experience in all\ntypes of commercial radio-TV shows, wants switch to educational broad¬\ncasting. Widow, 52, B.A., prefers near New York City or San Francisco.\n$7500.\nJanuary 8 - Woman, single, 40, B.A., wants producer-director-writer\nposition college radio station where she could continue work in music.\nHas 4 years experience in field. Location open. $2500."
}