{
  "id": "d237-109",
  "text": "-7-\nJanuary 53 - Male, single,. 38, M.A., 2 years radio experience and,4 years\nteacher, desires position in ETV, direction or programming . Interested-in\njoining a new and growing station.or school system,for development of.\nprograms. Licensed teacher.. Location open. $4500.\nJanuary 54 - Jylale, 28, single, M.S., presently chief of operations of\ncommercial VHF station, is seeking a responsible, position in ETV. Back¬\nground. includes teaching and educational radio-TV. Interested in use of\nTV in schools. Location open. $7000.\nJanuary 55,- Male , married, 27, PhD due in IS58, seeks a position in pro¬\ngramming and/or production in educational broadcasting. Recently back\nfrom Berlin on a Fulbright. Work on dissertation (musicology) presently\nin progress; all residence requirements completed. Over 4 years experience\nin commercial broadcasting. Interested in news, polities and general\ncultural broadcasting as well as music. Location open. $5000..\nJanuary 56 - Radio program and 16mm motion picture producer seeks oppor¬\ntunity to put 12 years experience to work for educational broadcasting..,\nBackground comprises all phases of radio announcing and program produc¬\ntion, managership of educational FM station:, instruction of students ,\nand production of sound-color campus motion pictures. Male, single,\n35, A.B. Location open. $5200.\nJanuary 57 - Young experienced TV production man and film maker wants a\nteaching fellpwship and/or part-time appointment in production at ETV\nstation connected with university offering M.A. in broadcasting. 22, B.A.,\nsingle. Location east of Mississippi and north of Mason-Dixon line.\n$150/mth plus tuition ., or $200-250/mth.\nJanuary 58 - 1956 college honor graduate, majored in Radio-TV, broad, educa¬\ntion, yet trained in aspects of radio-TV production. Radio announcer\nsenior year. Leans toward news presentation and public relations. Male,\nsingle, 22, B.S. Location open. $75/wk.\nJanuary 59 - Experienced writer, children’s director, 5 1/2 years at 5 kw\nradio station. First award, IERT, 1956 (Regional Net and Clear Channel\ncompetition) Experienced all phases radio production. Male, married,\n31,, B,.S. Prefers locate in West Coast or Arizona. $6000.\nJanuary 60 - Cameraman, floorman, technician. Three years experience in\nthe commercial and educational field. All studio operations. Will relocate.\nMale, married, 29. Location open. $80-90/wk."
}