{
  "id": "d237-112",
  "text": "-10-\nJanuary 76 - Recent studio supervisor for U.S. Army in Tokyo, Japan,\ndesires news director (on-camera work), producer-director or program\nmanager position in educational radio-TV. Has been with Radio Free\nEurope as producer. Radio Free Asia as assistant program director. Six\nyears experience in educational communications. Male, 33, single, M.S.\nPrefers New England or Modwest location. $5-6000.\nJanuary 77 - Young man, 2S, single, seeks writer-producer position with\npublic service department of educational radio or TV. Experienced as\nwriter, director and producer in commercial and ETV. Some film writing\nand production experience. B.A., M.A. and all course work for Ph.D.\nHave taught radio-TV and Speech on college level and have secondary\nschool certificate. Prefer Northeast location. $6000.\nJanuary 78 - Young man, 28, M.S. in Education, wishes position in\neducational broadcasting in programming or production. Is now announcer\nfor commercial TV station. Has taught college-level and would like to\nteach in connection with any position. Three years TV experience, 2\nyears in radio. Single. Location open. $4500.\nJanuary 79 - Producer-writer with 3 years experie nee on commercial\nnetworks desires switch to ETV. Worked on commercial production for\n“Stop the Music/* etc.; program assistant on “Double or Nothing,”\namong other activities. Male, 25, B.A. (Syracuse), single. Location\nopen. $7500.\nJanuary 80 - Experienced cameraman desires position on production staff\nof educational station. Five years stage managing and directing in\ntheater. Studio cameraman with commercial channel in New York last\nsummer. Male, B.A., 3 6, married. Go anywhere but deep South. $65/wk*\nJanuary 81 - Director with commercial station desires ETV position as\nproducer-director. Interested in teaching. Male, 23, M.S. (Syracuse),\nmarried. Location open. $85/wk.\nJanuary 82 - Male, 44, married, M.A., desires position as producer,\nstation manager, program director, or writer in ETV station. Now teaching\nTV writing in university. Has been writer-producer-announcer in ETV.\nSeventeen years broadcasting experience. Location open. $7200.\nJanuary 83 - Man with over 5 years TV experience as lighting director in\na New York network station seeks position as production manager, program\ndirector, producer-director in ETV. 31, B.A and M.F.A., married.\nLocation open. $8000."
}