{
  "id": "d237-114",
  "text": "-12\nJanuary 93 - Teacher of production-direction in eastern college wants\nposition as producer in ETV. Has been producer-director for educational\n-commercial station. Wants position with responsibility for planning\nand executing new ideas. Male, .40, married, Ph.D. Prefers locate in\nEast. $5000.\nJanuary 94 - Male, 35, married, Ph.D., now employed as top executive\nin commercial TV station, wants administrative-production spot in ETV.\nHas 11 years experience as writer-producer, announcer, production\nmanager, etc. Has taught college level. Location open. $7000.\nJanuary 95 - Creative designer desires position as art director in ETV.\nTen years professional experience includes: writing, design, direction\nof films for UPA (animated and live), management of own advertising\nart business that handled national accounts. Male, 32, single. Location\nopen. $10,000.\nJanuary 96 - Male, 30, M.A., single, desires music director position\nin educational broadcasting. Has been producer-director for ETV station,\nmusic supervisor with commercial TV. Can, and has taught. Location\npreferred on either coast. $5500.\nJanuary 97 - Experienced writer-producer now supervising productions\nof students on radio for a university, wants to write-produce for ETV.\nLikes to teach, especially over TV. Male, 29, M.A., married. Prefers\nNew England, Florida, and/or California. $4800.\nJanuary 98 - Producer-director of educational films dissatisfied with\npresent position as manager of 16mm distribution set up, seeks ETV\nstation offering better use of capabilities. Male, 30, married.\nLocation open. $6500.\nJanuary 99 - Woman, single, 30, B.A., now working as assistant to\ndirector at an ETV station wants to better herself in the same field.\nHas worked as director-switcher, production, administrative-managerial,\npublicity, etc. Location open. $3900.\nJanuary 100 - Director of Public Service and educational programs for\nMidwest commercial TV station seeks position as program director for\nETV station. Former college instructor with over 10 years experience.\nMale, 42, single, Ed.D. Location open. $7500,"
}