{
  "id": "d237-116",
  "text": "-13-\nJanuary 101 - Recent Ph.D. currently teaching and producing in radio-\nTV at Big 10 university, is looking for advancement in the field. Four\nyears commercial radio and educational broadcasting experience. For¬\nmer administrative director of broadcasting at a major midwest univer¬\nsity. Eight years teaching college level. Male, 34, married. Location\nopen. $6500.\nJanuary 102 - Producer and talent of well-known science TV program,\n12 years teaching science, desires position with ETV station where he\ncan further use his creative ability. Male, 35, M.S., single. Location,\nsalary open.\nJanuary 103 - Male, 26, married, B.A., recently graduated, desires\nposition as production assistant in educational broadcasting. Has\nsome school experience in radio-TV and worked as an actor 3 years\non the professional stage. Location open. $4000.\nJanuary 104 - Male, 37, B.A., married, experienced in commercial\nand ETV desires position as staff artist, production assistant, etc.\nLocation open. $85/wk.\nJanuary 105 - Male, 35, married, M.A., with 8 years in commercial\nand ETV, now employed as program director for commercial station.\nWants similar position in educational broadcasting. Some teaching\nexperience. Location, salary open.\nJanuary 106 - Pioneer in educational broadcasting, now head of radio\noperations for large university, wants administrative position at educa¬\ntional station. Has long record of curriculum building and school\nstation building, as well as practical production experience. Male,\n48, married, Ph.D. Location open. $7500.\nJanuary 107 - Recent radio-TV graduate who has taught a radio workshop,\nwants position in educational broadcasting in news, special events,\nor production assistant. Male, 23, single, B.S. Location, salary\nopen.\nJanuary 108 - Male, 41, married, B.A., now employed as film expediter\nin commercial TV, wants switch to ETV. Has been production manager,\nfloor manager and director. Location, salary open.\nJanuary 10S - Producer-director in TV and radio with network experience\nand broad professional theater background, wants to produce-direct\nin educational broadcasting. Has been production manager and staff\nTV director. Male, single, 49, M.A. Location, salary open."
}