{
  "id": "d237-12",
  "text": "TO* Officers, TO\nFROM* Skoraia\nHAEB Headquarters\nApril 13, 3954\nApril 8, 1954\nMr, Robert R. Mullen, Executive director\nNational Gitisens Gommittee for Educational TV\n1200 ~ 18th Street, N.W.\nWashington 6, E. G.\nBear Bobs\nYou will recall the various divisions of labor that wore discussed last\nfall at the time of the meeting in Chicago when you, Harry Skornia, Graven\nAusmus, Ralph Steetle and Bob Hudson joined with Scotty and me to clarify\nthe general picture of services in educational television. Ion will recall\nthat it waa agreed by all present that* (l) In its present stage of develop¬\nment the field could not afford to support more than one personnel placement\nservice? (2) That this service was most appropriately the function of the\nMSB as the professional organisation in the fieldj (3) That th<* Fund would\nundertake to underwrite an appropriate service on the part of the NAEB as\nsoon as circumstances should permit? (4) That with the establishment of this\nservice on the part of the HAEB, this function would cease to b* th© responsib¬\nility of any other group operating under Fund support? (3) That until such time\nas the mEB service waa in fact activated, the HCGET might properly continue\nto collect such materials as might come its way preparatory tc transferring\nthem to the NAEB.\nAs a result of action taken over the past several weeks, ihe MSB has\nnow received the necessary underwriting froc the Fund for the establishment\nof this placement service. I understand fran Harry Skoraia tbet it is\nscheduled to be in full operation aa of May 1st.\nIt is our understanding here that as of Uhls date the HCCKf will complete\nits transfer of materials to the rIAEBj that it will terminate 11 s services of\nthis type as of that date? and that thereafter it will turn over to the MEB\nany inquiries or solicitations it receives.\nI would appreciate your letting me have word confirming ti;« above.\nSiacerely yours,\nG. H. Griffiths\nGHG:EH"
}