{
  "id": "d237-120",
  "text": "-17-\nJanuary 138 - Woman's director and public affairs director of commercial\nAM-TV station wants position in ETV. Has 5 years experience; received\naward for “distinguished public service through TV.** Woman, 33, single,\nM.A. Desires Midwest or East location. Salary open.\nJanuary 139 - Music director with 8 years experience in commercial radio\ndesires position in educational broadcasting. Has taught and lectured\nextensively and would like to teach. Male, 44, Ph.D. pending. Location\nopen. $4500.\nJanuary 140 - Male, 30, M.A., single, with experience in commercial FM\n“good music** station as announcer, music commentator and program depart¬\nment. Gan also write and will teach. Location open. $4000.\nJanuary 141 - Public relations man with 3 years experience in the field wants\nto help build the status of ETV. Will travel. Male, 30, single, B.A. Loca¬\ntion open. $3000.\nJanuary 142 - Male, Ph.D., married, 26, desires position in ETV. Has some\nTV experience, and much stage experience. Location open. $90/wkk\nJanuary 143 - Producer-director in commercial TV desires return to ETV.\nMisses atmosphere of university community. Has 2 1/2 years radio exper¬\nience as announcer. Will teach. Male, M.S., married, 27. Location\nopen. $5500.\nJanuary 144 - TV technical supervisor for New York network with chief\nengineer's qualifications and major network experience desires permanent\nposition with ETV. Male, 51, married. Location open. $8000.\nJanuary 145 - Male, 39, married, M.A., wishes position in ETV. Was\nassistant producer of “The Living Blackboard** and has written ETV articles.\nIs now teaching and would teach in connection with his position. Location\nopen. $4000.\nJanuary 146 - Chief engineer for radio-TV, thoroughly experienced in practical\nand theoretical operations. Wishes permanent position. Male, married,\n50. Location open. $12,000.\nJanuary 147 - Producer-director position desired by technical director of\nlarge commercial TV station. Has been TV cameraman with New York network\nstation, trained in documentary and educational films. Male, 35, married,\nB. S. Location, salary open."
}