{
  "id": "d237-121",
  "text": "-18-\nanuary 148 - Male, 31, married, B.S., with experience as news analyst,\nwriter, producer and director in radio-TV, wants position in educational\nbroadcasting. Location open. $12,000.\nJanuary 148 - Woman, 31, single, B.S., with 11 years experience in broad\ncasting, newspaper work and publicity, desires position in ETV as public\nrelations., program research or news. Location open. $5000.\nJanuary 150 - Young woman, 26, single, M.A., trained in research and\nwriting and experienced in writing and radio broadcasting wants position\nin educational broadcasting. Prefers locate in Chicago. $3600.\nJanuary 151 - Producer-director-writer with 26 years experience in com¬\nmercial broadcasting wants similar position in educational broadcasting.\nWas producing-directing practical experimental programs as early as 1836.\nMale, 48, single. Location open but prefers a place where the fishing\nis good. $120/wk.\nJanuary 152 - Male, married, 34, B.A., with much experience as TV prod¬\nucer-director and film director. Directed first ETV series in U.S. capitol.\nWants ETV position as program manager or production manager. Location\nopen. $6000.\nJanuary 153 - Executive and educator interested in planning and producing\nETV programs featuring public affairs and current events. Male, 44,\nmarried, Ph. D. Location open. $10,000.\nJanuary 154 - Writer, male, 25, single, B.A. in Motion Pictures and\nEnglish desires position in educational broadcasting. Wrote scripts for\nUN radio in Tokyo. Wants locate in New York area. Salary open.\nJanuary 155 - Producer-director at ETV station wishes same position or\nstation manager job with ETV station located at a college or university.\nHas taught radio-TV college level 4 years, 3 years professional experience\nand program director for educational radio station. Male, 32, married,\nPh.D. Prefers California or north-central area. $10,000.\nJanuary 156 - Cameraman, 6 years experience related to 16-35mm cine¬\nmatography, recording, editing, processing, member SMPTE, wishes\nETV position. Male, 28, single. Location, salary open.\nJanuary 157 - Woman, 34, single, M.A., experienced in radio-TV writing\nand has taught many years, wants writer-director position in ETV. Loca¬\ntion , salary open."
}