{
  "id": "d237-122",
  "text": "-19-\nJanuary 158 - Program director and production manager for ETV station\nseeks similar position with beginning ETV organization. Ten years\nbroadcasting experience. Has and would like to teach. Male, 30, mar¬\nried, working on M.A. Location open. $6500.\nJanuary 159 - Young woman, 27, single, M.A. in radio-TV, is interested\nin TV program development and production. Presently employed as prod¬\nucer-director, public relations and continuity for ETV station. Location\nopen. $5400.\nJanuary 160 - Male, 43, single, M.A., with 7 years teaching and has\nproduce-directed over 76 ETV programs over a commercial station, wants\nproducer-director position in ETV station. Prefers Western location.\nSalary open.\nJanuary 161 - Producer-director with 4 1/2 years in ETV and radio station,\nalso professional musician, has done and wants to produce cultural pro¬\ngrams (art, music, children’s) for educational broadcasting station. Male,\n35, single, B. of Music. Location open. $5200.\nJanuary 162 - Male, 30, married, B.S., with 3 years experience in com¬\nmercial TV as producer-director, interested in produce-directing for ETV.\nHeavy experience in music, drama and religious programs. Would like\nto locate near Chicago. $45 0/month.\nJanuary 163 - Male, 29, single, M.S., with theater, education and TV\nbackground desires position in ETV. Has produced and directed several\nhour-long TV dramatic shows. Location, salary open.\nJanuary 164 - Executive in major governmental research program at a\nuniversity wants executive post in educational broadcasting. Six years\naudio-visual research and supervision, major publications, professional\nand technical experience. Male, 39, Ph.D. in Communications, married.\nDesires locate in the West. $10,000.\nJanuary 165 - Experienced producer-director seeks larger opportunity with\ninstitution planning or operating an educational broadcasting station that\nmay expand. Has done educational public relations, commercial newspaper\nand radio over 12 years. Male, 32, married, B.S. Prefers Southwest,\nWest or Florida. $42 00.\nJanuary 166 - Male, single, 39, M.A. in Theater, 2 years radio experience,\n4 years teaching, wants ETV position directing or programming. Will\nteach. Location open. $4500."
}