{
  "id": "d237-129",
  "text": "NAE3 Placement Service\n-2-\nNoveraber 1954\nNov. 8 TV Workshop graduate, age 23, seeking apprentice position with\nTV station. Able to work camera, dolly, cables, lighting, etc. Salary-\nsecondary. Will travel if necessary.\nNov. 9 Woman desires position utilizing background and training in ed¬\nucation and television. Taught English in secondary schools for 5 years.\nRecently completed graduate course of study in radio-television with\n11.5. degree. Single, 36, references.\nNov. 10 Interested in getting located in the creative fields of tele¬\nvision. My certificate fror: the summer institute of radio and televis¬\nion of Barnard College and the National Broadcasting Company attests to\nthe fact that I am a person of ideas. I can be of valuable service to\nany producer.\nNov. 11 Experienced writer, producer, director of film for theater and\nTV. A.B., M.A., seconda^ certificate, course work completed toward\nPh.D. in literature. Broad background in film production as freelance\nand for commercial producers. Seven years experience as college in¬\nstructor of literature, journalism, writing, publications. Harried,\nveteran, two children. Highest references from industry and education.\nNov. 12 Director of public service and educational programs for mid¬\nwest commercial television station seeks position as program director\nfor educational station. Holds Doctor of~Education degree in educat¬\nional foundations and is former college instructor. Over ten years*\nexperience in education and teaching. Experience in theatre and dram¬\natics activities. Television experience consists of two years as pro¬\nducer and director of public service and educational productions plus\nfirsthand knowledge of studio operation. Complete details of back¬\nground and experience upon request.\nNov. 13 Thoroughly trained in all phases of television production. Can\nhandle all from dolly pushing to directing and producing. Will work\nanywhere. Thoroughly trained in all phases of radio broadcasting. Can\nhandle all from news to classical music. Eamiliar with console.^\nNov. 14 Industrial designer-artist desires full time position in educat¬\nional TV as art director. Will Mdouble” as production assistant. Col¬\nlege graduate. Six years experience product design, advertising art,\nmodel making, small shop operation. Knowledge of TV station operation\nand procedures; has handled all phases TV art, flip-cards to set design,\nat educational stat ion. Prefer Northeast or North Central states.\nNov. 15 Production manager-doubles in brass as scenic designer-painter,\ngraphic artist and lighting director, etc. Educational station and top\nNew York network experience. Ideal man for small, budget-minded stat¬\nion. Married — 2 children. Wish to locate in Midwest, South or East.\nBest references. Reasonable salary requirements.\nNov. 16 Iiollyro od TV-radio producer-writer-M.C. Director of more than\n1000 educational video-radio programs seeks affiliation with education¬\nal station in similar or other capacity. Also interested in affiliation"
}