{
  "id": "d237-131",
  "text": "1TASB Placement Service\n-4-\nNovember , 1954\nothers# Has also produced radio programs and series centered around\nfine music, literature, and sociology. Location not important# Pre¬\nfers creative and responsible position.\nNov. 25 Young woman teacher; B.A. Radcliffe; E.A., Columbia* Jxperien-'\nced junior-senior high school, junior college, adult education* English,\nsocial studies, science, guidance, dramatics, radio-writing-production,\nschool publications, PTA and community activities; member professional\nand civic organizations# background travel, social service, advertis¬\ning, magazines, radio-TV reviews, public relations. Would like position\nwriter/director; experienced radio-television writing, production, an¬\nnouncing, tape editing* numerous contacts educational and commercial\nfields# Willing to teach part-time, any level# Salary secondary liv¬\ning-working conditions and atmosphere#\nNov# 26 Would like position as head of cbmnunications division in col¬\nlege, or public school system, to direct radio, motion picture ana tele¬\nvision operations and research and curriculum. Age 36, Ph.D. in com¬\nmunications and industrial psychology, Stanford University; Sigma Xi#\nSix years of audio-visual research and research supervision, with maj¬\nor publications# Professional and television. Extensive staff and\nmanagement experience in government and academic communications re¬\nsearch and operating organizations. Formerly Director of Radio Work¬\nshop and Audio-Visual Aids program, major western university. Able\nto undertake the development of a new academic division to integrate\nthe arts and sciences involved in mass communication, offering applied\nundergraduate degrees, as well as a research Ph.D. Presently serving\nas Executive Assistant, Office of the Director, major governmental\nresearch program at a university#\nNov# 27 Man with extensive experience and training as teacher, school*\nadministrator and with one year of administrative experience in a\nnewly organized commercial television station desires position with\nan educational station as supervisor of live programing. Television\nexperience includes planning and supervision of building a combined\ntransmitter and studio building; organizing dnd producing a college\ntele-course for credit; producing and conducting an informational farm\nprogram; organizing music and dramatic shows; supplying and coordinat¬\ning public service, film and slide spots, and live shows; sales work;\nand continuity writing.\nNAEB\nEducational Television and Radio Placement Service\n14 Gregory Hall\nUrbana, Illinois\nNovember, 1954\nDon Walker (in charge)"
}