{
  "id": "d237-132",
  "text": "HABB PLACEMENT? SERVICE\nAnyone wishing to register with the 1IAE3 Placement Service\nshould write Don Walker, 14 Gregory Hall, Urbana, Illinois, and\nthe proper forms will be sent to you by return mail#\nThe following descriptions of personnel listed with us are\nwritten by the applicant^ and taken directly from the Placement\nService forms#\nSept# 1 Young ambitious veteran, married, one child,.studio op¬\nerations graduate of Television Workshop, seeking position on\ntelevision technical staff# Can operate television camera, vid¬\neo, audio, turntables, mike boom, projectors and remotes# Photo¬\ngraph and resume on request# Will relocate anywhere in the Un¬\nited States#\nSept# 2 Available at once: Kan, age 50, Ph#D# degree, family,\nwith background of successful experience in university teaching\n(music) and in commercial broadcasting#\nTeaching included fifteen years orchestra and band conduct¬\ning as well as various courses in music education and instrumen¬\ntal music. Broadcast experience last ten years as director of\neducation and research for leading mid-west station. Have worked\nclosely with school and college officials in planning educational\nseries, radio and television.\nPosition desired in educational broadcasting with possibil¬\nity of special cooperation with music department#\nSept. 3 Are extra hands needed in your station*s operation? Do\nyou want a person who is creative, capable, energetic, enthusias¬\ntic, loyal and willing to work? A person who is experienced and\nwell trained in all aspects of broadcasting--program planning and\nbuilding, radio and television writing, production, acting, an¬\nnouncing, audience measurement and savoir faire?\nSept. 4 Experienced radio-TV writer and producer. Bachelor*s\ndegree, 1944# Worked as radio copywriter and company radio dir¬\nector. Active in field of television since 1948. Station and\nagency experience# Worked with film and live studio production#\nWritten and directed numerous public service program series.\nMaster*s thesis, 1954 — \"Study of Television Public Service Pro¬\ngramming”# Has instructed college classes in radio-TV# Desires\nuniversity position.\nSept. 5 Good educational background# 21aster*s in business ad¬\nministration. Experience in teaching, nursing, restaurant man¬\nagement, engineering offices, radio and TV, ex-WAVE. Likes to\nwork with people. Has had quite extensive travel. Appreciates\npossibilities* of audio-visual work.\nSept. 6 Writer, 27, seeking radio-TV post. 1I.A# Worked with\nBBC for two years; has contributed to U*S#, British periodicals;\ngood news background#"
}