{
  "id": "d237-133",
  "text": "NASD Placement Service - 2 - September 1, 1954\nSept* 7 Stage producer/director with 350 hours of producing and\ndirecting every type of television program* Emphasis on creative\nproductions at low-level budget. Stage manager of the off-Broad-\nway production, \"The Chair”*\nSept. 8 Already in educational television. Seeks position with\nstation or university TV center staff. Been producing and direct¬\ning educational television programs the past yearw Experience\nalso includes one year of commercial TV crew work, and three years\nas a radio newsman. Program ideas, talent, direction, film,\nwriting. Master of science in television from Syracuse university.\nCooperative, aggressive, wants educational TV to be a success.\nHarried. Best references.\nSept. 9 Script writer, 26, female, 3 years experience commercial\nradio, seeks educational affiliation. 3.3. in journalism, P.G.\nwork in education, member AWRT and DAVI. Prefer east or middle\nwest. Available October 12.\nSept, 10 Wanted.,.Chance to be creativej Young woman*22, with\nBachelor's degree with highest distinction from Purdue University\nin journalism and theater. Year's intensive experience in com¬\nmercial radio and television continuity, plus about everything\nelse in small station, deeply desires position in educational rad¬\nio and/or TV, which involves chance for quality writing and pro¬\ngramming .\nSept. 11 Young woman for production and programming. Active,\nhard worker, varied experiences, Master's degree.\nSept. 12 Graduate of Pratt Institute in advertising design in\n1949. Was producer, director, art director for TV training pro¬\ngrams 3-^ years, at Special Devices Center, Port Washington, N.Y.\nWas producer of motion picture training films for 2 years at U.S.\nNaval Photographic Center, MS Anacostia, Washington DC. Exper¬\nience in all phases of production in educational TV and training\nfilms.\nSept. 13 Industrial designer-artist desires full time position\nin educational TV as art director. Will ”double” as production '\nassistant. College graduate. 6 years experience product design,\nadvertising art, model making, small shop operation. Knowledge\nof TV station operation and procedures; has handled all phases\nTV art, flip-cards to set design, at educational station. Prefer\nNortheast or north central states.\n^hwhhhhhksPOSITION OPEN — Technical Director for educational TV\nstation. $3600 per annum. If interested, please contact Place¬\nment Service office.\nMSB PLACEMENT SERVICE - 14 Gregory Hall - Urbana, Illinois - Don\nWalker (in charge) - September 1, 1954."
}