{
  "id": "d237-134",
  "text": "NAEB EDUCATIONAL TELEVISION AND RADIO PLACEHENT SERVICE\nNext week, most of the applicants on file here will receive our\nnew Placement Service application forms to fill out* Some of the\napplicants have already spent considerable time, effort and money\non their personal data sheets or resumes* However, we must ask\nthem to fill out•the new forms in order that we can handle, in an\nefficient manner, the many applicants who are filing with us*\nPOSITIONS RANTED\nJuly 1: Television specialist available for top-level position\n(station manager, program coordinator, or production manager)\nwith educational TV center and/or university teaching staff* Qual¬\nified by study of and participation in all phases of broadcast-*\ning, particularly program planning, preparation, and presentation.\nVaried associations with the theater, motion pictures, advertis¬\ning, and allied fields. Has read laws of learning as well as\nHooper charts, and knows about attitudes, sterotypes, and ”circles\nof concern” as well as about climax, scene, and suspense* Proven\norganizational and administrative abilities; outstanding creat¬\nive talents and showmanship. Successful college teaching exper¬\nience. 3.A. in English; II. A. ■ in Radio-Television; work on Ph.D,\nin Education, 40, personable, cooperative, adaptable. A-l ref¬\nerences,\nJuly 2: Rould like to leave commercial broadcasting at smaller\nsalary* Although would like to concentrate on managerial work,\nwould enjoy writing, announcing and if desirable, teaching. Has\nhad experience as program director, news editor, writer and an¬\nnouncer for both radio and TV,\nJuly 3: Prefers position as program assistant. Production work\nwith some opportunity to produce and plan programs and be used as\ntalent. Has had considerable experience in film programing, in all\nphases. Also has enough knowledge of traffic and continuity to\nset up such operations.\nJuly 4: Commercial writer, announcer, and talent all in one per¬\nson, Has had lead roles on all major networks as talent in both\nradio and TV. Has also been a studio manager in radio—posit¬\nion entailing supervision of all radio operation—programming,\nproduction, and personnel. At one time worked as an independent\nTV producer. Sold first TV effort,\nJuly 5s A lady who has a bachelor's degree in Home Economics and\nScience. A master's degree in English and history. Has had\ntraining in all phases of television. Also has served as home de¬\nmonstration agent and director of county community activities.\nTraining in home economics enables her to handle food and cloth¬\ning presentations with professional flair and finish. Age-old\nenough to have developed mature reasoning, poise and dignity, and\nsound judgement; young enough to be alert to new ideas, enthus¬\niastic, and ambitious."
}