{
  "id": "d237-136",
  "text": "EDUCATIONAL TELEVISION AND RADIO PLACEMENT SERVICE\nBy the July issue of NEWSLETTER, the NAEB EDUCATIONAL TELEVISION AND\nRADIO PLACEMENT SERVICE should be up to date, and the new forms for Job appli¬\ncants available. Also, positions available forms for prospective employers\nwill be sent to member stations.\nBelow are listed a few of the dob applicants in our file at present.\nMore information on each person is available by contacting Don Walker, lh Greg¬\nory Hall, Urbana, Illinois.\nJune -1 Has a solid knowledge of public relations (its techniques and cap¬\nabilities), and a thorough schooling in music. Prefers position in Chicago or\nNew York area.\nJune - 2 Desires work as program director or producer-director. Has had over\n11 years commercial radio and television background« Has performed every type\nof radio air show known® Has been both producer and talent in television.\nExceptional musical background. Has taught radio programming, production,\nwriting and announcing.\nJune - 3 Past superintendent of schools with broad and varied background in\nfields of education and training at the supervisory and administrative level\nwishes job in radio or television. Has government Service Grade 1U$ had great\ndeal of experience in audio and visual aids, and in planning and supervising\neducational programs.\nJune - h Science education teacher, especially skilled in audio visual aids\nconcerning science demonstrations for elementary science, seeks position in\neducational television. He has published thirty^four articles, plus three\nbulletins for the United States Office of Education. He has also written TV\nprograms in science for children.\nJune - £ Desires position in programming and production. Has been educated\nin both advertising and business administration as well as education and lib¬\neral arts. Has had experience in news editing and broadcasting, play reading,\nand as actor in dramatic shows.\nJune - 6 Desires position as producer, film director, or assistant program\ndirector. Has had experience and training in television. Former college in¬\nstructor. Past experience in theatre groups as stage manager, working in\nspecial effects and set construction.\nJune - 7 Wants position as film director, office manager, or TV and/or\nfilm technican. Has had extensive training in both television and motion pic¬\ntures. Presently employed by a film producing company.\nJune - 8 Producer-director with approximately 5 years experience looking for\nnew position. Most of her experience has been in educational work. Has help¬\ned prepare briefs pertinent to securing a new channel for TV."
}