{
  "id": "d237-138",
  "text": "NAEB PLACEI.I3NT SERVICE\nThe new application blanks for the HAEB Placenent Service\nare off the press, and your cooperation in filling them out and\nreturning them promptly will be appreciated* Anyone wishing to re¬\ngister with us, contact Don Walker, 14 Gregory Hall, Urbana, Ill*\nThe proper forms will be sent to you by return mail*\nPOSITION.OPEN - Ninescope operator needed for closed circuit lab¬\noratory in midwest. Lust be competent so far as the technical in¬\nformation is required to operate the equipment and must also have a\nfeeling for what is required to wake good kinescopes.\nAugust 1 - A former student of the School of Radio Technique in\nNew York City would like to be employed f or camera and audio work,\nlias been schooled in both technical and production end of television*,\nAugust 2 - Would prefer job as announcer. Has BS from DePaul Uni¬\nversity, and has taken extra work in radio and television announ¬\ncing at Northwestern University.\nAugust 3 - Former music teacher with experience in chora1-TV shows\nwould like opportunity to form own choral unit of college age in¬\ndividuals with the express purpose of doing a weekly choral-TV\nbroadcast. Also interested in musical directorship or advisor for\nstation, planning and performing music in all forms in educational\nbroadcasting.\nAugust 4 - Would like job as program manager0 As head of TV pro¬\nduction branch, supervised production of live broadcast, closed cir¬\ncuit, and kinescope recorded programs. Previously, as TV coordin¬\nator, coordinated activities of psychologist, TV personnel, and\nothers involved in instructional TV research* Originated ideas\nfor and produced about half of the program of a »feature story” on\nTV. Specialized in subject matter concerning physical and social\nsciences. As a TV director, directed TV film commercials and live\ndaytime TV program for this package production organization.\nAugust 5 - Has master’s degree in Education and Television. Prefers\njob as producer, teacher of television production, director, writer\nor a combination of these. In addition'to his course work in TV,\nwhich covers all phases of production and techniques and sociology\nof mass communicat ions media, he was a graduate assistant to an\nAudio-Visual Center. Work there was assisting in the teaching of\ncourses in audio visual instruction on the graduate and undergrad¬\nuate levels. Has also had four years experience in Hollywood^as\nactor and production assistant and four years in the Army Signal\nCorps as cameraman, unit manager and director.\nAugust 1, 1954\nNAE3\nEducational Television and Radio Placement Service\nRoom 14 - Gregory Hall - Urbana, Illinois\nDon Walker (in charge)"
}