{
  "id": "d237-139",
  "text": "NAE3 PLACEMENT SERVICE\nAnyone wishing to register with the MAEB Placement Service should\nwrite to Hr. Robert E. Underwood, Jr., 14 Gregory Hall, Urbana,\nIllinois, and the proper forms will be forwarded to you by return\nmail. Also, any inquiries concerning applicants listed below should\nbe addressed to Ur. Underwood.\nThe following descriptions of personnel listed with us are written\nby the applicants themselves, and are taken directly from the\nPlacement Service forms.\nMarch 1. PRODUCTION MANAGER-DIRECTOR. Six years of TV experience\nin all phases of production. Network station. Good references.\n24 years old. Married.\nMarch 2. T.V. technician, 14 months experience including schooling,\naudio, cameras, lighting. Also am motion picture projectionist.\nStudying for my first class license. Are you willing to take a\nchance?\nMarch 3. Successful teacher and radio man is interested in associ¬\nating with educational television. Six years experience in radio\nand ten years in teaching speech have given me the experience for\nwhich I hope you are looking. Prefer South or Southwest for reasons\nof climate.\nMarch 4. College teacher of radio, television, and theatre desires\nposition in Radio or Television. Interested in teaching, station\nmanagement, programming, producing, directing. Seven years teach¬\ning experience and experience with WQED, Metropolitan Pittsburgh\nTelevision Station. Holds M.A. in Theatre-Radio from Northwestern\nUniversity. Available for employment June, 1955.\nMarch 5. Young ambitious man, with a Radio Telephone License, desires\na position with your T.V. Studio. Diversified background in Pro¬\nduction, Staging and Lighting Techniques, also specialized in camera\nand control room operation. AVAILABLE IMMEDIATELY. Salary open.\nMarch 6. College graduate with 3.A. degree in radio-speech from\nlarge midwestern university interested in music programming, par¬\nticularly that of classical music, in college or university station.\nPrevious experience with university station in all phases of pro¬\nduction and presentation. Good knowledge of all types of music.\nWill accept additional duties relating to station operation if neces¬\nsary. Married, will relocate. Desire salary range of $4,200-\n$5,200 per annum.\nMarch 7. Services of qualified young man available immediately.\nM.A. degree in TV Production, plus two years in Commercial Tele¬\nvision. Can do anything from directing shows to managing a station,\nincluding teaching. References give good recommendation."
}