{
  "id": "d237-142",
  "text": "NAEB PLACEMENT SERVICE\nApril 1. Young (24), married, qualified studio technical, experi¬\nenced in all phases of audio, video TV. Able to function as a\n\"package TV technician\" employing multi-job knowledge to success¬\nful station operation. Conscientious, sincere, loyal. A definite\nemployer asset. Will gladly relocate for right position.\nApril 2. 10 Years experience and training directly related to\nTelevision. Position desired in Television Production. Profes¬\nsional Actor, Stage Manager. Experience in RCA and Dumont equipped\nstudios as Floormanager, Cameraman, Boom-man, Director and Producer\n26; married; veteran; creative and alert. Goal: Producer-Director\nApril 3. Wishes a job in educational television. Advanced degree\nin physics. Age-32. Has had considerable experience with radio\nand television programs with a science format. Among the shows he\nhas done are: \"Science in Review\" over WKEB, Portsmouth, N.H.;\n\"Sound of Things\" now being created; \"Science Sketches\" over WBZ-\nTV, Boston (awarded the 1953 citation of the Massachusetts Society\nof Professional Engineers); \"Today\" several guest spots on this\nNBC show; \"The Menace\" over WBZ-TV, Boston.\nApril 4. Position wanted in ETV production and/or teaching.\nApplicant offers four years of commercial and professional radio\nexperience as announcer, salesman, promotion director and program\ndirector. Also HA in TV and radio, State University of Iowa, and\nPh.D. candidate in TV and radio, University of Michigan (all work\ncompleted except thesis). Currently an instructor in radio and\nTV. 28 years old, married, one child. Available for full-time\nemployment in June, 1955.\nApril 5. Just completed an extensive course (Production) at the\nTelevision Workshop of N.Y. City where I assumed position of\nDirector, Assistant Director and Program Assistant, writer and\nTalent; in off circuit production for invited audiences. Three\nyears theatre experience both in technical and acting fields.\nSeek position as Program Assistant, Asst. Director or Script Girl.\nApril 6. ETV and EFM STATION MANAGERS and SPEECH DEPARTMENT\nCHAIRMEN PLEASE NOTE: Experienced teacher-producer wants to help\nyou with programming, production, and/or teaching of radio-tele-\nvision. Ph.D. Presently employed as a university speech-radio\nteacher and Director of Radio-TV (includes management of an educa¬\ntional FM radio station). Experience includes 4 years professional\ntheater and radio work, and 5 years teaching and production in\neducational radio-TV. Complete background information on request.\nApril 7. Versatile, creative industrious young man with experience\nat the network level and relevent courses at Columbia University\nwishes to help an educational television station with its pro¬\nduction problems."
}