{
  "id": "d237-145",
  "text": "PLACEMENT—3\nDec. 20. Young man, 27, seeks position as writer, director and/or producer of ETV\nprograms. Three college degrees, widely traveled, four years college teaching\n(drama) experience. Knowledge and practical experience of TV production technique.\nDec. 21. You want a practical administrator and broadcaster who knows the big pic¬\nture as well as the details from the inside of commercial broadcasting. You need\nthe man who wrote this.\nDec. 22. Motion picture cameraman: 6 years intensive skill and know-how related to\n16-35 mm cinematography, recording (optical, tape, disk), editing, laboratory pro¬\ncessing practice (black and white); have Navy High Speed photography experience;\nmember SMPTE; self-reliant; inventive; relocate if required; desires challenging,\nresponsible position where technical knowledge and ingenuity will be fully utilized.\nDec. 23. Man who has taught 14 years, experienced in: grades 4-12, school adminis¬\ntration, coaching all athletics, dramatics, rural and urban living, railroader,\nmerchant seaman; B.S. in Elementary Education, M.A. in Secondary Education, 63\nquarter hours advanced graduate study beyond M.A.: 6 weeks, TV institute, 2 weeks,\nradio-TV workshop; desires work in educational TV or radio, in college or educa¬\ntional station.\nDec. 24. Young woman with B.A. in theatre and two years experience in radio and TV\nproduction, audience building, and promotion, will complete M.A. in Speech (center¬\ning in Radio and TV) in February, 1955. Has produced two adult education TV series\nand has assisted on many others. Has also produced radio programs and series\ncentered around fine music, literature, and sociology. Location not important.\nPrefers creative and responsible position.\n^ Dec. 25. Young woman teacher; B.A., Radcliffe; M.A., Columbia; experienced junior-\nsenior high school, junior college, adult education; English, social studies, science\nguidance, dramatics, radio writing-production, school publications, PTA and commun¬\nity activities; member, professional and civic organizations; background travel,\nsocial service, advertising, magazines; radio-TV reviews, public relations. Would\nlike position writer/director; experienced radio-TV writing, production, announcing,\ntape editing; numerous contacts, educational and commercial fields. Willing to\nteach part-time, any level; salary secondary, living-working conditions and\natmosphere.\nDec. 26. Head, communications division or department; University or' College, or\npublic school system, to direct radio, motion picture and television operations and\nresearch and curriculum. Age 36, Ph.D. in communications and industrial psychology,\nStanford University; Sigma Xi. Six years of audio-visual research and research su¬\npervision, with major publications. Professional and technical experience in com¬\nmercial and government radio, motion pictures and television. Extensive staff and\nmanagement experience in government and academic communications research and oper¬\nating organizations. Formerly Director of Radio Workshop and Audio-Visual Aids pro¬\ngram, major western university. Able to undertake the development of a new academic\ndivision to integrate the arts and sciences involved in mass communications, offer¬\ning applied under-graduate degrees, as well as research Ph.D. Presently serving\nas Executive Assistant, Office of the Director, major governmental research program\na t a university.\nDec. 27. Man with extensive experience and training as teacher, school-administrator,\nand with one year of administrative experience in a newly organized commercial tele¬\nvision station desires position with an educational station as supervisor of live\nprogramming. Television experience includes planning and supervision of building a\ncombined transmitter and studio building; organizing and producing a college tele¬\ncourse for credit; producing and conducting an informational farm program; organiz¬\ning music and dramatic shows; supplying and coordinating public service, film and\nslide spots, and live shows; sales work; and continuity writing."
}