{
  "id": "d237-147",
  "text": "NAEB PLACEMENT SERVICE\nAnyone wishing to register with the NAEB Placement Service should\nwrite to Mr. Robert E. Underwood, Jr., 14 Gregory Hall, Urbana,\nIllinois, and the proper forms will be forwarded to you by return\nmail. Also, any inquires concerning applicants listed below\nshould be addressed to Mr. Underwood.\nThe following descriptions of personnel listed with us. are written\nby the applicants themselves, and are taken directly from the\nPlacement Service forms.\nFeb. 1. Young man, 29, seeks job with educational station. Back¬\nground, education, and experience qualify him for Television Direct¬\ning. He is at present in charge of St. Louis* major television\nprogram, the Laclede Little Symphony - a weekly program utilizing\nSt. Louis Symphony musicians, national concert artists, and local\nsingers, actors and dancers. He also teaches Radio and Television\nProduction and directs plays at Webster College, Webster Groves,\nMissouri. He holds an M.A. in Drama from the University of Wash¬\nington, Seattle and a B.A. in English from Washington University, St.\nLouis. At this latter institution he completed a year of graduate\nwork in both English and Drama. Below, is briefly listed his\nexperience in radio, television, and film work.\nRADIO: Six years experience: KFUO, St. Louis - Feature Commen¬\ntator; KMOX-CBS, Radio Writer; KJR-ABC, Continuity Editor and\nAnnouncer. At D*Arcy Advertising Company, St. Louis, he wrote a\ndaily quarter-hour program. His scripts won two national awards,\na second and third place in 1953 and 1954 Public Utility Better Copy\nContest, the oldest such competition in the United States.\nTELEVISION: Three years experience: Former writer, floor producer,\nand assistant director in the Laclede Little Symphony Television\nUnit. Now-is Producer* in Charge of this unit. Duties require him\nto stage weekly half-hour production, edit scripts from three writers,\nwrite scripts, hire talent, design sets and keep books of running\nproduction costs. This program has won local awards, and will be\nentered in national competition in 1955. Kinescope is available.\nFILM: Directed and wrote forty-two minute Shoe Training Film for\nInternational Shoe Company, Friedman Shelby Division. Film is in\ncolor and features twenty actors. Film was shot in six days. This\nfilm presentation is a **first” in the shoe industry.\nFeb. 2. Engineer - married - Korean vet. Experienced in all studio\noperation, remotes. TVW of New York graduate. Hard worker, willing\nto relocate east or mid-west states. Excellent references. Have car,\nFeb. 3. Capable Television Workshop Graduate, staging and dancing\nbackground, desires camera, film room, studio technician or pro¬\nduction position. Reliable, single veteran. Salary secondary.\nFeb. 4. Young man, vet, M.S. degree seeks opportunity in the field\nof education or associated fields. Willing to learn or tackle\nany job.\n(OVER)"
}