{
  "id": "d237-154",
  "text": "2\nTHE PLACEMENT OFFICER SHALL DETERMINE WHAT FORMS ARE NECESSARY FOR THE\nOPERATION OF THE PLACEMENT SERVICE.\nSTATEMENT\nThe purpose of the Placement Forms is to provide for employers and the\nPlacement Officer specific information concerning the talents, backgrounds,\nand aspirations of applicants for employment in educational television\nand radio; and otherwise to aid the Placement Officer in the operation\nof the Placement Service.\nThe forms listed below were printed in June, 1954 after considerable\nresearch by the then incumbent Placement Officer. Said officer carried\non correspondence with and made personal visits to several responsible\npersonnel agencies where he received full cooperation and assistance\nin devising the Placement Forms.\nAt present, the following forms are in use by the Placement Service:\n(Copies of these forms may be found in Appendix A.)\nA. FORM ONE\nThis form includes the full name and address of the applicant,\nplus personal data about him, such as place and date of birth,\nmarital status, physical condition and so forth. Furthermore,\nspace is provided for an application photo not to exceed two\nby three inches (2W X 3W)«\nFive copies of this form are sent to each applicant. Three\nthousand copies of this form were printed.\nB. FORM TWO\nThis form covers all non-professional activities of the applicant,\nsuch as awards, civic activities, special abilities, travel,\nhobbies, sports actively engaged in and so forth.\nFive copies of this form are sent to each applicant. Three\nthousand copies of this form were printed.\nC. FORM THREE\nThis form covers the formal educational background and the\nteaching record of the applicant.\nFive copies of this form are sent to each applicant. Three\nthousand copies of this form were printed.\nD. FORM FOUR\nThis form covers the applicants formal educational preparation\nfor broadcasting and the education courses he has taken.\nFive copies of this form are sent to each applicant. Three\nthousand copies of this form were printed."
}