{
  "id": "d237-168",
  "text": "PLACEMENT SERVICE, MAY, 1955: PAGE 3\nleading university. Accustomed to dealing with high level personnel at both\nnational and international, as well as diplomatic levels. Audio-visual special¬\nist, film and documentary filming and writing experience. Background in profes¬\nsional and little theater directing and acting, and have taught remedial speech\nand operated children’s theatre. Widely travelled in Middle East, Far East, and\nEurope. Speak, read and write French, German and Japanese.\nMay 18. Are extra hands needed in your station’s operation? Do you want a person\nwho is creative, capable, energetic, enthusiastic, loyal and willing to work?\nA person who is experienced and well trained in all aspects of broadcasting—\nprogram planning and building, radio and television writing, production, acting,\nannouncing, audience measurement and savoir faire.\nMay 19. TV Workshop Graduate, Age 23, seeking apprentice position with TV station.\nAble to work camera, dolly, cables, lighting, etc. Salary secondary. Will\ntravel if necessary.\nMay 20. Good educational background - Masters in Bus. Admin. - Experience in\nteaching, nursing, restaurant management, engineering offices, radio & TV - ex-\nWAVE. Likes to work with people. Has had quite extensive travel. Appreciates\npossibilities of audio-visual work.\nMay 21. Just completed an extensive Production course at The Television Workshop\nof N. Y. City where I assumed position of Director, Assistant Director and Pro¬\ngram Assistant, writer and Talent in off circuit production for invited audiences.\nThree years theatre experience both in technical and acting fields. Seek position\nas Program Assistant, Assistant Director, or Script Girl.\nMay 22. Producer, director, writer. Professional and educational experience.\nWorkshop founder and coordinator. University lecturer. Live TV, stage, film\nexperience. Offer must be above 6000. Short term production or counselling\nassignments.,\nMay 23. Woman desires position utilizing background and training in Education\nand Television. Taught English in secondary schools for 5 years. Recently\ncompleted graduate course of study in Radio-Television with M. S. degree. Single,\n36, references.\nMay 24. Engineer - married - Korean vet. Experienced in all studio operation,\nremotes. TVW of New York graduate; hard worker, willing to relocate east or mid¬\nwest states. Excellent references. Have car.\nMay 25. TV Studio Technician, all phases technical and production, specially\ntrained with experience in educational TV. 29 years old, married, seeks position\nin Northern New Jersey or New York City area.\nMay 26. UNIV. GRAD. ’54, trained for RADIO-TV. Rich experience in Singing,\nDirecting, Teaching. Some Journalism. Seeks work on Program, Commercials, Con¬\ntinuity, Production, etc.\nMay 27. Capable Television Workshop Graduate, staging and dancing background;\ndesires cameraman, film room, studio technician or production position. Reliable\nsingle veteran. Salary secondary.\nMay 28. Serious young man, married, veteran, working for MA in education would\nlike start in Educational TV or Radio; trainee position or comparable in the\nNortheast."
}