{
  "id": "d237-169",
  "text": "PLACEMENT SERVICE, MAY, 1955,* PAGE 4\nMay 29. RADIO BROADCASTING SCHOOL GRADUATE DESIRES RADIO POSITION. HAS HAD\nEXPERIENCE IN ANNOUNCING, WRITING, AND NEWSCASTS. CAN ALSO WORK THE BOARD.\nMay 30. Services of qualified young man available immediately. M.A. degree in\nTV Production, plus two years in Commercial Television. Can do anything from\ndirecting shows to managing a station, including teaching. References give\ngood recommendation.\nMay 31. Multi-faceted television program production manager-director-designer-\nwriter-performer-administrator desires opportunity to show he usually knows what\nto do and can do it himself, if need be.\nMay 32. Young man, 34, M.A. in Sociology-Anthropology, desires position as tele¬\nvision producer, associate producer, or assistant producer. Experience includes\nwriting, television performing, television workshop, teaching, group work.\nMay 33. Former Head of TV Research & Planning at major university desires position\nin educational programming. Ten years professional experience in writing, direct-\ning, producing motion pictures, TV, radio, both coasts and overseas.\nMay 34. Intelligent, original young woman with extensive artistic and scientific\nbackground, interested in educational research, broadcasting or production. Will¬\ning and able to begin at secretarial level.\nMay 35. Writer, 27, seeking radio-TV post. M.A. Worked with BBC for two years;\nhas contributed to U.S., British periodicals: good news background.\nMay 36. I am interested in getting located in the creative fields of television.\nMy certificate from the Summer Institute of Radio and Television of Barnard Col¬\nlege and the National Broadcasting Company attests to the fact that I am a per¬\nson of ideas. I can be of valuable service to any producer.\nMay 37. School of Radio and Television Technique, three (3) months extensive\ntraining, specializing in technical operations. Emphasized camera work (RCA and\nDumont equipment). But wide experience in Audio, Video, Boom, Switching, 16 MM\nProjectors, Rear Screen Projectors, Slide Projector and as Technical Director.\nMay 38. Position desired - Production Manager, Program Director or Producer-\nDirector. Bachelor of Arts degree - Major in Speech and Theatre Arts. Over\nfour and one-half years experience in radio and television. Radio - Staff an¬\nnouncer, Sports Director, Program Director. Television - Staff announcer, Pro¬\nducer-Director, Continuity Director. Prefer position in Northeast United States.\nMay 39. Position wanted in ETV production and/or teaching. Applicant offers four\nyears of commercial and professional radio experience as announcer, salesman,\npromotion director and program director. Also MA in TV and radio, State Univer¬\nsity of Iowa, and PhD candidate in TV and radio, University of Michigan (all\nwork completed except thesis). Currently an instructor in radio and TV. 28\nyeai'S old, married, one child. Available for full-time employment in June, *55*\nMay 40. Young man, 29, seeks job with educational station. Background, education,\nand experience qualify him for Television Directing. He is at present in charge\nof St. Louis* major television program, the Laclede Little Symphony - a weekly\nprogram utilizing St. Louis Symphony musicians, national concert artists, and\nlocal singers, actors and dancers. He also teaches Radio and Television Production\nand directs plays at Webster College, Webster Groves, Missouri. He holds an"
}