{
  "id": "d237-170",
  "text": "PLACEMENT SERVICE, MAY, 1955: PAGE 5\nMA in Drama from the University of Washington, Seattle and a BA in English from\nWashington University, St. Louis. At this latter institution he completed a\nyear of graduate work in both English and Drama. Six years experience in Radio\nas Feature Commentator, Writer, Continuity Director and Announcer. Three years\nexperience in Television as Writer, Floor Producer, Assistant Director and now\nProducer in Charge. Directed forty-two minute training film, a first in the\nshoe industry.\nMay 41* Experienced writer, producer, commentator, 25, well known for own N. Y.\nand network programs, seeks educational broadcasting post in West or upper Hew\nEngland. Widely published writer on musical subjects and record reviews; thor¬\noughly conversant with all phases of programming, writing, production.\nMay 42. College graduate with B.A. degree in radio-speech from large midwestern\nuniversity interested in music programming, particularly that of classical music,\nin college or university station. Previous experience with university station\nin all phases of production and presentation. Good knowledge of all types of\nmusic. Will accept additional duties relating to station operation if necessary.\nMarried, will relocate. Desire salary range of $4,200-$5,000 per annum.\nMay 43. PRODUCTION COORDINATOR IN ADULT ED. AREA, EDUCATIONAL TEIEVISI0N; eight\nyears classroom teaching; ten years film production, commercial and educational,\nas writer, director,supervisor; supervision of ”live,f TV production for national\norganization, kinescoped for national distribution, ,\nMay 44* Experienced writer, producer, director of film for theater and TV. A.B.,\nM.A., Secondary Certificate, course work completed toward PhD in Literature.\nBroad background in film production as freelance and for commercial producer.\nSeven years experience as college instructor of literature, journalism, writing,\npublications. Married, veteran, two children. Highest references from industry\nand education.\nMay 45. Stage Producer/birector with 350 hours of Producing and Directing every\ntype of television program. Emphasis on creative productions at low-level bud¬\nget. Stage Manager of the Off-Broadway production, ”The Chair.”\nMay 46. Now employed in commercial radio-television station, desire to enter\neducational radio-television. Wide experience at several Eastern radio stations,\nincluding two 50kw stations, and at two television stations, one VHF, one UHF.\nHarvard S.B. and an A.M. in English. Taught English eight years, six in college,\ntwo in prep school. Free-lance writing nationally and regionally. Would be\ngood supervising students in college station. Married, 34. Need at least $5,000.\nMay 47. Man with extensive experience and training as a teacher, school adminis¬\ntrator and with one year of administrative experience in a newly organized\ncommercial television station desires position with, either a commercial station\nas director of education, informational or public service programming; or with an\neducational station as supervisor of live programming. Television experience\nincludes planning and supervision of building a combined transmitter and studio\nbuilding; organizing and producing a college tele-course for credit; producing\nand conducting an informational farm program; organizing music and dramatic\nshows; supplying and coordinating public service, film and slide spots, and live\nshows; sales work; and continuity writing.\nMay 48. Major network writer-director-producer, specializing in music, public\nservice and educational programs, desires responsible position as program"
}