{
  "id": "d237-173",
  "text": "PLACEMENT SERVICE, MAY, 1955: PAGE 8\nyears I.have worked closely with programming, writing, and performing on radio\nat Station WKOY in Bluefield, W. Va. This association includes the preparation\nof continuity for both classical and popular concert musical programs, the nar¬\nration of such specialised programs on the air, and performance of daily women’s\nshows, interviews, and on-the-spot broadcasts. I, therefore, offer to prospective\nemployers a thoroughly grounded and well-rounded experience in both aural and\nvisual communication, with the added advantage of sound academic training, and\nsustained teaching experience. I believe I could do effective, creative work in\neducational television or radio broadcasting. In any case, I am extremely\nanxious to have an opportunity to prove both my ability and my willingness to\nforge ahead in the right job!\nMay 68. HOLLYWOOD TV-HAD 10 PRODUCER-WRITER-M.C. - DIRECTOR OF MORE THAN 1000\nEDUCATIONAL VIDEO-RADIO PROGRAMS SEEKS AFFILIATION WITH EDUCATIONAL STATION IN\nSIMILAR OR OTHER CAPACITY. Also interested in affiliation with educational in¬\nstitution as radio-tv producer or radio-tv station which seeks educational or\npublic service program director.\nMay 69. College teacher of radio, television, and theatre desires position in\nRadio or Television. Interested in teaching, station management, programming,\nproducing, directing. Seven years teaching experience and experience with WQED,\nMetropolitan Pittsburgh Educational Television*Station. Holds M.A. in Theatre-\nRadio from Northwestern University. Available for employment June, 1955.\nMay 70. T.V. technician, 14 months experience including schooling. Audio, cameras,\nlighting. Also am motion picture projectionist. Studying for my first class\nlicense. References, Are you willing to take a chance?\nMay 71. Experienced manager and production director in both commercial and ed¬\nucational television desires position with new educational TV station or with\ncollege or university radio and television department. Background includes 20\nyears of experience in the field. Undergraduate degree in electronics; doctorate\nin education. Qualified to teach all phases of radio and TV production and\nmanagement, as well as graduate courses in communications and communications\nresearch. Metropolitan area preferred. Salary should be commensurate with that\noffered for corresponding responsibility in commercial TV. Presently employed\nin large university.\nMay 72. Successful teacher and radio man is interested in associating with\neducational television. Six years experience in radio and ten years in teaching\nspeech have given me the experience for which I hope you are looking. Prefer\nSouth or Southwest for reasons of climate.\nMay 73.10 Years experience and training directly and related to Television.\nPosition desired in Television Production. Professional Actor, Stage Manager.\nExperience in RCA and DuMont equipped studios as Floormanager, Cameraman, Boom-\nman, Director and Producer. 26;married; veteran; creative and alert. Goal;\nProducer-Director.\nMay 74. Producer-Director. At present is assistant producer ten hours live air\ntime a week on educational station. Four years motion picture production exper¬\nience. M.A. in education and Television. Studying for PhD. Will locate any¬\nwhere. Salary open.\nMay 75. PRODUCTION MANAGER - DIRECTOR. 6 years TV experience in all phases of\nproduction. Network station. Good references. 24 years old. Married."
}