{
  "id": "d237-174",
  "text": "PLACEMENT SERVICE, MAY, 1955; Page 9\nMay 76. Versatile, creative, industrious young man with experience at the net¬\nwork level and relevent courses at Columbia University wishes to help an educa¬\ntional television station with its production problems.\nMay 77. School of Radio Technique graduate, thoroughly capable all phases TV\nProduction, Programming with wide cultural background in Art, Music, theater\nand literature desires opportunity to offer his talents as Floor Manager, Pro¬\ngram Assistant and Studio Technician to your station. Recently Production\nAssistant for nation-wide major network program.\nMay 78. Young man, 27, single; experience in commercial FM “good music\" station\nas.announcer, music commentator and member of program dept.; B.S. in Political\nScience, M.A. in Music; high scholarship; editor, college literary magazine;\nconcert experience as pianist and composer; excellent references. Will consider\npart-time teaching in connection with position.\nMay 79. WANTED - TV Production, Cameraman. Production, Direction, Control Room\nOperation, Cameraman, etc. Will travel, relocate. 25; references on request.\nMay 80. Young man, vet., M.S. degree seeks opportunity in the field of education\nor associated field. Willing to learn or tackle any job.\nMay 81. Imaginate, personable, college graduate with heavy administrative sales\nand broadcasting experience ready to cooperate with community programming. Please\nadvise your particulars.\nMay 82. Man wishes work in educational television. During semester 1953-54,\nassistant producer of The Living Blackboard series, televised by WPIX, New York\nunder the auspices of the New York City Board of Education. His article, \"An\nEducational TV Network,\" appeared in the August, 1954 The School Executive.\nAdditional experience: teaching, book jacket design, editing. Would accept,\npart time teaching in connection with job. B.S. English, Columbia University.\nM.A. Hunter College. Working toward Ph.D. at New York University. Radio train¬\ning at Hunter College. TV training at the American Theatre Wing,\nMay 83..Producer-Director position desired by Technical Director of large\ncommercial television station. Background includes work as television cameraman\nwith New York network station, training in the production of documentary and\neducational films, and a liberal arts degree from a top university.\nMay 84. Young man, 27, seeks position as writer, director and/or producer of\neducational TV programs. Three college degrees, widely traveled, four years\ncollege teaching (drama) experience. Knowledge and practical experience of TV\nproduction techniques.\nMay.85. You want a practical administrator and broadcaster who knows the big\npicture as well as the details from the inside of commercial broadcasting. You\nneed the man who wrote this.\nMay 86, I am a graduate of the Television Workshop of New York. I took a 480\nhour course in Studio Operations, I graduated on August 25, 1954, and I am\napplying for a job as a Television Studio Technician. I am qualified to work as\na cameraman, video operator, Mike boom operator, and audio, turntables, and\nfloor manager. Studied remote operations, lighting, special effects, scenic\nlabs, and film labs; also 60 hours of theory and terminology."
}