{
  "id": "d237-175",
  "text": "PLACEMENT SERVICE, MAY, 1955s PAGE 10\nMay 87. Man who has taught 14 years, experienced in: grades 4-12, school admin¬\nistration, coaching all athletics, dramatics, rural and urban living, railroader,\nmerchant seaman. B.S. in Elementary Education, M.A. in Secondary Education, 63\nquarter hours advanced graduate study beyond M.A. 6 weeks TV Institute, 2 weeks\nRadio-TV Workshop. Desires work in Educational TV or Radio, in college or educa¬\ntional station.\nMay 88. Mature executive and educator interested in development job in planning\nand producing educational TV programs which feature current public affairs\nanalysis and comment, and which capitalize on the potentialities of the visual\nmedium. Has developed written proposals and sample formats for such programs•\nNo formal training or paid work experience in broadcasting, but broad executive\nexperience in related fields; 1) Experience in analyzing public events and\npresenting their meaning in simple and concise form. 2) Experience and experi¬\nmentation in making combined verbal and visual presentations (”briefings”) for\nlaymen, including conceiving and designing special visual materials. 3) Familiar¬\nity with current trends in informal adult education. 4) Discussions on news and\npublic affairs program problems with network commentators and executives.\nMay 89. MOTION PICTURE CAMERAMAN: 6 years intensive skill and know-how related\nto 16-35mm cinematography, recording (optical, tape, disk), editing, laboratory\nprocessing practice (black and white); have Navy High Speed Photography experiencej\nmember SMPTE; self-reliant; inventive; relocate if required. Desires challenging\nresponsible position where technical knowledge and ingenuity will be fully used.\nMay 90. Lucky combinations do bring success] Here is the happy combination you\nmay be looking for...7 years teaching, over a year as a commercial radio announcer,\nover 76 TV programs produced in education over a commercial station. Can you use\nmy services as a producer or consultant during the simmer months?\nMay 91. Young (24) married, qualified studio technical, experienced in all phases\nof audio, video TV. Able to function as a ”package TV technician” employing\nmulti-job knowledge to successful station operation. Conscientious, sincere,\nloyal, A definite employer asset. Will gladly relocate for right position.\nMay 92. Position wanted in Educational TV for woman, 29; B.A., Masters Degree\nin Art, three years teaching experience, Art, Grades 1-12; business experience in\nJournalism, Mural Painting, Sales and Market Research. Interested in permanent\nwork with opportunities for advancement.\nMay 93. Young woman teacher: B.A. Radcliffe; M.A, Columbia; experienced junior-\nsenior high school, junior college, adult education; English, Social Studies,\nScience, guidance, dramatics, radio writing-production, school publications, PTA\nand community activities; member professional and civic organizations; background\ntravel, social.service, advertising, magazines, radio-TV reviews, public relations.\nWould like position writer/director; experienced radio-television writing, pro¬\nduction, announcing, tape editing; numerous contacts educational and commercial\nfields. Willing to teach part-time, any level. Salary secondary, living condi¬\ntions and atmosphere.\nMay 94% Head, Communications Division or Department, University or College, or\npublic school system, to direct radio, motion picture and television operations\nand research and curriculum. Age 36, Ph. D. in communications and industrial\npsychology, Stanford University; Sigma XI. Six years of audio-visual research\nand research supervision, with major publications. Professional and technical\nexperience in commercial and government radio, motion pictures and television."
}