{
  "id": "d237-177",
  "text": "REPORT OF THE NAEB PLACEMENT SERVICE\nOctober 1, 1955\nSince the last NAEB Convention, the Placement Service has:\n1. Increased its number of placements nine hundred per cent.\nThis includes actual placements plus those in which we played an instru¬\nmental role. Many of the positions involved were of high responsibility,\nsuch as Station Manager, Production Head, Producer-Director and so forth.\nWe feel educational broadcasting has benefited from gaining these talents\nthrough our efforts.\n2. Improved its relations with employers as expressed by their increased\nconfidence and interest in and cooperation with the Placement Service.\nMore employers are now referring their personnel needs to us, as witnessed\nby over one hundred requests for personnel received so far. Our files\ncontain many letters of commendation expressing confidence in us and urging\nus to continue our \"valuable service.\"\n3. Directly and indirectly improved its services to employers and employee\ncandidates through readjustment of methods of operation resulting in\nincreased efficiency.\nA vastly improved, convenient system of reporting vacancies is now in the\nplanning stage, and more information on it will be forthcoming soon. Cer¬\ntain changes in procedures here have benefited employers and candidates\nthrough increased efficiency on our part.\n4. Increased its file of applicants and developed new standards of screening\napplicants with the result that only well qualified personnel are now\nregistering with us.\nWe now have complete files on over one hundred twenty-five \"active\" appli¬\ncants, plus approximately two hundred pending or \"inactive\" requests for\nregistration. In screening, our concentration is on those personnel\nwith degrees in radio and television plus actual experience in the field.\nWe feel that educational stations should be staffed with well educated,\nfully trained and experienced personnel. It is our purpose to obtain such\npersonnel for them.\nRespectfully submitted by:\n10/14/55 jy\nRobert E. Underwood, Jr,\nPlacement Officer"
}