{
  "id": "d237-42",
  "text": "Box 2002\nUniversity, Alabama\nHay 22, 19$h\nMr. Don Walker, Director\nNAEB Placement Service\n1U GregoryHEll\nUniversity of Illinois\nUrbana, Illinois\nDear Don*\nI was in conference with Dr. J.W. Letson, Superintendent of Education,\nBessemer, Alabama and with Dr. Frazer Banks, Superintendent of Schools,\nRirmineham Alabama yesterday. Both expressed interest in securing\npersons of’outstanding ability in television fn-ogramming and productaon\nto add to their faculties next fall. These jobs will pay_five to six\nthousand a year* The job in Birmingham will be an over-all program\ndirector for the system who will have perhaps two people or more work-\ning in production under him. The Bessemer job will be the full res\npossibility of one man. In both cases programs will involve primarily\npublic schools but in part also general aault programming.\nNeither place will have their own studios but will make use of the\ncommercial studios in Birmingham for at least a year. Programs P\nin bo+h olaces will be broadcast on both of the educational television\nstations operated by the State TV Commission, channel 10 in Birmingham\nand channel 7 on Mt. Cheaha*\nI suggest that you contact both of these gentlemen and offer our services.\nPlease tell them that I suggested that you write.\nWe expect to have our studios completed here by early fall and we too\nwill be programming for the two state stations one or two hours a oay.\nI shall need one technical supervisor, one art and shop ^\none or more production directors. If you have any good leads, P^ase\nsend them along. In the two latter positions, I hope to find easier s\ndegree people with some experience in TV. Unfortunately I shall be\nable to pay only about $U,000.00 a year on a twelve months basis.\nNow that I*ve covered the business part, let me express to you my\nPleasure in having you become a part of the NAEB and wish for you eon-\nsiderable success and personal satisfaction on the job. I oo orwar\nto meeting you when I can find time to get into Urbana.\nSincerely yours.\nGraydon Ausmus\nDirector, Radio & TV Broadcasting Services\nPresident, NAEB"
}