{
  "id": "d237-44",
  "text": "932 Rogers Place\nCincinnati, Ohio\nAugust 28, 1954\nMr. Gray don Ausmus\nNational Association of Educational Broadcasters\n14 Gregory Hall\nUniversity of Illinois\nUrbana, Ill.\nDear Mr. Ausmus:\nMy writing to sound you out about job\nprospects is like coming full circle to an old course.\nI spent a goodly portion of my life in the ivy-walled retreats of\nlearning. I am still a candidate for the Doctorate in Cultural History\nat Columbia University, but I have wandered a long way from the scholar’s\nlife.\nPartly through economic circumstance, partly because I believed it\nwas sensible to try to make a way in the workaday world, I have dabbled\nin all kinds of pursuits - newspapers, radio, book publishing. It was\na school of hard knocks, especially if I dared mention that I had been\ninterested in \"cultural history.\" I procured my present job by avoiding\nmention of such non-essentials and I am now prospering in the TY field.\nBut I would like to use the experience I have gained to fuller advantage.\nI hope you can suggest something for me.\nRight now I am the publicity-promotion man at WCPO-TV, Cincinnati.\nAs a one-man department, I have fared better than any of my numerous\npredecessors, at least as far as lasting the course. I write program pro¬\nmotions, public service copy, publicity releases, work up public service\nprogram ideas, have at least one exchange deal going (with book companies\nand try wherever possible to shape our programming as assistant to our\nprogram manager. Although WCPO-TV is remarkable for the number of \"live\"\nshows it puts on, t'-e quality of these is partially reflected in their\ncommercial instability. In short, I would like to play a part in pro¬\ngramming or in presenting programs visually - far greater than I play\nnow. I don’t want tofi stuck with the chore of selling a station from the\npublic relations viewpoint. I thought you'know where I could find a po¬\nsition requiring something more than mere public relations.\nHere is my background. For three years I worked as a newspaper re¬\nporter in cities like Milwaukee, Buffalo, Washington. I have done free¬\nlance book editing for Houghton Mifflin and Prentice-Hall and worked as\na full-time editor of the Ziff-Davis book section, now deceased. I did\nbook reviews for the Milwaukee Journal and during a year I spent in Paris\nI sent in movie and play reviews to Variety. Then, I was a news editor\nand announcer for a year for WXRT-FM, Chicago, an ill-fated \"classical\nmusic\" operation.\nApart from this, I have my M. A. from Columbia University and have"
}