{
  "id": "d237-69",
  "text": "ANOTHER NAEB SERVICE\nEducational Broadcasters and persons interested in working either in ed¬\nucational radio or TV now have a central office through ivhich to clear their em¬\nployment inquiries* The EDUCATIONAL TELEVISION AND RADIO PLACEMENT SERVICE, a\nfree service made possible by a grant from the Fund for Adult Education, was open¬\ned by the National Association of Educational Broadcasters May 1, 195>[** Don\nWalker, formerly assistant office supervisor of the University of Illinois Health\nService, was named to direct the activities of this newly created department.\nDuring the past month. Walker has been setting up a system for handling\njob inquiries. He is starting cross-reference files for all job inquiries in such\na way that all major job preferences or interests of any one individual will not\nbe overlooked upon the announcement of a new position#\nAll job inquiries received by NAEB for the past year are being checked,\nand a file made for each applicant. The PLACEMENT SERVICE hopes to be able to\nkeep all files up to date. However, this will take cooperation from all pros¬\npective employers and employees in reporting their negotiations.\nThe National Citizens Committee for Educational Television and the Joint\nCommittee on Educational Television have also sent NAEB their job applicant files,\nmaterials are being sent by the Educational Television and Radio Center, and it is\nthe aim of the EDUCATIONAL TELEVISION AND RADIO PLACEMENT SERVICE to be able to\nconsolidate the placement and personnel classification functions at present handl¬\ned by a variety of organizations.\nWalker said that in the near future, through a confidental survey of all\nTV and radio station directors, the PLACEMENT SERVICE will be able to give de¬\nfinite outlines on individual job classifications, education and experience re¬\nquired, salary, and specific duties involved.\nAs outlined in the letter of transmittal for the grant, Martha C. Howard,\nAssistant to the President of the Fund for Adult Education, stated, \"This service\nby the Association will be made generally known both among its member stations and\nothers; and inquiries from all sources, whether NAEB members or not, concerning\npersonnel, will be given full attention.\"\nAccording to Walker, job applications should be addressed to him, at lU\nGregory Hall, Urbana, Illinois, and should include a short descriptive letter,\nplus a data sheet telling of past job experience, education, job preferences in\norder, location preferred, minimum salary expected, and personal data such as age,\nbirthplace, publications, radio and/or TV programs written or produced. Managers\nand directors of stations should also direct letters concerning a vacancy on their\nstaff to Walker at the above address.\nWalker, a University of Illinois graduate, has also had experience in\nsales, accounting and office management, as well as operating his own printing\nbusiness for three years. He is 27 years old, single, and makes his home in\nUrbana, Illinois."
}