{
  "id": "d237-70",
  "text": "POSITIONS WANTED\nTV Project Discontinues Employees\nFull experienced staff from experimental, educational TV station available. Ex¬\ncellent references. TV station forced to close due to failure to receive appro-\npi ations following political election. Staff members available are: COORDINATOR\nOF EXPERIMENTAL TV STATION, former educator, has had producer-director experience;\nTELEVISION SUPERVISOR, former educator, described as \"Outstanding authority in\neducational television in the United States today.\"; ENGINEER, schooled in\nthorough knowledge of DuMont camera equipment, RCA equipment, and can operate and\nmaintain video recorder; SENIOR TELEVISION TECHNICIAN, operator and maintenance of\nvideo equipment; SENIOR TELEVISION TECHNICIAN, was former instructor in radio¬\ntelevision school; TELEVISION TECHNICIAN, excellent references, prefers job in\nCalifornia; TELEVISION TECHNICIAN, trained to operate and maintain video recorder;\nSTUDIO SUPERVISOR, former commercial experience, has experience of being in com-’\nplete charge of all lighting, making and installation of all sets and all proper¬\nties; PRODUCER-DIRECTOR, has worked with teachers and administrators to obtain\nprogram ideas, write television scripts, primary interest in the upper elementary\nlevel; PRODUCER-DIRECTOR, experience same as preceding'producer-director with\nwork primarily at high school level; PRODUCER-DIRECTOR, has had both radio and\ncommercial television experience. Primary work has been with kindergarten-primary\ngrades; PRODUCER-DIRECTOR, former high school English teacher; PRODUCER-DIRECTOR,\nhas had 21 years of teaching experience in the primary grades. Has had previous\nexperience in commercial radio, written scripts and produced programs over radio\nstations. Wants to write scripts and serve as television talent. With one ex¬\nception, everyone mentioned above is under 32 years of age.\nL-l At present actively engaged in commercial television operations. Previous ex¬\nperience includes Operations Coordinator, film and production manager, director of\na state college speech department audio-visual laboratory, instructor in radio con¬\ntrol room operation and stage lighting. Was recently awarded MA degree in tele¬\nvision at Michigan State College. Interested in small college where he could\nhandle radio and television, as well as , dramatics, and general speech if necessary.\nL-2 Presently engaged in the production of educational films and audio-visual aids\nwith a widely-known organization. Also working on Ph.D. in Education at University\nof Southern California. In the past he has made studies of annEparticipated in all\nphases of radio and television, particularly program planning, preparation and pre¬\nsentation. Has had varied associations with the theater, motion pictures, art,\nadvertising, public relations, and allied fields.\nMnJ Has had U80 hours TV production training; an exhaustive study of all phases\nof television program production including: writing, directing, make-up, music,\ncostuming, camera-blocking and technique, film work with special emphasis on pre¬\ncision timing. Also, he has had several years free lance writing for magazines.\nM-l Will receive Ph.D. in Mass Communications in Sept. 19%h» Has had past ex¬\nperience as Manager of educational radio station, assistant director of Televis¬\nion workshop, radio actor, radio music supervisor, radio director and producer,\nradio announcer. Has had considerable university teaching experience. Also has\nheld major positions in educational radio and television organizations. Exper¬\nienced in research procedures."
}