{
  "id": "d237-87",
  "text": "REPORT OF PLACEMENT OFFICER ON DUTIES AND ACTIVITIES\nPOSITION: Placement Officer, Educational Television and Radio Placement\nService, National Association of Educational Broadcasters.\nPURPOSE: To assist any individual who requires aid in obtaining employ¬\nment in educational television and radio; and to assist all\ntelevision and radio broadcasters who require aid in obtaining\nqualified personnel to manage and staff their operations.\nINCUMBENT: Robert E. Underwood, Jr.\nSCOPE: This report shall cover all activities and duties of the Place¬\nment Officer from the official opening of the Placement Service\non May 1, 1954 to March 31, 1955, with particular attention\ngiven to the period dating from October 18, 1954 to March 31,\n1955 inclusive.\nGENERAL STATEMENT\nThe Placement Service of the National Association of Educational Broadcasters\n(NAEB) was officially opened on May 1, 1954. Its establishment was made\npossible by a grant from the Fund for Adult Education, on the advice of the\nJoint Committee on Educational Television, the National Citizens Committee\nfor Educational Television, and the Educational Television and Radio Center.\nThe Placement Service is located in 14 Gregory Hall, Urbana, Illinois where\nthe national headquarters of the National Association of Educational Broad¬\ncasters is located.\nSince May 1, 1954 the Placement Service has made a remarkable growth. The\nbuilding of such a service is often painstakingly slow and extreme patience\nis required. However, the impartial observer must admit that the Placement\nService has succeeded in overcoming many obstacles and is rapidly approaching\nthe point where it can become a great factor in the establishment of new\nand better standards of educational broadcasting in this country.\nThis Report of the Placement Officer on Duties and Activities attempts to\nshow what has been done and what is being done by the Placement Service;\nfurthermore, this report contains recommendations as to what may be done to\nimprove the operation of the Placement Service.\nThe following report is centered around six primary duties of the Placement\nOfficer. Under these headings are gathered all activities having relation\nto them. In this manner the incumbent has attempted to fashion a full,\nobjective report of the progress that has been made.\n1,"
}