{
  "id": "d237-89",
  "text": "3\nE. FORM FIVE\nThis form covers the work and experience record of the applicant\nand the names and addresses of those he wishes to use as references.\nFive copies of this form are sent to each applicant. Three\nthousand copies of this form were printed.\nF. FORM SIX\nThis form covers the radio and television broadcast experience\nof the applicant.\nFive copies of this form are sent to each applicant. Three\nthousand copies of this form were printed.\nG. FORM SEVEN\nThis form is for the applicant to present his views on his quali¬\nfications, aspirations, etc., in terms of a general statement.\nFive copies of this form are sent to each applicant. Three\nthousand copies of this form were printed.\nH. FORM NINE\nThis form contains a rating scale and space for references to\nmake a statement concerning the applicant.\nFive copies of this form are sent to each reference listed by the\napplicant. Fifteen thousand copies of this form were printed.\nUntil recently, only Form Ten was sent to references and five\ncopies of the reference’s statement were typed by this office.\nIt has been decided to mail a complete set of reference forms\nto each reference. This is in line with the method adopted by\nmany personnel agencies and increases the speed and efficiency\nof the operation of the Placement Service.\nI. FORM TEN\nThis form contains all the information required on Form Nine,\nplus additional information such as how long the reference has\nknown the applicant, what the relation of their acquaintance\nwas, and for what type of position the reference believes the\napplicant is best suited. Space is given for the reference to\ngive additional information concerning the applicant, which\ninformation is solely for the use of the Placement Officer in\nmaking recommendations for placement and will not be shown to\nthe employer.\nOne copy of this form (together with five copies of Form Nine)\nis sent to each reference listed by the applicant. Three\nthousand copies of this form were printed."
}