{
  "id": "d237-91",
  "text": "5.\nthis section until notified by the employer whether or not\nhe has been elected. He so indicates the decision of the\nemployer on the reverse side of this section and returns it\nto the Placement Officer. If elected, he notes his duties\nand salary on this section. If he does not apply for the\nposition, the applicant is to return both sections of this\nform to the Placement Officer at once.\nOne thousand copies of this form were printed.\nO. FORM SIXTEEN\nOn this form is listed the employer to whom the applicant has\nbeen referred, the date of the referral, and whether or not\nthe applicant applied, refused, accepted or was not elected\nto the position.\nThese sheets form the Referral File. One sheet is assigned\nto every member of the Active File. Five hundred copies of\nthese forms were printed.\nP. INSTRUCTION SHEET AND GENERAL STATEMENT SHEET\nThese mimeographed pages are mailed to each applicant along with\nthe Placement Forms. Their purpose is to instruct the applicant\nas to the proper method of filling out the Placement Forms, an\nto outline in\" general terms the purposes and procedures of the\nPlacement Service,\nQ. CREDENTIAL COVERS\nOne of these brown B#1 X covers is used to forward the\ncredentials of each applicant to a prospective employer. Each\ncover is sealed shut by a sticker on which is written the.\napplicant’s name. Furthermore, this seal has space wherein.the\nemployer is requested to furnish information in regard to his\nactions concerning the applicant.\nSUMMARY\nOnly minor errors have been found in the Placement Forms since their\nprinting. In order to maintain maximum efficiency, it is.recommended that\nthese errors, however slight, be corrected at the next printing of the\nforms. Special attention should be given to Forms One, Ten, Eleven and\nTwelve.\nAt the present time, there are sufficient forms to handle a maximum of\nfive hundred applicants. Therefore, there is no need to recommend a new\nprinting of the Placement Forms in the near future.\nThe only complaint received thus far concerning the Placement Forms is in\nregard to their length. It is recommended that no immediate steps be.\ntaken to shorten the forms, as it is felt that all requested information\nis essential. Furthermore, these forms have been praised for their\nthoroughness and organization."
}