{
  "id": "d237-93",
  "text": "7,\nService; it is only natural that of the over two hundred-fifty\nmembers of the October 17, 1954 Active File many have found\nemployment elsewhere or have lost their interest in educational\nbroadcasting. The material in this file will be kept for a yet\nto be determined length of time and then destroyed,\nD. REFERRAL FILE\nThis file contains the information of where.and when the cre¬\ndentials of an active applicant were sent, whether an application\nwas made, and whether the recommended applicant was elected to\nor refused the position. Every active applicant has a sheet in\nthis file.\nPrior to October 18, 1954 there was no Referral File. In its\nplace, a sheet carrying the required information was placed in\nthe folder of each active applicant.\nAfter October 18, 1954 it was deemed advisable to create a\nseparate file for this information. This method made it more\nconvenient for the Placement Officer to make his entries and\nto discover quickly the location of each applicant's creden¬\ntials. This new file also lessens the danger of loss of this\ninformation, a frequent occurrence prior to October 18, 1954.\nE. EXPERIENCE FILE\nT his file consists of individual cards, on each of which is\nlisted the work record of an active applicant.\nPrior to October 18, 1954 there was no Experience File.\nT he creation of this file increases the speed of the Placement\nOfficer in making recommendations by telling him at a glance\nhow well qualified an applicant is in terms of past experience.\nPrior to the creation of this file, the Placement Officer was\nrequired to search through all the active applicant's folders\nwhile seeking an applicant with a certain amount of experience.\nThis file also lessens the danger of recommending unqualified\napplicants for open positions.\nF. POSITIONS EESIRED FILE\nThis file lists the positions desired, the desired location\nand the salary range of each active applicant.\nThis file was established soon after the first printing of the\nPlacement Forms. The entries are listed by position.\nG-. VACANCY FILS\nThis file gives the particulars of all vacant positions, such\nas qualifications desired, salary range and so forth. Attached\nto this file is a record of the names of applicants recommended"
}