{
  "id": "d237-94",
  "text": "8,\nfor positions, and a record of each applicant’s action in regard\nto each job vacancy for which he has been recommended.\nThe appropriate forms for this file were printed with the first\nprinting of all Placement Forms. However, there was no Vacancy\nFile as such prior to October 18, 1954.\nSince October 18, 1954 the appropriate forms have been organized\nto constitute a file.\nH. KEY MAN FILE\nThis file contains the names and addresses of all officials with\nwhom the Placement Service has contact.\nPrior to October 18, 1954 there was no Key Man File.\nThis file was created for the purpose of enabling the Placement\nOfficer to find easily the name and address of key persons at\nevery station, university or college, school system and radio\nand/or television center. It also assists him in recommending\nresponsible officials to whom applicants should write.\nI. CGRRESPONDENCE WITH EMPLOYERS FILE\nThis file contains all correspondence with prospective employers\nrelative to job openings, qualifications of applicants, etc.\nPrior to October 18, 1954 this material was placed in the General\nCorrespondence File.\nAfter October 18, 1954 it was felt necessary to separate corres¬\npondence with employers from the general correspondence. This\naction increased the speed with which the Placement Officer may\nlocate past correspondence with employers, an almost daily task.\nJ. GENERAL CORRESPONDENCE FILE\nThis file contains all correspondence carried on by the Placement\nOfficer excluding the material covered in the Correspondence with\nEmployers File.\nPrior to October 18, 1954 this file included all correspondence\nof the Placement Officer.\nAfter October 18, 1954 this file was reorganized for the reasons\nlisted above in Section I.\nSUMMARY\nIt is necessary to point out that all of the above files are not in good\norder at this time. It is hoped - and every effort is being made to\naccomplish this hope - that all files will be in good order by April 1, 1955\nor shortly thereafter."
}