{
  "id": "d237-96",
  "text": "10,\n1* Completed Placement Forms are received,\n2. One copy of Form 10 and five copies of Form 9 are sent\nto each reference listed by the applicant.\n3. Appropriate entry is made on Active Mailing List.\n4. Appropriate entry is made in the Referral File.\n5. Appropriate entry is made in the Experience File.\n6. Appropriate entry is ma.de in the Positions Desired File.\n7* Appropriate entry is made on Newsletter Supplement list.\n8. Applicant’s Inactive File material is collected.\n9. Applicant's folder is prepared.\n10. Applicant’s folder is placed in the Active File,\n11. Applicant is removed from Inactive filing List.\n12. Applicant is sent letter acknowledging receipt of forms.\nC . PROCESS OF VACANCY REPORT\nThis procedure is designed to insure that all necessary steps are\ntaken in the recommendation of candidates for vacant positions.\nThe steps taken in this procedure are as follows:\n1. Notification of vacancy is received.\n2. Appropriate entry is made in Vacancy File.\n3. Positions Desired File is consulted.\n4. Experience File is consulted.\n5* Selection of applicants for recommendation is made.\n6. Credentials of selected applicants are sealed in Credential\nCovers and mailed to the employer with a letter in which\nthe names(s) of the applicant(s) must he listed.\n7. Appropriate entry is made in the Referral File.\n8. Appropriate entry is made on reverse side of Form 14,\n9. Applicants are sent Form 15.\n10. Letter of notification and carbon copy of reply are placed\nin the Correspondence With Employers File.\nSUMMARY\nThe establishment of these procedures has increased the speed and efficiency\nof the Placement Service and in all other ways has improved the operation.\nIt is the duty of the Placement Officer to check and improve these procedures.\nFurthermore, he shall establish new procedures as the need for such arises.\nIV.THE PLACEMENT OFFICER SHALL DEVISE AND CARRY OUT WAYS AND MEANS OF ESTABLISH¬\nING PERSONNEL CLASSIFICATION AND DEFINITIVE JOB DESCRIPTIONS.\nSTATEMENT\nThe need for personnel classification and job description in the field of\neducational television and radio is pressing. There is, evidently, a great\ndivergence of opinion among both employers and applicants as to what exactly\nis, for example, a director? what are his duties? what are the necessary\nqualifications for the position? and so forth. Also, there is a growing"
}