{
  "id": "d237-98",
  "text": "12\ndistribution of results, careful attention must be given to insure that\nno stations or institutions be mentioned in connection with particular\nsalary ranges, as this would be a violation of confidential material.\nV. THE PLACEMENT OFFICER SHALL DEVISE METHODS BY WHICH HE WILL BE MALE AWARE\nOF CURRENT TRENDS AND AFFAIRS WITHIN THE EDUCATIONAL BROADCASTING FIELD.\nSTATEMENT\nIn connection with the purposes of the Placement Service, it is felt that\nthe Placement Officer should be aware of all affairs in the field which\npertain to his office. Thus, the Placement Officer should know the present\nand planned status of those centers, stations and institutions which he\nserves. With this knowledge, the Placement Officer will be better equipped\nto advise applicants of the possibilities of obtaining employment. Further¬\nmore, such interest in the affairs of the field will instill a high degree\nof confidence in the Placement Service by the employer who will realize\nthat the Placement Service is aware of his individual problems pertaining\nto personnel and is seeking ways to alleviate them.\nSUMMARY\nIn order to accomplish this program, it is deemed advisable to have the\nPlacement Service placed on the mailing lists of the Joint Committee on\nEducational Television (JCET) and the National Citizens Committee for\nEducational Television (NCCET) so that the Placement Officer will have a\ngeneral knowledge of internal affairs of the field. More specifically,\nit is urged that letters of inquiry be sent by the Placement Officer to\nthe directors of member stations, centers, and institutions concerning\ntheir present status and future plans and offering our service to them.\n(See Appendix F.) The purpose of these letters is to create good-will,\nto make the Placement Officer aware of problems within the field, and to\nmake the employing official conscious of the existence and usefulness of\nthe Placement Service.\nVI. THE PLACEMENT OFFICER SHALL SEEK APPROPRIATE MEANS TO ADVERTISE THE PLACE¬\nMENT SERVICE, THE QUALIFICATIONS OF APPLICANTS, AND CURRENT JOB OPENINGS.\nSTATEMENT\nIn order for the Placement Service to be of good use to applicants and\nemployers, its existence must be made well known. Therefore, it behooves\nthe Placement Officer to create effective means of publicity and to see\nto their accomplishment. It is felt that through a program of publicity\nthe Placement Service will be able to extend its operation by guaranteeing\nwide promulgation of news concerning applicants and job openings. Like¬\nwise, it is hoped that non-commercial broadcasters who are not members of\nthe NAEB will discover and make good use of the Placement Service and\nthrough this rewarding contact decide to join the NAEB."
}