{
  "id": "d400-0",
  "text": "EDUCATIONAL TELEVISION STATIONS\na division of NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n1346 Connecticut Avenue, Washington D. C. 20036 • phone: (202) 667-6000\nSeptember 23, 1969\nTo: Chalmers H. Marquis\nFrom: H. Holt R iddleberger\nSubject: ETS-NAEB/FCC Activities\nThis is a brief accounting of some of the ETS-NAEB/FCC activities which\nwe have conducted over the past six to eight weeks:\n1. We filed an objection to carriage by a CATV system in the town of Holly\nHill, Florida of ETV signals of stations WEDU in Tampa, WUFT in\nGainesville, and WJCT in Jacksonville, in addition to WMFE in Orlando.\nWhen it was apparent that technically Holly Hill was not within the\ncoverage area of WMFE, and that WFME was not going to do anything\nfurther about objecting to the carriage of the other three stations, we\nwithdrew our objection. On the same basis, we are not filing in the\nmatter of Halifax Cable Co. in Daytona Beach which is proposing the\nsame pattern of carriage. However, we are filing in support of WMHT,\nAlbany-Schenectady, which is objecting to carriage of WNDT in that area\nby Mohican Cable Co. WNDT has indicated its desire not to be carried,\nand we expect that we will be able to make some points about the unfairness\nof the FCC interim rules with respect to educational broadcast stations.\n2. Jim Fellows and Bob Woods are continuing to develop our filing on the\nsubject of the racial bias rulemaking which is due October 3. We do not\nexpect that the survey being conducted by Mr. Fellows will be completed\nby that time, but sufficient information can be drawn from it to make our\nfiling effective.\n3. We will shortly be distributing to our members copies of the original\nJustice Department letter, and a reply by FCC Counsel Henry Geller on\nthe subject of the use by broadcast stations of taped program material\nprovided by foreign principals. The exchange of correspondence was\ndirected primarily at radio programming, but it is equally applicable to\nthe use of television programming from foreign sources as well. The\nquestion revolves around whether a station which accepts an offer by a\nforeign country of a selection of taped material, and thereafter broadcasts\nsome of the taped material, would be constituted an agent of a foreign\nprincipal within the meaning of the Foreign Agents Registration Act and\nwould thus be required to so register. The whole matter is apparently a\ntempest in a teapot, but it has taken time and attention."
}