{
  "id": "d400-1",
  "text": "-2-\n4. We have been discussing at staff level the position which the NAEB had\ntaken in the matter of Subscription Television. We will be discussing\nthis in the Board meeting with respect to the pending hearings in the\nHouse but, as you know, interim rules are being adopted by the FCC\nand our approach to the Congress will determine our involvement in any\nFCC rulemaking.\n5. We have explored with Henry Cauthen in South Carolina his problems\nwith respect to an attempt to join with three commercial television\noperators in sharing a transmitter tower which action is being chal¬\nlenged by another commercial operation. The matter is presently up\nbefore the FCC and I will be talking with Counsel later this week to dis¬\ncover whether we should at least keep an eye on this proceeding.\n6. We will be talking with Oscar Reed later this week to discover what\nfurther should be done in reply to the FCC's request for comments in\nthe matter of the forthcoming World Administrative Radio Conference.\nOur concerns here as always will be that the interests of education in\nthe reservation of both FM and television channels will be kept in mind\nin any negotiations with respect to international satellites.\n7. V/e are beginning now to review the comments filed in Docket 18397\nhaving to do with the Commission's proposed interim rules with respect\nto CATV and will on the basis of that survey decide whether and on what\ncomments we will need to file in reply, Reply Comments being due on\nNovember 3. As you know, we recently filed extensive comments in\nPart V of that Docket with respect to the future relationship of CATV and\ncommunications generally.\nWe also filed recently in support of an FCC proposed rulemaking to permit\nITFS response channels to be used for data signaling as well as for voice\nresponse. We do not expect any difficulty with this one.\nWe were pleased to hear recently of the positive action taken by FCC with\nrespect to the Microwave Communications Corporation's request for permission\nto construct a microwave line between Chicago and St. Louis, a case which has\nbeen pending before the FCC for the last six years which was being fought\nbitterly by AT&T, Western Union and others. We believe that, as the\ntechnology develops, this may well have some significance for educational\nbroadcast interests. The Company has now filed for a line from Chicago to\nNew York, and I will be meeting this week with a principal from the Company,\nwith whom we have had close contact in the past, to explore next steps by\nwhich we can benefit from this important breakthrough."
}