{
  "id": "d400-10",
  "text": "EDUCATIONAL TELEVISION STATIONS\nA division of\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nPHONE: 667-6000 • 1346 CONNECTICUT AVENUE • WASHINGTON, D.C. 20036\nOffice of the Executive Director\nFebruary 6, 1969\nMEMORANDUM\nTo: Norman Jorgensen and Robert Woods\nFrom: H. H. Riddleberger\nThis summarizes some of the our recent conversations concerning\nNAEB - FCC matters, both in the recent past and the near future:\n1. Mr. Jorgensen made an oral presentation before the full\nFCC on February 3rd on behalf of NAEB, on the subject of certain\naspects of the proposed rulemaking governing CATV operation and\nregulation. Extended written comments on these and additional\npoints are due on March 3rd and Reply Comments on April 3rd. The\nFCC has indicated that additional oral arguments may be scheduled\non parts III and IV (on which the oral presentations and the two\nfile dates above are focused). Comments on part V, which deals\nwith the future technology on the long-term basis involving CATV\nand broadcast communications, are due June 16th with Reply Comments\non the same portion before August 15th. Conversations with outside\npertinent parties and within NAEB staff are continuing and a draft\nof the March 3rd Comments should be available by February 20th for\nStaff review.\n2. Written comments were filed on February 3rd in FCC dockets\n18261 and 18262 covering reallocation of the lower and upper UHF\ntelevision bands to Land-Mobile on a sharing and/or outright\nallocation basis. Reply Comments are due March 31st. We will\nneed to search the docket to discover whether it is in the NAEB\ninterest to file Reply Comments in this matter.\n3. Comments are due in the FCCTs Third Further Notice of\nProposed Rulemaking (docket 11279) for the carriage of subscription\ntelevision signals by CATV systems March 3rd with Reply\nComments due on April 3rd. The proposed rules are written as the\nFCC says from the point of view of commercial television since the\nproceedings on which they are based were directed almost entirely\nto the relationship between STV and commercial television. In\nspite of this fact the FCC noted that if parties having STV 'authoriza¬\ntions (which had to be either operators of; or holders or applicants\nfor, construction permits for, a commercial television broadcast\nstation) wish as part of their programming to broadcast educational\nor cultural programs in conjunction with non-profit educational\norganizations, ’’such proposals will be given consideration in\n**■ ,.w\n► > '"
}