{
  "id": "d400-17",
  "text": "-3r\nstation. In the event that community lies in a State different from that of the\nsystem, then it shall select the signal of the nearest non-commercial educational\nstation within the State in which the system is located and need not seek a waiver\nunder the provisions of Section 74. 1107(e)(2). \"\nAs we have stated, the Commission proposes to regulate CATV for\nthe future under these rules, what is more, the Commission will \"grandfather\"\nail distant signal importation authorized during this interim period. For this\nreason, we repeat, the rule changes here sought must be promulgated expedi¬\ntiously. As the Commission may gather from the foregoing, NAEB supports\nthe proposal that the CATV system obtain the consent of the distant station for\nretransmission of its signal.\nTurning now to Section 74. 1101(m) under \"definitions\" NAEB notes\nthat the \"specified zone of a television broadcast station\" means a 35 mile\nradius from the main post office in the community or cqmmunities of assign¬\nment. We believe the Commission's decision to establish certainty and ad¬\nministrative convenience in using a fixed mileage standard is wise and NAEB\nsupports the fixed mileage principle. We expect during these proceedings you\nwill be hearing both favorable and critical argument regarding the principle\nand where the line should be drawn if the principle survives. Educational\nTelevision has its own views, we think the 35 mile radius is insufficient. An\niiTV station's support comes from its viewers, the school systems it serves,\nand educational interests in its community. The close-in area surrounding\na community's down-town post-office, the commercial section, may very\nwell be geographical areas with few interested viewers. Its source of com¬\nmunity support is its point of local contact of local service. This is true\nparticularly in the educational stations service to school systems. Let me\nbe specific: V/ETA, Channel 26, Washington has an off-the-air signal that\nserves 1V school systems, located in Maryland, Virginia^ and the District,\npublic as well as parochial,, some as far distant from the ..Washington Post\nOffice at North Capitol Street and Massachusetts Avenue as 55 miles. Not\nonly do these distant school systems help support Y/ETA in a hard dollar\nsense but the parents and public in those communities are public supporters\nas well. NAEB recommends that the 35 mile radius be expanded to at least\n50 miles, perhaps 60.\nNAsEB points out that the Post Office center may prove troublesome\nin more cases than not. It can be assumed, we believe, that transmitter\nlocations never correlate with Post Office locations. The distances between\nthe two locations in a community must generally be enormous. In other\nsituations television antenna farms are more often than not located many\nmiles from main post offices. There is no precise system of concentric\ncircles of television signals emanating from the center of any city of designa¬\ntion. NAEB supports fixed mileage zones of protection and the resulting\ncertainty and ease of administration. Whether the point of reference is the\nmain post office or the transmitter site we are not able to say with certainty.\nThe question is worthy of study and NAEB will attempt to deal with the\nquestion further in its written comments."
}