{
  "id": "d400-18",
  "text": "_4-\nNAEB has considered the question of program origination by CATV\nsystems. It notes that the Commission has expressed its concern about a\nspecialist in program distribution, or \"common carrier\" to use the Com¬\nmission's word, acting also as a program originator. NAEB in its consider¬\nations in this area shares the Commission's concern. Traditionally common\ncarriers do not act as program originators; they control the distribution\nsystem and the access to it. They should not, to paraphrase a famous decision\n\"compose the traffic\" of the system. The bothersome question presented is\nease of access to the system. As the Commission knows, program originators\ncomplain of difficulty of access to our major TV networks who also originate\nprograms. It is this kind of \"access to the system\" problem that could arise.\nIn a 20 channel CATV system with 6 to 8 free channels available \"for hire\"\nperhaps one channel in the hands of the distributor adds a further voice to be\nheard in a community. But if access to the system by others ever becomes\na problem, this is precisely what the Paramount Case was all about when the\ngovernment separated the production and distribution ends of the motion\npicture industry. NAEB is pleased that the question of program origination\nis resolved for the moment as a \"tentative\" Commission conclusion. The\nNAEB will give further consideration to the matter as well and will comment\nfurther in its written presentation.\nOne remaining matter requires NAEB mention. In Docket No.\n18416 released January 15, 1^69 it is proposed to revise the notification\nrule Section 74. 1105(a) and (b). Under Section 74. 1105(a) local stations are\nrequired to be notified in advance of the commencement of carriage of any\ndistant television signal. NAEB supports the rule amendment that will\nrequire notice of the commencement of carriage of all television signals,\ndistant and local. It also supports the proposed rule revision to require\nnotification of termination of carriage of any television signal. Comments\ndue in this Docket are to be filed February 17 and NAEB will elaborate its\nsupport of the Commission's proposal in written comments at that time."
}