{
  "id": "d400-28",
  "text": "'lANSKY & BAILEY lmOAPCAST-TEI.EVISION DEPARTMENT\nBefore The\nFEDERAL COMMUNICATIONS COMMISSION\nWashington, D. C. 20554\nIn the Matter of\nAmendment of Part 73 of the Rules )\nregarding field strength measurements)\nfor FM and TV broadcast stations )\nDocket 18052\nRM-839\n1. Jansky S, Bailey Broadcast-Television Department points out that the\nempirical FM and TV estimated field strength charts contained in the present\nStandards were mainly derived from the work of the Federal Communications\nCommission's Government-Industry Ad Hoc Committees between 1945 and 1955.\nThe measured data from a relatively small number of FM and TV stations were\nobtained largely in accordance with the methods prescribed in earlier FM and\nTV Standards bearing strong resemblance to the methods recommended in the\npresent Rule 73.686. These data were obtained mostly using antenna heights\nof 8 to 10 feet above ground which were feasible with the mobile measurements\nrecommended by these earlier Standards. These data were adjusted to a 30-foot\nreference level by the appropriate theoretical height-gain factor. If the\ndata obtained over the period between 1940 and 1952 had been taken by 30-foot\nsampling means (now commonly described as the TASO method since that 1959\nreport), we would probably have somewhat different nomographs of estimated\nfield strength today. To relate measurements obtained solely by this newer\ntechnique to the values set forth in the present Standards would represent\nan apparent inconsistency.\n2. Jansky & Bailey suggests retaining the present procedure of making\nfield strength measurements at about 10-feet above ground on a mobile basis\nso that it will be possible to continue to obtain considerable amounts of\ndata by means which can be logically referenced to past values. To supplement\nthe mobile recordings so obtained, height-gain factors can be established by\nmeasurements at appropriate intervals along a route by the use of 30-foot\nATLANTIC RESEARCH CORPORATION\nA Division of The Susquehanna Corporation"
}