{
  "id": "d400-30",
  "text": "1ANSKY & BAILEY BROADCAST-TELEVISION DEPARTMENT\nGrade B service limit is so specified that a quality acceptable to the median\nobserver is expected to be available for at least 90% of the time at the\nbest 50% of receiver locations at the outer limits of this service.^/\n5. Where service considerations within the Grade B region, which do\nutilize the aforementioned statistical probability concepts, are involved,\nthe location probability functions graphically shown in Appendix V, Figure 5\nof the Third TV Report are used. These graphical values were based upon 8\n10-foot mobile measurement data. This information was directly relied upon\nin developing co-channel interference acceptability ratios which were one\nintegral factor in allowable mileage separation determinations. The root\njustification of this reasoning is in the work on earlier propagation material\nwhich the Ad Hoc groups used. Such references should not be discarded and\nthey can be brought up to date by the application of the newer TASO knowledge\nand techniques. For this purpose the Federal Communications Commission has\nhad the TASO data at its disposal and has from time to time issued technical\nreports thereon.\n6. The periodic sampling technique which is suggested to supplement the\nmethod contained in the present standards will result in appropriate sector\ncorrection factors. The following table gives the approximate wavelength\nin feet for the several frequency bands of concern and illustrates the wave-\nlength domain in which the measuring antenna operates:\ngand_Frequency_Wavelength (Feet),\n54 to 88 me. 18 to 12\n88 to 108 me. 12 to 9\n174 to 216 me. 5.7 to 4.5\n470 to 890 me. 2 to 1\nLow VHF\nFM\nHigh VHF\nUHF\n*/ \"Grade A service is so specified that a quality acceptable to the\n' median observer is expected to be available for at least 90% of\nthe time at the best 70% of receiver locations at the outer limits\nof this service.\" - See Third Report. See also Iso-Service\ncontour concept. Paragraph 94, Sixth Report and Order dated\nApril 14, 1952.\n- 3 -\nATLANTIC RESEARCH CORPORATION\nA Division of The Susquehanna Corporation"
}