{
  "id": "d400-36",
  "text": "- 4 -\n'recommendations the Task Force may make. However, it will be important\nfor us to study the report carefully as soon as it is published m order\nto assess its impact on future administration and FCC actions with respect\nto both domestic and international broadcasting. It might be well to\nassign such a study at the present time in order that there may be no\ndelay when the report (reputed to be a fat one) comes out.\nd) Roger Petersen and Oscar Reed came in the other day to report\non a matter which they had stumbled upon and which they thought should be\nof concern to the broadcasting industry: it seems that Mack Parker of\nthe FCC is supposed to have on his desk a second revision of proposed\ntable of allocations from Canada, in effect providing for a saturated\ntable of allocations for Canada through channel 83 (Canada table is\nalready saturated through channel 70). In the industrialized northeast\nand north central arch from Erie through Duluth, this would seem to ^\nargue that American interests might be ill served by such an allocation\npattern. For example, only one allocation under the U.S. table remains\nto the city of Detroit, UHF channel 78. The proposed table for Canada\nwould assign 78 to Windsor, Ontario directly across the river. J & BTs\nconcern is that the Canada-U.S. agreement differs from normal inter¬\nnational spectrum procedures (which must be cleared through the State\nDepartment) in that the FCC is empowered to deal directly with the Canada\nBoard of Broadcast Governors. Thus, any normal rulemaking procedure or\nother provision for comments might be by-passed. J & B feels that the\nFCC should be challenged to ccmmit itself to some activity with respect\nto American use of channel 70 through 83 , before Canada becomes locked\ninto a commitment in that area of spectrum (see docket 18262 above).\nPerhaps so simple a procedure as filing a request for rulemaking to\nreserve channel 78 in Detroit for educational broadcasting use mighty\nsuffice. A discussion as to the adviseability of taking further action\nis requested.\ne) Robert Mott has some recent information on the status of the\nproposed new FM allocation table for educational broadcasters, which\nappears still to be at the into-the-computer stage and probably two years\naway (a new Canada allocations table is still being awaited). In the mean¬\ntime, we understand that WABI has been challenged by the FCC for failure\nto comply with certain administrative regulations governing FM stations\noperating in the non-reserved portion of the spectrum - that is as a\ncommercial station would be required to file. At the same time, the FCC\nis showing increasing reluctance to authorize educational FM broadcasting\nin areas where there exists a channel 6 TV allocation (this is the band\nreserved for educational. EH broadcasting) . It would seem that we should\ncontinue to keep a close eye on FCC activities with respect to educational\nFM stations and to be prepared to suggest procedures designed to protect\neducational broadcast interests.\nf) I intend to up-date .this memorandum every two to three weeks and\nrequest that the Executive Staff retain this lengthy memorandum as a base\ndocument to a continuing exercise.\nHHR/cj"
}