{
  "id": "d400-44",
  "text": "2.\nit appears desirable to establish rules at an early date that will govern such\nservice. We recognize that as experience is gained, the rules we propose\nherein may have to be modified. Such experience may also indicate the need\nfor filing appropriate tariffs, pursuant to Section 203 of the Communications\nAct, governing special offerings to public broadcasting as preferential rates.\nAs an initial step, we believe that it would be desirable to establish certain\nreporting requirements so that the Commission may be kept fully informed\nwith respect thereto.\n4. Specifically, we propose to add a new Section 43. 74 to Part 43 to\nrequire that any carrier providing such free or reduced rate service as con¬\ntemplated by Section 396 (h) of the Act shall file with the Commission every\nsix months a report identifying the stations to which such service was rendered\nduring the reporting period, the general character of the interconnection services\nprovided, the amount and percentage of reduction given from the tariff rates on\nfile with this Commission. It shall also report the extent to which such service\nhas been requested but not furnished.\n5. This proposed addition to our rules is issued pursuant to authority\ncontained in Sections 4(i), 218, 219(b) and 396(h) of the Communications Act of\n1934, as amended.\n6. Pursuant to applicable procedures set forth in Section 1.415 of the\nCommission’s Rules, interested persons may file comments on or before\nOctober 16, 1968, and reply comments on or before October 28, 1968. All\nrelevant and timely comments and reply comments will be considered by the\nCommission before final action is taken in this proceeding. In reaching its\ndecision in this proceeding, the Commission may also take into account other\nrelevant information before it, in addition to the specific comments invited by\nthis notice.\n7. In accordance with the. provisions of Section 1. 419 of the Commission’s\nRules, an original and 14 copies of all statements, briefs or comments filed\nshall be furnished the Commission.\nFederal Communications Commission\nBen F. Waple\nSecretary\nAttachment"
}