{
  "id": "d400-82",
  "text": "April 22, 1968\nMr, William G. Harkiy, President\nNational Association of Educational Broadcasters\n1346 Connecticut Avenue N. W*\nWashington, D. C. 20 36\nDear Bill*\nI am writing to see whether NAEB can be of help in a problem which\naffects aU applicants for educational FM stations. The problem is the\nreluctance of the FCC to accept applications for educational FM stations\nwhere there is a channel 6 TV assignment or station.\nTo be specific, we have a client, Miami Bible College, Miami,\nFlorida, interested in establishing a high power FM station in Miami.\nI have completed a frequency search of the educational FM channels\nand find that it is possible to assign three additional educational FM\nstations there on channels 201, 205 and 209. I would like to apply for\n100 kw ElUr on channel 209 but I have been discouraged in two telephone\nconversations with Ed Hackman of the FCC.\nIn the first of these conversations on March 27, I was informed\nthat it was useless to submit an application for channel 209 in Miami,\non the college campus, since it would cause interference to the\nChannel 6 TV station located some 25 miles Southwest of Miami. Ha\ndid say that they might consider a 10 watt application.\nI discussed this problem with Harold Kasaens of the FCC at the NAB\nin Chicago. He suggested locating tho proposed FM transmitter on\nthe channel 6 TV tower. Our client contacted the TV station and found\nthat he could locate hia antenna on the tower at a rental of $1000 to\n$3000 par month.\nThere is a 643 foot radio tower available between 7 and 8 miles\nNorthwest of the channel 6 antenna. The rental on this tower would be\n$250. 00 per month.\nToday, I again checked with Hackman to see how much power they\nwould authorize at this location. I was told to hold up the FM application\nuntil the new educational FM rules were finalized. He also indicated\nthat these new educational FM rules would probably close the educational\nFM band where there is a channel 6 TV allocation. If this is the action\nthe FCC proposes why have an educational FM reservation since it\nmeans nothing?\n- I -\nCARL E. SMITH consulting radio engineers"
}