{
  "id": "d400-86",
  "text": "Mir\n14393\nPUBLIC NOTICE - B\nWASHINGTON, D. C. 20554\nMarch 28, 1968\nReport No. 7156\nBROADCAST ACTION\nAUTOMATIC FM BROADCAST TRANSMITTERS TO BE STUDIED BY FCC\nA Notice of Inquiry into the use of automatic and self-monitored\nFM broadcast receivers has been adopted by the Federal Communications\nCommission. It was issued in response to a petition by Collins Radio\nCompany, Dallas, Texas, asking for amendment of Part 73 of the Rules to\npermit use of such equipment.\nCollins stated that \"the time has arrived to incorporate applicable\nelectronic techniques into broadcast systems\" and suggested that with\nrules covering type acceptance, installation and utilization of\nautomatic FM transmitters, the Commission would be assured of\nequipment that would operate in compliance with the rules or shutdown\nautomatically otherwise. This, in turn, would eliminate the need for\nkeeping ' repetitive logs for verification of operations and would also\ndo away with the need for monitoring of transmitting equipment by\nlicensed operators.\nNoting the benefits of the automatic transmitters, the Commis¬\nsion pointed out that the Communications Act requires transmitters to be\nattended by licensed operators. \"Because of the significant implications\nof any departure from this concept,\" the Commission said it was asking\nfor comments on an amendment to eliminate the licensed operator\nrequirement or to allow for use of minimum grade operators to perform\nlimited functions.\nThe Commission also asked for comments in the following areas:\nThe relationship of technical automation to program\nautomation, feasibility of modifying existing FM trans¬\nmitters to automatic operation, type acceptance\nrequirements, control of frequency and power, automatic\nshutdown requirements, modulation and distortion control,\nautomatic logging, compliance with Emergency Broadcast.\nSystem procedures, effect on FM stations involved in\nstereophonic broadcasting.\n(over)"
}