{
  "id": "d400-9",
  "text": "' The Commission rejected the telephone companies * charge of duplication\nOx. facilities, saying, \"...We are not being asked to authorize the construc¬\ntion of new facilities but to authorize a fuller and more complete use of\nexisting UFM facilities....\"\nThe service would be provided the subscriber at the UPM receiving\nfacility in each community, and the subscriber would have to arrange for\ntne final step in transmission. The telephone companies argued that this\nwould be \"cream skimming,\" with UPM providing the low cost, long haul\nservice, leaving the telephone companies to provide the high cost, local\nportion. The Commission said that since this allegation is unsupported\nby facts, it could not consider its merits. In a footnote it said there\nis doubt that Michigan Bell is willing to provide \"local loop\" service.\nIt cited a pending proceeding. Docket 17484, on lawfulness of Michigan\nBell tariffs prohibiting interconnection with a microwave carrier for\naudio transmission. The case was initiated by a complaint of Northland\nAdvertising Inc. and WJPD Inc. against Michigan Belli That company had\ndiscontinued service but reinstated it temporarily, and the proceeding was\ncontinued until the Commission acted on the UPM applications.\nAnswering a telephone argument that UPM rates appeared to be 'noncom¬\npensatory, the Commission acknowledged that UPM rates in comparison are\nquite low.\" For instance, the broadcast subscriber in Ishpeming would\npay UPM about $121 a month (on a' sharing basis, or $200 alone) for network\nrelay while the comparable AT&T rate would be about $403. \"However,\" it\nsaid, \"substantia\" divergency in charges is not, in itself, indicative of\nan unreasonable or noncompensatory rate structure.\" It cited its own cal¬\nculation of $13,860 in UPM equipment costs and $340 a month in overhead\nwitn projected gross revenue of $1,200 a month. \"...There appears to us\nno substantial question as, to whether the rates are compensatory,\" it said.\nThe Commission concluded, \"There is no dispute as to the fact that\npetitioners have existing facilities capable of rendering the proposed\nservices. However, applicant also has existing facilities which/with\nrelatively modest expenditure, could be utilized more efficiently bv provid¬\ning acditional service. Of course, the decisive factor...must be.the public\ninterest. On one side, if the applications are granted, there may be some\nrather minor loss of revenue or potential revenue to petitioners and, how¬\never small, a theoretical adverse impact on petitioner's rate base/ On\nthe other hand, if the applications are denied, those parties desiring an\naudio ^service will be forced to pay rates much higher than those offered\nrrUK/ Mor£over> it be that some potential customers could not\nafrora^ to pay the higher rates. Therefore, we conclude on balance that\nthe puplie interest favors grant. However, grant of these applications\nsnould in no manner be construed as condoning or acquiescing in the earlier\nU??!|ltj0ri2ed operation. UPM is hereby put on notice that the Commission\nw^ll deal severely with any future violations of substance, whether willful\nQt* nnf* ••\nAction by the Commission January 29, 1969, by Memorandum Opinion and\nOrder. Commissioners Hyde (Chairman), Bartley, Robert E. Lee, Cox, Wadsworth,\nJohnson and H. Rex Lee.\n- FCC -"
}