{
  "id": "d1109-0",
  "text": "Volume VI Number 1\nJanuary 13, 1965\nSUMMARY OF COMMENTS BEFORE FCC ON COMMUNITY ANTENNA TELEVISION REGULATIONS\nWe have been studying the mass of comments and reply comments filed\nin the Carter Mountain (CATV) rule-making proceeding. Naturally, the\nmajor thrust of the pleadings has been concerned with economic impact (or\nlack of it) upon commercial television operations. There have been a\nnumber of other significant areas covered by the pleadings, however,\nwhich may be of more direct interest to NAEB members. Here's a quick\nrun-through of some of them:\n1. UHF: A recurrent theme has been the adverse impact of CATV upon\nthe development of UHF. Since the major development of ETV stations lies\nin UHF, any activities which tend to frustrate that development are\nproperly our concern. National Community Television Association advances\nstatistics which show rather convincingly that as of the moment CATV has\nnot hurt UHF development. Thus, of 92 UHF commercial stations on the air,\n22 have CATV service in the same community. In five of these communities,\nthe UHF station went on the air prior to CATV, and in 14 instances, the\nCATV service existed before the station went on the air. Of 107 UHF\nstations which have gone off the air, only 10 had CATV competition. These\nfigures as to present impact are questioned by some parties, notably\nSpringfield Television Broadcasting Corporation, which filed detailed\ncomplaints concerning the adverse effect on its stations in western\nMassachusetts. However, the gravamen of the charges by anti-CATV forces\nis the potential effects on UHF in view of the rapid and continuing growth\nof CATV. Where multiple signals can be brought to most communities,\ninvestment in the hazards of UHF is discouraged. Nor do such parties find\nsolace in the claim of NCTA that CATV is a boon to UHF since it provides a\nready-built audience without the need for converters. The important asset\nof UHF Licensee wants is his own home audience receiving service directly\nthrough his own receiver.\n2. Table of Allocations. A second major theme of the pleadings has\nbeen the impact of CATV upon the Commission's television allocations\nprinciples. The arguments follow patterns somewhat similar to those\nadvanced in the MPATI rule-making proceeding. Typical of the contentions\nmade is this excerpt from a pleading filed by Station WAAY-TV, Huntsville,\nAlabama:"
}