{
  "id": "d1109-1",
  "text": "2\nWhen the Commission adopted its Sixth Report and Order,\nspecific channels were allocated to specific communities.\nNo channel other than the one specified for a given community\ncould be applied for by an applicant. The Commission also\nspecified the maximum power that could be used on given channels.\nThus, the Commission recognized the normal area which a station\nwould serve and also established grades of service for such\nareas and the normal extension of such grades of service. Like¬\nwise, the Commission recognized the existence of certain cities\nand areas which were separated by relatively short distances\nand combined such areas into one area for purposes of allocation.\nThis system of allocation which is in existence today, fully\nestablishes the area which a given station is supposed to\nserve. Competition was also created between stations in given\nareas according to the size and population by the allocation\nof more than one television station. No provision was made\nfor any station to utilize a gimmick and leap frog its signals\ninto the areas allocated to other stations, thus creating\nundue and unfair competition. However, the present CATV\nsystems have provided the gimmick whereby such leap-frogging\nmay be accomplished. By further utilizing microwave relay\nstations, this leap-frogging can now be extended over hundreds\nof miles so that the very foundation on which the Commission's\npresent allocation policy rests is now threatened.\nFrom a philosophical standpoint, too, there has been cause for complaint,\nbased on the fear that rapid growth of CATV will turn smaller cities into\ncultural and economic suburbs of distant metropolitan centers. Moreover,\nin view of the tendency of CATV operations to concentrate on city rather\nthan rural subscribers, it is conceivable that large areas of the country\nmay lose the opportunity to receive either commercial or educational tele¬\nvision. As a result, the number of parties filing comments have suggested\nthat the Commission establish limits on the distance that a particular\nstation's signals may be carried via CATV. Others, and particularly\nstation KCOY-TV, Santa Maria, California, which is fighting a CATV proposal\nto bring the seven Los Angeles signals into that community, have requested\nthat CATV be limited to carrying only the number of television signals\nwhich would be available in a community in a full Table of Allocations\nat maximum facilities.\n3. FCC Regulation? A third major concern has been the extent of\nFCC regulation. As shown in the attached release, the Commission has been\nreluctant to assume full jurisdiction without specific legislation. Many\nparties have argued to the FCC that it already has full power to regulate\nCATV in its impact on television stations. ABC has filed a separate\npetition for rule making (RM-672—comments were due on November 23, 1964,\nand reply comments were due December 8, 1964) , seeking Commission reg¬\nulation of the carriage of television signals by CATV systems. A copy of\nthe ABC petition is enclosed. Just as vociferously, NCTA and CATV"
}