{
  "id": "d1109-2",
  "text": "3\noperators argue that the FCC lacks jurisdiction not only in the respects\ndesired by ABC, but even in the limited areas which are the subject of\nCommission rule making in its Carter Mountain docket, its TV-CATV docket,\nand its CAR docket. There is considerable dispute in the pleadings as\nto whether the protection against CATV duplication should extend to the\nGrade B rather than the Grade A contour, whether more protection is\nwarranted for UHF stations than for VHF stations, and whether the pro¬\ntection should be accorded to both simultaneous and non-simultaneous\nduplication.\n4. Program Origination. Some concern has been voiced about program\noriginations and advertising practices by CATV operators. The Commission\nin its TV-CATV docket is seeking information as to the exact extent of such\nprogram origination, including commercial announcements. Such practices\namount, in effect, to pay-TV, a bug-a-boo for many commercial broadcasters\nfar worse than CATV. For educational broadcasters, such practices have\nresulted in problems of commercial announcements inserted between educa¬\ntional television offerings. Future problems may include program origination\nby CATV operators of educational and cultural programs, over which educa¬\ntors may have little control with respect to quality, timing, distribution,\netc. In a broader sense educational broadcasters must consider whether\ntheir non-commercial educational offerings will still maintain that image\nin the public mind if they are carried to large segments of the public by\nmeans of a pay-TV or even paid-CATV vehicle. It might, for instance, be\ndifficult to secure regular ETV subscriptions from a viewer who is already\npaying regular substantial sums for CATV.\n5. TV Satellites. The Commission's proposed rules do not include\nprotection for TV satellite operations, defined as stations which do not\noriginate at least 7 hours per week of local programing. Many commercial\nstations have opposed this limitation, on the theory that quite often\nsatellite stations which start out with no local program origination later\nbecome independent local outlets. Satellite operation in the educational\nfield is likewise becoming somewhat more common, with newer stations\noften-times relying heavily upon established ETV stations nearby. Multiple\nassignments in the same general area may well contemplate early stages in\nwhich the additional assignments are little more than satellite operations\nfor particular viewing areas or particular segments of the viewing popu¬\nlation. As such, ETV interests may have an interest in the Commission's\nproposals for satellites.\n6. Translators. NCTA and the CATV operators argue that if strict\nduplication rules are to apnly to CATV, similar limitations should be\nimposed on translator operations. In a recent case (Wichita Television\nCorporation, Inc., FCC 64-993, released October 29 , 1964) , the Commission\nadded a 15-day before and after duplication condition, which had been\nvoluntarily agreed to by a UHF translator applicant at Salina, Kansas."
}