{
  "id": "d1657-6",
  "text": "SMOKESCREEN IN CALIFORNIA RADIO ,\nFollowing the disclosure in the press of plans by the broadcasters\nassociations of Northern and Southern California tc kill off the plans c-f.t e\nUniversity of California and the State Department of Education, the campaign ha\napparently gone under cover. Despite the assertions of non-oppo^i ion o\neducational broadcasting, the hearing on the enabling bill_in the state senate n*\ntabled (May l). Without a highly geared reaching to exert influence, it is difficult\nto understand hoi; the recommendations and advice of respected and duly constituted\neducational interests can be so lightly brushed aside.\nThe tactics used followed the usual pattern. Delay-—to keep the bill fro\ncoming up for a fair vote through a \"survey” requiring time, amendments t\nremove from the bill anything which might in any way be_offensive to the opposition.\nAspersions-that the measure would have dire results if passed. who+her\nThe delay would be brought about by authorizing a survey to determine whether\nor not a \"need\" existed for the proposed EM stations. Educational agencies pre¬\nviously studied the matter and made their report which showed the need and use.\nAmendments were thrown in to confuse the issue. One such says Communications\nfacilities to the jurisdiction of Communications (Board) shall never under any\ncircumstances be used for political, sectarian or propaganda purposes . The pro¬\nfundity of such thinking! \"it would leave the station with little except -nocuous\nmusic to broadcast. \" Red Cross program or a talk on soil-erosion would be\nbecause they would fall within the definition of a \"method for spreading a certain\nopinion or belief\". . „ - +v,_\nThe seeds of suspicion sown through aspersions concerning auspices of the\nproposed stations took loaf in the California Senate Education Committee hearing\n(May 1) when Senator Jack Tonny (D-L.A.)\" wondered whether programs would bo\nguarded against Communism\". Senator Chris Josperson (R-.rtasoadoro) protested,\nsaying he -would not \"stand for having the University of California called\ncommunistic\". An argument ensued, harmony was lost, the bill was tabled, a\nproponents of the commercial opposition had won another heat. .\nThe story of this California development-with the opposition running counter\nto the very thing which critical observers and enlightened broadcasters recognize\nas definitely \"in the public interest\" -is a classic. It needs to be told m\nits entirety for the record!\nHIT? AND MISSES\nNow it’s a \"mischievous\" document! The \"Blue Book\" scores again in the\nadjective column. (Broadcasting, April 21, ’47).\n•’Radio is all the American people have loft. We don't have the movies or the\npress. Sc the people had better hold on to the radio .\np r v.V.. T.nfrUprdia\n+.V1P. Nrw York Post\n\"Repetition is the pernicious anomia of radio. Tho repetition of mysteries,\nof quizzes, of soap operas and of rov/dy breakfasts results in $ m*+?nB+4„ ww+hlv\n\" .Edward ^'reeks. Editor,Atlantic iconthly\n\"With\nallowed to\nthe \"ins\" and the \"outs\" equally unstable\nadminister this heavy weapon, radio?\"\n..Carroll\nand irrational, who\nCarroll, Variety,\nis to be\n'pr. 23 ’47\nWeapon eh, let’s try disarming a bit!"
}