{
  "id": "d1399-2",
  "text": "Censorship is no more involved in the FCC stand¬\nards than in the Post Office Department’s require¬\nment that in return for reduced second-class or fourth-\nclass mailing privileges, periodicals must either not\nbe designed primarily for advertising, or, in case\nof fourth-class, reading matter must constitute 25%.\nUnder the Supreihe Court’s \"Esquire” decision, the\nPost Office Department cannot use its power over the\nallocation of material in magazines to control content\nin any way.\nThere is very little danger that the FCC would\ntrespass beyond allocation of time to content of pro¬\ngrams except to determine that the various types\nprescribed are in fact of the character claimed. If it\ndid, the courts, the industry and public opinion would\nall stand in the way. The ACLU would be among the\nfirst to resist.\nThe opposition of the industry is evidently based\nnot so much on fear of censorship, as its spokesmen\nallege, as on the idea that radio licenses once granted\nbecome a vested private interest over which licensees\nalone should have control, except in cases of flagrant\nmisuse of their privileges. But the law properly re¬\nquires periodic review of performance to insure that\nthey continue to operate in the public interest.\nStation-owners also resist the restrictions placed\nupon their freedom to sell all possible time to spon¬\nsors, and thus to make the largest profits. The FCC\nrequirements that they furnish more programs of\npublic interest and develop local programs may re¬\nduce somewhat their profits; and they certainly will\nrequire more work on the part of station program-\ndirectors, less on the part of advertising agencies;\nless record-playing, more initiative. That should re¬\nsult in a more diversified, and presumably better pro¬\ngram structure.\nThis leaflet presents the objections raised by the\nindustry and our answers. The purpose of the\npamphlet is to state the facts for public informa¬\ntion and to enable those who so desire to express\ntheir views to the Federal Communications Com¬\nmission, Washington 25, D.C.\nObjection 1. The industry claims that there is no\nauthority in law for the standards fixed by the Com¬\nmission.\nAnswer. The Commission is empowered by Act of\nCongress to grant and renew licenses on the basis of\n\"public interest, convenience and necessity.” The\nstandards fixed merely spell out the Commission’s\nconcept of the public interest. The authority and ob¬\nligation to do so are clear.\nObjection 2. The industry claims that the Commis¬\nsion’s fixing the proportionate character of programs\nviolates the first amendment to the Constitution pro-"
}