{
  "id": "d1793-10",
  "text": "WASHINGTON REPORT\nejX XV -\nALL-CHANNEL RECEIVER DEVELOPMENTS\nOn July 10th the President signed the all-channel receiver bill\nU^^irtx -ri\n^rf£^k\nV^/UL OfK, 1/4ft\nextre.me^- signifiuance in :\njlopmerrt of1 UHF. in which eekboation ETl/\nhas two-thirds of its reservations and*tk& pgxifci portion of \"the spectrum in- which\nit must find oi^U U V- * J-W,\nFCC\nC/has r<\nrequested EIA to suggest a swtichover date for start of all-channel\nreceiver manufacture and to devise acceptable UHF tuner noise and i©22sdxsex\nsensitivity figures. Rule-making will probably be scheduled in September.\nETV\nNCTA AND EQTOASJ-ON %\n/ / *t~ ^ Jx ^ *\nW?U0 yU***the biggest and most successful convention^ of the Community\nAntenna operators. Appearance and participation of a number of high-level political\nfigures testified to recognition of growing importance of this new aspect of the industry,\nled Vice President Johnson; Congressman Oren Harris; Senators Fulbright, Magnuson,\nMorse, and Monroney; FCC CAa > Wvv^vt»w.\nr\nNAEB President Harley/participated in a panel on ETV, along with David Stewart,\nNETRC; Keith Engar, FCC; and John Guy Fowlkes, University of Wisconsin.\nHarley praised CATV operators for assistance they are already providing by extending\nETV service in many places and assured them that “in certain areas there would be a\ncontinuing need to serve schools, colleges, and homes that cannot be reasonably\nserviced by other means of television transmission.”\nOn June 29, the Senate Committee on Agriculture and Forestry held hearings on a\nbill which would allow the REA to make loans to borrowers for the purpose of setting\nup CATV systems for educational purposes. The House has already passed the bill\n(HJt. 10708).\nNEW RECEIVER FOR FOREIGN ETV\nA major break-through in overcoming the problem of suitable receivers for develop¬\nment of ETV for mass education in newly-developing nations was announced recently.\nAID has awarded contract to Warwick Mfg. Co. of $400,000 for l,000£^nW-th^eir^h^ .\ntransistorized battery operated set. This development is part of a c^fse pmgram oapAIisk ^\nexploring use of telecommunications for education .fvjfA'ElJ y>oJ\\ nj~\nVW*pk A10 K-<. Aw £^rv~» L-AVV-Vw^. cA\nSEC$rsv ^ t.Ux '\nDespite vigorous arguments by commercial broadcasters before the Senate\nCommunications Subcommittee, there seems to be little likelihood that the equal-time\nrequirement for political candidates will be removed. Suspension for 19 64 elections,\nas advocated by President Kenedy, is probable, but permanent or wholesale\nelimination of the provision is not. 1-iteeiy. Senator Warren Magnuson (D.pWash.) has\nintroduced a bill to end the requirement for broadcasts toi presidential and vice-\npresidential candidates. Senator Hartke (D.-Ind.) is author of a bill seeking complete\nrepeal of Sec. B15. FCC Chairman Minow testified that he :&pcK preferred to see the\nsection left intact."
}