{
  "id": "d1793-11",
  "text": "AIX-CHMEL RECEIVER DEVELOPMENTS\nOn July 10th the President signed the all-channel receiver bill requiring\nall TV receivers shipped in interstate commerce be capable of adequately receiving the\n70 UHF as well a the 12 VHF channels. This is extremely important to education\nbecause of the boost it will give {/HF, in which ETV has two-thirds of its reservations\nand in which portion of the spectrum it must find its future growth.\nFCC^ which promptly announced that it would provide for a reasonable transition\nperiod, has requested EIA to suggest a switchover date for start of all-channel\nreceiver manufacture and to devise acceptable UHF tuner noise and sensitivity figures.\nRule-making will probably be scheduled in September.\nNCTA AMD ETV\nWashington was the site recently of the biggest and most successful convention\nto date of the Community Antenna operators. Appearance and participation of a number\nof high-level political figures testified to recognition of growing importance of this\nnew aspect of the industry, d,e,vVice President Johnson; Congressman Oren Harisj Sena¬\ntors Fulbright, Magnuson, Morse, and Monroney; FCC Chm. MLnow.\nNAEB President Harley participated in a panel on ETV, along with David Stewart,\nNETRC; Keith Engar, FCC; and John GuyyFowlkes, University of Wisconsin.\nHarley praised CATV operators for assistance they are already providing by\nextending ETV service in many places and assured them that \"in certain areas there would\nbe a continuing need to serve schools, colleges, and homes that cannot be reasonably\nserviced by other means of television transmission.\"\nOn June 29, the Senate Committee on Agriculture and Forestry held hearings on\na bill which would allow the REA to make loans to borrowers for the purpose of setting\nup CATV systems for educational purposes. The House has already passed the bill (H.R.\n10708).\nNEW RECEIVER FOR FOREIGN ETV\nA major break-through in overcoming the problem of suitable receivers for devel¬\nopment of ETV for mass education in newly-developing nations was announced recently.\nAID has awarded contract to Warwick Mfg. Co. of $400,000 for 1,000 twenty-three-inch\ntransistorized battery operated sets. This development is part of a large AID program\nof exploring use of telecommunications for education. NAEB officials met recently with\nAID administrators concerning a proposal for comprehensive survey of the application\nof education technology to African nations.\nSECTION 315\nDespite vigorous arguments by commercial broadcasters before the Senate Commu¬\nnications Subcommittee, there seems to be littlq^L^kelihood that the equal-time require¬\nment for political candidates will be removed. ^Suspension for 1964 elections, as\nadvocated by President Kennedy, is probable, bun permanent or wholesale elimination\nof the provision is not. Senator W&rren Magnuson (D.-Wash.) has introduced a bill\nto end the requirement for broadcasts of presidential and vice-presidential candidates^.\nSenator Hartke (D.-Ind.) is author of a bill seeking complete repeal of Sec. 315*\nFCC Chairman Minow testified that he preferred to see the section left intact."
}