{
  "id": "d1282-1",
  "text": "SAA Invites Research Papers\nThe radio-TV-film group of the Speech Association of Amer¬\nica has invited researchers to submit papers on recent studies\nin the field. June 15 is the deadline by which titles and one-\nparagraph explanations should be sent to Dr. James B. Tin-\ntera, Director, Division of Mass Communications, Wayne\nState University, Detroit, Michigan 48202.\nA submission will be considered only if the individual\nplans to deliver a synopsis of his paper at the SAA national\nconvention in New York City December 26-31, 1965. Par¬\nticularly encouraged are papers centering around the use of\nradio-TV-film in a college-level, formal course—and presen¬\ntations which, in themselves, use the communications media.\nACBB To Meet June 2\nContinuing its plan of meeting just prior to the IERT, the\nAmerican Council for Better Broadcasts will convene June\n2 at the Neil House, Columbus, Ohio.\nGeorge Steiner, coordinator of ETV, San Francisco\nState College, and member of the NAEB Instructional Board\nof Directors, will speak on “Commercial Television: The\nTeacher’s Enemy or Friend?” Roy Vogelman, news director\nfor WHA, Madison, Wisconsin, will tell “How to Make\nLocal Pundits Popular,” and Theodore F. Koop, CBS vice\npresident and director of news and public affairs, Washing¬\nton, will talk about “Whither Television Programing?” There\nwill be reactors to discuss each of the speeches.\nGerard L. Appy will be the luncheon speaker, on the topic\n“Can ETV Be the Brilliant Cultural Fourth Network?” Appy,\nformer vice president of NAEB’s TV division, is now director\nof field services for NET.\nFreda Koch will moderate a panel discussion on “Truth\nand Newscasting.”\nRegistration for the ACBB day is $1—except for IERT\nmembers and those with ACBB luncheon tickets ($3.25), to\nwhom registration is free. Checks for luncheon reservations\nshould be sent to Mrs. George Nelson, 329 N. Randall, Madi¬\nson, Wisconsin—until May 26. After that, to Dr. Leslie\nSpence, Neil House, Columbus.\nSeek Info on Dr. Von Neumann\nThe Newsletter has received a request to help in the search\nfor information leading to the discovery of film, taped lectures\nor interviews, or still photos of Dr. John Von Neumann, a\nmathematician who died in 1957. NAEBers having such in¬\nformation may call collect (Area Code 212, LT 1-3140) or\nwrite: Amram Nowak Associates, 55 West 45th Street, New\nYork, New York'10036.\nNAEBer Needs Information on\nTeacher Education by CCTV\nJames L. Laswell is working on a research project surveying\nteacher education by CCTV. NAEBers who would like to\nhelp should send material to him at 4030 West Imperial High¬\nway, Inglewood, California.\nRegion III NAEBers Meet\nSome 155 persons attended the Region III annual meeting at\nMiami University (Oxford, O.) March 21-23. The three¬\npronged program carried concurrent sessions on ITV, radio,\nand ETV.\nITV personnel heard discussions on research, the instruc¬\ntional role of TV, and special problems of ITV production.\nRadio sessions were on research, community service, instruc¬\ntion by radio, instruction for radio, and nationall radio net¬\nworking. The ETV program was divided into university sta¬\ntion programing, school station programing, state ETV net¬\nworks, and new government projects and ETV financing.\nIn his banquet address, NAEB President William G. Har¬\nley talked about the recent inclusion of educational radio and\nTV in federal education bills. Stephen Hathaway, director,\nMiami University broadcasting service, chaired the confer¬\nence.\nNHK Announces Japan Prize for Programs\nThe Japan Broadcasting Corporation is sponsoring a contest\nfor educational radio and television programs in three cate¬\ngories: primary, secondary, and for adults, including univer¬\nsity programs. Programs must last from 10 to 60 minutes, be\nfree from advertising, and have been broadcast or produced\nfor broadcasting since October 1963.\nMay 31 is the deadline for filing the first form, which is\nan application for participation. The second one, the actual\nentry form, is not due until August 31, together with the\nentry and accompanying materials.\nForms and booklets with more information are available\nfrom the ETS office, NAEB Washington.\nRegion II Members Meet\n—reported by Len Press\nMost of the states in NAEB’s Region II are in Appalachia,\nand there was considerable discussion at the recent annual\nconference about how the region might work toward an Ap¬\npalachian regional communications system. The first steps\nare to investigate the needs and media potential and to esti¬\nmate the stations and interconnection required, with costs, for\nsuch a system.\nTo explore this further, a steering committee, represent¬\ning radio and TV, was set up, with John Young (director of\nTV, WUNC-TV) as chairman. The committee met during\nthe convention and will meet again May 7 in Atlanta.\nSome 160 persons registered for the conference in Wil¬\nliamsburg, Virginia, March 19-21. John Young was confer¬\nence chairman, and co-hosts were the College of William and\nMary and Colonial Williamsburg.\nJohn Whisman’s banquet speech inspired much of the\ndiscussion about the Appalachian communications system. He\nis executive secretary of the President’s Appalachian Region\nCommission and assistant for area development to the Ken¬\ntucky governor.\nIn his keynote address, Harold Essex (president and gen¬\neral manager, commercial WSJS-TV, Winston-Salem) talked\nabout the responsibilities that go with rights. He said that if\nthe broadcaster is not to be interfered with or regulated, he\nhas to substitute self-regulation; he must impose upon him¬\nself standards of taste and concern for the public interest.\nThe implication for the noncommercial broadcaster was that\nhe has an obligation to do a good, sound professional piefce\nof work whenever he takes to the airwaves. Sloppy produc¬\ntion and inept performances do not add up to respectable\nbroadcasting.\nMemphis will host next year’s meeting, with the Memphis\nCommunity TV Foundation and Memphis State University as\ncosponsors. Howard Holst, WKNO-TV, will be chairman.\nRegion II members also established an executive com¬\nmittee for the region. It is composed of the NAEB regional\ndirectors for the divisions (with one person internally elected\nto represent TV stations if one of the national TV Board\nmembers is not from Region II) plus the host for the sub¬\nsequent year’s regional convention. Thus the executive com¬\nmittee currently consists of the regional directors for radio,\ninstruction, and individual members—plus Holt Riddleberger,\nof WEDU-TV, Tampa, and Howard Holst. The executive\ncommittee will elect its own chairman.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year. Editor: Betty McKenzie. Phone\n333-0580. Area Code 217. TWX 217-344-0970.\n2\nNEWSLETTER"
}