{
  "id": "d362-19",
  "text": "TO:\nFrank £. Schools y\nRichard 8. Hull\nFROM*\nH. J. Skornla\nDATE:\nSeptember 10, 1958 (Second item)\nYesterday you were sent, among other things, two documents to be used as starting\npoints for consideration to a Professional Advancement Proposal that might be sub¬\nmitted to Kellogg as the second of the two requests to discuss with them. These\nwere sent out by me in that tom because 1 feared no further work could be done on\nthis before X left today to Washington. I mentioned the possibility of combining\nthese, and promised later revisions.\nHere is one later revision which Harold Hill has come up with, combining the two*\nAlthough he had discussed this some with me earlier, when 2 asked him to draft it,\nthe attached draft is his, and he deserves full credit for it. If this “line\" seems\nacceptable, of course, we shall have to expand this, explaining objectives and\nprojects to be realized and recasting somewhat into proposal form •\nI might comment briefly on the numbered points in the attached:\n1 • 1 agree\n2 • X likewise fear that Kellogg won't give,money to Staff^Like coordinators. My\nearlier drafts were essentially copies appropriate sections of Ford request, for\nus to revise. We would have to have (and should expand on and mention this in\nlater draft) good consultants, since staff shortage has been one of our problems\nail along * This is one point on which I am perhaps more fearful of over-commit¬\nment than Harold is, though realistically I'd guess we're likely to be forced into\nwhat he suggests.\n3*1 agree . See attached copy of draft by Adkins of recommendations from utilization\nseminar. Some of these would need to be incorporated.\n4 * I'm less enthusiastic about this than I would be if we had a fine full-time editor\nand if I were sure that the Impression on the thousand or so people would always\nbe favorable. ! think since Kellogg has supported grants for educational journals\netc *, that we might explore getting a part of this grant allocated for editorial\nassistance rather than, or more than, to more distribution only. In this case we"
}