{
  "id": "d362-74",
  "text": "December 31, 1958\nDr. Maurice F. Seay, Director\nDivision of Education\nW . K. Kellogg Foundation\n250 Champion Street\nBattle Creek, Michigan\nDear Maurice:\nIt was nice to talk to you yesterday morning and to try to give you the additional\ninformation you needed in going over our recent requests •\nThe change in possible grant dates back to July 1 - June 30 as a fiscal year\nbasis, instead of September 1 - August 31, will be no problem, since the former\nhas regularly been our fiscal year basis. As indicated in our request of October\n23, 1958 for permission to use funds in the amount of $8,249 from the current\ngrant to permit continued operation during that two month period, there will proba¬\nbly be a balance as of July 31, 1959. If the Foundation prefers to have us main¬\ntain our current fiscal basis (July 1 - June 30), any balance can either be returned\nto the Foundation or handled in a manner to be decided later. How large it will be\nwill depend on your decision on our request to use a part of the sum to pay head¬\nquarters staff salaries until September 1, in case no new grant is forthcoming, or\nour request to use part of it for a summer seminar, in case a new grant is approved.\nIn answer to your suggestion that additional justification would be useful in ex¬\nplaining how Request No. 2 (including funds for seminars and workshops, materials\ndistribution, and international relations) would assist us to achieve self-support\nmore rapidly and effectively than Request No. 1, which excludes these items, we\nshould like to add to the statements earlier made (pp. 3-6 of the explanation in¬\ncluded as a part of Request No. 2), the attached statement, which can be considered\nas a supplement to our earlier explanations.\nThis will also confirm my telephone reactions to your question, which I believe, in\nessence was: If the Foundation could provide the amounts, or approximately the\namounts, indicated in the first (minimum) column of our Request No. 2 (omitting\nfrom consideration the International Relations item on which there is no firm deci¬\nsion but which now appears least likely of those listed to be approved), that is if\nthe Foundation could approve, for example $16,000 - $18,000 for Seminars and\nWorkshops and/or Materials Distribution, would we prefer to have the minimum\nfor both, items, or the maximum (or near the maximum) for Seminars and Workshops,\nwith nothing fear Materials Distribution. (I9m sure your question was not as"
}