{
  "id": "d362-77",
  "text": "Semingrg and Workshops\nWith seminars and workshops the NAEB has been able to bring together with\neducational broadcasters at all staff levels some of the finest minds from the\nprincipal disciplines included in American education. The mutual respect which\nhas developed among the individuals who have attended, the consultants who have\nserved, and the NAEB as the facilitating and guiding agency which has planned and\nimplemented these- meetings, has only recently begun to be realized. Many of the\nconsultants ha^e bscase individual members of the NAEB. So have many of the\nattendees. The latter are already grateful and most of them will, we feel sure,\nbecome loyal individual members. However, if they do so, it will bs because they\nfeel that the NAEB will continue to provide useful services-*»**nat out of a sense\nof gratitude for past services. The experience of national organizations generally\nconfirms the need to maintain steady service and imaginative leadership if they are\nto survive in an age when organizational, vacuums are rapidly filled.\nWe believe that basically the success of radio and television as educational\ninstruments will depend mere and more on the development of a body of such individuals\nas are reached by our seminars and workshops-—welded into a profession under the\nleadership and banner of the NAEB—or some other organization, if the NAEB fails\nto be dynamic and responsive to their needs for continued growth and development.\nThis growing group of professionals (in all but their awareness of professiona¬\nlism) will increase the need for, certainty of the growth of, and chances of success\nof, such a professional organization.\nAt present we ore confronted with the problem of conducting self-financing\nseminars. But at the present state of this profession, still a-beming, the in¬\ndividuals from whom we need to secure the sums necessary to support these seminars\ndo not enjoy adequate status in their mother-institutions to enable them to secure\nsuch funds. The NPAC has enjoyed considerable success in thi3 type of seminar"
}