{
  "id": "d1628-0",
  "text": "N-A-E-B NEWS - LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nEdited by Richard B. Hull, President\nStation WOI, Iowa State College, Ames, Iowa\nMay 31o 1948\nPEOPLE MUST BE EDUCATED CE FACE RUIN—RADIO MUST HELP\nPeople must be educated or face ruin—and radio must help with that education—Dr.\nBrock Chisholm of the United Nation said at the Ohio Radio Institute. In a speech\nto the annual banquet of the 18th Institute for Education by Radio, Chisholm who\nis executive secretary of the UN world health organization hit the high point of\nthis annual radio gathering, and kept more than six hundred people silent and\nattentive almost to the point of reverence.\nHAlthough it is painful for many people to admit it. the conscience of the next\ngeneration should be vastly different from that of this generation. Unless the\nconscience of the next generation, in enough piacesT include higher degrees of\nresponsibility toward the human race than has been found in ours, there will be\nno generation following that. There will be no human race, no human society.only\nremnants. » ..-\nDr. Chisholm pointed out that the means of destruction have outstripped the means\nof survival in the modern world. Bacteriological warfare, he declared, is far more\nof a threat than the atomic bomb. It is cheap and deadly and easy to use•\n\"The time has come1.1 he stated, ’’for the entertainment and other related professions\nto wake up to the fact that they too either must help educate people toward world\ncitizenship or ultimately face utter ruin., for themselves and everyone else,”\nHIGHLIGHTS IN THIS ISSUE\nTELEVISION HIGHLIGHTS.3\nRADIO COUNCILS ORGANIZE.-.5\nNEW EDUCATIONAL STATION ON AIR.5\nSENATOR ASKS FCC CLEAR CHANNEL DELAY— 7\nNEW STUDIOS AT KENTUCKY*S WBKY.9\n25TH BIRTHDAY FOR PORTLAND’S KBPS— 11\nWISCONSIN RADIO INSTITUTE DATES—— 14\nN-A-E-B BUSINESS PAGE.19\nNEW FCC COMMISSIONER APPOINTED.21\nOHIO RADIO INSTITUTE HIGHLIGHTS-22\nINDIANA U. RADIO DIRECTOR TO GERMAN MILITAIY GOVERNMENT POST\nDr, H. J, Skornia, director of radio at Indiana University, leaves June 5 to become\nchief of the Education and Religious Affairs Branch IA & C Division, Office of\nMilitary Government for Germany. Long prominent in U.S. Educational radio circles,\nSkornia brings unusual qualifications to his new post. As director of radio and\ntelevision at Indiana University he has conducted the ’’School of the Sky” and\nfurthered several notable research projects. Prior to assuming duties at Indiana\nhe had been a regular pre-war visitor to Germany, speaks the language fluently,\nhas a detailed knowledge of Central and Western European customs and peoples. His\n(continued next page)\nflCE-PRESIDENT TREASURER\nJohn Dunn W. I. Griffith\nWNAD, University of Oklahoma WOI\nNorman, Oklahoma Ames, Iowa\nExecutive Secretary Executive Committee\nM. S. Novik Seymour Siegal, WNYC, New York Ghaydon Ausmus, WUOA-FM, Alabama\n30 Rockefeller Plaza Carl Menzer, WSUI, Iowa Ralph Steetle, WLSO-FM, Louisiana\nNew York, N. Y. Frank E. Schooley, WILL, Illinois William Sener, KUSC-FM, California"
}