{
  "id": "d1628-14",
  "text": "“THE VOICE OF THE UNIVERSITY CF TEXAS”\nRADIO HOUSE, University of Texas, Austin, is under the able direction of Thomas D.\nRishworth. formerly public service director of NBC. Operating under the motto “to\nextend the boundaries of the campus to the borders of the state,” this production\nand teaching center is now expanding its operations. It now has a staff of seven\nincluding Gale Adkins, assistant director; David Fu. Mackey, production manager;\nAlexander von Kreisler, music director; Jack McQuire, chief engineer; Joe V. Murphy,\nscript editor, and Ruth G. Hunnicutt, secretary and script writer.\nRELIGIOUS GROUPS AND TELEVISION\nParticipants in the Religious Radio Uorkshop last month in New York were urged by\nEd. Greif, Banner & Greif Advertising Agency \"to get into television” and \"not miss\nthe boat” as religious and educational organizations had so generally done in AM\nbroadcasting. He pointed out that “the conventional church service is not functional\nfor television anymore than the conventional worship service was effective in AM\nbroadcasting.\" Grief pointed out, that as a new art, television will make its own\ndemands.\n\"MASS MEDIA AND INTERNATIONAL RELATIONS”\nA new 15-week course in \"Mass Media & International Relations\" will be offered by\nThe New School in cooperation with the United Nations Department of Public Informa¬\ntion. Course begins February 11, under supervision of Dr, Arno Huth. Lecture topics\nwill include \"Radio and International Relations\", \"Facsimile and Television\", \"The\nUN Network\", \"World University of the Air\", \"International Academy of Radjo Arts\",\nand \"International School of Radio\".\nGERMAN BROADCASTERS VISIT N-A-E-B STATIONS\nSix top German radio men from the French and American zones are in the U.S. to get\na picture \"of American'life in generalT\"and oFthe American radio system in particular.\nThe Columbia University German Broadcaster1s Project is underwritten by the Rocke¬\nfeller Foundation and arranged in cooperation with the State Department and the\nNational Association of Educational Broadcasters.\nThe visiting radio men arrived in the U.S. in April, will spend five months visiting\nU.S. educational and commercial stations, meeting with radio professionals.government\nofficials. Columbia University officials and faculty. Following their trip through\nthe states the guests will serve \"internships\"in New York City stations, observing\nday to day operation. A German stenographer accompanies them to take regular dictatio\nfor reports on returning to their own stations.\nDuring the five months of the project the men will have spent approximately six weeks\non tour of the U.S., one or two weeks with CBS in Canada, and the remainder of time\nin New York City.\nNAEB stations on the visitor1s schedule include WNYC(New York City Municipal Station),\nWSUI^Tuniv or s i ty oflowaT, VJOI 'Tlowa State College). RHA (University of MisconsinjT\nAmong othersyisitors are scheduled to visit commercial station WHO (Des Moines) and\nY^CCO(Minneapolis) •\nRepresenting the NAEB in this cooperative endeavor were Harold Engle, assistant\ndirector YJHA (Lniversity of Risconsin) and Morris Novik, NAEB executive secretary.\nFinal schedules were arranged by Columbia University, and shortness of time allowed\nfor touring the U.S, accounted for change in original schedule proposed at mid-year\nmeeting of NAIB in Columbus."
}