{
  "id": "d1628-23",
  "text": "-24-\nr\nFEDERAL C0MHUNICAT1DNS COMMISSION\nApr. 26, 1948 ~ TeDUCATIONALT May 31, 1948\n. FEDS—APPLICATIONS—ACTIONS\nFCC ISSUES WARNING ON TRANSFER RULE\nWARNING THAT THE COMMISSION \"HAS BECOME INCREASINGLY DISTURBED IN RECENT MONTHS\nCONCERNING THE APPARENT MISCONCEPTION ON THE PART OF A NUMBER OF BROADCAST LICEN¬\nSEES AND THEIR ATTORNEYS\" CONCERNING PROCEDURES TO BE FOLLOWED IN THE TRANSFER\nCF BROADCAST LICENSEES, THE ICC ISSUED THIS NOTICE IN MAY, 1948 - TO \"INSURE\nTHAT THEIiE MAY BE NO FUTURE MISUNDERSTANDING\":\nSection 310 (b) provides that no licensee shall be transferred or assigned nor\ncontrol over any licensee transferred \"Unless the Commission shall, after securing\nfull information decide that said transfer is in the public interest, and shall\ngive its consent in writing.\" It is thus clear that no transfer within the mean¬\ning of the Section can legally take place until after Commission consent has been\nreceived from the Commission to such transfer. Yet in several recent instances,\ntransfers have been consummated prior to receipt of any Commission consent or know¬\nledge of the transaction and the Commission has subsequently been requested to\napprove retroactively a transaction which has already been consummated. It is\nclear that such action is not in accord with the provisions of the Act, and actually\nresults in a period of operation of the station by unlicensed parties. The\nCommission does not intend to condone such activity in the future and it will be\nconsidered as possible grounds both for a disapproval of the transfer application\nand for the institution of revocation proceedings or for denial of applications\nfor renewal of the station licenses of the offending licensees*\nAnother and equally irregular practice with which the Commission has recently been\nconfronted, is for licensees to file with the Commission ownership reports showing\nthe sale of stock in a licensee corporation or other changes in a licensee's\nownership amounting to a transfer of control as required by Section 1.343 of the\nCommission's Rules and Regulations, and relying upon the Commission to inform\nthem if, on the basis of these reports a transfer application should be filed.\nThis practice is also clearly in violation of Section 310 (b) of the Act which\nrequires Commission approval in advance of the Consummation of any transaction\namounting to transfer of control, as well as the express terms of Section 1.343\nof the Rules. The responsibility for initiating requests for consent to a trans¬\nfer of control rests with the licensee and the individuals concerned in the pro¬\nposed transfer not with the Commission.\n•**•** ****\nTV PROGRAMMING MINIMUM REDUCED\nA graduated scale for determining minimum programming schedules for television\nstations, beginning with a twelve-hour, five-day week for new operations, was\nproposed by the Federal Communications Commission last week to replace the present\n2S-hour, seven-day week prescribed by regulations but never enforced.\nUnder the new proposal stations would maintain a regular program operating schedule\nas follows;\nNot less than two hours daily in any five broadcast days per week and not\nless than a total of twelve hours per week during the first eighteen months\nof the station's operations.\nNot less than two hours daily in any five broadcast days per week and not\nless than sixteen hours, twenty hours and twenty-four fcours per week for each"
}