{
  "id": "d1628-7",
  "text": "-8*\nn CROSS TALKn ON THE VOICE, Cf1 AMERICA\nThe State Department’s radio outlet, in perennial hot-water and political \"static”\nsucceeded again in late May in incurring the ire of Senate and House*\nSaddled apparently with the dual function of helping to wage the \"cold war\" and\nsimultaneously of creating \"good will\" the \"Voice\" has many critics and many\n\"helping hands.\"\nLatest explosion Y/as caused by a \"farmed-out\" script in Spanish, beamed to our\nLatin-American neighbors. Produced by NBC, on contract, the script allegedly defame-\nthe virtues of several American states and gave a \"distorted\" picture of .life in\nthe United States to listeners south of the border.\nNBC promptly fired the script writer, explaining that the script had not been re¬\nviewed in translation at NBC And thought State Department was checking scripts.\nLater it v/as claimed portions of the script had been eliminated causing distortion*\nSixty-four dollar question is how non-Spanish speaking Senate in a U.S. which\ndoes not listen to short-wave habitually felt so quickly the personal impact of\nthe \"slanders\" on various sovereign states.\nUproar resulted in three separate investigations of the \"Voice\" including White\nHouse, Senate and House scrutiny of the U.S* \"display window\" for overseas.\nMUTUAL MIXES WITH MADDY OF, VICE VERSA\nDr. Joseph E* Maddy, president of the Interlochon Music Camp (placed on the \"unfair\nlist\" of the ATM in 1942) reportedly tried to make arrangements with NBC for broad¬\ncasting the American Youth Symphony from Intorlophen and was refused._Turning then\nto Mutual, he received a tentative acceptance. Following these conversations. Maddy\nwas quoted as saying. \"I’m glad theio’s one network that has the courage to give\nmore importance to the law than to a union leader’s edict.\"\nMutual then cancelled negotations. and sent a heated wire to Maddy. charging that\nhe had taken \"undue advantage of the network\" and had used the network \"as an\ninstrument to further (his) controversies and intimating that in scheduling such\nbroadcasts we (Mutual) are in support of your differences with union and other\nnetworks.\"\nInterlochen Music Camp in Michigan was placed on the \"unfair\" list by James C.\nPetrillo, AFM president in 1942. At that time he banned further broadcasts from\nthe camp. Dr.Maddy, who had been active in a campaign against interference in edu¬\ncational music broadcasting was expelled by AFM.\nMISSIONARIES TO BE RADIO-TRAINED FOR OVERSEAS WORK\nRev. S. Franklin Mack, chairman of the World Radio Committee of the Foreign Missions\nConference and Rev. Everet C. Parker, director of the Joint Religious Radio Committe-\nannounced in New York that foreign radio personnel may be trained inradio for the\nforeign missions field. Religious programming techniques, it is said, will be\ntaught to missionaries who leave the U. S. and England for overseas duty.\n.PLAN TO ATTEND THE WISCONSIN RADIO INSTITUTE—JULY 5-10— AT THE UNIVERSITY OF\nWISCONSIN IN MADISON. FULL DETAILS CAN BE OBTAINED BY WRITING TO DIRECTOR\nH. B. MC-CARTY, STATION WHA. MADISON, WISCONSIN._;_"
}