{
  "id": "d1628-9",
  "text": "CHIP STATE UNIVERSITY APPOINTS VISITING RADIO LECTURER\nCarl E. George,, vice president and assistant general manager of UGAR, Cleveland\nhas been appointed visiting lecturer at Ohio State University (home of NAEB\nstation WOSU) in a course on radio station management. He will be associated with\nDr.Kenneth Cameron resident professor in charge of the course.\nU.S. Stations Show 39% SUSTAINING TIME\nDr. Kenneth Baker, NAB Research Department Director, reported the second Program\nLog Analysis study conducted in February 1947 showed U, S. radio stations de¬\nvote 41% of evening time and 39% of total time to non-commercial sustaining\nprograms.\nThe analysis defines a sustaining program as \"any uninterrupted segment of the\nstation^ time which is five minutes or more in length and from which the sta¬\ntion derives no income, except participating programs, which are here treated\nas commercial.11\n1. The survey was broken down to show sustaining time on network affiliates,\nnon-affiliates, large, medium, and small stations*\n2. All station average from sign-on to noon was 37%. From noon to 6;00 p.m,\nit was 38%. From 6;00 p.m. to sign-off it was 41%•\n3. Large stations (network) gave 33% of time to sustaining shows. Medium sta¬\ntions (network) also gave 33%. Small stations network gave 42%, All sta¬\ntions total (network) was 37%.\n4. Large independent stations showed 41% sustaining time; medium (independent)\nstations, 49%; small (independent) stations, 48%. Overall average this\nclass, 48%.\nWHCU AWARDS TO BE JUDGED BY RADIO, PRESS AND BAR\nJohn S. Knight and Eugene Meyer, newspaper publishers, CBS newsman Edward R. Murrow,\nand attorney Morris L. Ernst, will judge WHCU Press Leadership Awards for 1947-48.\nNAEB member station WHCU (Cornell University) each year gives awards totalling\n$1,700 to weekly newspapers cooperating with WHCUxs \"Radio Edition of the Weekly\nPress\", a Sunday afternoop feature which won a special Peabody citation last year.\nAwards will be made in September pt the second annual Press-Radio Dinner at\nCornell University,\nNEW CBS PUBLIC SERVICE SERIES\nCBS will present a new network feature on Wednesday from 10;30 to 11;00 p*m# (EST)\nvihen CBS newsmen in Washington will take turns in interviewing important legis¬\nlative personages each week. Show mil bo titled, \"Capitol Cloak Room\", and will\nbo under supervision of Loon Levine,"
}