{
  "id": "d1822-0",
  "text": "N A E 8 NEWS LETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nFrank E, Schooley, Editor, Station WILL, Urbana, III*\nOctober I, 1943\nFLY ADPRESSES FREC EXECUTIVE COMMITTEE\nWhen your Chairman, Commissioner Studebaker, asked me to have lunch with\nyou this noon, September 17, and to address you on educational FM radio\nSTATIONS, I TOLD HIM THAT I WOULD BE DELIGHTED TO HAVE THE LUNCH, BUT\nAS FOR A TALK AFT0RWARD, I H&O ONLY ONE THING TO SAY* wSaY IT, m WAS HIS\nREPLY-\nNOW I FIND THAT GEORGE AdASR, THE ASSISTANT CHIEF ENGINEER OF THE F.C.C.\nIS TO FOLLOW ME ON THE PROGRAM AT 2:30 THIS AFTERNOON, AND THAT HE HAS A\nGREAT DEAL TO SAY ABOUT FM AND RADIO IN EDUCATION- So I WANT TO GET MY\nWORD IN EDGEWISE HERE, AND LEAVE THE REST OF THE SUBJECT TO GEORGE.\nMY OWN SINGLE THOUGHT CAN BE BRIEFLY STATED, FOLLOWING A PROLONGED\nSTRUGGLE, VHICH BEGAN LONG BEFORE THE PRESENT FEDERAL COMMUNICATIONS\nCommission was set up, the present Commission has found it possible to\nSET ASIDE FIVE EDUCATIONAL CHANNELS THE COUNTRY OVER EXCLUSIVELY FOR THE\nUSE OF NON-COMMERCIAL EDUCATIONAL INSTITUTIONS. THOSE FIVE CHANNELS\nAFFORD ROOM FOR HUNDREDS OF FM STATIONS ALL OVER THE COUNTRY. It IS NOT\nUNLIKELY THAT EVERY SCHOOL BOARD OR OTHER EDUCATIONAL BODY WHICH SO\nDESIRES CAN FIND ROOM ON ONE OF THESE CHANNELS FOR A LONG TIME TO COME.\nMoreover, the five are among the choicest channels in the spectrum;\nTHEY IMMEDIATELY ADJOIN THE 35 CHANNELS SET ASIDE FOR COMMERCIAL FM\nBROADCASTING, SO THAT PROGRAMS BROADCAST ON THESE CHANNELS WILL BE AUDIBLE\nNOT MERELY ON SPECIAL SCHOOL RECEIVERS BUT ON MOST ORDINARY FM HOME\nRECEIVERS AS WELL. THE RULES OF THE FEDERAL COMMUNICATIONS COMMISSION\nSPECIFICALLY PROVIDE FOR ADULT EDUCATIONAL AND OTHER PROGRAMS AIMED AT\nTHE COMMUNITY GENERALLY TO BE BROADCAST OVER THE SCHOOL STATIONS, PROVIDED\nONLY THAT THEY REMAIN NON-COMMERCIAL. THUS EDUCATION NOV/ HAS WHAT IT HAS\nSOUGHT THROUGH BITTER BATTLE OVER MORE THAN A DECADE —A HOME OF ITS OWN\nON THE AIR.\nBut --AND THIS IS THE POINT I WANT CHIEFLY TO STRESS —THOSE CHOICE\nCHANNELS WERE NOT SET ASIDE FOR A&SENTEX5.. THE ETHER IS FAR TOO CROWDED,\nTHE PRESSURE FROM OTHER INTERESTS SEEKING TO USE RADIO FAR TOO GREAT, TO\nPERMIT CONTINUED RESERVATION OF THOSE CHANNELS, UNLESS EDUCATORS ACTUALLY\nGET BUSY AND FILL THEM WITH EDUCATIONAL ST AT IONSk THERE IS NO ROOM FOR\nWHAT THE RAILROAD INDUSTRY CALLS ”DEADHEADINGW. IF EDUCATION DOESN 8 T\nWANT AND DOESN'T NEED THOSE CHANNELS, ANO IF IT DOESN'T PROVE ITS DESIRES\nAND NEEDS BY ACTUALLY MAKING INTENSIVE USE OF THEM, HISTORY IS GOING TO\nREPEAT ITSELF, AND EDUCATION WILL AGAIN FIND THAT IT IS LEFT WITH MEMORIES\nOF A LOSE OPPORTUNITY.\nSome of you have memories long enough to recall what I MEA^*\nREMEMBER THAT IN THE EARLY 1920' S, '.\"HEN BROADCASTING .AS FIRST CAPTURING\nTHE ATTENTION OF THE AMERICAN PEOPLE ANO OPENING UP VISTAS CF UNLIMITED\nSERVICE IN THE CAUTE OF HUMAN ENLIGHTENMENT, EDUCATIONAL INSTITUTIONS\n—THE COLLEGES CHIEFLY BUT THE SCHOOLS AS WELL —WERE AMONG THE FIRST TO"
}