{
  "id": "d1822-4",
  "text": "NA£B NEWS LETTER\nPage 5\nOctober I, 1943\nAmericans. This Sunoav*s Treasury Hour presents Catherine Reiner, soprano,\nand Harry Davis, pianist, in a concert of works by Hayon, Schubert, Grieg,\nChopin and others.\nAt one p.m. it’s time to go to City Hall to hear another interesting and\ninformative \"'Weekly Talk To The Peo^c* by His Honor the Mayor. And Mayor\nLaGuaaoia’s weekly talks to the people have become a \"must\" on the listen¬\ning SCHEOIJLE OF MANY Nt* YORKERS. H| 3 NEWS OF ACTIVITIES IN ClTY DEPARTMENTS\nAND ON THE FOOD PROBLEM OF THI8 CITY OF SEVEN AND ONE-HALF MILLION PERSONS,\nFORM A COMPREHENSIVE WEEKLY REPORT ON HOW THE MUNICIPAL ADMINISTRATION IS\nFUNCTIONING —TYPICAL OF THE **AY GOVERNMENT IS RUN IN A DEMOCRACY.\nFolloy/ing the Mayor, it’s time for more fine music....this time from the\nSculpture Court or Brooklyn museum whence WNYC broadcasts the 'War Stamp\nConcert (this week starring David Holland, pianist, in Beethoven’s\n\"Walostein\" Sonata, and four \"kdrks of Chopin among others). At 2:30 p.m.\n8ASE8ALL FANS GET A TREAT AS WNYC BROADCASTS THE BALL AND STRIKE DESCRIP¬\nTION of the Annual City Championship Baseball Game between the New York\nCity Police and Sanitation Departments from Yankee Stadium. Thus in little\nLESS THAN THREE HOURS, \"YOUR ClTY STATION\" HAS BROADCAST AN IMPORTANT ADDRESS,\nCONCERT, AND SPORTS EVEN FROM THREE DIFFERENT BOROUGHS —THAT TO SATISFY\nANY AND ALL LI STCN I NO TASTC8 FOR VARIETY.\nMusic again at 5:00 p.m. with a distinguished pianist in a half-hour\nRECITAL ON THE KEYBOARD MASTERS1 SERIES (THIS WEEK FEATURING LOLITA CaBRERA\nGainsborg in an all-American composer program}. \"Answering You\" the BBC\nweekly trans-Atlantic discussion program between Americans and Britons on\nOUESTIONS OF THE WAR IS HEARD EACH SUNDAY AT 5:30 P.M. THIS WEEK JOHN\nKieran, noted expert and wit on Information Please, ano Jimmy Jemail, the\nInquiring Photographer of the New York Daily News ask questions on \"The\nWar ano British Customs\" which will se answered in England by Mary Adams,\nHal Block, author, and a London Studio audience.\nAt 6:30 p.m. WNYC, in cooperation with the C.C.D., presents \"Hasten the\nDay\" — THE STORY OF THE TuCKER FAMILY IN WARTIME. In THIS EPISODE DAD\nTucker tangles with a pump-tank to the amusement of his family and listen¬\ners, BUT EMERGES AS THE HERO OF THE NEWLY FORMED VOLUNTEER F|RE AUXILIARY.\nFollowing the complete late news report at 6245, the Uasterwork Hour is\nREPEATED AT 7:00 P.M.\n\"Tales of Two Cities\" the interesting and instructive C.D.V.O. drama¬\ntization at 8:00 p.m. cofpares LonoBn’s Civilian Defense set-up which\nLICKED THE BLITZ, TO THAT OF New YORK ClTY. THIS WEEK LONDON’S INDUSTRIAL\nCivilian Defense and New York’s own Building Control Center Department are\nCOMPARED —AND DRAMATIZED TO SHOW HOW EACH CAN MEET AN \"INCIDENT\". At\n8:30 p.m. Bernaro Gabriel is heard on \"Musical Oddities\" —readings,\nCOMMENTS, AND MUSICAL CURIOSITIES IN THE Y’ORKS OF THE GREAT COMPOSETS.\nFollowing the 8:45 p.m. complete ne*s roundup, the Municipal 9°?!SE?IrH£»v\nrrs&i/si ss.x\nthe Lewisohn Stadium Concerts, Goldman Band, Ballet Theatre, ano San"
}