{
  "id": "d1495-1",
  "text": "- 2 -\nRECORDING EQUIPMENT\nThe NAEB transcription equipment has this fall been making the rounds of\nmember stations for demonstrations. Carl Menzer, WSUI, is guiding its travels.\nWrite him if you want information about using it.\nHere is what Carl says: \"As to the recorder, it went to Purdue and I be¬\nlieve is now at Ohio State. From there to Northfield. We can use it here after\nthat if no one else wants it right then. One of the big things, as a result of\nthat recorder, seems to be that most every one who trys it or wants it, — buys\nor plans buying one of their own. So far as I've heard the results are, as a\nrule, excellent. Also, so far as I've been able to determine, the idea of an\nexchange of recordings is \"swell\" but just doesn't work with the present set-up\nbecause:- First, most stations purchase only enough discs for their own use and\nhave no funds to supply discs to an exchange library. Second, most stations use\nit a great deal for experimental purposes to improve their own technique and to\nmake special records for their own use, but fail to think about making programs\nthat would be suitable for exchange. If funds were available for a supply of\ndiscs to be used for exchange purposes or if each station using the equipment\nwas required to contribute a definite number of transcribed programs to the\ncause, something might be done.\"\nNow — what are your ideas about this exchange library? Are you willing\nto contribute a series of programs?\nSome stations have purchased their own equipment — but which ones? Let's\nreport on that before the next news letter goes out.\nWCAL - WLB - WTGN TRIANGLE\nWhile many were rejoicing over the October 20 decision of the F.C.C. in\nwhich it moved two educational stations from a time-sharing arrangement with an\nambitious commercial to a full-daytime assignment on a more favorable frequency\nwith an increase in power to 5 Kw., that body on November 20 suspended its or¬\nder. At present no further decision has been made.\nWCAL, St. Olaf College, Northfield, Minn., and WLB, University of Minne¬\nsota, share the 1250 Kc. channel with commercial WTCN, Minneapolis. The latter\napplied for full-time use of the channel. The two educationals were given the\ndaytime use of the 760 Kc. clear channel of WJZ by the commission without a\nhearing. Two local commercials, WMIN and KSTP, protested the full-time grant\nto WTCN on an economic basis. Hearings have not yet been set.\nWCAD VOLUNTARILY TRANSFERS LICENSE\nSt. Lawrence University, according to F.C.C. reports for November 17, 1956,\nhas voluntarily assigned its WCAD license to the Brockway Company which will\nmove the station from Canton to Watertown, Now York. The station operated on\n1220 Kc. with 500 watts power an average of about eleven hour's per week. It\nwas non-commercial but not in membership in the NAEB.\nSend your notes for the next news letter,\nand material for the exchange packet (30\ncopies) to NAEB headquarters regularly:\nHarold A. Engel, Exec. Secy.\nRadio Hall, Madison, Wis."
}