{
  "id": "d1615-1",
  "text": "Publications\n• ETV Across Canada, the second annual report of the\nMetropolitan ETV association of Toronto, has just been re¬\nleased from the association’s office at 84 Queen’s Park Cres¬\ncent, Toronto 5.\n• The third edition of Capitol and Angel Records Education¬\nal Catalog is available from the Education Department, Capi¬\ntol Records Distributing Corporation, 1750 North Vine Street,\nHollywood, California, 90028.\n• The fifth edition of Free and Inexpensive Materials on\nWorld Affairs is now ready from the Bureau of Publications,\nTeachers College, Columbia University, New York. Leonard\nS. Kenworthy lists 78 pages of books and pamphlets all cost¬\ning 65c or less.\n• The Report of the 1963 Sigma Delta Chi Advancement of\nFreedom of Information Committee takes issue with the at¬\ntitude of the Federal Government. Minnesota’s Robert Lind¬\nsay, in the November 15, 1963, issue of Static, takes issue with\nthe attitude of the Report. The 60-page SDX booklet, which\nalso criticizes state and Latin-American governments and the\nAmerican Bar Association, may be obtained from 35 E.\nWacker Drive, Chicago, Illinois, 60601. Static is done for the\nAEJ Council on Radio-Television Journalism at the School\nof Journalism, University of Wisconsin, Madison, 53706.\n• A listing of U. S. Government films makes up the second\nsupplement to the 1962-1963 Norwood Films catalog, available\nfree from 926 New Jersey Avenue, N.W., Washington, D.C.\n• Edward G. Hudon, in Freedom of Speech and Press in\nAmerica, analyzes First Amendment rights and includes the\nstory of major Supreme Court decisions regarding freedom\nof speech, press, and the movies. Public Affairs Press, 224\npages.\n• Using Current Curriculum Developments, a 118-page re¬\nport of ASCD’s Commission in that area, costs $1.75. Order\nfrom Association for Supervision and Curriculum Develop¬\nment, NEA, 1201 Sixteenth Street, N.W., Washington, D.C.\n20036.\n• Two reprints are newly available from TIO: “The Ameri¬\ncan Family and Mass Communications” by Roy Danish, and\n“A Summary of Yearly Studies of Televiewing—1949-1963”\nby Paul A. Witty. The Danish article appeared in the August,\n1963, Marriage and Family Living, the Witty article in the\nOctober, 1963, issue of NCTE’s Elementary English. Write\nto TIO, Department NA, 666 Fifth Avenue, New York, 10019.\n• The 250-page National Compendium of Televised Educa¬\ntion, Volume 10, compiled and edited by Lawrence E. Mc-\nKune for the Michigan State University Continuing Educa¬\ntion Service, is available from The University of the Air,\nKellogg Center, East Lansing, Michigan, for $4, payable to\nMichigan State University. Earlier Compendiums are still\navailable: Volumes 5 (which includes all listings of previous\nvolumes), 6, and 7 at $2, and Volumes 8 and 9 at $4.\n• An outline of ITV work among California colleges and\nuniversities is available from the Television Committee of the\nCalifornia Commission on Teacher Education. Write to Ed¬\nwin H. Lombard, Television Coordinator, Fresno State Col¬\nlege, Fresno.\n• Preparation of Inexpensive Teaching Materials (102 pages,\n$2.25) by John Morland and Planning and Producing Audio¬\nvisual Materials (232 pages, $6) by Jerrold E. Kemp, both of\nSan Jose State College, and Operating Audio-Visual Equip¬\nment (73 pages, $1.75) by Sidney C. Eboch of Alameda State\nCollege, are available from Chandler Publishing Company, 604\nMission Street, San Francisco 5, California.\n• A 240-page report, “Designing New Apparatus for Learn¬\ning,” has grown out of a conference of experts in audiovisual\neducation. Their report, which calls for a “systems” approach\nto the design and use of A-V devices, has recently been put\nin final form by the Society of Motion Picture and Tele¬\nvision Engineers under contract with the U. S. Office of\nEducation. SMPTE’s December Journal, containing confer¬\nence highlights, is available for $2 from SMPTE Headquar¬\nters, 9 East 41st Street, New York, 10017.\n• In this country over the past year there has been a 15 per\ncent increase in the number of recorded teilecourses reported\nby owners as available to others for broadcast use. These 312\ntelecourses are described in the 1964 edition of Instructional\nTelevision Materials: A Guide to Films, Kinescopes, and Video¬\ntapes Available for Televised Use. Free copies are ready al\nthe U. S. Office of Education-sponsored National Instructional\nTelevision Library, 10 Columbus Circle, New York, N. Y.\n• “Readings in Public Communications,” an 18-page bibli¬\nography for candidates for the M.S. in television and radio\nat Syracuse University, gives suggestions for readings in art,\nphilosophy, history, economics, and American culture, in ad¬\ndition to straight communications. The readings were com¬\npiled and edited by A. W. Bluem, editor of Television Quar¬\nterly, at the request of the Syracuse University Television and\nRadio Center.\n• The American Council on Education has issued its 1963-64\nPublications Catalog, available from 1785 Massachusetts Ave¬\nnue, N.W., Washington, D.C., 20036.\n• The monthly report of the Japan Broadcasting Corpora¬\ntion, What Is NHK Doing, is free from the Public Relations\nBoard, Nippon Hoso Kyokai, Tokyo, Japan.\nNews Notes\nPERSONNEL\n^ Lewis A. Rhodes, formerly director of TV at Central Mich¬\nigan University, has been appointed director of the Central\nMichigan ETV Council. He replaces Martin G. Atkins, who\nresigned to become superintendent of schools, Bridgeport,\nMichigan.\n^ James M. Pettyjohn has been appointed executive producer,\nWHYY-TV, Wilmington, Delaware. He has been associated\nwith Philadelphia TV and radio stations for over fifteen\nyears.\n^ WHYY has also announced the appointment to its board of\ndirectors of Richard P. Gousha, newly appointed state super¬\nintendent of public instruction for Delaware, and Mrs. John\nBiggs, Jr., well-known civic leader in the state and in Phil¬\nadelphia.\n^ Robert Petranoff, assistant professor of radio and TV at\nIndiana University, has been appointed to a new position with\nthe university news bureau as coordinator, radio-TV. The\nnew post was set up in response to a request from state\nbroadcasters for more news and features from the university\nprepared especially for radio and TV use.\n^ Harvey Herbst, manager of KLRN-TV, southwest Texas\nETV station, has been named associate director of radio/tele-\nvision at the University of Texas. In addition to his KLRN\nduties, he will have executive responsibilities in connection\nwith the Texas Educational Microwave Project, KUT-FM,\nclosed-circuit classroom instruction on the university campus,\nand radio and TV production for educational and commercial\nbroadcasters.\n^ Robert R. Leu has been promoted to the post of senior pro¬\nducer-director at WHA-TV, University of Wisconsin. He\nreceived his B.A. from the university in 1960.\nNAEB Newsletter, a monthly publication issued by the Na¬\ntional Association of Educational Broadcasters, 119 Gregory Hall,\nUrbana, III. 61803. $5.00 a year, $7.50 including Washington Re¬\nport. Editor: Betty McKenzie. Editorial assistant: Skip Robinson.\nPhone 333-0580. Area Code 217.\nReporters:\nRegion I —Michael Ambrosino, EEN, 238 Main St., Cambridge,\nMass.\nRegion II —Shirley Ford, WUOT, University of Tennessee, Knox¬\nville.\n—Lou Peneguy, AETC, 2151 Highland Ave., Birming¬\nham, Ala.\nRegion III —McCabe Day, WVSH, School City of Huntington, Ind.\nRegion IV —Richard Vogl, KTCA-TV, 1640 Como Ave., St. Paul,\nMinn.\n2\nNEWSLETTER"
}