{
  "id": "d1615-3",
  "text": "April 5 Army Chief Warrant Officer, retiring April I, 1964,\ndesires career in ETV. Long experience in personnel su¬\npervision and electronics, five years experience in tele¬\nvision, including studio and control room operation.\nGraduate Advanced Television Course, National Schools\nof Los Angeles. Salary $5000-$6000 depending on edu¬\ncational benefits available.\nApril 6 Mature engineer with 16 years experience in broad¬\ncasting and electronics seeks responsible position in\neducational broadcasting or allied electronic-oriented\nsystems. Will accept additional responsibilities to jus¬\ntify salary.\nApril 7 Single male, 26, M.S. expected June 1964 in Educa¬\ntional Radio and TV, taught high school speech and\nEnglish three years, desires position in college speech\ndepartment to teach, direct, produce on ETV or CCTV.\nExperience in commercial radio. Will consider all areas\nand salaries; the experience is all important.\nApril 8 Male, 29 years old, married, with oine child, is avail¬\nable in June for position as producer-director. Three\nyears commercial TV experience. Qualified in all phases\nof production, especially producing, directing, and tal¬\nent. Experience in film work and some photography. Two\nyears commercial radio experience as announcer. Has\nETV experience and one year teaching. Bolds B.S. in\nSpeech-Radio-TV. Presently working toward Masters and\nwould like to continue. Prefer West Coast but location\nopen.\nApril 9 ETV producer-director and assistant director of public\nrelations, with 5 years of experience in both radio and\ntelevision, commercial and public affairs broadcasting,\nwants position in production/management or adminis¬\ntration with university radio or ETV station. Married,\n25, B.S. in Journalism-Public Rielations-Radio-TV. Pro¬\nduced radio and TV series for ETV and commercial radio\nand TV. Documentary film writer and director. Now\nworking at major university. Midwest or West location;\nsalary minimum: $9,000.\nApril 10 Male, 28, single, seeks position as ETV producer-\ndirector, radio-TV, and/or college instructor. Background\nincludes \"live,\" film, videotape production in ETV and\ncommercial TV; talent and announcing in commercial\nradio. Rlecent M.A. with broadcasting major, technical\ntheatre plus stage crew, 4 yrs. Program planning, su¬\npervision, direction. Midwest or South, but will con¬\nsider any locale with growth potential or chance for\nfuture work toward Ph.D. Salary open. Available sum¬\nmer or September 1964, or sooner if necessary. Will\nconsider all positions, as broadcasting has become his\navocation as well as vocational interest.\nPOSITIONS AVAILABLE\n(In order to be considered through these channels, the reader\nmust be an Individual Member of the NAEB, with credentials\non file with the NAEB Placement Service. Non-members can\nsave time by sending the $10 annual dues and $5 Placement\nregistration fee at the time of inquiry.)\nA-l Radio announcer-producer. Male, Age 23-35. Pleasing\nvoice, generalized education plus a basic knowledge of\nclassical music. Applicant must enjoy fine arts program¬\ning. Salary $3000-$6000 annually plus meals and lodging\n. or equivalent. Initial salary will be commensurate with\ntraining and experience. Open immediately.\nA-2 Experienced, qualified chief engineer and/or transmitter\nsupervisor for new high-power UHF educational tele¬\nvision station in Eastern major market. Must be good\nprofessional administrator with thorough knowledge of\nFC'C procedures and systems planning. Transmitter con¬\nstruction ready to commence. Salary open.\nA-3 Instructor in radio-television. Must be able to teach\ncourses in television production, writing, directing, and\nannouncing, as well as produce and direct television pro¬\ngrams; extensive work in area of CCTV. M.A. required.\nSouthern college; position available July I.\nA-4 Qualified producer for new educational television station in\nMid-Atlantic region. Experience or training in quality\ndocumentaries or complex creative programing required.\nOpen in June. Salary $5000-$7000.\nA-5 Qualified assistant manager to be in charge of adminis¬\ntration for new ETV station in Mid-Atlantic region. Pro¬\ngram background necessary so can produce special pro¬\ngrams occasionally. Open in June. Salary $7000-$9000.\nA-6 Technician. Excellent opportunity in new communication\ncenter for person with experience in closed-circuit and\nbroadcast engineering: FM and I.O. TV. First class FCC\nlicense required; maintenance and operation; as facili¬\nties expand new installations would be required. Salary\nOPEN.\nA-7 Director of educational television at Middle Atlantic uni¬\nversity. Responsibility for general supervision and de¬\nvelopment of new CCTV system. Applicant must be pre¬\npared to select and supervise staff, plan for equipment\npurchase and use, work with faculty to promote and\nguide CCTV lectures and associated presentations, pro¬\nduce and direct programs, evaluate the effect of tele¬\nvision on class scheduling, and assist in research plan¬\nning. M.A. or equivalent. At least two years experience\nwith competency in supervision and CCTV production.\nSalary $6000-$8000 for twelve months. Contract renew¬\nable.\nA-8 Production and teaching position in communications de¬\npartment for person under forty. College teaching ex¬\nperience and commercial broadcasting experience de¬\nsired, or will consider college teaching, instructional tele¬\nvision, and/or educational radio experience. M.A. re¬\nquired. Northwest university; minimum $6000; available\nSeptember I ; ten-month position.\nA-9 Middle Atlantic college desires a Ph.D. in radio and tele¬\nvision to teach undergraduate and graduate courses and\nsupervise programs in these areas. Rank and salary open.\nPosition for September 1964.\nA-10 Producer-director. Community ETV station. Starting sal¬\nary from $5400 to $6200 per year, depending upon back¬\nground and experience. Position open in very near fu¬\nture.\nA-1 I Producer-announcer for Midwestern university radio sta¬\ntion. Salary $5200. Open immediately.\nA-12 Producer-director for Midwestern university ETV station.\nAn administrative, non-academic appointment, the po¬\nsition carries a twelve-month starting salary, with one\nmonth leave, ranging from $6300-$7000, depending on\nqualifications, beginning July I, 1964. Applicants should\nhave a Master's degree and experience in directing\neducational television programs. A person with some\ncommercial television experience and work in 16mm film\nproduction is preferred.\nA-13 Instructor or assistant professor of television-radio at\nEast Coast college. Persons applying for the opening\nshould be prepared to teach communication law and\ncourses in broadcast writing and production, and di¬\nrection. Applicants should preferably have a Ph.D., with\nsome broadcast or teaching experience, although the\ndegree requirement may be waived under the proper\ncircumstances. The salary range is $6500 to $7800.\nA-14 Associate dean for instruction of East Coast university.\nTo qualify for consideration, an applicant must possess\na doctorate and several years of successful teaching or\nadministrative experience on the college level. In addi¬\ntion, his preparation and experience should reflect knowl¬\nedge of the new methods of instruction in the areas of\nCCTV, programed instruction, audiovisual aids, etc.\nAppointment effective September, 1964. Salary range:\n$10,950-$ 12,720.\nA-15 Chief announcer for Midwestern university radio station.\nPosition consists of general announcing, some special\nprogram producing, assisting in the training of student\nannouncers, regular newscasting, and some continuity\nwriting. Starting salary $4800 per year. Paid vacation,\nhospital insurance, and group life insurance. Job begins\nJune I.\nA-16 Graphic artist for new ETV station in South Atlantic re¬\ngion. Salary $4800-$5200 to start. Position open June I.\nA-17 New ETV station needs young man as photographer. Will\ndo publicity work for station and for school system. Po¬\nsition open June I. Salary dependent upon experience\nand qualifications.\n4\nNEWSLETTER"
}