{
  "id": "d1835-1",
  "text": "NAEB MEWS LETTISH**. • • Dee* lt 1939,, . .page 2\nEVENTS AT KWSO\nKenneth E* Yeend, Director of KWSO, the State College of Washington\ncomes forth with a good bit of news of happenings in Pullman, but\nlet him speak for himself:\nflOne of the greatest sources of satisfaction to those who work at\nKWSO has been the addition of Mr* Hugo L. Libby to the. staff as\nChief Engineer* Mr* Libby for the past two years has Deen at Ohio\nState University where he received hie master53 degree* During the\npast summer he designed the new cyclotron which the Physios Depart¬\nment of that institution is building* Mr, Libby is making many\nimprovements in the technical facilities of and. bringing about\na higher quality of reproduction in all phases of our radio trans¬\nmission*\nKThe number of students from this institution who QJf® pow employed\nin commercial radio stations and networks now totals fUty-two,\nyThIs fall is the first year that KW30 hue printed a School ox the\nAir bulletin* In the past years we have had these releases mimeo¬\ngraphed; however, the increase in this particular phase of our mils.\ntogether with the greatly Increased reception of Scaool of the Ail\nprograms warranted the change*\n“Some of our staff announoere worked in oommeroial radio stations\ndurins- the summer. One announcer who worker with the Columbia\noutlet haveing the same power as KWSO reports that he ?®°®**®| J,*3'\nmore mail at CTSC on an early morning program than ne received at\nthe oommeroial station for s similar type of oroadcaet. ®J*8» :J\nthink,, is indicative of the following which KWSC is building in\nthis territory\".\nSERIES ON WQ3U\nYour J^b The World Today, and The Story of Music, three ourrenl\nSee now bein^ presented on 1080 .Ohio State diversity, are ably\nrtutunfid fA** listeners in recent publications of the station*\n5lYour Job* informs young people of the advantage® and disadvantages\nof vLioHB professions; \"The World Today\" has for its purpose the .\nx a~u.ni.»» ®* p*«*»»\nthe next mailing,\nSULZ&V PUBLICITY AGAIfl\n; ,fi*£?%£'iz ,r™SntaIw!n“”ym;|rI.\nS » fV'- - » th* WWW- -\neverything but a picture of aimer oul-e..\nThe seme issue carries a story ^°hg.jry *51*“\nWILL is broadcasting via t^^Z^n ^oFTsm Professor L. F. Audrleth\n«\"—»«*— * Vt- OM »*«- W ®«1».\nof the University Department <u Ohemiswy"
}