{
  "id": "d1891-1",
  "text": "SPOT ANNOUNCEMENTS\nRECREATION WORKERS NEEPEO\nThe American Red Cross hospital recreation workers have won the esteem\nof fighting men everywhere. They serve sn military hospitals at home\nano overseas. Their job ts important in maintaining the morale of our\nWOUNDEDo If YOU ARE BETWEEN THE AGES OF 23 ANO 45, AND ARE A TRAINED\nRECREATION WORKER OR HAVE TWO YEARS OF COLLEGE PLUS RECREATION LEADER¬\nSHIP EXPERIENCE - JOIN UP AS A RED CROSS HOSPITAL RECREATION WORKER\nTODAY o For INFORMATION, CALL OR WRITE The AMERICAN RED CrQSS. ..\nCasualties are now coming back to America by the thousands. These men\nNEED THE BEST CARE THAT THEIR COUNTRY CAN GIVE THEM. TqO — THEY NEED\nDIVERSION AND RECREATION WHILE SPENDING THE LONG CONVALESCENT PERIOD\nIN MILITARY HOSPITALS. \\f YOU ARE BETWEEN THE AGES OF 23 - 45* AND A\n1RAJJNE.P RgfiB&AI.I.PH. OR HAVE HAD TWO YEARS OF COLLEGE PLUS\nRECREATION LEADERSHIP EXPERIENCE IN AN ORGANIZATION — SIGN UP WITH\nthe Red Cross without delay. The need is urgent! The work ts interesting\nAND GRATIFYING. For INFORMATION, CALL OR WRITE AMERICAN ReD CROSS»_.\nSOCIAL WORKERS NEEPEO\nAttention! Social worker! You are urgently needed in Army and Navy\nHOSPITALS — NOW.1 OuR WOUNDED FIGHTERS NEED YOUR SKILLED HELP? ONLY,\nYOU CAN FILL THIS VITAL NEED.' If YOU ARE A TRAINED SOCIAL WORKER —\nDON * T DELAY — JOINT THE RED CROSS HOSPITAL SERVICE NOW. New OPPORTUNITIES\nAND HIGHER SALARY SCHEDULES ARE NOW IN EFFECTS FqR INFORMATION, WIRE OR\nTELEPHONE The AMERICAN RED CROSS,_ The ADDRESS AGAIN -\nAttention! Here's an important announcement! a serious shortage of\nTRAINED SOCIAL WORKERS HAS ARISEN IN MILITARY HOSPITALS - HERE ANO\nOVERSEAS. All AVAILABLE SOCIAL WORKERS ARE NEEDED — NOW! If YOU ARE A\nTRAINED SOCIAL WORKER - DON'T DELAY - ANSWER THIS URGENT NEED OF OUR\nWOUNDED men! Here IS a REAL OPPORTUNITY FOR GREAT SERVICE. In ADDITION*\nTHESE ADVANTAGES ARE OFFERED! VALUABLE PROFESSIONAL EX PERIENCE. .. .A JOS\nWHICH WILL GO ON LONG AFTER THE WAR...NOW AND HIGHER SALARY SCHEDULES\nWITH PROVISIONS FOR ANNUAL INCREMENTS AND PROMOTION. ThE NEED IS NOW!\nFor INFORMATION CALL OR WRITE THE AMERICAN RED CrQSS.,, _\nHOSPITAL WORKERS NEEDED\nWomen of America — the wounded need your help! Army and Naval hospitals\nHERE AND OVERSEAS HAVE SENT OUT AN URGENT APPEAL FOR WOMEN TO SERVE\nUNDER PROFESSIONALLY TRAINED SOCIAL CASE WORKERS. If YOU ARE BETWEEN\nTHE AGES OF 23 AND 45, A COLLEGE GRADUATE OR ITS EQUIVALENT — HERE IS\nYOUR OPPORTUNITY TO SERVE WITH THE AMERICAN RED CROSS, THOSE WHO HAVE\nGIVEN SO MUCH FOR YOU. NEW AND HIGHER SALARIES, BASED ON EDUCATION,\nEXPERIENCE AND JOB ASSIGNMENT, WITH FREE LIVING QUARTBRS OR ALLOWANCE\nWHEN QUARTERS ARE NOT AVAILABLE, ARE WAITING FOR YOU. S|GN UP NOW —\nThe NEED IS URGENT — CALL OR WRITE THE AMERICAN Red CROSS__«\nThousands of women are needed now to aid returning wounded heroes. These\nMEN NEED THE BEST CARE THAT THEIR COUNTRY CAN GIVE THEM — AND YOU CAN\nHELP. If? YOU ARE BETWEEN THE AGES OF 23 AND 45, YOU CAN SERVE AS A\nRed Cross worker in Army and Naval hospitals for years to come. Higher\nSALARIES, BASED ON EDUCATION, EXPERIENCE AND JOB ASSIGNMENTS ARE WAITING\nfor you. Sign up with the Red Cross without delay. The need is urgent.\nThe work is interesting and gratifying! For information, call or write\nthe American Red Cross _>_•"
}