{
  "id": "d1705-1",
  "text": "Fourth *onr—• #XLL, BBAA, WOI, TOC, W8UX* KFBU, KSAC, WLB, KFSX, WCAL,\nXFHU, .TOT* WCAjr, KFJM, WCAT, TOP, WHBY, WHA, '-'HAl), KFDY\n20 stations. 6,16 quota unit0.\nFifth « — KBOW, KQW, FOB, KOAC, KBPS, KGY, TOO\n7 stations, 5,17 quota units.\nTotal quota unit® for United States 24,06 or 6,01$ of the total of 400 units\nestablished by a General Order of the Commission as the total for all classes of\nstations.\nFour stations in the above list are not college and university stations, but are\nclassed as educational stations.\nmsBBsni? asp ykaku buss\nSecretly Brackett has forwarded statements to all college and university\nstations together with a letter askir^ that all stations remit promptly. The\nConstitution adopted last June set the dues at $10. At no other time in the history\nof radio in education has it been so important that the educational stations be\nrepresented in an association. The many developments, particularly in connection\nwith the National Committee, will make it well worth your while to have your station\nin the membership.\nANNUAL K3STIN0\nA blank has been included in this bulletin asking for a vote of the membership\nin regard to the time and location of the Annual Keating. It will be remembered\nthat the meeting last year was held at the same time as the Ohio State University\nInstitute for Education by Badio, and that over twenty~five college stations were\nrepresented, a most successful meeting resulting. The Ohio State University Institute,\nto become an annual affair is scheduled for the one week of ISay 25, in Columbus,\nOhio, and it is the belief of several members of the Executive Committee that this\nwould again be the best opportunity to obtain a representative group. It is hoped\nthat you will give your immediate attention to the blank enclosed and plan to\nattend the meeting wherever it is to be held. The Executive Committee will make the\nfinal decision when the blanks are returned.\nRESEAROH PROJECTS\nYour President has written to each station asking for information regarding\nresearch project® completed or in progress in connection with education by radio.\nThe National Committee expects to proceed with several projects immediately, and\nin order that no effort would be duplicated, desires to know what individual stations\nh&ve done. If you have developed a system of obtaining reports from listeners or\nmade a study of any problem that you have met, please send a brief report at once,\nin order that it auy be presented at the Karch 5 meeting in Washington. This\nincidentally will be a very good chance to place the work of individual stations\nbefore this National Commifctse, which to date is not very well informed what each\nstation is doing."
}