{
  "id": "d1705-4",
  "text": "-5-\n;,,I imagine that this instance mil become rather embarrassing to the Federal Radio\nCommission in endeavoring to answer question 12 submitted by Sbnate Resolution No.\n129, to the Federal Radio Commission which asks* (12) In what cases has the Commis¬\nsion given licenses to commercial stations for facilities applied for by educational\ninstitutions?\n\"This is cehtainly most timely information and it is of very particular interest at\nthis time. If vou have not already done so, I wish yon would send your special rush\nbulletin and copy of Director Harding’s letter to Dean Vogt, to Dr. Joy Morgan,\nChairman, National Committee on Education by Radio at 1201 Sixteenth Street, N.W*,\nWashington D. C.”\nPlease note the two letters I received this morning, one from Mr. J. C. Jensen,\nNebraska Wesleyan, and the other from Mr. Carl Menzer, University of Iowa. Both\nsubmit propositions of great interest. Kindly note them carefully and send react¬\nions relative to both letters.\nFROM MR. J. C. JENSEN* nI have been intending to write you for some time regarding\nthe practicability of a ’technical exchange.1 Vihat are the college stations going\nto do about General Order No. 116? Are we all going to spend from $700 to $2000\nwith one of the big commercial companies to meet this order, or can we pool our\ncommon interests and devise apparatus which will meet the requirement and save us\na lot of money?\n\"The power unit giving 100^ modulation which we added to £ur transmitter last summer\ncost less than one-half as much when built in our own shop as the lowest figures we\nreceived from commercial firms, and it is doing its work admirably, and is certainly\nbetter constructed than some commercial jobs I have seen. Who has a good circuit\nfor a microphone amplifier using the new tubes? What tubes are being used as modu¬\nlators and what results have been obtained? What is the best amplifier for use in\nconnection with a condenser microphone? These are some of the questions that all\nof us are interested in. Why not send out a request for answer to these questions\nand have our Association bear the expense of mimeographing the replies and sending\nthe copies to all members?\"\nNOTE: Many of us have discussed the possibility of a technical exchange for months.\nThere is no reason why such an exchange cannot be made a success. IT MEANS A VAST\nSAVING TO YOUR STATION. WE NEED YOUR HELP. KINDLY GIVE US FIFTEEN MINUTES OF YOUR\nTIME TO CONSIDER THE PROPOSITION SUBMITTED BY MR. JENSEN.\nFROM MR. CARL MENZER* \"This refers to your special bulletin of January 29th» As\nyou perhaps know station TSSUI has received orders to confine its broadcasting periods\nto one of four plans submitted by the Commission. Such a schedule would disrupt our\nsemester’s work and we therefore objected to such an order. We have succeeded in\nobtaining a continuance of our schedule until March 1st, the expiration date of our\npresent license, and meanwhile expect to do everything possible to obtain permission\nto continue on that schedule.\n\"I am wondering whether the Association could bring any pressure to bear which would\nrelieve the situation which I understand is true in the case of other broadcasting\nstations as well as our own.\"\nNOTE* Is your station facing the same situation as the University of Iowa station,\nWSUI? The suggestion above from Mr. Mender should stimulate discussion on your pert\nas to what the Association can do to relieve the situation that confronts Iowa State\nand other institutions at the present.\nT. M, Beaird? Executive Secretary\nfor Association"
}