{
  "id": "d1632-11",
  "text": "FCC ASKED TO CLARIFY POLITICAL BROADCAST RULINGS IN PORT HURON CASE\nA large segment of the radio broadcasting industry asked the Federal Communications\nCommissidn to re-examine its policy on political broadcasts.\nFirst Ruling\nThe Commission said early this year that a radio station may not censor the content\nof a political broadcast and that, as a result, no station may be sued for libel\nor slander as a result of such a broadcast. This immunity does not extend to the\nperson who makes the speech.\nThe FCC policy declaration was made in an announcement that the Commission proposed\nto renew the license of Station YiHLS. Port Huron. Michigan.\nBackground\nThat station two years ago cancelled all broadcasts in connection with a city\nelection after one speech contained material which was held objectionable.\nFCC said this was censorship, but it renewed the station license because there had\nbeen no previous clear-cut statement of policy on the subject.\nTrade Reaction\nMany broadcasters promptly asked the Commission to go ahead and renew the 1YHLS\nlicense, but to reserve a general policy statement until the Commission could hold\npublic hearings and'receive points of view from all quarters. They said the matter\nwas too broad to be disposed of on a single set of circumstances affecting one\nstation.\nFurther Study Asked\nArguing for further study today, Don Petty, General Counsel of the National Associ¬\nation of Broadcasters, took direct issue with FCC’s opinion, asserting there had\nbeen no censorship by YffiLS. Said Pettys\n’’Broadcast licensees are entitled under the law to refuse to permit the broadcast\nof defamatory and other unlawful matter and are not freed from liability under state\nand federal law for such broadcasts.11\nTexas Testimony\nRepresentative Lindley Beckworth of Texas appeared on behalf of the attorney General\nof Texas, which has very strict libel statutes. Beckworth said that if the\nCommission ruling were permitted to stand, it would subject Texas stations to suits\nwhich would destroy their solvency. Congress did not intend to permit the unlimited\nand unbridled use of the airv/ays for dissemination of libelous, scandalous and\nobscene matters in political broadcasts. This certainly could and would follow\nas a natural result of the proposed decision in this case.”\nSimilar arguments were offered by attorneys for a dozen individual stations\nscattered across the country*\nNo one appeared to argue in favor of letting the policy statement stand.\nThe Commission took under advisement the questions of separating the policy state¬\nment from the renewal action and of holding public hearings."
}