{
  "id": "d1632-13",
  "text": "-14-\nCHANNEL ASSIGNMENTS BEGIN AT GENEVA\nTwenty-three delegates of the five-power High Frequency Broadcast Frequency Alloca¬\ntion Board are now beginning the third month of their deirberations at Geneva.\nActual world-wide assignment of channels to stations, have begunT\nThe United States supplied most of the material and technical data. The work was\ndivided into three parts? 1) frequency requirements analysis! 2) propagation data;\nand 3) sharing possibilities. They are trying to fulfill the requirements of\nseventy-two countries! the earth has been divided into sixty-three areas. A set-up\nsimilar to the FCC method has been established.\nWhile the analysis shows, from the list of requested frequencies, that the_United\nStates is placed in seventh place in the world, the U. S. requests are confined\npurely to international broadcasting, while many other countries have requested low-\npower use of the frequencies for domestic and tropical broadcasting.\nRussia, outstanding proponent at Atlantic City for the establishment of a priority\nsystem for allocation of channels, reintroduced its proposal that frequencies for\ndomestic use should have precedence over the international channel use. Likewise,\nthe French claim priority of use for Colonial services but did not propose commer¬\ncial broadcasting be given last priority. Both the Soviet and French priority\nproposals have been opposed by the United States.\nThe controversial method of voting on important issues was resolved on a majority\nbasis, as at Atlantic City, rather than according to the Russian proposal that all\naction be by unanimous decisions. The Soviet proposal which would in effect have\nprovided a veto power was defeated 4-0.\nRADIO KEYED TO CORRESPONDENCE LESSONS\nA series of weekly broadcasts over WHA, WLBL, and the FM stations of the State\nRadio Council follows the units in a correspondence course offered by the University\nof Ylisconsin Extension Division. The lectures come by radio, and students enrolled\nmay earn formal credit by completing the requirements.\nn0ur Children”, as the radio series is called, is broadcast by Dr. Robert West of\nthe Speech Department. It features many interesting program devices such as inter¬\nviews, tape-recorded discussions in the field and studio demonstrations. Among\nthe broadcast unit titles are ”0ut of the Mouths of Babes”, ”The Value of Play”,\n”Sex Education for our Children”, and \"We, the Parents.\"\nPersons wishing to earn formal credit for their listening and study efforts enroll\nfor the course through the Extension Division. A bibliography of readings is pro¬\nvided to those who request it. Most listeners tune in for their own satisfaction\nand do not desire to earn credit.\nWISCONSIN ANDQUECBS RADIO INSTITUTE DATES\nThe fourth annual Public Service Radio Institute at the University of Wisconsin ?/ill\nbe held at Madison from July 5-10, 194&, H. B, McCarty, director, has reported.\nThis working conference will bring together leaders in various phases of the radio\nart who will discuss with broadcasters, station managers and organization radio\nchairmen the practical aspects of community service broadcasting.\nThe Institute meetings will be held in University of Wisconsin studios and conference\nhalls. Living accommodations are to be available in lake-shore residence halls at\nnominal rates. A recreational program is provided for those who wish to combine\na vacation with Institute attendance. Inquiries should be addressed to'H.B. McCarty,\nRadio Hall, University of Yasconsin, Madison, Wisconsin."
}