{
  "id": "d1632-17",
  "text": "MUTUAL*S ALLEN VIEWS TELEVISION\n-18-\nTop radio executives agree that television will not ruin radio as a commercial medium.\nBut there is a note of warning. One executive.. .Mutual*s board chairman Lewis Allen\nY/eiss...says radio will have to do a better job to meet the challenge of television\nas the new medium becomes increasingly important. Mutual's Weiss points out that\nthere is not enough trained personnel to operate existing television stations\ndespite intensive schooling in electronics during the war, while NBC Television\ndirector, Norman Kersta says that television can start a new gold rush like that\none one-hundred years ago.\nABC MARK WOODS HAS CONFIDENCE IN AM\nOf some 75 station owners \"whose stations are equipped for both AM and FM operations,\nonly a few are willing to say that FM eventually will supplant AM broadcasting. As\npresident Mark Woods of ABC puts it, \"AM is a vigorous medium, assured of long\nlife.\" Woods also thinks television will stand on its own merits without destroy¬\ning any other system.\nSTANTON OF CBS SAYS TV AM) AM PA1.TNERS\nPresident Frank Stanton of CBS agrees with Woods. He says that the established\nincome of present radio facilities is necessary to support television, Stanton\nbelieves that television offers a specialized medium to advertisers whose products\nare best presented pictorially.\nNAEB SECRETARY NOVIK ASKS FREE HAND FOR COMMUTATORS\nMorris S. Novik, NAEB Secretary, says news analysts and commentators belonging to\nthe American Civil Liberties Union wants a free hand in what they say.\nTheir statement to this effect was presented to the NAB at the Los Angeles conven¬\ntion when Novik appeared as spokesman for the organization on civil liberties.\nThe Committee said it \"welcomes the clear distinction that the NAB would have all\nbroadcasters make between news reporting and news analysis\"in the Standard of\nPractice authorized at the convention.\nBut at the same time it \"noted with alarm and dismay the suggestion that stations\nand networks should exercise control and supervision of content, format and\npresentation of news commentaries and analyses.\"\nThe statement continued;- \"The function of the commentator and analyst is to pre¬\nsent vigorous, varied, and responsible interpretation of the news, and the broad¬\ncasting industry should not supervise or control the material put on the air by\nthose members of the nev/s staff who have been chosen for the express purpose of\nexpressing opinion.\"\nSigners of the statement included Chairman Thomas R. Carskadon of the ACLU Radio\nCommittee| Vice Chairman James L, Fly; H. V. Kaltenborn and a dozen other nev/s\ncommentators or analysts.\nEDITORIAL NOTE\nM. S. Novik, NAEB Secretary, appeqre4 before the FCC in the henring on editorializ¬\ning by broadcast licensees last Marclj with a very bqsis statement of belief which\nunderlies the foregoing. A summary qf Novik*s testimony appears o*1 ^e business\npage of the NEWSLETTER."
}