{
  "id": "d1632-19",
  "text": "WISCONSIN RADIO INSTITUTE\n-20-\nN-A-E-B. BUSINESS PAGE\nHarold McCarty, director WHA (University of LJisconsin) is having another summer\ninstitute July 5-10. Your editor found this one of the most worthwhile and valuable\nsessions he ever attended. Heartily recommended to all who can come.\nTO BUILD OR NOT TO BN IIP—FM?\nEnclosed in the mailing of this issue is a statement by Wayne Coy, FCC Chairman.\nThere is also a story in connection with the new Office of Education FM bulletin.\nPoint of all—in case you did miss it—YOU CAN'T CONTINUE TO DELAY FM CONSTRUCTION\nIF YOU H..VE A PERMIT. IF YOU INTEND TO APPLY FOR AN FM FREQUENCY, YOU MUST DO SO\nBEFORE TOO LONG. EDUCATION HAS 20 CHANNELS IN THE FM BAND. IT IS PURE AND SIMPLE\nSEIF-DELUSION TO IMAGINE THOSE CHANNELS WILL BE WAITING THERE FOREVER, IF EDUCATORS\nDO NOT USE THEM AT A FASTER RATE.\nRELIGIOUS STATIONS. NAEB MEMBERSHIP. AND THE FM EDUCATIONAL BAND\nSome of our members feel very strongly that the educational FM band should be reserved\nfor educational institutions which are of unquestioned standing and accreditation.\nThey also feel some licenses granted to religious schools which definitely are not\naccredited should be questioned. NAEB central office requests opinions and reactions.\nNETHERLANDS INFORMATION BUREAU PLATTERS\nSometime ago the Netherlands Information Bureau vjrote they would earmark 12 sets\nof the transcribed series, \"Holland Calling.\" If you aren't already using this\nand want it, please check with NAEB central office, so it can clear correspondence\nwith the Inf. Bur, If you are using the series, let the office know.\nFORMAL THANKS FROM INSTITUTE DIRECTOR AT OHIO RADIO -SESSION\nDr. Keith Tyler, Institute director wrote to express his \"deep appreciation\" for\nNAEB cooperation in closing session of institute. He regarded it as a \"most\nsuccessful meeting\". Odegaard, he thought, did an excellent job, and the panel\ndiscussion he thought \"was very much to the point.\"\nGERMAN TOUR OF NAEB STATIONS\nSecretary M* S. Novik reports he will have further data on this tour available\nvery soon. A story elsewhere in the Newsletter gives the general outline, but\ndue to the fact all arrangements ?/ere made finally by the Travel Bureau of Columbia\nUniversity, some change occurred, after the announcement of NAEB stations to be\nvisited was made at Columbus in the mid-year meeting.\nMINUTES OF MID-YEAR MEETING CF NAEB\nUnder separate cover complete minutes and an outline of discussions and conclusions\nreached at the mid-year NAEB meeting will be sent to members. A lot of ground was\ncovered and much of the material is too detailed for inclusion here. From most\naspects it was a highly successful meeting.\nMAKE YOUR PLANS NOW FOR ATTENDANCE AT THE ANNUAL MEETING OF NAEB AT THE UNIVER¬\nSITY CF ILLINOIS IN URBANA, ILLINOIS, HOME CF STATICN WILL. MEETING WILL FOLLOW\nSCHOOL BROADCAST CONFERENCE IN CHICAGO. JOE WRIGHT AND FRANK SCHOOLEY PROMISE\nHOSPITALITY PAR EXCELLENCE, AND WE HOPE TO PERFECT FINAL PLANS FOR REGIONAL\nORGANIZATION AND MANY OTHER THINGS WITH THE AID OF JOHN DUNN, M. S. NOVIK, AND\nTHE SIX DISTRICT CHAIRMEN."
}