{
  "id": "d1632-2",
  "text": "TELEVISION HIGHLIGHTS\nSIXTEEN STATION NETWORK\nNBC reports it will have a 16-station network stretching from Missouri to Massachu¬\nsetts by the end of 1948. Major links in chain in central states are KSD-TV(St.\nLouis), VJWJ-TV(Dotroit), and VJTMJ-TV (Milwaukee)—all due to be operating by October.\nNineteen Fifty-two will see NBC television with 90 stations coast to coast.\nTELEVISION SET PRODUCTION UP—RMA\nThe Radio Manufacturer's Association reports its member companies produced more than\n118,000 television receivers during the first quarter of the year. This is nearly\nthree times as great as for the same quarter last year—and about two-third of the\npast year’s output. FM set production was 438,000, and total, set production, in¬\ncluding television was 4,352,000.\nFCC ELIMINATES CHANNEL ONE\nIn May, the FCC announced a final decision taking channel one away from television\nbroadcast and giving it to civilian mobile services. The new order, effective June\n14, eliminates all sharing of TV channels with other radio services. At the same\ntime the FCC outlined a tentative reallocation of the remaining 12 TV channels. New\ndistribution is expected to have little affect on large metropolitan areas where TV\noutlets are now under construction. Changes are designed to give TV to many small\ncommunities now without them,\nPETRILLO LEACHES TV AGREEMENT i-ITH NETS\nA six-months agreement on wage rates between AFM and networks is now in effect. Musi¬\ncians who play for TV networks will receive three-fourths the rate for standard\nradio network programs (^152 to ^192 per week in N.Y.). Those who play for local TV\nbroadcast will receive two-thirds local rate. The union—lifting a previous ban—\nwill permit TV to carry music that is incidental to some outside event being broad¬\ncast, such as a prize fight or basketball game--with no extra fee. »\nARMSTRONG GRANTED EXPERIMENTAL TV FACILITIES\nThe FCC has granted Major Edwin H, Armstrong, inventor of FM, permission to construct\nexperimental TV facilities at his Alpine, New Jersey FM station. The TV will operate\non the 480-500 me. band with a power of 50 kw. Armstrong says he will use the facil¬\nities in the development of a \"new and better TV system,\"\nMOTOROLA K SXY SAYS TV SALE HAS NOT HURT RADIO SET SALE\nPaul Galvin, president Motorola, Inc., says TV set sale.has not hurt radio set sale\nwith exception of higher priced console models. His firm, which makes both radio and\nTV receivers, believes industry must return to \"shirt-sleeve\" selling. He is optimis¬\ntic over public response to TV sets. Industry is now turning out 50,000 sets per\nmonth, and is still unable to keep up with demand.\nEDUCATORS WONDER IF THEY'VE MISSED THE BOAT ON TV\nAt the Ohio Radio Institute, many educational station operators were wondering \"out\nloud\" if their failure to apply for and plan for TV facilities might not find them\nlater in a difficult position. High cost and uncertainty of future developments were\ngiven as reason for delay. To date only 5 institutions are regularly using or plan¬\nning TV. The State University of Iowa has made application; Iowa State College has\na CP; University of Michigan is producing programs which are fed to a Detroit station\nKansas State College is operating an experimental TV unit, and the American Univer¬\nsity (Wadiington, D,C.) is producing and feeding programs to a net TV outlet."
}