{
  "id": "d1632-20",
  "text": "FCG ASKED TO INVESTIGATE KMPC\nDirectors of the National Association of Radio News Directors have asked the\nFederal Communications Commission to investigate charges of alleged unethical\nnews handling against a Hollywood rad?.o station owner.\nThe charges were filed with the FCC against G. a, Richards, owner of Station\nKMPC of Hollywood by the Radio News Club of Los Angeles. Three of the station’s\nnews staff members were discharged in an alleged dispute over the station’s news\npolicy.\n; G. A. Richards, President of Radio Stations W JF., WGAR and KMPC, said\n. today that Frank E. Mullen' and William G. Siebert have boen elected\nas directors of UJR,\nj Mullen will succeed Richards as president of the three stations July 1.\nRichards said his election as a director was a \"logical development\"\n| of Mullen’s promotion.\nThe FCC announced several weeks ago that the American Jewish Congress and the\nHollywood Writers’ Club had filed complaints of Bias in handling news broadcasts\nby the Radio Station. The FCC launched a formal investigation. Two other\nstations owned by Richards, WJR at Detroit, and WGAR at Cleveland, also were\nto be investigated by the Commission. The investigation is now in progress.\nNEW FCC COMMISSIONER APPOINTED\nPersonable and politically-wise, Miss Frieda B, Hennock, New York corporation\nlawyer, became the most discussed personality in radio in May, when President\nHarry 5. Truman nominated her for a post on the Federal Communications Commission.\nMiss Hennock, little knov/n to the radio industry but widely known in New York and\nWashington Democratic circles, was admitted to the bar in 1926 after graduating\nfrom the Brooklyn Law School. As Now York’s youngest woman lawyer she handled\ncriminal cases and practiced law alone until 1941, when she joined Choate,\nMitchell and Ely, specializing in corporation lav/.\nThe President’s nominee for the FCC declines to comment on radio until her\nnomination is confirmed by the Senate,\nLOWELL INSTITUTE COOPE: ATIVE BROADCASTING COUNCIL\nThe Lowell Institute at 28 Newbury Street, Boston 16, Massachusetts, consisting\nof seven cooperating institutions—Boston College, Boston University, Harvard\nUniversity, Lowell Institute, M.I.T., Northeastern University, and Tufts College\nhas accomplished successfully what the \"professionals\" say cannot be done-\neffective, stimulating broadcasting of courses of study on the air. And what’s\nmore they have a Hooper, an effective audience. Parker Wheatley, director of\nthe Institute, has a very fine summary of the operation, objectives, techniques,\noutlets and cooporators in ditto form, which may be available for distribution."
}