{
  "id": "d1632-22",
  "text": "-23-\nPEOPLE AND ITEMS\nHigh points of conference was the address by Dr. Brock Chisholm, UN Health and\nWelfare Organization—notable was tribute of Institute in giving retiring\nCommissioner Clifford Durr of the FCC, a life-time membership in the Institute...\nvaluable were the clinics for educational and commercial station programming..,,\nworthwhile and intriguing the television session.\nRecordings exhibition bigger and better than usual with yeoman duty by the judges...\nsignificant the growing radio council interest..and the politics concerned there¬\nwith. . .bewildering the medley of meetings of different groups with different names\nwho chose the Institute as a gathering point for mid-year or annual meetings—\nNAEB, AER, and scores of others.\nN-A-E-B MID-YEAR MEETING\nMore than 40 educational broadcasters, representing each of the six NAEB regions in\n30 states were present at the mid-year meeting and luncheon of the National Associ¬\nation of Educational Broadcasters.\nReports of effective growth and achievement from new educational stations in\nCalifornia, Michigan, New York, Oklahoma, and Ohio highlighted the meeting. The\npresent organizational plan originated by Vice-President John Dunn was heralded,\nas were program achievements at WKAR(University of Michigan). Indiana University’s\n’’School of the Sky,” KUSC (University of Southern California), NNYC (Municipal\nBroadcasting System, New York City), and WBQE (Cleveland Public Schools).\nGuest of honor was Clifford J. Durr, retiring FCC Commissioner, long-time friend\nof educational and public service radio, who was paid tribute as being ’’what\nan ideal public servant should be, but seldom is.\" Special guests included\nDr. Franklin Dunham, U. S. Office of Education, Charles Clift, assistant to\nCommissioner Durr, Major Bogner, Armed Forces Radio, Ear Department.\nAnnual meeting was scheduled for October at the University of Illinois in Urbana,\nhome of NAEB station WILL.\nCLOSING SESSION—NAEB AND AER\nElosing Institute session was jointly sponsored by the National Association of\nEducational Broadcasters and the Association for Education by Radio, drew a sur¬\nprise attendance of more than 300 in the final afternoon of the conference.\nMain speaker was Dr,Peter Odcgaard, president of Reed College, Portland, Oregon,\nand former Assistant Secretary of the Treasury who described the role of \"Organized\nEducation and the Citizen” in striving for \"Serious (worthwhile)Radio in America.\"\nPresiding at the meeting was William Levenson, AER president. Following the main\naddress a panel on \"Ways and Means to Implement Serious Radio\" presented a variety\nof points of view all aimed atpyactic^l and effective methods of educational sta¬\ntion programming and operation.\nPane}, participants included Edwin F. Holman, Director WB0E(Cleveland Board of\nEducation) ; James MaqAndro?/, director WNYE(New York Board of Education); Harry J.\nSkornia, director of radio (Indiana University)j Parker Wheatley, director Lowell\nCooperative Broadcasting Qounoil Poston; Seymour N. Siegel, director iJNYC & WNYC-\nFM (Now York' City)j nnd William H. Seher, director KUSC-FM (University of So.Calif.)\nSpeaker's points and panel discussion were summed up in closing remarks by Richard\nB. Hull, president National Association of Educational Broadcasters and director\nstation WOI (Iowa State College)."
}