{
  "id": "d1632-25",
  "text": "-26-\nFor Construction Permit\nNEW - University of Minnesota, Minneapolis» Minn. - Construction permit for a new\nnon-commercial educational broadcast station to be operated on 91*9 me., Channel\n220, power of 3 KW.\nFor Construction Permit\nNLSU- Board of Supervisors of the Louisiana State University and Agricultural and\nMechanical College. Baton Rouge. La. - License to cover construction permit (BPED-53,\nas modified) which authorized a new FM broadcast station.\nFor Modification of CP\nVIKAR-FM- Michigan State College. East Lansing. Mich. - Modification of construction\npermit (B2-PED-69, as modified) which authorised a new FM broadcast station, to\nchange transmitter site and make changes in antenna system.\nFor (New) Construction Permit\nNEW - Iowa State College of Agriculture and Mechanic Arts. Ames. Iowa (P.0.Amesilowaj\nConstruction permit for a new ST link broadcast station to be operated on 920-960\nme,, power of 10 watts, emission special for FM, and unlimited hours of operation.\nFor (New) Construction Permit\nNEW- Santa Monica School Board, Santa Monica. Calif. (P.0.. 1333 6th St.J-Construct-\nion permit for a new remote pickup broadcast station to be operated on 30.82, 33*74,\n35,82, 37.98 me., power of 25 vratts, emission A3, and hours of operation in accord¬\nance with section 4.403.\nModification of CP\nWJUN-Junto. Inc., Philadelphia, Pennsylvania - Modification of construction permit\nll-PED-63 as modified^ whiefr authorized a new FM non-commercial educational broad¬\ncast station for extension of completion date.\nFor Construction Permit\nNEW- Tacoma School District No. Ten, Tacoma, Lash,, (P.0. Box 1357, Tacoma, Wash,j-\nConstruction permit for a new non-commercial educational (FM broadcast station to\nbe operated on 91.7 me., Channel 219, power of 1 KW.\nFor Construction Permit\nNEW-Providence College, Inc., Providence. R.I. (P.O. River Avenue at EatonL_StjL)_-\nConstruction perrhit for a new non-commercial educational FM broadcast station,\nto be operated on frequency to be assigned by FCC ERP 3.0S KW *\n**** **4v*\njACTIOis'TAl.iPLITUDE MCDULATI ON)' ^COLLEGE. \"UNIVERSITYT AM)\"\" INSTITUTIONAL]\n1240 KC\nThe Commission also announced a DECISION granting application of ALABAMA-GEORGIA\nBROADCASTERS, INC. (BP-5300; Docket 7953), for a new station at Eufaula, Ala.,\nto operate on 1240 kc,, 250 watts, unlimited time, and denying application of\nANDREW COLLEGE BROADCASTING CO., for the same facilities at CUTHBERT, Ga. (BP-5370$\nDocket 7954)."
}