{
  "id": "d1632-26",
  "text": "-27-\nEctioms (frequency modulationV COIISGS and university\nTo Replace CP\nState of Wisconsin State Radio Council, Delafield, Mis.- Granted application to\nreplace CP for a non-commercial educational FM station at Delafield, with studios\nat University of Wisconsin campus at Mac'ison, specifying completion of construct¬\nion date six months after grant, (BPED-94)\nDesignated for Hearing\nState of Wisconsin State Radio Council, Madison, Wis,-Designated for hearing be¬\nfore Commissioner Coy on May 28 at Madison, His,, application for construction\npermit for new station, to determine whether antenna site and construction proposed\nin application would constitute an undue hazard to air navigation (BP2D-89)\nRequest to Vacate CP\nState\nvVEKR-Penna. State College W College, Pa.- Granted request to vacate construction per¬\nmit and dismissed application (BPED-51) without prejudice to its filing a similar\napplication in the future,\nChannel Change\nVeterans Vocational School. Troy, N.Y.- Authorized assignment of Channel 217 (91.3\nme.), to this applicant, in lieu of previous assigned Channel 211. (BPED-92)\nCP Modification\nVJHA-FM-State of Wisconsin, State Radio Council, Macison. kisc. - Granted construct¬\nion permit for non-commercial educational station to change frequency from 91*5\nme. to 88.7 me. (BPED-95).\nModification of Construction Permit\nWTDS- Board of Education. Toledo City School District, Toledo. Ohio - Modification\nof construction permit (B2-PED-37, as modlfieciy^hich authorized a new noncommercial\neducational broadcast station for extension of completion date.\nModification of Construction Permit\nWTHS-Technical High School, Dade County Board of Public Instruction, Miami, Fla.-\nModification of construction permit' (B3-PED-79, as modified) which authorized a\nnew non-commercial educational broadcast station for extension of completion date.\nModification of Construction Permit\nUFIU- The Trustees of Indiana University, Bloomington, Ill. - Modification of con¬\nstruction permit (B4-PED-29, which authorized a new non-commercial educations broad¬\ncast station) for extension of completion date.\nPLOTKIN HEADS FCC DIVISION TEMPOEAPJLY j\nThe Federal Communications Commission today announced that Harry M. Plotkin,\nAssistant General Counsel, has been designated to temporarily head the Law Depart- j\nment Broadcast Division. He will serve until September 1, by which time it is\nexpected that a permanent appointment will be made to fill the position. :\nMax Goldman, Assistant Division Chief of the Litigation and Administration Division,\nwill serve as Acting Assistant General Counsel of that Division until Mr. Plotkin\nresumes his regular post."
}