{
  "id": "d1632-8",
  "text": "UNIVERSITY OF KENTUCKY DEDICATES NEYJ STUDIOS\nN-A-E-B station YJBKY formally dedicated new studios and transmitter May 23 in\nLexington, in special ceremonies under the direction of Elmer G. Sulzer, head\nof the Department of Radio Arts.\nYJBKY's studios are the first of their kind in educational radio. A new accousti-\ncal treatment, using poly-cylindrical diffusers reduce interference effects. Main\nstudio measures 45 By 52 feet; is decorated in four different shades of green,\ngray, and yellov/. Programs are monitored from acontrol booth projecting three feet\ninto the studio, equipped with triple-section, curved-glass panels. Floor is\nblack and green inlaid tile with center inlay of station call letters, WBKY, in\ngray. Lighting is provided by banks of fluorescent tubes and 300-r/att si:>ots in\neach studio corner.\nNew transmitter facilities designed by Henry Locklar of TJLAP and built by James\nHisle afford YJBKY transmission on both the nev/ high band of FM frequencies and\nthe low-band spectrum. WBKY operates on the new facilities with a four-bay\nturnstile antenna giving a radiated power of 2300 watts.\nYJBKY director Sulzer estimates the city of Lexington has 4000 FM receivers, but no\nsurvey has been made of the outlying area served by the station.\nWHA FARM EDITOR GOES TO KOREA\nMilton Bliss, farm radio editor for NAEB station YJHA(University of Wisconsin)^\ntaking a year's leave of absence for special military government service. Bliss,\nleaves the VfHA farm department to sail for Korea as advisor to the U.S. Military\nGovernment there as a special advisor in the agricultural education system,\nABC OFFERS COMMON STOCK TO PUBLIC\nPublic participation in ownership of the American Broadcasting Company was opened\nup this month for the first time with the offering of 500,000 shares of common\nstock at $9 per share. Stock was offered for sale by Dillon, Read & Co,, invest¬\nment bankers.\nU.S. DEPARTMENT OF COMMERCE SEEKS RADIO ENGINEERS\nRecruiting of radio engineers by Department of Commerce for field work in the CAA\nbegan this month. There are 33 openings ranging from $2644 to $4902 plus travel\nallowance. Appointees will be required to spend nearly nine-tenths of their time\non field assignments. Areas covered will be East from Maine to Virginia and West-\nVirginia.\nBMB STUDY NO. I NOW AVAILABLE AT HALF PRICE\nThe complete Broadcast Measurement Bureau's Study No. 1 on station and\nnetwork audience reports is now available at ^32.50. Separate reports\nincluding the BMB Area Reports are no?/ $17.50 and the BMB Network Report\n] is priced at $12.50\nI According to BMB's executive committee, the price reductions were made be-\n! cause of \"the fact that half the active life of the reports has transpired\n) and that the Study No. 1 reports will be superseded in approximately 18\nmonths by reports covering the 1949 nationwide survey.\"\nF"
}