{
  "id": "d1842-9",
  "text": "adjustable tilt to minimize reflections as well as a\nseparate 8-inch speaker to provide excellent sound\nquality from the front.\nDage Division of Thompson products was demon¬\nstrating a newly designed miniature TV camera,\nModel 333. It is completely automatic with no oper¬\nating controls and self contained in a case (without\noptics) 2 %\" x 5%\" x 7%\". The camera is of modular\nconstruction and weighs approximately four pounds.\nIt operates on 10 watts power input from practically\nany source and its output is composite video or modu¬\nlated rf, or both as required, with standard RETMA\nsync, 525 lines, 60 fields per second, pictures fully in¬\nterlaced, or other special sweep rates, as required.\nOther exhibitors included Tele-Cam, Inc. of\nPittsburgh whose equipment WQED used in the pro¬\nduction of the Encyclopedia Brittanica Science Series;\nRCA, showing their TK-15 vidicon camera equip¬\nment; Sarkes-Tarzian with a complete live and film\nstudio control set-up; Zenith showing AM, FM and\nTV receivers; Century Lighting, Teleprompter, Na¬\ntional Theatre Supply demonstrating the new GPL\nvidicon equipment; and DuMont with a display of in¬\ndustrial TV equipment for educational use.\nTo complete the list of exhibitors, there were dis¬\nplays by WOSU-TV, NBC and NAEB, as well as\npromotional materials and descriptive literature from\nmany educational radio and television stations.\nPLACEMENT SUPPLEMENT\nJune I - Young announcer, news man and actor with a deep,\ncultivated voice and 6 years experience would like to\nwork with a station that concentrates on serious music\nand complete news programming. Has worked in both\nradio and TV. Married, 22, B. S. Location open. $3,900 -\n4,000 minimum.\nJune 2 - Experienced writer-producer-director with 6 years\nbackground in ETV wants a stimulating position in TV\nor AM station. Experience has also covered'announcing\nand production duties. Male, 27, single with A. B. in\nliterature. Wants to locate in the Southwest. $5,500.\nJune 3 - Single man, 42, anticipating Ph.D in 1959, with 8 years\nexperience in teaching speech and radio, will be avail¬\nable in September for a challenging position in teaching\nand news announcing. Has program experience both in\nradio and TV. Prefers eastern or mid-southern location.\n$5,300 - 6,500.\nJune 4 - Man with 9 years experience in TV desires position in\neducational TV as producer, director, station manager, or\nprogram director. Can handle everything from idea and\nscript through budget, production, and show, live or\nfilm. Single, 34, A. B. Location and salary open.\nJune 5 - Audio-visual director would like a college or univer¬\nsity position where masters degree in a-v education could\nbe taken. Has sound knowledge of motion picture dis¬\ntribution and production; background in motion picture\naesthetics, history, and appreciation, for possible teach¬\ning. Qualified to teach trade journalism, publicity writ¬\ning. Married, male 32, B. A. Location and salary open.\nJune 6 - Film producer-writer-director, after 8 years in educa¬\ntional films, seeks responsible position in ETV where film\nproduction must be integrated with live programming.\nWell-educated and capable of developing and implement¬\ning sound, imaginative program ideas. Knows film\nthoroughly; some experience in university TV. Script\ncredits include prize-winning history film, plus titles in\neconomics, geography, atomic science. Man, 35, mar¬\nried, B. A. Location and salary open.\nJune 7 - Creative producer-director with experience in live di¬\nrection, closed-circuit experimental programs, and grad¬\nuate training in TV and cinematography seeks a position\nin ETV. Special interest in children's programs, tele¬\ncourses; capable of handling any non-dramatic assign¬\nments. Very interested in teaching broadcasting courses\nin addition to regular work. Man, 24, married, B. A.\nLocation open. $5,000.\nJune 8 - Able young man desires production position with ETV\nstation. Strong experience in both open and closed-circuit\nproducing-directing. Much work in all phases of film,\nespecially editing. Strong theatre background. Married,\n27, M. A. in radio-TV. Licensed teacher. Location open.\n$4,500 minimum.\nJune 9 - Man, 31, wants to combine his practical experience and\neducation in a challenging executive position in educa¬\ntional TV. Strong background includes 8 years network\nexperience in New York with work in live and film pro¬\ngramming, production and writing for news, documentary\nand entertainment programs. Married, M. A. due in\n1959. Desires location close to large urban center.\n$12,000 - 15,000.\nJune 10 - Young man desires position in television production or\nprogramming. Has had 3 years experience with the Uni¬\nversity Broadcasting Services in Alabama. Proficient in\nall phases of production, including direction, film nar¬\nration, film editing. Competent, dependable, hard\nworker, enjoys working with people. Single, 22, B. A. Any\nlocation, except South. $4,420.\nJune I I - Station manager or program director with experience\nin 3 educational AM stations and 5 years of commercial\nradio would like to return to educational broadcasting.\nTwo years experience in Europe as civilian employee of\nArmed Forces Radio and production of programs in\nEurope for U. S. educational stations. Has taught in\nuniversity radio department. M. A. candidate, male, 34,\nmarried. Preferably Colorado or Rocky Mt. location.\nSalary open.\nJune 12 - TV producer-director-announcer with 8 years back¬\nground in producing-hosting educational programs for\ncommercial outlets in California seeks affiliation with\nETV station. Variety of experience in all phases of tele¬\nvision; firm background of public service programming.\nMale, 39, married. Location open. $7,000.\nJune 13 - Experienced manager with 7 years of teaching in col¬\nlege, 4 years commercial experience, and 3 years of\nmanaging and programming a university station, desires\na challenging position in either teaching or station man¬\nagement. Married, 39, Ph.D. with excellent references.\nLocation open. $6,000 - 6,800.\nJune 14 - Young woman experienced in program planning, pro¬\nducing and presentation for state ETV station desires\nsimilar position relating to instructional and informational\nprograms. Has wide range of experience from broad¬\ncasting and speech fields to the arts and teaching areas.\nSingle, 27, M. A. Licensed teacher. Location open.\n$4,000 minimum.\nJune 15 - TV production man with 13 years experience in com¬\nmercial network and educational radio and ETV desires\nsupervisory position in E’TV with some active production\nwork. Presently working with university broadcasting and\nteaching. Married, 29, B. S. Location open. $6,500 -\n7,500.\n10\nNEWSLETTER"
}