{
  "id": "d1185-5",
  "text": "(6).\nPANEL WILL BE AVAILABLE SHORTLY. ^ATCH THE i£WS LETTER FOR LATER ANNOUNCE¬\nMENTS o\nRADIO-EDUCATION FOR TEXAS\nThe Texas State Legislature has appropriated funds to establish and operate\na department of Radio and Special Education,, Heading the new department\nis <John Wc Gunstream, director of the Texas School of the Air, a cooperative\neducational program which has been using the radio stations in Texas,,\nCreation of the department makes it the first of its xihd in the United\nTATES.\nTHE NEW DEPARTMENT INAUGURATED ITS 1941-42 SERIES OF CLASSROOM BROADCASTS\non October 6. The series will parallel the five major courses of the Texas\nPUBLIC SCHOOL CURRICULUM. (l.E. LANGUAGE, ARTS, SCIENCE* SOCIAL SCIENCE,\nVOCATIONS* AND MUSIC)\nKENYON TO KIRQ\nMiss Hazel Kenyon, formerly director of KBPS for the Portland, Oregon public\nSCHOOLS, HAS BEEN NAMED DIRECTOR OF RADIO FOR KlRO, SEATTLE.\nF, C. C. ACTIONS\nKFGQ, Boone Biblical College, granted a construction permit to change fre¬\nquency TO 1260 KILOCYCLES, INCREASE POWER to 250 WATTS DAYTIME, CHANGE HOURS\nOF OPERATION TO DAYTIME, MAKE CHANGES IN TRANSMITTER AND INSTALL A NEW\nANTENNA. (10/1/41)\nKOAC, Oregon State College, was granted modification of its construction per¬\nmit. (10/2/41)\nWOSU, Ohio State University, was granted license to cover recent construction\nPERM2 T. FOR CHANGE IN FREQUENCY, INCREASE IN POWER, CHANGE IN HOURS OF\nOPERATION, AND CHANGE IN EQUIPMENT. (10/2/41)\nKFJM, University of North Dakota, was granted special permission to operate\nUNLIMITED TIME FOR A PERIOD NOT TO EXCEED 30 DAYS, OR UNTIL THE COMMENCEMENT\nOF PROGRAM TESTS BY STATION KILO. (10/6/41)\nWSUI, University of Iowa, applied for construction permit to make changes in\nDIRECTIONAL ANTENNA FOFijDAY AND NIGHT USE AND INCREASE FROM I KW« NIGHT\n5 KW DAY TO* 5XW DAY AND NIGHT. (l0/®/4l)\nWAUR, University of Illinois, granted license for new relay broadcast\nstation: 1646, 2090, 2190^ 2830 kc., 20 watts. (i0/9/41)\nWSAd* Grove City Collsse, granted special authority to operate additional\ntime on three Saturdays in October and November tn order to broadcast home\nFOOTBALL GAMES ONLY. (I 0/I 4/41 )"
}