{
  "id": "d356-14",
  "text": "REPORTS OF WORKSHOPS AND SEMINARS (CON'T.)\n3\nPubl.\nHo.\nW-17 NAEB Video Recording Workshop - Cecil S. Bidlack, Editor. Report of the\nVideo Recording Workshop held in the WTTW Studios, Chicago, Illinois,\nMay 5~9, 1958> for engineers from educational TV stations operating\nkinescope recorders. 195$* 62 pp. Paper. $1.00.\nW-l8 NAEBjSeminar on Children's Television Programs - Harold E. Hill, Editor.\nReport of the Seminar on Children's Television Programs held at Boston\nUniversity, March 29-April 1, 1958, for educational and commercial\nbroadcasters of children's TV programs. 1958. 37 PP* Paper. $2.00.\nW~l8a Children and Television - Eale B. Harris - An annotated bibliography of\narticles, reports, books, etc., dealing with the effects of TV on\nchildren. June, 1959* 50 PP* Paper. $1.00.\nW-19 Televised Instruction - James S. Mies and Raymond E. Wolf, Editors. Report\nof a conference on the use of television in instruction held at Purdue\nUniversity, August 25-September 5, 1958. 132 pp. Paper. $2.00.\nW-21 NAEB Radio and Audio Engineering Seminar - Cecil S. Bidlack, Editor. Report\nof the Radio and Audio Engineering Seminar held at Allerton Park,\nUniversity of Illinois, My 27-June 1, 1956, for technical personnel\nin NAEB member radio stations. July, 1956. 23 pp. Paper. $1.00.\nW-22 NAEB TV Lighting .’and Staging Workshop - Hazen J. Schumacher, Editor. Report\nof the TV Lighting and Staging Workshop held at the University of\nMichigan, August 19-22, 1956, for ETV personnel actively engaged in\nlighting and staging work. February, 1957* 10 PP* Paper. 50^.\nW-23 NAEB TV Program Planning Seminar - William G. Earley, Editor. Report of the\nProgram Planning Seminar, for personnel actively engaged in planning of\nprograms for ETV stations and production centers, held at the University\nof Wisconsin, August 26-September 1, 1956. February, 1957* 64 pp.\nPaper. $1.00.\nW~26 NAEB Research Seminar for Educational Television and Radio - I. Keith Tyler,\nEditor. Report of the Research Seminar for Educational TV and Radio\nheld at Ohio State University, December 9-13, 1957, for research\nspecialists in educational broadcasting. 1958. 31 PP* Paper. $1.00.\nW-27 NAEB Seminar on Instructional Uses of Television and Radio - Elaine Afton.\nEditor. Report on the Seminar of Instructional Uses of TV and Radio\nheld at Purdue University, July 21-25, 1958, for TV staffs associated\nwith educational broadcasting and educators responsible for training\nprospective teachers. 1958. 62 pp. Paper. $2.00."
}