{
  "id": "d356-40",
  "text": "WQED Hosts 7,000 Persons,\nOver 600 Scripts\nAs shown in the photograph, hundreds had to wait in line to\ntour the facilities of WQED, Pittsburgh, during the annual\nopen house March 13 and 14. Some 7,000 visitors observed\nstation operations, saw themselves on TV, and talked with\nTV personalities such as Miss Frances Jordan, WQED’s kin¬\ndergarten teacher.\n• WQED can boast another overwhelming success—its\nplaywright contest, in which 615 writers submitted scripts.\nAlthough publicized only in Pennsylvania and in trade jour¬\nnals (such as the NAEB Newsletter, January issue), the\ncompetition pulled scripts from all over the world and from\nall ages and walks of life. WQED hopes to announce the win¬\nners shortly after May 1, and the selected plays will be pro¬\nduced this summer.\nNYSERTA To Meet\nThe New York State Educational Radio and TV Association\nwill meet May 3-4 in Syracuse. Chalmers Marquis, executive\ndirector of NAEB-ETS, will keynote the conference, speak¬\ning on the new federal education legislation and its potential\nfor educationail communications. There will be panel discus¬\nsions on CATV and the future of networking in educational\nradio and TV.\nETV Facilities Applications Accepted\nThe following applications for federal assistance in the con¬\nstruction of new ETV stations have been accepted for filing.\nFigures represent total estimated project costs.\nNebraska ETV Commission, Ch. 16, Omaha ($215,949) ;\nGeorgia State Board of Education, Ch. 20, Wrens ($1,643,703),\nCh. 14, Pelham ($592,711), Ch. 25, Dawson ($575,186), and\nCh. 15, Cochran ($592,711); WGBH Educational Foundation,\nCh. 44, Boston ($976,836) ; and the Greater Washington ETV\nAssociation, Ch. 50, Washington, D.C. ($557,395).\nSummer ITV Workshops Offered\nBoston University. July 13 to August 20. Half lectures,\nhalf practical projects. In latter, small groups, will plan a 13-\nweek series in a specified curriculum for specific grade level.\nEach group will complete one program. Write: Dr. Murray\nR. Yaeger, School of Public Communication, Boston Univer¬\nsity, 640 Commonwealth Avenue, Boston, Massachusetts 02215.\nSan Francisco State College. June 21-25. In cooperation\nwith KQED. Write: Dr. John Fell, Chairman, Radio-Televi¬\nsion-Film Dept., San Francisco State College, 1600 Holloway,\nSan Francisco, California 94132.\nSUMMER STUDY ABROAD\nNew York University. June 1-30. International ITV field\nworkshop—including Montreal, Rome, Munich, Paris, Lon¬\ndon. $1259 cost includes tuition, university fees, transportation,\nroom, breakfast, dinner, gratuities. Communication Arts Group,\nNew York University, Washington Square, New York 10003.\nBoston University. June 14 to August 31. In-depth study\nof cinema and TV in Great Britain, France, Italy. Boston\nUniversity School of Public Communication, Film Department.\nNEW SUMMER COURSE\nIndiana University. For the first time this summer, a\ncourse will be offered in the planning and administration of\nclosed-circuit TV systems.\nNAEB Headquarters: 1346 Connecticut Ave., N.W., Wash¬\nington, D.C., 20036. Phone 667-6000. Area Code 202. TWX 202-\n965-0299.\nNews Notes\nPERSONNEL\n^ Mark Damen has been named program manager of WUFT-\nTV, University of Florida. Prior to coming to WUFT in 1963,\nhe was a free-lance writer and producer for TV, and had been\ndirector of special projects for WQED, Pittsburgh.\n► Robert A. Mott is the new chairman of the Washington\nState University communications department, replacing Allen\nMiller who resigned and went on a sabbatical leave to Eu¬\nrope April 1. Miller will continue as director of information\nservices and professor of communications when he returns\nin September. Mott joined the WSU staff in 1956 as news\ndirector of the radio station; since 1962 he has been radio-TV\nservices manager.\n► James Etheridge, Jr., executive secretary of the Florida\nETV Commission since its inception in 1957, has resigned to\nenter private business. William W. Galbreath has been ap¬\npointed to the post.\n► Frank R. Jamison, director of ETV at Colorado State\nCollege, has been appointed broadcasting consultant to the\nWyoming Fish and Game Commission. He will conduct a\nworkshop and help evaluate a weekly radio and TV series.\n► Lawrence M. damage, director of TV for Wayne State\nUniversity, was one of five recipients of a 1965 award from\nthe Detroit American Women in Radio and TV. The awards\nare for outstanding initiative, creativity, and responsibility.\n► William J. Hanford, of the Wayne State University hu¬\nmanities department, has been appointed director of Dela¬\nware’s newly established ETV network. He wild assume his\nnew position July 1, after completing his Ph.D. in mass com¬\nmunications.\n► Mrs. Elizabeth Marshall has been appointed director of\nradio-TV for the Chicago Board of Education.\n► Keith Engar has left his position as director of radio-TV\nservices at the University of Utah to become chairman of the\ndepartment of theatre and ballet and executive director of the\nPioneer Memorial Theater. Rex Campbell, formerly assistant\ndirector of radio-TV services, succeeds him.\nSTATE\n► Recent action in the Texas Legislature brings state sup¬\nport for ETV closer. Identical bills in the state Senate and\nHouse were unanimously voted to the floor, without being\nsent to subcommittee; this amounts to a suspension of the\nrules requiring all bills to go to subcommittee. The bill would\nallow money being spent by local school districts for ETV\nservices from ETV stations to be matched up to 75c per\npupil in average daily attendance.\n► In New York, it looks as if the plan for a state-wide ETV\nnetwork may suffer a setback if the $625,000 for the first\nleg of the network has to be cut from the governor’s budget.\nMAY 1965\n3"
}