{
  "id": "d25-0",
  "text": "NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nRECEIVED\nnaeb headquarters\ni\nNAEB\ndec 2 8 1958\nP*\n7|8|%lpill|12|l|2i3|4|6|6\nl\n14 GREGORY HALL\nURBANA, ILLINOIS\nDecember 23\nDear Harry:\nSorry to be so long in writing about your publication of\ntne survey manual. I have simply been snowed under lately*\nI have been taking a three week course at IBM on running\nand programming electronic computers — we just installed\none at Iowa for research purposes. This, on top of everything\nelse has simply killed every bit of time I had. I am also\ntrying to get out a research report to STRC for a study\n{or th9m at l0wa this Past (This is the last\nr?9 1 have hanging over me from Iowa.) The graduate\nstudent I have wonting with me on the project - who is still\nin Iowa City - has been a bit slow getting tabulations to\nme and so I am having a terrible time trying to get the\nthing completed. Anyway, did want to thank you for the fine\njob on the manual. I haven't read it through carefully\n1 ^hink it looks excellent. I hadn’t even noticed\nthe things you mentioned in your letter. Hone are too\nserious. I think the date would have been heloful for\nreference purposes but I do not believe that any of these\nomissions — page nurabers and date — will make it any\nless useful to stations. I will be Interested in any\nwhethe?nfv,y0U^haTe^°Jit' parts people don’t understand,\nJ ~~ they feel it does the job and if not why not, etc.\nT0!^0! letter concerning the McLuhan proposal.\nI think that this is excellent. It is interesting because\nat our seminar last Friday Gilbert Slides expressed an\ninterest in this problem of what youngsters in the schools\nshould be taught about the media dnd we had a good discussion\nabout it — and plan to have more. I think that McLuhan is\nprobably tte* best person one could find to do this sort of\nthing -- jm have confidence that he will do it well and\ninterestingly. I have just a few suggestions on the proposal.\nPrimarily, I feel that it needs to be pinned down much better -\nneeds to be made more specific — before it has a chance of\ngetting through. I think the people with the money are going\nto want at least some idea of what the animal is going to\nlook like. Perhaps I can be more specific also. First of\nall, anyone who has read none of Marshall's stuff — and I\nthink we need to assume that there might be some such\nunenlightened souls on the committee -- might completely\nmisunderstand what the end product might be. Therefore I\nwould include a bibliography which Included hir~, writ:!n^s^ori\nthis topic especially that wonderful paper he did in\nThen I would include plenty of examples to\nshow precisely the sort of approach he will take. (The\nreason for this is that you know that most of the members\nwill not bother' to go out and read his articles, if they"
}