{
  "id": "d25-27",
  "text": "NAE8 HEADQUARTERS\nDEC 3 1958\n** pi\n7|?I?|M|11|I2, 1|2i3|4|6,6\n29 wells Hill Avenue\nToronto 10, Ontario,Canada\nDecember 1, 1958\nDear Harry, ^\nNice bit of Madison-ese I heard recently: *1 thought wefd\nhave a sort of dual session-- a hard zeroing in on thi^s\nconcept of yours, and also a blue sky expedition just to\nmake sure we haven’t missed anything,* Good nuclear language!\nSpoke Friday at NOTE and chatted around. Man, but they’re\nready for the grammars of the media. The sense of futility\nin being just English teachers has become ever so much\nmore noticeable. Myself, I didn't talk about the media.\nIn fact, I noticed that I had been carefully shoved out of\nthe media division by Forsdale, Shafer, Hazard, who feel\nthey’ve learned enough from me to go it alone. So they had\na wee section all to themselves. I don’t mi^nd. But NOTE can\nnever make the transition to media study without help from\nNAEB, English teachers as such have got a thing about being\nthe gentry, as it were, and of having so much to lose by\nbeing seen in vulgar media company that they are paralyzed ,\nand will continue that way, I fear.\nI really feel great new urgency, Harry, for our project as\na result of this Pittsburgh trip. Big new break—through a\nfew days ago: In electric age even social processes that\npreviously were prolonged are now telescoped into recognizable\nimages. An image of an entire process is a myth. Myth (e.g.,\nCadmus, Gorgon, Trojan Horse) is a single image of an entire\nprocess. A word is a single shot of a process. A language\nor medium is a macro-myth which may include all sorts of\nderivative myths, etc. But hula-hoop can be seen as a live\nmyth or image of process. Steady-ydating in the new pattern\nfor the young becomes rejection of stag lines,going with\nseries of guys,etc. Nuclear thus implies generation o f\none 's world from a point, making one’s own space-- And goes\nwith \"labor-saving devices*,which are actually a new kind\nof work, in which the task grows from the gimmick. Antithetic to\nall these is the old pictorial, external or enclosed spaee\ninto which things are put. This is, for example, bureaucratic\nspace against which it is now so easy to rally rejection.\nMy own approach to this project on the \"Languages of the\nMedia* follows this nuclear pattern of watching for the actual\nlines of force generated by any medium as it expands, making\nits own world, yet reciprocally modifying existing f orms\nand being modified by them as well.\nSo, as I look over the Becker-Schooley project, copy of which\nyou sent me, I can say that all such data are relevant to\nme because they help to advance awareness of any given mddium\nas a language. Yet I consider my task to be to reduce such"
}