{
  "id": "d25-40",
  "text": "of ^interaction between the reader and the pas sage.®8\nNo comparable or adequately-based development in the teaching of the characteristics\nof the wireless media have yet emerged. Utilization is often handled by individuals who\nare unaware of the fundamental or basic characteristics and affective effects of the media.\nSuch individuals necessarily concern themselves in teaching solely with superficial and\nobvious uses which grow out of an essentially amateur approach. If maximum use of\nthese media is to be made it is urgent that a body of information be developed which will\nprovide a solid foundation for such courses , not based on guesswork or assumed transfer\nof common elements from other media.\nSerious scholars now recognise that a large proportion of the effects of television\nand radio are often unintentional or unintended ones. A large part of the impact of the\nwireless media is not dependent on the content transmitted. Critics of educational, com¬\nmercial, government controlled, and other systems in the world, closed circuit and open-\ncircuit, find a large part of the impact of TV and radio to be independent of the content or\nmessage communicated.\nThe number of elements which characterize the effects of the use of these media as\nsuch, regardless of their content, their message or the system under which they are operated,\nillustrate the need for research in depth and experimental evaluation on the basis of which\nthe teaching of procedural and methodological uses of a socially and educatbnally responsible\ntype can be soundly based. Without this foundation, many unintended effects and side-\neffects will continue to result, and more abuses are likely to occur than soundly based\nmaximum effectiveness uses •\nToday the movement of information^ound the clock and around the globe is perhaps\nthe biggest industry in the world. Our class rooms take little note of the fact that students\nreceive by far the largest part of their information in forms about which the student under¬\nstands as little as the teacher. The icon world of the photograph and the advertisement has"
}