{
  "id": "d1415-0",
  "text": "Office of Executive Secretary\nUrbana, Illinois\nOctober 1, 1939\np\nKOAO STILL FACED WITH THREAT OF INTKRFEREHGE\nWord, of an adverse preliminary ruling but one which leaves the way\nopen for final arguments before, and action by, the Federal\nOommunications Commission has just been received by those in charge of\nthe fight by radio KOAC to prevent sharing its favorable wavelength\nwith an Arizona commercial station.\nThe further action in the KOY-KOAC case in “Proposed Findings of Fact\nand Conclusions,H proposes to confirm a previous examiner^ findings\nfavoring granting the right to KOY«\nStatement is made in the preliminary finding that operation of KOY\non the KOAC wavelength would not increase objectionable interference\n“within existing good service areas.» Contrary to this, the electrical\nengineering department at 0„S,C, has taken actual measurements which,\naccording to testimony introduced by KOAC£ show that interference to\nthis 8tate~owned station would be increased more than 2000 per cent\nafter sundown,, and that the night good service area would be reduced\ni to approximately 1 per cent of the total state area containing less\nthan 5 per cent of the population.\n- Those in charge of the KOAC fight, headed by L. H. Breithappt, special\nrepresentative of the board and the college, have taken steps to argue\nthe case further when it comes before commission members personally\nfor final consideration,\nFENNY A DAY\nTHE AMERICAN PRESS for October had the following editorial, entitled,\n“Penny A Day“s\nEven with radio the public is getting very small pay, in the form\nof entertainment, for the amount of advertising to which it must listen.\nFor if each of the alleged 26,500,000 radio homes would contribute\none penny a day for raalo programs, a fund of almost $100,000,000\ncould be raised annually - enough to pay for a hundred million-dollar\nprograms - enough to keep most any radio fan happy.\nNot that we recommend such a plan. For it is 0enerally agreed that\nadvertisers, competing for the ear of the public, will put on better\nshows than if there was no competition involved, ^ut it is inter¬\nesting to note that each radio home is paid less than a penny’s worth\nof entertainment per day for listening to the radio salesmen."
}