{
  "id": "d1754-0",
  "text": "■\nN\nA\nE\ni\nNEWSLETTER\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\n14 GREGORY HALL URBANA, ILLINOIS\nNAEB-SUPPORTED TV\nSUMMER WORKSHOPS\nThe University of Nebraska, Lincoln, Neb., and the\nEast Carolina College, Greenville, N. C., have an¬\nnounced the opening of their NAEB-financed summer\nworkshops for in-school teaching by TV. Classes\nstarted June 17. The purpose of these workshops is\nprimarily to insure the best possible professional\ntraining for the staffs and management of U. S. ed¬\nucational TV stations.\nBoth schools will feature in their two-week pro¬\ngrams a number of distinguished speakers in the field\nof ETV. The U. of N. makes its own station, KUON-\nTV, available for the workshop while ECC has been\ngiven access to the facilities of WNCT-TV, Channel\n9, in Greenville.\nOther institutions which established NAEB-spon-\nsored workshops are the University of New Mexico,\nPurdue University, Michigan and Florida State Uni¬\nversities, WKNO in Memphis, Tenn., the University\nof Miami, the University of Minnesota and the Tol¬\nedo (Ohio) Public Schools.\nThe total amount granted by the NAEB for the\nestablishment of workshops is $17,000.\nWALDO ABBOT RETIRES\nProf. Waldo Abbot, longtime NAEBer and longtime\nDirector of Broadcasting at the University of Mich¬\nigan, retired from the Wolverine staff on July 1, 1957.\nWaldo was the recipient of a special NAEB Citation\nat the Convention last fall in Atlanta. He is a former\nBoard member of the Association, and is the author\nof the Handbook of Broadcasting, the most recent\nedition published with the assistance of Richard L.\nRider.\nIn his years of service, Waldo has seen, and super¬\nvised, the growth of Michigan’s radio service. He es¬\ntablished station WUOM which produces numerous\nseries of programs each year for broadcast by com-\nNAEB Newsletter\nVol. XXII, No. 6\nJuly, 1957\nNAEB Newsletter, a monthly publication issued by the\nNational Association of Educational Broadcasters, 14\nGregory Hall, Urbana, III., $5 a year, edited by Hans J.\nMassaquoi. Application for 2nd class mail privileges pending\nat Urbana, Illinois.\nmercial stations throughout the state and provides a\nspecial school programming service for these stations.\nLater, he added another station, WFUM, at Flint.\nMore important, in a personal way, is his lovely\nwife who with Waldo resides on Washtenaw Avenue\nin Ann Arbor, where we assume NAEBers may visit\nWaldo and Em if they can find them at home. Waldo\ntells us that he expects to spend the summer at his\ncottage near Omena, Michigan.\n—Frank E. Schooley\nNEW TV LEGISLATION\nAfter three defeats in the California state legislature,\na bill was passed early last month giving school dis¬\ntricts and state colleges the right to contract for TV\nprogramming services. The bill was supported by\nvarious school and civic groups.\n^ A bill, restoring budget funds for continued opera¬\ntion of WHA-TV, Madison, Wis., has been sent to\nGov. Vernon W. Thomson after it passed' the state\nSenate 22 to 7.\nThe Bill also provides for a transfer of the ETV\nstation’s operation from the State Radio Council to\nthe University of Wisconsin.\n—N A E B—\nThe American Assn, of Colleges for Teacher Educa¬\ntion has released its fourth issue of a series of bulletins\ndiscussing the uses of TV in education. Persons in¬\nterested in obtaining copies may write to: The Ameri¬\ncan Ass. of Colleges for Teacher Education, 11 Elm\nSt., Oneonta, N. Y.\nI"
}