{
  "id": "d1754-7",
  "text": "SPECIAL NOTE\nThe Executive Director Dr. Skornia, has been in¬\nformed by the Conference Board of Associated Re¬\nsearch Councils (which handles Fulbright Applica¬\ntions) at 1875 Massachusetts Ave., Washington, D.\nC., that applicants interested in the Scholarship pre¬\nviously held by Graham Hovey and Bernard Buck,\nwith Radio Italiana, should be encouraged to apply\nfor the 1958-59 academic year. No vacancy exists for\n1957-58, so, don’t apply for that period. However, we\nwould hope for good applications for this fine post\nfor 1958-59.\nBlanks may be secured for submission at a later\ndate to be specified, by writing Dr. Francis Young at\nthe above address.\nWe are pleased to announce that next year’s Ful¬\nbright scholar to Paris, succeeding Keith Engar is Dr.\nMeany, who is director of the radio, television and\nfilm unit of the University of Houston. Prior to start¬\ning his Fulbright studies, Dr. Meany expects to be in\nZurich, Switzerland, by August to record some film\ninterviews with the renowned psychologist, Dr. C. G.\nJung.\nDIRECTORY CHANGES\nP. ! Active 124\nAssociate 88\nAffiliate 52\nTotal 267\nRadio - FM only 85\nTotal Active Membership 124\nThese 124 members operate.for 156 stations.\np. 7 Under Indiana: WGVE (FM)*\nDelete: Asterisk\np. 10 Under Louisiana:\nDelete: WLSU (FM) 9l.7mc\n(Baton Rouge) 1.3 kw\nLouisiana State University\nMiss Lucile Ruby, Coordinator\nRadio-TV Service\nDalrymple Dr.\nBaton Rouge, La.\n4-5244\np. 14 WFUV (FM)\nProgram Director\nDelete: Ralph M. Rourke\nAdd: Rev. John A. St. George\nDirector\np. 27 Under Louisiana:\nAdd: Louisiana State University\n(Baton Rouge)\nMiss Lucile Ruby\nDalrymple Dr.\n4-5244\np. 47 Under Canada:\nAdd: University of British Columbia\nAlan M. Thomas\nDepartment of University Extension\nVancouver 8, British Columbia\np. 51 WLSU (FM)*\nDelete: Asterisk\nPLACEMENT SUPPLEMENT\nJuly I - Male, married, 38, M.A., with extensive experience. in\nadministration, radio teaching, and educational station\nmanagement and programming, desires position in teaching\nor managing high school, college or university educational\nstation. Location open. $6000.\nJuly 2 - Producer-director, 2 years experience in ETV, writing,\nproduction, coordination. 6 years teacher at high school\nand college. Single woman, 33, B.S. in Ed. Location open.\n$85/wk.\nJuly 3 - Male, married, 32, B.A., with 4 years TV experience\nwith major network and solid film background, desires\nposition as program director or producer-director. Has ex¬\ntensive managerial experience (supervised Japan's first TV\nnetwork) Location open. $6000.\nJuly 4 - Former program director of large educational radio\nstation wants manager or program director position in ETV,\n5 years experience programming for commercial stations.\nMale, 34, married, B.A. Location open. $7500.\nWESTINGHOUSE HISTORICAL\nPROGRAM AWARD\nRadio and TV stations interested in competing for\nthe Westinghouse Broadcasting Co. annual $1,000\nradio-TV award for the best historical program will\nbe asked to submit on film, tape or transcript a pro¬\ngram to the historical society in their respective areas.\nWith the exception of WBC outlets, any station\nmay enter the contest. Entries must be submitted by\nJan. 15, 1958. Programs up to Dec. 31, 1957 are\neligible.\nThe award will be divided between the winning\nstation and its local or state historical society which\nappoints the judges. The winner will be announced\nin March, 1958.\nTV TO AID SCIENCE PROPOSED\nA proposal to let scientists use the late hours on TV\nfor informal round table discussions to iron out prob¬\nlems in connection with the launching of a planned\nearth satellite, was made by Dr. I. M. Levitt, director\nof the Fels Planetarium of the Franklin Institute in\nPhiladelplya.\nDr. Levitt said his proposal was prompted by the\npostponement of the satellite’s launching date from\nSeptember of this year to April, 1958. He feels that\nthe delay is largely due to theoretical difficulties.\nThese, he thinks, could be resolved if the nation’s\nscientists in the guided missile field were permitted\nto discuss their problems from TV studios through¬\nout the country.\nDr. Levitt suggested that networks pool one hour\nin the early morning for such coast-to-coast meetings.\nTo permit the TV discussions, Dr. Levitt recommends\nthe declassification of satellite work when it does not\ntouch national defense.\nNEWSLETTER"
}