{
  "id": "d1700-1",
  "text": "(2)\nMr. Beaird explained that the special duties which kept him away from\nthis meeting had prevented him from making a formal report, and that\na plan to supply certain records that could be used for broadcasts\nwould be explained by an other at some time during the meeting. Carl\nMenzer, W3TJI, Iowa City, was asked to report on making records. He said\nthat only a few record making outfits made good records : but when\nwell made records made on the moat satisfactory disks would give good\nresults for about twelve reproductions.\nAt 12:00 adjournment was declalred until 1:30 p/ m.\nThe afternoon session was called to order by President Griffith, with\n22 in attendance.\nAt 2 p.m., Dr. C. M. Foon, Senior Specialist in Radio and Visual Edu¬\ncation , TJ.3, dffice of Education , Washington, D.C., made an address\non w How May the Broadcasting Stations and the U.8.Office of Education\nBest Serve Each Other”. He said that while during the past few years\nsome of the national agencies had encreased both the number of their\nworkers and their expenditures nearly ten times, very little Increase\nhad been allowed for the Office of Education. Fo© this reason, it was\nimpossible to do many things that they wished to do. The speaker though\nthat most of the educational stations were well supplied with a tech¬\nnical staff of their own, having in many cases built their own trans¬\nmitters; and therefore the line in which the Office of Education could\nhelp most would be in furnishing program material, advising the con¬\nstruction of programs, and if possible supplying programs in the form\nof recordings, ready to broadcast. The limitation of our funds makes\nit di^icult, to accomplish this and thus far there are objections to\nthe use of workers through any of the relief agencies. These difficiiL -\nties nay be overcome later, and it is possible that if wo can get out\nsuch records for broadcasting they may be delivered through the mails\nby means of the franking privilege.\nAt 2:45 p.m. a paper prepared by Director R. C. Higgy of station WOSU,\nColumbus ,0hlo, was read by Keith Tyler, Research Associate\nOhio State University, The title was ” Ohio*3 Junior College of the\nAir ”, Credit is not given por this work in regular University courses,\nalthough examinations may be taken by those who desire to do so. Many\ntaking this work have expressed a desire to take regular University ,\nresidence courses later; and if they should do so , these radio courses\nwould make the regular work much easier.\nMore women than men have been enrolled . Persons from IS to 80 years\nold have pursued the courses , and many of them are over 60 years \"Old.\nDr. Crane, President of the University of Wyoming, suggested that\nwork like that of the Ohio Junior Collet?© of the air might well be\nconnected with correspondence , extension work, and suggested that\nsuch a method might be very excellent to use in the educational work\nof CCC groups or camps.\nAt 3:35 p.m., a report was presented by Prank E, ichooley, Urbana, ILL.\nChairman o^ the Committee on proposed Federal and Educational Program\nDevelopment. Mr. 8chooley said that inquiry had revealed a positive\ndesire for prepared or recorded for use by the educational stations,\nand a hope that the federal authorities might be willing to develop\nthem or at least prepare suitable records from material furnished in\npart by the eduactional broadcasters. It was suggested that these"
}