{
  "id": "d1153-0",
  "text": "§| NATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nII 1346 Connecticut Avenue, N.W., Washington, D.C., 20036\nVolume V \"Number 2 February 4, 1964\nFILING DATE EXTENDED FOR COMMENTS ON UHF ALLOCATION PLAN\nOn Jan. 29, the FCC extended the date of filing comments from\nFebruary 3 to April 3, and from April 3 to June 3 for replies, in the\nproceedings on fostering expanded use of UHF television channels\n(Docket 14229) and allocation of UHF channels for regular airborne\neducational TV operation (Docket 15201). The further extension was\nrequested by the NAEB and MPATI jointly, and by petition by the Ga.\nState Board of Education. The request for extension stated: \"...we\nare of the opinion that the benefits to be derived from the material\nwhich petitioners propose to submit is such as to warrant an extension\nof time, and that the additional time requested is reasonable. However,\nwe shall not grant additional extensions of time unless a most com¬\npelling situation arises.\"\nNAEB BOARD CHAIRMEN ELECTED\nRichard B. Hull, Director of Radio and TV Broadcasting at The\nOhio State University, has been reelected Chairman of the full NAEB\nBoard of Directors to serve until December 31, 1964. Also elected\nto one vear terms as Board Chairmen were: Television Board - Robert\nSchenkkan, Director of Radio and Television at the University of Texas;\nRadio Board - Jack Summerfield, General Manager of WRVR, New York, N.Y. ;\nInsfructional Division Board - Charles McIntyre, Coordinator of\nInstructional TV 'a'FTEe University of Illinois; and Individual Member\nBoard - Albert P. Fredette, General Manager of WAMC, Albany, NVY.\nNEW YORK CITY REQUESTS CHANNEL 14 FOR EDUCATION\nIn a petition filed before the FCC on January 13, the Educational\nBroadcasting Corporation of New York requested rulemaking on the assign¬\nment of Channel 14 to the New York-New Jersey-Connecticut metropolitan\narea for non-commercial, educational use. The proposed main studio\nwould be in New York City with the transmitter at the Empire State\nBuilding. Since the Channel 14 antenna would be two and one-half\nmiles less than the required separation from television station WWOR-TV,\nChannel 14, in Worcester, Mass., the petitioner has requested a waiver\nof the rule to permit the filing of an application.\nPACIFICA LICENSES GRANTED\nOn Jan. 22, the FCC granted applications to the Pacifica\nFoundation for (1) license renewals of KPFA (FM commercial) and KPFB\n(FM non-commercial education), Berkeley, Calif., and WBAI (FM commer¬\ncial), New York City, and (2) initial license of KPFK (FM noncommercial\neducational), Los Angeles; and (3) transfer of control of Pacifica\nfrom its Executive Membership to a board of directors."
}