{
  "id": "d1674-0",
  "text": "N-A-E-B\nN\nIEW\n'S-i\nLI\nELTi\nin. R\nNATIONAL ASSOCIATION OF EDUCATIONAL BROADCASTERS\nRadio Hall, U.W., Madison, Wisconsin\nNovember 12, 1946\nNAEB CONVENTION\nThe 1946 Convention of the National Association of Educational Broadcasters\nwas held at Michigan State College on September 30 and October 1 in East Lansing,\nwith Robert J. Coleman, Director of WEAR, as host. This was in keeping with the\npractice of holding meetings at the home-cities of members of the NAEB. President\nFrank Schooley presided. Meetings were largely informal in nature with ample\ntime provided for the free discussion of problems common to educational broadcasters\nThe non-commercial educational FM band currently reserved was the subject of\nconsiderable discussion. Members were urged to make known their FM plans and get\nstarted \"with their applications, lest the FCC conclude that insufficient interest\nexists on the part of education institutions to warrant holding the facilities.\nThe question of what types of agencies should be eligible to receive assign¬\nments in this band was discussed at length. A resolution on the matter addressed\nto the FCC was passed.\nStation activity reports, followed by questioning, brought out many program\nideas which could be adopted elsewhere.\nA tour of the WEAR studios and transmitter site revealed a modern, growing\nstation which apparently is aware of its opportunities and alert to the needs of\nits listeners.\nA banquet was held at the Hotel Olds, in Lansing. No speeches were authorized,\nbut----or perhaps as a result--—a most enjoyable evening was spent. Highlight of\nthe meeting was the presentation to Treasurer M. I. Griffith of a pen and pencil\nset in appreciation of his many years of faithful service to the Association and\nhis continued interest in the affairs of the organization.\nRESOLUTIONS PASSED\nThe following resolutions were introduced and passed (October 1, 1946)*\nRESOLVED, that the National Association of Educational Broadcasters\nassembled in annual convention in Lansing, Michigan, on this date does hereby\nrequest that FCC regulation 3503 (a) be revised to read as follows:\n(a) A non-commercial, educational, FM broadcast station will be licensed\nonly to a non-profit educational organization and upon a showing\nthat the station wi].l be used for the advancement of an educational\nprogram.\n(i) In determining the eligibility of publicly supported organizations,\nthe accreditation of their respective state departments of education\nshall be taken into consideration."
}