{
  "id": "d1674-3",
  "text": "WO SU\n- 4 -\nOhio State University, Columbus.\nTom C-lcba is a new staff announcer after returning from army duty in Iceland.\nHe has done sports announcing, is a member of the WOSU Players, is a senior in the\nCollege of Education.\nThe station is on the air from 8*00 AM to 6j30 PM—-or l'Qj-r hours daily.\nWOI - --Iowa St ate C o 1 le ge, Arne s •\nW. I. Griffith, who has directed WOI since 1925, has retired from active\nmanagement of the station. Mr. Griffith will continue as a member of the staff,\ndevoting his attention to television, FM and off-campus listener relations.\nRichard B. Hull, associated with WOI for more than 8,years is the new\ndirector. He has been associated with educational stations at Oregon State College,\nOhio State University, and the University of Minnesota * He was also on the staff\nof WCCO Minneapolis. He is active in NAEB affairs as a member of the Executive\nCommittee•\nWSUI ------ Iowa State University, Iowa City.\nThe station operates from 8*00 AM to S*00 PM-or 13 hours daily* Eleven\nnewscasts are offered by the Special Events Department under Dick Yoakam.\nMORNING CHAPEL, is a daily early morning devotional und.;r the direction of\nDr. M. W. Lampe, head of The School of Religion.\nWHA ----- University of Wisconsin, Madison.\nWisconsin’s next governor participated in a State-Station broadcast before the\nfall elections-and so did all the other candidates for state-wide offices. The\nPolitical Education Forum provided free time for unconsorc-d discussions of political\nissues. Said the governor-:; .loot, \"Personally, I have found that rny radio talk on\nyour program received more publicity than any other radio talk that I gave during\nthe campaign.\" (Walter S. Goodland)\nFACILITIES AND PCC\nKWSC (Washington State) application for shift from 1250 Ko to 1030 Kc scheduled\nto be heard by FCC on December 9.\nWHA (Wisconsin) to oppose application for station in Peoria on same frequency\n(970 kc) in hearings in Washington on December 2.\nWBAA (Purdue) granted leave to intervene on WISH, application. (October 18)\nWNYC-FM (New York City) applied for CP to install new transmitter and make\nchanges in antenna system. (October 14)\nOklahoma A&K College amended application for 10 Kw station changing frequency\nfrom 760 kc. to 840 kc. (October 4)\nUniversity of Michigan granted modification of CP for new non-commercial\neducational FM- station te> change type of tffenstfiitter and antenna system."
}