{
  "id": "d209-203",
  "text": "9\nREPORT CN THE NAEB MANAGEMENT SERVICE\nas of October 1, 1957\n(Prepared for the NAEB Convention, October 29-November 1, 1957, St. Louis, Mo.)\nHelping the new educational TV stations with some of their management and opera¬\ntional problems, including union relations, is becoming more and more involved.\nIt is easy in some of the new areas, like Minneapolis. But in places like New\nYork, where competition among existing unions is strong, it is difficult.\nThe contacts and understandings established years ago (on behalf of special\nstatus for educational broadcasters) with the National IBEW and IATSE organizations\nhave paid Qff. On the other hand, the lack of earlier official contact with the\nNational AFTRA has made it difficult in New York to work out a fair arrangement\nwith local AFTRA, and may hinder such progress in other areas.\nUnless the rights of unions and crafts in the national program are recognized and\nan operational basis established fair to both educators and unions, it is only a\nmatter of time until local programming will be affected. If certain branches or\nparts of the educational broadcasting movement, for instance, are willing to pay\nthe full commercial rate, the likelihood of securing or maintaining for educational\nstations a special status based on the lower rates which must prevail for them if\nthe burden is to be bearable, is greatly jeopardized. Today, more than ever, there\nis a definite need for the development of closer working relationship on a national\nlevel with the crafts and unions in the entertainment industry, especially with AFTRA\nand American Federation of Musicians, aimed at achieving recognition of the dif¬\nferent financial base.\nThe interest of the national leaders of the AFL-CIO is very definite. The official\nnational position supporting Educational Broadcasting adopted at the last convention\nshould be followed up on state and community levels whenever a mutual and\nfriendly relationship exists between the local educational TV stations and the local\nlabor groups.\nThe very thorough discussions and unanimity concerning the need for cooperation\non the national level, at the recent Allerton House meeting, proved the soundness\nof this position.\nRespectfully Submitted,\nM. S. Novik\nManagement Consultant"
}