{
  "id": "d209-212",
  "text": "M. S. NOVIK\n300 WEST 23rd STREET • ROOM 500 • NEW YORK 11, N. Y. • ALGONQUIN 5-4585\nRADIO\nCONSULTANT\nREPORT OF SERVICE\nTHE ASSIGNMENT was to look into and help the new educational TV stations\nwith some of their management and operational problems including union\nrelations*\nThe assignment was a challenge. The field was wide open* While opera¬\ntional and management problems were similar to a very great extent in\nthe stations wanting the service, the union relations were different in\neach case*\nIt is with a great deal of satisfaction that I*m able to report that in\nevery station where help was needed, all of the unions involved^ cooper¬\nated. The major unions were IBEW-AFL, IATSE-AFL, and to a lesser degree\nNABET-CIO, AFTRA-AFL, and IAM-AFL. The unions involved recognized the\ndifference between the educational and commercially-operated TV stations.\nThat recognition was of immediate help to the stations involved, and\nthis policy will help all new stations in the future.\nLabor cooperation was important not only in operational problems, but in\npromotion, in developing audience and the raising of funds. This coop¬\neration has just barely begun. It should be extended, especially in\nthe community operated stations.Pittsburgh, St. Louis, San Francisco,\netc*\nMy assignments at the Institutes and Workshops were even more of a\nchallenge. Novik is certainly no orator; no educator* The facts of life,\npractical problems and the background history of the organization were\nmy agenda. I hope the participants in the kmherst, East Lansing, Iowa\nCity meetings^ixiS^/^ained as much by my efforts as I did by the spirit,\nenthusiasm and desire of all to know more and more about the present anch\n'tEOT -\nThe role of the NAEB (with the cooperation of thefcFAE,, JCETX> in1'training\nthe personnel and helping the stations in operational problems, it seems\nto me, is the difference between life and cfeath. Limited as this help\nmay be, had we had it twenty years agowe would have had a differentia®*\neducational broadcasting picture in th|s country.\nCo v"
}