{
  "id": "d209-28",
  "text": "He realize® the danger should he get involved in extended dramatic programs.\nHe has had no contact with the musicians. He would like to work out a program\nand I think I can help him.\nI made it very clear to him that I was not trying to propose a program of operations.\nHe understood and appreciated our efforts . After forty minutes I had a pretty\ngood idea of what he wants and 1 think he benef tted by some of my ideas and the\nexperiences of some of the others which I recounted to him. This from a note\nof his wraps up his thinking!\n\"It might be helpful to know that our program policy is built around the idea of\nbringing to our audience those kinds of programs that commercial television cannot\nafford to do because of the limited interest in the program matter. Chamber\nmusic Is one demonstration of this policy. We plan to do specialized programming\nfor labor unions, bed-ridden students, jjr^ll businessmen, the foreign bom, etc.\nOur indention is to serve a wide series o* *selected audiences rather than\nattempting to compel'? with commercial television. We believe that we shall serve\nas a supplement to commercial television, providing an alternative program\nservice that our audience can dip into as they wish.\n\"I hope this information will be helpful to you in your talks with the AFL leaders\nnext week. We shall be very interested to hear the results of your talks. As\nyou very well know, so much of our future success hinges upon good relations with\nthese television unions. We all wish you the beat success.\"\nPittsburgh\nBill Woods is an old friend. I had no intention of getting involved in Pittsburgh.\nRemember our understanding was that we do it afterwards but I have described\nabove how this came about.\nStrange as it may seem, IA is the master in Pittsburgh. Their attitude towards\nthe station is a very friendly one. There is no problem as to wages because the\nscale is low — $87 — the poeple whom he intends to engage are all union. He\nwants help from AFRA re extension of announcer’s duties so that he can serve as\na broadcast teacher. He is to meet with the musicians and I promised to give\nhim a memo on the operation in other cities. IA9s attitude is wrapped up in an\nexcerpt from a letter which I received from him in Miami?\nnThe whole attitude of these locals is that ve are a training as well as a non-profit\nbroadcasting operation and that they will consider us (except where commercial\nmoney is involved) in a special category by which the bare minimum of union\npeople will be hired and students will perform all activities to which they are\nassigned (1) as a training device and (2) to fill out WQED’s broadcasting personnel\nneeds.\"\nHouston\nThis operation is quite different. He has 16 full-time people on his staffs\n6 engineers (5 of whom are completely detached from instruction),\n2 production, 2 writers, 1 newsman, 1 art director & lighting, 1 film\nand scenery, and 3 teachers.\nHe is on the air about 40 hours a week and operates on a budget of $90*000. The\nscale for engineers ranges from $390 to $525 per month. They are all under\ncontract to the University and enjoy the benefits provided by the University\nas to vacation, etc. He has a good working relationship with the American"
}