{
  "id": "d209-82",
  "text": "box sorfe -\nUniversity, Alabama\nApril 23, 1954\nMiss Martha C. Howard, Secretary\nThe Fund for Adult Education\n1444 Wentworth Avenue\nDear Miaa Howard:\nThis will acknowledge receipt of your letter of April 16\ninforming me on behalf of the Board of Directoro that the\nFund for Adult Education has aoproved a grant of $7000.00\nto the National Association of Educational Broadcasters\nfor a period of one year beginning April 1, 1954 for a\nconsulting service in union and labor relations problems.\nAs you Indicate in your letter of April 16,\"this grant\nwill enable the National Association of Educational Broad¬\ncasters to meet the needs of the developing field of\neducational television and radio foi* reliable clarification\nof relationships with union and labor interests. The\nNAEB will work wi£h the B.TKC the .TCET and the NCCET in\nmaking this service available to Educational Broadcasters\nin the U.S.A. This service will be on a local station\nbasis and on a personal basis rather than on a national\norganisation basis and it will mak® no difference whether\nthe request comes throughseither of the other organisations\nor directly to NAEB except that the arrangements with\nthe consultant must mane directly through the NAEB,\n‘Sead'qd&FESnrT--- \" \" ~\nFor your information, I should like to clear up one point\nwhich developed during my conference with Mr. Morris S*\nNovlk in Columbus concerning this project. It would be\nunwise 8nd prejudicial to refer to Mr. Novlk afc a labor\nrelations consultant, ^’e are of the opinion that a better\nterm would be \"consultant on personnel problems and\ncommunity relationships\" or simply management consultant.\nI believe the logic of this is entirely evident.\nBecause of Mr. Novlk*s long support of and beliof In the\nNational Association of Educational Broadcasters, ha has\nInsisted upon only a nominal reteinore fee, and we will\npay him a perdiamplus expanses for those days which ha\ndevotes specifically to this responsibility."
}