{
  "id": "d1176-1",
  "text": "1-\nTV Technical Tips No. 12\nSeptember, 1955\nBy Cecil S, Bjdlack, NAEB TV Engineer\nMr. Clement E. La Fond has been selected to attend the TV Engineering\nWorkshop at East Lansing, Michigan, in the place op Mr. Larry Reed\nWHO WILL BE UNABLE TO BE PRESENT. MR. LA FOND IS CHIEF ENGINEER OP\nthe Memphis Community Television Foundation, Memphis, Tennessee, which\nis now seeking a construction permit for educational channel 10 IN\nMemphis. He was formerly employed by KUHT ano KUHF-FM in Houston,\nTexas. He holds both a B.F.A. and an M.A. in Radio and Television\nfrom the University of Houston. He not only taught at the University\n8 UT ASSISTED IN THE INSTALLATION AND WAS ACTIVE IN THE OPERATION OF\nBOTH STATIONS.\nThe Fifth Annual Fall Symposium of the IRE Professional Group on Broad¬\ncast Transmission Systems will be held in Washington, 0. C., on Sep¬\ntember 23 and 2I4.. The technical program will be built around the new\ntechniques developing in the field of broadcasting ano a considera¬\ntion OF TELEVISION SIGNAL PROPAGATION FACTORS AS RELATED TO TELEVISION\nallocation engineering. In the field of standaro broadcasting, papers\nwill be presented dealing with experimental experience in the REMOTE\nCONTROL OF DIRECTIONAL AND HIGH POWER ANTENNA SYSTEMS. IN FM BROAD¬\nCASTING NEW MULTIPLEX TRENDS WILL BE EXAMINED. IN TELEVISION THE\nLATEST FEATURES IN THE HANDLING OF COLOR PROGRAMS, THE INTEGRATION OF\nCOLOR EQUIPMENT WITH MONOCHROME FACILITIES AND HIGHER POWER TRANSMIT¬\nTING EQUIPMENT WILL BE THE SUBJECT OP PAPERS AND DISCUSSION. SPECIAL\nATTENTION WILL BE DIRECTED TOWARD DEVELOPMENT OF NEW TIMESAVING TECH¬\nNIQUES USING MAGNETIC TAPE AND MAGNETIC STRIPE FILM, THIS DISCUSSION\nWILL HAVE APPLICATION IN EACH OF THE BROADCAST FIELDS OF ENDEAVOR.\nThe Fall Convention of the Society of Motion Picture and Television\nEngineers will be held October 3-7 at the Lake Placid Club, Essex\nCounty, N. V. One of the highlights of the meeting will be a round\ntable on October 6 on \"Problems of Network Broadcasting in Monochrome\nand Color.\" This will feature engineers from NBC, ABC and CBS as\nwell as AT&T and WTMJ-TV.\nA special session will be held Friday morning, October 7 devoted to\nEducational Television. The SMPTE will welcome attendance of NAEB\nMEMBERS AT THIS MEETING ANO APPRECIATE THEIR TAKING PART IN THE D t\"S —\ncussion. Speakers will be Mrs. Gertrude Broderick of the U.S. Office\nop Education, E. Arthur Hungerford, Jr. of the Metropolitan Education¬\nal Television Association, Inc. op New York City, and Allan DeLand\nof the Educational Television and Radio Center at Ann Arbor."
}