{
  "id": "d1176-12",
  "text": "-12-\n\"B Wind Film” - Hold up a piece of film vertically with the top of the pic¬\nture upward. Left and right picture detail appear normal only when the emul¬\nsion surface is away from the eye, (In the case of 16mm, sound film the\nsprocket holes will^e on the left).\nThe rule for determining by inspection the \"wind\" of raw stock remains the same as\nthat shoim earlier in this paper.\nThe rules and fact which must be remembered when planning contact printing operations\nare as follows:\nRule 1—The following contact printing operations involve no special obser¬\nvances other than insuring the fact that the two emulsion surfaces\nare face to face. Wo ambiguous alternatives are possible in these\ncases.\n(a) Printing Double Perforated Negative Onto Double Perforated Raw Stock\n(b) Printing Single Perforated Negative Onto Single Perforated Raw Stock\n(c) Printing Single Perforated Negative Onto Double Perforated Raw Stock\nRule 2—It is in the case of contact printing double perforated negatives onto\nsingle perforated raw stock where an improper choice of two alternatives\ncan result in the production of an ambiguous print which will project\nwith the left and right sense of the image reversed. Since a double\nperforated negative can be printed either \"heads first\" or \"tails first,\"\none must determine which of these two alternatives apply in each par¬\nticular case. In order to make such a determination one must ascertain\ntwo facts. First, ascertain the \"wind\" of the negative to be printed.\nThen ascertain which \"wind\" of raw stock the particular contact printer\nis designed to handle. If these two \"winds\" are the same, the printing\noperation must proceed \"tails first.\" If they are opposite, it must\nproceed \"heads first.”\nNegative Wind\nRaw Wind\nPrinting Order\nResulting Print Wind\nCase 1\nB\nA\nHeads First\nA\nCase 2\nB\nB\nTails First\nA\nCase 3\nA\nA\nTails First\nB\nCase U\nA\nB\nHeads First\nB\nSound Stock Terminology\nAs it has been indicated previously, the foregoing method for breaking down 16mm.\nfilms into two \"winds\" can be applied equally well to both single and double per¬\nforated stock, although it has particular significance only in the production of\nsingle perforated sound releases. This, of course, implies that similar considera¬\ntion must be given to the matter of typing the sound printing negatives which are\nused in exposing the film under consideration. Such identification is rather simple"
}