{
  "id": "d1176-9",
  "text": "-9-\nIn general, motion picture cameras designed for single sprocket operation, such as\nsimultaneous sound and picture taking devices, use nB Wind*’ stock* Kinescope record¬\ners and Auricon cameras fall into this category* On the other hand, most contact\nfilm printers, for example the Bell and Howell Model J, load with \"A Wind\" raw stock*\nWhere sound exposure and sound printing is not a factor, cameras and printers can\nusually be loaded with double perforated stock which, obviously, cannot be classi¬\nfied according to \"wind\" in light of its accepted definition*\nEmulsion Position—Standard and Non-Standard\nA person who has operated 16mm. projectors is likely aware of the fact that some\nfilms thread-up with the emulsion toward the screen while other films project with\nthe emulsion surface toward the lamp* The first of these positions (emulsion toward\nthe screen) is defined by the Society of Motion Picture and Television Engineers\nas nSTANDARD EMULSION POSITION\"; the latter (emulsion toward the lamp) is defined as\n\"NON-STANDARD EMULSION POSITION.\" In order to compensate for this slight change in\nthe focal plane of the emulsion image, it is usually necessary to change the focus\nof the projector lens a small amount to obtain maximum sharpness. Similar compensa¬\ntion for sound focus is desirable but must be effected by an adjustment of the tone\ncontrol, unless the projector is equipped with controls for the adjustment of the\nsound optical system. Inproper focus in the sound optical system results in the loss\nof high frequencies and impaired signal-to-noise ratio of the sound reproduction*\nThe differences in emulsion position result from the fact that in the contact print¬\ning of one film onto another the resulting impression is a mirror image of the origi¬\nnal rather than an identical image. This paradox can be illustrated very simply by\nhaving a person stand before a mirror and observing the reflected image. In such a\nsituation, when the subject moves his right hand, the image moves its left, etc.\nWhen contact printing from a negative film onto a print copy, it is necessary to\nhave the two emulsion surfaces facing each other in order to assure the maximum in\ntransmitted detail. Therefore the print copy becomes the mirror image of the nega¬\ntive/ in which case; left becomes right and vice versa, when the two films are com-.\npared symetrically and with their emulsions facing the observer. Should the origi¬\nnal and the copy be run consecutively through a projector, it would be necessary to\nthread up the latter in such a way that its emulsion would face in the opposite di¬\nrection from the former if one wishes to preserve the same \"left-to-right\" relation¬\nship of the projected image.\nSuch a switch is possible in the case of \"silent\" type 16mm. film where the double\nsprocket holes permit running the film in either manner* However, in the case of\n16mm. sound film, which utilizes only one set of sprocket holes, there is only one\nway in which to pass the film through the projector unless one runs the film \"tails\nfirst\" and thus produces an image and sound running in reverse order.’ Accordingly,\nthe proper \"left-to-right\" relationship must be established during processing and\nprinting operations in such a manner that normal projection is possible. These op¬\nerations may produce a print having either \"Standard\" or \"Non-Standard\" emulsion po¬\nsition, depending largely on the number of printing operations required to integrate\nvarious scenes and sound tracks into the desired release copy.\nIt seems obvious therefore that persons engaged in film processing and printing must\nascribe certain types of nomenclature to the inherent image relationships which exist\non the film being handled. Since the processing procedures in a single production\nmay involve several sound and picture printing operations on diverse film stock,\nstrict adherence to such uniform nomenclature and procedure is mandatory in order ...\nto eliminate prints in which words appear backward etc."
}