{
  "id": "d1708-0",
  "text": "Vol. Ill, No. 12X Dupont Circle Building, Washington 6, D.C. August 24, 19 62\nA PRELIMINARY DISCUSSION OF\nTHE EDUCATIONAL TELEVISION GRANT PROGRAM\n(Ed. Note - At the request of the NAEB, the following interpretive article on Federal\naid to ETV has been prepared by Dean W. Coston, designated as Dep. Asst, to the Secy.\n(ETV). It is hoped that this information will anticipate many of your questions and be\nhelpful to you if you plan to apply for a Federal grant. If you care to refer to the text\nof the law, it was reprinted in the Washington Report of April 2 0, 19 62 (Vol. Ill, No. 6).\nInterest in P.L. 87-447 and its opportunities for advancing the development of\neducational television has been high. The Department has had many inquiries of both\na general and specific nature which demonstrate that many organizations are prepared\nto apply for grant assistance at an early date.\nWhile the Department is moving rapidly in establishing a program, there are pro¬\nblems of administration and interpretation which must be worked out carefully in order\nto assure a fair and speedy distribution of funds, after they become available. (The\nlaw authorized the appropriation of $32,000,000 over a five year period. The Congress\nwill appropriate these funds on a year-by-year basis).\nThe legislation gave responsibility to the Secretary of Health, Education, and\nWelfare, and the administrative structure will provide program direction and coordina-\ntipn in the Office of the Secretary. Operational aspects of the program will be carried\nout in the Office of Education, where a considerable body of experience in the adminis¬\ntration of grants programs has been established. Several professional positions are\nbeing established within the Office to form a television unit which will prepare recom¬\nmendations for the consideration of the Commissioner of Education and the Secretary of\nHealth, Education, and Welfare, and to carry out the administrative duties required by\nlaw and regulations . Draft regulations, which will govern the operation of the program,\nare now being prepared by a special task group. Conferences and meetings are being\nheld with national organizations and associations, with the Federal Communications\nCommission, and with expert consultants .\nThe rules and administrative procedures will be established to carry out the intent\nof the Congress as expressed in the legislation and its history. The purpose of the law\nis “to assist (through matching grants) in the construction of educational television\nbroadcasting facilities.” In carrying out this purpose, the law describes general guide¬\nlines for the administration of the program. It establishes categories of applicants\neligible for consideration for grants, and broad objectives which will be circulated\nin regulations. It specifies maximum percentages of Federal participation in the cost"
}