{
  "id": "d1708-9",
  "text": "10\nUNIVERSITY OF MICHIGAN\nassignment, are not prepared and rehearsed for broadcasting. In\nother words, the listener is given an opportunity of hearing the\nrecitations of the students and the discussions of the instructor as\nthough no microphone were present.\nThis course will deal with the correct pronunciations, exact\nmeanings, and interesting derivations of the common words fre¬\nquently mispronounced, together with a similar consideration of\nthe more literary words and expressions in current usage which the\naverage vocabulary should include. Common errors in grammar\nwill be discussed and corrected.\nA pamphlet containing the twenty-one assignments will be\nmailed upon the receipt of six cents.\nDETROITERS AT THE U. OF M.\nThursdays, 12:45-1:00 p.m.\n(Over WMBC, Detroit)\nGossip concerning students from Detroit who are attending\nthe University of Michigan, with interviews with outstanding stu-\ndents. Prepared and presented by students enrolled in the classes\nin Broadcasting.\nLITTLE KNOWN FACTS IN AMERICAN HISTORY\nThursdays, 3:00-3:15 p.m.\nIn order to make available to teachers and students of history,\nas well as to the general public, the priceless source materials on\nAmerican history housed in the William L. Clements Library of\nthe University of Michigan, a series of fifteen-minute historical\nplays will be presented each Thursday afternoon from 3:00 to\n3:15 P.M.\nThe plan of the series is to dramatize a historical incident,\nthe anniversary of which occurs during the week that particular\nprogram is broadcast. In general the happenings so dramatized\nwill have occurred sometime during the period 1760 to 1790_the\nyears in which our country was spreading westward over the Alle¬\nghenies, winning its independence from Great Britain, and estab-\nlishing its own form of government. The anniversary aspect of\nthe programs will give them a certain timeliness and appropriate-\nness—and it is hoped that teachers of history in the junior and\nsenior high schools may be able to arrange for their classes to hear\neach week’s broadcast, co-ordinating their study with the program\nwhenever possible."
}