{
  "id": "d1008-109",
  "text": "Insert #2\nTHE OPERATION\nAt this writing the network is still required to\noperate on a \"bicycle\" basis. The equipment, tapes, and\npersonnel made possible by the Kellogg grant have\npermitted expanding this operation to a maximum degree.\nHowever, optimum service is not possible under a \"leg-\nbicycle\" system. There are too many possibilities of\nshipping errors, delays in the mail, and actual losses\nof tapes. l&x±xx8K±y Experience indicates that the\nmost effective operation is a direct two-way service\nwherein each station is supplied directly from headquarters\nwith its own copies of all programs. This is possible\nonly with a machine capable of duplicating tapes in mass\nvolume. Such a machine is now contracted for and will\nbe installed no later than July 1, 1952. Starting with\nthe programs to be issued in September, 1952 each\nstation will receive its own copy of all programs, and\nthe network will achieve the operating efficiency toward\nwhich it has been striving.\nThe network has acquired approximately 5,200 reels\nof recording tape. This quantity has made possible the\ncontinually expanding service. Tape supply has been one\nof the major chronic problems. This situation has not\nchanged. With the advent of direct headquarters-station\nservice the need for tapes will be increased. The only\nalternative to an increased tape supply is a reduction\nin the volume of programming distributed. At this time\nit is anticipated that approximately 10,000 fcx reels of\ntape will be needed to keep the network operating at\npeak efficiency.\nCONCLUSIONS\nThe NAEB Tape Network has achieved a position of eminence\nin the field of educational broadcasting. It is now\nenjoying a national, and even an international, reputation.\nIt is supplying a significant program service to the vast\nmajority of non-commercial educational stations in the\nUnited States. It is providing the residents of the major\npopulation centers with a truly alternative^adio service.\nIt is clear that this has been possible be&cuse of the\ngrant from the Kellogg Foundation. It would not have been\npossible^weather the early days of the operation without this\nhelp. It is equally clear that continuing support by the\nusing stations will be accomplished to a degree in excess\nof the most generous estimates."
}