{
  "id": "d1008-136",
  "text": "•5-\nThe sources of Network programs are increasingly becoming our own member\nstations. However, a great many program series have been contributed by such agencies\nas the American Foundation for the Blind, UNESCO, The American Society of Friends,\nthe Cooper Union Forum, and the Air Training Command. Some programs from the British\nBroadcasting Corporation have been distributed to NAEB stations, and Network Head¬\nquarters has been the traffic office, arranging for the distribution of many more\nhours of BBC programs directly to member stations. One series from Radio-Italiana\nand ten series from the French Broadcasting System were also broadcast by NAEB\nstations during 1953-54*\nThe acquisition of a second mass duplicator during this past year, through the\ngenerosity of a supplementary grant from the W. K. Kellogg Foundation, has made\npossible a considerable improvement in both quality and economy of operations. It\nis now possible to begin to shift emphasis from the mass service to a more individual\nservice aspect of its operation. The various stations, of course, find this arrange¬\nment much more satisfactory with the result .that Headquarter-station relations have\ngreatly improved.\nThe travel funds provided by the Kellogg Foundation have made possible five\nmeetings of the Network Manager with the Network Acceptance Committee, the In-School\nProgram Committee, and the In-School Program Sub-Committee. These meetings have\nresulted in refinement of program selection procedures and a revision of methods of\nprogram offerings and distribution.\nAll in all the NAEB Network is providing an essential service to the educational\nbroadcasting stations of America. Without the aid of the W. K. Kellogg Foundation\n^ this service, which 80# of all member stations list as the most essential of all\nservices which the NAEB provides them, would never have materialized or become a\nmodel for installations in many other parts of the civilized world.\nMuch has been done. But much still remains to do. The NAEB’s efforts to serve\nthe cause of education and its membership, providing wise and broad leadership and\nessential services to educational broadcasting throughout the world, will not be\nrelaxed, though it will obviously have to be adapted to the realistic conditions\nwhich will arise and prevail in so rapidly a changing picture as is the rule in\nwireless communications.\nThe job which the very wise planners who submitted the first project plans had\nthought could be done in five years, it is now obvious, is a job which will con¬\nsume far more time, and consume far more money and energy than was then thought.\nThis is a tribute to the importance of the general area in which the grant was made,\nas well as to the energy of the NAEB in opening it up. If support for somewhat\nmore than the five-year period originally considered as adequate is necessary, it is\nnot a result of a failure, but of a success. There have been many distractions\nand competing events to retard the development of that public sentiment and under¬\nstanding which must exist before educational broadcasting can exist without\nFoundation assistance. More organizations than the NAEB have found the past three\nyears full of energetic, uncontrollable forces. It is these forces, and the need\nto develop understanding and controls for them that makes the NAEB believe that its\nrole will continue to be an increasingly essential one to American and world\neducation."
}