{
  "id": "d1008-138",
  "text": "New York Television, January, 1954\nAn Interim Report\nThe analysis of the information collected in this, the fourth annual study\nof New York television, has been completed. The manuscript for the report of the\nstudy is now being prepared for publication. This brief report is intended to\nsummarize some of the more interesting findings and trends discussed at greater\nlength in the final report.\n1, Procedures in the 1954 Study,\nThe 1954 study had two goals not completely compatible in terms of their\nimplications for monitoring procedures, (l) Perhaps most important, the information\ncollected in this year’s study should be comparable with findings from previous\nyears, (2) The analyses of the findings should be completed and reported as\nquickly as possible to preserve their interest value and applicability.\nAll past procedures were therefore reviewed in an effort to select or revise\nthose which would insure comparability while facilitating analysis. In brief,\nthe following major changes over past procedures were incorporated in the 1954\nstudy:\n1) A minor revision of the program classification scheme was made. In the\nold classification scheme, many program classes were repeated to take into con¬\nsideration the intended audience of the program. For example, there were several\nclasses of drama programs, several classes of domestic drama programs, and\nseveral classes of children’s drama programs. This duplication resulted in a\nlengthy and unwieldy classification scheme.\nIn the new classification scheme, all such duplicated program classes were\nconsolidated. Then, as a separate piece of information obtained for all classes\nof programs, the apparent intended audience (i.e., general, domestic or children)\nwas noted during the monitoring of each program. Also, one or two new classes of\nprograms were added to correct shortcomings in the scheme noted during pretesting\nof procedures.\nEven with these revisions, the program classification scheme remains\nsomewhat unsatisfactory because the classes are not mutually exclusive. For\nexample, a program might provide orientation in the area of religion by presenting\nreligious information in the format of a drama. Such a program could be listed\nunder any of three program classes in the present scheme.\n2) Less information was collected. In past years, monitors were required\nto record much information that never found its way into a report* Consequently,\nthe monitors were less accurate in recording material that was used; e.g., five\nto ten per cent of primary advertisement time was missed in previous years.\nIn the 1954 study, the information to be reported was first selected, and then a\nlog sheet was designed upon which this information could be recorded efficiently.\nThis sheet collected ohly information to be used in the final report of the 1954\nstudy, a sample copy of this sheet appears at the end of this report.\n3) Monitors were given greater responsibilities. It was felt that greater\naccuracy of monitoring could be obtained by making as many decisions as possible\nduring the program. Then, if uncertainties arose, monitors and supervisors could\nconfer while the program in question was still before them. In this way, greater\naccuracy of program classification could be obtained than by making such decisions"
}