{
  "id": "d1008-139",
  "text": "-2-\ntenn planning needed for this project, however, and the fact that confer¬\nences are scheduled with other national organizations both at the end of\nJune and in October, which will bear on this problem, no specific request\nin this general area is made, beyond those items referred to immediately\nbelow.\nB. Special (limited) Publications and Promotion Budget Requests\n(1) General Statement: The quantity, quality and potential usefulness\nof many of the products of NAEB Kellogg-financed committees and studies\nhave outrun the NAEB’s budgetary and staff ability to edit, publish,\nand distribute them. Many materials have accumulated this year,\nawaiting editing and distribution; more will become available next yeai;\nas the results of various other committee projects (the Research Com¬\nmittee’s study and report on the Network’s operations etc.) begin to\nreach Headquarters.\nBecause of the NAEB’s inability to get these materials out rapid¬\nly and in attractive form, some of them (particularly in television),\nthough NAEB-produced, are beginning to appear under the labels of other\norganizations with more adequate publications budgets, generally also\nfrom foundation sources.\n(2) Specific items for which publication funds are requested;\n(a) Notebooks, dividers, folders, standard cover sheets, and\nheading paper (much as JCET uses for its various reports) to en¬\nable regular service distribution, on a loose-leaf basis, to mem¬\nbers, (non-recurring). $3,500.00\n(b) New Newsletter cover and back sheet, including new art work,\nprinting, and additional improvements in Newsletter format to\nmeet the needs of distribution in increasingly important circles\nin the U. S. and abroad, (non-recurring). #1,000.00\n(c) Publication and distribution of specific reports selected as\ndeserving a better format and wider distribution than present\nbudget permits. Except for those items indicated with an asterisk,\nwhich represent annual projects and needs for a two-year period,\nall are one-time requests intended to assist the NAEB in making\nthese many useful materials available in the many areas where they\nare urgently needed, and where they may help prevent the collapse\nof plans, hopes, or going activities, and contribute to greater\nefficiency and better informed educational broadcasting. In most\ncases these materials are the products of Kellogg-financed NAEB\nCommittee studies and investigations.\n(l) NAEB TV Operations Committee reports #2,000.00\n*(2) NAEB Engineering Committee reports 1,800.00\n*(3) NAEB Research Committee reports 3,500.00\n*(4) NAEB legal and rights service reports 1,100.00\n(5) Publication of Region VI Conference\nminutes (including speeches of Newburn,\nCastell, and others) 1,500.00\n(6) Publication of two Regional Con¬\nference minutes of next year at\n#1,500.00 3,000.00"
}