{
  "id": "d1008-140",
  "text": "As the largest single class of entertainment type program, drama continues\nto account for slightly less than half (46.4$in 1954; of all program time. Most\nsub-classes of drama show little change in per cent of total program time devoted\nto them, but comedy drama has shown a five per cent increase since 1953 and how\naccounts for eleven per cent of all program time.\nAmong the other classes of entertainment type programs, slight gains in\nper cent of total program time were made by music programs (6,7$ in 1954 vs.\n4.4$ in 1953), and personality programs (4.S$ in 1954 vs, 2.7$ in 1953). Fine\narts, quiz, stunt and contest programs, and variety programs remain essentially\nunchanged. As a total group, entertainment programs continue to account for\n77.7 per cent of total program time.\nOf the remaining 22.3 per cent of program time, 17.4 per cent is devoted to\ninformation type program and 4.9 per cent is given to orientation type programs.\nWithin these types, few major changes were found in per cent of total program\ntime accounted for by the various classes and subclasses.\nJn making evaluations of the significance of changes in programming, an\neffort was made to restrict attention to what appeared to be real trends rather\nthan fluctuations due to sampling. For example, minor changes among the various\ndrama classes were found, but it was judged that such changes could easily be\naccounted for by chance variations in the content of drama programs. After all,\na change of only sixty minutes of programming per station over a given week will\nbe reflected as a one per cent change in some program class. The importance of\nsuch minor changes was discounted.\nFigure 1 presents the relative amount of time devoted to the major types of\nprograms excluding primary advertising and public agency time# Figure 2 shows\nthe relative amount of time devoted to various classes of programs, including\nthe advertising and public agency time within them.\nOrientation\n4$\nPublic Agency\nAnnouncements 1$\n/ Information\n15$\n: Primary\nI Advertising\n13$\nEntertainment\nFigure 1: The \\\ncontent of New\nYork TV. (advertis-'\ning and public agency\ntime removed from en¬\ntertainment, information\nand orientation segments.) '\n67$"
}